{"id": 69519, "slug": "abc-jungle-find-the-same", "name": "ABC Jungle - Find the Same", "name_original": "ABC Jungle - Find the Same", "description": "Hey kids! Let’s find the same objects together! There are totally 50 different objects in this game and what you need to do is to find out a particular object pronounced and shown on the top. It may have 2 or 3 or 4 same object, i don’t know, just listen and see the instruction. That’s fine if you find the wrong object because you can hear the pronunciation of the object you tapped on, just find the correct one with the same pronunciation as the instructor pronounced at first. No mark or time will be deducted, because we encourage you to learn English!<br/><br/>Instructions<br/>&gt; Junior level: Listen to the pronunciation of object, find out the required amount of cartoon objects with the same pronunciation as pronounced\u2028&gt; Senior level: Listen to the pronunciation and spelling of the English word, find out the required amount of the particular object, don’t tap on other unrelated objects<br/><br/>Features<br/>&gt; effective English learning app with repetitive pronunciation on the same English word <br/>&gt; up to 50 different vocabularies (pronunciation, graphic &amp; spelling) can be learnt<br/>&gt; accurate and clear pronunciations by English native speaker<br/>&gt; beautiful and attractive user interface with relaxing background music<br/><br/>Kids, take a rest from a warrior who always fighting monsters. Let’s see how many English objects you can learn or you have already known out of all!", "metacritic": null, "released": "2014-08-07", "tba": false, "updated": "2019-10-22T14:03:49", "background_image": "https://media.rawg.io/media/screenshots/ad5/ad54d84420fde986ad437e387cdaf5c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YSD.hk"], "genres": ["Board Games"], "publishers": ["Yeung's Design Interactive"], "esrb_rating": "Everyone 10+"}