{"id": 695165, "slug": "brocante-coeurs-brises", "name": "Brocante & Coeurs Brisés", "name_original": "Brocante & Coeurs Brisés", "description": "Synopsis\r\n\n<p>Vous êtes un <strong>brocanteur</strong> au fin fond de l’Alsace-Lorraine. Hélas, si la vie n’était pas trop dur avec votre femme et vos deux enfants, votre père vient de tomber très malade. <strong>Vous êtes dans une course contre la montre pour gagner suffisamment d’argent pour le sauver.</strong><br/> \r\n\tVendez vos objets aux passants de ce village perdu mais prenez garde : votre réputation de brocanteur pourrait pâtir de vos actions.</p>\n\r\nPrincipe du jeu\r\n\n<p>Le joueur incarne un <strong>brocanteur</strong> qui dispose de 8 objets à vendre sur son étal qu’il a trouvé récemment. Divers personnages (4 à priori) vont passer devant son étal au cours de la semaine. Le brocanteur doit vendre un objet à chacun des personnages. Chaque personnage a sa propre backstory et un attachement émotionnel différent aux objets proposés.\r\n<br/>\r\nEn particulier, chaque personnage apprécie grandement un objet de l’étal. Il se peut aussi qu’un client déteste un article pour des raisons personnelles. Une fois qu’un objet est vendu, il n’est plus disponible à la vente pour les futurs clients. Les paramètres du jeu varient en fonction des objets que l’on vend et du prix qu’on fixe aux clients.</p>\n\n\r\nContrôles :\r\n\n<p>Tout se joue à la <strong>souris</strong> !</p>", "metacritic": null, "released": "2021-11-13", "tba": false, "updated": "2021-11-15T06:56:07", "background_image": "https://media.rawg.io/media/screenshots/6ee/6eec30bb7309cf59c5ea8a550c700472.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BiscuitPrime", "Sulray", "Flegmatik_surf", "Alshkor", "Mathxxl"], "genres": [], "publishers": [], "esrb_rating": null}