{"id": 695287, "slug": "grenadate-fire-in-the-heart", "name": "Grenadate: Fire in The Heart", "name_original": "Grenadate: Fire in The Heart", "description": "<p><strong>GrenaDate: Fire in The Heart</strong>, is a visual novel game made to commemorate the 1 year anniversary of Nijisanji ID 5th wave, <strong>53Renade</strong>. The game was developed by the fans (<strong>Grenades</strong>) as a gift to Reza Avanluna, Derem Kado and Nagisa Arcinia for all the happiness they have brought to our lives over the past year.</p>\n<p>[Developer's notes]</p>\n<p>[1 EN] This game is using free to use assets we found in some sources and also some stuffs we made by ourselves.</p>\n<p>[1 ID] Game ini menggunakan aset-aset yang dapat bebas digunakan yang kami temukan dari beberapa sumber dan juga ada bagian-bagian yang kami buat sendiri.</p>\n<p>[2 EN] Before you play this game publicly, we suggest you to try to saving the game in an empty slot and do overwrite save to avoid possible error.</p>\n<p>[2 ID] Sebelum memainkan game ini secara publik, disarankan untuk mencoba<em> save</em> di slot kosong dan <em>overwrite save </em>terlebih dulu untuk menghindari terjadinya kesalahan.</p>\n<p>[3 EN] In the folder after you downloaded it, there'll be 2 type of files. The file with \"32\" was made for OS 32 bit and so on.</p>\n<p>[3 ID] Di dalam folder setelah diunduh akan ada 2 tipe file. File dengan imbuhan 32 dibuat untuk pengguna OS 32 bit dan seterusnya.</p>\n<p>Other developer's notes are listed in the twitter account (www.twitter.com/Grenade53_2434).</p>\n<p>Have fun playing, Grenades!</p>", "metacritic": null, "released": "2021-11-13", "tba": false, "updated": "2021-11-15T07:27:42", "background_image": "https://media.rawg.io/media/screenshots/18d/18dedce67cc779f6f787065e7d35bcdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Grenade_53"], "genres": [], "publishers": [], "esrb_rating": null}