{"id": 695307, "slug": "clockfights", "name": "ClockFights", "name_original": "ClockFights", "description": "<p>You're a clock that is trying to refill its battery and get back the other stolen batteries but  the only thing you're allowed to do is...TYPING commands because it's a text-based game made in a 48 hours game jam and submitted on a rainy day!</p>\n<p>THE WHOLE GAME IS CASE-<strong>IN</strong>SENSITIVE</p>\n\n<strong>COMMANDS/GAMEPLAY:</strong>\n<p>Commands are the player's way of navigating this game and can be used at certain situations.<br/></p>\n<p><strong>IN-BATTLE:</strong></p>\n<p><strong>ATTACK </strong>command is used to attack enemies by writing their names afterward. Example:</p>\n<p>Attack enemyNameA (Enemies will have A,B or C on their names when there are duplicates of them and the player have to type these suffixes for the command to execute).</p>\n<p><strong>DEFEND </strong>command is the player's way of defending against enemies' attacks. And can be used in 2 different ways: Either by typing DEFEND only which will make the player defend themselves for 5 seconds or by specifying how long to defend by typing a number after DEFEND (1 to 5 only any other number will be clamped). The latter is uncommon to use.</p>\n<p><strong>SUPER </strong>command can only be used when the super meter is filled (the red bar on top of the input field) by simply typing SUPER. The super bar is filled by successfully defending against enemy attacks that can be blocked. When executed, time will stop for 15 seconds in which the player will be able to enter as many ATTACK commands as possible (other commands will be counted BUT ignored). After the 15 seconds are up, only the correct entered ATTACK commands will be executed.</p>\n\n<p><strong>OUTSIDE BATTLES:</strong></p>\n<p><strong>MOVE </strong>command is the only way to move forward in the dungeon, it can be used by typing MOVE and the letters displayed in front of the player in the right order.</p>\n<p>START command is used to start the game and cannot be used anywhere else. Simply type START.</p>\n<p><strong>RETRY </strong>command is used when the player has ran out of battery and at the gameover screen or when the game is cleared. In both cases, it will restart the game and cannot be used any other time for now.</p>\n\n<p><strong>NOT REALLY A COMMAND:</strong><br/></p>\n<p><strong>YES/NO</strong> are not commands but are used to answer the tutorial question to actually do the tutorial or skip it and should change later. (That's why if you type it when asked you'll notice the same sound for wrong input is played).</p>\n\n\r\nCONTROLS\r\n<p>Keyboard to type with and a Mouse.<br/></p>\n<p><strong>Keys with special functionalities:</strong></p>\n<p><strong>UP arrow</strong>: clears everything written in the input field.</p>\n<p><strong>Left SHIFT</strong>: speeds up the game x6. (Cannot be used when the super command is executing).</p>\n<p>NOTE:  CTRL+V is disabled to not allow pasting but if you find a way around it don't cheat and tell me about it instead!</p>\n\n<strong>CREDITS</strong>\n<p>Programming, art, mechanics, story and dialogue: Team UnderConstruction <br/></p>\n<p>audio made with https://sfbgames.itch.io/chiptone<br/></p>\n<p>  BGM: https://florianstracker.itch.io/the-heros-path-free-16bit-adventure-game-music</p>", "metacritic": null, "released": "2021-11-13", "tba": false, "updated": "2021-11-15T07:33:41", "background_image": "https://media.rawg.io/media/screenshots/0d8/0d8d48b83a169e35180195ee143969c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UnderConstructionDev"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}