{"id": 695556, "slug": "book-hunter-wolfgamesita", "name": "Book Hunter (WolfGamesITA)", "name_original": "Book Hunter (WolfGamesITA)", "description": "<p><strong>ITA</strong></p>\n<p><strong>ATTENZIONE</strong> - solo la versione DEMO di Book Hunter è ad oggi disponibile. La DEMO ha funzione di OPEN BETA ed è in costante aggiornamento.</p>\n<p>In questa <strong>avventura stealth in terza persona</strong> dovrai aiutare ArgentoBOT ad esplorare una biblioteca abbandonata per raccogliere i tesori che vi si nascondono. Con <strong>più di cento collezionabili</strong> e diversi nemici che si nascondono nell'ombra, l'esperienza di <em>Book Hunter - Caccia al libro</em> oscilla dall'avventura allo stealth, dalla strategia all'horror, ma <strong>senza mai abusare della violenza o della paura </strong>come meccaniche principali di gioco.</p>\n<p>Le unità ArgentoBOT sono automi scout il cui compito è <strong>viaggiare nello spazio e raccogliere reliquie dell'antica civiltà umana</strong>. Essendo disarmati, devono utilizzare le risorse ambientali per farsi strada attraverso i pericoli delle rovine e raccogliere tutte le opere d'arte sopravvissute: <strong>i libri sono gli obiettivi più importanti</strong>, ma anche quadri e musica destano grande interesse archeologico.</p>\n<p>Il giocatore potrà scegliere tra confrontarsi direttamente con i nemici oppure nascondersi e studiarne il percorso evitandoli. Lo scopo principale è la raccolta degli oltre trenta libri disseminati nella mappa in maniera casuale. Tutte <strong>le risorse collezionabili secondarie appartengono al Pubblico Dominio</strong> in quanto uno degli scopi di <em>Book Hunter - Caccia al libro</em> è la trasmissione della cultura libera oltre a quello all'intrattenimento. I libri presenti nel gioco sono invece inseriti a scopo promozionale dalla casa editrice italiana <em>Argentodorato Editore</em>.</p>\n<p>CONTROLLI</p>\n<ul><li>WASD - movimento</li><li>E - raccogli oggetti e interagisci con l'ambiente</li><li>CLICK SINISTRO - tieni premuto e rilascia per lanciare un oggetto</li><li>CLICK DESTRO - accendi e spegni la torcia</li><li>CLICK ROTELLA - avvia o ferma la musica</li><li>ROTELLA - alza e abbassa il volume della musica</li></ul>\n<p><em>BOOK HUNTER - CACCIA AL LIBRO  è un prodotto promozionale sponsorizzato da Argentodorato Editore di Ferrara.</em></p>\n<p>Argentodorato Editore – Labor limae</p>\n<p><strong>ENG</strong></p>\n<p><strong>WARNING </strong>- the only available version of Book Hunter is the DEMO version. The DEMO is an OPEN BETA and is updated often. The DEMO is only availbe in ITALIAN right now.</p>\n<p>In this <strong>third person stealth and adventure game </strong>you'll guide ArgentoBOT to explore an abandoned library to collect the treasures which are hiding inside of it. With <strong>more than 100 collectibles</strong> and many enemies crawling in the shadows, the experience of <em>Book Hunter</em> waves from adventure to stealth, from strategy to horror, but <strong>never abuses violence or fear </strong>as primary mechanics.</p>\n<p>ArgentoBOT units are mechanical scouts which objective is to <strong>travel across the universe and collect relics of the ancient human civilization</strong>. As they are unarmed, they have to use what they find on the spot to explore the ruins and collecting the survived artworks: <strong>books are the most important objects,</strong> but even paintings and music are of deep archeological interest.</p>\n<p>The player can choose between confronting directly with the enemies or studying their behavior to bypass them. The main objective is to collect the 30 books scattered in the map. <strong>All the secondary collectibles belongs to the Public Domain</strong> as one of the major purpose of <em>Book Hunter</em> is the transmission of freedom-culture in addition to entertaining. Books in the game are provided as a promotional service for the Italian publisher <em>Argentodorato Editore</em>.</p>\n<p>CONTROLS</p>\n<ul><li>WASD - movement</li><li>E - pick up object and use environment lights</li><li>CLICK LEFT - throw object</li><li>CLICK RIGHT - turn on and off the flashlight</li><li>CLICK WHEEL - start and stop the music</li><li>WHEEL - music volume up and down</li></ul>\n<p>PROUDLY MADE IN ITALY BY WOLF GAMES</p>", "metacritic": null, "released": "2021-11-12", "tba": false, "updated": "2021-11-15T08:50:56", "background_image": "https://media.rawg.io/media/screenshots/3a2/3a2619877b028c772557ca7e83eae926.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["WolfGamesITA"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}