{"id": 695561, "slug": "clipping-mask", "name": "Clipping Mask", "name_original": "Clipping Mask", "description": "<strong>Clipping Mask<br/></strong>\n<p>Clipping Mask is a 2D Puzzle Platformer in which the player must use a combination of movement skills, alongside the “Clipping Mask” ability in order to progress in each level. This skill allows them to copy properties from their environment and paste them into others, effectively altering the landscape to their advantage.\r\n</p>\n<p>Properties are represented through the usage of colour schemes which taint the interactable object (i.e platforms, obstacles, enemies and so on) in the environment. For example, blue coloured objects allow the player to stand on them, whilst red coloured objects kill the player on collision. <br/></p>\n\n<strong>Story:</strong>\n<p>You take control of a witty, world famous archeologist in his new venture to unearth a newly dug temple in the middle of the amazon forest. Always preferring to work alone, thinking himself above all others, our nameless protagonist braves forth the temple. Avoiding traps and crumbling platforms he eventually finds himself in a wide open room with a single pedestal in the middle. Atop this pedestal lies an odd looking mask. One with markings our protagonist had never seen before.\r\n</p>\n<p>Never one to leave potential riches and archeological finds behind, our protagonist doesn’t think twice before reaching for the mask. As soon as he touches it however, he feels a surge of power explode outward from the pillar as the mask starts floating above it. Giving him no time to react the mask dashes forward and latches itself into him as his vision goes dark.\r\n</p>\n<p>He wakes up in an estranged room and begins hearing voices in his head. The voice of the cursed mask. It informs him that the Clipping Mask, as dubbed by the ancients, was a powerful relic created by a civilization who used to rule the land surrounding the temple. But as more people sought to wield its immense power, it was locked away with a curse being placed on top of it, transporting any who dare reach for it deeper within the earth into a dangerous and secret temple. The mask also informs the player that with its power, the player is able to alter the properties of reality itself, shifting the behaviours of objects in the environment to his advantage. Now armed with knowledge, and the power of the Clipping Mask our archeologist must set out and escape the temple. <br/></p>\n\n<strong>Gameplay:</strong>\n<p>Move and platform your way through each level by jumping, dashing, wall jumping and wall sliding, whilst utilizing the Clipping Mask's power to solve puzzles. Using this power you can copy properties from objects in the environment and paste them into other objects, effectively altering the way they behave allowing you to progress, or creatively making the level easier for yourself.</p>\n<p>Each object in the level is colour coded in order to indicate its properties. The current colour scheme is as follows:</p>\n<strong>Blue</strong>Blue-tinted objects allow the player to safely stand on top of them. They also forcefully stop the object in place preventing its movement (if it had any to begin with).<strong>Green</strong>Green-tinted objects allow the player to safely stand on top of them. Unlike Blue-tinted objects, however, Green-tinted objects are allowed to move. Whether they do so or not, however, depends on the type of object it is (i.e if the object has any inherent movement patterns).<strong>Red</strong>Red-tinted objects instantly kill the player on touch, effectively resetting the level. However, they also destroy certain obstacles like rubble when in contact with.<strong>Purple</strong>Purple-tinted objects allow the player to pass through them as if they weren’t there. They also still reset the player’s dash.<strong>Orange</strong>Orange-tinted objects immediately rebound the player when they land on top of them, shooting them up higher than the player’s normal jump allows for.\r\n\n<strong>Controls:</strong>\n<strong>A</strong>Move Left<br/><strong>D</strong>Move Right<br/><strong>LShift</strong>Dash Horizontally<br/><strong>Spacebar</strong>Jump<strong>Holding A against a Wall  on the Left</strong>Wall Slide<br/><strong>Holding D against a Wall  on the Right</strong>Wall Slide<br/><strong>Holding A + Spacebar against a Wall on the Left</strong>Wall Jump<br/><strong>Holding D + Spacebar against a Wall on the Right</strong>Wall Jump<br/><br/><br/><strong>Mouse Movement</strong><br/>Move Clipping Mask's Power Area<br/><strong>Mouse Left Click</strong><strong> (No colour copied)</strong>Copies colour of hovered object<br/><strong>Mouse Left Click</strong><strong> (Colour copied)</strong>Pastes colour into hovered object<strong>Mouse Right Click</strong>Discards currently copied colour<br/>\n\n<strong>Credits:</strong>\n<ul><li><strong>Diogo Silva</strong></li><li><strong>Rui Melo<br/></strong></li><li><strong> Luís Silva</strong></li><li><strong>José Palha</strong></li></ul>\n<p>Sound effects obtained from ZapSplat\r\n    </p>\n<p>This game was developed for the <strong>Game Design Course</strong> @ <strong>Instituto Superior Tecnico</strong>\n<br/></p>", "metacritic": null, "released": "2021-11-12", "tba": false, "updated": "2021-11-15T08:52:21", "background_image": "https://media.rawg.io/media/screenshots/a7f/a7f520870612ea5626c014aba5dbd70a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FenixDS"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}