{"id": 695659, "slug": "chaosborn", "name": "Chaosborn", "name_original": "Chaosborn", "description": "<p>Chaosborn (version 02_03)</p>\n<p>The chaosborned hero awaken in dungeon. Try to explore some levels. In 4 level (final in this demo) you can found boss - Ghost.</p>\n<p>Hero can use unarmed magic strike (Shard) or equip magic weapons (Chaos Device or Wand). Chaos Device need energy for shots with chaotic effects (good or bad), based on collected sparkles. When Device full of sparkles, it will be transformed to parts of crystalls after some shots. Wand weapon allow to use weak Arcane Tear spell or more powerful Lightning or Fireball (both need crystall parts).</p>\n<p>When hero die, you continue game with another similar chaosborned (if you find capsule with him in dungeon earlier).</p>\n<p> Controls:</p>\n<p>WASD and arrows - move</p>\n<p>Space - shoot</p>\n<p>E - for action (take loot, open door, etc)</p>\n<p>1 and 2 - use potions</p>\n<p>T - on/off turbomovement</p>\n<p>/// /// ///</p>\n<p>Небольшой прототип рогалика. Герой пробуждается в подземелье и может пройти до 4-го уровня, где находится босс Призрак.</p>\n<p>Без оружия герой умеет стрелять простой магией, не требующей энергии. Оружие Хаоса тратит энергию на выстрелы, кроме того они обладают различными эффектами, постепенно проявляющимися и изменяющимися при накоплении искр, остающихся от врагов. Каждый ряд накопленных оружием искр формирует какой-то хаотический модификатор (удвоение выстрела, ускорение, удешевление, нанесение урона владельцу, поджог врага, и так далее). При наполнении Хаотического оружия искрами, оно превращается в кристаллы, спустя несколько выстрелов. Другой типа оружия - Жезлы - дают персонажу слабый магический выстрел или возможность кастовать молнию/файерболл (если есть соответствущие кристаллы, которые тратятся при этом).</p>\n<p>Если герой погибает, то игра продолжится за другого, похожего персонажа, если в процессе прохождения были найдены капсулы с телами.</p><p>Управление</p>\n<p>WASD и стрелки - движение</p>\n<p>Пробел - выстрел</p>\n<p>E - действие (взять предмет, открыть дверь и так далее)\r\n</p>\n<p>1 и 2 - использовать бутылки эссенции</p>\n<p>T - включить/выключить автобег</p>", "metacritic": null, "released": "2021-11-12", "tba": false, "updated": "2021-11-15T09:18:50", "background_image": "https://media.rawg.io/media/screenshots/721/7218da318f8e7f6e552e1e135f6dbab6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NoNsense"], "genres": ["Action"], "publishers": [], "esrb_rating": null}