{"id": 695629, "slug": "peace-none-in-three-research-centre", "name": "Peace (None in Three Research Centre)", "name_original": "Peace (None in Three Research Centre)", "description": "<p>'Peace' is a game that follows Peace and her brother, Michael, as they navigate a world seemingly destined to put them on the path to early marriage - whether they want it or not.\r\n</p>\n<p>This is a serious game designed as an intervention to tackle early marriage in Uganda. You will follow Peace as she struggles with the pressures of being pulled away from school, using a choice driven dialogue system to delve into the attitudes of those around her. Understand what drives people to enter marriage at an early age, and what can be done to prevent it, as you engage with characters of all walks of life. Will you make a change?\r\n</p>\n<p><strong>Features</strong>\n</p>\n<ul><li>Play as both brother and sister as they discover what the true impact of early marriage is and uncover the fate of their older sister.<br/><br/>\n</li><li>Take a journey across a village in Uganda in your search for help, visiting homes, a marketplace, and a school.<br/><br/>\n</li><li>See how the story unfolds across 5 Chapters of fully voiced dialogue and cutscenes.</li></ul>\n<p><strong>Minimum/recommended hardware specification</strong></p>\n<strong>CPU</strong><em>Ryzen 3500U (4 cores, 8 threads @ 3700Mhz) or equivalent</em><strong>GPU</strong><em>AMD Vega 8, GeForce MX150 or equivalent</em><strong>Memory</strong><em>8GB DDR4 RAM minimum</em><strong>Hard drive</strong><em>5GB free space</em><strong>Operating System</strong><em>Windows 10 installed</em>\n<p><strong>Educator, teacher or facilitator?</strong></p>\n<p>Please find the accompanying curriculum resources in the download section as a pdf file. If you have any feedback that you'd like to share with us it would be greatly appreciated and can be left via this Google Form.</p>\n<p><strong><em>Please Note</em></strong></p>\n<p><em><em>This ga</em>me was developed by the None in Three Research Centre, based on research with real survivors and perpetrators of gender-based violence in Uganda during 2018-19. The game is intended for use with young people aged 14-17 in a school or other facilitated educational setting. Being a serious game it deals with some sensitive and potentially upsetting themes. The game w<em>as evaluated through a trial with </em>Uganda<em>n young people in 2021 and was shown to have a positive impact on them. However if a young person is affected by the subject matter covered in this game please refer to the sources of support signposted at the start of the game</em><em>. For any general feedback we'd love to hear your thoughts </em>via this Google Form.</em></p>", "metacritic": null, "released": "2021-11-12", "tba": false, "updated": "2021-11-15T09:11:44", "background_image": "https://media.rawg.io/media/screenshots/491/4918071909ee8aad3e37cc2301d4fff8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["None in Three Research Centre"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}