{"id": 695886, "slug": "nevermore-the-chamber-door", "name": "Nevermore: The Chamber Door", "name_original": "Nevermore: The Chamber Door", "description": "Thank you for taking an interest in the project to the point of entering this Steam page. I'm Gabriel, the only developer in NEVERMORE: The Chamber Door. There is no team or publisher here, just me with a lot of work, effort and passion for what I am creating. It's been a challenging experience and putting Nevermore: The Chamber Door on your <strong>wishlist</strong> is a way of telling me that it is worth continuing to work on the project.<br/><br/><br/><br/><br/>In the poem The Raven by Edgar Allan Poe, the narrator is faced with a creature that enters his room and remains on the bust of Athena, goddess of wisdom, thus placing himself above reason and logic. The crow speaks only one word, \"Nevermore\", which the narrator interprets in different ways to answer his own questions.<br/><br/>In THE CHAMBER DOOR something similar happens, but before Athena a door opens, a portal to another world of creatures and demons of nightmares. While the dark-feathered raven contrasts with the marble of Athena, of light and darkness, life and death, our hero is taken by something above reason, making him enter that door with the certainty of the unknown.<br/><br/><br/><br/><br/><br/><br/>THE CHAMBER DOOR is a game of introduction to the NEVERMORE universe. You will be introduced to fluid combat mechanics and endless possibilities. Aggressiveness and agility is the basis of combat, you will be rewarded in a combos ranking system where your variety of blows is your greatest weapon, but beware, NEVERMORE contains dangerous creatures and any mistake can be your last.<br/><br/>As you progress through the game, you'll find exclusive charms to build your character according to your combat style. Each charm can bring new abilities, new mechanics or even improve your stats.<br/><br/>When passing through the CHAMBER DOOR you will face hordes of varied enemies in an arena system, at the end of each level you find a passage to proceed to the next one. As you defeat these hordes, you will eventually come across more powerful entities and stronger bosses.<br/><br/>If you fail and get defeated, you will return to the first level, however, in a roguelike system, you keep the souls you captured in your last adventure to evolve your charms through the statue of Athena, thus becoming stronger and more prepared to advance further more on your next try.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-19T04:06:29", "background_image": "https://media.rawg.io/media/screenshots/6bc/6bc28154101fd696ba7ff8b3acd8c03e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Burning Bright"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Burning Bright"], "esrb_rating": null}