{"id": 695835, "slug": "cactus-simulator-bofete-stories", "name": "Cactus Simulator - Bofete Stories", "name_original": "Cactus Simulator - Bofete Stories", "description": "<h3>How is the game?</h3>How much times in your life you wanted to touch or aggressively squeeze a cactus? If you wanted to squeeze it you probably wished pain, go search for a specialist, plz...<br/>Anyway...this game gives you the opportunity to click in a cactus. No pain, no worries, just non stopping clicks and gives you <strong> uncommon stories</strong> as reward<h3>Cactus?</h3>Yes. Cactus.<h3>Where?</h3>The <strong>Bofetes Island</strong> is a new world Pangea. Delivered by animals of various species over the centuries, all the island suffered great structural thumps after the animal great war, in which the monkeys was extincted, the moles suffered gentrification and the fishes declared cold war. Despite that, at momento Bofetes is a pacific Island, although with tension and an <strong>indescritible vibe</strong> although I am trying to describe. The Island is composed by various cities with Bofete names: Great Bofete, Little Bofete, West Bofete, Bofete way, Deep Bofete (You understood)... and also has Biru-Biru and Rachlov that are emancipated. This <strong>incredible local</strong> is the house of our cactuses, the main botanic cultivation in this world and the houses of our simples partners.<h3>Alone?</h3>This act follow <strong>Sandra</strong>, the party llama; <strong>Carlos</strong>, the wandering mole beggar and <strong>Joaquim</strong>, a Racoon that is curiously playing a game very similar to this in his Vatari. We achieved to documentate a bit of their lives after the last CENSUS, realized in the Bofetes Island.<h3>Why?</h3>Because you probably has <strong>free time</strong> to spend and want to do something that don't request much mental effort. Your fingers will feel some pain but that's all.<h3>Features</h3><ul><li>Discover the stories of the Bofetes Island</li></ul>[/b].<br/><li>3 cute cactus species with peculiar owners. <br/></li><li>Achievments for you to unlock <strong>clicking</strong> or using an auto-clicker (we know).<br/></li><li> Click all you want <strong>without hurting your fingers</strong>, your assistant will wear gloves and no animal was was injured to make this game. <br/></li><li>Learn ( if we can call this a learning process) about cactus and their life.<br/></li><li>Steam cloud save</li>[/list]", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-19T03:22:18", "background_image": "https://media.rawg.io/media/screenshots/92b/92bec3fbe9b661d12f4607a6257317eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dreamlike"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Dreamlike"], "esrb_rating": null}