{"id": 695803, "slug": "myth-of-empires", "name": "Myth of Empires", "name_original": "Myth of Empires", "description": "<p>Respawning in the ancient eastern continent devoured by the flames of war, you will try all means to rise from zero to hero in this open world of the sandbox. Survive the harsh environment, build your homeland, raise your army, and vanquish your foes on the battlefield. Through various gameplay, you can win the honor. Besides, you can form a team with friends, rampage on the massive battlefield, and build your glorious empire!<br />\nExplore the Eastern Continent<br />\nStreams flow gently down the valley; mountains rise proudly from the ground. Clouds come down, and drizzle descends; twilight merges, and a long night begins. Unruly soldiers shall be ruined; haughty hunters could be hunted. The state of the battle is unpredictable like the weather, and no one can prevail forever. All of these happen in the 64 kilometers’ simulation world; come to explore before it’s too late!</p>\n<p>Create Everything from Scratch<br />\nCraft your armors to wear, sow your seeds to reap, tame your horses to ride, and summon your followers to fight. This sandbox adventure empowers you with total freedom to bring your creativity and imagination into full play.</p>\n<p>Start your Epic Journey<br />\nInterested in bitter hand-to-hand combat? More than one hundred weapons are at your command—— Choose your favorite and fight your way out!!Facing a city that refuses to surrender? A variety of ingenious siege weapons are waiting for your order——Put out the best formation and smash their doors open.<br />\nHarassed by an enemy from farther away? Show your deep understanding of logistics, and an army marching on its stomach is sure to beat the hungry.<br />\nBe you a charging warrior, a resourceful commander, or a charismatic leader; this true-to-life ancient battlefield is yours.</p>\n<p>Write your Own Legend<br />\nYou have 16 stairs climb to nobility, 25 developing directions to proceed, hundreds of achievements to claim, and arts of war to grasp. Do you want to be a bloodthirsty warlord —— slaughter enemies and annex their field, expand your territories and take the crown？Or a peaceful master—— plant seeds and harvest your pleasure, create buildings and embrace the wonder？<br />\nWhatever you want to be, Myth of Empires has everything prepared for you.</p>\n<p>Rebuild a Thriving World Together<br />\nBuild a guild and fight shoulder to shoulder with your friends to defeat the invaders; form alliances with other guilds to gain mutual benefit and expand your territories. Your membership management and diplomacy will determine how far ahead your guild can go.</p>", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2023-01-15T19:10:23", "background_image": "https://media.rawg.io/media/screenshots/f54/f542bfb17d10a6da890ecea7538ee5c5.jpg", "website": "http://www.mythofempires.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 29, "toplay": 6, "dropped": 3, "playing": 1}, "playtime": 11, "achievements_count": 94, "ratings_count": 4, "suggestions_count": 463, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Angela Game"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Massively Multiplayer", "Indie"], "publishers": ["Antiidelay"], "esrb_rating": null}