{"id": 695851, "slug": "destinys-plan", "name": "Destiny’s Plan", "name_original": "Destiny’s Plan", "description": "Destiny's Plan is a game with a deep plot based on human relationships and love.<br/>\n<br/>\r\nStory:<br/>\r\nIn addition to deep depression, you are in the cyberpunk future, where you can travel in time, drive to the moon by school bus, learn about the existence of pink aliens, and much more.<br/>\r\nYou live with your blind grandfather, but trying to take care of him - you stumble upon criticism. How best to deal with him is for you to decide.<br/>\r\nAfter meeting classmates, in a new educational institution, by a ridiculous coincidence, you get to the hospital, but contrary to fate - rejoicing in this, you begin to live in a new way. You spend time in the company of friends, get a common hobby, and of course get involved in trouble. But falling in love with your new friend, unfortunately, you can't remember one important thing.<br/>\n<br/>\r\nWill you understand what you have forgotten?<br/>\n<br/>\r\nGameplay:<br/>\r\nThis visual novel is a subspecies of a text quest, in which the viewer is shown the story using the display of text, static images, as well as sound and music. At a certain moment, you will need to make a choice, in particular, to choose the answer option in the dialogue.<br/>\n<br/>\n<br/>\r\nKEY FEATURES:<br/>\n<br/>\r\n1) Unique plot.<br/>\r\n2) Original, atmospheric soundtrack.<br/>\r\n3) Rapid development of the plot, without fillers and wasting time.", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2021-11-19T03:34:53", "background_image": "https://media.rawg.io/media/screenshots/693/69372417209ce18b3b71264895a7b566.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Carel"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Carel"], "esrb_rating": null}