{"id": 6959, "slug": "angry-birds-star-wars-ii", "name": "Angry Birds Star Wars II", "name_original": "Angry Birds Star Wars II", "description": "<p>The Force is strong with this one. Get ready for Angry Birds Star Wars II – the epic follow-up to the #1 smash hit game! Based on the Star Wars movie prequels, use the Force for good against the greedy Pork Federation or choose a much darker path. That’s right; for the first time ever you can “Join the Pork Side” and play as the fearsome Darth Maul, Emperor Palpatine and many other favorites!</p>\n<p>JOIN THE PORK SIDE! For the first time ever play as the pigs! Wield Darth Maul’s double-bladed Lightsaber, or play as Darth Vader, General Grievous and other villains!</p>\n<p>30+ PLAYABLE CHARACTERS! Our biggest line-up ever of playable characters – Yoda, pod-racing Anakin, Mace Windu, Jango Fett and many more!</p>\n<p>TELEPODS! A groundbreaking new way to play! Now teleport your favorite characters into the game by placing your Angry Birds Star Wars Telepods* figures on your device’s camera!<br />\nBECOME A JEDI OR SITH MASTER! So many Bird and Pork Side levels to master, plus a bonus reward chapter and a ton of achievements to unlock!</p>\n<p>SWAP CHARACTERS AS YOU PLAY! Switch characters in the slingshot at any time – yours to earn or purchase!</p>\n<p>ToonsTV READY TO GO! The home of the hugely popular Angry Birds Toons animated series, plus many other top-quality videos!<br />\nFollow @angrybirds on Twitter<br />\nWatch the videos, read the comics and submit fan art at angrybirds.com/starwars<br />\nLike us at facebook.com/angrybirds and say hello!<br />\nTerms of Use: https://www.rovio.com/terms-of-service<br />\nPrivacy Policy: https://www.rovio.com/privacy<br />\n*Availability varies by country. Angry Birds Star Wars Telepods sold separately and are compatible with select mobile devices.<br />\nImportant Message for Parents<br />\nThis game may include:<br />\n- Direct links to social networking websites that are intended for an audience over the age of 13.<br />\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.<br />\n- Advertising of Rovio products and also products from select partners.<br />\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.</p>", "metacritic": 77, "released": "2013-09-18", "tba": false, "updated": "2024-03-08T11:34:14", "background_image": "https://media.rawg.io/media/screenshots/de0/de02a39745297830f95e65a5559b2bfb.jpeg", "website": "http://www.rovio.com", "rating": 4.05, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 8, "beaten": 17, "toplay": 3, "dropped": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 18, "suggestions_count": 199, "game_series_count": 18, "reviews_count": 19, "platforms": ["Android", "iOS"], "developers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Rovio Entertainment", "Rovio Entertainment Oyj"], "esrb_rating": "Everyone"}