{"id": 695969, "slug": "cube-match-triple-3d-puzzle", "name": "Cube Match Triple - 3D Puzzle", "name_original": "Cube Match Triple - 3D Puzzle", "description": "Cube Match Triple is a relaxation 3D match game. You can tap and match tiles with swipe to rotate 360 degrees the cube match identical tiles to complete levels. Solve 3D puzzle boards with quick thinking and smart moves to get to the next level.<br/><br/>Let’s play tile master match and craft your skill to become a match master!<br/><br/>How To Play<br/>Simply find and choose 3 same 3D tiles<br/>Swipe to rotate the 3D Cube<br/>Don’t fill up a collection bar<br/>Use the boosters to help you merge those tiles faster and pass tricky levels <br/>Match tiles as quickly to clear all 3D tiles before the time runs out!<br/>Pause it whenever you want, and continue anytime with the auto-saving system<br/><br/>Features:<br/>Many colorful 3D objects &amp; shapes, such as: candy crush, cute animals, cool toys, exciting emojis, appetizing food, fruits, ball, bubble and more exciting objects<br/>Easy and fun to play, challenge mastery<br/>The game has tons of challenging well-designed levels to train your brain<br/>Free to play for adults and kids at the same time!<br/><br/>Enjoy Cube Match Triple now and collect endless fun! <br/>Download this free puzzle game today and Challenge yourself!<br/><br/>if you have any questions or concerns, please do not hesitate to contact us: support@lihuhugames.com", "metacritic": null, "released": "2021-10-23", "tba": false, "updated": "2021-11-19T05:10:41", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b815c030719e25cfe20a9ef1949e73a_uDPcUdW.jpg", "website": "http://lihuhugames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LIHUHU PTE"], "genres": ["Board Games", "Puzzle"], "publishers": ["LIHUHU PTE"], "esrb_rating": "Everyone 10+"}