{"id": 695934, "slug": "the-madhouse-gan-ran-wu-fu", "name": "THE MADHOUSE | 感染屋敷", "name_original": "THE MADHOUSE | 感染屋敷", "description": "For those of you who are hungry for survival horror.<br/>Welcome to the new world of survival horror, where the elements of survival horror are fused together.<br/><br/>THE MADHOUSE | Kansen Yashiki is a survival horror game where you try to survive from an abandoned house.<br/>This game is inspired by Japanese horror games such as \"Resident Evil\" and \"SIREN\".<h3>■Overview</h3>Survival from extreme conditions in a closed space.<br/>This is survival horror at its best.<br/><br/>It's a game that combines the elements of survival horror: Fear, Stealth, Exploration/Puzzle solving, and Item management.<br/>This is the \"all-inclusive\" game experience that packs in all the elements of survival horror.<br/><br/>The \"Multiple First-Person Views\", which is a feature of this game, will bring a new level of fear, immersion, and strategy to survival horror.<br/><br/>Will you be able to survive from the closed and abandoned house?<h3>■STORY</h3>As a new virus spreads across the world.<br/>In the suburbs of Westbridge City, there have been a series of disappearances.<br/><br/>The protagonist slips and falls while hiking in the mountains outside Westbridge and loses consciousness.<br/>When he wakes up, he finds himself in the courtyard of an abandoned house.<br/><br/>What awaits the protagonist in the abandoned house?<br/><br/> <h3>■Multiple First-Person Views</h3>Subjective gameplay that elicits fear.<br/><br/>The view you can see is not only that of the main character.<br/>You can see the view of \"something\" lurking in the abandoned house.<br/><br/>The \"Multiple\" viewpoints create an even more terrifying and immersive experience.<br/><br/>[Main Character's View]<br/><br/><br/>[Enemy's View]<br/> <h3>■Random Roaming (Random enemy wandering)</h3>Enemies' roaming routes are not necessarily constant.<br/><br/>The randomness of roaming makes enemy behavior difficult to grasp.<br/>Enemy behavior that changes according to the player's actions and story progression.<br/><br/>In the abandoned mansion, you cannot allow yourself to be distracted from start to finish.<h3>■Multiple Endings</h3>The ending will change depending on the player's actions.<br/>Will you be able to find a route to survival?<h3>■Fear</h3>A deformed creature lurks in an abandoned mansion.<br/><br/>Fear of confronting the enemy in an enclosed space.<br/>Fear that you can only escape.<br/><br/>And the fear is accelerated by the ability \"Steal Eyes\" to see the vision of others.<br/><br/> <h3>■Stealth</h3>It is impossible to survive unless you use \"Steal Eyes\" to see the vision of creature and act without being detected.<br/><br/>It is also useful to find a place to hide and lay low.<br/><br/>Creatures also have a sense of hearing and will react to footsteps and doors opening and closing.<br/><br/>You need to act in such a way that they cannot see you or hear you.<br/><br/> <h3>■Exploration / Puzzle Solving</h3>The stage of this game is a closed abandoned house.<br/><br/>You must explore every corner of the abandoned mansion to obtain items and solve various mysteries.<br/><br/> <h3>■Item Management</h3>There is a limit to the number of items a player can carry.<br/>The player must decide what items to carry and what items to leave behind, and act efficiently.<br/><br/>There is also a limit to the number of consumable items, such as healing potions, that can be obtained.<br/>It is also important to conserve the consumable items.<br/><br/>There are also items that can be used to resist the enemy or create diversions.<br/>You must make full use of a variety of items to escape from this extreme situation.<br/><br/> <h3>■Amplification of fear and immersion through sound</h3>The effective background music and 3D sound amplify the sense of fear and immersion.<br/>For those who want to enjoy the horror atmosphere, it is recommended to darken the screen and use headphones so as not to feel stressed.<h3>■Multiple Difficulty Modes</h3>This game has multiple difficulty modes (EASY, NORMAL, HARD, MAD), which differ in terms of enemy strength and the number of items available for consumption.<br/>MAD mode is a high difficulty mode where you will die instantly if you are attacked by an enemy. If you want to challenge the true horror of the game, please try it.<br/><br/><h3>■Play Time</h3>Depending on the player's skills and actions, it will take at least 3 - 4 hours to clear the game on the first play through.<h3>■Steam Achievement</h3>This game supports Steam Achievements.<br/>Steam Achievements range from easy to difficult, so you can aim to complete them or enjoy tie-up play.<h3>■Live game video streaming and monetization</h3>Live game videos are welcome. Monetization is not a problem. <br/>The developer of this game, PIYOSHI, loves watching horror games in action, and is always entertained by those who do.<br/>We'd love to see you do the same for this game.<h3>■Sharing information among players via Twitter</h3>When tweeting about this game on Twitter, please use the hashtag <strong>#MadKansen</strong> . It will be more fun if you can share information among players such as impressions of this game and live game video streaming. Please use the hashtag if you like.<h3>■About option settings</h3>This game is operated using the keyboard and mouse. The key assigned to each action can be changed to any key on the options screen. In addition to the key settings, screen brightness, mouse sensitivity, volume settings, and graphics settings can be customized to suit the player's environment. Please play with the settings you prefer.<br/><br/><br/>In the system requirements, we have listed the graphics as \"NVIDIA GeForce GTX 970\", but it may work with a lower specification. If the game is too slow, please adjust the graphics settings.<br/><br/> <h3>■Note on Language Switching</h3>This game is available in English, Japanese, and Simplified Chinese.<br/><br/>Depending on the language you use, please set the language settings for this game in the Steam client as follows.<br/><br/><ul><li>Using English: Any language setting is fine.<br/></li><li>Using Japanese: Set to a language <strong>other than</strong> Simplified Chinese.<br/></li><li>Using Simplified Chinese: Set to Simplified Chinese.</li></ul>", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2021-11-19T04:41:59", "background_image": "https://media.rawg.io/media/screenshots/34d/34dc516173e50db8717e9291fd290d41.jpg", "website": "https://sites.google.com/view/the-madhouse", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PIYOSHI CREATIVE STUDIO"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["PIYOSHI CREATIVE STUDIO"], "esrb_rating": null}