{"id": 695919, "slug": "laypo-country-simulator", "name": "Laypo Country Simulator", "name_original": "Laypo Country Simulator", "description": "<strong>'Laypo Country Simulator'</strong> is a game developed by Lewibie. <br/>The goal of the game is to survive as the mayor of a country. . <br/>The current features include:<br/><strong>BE THE MAYOR!!</strong><br/>Be the mayor of your OWN NATION, from looking after the needs of the citizens to politics (coming in the future), transport, relations with other nations etc<h3>Weather</h3>The weather in the game changes on an in-game daily basis, from Storms, flooding rains, sun, clouds. These in game weather features influence others features within the game such as floods, droughts, fires, water storage etc<h3>Water</h3>Dams hold water for your citizens and is influenced by weather and special technologies. Make sure you don't run out of water though as you could lose that way!!<h3>Interests</h3>Each resident have their own interest in sports and animals, make sure you fulfil their needs as that could influence the countries happiness levels.<h3>Wars</h3>At the moment there is only wars with local tribes which only have a 4% chance to happen every day!, Make sure you buy defences so you don't get wiped out!!<br/><br/>A lot more other features are also added such as:<br/>- Fires<br/>- Fire Ratings<br/>- Pets<br/>- Agriculture<br/>- Research<br/>- Tourism<br/>- Diseases<br/>- Emergency Services<br/>- The list goes on!!", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2021-11-19T04:31:39", "background_image": "https://media.rawg.io/media/screenshots/fc2/fc20b51121555ab2d673ca8008f87ca9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lewibie"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Lewibie"], "esrb_rating": null}