{"id": 695991, "slug": "bloxels-build-your-own-games", "name": "Bloxels: Build Your Own Games", "name_original": "Bloxels: Build Your Own Games", "description": "Anyone can make a video game with Bloxels, no coding required.<br/><br/>YOUR CHARACTERS: Bring your own pixel art characters to life. Give them special powers in the Character Lab. Customize power-ups to change their size, speed, and abilities.<br/><br/>YOUR ART &amp; ANIMATIONS: Create your own pixel art to decorate your game worlds, or start by customizing free-to-use assets, including pirates, ninjas, and even pigeons. Export your art to share it as a GIF!<br/><br/>YOUR GAMES: Build top-down adventures or side-view platformer games, without any code. Configure everything about your games with simple but powerful behaviors and blocks. Blocks include terrain, hazards, enemies, collectibles, liquid, power-ups, action blocks, and story blocks for adding dialogue. Create logic puzzles with doors and keys, triggers, and more.<br/><br/>THE ARCADE: Publish your games to the Bloxels Arcade, and share the link with the world to promote your game.<br/><br/>PLAY FOR FREE: Play any Bloxels game in the Arcade for free. Purchase a Bloxels subscription to start building and publishing your own games. A Bloxels account code is included in the Official Bloxels Build Your Own Video Game Kit. For more information go to playbloxels.com.<br/><br/>Bloxels &amp; Education: Are you an educator? Bloxels EDU plans include added features and resources specifically for education. Educator plans include access to the EDU Hub, where you can see and showcase student work, and access resources, including standards-aligned activities across subjects and grade levels K-12. Learn more at edu.bloxelsbuilder.com", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2021-11-19T05:22:13", "background_image": "https://media.rawg.io/media/screenshots/a74/a740f3f9533d7e0662b07d0aceca4921_xFS0b4T.jpg", "website": "http://www.bloxels.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixel Press Technology"], "genres": ["Adventure", "Simulation", "Educational"], "publishers": ["Pixel Press Technology"], "esrb_rating": "Everyone 10+"}