{"id": 696170, "slug": "augmented-future-itch", "name": "Augmented Future (itch)", "name_original": "Augmented Future (itch)", "description": "<p>Activate your augmented reality by entering a futuristic world of fantasy. Keep the world alive by fighting monsters and protect the people by taking down the bandits. Explore a world you've never seen before in a way you've never seen before.  \r\n</p>\n<p>Timed Turn Based Battles!</p>\n<p>Choose how and where you want to attack the enemy while facing the clock. Be careful which strategy you choose because once you've started committing to an attack there's no going back! The enemy won't sit there and let you do what you want! </p>\n<p>Adventure and Exploration!</p>\n<p>Uncover new locations and meet new people as you explore a totally original world by navigating the world interface!</p>\n<p>Keep Your Senses Awake!</p>\n<p>Traps and enemies could be hiding anywhere. Make sure you're ready to react at all times with quicktime events!</p>\n<p>Upgrade and Train To Become Stronger!</p>\n<p>Pay trainers to strengthen your skills and equipment in order to best stronger enemies!</p>\n<p>The combat in this game is turn based but it is also fast paced and can be intense. You must make decisions with limited time and some mistakes can not be undone. You must remain focused. </p>\n<p>You have a cybernetic implant which allows you to interact with the world in a futuristic way. Yet, you are thrust into a fantasy world full of magic and bandits. Experience a fine blend of the future and the romanticized past coming together. Think of it as the Elder Scrolls fused with Cyberpunk 2077, in text.</p>\n<p>This game is my attempt at taking a vision for a big budget role playing game and whittling it down to only text.</p><p>IF ANYTHING GOES WRONG SOMEHOW OR IF YOU SIMPLY CAN'T BE BOTHERED TO AFFORD THE GAME BECAUSE OF TOUGH VIRUS RELATED CIRCUMSTANCES EMAIL ME: jamchu9@gmail.com<br/></p>", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2021-11-19T06:13:42", "background_image": "https://media.rawg.io/media/screenshots/2f8/2f8ff28a392075ab201bde2aecd93169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SpicyNoodleStudios"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}