{"id": 69639, "slug": "a-haystack-jump-pinky-pigs-big-shot-day-at-the-far", "name": "A Haystack Jump - Pinky Pig's Big Shot Day at the Farm Free", "name_original": "A Haystack Jump - Pinky Pig's Big Shot Day at the Farm Free", "description": "Pinky Pig's hungry and on a mission to find her most favourite food, which is, well everything!! Jump, bounce and boing your way across 25 oinkalicious Farm levels collecting all the best fruit and veg along the way to help her grow into Miss Perfect Piggy. <br/><br/>Oops! The Farmer has left all the Fruit and Vegetables strewn about the Farm! Piglet will snort with delight when you leap her from the spinning haystacks to reach all the abandoned food, why not hitch a cool speedy ride on the Rocket Fired Hay Carts or explode from lurking Milk Churns to boost your journey. <br/><br/>Ready for hilarious muddy fun and adventure? Can you help our hungry little Pinky become Miss Perfect Piggy and gain all 10 Achievements? Try the Endless Run Mode if you fancy just running amok in the fields till the sun goes down. <br/><br/>Features: <br/><br/>- Fun filled adventure across 25 Farmland Levels <br/>- Jump, Spin and bounce from the coolest Haystacks <br/>- Hitch Speed Rides on Rocket Powered Hay-carts <br/>- Explode from crazy Milk Churns <br/>- Collect all the yummy Fruit and Veg <br/>- Compete with your friends and be the first on the achievements board <br/>- Endless Run Mode for piglets just out for fun! <br/><br/>Find Us Online: <br/><br/>Facebook :- Facebook.com/RisingHighStudio <br/>Twitter. :- @RisinHighStudio", "metacritic": null, "released": "2013-08-04", "tba": false, "updated": "2019-10-22T14:25:49", "background_image": "https://media.rawg.io/media/screenshots/db5/db5718367c5ae798a1929e569617f5f8.jpg", "website": "http://www.facebook.com/RisingHighStudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Go Free Games - Best Top Fun Apps"], "genres": [], "publishers": ["Rising High Apps"], "esrb_rating": "Everyone 10+"}