{"id": 696480, "slug": "anu-a-myths-and-mazes-tale", "name": "Anu - a Myth's and Maze's tale", "name_original": "Anu - a Myth's and Maze's tale", "description": "<ul><li>Very hard difficulty - high level of frustration tolerance needed </li><li>I know it has some bugs and various design flaws - but please let me know what you think - any feedback is highly appreciated</li><li>If you finish under 30 mins I need a video proof ;)</li></ul>\n\n<p>Hey guys, <br/></p>\n<p>I created Anu as a short single player demo for the pitch of my asymmetrical multiplayer game idea Myth's and Maze's (just the working title^^). Unfortunately I couldn't convince various publishers to give this project a chance... The lack of industry experience, not a complete team and no multiplayer prototype were the main reasons that made it too risky to invest... <br/></p>\n<p>I am more a game designer than a developer and I really have my problems when it comes to network replication stuff on UE4 and I don't have the time and energy to do finish the multiplayer prototype by myself...</p>\n<p>Soo, I guess you already know where this is going ;)</p>\n<p>If you are a skilled UE4/5 developer with experience in multiplayer games and with the serious interest and spare time to take part in such a project please let me know. I will send you some documents from the pitch so you get an idea of what the game is about^^</p>\n<p>email: devs.mythsnmazes@gmail.com<br/>discord: omg_itz_zen#2035<br/></p>", "metacritic": null, "released": "2021-11-17", "tba": false, "updated": "2021-11-19T07:25:48", "background_image": "https://media.rawg.io/media/screenshots/ce1/ce1985f71370f11747594732d5c9e749.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZenWarrior"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}