{"id": 696544, "slug": "zen-fighters", "name": "Zen Fighters", "name_original": "Zen Fighters", "description": "<p>Zen Fighters is an exciting new online Esports game, that combines an interactive, action-filled virtual reality experience together with a groundbreaking NFT (non-fungible token) technology. </p>\n<p>This synergy of technologies allows for a new type of Esports game, in which players not only exercise, compete against other fighters, but also earn items that have real value outside of the game's environment</p>\n<p>This is a brand new 1-on-1 competitive sport, which combines features of Quidditch (Harry Potter), Pokemon catching in Pokemon GO, as well as Street Fighter style of match system which combine into a fresh, interesting and infinitely replayable sport. The beauty of it is that it can only be played in virtual reality, as it has elements that are not possible to recreate in real life</p>\n<p>Currently, Zen Fighters is in early alpha stage, not open for public playing yet. However, we host weekly test sessions where up to 20 people meet up inside the same fighting arena and play together to try and break the game, and have fun in general. If you like the vision of the game and you would like to try the demo, feel free to join our Discord community! https://discord.com/invite/G7eE9C9RRg</p>\n<p>We would also really appreciate any donations through here or our ETH address: 0x796d774d025Ed77cd6Ac61f63beC6E5b1024c14A</p>", "metacritic": null, "released": "2021-11-17", "tba": false, "updated": "2021-11-19T07:40:29", "background_image": "https://media.rawg.io/media/screenshots/878/8780771c0270f906e7c96e35a0e81c18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Zen Republic"], "genres": ["Action", "Shooter", "Sports"], "publishers": [], "esrb_rating": null}