{"id": 696561, "slug": "kaibutsu-another-world-flashcards-prototype", "name": "Kaibutsu: Another World - Flashcards Prototype", "name_original": "Kaibutsu: Another World - Flashcards Prototype", "description": "<p>Developed by Scott McKie of Belief Engine<br/></p>\n<p>\n</p>\n<br/>\r\nGAME01: Flashcards Prototype\r\n<p><strong>Kaibutsu: Another World</strong> is an in-development Japanese learning game. This is the first in a series of small prototypes being developed to get the hang of working in the Defold engine, and get a head-start on some of the minigames that will be available in the larger game.<br/></p>\n<p>This first prototype is a simple <strong>flashcard game to learn/practice hiragana</strong>. Nothing super fancy in this one, but some of the future prototypes will build off of this one.</p>\r\nControls\r\n<ul><li>Mouse is required.</li><li>You can also press Space to continue to the next question / skip a question.</li></ul>\n\r\nSome Background For<br/> Kaibutsu: Another World\r\n<p>I've been learning Japanese on my own for a little while now, and have tried out several different methods. All have their pros and cons, but trying to use multiple methods at the same time has proven incredibly unwieldy. Additionally, different methods progress at different rates or have different lesson plans, so doing 2 lessons concurrently leads to a lot of wasted effort.</p>\n<p>I've tried some games to help me study hiragana &amp; katakana, and those were great. But after graduating from that, the game space for language learning dried up. There are some interesting games out there, but they didn't quite click for me as they tended to be somewhat superficial- only focusing on a small aspect like simply teaching you vocabulary. They tend to also stick pretty closely to \"traditional\" Japanese-as-a-second-language education, while there's some pretty excellent literature out there on better ways to approach language acquisition and make it stick.</p>\n<p>\n</p>\r\nThe Refold System\r\n<p>In devising my own lesson plans, which I'm implementing in the game, the biggest source of inspiration is the <strong>Refold</strong> system of language study (which is an evolution of the <strong>Mass Immersion Approach </strong>to learning a new language). Refold mirrors a lot of what I'd been reading about Stephen Krashen's research into language acquisition.</p>\n<p>The core guiding philosophy of Refold is <strong>immersion in the language</strong>: where you can learn a language much faster and easier if you are constantly surrounded by it (usually live in the land using it) and are required to adapt to it, versus trying to practice it in isolation.</p>\n<p>While myself or most anyone can't quite pack up casually and move to Japan, I'm aiming to build a game with all its design around this philosophy, and push the learning language games field forward.</p>\n<p>And finally, just the act of having to research and verify the language to use it properly in this game has been a helpful exercise in retaining what I've learned so far. </p>\r\nAre you interested in learning more and getting updated as more prototypes are released?<br/>Sign up for the Kaibutsu: AW Newsletter!\r\n<p>Please feel free to leave comments and feedback!<br/>Or reach out to me at Belief Engine.</p>", "metacritic": null, "released": "2021-11-17", "tba": false, "updated": "2021-11-19T07:43:51", "background_image": "https://media.rawg.io/media/screenshots/b38/b380e076be996daa7041bf3a1792dbd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Belief Engine"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}