{"id": 696643, "slug": "lcddem-oniro", "name": "LcdDem Oniro", "name_original": "LcdDem Oniro", "description": "\"This game contains depictions of depression, anxiety, and suicide,  and may not be suitable for all audiences. It also contains bright  flashing imagery that may cause discomfort and/or seizures for those  with photosensitive epilepsy. Viewer discretion is advised.\"\r\n<p>GAMEPLAY CONTROLS:\r\n</p>\n<ul><li>Arrow buttons/H,J,K,L  -  Move Chie/Select effect</li><li>Shift                               - Use effect</li><li>Z/space bar                   -  Interact/Choose effect</li><li>X,C,V,B,N,M/Esc           -  Bring up menu/exit Menu</li></ul>\n<p>LcdDem is a game made by Koronba realesed in January, 26 2010 as an open-source freeware.</p>\r\nIn April 2013, Koronba posted a bizarre message on the official site asking fans to forget about LcdDem and to remove any content related to it. They asked not to share it or even speak of it. It is not known why they chose to do this. It has been speculated that the game reminds them of something they would like to forget.\r\n<p>This is a port I did, which is based on the Ver.0.030 build.<br/>It runs on, the official steam release of, the RPG MAKER 2003 Engine, (Version 1.12a).</p>\n<p>It works on newer machines, (With windows 7 and above), with some issues.<br/>(Certain events, that utilize files with unicode characters, will crash the game. This will take some time to fix as the \"source code\" is a mess of random, incoherent characters.)<br/></p>\n<p><strong><em>Update</em></strong><em><strong>:</strong> I added the original release, bundled with EasyRPG player, until I manage to completely fix my port. The EasyRPG release has no issues, (other than some mild stuttering),  and works as expected.</em><br/></p>\n<p><strong>FAQ</strong><br/></p>\n<ul><li>Q: Why is it called LcdDem \"Oniro\"?<ul><li>A: To differentiate it from the original version.</li></ul></li><li>Q: Why did you \"resurface\" this game?<ul><li>A: It is a very unique and interesting experience. It would be a shame to just let it die. But despite all said, I will remove the game if the original creator wants to.</li></ul></li></ul>", "metacritic": null, "released": "2021-11-17", "tba": false, "updated": "2021-11-19T08:11:46", "background_image": "https://media.rawg.io/media/screenshots/d07/d070a4835837d3086408936ec1450b7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Guilvector"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}