{"id": 696627, "slug": "happy-kidney", "name": "Happy Kidney", "name_original": "Happy Kidney", "description": "Game for kidney disease patients\r\n<p>                    เกมนี้เป็นเกมให้ความรู้ เกี่ยวกับการเลือกกินอาหารของผู้ป่วยโรคไต ว่าสิ่งไหนที่กินได้หรือมีสิ่งไหนบ้างที่ห้ามกินเพราะจะส่งผลไม่ดีต่อผู้ป่วย </p>\n<p>                   เราตั้งใจทำเกมนี้เพื่ออยากให้ทุกคนได้เรียนรู้ได้เข้าใจ ไม่ใช้เฉพาะผู้ป่วยโรคไตเท่านั้นที่ควรเล่น อยากให้มันเป็นสิ่งที่ทุกคนรู้เพื่อจะได้ไปแนะนำการกินอาหารที่ถูกต้องกับผู้ป่วยหรือคนที่อยู่ในครอบครัวของเราได้</p>\n\n\r\nHow to play\r\n<p>วิธีการเล่นง่ายๆ </p>\n<p>1. กดลากวัตถุดิบที่ควรทิ้ง ไปทิ้งที่ถังขยะด้านซ้ายหรือขวาของจอโทรศัพท์  / Drag the raw material Go to the trash on the left or right side of the phone screen.</p>\n<p>2. ถ้าทิ้งถูกจะได้คะแนน ถ้าทิ้งผิดหักคะแนน / If discarded correctly will get points. If left wrong, deduct points</p>\n<p>3. เมื่อทิ้งวัตถุดิบที่ควรทิ้งจนหมดตู้เย็น จะมีตู้เย็นใหม่ทันที / When discarding raw materials that should be discarded until the refrigerator is gone There will be a new refrigerator immediately.</p>\n<p>4. เมื่อเล่นไปสักพักจะเจออุปสรรคให้ เช่น ใช้ไฟละลายน้ำแข็ง / When playing for a while, you will encounter obstacles, such as using fire to melt ice.</p>\n<p>5. ขอให้สนุกและได้รับความรู้จากเกมนะ /  have fun!!</p>\n\n\r\nLanguage\r\n<p>          เกมนี้เป็นภาษาไทยล้วนนะคะ / Thai language</p>", "metacritic": null, "released": "2021-11-17", "tba": false, "updated": "2021-11-19T08:05:59", "background_image": "https://media.rawg.io/media/screenshots/f57/f572c92e9dc93ae8eb3417d851b8d413.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["OniniV99"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}