{"id": 696899, "slug": "maze-of-the-lost-mz-102-first-half-of-game", "name": "Maze of the Lost MZ 1.02 (First Half of Game)", "name_original": "Maze of the Lost MZ 1.02 (First Half of Game)", "description": "<p>Maze of the Lost is a Hybrid of Old-School Dungeon Crawlers and Traditional Japanese RPG's with a splash of the likes of Shadow Gate/Uninvited/Deja Vu and Metroidvanias that may also serve to satisfy that palette as well if you're into those. By Old School Dungeon Crawler I am talking about the likes of Wizardry and Might and Magic from the 1980's. If you are a newer gamer then you might not \"get it\" when you play the game and may not know why things are a certain way but the older gamers probably will. I have also incorporated a lot of more modern and traditional RPG tropes and certain quality of life settings that will also hopefully make the game likeable by newer gamers as well.<br/></p>\n<p> Maze of the Lost is a little on the harder side like the Old School Dungeon Crawlers but not frustratingly so like they were. The game in its finished form will be between 30-40 hours of play time and will feature 12 full levels and a secret 13th level and a few dozen smaller areas in the levels themselves. The game is actually half completed and the demo below will feature the first half of the game and about 15-20 hours of playtime.</p>\n<p> The story isn't anything grandiose at the start but will develop as the game goes and small pieces of the story will come out as you play and beat more levels and collect more items. The story will start simple enough and then after each Level there will be some cutscenes that will answer some questions but also leave more questions to be answered and on and on until the story is complete so it is kind of like a slow drip story feed with cliffhangers after each level that are answered later in the game.</p>\n<p> The story starts that the Kingdom of Fardonia is in trouble when a mysterious cave appears in the middle of forest that wasn't there before. Out of curiosity the subjects have gone in or around to see what is going on but the ones that go never return. The King sends his scholars and soldiers to see what the fuss is about and none of them return either. The King starts to call for adventurers to try to see what is going on and he offers them the Kingdom if they can figure out what is going on and report back. Suddenly the King is visited by 4 would be heroes who have a look of promise...</p>", "metacritic": null, "released": "2021-11-16", "tba": false, "updated": "2021-11-19T09:17:57", "background_image": "https://media.rawg.io/media/screenshots/ea9/ea9838c95830cd94ac26db929628a0c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Original Knightmare"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}