{"id": 6969, "slug": "airbear", "name": "AirBear", "name_original": "AirBear", "description": "AirBear wants to get HIGH, and he needs help from YOU!<br/>Draw goo trampolines for AirBear to bounce on and launch him up, up and away!<br/>Collect bamboo rings as he climbs to the clouds, but beware of bombs - they&amp;#39;ll knock the stuffing out of him!<br/>When you want to get down, tap AirBear&amp;#39;s head to put on his propeller hat, or else he&amp;#39;ll go SPLAT.<br/><br/><br/>Two addictive game modes:<br/><br/><br/>HOMEWARD BOUND:<br/><br/>• AirBear&amp;#39;s on a mission! Collect lost jigsaw puzzle pieces scattered throughout the house.<br/>• Bounce up through the levels from Basement to Attic and Treetop freedom!<br/>• Hit all the rings and stay in one piece to earn a place on the high score tables!<br/><br/><br/>ENDLESS BOUND:<br/><br/>• Going up! Spring up the Skyscraper and try for the highest high score in the world!<br/><br/>• How low can you go? Dive down the perilous Well, but don&amp;#39;t hit rock bottom!<br/><br/><br/>FEATURES<br/><br/>• Intuitive touch and tilt controls for instant pick-up-and-play fun.<br/>• Bright, brilliant graphics, animation, backgrounds and effects.<br/>• Awesome music and sound effects from Earcom.<br/>• High scores and unlockable achievements via GameCenter.<br/>• iPod Music Library support<br/><br/>VIDEO<br/><br/>See www.origin8.com/airbear for the video and more information!<br/><br/>REVIEWS<br/><br/>&amp;quot;Part Doodle Jump, part Ragdoll Blaster, with a little bit of a Toy Story vibe thrown in for good measure, AirBear is, oddly enough, wholly original.&amp;quot;<br/>• AppModo.Com<br/><br/>&amp;quot;AirBear jumps above the competition, and is the best bouncing upwards game in the App Store. The game has an outstanding design, and provides multiple gameplay modes and objectives to keep you coming back for more.&amp;quot;<br/>• AppAdvice.Com<br/><br/>&amp;quot;Excellent graphics and sounds, intuitive game controls and unique and engaging gameplay with plenty of unlockables and bonus games - plus one of the cutest pandas I&amp;#39;ve seen - make this game a winner for kids and grownups alike. Extremely addictive!&amp;quot;<br/>• enuhskigamesiphone.blogspot.com", "metacritic": null, "released": "2009-11-17", "tba": false, "updated": "2019-10-22T14:29:06", "background_image": "https://media.rawg.io/media/screenshots/82c/82cff32f16f09e25c1adb8acc467fb6d.jpeg", "website": "http://www.origin8.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Origin8"], "genres": ["Family"], "publishers": ["Origin8 Technologies"], "esrb_rating": "Everyone 10+"}