{"id": 697262, "slug": "shemkey-and-the-bloodless-murder", "name": "Shemkey and the Bloodless Murder", "name_original": "Shemkey and the Bloodless Murder", "description": "<p>Another adventure in the Shemkey and Boor Series, The Bloodless Murder! When we last left our detectives, in 'Shemkey and the Purple Letter', they were hot on the trail of the evil Francis Montane and his plans of blowing up Buckingham Palace and kidnapping the King. At least they stopped the kidnapping.</p>\n<p>Now in possession of the Purple Letter, a list of names of important significance, Shemkey is trying to deduce Montane's next target. </p>\n<p>When he hears one name in the Letter found dead from no apparent causes, Shemkey leaps to action to solve the murder (assuming it is one). This tale is full of twists and turns that will leave all the readers guessing. Will Montane reappear with a new dastardly plan? Is half of Parliament really sleeping with one woman? And will Bevin Boor finally change out of his pajamas? Find out in the new monthly installment of Shemkey Ravenscroft: Detective Extraordinaire. </p>\n<p>(Note from the Publisher: Dear Reader, this new edition of Shemkey and Boor Series has been altered somewhat to it's original publishing. The infamous, derided story was written by newcomer to the genre, Miles Alan Godwin, the Duke of Fordwich. It was published in the late Victorian period where certain norms and expectations were different.  To better suit the modern reader we have removed several long-winded essays that appeared sporadically in the text on religion, skin color, gender and also the Irish. We have also altered the ending, as that involved a fistfight with a giant sea serpent that we felt was entirely too ridiculous.)</p>\n<p>(actual info: Another small twine project. 15 mins to complete.)</p>", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2021-11-19T10:46:26", "background_image": "https://media.rawg.io/media/screenshots/df5/df5cb75ffb09a4a6ce2e8832b1100af3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["argbellum"], "genres": [], "publishers": [], "esrb_rating": null}