{"id": 697208, "slug": "kovetous-kobolds", "name": "Kovetous Kobolds", "name_original": "Kovetous Kobolds", "description": "<p><strong>SYNOPSIS</strong><br/></p>\n<p>Dig, build and burrow! Compete against up to 4 other players to get your ore to your goal before anyone else can in this classic arcade style versus game!</p>\n<p><strong>WHAT IS <em>KOVETOUS KOBOLDS</em>?</strong></p>\n<p>Kovetous Kobolds is 2-4 player arcade style versus game. Though deceptively simple, this title offers a surprising amount of depth in its frantic moment-to-moment gameplay!</p>\n<p><strong>DIG </strong>through blocks and crack open chests with your Pickaxe!<br/></p>\n<p><strong>BUILD</strong> using the blocks you've picked up, or lay traps for your competing Kobolds to fall victim to!<br/></p>\n<p><strong>BURROW</strong> away from other players or harmful environmental effects to evade damage, as well as to traverse beneath blocks!<br/></p>\n<p><strong>COLLECT </strong>various pickups through chests to give yourself an edge over your opponents!</p>\n<p><strong>WIN </strong>by cracking open the mysterious ore in the center of each map. This gives your pickaxe the power it needs to collect 1 of the 3 ores that match your Kobold's color! Bring all 3 of them back to your spawn point first to win!</p>\n<p><strong>PLAY</strong> on 3 different style maps! The first is a no-frills battle arena, the second introduces spaces that periodically have rockslides, the third contains many explosions!</p>\n<p><em>This game plays best with a controller, preferably one with a good D-Pad. Kovetous Kobolds currently supports most commonly used USB controllers from the recent few console generations. It also supports GCN Controllers, drivers not included.</em></p>", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-19T10:33:41", "background_image": "https://media.rawg.io/media/screenshots/dae/dae023afbc5dc9128a362aef885f8082.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Future-Complex Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}