{"id": 697345, "slug": "pokemon-project-shiny", "name": "Pokemon: Project Shiny", "name_original": "Pokemon: Project Shiny", "description": "<p>Pokemon: Project Shiny is a game where you play as Red to do a massive project for Professor Oak. It takes place in RPG MV world, but there are Pokemon and trainers. Questions like how they can be there and many others will be slowly answered.</p>\n<p>All characters and music belong to Nintendo. I do not actually own anything, and I only arrange them. I feel like this kind of game is fun, so I want to share the fun.</p>\n<p>For a Pokemon game, this game does not involve any battle AT ALL. Only shiny Pokemon can be caught here for a certain purpose. Even so, the game will be updated monthly.</p>\n<p>Plan:</p>\n<p>Adding more Pokemon, especially Kanto generation ones.</p>\n<p>Adding and/or improving more places and music.</p>\n<p>Adding more characters.</p>\n<p>Bug and glitch fix (if there is any).<br/></p>\n<p>Adding more story until Red figures out how they were transported to RPGMV world.</p>\n<p>The game only supports PC system for now. Previews of what has come and what's coming up will be shown in the screenshot area.</p>\n<p>HIGHLY SUGGESTED TO PLAY WHILE CHECKING THE WALKTHROUGH, which is also provided in the compressed folder. I admit there could be some confusion about what to do next, and I will fix that for 0.2.</p>\n<p>Payment is not necessary to get anything extra, but feel free to donate to my Paypal (yes, only Paypal) if you feel this game has entertained you and/or it has great potential. After all, this is just a fan-made game. Feel free to donate if you feel this game is worthy of some appreciation. Any number is fine.</p>\n<p>Please join the game's Discord server: https://discord.gg/X5KwC3Q3hM</p>", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2023-04-27T08:30:34", "background_image": "https://media.rawg.io/media/screenshots/130/1308cbc899ce296abcabbc50eb229d34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["alberto201288"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}