{"id": 697499, "slug": "uberlaufer", "name": "Uberlaufer", "name_original": "Uberlaufer", "description": "** If you are playing the game on Oculus Quest using Virtual Desktop, please make sure you set SteamVR as OpenXR runtime ***<br/>** This game is a VR Only title! You must have an OpenXR compatible headset!! **<br/><br/>In Überläufer. you play a Wehrmacht soldier who has defected and turned against the Third Reich.  You must escape your incarceration by completing random objectives that involve collecting, destroying or photographing various things in the dungeon.<br/><br/>With limited health, you need to make wise choices.  Sound and light play a key role in escaping.  Listen for approaching guards, avoid lit areas which make it easier for you to be spotted as well as improve enemies aim.  Take guards out silently when possible to avoid attracting the SS and use environmental hazards to your advantage.  Stealth mechanics including distraction and hiding spots can be used to survive long enough to escape.<br/><br/><br/><br/>Each time you play, the dungeon layout changes as well as your objectives and soldiers backstory.  Uncover letters from a former prisoner to discover his story as well as real leaflets and dossiers from the German and Austrian resistance in World War 2.<br/><br/><br/><br/>This rogue-like game is a love letter to the original WW2 Dungeon Crawlers on the Apple II and Commodore 64.<h3>Comfort Options</h3><br/>Smooth / Snap Turn<br/>Dash Teleport<br/>Comfort Tunneling (optional)<br/>Head-based locomotion", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2021-11-22T03:02:23", "background_image": "https://media.rawg.io/media/screenshots/bbc/bbc4084e59954072c63f112ed427a688.jpg", "website": "https://www.uberlaufer.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 2, "achievements_count": 24, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Think Tank Decoy Software"], "genres": ["Action", "Indie"], "publishers": ["Think Tank Decoy Software"], "esrb_rating": null}