{"id": 697416, "slug": "dream-co-the-metaverse-experience", "name": "Dream Co - The Metaverse experience", "name_original": "Dream Co - The Metaverse experience", "description": "<p>Created by Vicentek and Daystiny for the 2021 Crayta Game Jam Dream Vacation.</p>\n<p>Here you can live a virtual reality experience, in which you can emulate dream trips. Explore unique landscapes, drive all kinds of vehicles, fly over beautiful places and have fun with numerous leisure activities. Finding the balance between money and happiness is the greatest challenge on any vacation, and this is what we present to you in this unique experience.</p>\n\n<p><strong>Tips for new players: </strong></p>\n<p>The game begins at the headquarters of \"Dream Co.\" Where you are offered virtual reality glasses. When you use your virtual reality glasses you will be able to choose between several destinations (in the early access version for the jam, only the rural tourism option is available) and travel to them. At the destination you can freely explore the entire environment either on foot or by renting all kinds of vehicles. </p>\n<p>Many, but not all, activities cost money, and you will find that certain activities produce more happiness than others, but all of them are rewarding. You can also get happiness finding collectibles or visiting beautiful landscapes. You can participate in events alone or against other players, an announcement and a compas indicator will tell you ahead of an event, and an indicator with a timer will show you when these activities begin</p>\n\n\n<p><strong>Permanent activities: </strong><br/></p>\n<p>What can I do on my travels? What does Dream co offer me ?</p>\n<p>Within the simulated environment, you can spend your time however you like. You can get happiness from numerous activities: </p>\n<p>- Drive vehicles: you have at your disposal  for a minor payment a multitude of vehicles from classic cars to more modern models, airplanes and boats; you decide how to use them, you can be a prudent driver and enjoy the views or perhaps you are more reckless and decide to make them crash. Pure fun ... it is your decision, we remind you that it is a simulation and you will always be safe, but destroying vehicles does have an impact on your wallet! </p>\n<p>- Search for collectibles: pay attention to the details of the map and you will be able to find everything from minerals or fossils to hidden treasures. If you are interested in collecting, you should visit the “Collector’s Gallery” above the car rental and photo studio, where you will be able to see a sample of the collectibles most loved by our visitors. </p>\n<p>- Having an ice cream or a drink is always a rewarding activity, do not be afraid to satisfy yourself with our extensive offer (warning: Dream Co. recommends a responsible use of alcoholic beverages, the ingestion of large quantities could lead to adverse effects) </p>\n<p>- Some of the best pilots have traced an aerial circuit in which they measure their ability by reaching for some colorful balloons, will you be able?  </p>\n<p>- Visiting beautiful places and panoramic views is a great source of spiritual peace and happiness</p>\n\n<p><strong>Temporary events: </strong><br/></p>\n<p>At the moment in the early access version you can participate in: </p>\n<p>- Car race event: go to the nearest ren-a-car before the event starts and take a vehicle, wait for the traffic lights to give the green light, drive through the circuit and try to be the first. You can compete alone to improve your time or against other players. If you race againt another player and win, you will not just receive a high amount of happiness but also some prize money. </p>\n<p>- Photo Safari event: In the \"Photo Studio\" you will always find two pictures of scenic places on the map. Interacting with the picture even puts a marker on the compass to show you the direction. Find and remember the places and then during the event time visit as many places as possible for extra amounts of happiness. </p>\n<p>- more events coming soon!</p>\n<p><strong>Creator Challenges: </strong></p>\n<p>With these Challenges you can acquire extra XP for your Crayta battle pass: </p>\n<p>- Drive 5 minutes with any vehicle. </p>\n<p>- Crash a vehicle </p>\n<p>- Win 3 times at the slot machine </p>\n<p>- Win a jackpot at a slot machine </p><p>- Participate in the motor race </p>\n<p>- Win the motor race against a competitor </p>\n<p>- Visit three scenic places (during or outside the photo event) </p>\n<p>- Interact with one of the scenic pictures in the photo studio and discover the place for yourself. </p>\n<p><strong>Activities</strong>:<br/></p><p>Almost all activities described grant XP towards your battle pass and so should give you happiness within and outside of the dream vacation simulation. We encourage you to explore and discover them!<br/></p>\n<p><strong>Leaderboards:</strong></p>\n<p>- Best Motor Race Time: beat your own time during or outside the motor race events. </p>\n<p>- Most Motor Race Wins: win a car race against other players. </p>\n<p>- Most Vehicles Crashed: will you be our most destructive visitor? </p>\n<p>- Highest Happiness Achieved: Exceed the happiness achieved in previous game sessions! </p>\n<p>- Places visited during Photo Safari: visit as many scenic locations as possible during the time of the event. </p>\n<p><strong>Credits:</strong></p>\n<p>While we worked a lot and hard to provide this game to you, it wouldn't have been possible without some of the marvellous packages out there, that other creators have donated to the community:<br/></p>\n<p>MightyKho for the ever so useful MightyAnimtions</p>\n<p>Mochi for the clever HealthBar widget with the circular design</p>\n<p>Cereal for the helpfull User Compass package</p>\n<p>TwentyNineDev for the Working TV Package<br/></p>\n<p>Tumbak for all the amazing buildings he donated to the community during this year's build jams and all his advice and testing, we love you!</p>\n<p>We really thank you guys!</p>\n<p><strong>And finally ...</strong></p>\n<p>And finally, it's time for your dream vacation - enter the Metaverse and see if you can become the happiest person ever! Have fun and let us know of any feedback, please!</p>\n<p>Vicentek and Daystiny<br/></p>", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2021-11-19T11:26:32", "background_image": "https://media.rawg.io/media/screenshots/530/530861df40f42ca9f3495513120e30ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daystiny"], "genres": [], "publishers": [], "esrb_rating": null}