{"id": 6974, "slug": "finger-balance", "name": "Finger Balance", "name_original": "Finger Balance", "description": "Featured by Apple in &amp;quot;Gravity Puzzlers&amp;quot; &amp;amp; &amp;quot;The Best Games You&amp;#39;ve Never Played&amp;quot;<br/>Nominated as Most Innovative Game at International Mobile Gaming Awards(IMGA)<br/><br/>Ranked #6 Top Paid Apps in US,   #1 Top Paid Puzzle Games in US, Germany #1 Top Board Games in US, UK, Germany, Denmark, Hong Kong! Featured as &amp;quot;What&amp;#39;s Hot&amp;quot; &amp;quot;New and Noteworthy&amp;quot;<br/><br/>Featuring innovative and unique gameplay never seen before in the App Store, Coconut Island, maker of iDragPaper with 11 million players worldwide, is proud to present to you Finger Balance, brand new one of its kind puzzle game for iPhone.<br/><br/>Test the dexterity and stability of your fingers, by balancing a ball on a rod and navigate through challenging and fun levels.<br/><br/>Review:<br/>“Finger Balance is a new type of physics inspired puzzler for the iPhone that is sure to be a favorite among challenge loving gamers.” - AppSafari rating 4/5<br/><br/>“Finger Balance by Coconut Island is one of those rare games where you can&amp;#39;t help but wonder why it took so long to come about.” - AppSpy.com rating 4/5<br/><br/>&amp;quot;This insanely addictive physics puzzler has all the right elements of a classic casual game.&amp;quot; - appSIZED rating 4.5/5<br/><br/>&amp;quot;With laborious mazes, easy graphics, and a modest price tag, Finger Balance is a should buy!&amp;quot; - appadvice rating &amp;quot;SHOULD BUY&amp;quot;<br/><br/>Gameplay:<br/>You&amp;#39;re given a rod and a ball on it. Your objective is raise and lower both  ends of the rod to balance the ball and navigate it through obstacles.  <br/><br/>Features:<br/>- Unique gameplay you have never experienced before<br/>- Instant reply. Relive the best 6 glory moments of your accomplishment<br/>- 98 Levels in different difficulties <br/>- 3 game modes: casual mode, classic mode and reversed mode<br/>- 23 Achievements<br/>- LEVEL EDITOR<br/>- Retro style graphics<br/>- Original background music and sound effects<br/>- OpenFeint online leader board<br/>- Score publishing with Facebook and Twitter<br/>- Access integrated game community in-game<br/><br/>Gameplay video: http://www.youtube.com/watch?v=_Hizt_gU_PU<br/>Official guide video: http://www.youtube.com/watch?v=fR6YwhKtcoY<br/><br/>Just remember to use your finger tips to move the rod and touch as little screen area as possible!<br/>“It&amp;#39;s to easy I mean I finished it in like 10 minutes and im not even joking.” -- User Review(Gymgirl97)<br/>“This game takes patience, dexterity, and the willingness to not give up.” -- User Review(The Finish Hammer)<br/><br/>Crashing? RESTART your iDevice to get it to work!", "metacritic": null, "released": "2010-08-05", "tba": false, "updated": "2019-10-22T14:29:07", "background_image": "https://media.rawg.io/media/screenshots/41b/41bf153f07bfcf207113d06aed2ce6b9.jpeg", "website": "http://www.coconutislandstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coconut Island Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Coconut Island Games"], "esrb_rating": "Everyone 10+"}