{"id": 697524, "slug": "timescape-altitude", "name": "TIMESCAPE: Altitude", "name_original": "TIMESCAPE: Altitude", "description": "One of a series of planned Escape rooms in different, unique, locations and situations. <br/>The game focuses on Observation, listening, logic, cunning, and physical puzzles. Keeping you <br/>immersed, the puzzles logically fit with the situation, and don’t force a mini game where <br/>it would not belong.<h3>Story</h3>You have interfered with the plans of a rival who has left you to die on a plane, along with some expendable cargo. The pilots are gone, and the plane is flying  itself. How long the plane will last in the air, is a guess. Best to get out, as quickly as possible.<h3>Key Features</h3>Hint system and menu controls are fit into the location, so you never have to exit, to make changes. <br/>Hints are based on progress, so you’ll never get a hint that is not relevant. <br/>The game is part non linear, so you can chose how you progress. If one puzzle is giving you a  <br/>problem, spend time on another for a while.<br/><br/><br/>It’s VR, designed for full room-scale/standing tracking with motion controllers. Can play seated, but you would still need to reach to the floor to pick things up. <br/>Switchable movement controls. Adjustable height Controls. <br/>Adjustable difficulty levels. <br/><ul><li>Level 5 is for Super Escape Genius-Level Brains. <br/></li><li>Level 3 is the standard level. <br/></li><li>Level 1 is more casual, or for people who are new to escape rooms.<br/></li></ul><br/><br/>Playtime can be 1.5-3 hours depending on difficulty, and skill.", "metacritic": null, "released": "2021-11-19", "tba": false, "updated": "2021-11-22T03:24:51", "background_image": "https://media.rawg.io/media/screenshots/094/094fe1a4ee41f68270dd1ec6b426fcb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dowrick Games"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Dowrick Games"], "esrb_rating": null}