{"id": 697555, "slug": "just-block-puzzle-brain-game", "name": "Just Block - Puzzle Brain Game", "name_original": "Just Block - Puzzle Brain Game", "description": "Time to have fun and relax with Just Block - the best classic block puzzle game!<br/>Just Blocks is an easy brick puzzle game combining 2 types of block games - sudoku block games and classic tetris. It’s a completely free puzzle blocks game that comes with challenges and different modes to play - all designed to make you turn down stress and turn up the fun!<br/><br/>Install Just Block for free and get addicted to merging, dropping and joining brick blocks in your own time or in a timely manner - your choice!<br/><br/>Why install Just Block?<br/>- Such combination of sudoku blocks, tetris games and puzzle blocks make up an ideal mind game you can play online or offline anytime, anywhere to train your brain and enjoy moments of complete relaxation.<br/>- Brick puzzle blocks games such as Just Blocks also involve a certain degree of strategy and easy logic - that is why it’s a great free block puzzle game for all ages.<br/>- The Daily Challenges will keep you on your toes … or rather, fingertips... since you’ll have to create puzzle blocks lines quite fast and make sure you finish the brick puzzle challenge in a predetermined time frame. Up for the daily puzzle challenges? Solve them all and win monthly trophies!<br/>- Play and create puzzle bricks combos with no time limit with Standard mode or against the clock in Time mode for an extra adrenaline boost.<br/>- Enjoy various block game options such as different colors of the puzzle board and bricks, sounds, modes to play and more.<br/><br/>How to play Just Blocks?<br/>- Tap on the available brick blocks, then drag and drop the bricks around to place them where they fit best.<br/>- Create full block lines on the grid vertically or horizontally, or whole brick squares in order to break bricks and score points.<br/>- Check out the app Settings for more gameplay options.<br/><br/>Just Blocks is a fun, addictive block puzzle that you’ll want to keep playing every day - either for a fun pastime or for practice, to keep your mind sharp. Brick block puzzle games such as this, based on solving puzzles and matching bricks and even number blocks, help with brain training and development, so train frequently and keep track of your progress.<br/><br/>Install Just Blocks today, drag and drop those puzzle bricks, score high and win trophies. Sounds like fun? Drop us your feedback and let us know how you feel about the Just Block app - we’re always happy to learn from our players!", "metacritic": null, "released": "2020-06-04", "tba": false, "updated": "2021-11-22T03:45:48", "background_image": "https://media.rawg.io/media/screenshots/740/7404c4d59acc66d500a6c93f2b349941.jpg", "website": "http://newpub.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NewPubCo"], "genres": ["Casual", "Puzzle"], "publishers": ["NewPubCo"], "esrb_rating": "Everyone 10+"}