{"id": 697543, "slug": "vr-nyotaimori-female-body-sushi", "name": "VR Nyotaimori: Female Body Sushi", "name_original": "VR Nyotaimori: Female Body Sushi", "description": "Playing \"VR Nyotaimori: Female Body Sushi\", you will embark on an extraordinary journey, this is an immersive VR game, designed for VR experience. Players can play the role of a man traveling alone in Japan, accidentally discover a trusted custom shop, and become the first customer of this new store, and have an fascinating journey with three beauties with different styles.<br/>\n<br/>\r\nmain features<br/>\r\n1. Real scenes-using high-precision models to show the real scenes in front of your eyes through VR, so that you can experience the most authentic Japanese style at home.<br/>\n<br/>\r\n2. Beautiful women with different styles-in the game, we have prepared three beauties with different styles to get along with you. Increasing the intimacy between you and the beauty will unlock more possibilities, but please remember that if the needs of the beauty are not met, it will make the beauty angry.<br/>\n<br/>\r\n3. Freely create your own beauty-do you want to start a different romantic journey with someone you are familiar with? We have the most advanced face recognition technology, which can generate high-precision models from the photos you upload, allowing you to create your exclusive beauties in the game.<br/>\n<br/>\r\n4. Leisure dance function-when you unlock the dance function, you can arrange your exclusive beauty to dance for you alone. We have prepared dozens of music and corresponding dances for you, so that you can enjoy her dancing for you in the beautiful scenery.<br/>\n<br/>\r\nGame operation method:<br/>\r\nIn order to have a better gaming experience, this game currently only supports the VR version.", "metacritic": null, "released": "2021-11-20", "tba": false, "updated": "2021-11-22T03:38:23", "background_image": "https://media.rawg.io/media/screenshots/181/1811654d3ff841b5c881f225cb15c493.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["William at Oxford"], "genres": ["Casual"], "publishers": ["William at Oxford"], "esrb_rating": null}