{"id": 697501, "slug": "equin-2-the-warren-peace", "name": "Equin 2: The Warren Peace", "name_original": "Equin 2: The Warren Peace", "description": "When an evil wizard writes a 6000-page book to bore the townspeople to death, it's up to you to take the damn thing and return it FROM WHENCE IT CAME. <br/><br/>Dive back into the roguelike world of Equin: It's rabbit warriors vs evil enemies in a challenging traditional roguelike! Specially-designed to not need a MENSA membership to figure out. Fight monsters, not the controls!<h3>FEATURES</h3><br/><ul><li>Holy cow, a roguelike that's an actual roguelike??!: Permadeath, Tile-Based / Turn-Based movement, randomized dungeons. Huzzah!<br/><br/></li><li>Easy to learn control scheme: One of the things that keeps me from playing traditional roguelikes very much are the complex keys to figure out. In Equin: The Warren Peace, every action is tied to a context menu that pulls up by pressing the Space Bar. Near a well and next to a door? Press space to have the option to either drink the well water, fill an empty bottle, or enter the building. No more 1,000,000 keyboard possibilities. \"Fight monsters, not the controls!\"<br/><br/></li><li>Four classes that play differently: Warriors can use two handed weapons and excel with all armor and shields, but are very weak vs. magic. Thieves can use inspect chests for mimics or steal from shops. Wizards cast offensive magic and can convert unwanted items into XP to help them grow. Clerics are holy champions who excel fighting undead enemies, making them REGULAR dead enemies.<br/><br/></li><li>Your adventure takes you through a swampy temple, arid desert, undead crypt, frozen prison, magical forest, and the wizard's tower. Discover special event rooms, powerful statues, treasure chests, deadly traps, and devious monsters along the way.<br/><br/></li><li>Battle enemies in GLORIOUS 1st person combat: Gain fighting options depending on what you're holding- Slash with swords, bash with shields, chant magic from books, stab with knives and more. Manage your stamina like a pro or equip the \"The Warren Peace\" book to help you.<br/><br/></li><li>Fight boss enemies at the end of each area to get a special key that opens the vault for great rewards. Or don't and take the escape ladder out instead- it's up to you.<br/><br/></li><li>Special floor events can spice things up: Rain, Darkness, Anti-Magic, Time Bombs, Firestorms, Jailbreaks and more!<br/><br/></li><li>Colorful graphics, with hundreds of equipment pieces that show up on your guy while worn: Never have to guess what your character is wearing again! If he's using a huge battleaxe and wearing heavy iron armor then that's what he'll look like on the screen.<br/><br/></li><li>Original OST: A soundtrack featuring drums, bass, keyboards, guitar, and thankfully no singing this time!</li></ul>", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2021-11-22T03:04:29", "background_image": "https://media.rawg.io/media/screenshots/a3e/a3ea7461932ca72e848e3852637916c9.jpg", "website": "http://www.dxfgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 368, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DXF Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["DXF Games"], "esrb_rating": null}