{"id": 69776, "slug": "mahjong-around-the-world", "name": "Mahjong Around The World", "name_original": "Mahjong Around The World", "description": "Mahjong Around The World is a classic tile-matching puzzle game in the tradition of 'Mahjong Solitaire', one the most popular computer games of all time.<br/>This Mahjong title has more to offer than addictive gameplay: by solving layout after layout you'll be unlocking more and more international cities and explore their historical Chinatown districts. <br/><br/>Start your journey in Shanghai and visit 13 Chinatowns in major cities around the world. Playing Mahjong you'll be visiting Yokohama, Sydney, San Francisco, Buenos Aires, London, and Amsterdam to name only a few. Each new city comes with its own distinct look and background information about its Chinatown.<br/><br/>Dive into a fantastic, stress-free puzzle game that's challenging and soothing at the same time.<br/><br/>Mahjong Around The World comes with full localization in: English, French, German, Portuguese, Spanish, Italian, Dutch, Polish, Russian, and Turkish.<br/><br/>- beautiful tile layouts<br/>- 13 international Chinatowns<br/>- historic background information<br/>- amazing 'pixelperfect' graphics<br/>- intuitive controls<br/>- hint and reshuffle functions <br/><br/>If you like games like Klondike Solitaire, Mikado, or Sudoku you'll love Mahjong Around The World. It's perfect for quick and long breaks.", "metacritic": null, "released": "2015-02-18", "tba": false, "updated": "2019-10-22T14:25:54", "background_image": "https://media.rawg.io/media/screenshots/13c/13c3293cd4806bf790b39608575405b7.jpg", "website": "https://www.lite.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["LITE Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["LITE Games"], "esrb_rating": "Everyone 10+"}