{"id": 697704, "slug": "breaking-bread-futur_null", "name": "Breaking Bread (futur_null)", "name_original": "Breaking Bread (futur_null)", "description": "<p>Serve food to customers who are bad at knowing what they want! In other words, the normal customer service experience, really. You have 120 seconds to score as many points as possible.<br/></p>\n<p>The game is totally mouse-driven and has a lengthy in-game tutorial. There's also a readme included in the downloads.<br/></p>\n<p>If you encounter lag, stutter or other problems with the web build, <strong>please download and play a native build.</strong> They have a few more features too. Sorry and thank you! This version of Godot isn't so great at HTML export.</p><p>Also, this game has <strong>an online leaderboard </strong>courtesy of SilentWolf.<br/></p>\n\r\n[ BACKGROUND ]\r\n<p>This game was developed in about a week for the Palette Jam 2 [8 Bits to Infinity]. It uses 8 colours from the Rampy16 palette . The colours chosen are #252945, #515369, #848fa1, #515369, #bd46b7, #d4996a, #63b04f and #e06767.</p>\n<p>The theme was \"<strong>Break</strong>.\" This game offers you the unique chance to enjoy breakfast, or perhaps your lunch break, with the world-class solutioneers employed by <em>VirtuMegaDyne Amalgamated Businessworx</em>.</p>\n\r\n[ GAMEPLAY ]\r\n<p>This game is controlled with the mouse. You won't need your keyboard or a gamepad or anything. Well, you'll need the keyboard to enter your gamer tag, in \"Settings.\"</p>\n<p>There's an in-game tutorial, but here's the summary:<br/></p>\n<ul><li>Left-click on guests once they arrive at the counter. </li><li>Left click on either the FOOD or DRINK button, </li><li>then left click on the item you wish to hand over.</li></ul>\n<p>Additionally, left click on litter to collect it, and left click on the big screen with the speakers to change up the vibe.<br/></p>\n<p>As for the scoring: You get points for serving guests - far more if you're interpreting their requests correctly. You get points for collecting litter - the faster the better. And you get points for providing the correct  V I B E   to the people waiting in line - this is only counted when the line moves.</p>\n<p>2000 and up is a *very* respectable score, 3000 is my personal best. If you can beat that, make sure to let <em>VirtuMegaDyne Amalgamated Businessworx</em> know.</p>\n\r\n[ CREDITS ]\r\n<p>All development work by futur_null. Makes use of SilentWolf's backend services for Godot engine, and the plugin too.<br/></p>\n<p>As for everything else...<br/></p>\n<ul><li>Sound effects<ul><li>\"candy wrapper crinkle E\" by volivieri</li><li>\"21100242 Maren Bohmer, SD 100, Bottle crinkle, OWI\" by _maribiscuit_</li><li>\"Chewing, Carrot, A\" by InspectorJ</li><li>\"Opening a Fizzy Bottle, C\" by InspectorJ</li><li>\"Short crisps eating noise\" by vibritherabjit123</li><li>\"Sipping Drink\" by VPP_2015</li><li>\"TV television, on off\" by SpliceSound</li><li>\"8-Bit Sound Effect Pack\" by OwlishMedia</li><li>\"512 Sound Effects (8-bit style)\" by SubspaceAudio</li></ul></li><li>Music<ul><li>\"Memories Of Thailand (Beat Doctor's 'stuck in Britain' remix)\" by Risey</li><li>\"Albatross v2\" by Computer Music All-stars</li><li>\"České Dráhy train station jingle\" collected by Provodnik</li><li>\"Cafeteria Conversations\" by akeipi</li></ul></li><li>Graphics<ul><li>\"pH64 Pixel Pack - 100s of Sideview Assets\" by PurpleHeart</li><li>\"Zelda-like tilesets and sprites\" by ArMM1998</li><li>\"(12x12) City Tiles - Top Down\" by FisherG</li><li>\"Earthbound-like battle background shader w/scroll effect and palette cycling\" by r3tr0_dev</li><li>\"Glasstown NBP Font\" by total FontGeek DTF, Ltd.</li><li>\"CC0 Food Icons\" by various creators, collected by AntumDeluge</li></ul></li></ul>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T04:31:26", "background_image": "https://media.rawg.io/media/screenshots/b94/b941cbc11ca3a3aef074f6583094a643.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["futur_null"], "genres": ["Action"], "publishers": [], "esrb_rating": null}