{"id": 697768, "slug": "wizard_test", "name": "WIZARD_TEST", "name_original": "WIZARD_TEST", "description": "<p>!Still working on the mythic/unheard of PAGAN!</p><p>This is a prototype i put together in less than a week after watching a Hexen longplay. It's nothing noteworthy, just something i did for fun and to do something new. I wanted to see how a more modern-ish Heretic/Hexen like game could look like, while still keeping that retro feel. I'm still wrestling with HDRP as i try to build PAGAN with it, while also keeping it performant. This is merely an experiment that you can try if you want.<br/></p>\n<p>This is a <strong>hypothetical </strong>\"HUB\" map, with <strong>hypothetical </strong>\"GATEWAYS\" to 5 different <strong>hypothetical </strong>worlds/lands. <strong>You can't actually go in them, it's just for show.</strong> There are also 4 AI mages walking about, who have their own faction, and will shoot fireballs at you and each other, while 2 are friendly.<br/></p>\n<p>This uses Unity's experimental HDRP, and the AI is overly complex and uses my custom  and terrible pathfinding system, which doesn't use an A* algorithm nor does it use Unity's NavMesh, but instead uses RAYCASTS! Super duper dumb i know! It's very UNOPTIMIZED and only seems to scale performance according to resolution. The lower the res, the smoother the frames. <strong>Don't tell me it performs badly at 1080p or higher, i already know that.</strong><br/></p><p>This stupid thing features: <br/></p><ul><li>True PBR materials</li><li>Volumetric Fog and Clouds</li><li>Tessellation and Parallax Occlusion Maps</li><li>Screen-Space Reflections</li><li>Terrible AI and pathfinding</li><li>Cloth Physics</li></ul>\n<p>This isn't anything, just made it for fun to keep me creative. If this is something you'd like to see happen one day, let me know! And some ideas are also welcome. <br/></p><p>Cheers!<br/><br/></p>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T04:46:15", "background_image": "https://media.rawg.io/media/screenshots/65c/65c92d4a9b1121442270f738d2ae4b2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MercySoft"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}