{"id": 697873, "slug": "bahama-banana", "name": "Bahama Banana", "name_original": "Bahama Banana", "description": "Bahama Banana\r\n<p>Buy Patents, <strong>sue inventions</strong>, <strong>GET RICH </strong>and <strong>GO BAHAMA 🚀</strong></p>\r\nKeybindings\r\n<ul><li>press <em>E</em> or <em>tap on the screen</em> to skip a cutscene</li></ul>\r\nTutorial\r\n<p>You don't understand something? You came to the right place.<br/></p>\n<ol><li><strong>Game Goal: </strong>Buy Patents in the shop, then look for inventions that interfere with them, and sue the invention to get enough money to buy a house in the Bahamas.</li><li><strong>Patent App: </strong>In this app, you can see the patents that you own and a bit of information about them. The information is important when you have to choose which invention to sue.</li><li><strong>News App: </strong>Here are always two different inventions, that interfere with one of your patents. After you press select on one of them, you can prepare yourself for the court in the lawsuit app.</li><li><strong>Lawsuit App: </strong>After you select an invention from the News app, you can here prepare yourself for the court, read something about the invention and select the patent that you want to go to court with. <strong>IMPORTANT: Only ONE patent works with each invention.</strong></li><li><strong>Shop App: </strong>Here you can buy new patents. After you bought one, you can increase one of your skills.</li><li><strong>Court: </strong>When you are in court, you can select from one of four options: <em>Color, Shape, Charisma and Function.</em> You need to select the one that is the most common thing between your patent and the invention. If you aren't sure what to pick, you can just take <em>Charisma</em>.</li><li><strong>Skills: </strong>When you choose an argument in court, the chances are never 0% or 100% for winning. There is always a chance of loosing or winning. To increase your chance of winning, you can skill a certain argument. You can increase your skills by buying patents in the shop.</li></ol>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T05:15:22", "background_image": "https://media.rawg.io/media/screenshots/3d5/3d532f596b35a64354eef41944cb70ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tch1b0"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}