{"id": 69787, "slug": "sim-aquarium-best-tanked-aquariumfish-tank-games", "name": "Sim Aquarium: Best Tanked Aquarium&Fish Tank Games", "name_original": "Sim Aquarium: Best Tanked Aquarium&Fish Tank Games", "description": "Build your Aquarium empire with Aquarium Sea World on your iPhone, iPod Touch or iPad! <br/>For all Fish game lovers and Aquarium fans!<br/><br/>Aquarium Sea world is an exciting 3D aquarium experience game that gives you creative control - customize beautiful marine environments for tropical fish.<br/><br/>It is so much fun to watch your fish pets grow from tiny baby fish into amazing adult fish - see for yourself! <br/>Choose from a variety of vibrant backgrounds and charming decor items to turn your sea world into a design masterpiece!<br/><br/>ENJOY THESE FEATURES:<br/>- Buy, raise and sell fish to earn coins and gain experience <br/>- Create your own collections of adorable fish, shark, and turtle! <br/>- Customize your aquariums to your taste with 25+ themed backgrounds and astonishing decorations, to delight of your fish and visitors!<br/>- Explore an exciting aquatic sea world with amusing 3D fish, sharks and turtles!<br/>- Game Center and Facebook support. Interact with your friends: Visit their fish tanks, give likes and create your underwater seaworld together!<br/><br/>Please note! Aquarium Sea World - Fish Tank with Turtles, Sharks, Koi Fish and Blobfish is free to play, though some in-game items can also be purchased for real money. If you don’t want to use this option, simply turn it off in your device’s Restrictions menu.<br/><br/>Enjoying Sea World - Aquarium &amp; Fish Tank with Turtles, Sharks, Koi Fish and Blobfish? Learn more: Facebook: facebook.com/FishliveApp <br/>Questions? Contact our tech support at support@mongko.com.", "metacritic": null, "released": "2015-11-03", "tba": false, "updated": "2019-10-22T14:25:54", "background_image": "https://media.rawg.io/media/screenshots/ddd/ddd0e556fbc9dfe4cbf67d3d3fa1d0a9_bZMdR2x.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Da Lei"], "genres": ["Simulation", "Family"], "publishers": ["Da Lei"], "esrb_rating": "Everyone 10+"}