{"id": 697856, "slug": "love-in-the-time-of-corona", "name": "Love In The Time Of Corona", "name_original": "Love In The Time Of Corona", "description": "<p><em>On the verge of death, we see the beauty of life.</em></p>\n<p><strong>Summary</strong></p>\n<p>Jane's been diagnosed with COVID &amp; the lack of a cure has killed her interest in existence. As she waits for the \"sweet\" release of death, she decides to go on a couple of virutal dates - her last interaction with humanity. </p>\n<p>But society pulls back Jane from the grasp of the Grim reaper. </p>\n<p><strong>Objectives</strong></p>\n<p>The game has been made for the Cultural Heritage Game Jam 2021. It deals with all the 4 objectives put forth:</p>\n<ol><li><strong>Celebration of cultures</strong> - The<strong> Snake Boat level</strong> is a celebration of the snake boat races held in South India. </li><li><strong>Disrupt cultural heritage looting</strong> - The <strong>Egyptian Dunes level</strong> is an action game focused on retrieving stolen goods.</li><li><strong>Celebration of the environment</strong> - Each sub-level in the <strong>Fire Bringer level</strong> is based on a biome in the North America.</li><li><strong>Educate about the effects of climate change</strong> - The <strong>No Time For Joy level</strong> is focused on the impacts of climate change on all major religions of the world.</li></ol>\n<p><strong>Level Summary</strong></p>\n<p>1. <strong>Snake Boat level </strong>- Rhythm game where you press the Num keys to control the speed of the snake boat in a race.</p><p>2.<strong> Egyptian Dune level </strong>- TPS action game where you try to retrieve the stolen Ankh from a smuggling racket. Press C to view controls.</p><br/><p>3.<strong> Fire Bringer level </strong>- You play as the Fire Bringer who has to avoid being caught by the fire spirits.</p><p>4.<strong> Pig Woman level </strong>- Learn about the fictuous pig woman character of 17-th century Europe.</p><p>5. <strong>No Time For Joy level </strong>- Learn about the impact of climate change on every major religion in the world. </p>\n<p><strong>What's next for Love In The Time Of Corona?</strong></p>\n<p>Due to the modular level design, newer levels based on different cultures can be added easily. We hope to include as many cultures as possible in the future.</p>\n<p><strong>A brief self-analysis</strong></p>\n<p>The scope might have been a bit large but we are proud of whatever we have donw with each level althouth I think the UI could benefit from some extra effort.</p>\n<p><strong>Our Team</strong></p>\n<p>Game Created by - Hrishikesh P</p>\n<p>Music by - Ashish J</p>\n<p>Assest included from - </p>\n<p>https://docs.google.com/document/d/1SqUmJaElKOkUo1u5lbPLVD6HEI5LpahedwCCbCaokeU/...<br/></p>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T05:10:26", "background_image": "https://media.rawg.io/media/screenshots/6be/6be41f5ea2556252ce0d54a399686cd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hrishikesh P"], "genres": ["Action"], "publishers": [], "esrb_rating": null}