{"id": 697904, "slug": "purunmachu", "name": "Purunmachu", "name_original": "Purunmachu", "description": "<p>The <strong>Chachapoyas</strong> were a pre-Hispanic culture that developed in the Amazonian Andes of Peru. Historians call them “<strong>Tree People</strong>”, others \"<strong>Warriors of The Clouds</strong>” because they were furious warriors that fought and flourished at great heights, at the edge of the Amazon rainforest.</p>\n<p>The <strong>Chachapoyas</strong> cultivated a special relationship with their dead, using mortuary rituals and sarcophagi called \"<strong><em>purunmachu</em></strong>\" crafted at the face of the Andes mountain.</p>\n<p>Some still hope to unveil the mysteries of the relationship with their ancestor. There are many theories of why this ritual existed in such inaccessible places; a challenging feat, but a worthy one: As we look up to the sky to see what came before us to remember, honor, and preserve their memories, the heritage of the <strong>Tree People</strong>.</p>\n<p><strong><em>Purunmachu</em></strong> is an explorer-type game in which you will be able to transport yourself to the Peruvian rainforest, at the edge of the\"El Tigre Sarcophagi\", one important funerary site of the Chachapoyas: There you´ll face your desire. Are you saving a culture? Or helping with the destruction of your own heritage?</p>\n\n<p>We want to make a game about the dangers of cultural theft. The experience could be divided into two halves: First, our protagonist does not realize that she is damaging her own heritage, but when confronted whit it, she seeks redemption. The pieces that she steals, are not only pieces seen as objects but the vestige of her<strong> ancestral identity</strong>.</p>\n\n<ul><li><em>Arrows or WASD</em> - Moving</li><li><em>Space</em> - Grab</li><li><em>Left-click</em> on the \"<em>next</em>\" button in cutscenes to toggle</li></ul>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T05:22:15", "background_image": "https://media.rawg.io/media/screenshots/c95/c959875a6de7775854892809703831c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Strumbones", "byebyesama", "Vania.casu", "elkidalayza", "An Otter Team", "Mateo Alayza", "Nahid", "PabloCarrito", "alberto.aznaran"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}