{"id": 697979, "slug": "mummy-mansion", "name": "Mummy Mansion", "name_original": "Mummy Mansion", "description": "<p>Famed private collector of Egyptian artifacts, Richard Moores recently added a new addition to his collection, a sarcophagus dating back to 2650 B.C.E. The sarcophagus, like everything else in Moores’ collection was obtained by questionable means and some media sources speculate that it was stolen from one of many dig sites throughout Egypt. While no one can prove that Moore is a thief or a looter, the legitimacy of his collection has come back into question after this recent addition. What remains unknown to Moore is that his new sarcophagus isn’t just an empty centerpiece to his study room, but is actually the final resting place of an unknown wealthy member of ancient Egyptian society. As you begin to stir in your new resting spot you feel the need to escape after being disturbed from such a long slumber. Now wake up and take back the relics of old and escape the clutches of the robber Moore and the mansion he resides in.</p>\n<p>This was made for the <strong>Cultural Heritage Game Jam </strong>in one week by college students with little free time on their hands. It was intended to have different puzzles included in it where the player would collect artifacts after they completed said puzzles. This would slow the player down making it harder to make it through the rest of the game along with providing more significance and context to each individual artifact. Unfortunately, due to time constraints those features had to be cut.</p>\n<p>Controls:</p>\n<p>                                                                                                             /\\                                                                    |                                                                to go up                                       &lt;--- to go left                    to go right  ---&gt;                                     to go down                                                              |                                                                   \\/</p>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T05:40:52", "background_image": "https://media.rawg.io/media/screenshots/2e0/2e022e169662ef64d3a8ffa0261cda0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BU IM _288  21"], "genres": [], "publishers": [], "esrb_rating": null}