{"id": 698078, "slug": "dungeon-conquest", "name": "Dungeon Conquest", "name_original": "Dungeon Conquest", "description": "<p><strong><em>Conquer the fortress and liberate the town!</em></strong><br/></p>\n<p>The town of Hallow is in danger, for the dark lord Darcanos is always threatening the peace. The Wizards will challenge him with your help. Fight in the labyrinthic fortress to get stronger and face the dark lord!</p>\n\r\nThe Conquest\r\n<p>The town of Hallow is devastated, and many heroes have been defeated by the army of Darcanos, the dark lord. His victory is close, but the Wizards Hocuso and Abracada will not surrender. You will become the leader of the conquest, for honor, glory and revenge. Defy the dark lord and defeat his minions in the fortress!<br/></p>\n\n\n\r\nThe Fortress\r\n<p>In the Fortress of the dark lord, you will find the Throne room, where Darcanos is waiting for you, and an infinite labyrinth, where his minions are. Enter the maze through the center of the carpet and be ready to fight! The only exit of the labyrinth is the center of the carpets, for the other exits will take you to different rooms of the maze! The difficulty is very high, for you might encounter enemies that are too powerful for you!<br/></p>\n\n\n\n\n\r\nEnhancement\r\n<p>Enhance your equipment to make it stronger. Use enhancement runes to upgrade your weapons and gear. There are many tiers of equipment, for the maximum level is 99. Among the weapons that you can use, you can find sword, bow, dagger, staff, wand, crossbow with special arrows and shurikens!<br/></p>\n\r\nCharacteristics\r\n<p>Infinite labyrinth full of enemies. Defeat the minions and get rewards, and loot the chests for more rewards!</p>\n<p>Many tiers of equipment, weapons feature sword, bow, dagger, staff, wand, crossbow and shurikens.<br/></p>\n<p>Enhancement system. Use enhancement runes to upgrade your weapons and gear. Get runes by defeating enemies, looting treasures or disenchanting jewelry.<br/></p>\n<p>Maximum level is 99.<br/></p>\n<p>You will earn allies when you get stronger up to a total of 3. These allies are Hocuso, Abracada and a mysterious creature called Shimi.<br/></p>\n<p>There are trophies, found in the Tower, and these are Collector of Treasures, Collector of Runes, Conqueror of the Fortress, Conqueror of the Darkness and Magical Enhancer.<br/></p>\n<p>Beware about dying, for you have a chance to lose treasures, runes or gold!<br/></p>\n\r\nDungeon Quest\r\n\n<p>Dungeon Quest is the story of the prologue of Dungeon Conquest. It is recommended to play this game before Dungeon Conquest to get the full experience, but it’s not needed.<br/></p>\n\r\nThe Quest\r\n<p>Once upon a time, the town of Hallow was a very peaceful place. But Darcanos, the dark lord, is threatening this peace, for he always goes to the town to claim the resources that the people get in the forests. His army is growing, and he must be stopped. The Wizards Hocuso and Abracada are the leaders of the town. Nobody dares to challenge the dark lord, for the ones who try are made to dissappear. You will challenge him, and this is the fate that will await you. Live many adventures and search for other heroes, and defy the dark lord and put an end to his rule!</p>\n\n\r\nCharacteristics\r\n<p>Help the people of the town of Hallow and protect them from the enemies.</p>\n<p>Search for the missing heroes in the strange lands far into the sea.</p>\n<p>Challenge the dark lord in his fortress and defeat his minions in the mazes.</p>\n<p>Enhancement system. Use enhancement relics to upgrade your weapons and gear.</p>\n<p>Maximum level is 30.</p>\n<p>You will earn allies in your adventure, up to a total of 3.</p>\n<p>There are trophies, found in the Tower, and these are Collector of Resources, Collector of Treasures, Saviour of the Town, Saviour of the People and Magical Enhancer.</p>\n\n\n\r\nCredits\r\n<p> Special Mention to Sithjester, Inquisitor, Mack, Granny, Whtdragon</p>\n<p>Thanks to Blizzard for the Combat System, and Drago2308 for the Quest Markers</p>\n<p>Evil Laugh by Gabemiller74 - freesound.org</p>\n<p>Music partially inspired by RM2003 music<br/></p>\n<p>Game developed by Anamura</p>\r\nSoundtrack", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T06:09:23", "background_image": "https://media.rawg.io/media/screenshots/160/16058c09f493ce8b90fe8aeea837d015.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anamura"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}