{"id": 698128, "slug": "dead-tired-carter-games-aztec_man-dillanhoyos-stat", "name": "Dead Tired (Carter Games, Aztec_man, dillanhoyos, Stathampen, Codetechninja)", "name_original": "Dead Tired (Carter Games, Aztec_man, dillanhoyos, Stathampen, Codetechninja)", "description": "<p>After working a 14-hours shift, all you want to do is go home. However this is not so easy at spirit corp. Just getting from tyour desk to the exit is a gauntlet. Your dead tired, so much so your own spirit is keep to help out. Can you leave the office?</p>\n<p>\n</p>\n\n<p>\n<br/><br/><br/><br/><br/></p>\n<p>\n</p>\n<p>Our approch to this jam was a very relaxed one. While others like to crunch and push to make the most of the week. We focused instead on the rule that our lives came first. So we all worked normal hours, not pulling all nighters or stressing too much over getting every last feature in.\r\n</p>\n<p>We focused on a small scope of 3 levels, which was achieved with most of the mechanics we wanted in, in. Though as always, some elements of the game were cut for the sake of having a finished product. \r\n</p>\n<p>This is all as the jam is at the end of the day, a jam. Life continues the day after, for many of our team, meant work the next day xD\r\n</p>\n\n<br/>\n<p><em>We made most of our game during the jam, however as few code systems were made ahead of time to let us get on with the actual game, rather than spending days just writing the backend we've written before. In industry it is also common to have code libraries to hand to help out, so why not use them here. All of these are written by Jonathan, a member of the team who currently works in industry. </em></p>\n<br/><br/><br/><br/>", "metacritic": null, "released": "2021-11-21", "tba": false, "updated": "2021-11-22T06:22:06", "background_image": "https://media.rawg.io/media/screenshots/074/074f58393aae80b0f6d36ebffd563736.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Aztec_man", "Carter Games", "Stathampen", "Codetechninja", "dillanhoyos"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}