{"id": 698307, "slug": "uncovered-kindspark", "name": "Uncovered (KindSpark)", "name_original": "Uncovered (KindSpark)", "description": "Uncovered\r\n\r\n2D Action Platformer\r\nPrepared by  \r\nEddie Fulton\r\nHamza Khalot\r\nJon Lam\r\nWayne Brown\r\nBackstory\r\n<p>In the near future, the city is run by The Powers That Be; a committee of individuals who control the inner workings of the city. Once a bastion of prosperity, The Powers fell to corruption, stealing from those they swore to protect and murdering anyone that stood in their way.\r\n</p>\n<p>Not all of The Powers, however, were tempted. Your brother, the only Power dedicated to working for the people of the city, discovered their schemes and attempted to reveal their secrets, but the Powers killed them before the evidence could reach the public. You have sworn to avenge your brother and fight against The Powers That Be. <br/><br/>This game is meant as a reminder that culture is about the things small and large passed down to us from generation to generation and sometimes in between, that artifacts don't have to be ancient to be important, and protection sometimes means starring down some of the most powerful people on the planet. <br/></p>\r\nInstructions\r\n<p>A/D keys: Move left and right\r\n</p>\n<p>W key: Jump <br/></p>\n<p>Q E keys: Change Abilities (When they’re unlocked after a Power is defeated)<br/></p>\n<p>S key: Regain health and stamina\r\n</p>\n<p>Shift key: Dash attack <br/></p><p>Enter key: Continue Dialogue <br/><br/></p>\r\nCharacters\r\nThe Bureaucrat\r\n<p>Primary Instrument: Synth\r\n</p>\n<p>“This is taking too much of my time, I have much better things to do.”\r\n</p>\n<p>The Bureaucrat hates waste; any worker under his cost/benefit threshold gets fired on the spot. Every second must be spent wisely; every plan must be meticulous. The Bureaucrat argues day and night with the other Powers, working to move wealth around to its proper place. He is always calculating and planning. His favorite quote: “Efficiency is doing things right; effectiveness is doing the right things.”\r\n</p>\r\nThe Organizer\r\n<p>Primary Instrument: Trumpet\r\n</p>\n<p>\"We could be kin, but you're focused on the wrong fight.\"\r\n</p>\n<p>The Organizer: planner, supervisor, leader, he does it all. Whether scheming under a single light in his office, commanding lackeys with the authority of a CEO, or screaming commands using his trusty megaphone that never leaves his side, The Organizer is a loud, boisterous leader with command over his robot workers and a desire for order.\r\n</p>\r\nThe Rebel\r\n<p>Primary Instrument: Banjo\r\n</p>\n<p>“Hmph. We don’ take kindly to strangers in these parts.”\r\n</p>\n<p>The Rebel doesn’t like you. He doesn’t even like the other Powers that much. He only likes his own community and his own people. But when The Powers offered him land and scissors to cut red tape, he couldn’t let the opportunity pass. He acts as an intermediate between one of the largest food/farming industrial coalitions and The Powers, securing illegal work permits and subsidies. He’s pretty racist.\r\n</p>\r\nThe Philanthropist\r\n<p>Primary Instrument: Sax\r\n</p>\n<p>\"Your heart bleeds because your spine is weak.\"\r\n</p>\n<p>On the surface, The Philanthropist is a kind and noble soul, giving his wealth to charities and helping the poor. At his core, The Philanthropist ensnares everyone he meets, using his charm and resources to subtly nudge others to do his bidding. Over time, suggestions and tips become commands as he secretly threatens to take the very gift away from those who take from his coffers. \r\n</p>\r\nThe Mayor\r\n<p>Primary Instrument: Violin\r\n</p>\n<p>“The people elected me. I was, of course, the only one on the ballot.”\r\n</p>\n<p>The Mayor loves the spotlight and giving speeches. His heart swells every time the people cheer and scream his name. Never mind that half of his followers are paid for. He lives comfortably in his mansion, planning his next campaign rallies years in advance.\r\n</p>\r\nThe Chief\r\n<p>Primary Instrument: Electric Guitar\r\n</p>\n<p>“I’ll have no disturbances in my city. Absolute vigilance requires absolute power.”\r\n</p>\n<p>The Chief is responsible for the safety of the city. Safety requires power, so The Chief will stop at nothing to achieve order in his society. Protests fade to silence and riots are a thing of the past. Dissenters disappear before a single sound can be uttered. As long as The Chief is here, his robot enforcers roam the streets in search of unusual activity.\r\n</p>\r\nThe Money\r\n<p>Primary Instrument: Piano\r\n</p>\n<p>“I’m so bored. How much would it cost to entertain me?”\r\n</p>\n<p>The Money has too much money and too much time. What do you want when all that you want is had? He turns to people as entertainment, seemingly giving out money randomly just to get them to do something different. He helps fund much of The Power’s activities, but only because he’s interested in what the people might do. Maybe someone will fight back…\r\n</p>", "metacritic": null, "released": "2021-11-20", "tba": false, "updated": "2021-11-22T07:06:45", "background_image": "https://media.rawg.io/media/screenshots/66f/66f8fc7c4ee3a0f6de7443ae4bc11b31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KindSpark"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}