{"id": 698430, "slug": "cubys-quest-op-cleanup-oceans", "name": "Cuby's Quest: Op. Cleanup Oceans", "name_original": "Cuby's Quest: Op. Cleanup Oceans", "description": "<p><strong>Help the rescue team and their cute lil robot once again in their new quest about... Cleaning up trash from the ocean??</strong><br/></p>\n<p>That's right, i didn't forget about him... Cuby and the rescue team are once more back, and this time they have a very important task on their hand: Cleaning up the trash from the ocean (or at least as small part of it). Help them in this small \"match the tile\" game, made to help promote ocean preservation, to <strong>locate, remove and recycle </strong>(aka. the big 3 steps of ocean preservation) the trash out of the ocean!! It's not much but i hope you enjoy it anyway!! (^u^)</p>\n<p>You want to help too clean up the oceans?? Check out teamseas.org!!</p>\n<p>(Or, you know, just promoting the cause, in any way that you want, is also fine!! :3)</p>\n<strong>CONTROLS</strong><strong>(They are written on screen, but I'll write them here anyway)</strong>WASD / Arrow KeysMoveSpacebarIneract with tiles / Throw trash outEscapePause gameMouseInteract with Settings / UI\r\n\n<p>(A screenshot of this game!! Isn't cuby a little cutie?? ^u^)</p>\n<p>...And yes, i'll update the cover at a later time ...Or maybe not, i kinda like the way it is rn :P</p>\n<p><strong>My small little journey (Some backstory)</strong></p>\n<p>Ok, since I've heard about team seas i knew i wanted to make something about it, since is a cause that i REALLY care about. I wanted to do more than just donating tho: I wanted to make something more personal about it, something that i could store deep in my hearth, and that will remind me of this cause every time that i would see it... I didn't think of making a game that time, i wanted to make a fanart of the protagonist from an anime close to my hearth, who its main plot is essentially to invade and take over humanity as a punishment to polluting the sea too much</p>\n\n<p>(In case you was wondering, this is the fanart that i made of her. And yes, all the text above is just me trying to find an excuse to fit this beautiful fanart i made in the game description &gt;D&lt;)</p>\n<p>Some time later after, Barji and PolyMars poster their video about making a game about cleaning the ocean, and PolyMars in his video announcing the SEAJAM game jam, and this is where i saw an opportunity to, not only make something about a cause that i care about, but to channel something i'm really passione about it, and that i really enjoy doing (that is, making small games) and also to promote the cause to others, that can maybe will choose to do something about it. Undeless i was thrilled about it!!</p>\n<p>But, for personal reason and also because i have another game jam that i REALLY don't want to miss, i put myself over the time limit of doing it in one week. So i started to think of an idea. Originally i wanted to make an endless version of the minigame in <em>tLoZ: Phanthom Hourglass</em> minigame (except that the treasure would have been trash ofc), but after many, MANY, iterations  i choose to make a card game where you and your opponent could pick \"trash card\" from the a shared center zone, and with them you would craft card to attack (or defend) from your opponent. I started to making it right away, without never thinking that maybe it was too big of an idea to make in a week</p>\n\n<p>(Design concept of what the card game i originally wanted to make)</p>\n<p>Some days has passed, and we are in the middle of Day 3 when i was lurking in a stream of an artist friend of mine, will_0_the_wisp, where i was talking about how i explained to him and his chat about the game i was making, when he had an idea of <em>an small management/adventure game about a treasure hunter the ends up collecting trash in a \"match the tile\" like game to sell it and traver more far around the world</em>. I liked the idea more of what i was currently doing (maybe because i was starting to realize that my idea was too complex? idk :P) and decided to try to make his idea</p>\n\n<p>(The sketch of the idea he had that he sent me. I still think that his a cute idea. One day maybe i'll try again to make a small prototype about it, idk)<br/></p>\n<p>So i spent all the day trying to make it. That's when i realize that the idea was to big and complex for me to do (even if had extended my time limit, i don't think I'd actually been able to pull it off). But i still liked the idea, i spent the next 3/4 days making this, and that's basically how the idea for this game is born. I still feel bummed out that i couldn't manage to make his idea (or follow any of his advices, really... -w-)</p>\n<p>I had a lot of fun while making this game, I hope u have a good time too with this game too. Happy ocean cleaning!! ~degeso </p>", "metacritic": null, "released": "2021-11-20", "tba": false, "updated": "2021-11-22T07:35:21", "background_image": "https://media.rawg.io/media/screenshots/e4e/e4ec2e195286dfddd8300404bda7c0ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Marxy 37"], "genres": [], "publishers": [], "esrb_rating": null}