{"id": 698555, "slug": "not-so-paper-rpz-early-prototype", "name": "Not-so-Paper RPZ (Early Prototype)", "name_original": "Not-so-Paper RPZ (Early Prototype)", "description": "<p>Controls: Arrows to stretch out your tether to dodge.  Hold Z to charge a spindash, and use arrows to aim. Press R to restart at any time, And you might have to click the game window for it to start processing your inputs.</p>\n<p>Credits:<br/>Music - Main music is by Karl Brueggemann, \"victory\" theme from Sonic Unleashed.<br/>Art: custom art by me and Sofia, Artstyle based on this TSR sheet by Red-Bun.</p>\n<p>Meet the characters:<br/>Blueberry: An antisocial dork, accompanied by her trusty <strong>berry bombers</strong>. She somehow got dragged along on some quest to save the world. something about a \"chao's emerald?\" (Blueberry is the character in this demo)</p>\n<p>Spark: Some nerd with an arm cannon. Bad at combat, good at ranting about hardware limitations.</p>\n<p>C.R.O.S.S.H.A.I.R.: An experimental battle robot designed to mimic the abilities of its opponent. (Batteries not included)</p>\n<p>Pixl: A [SPOILERS] who uses his [SPOILERS] to [SPOILERS] to other [SPOILERS], including [SPOILERS]. [SPOILERS], of course, doesn't [SPOILERS] each time the [SPOILERS], so Pixl is able to [SPOILIERS] there to [SPOILERS] the [SPOILERS]. In this game, Pixl will use his [SPOILERS] to [SPOILERS], but then suddenly [SPOILERS] you, since every [SPOILERS] of [SPOILERS] makes him [SPOILERS] of [SPOILERS], the original [SPOILERS] from the [SPOILERS]. At the end of the [SPOILERS], [SPOILERS] and [SPOILERS] used an ability called [SPOILERS] to [SPOILERS], leaving Pixl to [SPOILERS]. when he stumbled upon [SPOILERS], Pixl used [SPOILERS] to [SPOILERS] every [SPOILERS]. after a [SPOILERS], Pixl realizes that unlike the previous [SPOILERS] of [SPOILERS], these [SPOILERS] were actively trying to [SPOILERS]. He'll later [SPOILERS] to [SPOILERS] [SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS][SPOILERS]</p>\n<p>Test Enemy: not much is known about test enemy. he takes the form of one of the Segasonic bros, and throws [HYPERLINK BLOCKED] at you.</p>\n<p>Q&amp;A:<br/>Q: Why is the enemy just a yellow sonic?<br/>A: when the custom sprites were still incomplete, Blueberry and Spark (a yet-to-be-added playable character) were simply blue and red Sonics. one segasonic bros joke later, and we made the yellow sonic be the enemy, and included the white sonic from later levels in the corner. everything got switched out, but we kept the yellow sonic as a test enemy.</p>\n<p>Q: Why do I keep dying immidiately?<br/>A: get gud lmao- I mean, practice dodgeing with the arrow keys. once you've mastered your defense, go in for the offense with Z!</p>\n<p>Q: What the heck is a RPZ?<br/>A: RPZ (formerly Taels' Roleplay Land) is a series of Sonic Roleplay discord servers created for me and a few friends. The stories in these servers have created some really interesting lore, so I thought it was about time that these amazing stories became a bit more playable!</p>\n<p>Q: okay, but what's with the \"not-so-paper\" thing?<br/>A: this game was previously being developed under the title \"Paper RPZ\" and took heavy inspiration from the Paper Mario series. as development slowed down, I decided to tone down the scope of the game, turning it into a 2D game, focusing on the combat and story. when I went to name the project, I just typed the first thing that came to mind.</p>\n<p>Q: why does this game suck<br/>A: good question</p>\n<p>Q: why are there so many unused songs?<br/>A: hey, stop poking around in there and leave \"doink song.webm\" alone!<br/>You wouldn't want to...<br/>\"upset\" doink...<br/></p>\n<p>Q: which came first, the chicken or the egg?<br/>A: yes</p>", "metacritic": null, "released": "2021-11-20", "tba": false, "updated": "2021-11-22T08:11:02", "background_image": "https://media.rawg.io/media/screenshots/d54/d542784ce9e40864302b96f8b35fb4fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TaelsDaFoox"], "genres": ["Action"], "publishers": [], "esrb_rating": null}