{"id": 698675, "slug": "thrive-revolutionary-games-studio", "name": "Thrive (Revolutionary Games Studio)", "name_original": "Thrive (Revolutionary Games Studio)", "description": "<p>Thrive is an open-source game about the evolution of life. Our main goals with thrive are to create engaging, compelling gameplay that respects our players’ intelligence, and remain as accurate as possible in our depiction of known scientific theory without compromising the former.</p>\n<p>In Thrive, you take control of an organism on an alien planet, beginning with the Last Universal Common Ancestor (LUCA). Your goal is to survive in the environment, adapt your species by adding mutations, and thrive. Other species will emerge to compete with yours. They will evolve via a population dynamics driven simulation with random mutations - you must improve and spread your species to surpass them. The success of your species depends both on your skill in surviving as an individual cell and the changes you make in the editor.</p>\n<p>In the Microbe Stage, you control a single microbe or a colony of microbes bound together. You swim through a watery environment to find the resources your cell needs to stay alive and to reproduce. Once you have reproduced, you enter the editor, where you can review how well your species and others are surviving, move to new biomes, and modify your species. Add new organelles, change your membrane, and change your cell's visuals. Your goal is to become a more complex lifeform by first evolving the nucleus to become a eukaryote, then using binding agents to form cell colonies, the precursor to the first multicellular lifeforms.</p>\n<p>Currently we are working on the first stage which is focused on microbes and microbiology. Only the first stage of the game is currently playable and it's missing some features. We do however have the core gameplay loop - surviving in the environment and editing your species in the editor - up and running. Many organelles are already implemented, some are still waiting to be added. We will also dramatically expand the algorithm behind other species' evolution. Note that these later stages are not in the game currently.</p>\n<p>The game is built in the open source Godot engine with the C# programming language. The source code is GPLv3 licensed and our assets are Attribution-ShareAlike 3.0 Unported licensed. We are always looking for more talented developers to join our team, or if you prefer, you can directly head on over to our Github page and contribute. Alternatively, you can purchase the game to support future development. We would also really appreciate it if you told others about the game and engaged with the community. Come hang out on our community forums or Discord to talk with other Thrive fans and developers.</p>\n<p>Thrive has spent many years in development as a volunteer project. It's been a long journey for us to even reach as far as we have, but we think we now have a solid playable foundation. We are now offering Thrive in exchange for payment in the hopes is that the increased funding will help speed up the game's development into the future.</p>\n<p>You can try the game for free from our website: https://revolutionarygamesstudio.com/ or get the source code and compile the game yourself. </p>\n<p>We would love to have you along for the long ride!<br/></p>", "metacritic": null, "released": "2021-11-18", "tba": false, "updated": "2021-11-22T08:43:50", "background_image": "https://media.rawg.io/media/screenshots/199/199a795c88a25bbdc09ef80014f974b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Revolutionary Games Studio"], "genres": ["Action", "Simulation", "Educational"], "publishers": [], "esrb_rating": null}