{"id": 698659, "slug": "sansu-vs-lords-of-the-meat", "name": "Sansū VS Lords of the meat", "name_original": "Sansū VS Lords of the meat", "description": "<p>Sansū VS Lords of the meat is a hack'n'slash game, combined with a math fight mechanic. It was produced during an intern game jam at the Zürich University of the Arts, with a team of 14 game design students.<br/></p>\n<p><strong>How to play</strong></p><p>Move around with WASD<br/>Basic hit with spacebar or left mouse click<br/>Trigger a special \"maths\" ability with :<br/>-F for melee attack, answer the addition operation to confirm <br/>-R for range attack, answer the subtraction operation to confirm<br/>-E for AOE attack, answer the multiplication operation to confirm<br/>Break boxes to collect meat and recover HP</p><p><strong>Background story </strong></p>\n<p>Dogs fight against the human overlords that made them homeless (and replaced them by robots) in the first place, and now even destroy their habitat. Humans are decadent, fat, giant, evil, and most importantly gruesome with their intelligence and modern technology. Meanwhile, the dogs, former slaves, live in poverty in tribal/nature-friendly communities but have to live a sad life surrounded by all kinds of waste dumps, sicknesses, and hunger. They go on the hunt. In ambushes they attack robots that gather meat for the humans, to survive the coming winter. </p>\n\r\nTeam distribution<br/>Dogs used to be precious allies to humans.<br/>But humans got lazy and created robots so they could do the hunting for them without asking for their share of the loot. They drove the dogs off their lands.<br/>But our hero Sansū is determined to make it end and is on his way to defeat the human overlord.", "metacritic": null, "released": "2021-11-19", "tba": false, "updated": "2021-11-22T08:38:21", "background_image": "https://media.rawg.io/media/screenshots/0d1/0d19f69b80664c7a0ac411ef0e0f6b68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["manolo.wi", "Pascal Aregger", "LenzKleiser", "katbo", "lholzen", "Dragonstar", "Natascha2", "Léa Coquoz - leapero", "LyannJohnes", "nightdropdev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}