{"id": 698993, "slug": "garage-bad-dream-adventure", "name": "Garage: Bad Dream Adventure", "name_original": "Garage: Bad Dream Adventure", "description": "<p>Garage - This weird machine is said to create a bizarre dark world by working on the subject&#39;s subconscious mind.<br />\nThe player character is thrown into an enclosed world filled with sewage, with decaying wooden buildings and rusted metals.<br />\nAnd he discovers that his body has been changed into something in between a machine and a living creature.<br />\nHe wanders around this structurally complex maze-like world in search of a way out.<br />\n&quot;Garage: Bad Dream Adventure&quot; was originally released as a PC adventure game in 1999. In this game, the player character enters his inner world through a psychotherapeutic machine. He is turned into an odd-looking biological machine and searches for a way to escape from that world. Because of its unique world setting, it is described as one of the top 3 warped games or bizarre games.<br />\nIt is basically a mystery-solving exploratory adventure game. But it also has many RPG elements such as character development through body modifications and intricate fishing system. And the story questions the ambiguity of escaping from the world and staying in the world.<br />\nOne of the features of Garage is its detailed world building. Elements like energy circulation, ecosystem and how the world came about are intertwined tightly, and are reflected in the game system, bringing to life the feel of the deep another world. The unique feeling of strangeness and anxiety surrounding the whole game, even though it is not a horror or depressing game, is created by these settings and system.<br />\nIn this mobile remastered version, almost all images have been retouched, videos have been revised using AI frame interpolation, user-interface and game balance have been improved, and new chapters, subquests and multiple endings have been added.</p>", "metacritic": null, "released": "1999-10-10", "tba": false, "updated": "2022-07-08T04:16:57", "background_image": "https://media.rawg.io/media/screenshots/126/126f7372726a8ac8c1ad19914db06649.jpg", "website": "https://garage.t-s-k-b.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 16, "toplay": 4}, "playtime": 6, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["SmokymonkeyS", "Tomomi Sakuba", "作場金属製作所 Sakuba Metal Works"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Tomomi Sakuba", "作場金属製作所 Sakuba Metal Works"], "esrb_rating": "Teen"}