{"id": 699078, "slug": "invitation-to-fear", "name": "INVITATION To FEAR", "name_original": "INVITATION To FEAR", "description": "『INVITATION TO FEAR』 is a survival horror game for 1 to 4 players.<br/>After receiving one of the invitations, you will wake up in an unfamiliar place.<br/>Before long, you will realize that a terrifying creature is wandering around the building. Don't let \"her\" find you.<br/><br/>You will need to run, hide, and utilize items in the area in order to survive.<br/>Don't think about defeating the monster head on. Look for the cursed statues scattered around the area. Destroying the cursed statues will lead to your victory.<h3> Features </h3><ul><li> Online co-op play with 1 to 4 players<br/>You can also play with your friends or play alone.<br/>If you feel uneasy on your own, you can also send an invitation to your friends. You can even overcome your fears with your friends.<br/></li><li> Single play mode<br/>Only you and the monster are in the field. It doesn't get in the way of anyone.<br/></li><li> Different play experience each time<br/>Useful items to protect yourself are randomly placed each time.<br/>Sometimes it's a good item, sometimes it's a bad item. Please use properly according to the situation.<br/></li><li> Enemies with Abilities<br/>The enemy will use your abilities to deceive you.<br/>If the enemy's location changes instantly, it's probably their ability.<br/></li><li> Be careful of the sound<br/>Sound is important. You can detect approaching enemies by sound, but you can also attract them by the sound of your own footsteps or the sound of traps operating.<br/></li><li> Difficulty change<br/>The movement of the enemy changes depending on the difficulty level. I'm sure it will increase your fear.</li></ul><h3> Attention </h3>This game contains flashing lights, which may make it unsuitable for people with epilepsy who are sensitive to light. Please be careful of all players.", "metacritic": null, "released": "2021-11-24", "tba": false, "updated": "2021-11-26T03:52:50", "background_image": "https://media.rawg.io/media/screenshots/dc4/dc443ada17bfb4535556a09f2c01b5cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 2, "achievements_count": 13, "ratings_count": 1, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CHEST BOX"], "genres": ["Action", "Indie"], "publishers": ["CHEST BOX"], "esrb_rating": null}