{"id": 699135, "slug": "island-questaway", "name": "Island Questaway", "name_original": "Island Questaway", "description": "Welcome to the island!<br/><br/>The secrets of an ancient civilization, family drama, an intricately designed story, and landscapes straight from paradise await you!<br/><br/>Emily sailed to the island to find her brother, only to then get tangled in an exhilarating whirl of activity. In this exploring game, you help her as she develops her family estate, makes friends with locals, and traverses picturesque ruins!<br/><br/>If stories are to be believed, a prominent civilization once lived on this island, known for its cutting-edge technological advancements. For reasons unknown, it fell into ruin. Now is the time to find out what fate befell the ancient people and discover their legendary treasures.<br/><br/>Cultivate valuable resources, join exciting expeditions, and travel through the jungle to uncover the secrets of this treasure island and save Emily's brother!<br/><br/>Features:<br/>● An intricate story<br/>Throughout Emily's adventures on the island, danger and surprises are always just around the corner. You never know what will happen next!<br/>● The family estate<br/>A large estate on the ocean shore is yours to manage. Furnish and decorate it as you progress. Remember that a bountiful harvest and a high income grant you more resources for exploring the island.<br/>● Mental exercises<br/>All the minigames the island has to offer assure you’ll never get bored!<br/>● Secrets of the island<br/>What happened in this secret paradise eons ago? Why did an entire civilization meet its demise? What lurks in the ruins? It's up to you to uncover answers to all these questions!<br/>● Expeditions<br/>These are not your average camping trips! Enjoy an exciting adventure in the heart of the jungle.<br/>● Treasure hunt<br/>Become an avid treasure hunter and add valuable finds to your collection.<br/>● Eye-pleasing design<br/>Colorful and captivating graphics with attention paid to every detail brighten up the game, making it stand out from the crowd.<br/><br/>Let this exhilarating adventure distract you from the everyday fusses and bustle of life! Emily, our brave hero, hopes that you will join her on the lost island.<br/>Farewell!<br/><br/>Enjoy Island Questaway? Follow our Facebook Page: https://www.facebook.com/IslandQuestaway/", "metacritic": null, "released": "2021-11-03", "tba": false, "updated": "2021-11-26T04:36:48", "background_image": "https://media.rawg.io/media/screenshots/bec/bec69c5b176485e3d2e0c71d5fa63447_XaLMPZZ.jpg", "website": "http://nextersglobal.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nexters Global"], "genres": ["Adventure", "Puzzle"], "publishers": ["Nexters Global"], "esrb_rating": "Everyone 10+"}