{"id": 699102, "slug": "amber-island", "name": "Amber Island", "name_original": "Amber Island", "description": "<strong>Amber Island is an open world creature collector.</strong><br/>Your adventure begins as you venture out with your first companion into the wilderness. Grow your team and battle in the grand tournaments to gain access to new and exciting lands to explore each filled with new challenges and creatures to collect and breed.<h3>HUNTING</h3><br/>Creatures roam the wilds in search for food and water and form herds to protect their group members from the other predatory creatures (and you) that seek to hunt them.<h3>STRATEGIC COMBAT</h3><br/>Punchy turn-based combat featuring:<br/><ul><li>Defence move system for dodge, parry, reflect and more.<br/></li><li>Synergies for each of the elements; Air, Earth, Fire, Water, Life, Death.<br/></li><li>Wide variety of moves balanced through consequences.<br/></li><li>High stakes battles where creatures can die permanently.</li></ul><h3>BREEDING</h3><br/>Each species in Amber Island can display a dazzling array of colours and patterns as well as variations that change the full design and colour pallet of the species.<br/><ul><li>Collect rare gene variants.<br/></li><li>Breed creatures to get any combination of design, pattern and colours.<br/></li><li>Improve your creatures stats through selective breeding.</li></ul><h3>LUSH ENVIRONMENTS</h3><br/>Travel to Amber Islands lush and diverse wilds in search of new challenges and creatures to collect.<h3>RESOURCE MANAGEMENT</h3>Creatures in your collection consume different types of food that you have to provide. Without food creatures become ill, take damage and eventually die. Don't worry however, if you run into any money problems you can sell some creatures which both makes you money and reduces your costs.<br/>Explore for precious minerals, farm bountiful crops and hunt creatures all to obtain the items you require to tame your companions.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-26T04:13:43", "background_image": "https://media.rawg.io/media/screenshots/a32/a32fbaa41436c2cf71c4f6304bb99b9c.jpg", "website": "http://dynamiccellgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dynamic Cell Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Dynamic Cell Games"], "esrb_rating": null}