{"id": 699109, "slug": "fishkeeper-2", "name": "Fishkeeper", "name_original": "Fishkeeper", "description": "<strong>Become a professional aquarist — completely immerse yourself in the fish world!</strong><br/><br/>Take care of multiple aquariums by providing fish and other animals with food, suitable conditions and nice company; multiply and sell the best specimens at auctions while developing your aquarium empire; buy better equipment, rare species and build bigger tanks. <br/><br/>Show creativity: add plants and decorate your aquarium. Take care of your fish and they will repay you with their beautiful appearance that you can admire up close using your own hand-made bathyscaphe!<br/><br/><h3>MAIN FEATURES OF THE GAME:</h3><ul><li>Combining an economic strategy with a simulator: meet the needs of fish and observe their lives in real time, while ensuring good breeding results;<br/></li><li>A wide variety of freshwater, marine, coral, shrimp, snails and other aquatic species are available;<br/></li><li>Customize the aquarium equipment, shape, size and appearance of tanks;<br/></li><li>Buy animal and plant species, sell bred fish in the store and, exceptionally, fine and rare specimens at an auction;<br/></li><li>Watch the views from the bathyscaphe cabin as you control it inside the aquarium; you can also use it to clean the tank from the inside;<br/></li><li>Decorate your aquarium with lots of decorations, corals, posters etc.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-26T04:18:58", "background_image": "https://media.rawg.io/media/screenshots/3de/3de7905a523eca36f140d11836dae129.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blinkclick Games"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Blinkclick Games"], "esrb_rating": null}