{"id": 699162, "slug": "survival-456-but-its-impostor", "name": "Survival 456 But It's Impostor", "name_original": "Survival 456 But It's Impostor", "description": "Are you a fan of Squid Challenge Survival? Or you are a fan of Impostor Crewmate? Join us in Squid But It's Impostor game. A combination of two top-notch theme games can make you satisfied? Old but gold!<br/><br/>Now, this red light folk game is available on smartphones and you can play it anywhere, whenever you want. Not only the red, green light game but also four classic iconic games are for you. Easy to play but not easy to win. <br/><br/>Full modes are now available:<br/>- Red, green light <br/>- Glass Bridge<br/>- Tug of War<br/>- Dalgona candy<br/>- Marbles<br/><br/>How to play Squid But It's Impostor game:<br/>ϟ Touch the player to move<br/>ϟ Run fast while the doll is counting<br/>ϟ Stand still when the doll turns its head<br/>ϟ Be one of the 5 people to finish first<br/>ϟ The game will end if you reach the finish line late and let the red light see you move<br/> <br/>Now your motion supervisor is a doll. Try to run as fast as you can to the finish line without being detected by the doll. You have to try to run fast and touch the wall because only the first 5 people to the finish line can survive. If you are not in the top 5, the worst will come to you.<br/>The doll will change the counting speed continuously, sometimes very quickly and sometimes very slowly. What you need is the speed and acumen of this scary doll in rhythm counting. Or it can be understood that you need to move sneaky but quickly to reach the finish line.<br/> <br/>Game Features<br/>✶ Many levels with different difficulty<br/>✶ Levels are constantly being updated<br/>✶ Simple design, easy to control<br/>✶ Beautiful and vivid graphics with realistic sounds.<br/> <br/>4️⃣ 5️⃣ 6️⃣ Attention all players, the game is about to begin!!! 4️⃣ 5️⃣ 6️⃣<br/><br/>Would you like to become participant number 456? Beat off other competitors and be the only one who wins 45.6$ billion Golden Piggy Bank. Pass all the levels to become the champion and get the reward you deserve.<br/> <br/>If you love the Squid But It's Impostor game, rate us 5⭐️⭐️⭐️⭐️⭐️ and leave your feedback below. Your support is always the motivation for us to continue to develop even better products in the future.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-26T04:52:00", "background_image": "https://media.rawg.io/media/screenshots/fad/fad67f5c14290e52eb4aadd2dad97c54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Great Arcade Games"], "genres": ["Action"], "publishers": [], "esrb_rating": "Everyone 10+"}