{"id": 699288, "slug": "aer-a-game-of-wind", "name": "Aer: A Game Of Wind", "name_original": "Aer: A Game Of Wind", "description": "<p><strong>A breeze flows though the world, pushing and moving the things around it, you are this wind, you are </strong><em><strong>Aer</strong></em><strong>.</strong></p>\n<p>Aer is a small physics puzzler I made for Global Game Jam 2018 in Glasgow (This was back when I was in Glasgow Caledonian University). I was in a one man team at the time and simply wanted an interesting way to move the player around the stage. There were several small challenges that the GameJam had, one of these was to develop all ingame text and menues in a made up language. The original game was made under 48 hours. Originally I didn't intend to do much other than patch it if people game is some love and requested for stuff to be fixed; however, a artist contacted me a short time after the Jam to offer art. Thus the game was under development for a bit of time, then it stopped.</p>\n<p>Currently, the game is very very short, with only two puzzles. The goal is to get the cube into the well by controlling the wind.\r\n</p>\n<p><strong>Note:</strong> I did not make the models, nor the music however they are free to use, and I have credited them appropriately in the Credits of the game.\r\n</p>\n<p><strong>The controls are somewhat tricky, you must continue building up wind force on multiple directions so that you can tip the cube over (Just pressing D is very inefficient). You use WASD to control the cube.</strong>\n</p>\n\n<p>Disclaimer: I am 'Preferably Broken', I originally posted this on gamejolt, but I've since moved onto here. <br/></p>", "metacritic": null, "released": "2021-11-25", "tba": false, "updated": "2021-11-26T05:22:16", "background_image": "https://media.rawg.io/media/screenshots/ff5/ff54918f13efdf766b4833701a082b61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pip"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}