{"id": 699454, "slug": "troy-homiesquad", "name": "TROY (HomieSquad)", "name_original": "TROY (HomieSquad)", "description": "<p>In the far future, humanity has witnessed the rise of corporations. You as the player are in control of a government bot sent to take down the biggest and most evil corporation of them all. In this top-down bullet-hell game, infiltrate the HQ and kill corrupted businessmen and uncover the secrets of the corporation. </p>\r\n\"It is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.\"\r\n<p>Ensure you make them see God. </p>\n<p>______________________________</p>\r\nOverview:\r\n<p>Troy is a first-person 2d top-down bullet-hell action game, centered around fighting, and killing the boss. \r\n</p>\n<p>The game’s theme is that of a cyberpunk futuristic world taken over by evil corporations, with the story focussing on the protagonist, a government agent bot infiltrating one of these corporations.</p>\n<p>______________________________</p>\r\nControls:\r\n<p>The controls for this game are intended to be simple so that players can focus more on the fast-paced action rather than remembering key bindings.\r\n</p>\n<p>The main controls for Troy revolve around movement, with the WASD keys moving the player character up, left, down and right respectively, with the mouse being used for aiming and shooting with the left mouse button.\r\n</p>\n<p>Items can also be picked up, which is done with the E key, which is often the key associated with using or activating in other games and should allow most players to remember its function easily. The Spacebar can also be used as an additional supplementary keybind for those players that prefer it.\r\n</p>\n<p>During the dialogue, when the handler has finished speaking, the player can press either the E or Spacebar keys to move onto the next section of dialogue or quit the dialogue screen is completed.\r\n</p>\n<p>Lastly, the player can press the Escape (ESC) key to open up the pause menu.\r\n</p>\n<p>______________________________<br/></p>", "metacritic": null, "released": "2021-11-25", "tba": false, "updated": "2021-11-26T06:00:50", "background_image": "https://media.rawg.io/media/screenshots/73f/73f02b7847aa873173fb589940a54a45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HomieSquad"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}