{"id": 699939, "slug": "tempest-tavern", "name": "Tempest Tavern", "name_original": "Tempest Tavern", "description": "<p>Has your favorite TTRPG character retired? Or maybe they never got to finish their campaign? Did they survive the big bad and now just want to settle down and buy a nice tavern with their loot? Then Tempest Tavern is the game for you. It is a solo RPG game played on your computer with your favorite TTRPG character. </p>\n<p>There are many things to do as a new tavern owner hire staff, check the storage area, or even finally get a good nights rest. There are 7 different possible employees with skills ranging from cooking to cleaning to impressing the guests with their stories. </p>\n<p>Create your own menu choosing drinks and food to serve. </p>\n<p>Depending on how well opening night goes the local paper may even run an article on your tavern describing the delicious pies or entertaining stories.</p>\n\n<p>QA</p><p>Question: Are there other games like this out there?</p><p>Answer: As far as I know this is the first video game you can play with retired TTRPG character. </p>\n<p>Question: What TTRPG systems does this support?</p>\n<p>Answer: This is system agnostic however it does have a fantasy vibe.</p>\n\n<p>Question: Do I need a retired character for this?</p>\n<p>Answer: No you can play with an unretired character or even if you don't have a ready made character.</p>\n\n<p>Question: Do I need paper or a pen for this?</p>\n<p>Answer: No, the game is entirely played on a computer.</p>\n\n<p>Question: How long does this game take?</p>\n<p>Answer: Currently it can be played in under 30mins of casual play but the exact length can vary depending on how long you take to make decisions and what plot lines you chose. If you make choices very quickly you may finish considerably quicker. Take your time and really think through what decisions your character would make because many choices affect things later in the game. Some employees for example open up additional story lines later on in the game. </p>\n\n<p>Question: How replay-able is this game?</p>\n<p>Answer: Very </p>\n\n<p>Question: Will more content get added?</p>\n<p>Answer: Yes! once the first 10 copies are sold.</p>\n\n<p>Question: Will you ever make a multiplayer version?</p>\n<p>Answer: I would like to but unfortunately it would probably cost around $4,000 to develop an expanded multiplayer version.  If that is something you would like to see feel free to donate towards it. </p>\n\n<p>Question: Have you considered making other adventures for retired TTRPG characters?</p>\n<p>Answer: This is the first one I've made. I'd like to make more but I'm going to wait and see how this one does first. If it is something people enjoy I will probably make more. </p>", "metacritic": null, "released": "2021-11-23", "tba": false, "updated": "2021-11-26T08:02:09", "background_image": "https://media.rawg.io/media/screenshots/e7e/e7e35c70aa2b4925f8dc8b3e39c417f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GildedOctopusStudios"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}