{"id": 700270, "slug": "t-time", "name": "T-Time", "name_original": "T-Time", "description": "Teleport and swap places with your opponents or even with platforms!  Teleport away from certain death and leave your opponents there to die instead! Trigger traps with grenades! Chaotic, confusing, fun and fast! T-Time is 2-4 player competitive local multiplayer game, which awards players for mastering the game mechanics!\r\n\r\nTRY FOR FREE:\r\n<p> The demo consists of 5-10 levels. The game is still in development, so I will be occasionally changing the selection of levels in the demo (to see which levels work and which don't). PLEASE NOTE the game is only for 2-4 players and requires game controllers.</p>\n\r\nCONTROLS:\r\n\r\nSUPPORTED CONTROLLERS:\r\n<p> The game has been tested with the following controllers in Windows: Xbox 360 Wired, Xbox One / Xbox Series X (over Bluetooth and Wireless Adapter), Switch Pro (over Bluetooth), Playstation 3 (over USB), Playstation 4 (over USB and Bluetooth). If you are using other controllers than listed, please leave a post and I will try to see if I can add support for that controller.</p>\n\r\nSTATUS OF THE PROJECT:\r\n<p>The game is currently in development. I plan to release the game offcially in 2022. For example game music and more sound effecs will be added in the future. And of course much more levels! If you want to support development of the game, please consider leaving feedback, for example if you like some levels or hate some levels :) I really appreciate any feedback! And if you want to help the project by donating, for $5 donation you will get the full version of the current build of the game (which currently includes around 30-40 levels) and all updates. And of course the final game when it is released. But as the game is still in development, not all levels in the current build are in balance. That's why I recommend trying the demo first.</p>\n\r\nNOTE ABOUT RUNNING THE GAME:\r\n\n<p>Windows Defender might block running the game, solution for this: In the Windows Defender popup window, click the \"More Info\" link, and then click \"Run anyway\" button. Then the game should launch normally. I'm really sorry for the inconvience! More info here<br/></p>", "metacritic": null, "released": "2021-11-20", "tba": false, "updated": "2021-11-26T09:30:47", "background_image": "https://media.rawg.io/media/screenshots/8e1/8e1c2f82133078304c303b5f483df571.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CodeFraction"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}