{"id": 700264, "slug": "the-last-of-us-winter-hunt", "name": "The Last of Us: Winter Hunt", "name_original": "The Last of Us: Winter Hunt", "description": "<p>You play as Ellie, hunting for food in the cold of winter.</p>\n<p>Use the num-pad or left or right arrow keys to aim Ellie.</p>\n<p>Press 'SPACE' to fire.</p>\n\n<p>This project saw many iterations and multiple fresh starts. It began life as a simple poster in the dark that could be seen with a flash light (that had some bad batteries). It then moved onto a click the firefly game (also the source doesn't actually contain real fireflies), but didn't have a good visual to it. It then went very experimental with a \"stop the ivy from reclaiming buildings for nature.\" When all of those either failed or were lack-luster, I decided to embark on an ambitious journey to recreate a pivotal and tone setting scene as a mini-game.  (I was inspired by 90s/00s flash games that advertised bands or shows)(there is also obvious inspiration from Oregon Trail as a major part of the Last of Us is a cross country trip) This is where I decided to use tLoU's strongest art tool to inspire it's poster, ambiance.  Using a mini game to hold the player's attention just long enough to throw the ingredients of a mood at the player was the intention of the interaction. As they play, the music (sourced from the game (listened to the soundtrack on repeat for hours on end) creates a lonely yet peaceful and contemplative mood. The deer is then introduced to whip that mood in a frenzy, just so the title can come in a place a brand on all of what they just felt.</p>\n<p>The overall summarized goal - Show the player that The Last of Us can deliver feelings of isolation and suspense, all while being wrapped in a fun and minimalist UI just like the source material.</p>\n<p>You should have experienced:</p>\n<p>a controls screen - a season screen - the main game - and a cut to the title with the final strum of guitar from the song. Minimalist and Retro inspired.</p>", "metacritic": null, "released": "2021-11-22", "tba": false, "updated": "2021-11-26T09:29:11", "background_image": "https://media.rawg.io/media/screenshots/a92/a92b972adc6e52efd86a10d0a92f5c3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Robert Newlin"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}