{"id": 700485, "slug": "dream-buddy", "name": "Dream Buddy", "name_original": "Dream Buddy", "description": "<p>Dream buddy was a game originally made for the Game's Narrative course at Glasgow Caledonian University by Agapios Kokkos, Briony Mckelvie, and Ruaridh Stevenson. The game focuses around the titular character, Dream Buddy, as he navigates his way through a box of his owner's old things. The contents of the box changing, to reflect it's owner's growth as Dream Buddy slowly reaches towards the top and puts themselves back together.  The game was created within a month, and the focus was placed on trying to clearly communicate a narrative through environmental and literary story telling, thus there are certain bugs and optimisations which were unfortunately not considered. This game serves as a prototype rather than a fully developed piece.</p>\n\n<p>Briony McKelvie provided the fantastic art for the game, along with helping create the narrative. A large focus was given to dithering and object detail. Along with asset creation. </p>\n\n<p>  </p>\n<p>While Level creation as a process was evenly distributed by the group, a large focus on the structure of the project was handled by Agapios Kokkos. </p>\n\n<p>The original plan of the game would be for the game to take place all in one large level. Representing the box of moving stuff. Which each quadrant of the box representing a different level of maturity.  Purposefully the sex and gender identity of the owner was kept as neutral as possible to allow for audience self projection into the narrative. <br/></p>\n<p>Each person within the group handled a quadrant of the game. Later in the process the fourth stage of each group was dropped, and the narrative resolved to being 1 introductory section and 3 gameplay sections which explore their own unique mechanics. </p>\n\n<p>Some puzzles, such as the scales, were purposefully made in such a way as to remind elements of other games, using certain nostalgic elements within the level design to create a desired emotional response in the player. </p>\n\n<p>Although through internal play testing the actual level and puzzle was significantly changed. </p>\n\n\n<p>Diagrams where drawn up to communicate to the dev team the way that different puzzles should function, and should play out, with colours signifying certain levels of interactivity or connectedness. </p>\n\n\n\n<p><strong>Narrative:</strong><br/></p>\n<p>- Agapios Kokkos https://pipmakesgames.itch.io<br/></p>\n<p>- Briony Mckelvieb https://boomblegames.itch.io</p>\n<p>- Ruaridh Stevenson https://itch.io/profile/justru</p>\n\n<p><strong>Art:</strong></p>\n<p>- Briony Mckelvieb  https://boomblegames.itch.io</p>\n\n<p><strong>Programming &amp; Functionality: </strong></p>\n<p>- Agapios Kokkos https://pipmakesgames.itch.io</p>\n\n<p><strong>Music:</strong></p>\n<p>3 hearts</p>", "metacritic": null, "released": "2021-11-22", "tba": false, "updated": "2021-11-26T10:27:58", "background_image": "https://media.rawg.io/media/screenshots/b11/b112454dfd6b7467793950d937b452bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pip", "Briony"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}