{"id": 700522, "slug": "gamejamgamecan-i-take-a-break", "name": "(GameJamGame)Can I take a break", "name_original": "(GameJamGame)Can I take a break", "description": "<p>You need to motivate your hero and try to survive on unhabitated islad.</p>\n<p>This is my first \"game\"(or maby raf prototype) for Palette Jam 2</p>\n\n<p>Modular Terrain Pack by Keith at Fertile Soil Productions https://fertile-soil-productions.itch.io/modular-terrain-pack</p>\n<p>FREE Low Poly Character Pack by adamzhajdu   https://adamzhajdu.itch.io/free-low-poly-character</p>\n<p>Short Stack Font by Google https://fonts.google.com/specimen/Short+Stack#standard-styles</p>\n<p>Ultimate House Interior Pack by Quterninus https://www.patreon.com/posts/ultimate-house-38448096</p>\n<p>Jungle Music by Enprogames https://opengameart.org/content/jungle-music</p>\n<p>Wolf by PixelMannen  https://opengameart.org/content/wolf-2</p>\n\n<p>I decided to use Godot because it is lightweight open source game engine. I think this engine is beginner friendly (you can create game and test it without eternal dependency ).</p>\n<p>I wanted to make simple game with procedural world generation but it was out of rich for my first game. The first step was to create bunch of island(level) and then randomize it (I ended not doing it either). So I have same game early on. Then I wanted to add shader that can take viewport texture and applay pallte to it but it was diffult task I don't wanted to change color of external assets. I think in curent version of godot (3.x) It 's dificult to acess all information needed by shader (depth and normal are only in spatial shader but it is easier to make postprocesing as canvas item shader).I ended making it spatial shader that cover 3d camera view. </p>\n<p>To make island I used Modular Terrain Pack by Keith at Fertile Soil Productions and my tool script to snap positon to grid. I am very happy with godot's \"tool\" keywoard. </p>\n\n<p>THIS IS ONLY GAME PROTOTYPE. All feedback welcome.</p>", "metacritic": null, "released": "2021-11-22", "tba": false, "updated": "2021-11-26T10:36:48", "background_image": "https://media.rawg.io/media/screenshots/57f/57f33b816d39384c3abf57fb3c08c8ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AmoAqua"], "genres": [], "publishers": [], "esrb_rating": null}