{"id": 700683, "slug": "the-angels-deed", "name": "The angel's deed", "name_original": "The angel's deed", "description": "** The story<br/>\n<br/>\r\nMeryl is a Sister of a small village. <br/>\r\nMeryl, who adores an angel, believed that she could be an angel by accumulating good deed, and, therefore, she continues to do good deeds in the village.<br/>\r\nBeing too honest, however, Meryl is deceived by villagers and molested all the time.<br/>\n<br/>\r\nHaving become too tired of such situation, Meryl dies in the church.<br/>\r\nThen, several angels landed on, and take Meryl to the heaven.<br/>\r\nBy this incidence, Meryl becomes an angel she was always wishing to be.<br/>\n<br/>\r\nEven in the heaven, she is required to continue to do good deeds.<br/>\r\nNo matter how often she is deceived, she continues to accumulate good deeds.<br/>\n<br/>\r\nIf you do not accumulate good deeds, you will be dropped into hell, and becomes a fallen angel.<br/>\r\nFor the rest of her life, she is destined to be molested by monsters.<br/>\n<br/>\n<br/>\r\n** System of the game<br/>\n<br/>\r\nFundamentally, the story will proceed in a quest formula.<br/>\r\nListening to villagers' concerns and problems, Meryl tackles to solve those problems.<br/>\n<br/>\r\nWhen you defeat some enemies, you will obtain relics.<br/>\r\nWhen you collect all the relics, it may help influence the multiple ending.<br/>\n<br/>\n<br/>\r\n** Angel Meter<br/>\n<br/>\r\nIn the beginning, the meter leans towards the angel. It will decrease if you do a bad deed or raped by a monster.<br/>\r\nIf you catch a treasure chest in a private house, the angel meter will decrease in exchange for items,<br/>\r\nand if you give items to the villagers in need, the angel meter will increase.<br/>\r\nIt does not affect the proceeding of the game, but it may affect the ED separation.<br/>\n<br/>\n<br/>\r\n** Purpose of the game<br/>\n<br/>\r\nYou need to solve the problems that villagers have. In addition, take back the relics from the monsters.<br/>\r\nIf you mis-manage the Angel meter, you may wind up with a bad ending at the last ED point.<br/>\r\nIn order to win the game, it is essential that you collect as many good elixirs as possible.", "metacritic": null, "released": "2021-11-27", "tba": false, "updated": "2021-11-29T02:51:38", "background_image": "https://media.rawg.io/media/screenshots/eaf/eaf1af285da51999292be3485fd74910.jpg", "website": "http://h-game.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Magical Girl Club"], "genres": ["RPG"], "publishers": ["H-GAME"], "esrb_rating": null}