{"id": 700678, "slug": "bai-ma-fei-ma-a-white-horse-is-not-a-horse", "name": "白马非马 a white horse is not a horse", "name_original": "白马非马 a white horse is not a horse", "description": "\"White horse is not a horse\" is an adventure cultivation game integrating Xiuxian (leisure) + mythical world outlook, integrating elements such as business construction and role-playing<br/>Maybe one day when you wake up, you will come to such a world. It seems that it has been arranged. Everyone here knows that you are coming. There is nothing to be done here. You seem to be the son of destiny.<br/>You can carefully cultivate spirit planting animals here until there are countless magic drugs and animals<br/>Full of blood, destroy the invading demons outside the sky, and support the world as king<br/>In order to seek the avenue, pursue the immortal path and live forever, be the immortal in the carefree world<br/>Find a fairy couple who only envy mandarin ducks but not immortals. Be carefree and happy for a lifetime,<br/>Or dream back in the middle of the night, miss the place where you came, bear the so-called destiny, explore the mysteries of ancient times, unlock the blockade of heaven and earth, just return to your hometown and see the familiar world and people again<h3> spirit plant spirit beast </h3>There are more than 100 kinds of spirit plants and spirit beasts for players to cultivate<br/>Spirit planting spirit beasts have potential, state, longevity, class, etc. different spirit planting spirit beasts can produce items with different effects, but without exception, as long as they are cultivated carefully, they can change their lives against the sky and reach the peak<h3> six skills </h3>Player characters have six skills: Astrology, fishing, grid, spirit control, combat and collection. Each of them can unlock special talents when reaching a certain level. After reaching a certain level, they can even unlock lost artifacts<h3> immortal cultivation </h3>There are 20 big realms to break through (at present, only the top ten realms are open), and there are still several small realms or even hidden realms in each big realm<br/>The breakthrough not only requires eating all kinds of natural materials and earth treasures, all kinds of rare treasures and a large number of spiritual stones, but also requires the understanding of the avenue. Only when the immortal understands the avenue of heaven and earth to a certain extent can he make a breakthrough<br/>At present, there are more than 130 cultivation scripts, which can be found in the game. Each one has its own special attributes. Players have special physique and can practice one by one<h3> making friends </h3>You can have friendly exchanges with various NPCs, establish friendship, and even become Taoist partners and give gifts to each other<h3> secret land site </h3>From time to time, ancient immortal cave or secret treasure will be born<br/>Players can also explore Xianmen ruins, overseas Xianshan and three secret places<h3> Daoting and foting </h3>Establish Taoist and Buddhist courts, cultivate their own strength, and be called the Buddha<br/>Cultivate Taoist soldiers and Buddhist soldiers, and admit all celestial gods, mythical figures and human ancestors into the court<h3> fight the world </h3>Go out of the world where you are, go to heaven, compete with immortals and collide with immortals<h3>more</h3>There are more things that you need to explore and discover slowly in the game", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T02:46:53", "background_image": "https://media.rawg.io/media/screenshots/0dc/0dcaca5280f361af3d4c0c31a9ef938a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["卧熊工作室"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["卧熊工作室"], "esrb_rating": null}