{"id": 700711, "slug": "hypergliders", "name": "Hypergliders", "name_original": "Hypergliders", "description": "Hypergliders lets you experience high speed wingsuit action in procedurally generated levels. The controls are very easy to learn and it will only take you a few tries to get the hang of it.<h3>Hypergliders also features:</h3><br/><strong>Combo System</strong>:<br/>To collect points, simply fly as close as possible to a wall, collect some gems, fly through waterfalls and birds flocks or try to find all five artifacts spread throughout the level. All this will stack in your trick-combo score and who knows, perhaps it will get you a spot in the global leaderboards.<br/><br/><strong>Multiple Levels</strong>:<br/>Besides having infinite procedural level variations, Hypergliders will have multiple environments (such as Cyberpunk City) to glide through. Concept Art:<br/><br/><br/><br/><strong>Local Splitscreen</strong>:<br/>Hop on a couch with your friends (or foes) and glide for the win in local split-screen mode and a special battle mode.  <br/><br/><br/><br/><strong>Advanced Game Modes</strong>:<br/>Try some of the advanced game mode settings to spice things up.<br/><br/><strong>Daily Challenge</strong>:<br/>New Day, new Map: Play the same map as the rest of the world and see who's the leader of the day.<br/><br/><strong>Multiple Inputs supported</strong>:<br/>Use controller, keyboard or mouse to steer.<br/><br/><strong>Multiple Views</strong>:<br/>Toggle between third and first person view.<br/><br/><strong>Additional Characters</strong>:<br/>Orange Cube-Man is not the only character, more cool and cute characters will be unlockable. Do you have ideas for characters? Let us know.<br/><br/><strong>Cross Platform</strong>:<br/>Hypergliders is also coming to Xbox, Nintendo Switch, iOS, Android and VR.<br/><br/><strong>Free Demo available now</strong>:<br/>Try the Demo (with a limited feature set) and tell us in the Steam Forums or our Discord https://discord.com/invite/Rtq7usp what you would like to see next for Hypergliders or where it needs improvement. Thank you.", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-29T03:14:18", "background_image": "https://media.rawg.io/media/screenshots/2e4/2e4db9187a906ab79251b55dd9da18cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Interaction Ideas"], "genres": ["Action", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Interaction Ideas"], "esrb_rating": null}