{"id": 700706, "slug": "agrilife", "name": "AgriLife", "name_original": "AgriLife", "description": "Put your boots on, we're heading to the fields! Your job: manage some farm plots to feed a village that grows surprisingly fast. Plow, seed and harvest your crops, but be careful: all your actions have a real impact on soil. You're gonna need some patience and ingenuity to contend with weather, seasons, local wildlife and current laws. Learn to master this interconnected and everchanging environment, taking place in a colorful and fantasy world.<h3>You have time</h3>In AgriLife, you decide when to pass the time. Week after week, watch your crops growing until harvest. Satisfy their needs thanks to every tool at your disposal. When you've consumed all of your action points, move on to the next week and find out if your choices were the right ones.<h3>A systemic environment…</h3>Your tools allow you to tame nature. But don't forget it has its own rules: the soil is vibrant and evolves turn after turn. The weather impacts the ground and varies with the season.<br/>You will have to analyze the type of land in the different map's regions, and understand how nutrients, humidity, and in the longer term erosion risks, are applicable there.<br/>Your crops are at the center of this ecosystem, interacting with everything else: they draw the necessary resources from the soil, suffer the weather hazards and influence the nearby plants and the land in which they take root.<br/>The needs and interactions are species-specific. Each of them belongs to a family and comes in an infinite number of procedurally generated varieties.<h3>… and mouths to feed</h3>Population is the crux in AgriLife. If its satisfaction falls to zero, it's over! In order to avoid that, keep an eye on the food supplies by continuously selling your crops to the village. But its size will increase at each turn and production will have to keep up! People will also ask for specific food. Up to you to fulfill their demands, or not.<h3>Become a master farmer</h3>The more the population grows, the more you have to produce. But fortunately, there are many elements to unlock throughout the game. Get new tools, improve them, and unlock tips on how to use them. Refine your knowledge for each plant and better understand their needs. Discover more successful species. Unlock valuable policy advice in the encyclopedia.<h3>Permadeath</h3>Into the wild, mistakes can’t be forgiven. If you lose the game, you have to retry since the beginning! But don't panic, you keep everything you‘ve unlocked. You simply start over with new plots and the initial village, ready to go further than before. You’re free in your choices.<h3>This is your choice</h3>The ability to start over again and again allows you to try any strategy you want, without any straightaway path. But it's also a double-edged sword, cause you're not safe from completely depleted soil or bankruptcy due to unnecessary purchases. You are on your own in a nature that won't let it go.<h3>AgriLife's world</h3>Agrilife is filled with colorful plants and strange animals. Take your time to explore and discover this whole universe! It'll strangely remind you the reality if you look closer…<br/>Your journey will be often disrupted by a wide range of events: epidemics and pests in crops, storms, drastic legislation,… Hang on, soon you'll become a great farmer!", "metacritic": null, "released": null, "tba": false, "updated": "2021-11-29T03:10:13", "background_image": "https://media.rawg.io/media/screenshots/9b1/9b1057b8fb5bb3e63f277d558786e276.jpg", "website": "https://www.agrilifethegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["AgriLife Team"], "genres": ["Strategy", "Simulation"], "publishers": ["AgriLife Team"], "esrb_rating": null}