{"id": 700733, "slug": "implements-of-hell", "name": "Implements of Hell", "name_original": "Implements of Hell", "description": "<h3>WARNING:</h3>Epileptic seizures associated with increased sensitivity to light are Possible. Some people may experience seizures when exposed to flashes of light and flashing images that appear in a video game. People who have not previously experienced such attacks may not be aware of their illness. A reasonable restriction of the game audience is recommended.<br/><br/><br/>\"<strong>Implements of Hell</strong>\" is a first person psychological horror. The game takes place in 1910 in John's house.<br/><br/><br/><strong>Average time to complete the game: 90 minutes</strong><h3>Environment</h3>The game is set in a realistic house from 1910, where certain unexpected events are continuously occurring. The player will proceed to uncover more of its secrets periodically as they explore it through. This will be an unsettling experience that is on the line between insanity and reality. Are you really alone or are there others out there?<br/><br/><br/><h3>Storyline</h3>This house has a dark past, and an even darker present. Families were killed and sacrificed. Traces of a strange and disturbing cult is found. You will uncover the twisted truth and try to change the outcome. You will be met with a difficult situation where you interact with both our world and another. Death is not the end. Misery and pain are continual. <br/><br/><br/><h3>Gameplay</h3>The player will need to solve puzzles that are extremely unconventional in nature and make difficult choices based on how much they are willing to risk.<br/><br/><br/>", "metacritic": null, "released": "2021-11-26", "tba": false, "updated": "2023-02-13T23:50:43", "background_image": "https://media.rawg.io/media/screenshots/3e8/3e8bb3eff345451e5170bf1a64f043bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["PsychoRavens"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["PsychoRavens"], "esrb_rating": null}