{"id": 700764, "slug": "infinite-tanks-wwii", "name": "Infinite Tanks WWII", "name_original": "Infinite Tanks WWII", "description": "Infinite Tanks WW2 brings an innovative, never seen before approach to WW2 tank battles. The game features an original card-driven tank building system that allows players to mix and match parts of different historic tanks. Play with your favorite tanks from World War 2 and create the ultimate fighting machine by assembling a brand new hybrid.<br/><br/>The combining options are virtually endless and allow you to tune every vehicle to your liking and playstyle.<br/>You then take your war machine to battle in open environments inspired by historical battle locations. <br/><br/>Enjoy the classic mode campaign where you fight in 5 historical theaters of war over 12 distinct missions. Then dive straight into competitive online multiplayer with various game-modes.<br/><br/>Explore the two separate progression trees for Axis and Allies unlocking and upgrading tanks from both sides of the war.<br/><br/>Features<br/><br/>A unique card-driven construction system, driven by single-player progression.<br/>Huge number of  different vehicle combinations, plus aesthetic customization such as historical paint patterns and badges.<br/>12 mission single player campaign<br/>7 vs 7 online multiplayer matches<br/>The most iconic WW2 tanks like: Sherman M4A1, M18 Hellcat, M26 Pershing, Type 1 Chi-He, Type 4 Chi-To, Panzer III ,Tiger II, Panther, Tiger 1, Panzer IV, Stug III, Jagdpanther, Panzer 38T, Churchill, Cromwell, Crusader, Matilda II, T-34, KV-1, SU-85, IS<br/>5 historical environments, from the sun scorched battlefields of Africa, the frozen Russia battlefronts to the serene islands of the pacific.<br/>Offline custom games, including King of the Hill, Capture the Bases, and Team Deathmatch both online and offline.  <br/>realistic physics and different tank parts damage system<br/>Special mechanics like abilities and critical damage.", "metacritic": null, "released": "2021-06-23", "tba": false, "updated": "2021-11-29T03:49:46", "background_image": "https://media.rawg.io/media/screenshots/060/0606a589d644bc0f09a9db7b2f3e9450_9ia3Ci3.jpg", "website": "http://www.atypicalgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atypical Games"], "genres": ["Action", "Simulation"], "publishers": ["Atypical Games"], "esrb_rating": "Teen"}