{"id": 700826, "slug": "west-marches", "name": "West Marches", "name_original": "West Marches", "description": "<p>Hey again mates!</p>\n<p>West Marches is a game I was working on for awhile. Bit of a passion project. It started with some inspiration from Star Trek Onlines \"Duty Officer\" system, and me asking, what if it was in high magic fantasy? So that's what I made.</p>\n<p>The game is about, recruiting adventurers, buying items, and sending as many adventurers on quests as possible per turn.</p>\n<p>Whilst this game works, and mate, making an rpg-lite game is way more difficult than I anticipated, It quickly became apparent to me that the game was lacking something.</p>\n<p>So what is it lacking? In short, some form of actual combat loop. My goal was to make an rpg-lite system that was easy to understand, and I feel that I achieved that. But the lack of combat just left many people feeling unsatisfied.</p>\n<p>I have been working on a new version of the West Marches. This new version is going to be more rogue-lite than rpg-lite, taking inspiration from games such as, slay the spire/FTL/Darkest Dungeon/etc.</p>\n<p>1- An assemble party start screen</p>\n<p>2- An event driven map</p>\n<p>3- Real time, pause-able, true shot combat</p>\n<p>4- A final encounter with a \"Boss\" (Thinking it has to be a dragon, because dragons are awesome!)</p>\n<p>The game in it's current state however, has taught me a lot about coding these complicated game types and how/what to think about when designing them. It's a classic example of, what seems good on paper may or may not be good when you have a testable prototype.</p>\n<p>Please check it out, C&amp;C is welcome as always.</p>\n<p>Thanks!</p>\n<p>Andrew.</p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-11-29T04:08:37", "background_image": "https://media.rawg.io/media/screenshots/9db/9dbcda2f18cf996a83ac5a3ae14462ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrew Spinks"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}