{"id": 700928, "slug": "rayza-demo", "name": "Rayza Demo", "name_original": "Rayza Demo", "description": "<p>Rayza is a 3D Platformer where you take control of Rayza, an animal hybrid between a porcupine,  gorilla, and lemur. You must platform around the level to collect all the letters to form a word, however, these letters are not collected in order. You must then approach the door and decipher the word. Platform, fight enemies, and collect things!</p>\n<p>Made this game for a school assignment.  I acknowledge that the Caesar-Cipher encryption is bit stupid to have in a platformer, it is only there because it was one of the requirements of the assignment. This game is also pretty buggy, I haven't bothered to fix them all now that the assignment is over.  The character and collectable models are awful, I know, I'm not a very good artist! Still, pretty proud of this one I guess, spent quite a lot of time working on it.  I had a great time making this and I'm perhaps thinking about a future for this game. We'll see for now. <br/></p>\r\nControls:\r\n<p>W A S D or arrow keys to move.</p>\n<p>Spacebar to jump and double jump. The longer the spacebar is held for, the higher you will jump.</p>\n<p>Shift to sprint.</p>\n<p>\"I\" to open and close the HUD.</p>\n<p>Left mouse button click to Light Attack.</p>\n<p>Hold down the left mouse button to perform a heavy attack.</p>\n<p>Press \"E\" while in mid-air to perform a back-slam.</p>\n<p>Hold the right mouse button to block.</p>\n\n<p><strong>Game Warnings:</strong><br/></p>\n<p>Here are some known issues with the game. These may get fixed in future version, time will tell.\r\n</p>\n<p><strong>Broken Combat System:</strong>\n</p>\n<p>The entire combat system is kind of broken. It isn't very fun at the moment, punching enemies isn't satisfying and most of the time it ends up becoming whoever starts hitting the other first, wins. Not a good system, but this will be fixed in future versions (if I ever continue with the project)\r\n</p>\n<p><strong>Sliding Bug:</strong>\n</p>\n<p>There is a specific spot on the cliff where the player can slide off, and get stuck in sliding animation. There is another spot the player can slide off, and they will be launched into the air.\r\n</p>\n<p><strong>Back-slam Bug:</strong>\n</p>\n<p>When you back-slam from a tall height, the player will not play the correct animation after landing.</p>\n\r\nSocial Media\r\n<p><strong>NightZard Productions:</strong></p>\n<p><strong>Facebook:</strong> https://www.facebook.com/NightZardProductions/\r\n</p>\n<p><strong>Instagram: </strong><strong>https://www.instagram.com/nightzardproductions/</strong></p>\n<p><strong>Game Created By: Callan Hansen</strong></p>\n<p>Any and all feedback on the game is more than appreciated, positive and negative!</p>", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T04:33:02", "background_image": "https://media.rawg.io/media/screenshots/ac3/ac358b50691b5560824469d8e207b358.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NightZard Productions"], "genres": ["Action", "Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}