{"id": 700927, "slug": "nuno-sanches-atomic-flood", "name": "Nuno Sanches: Atomic Flood", "name_original": "Nuno Sanches: Atomic Flood", "description": "<p>This game is my first created with the Unity game engine. I reused many of the assets from my <em>Jetpack of Judgement</em> project in addition to new ones in order to expand upon its ideas in a full-fledged game engine. Mechanics include jumping, a jetpack, shooting, fully-voiced NPC dialogue, doors and switches, and movable blocks. All art, music, and dialogue assets are my own creations. Tools I used include Unity, Visual Code Studio, Pixilart, Pix2D, LMMS, ttstool.com, and Audacity.</p>\n<p>Story: A clone of Nuno Sanches awakes on Sanches Airlab 04, a flying facility that was researching the G-00, a living radioactive sludge, before the original Nuno Sanches disappeared. HAPI, the AI in charge of the facility, has maintained it throughout the years, but now he needs the help of a Nuno Sanches clone to save the facility. The game so far covers the beginning of the story as Nuno awakes and recovers the jetpack. The rest of the story would involve HAPI's descent into madness as the G-00 corrupts him and makes him its puppet, and Nuno's journey across a post-apocalyptic wasteland to stop HAPI from flooding all that remains with radioactive sludge.\r\n</p><p>Controls:</p><p>wasd or arrow keys to move</p><p>w to jump or activate jetpack in air</p><p>e to interact</p><p>mouse to aim, click or space to shoot (with jetpack)</p><p>To exit the game, alt+tab or windows key out then close the window</p>", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T04:32:06", "background_image": "https://media.rawg.io/media/screenshots/d2a/d2a40d183055af50b4cacbe6e2599a99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["D44"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}