{"id": 701, "slug": "solitairica", "name": "Solitairica", "name_original": "Solitairica", "description": "Solitairica takes RPG combat and challenging roguelike progression to a fresh new place—the world of solitaire!<br/><br/>Gather your weapons and prepare to battle the armies of Stuck. In the land of Myrriod, all of the hearts have been stolen by the horrible Emperor Stuck, and you are the latest warrior brave enough to try to return them, saving the world from total heartless destruction!<br/><br/>With the guidance of the great Kismet who will teach you the power of solitaire and the four great energies—attack, defense, agility and willpower—to battle your enemies... you could finally be the one to save the realm.<br/><br/>Each player’s journey will be a unique challenge, with a horde of ever-changing enemies and a wide variety of items and spells to explore. Battle your enemies with brute force, or cleverly constructed builds with devastating combos, and defeat the Emperor Stuck!<br/><br/>Key Features:<br/><ul><li>Introducing a brand new turn based solitaire combat system.<br/></li><li>Procedural enemies that combine hilarious and dangerous traits for endless variety.<br/></li><li>Heaps of items and scores of spells to combine. Millions of builds to try!<br/></li><li>Challenging and dynamic roguelike progression.<br/></li><li>Four great energies to master: attack (destroy cards), defense (counter and armor), agility (peeking and quickness) and willpower (healing and the arcane).<br/></li><li>Collect wildstone each journey to unlock perks and new classes which change the way you play.<br/></li><li>Deck upgrades include Ace, King and Queen cards which provide powerful boosts during battle.</li></ul><br/>", "metacritic": null, "released": "2016-05-31", "tba": false, "updated": "2023-07-01T19:54:07", "background_image": "https://media.rawg.io/media/games/717/71712b1c40e5f33b58f55f9faea41c88.jpg", "website": "http://www.solitairica.com", "rating": 3.48, "rating_top": 5, "added_by_status": {"yet": 64, "owned": 148, "beaten": 16, "toplay": 3, "dropped": 14, "playing": 3}, "playtime": 4, "achievements_count": 27, "ratings_count": 25, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 27, "platforms": ["PC", "iOS", "macOS"], "developers": ["Righteous Hammer Games"], "genres": ["RPG", "Strategy", "Card", "Indie"], "publishers": ["Righteous Hammer Games"], "esrb_rating": null}