{"id": 701031, "slug": "runapult", "name": "Run'A'Pult", "name_original": "Run'A'Pult", "description": "<p><strong>Run'A'Pult:</strong></p><p>You are running from an angry monster. Throw blocks at him to slow him down before he catches you! The longer you hold, the better your score!</p><p><strong>Synopsis:</strong></p><p>Whatever happened to the realm won't happen to you! The monsters came and destroyed everything. Not a single farm or castle held against their attack. Hopefully for you, you didn't have a farm or a castle. You had a catapult!</p><p>You are running through the country on your magnificent catapult but when a giant monster sees you, all you have to defend yourself is your wits, your artillery piece and the stones that once were the very fondation of the realm that was lost. Build these walls and go the farthest possible. Only you can do it.<br/></p>\n<p><strong>Controls:</strong></p><p>Spacebar = charge and throw a block.</p>\n<p><strong>How to play:</strong> <br/></p><p>Press Spacebar to load a block and release to launch it. The longer you press, the further you throw it. <br/></p><p>Blocks can stick to the ground or on other blocks, but not on the ennemy. The higher a blocks gets, the stronger it is. Making huge walls is the key to slowing the monster. <br/></p><p>You get points everytime a block passes the green line, as well as every second. The amount of points you earn every second increases with time, try to hold as long as you can!</p><p><strong>Credits:</strong></p><p>Kushala - Code and design</p><p>J(b) - Music<br/></p><p>Trapped in a While Loop - Code and graphism</p><p>Altadir - Game design and graphism</p><p>Olaan and Morgane - Testing<br/></p>", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T04:58:39", "background_image": "https://media.rawg.io/media/screenshots/202/202df850ffd4ef2071d141a93a0329eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kushala", "Altadir"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}