{"id": 701012, "slug": "lamejam-spacetrades", "name": "Lamejam Spacetrades", "name_original": "Lamejam Spacetrades", "description": "<ul><li>In the far future, a crippling nanite virus infected almost all machines on an unnamed planet. The planetary governor enacted martial law, sealing the majority of humanity living on the planet to giant hives of underground vaults, and forbidding any individuals without a proper level 3 clearance mech from visiting the surface, resulting only the richest of the planet to live in astropolis above the planet, leaving the rest to ruin in the remains of humanity. And those without the proper clearance mechs are left to venture away from their underground abodes as scavengers by night, visiting a savage and deadly city where the law had died, and the deadliest creatures are both their fellow humans and mutated nanite machines.\r\n</li><li>And you, a lone scavenger, are made to work for a thriving underground business and community for the lost and damned, simply called The Network. And the goal of this community is to simply “capture” lost technology vital for artefacts from the surface, selling them to those in need for your community, and also The Network.\r\n</li><li>In the game, you have to balance your own community HIVE’s needs by capturing lost artefacts that could fix your vital needs such as a hydroponic water system for your crops, or a nuclear fusion reactor for your heating, and most importantly, weapons and ammo against fellow scavengers and mutated machines, whilst also selling those artefacts for profit on The Network’s public markets, selling for profit so eventually, the goal of acquiring a level 3 clearance mech could be attained, and you can visit the abandoned space shuttle graveyard and secure a planetary shuttle to leave the planet.\r\n</li></ul>\n\n<p>Actual gameplay description:\r\n</p>\n<ul><li>The player controls a mech through a simple command line console.\r\n</li><li>The player can trade between cities within their vicinity.\r\n</li><li>Move toward a city and try to trade with it!</li></ul>\n\n<p>Console commands:</p>\n<ul><li> help: list (some) available commands;</li><li> let &lt;name&gt; = &lt;expression&gt;: save an expression to a variable name;</li><li> echo &lt;name&gt;: print the contents of a variable;</li><li> inventory: check mech's inventory;</li><li> cityprices: check market prices for the current city;</li><li> buy &lt;expression&gt; &lt;expression&gt;: buy a number of a certain commodity from the local market;</li><li> sell &lt;expression&gt; &lt;expression&gt;: sell a number of a certain commodity to the local market;</li><li> move &lt;expression&gt;: move the mech in the direction it's facing;</li><li> rotate &lt;expression&gt;: rotate the mech by some angle;</li><li> stop: stop whatever the mech's doing;</li><li>&lt;expression&gt; &amp;&amp; &lt;expression&gt;: execute two commands in order;</li><li> (&lt;expression&gt;): wrap a complex expression into an atomic one;</li><li> quit: end the game.</li></ul>", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T04:53:30", "background_image": "https://media.rawg.io/media/screenshots/94e/94e6dcf51fd9b80c0abed146d4ae5682.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cryptech"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}