{"id": 70111, "slug": "ultimate-party-slots", "name": "Ultimate Party Slots", "name_original": "Ultimate Party Slots", "description": "Ultimate Party Slots brings you a new playing experience on Vegas Casino style slots machines filled with EPIC WINS, BONUS GAMES, FREE SPINS, JACKPOTS and incredible daily slots bonuses!  Designed by Gaming Professionals, Ultimate Party Slots is bound to give you the ultimate slots experience every time you play by giving you the greatest Vegas Casino style slots experience!  <br/><br/>No Registration or Login required, just Download and Play for FREE!<br/><br/>Features:<br/>• Over 20 uniques slots machines for playing once you download and install!<br/>• Great variety of themes and slots configurations!<br/>• Unique new slots machines added all the time!<br/>• Awesome slots features - Expanding Wilds, Mega Symbols, Sticky Wilds, Nudging Symbols, Jackpots, Free Spins and Re-Spins!\u2028<br/>• Designed with HD Graphics, Sleek Animations, and Quality Sound Effects!<br/>• Free coins bonus every 3 hours! The more often you play, the more bonus coins you will get!\u2028  Collect 5 times and received a Mega Bonus for even more coins!<br/>• Challenging community events every week to let you WIN even MORE!<br/>• Frequent promotions, offers, sales and gifts\u2028!<br/>• Facebook connect and invite your friends and receive even more coins bonuses!<br/><br/>Playing slots for fun without the risk of real betting has never been easier with Ultimate Party Slots!  This is a game filled with fun and thrills that you don't want to miss!  Download for free now and join the Party!<br/><br/>Follow us on Facebook: https://www.facebook.com/ultimatepartyslots/<br/><br/>-----<br/>This product is intended for use by those 21 years or older for amusement purposes only. <br/>Practice or success at social casino gaming does not imply future success at real money gambling.", "metacritic": null, "released": "2015-12-30", "tba": false, "updated": "2019-10-22T14:26:05", "background_image": "https://media.rawg.io/media/screenshots/f8a/f8a33cfe72e43fdd5339f51a57d61f20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jackpot Interactive"], "genres": [], "publishers": ["Jackpot Interactive Pte"], "esrb_rating": "Teen"}