{"id": 701303, "slug": "touhou-battle-of-hampton-roads", "name": "Touhou: Battle of Hampton Roads", "name_original": "Touhou: Battle of Hampton Roads", "description": "9th March 1862.\r\n<em><strong>On the 8th of March, USS Congress and USS Cumberland was sunk by the CSS Virginia. Today, CSS Virginia came back to destroy the USS Minnesota which had run aground. Unfortunately, USS Monitor arrived on time to defend USS Minnesota. </strong></em>\n<strong>This day showed the world for the beginning of the new age of naval warships, the ironclads Touhou Ship Girls.</strong>\n\n<br/>\n<p>Touhou Ship Girl dancing to welcome the new commander :)</p>\n\r\nTouhou Song Title Selected: \r\nPoDD Rikako's Theme: Visionary Game ~ Dream War\r\n\n\r\nGuide to Combat:\r\n<p>White Squares are the ship girls you command.</p>\n<p>Black Squares are the ship girls commanded by the enemy. </p>\n\r\nIf a red glow shines around one of your squares, it means it's time to attack.  <em>\"Eye'm the Strongest. Jajajaja.\"</em><br/><br/>The top right shows your current stats. <br/><br/><br/><em>\"And why didn't you reroll? You know you literally won't be able to hit anyone or penetrate anyone's defence right? <strong>Baka!</strong>\"</em><br/><br/>Hover over the enemy to see their stats. If your attack is lower than their defence, it's not going to penetrate their armour. And if your luck is lower than theirs, pray to RNG Jesus. If it's 0, give up. <br/><br/><br/><em>\"What?? You want fun gameplay! This is meant to be realistic! You want to penetrate their defence, then bring a shipgirl with the proper </em><strong><em>ARMOUR PIERCING CAPABILITIES. \"</em><br/><br/></strong>To attack, click on the selected enemy. <br/><br/><br/><em>\"They are the black square. Even if you click the white squares, I have not coded friendly fire, even though realistically there are lots of friendly fire in war. \"</em>You're a target for an attack.<br/><br/><br/><em>\"Prepare to brace gentlemen! I mean ladies!\"</em>Did I also forget to mention there's a timer on the bottom of the screen? Let it run down and perhaps an ending might show up?<br/><br/><br/><em>\"Do you think battles take forever? Even men have something called morale. Something that erodes over time.\" </em>\n<p><strong>\"Good luck admiral\" </strong></p>\n\r\nAttributes (Explanation):\r\n<strong>Attack</strong>As long as it's larger than Defence, you do damage.<strong>Defence</strong>Only exists for Attack to exist<strong>HP</strong>Knock this down below 0 to die<strong>Luck</strong> Want to never hit your enemies? Have fun with the luck of 0. <strong>Speed</strong>Literally useless unless paired with high attack for glass cannon build\r\n\r\nCredits:\r\n\n<p>Rosedelio ~ lending me the spreadsheet on the Touhou Game Dev Hub discord so I didn't have to spend time web scraping off the Touhou Wiki❤️</p>\n<p>https://www.vgmusic.com/file/38ef591f3952d0888bd4bb4831a4d3be.html</p>\n<p>ShinkoNet ~ For the amazing Midi Remaster of Azur Lane's Yuudachi's BGM which I used to make the game's battle music :)</p>\n\n\r\nTips to win (spoilers):\r\n<p>Roll until you get a girl with high attack paired with high luck. If her luck is 0, you're not going to land a single shot.\r\n</p>\n<p>Look at your enemies, if any of them have 10 defence. <strong>Restart.</strong>  <strong>:)</strong> Or just accept that you'll lose. \r\n</p>\n\r\nTips to lose (spoilers):\r\n<p>Roll for low stats. The lower the defence and the lower the luck the better.  \r\n</p>", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T06:08:21", "background_image": "https://media.rawg.io/media/screenshots/4dd/4ddef0e6173f13d1a62c9b07d5fc8f80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Jaykingamez"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}