{"id": 701479, "slug": "santa-simulator-itch-allison-liem", "name": "Santa Simulator (itch) (Allison Liem)", "name_original": "Santa Simulator (itch) (Allison Liem)", "description": "<p>A simulation/tycoon game, where you hire and train a team of bugs to help Santa Claus distribute gifts for Christmas.<br/></p>\n<p><strong>Note: Recommended to play fullscreen at 16:9 aspect ratio.</strong><br/></p>\r\nOverview\r\n<p>Santa Claus has caught a bug and is unable to send out gifts this year! In order to save Christmas, he has delegated the tasks to various distribution centers.<br/></p>\n<p>As the manager for the distribution center in Presidio, San Francisco, your job is to hire and train a team of bugs to deliver as many gifts as possible on Christmas Eve.</p>\n<p>You have 5 days to hire, train, and upgrade your team, to deliver as many gifts as possible on Christmas Eve. Every night before Dec 24th, you'll perform a dry run of Christmas Eve to see how well your team is doing, and measure metrics of the delivery, such as the number of gifts delivered, the utilization of your bugs, and the average time taken for someone to receive their gift. On Christmas Eve, your team will deliver the actual gifts, and you can see how well you did!</p>\r\nFeatures\r\n<ul><li>Tutorial that teaches the ins and outs of managing the distribution center to save Christmas, starring Santa and Cookie!</li><li>Hire from 3 bug types: wasps that are quick but weak, queens that are slow but strong, and scarabs that are in between.</li><li>Allocate 2 roles: preppers that prepare/wrap gifts, and movers that deliver the gifts.</li><li>Train your staff: every bug has 2 stats: strength and speed, and bugs can be leveled up, if you have enough currency.</li><li>Purchase upgrades to improve your efficiency organization-wide, such as improving the speed of all movers.</li><li>3 types of currency: gold and time that replenish daily, and hearts that you get from delivering gifts.</li></ul>\r\nPlatforms\r\n<ul><li>WebGL</li><li>Windows (to be added)</li><li>MacOS (to be added)</li><li>Linux (to be added)</li></ul>\r\nSocial Media\r\n<ul><li>Twitter: https://twitter.com/Allison_Liem</li><li>Medium: https://allison-liem.medium.com/</li><li>LinkedIn: https://www.linkedin.com/in/allison-liem/</li></ul>\r\nBackground\r\n<p>This game was made for GitHub Game Off 2021 in November 2021.</p>\n<p>Allison is a professional software engineer who led teams and built simulation platforms for companies such as Uber and GoPuff. Game Off provided an opportunity for Allison to translate her industry experience into a game, so that others can get a taste of optimizing delivery networks!</p>", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-11-29T06:52:00", "background_image": "https://media.rawg.io/media/screenshots/2d2/2d282cacaacae892566ee8129d3b145d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Allison Liem"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}