{"id": 701560, "slug": "de-fora-da-bolha", "name": "De Fora da Bolha", "name_original": "De Fora da Bolha", "description": "<p>Projeto realizado em 7 dias durante a NaÁra GameJam!</p>\n<p>Escolha do Tema: Baseado nas diretrizes disponibilizadas para a construção do Jogo, resolvemos lançar um tema/situação que acomete grande maioria da população, a fobia social ou Transtorno de Ansiedade Social. Durante a construção do jogo, nos deparamos com as inúmeras  frustrações, ansiedades, medos e um possível caminho para o tratamento...No jogo tentaremos mostrar o dia a dia do personagem que convive com a fobia social, desde seu momento “na bolha”  até a necessidade de procurar ajuda , na intenção da reestruturação cognitiva, confrontando pensamentos para enxergar a realidade.  Tentarei mostrar os obstáculos que o personagem irá encontrar no percurso, os olhares de julgamento das pessoas,  e tudo que precisará encontrar para se livrar desses sintomas que lhe acarreta grandes prejuízos, como também aumentar a auto estima, a confiança a capacidade de interagir com os outros e aprender a conviver confortavelmente em grupo.\r\n</p>\n<p>Mecânica do Jogo: Pensamos em utilizar mecânicas para simbolizar algumas das situações que uma pessoa que convive com transtorno de ansiedade social enfrenta diariamente, no jogo, o personagem precisará enfrentar seu medo de se socializar, o medo de ser o centro das atenções e também o medo do julgamento das outras pessoas. \r\n</p>\n<p>Durante o jogo precisamos coletar algumas medicações para  manter o personagem com uma boa saúde mental, caso a barra de saúde do personagem chegue a zero,  uma situação de stresse aleatória irá começar, onde alguns sintomas como confusão mental irão surgir no personagem.\r\n</p>\n<p>Créditos:</p>\n<p>Sprites, Programação e Música: João Paulo Mendonça (PixelJoao)<br/></p>\n<p>Gerente de Projeto e Testador: Manoel Soares Jr. </p>", "metacritic": null, "released": "2021-11-27", "tba": false, "updated": "2021-11-29T07:14:03", "background_image": "https://media.rawg.io/media/screenshots/b66/b6637869adea055f6860671d04b56734.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PixelJoao"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}