{"id": 701520, "slug": "language-spy-covert-contact", "name": "Language Spy: Covert Contact", "name_original": "Language Spy: Covert Contact", "description": "<p>This is a short prototype for a language immersion adventure game made in less than 2 weeks for AdventureX Jam 2021.</p>\n<p>Learning a new language is fun and rewarding! ...in the beginning. Then as you progress past beginner, progress starts getting more and more slow and there are far fewer resources for learners of your level, and the methods of learning often employed are remarkably boring.</p>\n<p>You remember things much better when you associate them with something humorous, rewarding, or intriguing. It turns out adventure games are really good at creating humorous, rewarding and intriguing moments.</p>\n<p>Language Spy is a prototype of a an immersion based language adventure game. Essentially, it's just an adventure game in a foreign language, but the words and situations have been chosen to introduce and reinforce the most commonly used words, and while it uses natural speech that native speakers of the language would use, the concepts and sentences are simple and short, staying clear of too much slang or stylization.</p>\n<p>To get benefit from this system, the player should be at least upper beginner level. They should be able to read the language comfortably and have a good familiarity with grammar and structure, linking words, etc It is expected there will be some words you don't know, and it's a good idea to have a dictionary handy.</p>\n<p>This prototype is very short, and it's also very easy. You can probably defeat it simply by randomly clicking things on things without understanding anything that's said. However, that defeats the purpose. To get the most out of it, it's best to try to understand all the text. It is also very beneficial to read it *out loud* as you play.</p>\n<p>The languages available in this version are:</p>\n<p>Korean, Italian, German, Portuguese, Spanish, and Finnish.</p>\n<p>I would be very very happy to hear any and all feedback about the game!<br/></p>", "metacritic": null, "released": "2021-11-27", "tba": false, "updated": "2021-11-29T07:02:47", "background_image": "https://media.rawg.io/media/screenshots/365/3654fbe72a5f3558081389aa49783c88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StandOffSoftware"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}