{"id": 701678, "slug": "infested-station", "name": "Infested Station", "name_original": "Infested Station", "description": "<p>This is my entry for Game Off 2021, a game jam \"where participants spend the month of November creating games based on a secret theme\". This year's theme was \"BUG\".</p>\r\nControls\r\n<ul><li>Arrow Keys or WASD: Moves the player</li><li>X or E or SPACE: Triggers an action</li><li>R: Reloads the level</li></ul>\r\nDevelopment\r\n<p>I used the Godot engine for the first time and my goal was to try as many of its features as possible. Since time is always limited, I didn't manage to create the assets myself. However, there are some very talented people on itch.io and I finally got to use some of the assets from my library.<br/></p>\r\nAttributions\r\n<p> If you like the sprites, I encourage you to buy/donate to the following assets and support the artists:</p>\n<ul><li>Big thanks to LimeZu for his amazing Modern Interiors and Modern Office asset packs! The majority of sprites are from there (with minor modifications).</li><li>Also thanks to Shubibubi for the ladybug asset from 100 Nature Things.</li><li>Some item sprites are from this RPG 16x16 Items + Icons Pack by Michael Zone Games.</li><li>The font is m5x7 by Daniel Linssen and it's public domain (CC-0).</li></ul>\r\nSource Code\r\n<p>The source code is available on Github and you can use it for whatever you want (respecting the licenses of  course). If in return you would like to buy me a coffee, I’d be very happy!\r\n    </p>\n<p><strong>Follow me to get notified about future projects and let me know what you think in the comments.</strong></p>", "metacritic": null, "released": "2021-11-27", "tba": false, "updated": "2021-11-29T07:42:10", "background_image": "https://media.rawg.io/media/screenshots/d6f/d6f842744cfa49946748c1ccb72fe574.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LiberaByte"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}