{"id": 701781, "slug": "geometry-golf", "name": "Geometry Golf", "name_original": "Geometry Golf", "description": "Geometry Golf\r\nGameplay\r\n<p>Get the ball to the green flag by bouncing on the blocks. Don't touch red walls. The game uses only one button, but you can use space, enter, left click or your controllers equivalent to the xbox 360 A-button. You start rolling by tapping. Every tap also moves the blocks you have to bounce on to get to the goal.<br/></p>\n<p>Tap the button to traverse the menu or make the blocks move  ingame. <br/>To confirm menu selection keep the button pressed until the circle in the bottom right corner is filled. The speed at which it fills can be adjusted in the main menu.<br/>You only bounce in multiples of 45° angles to make it less of a messy physics puzzle.</p>\n<p>To reset a level keep the button pressed. When you are at the start of a level and keep the button pressed you return to the menu.</p>\n<p>There are currently 4 levels for each new block, so the game is not very long.</p>\r\nOther Info\r\n<p>Created for the 1-button jam 2021.<br/>This is the first game I ever finished. It is made with the Godot engine. I picked it up this october and love it. <br/></p>\n<p>I consider continuing to work on this project. Would love to hear what you think, even though I'm aware that it's not exactly hard to come up with improvements yet. I want to upgrade the art with  vector graphics and co to make it look and sound less like the programmer-art that it is and the physics need to be made more stable. I probably won't start working on that right away though. <br/></p>\n<p>Ironically I got carpal tunnel while making it, so I'm looking forward to trying the other jam entries.<br/></p>", "metacritic": null, "released": "2021-11-27", "tba": false, "updated": "2021-11-29T08:16:16", "background_image": "https://media.rawg.io/media/screenshots/25f/25fe51852f8eec24ef1168b63a47a225.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nonsense90"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}