{"id": 701802, "slug": "barnon-gilver-and-the-tale-of-dragons-veil-the-sta", "name": "Barnon Gilver and the Tale of Dragons Veil - The Starfold Project [On Hold]", "name_original": "Barnon Gilver and the Tale of Dragons Veil - The Starfold Project [On Hold]", "description": "<p>*****<strong>DEVELOPERS NOTE: </strong>This project is on hold until the foreseeable future. Development stopped right when the Covid 19 pandemic hit the US, and I as the sole developer working in engine had to stop working due to deteriorating mental health and burnout.</p>\n<p>I wanted to release what I got here so that maybe, someone can find enjoyment in what we were making, and maybe inspire me to come back to this. I do want to return to this project one day, but it will be at a time when I'm most confident I can bring this to life. I have a whole story planned in this world, and this is just a single part of a bigger journey.</p>\n<p>All artwork is placeholder artwork, nothing is final, little sound is available and the game is very protytpe. Player is a placeholder sprite and doesnt represent the main character and your partner.  There isn't a lot of game here, only mostly 1 level worked on and the intro level.</p>\n<p>Software comes as is, no support will be given!<br/>Thank you for listening,  please enjoy what we were working on!<br/>*****<br/></p>\n\n<p><strong>Story:</strong> You play as Barnon Gilver, archeologist extraordinaire! (in)famous in the lands of the Faries and Witches. Short, strong and hates magic.</p>\n<p>Joined by him is the lovely Higganon, Tall, smart, just want to get business done, and is (un)fortunately studying under Barnon to become an archeologist herself. In fact Barnon is the only archeologist who would take Higganon in.</p>\n<p>Together, they wants to uncover secrets of our world, find out what there is, and why theres a giant towering mountain in their land! What secrets will they find together? Will there be loot? Probably lots of it I mean Barnon really loves loot! It's like it's the source to all of his power!<br/><br/></p>\n\n<p>Controls (Xbox One controller)</p>\n<p>Left Analog/DPad - Movement</p>\n<p>A - Jump</p>\n<p>A (while in mid air) - Glide</p>\n<p>X - Punch<br/></p>\n<p>LB - Fire Projectile</p>\n<p>Right Analog - Aim in direction</p>\n<p>While aiming, press LB to fire in that direction</p>\n<p>RB - Dash</p>\n<p>RB + Down - Dash downwards (can be used to destroy blocks below and knock enemies away)</p>\n<p>B - Grab and move blocks</p>\n\n<p><strong>Gameplay:</strong><br/></p>\n<p>- Picking up gold increases your total strength. So collect as much as you can!<br/></p>\n<p>- There are some walls (in purple) that can be destroyed, but requires a specific amount of gold to destroy. They're not properly telegraphed so i would say get as much gold as you can.</p>\n<p> - You can destroy some floor walls under you with dash + down.</p>\n\n<p>Thank you so much &lt;3</p>\n<p>- Rachel Vancleave - Mastermind of the Starfold Project, directing, programming and stuff like that</p>\n<p>Ohad Kanne - Producer, the one who kept me as sane as i can and helped me when I decided to back away from the project.</p>", "metacritic": null, "released": "2021-11-27", "tba": false, "updated": "2021-11-29T08:23:09", "background_image": "https://media.rawg.io/media/screenshots/2b0/2b069e82f5dcb8de2991fe893945d17b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rachel Vancleave @Sindiewen"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}