{"id": 70186, "slug": "brave-guns-defense-game", "name": "Brave guns - Defense game", "name_original": "Brave guns - Defense game", "description": "※Introduction<br/>●The dastardly Black Rabbit and his gang have appeared in the peaceful Bunny Town!<br/>●Alongside your fun and trusted friends, protect Bunny Town from its enemies as its new sheriff!<br/>●Bunny Town is a simple shooting action game for users of all ages. The stage “Protect Bunny Town” doubles the fun since you must also handle the strategic defense of Bunny Town using a variety of stats and upgrades.<br/>●Bunny Town sets itself apart from other shooting and defense games with a totally new level of fun and action!<br/><br/>※Features<br/>●\"Train hard and you'll survive!\"<br/> - Make your character stronger with various upgrades. <br/>●\"Take out the enemies with a powerful single strike or use a special skill!\"<br/> - Use a variety of skills to fend off enemies when the odds are stacked against you.<br/>●\"I’ll take care of anyone that you miss. You can count on me. *Hiccup*\"<br/> - Mercenaries provides the support you need in battle and even give extra stats.<br/>●\"Trust yourself, and luck will follow.\"<br/> - Upgrade items to acquire even more powerful items. Combine items to acquire higher-class items.<br/>●\"Look at ‘em all… Oh, well… I’m sure you’ll manage them all just fine.\"<br/> - Play “Unlimited\" Stages to acquire advanced items and compete against other users.<br/><br/>Fan page : https://www.facebook.com/bunnytowngame", "metacritic": null, "released": "2014-01-22", "tba": false, "updated": "2019-10-22T14:26:06", "background_image": "https://media.rawg.io/media/screenshots/1f0/1f01f29a7a6f9ab04258107d2bc86dd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nurigames"], "genres": ["Action", "Arcade"], "publishers": ["nurigames"], "esrb_rating": "Teen"}