{"id": 701975, "slug": "exes-assault-sfw-version", "name": "Exes Assault!! (SFW version)", "name_original": "Exes Assault!! (SFW version)", "description": "<p>Jorge is kind of a dick, but now he's forced by circumstances to act like a responsible adult. So he finds a good job in a multinational company, which he's really happy about... until he finds out that he will have to work with four of his exes!</p>\n<p>In this romantic comedy in an office setting, you'll help Jorge interact with his exes on a daily basis, while trying to clean his karma and make up for all the crap he used to do to them.\r\n</p>\n<p><strong>WARNING</strong>: This is the SFW version of the demo, perfect if you prefer not to see adult stuff but still enjoy some spicy situations. Also, totally apt for Twitch or Youtube gameplay! You can link back to us without a problem ;)</p>\n<p>You can find the NSFW version of the demo here: https://ertal-games.itch.io/exes-assault</p>\n<p><em><strong>DEMO AVAILABLE IN ENGLISH AND SPANISH</strong></em>\n</p>\n\n\n\n\n<p>---------------------------------------------------------------------------------------------</p>\n<p><strong><em>¡¡LOS EXES ATACAN!!</em></strong></p>\n<p>Jorge siempre ha sido un cabeza loca, pero se ve obligado por las circunstancias a portarse como un adulto responsable. Así que encuentra un trabajo en una multinational, lo que parece un sueño hecho realidad... ¡hasta que descubre que va a tener que trabajar con cuatro de sus ex novios!\r\n</p>\n<p>En esta comedia romántica de oficina, tendrás que ayudar a Jorge a interactuar con sus exes todos los días, mientras intenta limpiar su karma y resarcirles por todo lo que les hizo en el pasado.\r\n</p>\n<p><strong>AVISO:  </strong>Esta es la versión \"apta\" de la demo, perfecta si prefieres no ver contenido adulto pero aún así te gustan las situaciones subidas de tono. ¡Totalmente adecuado para Twitch o Youtube! Puedes compartir el enlace a la página sin ningún problema ;)</p>\n<p>Puedes encontrar la versión +18 de la demo aquí:  https://ertal-games.itch.io/exes-assault</p>", "metacritic": null, "released": "2021-11-26", "tba": false, "updated": "2021-11-29T09:08:56", "background_image": "https://media.rawg.io/media/screenshots/268/268f7e3260fa346d7babc2a96fc81a80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Ertal Games"], "genres": [], "publishers": [], "esrb_rating": null}