{"id": 702193, "slug": "road-to-newtopia", "name": "Road to Newtopia", "name_original": "Road to Newtopia", "description": "<p>Road to Newtopia is a fan made game based on the cartoon Amphibia and inspired by several classic games such as The Oregon Trail, Earthbound, Kirby, and others. </p>\n<p>Help guide Maggie or one of her friends through the wilds of Amphibia. Along the way, several randomly selected encounters will occur. Make decisions, use items, battle enemies, and befriend frogs in order to survive. Make it all the way to Newtopia in one piece to win.\r\n  </p>\n<p>And if you don’t want to play as joke characters, you can instead play through the whole game as Anne in a totally not rushed bonus mode. Featuring some custom dialogue, a unique intro, and two unique endings ripped right from the show. Just press “b” at the character select screen to start her journey. (B for Boonchuy)\r\n  </p>\n<p>Features:<br/>- 5 playable characters each with their own starting items<br/>- 85+ randomly generated encounters including a few familiar faces<br/>- 40+ different enemies to fight<br/>- 45+ items to help along the way<br/>- 10 different endings<br/>- 13 music tracks, including a bunch of Amphibia remixes<br/>- Minigames! <br/></p>\n<p>Thanks again to laserlizard0, Barry, Astro Sleep,  Tsuwami, VulpsVulps, Lenty AV, M:AM, Karu, pekano, AmphibiaMedia, Goblino, Money Burger, fruityboyjr, RaspberryPiNews, and everyone else who helped make this project possible. Check out the credits file in the download folder (or the in game credits) for more details and some links to their works.</p>", "metacritic": null, "released": "2021-11-26", "tba": false, "updated": "2021-11-29T10:05:00", "background_image": "https://media.rawg.io/media/screenshots/ecb/ecbd6859df9bdcc6972525afebba1fd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["krizby"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": [], "esrb_rating": null}