{"id": 702283, "slug": "winter-dream", "name": "Winter Dream", "name_original": "Winter Dream", "description": "Winter vacation has come for Caron Duff and he's looking forward to his time out of school. However, his vacation won't be spent at home and he'll be moving in with his uncle who owns a restaurant. Upon arriving in town, he finds the scenery to be way more familiar than it should be. When he gets to his uncle's restaurant, he meets Velda Penn, a very rude girl that works for Daniel. Caron gets some time to look around town and that's when he runs into Gwen Coy, a somewhat shy girl with a bit of a playful side and Rose Sherburn, who cares way more about others than herself.<br/>\n<br/>\r\nNo matter where he goes, Caron won't be able to avoid talking to any of them. As he spends more time with them, he will learn all kinds of things about them. All three of three of them are feeling some kind of pain from incidents that happened to them in their pasts. While he tries to enjoy his vacation, Caron will learn about what's hurting them and how all three of them are connected to him. There will be plenty of time to do so, since this will be his longest winter vacation.<br/>\n<br/>\r\nIn this visual novel, there are three main routes, one for each of the girls. Velda, Gwen, and Rose all have both friendship and romance endings. You will be given choices to make throughout their stories, and if you make the wrong ones, you'll get one of their bad endings. When Caron's getting used to town, he can either spend his time alone or try to make some new friends. Getting the good endings for each of the girls isn't where the story ends though. Get at least one happy ending for each of them, and you'll unlock the true route which will tell you the truth behind everything. Caron will have to accept it, no matter how painful it is. No matter what happens, this will be an unforgettable winter break.", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-03T03:14:27", "background_image": "https://media.rawg.io/media/screenshots/38a/38ac0a77af674264e9ef7fc4d6b3b6ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Conor Hehr"], "genres": ["Simulation", "Casual"], "publishers": ["Conor Hehr"], "esrb_rating": null}