{"id": 70222, "slug": "fight-club-4th-edition", "name": "Fight Club 4th Edition", "name_original": "Fight Club 4th Edition", "description": "Keep track of your 4th Edition PCs with this digital character sheet.  This app will help take most of the pen and paper work out of the role-playing game.  It keeps all the important stats, powers, and more within quick and easy access.  It can even roll for you, helping to speed up your turns.<br/><br/>Features:<br/>- Tracks your HP, healing surges, conditions, power points, money, and more<br/>- Quickly access lists of all your important numbers: Defenses, ability scores modifiers, senses, and skills<br/>- Keeps a list of all your powers and items that can be scrolled through for easy viewing<br/>- Make rolls (attack, damage, initiative, etc...) with the touch of a button<br/>- Easily heal and take damage, add and spend money.  All the math is done for you<br/>- Stats are calculated based on level, attribute modifiers, and other bonuses you input<br/>- Take notes of your adventure<br/>- Roller for quick customized rolls<br/>- Supports multiple characters<br/><br/>You will have to import your character's information manually.  The amount of time that process takes depends on how much you want this app to track.  Using it as a health tracker only takes a few seconds.  Inputting the details of all your powers will, of course, take more time.<br/><br/>Please send any comments, suggestions, or bugs you find to lionsden.contact@gmail.com.", "metacritic": null, "released": "2011-07-11", "tba": false, "updated": "2019-10-22T14:26:07", "background_image": "https://media.rawg.io/media/screenshots/f94/f94fb43df6def8feff08e557fedc8669.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lion's Den"], "genres": ["Adventure", "RPG"], "publishers": ["Leo Mortero"], "esrb_rating": "Everyone 10+"}