{"id": 70226, "slug": "game-392", "name": "1812", "name_original": "1812", "description": "1812 Cannon Defense Borodino<br/>Full 3D Gameplay with hundreds of enemies across 7 levels<br/><br/>Fun physics system with explosions and ragdoll physics.<br/><br/>Upgrade your cannon - Get upgrades, health packs, mortar support and a telescope to help you in battle<br/><br/>Bite sized exciting historical arcade gameplay<br/><br/>Play as either the Russians or French<br/><br/>Cute Toy Solder style characters.<br/><br/>Fight as a canoneer at the battle of Borodino.  The Battle of Borodino is painstakingly recreated with original uniforms, maps and weapons. Full 3D Gameplay with hundreds of enemies across 7 levels<br/><br/>Fun physics system with explosions and ragdoll physics.<br/><br/>Upgrade your cannon - Get upgrades, health packs, mortar support and a telescope to help you in battle.  Add the Battle of Waterloo level pack with a paid upgrade for even more fun.<br/><br/>Bite sized exciting historical arcade gameplay.  Play as either the Russian or French, with the Prussians arriving later as always.<br/><br/>Watch as cute Toy Solder style characters go flying through the air.<br/><br/>Time for Action<br/>Napoleon has marched on Moscow, what is the greatest general the world has ever known to do.  Before Napoleon met his Waterloo he became snowed in in Russia, most experts put this down to the mistakes he made at Borodino in 1812.  Can you do better?<br/><br/>The action is spread over four locations: Great Redoubt, Semenovskaya, Shevardino and Borodino itself. You'll be aiming your cannon at soldiers, other cannons and cavalry*. With the chaos you'll cause, you just might save the day.<br/><br/>1812 Cannon Defense Borodino is an unusual tower defense game that features a front-view, 3D perspective. Roll your cannon from left to right, forward and back as you aim and mow down the enemy. Cannon Defense Waterloo uses ragdoll physics and has plenty of explosions. Choose to play as the French or the British.<br/><br/>Keep your aim steady and see if the Napoleon can conquer Russia this time.<br/><br/>* Only fully trained stunt horses are used in the making of this game", "metacritic": null, "released": "2016-02-03", "tba": false, "updated": "2019-10-22T14:26:07", "background_image": "https://media.rawg.io/media/screenshots/52f/52f1a7c82f4685708d3c9d5533de2d9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Onteca"], "genres": ["Adventure", "Arcade"], "publishers": ["Onteca"], "esrb_rating": "Teen"}