{"id": 702263, "slug": "draft-day-sports-pro-basketball-2022", "name": "Draft Day Sports: Pro Basketball 2022", "name_original": "Draft Day Sports: Pro Basketball 2022", "description": "Draft Day Sports: Pro Basketball 2022 puts you in the general manager's seat of your favorite professional basketball team like never before. If you have ever dreamed of being a basketball general manager then prepare to experience basketball nirvana.<br/>\n<br/>\r\nTake over your favorite team and draft, trade, sign free agents and make strategic decisions to set them on a course to be the next great dynasty in this career based simulation. Enjoy the immersive, simulated gameplay and rich almanac storing an archive worth of stats and records while you make the day to day decisions to guide your franchise to the top of the basketball world. Check out the insanely detailed draft - you'll feel as if you're right in the middle of the real thing. <br/>\n<br/>\r\nOur new personality types feature gives you the added challenge of managing your coaches and players off the floor and making sure team chemistry stays in tact. The completely redone scouting process gives you added control over what you want to scout in the next batch of rookies and the revamped free agency features give you an even more realistic feel with the additions of player meetings and the ability to make promises as part of your pitch to why they should play for you.<br/>\n<br/>\r\nThis is the closest you'll get to living out your dream of running your favorite basketball team!", "metacritic": null, "released": "2021-12-02", "tba": false, "updated": "2021-12-03T02:58:05", "background_image": "https://media.rawg.io/media/screenshots/66f/66fa9a089e6dc8599c58b5ba64463a66.jpg", "website": "http://www.wolverinestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wolverine Studios"], "genres": ["Strategy", "Simulation", "Sports", "Indie"], "publishers": ["Wolverine Studios"], "esrb_rating": null}