{"id": 702252, "slug": "sons-of-liberty", "name": "Sons of Liberty", "name_original": "Sons of Liberty", "description": "<h3>Fight the war that gave America her independence and her Constitution</h3>\n<p>...a war that changed the history of the world!</p>\n<p>SONS OF LIBERTY marks SSI&#39;s foray into the Revolutionary War. Using our considerable talents in wargaming, we&#39;ve faithfully re-created the look and feel of that historic conflict, where splendidly dressed British redcoats fought upstart rebels in stiff lines and columns.</p>\n<p>Three epic battles make up this game, each increasing in complexity and scale. And each battle can be fought under Introductory, Intermediate or Advanced rules. In solitaire play, the computer can direct either or both sides.</p>\n<p>The Battle of Bunker Hill serves as an apt entrance to the game, just as it served as the first major battle of the American Revolution. This critical engagement was a small affair, involving only a few thousand men and a tiny patch of ground. Even under Advanced rules, this scenario can be savored quickly.</p>\n<p>The Battle of Monmouth pitted George Washington&#39;s winter-hardened veterans against the British in what proved to be a battle of indecisive outcome. What it did show was Washington&#39;s leadership, an admirable ability to keep his army together and its morale up against the adversities of weather and war. Can you do as well?</p>\n<p>The Battle of Saratoga - the largest of the three - is regarded as the turning point of the Revolution. The rigid formation of the British proved highly unsuited for the heavily wooded terrain, which favored the Colonial&#39;s more flexible run-and-shoot style. Historically the British lost, and her defeat convinced France that it was an opportune time to declare war on England, forcing her to fight on two fronts. Will you be able to repeat the outcome?</p>\n<h3>Fail and America might still be flying the British jack.</h3>", "metacritic": null, "released": "1987-01-02", "tba": false, "updated": "2023-02-08T10:50:42", "background_image": "https://media.rawg.io/media/screenshots/9a6/9a6ac5f5d6fff7a552c3c11125f7196c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Atari 8-bit", "Apple II", "Commodore / Amiga"], "developers": ["Strategic Simulations"], "genres": ["Strategy"], "publishers": ["Strategic Simulations"], "esrb_rating": null}