{"id": 702279, "slug": "the-dawn-snipers-way", "name": "The Dawn: Sniper's Way", "name_original": "The Dawn: Sniper's Way", "description": "We are glad to present you our game universe of The Dawn: Sniper's Way. Inspired by aesthetics of Soviet post-apocalypse, our team has been working on the dream project for several years already, wishing to create vast open spaces and endless possibilities for the players on-line. We have chosen the best engine and are advancing gradually towards the goal to create an expanding universe in all aspects of gameplay mechanics. Abandoned towns and impenetrable forests will become your shelter from the enemy or a dangerous place where you'd better not enter.<br/><br/>Player Upgrades System:<br/><br/>More than 20 video characteristics.<br/><br/><br/><br/><br/>The town of Seversk was abandoned in 1985 because severe flooding of important industrial facilities. Several decades after classifying the town the cases of illegal diggership and stalkership have become more frequent. The export of valuable metals, weapons, vehicles and special spare parts developed in the local research institutes has grown to a massive scale. Your objective is to eliminate the illegal groups and impose order on the classified facilities. The decision has been made in the headquarters to carry out the operation quickly and quietly, therefore you are the military intelligence sniper. Good luck in combat!<br/><br/><br/><br/>Menu Upgrades:<br/><br/>Collect glowning green details to get characters leveling points.<br/><br/><br/><br/>Great huge and seamless open world:<br/><br/><br/><br/>Inventory system and various types traders:<br/><br/>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T03:12:08", "background_image": "https://media.rawg.io/media/screenshots/22a/22a47b61f0b5bf6148ddac65a39f8279.jpg", "website": "https://www.thedawnsnipersway.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PHOSPHORUS GAMES"], "genres": ["Action", "Massively Multiplayer", "Indie"], "publishers": ["PHOSPHORUS GAMES"], "esrb_rating": null}