{"id": 702389, "slug": "castle-on-the-coast", "name": "Castle on the Coast", "name_original": "Castle on the Coast", "description": "<p>Castle on the Coast is a hand-drawn, retro 3D collectathon that casts you as an adorable, parkouring giraffe named George!<br />\nCastle on the Coast is a bedazzling collectathon arcade platformer. George, a friendly giraffe, parkours through challenging levels full of crystal caverns, stone-laden halls, and trippy alternate dimensions, trying to bring together a family of the two powerful, conflicted wizards. In the co-op mode, he can use help from his squirrel friend called Swirlz.<br />\nThanks to cooperation mode, even the youngest gamers will be able to enjoy George’s adventures, playing together with their friends or their sitters. Besides all the arcade fun, Castle on the Coast offers a more serious, moral angle. It will touch upon dealing with loss, conflict, and loving your enemies.VALLEY CHILDREN’S HOSPITALGeorge the Giraffe is the official mascot of Valley Children’s Hospital in California. George has symbolized the love and care found at Valley Children’s there for nearly seven decades. “Adopted” as the hospital’s mascot by its five founding mothers, a giraffe was chosen because they have the largest heart of any land mammal. And that heart is present in the care provided at Valley Children’s every single day. Now, thanks to the cooperation between Valley Children’s, Big Heart Productions, and Klabater, the beloved giraffe will debut in a video game!A magic castle entrenched in conflictHelp George explore the magical Castle on the Coast, home to crystal caverns, stone laden halls, and trippy alternate dimensions. Seamlessly wander from level to level with no loading screens in a large, interconnected world.<br />\nAll is not well in this land, however. Two powerful wizards bear a grudge against their fellow orphans. Can George bring this family back together again, or will he just get in the way?A cute giraffe with XTREME PARKOUR POWERS!?This giraffe can get anywhere, anytime! String together wall runs, wall jumps, spins, dives, rolls, and more with responsive controls. Carve new paths through levels in a quest to frustrate level designers. When cool moves aren&#39;t enough, don a jetpack or a rocket powered car to reach new heights.<br />\nA 3D collectathonShove a plethora of goodies down your pockets as you explore! Flowers unlock new costumes, star keys unlock doors, and keystones... those unlock the looming central tower...<br />\nA nutty sidekick joins the mixPlayer 2 can control George&#39;s sidekick: Swirlz the flying squirrel! Create helpful springy flowers, blast enemies with magic, or become a living parachute to slow George&#39;s descent. When George and Swirlz work together, nothing is impossible!</p>", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2023-08-05T09:22:39", "background_image": "https://media.rawg.io/media/screenshots/d6d/d6d4f6067c2e7b3e8dd1269c1a4f5a03.jpg", "website": "https://klabater.com/en/games/castle-on-the-coast-en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 15, "owned": 18, "dropped": 1, "playing": 1}, "playtime": 11, "achievements_count": 41, "ratings_count": 1, "suggestions_count": 548, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Nintendo Switch"], "developers": ["Big Heart Productions"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Klabater"], "esrb_rating": null}