{"id": 702376, "slug": "nsfw-studio", "name": "NSFW Studio", "name_original": "NSFW Studio", "description": "<p>Congrats and welcome to the NSFW team! As our main video editor, your job won’t be too much of a hassle. All you have to do is edit some sexy videos, seduce top class babes and get paid for it! Pretty rad, right?<br />\nDid we mention the very best part of it all? You have the chance of making all your wet dreams come true, and rejoice in steamy moments with all the pretty ladies who step into this office! Plus, you get to use the latest softwares and tools to help you finish your work. You will also be provided with a huge desk where you can store all the naughty decorations you can think of. And who knows, maybe you can do some other kinky stuff on top of it, too?<br />\nAs you might have expected, NSFW Studio is not your basic idle clicker game. Get ready to indulge yourself in five fun arcade mini games while you get to fuck some of the hottest girls around.<br />\nBut make sure you don’t get caught and fill their pleasure meter!!! Or else you won’t get that sweet sexy scene from them...<br />\nSend your freelancers gifts via the chat function and deepen your bond with them for an extra chance to get laid. Once you have earned enough, you can also buy high-tech editing software and get some helpful tools as you advance, to complete your work even faster. We guarantee you will never grow tired of this job.<br />\nIn short, you can get to fuck your hot co-workers and all those gorgeous porn stars who come to our studio! Sounds like a dream, right? But tread lightly, otherwise your ass will be thrown out the backdoor!<br />\nMeet smoking hot girls, engage in steamy chats, and go wild with sizzling H-scenes!<br />\nUnlock the NSFW Mode and see your coworkers&#39; secret kinky sides!<br />\nCollect and upgrade helpful work instruments !<br />\nEdit animated porn clips with a couple of variations each!</p>", "metacritic": null, "released": "2021-12-02", "tba": false, "updated": "2023-01-02T18:00:23", "background_image": "https://media.rawg.io/media/games/3f6/3f625941b45b3dc5b826b3e19988f08f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 105, "toplay": 2, "playing": 1}, "playtime": 6, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Galatea Interactive"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Nutaku Publishing"], "esrb_rating": null}