{"id": 702365, "slug": "the-lost-delinquents-of-rollings-high-2", "name": "The Lost Delinquents of Rollings High", "name_original": "The Lost Delinquents of Rollings High", "description": "\"The Lost Delinquents of Rollings High\"<br/>\r\nA visual novel, with an 80s anime inspired look.<br/>\r\nYou play as Marty Greenwood, a high school senior just about to graduate from Rollings High School.<br/>\r\nMarty lives in the peaceful mountain town of \"Franks Hollow\" and this is his final week of senior year.<br/>\r\nProm and exams are coming up, along with a host of school events, the final week promises to be brimming with High school mischief and memories!<br/>\r\nBut there's something terribly wrong in Franks Hollow....will Marty and his friends be able to discover what it is before prom and graduation?<br/>\r\n---<br/>\r\nInspired by the works of HP Lovecraft, cheesy RL Stine books, choose your own adventure novels and dating sims of the 90s, Rollings High is a fun game aimed at the thinking player.<br/>\r\n----<br/>\r\nYour choices matter, great care has been taken to ensure your choices effect gameplay events and your relationships with your school friends.<br/>\r\nBe immersed in the wacky town of Franks Hollow, extra care has been made to bring to life the township of Franks Hollow with exploration of the town, school and shops, along with TV stations, restaurants and even a VHS rental store.<br/>\r\nDiscover the mystery of the town, you can play the game as an enjoyable dating sim with a cast of lovable high schoolers, or you can get serious and try and discover what's really going on in Franks Hollow....", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-03T04:16:35", "background_image": "https://media.rawg.io/media/screenshots/11a/11a25c65e575e84da2e2a1878ce6625e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jago Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["Jago Games"], "esrb_rating": null}