{"id": 702301, "slug": "sul-3d-schutze-unser-land", "name": "SUL 3D - Schütze Unser Land", "name_original": "SUL 3D - Schütze Unser Land", "description": "This video game takes place in an alternate reality where the dictatorship in Brazil never ended, instead it evolved into an integralist fascist dictatorship. You fight to free Rio Grande do Sul from fascist domination and implement a democratic and popular republic in the Pampa Gaucho.<br/><br/>In this game you'll have to face soldiers, police, gangs, robots and even integralist zombies.<br/><br/>You'll have access to a vast arsenal with almost infinite ammunition, which works like in games from the 90s-2000s: collecting all possible weapons and selecting them on the keyboard's numeral (from zero to 9).<br/><br/>During missions you'll have to find a key or pull a lever to unlock a main door, while dealing with hordes of Integralist enemies, in order to advance to the next level.<br/><br/>You can walk, run, jump, crouch, crouch, shoot and aim with weapons that have scope (like the sniper for example) in addition to collecting weapons, keys, opening doors and unlocking doors by activating valves.<br/><br/>The game doesn't have an exaggerated graphic violence but it contains blood and, in some specific phases, it shows human limbs (like legs, arms, etc...) thrown by the scene.<br/><br/>Note that this game was developed with the intention of \"looking\" like an old game, as if it was made between the late 90s and early 2000s. So the graphics, gameplay and objectives are similar to games of first-person shooters made at that years.<br/><br/>We hope you enjoy the game!", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-03T03:26:36", "background_image": "https://media.rawg.io/media/screenshots/e41/e41ce7649df4a5208da36b3dfcf5847b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blue Raven Entertainments"], "genres": ["Action", "Adventure"], "publishers": ["Blue Raven Entertainments"], "esrb_rating": null}