{"id": 702473, "slug": "contos-de-aldore-toca-do-dragao", "name": "Contos de Aldore - Toca do Dragão", "name_original": "Contos de Aldore - Toca do Dragão", "description": "\"Bem-vindos ao Toca do Dragão! Divirtam-se e bebam com moderação!\"\r\n\n<p>Um novo jogo autônomo baseado no mundo criado e conhecido como Aldore.</p>\n<p>No ano 508, um grupo de guerreiros de locais diferentes se encontram individualmente e começam sua jornada para descobrir a causa de todos os monstros voltarem a aparecer em Aldore. Este jogo aborda uma história paralela e secundária de outros guerreiros, ou seja, os membros da <strong>Toca do Dragão</strong>!<br/>O termo \"Contos de Aldore\" mostra histórias distintas dentro de Aldore, um mundo repleto de possibilidades. Criado e recriado com o passar do tempo, a natureza e suas ramificações nascem, morrem, renascem e, assim, existe um importante ciclo.</p>\n<p>Assim como em Cavaleiros Natalinos, este jogo não faz parte do objetivo do projeto principal que está em andamento, mas será adicionado como uma história paralela, citado antes, com o intuito de explorar enredos paralelos e diferentes. Muitas coisas são familiares, como controlar o personagem, funções das teclas e sistema de batalha, com a adição de novos itens e equipamentos (porém existem algumas diferenças), mecânica de pular para atravessar algo e encontrar itens secretos, mecânicas de habilidades entre certos personagens ou dependendo dos parâmetros, entre outras coisas!</p>\n\n<p>Em \"Mais Informações\", há informações sobre como o jogo foi feito, data de lançamento, atualizações e link para os meus posts em outros sites!</p>\n<p>O botão para baixar o jogo (apenas Windows) está abaixo desta descrição! Aproveite, dê seu feedback, siga e ouça a Toca do Dragão Podcast!!</p>", "metacritic": null, "released": "2021-12-02", "tba": false, "updated": "2021-12-03T05:07:48", "background_image": "https://media.rawg.io/media/screenshots/f58/f582115f035387d61e5e49615e8831c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ryan Vitor"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}