{"id": 702400, "slug": "mirror-party", "name": "Mirror Party", "name_original": "Mirror Party", "description": "A huge crisis broke out in the Mirror-verse. In the name of justice (or probably mischief), the bishojos went to war! Select your heroine and fight! The mini-game collection of Mirror-verse: Mirror Party<h3>[GAMPLAY]</h3>There are currently 4 minigames, we plan to add as many as we can before the formal release.<br/><br/><ul><li>Tank Battlefield: No one can stop a trumping tank! Except for another tank. Wipe your opponents off of this earth, and earn some points along the way.<br/><br/><br/></li><li>Leah's Secret Room: Leah has lost many of her stuff and she needs your help to find it. And of course, she's going to reward you... in her own way.<br/><br/><br/></li><li>Fireball Royale: Launch your mighty fireballs at your rivals and see what happens! Be careful of those poisonous fog, lightning, and more!<br/><br/><br/></li><li>Frenzy Farm: Who can resist the cute animals? But how about when they have gone frenzy! Contain them with the pumpkins!</li></ul><h3>[GACHA MACHINE]</h3>Getting a little tired? I bet our 300+ collectibles can get you back. See those Gacha Tokens you got, put them in the Gacha Machine, and collect as many as you can. 100+ CGs, 100+ Cosplay Albums, Avatars for the Launcher, OST theme songs of Mirror Series.<br/><br/><br/><br/><strong>We plan to increase the number of collectibles from 300 to 1000 before the formal release.</strong><h3>[FEATURE]</h3><ul><li>3D-Chibi rendition of characters from the Mirror Series.<br/><br/></li><li>Covered many genres of games of interesting mechanics.<br/><br/></li><li>Over 300 (1000 before the formal release) collectibles from the Gacha Machine.<br/><br/></li><li>On-line component, more people, more fun!</li></ul>", "metacritic": null, "released": "2021-12-02", "tba": false, "updated": "2021-12-03T04:41:32", "background_image": "https://media.rawg.io/media/screenshots/de4/de41d396de217c56bc49d93b18acde1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 37}, "playtime": 4, "achievements_count": 1, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KAGAMI Ⅱ WORKs"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["NIJICO"], "esrb_rating": null}