{"id": 702537, "slug": "chicken-invaders-dos-version-fanmade-remake", "name": "Chicken Invaders DOS Version Fanmade Remake", "name_original": "Chicken Invaders DOS Version Fanmade Remake", "description": "<p><em>Disclaimer: This is a fanmade project made without direct involvement from InterAction studios, the developer of the Chicken Invaders series.</em></p>\n\n<p>A fanmade remake of the first, proof-of-concept version of Chicken Invaders from 1997, the game that started the somewhat popular series of the same name.</p>\n<p>It was originally made in Borland C++ 3.1 with Ultra VGA Engine for C++, and it's the starting point for some of the main features and gameplay elements of the series. Some parts from this game did not carry over to the later ones, the main one being that instead of a spaceship, the player controlled a handgun that shot actual bullets. As this was a proof-of-concept, it wasn't ever properly finished, and as such it did not have any intro, power-ups, missiles or UI elements such as score and lives. It only contains three waves of 40 Chickens, and a boss battle against a \"large chicken\", after which the game cannot progress.</p>\n<p>Also in 1997, there was an attempted port of this version using Java (Java Development Kit 1.1) instead of C++. However, Java wasn't powerful enough at the time, and it couldn't handle decent animation. As such, only the first wave was ported over.</p>\n<p>Eventually, the 1999 \"DX\" version was made and publicly released, becoming famous and getting downloaded millions of times. The series is still going today with the newest installment, Chicken Invaders Universe, still being in early access.</p>\n<p>This remake includes playable versions of both the original C++ version and the Java port. The developer had lost most of the files from these versions, except for the title screen, so the rest of them had to be remade by hand. Some assets were borrowed from InterAction studios' other DOS games, Radar Wars Arcade and BattleTank. Also included is an option to enable extra features made for the remake that were not present in original version, such as an intro, score, lives and particle explosions. It was made in Clickteam Fusion 2.5.</p>\n<p>The default controls are left and right arrow keys for movement and Shift for shooting. There is an option for touchscreen controls as well, only on devices without a keyboard.</p>\n<p>Aside from the HTML5 version, there is also a standalone Windows version that has extra options for the window resolution and screen ratio.</p>", "metacritic": null, "released": "2021-12-02", "tba": false, "updated": "2021-12-03T05:24:31", "background_image": "https://media.rawg.io/media/screenshots/557/55747681dd83cadabb752dc25ce90905.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Emerald"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}