{"id": 702523, "slug": "medalism-retaliation", "name": "MEDALISM Retaliation", "name_original": "MEDALISM Retaliation", "description": "<p><strong>AN EXTREME SACRIFICE FOR YOU</strong><br/></p>\n<p>Lisbeth awakens from a mysterious spell that turned her into a statue. Around her other people were subjected by the same fate, in particular they are Lisbeth's closest people! Using her spirit medium abilities, she travels inside their inner worlds, defeating the spirits haunting them and finding a cure, while a mysterious evil presence awaits for its moment to take her down\r\n</p>\n<p><strong>INSIDIOUS TRIP BETWEEN REGIONS</strong>\n</p>\n<p>Explore different worlds to find vessels haunted by spirits, unlock gates and teleporters to travel between sections, unravel memories related to the host by defeating powerful enemies inside the elemental pillars scattered around the realm.</p>\n<p>\n</p>\n<p><strong>PYROTECHNIC SUCCESSION OF SPELLS</strong>\n</p>\n<p>Use your Medals effectively to launch spells at the right enemy and make use of elements to deal massive damage. Protect yourself from attacks and don't let the enemies deplete all your health. Gather souls to increase your potential further and forbid your enemies from fleeing the battle.\r\n</p>\n<p><strong>STRATEGIC MODIFICATIONS</strong>\n</p>\n<p>At your main base your Medals can be modified and further improved: consume souls to acquire more spells, amplify the slots available on your Medals or disassemble them to adopt a new strategy. Make sure to assemble unique Medals to counter threats of different types.\r\n</p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T05:20:42", "background_image": "https://media.rawg.io/media/screenshots/3dd/3dd56738a53d1d4503eadcf00fb5d518.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LittleMugGames"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}