{"id": 70272, "slug": "slots-titans-way", "name": "Slots - Titan's Way", "name_original": "Slots - Titan's Way", "description": "***THE BEST FREE-TO-PLAY SLOTS GAME***<br/><br/>THE BEST SLOTS GAMES<br/><br/>Slots - Titan's Way have all the best slots games.  You will never have to look for another slot game after playing Slots - Titan's Way.All new Slots - Titan's Way has burst onto the scene.<br/><br/>HUGE EXPERIENCE<br/><br/>The brand new version of Slots - Titan's Way provides a new kind of slots experience! With a huge variety of payouts and no max bet limits, it’s the only slots game that’ll give you the tons of excitement and fun that you’re looking for.<br/><br/>LAS VEGAS IN YOUR POCKET<br/><br/>Multiple styles of gameplay will give you the experience of being at a Las Vegas casino, right on your iPhone/iPad!<br/><br/>FUN AND SATISFYING EXPERIENCE<br/><br/>What are you waiting for? Download Slots - Titan's Way now and winning BONUS, FREE SPINS, BIG WIN, MEGA WIN, HUGE WIN, EPIC WIN and JACKPOT.  Download now for FREE in this amazing Slots - Titan's Way experience!<br/><br/>If you love slots games, then you won’t want to miss out on Slots - Titan's Way. Now millions of players chose Slots - Titan's Way, so play it now!<br/><br/>Highlighted features:<br/>- Multiple styles of slots gameplay!<br/>- Huge payouts that are more satisfying than anything you’ve experienced before!<br/>- A huge variety of payouts means the winnings just keep on pouring in!<br/>- Varying play styles to keep things interesting!<br/>- Non-stop discounts, so you can always enjoy the best deals!<br/>- New slot machines added regularly, the fun never stops!<br/>- Fast-paced tumbling reel action that will keep you winning again and again!<br/>- Super re-spin mode that makes your big wins even bigger!<br/>- Extra bonus chips each hour!<br/>-Offline mode available: free to play with or without internet connection!<br/><br/>The Best Slots Games are produced for you by TOPGAME™.<br/><br/>The game is intended for an adult audience. The game does not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"", "metacritic": null, "released": "2013-07-06", "tba": false, "updated": "2019-10-22T14:26:08", "background_image": "https://media.rawg.io/media/screenshots/851/851f3cf34ad3eef8d1bb1a1d16cac1d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TOPGAME"], "genres": ["Card"], "publishers": ["TOPGAME GLOBAL"], "esrb_rating": "Teen"}