{"id": 702703, "slug": "spitvox-ace-c64-game", "name": "Spitvox Ace - C64 game", "name_original": "Spitvox Ace - C64 game", "description": "<p><strong>Spitvox Ace   C64  Game  \"shoot 'em up\"<br/></strong></p>\n\n\n<p><strong>...- La Vox videogame &amp;co. - presenta un nuovo gioco di combattimento aereo, dedicato al mitico aeroplano inglese della seconda guerra mondiale di appartenenza alla R.A.F. \"Spitfire\" . Il gioco ispirato  al classico \"1942\" del Commomdore 64 che ha per titolo... - Spitvox Ace - ... e' stato costruito;  ideato nella sua animazione grafica ed effetti sonori, con il S.e.u.c.k. della \"Sensible Softwares del 1987\"; sono stati aggiunti codici aggiuntivi per il front end; miglioramenti del gioco e l'aggiunnta di musica nel titolo e nel gameplay...codici aggiuntivi di  Richard Bayliss di Tnd64 di \"The New Dimension 64\", www.tnd64.unikat.sk. La musica nel titolo ideata da Vg Vox con la partecipazione di Commodoro H.F., musica in gameplay di Vg Vox...picture loader di Fabs di H.F.(Fabio Marcon), anno di costruzione del gioco 2021......Siete in perlustrazione ed in avvicinamento al territorio nemico, quando iniziate a sentire il rumore di aerei in vicinanza...ad un certo punto venite attaccati dalle loro mitragliatrici...cosa fare...riuscite a schivare i loro colpi con una manovra degna di un \"asso\", cosa fare se non ordinare per radio l'attaco immediato alla vostra squadra in formazione...? <br/>Fate attenzione alle ondate di caccia nemiche che cercheranno in tutti i modi di abbattervi e badate alla contraerea, le navi e alle fortezze volanti che cercheranno in tutti i modi di abbatervi e farvi precipitare......impetiteglielo...!!!  </strong></p>\n<p><strong><strong>Portate a termine i livelli di gioco...collegate il vostro joystick in Port2 per muovere il vostro caccia, schivate i colpi nemici, usate il pulsante \"Fire\" per sparare con le mitragliatrici in dotazione e raccogliete gli oggetti \"Bonus vite extra\", per accumulare il fino 10.000...buona battaglia......divertitevi con il mio gioco...saluti...da parte di...Pinov Vox...e dello staff Voxvideogame&amp;Co.</strong></strong>\n</p>", "metacritic": null, "released": "2021-12-02", "tba": false, "updated": "2021-12-03T06:06:32", "background_image": "https://media.rawg.io/media/screenshots/c6b/c6ba5626af8319a9a5424960ac5d753f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Vox videogame&Co."], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}