{"id": 702911, "slug": "bugs-for-a-bug", "name": "Bugs For A Bug", "name_original": "Bugs For A Bug", "description": "<p><em>Day after day you notice food missing from your kitchen. You eventually decide you're going to catch the thug who's been stealing your food. You search for different spy cams to order but gasp at how expensive they are. Instead you decide to order and setup spy bugs in your kitchen as they are much cheaper.</em></p>\n<p><em>You're convinced that you'll be able to catch the food thief as long as you can hear when he or she arrives, <strong>and you did...</strong></em></p>\n<p><em>After finding out your local food thief isn't a person but instead a \"giant flying worm-bug thing\" (which only emits sound through electric signals) you come up with a plan to get rid of it.</em></p>\n<p><em>If there's one thing bugs really hate, it's peppermint. Luckily Christmas is around the corner and your sweet tooth lead you to buying plenty of candy canes.</em></p>\n<p><em>Search for them and collect a few in order to \"bug the bug\" in your kitchen and have it leave your cozy home.</em></p><p><strong>Controls:</strong></p>KeyActionQPick up a candy cane.ZTeleport to the starting position where you can choose to hide or search another area.WTeleport to a highlighted area in order to begin searching it for candy canes.XHide when the monster comes if you're at the starting position.<br/>(Hold while hiding to peak instead)EscPause the game.BackspaceExit the game.<p><strong>This game contains flashing lights and jump scares which may not be suitable for some.</strong><br/></p>\n<p><strong>Update Reason Note:  I discovered shortly after submitting that the random event picker was still \"rigged\" for debugging purposes and had to reset it back to default.</strong></p>\n<p>GitHub URL: https://github.com/ReddKarma/bugsforabug</p>", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-03T06:59:10", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe43158bb47689ab772f842a43e3da04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Sin:Apathy"], "genres": [], "publishers": [], "esrb_rating": null}