{"id": 703077, "slug": "arecibo-foundry-vtt-access", "name": "Arecibo • Foundry VTT Access", "name_original": "Arecibo • Foundry VTT Access", "description": "<p><strong>Play Puerto Rican children who have been </strong><strong>infused with alien powers in the middle of an island-wide crisis.</strong></p>\n<p>Everyone on the island knew that something was amiss when the power went out. In the municipality of Arecibo, frogs and crickets fell quiet, bringing stillness to the night. Slowly but surely, the children started to understand that something far worse than animals dwelled in their tropical paradise. When the island is abruptly blockaded by US Armed Forces, it is up to them to determine what has gone wrong when no adult will listen, and perhaps stop the very end of the world. In the far reaches of space, something stirs in response to the Arecibo message. Deep in the giant caverns of the island, something else answers. <em>Stranger Things</em> and the eldritch meets Puerto Rico in its darkest hours in <em>Arecibo</em>, a Fate World of Adventure by Nicolas Hornyak.\r\n</p>\n<p><em>Arecibo </em>requires Fate Core to play. This supplement contains:\r\n</p>\n<ul><li>Streamlined rules to make young characters, including guidelines on appropriate aspects, skills, and stunts\r\n</li><li>Essential background information for running games set in Arecibo, a city on the north coast of Puerto Rico, complete with drop in locations for your games\r\n</li><li>Transmogrification rules in Fate to define the process of character change from a normal human into an instrument of eldritch power\r\n</li><li>Alternate dimensions—and their inhabitants—reachable through Arecibo\r\n</li><li>A complete starter adventure: The Wow Child\r\n</li></ul>\n<p>Author Nicolas Hornyak wrote <em>Arecibo </em>to honor his Puerto Rican roots in the days before Hurricane Maria, and Arecibo’s stories are now more relevant than ever. </p>\n<p><strong>In Arecibo, <em>somos fuertes</em>. We are strong.</strong>\n</p>\n<p><em>The Fate Adventures &amp; Worlds line provides compact, rich, affordable, gorgeous settings with a ready-to-go adventure for GMs in a pinch. Buy one this afternoon, be ready to run this evening.</em>\n</p>\r\nModule Contents\r\n<ul><li> A setup tool that will fully deploy the content of this module into a world of your choice. This is the way we recommend you use this module, and it works best if you start with a fresh new world. On first load, click the 'Arecibo' thumbnail to commence the setup process.\r\n</li><li> Nine linked Journal Entries accessed from the Journal Entries tab, providing the entire contents of <em>Arecibo</em>, a Fate World first released by Evil Hat Productions as a PDF.\r\n</li><li>Three sample player characters and associated tokens, found in the \"Player Characters\" folder in the Actors Directory. Instructions for creating your own character using the tools here in this FoundryVTT module, in the Journal Entries.\r\n</li><li>Nine linked NPCs with tokens for use as player or GM characters.<br/>\n</li><li>One Rules &amp; Tokens page displaying the Fate Core quick reference: the Fate Ladder, the four actions, the four outcomes, invoking aspects, and compelling aspects, as well as 23 unassigned tokens.</li><li>One map of Arecibo as drawn by a child (and surprisingly accurate!)\r\n</li><li>More illustrations using high-resolution art for scene backgrounds.\r\n</li><li>Twenty unlinked actors/tokens for use with Arecibo or other cosmic kid adventures, stored in the Actors Directory under the 'Tokens RAW' folder.\r\n</li><li>All actors, journals, and assets are available in Compendiums within the game world. Available to expand on your techno-magical kid adventures or re-import fresh versions of all included content.</li></ul>\r\nFoundry VTT Release\r\n<p>This release is intended for use with the Fate Core Official system for Foundry VTT and requires that users already have a Foundry VTT Software License. \r\n</p>\n<p>Once purchased you'll receive an access key on the Download Page (click the \"Claim Key\" button to reveal it) that can be used to unlock the Foundry Premium Content.\r\n</p>\r\nTo activate a key:\r\n<ol><li>Log-in to the Foundry Virtual Tabletop website\r\n</li><li>Click your username in the upper right corner to access your profile page\r\n</li><li>Click the <strong>Premium Content</strong> Button in the lower left\r\n</li><li>Copy and paste your content key into the <strong>Content Key</strong> field\r\n</li><li>Click the <strong>Activate Content</strong> button\r\n</li></ol>\n<p>Once activated the Content Key is added to your account and no further steps are required. Your premium content will appear in your \"Unlocked Premium Content\" list, showcasing what content you have permission to access via the Premium Content section of the package installer in Foundry Virtual Tabletop.\r\n</p>\r\nTo install premium content:\r\n<ol><li>From the Setup menu within Foundry VTT, select the appropriate tab for your content: Game Worlds, Game Systems, or Add-on Modules.\r\n</li><li>On this tab, click the install button in the bottom left corner.\r\n</li><li>In the installation menu that appears, filter the view by clicking the <strong>Premium Content</strong> category on the left hand side.\r\n</li><li>Locate your Premium Content within the list or use the filter field to search for it and click the <strong>Install</strong> button on the right-hand side.\r\n</li></ol>\n<p>If your content displays \"Not Owned\" instead of an installation button please verify that you have activated the content for your account.\r\n</p>\n<p>More details on accessing Premium Content here.</p>", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-03T07:41:22", "background_image": "https://media.rawg.io/media/screenshots/7aa/7aa1c586f89241b8c68796a475f403b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["evilhat"], "genres": [], "publishers": [], "esrb_rating": null}