{"id": 703141, "slug": "a-bug-in-its-mind", "name": "A Bug In Its Mind", "name_original": "A Bug In Its Mind", "description": "<p><strong>Game description:</strong><br/></p>\n<p>A Bug In Its Mind is a psychological adventure game. It contains many deep layers of meanings. Everyone can understand the game messages differently, and there is no right or wrong. The core idea of the game is about making choices and observing the consequences of those choices. </p>\n<p>The main narrative of the game is about the character “It” and the bug in its mind, as in the game title. Character “It” can be any humanoid individual. The same concept applies to all other non-playable characters in the game. Everything remains abstract and anonymous that leaves rooms for players’ own imagination, assumption and comprehension. </p>\n<p>The bug has many meanings. The bug can be the evil side of “It”, the evil spirit that controls “It”, the evil choice, “the big thing” in the forest, “It” itself, or even the dark forest “It” is in. The game also features different endings that convey different messages. Each player may have his/her favorite ending when they play the game. There is no one true ending. Everything is only limited by your imagination and comprehension.</p>\n<p><strong>Game features:</strong></p>\n<ul><li>Dark psychological fantasy theme</li><li>A wide variety of narrative choices and endings </li><li>Narrative-based gameplay </li><li>Achievement system </li><li>Intuitive controls</li><li>Original 2D art </li><li>Original background music</li></ul>\n<p><strong>Game controls:</strong>\n</p>\n<ul><li>Movement left-right: A-D or Left Arrow-Right Arrow\r\n</li><li>Run: Hold Left Shift \r\n</li><li>Jump: Spacebar\r\n</li><li>Interact: E</li></ul>\n<p>This game was made for GameOff 2021 game jam in November 2021. The theme for the jam was Bug. It takes about 3 weeks to develop this game. </p>\n<p>Special thanks to Starlingoboe (@starlingoboe) for the game music, to several playtesters for helping to make this game better, and to my friend for inspiration.</p>\n<p>GitHub repository: https://github.com/notsodramatic/ABugInItsMind</p>", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-03T07:59:47", "background_image": "https://media.rawg.io/media/screenshots/d91/d9136ba83c0f70609724236cdda5d5ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Over-Dramatics"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}