{"id": 703491, "slug": "gleam-glean-gloom-glint", "name": "gleam glean gloom glint", "name_original": "gleam glean gloom glint", "description": "[HUGE EPILEPSY WARNING]\r\n\n<p>(I'll add this guide in the game in the next update but for now here's how the enemies act like)</p><p>WASD to move, space bar to open your tablet, spam left and right mouse buttons one after another to generate electricity</p>\n<p>two types of enemy in the game, one is called lightblind, the other, darkblind</p>\n<p>both can be seen in the light and are invisible in darkness, </p><p>one thing to keep inmind : the enemies follow the last thing to shed light on them</p>\n<p>lightblind , as its name suggests, can only see in the darkness and is harmless in the light (meaning that if it spots you, it'll follow you only when it's not exposed to any light)</p>\n\n<p>darkblind, gets its physical powers from the light, so it's harmless in darkness(although invisible) \r\n</p>\n<p>overall these enemies follow the last thing to shed light on them, \r\n</p>\n\n\n<p>[upcoming updates:</p>\n<p>for now you can choose which level you want to play, that'll be handled by a saving system in the upcoming updates,</p>\n<p>proper in-game expounding of enemy behaviors</p>\n<p>more levels</p>\n<p>maybe I threw in some lore idk</p>\n<p>]</p>\n<p>overall, the current source code the game is running on is pretty botched, due to the time limit, many corners were cut and many improvements and optimizations that could've been done were disregarded. I'll have to overhaul many things and rewrite dozens of lines of code in order to get the game to an enjoyable state. in a sensible timespan, that is :&gt;<br/></p>\n<p>for the time being I'm pretty satisfied with the results . and that's all that matters. </p>\n<p>the game gets a pass as a \"game jam submission\".  as always, be ruthless with your criticism lol.</p>\n\n<p>also don't ask why the name makes zero sense it's because it sounds funny</p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T09:34:02", "background_image": "https://media.rawg.io/media/screenshots/9b7/9b739704b7b9b7b81ea422f174ef7936.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quwatzoki"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}