{"id": 703483, "slug": "sugar-tea-and-rum", "name": "Sugar, Tea and Rum", "name_original": "Sugar, Tea and Rum", "description": "Sugar, Tea and Rum\r\n\r\nIntroduction\r\n<p>In this game you play as merchant. Your job is to get rich by selling and buying goods. In order to do that you have to navigate through seas while fighting with pirates etc.\r\n</p>\n<p>How to play? Using mouse select place where you want to sail. If you have enough Travel Points you can confirm your choice. In ports you can buy and sell goods. Try to make as much money as you can!\r\n</p>\r\nGoal\r\n<p>We approached Crunchless Game Jam the way that we was aiming just for MVP, but we were looking into future to guide us with our choices. We knew that we couldn't have enough time for this project this month (only couple hours a week) but we decided to try without too much pressure.\r\n</p>\r\nDescription\r\n<p>We have splitted our work in four milestones: Main Loop, MVP, All Assets and Tested.\r\n</p>\n<p>For Main Loop to be completed we should have just buying and selling items in ports. At this point we didn't have ship at all.\r\n</p>\n<p>MVP required that game would be somehow playable. We needed to have GUI (no need for it to be pretty). Pirates could just stay in one spot as some kind of \"trap\", but we managed to make them move.\r\n</p>\n<p>All Assets milestone changed our temporary assets to something nicer looking.\r\n</p>\n<p>We actually did all that we have planned for MVP. Of course we wanned to do much more, but we correctly predicted that we wouldn't have enough time for that.\r\n</p>\n<p>Things that we wanted to do \"later\":\r\n</p>\n<ul><li>Quests in cites - example: some other trader want you to transport his goods to some port. You would have time cap for that and would receive reward on completion\r\n</li><li>Ship upgrades (we actually did this, but unfortunately we didn't have enough time to implement buying upgrade)\r\n</li><li>Tavern - as a place where you could find out about quests, buy yourself (or your crew) a beer etc.\r\n</li><li>Capitan upgrades - this would increase maximum action points\r\n</li><li>Crew recruitment - each crew member would have name, stats etc.\r\n</li><li>Day/night system - you could sail at night only after upgrade. It would be more dangerous but player would be faster in port.\r\n</li><li>Morale system - if crew morale would get too low they could start a riot and lock you up/kill you/something else.\r\n</li><li>Quartermaster recruitment - this would give you insight of your income and would allow you to cut payments for crew (but it would lower theirs morale)\r\n</li><li>Option to stop sailing while in motion\r\n</li><li>Option to fight with pirates manually (or automatically as now)\r\n</li><li>and much much more\r\n</li></ul>\r\nTechnologies\r\n<p>Game (prototype) was written in Typescript and JavaScript. \r\n</p>\n<p>We are using Phaser as our game framework. It's open source framework for Canvas and WebGL powered browser games.\r\n</p>\n<p>We are using zustand for state management and ReactJS for user interfaces.</p>\r\nTeam\r\n<p>Here are people responsible of this prototype.\r\n</p>\n<ul><li>jog1t:\r\n<ul><li>programmer\r\n</li></ul>\n</li><li>aweczet:\r\n<ul><li>designer\r\n</li><li>artist\r\n</li><li>marketer\r\n</li></ul>\n</li></ul>\n<p>Of course both of us was helping the other with their tasks. It was (still is) truly co-op game dev (more roles !== more work).\r\n</p>\r\nConclusion\r\n<p>Before Crunchless Game Jam we tried to make a game multiple times and always it ended soon after it began (one time we almost finished game for game jam but Unity failed build crushed us). Unfortunately most of the time we didn't plan realistically and we were spending way too much time on making game in early stage which cost us with quick burnout. This game jam thought us that we don't need to spent a lot of time on project and still can accomplish something while doing our day to day jobs. We are grateful to TimKrief (creator of this game jam) for his idea, that pushed us in right direction.\r\n</p>\n<p>What will happen with this project?\r\n</p>\n<p>Both of us are happy with our progress so far, we really like idea of the game and we are willing to continue to develop it. So you might expect some updates. This year we will take it slow, we will look back on what we did wrong and draw some conclusions. Probably we will plan carefully what we need to do next. But definetly we will slowly and steady continue to develop this game. All information you would find on our twitter (link bellow).\r\n</p>\n<p>We have documented our progress on twitter: https://twitter.com/cherrybrackets</p>\r\nScreenshots", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T09:31:34", "background_image": "https://media.rawg.io/media/screenshots/424/42479fe7a401cf2e92ca1d572a0cda57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cherrybrackets"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}