{"id": 703514, "slug": "bmx-20xx", "name": "BMX 20XX", "name_original": "BMX 20XX", "description": "<p>With your hoverbike, explore on a vast planet where fuel is sparse.  Scan for resources and make quick work of the long trek.<br/><br/></p><p>If you can run it, the Windows version tends to load faster, stutter less, has less glitchy texturing issues, and is generally better -- but still not that great, I really ran into the deadline hard when I failed to get random item spawning working, and a nasty crash in that nearly caused me to miss the deadline entirely.<br/></p>\n<p>If you really want to look for fuel, head west.  The scanner has a 50km range, and the world is 80km x 80km, so once you get out of the corner of the map you shouldn't have any trouble finding the 5 piles of wood that are the sum total of all fuel I managed to get in.  I hit the deadline before I could fix fuel spawning :/<br/></p>\n<p>Use your hand-held scanner to locate energy sources across the map, and lock in the coordinates to send them to your bike's HUD.  If you manage to lose your bike while trying some high-speed stunts, the scanner detects it as an energy source as well.<br/></p>\n<p>Controls:</p>\n<p>WASD - move around<br/>Mouse move - aim<br/>E - mount bike/pickup fuel<br/>F - scanner enable/disable<br/>G / Left mouse button - mark detected target with a waypoint<br/><br/>1 / Enter - Pause/options  (ESC also works in the Windows build)<br/></p>\n<p>Shift - sprint on foot, and boost mode on the bike<br/>Space - Tilt bike upwards<br/>C - Tilt bike downwards<br/></p>\n<p>Cheat controls:</p>\n<p>Tab - Gives you some extra fuel<br/>Backspace - Respawn back where you first loaded in at along with the hoverbike<br/><br/><br/><br/></p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T09:39:17", "background_image": "https://media.rawg.io/media/screenshots/d35/d3562bc638abf45393f8548c0df0345a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["HadleyCanine"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}