{"id": 70366, "slug": "spin-vegas-slots-vip-casino", "name": "Spin Vegas Slots: VIP Casino", "name_original": "Spin Vegas Slots: VIP Casino", "description": "Take our lucky slots for a spin! If you’re looking for the most realistic classic sloto games on mobile, look no further than Spin Vegas Slots! Our exciting sloto games and scratch off games for iPhone and iPad give you a real Vegas experience with the graphics and sounds you love from classic Vegas casinos! Our classic slot games and scratchers are filled with progressives, wilds, free spins and lots of bonuses! <br/><br/>FEATURES:<br/>• New sloto games added bi-weekly<br/>• 65+ lucky slots and scratch cards!<br/>• Up to 10,000,000 coins daily and even more for VIP Players<br/>• More ways to win: Scratch Off Games, Progressives, Daily Wheel Spins, Daily Bonuses, Friend Bonus, 3-Hour Bonus and more!<br/>• VIP Room with better bonuses, bigger wins, huge progressives and exclusive games!<br/><br/>CLASSIC SLOTO GAMES:<br/>• Diamond Arrow (Progressive jackpot is over 5 Billion!)<br/>• Stars and Stacks<br/>• Wild Hide<br/><br/>FAN FAVORITES - OUR MOST POPULAR SLOTO GAMES:<br/>• 10X Fortune<br/>• Super Diamond Multi Wheel (Progressive jackpot is over 1 Billion!)<br/>• Flash Pays (Progressive jackpot is over 1 Billion!)<br/>• And even more lucky slot games that you're sure to love!<br/><br/>SCRATCH AND WIN GAMES!<br/>• Clover Fields<br/>• Molten Hot 7s<br/>• Winning Pick<br/>• Cash Offer<br/>• And even more scratchers that you're sure to love!<br/><br/>Download today and take our lucky slots for a spin! Get the thrill of real Vegas casinos and real scratch off games!<br/><br/>This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money prizes. Practice or success at social gambling does not imply future success at real money gambling.", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-10-22T14:26:12", "background_image": "https://media.rawg.io/media/screenshots/f30/f30b276b12039b356e7b83aab18bb4de.jpg", "website": "http://spinvegascasino.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Design Works Gaming"], "genres": ["Card"], "publishers": ["Design Works Studios"], "esrb_rating": "Teen"}