{"id": 703613, "slug": "beelendless", "name": "Beelendless", "name_original": "Beelendless", "description": "It's endless... it's relentless... it's Beelendless!!!\r\n<p>Beelendless is my entry for the Game Off 2021 game jam. It's an endless runner where you control a bee that needs to maneuver between rocks while picking up flowers. The idea was to make use of the bee's stinger to shoot but there was not enough time to implement it in the jam's timeframe. </p>\n<p>It's still in development and after the voting period I am planning to add a view few more mechanics and polish things up a bit.</p>\n\n<p>I had a ton of fun making this game. It was the first time I used LibGDX for something full 3D and never worked this much which curves. Getting the endless curve right was the hard part, then I could just create the terrain and spawn everything randomly. Maybe a bit too randomly since I did not have the time to make the levels more interesting and harder over time/distance.<br/></p>\n<p>20 hours left to shrink this list.<br/></p>\n<ul><li>Fix controls (done)</li><li>Fix gaps between edge rocks</li><li>No spawning at the beginning of the track (done)</li><li>Make the spawning slightly more interesting (more rocks over distance, at 6000 there will be 75% rocks, early game there will be less then previous builds)</li><li>Make it run on android</li><li>Make it run on browser (failed, took me about 6 hours to fail)</li><li>Make pause screen (done)</li><li>Fix skybox</li><li>Fix occasional clipping glitches</li><li>Widen generated terrain and curve it up a bit</li><li>Add different pickups</li><li>Add powerups like head starts, invincible, turbo</li><li>Have the player keep the flowers and have it buy powers and extra lives with it</li><li>Moving enemies</li><li>Shooting enemies with stinger</li></ul>\n<p>Controls:</p>\n<p>Controls are easy, you can move sideways and fly a bit higher until the bar depletes, at which moment it needs to reach a certain treshhold again. WAD as well as arrow keys work and Space for flying works too.</p>\n<p>No touch screen support yet, so no mobile either.</p>\n<p>Update:</p>\n<p>Should be playable on MAC now, heard people getting around 40FPS.</p>\n<p>I really tried my best and sink in 6 hours to get it to work on web. Hopefully you have the time to download it to play. I could have added in something like powerups in those 6 hours unfortunately.</p><p>source:<br/></p><p>https://github.com/madmenyo/game-off-2021-beerunner<br/></p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T10:08:12", "background_image": "https://media.rawg.io/media/screenshots/a52/a52a124de00d4f3dac493d83ba2e2134.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MadMenyo"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}