{"id": 703754, "slug": "buggy-attack", "name": "Buggy Attack", "name_original": "Buggy Attack", "description": "<p>This is my game I make for the Game Off 2021. I'm using Godot 3.3.4 and Blender 2.93 for creating it. During developing, I had the idea of calling my game \"Buggy Attack\".</p>\n<p>This is my idea for the game:<br/></p>\r\nDue to a bug in a computer program, our main character, the insect, can get into the target computer. Before the malicious code which the insect brings with it can be executed, however, the insect has to make its way through a labyrinth (the computer's hard drive) and comes across passwords of the user lying around. These can be collected to optain points.<br/> Afterwards, the labyrinth is evaluated and points are counted.\r\n<p>For controlling the movement of the bug, press the following keys: <br/></p>\n<strong>Key</strong><strong>Action</strong>Left arrowRotate leftRight arrowRotate rightUp arrowMove forwardsDown arrowMove backwards\r\n<p>In the main level, press <em>escape</em> to open a pause menu for restarting the game or switching to the main menu.</p>\n<p><strong>Credits</strong><br/></p>\n\n<p>Textures by Polyhaven<br/> Labyrinth layout by Maze Generator<br/> Font (Poppins) from Google Fonts<br/> Music (SciFi Atmospheric Track) from ProductionCrate<br/> Sound effects (Coin 01) from ProductionCrate</p>\n<p>My repository: https://github.com/guemax/GameOff2021<br/></p>\n<p><strong>License</strong></p>\n<p>MIT License<br/></p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T10:43:00", "background_image": "https://media.rawg.io/media/screenshots/d34/d3479408d8bbd627d59f6a1b43392205.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["guemax"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}