{"id": 703840, "slug": "forsaken-hospital", "name": "Forsaken Hospital", "name_original": "Forsaken Hospital", "description": "Get Forsaken Hospital on google play\r\n\n\n\n\n<p>    In the 1980s a hospital was located in the north of Morocco, this horrific hospital was known for that doctors carried out illegal operations for their patients, from torture, selling body parts, fertilizing corpses, and all kinds of torture. When the government exposed these illegal events that took place in the hospital, it closed it forever in 1995. After 8 years, Richard Farroukh, a specialist in paranormal phenomena, decided to visit the hospital in Morocco after obtaining permission from the government, to record and document the environment around the hospital that had been abandoned for 8 years. But the hospital wasn't empty, when Richard arrived at the hospital, he found supernatural things going on, and the ghostly sounds of dead patients. After a period of searching, he finds that it is someone, a human who looks like a doctor, Richard tried to talk to him but found him trying to chase him, Richard tried to escape but the doctor caught him and imprisoned him in the operating room. Richard's goal has now changed from discovering the hospital to trying to escape from the mad doctor. Will he run away?</p>\n\n<ul><li><strong>Experience real survival horror</strong></li></ul>\n<p>    You are not a fighter - if you want to survive the horrors of the hospital, your only chance is to run...or hide</p>\n<ul><li><strong>Immersive Graphics</strong></li></ul>\n<p>    The high quality of mobile games is close to that of computers and consoles.</p>\n<ul><li><strong>Challenging puzzles</strong></li></ul>\n<p>    The game is a puzzle base that the player needs to solve to reach the goal of the \"escape\" game.</p>\n<ul><li><strong>Localization   </strong></li></ul>\n<p>  English, French, Arabic.</p>\n<p><strong>CONTROLS : </strong></p>\n<p>Move : ZSQD/WSAD</p>\n<p>Crouch : Left Ctrl</p>\n<p>Sprint  : Shift</p>\n<p>Interact : E</p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2021-12-03T11:09:00", "background_image": "https://media.rawg.io/media/screenshots/673/6735ec99d940c792aa3e3e2c7635dda2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Silest Studio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}