{"id": 704061, "slug": "vtm-domain", "name": "VTM: Domain", "name_original": "VTM: Domain", "description": "<p>In this world you are Kindred, a blood drinking creature of the night, and you must figure out how to maintain your existence. You do not want to just survive the night, but thrive by any means necessary. Though you are not alone in this endeavor; there are Kindred out there. Some are allies in your sect who align with your worldview, but most Kindred are competition for blood and power. Your goal is to claim territory however you can to create a Domain to rule over. With enough land and resources the other Kindred will learn just who controls this city, whether you are an up-and coming Baron or instated as the new Prince. Either way, you must use your wits, resources, and powers to ensure that you will rule this city before your opponent does.<br/><br/></p>\n<p>VTM: Domain is a two player local competitive multiplayer strategy board game. Each player takes a side, Anarch or Camarilla, and their goal it to gather enough territory in order to claim Elysium. With each territory you take you will gain stats to help you with this goal, though there are special spots that can give you an advantage... and create obstacles for your opponent. A match will take about 15 to 30 minutes. It is designed to be replayed with randomly selected scenarios and choices to make. We suggest that one person controls the game and stream it with their friends watching!<br/><br/></p>\n<p><strong>Credits</strong></p>\n<p>Game Designer: Liz Moran <br/>Designers: Ashley Buffington, Gabby Perretta<br/>Writer: Ashley Buffington, Liz Moran, Gabby Perretta<br/>Programmer: Gabby Perretta<br/>Artist: Liz Moran</p>\n<p><strong>Assets: </strong><br/>Paper texture by icon0.com from Pexels (link https://www.pexels.com/photo/white-crumpled-paper-479453/)<br/>Symbols and Fonts by White Wolf</p>\n<p><strong>Sound Effects:</strong><br/>Click by complex_waveform https://freesound.org/people/complex_waveform/sounds/213148/ (http://www.facebook.com/50UND)<br/>Gothic Church Bells by Aeonemi https://freesound.org/people/Aeonemi/sounds/180330/<br/>Floating Cities by Kevin MacLeod</p>\n<p>Link: https://incompetech.filmmusic.io/song/3765-floating-cities</p>\n<p>License: https://filmmusic.io/standard-license<br/></p>\n<p><strong>Special Thanks</strong></p>\n<p>White Wolf <br/>World of Darkness Team<br/>PurpleSweetness<br/>The Wraith<br/><br/></p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-12-03T12:11:55", "background_image": "https://media.rawg.io/media/screenshots/d43/d43710166bc760edd9ce5060c8027c5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ziggymia", "LostGhostGirl", "Guavart"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}