{"id": 704072, "slug": "vampire-the-masquerade-to-the-guilty-death", "name": "Vampire the Masquerade - To the Guilty, Death!", "name_original": "Vampire the Masquerade - To the Guilty, Death!", "description": "<p><strong>DESCRIPTION</strong></p>\n<p>\"To The Guilty, Death!\", is a Narrative RPG game where we will have snippets of dialogue that will be more based on the Visual Novel style and snippets of scenario exploration, battles and gameplay more based on a classic style of RPG games.</p>\n\n\n<p><strong>CHARACTERS<br/></strong></p>\n<p><strong>Sebastian \"MC Shango\" - Clan Tremere: </strong>Sebastian is a very charismatic man, but very hotheaded. Born in Halfeld City, he had a difficult childhood. He grew up amidst crime and domestic violence. He had a talent in music and used that talent to overcome all those problems and he soon became an recognized artist on the RAP scene. He is an erudite man, graduated in sociology and have a deep love for his family and his religion. He had the voice of the people, the influence and the fame that the Bahari Tremere Circle of Halfeld City wanted to spread the word of the Dark Mother. Because of his new accursed life, he had to divorce from his wife, otherwise, it would be a Masquerade Breach to continue to live amongst his family.</p>\n<p><strong>Emerald \"Teacher\" - Clan Gangrel:</strong> Emerald is a determined woman, unable to force herself to play the manipulative games of the Kindred. In life, Emerald taught Biology to children and pre-teens in 3 public schools and MMA in a gym, at night. One night when she was returning home, she found the door broken and ran as fast as she could, just to find her mother dead and a monster bitting her sister's neck. It was all over so fast... One minute she landed a punch to the monster's jaw, on the next, she passed out. When she woke up, she was no longer the same. When the police came and found the scene, they tried to arrest her for the murder of her mother and sister. She fled into the night. That's when Lua found her.</p>\n<p><strong>Bernard \"Trickster\" - Clan Ravnos:</strong> Bernard always dreamt of becoming a successful musician. However, his mother never supported his dream, so he left. 3 years have passed and he never talked to his mother again. When she passed out, Bernard's world collapsed. He had abandoned everything for his dream. He had lost everything to his dream. Since that day, he abbandoned music. He didn't know what to do with his life so he began to get involved with dangerous people. He was the perfect man for the Anarchs, he had nothing to lose, smart and had experience in doing shit. After a year fighting for the cause, he was done! So he stole a van and hit the road to Halfeld City. His Sire tried to stop him, so he killed her and took her soul.</p>\n<p><strong>Danube \"Bee\" - Clan Salubri:</strong> Danube is a brilliant young woman, but her fragile body faced a lot of struggle. From a very young age, she has been fascinated by technology. She was already prominent as an independent game developer and was well known in the developer communities. She had a bright future ahead of her. Everything changed when her father was suddenly arrested. She started to study Law to try to prove his innocense. After 5 months, she was diagnosed with Leukemia. She was going to die, and her dreams with her. One night, while she was crying in her bed, a man approached her. He touched her forehead and made a proposal: \"Would you accept a cursed life for a second chance?\" She was all in!</p>\n\n\n<p><strong>THE CITY AND IT'S POLITICS</strong></p>\n<p>Halfeld is a costal city, full of opportunities, both to Kindred or Kine. It has a modern/gothic vibe to it. The city had a Anarch Revolt back in 2008, were the former Prince was killed (so they say). The city was splited in 4 Turfs: Central Zone, North Zone, Docks Distric and the Sea Belt. Our story takes place on the Central, North and Docks Turfs and the characters are guided by Lua, the Baron of the Central Zone. The Barons in the city work as employers. They don't like to say that they own anything or are the leaders of anything. They are just employwer. If they got a job to do, they have a Coterie to contact and pass the Job. The payment. Boons. That's how the city has been working since the fall of the Tower.</p>\n\n\n<p><strong>THE PLOT</strong><br/></p>\n<p>The Chronicle acompanies a Vehme Coterie, called Blood Tears, that had the job to investigate a series of killings that have being drawing too much attention of the Media and the Second Inquisition to the Anarch city. Their lack of success have costed 6 lifes and a lot of troubles with the hunters. Will they be able to find the killer and stop this madness before the sun rises? We shall see!</p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-12-03T12:15:04", "background_image": "https://media.rawg.io/media/screenshots/ebc/ebc23dcf7cf3df375299a7358ea6bb5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["jean_jm"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}