{"id": 704134, "slug": "sea-madness", "name": "Sea Madness", "name_original": "Sea Madness", "description": "<strong>SEA MADNESS </strong>\n<p>Sea Madness is an online multiplayer game, where you're fighting against other players in a Trash-Collecting competition! Match with random people or challenge your friend and take this trash from sea already!</p>\n<p>This game was made for a #seajam, created by PolyMars in order to help Mr. Beast's #teamseas campain.</p>\n<p><strong>CONTROLS: </strong></p>\n<p>W,A,S,D - Boat controls</p>\n<p> ...and that's pretty much it!</p>\n<p><strong> RULES: </strong></p><p>You and your opponent have 60 seconds to take as much trash out of sea as you can! Trash has been scattered over the whole sea and using your boats, you can take them out. Remember: The more trash you're holding, the slower your boat will move. Once you have got enough trash, you have to go back to your base (area next to your spawn location), where trash will be taken from you. For every trash piece, you gain one point. At the end of match, all collected trash will be counted. Player who gained more points, wins! </p>\n<p><strong>CREDITS:</strong></p>\n<p> Game was made by: </p>\n<p>- Bitowsky (Code, Music) - Youtube, Reddit, Twitter, Discord</p>\n<p>- Ocelothe (Art, Testing, Translations, Additional Game Ideas) - Youtube Main and Second One, Twitter </p>\n<p>You can also join Studio's medias: Youtube, Twitter, Discord</p><p>Our E-mail: bitstudio.adres@gmail.com<br/></p>\n<p><strong>TROUBLES WITH CONNECTION? <em>TRY THESE SOLUTIONS!</em></strong></p>\n<p>1. <strong>Refresh page!</strong> Classic movement in an IT industry.</p>\n<p>2. <strong>Try another browser! </strong>Sorry, if you have to switch up to your least favorite browser!</p>\n<p>3. If you're trying to play with your friend -<strong> change positions with each other</strong>: let the second player join room first. At least you'll remember about good manners!</p>\n<p>4. If you have tried out every of these solutions, you can <strong>join our Discord Server</strong> <strong>to tell us about your connection troubles</strong>. Don't forget to be polite - developers are people as well!</p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-12-03T12:31:07", "background_image": "https://media.rawg.io/media/screenshots/5b1/5b1adb7a77f64061364421659305bbd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bit Studio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}