{"id": 704246, "slug": "prodigal-itch-hikezi", "name": "Prodigal (itch) (Hikezi)", "name_original": "Prodigal (itch) (Hikezi)", "description": "<p>After two years abroad, the prodigal childe of Tremere Elder Benedict finally returns.... but all is not well. Was this familiar mansion always so rotten? Was your daytime sleep always this troubled? Did these usual smiles always hide something? And why can't you remember anything about this 'trip' you're supposed to have gone on? \r\n</p>\n<p>The truth waits beyond your nightmares. </p>\n<p>Welcome home, Kolya.</p>\n<p><strong><em>This game was created as a part of Vampire: The Masquerade game jam. Events portrayed in this game are not canon within World of Darkness universe</em>.</strong><br/></p>\n\n<p><strong>Content Warnings:</strong><br/></p>\n<p>While this game is a work of fiction it deals in horror-based subject matter. Blood, gore, death, drug and alcohol use, significant self-harm, mental and physical abuse, and religious fanaticism are present.</p>\n\n<p><strong>How Do Thing:</strong></p>\n<p>- Click on items to interact with them. <br/>- Some items can be combined by grabbing them and 'using' them on the other item with a mouse. Most notably, the medicine can be combined with a few other items. <br/>- Kolya needs to drink before he sleeps. Use blood on the poor boy.<br/>- Benedict is picky about his choice of wine. Thankfully, you have a note to use as reference on them.<br/>- The silver key can be fidgety to take and put back. Just below where you find it is easiest.<br/>- Some sections of the house will remain locked throughout the course of the entire game. This is not a bug. <br/>- If things seem to stick to your cursor, right clicking can shake it off.<br/>- The only knife that matters is the one closest to your bed.<br/></p>\n<p>This game was completed in a limited timreframe - there may be glitches. If you notice any bugs, instability, or text errors, please let us know and we'll get them fixed as quickly as possible. <br/></p>\n\n<p>Thank you for playing Prodigal!</p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-12-03T13:00:22", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e0de6292a868b4564460b2ac81f813f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hikezi"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}