{"id": 704485, "slug": "vegas-crime-simulator-itch", "name": "Vegas Crime Simulator (itch)", "name_original": "Vegas Crime Simulator (itch)", "description": "<p><strong>The updated version of the free game has become more interesting and exciting. The game has a large open 3D world, beautiful 3D graphics and all the game mechanics necessary for this genre.<br/>The game in which there is a gangster confrontation is full of contrasts. The game offers interesting tasks, various fights with enemies and fun game mechanics.<br/><br/>In the game you will find various points of interest such as: a military base with a tank, an airfield with an airplane, a platform for performing tricks on cars and motorcycles, a spaceship, robots.<br/><br/>We offer you to dive into the harsh gangster world of Vegas. You will achieve success and glory in this world.<br/><br/>The gangster world is very dangerous it is ruled by injustice and lawlessness in it every man for himself. Your hero will have to be strong to succeed. These stone jungles do not forgive mistakes.<br/><br/>Your hero will be able to choose which side he will be on. You can be bad or good, the choice is yours. Try your hand at an exciting third-person gangster simulator.<br/><br/>Your hero will have to go from the bottom to the top and change his life abruptly. You will have to pass various quests to win respect and popularity in this city. You will have to steal cars and fight with various criminals.<br/><br/>You can customize your character, making it unique, for this purpose, the game has a clothing store. Clothing will allow your character to look not only stylish, but also give additional features. How your character will turn out is up to you. You can pump your character improving the skills you need, such as: endurance, strength, accuracy, driving vehicles, possession of various weapons. You can also give your hero unique abilities that will help you complete the game.<br/><br/>The game has a store of superhero items for this purpose.<br/>Magic rope - it will allow you to move like a superhero, it helps you quickly move around the city, get into the most protected places such as a military base or police station. You can use the rope to attract objects or enemies.<br/>Flight mode - this improvement gives your character to fly like a superhero.<br/>Landing - this superpower allows you to land from any height without damage, you can not be afraid to fall and die.<br/>Super landing-the hero's ability to land and deal damage to enemies.<br/>Super kick - this feature allows you to kick objects or enemies with great force. You can kick anything you want: cars, environment items, enemies. Climbing walls - this superpower allows you to move on vertical surfaces such as buildings.<br/>Robot skin - this costume allows the character to transform into a robot, this increases your stamina, armor, and life. This costume will help your hero become invincible in confrontations with enemies.<br/>Superhero skin - allows you to fully immerse yourself in the atmosphere of a superhero, but do not forget your main goals in the gangster world. Stylish superhero costume will give your character additional abilities such as flying and jumping.<br/><br/>The game features a large number of cars, in the car store you can choose for yourself transport for any purpose. In the store there are bright sports cars, they will allow your hero to move around the city with the wind and look cool. And if you need a more protected car, you can buy an armored SUV or a car with large wheels - this technique will allow you to drive anywhere and stay safe.<br/><br/>Also in the store there are cool motorcycles and a special car for the superhero. The superhero car has high characteristics in terms of speed strength and handling. We hope that you will spend time with interest in this free game and you will like it.</strong></p>\n<p><strong><em>Vegas Crime Simulator Is a made by Rock Indian Gaming Productions,Game Portal Amit 2.0,Amit Mishra AM</em></strong></p>\n<p><strong><em>Made In India  </em></strong></p>\n<p><strong><em>Edit by James Edwes</em></strong></p>\n<p><strong><em>Presents Rock Indian Gaming Producations, Amit Mishra AM</em></strong></p>\n<p><strong><em>PRODUCATIONS ROCK INDIAN GAMING PRODUCTIONS, AMIT MISHRA PRODUCTIONS  </em></strong></p>\n<p><strong><em>Producer Amit Mishra Khushi Mishra</em></strong></p>\n<p><strong><em>Support Email no. </em></strong></p>\n<p><strong><em>rockindiangamingproductions57@gmail.com</em></strong></p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-12-03T14:08:32", "background_image": "https://media.rawg.io/media/screenshots/8bc/8bc388e47e6e999a516fd97e46f87c1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android"], "developers": ["Rock Indian Gaming Productions PVT"], "genres": ["Action"], "publishers": [], "esrb_rating": null}