{"id": 704461, "slug": "flyeanor", "name": "Fly'eanor!!", "name_original": "Fly'eanor!!", "description": "<p>🇫🇷 Avertissement : Le moteur prend un moment à charger. <br/>🇬🇧 Warning : It takes a moment for the engine to load. <br/></p>\r\n\r\nSynopsis\r\n<p>🇫🇷 Oh non, l'humaine Catherine se retrouve à nouveau prise au piège dans la forêt magique ! Munis-toi du chat-sorcière le plus proche pour voler à son secours ! Ce jeu est inspiré de la scène p.75-84 du webcomic <em>Rainette</em>.<br/></p>\n<p>🇬🇧 Oh no, Catherine the human has yet again got trapped in the magic forest! Grab your nearest witch cat to fly to her rescue! This game was inspired from the scene p.75-84 of the webcomic <em>Rainette</em>.<br/></p>\n<p><em>Gdevelop 5, Clip studio, Musicca, Audacity.</em></p>\r\n\r\nRainette\r\nOfficial banner of the webcomic Rainette, by Biscuit.\r\n<p>🇫🇷 <em>\"Rainette est une adolescente ordinaire, qui va au lycée, a des amis, et comme bien d'autres ado de son âge manque \"un peu\" de confiance en elle. Sauf que Rainette est une sorcière, et bien que ses pouvoirs soient plutôt cool, la peau verte fournie avec est des plus embarrassantes.\"</em> (lancé en 2015, en cours) Lire sur Tapas<br/>→ LGBTQ+, fantastique, tranche de vie<br/></p>\n<p>🇬🇧 <em>\"Rainette is a typical teenager, who goes to high school, has friends, and like a lot of teens her age \"slightly\" lacks self-confidence. Except that Rainette is a witch, and even though magical powers are pretty cool, the green skin that comes with them is most embarrassing.\"</em> (started in 2015, ongoing) Read on Tapas<br/>→ LGBTQ+, fantasy, slice of life<br/></p>\r\n\r\nThe author\r\n\n<p>🇫🇷 <em>Rainette</em> est réalisé par Biscuit, artiste professionnelle depuis 2009 douée pour raconter des histoires, prof de dessin très investie et nouvellement parent. Vous pouvez la suivre sur twitter, tapas, twitch (parfois) et la soutenir sur patreon. Merci !<br/></p>\n<p>🇬🇧 <em>Rainette</em> is created by Biscuit, professional artist since 2009, talented storyteller, passionate art teacher and recently parent. You can follow her on twitter, tapas, twitch (sometimes) and support her on patreon. Thanks!<br/></p>\r\n\r\nMe\r\n<p>🇫🇷 Une amie de l'auteure. Je travaille de temps en temps sur Rainette comme assistante aux aplats depuis 2018. J'ai surtout fait ça pour m'amuser et lui faire une surprise.</p>\n<p>🇬🇧 A friend of the author. I've been helping on Rainette from time to time as a flatcolor assistant since 2018. I mostly made this for fun and to give her a nice surprise.<br/></p>", "metacritic": null, "released": "2021-11-29", "tba": false, "updated": "2021-12-03T14:01:25", "background_image": "https://media.rawg.io/media/screenshots/90a/90ab65170866af98529b9723e087e1a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RunaLlaria"], "genres": [], "publishers": [], "esrb_rating": null}