{"id": 704695, "slug": "iel-indo-european-languages", "name": "I.E.L: Indo European Languages", "name_original": "I.E.L: Indo European Languages", "description": "IEL: Indo European Languages are an 2d educational game that teaches you French, Italian, Spanish, Portuguese, German, Dutch, Danish, Norwegian and Swedish. Language Tutorials: basic phrases, vocabulary and Grammar in 20 Languages. The game has different categories in the game that help your communication skills.<br/>\n<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n-Each language in the game you learn the basics like basic phrases, alphabet, question words, numbers, days of the week, month of the year, seasons, directions, color and shapes, weather, time, family, animals and etc.<br/>\n<br/>\r\n- Each languages you learn about verbs, nouns, prefixes, adjectives, pronouns, pronunciation, adverbs, common words, negatives and many more.<br/>\n<br/>\r\n- Fluently translations that help your communication skills.<br/>\n<br/>\r\n- Amazing background that represent the each countries of the languages.<br/>\n<br/>\r\n- You can learn the landmarks, cities and culture in each countries that represents the languages in the museum. You can learn about Arc De Triomphe, Eiffel Tower, Chartres Cathedral, Colosseum, Leaning Tower of Pisa, Madrid, Paris, and many more cities and landmarks.<br/>\n<br/>\r\n- Play different types of mini-games that test your grasp of the structured lessons", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-09T21:42:45", "background_image": "https://media.rawg.io/media/screenshots/284/28462647066782a62f6ce16051995ec4.jpg", "website": "http://www.phantomgamesstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phantom Games Studio"], "genres": ["Simulation", "Casual"], "publishers": ["Phantom Games Studio"], "esrb_rating": null}