{"id": 70465, "slug": "solitaire-spiderette", "name": "Solitaire ▻ Spiderette +", "name_original": "Solitaire ▻ Spiderette +", "description": "Spiderette Solitaire is the #1 card games solitaire! Discover the next evolution of the classic spiderette solitaire with amazing graphics and ease of use. This is a card game like one you have never experienced before. No wonder this solitaire is rated so highly!<br/><br/>And, with our optional extra-large card symbols, squinting the eyes is a thing of the past!<br/><br/>Solitaire Spiderette it's similar to the classic spider solitaire but with a single deck of cards (52 cards) instead of two decks (104 cards) to create a faster game play yet still quite challenging, plus it's very easy to play while holding your iPhone or iPad upside with just one hand :)<br/><br/>With this solitaire game you get unlimited puzzle games, all free games, all best of class games, and we have added a Smart Point System and multiple levels of difficulty: Easy, Medium, Hard, and Expert :)<br/><br/>Spiderette Solitaire, along with Solitaire (Klondike), FreeCell Solitaire, Spider Solitaire, and Card Games solitaire, is part of our family of card games and puzzle games, all created with the same mix of passion for enjoyment, midnight oil, and deep technology skills to bring you the best solitaires… try the difference.<br/><br/>Check out our raving reviews... and look at our ratings!!!<br/><br/>Spiderette Solitaire makes it amazingly natural to control the cards movements and to feel in control: With tap-to-place, you simply tap the right card and it magically does the right move, or when you prefer you can also use our assisted drag-and-drop to move a card anywhere it creates a valid move.<br/><br/>With this solitaire card game you also get all the nice features you would expect from a first class card game, such as:<br/><br/>• unlimited number of free games<br/>• landscape and portrait card game play<br/>• optimized portrait gameplay<br/>• drag destination highlight<br/>• multiple moves hinting<br/>• automatic game save and resume<br/>• automatic card spacing<br/>• interface auto dimming<br/>• selectable rich features<br/>• independent volume settings<br/>• unlimited undos<br/>• tap to place cards<br/>• drag and drop cards<br/>• scores, moves, and times<br/>• statistics<br/>• awesome graphics and animations :)<br/>• show or hide time/battery<br/>• online games scoring<br/>• online achievements<br/>• … too many more to keep listing :)<br/><br/>Spiderette Solitaire is an iPhone game and an iPad game combined into one iOS app.  Your iPhone, iPod, or iPad automatically selects for you the iPhone app and iPad app.<br/><br/>Spiderette Solitaire is part of our family of card games and puzzle games, all created with the same mix of passion for enjoyment, midnight oil, and deep technology skills to bring you the best solitaires… try the difference!<br/><br/>The feeling of playing Solitaire is not just that of playing cards… it's the feeling of being part of a community… an enriching, shared experience that never makes you feel apart!", "metacritic": null, "released": "2016-10-15", "tba": false, "updated": "2019-07-29T13:03:02", "background_image": "https://media.rawg.io/media/screenshots/96e/96e7cdc5ae79ba9e164623476e8a5707.jpg", "website": "http://finger-arts.com/spiderettesolitaire", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Finger Arts"], "genres": ["Strategy", "Card"], "publishers": ["Finger Arts"], "esrb_rating": null}