{"id": 704733, "slug": "farlife-2", "name": "Farlife", "name_original": "Farlife", "description": "Farlife is a class based action RPG set in space. The game follows different alien species, each with unique movement and abilities. The player will complete missions and side quests in various open worlds and dungeons in order to gather new loot and resources to improve their loadout.<br/>\n<br/>\r\nWe plan to explore the strangeness of space and tell funny and whimsical stories with a unique geometric low poly art style. The game will feature physics based systems, from animations to the environments themselves.<br/>\n<br/>\r\nYou will join some little green men adrift through the cosmos, the slug people are here to explore the stars! <br/>\n<br/>\r\nTake control of a species know as a Slugnoid, a sleazy, slimy, and quite grotesque individual, and do as you're told! your mission is to journey through the stars. You will encounter aliens, robots, balls, and things from a whole other universe. Experience the strangeness of space through the eyes, and sometimes retractable optical tentacles, but beware of the dangers you may find out there. Unearth the mysteries of life itself, and fight through the hordes of the unliving. <br/>\n<br/>\r\nLoot a plethora of weapons, and upgrade them using the raw resources you acquired from your adventures. Explore open worlds, Discover alien life, tear a hole in the fabric of reality, and fumble your way through the cosmos.<br/>\n<br/>\r\nWill you delve into the chaos of space? <br/>\n<br/>\r\nWelcome to Farlife!", "metacritic": null, "released": "2021-12-09", "tba": false, "updated": "2021-12-10T02:36:01", "background_image": "https://media.rawg.io/media/screenshots/761/7614fbe14f64bc8c03281b4862713e42.jpg", "website": "https://www.omniplay.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 405, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Omniplay Games"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Omniplay Games"], "esrb_rating": null}