{"id": 704745, "slug": "another-day-in-paradise", "name": "Another Day in Paradise", "name_original": "Another Day in Paradise", "description": "<p>Play with 5 characters, find the clues and reveal the mystery of that October 24th.<br />\nYou will explore the places and survive terrifying rituals, the astral world is waiting for you.<br />\nA story that mixes adventure and terror in equal parts.<br />\nTHE GAME<br />\nIn &quot;Another Day in Paradise&quot; you will find a third-person adventure where you will play with 5 characters to uncovering the mysterious events that took place that October 24th. For this you will have to explore the different places and collect the clues and valuable objects, which will help you to continue advancing in the story. You will obtain information through the cinematic sequences, the collectible audios in the form of cassettes and the notes (which you can access from your inventory).<br />\nTHREE GAME SYSTEMS<br />\nThe game system is developed in three sections, depending on the moment in which the events take place: In &quot;Past&quot; you will play with a more linear game system, with well-defined objectives and with abundant cinematic scenes ; in &quot;Present&quot; the system becomes more open and you will be able to explore with total freedom and add the survival factor; finally in &quot;Future&quot; we will see through a monitor, fragments that will reveal the final mystery about what happened that October 24th. These fragments will be collected throughout the game and are vital to understand the story.<br />\nIRREVERSIBLE DECISIONS<br />\nDuring certain points of the game we can decide between several options. These decisions will be irreversible in the short term and we will need to repeat the entire level to change them. It will depend on whether or not you find some of the valuable objects.<br />\nINNOVATIVE LEVEL OF DIFFICULTY<br />\nThe difficulty is present in an innovative way during the levels of the &quot;Present&quot; section. We found three levels, labeled &quot;Easy&quot;, &quot;Medium&quot;, and &quot;Hard&quot; respectively. This means that you must play all of them (it is recommended sequentially way) if we want to complete the story.</p>", "metacritic": null, "released": "2021-12-06", "tba": false, "updated": "2021-12-15T13:28:56", "background_image": "https://media.rawg.io/media/screenshots/b6d/b6d07912585316b99a346308e9728d5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thunder Road Game Studios"], "genres": ["Adventure", "Educational"], "publishers": ["Thunder Road Game Studios"], "esrb_rating": null}