{"id": 704823, "slug": "barrilete-cosmico", "name": "Barrilete Cosmico", "name_original": "Barrilete Cosmico", "description": "<p><strong>Dimitree Challenge</strong> es un juego hecho en menos de una semana para la <strong>HACKA ENTEL GAMING 2021</strong>. Buscamos integrar la imagen de la marca con elementos que el jugador pueda reconocer y con una mecánica  a la cual el jugad@r está acostumbrada: <strong>escribir</strong> (lo hacemos en todo momento para trabajar, comunicarnos o entretenernos en las redes sociales).</p>\n<p>Esta versión esta pensada para jugar desde una computadora o laptop, pero para la comunidad de los jugador@s en celular construimos una versión alternativa que puedes probar<strong> AQUI EN ESTE ENLACE</strong>.</p>\n\n<p><strong>Dimitree Challenge</strong> es un <strong><em>typing-game</em></strong> en español en el cual necesitas escribir correctamente las palabras para poder seguir avanzando, pero cuidado, algunas palabras pueden llegar a ser complicadas, y necesitaras ser cada vez más veloz ya que las plataformas irán desapareciendo cada vez más rápido.</p>\n<p>Ganas vida al escribir correctamente la palabra, pero pierdes una vida por cada letra que escribes incorrectamente. Si se te acaban las vidas o el tiempo para escribir la palabra es un <strong> game over</strong>.</p>\n<p>Integramos un<strong> score</strong> y un <strong>sistema de puntos</strong> que se quedaran guardados, así que no te preocupes de perderlos, con tus puntos acumulados podrás reclamar premios (claro que estos son ficticios, pero sentirás la sensación de satisfacción de poder reclamar algo imaginario por tu esfuerzo.)</p>\n\n<p>Para la temática incorporamos un personaje de Entel querido y carismático llamado <strong>Dimetree </strong>(creemos que cae perfecto con cualquier temporada, pero en especial es estas fechas). Y un arte con el <em>feeling </em>de como si fuera un <strong><em>sketch</em></strong>.</p>\n\n<p><em>Keyboard:</em> Presiona la letra correspondiente, para escribir la palabra correctamente.<br/></p>", "metacritic": null, "released": "2021-12-05", "tba": false, "updated": "2021-12-10T09:07:56", "background_image": "https://media.rawg.io/media/screenshots/3e6/3e64699182c305599efbc59f8ef89a44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kay Pacha", "berdyx", "byebyesama", "PabloTamariz"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}