{"id": 704939, "slug": "piano-game", "name": "Piano Game", "name_original": "Piano Game", "description": "<p>A piano roll midi game, for practice or just for fun watching.<br/></p>\n<p>=== About<br/>A Midi keyboard/Synth is needed to play along.</p>\n<p>PS; How the program sounds will depend on what MIDI synthesizer you got installed on your computer. Windows operating systems come with a default called \"<em>Microsoft GS Wavetable Synth</em>\".</p>\n<p>Unless you are an <strong>advanced user</strong>, it's advised to not mess around with the midi drivers. But if you want the same sound that's in the demo, you will have to install something called ViritualMIDISynth and use the soundfont called FluidR3_GM. Observe that it might be tricky to get your \"<em>Microsoft GS Wavetable Synth\"</em> back to normal if you make changes to your default system midi synth.<br/></p>\n<p>=== Future</p>\n<ul><li>I might implement some kind of keyboard input.</li><li>Donations will encourage maintenance and improvements,<br/>but don't feel obliged to donate.</li></ul>\n<p>=== Backstory<br/>I found a 10 year old MIT-Licensed piano roll playing project at github (originated from SourceForge) that didn't compile properly. After having fixed the compile issues I managed to build and decided to share the .exe here over at itch.io<br/><br/>The program is of very nice quality, so I decided to maintain it. Forward any issues and or suggestions to me and I might see if we can do anything about it.</p>\n<p>You may also fork my fixed version of this repo: https://github.com/VictorieeMan/PianoGame_Compilable</p>\n<p>=== Credit</p>\n<p>Credit to the original developers over at SourceForge, especially Nicholas Piegdon who managed the repository under a MIT-license available in the download folder containing the .exe file. Their last modification of the code was in 2012-05-04, I updated it this year 2021 to make it compilable again.<br/></p>", "metacritic": null, "released": "2021-12-05", "tba": false, "updated": "2021-12-10T09:35:58", "background_image": "https://media.rawg.io/media/screenshots/346/346135ee1bd5b873d039f795c394f8ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Victoriee Man"], "genres": [], "publishers": [], "esrb_rating": null}