{"id": 705056, "slug": "letters-against-loneliness", "name": "Letters against Loneliness", "name_original": "Letters against Loneliness", "description": "<p>Internet has disappeared. But the human need to socialize and relate has not. <br/></p>\n<p><strong>Letters against Loneliness</strong> has one lonely rule and uses it for 100 simple, small, but captivating puzzles.</p>\n\r\nGameplay\r\n<p><strong>Objective?</strong> Send a letter to each person in the puzzle.</p>\n<p><strong>How?</strong> Each move, you tap a single location to place a post office.<br/></p>\n<p><strong>And then?</strong> A letter is sent between the <em>new post office</em> and any <em>other post offices on the same line</em>. <br/></p>\n<p>(Letters make people happy, very happy, so they run off from the puzzle to dance. Or something. They just disappear.)</p>\n\r\nPuzzles\r\n<p>The game has roughly 100 puzzles, divided into \"worlds\". <br/></p>\n<p>Each world introduces one new element (a new person, a new tile, anything) to gradually teach the game and increase complexity.</p>\n<p>The simple objective and simple rule stay the same <em>for the whole game</em>, making it accessible to anyone. </p>\n<p>But once people with specific wishes appear, and the terrain turns into mountains, forests and buildings, finding the solution requires quite the Eureka.</p>\n\r\nQuite the journey\r\n<p>This game made quite the journey to get here.<br/></p>\n<p>The core rule (\"when you place something new, it sends something to all older towers on the same line\") was actually invented 10 years earlier. But I was a newbie developer then and couldn't really make it.</p>\n<p>Still impressed by the strength of this single rule, I decided to make it into <em>the best puzzle game ever</em> 10 years later. <br/></p>\n<p>I had planned this huge <em>story</em> for the game. (Which I also planned to draw and release as a picture book in my home country, the Netherlands.)<br/></p>\n<p>I had planned about twice as many mechanics (new people, new tiles, new rules to switch it up) as ended up in the game.</p>\n<p>But ... life got in the way again. I had to finish my bachelor studies and shelved the project for the month or so that I needed. And you know how this goes: once my life could resume, there were other ideas tugging at me, so I forgot about the game.</p>\n<p>One year later, I had lost the To-Do list. <br/></p>\n<p>Long story short: I spent weeks moving projects to hard drives, backing them up, structuring my body of work - and made one tiny mistake when I forgot that detailed to-do lists for some projects where stored on GitLab, not GitHub. (Really reinforces the need for this reorganization, I thought :p)</p>\n<p>Therefore, all I could do was finish the current game (fix last bugs, integrate ads on mobile, add proper UI instead of placeholders) and release that.<br/></p>\n<p>Why am I telling this? Because I think it's interesting.  Because it explains why this game is significantly smaller and less marketed than my recent games: it's actually two years old.<br/></p>\n<p>But mostly because it's the sort of thing I'd write in a letter to my pen pal. And I encourage you to find your own pen pal as well, and start sending some letters against loneliness :)<br/></p>\n\r\nFun facts\r\n<p>Another reason I couldn't improve the game further, was because it's made with a game engine I don't use anymore (and haven't in years), called Solar2D.</p>\n<p>Why? Well, if you look at the trailer for this game, you might notice the mouse cursor showing up at the start. You might also notice that the footage is sometimes a bit laggy/inconsistent with animation. (This isn't the case in the game itself. ) I had to throw out 50% of my recordings because it just <em>somehow</em> showed <em>the wrong thing</em>.</p>\n<p>No matter how many recording setups I tried, none of them could record this game correctly! The game engine I used just had too many weird bugs like that for professional use. (The exact same recording setup has not failed once on <em>any other game ever</em>.)</p>\n<p>Another fun fact: this was my first try at pixel art, which I think went relatively well, although it's not <em>beautiful</em> and in some places <em>really inconsistent</em>. But alas, don't have the original files anymore, can't change it!<br/></p>\n<p>Last fun fact: Solar2D (the game engine used) also doesn't fully package games, which means downloading this game gives you unrestricted access to literally all the assets, audio, etcetera. Have fun with that!</p>", "metacritic": null, "released": "2021-12-05", "tba": false, "updated": "2021-12-10T10:06:48", "background_image": "https://media.rawg.io/media/screenshots/ec8/ec8e5ca9d7b98d88c6589dfc8b6f1029.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pandaqi"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}