{"id": 70521, "slug": "addictive-dice-classic-dice-roller", "name": "Addictive Dice - Classic Dice Roller", "name_original": "Addictive Dice - Classic Dice Roller", "description": "Addictive Dice is a version of the traditional Yahtzee dice game.<br/>Some of our reviews:<br/>- \"Officially one of the best dice games ever\"<br/>- \"One of the best I've ever seen on Apple devices.”<br/>- \"This is the one. I looked at all of them and this has it all -- great interface, official scoring, regular updates. Get it.\"<br/>- \"Love it! Brilliant version of the classic dice game.\"<br/>- \"This is a top 25 dice poker game\"<br/><br/>Love classic Yahtzee and other dice games? This free dice game makes it easy to play on the go.<br/>Play against yourself, against friends locally or against the COM player for hours of fun.<br/>Dice roll and Yahtzee! sounds<br/>- Simple interface<br/>- iPhone and iPad playing views optimized! <br/>- Touch the dice you want to keep<br/>- Touch the score you want to apply the turn to<br/><br/>A game of Addictive Dice consists of 13 rounds. In each round, you roll the dice and score the result in one of 13 categories.You must score exactly once in each category, so skill and judgment are required as the game progresses and your options start to run out. The aim of the game is to make the biggest score you can from the 13 rounds.<br/><br/>SCORING:<br/>After each roll, all valid scores are highlighted in yellow so you can quickly decide where to apply the results. Where you place the score from each roll is up to you. There are thirteen turns of 3 rolls each per game. After each roll you can choose which dice to keep by touching them, then the remainder will be included in the next roll. At the end of the 3 rolls, you must assign the score before you can move on to the next turn. The first Yatzee is worth 50 points and each subsequent Yatzee will be rewarded with a 100 point bonus. If you score 63 or greater on the left side of the score card, you will get a 35 point bonus.<br/><br/>We love our fans! Please let us what other features you want, the responses have been great!<br/>https://www.facebook.com/MangoKingStudios", "metacritic": null, "released": "2014-04-26", "tba": false, "updated": "2019-10-22T14:01:32", "background_image": "https://media.rawg.io/media/screenshots/076/076071f858d2bf840649619008f7303a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Shawn Mottley"], "genres": ["Board Games"], "publishers": ["Shawn Mottley"], "esrb_rating": "Everyone 10+"}