{"id": 70531, "slug": "addictive-mahjong-emoji", "name": "Addictive Mahjong Emoji", "name_original": "Addictive Mahjong Emoji", "description": "We hear the awesome comments and reviews. Thank you!! Update is here with more features you asked for, continue to give us your feedback!<br/><br/>Chart Topping Addictive Mahjong Emoji on IOS all Devices including iPad view!!!<br/>Test your skills on the hottest Mahjong game!!<br/><br/> \"Addictive Mahjong Emoji is proof that there’s still room in the market for a great match adventure\" - (4.5/5 Stars) <br/><br/>For the newbies:<br/>Mahjong is a free solitaire matching game which uses a set of Mahjong tiles. <br/>The goal of this pyramid game is to match open pairs of identical tiles and remove them from the board, exposing the tiles under them for play. <br/>You will be challenged to eliminate all pieces from the board.<br/><br/>Mahjong Keeps Your Mind Sharp<br/><br/>Mahjong is a mentally stimulating game that requires you to use multiple parts of your brain, with logic, risk-management, quick decision-making, pattern recognition and problem solving. A game of mahjong is an excellent mental workout. <br/><br/>\"Regardless of frequency of playing, mahjong produced consistent gains across all cognitive performance measures – digit forward memory, verbal memory, and MMSE. The effects lasted after mahjong had been withdrawn for a month, suggesting that constant practice is not necessary to achieve therapeutic effect once an initial threshold is attained.\" – International Journal of Geriatric Psychiatry<br/><br/>Like us! https://www.facebook.com/MangoKingStudios<br/><br/>We are a independent gaming studio and we love our fans.", "metacritic": null, "released": "2014-05-16", "tba": false, "updated": "2019-10-22T14:26:17", "background_image": "https://media.rawg.io/media/screenshots/d6e/d6e2e702cc084a88a2a64f8111b577da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shawn Mottley"], "genres": ["Board Games"], "publishers": ["Shawn Mottley"], "esrb_rating": "Everyone 10+"}