{"id": 70538, "slug": "new-freecell-solitaire", "name": "New FreeCell Solitaire", "name_original": "New FreeCell Solitaire", "description": "FreeCell is one of the enormously popular solitaire games that requires skill and patience to win! This is a card game with amazing graphics and ease of use to bring you the best card game experience ever. With this solitaire card game you get all the nice features you would expect. <br/><br/>[ FEATURES ] <br/><br/>+ 1,000,000 puzzles totally! One puzzle one day, it accompanies you all your life. <br/>+ Innovative 1 vs 1 mode on one device. You can start a match with your family and friends to finish a puzzle. <br/>+ More board styles and poker styles. <br/>+ Detailed statistics of game status. <br/>+ Game center support, competition with players all over the world to finish the puzzles as more as possible. <br/>+ Unlimited undo. <br/>+ Auto complete to finish game. <br/>+ Cards placement hints. <br/><br/>[ RULES ] <br/><br/>To win the game, all cards must be arranged over the four foundation piles (the slots marked with A at the top of the screen) in four sequences of same suit from A-K. <br/><br/>+ Cards can be moved from tableau to tableau (the eight piles of cards on the screen). <br/>+ Cards can be moved either as top card alone, or as an alternating-color sequence (e.g. Q-J-10). <br/>+ A card can also be moved to an empty cell (the four slots on the top-right side of the screen) or to a foundation pile. A cell may contain only one card. <br/>+ The longest sequence of cards you can move during a single operation is equal to the number of empty cells plus one. However, this number doubles for every empty tableau available (notice though that when moving the cards to an empty tableau, then that tableau is not counted). The reason is that an empty tableau acts like an extra empty cell, yet it can add multiple cards on it.", "metacritic": null, "released": "2013-07-12", "tba": false, "updated": "2019-10-22T14:01:33", "background_image": "https://media.rawg.io/media/screenshots/11b/11b5d13dfb8e0af3a7d2dc323ba73701.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zhiwei Lai"], "genres": ["Card"], "publishers": ["Zhiwei Lai"], "esrb_rating": "Everyone 10+"}