{"id": 7055, "slug": "legions-of-steel", "name": "Legions of Steel", "name_original": "Legions of Steel", "description": "The Empire of the Machines is threatening the entire universe. The League of Aliens and the U.N.E. (United Nations of Earth) have banded together to defend the galaxy from the invader. Battles are raging everywhere, but it is inside the twisting corridors of the Machines underground production facilities, that the tactical upper hand is taken. And the war is won.<br/><br/>Originally designed by Clark Browning, Marco Pecota and Derrick Villeneuve, Legions of Steel is a tactical board game where players fight battles in a dark and dangerous environment. French Developer Studio Nyx have managed to re-create the deep and challenging set of rules, while adding slick 3D models, a clever and accessible UI and a load of new features.<br/><br/><strong>Turn-based tactical firefights</strong><br/><br/>Each unit has its own skills and characteristics. It comes with its own set of weapons and abilities making the game deep and complex for experienced players, yet simple and approachable for novices.<br/><br/><strong>Electronic Warfare (Fog of War)</strong><br/><br/>A game mode on its own, Electronic Warfare is an option players decide to activate and which completely changes the game into a whole different experience. All maps are playable in Electronic Ware mode<br/><br/><strong>Tactical Options</strong><br/><br/>Players can choose from a host of available firing options<br/>The Advanced Covering Fire options allow for very precise control on what your units do during opponent’s turn<br/>Grenades! Used to unlock gridlocked situations, players can throw them around corners without getting exposed. These are also used by the Machines to create smoke cover<br/>Leadership points are a very limited resource used to “break” the common rules. Players will use them to add more actions (movement, fire), increase the odds when firing, or even dodge bullets during opponent’s turn.<br/><br/><br/><br/><strong>Initiative Roll</strong><br/><br/>Each map calls for an initiative roll at the beginning of the turn. Leadership can be spent to influence the roll. The winner of the roll chooses who starts to play the turn. This system breaks the linearity of turn-by-turn games. Which player is going first is always unknown.<br/><br/><strong>Suspense above all</strong><br/><br/>Radar detection and echoes add suspense to the gameplay. Every move is a thrill<br/><br/><strong>More numbers!</strong><br/><br/>2 playable factions with their own units and equipment<br/>2 Single player campaigns in an immersive setting<br/>15 scenarios for single player or multiplayer<br/><br/><strong>Multiplayer</strong><br/><br/>Play with friends online through asynchronous, cross-platform multiplayer using Slitherine’s PBEM++ server or offline using familiar hotseat mode<br/><br/><strong>Tournament system</strong><br/>This important feature works on the base of the Swiss System Tournament  which uses a <strong>non-elimination format.</strong> It is very flexible and dynamic at the same time, allowing for a more challenging experience and it improves the general competitiveness.", "metacritic": 64, "released": "2015-07-16", "tba": false, "updated": "2019-10-22T14:29:09", "background_image": "https://media.rawg.io/media/screenshots/f81/f81136637967ae8163c7da76a4cc67c2.jpeg", "website": "http://www.slitherine.com/games/los_pc", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 43}, "playtime": 1, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS", "Android"], "developers": ["Slitherine Software", "Studio Nyx"], "genres": ["Strategy", "Board Games"], "publishers": ["Slitherine"], "esrb_rating": null}