{"id": 705618, "slug": "champion-of-nature", "name": "Champion of Nature", "name_original": "Champion of Nature", "description": "<p>After centuries of nepotism and inequality, the Council of Mages has reached a daunting conclusion: Mages aren't worth anything these days. The rampant corruption and injustice of the current indication system not only guarantees that the spoiled sons and daughters of the nobility, who have no magical talent and no desire to work hard, fill up spots in the Academy of Magic, but it also deprives truly talented people from getting a magical education simply because they were born on the wrong side of the castle walls or in the wrong part of town. This has caused the latest generations of mages to be less and less competent, and more and more entitled, which in turn has drastically reduced the prestige of the Council and mages in general in society.</p>\n<p>Seeking to correct this injustice, and regain their fame, the Council decided to take a different approach: Every three years, when a new class is to be admitted to the Academy, a tournament shall be held. This tournament, dubbed \"Champion of Nature\", will decide who enters and who doesn't enter the Academy. <br/></p>\n<p>The tournament is simple: Each contestant is taught a basic spell, <strong>Eldritch Edge</strong>, which is already in itself part of the test. This spell allows the user to summon a blade of pure mystical energy. Those who are unable to summon the blade are deemed not talented enough and cannot proceed.</p>\n\n<p>Those who manage to summon the blade are then given a choice: They must choose two out of the four Elemental Bracelets. Each bracelet will give them the ability to cast one spell, and each bracelet is coded to one element: <strong>Ignis</strong>, the fire bracelet;<strong> Ventus</strong>, the wind bracelet; <strong>Aqua</strong>, the water bracelet; and <strong>Terra</strong>, the earth bracelet.</p>\n\n<p>The contestants are then transported to The Tower: a dungeon which they must reach the end of, if they want to learn magic. Anyone who reaches the top of the Tower is granted a spot in the Academy. There is only one problem: this cruel dungeon is filled with elementals whose only objective is killing all humans. </p>\n<p>You are one such human. You have answered the call, you have mastered the Edge, and now you must face all forces of nature and emerge victorious. More than victourious, you must emerge a true Champion.</p>\n<p>Embody the Quickness of Water with Aquaslide, a dash, the Sturdiness of Stone with a Stoneshield, the Destructiveness of Fire with Firedart, a ranged attack, and the Maneuvarability of Air with Windstep, a double jump.</p>\n<p>Face 10 different enemies - each with a different mechanic.</p>\n\n<p>If you dare, face the Tower Guardian - an elemental creature that holds command over all 4 elements.<br/><br/>Will you perish like a dog? Or will you fight and embrace Nature, in order to become its Champion?</p>", "metacritic": null, "released": "2021-12-03", "tba": false, "updated": "2021-12-10T12:22:22", "background_image": "https://media.rawg.io/media/screenshots/69a/69ac31e39b2f7ac470ec3fd602c8f384.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["juliafrare", "Dennis Lemke Green", "Lucasyoy", "Diogo_CE", "JayroBoy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}