{"id": 705654, "slug": "yui-tui-itch", "name": "Yui Tui (itch)", "name_original": "Yui Tui (itch)", "description": "<p><strong>Yui Tui</strong> is a 2D Platform Action game where Yako, the protector of the island, has been assigned to eliminate the enemies who infiltrated the island with an intention of ruling over it. <br/></p>\n\n<p>During the 1500s, Yui Tui was an island rich in resources and was one of the most beautiful places in the world. During that time, the Kazkova, the notorious group, had attempted to infiltrate the island but failed due to the presence of the then protector of the island, Reko. After he retired from the role, his position was taken over by Yako who was the new protector of the island. The enemies made another attempt but this time, they successfully infiltrated the island. They captured one of the most important strategic places of the island including the famous cave and the secret military bases. The weapons present in the bases fell into the hands of the group. </p>\n<p>The Government of Yui Tui island commanded Yako to eliminate Kazkova group at once and recapture the bases and the cave. Yako decided to stop them at any cost and started his journey with an aim of recapturing the cave and the lost bases.</p>\n<p>You play as Yako, the protector of the Yui Tui island. Will you be able to protect the island from being taken over by the Kazkova group? The fate of the island is in your hands now.</p>\n\n<p><strong>Key Features:</strong><br/></p>\n<ul><li>18 levels to play!</li><li>6 Lives to begin with!</li><li>The various kinds of enemies including the Bird Monster!</li><li>Different kinds of weapons like pistol, rotating blades and dynamites!</li><li>Lots of deadly traps and obstacles!</li><li>Collect items like coins, ammo, lives etc.</li><li>Difficult situations and hard to master!</li></ul>", "metacritic": null, "released": "2021-12-03", "tba": false, "updated": "2021-12-10T12:29:55", "background_image": "https://media.rawg.io/media/screenshots/293/293cbb423f84ccbac6eab1cfd0f0ecba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["AMAXANG GAMES"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}