{"id": 70577, "slug": "money-hot-skillz-win-real-money-prizes", "name": "Money $hot Skillz: Win Real Money & Prizes", "name_original": "Money $hot Skillz: Win Real Money & Prizes", "description": "Aim, Shoot and Reload! Your phone is your gun in Money $hot™ a first person shooting range simulation game involving competitive shooting eSports tests of proficiency (accuracy and speed). Practice your shooting skills for fun, challenge friends or compete against opponents from all around the world! Players can compete to win REAL MONEY &amp; PRIZES where eligible!*<br/><br/>Experience the thrill and excitement of competitive shooting with Skillz, a competition eSports platform complete with leaderboards, trophies, cash or virtual currency prizes, and an amazing loyalty program that rewards you just for playing!<br/><br/>Games take no longer than a minute and are ideal to play throughout your day for some quick fun. Not a good shot? Think you're a marksman? Whether you're a beginner or an expert sharpshooter, there are multiple simulated shooting ranges, moving targets and hostage rescue scenario targets to select from, allowing players to practice their target shooting strategy and sharpen their skills. Test your skills in competition and see if you really are a marksman or just an amateur.<br/><br/>Play against the clock and work on your accuracy with the best competitive pistol shooting game on the App Store. <br/><br/>In order to win competitive matches you need fast reflexes and precision shooting skills! Download for free now and discover if you have what it takes to become the best of the best?<br/><br/>FEATURES<br/>• Opportunity to win REAL MONEY &amp; PRIZES where eligible!*<br/>• Skill-based gameplay! Anyone can be fast, but it’s accuracy that counts. <br/>• Realistic \"your-phone-is-your-gun\" aiming, shooting, and reloading actions. FPS point of view, uses gyroscope and accelerometer for unique gameplay experience!<br/>• Free to play!<br/>• Weekly leagues with prizes!<br/>• Fast and fun to play shooting competitions! Score as many points as you can by shooting targets with precision and speed!<br/>• 1-3 minute head to head matches or multiplayer tournaments - perfect for passing time!<br/>• Skillz competitions enable players to challenge friends or compete against opponents from around the world!<br/>• Competitive matches can be played head to head with other players or in large multiplayer tournaments.<br/>*REAL CASH $$$ enabled head to head matches and tournaments powered by the Skillz platform (www.skillz.com) are only available in the USA<br/>*Cash tournaments are not enabled in the following states: AZ, AR, CT, DE, FL, IL, LA, MD, MT, SC, SD, and TN. If you don't live in a cash-enabled region, you can still play in multiplayer competitions with free virtual currency.<br/>*Virtual currency and prizes are available for all eligible countries!<br/><br/>TICKETZ LOYALTY PROGRAM <br/>Ticketz is your loyalty program for Skillz, collect Ticketz towards rewards just for playing! Win or lose, you earn Ticketz for every match you complete. Save up your Ticketz and trade them in for awesome prizes, like Skillz Bonus Cash, Gift Cards, Vacations, a Jet-Ski or even a Porsche Boxster! <br/><br/>CASH TOURNAMENTS (powered by Skillz)<br/>How much money can you earn? Think BIG. Individual players have earned over $100,000 each on the Skillz platform. That could be you next! Skillz is paying out over $500,000 in winnings every week! <br/><br/>Invite friends and get $10.00 in Bonus Cash for each friend who makes a deposit with Skillz.<br/><br/> For more information visit: skillz.com/faq<br/><br/>Skillz: eSports for Everyone!", "metacritic": null, "released": "2017-08-10", "tba": false, "updated": "2019-10-22T14:26:17", "background_image": "https://media.rawg.io/media/screenshots/407/407c183479ea76a9c7f1f268916bcda1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Grand Prize Network"], "genres": ["RPG", "Simulation", "Sports"], "publishers": ["Grand Prize Network"], "esrb_rating": "Mature"}