{"id": 705840, "slug": "island-boy", "name": "Island Boy!", "name_original": "Island Boy!", "description": "<p><strong>Creator: Justin Alagon</strong></p>\n<p>Wake up on the shores of a forgotten island of the world. Explore a brave new world cut off from society.  Assemble your shelter, forge the strongest tools, slay the biggest monster. Do whatever it takes to survive the most mysterious environment on the planet!</p>\n<p>For my final project I made my own little top down 2d survival game. You start out on the shores of my custom terraformed Island. Next to you there are some shelter ruins and a crafting table. Feel free to explore your surroundings, take a swim, find some treasure, gather resources, and use the crafting table to make some tools. All the pixel art, tiles, tile maps, and animations are done by me. Unity tools, addons, sounds, and other programs used are listed at the bottom of the page in case you are interested. </p>\n<p><strong>Game Tutorial: </strong><strong>I don't have an in-game tutorial built in so you can refer to this if you don't know what to do. </strong></p>\n<p>- Use WASD to move</p>\n<p>- You are able to use an action in all cardinal directions by left clicking in that direction (think of Stardew Valley)</p>\n<p>- You are able to click and drag items in your hotbar/inventory to rearrange as you please.</p>\n<p>- Your actions are bounded by your energy meter.</p>\n<p>- Hold left shit to run.</p>\n<p>- Select the item on your hot bar and right click on structures/objects you find in the world to \"use\" the item on it. Don't  have to select the resource when crafting.\r\n</p>\n<p>- You need to be close to the crafting table to open the menu.</p>\n<p>- You are able to punch down trees to collect wood but you can not break down stone without a pickaxe so please don't waste your time.</p>\n<p>- Yes you can punch the crabs but they do punch back.</p>\n<p><strong>Final Thoughts:</strong></p>\n<p>I didn't get to add all the features I wanted so sorry if there isn't too much content. Looking back on it,  my Design Document was very very ambitious for a solo developer given the time frame. This is my first game ever on Unity and C# so there was a lot to learn and I learned a lot. Hope you guys think it's cool. QA reports are welcome.</p>\n<p><strong>Resources Used:</strong></p>\n<p>Pixel Art/Animations -  Aseprite (steam)</p>\n<p>Unity  addons: Cinemachine, 2D  tilemap extras, and  NavMesh 2D</p>\n<p>Cover Image - Paint Tool SAI ver.2</p>\n<p>Sounds:  https://www.fesliyanstudios.com/</p>", "metacritic": null, "released": "2021-12-03", "tba": false, "updated": "2021-12-10T13:21:33", "background_image": "https://media.rawg.io/media/screenshots/90d/90d10f554d1b57c59511aa9947ba271c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Jalagon"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}