{"id": 705999, "slug": "kais-wild-adventure", "name": "Kai's Wild Adventure", "name_original": "Kai's Wild Adventure", "description": "<p>Controls-\r\n</p>\n<p>Move - WASD \r\n</p>\n<p>interact with the signs and treasure - walk behind the objects.\r\n</p>\n<p>Overworld Map-\r\n</p>\n<p>In the Overworld map you can move around Mystery Island. Mystery Island has 3 different sections: GrassLand Area, Desert, and Cave. There are also special areas of the different sections of Mystery Island (Tall Grass in the Grassland Section, Red Sand in the Desert, and Bright Sand in the Cave), where you can have a chance to encounter and battle the enemies. When you walk in those special areas, you move slower and you randomly encounter battles.\r\n</p>\n<p> When you win a battle against the enemies, you win 1 or 2 keys. There are also Bosses in the Overworld map as well, 1 for each area. The first two Bosses block the entrance for the next area (except for Vroot, since he is the final Boss). To encounter a battle with the boss, simply just bump into them, and if you defeat them, you win 3 or 4 keys. There are also Treasure Chests and Signs in the Overworld Map.\r\n</p>\n<p>There are also intractable objects in the overworld map, which are the sign and the treasure chest. The Signs is a guide to the World of Mystery Island, and informs you about the game. The Treasure Chest upgrades one of your 4 abilities, and adds 1-3 more uses to them, but you must have at least 1 key to open them.\r\n</p>\n<p>In-Battle-\r\n</p>\n<p>When you face your opponents in battle, you have 5 different abilities. Sword Attack is the minor attack, Power Beam for your power attack, Eat Food(Spinach) for your healing, and Aura Shield to protect yourself from enemy attack’s damage, and you can flee/escape the battle. \r\n</p>\n<p>Your opponents are smaller enemies and Bosses. The smaller enemies are easier to battle, and have the ability to attack, heal, or pass their turn. Bosses on the other hand, are much tougher, where they have more attack abilities and one heal ability.\r\n</p>\n<p>Credits-\r\n</p>\n<p>Matthew Makepeace (101179668): https://b4tp3n9uin.itch.io/\r\n</p>\n<ul><li>Overworld Level Design\r\n</li><li>Overworld Game Mechanics and controls.\r\n</li><li>Audio in Game.\r\n</li><li>Main Menu, and UI for the Overworld.\r\n</li></ul>\n<p>Robert Palermo (101277078): https://reaperparagon.itch.io/\r\n</p>\n<ul><li>Ability System\r\n</li><li>In-Game Battle Mechanics\r\n</li><li>AI for the Battle.\r\n</li><li>Animations for the Battle.\r\n</li></ul>\n<p>Game Repository Link-</p><p>Github Link: https://github.com/b4tp3n9uin/GAME-3023---Buddy-Pair-3-Assignment</p>", "metacritic": null, "released": "2021-12-09", "tba": false, "updated": "2021-12-10T14:03:29", "background_image": "https://media.rawg.io/media/screenshots/a2f/a2fc125d326f8fc11c1b70a3ef11995a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["B4tP3n9uin"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}