{"id": 705922, "slug": "samurai-swamp-slayer", "name": "Samurai Swamp Slayer", "name_original": "Samurai Swamp Slayer", "description": "<p><strong>Summary:<br/></strong></p>\n<p>Battle your way through monsters and creatures of the swamp to face the final boss at the end. Survive 5 waves and touch the Purple orb of the swamp to transport yourself to the boss' arena, and Slay the Swamp! Select your weapon of choice in the main menu to help you cleave through your enemies. <br/></p>\n<p><strong>Tips &amp; Tricks:</strong><br/></p>\n<p>Your sword follows the position of your cursor, and damage is calculated by the velocity of your swing. Keep the cursor relatively close to the Player character for control, and move it outward to gain extra speed. </p>\n<p>Certain enemy attacks (like the minotaur, frog, and boss) can be parried. Swing your sword in the opposite direction of their attack in order to perform a parry and stun them.</p>\n<p>Beware! Both the Frog and Boss Enemy have the ability to block and counterattack you! To avoid this, do not hit them while they are performing their block.</p>\n<p><strong>Controls:</strong><br/></p>\n<ol><li>WASD - Control to move back and forth</li><li>A_Double_Tap - Double tap A to face the Left direction</li><li>D_Double_Tap - Double tap D to face the Right direction<br/>\n</li><li>Heal - Press \"H\" to heal when your score counter is above 15</li><li>Dodge - Press \"Space\" to dodge three times before your cooldown activates</li></ol>", "metacritic": null, "released": "2021-12-09", "tba": false, "updated": "2021-12-10T13:41:33", "background_image": "https://media.rawg.io/media/screenshots/2dc/2dcf1dcbf92dcd16acb9303d57c9c6d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Chthonic-TRex"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}