{"id": 706098, "slug": "alien-bus-corp", "name": "Alien Bus Corp.", "name_original": "Alien Bus Corp.", "description": "Alien Bus Corp.\r\n<p><strong>Drive a bus, flying through space to find resources to save your planet</strong></p>\n<p>Alien Bus Corp. is a space-themed, action, open-space game about a bus company operating in an eternal space environment. The space is full of various planets and planetary objects, each having unique landscape futures, as well as unique physical properties. The main objective of a player in the game is to explore space and collect resources in order to save the home planet. </p>\n<p>Main mechanics of the game include space flight with a unique model, landing mode where you need to control the angle of the bus as well as the torque, and on-surface movement that allows you to control a bus like a normal car. Players are not alone in this huge environment, however. There are patrol stations monitoring the area and if you break the rules, hot pursuit starts. Running away from them is not a good solution as they will follow you and they can even teleport, so be careful.\r\n</p>\n<p>The game presents an antagonist group who will try to reach you when they see you. When you die or get captured by the police, you will be fined and if your balance goes below zero, you will be constantly chased by the antagonist group.\r\n</p>\n<p>You will, of course, need to upgrade your vehicles to stand against raising problems. That’s why we have upgrade stations and upgrade centers in the cities. Upgrade system modifies characteristics of thrusters, controls, fuel system, vehicle body and guns. \r\n</p>\n<p>There are stations in the solar system where a player can take orders for delivery and accomplish them by reaching the destination stations. The length of the route affects the delivery price. Also, there are fuel stations where players will be able to refill orbital and landing fuel. The further you go from the fuel supply points, the more you have to pay for. Gatherable resources, called energy crystals, are available which refills all three fuels, being orbital, landing and warp fuels. The warp fuel can only be refilled using these crystals.\r\n</p>\n<p>The vehicles presented in the game can either be purchased from the in-game market or can be found by exploring the planets.\r\n</p>\n\n<p><strong>The game in development so please, be patient about bugs you find.</strong></p>", "metacritic": null, "released": "2021-12-09", "tba": false, "updated": "2021-12-10T14:28:02", "background_image": "https://media.rawg.io/media/screenshots/d45/d4532d58e191e8ba84d246fcabb4dcc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gameliner"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}