{"id": 706104, "slug": "azure-single-player-version", "name": "Azure (Single Player Version)", "name_original": "Azure (Single Player Version)", "description": "<p><strong>Become the Light in the Dark</strong></p>\n<p>The fate of an entire species rests on your shoulders. Travel to Azure, an ocean world filled with mystery and beauty, in search of salvation. Flying the Tymera Atlas, fight your way through the horrors of the abyss, using any means necessary! <br/></p>\n<p>Azure is a 2D, side-scrolling action game that sees you fending off against hordes of alien creatures. In this dark, unsettling world, you are completely alone. It's you versus an army. </p>\n<p>While traversing the watery depths, you are responsible for the maintenance of your craft, the Tymera Atlas. Without it, you are nothing. Ensure that your ship is well-maintained and upgraded to better combat the horrors of the deep.<br/><br/> <strong>Features Include:<br/></strong></p>\n<p>- Four unique, hand-crafted and well-detailed levels that are accompanied with an eerie atmosphere.</p>\n<p>- An intriguiging narrative that hooks you in to the planet's alluring depths.<br/></p>\n<p>- Intense shoot em' up action that's sure to keep you on your toes from start to finish. <br/></p>\n<p>-A variety of challenging hostile enemies, each with their own unique attributes.</p>\n<p>- Multiple impactful weapons that can be upgraded to be all the more powerful.</p>\n<p>-And More!</p>\n\n<p><strong>Created by: Mark Johnson and Connor Walker</strong><br/> We hope you enjoy our game!<br/></p>", "metacritic": null, "released": "2021-12-09", "tba": false, "updated": "2021-12-10T14:29:31", "background_image": "https://media.rawg.io/media/screenshots/e0e/e0e2f5b140563ddf4fe12d096fdd0a79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Narukoopa"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}