{"id": 706210, "slug": "mummy-mansion-updated", "name": "Mummy Mansion Updated", "name_original": "Mummy Mansion Updated", "description": "<p>Famed private collector of Egyptian artifacts, Richard Moores recently added a new addition to his collection, a sarcophagus dating back to 2650 B.C.E. The sarcophagus, like everything else in Moores’ collection was obtained by questionable means and some media sources speculate that it was stolen from one of many dig sites throughout Egypt. While no one can prove that Moore is a thief or a looter, the legitimacy of his collection has come back into question after this recent addition. What remains unknown to Moore is that his new sarcophagus isn’t just an empty centerpiece to his study room, but is actually the final resting place of an unknown wealthy member of ancient Egyptian society. As you begin to stir in your new resting spot you feel the need to escape after being disturbed from such a long slumber. Now wake up and take back the relics of old and escape the clutches of the robber Moore and the mansion he resides in.<br/></p>\n<p>This is an updated version of a game made for the <strong>Cultural Heritage Game Jam. </strong>The original game was a simple game where you avoided lasers and took back artifacts from the corrupt art collector who's mansion you woke up in. This version of the game added several features, including but not limited to:\r\n</p>\n<p>- Puzzles!\r\n</p>\n<p>- Fun Flavor Text!\r\n</p>\n<p>- More Plot!\r\n</p>\n<p>- Several new death animations (and just animations in general)!\r\n</p>\n<p>- Multiple Endings!\r\n</p>\n<p>- More Traps!\r\n</p>\n<p>- Enemies!\r\n</p>\n<p>Please enjoy this version of Mummy Mansion, recoded from the ground up in a completely new engine!\r\n</p>\n<p>Controls:\r\n</p>\n<p><strong>Z</strong> to interact\r\n</p>\n<p><strong>F </strong>to resize window</p>\n<p>                                                                                                             /\\                                                                    |                                                                to go up                                       &lt;--- to go left                    to go right  ---&gt;                                     to go down                                                              |                                                                   \\/\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2021-12-09", "tba": false, "updated": "2021-12-10T14:56:56", "background_image": "https://media.rawg.io/media/screenshots/3cf/3cfe1a5c6c6e76b764a7af336143e7fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BU IM _288  21"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}