{"id": 706318, "slug": "a-frail-qubit", "name": "A Frail Qubit", "name_original": "A Frail Qubit", "description": "<p><strong>Currently in Alpha. There may be bugs and issues, and the game isn't very long. Full paid release coming in 2022.</strong><br/></p>\n\n<p>You control a <strong>Qubit</strong>, or a <em>Quantum Bit</em>, deep within a learning interface in a Quantum Computer, completing <strong>Trials </strong>of intelligence, speed, and patience.</p>\n\r\nThe Qubit is not alone.\r\n<p>The Trial's overseers speak to the Qubit through <strong>Distortions</strong>, in an attempt to probe the intelligence and knowledge of it. Talk with various employees of <strong>Bree Inc</strong>, a mysterious tech company whose motives and operations strike fear into all who come into contact. However, they do come with <strong>powerups</strong> that strengthen the Qubit to press onto more difficult Trials.</p>\n\r\nThe Qubit is frail.\r\n<p>The Trials are not a pleasant place for the Qubit, and death is always around. From <strong>Black Holes</strong> to <strong>Shooters</strong>, <strong>Lasers</strong> and <strong>Bombs</strong>, to the <strong>Walls</strong> that surround the Trials themselves, hazards are everywhere. However, there is always a path forward, and death is merely a step back, not an ending.</p>\r\nThe Trial has many different features.\r\n<ul><li>Over 50 different Trials, with many locked behind mysterious objectives and reasonings.\r\n</li><li>Over 6 different Distortions, with many insights to gain, conversations to have, and powerups to seize.\r\n</li><li>Optional Trials to complete in an Arcade Mode.\r\n</li><li>A chance to <strong>escape</strong>.\r\n</li></ul>\n<p>The most recent version is Alpha 9. You can also download legacy versions of this game that go all the way back to Alpha 4.5, the first semi-playable release in my opinion. This game will come out sometime in Q3 2022 and will cost real-world money to play, however, all Alphas and Betas uploaded to this itch.io page will be free forever.<br/></p>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T15:26:26", "background_image": "https://media.rawg.io/media/screenshots/cb1/cb13ded2940d4a03b45e78d2aff25169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sledgehog Software"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}