{"id": 706329, "slug": "harmonious-fate", "name": "Harmonious Fate", "name_original": "Harmonious Fate", "description": "<p>Select 4 of our 8 available heroes to battle the goblin hoard encroaching on their position. Push and hold your territory on the grid and attack using a rhythm based arrow press system in a turn based strategy game.  Only the strongest will prevail. Do you have what it takes?</p>\n\n<p>The goal as the player is to eliminate the goblin hoard. Defeating the boss will make the other's run like cowards and leave you as the victor. However, if your party falls the goblins will overtake you and you will have to decide if you must choose a different fate.</p>\n\n<p>This is a battle demo for a bigger project in the works. We what to get it out there and hear your feedback on what we need to fix or change before the next version is released. After you've played our game, please let us know how your experience went either by filling out this form: https://forms.gle/aanTLtw6uBU7MJYe8, or leaving a comment on this page. </p>\n\n<p>To begin  playing simply download the HarmoniousFate.zip file on this page and extract the files. Make sure to look at the \"README\" file and controls.png in the folder so you know how to play.</p>\n\n<p>THANK YOU FOR PLAYING OUR GAME!</p>\n\n<p>Follow our Twitter @VastVoidProd for updates on the game development!</p>\n\n<p>Game Design, Story and Pixel Art by: Conner Wieczorek</p>\n<p>Character Portraits by: Emersyn Denault @emtheskinwalker</p>\n<p>Programmed by: Jake Oaks @TheJakeOaks</p>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T15:29:20", "background_image": "https://media.rawg.io/media/screenshots/c66/c662cdff735803ca4cd453a427507836.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vast Void Productions"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}