{"id": 706489, "slug": "final-project-light", "name": "Final Project - Light", "name_original": "Final Project - Light", "description": "<p>I chose the form of a platformer and the topic of confronting the fear. For now I am thinking about having three levels of the game and having the player go through the levels to win. In the process, there will be “ghosts” symbolizing the fear and lights symbolizing the warmth in their lives. The player will be able to collect the lights as energy and shoot the “ghosts”. The player will be losing energy when touching the “ghosts” or get caught by the “traps”. I have not yet decided on the looks of the player, “ghost”, or “traps”. However, there will be short plots before and after the game. </p>\n<p>The three levels symbolize the morning, noon, afternoon of the day in public, and the happy ending will be the end of the day going back to home. The bad ending may be something like being exhausted and hating the world. Before the game, there will be a short monolog as the preparation of a social phobia starting the day. \r\n</p>\n<p>My project is situated within the theoretical perspective of a psychological and game-based genre. My project takes a particular point-of-view from the stance of social phobic people, which will be revealed to the users through the metaphors. Hopefully, my project will raise the awareness of social phobia through the simulation of their psychology. </p>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T16:11:01", "background_image": "https://media.rawg.io/media/screenshots/34d/34d40ea929561f9870a98263bdf316f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yao Xiao"], "genres": [], "publishers": [], "esrb_rating": null}