{"id": 706458, "slug": "ultimate-wall-tool", "name": "Ultimate Wall Tool", "name_original": "Ultimate Wall Tool", "description": "<p>Since I was a child I liked playing a lot of tycoon games. And I always dreamed of building my own tycoon game. So I started to learn about game development. And Unity is my preferred software for building a game. While I kept dreaming about my own games and the beauty of the process of designing a game. And I was getting inspiration from other big producers. I kept my interest, kept learning and I decided to do it. </p>\n<p>We started building our own games. This year we founded our team at Trive Studios. And now we have done it! In order to give back to the community and fund the development of our games, I decided to publish the modules we build. So you can build games too! So I present to you our first Unity Asset package. This is the first and most important building block of any tycoon game: building walls in-game. And more are coming!\r\n</p>\n<p><strong>So what can you do with this package:</strong>\n</p>\n<ul><li>The ability to build walls (use the left mouse button)\r\n</li><li>The ability for the user to hear sounds and get effect while placing wall segments, you can of course add your own!\r\n</li><li>The ability to remove wall segments (use the right mouse button)\r\n</li><li>The ability to remove entire nodes (with their corresponding wall segments) \r\n</li><li>The ability to Enable and Disable the building tool\r\n</li><li>The ability to create 4 combinations in all major wind directions\r\n</li><li>The ability to texture the wall (inside and outside)\r\n</li><li>The ability to change the height and width of the walls\r\n</li></ul>\n<p><strong>What can it not do (yet):</strong>\n</p>\n<ul><li>The ability to place diagonal wall segments (planned)\r\n</li><li>The ability to place walls on multiple floors (planned)\r\n</li><li>The ability to mask walls segments for assets placement (such as windows and doors) that are intersecting the walls (planned)\r\n</li><li>The ability to texture wall segments individually (planned)\r\n</li></ul>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T16:02:17", "background_image": "https://media.rawg.io/media/screenshots/a28/a28a3be21a1bab6672807908b06072c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["trive-studios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}