{"id": 706426, "slug": "exon-fragment", "name": "Exon: Fragment", "name_original": "Exon: Fragment", "description": "Every era has them.<br/>We used to call them adventurers. Knights in shining armour.<br/>Wandering the world. Slaying monsters. Seeking honour and glory.<br/>In this era, they ride mechs.<br/>Today, we call them exons.\n<p><em>Exon</em> is a singleplayer, narrative-driven sci-fi  action-RPG game. Explore the first level of the prologue in this demo!<br/></p>\n<ul><li>Top-down melee combat: smash up other mechs with big swords, because swords never run out of ammo\r\n</li><li>Equipment-based  progression: your mech is only as good as the weapons it carries — swap  out swords, shields, guns and utilities as you find them or need them,  with no need to worry about experience points, levels or attributes\r\n</li><li>Talk to the monsters: unravel the story by conversing with allies and enemies alike\r\n</li><li>Adventure:  leave the bustling waystations behind and strike out into the  wilderness, in a universe littered with  the byproducts of technological advance... and the people fighting over them</li></ul>\n<p>The demo includes the full gameplay experience of the first area of the game, the Exon Academy:<br/></p>\n<ul><li>Take on the Gauntlet to learn how to be an exon</li><li>Take on other exons in the Arena for fun and money</li><li>Take on some minor local concerns in the wilderness around the Academy</li></ul>\n<p>NOTE: <em>Exon</em> is under active development, so everything you see here is subject to change entirely at my whim. You can read all about the development process at https://www.raodaozao.net/exon!<br/></p>\r\nSystem Requirements\r\n<p>Hard requirements:\r\n    </p>\n<ul><li>64-bit Windows, 7 or later</li><li>DirectX 11</li><li>A mouse &amp; keyboard\r\n</li><li>250MB hard drive space\r\n</li></ul>\n<p>I have confirmed the game runs smoothly with the following system specifications, but these are likely overwrought on several counts so please let me know if you do/do not have trouble with anything lower:\r\n    </p>\n<ul><li>2.3GHz i5-6300HQ quad-core processor\r\n</li><li>8GB RAM\r\n</li><li>GTX 970M graphics card</li></ul>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T15:53:41", "background_image": "https://media.rawg.io/media/screenshots/236/2360945ce7960b9183271f3235a269b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rao Dao Zao"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}