{"id": 706536, "slug": "my-dream-is-to-be-a-model-not-a-maid", "name": "My Dream Is To Be A Model, Not a Maid!", "name_original": "My Dream Is To Be A Model, Not a Maid!", "description": "<p><strong><em>\"My dream is to be a model, not a maid!\" </em></strong></p>\n<p><strong>Tanaka Akane is a stubborn and hot-headed 24 year old still chasing her lifetime dream of being a model, but after countless amounts of interviews, she still hasn't landed a permanent modeling job at an agency yet. To make matters worse, she accidentally spills coffee on a rich CEO's daughter and now this stranger demands Akane to be her maid to pay off the damages. How will Akane fare as a maid for this snobby and impossible rich girl? Will she even be able to last a day? Find out by reading </strong><em><strong>\"My Dream Is To Be A Model, Not A Maid!\"</strong></em></p>\n<p>| |</p>\n<p>It's Team ANPIM here once again joining the Yuri Game Jam! We're back again with a story revolving around adults! Which we all dearly need honestly. Justice for yuri with adult characters!! We say as we go back to a high school setting next game.  Thankfully we were able to work on our visual novel a bit early, so we didn't have to worry about school assignments getting in the way, so we got a lot done stress-free. We even managed to upload the game on time this year again! Wooo! Anyway, we're glad we were able to finish this without rushing! And yes, we kind of used the formula of a \"light novel-esque\" title again for this year's game, but it fits the best honestly! Whether you love the formula or not, we do hope you'll love this year's entry! And of course, be sure to share this visual novel if you liked it! &lt;3</p>\n<p><strong>**Note for playing in</strong> <strong>Fullscreen only</strong>: When playing in fullscreen or past a certain window size, the letters 'e' might look a little bolded when they're not meant to be. We suggest you play at the default window size to avoid this! Alternatively, if you still want to play in fullscreen, you can press \"A\" key on your keyboard while you're in the game and adjust the <strong>Text Size Scaling</strong> until it's fixed to your liking. Sorry for the inconvenience! </p>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T16:22:00", "background_image": "https://media.rawg.io/media/screenshots/c22/c2250cfb4dae5dfc7b0a100da6ed6d63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TeamANPIM"], "genres": [], "publishers": [], "esrb_rating": null}