{"id": 706523, "slug": "pinky-n-friends-picnic-gang-problems", "name": "Pinky n Friends: Picnic Gang Problems", "name_original": "Pinky n Friends: Picnic Gang Problems", "description": "<p>Created by Kevin Jung</p><p>This is my first complete(ish) video game I've made, so hope you enjoy it!</p><p>Pinky, Froggo, Tiki, and Astro are a group of good friends on their way to a picnic. Unfortunately, Froggo’s past has come to haunt him, and his old thug gang has come to take him and his friends out in revenge, and not to dinner! Make your way through levels, avoiding the frog gang members and other hazards they put to stop you! Switch between the four friends by eating their favorite fruit throughout each level. Each friend has their own jumping and speed abilities!<br/></p>\n<p>This is a side scrolling, platform style game. You one character at a time through a handful of levels to reach the end goal while avoiding the frog gang members. The goal is to complete all levels without dying. Losing all your lives results in a game over and no picnic. You can heal themselves by eating fruit spawned throughout the levels. </p>\n<p>Each fruit will also switch the character the player plays as:</p>\n<ul><li>Strawberry for Pinky</li><li>Cherry for Froggo</li><li>Pineapple for Tiki</li><li> Apple for Astro.</li></ul>\n<p>Pinky is the basic character for this game, the other characters’ jump and speed will go off from Pinky's. Froggo can jump higher, but is a bit slower than Bunny. Tiki is super fast but cannot jump very high. Astro can jump high and is bouncy in order to “float” in the air. Defeat frog enemies by jumping on top of them. Be careful though, as bumping into them will deal damage!<br/></p>", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-10T16:19:10", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fc2484afe9e0b999a8e09349f044cab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["KStar510"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}