{"id": 706702, "slug": "underling-uprising-free-demo", "name": "Underling Uprising (FREE DEMO!)", "name_original": "Underling Uprising (FREE DEMO!)", "description": "\n\n<p>\n</p>\n\n<p>Hi everyone! This is a demo for our upcoming game,<strong> Underling Uprising,</strong> a cartoony beat 'em up with a heart of gold. We've been developing the idea for the last ~5 months or so and this is how we imagine the final product to be like. When we first began development, we wanted to create an engaging brawler with gameplay inspired by some of our favorite games in the genre<strong> (Streets of Rage, Castle Crashers, Capcom brawlers, Dad N' Me, Dungeon Fighter Online, etc.) </strong>and visually inspired by Saturday morning cartoons from our childhoods<strong> (Teen Titans, Powerpuff Girls, Teenage Mutant Ninja Turtles, Dexter's Laboratory, etc.).</strong> We sincerely hope you enjoy what we've made so far and we would love to hear any feedback that you have! All suggestions will be taken into consideration! </p>\n<p><strong>Thank you for your time and have a good one</strong>!<br/></p>\n\n\n<p><strong>Move</strong> - Arrow Keys / D-Pad / Left Stick</p>\n<p><strong>Basic Attack</strong> - X Key / Square / X button</p>\n<p><strong>Special Attack</strong> - Z Key / Triangle / Y Button</p>\n<p><strong>Jump</strong> - C Key / Cross / A Button</p>\n<p><strong>Grab/Pickup</strong> - A Key / Circle / B Button</p>\n\n<ul><li>Fast-paced, arcade inspired edge of your seat fighting action!</li><li>Colorful hand-drawn visuals inspired by cartoons from our childhoods! <br/>\n</li><li>Amazing<strong> </strong>electronic soundtrack with hints of retro and 80's synthwave aesthetics!</li><li>Narrative-driven plot with a unique and quirky cast!</li><li>[TO BE DEVELOPED] 4 Playable Characters with diverse movesets</li><li>[TO BE DEVELOPED] 4 Player Co-Op and Versus Modes</li><li>[TO BE DEVELOPED] Multiple Difficulties and Endings</li></ul>\n\n\n<p><strong>I.D.E.A.L.</strong>, a company led by <strong>Dr. Baldrick</strong> and his specifically built for assistance assistant <strong>WASHY</strong>, has a hold on the world and it’s tendrils in every business (though they are mostly famous for their snacks). In the year 200X, however, <strong>I.D.E.A.L.</strong> has nearly obtained it’s actual objective: turn <strong>Dr. Baldrick</strong> into a <strong>PERFECT BEING</strong>. Thanks to the efforts of multiple labs across the globe, hundreds of overtime hours, countless lives, and 42 missed childrens’ birthdays, <strong>Dr. Baldrick</strong> will finally be able to obtain his life’s ambition: <strong>PERFECTION</strong>.</p>\n<p>\tThat is, of course, unless there was someone (or something) to <strong>stop him</strong>.\r\n</p>\n<p>\tTake control of the failed experiments <strong>Rose &amp; Lola, Ángel, Deckster, and Boogie</strong> and help them escape from <strong>Dr. Baldrick’s clutches</strong>. Fight through a scientist and robot riddled lab and take the fight to the streets. \r\n</p>\n<p><strong>But escape is not enough</strong>. You must tread the globe and stop <strong>Baldrick</strong>, his washbucket of an assistant <strong>WASHY</strong>, and the evil all encompassing company <strong>I.D.E.A.L.</strong> the only way you know how: <strong>WITH YOUR FISTS</strong>!<br/></p>\n\n\n\n<p><strong><strong> </strong></strong></p>\n\n<p>With her work studying the occult and the supernatural making her a leading voice on the subject, Lola and her research were prime targets for the heinous megacorp I.D.E.A.L.. Once Lola passed away, agents of I.D.E.A.L. swooped in to steal her work on communicating with the spirit realm from her home. Rose, who just happened to be there at the time to sort out her grandma’s belongings, was taken along with the research.<br/></p>\n<p>While Baldrick was able to successfully utilize the research to open a portal to spirit realm, he quickly found that no spirits would help him with his plan: to enlist spirits as soldiers in his unholy ghost army! Dismayed, Baldrick left the realm, but not before Lola could leave and aid her captured granddaughter. She possessed Rose, giving her newfound powers just as she was stored away with other failed experiments.\r\n</p>\n\n\n<p><strong><strong> </strong></strong></p>\n\n<p>An ex-luchador and ex-heel, Ángel is Dr. Baldrick’s favorite wrestler. So much so, that watching Ángel break both of his arms in his last match devastated Baldrick. Of course, the injury was not actually real. It was part of the story at the time, and an out for Ángel to retire from the world of wrestling, a world that he felt ashamed for being a part of. <br/></p>\n<p>But Baldrick did not know that. The injury was real to him and he wanted his favorite wrestler back. So he kidnapped Ángel and replaced his arms with souped-up cyborg ones in hopes of not only getting Ángel back in the ring, but make sure he never loses a match! This could not fix Ángel’s spirit however, and he was stored with other failures so that Baldrick did not have to look at the miserable pile his favorite wrestler had become. But after falling from grace and forcefully losing his arms, Ángel was sick of what his life had become. In order to fix that, however, he would have to escape first.</p>\n\n<p><strong><strong> </strong></strong></p>\n\n<p>Born and raised in a lab, Deckster was one of a slew of  animals experimented on by I.D.E.A.L.. Monkeys and apes specifically were experimented on to become hyper-intelligent, something that could be later used for Dr. Baldrick’s PERFECT BEING project. And Deckster is a major success. To the point where he became bored with all the intelligence tests forced upon him. Then, after messing with a skateboard (something Dr. Baldrick threw into Deckster’s room after Baldrick watched a funny video one time), Deckster discovered the thrilling, pulse pounding, radically sweet art of skating.<br/></p>\n<p>Like any art, Deckster had a rough start, but this difficulty filled him with endless motivation to master skating. He poured himself not only into the training, but the culture as well; demanding magazines, video games, skate videos, music, etc.. Which were all provided, as Baldrick was ecstatic to see motivation in his (at the time) only seemingly successful subject. This quickly wore off, as Baldrick could not figure out how to harness the radical power of a skating monkey. So, Deckster was stored away with other failed subjects.</p>\n<p>\n</p>\n<p>Bummer.</p>\n<br/>\n<p>Not a lot is known about Boogie.</p>\n<p>They were part of a series of experiments meant to create elementals in the hope that the power of the elements could be installed into a living creature, something that would greatly benefit the PERFECT BEING project. Boogie was supposed to become a water elemental. During the transformation part of Boogie’s experiment, Dr. Baldrick was digging for gold and flicked a chunky nugget away. It landed on the subject, and in a horrid display of evil and botched science, they transformed into a booger being!\r\n</p>\n<p>Disgusted and revolted, not only was Boogie deemed a failure, the entire elemental series was deemed a failure! The subjects and entire lab was abandoned in a basement and locked away from the rest of the world. Boogie was specifically locked away with other failed experiments that Baldrick was more than likely never going to visit again.</p>\n\n\n<p>ARTIST - Lenny Lam</p>\n<p>GAME DESIGNER / PROGRAMMER - Mark Ilog</p>\n<p>NARRATIVE DESIGNER - Chris Vasquez</p>\n<p>MUSICIAN / SOUND DESIGNER - Genuine Music<br/></p>", "metacritic": null, "released": "2021-12-07", "tba": false, "updated": "2021-12-10T17:07:51", "background_image": "https://media.rawg.io/media/screenshots/268/268ebebd422bf76812ee61eac6bb7fcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Dummy Dojo"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}