{"id": 7068, "slug": "powder-monkeys", "name": "Powder Monkeys", "name_original": "Powder Monkeys", "description": "★★★ 1MM DOWNLOADS IN UNDER 4 WEEKS &amp; REACHED #1 OVERALL IN CHINA ★★★<br/><br/>An ice age has descended upon Earth, wiping out mankind. Of all species left on the planet only a group of monkeys and bugs, hidden in pockets of Earth, survived. But a ray of hope appears when the  golden banana tree sprouts to life. Magical warmth returns to the planet and the mysterious golden tree sparks a rapid evolution of the survivors.<br/><br/>Take command your crew of \"Powder Monkeys\" in a quest to gain control of the golden banana tree, defeat the villainous captain..Fidel Mantis and his crew of nasty bugs!<br/><br/>**********<br/><br/>REVIEWERS ARE PLUNDERING TOO!<br/>\"If you have ever had a hankering for the high seas this is a good place to start. Anchors aweigh!\" TouchArcade.com<br/><br/>\"The game is simple and the game looks great!\" 148Apps.com<br/><br/>\"Powder Monkeys gets a score of 9 out of 10\" The App Shack<br/><br/>**********<br/><br/>DECK IT OUT!<br/>Make your ship the most powerful in the fleet by purchasing bullets, power-ups and resources in the Powder Monkeys store!<br/><br/>BATTLE!<br/>Choose your ammo and blast away! Deciding between hard-hitting coconuts, defensive umbrella bullets or devastating nukes will be a Captain's toughest decision. With over 50 types of bullets and only three slots in your hold, strategy will be the key to victory!<br/><br/>BOAT-LOAD OF QUESTS!<br/>With over 60 levels and 40 quests danger, treasure and fun lurk around every island in the world of Powder Monkeys!<br/><br/>Powder Monkeys combines RPG-style exploration with tower-defense like systems. The game features eye-patching graphics, a boat-load of quests and a cast of characters ready for action and adventure on the high seas.<br/><br/>Featuring 7 different GameCenter leader boards the competition will get fierce on the high seas of Powder Monkeys!<br/><br/>Over 80 hours of gameplay!!!<br/>**********<br/><br/>Check out our other amazing games!! Cows vs. Aliens,  Inspector Gadget, Drag Racer World, Ghostbusters™ Paranormal Blast, and Fashion Star Boutique! <br/><br/>**********<br/><br/>Visit Us! xmg.com<br/>Like Us! facebook.com/xmgstudio<br/>Follow Us! @xmgstudio<br/>Watch Us! youtube.com/xmgstudio", "metacritic": null, "released": "2011-10-14", "tba": false, "updated": "2019-07-30T11:04:36", "background_image": "https://media.rawg.io/media/screenshots/5a2/5a20d6d99a021857f43958d2ee766379.jpg", "website": "http://www.xmg.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["XMG Studio"], "genres": ["Action", "Adventure"], "publishers": ["XMG Studio"], "esrb_rating": null}