{"id": 706999, "slug": "chronobandit", "name": "Chronobandit", "name_original": "Chronobandit", "description": "<p>Chronobandit is a Superhot-like top-down, sci-fi shooter where the player controls a prisoner on an alien pirate spacecraft, equipped with a laser pistol and a mysterious device stolen from a guard. This gadget, the Time Twister, reacts to the player’s motion, adjusting their perception of time accordingly. The player must make use of the tools at hand to fight their way through a ship full of aliens and robots, collecting weapon upgrades along the way, and make it back home.</p>\n<p>Chronobandit’s core mechanic revolves around the Time Twister. Whenever the player stands still, time slows to a crawl around them, slowing the movement of enemies and projectiles. Whenever the player moves again, time returns to its normal speed. The player can take whatever opportunities they need to slow down, analyze the battlefield, and react accordingly.\r\n</p>\n<p>Our game gives the player the freedom to play at whatever pace they like, whether it’s run-and-gunning or strategically planning their actions.</p>\n\n<p><strong>Gameplay:</strong></p>\n<p>The player is put in a room filled with a variety of alien and robotic enemies, and the doors will lock behind them. Once every enemy has been cleared, the door into the next room will open. The path the player takes is strictly linear, and they are unable to backtrack. \r\n</p>\n<p>After every few rooms, the player will be able to take a sigh of relief as they encounter a small room with no enemies and a computer terminal where they can purchase upgrades using the resources obtained from fallen enemies, as well as having the ability to spend those same resources to replenish their health. This is the only way for the player to recover health, forcing the player to think before they act. These same computers act as checkpoints for the player, saving their current health, upgrades, and progress. After making their way through five rooms, the player will ascend to the next level of the ship, where they will encounter new and more dangerous enemies.</p>\n\n<p><strong>Controls:</strong><br/></p>\n<p><strong>W:</strong> Moves the character up\r\n</p>\n<p><strong>A:</strong> Moves the character left \r\n</p>\n<p><strong>S:</strong> Moves the character down\r\n</p>\n<p><strong>D:</strong> Moves the character right \r\n</p>\n<p>Aim with your <strong>Mouse</strong> and <strong>Left Click</strong> to Shoot the Enemies \r\n</p>\n<p><strong>Press E</strong> to interact with the upgrade terminal (a computer that allows you to upgrade weapons &amp; health)\r\n</p>\n\n<p><strong>Post Mortem:</strong></p>\n<p><em>What are we proud of?</em>\n</p>\n<p>We were able to put an idea together and follow through with it, successfully putting together all of the key components of our design while adapting and trimming back the plan when necessary without losing anything important.\r\n</p>\n<p><em>What problems did we encounter?</em>\n</p>\n<p>Github was our main enemy. None of us had used it before, and even though we all watched the presentation for it we still struggled to push our projects to the main branch. Our first repository had to be removed due to issues we were having, forcing us to open a whole second repository. We also had issues scheduling meetings at times, which slowed down the development process.\r\n</p>\n<p><em>What changes did we make?</em>\n</p>\n<p>We ended up having to cut back on a lot of our original idea, which would have been better suited to several months or even a year of development, as opposed to an 8-week project. We were able to do so without losing any key elements of our design, though, producing an effective prototype demonstrating how we want the game to feel.\r\n</p>\n<p><em>What did we learn?</em>\n</p>\n<p>Early on, we learned the importance of splitting up work and effectively communicating with each other. There are a lot of jobs that need to be done, and every member of the team needs to do their part, communicate what they’re doing to the team, and make sure they deliver their assets and code to the rest of the group on time to prevent holding up the entire group.</p>\n\n<p><strong>The Team:</strong>\n</p>\n<p>Brennan Golab - Programming and SFX\r\n</p>\n<p>Franco De Porzi -  Programming \r\n</p>\n<p>Miguel Diaz - Programming\r\n</p>\n<p>Jonah Craven - Art and Programming\r\n</p>\n<p>Gerardo Cortez - Art, Sound, and Music Design</p>", "metacritic": null, "released": "2021-12-06", "tba": false, "updated": "2021-12-10T18:26:17", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7f9209d42626d5ab408852caa2f6a91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gcort"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}