{"id": 706952, "slug": "escape-orca", "name": "Escape ORCA", "name_original": "Escape ORCA", "description": "<p>A short retro-like scroller game that follows a human mutated into a shark. The goal is to escape that organization that has trapped him. By running through scrolling levels, fighting off enemies, and navigating mazes, his only choice is to succeed! <br/><br/>Controls:</p>\n<p>This game is a movement based game with some other elements. The player moves using WASD, and their objective is to reach the bottom of the screen. If they die before then, or leave the screen, that is a game over. </p>\n<p>Game Mechanics:</p>\n<p>This game features 2 main levels. One of these is a tutorial followed by the main level where the shark aims to reach the exit of the organization. There are 2 main types of enemies. One type is the data cube which are small robots that target our protagonist by sacrificing themselves to damage him. The other type of enemy is a grunt, they are employed by the organization to stop the shark from leaving. Their main attack is using a a harpoon and charging at the shark to cause damage. These grunts come in a variety of colors but are effectively the same enemy. The health system is a simple one where hearts are replaced by fish. The player can pause at any time to view their health and strategize accordingly. Another mechanic are switches that unblock pathways for the player; this mechanic is fairly simply: shoot switch, unblock path. The player has 3 main weapons they can rotate between. First is a bubble which is a close range attack. Secondly, there is  shark tooth which is longer range. Lastly, there is a bloody shark tooth which acts as a regular one but can pierce through enemies. With this many intertwined mechanics, this game is a must-play! <br/><br/>Post Mortem:<br/> Our team had a great time making this game, and we believe our communication with each other was truthfully what went right. Everything fell into place the way it did because we were all clear about our objectives by the end. Admittedly, what went wrong was that we failed to make a clear plan initially, and bit off more than we could chew. This caused us to make the big decision to change our game from an RPG style game into what you see know. However, what you do see now is a game we are very proud of, and something that outdid our own expectations. </p>", "metacritic": null, "released": "2021-12-07", "tba": false, "updated": "2021-12-10T18:12:37", "background_image": "https://media.rawg.io/media/screenshots/5e0/5e07a123635141f69b6682f0b5981dac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["aajeeb"], "genres": ["Action"], "publishers": [], "esrb_rating": null}