{"id": 707126, "slug": "life-is-2-d-episode-2-out-of-time", "name": "Life is 2-D - Episode 2: Out Of Time", "name_original": "Life is 2-D - Episode 2: Out Of Time", "description": "<p>Life is 2-D Episode 2: Out Of Time is now available to play online (actual .gb ROM will come later), for free. Please note that while this build SHOULD be finishable, it is simply impossible for me to test out every combination of options at this point. It is also a little less polished than Episode 1, so while all the story paths etc are in and SHOULD be working,  I am releasing it as is and may go back to it to tweak and expand in due time. The only area I would be particularly cautious of is the science lab near the end - it exists, but isn't tested well, and while it theoretically works (and you should at least be able to exit), various factors make it a little... fragile. Avoid entering it or wait for the .gb ROM (so you can save before just in case) would be my advice for now. There are also small graphical things I would intend to fix, and if you find any major issues (conversations that just stop and progress becomes impossible, for example), please do let me know and I will update to fix them as best as I can. It is entirely possible some late change has broken something without me realising, but hopefully not...<br/></p>\n<p>Thank you for your time! :)</p>\n\n<p>EDIT: .gb ROM for emulators or actual hardware. <br/></p>\n<p>https://mega.nz/file/KExAwITB#uvVlAYM7zrj0AXPLO1IF3hBnbMLhW4a5zJU7lmU_eqk</p>", "metacritic": null, "released": "2021-12-06", "tba": false, "updated": "2021-12-10T19:04:24", "background_image": "https://media.rawg.io/media/screenshots/f82/f824e995a94cdf774bfbba32966df0f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["lifeis2d"], "genres": [], "publishers": [], "esrb_rating": null}