{"id": 707274, "slug": "a-couple-of-cubes", "name": "A Couple Of Cubes", "name_original": "A Couple Of Cubes", "description": "A Couple of Cubes is a co-operative multiplayer puzzle-platformer set in a world of cubes. You play as Hugh and Boyd, regular cube people going about their lives when a disaster strikes and grants them exciting new powers! Work together to progress through platforming puzzles!https://store.steampowered.com/app/1582120<br/><br/>Co-Operative GameplayPlay in either split-screen or online with a friend! Progress through physics based puzzles to escape the sci-fi facility you have been trapped in and unveil the mysteries behind your captors. Each character has different abilities that complement each level's puzzle based design.<h3>Physics</h3>A Couple of Cubes is a heavily physics-based game. Move objects with characters abilities and pick up objects to solve puzzles with the game's physics interactions.<h3>Key Features</h3><ul><li><strong>Online Co-op!</strong><br/></li><li><strong>Split-Screen Co-Operative Gameplay</strong> - Play A Couple of Cubes in couch co-op mode or Steam Remote Play Together with a friend!<br/></li><li><strong>Steam Remote Play Together</strong> - Play online with a friend through Steam's Remote Play Together feature, or using the built in online mode for full-screen gameplay.<br/></li><li><strong>Unique Character Abilities</strong> - Hugh can change his material and Boyd can change his size, to help each other progress through each levels puzzles.<br/></li><li><strong>Physics Based Puzzles</strong> - Progress through increasingly difficult physics based puzzles by working together as a team.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-13T02:46:48", "background_image": "https://media.rawg.io/media/screenshots/4af/4afa9ef1089d712cca8ec95360ff17a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Silent Yeti Entertainment"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Silent Yeti Entertainment"], "esrb_rating": null}