{"id": 707277, "slug": "the-timeless-child-prologue", "name": "The Timeless Child - Prologue", "name_original": "The Timeless Child - Prologue", "description": "The Timeless Child is a 2-player puzzle-adventure coop game with first-person view. <br/><br/>Start an exciting and engaging adventure, a tale about family, bonds and secrets. You will explore Wells Manor, an ancient 16th century villa full of history and secrets, living the experience from two different temporal perspectives.<br/>Whether you decide to take on the role of Chris Hunt, a skilled hunter on call, or Emily Wells, a child trapped in the past, you'll need to collaborate with your partner to solve puzzles that require cooperation and logic to be completed.<br/><br/>Are you ready to embark on an exciting journey to the borders of time and space to save Emily from her time captivity?<br/><br/><br/><br/><strong>TIME PROJECTION</strong><br/>Emily is in the same space as Chris but at a different time in the past. Every action of Emily in the past will reflect on Chris's world in the present. <br/><br/><br/><br/><strong>UNIQUE WORLDS</strong><br/>Unique elements within the game world depending on the chosen character. Live the experience from two different points of view and discover the consequences caused by the flow of time on the surrounding world.<br/><br/><br/><br/><strong>SKILLS</strong><br/>5 different puzzles, each characterized by a unique design and a different solution approach. You will need a full bouquet of skills to finish the game with your partner. Get ready to test your exploratory and descriptive ability, coordination, logic and reflexes. If you think you are good at solving puzzles, you should challenge yourself with this game. <br/><br/><br/><br/><strong>LORE</strong><br/>Wells Manor is rich of lore and secrets just waiting to be discovered. In this Prologue you can start to understand all the story behind Emily's broken fate. Who and why trapped Emily in the past?<br/><br/><br/><br/><strong>FEATURE LIST</strong><br/><ul><li>2-player cooperative puzzle game with first person view<br/></li><li>Realistic 3D graphics<br/></li><li>Original, immersive and compelling music</li></ul>", "metacritic": null, "released": "2021-12-10", "tba": false, "updated": "2023-05-19T11:23:47", "background_image": "https://media.rawg.io/media/screenshots/67e/67e732bc050859372caba9f6b3887768.jpg", "website": "https://www.timeless-tale.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 3, "toplay": 4}, "playtime": 0, "achievements_count": 17, "ratings_count": 3, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Timeless Tale"], "genres": ["Adventure", "Indie"], "publishers": ["Timeless Tale"], "esrb_rating": null}