{"id": 707273, "slug": "pow-pow-dye-it-up", "name": "POW POW: Dye it up!", "name_original": "POW POW: Dye it up!", "description": "Paintball is quite fun, and school is no fun… obviously! But what if you could turn the boring, gray college hallways into a color-filled labirynth of pure bliss?<br/><br/><br/><br/>Introducing <strong>POW POW: Dye it Up! - a PvP Battle Royale game</strong>. Grab your paintball gun to wreak havoc with your friends and relatives in the vast college school complex. It’s a<strong> great VR time for everyone regardless of their age</strong>! Play with your mom, dad, grandpa, or even your pet if you manage to make him grow thumbs and use the controller. Have top-quality family time by taking part in the non-violent colorful battles. Have we colored you interested?<br/><br/><br/><br/>Going back to college might be a difficult experience, but you can make it much more vivid with a paintball gun in your hands! POW POW: Dye it Up! has some nerve to paint the school with fun. <strong>The game offers a complete paintball zone-turned college full of classrooms, hallways, offices, and much more</strong> with a large gymnasium where you can run, hide and barricade yourself in. There’s also a lot of secrets to be found, and nooks and crannies to be explored. The whole school is at your disposal to play in one of four different game modes - It’s not just <strong>Battle Royale</strong>. Sometimes you just have to give that wedgie in <strong>‘Capture the Panties’ </strong>mode or show off your new pillowcase in a <strong>‘Pillow Fight’</strong>. Maybe you’d rather defend the<strong> ‘Blanket Fort’</strong> or just play a round of good old fashioned <strong>Splashmatch</strong>? Or maybe chill in a student's lounge with your homies?<br/><br/><br/><br/><strong>Fast-paced PvP Battle Royale experience</strong> is the name of the game, but the player who grabs the minigun might turn the tides of battle! Exploration is as important as 360° no-scope, as there’s a lot of paintball gear and weapons conveniently laying around the school - <strong>pistols, assault rifles, shotguns, grenades filled with paint, and even mysterious presents</strong>! Be quick so no one will grab your favorite weapon before you’ll manage to find it. And when you’re done with shooting, take out your pillow and throw it in the face of your friends like it's a pajama party. <strong>Immersion is the name of the game!</strong><br/><br/><br/><br/>Paint yourself the way you want to be seen. Your school is your playground so play as anyone you want! Become a cowboy, a squirrel-person, or a businessman. The full game of <strong>POW POW: Dye it Up! will offer a robust character creator </strong>that will give players a chance to stand out in a crowd and express themselves with unique combinations of outfits and body types.<h3>Game Features: </h3><ul><li>VR FUN FOR EVERYONE - non-violent VR action game for family enjoyment. Play with your moms, dads, or even grandparents!<br/></li><li>VARIETY OF WEAPONS - pistol, shotgun, assault rifle, grenades, or even a minigun! Find the best gun and paint your way to victory. Wait, is he wielding a pillow?<br/></li><li>SPECTRUM OF MODES - Battle Royale is only the beginning. Play good old-fashioned Splashmatch, defend the Blanket Fort, take part in Pillow Fight or… Capture The Panties?! What?<br/></li><li>AVATAR CUSTOMIZATION - everyone has the right to play paintball, whether it’s a slim businessman or a fat cowboy cosplaying dude. Become who you want to be.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-13T02:45:49", "background_image": "https://media.rawg.io/media/screenshots/942/942ac02cd4c54272293c5a8f81f28b37.jpg", "website": "https://punkpirates.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PunkPirates"], "genres": ["Action", "Sports", "Casual", "Massively Multiplayer"], "publishers": ["PunkPirates"], "esrb_rating": null}