{"id": 707285, "slug": "beard-of-stone", "name": "Beard of Stone", "name_original": "Beard of Stone", "description": "Beard of Stone is a fantasy turn based 4x that tell the story of a world's creation all the way to the twilight of the gods. Not exclusively a turn based strategy game,  real time bidding mechanics keep everyone actively involved. Who is up for their next turn is constantly in contention! The game is fast paced and quick enough to be played in a single sitting.<br/><br/><br/>Players take the role of Gods, bending the prophetic destiny of the world to their ends. Every event and action in the game is public information from the very first turn, displayed on the Prophecy Track. Players spend their Influence currency to gain control of these prophecies in real time. Anyone can bid and be outbid before a prophecy arrives as the current turn. Prophecies span a wide range of actions, from the creation of the continents of the world, the birth of all the various races, disasters, military campaigns and more. <br/><br/><br/>As Gods, players are not playing as any specific race. They strive to make the warriors and nobles of the land believers in their faith. As the races expand and worship each God, the Influence invested is redistributed to the Gods to be bid on further prophecy turns. Having the most believers in the most prosperous races will lead to one of the Gods dominating the world and winning the game.", "metacritic": null, "released": "2021-12-10", "tba": false, "updated": "2021-12-13T02:55:11", "background_image": "https://media.rawg.io/media/screenshots/6f2/6f264b5662c547c6697ff626bf0b38ab.jpg", "website": "https://www.dwarfaparte.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dwarfaparte Games"], "genres": ["Strategy"], "publishers": ["Dwarfaparte Games"], "esrb_rating": null}