{"id": 707388, "slug": "long-chain-block-puzzle", "name": "Long Chain - Block Puzzle", "name_original": "Long Chain - Block Puzzle", "description": "<p>Long Chain, Number Block Puzzle Game, is known for beautiful match number and merge number games for adults. Using Long Chain, merge more number blocks to get higher rewards, train and rest your mind simultaneously!<br/><br/>If you love to play merge games, number games, block games, merge puzzle games or looking for an anti-stress game, then Long Chain - Block Puzzle game is for you.<br/><br/>There are three amazing <strong>power ups</strong> in Long Chain Block Puzzle games for adults: Scramble, Swap, and Destroy. Use it when you are stuck in the game. Match numbers of the same number block and get higher scores. Play free to <strong>relieve stress and anxiety.</strong> This Long Chain Block Puzzle game will <strong>keep you busy but relaxed.</strong><br/><br/><strong>How to Play - Long Chain - Block Puzzle</strong><br/>Long Chain is a block puzzle game, match three or more number blocks. Super fun match and merge puzzle game. The goal is to merge the blocks to get a high score and increase the block number value. The long number of blocks Chain you merge, the more score you will get.<br/><br/><strong>Long Chain - Block Puzzle Game Features</strong><br/>Easy to learn and play, but not so easy to be a great master.<br/>Daily rewards and spin wheel to get powerups.<br/>Challenging to break your highest score in a block puzzle.<br/>Scramble, Swap and Destroy powerups.<br/>Multiple themes, Such as Numbers, Characters and Roman.<br/>No internet connection is required to play the number blocks merge puzzle game.<br/>Great graphics with east UI<br/><br/>Play Long Chain - Block puzzle and become a master of merge block and merge number block puzzle game now! Have fun with casual games! <strong>Download it for free</strong> 😍</p>", "metacritic": null, "released": "2021-12-06", "tba": false, "updated": "2021-12-13T09:07:27", "background_image": "https://media.rawg.io/media/screenshots/77f/77f4c013e8252110b9e5b7236ca62178.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Free Card Games Offline"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}