{"id": 707331, "slug": "a-distant-stabbing", "name": "A Distant Stabbing", "name_original": "A Distant Stabbing", "description": "Are you stuck in queue, waiting for a match to start? Is your rank too high, and the servers are struggling to find you opponents of equal skill?<br/>Do you want to play something in the meantime that will tilt you before you even get in?<br/>\"A Distant Stabbing\" was made for exactly that!<br/>A strategic platformer where every arrow you shoot could bring you closer to your target at the top of the tower, or take you all the way back to where you came from. Or worse.<br/>Challenge yourself or others to see how quickly you can reach your goal, while being efficient with how many shots you take to get there. <br/>Shoot, teleport, repeat.<h3>The Game</h3>Using angles and patience, aim each shot to achieve the perfect bounce (or stick) of your arrow to ensure you gain as much height upwards as possible. The longer you charge a shot, the more likely the arrow is to bounce! Once it sticks, your hero will teleport to that location, so you can restart the process.<h3>The Tower</h3>As you work your way up, you might notice something strange going on in this sleepy tower! Explore environmental storytelling that hints at a greater threat than your target at the top. Who knows how deep this story goes?<h3>The Hero</h3>Play as a nameless, voiceless, idle hero who absolutely needs to take out the man who owns this tower. Why? Mostly so that this game can happen. Only time will tell.<h3>Why?</h3>I wanted to make something that would make people angry. I also wanted something to play while I waited for a match to start in other, better games. <br/>It feels great to climb, it feels bad to fall, but it feels even worse to fail right after also losing a ranked match of something else.<h3>Stats</h3>I have included a basic Stat tracker to ensure no achievement is earned without proof. See for yourself, and show your friends, just how many times you beat the tower. Or had \"accidents\".", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2021-12-13T03:31:09", "background_image": "https://media.rawg.io/media/screenshots/8fb/8fb40de53b6afd334dc507d492862835.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AndyK"], "genres": ["Indie"], "publishers": ["AndyK"], "esrb_rating": null}