{"id": 707307, "slug": "sentient-noir", "name": "Sentient Noir", "name_original": "Sentient Noir", "description": "<strong>Note to players about DEMO:</strong> We have an early demo build available to play (inspired by EGX PAX) and the game is still in production. You will still need a <strong>keyboard to exit and start your game</strong> and your game <strong>will not save</strong>. This will not be the case when the full game is released. We've been putting a lot of energy into making this game  over the 4 years so  please take your time to give us support and feedback! Please be constructive. This will improve our game and make it a better experience for you in the end. <br/><br/>Welcome to <strong>Night Light City</strong>, a dark, dystopian alien City, where four factions want the incredible powers of a Detective Hunter for their own ends. With these powers, you're able to manipulate, befriend, betray, instill fear and destroy the sentient populous. You are feared, but maybe that can change as you discover the secrets of the <strong>sentient city</strong>.<br/><br/> <strong> Uncover the secrets and truth of this dark sentient city as a hard-boiled alien detective</strong><br/><br/> <strong> Utilise your detective skills to solve many cases and restore your reputation. Your cases will include simple to mature-themed scenarios</strong><br/><br/> <strong> Experience the sentient emote system that you can use to interrogate, manipulate, terrorize or sway the odds in your favor</strong><br/><br/> <strong> Feel like a powerful alien weapon as you unleash your unstoppable powers into the very depths of the midnight alleys of Night Light City</strong><br/><br/> <strong> Combat sentient enemies of varying species and sizes - all with motives  and all deadly</strong><br/><br/> <strong> Put your agile and athletic body to use as you parkour, doge, slide, fight, impale, hack, absorb and hunt your prey</strong><br/><br/> <strong> Engage in an epic True Film Noir, Cyberpunk story with other themes and culture to discover and explore along the way. Each case, small or big will reveal your true nature</strong><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-13T03:14:40", "background_image": "https://media.rawg.io/media/screenshots/0f2/0f27c385313faa3b2927e590d88679bb.jpg", "website": "http://turbulon-interactive.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Turbulon Interactive"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Turbulon Interactive"], "esrb_rating": null}