{"id": 707338, "slug": "shootvaders-the-beginning", "name": "Shootvaders: The Beginning", "name_original": "Shootvaders: The Beginning", "description": "<strong>Shootvaders: The Beginning</strong> is a modern space run shoot’em up survival game with a endless playtime.<br/><br/><br/><strong>Story:</strong><br/>   You are Captain Dorin Fischer, who was sent into space to find a planet where humans could live again. The journey won’t be easy! There are many other enemies in the universe that will prevent you from doing so. <br/>   Dorin must stay alive for as long as possible and collect alien's materials that can be used to upgrade his spaceship. The enemies become stronger and more aggressive with each wave. <br/>   To get to another planet, Dorin has to fly through space-time, which serves as a gateway between galaxies. This gate is made of crystals and he must not touch anything in this zone.<br/><br/>Good luck, Captain!<br/><br/>------------------------<br/><br/><strong>Goal:</strong><br/>You have to stay alive and reach the highest scores to be on top of the leaderboards. Shoot and survive as long as you can!! Don't leave any alien enemies alive. Upgrade your spaceship and become the captain that saved humankind.<br/><br/>------------------------<br/><br/><strong>Key Features:</strong><br/>- Challenging single-player survival missions<br/>- 2 Players Co-op on keyboard and controllers<br/>- 12 Human technology weapons<br/>- 12 Alien technology weapons<br/>- 24 Spaceships upgrades<br/>- Global and Local Leaderboards<br/>- 14 Achievements<br/>- 32 Aggressive alien waves<br/>- 8 Colorful Planets<br/>- 8 Narrow gateways<br/>- 11 Hi-tech alien spacecrafts<br/>- 8 Free flipping bonuses to advance your spacecraft<br/>- Possibility to buy more coins, stars, alien materials to update your spacecraft<br/>- Simple and Easy to Play<br/><br/>This game is Inspired by the classic arcade game the Space Invaders captured with modern visuals and design.<br/>", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2022-03-11T13:44:31", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bc46450dfd249bc78b29deb673b27e5.jpg", "website": "https://went2play.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Went2Play"], "genres": ["Action", "Shooter", "Casual", "Fighting", "Indie"], "publishers": ["Went2Play"], "esrb_rating": null}