{"id": 707428, "slug": "lupara", "name": "Lupara", "name_original": "Lupara", "description": "<p>The world of the game takes place in New York City during the 1950s around the industrial area and downtown. Of course this isn’t the typical New York that we know from history. In this world, advancements in certain technologies and industries have led New York to become a steampunk haven. With robotics and machinery much more advanced in this world, much of the culture has shifted to focusing, and in some cases worshiping the wheels of progress. Lupara is a 2D side-scrolling platformer in which the player maneuvers the character through a set of obstacles with the goal of reaching certain checkpoints. There are items scattered throughout the map on platforms that the player can reach to help their journey across the map. Obstacles such as enemies are also present and pose a challenge for the player reaching the checkpoints. Additionally the player can defeat the enemies with weapons that they pick up.</p>\n\n<p><strong>Game Controls \r\n</strong></p>\n<ul><li>Pressing the keys  “A” and “D” will allow the player to move left or right respectively across the level. \r\n</li><li>The keys “W” and “D” let the player move up or down on a climbable surface such as a chain respectively. \r\n</li><li>Pressing the Spacebar key will allow the player to jump. \r\n</li><li>Left clicking on the mouse will use the melee weapon that the player has, while holding the right button and left clicking will access the gun and fire if the player has ammunition.\r\n</li></ul>", "metacritic": null, "released": "2021-12-06", "tba": false, "updated": "2021-12-13T09:17:13", "background_image": "https://media.rawg.io/media/screenshots/ee6/ee65038436818e45815a7ba5612d7947.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Syndikit Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}