{"id": 707568, "slug": "chancefalling", "name": "ChanceFalling", "name_original": "ChanceFalling", "description": "<p>This is my submission for the Game Jam 95 chance.</p>\n<p>Some points about it:<br/></p>\n<p>1)There are no tutorials or menu, is like the first \"level\"</p>\n<p>2) The player can be moved with the left and right arrow</p>\n<p>3)The objective is to reach the end of the level.</p>\n<p>4)The player will restart the level if a bullet or a spine hit him.</p>\n<p>5)Up on the screen there is a percentage that represents the CHANCE for the player to survive, it is based on a calculation using the quantity and the distance of the bullet near him (mostly under him)</p>\n<p>5)Every N seconds the screen goes black and there is seen only the percentage, in that time the player can only trust the numbers and watch how they change when they move.<br/></p>\n<p>Rest in a platform is an idea but more time do you wait less point you will have!</p>\n<p>6) It is nearly (but not completely) impossible to receive a bullet when the player is on a platform</p>\n<p>7) Even if the player is on a platform, he isn't invincible, so he shouldn't touch the spines.</p>\n<p>8) The camera follows the player.</p>\n<p>9)At the end there is a line about the score calculated by the time that is passed.</p>\n<p>10)The trajectory of the bullets are always the same, they are not randomized.</p>\n<p>11) This is my first game jam where I develop and the first time I develop in unity, so sorry for any bug.</p>\n<p>12) I worked alone during the jam, I didn't have any team.</p>\n<p>13) About the \"graphic part\" I only did Billy (the adventurer that falls from the sky) and the spine, the link for other things is here:</p>\n<p>-Bullets : https://blackdragon1727.itch.io/fire-bullet-20</p>\n<p>-Cloud : https://kassjak.itch.io/20-clouds-pack</p>\n<p>-Texture :https://vectorpixelstar.itch.io/textures</p>\n<p>-Font: https://tinyworlds.itch.io/free-pixel-font-thaleah</p>\n<p>-Music : </p>\n\n<p>The software: Unity, Aesprite.<br/><br/>I hope you enjoy it</p>", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2021-12-13T09:50:00", "background_image": "https://media.rawg.io/media/screenshots/4ff/4ff981fbf3456d6e658021936e9f3d9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Antonio Rocco"], "genres": [], "publishers": [], "esrb_rating": null}