{"id": 707579, "slug": "sweet-dreams-nonogram", "name": "Sweet Dreams Nonogram", "name_original": "Sweet Dreams Nonogram", "description": "<p>This is a short, single-picture Nonogram/Picross/Paint-by-numbers puzzle for NES, made in a couple hours for The Honest Jam III, with the theme \"Dream\".<br/></p>\n<p>This Wikipedia article can explain the game rules better than me 😅, but basically you have to discover which cells must be painted black (you can mark as crossed the cells you are sure aren't supposed to be painted). For each Horizontal row and Vertical column you have the information of how many consecutive cells are painted black; for example, a clue \"H: 5 3\" means that in the current row, at some point there are exactly 5 contiguous black cells, then after one or more white cells on the same row there are 3 other consecutive black cells.<br/></p>\n<p>The inputs (in terms of the NES controller) are:</p><p>\n</p><ul><li><strong>D-Pad</strong>: move the cursor; can be held to move faster</li><li><strong>A button</strong>: toggles a cell between painted and clear (can be held for broader painting)</li><li><strong>B button</strong>: toggles between crossed, temporarily marked, clean (idem)</li></ul><p>On the emulator embedded on this page, use the <strong>F key</strong> for the A button and the <strong>D key</strong> for the B button; controllers can (probably) be used as well.<br/></p>\n<p>If a row/column is correctly filled, the clue will have a small check mark.<br/></p>\n<p>If you manage to solve the puzzle, I recommend scanning the picture with your phone, then the title will make sense 😁<br/></p>", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2021-12-13T09:52:51", "background_image": "https://media.rawg.io/media/screenshots/787/787c5d18f7ea68da90ddaf461cb152d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Wendel Scardua"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}