{"id": 7075, "slug": "dominant-species-for-ipad", "name": "Dominant Species for iPad", "name_original": "Dominant Species for iPad", "description": "Hi everyone! <br/><br/>Welcome to a complete remake of Dominant Species, our first iPad app. This app is a digital port of one of our best-selling games, designed by Chad Jensen. Our original attempt at an app for this game was unfortunately less-than-stellar (to be kind). We knew we could do better, and we committed to making it better. Regrettably, it took us a long time - and three different developers - to finally create this new version. But at last we have an app that we are REALLY proud of. We hope you guys will like it, too, and find it a major improvement over the original game.<br/><br/>This new app update is an entirely new game with 100% new code, so you guys are getting a completely different app from the original. We are providing it as an “updated version” because that was the only way I could figure out to make sure that the owners of the original could get the new app for free. Please accept this as our apology that the original app wasn’t better, for the time it took us to get you the new version, and as a demonstration of our determination to never leave you stuck with a game that isn’t a quality product.<br/><br/>For you players who already play the Dominant Species boardgame, this app will allow you to have fun and practice your skills anytime, against a mix of human and computer AI opponents.  <br/><br/>For those of you who are unfamiliar with the boardgame, we provide context-sensitive explanations and a set of online rules to help you learn the game and get started quickly. You can also get help from us directly, via our Facebook page - which we are revamping to support the new version - at http://www.facebook.com/pages/Dominant-Species-for-iPad/320893411343198. If you want to learn more strategy or have questions about general game play (not app-related), feel free to ask your questions on our Dominant Species page on BoardgameGeek: https://boardgamegeek.com/boardgame/62219/dominant-species<br/><br/>Here&amp;#39;s an updated feature list. Note that we are working on an additional update which will add multi-player Game Center support.<br/><br/>Features:<br/><br/>Play against a mix of up to 5 human and/or AI opponents via Solo Play, Pass &amp;#39;N Play,  or a combination of both.<br/>A completely reworked User Interface that makes the game much easier to play<br/>New Pull-Out visual menus that provide quick access to Tile Scoring, Speciation Values, Food Chain, and Dominance Cards.<br/>All New Art from the new version of the boardgames<br/>AI players that are greatly improved from the original version.<br/>A new Undo feature<br/>Autosave and Resume Game<br/>Pinch to zoom and scroll<br/>Context-sensitive help<br/>Color-coded dominance tracking<br/><br/><br/>Finally, I want to personally thank all the great folks at GameTheory, who rewrote the entire app and gave us a product to be proud of. I also want to thank the people who volunteered to help us test Dominant Species, caught many bugs, and gave us great suggestions throughout. You guys did terrific work - thanks!<br/><br/>OK, enough talk. It’s time to play. Enjoy the game!<br/><br/>- Gene", "metacritic": null, "released": "2012-10-17", "tba": false, "updated": "2019-10-22T14:29:10", "background_image": "https://media.rawg.io/media/screenshots/4bc/4bc8f00714d73d61b6acb0629c80481a.jpeg", "website": "http://www.gmtgames.com/p-387-dominant-species-4th-printing.aspx", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GMT Games"], "genres": ["Strategy", "Board Games"], "publishers": ["GMT Games"], "esrb_rating": "Everyone 10+"}