{"id": 70765, "slug": "wild-cherry-slots-vegas-tour", "name": "Wild Cherry Slots: Vegas Tour", "name_original": "Wild Cherry Slots: Vegas Tour", "description": "Wild Cherry Slots has your favorite Vegas slot machines in a feature packed free slots game!<br/><br/>Experience fun challenges and quests! Match collectible stickers onto Quest cards to get great rewards, such as extra coins, high value gems and rare stickers to collect!  Warning, completing quests is highly addictive! You get chests every 20 spins, with free coins and collectible stickers! <br/><br/>No-internet and No-wifi required to play on your iPhone or iPad!<br/><br/>Social Slots: Pick your name and avatar and compete with friends on the leaderboard to win the highest trophy! Win great prizes for being in the top 10 and advance to the next stage!<br/><br/>Play Wild Cherry Slots games free with bonus features and experience the highest quality graphics and sound slot machines.  Enjoy classic 777 and modern video slots with Superstacked Symbols and Expanding Wilds! Our hot Vegas slots game offers amazing Vegas Casino Slots with exciting themes and fun bonus games that let you win extra Free Spins with Multipliers!<br/><br/>- SLOTS machine games with the best HD GRAPHICS<br/>- Great selection of fun 5-reel video and classic 3-reel slot machines including Las Vegas casino slots favorites and original themes.<br/><br/>In 2018, it's a new era where lots like Wild Cherry Slots Vegas Casino Slots are not just an online casino game. There are many more of the favorite slot machine features you've come to expect from true Las Vegas slots, made by Tap Slots, a real Las Vegas casino slots company. <br/><br/>Not only will you experience incredible slot machine features, you’ll get to play fun slots games free, with many options to get free coins!  Collect Bonus coins and Free coins! Claim your free 50,000 bonus coins! Watch videos to earn free coins! Get free coins when you refer friends!<br/><br/>Our best slots favorites are Dragon Slots, 77 Wild Double and 777 Wild Triple Slots, Tiki Treasures, Cleopatra Slots, and of course we  \"heart\" Vegas slots such as Vegas Wilds. <br/><br/>Lovers of Asian slots will find two Asian slot machines, Golden Dragons and Secret Lotus! It's a whole new era of classic and new casino slots that will provide an infinity of fun and magic with great payouts, free spins and bonus games! Are you ready to become a slots billionaire?<br/><br/>- Do you like to pop balloons? Tap on the cherry bubbles for extra prizes!<br/>- Do you like jigsaw puzzles? Our slots app has a great jigsaw puzzle to try!<br/>- Do you like to read chat stories? We have a great Vegas story for you to read, you'll get hooked!<br/><br/>Disclaimer:<br/>- The games are intended for an adult audience.<br/>- The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>- Practice or success at social casino gaming does not imply future success at \"real money gambling.", "metacritic": null, "released": "2017-05-19", "tba": false, "updated": "2019-10-22T14:26:22", "background_image": "https://media.rawg.io/media/screenshots/75a/75a92e634777203371dd304997d5ddf5.jpg", "website": "http://www.tapslots.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tap Slots"], "genres": ["Card"], "publishers": ["Tap Slots"], "esrb_rating": "Teen"}