{"id": 7077, "slug": "macguffins-curse-lite", "name": "MacGuffin's Curse Lite", "name_original": "MacGuffin's Curse Lite", "description": "Get instantly addicted to this stunning werewolf comedy puzzle-adventure - for FREE! Gadget.com - \"A near perfect experience for players of all ages.\" Voted TouchArcade Game of the Week! App-Shack (4.5/5) - \"Fans of the genre or tongue-in-cheek humor won’t want to pass up.\" Apple'n'Apps (4.5/5) - \"One of the best adventure games in the App Store.\" AppSmile (4.5/5) - \"Interesting storyline, tons of levels, simple controls, and cool artwork.\" Winner of the 'Best Game Writing Award' at the Freeplay independent Games Festival!<br/><br/>When desperate thief Lucas MacGuffin bungles a museum robbery, he finds himself bound to a mysterious ancient amulet. Using its powers to transform between man and wolf, he must sneak and smash his way through a mind-bending series of puzzles, bring down a terrifying criminal mastermind, and hardest of all, convince his daughter it isn't funny to fill the fridge with dog food. With charming hand-drawn art, an eccentric cast of characters and insanely catchy music, players everywhere will be touched by MacGuffin's heartfelt, relatable struggle to stay away from fire hydrants.<br/><br/>TRANSFORM FROM HUMAN TO WEREWOLF! Use the dexterity of a human and the brute force of a well-intentioned werewolf! Each character has their own unique skills, which can solve an inventive array of logical challenges in the style of much-loved hit adventure games.<br/><br/>QUICK-WITTED COMEDY: Play through a compelling story brimming with humor, personality and heart featuring dialogue straight from the golden age of adventure games.<br/><br/>A RICH, COMPELLING WORLD! Explore the surreal nightlife of an ancient carnival city in hi-tech lockdown inhabited by a huge cast of hilarious, well-developed characters, all masterfully created with unique hand-drawn art.<br/><br/>FUN, IMMERSIVE SOUNDTRACK - Destined to have you humming - or howling - along!<br/><br/>PLENTY OF AWESOME UNLOCKABLE CONTENT: Comics, post-game challenges, Easter Eggs and developers' commentary are all hidden throughout the game, meaning you’ll keep coming back long after the credits roll!<br/><br/>INTEGRATED HELP SYSTEM - Task tracking ensures you can focus on enjoying the game free of stress.", "metacritic": null, "released": "2012-04-19", "tba": false, "updated": "2019-10-22T14:29:10", "background_image": "https://media.rawg.io/media/screenshots/5cc/5cc733e440fb0c1f42b6bf87c430139f.jpeg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ayopa Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Ayopa Games"], "esrb_rating": null}