{"id": 708034, "slug": "it201_project4_jennifer_medrano", "name": "IT201_Project4_Jennifer_Medrano", "name_original": "IT201_Project4_Jennifer_Medrano", "description": "<p>This project is a beta game for \"avoid the enemies\". The player must avoid all enemies in green. The player is slow and sensitive to the sun. He/she will be able to create temporary clouds as protection. These clouds will auto-delete after 4 seconds. The user will also be able to change the color of the clouds and they will be able to see the position of the mouse at all times. The play can also rotate the sun as fast as possible to create fire to destroy the enemies at once (This will be introduced later on).  The player’s life is visible by default and can be hidden by pressing the letter ‘h’ on the keyboard. The player can also create stars in the sky for aid purposes by pressing the letter ‘w’ on the keyboard. The Time is also integrated into the game and music is plays in the background to calm the player. In addition, the enemies now have two modes to them (easy and hard) which the player can control with their input ‘0’ (hard mode)and ‘1’ (easy mode). Also, to add suspense, the floor is able to rotate and the player is able to manipulate the speed of rotation by using a slider. There is a spotlight to increase players' visibility and they are able to change between white light to disco light using the ‘2’ and ‘3’ keys. Lastly, there is a cheat code dropdown menu displaying a list of cheat codes. </p>\n\n<p>NOTE: Alignment has been fixed.</p>", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2021-12-13T11:39:35", "background_image": "https://media.rawg.io/media/screenshots/dcc/dcc5cdb46cabf4bac698a6859286b88d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jm42"], "genres": [], "publishers": [], "esrb_rating": null}