{"id": 70812, "slug": "pokerstars-free-online-poker", "name": "PokerStars Free Online Poker", "name_original": "PokerStars Free Online Poker", "description": "PokerStars LITE allows you play poker with millions of real players, on the most fun and exciting poker app out there. Join today to get 35000 chips as a welcome bonus.<br/><br/>Whether you want to compete for huge prizes in our multi-table tournaments or prefer playing heads-up games, PokerStars offers any poker game available.<br/><br/>PokerStars LITE lets you:<br/><br/>PLAY POKER ONLINE WITH MILLIONS OF REAL PLAYERS<br/>~ Play online poker games with the world’s largest community of real poker players. Join the biggest and best online poker games and Texas Hold'em tournaments, and enjoy promotions you won’t find anywhere else. Refill your stack with 15000 FREE chips every 4 hours.<br/><br/>PLAY ANY OF THE CLASSIC POKER GAMES<br/>~ Whether it's Texas Hold‘em, Omaha, or Stud, PokerStars offers the widest selection of games anywhere online. Our huge player pool means you can play any game at any time, without having to wait around for an opponent.<br/><br/>TRY OUR INNOVATIVE NEW POKER GAMES<br/>~ PokerStars is always looking to innovate and find fun new ways to enjoy the game of poker.<br/>•\tSpin &amp; Go’s - the high-speed Sit &amp; Go format where you can win up to 2000 times more in minutes!<br/>•\tPower Up – combine traditional No Limit Holdem with powers that give you an ability to destroy a card on the board or changing your hole cards<br/>•\tGet bounties for elimination your opponents in Knockout Poker!<br/>•\tZoom - Our fast-paced poker game format with no waiting!<br/><br/>WIN BIG IN MINUTES WITH SPIN &amp; GO GAMES <br/>~ Will you win up to 20 Billion chips in our unique three-player tournament format? Download the app now to find out!<br/><br/>MORE FEATURES THAN ANY OTHER POKER APP<br/>~ We’ve made sure PokerStars LITE offers the smoothest functionality to make your mobile poker experience fun and easy, including:<br/><br/>•\tChallenges – win big when achieving goals &amp; performing exciting poker tasks<br/>•\tLeaderboards – compete with other players to be the best and win huge rewards<br/>•\tRegular chip deals – get incredible value when refilling your stack<br/>•\tMulti-table functionality – play ring games and tournaments simultaneously on your mobile or tablet device <br/>•\tTable chat<br/>•\tA built-in Contact Support Form, with Support available 24/7!<br/><br/>Make sure you accept push notifications when you download our mobile poker app.<br/><br/>Join the biggest poker community and connect with poker players from around the world. Connect with us on social media:<br/>https://www.facebook.com/PokerStarsFreePlay/<br/><br/>Find out more about us by visiting our site:<br/>https://www.pokerstars.net/about/<br/>https://www.pokerstars.net/poker/room/tos/<br/><br/>You must be at least 18-years-old, and of the legal age of majority in your jurisdiction, to create a Stars Account.", "metacritic": null, "released": "2013-04-04", "tba": false, "updated": "2019-07-29T13:16:52", "background_image": "https://media.rawg.io/media/screenshots/656/656fe1d00a82bf1696fd2d3949aade63_8qoZiq2.jpg", "website": "http://www.pokerstars.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stars Mobile"], "genres": [], "publishers": ["Stars Mobile"], "esrb_rating": "Mature"}