{"id": 708117, "slug": "pmuj", "name": "PMUJ", "name_original": "PMUJ", "description": "<p><strong>PMUJ </strong>is a short platformer where you must use your upside-down-jump ability to complete 8 challenging levels.</p>\n\n<p><strong>Controls:</strong></p>\n<ul><li>A/D to move</li><li>Space to jump</li><li>Space mid-air to pmuj</li></ul>\n\n<p>This game was made in 8~ hours for <strong>tri-jam 149</strong>, I made all of the assets used in the game during the jam, and I used Pygame instead of an engine.</p>\n<p>I ended up dealing with a major collision bug for about an hour, and by the time I fixed it my time was up. And I had no clue how long it would take to finish the game and if I'd even submit it to the jam, after that I shifted my mindset from making a game in time, to making a finished game so hopefully it stands up in that regard, I definitely didn't come close to 3 hours though (maybe next time).</p>\n<p>Also thank you to my friend for playtesting this! (I'm not sure how they'd like to be credited so I'll update this later)</p>\n\n<p><strong>One final note!</strong> The levels are stored in .txt files which should be easily editable if you'd like to make your own levels. The only requirements are that the level(s) use the same file name(s) as one of the levels in the base game (keep in mind the game will crash if it tries to find a level that doesn't exist), and that the rows and columns have a consistent width/height.</p>\n<p>Tile codes:</p>\n<p>1: ground/wall, 2: floor spike, 3: ceiling spike, 4: extra pmuj pickup, 5: player spawn, 6: flag</p>\n<p>Any other character is air (I usually use 0 though)</p>", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2021-12-13T12:02:43", "background_image": "https://media.rawg.io/media/screenshots/288/2885eddb153cdee87d743b6b97a05b18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GlerG"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}