{"id": 708267, "slug": "dungeon-runner-xz", "name": "Dungeon Runner XZ", "name_original": "Dungeon Runner XZ", "description": "Dungeon Runner XZ is an RPG dungeon crawler game focused on single-player grinding to be the best and fastest dungeon runner. <br/><br/>After its release, we plan to update the whole year with new small and big updates that will make the world much bigger. And a lot of new mechanics that will come to the game in the upcoming year after the release.<br/><br/>As you all can see I'm using RPG Maker MZ, why use this development program than the other ones out there. <br/><br/>There is a good reason because this program is so powerful with what you can do with it and I want to show the world, it's the best program for the type of game I want to create a 2D game in the old school type that people will enjoy for years to come.<br/><br/>Dungeon Runner is based in a Hub city's and from there you will choose your quests and dungeon runs. There will be a lot of Game mechanics when the game is released.<br/><br/><ul><li>Quest System<br/></li><li>Party System <br/></li><li>Class change system<br/></li><li>Fast pace interacting Battle system<br/></li><li>AI Monster system</li></ul> <br/>Special Weapon and armor Craft System, The game will also have a special craft system that will LVL per craft even after Max LVL this will mostly be used in the postgame.<br/><br/>And much More!", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2022-02-25T03:38:46", "background_image": "https://media.rawg.io/media/screenshots/2c9/2c925effa3ac34c538d708bd0b4ac8a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["CH-Gaming Studio", "CE Game Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["CH-Gaming Studio"], "esrb_rating": null}