{"id": 708329, "slug": "sanal-laboratuvar-ayirma-yontem-ve-teknikleri", "name": "Sanal Laboratuvar Ayırma Yöntem ve Teknikleri", "name_original": "Sanal Laboratuvar Ayırma Yöntem ve Teknikleri", "description": "Sanal laboratuvarlar nedir ?\r\n<p>Sanal laboratuvarlar: Pahalı, tehlikeli ve fiziksel mekan isteyen laboratuvar ortamlarının sanallaştırılmış halidir. Sanal laboratuvarlar fırsat eşitliğine yardımcı, öğrenci motivasyonunu destekleyen öğelerdir.</p>\r\nProje nedir ?\r\n<p>Bu bir 10.sınıf Ayırma yöntem ve Teknikleri konusunu ve Titrasyon gibi içerikleri kapsayan bir fps, fizik tabanlı, eğitici simülasyon veya Kimya üzerine ciddi oyun denebilir. Bu proje K-12 Kimya eğitiminde pekiştirme, yaparak öğrenme, bilişsel yapıyı destekleyici, buluş yoluyla da uyumlu bir yapısı vardır. Amacı: Gelişen güncel teknolojilerinin eğitimin alanında kullanılmasının sağlamak.</p>\r\nNe yapabiliriz?\r\n<p>Giriş kısmında sizi anket karşılamaktadır burada sizin tutumunuzu ve önceki bilgilerinizi ölçmektedir. Laboratuvara girdiğinizde A,S,W,D tuşlarınızla hareket, Mouse ile kameranın yönünü değiştirebilirsiniz. Sol tık ile etkileşime geçebilmektesiniz. 7 Deneyin her birinde ilgili masaya yaklaşınca kullanabileceğiniz tuşlar görünmektedir. Diğer laboratuvarda: Süzme deney setini kurabilirsiniz ve rastgele numune alabilirsiniz. Titrasyon düzeneyi modüler olarak kurabilirsiniz, ilgili bileşenlerini masadan seçip ekleyebiliyorsunuz. İlgili kısımlar seçtiğiniz düzenekte yazmaktadır. Kurulumu tamamladığınızda titrasyonu erlen ile yapabilirsiniz bunu yaparken huniye odaklanıp \"F\" tuşuna basılı tuttuğunuzda işlemi gerçekleştirip, deneyi yapabilirsiniz.</p>\r\nKimsin ?\r\n<p>Benim adım Alpay, Kimya öğretmenliği mezunuyum LinkedIn hesabıma bakabilirsiniz. Aynı zamanda oyun geliştiricisiyim uzun süredir oyun geliştirmenin farklı alanlarında çalıştım, pek çok program kullandım şuan aktif olarak Unreal engine ve Blender kullanıyorum. Portfolyoma bakabilirsiniz. Ayrıca bir oyun geliştirici topluluğum var, burada oyun geliştirmenin farklı alanlarıyla ilgilenen insanlar buluşuyorlar.</p>", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2021-12-13T12:53:46", "background_image": "https://media.rawg.io/media/screenshots/099/0999cca68ec72d26b826da5c30876dc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WhiteDodecahedron"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}