{"id": 708583, "slug": "zombie-reform", "name": "Zombie Reform", "name_original": "Zombie Reform", "description": "<p>Zombie Reform is a 3D zombie shooter survival game. It is a game that has a level system, and the zombies get stronger at each level. There are 6 different maps, and these maps change every 12 levels. Before each level change, there is a \"FULL BOSS\" battle. All zombies are extremely powerful, and you have to destroy them to move to the new map.</p>\n<p>There are 4 heroes; 3 of these heroes can be purchased. There is a \"daily ranking table\" calculated at the end of the day with the \"player daily XP\" points you get at the end of the level. You can buy new characters with the \"GOLD\" you earn as a result of this ranking table. This \"daily ranking table\" is refreshed daily. There are 15 weapons, and these weapons can be purchased and upgraded with in-game currency. Powerful weapons are required to destroy powerful zombies. You can also blow up zombies with the \"Bazooka\".\r\n</p>\n<p>Enter the rating in the \"daily ranking table\" with the \"daily XP\"s you have obtained. Buy new heroes with the \"Gold\" that you get in this table, which is reset every day.\r\n</p>\r\nFeatures\r\n<ul><li>Third Person Shooter and First Person Shooter gameplay\r\n</li><li>Leaderboard system- Achievements\r\n</li><li>72 Levels\r\n</li><li>6 Maps\r\n</li><li>15 weapons\r\n</li><li>4 Heroes\r\n</li><li>Realistic graphics\r\n</li><li>Realistic \"Third Person Shooter\" and \"First Person Shooter\" physics\r\n</li></ul>", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-13T14:00:02", "background_image": "https://media.rawg.io/media/screenshots/454/454965560f2a529a4cb679ae5bf50e9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AYN Games"], "genres": ["Action", "Shooter", "Fighting"], "publishers": [], "esrb_rating": null}