{"id": 708765, "slug": "bobobo-vs-metools", "name": "BOBOBO VS. MeTools!", "name_original": "BOBOBO VS. MeTools!", "description": "<p>You incarne BOBOBÓ agaisnt hordes of MeTools! Dont let them grow big or you'll lose!</p>\n<p><strong>Instructions:</strong><br/></p>\n<p>In this game you have to fight your way to the top score by erasing MeTools and lasting days alive in this small world:</p>\n<ul><li>MeTools will be ramdomly generated across the map, you can have a count of how many of them are alive by looking to the right down corner of the uy.  Also they will generate a bit quicker for each MeTool previusly erased! Game tends to go faster! If 20 MeTools gather together, number 21 will loose you the game!</li><li>Background ressembles gba pokemon landscape to silumate day/night!</li><li>You can control BOBOBÓ using [A] and [D] to move, [Space] to jump, [S] to crouch (what activates the proyectile void), and [K] to attack. You can combine [S]+[K] or [A/D]+[K] to produce different moves!</li><li>Your health will be displayed in center bottom of the screen, along with your energy! Refuel your energy feeding on enemy bolts (using the proyectile void), and use it to exchange it for health in the random-spawning palm trees, or to release a powerful blast shot for half of your maximum mana, using [L]!</li><li>You can see a count of how many days have pass, you will see the count of how many you killed when you die! Would you set the maximum score?</li></ul>\n<p>This is entirely up to you, but BOBOBÓ would have done it!</p><p>PS: I made this game 4 years ago, using a C framework (very limited) provided by the UM University, as a part of a degree subject.</p>", "metacritic": null, "released": "2021-12-10", "tba": false, "updated": "2021-12-13T14:47:03", "background_image": "https://media.rawg.io/media/screenshots/75e/75e70544c4cf52113ce075aacb837ddb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kenkeh"], "genres": ["Action"], "publishers": [], "esrb_rating": null}