{"id": 708978, "slug": "partition-sector", "name": "Partition Sector", "name_original": "Partition Sector", "description": "Blow up your friends – and snakes – in this Bomberman-like multiplayer action game. 7 game modes including Battle Royale, Capture the Flag, King of the Hill, Snake Hunter and EVERYTHING! Up to 20 players in local multiplayer, with online play via Steam Remote Play Together - only one copy of the game needed!<br/><br/><br/><br/>\"Bomberman clone with awful graphics but good gameplay and some really nice ideas\" -- from review by Steam curator SvenEvil's Playground<br/><br/><strong>Features</strong><br/><ul><li>Snakes!<br/></li><li>7 game modes:<br/><ul><li>Classic<br/> </li><li>Deathmatch<br/> </li><li>Capture the Flag<br/> </li><li>Battle Royale (team)<br/> </li><li>King of the Hill<br/> </li><li>Snake Hunter (co-op against the AI)<br/> </li><li>EVERYTHING - all the other game modes at once!</li></ul></li><li>Many powerups, including: Snake, Ultrabomb, Rocket Launcher, Flamethrower, Remote Control, Detonator, Annhiliator, Strength, Shield, Ghost<br/></li><li>In-game auctions - collect coins and bid on powerups<br/></li><li>Up to 20 players in local multiplayer - up to 16 with controllers, up to 4 on keyboard. (***See note below if you wish to use 5 or more Xbox controllers***)<br/></li><li>Online play via Steam Remote Play Together - only one player needs to own the game! Quad-core CPU and 30Mbps of bandwidth per remote PC recommended<br/></li><li>Wide variety of level sizes and game customization options<br/></li><li>Watch replays of previous games<br/></li><li>Accessibility options - customize player, team, bomb and background colors; show outlines around players; change ghost opacity; run in slow motion (quarter, half or three quarter speed)<br/></li><li>Unlock cat photos and stupid drawings<br/></li><li>Soundtrack by .mpegasus<br/></li><li>Includes additional arena size options for ultrawide 21:9 displays</li></ul><br/>Note: if you wish to use 5 or more Xbox controllers on the same PC, this requires \"Xbox Configuration Support\" and \"Extended Xbox Feature Support\" to be enabled within Steam's \"General Controller Settings\".<br/><br/>Controllers supported: Xbox (all models), PS4, PS3, Switch Pro, generic (DirectInput).", "metacritic": null, "released": "2021-01-28", "tba": false, "updated": "2023-11-04T17:31:52", "background_image": "https://media.rawg.io/media/screenshots/290/290f753779dfcb63be43932d36971d02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["arganoid", "Arganoid Industries"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Arganoid Industries"], "esrb_rating": null}