{"id": 708945, "slug": "mouse-hero-itch", "name": "Mouse Hero (itch)", "name_original": "Mouse Hero (itch)", "description": "<p>This is an advunture you must get over with ...with mouse!<br/></p>\n<p>A hero has commited to conquer this gigantic and tough mountain. With the bliss of gods of forest, this hero got his superpower... You! You are to navigate the hero with your mouse, through narrow path and dangerous cliff, helping him up to the top!</p>\n\r\nPunishing yet Rewarding Experience\r\n<p>In mouse hero, you are doomed to experience difficulties. Every mistake you make hurts you hard! But when you conquered this game, the feeling is rewarding. Learn from mistakes and try again! With every attempts you make, our hero gets closer to the goal.</p>\r\nSpecial and Innovating control\r\n<p>Unplug your keyboard and console! You don't need that anymore, cuz this game can be played with only mouse! Explore this world with this new control scheme. Don't worry, we will prepared with handy tool and assist mode to help you if you find this scheme difficult to get familiar.(in-development)</p>\r\nStorytelling via Dialogues\r\n<p>Our hero will tell you the story about this mountain through dialogues. And he will get angry when he failes multiple times and get happy when he successfully elevated to higher stages.</p>\r\nConstantly Growing World\r\n<p>Game remains in-development before we consider it as completed. And while this game is still under development, more versalite world and levels will be added into the game for you to experience.</p>\r\nHelp with Education on Game Dev\r\n<p>This game is an assignment of Game Prototyping Course. A huge thank to my teacher who has studied Game Design in New York for 4 years and is inspring when it comes to teach me on how to make a great game prototype. However, learning game design is expensive, and by donating you can help me better continue my journey. </p>\r\nCredit\r\n<p>https://kauzz.itch.io/kpf Pixel Valley</p>\n<p>https://rvros.itch.io/animated-pixel-hero Animated Pixel Adventurer</p>\n\n\n<p>BE ADVISED! THIS GAME IS STILL IN DEVELOPMENT. SOME OF THE IN-GAME TEXT IS NOT FULLY TRANSLATED INTO ENGLISH.<br/></p>", "metacritic": null, "released": "2021-12-10", "tba": false, "updated": "2021-12-13T15:33:22", "background_image": "https://media.rawg.io/media/screenshots/1b5/1b571134e22d8147abdf24c202679453.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["BPCapsule"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}