{"id": 708989, "slug": "scrapland-remastered", "name": "Scrapland Remastered", "name_original": "Scrapland Remastered", "description": "<p>Scrapland is a third-person action-adventure set in a distant future on Earth. In that future, only robots remain on the planet, and they consider humans to be the monsters that nightmares are made of. You will play D-Tritus, a new arrival who will investigate the brutal murders committed by a viscous being, a disgusting human on the loose in the city of robots.</p>\n<p>Dive into this fun journey and discover the origins of MercurySteam, the studio behind Metroid Dread and Metroid: Samus Returns, Castlevania: Lords of Shadow and Spacelords.</p>\n<p>Hack the system! Control 15 different characters, each with quirky personalities and abilities that will put your skill and sense of humor to the test.<br />\nFind the human murderer who has infiltrated the world of the robots and end his criminal career, if you can complete the game&#39;s 140+ missions.<br />\nPatrol the city with your favorite combat ship: Speed, fire power, countermeasures, maneuverability, resistance... You can have it all, if you put in the effort.<br />\nS A V A G E Multiplayer mode: An intense combination of races and battles still unmatched in the genre. Create your games or join others, on a local network or online.<br />\nRemastered content. This version has been improved with high-resolution modes, dedicated servers and revised network code, full gamepad support, in-game improvements, achievements and Steam Cloud support.</p>", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2022-12-19T10:55:04", "background_image": "https://media.rawg.io/media/games/4ab/4ab8d55998deda6998b37fad653a90aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 15, "beaten": 2, "toplay": 5, "dropped": 1}, "playtime": 19, "achievements_count": 7, "ratings_count": 3, "suggestions_count": 558, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Mercury Steam Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["MercurySteam", "Mercury Steam Entertainment"], "esrb_rating": "Teen"}