{"id": 709013, "slug": "phoenix-hope", "name": "Phoenix Hope", "name_original": "Phoenix Hope", "description": "Your lands were burned to the ground... Unknown, terrifying creatures poured out of portals that opened across the land, destroying everything in their path. The people were shattered, divided, but not devoid of hope! Stand at the head of a nation of Phoenix -  a new State of people. Your goal is to restore humanity, rebuild settlements, protect them from night demon raids, get mythical underground crystals, and destroy the uninvited enemy forever!<br/><br/>Phoenix Hope is a 2D real-time, side-view strategy game in which you must develop your colony during the day and repel waves of monsters at night.<br/><br/><strong>Key Features:</strong><br/><ul><li>Indirect control of people - You give orders and control the gathering points of the warrior squads, and the citizens of your settlement go to work or defend themselves.<br/></li><li>Hope zone - The defense of your village depends on a special zone in which enemy portals cannot appear. This zone changes dynamically depending on the level of hope of your settlers.<br/></li><li>Resources management - You have a large number of different resources and tools at your disposal, which you must produce and distribute according to your needs.<br/></li><li>Scientists Tower - Use the souls of defeated demons to unlock new upgrades for your settlement and warriors.<br/></li><li>Global map - Send your men on expeditions outside your village to find resources, new people, and enhancements for the crystal that give buffs to your settlement.<br/></li><li>Detailed, lovingly drawn pixel 2D graphics.</li></ul><br/>", "metacritic": null, "released": "2021-12-14", "tba": false, "updated": "2021-12-17T03:06:40", "background_image": "https://media.rawg.io/media/screenshots/dec/deceae069bafa783492feb57f7f88868.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 12, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 381, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Honorable Pixel"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Honorable Pixel"], "esrb_rating": null}