{"id": 709036, "slug": "pipeline-vr", "name": "Pipeline VR", "name_original": "Pipeline VR", "description": "Pipeline VR is a hectic virtual reality <strong> puzzle game,</strong> that pits you against a rising tide of torrential water. With the residents of Pipesville in desperate need of plumbers, can <strong>YOU</strong> solve their plumbing emergencies?<br/><br/>Connect pipes using handy-o-matic magnetism, allowing you to build elaborate, messy mazes of pipes with satisfying ease, but keep an eye on that pressure or you could find yourself in hot water.<br/><br/>Don't panic, you're not technically <strong> against the clock.</strong> Just against the impending doom of water rapidly filling the room... Okay, time to panic a little! With Virtual Reality you really do need to keep your head above water to complete the job. It feels so real you could swear you feel the water dripping down your leg. Oh that's not w-... never mind.<br/><br/>Travel to <strong> multiple locations,</strong> each with it's own hazards and randomly generated pipes, ensuring each visit is different from the last.<br/><br/><br/><strong> Play in four modes:</strong> <br/><ul><li> Normal: Connect pipes before the water fills the room. Your standard plumbing fare.<br/></li><li> Free-mode: Take your time to build elaborate pipelines without that pesky water rushing your masterpiece.<br/></li><li> Blackout: Love plumbing? Afraid of the Dark? Well I have good news and bad news. Complete pipelines in total darkness with only a torch to aid you.<br/></li><li> Tower: Every time you complete a room, a new, more difficult one, opens above you. How many rooms can you climb before the ever increasing water catches up with you?</li></ul><br/>Will you be flushed with success, or will your career go down the toilet bowl!", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2021-12-17T03:21:26", "background_image": "https://media.rawg.io/media/screenshots/3ae/3ae6459e8d4271f9a94b37f24b63c1aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Everwake Games"], "genres": ["Casual", "Indie"], "publishers": ["Everwake Games"], "esrb_rating": null}