{"id": 709065, "slug": "shikkoku-no-sharnoth", "name": "Shikkoku no Sharnoth", "name_original": "Shikkoku no Sharnoth", "description": "Shikkoku no Sharnoth: What a Beautiful Tomorrow is a Japanese adult visual novel developed by Liar-soft. Shikkoku no Sharnoth is Liar-soft's 24th game. The game is described as a \"steampunk horror ADV\" (スチームパンク ホラーADV, suchiimupanku horaa ADV). <br/>The game includes references to the works of H.P. Lovecraft including mention of Kadath and having a character called 'Howard Phillips'.<h3>Gameplay</h3>Shikkoku no Sharnoth's has two modes of gameplay. The first mode, like other visual novels, requires little interaction from the player as much of the player's time is spent reading the text that appears on the game's screen which represents the protagonist's thoughts or the dialogue between the different characters. The second mode occurs twice every chapter. In this mode, the player is presented with an isometric view of the protagonist and her surroundings and is tasked with guiding the protagonist to certain spots in the map while avoiding the monsters in the area in a turn-based system. This secondary gameplay feature is rather unique to Shikkoku no Sharnoth as the player's interaction with a visual novel is usually isolated to the graphics and audio.<h3>Plot</h3>Shikkoku no Sharnoth is set in 1905 and takes place in London.<br/>The player assumes the role of Mary Clarissa Christie, the protagonist of Shikkoku no Sharnoth. Mary has heterochromia eyes, her right eye is gold while her left eye is blue. She originally had blue eyes but her right eye changed colours one year prior to the game's events and she has been seeing strange visions since.", "metacritic": null, "released": "2021-12-14", "tba": false, "updated": "2021-12-17T03:40:17", "background_image": "https://media.rawg.io/media/screenshots/ab9/ab983bd652eb932100654dce199c1543.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 406, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Liar-soft"], "genres": ["Adventure"], "publishers": ["iMoe Games"], "esrb_rating": null}