{"id": 709052, "slug": "void-heart", "name": "Void Heart", "name_original": "Void Heart", "description": "On a distant planet called Onnet, unknown to humanity, there were a people who, even with more advanced technologies, lived in peace for many years. But a dark cloud arrived and brought with it a mysterious giant ship releasing its killing machines with an order to eliminate the entire population of the plant. Onlyver, a military man killed in battle against the machines, is resurrected by a medical robot and given the chance to avenge his people.<br/>\n<br/>\r\nInspired by games like ScourgeBringer, Dead Cells, Nuclear Throne, Void Heart follows the Rogue-Lite style where your death is permanent and no checkpoints.<br/>\n<br/>\r\n&gt;Clear all the rooms on each map to collect items that give you special abilities.<br/>\r\n&gt;Rare items can be purchased in stores hidden around the map.<br/>\r\n&gt;Slaughtered enemies leave experience points to level up your character.<br/>\r\n&gt;Every level you gain, one level point is added and can be used to improve your character.<br/>\r\n&gt;The character can equip up to 3 weapons, automatic pistol, machine gun and shotgun.<br/>\r\n&gt;Weapon parts that improve damage, reload capacity, and firing rate can be collected in chests and purchased in stores.<br/>\r\n&gt;Sword-equipped robots can be bought in stores and will help you in battle against the machines.<br/>\r\n&gt;Defeat the bosses in each area, being a mini boss and a bigger and more powerful boss, to go to the next level.<br/>\r\n&gt;If you die, you will lose your items and weapon upgrades and will only get experience points, level points and current level.  <br/>\n<br/>\r\nVoid Heart is under development and a lot of cool stuff is still to come.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-17T03:31:28", "background_image": "https://media.rawg.io/media/screenshots/36e/36edd6a1746e7e50672d02519b66be30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["André Bertolazzi"], "genres": ["Action", "RPG", "Indie"], "publishers": ["cg-imagine"], "esrb_rating": null}