{"id": 709181, "slug": "headquarters-world-war-ii", "name": "Headquarters World War II", "name_original": "Headquarters World War II", "description": "HeadQuarters World War II is a fast paced turn-based strategy covering the Battle of Normandy in the three plot-driven campaigns and a number of skirmishes. Choose your side, form your force, assign heroes, level up your units, and use Headquarters skills to overcome the enemy. <br/>\n<br/>\nFace a real tactical challenge<br/>\nThe game's combat system is based on an easy to learn - hard to master approach. Deceptively easy at a first glance, it offers lots of possibilities:\n<ul>\n<li>Units have front/side/back/top armor and their positioning matters a lot</li>\n<li>Fences and other obstacles offer a directional cover that depends on the angle of attack</li>\n<li>Different terrain types offer various bonuses and affect Line of Sight</li>\n<li>Destroyed vehicles and other large objects affect the battlefield and provide cover</li>\n<li>High Ground mechanics allow multiple levels of terrain elevation that affect Line of Sight and combat effectiveness</li>\n<li>Destructible buildings with different stages of demolition create unique challenges</li>\n</ul>\nEnjoy the striking visuals<br/>\nAll units and scenery are created with the finest attention to detail using Unreal Engine 4 to achieve a very realistic visual style:\n<ul>\n<li>Realistic unit models with proper physics in place</li>\n<li>Visceral elements of devastation - burning tank hulks, ruined houses, shell craters, smoke, death, and destruction. You will witness this and many other horrors of the war</li>\n<li>Varied surroundings - your troops will come across war-torn battlefields as well as peaceful villages with cattle and fields of grain. Mind your tanks - this quaint beauty is quite fragile</li>\n</ul>\nGo through numerous battles<br/>\nSee all sides of the story by completing 3 campaigns with 9 operations in each. <br/>\nThe game features United States, United Kingdom, and German campaigns all set in the Normandy landings period of the war.<br/>\n<br/>\nManage your troops<br/>\nBetween the battles, you can upgrade or change your units, level them up, and assign heroes to them, granting unique abilities<br/>\n<br/>\nKeep your crews safe<br/>\nEvery unit has a crew - and the crew is the heart of any unit. Losing different crew members results in different penalties for the unit. Losing a gunner means the unit has fewer attacks, losing a driver means the unit has reduced mobility, and so on. <br/>\n<br/>\nBe victorious in any skirmish<br/>\nTest your skills against an AI on each of the 6 skirmish maps. Different victory conditions  require versatility in your planning and tactics.<br/>\n<br/>\nProve yourself as a masterful tactician<br/>\nPlay skirmish battles against real opponents or 2x2 team battles with friends. The game supports multiplayer battles with up to 4 players both with real-time connection or using Slitherine’s CombatHQ system.<br/>\n<br/>\nPlay your own game<br/>\nUse the Editor tool to create your own skirmish/multiplayer maps and share them with the community.<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-17T04:56:17", "background_image": "https://media.rawg.io/media/screenshots/fa5/fa5b52b2010a0d95b776924a827a8a7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Starni Games"], "genres": [], "publishers": ["Slitherine"], "esrb_rating": null}