{"id": 709126, "slug": "wars-and-roses", "name": "Wars and Roses", "name_original": "Wars and Roses", "description": "<strong>This is a story of love and war.</strong><br/>Do you like military girls? Do you like tactical shooters? Do you like dating sims? Then this game is for you! <br/><br/>Wars and Roses is a one-of-a-kind intense tactical FPS where you fight battles alongside female officers and interact with those beauties in a 3D dating sim. Rescue captured officers, gain affection by dating in various scenarios to unlock unique interactions and fight side-by-side on an anti-terrorism campaign.<br/><br/>Win the war and conquer your officers' hearts.<h3>Features</h3><ul><li>An intense close-quarter tactical shooter that features sneaky AI and bullet physics.<br/><br/></li><li>Beautiful female companions who fight alongside you.<br/><br/></li><li>Date with each female companion and unlock their unique scenarios, dialog, and interactions.<br/><br/></li><li>Fight a global campaign against the terrorists on various maps and missions. <br/><br/></li><li>Earn money to improve your weapons, skills and buy gifts to impress your companions.<br/><br/></li><li>Recruit more stunning beauties by rescuing them.<br/></li></ul><br/><strong>Lore</strong><br/>Set in a modern-day military world, the all-female private military company \"Black Rose\" is established to battle a terrorist group hiding worldwide. The player is asked to join and lead the squad after the majority of its members were captured in a recent battle...<br/><br/><br/>Our mission is to redefine the FPS genre by combining two types of games into one. To reward the players with an unprecedented level of sophistication, depth, and fun.", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-04T03:23:21", "background_image": "https://media.rawg.io/media/screenshots/264/264e3baac380a49dcd70915b39c0b3d0.jpg", "website": "https://www.warsandroses.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "toplay": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 514, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Blaze Worlds"], "genres": ["Action"], "publishers": ["Blaze Worlds"], "esrb_rating": null}