{"id": 709112, "slug": "sthell", "name": "STHELL", "name_original": "STHELL", "description": "<h3>WELCOME TO STHELL!</h3><strong>STHELL</strong> will take you to a forgotten swamp that was once a test site of Kiratron Industries. <br/>Take on hundreds of machines left to rust for years, equipped with experimental weapons created by the same company decades ago.<br/>It's a battle you probably won't win, but <strong>make a stand and your resilience will be etched in their memory chips forever</strong>.<br/><br/>Inspired by the '90s classic First Person Shooters that made history, your task is simple: dodge, shoot, destroy, repeat. <strong>Those machines are heavily armed, but so you are.</strong><br/><br/>An Arena FPS that will test your limits as you try to survive a millisecond longer to <strong>climb the global leaderboard</strong> and uncover the secrets behind Kiratron Industries.<h3>STHELL is a difficult game, but no impossible at all. Don't give up after a few tries. Keep fighting, improve your combat skills and get to the the very end of the battle!</h3><br/><br/><h3>GAME FEATURES</h3><ul><li> Fast paced non stop action<br/></li><li> Tons of rusty machines to fight against<br/></li><li> Destroy cargo robots and recover new weapons to build up your loadout<br/></li><li> Uncover the secrets behind Kiratron Industries, unlocking entries in the Database<br/></li><li> Several enemies, each with their own combat style<br/></li><li> Glorious Boss Fights, to push your limits even further<br/></li><li> Survive as long as you can and climb the leaderboard: every millisecond counts!</li></ul><br/>Trailer music by Karl Casey @ White Bat Audio", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-17T04:11:07", "background_image": "https://media.rawg.io/media/screenshots/445/4455ae3d507f52892ae52c21acde1abc.jpg", "website": "https://discord.gg/ktGgHApHnx", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Claudio Catalano", "Simone Campione"], "genres": ["Action"], "publishers": ["Simone Campione, Claudio Catalano"], "esrb_rating": null}