{"id": 709182, "slug": "modern-naval-warfare", "name": "Modern Naval Warfare", "name_original": "Modern Naval Warfare", "description": "Modern Naval Warfare is the next generation naval combat simulator, which will immerse you in the dark and unforgiving world of the modern high-tech naval battlefield.<br/>\n<br/>\nKeep track of your enemies, hunt or escort convoys, undertake covert operations and unleash devastating land strikes. You will be in command of United States’ latest and most lethal Nuclear Attack Submarine the SSN-774 Virginia Class in such detail that will blow your mind. Play in cooperative mode and assign your friends, into a wide variety of highly detailed stations or face them as enemies. Choose from a wide range of weapons and play hide and seek into the underwater valleys of the South China Sea.<br/>\n<br/>\nFeatures:\n<ul>\n<li>Command: One highly detailed platform SSN-774 Virginia and more to come in the future.</li>\n<li>Control: In depth systems, weapons and sensors in a highly detailed 3D control room with VR Support.</li>\n<li>Navigate: More than a million square kilometres of highly detailed underwater and coastal environment.</li>\n<li>Explore: Dynamic world with real life weather, traffic and marine life.</li>\n<li>Experience: Lifelike environments (deep sound channel, thermal layers, bottom bounce, convergence zones, electromagnetic propagation etc.)</li>\n<li>Lead: Issue orders as the captain and let your crew (human players or AI) take care of the rest.</li>\n<li>Engage: Attack your enemies with a large array of weapons like torpedoes, mines and missiles.</li>\n<li>Multiplayer: Complete experience which includes coop multistation and VS modes.</li>\n<li>Multiplatform: Use a Windows, Linux system as the base sim and add some tablets for station screens.</li>\n</ul>", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-17T04:57:01", "background_image": "https://media.rawg.io/media/screenshots/0b6/0b6fdc7504e507e1d813c2bc695716fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["The Maslas Bros"], "genres": [], "publishers": ["Slitherine"], "esrb_rating": null}