{"id": 709285, "slug": "a-snowballs-chance-intermission-edition", "name": "A Snowball's Chance - Intermission Edition", "name_original": "A Snowball's Chance - Intermission Edition", "description": "<p><em>A game by Fallingstar Games.</em></p>\n<p>Welcome to Frostel Island! <br/>It was once a haven for the logging industry before it left and took all its business with it. Its economy hasn't been quite the same since.<br/><br/>However, on this island there is a mountain that hikers from all around come to climb at least once. It is called Trial Mountain. It's not too difficult with a good trail guide, but they often cost a pretty penny to hire.<br/><br/><br/></p>\n<p>That's where you come in.<br/><br/>Your name is Coda, and this is your first time guiding a crew of tourists up Trial Mountain.<br/>It's also your first time setting foot on Trial Mountain.<br/>You also happen to be a cold-blooded temporic who's only been able to survive in this cold climate due to your frustration-fueled fire magic.<br/><br/>...Yeah, you're probably screwed.<br/><br/>But what else can you do to escape this island? Keep working your dead-end restaurant job?<br/>Can't keep doing that forever.<br/><br/>Thanks to a little bit of encouragement from a stranger who looked a lot like that dude on your favorite bag of chips, you decided on a crazy plan: borrow the courage and ambition from your original character to do something bold enough to fund your escape from Frostel Island.<br/><br/>So now you've got a party to lead up that mountain. Maybe they'll even like your cooking; who knows?<br/><br/>---Controls---<br/>Directional keys: Standard movement<br/>PG Down/PG Up: Turn while moving<br/>Action key: Examine, Talk to others<br/>A key: Toggle HUD<br/>S key: Collect water/??? water<br/>D key: Diary hotkey<br/>ESC: Menu<br/>ALT: Screenshot<br/>F12: Pause<br/><br/>---Gameplay---<br/><br/>The gameplay is split into two parts: exploration and downtime.<br/><br/></p>\n<p>During exploration, you must guide Coda and their party up the mountain, foraging for extra food along the way. With each leg of the journey, new dangers will emerge and new challenges will need to be conquered. Choices must be made and resources must be expended. Your skills as a hiker (and leader) will be tested here.<br/><br/></p>\n<p>During downtime, Coda and the group will share some time to eat dinner and reflect upon the day's events. It's up to you to make sure that everyone gets a meal they're satisfied with. Your clients' happiness is important in this journey. Just keep in mind that one of them is vegan and the other is an obligate carnivore. But that's nothing you're not already prepared for, right?<br/><br/>---Characters---</p>\n\n<p>Coda Diamondback - Age 25<br/>Somewhat childish but always sincere and hard working. They want to see the world beyond Frostel and leave their adoptive mother behind. They love to cook and draw, but rarely gains an audience due to their lack of social skills.<br/><br/></p>\n<p>Topaz Lunabun - Age 21<br/>A local celebrity often seen on stage at the Iliana Theatre. They are extremely pacifistic and concerned about the welfare of animals to the point that they refuse to eat meat of any kind. They can be picky and at times temperamental, but be around them long enough and it's easy to understand why they are so well renowned in the theatre community.<br/><br/></p>\n<p>Vern Castaway - Age 20<br/>Topaz's closest friend and bodyguard. Having been kicked out of his home in his teenage years for his sexual orientation, he had to grow up fast on the streets. While saving Topaz from a run-in with some thugs in a back alley, he fell in love with their incredible voice and has stuck with them ever since. As a big cat at heart, he loves all sorts of meat and fish.<br/><br/></p>\n<p>Frie - Age 17<br/>Not much is known about her, being quiet and difficult to read. Rumor has it that her heart is frozen solid, even. Who is this enigma?<br/><br/></p>\n<p>Francis Tilapia - Age ???<br/>An odd fishman who's been seen near popular fishing areas. He's quite the flirt, especially with other men. Really likes to eat worms, odd as that sounds.<br/><br/></p>\n<p>Arctos Ursa - Age ???<br/>A bear. A literal grizzly bear. Approach with caution.</p>\n<p>-----</p>\n<p>This is the somewhat belated intermission chapter! In addition to the intermission, this package contains levels one and two, with a combined approximate play time of 2 and a half hours. </p>\n<p>There are a great deal of fixes and tune-ups but the most significant one is the revamped cooking system, which now uses multiple slots to store meal data. Old save files are technically usable, but may interact strangely with the equips.</p>\n<p>An option to start a new game from the intermission is also available, as it does not rely upon anything acquired during the main game.</p>\n<p>This game does not require rtp. If you don't know what rtp is, don't worry about it.</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T05:22:20", "background_image": "https://media.rawg.io/media/screenshots/b87/b8701174abaca8edd26b6a7a2cbb68d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lavendersiren"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}