{"id": 709267, "slug": "gamer-uprising", "name": "Gamer Uprising", "name_original": "Gamer Uprising", "description": "<p>This was made in NYU Game Center's Major Studio Fall class by me, @cobyhilelly, and @eia231! </p>\n<p>This game is about a gamer (named The Gamer) who is finding it hard to join a club due to his gamer status. As a result of this status, he is forced to battle the club leaders to join the club! There are two routes in the game, the musical theater route and the business route, and they both  have a good end and a bad end!</p>\n<p>All of the images (player, bosses, and backgrounds) came from Adobe Stock! Except for the battle cry, the audio doesn't belong to us!</p>\n<p>_____________________</p>\n\n<p>If you see that this is a PowerPoint file, don't be alarmed! The game was made in PowerPoint! It was made in PowerPoint to show how different programs can be used to create games or prototype a game idea even if it's not a game engine. It was also made to show how an interactive product can be made despite the engine's constraints. PowerPoint is for presentations, not games which means some things needed to be edited or added (HTML, pictures, audio, animations, and transitions) for this game  to be completed! With that being said...</p>\n<p><strong>You MUST play this game in PowerPoint!</strong> If you try to play it in Google Slides, it will be too big to convert! If you try to play it in Keynote, it may work but there would still be issues since Keynote doesn't have all the animations and transitions that PowerPoint has! If it freezes on your end, don't worry! This has over 100 slides! Try compressing the file to avoid the issue, but keep it mind it may affect the animations, audio, and transitions!</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T05:18:30", "background_image": "https://media.rawg.io/media/screenshots/179/179447690ab77f5037b13607150bab81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AshleyE113"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}