{"id": 70935, "slug": "frozen-frenzy-mania", "name": "Frozen Frenzy Mania", "name_original": "Frozen Frenzy Mania", "description": "Match ice cream treats to break through cookie walls and multiplying jellies in this delicious adventure filled with tricky obstacles. Easy to learn, but difficult to master. Get ready for weekly events, sweet prizes, and SATISFYING CHALLENGES!<br/><br/>Piper the Penguin and her friends need your help - they are hungry for ice cream! Create sweet combos to solve challenges that are guaranteed to delight your sweet tooth! Play the most challenging match-3 puzzle game in the App Store!<br/><br/>SWEET FEATURES<br/>- 800+ tasty levels with new levels added every week<br/>- 4 Game Modes that will keep you craving for more! Scoop a Super Sundae or uncover gummy fish bites<br/>- Enjoy fun events, compete in the Tasty Tournament and collect Snowflakes to earn valuable rewards like gems, boosters, and unlimited lives<br/>- Addictively tasty combos and power-ups to boost your high score: Rainbow Pop, Mega Scoop, Whipped Cream, and more<br/>- Explore a yummy world with mouth-watering ice cream landscapes<br/>- Compete against your Facebook friends and other players around the globe<br/><br/>Join in the fun and take on the ultimate match-3 challenge with Frozen Frenzy Mania!<br/><br/>Love Frozen Frenzy Mania? Learn about other Storm8 games.<br/>Website: www.storm8-studios.com<br/>Facebook: facebook.com/storm8<br/>Instagram: @Storm8<br/>Twitter: twitter.com/storm8<br/><br/>DEVELOPER INFO: Storm8 Studios a leading developer that has published more than 45 top games across a variety of genres – so there is something for everyone. Titles include Candy Blast Mania, Jewel Mania, Bubble Mania, MONOPOLY Bingo, Bakery Story 2, and Dream City: Metropolis.", "metacritic": null, "released": "2015-10-22", "tba": false, "updated": "2019-07-29T07:42:12", "background_image": "https://media.rawg.io/media/screenshots/df0/df0e70f85a65fececdca25cde4e1a33b.jpg", "website": "http://www.storm8-studios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Storm8 Studios"], "genres": ["Strategy", "Puzzle"], "publishers": ["Storm8 Studios"], "esrb_rating": "Everyone 10+"}