{"id": 709303, "slug": "bullet-time-itch-nicole-stocks-adam-kasumovic-moor", "name": "Bullet Time (itch) (Nicole Stocks, Adam Kasumovic, moorhou4, David Khankin)", "name_original": "Bullet Time (itch) (Nicole Stocks, Adam Kasumovic, moorhou4, David Khankin)", "description": "<p>In <em><strong>Bullet Time</strong></em>, you fight as a robot against up to three of your friends in maps inspired by the environments of <em>The Matrix</em>. Drawing from the unique mechanics popularized in the film, Bullet Time employs the use of time slices and wall jumping, among others, to give the player the feel of existing within <em>The Matrix</em>. At the beginning of each short round, a virtual dice roll will determine a unique set of effects to be applied to players who lost the previous round, and you must battle your opponents to come out as the sole victor.  The game is created with 2D pixel art and draws inspiration from the characters and environments of <em>The Matrix.</em>  <strong><em>Bullet Time</em> </strong>is intended for core gamers ages 10 and up. </p>\n\n<p><em><strong>Bullet Time</strong></em> is an Arena PvP game created in the Fall of 2021 for MSU's Game Design and Development Minor. The game was created over a six week period with a team of five developers. The game currently supports PC and Mac platforms and is played best with controllers but playable on keyboard as well. </p>\n\n<p>CREDITS:</p>\n<p><strong>Adam Kasumovic</strong> - Programmer</p>\n<p><strong>David Khankin</strong> - Programmer</p>\n<p><strong>Kalea Vendola</strong> - Lead Artist</p>\n<p><strong>Nicole Stocks</strong> - Designer/Artist</p>\n<p><strong>Tate Moorhouse</strong> - Programmer</p>\n\n<p>Additional credits to freesound.org, HookSounds, and MSU GEL Lab for assets used. </p>\n<p>***TESTING INFORMATION***</p>\n<p>GAMEPADS RECOMMENDED!</p>\n<p>On keyboard, the controls are WASD to move, Space to jump, F to shoot, LShift to pick up crates, B to throw, and E to interact.</p>\n<p>IMPORTANT: If you only have one device, you can use your mouse and click the screen in the Hub (the room where players join the game) to create a \"dummy\" player in order to gain access to the actual game. Hitting a button on the keyboard should create a player using keyboard controls, so this should provide you with the minimum of 2 players required.</p>\n<p>If you get stuck in the UI, use the mouse.</p>\n<p>In the rare event that the game becomes unplayable, go back to the Main Menu. In the even rarer event that the game is still unplayable, please restart the game.</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T05:26:31", "background_image": "https://media.rawg.io/media/screenshots/8bd/8bd9447d0da6e44dfc3cb0c2c50cbdb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["moorhou4", "Nicole Stocks", "David Khankin", "Adam Kasumovic"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}