{"id": 709484, "slug": "ross", "name": "Ross", "name_original": "Ross", "description": "<p>Notice: Ross is an unfinished game, that may receive more updates in the future. Also some audio imbalances, so LOWER YOUR VOLUME!!!</p><p>You play as Ross, a man who is trying to claim his citizenship in the world of \"The Minds\". The Minds have creepy looking faces, and are very dangerous. The bouncers are another enemy to watch out for, especially the big one!</p><p>Use the LMB to shoot one projectile, and the RMB to rapid fire! You can use this to defeat enemies, and destroy walls!</p><p>As this game is unfinished, you might notice that defeating the boss doesn't do anything, but luckily there are many debug test  levels. You can switch levels with \"/\" and \"*\".  Also some other cool features I coded were the tenet projectiles which you hold ctrl to gravitate projectiles toward you, and release to see them fly everywhere! Another thing is a hover car I coded! Press the MMB to enter the vehicle, and E to exit. In the grid room you can use the level edit features. Use the numbers above the keyboard to place enemies and objects! You can also use \"e\" to place enemies, and \"c\" to place wood. There are many more features I am testing that you many notice, so feel free to mess around with it in all it's unfinished glory! Also, placing bricks and wood, and pressing \"p\" activates party mode, (which includes FLASHING IMAGES) so just a warning.</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T06:09:11", "background_image": "https://media.rawg.io/media/screenshots/25d/25d2202c7e5bc2f8aba6228aefacc330.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["BasicBanana"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}