{"id": 709426, "slug": "grimeret", "name": "Grimeret", "name_original": "Grimeret", "description": "<p><strong>Welcome to Grimeret</strong> - a tactical board-based card game, but with auto-chess mechanics and a tower defense twist! Protect your Hero from your opponent’s units, and destroy them with your own army!\r\n<br/>Pick your Hero, prepare your units on the board and send them to combat. Fight against players from the world and prove your worth!</p>\n<p><strong>Your goal is simple</strong>: defeat the enemy Hero. Pick your favorite Hero between five, each with their own powers and battalion. Prepare your units on the board while your enemy does the same, then watch the battle unfold! Adjust your strategy turn after turn to get around your opponent’s defenses… Or blow them up with sheer power 💥</p>\r\nGAME MODES\r\n<ul><li>🌐 <strong>Online game</strong> - Battle against anyone in the world</li>\n<li>🤖 <strong>Solo game</strong> - Learn the ropes against a computer</li>\n<li>🧠 <strong>Strategy</strong> - Solve brain-teasing puzzles</li></ul>\r\nCONTENT\r\n<ul><li><strong>5 different Heroes</strong>, each with 4 powers and 8 units in their Battalion</li>\n<li><strong>12 different units</strong> for a fun, varied and versatile gameplay</li>\n<li><strong>3 game modes</strong> (for now!) 😊</li></ul>\n<p>Thanks for supporting our small indie game, made with love (and finger cramps) by Alex and Val from SFG Studio. This game is still in development: if you’d like to provide feedback, please write us at sfg.gamestudio@gmail.com, or join the community on Discord at https://discord.gg/NwUggtejnq</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T05:55:11", "background_image": "https://media.rawg.io/media/screenshots/d5e/d5eb53f7e628153723f82c6107319061.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["SFG_Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}