{"id": 70952, "slug": "jackpotjoy-slots-vegas-slots", "name": "Jackpotjoy Slots: Vegas Slots", "name_original": "Jackpotjoy Slots: Vegas Slots", "description": "Experience Vegas through 100 different slot machines, with a new game every 2 weeks! Download now!<br/> <br/>If you love slots, you’ll love Jackpotjoy Slots! Jackpotjoy Slots is the only free Las Vegas-style slot machine app you need if you want to spin to win on your iPhone or iPad. One of the top casino and slot machine game apps in the iTunes store, Jackpotjoy Slots brings you fast casino action that you can play nearly anywhere.<br/> <br/>Jackpotjoy Slots features a new game every 2 weeks, so the fun won’t stop with this free app. Without spending any money at all, you can play Jackpotjoy Slots’ classic and signature slot machines like Classic Wilds and Winner Wilds. <br/>O’Lucky’s Gold and many other Las Vegas-style slots are waiting for you, so download the app today to win big virtual money and experience real casino thrills.<br/> <br/>Jackpotjoy Slots Features<br/> <br/>Play Jackpotjoy Slots and get access to the following free features:<br/> <br/>● More than 100 different slots<br/>● A new free slot machine game released every 2 weeks<br/>● Real Las Vegas slot machine action without having to go to Vegas<br/>● Signature games, including Classic Wilds and Winner Wilds<br/>● Free coins so you can always spin to win big jackpots<br/> <br/>Unique Slot Machine Features<br/><br/>In addition to these fun features, Jackpotjoy Slots lets you play Cascade slots, All Pays slots, and multi-line games up to 100 lines! You get free spins, Stacked Symbol games, Expanding Wilds games, and many other innovative and creative slot machine features.<br/><br/>Jackpotjoy Slots is a top game in the iTunes store because it offers full casino action in an absolutely free app. Download Jackpotjoy Slots today and get started on the road to your virtual jackpot.<br/><br/>Like us on Facebook: http://www.facebook.com/JackpotjoySlots<br/> <br/>Jackpotjoy Slots is a slot simulator for entertainment use only. It is free to play, and you can choose to purchase additional coins with in-app transactions.<br/> <br/>Jackpotjoy Slots is intended for an adult audience.<br/> <br/>Jackpotjoy Slots does not offer real money gambling or an opportunity to win real money or prizes.<br/> <br/>Practice or success at social casino gaming does not imply future success at real money gambling.", "metacritic": null, "released": "2012-09-26", "tba": false, "updated": "2019-10-22T14:26:26", "background_image": "https://media.rawg.io/media/screenshots/64c/64c5a52d4672b422ab8721bdee7dd052_xhC0d94.jpg", "website": "http://www.gamesyscorporate.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gamesys"], "genres": ["Card"], "publishers": ["Gamesys"], "esrb_rating": "Teen"}