{"id": 709530, "slug": "un-mar-de-plastic", "name": "Un mar de PLÀSTIC", "name_original": "Un mar de PLÀSTIC", "description": "<p><strong>Per una experiència completa, premeu la tecla F11 quan estigueu dins el joc!</strong><br/></p>🔍 Enfocament:\r\n<p>El tema que he hem decidit tractar en aquesta peça periodística gamificada és la contaminació del mar a causa del plàstic. Per fer-ho, hem elaborat un joc amb un quiz en el que es plantegen preguntes relacionades amb dades sobre la contaminació a causa de l’abocament de residus plàstics.</p>\n<p>El joc consisteix en recollir residus plàstics, tot esquivant la flora i fauna marina. </p>💡 Objectius: \r\n<p>El/la jugador/a ha de respondre una sèrie de preguntes mentre busseja pel fons marí. </p><p>Les preguntes apareixeran quan l'usuari arribi a reunir 10 punts. Les últimes 5 preguntes estaran relacionades amb el coneixement sobre les Illes de plàstic. </p><p>La finalitat és capturar el màxim de plàstic possible sense alterar la biodiversitat del fons marí, i respondre les preguntes sobre el coneixement de la brossa dipositada als oceans per adquirir una conscienciació amb major profunditat sobre aquest problema climàtic. <br/></p>🖊 Reflexions:<p>A mesura que avanci el joc, l'acumulació de deixalles serà tan gran que el jugador se sentirà saturat perquè no serà capaç de recollir tot el plàstic.</p><p>Amb aquest escenari volem conscienciar a l'usuari sobre el mal que s'ha fet a l'oceà amb la producció successiva de plàstics innecessaris i el seu abocament als mars. Un problema que ja s'està fent irreversible.</p>\r\nDissenyat per:\r\n<p>Maria Francesc, Alba Gallén, Iker Mons, Mariona Montserrat</p>\r\nDesenvolupat per:\r\n<p>Martí de Ferrer</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T06:18:54", "background_image": "https://media.rawg.io/media/screenshots/ee5/ee5c8842f806a9b52c2085a0a07ccbe8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MDFF"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}