{"id": 70951, "slug": "jewel-quest-best-match-3-games", "name": "Jewel Quest: Best Match 3 Games", "name_original": "Jewel Quest: Best Match 3 Games", "description": "The original match 3 game is back - and better than ever.  Are you a match 3 fan? Have you experienced the game that started the phenomenon?<br/><br/>Can you spot the match before it happens? Test your mental prowess in this fun and frantic match 3 adventure. Endless challenges await in this brain-bending puzzler as you explore the mysterious Isles of Illusion. Uncover their secrets... and survive their dangers! <br/><br/>CLASSIC GAMEPLAY<br/>Match 3 has never been so exciting. Enjoy classic match 3 gameplay while experiencing tons of unexpected twists.  Can you master even the most challenging levels? <br/><br/>WEEKS OF ENTERTAINMENT!<br/>Enjoy over 200 fantastic levels providing weeks of entertainment!<br/><br/>PLAY WITH FRIENDS<br/>Login with Facebook Connect to see how you stack up against your friends! Challenge your friends and and then crush their scores! <br/><br/>NEW JEWELS<br/>Think you are a match 3 master? Think again - new jewels and rules shake up the rules of match 3, challenging you more than ever before.<br/><br/>COLLECT SPECIAL TOOLS<br/>Special power boosts and the lion coins help you complete jewel boards in record time!<br/><br/>POWER UPS TO BLOW THROUGH THE COMPETITION<br/>Collect relics along the way to help you complete even the hardest of the jewel boards. BONUS: Once you get a relic - its powers are permanent!<br/><br/>GORGEOUS BACKDROPS<br/>There are 14 stunning  islands to explore!<br/>____________<br/><br/>Sign up now to be the first to learn about sales and promotions from iWin Games! http://signup.iwin.com/mobile/<br/>___________<br/><br/>Dive into all of iWin’s amazing games!<br/><br/>Cash games:<br/>Jewel Quest for Cash<br/>Solitaire Classic Tournaments: Free Solitaire Game<br/>Cubis Tournaments<br/>Bubble Town: Best Bubble Shooter Games<br/><br/>Casual Games:<br/>Jewel Quest Seven Seas<br/>Deal or No Deal<br/>Jewel Quest Mysteries<br/>Jojo’s Fashion Show 2<br/><br/>New in update:<br/>- Now get a FREE lives refill when you sign up for iWin's newsletter!<br/>- Minor optimizations and bug fixes for a smoother play experience", "metacritic": null, "released": "2013-10-11", "tba": false, "updated": "2019-07-29T14:02:31", "background_image": "https://media.rawg.io/media/screenshots/d7d/d7d741ee6dc1c3d3c0f9e65b83c225ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iWin"], "genres": ["Strategy", "Puzzle"], "publishers": ["iWin"], "esrb_rating": null}