{"id": 709514, "slug": "the-legend-of-the-new-years-wish", "name": "The Legend of the New Year's Wish", "name_original": "The Legend of the New Year's Wish", "description": "<p>Let me start by saying that I look at this game and have no idea how we did it in 48 hours. Thanks to an amazing team, great momentum, and some free professional assets, we were able to give \"The Legend of the New Year's Wish\" an amazing atmosphere that we hope a lot of players will enjoy.</p>\n<p>But enough about that: LotNYW is a game about exploring through a blizzard with a snow boat. Snow sailing seemed to us a novel idea to explore; a lot of big games have done boats in the past, but traversing frost instead of sea could lead to interesting gameplay where you could leave the boat anywhere to go out and investigate. As we were implementing all the gameplay stuff we didn't get the change to explore this fully, but we still feel that it has proven to scratch some itch that would be fun to see realized in a larger game.</p><p>The github for this project can be found here! Do note that all code standards and organization have been thrown out the window in favor of speed, so expect a lot of bugs and bad code in this one :|<br/></p>\n\n<p>Vlada Morgun - instagram: @vmorgun<br/>Story and 2D stylized art.</p>\n<p>Julius de Blaaij<br/>Game Design and Team Coordinator (+ generally helping out).</p>\n<p>Timon Stepan - instagram: @timzyyx<br/>3D modelling and texturing.</p>\n<p>Casey \"DeCoder\" Hofland<br/>Gameplay code and Unity expert.</p>\n\n<p>Made also with the help of free starter assets, sounds, and animations from Unity, https://freesound.org/ and https://www.mixamo.com/#/ respectively.</p>\n<p>Note that the mac and Linux build are untested and may not load or crash.</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T06:15:23", "background_image": "https://media.rawg.io/media/screenshots/0c6/0c66985d6848f71d74706bcfed7c34da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["CaseyDeCoder"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}