{"id": 709627, "slug": "a-day-in-the-life-of-p3-portable", "name": "A Day In The Life Of: P3 Portable", "name_original": "A Day In The Life Of: P3 Portable", "description": "<p>Play as the new girl at Gekkoukan High School, months after she’s been settled in as a member of SEES, a secret student organization that fights monsters called “shadows” that infest their school and city at night. On a strange day, where the portal to the shadows’ den within their school, called Tartarus, is inaccessible due to supernatural means, the remaining members of SEES take a day off to explore the town and spend time with each other. At least, until the supernatural situation is fixed.\r\n</p>\n<p>This is a project made with the goal of gaining a better understanding of how to use the Ren'Py visual novel engine and Python to make a visual novel game. I've done this by recreating a day from the Playstation Portable remake of the highly acclaimed Calendar/Life Simulation RPG \"Shin Megami Tensei: Persona 3\" using the Ren’Py engine’s tools and Python script.\r\n</p>\n<p>This project is not for sale and should not be sold. All assets and characters used from Persona 3, Persona 3 Portable, Persona 2: Innocent Sin, and Persona Q belong to their respective owners and creators. Please support the official release! My contribution is the code used to make this project run using Ren'Py and Python scripts as well as portions of original dialogue.<br/></p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T06:39:17", "background_image": "https://media.rawg.io/media/screenshots/627/62762d4bd14b4d2dd7ece34e2199bd74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["cslazuli"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}