{"id": 709674, "slug": "data-entry-overload-cc", "name": "Data Entry Overload [C:C]", "name_original": "Data Entry Overload [C:C]", "description": "<p>(This is a part taken from the main game, a \"bite\" of the game if you will. It has different dialog, and Christmas'd up a little in the spirit of the holiday season, I think this one is adorable!)<br/></p>\n<p>Concept: SANTA'S TAKEN A HIT, AND WENT DOWN... IT APPEARS HE HAD NO IDEA WHAT WAS GOING ON IN THE WORLD OF THE SOULSTREAM EXPANSIVE. AND JUST SO HAPPENED TO CRASH LAND INTO SOME... PORCELAIN WHITE, JIGGLY MOUNTAINS. AND YEAH, NOW CAUSE OF MAMA LUNA'S OBLIVIOUSNESS, TO THE WHOLE SITUATION. THE WHOLE WORLD IS AT RISK OF NOT GETTING ANY PRESENTS FROM THE BIG GUY IN RED HIMSELF! SO SANTA'S ELVES? ARE A LITTLE PISSED TO SAY THE LEAST... AND GUESS WHO HAS TO HELP WITH THE BAGGAGE? LUCA. BUT SINCE HIS LITTLE WEAK FRAME DEFINATELY DOESN'T HAVE WHAT IT TAKES TO DELIVER IT, THE LEAST HE CAN DO IS PROGRAM HIS LOVELY A.I. ASSISTANT, ALIA I, TO HELP DELIVER THEM. PROGRAM ALL THE DATA SHE NEEDS TO MAKE THIS HAPPEN. TO DO THIS, ALL YOU HAVE TO DO IS TYPE IN THE WORD THAT POPS UP AND PRESS ENTER, WRONG DATA AND MISSPELLS WILL CAUSE THE DATA TO LEAK, BUT CONSISTANT DATA WILL CAUSE ALIA I TO OVERLOAD, KEEP HER WITHIN RANGE, AND SHE'LL BE ABLE TO PROCESS THE DATA AND BE ON HER WAY! LOSE? WE'LL LET'S JUST SAY EVEN THE GALS OF SOULSTREAM WILL BE AFTER YOU, AND WE ALL KNOW HOW THAT GOES...</p>\n<p>Type of Inflation : Thigh and Hip Expansion (Robogal)</p>\n<p>If your interested in this and would like to get access to the full game (IN DEVELOPMENT- EARLY ACCESS), Please become a Patreon!</p>\n\n<p>Patreon: www.patreon.com/SoulstreamExpa…</p>\n<p>Discord! - discord.gg/8WyKxvzDdW</p>", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-17T06:48:56", "background_image": "https://media.rawg.io/media/screenshots/d9a/d9a4465918e4f02b43473d07754ceabc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["evosoul"], "genres": [], "publishers": [], "esrb_rating": null}