{"id": 710005, "slug": "elemagi-duel", "name": "Elemagi Duel", "name_original": "Elemagi Duel", "description": "<p>Elemagi Duel is a work in progress, feel free to follow along until you are happy purchasing the game in the state you see it! I am a free-time developer so consistent updates are not guaranteed!</p>\r\nElemagi Duel\r\nHead-to-head Realtime Puzzles!\r\nOverview\r\n<p>Elemagi Duel is a spiritual successor to <em>Might and Magic: Clash of Heroes</em>, reimagined in real-time!\r\nA brand new story! Many more characters, including some cameos from the community!\r\nIntense battles that will challenge you to set up and knock down your board quickly all while keeping an eye on where your opponent is attacking!</p>\n<p>Seven elemental types with allied and enemy pairings that affect how artifacts and supers interact with your boards!\r\nEach character is assigned two elements, but the third is up to you. Choose something quick like lightning? Or stall out your foe with Eloro's poison and some sturdy earthen walls?</p>\r\nStory\r\n<p>In the land of Groketeron, ruled by the Holy Empire and its allies, trouble is stirring.\r\nThe Holy Empire understands the need to respect the traditions of its supposed \"provinces\", but no amount of <em>respect</em> is worth your sovereignty.\r\nWhile a war is brewing among the powerhouses; smaller factions begin producing powerful mages of their own, the conflict stealing away the Empire's usual attention and thereby suppression of such feats.\r\nBut earthly conflicts might have to wait...\r\n</p>\n<p>A lesser devil arrives to the material plane searching for a soul to deliver the archdemon's cataclysm.\r\nMara, a young girl studying for magehood, seems like the perfect target: rowdy, unwilling to conform. From a small town in the forest... won't draw the attention of the Empire.\r\nDespite her promise to end the world, Mara seems to have her own plans (and a degree in magic to finish!). With the demon bound to her soul, what impact will she have in the months to come?\r\n</p>\r\nBattles\r\nControls\r\n<ul><li>Keyboard:<ul><li>Move Cursor: Arrow Keys</li><li>Select: Z</li><li>Delete: X</li><li>Reinforce: C</li><li>Super: Left Shift</li></ul></li><li>Controller (XInput):<ul><li>Move Cursor: Directional Pad<br/>\n</li><li>Select: A\r\n</li><li>Delete: B\r\n</li><li>Reinforce: Right Trigger</li><li>Super: Y</li></ul></li></ul>\r\nRules\r\n<p>- Each player controls an 8x6 board of magic orbs. You can pick up and move any orb that isn't covered by another.\r\n- Line up three orbs to generate attacks (vertically) and walls (horizontally)!\r\n- Attacks begin at 50% attack power and charge up to full strength over a short duration before automatically shooting across both board to hit the enemy backboard.\r\n- Walls have more health than idling orbs but cannot be moved. Any incoming damage that isn't absorbed by walls, attacks, and idle orbs will be dealt to your health.\r\n- Combos generate mana to charge your super. A combo is every attack and wall that is formed due to board sorting, including sorts caused by deleting orbs!\r\n- Sometimes a mega orb will spawn! These 2x2 orbs deal significant damage but take a while to charge up. Align four orbs of the same element behind it to activate the attack and generate 15 mana.\r\n</p>\r\nPlanned Features\r\n<p>- Artifacts that apply passive effects to all your orbs.\r\n- Duo, 2v2 battles! Shared HP, separate mana. Two artifacts per team! Optionally, play on a larger 10x6 board.\r\n- Menus and controller configuration options.</p>\r\nNotes\r\n<p>This update reduces the power level of supers to allow non-damaging characters like Lilly a better chance. This should allow using regular attacks to be viable as chip damage, and mega orbs as game-enders.\r\n</p>\r\nAdjustments\r\n<p>- Reduced Mara's super damage from 16/12 to 12/8.\r\n- Swapped Hannah's and Yvunka's supers to better match elemental theming.\r\n- Reduced Eloro's super from poison every 4 seconds to poison every 5 seconds. The effect still stacks with itself.\r\n- Reduces all wall health by 1.\r\n- Mega Orb damage increased by 30 across the board.\r\n</p>\r\nFixes\r\n<p>- Ryan's Super no longer fills his mana due to self-damage.</p>\n<p>- Fixed mangling on \"artifact coming soon\" UI elements.\r\n</p>\r\nKnown Issue\r\n<p>- Orbs in the last column can end up with negative health without being deleted. This causes attacks passing through it to accumulate thousands of damage which ends the game.\r\n</p>", "metacritic": null, "released": "2021-12-15", "tba": false, "updated": "2021-12-17T08:00:19", "background_image": "https://media.rawg.io/media/screenshots/dbe/dbeb61213c9845a21e9c11ea2ed58fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Iceball"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}