{"id": 71039, "slug": "caesars-slots-casino-games", "name": "Caesars Slots – Casino Games", "name_original": "Caesars Slots – Casino Games", "description": "From the creators of Slotomania comes the top shelf experience that is Caesars Casino, the world’s best mobile slots app! Here’s your chance to get lucky and spin like a VIP while receiving daily rewards, mega bonuses and a 40,000 welcome coins await!<br/><br/><br/>*  Play 100+ FREE slots with new casino games coming out all the time!<br/>*  Legacy Bonus – Collect free coins as you travel back in time!<br/>*  Facebook Fan Page - Receive free coins daily and share your luck with your friends!<br/>*  Unlock special rooms for more Vegas casino slots!<br/>*  Grab your Lobby Bonus 3 times and play the lightning wheel for even more free coins!<br/>*  Unlock your own personal Vault and save coins as you spin!<br/>*  Check the Leaderboard to see top players’ current status levels!<br/>* Send and receive gifts with your Caesars friends in the game!<br/><br/>* Playtika Rewards *<br/>Win even more with in-game benefits and rewards every time you hit the Vegas jackpot! Stack up more benefits when progressing through Status Levels - Bronze, Silver, Gold, Platinum, Diamond, Royal Diamond and Black Diamond. Spin the 100+ slot games to achieve even more! <br/>* Incredible game features *<br/>Get tons of free coins daily through the Facebook Fan Page, web notifications, push notifications and email! See if you’re a Top Player with the Leaderboard while conquering the Daily, Explorer, Power and Master Challenges. Check your personal highlights and badges that you’ve earned in the User Center. And with new games and features coming out all the time, the sky’s the limit!<br/>Get special treatment when you unlock your Vault for ultimate value! Feel an extra jolt when you hit Boost Mode and get twice the Level Up Rewards, double the Coin Store &amp; Personal Offer amounts, double the coin amount of your Legacy Bonus and receive your Lobby Bonus twice as fast.<br/>* More friends, more fun *<br/>Get lucky and win big prizes by logging into Facebook and receiving 25,000 coins just for the thrill of it. Get the inside scoop with tons of free coins daily with the Caesars Casino Facebook fan and become part of an amazing community full of real casino slot players around the world. Connect with your new Caesars friends and experience even more fun!<br/>* Top shelf Vegas slots *<br/>It just keeps getting better - the more slots you play, the more features you unlock! See what everyone’s talking about when you spin slots like Grand Asgard, Genie’s Tale, Love &amp; Luxury, Eternal Egypt, Dreaming of Oz, Captain Pelican, Liberty Bash, 7 Shining Pandas, Ride ‘Em Wild and much more!<br/><br/>*Contact us whenever you want, about whatever need. Playtika has an award winning support team, available to help you hit the Vegas 777 jackpot and WIN BIG!<br/><br/>The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. The games are intended for an adult audience. Practice or success at social casino gaming does not imply future success at \"real money gambling\"", "metacritic": null, "released": "2013-12-18", "tba": false, "updated": "2022-09-07T17:14:32", "background_image": "https://media.rawg.io/media/screenshots/286/286f9407f3ac28ba9feb71e398260503.jpg", "website": "http://playtika.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Playtika"], "genres": ["Card"], "publishers": ["Playtika"], "esrb_rating": "Teen"}