{"id": 710541, "slug": "average-aco", "name": "Average Aco", "name_original": "Average Aco", "description": "\n<p>Welcome to the life of Aco, your (under)average Balkan man. He likes to drink, listen to music that sounds like someone is being beaten to tears with an accordion and being a fine example of why the right to vote should be given to people after they pass a mandatory IQ test.</p>\n<br/>\n<p>Aco has gotten himself in a bit of a pickle you see. His girl Yagoda is mad at him for spending all of their money buying the whole bar drinks and paying for all the glasses that he broke(again). But what can a man do, all of the songs that were playing tugged on his heartstrings, it's just the way it is, he's a man of passion.</p>\n<p>Well now, the way it is is that Yagoda packed her bags and left to live with her mom for a while, who by the way, hates Aco's quite large guts. Go figure. But while our Aco may be stupid, dumb and stubborn, he is also stupidly stubborn and dumbtermined to win Yagoda back. He will try to get as much money as he can to pay for this month's bills and bring her back home. And probably have a drink before the whole ordeal. And maybe after. Definitely somewhere in-between too.</p>\r\n  \r\n<p>However, his coordination is not what it used to be, so he needs some help. Are you up to the challenge of moving 220 kilos of pure primitive mass and testosterone towards his goal over, under and maybe through whatever obstacle could be in his way? Ok I guess, whatever.</p>\n\n<p><strong>Controls</strong><br/></p>\n<p>A/D, left/right arrows - move left/right</p>\n<p>Space - jump</p>\n<p>Left Ctrl - fire farts</p>\n<p>S, down arrow - fall through slim platform</p>\n\n<p><strong>Credits</strong></p>\n<p>Project manager - callmetoots</p>\n<p>Gameplay mechanics - morganheim</p>\n<p>Programing - sdad-711</p>\n<p>Level design - johnxina</p>\n<p>Art'n'sound - pileboy2704</p>\n<p>Mentor - Dominik Cvetkovski</p>\n\n<p>This project was presented for a game jam with a theme of \"Strange Power-ups\" for educational program \"INKUBATOR - PISMO\"  for \"Unity/C# game developer\".</p>", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2021-12-17T10:02:58", "background_image": "https://media.rawg.io/media/screenshots/a05/a0518ce26e3bc9a6f946dc238f698da0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CallMeToots"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}