{"id": 710620, "slug": "let-there-be-photophobia", "name": "Let there be Photophobia!", "name_original": "Let there be Photophobia!", "description": "<p><strong>Story</strong></p>\n<p>You are a simple lamplighter, tasked with putting out and lighting the village's lanterns. That place has always disturbed you in a way, as you felt that something wasn't quite... right with the place. Was it the blurry-eyed people, the oddly zealous priest or the mysterious lord none knew, whose mercy was the reason the people managed to live a safe life with bellies full? You know not, and you would rather not delve into it. Perhaps that's why you chose to make your home further away from the village.</p>\n<p>However, your choice may be the reason you were saved, as you come to find out on your morning rounds that something has happened, something dark. You always brought light to the village, and there is no reason now for you not to try to cast some light on the events that transpired. That is, if you wish to find a way out alive. You are the lamplighter, after all.</p>\n<p><strong>Game</strong></p>\n<p>Use your trusty lantern to make your way through the village. Somehow, it has become imbued with powers that allow you to remove certain obstacles and see things that you otherwise could not. </p>\n<p>The village is overrun by grotesque creatures that seem to be out for blood. Try to hide from them, run as fast as you can. But be careful, the air is thick with a stench your body cannot handle. Try not to run too much as you will quickly run out of breath and become overrun.</p>\n<p>Look for clues that may help you in your quest to find both the truth, and the way out. Light attracts trouble, so use it cautiously.</p>\n<p>\n</p>\n<p><strong>Notes</strong></p>\n<p>The game is incomplete, and may be expanded upon in the future. We hope to bring the players  a dark atmosphere filled with danger and fear. We aim to make the players scared of using the light unnecessarily in order to make them plan whether they'll sneak around potential threats or attempt to trap them to make their exploration safer.</p>\n<p>Controls: </p>\n<p>WASD movement</p>\n<p>E - you interact with other objects</p>\n<p>F - turning off and on the flashlight</p>\n<p>The demo is made for our weekly project for the Unity/C# education of the \"PISMO\" incubator in Novska, HR.</p>\n<p>Team members and roles are:</p>\n<p>Mentor: Dominik Cvetkovski</p>\n<p>Project manager: Josip Barun</p>\n<p>Level Design: Lovro Kovačević</p>\n<p>Lead Programer: Dominik Pavičić</p>\n<p>Gameplay Mechanics Programer: Domagoj Brebrić</p>\n<p>User Interface : Davor Vezmar</p>\n<p>This project was presented for a week-long project with the theme \"Day and night\" for the educational program of \"INKUBATOR - PISMO\"  for \"Unity/C# game developer\".<br/></p>", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2021-12-17T10:20:12", "background_image": "https://media.rawg.io/media/screenshots/ca1/ca166e74c88aa354e7f462dcfe9c2f37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CallMeToots"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}