{"id": 710736, "slug": "tag-adamas2021", "name": "Tag (Adamas2021)", "name_original": "Tag (Adamas2021)", "description": "<p>Hello everyone, welcome to our magical Christmas story that will hopefully entertain you a bit this Christmas time. </p>\n<p>It's Christmas Eve, Santa Claus and Jack Frost had a small disagreement, so Jack Frost decided to provoke Santa Claus.  He sent his angry Snowmans to catch Santa Claus and stop him to deliver presents for Christmas. Santa Claus has to collect as many cookies as he can because they give him motivation to deliver presents for all children around the world. Also, there are Christmas presents all around Christmas Village which contain special Power-Ups for Santa so he can easily escape snowmans and get revenge on Jack Frost.</p>\n<p>One of the Power-Ups is \"Small\" what gives Santa ability to shrink, because there is a story in which Santa shrinks his body so he can easily go through chimneys. Santa's sleigh have magical power to be all around the world in short time, so we have Power-Up \"Teleport\" what gives Santa ability for faster travel around the Christmas Village. Also there is \"Jump boost\" ability because Santa's reindeers can jump very high and in this case gives you ability to jump and destroy snowmans by landing on them.</p>\n<p>You get points by collecting cookies and jumping on the snowmans. There is score multiplier for destroying mutiple snowmans in a row.  In order to survive and collect as many cookies as possible, you have 3 Power-Ups that give you special abilities:</p>\n<p>   This  icon represent \"Jump boost\" . You can obtain it by collecting presents with red glow.</p>\r\n   This icon represent \"Small\" ability. You can obtain it by collecting presents with green glow.\r\n   This icon represent \"Teleport\". You can obtain it by collecting presents with purple glow.\r\n<p>This game is made for our weekly project with theme \"Strange Power-Ups\" during the Unity education in \"PISMO\" incubator,  Novska, Croatia.</p>\n\n\n<p>Controls:<br/></p>\n<p>              <em><strong>W</strong></em></p>\n<p> <strong><em> A</em></strong>         <strong><em>S         D </em></strong>      These keys allow you to move forward, backward, left and right.</p>\n<p>The<em> SPACE</em> or <em>E </em>key allows you to use special abilities.<br/></p>\n<p><em>MOUSE</em> allows you to determine the direction in which you are moving.</p>\n\n\n<p>Credits:</p>\n<p>Project Leader: Karlo Koščal (https://wingedadventurer.itch.io/ )</p>\n<p>Programmer: Ilija Krišto (https://njoknjok.itch.io/)</p>\n<p>Level Designer: Bernarda Špoljarić (https://bernarda.itch.io/)</p>\n<p>UI: Nikola Višekruna (https://johnnycrown.itch.io/)</p>\n<p>VFX,  Assets, Sound effects: Robert Rožić (https://adamas2021.itch.io/)</p>\n<p>Mentor: Dominik Cvetkovski</p>\n\n<p>Thank you and enjoy in the game!</p>", "metacritic": null, "released": "2021-12-13", "tba": false, "updated": "2021-12-17T10:47:00", "background_image": "https://media.rawg.io/media/screenshots/3a1/3a1d624ef3d77d5e0bfa1456b37a7eb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adamas2021"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}