{"id": 71092, "slug": "play-sugarhouse-casino-slots", "name": "Play SugarHouse Casino Slots", "name_original": "Play SugarHouse Casino Slots", "description": "You Deserve More when you play your favorite online casino games for real money in New Jersey with SugarHouse Casino. More Games. More Rewards. More Fun. Simply play your favorite online slots, blackjack, roulette and games for real money and you’ll earn generous rewards daily, weekly, and monthly. Get a 100% up to $100 match bonus on your first deposit. Only 1X wager! With the SugarHouse online casino, what you see is what you get!<br/> <br/>Here are some of the ways SugarHouse offers you more than any other online casino in New Jersey:<br/> <br/> · Create a SugarHouse Online Casino account and receive a free welcome bonus of up to $20! Only 1X wager!<br/> · Get a 100% up to $100 match bonus on your first deposit. Only 1X wager!<br/> · Quick and simple registration process that makes it easy to start playing right away!<br/> · A friendly Player Support team that is dedicated to making sure you’re always able to receive the help you deserve.<br/> · Receive Invitations throughout each day to our Free Bonus Bingo Game that awards online casino players with up to $15 in free bonus money!<br/> · Weekly Slot Leaderboard that lets you compete with other real money online casino players in New Jersey to earn $20 plus your share of $1,100 extra bonus money!<br/> · The Most generous Refer-A-Friend program in the market! Win up to $500 for simply referring your friends to SugarHouse Online Casino! You’ll always get at least $50 per referred friend!<br/> · More Rewards with New Jersey’s premiere online casino VIP program.<br/> · Enjoy the lowest bonus requirements available in New Jersey.<br/> · Our Unique Bonus Bank lets you track and manage how and when you activate your slot bonuses. All bonuses in the bonus bank are 1X wager only!<br/> · Community chat room feature that allows you to chat with your fellow online casino / slot players in NJ as you enjoy your favorite slots and table games.<br/> · Easy and most user-friendly site. Quickest deposits and game switching of any app in the market!<br/> · More Bang for your Buck. Low minimum bets on all slot games.<br/> <br/>You’ll love being a winner at SugarHouse Online Casino in New Jersey. playsugarhouse.com", "metacritic": null, "released": "2016-09-12", "tba": false, "updated": "2019-10-22T13:56:35", "background_image": "https://media.rawg.io/media/screenshots/63c/63c367f4a1088f398e919274796d472a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rush Street Interactive"], "genres": ["Card"], "publishers": ["Rush Street Interactive"], "esrb_rating": "Mature"}