{"id": 711085, "slug": "collector-thief", "name": "Collector Thief", "name_original": "Collector Thief", "description": "<strong>I need to recover what it's mine by right!</strong><br/><br/> As a participant in a strange cult, you'll control Adami, a treasure hunter with a clear objective. Find the sacred object of worship for the Adami's sect.<br/><br/> Walking through the shadows, going unnoticed and using a lot of intelligence to break through security, you'll find challenges to find locked doors, cameras, security lasers and many other challenges that must be bypassed in order for the wonderful quest to be reached.<br/><br/> More committed to the cause than ever, Adami will have the help of other members who bring items and new tactics to make each theft a real success.<br/><br/> With over 6 unique scenarios and an engaging, fun adventure, the real theft will happen and it will be worth more than ever.<br/><br/> Committing crimes has never been more complex. In \"Collector Thief\" every step counts. Understanding the placement of guards or cameras is essential for the robbery to be a big hit and you can move forward. Here intelligence is more powerful than brute force. With minutely designed defenses, winning each of the scenarios and progressing through the story can be tricky for even the most attentive players.<br/><br/><strong>Brilliant Thief Guide Part 1:</strong><br/><br/><ul><li>Collect items scattered around the map as they generate money and overall score;<br/></li><li>Use the scenery to your advantage so as not to be seen by any guards or cameras;<br/></li><li>Some places have elements that can be turned off to enter without attracting attention;<br/></li><li>The Sect's Shop contains items that are indispensable to the success of every robbery;<br/></li><li>There are hints and easter eggs in the scenarios that can help you understand the hypotheses;<br/></li><li>Always use the game save/load feature to keep trying the adventure at other times.<br/></li><li>Be quick and finish the job before dawn. </li></ul><br/> Collector Thief is a singleplayer game created for the unique purpose of entertaining players with a complete story while keeping its gameplay at high difficulty from the first minute of gameplay. It has the simple controls that make the experience enjoyable but it gets into the type of game that is easy to play but difficult to master. It is a complete experience of intelligence, good humor and creativity.", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2021-12-20T03:39:40", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ff7d7f112cbebabb540b7045bae2b22.jpg", "website": "https://heartbeatgs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Heartbeat Game Studio"], "genres": ["Strategy", "Indie"], "publishers": ["Heartbeat Game Studio"], "esrb_rating": null}