{"id": 711031, "slug": "astatos", "name": "Astatos", "name_original": "Astatos", "description": "<strong>Astatos</strong> is a card-battling adventure filled with gods, heroes, and the instability of yourself and those around you. A unique blend of engaging narrative and tabletop-inspired card action about the influence you have on others.<br/><br/><h3>THE TRIAL BEGINS</h3>Play online in chaotic co-op action for up to eight players, or face-off in strategic one-on-one card-battles. Match cards, cast spells, summon heroes, and turn the opposing team over to your side to come out victorious!<h3>CALL FORTH YOUR HEROES</h3>Summon a wide range of heroes to win the Trials ahead! Each with stunning artwork and unique abilities that lead to endless combinations. Just be sure your opponent doesn’t turn them against you!<br/><br/><br/><h3>THE FUTURE OF THE CROWN MAGES</h3>As rebels approach, Vitus and Volesus must flee the academy and leave their order behind. Unleashing an ancient god and devil, the two adventure to uncover their past, influence the land around them, and find a place to call home.<h3>FREEDOM OR ORDER</h3>With the country in chaos, everyone has their own thoughts to share. Meet a wide range of characters who each have their own morals and desires. Make decisions and convince others to follow your lead, no matter the consequences.<br/><br/><br/><h3>TIME TO TAKE A BREAK</h3>Collect mementos of your adventure and head to the bathhouse. Interludes between chapters let you spend mementos and get closer to your companions, which may in turn, influence later events.", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2021-12-20T02:56:02", "background_image": "https://media.rawg.io/media/screenshots/637/637e4babc7a2ebd0fca1a2290e7621ba.jpg", "website": "http://klondike.studio/astatos", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 8, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 450, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Studio Klondike Australia"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Studio Klondike"], "esrb_rating": null}