{"id": 711071, "slug": "square-off-2", "name": "Square Off", "name_original": "Square Off", "description": "Roll to move. Move to aim. Aim to win. <br/>You're a square, and it's time to Square Off!<br/><br/>Up to 4 friends get to battle it out in this \"edgy\" arena party brawler with unique controls.<br/><br/><strong>A New Spin On 2D Platforming</strong><br/>You move by rolling. You also aim by rolling. You can climb anything. Chaos reigns supreme with this control scheme.<br/><br/><br/><br/><strong>We Accept All Types Of Playstyles</strong><br/>Want to play skillfully and maneuver like a master? That works.<br/>Want to button mash and create mayhem wherever you roll? Yeah, that works too.<br/><br/><strong>Orient Yourself To Your Abilities</strong><br/>Obliterate your friends with an array of unique abilities that attach themselves to one of your sides. Use these to fight off your friends! <br/>If you survive long enough, you'll be able to pick up boosts that jetpack you across the map or shield you from harm.<br/>If you keep surviving, acquire an ultimate ability to unleash complete devastation on your friends.<br/><br/><br/><br/><strong>Location Location Location</strong><br/>A multitude of stages with unique mechanics add to the chaos by providing new possibilities for play, whether you're bouncing sky-high, knocking another player into lava, or throwing yourself through a teleporter.<br/><br/><br/><br/><strong>Support For The Underdog</strong><br/>Losing? Don't worry! With a variety of underdog powerups, no game will ever be truly lost as you unleash new powers that increase in power the further you are behind.<br/><br/><br/><br/><strong>Free Forever</strong><br/>Play with your friends for free. This will never change regardless of how much new content goes into the game!", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T04:18:03", "background_image": "https://media.rawg.io/media/screenshots/ee0/ee0f25db146b2424dee9c6f326ef4944.jpg", "website": "https://www.shibadogstudios.com/games/square-off", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Shiba Dog Studios", "Shawn Huang Fernandes"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Shiba Dog Studios", "Shawn Huang Fernandes"], "esrb_rating": null}