{"id": 711094, "slug": "duskwitch-heroic-soul", "name": "Duskwitch: Heroic Soul", "name_original": "Duskwitch: Heroic Soul", "description": "In a world governed by an organization of Witches known simply as the High Coven, Witches, humans, elves and more live together in peace. All of the world’s evils were kept in check by Rutie, a powerful witch known as the Warden Witch, who used her extraordinary magic to watch over her prisoners and put them back in their place if they ever escaped. Among them was an ancient being known as Azazoth, a formless elder god that could bring doom to the world if he ever escaped. Unfortunately, one night Rutie overslept and Azazoth took the opportunity to do just that! He destroyed a third of the world’s population and spread his shades, referred to as Remnants, across the earth to consume human souls. He was recaptured by the rest of the Coven, but not until the damage was already done. Now he lays in wait as his Remnants continue to devour human souls, slowly regaining his power through each soul consumed. Thanks to this colossal blunder, Rutie was demoted from her position as the Warden Witch, had her magic taken from her by the High Coven, and was given a standard-issue Broom: a gun that uses soul energy to fire magical bullets. Rutie was given the title of Dusk Witch, tasked with cleaning up after herself and eliminating all of the Remnants before they can do any more damage to the world, and to store the souls that the Remnants devoured in her Broom so that they can be protected by the Coven and not handed to Azazoth. Thrust into this monumental task on her own, Rutie must square up to the challenge and use the Broom to dispatch as many Remnants as she can before it’s too late! <br/><br/><br/><br/><strong>CUTE GIRLS!!</strong><br/><br/>Rutie will meet many colourful characters, alive and dead, as she fights her way through this shattered world of her own making! Those with a powerful will to live and die fighting valiantly way are turned into Heroic Souls, and Rutie is able to befriend them and use their Souls to power her Broom, changing the way she fights!<br/><br/><br/><strong>STYLISH COMBAT!!!</strong><br/>Each Heroic Soul she meets will give her access to a new set of abilities, allowing her to switch between them at any given time using Q/E (or the RB/LB on controller). Mix up your moves from all four fighting styles and create your own stylish combos to become the master of style!<br/><br/><strong>DEEP STORY!!!</strong><br/><br/>As Rutie continues along her quest, she will soon realize that nothing is all that it seems...The High Coven seems to be up to something, and she will be forced to confront the truths of this world! Follow Rutie along her quest and interact with many colourful characters as she fights her way to the story's conclusion.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-20T03:46:58", "background_image": "https://media.rawg.io/media/screenshots/3bb/3bbbd05186243c4bda366a2f0a0c1a2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VIVIDBLUE"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["VIVIDBLUE"], "esrb_rating": null}