{"id": 711070, "slug": "midnight-submersion-nightmare-horror-story-prologu", "name": "Midnight: Submersion Nightmare Horror Story Prologue", "name_original": "Midnight: Submersion Nightmare Horror Story Prologue", "description": "Midnight Submersion: Nightmare Horror Story Prologue -The first location is available for the passing. You are offered to play as the main character and you do not have any restrictions for exploring the area.<br/>\r\nTry to get what is going on there!<br/>\r\nActions have been started in a lost place which is surrounded by the forest.<br/>\r\nThe city was covered by darkness. The night is full of silence. The atmosphere is creepy.<br/>\r\nSome thoughts in mind: who am I? where am I? Is it an abduction? No, it could not be for real, I should be bound. We have already started to explore the surrounding area. All people are gone, they have lost personal stuff that could remind us about their existence.<br/>\r\nWhat is going on here? Is it a silhouette into a thin mist?<br/>\r\nWhen we started to be closer, we get that it is a dummy. A lot of questions and without any answers.<br/>\r\nDummies can move and it's terrible!<br/>\r\nWhich kind of creatures are they? Runaway - only one thing that should I think about right now! Something weird is happening here.<br/>\r\nWill the place let us go? This is only the beginning, we should understand what would happen next.<br/>\r\nIt is an attractive horror\\thriller game from the first face with some elements of a puzzle game and epic storyline.<br/>\r\nYou have just woken up in a mysterious house. It's night outside.<br/>\r\nYou do not remember how did you get into the house.<br/>\r\nThe note is laying on the stand.<br/>\r\nOne thing that you know is the Brewding laboratory.<br/>\r\nYou do not understand what is going on here.<br/>\r\nYou have a flashlight.<br/>\r\nYou feel weak and you should explore the countryside. Try to find food and a battery.<br/>\r\nThe only thing that you could meet in the countryside is dummies. Some of them are aggressive and may attack you. You should know who is your enemy and who would help you.<br/>\r\nThey are living their own life and your presence is unpleasant.<br/>\r\nThe mission is to understand what does this organization means and what do they hide.<br/>\r\nTry to get out of this place and nobody knows what would happen next.<br/>\r\nMain game features:<br/>\r\n- Breathtaking plot;<br/>\r\nWhen you do not understand why are you in so mysterious place, you should start to recognize the all details to make the chronology of developments.<br/>\r\n- Creepy atmosphere;<br/>\r\nSilence and strange developments feel like a nightmare but its real.<br/>\r\n- Location with the particular qualities;<br/>\r\nExplore each location to find the answers! It is not so easy to find the right way of leaving.<br/>\r\n- Curious puzzle game;<br/>\r\nNot explored location full of dummies. You have an amnesia! Start to find the hints!<br/>\r\n- It is night time on the streets", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T03:29:06", "background_image": "https://media.rawg.io/media/screenshots/de8/de8ef99d9699a257e57403b513bbaea6.jpg", "website": "https://midnight.works/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midnight Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Midnight Games"], "esrb_rating": null}