{"id": 711014, "slug": "trijam-149-flippin-mad-pinball", "name": "Trijam 149 Flippin Mad Pinball", "name_original": "Trijam 149 Flippin Mad Pinball", "description": "<p>Hi there!</p>\n<p>This is a WEIRD pinball game - bare with me for this one:</p>\n<ul><li>You only have one flipper and whenever you press SPACE you activate it</li><li>However there is a twist: If the flipper is on the left half when hitting space, it moves up (rotates clockwise), if it is on the right half when hitting space,it will move counter-clockwise</li><li>You get 100 points each time the pinball hits the bonus bouncer thingies :)</li><li>So you need to time when you activate the flipper (as a help, there is a minimap on the top right)</li><li>How does it fit the theme? Well you control a flipper; the flipper will make you FLIPPIN mad, cause you cannot control it as in any conventional pinball game</li><li>You could say this is a FLIPPIN ANNOYING pinball game</li></ul>\n<p>The weird flipper was actually turned from a bug to a feature; I could not figure out the 2d hinge collider for the right flipper and just tossed the idea after 20 min; instead I discovered the weird effect where the flipper changes rotation depending on where it is - so there it is. A game entirely basd on a bug.</p>\n<p>I know the game is a bit too hard and unforgiving but I ran out of time to balance the game :( </p>\n<p>Time needed: 3hrs (coding/unity app. 2hrs, art 50min, sound effects 10 min</p>\n<p>Credits font:</p>\n<p><strong>LL Pixel</strong> by Markus Schröppel <br/></p>", "metacritic": null, "released": "2021-12-12", "tba": false, "updated": "2021-12-17T11:48:27", "background_image": "https://media.rawg.io/media/screenshots/0c8/0c88343d859550acfb36dce42b1a2d12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["misterG420"], "genres": [], "publishers": [], "esrb_rating": null}