{"id": 711192, "slug": "football-dungeon-secret-santa-jam-2021", "name": "Football Dungeon (Secret Santa Jam 2021)", "name_original": "Football Dungeon (Secret Santa Jam 2021)", "description": "<p><em>Football in the age of monsters seems to involve a lot of fouls and disqualifications, but the crowds go wild, and some say humans are the greatest monsters of all... </em></p>\n<p><em>Coach your team to move in close to defeat opponents, carefully considering each players' strengths and weaknesses (attack, health, and movement) and how the opponents will retaliate!<br/></em></p>\n<p>---</p>\n<p>A small turn-based tactical game made in PICO-8 as a gift for one specific internet gamedev stranger, for <strong>Secret Santa Jam 2021</strong>.\r\n</p>\n<p>Part of the giftee's prompt was \"I like playing games that make me think and involve some kind of strategy e.g. card games like Magic the Gathering [...] I am a huge football fan. I support Manchester United in England and Borussia Dortmund in Germany. I have a rubbish Windows laptop, so any game that can run in browser works best for me.\", so I tried to follow inspiration from there...</p>\n<p>Sadly, there are no sound effects or background music (I ran out of time), but feel free to play the music of your choice in the background. Enjoy! :)</p>\n<p><strong>Miscellaneous Thanks: </strong> </p>\n<p>I used this free pack of sprites as a starting point for the character sprites: https://route1rodent.itch.io/16x16-rpg-character-sprite-sheet<br/></p>\n<p><strong>Future Ideas:</strong></p>\n<p>I had ideas for 'drafting' a team of different players that you get to upgrade after each match, and of procedurally generating opposing teams and layouts, but both of these made it harder to balance levels and avoid making them trivial or impossible, so I found it easier to just hard-code a set of player and team upgrades and opponent starting positions for nine matches.</p>", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-20T04:28:41", "background_image": "https://media.rawg.io/media/screenshots/a05/a0586ed01eaabdf0971a63d30265a393.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["icegoat9"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}