{"id": 711142, "slug": "pastaghi", "name": "Pastaghi", "name_original": "Pastaghi", "description": "<p>The story begins centuries ago, in a town where silver travels thru everything and everyone. The town was safe for many years, everything was due to the entity of Pastaghi who now sleeps waiting for the next battle.</p>\n<p>The town received an unexpected visit from the monsters who took over the old mine shafts, they demanded the town's silver; after the townspeople refused, they took it by force.<br/></p>\n\n<p>The entity of Pastaghi, warrior of many battles. Now it journeys thru the mine shafts fighting each and every monster in it's path, retrieving every silver coin the monsters stole.</p>\n<p>Each mine shaft level has a structure similar to an electric circuit, go thru every level fighting the monsters in it. The town needs a hero, are you the one to save them?</p>\n\n\n\n<br/>\n<p>Made by SightCel from Papeero, a 2D action-adventure game. Each monster and their movement are inspired by an electric component while having their own original move-set. figure out what technique works better for you to defeat them and bring justice to the town.<br/></p>\n\n<p>Be sure to follow Papeero to get more content like this, keep an eye for updates and new projects. Thank you for visiting!<br/></p>\n\n\n\n<br/>\n<p>m o n s t e r s    y o u ' l l    e n c o u n t e r    o n    y o u r    j o u r n e y :</p>\n<br/><strong>          T H E   D I O D E :</strong><br/>Keep your attacks well timed and spaced because this monster can block them with a shield. The attacks will only be effective if you hit the body of the monster.<br/><strong>          T H E   R E S I S T O R :</strong><br/>If you can move your eyes independently, this is your time to shine. This duo crawls up walls while throwing rocks at you, the walls can close in and out, so watch out.<br/><strong>          T H E   I N D U C T O R :</strong><br/>Watch where you aim your attack because this monster floats around the room, it bounces on the mine shaft's walls and throws acid projectiles at every direction.<br/><strong>          T H E   C A P A C I T O R :</strong><br/>Don't get close to this one, it hold acid on it's stomach then it vomits uncontrollably. Keep your eyes open when it vomits upwards because the acid will rain down on you.<br/><strong>          T H E   L I G H T B U L B :</strong><br/>Don't get too attached to the floor, this monster can teleport to a random point of the room. Watch out for the light beam because it tracks you constantly.<br/><strong>          T H E   J U N C T I O N   K E E P E R :</strong><br/>After it catches you trespassing the mine shafts, it battles you. Keep an eye on each one of it's three heads because it can attack you from everywhere.\r\n\n\n\n<p>If you want to go the extra mile, feel free to help Pastaghi's creator by donating, even a small amount can make a huge difference!</p>\n\n<p>You can do this by choosing the amount to donate when downloading the game, if you don't wish to donate, simply select the option to continue with the download for free.</p>\n<p>Either way, don't forget to tell your friends about the game!   :)</p>", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-20T04:16:09", "background_image": "https://media.rawg.io/media/screenshots/a57/a57dac9b8120a882aeb1346d6a6109cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Papeero"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}