{"id": 711195, "slug": "slimy-machines", "name": "Slimy Machines", "name_original": "Slimy Machines", "description": "<p>Come and experience the world of <strong><em>Slimy Machines</em></strong> - the game where I kept accidentally using the names of <em>Horrid Henry</em> characters! Seriously, that franchise has already used half the alliterative adjective + name combinations you can think of. Fortunately, I was able to use the other half instead.</p>\n<p>Created for libGDX Jam 19. The scope of this is larger than my other jam games. What a mistake that was!</p>\n<p>No real mobile support because the controls are barely even functional on PC. So fire up your favourite web browser on your favourite operating system, so long as your favourite is the same as mine. If it's not, well, you'll be stuck playing a black screen.</p>\n<p>Sometimes the splash screen won't do its thing. If this happens, just refresh the page and it'll probably work second time around. If necessary, the Enter key can be pressed to skip it.</p>\r\nHelp\r\n<p>Hi, Greasy Graham here! I heard you needed some help constructing a car? Or maybe even a tank? During the war, my grandfather learned how to drive in a tank. True story!</p>\n<p>I would offer you my words of wisdom in-game, but Scene2D scares the bejesus out of me!</p>\r\nRectangles\r\n<p>Rectangles may be the simplest shape known to man, but they're still a pain to create for a simpleton such as yourself-- I mean Yusef! Yes, my old buddy Yusef is such a simpleton! You, my guy, are the brightest crayon in the box.</p>\n<ul><li>Scroll vertically to make your rectangle taller. Shift and Ctrl make it resize faster and slower.</li><li>Scroll horizontally (hold Alt if you don't have a way of doing this) to make it wider. Shift and Ctrl make it resize faster and slower.</li><li>Rotate your rectangle anti-clockwise by holding down the left mouse button, and clockwise by holding down the right. Shift and Ctrl make it rotate faster and slower.</li><li>Drag your rectangle whilst holding the scroll wheel button to drag it around. Don't have a scroll wheel, gramps? Not to fret - just hold down the S key and drag with your left moue button. The S is for Scroll, to remind you of your lack of a scroll wheel.</li><li>Delete your rectangle by pressing the Del key on your keyboard whilst hovering over it (all this did was crash the game so I disabled it).</li><li>You cannot choose the colour of your rectangle. Perhaps you'll get lucky if you keep creating new rectangles.</li><li>The whole deal with modifying rectangles is very broken. If you're stuck with a rectangle, you might have to refresh the page and start all over.</li></ul>\r\nWheels\r\n<p>Wheels are very important. How do you expect to make a vehicle without wheels?! Well you won't be making a vehicle at all, because I don't have any wheels! Yeah, I know, that's wheely bad news!</p>\r\nJoint\r\n<p>Don't you wish you could join things together so they don't fall apart? You could construct spinning blades of doom and all sorts! Well, that's too bad, because my joints hurt, so no joints for you.</p>\r\nHose\r\n<p>Woo woo woo! I'm a fire engine! Haaa, just kidding. I'm not really a fire engine. But I did once have quite the incident with fire!</p>\n<p>See, I was working on someone's car, and I pondered if fuel was flammable. Next thing I know, the whole building and a family of five were turned to ash!</p>\n<p>Thanks to my quick thinking, I was able to run to the fire exit and escape with no lasting injuries. Lucky for me, I didn't have to go to work the following day!</p>\n<p>If I had any hoses, maybe things would have gone better that day. I still don't have any hoses, so you can't add them to your vehicle.</p>\r\nSticker\r\n<p>Stickers are cool. Except when you try to peel them off and they leave that residue behind. No matter how hard you try, you can never get it off. Someone once tried to sell me \"sticky stuff remover\", but I said NO!</p>\n<p>Anyway, I don't have any stickers in stock yet.</p>\r\nTesting your vehicle\r\n<p>To test your vehicle, simply press the button in the top-left of the screen. You can toggle between the edit and test screens using the Tab key!</p>\n<p>There are no controls while testing your vehicle, as described in the lore you definitely read upon booting up the game.</p><p>Also, there is no vehicle.</p>\r\nSettings\r\n<p>Settings? Look, chum. We don't do settings around here. Time constraints, you see.</p>\n<p>If you want the game to hush, the easiest way is to right-click this tab at the top of your browser window and hope your browser has an option to mute it.</p>\n<p>Or, if you want finer control over the game volume:</p>Operating SystemInstructionsWindowsRight-click the sound icon in the taskbar, then click \"Open volume mixer\".macOSThrow it in the bin.Linux (depends on distro)Click the sound icon in the top panel, then \"Sound Settings...\" then \"Applications\".\r\n<p>There's also that handy-pandy full screen button itch.io added to the game. Yes, it actually works!</p>\r\nCredits\r\n<p>If I list unused assets here, I won't have to find their links again if I ever do use them. </p>\n<strong>Graphics</strong><ul><li>Slime Jelly Aspic</li><li>Hammer Wrench Repair (currently unused)</li><li>Gray Bunny Rabbit (currently unused)<br/>\n</li><li>Car Rim Tire (the very one from Unipop!)<br/>\n</li><li>Minty Fresh UI<ul><li>Minty Fresh UI Ver. 1\r\n \r\nCreated by Raymond \"Raeleus\" Buckley\r\nVisit ray3k.wordpress.com for games, tutorials, and much more!\r\n \r\nMinty Fresh UI can be used under the CC BY license.\r\nhttp://creativecommons.org/licenses/by/4.0/\r\n</li></ul></li></ul><strong>Music</strong><ul><li>Her Violet Eyes<br/>\n</li><li>Funked Up<br/>\n</li></ul><strong>Fonts</strong><ul><li>OpenDyslexic</li><li>Ubuntu (unused)</li></ul><strong>Code stuff</strong><ul><li>Tommy Ettinger's riverSway()<br/>\n</li><li>libGDX</li><li>shapedrawer</li><li>gdx-freetype</li><li>gdx-freetype-gwt</li><li>gdx-box2d<br/>\n</li></ul>", "metacritic": null, "released": "2021-12-19", "tba": false, "updated": "2021-12-20T11:23:28", "background_image": "https://media.rawg.io/media/screenshots/f97/f97d4891f32d5d93a16591ee81df9a68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["James", "Java Cake Games"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}