{"id": 71144, "slug": "lucky-time-slots-vegas-casino", "name": "Lucky Time Slots: Vegas Casino", "name_original": "Lucky Time Slots: Vegas Casino", "description": "*Casino slots fans - it’s time to get lucky with Lucky Time Slots!*<br/>Step into this huge online casino, filled with the hottest free slots games by Konami and Ainsworth! With new slots added regularly, this free Vegas casino game brings you nonstop BIG WINS and JACKPOTS. Play the latest free slot machines, now including Fu Festival, Inca Moon, and the famous Love Stacks Jackpots by Konami Games. Lucky Time’s free Vegas slots game is designed for true Las Vegas casino lovers &amp; Konami slots fans! <br/><br/>The creators of the acclaimed Old Vegas Slots bring you another free casino game, this time with stunning video slots from casino experts like KONAMI and AINSWORTH. Claim your HUGE welcome bonus and enjoy the widest selection of video slots online. From Las Vegas to Melbourne, Lucky Time features the best slots games from around the world! Play the best new slot machines with every update!<br/><br/>*Free slots games from Konami &amp; Ainsworth!*<br/>- Fall in love with big wins on the famous Love Stacks Jackpots slot machine from KONAMI.<br/>- Embark on an adventure with exotic casino games by AINSWORTH like Cash Cave, Roaming Reels, and Crystal Cash! <br/>- Find your fortune in new slots games including Fu Festival, Inca Moon, and Lucky Choy Sun! Get your chance to HIT amazing WINS with the unique Fire Cash feature!<br/>- Spin the Gladiator Bonus Wheel and conquer the casino slots empire with the Gladiator slot machine! <br/><br/>All slots are waiting for you in this free online slots casino game! Collect your free coins, pick any of the amazing free slot machines, and hit that LUCKY TIME JACKPOT!<br/><br/>*Big Wins, Bonuses, &amp; Jackpots!*<br/>Huge welcome bonus anyone? Daily big wins, bonuses, and HUGE JACKPOTS are packed in every slot machine in the Lucky Time Slots casino! A generous free welcome bonus will get you on your way to lucky BIG WINS and 777! <br/><br/>*Feel the Vegas casino thrill anytime, anywhere!*<br/>Enjoy all the genuine Las Vegas slots included in our free casino game, from your desktop or mobile device! <br/><br/>Additional Casino Slots Bonus Features:<br/>- HUGE free coins welcome bonus for new players!<br/>- The Lucky Slot feature increases payouts on all slot machines! <br/>- New slots and special features added regularly. <br/>- Daily and hourly bonuses! The more free slots games you play, the bigger the bonus!<br/>- Invite friends and get even more FREE COINS!<br/>- Enjoy our unique Lucky Time Jackpot for MAXIMUM BIG WINS! <br/><br/>It’s Time to Get LUCKY! Play Lucky Time Slots today!<br/><br/>Disclaimer: <br/>* These slots are intended for an adult audience.<br/>* These slots do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>* Practice or success at social casino gaming does not imply future success at \"real money gambling\".", "metacritic": null, "released": "2016-02-10", "tba": false, "updated": "2019-10-22T13:58:48", "background_image": "https://media.rawg.io/media/screenshots/80c/80c2c9e3e35aed2e0b53071d4fa38e73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DGN Games"], "genres": [], "publishers": ["DGN Games"], "esrb_rating": "Teen"}