{"id": 711496, "slug": "ursine-science-demo-ver", "name": "Ursine Science (Demo Ver.)", "name_original": "Ursine Science (Demo Ver.)", "description": "—Story—\r\n<p>In the city of Enonoia, injustice and crime run only as rife as inequality and repression. Once leading a comfortable youth, Koraki Mavrosa learns firsthand that society is not as it appears. She is left to wander treacherous ground after her family is abducted by the authoritative force of the city: the Master Order Trained Hire.</p>\n<p>In Koraki's interference, she discovers secret technology with which she causes a wild grizzly bear to transform into a man before her very eyes. With nothing left to lose, she harnesses the strength of the silent man she calls Arkuma, who unleashes his wild nature upon revealing he's on no better terms with the police.</p>\n<p>The girl's wish for peace and the beast's disdain for her kind clash as they join forces to topple the institution that wronged them. Can these ideals persist and coexist, or will Koraki and Arkuma's revolution spread even more corruption in its wake?<br/></p>\r\n—Features—\r\n<p>•<em>Ursine Science</em> is an adventure-style visual novel: a text-based game with emphasis on a story—featuring illustrations and a soundtrack—which readers can enjoy at their own pace. <br/></p>\n<p>•The mundane becomes surreal. Experience two unique perspectives and view the world through the eyes of both human and beast, each trampling upon one another for dominance.</p>\n<p>•The thrill of survival awaits. With high-octane action around every corner, Enonoia has never been this dangerous.</p>\n<p>•Serving as a continuation to <em>Ovine Replica</em>, this marks the thrilling conclusion to <em>The Enonoia Saga</em>, now with more immersive visual and audio presentation.<br/></p>\n<p><strong>This is the demo version of <em>Ursine Science.</em></strong> The complete version will be released at a later date.<br/></p>\r\n[Content notice]\r\n<p>This software may be inappropriate for young or immature audiences.</p>\n<p>Sensitive material includes:<br/>•Mild suggestive themes<br/>•Profanity<br/>•Violence and mild blood<br/></p>", "metacritic": null, "released": "2021-12-19", "tba": false, "updated": "2021-12-20T05:39:22", "background_image": "https://media.rawg.io/media/screenshots/976/976ff12ddfc03f0b5a86de6f6aa47263.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Amorous Ursidae"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}