{"id": 711604, "slug": "psychological-assessment-test-v10", "name": "Psychological Assessment Test V1.0", "name_original": "Psychological Assessment Test V1.0", "description": "The Assessment\r\n<p>Thank you for trying out our free first session for your future therapy and agreeing to try out our in-development new form of psychological analysis - directly from your device at home! </p>\n<p>For future diagnosis, please fill out the paper sheets and this questionnaire until the next session. If you find any bugs in our assessment test application, feel free to contact our team so we can adjust the application and thus help future patients!</p>\n<p>---------------------------------</p>\r\nBehind the scenes\r\n<p>This is my first full game, developed while I was on sick leave for two weeks. English also is not my main language, so please bear with me while I fix typos and bugs - feel free to note them in the comments, though! Any feedback is highly appreciated. </p>\n<p>All sounds, images and fonts used for the project are named in the credits of the game.</p>\r\nFuture plans\r\n<ul><li>German language (button is there, but it does not do anything yet). </li><li>Draggable window.</li><li>Maybe more paths (so far there is three, but  the outcome is the same).</li></ul>\r\nContent Warning\r\n<p>If you are easily triggered by general creepy stuff or mentioning of psychological abuse, please avoid this game. There are flashing images.</p>\n<p>---------------------------------<br/></p>\n<p>If you like what I do please consider donating a coffee for a buck!</p>\n\n<p>---------------------------------</p>", "metacritic": null, "released": "2021-12-19", "tba": false, "updated": "2021-12-20T06:07:03", "background_image": "https://media.rawg.io/media/screenshots/6f2/6f28449a98bb23976e89c6a1fb504598.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tanija"], "genres": [], "publishers": [], "esrb_rating": null}