{"id": 711698, "slug": "space-game-lordmd", "name": "Space Game (LordMD)", "name_original": "Space Game (LordMD)", "description": "<p><strong>Space-Game Pre-Alpha</strong>\n</p>\n<p>This is a framework I have been working on for the past while. It generates a 2D galaxy of stars and planets. Each planet has procedural generated values that determine its 3D shape and colour. The player can visit and discover these planets by traveling around the galaxy. The project currently has no real objective and will eventually be built upon to make a proper game.\r\n  </p>\n<p><strong>Controls</strong>\n</p>\n<ul><li><strong>Space Bar</strong> – Move. Hover the mouse over the desired location and press space to warp to it.\r\n  </li><li><strong>E</strong> – System Viewer. This opens the star system and its planets. Pressing E again will close this menu.\r\n  </li><li><strong>F</strong> – Planet viewer. When the ship is over a planet, the planet viewer can be opened.\r\n  </li><li><strong>W/S/Scroll Wheel </strong>– Change the eccentricity of the orbit inside the system viewer.\r\n  </li><li><strong>A/D</strong> – Change the ship position along the orbit.\r\n  </li><li><strong>Backspace</strong> – Generates a new Galaxy.</li><li><strong>Arrow Keys</strong> - Moves 2D Cameras</li><li><strong>-/+</strong> - Zoom In/Out</li></ul>\n<p><strong>Game play</strong></p>\n<p>The main screen consists of stars and the player ship. The mouse hovers over a tile and a marker shows its X and Y position. Pressing space when the Cursor is blue will warp the player to this location. As the player travels, you will discover new stars. The arrow keys can move the camera around. <br/></p>\n<p>\n</p>\n\n<p>Each star can be viewed in the system viewer by pressing ‘E’. The system viewer has the orbits of each planet in the system along with the player ship. The mouse controls the orbit selector where the highest point is placed at the mouse cursor. W/S and Scroll wheel will change its eccentricity. A/D will move the ship position along the orbit selector. The arrow keys can change the Camera position.<br/></p>\n<p>\n</p>\n<p>The blue orbit is the ship’s actual orbit. By pressing space, the ship will warp to the orbit selector. <br/></p>\n\n<p>Each orbit has an energy. This energy mechanic will play a larger role later in development. Currently the player can only warp to an orbit which has a lower energy than the current energy and stored energy. Each warp will cost a small amount of energy. Bringing the ship very close to the star will increase the stored energy. <strong>Chances are, if you are not playing for extended periods of time, you will not need to worry about these values.</strong> <br/></p>\n\n<p>  <br/> </p>\n<p>By aligning your orbit with that of a planet and having the ship align with the planet location, F can be pressed to view it in 3D. Right clicking will allow you to rotate the camera and scroll wheel will change the zoom.\r\n  </p>\n<p>\r\n   \r\n    </p>\n<p>The current exe is a debug and thus you will have access to the console. In the console, Information about the galaxy and planets will be printed. This will contain some stats about the galaxy and visited planets. \r\n  </p>\n<p>\n</p>\n<p> <br/></p>\n<p><strong>Future Goals</strong><br/></p>\n<p>The ultimate goal of this project is to create a star-trek-esque exploration game with a focus on experiments, exploration and diplomacy. The player will be able to 'chart the stars,' run scientific missions, improve and develop new technology, and potentially assist other civilizations. </p>\n<p>I currently do not have a road map or know what I will be implementing next as this is still within the prototyping stage. I will also only be working on this project in my spare time.<br/>\n</p>\n<p> \r\n  </p>", "metacritic": null, "released": "2021-12-19", "tba": false, "updated": "2021-12-20T06:28:36", "background_image": "https://media.rawg.io/media/screenshots/8ac/8ace335d3a2a99548dd8e7d6212221be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LordMD"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}