{"id": 711646, "slug": "lonely-planet-ctave9", "name": "Lonely Planet (Ctave9)", "name_original": "Lonely Planet (Ctave9)", "description": "<p>Lonely Planet - A game in which you control everything.</p>\n<p><strong> Instructions</strong> - Click and drag the earth to scroll.\r\n</p>\n<p> Click the properties that you own to sell (gives you half as much as you spent) or upgrade (up to 10 upgrades per property). \r\n</p>\n<p>Hover your mouse over the shop to open it and click on the lit-up properties to buy them, then click on an empty piece of land to place them. \r\n</p>\n<p>See how much money you can make!\r\n</p>\n\n\n<p><strong>Story</strong> - The world, forgotten, was abandoned by mankind during the 31st century.</p>\n<p> One day, you decide to find out if you could do anything about it. So you write a letter to the Council to find out if you could buy the earth. </p>\n<p>Turns out that nobody wants it, and you can have it for free!</p>\n<p> When you arrive, there seems to be nothing, except a broken lemonade stand, sitting through the ages. </p>\n<p>You decide to fix it up, and a little later you have poured your first glass of lemonade. A group of Government officials, with the task of checking in to make sure that all was going well, see the stand and ask if they could have any. </p>\n<p>You decide that $1 makes sense. They say thank you and collect some glasses of it. This is the start of an empire. After this encounter you decide that you will use the earth as an asset, building houses and factories, selling food at shops and restaurants.</p>\n<p> Little by little, people start coming to taste and enjoy the wonders of your own world. Your income starts to increase, you are now making factories by the dozen, and people are coming for their holidays to earth and are staying in BnB's that you set up.</p>\n<p> What happens next is up to you!</p>", "metacritic": null, "released": "2021-12-19", "tba": false, "updated": "2021-12-20T06:17:20", "background_image": "https://media.rawg.io/media/screenshots/1f9/1f99384692671c547295a8e8b3f8ca04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ctave9"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}