{"id": 711775, "slug": "connectogramjs", "name": "CONNECTOGRAM.js", "name_original": "CONNECTOGRAM.js", "description": "<p><strong>Photosensitivity Warning:</strong> (Bold, contrasting visual patterns and flashing colors)</p>\n<p>To help me finish a small JRPG-style game, I downloaded a type of tool (called a plugin) that promised to better organize all my game's data. It was supposed to help me visualize where all the sounds, images, map and character data are stored.</p>\n<p>Instead, the plugin - titled CONNECTOGRAM.js - hijacked my game. It compressed everything into an .exe named after itself  and corrupted most of the game files. Some of them were replaced with default assets from an older version of the engine I'm using. Everything in the original source folder is encrypted as well.<br/></p>\n<p>Now every time I try to open the game engine editor, it asks for a code in order to open, and I don't know what it is. I'd just delete my project and start over, but I've already put a lot of time into it, and it might be impossible to rediscover some of the good plugins locked inside.</p>\n\n<p>I can't even remember where I downloaded CONNECTOGRAM.js because it's been so long since I got it, and it doesn't show up in a Google search or my browsing history.</p>\n<p>I've gotten stuck trying to play through the corrupted mess that the game turned into, and I'm not sure how much of my work made it or what was altered. If you can figure out the code to unlock my project, I'd be forever grateful, and I included a troubleshooting video here that was originally meant to show a friend all the damage the plugin did.<br/><br/></p>\n<p><strong>Downloadable Files + Windows/Android Support<br/></strong></p>\n\n<p>What's left of the game is playable directly in this page, natively on Windows or Android, and on Mac via Wine/WineBottler. However, you'll be able to get the best look at it by playing on Windows/Mac and downloading the included files. I'm not sure what you'll find, but hopefully there's something helpful to unlocking my editor if you can manage to view the game files.<br/></p>\n\n<p><strong>Donations</strong><br/></p>\n<p>The project folder now corrupts any new files placed into it - encrypted or not. If you leave a donation and would like a song or up to four images corrupted in the style of the game, please feel free to reach out to trashdaggers@gmail.com with the email address you donated from and the media you'd like me to put in the proverbial blender. Instrumentals come out cleanest, and it helps  if they're part of an album I can pull from.<br/></p>", "metacritic": null, "released": "2021-12-18", "tba": false, "updated": "2021-12-20T06:47:52", "background_image": "https://media.rawg.io/media/screenshots/de2/de2bae0ce205bc06f9d69292c7db6e1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "Web"], "developers": ["TrashDaggers"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}