{"id": 71170, "slug": "caesars-real-money-casino-nj", "name": "Caesars Real Money Casino NJ", "name_original": "Caesars Real Money Casino NJ", "description": "Enjoy real casino action in true Caesars style anytime, anywhere in New Jersey with the Caesarscasino.com mobile app. Get $10 Free just for registering. No deposit needed. Play blackjack, roulette, slots, video poker and more. All the famous favorites and big progressive jackpots are at your fingertips.<br/><br/>The CaesarsCasino.com Real Money Mobile Casino allows you to be your own Pit Boss with all of the best casino games available. This is your own personal Atlantic City, wherever and whenever you want in New Jersey. This is real casino gaming with real money payouts, by the iconic Caesars brand that you know and trust. Play how you like, on your terms.<br/><br/>For more than 30 years, Caesars has been the gold standard in casino gaming and with the launch of the CaesarsCasino.com New Jersey online casino and app, the glamour of Vegas is right in your pocket.<br/><br/>Download the app today experience the thrill of Caesars instantly. <br/><br/>Safe and Secure – Caesars has been a trusted name in gaming for decades.  The CaesarsCasino.com mobile casino app is a completely secure, legal US gaming site. It is fully licensed in New Jersey and has its casino games audited in compliance with the New Jersey Division of Gaming Enforcement. <br/><br/>The Next Generation of Casino Gaming – With CaesarsCasino.com, you don't have to head to Vegas to enjoy the excitement and glamour of casino games. You can play anytime, anywhere in New Jersey from our mobile casino app. You'll never miss out on a spin on the slot machines again just because you're on the go!<br/><br/>How do I play? – You must be 21 years or older and be physically in the state of New Jersey to play casino games in the app. Download now and play real money games with your $10 FREE sign up bonus.<br/><br/>At CaesarsCasino.com, Responsible Gaming is Our Business®. If you think you or someone you care about may have a gambling problem, please call 1-800-GAMBLER.<br/><br/>*Real Money casino gaming is only available to players who are physically in the state of New Jersey<br/>*The $10 free bonus is available to new registering players at CaesarsCasino.com only.", "metacritic": null, "released": "2014-07-30", "tba": false, "updated": "2019-10-22T14:00:07", "background_image": "https://media.rawg.io/media/screenshots/58a/58a0ff4e4125de1551f3b759e2075f7b.jpg", "website": "https://www.caesarscasino.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Caesars Interactive Entertainment"], "genres": ["Card"], "publishers": ["Caesars Interactive Entertainment"], "esrb_rating": "Mature"}