{"id": 711703, "slug": "the-hollow-era-outlands-sandbox-demo", "name": "The Hollow Era: Outlands - Sandbox Demo", "name_original": "The Hollow Era: Outlands - Sandbox Demo", "description": "You are Tikal;\r\n<p>A brave young boy from a small village, hundreds of miles away. All by your lonesome, on a mission that means the world to you, and that has also put your life on the line.</p>\n\r\nYou are on Epexsus;\r\n<p>A small war torn planet, in a remote galaxy far across the universe, full of all sorts of unique dangers. A once prosperous world now in a post apocalyptic state after decades of war.</p>\n<p>This is The Hollow Era: Outlands, a solo-developed, episodic and story driven game, about a strong warrior boy from a savage land, braving the elements and going on a life changing adventure. </p>\n<p>This is the \"sandbox demo\", in which you can get hands on with the game's concept, get a taste of the mechanics and overall feel of the game. It contains up to an hour or more of gameplay, voice acting, cinematic cutscenes, and also its own soundtrack composed by the developer, as well as a special ending upon completion.</p>\n<p>As for the gameplay, think \"Dark Souls meets Mirror's Edge\". Tikal is trained in the ways of the spear, as well as effective traversing of any environment. You must win fights against various enemies and solve parkour puzzles to complete the game.</p>\n\n<p>If you like the game, and/or liked the art, feel free to follow me on over on Twitter for more!</p>", "metacritic": null, "released": "2021-12-19", "tba": false, "updated": "2021-12-20T06:30:02", "background_image": "https://media.rawg.io/media/screenshots/ff3/ff36d8324b67ae6542cda420e1a8dafc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["parimak"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}