{"id": 711872, "slug": "imperios-estelares-surgimiento", "name": "Imperios Estelares - Surgimiento", "name_original": "Imperios Estelares - Surgimiento", "description": "<p>Imperios Estelares - Surgimiento is a turn-based 4X strategy game set on space, in the Orion Arm. You can choose between nine different species, expand by dozens of solar systems and hundreds of planets. Design your warships, recruit troops and crush your rivals or develop your technologies to get a diplomatic victory or a combination of everything to achieve first place at the end of the game.</p>\n<p> <br/><strong>FEATURES</strong></p>\n<p>You have nine species to choose from. Each species has some peculiarities such as number of initial planets, technologies, government and economic system.</p>\n<p>Minimal micromanagement of planets. You only have to worry about strategic decisions. You can manage dozens of solar systems and hundreds of planets with ease.</p>\n<p>Reasonable micromanagement of land and space combat. Decisions can be made in battle without having to manage each individual starship.</p>\n<p>Robust AI. Artificial opponents make decisions to ensure the survival of their forces and better management of their resources. The AI is the same in normal or hard modes, taking advantage of only the initial colonization skills, without cheating to give the AI advantages.</p>\n<p>Random events that could give bonuses to all players.</p>\n<p>Modification capacity. The game allows uploading of personal mods to enhance the gaming experience.</p>\n<p>Support for Spanish and English languages. <br/></p>\n<p><strong>MINIMUM SYSTEM REQUIREMENTS</strong></p>\n<p><em>Operating Systems:</em> <br/>GNU/Linux Mint 19.1 or equivalent debian-based distro.  <br/>MS Windows 7. </p>\n<p><em>Hardware:</em>INTEL Atom N450 1.66 GHz<br/>1 GB of RAM.                      <br/>300 MB hard disk space.        <br/>OpenGL support.<br/><br/></p>\n<p><strong>COMMUNITY</strong></p>\n<p>Share your opinion about the game, mods and more in our forum: https://iestelares.foroactivo.com<br/></p>\n<p> <br/><strong>SUPPORT</strong></p>\n<p>Do you have any question or special requirement? write to user support: <br/>iestelares.au@gmail.com</p>\n<p>Register your game at: <br/>iestelares.rg@gmail.com<br/></p>", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T07:15:07", "background_image": "https://media.rawg.io/media/screenshots/e56/e56a30006e2e8471934f168b2f28e8e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["A.5 Studios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}