{"id": 711876, "slug": "yi", "name": "YI", "name_original": "YI", "description": "<p>This game is based on the traditional Chinese myth story Archer and  the Suns. Traditional mythological stories are all about events that  happened in the past. The main idea of this game is to use old  fictitious stories to adapt a myth about the future. \r\n</p>\n<p>The  background of the game Yi is set in the future wasteland era. With the  advancement of science and technology and population growth, people have  invented too many intelligent tools for resource extraction and  improved living standards. But during this period, artificial  intelligence became more and more perfect and gradually produced  thinking. They have overgrown and out of control, successively  controlling a large number of intelligent tools and resources that  people depend on for survival and supervising people to serve them. \r\n</p>\n<p>Some  people who have escaped supervision have quietly developed a small  robot that can evade the signals of artificial intelligence supervision  and named it Yi. This little robot carries a sabotage program and walks  in the wasteland quietly to destroy the artificial intelligence  supervision program. People pin their hopes on this robot called Yi,  hoping that Yi, the once mythical hero symbol, can again save sentient  beings' destiny. \r\n</p>\n<p>Since the game is designed based on  traditional Chinese mythology, I consulted a large number of ancient  classics and documents that record The Archer and the Suns and adapted  this mythological story according to the plots in the original text. I  finally formed the prototype of the three levels of the game. Based on  the area mentioned in the original text, I investigated the geographical  environment of the site in detail to design the scene. The character  design also refers to the culture and equipment of the corresponding  period in ancient times. \r\n</p>\n<p>The game production process mainly  used Maya, Unity, Premiere, RizomUV, Photoshop, Substance Painter, etc.  The programming language is C# <br/></p>\n<p>*Similar to most games, Yi also uses four WASD keys for spatial displacement and the space bar controls jumping. Players can click the reset button in the upper right corner of the screen to restart the game. After passing, players can jump to the next pass by asynchronous loading until the end of the game, and return to the first pass to start a new round.<br/></p>", "metacritic": null, "released": "2021-12-18", "tba": false, "updated": "2021-12-20T07:15:57", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8bca0b91d7443929aca9f2bba643bab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Algus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}