{"id": 712196, "slug": "scuffy-suspension", "name": "Scuffy Suspension", "name_original": "Scuffy Suspension", "description": "<p>Scuffy Suspension.. A Beautiful Game Inspired By Hill Climb Racing. Scuffy Suspension is a game about getting to the end with enough petrol/gas and you need to complete the 6 maps, because i only made 6 maps..</p>\n\n<p>Also The Wheels Are Very Scuffed, They Fall Apart When You Go To Fast But I'm Keeping It, I Need Some Suspension</p>\n\n<p>Anyway This Game Is For The Barjam Winter 2021 And I Guess You Could Say It's A Remake Of My First Game But In 2D.</p>\n<p>Level Info:</p>\n\n<p>Level 1:</p>\n\n<p>Level 1 Was Made Just For A Nice Simple Test, get the petrol and get to the end</p>\n<p>Level 2: </p>\n<p>The Design For Level 2 Was A Bit Weird, I Wanted To Make Everything A Bit More Challenging But The Wheels Keep Getting Some Type Of Stroke Everytime I Did Steep Hills And Stuff Like This, I Kept This Part Of The Map Cause It Is Accessable To Easily Get Across, If you are a pro gamer ofc</p>\n<p>Level 3: </p>\n\n<p>Level 3 Was Half a failiure, In Most Of The Map You Can See The Grass Inside The Terrain, I Don't Know How To Fix This So I Just Left It, But Also The Old Mesh Still Works So I Got Insanely Confused, I Didn't Bother Fixing It Though Due To Time.</p>\n<p>Level 4: </p>\n<p>To Make Level 4 More Interesting, I Only Put 1 Fuel Tank In The Entire Map, And Bumped Up The Fuel Usage So You Have To Be Pretty Careful When Using Your Fuel, I Have Done This For The Maps After Level 4 Because I Want A Goal Change For The Other Maps.</p>\n<p>Level 5: </p>\n<p>if you are smart, you don't need a description for level 5, it's just half of level 4.</p>\n\n<p>Level  6: <br/></p>\n<p>For Level 6 There Are A Few More Ramps But That's All It Is Apart From The One Petrol Can.</p>\n\n<p>Credits: </p>\n<p>Game Art: Mobile - Hill Climb Racing - Everything - The Spriters Resource</p>\n<p>Gamejam: https://itch.io/jam/barjam-winter</p>", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T08:40:18", "background_image": "https://media.rawg.io/media/screenshots/6c1/6c1761d53d08e4eee94fb45fe7b2c573.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Linux", "Web"], "developers": ["FraserGameDev"], "genres": [], "publishers": [], "esrb_rating": null}