{"id": 71212, "slug": "vegas-tower-casino-slot-games", "name": "Vegas Tower Casino: Slot Games", "name_original": "Vegas Tower Casino: Slot Games", "description": "Play &amp; enjoy Vegas Tower Casino’s Free Slot machine games! The wonderful slot game app on iPhone with large amount of welcome bonus 3 000 000 Free coins. Experience soul of Las Vegas slots with daily free coins, jackpots, and big wins.<br/>Get now and spin the AMAZING slots PAYOUTS with fantastic features – anywhere, anytime!<br/>FEATURES<br/>- Best online Casino slot machines: Quickshot, Quickshot2: Diamond Wilds, Lightning Fortune of Zeus, Triple Wild 777, Diamond Fortune, Golden Pearls, Super Purple, Crazy multiplier, Golden Buffalo, Crimson diamonds and many more the Best Slots Games<br/>- 3,000,000 FREE Welcome Bonus Money!<br/>- Millions of FREE bonus coins delivered every hour!<br/>- Exciting Daily Wheel Bonus every day!<br/>- NEW and Hot slot games added regularly!<br/>- Attractive Designs, breath-taking animations, and Las Vegas Ambiance Sounds deliver Vegas Slots &amp; Casino Experience anywhere<br/>- Play with your friends and exchange FREE coins, or you can even make new friends in Vegas Tower Casino for more bonus Coins!<br/>- Spin 777 Worldwide Linked Progressive Jackpot Slots machines in Vegas Tower Casino and Hit more and more EPIC WINS! with your friends and exchange FREE coins, or you could even make new friends in Vegas Tower Casino for more bonus Coins. You have never experienced as much as fun of playing Vegas Tower Casino- Free Slots.<br/><br/>Win Big while playing fun online slot machines in a chic luxurious environment of real Vegas Casino for FREE! Come and install Vegas Tower Casino- Free Slots now, you will be VIP Casino member of fun slots and casino games with Free Coins!<br/>Why don’t you Join Free Slots casino which is Hot in Your Slots Community! Grab Bonus Coins and start winning Jackpots!<br/>Come and Join our lovely slots Community of over 172k followers who enjoy, have fun and love, LIKE our Fan Page (www.facebook.com/vegastowercasino) to get notified of our SPECIAL offers and FREE Bonus links updated frequently and social club members are exchanging their Opinions. Tell your Friends Best New Free Slot 777 Machines are arrived!<br/><br/>Vegas Tower Casino free Slot games capture the incredible thrill of the Las Vegas casinos with state of art graphics Design! Incredible Slot play experience in Visual effects! Amazing many more themes in Vegas Casinos!<br/><br/>Our Casino Slots deliver Authentic Las Vegas casino experience! Install Now! Spin Now our Real Casino Slots! Start spinning our casino’s 777 reels and play anytime anywhere<br/><br/>Vegas Tower Casino app is intended for use by clear adults 21 or older, and for amusement purposes only. This product does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling. All results are absolutely based on luck and chance. Every choices made by players in the tournament.<br/>Terms of service: http://vegastowerslot.com/vegastower/?page_id=4014", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-10-22T14:00:40", "background_image": "https://media.rawg.io/media/screenshots/0ac/0acf779180af2f5da143abdc19bb8813.jpg", "website": "http://www.vegastowerslot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jiwoo Games"], "genres": [], "publishers": ["Jiwoo Games"], "esrb_rating": "Teen"}