{"id": 71221, "slug": "sudoku-10", "name": "⋆Sudoku", "name_original": "⋆Sudoku", "description": "Sudoku by Brainium is the #1 classic Sudoku game you know and love for your phone and tablet, and the best way to learn and improve your skills in this classic puzzle game.<br/><br/>With our Sudoku app, not only will you play a beautiful user-friendly Sudoku, but you’ll have access to the world’s most friendly and complete mobile Sudoku learning system.<br/><br/>With every puzzle, our “Hint” button can teach you the techniques you need to make progress. The instructions are easy to understand and unique for every puzzle with helpful animations, and colorful visuals. The hints don’t just give you the answer, they help you learn “why” the answer is what it is. This feature will help you learn all the techniques you need to solve Sudoku puzzles whether you’re a complete novice playing your first game, all the way to the expert difficulty.<br/><br/>Enjoy a clear, easy to read and customizable Sudoku board with visual guides that make glancing at the possibilities a breeze. <br/><br/>Our input system is designed to make entering solutions and notes magically simple and our friendly scoring system allows you to compete with yourself or your friends regardless of skill level.<br/><br/>Sudoku by Brainium is the most beautiful, learnable, and user-friendly Sudoku game you've ever played before.<br/><br/>Features:<br/>• The world’s most advanced Sudoku learning tool<br/>• The hints will give you the answer but also explain and teach you why the answer is what it is<br/>• Five perfectly balanced difficulty levels from beginner to expert<br/>• Two beautiful grid styles<br/>• Choose light or dark grid fonts with adjustable size<br/>• Endless collection of masterfully crafted puzzles<br/>• Useful statistics to keep track of your progress<br/>• Unlimited Undo/Redo<br/>• Auto-Fill Notes Option<br/>• Auto-Clear Notes Option<br/>• Auto Error-Checking Option<br/>• Portrait and Landscape Views<br/>• Advanced game options and notes<br/>• Five gorgeous themes<br/>• Universal App looks great on iPhone and iPad<br/>• Global and friend leader boards<br/>• Portrait and landscape play options<br/>• Right or left handed option in landscape<br/><br/>We hope you enjoy Sudoku by Brainium, and please contact our five star support if you have any questions :-)<br/><br/>For the latest exciting news and updates on Brainium games:<br/><br/>LIKE us on Facebook<br/>http://www.facebook.com/BrainiumStudios<br/><br/>Follow us on Twitter<br/>@BrainiumStudios<br/><br/>Or visit us at:<br/>http://www.BrainiumStudios.com<br/><br/>Thanks for playing!", "metacritic": null, "released": "2011-02-11", "tba": false, "updated": "2019-07-29T14:40:49", "background_image": "https://media.rawg.io/media/screenshots/1ee/1ee1278fd38670d8a2a3a66b9ed3e607.jpg", "website": "http://www.brainiumstudios.com/?app=sudoku", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brainium Studios"], "genres": ["Board Games", "Puzzle"], "publishers": ["Brainium Studios"], "esrb_rating": "Everyone 10+"}