{"id": 71228, "slug": "chess-strategy-board-game", "name": "Chess - Strategy Board Game", "name_original": "Chess - Strategy Board Game", "description": "Chess - Strategy Board Game is one of the best chess games for your iPhone, iPad, and iPod! Dowload it now, and play chess online with millions of people worldwide! <br/><br/>Our chess game is an interactive board game with a powerful engine, which is designed to suited, beginners as well as chess masters. Everyone can work out in this game to the top level and improve their chess skill.  The chess supports both 1 player and 2 player gameplay, so you can play against friends or test your skills against a challenging computer opponent.<br/><br/>It is an absolutely FREE chess game. Download this New Chess Game and start playing today! <br/><br/>Chess Features:<br/>- Great graphics, clean and simple interface<br/>- Suppports Player vs Computer or Player vs Player mode<br/>- 4 levels of difficulty, outstanding AI engine<br/>- Customizable chess sets with 5+ styles of boards and pieces<br/>- Solve 20+ challenging puzzles<br/>- Undo-move functionality<br/>- Automatic save when you get a phone call or exit the application <br/>- Keeps statistics so that you can keep track of your improvement<br/><br/>Come and Join thousands of people playing this fabulous game of Chess everyday on their phone!<br/><br/>Subscription Options:<br/>•  You can available for subscription for $2.99 per month and remove ads.<br/>•  Your subscription will renew automatically each month and payment will be charged to your iTunes Account within 24-hours prior to the end of the current period. <br/>•  You can turn off auto-renewal by going to your Account Settings after purchase. <br/>•  No cancellation of your subscription is allowed during the active subscription period. <br/><br/>Privacy Policy:<br/>http://hhsdaily.azurewebsites.net/<br/><br/>Terms of Service:<br/>http://hhsdailyterms.azurewebsites.net/", "metacritic": null, "released": "2018-04-28", "tba": false, "updated": "2019-07-29T13:29:45", "background_image": "https://media.rawg.io/media/screenshots/36c/36c8a4a8417ad6b9ba873e6019c02a5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HHS Daily"], "genres": ["Board Games", "Puzzle"], "publishers": ["Flying Pan Co"], "esrb_rating": null}