{"id": 71234, "slug": "tcgplayer", "name": "TCGplayer", "name_original": "TCGplayer", "description": "Everything in One Place - Check prices in real time, shop our Marketplace, manage your collection, and trade in Magic cards to game stores across the country—all with a single app.<br/><br/>Fully Integrated Scanning - Scan Magic, Pokémon, and Yu-Gi-Oh! cards to instantly find prices, add them to your collection, or shop on TCGplayer.com. You can even create Trade-In submissions for your Magic cards.<br/><br/>Fast, Accurate Pricing - Choose between Mid, Low, Direct Low, and Market Price—plus Trade-In High for Magic—to see current TCGplayer price data.<br/><br/>Accurate Image Recognition - Whether you scan cards right-side up or upside down, in sleeves or in a binder, the app will quickly and correctly identify them.<br/><br/>Manage Your Collection - Create new decklists or import lists you’ve saved from previous versions of the TCGplayer App. You can also rename or duplicate lists and share them with your friends via email or another app.<br/><br/>Set Printing, Condition, and More - Find the price for the exact version of the card you have by selecting whether or not it’s foil, what condition it’s in, and what language it is.<br/><br/>Works with Non-English Cards - It doesn’t matter if you can’t read the text on the card. The app will tell you what it is and how much it’s worth.<br/><br/>Scans Several Cards at Once - The app will scan as many cards as you can fit within your camera’s field of view. You can scan an entire booster pack in seconds!<br/><br/>Additional TCGs (Coming Soon) - You’ll soon be able to scan other popular games, like Final Fantasy, Force of Will, and Star Wars: Destiny.<br/><br/>Location-Based Alerts (Coming Soon) - Get notifications about deals from your local game store when you’re close by.<br/><br/>Scanning Tips:<br/><br/>- Use a plain background in a color that contrasts with the card border.<br/>- Scan the entire card, avoiding camera edges and obstructions.<br/>- Reduce glare by scanning at a 45° angle and adjusting the flash.<br/>- Adjust scan settings to set printing, condition, and language.<br/>- Verify your card by updating the set and quantity as needed.<br/><br/>Need assistance? Contact us at sales@tcgplayer.com and we’ll be happy to help!", "metacritic": null, "released": "2017-07-21", "tba": false, "updated": "2019-07-29T14:40:31", "background_image": "https://media.rawg.io/media/screenshots/56b/56b4ffa9f0f1bff7bba460ad3dfc4bc2.jpg", "website": "http://app.tcgplayer.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TCGplayer.com", "TCGplayer"], "genres": ["Card"], "publishers": ["Ascension Gaming Network", "TCGplayer"], "esrb_rating": null}