{"id": 712330, "slug": "lucy-in-the-land-of-hope", "name": "Lucy in the Land of Hope", "name_original": "Lucy in the Land of Hope", "description": "DOWNLOAD RULES ( read all ) !\r\n<ul><li>You can download the game , play and share among your friends. If you want to EMBED this game on your website, Youtube Channel or anywhere else, it is allowed ONLY if you provide the download link from ITCH.IO or this link : https://www.vitra-services.com/published.html and give credit to the Creator : Vlatko Chankulovski ( UnrealDev ), near the Download file.</li><li>Sharing the downloaded file from one computer to another is allowed .</li></ul>\n<ul><li>YOU MUST NOT claim that this game is YOURS !</li><li>All rights reserved to the Creator of the game  -  Vlatko Chankulovski ( UnrealDev ).</li><li>You MUST NOT sell this game or try to sell, or monetize it in ANY WAY !</li><li>This game is provided for free Download to play and experiment anyway you like, in accordance with the statements above .</li></ul>\n\n<strong>GAME DESCRIPTION :</strong>\n<p>- In this game the amount of enemy will be minimum . You need to collect the right item in order to proceed further, otherwise you will get stuck. There are a lot of traps, so watch your step . Some damage factors can kill the Player instantly, some will damage it . There are many secret passages, so destroy the correct object to make your way through . Also there are healing items that will restore the Player's Health for 100% . NOTE : This game will be a Demo Version, so the audience will be able to play it for free and without any ADS. The purpose of this Demo is to see the User Experience, to see if the user like the game, or dislike, what could be improved, or report any bugs.</p>", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T09:17:20", "background_image": "https://media.rawg.io/media/screenshots/bb3/bb391fab13ef985be01423a05c8360f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vlatko Chankulovski"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}