{"id": 71242, "slug": "777-slots-hot-shot-casino", "name": "777 Slots - Hot Shot Casino", "name_original": "777 Slots - Hot Shot Casino", "description": "Hot Shot Casino Slots is here! New, fresh and sizzling HOT, Hot Shot Slots has all of the best known slot games from the biggest casino slot machine brands in the world! Never before has a slots app had such an EXPLOSIVE combination of flaming-hot slot games, hand-picked from the world-famous floors of the Las Vegas strip in the heart of Vegas!<br/><br/>The real casino experience just got better! With the Hot Shot slot machine app, WMS gaming, Bally slots and Shufflemaster all come together to create the ultimate online casino with the hottest slots of Vegas… Spin with Hot Shot Progressive, 88 Fortunes (the #1 slots game in Asia) and Zeus III slots!  <br/><br/>Want more? This one-armed bandit has the BEST slots to play that every true hotshot will love!! <br/>Hot Shot Slots boasts some of the biggest branded slots:<br/>-Play YAHTZEE™ slot games<br/>-Hit it rich with MONOPOLY™ slot machines<br/>-Explore ‘Alice &amp; the Enchanted Mirror’ the THRILLING Alice in Wonderland game<br/>-Go wild with the KISS slot machine<br/>-Get CLASSY with the Dean Martin slot machine<br/>-Bet &amp; bop with Betty Boop! <br/><br/>With progressive jackpots, live slot tournaments, and new gaming events happening all the time...Hot Shot Casino is the ONLY free slots app &amp; online casino you'll need!<br/><br/>You’ll be part of the first truly authentic, integrated casino with all the best slots to play and the hottest brands of casino games! New and engaging slot machines like Colossal Reels, Money Burst, Reel Burst, Reel Intensity games like MONOPOLY™ slots, YAHTZEE™ games and Zeus slots, combine with mega-popular classic slots like Hot Shot Progressive, each with unique bonus mechanics and big multipliers that heat-up the winning experience! <br/><br/>Hot Shot casino captures the raging excitement of the Vegas casinos with:<br/>-High-end HD graphics<br/>-Amazing visuals<br/>-Unbelievably realistic themes<br/><br/>AND…. Coming Soon! Authentic Shuffle Master table games to complete the ultimate casino experience!<br/><br/>Are you a TRUE Hot Shot?? Get your 777 slots game ON with YAHTZEE™, Alice in Wonderland slots and MONOPOLY™ games with your favorite slot machine characters! <br/>*****Get ‘em while they’re HOT – Install NOW!*****<br/><br/>*The MONOPOLY name and logo, the distinctive design of the game board, the four corner squares, the MR. MONOPOLY name and character as well as each of the distinctive elements of the board and the playing pieces are trademarks of Hasbro for its property trading game and game equipment. © 1935, 2015 Hasbro. All rights reserved.<br/>YAHTZEE is a trademark of Hasbro. Used with permission. © 2016 Hasbro. All rights reserved.*<br/>The games are intended for an adult audience. (Aged 21 or older).<br/>The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling”.", "metacritic": null, "released": "2016-06-15", "tba": false, "updated": "2019-10-22T13:54:54", "background_image": "https://media.rawg.io/media/screenshots/7ef/7ef01b4a6c333c5f8327cc9e88e3e60c.jpg", "website": "https://www.sginteractive.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Phantom EFX"], "genres": ["Card"], "publishers": ["Phantom EFX"], "esrb_rating": "Teen"}