{"id": 712401, "slug": "bisbrouilles-en-outremeuse", "name": "Bisbrouilles en Outremeuse", "name_original": "Bisbrouilles en Outremeuse", "description": "Enquête : une potale a été brisée dans le quartier d'Outremeuse et une mystérieuse tablette y a été retrouvée l'intérieur !\r\n\n<p>Bisbrouilles en Outremeuse est un jeu d'enquête prenant place dans le quartier d'Outremeuse et dans lequel vous pourrez y découvrir un peu de son héritage culturel. <br/></p>\n<em>Ce jeu a été conçu à l'aide d'un outil de PandarooInteractive. Celui-ci se veut adaptatif pour répondre à d’éventuelles commandes d'organismes publics ou privés du secteur culturel.</em>\n\n\n<p>Pour mener à bien cette enquête, vous serez muni.e de votre PandaPhone vous donnant accès à de multiples applications pour vous aider dans cette tâche.</p>\n\n<p> </p>\n<ul><li>Explore le quartier d'Outremeuse à la recherche d'indices.</li><li>Interroge différent.es habitant.es du quartier grâce aux indices trouvés.</li><li>Assemble les pièces du puzzle et élucide cette affaire !</li></ul>\n\n<em>Ce proj</em><em>et est un exemple test de jeu possible via notre outil interne de création d'enquêtes que nous aimerions proposer pour de futurs serious games. Celui-ci se veut adaptatif pour répondre à d’éventuelles commandes d'organismes publics ou privés du secteur culturel. Si vous souhaitez nous aider à améliorer notre produit, n'hésitez pas à utiliser le bouton de feedback présent dans l'application ou à rejoindre notre serveur discord pour nous donner vos précieux retours. Merci !</em>\n<p> <br/> </p>", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T09:32:52", "background_image": "https://media.rawg.io/media/screenshots/d1a/d1a59629dc941017cb2e9ecc0eb83da4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PandarooInteractive"], "genres": [], "publishers": [], "esrb_rating": null}