{"id": 712558, "slug": "revenants-spirit-mind", "name": "Revenants: Spirit & Mind", "name_original": "Revenants: Spirit & Mind", "description": "Become a professional occult investigator, relying on your cutting edge technology from 2030 to locate, trap and battle demonic forces, all whilst solving the mystery of the occult crimes. <br/><br/>You'll need a sharp eye to locate evidence throughout each case, documenting all you can find with your camera whilst you explore the abandoned crime scenes. As a professional investigator, you'll also need to put the case together, connecting the dots and discovering who the culprits were.<br/><br/>Choose which technology you want to take on each case. Do you want to hunt down the revenant and trap it? Or set up surveillance and sensors so you can stay away from it. Either way, you'll always have your trusty tablet at your side, allowing you to picture any evidence you find and keep demonic forces at bay. <br/><br/>This is no regular camera, the Pentacam was built using ancient ritual magics. The demons should be afraid of you as you charge up the Pentacam and manifest them further with each shot. Until they are eventually captured within the device. <br/><br/>Revenants will be released in an episodic / case structure. With the base game containing the first case, and the next cases being released as they are developed as DLC.<br/><br/><strong>Case: Spirit &amp; Mind</strong><br/>Case: Spirit &amp; Mind has been cold since it was abandoned in 1997. What started with a missing schoolgirl Emily, soon escalated with multiple students and Police Officers injured. It's taken 33 years until the technology has been able to level out the playing field, and now you're ready to explore Spirit &amp; Mind academy once again.<br/><br/>Exploring this sprawling academy will be no easy feat. Being one of the first people to enter the academy in all these years, means there's plenty of undisturbed evidence still to be collected. Are you the investigator capable of solving the case? Or will you end up like the others...", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2021-12-24T03:24:18", "background_image": "https://media.rawg.io/media/screenshots/715/715823153829f68c20c3db3ae2e60947.jpg", "website": "https://www.lumineye.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LuminEye"], "genres": ["Action"], "publishers": ["LuminEye"], "esrb_rating": null}