{"id": 712584, "slug": "sourceworlds", "name": "SourceWorlds", "name_original": "SourceWorlds", "description": "Welcome to <strong>SourceWorlds</strong>. The Architect is waiting for you!<br/><br/><strong>SourceWorlds</strong> is a third-person action-adventure that throws you into the strange SourceWorlds controlled by 'the Architect'.<br/>Solve quests, loot items and have a great time trying to escape this CCC state-of-the-art indie game from the future.<br/><br/><br/><br/><br/>Actually, you just wanted to spend a relaxing retro gaming session with your buddy with these old consoles just still have. Somehow, however, you seem to have a hell of a lot of bad luck and so you are transported into a world that is very unfamiliar to you.<br/><br/>You will find the SourceWorlds are a strange place.<br/><br/>Different ages, different cultures, all seem to be intertwined.<br/><br/>The architect seems to be the all-encompassing power in this world. And you somehow got caught up in this and are desperately looking for a way out of these twisted SourceWorlds to finally get back home to the real world.<br/><br/><br/><br/><br/>In <strong>SourceWorlds</strong>, you kind of outgrow your old yourself!<br/><ul><li>Find powerful melee weapons with which you can mow down your enemies in close combat.<br/>Swords, Daggers, Axes, Hammers, Stop Signs - everything your heart desires!<br/></li><li>Discover magical and inexplicable accessories that give you psychic abilities.<br/>Become a White Mage, Wield explosive Magic, Lift Thor's Hammer if you're worthy<br/></li><li>Control unintuitive vehicles that inexplicably don't seem to follow any laws of physics.<br/>Like, really. Fun to steer Ships, Hovercars and rideable Wolves!<br/></li><li>Collect unique masks, which give your character its very own flair!<br/></li><li>Play alone or co-op with up to four of your friends and have the greatest time!<br/></li><li>Play through awesome quests, let the story sink in!<br/></li><li>Explore a vast variety of settings like a medieval place, a caribbean sea or a futuristic Sci-Fi world!<br/></li><li>Get exposed to our bestest dumb humor and gamedesign!</li></ul><br/>Visit us on Discord! https://discord.gg/Y8jPevXkhg<br/><br/>TideOver Studios", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-24T03:43:17", "background_image": "https://media.rawg.io/media/screenshots/658/658e92fdd2c1fd7fc3330163448215de.jpg", "website": "https://tideoverstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TideOver Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["TideOver Studios"], "esrb_rating": null}