{"id": 712588, "slug": "rust-raiders", "name": "Rust Raiders", "name_original": "Rust Raiders", "description": "Become a robot pirate captain in this roguelike deckbuilding game and defeat the evil Captain LeCrank. Rust Raiders brings the fun of deckbuilding games and the thrill of Roguelikes in a world filled with robot pirates controlled by an evil warlord called Captain LeCrank. Forge cards to improve their power, augment your ship with gadgets and build your own Deck! Experience the unique card system crafted exclusively for Rust Raiders.<br/><br/><br/><br/><strong>Main Mechanics</strong><br/><br/><ul><li> Build your Deck: Build your deck on the run by choosing from hundreds of cards in shops, battles, and treasure chests.<br/><br/></li><li> Forge Cards: Collect cards to forge them into stronger versions of themselves in the Deck Forge.<br/><br/></li><li> Dynamic Routes: Every time you set sail, your route will be different! You may choose your own path through forks, dangers, and treasures to reach the mighty LeCrank.<br/><br/></li><li> Augment your ship with Gadgets: Find powerful Gadgets to augment your ship and be ready for each battle. Gadgets are available throughout the world on treasure chests and as rewards from the most difficult battles. Get them if you think you're up to it!<br/><br/></li><li> Unique Card System: Rust Raiders has a unique card system based on Captain/Crew/Ship card classes and Strategy/Attack/Mechanism card types. Create your strategies to defeat enemies and get the most out of each battle with card combos!</li></ul><br/>", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-24T03:47:30", "background_image": "https://media.rawg.io/media/screenshots/32d/32d2faf24e59d6267350bac3d6807697.jpg", "website": "http://www.rustraidersgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overlord Game Studio"], "genres": ["Strategy", "Casual"], "publishers": ["Overlord Game Studio"], "esrb_rating": null}