{"id": 712529, "slug": "jutsu-ninja-game", "name": "Jutsu Ninja Game", "name_original": "Jutsu Ninja Game", "description": "This game is the prototype of an idea that I have and I would love to acquire resources to work on it, I invite you to try it and give me your opinion.\r\nA great game of jutsu without internet.\r\n<p>Adapt your own style of jutsus and ninja powers to defeat your opponents. Either with Ninjutsu or Genjutsu, how much ninja hands strategy can you create? Show your intelligence as a shinobi.</p>\n<p>The best anime jutsus game without internet with superhuman abilities, to launch powers and jutsu hands ninja.</p>\n<p>You will not stop thinking and generating combat strategies that allow you to surprise any shinobi, as well as you will not stop throwing shuriken and kunai. NINJA Weapons.</p>\n<p>Advance in the world of ninjutsu, tai-jutsu and gen-jutsu, gain experience, obtain powers and improve your JUTSUS even more, so that they become powerful from genin to sannin.</p>\n<p>Become the shinobi God and rule the ninja world, THERE ARE NO ADVERSARIES FOR YOU, BECOME THE BEST !.</p>\n<p>Throughout the game you will face experienced villains and deadly and powerful ninjutsu, genjutsu and taijutsu masters who control the world and want only death and mayhem.</p>\n<p>Return order, not only in your clan and village but the entire world, may your ninja honor go ahead.</p>\n<p>You will be rewarded with:</p>\n<p>- Experience.</p>\n<p>- New POWERFUL Jutsus and Fighting Skills.</p>\n<p>- Improvements in your superhuman techniques.</p>\n<p>- Amazing Powers and Extraordinary Battle Summons. without Internet</p>\n<p>- Legendary techniques.</p>\n<p>- Anime games ninja uniforms.</p>\n<p>- Armaments, shuriken and kunais.</p>\n<p>- TOO MUCH FUN! ninja game WITHOUT INTERNET.</p>\n<p>the game of jutsus without internet OFF-LINE, is the most GREAT of ALL. Become a SHINOBI with ELITE jutsus get HONOR and GLORY with the speed of your JUTSUS.</p>", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T10:08:31", "background_image": "https://media.rawg.io/media/screenshots/c2f/c2f5d7fb73f7d77722d56b751fa90e4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Enmatheval"], "genres": ["Action", "Strategy", "Fighting", "Platformer"], "publishers": [], "esrb_rating": null}