{"id": 712553, "slug": "ebe", "name": "EBE", "name_original": "EBE", "description": "EBE is an action-adventure game set on a planet in the Lyra constellation. The player takes the role of a small extraterrestrial biological entity (EBE), who recovers a strange micro-device from a humanoid alien lying dead in his crashed flying saucer. Using this device, the player will be able to connect to an alien network, solve puzzles, see distant locations (some of them on Earth), and bring back to life alien entities to contact the player himself.<br/>\n<br/>\r\nEBE takes you on a visit to another planet teeming with life, from strange PSI energy-producing plants to small insect-like creatures. Everywhere you can find remnants of alien civilization: old buildings, antennae, and communication devices. <br/>\n<br/>\r\nYou navigate the little EBE through the hostile environment: it can climb trees, rocks, or ancient buildings and explore the alien world. EBE needs to collect PSI from living beings to recharge alien devices. They can be used for seeing different parts of the planet and secret locations on Earth. These hidden places serve as teleports for alien entities to visit our world.<br/>\n<br/>\r\nOne of the most distinctive features of the game is it’s unique visual style: The whole scenery is almost all based on colorized drawings, resembling scientific illustrations. The movements of EBE and most other creatures are not pre-animated but based on physics - with the goal to make the alien world more organic and vivid.<br/>\n<br/>\r\nGameplaywise, EBE is close to an action-adventure game, with emphasis on exploration, free movement, and solving of puzzles.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-24T03:20:13", "background_image": "https://media.rawg.io/media/screenshots/6d4/6d4048263bba7e4dc61d1bee15f17e8d.jpg", "website": "https://tom-kaleta.itch.io/ebe", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tom Kaleta"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Tom Kaleta"], "esrb_rating": null}