{"id": 712514, "slug": "lords-reincarnation-iii", "name": "Lord's Reincarnation III", "name_original": "Lord's Reincarnation III", "description": "<p>After the great battle between God and Lucifer the world was thrown into a state of chaos. Many lost their lives while others survived to rebuild the world. A few centuries later, the world managed to stabilize itself with its inhabitants being human, demons, angels and powerful deities.</p>\n<p>You will play the role of Leon Wilder a young man that who his small island home town to join a guild, so that he may earn money to provide for his ill mother. </p>\n<p>The world has a lot more than meets the eye so come on and join the adventure!</p>\n<p>*This game contains topics that might trigger those with religious beliefs. Player discretion is advised.</p>\n<p>THIS GAME INCLUDES:</p>\n<p>*A battle system somewhat similar to games like Shin Megami Tensei III: Nocturne, Shin Megami Tensei IV: Apocalypse and Persona!</p>\n<p>*Three main playable characters : Leon Wilder, Medoka Lavender and Laura Silvers! Each plays super differently than the other so have fun combining their abilities!</p>\n<p>*Challenging but fair enemies, that said, they will not hesitate to utterly destroy you if you get too cocky. (Keep you head in the game!)</p>\n<p>*A ten episode story that is full to the brim with lore and interesting characters.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Creator's Notes:-</p>\n<p>This is a story I've working on all by my lonesome for years making games are really hard! (Who would have thought, huh?)</p>\n<p>Anyway... I ask everyone who comes across this game to at least give it a try and to leave a unfiltered review so that I may when or where I fell short so I may improve in the future.</p>\n<p>My dream as a little kid was always to make and play games with my very own team.     This is my first step to achieve that goal.</p>\n<p>Thank you all so much for you time and ENJOY THE GAME!</p>", "metacritic": null, "released": "2021-12-17", "tba": false, "updated": "2021-12-20T10:03:25", "background_image": "https://media.rawg.io/media/screenshots/5a2/5a210e1cba69e98dc0c15d7b028ce5c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YltasGames"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}