{"id": 712608, "slug": "red-cap-zombie-hunter", "name": "Red Cap Zombie Hunter", "name_original": "Red Cap Zombie Hunter", "description": "The story that inspires the game is very typical: virus attacks mankind turning most of them into zombies only a few, the strongest one, manage to overcome the virus and remain as normal people. From a central office in the city, a Human Resistence leader, hires Red Cap as <strong>ZOMBIE HUNTER</strong>.<br/><br/>In order to meet the leader of the resistance, Red Cap must travel to the city where <strong>at the top of a skyscrape</strong> is the barracks, continually besieged by zombies, of the <strong>Anti-Zombies Army</strong>.<br/><br/>The travel to the city is divided into 2 stages of 5 levels each.<br/><br/>In the first stage, Red Cap decides to take the shortest path to the city, which is the one through the cemetery. There he will face the first zombies, enter a royal tomb and <strong>explore the catacombs</strong> until he finds the exit and can quickly head towards the city.<br/><br/>In the second stage, when he finally reaches the city, he finds a bleak panorama: in the parks the children have already become zombies, the citizens who are still <strong>normal and the zombies share the streets</strong>. When he passed a construction site, the zombie workers tried to eat him. Some policemen turned into zombies fire their guns. Red Cap will be forced to <strong>use the subway to avoid the streets</strong> and get to the Anti-Zombies Army (AZA) office as soon as possible.<br/><br/>With the coins and treasures that Red Cap will find along the way in the game shop, you can buy, among other things, such fun devices as <strong>eShield</strong> (Electronic Shield), <strong>Laser Wheel</strong> or a <strong>Robot</strong> that will accompany you as your faithful friend. (see the videos)<h3>Play Red Cap Zombie Hunter and enjoy</h3><br/><ul><li>    10 levels divided in 2 different stages<br/></li><li>    2 Big Boss enemies<br/></li><li>    Improved skills for Red Cap depending of player EXPerience<br/></li><li>    Player Honor ranking: Stone, Bronze, Silver, Gold (from I to III) and Champion<br/></li><li>    It'sa <strong>PLAY-TO-WIN</strong> game. You don't need to spend extra money to finish the game. If you want to finish the game faster you can buy several goods that will help you.<br/></li><li>    Your character upgrades are saved as local data and it'll be used in future Vialgames games so improving your character will be useful to play another games.<br/></li><li>    The first level wants to be a tribute to the classic game of the 80s Ghosts'n Goblins.<br/></li><li>    Available in <strong>english and spanish</strong></li></ul>", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2021-12-24T04:06:22", "background_image": "https://media.rawg.io/media/screenshots/4ef/4ef33deada30586d719780c5a58391d1.jpg", "website": "http://vialgames.com/game/red-cap-zombie-hunter.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vialgames.com"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Vialgames.com"], "esrb_rating": null}