{"id": 712694, "slug": "tvghf-support-pack", "name": "TVGHF Support Pack", "name_original": "TVGHF Support Pack", "description": "Support game preservation by buying games!<br/>\n<br/>\nThe Video Game History Foundation Support Pack is a special, time-limited bundle from which all proceeds go to game preservation initiatives. The Video Game History Foundation is a non-profit organization, with a team composed of veterans of the industry, that has made its mission to bring video game history back to life. Learn more about their mission and initiatives in our interview.<br/>\nThe pack includes two great classics:<br/>\n<br/>\nWarhammer 40,000: Chaos Gate<br/>\nSet in the Warhammer 40,000 universe, Chaos Gate tells the story of an Ultramarines army led by Captain Kruger, as he attempts to recover the Concordat Chaosium, a pre-Horus heresy artefact, from the hands of Chaos Lord Zymran’s forces. <br/>\nThis turn-based strategy with RPG elements, is SSI’s second entry in the Warhammer 40,000 universe. Chaos Gate marries the lore of the 40,000 universe with the strategic depth of an SSI game and creates an engaging experience that further glorifies the Emperor and the Adeptus Astartes’ Legacy.<br/>\n<br/>\nDarklands<br/>\nOne of “The Greatest Games Of All Time” according to Gamespot, Darklands is a realistic fantasy role-playing game. Leading a band of four adventurers across the sinister landscape of 15th Century Germany, you’ll face the Middle Ages as people believed it to be: land filled with mythical beasts, religious power-mongers, and bloodthirsty robber-knights!<br/>\n<br/>\nThe Video Game History Foundation Support Pack is available to buy till January 5th, at 2 PM UTC.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-24T05:12:57", "background_image": "https://media.rawg.io/media/screenshots/677/677a3e762a637cf0772988cf37bfcd16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["TVGHF SUPPORT PACK"], "genres": [], "publishers": ["TVGHF SUPPORT PACK"], "esrb_rating": null}