{"id": 712633, "slug": "epejsodion-dodgeball-training", "name": "EPEJSODION Dodgeball Training", "name_original": "EPEJSODION Dodgeball Training", "description": "<h3>Train For the Championships!</h3><br/><strong>EPEJSODION Dodgeball Training</strong> gives the player a great and fully customizable training area to train for the greatest dodgeball event ever,<br/>the EPEJSODION Dodgeball Championships! Take all EPEJSODION League teams for a training program to get them ready for the great clash!<br/>Make sure to check out the Training Center's great features!<h3>Train Teams</h3><ul><li>Transfer teams you unlocked back in EPEJSODION Dodgeball Attack/Defense/Speed for the training!<br/></li><li>Train your team by playing against other teams from its league!<br/></li><li>No time to play? Have your teams trained idle!</li></ul><h3>Train Me</h3><ul><li>Train yourself with Tadeusz Lorkowski, the developer himself!<br/></li><li>42 exciting drills will get you ready for the Championships!<br/></li><li>Beat dummies, dodge balls thrown by the launchers and then take on some real players!</li></ul><h3>Challenges</h3><ul><li>Want some more singleplayer experience? A set of a hundred Challenges will put your skills to a test!<br/></li><li>The challenge difficulty ranges from cakewalk to extreme tasks for real EDB masters!<br/></li><li>Daily challenges to keep you in shape!<br/></li><li>Great rewards for EPEJSODION Dodgeball Attack/Defense/Speed players!</li></ul><h3>Other features</h3><ul><li>Play as any of the 182 EPEJSODION League teams in a singleplayer or a two-player match!<br/></li><li>The Roster editor is back and better!<br/></li><li>New player abilities - Sprint and Strategies! Unleash the full potential of your warriors!<br/></li><li>Championships Intelligence - get all information on the Championships and remember the Sopoti ruleset!</li></ul><br/>The game is able to communicate with EPEJSODION Dodgeball Attack/Defense/Speed to transfer certifications.<br/><br/>Loja është në dispozicion në gjuhën shqipe/Game is available in Albanian.", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2021-12-24T04:25:30", "background_image": "https://media.rawg.io/media/screenshots/a6e/a6e66794f25df4bbc238dbbb26f1b2a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tadeusz Lorkowski"], "genres": ["Sports"], "publishers": ["Tadeusz Lorkowski"], "esrb_rating": null}