{"id": 712617, "slug": "yuko-and-the-akuma-menace", "name": "Yuko and the Akuma Menace", "name_original": "Yuko and the Akuma Menace", "description": "Yuko and the Akuma Menace is a top-down, grid based movement, adventure, dungeon crawler game set in a ninja world of fantastic creatures and magic.<br/><br/><br/><br/>The legends of these lands tell us about a ninja conflict between humans and orcs, the latter commanded by the fearsome blue demons, known as Akumas. The humans won the war and exiled the orcs from this world. It is said that blue demons no longer exist and their army disappeared. However, this peace would not last forever, as strange creatures have been sighted in the Mizumizu village lately. Will the monsters of these legends return?<br/><br/>Join Yuko, a young ninja with the mission to investigate the whereabouts of the Mizumizu villagers. Fight against fantastic creatures, solve puzzles and collect memory fragments scattered along the way.<br/><br/><br/><strong>Find the way</strong><br/><ul><li>Fight your way through the dangers across different themed zones spanning multiple labyrinthine levels.</li></ul><br/><br/><strong>Magic</strong><br/><ul><li>Use the elemental orbs to go through dangerous terrain or protect yourself from enemies.</li></ul><br/><br/><strong>Test your ninja skills</strong><br/><ul><li>Attack with your kunai, throw your shurikens to fight monsters and escape with smoke bombs.</li></ul><br/><br/><strong>Power up</strong><br/><ul><li>Collect the memory fragments scattered throughout the levels to increase your health and power.</li></ul>", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2021-12-24T04:14:02", "background_image": "https://media.rawg.io/media/screenshots/420/420d81e0aef6bc206d26fbbe2f673d2e.jpg", "website": "https://yuko.deluccasoftware.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["De Lucca Software"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["De Lucca Software"], "esrb_rating": null}