{"id": 712666, "slug": "gardeners-path", "name": "Gardener's Path", "name_original": "Gardener's Path", "description": "<h3>FIGHT AGAINST THE PEST</h3>Gardener’s Path is a top-down turn-based puzzle game, about fighting giant insects and protecting underground gardens, through the use of magical artifacts.<br/><br/>Gardener’s Path is set in a fantasy version of earth, where most of its vegetation suddenly became unable to produce enough oxygen to sustain the existence of human life. In an act of pure kindness, the goddess Antheia built 60 underground gardens, which are the only thing between life and death for the ones living there. Fulfil your duty as a gardener, and fight against the pest of giant insects, to protect the ones you love.<br/><br/><h3>MAIN FEATURES</h3><ul><li>Solve increasingly elaborate puzzles scattered throughout 60 handcrafted gardens, each one with their own set of friends and foes.<br/></li><li>Season based pixel art graphics and a new-age soundtrack were combined to create a relaxing and immersive atmosphere.<br/></li><li>Fight against multiple types of dangerous insects, while also being aided by equally mighty plants.<br/></li><li>Take the advantage in a fight by wielding powerful artifacts, allowing you to travel back in time and perform elemental attacks.<br/></li><li>Learn more about each creature you find in the gardens, by reading about them in a logbook full of information and illustrations.</li></ul><br/><br/><br/>My role is to harmonize them, not to purge them.", "metacritic": null, "released": "2021-12-22", "tba": false, "updated": "2021-12-24T04:47:55", "background_image": "https://media.rawg.io/media/screenshots/a27/a276ea9fceb36acb5060632108b03402.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1}, "playtime": 0, "achievements_count": 37, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Viridino Studios"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Viridino Studios"], "esrb_rating": null}