{"id": 712620, "slug": "precursors-armored-angels", "name": "Precursors: Armored Angels", "name_original": "Precursors: Armored Angels", "description": "Armored Angels is a turn-based strategy game in which players struggle with intelligent machines, competitive corporations and time.<br/>\r\nIn their struggles, players deal with the invention of new technologies and the construction of huge walking units that allow you to counter the scale of the threat posed by intelligent machines.<br/>\n<br/>\r\nThere are too many technologies compared to time, but each game includes the option of putting emphasis on researching technology or building mechs larger in order to defeat the opponent in quantity. Each choice gives you new opportunities, but also consequences.<br/>\n<br/>\r\nEach choice made by the player brings the game in the direction of his / her choice and is never the same.<br/>\n<br/>\r\nThe game has a specific style and refers to the anime movies from the 90s and 80s of the last century. <br/>\r\nThe game combines the rich possibilities of the games and challenges known from the 90s and the beginning of the 21st century with relatively easy playability and possibilities of the 21st century.<br/>\n<br/>\r\nThe player has a huge number of choices both on the battlefield and in the control center.<br/>\n<br/>\r\nMany of the game mechanics refer to titles such as X-COM, Battletech or Final Fantasy, but the combat is faster and each mech/pilot has different abilities that cannot be found in the above games.", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2021-12-24T04:16:05", "background_image": "https://media.rawg.io/media/screenshots/f7d/f7d94b90589f8cf01f41ce49b13dd7bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Artificial Worlds"], "genres": ["Strategy", "Indie"], "publishers": ["Artificial Worlds"], "esrb_rating": null}