{"id": 712602, "slug": "solar-cage", "name": "SOLAR CAGE", "name_original": "SOLAR CAGE", "description": "“SOLAR CAGE” is a challenging parkour-shooter that takes place in the distant future, where a majority of humanity has been converted into mechanical monstrosities. They’ve built a Dyson sphere surrounding the Sun, using its energy to fuel their highly inefficient lifestyle. Using something known as the CATALYST, their consciousness exists as a copy of their original brain within these bodies. You play as JANITOR-2828, a designated cleaning robot who is suddenly contacted by an unknown entity. Your abilities are upgraded from cleaning to being able to jump, wall run, and slide with ease. It was even nice enough to give you a signature rail gun. All of these achieve a simple task: BLOW UP THE SUN.<h3>RUN. SHOOT. REPEAT.</h3><ul><li>Pull off crazy acrobatics as you run, slide, and jump around each area in the facility.</li><li>One bullet, one chance. If you miss, you'll have to beat down robotic combatants to reload your gun. Make every shot count.</li><li>Chain your parkour and combat skills together to pull off epic, precisely timed traversal combos!</li></ul><h3>HELLO WORLD</h3><ul><li>Shoot and jump your way through 9 dystopian levels that never fail to test your timing, accuracy, and willpower.</li><li>Experience new mechanics as you get closer to the Sun, from gravity flipping to challenge arenas!</li><li>Discover a multitude of paths in each level to figure out the quickest routes for speedruns.</li></ul><h3>PREPARE TO DIE</h3><ul><li>No checkpoints, no easy mode, no excuses. A hero's journey is never that simple.</li><li>Master each level to the point where you know every shot, wall run, and leap of faith like the back of your hand. Then, impress your friends with perfect runs!</li><li>Do what it takes to BLOW UP THE SUN!</li></ul>", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2021-12-24T04:00:26", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e054d0b4360db47247554e19e970e0b.jpg", "website": "https://www.juggernautet.com/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 1, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Scuffed Games"], "genres": ["Action", "Indie"], "publishers": ["Juggernaut Entertainment"], "esrb_rating": null}