{"id": 712621, "slug": "tiny-stories-santa-closes", "name": "Tiny Stories: Santa Closes", "name_original": "Tiny Stories: Santa Closes", "description": "<h3>DARK HUMOR ON A SNOWY BACKGROUND</h3>Let's make one thing very clear, folks, this adventure is cute and short. As cute and short as Santa’s hot pants. Based on an unreasonable amount of puns, this absurdist mini-game also has dark overtones, an oaky aftertaste, and thoroughly complements a cosy winter afternoon spent doing crosswords. « Santa Closes » makes perfect entertainment material for someone looking to spend ten minutes in a Christmas World™ where cheer steers clear of the dear deers.<h3>TO THE RESCUE !</h3>Time is of the essence. Pingu - your best friend who, oddly enough, happens to be a penguin – just finished reading his TV guide. According to these utterly professional sources, Christmas must be saved by 8:00 PM… Hot on the holiday tracks of this mistletoe mystery, our Elf must uncover the squalid truth behind this well-beloved institution. But beware...if anything goes wrong Santa might change his sleighing ways to slaying ways. <br/><br/><h3>I LOVE THE FRESH SMELL OF PINE IN THE MORNING </h3>One thing leads to another, as it so often does, you will have to investigate the murky mysteries of this ho ho-so colorful holiday... in a monochrome world. With Pingu in tow, an emperor penguin who rarely lives up to his title on account of his anxious tendencies, your travels will take you around the block to visit some highly unusual suspects. Don't be the Santa Company's deadwood, be advised by the Touchy Tree ™️ ! Get into a war of words with the Dyslexic Reindeer ™️ ! Give the Gluttonous Yeti ™️ some food for thought! <br/>What will save Christmas? Find out...before Santa closes!<br/><br/>", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2022-12-10T09:17:40", "background_image": "https://media.rawg.io/media/screenshots/d71/d714770e30a3eae1baed30934ae129c3.jpg", "website": "http://www.flipitgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Flip It"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Flip It"], "esrb_rating": null}