{"id": 71275, "slug": "mystery-of-the-ancients-three-guardians-hd-a-hidde", "name": "Mystery of the Ancients: Three Guardians HD - A Hidden Object Game App with Adventure, Puzzles & Hidden Objects for iPad", "name_original": "Mystery of the Ancients: Three Guardians HD - A Hidden Object Game App with Adventure, Puzzles & Hidden Objects for iPad", "description": "Try this immersive, high-quality game for FREE! Then continue on with a ONE TIME unlock and play offline! <br/>NO VIRTUAL ITEMS, NO INTERRUPTIONS… you’ll OWN this game for life. <br/><br/>After your niece’s boyfriend disappears, you’re called in to help find him. Once in Green Hill, residents begin disappearing before your eyes in clouds of crows and mystery. Discover the truth and save your niece before it’s too late! <br/><br/>•WHAT’S HAPPENING IN GREEN HILL? <br/>You arrive in the midst of a terrible train derailment and from there, things get more bizarre. <br/><br/>•REPAIR A MAGICAL AMULET <br/>A protection amulet is mysteriously delivered to you. However, it’s broken and you’ll need to seek out all of the crystal pieces so that it can be used. <br/><br/>•BATTLE A TERRIBLE EVIL! <br/>Red eyed crows are terrorizing the town and attacking citizens. But, they’re simply the hand of a greater power. Uncover the terror that has been controlling the crows. <br/><br/>•UNLOCK THIS AMAZING COLLECTOR’S EDITION TO ACCESS EXTRAS! <br/>Save a corrupted friend in the bonus chapter. Revisit the game in the beautiful wallpapers and concept art in this unique Hidden Object Puzzle Adventure. <br/><br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME! <br/><br/>*** Discover more from Big Fish! *** <br/><br/>Check out our entire game library with our Big Fish Games app and get European Mystery: Scent of Desire Collector's Edition absolutely FREE here: http://bigfi.sh/BigFishGamesApp <br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter <br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames <br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2014-06-29", "tba": false, "updated": "2019-07-29T10:55:59", "background_image": "https://media.rawg.io/media/screenshots/077/0776cd326cec8774d1c2eba909703737.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}