{"id": 712776, "slug": "car-driving-2022-simulator", "name": "Car Driving 2022 Simulator", "name_original": "Car Driving 2022 Simulator", "description": "Car Driving 2022 Simulator is an awesome driving game experience. You can play together with your friends, tuning, racing and driving the cars in a big city. New car games have new cars from 2021 and 2022 from different brands. With this awesome game, we try to simulate the real open world tuning and racing 3D experience.<br/>Our cars have awesome \"drive in car\" realistic interiors, inspired from real world cars. We also added realistic sounds that in combination with the traffic system and beautiful city, creates the best driving car game simulator experience. This game also is a very good driving school simulator, because you can learn what priority in traffic means, how to park the car and traffic signs.<br/>If you are ready, prepare your awesome car for drag race. We are waiting you at the start.<br/><br/>Car Driving 2022 Simulator feats: over 20 free sporty cars, car power and tuning system, multiplayer race system, drag race simulator system, points based on driving skills.<br/><br/>Like us: \"https://www.facebook.com/xsasoftware/\"<br/>Privacy policy: \"http://www.xsasoftware.com/privacy/\"<br/>Terms of Service: \"https://www.xsasoftware.com/terms-of-service/\"<br/>Contact us: \"xsasoftware@gmail.com\"<br/><br/>We are waiting for you to play and rate our free games. Thank you!<br/>This game was made by XSA SOFTWARE GAMES company.", "metacritic": null, "released": "2018-11-24", "tba": false, "updated": "2021-12-24T06:01:33", "background_image": "https://media.rawg.io/media/screenshots/184/18430b03fdaa1f44ccab85ec2d73b8c5_Br0zM6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Xsa Software"], "genres": ["Simulation", "Racing"], "publishers": ["Xsa Software"], "esrb_rating": "Everyone 10+"}