{"id": 712745, "slug": "graffiti-smash", "name": "Graffiti Smash", "name_original": "Graffiti Smash", "description": "Graffiti Smash -- a new hit presented by BANDAI NAMCO Entertainment Online! <br/><br/>Slingshot to paint surfaces and get power boosts. Enjoy PvP matches via a real-time online battle system. Co-op with friends to clear dungeons and beat bosses. Enjoy a script of 1 million plus words that tells stories about the bonds and dynamics between people in a post-apocalyptic world!<br/><br/>In this dystopian alternate reality, the human race is fighting for survival against the invasion of a mysterious entity known only as \"Arc\". The surviving humans have been forced to take refuge in their last sanctuary -- the fortress city of Babel. After generations of propagation, the Arcs have radically altered the ecosystem on a global scale, reducing most of the planet to nothing more than monster-infested wilderness. Eventually, \"Arc-resistant\" individuals started to emerge. Known as \"Hunters\". these brave souls began venturing outside of Babel in squads, hoping to reclaim some of humanity's lost territories and restore the long-forgotten glory of human civilization.<br/><br/>※ GAME FEATURES<br/>■　Intense Field-painting Combat<br/>Hold down, pull back and release! That's all it takes to launch a hunter on a graffiti rampage, leaving a trail of paint across the screen! The constantly changing paint gauge will affect how a fight plays out, adjust your strategy accordingly!<br/><br/>■　Summon Graffiti Beasts<br/>After a Graffiti pattern has been completely revealed by painting the battlefield, a Graffiti Beast can be summoned. Utilize its overwhelming power to turn the tide of battle in an instant!<br/><br/>■　A Wide Variety of Unique Weapon Arts<br/>Weapon Arts are skills that can be activated when your Hunters are armed with weapons! Choose weapons that best suit your playstyle!<br/><br/>■　PvP &amp; Co-op Multiplayer Modes<br/>Have a blast in intense multiplayer modes! Team up with friends to crush mighty enemies or compete against other players to carve out a place for yourself on the leaderboard!<br/><br/>■　Get Loot from Idle Expeditions<br/>Use Expeditions to get loot even when you're offline! Use this handy feature wisely to amass strength-boosting items!<br/><br/>■　Challenge Dungeons with Friends<br/>Acquire new Maps to unlock special dungeons. Challenge these dungeons with your friends to get dungeon-limited special weapons that will give you an advantage against other players!<br/><br/>■　Collect a Wide Variety of Hunters and Weapons<br/>Train your favorite hunters and assemble expedition squads! Permanently increase the strength of your squad by equipping weapons that best suit its composition!<br/><br/><br/>Please follow our social media to keep updated.<br/>Discord: https://discord.gg/9NKvGUwcsG<br/>Facebook: https://www.facebook.com/GraffitiSmashEN/<br/>Reddit: https://www.reddit.com/r/GraffitiSmashOfficial/", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-24T05:42:49", "background_image": "https://media.rawg.io/media/screenshots/66e/66ef010e596c38aecfd944ddfdcce2ca_0cCg9Mr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boltrend Games"], "genres": ["Action", "RPG"], "publishers": ["Hong Kong Bao Chuan Software Technology"], "esrb_rating": "Teen"}