{"id": 712742, "slug": "dragon-ascension", "name": "Dragon Ascension", "name_original": "Dragon Ascension", "description": "Calling for true warriors to battle and get Chang’an free of evils! The city Chang’an, once was peaceful and thriving, is now being devoured by darkness slowly. The foul beings and old gods are now awoken. They are creeping through the city and waiting for their chances... Join the adventure and discover the dark secrets of Chang’an; Slay monsters, old gods, and gear up with ancient artifacts; Keep your eyes sharp heroes and you might survive longer.<br/>Follow us on socials for more latest information!<br/>Facebook: https://www.facebook.com/DragonAscensionOfficial/<br/>Discord: https://discord.gg/UFTU4qbR8Q<br/>If you have any issues regarding the game, please email us at:<br/>dragon@limegames.net<br/><br/>Key Features:<br/><br/>Hands-Free Dark Adventure<br/>Experience the compelling story, discover the secret of Chang’an with only a single tap! Choose and become one of five distinct heroes with unique skills and gears.<br/><br/>Challenge &amp; Loot &amp; Build<br/>Get loots by Slaying archfiends, defeating dark disciples, or competing with other warriors. Craft, enhance and build up your own equipment sets with ancient relics.<br/><br/>Get Assists from Spirits <br/>Fight alongside hero spirits from the different legends. Collect their war souls, use their abilities to create an array of skills, and become invincible.<br/><br/>Defend the honor<br/>Get to the top of Chang’an with your guild members. Compete with other guilds in world tourney and Win rare loots in god’s trial. <br/><br/>Experience the Freedom<br/>Check out your treasure maps and find out the surprises hid under. Enjoy the beautiful scenery and jump between rooftops with your flying skill. <br/><br/>Get into business<br/>Put your loots in auctions and see how much you can get. Earn silver and respect by running some errands such as escorting caravans, or expelling treasure robbers. <br/><br/>Mounts &amp; Costumes &amp; Pets<br/>Stand out of the ordinary with various cool costumes and mounts. Tame Mythical Beasts as pets and have them aid you in battle.", "metacritic": null, "released": "2021-11-28", "tba": false, "updated": "2021-12-24T05:41:19", "background_image": "https://media.rawg.io/media/screenshots/88d/88d8c86642e00d0da7b39b49e9de4537_QKmtG3T.jpg", "website": "https://www.ucucsh.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tergo Cleaning Service Company"], "genres": ["RPG"], "publishers": ["Tergo Cleaning Service Company"], "esrb_rating": "Teen"}