{"id": 712767, "slug": "basketball-sports-arena-2021", "name": "Basketball Sports Arena 2021", "name_original": "Basketball Sports Arena 2021", "description": "The world championship of this new basketball sports game “Basketball Sports Arena 2021” is here for you to play full basketball court real like matches. Play and won against the world basketball champion teams.  Challenge the opponents and play exciting matches. The basketball madness of full-court is a click away and waiting for a pro dunker like you, who would steal the player of the match show by their attack, defense, and scoring. <br/><br/>Choose your team and play against other world basketball teams. Move freely in the court and simulate the whole team. Attack, Defend, Pass the ball, and score on a dunk. That’s all you have to do to win the match against every opponent. <br/><br/><br/>Be a dunking master on the pitch to grab match-wining points, keep calm and pass by time. Use your skills and try to find out the right time for dunking else the opponent will defend at any cost. You will be simulating the whole basketball team here. This game is offering you intense full-court matches. You will be doing the defense, attack and will be doing your best to put score on the point table.<br/> <br/>Play devotedly won the matches against the legends, and be the champion of the world.<br/> <br/>Features:<br/>- Easy to use Game Controls.<br/>- Different mode play.<br/>- PvP and PvAi battle.<br/>- Many Matches to play.<br/>- World Championships Trophies.<br/>- Upgrades and rewards.<br/>- Detailed 3D models.<br/>- Well architected Basketball court.<br/>- Eye Catchy graphics.<br/>- Crowd cheering will feel you like you are on the basketball court.", "metacritic": null, "released": "2021-08-06", "tba": false, "updated": "2021-12-24T05:55:53", "background_image": "https://media.rawg.io/media/screenshots/06a/06a232831ba19c6d771428af1b3871a5_hRwwNQS.jpg", "website": "https://rollingstudiogames.xyz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RollingStudio"], "genres": ["RPG", "Sports"], "publishers": ["Little Play"], "esrb_rating": "Everyone 10+"}