{"id": 712758, "slug": "wrestle-deck", "name": "Wrestle Deck", "name_original": "Wrestle Deck", "description": "Wrestle Deck allows the player to call the shots in the ring! There are over 100 cards to collect, featuring some of the hottest names in indie wrestling. Your stable of wrestlers will compete in a series of matches with unlockable promotions like Monster Factory, New Texas Pro Wrestling, Action Pro Wrestling, Wrestling Revolver and Warrior Wrestling. Work your way up from a small arena to showcasing your fights in a champion ring. With type advantages and gimmicks in the mix, each fight will strike just enough balance between strategy and a potential upset! <br/><br/>Expand your locker to accommodate more talent, as you build up your deck. Switch between multiple stables, pre-set by you, to challenge opponents in the ring. Daily tasks will allow you to not only expand your locker but upgrade your gym bag as well, enabling you to carry more gimmicks that will help spice up the matches for your deck. <br/><br/>Some of the awesome talent featured in the deck include...<br/><br/>- Rachael Ellering<br/>- Ace Austin<br/>- Ricky Morton<br/>- Fuego Del Sol<br/>- Alex Zayne<br/>- JD Drake<br/>- Anthony Henry<br/>- Masha Slamovich<br/>- Zicky Dice<br/>- Danny Limelight<br/>- World Famous Cheeseburger<br/><br/>...And many more!<br/><br/>Wrestle Deck Gameplay:<br/><br/>- Create a stable featuring talents from all over the world, from major promotions and the independent wrestling scene.<br/>- Build your locker room with some of the hottest names in wrestling, including some up-and-coming talent.<br/>- Level up your cards by competing in matches and use type advantages to defeat your opponents.<br/>- Collect gimmicks and store them in your gym bag to help you along the way.<br/>- Finish Daily Tasks to earn rings that allow you to unlock more storage in your gym bag, and expand your locker room to hold more cards.<br/>- The Books allow you to see cards you’ve gone up against, or collected.<br/><br/>Draw cards to build up your deck, create the ultimate stable, and rise to the top to boast the title of Wrestle Deck champion!", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-24T05:50:29", "background_image": "https://media.rawg.io/media/screenshots/041/041a708bc365e2bd8c98d803a776ddfc_MT2kbii.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Raymond Cook"], "genres": ["Sports", "Card"], "publishers": ["Raymond Cook"], "esrb_rating": "Teen"}