{"id": 712720, "slug": "color-by-number-draw-paint", "name": "Color by Number: Draw & Paint", "name_original": "Color by Number: Draw & Paint", "description": "“Color by number Draw &amp; Paint” it's brand new app that give you  feeling of real drawing and painting process. Create sketches then color them by numbers.  Many drawing and painting tools. Real looking canvas, brushes and pencils. Lots of beautiful high detailed pictures to draw and color. Don’t lose a chance to get absolutely new drawing and painting experience.<br/><br/>Color by number Draw &amp; Paint Subscription:<br/>The subscriptions are $5.99 weekly, $9.99 monthly, $59.99 annually.<br/>You'll be able to access unlimited coloring pages for the duration of your subscription.<br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off at leat 24-hours before the end of the current period.<br/>Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen subscription.<br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged<br/>- Please visit http://support.apple.com/kb/ht4098 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. <br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a Paint Premium subscription<br/>You can read privacy policy and terms of use at http://coloringpuzzles.com/color-by-number-draw-paint/<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that content.<br/><br/>Terms of Service and Privacy Policy - http://coloringpuzzles.com/color-by-number-draw-paint/", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2021-12-24T05:28:41", "background_image": "https://media.rawg.io/media/screenshots/d92/d9227521f4a1a527cf83590527606e8d_No0d5PQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coloring puzzle games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Coloring puzzle games"], "esrb_rating": "Everyone 10+"}