{"id": 712719, "slug": "bubble-pop-pixel-art-blast", "name": "Bubble Pop - Pixel Art Blast", "name_original": "Bubble Pop - Pixel Art Blast", "description": "Play the classic and most addictive bubble pop game for FREE, match 3 bubbles(colors) and clear levels.<br/><br/>Ready to play?<br/>Aim, match and smash all the balls in this relaxing bubbles-matching adventure.<br/>This is one of the best bubble pop games that are simple and easy to learn, perfect for families to enjoy!<br/>Fun and addictive bubble shooting game! Clear all bubbles on the screen to make them level and try to get 3 stars on each level.<br/><br/>How to play:<br/> - Play the Classic Game Mode - So Simple.<br/> - Tap the screen to shooting the bubble.<br/> - Match 3 or more identical bubbles.<br/> - Aim to make the perfect shot.<br/> - Click on the props in the game and use props can make it easy for you to pass the game<br/> - Try to finish the level before your bubble balls run out.<br/> - Consecutively breaking balls can add points.<br/><br/>Feature:<br/>- Smooth bubble shooting game experience with beautiful designs and animations.<br/>- There are +2,000 different and challenging levels including pixel art blast levels.<br/>- Get special bubbles and many more features at the power of your fingertips<br/>- Enjoy beautiful bubble designs and awesome background graphics.<br/>- Completely free bubble shooter game that you can enjoy anytime, anywhere.<br/>- Addictive game: Use bubbles to pass boring time.<br/>- It's easy for everyone: commuters, housewives, cute young ladies, elderly, children, etc.<br/>- This game is exercise the brain, super addictive, and a great way to spend free time on the airport, bus, train or car.<br/>- Anytime, anywhere, shooting must go on.You can still playwithout internet access<br/>- This is a very worth playing casual adventure game, no network can also play<br/><br/>Note<br/>- This game contains the banner, interstitial, and reward video ads. You can choose to remove it by purchasing ‘remove ads’ from the shop.<br/>- You can enjoy the game for free, but you can also choose to purchase in-game currencies or ad removal within the app.<br/><br/>Let’s have fun here! Go and kill the boring time , have fun with your friends! Train your brain and your fingers !!! Get ready, aim !! go shooting bubbles!<br/>Bubble Pop is the game brings exciting entertainment experiences, helping you relax after stressful working and studying hours.<br/>Download and discover the best of Bubble Pop!<br/>We also welcome the reviews and feedback from players all around the world to help us to improve the game quality.", "metacritic": null, "released": "2021-11-26", "tba": false, "updated": "2021-12-24T05:28:06", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b90183119907847a31fd65818ec4481_S1f6D7m.jpg", "website": "https://www.ninetap.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ninetap"], "genres": ["Board Games", "Puzzle"], "publishers": ["Ninetap"], "esrb_rating": "Everyone 10+"}