{"id": 712708, "slug": "human-evolution-idle-clicker", "name": "Human Evolution - Idle Clicker", "name_original": "Human Evolution - Idle Clicker", "description": "Welcome to the Human Evolution clicker! In this idle evolutionary simulator you can rule life in a very simple way. Just tap to control the evolving process. Evolution has never been so easy. <br/><br/>Start from small organisms like bacteria, and give life to animals like fish, lizard and monkey.<br/>Don’t forget, evolution never stands still. Once you’ll open human, you’ll discover that homo sapiens is just another step of evolution process. Tap and evolve life further and open next steps of human evolution: cyborg, robot and posthuman. But that's not all.<br/><br/>In Human Evolution idle clicker you can conquer the space and develop life on other planets. In conditions other than on Earth, life can take completely new forms. It's up to you to decide which evolution path to take. Can you open the whole evolutionary collection?<br/><br/>Almost every week you can take part in thematic evolution events, where you can get new worlds with new planets and creatures. There are world of dragons, world of birds, world of ocean animals and many more. If it’s not enough and you want to accelerate the evolution, you can buy some animals for the crystals.<br/><br/>The world of evolution is waiting: start evolutionary fun right now. Tap to evolve from DNA or ameba to homo sapiens and cyborg! Enjoy this amazing idle clicker and evolution simulator.", "metacritic": null, "released": "2018-06-09", "tba": false, "updated": "2021-12-24T05:22:16", "background_image": "https://media.rawg.io/media/screenshots/17c/17cd4017374ee056e319b7c9b8d9e55c_eulrRyx.jpg", "website": "http://wazzapps.org", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WAZZAPPS"], "genres": ["Adventure", "Casual"], "publishers": ["WazzApps"], "esrb_rating": "Everyone 10+"}