{"id": 712854, "slug": "monster-rancher-2-2021", "name": "Monster Rancher 2 (2021)", "name_original": "Monster Rancher 2 (2021)", "description": "◆◆ The biggest hit of the series “Monster Rancher 2” is FINALLY HERE! ◆◆<br/><br/>The second instalment of the legendary “Monster Rancher” series and the fan-favorite “Monster Rancher 2” features improved versions of the highly successful training and battle systems of the “Monster Rancher”,approximately 400 monster types, and brand-new events and mini-games!<br/><br/>What kind of monster will be born from your favorite CD?<br/>Become a monster breeder now and train your monsters to participate in battle competitions!<br/><br/><br/><br/>---------------------<br/>◆ Game Features ◆<br/><br/>---------------------<br/>▼ About “Monster Rancher 2”<br/>“Monster Rancher 2” is a monster training simulation game in which you become a monster breeder to create a variety of monsters from disc stones, train them, and make them fight against other monsters.<br/>The most unique feature of this game is the option to obtain new monsters from music CDs. Different CDs produce different monsters, including some very rare ones!<br/><br/><br/><br/><br/>▼Aim to become a Master, the top monster breeder!<br/>◇◇ Acquire your monsters ◇◇<br/>Features a system that allows you to acquire monsters by searching through an original CD database!<br/>Discover what kind of monsters can be born from a variety of songs, from nostalgic to fresh new tracks, <br/>and raise the rare monsters that you couldn’t acquire during the original release!<br/><br/><br/><br/>◇◇ Develop a training menu from a variety of options ◇◇<br/>All monster stats, such as their health, strength, and resilience, are directly affected by the work and training you put them through.<br/>And by praising and scolding their achievements, you can help them grow even further!<br/>But watch out for your monsters' stress levels! It’s also important to be attentive to their needs.<br/>There are even more ways to raise monsters than in the previous game, so it's time to show off your trainer skills!<br/>\"Keep up the good work with your assistant, Colt, and your pet bird, Joy!\"<br/><br/><br/><br/>◇◇ Take your monsters out to compete ◇◇<br/>Once you've trained your monsters, register them for competitions and let them fight.<br/>During a fight, you can give your monster instructions to guide them to victory.<br/>But if their loyalty is low, they might not listen to you, so this is where the quality of your training comes into play.<br/>Win an official match to advance and aim to become an S Rank Monster Breeder!<br/><br/><br/><br/>◇◇ \"Slates\" and \"Jobs\" ◇◇<br/>Slating and Jobs are also available just like in the original version.<br/>Slating is used to transfer your monsters from “Monster Rancher” to “Monster Rancher 2”.<br/>And Jobs are tasks your monsters can complete to earn money.<br/>Note: Slating is available only between the games on the same platform.<br/><br/><br/><br/>▼ Evolving from the original series<br/>Based on the feedback from the series fans, some of the most requested improvements have been incorporated into the game, <br/>making it more comfortable to play while maintaining the fun of the original.<br/><br/><br/><br/>▼ Compete against your rivals around the world!<br/>You can download monsters raised by breeders all over the world and battle them against your own monsters.<br/>Raise the strongest monsters and become the best monster breeder!<br/><br/><br/><br/>-------------------------<br/>◆ Compatible Devices ◆<br/>-------------------------<br/>iPhone, iPod touch, iPad<br/>(Requires iOS 10.0 or later)<br/><br/><br/><br/>-----------------<br/>◆ Disclaimer ◆<br/>-----------------<br/>1. Please note that customer support will not be provided for not supported operating systems.<br/>2. Depending on the usage, the application may become unstable, even on a compatible device.<br/>3. Please note that the application may not support the latest version of the operating system, even if it is listed as \"iOS XXX or higher\".<br/>4. Unless otherwise stated, the monsters created through the music database are assigned at the company's discretion, and there is no correlation between the artists and “Monster Rancher”.<br/><br/><br/><br/>■ Privacy policy<br/>https://www.koeitecmo.co.jp/privacy/PrivacyPolicy_en.pdf<br/><br/>(C)KOEI TECMO GAMES CO.,LTD All rights reserved.", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2021-12-24T06:45:25", "background_image": "https://media.rawg.io/media/screenshots/3c1/3c14d678cf48476f29dd312a82d025c2_fuzDlda.jpg", "website": "https://www.koeitecmoamerica.com/mrdx/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KOEI TECMO GAMES CO"], "genres": ["RPG", "Simulation"], "publishers": ["Koei Tecmo Games"], "esrb_rating": "Teen"}