{"id": 712815, "slug": "mafia-sniper-wars-of-clans", "name": "Mafia Sniper - Wars of Clans", "name_original": "Mafia Sniper - Wars of Clans", "description": "An exciting stylish sniper game about mafia clans wars.<br/><br/>Are you ready to go back to the beginning of the XX century to take part in the grand mafia war between clans as a gunfighter and to confront street gangs and corrupt authorities? If yes, then our first person shooting game Mafia Sniper is going to challenge your bravery and reaction!<br/><br/>Push back gangsters, corrupt cops, politicians, and get to criminal bosses to seize power in the city. Fulfill murder contracts to destroy whole clans and build your career from an ordinary bandit (associate) to a capo, a consigliere and finally a Don.<br/><br/>Exciting shootouts and chases, all kinds of rivals (from petty criminals to powerful bosses), and different locations as well as various suits and weapons are waiting for you in this dangerous game mission.<br/><br/>Your arsenal includes a sniper rifle and Thompson submachine gun – use these guns to fight for domination of your clan. You may also use enhanced shots to increase damage: buckshot, double shot, blast chuck, shoсk shot.<br/><br/>You will have to struggle not only in the city locations (on the streets, dark alleys, roofs, in residential districts), but also in more unusual and interesting places like warehouses, industrial areas, parking lots, casinos, suburbs, and even forests.<br/><br/>Always be careful with civilians - if you accidentally kill them, you will be punished. As punishment, you will lose some of your money and you will be highly wanted - so, more cops and federal agents are going to hunt you.<br/><br/>In-game shopping offers you a range of perks:<br/>- small and big first-aid kit;<br/>- light and heavy armor;<br/>- talents/skills (fast recharge, an ability to earn more money for murders, additional set of bullets);<br/>- small and big bribes for cops to decrease the wanted level.<br/><br/>Survive on the streets full of crime and hostility, target and kill your enemies to take control over the city.<br/>Impressive animation and characters, atmospheric music and sound effects will let you dive in these old days of mafia rules.<br/><br/>Work up your courage and begin the great confrontation. It will be long and hard... So, win or die!<br/><br/><br/>Privacy policy: https://aigames.ae/policy<br/><br/>________________<br/>OUR COMMUNITY:<br/>Facebook: https://www.facebook.com/AzurGamesOfficial<br/>Instagram: https://www.instagram.com/azur_games<br/>YouTube: https://www.youtube.com/AzurInteractiveGame", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-24T06:23:37", "background_image": "https://media.rawg.io/media/screenshots/5e1/5e10fcc86dee148c31c1a9ec95adb0dd_x67KYpu.jpg", "website": "https://aigames.ae", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AI GAMES FZ"], "genres": ["Action", "Casual"], "publishers": ["AI GAMES FZ"], "esrb_rating": "Teen"}