{"id": 712831, "slug": "bloons-td-battles-2", "name": "Bloons TD Battles 2", "name_original": "Bloons TD Battles 2", "description": "<p>Battle through a series of challenging Arenas and prove that you have what it takes to enter the fabled Hall of Masters and seize your glory!<br />\nFrom the creators of Bloons TD 6 comes a brand new installment of the top-rated head-to-head tower defense game. Gather your Hero, choose your team of powerful Monkey Towers, and prepare to battle one on one against other players and relentless waves of Bloons!<br />\nCompetitive Tower Defense!<br />\n<em> Outwit and overwhelm your opponent in intense head-to-head play<br />\n</em> Balance the strength of your defenses while preparing a Bloon offensive that blitzes your opponent<br />\n<em> Countless strategic combinations can lead you to victory<br />\nSkill Based Gameplay!<br />\n</em> Match with players of similar rank as you work your way through 9 unique arenas<br />\n<em> Reach Hall of Masters to battle the best on a dynamic elo-based leaderboard<br />\n</em> Earn and display unique badges each season based on progress<br />\nLock and Load!<br />\n<em> Select from familiar Heroes and brand new Alts with unique upgrades<br />\n</em> 21 Monkey Towers with 15 unique upgrades each to customize your build<br />\n<em> Brand new Bloon send system optimizes economy building and attacks<br />\nBuild Your Bling!<br />\n</em> Win in style as you customise your loadout from hundreds of cosmetic items<br />\n<em> Flex with unique animations, emotes, bloon skins, and more<br />\n</em> New content added every season!<br />\nAnd of course tons of content and new feature updates are planned to make Bloons TD Battles 2 even more awesomer. What are you waiting for? It’s time to Battle!</p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2024-04-11T16:28:22", "background_image": "https://media.rawg.io/media/screenshots/22b/22b6d64d620f40ce01726b10ac31a01d_3EKIGL9.jpg", "website": "https://m.ninjakiwi.com/", "rating": 2.88, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 95, "toplay": 1, "dropped": 10, "playing": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 8, "platforms": ["macOS", "PC", "iOS", "Android"], "developers": ["Ninja Kiwi"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Ninja Kiwi"], "esrb_rating": "Everyone 10+"}