{"id": 712833, "slug": "merge-td-hero-tower-defense", "name": "Merge TD Hero - Tower Defense", "name_original": "Merge TD Hero - Tower Defense", "description": "Free Tower Defense Game! It’s TD time! Welcome to Merge TD Hero!<br/><br/><br/><br/>In Merge TD Hero, players can fight against opponent or monsters in real-time to defend the castle! How? Summon heroes and merge the hero cards to get most powerful strength! Merge TD Hero has different arenas to test your tower defense skills (also known as TD skills), come and see which level you’ll be!<br/><br/><br/><br/>Two TD Modes<br/>Players can choose to defend the castle as a team or not. There is a random monster in each mode, just like a random dice rolls, players win and prevail depending on Lady Luck, but collecting a deck of powerful tower defense (TD) hero cards can improve the TD rate.<br/>■ Battle Mode: Fight against your opponent. Real-time PVP battles against players around the world.<br/>■ Duo Mode: Fight as a team against the monsters. Cooperate with teammates to defend the monster from hell. (PVE)<br/><br/><br/><br/>TD Hero Cards<br/>TD (tower defense) hero cards are with different powers, like Debuff, Magic or Support. And there are different spells to cast like Power of Thor, Death Vortex or Demon Contract. Use strategy to defeat strong opponents. Upgrade TD hero card levels to win battles and progress to new Arenas.<br/>■100+ TD (tower defense) hero cards. <br/>■Persephone! Rarity can be common, rare, epic and legend. <br/><br/><br/><br/>SEASONAL EVENTS<br/>Fun and challenging seasonal events in Merge TD Hero. Unlock seasonal items like Arena Challenge and Seasonal Pass to get TD rewards like hero cards, spell, chest.<br/>■Arena Challenge: Start from the Training Camp and end with Supreme Master.<br/>■Pass Challenge: Free Pass and Hero Pass to get TD rewards.<br/><br/><br/><br/>Social Communication<br/>TD players can meet friends, join guild to play the free TD game together. Moreover, players can chat and send emojis to best friends (or worst foes).<br/><br/><br/><br/>Clash happens and need your heroes now! Rush to defend the castle and become a supreme master, just like a royale member.<br/><br/><br/><br/>Please Note:<br/>Merge TD Hero is a free tower defense game, but some items can also be purchased for real money. If you do not want to use this feature, please set up password protection for purchases in the settings of your Play Store or Apple Store.<br/>The game requires an internet connection.", "metacritic": null, "released": "2021-12-01", "tba": false, "updated": "2021-12-24T06:34:13", "background_image": "https://media.rawg.io/media/screenshots/bf4/bf49779add5da8e51696219e746333dc_AFCuEbq.jpg", "website": "http://www.vividjoangame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VIVIDJOAN GAMES SINGAPORE PTE"], "genres": ["Action", "Strategy"], "publishers": ["VIVIDJOAN GAMES SINGAPORE PTE"], "esrb_rating": "Teen"}