{"id": 712837, "slug": "king-of-defense-premium", "name": "King of Defense Premium", "name_original": "King of Defense Premium", "description": "King of Defense Premium: Tower Defense Offline is a premium version of the King of Defense: Battle Frontier. The premium version will include all the features of the free version with high quality graphics. In addition, this premium version also provides some new features that the free version does not have such as adding game modes, giving heroes, etc. <br/>        In this game, players can combine two turrets to create the best strategy in each game level. Each turret has its own strengths, which can support the remaining turrets.<br/>        In the fictional story, the kingdom is being invaded by monsters and invaders coming from the darkness. Join the adventure with heroes and warriors in epic battles to protect your kingdom. <br/>       Tower Defense game - King of Defense Premium: Tower Defense Offline always emphasizes tactics. A game level has many ways to overcome depending on how each player plays. Therefore, King of Defense Premium: Tower Defense Offline is always new and not boring.<br/>- NEW FEATURES:<br/>        -  The feature of turret superposition and combination gives players more options for the best tactics.<br/>        -  The hero system and turret are abundant and strongly upgraded. There are many upgrade options in the direction of the player's strategy.<br/>        -  Diverse terrain such as desert, jungle and icy lands. Each world has a new enemy with more difficulties. <br/>        -  Varied monsters, from flying monsters to monsters with other special skills.<br/>        -  Lots of game modes.<br/>Experience a new challenge with the unique offline tactical defense game, King of Defense Premium: Tower Defense Offline.", "metacritic": null, "released": "2020-09-15", "tba": false, "updated": "2021-12-24T06:36:22", "background_image": "https://media.rawg.io/media/screenshots/d70/d7067e59c4bff14a3f428aa2e0d32c68_Fc9nWfq.jpg", "website": "http://gcenterstudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gcenter"], "genres": ["Action", "Strategy"], "publishers": ["GCENTER VIET NAM TECHNOLOGY JOINT STOCK COMPANY"], "esrb_rating": "Everyone 10+"}