{"id": 712997, "slug": "chrimtes", "name": "ChrimTes", "name_original": "ChrimTes", "description": "<p>A game about a bunch of housemates hunting for a Christmas Tree at the last second.</p>\n<p>This game is intended as a satire on Christmas, consumerism, game quest design, England, and all sorts of pretentious nonsense!<br/></p>\n<p>I made every aspect of it, except where brands and copyrighted materials in the graphics are concerned. I did not make them and this game has NO affiliation with any brands or companies. This game is a PARODY!!!<br/></p>\n<p>This is an adventure game made in RPGMaker MV with no battling or fail states. It will take you around 10-40 minutes to complete depending on your gamer ability.</p>\n<p>It contains foul language, mild gore and blood, one sexual reference, and copious amounts of English slang.</p><p>This game was made for the SVGS game jam and I had about 25 days to make everything - on top of full time work, obligatory end-of-year parties and family commitments. Therefore literally every single aspect of this game is RUSHED, right down to the concept itself. I'm still pleased with it though.</p>\n<p>You can use the arrow keys to move, Enter or Z to interact with objects and talk to people, and Escape to access the menu.</p>\n<p>You can also click to get around and press right-click to access the menu.</p>\n<p>I hope you enjoy it and please check out my other games and the rest of the games in the game jam which are also epic!<br/></p>", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-24T07:29:10", "background_image": "https://media.rawg.io/media/screenshots/13d/13da595f11c5c991c0fedb268057fc17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["lemon_lime_games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}