{"id": 712940, "slug": "skyfall-2d-zombie-survival", "name": "Skyfall 2D Zombie Survival", "name_original": "Skyfall 2D Zombie Survival", "description": "Figure 1Figure 2<br/>\n\r\nFigure 3<br/>Figure 4Figure 5Figure 6<br/>Figure 7<br/><br/><br/><strong>What All Objects Are on Screen and Behaviors:</strong><br/> <br/>             Figure 1: This represents the main character of the game that the player controls. The avatar has a bow and arrow that shoots missile balls at zombies to survive an apocalypse and also moves around on the screen. Control its direction across space using the WASD controls or the arrow keys on your keyboard.       <br/><br/>      Figure 2: Indication that the game is over.         <br/><br/>     Figure 3: These are the larger zombies that move slow relative to the smaller zombies. They are easier to target and hit but watch out for swarms of them!        <br/><br/>     Figure 4: Press this reset button when the game is over, and you can restart the game!         <br/><br/><em>     Figure 5: </em>These stars are one of the power ups. They give an extra life to the player in case a zombie reaches the player’s base on the right side of the screen (which is -1 lives).         <br/><br/><em>      Figure 6: </em>This is an ammo power up that, when collected by the player, gives 75 extra bullets of ammo.         <br/><br/> <em>Figure 7: </em>This is the smaller zombie that moves much quicker than the larger ones, so make sure they do not creep up on you by surprise!                <br/><br/><strong>     Player Controls:        </strong> <br/><br/>     WASD / Arrow Keys control the movement of the avatar.       Space bar: If you click on the space bar you shoot circular bullets to the left side of the screen in order to eliminate zombies. You can shoot these bullets as often as you want but be careful because you have limited ammo!        <br/><br/><strong>     How The Player Scores:        </strong>      You score every time you eliminate any type of zombie enemy, which is +1 towards your score. Each takes 3 bullets to full eliminate them. Once you reach 500 points the game ends and you have won!         <br/><br/><strong>     How The Game Ends:</strong>       The game can end in 3 different ways:       Your avatar collides with a zombie and gets eaten alive! The game will instantly end, and you lose.      You lose all your lives when too many zombies pass through your base on the right side of the screen.      You win the game by eliminating 500 zombies total. <br/>", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-24T07:14:44", "background_image": "https://media.rawg.io/media/screenshots/465/465604b219af8be7a9b5c45651492c97.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bradley Pawlow"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}