{"id": 71293, "slug": "jumbline", "name": "Jumbline", "name_original": "Jumbline", "description": "----------------------------------<br/>Check out Jumbline 2 Available now with<br/>New Features, Extra Games, and Much More! <br/>----------------------------------<br/><br/>Whether you are a passionate philologist, or a novice pupil on a road of self-betterment and time swizzling fun, Jumbline will tantalize your senses in all the right places.<br/><br/>Jumbline is a familiar and fantastic word puzzle that will challenge your speed, your agility, your pattern recognition, and your spelling prowess, as you try and find all the possible words within a set of letters. Shuffle the letters, jumble the blocks, mix'em, find them, underline them!<br/><br/>★ REVIEWS ★<br/><br/>\"I'd like to thank you for making the BEST word game on the App Store (and best variation of 'Text Twist' out there).\" - Saroj M., one of our fans<br/><br/>\"with this game you’ve got what I consider to be a better version of the classic game.\"   - appVersity.com<br/><br/>\"It’s such a simple and effective control scheme that it’s surprising that no one has thought of it before.\" - darkzero.co.uk<br/><br/>\"With its smart design and pick-up-and-play appeal, Jumbline is a must for fans of this genre\" - CNET.com<br/><br/>★ HIGHLIGHTS ★<br/><br/>- The first revolutionary underline touch interaction<br/>- Beautiful and clear visuals and sound<br/>- Thousands of 5, 6, and 7 letter puzzles<br/>- Built in dictionary lookups!<br/>- Exciting word list based on the Scrabble dictionary<br/>- Modify game timer or disable timed mode entirely<br/>- Save and Resume where you left off<br/>- Play your own iPod music<br/>- Hall of Fame with Facebook Friends and Global Scores<br/>- Achievement Awards<br/>- and more!<br/><br/>This is the FULL AdFree Version of Jumbline that includes 5 &amp; 7 Letter puzzles, Global Leaderboards, and much more!", "metacritic": null, "released": "2009-03-27", "tba": false, "updated": "2019-10-22T14:26:28", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b279c2e828ac28e81b4023308e012c7.jpg", "website": "http://www.jumbline.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brainium Studios"], "genres": ["Puzzle"], "publishers": ["Brainium Studios"], "esrb_rating": "Everyone 10+"}