{"id": 713018, "slug": "ethereal-mist", "name": "Ethereal Mist", "name_original": "Ethereal Mist", "description": "<p>Ethereal Mist is (going to be) a story driven puzzle platformer. It's entire premise is built around exploring an expansive maze of rooms and solving puzzles along the way as you unravel the mystery of what brought you to this place.<br/><br/>As this project is still only in infancy, this first release is nothing more than a demo of the movement engine. built to let players test the first wave of abilities before I move on to puzzle mechanics and enemies.<br/><br/>If you find any bugs while playing please feel free to let me know about them so that this project can improve!</p>\n<p>P.S. The game has no audio or SFX in its current state.<br/><br/>If you like this project and wish to support its development, I have a Patreon available that offers early access to demo releases, behind the scenes progress updates, and at the highest tier, you can get a statue in game featuring your name as a special thanks for your support.<br/><br/></p>\n<p>Patreon: https://www.patreon.com/22Pepperjack</p>\n\n<p>Original Resource credits:</p>\n<p> - Unedited Tileset and Props by aamatniekss</p>\n<p> - Various effects by unTied Games</p>\n<p> - Character sprites by Thomas Lean</p>\n\n<p>Known Bugs:</p>\n<p> - sometimes turning off a rooms light and back on again will remove all player skills instead of just one.</p>\n<p> - player will occasionally get stuck in slopes. (can escape by jumping.)<br/></p>\n<p> - player animations will sometimes hitch for a single frame when swapping directions by large margins. (when vertical moving platforms stop or start you can sometimes see this.)</p>\n<p> - players can squeeze into small gaps by wall sliding into them.</p>\n\n<p>Demo 1.2 Changelog</p>\n<p> - corrected misspelling of \"Ethereal\" on title screen.</p>\n<p> - removed false walls from one room to make player objectives more clear.</p>\n<p> - Added and edited tile sets for the newest zone, the Dry Desert/Lush Jungle zone. (Not currently accessible)</p>", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-24T07:33:59", "background_image": "https://media.rawg.io/media/screenshots/11c/11c333a3f7340318548a94d5daea1a4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pepperjack22"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}