{"id": 713060, "slug": "gd-super-strike-vr-free", "name": "GD Super Strike VR Free", "name_original": "GD Super Strike VR Free", "description": "<p>This is the Free Play Version at its current State. The founders Pack and the Free to play are the same exact game, except for perks. The free to play version only comes with two Bowling Alleys and 3 Ball/Pin colors currently. How ever all 6 Bowling Patterns Are included, we will always keep the playing field equal. </p>\n<p>The Founders Pack is the Ultimate deal... In fact at this point we can't promise to much other than complete access to all playable content. We want to say there will be plenty of reason to want to become a Founder though.... we are just a little hesitant on making promises at our current state of development. The Founders Pack will come with all the perks up until official release of GD Super Strike VR. In fact Founders Pack will include all the perks for no less than One Year After Official Release. Founders Packs also include an Invitation to our Very First and Founders Exclusive International Virtual Reality Bowling Tournament, this will be a streamed event Live On Twitch. The winner will become the The Very First GD Super Strike VR King/Queen of the virtual lanes  for a Year. </p>\n<p> Welcome To GD Super Strike VR! Thank you so much for giving Game Dev_onian the opportunity to show you the starting phases of our virtual reality bowling simulator. This project is one that was started out of pure Love for VR and unstoppable determination, and has already been able to become one of the most enjoyable bowling experiences ever created. \r\n</p>\n<p>   This is only the very beginning steps of our much larger plan for the Year 2022. This officially means we have been able to reach our very first Mile Stone, in our ever growing list.\r\n</p>\n<p>   GD Super Strike VR is a new outlook on virtual reality sports, this is not just another bowling app. We plan to utilize our abilities to the fullest, and we also plan to be updating for the foreseeable future. With the unreal power provided by the Unreal Engine as well as other incredible technologies we see our GD Super Strike VR living a strong and vigorous life, for many years to come. \r\n</p>\n<p>   We ARE working ON MULTIPLAYER! The ultimate plan is to utilize…. Yep you guessed it Epic Online Services and accounts. We have very strong faith in Epic Games and Unreal Engine, and we plan to give back to and utilize every available opportunity they have provided us with.\r\n</p>\n<p>   Beyond GD Super Strike VR we plan on creating one of the most incredible communities. With live Twitch/Youtube streams that will be showcasing live tournaments and events you will never have a hard time finding GD Super Strike VR events. We are always going to try our best to earn the right to become a major competitor in the sports industry, the virtual and the real world. \r\n</p>\n<p>   This project in general and as a whole has been a hard sell(laughed out of the room) to investors and those who wish to see a fast return on their investments. However, Game Dev_onian has taken a stand on our project. We wish that our game would be available for everyone, for free. We know exactly how much everyone has already invested into their VR equipment, you deserve to be able to enjoy an unforgettable experience. We plan to use our abilities as Developers and Producers to win your hearts and beg for your generosity, instead of gating those who would be Guests to play with. We feel that all our guests' overall experience would be enhanced with a larger player base. We humbly wish to follow in the footsteps of some of our greatest inspirations.  \r\n</p>\n<p>Please Be advised our game is in development, in order to have permission to use this product you must agree to the terms of - USE AT YOUR OWN RISK- Game Dev_onian can not be held liable or responsible  in anyway for damages or harm caused. If you do Not Agree to the Terms - USE AT YOUR OWN RISK - please do NOT download and please do NOT PLAY. <br/></p>\n<p>Please Use Product With Caution and with Care to those around you Dogs/Cats/Humans - Nothing wants to be stepped on and no one want to get smacked in the head. Please Use with Caution and Care.\r\n</p>\n<p> USE AT YOUR OWN RISK\r\n</p>\n<p>!!There Are Flashes Of Light and can be Fairly Quick Movements Please Be Advised!!</p>", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-24T07:44:03", "background_image": "https://media.rawg.io/media/screenshots/abc/abc0bb0966891bfbcf4170cea91cee20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Dev_onian"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}