{"id": 7131, "slug": "dungeoneers-academy-trials", "name": "Dungeoneers Academy: Trials", "name_original": "Dungeoneers Academy: Trials", "description": "The call has gone out for new heroes to train and combat dark forces invading Timbercross. Uryene the Lion has opened his legendary academy to any willing to join the cause. Fight through hordes defiling local dungeons, gaining equipment and skills. Graduate and storm the countryside to eliminate the threat closing in. Collect treasure to buy sweet upgrades, or get lucky and find them as you go. As you improve, more grueling dungeons open and punishing creatures swarm.<br/><br/>The Lion and the academy train Fighters, Rangers and Wizards. Humans, Elves, Dwarves and Halflings of either gender are accepted. Get up close and personal with your foe as a Fighter, start your bow attack from afar as a Ranger, or train as a Wizard to learn powerful magic attacks. Each hero type requires a different strategy. Uryene sends no student into the wild without formal training in the nine academy dungeons. Be aware that boss Trolgar the Thumb has been seen in the final lesson. After graduation you are able to venture out and explore the surrounding four regions, beating back the invading legions and their ferocious masters.<br/><br/>Dungeoneers Academy is a mobile RPG/Rogue style fantasy adventure in which players control an avatar from a lowly recruit/trainee into a great hero of the land. Treasure and monsters are random for replayability, yet tailored to the each dungeon’s level. You will also encounter far more monsters when returning to lower level dungeons. The Academy Guild Store is always available with a great selection of equipment, weapons, spell scrolls and potions for you to choose from. Remember that some items are better for some classes than others.", "metacritic": null, "released": "2016-04-11", "tba": false, "updated": "2019-10-22T14:29:11", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7d138f3e19764b7d657ba45aaf8def0.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Fun Spray Games"], "genres": ["Adventure", "RPG"], "publishers": ["Fun Spray"], "esrb_rating": "Everyone 10+"}