{"id": 713123, "slug": "the-time-machine-spectrum-english-version", "name": "The Time Machine (Spectrum English Version)", "name_original": "The Time Machine (Spectrum English Version)", "description": "<p><strong>THE TIME MACHINE <br/></strong>(Spectrum 48K)<br/><strong>Senquentia Soft</strong><br/>An adaptation by Fran  Kapilla from classic book<br/>(english &amp; spanish version)</p>\n\n\n<p>New v 0.9 (testing) (22 dec 2021) <br/>v 0.8 (19 Dec 2021) </p>\n<p>This game is a Visual Novel, that is, you can play by selecting options, as if it were a game-book. It is inspired by H.G. Wells' 1895 book The Time Machine and the graphics have been redrawn from frames from George Pal's classic 1960 film. </p>\n<p>The rhythm of the game is very different from what is used in the arcades or more typical retro games of the Spectrum. It is somewhat close to conversational adventures (interactive fiction) but it really is a concept more in line with the new times since you can advance by choosing options (it can even be played on mobile devices with comfort because you only need three keys), you have an inventory with objects easy to use and also, if you get killed, you can continue playing in the phase you are in without having to start from the beginning. </p>\n<p>CONTROLS: <br/>Q - up <br/>A - down <br/>ENTER - select </p>\n<p>I discovered this book and at the same time the movie thanks to my father, who loved this story. I have dedicated the game to our kitten Romy that although she never knows of the existence of this game, for me she is almost like a person (whoever has animals understands me). <br/><br/></p>\n<p><strong><em>ZXDEV </em></strong></p>\n<p>The game is made (against the clock, in about two months) for the international creators contest of Spectrum 2021. It has been a pleasure to participate because in addition to being able to present my game (made with love), I have discovered other games that are wonderful and that everyone deserves to win. The version of the game is 0.9 because it is possible that someone will find a mistake, perhaps spelling. </p>\n\n<p><strong><em>The phases</em></strong></p>\n<p>At the end of each block a code appears, you must put it later, at the beginning of the next phase to be able to play. There are seven data blocks, the first is the cinematic introduction, then five phases of the game come and finally, block seven is the cinematic ending. A game made with philosophy I have created this game (with the advice of those mentioned in the acknowledgments) with the mere objective of reflecting on time, on love, on happiness. I hope that whoever appreciates it will also know what I'm talking about. I know that it is an atypical game for our Spectrum and that is why there will be those who say that they \"can't stand reading\" or there will be those who love it. In any case, I think it is a type of game that should abound more in our beloved machine because it simply shows that it is still alive with other formulas of the current homebrew and not only with the insistent pattern of thirty years ago, that everyone we like it, but it is also important to give way to other types of genres that keep the Spectrum alive. </p>\n<p><strong><em>Film, book, adaptation. </em></strong></p>\n<p>This adaptation is quite based on the original plot, however, some things I have synthesized (for example: when the two friends come to see you in phase 1, in the book it is supposed to be a meeting of six scientists, but for space from memory, I have simplified some things), and others, like the ending, I have changed a little, to make it more original, not to be repetitive, to have another enjoyment attached to the original Wells plot. Of course, I want to recommend that you read the book and also that you watch the 1960 film, you can do it even before playing, so you can enjoy every step of the game even more without a script problem since in this version, this personal adaptation that I have made, there are differences especially in the conclusion. </p>\n<p><strong><em>Documentation </em></strong></p>\n<p>To make the game, I have had to document a lot about aspects of each era, 1899, 1902, 1918, 1940, etc. From the type of energy batteries that existed, the weapons, the vehicles, the fashions and even the type of hair or mustaches ... all this has been necessary to be able to create the puzzles, the plots and the graphics. It was fun. </p>\n<p><strong><em>The Time Machine and John Titor </em></strong></p>\n<p>I have included a detail related to John Titor, I do not want to tell it but I leave it for the player to discover for himself. I just want to comment by way of making, that in addition to this secret detail ... I have relied on the operation of Titor's machine to explain the Wells mechanism but with some steampunk elements from the 19th century. I thought about putting other time travelers into the plot (a Delorean ...) but I was running out of memory and it didn't occur to me to give it the serious touch that the plot needs. What I did include in the plot, in phase 1, is a certain book ... the first one that deals with time travel, before Wells, whom I admire but the dates must be taken into account. That book \"The Anachronópete\" is less well known simply because it is not English. </p>\n\n<p>Finally: donations are appreciated to anyone who wants to contribute something. It is an little incentive for the author.</p>\n<p><strong><em>Thanks!</em></strong><strong><em> </em></strong></p>\n<p>Jari Komppa (Mucho engine), Aryekaix (time puzzle tips), RamonMax (rhythm tips), Ruber Eaglenest (inventory tips), Juanjo Muñoz y Briefer (English translation), Sergio The Pope (creation of Mucho McChainer, who will use in future games).</p><p><strong><em>IMPORTANT about languages:</em></strong></p>\n<p>Due to the large amount of text in this game and the high speed to translate, it is possible that there is some error in the English language.</p>\n<p>We kindly ask that if anyone finds errors, they tell us. We will fix them as soon as possible.</p>\n<p>&gt; And if someone is encouraged to help us translate in another language, например на русском языке, we are willing to use their translation and release the version in your language.</p>\n<p>Thanks!</p>", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-24T08:02:06", "background_image": "https://media.rawg.io/media/screenshots/fe2/fe2395a3257dfaa41f7297c8568699c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SEQUENTIA SOFT"], "genres": [], "publishers": [], "esrb_rating": null}