{"id": 713246, "slug": "hats-are-not-allowed-demo", "name": "Hats Are Not Allowed (DEMO)", "name_original": "Hats Are Not Allowed (DEMO)", "description": "<p><em><strong>Demo only - Full game release planned for Q1 2022</strong></em></p>\n<p><em>“Hats are forbidden. Any Bot found wearing a hat will be destroyed on sight. Any bot found not destroying a Bot found wearing a hat will be destroyed on sight.”</em> - <strong>RulerBot</strong><br/><br/><br/><br/>The illegal hat in your possession has an unprecedented level of style which will inspire others to join your rebellion. Fight with sword, spear and shield to survive against those who would destroy you. As your power grows you must determine where your true ambitions lie.</p>\r\nDUEL\r\n<p>The dueling system is easy to learn but hard to master. There is no need to memorize long combos. Instead the focus is on quick reflexes, timing and tactics. Beware feints, be strategic with your distance and don't run out of steam.</p>\r\nBATTLE\r\n<p>Bot combat modules restrict fighting to duels only. This means battles are conducted via 1v1 duels until one squad has been completely defeated. Strategically select your fighters and either simulate, spectate or take control of the duels yourself!</p>\r\nUPGRADE\r\n<p>Discover and equip new bot parts and items to increase your attributes that best suit your fighting style.</p>\r\nDECIDE\r\n<p>As “The Hat Wearer” you will lead the Hat Rebellion. Do you seek to start a political revolution aiming for total hat freedom? Do you want to claim power for yourself? Or do you seek to discover the truth behind this world and the authoritarian Genu Corp?</p>\n<p>If you run into frame rate issues please lower the graphics settings in the options menu.</p>\n<p>The full game will have local multiplayer.  However, the demo is single player only. <br/>I will love to hear any feedback. </p>\n<p> FIGHT WITH HONOR HAT WEARER!</p>", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-24T08:35:36", "background_image": "https://media.rawg.io/media/screenshots/19c/19c85b11b4d355b37086336edf3d280b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LazerGenu"], "genres": ["Action", "RPG", "Fighting"], "publishers": [], "esrb_rating": null}