{"id": 71331, "slug": "solitaire-tripeaks-card-game", "name": "Solitaire Tripeaks – Card Game", "name_original": "Solitaire Tripeaks – Card Game", "description": "Play in paradise with Solitaire TriPeaks, the number 1 online card game.  Our free solitaire game has over 850 levels – with more on the way! Join a Club to work with Friends or go solo and navigate the island with your trusty guide Tiki and his loveable dog Poi. Disarm Traps, use Boosters, &amp; earn points as you play your way through changing environments and events like Poi’s Treasure. What are you waiting for? Download now and have a BLAST in hot Solitaire TriPeaks paradise.<br/><br/>SOLITAIRE ON THE BEACH<br/>- Relax and fill up your Streak Meter to unlock solitaire BONUSES!<br/>- Trigger BOOSTERS like the Shark Hook, Magic Eye, and Peek-A-Boo.<br/>- Uncover the Golden Tiki Mask, Flower Blossom, and other hidden cards.<br/>- Journey through island destinations, unlocking new solitaire adventures and free bonuses.<br/>- Land on the Leaderboard to compete with friends in the solitaire arena and win HUGE rewards and bonuses!<br/>- Sip on classic solitaire with a special Tiki twist that includes elements of Klondike, Spider, FreeCell, and Pyramid solitaire games.<br/><br/>FREE ONLINE SOLITAIRE WITH DAILY REWARDS<br/>- Register now for FREE, and you’ll get 12,500 Coins on the house. Plus, you’ll collect a Daily Return Bonus for Coins every day!<br/>- Play Solitaire TriPeaks with your friends to earn bonus Coins and compete in weekly Leaderboard Challenges!<br/>- Participate in the TriPeaks Challenge or race to Poi’s Treasure for extra rewards and Boosts.<br/>- Casual, free, cards game for everyone to enjoy! Never played solitaire or cards games before? Complete a quick tutorial and get extra bonus Coins.<br/>- Check out our other free solitaire games on Facebook and GSN.com: FreeCell Solitaire, Pyramid Solitaire, Spider Solitaire, and Klondike Solitaire.<br/><br/>For questions or technical issues email us at: mobileapps@gsngames.com<br/><br/><br/>Check Out More Free Online Games from GSN Games:<br/>Bingo Bash! <br/>Play the world’s #1 bingo game now!<br/>Play here: http://goo.gl/y3g9H5<br/><br/>GSN Casino <br/>The world’s best Casino app with Slots, Bingo, Video Poker and Blackjack!<br/>Play here: http://goo.gl/aH0Lu1<br/><br/><br/>Privacy Policy:<br/>http://gsngamesnetwork.com/privacy.html", "metacritic": null, "released": "2014-08-13", "tba": false, "updated": "2019-10-22T14:26:29", "background_image": "https://media.rawg.io/media/screenshots/770/77048815072962b00a12f61b15923884.jpg", "website": "https://solitairetripeaks.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Show Network"], "genres": ["Card", "Puzzle"], "publishers": ["Game Show Network"], "esrb_rating": "Everyone 10+"}