{"id": 71339, "slug": "golden-tiger-slots-slot-games", "name": "Golden Tiger Slots: Slot Games", "name_original": "Golden Tiger Slots: Slot Games", "description": "A million times of download. Free to play slots and other arcade games in your mobile device! Players around the world are crazy about this new app. Join us to enjoy the pleasure of winning big prizes at IGS's \"Golden Tiger Slots\". <br/><br/>● Features<br/>【Easy to Play】Players can receive coins everyday. Easy to play FAFAFA. Apart from this, don't forget to log in with your Facebook account to receive 300,000 coins.<br/>【Play Anytime】Fabulous visual effect similar to Real Slot Machines. Players may feel like just being at Macau &amp; Las Vegas.   <br/>【Big Prizes】Big Jackpot Prizes. Random prizes given by God of Fortune. Players will enjoy the pleasure of being rich and becoming millionaire.    <br/>【Diversity】Lots of different kinds of AWP games to play at our Amusement City.  You can find Mario Machine、Lottery、Slots、Fishing Machine and lots of different kinds of Arcade Game.<br/>【Convenience】Players can use different accounts to log in, and connect with many kinds of social media. You will free just like being super star. <br/>【Versus】Exciting, real-time Competition. Compete with players all the world for the honor of your country.<br/><br/><br/>Welcome to visit our Fan Page to share your ideas and to win more coins.<br/>https://www.facebook.com/GoldenTigerSlots/<br/><br/><br/>The games are intended for an adult audience (21+).<br/>The games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>Practice or success at social casino gaming does not imply future success at \"real money gambling\".", "metacritic": null, "released": "2016-06-28", "tba": false, "updated": "2019-10-22T14:26:29", "background_image": "https://media.rawg.io/media/screenshots/b6c/b6c93119cd9187119218a87dbaa60f31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["International Games System Co"], "genres": ["Card"], "publishers": ["International Games System Co"], "esrb_rating": "Mature"}