{"id": 713325, "slug": "amirun-and-the-drunken-santa", "name": "AmiRun and the drunken Santa", "name_original": "AmiRun and the drunken Santa", "description": "<p>Santa was visited by AmiRun and of course there were liters of beer again. Unfortunately Santa is now too drunk to deliver the christmas gifts alone so Amirun has to help him.    Your job is now to steer the sleigh for Santa and tell AmiRun when to throw a gift down to  a chimney.<br/></p>\n\n\n<p>Control the sled with the <strong>cursor keys</strong> or with the <strong>W,A,SD</strong> keys to move right, left, up or down or you use a joypad controller for this.  The carriage is slowly accelerated in the desired direction and then decelerated again after the key is released. <br/></p>\n\n\n<p>To throw gifts press button <strong>1</strong> for a red gift, button<strong> 2</strong> for a green gift, button <strong>3</strong> for a blue gift and button<strong> 4</strong> for a yellow gift.   On the XBox controller you only have to press the buttons in the corresponding color.<br/></p>\n\n\n<p>Your goal is to throw a gift into every chimney in the city.  If you manage to do it, you will get points.  If you throw a gift with the right color into the chimney, you will get extra points and a bonus balloon.  You can collect the balloon and get 2 more gifts to spread around.<br/><br/>If you can throw more than one gift with the matching color into a chimney, you will get a combo bonus and extra points.<br/>Be sure to avoid the bats, if you touch them then you will lose 3 gifts.<br/></p>\n<p>The game is over when you run out of presents, so always make sure you collect all the balloons in time.</p>\n\n<p>Check out my other Games AmiRun1 and AmiRun2 and also the DevLab Game or contact me at my Social Media links.</p>\n<p>AmiRun2 - First Beer Part two - Run and Gun Game<br/>AmiRun1 - The Quest for the Party - Jump and Run Game<br/>DevLab Game  - 3d Sokoban clone</p>\n<p>Contact me Just Epyx social</p>", "metacritic": null, "released": "2021-12-22", "tba": false, "updated": "2021-12-24T08:59:09", "background_image": "https://media.rawg.io/media/screenshots/12a/12ac11aaaaadf4f414129a75fcabfeeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JustEpyx"], "genres": ["Action"], "publishers": [], "esrb_rating": null}