{"id": 713496, "slug": "stellar-fury", "name": "Stellar Fury", "name_original": "Stellar Fury", "description": "<p>You are a pilot for the resistance against the evil corporate hegemony, the Rubicon corporation. Free the people of Vyrisia from the tyranny and oppression of the wealthy elites and corporate greed.</p>\n<p><strong>Featuring music by Jean Baudin:</strong></p>\n<p>Jean Baudin (bandcamp.com)</p>\n\n<ul><li><strong>9 Action Packed Levels:</strong> Play thru 9 varied levels.\r\n</li><li><strong>Over 100 Enemies:</strong> Bring the wrath of hot plasma to over 100 unique enemies.\r\n</li><li><strong>3 Playable ships: </strong>Chose between 3 ships with unique abilities and weapons.\r\n</li><li><strong>Multiple Gameplay Modes:</strong><ul><li><em>Mission Mode:</em> Play the game in mission mode. Play with a 3-hit health bar and load to the most recently checkpoint upon death. Progress is saved to be resumed on the next session.</li><li><em>Arcade Mode: </em>No less important is the arcade mode. This provides a traditional arcade experience. Players will die upon one hit but have a total of 3 stock. Extends are available at various score levels. Achieve the almighty 1CC with the highest score possible.</li><li><em>Caravan Mode:</em> Timed mode where waves spawn only after the one before it is completely off the screen. Go for the high score!</li><li><em>Practice Mode:</em>  Immediately jump to any boss, midboss or any level segment to practice for your 1CC run.</li></ul></li></ul>\n<ul><li><strong>Extensive Graphic Options:</strong> We try to create the best graphical experience possible, but no setup can be right for everyone. We believe in giving as many options as possible to help players enjoy our game<ul><li>Selectively disable background items. Don't like the dust in level 3 for instance, you can turn it off.</li><li>Background luminosity settings. Find the background too distracting? This setting allows you to dim the entire background.</li><li>Player Hit Box Indicators: Want to know exactly where your hit box it, turn on an indicator in the settings.</li><li>Hit Flash Indicators: Change the color or disable completely the hit flash indicators.</li><li>Change between 30 and 60 FPS</li><li>Disable Debris: Find the debris distracting, they can be disabled</li></ul></li></ul>\n<ul><li><strong>TATE Mode:</strong> Stellar Fury is a vertical shoot 'em Up and no vertical shoot 'em up would be complete without TATE mode. TATE Mode allows you to flip the game by 90 degrees so that the game occupies the entire screen.\r\n</li></ul>\n<p>Please note that Stellar Fury is <em>in development. </em>The content presented in the demo is may not be reflective of the final version. Also note that you may very likely uncover bugs. If you do, please  consider reporting these issues to us on our Discord server so we can make Stellar Fury the best it can be. </p>\n<p>Please note that the feature list includes current and future planned features. Not all features may be available in the alpha demo. </p>\n<p>Please consider completing our feedback survey: </p>\n<p>https://forms.office.com/r/ByYGjZVbn3<br/></p>\n\n<p><strong>Connect with us on Social Media:</strong></p>\n<p>  </p>", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-24T09:42:56", "background_image": "https://media.rawg.io/media/screenshots/a8a/a8a5186612473f65cbb816d9edc72aed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fiGames"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}