{"id": 713464, "slug": "gemtd", "name": "GemTD", "name_original": "GemTD", "description": "Welcome to GemTD\r\n<p>GemTD is a small, one-man project I started at the end of November 2021. It was meant to get something done and be proud of it. The game itself is heavily inspired by the GemTD custom maps for Dota2 and Warcraft3.</p>\n<p>Your goal is to fight off enemies approaching from the top left corner. Every enemy that reaches the bottom right corner will cost you lives.</p>\n<p>Instead of going straight for the finish line, the enemies will first pass through 5 checkpoints.</p>\r\nOverview of the map and the path enemies will take\r\n<p>To defend yourself from the enemies, you must place, choose and combine gems, which will shoot at the enemies.</p>\n<p>The game is divided into multiple rounds consisting of the following phases:</p>\n<p><strong>Gem placing.</strong> Every round you get to place 5 gems. Every time you place a gem it will be of a random type and random quality.</p>\n<p>Possible types are Amethyst, aquamarine, diamond, emerald, opal, ruby, sapphire, and topaz.</p>\n<p>The different qualities and their chances to appear are listed in the bottom left corner. Killing enemies will gain you experience. With enough experience, you can level up and thus increase the chances for higher-quality gems.</p>\n\n<p>Once all five gems are placed, the second phase begins.</p>\n<p><strong>Selection.</strong> Now you have to pick one of the gems you just placed. All other gems will turn to foundations and are only used for blocking the path. If you have multiple gems of the same type and quality, you can upgrade one of them to a higher quality instead of picking the lower quality gem. If you are lucky, some of your gems might also fulfill one of the recipes of the game. I'm such a case, you can combine them directly. You can hover over the question mark to find out, which recipes require this gem. After selecting, upgrading, or combining a gem, the next phase begins.</p>\n\n<p><strong>Preparation</strong>. Now that you selected a gem, you can check, if you can combine your gems to a more powerful gem. All available recipes are listed in the help menu in the top left corner. The list will also highlight gems, that you currently own. To combine a gem, just click one of the gems needed for the recipe and select the combine option. But be careful, all gems used for the recipe will turn to foundations.</p>\n\n<p>One important note regarding combining is, that there are two independent pools of gems, that are considered. Previously selected gems are the first pool. You can detect them by their stone base. The second pool is the five gems placed during the current round. Recipes can only be fulfilled within one pool. The unselected gems can therefore not be used as kidding ingredients for a recipe with already selected gems and vise versa.</p>\n<p>When you are all done, you can start the wave and see how well you fare against the enemies.</p>\n<p>After the last enemy was either killed or reached the end, the next round begins and the phases start all over again.</p>\n<p>If you have no idea where to place your gems, you can use one of these maze helpers. They are efficient but are not required to beat the game.</p>\n\n<p>Now place your gems and start playing!</p>", "metacritic": null, "released": "2021-12-22", "tba": false, "updated": "2021-12-24T09:34:34", "background_image": "https://media.rawg.io/media/screenshots/0b6/0b62bf718d57c5fc061a1cc35489ccb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["Cecrit"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}