{"id": 71348, "slug": "shuffle-cats", "name": "Shuffle Cats", "name_original": "Shuffle Cats", "description": "Play the traditional card game rummy with a multiplayer twist for mobile! <br/><br/>Set over the rooftops of 1920’s London and hosted by a group of cats, we want you to join our club and play the world at cards!<br/><br/>Make your way through the card clubs of Lucky Lane and play against opponents from all over the world, in this brand new live player versus player game!<br/><br/>There’s no closing time, it's never too late and we’re always open for business with special live events over the weekends – download now for free, and play the world at cards with Shuffle Cats!<br/><br/>Shuffle Cats features:<br/>· The classic card game updated for bite-sized fun on the go!<br/>· Live, multiplayer games with people from around the world!<br/>· Unlock new and exciting challenges that offer inventive ways to play.<br/>· Boost your play by using Lucky Charms against your opponent.<br/>· Intuitive and highly polished - card games never looked so good!<br/>· Lighthearted interaction with other players, using fun chats and live card movement.<br/>· Easily sync your progress between your phone and tablet devices.<br/><br/>If you love playing Candy Crush Soda Saga or Farm Heroes Saga or you love classic card games like rummy, whist and solitaire, download Shuffle Cats now and discover an exciting new way to play card games for free on your mobile!<br/><br/>Visit https://care.king.com/ if you need help!<br/><br/>Shuffle Cats does not offer “real money gambling” or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at “real money gambling”. Internet connection required. Shuffle Cats is completely free to play but some optional in-game items will require payment. <br/><br/>You can turn off the payment feature by disabling in-app purchases in your device’s settings.<br/><br/>By downloading this game you are agreeing to our terms of service; http://about.king.com/consumer-terms/terms<br/><br/>Finally, a big thank you to everyone playing Shuffle Cats! See you on the rooftops!", "metacritic": null, "released": "2016-10-12", "tba": false, "updated": "2019-07-29T06:58:53", "background_image": "https://media.rawg.io/media/screenshots/8ac/8ac3650e0508ea1f6068f90a4f18f4a4.jpg", "website": "http://shufflecatsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["King"], "genres": ["Card"], "publishers": ["King.com"], "esrb_rating": "Everyone 10+"}