{"id": 71343, "slug": "buraco-jogatina-cartas-hd", "name": "Buraco Jogatina: Cartas HD", "name_original": "Buraco Jogatina: Cartas HD", "description": "Buraco é um jogo de cartas fácil de aprender e extremamente divertido! Escolha se jogará no modo Aberto, Fechado ou STBL e forme mesas com 2 ou 4 jogadores.<br/><br/>Nesse jogo seu objetivo é fazer pontos com sequências do mesmo naipe ou trincas (cartas do mesmo valor). Faça sequências de sete cartas para formar canastras. Se você for bom mesmo, pode fazer uma canastra de 500 (de Ás a rei) ou uma canastra real (de Ás a Ás)!<br/><br/>Em Buraco Jogatina: Cartas HD, você pode jogar no seu tablet quando e onde quiser. Confira as principais vantagens:<br/><br/>- JOGAR COM ROBÔS E OUTROS BURAQUEIROS: jogue com outros jogadores de carne e osso online ou, se preferir, treine com nossos robôs.<br/>- 3 MODALIDADES DIFERENTES: escolha o seu estilo de Buraco favorito, com as opções Buraco Aberto, Buraco Fechado ou Buraco Fechado STBL (Sem Trinca, Bate Limpa).<br/>- MESAS COM 2 OU 4 JOGADORES: escolha se irá montar uma mesa com apenas dois jogadores ou uma partida em duplas.<br/>- CLUBE VIP: para os grandes fãs de Buraco! Faça parte do Clube VIP e tenha vantagens exclusivas. Experimente grátis por um mês ou uma semana!<br/><br/>OUTRAS FUNCIONALIDADES<br/>Chat para falar com os outros jogadores enquanto joga!<br/>Customize a mesa e as cartas de baralho da partida.<br/>Estatísticas das partidas.<br/><br/>Se você gosta de Buraco, Tranca, Canasta, Burraco ou outros jogos de baralho, você vai amar esse jogo. Baixe agora Buraco Jogatina: Cartas HD e seja o mestre das canastras!<br/><br/>TORNE-SE VIP<br/>Você pode se tornar um jogador VIP assinando com a sua conta iTunes para obter vantagens exclusivas:<br/>- Jogue sem ver publicidade.<br/>- Participe do Ranking!<br/>- Coloque sua foto em seu avatar.<br/>- Há duas opções de assinaturas: Plano Mensal por US$ 3.99 e Anual por US$ 29.99.<br/><br/>O valor da assinatura será cobrado na sua conta iTunes assim que você confirmar a compra. Ao final do período contratado, a assinatura será renovada automaticamente conforme o valor original do plano previamente escolhido (ver os valores acima), com a cobrança da renovação sendo realizada 24 horas antes. Você pode desativar a renovação nas configurações da sua conta iTunes antes de 24 horas do final da assinatura vigente. Para mais informações, acesse os links abaixo:<br/>Política de privacidade: http://www.jogatina.com/site/privacy/mobile/buraco<br/>Termos de uso: https://www.jogatina.com/mobile/terms.do", "metacritic": null, "released": "2013-04-05", "tba": false, "updated": "2019-10-22T14:26:29", "background_image": "https://media.rawg.io/media/screenshots/578/57864047b6f160bbc3bdc072d08d0eb2.jpg", "website": "https://apps.jogatina.com/pt/buraco/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gazzag Servicos de Internet Ltda"], "genres": ["Card", "Family"], "publishers": ["Gazzag Servicos de Internet Ltda"], "esrb_rating": "Everyone 10+"}