{"id": 713672, "slug": "shakras-secret", "name": "Shakra’s Secret", "name_original": "Shakra’s Secret", "description": "<p>Guo_Yuqing_216809980_Lab 1</p>\n<p>Shakra is a city where modernity and classicism blend together. Every visitor who comes will be shocked by the huge project even though they can only see a small part of the city. The blend of modern skyscrapers and traditional Gothic architecture is surrounded by circles of scaffolding and cranes. All citizens are building, and when you (the player) communicate with them, they will ask you if they are willing to help them. After you complete their demands, there must be questions: What is the meaning of such endless architecture? At this time, the coming of night brings stars in the sky. When you look up and watch with the citizens, you will find that this is the blueprint of the city and is immersed in it. As the sun rises, you unconsciously follow the citizens to the interior of the city through the cracks in the building. At this time, you find that the crane and scaffolding are wrapped by another layer of cranes and scaffolding. In order to explore your curiosity about the inner core of the city, you begin to deepen one layer after another. . . . . .</p>\n<p>This is a single-player material acquisition game. Try to find the NPCs and portals to get your tasks and resources. Talk with them and use your tool. If you get some problem, try to press [E] and then you may get a new idea about it.<br/></p>", "metacritic": null, "released": "2021-12-22", "tba": false, "updated": "2021-12-24T10:30:11", "background_image": "https://media.rawg.io/media/screenshots/5a3/5a37fbcd9f6a02c428d9cd587ec2d66c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["yuqing11"], "genres": [], "publishers": [], "esrb_rating": null}