{"id": 713621, "slug": "museum-of-mediocre-appropriations", "name": "Museum of Mediocre Appropriations", "name_original": "Museum of Mediocre Appropriations", "description": "Museum of Mediocre Appropriations\r\n\n<p><strong>Museum of Mediocre Appropriations will always close after 5 minutes.</strong></p>\n<p><strong>The deceased game artist and game maker, 7byte, follows a financial farmer and his kid through a mysterious gallery that's everywhere and nowhere. The gallery is hosting 7byte's first-ever solo show, featuring 30 unique artworks.</strong></p>\n<p><strong>Xanadu Gallery, operating under the Museum of Mediocre Appropriations is a limbo gallery operating at the intersection of physical and digital arts. And of course, they've started selling NFTs.</strong></p>\n<p><strong>This game has a zero-player mode, and press ALT + F4 / CMD + Q to quit.</strong></p>\n\n\n<p><strong>Form your own associations, the following are just my notes:</strong></p>\n\n\n<p>The topic of appropriation &amp; approximation between game and art is an old one, the purpose of this, yet another gallery game thing is only to serve as my memory dump. With the ongoing pandemic of NFTs and GameFi, I find it hard and conflicting to navigate through the space of media arts. So I went ahead and built my own digital gallery filled with diary entries and niche appropriations of famous game arts done poorly. It is quite difficult to be a media artist, let alone a game artist in this crypto-bro-filled environment, at least if you are trying to stay clean.</p>\n<p>All in all, this piece is a game and a generative gallery. It is also my emotional dump of said conflictions, anger, and desperations. Take from it what you will, nothing if you don't feel like it, but do let me know if you find some hope out of the vapidness of this metaverse crap.</p>\n<p>1/6 installments.</p>", "metacritic": null, "released": "2021-12-22", "tba": false, "updated": "2021-12-24T10:19:19", "background_image": "https://media.rawg.io/media/screenshots/ba1/ba156e6a2941d3bae0d63205bd05878f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Nil Knight"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}