{"id": 71371, "slug": "flint-adventure", "name": "Flint Adventure", "name_original": "Flint Adventure", "description": "Game Introduction:<br/>\"Flint Adventure\" is a great idle mobile game with global servers. The game is set in pre-historic flint theme, which uses fantasy style and has varied heroes and strategies. Using off-line on-hook, players can get more benefits in a more time-saving way. Meanwhile, you can also experience a series of exciting contents such as trial secret, arena, leagues, etc. In Flint Adventure, you will lead tribal heroes in exploring a different adventure with millions of players. Now, please start your adventure.<br/><br/>In Flint Adventure, only the most courageous warriors can conquer the land!<br/>Explore every mysterious area of the primitive continent!<br/>Follow millions of players to lead your tribal heroes and embark on the adventure!<br/><br/>Game Features:<br/>1、Off-Line On-Hook Idle Mobile Game<br/>Dispatch your tribes, and your heroes will automatically fight for you!<br/>Leisure waits can win you epic equipment and legendary heroes!<br/>Offline state can also bring you rich rewards!<br/>2. Various Strategic Match among Heroes<br/>More than 200 heroes in different camps, and hundreds of personal skills!<br/>Forge &amp; collect rare weapons and equipment can greatly enhance your combat effectiveness! You need perfect equipment collocation strategy<br/>Leisurely enjoy the game with simple operation skills!<br/>3. Rich Contents<br/>Idle, combat, mission from chiefs, collect, develop!<br/>Trial secret, arena, leagues!<br/>Endless exciting contents waiting for you to experience!<br/>4. Multiple Alliance Games<br/>Challenge the powerful alliance boss!<br/>Compete with other guilds for the No.1 League glory!<br/>Build up a strong alliance with other players to create a legendary alliance!<br/>5. Peak Competition among Global Players<br/>Join in the arena and compete with players from all over the world!<br/>Launch attacks on the leaderboard and the highest glory to win powerful loots!!", "metacritic": null, "released": "2018-06-13", "tba": false, "updated": "2019-10-22T14:26:29", "background_image": "https://media.rawg.io/media/screenshots/00c/00c4020586511ad6a8608c375a3a8516.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oasis Games"], "genres": ["Strategy", "Card"], "publishers": ["Oasis Games"], "esrb_rating": null}