{"id": 713920, "slug": "the-painted-knight", "name": "The Painted Knight", "name_original": "The Painted Knight", "description": "<p><strong>This is one of my first completed RPG Maker projects. It's gonna be a bit rough around the edges. However, I'm adding it to Itch as a sort of \"archival\" bit. Not to mention, it (retroactively) takes place in the fantasy world of my non-Dana games. If only for the writing and curiosity's sake, maybe you might have fun? <br/></strong></p>\n<p><em>Months after their assault on the Forsaken Isle off the coast of their city, three adventurers come together once more. A dancer turned cleric, a mercenary turned militia, and a magician turned elementalist. Called together by the cleric, her friends know nothing other than the sum they're being offered by her temple. The task seems simple enough -- retrieve a portrait from the residence of a missing painter. But it's not long before the cleric's compatriots consider their quest vaguely defined... and find themselves in a heap of trouble alongside her.</em></p>\n\n<p>\"The Painted Knight\" is a humble dungeon crawl made for 2019's Theme Roulette II event on RPG Maker Network. It's a sequel no one asked for to my previous finished game at the time, Forsaken Isle. In particular, my prompted word was 'Palette', and my image prompt was... a screenshot from some PS2-era JRPG involving a knight. The original image is lost to a now-defunct Imgur account of mine. ^^;</p>\n\n<p>...and so, I figured I'd do my spin on a beloved side-quest of mine from <em>The Elder Scrolls IV: Oblivion</em>. Guide Tawny, Zeke and Carol as they fight for their lives within an eldritch painting's pocket dimension.</p>\n<p>The game is ~30 minutes long, as per my usual for games.<br/></p>\n<p>Credits<br/>* Party member sprites: Makapri <br/>* Scripts: Yanfly's \"Yanfly Engine Ace\" <br/>* Music: Aaron Krogh, Snowy Fox (RMN Music Pack)</p>", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2021-12-24T11:31:55", "background_image": "https://media.rawg.io/media/screenshots/8d7/8d7c9d5b4f79dcde16d3db0ac81d96b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rachel the Seeker"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}