{"id": 714043, "slug": "whiteboard", "name": "Whiteboard", "name_original": "Whiteboard", "description": "<p>Welcome to Whiteboard, Alter Learning's virtual multiplayer voice classroom environment. This conventional and endlessly configurable educational setting allows educators to parameterize the classroom seating arrangements and design interactable content to compliment lesson materials. An interactive 'whiteboard' surface helps for communicating ideas and equations in real-time. </p>\n<p><strong>Controls</strong>\n</p>\n<p><em><strong>WebGL:</strong></em> Use the  Arrow keys to navigate Left and Right through the scene to view the 3D environments that can be explored presently in VR. The WebGL build has very limited interactability, but it does provide some insight into the project's development and introduces the user to elements of the VR experience that are immersive with the aid of VR hardware (such as the Quest 2 build, which is available for download on this page below). Click and hold the M1 mouse button (default left-click button) to look around the room. Use the the directional arrows on your keyboard to move forward, backward, and side to side.  The WebGL build allows individuals with a desktop computer to open the scene and explore the environments that we have created for a Virtual Reality experience. You can walk around the indoor and outdoors spaces, but functionality is limited in the WebGL format. \r\n</p>\n<p><em><strong>Quest 2:</strong></em> You spawn inside a home study room. Press the \"X\" button on the left controller to open an avatar selection screen and a selection screen for the Whiteboard environment. Choose your avatar, then look to your left and select the classroom to join. Each classroom supports up to 20 players at a time, which is indicated by the numbers on the lower right corner of the environment's title image. Once the user selects a classroom they will be asked to <strong>Connect with a Name, </strong>then prompted to enter a username that will appear above their avatar. The user enters their preferred username using the hand controls then taps  <strong>Enter</strong> to join the selected classroom. Alternatively, the user can <strong>Connect Anonymously </strong>and spawn directly into the selected classroom.\r\nOnce inside the classroom the user is free to move around with the Lefthand Thumbstick. Use the \"A\" and \"X\" buttons on the controllers to pickup the markers and use them to interact with the whiteboard. Other users can join the class and the users can interact together to visually communicate their ideas with each other. </p>", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2021-12-24T12:02:35", "background_image": "https://media.rawg.io/media/screenshots/91b/91bd6988f3dc6e65a9d12511188c817d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AlterLearning"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}