{"id": 714196, "slug": "fell-fellvn", "name": "Fell (FellVN)", "name_original": "Fell (FellVN)", "description": "<p>Hey there, I'm Tommie and I'm making Fell!</p>\n<p>If you like Fell please consider supporting it on:</p>\n<p>https://www.patreon.com/FellVN</p>\n<p>https://mobile.twitter.com/Fell_VN</p>\n<p>--------------</p>\n<p>Fell is a furry visual novel about a little guy just trying to figure out how to live and how to be himself, all while navigating mental distress, and a recurring nightmare that ails him.</p>\n<p><strong>TW</strong>: Fell includes mention and discussion of a lot of emotional and disturbing topics as well as disturbing imagery, so please play at your own discretion/when you think you are able to handle such things. (Blood, mental illness, drug use, self-harm, etc). <strong>While I don't think this game deserves an 18+ rating as of right now I would probably say it is for 16+</strong></p>\n<p>The story, writing, concept, and world/character designs and voices are by me.</p>\n<p>Backgrounds by the lovely Lee Doyle (thank you so much man you're amazing)</p>\n<p>https://twitter.com/leedoyleart?t=17ke2_RJnVrAv73r...</p>\n<p>Sprites and scenes by Bubblyernie! (You are a lifesaver, my friend, I'm very happy to have you on the team) https://instagram.com/bubblyernie?utm_medium=copy...</p>\n<p>Music used from library of Antti Luode (slightly altered)  https://twitter.com/aluode</p>\n<p>Inspiration and other concepts by @Charrfie and @Nervigg on Instagram and Twitter (Thank you both so much!!! Especially you Charffie, for pushing me to do this since the beginning, you're a massive inspiration to me and many others!)</p>\n<p><em><strong>ALSO A BIG HEADS UP!</strong></em></p>\n<p>I do not have the funds to continue updating the VN on my own! So if you choose to support me on patreon your funds will directly go to the production of future chapters. If we don't get enough funding per month I'll try my best to cover the difference but that will be really hard for me. So your support is the key to this VN being produced! Especially for the first update. I am drained of resources at the moment and definitely can't afford to fund chapter 2 on my own immediately, so yeah :')</p>\n<p>P.S. I am also a full-time college student and have obligations outside of this passion project, so if life calls I must answer!</p>\n<p>P.P.S. Don't go rooting around in the files first unless you want spoilers.</p>\n\n<p><strong>UPDATE 0.11-----</strong></p>\n<p>Hey! This is a <strong>VERY SMALL </strong>update that just attempts to fix some flow issues in a few places. If you have already played you do not need to worry about downloading and replaying this version.</p>\n<p>Also added a few choices, though they don't do much aside from slight dialogue differences, I'm hoping that they might have the chance to mean more down the line if the project continues.</p>\n<p>PPPS In the event this is the last update, I must say, thank you all for your support and for giving Fell a shot. It truly means the world to me that people were able to enjoy my work to any degree. Thank you for your time :)</p><p><em>*And an EVEN TINIER update to add some patrons to the thanks page*</em></p>", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-24T12:41:51", "background_image": "https://media.rawg.io/media/screenshots/6aa/6aa75ad303eb398892614cd76a17fb58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["FellVN"], "genres": [], "publishers": [], "esrb_rating": null}