{"id": 714287, "slug": "the-first-form-of-contact", "name": "The first form of contact", "name_original": "The first form of contact", "description": "<p><strong>Requirements:<br/></strong>Two players, one screen, the ability to see each other, and a die (or any form of random picking between 1 and 6).<br/></p>\n<p><strong>Controls:<br/></strong><em>Q, W, E, R, T, and Y</em>: move a body point up.<br/><em>A, S, D, F, G, and H</em>: move a body point down.<br/><em>Z, X, or C:</em> play sound effects.</p>\n<p><strong>Concept:<br/></strong>The two-player both select a role. One player is the creature, the second player the <br/>contactor. <br/>CONTACTOR:<br/>The contactor gets a list of words, the contactor is allowed to say and move how they want, as long as they don't say a word with the letter E in it. The goal of the contactor is to guess the word from the list the creature is trying to communicate. The contactor guesses by saying the word out loud. The first answer given will be the final answer. So remember to not say a word from the list out loud, because it will be the final answer.<br/>CREATURE:<br/>The player that's in control of the creature cannot talk or move in any way or form. They can however move the creature on the screen. They can move certain parts of the creature's body or make one of 3 creature sounds (see controls). The goal of the creature is to communicate one word to the contactor. First, they throw a dice, and they have to communicate that word from the list.</p>\n\n<p><strong>Note:<br/></strong>This prototype is mad for project hybrid.<br/>This prototype was made in an estimate of 1 or 2 hours.</p>", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2021-12-24T13:07:40", "background_image": "https://media.rawg.io/media/screenshots/55a/55a013ef2a37a6054174dbb57fae117a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["poesbroek"], "genres": [], "publishers": [], "esrb_rating": null}