{"id": 7142, "slug": "soosiz-hd", "name": "Soosiz HD", "name_original": "Soosiz HD", "description": "Featured by Apple in the &amp;quot;Great Platformers&amp;quot; category!<br/><br/>A highly acclaimed iPhone platformer now in HD for the iPad! Read the reviews below to find out more. (Please note that the HD version only adds improved graphics and iPad optimized controls. Otherwise the game is the same as Soosiz for the iPhone.) <br/><br/>&amp;quot;This is the best platforming game that we&amp;#39;ve played on the iPhone. It adopts the usual trappings of a traditional 2d platformer but perfectly mixes in a gravity defying mechanism that turns out to be a lot more than just a cute gimmick. Combine that with great controls and a ton of content, and you have one of our favorite iPhone games.&amp;quot;<br/>--toucharcade.com<br/><br/>&amp;quot;Soosiz is without question the best platformer yet on the App Store. The game uses gravity-centered gameplay, like that of Gomi, but much more fast-paced, to turn a good platform adventure into something extraordinary.&amp;quot;<br/>--148apps.com<br/><br/>&amp;quot;This is the first title to hit the iPhone that provides the true platformer experience, and then flips it on its head. The game is an absolute wonderful experience, and then there are great sounds, visuals, and controls.&amp;quot; Rating: 5/5 Must Have<br/>--appadvice.com<br/><br/>&amp;quot;Soosiz manages to capture almost everything that was great about platformers from years gone by, as well as spinning the genre on its head – quite literally.&amp;quot; Rating: Silver Award<br/>--pocketgamer.co.uk<br/><br/>&amp;quot;this developer has polished its game so well that it deserves to be recognized as the most Shigeru Miyamoto-esque platformer yet released for the iPhone and iPod touch.&amp;quot; iLounge Rating: A-<br/>--ilounge.com<br/><br/>&amp;quot;Soosiz managed to beat all odds and catapult itself to now THREE of the iPhone’s best platformer levels.&amp;quot;<br/>--theappera.com<br/><br/><br/>THE GAME:<br/><br/>Darkness is falling and your friends are missing. Do you have what it takes to save the world? Experience the groundbreaking gameplay mechanics, excellent playability and pixel-precise controls in this gravity-defying platformer where words like up and down get a totally new meaning.<br/><br/>Simple controls make Soosiz easy to learn, but it&amp;#39;s a challenge to truly master the game. Enhancing your skills will be essential in beating the new gameplay elements and enemies introduced in each world. Watch out for the reduced gravity in space, slippery surfaces on the ice, gravity fields, freezing fountains and more.<br/><br/>A PIECE OF ART<br/><br/>- Stunning cartoon graphics and smooth animations<br/>- Lively worlds filled with astonishing special effects<br/>- Level design taken to new dimensions<br/>- Captivating background music by Kevin MacLeod<br/><br/>HOURS OF FUN ADVENTURE<br/><br/>- Explore 7 beautiful worlds<br/>- Complete 66 challenging levels<br/>- Beat 7 bosses in epic battles<br/>- Discover all the secrets<br/>- Master the unique gameplay mechanics<br/><br/>Soosiz introduces a polished concept with intuitive and simple controls to achieve a fantastic platforming experience.<br/><br/>Check out the trailer video at soosiz.touchfoo.com", "metacritic": null, "released": "2010-04-01", "tba": false, "updated": "2019-10-22T14:29:12", "background_image": "https://media.rawg.io/media/screenshots/4b6/4b672f0ab33c6e838226bf0d4aa0a16b.jpeg", "website": "http://www.touchfoo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Touch Foo"], "genres": ["Action", "Adventure"], "publishers": ["Ville Makynen"], "esrb_rating": "Everyone 10+"}