{"id": 714494, "slug": "master-theft-tvs", "name": "Master Theft TVs", "name_original": "Master Theft TVs", "description": "\"Master Theft TVs\" is arcade platformer with find and collecting items on levels for a certain time.<br/><br/><strong>Plot</strong><br/>After end of the civil war on Crossi-Raya and coming to power \"Conservation force\", for previously a democratic country isolated era from the whole world begins. Since country not can more independently feed the entire population, with this problem there is hunger and poverty. Citizens go to crime, for feed themselves. And with the lost war, every citizen of the country has lost any hope for a wonderful future. \"Conservation force\" left almost everyone without anything, it forcibly took away the enterprises, and put their owners in prisons. One of these company was engaged in the development of televisions, with unique chips. But since country no longer allows exporting to other countries and company is now in the hands of \"conservation force\". This tvs have become worth their weight in gold from illegal exporters. <br/>By searching for these tvs and its thefts, is what our hero is doing.<br/><br/><strong>Differences Steam version before other released version</strong><br/><ul><li>2 game modes: Arcade mode and Story mode<br/></li><li>Steam achievements<br/></li><li>Steam leaderboard</li></ul><br/><strong>Arcade mode - ...</strong><br/>32 levels and bonus stage after each 5 levels.<br/><strong>Story mode - ...</strong><br/>32 levels with cut-scenes and with non-game levels complementing the game world.<br/><br/>*The game does not work on OS Windows XP or later.", "metacritic": null, "released": "2021-12-23", "tba": false, "updated": "2021-12-27T02:57:42", "background_image": "https://media.rawg.io/media/screenshots/f05/f05a5ead96617c61ead64592be296292.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nikita Zotov"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Nikita Zotov"], "esrb_rating": null}