{"id": 714485, "slug": "lakehouse", "name": "Lakehouse", "name_original": "Lakehouse", "description": "<h3>Spend a year at Stowford!</h3>It's 2004, you're moving away to study at Stowford College, and you're determined not to be single by the summer holidays!<br/><br/>You wave off your parents, catch the next train, and make your way to Stowford College to find love... and also study or something.<br/><br/>Enjoy a choices matter visual novel built to be all killer, no filler.<h3>LAKEHOUSE Features:</h3><ul><li>4 unique Routes with their own engaging themes, making for hours of content.<br/></li><li>42+ unlock CGs that vary from fun character moments to motivational posters.<br/></li><li>23+ music tracks that ooze personality.<br/></li><li>Numerous Steam achievements combined with hidden content will ensure bragging rights among friends if you unlock them first.<br/></li><li>It's a VN optimised for resolutions above 720p, for the classy enthusiast.</li></ul><h3>Join a Club!</h3><strong>The Photography Club</strong> - Try out Stowford's most popular club, led by Stowford's most popular student, <strong>Kelly Brooks</strong>! By using state of the art equipment, anyone can make a statement!<br/><br/>Kelly has insisted we be note that access to the Dark Room is restricted, to ensure that negatives can properly develop.<br/><br/><strong>The Stowford Otters</strong> - For the athletically inclined, the Stowford Otters are a dream team. Build confidence and practice your technique in our on-site pool!<br/><br/>Interested students should contact <strong>Craig Davis</strong> as soon as possible, to reserve a slot.<br/><br/><strong>The Games Club</strong> - If you're a fan of video gaming, card games, or board games, you could do worse than the Games Club.<br/><br/>As with all clubs at Stowford College, the Games Club is obligated to offer a taster session to new students at the start of each school year.<br/><br/><strong>The Events Committee</strong> - Please disregard, <strong>Justin Moore</strong> of the Events Committee has been asked to step down following the 'exploding urinal' incident and will no longer be allowed to participate in club activites.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-27T02:50:23", "background_image": "https://media.rawg.io/media/screenshots/6fc/6fc757ce64126b4f258fce59e70db347.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Thighs"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Thighs"], "esrb_rating": null}