{"id": 714580, "slug": "call-of-antia-match-3-rpg", "name": "Call of Antia: Match 3 RPG", "name_original": "Call of Antia: Match 3 RPG", "description": "Call of Antia is a brand new type of match-3 RPG game. In this unique RPG game, the classic match-3 puzzle will be used to inspire the potential of the dragons and heroes as they charge into the enemies fearlessly. Are you ready? Let's reveal the secret of Antia! <br/><br/>·Thrilling Match-3 <br/>Interesting and strategic battles. <br/>A journey is full of challenges and fulfillment! <br/><br/>·Build Your Shire <br/>Build your shire, train strong soldiers and become a real king! <br/><br/>·Legendary Heroes <br/>Collect over 50 epic heroes, level them up, and upgrade their abilities. <br/>Use different strategies and put forth your best heroes to fight the darkness. <br/><br/>·Ancient Dragons <br/>Dragons, the secret weapon in battles, are your strongest allies to vanquish all enemies! <br/>Find your legendary dragons and they will reveal the secrets buried in the world of Antia. <br/><br/>·Exciting Journey <br/>You will encounter diversified and unique enemies! <br/>A funny goblin bearing a huge treasure bag, an epic ogryn with two heads, a sinister assassin, and even a dryad! <br/>Loads of bonuses are waiting for you! <br/><br/>·Online Battle <br/>A variety of battle modes: Alliance Wars, 1v1 battle, and Fallen Titans. <br/>Experience real battles with your allies and fight for glory! <br/><br/>·Global Social <br/>Join an alliance to play with millions of players all over the world and collect great rewards! <br/><br/>·Tons of Events <br/>Rich and various events that give you free items. <br/>You can participate in multiple events at the same time. Find your allies and join those epic events!<br/><br/><br/><br/>Antia is calling you, my lord! As the chosen one, are you ready to join this fantasy world? Now, the Dark Legion has come back. You will take on the role of a mighty Lord that have been chosen to join an unequaled battle against the Dark Force. It is time to build your shire, recruit legendary heroes, and train epic dragons! As a very unique RPG game, the classic match-3 puzzle will be used to drive the potential of the dragons and heroes into your army as they charge into the enemies fearlessly. Are you ready? Let's reveal the secret of Antia!<br/><br/>Follow us:<br/>https://www.facebook.com/CallofAntia", "metacritic": null, "released": "2021-12-16", "tba": false, "updated": "2022-11-02T19:10:28", "background_image": "https://media.rawg.io/media/screenshots/ecb/ecbae1d6425565ebb6330b77915b71ee_8vTnG3K.jpg", "website": "https://www.facebook.com/CallofAntia/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["KingsGroup International"], "genres": ["RPG", "Card"], "publishers": ["KingsGroup International"], "esrb_rating": "Teen"}