{"id": 71451, "slug": "scatter-slots-hot-vegas-slots", "name": "Scatter Slots: Hot Vegas Slots", "name_original": "Scatter Slots: Hot Vegas Slots", "description": "Meet Scatter Slots - the best Vegas casino slot machines. Start with a huge casino bonus - 12,000,000 Free Slots Coins.<br/> <br/>Get ready to feel another side of gambling. Scatter Slots invites you to play fantasy casino slot machines with huge payouts, free spins and bonus games!<br/>Join the most unusual Slots Сommunity in the world NOW!<br/><br/>Download Scatter Slots and enjoy:<br/><br/>- Huge payouts, Big Wins and atmosphere full of gambling.<br/>- Free spins, re-spins, bonus games, jackpots and more! Every Spin brings you Wins.<br/>- More than 30 Slots available. New Slot - new mechanic and Daily challenges inside.<br/>- Play the game Online or Offline and have your adventure sync across all devices.<br/>- Free coins every hour in special Scatter Slot.<br/>- Stunning graphics!<br/><br/>Do you hear the thrill of Vegas Scatter Slots in your ears?<br/>Start your fantasy casino journey with our awesome characters. Lady Femida, Thief, Vampire Hunter, Ice Baby, Genie, Dangerous Twins and other fantastic characters are waiting for you.<br/>Free Scatter Slots will be your luck today!<br/><br/>FROM THE MAKERS OF SCATTER SLOTS<br/><br/>This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling. Use of this application is governed by the Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy. Both policies are available at www.murka.com", "metacritic": null, "released": "2015-01-02", "tba": false, "updated": "2019-10-22T14:25:04", "background_image": "https://media.rawg.io/media/screenshots/77e/77ec75ea8e52c655c4f7ee572b091283.jpg", "website": "http://murka.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Murka Entertainment"], "genres": ["Card"], "publishers": ["Murka Entertainment"], "esrb_rating": "Teen"}