{"id": 714500, "slug": "boxing-club-manager", "name": "Boxing Club Manager", "name_original": "Boxing Club Manager", "description": "You've waited long enough.  Boxing management is now in your gloves.<br/>Winning fights is your goal.  Running the best gym is your future.<br/>Take control.  Train and steer your boxers to glory in the ring!<br/>Build up your gym, make it World class!<h3>GAME DESCRIPTION</h3><br/>Can you make your gym a tremendous success?<br/>Can you become world famous for having the very best of the best fighters?<br/>17 Weight classes and title belts.<br/>68 Gyms, managers and trainers.<br/>612 Fighters.<h3>CHOOSE YOUR MANAGEMENT STYLE</h3><br/>Choose your management style.  Do you want to be the ex-fighter or the man in the suit.<br/>They each have different boosts that effect the game.<br/>Do you want to be good in the board room or at ring side, directing your fighter?<h3>CHOOSE YOUR FIGHTERS</h3><br/>Choose your fighters and nurture them from amateur to pro, and then onto to title contenders.<h3>CHOOSE YOUR TRAINERS</h3><br/>Every trainer has different levels of knowledge in all 11 areas of training.<br/>They are also assigned their own general training level.<br/>Choose multiple trainers that best fit the abilities you want to train in your fighters.<h3>TRAINING</h3><br/>Use your training points wisely to give your fighters the training they need.<br/>Send your pro fighter to training camp to train for his title fight.<h3>FACILITIES</h3><br/>Keep your gym facilities in check and upgrade them, but keep your eye on your expenditure.<h3>SPONSORS</h3><br/>Select from a vast range of available sponsors, to boost much needed funds for your club.<h3>WATCH THE FIGHT</h3><br/>3D Engine with tactics controls and the ability to change style and intensity as you watch.<br/>Keep an eye on your fighters cardio and durability otherwise a knockout could be on the cards.<br/>If time is short, you can choose to simulate the fight to get immediate results.<h3>THE EDITOR</h3><br/>Create your own database of fighters and gyms.  Upload them to the Steam Workshop and share them with others.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-27T03:02:54", "background_image": "https://media.rawg.io/media/screenshots/b33/b3301e59da9eb704bd3e2ac8d965d4aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Alternative Software"], "genres": ["Strategy", "Simulation", "Sports"], "publishers": ["Alternative Software"], "esrb_rating": null}