{"id": 714543, "slug": "boxer-mania", "name": "Boxer Mania", "name_original": "Boxer Mania", "description": "Fights are hard, so you have to train harder if you do not want to taste the cement in the ground! <br/><br/>Boxer Mania is a carefully tailored to give you the ultimate boxing experience. Immerse yourself in realistic boxing and workout animations, knock on some wood and grind with some iron to prove yourself to the crowd.<br/><br/>Every bit in Boxer Mania is realistic so if you don't want your head to rub the cement, you have to work hard and earn money, strength and experience to carry yourself in the ring! As you progress through the ladder, your opponents will hit harder. Unlock various stations and improve your strength, durability, stamina, speed and agility.<br/><br/>Write your own destiny and define your legacy by unlocking statues in the gym! Dare to be a champion boxer?<br/><br/>Lots of different workout stations to boost your strength;<br/><br/>- Dumbbell Curl<br/>- Heavy Bag<br/>- Treadmill<br/>- Push Up<br/>- Speed Bag<br/>- Barbell Snatch<br/>- Bench Press<br/>- Squat Rack<br/>- Agility Ladder<br/>- Slip Bag<br/><br/>\"It's not about how hard you hit, it's about how hard you can get hit and keep moving forward\"<br/><br/>Embrace your loss, whether it is one loss or many losses, because with the right attitude and a willingness to learn from your mistakes, you are guaranteed a lifetime of success in boxing. Life is tough, so are the fights. You have to keep on grinding!<br/><br/>Key features:<br/>- Satisfying and realistic boxing &amp; workout animations, Your arms can be sore after you use our dumbbell raise station :)<br/>- Easy to use, intuitive controls with smooth mechanics,<br/>- Show the world how much fight you have in your heart by rising above your competition,<br/>- Feel the grit in your character with amazing haptic feedbacks!<br/>- Immerse yourself in the grind with awesome sound effects!<br/>- More than an hour of bangers to listen to while you train!<br/>- Play as different characters, train with them and show your skill.", "metacritic": null, "released": "2021-10-28", "tba": false, "updated": "2021-12-27T03:35:51", "background_image": "https://media.rawg.io/media/screenshots/526/526134cd1f5fca05cb5fc1e122c2ffe3_q8cJ9iC.jpg", "website": "http://dumbbellgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tolga Coskun"], "genres": ["Sports", "Casual"], "publishers": ["Tolga Coskun"], "esrb_rating": "Teen"}