{"id": 714568, "slug": "clash-of-streamers", "name": "Clash of Streamers", "name_original": "Clash of Streamers", "description": "A miraculously massive mix of diverse gameplay elements with zero tutorials and zero loading times. Our revolutionary technology was engineered for unprecedented non-stop fun and combines almost everything you can imagine in one game that you won’t believe until you play it. And with just a tap of a button, you can professionally livestream it while interacting with viewers. <br/><br/>Subscription options<br/>We have the following subscription periods in our game:<br/><br/><br/>1. The Campaign Boost Subscription Group offers 4 tiers of $4.99, $14.99 per month or $39.99, $99.99 a week, which amplifies the Daily Campaign Tower drops.<br/><br/>2. The Community Card Subscription Group offers 4 tiers of $4.99, $14.99 per month or $39.99, $99.99 a week, which provides community &amp; church chips.<br/><br/>3. The Daily Login Bonus Boost Subscription Group offers 4 tiers of $14.99, $39.99, $49.99 or $99.99 a week, which multiplies your daily login rewards.<br/><br/>4. The Daily Prayer Boost Subscription Group offers 4 tiers of $4.99, $14.99 per month or $39.99, $99.99 a week, which gives more chests from prayers.<br/><br/>5. The Gem Mine Boost Subscription Group offers 4 tiers of $0.99, $9.99, $29.99 or $99.99 a week, which increases the output &amp; capacity of the Gem Mine. VIP-1 Trial does not include one-time VIP-1 rewards. <br/><br/>6. The Idle Boss Boost Subscription Group offters 4 tiers of $4.99, $14.99, $39.99 or $99.99 a week, which increase the loot from the Idle Boss. <br/><br/>7. The Instant Benefits Subscription Group offers  4 tiers of $0.99/month, $2.99/3-monthly, $4.99/6-monthly or $9.99/year, which allows players to unlock all Facebook Benefits instantly.<br/><br/>8. The Monthly Card Subscription Group offers 4 tiers of $14.99, $29.99 per month or $49.99, $99.99 a week, which provides gems on a daily basis.<br/><br/>9. The Raid Boost Subscription Group offers 4 tiers of $4.99, $14.99, $39.99 or $99.99 a week, which raises the spoils from defeating streamer bosses.<br/><br/>10. The Daily Quest Boost Subscription Group offers 1 tier of $9.99 a week, which increases the Daily Quest rewards.<br/><br/>End of trial and subscription renewal:<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039 . When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at support@gamingforgood.net<br/><br/>Privacy Policy: https://www.gamingforgood.net/c/privacy<br/>Terms of Service: https://www.gamingforgood.net/c/tos<br/>Terms of Use (EULA): https://www.apple.com/legal/internet-services/itunes/dev/stdeula/", "metacritic": null, "released": "2021-05-08", "tba": false, "updated": "2021-12-27T03:50:09", "background_image": "https://media.rawg.io/media/screenshots/993/9932554ca389949296d385e1dac9cb74.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Naughty Cult"], "genres": ["Adventure", "RPG"], "publishers": ["The Naughty Cult"], "esrb_rating": "Teen"}