{"id": 714686, "slug": "interrupted", "name": "Interrupted", "name_original": "Interrupted", "description": "<p>Interrupted isn't like any other platforming game. Dash around with unique drag and drop controls, bypass the ordinary laws of gravity and explore this magical world full of puzzles just waiting to be solved. </p>\n<p>My goal was to make as accessible game as possible so that everyone can enjoy it.  It all began with controls. The controls needed to be intuitive, and most importantly fun. I love platforming games for their challenging levels, and I wanted to explore beyond the usual arrow controls. While I love pixel art or geometric super simple look of games, I understand that it's not for everybody. The challenge here was to create sort of a fairytale style, and very atmospheric. To simply create a world that would be mysterious and joy to explore. </p>\n<p>Keep in mind that as for now, this is just a preview focused on gameplay and with a few bugs. I might add the story elements in the future, but it depends on feedback. That's why I would love if you told me what you think about the game. What's good? What's bad? Should I continue in this direction with level design or art? Or perhaps go for something completely new and abandon this project. I will gladly read every feedback and take it to heart. </p>\n<p><strong>For the best experience is recommended the downloadable version. </strong></p>\n<p><strong>If you get stuck, at any time hit R for restart of the level. </strong></p>", "metacritic": null, "released": "2021-12-26", "tba": false, "updated": "2021-12-27T04:27:35", "background_image": "https://media.rawg.io/media/screenshots/e33/e33ea756089918baeb5bdae38d2cf92e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["EdenSoft"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}