{"id": 714851, "slug": "my-little-universe-itch", "name": "My Little Universe (itch)", "name_original": "My Little Universe (itch)", "description": "<p>Get lost in your own little universe 👨‍🚀<br/><br/>Creating a world isn’t easy, but it’s certainly a whole load of fun, as you’ll find out in this exciting casual worldbuilding adventure game. It takes ⛏️ mining, crafting, logging, digging, smelting, construction and a little gardening to make the perfect planet, and you’ll have to do all that while fighting off primeval monsters 🐙 intent on bringing an end to your divine plan. <br/><br/><em>Armed with just a pickaxe and the almighty strength of your arms, get down to doing a god’s work and build a world of wonder in this addictive, original action game that will keep you creating for way more than seven days.<br/><br/><strong>YOU’VE GOT THE WHOLE WORLD IN YOUR HANDS!</strong> 🪐<br/><br/>🚀 In the beginning there was a little orange man in a rocket ship, and in the end there’ll be a whole glorious planet built with just those tiny orange hands. Get mining, amass 15 different types of resources and spend them with infinite wisdom to create a beautiful planetary paradise that can bask in your divine benevolence.<br/><br/>🚀 Thor has his hammer, Neptune has his trident, and in this game you have a mighty pickaxe that’s just as adept at fighting off monsters as it is at breaking rocks, digging for minerals and mining for gold. Upgrade it through eight different levels to improve your divine productivity, and harvest even more resources to keep on building.<br/><br/>🚀 As civilization develops under your watchful eye, you’ll have the chance to set up industrial facilities to smelt metal, process minerals and make a further eight types of weapon that will help you in your divine crafts, including an ax with eight different levels of improvement and the unique Excalibur sword to strike the fear of god into your monstrous opponents.<br/><br/>🚀 Expand and diversify with 10 different types of in-game environment to build, explore and exploit as you move in mysterious ways to create your true planetary paradise. But watch out for monsters – 8 kinds of enemy including abominable snowmen, unfriendly ents, and alien fungal foes are all out to stop your godly intentions.<br/><br/>🚀 Simple but attractive graphics and a rich soundscape add to the appeal of this simple but absorbing genre-crossing mining game where you write your own creation myth.<br/><br/><strong>IN ACTION HOW LIKE AN ANGEL, IN APPREHENSION HOW LIKE A GOD! </strong>☄️<br/>Have you of late lost all your mirth? Well, you’ll find mirth aplenty, along with hours of action and adventure, in My Little Universe. Take a sterile promontory and turn it into a beautiful, blooming planet that would make any god proud to be its master. Dig, chop, craft, smash, mine and fight your way to divine grace and a little universe all of your own. <br/><br/>Download My Little Universe now and get down to a god’s work!</em></p>", "metacritic": null, "released": "2021-12-26", "tba": false, "updated": "2021-12-27T05:05:25", "background_image": "https://media.rawg.io/media/screenshots/8d8/8d8a5bca88850d4dfa43d8f8d6b58613.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["JustSomeoneDon'tWorry(:"], "genres": [], "publishers": [], "esrb_rating": null}