{"id": 71483, "slug": "mini-golf-king-multiplayer", "name": "Mini Golf King - Multiplayer", "name_original": "Mini Golf King - Multiplayer", "description": "Join the most exciting multiplayer Golf ever! Challenge players all over the world!<br/>Not just golf. This is action-packed Mini Golf with full of adventures and thrills you've never experienced before!<br/><br/>Play on gorgeous courses against golfers around the globe in real-time online matches! Win and collect trophies to unlock top stages. Discover and upgrade golf clubs, balls and gloves to customize your gameplay. Take on the weekly leaderboard and tournament to win awesome prizes and glory. Do amazing trickshots in Hole in One Challenge and Tour Challenge. You can also play together with your Facebook friends!<br/><br/>Firing your shot is easier than ever. Just drag and release to hit the ball like playing pool! Aim and shoot carefully to collect the most gems while taking the fastest route to the hole. You can even clash your ball against your rival's to take out their gems! Arcade Mini Golf has never been this quick and fun!<br/><br/>Putt your way through wonders. Golfers' wildest dreams finally come true! Let's ride tube slides, swing on drawbridges, jump over pyramids, explore mazes with bomb traps, and reach farther and fly higher with accelerators and jump pads! Taking advantage of all the tricks while honing your skills is the key to victory!<br/><br/>So if you want to relax with a nice PvP game which is easy to pick up, instantly addicting and hard to master, this will be the best game for you. Start your epic tour in the quest to be the next Mini Golf King!<br/><br/>&gt;&gt; Download Mini Golf King - Multiplayer for FREE now! &lt;&lt;<br/><br/>KEY FEATURES<br/> - Exciting Mini Golf duel in real-time online multiplayer.<br/> - Simple and intuitive control: Swipe and release to strike!<br/> - Compete against players from all around the world to take their coins and trophies!<br/> - Play on 35+ beautiful golf courses with tons of dynamic tricks and fun.<br/> - Unlock chests to discover powerful new golf equipment and upgrade existing ones: drivers, irons, sand wedges, putters, balls and gloves!<br/> - Progress through more advanced stages all the way to the top.<br/> - Get promoted in the weekly leagues to win chests and card bonus.<br/> - Conquer three tournament rounds, take mega prizes and be the golf champion!<br/> - Sink every putt and get special rewards in Hole-in-One Challenge!<br/> - Travel through 50+ holes and earn stars for special rewards in Tour Challenge!<br/> - Connect with Facebook to send and request free gifts!<br/> - Play online matches with your family and friends!<br/><br/>* \"Like\" Mini Golf King on Facebook for updates and news! <br/>https://www.facebook.com/theMiniGolfKing/<br/><br/>* Mini Golf King is GDPR compliant.<br/><br/>* You need an internet connection to play this game.", "metacritic": null, "released": "2017-12-06", "tba": false, "updated": "2019-07-29T19:09:13", "background_image": "https://media.rawg.io/media/screenshots/c6b/c6b0259483a360fd6a0847069471cd11.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bluehole PNIX", "PNIX"], "genres": ["Action", "Sports"], "publishers": ["Bluehole PNIX", "PNIX"], "esrb_rating": "Everyone 10+"}