{"id": 715099, "slug": "deep-hortondevchris", "name": "Deep (hortondev.chris)", "name_original": "Deep (hortondev.chris)", "description": "<p>Deep is an endless digging game where you compete against yourself and others. I made it for my dad for Christmas in about a week. The music is O.R.B. by Arthur Tessier.</p>\n<p>Controls:</p>\n<p>ASD or arrow keys to move<br/>[E] for the shop<br/>[R] to quick restart<br/>[M] to mute the music</p>\n<p>All in game tips:</p>\n<p>\"Powerups bought in the shop only last for one round.\"<br/>\"Stone costs two oil to dig through while dirt only costs one.\"<br/>\"Fossils fill your tank to its limit!\"<br/>\"Without powerups, you lose 40% of your gold after every round.\"<br/>\"Press [R] in the death screen to restart quickly.\"<br/>\"Press [M] to toggle the music.\"<br/>\"TNT can blow up adjacent TNT.\"<br/>\"When TNT explodes, it will destroy oil, however, you keep the gold from the blast.\"  \"Visit hortondev.com for more games like this!\"<br/>\"It costs a little bit to reroll for powerups.\"<br/>\"The Cheetah Drill makes you move 50% faster!\"<br/>\"The Bigger Tank allows the drill to hold up to 20 fuel at once!\"<br/>\"The Oil Spill increases the spawn rate of oil.\"<br/>\"Gold Rush increases the spawn rate of gold.\"<br/>\"The Pulverizer makes it so that stone only costs one oil to dig through.\"<br/>\"Boom Town increases the spawn rate of TNT!\"<br/>\"Plunderer doubles the gold found in chests!\"<br/>\"The Vault allows you to keep 100% of the gold earned from that round.\"<br/>\"Erosion lowers the spawn rate of stone.\"<br/>\"Black Gold makes gold give back fuel!\"</p>", "metacritic": null, "released": "2021-12-25", "tba": false, "updated": "2021-12-27T06:05:33", "background_image": "https://media.rawg.io/media/screenshots/641/6419db14757db0d3a9df45c8bb44e0e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hortondev.chris"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}