{"id": 715146, "slug": "penguin-witch", "name": "Penguin Witch", "name_original": "Penguin Witch", "description": "<p><strong>How to play:</strong></p><p><strong>controls: WASD to move, and 'e' to interact<br/></strong></p><p><strong>Objective:<br/></strong>Your goal is to make potions for the customers (at the top )as they request them. You make potions by picking up ingredients and placing them in a cauldron to brew and then bring the potions to the customers. <br/></p><p><strong>How to make a potion<br/></strong></p><p>Bring ingredients to a cauldron and then an empty potion bottle to begin the brewing process. Potions take on the color of their ingredients (up to 2). e.g. to make green potion, place both a banana and a blueberry in a cauldron and then bring an empty potion bottle. The orange potion can be made either using a blueberry and a strawberry or by using a persimmon (n.b. nothing can be combined with a persimmon). <br/></p><p><strong>Cutting boards:</strong><br/></p><p>There are cutting boards which allow you to cut up an ingredient before adding it to the cauldron. Doing so will make the final potion worth more points. When potions are brought to the customer who requested them, you earn 100 points, 125 points if the potion has two cut up ingredients, or 150 if it has two cut up ingredients.</p><p><strong>Bottomless pits:<br/></strong></p><p>A penguin witch never makes a mistake, so of course they meant to make 3 yellow potions when all the customers are asking for blue. If the cast they you pick up any object and have no place to put it, throw it into one of the two bottomless pits on either side at the bottom.</p><p><strong>Losing:<br/></strong></p><p>Penguins are notoriously rude to employees (the first Karen was a penguin), so if they are not served in time, they <em>will </em>close down your potion shop. If the patience bar next to a customer drains then the game will end. As the game goes on and the reputation of your store increases, customers will have less and less patience so you will need to work fast!<br/></p><p><strong>Other:</strong></p><p>Let me know if you run into any problems getting the game to run or find any bugs. If the UI looks a bit funking, I'm sorry, the unity UI system can be a bit finicky and I clearly have not figured it out...<br/></p>", "metacritic": null, "released": "2021-12-25", "tba": false, "updated": "2021-12-27T06:17:29", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hegbert"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}