{"id": 715191, "slug": "cyber-sheep-demo", "name": "Cyber Sheep demo", "name_original": "Cyber Sheep demo", "description": "<p>Cyber Sheep is a game about three characters traveling in and out of a transforming labyrinth to figure out who or what this threat is. It is an action/platform similar to Megaman Zero and the ZX series. With different modules that upgrade the character in different, and sometimes unique ways, explore different areas.</p>\n<p>Currently, the game is in an early state. All three characters are playable, but the first area has no end and is set on a loop. The shops, controls, and adventure itself all work, however. I am mostly uploading this for feedback and bugs that may happen.</p>\r\nCurrent Features\r\n<ul><li>Fast pace, action heavy gameplay similar to Megaman Zero.</li><li>Three playable characters; Ophelia, Cythia and Shadow.</li><li>Weapon fusion system where certain weapons can be combined.</li><li>A roguelite with heavy emphasis on story. (Currently no abrupt level ending with no boss)</li></ul>\r\nControls\r\n<ul><li>A - Jump/Confirm</li><li>S - Attack/Cancel</li><li>D - Item</li><li>E/R - Change menus/Selected weapon</li><li>Q - Dash/Special</li><li>M - map</li><li>Controls can be changed in the pause menu.(As I know my controls aren't optimized for all)</li></ul>\n<p>I want to continue updating the game as well as a couple others I work on to not get burned out on one thing. So if you'd like, follow me at @TheYawningFox to hear about my progress!</p>\n<p>All kinds of feedback and reports are appreciated. <br/></p>", "metacritic": null, "released": "2021-12-25", "tba": false, "updated": "2021-12-27T06:27:55", "background_image": "https://media.rawg.io/media/screenshots/01d/01d2ac4ce3d6e2efdfc0fde7a8eefe3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yawning Fox"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}