{"id": 715386, "slug": "nawpaqiwasi", "name": "ÑawpaqiWasi", "name_original": "ÑawpaqiWasi", "description": "<p>El impacto de los videojuegos en la sociedad hoy en día es tan importante que cada vez más seguido los desarrolladores se están orientando por esta idea. El Perú es una fuente de creación inagotable, tanto escritores, pintores, fotógrafos y cineastas se han rendido sucesivamente a la rica historia de este país; y los desarrolladores de juegos no es una excepción.</p>\n<p>Ñawpaqi Wasi nace de la idea de hacer conocer más nuestra historia y cultura por medio de videojuegos. Inicialmente se espera tener algunos juegos preliminares, y poco a poco ir teniendo mejor visión para poder añadir más. La escalabilidad de este juego es un detalle importante, pues no solo se va a tratar de jugar 1 o 2 minijuegos, sino que mientras se implementen más de estos se mostrarán también más funcionalidades, como niveles, dificultad, etc.</p>\n<p>El público objetivo va desde niños que logren comprender la realidad, hasta adultos mayores que deseen conocer más de su cultura. La interactividad de aprender mediante juegos es una idea que se viene desarrollando estas últimas décadas, pues los libros ya están quedando un poco desfasados.</p><p>Autores: </p><ul><li>MIRANDA CALLO EDSON PEDRO      \r\n</li><li>PANOCCA MERMA JHON FRANKLIN\r\n</li><li>SHIRLEY CHAMBI CHAYÑA \r\n</li><li>EVELYN ELIZABETH HUANCA MAQUERA\r\n</li><li>CRISTIAN ROMEL FLORES CONDE\r\n</li><li>ANAMPA CHURA DIEGO DAVID</li></ul><p>Link Zenodo: https://zenodo.org/record/5803161#.YcYXDmhKhPZ</p>", "metacritic": null, "released": "2021-12-24", "tba": false, "updated": "2021-12-27T07:15:57", "background_image": "https://media.rawg.io/media/screenshots/4f4/4f485721c55762d135341c49bd0b71dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Edson92"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}