{"id": 715412, "slug": "ecocity", "name": "ecoCITY", "name_original": "ecoCITY", "description": "<p>ecoCITY is a demo for a city builder that uses Augmented Reality (AR). It is based on a sustainable city.</p>\n<p>The game starts with a CITY HALL on the middle slot, which provides INS and ecoINS. INS are used to build new structures, while ecoINS are used to increase the ecoLOGY.<br/>When a new building is placed, you will get the option to upgrade it and increase its sustainability. Non-sustainable buildings provide INS and affect the ecoNOMY positively, but they also decrease the ecoLOGY. However, after being upgraded, they will also provide ecoINS and have a positive effect on the ecoLOGY.<br/>For the moment, the game has no end state, but the main goal is to balance the ecoNOMY and ecoLOGY in order to maximize the ecoMFORT.</p>\n<p>There are also two extensions for the city: the SOLAR PARK and WIND PARK. These extensions currently have no effect on the game, as they are only used to showcase the AR and different types of cards.</p>\n<p><strong>Tip:</strong> Since the game requires the use of AR, three cards (which are found in the ZIP file) are needed to play. We recommend using another phone to display the cards, so as not to print them and waste resources.</p>\n\n<p>This game was made for a university project in a span of two weeks. The entirety of the game was designed, but only a small demo had to be implemented.</p>\n<p><strong>TEAM:</strong>\n</p>\n<p>- Ícar Calvet Montoya</p>\n<p>- Oriol Viu Duran\r\n</p>\n\n<p><strong>ONLY PLAYABLE ON ANDROID</strong></p>", "metacritic": null, "released": "2021-12-24", "tba": false, "updated": "2021-12-27T07:21:57", "background_image": "https://media.rawg.io/media/screenshots/081/081b65c80cb074da5650c7d54059275b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["IROnia", "North Oriole Games", "iczzzzz"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}