{"id": 71548, "slug": "face-talk-hd", "name": "Face Talk HD", "name_original": "Face Talk HD", "description": "!! NOW WITH MORE ADVANCED MOUTH DETECTION !! <br/><br/>Let your photos come to life with Face Talk! Make your friends and family say anything you want! It's so easy...<br/><br/>Load a Photo ➙ Mark the Mouth ➙ Talk!<br/><br/>Face Talk also lets you record a video of your talking photo. (See list below for video compatible devices) Videos can be saved to the photo library, emailed to friends and family, or posted directly to Facebook and Twitter feeds!<br/><br/>Load a photo or take a new one directly from within the app. Face Talk uses your devices microphone to record your voice.  Face Talk also features a Playback mode to quickly and easily re-watch your videos and share with friends.<br/><br/>Face Talk is a great way to imitate a friend, mock your boss, put words in your spouse’s mouth, or make your pets talk \"I Ruff Roo\". There's so many ways to have fun with Face Talk!<br/><br/>Usage Tips &amp; Tricks:<br/>- Face Talk works best in a quiet area. In loud spaces your devices mic may have trouble differentiating your voice from background noise.<br/>- Larger full front facing photos work best. The smaller the mouth the harder it is to detect.<br/>- Use an iPad held in front of your face for a little extra realism when imitating your friends and family.<br/>- Turn on \"Show Teeth\" in the options menu to add a little more realism to your talking creations.<br/>- Use the Microphone Sensitivity slider to adjust the mouth movement depending on how loud you speak.<br/>- You may have limited recording time due to the memory limits of each device. Face Talk will detect if you are running low on memory and will end your recording session if it detects low memory.<br/><br/>Video recording compatible with:<br/>- iPad, iPad 2<br/>- iPhone 3GS and iPhone 4<br/>- iPod Touch 4th Gen and newer", "metacritic": null, "released": "2011-08-11", "tba": false, "updated": "2019-10-22T14:26:29", "background_image": "https://media.rawg.io/media/screenshots/07c/07c6f054a7a062514477d27f4b0bd4c6.jpg", "website": "http://www.facetalkiphone.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brandon Abbott"], "genres": ["Family"], "publishers": ["Brandon Abbott"], "esrb_rating": "Everyone 10+"}