{"id": 715599, "slug": "vr-new-york-story-settle-in-new-york", "name": "VR New York Story, Settle in New York", "name_original": "VR New York Story, Settle in New York", "description": "VR New York Story's second edition, \"Settle in New York\" is now released!<br/>\r\nConsisting of 120 episodes including various situations, this is a total package for you to advance your English speaking skills!<br/>\n<br/>\n<br/>\r\nAre you hesitating to go study abroad because you have a tight budget?<br/>\r\n→Experience studying in New York virtually for a cheaper price! You will learn how to speak 3800 different expressions in English as well as enjoying on-the-spot experiences in 50 different locations in New York.<br/>\n<br/>\r\nAre you still hanging out with friends who speak the same language, while studying overseas?<br/>\r\n→Communicate with 32 different foreign 3D characters like Sam and Barbara and become real friends!<br/>\n<br/>\r\nAre you too nervous to speak when you bump into foreigners, worrying that you will make a mistake?<br/>\r\n→Don’t be afraid! Practice and enjoy daily life conversations with various characters and gain confidence!<br/>\n<br/>\r\nAre you stuck at home wanting to travel to New York?<br/>\r\n→You only need a VR headset and once you make a one-time purchase of \"VR New York Story, Settle in New York\", we're all set. Off to New York!<br/>\n<br/>\r\nAre you looking for jobs abroad but worried about what to say during your interview or in real life business situations?<br/>\r\n→VR New York Story, Settle in New York will get you ready for all sorts of circumstances that could happen when you live abroad, through 120 episodes.<br/>\n<br/>\n<br/>\r\nMain Episodes<br/>\n<br/>\r\n⊙Going through job interviews for a part-time job<br/>\r\n⊙Getting a salary raise offer<br/>\r\n⊙Going to the dentist<br/>\r\n⊙Renting a car for vacation<br/>\r\n⊙Working part-time at a fashion store<br/>\r\n⊙Getting a loan counseling from the bank<br/>\r\n⊙Restoring a relationship with your x-boyfriend<br/>\n<br/>\r\nDive right into VR New York Story, Settle in New York to check-out more episodes including traveling, daily life, life at work, having a relationship and more!<br/>\n<br/>\n<br/>\r\nKey Features<br/>\n<br/>\r\n⊙Communicate with 32 different 3D characters using \"Voice Recognition\" technology!<br/>\r\n⊙Feel as if you were in New York with an artificially built, but a realistic-looking environment based on \"high quality VR technology\"!<br/>\r\n⊙Interact actively with characters through an Emotion meter that shows you how the characters feel about this conversation!<br/>\r\n⊙Check for correct pronunciation, intonation, grammar, and fluency in total through our evaluation system!<br/>\r\n⊙Learn background knowledge as well as English speaking with this well-organized challenge system!", "metacritic": null, "released": "2021-12-27", "tba": false, "updated": "2021-12-31T03:05:39", "background_image": "https://media.rawg.io/media/screenshots/1ed/1ede43cdb5246908d7f47b4ef77acc54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aiitone"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Aiitone"], "esrb_rating": null}