{"id": 715627, "slug": "zhi-tu-bu-mie-de-yong-zhe", "name": "只兔：不灭的勇者", "name_original": "只兔：不灭的勇者", "description": "<strong>*Introduction</strong><br/>TOOK lost his memory,  face this world again with your weapon!<br/><br/><strong>*story background</strong><br/>The creatures in the moon cave have never seen the moon but are obsessed with the moon.<br/>In order to find the moon, People have divided into two group of thinking that the moon is in the sky and thinking that the moon is at the bottom.<br/>As the six knights of the Moon Up Group , TOOK will save the dying  Moon Up Group for the oath of the past.<br/><br/><strong>*Game Features</strong><br/>- Hardcore battle -<br/>Judge the enemy's actions to dodge, block and attack is the core of the game.<br/>The protagonist will challenge powerful and complex enemies with a fragile body and simple moves!<br/>Of course, you can skip class through various props…<br/>（Thanks to our program and art, DoudouMengmengRabbit.）<br/><br/>- Rich gameplay -<br/>There are a large number of items with different uses for players to collect in the game, and they may appear in any corner of the moon cave world.<br/>At the same time, there are messy surrounding games such as fishing, crab fighting, achievements, mines, stocks, etc., which can relieve the tension in the hardcore battle.<br/>（Thanks to our planning and art, DoudouMengmengRabbit）<br/><br/>- Good plot - （but no in english）<br/>As the game progresses, the memory of Tu Ke slowly recovers, learn about the past of Tu Ke and the other six knights, and slowly unravel the truth of the Moon Cave world...<br/>Expressed in the form of simple cartoons and character dialogues, simple but not simple.<br/>（Thanks to our editor and artist, DoudouMengmengRabbit.）<br/><br/><strong>*picture</strong><br/><br/><br/>-this is a hard game.<br/><br/><br/>-level up for face enemy powerful.<br/><br/><br/><br/>-visit different city and people.<br/><br/><br/>-and more.<br/><br/><br/>*This game was developed independently by DoudouMengmengRabbit, and it took 1 year to complete the development.<br/>*All the art materials you can see in this game are drawn by DoudouMengmengRabbit, using the pixel drawing software -aseprite-, which took 2500+ hours to complete the drawing independently.<br/>*The bgm in this game is carefully selected on a number of copyright-free background music material sites by DoudouMengmengRabbit.<br/><br/><strong>希望你喜欢这个游戏</strong><br/><strong>hope u enioy this game &lt;3</strong>", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2021-12-31T03:22:29", "background_image": "https://media.rawg.io/media/screenshots/282/2822a9c5e787e186c36af9c561747c44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["豆豆萌萌兔"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["豆豆萌萌兔"], "esrb_rating": null}