{"id": 715602, "slug": "g-modeakaibusu-dan-mu-jian-ding-si-yan-da-wang-she", "name": "G-MODEアーカイブス+ 弾幕検定死験-大往生編", "name_original": "G-MODEアーカイブス+ 弾幕検定死験-大往生編", "description": "It's time for the death test, bullet believers.<br/>Prove your strength in the face of an ever-growing opponent.<br/><br/>When it comes to CAVE's shooting games, the best way to describe them is \"bullets\".<br/>But how good are you at it? Here at last is a title that answers that question.<br/><br/>This game, \"Danmakukenteishiken\" is a shooting game that allows you to diagnose your ability to deal with a barrage of bullets by continuing to fight against opponents who get stronger with each defeat.<br/>This is a shooting game that diagnoses your ability to deal with a barrage of bullets.<br/>In this game, named \"DaiOuJou-hen\", the vicious bosses from \"DoDonPachi DaiOuJou\" will block your challenge.<br/><br/>In addition to the in-game evaluation of your rank, this game also supports online ranking.<br/>So you can further improve your skills by competing with users from around the world.<br/>Those who are not afraid of death, aim for the top of the barrage.<br/><br/>■ About G-MODE Archives<br/>The G-MODE Archives is a reissue project that faithfully recreates old feature phone games as they were back then.<br/><br/>In order to enjoy the app as it was back then, the web-connected menu, buttons, and keys have been transplanted, but some of them may not work.<br/>For more information on the Steam version, press START button and see the \"How to play\" in the OPTION menu.", "metacritic": null, "released": null, "tba": false, "updated": "2021-12-31T03:07:24", "background_image": "https://media.rawg.io/media/screenshots/717/71769ea5a6d6a15d8fe222fadd47f846.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["G-mode"], "genres": ["Action"], "publishers": ["G-Mode"], "esrb_rating": null}