{"id": 715789, "slug": "greedy-gourds", "name": "Greedy Gourds", "name_original": "Greedy Gourds", "description": "<p>This game was made for the 2021 Spoopy Game Jam on GameJolt and was originally uploaded to GameJolt too (the task was to make a cute + spooky or Spoopy multiplayer game!) How is it? Leave your feedback in the comments! What's YOUR highest amount of coins collect?</p>\n<p>Help the Gourmpkies collect a large sum of wealth by igniting enemies and collecting coins that drop from them!</p>\n<p>How to play\r\n</p>\n<p><strong>PLAYER 1:</strong> When playing alone, you can use the left and right arrow keys or the A and D keys to move, use the up arrow key or the W key to jump, and use the down arrow key or S key to shoot fire (or pumpkin seeds while in mid-air). When playing with a friend you can only use the arrow key options because...\r\n</p>\n<p><strong>PLAYER 2:</strong> You use the <strong>WASD</strong> keys to do the corresponding actions!\r\n</p>\n<p>Tip\r\n</p>\n<p>IF THE GAME IS TOO SMALL USE YOUR BROWSERS' BUILT IN ZOOM! (Ctrl + and - to zoom in and out for most browsers).\r\n</p>\n<p>More Tips\r\n</p>\n<p>To kill airborne enemies your use your fireballs, for land enemies or even low flying ones you use your pumpkin seeds, when enemies get killed they drop bouncing coins that your want to collect! Some enemies can deflected your fireballs so be careful (and when the fireballs reach the top of the screen they'll fall back down red and dangerous!)\r\n</p>\n<p>When playing 2 player mode you can compete, or help each other to collect coinage, if a player dies in 2 player mode some enemies get frightened/excited at the newly appeared ghost that the dead player can control! Ghosts can only move up and down and collect coins, to revive yourself you have to touch a Zourmbi (the green Zombie Gourmpkies that are the only purely land based foe).</p>", "metacritic": null, "released": "2021-12-30", "tba": false, "updated": "2021-12-31T04:12:32", "background_image": "https://media.rawg.io/media/screenshots/b65/b6542af46bad6888577ca6be5c9759d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Deepysingh800 Games"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}