{"id": 71586, "slug": "american-truck-simulator-2018", "name": "American Truck Simulator 2018", "name_original": "American Truck Simulator 2018", "description": "Travel across a vast open dynamic island with breathtaking landscapes and beautiful landmarks with our American Truck Simulator 2018. It includes realistic physics simulation and dozens of exciting job quests to keep you on the edge of the driving seat.<br/>Test of endurance, driving skill and speed to keep you engaged with a soothing and relaxing driving experience is what you will get when you play American Truck Simulator 2018.<br/><br/>Sit into a heavy loader, and show them who is the boss of the streets. Moreover, check out what is in the garage! New Jobs awaits you in our American Truck Simulator 2018 game.<br/><br/>Unleash your inner drive for mayhem with our crazy American Truck Simulator! Each one is packed with all the classic driving action you can expect, and even some twists to boot. <br/><br/>Drive that  pick up loaded with goods to be delivered on uneven road. You may change your camera angle for better visuals on the whole area. Your only mission is to get all your cargo safe and sound to your destination.<br/><br/>Some cargo needs to be delivered to customers and there is no driver available. Do you have what it takes to step in and take on the responsibility?  American Truck Simulator 2018 is a 3D truck driving simulation game, in which you drive powerful trucks on difficult road tracks. <br/><br/>Are you a fan of listening to music while driving huge trucks? Custom Radio Station with 24x7 Country Music is available while driving your trucks. How cool is that!<br/><br/>This American Truck Simulator 2018 is all set  for experiencing an real driving during the day and night. Download now our new American Truck Simulator 2018 and show your skills with loaded truck driving and have fun all the way. <br/><br/>Sit in an awesome Truck steering, fasten your seat belt and get ready for the sensational journey being a real driver. In this American Truck Simulator you will have to hero of an  American cargo truck to carry  goods through the steep paths of mountains. So, be an excellent driver in hilly environment and deliver all your goods in estimated time. <br/><br/>This American Truck game Simulator 2018 will surely test your  driving skills when you have to drive jumbo truck with heavy cargo. Our game features a true Day and Night cycle.<br/><br/>Are you ready to become the best driver in the America? This is the game for you! Deliver your goods as fast as possible and put all your skills to test to keep it safe!<br/><br/>Keep track of the roads via Mini-map in order to always deliver your cargo on time.<br/><br/>If you are a American Truck enthusiast then this game is for you.<br/>Enjoy this 3D cargo American Truck Simulator 2018  and handle the heavy duty loads you are transporting carefully.<br/><br/>***** American Truck Simulator 2018  Features *****<br/><br/>1.\tRealistic Truck Simulation<br/>2.\t40 Unique Trucks to Drive<br/>3.\tBreathtaking Landscape<br/>4.\tBeautiful Landmarks<br/>5.\tFull Open World Island to Explore<br/>6.\tCustom Radio Station with 24x7 Country Music<br/>7.\tExciting Job Quests<br/>8.\tDay and Night Cycle <br/><br/>Please take your time to rate your experience with our game, American Truck Simulator 2018 and also write a short review.<br/><br/>We will be grateful to hear your opinions and improve - whenever needed - in future versions.<br/><br/>Have a nice time playing  American Truck Simulator 2018!", "metacritic": null, "released": "2017-12-29", "tba": false, "updated": "2019-07-30T06:01:01", "background_image": "https://media.rawg.io/media/screenshots/4e7/4e7391730905d3cd8e86ce5d3b847085.jpg", "website": "http://www.ironjawstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Ironjaw Studios"], "genres": ["Adventure", "Simulation"], "publishers": ["Ironjaw Studios Private"], "esrb_rating": null}