{"id": 71587, "slug": "ocean-legend", "name": "Ocean Legend", "name_original": "Ocean Legend", "description": "Ocean Legend is a realistic ocean navigation adventure MMORPG mobile game set during the \"\"Age of Discovery\"\" in the 15th century. During this age, many sailors and pirates driven by the dream of fame and glory set sail to explore the unknown world beyond the vast oceans. <br/><br/>“Realistic Ocean Navigation”<br/>Detailed weather conditions and time systems provide a highly immersive ocean navigation experience. Choose from multiple ship types: battleships, commercial ships used for trade, or ships used especially for exploration and adventure.<br/><br/>“15th Century Naval Warfare”<br/>Choose from multiple combat options: challenge pirates with your teammates or duel with other captains, the choice is yours! But remember - your cannon can only shoot to the right or the left, this is the 15th century after all!<br/><br/>“Try Your Hand At Trading”<br/>Buy low and sell high to maximize your profit.  Buy some cheese, buy some salt, and don't forget that West African gold. Be fast and smart with your decisions - prices are changing by the minute! <br/><br/>“Select From Endless Choices”                                           <br/>Mix and match from four characters and five countries. Want to be an artillerist in England or a fortune teller in France? The possibilities are endless!<br/><br/>Official website:   https://molen.oasgames.com/<br/>Facebook home page:  https://www.facebook.com/OceanLegendEn/<br/>Customer service email:  molen@oasgames.com", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:04:37", "background_image": "https://media.rawg.io/media/screenshots/2a8/2a81fed941c6ebee999cd364d20dd403.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 552, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oasis Games"], "genres": ["Adventure", "RPG"], "publishers": ["Oasis Games"], "esrb_rating": null}