{"id": 715872, "slug": "alpha-carnaval-del-sol", "name": "Alpha | Carnaval del Sol", "name_original": "Alpha | Carnaval del Sol", "description": "¡La fiesta mas grande de todo el sistema solar!\r\n<p>¡Busca a tu campeón favorito y disfruta el gran carnaval! <br/><br/>\"Carnaval del Sol\" es un juego de cartas y estrategia simple con muchos personajes. Enfrenta en un combate de 1vs1 hasta 3 campeones con estilos de juegos distintos en un modo de juego innovador con turnos simultáneos. </p>\r\nCampeones\r\n<p>El juego actualmente cuenta con campeones distintos. Cada uno viene de un planeta diferente y tiene su propio estilo de juego. Defiéndelo acompañándolo con cartas y crea combinaciones para eliminar al campeón rival. </p>\r\nCartas\r\n<p>Cada carta está ligada a un campeón distinto y puedes colocarlas durante la interacción. Cada una tendrá su propia habilidad especial y modificará la partida a su manera. Es mucho mas probable que obtengas una carta si usas el campeón a la que está ligada. </p>\r\n¡Actúa y luego observa!\r\n<p>El juego va rotando entre dos turnos, <strong>interacción </strong>y <strong>simulación</strong>. Mientras el juego se congela en la interacción, puedes colocar tus cartas y planear estrategias, mientras que en simulación, la fiesta continúa y las tropas comienzan a atacar ¡Solo durante la interacción puedes actuar en la partida, y no tienes mucho tiempo!</p>\r\nPlanetas\r\n<p>El juego cuenta con planetas distintos que giran en el sistema solar. Cada planeta cuenta con un héroe y un conjunto de cartas, todas con un estilo de juego similar entre sí. </p>\n<ul><li><strong>Planeta Bestial:</strong><br/>Bestias agresivas y que vienen en gran cantidad. Se potencian entre si y aplican efectos al recibir daño. </li><li><strong>Planeta Celestial: </strong><br/>Ángeles amorosos y curativos, generan energía y colocan cartas poderosas a las que protegerán.</li><li><strong>Planeta Mortífero:</strong><br/>Asesinos letales que generan grandes daños y atacan a múltiples enemigos a la vez, ninguna tropa débil podrá vencerles. </li></ul>\r\nPróximamente\r\n<p>El juego seguirá creciendo en los próximos meses y ya tenemos objetivos claros de a lo que quiere llegar. </p>\n<p><strong>- Multijugador</strong><br/>Actualmente el juego solo tiene modo un solo jugador, pero su objetivo es volverse un juego online donde enfrentaras a otros jugadores a tiempo real. </p>\n<p><strong>- Progreso<br/></strong>El juego contará con un sistema de desbloquear y mejorar cartas y campeones. Junto a esto, se podrán crear mazos de pelea personalizados las cartas que el jugador tenga. </p>\n<p><strong>- Contenido<br/></strong>El juego contará con el doble de planetas y muchas mas cartas de las ya existentes. Ya tenemos hechas gran parte de estas y se irán añadiendo al juego progresivamente. </p>\n<p><strong>- Mejorar arte<br/></strong>Parte del arte del juego está incompleto y mejoraremos constantemente este para que se adecúe mucho mas al mundo donde ocurre el juego y hacerlo mucho mas agradable para el jugador. </p>", "metacritic": null, "released": "2021-12-30", "tba": false, "updated": "2021-12-31T04:29:15", "background_image": "https://media.rawg.io/media/screenshots/32c/32c3e3bc7073e1082225fb21a0b6df18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PeryLoth", "Limon Salmon", "Perspective"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}