{"id": 71590, "slug": "league-of-light-dark-omen-hd-a-hidden-object-adven", "name": "League of Light: Dark Omen HD - A Hidden Object Adventure", "name_original": "League of Light: Dark Omen HD - A Hidden Object Adventure", "description": "You've been asked to join the mysterious League of Light, a secret group dedicated to fighting dark forces. <br/><br/>• INVESTIGATE A MONSTROUS BEAST! <br/>It is terrorizing the mountain village of Sorrow's Well and is your first mission as the new member of the League of Light.<br/><br/>• IS THIS BEAST REAL? <br/>Who's behind it? What's really going on in the Dark Lord's castle on the hill? <br/><br/>• EXPLORE A DARK LORD'S CASTLE <br/>No one ever said being in the League would be easy! Face supernatural beasts while you solve this mystery! <br/><br/>• UNLOCK THIS COLLECTOR'S EDITION FOR GREAT BONUSES! <br/>Play the bonus chapter featuring the kingdom of the dwarves and download the wallpapers and concept art for this incredible Hidden Object Puzzle Adventure.<br/> <br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME! <br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2014-02-20", "tba": false, "updated": "2019-07-29T10:55:59", "background_image": "https://media.rawg.io/media/screenshots/50c/50cfa95560f2acdce8e454b8112719d3.jpg", "website": "http://www.bigfishgames.com/mobile-games/iphone-ipod-ipad-games.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}