{"id": 71591, "slug": "rodeo-kid-hd", "name": "Rodeo Kid HD", "name_original": "Rodeo Kid HD", "description": "★★★New Infinity Mode! Endless Ropes to Practice Your Skills★★★<br/>★★★Earn Ropes the Fun Way in the New Slots Mode★★★<br/><br/>In the Wild West, you are the Rodeo Kid!! Only you can catch all cows with breath-taking roping skills. The number 1 Game in the Taiwan App Store is now on the iPad in HD! Grab that rope and get on your horse, let’s catch some cows!<br/><br/>Jingle Bell~ Jingle Bell~ Jingle All the Way! The new Christmas Stage has been released! Catch those cows in the snow, and challenge the new Boss – the Red-nosed Reindeer! Also we’ve added 2 new modes for you to earn ropes the fun way: the Infinity Mode and the Slots Mode!<br/><br/>★ Description<br/>In “Rodeo Kid HD”, you will play as a cowboy and catch target cows to complete stage goal! Toss your ropes by taping on the screen to catch the target; timing is everything, so make sure you tap at the perfect moment! There are different theme packs with different goals and cows, complete the missions to win free ropes, unlock more levels, and even win different horses!<br/><br/>★ How To Play<br/>- Tap the screen and aim at the cow’s head.<br/>- Catch specific cows listed at the beginning of each mission<br/>- When you catch the boss cow, you must win the struggle by swiping your finger through the arrows onscreen<br/>- Ropes are spent when you toss them; ropes automatically regenerates after certain amount of time<br/><br/>★ Features<br/>*New* Infinity Mode<br/>*New Slots Mode<br/>- Designed for iPad<br/>- Simple, intuitive controls<br/>- Themed stage design &amp; Stage Statistics<br/>- Unique Boss mode <br/>- Daily Bonus<br/>- Treasure Chest with Extra Bonus<br/>- Mission System with exchangeable prizes<br/>- Changeable horse avatars<br/>- Game Center leader board &amp; achievements <br/><br/>★ Infinity Mode<br/>- In this mode, your ropes regenerate much faster.<br/>- You do not consume ropes in this mode.<br/>- Catch as many cows as you can; exchange the cows for presents &amp; ropes<br/>- A new horse avatar!<br/>- This mode requires Internet connection to play; ad banner is shown.<br/><br/>★Slots Mode<br/>-Earn ropes the fun way! Try your luck with the slot machine!<br/>-Chances to win lots of ropes!<br/>- This mode requires Internet connection to play; ad banner is shown.<br/><br/>Thank you Rodeo Kid Fans! We’ve heard your opinions, and we’re making the game better! Try our the new Infinity Mode and the new Slots Mode and earn ropes the fun way for FREE!<br/><br/>http://app.igsgame.com<br/>http://facebook.com/igsgames<br/>http://twitter.com/igsgames", "metacritic": null, "released": "2011-11-10", "tba": false, "updated": "2019-07-29T13:46:14", "background_image": "https://media.rawg.io/media/screenshots/ff8/ff843379f9a39b53c279fa7d9d3aaa1e.jpg", "website": "http://app.igsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["International Games System Co"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["International Games System Co"], "esrb_rating": null}