{"id": 71596, "slug": "idle-drops", "name": "Idle Drops", "name_original": "Idle Drops", "description": "How fast can your in-game fortune grow? Simple – as fast as you can tap!<br/><br/>- Tap the screen to make the balls drop into the slots!<br/>- Upgrade or buy new drops to earn more in-game money<br/>- Boost your balls to unlock new levels and reveal more of the story!<br/>.<br/>.<br/>.<br/>.<br/>.<br/>SUBSCRIPTION PRICING AND TERMS<br/>VIP Membership offers a weekly subscription for 4.99$ after a 3-day of free trial. This is an auto renewable subscription.<br/>It gives you:<br/>- 200% of value<br/>- No ads<br/>- 10 golden diamonds as a daily gift<br/><br/><br/>End of trial and subscription renewal<br/><br/>This price is for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>The account will be charged for renewal within 24-hours prior to the end of the current period, it will be charged 2.99$ for the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes account. Check https://support.apple.com/HT202039. When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period cannot be canceled. After your subscription expires, you will no longer be able to use elements offered in your chosen Subscription Option. <br/><br/>If you have any questions or comments, feel free to contact us at contact@homagames.com<br/><br/>Privacy Policy: http://homagames.com/privacy/<br/>Terms of Use: http://homagames.com/terms/", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-29T18:46:31", "background_image": "https://media.rawg.io/media/screenshots/6a9/6a9bc346af66ff70f992dbebee7d1e23_uycRtTi.jpg", "website": "http://homagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Homa Games"], "genres": ["Adventure", "Board Games"], "publishers": ["HYDRANE SAS"], "esrb_rating": "Everyone 10+"}