{"id": 71617, "slug": "tycoon-classic-slots", "name": "Tycoon Classic Slots", "name_original": "Tycoon Classic Slots", "description": "Real slots at Tycoon Classic Slots - the BEST 777 Classic Online SLOTS Game ever! <br/>PLAY NOW to receive a FREE Welcome Bonus Package!<br/><br/>World class gambling game design brings real 777 slot games from the casinos to mobile App! New Features and Surprising Bonuses on All New Slots!<br/><br/>Tycoon Classic Slots is the best 777 classic slots game offers the most stunning graphics and a realistic casino experience. Enjoy every benefit you can possibly have on a real slot machine! Progressive Jackpot, Stacked Symbols and Locked WILDs! PLAY NOW and get the best slot experience today!<br/><br/>What is special at Tycoon Classic Slots?<br/>• Tournament Day, Quest Day, and Challenge Day bring you Extra bonus every day of the week!<br/>• All levels All slots 100% FREE to play! New Updates online every week!<br/>• Multiply your winnings to maximize the benefits with Bonus Games!<br/>• 2,000,000 FREE Coins for starter bonus, plus Hourly bonus, Daily Bonus, Store Bonus, Holiday Bonus, Friends Bonus, Fan Page Bonus and many more FREE coins available everyday!<br/>• A variety of WILD, Free Spins, Bonus Games, Jackpots and more interesting ways to play!<br/>Play Tycoon Classic Slots, the BEST 777 Classic Online SLOTS Game ever!<br/><br/>Play free slots, slot machine games &amp; online casino. Make a fortune with huge jackpots, free daily games on Tycoon Classic Slots! Ding Ding Ding! Jackpots!<br/><br/>Tycoon Classic Slots is intended for an adult audience for entertainment purposes only. Success at social casino gambling does not reward real money prizes, nor does it guarantee success at real money gambling. Use of this application is governed by Mobee's Terms of Service.", "metacritic": null, "released": "2017-12-30", "tba": false, "updated": "2019-10-22T14:25:05", "background_image": "https://media.rawg.io/media/screenshots/b2d/b2d1685536702416a7b0e121c22022f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobee Co"], "genres": ["Card"], "publishers": ["Mobee Co"], "esrb_rating": "Teen"}