{"id": 71615, "slug": "woody-puzzle", "name": "Woody Puzzle", "name_original": "Woody Puzzle", "description": "WOODY, a new artisan relaxing block puzzle, is created JUST FOR YOU. Inspired by one of the warmest natural materials, WOODY is crafted to help you emotionally re-charge, reduce stress and increase positive social interactions.<br/>It’s the 10x10 wooden jigsaw making your brain healthy for a happy life. Take a break at any time with this calming free puzzle. <br/><br/>WOODY features:<br/>• Forever free to play<br/>• Aesthetically designed with a rustic and country appeal <br/>• Beautifully easy and simple, no pressure and no time limit<br/>• Surprisingly challenging to break your score record <br/>• Perfectly small install size that won’t hurt your storage<br/>• Visually informative chart to check your progress every single day <br/>• Instantly sharing on Facebook to compete with your friends and family<br/>• This app offers in-app purchase<br/><br/>WOODY’S reviews<br/><br/>SOOTHING, NO PRESSURE 10x10 WOODEN PUZZLE<br/>“If you like soothing, no pressure 10x10 puzzle with unlimited time, then you will definitely want to check out WOODY” <br/><br/>CHILL &amp; RELAXING BOARD GAME<br/>“WOODY is suitable for those who enjoy chillaxing with a graphically-appealing board game. It’s the best wooden jigsaw puzzle I’ve played. Love it” <br/><br/>EXCELLENT WOOD BLOCK PUZZLE <br/>“WOODY gives me an excellent Zen experience. I love this wood block puzzle. It is very relaxing. So awesome” <br/><br/>SIMPLISTIC, CHALLENGING, INTRIGUING JIGSAW PUZZLE<br/>“I definitely recommend this jigsaw puzzle. Simplistic, challenging, and intriguing!”<br/><br/>ADDICTING AND A LOT OF FUN 1010 BOARD GAME<br/>“It is great to have a 10x10 board game that you don't have to be a genius to play. Simple yet challenging. Addicting and a lot of fun board game” <br/><br/>Play WOODY for free for as long as you like. Then support WOODY team when you think it’s worth. <br/><br/>We hope you will love WOODY.<br/><br/>WOODY team", "metacritic": null, "released": "2017-03-30", "tba": false, "updated": "2019-10-22T14:25:05", "background_image": "https://media.rawg.io/media/screenshots/cd1/cd11c5957e21a245397c6d9b163aa7b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Free Block Puzzle Games"], "genres": ["Board Games", "Puzzle"], "publishers": ["Free Block Puzzle Games"], "esrb_rating": null}