{"id": 716150, "slug": "gdevelop-maze-extension-demo", "name": "Gdevelop Maze Extension demo", "name_original": "Gdevelop Maze Extension demo", "description": "<p>Demo for Maze generator extension in Gdevelop.</p>\n<p>Zip file contains the source code.</p>\n\n<p>Provides functions for generating mazes. </p>\n<p>Use <strong>GenerateMaze </strong>action to set up a maze with a particular size and give it a name (MazeID). The maze is stored in scene variables, to be used with other functions by specifying the MazeID. </p>\n<p>There are three other actions that create sprite objects you can use to place the maze into the scene:</p>\n<p><strong>CreateMazeFloorObjects</strong> : create tiles for each cell in the maze</p>\n<p><strong>CreateMazeWallObjects</strong>: create objects between each cell. Useful for walls</p>\n<p><strong>CreateMazeCornerObjects</strong>: create objects on the point between 4 cell corners. Can be useful to improve maze visuals</p>\n<p>There are plenty of other helper functions for getting/setting maze properites or get helpful information. In particular:</p>\n<p><strong>CheckMazeWall</strong>: a condition to use in event sheet to test which walls exist for a cell</p>\n<p><strong>FindMazePath</strong>: creates a scene variable array containing a sequence of directions to go from one cell to another cell</p>\n<p>Finally, there is a <strong>MazeObject</strong> behavior that can be attached to wall or floor objects to provide some additional helper conditions, expressions, and actions. See the example gdevelop file in the help URL for examples of its use.</p>", "metacritic": null, "released": "2021-12-29", "tba": false, "updated": "2021-12-31T05:29:55", "background_image": "https://media.rawg.io/media/screenshots/842/8422e481a9636c4ed928785de447cf15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Luxon5"], "genres": [], "publishers": [], "esrb_rating": null}