{"id": 716201, "slug": "buddys-bone", "name": "Buddy's Bone!", "name_original": "Buddy's Bone!", "description": "<p><strong><strong>Help a dog find his lost bone in </strong></strong><strong>BUDDY'S BONE! </strong><br/>It's the year 199X on a strange planet called Earth... In the small town of Hamburgerville a young girl called Sam comes home from school. As she tries to open the front door to her house Sam notices that she has lost her key. Her dog Buddy also seems to have lost something important. When he woke up from his nap he discovered that the bone he had been chewing on had dissapeared! <br/></p>\n<p>Why has all of this stuff gone missing? Are people just being really careless or is something else going on? As you unravel this intriguing mystery you will meet fabulous friends and battle vicious foes. Will you be able to unlock the mystery of what lies behind the front door of Sam's house? Are you brave enough to embark on this epic quest to uncover the ultimate fate of Buddy's bone?<br/></p>\n<p><strong>Reasons why you should play this game:</strong><br/></p>\n<ol><li>- It's very casual and easy to play.</li><li>- There are lots of jokes to read.</li><li>- You could play through it during a lunch break.\n</li></ol>\n<p><strong>SCREENSHOTS:<br/></strong></p><p><strong>CHARACTERS:</strong><br/> <br/></p>\n<p><strong>SAM: </strong><em>\"Okey dokey!\"</em></p>\n<p>Sam is a young girl who lives on the outskirts of Hamburgerville with her parents and her dog Buddy. She is the smartest kid in her class and wants to be an astronaut when she grows up. Her most cherished possession is the 'Big Book of Jokes' which contains an endless amount of jokes, riddles and puns.<br/></p>\n\n<p><strong>BUDDY:</strong><em><strong> </strong>\"Uh-oh... Are we in trouble again?\"</em></p>\n<p>Buddy is a small mixed-breed orange dog. He is Sam's best friend and they love to joke around with each other. He is quite clever and also very mischievous, which means he tends to get into all sorts of trouble. When Buddy is not getting into any trouble he's either eating or taking a nice long nap.<br/></p>\n\n<p><strong>BUDDY'S BONE:</strong> <em>\"...\"</em></p>\n<p>Every dog enjoys having something to chew on, whether its shoes, furniture, or a nice tasty bone. Buddy's bone is a large, tasty, raw beef bone. The kind of bone that every dog dreams about! Unfortunately, it seems to have dissapeared without a trace.</p>", "metacritic": null, "released": "2021-12-29", "tba": false, "updated": "2021-12-31T05:40:47", "background_image": "https://media.rawg.io/media/screenshots/42d/42d7b1fff041dc9cca115eedb30bc6e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["teleshock_p"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}