{"id": 716216, "slug": "santa-claus-in-a-flight-to-remember", "name": "Santa Claus in A Flight To Remember", "name_original": "Santa Claus in A Flight To Remember", "description": "<p>After some distracted flying Santa accidentally drops some presents, and it's up to you to recover and repair them. Features a comedic story, hand-drawn art and animation and classic point-and-click adventure gameplay.</p>\n<p>A Flight To Remember was created for the December 2021 Monthly Adventure Game Studio (MAGS) competition on the  Adventure Game Studio forums.   The   theme was \"Gift Trouble\" and entries had to be made from scratch in one month.</p>\n<p><strong>Controls:</strong><br/>Left-click on an object to interact with it, or left-click on an empty area to try and walk there. Some objects can be picked up and will go in your inventory.  Left click on an inventory item to take it out, then left click on another item or object to use them together.<br/>Right mouse on an object or inventory item to look at it, which may reveal useful information. When holding an object right-click will put it back in your inventory.<br/>Click the '?' button to view a summary of the controls and your objective.<br/>Click the cogs button to access the game options and to save, load, restart or quit the game.</p>\n<p><strong>Running the game:</strong><br/>The game was built for Windows but is also playable in ScummVM  version 2.5.0 and later, which could be used to play on other platforms such as Mac and Linux.</p>\n<p>When running on Windows use WinSetup.exe to configure your graphics and sound options. If you have trouble running the game try changing these settings  first.<br/></p>", "metacritic": null, "released": "2021-12-29", "tba": false, "updated": "2021-12-31T05:44:13", "background_image": "https://media.rawg.io/media/screenshots/35c/35c3127a2602617e81a7e315fc526be6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OneDollarProductions"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}