{"id": 71635, "slug": "wild-vegas-casino-slots-games", "name": "Wild Vegas Casino: Slots Games", "name_original": "Wild Vegas Casino: Slots Games", "description": "Play Slots – Win Wild Bonuses!<br/><br/>AGS welcomes you to WILD VEGAS with a 1,000,000 coin bonus! The quality casino slot machines you love from Las Vegas casino floors come alive on your mobile, with amazing video slots and casino bonuses! Authentic AGS slot games with the identical look, feel and winning gameplay from the casinos!<br/><br/>It’s time to WIN coins and prizes! Here’s how:<br/><br/>* Bonus Wheel spins every 4 hours<br/>* Exchange gifts with Facebook friends <br/>* Daily events and contestsof casino games including blackjack, video poker, and bingo. <br/><br/>Join us for an authentic Vegas slots experience and WIN BIG!<br/>* Live events, challenges and missions so you can compete with others<br/>* Intense live tournaments for slots, blackjack and video poker<br/>AND additional coins every four hours to get the most out of your play!<br/><br/>Choose from our WILD collection of the newest video slots, in addition to classic 3-reel, one line slots including:<br/><br/>-\tRoyal Reels <br/>-\tFire Wolf<br/>-      Golden Wins<br/>-      Jade Wins<br/>-      Queen's Pride<br/>-\tGreen Vault Slot Machine<br/>-\tLiberty 7s Casino Slots<br/>-\tGoing Gnome Slot Game<br/>-\tDouble the Devil Slots<br/>-\tSo Hot Slots… and so much more!<br/><br/>PLUS! Enjoy our full selection of casino games including blackjack, video poker, and bingo. <br/><br/>Join us for an authentic Vegas slots experience and WIN BIG!<br/><br/>LEGAL<br/>Wild Vegas does not manipulate or otherwise interfere with contest outcomes in any way. Results are based entirely on luck and the choices made by players in the contest. Live contests are in no way endorsed, sponsored by, or associated with Apple. The games are intended for an adult audience. The games do not offer \"real money gambling\" or an opportunity to win real money or prizes. Practice or success at social casino gaming does not imply future success at \"real money gambling.\"", "metacritic": null, "released": "2016-10-14", "tba": false, "updated": "2019-10-22T14:25:05", "background_image": "https://media.rawg.io/media/screenshots/428/428c8190076bbc7e03366c38016c093e.jpg", "website": "http://www.playags.com/ags-interactive/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RocketPlay"], "genres": ["Card"], "publishers": ["Gamingo"], "esrb_rating": "Teen"}