{"id": 716363, "slug": "on-poetic-tides-a-poetry-prompting-adventure", "name": "On Poetic Tides: A Poetry-Prompting Adventure", "name_original": "On Poetic Tides: A Poetry-Prompting Adventure", "description": "<p><em>On Poetic Tides</em> charges you, oh brave (but perhaps not-so-wise) seafarer, with creating a poem fully from scratch using 20 cards from a standard deck, a pen, and some paper (or something else to write with/on). The game is meant to be played solo, but you can simply take turns flipping cards and writing your own poems with the shared prompts, then share them with one another after. Or heck, pass your poems back and forth and co-write them! Just like poetic license lets you use words as you see fit, you can use this game however you see fit.</p>\n<p>I don't know technicalities about copyrights and stuff, but <strong><em>please feel free to hack this game</em></strong> (as in, use the format here but change the theme, art, and prompts to make your own version). If you do, please let me know (you don't have to, it'd just make me happy!) and please feel free to upload it anywhere and charge what you want for it. While not required, please include community copies and/or a demo (as I did) for those who can't afford it, and please link to this version from whatever page you create for it. </p>\n<p>Note: the demo versions are the same as the full version, they're merely missing the background art. If that's all you want, then enjoy! 😀 The paid version includes the plain text version as well as a full color one and a black-and-white version (that still has a nifty ship on it but uses less ink!), each of which comes in Legal or A5 page size and as an .svg or a .pdf. If you're willing and able, support via purchase is greatly appreciated and will encourage me to make even more games, but it's certainly not necessary 🙂</p>", "metacritic": null, "released": "2021-12-29", "tba": false, "updated": "2021-12-31T06:19:44", "background_image": "https://media.rawg.io/media/screenshots/58d/58d2f1c6c4c0747fa0ff9eb80b67704e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beth Jackson"], "genres": [], "publishers": [], "esrb_rating": null}