{"id": 71676, "slug": "super-numbers", "name": "Super Numbers", "name_original": "Super Numbers", "description": "Super Numbers is a math-based puzzle game in which you are to clear series of boards filled with numbered tiles. Add up the numbered tiles to form the digit displayed on the board's display. A new board is presented when you clear the current one and this keeps going on and on until you run out of time.<br/><br/>Clear as many boards as you can to score the highest and post your scores on the Leaderboard.<br/><br/>• INFINITE GAMEPLAY<br/><br/>  The game just does not end until you run out of time, so you can finish board after board until you can't anymore!<br/><br/>  Plus the numbers for addition can even go up to three digits!<br/><br/><br/>• SIMPLE YET ADDICTIVE<br/><br/>  Playing through new boards each time and understanding how everything works, you'll be posting high score after high score on the Leaderboard before you know it!<br/><br/><br/>• GAME CENTER INTEGRATION<br/><br/>  Post your score on the Leaderboard and see where you stand in the global rankings.<br/><br/><br/>• NO TWO GAMES WILL BE THE SAME<br/><br/>  Numbers and numbered tiles are generated at random at each time, so your second experience will be very different from the first.<br/><br/><br/>• RETINA-DISPLAY SUPPORT<br/><br/>  HD Textures ensure beautiful graphics on the iPad, iPhone and iPod touch's Retina Display... these boards have never looked better!<br/><br/><br/>• UNIVERSAL BINARY<br/><br/>   Purchase once and use on all your iPads, iPhones and iPod Touches!", "metacritic": null, "released": "2012-09-12", "tba": false, "updated": "2019-07-30T05:53:57", "background_image": "https://media.rawg.io/media/screenshots/f24/f241921a6bd5e850fb4c9d66c941f6b8.jpg", "website": "http://www.ironjawstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ironjaw Studios"], "genres": ["Board Games", "Puzzle"], "publishers": ["Ironjaw Studios Private"], "esrb_rating": null}