{"id": 716806, "slug": "vr-cuddle-terapie", "name": "VR CUDDLE TERAPIE", "name_original": "VR CUDDLE TERAPIE", "description": "<p>STILL IN PROGRESS <br/><br/>Medium:<br/>Virtual reality, Pillow objects<br/><br/>Devevolep by <br/>Karolína Schön<br/>Klára Kacířová<br/>Alena Kolesnikova<br/>Ester Grohová<br/><br/><br/>Virtual Cuddle Terapie works as therapy/meditation v VR world. For better imerzivity, we work also with pillow objects and material around the recipient, so there is little difference between VR and our world. The instalation is nessesary for full experience of calmness and distance of outside world.<br/><br/>The project aims to give the audience a moment to stop, break free from normal daily marches, and experience full presence. With the help of a virtual vision, the participants concentrate on their breath, slow down and breathe through the body. Gentle attention is given to your human body devotes them to the basis for the ability to stay in the present and experience one's immediate feelings, not just the hurried and anxious states implied by the current global pandemic crisis.<br/><br/>Focusing on one's breath will allow one to stop for a moment and break free from established thought automatisms.<br/><br/>The topic of self-care and building certain inner stability and awareness of one's own mental and physical feelings.<br/><br/>The deeper we can look at the realities of our inner self, the more we become more compassionate with other non-human entities.<br/><br/>Group of 4 grirls of Arts schools, who are searching for methods to help people through new media, virtual reality, haptic objects and mindfullness. Studio combines techniques of artherapy and new technology.</p>", "metacritic": null, "released": "2021-12-27", "tba": false, "updated": "2021-12-31T08:02:41", "background_image": "https://media.rawg.io/media/screenshots/e6b/e6b7a4b41c19ef6568a3122c99df8f41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rn7u"], "genres": [], "publishers": [], "esrb_rating": null}