{"id": 71685, "slug": "solitaire-klondike-card-game", "name": "Solitaire: Klondike Card Game", "name_original": "Solitaire: Klondike Card Game", "description": "Klondike is the most popular variation of the family of patience games played around the world. It will captivate you for hours! The game of Klondike Solitaire requires patience, bit of strategy and quite a bit of skill to be beaten. <br/><br/>This Klondike version is especially optimized for every screen and the entire range of Android. We tried to create an ideal Klondike game and the gameplay is really easy and natural for your fingers.<br/><br/>Your goal in Klondike is straightforward: build up a stack of cards starting with 2 and ending with King, all of the same suit. Once accomplished, the goal is to move this to a foundation, where you will have previously placed the Ace of that suit. Once done, the goal being, of course, to finish all suits, at which time you will have effectively won the Klondike game. <br/><br/>Take Klondike Solitaire for a spin and we think you'll see the difference. What have you got to lose? Klondike is a free download! We have always strived to stay true to the classic Klondike card game, the most popular version of Solitaire! A true Solitaire experience! <br/><br/>Play Klondike Solitaire today and have fun! <br/><br/>Features include:<br/><br/>1. Beautiful graphics<br/>2. Smart click, drag and drop<br/>3. Unlimited undo, for free<br/><br/>Download Klondike Solitaire game today on your phones and tablets today!<br/><br/>Don't forget to review and rate our game of Klondike Solitaire.<br/><br/>Remember, most Klondike Solitaire games can be solved, so don't give up!", "metacritic": null, "released": "2017-12-22", "tba": false, "updated": "2019-10-22T14:25:05", "background_image": "https://media.rawg.io/media/screenshots/a51/a51261beb27a183a0531e459cd1d7ff1.jpg", "website": "http://www.ironjawstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Ironjaw Studios"], "genres": ["Card"], "publishers": ["Ironjaw Studios Private"], "esrb_rating": "Everyone 10+"}