{"id": 716812, "slug": "allegiance-itch", "name": "Allegiance (itch)", "name_original": "Allegiance (itch)", "description": "<em>Sentenced to the life of an entertainer, you find yourself shackled in the dark recesses below the arena. In your desperation, you commune with the primordial forces of the world. Now, as the herald of a God, you seek redemption from the society you betrayed.</em>\n\n<br/>\n<p>Allegiance is an action-oriented rogue-like arena fighter with heavy emphasis on player choice. The game features many different RPG elements such as attributes, skills, items and trinkets to aid you in your quest. As a Gladiator, you will have access to all manner of playstyles and flair to suit your needs and preferences.</p>\n<p>With each battle won, your enemy grows stronger, which means that you will have to adapt and hone your own skills if you are to survive. Your main way of rising above the competition is through the worship of a deity; a God or Goddess of your choice. Your new alliance unlocks powerful God-specific abilities, where the path you choose determines your playstyle. </p>\n\n\n<p>There are many different deities that respond to the violence and energy present inside the arena walls. Every God possesses different masteries and ways of defeating their opposition. </p>\n\n<p>Will you pledge your life to the dark path of Dylosos, or will you sacrifice your own blood to serve Hema?</p>\n\n\n<p>When defeating foes, you are granted skill points that allow you to unlock powerful new abilities bound to the God you serve. Each God has a specific theme bound to them, be it utilizing dirty tricks or utilizing health as a resource.</p>\n\n<p>As you progress through the arena and defeat foes, your Gladiator grows stronger with each passing battle. Utilizing your growth potential to specialize in different masteries such as strength, agility, charisma or vitality will be crucial to your survival as you ascend the hierarchy. </p>\n\n\n<p>There are many different types of weapons present in Allegiance. Each weapon has its strengths and weaknesses, providing you with different playstyles. Will you utilize a brutish two-handed weapon, or will you choose a more agile armament?</p>\n\n\n<p>As a prize for defeating your opponents, you will be granted a chest full of loot after each encounter. Inside this chest you will find various items to aid you, such as new weapons, armor pieces and spellbook tomes. Each reward is randomized, requiring you to adapt and reconsider based on the items you receive. </p>\n\n<p><strong>16+</strong><br/>Blood, violence.</p>\n\n<p><strong>System Requirements:</strong></p>\n<p>OS: Windows 8 or 10 64-bit.<br/>CPU: Intel Core i5-7400 @ 3 GHZ or equivalent.<br/>GPU:  NVIDIA GeForce GTX 980 or equivalent.<br/>Available disk storage space needed: 1 GB<br/>RAM: 8GB<br/>Monitor resolution: 1920x1080<br/></p>", "metacritic": null, "released": "2021-12-27", "tba": false, "updated": "2021-12-31T08:03:59", "background_image": "https://media.rawg.io/media/screenshots/38b/38b76d3bace6be7d679b73ec83fdd38b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AllegianceDevTeam"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}