{"id": 71688, "slug": "grim-tales-the-heir-a-mystery-hidden-object-game", "name": "Grim Tales: The Heir - A Mystery Hidden Object Game", "name_original": "Grim Tales: The Heir - A Mystery Hidden Object Game", "description": "Play the trial for FREE!  Pay once &amp; complete the adventure!<br/><br/>Once again, the Gray family finds themselves in deep trouble, and of course you’re the only one who can help. This time, your great-nephew has gone missing, and his mother has lapsed into a mysterious coma. Apparently young Billy was being tormented by a dark and hooded figure, who could appear each time with different features. Can you save your family before it’s too late?<br/><br/>• DISCOVER THE DARK FORCES AT PLAY!<br/>Who would want to harm this innocent child, the one and only heir to Gray Mansion? What could be gained by severing this branch of your ancestral family tree?<br/><br/>• CAN YOU FIND THE MAN OF MANY FACES?<br/>Chase down this heinous villain through a variety of haunted hidden object scenes.<br/> <br/>• TRAVEL BACK THROUGH TIME WITH A SIMPLE TOUCH<br/>Use your unique and mystical abilities to solve eerie puzzles and spooky mini-games.<br/><br/>• PLAY ANOTHER GRAY FAMILY ADVENTURE IN THE BONUS GAME<br/>Continue the mystery and enjoy additional Collector’s Edition exclusives including collectible Character Figures, morphing objects, and more!<br/><br/>*** Discover more from Big Fish! ***<br/><br/>Check out our entire game library with our Big Fish Games app absolutely FREE here: http://bigfi.sh/BigFishGamesApp<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com! <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter", "metacritic": null, "released": "2016-09-20", "tba": false, "updated": "2019-07-29T10:56:02", "background_image": "https://media.rawg.io/media/screenshots/490/49077b79f40cb09ef8798d22b87607ac.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}