{"id": 716889, "slug": "eye-tester-game", "name": "Eye tester Game", "name_original": "Eye tester Game", "description": "<p>This application is build using Python programming langauge. 😎</p>\n<p>The GUI is build using Tkinter Library!❤</p>\n<p>This is open Source Project, you are welcome to contribute.</p>\n<p><strong> Guide</strong></p>\n<p>1.  After opening the application the user interfrace looks like this:</p>\n\n<p>2. The user interface consist of menu bar, Color image as a question, Score banner, the option for choosing shade, two button one to change the color and other to quit the game.<br/></p>\n<p>3. The Menu section looks as follows. </p>\n\n<p>4. In menu section, \"New game\" option create a new game to play with resetting the score and color. \"Change Color\" option change color question and keeps the score constant. \"Reset Score\" reset the score to 0. \"Exit\" option allow user to quit the game.</p>\n<p>5. The Help section looks as follows.</p>\n\n<p>6. In Help section, \"Help\" option create a inner window displaying the help on game.</p>\n\n<p>7. In Help section, \"About\" option create a inner window displaying the about section of game.</p>\n\n<p>8. In Help section, \"Developer\" option create a inner window displaying the developer detail of game.</p>\n\n<p>9. In Secret Section looks as follows:</p>\n\n<p>10. In Secret section, \"secret\" option creates a inner window displaying the tip for game.</p>\n\n<p>11. in Section Section, \"What's Next?\" option creates a inner window asking for expectations from user.</p>\n\n<p><strong>How to setup?</strong></p>\n<p>Run the main.exe file to get started.</p>\n<p><strong>Note</strong>: There is a lot of future scope to further develop the project.</p>\n<p>Code: This project is open source, you can find the code here, Github Link!.</p>", "metacritic": null, "released": "2021-12-27", "tba": false, "updated": "2021-12-31T08:25:24", "background_image": "https://media.rawg.io/media/screenshots/e4b/e4b8e3b57f69105b1d8ffdb70526475c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gaurav Patil"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}