{"id": 717023, "slug": "rain-in-the-abyss", "name": "Rain in the Abyss", "name_original": "Rain in the Abyss", "description": "<p>A terrible ancestral prophecy has unleashed total drought in the sacred lands of Huapalli, leaving its inhabitants without water and on the verge of extinction.<br />\nNuez is the only descendant of a marginalized tribe that does not need water to survive, she is the only one who can bring life back to her lands before it is too late.<br />\nEnter the beautiful and terrifying world of the abyss that protects a sacred ancestral object. Destroy every life form that is a threat, at long range with your crossbow or tearing your enemies with your bare hands. Search for minerals, food, and items to craft artifacts that give you an edge over your ruthless enemies and battle colossal bosses willing to annihilate you.</p>\n<p>Explore a vast and beautiful world: Discover an incredible world full of dangerous enemies and poisonous plants that inhabit the abyss.</p>\n<p>Combinable Combat: Destroy your enemies with the power of your crossbow, a sacred weapon created by your tribe. Create devastating new ammo for your weapon and unlock special moves for Nuez tail that will give you the agility and power to achieve your goal.</p>\n<p>Executions: Release your anger by tearing your enemies apart in a bloody way with carefully animated executions.</p>\n<p>Customize your game mode: Discover and equip yourself with amulets, which will completely change the way you play, acquiring skills that allow you to overcome areas without being seen or destroying everything in your path. Try different combinations to find one that fits your style of play.</p>\n<p>Unforgettable battles against colossal bosses: Face impressive colossal bosses animated in pixel art.</p>\n<p>Discover unimaginable areas of the abyss: A world of constant rain full of beauty, magic, horror and sadness. You will find really charming, disconcerting and mysterious characters that could help you, or maybe not. An epic unique and unforgettable adventure that will touch each of your emotions.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-10-01T03:12:42", "background_image": "https://media.rawg.io/media/screenshots/f94/f94d50c48bcfcac99d3a9727af77de60.jpg", "website": "https://store.steampowered.com/app/1746980/RAIN_IN_THE_ABYSS/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action"], "publishers": ["Self-Published"], "esrb_rating": null}