{"id": 717078, "slug": "gold-baron", "name": "Gold Baron", "name_original": "Gold Baron", "description": "<p>Thanks for downloading Gold Baron Alpha! Currently it's in the</p>\n<p>testing/prototype phase. There will be bugs. There isn't much</p>\n<p>in the way of actual story integrated into the game other than</p>\n<p>a few text bits here and there.</p>\n<p>***************CONTROLS***************************</p>\n<p>WASD move the camera forward/back/left/right.</p>\n<p>Mouse Right Click and Drag will rotate the camera.</p>\n<p>Mouse Wheel will zoom camera in and out.</p>\n<p>Mouse Left Click will allow you to interact with the world.</p>\n<p>*****************Game Idea***********************</p>\n<p>You're an alien who crash landed at the dawn of human</p>\n<p>civilization. Your ship is programmed to not leave the</p>\n<p>planet until you have acquired at least 20000 gold units.</p>\n<p>Your ship will repair itself in the background while you</p>\n<p>deploy buildings for the natives to work in. Each</p>\n<p>building has a specific function that it excels at.</p>\n<p>Example: Sawmill is great for wood production. When you</p>\n<p>click the hammer icon on the bottom toolbar it will</p>\n<p>open the Build Menu. This will show you your building</p>\n<p>options currently. Your first goal is to build a set of</p>\n<p>these buildings that can work in equilibrium with each</p>\n<p>other and create surplus. Once you have acquired enough</p>\n<p>resources you can unlock the inventor's office to go</p>\n<p>into phase 2. This unlocks the ability to do research.</p>\n<p>At this time you should see the book is no longer red.</p>\n<p>Once you open the research menu you can click to drag </p>\n<p>left/right to go between the production research and</p>\n<p>the building unlocks. For production you will need to</p>\n<p>buy research points for 50g each. There is no limit to </p>\n<p>how high you can increase production at the moment.</p>\n<p>The building unlocks are limited, but you need quite a </p>\n<p>bit of gold to unlock them all. </p>\n<p>****************CONTACT**************************</p>\n<p>There are some bugs </p>\n<p>which is to be expected as this is a prototype that I</p>\n<p>have worked on in my free time. If you do find what </p>\n<p>seems to be a bug. Just send me an email with the subject</p>\n<p>line \"BUG REPORT\" and list what you were doing at the </p>\n<p>time and any buildings that were placed. Screenshots help</p>\n<p>as well. You can send the email to me through the email </p>\n<p>listed in the readme file!</p>\n<p>If there is enough interest in the game then I will take</p>\n<p>it from the prototype phase and start refining the game</p>\n<p>and giving it some good polish. Once again thank you for taking</p>\n<p>the time to play and I appreciate any feedback you have!</p>", "metacritic": null, "released": "2022-01-03", "tba": false, "updated": "2022-01-03T02:47:54", "background_image": "https://media.rawg.io/media/screenshots/b2a/b2a47ce70c7ec57bd6fc5781a390f0df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adderus"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}