{"id": 7171, "slug": "crafting-story", "name": "Crafting Story", "name_original": "Crafting Story", "description": "Get the craziest simulation-matching puzzle game ever! <br/>Combine different elements to re-create the world!  <br/><br/>Make the world a better place - build your own planet!<br/>Feel the Earth in your hands, manipulate it and make it inhabitable. Build worlds from the ground up by combining different pieces and parts of the Universe, then move on to other planets. <br/><br/>Be the Master of Universes, create your own custom planets and build them like never before!<br/>Make humans, build cities, grow and develop your very own planet! <br/>Tricky puzzle to master but easy to learn!<br/><br/>Create everything from a wooden wheel to Facebook and smartphone! How about a spaceship or a dishwasher?<br/><br/>GAME FEATURES:<br/>- Original puzzles and combinations to play with!<br/>- Unique 3D Earth simulation and visual scenes to interact with<br/>- Fun, easy-to-play and addictive gameplay for all ages <br/>- Animated scenes and original artwork<br/>- Build with different elements on 7 continents<br/>- Stylized polygonal worlds<br/><br/>GAME STORY:<br/>While visiting his grandpa, a boy named Albert discovered an old globe in the attic. The globe is magical and is very much like our planet, Earth, with oceans, mountains, animals, trees, humans, buildings and many other things. Albert decided to re-arrange the planet and make everything his own way.    <br/><br/>Crafting Story is a Universal App. Pay once and play on any of your iDevices !<br/><br/>REVIEWS <br/><br/>&amp;quot;Personalmente apprezzo la fluidità delle animazioni, così come l&amp;#39;utilizzo di un gamplay semplice ma al contempo complesso e in costante evoluzione.&amp;quot; - AVR Magazine<br/><br/>&amp;quot;Das Menu mit drehenden Globen ist einfach herrlich!&amp;quot; - Check App<br/><br/>&amp;quot;Сам же Crafting Story выглядит очень достойно, превосходная графика, забавные элементы головоломки над которыми придётся подумать&amp;quot; - Appdaily<br/><br/>LIKE US on https://www.facebook.com/graftingstorygame<br/>FOLLOW US on https://twitter.com/CraftingStory", "metacritic": null, "released": "2014-05-15", "tba": false, "updated": "2019-10-22T14:29:13", "background_image": "https://media.rawg.io/media/screenshots/370/37060aff44d6d52bb6455bffbe2fb9eb.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sergey Manucharyan"], "genres": ["Board Games", "Card"], "publishers": ["Sergey Manucharyan"], "esrb_rating": "Everyone 10+"}