{"id": 717265, "slug": "pulsatio-cordis-demo", "name": "Pulsatio Cordis (DEMO)", "name_original": "Pulsatio Cordis (DEMO)", "description": "Pulsatio Cordis (DEMO)\r\n<p>The popular guy meets a random nobody and inexplicably develops a crush on them. Sound familiar? It’s only the premise of like 90% of the teen fiction genre. But dream no more. Your love letter, once a wishful Hail Mary, has been accepted by the one and only Liev Latané!<br/></p>\n<p>Liev seems unattainable 一 how can any sane eighteen-year old juggle being head student with being leader of the debate team and  the school athletics team, on top of being a UN Youth Ambassador? But somehow, out of 150 students, he chose to go on a date with you!\r\n</p>\n<p>Follow the story of the lucky student Quinn Jones (name changeable) on their date as they do their damndest to impress him with their comparably mediocre credentials. Your every choice matters here… you don't want to ruin your chances with him, do you?</p>\n<p>Though Liev appears the epitome of the model student, your date gives you the opportunity to find out more about him. What is he like outside of a school setting? What does he like to do in his free time?\r\n</p>\n<p>The truth may not be as kind as you expect.</p>\n<p><strong>Features:</strong></p>\n<ul><li>Protagonist has a customizable name and gender (male/female)</li><li>A point system that is a determinant of your ending.</li><li>5+ endings (with CGs).</li></ul>\n<p><strong>Credits:</strong></p>\n<p>(NB: Links to all sources are included in the 'About' section of the menu.)</p>\n<ul><li>Background art by Noraneko (itch.io page), Potat0Master (itch.io page) and Samu-kun.</li><li>Phone template by Nadia Nova (itch.io page)</li><li>Music by Eric Matyas , Ontama-M, and Vivek Abhishek.</li></ul>\n<p><strong>Warnings: </strong></p>\n<ul><li>This game contains depictions of violence,  mental instability, mentions of animal death, and depictions of nonconsensual drugging. </li><li>It also contains shaking transitions, which can be turned off in Preferences.</li></ul>\n<p><strong>Notes:</strong></p>\n<ul><li>I have only ever been familiar with how high school in New Zealand works, so  some concepts may be unfamiliar to people who are used to different systems. It's not a huge part of the story, but I thought it would be worth mentioning.</li></ul>", "metacritic": null, "released": "2022-01-02", "tba": false, "updated": "2022-01-03T03:29:39", "background_image": "https://media.rawg.io/media/screenshots/d9a/d9ae9eabd603aed6755842f1f458f1e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucia Lily"], "genres": [], "publishers": [], "esrb_rating": null}