{"id": 71720, "slug": "gyr-ksy-drft-wnlyn", "name": "غيار عكسي: درفت اونلاين", "name_original": "غيار عكسي: درفت اونلاين", "description": "اول لعبة سيارات درفت اونلاين احترافية عربية جماعية، العب مع الاف اللاعبين و كن ملك الدرفت.<br/><br/>ادخل حلبات الدرفت المختلفه و اهزم افضل اللاعبين، احصل على بطاقات لشراء السيارات و التطويرات الرائعه حتى تستطيع التقدم اكثر في اللعبه و تصدر قائمة اللاعبين.<br/><br/>اصنع سيارتك و عدل وزنيتها و تعلم افضل مهارات الدرفت، و ميزها عن باقي سيارات اللاعبين.<br/> <br/>اللعبة تحتوي على الميزات التاليه:<br/><br/>-  لعب جماعي اونلاين مع الاف اللاعبين<br/>- حلبات رائعه مخصصه للدرفت<br/>- ٢٠ سيارة رهيبه قابله للتعديل<br/>- وزنيات سيارات مختلفه للحصول على دريفت افضل<br/>- تقدم ب ١٠ مستويات  مختلفه للحصول على سيارت و تعديلات اكثر<br/>- امكانيه تعديل المظهر الخارجي للسياره من جنوط، لوحات، دهان، كتابات و رسومات<br/>- امكانيه التدريب قبل اللعب الجماعي<br/><br/><br/>كن ملك الدرفت على مستوى العالم وتحدى أصدقاءك! قيم اللعبة اليوم واخبرنا رأيك على قنواتنا في انستقرام ويوتيوب. رأيك يهمنا<br/><br/>هذه اللعبة تأتيكم من طماطم، ناشر الألعاب العربية الأول على متاجر الهواتف الذكية المختلفة<br/><br/>A multiplayer pro online drifting game. Play against thousands of players live and conquer the drifting game.<br/>Enter the drifting arena and beat the best players out there, earn more cards to upgrade your car and climb up the leaderboard.<br/><br/>Customize your car with many upgrades and tuning options. Add your personal touch and build your signature car.<br/>The game has the following:<br/><br/>•\tOnline experience with thousands of players<br/>•\tAwesome drift arenas <br/>•\t20 top notch customizable cars<br/>•\tDifferent tuning options for better drift experience<br/>•\tProgress in 10 different stages and unlock more cars and tuning options<br/>•\tHighly customizable exterior options from rims, license plates, paint job and vinyl.<br/>•\tTraining mode to get ready for online action<br/><br/>Become the king of drift among your friends and even worldwide! Rate this game and let us know if you like it on our Facebook and Instagram accounts.<br/><br/>This game is brought to you from Tamatem, the leading smartphone games publisher in the Arabic speaking market.", "metacritic": null, "released": "2017-01-18", "tba": false, "updated": "2019-10-22T14:25:06", "background_image": "https://media.rawg.io/media/screenshots/5b7/5b79dede545fa7cc827d573b344b1c13.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tamatem"], "genres": ["Simulation", "Racing"], "publishers": ["Tamatem"], "esrb_rating": null}