{"id": 717272, "slug": "space-junkies-itch-vivid-turtle-maxwaeper", "name": "Space Junkies (itch) (Vivid Turtle, maxwaeper)", "name_original": "Space Junkies (itch) (Vivid Turtle, maxwaeper)", "description": "<p><strong>Good news, everyone!</strong>  Yet another space junkie joins the intergalactic derby.<br/> <br/>We gave you some basic parts from scrap yard, you'll build a <em>spaceship </em>from that and show us fascinating battles with other artificial contenders. Sounds good, yes? You'll start weak and broke like this:</p>\n<p>And after each battle you'll get some extra parts from defeated contenders. Put them wherever you like, hell, you can even throw them away, just make sure you're building <strong>the most destructive and menacing ship</strong> there is! Just look at what I'm flying around destroying other junkies:</p>\n\n\n<p><strong>Here are a few basic tips for you:</strong><br/></p>\n<ul><li>You can move around parts outside of the battle however you like. They don't even have to be connected, but that'll look weird.</li><li>Ship can shoot and ram directly into enemy, balance your build around maximising single damage output or go for balancing different parts.</li><li>All parts have stats, mouse over particular one to see it's numbers and cool description in the box in the left corner.</li><li>Individual part stats are summed up when calculating a ship's total stats, no fancy formulas here;</li><li>Share cool builds in the comments!</li></ul>", "metacritic": null, "released": "2022-01-02", "tba": false, "updated": "2022-01-03T03:31:27", "background_image": "https://media.rawg.io/media/screenshots/f20/f2043854e34661238f9dd51ddd41ab7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Vivid Turtle", "maxwaeper"], "genres": ["Action"], "publishers": [], "esrb_rating": null}