{"id": 71732, "slug": "infinity-slots-vegas-games", "name": "Infinity Slots: Vegas Games", "name_original": "Infinity Slots: Vegas Games", "description": "Welcome to Infinity Slots!<br/><br/>Infinity Slots is fast becoming the Number 1 Las Vegas style Slot Machine Game. You can get a big win with over 90 of the best, unique Casino Slots games featuring a huge variety of themes from the epic Space Travel to Wild West and Pirates Gold!<br/><br/>Download now and get an amazing 3,000,000 coin Welcome bonus!<br/><br/>Check out our awesome in-game features:<br/><br/>- Featuring our regular Daily and Weekly Challenges and even hourly bonus games. <br/>- Our unique puzzle system means you can unlock and open even more new games than ever before.<br/>- Add your Social Media accounts and invite your friends to keep the competition strong. \t<br/>- A brand new VIP Room with Deluxe Las Vegas 777 slots for special guests. <br/>- Don’t forget Jackpot Party which includes Progressive Jackpots in every single fruit machine. <br/>- Double your prize by playing on with our Risk games or earn the Diamond card to increase all Payouts. \t<br/>- Las Vegas Casino atmosphere featuring incredible music whilst you play.<br/>- Stunning HD graphics make every game look spectacular.<br/><br/>Ride across the Wild West with a Legend and become a part of John Wayne’s Story. It’s a tale of a hero riding into a small town and helping local folk in their fight against the hardships of living in the West. Will you settle or will you continue to venture? It’s all up to you, gunslinger!<br/><br/>Do you hear the sound of the jungle drums? Do you see a colossal silhouette on the horizon? King Kong is coming. And he is going to show us his wrath. A journey through this island is not for the faint of heart, but we believe that you are the one to make it. Good luck! <br/><br/>It’s a classic tale told in a classic animated feature film. Join Princess Odette and Prince Derek in their adventure to lift the curse of an evil sorcerer Rothbart in a slot game based on Swan Princess. Have fun!<br/><br/>Play your favourite Casino Slots for free now:<br/><br/>- Venus slot game based on Sandro Botticelli's masterpiece painting “The Birth of Venus”.<br/>- Expect a visit from Santa to help you on your way.<br/>- Find the Pot Of Luck at the end of a rainbow.<br/>- Get the power of thunder with Furious Thor.<br/>- Avoid the bite of Count Dracula in Vampire Moon.<br/>- Can you handle the collective howl of 50 Wolves?<br/>- Get a taste of Vegas Luxury with American Beauty.<br/>- Experience the explosion of color and emotions in Rio.<br/>- Become mesmerized by an incredible show of Glitz and Glamour.<br/><br/>Infinity Slots is the must have free Las Vegas game! It is a place where classic slots get their new shiny outlook and are presented to you for free. Style that is classic, but also distinct. Gameplay that is familiar, but also new. Luxury Casino that is at no cost to you :)<br/><br/>What are you waiting for? Grab your 3,000,000 welcome gift in coins and get started!<br/><br/>Visit our website:<br/>https://murka.com/<br/><br/>Join us on:<br/><br/>Facebook<br/>https://www.facebook.com/PlayInfinitySlots/<br/><br/>Twitter<br/>https://twitter.com/playinfslots<br/><br/>Instagram<br/>https://www.instagram.com/infinity_slots/<br/><br/><br/><br/>KONG OF SKULL ISLAND ™ &amp; © 2018 DeVito ArtWorks, LLC, All Rights Reserved<br/><br/><br/><br/>FROM THE MAKERS OF INFINITY SLOTS: <br/>This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling. Use of this application is governed by Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy. Both policies are available at https://murka.com/", "metacritic": null, "released": "2015-09-19", "tba": false, "updated": "2019-10-22T14:25:06", "background_image": "https://media.rawg.io/media/screenshots/df4/df4910fd96df207802e8f21c5363cda2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Murka Entertainment"], "genres": ["Card"], "publishers": ["Murka Entertainment"], "esrb_rating": "Teen"}