{"id": 717539, "slug": "dice-wars-machine-learning", "name": "Dice Wars: Machine Learning", "name_original": "Dice Wars: Machine Learning", "description": "<p>This game showcases a neural network-based AI trained using Proximal Policy Optimisation reinforcement learning. Initially it was trained by playing against six opponents that made random moves, and later by playing against snapshots of itself that remained fixed (i.e. were not learning). <br/></p>\n<p>You can enable an AI visualisation option to show arrows representing possible moves that the AI considers to be better than ending its turn. The widest arrow indicates the chosen move, and successively thinner arrows represent the other moves in order of preference. Note that enabling this option may slow down the AI.</p>\r\nThe Rules\r\n<p>The AI learned the game without being told the rules but, in case you're wondering, here they are:</p>\n<ul><li>As many times as you want on your turn you may select a territory with a stack of two or more dice and then select an adjacent territory belonging to an opponent. Both players roll their stacks of dice. If you have the higher total, their stack is replaced with all but one of the dice in your stack and the territory becomes yours. Otherwise you lose all but one of the dice in your stack.</li></ul>\n<ul><li>When you choose to end your turn, a number of dice are randomly added your stacks equal to the size your largest group of connected territories. Note that a stack can have at most 8 dice.</li></ul>\n<p>The objective of the game is to control all the territories. The AI was given a large reward when it achieved this, and an equally large negative reward when it was eliminated.</p>\n<p>The game includes colourblind-friendly options.</p>", "metacritic": null, "released": "2022-01-01", "tba": false, "updated": "2022-01-03T04:29:14", "background_image": "https://media.rawg.io/media/screenshots/47e/47ef873f2e181cb2e4108e51246b6aaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Max Lewis"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}