{"id": 717590, "slug": "foster-monster", "name": "Foster Monster", "name_original": "Foster Monster", "description": "<p><strong>Foster Monster</strong> is a game that makes creative writing a joyful, engaging, celebratory activity where writing more leads to more thrilling and moving stories that guardians can tell with kids.  It is inspired and influenced by Sandy Pug Games' Monster Care Squad, Luke Pearson's Hilda, and Jay Dragsky's Wanderhome.</p>\n<p><strong>The current version, in pdf form, contains a link to a Google Slides show</strong> with over 40 slides that can be copied for personal use, edited, and illustrated by players at home to create a living document - a record of the stories and adventures you create, like a storybook.  It is a rough first draft of a user-friendly version of the game I use to teach writing at LuckOfLegends.com.  Engaging story prompts lead to read-alouds, which translates into the Traits of a character and their foster monster who then go on adventures together.  Leveling up is achieved through more story - describe a far-off land or a mysterious magical creature, then adventure to find it!</p><p>As time permits, I'll update, edit, and work with the rules to make them easier to approach.  I welcome any ideas you might have - the more I learn about what others need in order to run my system, the better it can become!  </p>\n<p>This is also a version modified to use Titanomachy's Caltop Core system for the Caltrop Core jam.  It is free to use with attribution under Creative Commons 4.0.</p>", "metacritic": null, "released": "2022-01-01", "tba": false, "updated": "2022-01-03T04:40:17", "background_image": "https://media.rawg.io/media/screenshots/e0e/e0ee462e387840aec0a03d3d9b7ce33c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michael Low"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}