{"id": 71771, "slug": "slots-era-best-casino-slots", "name": "Slots Era: Best Casino Slots", "name_original": "Slots Era: Best Casino Slots", "description": "Play Slots Era - the best Vegas Free casino slot machines. Install the best reels for free with a huge casino bonus - 12,000,000 Free Slots Coins.<br/><br/>The new Era of Slots has come! Travel back in time and discover the ancient worlds with huge jackpots, free spins and exciting bonus games.<br/>Download Slots Era now and be a part of your own slots adventure. Meet the ancient Pure Spirit, sail for Tortuga Secrets with the pirate`s Queen or even rule the world with Cleopatra and Caesar.<br/><br/><br/>Play Slots Era and enjoy:<br/><br/>- Free coins every hour in special Bonus Slot.<br/>- Huge payouts, Big Wins and atmosphere full of gambling.<br/>- Free spins, re-spins, bonus games, jackpots and more! Every Spin brings you Wins.<br/>- Regular updates with new exciting slots to explore.<br/>-  New Slot - new mechanics and unique quests inside.<br/>- Free Mode feature - play any slot you want without missions and bet limits!<br/>- Play the game Online or Offline.<br/>- Stunning graphics!<br/><br/>The best slot machines from the creators of Scatter Slots are so exciting! Our game is the only free online casino you'll need! Progressive jackpots, slots quest &amp; atmosphere full of gambling<br/><br/>What are you waiting for? Download now and get lucky!<br/>Spin the reel of luck and join million casino fans!<br/><br/>FROM THE CREATORS OF SLOTS ERA<br/><br/>This game is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling. Use of this application is governed by the Murka's Terms of Service. Collection and use of personal data are subject to Murka's Privacy Policy. Both policies are available at www.murka.com", "metacritic": null, "released": "2016-10-01", "tba": false, "updated": "2019-10-22T14:25:07", "background_image": "https://media.rawg.io/media/screenshots/45a/45a69196c0d87763737ad42731059f0d.jpg", "website": "http://murka.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Murka Entertainment"], "genres": ["Card"], "publishers": ["Murka Entertainment"], "esrb_rating": "Teen"}