{"id": 71773, "slug": "wwe-champions", "name": "WWE Champions", "name_original": "WWE Champions", "description": "Join 30 million wrestling fans and play the ultimate, action-packed WWE mobile game!  Battle with hundreds of Superstars both past and present, reigniting and reliving some of the most exciting rivalries in this unique puzzle RPG.  Compete in Singles, Tag Teams and Mixed Match Tag Team matches, featuring both the Men’s and Women’s Divisions.  Play solo or join a Faction, fighting your way to the top of the leaderboard in daily, weekly, and monthly competitions.  Enter the mayhem and feel the excitement of the WWE Universe!<br/><br/>**WINNER! 2018 Webby People's Voice Award (Sports Games)**<br/><br/>===GAME FEATURES===<br/><br/>WWE ROLE-PLAYING GAME ACTION<br/>* Use RPG skills to earn XP in this unique RPG Puzzle Battle Game<br/>* Win matches to customize moves and upgrade your team<br/>* Epic RPG gameplay lets you combine a variety of skills<br/>* Strategize! Pick the best Class to beat opponents. Choose from Technicians, Strikers, and more<br/><br/>COLLECT AND UPGRADE WWE SUPERSTARS<br/>* The Rock, Undertaker, Stone Cold Steve Austin and more all-time icons can join your team<br/>* Earn Macho Man Randy Savage, Andre the Giant, Ric Flair, and other Legends<br/>* Add John Cena, AJ Styles, Shinsuke Nakamura, and all of today’s top Superstars<br/>* Build a completely unique team with your all-time favorites<br/>* Hire Superstar trainers to boost teammate abilities<br/><br/>PVP BATTLES <br/>* PvP matches let you battle rivals worldwide<br/>* Versus Mode Mixed Match Dream Team matches add extra layers of strategy<br/>* Climb leaderboards for extra rewards<br/><br/>WELCOME TO THE WOMEN’S EVOLUTION <br/>* Collect top Superstars &amp; Legends like Ronda Rousey, Alexa Bliss, Asuka, Paige, and more!<br/>* Create Mixed Match Dream Teams like Charlotte Flair &amp; Ric Flair<br/>* Compete across all game modes in singles, tag team, and Mixed Match Tag Team matches<br/><br/>WWE EVENTS &amp; UPDATES<br/>* Join the WWE Universe in new weekly bouts and fighting game events<br/>* WWE Monday Night RAW and SmackDown Live themed battles<br/>* From WrestleMania to SummerSlam, play events inspired by the Pay-Per-View events<br/>* Enter monthly title events and recruit up-and-coming WWE Superstars<br/>* Travel The Road from NXT to arenas around the world<br/>* In-game events update every week to match on-air and Pay-Per-View schedules<br/><br/>MATCH 3 GAME. WWE MOVES<br/>* Match 3 pieces to obliterate rivals<br/>* Use signature WWE wrestling moves<br/>* The Rock’s Rock Bottom, John Cena’s Attitude Adjustment, AJ Style’s Styles Clash, and more are yours to control<br/>* Puzzle RPG combos and finishing moves<br/><br/>FACTIONS &amp; ALLIANCES, WWE STYLE<br/>* NEW! Faction Invasion events combine tactics, strategy, and Team PVP matches<br/>* Join a Faction to play with friends and to heal and help teammates<br/>* Strategize with alliance members in your own Headquarters<br/>* Exclusive Faction missions earn rewards and loot<br/><br/>VIPs - JOIN THE CHAMPIONS CLUB<br/>* Subscribe to the Champions Club Pass, WWE Champions exclusive premiere VIP service<br/>* Exclusive access to exclusive Triple H - King of Kings top-tier Superstar<br/>* Exclusive access to weekly content and special rewards<br/><br/>WWE CHAMPIONS, Champions Club Pass free trial will convert to a weekly subscription after 7 days. A payment of $2.99/week (or local equivalent) will be charged to your Google Play account when the subscription begins, and it will auto-renew weekly unless turned off at least 24 hours before the end of a subscription period. Renewal payments will be charged within 24 hours before the end of the subscription period, at a price of $2.99/week (or local equivalent). Unused portions of free trials will be forfeited upon purchase of a subscription. You can manage subscriptions and turn off auto-renewals in your device account settings.<br/><br/>Terms of Service: http://scopely.com/tos/<br/>Privacy Policy: http://scopely.com/privacy/", "metacritic": null, "released": "2017-01-25", "tba": false, "updated": "2019-10-22T14:00:30", "background_image": "https://media.rawg.io/media/screenshots/bf2/bf2eb9cbf3aadb103439012a3586b4c4.jpg", "website": "http://scopely.com/game/wwe-champions/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["Scopely"], "genres": ["RPG", "Puzzle"], "publishers": ["Scopely - Top Free Apps and Games"], "esrb_rating": "Teen"}