{"id": 71783, "slug": "solitaire-paradise-tripeaks", "name": "Solitaire Paradise: Tripeaks", "name_original": "Solitaire Paradise: Tripeaks", "description": "In a sunken shipwreck, Fanta has found a map to a hidden paradise which was never discovered by anyone. Play your favorite Tripeaks Solitaire Card Game to hop on a breathtaking adventure to a New Paradise!<br/><br/>How to Play<br/>-Solitaire Paradise is a brand new take, a brand new spin on the classic solitaire card game you enjoy!<br/>-Remove them by tapping on the cards that are consecutively one card lower or higher than the bottom card deck<br/>-Remove the starfish cards on the board to win each round!<br/>-A classic Tri Peaks Solitaire Card Game with simple rules, yet tricky to master!<br/><br/>Special Features<br/>-Solitaire Paradise is FREE TO PLAY!<br/>-You can use your cards to free the cards stuck to seaweeds!<br/>-Wish to save the poor fish caught in a net? Search for the crabs to help you!<br/>-The Rainbow Cards change numbers once you go past the given # of turns. It's up to you to remove them before it's too late!<br/>-The cards trapped inside the bubbles change spots once you have no remaining turns. Test your memory to approach the game strategically!<br/>-Want more coins to continue the game? Earn FREE rewards by completing each package!<br/>-You can enjoy Solitaire Paradise to its full extent even offline; there is no need for Internet connections!<br/><br/>Journey through the deep ocean with Fanta on an adventure that will surely have you rise to the top! Play Solitaire Paradise Now!<br/><br/>Need help? Have Questions?<br/>Please contact us at help@bitmango.com<br/><br/>Please Note<br/>-Solitaire Paradise can be enjoyed on mobile phones &amp; tablet PCs.<br/>-Solitaire Paradise contains ad-like banners, interstitials, videos and/or house ads.<br/>-Solitaire Paradise is free to play, however, you may purchase in-app items, such as Ad-Free &amp; hints.", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-07-31T06:25:36", "background_image": "https://media.rawg.io/media/screenshots/276/276502a03dffe2c2986844f040648bb5.jpg", "website": "https://www.facebook.com/bitmangogames", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["BitMango"], "genres": ["Card", "Puzzle"], "publishers": ["BitMango"], "esrb_rating": null}