{"id": 717930, "slug": "climate-manager", "name": "Climate manager", "name_original": "Climate manager", "description": "<p><strong>Which mek u happy, big clear sky go boom or rainee drip drop, perhaps snow mmm. Yammy. Weather change pepo mood yar. In this game you take control of the weather and become responsible for EVERYONES happiness, good luck :)</strong></p>\r\nHow to ween\r\n<p>The top right of the screen has a satisfaction percentage, If that hits zero, uh oh stinkyyyyyyy poopyy you lose. Above that is the days survived (basically your score). To keep them duds satisfied, fulfil their requests weather that's rain, snow or sunshine. </p>\r\nHow to fulfil requests\r\n<p>By hovering the sun over the water you can create beeg clouds and you can move them by dragging them (faster you swipe, faster the clouds move).</p>\r\nRain\r\n<p>Move the clouds over to the request and move the sun close to the clouds, this will allow the clouds to form rain.</p>\r\nSnow\r\n<p>Same as rain but move the sun away from the clouds</p>\r\nSun\r\n<p>Just move the sun over the requested area</p>\r\nWind\r\n<p>Click and hold your left mouse button while vigorously shaking your mouse over the requested area </p>\r\nExtra notes\r\n<ul><li>There is a cap to the number of clouds because the game can get really laggy.</li><li>The buttons above that saids \"Location / Options / View / Performance\" is just for decor.</li><li>Every so often natural wind will blow the clouds in a certain direction</li><li>There's no sound because I had little time left :(</li></ul>\r\nControls\r\n<p>The mouse is all you need, click on the sun to move it. Drag yo mouse and sway the clouds to your desired location.</p>\r\nSandvich\r\n<p>If you'd like to support me pls donate tf2 sandviches to my friend who has a sandvich collection https://steamcommunity.com/tradeoffer/new/?partner=369662404.</p>", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2022-01-03T05:58:10", "background_image": "https://media.rawg.io/media/screenshots/7db/7db273997b8c01760fa31acdfb205d7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JunBo"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}