{"id": 71792, "slug": "bubble-witch-3-saga", "name": "Bubble Witch 3 Saga", "name_original": "Bubble Witch 3 Saga", "description": "<p>Bubble Witch 3 Saga – A magical bubble shooting puzzle game from the makers of Candy Crush Saga.<br />\nThe newest bubble shooter game in the popular Bubble Witch series. Stella the Witch is back and she needs your help to defeat Wilbur in this exciting adventure! He may look cute, but he&#39;s full of magical mischief! Travel the realm bursting as many bubbles as you can in this bubble shooting puzzle game.<br />\nMatch bubbles with the unique aiming line that allows you and Stella to blast and pop with magical precision! Solve the puzzles and rescue the Fairy Queen in this explosive bubble shooting adventure.<br />\nTake aim and shoot your way through the levels to find the magic star dust Stella needs in order to rebuild her home destroyed by Wilbur!<br />\nThe only bubble shooter you will ever need! Take on this magical Saga alone or play with friends, burst their bubble by setting an all new high-score.<br />\nBubble Witch 3 Saga features:<br />\n• Match 3 bubbles to pop them in this magical puzzle shooting adventure<br />\n• Spellbinding game modes and cute characters!<br />\n• Release the owls, free the ghosts and save the Fairy Queen from Wilbur!<br />\n• Rebuild Stella’s house and visit your friends&#39; to get rewards<br />\n• Special boosters to help you pass those tricky levels<br />\n• Easily sync the game between devices when connected to the Internet<br />\n• Leader boards to watch your friends and competitors!<br />\n• A free &amp; easy to play bubble shooter, challenging to master!<br />\n• Available to play on iPhone and iPad devices<br />\nBubble Witch 3 Saga is completely free to play but some optional in-game items will require payment.<br />\nYou can turn off the payment feature by disabling in-app purchases in your device’s settings.<br />\nBubble Witch 3 Mini, a bite sized bubble shooter experience to play within iMessage. Play with friends to match and pop as many bubbles as you can to reach the highest score. Cute stickers to liven up conversations and make them more entertaining. Available on iOS 10 and above. Internet connection is required to play Bubble Witch 3 Mini.<br />\nBy installing Bubble Witch 3 Mini, you agree to download the main game Bubble Witch 3 Saga. Bubble Witch 3 Mini is completely free to play but some optional in-game items will require payment.<br />\nYou can turn off the payment feature by disabling in-app purchases in your device’s settings.<br />\nVisit https://care.king.com/ if you need help!<br />\nFollow us to get news and updates:<br />\nhttps://www.facebook.com/bubblewitch3saga<br />\nhttp://www.youtube.com/c/Bubble_Witch<br />\nhttps://www.instagram.com/bubblewitchsagaofficial/<br />\nhttp://www.twitter.com/Bubble_Witch<br />\nStart the bubble bursting experience today!<br />\nHave fun playing Bubble Witch 3 Saga!</p>", "metacritic": null, "released": "2017-01-11", "tba": false, "updated": "2019-12-04T11:34:06", "background_image": "https://media.rawg.io/media/screenshots/fce/fcebe86af31b018077946d7ed20e1032.jpg", "website": "http://bubblewitch3saga.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["King"], "genres": ["Puzzle"], "publishers": ["King.com"], "esrb_rating": null}