{"id": 717975, "slug": "lootrons-1982", "name": "LOOTRONS 1982", "name_original": "LOOTRONS 1982", "description": "<p>Choose and click fast to rescue your lootrons from the system while vibing out to a pulsating original chiptune soundtrack! </p><p>LOOTRONS<strong>™</strong> 1982 is a different kind of click fast, puzzle strategy game from a different time period, where most of your decisions have to be made in about 10 seconds or less.  NO hand holding on directions or how to play. Each level you play is created as soon as you complete or fail your current level.<br/></p>\n<p>If you plan your strategy right, you can make a level last for a few minutes or more. You must be fast on the accurate clicks or taps. </p>\n<p>There are 3 play modes, but 2 of them are more for getting used to how to play the game (infinitely) and never really end, or have true \"Game Over\" states.<br/><br/>Explore and try different things to figure out how YOU want to play the main mode (3 layered PLAY icon) and get your high score! Scores are locally saved only.  <br/></p>\n<p>This was a hard project to get finished that started as an experiment/prototype, and grew from there. Drawing, writing, programming, designing, recording, composing, sequencing, testing and more 10 minutes here, a few hours there while developing the game over 6-7 years when I could find time and be in creative mode mentally. Please see the additional files that were included with the download of the game.<br/><br/>I hope you enjoy some of my game design drawings and writings in the included screenshots on this page. Some stuff is accurate and some stuff is WAY off. Do not consider the drawings as 100% helpful. I wanted to show you all how it has progressed over the years. </p><p><strong>- About the Creator:</strong></p><p>I have done tech support, quality assurance testing, and game design for Electronic Arts, Perfect World, Cryptic Studios, Runic Studios and 5th Planet Games in my former career. </p><p>I have always been drawing and designing inventions and games since I was a little kid. The movies TRON and The Last Starfighter helped inspire me to want to make little worlds to play in. It continues to be one of my main hobbies! <br/></p><p>I enjoy playing indie games on Switch, Steam and PS4. The 3ds was my main for many years.</p><p><strong>#MadewithFusion<br/></strong><em>Some of the features I am proud of, and taught me a bunch of lessons whether I wanted them to or not:</em><br/></p>\n<ol><li>Layers and collisions can be painful and some of the glitches became actual gameplay.\r\n</li><li>There are over 700,000 possible procedurally generated levels in each of the 3 modes.\r\n</li><li>Each time a new level begins in a mode, it picks 1 of 4 different songs to play. Those 4 songs are unique to each mode.\r\n</li><li>Sound effects and music volumes. Still not perfect but much better than they have been.\r\n</li><li>So  much music composition, sequencing, designing, drawing, animating,  writing, editing. Was fun to change arts when I got frustrated working  on other stuff.\r\n</li><li>Each pixel is hand made my me and  animated, with the exceptions of visual effects skewing and stretching  by some of the background extensions.\r\n</li><li>I worked within  the self inflicted design constraints of it being an unreleased arcade  game that used to be a two sided standup \"touch screen\" arcade game that  used two Zilog Z-80 processors in 1982. I tried to keep the color  palette, animation, SFX and music within that era as much as I could AND  kept it under 150MB so far. \r\n</li></ol>\n<p><em><strong><br/><br/>Storied history</strong> of how we got to this point with the LOOTRONS projects...</em></p><p><em>Back in the 1960s, a company from Japan had some machines and business in the USA and had contracted out development of several games that were developed in the Appalachian Mountains in Tennessee by a lab team there. This was done in secret as a cooperative arrangement with certain g-mint acronym organizations.  These developers, engineers, artists, and technicians had  \"bunker vaults\" that were inside deep caves to securely work in.  My father was one of these \"Signers\" who created and helped create many interactive/entertainment projects and \"green ops\" projects with a small team.</em></p>\n<p><em>The company had invested a good amount of money to try and get more development done in the states, for easier manufacturing, time to market, and distribution. This allowed them a slight edge over their competitors in the United States and Europe to making something new and getting out there for people to pump money into in the States. <br/><br/> Never mind the fact of what some of the departments worked on that WAS NOT game and entertainment related.  This arrangement was successful for all parties involved but some of the technology was scary, weird, different...<br/></em></p>\n<p><em>Competition was super fierce at the time, yet the seeds of over saturation in the home video game market was starting to bare more fruit. Some of the declining sales  hit the arcade game industry for them too. In a cautious move, after sinking hundreds of millions into their secret Research &amp; Development facilities across the Earth, the company decided to shelve the majority of their projects indefinitely, and had many of the facilities shut down in October of 1982.  Many of the \"green ops\" projects with the acronyms of control were taken off-site.</em><br/></p>\n<p><em>At the Tennessee location, above ground was left to be grown over, yet the fences and property was kept clean yet lifeless for decades.  Several years ago, some research was done by Hatcher Technomantics<strong>™</strong>, and we got in contact with the trust &amp; investment group, with whom many that are currently in Japan, Peru, Romania, Siberia, India, &amp; Iceland didn't even know they were still paying for the land and \"house\" on the property through a trust in the States.  Good thing no one knew what was really underground, or they would have been paying A LOT more money for upkeep all this time. ;)<br/><br/>Forward to the present, and there are tons of intellectual properties (IPs) sitting in various states of completion in these \"vaults\". Arcade machines, cabinets, ROMs, gamepads/controllers, motion devices, motherboards to who knows what, holographic/digital and analog displays we haven't seen before, weird optical and sound  technologies, electrostatic &amp; energy inventions, and MANY forms of coded works that are still accessible. I wish we could show you, but that isn't part of our \"Creative Exploration  Agreement.\"<br/><br/>There are some rumored off-world locations where packages were jettisoned to for future generations, but we are still seeking out the trajectories and contents of those packages. <br/></em><em>We unfortunately can't show you any of the original creations from the vaults, <strong>but we are allowed</strong> to reverse engineer, update, modify, commercialize, re-purpose with different hardware and/or designs, be inspired by, etc; things in the vaults. There are some fine lines we have to stay within, and we will be working on a per-project basis to make sure their requirements are adhered to. We are also constantly adding new IPs to Hatcher Technomantics each week. <br/></em><br/><em>LOOTRONS 1982 is one of these projects. We have done our best to modernize it to work with regular displays, aspect ratios, and input devices. The original arcade game prototype has a multi-depth, two-sided, semi-transparent touchscreen which makes playing it standing up more intuitive but, hard to describe.</em><br/><em>We agreed to all of this so that we can get these weird, crazy, and sometimes fantastic intellectual properties released  into the wild for all of YOU. We hope you enjoy them 8)</em><br/><br/>All images, sounds, music, game design, logos, promo material are created by myself and are Copyright 2015,2018, 2021 Joseph Hatcher Technomantics. Exceptions listed below.  3d model made for me by Jabe Hatcher from my drawings. <br/></p>", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2022-01-03T06:09:34", "background_image": "https://media.rawg.io/media/screenshots/08a/08a7344aa981b154eba9bb42403a03de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hatcher Technomantics"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}