{"id": 717987, "slug": "lost-in-wonderlustb", "name": "Lost in Wonderlust(β)", "name_original": "Lost in Wonderlust(β)", "description": "<p>W:Up  / S:Down</p>\n<p>A: left / D: right / Space:jump</p>\n<p>Please wait patiently for the first loading.</p>\n<p>Please use Google Chrome to play.</p>\n<p>Please use Jampu to avoid getting caught by obstacles.</p>\n<p>Introduction</p>\n<p>Lost in wonderlust\" is a privately produced game that we started developing on April 1, 2021.</p>\n<p>### Aiming to be a communication tool for parents and children to play and learn together ###</p>\n<p>Lost in Wonderlust\" is a simple action game in which a five-year-old girl named Ringo (tentative) takes a train to her destination, \"Yoruhana Kusayashiki\". She learns the essence of life from the things she encounters along the long road, paying attention to the signs at the stations and figuring out which station to get off at. The game is designed for parents and children to work together and enjoy the gameplay, sometimes with action, sometimes with puzzle solving.</p>\n<p>### A heartwarming story that focuses on the relationship between parents and children. </p>\n<p>### A heartwarming story focusing on the relationship between parents and children. If children are raised by negative parents who constantly tell them that they can't do something anyway, they will be negative and afraid to try. On the other hand, a supportive parent will make the child curious and willing to tackle anything. But how much are we usually aware of this? As a parent raising a child myself, I often feel self-conscious about whether I am unconsciously using such words.</p>\n<p>As a parent raising a child, I often feel self-condemned. I hope that through the story of this game, parents and children will be able to look at each other's usual words and actions, how they relate to each other, and what they should be doing, as well as revitalize communication between parents and children.</p>\n<p>In April 2021, the author suddenly decided that she wanted to make a game for her three-year-old daughter! I downloaded Unity that day, and here I am. I've never been involved in game production before, nor have I ever done any programming in C# or any classical design work (graphics or polygon modeling). Please support me if you can!</p>\n<p>Title: Lost in wonderlust (Lost in Wonderlust)</p>\n<p>Platform: iOS, Oculus Quest</p>\n<p>Release history: Beta version released on December 31, 2021</p>\n<p> #unity3d #unity #first time creating a game #morning activity #early bird challenge #game play</p>", "metacritic": null, "released": "2021-12-31", "tba": false, "updated": "2022-01-03T06:12:16", "background_image": "https://media.rawg.io/media/screenshots/8f5/8f5fb3628f806f2f981ac3666b89f048.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SHISHISHI"], "genres": ["Action"], "publishers": [], "esrb_rating": null}