{"id": 71805, "slug": "big-fish-game-finder", "name": "Big Fish Game Finder", "name_original": "Big Fish Game Finder", "description": "Discover new Big Fish games for your iPad or iPhone – plus, find helpful and in-depth strategy guides and be the first to know about new releases and special deals, all with one app! Big Fish is THE place to find the best high-quality, immersive puzzle, mystery, and hidden object games. <br/><br/>Looking for new iPad or iPhone games?  Find new favorites or rediscover classic series with the Big Fish Game Finder.  Search through a catalog of over 700 games and be the first to know about new releases and sales on hidden object and puzzle games including the popular Dark Parables, Lifeline, Mystery Case Files and Christmas Stories series.  With the Big Fish Game Finder, you are instantly connected to hundreds of the games in the Big Fish catalog for your mobile devices, with new games released every week.<br/><br/>• Discover the best new games for iPad and iPhone<br/>Try new games every week! You'll always find awesome new games to love. Search, browse, and sort the ENTIRE Big Fish catalog for any device and in any genre – hidden object, adventure, solitaire, gem, and jewel match 3, word, strategy, time management, card &amp; board, and more.<br/><br/>• Find the best deals and special promotions on the 'Deals' tab<br/>Whether you're buying games on the App Store or at BigFishGames.com, use Game Finder to access current sales. New special deals and promotions pop up all the time. Check out the Deals tab every day to see the new Daily Deal.<br/><br/>• Master our Free Games<br/>Big Fish has one of the largest catalogs of Free Games across the most popular genres: Match 3, Puzzle, Casino, Solitaire, Hidden Object and Role-Playing games.  Enjoy some of our most popular games including:<br/><br/>* Gummy Drop! – Stop crushing and start squishing in this candy-themed match 3 game.  Solve 1000s of addictive puzzle levels as you rebuild famous landmarks around the globe.  Collect passport stamps from Sydney to Cairo to Paris, build ports to send resources to new cities!<br/><br/>* Big Fish Casino – Enjoy the thrill of Las Vegas with the #1 Free to play Casino app in the world.  Play Slots, Blackjack, Roulette and Poker live with your friends.  Choose from over 90 slots, including Classic Slots, Jackpot Slots, and Scatter Slots.  Play in tournaments, collect chip bonuses every 30 minutes and more!<br/><br/>* Fairway Solitaire – A twist on classic card games, Fairway Solitaire contains hundreds of hand-crafted levels to solve.  If you love puzzle, strategy, and logic games that challenge your brain, you’ll be addicted to the unique card layouts and special “hazards” that you won’t find in standard card games like Pyramid, Klondike or Spider solitaire.  Try the #1 Solitaire game in the App Store for 2+ years!<br/><br/>• Use 'My Games' to track and personalize your game list<br/>See all Big Fish games that you currently or previously have installed on your device.  Sort, rate, share, add game notes, and easily reinstall games all from one place.<br/><br/>• Search or browse helpful and in-depth Strategy Guides for FREE<br/>Follow our crystal clear instructions and helpful tricks to get you through the rough spots in mini-games, hidden object scenes, puzzles and more. Written by our knowledgeable Game Experts, each guide comes with large, detailed screenshots and fantastic descriptions.   New game guides, FAQs, and how-to videos are added on a regular basis to keep you enjoying more of the games you love.   <br/><br/>*** Want even more from Big Fish?? ***<br/><br/>Sign up for our newsletter and never miss a new release or promotion again: http://bigfi.sh/iSplashNewsletter<br/><br/>Join the community on Facebook: http://www.facebook.com/BigFishGames<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter<br/><br/>Watch us on Youtube: http://bigfi.sh/BFG-YouTube<br/><br/>Read gaming related articles on our Blog: http://www.bigfishgames.com/blog", "metacritic": null, "released": "2011-05-01", "tba": false, "updated": "2019-07-29T10:55:43", "background_image": "https://media.rawg.io/media/screenshots/bda/bdadaab69cc81bf50d0d88ee6cff288c.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Teen"}