{"id": 718195, "slug": "idling-idol", "name": "Idling Idol", "name_original": "Idling Idol", "description": "◆Raise up idols by idling!<br/>The basis of the game rule is  Idling!<br/>Idols grow up over time.<br/><br/>① Let's decide the name of the idol group!<br/>② Let's choose an idol at the audition!<br/><br/><br/>③ Start training and work with the whole group!<br/>Collect fans and earn money.<br/>When an event occurs, the idol's ability will increase.<br/>And it is also important to take a rest when idls are tired!<br/><br/><br/>④ Use the money you earn to buy health recovery items and strengthen your training facilities.<br/>A fulfilling training environment is indispensable for raising top idols!<br/><br/><br/>⑤ A live concert will be held when the funds are saved!<br/>The way customers enter depends on the number of fans in the entire group.<br/>Let's aim to hold the idol's dream, \"Dome Live\"!<br/><br/><br/>⑥ Training is completed in 4 seasons of spring, summer, autumn and winter, and 1 year of activity!<br/>The idol rank is determined by the funds earned by the group!<br/><br/><br/>⑦ And to the next training ...!<br/>There is no end to idol group development!<br/><br/><br/>◆The one and only idols<br/>Idols have random names, appearances, stats, and personalities.<br/>It is automatically generated by AI during the audition.<br/>Is the criterion for selecting members of the group your favorite appearance or ability score?<br/>Choose the one and only idol and raise it to become a top idol!<br/><br/><br/>◆Gameplay where the same thing never happens again<br/>Depending on the random element, you can enjoy different developments each time you play.<br/>・ All idol appearances and stats are random<br/>・ Randomly generate advantageous training effects for each season<br/>・ Events that fluctuate idol stats and physical strength occur randomly<br/><br/>There is no absolute answer for idol training.<br/>As a producer, always be flexible!<br/><br/>◆language<br/>Supports Japanese and English<br/>You can switch from the config button on the title page.<br/>", "metacritic": null, "released": "2022-01-06", "tba": false, "updated": "2022-01-07T04:02:06", "background_image": "https://media.rawg.io/media/screenshots/005/005834f66eb480ff76023b3c0f3b372b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EXAMGAMES"], "genres": ["Simulation"], "publishers": ["EXAMGAMES"], "esrb_rating": null}