{"id": 71815, "slug": "dark-strokes-sins-of-the-fathers-collectors-editio", "name": "Dark Strokes: Sins of the Fathers Collector's Edition HD", "name_original": "Dark Strokes: Sins of the Fathers Collector's Edition HD", "description": "Try this immersive, high-quality game for FREE! Then continue the adventure with a ONE TIME unlock! <br/>NO VIRTUAL ITEMS, NO INTERRUPTIONS… you’ll OWN this game for life. <br/><br/>Guide Ethan as he attempts to rescue his future bride from the terrifying menace known as the Faceless Ones in Dark Strokes: Sins of the Fathers! Brought to you by Big Fish, the world's #1 Publisher of Adventure games.  When faced with the fate of the people you love, what will you do to thwart the supernatural evil powers lurking within Dark Strokes. Help Ethan find his lost love in this Hidden Object Puzzle Adventure game as he reckons with a decimated city and evil forces to search for clues. Can you peel back the layers of this chilling supernatural mystery? <br/><br/>TRY IT FREE, THEN UNLOCK THE FULL ADVENTURE FROM WITHIN THE GAME!<br/><br/> Features <br/><br/>• Explore the supernatural <br/>• Test your hidden-object finding prowess in a decimated city <br/>• Majestic graphics and invigorating sounds <br/>• Help Ethan save his bride to be <br/><br/>• Unlock the Collector's Edition to get exciting extras like:<br/>--Bonus gameplay <br/>--Integrated Strategy Guide <br/>--Concept Art <br/>--Character Bios <br/>--Wallpapers <br/>--Game music <br/>--Game videos <br/><br/>Discover more from Big Fish Games! <br/><br/>Sign up for Big Fish Games' iSplash newsletter and keep up-to-date on sales or new promotions. Sign up at: http://bigfi.sh/isplash <br/><br/>Having fun with Big Fish? Check out our entire game library with our Game Finder app! Dive in here:<br/>http://bigfi.sh/bfggamefinder<br/><br/>Big Fish is the leading global marketplace to discover and enjoy casual games. You can enjoy our virtually endless selection of games anytime, anywhere — on your PC, Mac, mobile phone, or tablet. Learn more at bigfishgames.com!<br/><br/>Follow us on Twitter: http://bigfi.sh/BigFishTwitter <br/><br/>Become a fan on Facebook: http://www.facebook.com/BigFishGamesMobile", "metacritic": null, "released": "2012-12-31", "tba": false, "updated": "2019-07-29T10:55:57", "background_image": "https://media.rawg.io/media/screenshots/d41/d41fae60a34338a50d5dfd5ec00b71a5.jpg", "website": "http://www.bigfishgames.com/mobile-games/ios-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}