{"id": 718138, "slug": "day-on-mars", "name": "Day on Mars", "name_original": "Day on Mars", "description": "A Day on Mars is a story spanning several hours, with many sex scenes along the way. The journey follows a man who, with loss of memory, finds himself on Mars, surrounded by pretty girls. A team of repairmen arrives at an abandoned Martian station, which must be prepared for the arrival of the colonists. But on the very first day, the main character loses his memory... But this is not the worst thing. The girls from the repair crew begin to behave strangely. They become more and more obscene... until they finally break free and pounce on the protagonist. Will the hero be able to resist the attacks of the girls and find the reason for such strange behavior before he gets fucked...<br/><br/>You will play as the main character Jacob. Which should help beautiful partners to restore the station, as well as satisfy them. As the plot develops in the game, you will gradually discover more and more new scenes with girls.<br/><br/>You must <strong> explore </strong> and restore an abandoned station on Mars. Complete <strong> various tasks </strong>, advance on <strong> non-linear storyline </strong>, complete <strong> mini-games </strong> and <strong> \"build\" relationships </strong> with your <strong> lovely comrades </strong>. And besides, you have to solve <strong> the secret of the station </strong>.<br/><br/><strong> Features </strong><br/>A complete, fun and unexpected storyline.<br/>Full 3D characters with interesting animations.<br/>Multiple dialogue options and text systems for non-linear storytelling.<br/>Realistic natural environment, fully thought out open 3D world.", "metacritic": null, "released": null, "tba": false, "updated": "2022-01-07T03:24:45", "background_image": "https://media.rawg.io/media/screenshots/f1b/f1b90b924de86045722ab7ade1e247ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["One Hand Games"], "genres": ["Adventure", "Indie"], "publishers": ["ONE HAND GAMES"], "esrb_rating": null}