{"id": 71812, "slug": "midnight-castle-mystery-game", "name": "Midnight Castle - Mystery Game", "name_original": "Midnight Castle - Mystery Game", "description": "A dark mystery full of hidden objects is here!<br/><br/>Adventure beyond the gates of a mysterious castle to discover a story rich with enchantment and thrilling secrets.   Explore what lurks in the Mystery Chamber and save the fate of the Midnight Castle!<br/><br/>• STUNNING VISUALS AND SPOOKY CHARACTERS!<br/>Meet a new character in every scene! From the beautiful royalty, to menacing dragons and trolls, experience a world of wonder! Your quest will lead you through dark passages and down illuminated paths!<br/><br/>• PLAY FOR FREE! <br/>Start searching for magical items now! Unveil mysterious treasures and use your coins and diamonds to unlock more fantastic locations. Stock up your inventory, or sell glorious relics for more currency! Want to speed up your journey? Coins and diamonds are always available for purchase.<br/><br/>• CRAFT INCREDIBLE ITEMS TO HELP YOUR QUEST!<br/>Use items you find on the castle grounds to craft exquisite relics, potions, and poisons! Craft as many as you can and be rewarded each time!<br/><br/>• ENJOY THE FANTASY WITH YOUR FRIENDS!<br/>Play with all your friends, even sign in with Facebook! Share gifts and wish lists, and help your friends get items they need to move on. Now it pays to connect! The more friends you have, the more gifts you will have to open!<br/><br/>Follow the adventure on Facebook! Stay connected for exciting news and details on the story!<br/><br/>https://www.facebook.com/midnightcastle<br/><br/>Please Note: Midnight Castle currently supports iPhone 4S or above, iPad Air, and iPad 2 or above, running iOS 8 or above.<br/><br/>**************************************************<br/>Mama56 by Mamaloveydove <br/>This, by far, has been the most entertaining and fun game I have played. Not complicated and brings a sense of accomplishment as you achieve more and open new hidden object sites. Thank you . This sure beats housework :)<br/><br/>Midnight Castle Review by Big mama jessie <br/>A very fun game! Lots of mini-games with hidden objects to fine. Lots of imagination and fine artistry in the scenes and objects found. Love it!!<br/><br/>Midnight castle by Northern will <br/>This is an amazing game to use your eyes and memory to find objects and progress to the next level. Lots of fun!", "metacritic": null, "released": "2014-03-19", "tba": false, "updated": "2019-07-29T10:55:43", "background_image": "https://media.rawg.io/media/screenshots/1b6/1b65d53b0935ce36c6d1142759b1394e.jpg", "website": "http://www.bigfishgames.com/mobile-games/ipad-iphone-android/5489/midnight-castle/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Big Fish Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Big Fish Games"], "esrb_rating": "Everyone 10+"}