{"id": 7181, "slug": "trainz-simulator", "name": "Trainz Simulator", "name_original": "Trainz Simulator", "description": "Build and operate the railroad of your dreams in an incredible 3D world. Choose either easy or realistic driving modes, and take charge of your favorite trains from around the world. <br/><br/>• #1 Ranked Overall iPad App in 20 countries including USA, UK and Australia<br/>• Top 5 Ranked Simulator iPad App in over 100 Countries<br/><br/><br/><br/>With Trainz custom built input system to get the most out of the iPad’s touch functionality you’ll find driving Trains, laying tracks, creating layouts and completing scheduled tasks a breeze. Trainz Simulator is is packed full of content, routes and sessions and is a world first for iPad!<br/><br/>Everything you need to build and operate your own dream railroad is included. You can build a fun layout in minutes, faithfully recreate a railroad from days gone by or develop a fully fledged prototypical route; the choice is yours.<br/><br/>• Touch input makes driving Trains, laying tracks, creating layouts and completing scheduled tasks a breeze.<br/>• More Accessible! Take Trainz with you anytime, anywhere.<br/>• Drive Loads of Trains.<br/>• Operate a complete working rail line.<br/>• Build and customize your own living railroad using our advanced route creation tool called “Surveyor”.<br/><br/>************************************************************<br/>Comments from Trainz iPad users:<br/><br/>Trainz is now available on the iPad – OMG, what a great app to have with you on the road or stuck somewhere.<br/>- Jon Peddie<br/><br/>...allowing your fingers to directly select, move and manipulate objects and landscapes on the screen. The process is actually akin to artistry as you glide, slide and stretch the on-screen elements in an effort to create your own masterpiece.<br/>- James Woodcock<br/><br/>it&amp;#39;s amazing what you can do. I created this mountain layout entirely from scratch. I shaped every mountain, placed every tree, laid every track, and painted every texture. This is just scratching the surface of the library of objects you can choose from. None of it is cookie-cutter. It&amp;#39;s all user-controlled. Heck, even if you aren&amp;#39;t into trains, if you like creating cities or nature scenes or whatever, you can get totally engrossed in this app.<br/>- MacRumours.com Forum, redman 042<br/><br/>I was so surprised at the level of detail in this game. Very responsive, lots of options, great map creator and overall nice way to show what the iPad can do.<br/>- iTunes app store review, Sonicfidelity<br/><br/>----------------------------------------------------------<br/>Improvements for Version: 1.2:<br/>------------------------------<br/>- Extra Content now has free and paid options<br/>- Navigational Waypoints that show in 3D world<br/>- Improved message pop-ups<br/>- numerous minor bug fixes<br/>Please ensure your iPad firmware and operating system are up to date.<br/><br/>Trainz iPad Update Version: 1.1.1<br/>-----------------------------------------<br/>What&amp;#39;s new in this version?<br/>- Streamlined touch input for even greater user control.<br/>- Improved lighting features.<br/>- Added new weather conditions, now you can drive through rain and snow!<br/>- New content menu, allowing you to upload your own routes and download ones by made by your friends!<br/>- New controls that allow users to set the time of day and weather conditions.<br/><br/>iPad 2 additional features<br/>- Even more advanced lighting options.<br/>- New weather condition: Fog.<br/>- Weather conditions now react to other environment conditions.<br/>- Advanced water effects.<br/>-----------------------------------------------------------------", "metacritic": null, "released": "2010-12-04", "tba": false, "updated": "2019-07-30T11:03:26", "background_image": "https://media.rawg.io/media/screenshots/839/839c5d42da0b0581b0fd86203c86bc55.jpg", "website": "http://www.trainzmobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android", "iOS"], "developers": ["N3V Games"], "genres": ["Simulation", "Casual", "Family"], "publishers": ["N3V Games"], "esrb_rating": "Everyone 10+"}