{"id": 718264, "slug": "sinners-and-saints", "name": "Sinners and Saints", "name_original": "Sinners and Saints", "description": "<p>You live in Deadwood, an old town forgotten by the world, as it is isolated by thick forests, a river and a mountain. It is one of those places that trap their residents, if you don’t get out as youth, you will likely never leave. It also has the reputation for attracting the weird and morally questionable. You had the misfortune of being born here, not only that — you work here as a detective. Granted, you only got the job a year ago or so, but you are the authority.</p>\n<p>Now, many things start to happen all at once. Your best friend is acting more and more strange, an attractive and charming stranger moves into the town and starts to fund the mayor’s projects and takes an interest in your division. Your criminal informant is keeping secrets from you. You’re assigned a partner — one that would rather claw your eyes out than say ‘hi.’ A old friend from your past comes rocking your world in the most unpleasant way, and as strange murders start taking place — a vigilantecomes to clean up the streets by any means necessary. The cherry on the top is when your captain orders you to take on a consultant on the case - the local psychic - whose first words to you make the whole world spin.\r\n</p><p>Work the case of strange murders, with the help of unlikely allies. Find the secrets of the newcomers and old friends from Deadwood and your own -- one you didn’t even know you had. Discover the second side to your home town, one that you never saw before. Choose what kind of detective will you be; one who bends the rules, or follows them. Romance any of the seven characters, or make them your friends, rivals or enemies. (You can select the gender of each RO.)</p>", "metacritic": null, "released": "2022-01-06", "tba": false, "updated": "2022-01-07T04:25:09", "background_image": "https://media.rawg.io/media/screenshots/9a9/9a931c6d8af6ce86925308503c3fe490.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lin"], "genres": [], "publishers": [], "esrb_rating": null}