{"id": 718230, "slug": "sphere-o-path", "name": "SPHERE O PATH", "name_original": "SPHERE O PATH", "description": "<p><strong>WORK IN PROGRESS.  PLAYABLE TO LEVEL  8.</strong></p>\n<p>LEVEL 9 was  just started</p>\n<p>LEVEL 10 was use for various test  so it pretty much a empty level.</p>\n<p><strong>Major need of work:</strong></p>\n<p>It definitely need more level. The game difficulty  per level is so gradual that  it feel like a tutorial until level 5. So yeah. It totally need more level.<br/></p>\n<p>As of right now there's sound that stick  even tho  it should of died.<br/>Will make sure to end  this none sense in the next build.</p>\n<p>StatsGUI  is not accurate on death player, Red code on death player and operator on death player. Other stats in the Stats GUI should work as intended.  No impact in gameplay. I probably will modify the look of it so it's more understandable .<br/></p>\n<p>Menu with settings but only the option for fullscreen work.(The  option for fullscreen is not enable and you start fullscreen so there's that to rectify) It a mess. Don't bother.<br/></p>\n<p>Music  but nothing to be hype about.  Use  various music i made over the years. I messed up the speed  so everything sound  a little weird. I made a mute button just in case .(In Pause Menu)<br/></p>\n<p><strong>DESCRIPTION CORE MECHANIC:</strong></p>\n<p>SPHERE O PATH IS A HYBRID RUNNER GAME. YOU PLAY AS A SPHERE AND YOU  TRAVERSE YOUR WAY TO THE END. <br/></p>\n<p>Instead of jumping over obstacles  vertically  or dodging obstacles horizontally. The player will fall continuously and need to dodge obstacles in all axis.<br/>You may halt the continuous fall by floating.(Ability)<br/>Almost forgot to mention. The continuous  fall act like gravity will do. The momentum will keep growing gaining speed in free fall.  To  survive the player will have no choice but to use float to survive and/or various else ability.<br/><br/></p>\n<p><strong>HOW TO PLAY:</strong></p>\n<p>Movement Control with W,A,S,D</p>\n<p>Space Bar to Float</p>\n<p>LeftShift for Turbo</p>\n<p>Slowdown time with F</p>\n<p>Rewind time with R</p>\n<p>Change Camera Distance with C or  Scroll Wheel<br/></p>\n<p>Change Style of  Follow Camera with V Classic/Pro</p>\n<p>Q and E do nothing as of now. But my goal is to add a new Ability<br/>if you got any suggestions on what should that ability is comment it down below.<br/></p>\n<p><strong>BASIC GAMEPLAY:</strong><br/></p>\n<p>Avoid getting in contact with red code or operators. Finish the level before time run out.</p>\n<p><strong>COMPLEX GAMEPLAY :</strong><br/></p>\n<p>the  timer countdown.</p>\n<p>I was not to keen on making this game with a scoring system in mind.</p>\n<p>So i made something different with a countdown system that change overtime with some RNG involve.</p>\n<p><strong>Death:</strong></p>\n<p>Death progression on countdown.</p>\n<p>Dying for the first time will activate a countdown of 5 minutes.</p>\n<p>Dying 2 to 5 time will reduce the countdown time for 15 seconds each death.</p>\n<p>Dying 6 to 10 time will reduce the countdown time for 30 seconds each death.</p>\n<p>Dying more then 11 time will reduce the countdown time for 1 minute each death.</p>\n<p><strong>Particle Hit:</strong></p>\n<p>Every particle that hit a red code have a chance to do (only if countdown was activated(1 death))</p>\n<p>It will take 5 seconds before every chance will begin. Only one demand at a time. If the red code denied entry it will be ready for another chance.</p>\n<p>70% chance to denied entry inside Red code. Reducing time for 5 seconds.</p>\n<p>Ready for another attack.</p>\n<p>20% chance to get entry inside Red code. Will self destruct and Add time for 15 seconds.</p>\n<p>10% chance to get entry inside Red code but the system defense got inform of the deed.</p>\n<p>Sending a Operator to replace the self destructed Red code and Add time for 10 seconds.</p>\n<p><strong>On Contact With:</strong></p>\n<p>Contact With Red code will self destruct contacted Red code and reduce time for 15 seconds.</p>\n<p>Contact With Operator will self destruct contacted Operator and reduce time for 15 seconds.</p>\n<p>Operator on Operators. Will self destruct and Add time for 15 seconds each Operator self destruction.</p>\n<p>Operator on Redcodes. Will Self destruct and Add time for 15 seconds each Red code and Operator self destruction.</p>\n<p>Operator on Wall, Bounce and Glue. Will Self destruct and Add time for 15 seconds.</p>\n<p><strong>Why a Runner Game:</strong></p>\n<p>I know the runner genre is over saturate . The game was mostly created to get up to speed with C# without having to search every little code i wanted to add. I used Brackeys tutorial on the runner game for the base project.  It was easier to add new  idea over the same project following  other tutorial. I tried creating project before  looking at Brackeys tutorial to no avail. I kept getting stuck in the smallest detail.</p>\n<p>After getting the base started something weird happens. My mind could not comprehend the code in front me. I couldn't even see what my script did and why. I was  in a blank state. After revisiting all my script one by one and understood what was happening. It was a much easier ride to push more idea into the game without some invisible hand  telling me what should i do next.</p>\n<p>Since the idea wasn't really about making a game but learning how to make a game. <br/></p>\n<p>Ill keep  working on it hence why it still in  In development  to keep me updated while i start new projects.</p>\n<p><strong>IN DEVELOPMENT:</strong><br/></p>\n<p>Will it differ from what it is now. Highly doubt it.  It will be more about making it bug free as possible, make more level  and finish the settings menu. I may add new thing but the core mechanic/gameplay &amp; models wont change.</p>\n<p>Don't be afraid to give suggestions . If i find the idea excellent  i could change my mind on not changing any core mechanic/gameplay or models.</p>\n<p>If my game is publish online  for the most part is to receive objective criticism. For me that is a necessary step and is really important. It give me perspective on how  to keep going with my projects.<br/></p>\n<p>GOOD LUCK!<br/>AND  HAVE FUN!<br/></p>", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-07T04:17:06", "background_image": "https://media.rawg.io/media/screenshots/6a9/6a90ad036c266e437be02e8308dde0eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Digressive"], "genres": ["Action"], "publishers": [], "esrb_rating": null}