{"id": 718206, "slug": "fuchian-chronicles", "name": "Fuchian Chronicles", "name_original": "Fuchian Chronicles", "description": "“First contact never ends well for the less advanced civilization.”<br/><br/>In the hundred years since the Galactic Fuchian Empire began its interstellar expansion, it has always been the more advanced civilization. Now, for the first time, the Empire has encountered another spacefaring species on par with theirs. After a disastrous first contact, conflict between the two civilizations seems inevitable. Facing an uncertain future, Kimi, a young cadet in the Empire, must navigate the harsh realities of war.<br/><br/><br/>-\tSelectable battle system: Choose between Active Time Battle, Conditional Time Battle, and Traditional Turn Based combat systems.<br/>-\tGround and space combat: Fight on foot and command starships against enemies of the Empire.<br/>-\tSkills and abilities based on equipment: Swap weapons and equipment for abilities that suit your needs.<br/>-\tCrafting on the go: Collect materials in the field and use them to craft various supplies as needed.<br/>-\tNo grinding for exp: Defeated enemies only give material for crafting, and instead you “level up” and gain stats based on story progression.<br/>-\tNo random encounters: The majority of combat encounters is represented on the map and can be avoided if you don’t want to fight them.<br/>-\tChoices matter: Your actions, and inaction, may affect the outcome of the story and lead to bonus rewards, or unexpected consequences.<br/><br/>PLEASE NOTE<br/>The above is a list of all the features currently in game, additional features may be added as development continues. The story of Fuchian Chronicles is incomplete while in Early Access. New chapters will be released every few months with the price of the game increasing gradually as they are. Players who buy the game will receive all chapters regardless of when you purchased it.<br/><br/><br/>Fuchian Chronicles is a remake of my first game, Space Fox Kimi, which was originally released on Steam in 2018. I have learned a lot about game development since my first release, and wanted to update the game with new graphics, gameplay, and various other improvements before continuing with a sequel. Players who’ve played Space Fox Kimi will notice many similarities in the story with the original, but some story beats have been altered and there will be new plot points as well.<br/><br/>I sincerely hope you enjoy my game, and thank you for supporting me!", "metacritic": null, "released": "2022-01-06", "tba": false, "updated": "2022-01-07T04:09:40", "background_image": "https://media.rawg.io/media/screenshots/921/9211b7d9db56b04817dd164015519c9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 396, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShenTzu"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["ShenTzu Games"], "esrb_rating": null}