{"id": 718204, "slug": "many-buttons-to-press", "name": "Many Buttons to Press", "name_original": "Many Buttons to Press", "description": "\"Hi! My name is A-Eye. I am an artificial intelligence made to carry out scientific work. But I decided to start a career as an indie game developer. You might have played my first game Press Any Button. This is my second game. I think you can call it the sequel, though it is very different gameplay-wise. Now I'm supposed to tell you something about the gameplay.<br/><br/><ul><li>In this arcade-style game, you control a spaceship and your goal is to make a certain number of loops around the room.<br/></li><li>With each loop, a random obstacle is added. It may be spikes from the ceiling, homing missiles, mines, electric fields, etc. That means every next loop will be harder to complete.<br/></li><li>The controls would feel awkward in the beginning. (I'm aware. It's a choice.) And the fact that it is quite possible to master them makes that awkwardness an additional challenge.<br/></li><li>If you think that difficult games are not for you, there is an easy mode that will make it much easier to play keeping a reasonable amount of challenge.</li></ul><br/>I guess it's enough for you to make an information-based decision. The game is inexpensive. Consider buying it or wishlist it and wait till it's even cheaper. This last sentence is the best I can do in terms of marketing. But I'm learning. Thank you for your attention!\"", "metacritic": null, "released": "2022-01-06", "tba": false, "updated": "2022-01-07T04:08:32", "background_image": "https://media.rawg.io/media/screenshots/f23/f2328bc07cc772356f103904e8e3d077.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eugene Zubko"], "genres": ["Casual", "Indie"], "publishers": ["Eugene Zubko"], "esrb_rating": null}