{"id": 71831, "slug": "dungeon-inc", "name": "Dungeon, Inc.", "name_original": "Dungeon, Inc.", "description": "<p>As Dungeon, Inc.’s new Gold Production Manager, you must maximize profits by any means necessary. Nothing is too devious to consider - if it works! Build your dungeon deeper, expand into new environments, and recruit mischievous monsters; the more you tap, the bigger the dungeon, and the more gold you make!<br />\nCollect monsters to help defend your dungeon from pesky Tax Knights and rival managers - then send your monsters off to sabotage others! When the insurance value of your dungeon is high enough, trigger an ‘accident’ to cash in on your value and start again. What are YOU willing to do to become Manager of the Week?<br />\nFEATURES:<br />\n- Collect and level up quirky monsters to fill your dungeon - from ogres and slime monsters, to wizards, dragons, and much more!<br />\n- Unlock and upgrade legendary relics to customize your playing experience<br />\n- Expand your dungeon to a number of vibrant rooms and environments, including a Golden Geese Hatchery and Rapunzel’s Hair Salon!<br />\n- Compete in multiplayer ‘Corporate Ladder’ events - raid others and defend your dungeon from attack<br />\n- Spin the Wheel of Motivation for exclusive bonuses!<br />\n- Fun new soundtrack from the composers of Doomsday Clicker<br />\nDungeon, Inc. is free to play but offers some game items for purchase with real money.<br />\nWe love to hear from our players! On Twitter? Drop us a line @PikPokGames and join the conversation with #DungeonInc<br />\nTerms of Service: http://pikpok.com/terms-of-use/<br />\nMonthly subscription for 1 Month with great daily in-game benefits. This subscription will auto-renew every month and must be cancelled at least 24 hours before renewal.<br />\nMonthly subscription will renew automatically unless auto-renew is turned off at least 24-hours before the end of the current period. Payment will be charged to iTunes Account at confirmation of purchase. Account will be charged for renewal within 24-hours prior to the end of the current period. Renewal costs 9.99 USD/month (or local equivalent).<br />\nSubscriptions may be managed by the user and auto-renewal may be turned off by going to the user&#39;s Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a monthly subscription, where applicable.</p>", "metacritic": null, "released": "2017-05-10", "tba": false, "updated": "2020-09-14T11:59:24", "background_image": "https://media.rawg.io/media/screenshots/99e/99ea9411717cf385645baf7de04093a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["PikPok"], "genres": ["Strategy", "Simulation"], "publishers": ["Prodigy Design Limited T/A Sidhe Interactive"], "esrb_rating": "Everyone 10+"}