{"id": 71847, "slug": "tip-a-cow-fun-tapping-game", "name": "Tip-A-Cow: Fun Tapping Game", "name_original": "Tip-A-Cow: Fun Tapping Game", "description": "Top 10 USA with TONS of downloads worldwide.<br/><br/>Ever heard of Cow Tipping? Doesn't really matter, you'll still have fun tipping a cow in the game Tip-a-Cow!<br/><br/>Try tipping 20 unique cows in 20 challenging yet funny levels. Some cows are easy to tip while others are more difficult. Tap, tap, tap to run and gain speed, then, at the last second, jump to tip the cow! Compare your scores with friends and see how can tip more cows!<br/><br/>HOW TO PLAY:<br/>- Tap the left and right button alternately to speed up.<br/>- For example, tap the left, then right, then left, then right… You get it!<br/><br/>TIP-A-COW FEATURES:<br/><br/>TIP OVER EVERY COW <br/>- Just tap left-right-left to run at the cow<br/>- Try tipping over 20 unique cows, each with a hilarious story<br/>- Test your cow tipping skills in 20 funny yet challenging levels <br/><br/>SHARE YOUR SCORES<br/>- Compare your score with your friends on the Tip-A-Cow leaderboard<br/>- Start talking about your score with friends on Facebook &amp; Twitter<br/><br/>Start tapping to gain just enough speed to tip a cow! Enjoy hours of funny storylines and unique levels and cows. Share your scores with friends and let everyone know who can tip more cows in Tip-A-Cow!<br/><br/>Download now to start tipping!<br/><br/>APP REVIEWS: <br/>\"I recommend this app for anyone who has time to kill. Or has a fear of cows!\" -Appmodo<br/><br/>\"You will find that this game has great replayability factor that most games do not as you will play this one over and over.\" -TopApps.eu<br/><br/>YouTube Fan Videos:<br/>Search \"tip-a-cow iphone\", fan videos from johnsiphone1, kakakakatethegreat. Thank you so much!!!<br/><br/>App Store Quotes: <br/>“Tip a cow = simplistic fun”<br/>“I love playing it because it’s simple but so addicting!!!”<br/>“this game is a very fun and addicting game”<br/><br/>CONTACT INFO:<br/>Any questions or suggestions? Email us at support@kooapps.com<br/><br/>Become a fan of Tip-A-Cow on Facebook!<br/>Our Website: http://tipacow.kooapps.com/<br/>Trendy on Twitter check it out: http://twitter.com/search?q=tip a cow<br/><br/>Please write us a review : ) We value your thoughts highly and appreciate all feedback. Thanks!", "metacritic": null, "released": "2010-06-30", "tba": false, "updated": "2019-10-22T14:13:05", "background_image": "https://media.rawg.io/media/screenshots/742/742207fd42b21c33ae7e1de343fdccef.jpg", "website": "http://kooapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games for Friends"], "genres": ["Arcade"], "publishers": ["Games for Friends"], "esrb_rating": null}