{"id": 7184, "slug": "towers-n-trolls-hd", "name": "Towers N' Trolls HD", "name_original": "Towers N' Trolls HD", "description": "FREE UPDATE SALE!!!! LIMITED TIME ONLY!!!!<br/><br/>\"It's an addictive, creative game with some lovely aesthetics and challenging levels. If you're anything like me, it'll probably steal your soul.\" - KOTAKU<br/><br/>\"iPad App of the Week\" - GIZMODO<br/><br/>\"Game of the Month\" - iDow.ru<br/><br/>-------- <br/><br/>Fast paced fantasy tower defense... from the creators of Toy Soldiers and Baldur's Gate: Dark Alliance! <br/><br/>Defend your kingdom from invading troll hordes, with addictive quick-to-learn but difficult-to-master gameplay. Towers N' Trolls combines fast-paced arcade action with quick-thinking strategy. <br/><br/>The tower defense genre is updated for 21st Century mobile gaming with nail-biting moments where your fate teeters on a razor's edge. No sitting and waiting for the enemy, they're already at your door - it's up to you to stop them!<br/><br/>Towers N' Trolls features beautifully hand-painted environments and playful, light-hearted monsters from the Age of Fantasy. Play across 11 worlds and 65 unique maps, including the Lonely Forest, Fertile Pastures, Snowy Forest, Underworld, Badlands, and the North. <br/><br/>-------- <br/><br/>WHAT PEOPLE ARE SAYING <br/><br/>\"Before playing Towers N' Trolls I could see only the visible light spectrum. Now I can see both ultraviolet and infrared! It's amazing, you should try it!\" <br/><br/>\"When Cyclops invaded my neighborhood, I knew to build Scout Towers immediately... Thank you Towers N' Trolls for saving my family's life. The Johnsons next-door only had Catapults, and perished tragically.\" <br/><br/>\"My son was a real problem in school. Since I bought him Towers N' Trolls, his teachers love him and he's earned straight A's!\" <br/><br/>\"What other reason is there to buy an iPhone other than to play Towers N' Trolls?\" <br/><br/>-------- <br/><br/>FEATURES <br/><br/>* Universal App (Works on iPhone &amp; iPad)! <br/>* 65 Levels! <br/>* 4 Game Modes! (Story Campaign, Challenge, Open Mode, and Endless Journey)<br/>* 11 different worlds across completely different environments! <br/>* 10 Enemy types with thousands of frames of animation! <br/>* 3 Levels of Difficulty! <br/>* Unique, Hand Painted Backgrounds! <br/>* Randomized loot generation provide countless hours of replayability! <br/>* Full iPhone &amp; iPad Retina Graphics Support!<br/>* Leaderboards &amp; Achievements! <br/>* GameCenter Support! <br/>* Outrageous Special Weapons including - Powder Kegs, Mine Fields, and Poison Gas Clouds! <br/><br/>-------- <br/><br/>EMBER ENTERTAINMENT <br/><br/>Visit us at Ember-Entertainment.com <br/>Like us at facebook.com/EmberEntertainment<br/>Follow us at twitter.com/Ember_Dev", "metacritic": null, "released": "2012-02-23", "tba": false, "updated": "2019-10-22T14:36:34", "background_image": "https://media.rawg.io/media/screenshots/445/445270db57cfaa698ef56e8c1a3a3cbc.jpeg", "website": "http://ember-entertainment.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ember Entertainment"], "genres": ["Action", "Strategy"], "publishers": ["Ember Entertainment"], "esrb_rating": null}