{"id": 718508, "slug": "el-purgatorio-valcarcel", "name": "El Purgatorio (Valcarcel)", "name_original": "El Purgatorio (Valcarcel)", "description": "<p>La experiencia trata de relatar la última decisión antes de trascender a la vida eterna según la religión cristiana muestra, pero desde un prisma mucho más realista y metafórico con el comportamiento humano en la propia vida, en relación con el sentimiento de incertidumbre, ese momento de desconcierto, de duda, que con nuestra decisión y nuestra fuerza debemos conseguir apartar. Considero que el bien y el mal, en las decisiones, y en nuestro hacer cotidiano, tal y como ocurre en el diseño, están al alcance de cualquiera, todos nos podemos equivocar en el camino y tomar la vía incorrecta, pero continuar en ese sendero, o buscar una alternativa es nuestra decisión, estar condenados al mal, no es un juicio que hace una entidad superior, sino nuestra persistencia en la búsqueda de la autodestrucción y la fatalidad. Por tanto lo que se relata en los caminos del juego es un símil a todo esto, las velas apagadas, el color del que se inunda la pantalla, el fuego, son indicativos claros del descenso a los infiernos, tal y como aparecen esos indicativos en otras formas, igualmente claras, cuando estas cayendo en la degradación en vida, pero a pesar de todo ello, no somos capaces de verlo, y muchos continúan hacia adelante. La sensación que debe quedar es sentirnos responsables de nosotros mismos, entender los caminos, las señales y decidir, plasmando lo que somos en esas decisiones. Dentro de la pantalla y fuera de ella.</p>", "metacritic": null, "released": "2022-01-06", "tba": false, "updated": "2022-01-07T05:18:56", "background_image": "https://media.rawg.io/media/screenshots/7b3/7b323dc7c531a513052c4c20295f9be8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valcarcel"], "genres": [], "publishers": [], "esrb_rating": null}