{"id": 71866, "slug": "new-solitaire-card-game", "name": "New Solitaire Card Game", "name_original": "New Solitaire Card Game", "description": "Solitaire is a universal app, playable in the best resolution available for each Apple device. New Solitaire is optimized to your device for long battery life.<br/><br/>Having trouble completing a hand? The Winning Deals feature creates a game that deals hands guaranteed have a winning solution. Use hints to help you finish!<br/><br/>Play a fresh new challenge hand every day! 520 Daily hands were prepared by ourSolitaire Master in Pasadena, CA. Difficulty ranges from easy to very tough! Can you beat the rest of the world?<br/><br/>Think you have the best Solitaire score around? With Apple's Game Center enabled, you can compete via Game Center leaderboards to see how your Patience speed stacks up against other players!<br/><br/>The addicting game you’ve been playing on your computer for years now goes wherever you do. Download New Solitaire today!<br/><br/>New Themes, New Cards Packs, and Card Backs. Change the way your game looks, or don't!<br/>FEATURES:<br/>- Daily Challenge<br/>- NEW iMessage Stickers<br/>- Big selection of Theme Packs<br/>- Winning Deals<br/>- Game Center leaderboards<br/>- Draw 1 card or 3 Cards<br/>- Custom Card Themes &amp; Backgrounds<br/>- Achievements to Unlock<br/>- Game saves if you leave the app<br/>- Unlimited Undo<br/>- Auto Complete Option<br/>- Standard Traditional Scoring<br/>- Vegas scoring for casino fans<br/>- Statistics<br/>- Taptick feedback<br/>- Spider Solitaire Coming Soon<br/>- Best Battery Life<br/>- Left-handed Mode Available<br/><br/>Check out the best Solitaire iMessage Stickers for your chat messages! To send a sticker, open your Messages app. Tap the Apps button (which looks like the App Store icon), then select our Solitaire icon to view and pick from the sticker pack.<br/><br/>For the latest uno and what we are up to, check out our website.", "metacritic": null, "released": "2018-01-08", "tba": false, "updated": "2019-10-22T14:25:09", "background_image": "https://media.rawg.io/media/screenshots/c62/c626632e709266ec550ee94c3dc9f10e_6pVEnWA.jpg", "website": "http://www.freefungames.xyz", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Free Fun Solitaire"], "genres": ["Card"], "publishers": ["Free Fun Solitaire"], "esrb_rating": "Teen"}