{"id": 718742, "slug": "neapolitan-ch2", "name": "Neapolitan Ch.2", "name_original": "Neapolitan Ch.2", "description": "<p>You're childhood friends with a rare species known as cerberus. Three heads with their own names, each head a having a different personality sharing the same body known as Neo. While most don't like them as a whole, you have always loved them dearly and always will. But just maybe you love one of them with a different kind of love than the others. </p>\n\n<p>Instructions to play mobile: As I am unable to provide a direct app download with the program I use to create the game you must use Joiplay. Go to this site: https://joiplay.cyou/ And download the first and second (JoiPlay and the Renpy Plugin) Once downloaded open the JoiPlay app (You may have to change settings to allow an app to be downloaded outside the app store) To import the game into the app you must first download the game from the itchio page, I choose the windows version. Once downloaded you must extract the files, once that is done when you click on the .exe file you may be able to choose the Joiplay app. If not, you press on the plus bottom in the bottom right corner, under \"executable file\" click on \"choose\" then go to downloads or whatever folder you saved the game in until you get to the .exe file. Once you click that give whatever name and icon you like and enjoy! ^w^\r\n</p>\n<p>If a keyboard pops up and you can't see the text it is asking for your name :3\r\n</p>", "metacritic": null, "released": "2022-01-05", "tba": false, "updated": "2022-01-07T06:11:28", "background_image": "https://media.rawg.io/media/screenshots/703/70302c78f368f3f381499f9f33862609.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dean Wolfwood"], "genres": [], "publishers": [], "esrb_rating": null}