{"id": 7187, "slug": "kingturn-underworld-rpg", "name": "Kingturn Underworld RPG", "name_original": "Kingturn Underworld RPG", "description": "Kingturn Underworld RPG is an addictive turn-based fantasy strategy RPG which takes both wits and patience to be mastered.<br/><br/>&amp;#39;Kingturn RPG - A Brilliant Tactical Battle Game&amp;#39; [TouchArcade review]<br/><br/>Kingturn Underworld marks the 1st chapter of our Kingturn trilogy, and comprises 74 scenarios where you can take over control of undead and monsters.<br/>Kingturn Underworld supports new character classes like Thieves, Lizards, Demons, or Heretics, as well as new weapons and armor, new environments and new sound tracks.<br/><br/>Kingturn Underworld is a shareware game where the first 8 scenarios are free to play and the remaining 66 scenarios can be unlocked via a one-time in-app purchase. <br/><br/><br/>Kingturn Trilogy Overview <br/>--------------------------------- <br/>Chapter 1 - The rise of King Constantin (Kingturn Underworld RPG) <br/>Chapter 2 - The rule of King Constantin (Kingturn RPG) <br/>Chapter 3 - The fall of King Constantin (Kingturn RPG Plus) <br/><br/>All titles have independent story lines and can be played in arbitrary order. <br/><br/><br/>Story - Chapter 1<br/>--------------------------<br/>Juliet, necromancer and daughter of Overlord Xanthus, finds herself forced to flee the Underworld after a rebellion of her father&amp;#39;s minions. Struggling to survive on Andaria&amp;#39;s hostile surface, she has to take unusual measures to get things under control ...<br/><br/><br/>Concept<br/>-----------<br/>The game combines outpost conquering with tactical combat and a complex unit skill system. <br/>Embedded in a compelling medieval fantasy story with quirky characters, the player can delve into this old school tactics RPG for many hours.<br/><br/><br/>Tutorial<br/>-----------<br/>If you are new to our SRPG series, you might want to watch the video tutorial first:<br/>http://www.youtube.com/watch?feature=player_embedded&amp;amp;v=RRpli7agW4E<br/><br/><br/>Category<br/>--------------<br/>Offline Strategy RPG<br/><br/><br/>Game play<br/>---------------<br/>- Many hours of addictive and challenging game play in a 68 scenarios main campaign (&amp;#39;Nights in Andaria&amp;#39;)<br/><br/>- An ultimately challenging mini-campaign comprising 6 scenarios  (&amp;#39;Twelve years later&amp;#39;)<br/><br/>- More than 40 character classes like Skeleton, Death Knight, Undead Mage, Heretic, Fury, Murderer, Vampire, Necromancer, Skeleton Champion, Bat Rider, Giant ...<br/><br/>- More than 60 class skills like &amp;#39;War Cry&amp;#39;, &amp;#39;Chaos Storm&amp;#39;, &amp;#39;Stealth&amp;#39;, &amp;#39;Lightning Bolt&amp;#39;, &amp;#39;Living Bomb&amp;#39;, &amp;#39;Inferno&amp;#39;, &amp;#39;Whirlwind&amp;#39;, &amp;#39;Raise Undead&amp;#39;, &amp;#39;Drain Life&amp;#39;, &amp;#39;Blood Bolt&amp;#39;, &amp;#39;Firestorm&amp;#39;, &amp;#39;Spin Attack&amp;#39;, &amp;#39;Arrow Hail&amp;#39;, ...<br/><br/>- More than 700 items (weapons, armor, amulets, rings)<br/><br/>- Battle drops, treasure chests, and scenario rewards<br/><br/>- Conquer outposts and face a challenging enemy AI (Artificial Intelligence)<br/><br/>- Level up an army which is carried over from scenario to scenario", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2019-10-22T13:58:18", "background_image": "https://media.rawg.io/media/screenshots/f3b/f3ba44d08e40f25e31166848610e86e8.jpeg", "website": "http://www.mangobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mangobile"], "genres": ["RPG", "Strategy"], "publishers": ["Niels Baumann"], "esrb_rating": "Teen"}