{"id": 71877, "slug": "pes-2018-pro-evolution-soccer", "name": "PES 2018 PRO EVOLUTION SOCCER", "name_original": "PES 2018 PRO EVOLUTION SOCCER", "description": "FEATURING WORLD FAMOUS NATIONAL AND CLUB TEAMS!<br/>Experience authentic soccer on the go by playing as teams from all over the world, including the Brazilian, French, and Japanese national teams, as well as world famous club teams such as FC BARCELONA and LIVERPOOL FC. Build your own squad from an enormous selection of over 10,000 actual players, including FC BARCELONA greats such as P. COUTINHO,L.MESSI, L.SUÁREZ, PIQUÉ and O.DEMBÉLÉ! Live and breathe the beautiful game recreated with unparalleled realism! In PES Mobile, your knowledge of real-world soccer is an invaluable asset, as players' individual skill levels, playstyles, and movement idiosyncrasies are rendered in-game with meticulous attention to detail.<br/><br/>WALK AMONG LEGENDS<br/>Live out your childhood soccer fantasy by taking control of legendary players from the annals of soccer history, including BECKHAM, MARADONA, and ZICO!<br/>Blend past with present to create your fantasy squad by combining currently active Star Players with Legends from soccer history.<br/><br/>EXPERIENCE VS USER MATCHES LIKE YOU NEVER HAVE BEFORE.<br/>Face off against your friends anytime, anywhere.<br/>If you want to play casually against nearby friends, now you can with \"Local Matches\" and \"Local Leagues\", where you create an original tournament. Enjoy heated matches against your friends and clinch the top spot!<br/><br/>THE PES 2018 MOBILE EXPERIENCE<br/>Take total control of every action on the field in a way that only the PRO EVOLUTION SOCCER franchise can deliver!<br/>Natural player movements, precision passing, and in-depth tactics bring the true experience of the beautiful game to your mobile device!<br/><br/>SWIPE TO PASS! TAP TO SHOOT!<br/>Controller actions have been optimized to make playing on your mobile device feel as smooth and exciting as a PES action game should! Utilize PES \"Advanced\" controls for precise passing and controlled shooting. \"Classic\" virtual pad controls are also available.<br/>Master your technique and feel the excitement of scoring the winning goal in the ultimate action soccer game!<br/><br/>BUILD YOUR WINNING ELEVEN TEAM<br/>Acquire players through Scouts, Agents, or the Scout Auction. <br/>Choose the best players to fit your unique tactics.<br/>Every player is unique and every match is a new experience!Create your very own team and play right away!<br/><br/>[Download Notes]<br/>PES 2018 PRO EVOLUTION SOCCER must be downloaded over a Wi-Fi connection.<br/> *3G・LTE is not supported. <br/> *The same condition is applied for the App update.<br/><br/>[System Requirements]<br/>This app is an online game.  Please enjoy the game with stable internet connection.<br/><br/>[Title Display]<br/>If you select Japanese in the language settings of the game application, “Winning Eleven 2018” will be displayed. If you select a language other than Japanese, “PES2018 PRO EVOLUTION SOCCER” will be displayed.", "metacritic": null, "released": "2017-05-24", "tba": false, "updated": "2019-10-22T14:25:09", "background_image": "https://media.rawg.io/media/screenshots/7a7/7a7797a8977f3afec5155a55ae499547.jpg", "website": "https://www.konami.com/wepes/mobile/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "Android"], "developers": ["Konami Digital Entertainment"], "genres": ["Action", "Sports"], "publishers": ["Konami"], "esrb_rating": null}