{"id": 7188, "slug": "last-inua-an-arctic-adventure", "name": "Last Inua - An Arctic Adventure", "name_original": "Last Inua - An Arctic Adventure", "description": "LAST INUA supports the iPad 3, iPad Mini and iPhone 4S or newer. iPod touch or older devices than the above mentioned are not supported.<br/><br/>LAST INUA is an award winning platform adventure game featuring an Inuit father and his son on their epic quest for survival against the elements. Father Ataataq has to guard his son Hiko, a gifted boy with supernatural abilities. Their world, the mythical North, is under attack by an ancient demon: Tonrar. Tonrar seeks to dominate the North and to do this he needs to destroy Hiko. But Tonrar is alone, Ataataq and Hiko have each other. <br/><br/><br/>&amp;quot;An immersive and emotional experience with a vibrant art style&amp;quot; - Chris Priestman, Indiestatik<br/><br/><br/>-  This is our 21st century tribute to the classic platform adventure genre!<br/>- You control 2 unique characters: Father Atataaq, a physical powerhouse and Hiko who is gifted with magical powers.<br/>- LAST INUA is immersed in atmosphere: audio, design and gameplay orchestrated for a majestic sense of northern wonders.<br/>-  Featuring an intriguing storyline, immersive gameplay and fun puzzles.<br/>-  Amazingly detailed and handcrafted character animations and artwork.<br/><br/><br/>“Glorious it is when wandering time is come.” – Inuit Proverb<br/><br/><br/>We hope you have a great time exploring LAST INUA! <br/>You can find us on Twitter @Glowforth.<br/><br/><br/>------------------------------------------------------------------------<br/><br/>Please Note: <br/><br/>If you experience frequent crashes or performance issues, please try restarting your device and make sure you close down all other apps before playing.<br/><br/>Supported languages: Spanish (Spain), Spanish (US), German, Russian, Portuguese, Italian, French, Korean, Japanese, Chinese and Thai.", "metacritic": null, "released": "2014-05-08", "tba": false, "updated": "2019-10-22T14:29:13", "background_image": "https://media.rawg.io/media/screenshots/977/977ef1d3ad4219b653a0db41738f93e8.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creative Mobile"], "genres": ["Action", "Adventure"], "publishers": ["Osauhing Creative Mobile"], "esrb_rating": "Everyone 10+"}