{"id": 71912, "slug": "shadow-wars", "name": "Shadow Wars", "name_original": "Shadow Wars", "description": "Join the ultimate multiplayer RPG monster battle raging across the globe! Catch and collect legendary monsters, craft and evolve your epic crew, and clash with rivals in PvP multiplayer puzzle battles.<br/><br/>From dragons and zombies, to mummies, angels, werewolves and more, Shadow Wars has monster collecting packed with action, adventure, and strategy! Collect rare artifacts and balance your monsters’ abilities to build and unleash the ultimate crew. Team up with other Shadow Master friends to form a clan and fight other alliances in strategic match 3 puzzle battles! Join the war or be destroyed.<br/><br/>FEATURES:<br/>Collect, level up, and evolve powerful monsters, each with unique skills and abilities <br/>Intense puzzle strategy — build a team of monsters, configure their skills, and plan your PvP play<br/>Form alliances with players from around the world — join forces in multiplayer raid battles and defeat enemies in epic RPG card combat<br/>Daily and weekly live events with big rewards — compete to collect rare monster characters, crucial resources, and legendary artifacts<br/>Artifacts to collect and further customize your RPG puzzle playing experience<br/>Shadow Wars is free to play but offers some game items for purchase with real money.<br/><br/>We love to hear from our players! On Twitter? Drop us a line @PikPokGames and join the conversation with #ShadowWars!<br/><br/>Terms of Service:<br/>http://pikpok.com/terms-of-use/<br/><br/>Monthly VIP Subscription for 1 Month with great daily in-game benefits. This subscription will auto-renew every month and must be canceled at least 24 hours before renewal. <br/><br/>Monthly VIP Subscription will renew automatically unless auto-renew is turned off at least 24-hours before the end of the current period. Payment will be charged to iTunes Account at confirmation of purchase. Account will be charged for renewal within 24-hours prior to the end of the current period. Renewal costs 9.99 USD/month (or local equivalent).<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period.", "metacritic": null, "released": "2016-09-21", "tba": false, "updated": "2022-11-03T19:07:15", "background_image": "https://media.rawg.io/media/screenshots/4dd/4ddb5c48511b4b171dcd36e0e967878c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["PikPok"], "genres": ["RPG", "Strategy"], "publishers": ["Prodigy Design Limited T/A Sidhe Interactive"], "esrb_rating": "Teen"}