{"id": 71919, "slug": "dots-and-boxes-classic-games", "name": "Dots and Boxes - Classic Games", "name_original": "Dots and Boxes - Classic Games", "description": "Link the dots, close more squares than your opponent and be first in the Global High-Score, among thousands of players worldwide. <br/>From the creators of Four In A Row, another classic! Have your skills changed since you were in school? ^__^<br/>Challenge a friend next to you or find an opponent online. Or try to beat one of our well-trained virtual players ;) <br/><br/>DOTS AND BOXES - CLASSIC BOARD GAMES is completely Free. If you love games like Chess, Checkers, Backgammon and other challenging pastimes, you will love Dots and Boxes. <br/>Play ‘solo’ or against a real opponent using either our local or online multiplayer mode; play with a friend on the same device or find an opponent from anywhere in the world. <br/><br/>DOTS AND BOXES - CLASSIC BOARD GAMES will challenge you according to your abilities, with 3 difficulty levels, and it’s easy to get: tap on the dots to draw lines and close squares. You’re the winner if you got more squares than your opponent when there's no more lines to trace.<br/><br/>Can you think of a better brain training?<br/><br/>Key features: <br/>- Choose between 3 modes of difficulty<br/>- Play against real humans online (multiplayer)!<br/>- Challenge your friends on the same device (2 players mode)<br/>- Climb the high score<br/>- Collect Game Center achievements<br/>- Enjoy hours of fun with colourful themes<br/>- Easy to get, hard to master<br/>- Fun for all ages<br/><br/>Start closing your boxes now! Free!<br/><br/>Thanks for playing!<br/>FOLLOW US<br/>Facebook/outofthebit<br/>@outofthebit", "metacritic": null, "released": "2013-05-13", "tba": false, "updated": "2019-07-29T08:20:34", "background_image": "https://media.rawg.io/media/screenshots/054/054db220727182148ff93c63486ac957.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OutOfTheBit"], "genres": ["Board Games", "Puzzle"], "publishers": ["OutOfTheBit"], "esrb_rating": null}