{"id": 7193, "slug": "dogs-playing-poker-free-texas-holdem-game-for-all-", "name": "Dogs Playing Poker ~ free Texas hold'em game for all skill levels & dog lovers!", "name_original": "Dogs Playing Poker ~ free Texas hold'em game for all skill levels & dog lovers!", "description": "• GET YOUR PAWS on this iOS classic and enjoy stunning graphics and hilarious blue collar poker action against a whole bunch of dogs, a fox, and a walrus! Put on your poker face and step into beautifully detailed rounds that include a junkyard, pound, train car, den, and the dogs&amp;#39; favorite Chinese restaurant: Chang&amp;#39;s Kitchen! <br/><br/>Check out the reviews to see how much players of all skill levels are enjoying Dogs Playing Poker!<br/><br/>=== Reviews ===<br/><br/>&amp;quot;...an ideal app for getting people interested in Texas Hold &amp;#39;Em.&amp;quot; - SlapApp <br/>&amp;quot;an incredibly satisfying poker experience...&amp;quot; - Gamezebo <br/>&amp;quot;The dogs ooze with personality...&amp;quot; - TouchReviews.net <br/>&amp;quot;The best poker game on the App Store. Period.&amp;quot; - US Reviewer <br/><br/>=== Key Features ===<br/><br/>• UNLOCK BREEDS <br/>Create your own dog and unlock a new dog breed with each tournament victory! Breeds include Labrador, Golden Retriever, German Shepherd, Bulldog, Husky, Pug, Poodle, Basset Hound, Rottweiler, Boston Terrier, Maltese Yorkshire Terrier, and many more! <br/><br/>• LEARN TO PLAY <br/>Need to brush up on your Texas Hold &amp;#39;em skills? An easy-to-follow Tutorial has been included to help beginners get up-to-speed. <br/><br/>• PET THE DOGS <br/>Give your dog love by rubbing his or her belly. Pet the other dogs and see what happens! Tap your dog multiple times to make him or her snarl and howl! <br/><br/>• ADVANCED AI <br/>We&amp;#39;ve been developing the artificial intelligence at work in Dogs Playing Poker since 2007. From the moment you play your first hand, the dogs will be studying your game and adapting accordingly. <br/><br/>• PERSONALITIES GALORE<br/>From the petulant little Chihuahua to the lethargic Mastiff and the big betting Poodle, each of the characters has been carefully developed to provide a unique challenge. <br/><br/>• TELLS <br/>Each of the dogs have &amp;quot;tells&amp;quot;, or noticeable reactions that give you clues as to the hands they hold! Learn them all! <br/><br/>• GET SCHOOLED <br/>Dogs Playing Poker analyzes your skills and grades your luck, trickery, and overall performance!", "metacritic": null, "released": "2010-04-27", "tba": false, "updated": "2019-10-22T14:29:13", "background_image": "https://media.rawg.io/media/screenshots/b2f/b2fe2dea8aeb0bc610cc5857bca603ed.jpeg", "website": "http://www.facebook.com/candywriter", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Candywriter"], "genres": ["Card"], "publishers": ["Candywriter"], "esrb_rating": "Teen"}