{"id": 71940, "slug": "pickomino-the-dice-game-by-reiner-knizia", "name": "Pickomino - the dice game by Reiner Knizia", "name_original": "Pickomino - the dice game by Reiner Knizia", "description": "An appetizingly addictive dice game for up to 4 gambling gobblers. Barbecued worms are in high demand, and only the coolest-headed chicken can win the tasty snack! But beware: Anyone who doesn't manage to grab a worm off the grill can help himself to those on his opponents' plates! In Reiner Knizia’s popular dice game, 16 barbecue worm portions with different values are waiting on the grill to be snatched up by the dice-throwing chickens. The rules are simple, but don’t push your luck too far: To get your claws into one of the delicious worms, you roll all 8 dice at the same time. You then pick a value from your throw and remove all the dice showing the same value, before throwing the remaining dice again. If your score corresponds to an available barbecue worm portion on the grill you can take this portion - or maybe even grab a portion from the plate of your fellow players! You’ll need both the luck of the dice and the right strategy: Stick with your score, or roll the dice just one more time to get a better portion. The player with the most worms in his claws at the end of the game wins!<br/><br/>Features:<br/>• Single-Player against 6 AI opponents with unique tactics<br/>• Hot seat multiplayer for up to 4 players on one device<br/>• Online multiplayer for 2-4 players via Game Center<br/>• Numerous achievements to unlock<br/><br/>*****<br/>Questions or suggestions for improvements: <br/>Mail to ios@usm.de <br/>We are looking forward to your feedback! <br/><br/>For more information on news and updates:<br/>www.usmgames.com  <br/>or visit us on www.facebook.com/UnitedSoftMedia and twitter.com/USM_News<br/>*****", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-10-22T14:25:10", "background_image": "https://media.rawg.io/media/screenshots/637/637cc9c1f90a557b235ad960aa06b2f6.jpg", "website": "http://www.usmgames.com/content-100-100/apps/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["USM"], "genres": ["Board Games"], "publishers": ["United Soft Media Verlag"], "esrb_rating": "Everyone 10+"}