{"id": 71958, "slug": "i-must-run-reloaded", "name": "I Must Run! Reloaded", "name_original": "I Must Run! Reloaded", "description": "Calling All Innovators 2011 winner #2 best arcade game returns to App Store! Now as feature reloaded version.<br/>-- <br/><br/>It was just another typical night out, until things went drastically wrong: your wife was assaulted, you reacted violently and somebody died. Now you're in jail and the victim's father is blackmailing you: if you don't show up within the next 24 hours, your wife dies. What's a man in your situation supposed to do? Run, of course!<br/><br/>I Must Run! is a frantic, skill-based running game. Jump across gaps between jail buildings, weave your way through the subway station and test your reflexes in a deadly dash over construction site cranes. Play in the compelling Story Mode or the score-based \"Endless Run\" mode through six levels: Jail, Subway, Sewers, Construction Site, Suburbs and Rooftops. <br/><br/>Get ready to put your fingers (and lungs) to the test in the most important run of your life! <br/><br/>FEATURES<br/>- Run through 6 locations in Story Mode<br/>- Train your nerves in Endless Run<br/>- Earn Coins for your performance<br/>- Get additional lives for Coins<br/>- Continue your run from the recent level (remember to keep a few spare lives for that!)<br/>- Game Center leaderboards and achievements<br/>- Beintoo leaderboards and prizes<br/>...more features coming soon<br/><br/>-- <br/>Remember to join our Fan Page on Facebook for the latest updates on our games, previews and hints: <br/>facebook.com/gamelion <br/><br/>If you're on Twitter, follow us on twitter.com/gamelion <br/><br/>Contact us via email: <br/>support@game-lion.com", "metacritic": null, "released": "2012-04-17", "tba": false, "updated": "2019-07-29T15:12:11", "background_image": "https://media.rawg.io/media/screenshots/9f1/9f1dd14aff9280ab04e7e7e293104b0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Huuuge Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Huuuge Games"], "esrb_rating": null}