{"id": 719549, "slug": "stellar-adventure-2", "name": "Stellar Adventure!", "name_original": "Stellar Adventure!", "description": "<p>This is my 3DPlatformer game Stellar Adventure!</p>\n<p>These are a few of my modifications.</p>\n<p>1, The tutorial level is touched up, a bit to make it feel different and help get to grasp on the main mechanic of the game, jumping.</p>\n<p>2, I added a second level that uses the jump-pads and unique use of the columns as spiral stairs to ascend into a really awesome level.</p>\n<p>3, I added a third level that uses some way points uniquely. I also tried messing around with the damage script to make a certain area more dangerous but should be easy to complete. If you get knocked out by the moving platforms of the building there is a giant block that should one hit kill you by landing on it so you can restart the level in game instead of manually with the menu, cause you'll keep falling cause nothing will make you die.</p><p>If you're making it this far, I kinda already guessed that this game would feel a bit different on the Web so It wouldn't feel as smooth. I didn't want that to distract from the game play, so to work a round this a little, my level 3 my most clunkiest level. If you want to get through the first part, there is a corner with the keycard you can easily get instead of trying to get it from the moving platforms. There is also a \"chariot\" ride if you wait for it to come on the third part to carry you to the end of the level and its meant to be like that but you can walk through the doors if you wanted.</p>", "metacritic": null, "released": "2022-01-03", "tba": false, "updated": "2022-01-07T09:15:55", "background_image": "https://media.rawg.io/media/screenshots/27a/27a128bd94b2fd1ce9ff472c16ec1484.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Simachio"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}