{"id": 719638, "slug": "dawn-of-kagura-hatsukas-story", "name": "Dawn of Kagura: Hatsuka's Story", "name_original": "Dawn of Kagura: Hatsuka's Story", "description": "<h3>FEATURES</h3><ul><li>Turn-based combat. Roguelike adventure!<br/></li><li>Adjustable difficulty for the right challenge.<br/></li><li>Shop, upgrade, and top up your youkai's powers.<br/></li><li>Master and summon many kinds of youkai for combat.<br/></li><li>10+ hours of story and gameplay.</li></ul><br/>Dawn of Kagura is a series of replayable roguelike RPGs!<h3>SUMMARY</h3>On her way home after completing a quest to exorcise a terrible youkai, Hatsuka Otowa receives a phone call from Mizumori Shrine—the Shinto shrine her family has run for generations. It's her father, who wants her to set out on a new quest immediately. Having barely returned from her previous one, Hatsuka complains. Why does she have to go, and not her older sister, Keika? But in the end she strikes a deal with her dad and agrees. On arriving at the shrine that sent out the SOS, a young priest greets Hatsuka and informs her that youkai have started to appear in the neighborhood, along with some very unseasonable snowfall. Sensing a mysterious force in the nearby woods, Hatsuka is convinced that it's the source of all the local problems and confidently sets off to complete her quest.<h3>GAMEPLAY</h3>This game features roguelike RPG mechanics, complete with dungeon layouts and enemy battle formations that change on every playthrough. It also features the fan-acclaimed \"Pandemonium\" and \"Youkai Soulshare\" systems from previous \"Dawn of Kagura\" installments. Strengthen the youkai you've accepted into your ranks and use them to face down even greater monsters!<h3>CHARACTER</h3><strong>Hatsuka Otowa</strong> (Voice: Konami Onami)<br/><br/>Weapon: Bow<br/>The second daughter of the Mizumori Shrine. She is an energetic girl who is training to become a priestess. Although her cheerful and straightforward personality is well liked by everyone, she is sometimes scolded for being too boisterous. With her special weapon in hand, Hatsuka sets out to confront youkai.", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T03:18:09", "background_image": "https://media.rawg.io/media/screenshots/e04/e04b2c4bda4ca7b58ee7407fef715466.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Debonosu Works"], "genres": ["Adventure", "Strategy"], "publishers": ["Shiravune"], "esrb_rating": null}