{"id": 719628, "slug": "alder-forge", "name": "Alder Forge", "name_original": "Alder Forge", "description": "<ul><li><strong>An Adaptive Turn-Based RPG, and an easy-to-use Combat System.</strong><br/></li><li><strong>A Story-Driven Adventure through the eyes of the 5 Members of your Party.</strong><br/></li><li><strong>A Cast of Characters with their own stories and a unique world, handcrafted and built for your enjoyment.</strong><br/></li><li><strong>An easy-to-use Camp Menu and Crafting System with equipment, party, and skills management.</strong><br/></li><li><strong>Special Skills for each Player Class, unlocked either by solving mysteries, finding new Anima Stones, or just Leveling Up.</strong></li><li><strong>Plant harvesting and Alchemy Craft made simple to help you easily acquire usability drinks during or out of battle.</strong><br/></li><li><strong>Fight, Explore and Walk the path of heroes in the world of the Alder Forge.</strong></li></ul><br/><br/><br/>The Alder Forge story is set in the western part of the Ertheryan Continent, the game will take you during its 4 chapters to the Duchy of Elysia, the Kingdom of Royne, the Mighty Kingdom of Orvys, and the Atlas Court (The seat of your employer). In your adventures you are going to face a dark plot that will try to engulf the continent and break the two centuries lasting peace, meanwhile, you will discover that nothing is ever simpler than that while facing the complexity of human behavior and the lines that draw good and evil in each character you encounter throughout your journey, secret organizations, political entities, and other groups, each has their agendas and plots, meanwhile, the 5 protagonists will be in the center of those events.<br/><br/><br/><br/><ul><li><strong>Adriel:</strong> Party Leader, known by his intelligence, pragmatism, and powers, Age:21<br/></li><li><strong>Mirabelle:</strong> Anima Caster, funny with a massive appetite, but serious when things get heated, Age:13<br/></li><li><strong>Cassandra:</strong> Heavy Arms, and the strongest defense of the team, Age:21<br/></li><li><strong>Leo:</strong> Archer and a disciple of the legendary Dead Eye, fun and quick to spot threats, Age:22<br/></li><li><strong>Fiona:</strong> An Elysian Knight, serious and unforgiving, she's equal if not stronger than Adriel, Age:21</li></ul><br/><br/><br/>The Alder Forge environment was carefully designed to convey the world you will engage and invest your time in, but it is also full of enigma, hidden secrets, and backstories, each element placed, sculpted, and handcrafted is there for a reason, <strong>The Fate of Ertherya is now in Your Hands.</strong>", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T03:12:04", "background_image": "https://media.rawg.io/media/screenshots/5b9/5b93000977dca100a4d70a1bf960db5b.jpg", "website": "https://www.gamesbyzine.com/alder-forge", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zine FALOUTI"], "genres": ["RPG", "Indie"], "publishers": ["Zine FALOUTI"], "esrb_rating": null}