{"id": 719614, "slug": "myoubouh-catcher", "name": "Myoubouh Catcher", "name_original": "Myoubouh Catcher", "description": "<strong>In Myoubouh Catcher play as the young Namobouh of the proud people of Myoubouh.</strong><br/><br/>Join Namobouh on this adventure and hunt fireflies, to put them as much as possible in a safe place, because you know, outside the village, the danger is everywhere !<br/><br/><strong>Particularity of this adventure ? Myoubouh are peaceful beings, so it is very difficult for them to eliminate an enemy !</strong><br/><br/>The Myoubouh's mainly use bows with arrows that have soporific properties and wich project enemies backwards. We must therefore think about the position of enemies before shooting and put them asleep, because they can be real alive enigmas so solve ! The worst thing about this story is that fireflies often like to stay in warm place, close to dangerous Namobouh's enemies. Myoubouh Catcher life's are comlicated, no ?<br/><br/><br/><br/>A game of adventure, action, observation and reflection, where even enemies can become small puzzles to solve.<br/><br/><br/><br/><strong>More than 300 fireflies to find ! </strong><br/><br/>Explore mysterious caves, dig holes with a pickaxe, blow cracks thanks to Klakaboums and more !<br/><br/>Collaborate directly with the Myoubouh elder in person, and enjoy a good dose of funny moments.<br/><br/>An easy mode to enjoy a more accessible gaming experience is available.<br/><br/>", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T03:01:52", "background_image": "https://media.rawg.io/media/screenshots/b69/b693296523c037a01277d8832221ab8f.jpg", "website": "https://myoubouhcorp.eldhar.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Myoubouh Corp"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Myoubouh Corp"], "esrb_rating": null}