{"id": 719741, "slug": "theomachia", "name": "THEOMACHIA", "name_original": "THEOMACHIA", "description": "THEOMACHIA\r\n<p> is a permadeath action game in which you take on increasingly difficult waves of enemies using a variety of psychokinetic abilities. In THEOMACHIA, the environment is your one and only weapon. Obtain psychokinetic abilities and use your surroundings to fight off waves of dangerous enemies - beings from another dimension sent to conquer yours.<br/></p>\n\r\nFeatures:\r\nFight off vast swarms of enemies with your psychokinetic powers!\r\n<p>In THEOMACHIA, the environment is your weapon, and you are given a variety of psychokinetic abilities that let you leverage the environment to your advantage. Push enemies away with a powerful psychic wave, or launch nearby objects at them using your telekinesis!</p>\r\nFight for your life in a randomly generated city.\r\n<p>Every time you start a game, the layout of the city is randomized, making each run a unique experience. Explore the desolate city as you fight for your life and your world.</p>\r\nUpgrade your psychokinetic powers with dozens of abilities!\r\n<p>Obtain and upgrade dozens of psychokinetic powers to create a unique build that suits your playstyle. Your abilities can allow you to glide quickly through the city, take control of the environment and your enemies, or defend yourself against the scores of enemies.</p>\n<ul><li>Flee the storm as it devours your world.\r\n</li><li>Compete for the highest score on the global leaderboard.\r\n</li><li>Survive to get stronger: each wave you survive gives you points to upgrade your abilities.\r\n</li><li>Face off against over 5 distinct and dangerous enemies.\r\n</li><li>Discover the secrets of this abandoned world, and your own past.\r\n</li><li>Traverse the world with smooth movement abilities; dash through the air, cling to buildings, and glide above the city as you run from the storm.\r\n</li></ul>", "metacritic": null, "released": "2022-01-09", "tba": false, "updated": "2022-01-10T03:48:27", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a72cedb6770b1f64221439ed48587bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daemon House"], "genres": ["Action"], "publishers": [], "esrb_rating": null}