{"id": 71977, "slug": "bubble-shooter-pop-bubbles", "name": "Bubble Shooter - Pop Bubbles", "name_original": "Bubble Shooter - Pop Bubbles", "description": "Play the classic and most addictive Bubble Shooter game for FREE, now available on the App Store and perfect for your iOS device. Blast and pop all the bubbles, solve the fun &amp; colorful puzzles and beat the challenges to reach the level’s target and win coins!<br/><br/>In this good old version you need to aim &amp; shoot, to drop &amp; burst all the colored bubbles. Train your brain with this original puzzle as you blast balls online or offline - anytime! Bubble Shooter - Pop Bubbles matching puzzle game offers different puzzles and challenges, amazing graphics and smashing levels - all for free! <br/><br/>Pop and break all the balls to move on to the next awesome level. Play and enjoy plenty of fun challenges and puzzles, and make sure to reach the target of each level, clear the board and collect coins. It’s the perfect pastime shooter game to play when you want to relax and clear your mind. <br/><br/>Aim, match and smash all the balls in this relaxing color-matching adventure. This incredible shooter is simple and easy to learn, perfect for families to enjoy! This is the ideal match puzzle game for long car rides to play with family and friends!<br/><br/>We took the classic arcade game and added some new, awesome features to this bubble game that you’ll love to relax with.<br/><br/>Play the Classic Game Mode - So Fun!<br/>Enjoy the old classic game mode. Match 3 bubbles to blast them away, and clear the board, complete the missions and win coins &amp; awesome rewards. Tap on the screen to drag the laser aim and lift it to take a shot. It’s important to form a strategy according to the different bubbles layout in each level. Shoot and pop all the colored balls in the best fun &amp; free game, aim carefully and match same colored bubbles to reach the target! Work your way through all the different challenges and puzzles, solve the brain teasers and win levels.<br/><br/>Arcade Game Mode - Never get bored!<br/>Play Bubble Shooter puzzle game in this old retro game mode to rediscover the classic arcade games. Play &amp; match through fun game levels in our arcade game mode as this addicting game gets even more challenging. Advance along thousands of fun puzzle levels, and enjoy the best retro shooter game experience anywhere you want, no WiFi needed. You can start any level over and not have to wait for lives, as they are unlimited! <br/> <br/>Levels Game Mode <br/>Smash &amp; pop colorful bubbles to advance to the next level of puzzle games! Test your skills to reach the target while playing this special &amp; addictive bubble game. Shoot the colorful balls to win the next amazing puzzle level, and test your matching skills while playing this addictive, casual game for free. Hurry up and join the balloon crushing mania, but be careful- once you start popping bubbles you simply can’t stop! <br/><br/>EXPLORE THESE FUN FEATURES: <br/>* The best classic bubble shooter game, same as the original pc version.<br/>* Addictive gameplay, once you start – you can’t stop playing.<br/>* Pop 7 bubbles in a row to fill the fireball.<br/>* Smash 10+ bubbles at once to get a bomb. <br/>* Play &amp; win 2000 + Exciting levels, with more added all the time. <br/>* New, special elements and great prizes.<br/>* Brand new effects and sounds. <br/>* Collect awesome daily rewards.<br/>* Connect to Facebook and share the fun with friends!<br/>* Leader-board, challenging achievements.<br/>* Clear obstacles and beat the challenges to reach your target. <br/>* Colorblind mode – so everyone can enjoy fun matching games for free.<br/>* Play anytime and anywhere, no WiFi connection is required! <br/><br/>So get ready, take aim, pop &amp; shoot all bubbles!!<br/><br/>Download NOW the Best Bubble Breaker Game &amp; Start Cracking Bubbles!<br/><br/>Every 2-3 weeks, we add new features and new levels. Come and join the fun!<br/><br/><br/>Bubble Shooter - Pop Bubbles is free to download and play, but contains in-app purchases. You can turn off the payment feature by disabling in-app purchases in your device’s settings.<br/><br/>Subscriptions automatically renew unless turned off at least 24 hrs before current period ends. Manage subscriptions via iTunes account settings", "metacritic": null, "released": "2013-02-22", "tba": false, "updated": "2019-07-29T07:04:40", "background_image": "https://media.rawg.io/media/screenshots/001/00188e0737e78e59e2debc0b195186ba.jpg", "website": "http://www.ilyon.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Ilyon Dynamics"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Ilyon Dynamics"], "esrb_rating": "Everyone 10+"}