{"id": 719785, "slug": "vividlope-working-title", "name": "VIVIDLOPE [working title]", "name_original": "VIVIDLOPE [working title]", "description": "<p>VIVIDLOPE is an arcade game with a puzzle flavor, where the goal is to color the stages with the right color. Step on the tiles until you&#39;ve cleared the target percentage. Sounds easy? It&#39;s anything but! In this twisted realm, walking on walls and ceilings is a regular occurrence, as the gravity beneath your feet constantly adapts to where you&#39;re going. On top of that, hostile beings continuously arrive through the portals and the color changing patterns become more complex as you beat the stages, so keep calm and stay grounded - as long as you remember wherever the ground is!</p>\n<ul>\n<li>Arcade game with a puzzle bent  </li>\n<li>Dazzling stages to traverse from all sides  </li>\n<li>Nonlinear progression - pick the stage you want to go to next, save the difficult ones for later  </li>\n<li>The Power Meter mechanic rewards smart routing with higher speed - think ahead and boost your chances of survival, or even enter the special Bonus Phase and try clearing 100% of the stage!  </li>\n<li>Plethora of different obstacles that will keep you on your toes - maneuver between shockwaves, squeeze into tight openings and outsmart the foes darting your way  </li>\n<li>Lots of stuff that will help you on your way - kick the paint rollers, burst the dusty flowers, and more!  </li>\n<li>Grab the items and go wild with the souped-up powerups - dispatch enemies, flush the screen with a flurry of colors!  </li>\n<li>Ranking system that will keep you coming back!</li>\n</ul>", "metacritic": null, "released": null, "tba": true, "updated": "2023-01-13T04:24:17", "background_image": "https://media.rawg.io/media/screenshots/a45/a4593e18d1d0ae809bb83289a7cddbf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["jaklub"], "genres": ["Action", "Arcade", "Puzzle"], "publishers": ["Jakub"], "esrb_rating": null}