{"id": 71984, "slug": "walking-dead-road-to-survival", "name": "Walking Dead: Road to Survival", "name_original": "Walking Dead: Road to Survival", "description": "<p>The Walking Dead: Road to Survival is the official strategy RPG game of The Walking Dead. Join Rick, Michonne and other iconic Walking Dead characters and build your ultimate team of survivors as you battle through the zombie apocalypse.<br />\nThe Walking Dead: Road to Survival is the definitive zombie strategy RPG game, brought to you by Robert Kirkman, creator of The Walking Dead comic series.<br />\nFight for survival against walkers and humans alike and use strategy against enemies in this adventure RPG. Build a town to keep the walkers at bay, but be warned – the horrors that lurk outside aren’t the only threat.<br />\nBased on an all-new story from award-winning Walking Dead writer Jay Bonansinga. Make uncompromising decisions and develop your survival strategy.<br />\nTHE WALKING DEAD: ROAD TO SURVIVAL FEATURES:<br />\nFight Walkers &amp; Survivors<br />\n• Battle fierce opponents and use your best survival strategy<br />\n• Headshot! Land critical hits and deal crippling blows to zombies and your enemies<br />\n• Attack with special melee and ranged attacks using deadly weapons like Michonne’s katana<br />\nAlliances and PvP RPG gameplay<br />\n• Raid enemies: Choose you battle strategy to raid enemy players for their resources<br />\n• Factions: Forge an alliance with other players to help each other through battles<br />\n• Territories: You and your Faction fight to claim and hold valuable land and resources by enemies<br />\n• All Out War: Face off against other Factions around the world in the ultimate limited time events<br />\nStrategy RPG - Capitalize on Strengths &amp; Exploit Weaknesses<br />\n• Battle strategy is key to scoring powerful hits – but watch out for retaliating strikes<br />\n• Your battle strategy needs to keep the Survivors of Woodbury safe – Strike to win<br />\nUpgrade Your Survivors<br />\n• Level up and customize Survivors to enhance their weapons and skills<br />\n• RPG progression makes your Survivors stronger to cut down more walkers<br />\n• Collect new Survivors from The Walking Dead universe, each with their own specialized battle strategy<br />\nMaps &amp; Locations From The Walking Dead<br />\n• Explore a new 3D map featuring real locations from the comics<br />\nBuild your Base &amp; Expand into the Wasteland<br />\n• Build and maintain your community of houses to hold Survivors, a Town Hall, a Workshop and more<br />\nBattle in Iconic The Walking Dead Locations<br />\n• Fight alongside your faction for control of well-known areas<br />\n• Battle, conquer and defend locations like Alexandria, Woodbury, Sanctuary and more<br />\nLive In-Game Events<br />\n• Play to obtain valuable resources and new, exclusive Survivors<br />\nWalkers tear at your city walls while desperate Survivors rip apart the town’s foundations from the inside. When the time comes to fight, what will you choose?<br />\nSurvivors Club free trial will convert to a monthly subscription after 7 days (when a free trial is applicable). A payment of $24.99/month will be charged to your iTunes account when the subscription begins, and it will auto-renew monthly unless turned off at least 24 hours before the end of a subscription period. Renewal payments will be charged within 24 hours before the end of the subscription period, at a price of $24.99/month. Prestige Points are awarded after every renewal. Unused portions of free trials will be forfeited upon purchase of a subscription. You can manage subscriptions and turn off auto-renewals in your device account settings.<br />\nTerms of Service: http://scopely.com/tos/<br />\nPrivacy Policy: http://scopely.com/privacy/</p>", "metacritic": null, "released": "2015-08-26", "tba": false, "updated": "2023-02-09T02:29:25", "background_image": "https://media.rawg.io/media/screenshots/b4a/b4a5d9e44814b18b454935f11a84d9dd.jpg", "website": "http://scopely.com/game/the-walking-dead/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Scopely"], "genres": ["RPG", "Strategy"], "publishers": ["Scopely - Top Free Apps and Games"], "esrb_rating": "Mature"}