{"id": 719988, "slug": "item-synthesis-and-dungeon-explorationtestplay", "name": "Item synthesis and dungeon exploration(testplay)", "name_original": "Item synthesis and dungeon exploration(testplay)", "description": "Collect, synthesize, fight! Win with the items you produce!\r\n\r\n<p>This is a game created for people who don't have time on a daily basis, but like to \"collect, synthesize, and fight\".</p>\n<p>It provides smooth game progress and crunchy combat.</p>\n\n<p>The demo version is expected to take about 2 to 3 hours to complete, while the Steam version is expected to take about 15 hours total.</p>\n<p>https://store.steampowered.com/app/1838660<br/></p>\r\nCollecting.\r\n\r\n<p>First, save up money to expand your farm.</p>\n\r\nSynthesis.\r\n<p>Once you've saved up enough money to buy a recipe, you can combine it with items you've collected in the farm, field, or dungeon!</p>\n<p>Create your own items.</p>\n\r\nCombat.\r\n<p>There are no normal attacks in this game. You attack with synthesized items. Items are also used to recover. Special moves are also used to heal and give buffs and debuffs.</p>\n\n<p>The enemy attacks are very severe, and if you do nothing for three turns after the battle begins, you will lose. Each of the items you synthesize has a unique ability, such as status adjustment and abnormalities, so make full use of them in your fight.</p>\n<p>Spikes</p>\n<p> Increases physical attack and decreases physical defense.</p>\n<p>Fire</p>\n<p> Increases magic attack and decreases magic defense.</p>\n<p>Water</p>\n<p> Reduces physical attack and increases physical defense.</p>\n<p>Ice</p>\n<p> Reduces magic attack and increases magic attack</p>\n<p>Earth</p>\n<p> Increases agility or decreases agility</p>\n<p>Wind</p>\n<p> Slows down the opponent's turn order while giving agility reduction.</p>\n<p>Cooking</p>\n<p> Gives state abnormality recovery, special attack gauge recovery, and HP recovery every turn</p>\n<p>Battles will be Active-time battles, with turns based on agility speed.</p>\n<p>There are many items that adjust your agility speed, so please adjust your agility to advance the battle to your advantage.</p>\n<p>Please enjoy the one-on-one combat, not one-on-many.</p>\r\nDungeon Exploration.\r\n<p>There are seven dungeons in total, with twelve levels, and the bosses are powerful enemies.</p>\n<p>Items are limited, so if you use only the strongest items, the endgame will be difficult.</p>\n<p>Pick up and produce items in the dungeon, while sometimes running away from the dungeon to get to the next level.</p>\n\r\nStory.\r\n<p>There isn't much of a story, but the protagonist must conquer a total of seven dungeons in order to reach the Demon King's Castle.</p>\n<p>The items you can get are gradually getting better as the story progresses.</p>", "metacritic": null, "released": "2022-01-09", "tba": false, "updated": "2022-01-10T04:45:22", "background_image": "https://media.rawg.io/media/screenshots/542/54293440ffbdf1057aac392d2c3d6372.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OikariBuncho"], "genres": [], "publishers": [], "esrb_rating": null}