{"id": 71998, "slug": "steampumpkins-catapult-action", "name": "Steampumpkins: Catapult Action", "name_original": "Steampumpkins: Catapult Action", "description": "Join the battle and conquer the world with your catapult! Attack your opponent with hard-hitting catapult fruit on real locations around the globe. Whoever scores the most fruit bullseyes, wins!<br/><br/>An exciting artillery shooter game in a stylish steampunk look awaits you. Compete in thrilling duels and use your catapult and compass to aim for real places around the world. Which way is New York, or how far away is Tokyo? The better you guess, the harder you hit your opponent!<br/><br/>Do you have the talent to become a real general? Stand up to friend and foe: Upgrade your catapult to improve your attack power and arm yourself against devastating attacks. Plant sticky melons, stinking durian, rock-hard cherimoya, explosive dragonfruit or nimble pumpkins in your ammunition farm and test their special properties directly on your opponent. Command a steamboat to collect new gadgets for your catapult and share them with friends.<br/><br/>-\tPlay the world's first location-based artillery game <br/>-\tChallenge friend and foe to epic battles across the globe<br/>-\tConquer every country in the world and defend them in duels<br/>-\tEquip your friends with tactical gadgets and combine your strengths<br/>-\tPlant and harvest new fruits with special abilities<br/>-\tUpgrade your catapult and be the first to conquer the Steampunk world!<br/>PLEASE NOTE! Steampumkins can be downloaded and played for free. Some items in the game can also be purchased for real money. If you do not want to use this feature, please disable In-App purchases in your device's Preferences.<br/><br/><br/>***** <br/>Questions or suggestions for improvements: <br/>E-Mail to ios@steampumpkins.net<br/>We are looking forward to your feedback! <br/><br/>For more information on news and updates: www.steampumpkins.net or visit us on www.facebook.com/steampumpkins and twitter.com/Steampumpkins<br/>*****", "metacritic": null, "released": "2017-09-27", "tba": false, "updated": "2019-07-29T15:44:08", "background_image": "https://media.rawg.io/media/screenshots/39c/39c97ec97d7ef99e3108eb37f20acce9.jpg", "website": "http://www.steampumpkins.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["USM"], "genres": ["Action", "Strategy"], "publishers": ["United Soft Media Verlag"], "esrb_rating": null}