{"id": 719918, "slug": "windows-98-second-edition", "name": "Windows 98 Second Edition", "name_original": "Windows 98 Second Edition", "description": "<p><strong>Windows 98</strong> is an operating system developed by Microsoft as part of its Windows 9x family of Microsoft Windows operating systems. It is the successor to Windows 95, and was released to manufacturing on May 15, 1998, and generally to retail on June 25, 1998. It is the second 16-bit and 32-bit<a ]<3]<=\"\" a=\"\" href=\"https://en.wikipedia.org/wiki/Windows_98#cite_note-Multitask-3\"></a> monolithic product with the boot stage based on MS-DOS.<a ]<4]<=\"\" a=\"\" href=\"https://en.wikipedia.org/wiki/Windows_98#cite_note-Architecture-4\"></a><a ]<4]<=\"\" a=\"\" href=\"https://en.wikipedia.org/wiki/Windows_98#cite_note-Architecture-4\">\n</a></p>\n<p>Windows 98 is a heavily web-integrated operating system that bears numerous similarities to its predecessor and relies on the HTML  language. Most of its improvements were cosmetic or designed to improve  the user experience, but there were also a handful of features  introduced to enhance system functionality and capabilities, including  improved USB support and accessibility, as well as support for hardware advancements such as DVD players. Windows 98 was the first edition of Windows to adopt the Windows Driver Model, and introduced features that would become standard in future generations of Windows, such as Disk Cleanup, Windows Update, multi-monitor support, and Internet Connection Sharing. \r\n</p>\n<p>Microsoft had marketed Windows 98 as a \"tune-up\" to Windows 95,  rather than an entirely improved next generation of Windows. Upon  release, it was generally well-received for its web-integrated interface  and ease of use, as well as its addressing of issues present in Windows  95, although some pointed out that it was not significantly more stable  than its predecessor. Windows 98 sold an estimated 58 million licenses,  and saw one major update, known as Windows 98 Second Edition (SE), released on May 5, 1999. After the release of its successor Windows Me in 2000, mainstream support for Windows 98 and 98 SE ended on June 30, 2002, followed by extended support on July 11, 2006. \r\n</p>", "metacritic": null, "released": "2022-01-09", "tba": false, "updated": "2022-01-10T04:29:34", "background_image": "https://media.rawg.io/media/screenshots/ce6/ce6991a1590f6a46ff40b03ef77bed83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SadSpunchBop"], "genres": [], "publishers": [], "esrb_rating": null}