{"id": 720003, "slug": "only-in-omerica-early-release", "name": "Only in Omerica (early release)", "name_original": "Only in Omerica (early release)", "description": "<p><strong>Note: </strong>This is an unedited, rough version of the zine. I plan to have it edited and put into print within the next three to four months. Any suggestions you have for the final version in the mean time are appreciated in proportion to their quality. Buying this now gives you free future access to the final, edited version of the digital release.</p>\n<p>If you play, or even just read, this, I'd love to hear from me. You can contact me by leaving a review or rating on this page or by sending a direct message to @GamesDropbear on twitter. <br/></p>\n<p>★\r\n</p>\n<p>Only in Omerica is an metamodernist fever dream version of America, in the form of a complete independent third-party setting for Troika!, The Otherworld’s Favourite RPG.</p>\n<p>★</p>\n<p>36 new backgrounds, including Elvis Impersonator, Femme Fatale, Celebrity-in-Hiding, Boot Bootlegger, Tortured Metaphor, Radical Academic, Rebel Musician, Reborn of the Corn, Typical Teenager, Stranded Alien and Tumbleweed Priest.</p>\n<p> 8 new spells, including Broadcast, Small Town Curse and Riot!</p>\n<p>16 new enemies, including Brain Wiper, Forest Cryptid, Possessed Murderer, God Beneath the Waves, and Sewer Creep!</p>\n<p>3 short adventures: The Case of the Air Cooler Killings (mystery) Motel Dungeon (dungeon-crawl), and Highway to Purgatory (??)</p>\n<p>Six 18-item random tables for Events, Loot, Media, Strangers, Rumours and Visions!</p>\n<p>★</p>\n\n\n<p>Only in Omerica is an independent production of Dropbear Games, and is not affiliated with the Melsonian Arts Council.</p>\n<p>The contents of this zine are for gaming and entertainment purposes only, and should not be taken as endorsement of criminal activity, cult engagement, or being an American.</p>", "metacritic": null, "released": "2022-01-09", "tba": false, "updated": "2022-01-10T04:49:02", "background_image": "https://media.rawg.io/media/screenshots/45b/45b73bd38b15cacffb519dc479ee2d50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dropbear Games"], "genres": [], "publishers": [], "esrb_rating": null}