{"id": 72007, "slug": "solitaire-diamond-card-game", "name": "Solitaire Diamond Card Game", "name_original": "Solitaire Diamond Card Game", "description": "SOLITAIRE DIAMOND is an exciting card game to pass your day - anywhere, any time. Whether you are at home on lazy day, at the office taking a break, or outside with your mobile soaking in the sun, spice up your day with a card game of SOLITAIRE DIAMOND. Escape a mundane task with a quick win that will rejuvenate your spirit!<br/> <br/>If you are familiar with Window Solitaire, you will love SOLITAIRE DIAMOND. Under the Klondike category, SOLITAIRE DIAMOND is carefully designed with a fresh modern look, woven into the wonderful classic and professional feel. <br/> <br/>Why play SOLITAIRE DIAMOND? Card games like SOLITAIRE DIAMOND give you an easy and familiar way to “challenge” your brain just a bit each day. As we’ve seen, staying intellectually engaged in this way may give your brain some added protection against memory loss. In addition, gameslike SOLITAIRE DIAMOND can be relaxing and ease emotional distress.<br/> <br/>SOLITAIRE DIAMOND FEATURES:<br/>• Beautiful and easy to read cards<br/>• Reliable, smooth, and comfortable game interface <br/>• Draw 1 card (Easy)<br/>• Draw 3 cards (Hard)<br/>• Single tap to place a card or drag and drop<br/>• Interruption friendly with Auto-save and resume<br/>• Smart hints<br/>• Unlimited undo<br/>• Advanced autocomplete option to finish a solved game<br/>• Right or left handed play<br/>• Various Cards options (Modern Cards, Extra Large Card-Symbols, Maintain Card Spacing, Card Bouncing)<br/>• Visit Help screen for game support (Introduction, Rules,Interaction, Tips, Scoring, Draw 1 &amp; Draw 3 cards…)<br/>• Personal Statistics to see how good you are<br/>• Game Center Leaderboards for high score ranking<br/> <br/>Usually the successful card players have developed their intelligence levels. They are able to use their brain constantly and it helps them enhance different mental skills. SOLITAIRE DIAMOND can always be an excellent game where you can continuously have to deal with cards, numbers, and you have to apply different strategies.<br/> <br/>You can move cards with a single tap or drag them to their destination. You can either play the easy Draw 1 games where most games are winnable or if you feel up to the challenge, try your luck with Draw 3 mode, test your brain power and the logic that you can find in this free SOLITAIRE DIAMOND card game.<br/> <br/>So spend a few minutes today digging out that deck of card sand playing a few rounds of SOLITAIRE DIAMOND. This can be a great way to pass the time and give our brains a little boost!<br/> <br/>Happy Solitaire!<br/> <br/>~ SOLITAIRE DIAMOND TEAM ~", "metacritic": null, "released": "2016-11-08", "tba": false, "updated": "2019-10-22T14:25:11", "background_image": "https://media.rawg.io/media/screenshots/831/8312d5e195c307a368c60fcabf4e65c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Free Block Puzzle Games"], "genres": ["Board Games", "Card"], "publishers": ["Free Block Puzzle Games"], "esrb_rating": null}