{"id": 720018, "slug": "solar-run-patrick-sramka", "name": "Solar Run (Patrick Sramka)", "name_original": "Solar Run (Patrick Sramka)", "description": "<p><strong>Solar Run</strong> is a <strong>2D Platformer</strong> inspired by Super Mario Bros. It is also a game driven not by it's mechanics, but through it's story.  </p>\n<p>And its story is about an astronaut who was sent on a secret mission to retrieve a mysterious object from<strong> beyond the Solar System</strong>. On his way back, he's forced to crash-land on planet Neptune. </p><p>Despite his situations looking hopeless, he's not giving up and is working hard to find his way home.\r\n</p>\n<p>He will need to run from planet to planet until he reaches Earth. Of course this task is not going to be easy, because a mysterious creatures that were behind his crashing in the first place are on his tail at all times!<br/></p><p>_____________________________________________</p><p><em>Hi, Patrick here. Just wanted to say couple words that might inspire fellow starting game developers.<br/></em></p><p><em>I made Solar Run back in 2019 and it was the first game I have ever made. As you can see by playing, it is only one level as I ran out of time to make more for the assignment I chose this to make it for. </em></p><p><em>I may come back to this game one day for sentimental reasons, but for now, I like it to stay like this, as it is a nice reminder that the first games you make don't have to be perfect or finished, they just need to get you started on your journey.</em></p>", "metacritic": null, "released": "2022-01-09", "tba": false, "updated": "2022-01-10T04:52:54", "background_image": "https://media.rawg.io/media/screenshots/ee4/ee409d914bf3dcebabba04d89ff73587.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Patrick Sramka"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}