{"id": 72014, "slug": "ace-wins-all-classic-card-game", "name": "Ace Wins All Classic Card Game", "name_original": "Ace Wins All Classic Card Game", "description": "One of the most classic card game of all, and with one simple rule: the Ace gets all the cards. Now with online multiplayer! In Ace Wins All, your memory is your strength. Collect more cards than your opponent by either MATCHING PAIRS or laying down an ACE (to collect the whole bunch of cards on the table!), but KEEP TRACK of what’s been played to stay ahead of the game! Perfect for relaxing a bit on your spare time at home or to keep you brain awake on the go and commuting.<br/>A great game for KIDS and adults alike - challenging enough for advanced players and also a great way to teach some simple math and memory skills to the little ones. <br/>Get it now for FREE! Unlock achievements and beat your friends on the exclusive leaderboard.<br/><br/>And do not miss out on our La Scopa and La Briscola to have a complete classic card game suit on your iPhone and iPad!<br/><br/>Ace Wins All features:<br/>- Online multiplayer: play with friends and other players all over the world<br/>- Choose your level: 3 difficulty modes against the computer (A.I. artificial intelligence)<br/>- Play both LANDSCAPE and PORTRAIT orientation<br/>- Fun and challenging achievements to unlock on Game Center<br/>- Be part of the Global High-Score (Leaderboard): there’s one for each difficulty level.<br/>- Choose your deck: La Scopa got all the original Italian regional decks (Napoletane, Siciliane, Piacentine, Piemontesi, Triestine and more), in high resolution that will look astonishing on your iPhone and iPad. Or you can play with the classic Poker cards (French)!<br/><br/>FOLLOW US<br/>facebook/outofthebit<br/>Twitter @outofthebit", "metacritic": null, "released": "2010-08-26", "tba": false, "updated": "2019-07-29T08:25:50", "background_image": "https://media.rawg.io/media/screenshots/78b/78bd28dd298eba2bd1c497a3276a66e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OutOfTheBit"], "genres": ["Board Games", "Card"], "publishers": ["OutOfTheBit"], "esrb_rating": null}