{"id": 720498, "slug": "korvals-curse", "name": "Korval's Curse", "name_original": "Korval's Curse", "description": "<p>Created for a 2021 Winter Jam! This is a roguelike wave-based action game where the goal is to survive as long as possible, collecting items from slain enemies along the way, trying to out-muscle the enemies before they outnumber you. The theme for this jam was \"one room,\" hence the limitation to one room.</p>\n<p>Controls: WASD or arrow keys to move. Point and click to aim and shoot. Right click is an alt attack with a longer cooldown that fires a tracking projectile but does less damage.<br/></p>\n<p>THIS BUILD IS AN EARLY DEVELOPMENT ALPHA BUILD. There are several known bugs at the moment:</p>\n<ul><li>The WebGL version won't render the UI in the right positions</li><li>Sometimes wave 2 music doesn't start until the second round</li></ul>\n<ul><li>Waves will desynchronize if enemies are killed to quickly, and this will also cause the soundtracks to either stop playing, play out of order, or play at the same time</li><li>Soundtracks mysteriously come to a complete stop upon death</li></ul>\n<p>Please let me know if you find any more that you think are worth fixing.</p>\n<p>PLANS FOR THE FUTURE</p>\n<ul><li>The game framework allows me to easily create more enemy, item, and projectile variants, so I intend to add more of those (added several new variants since first writing)</li><li>I can also add more player attacks, choices between attacks, and potentially a system for changing or gaining attacks during a run<ul><li>Actually there already is a second player attack, but it's extremely overpowered so I disabled it in the build Added second player attack and rebalanced</li></ul></li><li>The most difficult is creating new enemies with varied attacks and new soundtracks, which I would need both of for a new wave, but if having a third or fourth wave ends up being important enough I will</li><li>Win conditions or difficulty settings (both very easy to implement)<ul><li>Added new difficulty level (faster progression, 100% item drop rate)</li></ul></li><li>In-game tutorial or help</li><li>Menu containing items acquired, their descriptions, and lore pieces associated with them (already written, just haven't made a menu for it yet)</li><li>Roguelite mechanics of some kind - unlock items or attacks for your next runs by beating certain enemies, difficulties, achievements, etc</li><li>More sound effects</li></ul>\n<p>Thank you for playing!</p>", "metacritic": null, "released": "2022-01-08", "tba": false, "updated": "2022-01-10T06:44:17", "background_image": "https://media.rawg.io/media/screenshots/c0c/c0cd0d6b338ed3b798d7387d5bcc101b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DereferenceMyPointer"], "genres": ["Action"], "publishers": [], "esrb_rating": null}