{"id": 72049, "slug": "sonic-beat", "name": "Sonic Beat", "name_original": "Sonic Beat", "description": "No guitar? No problem! Tap to your favorite MP3s and StepMania dance tracks. Tap, hold, and swipe to the beat of the music with gameplay inspired by the popular Theatrhythm music game. Simple, precise controls make for a game that’s easy to learn and challenging to master. All levels are free and hand-made to match songs from your music library. New songs are supported all the time! Expand your music library even further by importing thousands of free songs from the popular dance game StepMania!<br/><br/>So how does it work? How can every level be free? Easy: just have your songs downloaded to your phone, and Sonic Beat does the rest! Purchase music from your favorite digital store and the game will detect it on your device.<br/><br/>FEATURES:<br/>• Simple two-thumb gameplay! Tap, hold, and swipe to the beat.<br/>• Three difficulty modes ranging from beginner to expert! Easy to pick up and challenging to master.<br/>• Precise, lag-free controls!<br/>• Leaderboards featuring your Facebook friends!<br/>• All downloadable content is completely free! Just download the matching digital music from your song library to your phone.<br/>• New songs are added all the time!<br/>• Additionally supports thousands upon thousands of songs freely available from StepMania!<br/><br/>TONS OF SONGS TO PLAY:<br/>• Comes with four free songs ready to play! “Firelight” by Kubbi, “Vindicate Me” by Big Giant Circles featuring Mega Ran, \"Farmers Market Princess\" by The Strips, and \"Sleeping After College\" by Debutante.<br/>• Popular modern hits such as “Cake by the Ocean” by DNCE and “Uptown Funk” by Mark Ronson.<br/>• Classic, epic songs from the past including “Thunderstruck” by AC/DC and “Wanted Dead or Alive” by Bon Jovi.<br/>• Every genre ranging from 90’s alternative with “Semi-Charmed Life” by Third Eye Blind, to melodic metal with “Bat Country” by Avenged Sevenfold.<br/>• Amazing songs from the Internet Age you can’t live without, such as “Hold Back the Night” by The Protomen and “Prom Night” by Anamanaguchi.<br/>• Hits for the whole family including “Call Me Maybe” by Carly Rae Jepsen and, yes, even “Let It Go” from the Frozen soundtrack.<br/>• And many, many more! Do you have a song we should include in the game? Request it from directly within the game itself!", "metacritic": null, "released": "2016-06-02", "tba": false, "updated": "2019-07-30T03:31:36", "background_image": "https://media.rawg.io/media/screenshots/ace/aced0d2ae1700c1d8a99f785721ae8bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Firecracker Software"], "genres": ["Arcade", "Casual"], "publishers": ["Firecracker Software"], "esrb_rating": "Everyone 10+"}