{"id": 720632, "slug": "spellsword-arena", "name": "Spellsword: Arena", "name_original": "Spellsword: Arena", "description": "<p>Spellsword: Arena is an action-spelling arcade game where you fight enemies by spelling words. Letters have unique powers that may be critical to defeating the different enemies. Longer words are more likely to activate a letter's power.<br/></p>\n<p>To move, just click the desired location. Click on an obelisk (the dark towers) to enter combat there. In combat, pick up letters to make words.  When the \"attack\" button turns green (indicating a valid word), you can fire off a spell. Click on a letter to move it to and from your word bar. A long-press will erase a letter you already have.</p>\n<p>To enter Debug mode (and cheat a little), hit the \"D\" at the end of Spellsword on the title screen.  It will then bring up a debug menu in the game that you can use to give yourself free access to all the different letter abilities.<br/><br/>-- Changes from Spellsword: Prologue --</p>\n<p>- 10 letters abilities that can be attached to any letters. Longer words make the letter abilites more likely to be activated, and more powerful letters yield more powerful effects. Try attaching Frozen to a Q, for example.</p>\n<p>- Easier entry into combat. Just walk up to one of the 6 nearby obelisks</p>\n<p>- Different enemies, each with their own strategy and special abilities.</p>\n<p>- Different biomes that may reward certain player strategies</p>", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T07:16:04", "background_image": "https://media.rawg.io/media/screenshots/f41/f4145c1df986758da60b6baac1204550.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Defrag"], "genres": ["Action"], "publishers": [], "esrb_rating": null}