{"id": 720764, "slug": "xpellit-alpha-test", "name": "XPELLIT ALPHA TEST", "name_original": "XPELLIT ALPHA TEST", "description": "<p><strong>THIS APK IS FOR XPELLIT ALPHA TEST ONLY</strong><br/></p>\n<p>This version is incomplete and has many bugs, if you are waiting for a complete gaming experience we recommend you wait for the official version at launch.<br/><br/>XPELLIT is a game of swords and magic with anime style for a third person online where you can create the character class you imagine.<br/><br/>In XPELLIT we have XPELLITEMS, which are objects that command the world of XPELLIT, these objects can be skills or equipment that you can obtain by exploring the dungeons that drop the bosses of these instances.<br/><br/>These objects maintain different stats which you can combine to form a predetermined class, for example, if you want to be a healer then you must arm yourself with equipment type XPELLITEMS with healing stats and skill xpellitems to heal and help your comrades.<br/><br/>There are no ends of combinations you can create, you can be a warrior, magician, priest, assasin or even you can create new hybrid classes, the possibilities are in your imagination.<br/><br/>Features:<br/><br/>-You will have access to the dungeons where you can farm items<br/><br/>-You can play pvp in a 5v5 where you can compete against other teams<br/><br/>-We have a little store where you can get skins<br/><br/>-We have more than 70 items in the game that you can equip on your characters<br/><br/>For now you can participate in the BETA join at Discord:<br/><br/>https://discord.gg/Km9FaEsXbj</p>", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T07:46:38", "background_image": "https://media.rawg.io/media/screenshots/a8a/a8a0f0e1f9c18cea106334c59aabde4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["XPELLGAMES"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}