{"id": 720872, "slug": "pursuer-demo", "name": "Pursuer Demo", "name_original": "Pursuer Demo", "description": "I recommend downloading because it looks a little nicer and doesn't stutter. it's up to you\r\na highly experimental FPS where you navigate a procedurally generated labyrinth, picking up items while avoiding a single enemy. \r\nHOW TO PLAY\r\n<p>Standard FPS controls. ESC to pause while in game. ALT-F4 to close</p>\n<p>Collect 5 skulls then kill the creature that pursues you.</p>\n<p>As you collect skulls, the monster will grow in strength</p>\n<p>until you pick up the 5th skull, you will be unable to kill him</p>\r\nTIPS\r\n<ul><li>After picking up a few skulls, the monster will speed up over time. Damaging it will slow it down</li><li>The secondary fire from the shotgun consumes 2 shells, but is more powerful.</li><li>You can stagger the monster easily with 2 shells, or with 1 if you risk getting very close.</li><li>You can use the blastback from the shotgun to reach high places. careful not to fall out of the map :P</li><li>Pressing JUMP before you land will let you maintain your speed if you can find a way to get speed</li><li>bouncing off a ramp while going down will give you a speed boost, as will the shotgun</li><li>You always die in 3 hits no matter how much time has passed</li></ul>\r\nKNOWN ISSUES\r\n<ul><li>Weird clipping with the shotgun, the environment, and your GUI. I just have to put multiple cameras in the scene to fix it. I'll get to it</li><li>winning looks really stupid</li></ul>\r\nFUTURE?\r\n<p>I'm planning to create an anthology of multiple different scenarios, each with their own level, weapons, enemies, and objectives. I want to play with things like teleporting enemies, different types of impassable terrain, squads of multiple enemies that act as a unit, etc. For now, I'm just making the tools to make further progress and experimentation easier </p><p>To watch for future updates: follow me on twitter https://twitter.com/weekendwizardry or... follow me on itch??? is that a thing?</p>", "metacritic": null, "released": "2022-01-07", "tba": false, "updated": "2022-01-10T08:16:01", "background_image": "https://media.rawg.io/media/screenshots/7f1/7f1dbeaa77d170d698fb84d2ddecc9e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["WizardDev"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}