{"id": 720917, "slug": "bio-gun", "name": "Bio-Gun", "name_original": "Bio-Gun", "description": "<p>Plunge Head First into Microscopic Action<br />\nInject yourself into the zany world of Bio-Gun. Play as Bek, a vaccine created from pig DNA, on his mission to save his creator&#39;s dog from the destructive Dooper Virus. Befriend cells along your journey, explore to collect key information and items, and fight to save vital organs from failing before it&#39;s too late! Will you be the vaccine to save dog-kind from extinction or will DocX once again return to the drawing board?<br />\nGame Features<br />\nSide-scrolling twin-stick Shooter action, with all the modern gameplay mechanics you’ve come to expect and more.<br />\nA large injection of charming and fleshy characters brought to life with traditional 2D frame-by-frame animation.</p>\n<p>Slick and intuitive 2D controls. Dodge, blast and gas your way through all sorts of infections and illnesses.<br />\nExplore a microscopic world full of cells, organs, Bacteria, and Viruses.<br />\nBlast through the corridors of the body your way! Acquire the same abilities in different ways to make exploring the body uniquely your journey.<br />\nUpgrade your arsenal and stats by trading globs with the local shopkeeper or locating them amongst the corridors of the body.<br />\nEquip collectible helmets! The regions of the body are ripe with them, how strange. Blast your way in your own style!</p>\n<p>Scan your surroundings including NPCs, Enemies, and Items to add them to your log book to learn more about the Nanosized world that surrounds you.<br />\nBefriend Nisms and use those friendships to overcome difficult challenges discover secrets and affect the world you&#39;ve been injected into.<br />\nA Blood pumping and Lively score accompanies the player on their mission, composed by Juhani Junkala. His score is the heartbeat of Bio-Gun.<br />\nSave DocX’s best friend from falling hopelessly ill to prove that you&#39;ll be the vaccine that can save the world.</p>", "metacritic": null, "released": "2022-08-30", "tba": false, "updated": "2022-01-10T09:34:52", "background_image": "https://media.rawg.io/media/screenshots/b70/b70ae0453878f40cd64266801a0caf28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dapper Dog Digital"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}