{"id": 72091, "slug": "doodle-god-hd-blitz", "name": "Doodle God HD Blitz", "name_original": "Doodle God HD Blitz", "description": "Over 180 Million Players Worldwide!<br/> <br/>NEW Planet Mode &amp; NEW Content!<br/>Watch Your World Come Alive as You Play!<br/> <br/>NOW Available in 13 Languages<br/> <br/>BE A GOD AND CREATE A NEW UNIVERSE<br/><br/>In this addictive, ALL ages, puzzle game mix and match different combinations of fire, earth, wind and air to create an entire universe! As you create each element watch your world come alive as each element animates on your planet. The new “Planet” mode offers a new challenging way to create a universe of your dreams.<br/><br/>Of course the universe was not created in a day. You’ll have to work your up from a simple microorganism to create animals, tools, storms and even build armies before you have what it takes to build the universe! But beware, the power of creation may have unintended consequences, inventing the wheel might just trigger a zombie plague… Don’t worry, you are not alone on this cosmic journey! Every time you successfully create a new item you’ll be rewarded with the wit and wisdom of some of the greatest philosophers and comedians of all time. Unleash your inner god with Doodle God™!<br/><br/>NEW GAMEPLAY FEATURES<br/><br/>- Now available in 13 languages: English, Dutch, French, Spain, Italian, Russian, Japanese, Chinese, Korean, Portuguese, Swedish, Polish &amp; German.<br/>- NEW Visual “Planet” Mode allows players to see their planet come alive as you play.<br/>- NEW “Mission” Mode offers new challenging puzzles<br/> <br/>-New Artifacts Mode: Collect ancient artifacts like Stonehenge created by amazing triple reactions.<br/>- Mold fire, wind, earth and air to create the Universe.<br/>- Create 300+ advanced items and concepts.<br/><br/>- Intuitive one-click game play encourages thoughtful, creative play <br/><br/>- Hundreds of interesting, funny and thought-provoking quotes and sayings.<br/>- New “Puzzle” mode. <br/>Create locomotives, sky scrappers and more<br/>- New “Quests” mode. Can you save the Princess or escape a Desert Island?<br/>- New reactions with existing elements and episodes.<br/>- New achievements.<br/>- New Elements encyclopedia with wikipedia links.<br/>- Improved mini-games for arcade fans.<br/> <br/>CRITICS LOVE IT!<br/> <br/>&gt;Apple REWIND AWARD<br/>&gt;“Wonderfully unique concept. Deeply satisfying!” – GameZebo<br/>&gt;“Giving it huge thumbs up!\" - TUAW<br/>&gt;“It’s addictive. Insanely so! Lots of fun.” – 148Apps<br/>&gt;“Discovering each new element was an utter delight.\"<br/><br/> - AppSafari<br/>&gt;\"You'll have to use your creativity…ruthlessly addictive.\" - <br/><br/>Slide2Play<br/>&gt;\"I would recommend buying it, definitely worth it!” - <br/><br/>TouchGen<br/> <br/>Follow us to get early access to exclusive content, price drops and updates:<br/><br/>LIKE: www.facebook.com/doodlegod <br/>FOLLOW: www.twitter.com/joybitsmobile<br/><br/>Check out our other exciting games!  Doodle Devil™  &amp; Doodle Farm™", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-07-29T15:31:38", "background_image": "https://media.rawg.io/media/screenshots/cd2/cd28d903a0fc5b975b7f10d7b19567c3.jpg", "website": "http://www.doodlegod.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JoyBits"], "genres": ["Board Games", "Puzzle"], "publishers": ["JoyBits Co"], "esrb_rating": null}