{"id": 720973, "slug": "defend-from-candyland", "name": "Defend from Candyland!", "name_original": "Defend from Candyland!", "description": "The trees are under attack from the evil candy, you need to Defend from Candyland! Build up a plant based defence to protect the trees from both land and air. Try to overwhelm them by planting the whole field with your defences, or prioritize a few choice plants and level them up, the choice is yours! <br/><br/><h3>Towers</h3><br/>In this Tower Defence game you need to use your different trees to build mazes to slow down and destroy the onslaught of attacking candy. You have different trees at your disposal, each with their own strengths.<h3>Peashooter</h3><br/> The Peashooter is cheap to plant, with low damage and quick firing. The Peashooter can target both ground and air sweets.<h3>Slow Banana</h3><br/> The Banana tree does no damage but it slows down all of the enemies it hits. The Banana can only target ground sweets.<h3>Cherry Tree</h3><br/> The Cherry tree is expensive to plant, with high damage and slow firing. The Cherry Bombs that get thrown explode and damage all the sweets within the area. The Cherry Tree can only target ground sweets.<h3>Carrot Field</h3><br/> The Carrot Field does moderate damage at a moderate speed. The Carrots can only target air sweets.<h3>Candies</h3><br/>There are multiple different enemy candies that will attack you, these have their own strengths and weaknesses too.<h3>Little Jellies</h3><br/><br/>The little Jellies are slow but weak ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level.<h3>Jelly Beans</h3><br/><br/><br/>The Jelly Beans are faster but still weak ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level.<h3>Gummy Bears</h3><br/><br/><br/>The Gummy Bears are slow but powerful ground enemies. When defeated, these gummy bears split into seperate head and legs, watch out! Their path is shaped by the trees you plant as well as the blocks that already exist within the level.<br/><br/><br/><br/>The Gummy Bear heads are slow but powerful ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level. <br/><br/><br/><br/>The Gummy Bear legs are slow but powerful ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level.<h3>Flying Saucers</h3><br/><br/><br/>The flying saucers are moderate paced and powerful air enemies. These will fly over all forms of blocks and take the quickes path to your tree bases, be careful!<h3>Tree Bases</h3><br/><br/><br/>In every level there is at least 1 tree base, this is what you need to protect. The enemy candies will travel towards the tree bases and will deal damage to you once they reach them. Stop them at all costs!<h3>Health</h3><br/><br/><br/>When an enemy sweet hits your tree bases, you health will go down. This tree shows you your health, try to stop it from getting destroyed!<br/><br/>Work your way through the levels to try your skills against numerous preset map layouts and minion waves, or head into endless mode, where the waves are endless, and the board is completely clear for you to make your own, how long can you last? This top down tower defence game will keep you occupied for hours, and with the cutie pixel graphics it is suitable for all ages.", "metacritic": null, "released": "2022-01-09", "tba": false, "updated": "2022-01-14T03:05:15", "background_image": "https://media.rawg.io/media/screenshots/094/094021cabd35c1e1287975e9131ce228.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MI Pixel"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["MI Pixel"], "esrb_rating": null}