{"id": 721061, "slug": "sacrifice-of-the-spirit", "name": "Sacrifice of The Spirit", "name_original": "Sacrifice of The Spirit", "description": "<strong> Sacrifice of The Spirit </strong> is an <strong> Open World Survival Simulator </strong> set in <strong> Arizona, United States. </strong><br/><br/>All this game seeks is to make you reflect on the human being and their actions, for this you will plunge into a comical and hostile universe that transcends the laws of reality and physics, your sanity will be pushed to the limit, and you will need to prove your redemptive capabilities. The player is introduced to a parallel world where survival mechanics will be remarkable, their choices define the story's progression, several enemies tried to destroy him, so the open world construction mode will be essential to ensure the player's defense, Collecting and crafting new resources will be primary pieces to undo the curse.<br/><br/>On this journey in search of redemption, you will receive help from an old elder, you will have to learn to build and manufacture items, collect resources, kill animals and monsters to survive, be very careful at nightfall because the night demons would attack and destroy your camp. matter where you are. You'll have to fulfill the missions of the old man to be able to progress in the story, but this challenge won't be easy, are you able to overcome it?<br/><br/><strong>THE STORY</strong><br/>In Sacrifice of The Spirit a fugitive Brazilian hunter made a terrible mistake by taking the life of a pureblood animal, but Mother Nature didn't let it go, the forest spirits punished him. Now he will brutally fight for survival in a cursed indigenous forest in a totally hostile and brutal universe, his survival and redemption skills will be pushed to the limit, all he has left is a few days until the next full moon. To save his life he must undo this terrible curse of the ancient Apache tribe performing the true sacrifice, because only with the death of the black spirit the curse will be broken, but this task will not be easy, several challenges and show will do everything to prevent .<br/><br/>", "metacritic": null, "released": "2022-01-13", "tba": false, "updated": "2023-02-03T15:59:55", "background_image": "https://media.rawg.io/media/screenshots/453/45303e2eb4e82de5baa0438449cc0b66.jpg", "website": "https://www.mushroomangelsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Luiz Felipe Da Silva Marian"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Mushroom Angels Games"], "esrb_rating": null}