{"id": 721020, "slug": "v696", "name": "V696", "name_original": "V696", "description": "Azerbaijan language supported <br/><br/><strong>Gameplay</strong>: V696 is a first-person horror-thriller game. It guides the person with the help of the signs in the game and gives him clues to understand the story. With these hints, the player has an idea about the locations of the objects to be found in the game. You must follow the signs, read the texts carefully and use your imagination to solve the mystery.<br/><br/><strong>Warning</strong>: We recommend that you do not play this game if you have a previous jinn, metaphysical and spiritual history that you do not want to look back on.<br/>8D sounds and real experiences are used.<br/><br/><strong>Plot</strong>: It tells the story of the Satan family, who returned to their village 25 years after leaving the village and was never heard from again.<br/><br/><strong>Theme</strong>: Features a classic village setting with several houses. Here, the events assumed to have lived by the family are fictionalized.<br/><br/><strong>Hint</strong>: V696 is based on research and merging pieces. There is a plot that will speed up your heart rate according to your progress. For richer content you should examine all the houses, remember that what you see is part of the meaning and that it is your mind that puts the pieces together in the end.<br/><br/><strong>Note</strong>: The developer describes his content as: \"Sudden sounds and the impression that there is something constantly behind you will live with you for a while.\"<br/><br/><strong>Sensitive Content</strong>: This Game may contain content not suitable for all ages. Sudden Sound and Blood, General Adult Content.", "metacritic": null, "released": "2022-01-11", "tba": false, "updated": "2022-01-14T03:35:06", "background_image": "https://media.rawg.io/media/screenshots/87e/87eda3ec11966591668a921ecdcd91fd.jpg", "website": "https://www.instagram.com/v696game/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Veysel Çınar"], "genres": ["Action", "Adventure"], "publishers": ["Serkan Çınar"], "esrb_rating": null}