{"id": 721050, "slug": "galaxity-terminal21-vr", "name": "Galaxity: Terminal21 VR", "name_original": "Galaxity: Terminal21 VR", "description": "<strong>Terminal 21, the most famous shopping mall located in the center of Bangkok, Thailand, is reborn as VR and MOBILE!</strong><br/>Galaxity Terminal 21 is our own shopping and communication space. Choose and purchase the products you need at Galaxity Terminal 21, meet new people, talk to them, and fill in the joy of communicating with them. You can find it in the Steam Store right now.<h3>Meeting Terminal 21 at Galaxity</h3>Galaxity Terminal 21, where you can enjoy both VR and Mobile. We embody the airport-themed Terminal 21, so you can fully feel the charm of Terminal 21. Feel free to choose products at the store and take a walk around Terminal 21. Perhaps large and small sculptures symbolizing each country will catch your eyes. In addition, in Galaxity Terminal 21, you can purchase actual products! If you enter the store, look around the products, choose your favorite products and pay, the package arrives at your house so soon! Now, shop at Terminal 21 as if you were taking a walk comfortably at home.<h3>Your own avatar that you can create with your senses.</h3>Make your own avatar to show off yourself at Terminal 21, the mecca of shopping. There's only one avatar that you made with your senses! It will be only for you. Terminal 21, where unique avatars gather, goes beyond the shopping mall and becomes a large fashion show venue.", "metacritic": null, "released": "2022-01-12", "tba": false, "updated": "2022-01-14T03:55:32", "background_image": "https://media.rawg.io/media/screenshots/338/338262606e3d3db71edf008f6269c7c1.jpg", "website": "https://www.galaxity.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MAMMOSSIX Co"], "genres": ["Casual", "Massively Multiplayer", "Indie"], "publishers": ["MAMMOSSIX Co"], "esrb_rating": null}