{"id": 721072, "slug": "museum-of-mechanics-lockpicking-2", "name": "Museum of Mechanics: Lockpicking", "name_original": "Museum of Mechanics: Lockpicking", "description": "Welcome to the Museum of Mechanics: Lockpicking, an interactive,<br/>meticulously recreated selection of lockpicking minigames from a variety<br/>of genres across the history of games.<h3>FEATURES</h3><br/><ul><li>Challenge yourself against locks from dozens of game worlds<br/></li><li>Compare your skills with other players via Steam leaderboards<br/></li><li>Unlock the complete set of Steam achievements for mastering all the minigames<br/></li><li>Beat \"The Door,\" a fiendish set of ever-changing locks from every exhibit in the Museum<br/></li><li>Read analysis on each minigame from a professional game designer<br/></li><li>Go deeper into the design of each game with our archived source code, and even implement them yourself, should you catch the lockpicking bug!</li></ul><br/>This isn’t a game with a story, or an ending; it’s not possible to ‘win’. It is also not a long experience, but one you will hopefully want to return to.<br/><br/><strong>A Word from Designer Johnnemann Nordhagen</strong><br/><br/>As a game designer, you often find yourself doing research on how other games do things - it's a good way to get ideas, see what works and what doesn't, and build an understanding of the space you're solving problems in. Usually this research involves buying a lot of games and playing until you get to the part you want to see, if you can remember the games that have it! <br/><br/>How nice it would be, I thought, if someone collected all the reference for particular ways of doing things in one place. Thus was born the Museum of Mechanics, and the first entry: Lockpicking. Many genres and types of games include lockpicking minigames, so I thought I would do an exploration of a broad swathe of them and gather them together in a single place. This is the result. I hope you'll join me in exploring the different ways this has been done through the history of games.<br/><br/>", "metacritic": null, "released": "2022-01-13", "tba": false, "updated": "2022-01-14T04:12:22", "background_image": "https://media.rawg.io/media/screenshots/2cf/2cf17d80d6353986d05875828eb55752.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Dim Bulb Games"], "genres": ["Simulation"], "publishers": ["Dim Bulb Games"], "esrb_rating": null}