{"id": 7210, "slug": "final-kick-the-best-penalty-free-kick-game", "name": "Final Kick: The best penalty free kick game", "name_original": "Final Kick: The best penalty free kick game", "description": "Enjoy the tense moments of the penalty shots as if you were playing in a Football final, competing against the best teams, making the most spectacular goals and saves and along with graphics that will make you feel as if you were actually in the match. Perfect your special shots, shoot with special effects, fool your opponent and make the most impressive saves, controlling the ball with one finger, and become the World Champion.<br/><br/>◉ THE MOST REALISTIC GRAPHICS<br/>Simply amazing right from the first minute. With slow-motion replays to watch the best goals from all possible angles, so as not to lose a single detail.<br/><br/>◉ SIMPLE AND INTUITIVE CONTROLS<br/>Without complicated virtual controls: Shoot the ball with your finger and drag the goalkeeper in order to make monumental saves. Playing could not be any simpler, but mastering the game is only within reach of champions of football.<br/><br/>◉ REAL-TIME MULTIPLAYER<br/>You can play against your friends or let the game find you an opponent to see how good you are in short games, in which the winner will be made known in a matter of two minutes.<br/><br/>◉ 20 LOCAL OFFLINE TOURNAMENTS<br/>These are for you to play against 100 of the best teams of the moment without internet connection.<br/><br/>◉ CUSTOMISE YOUR TEAM<br/>Create the team of your dreams by customising every detail of your players, and train them in order to continue improving their skills and make increasingly spectacular goals.<br/><br/>◉ WEEKLY TOURNAMENTS WITH PRIZES<br/>There is a new free tournament every weekend for you to measure your skills against the world, and win prizes if you are among the top 100.<br/><br/>◉ FREE<br/>You can enjoy the game completely free. The inApp options are completely optional. What are you waiting for? Try it. There are spectacular goals for you to make.", "metacritic": null, "released": "2014-05-29", "tba": false, "updated": "2019-10-22T14:29:14", "background_image": "https://media.rawg.io/media/screenshots/797/797245f945884db5427342beaa5ecf7e.jpeg", "website": "http://finalkick.me", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivanovich Games"], "genres": ["Simulation", "Sports"], "publishers": ["Ivanovich Games"], "esrb_rating": "Everyone 10+"}