{"id": 721057, "slug": "bash-the-teacher-classroom-clicker", "name": "Bash the Teacher! - Classroom Clicker", "name_original": "Bash the Teacher! - Classroom Clicker", "description": "It's time to show the teacher who is the real boss of the classroom in this hilarious clicker game!<br/><br/>Click away to blast the teacher with your chosen weapon - will it be a paper airplane, rotten egg, water balloon or catapult! Earn stars and pimp the classroom - upgrade the class desk, upgrade the teacher’s pets, and then pelt them with your weapons!<br/><br/>Watch as the teacher’s frustration grows and discover the teacher’s funny reactions!<br/>Keep bashing the teacher until they can take it no more! Will they quit their job and who will replace them? When a new teacher steps in take aim and fire, the fun begins again!<br/><br/><strong>UPGRADES</strong><br/>Upgrade your weapons for increased bashing fun. Use Paper airplanes, rotten eggs, water balloons, catapults and more to pelt the teacher.<br/><br/>Upgrade the teachers desk items and blast them too! Extra desk items include a cactus, gong, computer and robot!<br/><br/>Upgrade the teachers pets to increase the fun! Pets to discover include a snake, crab, elephant and octopus!<br/><br/><strong>NEW TEACHERS</strong><br/>Unlock and bash three different school teachers. Discover all the teachers funny and crazy reactions - will they be bothered by aliens, snatched by giant tentacles or dance with cute penguins! Each teacher has 12 reactions waiting to be discovered!", "metacritic": null, "released": "2022-01-13", "tba": false, "updated": "2022-01-14T04:00:01", "background_image": "https://media.rawg.io/media/screenshots/5df/5dfe5ba976bc734587e43ea5bfd01251.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 83, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PHB Media"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["PHB Media"], "esrb_rating": null}