{"id": 72115, "slug": "baseball-vs-zombies-returns", "name": "Baseball Vs Zombies Returns", "name_original": "Baseball Vs Zombies Returns", "description": "Yet again the undead will rise! A sequel for the Baseball Vs Zombies!<br/><br/>Baseball team has to fight against zombies and stop them from entering inside the stadium. This is a war against zombies with bats and balls not with guns and grenades.<br/>Each unit of players has unique abilities. Hit, smash, kill zombies and destroy the nursery which breeds zombies instead of plants. <br/><br/>Plant a Ball Factory to use Pitchers and Ball Machines, Coaching Academy to make your dream team bigger, Ticket Counter to earn more coins. Take to the Arena in the most action packed strategy game.<br/><br/>Baseball team comprises of different skills such as Hitter, Pitcher, Cheer Girls, ball machine, coach and physician. Get more help from Grass cutter, chopper &amp; super hero. You can plant Ball Factory, Coaching Academy, Ticket Counter and many more buildings. Take to the Arena in the most action packed strategy game.<br/><br/>It’s not easy to kill what is already dead especially when they have been mutated in their nursery to acquire special traits, so be on your toes and plan your strategy ahead of time to combat the walking forces of darkness. The goal is to hold the ground against hordes of brutal zombies in war via powerful powers &amp; robust weapons to destroy the nursery of the dead!<br/><br/>Fight off hordes of mutated killer zombies, target and assault powerful bosses to save the world again from this invasion!<br/>---------------------------------------------------------------------------------------------------------------------<br/><br/>STRATEGIC GAMEPLAY: Set up your strategic defences against hordes of zombies!<br/>WORK WITH ALLIES: Recruit allies and build defence to siege the forces of dark demons! Get help from Swat Team, Superhero, Bodyguard, MMG and many more!<br/>UPGRADE YOUR TEAM: Make baseball team more powerful by acquiring better equipments, defences and stronger abilities!<br/>SPECIAL ABILITIES: Kill chaos of zombie monsters with special power ups of team to get out of danger.<br/>---------------------------------------------------------------------------------------------------------------------<br/><br/>Game Features:<br/><br/>- Experience 50 levels of glorious victories against blood-thirsty zombie apocalypse!<br/>- Lot’s of unique power sups like super hero, SWAT backup, chopper with MMG and more.<br/>- Featuring extras like Bodyguard, MRL, MMG and much more.<br/>- Epic defence battles that will hook you for hours!<br/>- Battle with undead including Mortar Zombie boss, Butcher, evil wizards and other nasty zombies each with its own skills<br/>- Thrilling ambience sound and effects!<br/>- Specialized element upgrades to customize your strategy!<br/>- Exclusive upgrades of players &amp; extra supporting weapons to conquer the battle! <br/>- Addictive defence gameplay to defend your empire!<br/>- High-end, immersive tablet gameplay!<br/><br/>\"Baseball vs Zombies Returns\" is free to play strategic survival defence game. <br/><br/>\"Baseball vs Zombies Returns\" is a favourite for all ages, from those who grew up with classic action arcade games. The fun never dies!<br/><br/>Zombies are not stupid anymore; get ready for your bloody nightmare!<br/><br/>Download today to stem a zombie attack on your device and protect the mankind, the last survivors on earth.", "metacritic": null, "released": "2015-10-03", "tba": false, "updated": "2019-10-22T14:25:13", "background_image": "https://media.rawg.io/media/screenshots/429/42961e0573a52a0f358227596f3725a6.jpg", "website": "http://www.appon.co.in/web/31-baseball-vs-zombies-returns.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["AppOn Innovate", "AppOn"], "genres": ["Strategy", "Arcade"], "publishers": ["APPON SOFTWARE PRIVATE"], "esrb_rating": null}