{"id": 72124, "slug": "bubble-loops", "name": "Bubble Loops", "name_original": "Bubble Loops", "description": "New bubble shooter game where the bubbles are moving in loops.<br/><br/>Match 3 or more bubbles of the same color to make them burst and get score points. The score you get increases with the number of bubbles bursting at the same time. The game includes different bonus bubbles for an enhanced strategic gameplay.<br/>Each level can be played at 3 difficulty levels, each one represented by a star. A higher difficulty level gives a higher score.<br/>In the main menu you can access the worldwide highscore list. To access it you need to connect with Apple Game Center (only available with iOS 4.1 or later).<br/><br/><br/>Game features:<br/>- 48 different levels<br/>- 3 different difficulty levels, makes the game equally enjoyable for the casual gamer and the pro gamer<br/>- bubble boni for strategic gameplay<br/>- worldwide highscore (Game Center registration required)<br/><br/><br/>Bonus bubbles:<br/>- 3x score, multiplies by 3 the score you get when the matching bubbles burst<br/>- 4x score, multiplies by 4 the score you get when the matching bubbles burst<br/>- score bonus, you get an additional score bonus<br/>- pause, the bubbles don't move anymore during a certain time<br/>- snail, the bubbles move slowlier during a certain time<br/>- backward, the bubbles move in reverse order during a certain time<br/>- bomb, the surrounding bubbles burst", "metacritic": null, "released": "2011-06-29", "tba": false, "updated": "2019-10-22T14:25:13", "background_image": "https://media.rawg.io/media/screenshots/130/130aa4259a2c42192e6326326fc686da.jpg", "website": "http://www.fappsworld.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fapps World et Cie S.E.C.S."], "genres": ["Board Games", "Puzzle"], "publishers": ["FAPPS WORLD et Cie SCS"], "esrb_rating": null}