{"id": 721344, "slug": "yes-youre-a-fly-a-buzzare-platformer", "name": "Yes You're A Fly - A buzzare platformer!", "name_original": "Yes You're A Fly - A buzzare platformer!", "description": "<p><strong>Starting 20 January, dive into a new 3D-platformer, in which yes, you're a FLY!</strong> </p>\n<p>His wings are missing though... During your traversal through a living room, you can still <em>walk on walls</em> however and you'll have to overcome a variety of puzzles and obstacles, using this ability.</p>\n<p>Currently the game is a demo, thus it's fairly short and only highlights the basic mechanics of the game.  Later on, the level could be expanded, with more mechanics and more complex puzzles added. </p>\n<p><strong>But wait, there's more... </strong>You can play a 'foretaste'-version of the game RIGHT NOW! This version a simple environment, where you'll be able to experiment with some of the game's mechanics in forehand.  To help you a bit: You can play the game by unzipping the downloaded folder and then opening the 'Yes You're A Fly - Foretaste Demo.exe'-file.  In-game you can move with WASD and sprint by holding shift/ctrl. See the book on the table? Maybe try sprinting against it...</p>\n<p>This version is also only available for Windows, but the actual game will be available for Mac as well! The full demo will also have audio, collectables, textual instructions, visual improvements &amp; more. I hope you look forward to it!</p>\n\n<p>Shortly after the full demo will be released, there'll also be an exposition of it in my ArtSteps-room between 11AM &amp; 4PM CET, including a behind-the-scenes look. Feel free to join!<br/></p>\n<p>You can also follow my Twitter-account for updates on this game &amp; possible future projects.</p>\n<p>Please enjoy the game! And feel free to leave your feedback in the comments at the bottom of this page.<br/></p>", "metacritic": null, "released": "2022-01-13", "tba": false, "updated": "2022-01-14T05:23:16", "background_image": "https://media.rawg.io/media/screenshots/4b5/4b514b76746231a28d41bcfd279bd74e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pieter"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}