{"id": 721377, "slug": "hammerjeager", "name": "Hammerjeager", "name_original": "Hammerjeager", "description": "<p>Dies ist ein Projekt welche im Rahmen der Projektarbeit der Games Academy innerhalb von 8 Wochen erstellt wurde.</p>\n<p>“Hammerjaeger” ist ein im Arcade Stil gehaltener 2D Action Platformer für den PC. Der Spieler übernimmt die Rolle von Hammerjaeger, einem außergewöhnlichen Kammerjäger, der eine amerikanische Vorstadt der 80er mit seinem riesigen Hammer und wuchtigen Schlägen gegen eine Invasion kleiner Roboter verteidigt.</p>\n<p>Der Spieler steuert Hammerjaeger laufend, kletternd und springend durch die Seitenansicht eines Hauses, wobei dessen Hammer im schnellen Takt der fetzigen Musik schlägt. Er muss sich rasch entscheiden, ob er die Ausgänge vor Robotern verteidigen muss, um die Bevölkerung vor ihrem Angriff zu schützen. Oder wagt er es, vorzudringen und die für die Roboterherstellung unerlässlichen Generatoren anzugreifen. Nur durch die Zerstörung dieser Generatoren kann Hammerjaeger es schaffen, der Roboterinvasion ein Ende zu setzen. Taktisches Planen, um die Funktionalitäten der unterschiedlichen Robotertypen auszunutzen, ist gefragt. Mit Shockwave Robotern können ganze Ebenen von Robotern befreit werden, aber vorsicht, Spawn Two Roboter setzen zwei weitere Roboter frei. Heilroboter sollten nicht zerstört werden, denn sie verstärken die Barrikade, die Roboter am Fliehen hindert. Eine gute Mischung aus Geschwindigkeit und Geschick führt ans Ziel!</p>\n<p>Eckdaten</p>\n<p>Genre: Action Platformer, Arcade</p>\n<p>Tags: 2D, Single-Screen, Action, Humor, Schnell, Platformer, Retro, 80er, Sci-Fi, Gelegenheitsspiel, Einzelspieler, Pixelart</p>\n<p>Setting: Amerikanischer Vorort der 80er Jahre</p>\n<p>Style: Comic, Pixelart</p>\n<p>Plattform: PC</p>\n<p>Zielgruppe: Arcade-Liebhaber, Action-Liebhaber</p>\n<p>Verkaufsargumente Schnell und einfach zu spielen Arcade Action Nostalgie Extrem fetziges Roboter zertrümmern zum Takt der Musik</p>", "metacritic": null, "released": "2022-01-13", "tba": false, "updated": "2022-01-14T05:30:35", "background_image": "https://media.rawg.io/media/screenshots/d06/d066d27df09a8e52099869feb253547a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Games Academy"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}