{"id": 72133, "slug": "ultimate-word-search-2-go", "name": "Ultimate Word Search 2 Go", "name_original": "Ultimate Word Search 2 Go", "description": "\"Ultimate Word Search 2 Go: Letter Boxed\" brings our famous word search game into a new era. Each puzzle is made up from words that wrap around a 6 sided box with the words going left, right, up or down. <br/><br/>Each side of the box has 7x7 letters and there are 24 words to find in total. It comes with 84 English word categories and all puzzles are laid out with random words from a larger category word list and random positions so you can play each puzzle many times without it ever being the same.<br/><br/>Features: <br/>- 84 different puzzle categories that choose 24 random words and lay them out randomly so each puzzle can be played many times.<br/>- All 84 puzzle categories are in English and with English word lists. <br/>- Select a word by touching the letter tile at one end of the word and then touching the title at the other end of the word.<br/>- Each puzzle can take 10-25 minutes to solve.<br/>- New point and star system designed to help keep you focused. <br/>- Great background music and sounds combine with a spooky detective mystery theme to create a truly unique experience.<br/><br/>How to Play: <br/>You can spin the cube around by touching the screen with a single finger and then holding and moving your finger in the direction you want to spin. The farther you move from the original touch point the faster it will spin.<br/><br/>Words can go left, right, up or down so look for them in reverse order as well. Words can wrap around the sides of the cube. Since each side is 7x7 large words could even wrap around and be on 3 sides of the cube. <br/><br/>To select a word touch the first letter of the word. Then touch the last letter of the word. You can and may need to spin the cube in between touching the letters. You can actually touch the last letter first and first last. Only touch the letters at the end points and not in the middle of the word. If you select a word correctly all letters will change colors permanently and the last word found will have special effects. If the second letter you touch does not complete a word it becomes the new \"first\" letter as it is assumed you are trying to find a different word. Enjoy!<br/><br/><br/>Thanks for playing Ultimate Word Search 2 Go: Letter Boxed!", "metacritic": null, "released": "2013-01-21", "tba": false, "updated": "2019-10-22T14:25:13", "background_image": "https://media.rawg.io/media/screenshots/111/11198facad980725c0fbf94e123a295f.jpg", "website": "http://www.ensenasoft.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EnsenaSoft"], "genres": ["Puzzle"], "publishers": ["SAM L DENHARTOG"], "esrb_rating": "Teen"}