{"id": 72159, "slug": "chess-tiger-pro", "name": "Chess Tiger Pro", "name_original": "Chess Tiger Pro", "description": "▻ Do you want to learn or improve at chess?<br/>▻ Do you want to master the most prestigious, the classiest game ever, while having fun?<br/>It's EASY, and you can start right now!<br/><br/>How does it work? It's really simple: you just play! The coach shows you the moves a Grandmaster would pick. Not just one move, but the 4 best moves.<br/><br/>Sounds silly? Well think about it... How did you learn to talk when you were a child? Did you take grammar and spelling lessons? Of course not. You just went with the flow! Because that's the most effective way to learn!<br/><br/>Chess Tiger Pro allows you to do just that, AND IT WORKS!<br/><br/>In two minutes you start learning effortlessly. You start having fun immediately, and notice after just a few games that the right moves come to your mind naturally, as if they were obvious.<br/><br/>If it still sounds incredible, please read the reviews. Chess Tiger Pro has one of the highest customer satisfaction of the App Store!<br/><br/>Also, Chess Tiger Pro is the only chess app that analyzes your games to show you how to improve, and is also one of the MOST COMPLETE apps for players of all levels.<br/><br/><br/>FOR BEGINNERS:<br/><br/>• The rules of chess are included and easily accessible.<br/>• Just tap on a piece to see its legal moves.<br/>• A move is not allowed? The app tells you why.<br/>• Suggestions: can watch over your shoulder and suggest 4 moves.<br/>• Can tell you when you can mate your opponent, so you can look for the winning move by yourself.<br/>• Can warn you when your opponent is about to play a very dangerous move.<br/>• Provides 50 trainer levels of increasing difficulty. No big jump between levels.<br/>• Knows and applies perfectly all the official rules of chess.<br/>• Contains a very high quality chess engine, the guarantee to learn from a good professor.<br/>• Finds interesting positions in your own games and shows you how to improve.<br/><br/><br/>FOR EXPERTS:<br/><br/>• Both USCF and FIDE rating scales are supported.<br/>• Chess Tiger Pro has one of the strongest chess engines for mobile devices.<br/>• On current devices, as incredible as it sounds, it plays at the world champion level.<br/>• Chess Tiger has been ranked twice as the strongest chess engine on the SSDF list (the worldwide recognized and independent computer rating list).<br/>• You can set up any position.<br/>• You can save your games in collections and replay them later.<br/>• You can exchange games with your friends very easily by email (send and receive).<br/>• You can import game collections in PGN format.<br/>• The chess engine displays its thinking, up to 20 plies ahead.<br/>• You can analyze a game by replaying it. Chess Tiger Pro tells you when a bad move has been played by coloring it in red. The 4 best moves in every position are colored in green.<br/>• Chess Tiger Pro supports variations and allows you to test \"What if...\" scenarios without erasing your current game.<br/><br/><br/>OTHER FEATURES INCLUDE:<br/><br/>• The coach can comment your game while you are playing (optional).<br/>• When a game is finished, the coach can analyze it for you and show you how to improve.<br/>• 15 gorgeous predefined visual themes that you can customize.<br/>• 9 chess pieces sets (wood, ebony &amp; ivory, metal, glass, …).<br/>• 14 board styles (marble, blue marble, wood, metal, stone, …).<br/>• A collection of more than 6000 famous games of the greatest players of all times.<br/>• \"Reload last game\" allows you to retrieve the most recent game, even if you have forgotten to save it.<br/>• 4 different playing styles, ranging from the quiet to suicidal, which you can apply to all the levels.<br/>• Includes an opening book of more than one million moves (can be turned off).<br/>• Many customization options (graphics, sounds, engine output…).<br/><br/><br/>THIS APP IS \"CLEAN\": it does not display any ad.", "metacritic": null, "released": "2011-03-08", "tba": false, "updated": "2019-07-30T09:26:18", "background_image": "https://media.rawg.io/media/screenshots/a17/a171b24eaef141031a58018a6cae5499.jpg", "website": "http://www.chesstiger.com/iphone/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Christophe Théron"], "genres": ["Strategy", "Board Games"], "publishers": ["Christophe THERON"], "esrb_rating": null}