{"id": 72168, "slug": "bubble-cloud-spinning-bubbles", "name": "Bubble Cloud: Spinning Bubbles", "name_original": "Bubble Cloud: Spinning Bubbles", "description": "Shoot bubbles and climb your way up from the ground to the outer space in this fun twist of a “match three” bubble spinning shooter game! The bubbles attach to a rotating platform that makes every shot different! Have you felt the rewarding feeling after mastering a wall-bouncing shot?<br/><br/>Highlights:<br/><br/>- Shoot bubbles and blast your way up through the clouds!<br/>- Bubbles are spinning: Precise aiming and bouncing off the walls are a must!<br/>- Explore 300+ challenging levels and more to come <br/>- Powerful boosters like the laser weapon and super spin<br/>- Free download and free level updates<br/><br/>Your goal in each level is to clear the bubbles and break the glass in the middle to collect the stars. The more bubbles you clear, the more stars you get. Stars are needed to unlock new worlds and special boosters. Can you collect all the stars and unlock the special infinity level?<br/><br/>You will get 300+ challenging levels to enjoy, and more to come with the game updates. The powerful boosters - laser and super spin - help you on your way towards the stars.<br/><br/>Shooting bubbles has never been this fun! Join millions of other players and pop some more!<br/><br/>---<br/><br/>Support: https://valasmedia.com/support<br/>Terms of Service: https://valasmedia.com/terms<br/>Privacy Notice: https://valasmedia.com/privacy<br/><br/>Please note: This game is free to play and download but some optional in-game items will require payment. You can turn off the payment feature by disabling in-app purchases in your device’s settings. Also, under our Terms of Service and Privacy Notice, you must be at least 13 years of age to play or download this game.", "metacritic": null, "released": "2014-03-21", "tba": false, "updated": "2019-10-22T14:39:00", "background_image": "https://media.rawg.io/media/screenshots/afe/afe368630a6d30acd53f3df4fbfa0094.jpg", "website": "https://valasmedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Valas Media"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Valas Media Oy"], "esrb_rating": null}