{"id": 721635, "slug": "knights-of-legend-development-project", "name": "Knights Of Legend Development Project", "name_original": "Knights Of Legend Development Project", "description": "<p>WIP Devlog 3.11 - Major Updates Gameplay mechanics</p>\n<p>Hello I'm back this is my latest progress video for my wip game proj and learning.</p>\n<p>Youtube : </p>\n\n<p>Paypal: https://paypal.me/legendofaren?country.x=PH&amp;locale.x=en_US</p>\n<p>Twitter : https://twitter.com/PaulSenYuki</p>\n\n<p>History</p>\n<p>Magic History (Needs to be re-written to change magical lore)</p>\n<p>Magic exists as a cornerstone of creation, it is a fundamental aspect of human life in all recorded history. There hasn’t been a time on this planet where humans existed without magic. It pulsates from the earth, feeding every living and even some non-living beings with pure energy. It brings to life that which would be impossible through creating and shaping what should be beyond normal human abilities. All humans were born with an innate ability to harness magical power, while other creatures could simple absorb it, humans could control it.</p>\n<p>As with most things, when there is a lot of it, there is little interest to it. Some humans trained to harness their magic, while most ignored it. Those who did seek to learn more about magic, its uses and capabilities, came together and formed academies. These were places of learning and practice, where some would spend their days investigating the origins of magic, while others trained hard to enhance their powers. Those would could create sparks from their fingertips soon learnt to control storms, those who could warm a room soon learned to burn forests.</p>\n<p>These academies thrived for decades, those who attended them began to venture out into the world to seek glory and fame. Those who trained to increase their magical power called themselves ‘the Enhanced’, while those who spend their time studying the origins of magic took the moniker of ‘the Seekers’. Pretty soon, these titles formed new professions within the world, with the Seekers being sought after by every Nation, City, Town and Villager as counsellors. Their knowledge was revered amongst the people of the world. The Enhanced on the other hand lent themselves out as brawlers. They didn’t care who they served or what they fought for, they just wanted to show off their power and prove they were the best.</p>\n<p>The existence of the Enhanced and the Seekers lead to an end of most major conflicts. The Seekers were able to counsel those in power into making wiser decisions, while the Enhanced became a ‘mutually assured destruction’ type of threat. No ruler wanted to risk their kingdom and wealth if their enhanced was weaker than their enemies. This lead to smaller conflicts, less armies and more skirmishes between Enhanced. The more victories they had, the more they were worth. An economy of buying, selling and trading Enhanced became a norm in larger nations.</p>\n<p>During this period, two things became very apparent. First, the Seekers learned that the ruling class were rather uneducated and quick to anger which resulted in more harm than good to the world. Second, the Enhanced realized that they trained to become the pinnacle of human possibilities only to be treated like cattle. This knowledge lead to entire kingdoms being overtaken by those with vast magical power. Rules were deposed, entire royal bloodlines were wiped out as new ones laid claim to the throne. Those with power were now in power.</p>\n<p>While this did result in peace, it was relatively short lived. The Seekers and Enhanced who were in power now did not have the same fear of each other as their predecessors did, which resulted in far more violent confrontations between neighbouring kingdoms. As Enhanced and Seekers began to slay each other, they found that they became more powerful. It soon became apparent to only a small, elite few what was going on. A truth about magic that no one noticed before, a truth that would cause a war and change the world. Magic was finite. The more one person had, the less magic that others could access. Defeating an opponent in battle caused their magic to disperse back into nature, only to be absorbed by the winning party. While this aspect of Magic confirmed by only a few, </p>\n<p>rumours of it began to spread until kingdoms turned to war with one another, believing that no one ruling magic user would allow another to survive.</p>\n<p>This is what triggered the First Magical War, where supremacy was resolved only through conquering all magic for ones self. This war lasted over a hundred years, during which alliances were made and broken, kingdoms began to rise as others fell. Borders were redrawn and comradery between magic users ceased to exist beyond blood lines as they were the only ones you could trust. As long as there was a surviving member of your bloodline, if you fell in battle, your magic reserves would transfer to them.</p>\n<p>This discovery to magic users focusing on expanding their bloodline, however there was a general fear that if rival families joined together, it would be possible for the second family to steal the magic from the first. No one could be trusted beyond your own kin. It soon became the norm for non-magical individuals of the highest calibre to be selected to join these families, purely for breeding purposes. Their magical offspring were considered true members of the family, while their non-magical parent was often little more than a slave. Soon enough though, some families began to believe the only way to truly stay powerful was to keep their bloodline pure. The only ones worthy enough to further the bloodlines were those already in it. While this would normally lead to a deterioration in normal humans, they were able to use magic to ward off the worst effects, though some were born with an unstable psyche, </p>\n<p>this was considered an acceptable cost to keep their magic safe. </p>\n\n<p>Knighs of Legend is Story based game</p>\n<p>Also in Knights of Legend game it has heavily grinding crafting for equipments to become stronger </p>\n<p>make your own build using gems you can grind specific locations </p>\n\n\n<p>New Features Logs:</p>\n<p>Updated locomotion approach </p>\n<p>Characters redesign</p>\n<p>Cull distance </p>\n<p>Amd fidelity </p>\n<p>Ai party will automatically teleported near player </p>\n<p>camera system </p>\n<p>ikfoot enhancements</p>\n<p>interactive foliage enhancements</p>\n<p>optimized performance</p>\n<p>water system </p>\n<p>background noise,music dynamic</p>\n<p>battlesystem frameworkv4</p>\n<p>blocking system</p>\n<p>light and heavy dynamic</p>\n<p>slowmotion dynamic </p>\n<p>Directional death animation dynamic</p>\n<p>Melee/Sword Class </p>\n<p>-dashing</p>\n<p>-attack nearest enemy and direction based animation</p>\n<p>-smooth camera transition</p>\n<p>-Ai float assistant</p>\n<p>-Aerial + combo enhancements</p>\n<p>Longrange Mage/Archer Class</p>\n<p>-3 modes</p>\n<p>-locking system </p>\n<p>-aim offset</p>\n<p>-auto attack nearest enemy</p>\n<p>To follow</p>\n<p>My game modules to follow are the following below </p>\n<p>Cutscenes</p>\n<p>-full lore story (Complete) </p>\n<p>-AI enhancements</p>\n<p>-Characters ,enemies overdrive cutscene system </p>\n<p>-Blocking and parry enhancements</p>\n<p>-VFX enhancements </p>\n<p>-Skills </p>\n<p>-Elements </p>\n<p>-PVP system and COOP boss fights</p>\n\n\n\n<p>#gamedev  #indiedev  #IndieGameDev  #unrealengine4  #UE5 #jrpg #indiegame #solodev</p>\n<p>#indie #indiegamedev #indiedev #indiegame #zelda #blender #photoshop #gamedev #anime</p>\n<p>#jrpg</p>", "metacritic": null, "released": "2022-01-12", "tba": false, "updated": "2022-01-14T06:34:05", "background_image": "https://media.rawg.io/media/screenshots/819/8195ec0be4e7e2af91589e1ceedb721c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kiyusen"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}