{"id": 7216, "slug": "brave-little-adventure", "name": "Brave & Little Adventure", "name_original": "Brave & Little Adventure", "description": "No in-app purchases and hidden fees. Pay once and play without restrictions and advertising.<br/><br/>•\tWinner #1 in the category APP OF THE YEAR 2015: Players Choice at SLIDE DB (slidedb.com)<br/><br/>•\t4.5/5 - 4pda.ru - &amp;quot;Neat and addictive puzzle game, recommended for anyone with children.&amp;quot; (Comment: translation)<br/>•\t8/10 - Games.Mail.ru - &amp;quot;The heroine travels through a colorful world, which, despite its visual appeal, is full of dangers, robbers and mysteries.&amp;quot; (Comment: translation)<br/>•\tAppleInsider.ru - &amp;quot;Colorful graphics, familiar characters and interesting tasks guarantee an exciting time and lots of fun.&amp;quot; (Comment: translation)<br/><br/>Supported devices: iPhone 5 and newer, iPad 4, iPad mini 2, iPad Air, iPad Pro and newer, only iPod Touch 6th generation.<br/>Supported languages: English, German, Russian, Japanese, Korean, Simplified Chinese.<br/><br/>At dawn, the windows opened! The pigeon flew into the room with a letter from Grandma, calling to start a journey, an incredible adventure!<br/><br/>CHARMING ADVENTURE!<br/>Welcome to Brave &amp;amp; Little Adventure – a charming, colorful medieval adventure of Little Red Riding Hood!<br/><br/><br/>Walk through Sunny Fields, explore the ancient ruins in Fairy Gardens, solve non-trivial puzzles, don’t get lost in Darkwood and reach Stonevill town through saturated 5 eventful episodes, and daredevil Hans will help you in this!<br/><br/><br/>CONQUER PEAK OF WINDS!<br/>Plunge into a fabulous, fascinating, intriguing story with a cheerful little girl named Molly!<br/>Conquer the great Peak of Winds and get sacred Edelweiss for you Grandma!<br/><br/><br/>VISILE ENEMIES, TRICKY PUZZLES AND PILES OF SURPRISES!<br/>Find gifts for yourself and for Grandma, scattered at every step!<br/>But be careful, Big Bad Wolf is watching you!<br/><br/>Help people and animals, give a good lesson to the villains, but don’t get caught! Will you manage to get away from bears, bandits and even werewolves?<br/><br/><br/>TINY, BUT SO BRAVE!<br/>Brave &amp;amp; Little Adventure is a medieval adventure based on the fairytale about Little Red Riding Hood in the Point-n-Click genre with Stealth and Hidden Objects elements.<br/><br/><br/>YOU WILL GET:<br/>- Wonderful sense of humor and a great adventure;<br/>- Mysterious riddles and attentive enemies;<br/>- Over 30 unique characters;<br/>- 23 fully interactive, hand-painted and unique locations;<br/>- Over 50 hidden artifacts, objects, goodies and gifts;<br/>- More than 1,500 different types of animation that make the story incredibly alive;<br/>- Fairytale about Little Red Riding Hood, which you have never heard before.<br/><br/>With courage at heart, Molly is ready for a fabulous, fun and mysterious adventure, and you?<br/><br/><br/>System Requirements:<br/>iPad 4, iPad mini 2, iPad mini 3, iPad mini 4, iPad Air, iPad Air 2, iPad Pro or later.<br/>iPhone 5, iPhone 5c, iPhone 5s, iPhone SE, iPhone 6, iPhone 6 Plus, iPhone 6s, iPhone 6s Plus or later.<br/>iPod Touch 6th generation.<br/><br/>Operating system:<br/>iOS 8, iOS 9, iOS 10 or later.", "metacritic": null, "released": "2015-11-26", "tba": false, "updated": "2019-10-22T14:29:14", "background_image": "https://media.rawg.io/media/screenshots/f1e/f1e69439f5b1958c1175c7fbc51779e9_ZSfmZMw.jpeg", "website": "http://braveandlittle.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Dmitriy Kashirin", "LightDrop Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Dmitriy Kashirin", "LightDrop Games"], "esrb_rating": "Everyone 10+"}