{"id": 72167, "slug": "chess-tiger-lite", "name": "Chess Tiger Lite", "name_original": "Chess Tiger Lite", "description": "▻ Do you want to learn or improve at Chess?<br/>▻ Do you want to master the most prestigious, the classiest game ever, while having fun?<br/>It's EASY, and you can start right now!<br/><br/>How does it work? It's really simple: you just play! The coach shows you the moves a Grandmaster would pick. Not just one move, but the 4 best moves.<br/><br/>Sounds silly? Well think about it... How did you learn to talk when you were a child? Did you take grammar and spelling lessons? Of course not. You just went with the flow! Because that's the most effective way to learn!<br/><br/>Chess Tiger Lite allows you to do just that, AND IT WORKS!<br/><br/>In two minutes from now you are going to start learning effortlessly. You start having fun immediately, and notice after just a few games that the right moves come to your mind naturally, as if they were obvious.<br/><br/>If it still sounds incredible, please read the reviews. Chess Tiger Lite has one of the highest customer satisfaction of the App Store.<br/><br/><br/>Chess Tiger Lite is a simplified version of Chess Tiger Pro, our full-featured chess app.<br/><br/><br/>IN A NUTSHELL:<br/><br/>• Easy to use<br/>• 21 levels of difficulty from beginner (100 Elo) up to club player (1300 Elo)<br/>• Play with or without a teacher<br/>• The coach can find interesting positions in your own games and show you how to improve<br/>• 100 historical games included<br/>• Includes a book with the rules of chess<br/>• Stunning HD graphics, realistic and varied sounds<br/><br/><br/>HERE ARE THE FEATURES IN DETAILS:<br/><br/>• Play against the computer or against a friend on the same device<br/>• The rules of chess are included and easily accessible for reference: you can learn chess with this app!<br/>• Touch a piece to highlight its legal moves (you can disable this)<br/>• If a move is not allowed, the app tells you why<br/>• Naturally the app knows and applies all the rules of chess (castling, en passant...)<br/>• You can easily take back your move in case of mistake<br/>• You can even take back several moves if you want<br/>• Features 21 progressive levels ranging from absolute beginner to club player<br/>• The app can act as a teacher and show you the good moves: you will learn much faster<br/>• You can be warned of the threats of your opponent so you can learn to spot them yourself<br/>• You can play without the coach and get a hint on demand, when you really need one<br/>• When a game is finished, the coach analyzes it for you and shows you how to improve<br/>• Stunning, customizable graphics: 9 piece sets and 14 board styles!<br/>• Realistic and varied sound effects (you can disable them selectively)<br/>• Built-in chess clock<br/>• Move list available for the full game, allows you to jump directly to any move<br/>• Your game is always saved when you quit the app, and you can continue it later<br/>• Your previous game is also saved and you can alternate between current and previous<br/>• A collection of more than 100 historical games by the greatest players of all times is included<br/>• Uses very little energy from your battery: much less than any typical game<br/><br/><br/>THIS APP IS \"CLEAN\": it does not display any ad.", "metacritic": null, "released": "2011-06-25", "tba": false, "updated": "2019-07-30T09:31:10", "background_image": "https://media.rawg.io/media/screenshots/97b/97b458806003fa0e75fe12c7e3008d40.jpg", "website": "http://www.chesstiger.com/iphone/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Christophe Théron"], "genres": ["Strategy", "Board Games"], "publishers": ["Christophe THERON"], "esrb_rating": null}