{"id": 721939, "slug": "honeybutter", "name": "Honeybutter", "name_original": "Honeybutter", "description": "<p>Life's tough for a magic pot of honey. What's he supposed to do when he's run out of sugar?</p>\n<p>Help him find what he needs!</p>\n<p>My second ever game, created for the Juice Jam, with the theme \"don't stop.\" If you stop timing your jumps properly, you'll soon find yourself stuck and unable to move. So bounce, bounce, bounce with all your might and you'll get to zip around.</p>\n<p>Standard platformer controls, R on keyboard or Select on gamepad to quick restart. Backspace or Esc will pause and give you access to the options screen, which includes a couple options to make the game easier/more accessible if you'd like. Turning on automatic jumping in this way eliminates the main element of challenge in the game, so please consider not turning it on until you've given the game a shot on its own :)</p>\n<p>Had some weird issues with UI so sadly the main menu I created had to be dropped :(</p>\n\n<p><strong>Asset Credits</strong></p>\n<p>the main character art is an ephemerald original made during the jam<br/></p>\n<p>Ansimuzwas my source for most of the rest of the art - primarily used Sunnyland and Sunnyland Forest, recolored to match palettes.</p>\n<p>Font was hope gold from somepx</p>\n<p>The (imo amazing) music is from Sidearm Studios, used some side effects from them as well as Imphezia, did some amount of editing on most of those.<br/></p>", "metacritic": null, "released": "2022-01-11", "tba": false, "updated": "2022-01-14T07:50:07", "background_image": "https://media.rawg.io/media/screenshots/748/74872b84824cf7a3610b7a8cc7f584f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ephemerald"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}