{"id": 721927, "slug": "masterbuilder", "name": "MasterBuilder", "name_original": "MasterBuilder", "description": "<p>MasterBuilder is an open-world sandbox build 'n' smash experience for all ages.\r\n </p>\n<p>To become MasterBuilder you need to acquire all the master artifacts  that you find in the world. Build anything your imagination can produce  and reach new heights. It allows creative thinking, exploration,  adventure, and good exercise since it utilizes most of VRs physical  capabilities. Artifacts allow you to gather resources, craft blocks, and  helpful objects. Have fun smashing, flying, teleporting, and easy  building with a master wand and other artifacts.\r\n </p>\n<p>Unlike many similar VR games available for a standalone device  MasterBuilder offers an organic world with a free-form building system  and its physicalities. It is built to be played on standalone Oculus  Quest devices ( no link needed ), standing or seated.\r\n </p>\n<p>The game is available as early access on Quest devices, and we plan  to keep adding more features in the coming time. The pre-release game is  fully playable with one single open-world island, basic resources, and  five main master tools with fully customizable characters. Create your world, enjoy a relaxing environment, and have some creative  time.\r\n </p>\n<p>MasterBuilder is still in its early stage of development and the VR  pre-release is the first part of the MasterBuilderVerse. Soon the first  2D NFT representations of the MasterBuilders will be available, as we  want to create a sustainable community that can benefit from playing the  game. Help us on the way, be a part of the community and let's build a  greater world.\r\n </p>\n<p>Description - The game now has 3 main goals:\r\n </p>\n<p>1)  Building: Freeform and physical building system allows you to use  resources and special tools to build whatever your imagination wants  to. 2)  Smashing: This allows players to fully enjoy the physics of smashing  in one of a kind experience for standalone VR devices.  3) Adventuring: Customize your avatar, explore the island, find all the  artifacts, climb, fly, teleport, and more to ultimately become the  MasterBuilder.  </p>\n<p>In addition, you will also find: •    Crafting - Try combining resources and see what you get •    Magic - Some of your tools have magic-like abilities •    Relaxing and calm environment\r\n \r\n</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-01-14T07:46:31", "background_image": "https://media.rawg.io/media/screenshots/f8e/f8ef9e000f44e8acc04786e44decb959.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MediaUp"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}