{"id": 722096, "slug": "the-night-is-long", "name": "The Night Is Long", "name_original": "The Night Is Long", "description": "<p>2 Years ago I release Night Is Long a short horror game. After so many people liked and played it. I decided to remake it with better graphics and gameplay. I worked really hard to make something better and with all the feedback I received hopefully this is going to be a better and more complete experience. This is by far the biggest and most complete games I have ever made so far and I am happy that I manage to finally share it with the world.</p>\n<p><strong>STORY</strong></p>\n<p>It has been few months since you lost your wife and your world crumble under your feet. You had enough of everything and decided to take your car and drive to an unknown destination. </p>\n<p>You were driving for few hours, It was dark and stormy. Suddenly out of nowhere you see a woman standing in the middle of the road. You immediately stop the car and look at her shocked. Few minutes passed and you realize that the woman who was standing in the middle of the road and in front of the car is actually her. Your lost wife who you lost not long ago. Without questioning anything you try to approach her but she moves away leading you into this abandoned mansion. Without hesitation you go after her. \r\n  </p>\n<p>That is where the game begins. Alone in this abandoned mansion it's up to you to explore ,uncover the mysteries and find where did that woman who looks like your wife went.</p>\n<p><strong>Mechanic Information</strong></p>\n<p><strong>Sanity Meter</strong>\n</p>\n<p>You Sanity Metter in the Inventory Symbolizes your Mental health. \"100%\" means you're in psychologically good health. The lower it gets the worst you get and you have higher chances something bad will happen to you. It doesn’t actually kill you if it reaches \"0\" however<strong>How to Play</strong> </p>\n<p>W A S D - To walk around </p>\n<p>Right Mouse Click - Interact with the Environment\r\n  </p>\n<ul><li>Interact with Doors, Cupboards , Pick up items by using Right Mouse Click </li></ul>\n<p>I / TAB - To Open the Inventory\r\n  </p>\n<ul><li>Open your Inventory to read what item you collected and look at your Sanity meter </li></ul>\n<p>M - To Open The Map\r\n  </p>\n<ul><li>Your are lost? Open the map and find which area you are currently are.   </li></ul>\n<p>N – Open the Note / Drawing Collection Screen\r\n  </p>\n<ul><li>You found some notes or drawings? Read them again by access the Note/Drawing Screen\r\n  </li></ul>\n<p>\n</p>\n<p>If you enjoyed the game feel free to buy me a coffee. Every little support is appreciated.<br/></p>\n\n<p><strong>Discord Official Group</strong></p>", "metacritic": null, "released": "2022-01-11", "tba": false, "updated": "2022-01-14T08:31:21", "background_image": "https://media.rawg.io/media/screenshots/df1/df14f98dbc291b736371c1b2a70a17d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheGamerUrso"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}