{"id": 72208, "slug": "suzies-sushi-house", "name": "Suzie’s Sushi House", "name_original": "Suzie’s Sushi House", "description": "Try the most played sushi game in the app store for FREE!<br/><br/><br/>APP REVIEWS:<br/>---------------------------------<br/>“This games is awesome with so many features, hight quality sound tracks, great graphics, different levels which will get complex as game progress and what more do you need in a game.The users will enjoy playing this apps. My rating: 4 stars” –app on my i<br/><br/>“Suzie's Sushi House is an addictive and fun game for iPhone and iPod touch” –1888Freeonlinegames.com<br/><br/>“If you always fancied yourself a sushi chef then here is the chance for culinary glory with Suzie’s Sushi House.” -AppCraver<br/><br/><br/>Suzie's biggest dream is to own a sushi house. 10 years later she starts her first small sushi house, but how far can her dream take her? <br/><br/>STORY &amp; INTRO:<br/>---------------------------------<br/>Once upon a sunny day, Suzie is walking down the street and stumbles upon a sushi house. From that day on, Suzie's biggest dream is to own a successful sushi house. 10 years later she starts her first small sushi house, but how far can her dream take her? That's something only you can determine...<br/><br/>LITE VERSION:<br/>---------------------------------<br/>- Try the first 10 levels of Suzie's Sushi House!<br/><br/>FULL GAME FEATURES:<br/>---------------------------------<br/>- 19 amazing real-life sushi recipes<br/>- 31 levels of fun<br/>- 12 ingredients to make your sushi<br/>- 9 challenging achievements<br/>- 9 high quality sound tracks<br/>- Star reputation system to boost your score<br/>- Leaderboard to compare your score with your friends<br/>- Easy and Hard modes<br/>- Intuitive controls and an interactive tutorial<br/><br/>oh and...<br/>- hidden recipe *Hot Lover's Roll*<br/><br/>CONTACT INFO:<br/>---------------------------------<br/>- Any questions or suggestions? <br/>Email us at support@kooapps.com<br/><br/>Become a fan of Suzie's Sushi House on Facebook!<br/>Our Website: http://www.suziesushihouse.com<br/><br/>Please write us a review : ) We value your thoughts highly and appreciate all feedback. Thanks!<br/><br/>A note from our producer:<br/>---------------------------------<br/>Inspired by the flash game 'Sushi-Go-Round' and other iPhone simulation games such as Sally's Salon and Diner Dash, we've been working on this game for almost a year and hope you will enjoy this game just as much as we have.", "metacritic": null, "released": "2010-06-02", "tba": false, "updated": "2019-10-22T14:25:14", "background_image": "https://media.rawg.io/media/screenshots/767/767b049b7aa44ddd8ba1bd78462566b0.jpg", "website": "http://kooapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games for Friends"], "genres": ["Simulation", "Arcade"], "publishers": ["Games for Friends"], "esrb_rating": null}