{"id": 72206, "slug": "cartoon-roach-fun-ninja-game", "name": "Cartoon Roach - Fun Ninja Game", "name_original": "Cartoon Roach - Fun Ninja Game", "description": "*** Featured by Apple on the New &amp; Noteworthy<br/><br/>Gross, roaches! Compete alongside your friends as you battle the most powerful roaches from the cartoon world, all with a tap of your finger.<br/><br/>Battle against 10 of the most powerful cartoon roaches like Konoha Ninja Roach, Spartan Roach, Living Dead Roach and more! Make sure that you don’t smash one of the good roaches like the Medic or the game is over! Compare your scores on leaderboards, Facebook and Twitter.<br/><br/>How many roaches can you squash? Start playing Cartoon Roach to find out!<br/><br/>Cartoon Roach Features:<br/><br/>SQUASH ROACHES<br/>- Watch as tons of cartoon roaches scurry across the screen.<br/>- Try to hit each one before it’s able to run away!<br/>- Smash tons of roaches and improve your high score.<br/>- Make sure you don’t accidentally squash one of the good roaches or the game will be over!<br/><br/>BATTLE CARTOON ROACHES<br/>- Battle against the most powerful roaches in the cartoon world!<br/>- Take on Konoha Ninja Roach, Spartan Roach, Living Dead Roach and more!<br/>- These roaches have trained in ninja villages hidden behind the Japanese mountains, fended off the Persians’ attack with shields and marched from the graveyards of Raccoon City.<br/>- Battle against other powerful roaches and see how many you can smash!<br/><br/>SHARE YOUR SCORES<br/>- Complete alongside friends or see who can smash the most roaches!<br/>- Share your high scores on the leaderboards, Facebook and Twitter so everyone can know you’re the ultimate roach smasher!<br/><br/>See how many of the most powerful cartoon roaches you can tap, smash and hit in Cartoon Roach! Don’t let any of them run, but make sure you don’t accidentally squash a good roach.<br/><br/>Download now to start squashing all the roaches!<br/><br/>REVIEWS: <br/>Cartoon Roach is a downright exciting game. It features tons and tons of content that will get you hooked, and has amazing artwork! It comes highly recommended to people that want something different than the regular old fly squashing games - Appmodo<br/><br/>Become a fan of Cartoon Roach on Facebook!<br/>Our Website- http://cartoonroach.kooapps.com/<br/><br/>A note from our producer:<br/>---------------------------------<br/>Inspired by our favorite cartoon and movie characters, we've put together a game that will bring back childhood memories.", "metacritic": null, "released": "2010-06-02", "tba": false, "updated": "2019-10-22T14:05:03", "background_image": "https://media.rawg.io/media/screenshots/270/270846d7cd5c8c21cfa1062383ab1d96.jpg", "website": "http://kooapps.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games for Friends"], "genres": ["Action"], "publishers": ["Games for Friends"], "esrb_rating": null}