{"id": 722177, "slug": "gun-kata", "name": "Gun Kata", "name_original": "Gun Kata", "description": "<p>Gun Kata is a singleplayer third person looter shooter slasher taking place in a hyper corporatized, cyber-enhanced world. Take control of RONIN, a last of it's kind combat bot prototype, as you aid the Teer-Racket Corporation with stopping the new global threat, Mechrotic Outbreaks. Craft weapons, explore desolate refugee centers, defend the corporate base, upgrade cybernetic abilities and more!</p>\n<p>Gun Kata is still actively in development. This release is the Alpha release, meant as a playtest. More systems, items, and polish are actively on the way and updates will be here as major milestones are reached.</p>\n<p>Featured in this release is:</p>\n<ul><li>Explore Refugee Site Xu</li><li>Talk to set NPCs by tapping on their nametag</li><li>Change gear with the Teer-Racket Entity Analysis Pad</li><li>Requisition new gear from the Requisition Officer<ul><li>Earn materials to requisition gear from Expedition and Defense modes!</li><li>There are currently 22 total unlockable weapons, 5 are given to the player to test immediately.</li></ul></li><li>Upgrade the Time Slow skill tree, with 3 more abilities on the way</li><li>Talk to Sanders to go on missions<ul><li>Expeditions are randomly generated dungeons featuring enemies, loot, and an end goal to turn on the Site's Firewall<ul><li>Expeditions currently only has one difficulty</li><li>**This mode is very new and is still going through major bug fixes**</li></ul></li><li>Defenses are timed missions to defend Site Xu's outer perimeter <ul><li>Defenses have different tiers that determine time and enemy spawns.</li><li>There are 2 different enemies currently, each with 3 elemental variants that determine their immunities.</li></ul></li></ul></li></ul>", "metacritic": null, "released": "2022-01-11", "tba": false, "updated": "2022-01-14T08:54:12", "background_image": "https://media.rawg.io/media/screenshots/06b/06b14526ac3e4a7ae52f81647ba758a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["flippstudios"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}