{"id": 722215, "slug": "the-patient-jam-game", "name": "The Patient (Jam Game)", "name_original": "The Patient (Jam Game)", "description": "<p>Horror, escape from a house game</p>\n<p>The game has 1 password-locked door, 5 key locked door, and 1 puzzle-locked door. The objective is to escape by getting on the car which is in the garage without getting caught by the enemy.</p>\n<p>*Note*</p>\n<p>The enemy can't enter the room's whiches door's closed. If you enter a room it is coming back to his base which is in the kitchen.</p>\n<p>The door which is opened by black key has a bug so the enemy can enter from there.</p>\n<p>**Solution**</p>\n<p>First, you should take the red key from the first room. Then you open the red door which is next to the stairs and find the green key. You open the green door which is next to your birth room. You found a hammer and you break the wall which is made of brick. You found the first puzzle of the picture. Then you find the famous \"The Kiss\" table. The password-locked door's password is 1908 which writes on that table. You find the car key and the second puzzle of the picture. Then you go downstairs and you should find the third and last puzzle of the picture in the laundry room. Then on the blue sofa, there is the blue key which opens the door in the kitchen. (It's hard to find because it's the last difficulty to finish the game) Then you find the black key. which opens the last locked door. And then you enter the car and you escape.</p>\n<p>***Spoiler***</p>\n<p>As you can see in the credits our character has schizophrenia. Our protagonist made up an escape from his house.<br/></p>\n<p>***Spoiler***</p>", "metacritic": null, "released": "2022-01-10", "tba": false, "updated": "2022-01-14T09:05:23", "background_image": "https://media.rawg.io/media/screenshots/5be/5be31a282315ed956977b564c6a4e138.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yiğit Sarıyar"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}