{"id": 722213, "slug": "wyrm-marc", "name": "Wyrm (Marc)", "name_original": "Wyrm (Marc)", "description": "WYRM\r\n<p>Snake reimagined as ... a Dragon. </p>\n<p>Maneuver the Wyrm through the sky, collecting magic coins to open portals which will take you to the next level. With each coin you're one step closer to the end, but you also get longer and faster. Avoid walls and avoid hitting yourself or else you'll have to start over. There are 10 levels. Good luck.</p>\n<p>Move with the cursor keys<br/>Hold any key to accelerate<br/>Press P to pause the game<br/>Press M to turn the music on or off<br/>Press S to turns the sound fx on or off</p>\n<p>This is my first published game. I wanted to finish something not overly ambitious, but something I could be proud of, with some spit and polish and not just a prototype. I learnt a ton making this game. Pixel art is hard. Bigger pixel art is harder. Music and sound effects too. Everything you add to a game ripples all the way through everything else. And yet there's an amazing, supportive, and friendly community out there, building games, sharing tools and techniques and art. I want to thank all those that helped me, that encouraged me, that gave me feedback on early versions of the game. So now I have finally shipped something. </p>\n<ul><li>Built with DragonRuby GTK</li><li>Black Chancery font version of 11/19/91 by Earl Allen/Doug Miles</li><li>7:12 Serif font by \"CMunk\"</li><li>Chord progression generated with ChordChord</li><li>Melodies generated using OneMotion Chord Player</li><li>Sound FX generated with ChipTone by Tom Vian</li><li>Art created with Aseprite</li></ul>", "metacritic": null, "released": "2022-01-10", "tba": false, "updated": "2022-01-14T09:04:44", "background_image": "https://media.rawg.io/media/screenshots/c00/c00588cca83b70af76781af970a29b6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Marc"], "genres": ["Action"], "publishers": [], "esrb_rating": null}