{"id": 72227, "slug": "bingo-showdown-bingo-live", "name": "Bingo Showdown - Bingo Live", "name_original": "Bingo Showdown - Bingo Live", "description": "Saddle up and ride to the BINGO SHOWDOWN – one of the best live bingo games in the wild wild west – yeeeeehaw! Indulge yourself in an exciting bingo online experience that combines an epic old west environment with state-of-the-art features of social bingo.<br/><br/>Bingo Showdown is the place for you, cowboys and cowgirls, to play classic Bingo games or multiplayer Bingo tournaments and win big. The most exciting free bingo game is just a click away! Not all bingo games deliver but Showdown is the bingo app that’s sure to give you a full-blown bingo rush! You can be that lucky bingo player! just install and then you’ll be speaking our bingo lingo.<br/><br/>Multiplayer Gameplay<br/>Enjoy a multiplayer bingo gameplay and spice up your social gaming experience while you compete with other bingo players from all over the world in free bingo games.Bingo Showdown has the most fun games to play with friends or strangers. <br/>Hop on wild Bingo live tournaments for a social game adventure or challenge yourself with speed bingo games and prove that you are the fastest drawer in town.<br/><br/>Play Bingo on Facebook or on your smartphone – play bingo online anytime, anywhere! Get an intense bingo rush from the exciting voice of the bingo caller calling your lucky numbers on your way to a BIG WIN.<br/><br/>The Book of Outlaws - WANTED! <br/>There’s a new sheriff in town! Shoot your way through the Showdown bingo cards and catch outlaws on the run while you play one of the best bingo games online. For every Bingo game won, collect a puzzle piece to find an outlaw on the run! Capture outlaws to win rewards, free gifts, Bingo bonus offers, and more! Experience the unique environment of a western bingo world while you’re chasing the outlaws. Enjoy high speed bingo thrills while chasing the bad guys on your way to the ultimate glory.<br/>Be the Best in the West<br/>Play social Bingo game with your Facebook gang or other Bingo players from around the world. Use your bingo daubers as guns to shoot your lucky numbers. Show them how it’s done in live bingo action and ride to the top of the leaderboard to win that precious bingo jackpot. Invite a new friend to enjoy the delightful experience of the Showdown and get a full sack of bonuses! Take some time off our showdown bingo rooms  for a Wild West bingo holiday with your cowboy pals or just random horseback riders online and have the time of your life!<br/><br/>The most exciting free bingo game is just a click away!<br/><br/>Amazing Showdown features:<br/>-\tPlay with or without WIFI<br/>-\tDaily bonus spins – SPIN AND WIN!<br/>-\tDaily powerups and bingo tickets<br/>-\tSpeed bingo – for the swift fellows<br/>-\tExciting minigames - for a true hot shot<br/><br/><br/>The Bingo hall of fame has a blank spot for you, don’t miss it.<br/><br/><br/>- LIKE US @ Facebook.com/BingoShowdown<br/><br/>- Log in with Facebook and sync your account with your PC and all your devices.<br/><br/>- Enjoy the game directly on your PC through Facebook at <br/>https://apps.Facebook.com/Bingo-showdown.<br/><br/><br/>•\tThe games are intended for an adult audience.<br/>•\tThe games do not offer \"real money gambling\" or an opportunity to win real money or prizes.<br/>•\tPractice or success at social casino gaming does not imply future success at \"real money gambling.”", "metacritic": null, "released": "2015-01-28", "tba": false, "updated": "2019-10-22T14:25:15", "background_image": "https://media.rawg.io/media/screenshots/852/8525d5c2427465af49ab0a7b9e9a6691.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Spicerack Media"], "genres": ["Board Games"], "publishers": ["Spicerack Media"], "esrb_rating": "Teen"}