{"id": 72259, "slug": "amys-froyo-lite-make-froyo", "name": "Amy's Froyo Lite - Make Froyo!", "name_original": "Amy's Froyo Lite - Make Froyo!", "description": "Top 20 USA with TONS of downloads worldwide!<br/><br/>Enjoy making fun, frozen yogurt treats for yourself, family and friends with Amy’s Froyo Lite, the dessert maker for everyone!<br/><br/>It’s your froyo, so choose whatever you want! Decorate your own froyo to your heart's content by choosing from tons of frozen flavors like strawberry, blueberry, cheesecake and more. Make your froyo creation even more delicious with flavorful toppings like mochi, chocolate chips, fruit and more.<br/><br/>Share your dessert recipes with your family and friends on social media or keep them for yourself! Get started on making your own frozen yogurt treats now with Amy’s Froyo Lite!<br/><br/>Amy’s Froyo Lite Features:<br/>3 cup designs, 3 flavors, 3 toppings, 3 spoons<br/>- Eat your virtual froyo<br/>- Save your froyo into your photo album<br/>- Share your froyo via E-mail, Twitter, and Facebook<br/>- Share your froyo recipe<br/><br/>Full Version Features:<br/>- 30 Unique Cup Designs<br/>- 15 Delicious Flavors<br/>- 41 Fun Toppings<br/>- Eat your virtual froyo<br/>- Save your froyo into your photo album<br/>- Share your froyo via E-mail, Twitter, and Facebook<br/>- Share your froyo recpie<br/><br/>Choose From 30 Cup Designs<br/>- Eat your virtual froyo in style! Start making your froyo treat by choosing your cup.<br/>- Pick fun designs like Soho, Princeton, Wowa, York, Martinique, Montego Quilt, Bermuda, Broadway, Bahama, Victoria, Mulholland, Chinchilla, Aruba, Madison, Lollipop, Roswell, Saturn, Cleveland, Poppy, St. Monica, Jodhpur, Caribbean, Macquarie, Dauphine, Manhattan, Orleans, Seattle, Comino or Malibu!<br/><br/>15 Delicious Flavors<br/>- Choose one frozen yogurt flavor or combine more!<br/>- Select flavors like Original, Vanilla, Pomegranate, Green Tea, Soy, Tangomonium, Coconut, Chocolate, Passion Fruit, Coffee, Melon, Cherry, Banana, Mango or Blueberry.<br/><br/>41 Fun Toppings<br/>- Decorate your frozen yogurt with other desserts like Mochi, Ricecake, Leche Flan, Cheesecake, Brownies, Oreo cookies or Mint cookies.<br/>- Top off your froyo with yummy fruits like Strawberry, Kiwi, Mango, Raisins, Raspberry, Blueberry, Watermelon, Melon, Pineapple, Banana, Pears, Cherries or Coconut.<br/>- Have a sweet tooth? Then top your treat with Caramel candy, Chocolate syrup, Strawberry syrup, White Choco chips, Chocolate chips, Strawberry chips, M&amp;M's, Marshmallows, Rainbow Sprinkles, Gummy bears, and Jelly beans.<br/>- Add some crunch with Almonds, Peanuts, Walnuts or Pistachio.<br/>- Pick out yummy cereal toppings like Granola, Rice Krispies, or Fruit loops.<br/>- Decorate your froyo with other toppings like Cinnamon, Graham Crackers and even Cheese!<br/><br/>Never worry about sharing your frozen yogurt again! Enjoy hours of fun with the Amy’s Froyo Lite, the virtual froyo maker that lets you create and share your frozen treat with friends and family!<br/><br/>Download now to start decorating!<br/><br/>App Store Quotes:<br/>---------------------------------<br/>\"I absolutely love this app it was a really good call to get it\"<br/><br/>\"Love it, it’s like u doing it for real!\"<br/><br/>\"My kids really love this game! it’s so creative and fun.\"<br/><br/>CONTACT INFO:<br/>---------------------------------<br/>- Any questions or suggestions? <br/>Email us at support@kooapps.com<br/><br/>Become a fan of Amy's Froyo on Facebook!<br/>Our Website: http://amysfroyo.kooapps.com/<br/>Trendy on Twitter check it out - http://twitter.com/search?q=amy froyo<br/><br/>Please write us a review : ) We value your thoughts highly and appreciate all feedback. Thanks!", "metacritic": null, "released": "2010-09-19", "tba": false, "updated": "2019-10-22T14:25:15", "background_image": "https://media.rawg.io/media/screenshots/0ee/0eee661f78d376db75017f3a046e9cfb.jpg", "website": "http://www.babyberrystudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games for Friends"], "genres": ["Family"], "publishers": ["Games for Friends"], "esrb_rating": null}