{"id": 722622, "slug": "newhrdgame", "name": "NewHrdGame", "name_original": "NewHrdGame", "description": "<strong> During the Three Kingdoms period of the later Han Dynasty, \"ZHUGE Liang calculated Huarong wisely and Guan Yunchang released Cao Cao\". This is the origin of the game [/]<br/><br/>Huarongdao is an ancient Chinese folk puzzle game. With its changeable and never tired of playing, it is called \"three incredible in the field of intelligence games\" by foreign intelligence experts together with magic cube and independent diamond chess. It is synonymous with traditional Chinese educational toys such as Tangram and Puzzle ring, and is called \"China's problem\".<br/><br/><strong> Basic gameplay [/]<br/><br/>By moving each slider, help Cao Cao move the lowest middle of the layout panel from the initial position and escape from the exit. It is not allowed to cross the slider, and try to move Cao Cao to the exit with the least number of steps. The biggest obstacle for Cao Cao to escape from Huarong Road is Guan Yu. Guan Yu immediately went to Huarong Road with a horizontal knife. One man is in charge of the pass, and ten thousand men can't open it. Guan Yu and Cao Cao are, of course, the key to unlocking this game. The five tiger generals are the most difficult to deal with. The four soldiers are the most flexible and easy to deal with. How to play their role should also be fully considered.<br/><br/><strong> Diverse play [/]<br/><br/>First, OneVsOne<br/>There are three kinds of difficulty in one-on-one layout: general, difficult and hell; The difficulty determines the difficulty of solving the layout. The difficulty can be set when opening a room, and also the game limit time; In wartime, both sides worked out the layout of the same set, and the party who released \"Cao Cao\" first won within the specified game time; Each battle will consume energy points. After winning, you can obtain experience points, which can be used to improve the player's level; In the battle, you can consume flying props to guide and crack the layout.<br/><br/>Second, TeamFight<br/>This play is divided into two teams, each team has at least two people and at most four people; There are three kinds of game difficulty: general, difficult and hell; The difficulty determines the difficulty of solving the layout. Create room can set difficulty, game limit time , teammate number; At the beginning of  TeamFight, each team member is assigned a layout according to the difficulty of the game. Within the specified time, the team with all the team members solving the layout will win; In TeamFight, you can ask for help from your teammates who have finished; At the beginning of the TeamFight, the team members will consume energy. After the team wins, the team members can obtain experience value, which can be used to improve the player level; In TeamFight, you can consume flying props to guide and crack the layout, and you can use flying props to assist teammates to crack the layout.<br/><br/>Third, KeepGoing<br/>In the team breakthrough mode, you need to consume one MangToken prop to open it once; The minimum number of team members is one, maximum is three; First, you need to create a team. When you create a team, specify the number of team members and the minimum level of teammates; When the team is full, you can go out and enter the breakthrough room. There are five levels in total. At the beginning of each level, click the turntable to randomly draw the layout set, and then the team members start to crack the layout. When different layout sets have different level limits, you can solve all the drawing layout maps within the specified time to pass this level; After successfully breaking through the customs, you can choose to continue to break through the customs, or you can stop here and get rich victory prizes; If you fail in any level, you will not get a prize; Flying props cannot be used in the breakthrough mode.<br/><br/><strong> Game features [/]<br/><br/>Novel multiplayer game.<br/>Exquisite layout of Huarong Road.<br/>The pleasure of player level improvement.<br/>Upload your avatar freely.<br/>Exquisite and diverse head frame.<br/><br/><strong> Rich game peripherals [/]<br/><br/>Task system: daily task, weekly task, monthly task, counting task and permanent task; After completing the task item, you can get the corresponding task reward.<br/>Mail system: inbox, outbox; Send and receive e-mail, contact the network management and send e-mail to the network management.<br/>Leaderboard system: player level ranking, player wealth ranking, ovo ranking, TVT ranking, Eve ranking.<br/>Store: the sale of various props.<br/>Record: query the player's personal game record.<br/>Chat system: it can chat in the room, in the hall and in the carrier pigeon service.<br/>Avatar system: replace the exquisite avatar frame, and upload your avatar freely in the album.<br/>Upgrade system: if the upgrade conditions meet the standard, you can madly improve the player level.</strong></strong></strong></strong></strong>", "metacritic": null, "released": "2022-01-15", "tba": false, "updated": "2022-01-17T02:38:01", "background_image": "https://media.rawg.io/media/screenshots/8fe/8fe0804350a29592b55891feb21ae751.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["powerman"], "genres": ["Strategy", "Casual", "Massively Multiplayer"], "publishers": ["powerman"], "esrb_rating": null}