{"id": 722673, "slug": "anchor-club", "name": "Anchor Club", "name_original": "Anchor Club", "description": "Anchor is a form of creative writing of textual interaction of origin, where the author uses the function of dice to prepare options in which a random number determines the development of the story (the dice have a will of their own). And indeed, most authors will also have their own set of Anchor rules.<br/><br/>Anchor Club, relying on Steam's network and creative workshops, aims to provide a platform for anchor enthusiasts to create and share their own works, as well as to participate in the creation process of others' works.<br/><br/>Because of our hobby, we created the app \"Anchor Club\", and because of our hobby, we want to let more people know about Anchor, create and share here, so Anchor Club is free forever.<br/>In Anchor Club, authors can create rooms and create online. We expect that one day there will be a moment when 250 people will come together to witness the birth of an Anchor piece.<br/><br/>Because this application is permanently free, if you want to support our studio, you can buy the DLC, so that we can have more motivation to improve this platform, thanks.<br/><br/>Any questions or suggestions: StarSeekerGameStudio@gmail.com<br/><br/>Anchor Club is not trying to outlaw the forum, but more of a creative way to supplement it, where authors can create, then export the text and share it elsewhere.<br/><br/>Anchor Club compared to the forum.<h3>Made for Anchor, a more comfortable visual experience</h3><h3>Support for creative workshops</h3>Authors can upload their edited property cards, character cards, and scripts to Steam Creative Workshop<h3>Real-time creation</h3>Viewers can exchange jokes in the built-in chat system.<h3>Audience participation</h3>Authors can initiate <strong>audience randomization</strong> (where the audience randomly selects options locally and passes them to the author, with the highest number of options being the final result) and <strong>audience voting</strong> (where the audience selects the results from existing options and passes them to the author, with the highest number of options being the final result)<h3>Built-in notes feature</h3>Public notes (visible to everyone in the room) and private notes (visible only to the author), as well as each character having their own notes.<h3>Relying on a global platform like Steam, it is easy to see Anchor works in different languages. </h3>", "metacritic": null, "released": "2022-01-14", "tba": false, "updated": "2022-01-17T03:12:35", "background_image": "https://media.rawg.io/media/screenshots/307/307af3af61ccc0e3dc7828ae8df92d8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Star Seeker Studio"], "genres": ["RPG", "Indie"], "publishers": ["Star Seeker Studio"], "esrb_rating": null}