{"id": 722648, "slug": "project-myriad-2", "name": "Project Myriad 2", "name_original": "Project Myriad 2", "description": "Project Myriad 2 is a tower defense strategy game. Build towers on a grid of hexagons floating in space. 35 levels with unique tiles and mechanics each providing a unique challenge. 3 difficulty levels including extreme mode which has never ending waves of enemies. Strive for your new high score!<br/><br/><strong>Build a Maze</strong><br/><br/>Each level allows you to weave an intricate maze for the enemies to move through. Use the mechanics of unique tiles on each level to your advantage by forcing enemies to pass over them.<br/><br/><strong>14 Different Towers</strong><br/><br/>Choose from 7 initially buildable towers with unique abilities to tackle the various challenges of each level. Each tower has a one time power up that will transform it into a new tower for a total of 14 different tower options. Since placing towers can change the path enemies take their are millions of combinations for each level.<br/><br/><strong>Unlimited Waves or One Life Mode</strong><br/><br/>Looking for a challenge? Crank the difficulty up to extreme and experience unlimited wave mode, or turn on one life mode so that if you leak a single enemy it's game over!<br/><br/><strong>35 Levels and Achievements for Each</strong><br/><br/>35 levels each with a unique layout and use of the various tile mechanics. Steam achievements available for every level and difficulty and more!", "metacritic": null, "released": "2022-01-14", "tba": false, "updated": "2022-01-17T02:54:44", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3dbc8e56f1ac3029bb630680121eda0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RoninGameDev"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Jumpmen Gaming"], "esrb_rating": null}