{"id": 722763, "slug": "geopoiesis", "name": "Geopoiesis", "name_original": "Geopoiesis", "description": "<p>So, the theme was \"Upgrade\" and I thought, maybe we could have a ball of mud, and to try and help that ball of mud support life, so upgrading it as it passes through deep time.</p>\n<p>So, about 99% of what I want to do with this are missing, but I think I am going to updated it over time. \r\n  </p>\n<p>I can't really call the result a \"game\" but I gave it a go, might give it some more time at some point.\r\n  </p>\n<p>Came up with the name after a quick thesaurus google for Terraforming.\r\n  </p>\n<p>Images if not generated in code I have made myself or pulled off google searches (the G-Type star was from google) \r\n  </p>\n<p>All shaders are written by me, and the code for the sphere is also mine, but I started writing that in Unity years ago and re wrote it here for MonoGame, I think it could become a useful bit of code for rendering whole planets, maybe….\r\n  </p>\n<p>Audio was from the ever awesome site https://soundimage.org/   </p>\n<p>All the services I use in here have been ripped out of my own engine code and repurposed for this project.\r\n  </p>\n<p>If you are interested in the code, then you can get ALL the source code to Geopoiesis here (https://github.com/NemoKradXNA/GameJams )\r\n  </p>\n<p>If you are interested in my MonoGame engine, then please feel free to pop along to my Patreon and have a look. I also infrequently post about my other MonoGame and Unity hobby work there too.\r\n  </p>\n<p>Anyway, here is my attempt for MonoGameJam4….<br/></p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T03:40:02", "background_image": "https://media.rawg.io/media/screenshots/29b/29b4929ecf45290a1e03ef9b3ed5ed30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NemoKrad"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}