{"id": 722785, "slug": "palokarki-birb-game", "name": "Palokärki - Birb Game", "name_original": "Palokärki - Birb Game", "description": "<p>You play as a Black Woodpecker, who is out looking for bugs to collect and take back home. Find a suitable tree to land on and peck at the tree bark to reveal what is hiding underneath! Tip: Be careful about the angry trees that want to be left alone!</p>\r\nBackground\r\n<p>The idea came to us when we were out on a walk in the forest and saw a Black Woodpecker chipping away tree bark from a big spruce, just as in the game. Turns out woodpeckers remove the bark to make it easier to reach bark-beetle larvae under the surface of the tree. The beetles lay their eggs in spring-summer, and the eggs hatch in winter, when they provide a good source of nutrition for the bird. It was a nice coincidence because we were trying to come up with ideas for a Trijam-game jam!<br/></p>\n<p>This was our first time in a game jam, and Holodoxical's first time with game development, Fikaa's first collaboration. It took us 4-8 hours to create (Illustrations &lt;4, game development ~6-8). We really tried to make it under 3 though x'D. Our cat Amadeus kept us company the whole time.</p>\r\nControls and Goals\r\n<p>Game controls: <strong>AWSD</strong> to move. <strong>Esc</strong> to leave scenes. <strong>Space</strong> to interact (enter a tree, peck and pick bugs).<br/>Goals: Collecting 10 bugs while avoiding pine cones thrown at you. Blue bugs are for collecting, pink bugs heal one health (max. health 5).<br/>Some barks are peckable and some not, you can tell them apart by their colour.</p>\r\nCredits\r\n<p>The game is made by \"Fikaa\" and \"Holodoxical\". Sprites and assets by Havina Ru. <br/>Made on Unity.<br/>The gothic-pixel font used in the cover/banner and also in the game are Alagard.</p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T03:45:10", "background_image": "https://media.rawg.io/media/screenshots/0bf/0bf922277966bd98e521b16c57f387e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ridaeus"], "genres": [], "publishers": [], "esrb_rating": null}