{"id": 722764, "slug": "gali-the-snails-invaders", "name": "Gali & the Snails Invaders", "name_original": "Gali & the Snails Invaders", "description": "<p>Gali &amp; the snails invaders is our first videogame created with unity. a platformer where you fight hordes of snails with legs and UFOs steal hearts.</p>\n<p>Synopsis: </p>\n<p>One night, Gali was dreaming that she was walking through a dark forest, when a voice that claimed to be from God told her: \"The time of the apocalypse has come, I am going to destroy humanity and cleanse the world of evil, I will send my Angels and those will turn humans into beings that reflect their inner evil. But since you are a being with a pure heart, my punishment will not fall on you\".</p>\n<p>Gali did not understand anything that the voice told her, and when she woke up she noticed how some UFOs transformed people into snails with legs.</p>\n<p>Gali found it funny how snails can hide in their shells and kick each other like a ball.</p>\n<p>So Gali started a journey to find the cause of this incident... and kick some snails along the way.</p>\n<p>controls:</p>\n<p>arrows: move</p>\n<p>z: jump.</p>\n<p>x: catch/throw shell.</p>\n<p>up arrow: throw shell up.</p>\n<p>down arrow: get off ropes, throw shell down.</p>\n\n<p>creator's note: this is version 0.9, the game is practically complete, but there are still some details that I want to add, besides that they may have some bugs and failures to correct.</p>\n<p>The game was created by a team consisting of only one member, who is currently somewhat busy with classes at the university. As I get free, I will update the game.</p>\n<p>Besides, excuse my bad English. u_u<br/></p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T03:40:18", "background_image": "https://media.rawg.io/media/screenshots/da8/da883b6c5923d56f5ecbebb395fd581e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TeamKerubin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}