{"id": 722809, "slug": "potatos-dragons-td", "name": "Potatos & Dragons TD", "name_original": "Potatos & Dragons TD", "description": "<p>Defend your base from the oncoming threat!</p>\n<p>Defend yourself from the coming hordes. Upgrade your turrets with new effects and powers. But be aware some enemies can have 1 o 3 effects.\r\n</p>\n<p>- More hp, but have a slowing effect on enemies.\r\n</p>\n<p>-More speed, but will explode once they die.\r\n</p>\n<p>-Some will return from the dead.\r\n</p>\n<p>This game was quite an experience to do. It was our first gamejam as a team and the first time we developed a tower defense. Our first objective was to create a tower defense where you can upgrade your turrets and give perks with disadvantages to your enemies.\r\n</p>\n<p>What we didn't expect was to have to do so much work behind the scenes with the interface. Since we wanted to provide a preview of the turret in the constructible areas, we did a grid system. \r\n</p>\n<p>This was quite a challenge because we needed to define the constructible areas and non-constructible areas, area by area. An easier approach would have been to do interactable objects on the map.\r\n</p>\n<p>We also underestimated the workload of having 3 different turrets, 2 power-ups, 2 ways to upgrade your stats, 3 types of enemies, and 3 perks. Having so much work we left out the twist of the game which were the events to upgrade the enemies. Sometimes less is more.\r\n</p>\n<p>One thing that we did good was not adding procedural work to the mix, since it would have been a ton of work.\r\n</p>\n<p>We are also very happy with how the UI ended up. We maybe overdid a bit with the animations when you lose. Especially for how easy the game is. Some more balancing would have been helpful!</p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T03:51:12", "background_image": "https://media.rawg.io/media/screenshots/8a8/8a865b506fd974a93a7229430d21ae92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tamoth", "telmiuse", "Yonimevicio", "Juan Carlos Sánchez", "Lawlet"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}