{"id": 722800, "slug": "what-happened-to-this-world", "name": "What Happened To This World?", "name_original": "What Happened To This World?", "description": "<p><em>\"Ever wondered what a game would be like if it was literally just a design document? No? Well neither had I, until now! I have created a game, like the old choose your own adventure books I used to read when I was a kid. However, there is one main difference. This “book” has RPG elements, yayyy maths!</em></p>\n<p><em>Jokes aside, the game will send you between pages depending on your choice, you will have opportunities to collect items, fight monsters, trade with NPCs and complete quests and much more! Now the question everyone is wondering, what’s stopping me from cheating? Well, absolutely nothing. But if you want to enjoy the game just don’t!\"</em></p>\n<p>That's the first 2 opening paragraphs of the book I wrote in 3 days or something like that. Well it's not actually a book, it's a game, not a videogame, not a board game, not a traditional role playing game, a single player role playing game you could say. Tbh I'm not sure what genre this fits into, nor am I sure it's even fun, but it's definitely a creation!</p>\n\n<p><em>Stats page - Used throughout playing the game.</em></p>\n<p><strong>I hope you enjoy, please let me know what you think by either leaving a rating on the jam page or in the comments down below! I love this concept so if other's find it fun I might think about putting a bit more effort into another one in the future!</strong></p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T03:49:13", "background_image": "https://media.rawg.io/media/screenshots/4d2/4d241787b218088b0c2fbac7f2ca4b94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["GoldenDonkeyProductions"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}