{"id": 723099, "slug": "rabbit-panic", "name": "Rabbit Panic!", "name_original": "Rabbit Panic!", "description": "<p>\"Oh No! Your rabbits got out of their pin. What are you going to do???. Well, why not catch them.\"</p>\n<p><strong>Introduction</strong></p>\n<p>Rabbit Panic! is a simple collectithon game were you either run after the passive rabbits or run away from the more aggressive rabbits. Your goal is still the same collect both types to win. However, if you are attack by the aggressive rabbits they can affect your health... Tread with caution with those rabbits because if your health goes to 0 it is game over.</p>\n<p><strong>Controls: </strong></p>\n<ol><li>Arrow Keys: The arrow keys are used to move your character across the screen.</li><li>Z Key: The Z key if held will allow you to run</li><li>Escape Key: This key will  open the game windows (Note: this doesn't pause the game so get to safety first before opening it).</li></ol>\n\n<p>Win Conditions: Collect all rabbits in their pin. Basically take the Rabbits to the dirt area were you start at</p>\n<p>Loose Condition: If you loose all your health its Game Over but you can start a new game.</p>\n<p>Note: This game was created for my very first ever game jam.  It is the \"Trijam #152: The 3 hour Jam.\" The theme is \"Leave me Alone.\" Your goal was to create a game with in a 3 hour time limit. Hmm, however, I kind of over shot that goal by 45:05 minutes. I guess I over shot it by quite a margin. Then again I entered it because I was curious to see how Game Jams worked and I had a lot of fun making this weird little game.  Now you might be wondering how long it took to think of a game idea. Well I was like \"Rabbit\" and I was thinking of both Monty Python and the Holy Grail and that one infamous scene from anime were the protagonist dies and responds at a point in time. This scene was pretty graphic because he gets eaten alive by a bunch of carnivorous rabbits. Its was pretty graphic but that lite novel was even more descriptive about what happened. I guess my memory isn't what it used to be. I guess I'm getting old.</p>\n<p>I'll also be post a postmortem  of this game on YouTube. Basically it will be a commentary about footage I created during this project. So look forward to that. Also after the game is judge I'll be polishing it up a bit and adding in features that I wanted to add but didn't have any time to do it. Well Ya'll take care and see you next time. </p>\n<p>Note: The final time was 3:45:05 just to let you know.</p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T04:56:24", "background_image": "https://media.rawg.io/media/screenshots/99b/99b4770b1a61e31c1410217fb371bce8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["derf6060"], "genres": [], "publishers": [], "esrb_rating": null}