{"id": 723033, "slug": "among-the-space", "name": "Among The Space", "name_original": "Among The Space", "description": "<p>Note: My name is Utkarsh Raj and I made this game for the National Coding Olympiad 2021 Hackathon competition hosted by Codingal...</p>\n<p>-<br/></p>\n<p>Among The Space</p>\n<p>You're an astronaut, right? The ATS (Among The Space) space agency has dispatched you to distant space with a spaceship to find a moon. The moon can be found anywhere (including behind the earth) and revolves around it. The earth revolves around its axis. You must reach the moon in order to win. If you get too close to the Earth, you'll be taken back to the menu. To move forward and back, press W and S, respectively. Rotate your plane left and right on its axis with the keys A and D. Move the spaceship up and down by hovering your mouse top and bottom. To move the spaceship left and right, hover your mouse left and right. To keep the spaceship still, hover the mouse on the tip of the spaceship. Press Shift + W for making your spaceship move faster. You must exercise caution since asteroids are in your path. By left-clicking on your mouse, you can fire bullets. The asteroids will be harmed by the bullets. To damage the asteroids, you must hit them 4-5 times. There is also a cooldown system in the bullets. Collect the fuel after you've destroyed the asteroids. Make sure you don't run out of fuel totally! Also, avoid colliding with asteroids or asteroids that have been fragmented.</p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T04:40:55", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a3de0d9fd1f9506e4b08ba09152d3da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Playgamerying"], "genres": ["Shooter", "Adventure", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}