{"id": 723182, "slug": "dragon-war-20", "name": "Dragon War 2.0", "name_original": "Dragon War 2.0", "description": "<p>Become the greatest warrior ever in this simple, Pokémon-like RPG that involves dragons and fighting and weird-looking enemies! Contains fast-paced, turn-based combat in-game!</p>\n<strong>Role</strong>\r\nDeveloper<strong>Engine and tools used</strong>\r\nUnity, Unity Collaborate, GitHub, Visual Studio, Trello<strong>Tasks</strong>*Built the system for all game elements.<br/>*Developed the entire turn-based combat system including the user interface (UI), heads-up display (HUD), menus, character animation and scripting. Designed the entire combat scene.<br/>*Streamlined character movement by employing state machines.<br/>*Coordinated events between scripts and made sure everything went smoothly.<br/>*Developed the entire inventory system while utilizing scriptable objects.<br/>*Implemented the saving of game data between scenes and in between program runs via a data management save and load system using serialization.<br/>*Performed occasional testing.<br/>*Was included in the polishing of the game concept post-competition and collaborated with my teammates (a developer and an artist) for the improvement of the UI.<br/>*Explored the Unity addressable asset system for a more dynamic asset management system, most especially those used for character animation.<br/>*Used Unity Collaborate initially and eventually Git for version control. <br/><strong>Platforms</strong>\r\nPC (Windows)\r\n<strong>Team size</strong>\r\n6 (2 developers including myself, 1 writer, 1 artist, 1 sound composer, 1 game designer)<br/><strong>Project length</strong>\r\nFebruary 14, 2021 - February 21, 2021 (game jam proper), April 2021 - July 2021 (solo development) *development currently on hiatus<strong>Notes on used assets,  libraries and functions\r\n</strong>All art assets were produced by our artist.<br/>All sound assets were produced by our sound composer.\r\n<p>Link to the original game: Dragon War (with peer reviews!)</p>\n<p><em><strong>My thoughts</strong></em></p>\n<p>Dragon War is, among the finished and (~many~) unfinished games I have been involved in, the one which presented me with the most opportunities for growth, primarily because of the setup (worked with a team) and the nature of the game (RPG, involved combat). I have been leisurely writing code during my free time up to this point and making games mostly for study purposes when I was hit with the idea of working with a team. The timing was right.. there was another Brackey's game jam coming up and the COVID-19 pandemic was in full swing meaning I had nowhere to go, had limited interactions with people and had free time I was more than willing to spend. I got in touch with my dev partner through the jam's dedicated Discord server and, until the very end, we fought the 14-hour time difference (they were based in South America) to create the first version of Dragon War. If I'm going to be honest, I thought the project was a bit ambitious right off the bat.. especially for a short game jam. However, I knew the team had plans for it even beyond the scope of the jam and I liked the ambition they possessed. Fast forward to after the jam. The game was not perfect for sure, the reviews not that high, but it served as fuel, for me especially, to use the existing material and story I had to better it and learn about concepts along the way that I have not even heard of before.<br/></p>\n<p>With the future of Dragon War currently uncertain, I leave this here to serve as a remembrance to the  humongous mountain of problems and worries that me and my teammates were able to overcome and the bond we made during and after the jam. 2.0 is the product of my solo attempt to continue Dragon War and improve its universe.</p>", "metacritic": null, "released": "2022-01-16", "tba": false, "updated": "2022-01-17T05:14:15", "background_image": "https://media.rawg.io/media/screenshots/c68/c689178cb1737f82a512867996aca555.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kat Lee"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}