{"id": 723254, "slug": "blazing-hymn-ashes-to-ashes", "name": "Blazing Hymn - Ashes to Ashes", "name_original": "Blazing Hymn - Ashes to Ashes", "description": "<p>Ashes to Ashes is an expansion to Blazing Hymn. It takes place not long after the first game, when Hymnals are holding the line against the Angelic invasion, and deals with the ways ordinary people respond to this existential threat.\r\n  </p>\n<p>Blazing Hymn is a LUMEN-powered game about Hymnal Units, music-powered battlesuits piloted by young musicians and designed to destroy Angels, who have come down to Earth to massacre humanity. This is an expansion, which means that the base rules are in the Blazing Hymn manual and this book contains some additional rules. In order to be able to play Ashes to Ashes, you’ll need Blazing Hymn as well.   </p>\n<p>Both games deal with the same subject matter: violence, blasphemous themes, civilian casualties, and young combatants.   </p>\n<p>Before starting a game, make sure everyone at the table is okay with these themes, or find a workaround. Make sure the players know that character death is their choice, not the game’s. Give everyone a chance, anonymously or not, to bring up things they find upsetting, uncomfortable, or triggering, and agree collectively to leave these things out. While you’re at it, agree on a safe way for people to let everyone know if they’re not doing okay so a scene can be stopped.\r\n  </p>\n<p>In other words, take care of each other.\r\n  </p>\n<p>Blazing Hymn is based on the anime Senki Zesshou Symphogear and Neon Genesis Evangelion. They’re not required viewing to play these games, but watching them might give you an idea of the stories the game was designed to tell.\r\n</p>", "metacritic": null, "released": "2022-01-15", "tba": false, "updated": "2022-01-17T05:30:26", "background_image": "https://media.rawg.io/media/screenshots/407/4077c0d627f354f5cbc0730567277182.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Peach Garden Games"], "genres": [], "publishers": [], "esrb_rating": null}