{"id": 72352, "slug": "zombie-attack-clicker", "name": "Zombie Attack - Clicker", "name_original": "Zombie Attack - Clicker", "description": "Aaaaah, It’s Zombie Attack! <br/><br/>Become a zombie slayer, in the most idle and laid back way possible - tap as fast as you can to save helpless survivors and rebuild your home in this FPS-like zombie clicker!<br/><br/>The great Apocalypse is in progress and the zombie armies are crashing through your windows, scraping at your door and chasing your long lost cat! So, crack your tapping fingers: it’s time to take back our world! Use the Great Railroad to move between towns and cities to hunt down this monster threat! Upgrade your guns and weapons to shoot the walking dead. Grab your fellow zombie hunters to destroy even the toughest and biggest Zombie Bosses!<br/><br/>Game features:<br/><br/>- Easy and fun gameplay - just tap, tap, tap as fast as you can to smash and squash the army of the dead in this zombocalypse!<br/>- Complete quests and get rewards!<br/>- Use 5 unique heroes (and more to come) to help you battle against the world’s toughest bosses!<br/>- Challenging zones - use special skills and boosts to get through the hardest zombie and monster waves in this newest zombie idle clicker!<br/>- An in-game store to purchase the most powerful ammo and equipment so you can splash and spray those zombies with even more powerful bullets!<br/>- Use multiple weapons to get your dirty job done!<br/>- Upgrade your heroes to turn them into the deadliest zombie hunters!<br/>- Travel the Railway in a heavily Armored Train and master your shooting skills in this exciting zombie clicker-tapper!<br/>- Join the leaderboard: compete with your friends to find out who is the best zombie slayer!<br/><br/>And in a classic clicker fashion, see detailed statistics of your most greatest achievements!<br/><br/>In case you’re experiencing crashes or the game doesn’t launch, please update to the latest version of iOS. We strongly recommend updating to iOS 11 for the stable game performance on iPhone 5s, 6, 6+.", "metacritic": null, "released": "2018-04-21", "tba": false, "updated": "2019-10-22T14:25:18", "background_image": "https://media.rawg.io/media/screenshots/ed8/ed8ea528478bcbc9c593e4c8f8aa5c1c.jpg", "website": "https://zimad.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZiMAD"], "genres": ["Action", "RPG"], "publishers": ["XIMAD"], "esrb_rating": "Everyone 10+"}