{"id": 72364, "slug": "bubble-birds-3-match-3-puzzle-shooter-game", "name": "Bubble Birds 3 - Match 3 Puzzle Shooter Game", "name_original": "Bubble Birds 3 - Match 3 Puzzle Shooter Game", "description": "Birds challenge you! You have a few shots to hit down all the birds on the field! It's time to try hand in the super addicting Bubble Birds shooter game!<br/><br/>Do you still think that the bird is a harmless little creature? Certainly not! In this game they will show you their true cunning and invincibility! Bounce these birdies from wall to wall in this fun, new and addictive twist to the classic bubble shoot game. <br/><br/>Incredible adventures and positive emotions are waiting for you!<br/><br/>Features:<br/><br/>TWO GAME MODES<br/>* Blitz: Weekly tournaments! <br/>* Adventure: Explore lots of different, colorful islands and 140+ levels <br/>* Compete with your friends by connecting to Facebook<br/><br/>BIRDS BOOSTERS<br/>* Master all of the special birds – bomb bird, rainbow bird, cash bird, the new lightning and painter birds and many others!<br/>* New firebird in both adventure and blitz modes<br/><br/>ADDICTING GAMEPLAY<br/>* Sync your progress across muitiple mobile and tablet devices<br/>* Free updates with new levels, new birds, obstacles and power-up boosts and challenges<br/>* Easy to learn, challenging to master. Do you have an ambition to grow? Test your skills, we believe in you!<br/><br/>Bubble Birds strategy:<br/><br/>• Birds will try to overwhelm you every move<br/>• The more birds you hit down, the more stars you get<br/>• It's important to aim accurately<br/>• Plan strategically your every shot<br/>• Use boosters if it's too complicated<br/><br/>Don’t worry, no birds were harmed in the making of this app.<br/><br/>Please note! Bubble Birds 3 is free to play but there are optional in-app purchases available. If you don't want this option enabled, disable it on your device under \"Allowed Content\". <br/><br/>Еmail us at bbsupport@ximad.com with any issues, questions or comments. We would love to hear from you!<br/><br/>Visit our FB community!<br/>https://www.facebook.com/superbirdsquest", "metacritic": null, "released": "2012-11-11", "tba": false, "updated": "2019-07-29T16:38:05", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d5897f3774526737178348c87dff3a4.jpg", "website": "https://www.facebook.com/superbirdsquest", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZiMAD"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["XIMAD"], "esrb_rating": "Everyone 10+"}