{"id": 723661, "slug": "plutos-revenge-rom-learning", "name": "Pluto's Revenge (ROM Learning)", "name_original": "Pluto's Revenge (ROM Learning)", "description": "<p><em>Pluto's Revenge was created by Angry Squid Games for ROM Game Jam 2015</em></p>\n<strong>You'll Show Them A Planet!</strong>\n<p>Pluto has recently gotten word that it’s been reclassified as a “dwarf planet,” and it’s really not happy about it! Whiz through space as a vengeful Pluto, destroying everything in your orbital path in an attempt to prove your planet-hood. Get advice from your helpful friend Rosetta, but watch out for that pesky scientist who'll take you down with his science facts and tweets!\r\n</p>\n<strong>The Facts Behind the Game</strong>\n<p>In 2015, the New Horizons space probe became the first human-made object to visit Pluto and its moons, and marked the culmination of over 50 years of exploring the major planetary bodies of our solar system. In the time since New Horizons launched, however, scientists here on Earth have reclassified Pluto; by January of 2006, they considered Pluto a dwarf planet, not a planet.\r\n</p>\n<p>This reclassification doesn’t mean Pluto is any less interesting, though! It actually means that Pluto and its system of moons differs from the 8 planets in our solar system in significant ways. Dwarf planets, by definition, are celestial bodies that orbit a star that are massive enough to become rounded by their own gravity (like a planet), but are not massive enough to clear their orbital “neighbourhood” of smaller bodies.  \r\n</p>\n<p>Neil deGrasse Tyson, who makes an appearance in Pluto’s Revenge, is a popular American astrophysicist and science communicator who has said for a long time that Pluto was too odd to be called a planet like the rest, but he was only “kind of” involved in the official move to reclassify it.\r\n</p>\n<strong>The ROM Connection</strong>\n<p>The ROM has one of the most impressive collections of meteorites in Canada, including meteorites which started out as pieces of the Moon, and even Mars! The study of such materials, called “planetary geology,” is a major focus of the geoscience that happens at the ROM, and it has led to important insights into the history and development of the rocky bodies in our solar system (for example, Mars).\r\n</p>\n<strong>What's a Game Jam?</strong>\n<p>At a ROM Game Jam, teams of developers spend a weekend at the ROM learning from collections and curators and using those ideas to build fun games inspired by the museum.  With only two days to research and create their games, the results can be weird, wacky, and downright wonderful!\r\n</p>", "metacritic": null, "released": "2022-01-14", "tba": false, "updated": "2022-01-17T07:04:44", "background_image": "https://media.rawg.io/media/screenshots/189/189489b294bb9f4c861ee987a09e1b1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ROM Learning"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}