{"id": 723638, "slug": "polygrowth", "name": "Polygrowth", "name_original": "Polygrowth", "description": "<p><em>Polygrowth was created by Andrew Animator for ROM Game Jam 2014</em></p>\n<strong>Eat. Grow. Evolve.</strong>\n<p>In Polygrowth, the player begins as a prokaryote, represented by a triangle. As mutations fly toward the player, some manage to stick in the population; others don’t. Once enough mutations have been collected, the player evolves into a more complex creature, and the polygon gains an additional side. How far can you evolve?</p>\n<strong>The Facts Behind the Game</strong>\n<p>In Polygrowth, players strive to collect “mutations” which drive their “evolution” - becoming more complex and “survival” becoming more difficult along the way. “Evolution” of this sort is fairly common in video games, but in real life, evolution is less about “Leveling Up” than it is simply about change and survival. Biological evolution is defined as any change in the genetic inheritance of an interbreeding group of living things over several generations. Changes that improve a living thing’s ability to survive (i.e. make it more competitive) that can be passed on will spread through interbreeding groups over time as the survivors breed. As generations pass, those changes can add up - and new species can form.\r\n</p>\n<strong>The ROM Connection</strong>\n<p>Evolution will be the central story the ROM plans to highlight in its upcoming Dawn of Life Gallery. Still in the planning stages, this gallery is being spearheaded by Dr. Jean-Bernard Caron, the ROM’s Curator of Invertebrate Palaeontology and a world-leading expert on the the Burgess Shale - a fossil locality of global importance found in the Rocky Mountains of Yoho National Park, British Columbia. The extraordinary fossils of the Burgess Shale studied at the ROM inform our understanding of the early evolution of many different animal groups.\r\n</p>\n<strong>What's a Game Jam?</strong>\n<p>At a ROM Game Jam, teams of developers spend a weekend at the ROM learning from collections and curators and using those ideas to build fun games inspired by the museum.  With only two days to research and create their games, the results can be weird, wacky, and downright wonderful!</p>", "metacritic": null, "released": "2022-01-14", "tba": false, "updated": "2022-01-17T06:59:00", "background_image": "https://media.rawg.io/media/screenshots/28a/28a2a7a985e2bc04a9466dc84d60e65c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ROM Learning"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}