{"id": 723740, "slug": "paleo-puzzle", "name": "Paleo Puzzle", "name_original": "Paleo Puzzle", "description": "<p><em>Paleo Puzzle was created by Andrew Animator for ROM Game Jam 2014</em><br/></p>\n<p><strong>Professor Rex needs your help!</strong></p>\n<p>The professor has uncovered several dinosaur bones, but his arms are too short to assemble them properly. Become a palaeontologist and help Professor Rex assemble a new hadrosaur skeleton for the museum.</p>\n<strong>The Facts Behind the Game</strong>\n<p>Fossils are the remains and/or traces of once living things (e.g., bones, shells, leaves, footprints) preserved in stone, which palaeontologists study in order to piece together the story of Life’s past on our planet. By studying and comparing the skeletons of many different animals (both recent and ancient), dinosaur palaeontologists become experts at distinguishing between the many bones of a dinosaur’s body, and the differences that can be seen in these bones between the different families of dinosaurs. Closer inspection, measurement, and comparison against the many specimens found in museum collections enables experts to determine whether a given find is something new to Science.\r\n</p>\n<strong>The ROM Connection</strong>\n<p>Dr. David Evans is the Curator of Vertebrate Palaeontology in the Centre for Fossils and Evolution at the ROM, for whom “duck-billed” dinosaurs (or Hadrosaurs) have long been an area of interest. Close comparison by Evans and colleagues of what were thought to be five different types of duck-billed dinosaurs revealed what were in fact younger and older growth stages of only two different types of <em>Edmontosaurus</em> (the dinosaur which Professor Rex is trying to assemble).\r\n</p>\n<strong>What's a Game Jam?</strong>\n<p>At a ROM Game Jam, teams of developers spend a weekend at the ROM learning from collections and curators and using those ideas to build fun games inspired by the museum.  With only two days to research and create their games, the results can be weird, wacky, and downright wonderful!</p>", "metacritic": null, "released": "2022-01-14", "tba": false, "updated": "2022-01-17T07:23:07", "background_image": "https://media.rawg.io/media/screenshots/a00/a006c8d98058ebceb2cc9eaa3d5de353.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ROM Learning"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}