{"id": 723750, "slug": "cavehaven-coming-in-february", "name": "Cavehaven - Coming in February!", "name_original": "Cavehaven - Coming in February!", "description": "<p><strong>What is Cavehaven?</strong><br/></p>\n<p>Cavehaven, home to the Goblins of Kokono Village, is comprised of a network of caves stacked on top of and beneath the wide open cavern the Goblins have cleared out and built their home in. Seeking shelter from what they call the Brightblight, the Goblins of Kokono are content to hide from predators, and more importantly from the humans of the surface, in the damp shade of sheltering stone, deep below the mountains. You could plant Cavehaven into just about any mountain range in any game and fantasy world you like, but future releases will detail a much larger world that Cavehaven is just a tiny part of.</p>\n<p>Built on the scaffolding of what I’m calling the OHMEN system, Cavehaven is mainly a setting zine for fantasy gametables that you can use as you like just note that the emphasis on Stress and Relief are artifacts of a set of rules that are still very much under construction. This zine will read more system neutral and OSR, but will provide hints toward the design goals for the game system to come.</p>\n<p><strong><em>When</em> is Cavehaven?</strong></p>\n<p>Cavehaven is currently in-development and will be showcased during the month of February as part of ZineMonth! Go check out all of the amazing projects involved here: https://www.zinemonth.com/.</p>\n\n<p>Cavehaven is available right now for Pre-Order and will be downloadable February 1st! If you'd like to sign up for my newsletter to be reminded, please do so here: https://www.getrevue.co/profile/valkyrie_sknave</p>\n<p>As Cavehaven is still in-development, it's possible that the documents available February 1st will continue to be expanded upon and updated moving forward; however please note that as more and more content is added to Cavehaven the pricing of the book is likely to increase! By Pre-Ordering today you lock in your copy of Cavehaven, with any and all potentially additional content added, for the lowest price possible!</p>\n<p><strong>Itchfunding?</strong><br/></p>\n<p>To be put toward commissioning more artwork, a better cover, and professional layout and editing, I'm hoping to raise as much as <strong>$500</strong> to pay artists and editors to help me make Cavehaven into the best damn zine it can be! That's going to break down to something like:<br/></p>\n<ul><li><strong>$300</strong> for art of the remaining creatures, plants, resources, and craftables in Cavehaven.</li><li><strong>$100</strong> for a better cover!</li><li><strong>$100</strong> for professional editing and layout.</li></ul>\n<p>If we're able to raise <strong>$750</strong>, then I'll buy up a small print run and send out coupon codes to everyone who has paid for the digital copy, offering them hefty discounts toward the completed, edited printed copy of the zine!</p>\n<p>And if we raise more than <strong>$750</strong> dollars, hey, I get to pay myself for creating this thing!</p>\n<p><strong>Outro &amp; Credits</strong><br/></p>\n<p>Play as goblins who have found yourselves mysteriously in the quaint, hidden village of Kokono and discover the barest hints at a much, <em>much</em> larger world populated by fantastic beasts, monstrous humans, and limitless wonders. Explore the secrets of this Cavehaven, discover the magic of the Wisps, and uncover a timeless tragedy of rage and grief that could unravel everything.</p>\n<p>Featuring art from the extremely talented Fay Lane (@faera_lane), Raul Volpato (@raul_volp), Alex Dameceno (@GnarledMonster), and @waiweiko!</p>", "metacritic": null, "released": "2022-01-10", "tba": false, "updated": "2022-01-17T07:25:18", "background_image": "https://media.rawg.io/media/screenshots/168/168d2786591cb0de41f34c7f71c7591e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Braden M. Rohl"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}