{"id": 72381, "slug": "blackjack-classic-21-poker-game", "name": "Blackjack+ Classic 21 poker game", "name_original": "Blackjack+ Classic 21 poker game", "description": "This is the MOST funny Blackjack game, also known as 21, on the store!! Play as in real casinos and beat the dealer to win tons of dollars! <br/><br/><br/>RULES AND OPTIONS:<br/><br/>This is a free Blackjack game that you can play against the dealer. It is played with two or more decks of 52 cards. The object of the game is to beat the dealer in one of the following ways:<br/><br/>• Get a BlackJack on the player's first two cards (21 points), without a dealer blackjack.<br/>• Reach a final score higher than the dealer without exceeding 21<br/>• Let the dealer draw additional cards until his or her hand exceeds 21.<br/><br/><br/>MAIN FEATURES:<br/><br/>• Experience authentic Vegas style Blackjack from anywhere in the world<br/>• Challenge the house – bet big to unlock new tables and win chips<br/>• Come back every few hours for BONUS chips<br/>• Toggle “Insurance” and “Surrender” on or off<br/>• Compare scores on global leaderboards<br/>• Large cards, HD graphics <br/>• Easy to play and fun<br/>• King of Vegas? Try your luck around the world in London, Monaco, Macau or Vegas<br/>• Win more chips when you get Blackjack <br/>• Choose between different table themes<br/><br/><br/>Please download the Blackjack now and play the Blackjack against the dealer and see who can WIN by getting 21 without going bust! If you go bust don't worry, you can get 500 chips free per four hours so you can come back later and play more blackjack if your luck runs out.<br/><br/>We hope you enjoy playing Blackjack!", "metacritic": null, "released": "2017-03-07", "tba": false, "updated": "2019-10-22T14:25:19", "background_image": "https://media.rawg.io/media/screenshots/e8b/e8b1c884252b8607bc693d73f8d122b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bubble Blast LTD. - Fun free music games"], "genres": ["Card"], "publishers": ["Jiangsu Chong Promise Investment Co"], "esrb_rating": "Teen"}