{"id": 723843, "slug": "starship-quest-lazzah", "name": "STARSHIP QUEST (Lazzah)", "name_original": "STARSHIP QUEST (Lazzah)", "description": "<p>The Intrepid Space Adventures of Mike Erlin - Chapter 2:</p><p>You are Lieutenant Mike Erlin, Astro-Navigation Officer on board the FSP Survey Corps spaceship \"Stellar Queen\".</p>\n<p>Your solo mission on the \"Magnetic Moon\" was a great success, but the ship is now heading out of the system to a hyperspace jump  point, with orders to take Commander Davey, sole survivor of the wrecked scoutship  \"Pathfinder\", to the nearest hospital base without delay.</p>\n<p>You are convinced that the answer to the mystery of the two discs that were given to you by Jaelaine, the beautiful High Priestess of the Psian people - discs that she called the \"keys to the universe\" - lies on the mother planet of the moon, on which are several huge, abandoned cities and what appear to be vast, empty spaceports. You have told the captain of your theories but he tells you that his orders are specific and the ship cannot be stopped or turned around to allow you to go back to the planet. He orders you to attend to your duties and forget any ideas about jumping ship.</p>\n<p>You decide that you cannot rest until you have discovered what these \"keys\" are for and resolve to once again go it alone and disobey the captain's orders. But HOW exactly are you going to get off the ship - the hyperspace jump is just a few minutes away!</p>\n<p>Then you have it - the lifeboats! If you can get to one  of  the  ships'  lifeboats, you can fly back to the planet - but you only  have THREE MINUTES to get yourself some equipment and then launch yourself off the 'Queen in one of the lifeboats - can you do it?</p>", "metacritic": null, "released": "2022-01-14", "tba": false, "updated": "2022-01-17T07:46:41", "background_image": "https://media.rawg.io/media/screenshots/779/7796ee1e3e22e914d655f47274adbd5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Lazzah"], "genres": [], "publishers": [], "esrb_rating": null}