{"id": 723970, "slug": "mcspace-colosseum", "name": "McSpace Colosseum", "name_original": "McSpace Colosseum", "description": "Welcome to the best and newest reality show of McSpace Network: McSpace Colosseum!<br/><br/>In this action-packed show you’ll never see the same thing twice, everything is dynamic with different challenges every time. McSpace has built arenas in lot of different planets of the galaxy, every show will feature different worlds!<br/><br/>Discover each of the different arenas with their own local fauna &amp; flora, along with some little presents. Survive traps and puzzles unique to each arena, and lay down their mighty bosses.<br/><br/>Beat your enemies with all kinds of artifacts, relics and gadgets. All of them with different effects and powers, and with lots of synergies to discover! Grab everything you can and keep growing stronger and more powerful.<br/><br/>Face de colosseum on your own or with up to 4 players, local or online. But remember, even the best allies can betray you, or kill you by mistake!<h3>Main Features</h3><ul><li>roguelike With top-down 2d Graphics<br/></li><li>Different gladiators with unique skills and gameplay!<br/></li><li>More than 300 different power-ups and medals! From health upgrades up to mass-destruction weapons!<br/></li><li>Lots and lots of unlockable content! The more you explore more possibilities available!<br/></li><li>Randomly generated dungeons, with content focused for multiplayer modes.<br/></li><li>A changing overworld with interactive mechanics, collect energy, catch the bunny or fight a boss!<br/></li><li>Inspired in action reality shows. Do not get taunted by our host’s banter!</li></ul>", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2022-01-21T03:25:41", "background_image": "https://media.rawg.io/media/screenshots/6c8/6c80385d6e8e7130cfbd8c44e739f5b3.jpg", "website": "http://www.mcspacecolosseum.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Drowsy Whale"], "genres": ["Action"], "publishers": ["Drowsy Whale"], "esrb_rating": null}