{"id": 723965, "slug": "virtual-maid-streamer-ramie", "name": "Virtual Maid Streamer Ramie", "name_original": "Virtual Maid Streamer Ramie", "description": "\"Virtual Maid Streamer Ramie\" is a novel game with choices.<h3>Story</h3><br/>It all started when the protagonist randomly came across a video of the newly debuted maid Vtuber \"Ramie Amatsuka.\" Our lonely hero was tired of his job and lost his lust for life, his only comfort being Ramie Amatsuka's live streams.<br/><br/>At first, she was just an illustration. However, through the wonders of technology, she started to be able to truly come to life.<br/>Eventhough it was through the screen, just by watching her channel grow and how enthusiasticaly she chatted with her audience, he felt his spirits lift.<br/><br/>One day, Ramie Amatsuka, a former citizen of the virtual world, appeared in front of the protagonist by jumping through the screen...<br/><br/>\"Spend time with the cheerful maid Vtuber who wants to take care of you. Your fun and raunchy room-sharing life begins now!\"<h3>Character</h3><br/><br/><br/><strong>Ramie Amatsuka</strong><br/>CV：Hiiro Harusaki<br/><br/>An apprentice angel-maid who debuted as a Vtuber. Her channel has almost a million subscribers, she is one of the most popular Vtubers.<br/><br/>She is a little clumsy, but very caring girl who came out of the virtual world to make the protagonist smile.<br/><br/>When Ramie was just starting out and at a low point in her career, the protagonist was there for her with words of encouragement.<br/>To repay his kindness, she left the virtual world and ended up living with him.<h3>Feature</h3><br/>・Smooth character animation via the E-mote system.<br/>・Endings for different routes.<br/>・Breathtaking HD illustrations.<h3>Staff</h3><br/>・Character design：Itohana<br/>・Script：Amamikabocha<br/>・Producer：Jiro Shinagawa", "metacritic": null, "released": "2022-01-19", "tba": false, "updated": "2023-10-20T07:33:32", "background_image": "https://media.rawg.io/media/screenshots/b91/b91eb1eba1620841b406d8dfd03c97f9.jpg", "website": "https://monime.info/ramie/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["iMel", "monime"], "genres": ["Adventure", "Indie"], "publishers": ["MediBang", "iMel"], "esrb_rating": null}