{"id": 723963, "slug": "mindcop", "name": "Mindcop", "name_original": "Mindcop", "description": "Mindcop is a non-linear „whodunnit“ detective game. It mixes a story driven adventure<br/>with real-time puzzle gaming.<br/><br/><br/>As the infamous Mindcop, you can dive into the minds of your suspects to<br/>uncover their secrets and unravel their lies.<br/><br/><br/>Time in the game doesn‘t go by in real-time. Instead, every action comes with a time<br/>cost and you will have to set priorities while figuring out where you want to spend your time.<br/><br/>Looking at every little thing in a room, or showing a suspect every single item you picked up,<br/>is probably not a good idea. You will be forced to make tough decisions on what is <br/>really worth your time and what will just lead you to another dead end. <br/><br/>Can you catch the killer in 5 days?<br/><br/><br/>\"Mindsurf\" is what it is called, when the Mindcop attempts to sneak into the mind of one<br/>of the suspects. This plays out as a real-time puzzle game.<br/><br/>Some minds will be harder to surf and you can level up your Mindbullets<br/>to make things easier for yourself.<br/><br/>Complete a Mindsurf to explore the \"Sea of Thoughts\" in that person‘s head.<br/>Here you can find clues and topics to use in a conversation with your suspects.<h3>ACCESSIBILTY</h3><strong>There are no language options. English only!</strong><br/><br/><strong>TEXT</strong><br/>Text size or font type can‘t be changed in any way.<br/>The size or appearance of the User Interface can‘t be changed.<br/>Example of actual 1:1 text size when playing in fullscreen at a 1920x1080 Resolution:<br/><br/>There is no Text-to-Speech option.<br/>Keep in mind that reading is a big part of this game.<br/><br/><strong>COLOR</strong><br/>The game frequently features a Mini Game that asks you to distinguish between<br/>4 colors (red, cyan, purple and yellow). The Mini Game uses up to 3 of these<br/>colors at a time. Examples: <br/><br/>This is not possible in the Demo, but the full game will have an option to turn the Mini Game <br/>off entirely. The Options Menu provides a Color Blind Mode. This Mode adds Symbols <br/>to the Mini Game. Example: <br/><br/><br/><strong>CONTROLS</strong><br/>The game can be played with only the Mouse (Mousewheel or Middle Mouse Button<br/>are not used). You can also use Mouse+Keyboard if you prefer walking around with <br/>the Arrow Keys.<br/>The game can also be played with Gamepads. Most Gamepads are supported.<br/>Most Buttons of the Gamepad are used with the exception of the D-Pad and the<br/>Analog Stick-Buttons (Where you have to press into the Control Stick).<br/>The Shoulder Buttons (Triggers) are only used in the Mini Game. <br/>You don‘t have to use them and can instead use the Bumpers or Face Buttons. <br/>There is no option for any kind of Button Remapping.<br/>The only times the game asks you to do anything under time pressure is during the <br/>Mini Game. This is not possible in the Demo, but the full game will have an option to  <br/>turn the Mini Game off entirely.<br/><br/><strong>AUDIO</strong><br/>Every spoken dialog comes with subtitles.<br/>Sound is not necessary to complete the game. There will sometimes (not often)<br/>be optional things (hints, storytelling) players can pick up on in music and sound effects.<br/><br/>Anything missing in this list? Please tell me! (mindcopgames@gmail.com)", "metacritic": null, "released": null, "tba": false, "updated": "2022-01-21T03:21:08", "background_image": "https://media.rawg.io/media/screenshots/60b/60b0966b997c69b37547bf9873d31c0a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mindcop Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Mindcop Games"], "esrb_rating": null}