{"id": 72399, "slug": "werewords", "name": "Werewords", "name_original": "Werewords", "description": "<p>The Werewords™ app is used with the game Werewords to run the night phase, generate Magic Words, and perform timer options for players. This app requires either Werewords or Werewords Deluxe Edition, sold by Bezier Games, Inc.<br />\nIn Werewords, players guess a secret word by asking “yes” or “no” questions. Figure out the magic word before time is up, and you win!<br />\nHowever, one of the players is secretly a werewolf who is not only working against you, but also knows the word. If you don’t guess the word in time, you can still win by identifying the werewolf!<br />\nTo help you out, one player is the Seer, who knows the word, but has to be careful not be too obvious when helping you gure it out; if the word is guessed, the Werewolf can pull out a win by identifying the Seer!<br />\nTo use the app: If the logo at the top of the screen does not match the logo on your box, tap the settings button (gear) and then tap the box at the top of the settings screen that matches your version of the game.<br />\nChoose the roles you are using in the game, then tap the Play button to start the game. The app will ask all of the players to close their eyes, then wake up the Mayor and any other selected roles in order. Then the app will ask all player to open their eyes, and the day timer will start. If the players guess the Magic Word before time is up, the Mayor taps the &quot;Correct&quot; button, and then the Werewolves can still win if they figure out who the Seer is. If the players do NOT get the Magic word before time is up (or if they run out of Yes/No tokens), the players can still win by figuring out who one of the werewolves is.<br />\nThe Werewords app also includes the following options (tap the gear to adjust them):<br />\n-- a custom soundtrack<br />\n-- the ability to create custom word lists<br />\n-- More than 15,000 words in four different difficulties (Easy, Medium, Hard, and Ridiculous)<br />\n-- Built-in additional themed wordlists such as Movies, 80s, Music, 50s &amp; 60s, Literature, and Food, with more being added all the time<br />\n-- The ability to adjust the in game and day phase timers<br />\n-- The ability to adjust how many words the Mayor may pick from\\<br />\nSee the in-app help for more details.<br />\nWerewords is designed by Ted Alspach, the game designer of other popular games such as One Night Ultimate Werewolf, Suburbia, and Castles of Mad King Ludwig.<br />\nBezier Games publishes party games and strategy games. Check out their entire game library and pick up a copy of Werewords at beziergames.com.</p>", "metacritic": null, "released": "2017-06-04", "tba": false, "updated": "2019-07-29T15:59:24", "background_image": "https://media.rawg.io/media/screenshots/9a9/9a9603d7eeeb66aafa68d618675fa5e5_O30ZYDF.jpg", "website": "http://beziergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Bezier Games"], "genres": ["Board Games"], "publishers": ["Bezier Games"], "esrb_rating": null}