{"id": 723999, "slug": "chernobyl-inferno", "name": "Chernobyl inferno", "name_original": "Chernobyl inferno", "description": "After the disaster at Chernobyl Atomic Power Station, many locals hid from radiation in underground shelters, canalization, houses basements and other underground units. They had been living underground for several years being afraid to go out. In some years radiation got through the ground, people started to mutate,  chaos under the ground had begun. As a result of the mutation, some people became aggressive and started to hunt other people. After 30 years one boy called Jack penetrated Chernobyl territory to film a video and make some photos. When he entered the old house, the floor under his feet collapsed and he fell into the sewers of the very dungeon in which the mutated inhabitants of Chernobyl lived. He managed to send you a message asking for help, after which he never got back in touch. Your main goal is to find your brother, who got lost in the catacombs of Chernobyl.<br/>\n<br/>\r\nChernobyl inferno is a horror game. Real horror throughout the game will keep you in awe, the feeling of fear will not leave you all the time.<br/>\n<br/>\r\nYou have to survive in the catacombs of Chernobyl among mutated and aggressive inhabitants, you will not have a weapon - only a flashlight. The only way to survive is just to run and hide. You need to play almost the entire game in stealth mode. Unpredictable and ruthless enemies will keep you in constant fear.", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2022-01-21T03:43:33", "background_image": "https://media.rawg.io/media/screenshots/66d/66db2d27f2362c83df45c377e290f3da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shumilin"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Shumilin"], "esrb_rating": null}