{"id": 724062, "slug": "axiallis", "name": "Axiallis", "name_original": "Axiallis", "description": "Don’t let the look of this game deceive you, it might look similar to Tetris, but it doesn’t play like Tetris. The goal is to overlap the piece’s pivot segments on top of each other and stack as many pieces as you can on the play field. Train your brain in pattern recognition, develop good strategies than practice to play faster. Everything you do whilst playing is analyzed; the quality of your play style and everything related to your reaction time and play speed. When you complete a game, the taunting AI will judge your performance and comment on it. It might give you advices, encouragements or even laugh at you. Axiallis, like many puzzle game, is an excellent tool to keep your brain healthy and stimulated.<br/><br/>The cyber sci-fi visual theme of the game is complemented by a soothing downtempo soundtrack composed by NeurAxis.<br/><br/><br/><br/><br/><br/>Jonas Neubauer (April 19, 1981 – January 5, 2021) was an American Tetris player, seven-time champion at the Classic Tetris World Championship.<br/><br/>He brought back, for many of us, a love for NES Tetris. But apart from that, he was an intelligent, funny and kind person that really had a special gift to make everyone feel appreciated and included. The Evonescent indie game studio was founded a few weeks after Jonas's passing and is entirely due to that tragic event. The name \"Evonescent\" comes from evolution and evanescent, and for which the concept was\" The Evolution of everything that fades away\". By making this game, we pay tribute to Jonas, whom we loved. We really hope that Axiallis will be able to play a small part in keeping the memory of Jonas Neubauer alive. <br/><br/>", "metacritic": null, "released": "2022-01-19", "tba": false, "updated": "2022-01-21T04:25:40", "background_image": "https://media.rawg.io/media/screenshots/cdb/cdbdfaf31b08c6699c9817851fd9d3c7.jpg", "website": "https://axiallis.evonescent.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evonescent"], "genres": ["Indie"], "publishers": ["Evonescent"], "esrb_rating": null}