{"id": 724028, "slug": "gravity-game-2", "name": "Gravity Game", "name_original": "Gravity Game", "description": "<strong>Free</strong><br/><br/>Gravity Game is free to own for the next thirty days. Yes, that means if you claim it within the promotion period, you will get to keep playing even when it becomes paid. Claim it and start playing now. Tell your friends.<br/><br/><strong>Why is the game free?</strong><br/><br/>Being heavily inspired by the free flash games of the past, we wanted to bring back some of that magic by giving our debut game away for free. <br/><br/>Gravity Game is a physics-based multiplayer territory control game - with rockets, vehicles, and explosive maces that send shockwaves in all directions.<br/><br/>Developed by Parra Games as their debut game, Gravity Game brings the classic sport of sumo into a modern FPS for you to play with your friends. Your goal is to keep everyone out of the ring while claiming victory for your team. Play as either Ti Prospecting or First State Galactic to win the planet for your company.<br/><br/><br/><br/><strong>Multiplayer</strong><br/><br/>Developed as a multiplayer game from the ground up, you can play with up to 32 players in action-packed multiplayer games. <br/><br/><strong>Private Games</strong><br/><br/>Ability to set invite-only matches. Invite your friends in the pause menu.<br/><br/><strong>Vehicles</strong><br/><br/>Enter the PVAC scout, a hovering mining vehicle constructed for the sole purpose of finding ore veins, now used to carry you and your friends to the middle of the ring. Being converted Utility vehicles, make sure to keep an eye on them as they can aid and hinder you. <br/><br/><strong>MagMace </strong><br/><br/>A melee weapon that explodes with a burst of energy, sending everything close (including yourself) far away. This will be your primary weapon of choice if you want to perform epic manoeuvres or if you run out of ammunition.<br/><br/><strong>MagNades</strong><br/><br/>MagNades are grenades that attach to anything they touch after they are thrown. Use them to boost your opponents out of the ring strategically. <br/><br/><strong>Mining Rockets</strong><br/><br/>The very latest in explosive mining technology. Used to loosen rock and to clear out the occasional rodent from mines, these are the perfect weapons to explode other Scouts or players out of the ring. But be wise, you only get two shots - rockets are expensive, after all.<br/><br/><strong>Manoeuvres</strong><br/><br/>Combine all your tools to manoeuvre yourself away from your opponent and to manoeuvre them out of the ring.", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-01-21T04:03:49", "background_image": "https://media.rawg.io/media/screenshots/f37/f37adc5c6ee7b36484e7ca5a32b46815.jpg", "website": "https://parragames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 425, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Parramatta Games Studios"], "genres": ["Action"], "publishers": ["Parramatta Games Studios"], "esrb_rating": null}