{"id": 72407, "slug": "christmas-sweeper-2", "name": "Christmas Sweeper 2", "name_original": "Christmas Sweeper 2", "description": "We thought Christmas Sweeper 2 would be your favorite game during the holiday season. BUT WE WERE WRONG! It turns out to be your favorite game the whole year round! So open this Christmas present NOW, it's FREE!<br/><br/>Get in the Christmas mood with this relaxing match-3 puzzler, featuring over 2100 challenging levels and many hours, no, many MONTHS of fun!<br/>You don't have to wait for lives, or annoy your friends to play or advance in this game. With soothing Christmas music and beautiful graphics, this game is an ABSOLUTE JOY to play!<br/><br/>If you're tired of complicated candy matchers which keep stressing you out and punish you with limited moves and lives, then this game will be a relieve! This light hearted and easy match-3 game will not break the bank either. All levels can be won without spending a cent. But even our boosters are cheaper and more powerful than what you're used to!<br/>As such, Christmas Sweeper 2 is played and loved by the whole family, with special care being taken to make it fun for seniors as well.<br/><br/>So give this game a try and start swapping and sweeping Christmas trees, baubles, bells, gingerbread men and more. Help Santa and Rudolph to collect all the chocolates while enjoying the atmosphere and the Christmas music. <br/><br/>• \"I open the game to check it out and spent hours playing. Love the Christmas theme to enjoy year around.\" - Reniece<br/>• \"One of the best! Very challenging, yet winnable. Fun getting daily bonuses.\" - zzxxyt<br/>• \"I love matching games, but I'm often frustrated when they require purchases for boosters, extra time, lives etc.. This game has no limits, apparently, on the number of retries so I can play as long as I like. It's the perfect time-filler for relaxation.\" - Macomber #8<br/><br/><br/>For any feedback, please contact us using the contact button in the game.<br/><br/>Check out our facebook fan page for more match-3 goodness: https://www.facebook.com/SmileyGamer", "metacritic": null, "released": "2014-11-19", "tba": false, "updated": "2019-10-22T14:25:19", "background_image": "https://media.rawg.io/media/screenshots/b19/b198dc620cbec89468c60f9112888be3_GetP74C.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SmileyGamer"], "genres": ["Board Games", "Puzzle"], "publishers": ["SmileyGamer"], "esrb_rating": null}