{"id": 724016, "slug": "solitaire-expeditions", "name": "Solitaire Expeditions", "name_original": "Solitaire Expeditions", "description": "<h3>Solitaire without the gimmicks!</h3>Free play mode offers over 100 solitaire variants in a clean and simple interface. No gems, power-ups or wildcards, just classic solitaire games played with standard rules. Choose from well-known favorites such as Klondike, FreeCell, Spider, Canfield, and Golf or try a new variant you've never heard of before! Don't know how to play? No problem—rules for all variants are available in game.<br/><br/><br/><h3>Why just play solitaire when you can go on an expedition?</h3>If you're looking for more, try campaign mode where you can embark upon a cross-country expedition. Plan your route and travel from state to state by winning games. And since every expedition needs mystery and adventure, each state features three randomly selected solitaire variants, letting you experience games you may have never seen before!<br/><br/><br/><br/><h3>Discover and unlock new items</h3>What’s an expedition without new things to discover? As you make your way through the campaign or free play, accumulate points, earn achievements or find other ways to unlock new card backs, decks or backgrounds.<br/><br/><br/><h3>User profiles</h3>Solitaire Expeditions supports multiple user profiles. Keep your hard-earned stats and progress separate from other members of your family or friends!<br/><br/><br/><h3>Complete list of variants</h3><br/><strong>A:</strong> Acme, Acme II, Agnes Bernauer, Ali Baba, All in a Row, American Toad, Arizona, Aunt Mary<br/><strong>B:</strong> Baby Spiderette, Baker's Dozen, Baker's Game, Beleaguered Castle, Black Hole, Black Widow, Bristol, Busy Aces<br/><strong>C:</strong> Canfield, Castles in Spain, Chameleon, Clock, Colours<br/><strong>D:</strong> Dawson, Demon Fan, Deuces, Diplomat, Double Canfield<br/><strong>E:</strong> Easthaven, Eight Off, Emperor<br/><strong>F:</strong> Faerie Queen, Fan, Fanny, Farmer's Wife, Flower Garden, Fly, Fortune's Favor, Forty Thieves, FreeCell, Frog<br/><strong>G:</strong> Gargantua (no redeal), Gargantua (one redeal), Golf (Kings on Queens), Golf (Putt Putt), Golf (Traditional), Good Measure, Grounds for Divorce<br/><strong>H:</strong> HardCell<br/><strong>I:</strong> Indian, Intelligence<br/><strong>J: </strong> Josephine<br/><strong>K: </strong> King Albert, Klondike (draw 1), Klondike (draw 3)<br/><strong>L: </strong> La Belle Lucie, Lady Betty, Lanes<br/><strong>M: </strong> Martha<br/><strong>N: </strong> New York, Number Ten<br/><strong>O: </strong> Osmosis<br/><strong>P: </strong> Peek, Poker Squares<br/><strong>Q: </strong> Queen of Italy, Queens and Jacks<br/><strong>R: </strong> Rainbow, Relaxed FreeCell, Rows of Four, Russian Solitaire<br/><strong>S: </strong> Salic Law, Scorpion, Scorpion II, Seahaven Towers, Selective Castle, Siegecraft, Sir Tommy, Spanish Patience, Spider (1 suit), Spider (2 suits), Spider (4 suits), Spiderette (1 suit), Spiderette (2 suits), Spiderette (4 suits), Stonewall, Storehouse, Strategy, Streets and Alleys, Superior Canfield<br/><strong>T: </strong> The Clock, Thieves of Egypt, Thirty Six, Three Blind Mice, Three Cells, Thumb and Pouch, Thumb and Pouch 2 Decks, Triple Klondike, Two Cells<br/><strong>V: </strong> Variegated Canfield<br/><strong>W: </strong> Wasp, Westcliff, Whitehead, Wildflower<br/><strong>X: </strong> X Marks the Spot<br/><strong>Y: </strong> Yukon<br/><strong>Z: </strong>Zendike", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-09-26T14:04:13", "background_image": "https://media.rawg.io/media/screenshots/1e2/1e2c1d12fac8adfdacebee217414dfa3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Quirky Porcupine"], "genres": ["Casual"], "publishers": ["Quirky Porcupine"], "esrb_rating": null}