{"id": 724019, "slug": "red-tether-", "name": "Red---Tether-->", "name_original": "Red---Tether-->", "description": "Red Tether features explosive top-down space action with a unique \"indirect combat\" system. You'll face large space fleets while being armed with nothing but tether-harpoons and your wits.<br/><br/><br/><ul><li>Fight tether-based space battles that revolves entirely around linking yourself with opponents or them with each other. <br/></li><li>Crash vessels into another using contracting tethers.<br/></li><li>Rip off enemy weapons and attachments with well placed harpoons.<br/></li><li>Outmaneuver the fleet by graple-swinging around objects.<br/></li><li>Use your ship as a battering ram by slamming yourself into the opposition.</li></ul><br/><br/><ul><li>Experience fresh \"combat-puzzle\" gameplay that requires split-second tactical decisions amid fast paced action.<br/></li><li>Learn to counter various fleet elements, including attack ships, support crafts and logistic units.<br/></li><li>Fight through 50+ pre-made waves, or face randomly generated fleets in endless mode.<br/></li><li>Clash with 16+ massive boss enemies and turn them into screen-filling explosions.<br/></li><li>Dodge clearly telegraphed enemy attacks and potentially turn them against your opponents.<br/></li><li>Avoid or exploit various hazards like fuel spills, electrified hulls or coolant clouds.</li></ul><br/><br/><ul><li>Unlock 6+ player ships that offer distinct playstyles, advantages and challenges.<br/></li><li>Improve your craft with 70+ stackable ship and tether upgrades.<br/></li><li>Discover 10+ star system zones and the new enemies they throw at you.<br/></li><li>Piece together the games lore by finding black boxes among all the ship-debris.<br/></li><li>Late game challenge modes.<br/></li><li>Basic controller support and assist options.</li></ul>", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-01-21T03:57:29", "background_image": "https://media.rawg.io/media/screenshots/019/0194f57927b811b5d1b79d14ff982e55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Sleeper Games"], "genres": ["Action", "Indie"], "publishers": ["Sleeper Games"], "esrb_rating": null}