{"id": 724023, "slug": "hentai-houseparty-gyaru-gangbang", "name": "Hentai Houseparty: Gyaru Gangbang", "name_original": "Hentai Houseparty: Gyaru Gangbang", "description": "<p>Mea, Lily, and Yuina, are all smoking hot gyarus, who spend their free time lounging around in your house, oozing sex appeal all over the place! Deliciously tanned skin, makeup on point, not to mention their impeccable proportions! With Mea pressing those heaving tits up against you, Lily&#39;s endless cleavage tempting you 24/7, and the golden brown absolute territory between Yuina&#39;s tights and skirt, you&#39;ll have plenty of fap material for sure. But why should you be left with only your hands for company when a treasure trove of lewd delights is in the next room!<br />\nKick this Hentai House Party into overdrive, with an all-out Gyaru Gangbang! Teach these sluts not to underestimate you and your dick, as you turn these bitchy unwelcome guests into your own personal collection of Gyaru brand onaholes!<br />\nTranslated version of the original Japanese Visual Novel<br />\nAll the Gyarus are fully voiced with original Japanese dialogue<br />\nOriginal artwork HD upscaled with 16:9 and 4:3 variants<br />\nHours of story content<br />\nAudio including music and special effects<br />\nEnhanced with character sprite animations<br />\nGallery and Scene selections<br />\nPlenty of sexy fun taking each gyaru for a ride!<br />\nHentai Houseparty: Gyaru Gangbang Is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong>PLEASE NOTE</strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-11-06T09:34:52", "background_image": "https://media.rawg.io/media/games/6c2/6c20a6f7568a5d5e2b74d958ee83847c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1, "playing": 1}, "playtime": 1, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 436, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}