{"id": 724073, "slug": "empire-of-ember", "name": "Empire of Ember", "name_original": "Empire of Ember", "description": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀<strong>Join us on Discord!</strong><br/><br/>Empire of Ember is a <strong>first-person epic fantasy action-RPG with real-time strategy and management elements</strong>, set in the fantastical world of its spiritual predecessor Ember.<br/><br/>You'll play as a <strong>battlemage</strong> who inherits rulership of your city after your master was killed in an attack led by a mysterious cult. Now you will need to bring your town back to prosperity and avenge your mentor while investigating the strange events behind his murder. <br/><br/>Lead your troops in thrilling <strong>battles of up to a hundred units in fully destructible environments</strong>, explore a world of <strong>procedurally generated maps and dungeons</strong>, and <strong>build and customise your town</strong> with total freedom! <br/><br/><h3>KEY FEATURES</h3><br/><br/><h3>FIGHT</h3><br/><br/><ul><li><strong>Dual wield spells and weaponry</strong> in thrilling first-person battles. Duel enemies with melee weapons, blast them with magic staves, or headshot them at extreme distances with your bow.<br/></li><li><strong>Use the environment to crush,</strong> trip, impale or explode enemies.<br/></li><li>Unlock <strong>new spells from 3 schools</strong> of Lightbringer magic to wreak havoc on your enemies: throw boulders with telekinesis, project chain lightning, raise up fallen enemies and command the undead to fight on your behalf… <br/></li><li><strong>Dodge, block or interrupt </strong>your enemies' attacks, but fight strategically, or you may find yourself overwhelmed! </li></ul><br/><h3>COMMAND</h3><br/><br/><ul><li><strong>Lead your army</strong> in first person, in battles of up to<strong> a hundred units.</strong><br/></li><li>Tactics matter. <strong>Enter tactical mode and order your men</strong> to hold the line with a shield wall while archers rain death from above. Teleport behind enemy lines to wreak havoc.<br/></li><li><strong>Fully destructible cities:</strong> use catapults to break down defenses from afar, or blast through the walls and lead your troops through the breach.</li></ul><br/><h3>BUILD</h3><br/><br/><ul><li><strong>Design, decorate, and defend </strong>your own fully destructible 3D city. Strategically place spawn points to rain fire from high towers while your garrison of melee units defends the gates.<br/></li><li><strong>Integrated sharing: download, siege and destroy,</strong> and rate other players' cities!<br/></li><li><strong>Build facilities to produce resources</strong> that will make your city grow and prosper.</li></ul><br/><h3>RULE</h3><br/><br/><ul><li><strong>Conscript and train troops</strong> to accompany you in your adventures or stay in the city as its garrison.<br/></li><li><strong>Research </strong>new kinds of units to make your army stronger.<br/></li><li><strong>Hold court and pass judgment</strong> on daily events in the lives of your subjects.<br/></li><li><strong>Make decisions</strong> that can change the story and lead to different game endings. Features a story written by Patrick Kevin Day, a former lead writer from Telltale Games.</li></ul>", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2023-03-19T05:44:40", "background_image": "https://media.rawg.io/media/screenshots/0b1/0b1e504710f521a5200f8559234aa3b2.jpg", "website": "https://www.empireofember.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1, "dropped": 2}, "playtime": 5, "achievements_count": 30, "ratings_count": 4, "suggestions_count": 549, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Poleaxe Games"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Poleaxe Games"], "esrb_rating": null}