{"id": 724058, "slug": "zombie-war-2", "name": "Zombie War", "name_original": "Zombie War", "description": "**** Zombie War: The War That Begins Released!!! ****<br/>Please comment on any bugs, ideas, suggestions, encouragement, etc..(FPS TPS Shooting game)<br/>=============================<br/>- Strategic FPS TPS Shooting game to relieve stress<br/>- Even beginners can easily start the game at the training ground<br/>- Machine gun (M134), flamethrower, grenade, flash grenade added<br/>- Up to 2 remote allies (TCP/IP)<br/>    1. First, Go to Alience in the static IP server terminal and click [Listen].<br/>    2. Go to Alience from another client terminal and click [Connect] to connect to a static IP and wait.<br/>    3. Click [Start] in the static IP server terminal.<br/><br/>All features, including all weapons, are available!!!<br/>===========================<br/>In 2024, an unknown virus has passed,<br/>Only zombies are infested on the peninsula.<br/>We got the information that a trillion gold bars were left somewhere in Yeouido.<br/>With various clues left everywhere<br/>hope you find that place.\\nIf you go to a place where you can see the light, you will find the previous securement bases.<br/>Got guns and hospitals and convenience stores<br/>You can acquire weapons, heal, and recover health<br/>The helicopter can only go to the entrance due to electromagnetic interference..<br/>please!  I hope you find a trillion gold bars and come back alive...<br/>Good Luck!!!", "metacritic": null, "released": null, "tba": false, "updated": "2022-01-21T04:23:05", "background_image": "https://media.rawg.io/media/screenshots/1bd/1bd2e07106ab9d50b0e69d457c0f1b8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YongHo Joo"], "genres": ["Action", "Strategy"], "publishers": ["YongHo Joo"], "esrb_rating": null}