{"id": 724142, "slug": "football-destiny-2", "name": "Football Destiny 2", "name_original": "Football Destiny 2", "description": "******************<br/>FREE FULL GAME<br/>NO ADS<br/>******************<br/><br/>Manage your career as a professional football player and become a super star!<br/><br/>- - - - - - - - - - - - -<br/><br/>Football Destiny is back in a brand new edition with a lot of new features!<br/><br/>- 1200 clubs from 39 countries and 117 competitions<br/>- Interactions with clubs, journalists, coaches, your agent<br/>- Personal activities, morale, privacy<br/>- Management of your fitness level.<br/>- Collective spirit or individualism, prudence or risk-taking, your playing style determines your evolution and your reputation.<br/><br/>- - - - - - - - - - - - -<br/><br/>In Football Destiny 2, you start your career in a low-level club with no reputation and low-value attributes. But train hard and make the right decisions on and off the pitch and the doors to the big clubs will open for you.<br/><br/>Your ultimate goal: win all the big trophies with your clubs and your national team! Everything is possible for those who believe in their dreams!<br/><br/>- - - - - - - - - - - - -<br/><br/>ALL ASPECTS OF A FOOTBALL PLAYER'S LIFE<br/><br/>Training :<br/>Choose the right workshops to improve your 15 attributes (dribbling, shooting, heading, acceleration, etc.) and manage your physical condition.<br/><br/>Matches:<br/>Make the right decisions during matches (passing, partner selection, running, shooting) based on your position on the field and that of your teammates and opponents.<br/><br/>Media :<br/>What would football be without transfer rumours? Answer journalists, avoid media traps so as not to offend your coach.<br/><br/>Personal life:<br/>Take advantage of your free time to rest, or choose activities to boost your morale, meet people and have fun.<br/><br/>Transfers:<br/>Perform well in matches, get good grades and attract scouts. Get contract offers, negotiate your salary and bonuses.<br/><br/>National selection:<br/>Get a string of good games and catch the eye of your national team coach. With hard work and patience, he will give you your chance. But will you manage to earn your place in the starting line-up and compete in major competitions?<br/><br/>Money:<br/>Spend your money and treat yourself to the latest smartphone, a nice watch and why not a sports car or a boat.<br/><br/>- - - - - - - - - - - - -<br/><br/>A COMPLETE SIMULATION<br/><br/>117 competitions in 39 countries.<br/>1200 clubs.<br/>National and international competitions from 5 continents.<br/><br/>- - - - - - - - - - - - -<br/><br/>A REAL MANAGEMENT GAME<br/><br/>Develop your 15 attributes, technical, physical and mental:<br/>Dribbling, Finishing, Heading, Passing, Shooting from a distance, Acceleration, Vertical Relaxation, Stamina, Power, Speed, Concentration, Leadership, Placement, Composure, Vision of the game.<br/><br/>Master your different reputations:<br/>With your coach, teammates, fans, scouts, national coach.<br/><br/>Take care of your physical condition and your morale.<br/><br/>- - - - - - - - - - - - -<br/><br/>SO, READY TO BECOME A WORLD FOOTBALL LEGEND?", "metacritic": null, "released": "2021-10-26", "tba": false, "updated": "2022-01-21T05:16:58", "background_image": "https://media.rawg.io/media/screenshots/741/741a8e05f1df4045284ca05d0c955edc_EkZA9Yc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Julien Percot"], "genres": ["Simulation", "Sports"], "publishers": ["Julien Percot"], "esrb_rating": "Everyone 10+"}