{"id": 724115, "slug": "wild-friends-online-cards", "name": "WILD & Friends: Online Cards", "name_original": "WILD & Friends: Online Cards", "description": "WILD &amp; Friends is your card game favorite reimagined like you’ve never seen before! Whether you are playing online or offline, WILD &amp; Friends bundles together classic rules with an array of simple-to-play, vibrant features fun for all ages. Challenge players from around the world. Rise to the top of the leaderboard. Uncover delightful themes and build up your riches! In addition, as of October 2020, use your prize money to build your own luxury island! Go ahead! Sit back and get knocked off your feet in the tidal wave of WILD &amp; Friends fun. <br/><br/>Overview of Features:<br/><br/>Online Mode: <br/>- Play online multiplayer with thousands of users around the world!<br/>- Place your bets and earn big! The more opponents, the more you win!<br/>- Earn your place into more prestigious game rooms with higher bets! <br/><br/>Adventure mode<br/>- Discover various vibrant maps and themes!<br/>- Play in dozens of WILD &amp; Friends tournaments.<br/>- Play slow or play fast, these games have no time limit!<br/><br/>Paradise Island<br/>- Use your earnings and start building the vacation retreat of your dreams! <br/>- Transform your small boat, house, and pool into the yacht, mansion, and water park you have worked hard to deserve! <br/><br/>Leaderboard<br/>- Complete against players around the world in a 200-player leaderboard matched to your experience level.<br/>- Play hard, win hard: Triumph at the top and come away with amazing prizes! <br/><br/>Other features:<br/>- Intuitive, realistic game play and interface<br/>- Play your own music in the background.<br/>- All content unlocked. No need to complete a long tutorial or checklist to get a game started. <br/><br/>Just like the classic crazy eights game you play with friends and family, try to be the first to shed all your cards. When it’s your turn, play a card with either the same color or number as the last card played. Once a player has laid their last card, the match is over. <br/><br/>Here’ a few special playing cards to also look out for: <br/><br/>+2 Cards: Get the card war started and attack your opponent with 2 extra playing cards.<br/><br/>Skip: Place this one to make your opponent lose their turn. <br/><br/>Reverse: Change the direction of the game (from counterclockwise to clockwise or back again)! <br/><br/>Wild: These can be played at any time. Lay it down and pick a color. <br/><br/>Wild +4: Pick a color and pummel your foe with four extra playing cards<br/><br/>WILD &amp; Friends is guaranteed to become a favorite in your card game collection. Download the crazy 8 card game now!", "metacritic": null, "released": "2020-05-13", "tba": false, "updated": "2022-01-21T05:01:39", "background_image": "https://media.rawg.io/media/screenshots/f6c/f6ceedb3f7bf45446f67ae152add442e_06pIO1w.jpg", "website": "https://www.wildfriends.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobilaxy"], "genres": ["Casual", "Card"], "publishers": ["Mobilaxy"], "esrb_rating": "Teen"}