{"id": 724184, "slug": "pixel-pro-winter-sports", "name": "Pixel Pro Winter Sports", "name_original": "Pixel Pro Winter Sports", "description": "Pixel Pro Winter Sports is an incredibly addictive pixel-art makeover of your favourite wintertime sports.<br/><br/>Carve down the slopes in Downhill skiing, nip over to the Bobsled track for a hair-raising run, or aim for Olympic gold in the Slalom or Ski Jump.<br/><br/>Each sport has its own gameplay mechanics and challenges. All simple, but addicting.<br/><br/>Every discipline has a Single Event mode, for a quick fix of fun. Game Center is integrated, so you can challenge friends and attempt to break the world records.<br/><br/>But the best way to play, is in each sport's Career mode. Compete in 20 events around the globe, each with slightly different challenges. Place in the top 10 to earn prize money, then use it to upgrade your equipment - for longer Ski Jumps or quicker Skiing or Bobsled times.  Place high enough at the end of the season, and more events are unlocked. As you play, the World Championships and Olympiads will come around - medals are up for grabs if you can handle the pressure.<br/><br/>FEATURES:<br/>Downhill Skiing<br/>Bobsled (2-seat and 4-seat)<br/>Ski Jump (90m, 120m and Ski Flying)<br/>Slalom Skiing (Slalom and Giant Slalom)<br/>Easy and Pro modes<br/>Quick Play &amp; Career modes<br/>Special event medals (World Championships and Olympiads)<br/>20 unique locations<br/>Unlockable equipment<br/>Stats and records for all disciplines<br/>Game Center leaderboards and achievements", "metacritic": null, "released": "2021-12-10", "tba": false, "updated": "2022-01-21T05:38:34", "background_image": "https://media.rawg.io/media/screenshots/cfb/cfb204aad7d7c34b5ba7bbc5850cc3e7_D4u2ErY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixamo"], "genres": ["Sports", "Casual"], "publishers": ["Pixamo"], "esrb_rating": "Everyone 10+"}