{"id": 724135, "slug": "arcademy-live-claw-machines", "name": "Arcademy: Live claw machines", "name_original": "Arcademy: Live claw machines", "description": "Play Live Claw Machines.<br/><br/>Arcademy is not just another online game — it’s an app that allows you to control live claw machines and get gifts! <br/><br/>When was the last time you had the fun of playing a skill crane in your local arcade, movie theater, bowling alley, or mall? Do you remember the thrill of looking at all the adorable prizes and strategizing for your favorite one?<br/><br/>Now you can win them all directly from your phone! Take simple and easy control of the claw — all you need is a few taps, a little bit of skill, and victory is yours.<br/><br/>Yep! It's not just a game, it's an interactive experience where everyone can grab onto prizes. Depending on the day, you might get anything from plush toys to figurines, souvenirs, or hundreds of other things.<br/>Join our community of players from all over the world to play and get gifts in innovative remote control crane games.<br/><br/>Check out our many features and bonuses:<br/> - Welcome and Daily bonus for fun free games<br/> - We are constantly adding new prizes and games<br/> - Free shipping for VIP members<br/> - Top quality live video streaming without lags<br/> - You can choose the prizes you want to win<br/> - Want to play more? Exchange the prize you just won for a lot more coins!<br/><br/>So what are you waiting for?<br/>Download Arcademy right now and get welcome bonus coins for free games!", "metacritic": null, "released": "2020-12-02", "tba": false, "updated": "2022-01-21T05:13:19", "background_image": "https://media.rawg.io/media/screenshots/3f6/3f67d3f2dd6ccfd1b5bca6412a3fb1ad_y35uiNG.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["I.T.E PLATFORM"], "genres": ["Simulation"], "publishers": ["I.T.E PROGRAM PLATFORM"], "esrb_rating": "Everyone 10+"}