{"id": 724152, "slug": "water-sort-puzzle-sort-color", "name": "Water Sort Puzzle - Sort Color", "name_original": "Water Sort Puzzle - Sort Color", "description": "The great simple but addictive, fun, and challenging water sort puzzle games for you! It is the best water sorting puzzle game for you to train your brain, kill free time and relax! <br/><br/>If you'd like to train your combinational logic, this water sort puzzle game is just for you! It's the most relaxing and challenging puzzle game, and it's not timed.<br/><br/>Now try to pour the water in different colors and sort the water in the same color into the same bottles. <br/><br/>This water sort puzzle game is quite simple but very addictive and challenging. The difficulties of levels are increasing. The higher level you play, the more difficult it would be, and the more careful you would be for each move. This is the best way to train your critical thinking. <br/><br/>* How to Play<br/>- Tap a bottle first, then tap another bottle, and pour water from the first bottle to the second one.<br/>- You can pour when two bottles have the same water color on the top, and there's enough space for the second bottle to be poured. <br/>- Each bottle could only hold a certain amount of water. If it's full, no more could be poured.<br/>- No timer and you can always restart when you get stuck at any time.<br/>- No penalties. Take it easy and just relax!<br/><br/>* Features<br/>- Just Tap and Play, one finger to control<br/>- Easy and Hard Levels, all kinds for you<br/>- Play OFFLINE/without Internet. Feel free to play with no Internet connection<br/>- No time limit and penalties. You can always enjoy playing this water sort puzzle game at any time and place!<br/><br/>With this relaxing water sort puzzle game, you will never feel bored. While killing your free time, it's the best way to train your brain! Download and Play NOW!<br/><br/>Terms of Service: https://watersort.fungame.studio/termsofservice.html<br/>Privacy Policy: https://watersort.fungame.studio/policy.html", "metacritic": null, "released": "2021-12-27", "tba": false, "updated": "2022-01-21T05:22:11", "background_image": "https://media.rawg.io/media/screenshots/85e/85e97330b757126e5fc3ed3d7eee62f4.jpg", "website": "https://watersort.fungame.studio", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Guru Smart Holding"], "genres": ["Casual", "Puzzle"], "publishers": ["Guru Smart Holding"], "esrb_rating": "Everyone 10+"}