{"id": 724151, "slug": "love-boat-new-life-adventure", "name": "Love Boat - New Life Adventure", "name_original": "Love Boat - New Life Adventure", "description": "Love Boat - Sail to your Romance. <br/><br/>Welcome to Love Boat! Here you are the captain of your romantic adventures. Choose how you want to look, dress up nicely, get your hair done, and get ready to make decisions that will change the course of your life chapters. <br/><br/>Choose to play stories from our wide collection of Romance, Suspense, Fantasy, Sci-Fi, Psychological, and lots of Drama episodes. What are you in the mood for?<br/><br/>In Love Boat you can choose the story that matches your mood and make choices while playing it. You can make decisions as you play in order to develop relationships with your love interest, handsome guys and cute girls. Allow yourself to fall in love and have a variety of new experiences. What would you do in certain situations you had never experienced before? And what are the consequences of your choices? Play to find out!<br/><br/>Love Boat Features: <br/>Choose a story out of a rich collection of stories that are specially made to satisfy your taste. <br/>Choose your character with custom-made fashionable outfits, different hair styles and accessories.<br/>Decide who your soulmate or love interest is.<br/>Make new friends and defeat the enemies.<br/>Change your fate!<br/><br/>Live the most intense experiences, perhaps you will deal with love-hate relationships, or with a villain, or a hero that might fall in love with the wrong person!<br/>Get emotionally involved with your story!<br/><br/>New episodes every week! Stay tuned!<br/>A few notes: <br/><br/>\t•\tYour use of this application is governed by the terms of service available at https://msa-story.com/terms-msa-story-app.html <br/>\t•\tOur Privacy Policy is available at https://msa-story.com/privacy_policy_msa_story_app.html", "metacritic": null, "released": "2021-04-28", "tba": false, "updated": "2022-01-21T05:21:37", "background_image": "https://media.rawg.io/media/screenshots/1dc/1dc00caf06ebcb73858522dc2bc94f9c_o34zKhD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZVOID"], "genres": ["RPG", "Simulation"], "publishers": ["zvoid"], "esrb_rating": "Mature"}