{"id": 724124, "slug": "minetap-merge-rpg-clicker", "name": "Minetap – Merge rpg clicker", "name_original": "Minetap – Merge rpg clicker", "description": "We need your opinion in our social networks!<br/>Facebook: https://www.facebook.com/Minetap-101341071954634<br/>Inst: https://www.instagram.com/minetapmg/<br/>YouTube: https://www.youtube.com/channel/UCTONS2fz_0dZUYRjaMetrDg<br/><br/>MineTap is a clicker with merge mechanics and crafting, one of the best free games for all pixel game lovers! <br/>Start your epic mining adventure right now - click, tap &amp; rock! <br/><br/>MineTap is one of the best pixel-like RPG games. Create your character, start mining and treasure hunting! Craft your ultimate weapon and slay epic monsters! Have you ever had a dream to be a hero and save the world? Then tap to play and become a legend of crafting!<br/><br/>Merge the resources, build more complex materials on the workbench and in the forge, mine ore and create precious gems. Be the best among the heroes of tapping, titans of merging and legends of crafting! <br/><br/>Single player adventure is available offline, with no internet connection - idle away your boring time! Dig deeper, merge resources, craft &amp; pick up equipment, use special boosts to speed up the process - and soon all the wealth of the Earth will be yours! Let's write your name in the chronicle of heroes!<br/><br/><br/>In-game features: <br/><br/>Enjoy the recognizable graphics - especially for pixel lovers!  <br/>Dig out dozens of resources to combine and craft <br/>Collect treasure chests to collect more resources for mining<br/>Merge the same blocks to get epic materials<br/>Use powerful boosts to speed up the crafting process <br/>Craft equipment and armor - and ascend your hero to grow even stronger!<br/>Take more than 70 challenging quests <br/>Try your luck in the treasure mine - get your free reward daily<br/>Be №1 in this epic RPG game with clicker mechanics!<br/><br/>Dig deeper! Pick up all the valuable resources while mining &amp; clicking &amp; tapping!   <br/>Mine Tap is an awesome game for everyone, perfect idle clicker for short sessions. <br/>Are you bored? Spend hours and hours in this simple, yet incredibly fun pixel idle adventure! If you want to play one of the best clicker games ever you should try it now!", "metacritic": null, "released": "2021-12-10", "tba": false, "updated": "2022-01-21T05:07:10", "background_image": "https://media.rawg.io/media/screenshots/483/48365338d26fea1b3b66e9530ed96487.jpg", "website": "https://geeky.house", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Geeky House"], "genres": ["Casual", "Puzzle"], "publishers": ["GIKI KHAUS, OOO"], "esrb_rating": "Everyone 10+"}