{"id": 724165, "slug": "home-redecoration-makeover", "name": "Home Redecoration: Makeover", "name_original": "Home Redecoration: Makeover", "description": "How about trying a brand new Home Design&amp;Tile Match-3 game?<br/><br/>Home Redecor: Design Makeover is the revolution!<br/><br/>We perfectly mixed the Home design game and Tile Match-3 game into one. You will have such huge excitement and satisfaction in playing Tile. There are so many levels you can challenge. But relax! They are not as difficult as you think. With cute little tile cubes, you will be soaking in great leisure time. Meanwhile, you will become a home designer, fulfilling your wonderful designer dream. Design your own rooms in various styles. They could be modern, chic, or exotic, all on your own fingers! Let's make your rooms full of creation! <br/><br/>Potted plants, refrigerator, speaker, laundry machine, and lamp. These common things will become tiles. Matching the tiles, clearing the gameboard, and earning coins to unlock fabulous furniture. Mattress, couch, bed, bathtub, coffee table, etc. Put your sense and taste on your own decor plan, and make your home shine again!<br/><br/>FEATURE:<br/>M Make your own decision, start decorating your room!<br/>A  A leisure game should do what it is supposed to do. Easy to play!<br/>K  Create one room that anyone doesn't have!<br/>E  Exercise your brain and fingers!<br/>O Open the gate of creativity!<br/>V Various design elements, establish your own style!<br/>E  Erase your stress and unhappiness!<br/>R  Ready to play?!<br/><br/>We are not like regular \"room makeover\" games ever or in the future. The art graphics are so fine which will amaze your eyes and mind. Moreover, there is no right or wrong, good or bad on room design. Make your own choice. Wanna change style or a single piece of furniture? Just tap your finger to switch! Aesthetic fatigue already? Don't worry, just play a few Tile games, it's so fun and stress-reducing. With some gentle music in the game, you will soon immerse yourself in the room that was created by your talent. So relaxing isn't it? <br/><br/>Download Home Redecor: Design Makeover now and make your leisure time so much fun! <br/>Wanna create your own ever dreamed room and style? Play right now!", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2022-01-21T05:28:25", "background_image": "https://media.rawg.io/media/screenshots/b48/b4883e7fae9911b789770967269d6924_F6SZqNi.jpg", "website": "http://www.triwingames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TRIWIN"], "genres": ["Casual", "Puzzle"], "publishers": ["Triwin"], "esrb_rating": "Everyone 10+"}