{"id": 724133, "slug": "theater-tycoon-dream-producer", "name": "Theater Tycoon: Dream Producer", "name_original": "Theater Tycoon: Dream Producer", "description": "Gameplay<br/>- Full on movie production experience simulation on mobile with plenty of features and content.<br/>- Shoot movies to become box office legends.<br/>- Choose your lineups of actors for the movies based on the requirements of scripts and the current movie market to get high box office.<br/>- Show your movies in theater chains, collaborate with brands, accept invitations for talk shows etc. to further promote your movies.<br/>- Media score and audience review for your movies.<br/>- Take your actors around the globe to meet fans, assign them as city ambassadors and spokesperson.<br/>- Build up anticipation for the next movie to get higher box office. (This is to play other game features to add up the anticipation value)<br/>(Other theater sim games I found are all idle games. Our game has the unique shoot movie and calculates box office gameplay based on the actors you choose, how upgraded they are, their skills, how matched they are with the scripts (genre, tags), additional bonus from other business sim features etc.)<br/><br/><br/>250+ characters: (test version will have 150ish) <br/>- Scout actors from all over the world, and coach (upgrade) them to become top list stars.<br/>- Each character has different skills and talents for different types of scripts that they play. <br/>- Build relationships with other characters to get synergy effects. <br/>- Multiply types of scout agents to help you find and sign top list actors.<br/><br/><br/>900+ scripts:<br/>- 900+ unique scripts, all types of genres to choose from. <br/>- Collect scripts of the same theme to get collection rewards.<br/>- Have the screenwriters to further adapt high star scripts.<br/><br/><br/>Business running simulation on mobile:<br/>- Expand and upgrade your company building. <br/>- Business operations: stocks, take orders, produce merchandise, review business assignments, greet fans, hold meetings with sponsors for negotiations etc.<br/><br/><br/>Social features:<br/>- Daily award ceremony to compete for best actor/actress, best movie, best script, best performance and audience favorite awards with other players of the same rank.<br/>- Hall of fame (leaderboards). Let other players see you are on the top.<br/>- Conglomerate with other player’s companies. (This is like a guild feature)", "metacritic": null, "released": "2021-12-21", "tba": false, "updated": "2022-01-21T05:12:14", "background_image": "https://media.rawg.io/media/screenshots/d82/d82317360e64ef754dcbf1e7f052883a.jpg", "website": "https://spotlightstorygame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crazy Maple Studio"], "genres": ["RPG", "Simulation"], "publishers": ["Crazy Maple Studio"], "esrb_rating": "Everyone 10+"}