{"id": 724172, "slug": "art-story-color-art-puzzle", "name": "Art Story: Color Art Puzzle", "name_original": "Art Story: Color Art Puzzle", "description": "Let's dive into the world of classic novels in Art Story, a unique place where jigsaw meet coloring puzzle game for free. <br/><br/>Read bite-size book summaries, guess the silhouettes of puzzle art objects, and match the puzzle pieces into the right places to bring magnificent stories such as  Gatsby, Romeo &amp; Juliet, Frankenstein to life via relaxing &amp; calming coloring animations. <br/><br/>Explore hundreds of beautiful HD art puzzles by different talented artists from over the world. Each puzzle is a gorgeous multilayered hand-drawn picture to tell those novel stories. There are The Great Gatsby, Pride &amp; Prejudice, The Secret Garden, The Picture of Dorian Gray, Alice in Wonderland, The Wizard of Oz, Dracula, Macbeth, Jane Eyre, A Christmas Carol, and so many more novels. <br/><br/>Be careful, it looks easy, but interestingly challenging. Let's unfold those coloring stories daily in an immersive calming &amp; soothing experience. <br/><br/>**Enjoy Art Story: Color Art Puzzle game for free:** <br/><br/>- A picture art puzzle game that is a fusion of two popular genres - art coloring and jigsaw puzzle. Players would try to fit pieces into the right places and see those puzzle completion in a short soothing animation.<br/>- Creative writing to create bite-size classic literature novel summaries such as The Great Gatsby, Frankenstein while keeping the spirit of the book.<br/>- Players play this relaxing game, collect Ink Drops coins to unlock stories (Over 400 puzzles at the moment, 25 books in progress) for their art library.<br/>- Fascinating hand-drawn artworks from different artists, each with their own original &amp; unique style. Hand-pick background music for each puzzle to match its mood.<br/><br/>Enchanting art visual, wonderful hand-pick background music, relaxing but challenging jigsaw coloring gameplay, why don't you relieve your stress and enliven your life daily with this soothing free art puzzle coloring game?<br/><br/><br/><br/>*****<br/>Information about the auto-renewal of subscription:<br/><br/>This is an auto-renewable subscription. A subscription is valid for 1 week, or 1 month, depending on the subscription type selected.<br/><br/>- Payment will be changed to the user's iTunes Account upon confirmation of purchase.<br/>- The subscription will automatically renew every week unless auto-renew is turned off at least 24 hours before the end of the current payment period. If auto-renew remains active during that time, the user's account will be charged.<br/>- Subscription can be managed by the user; auto-renewal can be turned off in the user's iTunes Account Settings after purchase.<br/>- Account will be charged for renewal within 24 hours prior to the end of the current period. The cost depends on the selected plan.<br/><br/>For more information, please refer to our Terms of Use and Privacy Policy.<br/><br/>Privacy Policy: [https://artstory.helpdocsonline.com/privacy](https://artstory.helpdocsonline.com/privacy)<br/><br/>Terms of Use: [https://artstory.helpdocsonline.com/terms](https://artstory.helpdocsonline.com/terms)", "metacritic": null, "released": "2021-11-13", "tba": false, "updated": "2022-01-21T05:32:02", "background_image": "https://media.rawg.io/media/screenshots/df4/df477c54ed0ef78579474e0fb0dc4637.jpg", "website": "https://help.yomi.studio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yomi Studio"], "genres": ["Board Games", "Puzzle"], "publishers": ["YOMI STUDIO COMPANY"], "esrb_rating": "Everyone 10+"}