{"id": 724169, "slug": "heroes-of-mythic-might", "name": "Heroes of Mythic Might", "name_original": "Heroes of Mythic Might", "description": "Heroes of Mythic Might will transport you into a fantasy world based on Eastern myths and legends.\t<br/> <br/>In the game,the player is a seeker of immortality who encounters mysterious heroes, collects an entourage of travel companions, and forges divine weapons to tame spirits and cast down demons. There is a rich storyline throughout, and you must overcome many challenges to explore its depths.\t\t<br/>The spirit flows through all!\t\t<br/><br/>Game Features\t\t<br/><br/>Gorgeous chivalrous Style  Immersive Experience<br/>The entire game world is rendered in lavish Chinese-style aesthetic, so that you can completely lose yourself in the backgrounds and characters. Everything from the full-length portraits, animated models, and UI design -- every inch of the game is teeming with authentic Chinese artistry. All of the beauty evoked in ancient Chinese poetry comes to life in this mystical fantasy world!\t\t<br/><br/>No Tedious Tapping  Set &amp; Forget Combat<br/>Set up your hero squad, send them to battle, and watch your heroes fight automatically for you!\t\t<br/>Enjoy relaxing battles while you win Epic Gear and Legendary Heroes!\t\t<br/>Even while you're offline, you'll rack up fabulous rewards!\t\t<br/><br/>Cool Skins  Distinct Stats<br/>Exquisite wings, shimmering light effects -- give your heroes all kinds of new looks and create a customized feast for the eyes! Each one has a unique look, and unlocking skins will also unlock jaw-dropping skill effects and stats. Dazzle the battlefield with these incredible attack effects that you'll never tire of looking at!\t\t<br/><br/>A Multitude of Possibilities  Strategize to Win<br/>Over one hundred heroes, six stats that mutually counter each other, and five major classes with their own specialties. There's also 9 Talents with different effects to mix and match as you please. There is no one single OP lineup. As long as you can cleverly construct your lineups, you can crush the competition with your cunning!\t\t<br/><br/>A Variety of PVP  Challenge Yourself<br/>No matter when or where, you can enjoy fun PVP combat. Will you climb the heights of Empyrean Tower, or scale Summit Contest, or advance into the Worldwide Top 32 in Sky Arena? Unite with your friends, defeat opponents, and prove yourself! You can also team up with Sect members and fight in Sect War. Round up your friends for battle now!\t<br/><br/>PLEASE NOTE! Heroes of Mythic Might is free to download and play, however, some game items can also be purchased for real money. If you do not want to use this feature, please set up password protection for purchases in the settings of your App Store. Also, under our Terms of Service and Privacy Policy, you must be at least 12 years of age to play or download.<br/><br/>Email: support@onefun.ink", "metacritic": null, "released": "2022-01-11", "tba": false, "updated": "2022-01-21T05:30:26", "background_image": "https://media.rawg.io/media/screenshots/206/206a169b7b40de0c01f22afc26112041_9ORpw8u.jpg", "website": "http://www.onefun.ink/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanghai Onefun Co"], "genres": ["RPG", "Card"], "publishers": ["Shanghai Onefun Co"], "esrb_rating": "Teen"}