{"id": 724189, "slug": "buildnow-gg-building-shooter", "name": "BuildNow GG - Building Shooter", "name_original": "BuildNow GG - Building Shooter", "description": "BuildNow GG is an online build-and-shoot game featuring various game modes, weapons, and maps. Build and hone your skills in offline training mode.<br/><br/>BuildNow GG is part of an emerging genre of online game that combines tactical building with third-person shooter gameplay.<br/><br/>Build, shoot, and party<br/><br/>In the game, you build ramps, rooves, and walls as quickly as possible while taking on another opponent. For new players, aim training is an excellent way to learn the basic controls. The game is online, but you can also start a private match with your friends in party mode. You can host up to 6-12 players in a private game.<br/><br/>Master your weapons<br/><br/>The weapons cover the standard loadout you’d expect in a shooting title, and you can switch between them while you battle. The loadout features a pistol, assault rifle, sniper rifle, shotgun, and a pickaxe.<br/><br/>Customize your profile<br/><br/>BuildNow GG features extensive customization options. You can customize the visual quality, FPS limit, HDR and more in the graphics settings. The options also include full HUD customization so you can create the ideal profile for shooting and building.<br/><br/>Game modes<br/><br/>BuildNow GG features game modes located on different maps. These are:<br/>-Freebuild - a sandbox-style map where you can play PvP and practice without limits<br/>-V-Arena - 1v1 battle or 6 players FFA, last man standing wins<br/>-Realistic 1v1 - 1v1 battle with fall damage and limited resources<br/>-BoxFight - 1v1 Boxfight or 4 player FFA, last man standing wins<br/>-BoxFight Zone Wars - 6 player FFA in a zone<br/>-Aim Training - improve your aim on static and moving targets offline<br/>-Late Game Zone Wars - 6 player FFA in a random zone with limited building resources<br/><br/>Features:<br/>-Build and battle your way to the top<br/>-Play privately with a party of up to 6-12 players<br/>-Fully customizable performance and HUD profile<br/>-Practice your building and shooting skills offline", "metacritic": null, "released": "2021-10-28", "tba": false, "updated": "2022-01-21T05:41:07", "background_image": "https://media.rawg.io/media/screenshots/1a7/1a78b841a0591b2049ea35283a0614f6_ZiugIXN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bohdan Chumachenko"], "genres": ["Action", "Simulation"], "publishers": ["Bohdan Chumachenko"], "esrb_rating": "Teen"}