{"id": 724141, "slug": "dreamdale-fairy-adventure", "name": "Dreamdale - Fairy Adventure", "name_original": "Dreamdale - Fairy Adventure", "description": "Dreamdale – Enter a world of fairy tales<br/><br/><br/>► ONCE UPON A TIME…<br/><br/>Set off on a fairy tale adventure as a humble woodsman and build a whole wide world of wonder in this magical game. Dig, mine, build, farm, craft and fight in this entertaining and original RPG with time management elements that’s guaranteed to provide hours of absorbing fantasy action. Bring your fairytale dreams to life in the beautiful world of Dreamdale.<br/><br/>► ALL THE INGREDIENTS OF GREAT ADVENTURE<br/><br/>• A resourceful hero – starting out with nothing but an empty backpack and your trusty axe, get chopping and mining, and gather up resources to construct new buildings or exchange for coins and diamonds at the market. Spend coins on upgrading your equipment and buildings, or on expanding the map to find ever more varied resources.<br/><br/>• The right tools – each resource requires a different tool for mining, and each tool can be upgraded to get more resources faster. Progress through the game to find pickaxes, shovels, fishing rods, and a whole lot more, including unique gold tools that make you the fastest digger, miner, farmer or fisher ever.<br/><br/>• A few good friends – soon you’ll be joined by other villagers who help you expand your world, tending your farm, catching your fish, crafting your tools, and mining your resources. In no time, you’ll be in charge of your own little empire of commerce, rushing across the map to craft, collect, upgrade and expand.<br/><br/>• A place for everything – build storage for all the different resources you collect, and upgrade the buildings along with your backpack to make trade move faster and bring in ever more coin.<br/><br/>• Steady progress – complete quests to gain XP, level up and get a huge variety of rewards to help you progress through the game, including a wide range of different player attributes that give advantages in different aspects of the game.<br/><br/>• A little luck – get more rewards and extra coins from chests that pop up randomly on the map, or dig for treasure where X marks the spot.<br/><br/>• A hint of mystery – find a boat and sail to five different mystery islands where you’ll find unique, unusual, and especially valuable resources.<br/><br/>• A splash of danger – what RPG would be complete without a little action? If you dare, explore eight different caves, battle with enemies and reach a showdown with monster bosses to win spectacular loot, and head back to your village a true hero.<br/><br/>• And just a little touch of magic – this is a fairy tale, don’t forget, so among all the industry, commerce and action, don’t be surprised to find saddle-broken pigs, magic trees that never stop growing, and a whole host of other miraculous elements to keep your sense of wonder alive in this fantasy RPG.<br/><br/>► LIVE HAPPILY EVER AFTER<br/><br/>Ever dreamed of being a farmer and a fighter, a digger and a chopper, a merchant and a miner, a fisherman and an adventurer, a pig-herd and a true fairytale hero? Make all your dreams come true in the idyllic and hugely entertaining world of Dreamdale. Download the game now and set out on a real adventure.", "metacritic": null, "released": "2021-12-30", "tba": false, "updated": "2024-02-15T17:52:24", "background_image": "https://media.rawg.io/media/screenshots/fd2/fd292d0e4c6663317d7853574fb49951_cUnVjw0.jpg", "website": "https://say.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["Simulation", "Casual"], "publishers": ["SayGames"], "esrb_rating": "Teen"}