{"id": 724222, "slug": "legendary-tales-1-ce", "name": "Legendary Tales 1 CE", "name_original": "Legendary Tales 1 CE", "description": "Explore a fascinating world to save a werewolf's life and bring justice to the land ruled by cruel witches.<br/><br/>“Legendary Tales: Stolen Life” is an adventure game in the genre of Hidden Objects, with plenty of mini-games and puzzles, unforgettable characters and complicated quests. <br/><br/>After the disappearance of their parents and the death of their guardian, Lucia and her brother Ulf lived and worked in a tavern. But their lives changed dramatically when Ulf turned 18. He turned out to be a werewolf, and that very night he was abducted by a witch and taken to an undisclosed location. Lucia is willing to risk everything for the sake of saving her brother, who always took care of her. She knows for sure that he would have done the same for her. For the first time in many years of her life, that she spent in alienation from the outside world, adventures await her in stranger places full of unpredictable dangers. You are to solve many puzzles, find new allies and enemies, and also look for unpredictable solutions to return Ulf.<br/><br/>Find your way in the complicated magical world controlled by witches.<br/>Explore the secrets of everything that comes across your path to discover family mysteries!<br/>Solve dozens of puzzles and test yourself in exciting mini-games!<br/>Immerse yourself in the atmosphere of ominous magic and unpredictable decisions!<br/>Start an adventure with incredible magical creatures, druids, witches, and werewolves!<br/><br/>The game is optimized for tablets and phones!<br/><br/>+++ Get more games created by FIVE-BN GAMES! +++<br/>WWW: http://fivebngames.com/<br/>FACEBOOK: https://www.facebook.com/fivebn/<br/>TWITTER: https://twitter.com/fivebngames<br/>YOUTUBE: https://youtube.com/fivebn<br/>PINTEREST: https://pinterest.com/five_bn/<br/>INSTAGRAM: https://www.instagram.com/five_bn/", "metacritic": null, "released": "2021-11-06", "tba": false, "updated": "2022-01-21T05:58:41", "background_image": "https://media.rawg.io/media/screenshots/ca4/ca4f3935322ed8acf3a8f1832caf32c4.jpg", "website": "https://fivebngames.com/game/legendary-tales-stolen-life", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FIVE-BN STUDIO"], "genres": ["Adventure", "Puzzle"], "publishers": ["FIVE-BN STUDIO"], "esrb_rating": "Everyone 10+"}