{"id": 724227, "slug": "stutor", "name": "STutor", "name_original": "STutor", "description": "STutor (for SUDOKU TUTOR) is a no-nonsense sudoku solving APP that can display three level of hints while you are solving a puzzle.  There are no AD's; no \"in-APP-purchases\".  Just a program to help you advance your Sudoku solving skills.<br/><br/>STUTOR solves puzzles using 5 strategies following a logical sequence of methods. The sequence and methods are described in five (5) HELP screens.  <br/><br/>STUTOR is most appreciated when it displays clues for solving those pesky Friday/Saturday more advanced puzzles.  No more disappointing unsolved puzzles.<br/><br/>Puzzles are entered manually in a Sudoku grid or by entering (or pasting) an 81 character string.  Puzzles can be saved, recalled, changed, deleted, and reordered in the Archive.<br/><br/>Upon pressing any of the bottom buttons (except clr), STUTOR will validate and solve the puzzle.  Any subsequent user entries will be compared with the solution.  A valid entry is entered into the puzzle.  If the entry does not correspond to the solution, all the \"possibles\" or minis are displayed for that cell.  If minis are already displayed, the entered number is removed from the minis.<br/><br/>Swiping more that two cells in a row will display minis in the row.  Ditto for a column or a group.  Swiping through more than two rows, columns or groups will display all minis.<br/><br/>The \"hint\" button toggles between a text only hint and one that also displays a clue on the puzzle. The STEP button displays all hint details and alters the puzzle accordingly.", "metacritic": null, "released": "2013-10-01", "tba": false, "updated": "2022-01-21T06:01:21", "background_image": "https://media.rawg.io/media/screenshots/efd/efd9a1443c69c0984b099f42be6d1eaf_s5wDp2S.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Robert Carlson"], "genres": ["Educational", "Puzzle"], "publishers": ["Robert Carlson"], "esrb_rating": "Everyone 10+"}