{"id": 724271, "slug": "pixel-pottery", "name": "Pixel Pottery", "name_original": "Pixel Pottery", "description": "Welcome to Pixel Pottery!\r\n<p>As a craftsperson myself, I always enjoy games that feature crafting. With Pixel Pottery I want to push the idea of crafting inside a game environment further by exploring the possibility of free form crafting mechanics that allow the player to express themselves and exercise comple creative freedom within the scope of the game.  The second part to this is that the object created then needs to be assigned value in order for it to have value and/or a function within the game.<br/><br/>In order to achieve this I have integrated deep learning image classification into the game, so that the customers can recognize what you have made (classifying it either as a cup, a bowl, or a decorative piece) and also evaluate it's symmetry to determine whether it matches their taste or not.   Each of the five customers have had their neural net trained on different data, and have different prefferences in symmetry creating the potential for a variety of interpretations of what you have made.</p>\n\r\nHow to play:\r\n<ul><li>Use the slider to select how much clay you want to work with, then click Begin.</li><li>Drag the red handle of the lever on the wheel to adjust the speed that it turns.</li><li>Drag the tools with the left mouse button.</li><li>Rotate the tools with the right mouse button.</li><li>Drag all tools at once with the middle mouse button.</li><li>Use the tools to shape the clay as it turns on the wheel - you can only shape it while the wheel is moving.</li></ul>\n<p>At the end of the game you are awarded a star for each customer who is perfectly happy with what you have made, and half a star for each customer who can see the effort you put in, but doesn't quite like the piece.</p>", "metacritic": null, "released": "2022-01-21", "tba": false, "updated": "2022-01-21T06:15:21", "background_image": "https://media.rawg.io/media/screenshots/c0a/c0a439386ec8401de7958b57214a1d51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OwenBrush"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}