{"id": 724209, "slug": "ragdoll-ninja-imposter-hero", "name": "Ragdoll Ninja: Imposter Hero", "name_original": "Ragdoll Ninja: Imposter Hero", "description": "Imagine a ninja game with ragdoll physics and fast-paced action. Well, this ragdoll simulator is just that. It’s everything you love about ninja and ragdoll games combined! Focusing on what makes ragdoll games special, Ragdoll Ninja is here to wow you with funny physics, engaging gameplay, and tons of epic fights and challenges. <br/><br/>The story is simple: you are a ragdoll imposter on a mission to infiltrate and kill crowds of evil stickmen. But the challenge is harder than it looks, as you can only control your stickman ragdoll buddy one limb at a time. Being a stealthy ninja assassin and all the while moving like a ragdoll isn't easy, but a skilled ninja hero like you can get the job done. <br/><br/>Your opponents are just like you: ragdoll stickmen with limbs flopping in different directions. But your imposter skills and ninja tactics give you an edge. Swing your ninja buddy toward the enemies and let your hero kick butt. The ragdoll stickmen got tangled in their limbs, didn’t they? That's too bad for them! Use the momentum to kill them with one swing of a weapon or your signature kick! <br/><br/>But it’s all fun and games until you meet the stickman ragdoll king. Try out an arsenal of tricks to kill the ragdoll stickman boss. <br/>So, are you ready to challenge your fighting skills? Jump onto the battle playground and swing your weapon at the stickmen to save the day like a true ninja hero!<br/><br/>BEST FEATURES:<br/><br/>Never-ending fights on an open playground! <br/>Intuitive single-touch controls<br/>Endless levels and challenges<br/>Gripping ragdoll fighter combined with unpredictable physics<br/>Countless weapons and fighting props<br/><br/>You'll never get bored in this ragdoll ninja game! This exciting ragdoll simulator will blow you away with all the ninja fighting and ragdoll action. Download Ragdoll Ninja now to become the best ragdoll fighter out there!", "metacritic": null, "released": "2021-12-29", "tba": false, "updated": "2022-01-21T05:51:08", "background_image": "https://media.rawg.io/media/screenshots/f13/f13ef83ec4233090fd10c1f638dd9258.jpg", "website": "https://tap2play.me/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tap2Play"], "genres": ["Action", "Casual"], "publishers": ["Tap2Play"], "esrb_rating": "Everyone 10+"}