{"id": 724319, "slug": "uspavanka-demo", "name": "Uspavanka Demo", "name_original": "Uspavanka Demo", "description": "<p>Nightmares - all children see them sometimes. But what if in provincial Russia there are kids so harsh they can defeat the vile creatures from dreams?</p>\n<p>Three simple Slavic kids - Boris, Dora and Joseph - turned out to be daredevils. Why them of all? It’s unclear, because in real life they have only three things in common. These children were born in the region of the Kursk magnetic anomaly, always obeyed their parents and they did not eat pork.<br/><br/><br/></p>\r\nIn this card roguelike you can do the same as in every other:\r\n<p>1) <strong>Play as one of three characters</strong> with different characteristics:</p>\n<ul><li><strong>Boris the Brave</strong>. The boy's greatest dream is following his father’s example and become a boxer, but for now, monsters of his dreams are the only defeated opponents;<br/>\n</li><li><strong>Dora the Adventurer</strong>. Dora likes to talk, repeating the same phrases. She wants to become a traveler. In the meantime, she finds adventures only in her head;<br/>\n</li><li><strong>Calm Joseph</strong>. He enjoys playing the ukulele and being smart, but no one cares. Joseph plans to distribute political propaganda in order to putting garbage in people’s heads, but the only current listeners are the corpses of the murdered enemies in dreams.\r\n</li></ul>\n<p>2) <strong>Equip your hero with useful</strong> (and not so) <strong>items</strong>, among which are such legendary items as the Socks of Death and Mittens of Aggression;<br/>3) <strong>Collect a deck of cards</strong> to strengthen the child, to make enemies whine instead of him/her;<br/>4) <strong>Defeating monsters</strong> (there will be many, many monsters) including such dangerous ones as the Beer-drinking elk and the Smoker shark;<br/>5) <strong>Make important game decisions</strong> - do something or do nothing.<br/><br/><br/></p>\r\nAlso you can find something that, perhaps, is not present in other roguelikes:\r\n<p>1) <strong>Manga series that change the character's mechanics</strong> (not always for the better), for the great sin of humanity - calling them comics;<br/>2) Quirky-looking <strong>hand-drawn graphics</strong>. Just whenever, whenever;<br/>3) <strong>Leveling the hero’s characteristics</strong> that affect the strength of the cards;<br/>4) <strong>Jokes</strong> (at least attempt at jokes);<br/><br/><br/></p>\r\nThe best way to support game development is add it to Wishlist in Steam.", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-21T06:26:45", "background_image": "https://media.rawg.io/media/screenshots/544/5441f4c7c0133d666fc6f0eabfeb5421.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Dog's Dream"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}