{"id": 724370, "slug": "a-heart-of-gold-charas-project", "name": "A Heart of Gold (Charas Project)", "name_original": "A Heart of Gold (Charas Project)", "description": "<p>\"Hackett an' I are heading West to a place where I've been told ah might be able to learn to control my magic.\"<br/>- Annie, bar owner &amp; magician</p>\n\n<p>The Charas Community brings you another chain game, over two years in the making! Charas proudly presents A Heart of Gold, a gun toting cowboy filled rpg!<br/>Jimmy is a young lad with grand dreams as he left home on a journey to become a successful miner. But not all is right in the land, lately cowboys who perish in the harsh desert returns to a state of unlife. The dead seems to be drawn to people who wield the power of magic. Jimmy and his new friends journey west to find a way to protect their magic wielding companion.</p>\n\n<p><strong>What is a chain game? </strong>Remember when you were a kid and played that game when you would fold a piece of paper, draw the start of a creature, and then fold it again and your friend would draw the next part? Then you'd do it back and forth a couple of time when finally you unfold it and look at your creation. <br/>A chain game is basically that: one person starts making a part of the game and when they feel it's reached a good point they sends it off to the next developer on the list. The end result might not always be the most polished game out there but it's an interesting journey where each part of the game bears the unique mark of it's developer.</p>\n\n<p><strong>Credits <br/></strong>Chapter 1: Moosetroop11<br/>Chapter 2: Momeka<br/>Chapter 3: Fisherson<br/>Chapter 4: Prpl_Mage<br/>Chapter 5: Moosetroop11</p>\n\n<p><strong>[Join the fun]</strong><br/></p>", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-21T06:39:02", "background_image": "https://media.rawg.io/media/screenshots/fde/fde0515a2bdad2e59490a9c9b2b7331f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Charas Project"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}