{"id": 72442, "slug": "coup", "name": "Coup", "name_original": "Coup", "description": "Coup, the popular game of deception and manipulation for iPhone and iPad. Play with friends and opponents from around the world!<br/><br/>- Online multiplayer gameplay or Practice against AI opponents.<br/>- Bluff, steal, and manipulate your opponents on the go.<br/>- All new art featuring 5 gorgeous new animated cards.<br/>- Card packs including Coup: Resistance versions, and many more!<br/>- Play games with up to 4 players, worldwide.<br/>- Invite your friends or play ranked matches with random opponents.<br/>- Increase your rank by earning achievements and badges... and winning!<br/>- Greet, taunt, and negotiate with your opponents with a custom chat system.<br/>- A faithful adaptation of one of the best board games.<br/><br/>- Play with your friends -<br/><br/>You can create private games with your friends anytime, each match supports up to 4 players.  You can add friends to your friend list by inviting them directly, importing from your contacts, using Facebook, Game Center, or by adding favorite players you've met in any of the ranked matches.<br/><br/>- Ranked Matches -<br/><br/>Think you've got what it takes to take on the best Coup players?  We've created multiple ranked rooms to match you with opponents all over the world.  Wager a small amount of your reputation in rooms with newbies, or risk more and play against the best.<br/><br/>- Achievements and Badges -<br/><br/>Complete over 50 achievements to increase your rank and unlock new badges to display on your player profile. More achievements &amp; badges will be added for future updates.<br/><br/>Thanks for playing Coup!", "metacritic": null, "released": "2015-04-23", "tba": false, "updated": "2019-10-22T14:25:20", "background_image": "https://media.rawg.io/media/screenshots/713/713004fb1d2109d45caf033075818869.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Banana & Co.", "Fox City Games"], "genres": ["Board Games", "Card"], "publishers": ["Banana & Co"], "esrb_rating": null}