{"id": 724406, "slug": "dumpster-dating-een-ome-wasbeer-dating-sim", "name": "Dumpster Dating: een Ome Wasbeer Dating Sim", "name_original": "Dumpster Dating: een Ome Wasbeer Dating Sim", "description": "<p><strong>Welkom bij Dumpster Dating: een Ome Wasbeer Dating Sim! </strong></p>\n<p>Je bent net naar Racc City verhuisd en ontmoet daar niemand minder dan Ome Wasbeer! Wat zal er allemaal gaan gebeuren? Speel de game om erachter te komen!</p>\n<p><strong> Deze game bevat: </strong></p>\n<p>- 5 verschillende dates <br/>- 13 verschillende eindes <br/>- Sprites getekend door Moederwasbeer <br/>- Dialoog geschreven door Crazyratchick <br/>- Stemmen ingesproken door WerkelijkJesse en Neillb <br/>- GUI gemaakt door Weslyv8</p>\n<p>Deze Dating Sim is gemaakt door Moederwasbeer en Crazyratchick, met nog wat hulp van Weslyv8, WerkelijkJesse en Neillb. De mensen uit de Moederwasbeer discord weten waarschijnlijk al wie Ome Wasbeer is, maar voor degene die het nog niet weten leggen we het hier even uit.</p>\n<p> Ome Wasbeer is een discord bot (gemaakt door Sheepolution) uit de server van Moederwasbeer. Zijn taken bedragen het uitdelen van wasbeerkaartjes, het managen van Dungeons &amp; Wasberen en nog wat andere kleine taakjes. We merkten dat mensen Ome Wasbeer vaak aanspraken en hem een beetje als een persoon op zich zijn gaan zien. Omdat mensen vooral boos werden op Ome Wasbeer als ze bijvoorbeeld verloren in Dungeons &amp; Wasberen, leek het ons juist grappig om een dating sim te ontwikkelen voor hem. Het begon een beetje als een gein project, maar is uitgegroeid tot een echte game. We hebben er intens veel plezier aan gehad dit te maken (en soms ook afgezien) en we hopen dat jullie er ook van gaan genieten!</p>\n<p><em>Oh ja, vergeet niet moederwasbeer te volgen op: </em><br/>www.twitch.tv/moederwasbeer <br/></p>\n<p>https://twitter.com/mamawasbeer</p>\n<p>https://www.instagram.com/moeder.wasbeer</p>\n<p><em>Crazyratchick is te vinden op: </em><br/>https://twitter.com/crazyratchick</p>\n<p>https://www.instagram.com/drawingguynova</p>", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-21T06:46:56", "background_image": "https://media.rawg.io/media/screenshots/b0e/b0e6f1b64be7bbd4d9dab1c1ceac2b48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Racc & Rat"], "genres": [], "publishers": [], "esrb_rating": null}