{"id": 7245, "slug": "slideshot", "name": "Slideshot", "name_original": "Slideshot", "description": "Inspired by the likes of Rush Hour and other sliding and pipe connecting puzzle games, Slideshot takes the traffic around the next bend: Move various tiles into a position that allows you to shoot a puck from one end of the game area to the other without missing any of the present pieces. It&amp;#39;s easy to grasp – so join in the fun and exercise your brain!<br/><br/>Guest Mode: (Settings - Guest On)<br/>Let your friends have a go at Slideshot without disturbing your own level progress. (Guest Mode always automatically starts with level 1.)<br/><br/>Classic Mode: (Settings - Classic On)<br/>Activate the classic look for the original Slideshot experience. (Classic Mode is also a little easier on your battery.)<br/><br/>Direct access to all levels: (Settings - All Access On)<br/>Choose from any difficulty level you want.<br/><br/>Also available:<br/>- Slideshot 3XTREME: up to 1000 levels and Game Center support<br/>- Slideshot 2: 60 levels (10 entry levels like Slideshot 1)<br/>- Slideshot XL: 108 levels on the iPad<br/>- Slideshot XL Lite: 18 entry levels on the iPad<br/><br/><br/>Inspiriert von Rush Hour und anderen Schiebe- und Leitungslege-Puzzlespielen, bietet Slideshot einen ganz neuen, total verrückten Kurvenraum:  Schiebe verschiedene Kacheln in eine Position, die es Dir erlaubt, einen Puk vom einen Ende des Spielfeldes zum anderen zu schießen, ohne dabei auch nur eines der vorhandenen Teile auszulassen. Es ist ganz einfach zu lernen – also gönn&amp;#39; Dir den Spaß und trainier&amp;#39; Dein Gehirn!<br/><br/>Gast-Modus: (Einstellungen - Gast an)<br/>Lass Deine Freunde eine Runde Slideshot genießen, ohne Deinen eigenen Spielstand zu verlieren. (Der Gast-Modus beginnt automatisch immer mit Level 1.)<br/><br/>Classic-Modus: (Einstellungen - Classic an)<br/>Aktiviere das klassische Design für das ursprüngliche Slideshot-Erlebnis. (Der Classic-Modus verbraucht auch etwas weniger Akkuleistung.)<br/><br/>direkter Zugriff auf alle Level: (Einstellungen - Direktzugriff an)<br/>Wähle direkt einen Level aus jeder beliebigen Schwierigkeitsstufe aus.<br/><br/>ebenfalls erhältlich:<br/>- Slideshot 3XTREME: bis zu 1000 Level und Game Center<br/>- Slideshot 2: 60 Level (10 Einstiegslevel wie Slideshot 1)<br/>- Slideshot XL: 108 Level auf dem iPad<br/>- Slideshot XL Lite: 18 Einstiegslevel auf dem iPad", "metacritic": null, "released": "2009-05-08", "tba": false, "updated": "2019-10-22T13:55:15", "background_image": "https://media.rawg.io/media/screenshots/c44/c446e4d82b6827c8a6c3b075b1996781.jpeg", "website": "http://www.slideshot.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mschomerus"], "genres": ["Strategy", "Puzzle"], "publishers": ["Marc Schomerus"], "esrb_rating": "Everyone 10+"}