{"id": 724562, "slug": "genesis-itch-r0gue96", "name": "Genesis (itch) (r0gue96)", "name_original": "Genesis (itch) (r0gue96)", "description": "<p>Welcome to the world of Alinon. In this world there were<br/></p>\n<p>many races. However in the year 1403 the humans had   </p>\n<p>driven most races into hiding or extinction.  </p>\n<p>The kingdom of Alexandria is the Highest form of  </p>\n<p>government in the world deciding the laws and in charge  </p>\n<p>of deploying guards to towns and villages. Alexandria  </p>\n<p>is ruled by the new king Cyrus said to be the strongest  </p>\n<p>man in the world. His king's guard is among the most  </p>\n<p>skilled in the world. Since the start of his rule king  </p>\n<p>Cyrus has ended the witch hunts, which has done nothing  </p>\n<p>to stop the people's resentment in most nations.  </p>\n<p>Four years ago mysterious dungeons opened up in Alinon  </p>\n<p>exposing the world to this new substance \"Mana\" and  </p>\n<p>releasing monsters of varying sizes and magics. After the  </p>\n<p>dungeons opened everyone and everything was exposed to the  </p>\n<p>mana released. However some living things reacted  </p>\n<p>differently than others. They were deemed mages, because   </p>\n<p>unlike everything else exposed they produced more mana.  </p>\n<p>No one is sure what is at the end of these dungeons. But\r\n </p>\n<p>rumors of an event called the Genesis will appear.\r\n </p>\n\n<p>Please check out my patreon for up to date Information on my progress.</p>\n<p>Patreon.com/R0gue96</p>", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-21T07:22:38", "background_image": "https://media.rawg.io/media/screenshots/b11/b11d40ed90a7556780014f556ec6e7a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["r0gue96"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}