{"id": 724601, "slug": "card-game-prototype-the-wizard", "name": "Card Game Prototype (The Wizard)", "name_original": "Card Game Prototype (The Wizard)", "description": "<p>A quick prototype of a card game based on the concept of you controlling both the players and the boss. </p><p>Rules</p><p>At the start of your turn, you draw 2 cards, to a max of 10. Each turn you may drag any one card in your hand to the \"redraw\" zone to shuffle it into your deck and draw a new card. </p><p>Each turn you'll gain 2 mana to play cards and 2 energy to use basic actions. You may also discard one card each turn for an extra energy. All mana and energy is lost at the end of the turn. </p><p>You play as the red and green squares fighting against the purple boss. Each player may move up to two squares orthogonally each turn. To move, click on the player you want to move and then click where you want to move them to. You may spend available movement at any time during your turn, but all unspent movement is lost at the end of the turn. Each player will also heal 1 health at the start of each player turn. </p><p>You may spend energy on basic actions by pressing the basic actions buttons. You can spend 1 energy to give a certain player an additional movement or redraw an enemy card, or spend 2 to have a player attack the monster with their basic attack. To use the basic attack, the player must be adjacent to the monster, and will do damage equal to their attack stat. <br/></p><p>Most cards can be played by clicking and dragging them to anywhere in the middle of the screen. Cards with \"target\" must be dragged to a valid target. A card will not be played if you don't have the mana required or you don't fulfill other requirements of the effect. Some cards will only effect a certain player, and will be colored accordingly. </p><p>After clicking the end turn button for the player turn, you'll have to then take the monster turn. The monster has a deck of 10 cards, of which 3 will be displayed at any one time. You must play a certain number of cards for the monster equal to its frenzy stat, which starts at 1. Each turn the monster will gain 1 rage, and once it gets 5 rage it will reset its rage back to 0 and gain 1 frenzy. After you've played the required number of cards, you may then press the end turn button again to take a player turn once more. </p><p>Monster cards all have a level in the top right corner, starting at 1. However, each time a monster card is played its level will go up by 1 and become powered up the next time you see it. Numbers in () represent the number that will scale with its level, while numbers in || represent the monster's attack stat. Redrawing a monster card will not increase its level, only playing it will. Played monster cards are shuffled back into its deck at the end of its turn, so it's possible to see them again quickly. </p><p>Commentary and Ideas</p><p>This is just a quick prototype I made to test out a few ideas, most of which I think end up working fairly well here. The balance is a bit off, but I was more focused on seeing if the core gameplay was engaging. The thought is that this would be a monster hunter-esque game where you would fight a monster, gain resources, and then build new cards for your deck with those resources. Monsters would then grow stronger each time you fight them, which is easy to do by increasing the level of some of its cards each time, or just adding more powerful cards in.</p><p>I think this prototype only showcases some of its potential, but I really like how the enemy system allows for interesting counterplay. Do you send in a character to take an attack or two while the other recovers? Do you retreat, giving up opportunities for damage but allowing you to neutralize a powerful card? Do you let the monster gain permeant attack, buying you a free turn but making each subsequent more deadly?</p><p>One system I'm not 100% sold on is the mana system. With usually only 2 mana to work with, there isn't a ton of room for cards to cost anything else besides 0-2. Additionally, it feels similar to the energy system, even though they're used for different things. Thus, I would also like to try a scaling mana system similar to something like Hearthstone or Shadowverse where start with 1 mana on turn 1 and then gain 1 additional mana each turn. Another possibility would be keeping the mana to 2 a turn but having mana persist between turns, allowing you to build up to more powerful cards. </p><p>Another interesting system I thought of would be getting to select different weapon types, like in monster hunter. You can have melee weapons that hit hard but require you to stand next to the monster, or ranged ones that let you keep your distance but only do a point or two of damage. They would also have special abilities, preferably game warping effects such as \"you draw 3 cards but cannot redraw\", \"you gain 3 energy a turn\" or \"when you damage the monster, spawn an orb in a random empty space that draws you a card and gives you 1 energy when picked up\". </p><p>Speaking of spawning objects in spaces, that's one concept that I didn't used but would definitely like to expand upon in a theoretical full release. I feel like the idea of setting traps and luring the monster into them is a really cool fantasy, but rarely works out in practice in most games, as either dealing damage is just more reliable and stronger or they're just too hard to get enemies to move into (see games like Gloomhaven or the Arkham Horror card game). When you can control the monster though, suddenly you can setup traps and use the monster's cards against it to lure them in! You could save a certain movement card for the perfect moment to lure them in, but in the meantime the other cards are getting stronger and limiting your options more.</p>", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-21T07:31:00", "background_image": "https://media.rawg.io/media/screenshots/07d/07d6d5964e8bd0cfd637fa77ae8be4e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["The Wizard"], "genres": [], "publishers": [], "esrb_rating": null}