{"id": 724606, "slug": "stackdoku", "name": "Stackdoku", "name_original": "Stackdoku", "description": "<p><em>It's Stackdoku, the hot new craze that's sweeping the nation! You think your aunt mentioned it on Facebook, but she posts all sorts of nonsense on there, so who knows. Maybe it was something on Reddit. Do people still use Reddit? Anyway, you've heard of it. Definitely. Maybe. Well, you're here anyway, so you've heard of it now!</em></p>\n<p><strong>- - -</strong></p>\n<p><strong>Stackdoku</strong> is a 3D Sudoku-like puzzle game. Each round you are presented with a random 9x9 grid of 3D spaces (just like that other game, Sudoku!), whose relative height conveys the correct value of each space. The game keeps track of the number of moves and elapsed time it takes you to solve the puzzle, which are saved locally as high scores (and, hopefully, I'll be implementing a global leaderboard in a future release!) The game can be entirely played with just the left mouse button, though it does support number key input for space values when the HUD is active. Later versions will also include variable game difficulty options.</p>\n<p>- - -</p>\n<p>Bit of context here -- this is the second game I've ever made (or third, I guess, if you count the little creep dodging game Godot walks you through making as an intro), the first being a visual novel I co-developed as part of LUDOGOOD gaming. I built this as a way to challenge myself to make a game that was more challenging while learning the ins-and-outs of the Godot game engine and some more advanced game concepts.</p>\n<p>The game is available for download on Windows, Mac OS, and Linux. I hope in the future to release it for mobile (since the aspect ratio and general gist were all built with touch controls in mind), but for now keeping it simple until I decide if the cost of Apple and Google dev licenses is worth it to drop this free game onto folks' fancy smartphones.</p>\n<p>Constructive feedback is much appreciated, so please drop a comment if you've taken time to play even one or two rounds to let me know what you think! I plan to drop updates as I work on cleaning up some bugs, adding some features, and eventually cleaning up the overall aesthetic (though I kinda love how lofi and janky it is for now). </p>\n\n<p>Thanks for playing! ✌️</p>", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-21T07:31:58", "background_image": "https://media.rawg.io/media/screenshots/1b4/1b473aa5bfcef7dc864a22ecef0f512a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["perispectus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}