{"id": 724727, "slug": "luchador", "name": "LuchaDor", "name_original": "LuchaDor", "description": "<em>Imagine yourself, a buffed luchador, who just woke up from your beauty sleep. Everything seems great. You reach for your mask, which you can’t leave your house without when suddenly, it is not there. While trying not to cry, you search the entire house for it. In your kitchen table there’s a note saying, “Catch me.”. You immediately know who did it. Your entire body shivers. Will you be strong enough to defeat it? Your story begins now. </em>\n<p>As a luchador who just lost his most precious item, his mask, you feel enraged, embarrassed, and sad. Challenges appear to you, face to face. You don’t know if you have the willpower to take them. This was a huge blow in your self-esteem. As you leave your house, a cute lady compliments you. You feel happy :D. You realize that receiving compliments increases your confidence. Will it be enough? With this mental challenge in mind, you need to find whoever did this to you and retrieve the greatness which once was yours. </p>\n<p>As a platformer it’s important not to bore the player with the same mechanics and maps all over again. That’s why LuchaDor has many mechanics and different masks as well as a plethora of combinations to use in order to pass the levels. These levels are all unique in ambience as well as clearing methods. </p>\n<p>At the beginning of the game the core mechanics are explained to the player through a tutorial part in the level so they have knowledge of how the masks and platforming work. From there it is up to the player to figure out how to combine the masks’ abilities to overcome the subsequent challenges. While it may be a bit difficult to pass the sections at first, because the game is engaging, the player feels compelled to give it a try one more time to complete it.</p>\r\nFeatures\r\n<ul><li>2D side-scrolling levels with focus on platforming to overcome obstacles using abilities  such as jumps, double jumps, dashes, and grabs. </li><li>Explore a multi-layered setting centered around Mexican culture. Travel through  deserts, jungles, and some Mexican villages with a Stereotypical Mexican soundtrack  playing in the background. </li><li>At the end of each level there is a boss encounter with a macho. This macho will try to  stop our Luchador in his quest to retrieve his mask. The Luchador will have to use  combat abilities to attack (punches, kicks, nacho throws) the boss but also make use of  his platforming abilities to dodge incoming attacks. </li><li>Platforming sections and boss encounters will get progressively harder as the player  progresses through the game and encounters more masks. As the player gathers more  masks the more possibilities there are, and it will be required of the player to make a  proper use of the masks to overcome sections of the game. </li><li>There are several masks the Luchador can pick up alongside his journey that will either  improve his platforming abilities (higher jumps, triple jumps, extra dash charges, faster  dashes, longer dashes) or his combat abilities (extra damage with fists, extra damage  with kicks, faster nacho throwing).</li><li> Compliment juice works as a morale booster. People will be spread across the levels  and compliment our Luchador. The Luchador can pull out his bottle and gather  compliment juice. The more time you stay without being noticed, the more compliment  juice you can get, up to tier 3. If the people notice the Luchador’s bottle, they will stop  giving compliments and your bottle will be reset to the last tier you achieved. Filling the  first tier will give a 15% damage boost, the 2nd 15% damage boost and gives one more  life (consumed in boss fights) and the 3rd gives the previous effects and a random one.  The last tier summons the mighty slot machine which you can pull to give you a random  fickle buff.</li></ul>\n\r\nTeam:\r\n<p><strong>Pedro Bento</strong> - Lead Programmer</p>\n<p><strong>Raquel Chin</strong> - Programmer and Level/Character Designer</p>\n\r\nBig Thanks To:\r\n<ul><li>https://maaot.itch.io/mossy-cavern</li><li>https://cainos.itch.io/pixel-art-platformer-village-props</li><li>https://mimilena.itch.io/mimislime</li><li>https://assetstore.unity.com/packages/2d/environments/free-2d-hand-painted-18856...</li></ul>\n<p>This is only a demo version, not a full game since it was a university project. It was also our first game so reviews are more than welcome!</p>\n<p>If you like this demo, please leave a comment with your opinion and keep an eye out for further news :)</p><p>Thanks!</p>", "metacritic": null, "released": "2022-01-19", "tba": false, "updated": "2022-01-21T08:00:00", "background_image": "https://media.rawg.io/media/screenshots/51b/51b0a091110750a072e4f45662607259.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pedormente"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}