{"id": 725127, "slug": "lode-rabbit-runner", "name": "Lode Rabbit Runner", "name_original": "Lode Rabbit Runner", "description": "<p>Flèches Gauche et Droite = Directions Gauche et Droite</p><p>Flèches Haut et Bas = Directions Haut et Bas</p><p>Touche \"a\" = Creuser à gauche</p><p>Touche \"z\" = Creuser à droite</p><p>--------------------------------------------------------------------------------------------------------</p><p>Bonjour et bienvenue sur la page de mon jeu \"Lode Rabbit Runner\"<br/></p>\n<p>Je participe pour la première fois à une Game Jam de Game Codeur (n°34)</p>\n<p>Je suis élève premium depuis 2 mois sur Game Codeur.</p>\n<p>Le langage que j'utilise est Lua avec Love2d.</p>\n<p>J'ai codé mon jeu sur ZeroBrane Studio.</p>\n<p>- Temps passé à aujourd'hui : Environ 15h</p>\n<br/>\n<p>J'avais très envie de participer à ma première GamJam mais quand j'ai entendu le thème je suis tombé de ma chaise.</p>\n<p>J'essaie d'approfondir mes connaissances en programmation et de mettre en pratique ce que j'apprends.</p>\n<p>Du coup, je n'étais pas encore arrivé à la section programmation de platformer.</p>\n<p>Alors je me suis dis autant faire ce que je peux avec ce que je sais.</p>\n<p>Au même moment je vois le DLC sur le PathFinding !?!?! du chinois !\r\n</p>\n<p>Ainsi j'ai commencé à coder.<br/></p>\n\n<p>Au début, je me suis mis comme objectif d'afficher une map avec de simples carrés. J'ai dessiné la map à la main puis je l'ai  programmée en pur code. Comme décrit dans l'atelier TilesMap. </p>\n<p>Pour le personnage je me suis tout d'abord posé la question d'un  animal pouvant creuser. J'ai pensé au lapin.</p>\n<p>Puis j'ai commencé à coder. <br/></p>\n<p>Tout d'abord je me suis posé la question de savoir comment aborder ce jeu.</p>\n<p>Je me suis donné comme fil rouge de faire un jeu dans le style Game n Watch où les sprites et les actions sont déjà pré établis.</p>\n<p>Puis j'ai dessiné des croquis et utilisé la méthode de la TODO list qui pour moi est vraiment très productive.</p>\n<p>Mes objectifs étaient d'afficher une map avec un héros, un méchant, le héros devait pouvoir monter les échelles, s'accrocher à un câble, récupérer un bonus sans se faire toucher par l'ennemi. </p>\n<p>Et si j'y arrive à creuser un trou.</p>\n<p>J'ai codé en Lua avec le fw love2d. </p>\n<p>J'ai eu des difficultés à plusieurs niveau. Tout d'abord comment faire pour marcher sur une plate-forme. Ensuite comment monter à l'échelle et se suspendre à un fil.</p>\n<p>N'ayant pas encore toutes les connaissances du platfomer je me suis décidé à coder tous ces évènement un par un et à '\"caper\" les déplacement de mon perso et des ennemis.</p>\n<p>En réalité, le sprite se déplace de case en case et ne peut se déplacer que comme je l'ai prévu avec des coordonnées en dur. </p>\n\n<p>C'est pourquoi il serait impossible de faire plusieurs niveau à partir de cette base.</p>\n<p>Les graphismes peuvent être téléchargés sur : </p>\n<p>https://opengameart.org/content/bunny-rabbit-lpc-style-for-pixelfarm</p>\n<p>https://opengameart.org/content/lpc-wolf-animation</p>\n<p>pixabay</p>\n<br/>\n<p>J'ai réalisé des progrès en terme de génération de map, les coordonnées l'utilisation des booléens et des conditions imbriquées.</p>\n<p>J'ai réalisé que des fonctions dans une boucle ne sont pas forcément actionnable à tout moment et qu'l faut savoir où les placer.</p>\n<p>Je vais essayer d'aller le plus loin dans le prototype de mon jeu mon et si l'objectif est atteint je tenterai de l'améliorer jusqu'à la fin de la Jam</p>\n<p>Edit 20/01/2022 : </p>\n<p>Je commence à mettre mon premier prototype en DL.</p>\n<p>J'ai bien avancé depuis la dernière fois. </p>\n<p>Je suis fier d'avoir réussi à faire creuser mon personnage et les trous se rebouchent.</p>\n\n<p>- Petit postmortem (avis sur le langage/framework utilisés, difficultés, succès, choix, bilan personnel rapide, etc...)<br/></p>", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-01-21T09:38:55", "background_image": "https://media.rawg.io/media/screenshots/396/3968e25c9489bfd3d6614cc06bda1311.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MBaran"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}