{"id": 72518, "slug": "beak-bang", "name": "Beak Bang", "name_original": "Beak Bang", "description": "Welcome to Beak Bang! Help Beaky explore the wonders of nature by solving colorful hexagonal levels and beautiful jigsaw puzzles! Join now - the adventure awaits!<br/><br/>Switch and match hexagonal tiles to create epic chain reactions and powerful combos! Find the missing jigsaw puzzle pieces by beating colorful levels! Travel through nature in blissful beaches, wide oceans and exotic jungles! Play with beach balls, enjoy sailboats, take pictures and crack coconuts during the journey! Dig your way through ice walls using rockets, bombs and the special ring bomb. Earn daily gifts and unlock rewards by collecting stars and completing levels!<br/><br/>Features:<br/>- Unique and fresh match-3 gameplay!<br/>- Relaxing jigsaw puzzles with beautiful pictures!<br/>- Switch and match to create epic chain reactions!<br/>- Powerful boosters and weapons!<br/>- Simple to learn hard to master! <br/>- Tons of challenging levels and exciting episodes!<br/>- Unlock rewards by completing levels and collecting stars!<br/><br/>Come and join the adventure now!<br/><br/>---<br/><br/>Support: https://valasmedia.com/support<br/>Terms of Service: https://valasmedia.com/terms<br/>Privacy Notice: https://valasmedia.com/privacy<br/><br/>Please note: This game is free to play and download but some optional in-game items will require payment. You can turn off the payment feature by disabling in-app purchases in your device’s settings. Also, under our Terms of Service and Privacy Notice, you must be at least 13 years of age to play or download this game.", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-10-22T14:25:20", "background_image": "https://media.rawg.io/media/screenshots/e8a/e8a74677e398eea28de1e668b43a8401.jpg", "website": "https://valasmedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Valas Media"], "genres": ["Board Games", "Puzzle"], "publishers": ["Valas Media Oy"], "esrb_rating": null}