{"id": 7252, "slug": "asgard-run-crush-your-enemies", "name": "Asgard Run: Crush Your Enemies", "name_original": "Asgard Run: Crush Your Enemies", "description": "Choose, equip, upgrade your Viking hero! Play the best endless runner for free!<br/><br/><br/>At the heart of all creation, Asgard binds the worlds as one. Realm of gods and heroes. Realm of blood and battle. Eternal stands the Asgard Watch, Champions of Valhalla, Watchmen guarding bridges eight, Watchmen, ever wary.<br/><br/><br/>Join over a 250k brave Viking warriors to protect Asgard! Asgard Run was featured in “Best New Games” by Apple in over 130 countries so far!<br/><br/><br/>Toucharcade review: “you'll actually battle with enemies as you run. It all sounds very cool”<br/><br/><br/>Users reviews: <br/>5/5 - Cool game!! no energy regeneration system just nonstop fun so loved it works fine at note 2. great job by Developers<br/>5/5 - This is definitely my favorite endless runner title to date. Unprecedented depth for its class, awesome visuals, and fun for anyone.<br/>5/5 - Amazing graphics nice gameplay a lot of achievements perfect game what else do you want?<br/><br/><br/>Recognition:<br/>\"App of the year 2015 - 2nd Place Players Choice - SlideDB.com\" Asgard Run, 2015<br/>\"Best Entertainment App - Mobifest\" Asgard Run, 2016<br/><br/><br/>Features:<br/>- Five fearless Viking warriors<br/>- Tons of weapons and armor to win your battles<br/>- Get amazed in the tubular rotating Viking world of Asgard<br/>- Simple swipe controls. Run, fight, jump, fly, rotate!<br/>- Weapons and armor with special abilities<br/>- Fight and crush powerful warlocks, skeleton warriors, exploding zombies and much more!<br/>- Beware the deadly traps!<br/>- Watch your head! The Helheim Weather channel reported falling skies!<br/>- Invite and beat your friends scores!<br/>- And remember! Potions and Lifestones will save your life!", "metacritic": null, "released": "2015-11-11", "tba": false, "updated": "2019-10-22T14:29:15", "background_image": "https://media.rawg.io/media/screenshots/0f9/0f97bfdd79b5085cb7b0757c2d95bab1.jpeg", "website": "http://www.ayopagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ayopa Games"], "genres": ["Action", "Adventure"], "publishers": ["Ayopa Games"], "esrb_rating": null}