{"id": 72527, "slug": "100-block-puzzle", "name": "100! Block Puzzle", "name_original": "100! Block Puzzle", "description": "Fully enjoyed by more than 2,000,000 users worldwide &lt;3 Thank you for choosing the best block puzzle on store!<br/><br/>100! BLOCK PUZZLE is designed to be your personal entertainer, to uncomplicate your life and make you more effective. It is helpful in keeping the neurons fresh. It also helps quiet anxious or worrying thoughts when you're on the go. <br/><br/>100! BLOCK PUZZLE is proven a high-quality puzzle game which has been fully enjoyed by more than 2,000,000 users worldwide. It’s worth giving a try! <br/><br/>USERS SAY ABOUT 100! BLOCK PUZZLE<br/><br/>Extremely addictive by Debsdee<br/>This even steals me away from Candy Crush, it’s so simple yet so difficult at the same time.<br/><br/>100! Puzzle by Kiwi60chick<br/>Love it, me against the squares. So relaxing, stimulating, challenging.<br/><br/>Modern day block puzzle game! by chuswysly<br/>Fun game.........mindless stress reliever.<br/><br/>A+ by Luckytree001<br/>Awesome game, love it<br/><br/>GREAT GAME by KatrinaLMaetin4228<br/>Perfect for relaxing your mind<br/><br/>FUN! by Souixzq<br/>This is a fun game! I love that there is no timer and you have time to think. It is a great brain game!<br/><br/>100! BLOCK PUZZLE by KathyHJ<br/>Love this game! So addictive! Love no time demands!<br/><br/>CHALLENGES MY BRAIN by WrayWray16<br/>This game really helps me think and exercises my brain. I love trying to beat my own scores. Makes me think out of my own box.<br/><br/>EXTREMELY ADDICTIVE by Plyr111<br/>I have reach 7000 points and can't help to continue playing. Is it just me?<br/><br/>100 PUZZLE by Gunn6<br/>I find it challenging and addictive. Love it.<br/><br/>100! PUZZLE IS GREAT BRAIN EXERCISE. IT'S SIMPLY ADDICTIVE by kafydid<br/>How do people come up with these things? This will enliven your mind.<br/><br/>100! BLOCK PUZZLE FEATURES<br/><br/>• Brightly colored blocks &amp; brick shapes help make you feel more energetic &amp; happier<br/>• A great way to relax and train your brain at the same time by its easy yet challenging gameplay<br/>• Better experiences with Day mode &amp; Night mode setting<br/>• More options on block color to fit your style<br/>• Free forever block puzzle game<br/>• Play &amp; Pause any time, no matter where you are<br/><br/>HOW TO PLAY<br/><br/>• In 100! BLOCK PUZZLE, you will get an amazing feeling with 10 x 10 grid board.<br/>• Your mission is to hit the highest score you can by matching shapes of brick blocks and clear lines both vertically and horizontally.<br/>• Just drag and drop the given blocks into the 100! board and starts the journey of mastering your brain. Don’t let the blocks fill the grid board.<br/>• This puzzle game ends when you have no more space for a given block to put in the board.\u2028 <br/><br/>FOR YOUR REFERENCE<br/><br/>Studies show that, playing an intelligent casual gaming like 100! Block Puzzle everyday is the best practice for your brain. <br/><br/>The more you play, the smarter you are.<br/><br/>Hopefully you will love 100! Block Puzzle as much as we do.<br/><br/>~ 100! BLOCK PUZZLE team ~", "metacritic": null, "released": "2015-03-18", "tba": false, "updated": "2019-10-22T14:25:21", "background_image": "https://media.rawg.io/media/screenshots/9dc/9dc38349620e19831645e418e93c675a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SILVER LINING COMPANY"], "genres": ["Board Games", "Puzzle"], "publishers": ["SILVER LINING COMPANY"], "esrb_rating": "Everyone 10+"}