{"id": 725343, "slug": "vagabond-demo", "name": "Vagabond Demo", "name_original": "Vagabond Demo", "description": "<p><strong>Greetings Adventurer!</strong><br/> </p>\n<p>In Vagabond, you will have the opportunity to explore vast  procedurally generated worlds and meet their numerous inhabitants. You  start in the middle of nowhere with no memories or possessions. It's up  to you to forge your destiny, become a famous treasure hunter by  searching dangerous dungeons, the best blacksmith in the whole country  or a benefactor by helping the villagers who need you. Who will you  become?\r\n    </p>\n<p>Blending elements of traditional role-playing games with the freedom  of sandbox-style games, Vagabond is a unique experience. Moreover, you  can share your adventures with your friends as Vagabond was designed  from the ground to support multiplayer.\r\n    </p>\n<p><strong>Features</strong>\n</p>\n<ul><li> Create and customize your character\r\n</li><li>Explore procedurally generated worlds and travel across many different biomes which have their own riches and dangers\r\n</li><li>Visit  cities and meet hundreds of NPC who have a lot to offer: they can   teach you new skills, buy or sell you goods or tell you the latest   rumors. And if you feel good in one of the villages, you can buy a house   and become one of the villagers\r\n</li><li>Complete quests to help locals and earn rewards\r\n</li><li>Fight monsters in dungeons and get rare treasures\r\n</li><li>Gather resources by chopping trees, mining ores in caves, growing crops and killing monsters\r\n</li><li>Craft items such as armors, weapons, meals and furniture\r\n</li><li>Buy and furnish your home\r\n</li><li>Share your adventures with your friend with networked multiplayer (through LAN or the Internet)\r\n</li></ul>\n<p><strong>Demo</strong>\n</p>\n<p>Vagabond is still under active development, many new features are coming shortly:\r\n    </p>\n<ul><li> Magic with spells, magic wands, wizards and alchemy\r\n</li><li>Guilds with news quests and game mechanics\r\n</li><li>Lore generation to provide a history and legends to each world\r\n</li><li>More locations to fill the world such as castles, temples, ruins, etc.\r\n</li><li>Better dungeons with more complex structures and new types of rooms\r\n</li></ul>\n<p>If you want to support the game, you can play it now. If you have any  remark, I would be happy to have your feedback, you can send me an  email to pierre@vagabondgame.com or come and chat on Discord. Help me shape Vagabond's future!     </p>\n<p>Steam | Discord | Twitter | Reddit | Website\r\n</p>", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2022-01-21T10:32:11", "background_image": "https://media.rawg.io/media/screenshots/615/615b6ffce81b8fb58a646cf08db881af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["pvigier"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}