{"id": 725319, "slug": "kn-university-networking-beta-v1-windows-early-acc", "name": "KN University (Networking) - (Beta V1) Windows Early Access", "name_original": "KN University (Networking) - (Beta V1) Windows Early Access", "description": "<p>The KN University Game (KN Learning) is a social simulation game developed by Juan Garcia and published on Itch and Udemy.<br/></p>\n<p>The KN University Game is a strategic social simulation video game. There is no primary objective or goal to achieve, and instead of fulfilling objectives, the player is encouraged to make choices and engage fully in an interactive environment. Additionally the player is forced to view video lessons entering a classroom and learn while you move on with a simulated life. The focus of the game is on the simulated lives of virtual people called \"Students\", and the player is responsible for directing their actions, attending to their needs, and helping them attain their desires. Players control their life and explore different personalities which change the way the game plays out. \r\n</p>\n<p>\"I am a Udemy instructor and also a developer, so I decided to make an e-learning videogame for learning technology and fun for everyone at home who wants to learn\". - Juan Garcia </p>\n\n<p>The KN University Game (KN Learning) is a 3D emulation Game we are currently developing to learn technology from Vendors like Cisco, Microsoft, Avaya, Oracle in a fun 3D video learning emulation. On this series we are teaching the Networking University (Cisco Router and Switching Implementation laboratory) in a fun video Game for Learning.</p>\n<p>The KN University Game primarily make money by getting a job, or selling crafted items such as paintings and garden produce. Students need to develop skills for jobs and crafting items, for example, Students in the Networking Engineering career track need to be proficient in the Routing skill. Players can place their Points in money items or build their company using in-game building tools. Currently developing optional add-ons and expansion packs. This is a pre-developer release for students to learn Cisco Networking. In future releases we will have more levels and new vendors.</p>\n<p>Also you will learn the Data Network Concepts on this release:<br/></p>\n<p>1. Cisco Network Switching Campus (Labeling, IP address, VLAN)</p>\n<p>2. Cisco Network Routing Campus (Labeling, IP address, Routing)</p>\n<p>GAME RULES</p>\n<p>- Learn technology by entering each building on the Campus.</p>\n<p>- Watch videos and repeat them to learn Command Execution.</p>\n<p>- We emulate a University Campus Building for you to enter each class as many times as you want.</p>\n<p>- Learn by watching and playing.</p>\n\n<p>CONTROLLERS</p>\n<p>TAB - Cheat Sheet Commands<br/></p>\n<p>WALK - Arrows</p>\n<p>TRANSPORT - Press E</p>\n<p>I am including Cisco Lessons on this release. You can check out my other classes at Udemy if you want to learn technology, but I designed this video game to be interactive video friendly for kids, teens, students, any user that wants to learn technology via a video game by repetition. Includes lessons for Cisco Switches and Routers.</p>\n<p>https://www.udemy.com/user/juan-sebastian-garcia-8/<br/></p>", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2022-01-21T10:25:30", "background_image": "https://media.rawg.io/media/screenshots/81d/81da5ddf69a9a52e236ef25035cf9194.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["juangarcia"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}