{"id": 725370, "slug": "karma-flow-2-tears-of-a-ghost", "name": "Karma Flow 2 - Tears of a Ghost", "name_original": "Karma Flow 2 - Tears of a Ghost", "description": "<p><em>Note: The game supports Xbox360 Controller!</em></p>\n<p><em>Karma Flow 2 - Tears of a Ghost</em> is a Noir Action Stealth game which focuses on narrative and freedom of action. It's the direct sequel of <em>Karma Flow - The Prototype</em> and continues the story of the assassin Florien Kealborn.<br/><br/>Two years ago, a strange phenomenon called \"Karma\" began to infest the criminal city of Rolsara. No one knew what this \"force\" was, but every criminal in the city was forced to pay the price for their own actions the moment it started acting. Eye for an eye.<br/><br/>After the Karma Patrol's assault on Old Major HQ and the death of the Doppelganger, Florien is now tasked with the assassination of Madame Delavix, leader of a group of mercenaries called the \"Stray Dogs\".<br/>What started as simple wetwork turns into the biggest political crisis the city of Rolsara has ever witnessed while Florien is forced to face the ghosts of her own troubled past.<br/><br/>Play as Florien and uncover the truth behind the Karma in a game that lets you carry out missions any way you want, making you plan things out and act as you wish. How are you going to dispose of your targets? When? What route are you going to take? Are you going to wait for them and ambush them? Or are you going to charge them head on? It's up to you.</p>", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2022-01-21T10:38:06", "background_image": "https://media.rawg.io/media/screenshots/f37/f370bf10594b4bbf27029f30af6146e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OldPat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}