{"id": 72555, "slug": "bixel-pixel-art-coloring-book", "name": "Bixel– Pixel Art Coloring Book", "name_original": "Bixel– Pixel Art Coloring Book", "description": "Having stress? Just shelter from the stress of life and complete a variety of unique anti-stress pictures suits for both adults &amp; kids with Pixel Art Book. Get hours of relaxation and fun!<br/><br/>Kids and adults love to color by numbers, with tons of interesting and fashionable coloring pages, you will find coloring is never so fun. You can relief your stress together with family members or friends.<br/><br/>WHY YOU’LL LOVE Pixel Art Book:<br/><br/>- Exclusive new functions! You can shoot a Pixel Video via Pixel Art Book and use Cartoon Pixel to make your ordinary pixels into colorful pixels.<br/><br/>- Great variety of coloring pages for any taste: Animals, Food, Birds, Flowers, Places, and many others; Daily updates!<br/><br/>- Powerful Pixel Camera! Take selfies or any photos to color, create  your own pixel pictures!<br/><br/>- Useful coloring tools: Use Positioning Tool to find the uncolored blocks quickly and accurately and Paint Bucket to quickly paint adjacent color blocks with only one tap.<br/><br/>- MEET beautiful and uncluttered user interface.<br/><br/>- EASY coloring. No stress of picking up colors!<br/><br/>- SHARE your timelapse video with friends on social networks in just one tap;<br/><br/>Don’t need more consideration, just relax and enjoy!<br/><br/><br/>Pixel Art Book Unlimited Subscriptions<br/><br/>Pixel Art Book Unlimited Subscription allows you to unlock everything in Pixel Art Book and remove ads. <br/>Weekly subscription with 3-day free trial period is $7.99, monthly $9.99, and annually $39.99 or equal to the same price tier as Apple App Store Matrix determines as the equivalent of subscription price in USD. You'll be able to access unlimited coloring pages for the duration of your subscription.<br/>Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period. No cancelation of the current subscription is allowed during active subscription period.<br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that content.<br/><br/>How do I restore Pixel Art Book subscriptions on new devices?<br/><br/>You can tap the ‘Restore’ button on the subscription page.<br/><br/>Terms of use: https://s3.amazonaws.com/common.files/starcoloring/Terms+of+Use.html<br/>Privacy policy: http://picfun.oss-us-west-1.aliyuncs.com/Pixel Art Book/Privacy%20Policy.md.html<br/><br/>Questions? Ask: <br/>Facebook: Bixel coloring<br/>Instagram: @Bixel_app", "metacritic": null, "released": "2017-11-09", "tba": false, "updated": "2019-06-17T02:01:26", "background_image": "https://media.rawg.io/media/screenshots/f71/f718ffda7e458bb495a9201dc17725af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Picfun"], "genres": ["Family", "Puzzle"], "publishers": ["PICFUN TECH"], "esrb_rating": "Everyone 10+"}