{"id": 725714, "slug": "camp-clicker", "name": "Camp Clicker", "name_original": "Camp Clicker", "description": "<p>You have been left in charge of the cabin for the day! Use your helpful jellycube friends to get lots of resources, which are turned into glorious points at the end of the day.</p>\n\n<p>Entry for the 6AMES MADE QUICK ??? jam. Features highly visible debug options and no images, sound, or music at all! I'm glad I got something that works for this jam entry! Try to get 1000 points!</p>\n\n<p>UI Help:<br/></p>\n<p>^(UwU)&gt; - The Client: shows up randomly and grants a small bonus.<br/></p>[Buy Coins] - spends 50 beans to buy 1 coin, or 60 to buy 2 when the client is in the Cabin.<br/>[Improve Coins] - Slightly improves coin generation. Cost to upgrade listed under Coins. Stacks up to 3 times.<br/>[Improve Sticks] - Moderately improves stick generation and adds passive coin generation. Lose 1 jellycube permanently. Bonus listed as Extra Sticks. Stacks up to 3 times.<br/>[Add Max Sticks] - +10 max sticks. Cost to upgrade listed under Sticks.<br/>[Upgrade Sticks] - Enables stick generation. Costs 1 jellycube that can be recovered. Can stack multiple times.<br/>[Bonus Beans: ON/OFF] - When active, consumes sticks to greatly increase bean generation.<br/>[Recall Jellycubes] - Reduce the stick tier by one and gain a jellycube.<br/>[Get Beans] - Click to collect beans.<br/>[Upgrade Jellycubes] - Gain 1 additional jellycube. Cost to upgrade listed under Jellycubes.<br/>[Add Max Beans] - +50 Max Beans. Cost to upgrade listed under Beans.<br/>", "metacritic": null, "released": "2022-01-17", "tba": false, "updated": "2022-01-21T11:58:10", "background_image": "https://media.rawg.io/media/screenshots/f56/f5632c97d2c2dca4d09835c75c2ffff7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kraud16"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}