{"id": 725777, "slug": "shou-hu-zhe-meng-yue", "name": "守护者盟约", "name_original": "守护者盟约", "description": "The story<br/>\r\nAs the threat from underground looms, the guardians once again answer the call to protect their homes from destruction. Take up arms and join the fight against evil!<br/>\n<br/>\r\nThe game features<br/>\r\n● Silly pixel barbarians<br/>\r\nYou will be an adventurer, battling hordes of enemies! You will play as a unique pixel version of the barbarian, invincible and naive, fighting for justice and treasure!<br/>\r\n● Rich level and difficulty choices<br/>\r\nThree difficulty levels, up to 300 dungeons in different difficulty levels, higher difficulty means more powerful enemies, and the possibility of more and better loot.<br/>\r\n● Unique equipment entry<br/>\r\nRandomly generated items, each new item is unique, and the combination of items will yield different damage and fun.<br/>\r\n● Flexible choice of skills<br/>\r\nDual class skill tree switch freely, free. You can choose either one of these skill trees individually, or both, it's up to you!<br/>\r\n● Mysterious and powerful Power equipment<br/>\r\nMore than 40 optional items, some special items even come with unique powers. Equipping powers will greatly enhance and even change your skill traits. Choosing powers that suit your current skill genre will give your hero a vastly improved and subversive combat experience.<br/>\r\n● Powerful monsters for my use<br/>\r\nSummon of demon servant, allow to take all monsters for your own use, strong monsters will become your arms! If you think an enemy is too tough to fight, you will change your mind and rejoice when he becomes your partner.<br/>\r\n● The servant grows and the hero continues to improve<br/>\r\nManservant tuning, you can freely change manservant entries, provide rich aid for different equipment builds, diversify your build collocation. At the same time, the servant conditioning will also improve the servant's own stats, while providing the master with powerful stats, the master will also be greatly improved.", "metacritic": null, "released": "2022-01-20", "tba": false, "updated": "2022-01-24T03:06:20", "background_image": "https://media.rawg.io/media/screenshots/75d/75d33a72e1614f7e497637f54570f74d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["红星"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["电钮组"], "esrb_rating": null}