{"id": 72574, "slug": "juice-fruity-splash", "name": "Juice Fruity Splash", "name_original": "Juice Fruity Splash", "description": "Juice Fruity Splash, Match 3 juice Splashing, juice jam addictive fresh new match puzzle game. Embark on this fruity juice adventure now! <br/>Taste the Fruit Jam Splash experience and Swap to match 3 or more delicious fruits in deliciously tasty juice.<br/>Scrumptious strawberries, fresh blueberries, orange maranja, ripe banana, appetizing grapes, juice jam , enjoy this fruit juice party.<br/>Every berry and crop are there to blow in this mania of equal fruits.<br/>Have fun and blast around in this beautiful jucie fruity splash party!<br/><br/>Highlighted Features:<br/>-  Completely free to play.<br/>-  1000+ well-designed delicious puzzles!<br/>-  Spectacular boosters, splendid graphics!<br/>-  Variety of gameplays, awesome new characters!<br/>-  Powerful booster help you pass the level.<br/>-  Easy to play but challenging to master.<br/>-  Competitive with all players worldwide.<br/>-  Less moves, More Stars, Higher scores! Crush all juicy fruits!<br/><br/>How to play:<br/>- Match 3 or more identical fruits in a line to jam them.<br/>- Match 4 fruits in a row or column to create special direction one.<br/>- Match 5 fruits in T or L to create special Color Orange Bomb. <br/>- Combine 2 special ones to make huge chain reaction to help you pass the level.<br/>- Swap to match 3 or more sweet fruits to have a hearty harvest.<br/><br/>What are the unique points of this amazing colorful game? Explore them all now and start playing right ahead!<br/>Lots of equal fruits in this mania. Start this puzzle adventure and win the frozen treat.", "metacritic": null, "released": "2018-05-11", "tba": false, "updated": "2019-10-22T14:25:22", "background_image": "https://media.rawg.io/media/screenshots/f92/f92249b3b7de4c78af83185e66edf1b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["zhang hui"], "genres": ["Family", "Puzzle"], "publishers": ["zhang hui"], "esrb_rating": "Everyone 10+"}