{"id": 72586, "slug": "tadpole-tap", "name": "Tadpole Tap", "name_original": "Tadpole Tap", "description": "Reach the skies with your favorite tadpole while eating flies with your tongue! <br/>With piranhas constantly on your tail, you must hurry and pull your way through dangerous obstacles! <br/><br/>Try to beat your friends high score and embellish your aquarium with tadpoles by unlocking all the little fellas!<br/><br/>-UNLOCK YOUR TADPOLES: There are multiple tadpoles to unlock, each with a unique ability that will help you through the dangers along the way.<br/>-UPGRADE YOUR TADPOLES: Each tadpole's unique ability can be upgraded to get better scores.<br/>-GET BETTER POWER-UPS: All power-ups can be upgraded to make them last longer. If they last long enough, you can sometimes have multiple power-ups at once! Some combinations are very good!<br/>-DON'T FORGET TO EAT FLIES: Eating flies is somehow very satisfying, plus this is what allows you to buy upgrades!<br/>-CLIMB FURTHER EVERY TIME: Beat your high score and battle your friends. Compare your performance on the leaderboard.<br/>-GET THE PUZZLE PIECES: Each Tadpole has a unique puzzle to unlock!<br/>-UNLOCK THE SKINS: Collect vials to unlock them all! There is 3 skins per tadpole.<br/>-ACHIEVEMENTS: Let's see if you can clear them all!<br/><br/>In one word, Tadpole Tap is an awesome Retro Runner in Pixel Art.<br/><br/>Tadpole Tap, the life circle of a frog.<br/><br/>Language available: English, French, Spanish, Russian, Portuguese, Italian, German, Simplified Chinese and Serbian.", "metacritic": null, "released": "2015-04-22", "tba": false, "updated": "2019-07-29T16:41:32", "background_image": "https://media.rawg.io/media/screenshots/8cf/8cf80c90aa5219a3640b9b4d8fcbf52c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Outerminds"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Outerminds"], "esrb_rating": "Everyone 10+"}