{"id": 72585, "slug": "no-wifi-games-2018", "name": "No Wifi Games 2018", "name_original": "No Wifi Games 2018", "description": "-----------------------------------------------------<br/>FREE FOR LIMITED TIME : Coin Drop : Pusher Mania Party<br/>-------------------------------------------------------<br/><br/>Are you a lover of coin pusher games? You’ve just found the most original Coin Drop casino simulator that blends perfectly with your world explorer and treasure hunting games taste! Our unique arcade provides not only the classic coin dropper gameplay, but it mixes it with a treasure hunt for giving you a unique Coin Drop experience in different level locations like: Treasure Cave, Gold of Ra, Diamond Rock &amp; Temple of Venus!<br/><br/>The infamous red-bearded pirate left behind his treasure maps!  It seems like your luck already started changing because now, you have all the treasures locations. Begin your treasure hunt quest now, to collect all the coins &amp; prizes of the huge lots inside the chests. Be careful though; the red-bearded pirate left some traps &amp; fake treasure chests to keep safe his gold coins &amp; jewels. The traps can cause that most of the coins and goodies fall to the sides of the dozer machine; so be really careful when you tap!<br/>Let the treasures chase &amp; the coin dash dozer fun action begins! Download NOW Coin Drop: Treasure Quest and enjoy the tons of prizes &amp; high winning rates!<br/><br/>Not familiar with Coin Drop free games rules? No problem! It works almost the same like the real coin games machines or like paplinko games, and you’ll see a short video tutorial. Tap the pusher to make coins drop on it. All the coins or prizes that fall on the sides won’t be counted on your balance. The main goal is to drop coins &amp; have them pushing over the front edge of the platforms. Our game includes incredible boosters that will help you on your cash collect quest. Check every booster special power &amp; actions in the help section to build your winner strategy! Use the power ups wisely, as some of them don’t regenerate so fast as others. Gain XP points to increase your experience bar and unlock more maps and game levels. Our dozer can compete with the best prize claw machines or simulators in rewards matter; but unlike the claw machine, your chances of winning are much higher!<br/><br/>If you get stuck, use the Shake option; every collected coin fills your Shake meter. You can activate it when it reaches one of the three levels: Low, Medium or High. Activating this feature shakes the table making the coins on the edge fall off the table. Collect 4 or more coins at once to trigger a Coin Attack; this will create and spread special goodies, prizes and puzzle pieces. Once you collect all the gold puzzle pieces, 12 to be exact, you’ll open the secret door of the room which contains a huge amount of rewards. Puzzle mini games unlock at level 5, and from there each level of our dozer has a puzzle mini-game to solve. Keep gaining XP to collect all the surprise rewards waiting for you!<br/>Coin Drop: Treasure Quest Features<br/><br/>Main Gameplay Features:<br/><br/>- State of the art 3D graphics<br/>- State of the art realistic physics modelling way more coins than our competitors<br/>- Many special coins and prizes and sub games<br/>- 20 rare gems - collect and cash them in for great bonuses<br/>- 34 achievements - can you unlock them all?<br/>- 150 collectable toys, with more coming in future updates<br/>- Daily Bonus. Each day, something extra to spice up your game play.<br/>- All for free!<br/><br/>Collect all the special items like gold bars or secret boxes to conquer all the secret rewards hidden among the chests treasures! Try NOW Coin Drop: Treasure Quest FREE for limited time only!", "metacritic": null, "released": "2018-05-30", "tba": false, "updated": "2019-10-22T14:25:22", "background_image": "https://media.rawg.io/media/screenshots/36c/36cba8023bfd5f29347badd565aa29e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dynamic Games"], "genres": ["Arcade"], "publishers": ["Dynamic Games"], "esrb_rating": "Everyone 10+"}