{"id": 725812, "slug": "survive-the-hill", "name": "Survive The Hill", "name_original": "Survive The Hill", "description": "<strong>WELCOME CAMPERS! DEATH GIVES YOU A SECOND CHANCE</strong><br/><br/>CAMPING ON THE HILL IS FUN. BUT EVEN IF YOU ARE NOT AFRAID OF CAMPING ON THIS HILL WHERE THERE IS NO ONE, IT IS USEFUL TO BE CAREFUL. KILLER CLOWNS MAY SUDDENLY BE ON YOUR SIDE.<br/><br/>• SURVIVE THE HILL IS AN ASYMMETRICAL MULTIPLAYER/CO-OP SURVIVAL EXPERIENCE THAT SUPPORTS 1V4 TO 2V8 OPTIONS (CUSTOMIZABLE TO PLAYERS' TASTE) AND AI VERSUS SCENARIOS.<br/><br/>• SURVIVE THE HILL IS A MULTIPLAYER (4VS1) OR (8VS2) HORROR GAME WHERE ONE PLAYER TAKES THE ROLE OF A RANDOM KILLER CLOWN AND FOUR OTHER PLAYERS PLAY AS SURVIVORS TO AVOID BEING KILLED OR TURNED INTO A ZOMBIE BY ESCAPING THE KILLER CLOWN.<br/><br/>• PLAY ONLINE VIA STEAM WITH 4V1 - 8V2 PLAYERS AND ARTIFICIAL INTELLIGENCE SUPPORT<br/><br/><br/><br/>• SURVIVE TOGETHER…OR DIE - ALL SURVIVORS MUST COOPERATE WITH OTHERS. OTHERWISE, YOU HAVE NO CHANCE OF SURVIVING. THIS WILL DEPEND ON WHETHER YOU WORK TOGETHER AS A TEAM OR ALONE. CAN YOU DODGE THE KILLER CLOWN AND ESCAPE THE HILL?<br/><br/>• WHERE AM I? – EVERY LEVEL IN HILL IS PROCEDURALLY GENERATED, SO YOU NEVER KNOW WHAT TO EXPECT. RANDOM SPAWN POINTS WILL CHANGE RANDOMLY EACH TIME YOU PLAY AND YOU WILL BE TRAPPED IN THE MAP.<br/><br/>• GET RID OF THE ZOMBIES ELIMINATE THE KILLER REPAIR THE VEHICLE AND GET OUT OF HERE.<br/><br/>• SURVIVE THE HILL IS A FEAST FOR MURDERERS AND TORTURE FOR SURVIVORS.<br/><br/>• USE YOUR SKILLS AS A KILLER, YOU ARE INVINCIBLE BUT YOU CAN BE STOPPED.<br/><br/><br/><br/>•SURVIVORS: BE VERY CAREFUL, GENERALLY AVOID TAKING RISKS, YOU MAY BE TRANSFORMED AND SUBJECT TO A CHANGE OF SIDES. OR YOU MAY BE KILLED BY A KILLER OR ZOMBIE, BUT DEATH IS NOT THE END FOR YOU.<br/><br/>• ALL CHARACTER STRUCTURES HAVE A THIRD-PERSON PERSPECTIVE, THE ENTIRE MECHANICAL STRUCTURE OF THE GAME IS DESIGNED ACCORDINGLY, SUITABLE FOR STRATEGY DEVELOPMENT IN MORE FREE AREAS.<br/><br/>• UNLIKE OTHER SIMILAR GENRES IN SURVIVE THE HILL, THE KILLER CAN EITHER KILL THE PLAYER HE KNOCKED OUT AND DISQUALIFY THEM FROM THE GAME OR TURN THEM INTO AN ALPHA ZOMBIE. THE KILLER CAN GATHER STRENGTH BY RECRUITING YOU.<br/><br/>• THERE ARE TWO DIFFERENT ZOMBIE CLASSES IN THE GAME THAT THE KILLER CAN TRANSFORM.<br/>   ALPHA AND NORMAL ZOMBIE MODE ALPHA IS STRONG AND FAST. NORMAL ZOMBIE MODE IS SLOW AND FLIMSY.<br/><br/><br/><br/>GAME MODES ARE AS FOLLOWS.<br/><br/>• 4 PLAYERS VS. 1 KILLER<br/>• 4 PLAYER VS. 1 KILLER ARTIFICIAL INTELLIGENCE SCENARIOS<br/>• 2 KILLER AND 8 PLAYERS<br/>• 8 PLAYER VS. 2 KILLER AI SCENARIOS<br/><br/><br/><br/>• MELEE WEAPON: THE MELEE WEAPON YOU CHOOSE IS VERY IMPORTANT. A WEAPON WITH HEAVY DAMAGE AND BALANCED POWER WILL HELP YOU.<br/><br/>• SECONDARY MATERIAL: THE AUXILIARY MATERIALS YOU WILL CHOOSE WILL SUPPORT YOU IN THE GAME, CHOOSE CAREFULLY.<br/><br/><br/><br/>• SUPPORT EQUIPMENT: YOU CAN HELP YOUR TEAMMATES OR PROTECT YOURSELF.<br/><br/>• FIX YOUR JUNK CAR AND TRY TO ESCAPE FROM THIS DAMN PLACE.<br/><br/><br/><br/>• REMEMBER THIS IS A PARTY GAME. YOU NEED TO PROTECT YOUR FRIENDS AND ACT TOGETHER. TRY TO USE YOUR INTELLIGENCE AND HAVE FUN BY EXPERIENCING MOMENTS OF TENSION.<br/><br/>• BEWARE, SOME OF YOUR FRIENDS MAY BE KILLED BY THE KILLER AND JOIN THE RANKS OF THE ENEMY.<br/><br/>• CHOOSE YOUR MATERIALS CAREFULLY BEFORE STARTING THE GAME. THE RIGHT MATERIALS CAN CHANGE THE FATE OF THE GAME.<br/><br/>• YOU CAN FIND MANY MATERIALS TO HELP YOU FROM THE CHESTS ON THE MAP, KEEP YOUR EYES PEELED.<br/><br/><br/><br/>• ATTENTION! YOUR WEAPON MAY BREAK, IN SUCH CASES YOU CAN REPAIR YOUR WEAPON AT THE REPAIR TABLES ON THE MAP.<br/><br/>• ZOMBIES ARE VERY SENSITIVE TO SOUND AND BEING QUIET WILL HELP YOU A LOT.<br/><br/>• THE MATERIALS YOU WILL CHOOSE WITH YOUR TEAMMATES AT THE BEGINNING OF THE GAME WILL BE VERY EFFECTIVE IN THE GAME, CHOOSE CAREFULLY.<br/><br/>• WHILE CARRYING THE NECESSARY ITEMS FOR THE VEHICLE, YOU WILL NEED THE HELP OF YOUR OTHER TEAMMATES TO PROTECT YOU FROM THE FREAKS AND KILLERS THAT WILL COME AFTER YOU. SO DON'T BE TOO FAR FROM EACH OTHER. REMEMBER, HE WHO LEAVES THE PACK IS CAUGHT BY THE WOLF.<br/><br/><br/><br/>• TO PREVENT THE SURVIVORS FROM ESCAPING THIS HILL, PREVENT THEM FROM REPAIRING THE VEHICLE AND KILL THEM AND PULL OVER TO YOUR SIDE.<br/><br/>• CORNERING THE SURVIVORS WITH THE FREAKS WILL WORK.<br/><br/>• REMEMBER, YOU ARE A BEING WITH SUPERHUMAN POWERS.<br/><br/>• USING YOUR SKILLS, YOU CAN ADVANCE VERY FAST AND SEE WHERE THE SURVIVORS ARE.<br/><br/>• NOW YOU CAN START HITTING FEAR FROM ABOVE.", "metacritic": null, "released": "2022-01-21", "tba": false, "updated": "2022-01-24T03:30:29", "background_image": "https://media.rawg.io/media/screenshots/63a/63a5efdd2db18d161123772d52e25f7e.jpg", "website": "https://survivethehill.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 557, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Redivided Studios"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Redivided Studios"], "esrb_rating": null}