{"id": 725814, "slug": "sword-reverie", "name": "Sword Reverie", "name_original": "Sword Reverie", "description": "<h3>Key Features</h3><br/><strong>Fight With Style</strong><br/>♦ Launch unique abilities by moving your body.<br/>♦ Use physics based combat to defeat a variety of enemies.<br/><br/><strong>Go On An Adventure</strong><br/>♦ Get summoned to save a different world as an anime protagonist.<br/>♦ Explore a large fantasy environment with Stella as your companion.<br/><br/><strong>Become A Master</strong><br/>♦ Unlock new abilities and craft powerful weapons.<br/>♦ Change your strategy to overcome new unique challenges.<h3>Story</h3>After thousands of years of peace, tensions between Humans and Elementals continue to escalate. Catastrophic war with the Elemental lords is imminent.  When the previous Guardian died by the hands of the Elementals, Magnus vowed to carry on the role of the Guardian and put a stop to the threat of the Elementals once and for all. The Guardian Magnus summons you, a “Hero”, from a far away land to save his people. <br/><br/>Joining you on your adventure is Stella, the daughter of the last Guardian. Her father, the last Guardian was murdered by one of the Elemental Lords under mysterious circumstances and her mother perished alongside him. Adopted and raised by Magnus, Stella has spent her life training with a bow and arrow to avenge her parents’ deaths and to make sure no other child needs to suffer her fate.<br/><br/>As the Hero, will you rise up to the challenge and free the world from the tyranny of the Elementals?", "metacritic": null, "released": "2022-01-21", "tba": false, "updated": "2022-01-24T03:31:48", "background_image": "https://media.rawg.io/media/screenshots/71c/71c997fba824596bc8158a9882440fd5.jpg", "website": "https://swordreverie.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "dropped": 2}, "playtime": 1, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Isekai Entertainment"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Isekai Entertainment"], "esrb_rating": null}