{"id": 725818, "slug": "price-of-power", "name": "Price of Power", "name_original": "Price of Power", "description": "<p>Price of Power is a wholesome adult visual novel (AVN) focused on romance and adventure. Our hero, a hunter by trade, finds his long-estranged childhood friend Maria wandering around his village. As they rekindle their friendship, she pulls him into the adventure - and romance - of a lifetime.AdventureExplore the mysterious Southlands with your best friend, your childhood hero, and other companions you pick up along the way. Though you believe the Southlands have been abandoned for centuries, you&#39;ll quickly discover that all is not as it seems. You&#39;ll rediscover ancient secrets, fight dangerous monsters, and navigate the subtleties of court politics. Fortunately, with the assistance of your trusty group of companions - all of whom happen to be gorgeous women - there&#39;s no challenge you can&#39;t overcome!RomanceAfter ten years apart, the spark between you and Maria is stronger than ever. Your relationship will undergo a true trial by fire, but you&#39;re confident that your love will overcome any obstacle. And who knows, Maria may not be the only woman who&#39;s interested in you... As you play Price of Power, you&#39;ll be able to unlock one of three romance paths in the game: a Maria-only &quot;purity&quot; route, a Maria + Emilia &quot;throuple&quot; route, and a &quot;harem&quot; route. Maria will always be your number one lady, but will that be enough to satisfy you?</p>", "metacritic": null, "released": "2022-01-21", "tba": false, "updated": "2023-08-05T09:22:13", "background_image": "https://media.rawg.io/media/games/82f/82f485ff2da1922d54eee740c60ffd7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "playing": 1}, "playtime": 19, "achievements_count": 12, "ratings_count": 1, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC", "macOS"], "developers": ["The Pandaman"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Pandaman Games"], "esrb_rating": null}