{"id": 725949, "slug": "another-lost-soul", "name": "Another Lost Soul", "name_original": "Another Lost Soul", "description": "<p>-------------------------<br/>\r\nEnglish Description<br/>\r\n-------------------------\r\n<br/>\n<em>You land in a strange place, you don't remember what happened to you but a strange creature seems to be able to help you get back to where you came from.</em>\n</p>\n<p><em>He is suspicious... he seems to be having fun with you and seems to know a lot more about your coming to this place.</em>\n</p>\n<p><em>He offers you a challenge to regain your freedom. What challenge ? Who knows ? There is no choice but to cooperate with him until you understand the situation.</em>\n</p>\n<p>This game is only a demo, just to warn you from \"why it is so short\" and may contain bugs or translation errors. This is the biggest personal project so if you can support the project by sharing it with your friends, giving me your positive, negative or both, I'll take everything. If you can afford it and you like the project, you can make a small donation. I recommend you to play the download version.</p>\n<p>A lot of things can change and I already have some ideas in mind.<br/>So for the next patch :<br/>\r\n- Add SFX (sound effect)<br/>- Add another boss<br/>- Modification of Kerwin's personality<br/>- More items and weapons<br/>- More scenery<br/>- Gamepad adaptation</p>\n<p>The second level will be done later, I'll finish polishing the level 1 and then we'll have a complete level. You can follow my page itch.io to be informed of the next updates.\r\nHe can take some time to do the next patch so you can follow me on twitter.<br/>\r\n(I'll try to be active to show the progress)</p><p>------------------------------<br/>Description en Français<br/>------------------------------<br/><em>Vous atterrissez dans un endroit étrange, vous ne vous souvenez pas de ce qui vous est arrivé mais une étrange créature semble pouvoir vous aider à retourner d'où vous venez.</em></p>\n<p><em>Il est suspect... il semble beaucoup s'amuser avec vous et semble en savoir beaucoup plus sur votre venue dans cet endroit.</em></p>\n<p><em>Il vous propose un défi pour retrouver votre liberté. Quel défi ? Qui le sait ? Vous n'avez pas d'autre choix que de coopérer avec lui jusqu'à ce que vous compreniez la situation.</em></p>\n<p>Ce jeu n'est qu'une démo, juste pour vous prévenir de \"pourquoi il est si court\" et peut contenir des bugs ou des erreurs de français. C'est mon plus grand projet personnel donc si vous pouvez soutenir le projet en le partageant avec vos amis, en me donnant vos avis positifs, négatifs ou les deux, je suis preneur. Si vous pouvez vous le permettre et que vous aimez le projet, vous pouvez faire une petite donation. Je vous recommande de jouer à la version téléchargé.</p>\n<p>Pas mal de chose peuvent changer et j'ai déjà quelques idées en tête. Donc pour le prochain patch :<br/>- Ajout de SFX (effet de son)<br/>- Ajout d'un autre boss<br/>- Modification de la personnalité de Kerwin<br/>- Plus d'item et d'arme<br/>- Plus de décor<br/>- Adapation à la manette</p><p>Le deuxième niveau se fera plus tard, je vais finir de bien polir le niveau 1 et comme ça on aura un niveau complet. Donc suivez ma page itch.io pour être averti des prochaines mises à jours.<br/>Le temps que je prépare le prochain patch, vous pouvez aussi me suivre sur twitter.<br/>(J'essaierai d'être actif pour montrer les avancements)</p>\n<p>Credits :</p>\n<p>Music &amp; SFX (Sound) :<br/>Jp Soundworks : https://www.youtube.com/c/JPSoundworks/<br/>Eric the Funny Baron :<br/>https://eric-the-funny-baron.itch.io/barons-music-pack and<br/>https://eric-the-funny-baron.itch.io/barons-music-pack-2<br/>Zapsplat : www.zapsplat.com<br/>Kronbits : https://kronbits.itch.io/freesfx<br/>Obstdianx : https://obsydianx.itch.io/interface-sfx-pack-1</p>\n<p>Design :<br/>Szadiart : https://szadiart.itch.io/rpg-main-character<br/>Stelthix : https://stealthix.itch.io/rpg-nature-tileset<br/>Cainos : https://cainos.itch.io/pixel-art-top-down-basic<br/>Raou : https://raou.itch.io/free-dungeon-mini-tileset <br/>(Twitter : @raoucemar) (ArtStation: artstation.com/raou_ii)<br/>Patrick Flattery : https://patrick-flattery.itch.io/ghost-voices-sfx-pack<br/>Foozlecc : https://foozlecc.itch.io/little-bird</p>\n<p>Thanks to them / Merci à eux</p>", "metacritic": null, "released": "2022-01-23", "tba": false, "updated": "2022-01-24T04:16:50", "background_image": "https://media.rawg.io/media/screenshots/742/7427418073b8c8f413328b5e6a493a4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["quentin0133"], "genres": ["Action", "Shooter", "Adventure", "Fighting"], "publishers": [], "esrb_rating": null}