{"id": 72596, "slug": "dot-to-dot-connect-the-dots", "name": "Dot to dot - Connect the dots!", "name_original": "Dot to dot - Connect the dots!", "description": "Dot to Dot is a fun and relaxing puzzle game for adults and kids. Tough day? Feel bored? Looking for distraction?<br/>Connect the dots and relieve your stress!<br/><br/>The rules are simple: starting at number 1, draw a line to dot 2, then 3 and so on. Match numbers, join the dots in order to create a fascinating picture.<br/><br/>Features:<br/>- The only game where all pictures are free<br/>- New pictures every day<br/>- Difficulty levels: from easy to hard for adults and for kids<br/>- Extreme Dot to Dot puzzles with over 1000 dots for hardcore players<br/>- Incredible themes for everyone: animals, mandalas, flowers and more<br/>- Hints that help you find a number<br/>- A great sense of satisfaction after joining all the dots<br/>- Sharing your artworks with friends<br/><br/>The game is wonderfully therapeutic as well as rewarding. Playing dot to dot is a fun and enjoyable activity for kids and for adults that has many mental health benefits, and it is certainly worth taking up the practice to keep your brain healthy and have fun when you Connect the Dots!<br/><br/>With weekly updated collection guaranteed to keep you thoroughly entertained. This game is a real treat for anyone who loves sudoku, word searches, crosswords, and logic puzzles.<br/><br/>Dot 2 Dot puzzles are effective at helping children learn advanced levels of counting. It’s also incredibly useful for teaching instruction following, concentration, counting and mapping.<br/><br/>Discover the thrilling collection of puzzles. Welcome to the magical world of Dot to Dot!", "metacritic": null, "released": "2018-08-31", "tba": false, "updated": "2019-10-22T14:25:22", "background_image": "https://media.rawg.io/media/screenshots/ed5/ed5b3327f27104397c9ac3ee527b1c3e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["X-Flow"], "genres": ["Board Games", "Puzzle"], "publishers": ["X-FLOW"], "esrb_rating": "Everyone 10+"}