{"id": 726246, "slug": "stall-steal", "name": "Stall STEAL", "name_original": "Stall STEAL", "description": "<p><strong>Time for some good FOOD GRAB!</strong></p>\n<p>Collect food from the stalls while avoiding being seen and rotten stuff. A hypercasual game developed with the theme, 'Food' in mind.</p>\n<p><strong>Hint: Multiply food gains via combos i.e taking food from the same kind of stalls consecutively.</strong></p>\n<p><strong>Controls</strong></p>\n<p><strong>Android:</strong> Swipe Up. Left and Right (no taps!)<br/><strong>WebGL:</strong> Arrow Keys Up, Left and Right (no clicks!)</p>\n<p><strong>Story Background [because why not ;) ]</strong></p>\n<p>Once upon a time, there was this very poor child called <strong>\"Akira\"</strong> who was very hungry. He was on the verge of death. But someone came running with a bag full of food. He was in a cloak. He gave this child a banana and asked him to eat. Akira ate the banana. He was so happy that he hugged this stranger. His eyes were filled with tears.</p>\n<p>After a moment, he heard the cries of many people from behind. It was as if everyone was waiting for that stranger to feed them. Everyone was crying with happiness. It was a memory, burnt in his mind. At that very moment, Akira promised himself that he will be the one to feed the poor just like the stranger. Little did he know that the stranger simply steal the food to feed the others. But this morality didn't matter to him because his frail self don't want to see another frail being around him. He wanted to avoid the feeling of hunger, not only for himself but for others as well. He wanted to revive that very memory every single day.</p>\n<p>And that's how the grown-up Akira started on the same journey as this very stranger did.</p>\n<p><strong>Developed by Team CodeBlooded:</strong></p>\n<p>Ali Hamza, M. Memon, Hassan, Sohaib, Bilal Cheema</p>", "metacritic": null, "released": "2022-01-23", "tba": false, "updated": "2022-01-24T05:22:53", "background_image": "https://media.rawg.io/media/screenshots/b60/b60d463f9559ce6a279554f944a69270.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Web"], "developers": ["Programmer Cheema"], "genres": ["Action"], "publishers": [], "esrb_rating": null}