{"id": 726521, "slug": "yufo", "name": "Yufo", "name_original": "Yufo", "description": "<p>Yufo's planet got drunk, so now they're stuck in limbo-verse, waiting till things improve at home. Another creature lives in limbo-verse, with the ability to either ensure its safety, or its demise. Let's hope the creature is kind...<br/><br/>Leave Yufo on in the background on your computer as you go about your daily tasks. If you close the window, Yufo will regress back into egg form. Yufo will let you know when it needs something, but it is best to anticipate their needs (leave sound on).<br/></p>\n<p><strong>Controls</strong><br/></p>\n<ul><li>The <strong>B button (alt)</strong> moves the icon selection on the screen.\r\n</li><li>The <strong>A button (ctrl)</strong> confirms the use of a selected icon, or switches to the clock screen if no icon is selected.\r\n</li><li>The <strong>Select button (shift)</strong> will clear any icon selection, and close whatever menu the screen is currently showing.\r\n</li><li>Press<strong> F1</strong> to enlarge the screen </li></ul>\n<p><strong>Quick tips:</strong> Don't overfeed Yufo, don't let them sit with their filth for too long, put them to sleep once in a while or they'll die young. Yufo gets happier faster if they win rock, paper, scissors. Also, some actions will change their overall appearance as they grow up.<br/><br/><strong>NOTE</strong>: The attention icon (bottom right) doesn't work right now.<br/></p>\n<p>This tamagotchi-style toy was our first small game made with the Uxn ecosystem. Sprites were drawn in Nasu. Made for the Virtual Pet Jam 2022.<br/></p>", "metacritic": null, "released": "2022-01-23", "tba": false, "updated": "2022-01-24T06:25:32", "background_image": "https://media.rawg.io/media/screenshots/de9/de9d754696164eeb0d6c78cc948906ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Rek & Devine"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}