{"id": 726520, "slug": "gunslingers-unison", "name": "Gunslingers Unison.", "name_original": "Gunslingers Unison.", "description": "<li>Gunslingers Unison is a run and gun/beat´em up video game made by me in the Openbor engine, this is a prequel of another game called Cowboys Unison - Orchestra into the new horizon.<br/> </li><li>The game narrates the story of a Cowboy called Darius Schneider and his right hand Elise Whitefield in charge to pursue and take revenge from a dangerous outlaw called Revenant Joe, the responsible of raise undeads and destroy the hometown of Elise, Rothwell.<br/> </li><li>In the second game, the first mission is the final stage of this prequel (a la Castlevania Sotn) so in this game you must fight across 7 levels in order to takedown a series of dangerous enemies and find answers of the whereabouts of your nemesis.<br/> </li><li>The game focus in action and storytelling between stages and detailed cutscenes.<br/> </li><li>This game is a love-letter and homage to the first monocromatic Wonderswan handheld console and his father, Gunpei Yokoi.<br/> </li><li>This game was inspired by some classics and modern Western theme video games like: Sunset Riders, Gun.Smoke, Cowboys of Moo-mesa, Wanted, Outlaws, Wild Gunman and even the Red Dead Redemption franchise, Guns´n Spurs and a mobile game Called West Gunfighter.</li><li>The game contains certain material with copyright so the game must be shared only for free.<br/></li>", "metacritic": null, "released": "2022-01-23", "tba": false, "updated": "2022-01-24T06:25:22", "background_image": "https://media.rawg.io/media/screenshots/149/1490a02ebc780b4b8823336a6e46b18c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["Osman Color"], "genres": ["Action"], "publishers": [], "esrb_rating": null}