{"id": 72656, "slug": "dumb-ways-to-die-3-world-tour", "name": "Dumb Ways To Die 3: World Tour", "name_original": "Dumb Ways To Die 3: World Tour", "description": "Dumb Ways to Die brought you the dumb little Beans that the world fell in love with. Now it’s time for another dumbfounding adventure!<br/><br/>Help rebuild and keep the once great town of Dumbville safe, travel to the scorching deserts of Dumbgypt, hike to the frosty summits of Dumb Peak, and journey to the curious planet of Dumbtune and more in Dumb Ways to Die 3: World Tour!<br/><br/>Game Features:<br/><br/>• Get your tools ready to help make the Dumb World safe once again!<br/>• Collect and play as your favourite Beans!<br/>• Paint and decorate each Town however you see fit!<br/>• Collect crazy amounts of Tokens with Token Rush and Jackpot events!<br/>• Beware of dragons in Castle Catastrophe...<br/>• Ski down the steep, penguin-filled slopes of Dumb Peak...<br/>• Prepare food for a super smoothie in Culinary Chaos...<br/>• Explore the alien invaded shafts of a space station in Shuttle Shift...<br/>• Soar through the skies above Dumbville in a crazy plane flight...<br/>• Jump and surf through the mighty Pyramids of Dumbgypt...<br/>• Collect unique outfits for all the Beans!<br/>• Earn Tokens and special gifts with the new Daily Bonus! Play each day for greater rewards!<br/>• Do your best to keep the Beans alive! They're counting on you!<br/>• All this and more in Dumb Ways to Die 3: World Tour!", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2022-07-21T11:36:15", "background_image": "https://media.rawg.io/media/screenshots/3a7/3a77510e0f250c5b62457f5a4400319f.jpg", "website": "http://dumbwaystodie.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 133, "game_series_count": 3, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Metro Trains Melbourne", "Metro Trains"], "genres": ["Arcade", "Casual"], "publishers": ["Metro Trains Melbourne"], "esrb_rating": "Everyone 10+"}