{"id": 726620, "slug": "novaspiders-tower-defence", "name": "Novaspider's Tower Defence", "name_original": "Novaspider's Tower Defence", "description": "<p>Novaspider and his friends are ready to fight their enemies in a tower defense style!</p>\n<p>Link to Scratch game at the bottom of this description.</p>\n<p>POST MODS HERE: https://scratch.mit.edu/studios/30488677/</p>\n\n<p>                ---Enclosed Instruction Book---</p>\n<p>- Click a buy button (the big square with characters on it) to get a character.</p>\n<p>- If a button is dark, it means you don't have enough coins to afford it.</p>\n<p>- Click a tower (the characters you just bought), and a menu for the character will pop up. There you can sell the tower FOR coins, or upgrade the tower USING coins. If you get enough magic crystals, you can spend them on enhancing or spells.</p>\n<p>- The coin up there on the top right hand corner obviously tells you how much coins you have.</p>\n<p>- If an enemy crosses the path alive, you lose a Heart, you can see how much you have under the coins.</p>\n<p>- Magic is a new feature in the game. You get magic crystals by completing waves and defeating bosses. You can spend them in the magic shop to buy spells for defeating the enemies. Or you could use them to enhance your hero's. Click on a hero and next to the upgrade menu you can enhance them for a certain price. They will be able to shoot faster.</p>\n<p>!!!YOU CAN ONLY ENHANCE ONCE, DON'T DO IT TWICE!!!</p>\n<p>                                   --Tips--</p>\n<p>- Ewo is a good guard at the end.</p>\n<p>- Nova is good for attacking multiple enemies.</p>\n<p>- Officer Nano is a normal tower you can put anywhere.</p>\n<p>- Bluu is a cyborg who doesn't have the best range. Place him wisely!</p>\n<p>- Skye likes being in the rightmost places, as she has long range (she also helps with the \"boss\")</p>\n<p>- Abby is the 2nd most expensive and you can do whatever you want with her, she is OP.</p>\n<p>-Baby Steve is a powerful bit expensive fighter, he is truly OP!</p>\n<p>-Berks Boss Fight: having a ton of max level skyes and some abby's and baby steve's will help lower his health.</p>\n<p>                                         --Notes--</p>\n<p>-All of this can be done mobile as well.</p>\n<p>-The boss is hard to kill, try your best!</p>\n<p>                                      --Updates--</p>\n<p>-1.0 Released</p>\n<p>-1.1 Fixed impossible boss glitch</p>\n<p>-1.2 Fixed thumbnail glitch</p>\n<p>-1.3 Added early start wave wave (press S)</p>\n<p>-1.4 Title Change</p>\n<p>-1.5 Made Heart Boxes easier to get</p>\n<p>-1.6 Fixed Gruby sprite</p>\n<p>-1.7 Added Baby Steve Tower</p>\n<p>-1.8 Added +20 Waves +5 Enemies +4 locations and a new FINAL BOSS!</p>\n<p>-1.9 Added winner cloud var and improved the win/game over screen</p>\n<p>2.0 - Added Console (press C) new enemy, and ACHIEVEMENTS!</p>\n<p>-2.1 Added Magic Crystals, magic shop, spells, more cheats, and VIP!</p>\n<p>-2.2 Added Enhancing</p>\n<p>Try out the other versions:</p>\n<p>Novaspider's Tower Defence [UPDATED] on Scratch (mit.edu) (Scratch)<br/></p>\n<p>https://scratch.mit.edu/projects/575317926/ (Spooky)</p>\n<p>https://scratch.mit.edu/projects/453862689 (ExOnOe)</p>\n<p>https://scratch.mit.edu/projects/411587903 (Original)</p>", "metacritic": null, "released": "2022-01-22", "tba": false, "updated": "2022-01-24T06:49:56", "background_image": "https://media.rawg.io/media/screenshots/0a4/0a40d04d22f6ea7be0c76fb588775ed5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nova"], "genres": ["Action", "Adventure", "RPG", "Fighting"], "publishers": [], "esrb_rating": null}