{"id": 726703, "slug": "do-androids-dream-of-virtual-pet", "name": "Do Androids Dream Of Virtual Pet?", "name_original": "Do Androids Dream Of Virtual Pet?", "description": "Made for Virtual Pet Jam in a week plus a few days all by myself\r\n<br/>Welcome to this world of future, where you can do whatever you want*! and especially own a pet! \r\nHow to look for your animal\r\n<p>every animal need three things:</p>\n<ol><li>Some tasty meal from your favorite local shop</li><li>Medicine when it feels sick</li><li>And some attention from their owner</li></ol>\n<p>to fulfill it's needs you just press  button on left bottom corner accordingly your desired action</p>\r\nOh no! I'm out of food/meds! \r\n<p>Don't worry! Just visit* your favorite local shop and buy everything you need! </p>\r\nWhoops! Looks like I'm out money too! \r\n<p>No problem, my friend! Just visit* your lovely work with conveniently flexible schedule! And after that to forget about shopping!<br/>But be careful, there is some fishy version with free money! I know right! Insane! Don't download it just download a regular version</p>\r\nIs there any pitfalls? It's all just to good to be true! \r\n<p>Of course there is none!**<br/></p>\r\nJee, it's all so good but this is to much for me, I'm out energy! \r\n<p>Well, you can always do the boring old sleeping and waste yours and your animal time... or you could drink some GENERIC ENERGY DRINK FROM OUR TODAY'S SPONSOR GENERIC ENERGY COMPANY! ONLY 50$ FOR A CAN WHAT A BARGAIN!!</p>\r\nWow thank you! \r\n<p>Your welcome and thank you for choosing us as your virtual pet provider!<br/></p>\n<br/>* you are <strong>legally</strong> not allowed to do whatever you want and <em>especially</em> to go wherever you want. You are only allowed to leave your house for work or\\and for shop. You are not allowed to go off the route. Thank you for cooperation<br/>\r\n** our company do not bear any responsibility for unexpected animal deaths neither for unexpected leaving. <br/>", "metacritic": null, "released": "2022-01-22", "tba": false, "updated": "2022-01-24T07:10:51", "background_image": "https://media.rawg.io/media/screenshots/e22/e22f9124206f5f3eb2dc9d3fd615bafc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Android", "Web"], "developers": ["UL/DO"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}