{"id": 72686, "slug": "mahjong-treasure-quest", "name": "Mahjong Treasure Quest", "name_original": "Mahjong Treasure Quest", "description": "Explore an epic mix of original mahjong and exciting quests across the Magic Lands!  <br/> <br/>Mahjong Treasure Quest is not only about matching tiles. <br/><br/>For your unforgettable gaming experience we spiced it up with brain-teasing puzzles and fun riddles, exciting expeditions and challenging quests. <br/><br/>You'll never be alone: little Sophie and her loyal cat Oliver will lend color to your journey.<br/><br/>You're about to:<br/>•  Enjoy 2 000+ fascinating layouts;<br/>•  Solve captivating quests and puzzles;<br/>•  Clear your way from one land to another, getting rid of whimsical plants and building magic portals;<br/>•  Collect rare artefacts and gems;<br/>•  Restore and decorate your awe-inspiring family estate;<br/>•  Set free the enchanted cats;<br/>•  Have fun playing with your friends and family.<br/><br/>More features you’ll treasure:<br/>•  Regular game updates with new characters, levels, and quests;<br/>•  Special bonus levels, timed quests, exclusive tile sets;<br/>•  Amazing community and support;<br/>•  Ability to play offline without losing your progress.<br/><br/>--<br/><br/>Mahjong Treasure Quest offers you a paid subscription that guarantees unique gifts:<br/>•  An exclusive tile set with pictures of cute pets!<br/>•  A unique sticker pack featuring your favorite game’s heroine!<br/>•  Your lives in the game will restore 2 times faster!<br/><br/>You can try it all for free! Subscribe now with a trial period. After the 7 free days, your subscription will be automatically renewed, and a payment of $9.99 for the 1st month will be charged from your iTunes account. From then on the subscription will be automatically renewed every month, and the fee will be charged from your iTunes account upon confirmation of the purchase. Your iTunes account will be charged within 24 hours before the end of the current billing cycle, indicating the price of subscription renewal. The subscription will be renewed monthly until this feature is disabled by the user no later than 24 hours before the end of the current billing cycle.<br/><br/>The subscription is controlled by the user; its automatic renewal can be cancelled in the iTunes account settings. Cancellation within the current billing cycle is not possible.<br/><br/>Privacy Policy: http://vizor-games.com/documents/gdpr/pp_vizorapps.html<br/>Terms of Use: http://vizor-interactive.com/documents/mtq_mobile/mtq-eula-ios.html", "metacritic": null, "released": "2016-05-12", "tba": false, "updated": "2019-07-29T15:58:24", "background_image": "https://media.rawg.io/media/screenshots/d30/d30bccc177edfacc735376c213da25bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["VIZOR APPS"], "genres": ["Board Games", "Puzzle"], "publishers": ["VIZOR APPS"], "esrb_rating": "Everyone 10+"}