{"id": 7269, "slug": "subrats-classic", "name": "Subrats Classic", "name_original": "Subrats Classic", "description": "Can you save the New York rats? Classic best-seller with over 1 MILLION downloads! The No. 1 Free Action Game in 18 countries! Now completely revised with beautiful high resolution Retina graphics. And don&amp;#39;t miss the brand new level, Crazy Mode!<br/><br/>The New York rats are hungry - can you guide them to the tasty trash? Just touch and drag to guide the rats, but watch out for speedy passenger trains, puddles, rat poison, blackouts, and the vicious vacuum train. Keep an eye on the garbage trains to see what useful things they might drop. Prove that you can survive living on the edge under trains made from tons of steel. Sometimes pulling the emergency brake will be your only option to make it... <br/><br/>Subrats Classic is a lightning fast, funny, and highly addictive real-time action game for all ages. Don&amp;#39;t blame us if you miss your stop! <br/><br/>☆ Insanely addictive - easy to learn, hard to master!<br/>☆ Now perfect on an iPad!<br/>☆ Get to the top of 4 leaderboards!<br/>☆ Earn 29 Gamecenter achievements!<br/>☆ The only game that you can play with 10 fingers simultaneously!<br/>☆ Avoid 14 different trains!<br/>☆ Collect 10 different Power-Up items!<br/><br/>Visit us at www.whiteshoemedia.com for more. And become a test player, or email us with questions, comments, or suggestions at info@whiteshoemedia.com! <br/><br/>", "metacritic": null, "released": "2010-07-30", "tba": false, "updated": "2019-10-22T14:29:16", "background_image": "https://media.rawg.io/media/screenshots/85f/85fba0db897496600d99c82b0c157c44.jpeg", "website": "http://www.whiteshoemedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["White Shoe Media"], "genres": ["Action", "Arcade"], "publishers": ["White Shoe Media"], "esrb_rating": "Everyone 10+"}