{"id": 72720, "slug": "prize-claw-hd", "name": "Prize Claw HD", "name_original": "Prize Claw HD", "description": "Introducing PRIZE CLAW! HD. <br/><br/>For years, you've been going to arcades and carnivals, trading quarters for the chance to grab toys and candy with a motorized claw. Claw games are filled with tense moments of wondering if the claw will drop your prize, coupled with the triumph of finally receiving it! PRIZE CLAW recreates that experience for your iPhone while adding many exciting new features! <br/><br/>Step up to the machine and maneuver the claw to grab coins, gems, stuffed animals, cars, dolls, and so many more! This claw game is much more than the standard grabbing you get from arcade machines, however: PRIZE CLAW is filled with all sorts of unique items, powerful effects and challenging missions. Special gems grant you bonuses to enhance your collection power, and you can trade the prizes you collect for extra special bonuses. Tons of prizes aren't the only thing you can trade in: All the coins you collect can be spent to upgrade your claw, activate your unique powers and even customize your machine! If you run out of grabs, don't fret! It won't take long before you receive more. Keep checking back to complete your collection and unlock more stuff! <br/><br/>Features: <br/>- More than 60 prizes to collect! <br/>- Multiple machines to play on with different prizes, powers and looks! <br/>- A special puzzle to complete for each machine! <br/>- New 3D graphics with customizable machines, claws and joysticks! <br/>- Simple to play but with tons of missions to challenge your skills! <br/>- Earn more bonuses for playing every day! <br/>- Huge variety of bonuses and effects! <br/><br/>Check back for future updates! <br/><br/>Also try out the other Game Circus games like COIN DOZER, HORSE FRENZY", "metacritic": null, "released": "2011-08-30", "tba": false, "updated": "2019-07-29T13:57:10", "background_image": "https://media.rawg.io/media/screenshots/6cd/6cd8c96f1f8dca519b3eaf21a16a4b02.jpg", "website": "http://www.facebook.com/pages/Game-Circus/121175694606805", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Circus"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Game Circus"], "esrb_rating": null}