{"id": 727258, "slug": "clifffield", "name": "cliff&field", "name_original": "cliff&field", "description": "<strong>cliff&amp;field</strong> is an epic <strong>tower defence adventure</strong> that takes you on a <strong>fast-paced</strong>, <strong>atmospheric</strong> and <strong>bullet packed</strong> journey through the lands of Thirin as you try to defend your new kingdom from what seems to be an endless wave of monsters.<h3>A NEW WORLD TO DEFEND</h3>After discovering a hidden portal outside your town you’re transported to the land of Thirin where you play as the God-like leader who’s foretold to bring peace to the world of humans. You’ll wield powerful towers and weapons that you’ll get to upgrade and develop as you defend yourself and your newfound kingdom from what seems like sure demise. The force that brought you to these lands wants you to succeed and helps you reset time so that you can refine your tactics and always come out on top.<h3>UNLEASH YOUR MOST POWERFUL TOWERS</h3>This new world holds many secrets in its ingenious construction of towers. You’ll be able to upgrade 6 different towers with 15 different upgrades each, allowing for thousands of possible combinations of strategy to discover as you go.<h3>BUILT FOR REPLAYABILITY</h3>Every run is different in cliff&amp;field with things like randomness, critical hit chance, drops, and an ever evolving onslaught of enemy hordes that adapt to your playstyle. New surprises await each time you decide to defend your land and unlockable permanent upgrades will make even the harder levels manageble with your favourite strategy.<h3>NOTHING IS IMPOSSIBLE</h3>Permanent upgrades mean you don't have to be an expert player yourself to be able to experience all the story and the glory that awaits in defending your land. Although should you want to challenge yourself there’s several challenges awaiting and the possibility to play with or without permanent upgrades applied.", "metacritic": null, "released": "2022-01-21", "tba": false, "updated": "2022-03-07T03:23:23", "background_image": "https://media.rawg.io/media/screenshots/637/637206ab1fbcc00f494daa46c4af0ed5.jpg", "website": "http://cliffandfield.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["kamistudios", "Kami Ventures"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Kami Ventures"], "esrb_rating": null}