{"id": 72733, "slug": "skateboard-party-pro", "name": "Skateboard Party: Pro", "name_original": "Skateboard Party: Pro", "description": "Play with your friends using the multiplayer mode, complete achievements, gain experience and upgrade your skaters. Customize your outfits, shoes, board, trucks, wheels and bearings. Challenge skaters from all over the world using Game Center leaderboards. <br/><br/>Loaded with features, Skateboard Party is the best skateboarding game to hit the market. <br/><br/>CAREER MODE<br/>Complete over 30 achievements to unlock new items and locations. Gain experience to upgrade your favorite skater’s attributes to perform better and achieve higher scores. <br/><br/>FREE SKATE<br/>Practice and improve your skateboarding skills without any constraints. <br/><br/>MULTIPLAYER<br/>Challenge your friends to a skateboard duel and let’s see who can land the baddest tricks! Share and brag your results with your friends on Twitter. <br/><br/>MASSIVE SELECTION<br/>Select between 8 characters and customize each of them to your preference. From outfits to shoes, choose your favorite gear. A massive collection of boards, trucks, wheels and bearings are available including items from Airwalk, Powell &amp; Peralta, Bones, Tork Trux and Iron Fist Clothing.<br/><br/>LEARN TO SKATE<br/>Over 40 unique tricks to master and hundreds of combinations. Follow the tutorial to get started and progress as you go. Execute the craziest combos and trick sequences to rack up some impressive high scores, gain experience and make a name for yourself.<br/><br/>HIGH DEFINITION<br/>No other skateboarding game is available in HD. Skateboard Party includes next generation graphics specially optimized for your mobile hardware to provide you with the best skateboarding experience.<br/><br/>NEW CONTROLS<br/>New fully customizable control system; configure your own buttons layout and adjust the opacity. Use the right or left handed control mode, select a control preset or create your own. Use the analog stick or accelerometer option as you wish. Adjust your truck tightness to change your steering sensitivity. <br/><br/>LOADED WITH FEATURES<br/>•The only HD Skateboarding game available on the market. <br/>•Multiplayer mode to play against your friends using Wi-Fi &amp; Bluetooth.<br/>•New, fully customizable control system. You can adjust everything!<br/>•Learn over 40 unique tricks and create hundreds of combinations. <br/>•Massive skateboard locations to ride including a community center, a motel, a downtown plaza, a junkyard and an indoor skatepark.  <br/>•Customize your skater or board with tons of exclusive content including outfits, shoes, boards, trucks, wheels and bearings from licensed brands.<br/>•Play often to gain experience and upgrade your skater’s attributes. <br/>•Game Center enabled including 30 achievements and online leaderboards. <br/>•Share your results with your friends on Twitter. <br/>•Ability to listen to your own music library.<br/>•Soundtrack by Conditions &amp; Revolution Mother. <br/>•Ability to purchase experience points using in-app purchases.<br/>•Now supports English, French, German, Italian, Spanish, Portuguese, Korean and Chinese languages<br/> <br/><br/>SUPPORT: http://www.maplemedia.io/", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-29T16:10:50", "background_image": "https://media.rawg.io/media/screenshots/4c6/4c69364d9571e80da85dc4a461440bd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Maple Media Holdings"], "genres": ["Simulation", "Sports"], "publishers": ["Maple Media Holdings"], "esrb_rating": null}