{"id": 727362, "slug": "blown-away-2", "name": "Blown Away", "name_original": "Blown Away", "description": "Blown away is a singleplayer explorer game filled with puzzles, obstacles and hidden locations. The game takes place in a civilization called Yhorba influenced by bubbles. One day the machine that provides the protective bubble around the island breaks down. This caused the island to fall down and crash on the abandoned planet underneath. Your goal is to repair the machine to restore the protective bubble. To do so you must find the mechanical parts that are scattered around the abandoned planet. By solving puzzles, overcoming obstacles and explore hidden areas, the main character can locate these mechanical parts.<br/><br/><ul><li><strong>Meet Mylo!</strong><br/>Mylo is our hero, he is the engineer of the city. He's tasked with repairing the bubble machine, so the island can float back to safety. </li></ul><br/><ul><li><strong>Explore the world of Yhorba</strong><br/>Let's take you with us to a new world ready to explore for all of you. The world of Yhorba is surrounded by beautiful and colorful forests and soothing lakes. In Yhorba you will come to peace. But beware for the shadows and everything that lurks within them. </li></ul><br/><ul><li><strong>A unique weapon.</strong><br/>Have you ever heard of a hurdy gurdy? Well you have now! A hurdy gurdy is a string instrument that provides a soothing and unique sound. This instrument has been modified into your own bubble weapon. Get to know your own special weapon and it's rich sounds.</li></ul><br/><ul><li><strong>Pick up your controller.</strong><br/>You can play this game either on your keyboard and with a mouse but for the full experience you can try out Blown Away with a controller.</li></ul><br/><ul><li><strong>And last but not least..</strong><br/>Have fun exploring the world of Yhorba and let Mylo take you on an adventure of a lifetime. </li></ul>", "metacritic": null, "released": "2022-01-24", "tba": false, "updated": "2022-01-28T03:13:06", "background_image": "https://media.rawg.io/media/screenshots/955/955795ee2db7fa8502aac329da86ba99.jpg", "website": "https://wokkel.studio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Studio Wokkel"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Studio Wokkel"], "esrb_rating": null}