{"id": 727354, "slug": "mess-adventures-2", "name": "Mess Adventures 2", "name_original": "Mess Adventures 2", "description": "The beauty Linda has been abducted by Mr. Strong AGAIN!  For rescuing her, our Mess starts his new journey of pain…<br/><br/>However, when our Mess is being bulled by Mr. Strong, a new stronger enemy appears, and abducts her from Mr. Strong.  How would Mess and Mr. Strong do to their common foe?<br/><br/>Mess Adventures 2 remains the style of nonsense, and keeps the same game experience as previous that would let all of you fiery guys show off your personalities, and give you the chance to purchase the new better mouse and keyboard.  It is better to be recommend to any friends who are expected to be fooled, live broadcast, and even entertain yourself.<br/><br/>This game is currently available on Steam ONLY.  <br/><br/><strong><h3>More miraculous converting</h3></strong>This game remains the 2D and 3D dimensions and the shifting of gravity, and also adds new bricks for converting to the horizontal version and the first-person pronoun.  Let’s starts this unprecedented and wonderful journey in this scene that includes three different convertings!<br/><strong><h3>More plentiful genres</h3></strong>Besides the mode of continuing adventures, a lot more new wonderful modes are added in this game.  You wouldn’t miss this chance!<br/><strong><h3>More painful traps</h3></strong>A lot more new traps hook-ups are added.  If you are at the end of patience, it would be fine, and you are allowed to hit the handsome developer!<br/><strong><h3>More nonsense puzzles</h3></strong>Many of puzzles seems nonsense but there are actually clues out there.  When you think you can’t pass, try breaking the rules and do something unbelievable!<br/><strong><h3>More weird rules</h3></strong>In the level of “Sokobans”, you still needs to redefine the rule and make a new one for getting pass.  Beyond this, a lot more unexpected things are waiting for you!<br/><strong><h3>More shocking death</h3></strong>There’re still many diverse and shocking ways of death.<br/><strong><h3>More nice original music</h3></strong>The music in this game is still composed by producer YuZixi that would bring you guys a better game experience.<br/><strong><h3>More custom achievements</h3></strong>There are three custom achievements.  Show them to your friends and let them be in green with envy!  First come first served!  You wouldn't miss the chance!  (btw, you don't need to climb up anymore...)<br/><br/><br/><strong>If you would like to see how that Mr Strong in “Mess Adventures” is beaten, do not hesitate and get yourself start!  Which man will beautiful Linda chose?</strong>", "metacritic": null, "released": "2022-01-25", "tba": false, "updated": "2022-12-08T18:37:46", "background_image": "https://media.rawg.io/media/screenshots/7c8/7c8a237762435c17f4d23a72411a68dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Marvelous Games"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Marvelous Games"], "esrb_rating": null}