{"id": 727409, "slug": "gekko-episode-of-minato", "name": "Gekko Episode of Minato", "name_original": "Gekko Episode of Minato", "description": "<strong>■ What is Gekko?</strong><br/>Gekko is the stage where swords, machines and ponytails appear in modern society.<br/>A school romantic comedy visual novel that depicts an exciting love pattern with five heroines.<br/>This work is the first in the Gekko series, and you can enjoy the cool and stoic story of \"Minato\".<br/><br/><br/><strong>■ Story</strong><br/>Time is modern.<br/>The largest machine product company \"Imperial Heavy Industries\"<br/>Monopolize the share of \"Automata\"<br/>Demand was spreading not only to industry but also to ordinary households.<br/><br/>High school student \"Yuto\" who attends \"Seioh High School\"<br/>Unfortunately, he gets caught up in an automata runaway incident, but after a short break, the third-generation automata \"Nova\" saves his life.<br/><br/>The hideout was taken to \"Nova\" as it was, and \"Yuto\" was assigned a serious task.<br/><br/><br/>―――― Become a lover with 5 school idols to defeat \"Mugen Tukuyomi\".<br/><br/>\"Yuto\" is his buddy \"Nova\",<br/>He started the operation to become a heroine and a lover with the operation staff \"Kageyama\".<br/><br/>This time the target is<br/>The cool and stoic Seioh High School student council president \"Minato\" has earned the tremendous trust of his students.<br/>At first glance she's a perfect honor student<br/>She actually seems to have a secret that no one knows ...<br/><br/><strong>■ Features</strong><br/>・ Unique and cute characters<br/>・ A story of laughter, tears, and excitement<br/>・ Visual novel that can be enjoyed casually without choice<br/>・ Play time 3-4 hours<br/>・ Only mouse operation is supported", "metacritic": null, "released": "2022-01-25", "tba": false, "updated": "2022-01-28T03:43:41", "background_image": "https://media.rawg.io/media/screenshots/778/7782f781f2cd526f47fc286708d698b9.jpg", "website": "http://iron-sword.sakura.ne.jp/gekko-minato/index.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["あいあんそぉど"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["あいあんそぉど"], "esrb_rating": null}