{"id": 72742, "slug": "solitaire-jam", "name": "Solitaire Jam", "name_original": "Solitaire Jam", "description": "Welcome to Solitaire Jam! We've shuffled the deck on this classic Solitaire card game, also known as Klondike.<br/> <br/>Solitaire Jam brings a new spin to the classic card game, now with updated themes, special challenges, and more! Are you ready for a challenge? Top the leaderboards to show your friends who's the king of this Klondike card classic! <br/> <br/>This is a free to play card game with endless fun and challenges! Play Solitaire Jam today!<br/> <br/>Features:<br/> Classic Solitaire gameplay- it’s addictive and fun! <br/> Solitaire draw 1 cards <br/> Solitaire draw 3 cards<br/> Enjoy the challenging Vegas mode! Vegas fans will love this version of Solitaire! <br/> Daily challenges to keep things fun, fresh, and entertaining! <br/> Play your Solitaire cards right to unlock special background themes and music!<br/> Challenge yourself, beat your personal best score and top the Solitaire leaderboards! This classic Klondike game is addicting! <br/> Play some of your favorite classic Jam City themes: Genies &amp; Gems, Panda Pop, and Juice Jam! <br/> Cool win animations and new win effects! Keep playing Solitaire Jam to Unlock special effects as you win! <br/> Solitaire Jam is available now in your favorite languages including: English, French, Italian, German, Spanish, Japanese, and Chinese Traditional with more to come! Come play! It’s the classic game everyone loves! Challenge yourself and play now! <br/> <br/>Here are what some of our fans have had to say about Solitaire Jam! <br/> I love solitaire, this one is fun.<br/> Solitaire Jam is so awesome and amazing.<br/> Best solitaire game I've ever played.All the others are boring.<br/> Fun version of Solitaire with a lot of unlocks.<br/> Best solitaire ever!<br/> Really like this game. Good challenge and great gameplay.<br/> <br/>It’s Simple, Win Big and Play Solitaire Jam Today! <br/> <br/>If you’re a fan of Solitaire Jam, be sure to do the following: <br/>LIKE: On Facebook to get the latest news and rewards!<br/>FOLLOW: @solitairejam<br/> <br/>www.jamcity.com/privacy<br/> <br/>DEVELOPER INFO: Jam City is the leading developer in truly cross-platform social gaming! Chart-topping hits include Cookie Jam, Sugar Smash: Book of Life, Juice Jam, Genies &amp; Gems, and so many more! Love Solitaire Jam? Check out our other games! We specialize in free match 3 puzzle games! Begin your adventure on one of our free match three puzzle games today!", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2019-10-22T14:25:24", "background_image": "https://media.rawg.io/media/screenshots/581/5819091631d7a1d754c7754029492f31.jpg", "website": "http://www.jamcity.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jam City"], "genres": ["Card"], "publishers": ["Jam City"], "esrb_rating": "Everyone 10+"}