{"id": 727452, "slug": "gunvolt-chronicles-luminous-avenger-ix-2", "name": "Gunvolt Chronicles: Luminous Avenger iX 2", "name_original": "Gunvolt Chronicles: Luminous Avenger iX 2", "description": "<p>Break into the new apeX of 2D action!<br />\nLuminous Avenger iX 2 takes the series&#39; original speedy and stylish 2D action gameplay to the next level as Copen rips through enemies with his new &quot;Break-Shift&quot; form. His new destructive capabilities makes the high-speed action more satisfying than ever!<br />\nINTI CREATES is proud to present new apeX of cutting-edge 2D action with Luminous Avenger iX 2!<br />\n●2D action that breaks new ground!<br />\nWith his new spinning blade weapon, the Razor Wheel, Copen rips through any enemy standing in his way as he traverses an enormous tower. A wide variety of stages with powerful boss characters lurking in them await him.<br />\nCopen earns a new EX Weapon for his arsenal whenever he defeats a boss. He uses these weapons to target enemies&#39; weak points to bring them down faster; a key strategy to clearing stages and ascending the tower quickly.<br />\nCopen&#39;s Bullit Dash that allows him to fly freely through the air has also been powered up! Super-stylish maneuvers reward those who master the Bullit Dash&#39;s high-speed capabilities!<br />\n●Tear through your enemies at break-neck speed!<br />\nCopen takes on all challenges by changing seamlessly between his two forms: the power-focused &quot;Break-Shift&quot; and the speed-enhanced &quot;Bullit-Shift.&quot;<br />\nCrush your enemies in Break-Shift to bank points and activate Overdrive!<br />\nIn Overdrive, Copen can stay in Bullit-Shift mode longer, allowing him to zip through the air at high speed.<br />\n●The &quot;Muse of Hope&quot; Lola is lovelier than ever! Her songs really light up the stage!<br />\nWhen Copen&#39;s HP hits 0, Lola can transform and activate her Anthem skill to bring Copen back to life using the power of song.<br />\nShe brings that recovery power to the frontlines in Luminous Avenger iX 2 with her newest and cutest form yet: Healing Mode!<br />\nThis powerful new ability heals Copen to full HP at any time, anywhere, and as often as he likes...with no cost!<br />\nBuild up over 1000 Kudos points and Lola will really heat up the battle with her song!<br />\n●An intense standalone story!<br />\nLuminous Avenger iX 2 is set in a parallel world where a dystopic story unfolds in a ruined desert wasteland where only robots exist.<br />\nCharacters both familiar and new come together for this exciting story, featuring English voiceover for the very first time in the entire Gunvolt series!<br />\nEnglish Voiceover Cast<br />\nCopen: Alejandro Saab<br />\nLola: Cassandra Lee Morris<br />\nKohaku: Kira Buckland<br />\nNull: Natalie Rose Hoover<br />\nDacite: Connor Colquhoun<br />\nVespa: Brittany Cox<br />\nAutochrome: Daman Mills<br />\nBrigade: Steve &quot;Warky&quot; Nunez<br />\nHail: Jennifer Losi<br />\nAce: Arin Hanson<br />\nNarrator: Matt Papa<br />\nJapanese Voiceover Cast<br />\nCopen: Yuma Uchida<br />\nLola: Mayu Mineda<br />\nKohaku: Yumiri Hanamori<br />\nNull: Sumire Morohoshi<br />\nDacite: Shunsuke Todo<br />\nVespa: Akane Fujita<br />\nAutochrome: Takuya Sato<br />\nBrigade: Yoshitaka Yamaya<br />\nHail: Akira Sekine<br />\nAce: Makoto Furukawa<br />\nNarrator: Takahiro Kageyama</p>", "metacritic": null, "released": "2022-01-27", "tba": false, "updated": "2023-11-27T11:19:18", "background_image": "https://media.rawg.io/media/screenshots/6dc/6dce89148a98b50be2723743c3f1c979.jpg", "website": "http://gunvolt.com/en/X2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 14, "beaten": 3, "toplay": 4}, "playtime": 8, "achievements_count": 22, "ratings_count": 2, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Nintendo Switch"], "developers": ["Inti Creates"], "genres": ["Action"], "publishers": ["Inti Creates"], "esrb_rating": null}