{"id": 72747, "slug": "deer-hunter-2018", "name": "Deer Hunter 2018", "name_original": "Deer Hunter 2018", "description": "From the creators of Deer Hunter 2014! Return to the wild and hunt across the globe in the world’s greatest hunting experience.<br/><br/>HUNT AROUND THE WORLD<br/>Pursue trophies in unique and beautiful locations that span the globe from Alaska to Zimbabwe.<br/><br/>BAG BIG GAME ANIMALS<br/>Hunt animals so real they nearly jump off the screen! Track down and bag the world’s most exotic and elusive game.<br/><br/>SHOOT LIKE A PRO<br/>Develop a steady hand, line up your sights, and master the skills to take the perfect shot.<br/><br/>GET THEM BEFORE THEY GET YOU<br/>Take down predators before you become the prey.<br/><br/>BUILD YOUR ARSENAL<br/>Collect and customize your firearms with scopes, magazines, barrels, and stocks as you perfect your weapons for each hunt.<br/><br/>It’s Open Season - join the hunt today!<br/><br/>Auto-renewable Subscription Information (“Subscription Terms”):<br/> <br/>Deer Hunter 2018 now includes subscriptions. These are available in a variety of prices and subscription periods:<br/>• Silver: $0.99USD / week (or local equivalent); $1.99USD / month (or local equivalent)<br/>• Gold: $1.99USD / week (or local equivalent); $4.99USD / month (or local equivalent); $12.99USD / 3 months (or local equivalent); $19.99USD / 6 months (or local equivalent)<br/> <br/>Subscriptions are available via in app purchase. Subscriptions will automatically renew at the applicable subscription price at the end of the subscription period until you cancel your subscription. Payment for the subscription period you selected will be charged to your iTunes account within 24-hours prior to the end of the current subscription period. You can cancel your subscription at any time by accessing  your iTunes Account Settings and selecting to cancel your subscription. After canceling, you will be responsible for paying the subscription fee for the current active applicable subscription period.<br/> <br/>Here are the links to our privacy policy and terms of service:<br/>Privacy Policy: http://www.glu.com/privacy<br/>Terms of use: http://www.glu.com/terms<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com/privacy<br/>- If you have a problem with this game, please use the game’s “Help” feature.", "metacritic": null, "released": "2015-09-15", "tba": false, "updated": "2019-07-31T00:15:51", "background_image": "https://media.rawg.io/media/screenshots/d8a/d8af2855f058c8e62e3213d76850bf6b.jpg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Glu", "Glu Games"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["Glu Games"], "esrb_rating": null}