{"id": 72757, "slug": "pumpkin-jack", "name": "Pumpkin Jack", "name_original": "Pumpkin Jack", "description": "<p>Dive into an Epic Adventure and help the Evil annihilate the Good!<br />\nFollow the will of the Devil himself and slay your nemesis in an epic quest that will take you on a journey in the Boredom Kingdom, a mythical realm shattered by the Curse. You will meet friends along the way, from a haughty Owl to a snarky Crow!Discover Stunning atmospheres in a Colorful yet Spooky Scary Kingdom<br />\nTravel through epic and dramatic settings, with each level having its own eerie atmosphere. Using a vibrant palette and high quality lighting effects, Pumpkin Jack invents its own unique cartoon universe inspired by the classic PS2 graphic style.Jump, Run &amp; Climb to carve your own way in Unique Levels<br />\nPumpkin Jack is a classic 3D Platformer before anything else! Every level will challenge you through several themed platforms, all giving you new trials to complete.Fight for your life against Evil Beasts by using awesome Unlockable Weapons<br />\nYou will have to master the arts of dodging, timing and movement to vanquish Jack&#39;s foes. During the dynamic real time battles, choose which weapon you want to use and strike at the critical moment!Face Breathtaking Challenges and discover tons of Original Gameplays<br />\nSolve puzzles that focus on physics, gravity and reflection. Inhabit a pumpkin head and burn books, hammer some moles, create a path for magic spheres… But also more! In each level, you will be faced with an action sequence using a new exclusive gameplay!</p>", "metacritic": 76, "released": "2020-10-23", "tba": false, "updated": "2023-11-22T16:15:17", "background_image": "https://media.rawg.io/media/screenshots/f97/f97acf7431517d53cc0abd7d68477c3c.jpg", "website": "http://www.pumpkin-jack.com/", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 39, "owned": 735, "beaten": 39, "toplay": 40, "dropped": 12, "playing": 3}, "playtime": 3, "achievements_count": 161, "ratings_count": 47, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 48, "platforms": ["PlayStation 5", "Xbox Series S/X", "PC", "Nintendo Switch", "PlayStation 4", "Xbox One"], "developers": ["NicolasMey", "Nicolas Meyssonnier"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Headup Games", "Nicolas Meyssonnier"], "esrb_rating": null}