{"id": 727542, "slug": "endless-funner", "name": "Endless Funner", "name_original": "Endless Funner", "description": "<p>Endless Funner is a pixel art endless runner. Jump over incoming snowmen and kids that are playing in the snow. But beware! Do not touch any of them as they will ruin your fun in the snow in an instance!</p>\n\n<p>This game was submitted to the \"Improve My Game Jam 19\" and comes with a develog, showing the improvement of a previous project.</p>\n\n<p>December 2021</p>\n\n<p>Last year I tried to make an endless runner game with zero experience whatsoever. Starting from zero with just basic understanding of Unity and some scripts that didn't match the task. It ended up being a jump and run game with a nice moving parallax effect but nothing more. I put it aside for later.</p>\n\n<p>January 2022</p>\n<p>Roughly a month passed by and I was thinking about participating in a game jam and found the \"Improve My Game Jam 19\". As I wanted to make the endless runner work, I joined the jam and opened my project once more.<br/></p>\n<p>Seeing that the whole mechanics wouldn't work for this title, I started from scratch, this time with Bolt, changing the whole gameplay and its mechanics. </p>\n\n<p>I created an object spawner and collector and combined it with a simple UI score count. I added different obstacles with different speeds, as well as a jump button to utilize on any platform.</p>\n\n<p>Afterwards I created a menu and added music and sounds.</p>\n\n<p>Looks good so far. For the future I plan a (working) web version of the game, different level designs as well as choosable levels of difficulty. </p>\n\n<br/>\n<p>Have fun! </p>", "metacritic": null, "released": "2022-01-27", "tba": false, "updated": "2022-01-28T04:42:51", "background_image": "https://media.rawg.io/media/screenshots/5b6/5b65798457caac98b5fbaad558168721.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Copypat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}