{"id": 727557, "slug": "blocks-vr", "name": "Blocks (VR)", "name_original": "Blocks (VR)", "description": "<p>- Co-Director</p>\n<p>- Lead Game Design</p>\n<p>- Co-Programming Lead</p>\n<p>- Lead Audio Design</p>\n<p>- Lead Narrative Design</p>\n<p>Blocks is a VR interactive narrative experience about an installation artist who has lost his will and ability to create after the death of his father. Desperate to create again for an upcoming show, players enter the mind of the artist to rebuild his fractured imagination. Blocks aims to deliver an immersive experience that maximizes the potential of home VR. This is the first Up Above Studio production, experimenting with new approaches in narrative, audio, spatial and interaction design in Virtual Reality. Blocks is inspired by Gaspar Noe's \"Enter the Void,\" minimalist artworks by Doug Wheeler, and Ninja Theory's Hellblade: Senua's Sacrifice. <br/></p>\n<p>Blocks is a stationary experience that utilizes performative gestures as its core mechanics. User's body performance is designed to correlate with the emotional arc of our protagonist. The first level, Anger, tasks players with swinging their arms to control hundreds of triangles. The actions taken by the player are a byproduct of the stress/anger felt by the protagonist. The second level, Hope, has players discover hope by lighting up the darkness. Players help the protagonist come to terms with the loss of his father. Blocks is about finding light in the darkest of moments. We sought to tell a story that teaches us no emotion is permanent, and no feeling is final. \r\n</p>", "metacritic": null, "released": "2022-01-27", "tba": false, "updated": "2022-01-28T04:46:24", "background_image": "https://media.rawg.io/media/screenshots/bff/bff7fb5d28e67d8c2db9bd92be4257c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AdamMorina"], "genres": [], "publishers": [], "esrb_rating": null}