{"id": 7278, "slug": "rpg-revenant-saga", "name": "RPG Revenant Saga", "name_original": "RPG Revenant Saga", "description": "SPECIAL PRICE<br/>50% OFF(USD 7.99 -&amp;gt; USD 3.99)!!!<br/><br/>Become a Revenant and find the truth beyond revenge in this RPG with 3D battles!<br/><br/>Brand new, comes Revenant Saga, a gothic fantasy RPG! Boasting a story that blurs the lines between good and evil, a refined 3D battle system, and plenty of content to go around, this is one title not to be missed!<br/><br/>[A Quest for Revenge]<br/>After being turned into an immortal being known as a &amp;quot;Revenant&amp;quot; and learning of the existence of a demon within him, Albert sets out on a journey to make the person who did this to him pay with their very life. However, as he runs into others along the way dealing with their own figurative demons, what is the answer he finds...?<br/><br/>[Transform and Lay Waste to the Enemy!]<br/>By transforming in battle, party members can change their looks, increase their parameters, and crush the enemy using specialized skills.<br/>However, there are also disadvantages associated with this:<br/>×HP cannot be restored<br/>×Cannot revive if swoon<br/>×Overuse results in going berserk<br/><br/>[Customize Weapons!]<br/>With the level cap for weapons at 999 and up to 4 assignable effects for each weapon, tinkering has never been this fun! As for how and what weapon players chooses to customize, it is entirely up to them! Weapon effects can be set up to reflect players&amp;#39; unique battle styles!<br/>*The stronger the enemy defeated, the greater chance rare weapons will be dropped!<br/><br/>[Plenty to Keep Players Engaged]<br/>1. Powerful equipment with a catch, but when combined in the right way boost fighting capabilities into the stratosphere! <br/>2. Record keepers give the party valuable rewards for earning trophies, but do you as the player have what it takes to collect them all?<br/>3. Once the game has been completed, the party can then challenge even more powerful monsters!<br/><br/>[Basic Game Information]<br/>- Available difficulty levels: Easy, Normal &amp;amp; Hard<br/>- Battle party members: 4<br/>- Character swapping: No<br/>- Maximum level: 999<br/>- Equipment slots: 4 (Weapon, armor &amp;amp; accessory x2)<br/>- Save slots: 3<br/>- After-game content: Yes<br/>- Voice: No<br/>- In-game transactions: Yes<br/><br/>*This game features some in-app-purchase content. While in-app-purchase content requires additional fees, it is not necessary for finishing the game.<br/>*The actual price might differ depending on the region.", "metacritic": null, "released": "2014-12-18", "tba": false, "updated": "2019-08-02T03:28:24", "background_image": "https://media.rawg.io/media/screenshots/aa8/aa8303f7c29f2d8b85e40f756b465229.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": "Everyone 10+"}