{"id": 728038, "slug": "replacement-lovers-demo", "name": "Replacement Lover(s) [Demo]", "name_original": "Replacement Lover(s) [Demo]", "description": "<p>Kenta Ichinose is the lucky recipient of enough funding to cover the last half-year of his highschool education... provided he transfers to an <em>all girls'</em> school! Could this be his chance to get a cute girlfriend?</p>\n<p>Well... as it turns out, no. Absolutely not. Better luck next time!</p>\n<p>...</p>\n<p><em>Chiaki </em>Ichinose, an 18-year-old, no-nonsense lesbian who could really use a nap, is the \"lucky\" recipient of enough funding to cover the last half-year of her highschool education... provided she transfers to a new school. There, she meets a cast of colorful characters who suddenly find themselves a little bit out of their depths when confronted with some unexpected feelings for the replacement protagonist.<br/></p>\n<p>A sometimes silly, sometimes serious, sometimes cozy, and sometimes painful story of lesbian romance is about to begin... with or without its original protagonist. Will these friendships and potential romances last beyond graduation and into college? Hang in there, Chiaki!</p>\n<p>[Character profiles and such coming soon]</p>\n<p><strong>Made in Ren'Py</strong></p>\n<p><strong>The demo version includes around 25k words (that's somewhere around 2-4 hours of reading, depending on how many of the choice branches you explore), and the final version will be over 100k words (over 80k of which are already written). The full release will probably be around $6-8.</strong></p>\n<p><strong>I don't have a Mac to test that version of the game on, so do let me know if you run into any issues with it, and I'll... see what I can do, I guess!</strong></p>\n<p><strong>This VN is, for the most part, a just-for-fun side project, and probably won't be my #1 priority for a while. However, if you're interested in seeing occasional progress updates for this or any other games I'm working on, check out these links:</strong></p>\n<p>Writer/Artist's Twitter<br/></p>\n<p>FireLily Games Discord</p>", "metacritic": null, "released": "2022-01-26", "tba": false, "updated": "2022-01-28T06:36:32", "background_image": "https://media.rawg.io/media/screenshots/9ca/9ca6b403ede5165a84d3454196e68f2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Firecat1311"], "genres": [], "publishers": [], "esrb_rating": null}