{"id": 728198, "slug": "slimy-courage", "name": "Slimy Courage", "name_original": "Slimy Courage", "description": "<p>Awoken from slumber through a strange noise you seek out to find the Source, lead by your fear for a fate where, if not pursued can lead to even greater danger. But Fate has already spon a new thread of fate. </p>\n<p>Unaware through your long sleep, the right to call the cave your solely home has been forfeited. Because Spider's have claimed it as their nesting Lair. To take a single hit corresponds for you, as a slime, the weakest species with immidiate death. Seek advantage in places to hide and then sneek by them unnoticed and find the way out of the cave. Keep going, even if the path becomes difficult. </p>\n<p>This Adventure will require braveness, but not just of any sort. <br/>Successful will only be those, who's Soul is filled with: </p>\n<p>Slimy Courage!</p>\n\n<p>Observe you environment throughly and maybe you will be lucky in finding the secret in each Level (Not in the Tutorial). And as to what they are, I can offer a slight hint:</p>\n<p>One you might like to visit but in the near future.</p>\n<p>One will help you just once in overcoming an awaiting danger.</p>\n<p>And one I recommend to help out after your escape from here, in his own little adventure where up and down may or may not be reversed.</p>\n<p>That is all. I hope you have fun with this short game!</p>\n\n<p>For now the Game is only available for Windows PC's (Mac and Linux Support are soon to come), but has full Controller Support.<br/>To play just download the file, unpack it and start the  .exe!</p>", "metacritic": null, "released": "2022-01-26", "tba": false, "updated": "2022-01-28T07:15:23", "background_image": "https://media.rawg.io/media/screenshots/6cc/6cca1a4a3b2cdf37cc86af6449099a6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NanoArk."], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}