{"id": 72825, "slug": "unblock-me-premium", "name": "Unblock Me Premium", "name_original": "Unblock Me Premium", "description": "Relax and start your brain workout with this smart and addictive puzzle game. Exercise your mind with more than 18000 unique puzzles, the highest amount of puzzles you'll find in any game! With many Million downloads already, you can't go wrong with this super addictive puzzle game.<br/><br/>Unblock Me is a fun and addictive puzzle game. The goal is to unblock the red block out of the board by sliding the other blocks out of the way, unblock it with the minimal moves. Unblock Me comes with 5 difficulties ranging from Starter Pack to Expert. There are more than 18000 puzzles in total, worth hundreds of hours to keep you challenged and addicted.<br/><br/>With 4 game modes in Unblock Me, you can challenge yourself by finding the best solution or choose just to lay back and relax while solving your puzzles. In Challenge mode each puzzles has 3 stars to earn, adding its replay value so you can always try to get all 3 star in every puzzle. A ranking system and achievements are also added to keep you even more challenged.<br/><br/>Unblock Me have been used in many schools to help improve students with their studies in classes. Unblock Me can help you train your brain and keep you mentally fit every day. It has been one of the top free games for 4 years and has created the category of Unblock puzzle games where others follow. This puzzle game is great for kids and adult of all ages, play by yourself or challenge your buddies to compare your moves. Line up and have fun with your buddy :)<br/><br/>Features:<br/>* Multiplayer Mode - Play Unblock Me competing with your friends or fellow Unblockers from around the world<br/>* Daily Puzzles - Up your Unblock Me game with super challenging daily puzzles with 100 initial puzzles and  get 1 more puzzle every day you play the game<br/>* Daily Rewards - Need more hints? No problem, earn up to 2 hints every day by opening Unblock Me<br/>* Sync or Transfer Game Progress between devices using the same iCloud Account<br/>* 5 difficulties ranging from Starter to Expert<br/>* More than 18000 of Unblock puzzles in total for you to enjoy, it will be a long saga to complete all the addictive puzzles<br/>* 2 game modes, Relax Mode and Challenge Mode<br/>* Ranking system to keep you more challenged and up to find the best solution<br/>* 21 Achievements, try to collect all the achievements<br/>* Keep track of all the puzzles you've solved<br/>* Hint system that will guide you through the puzzle<br/>* In-App purchase so you can buy more hints when you need them<br/>* Undo system<br/><br/>If you would like to see this app translated into your language, please email us.<br/><br/>Support and Feedback:<br/>If you have any technical problems, please email us at support@kiragames.com.<br/>Please include the app's version, your device information, and a screenshot if possible.<br/>The more information that you provide to us, the better we can serve you and crush any bugs that may exist. <br/>Thank you. :) <br/><br/>Follow us on TWITTER!<br/>@kiragames<br/>http://twitter.com/kiragames<br/><br/>Like us on FACEBOOK!<br/>http://facebook.com/kiragames<br/><br/>For more information, visit us!<br/>http://www.kiragames.com", "metacritic": null, "released": "2009-05-16", "tba": false, "updated": "2019-08-02T05:04:15", "background_image": "https://media.rawg.io/media/screenshots/863/86381d420af7c1e9ba2f61a289129063.jpg", "website": "http://www.kiragames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Kiragames Co"], "genres": ["Board Games", "Puzzle"], "publishers": ["Kiragames Co"], "esrb_rating": null}