{"id": 728239, "slug": "metroid-adventure-of-samus", "name": "Metroid: Adventure of Samus", "name_original": "Metroid: Adventure of Samus", "description": "<p>Not many people know this, even at the Galactic Federation, but Samus had an unoficial secret mission taking place between Metroid and Metroid 2: Return of Samus and wasn't related with Prime. Right after the first defeat of Mother Brain at Zebes and the explosion of Tourian, Ridley managed to escape taking advante of the situation and took some Metroids with himself. As soon as the relentless famous bounty hunter knew that chased him looking for vengeance, but mostly because Samus had a reputation to mantain.</p>\n<p>Discover a whole new place in Zebes, this time in never seen in the series top-down with 8 directions movement. Everything with stereo 8 bit sound! Explore, solve some environment puzzles, find the Metroids and fight for vengeance in this never seen before adventure outside of Japan until now. This is also the first time Samus actually speaks in a game!</p>\r\nControls\r\nActionKeyboardGamepad (Xbox gamepad configuration)MoveA, W, S, D<br/>Arrow Left, Arrow Up, Arrow Down, Arrow Right D-Pad<br/>Left stick<br/>Action/Shoot/BombControlASwitch MisileSpaceSelectSwitch MorphballShiftBPauseIntroStart\r\nWarning\r\n<p>Since this game was meant to be a personal project and a joke, there are some fake features, like the main menu with game slots that actually do nothing but starting the game (there are no save rooms). Even if this project is not meant to continue, if you find any game breaking bug feel free to let me know.</p>", "metacritic": null, "released": "2022-01-26", "tba": false, "updated": "2022-08-23T19:02:56", "background_image": "https://media.rawg.io/media/screenshots/46c/46c23abf7547112ab04cf505db9ddde5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Cal Aran"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}