{"id": 728433, "slug": "sky-sky-panic-regrowth-game-jam", "name": "Sky Sky Panic Re:Growth (Game Jam)", "name_original": "Sky Sky Panic Re:Growth (Game Jam)", "description": "\n<p>You are establishing a human settlement on a barren world. Thankfully the resources you need to grow lush plantlife are falling from the sky! Catch only the correct stars based on your ship's current color, and turn this rocky ball into a verdant paradise!</p>\n<p><strong>Rules and Controls</strong>\n</p>\n<p>Simply move your ship left and right by moving your mouse cursor on screen. In menus, press the left mouse button to make selections.\r\n</p>\n<p>During gameplay, stars of five different colors will fall from the sky. Collect the ones that match the color of your ship, while avoiding the others. Every three stars you catch you will \"level up\". At this time your ship will change to a new color, all stars currently on-screen will shatter, and the game will speed up.\r\n</p>\n<p>You have a score multiplier listed under your score. If you catch correctly colored stars it will increase (up to a maximum of 16x). If you catch an incorrectly colored star or drop a correctly colored star, it will reset.\r\n</p>\n<p>You have three health (indicated in the upper-right corner of the screen). Catching incorrectly colored stars will damage your health. If you run out entirely it is Game Over. Try to get a high score!</p>\n<p><strong>High Scores and Color Sets</strong><br/></p>\n<p>On the title screen you can view the top 10 high scores. These are only your local high scores for now, in the future it may be updated to a web-based high score table. </p>\n<p>You can also cycle between Color Sets. These are the sets of 5 colors that your ship and the falling stars will choose from. I have included a few options in the hope that they will cover various forms of color-blindness. Let me know if none of the choices have all 5 colors being distinct enough from one another to play the game and I will see about adding more options.</p>\n<p><strong>Luxe Jam #1</strong><br/></p>\n<p>This game was created in 10 days for Luxe Jam #1, a game jam using the Luxe game engine which at the time of this publication is in closed beta. The source code for this game will be made available on GitHub once Luxe itself is open to the public, as per the wishes of the engine owners.</p>", "metacritic": null, "released": "2022-01-25", "tba": false, "updated": "2022-01-28T08:12:13", "background_image": "https://media.rawg.io/media/screenshots/ded/dedc3f7f72a17afc66f67da5314b74ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Nick Ver Voort"], "genres": ["Action"], "publishers": [], "esrb_rating": null}