{"id": 728654, "slug": "arc-starfighters-chitazen", "name": "ARC-StarFighters (Chitazen)", "name_original": "ARC-StarFighters (Chitazen)", "description": "<p>Welcome to the ARC-StarFighters <em>(Aerial Resistance Crew)</em> training program. This commercialized version of the popular training program has been modified into an arcade twin-stick shooter for quick local multiplayer fun!<br/></p>\n\n<p>In the program you control a starfighter to battle against other players in a <strong>deathmatch </strong>or AI-operated enemy combat training units and compete for the highest score in the <strong>arcade mode</strong>!\r\n</p>\n\n\n<p>Since the professional gear designed for using this kind of advanced training program is far out of the price range for most consumers, we have decided to simplify the controls to make the program usable on user input devices found in most households.\r\n</p>\n\n\n<p>There are 3 weapons currently available in the program. The ARC arsenal research unit will develop more weapon types if the program gains enough popularity.\r\n</p>\n<p><strong>NORMAL</strong>\n</p>\n<p>This is the oldest and most popular weapon type amongst the ARC-StarFighters units. You can never go wrong with this one!\r\n</p>\n<p><strong>RAPID</strong>\n</p>\n<p>With this modified NORMAL weapon-type the fire rate has been increased to make hitting enemy units is easier. However, the increased fire rate means that the bullets wont be as powerful.\r\n</p>\n<p><strong>TRIPLE</strong>\n</p>\n<p>Another modification of the NORMAL weapon-type. This weapon fires three bullets at the same time, making it great for close-range combat! However, the fire rate had to decreased to make this fighting style feasible.\r\n</p>\n\n\n\n<p>There are two game modes currently available in the program, deathmatch and arcade.\r\n</p>\n<p><strong>ARCADE</strong>\n</p>\n<p>In the arcade mode, you fight against AI-operated enemy combat units and compete for the highest score. This mode can be played by 1-4 users. (singleplayer supported)\r\n</p>\n<p><strong>DEATHMATCH</strong>\n</p>\n<p>In deathmatch, you will compete against fellow ARC-StarFighters. In this mode the goal is to destroy the other players before they destroy you! This mode can be played by 2-4 users. (singleplayer not supported)\r\n</p>\n\n<p>The music in the game is used under Creative Commons 4.0 license. All credits go to the artist Nihilore.</p>", "metacritic": null, "released": "2022-01-25", "tba": false, "updated": "2022-01-28T09:09:33", "background_image": "https://media.rawg.io/media/screenshots/20d/20dbb411b58cb211b1f6c5b3826dcf64.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chitazen"], "genres": ["Action"], "publishers": [], "esrb_rating": null}