{"id": 728675, "slug": "bgood-farm-unofficial-fan-tribute-game", "name": "Bgood Farm: Unofficial Fan Tribute Game", "name_original": "Bgood Farm: Unofficial Fan Tribute Game", "description": "Welcome to Bgood Farm: The Unofficial Fan Tribute Game\r\n<p>Listen to JohnnyBGood's incredible album, Bgood Farm, on Spotify, Apple Music. And be sure to follow JohnnyBGood on Instagram so you can find his NEW album dropping this Friday, January 28th!</p>\n<p>Be sure to turn your sound ON!</p>\r\nBackground\r\n<p>At the end of 2021 I was looking at Spotify's \"2021 Wrapped\", and apparently I was in the top 0.1% of fans of JohnnyBGood. His music is an awesome blend of synth, lofi, and retro beats dashed with a hint of Nintendo vibes, with a healthy dose of coffee. I just love the whole vibe. Please go follow him and support his stuff, and check out his new album coming later this week. It is sure to be excellent!</p>\n<p>His album art is some fun pixel art of a farm. I am on a mission in 2022 to learn to be an indie game developer, so I thought: how cool would it be to make the album actually playable? A clicker game seemed like the simplest way to go, focused around the music itself. </p>\n<p>This game is my fan tribute. I hope you like it, and I hope you like Johnny's music!<br/></p>\r\nDisclaimer\r\n<p>All music and art copyright JohnnyBGood. </p>\n<p>Dear Johnny: if you do not approve of this game and would prefer I take it down, please feel free to contact me and I'll unpublish it, no questions asked.</p>", "metacritic": null, "released": "2022-01-25", "tba": false, "updated": "2022-01-28T09:15:18", "background_image": "https://media.rawg.io/media/screenshots/a6a/a6af8a302c4ae5738bd81ac010336984.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Pandamander"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}