{"id": 7287, "slug": "spellcrafter-the-path-of-magic", "name": "Spellcrafter: The Path of Magic", "name_original": "Spellcrafter: The Path of Magic", "description": "PLEASE NOTE: Due to high-quality graphics this game is not recommended for the iPhone 4. The game is not compatible with the iPod touch 4th.<br/><br/>Magic is neither an art nor a religion. Magic is a craft.<br/><br/>Experience an amazing and unforgettable adventure set in a dark fantasy universe!<br/><br/>Spellcrafter: The Path of Magic is an RPG game with deep tactical turn-based combat and a unique spell casting system. Explore a world full of magic, collect gold, interact with NPCs, go on quests and make moral choices! Recruit heroes, assemble and summon powerful armies and send them into battle!<br/><br/>The unique feature of Spellcrafter: The Path of Magic is the spell casting system. The game recognizes signs you draw on the screen and automatically chooses the desired spell from the spellbook. If you don’t remember the correct sign you can consult the spellbook, but beware! Reaching for the spellbook takes extra time, and the quicker you cast your spell the more powerful it will be!<br/><br/>The game is divided into 3 acts. Each act tells a part of a compelling and magical story about the nature of reality, power and morality. Additionally, each act features 3 levels with a different setting and a different playable character (human, necromancer, elf).<br/><br/>Spellcrafter is a Premium Game (no IAPs, no F2P mechanics).", "metacritic": null, "released": "2014-08-06", "tba": false, "updated": "2019-07-30T13:53:02", "background_image": "https://media.rawg.io/media/screenshots/3a1/3a1e2cb81123aa0ac2b7c27e10c260fc.jpeg", "website": "http://jujubee.pl/?portfolio=spellcrafter", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 501, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS"], "developers": ["Jujubee"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Jujubee"], "esrb_rating": null}