{"id": 72885, "slug": "plato-games-chat-friends", "name": "Plato: Games, Chat & Friends", "name_original": "Plato: Games, Chat & Friends", "description": "Plato is the place to have fun. Chill with your squad or make new friends while playing and chatting at the same time.<br/><br/>MEET PEOPLE<br/>Every game you play connects you with new people. There’s also private, group and public chat rooms built into every part of Plato. <br/><br/>PLAY GAMES<br/>Jump into 20+ of your all time favorite games and play live against people from all across the world. No bots!<br/><br/>NO ADS, JUST FUN<br/>We cut out all the annoying distractions (like ads and pay-to-win). Plus no sign-ups, emails, or phone numbers are required. Seriously. We hate that stuff.<br/><br/>REAL COMPETITION<br/>Take on your friends or any of over 4,000,000 other people playing on Plato. Show off your ranking as you climb the leaderboards and level up.<br/><br/>SAY HI TO US!<br/>Plato is built by the original creators of Yahoo! Games. We'd love to hear from you! If you have any suggestions, please reach out to us at hello@platoapp.com.<br/><br/><br/>Plato is one app with 20+ of your favorite multiplayer games, including:<br/><br/>Werewolf (Mafia), Pool (8 Ball &amp; 9 Ball), Ocho (like uno), Bankroll (like Monopoly), Table Soccer, 4 in a Row (like Connect 4), Sea Battle (like Battleship), Draw Together, Rock Card (like Cards Against Humanity), Baloot (بلوت), Dominoes, Dice Party (like Yahtzee), Literati (like Scrabble), Ludo (like Sorry!), Chess, Backgammon, Gin Rummy, Spades, Hearts, Checkers, and Dots &amp; Boxes.<br/><br/>New games get added each month, too.<br/><br/>People play and chat together on Plato from all over the world including: United States, Canada, United Kingdom, France, Germany, Saudi Arabia, Indonesia, Thailand, Malaysia, &amp; Vietnam.", "metacritic": null, "released": "2016-12-08", "tba": false, "updated": "2019-10-22T14:05:13", "background_image": "https://media.rawg.io/media/screenshots/382/382be10a5c67a7f43b250eb0a3285096.jpg", "website": "https://www.platoapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Plato Team"], "genres": ["Board Games", "Card"], "publishers": ["Plato Team"], "esrb_rating": "Teen"}