{"id": 729368, "slug": "ambushed-3", "name": "Ambushed", "name_original": "Ambushed", "description": "It's dark. It's cold. But you have nowhere else to go.<br/><br/>You are trapped in a forest haunted by the ghosts of those who have died here. If you want to live you'll need to finish the ritual and cleanse the forest of the spirits residing amongst the trees. The forest is crawling with creatures, some harmless, some not. It's up to you and your friends to figure out how to finish the ritual so you can leave, before you end up dead too.<br/><br/>As a co-operative psychological horror game, Ambushed puts players into a forest filled with randomised objectives, where their goal is to complete all the objectives and escape the forest before they are all killed. Players will work together utilising their perks and items to complete objectives while trying to ward off the enemies within the forest.<br/><br/><ul><li><strong>Co-operative Mutiplayer</strong>: Play with up to 4 of your friends in this co-operative horror experience.<br/></li><li><strong>Immersive Experience</strong>: With minimal user interfaces and realistic graphics, Ambushed provides players with an immersive, thrilling experience.<br/></li><li><strong>Objectives</strong>: Using your flashlight and other equipment such as flash grenades, medical kits, and sanity pills, players will need to make their way around the forest to find and complete each objective. The difficulity of the randomised objectives that will spawn will change based on the difficulty that the players choose in the lobby.<br/></li><li><strong>Unique Enemies</strong>: Three different enemy types that become more determined to kill you the longer you remain in the forest, making you question your own sanity as you find yourself constantly turning back only to find that nothing is there.<br/></li><li><strong>Player Progression</strong>: As you complete the rituals your character will level up, allowing you to upgrade or get new perks to help tackle the harder difficulites.</li></ul>", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-11-07T02:35:52", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c8e12cce7ba763d39eae09f3fd771fa.jpg", "website": "https://www.rainykgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 471, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FakeBamboo", "Rainy K Games"], "genres": ["Action", "Indie"], "publishers": ["FakeBamboo", "Rainy K Games"], "esrb_rating": null}