{"id": 729314, "slug": "the-tale-of-doris-and-the-dragon-episode-2", "name": "The Tale of Doris and the Dragon - Episode 2", "name_original": "The Tale of Doris and the Dragon - Episode 2", "description": "<p>Please hand in your travel coin and proceed through the gate to the departure area</p>\n<p>The Adventure continues in The Tale of Doris and the Dragon - Episode 2. In this game, Doris continues on her quest to find her missing husband Albert.</p>\n<p>The Tale of Doris and the Dragon is a point-and-click adventure game series featuring an elderly lady named Doris who finds herself in Purgatory after passing away on earth. On her journey, Doris meets many weird and wonderful characters that help or try to hinder her progress. Out of this, an unlikely friendship emerges.<br />\nManagement<br />\nDoris finally arrives at her destination where she must navigate the vast and confounding hallways of the Management complex that is older than time itself.<br />\nMayhem<br />\nWith help from Norb the Transitional Support Dragon and some exciting new characters, solve puzzles and guide Doris on her journey through the red tape of Limbo’s middle management.<br />\nMenace<br />\nA sinister plan is underway that threatens the existence of reality itself. Our brave heroine must use her quick wit and unrelenting sass in order to halt the wheels of bureaucracy and save the day for all mankind.</p>", "metacritic": null, "released": "2020-02-07", "tba": false, "updated": "2023-11-05T15:50:05", "background_image": "https://media.rawg.io/media/screenshots/c5d/c5db9b3b79af5b5bb9bdd3ef1bdb234f.jpg", "website": "http://www.dorisandthedragon.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 1, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Arrogant Pixel"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Arrogant Pixel"], "esrb_rating": null}