{"id": 729382, "slug": "hell-mission", "name": "Hell Mission", "name_original": "Hell Mission", "description": "<h3>There Are 9 Chapters In This Game,</h3>Players will play the most capable agent \"Eva\" to face a huge number of undead and powerful cyborg warriors.<br/>This game has movie-like gorgeous visual effects, allowing players to experience shocking sensory stimulation, and the operation is very simple.<br/><br/>It is recommended that players enter the \"training\" option at the beginning to familiarize themselves with the operation mechanism of the entire game.<h3>Basic Operation</h3><h3>Move and Change Perspective</h3><h3>Move Mouse → Change Perspective</h3><h3>W, S, A, D Keys → Move</h3><h3>Spacebar → Jump</h3><br/>Scroll the middle mouse button → Zoom the radar field of view.<h3>Attack and Switch Weapons</h3><h3>When Holding A Knife,</h3><h3>Left Mouse button → Knife Melee Attack</h3><h3>Middle Mouse button → Switch Weapon</h3><h3>While Holding A Gun,</h3><h3>Press and Hold the Right Mouse button → Aim</h3><h3>Left-click While Aiming → Shoot</h3><h3>Esc Key → Pause Game</h3><h3>===============</h3><h3>Game Flow</h3><h3>1. In the Main Menu Page</h3><br/>Training → Familiarize yourself with basic operations and situations that may be encountered in the game.<br/><br/>Start → Enter the level menu, you can only enter the first chapter at the beginning, and you can enter the next chapter after the chapter is completed.<br/><br/>Language → Currently supports English, Chinese, Japanese and Korean<br/><br/>Difficulty → There are three options: Easy, Normal, Hard, and the default is Normal<br/><br/>Options → Adjust screen resolution, the default is original screen resolution / picture quality, ranging from 1 star (worst) to 5 stars (best) respectively<h3>Exit → Leave the Game</h3><h3>2. In Game</h3>In the game, the commander will inform the main mission, the main mission will also appear in the form of text at the top of the screen, there will be a radar in the lower left corner of the screen, and there will be icons of supplies, enemies, friendly forces, and mission targets on the radar.<br/><br/>During the game, you can press the ESC key at any time to pause the game and view the score record, or choose to return to the main menu.<br/><br/>After each chapter is completed, it will return to the level menu, and the player can choose to go to the next chapter or replay the previous chapter.<h3>=====================</h3><h3>Story Background</h3><h3>After the Biochemical Nuclear War In 2068,</h3><h3>The Earth Was Destroyed,</h3><br/>and 99% of the population were infected by biochemical weapons and turned into undead.<h3>Therefore, the Surviving Humans Moved to Space,</h3>but a large number of cyborg warriors who were sent to the battlefield during the war were left on the earth.<br/><br/>50 years after the war..... Mankind intends to return to the earth,<br/>and start to send agents to the earth to execute the \"Hell mission\" to eliminate  cyborg warriors and undead.", "metacritic": null, "released": null, "tba": false, "updated": "2022-01-31T03:32:11", "background_image": "https://media.rawg.io/media/screenshots/650/6508a9539496a223158c093e18085f91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nick Hsu"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Nick Hsu Game"], "esrb_rating": null}