{"id": 729355, "slug": "return-2-runaway", "name": "Re:Turn 2 - Runaway", "name_original": "Re:Turn 2 - Runaway", "description": "Make sure to add Re:Turn 2 - Runaway to your Wishlist to be one of the first to experience this psychological horror experience when the game launches.<br/><br/><br/><br/><br/><strong>Re:Turn 2 - Runaway</strong> follows on from the events of the first game. <br/><br/><br/><strong>Re:Turn 2 - Runaway</strong> is a tense, character-driven psychological horror experience. Saki and her fiancé, Sen, are trapped on an abandoned train that is haunted by an evil spirit that takes the form of a little girl named Ayumi. Battle your way through the haunted train. Discover clues in mysterious abandoned locations. Escape from the nightmare and free the trapped souls from the clutches of the evil which has possessed them. <br/><br/><br/><br/>But, consequences have actions. Saki must be careful, or she will meet a fate worse than the lost souls aboard Ayumi’s train. In order to stay safe, Saki must decide whether she should run, hide, or confront the evil that has set its sights upon her<br/><br/>The thing that calls itself Ayumi is harboring a dark secret. And it’s up to Saki to uncover the truth about that darkness. But Ayumi’s evil is powerful, and if it takes hold of Saki, then all hope is lost. Saki will need to use the tools she discovers along the way to battle this evil and reveal the true history of Ayumi’s wicked ways.<br/><br/><strong>Re:turn 2 - Runaway</strong> is a tale of heart-breaking betrayal and horrifying evil.<br/><br/><br/>* Intricate horror story<br/>* Side-scrolling 2D with unique pixel art<br/>* Original Art and Assets<br/>* All-new soundtrack and sound design<br/>* Supernatural elements<br/>* New locations <br/>* Hide to avoid detection and certain death<br/>* Featuring vibrant, hand-illustrated in-game visuals and animations<br/>* All-new game engine  <br/><br/><br/>We love to hear your thoughts and desires for the game and just chat with you. Join the Official Re:Turn 2 Discord server here: https://discord.gg/eYAaPBuNsA", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-01-31T03:11:58", "background_image": "https://media.rawg.io/media/screenshots/297/29771fb3566c79072d5303c5a3c96700.jpg", "website": "https://redego.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Red Ego Games"], "genres": ["Adventure", "Indie"], "publishers": ["Red Ego Games"], "esrb_rating": "Mature"}