{"id": 72948, "slug": "car-driving-3d-free-snow-hill-landscape-simulator-", "name": "Car Driving 3D: Free Snow Hill Landscape Simulator 2016", "name_original": "Car Driving 3D: Free Snow Hill Landscape Simulator 2016", "description": "Are you ready to drive a car in snow?<br/>\t\tFasten your seat belt and get ready to drive astonishing different sports cars through perilous snowy hills and crazy paths for the thrilling drive as a Furious car speed driver ! This car ride is filled with dangerous twisted hills atop a snowy mountain range. Nothing is more fun than the thrill you get from driving these sports car along realistic scenic 3D  snowy weather environment and wintery terrains and vehicles with detailed interiors make you feel like the master of your driving. !  EnjoyDriving experience on tough roads with easy controls and smooth game play no pick and drop point .<br/>\t\tMore thrilling, excited feeling of basic  cars driving and racing with dream sports cars that is used in rally game . You’ll perform tricks, stunts and show off your driving skills . Cars are park at different point go to your car by moving your person . BLAZE through snowy streets at intense High speed driving and rally racing your dream sports cars, jeep car around nice fantastic and snowy environment . The roads and streets are slippery .There are absolutely NO RULES .All you have to do is drive, and drive fast dream sports cars.Enjoy the ride with an amazing selection of different sports cars with sights of rocky snow , snow dumped hills adds enjoyment to the journey of your driving.<br/><br/><br/>***Game Features***<br/>- Driving experience in a realistic snowy weather and snowy off-roads.<br/>- 4 Different types of Cars including Realistic Animated Driver<br/>- Realistic Vehicle Physics including damage effect of cars.<br/>- Furious Speed Racer feature in a snowy weather.<br/>- Various exciting and adventurous tracks for you to enjoy<br/>- Realistic effects of snow and rain.<br/><br/>Download and Play Drive Car In Snow game .", "metacritic": null, "released": "2016-02-05", "tba": false, "updated": "2019-10-22T14:25:28", "background_image": "https://media.rawg.io/media/screenshots/310/31077ccb2c6004d1fb616d69732b8a5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Shahzad"], "esrb_rating": null}