{"id": 729743, "slug": "trials-of-orion", "name": "Trials of Orion", "name_original": "Trials of Orion", "description": "<p>Top-down Action Shooter using a blend of 2D characters and a 3D environment.</p>\n<p>Singleplayer.</p>\n<p>PC.</p>\n<p>Zeus has died! Olympus is searching for a new ruler and there might be one person who is worthy. Take control of a Greek demigod named Orion and use his bow and arrow to slay as many demons as possible to ascend and become the new ruler of Olympus. Use Left-Click to fire his Ascension arrow which heals and increases his Ascension meter. Use Right-Click to fire his Infernal arrow to dish out heavy damage to enemies but at the cost of his health. </p>\n<p>When in danger of dying press Spacebar to ascend to the divine realm and collect a number of healing orbs based on how many demons there were before. In this realm, your Ascension meter decreases slowly. Don't stay here too long or you will die when the meter reaches 0!</p>\n<p>There are 3 stages in total. You have to fill up your Ascension bar completely in order to progress the next stage.</p>\n<p><strong>---------------------- Controls ----------------------</strong></p>\n<p>[WASD] Movement</p>\n<p>[Left-Click] Shoot Ascension arrow</p>\n<p>[Right-Click] Shoot Infernal arrow</p>\n<p>[Spacebar] Ascend to Divine Realm</p>\n<p>[Tab] Toggle Help window</p>\n<p>[Esc] Pause Game</p>\n<p><strong>---------------------- Health &amp; Ability &amp; Ascension Descriptions ----------------------</strong></p>\n<p>[Health] - Don't let your health reach 0 or you die.</p>\n<p>[Ascension Arrow] - Heals a small amount of health on hit. Small damage. Increases your Ascension meter.</p>\n<p>[Infernal Arrow] - Sacrifices a small amount of health. Deals good damage in a large area.</p>\n<p>[Ascension Meter] - Increases when you hit demons with your Ascension arrow. Decreases while in the Divine Realm. If it reaches 0, you die.</p>\n<p>[Divine Realm] - When you go to this realm after pressing spacebar, all the demons that were present before turn into healing orbs. After you finish healing,</p>\n<p>press spacebar again to return to where you were. Don't stay in the Divine realm for too long because it deceases your Ascension meter. If it reaches 0, you die!</p>\n<p><strong>---------------------- Tips ----------------------</strong></p>\n<p>- Ammo is infinite so fire at will!</p>\n<p>- Use your Ascension arrow to heal and to increase your bar faster so you can beat the stage</p>\n<p>- Use your Infernal arrow to clear demon mobs faster</p>\n<p>- You DON'T get Ascension points for using Infernal arrow!</p>\n<p>- Only press spacebar to go to the Ascension realm if your health is low and you have plenty of Ascension meter to spare</p>\n<p><strong>---------------------- Credits ----------------------</strong></p>\n<p>Ron Hinh (Project Manager/Programmer/VFX)</p>\n<p>Austin Antle (Game Director/Programmer)</p>\n<p>Mark Kolpak (Art Director)<br/></p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T04:56:32", "background_image": "https://media.rawg.io/media/screenshots/cf6/cf63c0f6b52ffa8d2f4c70028f952995.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rhduke"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}