{"id": 7297, "slug": "dockit-rocket", "name": "Dockit Rocket", "name_original": "Dockit Rocket", "description": "\"I've been getting pretty good at Dockit Rocket; it really helped once I figured out my playing style and [got] the right rocket for my style. Also, when I approached the game more as an actual arcade game, which requires effort and concentration, I started to really enjoy it.\" -Davy<br/><br/>\"This is a stunningly polished, beautiful colored and well presented homage to old arcade times. Really, such an outstanding work of a single Dev where you see and feel how much love and thoughts he put in. Congrats!\" -Qwertz555<br/><br/>\"One of the hardest games for me. I really like the graphics and the arcade feel.\" -Jayg2015<br/><br/>\"Holy cow this game is hard. Really liking the style of it!\" -RossmanBrothersGames<br/><br/>Dockit Rocket is a one-touch, high-score-chaser, endless-arcade, available for Apple TV and iOS.<br/><br/>Features:<br/>- Choose from seven specialized rockets to amp up your game-play.<br/>- A brand-new level is created every hour, exactly the same level for everyone world-wide, regardless of location or device.<br/>- Features a barcode scanner that generates a unique level; scan as many as you like for an endless supply of content.<br/>- A bar-code scanned level captured on your iOS device will sync with your Apple TV version via iCloud if you sign into the same account.<br/>- Power ups: F = fuel, S = shield, L = laser, $ = points, Heart = extra life.", "metacritic": null, "released": "2015-10-31", "tba": false, "updated": "2019-10-22T14:35:56", "background_image": "https://media.rawg.io/media/screenshots/ca2/ca2956a81145b92c0fd1f3d086ccb3be.jpeg", "website": "http://www.krankyrobot.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kranky Robot"], "genres": ["Arcade"], "publishers": ["Kranky Robot"], "esrb_rating": null}