{"id": 72980, "slug": "tomb-breaker", "name": "Tomb Breaker", "name_original": "Tomb Breaker", "description": "\"Left me drawing lines in my brain for days.\"<br/>- John Polson, IGN<br/><br/>\"A Match-3 With Smarts\"<br/>- Nissa Campbell, TouchArcade<br/><br/>\"Simple and addictive\"<br/>- Konata, Appsgoer.com<br/><br/>Featured in Apple's New and Noteworthy and What's Hot section.<br/><br/>Forget your old match 3 games, this is gameplay you can't get anywhere else. Tomb Breaker is a brand new puzzle game you've never played before. <br/><br/>Super easy to pick up but infinitely difficult to master. You can start by simply connecting just 2 tiles together, or challenge your brain by attempting to match them all. The choice is yours. Tease your brain by swiping across tiles to make huge mind bending chains before your 60 seconds run out. Or, if your the type that enjoys reading an entire book while in the middle of playing a game you can take it as slow as you like in the new 20 moves mode. Either way your brain will thank you for the best workout its ever had!<br/><br/>What are you waiting for, join legendary adventurer Aria Brite and friends, in her very first adventure as you help her unlock the secrets of the tomb.<br/><br/>Features:<br/><br/>&amp;#149; Insanely addictive brand new gameplay. A new undiscovered puzzle game!<br/>&amp;#149; Set your highscore in either the 60 Seconds Mode, or the brand new timeless 20 Moves Mode.<br/>&amp;#149; Cast the stunningly beautiful Lightning Mode where you'll have the ultimate power!<br/>&amp;#149; Pull off amazing crossovers to blow away your friends' scores.<br/>&amp;#149; Clear entire colors in a single chain to build your multiplier.<br/>&amp;#149; Make a big enough chain and you'll conjure the new Wild Tile.<br/>&amp;#149; Connect to Facebook to challenge friends on the leaderboards.<br/>&amp;#149; Compete for all time high scores on Game Center.<br/>&amp;#149; Universal app looks great on an iPhone and an iPad<br/>&amp;#149; Did I mention this is a BRAND NEW puzzle game?", "metacritic": null, "released": "2013-05-03", "tba": false, "updated": "2019-10-22T14:25:29", "background_image": "https://media.rawg.io/media/screenshots/660/660d971db6f416b448d8df5f721b7814.jpg", "website": "http://simplemachine.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Simple Machine"], "genres": ["Arcade", "Puzzle"], "publishers": ["Simple Machine"], "esrb_rating": null}