{"id": 730133, "slug": "better-off", "name": "Better Off", "name_original": "Better Off", "description": "Better Off — <em>A fantasy noir story</em>\n<p><em>Better Off</em> is an interactive novella made for interact-if's non-ranked game jam, with the theme 'red herring'. It’s a noir story with a fantasy twist on the prohibition era.\r\n</p>\n<p>The game is <strong>rated 16+</strong> for violence and suggestive content. <br/><br/></p>\n<p><strong>Story</strong></p>\n<p><em>You’ve been coming home to an empty apartment every morning for three days now. <strong>Roy Bailey</strong>  isn’t the nicest person in the world, but he’s your partner in crime —  literal crime — and your flatmate. Bills are coming up. You have to  do something.</em>\n</p>\n<p><em>You decide to ask an old friend for help. You’ve lost touch with them, but <strong>Maria Reyes</strong>  was always the better person out of your trio, and now investigating is  their job. There’s no way they’ll refuse looking into Roy’s  disappearance, however reluctant they are to dip their toes in the  illegal magical scene.</em>\n</p>\n<p><em>Or so you think.</em> <br/><br/></p>\n<p><strong>Your companion</strong></p>\n<p><em>Detective Maria Reyes</em> used to be your best friend, or rather your only friend, when you were in high school. You went to college together, but when your natural mage status became known, you had to drop out both of college and of their life.</p>\n<p>Roy offered you a job, working for Flint, a notorious crime lord and you knew you had to sever all ties with Maria for both your and their sake. As you investigate Roy's disappearance, you have a chance to reconnect with your old friend...</p>\n<p><strong>Progress</strong></p>\n<p>The game is about 50% complete. <em>What's missing</em>: some bonding scenes with your companion, the second investigation branch (interrogating Lonnie), and the different conclusions of the story.</p>\n<p><strong>Support my work on Patreon or Ko-Fi!</strong><br/>\n</p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T06:28:36", "background_image": "https://media.rawg.io/media/screenshots/97b/97bad89ac16ab3db249d21144df41f25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Oscar Arcane"], "genres": [], "publishers": [], "esrb_rating": null}