{"id": 730103, "slug": "hopeless-little-firetruck", "name": "Hopeless Little Firetruck", "name_original": "Hopeless Little Firetruck", "description": "<p>This game was created for the  17th ScoreSpace Jam with the theme \"Protect\" . </p>\n<p>I created this game within saturday and sunday of the jam. </p>\n<p><em>I did try build a broswer version but the meshes are very glitchy and I dont want compremise my game for the sake of convenience, hope you understand!</em></p>\n<p>You play as a hopeless little fire truck speeding through a small town putting out fires to protect the people living there. Put out as many fires as you can before they burn the houses down!</p>\n<p><strong>Controls </strong></p>\n<p>WASD to control the fire truck , aim your water cannon with the mouse and left click to fire. </p>\n<p>All assets for this game besides sounds were made by myself for this jam. The sounds can be found on Mixkit.com, colour pallette you may recognise from my previous game \"Fragile Goods\" </p><p><strong>TIPS &amp; TRICKS</strong></p><p>I understand as the developer of this game , I am able to see things and understand the scoring system a lot more than people who might play it, so heres some tips to get you the highest possible score!</p><p><strong>DON'T GIVE UP HOPE</strong></p><p>It may seem like a lot when you're surrounded by fires left right and center but once a building burns down a set amount of time is added to the code that spawns in the fires allowing you time to recooperate.</p><p><strong>REMEMBER THE ORDER</strong></p><p>Each fire has a set amount of time before it burns down , the fires further away from the player will also have a little more time to allow for you to reach them. Try to remember the order the fires come in to utilise your time most effectively.</p><p><strong>FIND A RHYTHM </strong><br/></p><p>Contrary to what I just said above , finding a good rhythm is the best way to put out the most fires, follow the roads and hit as many drive bys as you can. The range of the water cannon is pretty far and you may find yourself not needing to turn down a road you don't have to.</p><p><em>I hope you all enjoy my submission and be sure to check out my other games, I am trying to be more frequent with publishes this year and would really appreciate any feedback in the comments section!</em></p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T06:21:54", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8dbd751bee0b56e2e3a13672ebb9bf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Ermdad"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}