{"id": 730325, "slug": "intertwine-dmurdolo-benxtan", "name": "Intertwine (dmurdolo, benxtan)", "name_original": "Intertwine (dmurdolo, benxtan)", "description": "<p>You arrive in a strange land, betwixt two opposing towns.\r\n  </p>\n<p>Use the WASD/Arrow keys to move around the world, press the Enter  button to talk to the citizens, and the WASD/Arrow keys plus Enter to  confirm your choices.\r\n    </p>\n<p>Can you uncover what is happening, unravel the story and reach some  kind of resolution, shared or otherwise, in these strange times?\r\n</p><p><em>”Out of the storm, the crowd, the swarm, the tempest;  a being shall emerge and there shall they fall within our very streets! With their hands, the power of destruction. To rip apart the very fabric of our gooey walls! Those that follow this truth, they are the ones that know!” - Prophecy, Anon\r\n</em></p><em>\n</em><p><em>I’m sending you on a mission… see what's going on with this town. It's odd… There’s bizarre rumours floating around about the place being destroyed, and about some but no one seems to have made up their mind about it, but some are starting to take sides. Some are pointing fingers, some grouping together behind an apparent prophecy. Explore and maybe see if you can’t calm them down a bit. It would be nice if they could live in harmony again, you know.. the two sides intertwined. But hey… there might be something in the speculation!!!\r\n</em></p><em>\n</em><p><em> Peace- The Orb\r\n</em></p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T07:16:22", "background_image": "https://media.rawg.io/media/screenshots/532/5328f4ad52d2b298311528f7c16b8e85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dmurdolo", "benxtan"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}