{"id": 73053, "slug": "soldiers-inc-mobile-warfare", "name": "Soldiers Inc: Mobile Warfare", "name_original": "Soldiers Inc: Mobile Warfare", "description": "Step into the next generation of MMO strategy in Soldiers Inc: Mobile Warfare. Train your troops, build your base and command an army against your enemies. Conquer Black Sites and outposts full of resources, and team up with friends to take total control of the battlefield!<br/><br/>The year is 2037, and the evil Phoenix Corporation has taken control of Selva De Fuego - the world’s only source of a new lifesaving serum. The world has declared war on Phoenix, giving every private military and mercenary force a green light to invade Selva De Fuego and do whatever it takes to crush the rogue corporation.<br/><br/>This where you come in. As the commander of a division of seasoned soldiers of fortune, your mission is to defeat Phoenix before your rivals - but it won’t be easy. Standing between you and victory are the most elite mercenaries and devastating weapons on the modern battlefield.<br/><br/>Use a cutting-edge arsenal of weapons including advanced assault vehicles, tanks and futuristic military drones to prepare for all-out warfare in the mobile sequel to the award-winning hit Soldiers Inc.™.<br/><br/>NOTE: Soldiers Inc: Mobile Warfare™ is completely free to play, however some game items can also be purchased for real money. If you don't want to use these items, please disable “in-app purchases” in your device's settings.<br/><br/>Game Features:<br/><br/>- FREE TO PLAY<br/>- Incredible graphics with motion-captured hero characters and stunning 3D maps.<br/>- Compete online in realtime massive multiplayer clan warfare.<br/>- Train and upgrade your troops and combat systems to create an unstoppable army.<br/>- Develop and deploy the next generation of military weapons across an ever-evolving battlefield.<br/>- Attack or Defend - reposition your base and customize your outposts to back up your strategy.<br/>- Participate in intense, tactical PvP against players all around the world.<br/>- Single-player PvE missions, tournaments, rewards, and achievements.<br/>- Forge an alliance, cooperate with teammates and devise strategies to defeat your rivals.<br/>- Live operations with hundreds of different events and leaderboards to play across single player and PvP.", "metacritic": null, "released": "2016-11-30", "tba": false, "updated": "2019-07-29T19:25:55", "background_image": "https://media.rawg.io/media/screenshots/6e3/6e3a5a06bb388cff45b46ee8432190e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 527, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Plarium"], "genres": ["Action", "Strategy"], "publishers": ["Plarium"], "esrb_rating": "Teen"}