{"id": 730584, "slug": "the-rich-and-the-dead", "name": "The Rich and The Dead", "name_original": "The Rich and The Dead", "description": "<p>You are a bandit leader who is trying to get famous in the Wild West. Rob banks, recruit bandits, get guns and get the highest bounty in the Wild West. But beware that the marshals don't catch you! Are you going to be the Rich or the Dead?</p>\n<p><strong>Instructions</strong></p>\n<p>In ‘The Rich and The Dead’ you play as a bandit gang leader. Recruit gang members, rob the surrounding villages and homesteads, and become the most notorious bandit in the wild west.\r\n</p>\n<ul><li>On the left of the screen you will see your Money and Food. You cannot have your food run out, or risk revolt by your bandits.\r\n</li><li>In the lower left corner you see your available bandits that are currently in your camp.</li><li>Select one or more of your bandits. Then click on one of the locations. You will see them travel from your center camp to your selected location, do the job, and return to the camp.\r\n</li><li>Once your bandits are back at the camp, their portraits show up again on your screen.\r\n</li><li>While travelling, your bandits are at risk of being spotted by the patrolling lawmen.\r\n</li></ul>\n<p>Hints\r\n</p>\n<p>Doing a job costs time, including travel. Your bandits have to go to the location, do the action, and then walk all the way back.\r\n</p>\n<p>In order to be successful, you will have to manage your gang. Watch the total Food you have. If this runs out, you’re dead meat. Better to do a few supply runs every now and then.\r\n</p>\n<p>Lawmen prefer the roads as they look for your bandits. Watch their walking routes, and plan accordingly. Sometimes its better to lay low for a little while longer.\r\n</p>\n<p>Bridges are a bottleneck. Watch out for bandits and lawmen converging at a bridge, wanting to cross it.\r\n</p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T08:20:26", "background_image": "https://media.rawg.io/media/screenshots/d23/d23ba17fb23638a7aae1ad9d75c82cf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["laserbrick"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}