{"id": 7307, "slug": "legend-online", "name": "Legend Online", "name_original": "Legend Online", "description": "Gallant warriors, the Priestess is awaiting your help! <br/><br/>Legend Online is a mobile CCG and MMO game offering you a most pleasant and fulfilling experience of collecting cards, customizing your deck and combating in dungeons or against other real players (pk or pvp duel). More than 200 cards of various types and levels are to be found, crafted and possessed and your deck grows and improves with you! Rare cards may cost you some time and effort, but they are awesomely powerful and worth the effort! A good collection and combination of cards will make combat easier. What’s more, it will exhibit your achievement and taste and impress your friends! Once you have deployed your cards in formation, the combat is completely automatic! What you need to do is hold your phone or pad on your palm, watch the battle proceed and then harvest loots, experience and fulfilment! <br/><br/>In this world of Middle Age fantasy, you will act as a hero to help the Priestess restore peace and prosperity for the human world. An adventure of fantasy awaits you! Prove your gallantry, strategy and tact and save the world!<br/><br/>Legend Online inherits the world setting, characters and plot from the eponymous browser masterpiece which has achieved great success in many countries, especially in Turkey. The browser version of Legend Online attracted a total of 10 million players all over the world and was rated by Facebook as a Top 25 globally popular game. <br/><br/>You can get the gist of the game by learning its main features:<br/><br/>++ Atmosphere of fantasy and legend throughout the game: choose one of the three unique classes to start your adventure: WARRIOR (strong and courageous), ARCHER (agile and precise) and WIZARD (intelligent and creative). Every class has their unique characteristics and skills. There must be one class that suits you best!<br/><br/>++ Insanely fun and thrilling PK: Prepare your cards and impress everyone on our exclusive PVP ARENA. Throw down the gauntlet and let the DUEL begin!<br/><br/>++ A combination of CCG, RPG and MMO: you can find all kinds of gaming elements in this game: collecting cards as in a CCG, playing the role of a hero as in a RPG and tons of players online at the same time as in a MMO. Whichever game type is your favorite, you will just love the game!<br/><br/>++ A balance between hardcore combat and relaxing gaming: spectacular fighting visuals combined with hands-free automatic control!<br/><br/>++ Collection and management combined with tact and strategy: collection of cards and clearing of higher stages give you a long-term goal providing fulfillment to you from time to time; a victory by a narrow margin will remind you of your minor yet consequential adjustments of formation before the battle and make you feel proud of yourself. It will make your fragment time fulfilled and be your first and long-time choice to kill the time!<br/><br/>++ Feel lonely and helpless in the face of daunting monsters? Get reinforcement immediately from one of your friends’ deck and wipe your enemies out with a powerful card that you have long desired! Maybe one day you will be the big hero to your friends!<br/><br/>REVIEWS<br/>5/5 “Sensational Game” – Gui Jorge<br/>5/5 “Very good, no lag at all” – Erick Mateus <br/>5/5 “I've tried to find a fun and enjoyable game like this for a while. And you don't need the IAP to become strong or have fun.” – ekuLz<br/>5/5 “Addicting..in a good way !! It beats out a lot of online games!” – Zaphode<br/>5/5 “This is an awesome RPG game. Definitely recommended.” – GrotesqueGuitar<br/><br/>If you like combat CCGs, don’t hesitate and download it right away! Invite your friends to join you and have more fun! Gallant warriors, be the hero to the Priestess and save the world!", "metacritic": null, "released": "2014-08-05", "tba": false, "updated": "2019-08-23T04:16:56", "background_image": "https://media.rawg.io/media/screenshots/52c/52c023d1f67ae0a15e6fe4de7bb38df6.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oasis Games"], "genres": ["RPG", "Card"], "publishers": ["Oasis Games"], "esrb_rating": "Everyone 10+"}