{"id": 73075, "slug": "iron-desert-fire-storm", "name": "Iron Desert - Fire Storm", "name_original": "Iron Desert - Fire Storm", "description": "Iron Desert is a free cross-platform war game that can be played on any device.\u2028\u2028This is a game about heavy artillery, fierce battles, and dominating the enemy. The dynamic struggle will capture your attention as soon as you start playing. Gather valuable resources, expand your base, upgrade your guns, hire military units. Defeat the mad villain, Iron Dragon, and his underling, Commander Scar, to free the continent from their oppression.\u2028\u2028In Iron Desert, you can build up your military base into an unassailable fortress, do battle with other players, and blow their bases to smithereens. Team up with your friends and create your own clan to grind all who stand in your way on the path to rule the desert.\u2028\u2028<br/><br/>FEATURES:\u2028<br/>&gt; Dynamic battle: deftly issue orders during battle to turn the course of events in your favor.\u2028<br/>&gt; The strongest is victorious: units which have survived return to base after a battle, immediately ready to fight again.\u2028<br/>&gt; Simple: Boy or girl, young or old, this game is for everyone!\u2028<br/>&gt; Battles against other players: obliterate bases, steal resources, in short: dominate the enemy.\u2028<br/>&gt; Exciting storyline: free captured territories and you will be generously rewarded.\u2028<br/>&gt; Rankings and tournaments: don't just play, play to win! Become the best commander.\u2028<br/>&gt; Realistic graphics: immerse yourself in the game.\u2028<br/>&gt; Epic soundtrack: you won't succumb to apathy in the hot desert.\u2028<br/>\u2028<br/>If you like Iron Desert, don't forget to give it five stars. Have any questions or need help? Contact us, we will help: iron-desert@corp.my.com\u2028\u2028<br/><br/>Join our communities:\u2028\u2028<br/>Facebook: https://www.facebook.com/IronDesertGame\u2028<br/>Twitter: https://twitter.com/IronDesert\u2028<br/>G+: https://plus.google.com/u/0/103840740349385700225/\u2028<br/>\u2028<br/>Attention! Iron Desert requires a reliable internet connection.", "metacritic": null, "released": "2014-10-08", "tba": false, "updated": "2019-10-25T05:05:46", "background_image": "https://media.rawg.io/media/screenshots/f4c/f4c379b9f32af3449229cac49ab92482.jpg", "website": "http://id.my.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 420, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["MY.COM", "MY COM"], "genres": ["Action", "Strategy"], "publishers": ["My.Com"], "esrb_rating": null}