{"id": 73072, "slug": "battlelands-royale", "name": "Battlelands Royale", "name_original": "Battlelands Royale", "description": "~  A CRAZY FUN TWIST ON FAMILIAR BATTLE ROYALE ~<br/><br/>Fight for survival in an epic last man standing multiplayer battle royale - but not as you know it! <br/><br/>Made for mobile, Battlelands Royale is a casual gun game for everyone to enjoy. With 32 players and 3-5 minute battles it’s pure non-stop carnage! No waiting in lobbies; no complicated menus to navigate. Just play, parachute, loot, shoot and survive! <br/><br/>Dominate the arena in Solo or join forces with fellow battlers in Duos. Choose your landing spot, drop in, loot weapons and armor and get ready for the fight of your life! Battle it out on a huge map with awesome locations like the Hideout, Ship, Maze and Trainyard. Or maybe you’ll hide away in Camper’s Paradise? Whatever your strategy, don’t get caught by the storm! <br/><br/>As you play you’ll unlock customized content like parachutes, emotes and special skins by gaining XP and levelling up. Get the Battle Pass for even more rewards and be the envy of your fellow battlers. Strike fear into your enemies with Rare and Legendary characters that will have them shaking in their boots and wishing they’d stayed at home!<br/><br/>With a variety of guns you can perfect your shooting skills and become the best battler in town. Will you choose the sniper, shotgun, rifle or pistol? Remember to race to supply drops to compete for the special minigun and bazooka! <br/><br/>Super simple controls, a fun and quirky art style and pick-up-and-play gameplay make Battlelands Royale the best free game on mobile that you won’t want to put down. <br/><br/>Battle Royale. On mobile. Done right. This is Battlelands Royale. <br/><br/>BATTLELANDS ROYALE FEATURES:<br/><br/>— Real-time fast-paced 32-PERSON BATTLES against players from all over the world!<br/>— TEAM PLAY! Join forces with a Battle Buddy and conquer the arena together. No friends? No problem! You can play Random Duos too! <br/>— MEGA REWARDS! Collect new characters, emotes and parachutes as you level up. <br/>— EXCLUSIVE BATTLE PASS CONTENT! Unlock the very best rewards and flaunt them in the arena with the Battle Pass. <br/>— HUGE game map to explore. Parachute into your area of choice and control your landing. <br/>— Tons of WEAPONS and ITEMS to loot, including armor and med kits!<br/>— Race to SUPPLY DROPS to discover special rare weapons like bazookas and miniguns.<br/>— SHRINKING play area. Stay clear of the storm! <br/><br/>Coming soon to Battlelands Royale:<br/><br/>— Loads more customization and awesome new characters<br/>— Destructible environment! Blast your enemies’ cover<br/>— More weapons<br/>...and much, much more.<br/><br/>Are you ready? See you in Battlelands Royale. #LootShootSurvive.<br/><br/>---<br/><br/>Thank you for playing Battlelands Royale! We’re constantly developing the game and your feedback helps shape the game’s direction - so whether it's bugs or feature ideas, please send them our way via contact@futureplaygames.com.<br/><br/>Don't miss the chance to connect with the Battlelands community on Discord and Facebook. <br/><br/>Discord: https://discord.gg/8hkjguw<br/>Battlelands Official Players' Group: https://www.facebook.com/groups/battlelandsplayers/<br/>Battlelands Facebook page: https://www.facebook.com/battlelandsroyale<br/><br/>We'll take each and every comment on board and really appreciate you taking the time to let us know about your experience of playing! <br/><br/>---", "metacritic": null, "released": "2018-07-05", "tba": false, "updated": "2023-08-02T19:44:13", "background_image": "https://media.rawg.io/media/screenshots/c93/c93ecd3c4fbdb7c2c656469286bf58a9.jpg", "website": "http://www.facebook.com/battlelandsroyale", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Futureplay"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Futureplay Oy"], "esrb_rating": null}