{"id": 73080, "slug": "ghost-pop", "name": "Ghost Pop!", "name_original": "Ghost Pop!", "description": "Pop those ghosts! The ultimate popping challenge! Blast ghosts with your flashlight along a haunted twisty road.<br/><br/>Simple one-tap controls, defeat spooky creatures, switch the color of your beam, unlock super awesome characters, and even earn coins whilst you sleep!<br/><br/>- Super challenging!<br/>- Tons of characters and flashlights to unlock!<br/>- Lots of enemies and big bosses to defeat!<br/>- Upgrade your damage, battery life, critical hits and more!<br/>- Explore the forest, unlock chests, even collect gold fairies!<br/><br/>PLEASE NOTE:<br/><br/>Ghost Pop! is completely free to play. However, some items can be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your devices settings.<br/><br/>Ghost Pop! was developed by PlaySide, the developers behind Editors' Choice title \"Catch The Ark\", Drift It, Monkey Ropes, Icy Ropes and more.<br/><br/>Let us know what you would love to see in our next update at : www.playsidestudios.com<br/><br/>SUBSCRIPTION TERMS AND CONDITIONS: <br/><br/>VIP Subscription offers a weekly subscription for $9.99 after a 3 day free trail. Upon purchase of this subscription, you will immediately receive: <br/>- No ads<br/>- 25%+ offline earnings<br/>- 50% more torch battery<br/>- Double coins collected in-game (that you pick up)<br/>- 1 exclusive costume<br/>- 1 exclusive torch <br/>Your subscription automatically renews. The payment is charged to your iTunes Account upon confirmation of purchase. unless auto-renew is turned off at least 24-hours before the end of the current period. Your account will be charged for renewal at the price listed within 24-hours prior to the end of the current period. Subscriptions may be managed and auto-renewal may be turned off via Settings &gt; App and iTunes Stores &gt; Apple ID &gt; View Apple ID. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Terms of Use: https://www.playsidestudios.com/privacy-policy", "metacritic": null, "released": "2018-04-03", "tba": false, "updated": "2019-07-29T20:45:51", "background_image": "https://media.rawg.io/media/screenshots/323/3234017bc1023f475683ef7bd0c53907.jpg", "website": "http://www.playsidestudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlaySide"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["PlaySide Studios"], "esrb_rating": null}