{"id": 73088, "slug": "juggernaut-wars-action-moba", "name": "Juggernaut Wars – Action MOBA", "name_original": "Juggernaut Wars – Action MOBA", "description": "Enter the world of Juggernaut Wars – the world of swords, sorcery and courage pitted against the malice of otherworldly monsters and their minions; the world where fighting never ceases! Thwart the Devourers’ invasion and save the missing princess Leah! <br/>Dozens of heroes with unique abilities and personalities are on your side. It will take a real master of tactics to assemble a team that would overcome all obstacles, defeat powerful bosses and reach the grand finale to shape the destiny of this world! <br/>The enemy is guarding the secrets well, but every victory makes your team stronger! Upgrade your heroes, collect artefacts, gather new warriors! Prove your skills in the campaign as well as other modes – no matter what, you’ll never get bored!<br/><br/>- Outstanding graphics and special effects! Heroes of Juggernaut crush everything in their way in most spectacular battles! <br/>- An exciting campaign: unravel the Cult of Masks’ secrets and save the world from the Devourers! <br/>- A multitude of modes: from arenas to side scenarios and mine assaults, your heroes will always have work to do! <br/>- Limitless combat tactics options: use your heroes’ abilities skillfully and win! <br/>- Friends and enemies await you online! Find allies and defeat competitors on your path to the top of the rating!<br/><br/>Please note: Juggernaut Wars is free to play and download, however some game items may be acquired with real money, such as portions of hard currency.<br/><br/>A mobile network connection is required to play or download Juggernaut Wars.<br/><br/>Terms of Use - http://legal.my.com/us/games/tou/<br/>Mobile Games Privacy Policy - https://legal.my.com/us/games/mobile_privacy/", "metacritic": null, "released": "2016-02-03", "tba": false, "updated": "2019-10-22T14:34:06", "background_image": "https://media.rawg.io/media/screenshots/7fa/7fac2fa2495fee8e00f1a9dc25415dd5.jpg", "website": "http://jw.my.com/?lang=en_US", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["MY COM"], "genres": ["RPG", "Strategy"], "publishers": ["My.Com"], "esrb_rating": null}