{"id": 73098, "slug": "real-estate-tycoon", "name": "Real Estate Tycoon", "name_original": "Real Estate Tycoon", "description": "<h3> Hello, dear players. I'm Pizai, the game producer of \"double egg studio\" real estate tycoon </h3><h3> as a huge UE4 R &amp; D team with up to 5 R &amp; D personnel, after two years of hard research and development, we are about to go bankrupt. Fortunately, our game has also been successfully put on the store. This is our first work. I hope this is also the smooth start of our independent game career. At the same time, I wish all players' masters and aunts a pleasant trip ~</h3>__________________________________________________________________<br/><br/><br/>\"Real estate tycoon\" is an urban theme simulated business game. We try to restore the development process of a real estate company CEO, and give the player the identity of a \"capitalist\", hoping to make friends who can't afford real estate become the strongest real estate brothers and sisters in the game.<h3> real estate operation and construction simulator: </h3><br/>The real estate simulator is created by imitating the real world real estate industry operation rules. Players need to compete with AI opponents for land through auction, bidding, acquisition, etc., and build residential real estate for the floating population who come to the city, so as to provide citizens with infrastructure and industrial facilities to meet their requirements; Finally, it developed into a giant company that monopolized the market of the whole city.<br/><br/><br/><h3> real estate speculation simulator: </h3>It also simulates elements such as different land prices in different areas and different house prices in different areas in reality, so that players can build a variety of buildings such as school district houses, subway houses and suburban houses for sale. They can also create more possibilities for the development of their own companies by using real-life methods such as cover plate and demolition.<br/><br/><br/><h3> decoration simulator: </h3>The interior decoration system created by imitating the real house type design and interior design allows players to plan a building into a house type suitable for people of different classes in the game world and carry out corresponding decoration; Create houses with different attributes, such as square house type, north facing south, elevator room, improvement room and clean water room, and sell them to the citizens in the game.<br/><br/><br/><h3> greening simulator: </h3>All buildings in the city can be decorated with neon lights and planted with greenery to make the city more vibrant. Players can plant the green plants they want on the big map, install colorful neon lights on the building, and add a cyberpunk flavor to the whole city.<br/><br/><br/><h3> technology tree and drawing design: </h3>Players can upgrade the business capability of the company in the game through contacts and game currency, and choose the best marketing means according to different technology tree routes, so that you can win the business war most efficiently.<br/><br/><br/><h3> random events and policy management: </h3>Simulate the realistic national financial policies and industrial policies, and simulate the realistic disasters and industrial storms. Players need to grasp every good opportunity, resist every bad disaster, and walk with the surging waves like real business giants to achieve a lifetime of business hegemony<br/><br/><br/>", "metacritic": null, "released": "2011-01-18", "tba": false, "updated": "2022-08-08T05:53:38", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d0570bace96121463ba7cfe4a187827.jpg", "website": "http://solverlabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["SolverLabs", "Area 1", "Double Eggs"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie", "Puzzle"], "publishers": ["SolverLabs", "Area 1", "Double Eggs"], "esrb_rating": null}