{"id": 7310, "slug": "doodle-jump", "name": "Doodle Jump", "name_original": "Doodle Jump", "description": "<p>BE WARNED: Insanely addictive!<br />\n&quot;possibly the best iPhone game ever created&quot;  - Touch Arcade<br />\nFrom prime-time sitcoms (BIG BANG THEORY) to late night TV (JIMMY FALLON) to a fashion accessory for pop stars (LADY GAGA), Doodle Jump is EVERYWHERE! It&#39;s a cultural craze, a hot new trend!<br />\niTunes reviews (US)</p>\n<hr />\n<p>&quot;I just got dumped cuz I wouldn&#39;t put this game down! And I just kept playing while she walked away... ITS THAT GOOD!&quot;<br />\n&quot;Somehow it&#39;s better than sleep for me. I am sick, sleep deprived, and achy, and yet I cannot put it down&quot;<br />\n&quot;Coming from someone who owns a PS3, Wii, and Xbox 360, I play this game more!! This game is amazing!!&quot;<br />\nMedia reviews:</p>\n<hr />\n<p>&quot;Doodle Jump is a perfect micro-game, insanely addictive, and deliciously replayable. Go get it.&quot;  -  MacWorld.com<br />\n&quot;the most addicting iPhone game yet?&quot; -GIZMODO<br />\n&quot;...the king of casual games on the App Store ...tons of updates and lots and lots of gameplay in a super simple and accessible package.&quot; - TUAW<br />\nSo, what is it?</p>\n<hr />\n<p>In Doodle Jump, you guide Doodle the Doodler—using some of the most subtle and accurate tilt controls in existence—on a springy journey up, up, up a sheet of graph paper, picking up jet packs, avoiding black holes, and blasting baddies with nose balls along the way.<br />\nLaugh with delight as Doodle™ blows past other players&#39; actual score markers scribbled in the margins. And be warned: this game is insanely addictive.<br />\nFEATURES:<br />\n- 11 incredible worlds + 3 SECRET easter eggs<br />\n- broken, moving, disappearing, moveable, and EXPLODING platforms<br />\n- JET PACKs, PROPELLER HATS, ROCKETS, and springs that fly you higher<br />\n- UFOs, black holes, monsters, bear traps!<br />\n- jump on monsters to bring them down MARIO-style<br />\n- Submit score to Facebook &amp; Twitter<br />\n- Compete agains friends!<br />\n- Global leaderboards, achievements!<br />\nHow to play:<br />\nTilt to move left or right, tap the screen to shoot.</p>\n<hr />\n<p>*Please don&#39;t Doodle Jump and drive, and BE WARNED: Doodle Jump is Insanely Addictive!</p>", "metacritic": null, "released": "2009-03-27", "tba": false, "updated": "2023-10-18T03:46:34", "background_image": "https://media.rawg.io/media/screenshots/361/361eb017e53d74af1515bf5b729b6b12.jpg", "website": "http://www.LimaSky.com", "rating": 3.75, "rating_top": 4, "added_by_status": {"owned": 20, "beaten": 23, "toplay": 1, "dropped": 32, "playing": 1}, "playtime": 0, "achievements_count": 11, "ratings_count": 40, "suggestions_count": 161, "game_series_count": 1, "reviews_count": 40, "platforms": ["iOS", "Android"], "developers": ["Lima Sky"], "genres": ["Action", "Adventure", "Arcade"], "publishers": ["Lima Sky"], "esrb_rating": null}