{"id": 731121, "slug": "warden-of-dunrath-demo", "name": "Warden of Dunrath - DEMO", "name_original": "Warden of Dunrath - DEMO", "description": "<p>A little demo I made for My First Game Jam - Winter 2022 here in itch.io!</p>\n<p>As the apprentice of the last remaining Warden in the woods of Dunrath, you'll have a difficult mission thrust upon you. A greedy empire bordering the woods has finally decided to expand into them and they'll destroy everything in their way. As a Warden it's your job to put a stop to this and save your home!</p>\n<p>-----</p>\n<p>I had much more planned for this. Some stuff is a bit of a placeholder (like the music for example, you might notice the tracks are quite short), as sadly during the project I had a long power outage which took away several precious days of work which I could have used to add more content. Some of the stuff that was cut out includes multiple routes and endings, a skill tree that you can upgrade over time, recruitable allies, summons, shapeshifting magic, spellcasting based on terrain, and a few other things.</p>\n<p>If, somehow, this game gets any significant attention then I'd definitely consider giving a shot at properly finishing it. But for my first game jam, even as tiny of a demo as it is (it only has 2 areas...), I'm still satisfied. I learned much and had fun with it, and I'll definitely use what I learned for whatever I work on next in the future.</p>\n<p>Enjoy this little prototype and tell me what you think in the comments below!</p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T10:30:43", "background_image": "https://media.rawg.io/media/screenshots/bfa/bfa614cf2c87a81c9a6ead6809c3d12e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["underm1nd"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}