{"id": 73113, "slug": "lost-island-blast-adventure", "name": "Lost Island: Blast Adventure", "name_original": "Lost Island: Blast Adventure", "description": "Welcome to your very own island! Step onto its shores and solve puzzles together with lovable characters to build a beautiful paradise! <br/><br/>But this is no ordinary island. Legends tell of ancient spirits that haunt its sandy beaches and lush jungles.<br/>Renovate, decorate, and match to transform it into the home of your dreams. Solve challenging Blast puzzles to investigate and uncover the secrets of the past.<br/>Travel to the heart of the island and unearth its mysteries!<br/><br/>Game features:<br/><br/>● Play exciting Blast puzzles with explosive boosters and tons of levels <br/>● Construct and customize buildings, beaches, gardens, jungles, and more<br/>● Repair and decorate the island to restore its beauty<br/>● Experience a fun story set in an exotic, magical environment <br/>● Investigate mysteries and discover secrets while combing through ancient ruins <br/>● Explore the island and find gold, treasure, and historical artifacts  <br/>● Meet interesting new friends and help them fulfill their dreams<br/>● Partner up with Ellie, the adventurous archaeologist<br/>● Play and hunt for treasure with your cute pet seal<br/><br/>NOTE: Lost Island is FREE to play and download, but you can make in-game purchases with real money. If you don’t want this feature, please disable it in your device settings.", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-07-31T05:09:45", "background_image": "https://media.rawg.io/media/screenshots/ea6/ea6ee274c59f9435c790d7e8ba30560d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Plarium"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Plarium"], "esrb_rating": null}