{"id": 73137, "slug": "siberian-survival-cold-winter", "name": "Siberian Survival: Cold Winter", "name_original": "Siberian Survival: Cold Winter", "description": "Survive in really harsh and cold badlands – Siberia! Explore empty snow-covered forests to find water, food or wood to make fire! Don’t get frozen! Use special survival tools hidden around or craft your own ones. Build a shelter with a fireplace to hide from freezing cold! Stay alive at all costs with Siberian Survival: Cold Winter 3D game! Do you feel the fear quaking with cold? Upgrade your survival skills hunting, gathering and crafting!<br/><br/>Play this ultimate survival simulator in 3D! You are a person lost in Siberian woods. It’s too cold here! Find or build shelter to hide, hunt for wild animals to get food and find water to stay alive. Mind survivor’s status – health, fullness, water rate and, of course, warmth rate! Avoid freezing cold – it’s a right way to death! Explore forest badlands, avoid meeting with aggressive Siberian predators or hint them to make your next meal. Find weapons and other survival tools or craft it yourself! But be really careful! Outdoor temperature might be about -30 degrees, build a fire to keep yourself warm! Hunt animals to feed your character, cut trees to get wood and use your loot to build a house and stay alive! Don’t forget to check survivor’s status – don’t let it become red! Keep yourself fed, warm and sleep well. It’s the only chance to survive in this extreme conditions! Try Siberian Survival: Cold Winter – great game to overcome the fear of freezing cold!<br/><br/>Siberian Survival: Cold Winter features:<br/><br/>-\tExplore cold Siberian badlands – snow-covered forests inhabited by dangerous predators<br/>-\tVarious survival tools to find and craft new ones – clothes, weapons, matches, wood to make a fire and others<br/>-\tUse your loot carefully – mind all the survivor’s indicators and statuses to stay alive<br/>-\tHunt animals to find food and protect yourself from predator’s attacks<br/>-\tUltimate survival simulator in extreme winter conditions<br/><br/>Are your ready to survive in cold mystic badlands? Start your own survival story! Explore Siberian woods, hunt animal and build shelter not to freeze to the full! Upgrade your survival skills hunting, gathering and crafting! Dress warmly in new armor of Siberian predator's skin and go in search of adventure on the frozen expanses of the game! Enjoy Siberian Survival: Cold Winter game in 3D!", "metacritic": null, "released": "2015-11-19", "tba": false, "updated": "2019-08-12T04:43:24", "background_image": "https://media.rawg.io/media/screenshots/9d6/9d621b7f9f57ca70742a917f479aa381.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Adventure", "Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}