{"id": 73133, "slug": "juice-jam", "name": "Juice Jam", "name_original": "Juice Jam", "description": "MATCH. JUICE. SERVE. REPEAT! The Juice is loose in this fun filled match 3 puzzle game! <br/><br/>The creators of the hit game, Cookie Jam, present a juicy new puzzle game with bushels of fruity challenges! Join Kiwi, Mango, and the rest of the Juice Jam gang as you travel through hundreds of new worlds. Embark on this fruity match 3 adventure today! <br/><br/>Features:<br/>◆ Hundreds of juicy levels!<br/>◆ Brand new power-ups and ways to play!<br/>◆ Jam fruit to concoct sweet treats! <br/>◆ Swap and blast your way through ever expanding new worlds!<br/>◆ Check back often for events, free rewards and new levels!<br/>◆ Free and filled with adventure!<br/><br/>Join us in Juicetopia as Kiwi and Mango tour whimsical lands serving juice to thirsty customers! With a cast of quirky characters, a richly detailed world and addictive match-3 gameplay, Juice Jam is sure to satisfy!<br/><br/>LIKE: https://www.facebook.com/JuiceJamGame<br/>FOLLOW: https://twitter.com/juicejamgame<br/>LEARN: www.juicejam.com<br/><br/>DEVELOPER INFO: Jam City is the leading developer in truly cross-platform social gaming! If you like Juice Jam, then you'll really love Cookie Jam, Panda Pop, Genies &amp; Gems, and Sugar Smash: Book of Life. Check out our other free match 3 puzzle games! Swap, match, and crunch through ever expanding levels and events. Check back often to see all the new candy, cake, and sweet treats that we've added! You'll love to crush through each sweet puzzle. Begin your adventure on this free match three puzzle game today!", "metacritic": null, "released": "2015-03-31", "tba": false, "updated": "2019-10-22T14:25:33", "background_image": "https://media.rawg.io/media/screenshots/66c/66c7df85a8d6fa5c871df6a563acb6b3.jpg", "website": "http://www.juicejamgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jam City"], "genres": ["Arcade", "Puzzle"], "publishers": ["Jam City"], "esrb_rating": "Everyone 10+"}