{"id": 731309, "slug": "parasoul", "name": "ParaSoul", "name_original": "ParaSoul", "description": "Run, Jump, Glide, Move\r\n<p>In a murky, urban, environment, a lone android encounters a glowing piece of technology discarded by the elite inhabitants of the upper city. However, discovering this invaluable item comes with a cost. Residents of the lower levels know anyone who acquires \"upper-tech\" immediately becomes hunted by Under City Enforcement Units and are never seen again. When the only viable option for evading capture by hostile forces is to run, how far would you go to challenge the system and change the world?</p>\n<p><em>ParaSoul</em> challenges players to move proficiently through each section of it's futuristic, cyberpunk inspired skyscape as they explore each section of the city. Only by obtaining pieces of forgotten cybernetic enhancements can players hope to defeat the oppressive forces mounting against them.</p>\r\nEscape the Neon City\r\n<ul><li>Traverse elevated rooftops while exploring the smog-ridden city\r\n</li><li>Dodge hostile drones and laser-emitting turrets to climb above the clouds\r\n</li><li>Upgrade your abilities to overcome the city's final challenge</li></ul>\r\nAscend Through the Cloud Cover\r\n<p><em>ParaSoul</em> was made in collaboration with the Creative Media and Digital Culture Program (CMDC Program) at Washington State University Vancouver. The development team is incredibly grateful for the support and resources the CMDC program provides that allows our team to continue working remotely.   <br/><br/>CMDC Program | @CMDC_WSUV </p>", "metacritic": null, "released": "2022-01-30", "tba": false, "updated": "2022-01-31T11:15:11", "background_image": "https://media.rawg.io/media/screenshots/5d0/5d0552fc322273fc0fb4a0900508278a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CMDCStudios"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}