{"id": 73131, "slug": "sugar-smash-book-of-life", "name": "Sugar Smash: Book of Life", "name_original": "Sugar Smash: Book of Life", "description": "Match sugar candies and rainbow drops to master this fun and challenging match-3 puzzle adventure inspired by THE BOOK OF LIFE!<br/><br/>Help Manolo, Maria, and Joaquin collect an assortment of delicious treats and beautiful charms as they prepare for an epic fiesta! Travel through amazing worlds like the colorful Land of the Remembered and the enchanting Land of the Living!<br/><br/>Remember, always play from your heart!<br/> <br/>Features:<br/>• Hundreds of exciting levels themed to the animated movie<br/>• Featuring the voices of Channing Tatum, Zoe Saldana, Christina Applegate, Diego Luna, Ron Perlman, and Ice Cube!<br/>• Sugary sweet churro challenges and fun power-ups, like 'Chuy Charge’ and Piñata Bombs!<br/>• Connect to Facebook to send lives and gifts! Share all the fun with your friends!<br/>• Free to play with regular updates including new levels, challenges, obstacles and more!<br/>• Spend a minute to learn it and a lifetime enjoying it!<br/>• Fun New iMessage Stickers! Use them to sweeten up your conversations today! <br/> <br/>Like on Facebook: https://www.facebook.com/bookoflifegame<br/>Follow on Twitter: @BookOfLifeGame<br/>Visit our official website: http://www.bookoflifegame.com/<br/> <br/>Having trouble?  Visit our support page: https://bookoflife.zendesk.com<br/><br/>DEVELOPER INFO: Jam City is the leading developer in truly cross-platform social gaming.  Chart-topping hits include the successful match-3 puzzle game, Cookie Jam, Panda Pop - Bubble Shooter, Juice Jam, Genies &amp; Gems and so many more! Wherever you are, pick up and play today.<br/><br/>The Book of Life: Sugar Smash is free to play, but you can purchase in-app items with real money. In addition, this game may link to social media services such as Facebook in order for you to share and play with others. Jam City will also have access to your information through such services.  Some aspects of this game will require the player to connect to the internet. In-app purchases may be disabled by adjusting your device’s settings.<br/><br/>This game is not supported by the iPod Touch 4 and is only supported on the iPhone 4s and up.", "metacritic": null, "released": "2014-10-07", "tba": false, "updated": "2019-07-29T07:30:23", "background_image": "https://media.rawg.io/media/screenshots/965/965403243e89d309ac40e21dcde542db_LHbVxlv.jpg", "website": "http://bookoflifegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jam City"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Jam City"], "esrb_rating": null}