{"id": 73148, "slug": "baldis-basics-ultimate-custom", "name": "Baldis Basics Ultimate Custom", "name_original": "Baldis Basics Ultimate Custom", "description": "Collect all your bravery and math knowledge, as five horrific nights awaits you. Prepare yourself to spend five nights at Baldi’s basics school. Freddy is a cute plush bear comparing to this monster of education and learning. Hide at any available place, as if this horrific teacher reaches you, he will first frighten you and then, he will make you solve basic mathematical equations. So keep your notebook nearby, as you never know, when you will have to solve basic mathematical equations. Now you can customize this game: choose characters, which will wait you in Baldi’s basics school and distract you from your target: collecting notes. To escape Baldi’s Basics school, you have to survive there for five nights. Can you deal with this problem and do not let Baldi or other characters, which you have chosen, frighten you? Find out in our new education and learning simulator: Baldi’s Basics Ultimate Custom.<br/><br/>In this learning and education simulator, you would better play accurately, as minimal noise will unravel your location to Baldi. You have to survive five nights in Baldi’s Basics school, but this is not that simple, as it seems. Horrific teacher- Baldi is chasing you, and he is more frightening than freddy. Also, you have to choose characters, who will help Baldi in frighting you. So hide and sneak for as long as you can, because if they notice you, Baldi will frighten you as much as freddy will never frighten, and make you solve basic mathematical equations in your notebook. So make sure you will use your notebook rarely. Do not let Baldi catch you. Sneak and hide for as long as you can, survive these five horrific nights and escape Baldi’s Basics school. Call your friends and find out, who will escape faster from Baldi’s basics school, in our education and learning simulator.<br/><br/>Baldi’s Basics Ultimate Custom is a free to play education and learning simulator, in which you will have to sneak and hide from horrific teacher-Baldi and characters, which you have chosen. Five nights of horror awaits you in Baldi’s Basics school. Get ready to be caught by Baldi, or his teammates, they will make you solve mathematical equations in your notebook, so try to meet them as rarely as you can. Mathematics is worse than usual fear, which makes Baldi more frightening than freddy. Gather your friends and find out who will solve less mathematical equations in his notebook and will have less meetings with Baldi. Survive these five nights and escape Baldi’s Basics school in our new education and learning simulator.", "metacritic": null, "released": "2018-07-29", "tba": false, "updated": "2019-10-22T14:25:34", "background_image": "https://media.rawg.io/media/screenshots/b7b/b7b828756e947d509ed5e2e62cb1a193.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Denis Sandakov"], "genres": ["Adventure", "Simulation"], "publishers": ["Denis Sandakov"], "esrb_rating": "Everyone 10+"}