{"id": 731519, "slug": "im-the-echo-when-you-call", "name": "I’m the Echo when You call", "name_original": "I’m the Echo when You call", "description": "<p><em><strong>I’m the Echo when You call </strong>is my submission to the non-ranked Interact-If 2022 Game Jam. The theme is “Red Herring”.  </em></p>\n<br/>\n<p><em>You are a <em>Liminari</em> - a scholar who has committed sacrilege by pursuing forbidden knowledge in hopes of evolving into an Old One, a being who can break itself out of the curse of the ouroboros, become a master of its own life and death; a god.\r\n</em></p>\n<p><em>During one of your solitary voyages into the Great Nothing, you encounter a rare phenomenon - a dying soul, struggling to rally its last moments. \r\n</em></p>\n<p><em>Will you watch it die, or will you feed it enough of your vitae to see it restored? How will the encounter change you? If at all.</em></p>\n\n<p><em><em>The plot is told in a series of scenes inspired by diaries or journals that depict an expedition or research of some kind.</em></em></p>\n<p><em><strong>Setting:</strong> dark fantasy, romance</em><br/></p>\n<p><em><strong>Warning:</strong> body horror (mentions of rituals involving blood and mutilation, self-inflicted injuries, human sacrifice. (MC’s current body is that of an undead - details mostly undetermined, up to the player), descriptions of death and violence, religious themes (MC doesn't follow a god, though gods do exist, not as deities that rule over humanity but separate beings (think eldritch horrors style), possible depersonalization and derealization.\r\n</em></p>\n<p><em><strong>Rating:</strong> 17+</em></p>\n<p><strong>If you experience any issues with the web build (such as blurry screen, laggy music) please try using a different browser or download the file. </strong></p>\n\n<ul><li><em><em>soon-to-be-god MC (customizable name, pronouns, background), </em>\n</em></li><li><em><em>an undead (?) companion (gender selectable) who is influenced by your choices and who influences MC’s future in turn,</em>\n</em></li><li><em><em> 18.000 words in total, approximately half an hour per single playthrough (for the average reader),</em></em></li><li><em><em> 6 possible endings.</em></em>\n</li></ul>\n\n<p><em>Either foolishly brave or simply desperate, the soul that followed from to the edge of the Great Nothing seems less like a mongrel holding onto its last tread of survival and more like a knowledge-hungry scholar. </em></p>\n<p><em>Though (temporarily) lacking a corporeal body, the soul doesn’t lack in personality. The unexpected disruption sure does keep you on your toes, shattering - though not hindering - your pursuit of godhood. \r\n</em></p>\n<p><em>Why does the soul keep lingering around you, you have no idea... but as anything in the universe, it has to have a reason. </em><em>At any rate, the insight provided quickly becomes invaluable to your research. </em><em>Who knows, maybe the last step to breaking the last circle is closer than you think?</em></p>\n<p>Playlist [ECHO]</p>\n\n<p><strong>Engine:</strong> [Ren'Py by Tom Rothamel]</p>\n<p><strong>Writing, GUI, coding, art:</strong> PDRRook </p>\n<p>[Twitter] [Tumblr] </p>\n<p><strong>Editors: </strong>[Steph 'Jeneara' M]</p>\n<p><strong>Beta players:</strong> [berbicacho, Meira]</p>\n<p><strong>Fonts, Free for Personal and Commercial Use: </strong></p>\n<p>[Catharsis Requiem]</p>\n<p>[RM Almanack]</p>", "metacritic": null, "released": "2022-01-29", "tba": false, "updated": "2022-01-31T12:02:44", "background_image": "https://media.rawg.io/media/screenshots/da9/da99e5562c4270e700dec69d21a525b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["PDRRook"], "genres": [], "publishers": [], "esrb_rating": null}