{"id": 731717, "slug": "bitlogic-msx-a-cyberpunk-arcade-adventure", "name": "Bitlogic MSX, A Cyberpunk Arcade Adventure", "name_original": "Bitlogic MSX, A Cyberpunk Arcade Adventure", "description": "<p>   You might be wondering if within the Virtual World there is such thing  as life. You might also wonder if between the millions of clusters of  data that move through your system, there could be something similar to  an intelligent and self-conscious being.\r\n</p>\n<p> Inside a cybernetic world, Bit is alive. He is looking for something. He  lives in a strange city full of droids and robots. Bit has a gun that  he use to destroy enemies. But why?\r\n</p>\n<ul><li>Inmerse yourself in Bit's universe and dare to uncover the secrets behind the source code.\r\n</li><li>Explore, defend yourself and find the correct way to the heart and soul of Bitlogic.\r\n</li><li>May the virtual world be as real as the physical \treality? \r\n</li><li>Can a bodyless entity be considered as an intelligent and living being? \r\n</li><li>Would Bit be able to find the anwswers for all his questions? \r\n</li><li>His fate is in your hands player!  \t\t\t\t\t\t\t\r\n</li></ul>\n<p>This Bitlogic version is the orginal <strong>MSX game</strong>.</p>\r\n\r\nCreated by OXiAB Game Studio crew in 2016\r\n<p><strong>Release date:</strong> June, 18th 2016 (In 49 RUMSX)</p>\n<p><strong>Genre: </strong>Platforms - Arcade single player\r\n    </p>\n<p><strong>Current Plataforms: </strong>MSX Compatible computers with 16k RAM<br/></p>\n<p><strong>Languages:</strong>  English<br/></p>\r\n\r\nStory\r\n<p>You might wonder if within the Virtual World there is such thing as life. You might also wonder if between the millions of clusters of information that move through your system, there could be some intelligent and self-conscious being.</p>\n<p>Bit can help you to find an answer for that, the same way you can help him complete his mysterious journey. Both of you will move as one in a perfect User-Avatar interaction thanks to this advanced software.</p>\n<p>Will you be able to find out what is Bit’s mission</p>\r\nControls\r\n<p>Use <strong>Cursors or Joystick </strong>to move Bit through areas.<br/>Press <strong>Space bar or Joystick Button 1</strong> to shoot.<br/>Press <strong>M key or  Graph key or Joystick Button 2</strong> to open stats and to see the map.</p>\r\nItems &amp; Goals\r\n<p>In this game you must move Bit through <strong>5 different areas.</strong></p><p>Along areas, you can pick up some <strong>CHIPS</strong>. These chips are used to open <strong>DOORS</strong>. Each door needs a different number of chips to opened.</p><p>There are some <strong>SPECIAL ITEMS [CARTRIDGES]</strong>. One in each area. These items give you an extra life and they will reveal some information about Bit's mission.</p><p>You have an <strong>ENERGY BAR </strong>that starts to decrease if you are in contact with an enemy.</p><p>You can defeat <strong>ENEMIES</strong> shooting at them. Some of them need more than one impact to die.</p><p>Bit is heavy and he can’t jump. You must find the path to pick up all you need to end your mission. Feel free to fall from any height. Bit will not be injured after falling.</p>\n<br/>\r\nGreetings<p>People from Karoshi Forum, AAMSX Staf for their support.</p><p>Special thanks for support and testing:<br/>Xavi Guillorme - Tux VGSource\r\n<br/>Arnau Castellvi - Napalm<br/>Fran - Nenefran<br/>People from Gamemuseum<br/>Chloroplast Games<br/>Jose Maria - Octopusjig<br/>People from CustomMSX<br/>People from MSX Boixos Club<br/>People from Un Pasado Mejor\r\n</p>Credits\r\n<p><strong>Code &amp; Level Designer &amp; GFX ingame:</strong><br/>JamQue(Rafel Pérez)</p><p><strong>Main Graphics GFX ingame: </strong><br/>Joan Redondo</p>\n<p><strong>Script:</strong><br/>Tolken (Alejandro García)</p>\n<p><strong>Music:</strong><br/>Juan Antonio Maldonado</p>\n<p><strong>Testing &amp; Ideas:</strong><br/>Fubu (Alberto Gutiérrez)</p>", "metacritic": null, "released": "2022-01-29", "tba": false, "updated": "2022-01-31T12:50:07", "background_image": "https://media.rawg.io/media/screenshots/110/110e115f783ca7aad72ea126967df380.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JamQue - Rafel Pérez - Game Developer"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}