{"id": 73172, "slug": "super-ko-boxing-2-free", "name": "Super KO Boxing 2 Free", "name_original": "Super KO Boxing 2 Free", "description": "NOW SHARE YOUR ACHIEVEMENTS ON GAME CENTER. THIS IS THE FULL GAME COMPLETELY FREE!<br/><br/>OLD FASHIONIONED BEATDOWNS - Go toe-to-toe against a cast of bone-crushing boxers with unique moves and personalities<br/><br/>JUST ADDED:<br/>The all-new Roid Rage feature!<br/><br/>READY FOR AN OLD FASHIONED BEATDOWN?  As the K.O. Kid, you return to the ring to face the most outrageous face-breaking opponents who’ll use sneaky tactics and dirty distractions to knock you out.  To be the champ, figure out each fighter’s tells, avoid their signature moves, and when the time is right unleash a super punch to knock ‘em out!<br/><br/>15 OUTRAGEOUS OPPONENTS<br/>Go toe-to-toe against a cast of bone-crushing boxers with unique moves and personalities including 15 Cent, Shogun, and Ka-Rak Übones.<br/><br/>DEVASTATING SIGNATURE MOVES<br/>Use quick reflexes to dizzy opponents, throw powerful hooks, unleash flaming super punch combos, and land one-two lightning KO’s. To go the distance, you will need to watch out for opponent’s weaknesses and avoid their signature moves.<br/><br/>CIRCUIT MODE<br/>Box your way through 18 bouts across 3 circuits to become the Champion of the world!<br/><br/>CHALLENGE MODE <br/>Would you be able to defeat your opponent if you weren’t able to dodge and couldn’t get hit? Face this and 16 other unique challenges that test your skills.<br/><br/>ENDURANCE MODE: <br/>Test your courage to see how many fights you can win without ever getting knocked down against increasingly tougher opponents.<br/><br/>ACHIEVEMENTS<br/>Earn over 65 unique achievements to unlock concept art that includes character sketches, early concepts, and boxers that did not make it into the game<br/><br/>ROID RAGE<br/>Are you coming unstuck against some of the trickiest bone-crushing contenders in the game? Just purchase a dose of Roid Rage to turn into a monster fighter, with more powerful punches and become almost impossible to take down. Use your Roid Rage whenever you've exhausted your natural abilities to take down the toughest opponents! <br/><br/>Getting pummeled by your opponents? <br/>Visit www.superkoboxing2.com<br/>for tips and tricks!<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com/privacy<br/>- If you have a problem with this game, please use the game’s “Help” feature.<br/><br/>FOLLOW US at<br/>twitter.com/glumobile<br/>facebook.com/glumobile", "metacritic": null, "released": "2009-10-19", "tba": false, "updated": "2019-07-29T07:58:57", "background_image": "https://media.rawg.io/media/screenshots/b38/b38c8c920658b70df1c46a9b46d362a4.jpg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Glu Games"], "genres": ["Simulation", "Sports"], "publishers": ["Glu Games"], "esrb_rating": null}