{"id": 73196, "slug": "bridge-builder-crane-driving-simulator-3d", "name": "Bridge Builder - Crane Driving Simulator 3D", "name_original": "Bridge Builder - Crane Driving Simulator 3D", "description": "Build the bridge of your dream with Bridge Builder - Crane Driving Simulator in 3D! Try this construction simulator and feel like a real crane operator constructing bridges in city areas, valleys or over canals! <br/><br/>Do you like architecture? Be a bridge engineer with Bridge Builder - Crane Driving Simulator 3D and feel like a heavy machine operator on duty! Explore construction site inside, build bridges and have fun!<br/><br/>Your goal as a professional bridge engineer is to build bridges in the different parts - hills, valleys, canals, and rivers. Drive heavy construction vehicles such as tower crane, sand excavator, transporters and more to build huge bridges! Use your civil engineering and physics knowledge to design and build bridges in the city with your builder crew!<br/><br/>Play this realistic construction simulator to feel like a tower crane operator, truck driver or another machinery operator! Prove your worth as a construction worker! Upgrade your driving skills operation heavy machines such as cranes, trucks, and excavator and have fun with Bridge Builder - Crane Driving Simulator 3D game!<br/><br/>Bridge Builder - Crane Driving Simulator 3D features:<br/>Heavy construction machines to operate – cranes, truck, excavators and more<br/>Build bridges in different areas - hills, valleys, canals and rivers<br/>Detailed 3D graphics<br/>Realistic construction simulator<br/>Great architecture, construction and driving experience<br/><br/>Feel like a real construction worker, tower crane operator or even an architect! Test your skill with Bridge Builder - Crane Driving Simulator in 3D!", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-08-12T04:58:14", "background_image": "https://media.rawg.io/media/screenshots/79e/79eb3adaded652263c20902a55a4c186.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Strategy", "Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}