{"id": 73197, "slug": "offroad-bull-dozer-truck-winter-snow-mountain-hill", "name": "Offroad Bull-Dozer Truck: Winter Snow Mountain Hill Landslide Clearing", "name_original": "Offroad Bull-Dozer Truck: Winter Snow Mountain Hill Landslide Clearing", "description": "Winter  is coming and Winter is the coldest season of the year. In the snowfall season highway roads and streets blocked with all the snow and snow piling everywhere blocking the way. <br/>\t\t\tTraffic jam is the major issue. Car ,Truck ,bus and even all heavy vehicles can’t move around due to frozen slippy roads.Traffic mobility is very important because<br/>it’s a Christmas time and in Christmas holidays people are planning family reunion and dinner for Christmas but stuck at home due to snowfalls and frozen roads.<br/>\t\t\t So its time to do part time job and you got part time job in Metropolis and your job responsibilty and duty is to drive heavy snow plow truck vehicle and clear the countryside ice frozen slippy roads as well as all road is blocked with a big pile of snow. Your core duty as a Metropolis snow rescue team worker is to remove the ice and clear the roads.<br/>              \t\tYour duty in on off-road hilly side mountain and it is basically a hill station people mostly visit hill station and enjoy snow fall in hilly area so its time to drive plow truck on steep mountains and drive uphill to the dangerous snowy mountain with snow cover wintry terrains and slippery asphalt are extremely dangerous for driving and excessive snowfall and land sliding are major issue. Excessive snowfall is on  different location across mountain. Your major duty is to remove all stones and clear all frozen ice on the roads due to excessive snowfall and land sliding so traffic can mobilize smooth and safe and tourist enjoy their hill side vacations.Use your hill climb truck driving as well as construction side operating skills of gigantic crane excavator operator in slippery tracks .<br/>\t\t\tSnow Plow truck look like a planer or bulldozer . Dump all the snow on the dumping side and try to clear all the road that is caused by excessive snowfall and land sliding . So try to dump all the snow by buldozer planer truck and try to dump all the snow.<br/><br/><br/><br/> Features of Winter Snow Plow Truck <br/><br/>-&gt; Driving experience in a realistic  effects of snowy weather<br/>-&gt; Plow truck (bulldozer) with real life physics in driving truck simulation in hill station and test you’re driving skills level<br/>-&gt;  Enhance your driver experience for mega vehicles<br/>-&gt; Real excessive snowfall and slippy land sliding effect. <br/>-&gt; You got limited time to clear your frozen ice stones so be as fast as possible<br/>-&gt;  In hill station Traffic Vehicles includes Buses,Trucks and Cars.<br/>-&gt;  Huge 3D snowy landscape environment.<br/><br/>Winter Snow Plow Truck is very challenging snow truck driver game Enjoy adventure game for this winter season 2016.<br/><br/>Free To Play Game!", "metacritic": null, "released": "2016-01-22", "tba": false, "updated": "2019-10-22T14:25:35", "background_image": "https://media.rawg.io/media/screenshots/c8b/c8b2ea7aeaf7f368f09a07ac505d5288_rcHjk7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Adventure", "Simulation"], "publishers": ["Syed Shahzad"], "esrb_rating": null}