{"id": 732062, "slug": "endless-runner-ehdinayan", "name": "Endless Runner (Ehdinayan)", "name_original": "Endless Runner (Ehdinayan)", "description": "<p><strong>Endless Runner</strong> es el proyecto más completo en el que he trabajado hasta ahora. Forma parte de la formación Gmetrix para la certificación oficial Unity, <br/>por eso incluye un trabajo que pasa por varios aspectos del desarrollo de un videojuego: <br/></p>\n<p>efectos de cámara, importación de assets,  animaciones y su configuración, optimización de código, instanciación de elementos, detección de posiciones, scroll programming, corrutinas de inserción de elementos, UI GameOver Screeners, métodos de inserción y reproducción de audio, etc.</p>\n<p>He añadido una pantalla de presentación con música Egipcia por diversión y para tener una pantalla de inicio.<br/></p>\n<p>En el juego  básicamente hay que saltar, así que si al principio cogemos el ítem doble salto y lo usamos inmediatamente, alcanzaremos a coger el escudo. <br/>A partir de ahí podemos concentrarnos en los coins. <br/>Algunos bloques son difíciles de saltar sin tocarlos, pero no es imposible. Es importante contar con la protección del escudo el mayor tiempo posible. <br/></p>\n<p>Si el protagonista queda detrás de un obstáculo y acaba desapareciendo por el lado izqdo. de la pantalla, el juego finalizará. Si tocamos 3 veces con un obstáculo el juego finalizará, y si caemos por el espacio entre las plataformas el juego finalizará también. <br/></p>\n\n<p><strong>English</strong></p>\n\n<p><strong>EndlessRunner</strong> is the most complete project I've worked on so far. It is part of the Gmetrix training for the official Unity certification, that is why it includes work through several aspects of a video game developement: camera effects, assets import, animations and their configuration, code optimization, elements instantiation, position detection, scroll programming, element insertion plots, UI GameOver Screeners, audio insertion and playback methods, etc. </p>\n<p>I have added a start screen with real Egyptians music. Maybe a bit hilarious but it has been for fun and to have a start screen.<br/></p>\n<p>In the game you basically have to jump, so if at first we take the double jump item and use it immediately, we will reach power shield. <br/>From there we can concentrate on coins. Some blocks are difficult to avoid  without touching, but it's not impossible. <br/></p>\n<p>It is important to maintain shield protection as long as possible. If player remains behind an obstacle and ends up disappearing on the left side of the screen, <br/>the game will end. If we collide 3 times with an obstacle the game will end, and if we fall through platforms space the game will end as well.</p>", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-01-31T14:14:19", "background_image": "https://media.rawg.io/media/screenshots/134/1345fa4a5d0df55f440df666fa4736f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ehdinayan"], "genres": [], "publishers": [], "esrb_rating": null}