{"id": 732060, "slug": "pong-tribute-ehdinayan", "name": "Pong Tribute (Ehdinayan)", "name_original": "Pong Tribute (Ehdinayan)", "description": "<p>Es mi primer trabajo de aproximación a Unity y al desarrollo de videojuegos. Se trata de un homenaje al <strong>Magnavox Oddyssey de Ralph Baer - Pong de Atari y Nolan Bushnell</strong>,  según se mire jejej.</p>\n<p> Creo que es buena idea idea dejar un enlace aquí a un buen documental, que explica ésta anécdota y muchas otras. <br/>Es bonito hacer una réplica del primer videojuego que existió, así que me he esforzado en que se pareciera bastante.</p>\n<p>Básicamente es un multiplayer local o contra IA con una escena demo de presentación.</p>\n<p>He dejado los niveles de forma que fuese jugable para la mayoría de personas creo. <br/>Me ha ayudado mucho el curso de PUE Alumni y también éste tutorial.</p>\n<p>Player1 usa flechas direccionales inf y sup. Player2 usa w y s.</p>\n\n<p><strong>English<br/></strong></p>\n\n<p>It's my first approach to Unity and video game development. This is a tribute to the <strong>Magnavox Oddyssey by Ralph Baer - Pong by Atari and Nolan Bushnell</strong>, <br/>depending on how you look at the facts xd. <br/></p>\n<p>I think it's cool to leave a link here to a good documentary, which explains this tales  from videogames history and many others. <br/></p>\n<p>This  is a nice work , so I have made an effort to give it as similar appearance as possible to its predecessor.</p>\n<p>It's basically a local multiplayer or against IA with a demo scene as presentation. <br/>I've left velocity levels and so to be playable for majority of peopple I think. <br/>I have been helped a lot by the PUE Alumni course and also this tutorial.</p>\n<p>Use arrows up &amp; down as well as w and s for player1 and Player2 move respectively.<br/></p>", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-01-31T14:13:51", "background_image": "https://media.rawg.io/media/screenshots/053/053e5d5f107c4760340268f4cf35ce0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ehdinayan"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}