{"id": 732016, "slug": "treasures-of-ehmun", "name": "Treasures of Ehmun", "name_original": "Treasures of Ehmun", "description": "<p>Being one of the most prolific Tomb Raiders of the Continent, navigating hazardous environments has become second nature to Nailah, thus she usually has little to worry about, when venturing out into the unknown.</p>\n<p>Not only is she a masterful wielder of the scimitar, but she is also equipped with the Eye of Suroh, an artifact she has retrieved, on one of her prior expeditions. \r\n</p>\n<p>Its reality bending properties alow her to change all of her momentum into the direction of her choise, in order to overcome every obstacle. \r\n</p>\n<p>But despite that, there was still a chill running down her spine, upon entering the Temple of Ehmun. <br/></p>\n<p>Cause of that is the curse, that the mad ruler laid upon his resting place with his final breath, wich consumes your every being by just  the slightest touch of the countless spikes.</p>\n<p>Furthermore, the Souls of the perished are being shaped into abhorrent mummified feinds wich scour the tomb. </p>\n<p>However, where there is risk there is reward. </p>\n<p>According to Nailah's intel there are well over a thousend ancient gold coins, as well as three highly valuable Power Crystals to be collected.</p>\n\n\n<p>Controls\r\n</p>\n<p>Keyboard:      AD to Move     W/Space to Jump      Left Mouse to Attack      Right Mouse while in Air to use Momentum Switch      Escape to Pause</p>\n<p>Gamepad:      Left Control Stick to Move      Lower Button to jump      Left Button to Attack      Right Trigger while in air to use Momentum Switch      Start to Pause</p>\n\n<p>\n</p>", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-01-31T14:01:10", "background_image": "https://media.rawg.io/media/screenshots/2de/2de198183368afc1664e2376e5679f2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JonaMuske"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}