{"id": 73211, "slug": "bakery-cashier-blitz-best-supermarket-coffee-salon", "name": "Bakery Cashier Blitz: best supermarket coffee salon game For Kids", "name_original": "Bakery Cashier Blitz: best supermarket coffee salon game For Kids", "description": "Girls, boys, men, women and children all love fast food, especially burgers, hotdogs, hamburgers, pizza, nachos, burritos, fries, shakes, slush, pancakes with syrup. BAKERY CASHIER BLITZ bring you the most fancy time management game which will be scrumptious and delicious to play. So Sit back and relax and enjoy serving customers in this Bakery cashier simulation game.<br/>All type of fast food is made fresh in bakery in the city by top chef of down town. Your chef and baker are perfectionist they love to cook and bake, your job is to sell the product from bakery counter and keep the customers happy. <br/>Supermarkets are full of tasty ingredients,but in supermarket cash register process is slow this Bakery Cashier is super fast and will complete your orders in no time. Cooking of cookies is fun so do to cook of candy, its like a story of fun and taste.<br/>This burger serving game will make your dream of cashier come true. You will operate cash machine and learn to manage cash. This simulation game will help you learn manage money, adding and subtracting total. A well thought out casual learning game for kids using simulation as a cashier in a fast-food truck company in remote city, what a hoot.<br/>You and your Papa has opened this chain of fast food joints serving burger fries, sandwiches shakes, mango and apple pies, nachos and chips, fish and tacos and soft drinks like cola, lime, orange twist and even plan water. Baking is you passion and Ernesto is your top baker. Sell his perfection baked goods with your papa’s delicious sauce by managing cash register.<br/><br/>FEATURES:<br/>\u2028Run your own fine Bakery and fast food joint.\u2028Serve customer in the que to gain experience points and cash.\u2028Your finest baked goods are your trade mark.\u2028Enjoy the best Graphics and stimulating and original background sounds.<br/><br/><br/>Disclaimer:<br/>BAKERY CASHIER BLITZ is FREE to download and play.", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-10-22T14:25:36", "background_image": "https://media.rawg.io/media/screenshots/40e/40ede4ddb60866421aae25bc32288921.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Simulation"], "publishers": ["Syed Shahzad"], "esrb_rating": null}