{"id": 73217, "slug": "war-of-cars-auto-attack-battle-demolition-mayhem", "name": "War Of Cars Auto Attack Battle Demolition Mayhem", "name_original": "War Of Cars Auto Attack Battle Demolition Mayhem", "description": "CARS, GUNS &amp; SHOOTING in 3D<br/><br/>DRIVE DEATH RACING CAR EQUIPPED WITH 3 XTREME MACHINE GUNS &amp; BLAST AWAY YOUR ENEMIES!<br/><br/>Mr. San comes to Gang wars and streets of our marvelous urban city looks like battle fields and war zones, there is fire, attack, shooting, blasts on roads, modern real auto weapons are creating mayhem in urban areas, Mr San is crazy enough to take the hell ride in gansta crime town and deal damage to gangster regions and territories and to prevent the power riots and shooting attacks, it’s his home town which is not like USA or Russia, and neither is he American or Russian, he comes from a distant beach near Middle East, Battle is refueled with ultimate armor car coming from a battle ship and is being chased by cops and thieves alike, general public is scared or this super fighting and motors shooting and bullet chasing in their home town, it is not impossible to crush the gun mania and weapon smuggling happening among mafia cartels, and Mr San is up for the Mission, confident of winning this battle and overcoming the war of gangs, he is the transporter of peace and very fierce and furious of the wild sin force happening in streets of war torn city. Dangerous gangster are on their moto cross and gangster on motocross can create the disturbance in the street .Guns are damaging and Guns Are protecting at the same time, rescue operations and survival training is a specialty of Mr. San. City Conditions are extreme Military and Army troops may intervene, enemy squad is attacking and our city needs a boost of refueled guns ammo because there is no rescue coming from air by jet or helicopter and all the battle fight is on streets. girls and boys as well as kids and family are also in urban city that comes from Miami beach as a tourist and they are on their world tour and they already visited LA, California.MR San take that duty to kill the enemy of the state and steel the  state. Mr san has Enthralling  duty and steel nerves to save the land from the king of the gangland after performing their duty!<br/><br/>Car Driving is fun but racing a sports car with modern weapon on roof of vehicle is mind blowing and looks out of this world, battle &amp; strike enemy and drive to different locations and paths and find more enemies and stop street crime of mafia.<br/><br/>If you like 3D simulation games, shooting games, car racing games and like to challenge yourself for the hardcore gaming experience then you are in for a real treat, you will like it, love it and share it as a perfectly crafted pack of cars and city buildings, roads, shops are included in this 3D racing, shooting action simulation game. it has guns, bullets, which travel like missiles, fire balls, explosions and extreme addicting game play, crazy mission with multiple objectives are included, auto viewing of reverse and smooth controls for acceleration and breaking, and one button shooting to ease the user experience. If you are in pursuit of sports cars and with shiny and smashing look and want to go crazy with fire power then play, enjoy and review.<br/><br/>Its Free To Play, we show ads when you are not playing!<br/><br/>- Game Features:<br/>• Sports Cars, Customized, Modified &amp; Equipped with Luxury Weapons<br/>• Smooth Driving and Physical effects <br/>• Shoot other enemy vehicles  <br/>• Burn the streets with fire at high speed<br/>• Seamless Urban City with real Feel and look<br/>• High Definition (HD) Graphics<br/>• High Precision (HP) Controls<br/><br/>------------------------------------------<br/>Fun Entertainment and Learning all in one place for girls and boys as well as kids and family!<br/>Like Us on Facebook:<br/>https://www.facebook.com/imagine.games.studio<br/>Follow Us on Twitter:<br/>https://twitter.com/imaginegames3d<br/>we will keep you updated!<br/>------------------------------------------", "metacritic": null, "released": "2015-11-09", "tba": false, "updated": "2019-10-22T14:25:36", "background_image": "https://media.rawg.io/media/screenshots/2ce/2ce85815ab66b9140f6ab96c4642ffb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Action", "Simulation"], "publishers": ["Syed Shahzad"], "esrb_rating": null}