{"id": 732248, "slug": "dual-feder", "name": "Dual Feder", "name_original": "Dual Feder", "description": "<p>Dual Feder is a small personal game about a badminton variant some friends and me came up with, once playing regular 2v2 got boring. We hope that our very innovative sport will one day be played at the Olympics, but getting anyone else on earth to play it would be a nice for starters too I guess. <br/></p>\n<p>Dual Feder is played two against two, with two shuttles in play simultaneously. Teams only score when both shuttles count for them at the same time. Shuttles on the ground can and have to be reentered into the game at any time.</p>\n<p>We found that this leads to a very energetic, scrappy way of playing badminton. With 2 shuttles in play there is always something going on and rapid decision making and reflexes are required. Deciding when to pick up a shuttle and when to focus on one still in play adds additional complexity. Opponents busy with pick-up create openings to exploit. At the same time we found the game can easily integrate new players, since whiffs on one shuttle can be compensated with another one still in play.</p>\n\n<p>I was talking about IRL here, Dual Feder the video game was made in 48h for GGJ2022 and is a very barebone representation. But it can teach you (our version of) the rules and show you some of the intricacies. I'm actually way less interested in making you play the video game than making you play for real. Seriously, you should look into convincing some people to play as soon as possible.  <br/></p>\r\nHow to play the (inferior to IRL) video game:\r\n<p><strong>Move: WSAD<br/></strong></p>\n<p><strong>Pick up shuttle: Hold LCtrl <br/></strong></p>\n<p><strong>Aim: Mouse</strong></p>\n<p><strong>Serve: RMouse</strong></p>\n<p><strong>Strike: LMouse (hold to powerstrike with lower arc)</strong></p>\n<p>The game has some rudimentary AI that should still make enough plausible mistakes to allow you to outplay it. Overall the game is a pretty buggy, underdeveloped mess. Sorry, I was a bit exhausted after releasing Red Tether the same week. The game is single-player only, which is meant as another reason for you to play Dual Feder for real instead.</p>\n\n<p>How to play IRL:</p>\n<p>- It is important to note that we made most of this up and you can do so too. Alter the rules to your preference, or don't play with defined rules at all. New rules are somewhat shunned in our group these days, since discussing rules means less time playing Dual Feder.</p>\n<p>- Shuttles are considered scoring until struck again by any player, meaning you can still make points while a shuttle is in hand or the air after being re-served.<br/></p>\n<p>\n</p>\n<p>- After scoring, both shuttles are to be recovered and served simultaneously. This is called an orderly serve.</p>\n<p>- It is considered bad form to not pick up a shuttle that scores for you but is out of pick-up reach for the opposing team. We usually call for a replay if someone is holding on for a scoring shuttle too long this way.<br/></p>\n<p>- A net isn't strictly required, you can make do with objects marking the field.<br/></p>\n<p>- Dual Feder can be played on grass, artificial flooring or on sand. I can confirm that it can even be played in waist high water.<br/></p>\n<p>- Weekly Dual Feder meetups can devolve into socializing very quickly. This can be nice, but keep in mind that your main goal should be to play as much Dual Feder as possible.</p>\n<p>- Negotiating unclear situations is a central part of the game and should be done in a respectful manner. Playing Dual Feder can get you some pretty mad gains in terms of thighs and... uhm... biceps definition or whatever? - but you'll also exercise your social muscles.<br/></p>\n<p>- Depending on where you are on earth it can be difficult to get everyone together at daytime. Search for open places with artificial light to play at night instead.</p>", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-01-31T15:02:12", "background_image": "https://media.rawg.io/media/screenshots/45d/45d5191e83d41ea06a27b07c2868e09d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sleeper_games"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}