{"id": 73229, "slug": "us-army-multistorey-truck-transportzombie-edition", "name": "US Army Multistorey Truck Transport:Zombie Edition", "name_original": "US Army Multistorey Truck Transport:Zombie Edition", "description": "Humans have fallen to the wrath of zombie apocalypse &amp; you are the last hope for the survivors.<br/><br/>  Transport army vehicles from army bases to the survivors, also called THE RESISTANCE. You are now a part of the resistance &amp; they depend on you. Take vehicles like SUV's, jeeps &amp; cars to the resistance to help them repel the zombie attack. Crush zombies on your way to clear your path &amp; complete mission objective. Also drive the cruiser jeeps to clear the path for the truck. Load &amp; unload the jeeps &amp; cars by driving yourself in the multistory truck.<br/>  Remember time is an essence. If you fail to complete your mission &amp; complete the delivery on time the resistance will fall.<br/>It's time to show your leadership. So are you ready?Lets go.<br/><br/>Features:<br/>• Thrilling Urban City Transport and Driving Sim of 2017<br/>• Variety of Transport Missions in this Offroad Adventure<br/>• Dangerous Urban City Turns, Jeeps, Truck, Helicopter and Much More<br/>• Beautiful 3D Graphics and Engaging Sound Effects<br/>• Enthralling Urban City Adventures With Best Transport Simulator<br/>• Dangerous Transport Missions And External Force Attacks<br/>• Multi Story Transporter Truck for More Vehicle Delivery per Trip <br/>• Advance Controls Of Cruisers, Trucks, SUV’s, Jeeps With Real Time Physics<br/>• 3D Graphics And Engaging Sound Effects<br/>• Transport Different Military truck vehicles like Cruisers, Trucks, SUV’s, Jeeps etc.", "metacritic": null, "released": "2017-08-01", "tba": false, "updated": "2019-10-22T14:25:36", "background_image": "https://media.rawg.io/media/screenshots/7e7/7e7a612f27fc4913fd783b79467d7b12.jpg", "website": "https://www.facebook.com/ticklestudio/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ghulam Mustafa"], "genres": ["Action", "Simulation"], "publishers": ["Ghulam Mustafa"], "esrb_rating": null}