{"id": 73238, "slug": "the-godfather-game", "name": "The Godfather Game", "name_original": "The Godfather Game", "description": "For the first time ever, The Godfather officially comes to you as a brand new mobile game in an untold tale of money, power, and corruption.  Don Vito Corleone has summoned you to enter the notorious criminal underworld of 1945 and become his devoted Underboss.  As second in command to the Godfather, YOU will be the one to carry out the Corleones’ dirty deeds and fight for the honor and respect of the most powerful Family in New York City.<br/><br/>Building a legacy won’t be a simple undertaking.  As your wealth and influence grow, unfortunately, so does your list of dedicated enemies.  Keep a watchful eye over your empire, as even a trusted ally could turn against you.  When hostilities arise, you will have to use strength, intimidation, and intelligence to protect your assets, as well as your honor.  Recruit your Capos and train them well, for vengeance is yours.<br/><br/>Every well-respected Boss needs a mansion.  Once you take control of your domain, you must find lucrative ways to enhance your resources and increase your wealth.  Blood is a big expense, but if necessary, be ready to engage in deadly warfare. Remember to keep your friends close and your enemies closer— you never know who will use your information for their own personal gains.<br/><br/>Can you maintain your loyalty to The Godfather?  Once you pledge your allegiance to the Don, there is no turning back.  Remember, it’s not personal...strictly business.   <br/><br/>Buona Fortuna.<br/><br/>KEY FEATURES<br/><br/>Build A Palace Fit For A Don-  Learn to run your lavish estate under direct guidance from The Godfather himself, Vito Corleone.<br/><br/>Mobilize Your Crew-  Gain protection by enlisting Capos and Soldiers to “handle” any misunderstandings and spy on untrustworthy rival families.<br/><br/>Establish Powerful Friendships- By helping your allies, favors will be returned to you. After all, the richest man is the one with the most powerful friends.   <br/><br/>Leave The Gun. Take The Cannoli.- Successfully complete tasks, and you will be generously rewarded.  Upgrade buildings and equipment, while improving your skills and weapons.  Make profitable investments, and then cook the books.<br/><br/>Go To The Mattresses- Defend your territories and declare war against rival Families in order to seize properties and accrue vast wealth.<br/><br/>Become A Legend- Secure your place as a “made man” amongst the Corleone Family.<br/><br/><br/><br/>**Please contact appsupport@hitcents.com if you encounter any issues.", "metacritic": null, "released": "2017-02-08", "tba": false, "updated": "2019-07-29T17:36:33", "background_image": "https://media.rawg.io/media/screenshots/d1f/d1fbd0e96b71a8d0bfa6e4460b1c5f20_4QbSlz7.jpg", "website": "http://thegodfathergame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hitcents.com"], "genres": ["RPG", "Strategy"], "publishers": ["Hitcents.com"], "esrb_rating": "Teen"}