{"id": 732328, "slug": "mouse-game-brian-puthuff", "name": "Mouse Game (Brian Puthuff)", "name_original": "Mouse Game (Brian Puthuff)", "description": "Mouse Game\r\n\n<p><strong>How to play</strong></p>\n<p>The object of the game is to move the mouse over all cells containing a cheese nugget. There are 50 cheese nuggets randomly placed within a single stage. Eat all 50 cheese nuggets and the stage is complete. There are 16 stages in total. Complete all 16 stages and the game will end.</p>\n<p>Note: Stage structures are randomly generated, so every play session will yield unique layouts.\r\n</p>\n<p>There are four cats that move about the stage. If the mouse makes contact with any of the four cats, the player loses that mouse. The player has an initial reserve set of mice. Every time a mouse is lost, one of the reserve mice are depleted and the game continues. If there are no reserve mice available, the game will end.\r\n</p>\n<p>After a specific duration of play in a stage, a coffee icon will appear at a random location within the stage. If the mouse consumes the coffee, all cats will move at a much slower rate of speed for a limited time.\r\n</p>\n<p>After a specific duration of play in a stage, a bonus icon will appear at a random location in the stage. If the mouse consumes the bonus icon, all cats will move at a much faster rate of speed for a limited time, however the player will get a major score increase.</p>\n<p>The player will be awarded an extra mouse to his reserve mice when the player's score reaches intervals of 10,000 points. If the player completes a stage without consuming the coffee icon, additional stage completion points are awarded.</p>\n\n<p><strong>Controls</strong></p>\n<p>The game supports keyboard and game controller controls. To use a game controller, ensure it is connected prior to starting the application. The game currently does not have hot plug checking, so if you lose game controller connection, you will need to close the game application and restart it after you've re-established connection.\r\n</p>\n<p>To move the mouse with the game controller, use either the left analog stick or the DPAD. To move the mouse with the keyboard, use the cursor keys or the following:\r\n</p>\n<p>w = UP\r\n</p>\n<p>a = LEFT\r\n</p>\n<p>s = DOWN\r\n</p>\n<p>d = RIGHT</p>\n<p>To pause the game during the game play, press the TAB key or the  GUIDE  BUTTON on the game controller.\r\n</p>\n<p>To start the game press the z key on the keyboard or the A BUTTON on the game controller.\r\n</p>\n<p>To exit the game application, press the ESC key on the keyboard at any time.\r\n</p>\n<p>To change the color palette, press , (comma) or . (period) to cycle forward and backward respectively through the palette options. If you are using a game controller, use may cycle through the palette options using the LEFT BUTTON (LB) and RIGHT BUTTON (RB) respectively.\r\n</p>\n<p>To save a screenshot of the game in progress, press v on the keyboard, or the Y BUTTON on a game controller.</p>\n\n<p>Note: Game screenshots are saved to the game folder. They are scaled to the size of the game window scale, and stored as .BMP files.</p>", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2022-01-31T15:23:08", "background_image": "https://media.rawg.io/media/screenshots/0b5/0b5a65b4c2e77971e001890cc5b2bf1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Brian Puthuff"], "genres": ["Action"], "publishers": [], "esrb_rating": null}