{"id": 73236, "slug": "frog-toss", "name": "Frog Toss!", "name_original": "Frog Toss!", "description": "Time to catapult your way to a mountain of prizes! It's just like back in the old days at the amusement park, launching frogs at rotating lily pads, but FROG TOSS! let's you do it on the go!<br/><br/>Launch frogs and land them in the spinning lilies to win! But this isn't the same game you remember from the old days. FROG TOSS! gives you the power to launch frogs at rapid speed, freeze the lilies in their tracks to line up shots, or even rain frogs from the sky! Did you run out of frogs? Don't worry, more will be hopping to your aid soon! Keep at it and you could earn tons of prizes, bonus frogs and some special surprises!<br/><br/>Features:<br/>- Easy to play yet still a test of your amphibian aiming skills!<br/>- Grab 5 different power-ups to enhance your frog launching prowess!<br/>- Collect 20 different prizes to earn special bonuses, making your power-ups even stronger!<br/>- The lilies change color! Match all the lilies to the same color for more bonuses, like extra frogs or even a shot at a rare prize!<br/>- Your frogs are hungry! Nab the buzzing flies and you'll attract more frogs for your catapult!<br/><br/>Watch for the update to add more prizes! <br/><br/>GAMEPLAY TIP: It is the length of your swipe that determines how far the frog is launched.  The speed of the swipe is not important.  Long swipes shoot far.  Short swipes for short launches.<br/><br/>Also check out:<br/>Coin Dozer<br/>Cookie Dozer <br/>Horse Frenzy", "metacritic": null, "released": "2011-02-18", "tba": false, "updated": "2019-07-29T13:56:02", "background_image": "https://media.rawg.io/media/screenshots/dba/dba81882c8d80fcb6ce9ee2b784b19bc.jpg", "website": "http://www.facebook.com/pages/Game-Circus/121175694606805", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Circus"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Game Circus"], "esrb_rating": null}