{"id": 732410, "slug": "the-adventures-of-ten-and-till", "name": "The Adventures of Ten and Till", "name_original": "The Adventures of Ten and Till", "description": "<p>The Adventures of Ten and Till is a bullet hell shoot-em-up developed by Japanese doujin designer Toro Nishino. Created by a single developer, the game offers a robust shooting experience that merges gorgeous lo-fi pixel art with challenging gameplay reminiscent of classic CAVE vertical shooters. It features unique mechanics like on-the-fly character-swapping, a risk-reward scoring system, a variety of challenging stages, and an emotionally-stirring soundtrack.</p>\n<p>・Intense bullet-hell gameplay inspired by famed CAVE shooters like DoDonPachi.<br />\n・9 stages (+ 1 special stage) and 10 boss encounters including a True last boss.<br />\n・2 different endings: Normal ending and True ending.<br />\n・2 playable characters that can be swapped on-the-fly with the press of a single button.<br />\n・Character-specific shot types as well as shared shot types.<br />\n・A risk-reward scoring system with score-based extends for racking up additional points.<br />\n・A shield mechanic that allows players to stack up to three barriers to absorb bullets.<br />\n・Unlockable side-bar art to customize your play experience.<br />\n・A breathtaking 25-track soundtrack that complements a touching story.</p>\n<p>“Please... Save Lowres...” The voice of Princess Pixel resonated within the hearts of Ten and Till.</p>\n<p>The peaceful land of Lowres had been swallowed by the “waves of evolution”<br />\nafter losing the protection of its beloved princess.</p>\n<p>Now, led by the voice of her Ladyship,<br />\nTen and Till don the “power of feelings” and set off on a journey...</p>\n<p>A journey to protect the light of Lowres...</p>", "metacritic": null, "released": "2020-05-06", "tba": false, "updated": "2023-11-06T00:35:09", "background_image": "https://media.rawg.io/media/screenshots/586/586cb5b79a52d305651d9b20334254fd.jpg", "website": "https://lionwingpublishing.com/the-adventures-of-ten-and-till", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Toro Nishino"], "genres": ["Action", "Shooter"], "publishers": ["LionWing Publishing"], "esrb_rating": null}