{"id": 732509, "slug": "maths-circus", "name": "M*A*T*H*S Circus", "name_original": "M*A*T*H*S Circus", "description": "<p>Definitely one of the best math titles ever made, M<em>A</em>T<em>H</em>S Circus is a collection of puzzle-like math-oriented activities for all ages.</p>\n<p>Although it may appear to be a program for young kids, don&#39;t let the circus themes fool you. The themes actually serve as clever hooks for problems and puzzles that cover many more subjects than math, and will appeal to math buffs of all ages. The Trapeze activity, for example, teaches you about pendulums, while Captain Blunthead in Cannon Shoot (my favorite game in this one) teaches about propulsion, angles, and more.</p>\n<p>There are twelve puzzles/activities in all, each with five levels of difficulty that range from very simple (for pre-schoolers) to very challenging (even for teachers and parents). The problems range widely in type, involving spatial reasoning, perceiving patterns in size, order or time, and manipulating a number of variables in order to help the circus performers do their tricks.</p>\n<p>With excellent game design, a wide variety of fun and original games, multiple difficulty levels, and superb educational value, M<em>A</em>T<em>H</em>S Circus is a must-have for parents looking for a solid math title, as well as gamers who don&#39;t mind a little mental exercise once in a while. Revised in early 1997, M<em>A</em>T<em>H</em>S Circus is now offered in a Windows 3.1/95 version with enhanced graphics and sounds, as well as support for players with disability. The series is also alive and well, with many sequels (called &quot;Acts&quot;) being released on almost a yearly basis.</p>\n<p>Highly recommended, and a worthy induction into our hallowed Halls of Belated Fame.</p>", "metacritic": null, "released": "1992-01-01", "tba": false, "updated": "2023-02-08T10:45:42", "background_image": "https://media.rawg.io/media/screenshots/a59/a596ce40b8142bc481a0d672abba7af4.jpg", "website": "https://archive.org/details/MATHSCircusDOS", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Educational"], "publishers": [], "esrb_rating": null}