{"id": 732581, "slug": "a-drop-of-your-blood_2nd-demo", "name": "A Drop Of Your Blood_2nd Demo", "name_original": "A Drop Of Your Blood_2nd Demo", "description": "<p>***<strong>This page is for the second demo of my game</strong>***</p>\n<p><em>A Drop Of Your Blood</em> is a first person horror game based on the Hmong culture.  The Hmong people is an Asian ethnic group in China and Southeast Asia.   This will be the first horror game to be based on our cultures, so I hope you guys will like it.\r\n</p>\n<p>This is a free demo for you guys to try out and give me feedback.\r\n</p>\n<p><strong>Background</strong>\n</p>\n<p>In the Hmong culture, there are a lot of traditions, myths, and stories passed down from generation to generation, but one of the most prominent one is the forbidden oath, also known as the blood oath.    In our culture, the blood oath is made by two lovers who want to be with each other for the rest of their lives.  To do the blood oath, you and your lover just simply poke each other's hands, drink a drop of their blood, and make a promise.\r\n</p>\n<p>The elders always told us to never do a blood oath with someone no matter how much you love them because if you do, you guys will be bound for life spiritually.  After that, if you or your lover die prematurely, your spirits will not be able to go to the afterlife until both of you are dead.  If one of the lover die before the other,  this usually results in early mysterious death of the lover who is still alive too.  The elders said that this is because the dead lover came back and took the other one with them.\r\n</p>\n<p><strong>The Story/Backstory of the game.</strong>\n</p>\n<p><em>\"In this lifetime, no, in all of time, I will love you and only you.  My heart, in which a drop of your blood has seeped into, will belong only to you.  This declaration, may the earth and sky bear witness to it.\"</em>\n</p>\n<p>The forbidden oath.\r\n</p>\n<p>Widely known as the blood oath.\r\n</p>\n<p>An oath make by two lovers who want to be with each other for the rest of their lives.\r\n</p>\n<p>It is formed when a couple drinks a drop of each other's blood.\r\n</p>\n<p>Unlike a wedding oath, it does not bind them together in the eyes of society.\r\n</p>\n<p>While the wedding oath binds each other together until death do them part, the blood oath binds them together in death.\r\n</p>\n<p>People do it for various reasons - for some, it is for proof of their love.  For others, it is done when one or both their parents refuse to let them join hands in marriage.\r\n</p>\n<p>For many lovers, they do not consider the consequence of the blood oath, thinking only of it as an act of formality.\r\n</p>\n<p>That is, until it is too late and they finally come to realize the weight of their promises.\r\n</p>\n<p>----------------------\r\n</p>\n<p>As you guys can probably tell by now, the game is about two lovers who decided to do the blood oath, also with my own twists in it too. \r\n</p>\n<p>That's all for now.  If you guys find any bugs or unwanted gameplay, feel free to send me a message either to my facebook fan page www.facebook.com/fueker , to my email fueker@yahoo.com, or here.\r\n</p>\n<p>If you guys like the demo, feel free to like my facebook fan page too, for new updates on the game!\r\n</p>\n<p>Thank you!\r\n</p>", "metacritic": null, "released": "2022-02-03", "tba": false, "updated": "2022-02-04T03:04:40", "background_image": "https://media.rawg.io/media/screenshots/c3b/c3b3c380ce1e8144c9fde5947ed44b92.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FueKer"], "genres": [], "publishers": [], "esrb_rating": null}