{"id": 732511, "slug": "oolite-an-open-world-space-opera", "name": "Oolite: an open-world space opera", "name_original": "Oolite: an open-world space opera", "description": "<p>Among the seven trillion people who are - at least officially - Cooperative citizens, you are nobody. So far, anyway. You&#39;ve got a ship, some weapons, and enough spare cash to get started - and one day, you might get the fame, wealth or glory you want. Perhaps one day, everyone might know your name. If, that is, you can survive that long.</p>\n<p>The two thousand star systems of the Cooperative once enjoyed a golden age of peace and prosperity, and perhaps the wealthiest of them can still pretend to. The trade ships that once safely travelled between planets now have to be well armed and escorted to fend off pirate attacks, from small-time criminals desperate for their next meal, to powerful robber barons extracting tithes from everyone who passes through their space.</p>\n<p>The Cooperative&#39;s police force, concentrated near a few influential planets, can no longer maintain order. The mercenaries they hire for a few credits a kill are too few, too unreliable to do so either. And in the darkness between the stars, an old enemy lurks, fearless, perhaps waiting for order to collapse entirely.</p>\n<p>Good luck, Commander.</p>\n<p>Oolite is inspired by the 8-bit classic Elite, and many aspects of gameplay will be familiar to players of that game. In the tradition of open-world games, there&#39;s no overall story: you can be a millionaire trader, a veteran combateer, a feared pirate, a lonely miner, a notorious smuggler, or all of them, or something else entirely, based on your own actions.</p>\n<p>One of the most important aspects of Oolite is customization: almost all parts of the game can be modified using simple free text and graphics tools, and over five hundred expansion packs are available, ranging from minor tweaks such as a new ship or replacement sound effects, all the way up to giant missions it could take you weeks to play through.</p>", "metacritic": null, "released": "2004-07-01", "tba": false, "updated": "2022-02-04T01:27:31", "background_image": "https://media.rawg.io/media/screenshots/052/0524d71c6b479a9d0c56c9dd8fca460d.jpg", "website": "http://www.oolite.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}