{"id": 732642, "slug": "escape-starport-romeo", "name": "Escape Starport Romeo", "name_original": "Escape Starport Romeo", "description": "<p>A <strong>rogue like bullet-hell game</strong>  (designed with <strong>speedrunning </strong>in mind) where you must overcome robots, mechs, lasers, and more in your effort to make your way to the end of the facility. With 8 character options (and differing modifiers) to choose from this game has lots of replayability. Expected play time ~30 minutes. </p>\r\nReach the escape pod terminal\r\n<p>\n</p>\n<p>You wake in Starport Romeo, a strange and unusual space facility. A guiding voice rings in your ear telling you to get to the escape pods terminal on the other side of the facility. In your way are several challenges, will you overcome them?</p>\n\r\nGameplay\r\nStats\r\n<p>When starting a new game you'll have the choice of 8 characters, each with their own starting stats. When traversing the map you'll find chests to increase these stats, however, bear in mind that your health can not go above your starting max.</p>\n<br/><br/><br/>HealthSpeedDash <br/>DurationMulti-shotsCoins\r\nCoins, Score, and Multiplier\r\n<p>Each time you hit a non-wall target with your bio-blaster you gain one coin. Each time you kill a target your multiplier goes up by one (if five seconds go by without killing a target the multiplier resets to zero). The coins you gain per hit are multiplied by this multiplier. If you are killed or reach the escape pod terminal your coins/ score will be logged if it is your best score. </p>\r\nBio-Blaster\r\n<p>You are equipped with a bio-blaster, this weapon has two firing modes. semi-automatic and automatic. The first time using the weapon click and hold with your mouse and aim at your target. The next time clicking with your mouse you will not need to hold and instead can point the curser at your target as usual. The firing mode will then alternate between these modes each time it is fired.</p>\r\nEthereal Dash\r\n<p>Use 'Q' to dash through objects, bullets, and enemies.</p>\n\n<p>Lightening barriers will block the way, use your ethereal dash to get through them.</p>\n\r\nSupply Chests and Interaction\r\n<p>Dotted around the map you'll find supply chests. These chests will have a random modifier inside, including: coins, dash boost, health, multi-shot increase, and speed increase. These bonuses will cost a random amount of coins (except the coins which are free).</p>\n<p>Use 'E' to interact with chests, doors, and other interactables.</p>", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2022-02-04T03:19:00", "background_image": "https://media.rawg.io/media/screenshots/059/059d5ad83bdf63cb527674a8900ad099.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Beam Logs"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}