{"id": 73268, "slug": "top-drives-car-cards-racing", "name": "Top Drives – Car Cards Racing", "name_original": "Top Drives – Car Cards Racing", "description": "Petrol-heads, motor-heads, turn to Top Drives, the high octane driving challenge - test your skills and knowledge to the limit. Think you know cars?  Top Drives is a fantastic new card collecting game with over 800 real life cars to collect, compare and compete in racing battles with other players.<br/><br/>Build a garage of the best customized cars and create your very own perfect racing deck for supercharged action against your friends or other drivers. Whether you prefer a tuned up American muscle, a feisty Japanese hot rod or go turbo with European and agile, you’ll find a car that gets your motor running in Top Drives - the #1 FREE car racing card collection game.<br/><br/>Top Drives is about racing cars across a variety of roads, tracks and challenges. If you like your driving fast and furious, you’ll love Top Drives.  Hit the gas on asphalt circuits, slide your wheels around twisty circuits, master drifting in the G Force tests or speed to the chequered flag in a 1-100mph drag race. Choose Mustang, Camaro, Porsche Turbo, Audi TT or Nissan GTR, just make sure you’ve got the right car for the right track. You’ll need a garage of cars fast in the wet, good off-road, can take corners and burn rubber for drag races.<br/><br/>Why is Top Drives the ultimate motorsport experience for every car enthusiast? <br/><br/>Features:<br/><br/>- Build the perfect car racing deck from over 800 officially licensed cars<br/>- Marques such as McLaren, Bugatti, Pagani, Porsche, Mercedes, Audi, Mustang and many more<br/>- Real car stats sourced from Evo makes this the ultimate bench racing game<br/>- Unleash your cars on 100s of racing track challenges with our all-new Card Racing System<br/>- Manage, upgrade and tune your stock cars – be the best motorsport manager<br/>- Compete against your friends in thrilling scenarios including drag strips, race circuits &amp; hill climbs<br/>- Compete against rivals to win exclusive cars in live multiplayer events<br/>- Weather effects and multiple surface types, including dirt tracks, asphalt and snow<br/>- Stunning car photography from one of the world’s top car magazines<br/>- Turbocharged, addictive, fun racing strategy gameplay<br/><br/>Own the road, start collecting the coolest new rides, customize with upgrades then sell on your tuned- up cars to build the perfect garage! Top Drives has fast single player campaigns and multiplayer mayhem modes with speed battles to the chequered flag. Top Drives is a combination of strategic card collecting with a motor-head racing theme!<br/><br/>Get an edge by fusing your cars and push your hot wheels to the limit. Become driving champion with the best combination of performance, handling and grip.  Start your engine. Hit the road with Top Drives and unleash exciting updates, take to the track with the coolest, fastest cars including Porsche, McLaren and Mustang, plus enjoy new game modes and new events themed around global car culture.<br/><br/>So, buckle up, stop dreaming and start driving. <br/><br/>Download Top Drives today and let them eat your dust.  <br/><br/>Let us know what you want to see in the game: www.hutchgames.com<br/>Our Privacy Policy: http://www.hutchgames.com/privacy/<br/>Our Terms of Service: http://www.hutchgames.com/terms-of-service/<br/>Top Drives is FREE to play but offers some optional in-game items that can be purchased for real money. Top Drives is an online game and requires a persistent internet connection to play.", "metacritic": null, "released": "2017-08-29", "tba": false, "updated": "2019-07-31T03:30:56", "background_image": "https://media.rawg.io/media/screenshots/465/465f4cb420e42aa1e3270b8ea2a09759.jpg", "website": "http://www.hutchgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Hutch Games"], "genres": ["Strategy", "Racing"], "publishers": ["Hutch Games"], "esrb_rating": null}