{"id": 73271, "slug": "poisonous-snake-survival-simulator-3d", "name": "Poisonous Snake Survival Simulator 3D", "name_original": "Poisonous Snake Survival Simulator 3D", "description": "Live the life of king cobra – the noblest snake in the whole world! Hide deep in a forest or start a hunt! Avoid predators, mate with other snakes, raise up nestlings and have fun with Poisonous Snake Survival Simulator 3D!<br/><br/>This forest is full of dangers – and you’re one of such dangers! But beware – predators are waiting when you become reckless! Moreover, the aggressive herbivores could attack you too, so stay alerted all the time! Maintain your snake’s health, energy and hunger rate to survive and have fun playing this animal simulator!<br/><br/>Meet dangerous wild animals, attack them to stay alive or hide in bushes! Earn points to customize your cobra or raise up it characteristics – change the color of skin, buy new attack or other boosters!<br/><br/>Try our great animal survival simulator in 3D for all ages! What is it like to be a snake, poisonous noble cobra? Get to know with Poisonous Snake Survival Simulator 3D! Hunt for eggs, battle against predators and have fun! What could be more entertaining that being a poisonous snake?<br/><br/>Poisonous Snake Survival Simulator 3D features:<br/>Ultimate cobra survival simulator in 3D<br/>Enjoy the life of snake - hunt for eggs and animals, avoid aggressive predators<br/>Customize your cobra as you want<br/>Become the mightiest snake ever!<br/><br/>Do you like snakes? Play as a king cobra – and become the Cobra King! Slither around looking for your prey, hunt for eggs, but keep yourself alert from predators! Have fun with Poisonous Snake Survival Simulator 3D!", "metacritic": null, "released": "2016-07-27", "tba": false, "updated": "2019-08-12T04:54:02", "background_image": "https://media.rawg.io/media/screenshots/939/93924eeb0e80eb39ac59f87ae564974c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}