{"id": 73281, "slug": "tropical-island-survival-3d", "name": "Tropical Island Survival 3D", "name_original": "Tropical Island Survival 3D", "description": "You are a man survived after a plane crash. Explore lost Tropical Island inhabited by wild predator, try to find your way home or just survive in wilderness with Tropical Island Survival 3D game!<br/><br/>Explore picturesque uninhabited island lost in the ocean with this survival simulator and find useful tools, which would help you to stay alive! Salvage all the tools and weapons, craft your own ones, build shelters to hide from wild animals attack – do anything possible to survive! Stay alive using all your skills, battle against wild predators or hide in shelters, mind characters’ indicators and unravel all the mysteries of lost island with Tropical Island Survival 3D!<br/>Upgrade your survival skill – find water, hunt for wild animals to make them your next meal, find weapons, craft other useful tools and try to make your life better with this island survival in 3D! Your plane is destroyed, it’s no chance to come home… Thrive in this hostile environment – lost survival island! Explore this place, fight for your life against wild predators, hunt, fish or gather plant food – it’s the only way to stay alive waiting for help. Try this amazing 3D island survival in unusual tropic environment, enjoy picturesque views and have fun playing Tropical Island Survival 3D!<br/><br/>Control your survivor character with a joystick, explore lost island in all possible ways - swim the ocean, find weapons and treasures and craft new tools which would help you to survive! Don’t forget about wild animals! You need to build shelters and upgrade your hunting and fighting skills to save your character from predators’ attack! Find weapons to protect yourself from wild island predators! Use all your exploration, battling and survival skills to stay alive with Tropical Island Survival 3D!<br/><br/>There is the system of hidden tools in this island survival simulator. Find guns, axes, find rods and other tools, which would help you to stay alive or craft your own ones using special weapon workshop, chemistry workshop and others. Enjoy your time on tropical island hunting, gathering, swimming the ocean or battling against wild predators! Be ready for ultimate island adventure in 3D! Upgrade your survival skills waiting for help Tropical Island Survival 3D!<br/><br/>Tropical Island Survival 3D features:<br/><br/>- Great island survival simulator in amazing topical environments<br/>- Health, water and fullness indicators of your island survivor<br/>- Various survival tools, weapons and workshops to craft you own ones<br/>- Wild animals predators to hunt or battle against<br/>- Huge lost island to explore - swim, fish, hunt, battle and gather<br/>- Amazing 3D graphics<br/><br/>Ever wanted to explore lost island as a real survivor? It’s your chance to do it! Spend time on uninhabited lost island and fight for your life living in harsh conditions! Upgrade your hunting, battling and exploring skills with this amazing island survival simulator in 3D! Discover secrets, find weapons, build shelters and craft your own survival tools. Meet wild animals trying to wait for help to get home with Tropical Island Survival 3D!", "metacritic": null, "released": "2015-12-13", "tba": false, "updated": "2019-08-12T04:54:33", "background_image": "https://media.rawg.io/media/screenshots/4c5/4c541c12a3dd256d6df1c88939766cb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Adventure", "Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Mature"}