{"id": 73283, "slug": "dino-island-survival-simulator-3d", "name": "Dino Island Survival Simulator 3D", "name_original": "Dino Island Survival Simulator 3D", "description": "Couple seconds ago you were at your laboratory, but now you have appeared in a very different place. Your previous life ends here, now your new home – desert uninhabited island with hundreds angry dinosaurs. In addition, all things and creatures in this abnormal environment are made of pixel and blocks – even sky, even Sun and even you! Fight for your life, hunt and battle against animals, quarry resources to craft weapons and tools and get used to the idea that the whole world made of strange pixel blocks! Dive into the atmosphere of wilderness exploring cubic Jurassic forests full of fierce but also cubic dinosaurs with Dino Island Survival Simulator in 3D!<br/><br/>Try yourself as a lonely survivor and explore lost and cubical prehistorical Jurassic island! Learn how to hunt, fish, craft clothes and make weapons from improvised materials in this amazing cube world where everything is made of pixels and blocks. Raise up your survival skills battling against dangerous cube dinos – T-Rex, Pterodactyl (you would never forget the first time you see cubical Pterodactyl!), Stegosaurus and even more wild and fierce dinosaur flooded this tropical survival island. Thrive in this hostile prehistorical environments with Dino Island Survival Simulator 3D game!<br/><br/>This strange lost island is full of dangers - aggressive ancient predators are everywhere! Avoid meeting with blocky Tyrannosaurus or pixel Velociraptor (it’s not funny, they are as cruel as real dinosaurs) and don’t forget that your main goal is to stay alive at all costs! Explore cube survival island, hide in bushes and caves, find weapons and blocky survival tools! Collect all the tools and weapons or craft your own ones! <br/><br/>Keep your pixel weapon alert – carnivore dino can be hidden anywhere! Explore the crafty Jurassic island, hunt for animals to find food, build shelters to have a rest and discover the secrets of this mysterious place. How did you get here? Is it a kind of time paradox, or someone's evil plan? Get to know playing Dino Island Survival Simulator 3D!<br/><br/>Use all your exploration, battling and survival skills just to stay alive! Mind character indicators - health, energy and fullness. Never let it drops – there is no chance to survive! Find or craft useful survival tools – weapons, axes, fishing rods or even sticks to make fire. Your ingenuity may help you to stay alive in such harsh conditions with this desert island simulator! Explore the lost cubical world full of danger and try to make such an unfriendly place your home!<br/><br/>Dino Island Survival Simulator 3D features:<br/><br/>- Explore Lost Jurassic island – fight against dinos and other wild animals, find food to survive and try to make the place your home<br/>- Unusual pixel environments – whole world is made of pixel and blocks – even sky, water, critters and even your character!<br/>- Unique crafting system – craft, weapons, tools and even clothes from improvised materials and seek for new recipes<br/>- Aggressive and cunning creatures - fight against Tyrannosaurs, Velociraptor or other dinos to stay alive or to get food<br/><br/>Can you ever imagine the one day your world become cubical, and angry dinos will chase you across the desert island? Dive into the atmosphere of prehistorical, but cubical wilderness with Dino Island Survival Simulator in 3D!", "metacritic": null, "released": "2016-03-18", "tba": false, "updated": "2019-08-12T04:55:40", "background_image": "https://media.rawg.io/media/screenshots/258/2581310170e6d256d9a685eaeac94573.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Adventure", "Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}