{"id": 732858, "slug": "elpis", "name": "Elpis", "name_original": "Elpis", "description": "<p>Elpis is a game about a woman that is struggling with schizophrenia in Tel Aviv Israel, in early 80s. While coping with her condition, in her surrounding there are events unfolding right across her window. By coping with her condition, by observing and involving in interacting with her surrounding, Elpis can change the outcome of the events.</p>\n<p>Elpis schizophrenia is represented by the voices coming from her reflection in the mirror. The voices speak by quoting Rabindranath Tagore’s poems that are from the book that is next to her.  The poems are suggesting of her mood and her inner conversation. One is for being idle, the other is for being the navigator and holding the helms.</p>\n<p>Elpis is an allegory of the current human condition that is struggling with one’s own survival and place in society. We are so preoccupied by our own issues that we fail to be aware of our surroundings, and fail to empathize with strangers around us. The “us” turned to “I”, we have lost solidarity.</p>\n<p>In France, Jan 2022, a famous photographer, René Robert (84), collapsed in the middle of a busy street in Paris. Overlooked by passersby, he bled to death in the cold winter night. 8 hours later, a homeless person called the Police for help. René Robert was already dead. My his soul rest in peace.<br/></p>\n<p>Elpis is faced in a similar situation. She can overlook and stand idle. The story will unfold as time passes by and the old person in front for her window will have a heart attack and die. She can, however, interact with the room and find the appropriate clues and call an Ambulance for help and save the old man.</p>\n<p>The story has a variety of possible outcomes, while interacting, the player has no feedback on the final target nor of the player options. The more one explores, interacts, involved, the more likely the old man will be saved.</p>\n<p>Involvement, empathy are the foundations of solidarity, we hope the Elpis can give us hope.</p>", "metacritic": null, "released": "2022-02-03", "tba": false, "updated": "2022-02-04T04:11:46", "background_image": "https://media.rawg.io/media/screenshots/b74/b742209e815fb3dae976023c16b37831.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ykantor"], "genres": [], "publishers": [], "esrb_rating": null}