{"id": 733092, "slug": "here-in-the-backrooms", "name": "Here In The Backrooms", "name_original": "Here In The Backrooms", "description": "THIS IS ONLY A PROTOTYPE!<br/>Here In The Backrooms is an first person horror game based on Backrooms creepypasta and Kane Pixels Youtube video \"The Backrooms (Found Footage)\".<br/><br/>The rules are simple - just like in Slender The Eight Pages, you need to find the Pages. The only problem is... The monster that is hunting you.<br/><br/>THIS IS ONLY A PROTOTYPE! I don't know if I will ever finish this project. I had no ideas for it. I wanted to add randomly generated levels and more monsters here, but I don't want to be limited by The Backrooms world (I would have to show all the original levels from the Creepypasta). The game is HARD to finish. I tried to win, but I made the monster too strong. When you collect the Page, it knows that you collected it and it will go to the place where you collected it. It can hear when you are running from long distance and he Can see you too. If you hear him, you need to be quiet. Be on your guard at all times.Eventually, Here In The Backrooms will turn into another game. I have an idea for a game placed in a world similar to Backrooms but with my own enemies and plot.<br/><br/>I decided to publish this prototype because it would be a pity that it would disappear. Even if I will turn it into a different game, the work I put into preparing it would be wasted.", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2022-02-04T05:07:24", "background_image": "https://media.rawg.io/media/screenshots/ccf/ccff50e0e7cc92428673a0f843018a45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Broken Arrow Games"], "genres": [], "publishers": [], "esrb_rating": null}