{"id": 733204, "slug": "tu-as-un-don-et-cest-fun", "name": "TU AS UN DON - ET C'EST FUN", "name_original": "TU AS UN DON - ET C'EST FUN", "description": "<p><strong>TU AS UN DON - ET C'EST FUN</strong> est un jeu à la base totalement improvisé, qui devait permettre à une tablée de joueurs de faire une partie malgré des absents. Je ne savais pas où j'allais en lançant cette partie, mais elle fût mémorable.</p>\n<p>Vous n'avez besoin d'aucune préparation et vous pouvez jouer à peu près n'importe où !</p>\n<p>Vous aurez besoin d'un dé à cent faces (ou de deux dés à dix faces, ou d'un sac de cent billes numérotées si vous n'en avez pas), d'un dé à six faces (ou de n'importe quel objet de forme cubique avec des faces distinctes) par joueuse et d'un mesureur temporel (un téléphone par exemple - l'auteur se dédouane de toute erreur induite par un pouvoir de distorsion temporel). L'idéal est d'être au moins quatre autour de la table (ou de la surface de jeu quelle qu'elle soit - le toit d'une voiture en marche n'est néanmoins que peu recommandé).</p>\n<p>ATTENTION : le jeu ne prévoit pas le cas des joueuses qui entament une partie dans des dimensions parallèles. Si vous vous trouvez dans une dimension disposant d'un concept de temps ou d'un concept d'espace différents des nôtres, vous devrez adapter légèrement pour jouer !</p>\n<p>Une partie dure le temps que vous le souhaitez - et le temps que vous arrivez à improviser. Oubliez les notions de logique, de cohérence et de sens ; ne prenez pas le temps de vous poser des questions ; pourquoi aurait-on besoin d'un contexte si ce qui se passe est <strong>FUN</strong> ?</p>\n<p>Si vous avez le matériel et quelques joueuses, lancez-vous. Prenez deux minutes pour réfléchir...</p>\n<p>A vos marques...</p>\n<p>Prêtes...</p>\n<p>Arrêtez de réfléchir et <strong>FONCEZ </strong>!</p>", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2022-02-04T05:33:31", "background_image": "https://media.rawg.io/media/screenshots/b24/b242a5c9cf192a6a3e3fb0413e1e0a42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Manea"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}