{"id": 733222, "slug": "with-you-carolmertz", "name": "With You (carolmertz)", "name_original": "With You (carolmertz)", "description": "<p>With You is a cooperative two-player puzzle-playground designed as a collaborative, playful space for couples. The game is intended to be approachable and interesting for both new and seasoned players, and is made to evoke a sense of intimacy and communication. While created with romantic couples in mind, it’s a game that aims to encourage healthier collaborative habits within any relationship.</p>\n<p>Played out through short, wordless levels, With You tells the story of two characters who meet and grow closer to one another as they explore the world together.<br/><br/>The world of With You is one that feels as though it’s simultaneously trying to keep the main characters apart and also bring them together. The world is difficult to navigate and the players are intentionally awkward to control, but the partners bring each other companionship and an expanded set of abilities.<br/><br/><br/><br/>Together, players complete physics and platform challenges through a series of coordinated actions, trust falls, and collaborative problem solving. The actions players perform and the goals they fulfill vary in intimacy throughout the game.<br/><br/><br/><br/>I developed With You in 2019 as my MFA Thesis game at the NYU Game Center — it was a solo student project, so it's very short, a bit glitchy, and made with a lot of love. I hope you enjoy it! Non-violent cooperative games mean a lot to me, so I hope that this one can bring you an opportunity to collaborate with and become closer to someone you care about. &lt;3<br/><br/>- Carol</p>\n<p>\n</p>\n\n<p>\n<strong>Controls:</strong></p>\n<ul><li><strong>Player 1: </strong>WS to show/hide legs, AD to move, Left Shift to rotate</li><li><strong>Player 2:</strong> Up and Down to show/hide legs. Left and Right to move,  Right Shift to rotate.</li><li>Esc to pause / restart level or game</li></ul>", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2022-02-04T05:37:56", "background_image": "https://media.rawg.io/media/screenshots/49c/49cf2594a5f2cb5f2741c1424fabba6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["carolmertz"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}