{"id": 733219, "slug": "the-zium-gallery-2022", "name": "The Zium Gallery (2022)", "name_original": "The Zium Gallery (2022)", "description": "<p><strong>The Zium Gallery is a Museum Exploration Game filled with  artwork and installations from artists around the world, working in  various mediums and styles. <br/><br/>Featured Artists:</strong>\n<br/>Freya Berkhout, Michael Berto, Bob Bicknell-Knight, Pol Clarissou, Joost Eggermont, Evangeline Gallagher, Julián Palacios Gechtman, Cat Graffam, Freya Holmér, Matthew Keff, Most Ancient, Julia Kim, GP Lackey, LaumeB, Eric Lefaure, Niki Long, Titouan Millet, Muuutsch, Cameron Nelson, Seth Redd, Skinless Lizard, Phoebe Shalloway, Quinn Spence and Richard Walsh.<br/><br/><strong>Credits:</strong><br/></p>\n<p>Created, Curated and Developed by: Michael Berto<br/>Modular Gallery Pieces: Quinn Spence<br/>UI Art: Most Ancient <br/>First Person Exploration Kit: Richard Walsh <br/>Generative Audio System \"AudioLoom\": Michael Berto , Titouan Millet. <br/>Additional Programming Support: Julián Palacios Gechtman, Joost Eggermont, Titouan Millet, Richard Walsh.<br/>-------------------------------------------------------------------------<br/>-------------------------------------------------------------------------<br/>Every artist involved with The Zium Gallery was a  gracious tester and collaborator throughout the process. The work on  display belongs to the artists who created and submitted the pieces  for  collection and display, humbly with \r\nThe Zium Project.<br/>-------------------------------------------------------------------------<br/>-------------------------------------------------------------------------<br/>The Zium is a self-funded project.<br/>If you enjoy The Zium Gallery, please consider donating <br/>when downloading The Zium Gallery.<br/><br/><strong>Donate</strong> via itch.io by purchasing The Zium Gallery via <strong>Pay-What-You-Want</strong>. Every donation above $5 will receive <strong>The Founder's Gallery</strong>, a small gallery of work by The Zium Society founder Michael Berto. You will also have access to <strong>The Zium Gallery OST </strong>comprised of five long-form recordings of the endless compositions inside the gallery.<br/><br/>You can also <strong>purchase Exclusive Art Prints</strong> made especially for The Zium Gallery: <br/>\"People\" Print<br/>\"Iconography\" Print<br/>\"Fungus Clouds\" Print<br/>-------------------------------------------------------------------------<br/>-------------------------------------------------------------------------<br/>website: www.thezium.art<br/>twitter:  @thezium<br/>discord: Join The Zium Zerver<br/>contact: theziumsociety@gmail.com<br/></p>\n<p>\n</p>", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2022-02-04T05:37:06", "background_image": "https://media.rawg.io/media/screenshots/43a/43a33faf52962fa9280a30c18f4c172f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["The Zium Museum"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}