{"id": 733218, "slug": "pompak", "name": "POMPAK", "name_original": "POMPAK", "description": "<p>Important: </p>\n<p>I am currently representing this game as one of the many Brand Ambassadors of State Bank of Pakistan. While Registering in the PC browser version or the Android/iOS application version, <em>Please use '<strong>hassan27419</strong>' as your <strong>institute name</strong></em>, We wish to know how many people play the game through this platform, so that we can improve the game for the future.</p>\n<p>Story:</p>\n<p>Follow the story of two entrepreneurial families as they tackle personal, financial, and business decisions. In just a couple of hours, you can master the essentials of saving, budgeting, borrowing, and banking, among many other topics. Interactive questions follow each topic to assess the knowledge of the students.<br/>PomPak’s easy-to-use browser portal and mobile application deliver lessons in English and Urdu language through a story-based game format designed to help you understand and apply principles of financial literacy in your daily lives.</p>\n<p>Project Details:</p>\n<p>This project is part of State Bank of Pakistan’s flagship e-learning game “PomPak – Learn to Earn” is launched through its National Financial Literacy Program for Youth (NFLP-Y). Designed to enhance money management skills and financial knowledge for Pakistan’s youth and school-going children, the content developed targets three age-groups – Children (9-12), Adolescents (13-17), and Youth (18-29).</p>", "metacritic": null, "released": "2022-02-02", "tba": false, "updated": "2022-02-04T05:36:45", "background_image": "https://media.rawg.io/media/screenshots/a4d/a4d98608c83b809ee3fa09dc3554348c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["hassan27419"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}