{"id": 7332, "slug": "mazes-of-karradash-2", "name": "Mazes of Karradash 2", "name_original": "Mazes of Karradash 2", "description": "The city of Karradash is once again threatened by evil forces: fight the demons using dozens of adventurers with different skills, explore 20 huge levels and save the city.<br/><br/>The first person dungeon crawl RPG (inspired by &amp;quot;Dungeon Master&amp;quot;, &amp;quot;Eye of Beholder&amp;quot; and &amp;quot;Wizardry&amp;quot;) is back!<br/>In &amp;quot;Mazes of Karradash 2&amp;quot; you can develop your character, find supplies, build more facilities in the village and create hundred of different adventurers.<br/><br/>Game features:<br/><br/>- 8 races to unlock.<br/>- 10 classes, each with their own special skills and attributes.<br/>- Permadeath: If your character dies is lost forever, but another, stronger adventurer from Karradash will be ready to replace it.<br/>- 20 huge dungeons.<br/>- Improve facilities in the city to unlock new items and new options, to upgrade equipment, and to enhance future generations of adventurers.<br/>- New features: you can choose a trait for your character, hire a mercenary, build your own special skill and increase difficulty level to gain more XP and gold. <br/>- Dozens of weapons, armors, helms, rings, shields and talismans available: choose the best equipment for your fighting style.<br/>- No Pay-to-win and No in-app-purchase of gold, diamonds, better equipment or other stuff: complete the game using your own skills, not your credit card. Old school.", "metacritic": null, "released": "2016-05-16", "tba": false, "updated": "2019-10-22T14:29:18", "background_image": "https://media.rawg.io/media/screenshots/f96/f9610cd1e2bd9608123a7bfbe251161f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Federico Fanelli"], "genres": ["Adventure", "RPG"], "publishers": ["Federico Fanelli"], "esrb_rating": "Teen"}