{"id": 733505, "slug": "childhood-terrors-the-house-with-no-exit", "name": "Childhood Terrors: The House With No Exit", "name_original": "Childhood Terrors: The House With No Exit", "description": "<p><strong>Story</strong><br/></p>\n<p>A popular horror writer falls asleep at his desk while writing his new book: The House With No Exit. When he wakes up, he finds himself in the exact same house he had been writing about. In addition to that, four of the most well-known monsters from his book series ‘Childhood Terrors’ have come to life.\r\n</p>\n<p>Luckily, he knows exactly how to deal with them since he created them, but he has no way to escape the house. The window cannot be broken, neither of the doors lead outside and the time acts unusually. However, he knows that the house adores listening to music, and he quickly figures out exactly what he needs to do to escape the house.\r\n</p>\n<p><strong>Gameplay</strong>\n</p>\n<p>This is a short game that I made in Scratch. There are four different monsters in the game, and you simply have to follow their rules to win the game. For example, Midnight is a bird that appears at, well, midnight. To stop her from killing you, you simply have to watch her through the window until she leaves.\r\n</p>\n<p><strong>Sound is important for this game</strong>, so make sure that you have it turned on. The game is slightly luck-based, but you should be able to win if you do everything correctly. If you don't succeed on your first few tries, don't give up! This game is not impossible. One successful playthrough of the game takes an average of 8 minutes. You can find out how to play in the menu screen of the game.\r\n</p>\n<p>This is the first proper game I've created, so I would really appreciate it if you download it and give it a try! Feel free to tell me what you thought of the game in the comments.</p>\n<p><strong>Credits</strong>\n</p>\n<p>My younger brother made the music in the trailer.</p>\n<p>All sound effects except the 'Door Opening' sound effect were taken from https://www.zapsplat.com/ . I recorded the 'Door Opening' sound effect myself.\r\n</p>\n<p>Door - https://opengameart.org/content/door-textures\r\n</p>\n<p>Window - https://opengameart.org/content/pixel-window\r\n</p>\n<p>Clock - https://opengameart.org/content/clocks-watches-gold-square-seamless-texture-with...\r\n</p>\n<p>Forest - https://opengameart.org/content/desert-forest\r\n</p>\n<p>Wallpaper - https://opengameart.org/content/wallpaper\r\n</p>\n<p>The Scream painting by Edvard Munch. The Persistence of Time painting by Salvador Dalí. Musical Colors by Gretzky. Jayme by Luann Walsh. Other paintings are from various other sources.</p>", "metacritic": null, "released": "2022-02-01", "tba": false, "updated": "2022-02-04T06:48:37", "background_image": "https://media.rawg.io/media/screenshots/cce/cce817ddb904cd794a7a44872e1c0f6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["RandomTreeGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}