{"id": 733557, "slug": "viktorina-offline", "name": "Viktorina offline", "name_original": "Viktorina offline", "description": "<p><strong>Warning! Only Russian questions bases! But you can make an English base and use it in the game if you know English well. If you made one, please share it!</strong></p>\n<p>This game is a text quiz. The bot asks questions, and you answer them.</p>\n<p>The roots of the game come from the eggdrop (windrop) quiz script, which worked on the IRC channel #viktorina_bsatu network https://irc.bynets.org.</p>\n<p>The channel existed from about 2009 to 2014 (+/- a couple of years). The history of the channel can be partially traced on the forum https://porovik.forum24.ru</p>\n<p>The owner of the channel was the author of this program Anatoly Kucherov (under the nickname Ulv), who combined several similar quiz scripts into one script that worked on that channel at the time.</p>\n<p>This program added some additional features that were not implemented at that time on the channel #viktorina_bsatu.</p>\n<p>The motivation for writing this program was the desire to play the quiz without running the IRC server, client and bot.</p>\n<p>The main advantage of this program over the old quizbowl is that it does not need a server, client or bot for IRC. You can just run the game and play. However, at the moment you can only play offline in the proud solitude, not distracted by opponents. Your opponent can only be a bot or a player with a different profile who will play after you.</p>\n<p><strong>When selecting your question base in the game window, know that the base must have this format:</strong></p>\n<p><strong>Question1|Answer1</strong></p>\n<p><strong>Question2|Answer2</strong></p>\n<p><strong>Question3|Answer3</strong></p>\n<p><strong>and have UTF-8 encoding.</strong><br/></p>\n<p>Игра представляет собой текстовую викторину. Бот задает вопросы, а вы отвечаете на них.</p>\n<p>Корни игры растут из eggdrop (windrop) скрипта викторины, которая работала на IRC-канале #viktorina_bsatu сети https://irc.bynets.org</p>\n<p>Канал существовал примерно с 2009 по 2014 год (+/- пару лет). Историю канала можно частично проследить на форуме https://porovik.forum24.ru</p>\n<p>Владельцем канала был автор данной программы Анатолий Кучеров (под ником Ulv), который объединил несколько похожих скриптов викторины в один скрипт, который работал тогда на том канале.</p>\n<p>В данную программу добавлено несколько дополнительных возможностей, которые не были тогда реализованы на канале #viktorina_bsatu.</p>\n<p>Мотивацией к написанию этой программы стало желание играть в викторину, не запуская IRC-сервер, клиент и бота.</p>\n<p>Основное преимущество данной программы над старой викториной в том, что ей не нужны сервер, клиент, бот для IRC. Можно просто запустить игру и играть. Однако, на данный момент играть можно только оффлайн в гордом одиночестве, не отвлекаясь на соперников. Вашим соперником может быть только бот или игрок с другим профилем, который будет играть после вас.</p>\n<p>Выбирая свою базу вопросов в окне игры, знайте, что база должна иметь такой формат:</p>\n<p>Вопрос1|Ответ1</p>\n<p>Вопрос2|Ответ2</p>\n<p>Вопрос3|Ответ3</p>\n<p>И иметь кодировку UTF-8.<br/></p>\n<p>Если вы сделали свою базу, то пожалуйста, поделитесь ей с нами!</p>", "metacritic": null, "released": "2022-02-01", "tba": false, "updated": "2022-02-04T07:03:30", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee3b6b90c5893068ab17d88ad358aff5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["filln"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}