{"id": 73368, "slug": "power-rangers-legacy-wars", "name": "Power Rangers: Legacy Wars", "name_original": "Power Rangers: Legacy Wars", "description": "Rita Repulsa, the space witch, has infected the Morphin Grid, creating virtual monsters and Ranger clones programmed to fight on her behalf. Fight back with your own curated team of legendary Power Rangers and villains from the multiverse!  Unlock new Rangers, upgrade your best warriors and create the best team to defeat Rita, and save the Morphin Grid.<br/><br/>----------------FEATURES------------------------<br/><br/>BATTLE PLAYERS IN REAL-TIME<br/>Strategize, dodge, and fight against real players in real-time PvP and unlock different arenas from famous locations in the movie and TV Show!<br/><br/>STUNNING CONSOLE QUALITY GRAPHICS<br/>View your favorite Power Rangers and their iconic moves like never before.  Full-blown 3D character models with stunning visuals and animations!<br/><br/>COLLECT NEW &amp; ICONIC POWER RANGERS<br/>Unlock new Rangers and collect 50+ warriors ranging from the new movie Power Rangers to classic Rangers to villains from across the Power Rangers multiverse! <br/><br/>CUSTOMIZABLE TEAMS<br/>Create the best team to fight for you. With your ultimate team, you can challenge top players from around the world!<br/><br/>GROW STRONGER <br/>Upgrade your best warriors with Zeo Shards earned through battles, missions and more to increase your winning streaks and battle stats!<br/><br/>TEAM UP WITH YOUR FRIENDS <br/>Build alliances to share, chat and trade tactics, strategy and combos!  Watch replays to learn from other members and follow your favorite players.<br/><br/>************************************************************************<br/>Like us on Facebook: https://facebook.com/PowerRangersLegacyWars<br/>Like us on Twitter: https://twitter.com/PRLegacyWars<br/>Visit us on Instagram: https://Instagram.com/PowerRangersLegacyWars<br/>www.playlegacywars.com<br/><br/>By downloading this game, you agree to the Terms of Service and Privacy Policy Agreement. <br/><br/>Power Rangers: Legacy Wars offers a VIP monthly subscription. Payment will be charged to your account at purchase confirmation. This offer is a month long subscription. Your membership subscription will automatically renew if you don't turn off your membership subscription at least 24 hours before the renewal date. Your account will be charged for renewal within 24 hours prior to the renewal date. You can manage your subscription and turn off auto-renewal by going to your Account Settings after purchase.<br/><br/>Terms of Service:<br/>http://nway.com/terms_of_service.php<br/><br/>Privacy Policy:<br/>http://nway.com/privacy_policy.php", "metacritic": null, "released": "2017-03-23", "tba": false, "updated": "2023-03-29T01:38:26", "background_image": "https://media.rawg.io/media/screenshots/908/9082192da951a9f7c7da8bd165facdd4.jpg", "website": "http://playlegacywars.com/#/main", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 369, "game_series_count": 15, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["nWay"], "genres": ["Action", "Adventure"], "publishers": ["nWay"], "esrb_rating": null}