{"id": 73364, "slug": "match-flower-blossom-garden", "name": "Match Flower Blossom Garden", "name_original": "Match Flower Blossom Garden", "description": "Play Match Flower Blossom Garden​​, great flower puzzle adventure game.<br/>Start to connect, collect super flowers in spectacular combinations. Crush them and row enjoy. With our Match Flower Blossom Garden, you will have a lot of fun and you will spend a lot of hours in flower paradise. Are you a fan blossom paradise type of game? <br/>Do you love blossom paradise puzzle adventure games? Match Flower Blossom Garden is just for you. Start to play in our blossom paradise game, collect flowers and check brain and practice your reflex (time to collect super flowers).<br/><br/>Make your own way through the floral locations and combinations. Connect all on-farm puzzle. Link them on farm meadows, and watch how flowers blooming and react in the garden puzzle. Check this brain teaser match game!<br/>Play Match Flower Blossom Garden. It’s a great time killer! It's a very addictive puzzle game. Hundreds of hours of gameplay with match blossom paradise flower puzzle adventure game.<br/><br/>- Connect blossom super flowers in flower paradise: Connect floral heroes from farm meadows and gain points<br/>- Hundreds of addicting levels<br/>- Flower bloom: Match 4 flowers and more of the same color to get points - Remove items: Link objects to make them bloom in blossom garden<br/>- Big blooming: Combinations with other blossom and blast react<br/>- Floral locations like garden paradise and farm meadows<br/>- Link items to trigger a chain reaction and see flower blast<br/>- Combinations 3 or more of the same color make them grow and bloom. - Match 4 or connect blossom more to get enchanting flower blast<br/>- Collect all blocks and blossom stars from island flower<br/>- Beautiful graphics and effects in our blossom paradise<br/>- Conquer blossom: Start to collect flower rows.<br/>- Be responsible for matching every super flower link<br/>- Collect blossom stars in different levels<br/>- Match your blossom flowers row<br/>- Use booster shop in our Blossom Island (destroy the row and column crosswise) - Collect coins (it gives you the 5 extra moves)<br/>- Collect super flowers: link 3 of the same color to bloom flower, achieve collect flower and gain points.<br/><br/>Match Flower Blossom Garden​ ​ was created for all floral lovers. Cheerful heroes react when they are connected, creating the spectacular blooming effect. Check them in all gorgeous locations, don't miss flower farm or meadows.<br/>In Match Flower Blossom Garden ​you will have link beautiful flowers to each other. When you collect minimum 3 flowers, those flowers explode. You will be responsible for flower explodes.<br/><br/>If you like brain teaser match games Match Flower Blossom Garden​ ​will not disappoint you. Some levels are challenging and some give you casual gameplay. Beat them all and our garden puzzle to become a real blossom star.<br/><br/>Connect all blossom flowers from blossom island and see how they react. Spectacular bloom gameplay with enchanting graphics of all floral location like garden, farm or meadows. So blast them all in our flower puzzle adventure game. You will have a lot of fun with great boosters, bonuses and exciting levels. <br/>Match Flower Blossom Garden will let you check brain and improve your reflex.", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-10-22T14:25:40", "background_image": "https://media.rawg.io/media/screenshots/cfe/cfe770c629eb2291626ab02dd03cbe1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lukasz Pawlowicz"], "genres": ["Board Games", "Puzzle"], "publishers": ["Lukasz Pawlowicz"], "esrb_rating": "Everyone 10+"}