{"id": 733780, "slug": "no-sleep", "name": "No sleep", "name_original": "No sleep", "description": "<p>It's an interactive story created with Twine, based on a dream i had some months ago. In this story the mc customization is \"inexistent\". But the game puts high value on the mc emotions and how their choices leads to certain paths using an immersive horror atmosphere.\r\n</p>\n<p> \r\n</p>\n<p><strong>TW:</strong> The game have several despictions of: Sleep paralysis, Asphyxia (can be avoided), Dream/nightmareish feelings, death (can be avoided in certain scenes and two endings), mild body horror, persecution feelings, mentions of bad psychology practice and advice, and of course, is a horror game.\r\n</p>\n<p><strong>SYNOPSIS</strong></p>\n<p>For three days you´re gonna struggle to sleep (and even to breathe). It isn´t the insomnia or a bad thing you eat. It´s a creature who´s eyes have fallen on you as their new prey to toy and devour...\r\n</p>\n<p>In the dark, right when you close your eyes...the creature watchs you and tries to bring you deep in to the madness of the void...\r\n</p>\n<p>Would you summit yourself to the creature and fall in the shadows of your own house?\r\n</p>\n<p>Or do you prefer to “ignore” what´s happening around you and the creature?\r\n</p>\n<p>Discover this yourself in three nights...\r\n</p>\n<p>Be aware of what lurks in your house at night, but be more aware of what you cannot see and comprehend in the shadows...\r\n</p>", "metacritic": null, "released": "2022-02-01", "tba": false, "updated": "2022-02-04T08:00:19", "background_image": "https://media.rawg.io/media/screenshots/559/55923d3d4ad081907d3f07ec704fa182.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dorian"], "genres": [], "publishers": [], "esrb_rating": null}