{"id": 73376, "slug": "bricks-n-football", "name": "Bricks n FootBall", "name_original": "Bricks n FootBall", "description": "Are you ready to take part in football championship world cup 2018? You will have to become a bricks breaker, but not a usual one. You will find yourself at championship world cup 2018, instead of usual breaker balls you will have footballs. Your target on a championship world cup 2018 is to score some goals, of course. But irritating bricks lays on your way, use your footballs to get rid of them, and score your goals with balls that you have left. Bricks n FootBall is a puzzle simulator, because you will have to carefully think over your strategy, so use your footballs carefully, and score as many goals as possible. Download our puzzle simulator to take part in championship world cup 2018.<br/><br/>In this puzzle simulator, you will play as football player. Your target is to score as many goals as you can, but, one problem, bricks are laying between you and gate. Each brick has a number on it, each time ball touches the bricks this number decreases, use your balls to make way and shoot all balls that you have left in the gate. This is a puzzle simulator, so think over your strategy accurately. First football you have kicked makes trajectory for all other balls. You earn points for scored goals and broken bricks, also you may find golden coins on your way, which you can spend in our in-game store, buy a new football with colors of your favorite team in championship world cup 2018. Show those irritating bricks, that it does not important where you are, important is that you are still the best bricks breaker ever!<br/><br/>Bricks n FootBall is a free to play puzzle simulator of a bricks breaker in championship world cup 2018. Break all bricks you can see on your way and get rid of them with your footballs. Score many goals to show everyone that you are not only mighty bricks breaker, but a legendary football player as well. If you are cheering for exact football team on a championship world cup 2018, you can show it in this bricks breaker simulator. Just collect exact number of tokens and spend them on a ball with colors of your favorite team in our in-game store. Beat all highscores in the leaderboard and become top brick breaker and football player in the game. Download our puzzle simulator to see such a familiar football from a new sight.", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-10-22T14:25:40", "background_image": "https://media.rawg.io/media/screenshots/805/8051809d983fc2051293a8f097e290ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Denis Sandakov"], "genres": ["Sports", "Arcade"], "publishers": ["Denis Sandakov"], "esrb_rating": "Everyone 10+"}