{"id": 73389, "slug": "troll-face-quest-video-memes", "name": "Troll Face Quest Video Memes", "name_original": "Troll Face Quest Video Memes", "description": "<p>Fans of free escape games will just love the brained new levels of video memes filled with twisted slapstick humor, unfortunate toilet fates and well-planned clicks (or tricks)!<br />\nEntertain your brain with more point-and-click teasers full of jokes, pranks and puzzles that will make fun of anyone and everyone that received too much attention.<br />\nEach level will have you scratching your head or laughing out loud to test your be-awareness to the limit.<br />\nFind hidden objects, sing just-in beavers and goats OR test some flex against muscles from Brussels.<br />\nClick your way out of various sticky situations in a make-fun or be-made-fun-of comic FANtasy.<br />\nYou can expect:<br />\n-   48 braind new levels of hilariously stupid riddles and teasers!<br />\n-   A series of funny head-scratching, stomach aching meme-magic mini games<br />\n-   More multi-colored graphics and animation!<br />\n-   6 TFQ unlucky bonus levels to face!<br />\n-   Cool new sound effects: squeeks and eeks in perfect ha-ha harmony!<br />\n-   Where else can you make fun of videos, celebrities and yourself in one game?<br />\nBe prepared to troll on the floor with laughter again and again. Download the app for your smartphone or tablet now and put your memory to the test!</p>", "metacritic": null, "released": "2015-12-09", "tba": false, "updated": "2023-03-19T08:01:05", "background_image": "https://media.rawg.io/media/screenshots/a57/a575888e8a599aa8b7e10bab995963ff.jpg", "website": "http://spilgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["SPIL GAMES"], "genres": ["Adventure", "Puzzle"], "publishers": ["SPIL Games"], "esrb_rating": "Teen"}