{"id": 733826, "slug": "hoguru-presents-the-house-with-too-many-zombies-in", "name": "HOGuru Presents: The House With Too Many Zombies In It", "name_original": "HOGuru Presents: The House With Too Many Zombies In It", "description": "<strong>HOGuru Presents: The House With Too Many Zombies In It is an action packed top-down shooter with a full length campaign.</strong><br/><br/><h3>[THE STORY]</h3><br/><br/>The world ended 5 years ago, when a zombie plague swept the planet, wiping out most of the human population and replacing it with a ravening, bloodthirst horde of the undead. Now Crash Bromwell, Football player-turned unlikely last hope for humanity, has found a way to undo all of the horrors of the last half-decade, and put the world back the way it was - but to accomplish this, he'll have to travel to the HOUSE WITH TOO MANY ZOMBIES IN IT, and brave the horrors with in.<br/><br/>Can Crash succeed and put the world back the way it was? Is the world even worth saving? And how does the King of the Werewolves factor into all of this?<br/><br/>Find out in... HOGuru Presents: The House With Too Many Zombies In It!<br/><br/><h3>[FEATURES]</h3><br/><ul><li>A full length campaign with over 30 beautiful levels.<br/></li><li>A substantial arsenal made ranging from pistols to shotguns to magical flaming swords!<br/></li><li>Lighting system that really brings out the game's intense horror feel!<br/></li><li>A story written by the screenwriter behind such films as Come True, Butchers, and Our House!<br/></li><li>Loads of quests and objectives to do while exploring the 30+ levels.<br/></li><li>Combo system.<br/></li><li>Boss fights.<br/></li><li>Stat tracking.<br/></li><li>Steam Achievements.<br/></li><li>Secrets..</li></ul>", "metacritic": null, "released": "2021-12-07", "tba": false, "updated": "2023-11-06T19:16:55", "background_image": "https://media.rawg.io/media/screenshots/5ae/5aeedb67774bcd606702a3804efc0716.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StarSystemStudios", "HOGuru"], "genres": ["Action", "Shooter", "Adventure", "RPG"], "publishers": ["HOGuru Games!"], "esrb_rating": null}