{"id": 733853, "slug": "luck-does-not-return", "name": "Luck does not return", "name_original": "Luck does not return", "description": "<p>Wheel of Fortune, the hit TV show that started in 1975 and hasn’t stopped since then. It’s one of the most popular game shows that has ever hit livingroom TVs and has spawned versions of it all around the world. Like with most hit shows, it made its way to PCs as well, under the form of a game.</p>\n<p>Spin the wheel, solve the puzzle and bring home the cash prize</p>\n<p>In Luck does not Return, the rules are very simple. Each contestant spins a large carnival wheel and tries to solve word puzzles that are similar to those in Hangman. Each correct answer makes sure that the contestant gets rewarded with money and if he or she wins, well, it’s all for the best.</p>\n<p>In this new designed game you are allowed to make mistakes only 3 times, if you make mistakes several times you go home without any money. You can also add your own questions and answers to make everything more fun for you and your family!</p>\n<p>we also have an event log that works pretty well, it can be seen on the right side of the game. a downside would be that \"buying a vowel\" is just for look and does not require a sum of money to buy it. A second disadvantage would be that the amounts you earn are quite small, but if we go over the negative aspects, the game works well and quite correctly.<br/></p>\n<p>It’s nice if you like Wheel of Fortune that is.</p>\n<p>To end, Luck does not Return is a simple game but at the same time fun. There are other casual games you could be trying, and if you’re a huge fan of Wheel of Fortune, then Luck does not Return is a good choice for this century.</p>System requirements\r\n<p>Net Framework 4.7.2</p><p>Runs on: Windows 10/11 32/64 bit </p><p>\n</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T08:19:41", "background_image": "https://media.rawg.io/media/screenshots/4ef/4efb2756e398d679105b6aa00cb43434.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Masteralgo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}