{"id": 733905, "slug": "locally-sourced-issue-1", "name": "Locally Sourced Issue #1", "name_original": "Locally Sourced Issue #1", "description": "<p>Locally Sourced is a zine containing writing about games as well as a bundle of tabletop and video games packaged with it, all by people from the state of Michigan! Game developers are paid royalties on all sales as well.<br/></p>\n<p>Issue #1 has a cover by dr!p, layout by FEYXUAN, and articles include:</p>\n<ul><li><strong>Interview with Neil Jones about Aerial_Knight’s Never Yield -</strong> Steven Zavala</li><li><strong>Buried Deep, the Hidden Gems of Mobile -</strong> Lily Valeen</li><li><strong>WolverineSoft Studio -</strong> Nikhil Ghosh and Amber Renton</li><li><strong>The Bug That Breaks Bethesda’s PC Ports</strong> - Schala Walls</li><li><strong>Modern Communal Gaming -</strong> Jonathan Myer</li><li><strong>The Lost World of HeroMUD -</strong> Michael Klamerus</li></ul>\n<p>This issue's games include:</p>\r\nParaMonsters and the Haunted Escape Room (Win) by Moon Metro Digital\r\n<p>ParaMonsters is an adventure/visual novel about tiny monsters investigating a paranormal rumor at an escape room in town.</p>\n\r\n\r\nThe Church of Cheesus Crisp: An All You can Pray Buffet (Win) by Oil Leak Games\r\n<p>You are Fr. Salad, the pastor of The Church of Cheesus Crisp. You've been given the holy book to tell each parishioner a parable, a life lesson you might say.  Complete each mini-game to give each Food Person a blessing, or let sin prevail. Get the high score and get them warm, fuzzy, good good feels.</p>\n\r\n10 Paces: Reloaded (Physical) by Wannabe Games\r\n<p><em><strong>10 Paces</strong></em> brings Wannabe Games flair to the western world. Using pace die to bring the excitement of quick draw duels to the tabletop world. 10 Paces is a simple and flexible system that allows players to pick up and start playing in just a few minutes.</p>\n<br/>\n\r\nDrew &amp; the Floating Labyrinth (Win/Mac/Linux) by Dust Scratch Games\r\n<p>A hand-drawn 3D third-person puzzle-platformer. Control Drew, a lost young girl trying to find her way back home, through a series of abstract levels requiring you to use clues in the environment to find invisible paths, gaining color to her black-and-white character as you progress.</p>\n\n\r\nSACROSANCT (Browser) by FEYXUAN\r\n<p>fuck god, kill heaven, marry boyfriend. in that order.<br/></p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T08:34:07", "background_image": "https://media.rawg.io/media/screenshots/80c/80c6fc94f1fe2a5fab180aed9a04a2f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LocallySourcedMI"], "genres": [], "publishers": [], "esrb_rating": null}