{"id": 733990, "slug": "tetrolympus", "name": "Tetrolympus", "name_original": "Tetrolympus", "description": "<p><strong>Submitted for Global Game Jam 2022 (\"Game Cancoillotte 2022\" event in Besançon, FR)</strong></p>\n<p>GGJ game page : https://globalgamejam.org/2022/games/tetrolympusofficial-2</p>\n<p><em>Credits</em>:</p>\n<p>Programming - Lorenzo Kerbrat (Lorhus/Alk)<br/>Game design - Nicolas Arroyo (ZL39)<br/>Visuals &amp; sounds - Elodie Wiedenkeller (Siurize)<br/>Story elements -- Leo Mercier</p>\n<p><em>Tools used</em>: Unity, GIMP, Audacity</p>\n\n<p><strong>ENG:</strong></p>\n<p>TETROLYMPUS is a game about placing tetrominos, in which you earn points by placing them in the correct spots.</p>\n<p>It is a 2-player competitive game, themed around greek mythology. You play as an ancient hero and their mythical foe for a 3 minutes long duel. The goal is to place your pieces/tetrominos according to the target spots that appear as the game progresses. Points are awarded for each player every second, for each validated objective on their grid. The game ends when the timer runs out and the highest score wins.</p>\n<p>When the pieces reach the top of the grid, the game isn't lost, but the grid is reset, forcing the player to go for the objectives again. Players sometimes get pieces of the opposite color, which erase the regular blocks already in place when colliding. One ought to use them wisely in order to slow down the blocks upstacking, or to help validating the objectives.</p>\n<p><strong>The game can only be played by 2 players and needs one to use a keyboard AND the other a controller.</strong></p>\n<p>On keyboard : Left/Right arrow keys to move pieces, Down arrow to accelerate fall and Up arrow to instantly drop it. A and S to rotate pieces.</p>\n<p>On controller : D-pad does the same as the arrow keys on keyboard, A and X to rotate pieces on XBox controller (or Cross and Square respectively on PS4 controller).</p>\n<p>-----------------------------------------------------------</p>\n<p><strong>FR:</strong></p>\n<p>TETROLYMPUS est un jeu de placement de tétrominos, où l'on gagne des points en plaçant correctement ses pièces.</p>\n<p>TETROLYMPUS est un jeu compétitif pour deux joueurs sur le thème de la mythologie grecque, vous incarnez un héros antique et son adversaire dans un duel d'une durée de 3 minutes.Le but est de placer ses pièces (tétrominos) en respectant les règles de placement qui se rajoutent en cours de partie. Des points sont ajoutées pour chaque joueur à chaque seconde pour chaque objectif validé. La partie se termine après écoulement du temps, et le plus haut score remporte alors la partie. </p>\n<p>Quand les tétrominos atteignent le bord de la grille, la partie n'est pas perdu mais tous les tétrominos placés sont supprimées. Il faudra donc valider de nouveau les objectifs. Les joueurs reçoivent de temps en temps des pièces \"opposées\", qui viennent effacer les pièces \"régulières\" déjà en place, à utiliser astucieusement pour ralentir la montée des tétrominos ou aider à valider les objectifs.</p>\n<p>Le jeu se joue uniquement à deux joueurs et nécessite de jouer avec un clavier ET une manette.</p>\n<p>Au clavier : les flèches gauche et droite permettent de déplacer les pièces, la flèche bas d'accélérer la chute et la flèche haut de faire chuter instantanément la pièce. Les boutons A et S font tourner les pièces.</p>\n<p>A la manette : La croix directionnelle fait les mêmes actions que les flèches du clavier, la rotation se fait avec les boutons Sud et Ouest (A et X sur manette Xbox, Croix et Carré sur manette PS4)</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T08:57:47", "background_image": "https://media.rawg.io/media/screenshots/a58/a5841a9f75b3d1e6f9e96ce398cb9e25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lorhus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}