{"id": 73416, "slug": "shall-we-date-angel-or-devil", "name": "Shall we date?: Angel or Devil", "name_original": "Shall we date?: Angel or Devil", "description": "Big News!<br/>Angel or Devil’s spin-offs for 6 characters are OUT now. <br/>Plus, A Secret Date story for Latis, Diaval &amp; Ruvel is available too.<br/>Introducing a new story from the “Shall we date?” series<br/>“Shall we date?: Angel or Devil” is now available.<br/>An unprecedented story of your 7 days with an angel, devil and reaper.　<br/><br/>1.Story introduction<br/><br/>It was supposed to be a typical day...<br/>When I opened my eyes, I found myself in bed at the hospital - I had been involved in a car accident. All of a sudden, three strange men appeared in front of me - Latis, an angel with shining wings; Diaval, a demon with deep black wings who was smirking; Ruvel, a reaper with a scythe in his hand whose eyes were cold.<br/>They asked for my soul because I had only a few days left to live.<br/>Is it true I’m going to die?<br/>My last 7 days with these men… What will it be like? I will go to heaven or hell or...?<br/><br/>2.Characters<br/><br/>LATIS: To Latis, discipline is everything. But sometimes his sharp tongue reveals his darker side when he is not on duty. In this story, he’ll do whatever it takes to protect you from a demon and the grim reaper that is after your soul. You wonder why he goes all the way to help you, but you soon find out that he knows all about your past. <br/><br/>DIAVAL: His goal is to enslave and take human souls. Though he admits that he is a hedonist, he takes good care of those under him. If he likes you he is taking every chance to have you all to himself. Are you ready for the fact that he’ll do whatever it takes to seduce you? How do you overcome his temptation?<br/><br/>RUVEL: Ruvel is a grim reaper with an icy face, who is also an avid collector of souls.<br/>He has been captured by your beauty and decides to spend your 7 days together in the human world. He usually hides his emotions with a hood over his eyes. Nobody knows what he is thinking. Maybe you can melt his frozen heart and free him. <br/><br/>FEYRIL: Feyril is an angel. A decent type to be exact, who always puts human first. He is just like an angel we’ve always dream of. He follows orders and disciplines and takes pride in this job. Recently, something changed inside him; neither devil nor the grim reaper knows what happened to Feyril. What made him change his mind? Was it, you?<br/><br/>Raug: Human lives mean nothing to Raug. He is the type of devil that goes out all his way to please his boss, the Devil King. To him, the end justifies the means. And he is good at it. One day, the upper-class devil has come for your soul by order. <br/>Ever since he met you in the human world, his cruel nature seems to change for the better?!<br/><br/>Reiner: Unlike Ruvel, while the upper-class reaper, Reiner has a very different personality. Reiner is bright and positive. That you wouldn’t ever believe he is a reaper that takes human souls. He can melt your heart with his sweet words. But there’s something significant hidden in his smile, no one seems to know what it is. <br/>What’s his true identity? Will you still love and accept him after you find out the truth?<br/><br/>3.FEATURES<br/><br/>1) will you fall in love with? An angel spreading his beautiful wings; a demon with a demonic grin with a pair of black wings on his back? Or even a grim reaper always seen with a pair of ice-cold eyes who is carrying a scythe in this hand?<br/>This is a story of your last 7 days in the human world. Can your soul be saved by one of these three men?<br/><br/>2)Multiple endings are there for each character, and the ending can be changed depending on what you choose to act or react in the episodes.<br/><br/>3)Many fine illustrations of Japanese comic, anime, or manga arts!<br/><br/>4.FOLLOW US<br/><br/>facebook.com/ShallWeDate.NTTSolmare (Don’t forget to LIKE us if you enjoy our game!)<br/>youtube.com/user/ShallWeDate<br/><br/>5.ABOUT US<br/><br/>Thank you very much for your interests and downloads of our games! <br/>NTT Solmare is a game company especially focusing to bring Japanese visual novels and Otome games to the world! Angel or Devil is one of our game series, “Shall we date?”. We sincerely hope enjoying our games and give us feedback!", "metacritic": null, "released": "2013-12-19", "tba": false, "updated": "2019-10-22T14:25:41", "background_image": "https://media.rawg.io/media/screenshots/570/570d235c81ecc5daf5c3e3b34b70a6c1.jpg", "website": "http://www.nttsolmare.com/shallwedate/index.html?id=ios-angeldevil-support", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NTT Solmare"], "genres": ["Adventure", "Simulation"], "publishers": ["NTT Solmare"], "esrb_rating": null}