{"id": 734294, "slug": "birth-of-huitzilopochtli", "name": "Birth Of Huitzilopochtli", "name_original": "Birth Of Huitzilopochtli", "description": "<p><strong>We all know Hercules, Zeus, Poseidon and the vast stories of the Olympus. I am from Mexico and I’ve been taught more about Greek mythology rather than the Mesoamerican. The Birth Of Huitzilopochtli is a first minigame of a series I intend to work on with the purpose to disseminate our tales and values. It is a lifelong project and all feedback is greatly appreciated.</strong></p>\n<p>You must eliminate all 400 Brothers to win the game.</p>\n<p><strong>Controls:</strong>\n</p>\n<p>Move: WASD and/or Left, Right, Up &amp; Down keys.\r\n</p>\n<p>Aim: Mouse\r\n</p>\n<p>Left Attack: Left Click\r\n</p>\n<p>Right attack: Right Click\r\n</p>\n<p>Sprint: Left shit.\r\n</p>\n<p>Jump: Space bar\r\n</p>\n<p><em><strong>The Myth:</strong></em><br/></p>\n<p>Before our world was created, Gods inhabited our planet. At the top of Coatepec’s mountain, there was a temple where Coatlicue lived. She was the Goddess Mother of the uncountable (400) southern stars known as “Centzonhuitznahua”, and of the Moon, “Coyolxauhqui”. One day, as she was rhythmically sweeping the temple, out of the blue a turquoise feather smoothly descended until it reached the floor. It’s gentle flight and it’s vibrant color mesmerized Coatlicue, who took the feather and kept it safe between her huipil (mesoamerican dress) and her skin. That night, before going to sleep, she intended to put aside the feather for safeguarding but was rapidly stunned by the absence of it. With resignation, she opted to always keep close the memory of the feathers gentle descent.<br/></p>\n<p>After a few months, Coatlicue realized she was with child which brought happiness to her. But one of those days, Coyolxauqui peeked her gaze through a window and saw her mother pregnant. Full of anger and jealousy, she roared into the dark night and rallied her 400 star brothers to kill her mother. Coatlicue took refuge in the temple and cried out for his son's help. At that moment, Huitzilopochtli and his fire sword known as the Xiuhcóatl, emerged from within her. A cosmic battle arose between the Sun God and the countless southern stars, who fell one by one. Last, but not least, Huitzilopochtli grabbed her Moon sister by the head, decapitated her and threw her remains off the side of the Coatepec mountain.\r\n</p>\n<p>By the end of the conflict, the temple was flooded with light and a small hummingbird extended its wings and kept it’s flight over Coatlicue’s head. After a few seconds, the hummingbird took flight towards the south</p>\n<p><strong>Credits:</strong><br/></p>\n<p>Game Design: Bato (Me)</p>\n<p>Music: Thihui found on :</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T10:16:52", "background_image": "https://media.rawg.io/media/screenshots/640/6408e8e09d43fc433bf40572734fa814.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bato Balvanera"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}