{"id": 73422, "slug": "karate-do-fighting-tiger-3d", "name": "Karate Do Fighting Tiger 3D", "name_original": "Karate Do Fighting Tiger 3D", "description": "Karate Do Fighting Tiger 3D is ultimate action fighting game that let you feel like a real karateka!<br/>Enter the world of Japanese martial arts and let the biggest fighting contest begin! Overcome your rivals dead or alive! Explore different locations and use your Karate Do power to win! Beat all the opponents and prove your worth as a Master of martial arts playing amazing Karate Do Fighting Tiger 3D game!<br/>Perform endless combinations of moves and perfect your own best combo strike! Fight against powerful opponents using different fighting styles including Taekwondo, Muay Thai, Kung Fu, Boxing and other and enjoy being a real Japanese karateka!<br/>Use all your strategy to grab your opponent from above and tackle him down, taking a life. Become the strongest fighter on the earth playing Karate Do Fighting Tiger 3D action game! Upgrade your power, speed and accuracy or unlock new strikes and fighting styles getting points for each kill.<br/>Karate Do Fighting Tiger 3D features:<br/>Powerful enemies to battle against and kill<br/>Upgrade or customize your fighter skills – increase power, speed and accuracy and try new strikes to overcome rivals<br/>Contest and survival mode – beat and kill your enemies to earn points or survive on the ring as long as you can<br/>Easy and smooth controls<br/>Action fighting 3D game in Japanese style<br/>Gain unprecedented combat experience! Unleash the champions, enter the ultimate contest! Start the toughest fight ever! Kill or be killed! Check contest and survival mode – fight against enemies and kill them to earn points or survive on the ring as long as you can! Explore different locations fighting for your life and survive on the ring leaving your opponent no chance to stay alive! Earn points for each beaten enemy, battle against powerful rivals and up level your boxing skills to the top level!", "metacritic": null, "released": "2016-06-22", "tba": false, "updated": "2019-07-05T03:31:33", "background_image": "https://media.rawg.io/media/screenshots/47d/47dda74c32ef8dfd366de4a4f1400dc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Action"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Mature"}