{"id": 734283, "slug": "real-tetris-3d", "name": "Real Tetris 3D", "name_original": "Real Tetris 3D", "description": "<p>✔ GAMEPLAY\r\n<br/></p>\n<p>★ Planes: try to drop the blocks in order to fill a full plane or 2 or more. Be aware you have a time to do the next plane.<br/>★ Levels: at the beginning you can play the first 3 levels. Unlock the rest to play really awesome big grid. <br/>★ Level up: complete the minimun number of planes to do. Each level has a maximun time to accomplish this objetive.<br/>★ Block: you can move horizontal and vertically and rotate the actual block in order to drop it in the right place. You can also pass through other dropped pieces.<br/>★ Score: <br/>- each plane done More points for getting 2 or more planes in a row <br/>- extra planes done after the minimun objetive reached add much more points<br/>- each block dropped depending on its size and difficult<br/>- points will increase with the level.<br/>★ Lives: start with 3 lives.<br/>★ Power Ups: when availables in the level you will get rewards by making planes with then<br/>- Coins of bronze, siver and gold: get extra points<br/>- Heart: get extra life<br/>- Hourglass: get extra 10 seconds to make the next plane and 30 extra seconds to level up <br/>★ Game Over: each time the time to do next plane or the time to level up expires you will lost a life. In case no more lives left the game ends.<br/>★ Collisions: when you are moving/rotating the block the colour will become darker if collision is detected or the block is out of the grid. In this situation the block can not be dropped.<br/>★ More different blocks than original version<br/>★ Shadow: the block have a shadow right below it to orientate you about its position</p>\n\n<p>✔ BLOCK CONTROLS<br/>★ Move horizontal: use LEFT SIDE arrow icons or cursor keys. <br/>★ Move vertical:  left icons to move up and down or A and Z keys.<br/>★ Rotate: use RIGHT SIDE arrow icons to rotate the block in the different axes. Or use Q, W   E,D    R,T keys.<br/></p>\n<p>✔ INFO/CONTROLS ON SCREEN <br/>Rigth side from top to bottom<br/>★ Score<br/>★ Planes to do<br/>★ Setting<br/>★ Block up<br/>★ Block down<br/>★ Time to do next plane<br/>★ Time to level up<br/>★ Level<br/>Left side from top to bottom<br/>★ Next block: on left upper corner you can preview it<br/>★ Show/hide Camera controls:<br/>           Move Camera: left, right, up, down, near, far<br/>★ Help (?): screenshot with instructions<br/>★ Drop the block down<br/></p>\n<p>★ Background: choose to play with textured or clean blue background </p>\n<p>✔ SAVE/LOAD<br/>★ Save: you can store the actual state of game<br/>★ Load: you can restore the game state previously saved</p>\n<p>✔ RECORDS<br/>★ High score obtained<br/>★ Max level reached</p>\n<p>✔ SUPPORT: I will attend your questions on my email: reslava@gmail.com. I have many ideas to improve the game experience.</p>\n<p>Thanks &amp; Enjoy!</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T10:13:50", "background_image": "https://media.rawg.io/media/screenshots/85f/85f867e09d10bc54572f006578dd3589.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["reslava"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}