{"id": 734219, "slug": "infinite-cars", "name": "Infinite Cars", "name_original": "Infinite Cars", "description": "Infinite Cars\r\nDescription\r\n<p>My first ever game created using a game engine!</p>\n<p>Why \"Infinite Cars\"? Well simply because this is an endless racing game.</p>\n<p>This is just a simple time killer when you are bored.  This game does not have a specific goal. Just drive the car, survive the game, and dodge all the obstacles with all your might!</p>\n<p>I already created many versions of this game, but this is so far is my creation that I feel satisfied the most. Well it's because this is the first time I actually used a game engine.</p>\n<p>The computer car has a light artificial intelligence algorithm which it avoids an obstacle to go through. Although, it's not perfect, I'm already satisfied with it.</p>\n<p>I read the API documentation, and the code in the examples a lot, for me to understand how to work on this game. Although, I'm pretty sure that my writing is not perfect.</p>\r\nInstructions\r\n<p>As mentioned before, just avoid the obstacles on the road.</p>\n<p>You may drag the red car (or the character) to left or to the right to control it.</p>\n<p>There is no other controls other than that.</p>\n<p>If you feel that the background sound effect is noisy, you may mute it (Located at the top right of the game screen).</p>\r\nResources\r\n<p>Phaser - JavaScript game engine or framework.</p>\n<p>Aseprite - Drawing tool for the game objects .</p>\n<p>LMMS - DAW application for the sound effects.</p>\n<p>Luckiest Guy - Font used for the texts.</p>\n<p>AAP64 - The color palette used for the images and the UI.</p>\n<p>Codepen - As a text editor (Or IDE) for development.</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T09:55:56", "background_image": "https://media.rawg.io/media/screenshots/ab2/ab2dc5581a7d4393612da3f41e2da3a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["takaneichinose"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}