{"id": 734218, "slug": "turret-protection", "name": "Turret Protection", "name_original": "Turret Protection", "description": "<p>Turret Protection</p>\n<p>Turret Protection is a 2D bullet-hell made for the 17th Score Space Game Jam.  The theme of the jam was \"Protect\".  In this game you play as an energy shield, all you can do is protect yourself from the incoming waves of turrets.  To protect yourself change colour to the same as the incoming projectiles!</p>\n<p>How to play</p>\n<p>To play use WASD to move around.</p>\n<p>Use QERF to change colour, you will be immune to damage from projectiles of the same colour</p>\n<p>Collect Points by surviving and defeating turrets!</p>\n<p>Over time the difficulty will increase!  but the harder turrets you defeat the more points you get!</p>\n<p>Abilities</p>\n<p><strong>Spinner</strong></p>\n<p>Gain a spinning shield that will destroy all that comes into contact with it!  Use this ability to effortlessly storm through all the turrets on the maps!</p>\n<p><strong>Blast</strong></p>\n<p>This ability will cause a large explosion resulting in all projectiles on the map to disappear!</p>\n<p><strong>Converter</strong></p>\n<p>When the converter is placed, all projectiles that pass through it will become the same colour! </p>\n<p>Turrets</p>\n\n<p>Within the game, you will find four types of turrets, all of which can appear in every colour.  </p>\n<p><strong>Basic</strong></p>\n<p>Basic turrets will shoot slow, do little damage and have no special quirks about them.  Their the weakest enemy of the game however in numbers they still pose a threat!</p>\n<p><strong>Homing</strong><br/></p>\n<p>Homing turrets have projectiles that will lock on to the player tracking you as you move!  These may seem tricky but homing projectiles can be used as a weapon for the player, leading the projectiles into their own turrets!  </p>\n<p><strong>Bouncy</strong><br/></p>\n<p>Bouncy Turrets will shoot bouncing projectiles.  If not destroyed quickly these turrets will cause the map to fill with bouncing projectiles making it hard to dodge them all!</p>\n<p><strong>Bosses</strong><br/></p>\n<p>Bosses are unique to the other turret types, play the game to find out what each boss turret does ;)</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T09:55:41", "background_image": "https://media.rawg.io/media/screenshots/763/763ec8b9dd7ae70af3abb19ae0c7c198.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Not_Erikk"], "genres": ["Action"], "publishers": [], "esrb_rating": null}