{"id": 734421, "slug": "lets-go-picnic-on-the-mine-field", "name": "Let's go picnic on the mine field", "name_original": "Let's go picnic on the mine field", "description": "<p>This project is my proposal for the Search for a Star game programming challenge.</p>\n<p>A family goes off for a nice pic-nic on a grass field. But bad luck ! They realize too late that they are actually on a mine field ! They have to escape it !</p>\n<p>This is a grid based, turn based game. The goal is to reach the safe area while avoiding the mines and to keep as much family members alive as possible. The more are saved, the more points are earned. The player has fifteen turns to escape with everyone and each character can act twice per turn.</p>\n<p>There are six family members, each with different uses and abilities:</p>\n<p>- The father, can uncover large unmined areas.</p>\n<p>- The mother, can give away her action points to any other character.</p>\n<p>- The son, can mark a mine emplacement to exclude it from the pathfinding calculation. he also reveal the amount of mines around each tiles.</p>\n<p>- The daughter, the most important to save. She is worth the most points and if she dies, the game is lost.</p>\n<p>- The pets, they have no abilities and are not worth any points. They are very good meat shield though...</p>\n\n<p>Everything is played with the mouse. Click a character to select him/her, click and action button (UI) and click its target to activate it.</p>\n\n<p>Good luck and be sure-footed !</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T10:45:33", "background_image": "https://media.rawg.io/media/screenshots/6d0/6d0082baf80715b92c95ba9da0576474.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lerichem"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}