{"id": 73452, "slug": "scary-wolf-online", "name": "Scary Wolf Online", "name_original": "Scary Wolf Online", "description": "Grow your clan &amp; fight for your on survival in this multiplayer scary wolf game. Have you ever imagined of being wild Wolf?<br/><br/>Experience the realistic safari hunter with its own clan of wolves. Be a wild Wolf and survive in the wildness as long as you can. Start your own pride of wolves, fight for your life against fierce animals. Your strength is those sharp claws, acute sense of smell, and tenacious jaws &amp; also your pack. Your family can help you in combat and hunting. Build your own clan of wolves and raise your family. Go to hunting with your mate to get food and train your wolf cubs.<br/><br/>Go in search of adventure either you can play solo or online against your friends. This game has two modes, offline mode &amp; online mode where you can interact with your friends &amp; family or can play against them. Team up against your enemies with your pack and show your aggressive and majestic side. Survive in a massive world of wilderness that’s filled with new dangers and speedy prey! <br/><br/>Recruit, raise, and customize your wolves, hunt down prey to feed your pack, and battle for your life against fierce animals! You'll need to maintain your health, hunger, thirst, and energy if you're going to survive in the wilderness!<br/><br/>Set free the wolf in you!<br/><br/>Scary Wolf Online Multiplayer Game Features:<br/>•\tComplete challenging and exciting hunting quests <br/>•\tUpgradeable energy and health features<br/>•\tCustomize your wolf and clan at your own choice<br/>•\tEasy &amp; detailed game controls<br/>•      Online &amp; offline multiplayer features<br/>•\tRealistic wilderness<br/>•\tRPG-style gameplay: level up, evolve, complete quest<br/>•\tFight for survival against brutal safari animals", "metacritic": null, "released": "2018-05-15", "tba": false, "updated": "2019-07-29T17:09:59", "background_image": "https://media.rawg.io/media/screenshots/205/205e503af056bbff2d886105596c6269.jpg", "website": "http://www.tapinator.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tap2Play"], "genres": ["Adventure", "RPG"], "publishers": ["Tap2Play"], "esrb_rating": null}