{"id": 734645, "slug": "zelda-classic", "name": "Zelda Classic", "name_original": "Zelda Classic", "description": "<p>Zelda Classic is a tribute to (what we think is) the greatest video game of all time: Nintendo’s The Legend of Zelda. It has been developed into an exact replica of the NES version that we all know and love. Beyond that, Zelda Classic allows the development of new quests that can use either the traditional graphics or enhanced graphics, as well as new enemies, items, and challenges.</p>\n<p>Though it started as a basic Legend of Zelda clone by programmer Phantom Menace in April of 1999, Zelda Classic has grown into something much bigger in the past few years. A full LOZ replica was achieved by June of 2000, with Zelda Classic version 1.84, but the story didn’t end there. Although Phantom Menace moved on to other projects, Fans of Zelda Classic wanted more.</p>\n<p>Fast forward to after about a year of searching for a new programmer, when Dark Nation comes to Armageddon Games, and breathes new life into what seemed like a dying beast. Within weeks, a new version of Zelda Classic is released, and it’s popularity soars. Zelda Classic 1.90, introduced a list of new features, and with it’s addition to Download.com, Armageddon Games is flooded with about 3000+ new members, and over a million downloads in a matter of months!</p>\n<p>Zelda Classic has since been released as open source and has current stable ports on Windows, MacOS, and Linux. Development continues to this day with new features still being added. Check back often to see what’s new!</p>", "metacritic": null, "released": "2000-04-16", "tba": false, "updated": "2022-08-23T18:58:53", "background_image": "https://media.rawg.io/media/screenshots/8db/8dbaa8a2e5c3c2463aba445425567a02.jpg", "website": "https://www.zeldaclassic.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": [], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}