{"id": 734603, "slug": "arco-inimigo", "name": "Arco Inimigo", "name_original": "Arco Inimigo", "description": "<p>Há muito tempo atrás, houve um arqueiro muito habilidoso.</p>\n<p>Seus feitos surpreendiam até os mais experientes arqueiros de sua época.</p>\n<p>Diziam que ele podia acertar com precisão 15 soldados ao seu redor em 15 segundos.</p>\n<p>Contudo, sua fama não durou muito.</p>\n<p>Em uma terrível e escura noite, um ataque ocorreu ao seu vilarejo.</p>\n<p>Nessa noite, esse arqueiro morreu.</p>\n<p>Testemunhas disseram que algo estava terrivelmente estranho.</p>\n<p>Ele havia errado todas as flechadas, até as mais fáceis.</p>\n<p>Desde esse dia, acredita-se que seu temível arco é amaldiçoado, e o esconderam.</p>\n<p>Muitos tentam usá-lo novamente, mas todos que conseguem, morrem pouco tempo depois, com o mesmo destino.</p>\n\n\n<p>Esse jogo é um pequeno puzzle feito inteiramente em 1 semana para a GameJaaj 7 - ArquiInimigo. Como não tive muito tempo, a curva de aprendizagem pode ser um pouco tênue, e acredito que o último puzzle vai se mostrar um verdadeiro desafio para alguns.</p>\n<p>De qualquer maneira espero que gostem.</p>\n<p>WASD para se mover</p>\n<p>Mouse para mirar</p>\n<p>Shift para correr</p>\n<p>Espaço para pular</p>\n<p>Botão esquerdo do mouse para atirar</p>\n<p>Botão direito do mouse para parar o tempo</p>\n<p>R para pegar as flechas de volta</p>\n\n<p>Alias, o nome do arco é Archie, mas isso não é referenciado no jogo nenhuma vez.</p>\n\n<p>------------ENGLISH------------</p>\n<p>Although this game was made for a brazillian gamejam, it is also available in english!</p>\n\n<p>A long time ago, there was a very skilled archer.</p>\n<p>His feats surprised even the most experienced archers of his time.</p>\n<p>It was said that he could accurately hit 15 soldiers around him in 15 seconds.</p>\n<p>However, his fame did not last long.</p>\n<p>In one terrible dark night an attack took place in his village.</p>\n<p>That night, that archer died.</p>\n<p>Witnesses said something was terribly wrong.</p>\n<p>He had missed every arrow, even the easiest ones.</p>\n<p>Since that day, it is believed that his fearsome bow is cursed, and it has been hidden.</p>\n<p>Many try to use it again, but everyone who succeeds, dies a short time later, with the same fate.</p>\n\n<p>This game is a small puzzle made entirely in 1 week for GameJaaj 7 - Archenemy. As I didn't have much time, the learning curve can be a little tenuous, and I believe the last puzzle will prove to be a real challenge for some.</p>\n<p>Anyway, I hope you like it.</p>\n<p>WASD to move</p>\n<p>Mouse to aim</p>\n<p>Shift to run</p>\n<p>Space to jump</p>\n<p>Left mouse button to shoot</p>\n<p>Right mouse button to stop time</p>\n<p>R to get the arrows back</p>\n\n<p>By the way, the name of the bow is Archie, but this is not referenced in the game.</p>", "metacritic": null, "released": "2022-01-31", "tba": false, "updated": "2022-02-04T11:31:04", "background_image": "https://media.rawg.io/media/screenshots/98b/98b62c2e2eba14c0a9e44159fd269eed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Herbherth"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}