{"id": 73478, "slug": "garbage-dumper-truck-driver-3d-free-play-game-simu", "name": "Garbage Dumper Truck Driver 3D: Free Play Game Simulator", "name_original": "Garbage Dumper Truck Driver 3D: Free Play Game Simulator", "description": "**Garbage Dumper Truck Driver 3D is Garbage Trucker Transport Simulator Happening in 2016**<br/>*What is this Game All About:*<br/>                 In this Game Your role is to clean city roads, highway and small streets,valley, you will be driving garbage dumper truck, park it near trash can and rubbish mounds, as driver and garbage man you will pick up the garbage can and lift truck of garbage truck to dump rubbish in it, for large amount of garbage forklift is there to help.Forklift is basically use for picking up heavy garbage can Use forklift for pick up garbage cans.<br/>                 Rescue this city from all of dirt and rubbish and sweep clean it from criminal garbage don't let a straw of garbage escape.<br/>*Simulation?*<br/>                                                   In this Game You will be having a simulation experience of Parking, Driving, Picking Objects from city Streets, roads, highways, this 3d simulator game will take your gaming experience to a new level.<br/>Garbage Truck adventure is taking place in City street, highways &amp; multi-storey building, streets and roads are littered with monster garbage, trash can are to be picked, pile of garbage is to be lifted by fork lifter to dump it outside of city through high way, you are garbage hero in this game, your task is to<br/>Drive garbage truck to rubbish littered sites in city &amp; highway, You will learn waste management, transporting by truck and dumping in landfill. Our Job is to Clean our Magic Kingdoms and become Ultimate City Cleaner Hero. Drive Fast in speed like Fire. its all about your Magic and survival of city from trash.<br/>Pick the Garbage Trashcans, collect all the rubbish, Stardeww velly should be clean as well as san Andreas.<br/> <br/>                 - Sweep area clean<br/>                 - Fill rubbish in truck<br/>                 - Drive to Transport at dump site<br/>                 -Animation of Real Time Garbage Dumping<br/><br/><br/>This simulation game is perfect simulator for garbage related adventure, it contains driving, parking, picking of objects loading Garbage truck and then drive it to dump area. <br/><br/>* Garbage Dumper Truck Driver 2016 - Game Features *<br/>x- Live life of Garbage Trucker Hero valley! <br/>x- Earn Point, Make Hight Score in limited Time.<br/>x- Drive around in the 3d kingdoms like city of valley<br/>x- Become the best garbage truck driver ever!<br/>x- It will Train you as Truck Transport Driver <br/>x- It will Train how to use heavy machinery like forklift<br/>x- FREE download , Have Fun<br/>x- No Wifi No Problem!<br/>x- Recycle &amp; Go Green<br/><br/>* Free Play Simulation Game - Contain Ads *", "metacritic": null, "released": "2016-04-11", "tba": false, "updated": "2019-10-22T14:24:31", "background_image": "https://media.rawg.io/media/screenshots/1b5/1b5d1dcf3c5c3d45044eda165107f433.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Simulation"], "publishers": ["Syed Shahzad"], "esrb_rating": null}