{"id": 73479, "slug": "ivory-tiles", "name": "Ivory Tiles", "name_original": "Ivory Tiles", "description": "***FREE FULL GAME! DOWNLOAD NOW!!***<br/><br/>***Where Zen and Relaxation Meet Puzzle Gaming***<br/><br/>Download Ivory Tiles today while it's FREE!!! <br/><br/>Over 80 hand-crafted levels of Puzzle Zen. The original puzzler that is easy to pick up and play, yet challenging to master. <br/><br/>Tilt or touch your iPhone or iPod Touch to stack, slide, turn, trap, ferry, drop and shift the tiles to their home. <br/><br/>Regarded by many as a meditative pastime, this original creation includes over 80 uniquely hand-crafted gameboards. <br/><br/>Simple to understand and play, but a lifetime to master. Follow the ancient Taoists as you journey with increasing difficulty from the Beach to the Heavens. Can you reach enlightenment? <br/><br/>Features: <br/>- Over 80 hand crafted levels to pit your brain against. <br/>- Progressive difficulty means kids can have fun playing the early stages. <br/>- Supports both tilt and touch input control. <br/>- Beautiful mahogany boards and ivory tiles rendered in realtime 3D. <br/>- Soothing authentic traditional Chinese music arranged by \"Silk &amp; Bamboo Ensemble\" and \"Cheng Yu\" <br/>- Personal high scores tracked for each puzzle. Achieve Zen when you take it a step further and reach the \"perfect\" score. <br/>- Campaign screen and easy-to-use level select. <br/>- Configurable audio and input settings. <br/><br/>--- <br/>Reviews: <br/><br/>PocketGamer.co.uk “If you enjoy a good spatial puzzle game, Ivory Tiles will have you hooked for many pleasant hours.” <br/><br/><br/>AppleGazette.com “If I had one “negative” thing to say about it, it would simply be that it’s TOO addicting.” <br/><br/><br/>CultOfMac.com ” Ivory Tiles draws you into the challenge of solving its spatial and geometric puzzles like nothing I have ever experienced.” <br/><br/><br/>GamersDailyNews.com – 9.0 <br/>BestAppEver.com’s “Best Puzzle Game of 2008″ and “Best Casual Game of 2008!” Nominations", "metacritic": null, "released": "2008-12-03", "tba": false, "updated": "2019-10-22T14:05:08", "background_image": "https://media.rawg.io/media/screenshots/23b/23bb5495f335581ad4b08364be26b730.jpg", "website": "http://www.ivorytiles.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MunkyFun"], "genres": ["Strategy", "Puzzle"], "publishers": ["MunkyFun"], "esrb_rating": "Everyone 10+"}