{"id": 734738, "slug": "dimension-quest-pinball", "name": "Dimension Quest Pinball", "name_original": "Dimension Quest Pinball", "description": "Dimension Quest Pinball is a spinoff of the (currently) unreleased Dimension Quest : Altered Fates, a game that's been in production with Team Decaf for quite some time. The focus here is quick thinking, smashing into enemies, and beating bosses to get a high score and advance to the next chapter!<h3>[Story]</h3><br/><strong>\"It's time to play some pinball!\"</strong><br/><br/>The Dimension Quest cast (really, just Jadon) has gotten tired of waiting around for a mission, and has hopped into a game of pinball to pass the time! Join Jadon and a collection of characters on a quest to defeat team villain and move stylishly while doing it!<h3>[Gameplay]</h3><br/>Dimension Quest Pinball is fundamentally similar to most pinball games, featuring flippers and a plunger. However, included within the game is a cast of characters each with unique traits and powers to use when tearing through enemies! Careful usage of these can greatly decrease the time spent in each level, and increase the timer bonus given at the end!<h3>[What's Dimension Quest?]</h3><br/><strong>Dimension Quest : Altered Fates</strong> is a game that's been trapped in the production cycle for a little over half a decade at this point. It's a game that means a lot to the team, but the lack of a dedicated programmer has left the game in a state of limbo without any force to push it into a playable state. To remedy this, the lead designer of the game became the lead programmer and has taken the time to create a smaller game to show people a taste of what Dimension Quest can be! We hope you enjoy this game as much as we enjoyed making it, and be on the lookout for future updates to this game and the release of <strong>Dimension Quest : Altered Fates</strong> in the future!", "metacritic": null, "released": null, "tba": false, "updated": "2022-02-07T03:13:30", "background_image": "https://media.rawg.io/media/screenshots/831/83147acf3d47a8b383103d40ad10a712.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Decaf"], "genres": ["Indie"], "publishers": ["Team Decaf"], "esrb_rating": null}