{"id": 734751, "slug": "damn-ropes", "name": "Damn Ropes", "name_original": "Damn Ropes", "description": "<strong>Damn Ropes</strong> is this one hard game nobody wants to play because it's too difficult a challenge but you play it anyway (just don't tell anyone you play on the 'Not So Hard' mode).<h3>You want your own NPC in the game? Join our Discord for more info on this!</h3><br/><br/><br/>There's no running and jumping in this platformer game. Use your rope to swing from platform to platform. Perform impressive maneuvers, beat diverse challenges and speedrun your way through each level. Oh, did I mention you can fall all the way down to the beginning of each level?<br/><br/><br/>Ah yes. Story. There is a story in this game. There's actually a pretty deep story in here. But we can't just throw massive dialogues at you while you try not to fall down. Pay attention to the background and other small details to understand the lore and deeper meaning of the games story. Or don't. It's up to you!<br/><br/><br/>So you're a fan of torturing yourself so you speedrun every single game you can find? Good thing we prepared the game for you! There's a timer for every level as well as a global timer to track your records. The obvious route to the goal is not always the fastest one (spoiler: It never is).<br/><br/><br/>So the game isn't difficult enough for you? Then try activating a challenge. Or two. Or all of them. There are challenges like the 'The Floor Is Not Lava But Very Dangerous' challenge where you've to reach the goal without touching the ground. Or the 'Your Rope Isn't As Good As It Should Be' challenge where you can't expand or decrease it. If you can beat the whole game with every single challenge activated at once you gained our deepest respect.<br/><br/><br/>We want to create a difficult game, but we also want everyone to enjoy it. So we implemented the 'Not So Hard' mode (it just sounds less rude than easy mode). This mode helps a lot when you've trouble beating the game. It's easier to hit the environment with your rope and you can expand and decrease it further.", "metacritic": null, "released": null, "tba": false, "updated": "2022-02-07T03:21:42", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e6c1d410f961b0b51f1f6e7e9ccb0f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["byXToGo"], "genres": ["Action", "Indie"], "publishers": ["byXToGo"], "esrb_rating": null}