{"id": 734718, "slug": "the-haunted-grounds", "name": "The Haunted Grounds", "name_original": "The Haunted Grounds", "description": "Welcome to The Haunted Grounds,<br/><br/>You are in a flooded Village alone, No one knows how you got there but their is someone or some unknown entity watching you.<br/><br/>Your main mission is to find 2 VHS Tapes without getting caught by the unknown entity, There are locked chests, doors That you must find a code to unlock<br/><br/>Somewhere in the Map there is a Shotgun, Axe and other items you can find to break doors and kill the unknown entity.<br/><br/>There are Interactable Objects you can pick up such as Axes, Flashlights, Boxes and more<br/><br/>There are loads of Buildings to explore (Coming to Early Access Soon!)  <br/><br/><strong>=-----=-----=-----=INFORMATION=-----=-----=-----=</strong><br/><br/><strong>Please note, <strong>This is my First Project on Steam, Expect some bugs and glitches I will fix them</strong>, I will be doing regular updates of the game, If you have any Issues? You can go to the Support Section and send a Email. Currently the Game is in Early Access! This is not the full version of the game! Full Version expected to be Released on (STEAM PLANNED RELEASE DATE) Thanks for your Patience.</strong><br/><br/>Current Build: (EAV)1.8.0<br/><br/>- Exploration and completion challenge.<br/>- macOS Support  - Coming Soon (Will be supported after final Release or EAV1.9.0)<br/>- Multiplayer Will be added once the game has fully been released. <br/>- Early Access <br/>- Cheap Price (Reason for low Price since its still in Development and isn't the Full Release) <br/>- Windows Supported<br/>- Game has Graphics Settings (Low, Med, High, Ultra<br/>- May add VR Support for SteamVR and Oculus after final Release (Oculus SDK V1.3 and Above, HTC Vive and other VR Headsets)<br/>- 1 Expansion DLC package with 3 Other Levels/Chapters will be added Throughout the Early Access and Final Release and more will be added in the future. (I cannot do the Levels for the DLCs separately since Its way to complicated to do it for each level I have done it as one major DLC instead)", "metacritic": null, "released": null, "tba": false, "updated": "2022-02-07T03:00:37", "background_image": "https://media.rawg.io/media/screenshots/8cf/8cfe83ed71c874f3a59ef964ab28e30b.jpg", "website": "https://unityba747.wixsite.com/unity", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BA747"], "genres": ["Adventure", "Indie"], "publishers": ["Zak's Unity Projects"], "esrb_rating": null}