{"id": 73470, "slug": "bus-driver-2k18-driving-games", "name": "Bus Driver 2k18: Driving Games", "name_original": "Bus Driver 2k18: Driving Games", "description": "Bus driving in the midst of heavy traffic and pedestrians walking, crossing roads, is a heck of a job certainly for the amateur driver. Driving skills are put to test in this virtual simulation to become ultimate driver and master of city roads, pick and drop the passengers from the street to desired yet beautiful locations around the next-gen high graphics 3D virtual city, proceed each level by completing the exciting and challenging missions of game in time with minimum damage done to the vehicle. Don’t forget to refill fuel when the tank is running low. Open world map, incredible vehicles, wonderful interiors will make you feel a realistic bus driving experience! It's time to get on board and drive through mesmerizing streets! Enter the simulation world of bus driving! Get Bus Driver 2018 now!<br/>Try to be the most famous bus driver. Prove yourself as the best. Bus driving had never been so easy and fun! This is the latest simulation game that many have been waiting for. Drive the bus and be safe on the road. <br/><br/>KEY FEATURES<br/>- Stunning 3D graphics.<br/>- Smooth and realistic car handling (button or tilt).<br/>- Many buses to choose from. <br/>- Pick and drop from stops as more as you want.<br/>- Farther you ride, bigger you score<br/>- Attribute upgrades.<br/>- Challenging daily mission.<br/>- Tilt your phone to rotate bus.<br/>- Touch buttons to gas or brake bus.", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2019-07-29T17:11:51", "background_image": "https://media.rawg.io/media/screenshots/627/62798f52bebb089dbcd4196ac3a79890_iqWStfk.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammadnabeel khan"], "genres": ["RPG", "Simulation"], "publishers": ["muhammadnabeel khan"], "esrb_rating": null}