{"id": 734717, "slug": "reds-adventure-a-seasons-new-beginning", "name": "Reds Adventure A Seasons New Beginning", "name_original": "Reds Adventure A Seasons New Beginning", "description": "Reds Adventure A Seasons New Beginning is a little, but fun 2D platformer where you play as a red blob fighting through the different levels in each of the 4 different seasons to save the season from the enemies you will encounter. (Although this is not said in the main game). <br/>\n<br/>\r\nEach season presents itself with its own challenge.<br/>\n<br/>\r\nSummer:<br/>\r\nIn Summer you will be faced with incredible heat to knock your spirit down.<br/>\n<br/>\r\nAutumn:<br/>\r\nIn Autumn the leaves will blow in your face and you must be careful to not be blinded by them.<br/>\n<br/>\r\nWinter:<br/>\r\nIn Winter you will have to tread through the harsh and cold snow.<br/>\n<br/>\r\nSpring:<br/>\r\nIn Spring you will be surrounded by a lovely breeze but don't get too comfortable remember you still need to save the seasons!<br/>\n<br/>\r\nIn the game, there are two different enemies that will stop you on your trail.<br/>\n<br/>\r\nThe blocks and the maces. The blocks are square entities with spikes around them and angry eyes, while the maces are just maces that spin around in a circle. You will need to face both enemies in order to complete the level.<br/>\n<br/>\r\nIn order to move to the next level you will need to get to the chest at the end of the level but be careful because some levels will take you off the path and mislead you with a fake chest.<br/>\n<br/>\r\nYou will also find checkpoints around the level so when you die you will respawn at that checkpoint.<br/>\n<br/>\r\nHappy traveling Red Adventurers! Enjoy the journey.", "metacritic": null, "released": "2022-02-04", "tba": false, "updated": "2022-02-07T02:59:59", "background_image": "https://media.rawg.io/media/screenshots/d3c/d3c594d1b897292c5066e0e5e7b493b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CatCorp Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["CatCorp Studios"], "esrb_rating": null}