{"id": 73493, "slug": "army-men-battle-strike-game", "name": "Army Men: Battle Strike Game", "name_original": "Army Men: Battle Strike Game", "description": "Following the army base takeover, one ordinary man whose brother has been killed in action takes matter into his hands, gets himself enlisted in the military to go behind the enemy lines in war field shooter. Jake drives an army truck at first to facilitate the commandos onto their battle missions but after the betrayal by the inside man he feels an urgency to get recruited in the army to strike and help his native homeland fight the battle and save the city from ultimate disaster by the rival group of merciless trained furious combatants. He must confront his fears in the battlefield in order to discover and thwart their destructive goals. Intercept, eliminate, strike and extract. It’s time to hone your shooting skills and orchestrate the perfect assassination of outlaws. Shoot and Kill terrorist leader and all his gunners; destroy enemy &amp; their communication in shooter battle, cut off the power source and strike enemy in the military assault. Don’t let them radio their fellow comrades for backup. Plan ultimate military assault in Warfield shooter.<br/>Us army battle for outlaws legends is an action-packed simulator shooting game developed for extreme shooting fans in the midst of battle zone fighting for the hostile takeover of the army base camp to destroy the baseline of military. You are equipped with modern military weapons in this first person shooter game. Drive around the battle zone with different objectives, chase enemy leader and exemplary strike and kill him for all enemy groups. Answer the call of outlaws legends in battle, World peace is now in your hands, shoot and fight against evil in this modern army battle game of outlaw legends in shooter battle. Search for the mole in your military group and save your fellow men from betrayal.<br/>Us Army battle shooting game is the best free game in modern warzone shooting games of 2018. A real action outlaws military assault game with real shooting experience of advanced military weaponry such as assault rifle, m4A1, AK-47 and hand pistols with lots of deadly rounds &amp; shooter battle. Download now from Apple store and enjoy the exciting experience of battle fight in war zone with military weapons. <br/><br/>Gameplay Features:<br/>Modern combat field and story-based gameplay.<br/>Amazing 3D City Environment.<br/>Drive around to pick army commandos from the​  base.<br/>Interesting Challenging Scenarios.<br/>Smooth and intuitive controls.<br/>Stunning &amp; High Quality 3D Graphics. <br/>Intense battlefield scene and challenging missions.<br/>Sniper shooting with accurate kills.", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-07-29T17:12:22", "background_image": "https://media.rawg.io/media/screenshots/1b3/1b3cce40820841ef1b59c6bec285f9e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammadnabeel khan"], "genres": ["Action", "Simulation"], "publishers": ["muhammadnabeel khan"], "esrb_rating": null}