{"id": 7350, "slug": "worms-4", "name": "Worms 4", "name_original": "Worms 4", "description": "<p><strong><em>4/5 - &quot;charmingly fun,&quot; 148 Apps</em></strong><br />\n<strong><em>4/5 - &quot;I can&#39;t deny the grin it put on my face,&quot; Touch Arcade</em></strong><br />\n<strong><em>4/5 - &quot;probably the best mobile game in the series and worth picking up for the missions alone,&quot; Tap Smart</em></strong><br />\nThe latest instalment in the worldwide mega hit franchise!<br />\nWhen the guys and girls at Team 17 jump around and squeal with excitement, you know you are on to a winner.    You see, the team who designed Worms 4 had you and your favourite device in mind when they created;<br />\n•         Synchronous Multiplayer Matches: Battle against opponents from around the world with real time one on one online multiplayer matches!<br />\n•         Shorter, more explosive matches to provide compelling bite sized gameplay.<br />\n•         Streamlined menu systems to get you into game with a minimum of fuss.<br />\n•         Add enriched cartoon visuals which look great even on the smaller screens.<br />\nBut that’s not all! Take a look at the below list and you will see why the folks at Team17 are simply buzzin about Worms 4.<br />\n•         Brand New Weapons: Wreak havoc with an assembly of brand new weapon designs including Hailey’s Comet!<br />\n•         Weapon Upgrades: Worms 4 is designed to be a very rewarding play experience. Players can collect more than a hundred weapon upgrades to make their worms more powerful! Weapon upgrades can be mixed and matched to better suit the player’s strategy.<br />\n•         Five Gorgeous Locations: Do battle in five beautiful hand drawn regions: Middle Turf, Candiville, Wacky-Habara, Tomorrow Islands and the Fro Zone.<br />\n•         80 Single Player Missions: Test your skills against 80 single player missions. Missions are designed not only to provide the player with hours of enjoyment, but also to teach the finer points of Worms playing strategy!<br />\n•         Factions: Each player in the game chooses an allegiance, fighting under the banner of Red or Blue! The daily tug of war competition pits faction against faction, with the winners reaping the benefits of extra in-game rewards!<br />\n•         World Events: Each week dynamic events take place around the game’s world map. The player enters into these events and competes against other players, with the aim of representing their faction and earning prizes for fellow faction members.<br />\n•         Better with Metal: Users whose devices have metal support enjoy additional visual effects.<br />\n•         Fantastic Customisation Options: As always, Worms 4 features a plethora of great customisation options, allowing the player to individually customise each worm and give their team the personal touch!<br />\n•         Daily Challenges: Partake in fun optional daily challenges to earn yourself and your faction additional rewards!<br />\n•         Loot: Spin the loot wheel and break open the loot chests to gain truckloads of rewards and customise every aspect of your worm!<br />\n•         Connect with Friends: Connect your Facebook account to battle your friends in online multiplayer or view your friend’s progress on the world map screen and compete to beat their scores.<br />\nGet even more Team17 information, including the latest game updates and more…<br />\nFacebook: /WormsTeam17<br />\nTwitter: @Team17Ltd<br />\nWeb: www.team17.com<br />\nDON’T MISS OUR OTHER EXCITING WORMS GAMES ON THE APP STORE<br />\nWorms Special Edition, Worms Crazy Golf, Worms 3 &amp; Worms Revolution - Deluxe Edition.</p>", "metacritic": 74, "released": "2015-09-03", "tba": false, "updated": "2023-11-16T11:37:33", "background_image": "https://media.rawg.io/media/screenshots/dff/dff25feb1efc4cd8c73b83a0c8f236ba.jpg", "website": "http://www.team17.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 3, "beaten": 2, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 182, "game_series_count": 18, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Team17 Digital"], "genres": ["Action", "Strategy"], "publishers": ["Team17 Digital"], "esrb_rating": null}