{"id": 73519, "slug": "demolition-derby-crash-racing-free-play-car-war", "name": "Demolition Derby Crash Racing: Free Play Car War", "name_original": "Demolition Derby Crash Racing: Free Play Car War", "description": "- Can you survive deadly demolition mania ? Get ready for the ultimate death race and Destroy your Rivals in Crash destruction. HOW LONG CAN YOU SURVIVE THE ARENA ?<br/><br/>- Knock down &amp; destroy your rivals with action packed crash Demolition Derby Race.<br/> <br/>Hit hard &amp; Reckless other derby cars , Smash them and destroy rival derby cars to disable them while sustaining minimal damage to your own vehicle, over and over again until you’re the last one standing. Drag other derby cars in addition push your opponents off the bridge to win the battle in derby death racing Car crash and traps cause damage. Speed up you derby car with nitro and enjoy with amazing physics sandbox . Derby demolition is an absolutely thrilling and action packed big-moto carnage game, where your car driving skills are tested to the extreme with speed driving in speedway and recklessness !<br/>-Can you make the deadly rumble bang in the desert?<br/>Drive you derby car as fast as you can . you play demolition game with other vehicle like bus demolition derby , monster demolition  derby but the car demolition derby is an amazing one . Avoid car accidents bang as much as you can. <br/><br/>[ Demolition Derby Crash Racing 3D Features ]<br/>- Nerve wracking action<br/>- Choose your favourite derby car model.<br/>- Real-time vehicle destruction and damage<br/>- Awesome environments: Derby Arena, Roof Top Helipad.<br/>- Realistic Vehicle Physics and smooth controls.<br/>- FREE download  Completely free-to-play", "metacritic": null, "released": "2016-03-22", "tba": false, "updated": "2019-10-22T14:24:31", "background_image": "https://media.rawg.io/media/screenshots/c3f/c3fa9aa182277fbb3809f88a750bf928.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Action", "Racing"], "publishers": ["Syed Shahzad"], "esrb_rating": null}