{"id": 73517, "slug": "haunted-house-dead-inside", "name": "Haunted House: Dead Inside", "name_original": "Haunted House: Dead Inside", "description": "There is an old scary dead ghost witch inhabited along with disembodied bloodthirsty spirits of the deceased who may have been former residents risen from grave inside the scary house who likes to play with kids and in the end they all end up dead. After a detour of the old haunting house, Alan discovers a group of crazed, murderous outcasts poltergeist ghost creatures living inside the haunted house and there is no sign of his partner but finds some belongings of her in the hallway. He must now follow and solve the mystery, finding his way into the creepy building battling the scary psychopath old witch in a haunted house, in the midst of phantom assassinations and spine-chilling horror story Alan has to band together with her partner and flee from the evil possessed ancient demonic palace. Do not get manipulated by the evil spirits, find the escape route from the haunted house, trusts your instincts, you will have to use all the tools that you have at your hand to complete the puzzle and unlock doors finding the key hidden somewhere in a structure that will help you get out of here. This is a paranormal horror and creepy game. You must be very careful at clues and at small differences, to think logical at how to escape quickly from this house full of mean ghosts and evil spirits.<br/>Features of Crazy Evil Horror Game:<br/>High-end 3D haunted house graphics.<br/>The fearful​ and tense atmosphere.<br/>Horror and interesting game levels.<br/>Lots of ghosts, monsters and evil creatures.<br/>You will feel the terror in your bones<br/>That slender devil gives the creeps.<br/>Addictive and challenging rooms.<br/>Tricky puzzles and innovative brainteasers.<br/>Hidden objects, locks &amp; keys and more challenge await!<br/>Gorgeous graphics and different themed rooms!<br/>Scary atmosphere.<br/>High-quality scary music.<br/>High quality and Realistic graphics.<br/>Compelling layers of mystery.<br/>Download now the haunted house horror game and enjoy the crazy scary themed evil haunting survival game on AppStore!", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-07-29T17:13:12", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b2598a8e400da24476f46069318ed9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammadnabeel khan"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["muhammadnabeel khan"], "esrb_rating": null}