{"id": 73528, "slug": "clumsy-mountaineer", "name": "Clumsy Mountaineer", "name_original": "Clumsy Mountaineer", "description": "Prepare your equipment and get ready to climb a little! Climbers are usually strong, smart and accurate, they always know their next move, but that is not about our hero. In our new simulator, you will play as the most clumsy climber ever. Try to reach the edge of the hill, but many obstacles like icefalls or uprising waves awaits you on your way. Icefalls will change your way and waves are cutting your time, as if they reach our clumsy climber, the hero will drown. Reach the edge of the hill to prove everyone that you are not a clumsy climber in our new simulator: Clumsy Mountaineer. Let no icefalls or waves distract you from your target and conquer the hill!<br/> <br/>In this simulator, you will play as a mountaineer, but not as a common one, your hero is a clumsy climber. You have only one target – to reach the edge of the hill, but that is not an easy task, as many an obstacle awaits you on your way. Cruel icefalls are quite usual on this hill, so evade them, as they break your way and can drop you from the hill. Also, you have no time to stay at one place, as waves are uprising and if you will fall down or will not climb for some time waves will reach the clumsy climber and our hero will drown. Pass every obstacle successfully and reach the edge of the hill. Share this game with your friends and climb together. Find out who will reach the edge of the hill and who is the clumsy climber, who will be dropped to waves by icefalls.<br/><br/>Clumsy mountaineer is a free to play simulator of climbing up a hill. Become the best climber in the game and reach the edge of the hill. Evade all icefalls and do not fall into waves. Prove everyone that you are not a clumsy climber and move forward to the next hill. If you have some free time to spend, this simulator is your best choice! Call your friends, climbing is much more fun when you climb together. Download our simulator and help our clumsy climber prove everyone that edge of the hill is not so hard for him.", "metacritic": null, "released": "2018-07-30", "tba": false, "updated": "2019-10-22T14:05:29", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b147f86c1232c7470f41ec0ae996f5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Denis Sandakov"], "genres": ["Simulation", "Arcade"], "publishers": ["Denis Sandakov"], "esrb_rating": "Everyone 10+"}