{"id": 735291, "slug": "dear-daisy-demo-1", "name": "Dear Daisy, (Demo 1)", "name_original": "Dear Daisy, (Demo 1)", "description": "<p>You play as a detective taking on a re-opened case from about 30 years ago (Takes place in 2009).  You must reveal what they didn't 30 years ago in a mental hospital founded by a man named Stephen James.</p>\n<p>Stephen James  was born on October 20th, 1958. He went to St. Patrick's University for 4 years studying psychology and mental health. He graduated in 1981 and then founded a mental hospital to do experiments on PTSD patients and grieving patients. Most of his experiments did good things for mental health as a science. He had a wife and a child, Daisy, his wife and Jaime his daughter. <br/></p>\n<p>In 1986 his wife was murdered by one of Stephen's patients. Stephen went into a depressive state and started doing inhumane experiments on his patients, including his daughter, Jaime. He was then declared insane and put in his own mental hospital. \r\n</p>\n<p>He thought that Daisy was still alive, because he never got to the acceptance stage of grieving and continuously wrote letters to her that never got out. In 1992 he died of tuberculosis. </p>\n\n<p>BUT BE WARNED! Re-opening this case is highly dangerous. The police have lost several agents and detectives in it, rumored to be mentally manipulated and tortured by the lost soul of Stephen and his daughter. But that's just a bunch of paranormal crap, Right?</p>\n<p>...Right?</p>\n\n<p><strong>Separate note note from the developer: Hi! I'm writing this to warn you. In this demo there are a lot of sensitive topics, blood, and jump scares.  There is also a lot of bugs, (remember this is an unfinished game</strong><strong>). There will be more demos in the future  and I'm only making a demo so people can test it out for themselves and I can get a little more detail on it. The story was based off the song \"Daisy Bell\" by Harry Dacre in 1892. If you want more detail on how the game was made, here is the video Devlog: </strong></p>", "metacritic": null, "released": "2022-02-06", "tba": false, "updated": "2022-02-07T05:26:07", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d66165442e01c557ac4e120537b1ef3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frenchyboy"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}