{"id": 735277, "slug": "extreme-birdie", "name": "Extreme Birdie", "name_original": "Extreme Birdie", "description": "<p>its just another clone of flappy bird but with better graphic and new obstacles. I made this game for <strong>Mini Jam 99: Birds</strong> as u c (btw its my first game jam).  When im writing this its one day untill end of jam, so information here can be bit different from actual game. so...</p>\r\nA bit about controls.\r\n<p>you can select elements in menu by pressing <strong>[UP] </strong>or <strong>[DOWN]</strong> (can also with w and s).</p>\n<p>other controls you can find in special thing called controlls. to enter it: when you in menu press down, then again and now press enter. here you can find all keys and what they do. </p>\n<strong>Some information about gameplay.</strong>\n<p>so you are birdie. the game is actually flappy bird. at this momemnt here is two kinds of pipes. yellow and green. green are just pipes. they dont do anything. yellow are more interesting. they are sending bombs to you. actually you have no to worry about. its very low chance to them kill you. they are sending bomb one time for 2 seconds. its ez to dodge by pressing space. you will dash.</p>\n<strong>Other.</strong>\n<p>so. game is kinda cool but has something to do like powerups or skins. i doubt that ill make it in period of jam. btw pls download. any feedback is apreaceate. </p>\n<p>so. i hope you will play this game and also you will like it! good luck in playing.</p>\n<p>btw my best is <strong>2163</strong>. try to beat it</p>\n\n<p>btw game has easter eggs. try to find them! (here is no controls for them in controls)</p>", "metacritic": null, "released": "2022-02-06", "tba": false, "updated": "2022-02-07T05:23:39", "background_image": "https://media.rawg.io/media/screenshots/a53/a531ea57aed1c0987c0236097a241b54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DryCarrot"], "genres": [], "publishers": [], "esrb_rating": null}