{"id": 73534, "slug": "ambulance-simulator-3d-city-emergency-rescue-drivi", "name": "Ambulance Simulator 3D: City Emergency Rescue Driving", "name_original": "Ambulance Simulator 3D: City Emergency Rescue Driving", "description": "Ambulance Simulator 3D : City Emergency Rescue Driving<br/>\"Rescuing humanity in danger is really appreciated by whole world\"  <br/>  Be a real modern day hero by doing some relief work in real urban city especially the highway area which is under construction and a due to heavy vehicles heavy amount of accidents is noted.<br/>Modern Hero received a mobile phone call from police department and a massive accident has been reported on the highway and you must respond because you’re the on-duty ambulance driver. Police cop’s car and 911 Relief Rescue Team is also at the location.It can be a crime scene.Get in your ambulance van and drive fast to the accident location. Don’t forget to put on the siren and push the throttle as a driver you know that driving an ambulance is always a crucial task because it’s always in a state of emergency and you need to be quick and precise because fast driving can cause another city car accident. Traffic is also in the asphalt city road. Firefighter truck moto bike, bus and car are also moving around the city.<br/>     An urban ambulance Simulator driver is a real modern hero and being an urban ambulance driver means you rescue citizens and public who are in danger. Remember your duty comes first! Drive ambulance to save injured citizens in highway road accident and combat situation. Doing some speed driving in this extreme ambulance rescue game is pretty epic and dangerous .Helicopter ambulance are also available at the rescue office Heli can also use in extreme condition like due to bad weather and mountain or hilly area and either a tourist stuck on the top of mountain .You need to get in your ambulance and drive the nearest town doctor to rescue the injured ones as fast as you can.Drive well in these extreme situations as the clock is ticking and lives are depending on you. Park your ambulance in hospital parking area and rush toward the hospital to rescue the life of public because  you love to do that.Suburban rescuer mission are in cities like Compton.<br/>Different mission different locations either a car accident location or crime location.You will just love it.<br/><br/>-Features:<br/>• Real Ambulance driving experience<br/>• Astonishing 3D Game-Play<br/>• Great game if you love rescue 911 games.<br/>• Different camera angles.<br/>• Real Suburban 3d Enviornment<br/>------------------------------------------<br/>Fun Entertainment and Learning all in one place!<br/>Like Us on Facebook:<br/>https://www.facebook.com/imagine.games.studio<br/>Follow Us on Twitter:<br/>https://twitter.com/imaginegames3d<br/>we will keep you updated!<br/>------------------------------------------", "metacritic": null, "released": "2015-12-01", "tba": false, "updated": "2019-10-22T14:25:43", "background_image": "https://media.rawg.io/media/screenshots/656/656f5581fb179f37c010f27926e0f0c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["RPG", "Simulation"], "publishers": ["Syed Shahzad"], "esrb_rating": null}