{"id": 73546, "slug": "crazy-pet-horse-truck-drive-free-play-animal-trans", "name": "Crazy Pet Horse Truck Drive: Free Play Animal Transport Game", "name_original": "Crazy Pet Horse Truck Drive: Free Play Animal Transport Game", "description": "So Much in one Bundle,<br/>Horse, Cow boy, truck ... Drive Truck to transport Horse, Have a real experience of cow boy simulator to train horse and load them in truck, race truck in mountain offroad hills and rally through villages and farms, this free game is will give you fun and entertainment which others cannot.Get ready for a crazy ride on euro truck<br/><br/>If you dream to own a real life horse ride it around, train it &amp; take it for race you need to transport it, all these elements will take you in the world of immense animal handling experience. try it to feel it.Drive &amp; Transport animal on 3d truck.Horse training is also done by police to train their police horse . Police horse is also used to rescue civilians .Euro animal transport truck driver give you the chance to become the real trucker. Horse Stunts is common in horse racing game so take the controls in your hand, don’t let the animal get wild till you reach near the truck.<br/><br/>You may have the experience to use horse to train to transport it by truck or use carriage to load cargo and passengers, to use in farms to transport animals but this horse game is a haven which will be a very different world then all others. it a simulation of horse training and transportation and driving simulation with very accurate controls.<br/><br/>Game Features:<br/>-Realistic Environment<br/>-Stunning High Quality Graphics <br/>-Third Person Human Role Game Play<br/>- Real Experience of Driving the Euro Truck Driving, Parking and Transport <br/>-Horse Transport by Cow Boy<br/>-Truck Controls and Multiple views", "metacritic": null, "released": "2016-02-22", "tba": false, "updated": "2019-10-22T14:24:32", "background_image": "https://media.rawg.io/media/screenshots/362/3621dd3aa15f59fc7dcf0036bb7843b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Adventure", "Simulation"], "publishers": ["Syed Shahzad"], "esrb_rating": null}