{"id": 73541, "slug": "tuk-tuk-auto-rickshaw-taxi-driver-3d-simulator-cra", "name": "Tuk Tuk Auto Rickshaw Taxi Driver 3D Simulator: Crazy Driving in City Rush", "name_original": "Tuk Tuk Auto Rickshaw Taxi Driver 3D Simulator: Crazy Driving in City Rush", "description": "Get your tuk tuk rickshaw on road and do taxi driver job to pick and drop passengers. Grab the opportunity to ride a three wheeler and enjoy the best tuk tuk rikshaw game in huge 3D city. Become a crazy rickshaw driver &amp; drive around streets day and night to earn taxi fare. Let it be rain or cold foggy night of winter, just sit behind steering wheel of beautiful tuk tuk and ride along modern city streets.<br/><br/><br/>Key Features of Tuk Tuk Rickshaw Taxi Driver 3D Game:<br/>10 highly enjoyable tuk tuk driving missions <br/>Multiple rickshaws to ride in your favorite colors<br/>Enjoy dashboard view of auto rickshaw while driving<br/>Different weathers like rainy, sunny and foggy<br/>Day and Night Mode with intelligent traffic system<br/>Realistic 3D city locations with multi parking spots<br/>Flawless controls without any lags<br/>Immersive sounds and typical rickshaw horn<br/><br/><br/>Tuk tuk simulator gives you the best chance to experience autorickshaw ride. Become a cab driver to earn money and have fun driving in city. Pickup passengers and drive them to hill station in tuktuk simulator game. Go speed driving and rickshaw drifting around tricky road turns. Rickshaw driver duty is not easy as it requires professional biker skills as well as reckless driving insights. Unlike bus coach driver, an auto driver have to be super fast to drop passengers on destinations before deadline.<br/><br/><br/>Tuk tuk auto rickshaw is the most famous mode of transportation in asian countries. Now you get to drive tuktuk rickshaw across europe. Pick and drop civilians on their desired parking spots. Drive in city traffic and avoid crashing into cars or other vehicles. When you get bored by playing transporter truck games start your tuk tuk and ride free in town. Try rickshaw drifting and stunt riding in big city. Complete rickshaw driving missions before deadline and enjoy challenging gameplay with increasing difficulty in different levels. Download Tuk Tuk Rickshaw Taxi Driver 3D simulator game for immense drift &amp; fun driving and endless adventures.<br/><br/><br/>We hope you enjoy our auto rickshaw simulator game and do not forget to give us your feedback!", "metacritic": null, "released": "2016-07-28", "tba": false, "updated": "2019-10-22T14:05:31", "background_image": "https://media.rawg.io/media/screenshots/229/229cd5afc6097c03443aca26cf09be47_T34Q9Qp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Simulation", "Racing"], "publishers": ["Syed Shahzad"], "esrb_rating": null}