{"id": 735573, "slug": "hi-res-brazil", "name": "Hi-Res Brazil", "name_original": "Hi-Res Brazil", "description": "<p>This software was designed and implemented for the term paper of a bachelor degree in Digital Technologies by the University of Caxias do Sul (UCS).\r\n</p>\n<p>Institution's website: https://www.ucs.br/\r\n</p>\n<p>THE GAME\r\n</p>\n<p>Live four days in the life of Rubens, a middle-class family man living in São Paulo in 1981. The game offers a narrative to engage the user into exploring the social-political ambient of the time.</p>\n<p>The game utilizes a interactive fiction-based interaction, and there's no way to lose it. It's more like a serious games, or edutainment product. Mostly intended for people interested in the Military Regime-era of Brazilian politics.\r\n</p>\n<p>VERSIONS\r\n</p>\n<p>The game is available in both Brazilian (Portuguese) and International (English) versions.\r\n</p>\n<p>DISCLAIMER\r\n</p>\n<p>I'm used to define a deadline in my games for them to enter into the public domain, for cases where the copyright lengths are too extensive (which is the case in most of the world). But in this case, I can't do this, because the autorship of the software is shared between me and UCS.\r\n</p>\n<p>I will continue to do this in future games where I have the sole autorship, or when I am able to persuade the rest of the team to do so.\r\n</p>\n<p>QUALITY ASSURANCE\r\n</p>\n<p>Please, note that there's a lot of text in the game, and during development, I had to correct a lot of bugs and mispelling errors on both the English and Portuguese versions.\r\n</p>\n<p>So please, if you find any errors during the execution of the program, or in the present text. Report it here, so I can update the software in the future.\r\n</p>", "metacritic": null, "released": "2022-02-05", "tba": false, "updated": "2022-02-07T06:24:41", "background_image": "https://media.rawg.io/media/screenshots/cf4/cf4814a23f4ab958d870d0511069293d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pedro Henrique Baretta"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}