{"id": 73557, "slug": "planet-of-cubes-survival-games", "name": "Planet of Cubes Survival Games", "name_original": "Planet of Cubes Survival Games", "description": "Welcome to Planet of Cubes Survival Games - the ONLY SURVIVAL Real Time Mmo Multiplayer block building game with thousands of players online in the MASSIVE open world made of cubes and blocks. Planet of Cubes is a FREE game for the whole family: adults and kids, boys and girls! Download and play it now!<br/><br/>EXCITED GAME FEATURES:<br/>- Find and mine resources like coal, gold, diamonds and more. Dig, destroy and mine blocks. <br/>- Craft various tools, block craft, and create different blocks, items and food.<br/>- Master weapons, armor and shooting weapon to survive in the battles with other players and mobs to win the battle wars. <br/>- Create your own team and build your base with friends to survive and protect yourself from monsters like zombies and spiders, creepers and skeletons, army of hostile players and fighting teams. <br/>- Brew potions to progress faster. Obtain cool effects.<br/>- Grow plants, breed animals, and block craft for building your own live farm! <br/>- Meet friends from all over the multiplayer block world and add them to the Friend List.<br/>- Chat globally with players around you or start private chats with your friends only. Teleport to any friend instantly using scrolls. <br/>- A huge selection of blocks and texture packs will make your game even more fun. Start building with a few blocks, and then build and block craft your huge block world in Creative or Survival Mmo FREE Games.<br/>- Rent your own areas (CHUNKS) of this beautiful Planet to save your buildings. <br/>- Cities and megalopolis, houses and kingdoms, skycrapers and pixel art and more excited places are waiting for your exploration on the open multiplayer block world. <br/>- Make mini online games like parkour, pvp, pixelmon, hide and seek, deathmatch and more. <br/>- Customize your character by selecting your unique skin from 160+ available skins inside 7 themed skin packs. <br/><br/>Planet of Cubes FREE Games gives you infinite number of possibilities and endless potential for all your survival craft and creative building needs in the global multiplayer online games. Do anything and everything according your imagination. Download and play it now!<br/><br/>YOUTUBE: https://www.youtube.com/channel/UCQkcxVUVdLoFTlfWKwz6ORA <br/>COMMUNITY: http://poc.solverlabs.com/<br/>FORUM: http://poc.solverlabs.com/forum<br/>FACEBOOK: https://www.facebook.com/planetofcubes/<br/>TWITTER: https://twitter.com/PoC_Game<br/>INSTAGRAM: https://www.instagram.com/planet_of_cubes_online/", "metacritic": null, "released": "2016-06-25", "tba": false, "updated": "2023-02-18T23:50:44", "background_image": "https://media.rawg.io/media/screenshots/776/776e8b4f40497d66d3627e1d008582dc.jpg", "website": "http://poc.solverlabs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 2, "platforms": ["macOS"], "developers": ["SolverLabs"], "genres": ["Adventure", "Simulation"], "publishers": ["SolverLabs"], "esrb_rating": "Everyone 10+"}