{"id": 73564, "slug": "pacific-shark-fish-hunter-2016-free-play-predator-", "name": "Pacific Shark Fish Hunter 2016: Free Play Predator Shooting Game", "name_original": "Pacific Shark Fish Hunter 2016: Free Play Predator Shooting Game", "description": "Hungry Shark Fish Hunter 2016<br/>This Game is all about killer shark hunting mission, rage war on great white sharks, shoot them and don't let them touch your boat.<br/> Evolution of Shooting killer shark and other ocean predators is here. This free game is focused on deep sea creature hunt, you don't need scuba tools, neither any fishing equipment, your vendetta is with Hungry White Shark, these Wild &amp; Angry Ocean Predator have Razor sharp teeth &amp; Super Hot Speed, it simulate the action shooting game play and make you feel like super hero.  <br/>You are stranded on a empty island and your rescue is only ship and water is filled with angry hungry white sharks and predator of many types.<br/>No Police or any other rescue squad is present at that island, and sharks are swarming the western coast, no guards are here to save you, pick you gun choose your favorite weapon and fire, shoot and kill the Great White Sharks As much As you can.<br/><br/>&gt; Sweep area clean of Angry Sharks<br/>&gt; Shoot them and Kill<br/>&gt; Use Your Weapon Accurately<br/>&gt; Your Boat is moving<br/><br/>This Action game is perfect shooting for hungry shark attack  related adventure, it contains shooting, killing, demolishing of sharks who wants to bite your skin off.<br/><br/> Hungry Shark Fish Hunter 2016 Deep Ocean- Game Features <br/>- Live life of Army Assassin Hero Ocean! <br/>- Earn Point, Make High Score in limited Time.<br/>- Drive around in the 3d kingdoms like ocean &amp; Island<br/>- Become the best Solider to protect shores of your sea &amp; Islands!<br/>- It will Train you as Pro First Person Shooter <br/>- Mini Machine Gun rounds to fire<br/>- FREE download , Have Fun<br/>- No WiFi No Problem!<br/>- Shoot &amp; Kill<br/>* Free Play Simulation Game - Contain Ads *", "metacritic": null, "released": "2016-05-24", "tba": false, "updated": "2019-10-22T14:05:30", "background_image": "https://media.rawg.io/media/screenshots/7c8/7c8aa377c0a41c9f718f959e5bd99c9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Shahzad"], "genres": ["Action", "Adventure"], "publishers": ["Syed Shahzad"], "esrb_rating": null}