{"id": 735646, "slug": "twitter-wars-test", "name": "Twitter Wars Test", "name_original": "Twitter Wars Test", "description": "<p>¿Eres asiduo de debates en <strong>Twitter Spaces</strong>?, ¿Estás buscando un juego desafiante, dinámico y divertido? ¡No busque más!</p>\n<p><strong>Twitter Wars Test </strong>es un juego de preguntas de opción múltiple con temática salseística. Tu puntuación obtenida marcará el trascurso de la historia.</p>\n<p>¿Cuánto sabes del <strong>Green-Verso? </strong>Mide tu capacidad intelectual con este test. Más de 70 preguntas con 4 finales distintos te esperan.<br/></p>\n<p>La historia de este juego contiene los principales personajes del Green-Verso, tales como Green Thing, LaserLent o Tokarev.<br/></p>\n<p><strong>Controles</strong>:</p>\n<ul><li>Ratón izquierdo</li></ul>\n<p><strong>Advertencia</strong>: Twitter Wars Test está destinado únicamente para fines de entretenimiento.  Las opiniones vertidas en este videojuego no necesariamente reflejan o representan los  puntos de vista y opiniones de ToboGang Studios®. Este videojuego ha sido identificado como potencialmente perjudicial por desencadenar convulsiones en personas con tendencia a sufrir crisis epilépticas.  Este videojuego puede contener trazas de humor negro, la empresa desarrolladora no se hace responsable de las posibles ofensas que pueda causar.</p>\r\nAviso: Para que funcione el archivo de guardado hay que descomprimir el archivo .zip<br/><br/>\n<p>Royalty free music from zapsplat.com</p>", "metacritic": null, "released": "2022-02-05", "tba": false, "updated": "2022-02-07T06:41:29", "background_image": "https://media.rawg.io/media/screenshots/da1/da14c89a6669d6400adbf1401a03ce7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["ToboGang Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}