{"id": 73571, "slug": "slendermans-forest", "name": "SlenderMan's Forest", "name_original": "SlenderMan's Forest", "description": "Introducing SlenderMan's Forest<br/>The most TERRIFYING Slender Man experience on the App Store! <br/><br/>Collect all the pages to escape from the Slender Man! Can you do it before the Slender Man gets you? <br/><br/>We'd like to thank our fans for the continuous support. We hope new players will love this as much as them.<br/><br/>Check out our awesome game!<br/>Our fans say that our Original Map is THE CLOSEST YOU CAN GET TO THE COMPUTER VERSION!! Check out our NEW daylight Village Map!<br/><br/>Features:<br/>CURRENCY SYSTEM: Buy upgrades and power-ups to beat Slender Man!<br/>ENERGY SYSTEM: Your energy is used up when you look at Slender Man!<br/>FACECAM RECORDING: Record your face for some awesome commentary!<br/>NEW MAP: The Warehouse is an indoor map, with Slender Man at every corner!<br/>ACHIEVEMENTS &amp; LEADERBOARDS: Try to be the top player and show off to your friends!<br/>RECORD AND SHARE YOUR GAMEPLAY! Show off to your friends how good you are!<br/>Watch other players' gameplay and learn their secret strategies!<br/>Day and Night mode Maps!<br/>Different types of terrain!<br/>Very responsive controls with layout options!<br/>Flashlight control; Switch between Short, Long distances and Off!<br/>Maps with different difficulties for those who think they can beat the Slender Man!<br/><br/>Here are some players' quotes:<br/><br/>\"really builds u up and gets u to jump. so frickin awesome :)\"<br/>\"This best slender man game on smart phone\"<br/>\"Best game I ever spent money on I love it\"<br/>\"This game is fun and scary! Worth every penny! I do recommend it! \"<br/>\"It's an awesome game with the new update\"<br/>\"Wow. The new update blew me away!! Keep doing what ur doing cause its great\"<br/>\"This is one of the closest I've seen to the PC Slender 8 Pages game. Good graphics and very creepy sounds. If your looking for a good scare and your a Slender fan, this is one worth getting. Looking forward to further updates.\"<br/>\"Scary Good Fun!\"<br/>\"There is a 6th page I found all 6.this is a great game and I think it's closest to the computer\"", "metacritic": null, "released": "2012-11-26", "tba": false, "updated": "2021-01-25T03:17:52", "background_image": "https://media.rawg.io/media/screenshots/7f2/7f28483c18f9de2bae72d991960402aa.jpg", "website": "http://fb.com/odysbros", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netquest"], "genres": ["Action", "Adventure"], "publishers": ["Cyberopsis Webdata"], "esrb_rating": null}