{"id": 73577, "slug": "hillside-racing", "name": "Hillside Racing", "name_original": "Hillside Racing", "description": "!!! CYBER MONDAY Sale: 100% OFF !!!<br/><br/>How far can you drive across the Hills?<br/><br/>Hillside Racing is physics based car racing game. Start with Jeep car, drive dangerous hills and collect coins. Use collected coins to buy new cars and upgrade them. Better upgrades allow you to drive far and far away and collect even more coins. <br/><br/>Select your favorite driver for the race. Every driver has unique characteristics which impact the driving physics and your records. <br/><br/>Use Random Track to train your skills and collect more coins for your unlocks and upgrades. Random Track is divided into levels each 475m each. You will earn 2000 coins for completing every new level on this track. <br/><br/><br/>Get bonus coins for flips and back flips of your car – but watch out your neck! If you break it – your ride will be abruptly over! <br/><br/>Features:<br/><br/>- Random track which changes every time you start a new race!<br/>- 6 different drivers with unique characteristics of weight and height!<br/>- 6 different vehicles with unique upgrades and characteristics: Jeep, Armored, Ghost Rider, Racing Bike, Tractor, Space Shark!<br/>- 5 different tracks: Green, Random, Ice, Desert, City<br/>- Upgradeable parts include engine, suspension, tires and 4WD<br/>- Cool graphics and smooth physics simulation", "metacritic": null, "released": "2014-05-28", "tba": false, "updated": "2019-07-29T17:46:36", "background_image": "https://media.rawg.io/media/screenshots/70b/70bdf6f34520126645048f1d856349d4.jpg", "website": "http://solverlabs.com/index.php?id=422", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SolverLabs"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["SolverLabs"], "esrb_rating": null}