{"id": 73573, "slug": "high-school-boy-virtual-sim", "name": "High School Boy: Virtual Sim", "name_original": "High School Boy: Virtual Sim", "description": "This game revolves around troubled story of high school dropout bully boy Gary whose sole purpose is to bully the other naughty students and his class fellows, Gary proves himself to be incredibly evil, manipulative to other students and teachers, and highly intelligent, being a bad bully boy he constantly reminds other bully kids of his arrogance and vanity. This game is not about shooting or fighting but its a fun game full of adventure where you will be an interesting bully gangster in your high school and you will break all the rules of the discipline! Your mission is to behave like a bad boy bully in this high school gangster game, survive and escape through hard time missions. Fight and strike slender students and security guards to bully in cafeteria and college hallway. Sneak into the principal office stealing important confidential notes and survive your time locked in detention, sneaking from creepy teachers and authorities.<br/>High school Boy is a third person bad boy bully game where a troubled psychopath teenager is entered into the school life to enjoy humiliating other high school students and teachers. You as a third person player; Gary, has to face the bullies of the school and save his friend from beating, throw rocks and papers, don’t seek too much attention to yourself and stop anyone from complaining to the principal about your secret hunts of the crazy adventure in this gangster high school game. You have been caught into the detention as punishment for your disciplinary actions, sneak and escape from the office while the teacher is sleeping, destroying the cameras of the campus to erase any footage of your crime recordings. Be the vicious criminal in high school and get ready for some great fun of your life by bullying kids in high school.<br/><br/><br/>Features:<br/>• Includes the complete high school gangster story with extra missions, characters, hall monitors, teachers and classroom with fellow students to bully in Game.<br/>• Gorgeous graphics: high-resolution textures, dynamic lighting, shadows and particle effects<br/>• Challenge your friends to see who gets to bully the high school students more while competing with mission accomplishment.<br/>• Intelligent touch controls with contextual buttons only when you need them.<br/>• Rescue the grand combat against city high school security guards &amp; student gang wings.<br/>• Create chaos in cafeteria, fight with security guards and students.<br/>• Awesome classroom fever starts in high school fever by sneaking from teacher.", "metacritic": null, "released": "2018-06-12", "tba": false, "updated": "2019-07-29T17:10:52", "background_image": "https://media.rawg.io/media/screenshots/44a/44a73d2e811987c1ed3b47b6819f8fc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["muhammadnabeel khan"], "genres": ["Action", "Simulation"], "publishers": ["muhammadnabeel khan"], "esrb_rating": null}