{"id": 73583, "slug": "troll-face-quest-unlucky", "name": "Troll Face Quest Unlucky", "name_original": "Troll Face Quest Unlucky", "description": "After Troll Face Quest we are back again with Troll Face Quest (13) Unlucky ! <br/>If you are found of memes, emojis and trollolo stuff you are at the ridiculous right place.<br/>Try to solve funny puzzles at every level in this cool point and click game.<br/><br/>Get the troll attitude<br/>Do you question games with happy endings? Do you think there's nothing more hilarious than a stupid accident or a prank gone wrong? Good. Because this is an adventure in top-notch trolling. Lovers of free escape games with lots of levels will revel in this twisted take on the genre, where you lure a series of dastardly and deserving characters to unfortunate fates...creating laughs for everyone else.<br/><br/>Each level brings a new Unlucky Trollface, who you're going to help steer into one accident after another with a few well-planned clicks (as few clicks as possible). It's a brain teaser full of slapstick jokes, an insta-memes app that sets you off on a quest of epic trolldom. <br/><br/>Trollface is already a popular series of internet memes and online point-and-click games with black and brown art and even blacker humor—without any excess or realistic violence. It's the perfect (Molotroll) cocktail of a puzzle game, escape game, prank session, meme machine, and point-and-click-adventure. And now you can land some extra levels by downloading the smartphone or tablet app.<br/>May the troll face be with you<br/><br/><br/>COOL FEATURES <br/>* 35 amazing levels<br/>* 2 extra secret levels (that's not a secret anymore)<br/>* Simple intuitive point and click gameplay", "metacritic": null, "released": "2015-06-11", "tba": false, "updated": "2023-03-15T21:24:55", "background_image": "https://media.rawg.io/media/screenshots/c99/c9913e0ffb1d0f7a3660fc65c0552f05.jpg", "website": "http://www.spilgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["SPIL GAMES"], "genres": ["Adventure", "Puzzle"], "publishers": ["SPIL Games"], "esrb_rating": "Teen"}