{"id": 735874, "slug": "lets-surf", "name": "Let's Surf", "name_original": "Let's Surf", "description": "Microsoft Edge's <em>Let's Surf</em>\n\n<p>The <em>Let's Surf</em> game from edge://surf\r\n</p>\n\n\n<p>Inspired by the classic Windows game SkiFree, the surf game challenges players to ride through the water while avoiding islands, fellow surfers, and other obstacles. Watch out for the kraken! Players can also collect hearts to extend their lives and boosts for a burst of speed. Surf as far as possible in an endless ocean, compete for the shortest time, or zig zag through as many gates as you can in a row. With three distinct game modes, players have a variety of ways to pass the time.\r\n</p>\n<p>To catch the wave, simply navigate to edge://surf in the address bar. If you are not connected to the internet, Microsoft Edge will also provide a handy link to the game to help you pass the time.\r\n</p>\n\n\n<p>An early version of the surf game originally debuted in November as part of a special Easter Egg. Insiders followed a series of cryptic hints and puzzles in the run-up to Microsoft Ignite 2019 which eventually led them to unlock the hidden surf game using Collections. Upon reaching the end of the game, Insiders were treated to the world’s first look at the new icon for Microsoft Edge—two days before the official reveal.\r\n</p>\n<p>Upon the conclusion of the Easter Egg, the number one request from Insiders was to turn the surfing game into an endless runner as the permanent “offline game” for Microsoft Edge. The team took this feedback to heart and has spent the last few months polishing edge://surf and adding new gameplay features and improvements, including support for accessibility features like high contrast, screen readers, and even the Xbox Adaptive Controller. Here’s a look at what’s included:\r\n</p>\r\nLet’s surf: Endless mode\r\n<p>Surf as far as you can while avoiding obstacles and the kraken. You can switch modes via the game settings menu.\r\n</p>\r\nTime trial mode\r\n<p>Reach the end of the course as fast as you can! Collect coins to help you achieve an even shorter time. The course is always the same—can you find the shortest possible route? You can switch modes via the game settings menu.\r\n</p>\r\nZig zag mode\r\n<p>Surf through as many gates as you can in a row! Your streak will reset if you miss a gate, but you can keep playing until your lives run out. You can switch modes via the game settings menu.\r\n</p>\r\nPlay with keyboard, mouse, touch, or gamepad\r\n<p>Play your way with support for keyboard, mouse, touch, and gamepads, including Xbox, PlayStation, Switch Pro, and the Xbox Adaptive Controller. The game also supports gamepad haptic feedback (rumble) for a more immersive experience. Instructions for how to play, including the controls for each input method, can be found in the game’s settings menu.\r\n</p>\r\nPersonal high scores\r\n<p>Each game mode keeps a record of your high score, and you’ll see a notification every time you set a new record. You can also reset your stats from the game settings menu.\r\n</p>\r\n\r\n\r\nHigh visibility mode\r\n<p>High visibility mode (accessible via the game settings menu) highlights the hit boxes around objects, making it easier to identify and avoid obstacles in the water.\r\n</p>\r\nReduced speed mode\r\n<p>For users who prefer a more relaxed pace or need extra time to pull off those surfing moves, they can enable the new reduced speed mode (accessible via the game settings menu) to slow down the speed of the game.\r\n</p>\r\nAnd much more!\r\n<p>The final release of edge://surf has many changes based directly on user feedback from the Easter Egg version, including an enhanced user experience, numerous gameplay improvements (such as smarter enemy logic) and bug fixes, and much more. Who knows? There might even be a few secrets just waiting to be found.\r\n</p>\n<p>Thanks to the incredible community that made this possible. Happy surfing!\r\n</p>\n<p>– William Devereux, Senior Program Manager, Microsoft Edge\r\n</p>", "metacritic": null, "released": "2022-02-04", "tba": false, "updated": "2022-02-07T07:33:27", "background_image": "https://media.rawg.io/media/screenshots/554/55498ec25630ca56268ac1ec2993af26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Anthony van Tonder"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}