{"id": 735987, "slug": "pico-karts", "name": "Pico Karts", "name_original": "Pico Karts", "description": "<p>Pico Karts is a pseudo-3D racing game, modelled after the style of Outrun or Hang-On! This started from an experiment to produce a pseudo-3D scrolling road, and was gradually built up from that concept to a complete game. While I'm sure there are plenty of things I could add or improve, I'm happy to ship this little project and move on to the next thing :)</p>\r\nControls:\r\n<p><strong>Left/Right Arrow Keys:</strong> Steering<br/><strong>Down Arrow Key:</strong> Brake <br/><strong>Z:</strong> Accelerate <br/><strong>X:</strong> Boost (when boost meter is full)</p>\n<p>The boost meter fills up as you drive, and is reset any time you hit an object or drive off the road.\r\n</p>\n<p>If you'd prefer to switch the colour alignment between the road and the sides of the road, press X at the title screen (this may reduce eye strain for some people).\r\n</p>\r\nCourses:\r\n<p><strong>Easy:</strong> Gentle curves in the sunny morning. Other drivers maintain a consistent course, and the time limit is generous. </p>\n<p><strong>Medium:</strong> Desert dunes at dusk. Some tight corners, and some other drivers will swerve across the road. A moderate challenge with some room for error. </p>\n<p><strong>Hard:</strong> A metropolis at night. Frequent tight turns, erratically swerving drivers, and a brutal time limit with little room for error. A serious challenge.\r\n</p>\n<p>I'd love to see your top times!\r\n</p>", "metacritic": null, "released": "2022-02-04", "tba": false, "updated": "2022-02-07T07:59:17", "background_image": "https://media.rawg.io/media/screenshots/03d/03df1e9adaadbb185e66a5412efa8bb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Soundole"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}