{"id": 73590, "slug": "troll-face-quest-classic", "name": "Troll Face Quest Classic", "name_original": "Troll Face Quest Classic", "description": "Return to your troll roots to discover familiar yet fresh silly-stupid challenges with hilarious nonsensical outcomes. No logic required to solve the maddest and wackiest 2D point-and-click puzzles. Troll Face Quest Classic combines and refreshes some of the very best levels of the immensely popular series for a great laugh at the weirdest and wildest moments.  The quick and quirky brainteasers will have you laugh your way through hilarious jokes and pranks with a fresh and funny twist.<br/><br/>Hilarious!<br/>Explore more than 30 infamous levels to test and tease your way out of unexpected trolling troubles. Get lucky (or unlucky) with the funniest escapes you can play on- or offline - no wifi needed.  Release those LOLs to discover more of your favorites in the best trials…all for your well-deserved comic relief! <br/><br/>Fab Features: <br/>- Solve 30+ hilariously illogical puzzles!<br/>- Delirious whacky characters with a comic-cool edge! <br/>- Unexpected hilarious situations!<br/>- One of a kind art style <br/>- Playable offline!<br/><br/>There’s more! <br/>All of the trolling that you’ll find in this game will provide you with a brain workout too…including loads of laughter along the journey. Troll Face isn’t pulling any punches but he sure does pull your leg as he manage to fool his foes and chase away the blues.<br/>Find out if you can escape, win or be trolled? Get punk’d or pranked by some freakishly funny situations for an umpteenth time. Or simply never give up and beat Troll Face at his own game now.", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2023-09-05T22:37:13", "background_image": "https://media.rawg.io/media/screenshots/5c3/5c3967578e3581f90d07c8ddf9d261cc.jpg", "website": "http://www.spilgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["SPIL GAMES"], "genres": ["Adventure", "Puzzle"], "publishers": ["SPIL Games"], "esrb_rating": "Teen"}