{"id": 73607, "slug": "troll-face-quest-video-games-2", "name": "Troll Face Quest Video Games 2", "name_original": "Troll Face Quest Video Games 2", "description": "The devious pranksters are back at it again with an all new trolling nightmare: Troll Face Quest Video Games 2! Spoof iconic video games and prank the pants off all those characters. Get lost in a crazy world of video game shenanigans and try to escape the pranking trolls!<br/><br/>PHONE-SMASHING FEATURES<br/><br/>• 85+ million installs across the legendary Troll Face Quest franchise!<br/>• Troll  famous video games!<br/>• 35+ hilarious  levels of pranking insanity!<br/>• Unlock insane achievements!<br/>• Lots of wacky  collectibles!<br/>• No Wi-fi needed!<br/>• A funny trip through a loony video game world!<br/><br/>THE RETURN OF TROLL RAIDER<br/><br/>Get ready for a trolling adventure that’ll take you back to your intense video game playing days. Troll  adventurous, monkey-swinging babes in tight shorts, steal the wheels from an Italian plumber’s go-kart , prank entire cities under the rule of theft, murder, and mayhem   , and piss off birds for no good reason. Will you solve the crazy pranks and win a chicken dinner or will you end up in the loony bin? It’s payback time for all those levels you didn’t complete.<br/><br/>TROLLING TIME NEVER RUNS OUT<br/><br/>A whirlwind of trolls and pranks, this is another baffling game that will make you throw your cell phones against the wall. Keep your eye on the ball and crush the prankster video game characters before they troll you into the dirt!<br/><br/>Do you have the guts to prank your childhood video game stars into oblivion?", "metacritic": null, "released": "2018-02-27", "tba": false, "updated": "2019-07-29T17:08:40", "background_image": "https://media.rawg.io/media/screenshots/698/69895b9c5adb807d9d3bb72acad748b4.jpg", "website": "http://www.spilgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["SPIL GAMES"], "genres": ["RPG", "Puzzle"], "publishers": ["SPIL Games"], "esrb_rating": "Everyone 10+"}