{"id": 736180, "slug": "eterna", "name": "Eterna", "name_original": "Eterna", "description": "<p>RNAs are tiny molecules in the cells of every living thing. They copy information from DNA and use it to make things happen in the cell.</p>\n<p>Like DNA, RNA is made up of four bases. Each RNA folds into a shape that determines its function, and the shape is defined by the pattern of the bases.<br />\neterna problem-context transcribed RNA<br />\nThe RNA Design Problem</p>\n<p>RNA shapes can be simple, or very complex. But there’s a lot we don’t know about RNA. For example, if we want to design a RNA to fold into a specific shape or perform a certain function, it’s very difficult. Even supercomputers have a hard time with it.<br />\neterna problem-context RNA secondary structure<br />\nHow You Can Help</p>\n<p>Eterna allows players to design RNAs by solving puzzles. Each puzzle represents a target RNA shape or a set of design requirements. Players design the pattern of bases they think will best meet the requirements. Scientists then create the molecules the players have designed and test them in the lab. The lab results are returned to the players, who can use them to improve their designs.<br />\neterna problem-context solving eterna puzzle<br />\nA New Way Forward</p>\n<p>Eterna players have shown that they can beat supercomputers as well as research teams in designing new RNAs. Working together, players and researchers can find novel solutions, invent new medicines, and unravel the secrets of RNA.</p>", "metacritic": null, "released": "2020-07-07", "tba": false, "updated": "2022-02-07T20:41:57", "background_image": "https://media.rawg.io/media/screenshots/a02/a02ea77400f6a8d1ea8834e73336060b.jpg", "website": "https://eternagame.org/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}