{"id": 73629, "slug": "banana-island-epic-tale", "name": "Banana Island– Epic Tale", "name_original": "Banana Island– Epic Tale", "description": "The long awaited sequel of this epic side-scroller is finally here! Get * Banana Island Jungle Run * and help our little monkey friend Bobo save his girlfriend from evil baboon king! <br/><br/>Run and jump all the way through Banana Jungle Island and fight angry baboon minions to help Bobo in his jungle quest! Kick off your shoes and dash through the jungle of Banana Island!<br/><br/>* FEATURES *<br/>Never-ending parkour jungle adventure!<br/>Most stunning level design ever seen in platform games!<br/>Eye-popping cartoon characters!<br/>Crazy monkey enemies!<br/>Run, jump and swing on vines to collect coins!<br/>Buy additional lives and enjoy in never-ending free run!<br/><br/>* SIMPLE TAP CONTROLS *<br/>Power Jump - Tap to jump, Tap &amp; Hold for an extra long jump!<br/>Mega Glide - When in air, Tap &amp; Hold to glide through the clouds!<br/>Super Drop - When in air, slide down to drop faster and kill baboon enemies around you!<br/><br/>▶ Join our jungle party!<br/><br/>Prove you're an ultimate jungle ninja and join our jungle party! Banana frenzy is raging all over the world, get this monkey jump saga and let the jungle fever get to you! Jump, smash and keep running like hell to escape the monkey village and save your girl from an evil baboon king Kong!<br/><br/>▶ Run, monkey, run! <br/><br/>Despicable baboon king has kidnapped Bobo's girlfriend Lily and wishes to make her his jungle queen! Save her before it's too late! Enter the jungle survival, unlock new worlds, get a cool superhero mask and beat'em up in this jump n run quest!<br/><br/>▶ Monkey Kong saga continues! <br/><br/>Get * Banana Island Jungle Run * and you'll instantly get hooked on this fun jungle runner game! If you love to play parkour games and jumping and running games, this endless mega banana dash will become your favorite of all arcade animal games for kids! We guarantee you that this awesome 2D side scroller running game will give you an unforgettable bounty ride!<br/><br/>▶ Go on a wild jungle ride!<br/><br/>Help our monkey dash to blast his enemies in this super run and jump classic arcade game for children. Let's kick off a mega jumping and coin collecting mission on the jungle island! Get this parkour adventure and get ready for the gorilla revenge! Start racing towards the dark Temple and show what a jumper you are. <br/><br/>▶ Be the fastest runner! <br/><br/>Run, jump and dash through the jungle island, help our monkey swing on vines and be the fastest runner to save his beautiful girlfriend! Banana jungle hides many enemies with powerful weapons, jetpack powerups and other upgrades! Get on banana rush and enter the world of fast-paced 2D platform monkey racing and jumping games!", "metacritic": null, "released": "2016-04-27", "tba": false, "updated": "2019-10-22T14:40:12", "background_image": "https://media.rawg.io/media/screenshots/a10/a105ba346956e4aba0ea6d0193bc9cff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Freedom Games"], "genres": ["Racing", "Arcade"], "publishers": ["Freedom"], "esrb_rating": "Everyone 10+"}