{"id": 736246, "slug": "peniban-quest-sacrifice-to-domina", "name": "Peniban Quest: Sacrifice to Domina", "name_original": "Peniban Quest: Sacrifice to Domina", "description": "<p>[Story]</p>\n<p>An evil despot from an evil land has come, and she has brought ruin.<br />\nMen are succulent morsels for the sirens, women become beings of carnal lust.<br />\nThe world is sure to be engulfed in the white nebulum of Maramos.<br />\nAt the brink of despair, a lone hero rises.<br />\nGuided by a goddess, he embarks on his quest... of humiliating submission!</p>\n<ul>\n<li>100% mazo situations with NO REVERSAL!<br />\nThe hero&#39;s destiny is to get wrecked! Enemies wield strap-on dildos!<br />\nHis own beautiful party members ride his face and plumb his depths!<br />\nTake it, take it all, and defeat the evil Argadildo!  </li>\n</ul>\n<p>[System]</p>\n<p>Massive scale - 150 enemy types, 100 spells, and 250 items!!</p>\n<p>Challenging battles - no need to deliberately lose to see the fun,<br />\nyou&#39;re going to struggle to win over these brilliantly powerful ladies!</p>\n<p>Masochist &amp; sadist moves!<br />\nUse might, magic, c*ckrushes and tongue tactics!<br />\nNaturally, the sexy enemies use every dirty trick to dominate the hero.</p>\n<p>Voiced H scenes!</p>\n<p>Over 20 hours of play - from monster collecting to casino games,<br />\nthere&#39;s loads of built-in side content to keep you busy!</p>\n<p>Fast paced progress - gain XP 400% faster than the usual RPG!<br />\nNo grinding (except the kind you like). No weakness due to low level<br />\n(just weakness as a shonen dominated by hotties, you masochist!)</p>\n<p>More stuff I can&#39;t even fit in this description - visit the website!</p>", "metacritic": null, "released": "2015-05-01", "tba": false, "updated": "2022-02-09T16:15:51", "background_image": "https://media.rawg.io/media/screenshots/72a/72ae7a4cf48f4573b3537a7e6d5d8436.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["RPG"], "publishers": [], "esrb_rating": null}