{"id": 73627, "slug": "angel-or-devil", "name": "Angel or Devil+", "name_original": "Angel or Devil+", "description": "“Shall we date?: Angel or Devil+”, hereafter referred to as “the game”, is a novel type dating simulation game, depicting a romance between you (a player) and a hero (an angel, devil or reaper). The game is the first one among the series, which has been developed with Shojo (girls) Manga like illustrations that successfully make the game a romantic fantasy.<br/><br/>===Main features===<br/>- Play basic story  for FREE: A fantasy romance game set in current Japan; heroes are an angel, devil and reaper<br/>- Choose your favorite character: There are three men (characters) available in this game. You can choose among the three men to begin your romance.<br/>- Multiple-endings: The choices you make will determine how each story ends.<br/>- Beautiful still graphics: Check out the beautiful artwork by the Japanese illustrator. <br/>- Decorate your own avatar: More than 70 cute items available to choose from including seasonal outfit . The avatar feature is a great opportunity to show off your creativity!<br/>- The basic story plot is the same as the paid version \"Shall we date?: Angel or Devil\". <br/><br/>=== Story === <br/>The game depicts your (a player’s) 7 days with an angel, devil and reaper. The story started with a scene where you found yourself in bed at the hospital when you opened your eyes－you had been involved in a car accident. All of a sudden, three strange men appeared in front of you－the angel with shining wings; the demon with deep black wings who was smirking; the reaper with a scythe in his hand whose eyes were cold. They asked for your soul because you had only a few days left to live.<br/><br/>=== How to buy coins ===<br/>Once the tutorial is cleared, you will see a Menu button at the bottom of the page,<br/>Tap Menu &gt; then tap Buy Coin, here you can buy Coins that can be used for all in-app items.", "metacritic": null, "released": "2014-05-14", "tba": false, "updated": "2019-10-22T14:05:28", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1d6ca698754840a85c330d9dd57ca56.jpg", "website": "http://shallwedate.jp/en/free.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["NTT Solmare"], "genres": ["Adventure", "Simulation"], "publishers": ["NTT Solmare"], "esrb_rating": null}