{"id": 736392, "slug": "malyshka", "name": "Malyshka", "name_original": "Malyshka", "description": "Explore the village to your heart's content and meet its inhabitants: from kindly priests to eccentric toy collectors, the community is full of endearing characters to help you on your journey. Engage in their quests to retrieve the mysterious dolls, unearthing the enigma of your lost memories as you help the people of Tikyihavoda with their daily woes. Between puzzles, conferring, errands, and hunts, it all starts to come back to you...your wistful feelings may hold more water than you think.<br/><br/><ul><li>Explore<br/></li><li>Investigate<br/></li><li>Throw snowballs<br/></li><li>Chase bunnies<br/></li><li>Uncover the truth</li></ul><br/>Malyshka is created by fifteen hardworking individuals under the R.A.T. Room collective. Comprised almost entirely of high schoolers, this team dedicated itself to the development of a humble but charming game. Story, art, writing, coding, voice acting, and beyond were shared among its members within the close community that formed over the course of its production. Fifteen art styles, fifteen creative visions, and fifteen minds all come together; overall, Malyshka is a labor of love, and a testament to youthful passion and the desire to grow and create.<br/><br/><br/>The R.A.T. (Really Artistically Talented) Room can be summarized by our group motto: “No think. Wing it.” As a collective, we work in collaboration to create animations, digital art, and video game projects. Our most recent game, titled Malyshka, displays the combined effort of about fifteen individuals who created all of the assets, story, dialogue, music, and programming. We are students, but we create as professionals. We have been able to foster a community full of diversity, inclusion, and creativity through our shared work and learning. Also, our grind doesn’t end when we leave the studio, everyone who is involved is constantly working hard to see our visions through to the end. At our core, the R.A.T. Room operates as a single unit. No one person is responsible for the work, we are a community co-op that is passionate about art and creativity.", "metacritic": null, "released": "2022-02-09", "tba": false, "updated": "2022-02-11T04:04:49", "background_image": "https://media.rawg.io/media/screenshots/1d6/1d6d8527aa00baa7537afb97c4143be3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["R.A.T. Room Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["R.A.T. Room Games"], "esrb_rating": null}