{"id": 736359, "slug": "xi-you-zhan-qi-west-journey-war", "name": "西游戰棋（West Journey War）", "name_original": "西游戰棋（West Journey War）", "description": "【Story】<br/><br/>It’s an age-old folk tale. In ancient times, Nuwa repaired the sky with five-colored stones and used the turtle bones to support the sky.<br/><br/>As time goes by, the five-colored stone and the turtle bone absorbed the spirit of heaven and earth and turned into two monsters: Monkey King and Bai Jingjing. However, they rushed out of the trap and broke into the human world. With these two powerful monsters escaping, the heaven and earth faced a significantly catastrophe again.<br/><br/>Monkey King’s identity was discovered by a few gods and Buddhas on the way to the West accompanying Tang Monk. After that, the gods made a plan for him, they decided to arrest Monkey King and Bai Jingjing together after the Journey to the West and repair the sky again to defuse this disaster. After experiencing a lot on the way to the West, Monkey King realized that he was the source of the havoc to the heaven and earth. The responsibility prompted him to sacrifice himself after completing all these tasks and become a stone to mend the sky.<br/><br/>On the eve of the apocalypse, after all the monsters know that the apocalypse is coming, they start to enjoy the final madness...<br/><br/>West Journey War is a turn-based card game inspired by the classic Chinese story Journey to the West. As you explore the twists and turns in this journey, you will build a team with the mythical heroes to tackle enemies that stand in your way! The low-poly art style, 4x4 chessboard positional combat, and more than 50 heroes guarantee a refreshing gaming experience.<br/><br/>【Feature】<h3>Cute &amp; Simple Art Style</h3>From the beautiful Mount Huaguo to the dreamlike underwater Dragon Palace, from the rough Yellow Wind Ridge to the glorious Imperial City of the Great Tang Dynasty, West Journey War presents a charming visual depiction of the mythical world while keeping it simple for the gameplay.<h3>Unique Combat System to Test Your Strategies</h3>Customize your decks, build your best team, and strategize your moves on the board to take on any challenge in this unique fusion of card-play and tactical, positional combat!<h3>Refreshing Gaming Experience</h3>Challenging combat together with a gripping story and a variety of characters: It’s time to dive into this whimsical world inspired by Journey to the West!", "metacritic": null, "released": "2022-02-08", "tba": false, "updated": "2022-02-11T03:42:28", "background_image": "https://media.rawg.io/media/screenshots/8e8/8e8ad82e0cc88f4937be48d901ea3414.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZMEI Studio"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["ZMEI Studio"], "esrb_rating": null}