{"id": 736336, "slug": "metax", "name": "MetaX", "name_original": "MetaX", "description": "Civilization has evolved into the MetaX era. All things reside in the meta universe in the form of \"chain\", which is true and illusory.<br/>MetaX  is woven with growing game units with different playing methods. Each game unit has its own rules and characteristics, and affects each other at the same time.<br/>Freely switch the attributes of the game unit chain (public chain and private chain, called big universe and small universe) to temporarily escape the shackles of the chain square<br/>The behavior of each game unit (hero shaping, monster killing, acquisition of tasks, props, gold coins, points and experience) in the MetaX  will be perceived by other game units through the \"chain workshop\". Don't ignore any opportunities.<br/>You are the chain master!<br/>Play scenario Display:<br/>For example, the demons killed in the soul eating tower will be reshaped as soul girls through the \"chain soul\" and appear in the land of forgetting to become an inseparable partner.<br/>For another example, a squirrel forgotten by Agra meets the fire phoenix in new island, forms a soul contract, and carries out an adventure to protect the Phoenix's eggs. The reason for all this is the boundary broken during the dungeon exploration.<br/>For another example, Zhizhi came to the jumping club from an unknown handyman in the machinery City to win the Parkour champion, and this honor unlocked the sliding shovel skill in the big escape game.<br/>Another example is that the gold coins of different game units will be affected by the fluctuation of \"Yuan rate\". Grasp the real machine and make a big fortune. After all, \"Yuan\" is a good thing!<br/>Currently open game units (in no order):<br/>[Booty Bay] <br/>How to survive on this island ruled by skeleton pirates? No, I'm going to cut down trees and build a house<br/>Unit features:<br/>Survival adventure games, collecting plants, cutting trees and mining, building castles, and creating all kinds of survival equipment and weapons.<br/><br/>[Soul of Fighter]<br/>Use flexible fighting techniques to defeat demons.<br/>Unit features:<br/>This is a 3D game of close combat<br/>The core feature is the unlimited combo + execution system<br/>Fist to flesh, close combat, assassination, capture, pursue the original fighting art<br/>[Endless runner]<br/>Zhizhi was originally a small handyman, but her dexterous skill has won the championship in the platform jumping competition.<br/>Unit features:<br/>It includes a variety of leisure Parkour and platform jumping projects. It can obtain points in the most efficient way and exchange other game unit materials through the chain square.<br/><br/>The image spokesperson of generation 1-4 of the nothingness world and the idol of many ape people on the nothingness planet until the emergence of echo, which also announced the coming of the nothingness world 5.<br/>Unit features:<br/>3D horizontal version shooting game, random level, decryption battle and collection.<br/>The lost booty is said to be an airdrop from a big escape battlefield<br/>[Chain soul]<br/>Every molded body will be injected into an unknown soul.<br/>When you press create, Ta is waiting for you.", "metacritic": null, "released": "2022-02-07", "tba": false, "updated": "2022-02-11T03:26:33", "background_image": "https://media.rawg.io/media/screenshots/acd/acd7a386ee4f9829e78cba0b11fdd1f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RestfulSense"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["RestfulSense"], "esrb_rating": null}