{"id": 73631, "slug": "slendrina-basics-of-scary-cell", "name": "Slendrina Basics of Scary Cell", "name_original": "Slendrina Basics of Scary Cell", "description": "Collect all your bravery and say hello to your new neighbor. Some horrific nights awaits you. Prepare yourself to spend several nights in cellar of granny and your new neighbor. But, granny is not the only one, who will try to capture you, say hello to your new neighbor: Slendrina, she will follow your each step if she hear you. Hide at any available place, as if horrific Slendrina reaches you, she will frighten you and then she will call a granny, who will also frighten you. So be maximally prepared, as you never know when you will have to run and hide. If granny will hear that you have dropped something, she will run to you and beat you. To escape horrific cellar of Slendrina, you have to survive there for some time. Can you deal with this problem and do not let your new neighbor and horrific granny frighten you? Find out in our new simulator: Slendrina: Basics of Scary Cellar.<br/><br/>In this simulator, you would better play accurately, as minimal noise will unravel your location to Slendrina or granny. You have to survive several nights in frightening cellar of Slendrina, but this is not that simple, as it seems. Get ready to say hello to your horrific neighbor and granny, as they are chasing you, and they are as scary as no one else is. So hide and sneak for as long as you can, because if they hear you, Slendrina or granny will frighten you and say hello to you. So make sure you will hear hello from them rarely. Do not let Slendrina or granny beat you. Sneak and hide for as long as you can, survive in scary cellar and escape this horrific place. Call your friends and find out, who will escape faster from granny and your new neighbor, in our new simulator.<br/><br/>Slendrina: Basics of Scary Cellar: is a free to play simulator, in which you will have to sneak and hide from horrific neighbor Slendrina and demonic granny. Nights full of horror awaits you in scary cellar of Slendrina. Get ready to say hello to your new neighbor or granny, they will frighten you, so try to meet them as rarely as you can. Gather your friends and find out who will escape faster from Slendrina and granny and will not say for long in that scary cellar. Survive these several nights and escape horrific cellar of Slendrina in our new scary simulator.", "metacritic": null, "released": "2018-08-02", "tba": false, "updated": "2019-10-22T14:05:29", "background_image": "https://media.rawg.io/media/screenshots/a79/a79536912acba04fd53c7bd9516b36fb_3YCYe2v.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Denis Sandakov"], "genres": ["Adventure", "Simulation"], "publishers": ["Denis Sandakov"], "esrb_rating": "Everyone 10+"}