{"id": 736351, "slug": "anime-girls-vs-soldiers", "name": "Anime Girls VS Soldiers", "name_original": "Anime Girls VS Soldiers", "description": "Anime Girls VS Soldiers<br/><br/>This game literally third-person shooter anime hentai... game. You down the area just like the other arena games and all enemies walking the arena around if they kill you they taking score and if you kill them you taking score. Juts like other arena games or whatever.  Ai have some skills, if their health is low, they will start to run away from you.<br/><br/>But they hear the fire sound. They will definitely come to the source of sound and if they catch you oh bro you got yourself in big trouble. No don't worry if you were dead just you would be dead and then what? Restart the game, keep fire them I mean to soldiers and the anime girls because they don't like you and the other anime girls not clean dude. They betrayed you just like they did to me. Yes its true I codded and I said \"you will fight with the soldiers ok\" and then they didn't. Now they are team. Yes Anime Girls and Soldiers Fight with your waifus. <br/><br/>SAVE YOUR WAIFUS DUDE<br/><br/>This is infinite war \"War ne....\". You will die and die again and again.<br/><br/><strong>Basically</strong><br/><br/>There is a area  and you will fight the soldiers and their allied anime girls.<br/>For now there is a 1 arena and 4 available waifu active.<br/><br/><strong>Futures</strong><br/>Everything is for just fun.<br/>play this game and be relaxed<br/>I mean this is not real just game.", "metacritic": null, "released": "2022-02-07", "tba": false, "updated": "2022-02-11T03:37:22", "background_image": "https://media.rawg.io/media/screenshots/64b/64b87f77ce0a16eec915ee3ea4e519ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DarkDirtyDev"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["DarkDirtyDev"], "esrb_rating": null}