{"id": 736326, "slug": "galaxy-citizen", "name": "Galaxy Citizen", "name_original": "Galaxy Citizen", "description": "Studio Baby,  welcome you to the Universe of Galaxy Citizen – studio most ambitious open-world game .<br/>\n<br/>\r\nGalaxy Citizen tells the story of Alien Sophie (Girl) and Niku (baby girl) and their Battle against the Empire during the Dark Ages in the Galaxy.<br/>\n<br/>\n<br/>\r\nKey Features:<br/>\n<br/>\r\n    Freedom and Liberty  -Do whatever you want in a massive open world with hundreds of locations.<br/>\n<br/>\r\n    Elements of an RPG – Players will obtain a variety of weapon types.<br/>\n<br/>\r\n     Galactic Map- Simple Galactic Map for easy teleportation to planets (levels) or maps.Play  in linear or non linear manner.<br/>\n<br/>\r\n        Teleportation Tower - Simple Teleportation Tower for Progress.<br/>\n<br/>\r\n        Story and Characters – Galaxy Citizen  tells the story of Alien Sophie (girl) and Niku (baby girl).<br/>\n<br/>\r\n      Beautifully  Open-World – The game seamlessly joins together hauntingly beautiful vistas and locations .<br/>\n<br/>\r\n        Action-Packed Battles – Players will switch between using melee and ranged attacks in battle against hordes of enemies and challenging bosses across a variety of open field maps,you can use special attack. <br/>\n<br/>\r\n        Great Soundtrack- Game has incredible orchestral  and Electronic music.<br/>\n<br/>\r\n      E10+ - E10+  rating ,Developed Based on E10 rating only.<br/>\n<br/>\r\n      No Blood- Game does not include any Blood,and no female sexualized character.<br/>\n<br/>\r\n      Gender and Ethnicity,environmentalism - you play as girl, green (alien) girl (metaphor for different race &amp; environmentalism)<br/>\r\n                                                                          planets submerged under water metaphor for global warming<br/>\r\n                                                                           Npc are the metaphor for lgbt", "metacritic": null, "released": "2022-02-06", "tba": false, "updated": "2022-02-11T03:19:50", "background_image": "https://media.rawg.io/media/screenshots/302/3024785d0f3363286b1c8e0dc25d2cbc.jpg", "website": "https://www.studiobaby.in/galaxy-citizen/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Baby"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Studio Baby"], "esrb_rating": null}