{"id": 736354, "slug": "sex-diary-double-trouble-teacher", "name": "Sex Diary - Double Trouble Teacher", "name_original": "Sex Diary - Double Trouble Teacher", "description": "<p>About the game<br />\nAn explicit Click-Through VISUAL NOVEL about an honorable Dean, a Phd. French Student and the very naughty Physics Professor Layla Scott involved in a very hot argument in the dean’s office.<br />\nStory Description<br />\nDear diary,<br />\nI’ve been a bad girl this evening…<br />\nI broke the rules of WILSON UNIVERSITY in the worst possible way..<br />\nI called my French Phd. Student, requested his presence in my office…and made him show me what a proper French kiss feels like…<br />\nYou know…down there.<br />\nI even gave grades for his foreign tongue technique, moaning loud A’s and B’s, like a proper teacher to a good student.<br />\nIf only I could&#39;ve stopped there…<br />\nBut no, I pulled his pants down and put his other “french assets” to test.<br />\nAnd just as I was starting to shake and scream “You’re a straight A! You’re a straight A!” The door of the office slid wide and my worst nightmare stepped in, putting an end to my shameful display.<br />\nDean Hunter Wilson The III rd – the most honorable, strict, irritating, and fucking HOT dean this State ever had, stepped inside with a scorching glare and an impressive list of profanities coming out of his mouth. He kept on listing the saints, gave us another death glare, then ordered us to join him in the dean office immediately.<br />\n…<br />\nI know, I know…you will say that I’m screwed.<br />\nI will probably lose my job and Leon will be kicked back to Europe without his Phd. degree.<br />\nBut I won’t go down without a fight!<br />\nAnd oh, my dear diary,<br />\nI assure you that Dean Hunter will damn the day he called Professor Layla Scott in his office.<br />\nOne way or another…</p>", "metacritic": null, "released": "2022-02-07", "tba": false, "updated": "2022-02-14T16:18:03", "background_image": "https://media.rawg.io/media/games/1f4/1f4c81701d8e55e8086a303c88f9668f.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DIG Publishing"], "genres": ["Casual", "Indie"], "publishers": ["DIG Publishing"], "esrb_rating": null}