{"id": 736332, "slug": "last-space-guardian", "name": "Last Space Guardian", "name_original": "Last Space Guardian", "description": "Humanity has developed technologically to the point where we can travel beyond the unknown deep space!<br/>But we never imagined what we'd find there. Alien races more evolved than us!<br/><br/>We were invisible to them until that moment, but now they have come in search of taking all that has always been ours!<br/>We were forced to create a fleet of ships with our best technologies to defend our solar system from this great invasion!<br/>But it was in vain, we were all decimated!<br/>Our last hope was in an experimental technology of analysis and cloning skills!<br/><br/><br/><br/>Initially installed on a single ship and entrusted to you, so that you defend our home!<br/>Defend our solar system from this great alien invasion!<br/>You'll command the only ship that has the technology capable of cloning the special abilities of enemy ships, and hone in on every stage you've won!<br/>Game style Shoot'EmUmp in pixel art, which aims to remember and honor the great retro games of the past, offering you that old childhood nostalgia!<br/><br/>Survive 10 enemy stages!<br/>Shoot 'Em Up style, spaceship game, in pixel art and 8-bit retro music!<br/>Evolve your shot to the maximum level, use the energy bar for upgrades, and special abilities!<br/>Advance each stage by defeating Bosses and enemies to collect new skills, transformations and extra lives!<br/><br/>At each level, new enemies will emerge to challenge you, and then you think you're capable of defeating them all?", "metacritic": null, "released": null, "tba": false, "updated": "2022-02-11T03:23:54", "background_image": "https://media.rawg.io/media/screenshots/b20/b20b8b54a1decea55ebd83403be72e0c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Douglas Henrique Luciano"], "genres": ["Indie"], "publishers": ["DHDevStudio"], "esrb_rating": null}