{"id": 736411, "slug": "save-us-3", "name": "Save Us", "name_original": "Save Us", "description": "Save Us is a multiplayer free-for-all survival game where players are forced to survive and escape a deadly paradise and tropical island known as Lacuna Shore. To escape, players need to find 1 of 2 relics and use a flare to call for extraction. Relics are hard to come by and must be defended when they have been possessed. You can find them by completing challenges, avoiding deadly traps and facing monsters that carry relics.<br/><br/>Loot crates which spawn around Lacuna Shore contain key items that will contribute to surviving the island. This includes melee weapons such as a knife or flare and pistol specific crates which require a key to open. Health can be replenished by consuming coconuts found on coconut trees scattered around the island and coconut trees can drop up to 6 coconuts when punched. Your character will become poisoned if you have been hit by one of the many monsters on Lacuna Shore, so make sure to keep an eye on your poison bar. You can heal from poison wounds by consuming mushrooms found on the island.<br/><br/><br/><br/>While adventuring around the island, look out for certain clues about the whereabouts of other players, footprints will give you an indication of other players direction and if they are close to you. Opened loot crates and breached locations can also be an indication.<br/><br/>It is your choice to make allies and work together or to create enemies in the game. Chances of surviving the island solo are slim, so think twice about befriending players, this could contribute to your success or demise on the island. You can use the radio to communicate on specific radio channels and communicate your game-winning strategy to players, but be careful, you may have other players lurking on the same channel.<br/><br/><br/><br/>Once a flare and relic has been collected, players must follow the red arrow and go to the specified extraction point on the map. Once at the extraction point, use a flare to call in the rescue helicopter and jump on the rescue hook to escape the island with a relic, but beware, you may not be alone.<br/><br/>", "metacritic": null, "released": "2022-02-10", "tba": false, "updated": "2022-02-11T04:16:52", "background_image": "https://media.rawg.io/media/screenshots/417/4170d0b9f4d0ce49d74a21112a17a14a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Infunas Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Infunas Games"], "esrb_rating": null}