{"id": 736407, "slug": "dungeon-castle-2", "name": "Dungeon Castle", "name_original": "Dungeon Castle", "description": "You have been summoned to an unknown castle.<br/>And you will receive one mission. <br/>Gather various voice data and approach the truth.<br/>And you have to delete the root node of the network metabus that is connected to all that truth.<br/>In that \"Dungeon Castle\" where you are.<h3>Adventure</h3><br/><strong>\"You have to get through the Dungeon Castle with a torch and a weapon\"</strong><br/>Where you are hidden in the dark, light up your way with torches, and defeat enemies who threaten you with weapons and move forward.<h3>Action &amp; battle.</h3><br/><strong>\"The enemies you will meet are powerful\"</strong><br/>If you are attacked, you will be in a very dangerous state.<br/>Also, enemies can ignore your attack.<br/>That's why always aim behind your enemies.<br/>And try to avoid enemy attacks as much as possible.<h3>Growth</h3><br/><strong>\"The torches, weapons, and abilities given to you can be stronger\"</strong><br/>Various weapons, attributes, and new abilities are essential for you to get through the dungeon.<h3>Another dungeon</h3><br/><br/><strong>\"There are other dungeons in the Dungeon Castle\"</strong><br/>You have to clear different dungeons to get a variety of voice data. <br/>Don't hesitate to try.<h3>Characteristics of games</h3><br/>- The fun of exploring and exploring dark castles.<br/>- A strong sense of hitting and exhilarating combat action stand out.<br/>- Nine weapons, 20 combat animations, and various abilities.<br/>- Interesting main story and sub story.", "metacritic": null, "released": "2022-02-10", "tba": false, "updated": "2022-02-11T04:14:31", "background_image": "https://media.rawg.io/media/screenshots/580/5801d5fbcdefdb49e85dd901f620b9d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dev by YoonLim alone"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["YoonLim"], "esrb_rating": null}