{"id": 73643, "slug": "shadowgun-deadzone-pvp-battles", "name": "Shadowgun DeadZone PvP Battles", "name_original": "Shadowgun DeadZone PvP Battles", "description": "Gather up your posse of friends, build a team, and kick some butt in the best looking multiplayer third person shooter for mobile. This intense online bullet fest offers the deadliest weapons in the galaxy to aid in your quest for glory...<br/><br/>“If you want evidence that mobile games are turning into their console and PC cousins, then look no further than Shadowgun: DeadZone.” - PocketGamer.co.uk<br/>“Shadowgun: DeadZone is one of the sharpest-looking shooters we’ve seen.” - SlideToPlay.com<br/>“They’ve made what could be the best multiplayer shooting experience on a mobile device.” -<br/> TouchGen.com<br/><br/>EXPERIENCE AWESOME MULTIPLAYER WAR WITH CONSOLE QUALITY GRAPHICS.<br/><br/>ADRENALINE-PUMPING ACTION<br/>• Intense fast-paced multiplayer combat with up to 12 players connected online. This third person shooter puts you right in the middle of a futuristic war zone - make sure you bring plenty of bullets!<br/>• Choose from two popular game modes: Deathmatch (a pure killing spree) and Zone Control (Capture the flag style war).<br/>• Pick from a rogue’s gallery of 10 memorable characters. Customise to match your own combat style!<br/>• Over 20 unique, futuristic and deadly weapons to choose from, including sub-machine guns, assault rifles and plasma throwers. Supplement your arsenal with lethal gadgets like sentry guns and landmines.<br/><br/>GRAPHICS: WE GOT PLENTY!<br/>Shadowgun: Deadzone takes mobile PvP shooters to a new level of realism. Enter the atmospheric world of the Shadowgun and get transported by the moody graphics and slick animation.<br/><br/>FANTASTIC FEATURES<br/>• Intuitive fast-paced cover system. If the action gets too insane you can take a breather - just walk up to an object and you’ll take cover with the minimum of fuss.<br/>• Earn perks to pump up your experience and create your ultimate badass.<br/>• Enter the private server and create your own war - your game, your rules!<br/>• Kill your way across unique, ultra-detailed maps from the Refinery to the Palace.<br/>• Fight, kill, die...kill again! If you are K.I.A you’ll respawn straight back into the battle.", "metacritic": null, "released": "2012-11-15", "tba": false, "updated": "2019-10-22T14:24:32", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d59ce67bc441a27206af24df614bea7.jpg", "website": "http://www.madfingergames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MADFINGER Games"], "genres": ["Action", "Arcade"], "publishers": ["MADFINGER Games"], "esrb_rating": "Mature"}