{"id": 73648, "slug": "extreme-cluster-truck-driving-3d", "name": "Extreme Cluster Truck Driving 3D", "name_original": "Extreme Cluster Truck Driving 3D", "description": "Run for your life! Stop means death, so forget about it!<br/>This place is crazed as you are!<br/>Jump from roof to roof between trucks or your would end right now and right here!<br/>Doesn’t matter the fact why you start this run, right now your main goal is running without stops!<br/>Enjoy unusual running simulator with our new game - Extreme Cluster Truck Driving 3D! Feel like once ordinary trucker now running over the rooftops of motorcade trying to reach the first truck – it’s YOUR truck and someone has theft it!<br/>As I said, this place is crazed – so, avoid these strange and unexpected obstacle like rolling logs, troll-hammers, tors of death and even laser beams – or I should call it “thermal rays of sudden death”? Do your best to evade such obstacles, jump, and duck – do your best to reach the end of this maddened racing track!<br/>Join Extreme Cluster Truck Driving 3D – game, full of abnormal obstacles and even stranger things that you usually waiting from arcade runner! Have fun and run fast!<br/>Extreme Cluster Truck Driving 3D features:<br/>Very unusual truck roof runner<br/>Strange and unusual obstacle<br/>Different power-ups to help you run faster and longer<br/>Strange scenario filled with mysteries and puzzles<br/>Does this race mean something? Check it by yourself with Extreme Cluster Truck Driving 3D!", "metacritic": null, "released": "2017-01-14", "tba": false, "updated": "2019-10-22T14:33:31", "background_image": "https://media.rawg.io/media/screenshots/8aa/8aa3fb09b9b92ae73192bcdf2ec0e2f6_2bNBKdO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Arcade", "Casual"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Everyone 10+"}