{"id": 73642, "slug": "modern-cinderella-shall-we", "name": "Modern Cinderella / Shall we?", "name_original": "Modern Cinderella / Shall we?", "description": "<p>Money isn’t everything… Escape your controlling mother’s clutches to an exciting new world!<br />\nA reverse Cinderella story set in the modern world.<br />\nSay goodbye to your old self and start a life of your own.<br />\nNo one knows who you really are.<br />\nWouldn’t you like to discover your true self?<br />\nMake choices to create the person you truly are.<br />\nLet’s make your dreams come true!<br />\n◆The Story◆<br />\nYou have been given everything.<br />\nFriends and families are always there to support you.<br />\nOnly you know the truth behind your seemingly carefree life.<br />\nWhen you can&#39;t stand it anymore, you decide to strive out on your own!<br />\nFinally independent, this is your chance to begin again…!<br />\n“This is the moment I change myself. Let me show you who I really am!”<br />\nGrow as a person with new friends and experiences around every corner.<br />\nThe pursuit of happiness begins here!<br />\n◆The Characters◆<br />\n●Music Lover: Simon Hopper<br />\nSimon is an aspiring composer who works two jobs.<br />\nHe is a waiter by day, and a bar musician by night.<br />\nOne fateful night, you take the stage and sing to his music.<br />\nHe is amazed by your incredible talent, and asks you to become his music partner.<br />\n“...Would you consider singing for me?”<br />\nYour dream of professional singer is given wings.<br />\n●Food Lover: Nicolas Whitewood<br />\nAn aspiring chef who wishes to feed the whole world.<br />\nThough his cooking skills are definitely admirable, there&#39;s something else...<br />\nHe heavily relies on your sense of taste. You are his recipe for success!<br />\nYou will guide him to be the master chef he always dreamed of becoming!<br />\n“Where have you been all my life? You’re the one I’ve been looking for!”<br />\nJoin his gourmet tour and experience the new world of flavor!<br />\n●Flight Lover: Zack Wright<br />\nHis sweet nature allows him to befriend virtually anyone.<br />\nAs a pilot who travels all over the world, he envies your talent in languages.<br />\nHe may not make the best first impression, but he does everything he can to make up for it.<br />\nThe more you travel with him, the deeper you fall in love.<br />\n“I may not be a typical prince, but please... give me a chance.”<br />\nYour dream of seeing the entire world becomes a blissful reality.<br />\n◆Features◆<br />\n●FREE to download.<br />\n●FREE Story Tickets awarded often.<br />\n●Beautiful illustrations and great music.<br />\n●Many different options available for your boyfriends.<br />\n●Ranking system to flaunt your fashions!<br />\n●Story endings vary with your choice.<br />\n●Amazing selection of avatar items.<br />\n●Fun events and special rewards.<br />\n◆About Us◆<br />\nNTT Solmare is a Japanese company based in Osaka, Japan. We strive to make the best dating simulation apps for adults. Our Otome dating sims are free! If you like romance novels, visual novels, cute guys, or anime then we think that you will love our games! Our Shall we date? series have over 32 million downloads!! So download one of our free romance games today, and find out why our dating games are so popular!</p>", "metacritic": null, "released": "2017-04-18", "tba": false, "updated": "2019-10-22T14:39:59", "background_image": "https://media.rawg.io/media/screenshots/e62/e62888a3bfa244488afbb1f89d7997d2.jpg", "website": "http://shallwedate.jp/en/free.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["NTT Solmare"], "genres": ["Adventure", "Simulation"], "publishers": ["NTT Solmare"], "esrb_rating": null}