{"id": 736406, "slug": "the-age-of-navigation", "name": "The Age of Navigation", "name_original": "The Age of Navigation", "description": "1. Rich game plot<br/>The current version provides 4 protagonists for everyone to choose from; different protagonists have different birthplaces and main stories. The friends you meet in the main story will also be different. Many more legendary crew members are waiting to be recruited around the world<br/><br/><br/><br/>2. Diverse sailing events<br/>During the voyage, you must not only fight against nature, but also encounter navigation events such as malnutrition, sepsis, fire, and rodent infestation, and will also intersect with NPC forces from all over the world.<br/><br/><br/><br/>3. Open Sailing World<br/>Historic sites, deep-sea shipwrecks, and numerous treasures and discoveries are hidden all over the world. Set sail, the world is waiting for you to explore<br/><br/><br/><br/>4. Free global trade<br/>The game provides more than 160 ports for navigators to trade freely. Everyone can invest in the port and develop the port. The better the port development, the more commodity inventory and even new commodities will be brought.<br/><br/><br/><br/>5. The Romance of the Great Ship Cannon<br/>For many navigators, the cannon of a giant ship is romantic. We provide many ship types for players to choose from. The more armed the port is, the better the cannons of the ship can be made. There are many more historical and famous ships for navigators to obtain<br/><br/><br/><br/>6. Colorful achievements<br/>More than 500 discoveries, all over the world. More than 50 East and West ships and more than 60 crew members, including many historic ships and legendary captains. In taverns around the world, there are also unique beauties. Conquering the beauty can not only bring attribute bonuses to the navigator, but also provide various buffs to the fleet<br/><br/>", "metacritic": null, "released": "2022-02-09", "tba": false, "updated": "2022-02-11T04:13:54", "background_image": "https://media.rawg.io/media/screenshots/dac/dac776644d98d3bbe64edc94f0d3cea1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Upstream Games"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Upstream Games"], "esrb_rating": null}