{"id": 736410, "slug": "oogy-can-you-help", "name": "Oogy: Can You Help", "name_original": "Oogy: Can You Help", "description": "Play as Oogy, a business card-wielding sheep that is apparently the last hope for a house inhabited by living furniture and adorable anthropomorphic animals. <br/><br/>Can you make it through each room of the sprawling wintery house, uncovering the backstory behind each of the strange and powerful creatures inside?<br/><br/><br/><br/>Oogy: Can You Help is the passion project of a single developer, built from the ground-up without the use of any video game engine to provide a uniquely vibrant and surprisingly detailed experience.<h3>Welcome to the Front Yard</h3><br/>In this indie narrative deckbuilder, the goal is to collect as many unique moves as possible by traversing more and more of the map. Enter the wintry house after winning over the front door, and your journey begins. Instead of upgrading your arsenal, you can obtain more cards by winning battles. <br/><br/>More than that—every new encounter raises a question: do you save your opponent by \"cleaning\" them of the darkness that surrounds the house, or do you kill them, leaving both their moves and dialogue unreachable?<h3>Story</h3><br/>Oogy: Can You Help is driven by the dark story that seems to be seeping into every room of the arts-and-craft styled map. The characters and cutscenes are designed to pull in more narrative-inclined players, tying up the loose ends and getting to the bottom of each question raised through the multi-hour, multi-day play time.<h3>Cards</h3><br/>- Collect as many cards as you can as Oogy, the sheep who somehow answers the call for help<br/>- Cards have familiar mechanics such as Attacking and Shield, but each enemy has characteristic types of cards that you can only obtain from that type of enemy<br/>- Start by playing 1 card per turn, with 4 cards visible at once<br/>- Cards and characters provide the ability to manage and synergize with your cards and deck in exciting, wicked ways<h3>Encounters</h3><br/>- Boss fights and minibosses that are definitely more than they appear<br/>- Each boss unlocks the ability to play more cards per turn, incentivizing boss fights that may sometimes be completely optional<br/>- Deep and dark narrative story that is only accessible by saving those you fight and exploring as much of the map as possible<h3>Design</h3><br/>- Original music for each room and major encounter in the game<br/>- Hand-drawn character style and arts-and-crafts map style<br/>- Secret passageways and puzzles<h3>Extras</h3><br/>- Endgame that allows for multiple playthroughs without having to start over from scratch<br/>- Enjoy extra rooms that have compelling gameplay switchups and specific music tracks.<br/>- Infinitely long ‘The Attic Observatory’<br/>- Rhythm map ‘The Music Room’<br/>- Gauntlet boss map 'The Bunker'<br/><br/>..and more!<h3>Author</h3><br/>Written, composed, and developed by Julian Weiss.", "metacritic": null, "released": "2022-02-28", "tba": false, "updated": "2022-02-11T04:16:19", "background_image": "https://media.rawg.io/media/screenshots/67c/67c2ebe2e4c5b152b54a4c15ce5a1d8f.jpg", "website": "https://oogycanyouhelp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Julian Weiss"], "genres": ["Indie"], "publishers": ["Julian Weiss"], "esrb_rating": null}