{"id": 736565, "slug": "bomber-doods", "name": "Bomber Doods", "name_original": "Bomber Doods", "description": "<p>Not too long ago on a planet very much like earth. A software developer was thinking: \"It's been 20 years since I last saw or played Bomber Man. I wonder how much I remember\". And so was Bomber Doods born. From the memories of a middle aged programmer and his friend who knows a thing or two about pixels.</p>\n<p>This game was created with the idea of remaking a childhood game without any reference (except memories) and seeing how close to the original you’d get.\r\n</p>\n<p>There's been a few versions of Bomber Doods now. It's changed a couple times, there's some new stuff here that I'm sure wasn't in the original game but this is the version I decided to share with you.\r\n</p>\n<br/>\n<p>How to play!\r\n</p>\n<p>This is a local multiplayer game only, tho it works pretty well with Parsec. Grab some friends, a couple of controllers and have fun. There's also keybindings for up to four players on the same keyboard for some additional madness. I'll leave it to you, the players, to figure out what each key controls!\r\n</p>\n<p>Hope you enjoy playing the game as much as I did making it.\r\n</p>\n<p>\r\nI still haven't played Bomber Man since I was a kid.\r\n</p>\n\n<p>Credits\r\n</p>\n<p>Code and Design<br/>Alexander Hulander</p>\n<p>Art<br/>Daniel Ribera Olsen</p>\n<p>Music<br/>Stefan Ribera Olsen<br/>https://baddumplin.bandcamp.com/album/spartans-in-candyland</p>\n<p>Play Testers<br/>Anton Hesselbom<br/>Daniel Fahlström<br/>Filip Gustavsson<br/>Ilkin Huseynli<br/>Jesper Evertsson<br/>Semih Parlayan</p>", "metacritic": null, "released": "2022-02-10", "tba": false, "updated": "2022-02-11T05:15:26", "background_image": "https://media.rawg.io/media/screenshots/93a/93a96cb08c326de610d9511e87bb313e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hulander"], "genres": ["Action"], "publishers": [], "esrb_rating": null}