{"id": 73659, "slug": "farm-harvester-tractor-simulator-3d", "name": "Farm Harvester Tractor Simulator 3D", "name_original": "Farm Harvester Tractor Simulator 3D", "description": "Good morning, farmer! Start your fist day on a farm! Harvest huge fields without getting your hands dirty with this farm simulator in 3D! Enjoy village life and have fun growing crops and forage hay on your fertile farmland! Try Farm Harvester Tractor Simulator 3D and prepare forage for a harsh winter season!<br/><br/>It’s high time to hay! Gain ultimate experience sitting behind the wheel of farm harvester tractor! Try yourself as a farmer and step into the world of agricultural works! Live peaceful life in the village and enjoy your time cultivating your farmland with Farm Harvester Tractor Simulator 3D game! Drive huge farming tractor, harvest crops and get hay – great forage for cattle!<br/><br/>Drive heavy tractor, plough, plow and harvest rich crops playing ultimate farm simulator in 3D! Try different types of agricultural works - from cultivating a farmland to getting hay and forage. Check Farm Harvester Tractor Simulator 3D! Complete farming, driving and parking missions sitting behind the wheel of huge hay harvester and harvest the richest crops on your fields! Sow, plough, plow and harvest your crop!<br/><br/>Cultivate crops on your own farmland with this harvester simulator! Get rich crops and sell forage hay in the market for cash to upgrade your farming tractor! Step into the world of agricultural works and feel like a real farmer living in a village! Try different machines – forage harvesters, trucks and tractors and choose your favorite one! Countryside life has never been so entertaining! <br/><br/>Hay is a good forage for different farm animals. Drive heavy farming tractor to harvest and transport crops and sell it on village market! Sit behind the wheel of huge tractor, plough, plow and fertilize your farmland to harvest the richest crops of forage hay in whole village! Experience the life of farmer with this awesome farming simulator! Drive, park, transport and complete other missions! <br/><br/>Sitting behind the steering wheel of a huge farming harvester is not as easy as it seems! Control forage tractor, harvest, transport hay as fast as possible and sell it to the market for the highest price! Upgrade your farming machines to the top level and prove your worth as a real farmer playing Farm Harvester Tractor Simulator 3D!<br/><br/>Farm Harvester Tractor Simulator 3D features:<br/><br/>-\tDrive heavy forage tractor - plow, plough, fertilize and harvest crops and hay<br/>-\tRealistic farming experience<br/>-\tUpgrade your farming harvester - higher speed, more space for crops and more<br/>-\tAmazing farm harvester simulator in 3D<br/><br/>Harvest hay and transport it to the market to sell! Gain great agricultural experience and cultivate your farmland sitting behind the wheel of harvester tractor! Farm Harvester Tractor Simulator 3D is a great game for those who love driving heavy machines, tractor, seed drill and other farming equipment. Live the life on a farm, cultivate fields in a far village and enjoy peaceful countryside atmosphere! Complete harvesting, transporting and parking tasks playing this forage tractor simulator in 3D!", "metacritic": null, "released": "2015-12-18", "tba": false, "updated": "2019-08-12T04:58:23", "background_image": "https://media.rawg.io/media/screenshots/79b/79b8480f3ed0c4c649ec16a403505eb9_HNn5xfP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Everyone 10+"}