{"id": 73671, "slug": "pixel-pirate-island-survival-simulator-3d", "name": "Pixel Pirate Island Survival Simulator 3D", "name_original": "Pixel Pirate Island Survival Simulator 3D", "description": "Make this place your home playing this pirate island survival simulator! Enjoy nice tropical island views – cube ocean, pixel jungles and blocky animals. Explore pirate survival island full of secrets and mysteries, search for sunken pirate ship and dive underwater to find caves full of treasures! Hunt wild animals, battle against predators ready to attack you, find weapons, quarry resources and craft tools to make survival island your home! Use all your survival skills to stay alive exploring lost pirate island, avoid battling against furious wild predators and discover the secrets playing amazing survival simulator in 3D! Find pirate’s treasures, explore ships and caver and live the life of real survivor to the full!<br/><br/>Be ready for ultimate pirate island survival experience! Control character with a joystick, move around the islands or swim in the ocean to find treasures, weapons and tools that would help you to survive! Be accurate, cube tropical jungles and Pixel Ocean are full of predators and other wild animals ready to attack! Quarry resources, find or craft weapons such as guns, bows or hammers to battle for your life against wild animals! Try amazing pirate island survival simulator in cute cube setting and live wild life to the full!<br/><br/>Travel to neighboring islands to find treasures, weapons or quarry rare resources. Level up survivor’s skills like hunting, fishing or swimming to make your life on cube pirate island easier. Your only goals is to survive! Salvage survival tools and weapons, hunt wild animals to make it your next meal, find weapons to protect yourself from predators, quarry resources and craft useful tools using special workshops. Use your survival skills to stay alive, avoid battling against furious island predators and discover the secrets of pirate island with amazing survival simulator in 3D! <br/><br/>Enter the wilderness playing this amazing Island Survival Simulator 3D in cute pixel reality! Survive on the lost pirate island – it’s all made of pixels and cubes here! Battle for your life with wild animals, hunt, fish or gather to find food, craft tools and weapons and prove your worth as a real survivor!Don’t forget to mind survivor’s indicators – health, energy, water and fullness. If one of these drops – there is no chance to survive! Quarry recourses to craft tools – fishing rod, axes, guns, weapons and other which could be really useful! Build blocky shelters to hide from wild island predators and try to turn this lost survival island into really nice place to live! Enjoy your time– hunt for wild predators, swim the ocean, explore pirate ships and caves to find treasures playing Pixel Pirate Island Survival Simulator 3D!<br/><br/>Pixel Pirate Island Survival Simulator 3D features:<br/><br/>-\tAmazing island survival simulator in cube environments – it’s all made of pixels and blocks here<br/>-\tHuge pirate island and even neighboring ones to explore – different locations with various wild more predators to hunt, sunken ships full of treasures, plant food to gather and <br/>-\tLevel up survivor’s skills – hunt, fish, craft, build and battle against wild animals to unlock more survival skills<br/>-\tUltimate crafting system – craft weapons, tools, clothes, furniture and other useful things<br/>-\tHealth, energy and fullness indicators to mind – it’s nit easy to stay alive on lost survival island<br/><br/>Upgrade your hunting, battling skills and explore this place to make it your home playing amazing survival simulator in 3D!<br/><br/>Choose the lifestyle of a survivor – hunt pixel animals, battle against cube predators and build blocky shelters to hide from sun or rain with Pixel Pirate Island Survival Simulator 3D! Swim, hunt, battle and explore - do anything you want to stay alive playing ultimate pirate island survival simulator in 3D! Explore the wilderness, discover secret places, search for pirates’ treasures, find or craft weapons and other useful tools and stay alive at all costs! Are your going to sit idly waiting for help?", "metacritic": null, "released": "2016-03-04", "tba": false, "updated": "2019-08-12T04:58:33", "background_image": "https://media.rawg.io/media/screenshots/308/308784845db31a48bd05bbaddc1e6508.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Adventure", "Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}