{"id": 736886, "slug": "snow-rain", "name": "Snow Rain", "name_original": "Snow Rain", "description": "<p>Are you frustrated in this blazing hot weather? Then don't wait in this hot weather anymore. Snow rain brings you one of the coolest jumping games in this Snowing weather. So let go of your summer suits and jump higher into the deepest snow region, falling in Snow Rain.     </p>\n<p>Snow rain brings you a snow-covered environment with one goal: achieve a higher score by staying alive by outrunning all falling snowballs as long as possible. Double jump from side to side, and try not to fall elsewhere, or else you will find yourself at the bottom of an Antarctic Ocean! This is not your average high score chasing app in a big jump game - it's something more interesting for this hot weather that we've been experiencing lately, so go ahead and be the greatest snowman alive!     </p>\n<p>  Snow Rain.io Fall Guys Jumping Game is an addictive game that helps you freeze yourself in hot weather and makes your time cool &amp; enjoyable. In this jumping game, the players will have to fill their scores by avoiding falling snowballs from one wall to another. It's a free fall guys game with beautiful graphics &amp; soothing music.     </p>\n<p>Can't stand the heat? Then don't wait for it in this super hot weather. Snow Rain has you covered with their icy game to cool off your summer suits and bring a refreshing end to that long day at work or school. The objective is simple: avoid snowballs as they fall from above while jumping on top of platforms both high up and low down all across Antarctica, just like Red Ball would do! But be careful not to lose yourself by falling into an Antarctic Ocean because there's no way out once you're submerged underwater, so fill those lungs full of air before taking one last jump onto any platform ahead.     </p>\n<p>It's time for some cool, fun games! Snow Rain has a great way to beat the heat this summer with their new game where you play as one of two snowmen and jump from one wall to another and not get hit by falling snowballs. The more points you get, the higher your score will be- so try not to miss any platforms or fall into the water below! If you love i.o. Games like these are simple but still challenging enough, then don't forget about the other awesome i.o games we have on offer too!     </p>\n<p>New fall game in the hot summer! Snow Rain is a fun and addictive jumping game for all ages that will have you hooked from the first minute. It's an arcade-style, fast-paced, easy to learn but hard to master game with lots of levels to keep you playing for hours on end. Collect coins as you jump and unlock new items like snowmen or even penguins by collecting enough points. The only downfall? You'll want this app so badly it might melt your phone...so don't forget about our winter version coming soon too!     </p>\n<p>Snow Rain.io Fall Guys Jumping Game is one of the best jumping games for all age groups in this hot summer season to keep their minds cool and relax from the heat of blazing sun day. Have you ever played a fall guy game? You know, the one where you have to double jump from wall to wall and avoid snowballs falling on your head to win the snowball fight! Snow Rain brings this fun-filled experience in an endless runner-style jumping game for all those who love reaching their highest scores while having some good old time! Your level will increase as you earn more points. Additionally, there are secret benefits that can assist you in overcoming difficult stages. Therefore, what are you still waiting for?! Prepare to discover how addictive this fantastic running game truly is! Do you wish to escape the heat?     </p>\n<p>This game will make it more bearable for you who want to be the greatest snowman there is!! Avoid the falling snowballs and double jump on the walls to achieve points. Be careful, don't double jump too much, or our protagonist might find himself in Antarctica's icy ocean. So why wait in this hot environment then? It's time to freeze yourself in his cool game of Snow Rain.     </p>", "metacritic": null, "released": "2022-02-09", "tba": false, "updated": "2022-02-11T06:47:18", "background_image": "https://media.rawg.io/media/screenshots/d6b/d6b31e04a6058479832b69a40cb3c58f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NapTech Games"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}