{"id": 73685, "slug": "ninja-shadow-shall-we-date", "name": "Ninja Shadow / Shall we date?", "name_original": "Ninja Shadow / Shall we date?", "description": "It is Edo period, and Japan is still a country closed off to the rest of the world. In order to save your village and seek revenge, you must impersonate your twin brother, Village Chief and ninja. But the task at hand is not so easy… as you are his sister! You join a group of ninja vigilantes hell-bent on cleansing the corrupt City of Nagasaki. On the path to vengeance, you never expected to find love…<br/><br/>◆The Story◆<br/><br/>You’ve found yourself surrounded by the most skilled ninjas in all of Nagasaki. Carrying out vigilante missions with your instructor, you must keep your identity a secret. However, you find yourself growing closer to him…Will he find out your true identity? Will you capture the heart of an elite Commissioner…or help an enigmatic interpreter recover his lost memories?<br/><br/>Your path will be fraught with obstacles, but make the right decisions, and you will find<br/>yourself in a romance that will go down in history.<br/><br/>◆The Characters◆<br/>●The Assertive Commissioner - Ukyo<br/>His loveable personality means he is often relied on. As your instructor, he takes you under his wing, and you grow close. His caring nature softens your guard, and soon you realize your undeniable attraction to him. What will he do when he discovers your true feelings?!<br/>“Come on... Just tell me you love me”<br/><br/>●The Mysterious Interpreter - Eduard<br/>Because of his severe memory loss, his intentions are shrouded in mystery. He does not say much, but deep down you know how kind-hearted he actually is. Through the process of helping him recover his memories, he realizes how much you mean to him. How will you respond to his shocking confession?!<br/><br/>“Your smile brings me so much joy”<br/><br/>●The Snarky Oracle - Asagi<br/>Coming from a family of oracles, he is constantly compared to his great father, which puts him under immense pressure. By sharing each other’s secrets, your relationship grows deeper. Can you melt his heart of ice?!<br/>“Can I kiss you?”<br/><br/>Your destiny is in your hands.<br/>Your mission? To find true love.<br/><br/>◆Features◆<br/>● Play free of charge<br/>● Read stories with Story Tickets, which are given out daily<br/>● Enjoy multiple endings for each character.<br/>● story endings vary depending on the choices you make<br/>● Dress up your character in cute outfits<br/>● Join in-game events to receive exclusive stories, pictures, avatar items and more…<br/>● Link your account on Facebook<br/><br/>◆About Us◆<br/>NTT Solmare is a Japanese company based in Osaka, Japan. We strive to make the best dating simulation apps for adults. Our Otome dating sims are free! If you like romance novels, visual novels, cute guys, or anime then we think that you will love our games! Our Shall We Date? Series have over 32 million downloads!! So download one of our free romance games today, and find out why our dating games are so popular!", "metacritic": null, "released": "2016-06-13", "tba": false, "updated": "2019-10-22T14:39:54", "background_image": "https://media.rawg.io/media/screenshots/ba4/ba42e1738561a0db007d4907832c4bf4.jpg", "website": "http://shallwedate.jp/en/free.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["NTT Solmare"], "genres": ["Adventure", "Simulation"], "publishers": ["NTT Solmare"], "esrb_rating": null}