{"id": 73697, "slug": "gtr-speed-rivals-drift-race", "name": "GTR Speed Rivals: Drift race", "name_original": "GTR Speed Rivals: Drift race", "description": "GTR Speed Rivals<br/>Online drift racing game with ultra graphics! We worked hard to create the perfect drifting physics! Compete with other players for points and speed in multiplayer, level up your car, improve the engine, change the suspension, upgrade the wheels for better road grip, put beautiful rims on them, reduce the weight of your car’s body, and enhance the NITRO TYPE! Bet on the drift against your opponent, or play in a Time Attack! Defeat everyone on the global online leaderboard! <br/><br/>Our drift modes:  <br/>- Career <br/>In the career racing games you will have to go through 5 chapters, from “NEWBIE” to “CHAMPION”. <br/>Each chapter will be harder and harder. Drift, get points and drive laps as fast as possible! <br/><br/>- Single Player <br/>In single car games you can compete with your own results or just train on time and drift points! <br/><br/>- Multiplayer <br/>Compete with other players from all around the world in multiplayer speed driving games on drift points or lap time! <br/><br/>Our drift features:  <br/>-  Bets modes <br/>Make bets on your racing car against rivals, bet in-game credits on your victory in drift or time competitions; <br/><br/>- Absolutely realistic drifting physics <br/>We created the most realistic drift underground simulator, hot wheels will not let you get bored! <br/><br/>- Ability to rent a car <br/>Not sure which race car to buy? Well, in our race car games you have the opportunity to rent a supercar and choose one that you like the best! <br/><br/>- A fleet of over 25 super detailed race cars <br/>In the game there is a large garage with over 25 supercars of different brands: BMW i8, Porsche, Ferrari, and so on. Choose your fast and furious game! <br/><br/>- HD 1080p graphics <br/>Detailed sports cars and map textures like in the gt drifting games. <br/><br/>- Option to select graphics for weaker smartphones <br/>A weak phone? You can choose the graphics options, from low to high! <br/><br/>- Global leaderboard <br/>Fight for a place on the global leaderboard with other players! Our highway rider. <br/><br/><br/>Perfectly drawn map textures, beautiful sky and houses, vivid asphalt, drive everywhere (stadium, docks, oceanarium, etc.). <br/>We created an excellent drift simulator, and drift games have never had such balance before! <br/>The game’s powerful engine won't let you get bored and you'll want to hit the pedal harder and harder. <br/>Free race car games install our racing games, you will get many emotions and drive.<br/>Still not sure what to play? Choose CARS Speed Racing!<br/><br/>Support: support@azurgames.com", "metacritic": null, "released": "2018-02-15", "tba": false, "updated": "2019-07-29T18:06:53", "background_image": "https://media.rawg.io/media/screenshots/a24/a24e67a89a85cc51da8697fa6c47eca3.jpg", "website": "http://azurgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Azur Interactive Games"], "genres": ["Simulation", "Racing"], "publishers": ["AZUR INTERACTIVE GAMES"], "esrb_rating": "Everyone 10+"}