{"id": 73690, "slug": "multicraft-survival-craft-build-sandbox-game", "name": "MultiCraft -- Survival Craft Build Sandbox Game", "name_original": "MultiCraft -- Survival Craft Build Sandbox Game", "description": "#Fix many crash bugs, now I'm sure you'll like this awsome game!!!<br/>#Explore many amazing online maps with players from all over the world!<br/>#Change your name before you connect to an online server<br/><br/>Multicraft is an amazing open world building game inspire by Minecraft. you can build anything you can image in this game. Here are some other amazing maps in this game:<br/><br/>Flat world:<br/>   This flat and infinite world make it easy for anyone to build new things<br/>Big Bird:<br/>   The lovely flappy bird is HERE, it show you how to build something lovely :), just build your own bird and share with your family and friends.<br/>Sky Imagination:<br/>  Building is not as easy as you think! pay your attention! you are flying in the air! Don't disable the fly mode, or you'll falling into the endless under world! So continue the job to build the fantasy things in your mind. it can be a space station, air castle or some big birds crash into the flying air plane! anything in your mine!<br/>Labyrinth:<br/>  Tire of building your dream? Welcome to our Labyrinth world! Don't try to dig the block!. your mission is escape to the outside world. someone told me there's a ladder somewhere, just find it and see what's there!<br/><br/>Have fun!<br/><br/>This app is inspired by Minecraft but is not an official Mojang app. we are not associated or connected with Mojang AB and its game Minecraft - Pocket Edition. This game isn't endorsed or affiliated with its creator or licensers.", "metacritic": null, "released": "2014-09-04", "tba": false, "updated": "2019-10-22T14:24:32", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ff3625a5d9cbdc1c0d4ef99c8420c9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TUIJUN FENG"], "genres": ["Action", "Adventure"], "publishers": ["TUIJUN FENG"], "esrb_rating": "Everyone 10+"}