{"id": 73705, "slug": "extreme-mega-street-car-racing", "name": "Extreme Mega Street Car Racing", "name_original": "Extreme Mega Street Car Racing", "description": "Prove your skills in extreme mega street racing simulation game that lets you play and feel the closest and actual racing of the most powerful super racing cars.The most realistic racing and driving car simulator game to freely explore a whole city.Extreme mega street racing game play is very simple and ultra smooth.TRY this real fast street speed racing game which give you the most satisfactory experience. NOW!! join the car racing community and prove yourself as a driver.The thrilling racing experience which give you a chance to become the king of street racing.<br/><br/>Race in different modes of street scene. Show your rivals that you are the best in real competition with amazing speed.In extreme mega street racing there is three different racing modes in each mode there is different environment which give you a chance to test your fast racing skills to become a champion.<br/>!!  1st one is free racing mode in which you will test your fast racing skills.<br/>!!  2nd mode is one to one street car racing mode with multi-levels challenges.<br/>!!  3rd one is knockout mode in this racer game.<br/>You need to be focus on the track collect money and upgrade vehicle to drive even faster.To enhance the power and performance of racing cars you will have to earn coins.The faster you drive the more scores you get and you earn more coins.User can also unlock the amazing various tracks which will bring excitement to the race as user will explore various environment all over the globe.     <br/>ARE you ready to join the racing community?<br/>Game features of extreme mega street car racing. <br/>*  Real physics engine game.!<br/>*  Different tracks easy to hard !<br/>*  Tune up and unlock extra cars !<br/>*  High definition cars !<br/>*  Chase your opponents !<br/>*  Free racing mode !<br/>*  ONE TO ONE Street racing !<br/>*  Test your racing skills !<br/>*  Easy to control !<br/>*   It,s free !", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2019-10-22T14:05:31", "background_image": "https://media.rawg.io/media/screenshots/bc8/bc8b95478da46e6c90a8f8ff3b01d6a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ghulam Mustafa"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Ghulam Mustafa"], "esrb_rating": "Everyone 10+"}