{"id": 73701, "slug": "ancient-bowman", "name": "Ancient Bowman", "name_original": "Ancient Bowman", "description": "Its call for war! Experience the thrill of battle &amp; Prepare your ancient warrior army to take out the bow and arrow along with the vintage rifle to protect castle siege from the invader goblins and roman army knights. <br/><br/><br/>The roman army has invaded your castle along with the clan of goblins! be the ultimate ancient warrior, implement an advance defense strategy in this fantasy battle sim, with the accurate placement of your tiny gladiator and tiny archer protect your fortress fury from falling apart. The tiny troopers in the roman empire have decided to take over the glory of your castle. The armed goblins and knights are ready to take the greek heroes down. stretch the longbow and arrow to exhibit the brilliance of tower archery against the roman army with accurate archery simulation 3D, get 120 or more unarmed and take advantage of the unarmed players in the battle arena. pull the trigger of your vintage rifle in the epic battle to protect castle siege in this ancient archery game castle sim. <br/><br/><br/>You might have played another bow and arrow game or ancient archery game before, this wonderful graphical amalgamation of goblin games with castle defense strategy games is beyond fun. Set the tiny gladiator force to compete in the roman war and protect the fortress fury with your ancient war tactics. Play this bow and arrow game with great archery simulation in a 3D greek games environment, aim at your opponent in this tower archery shooter battle and get 120 unarmed in this castle sim. The tiny archer should get the unarmed players totally dead or else they can still attack your tower. Finish the goblins and roman empire warriors’ dead with your archery skills and get them knocked out of the way.<br/><br/><br/>To experience thrill of battle and the excitement of greek heroes and archers in a shooter battle against roman invaders, take your longbow and guns out to be the ultimate fighter in this fantasy battle sim right at your fingertips. DOWNLOAD the addictive Ancient Archers Game", "metacritic": null, "released": "2018-01-18", "tba": false, "updated": "2019-10-22T14:05:29", "background_image": "https://media.rawg.io/media/screenshots/289/2891f591f55c63c1e69d1522f1042cf3.jpg", "website": "https://www.facebook.com/ticklestudio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ghulam Mustafa"], "genres": ["Strategy", "Simulation"], "publishers": ["Ghulam Mustafa"], "esrb_rating": null}