{"id": 73700, "slug": "zic-zombies-in-city-shooter", "name": "ZIC: Zombies In City Shooter", "name_original": "ZIC: Zombies In City Shooter", "description": "«The zombies come at night, out of the fog... Zombie infection spread throughout the undead city and initiated a zombie apocalypse. Zombies ate my friends... The deadly virus has not touched only us and now only we the hope for all of humanity. We must stop zombie infection!»<br/><br/>ZIC: Zombies In City — it's first person shooter and zombie survival games genre. As the city is infected with zombie virus. Four characters unite to stand against zombie attack. Main goal - surviving in zombie apocalypse and safe world. <br/><br/>Walking dead everywhere... Life will bring together different people in the zombie killer squad, able to withstand the onslaught of the walking dead!<br/><br/>Game Features:<br/>- Endless story mode — interesting storyline about escaped survivors;<br/>- Zombie killer squad: 4 heroes with unique character and history;<br/>- 10 different zombie types, monsters and enemy marauder;<br/>- Large selection of letal guns — chainsaw, uzi, grenade, rocket launcher, AK-47, baton, machete, bat, pistol, revolver;<br/>- The change of day and night, boundless open world for exploration;<br/>- Characters voices, cutscenes and easter eggs;<br/><br/>WARNING!<br/>In the free game ZIC: Zombies in City contains adult material:<br/>- Murdering games - murder demonstration;<br/>- Showing blood;<br/><br/>You might want to close the access to it for your children.<br/><br/>Follow Us:<br/>FACEBOOK: https://www.facebook.com/groups/IOGamesDevelopment/", "metacritic": null, "released": "2017-06-23", "tba": false, "updated": "2019-07-29T17:46:46", "background_image": "https://media.rawg.io/media/screenshots/10f/10f03098090d62a65a19d12e767eb5ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Duhnich Dmitrij"], "genres": ["Action", "Adventure"], "publishers": ["Duhnich Dmitrij"], "esrb_rating": null}