{"id": 737059, "slug": "kaiju-architect", "name": "Kaiju Architect", "name_original": "Kaiju Architect", "description": "<p>Play as a Kaiju and build some cities following the blueprints your new tiny and fragile friends have given you!</p>\n<p>Instructions:</p>\n<ul><li>Move Bronty the Kaiju around the grassy knoll to set down buildings according to the blueprint on the bottom right hand corner of the screen.</li></ul>\n<p><strong>Controls</strong>:</p>\n<ul><li>Movement : WASD, Arrow Keys, Joystick??</li><li>Enter: Finish Level Early</li><li>E: To avoid placing down a building</li><li>Shift: Go fast!</li><li>Escape: Pause the game.</li></ul>\n<p>Known Issues:<br/></p>\n<ul><li>Fullscreen breaks UI. I hate UI. Drawing the UI is fun. Putting it into Unity and getting it to be consistent is not fun at all.</li><li>Scoring is kind of weird: You could  more than likely sit there mashing enter and get \"You did it! 75%\". Haven't been able to figure out the math to make it make sense. Eventually I will</li><li>You can hit two tiles at the same time by walking between them. I actually kind of liked this, so I didn't bother fixing it.</li><li>Main Menu Quit will crash the game. This game was initially targeted for desktop. But browser is more widely accessible, and also I didn't want to poison your disk space with this game.</li><li>Logo is ontop of credits. It's 2:17 am on Feb 9th. I'm not fixing it lol.</li><li>Enter is not disabled on the Introduction screen. LOL</li><li>E ability will not register the current non-building occupied tile you are on.</li><li>That's about it I don't know of any other problems .</li></ul>\n<p>Audio: <br/></p>\n<p>(Contrary to whats in the credits) There is none! Enjoy the deafening silence as you destroy precious  and pure land with concrete monoliths!</p>\n\n<p>Note from the Author: <br/></p>\n<p>Please enjoy this UI Artstyle clashing, glue tape and cardboard game I wrapped together last minute, because I decided joining this jam on the 6th was a brilliant idea! I had a lot of fun learned a whole lot from it, like not trying to fit so much into 3 days.  Not gonna promise I'll come back to this and properly finish it.<br/></p>\n<p>Happy to get back into the swing of things with game jam. Hope to be joining (and hopefully finishing) more in the future!<br/></p>\n<p>-blazinmeow</p>\n<p>Credits:</p><p>It's just me on my lonesome.<br/></p><p>Lessons Learned:</p>\n<ul><li>3 Days is too little for me</li><li>UI is pretty dang hard</li><li>Murphy's Law</li></ul>", "metacritic": null, "released": "2022-02-09", "tba": false, "updated": "2022-02-11T07:35:41", "background_image": "https://media.rawg.io/media/screenshots/8a2/8a2672ccc32d848c673c7cb62d19a3de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["blazinmeow"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}