{"id": 737154, "slug": "through-the-portal-goldendonkeyproductions", "name": "Through The Portal (GoldenDonkeyProductions)", "name_original": "Through The Portal (GoldenDonkeyProductions)", "description": "<p><strong>Consider playing the prequel to this game: Three Stones.</strong><br/></p>\n<p><em>Previously in the three stones saga you traveled through a portal. It was believed this portal gained you riches and allowed you pay your debt but those beliefs couldn't have been more wrong! The portal sends you forwards through time and space to a different country, where your father appears to have been dragged by a giant kaiju all those years ago. Are you ready to face the monster that your father could not, or should you train and help the citizens of this work?</em></p>\n<p>This game is a small rpg game purely about fighting monsters, exploring the world, collecting loot, upgrading your weapons and the finally releasing a kaiju from it's sleep. Currently this game was made for a jam and is lacking things like audio or the final boss fight, if this game turns out well received I will probably improve it with these and maybe a bit more content / bug fixing. This is the start of the Alactra story, intertwining many golden donkey productions games, so expect more in the future!</p>\n<p> <strong>How to play</strong><br/></p>\n<p>Many villagers are around this world happy to help you and give you instructions, but here is the controls since this is a jam game:</p>\n<ul><li>WSAD / Arrows - Move</li><li>Mouse - look</li><li>E - Inventory</li><li>F - Interact with NPCs</li><li>Left Click - Weak Attack, Interact with shop keepers.</li><li>Right Click - Heavy Attack</li><li>ESC - pause<br/>\n</li><li><em>Left click and drag to move items in inventory, right click for more information and to use it.</em></li></ul>\n<p><strong>As there is no audio I recommend listening to my favourite band \"Starset\" on whatever streaming service you own! I listened to their music throughout this games development, so why don't you while you play it! (Any other heavier, upbeat music will so fine too)</strong></p>\n<p><em>Build 2 notice: After submitting the game I realised there was a couple game breaking bugs introduced in the nightmare that was Unity on the night of the end of the jam. I have uploaded a build 2 that fixes those bugs and nothing more. I still plan on introducing sounds and other \"niceties\" to the game in the future! HAVE FUN!</em><br/></p>", "metacritic": null, "released": "2022-02-09", "tba": false, "updated": "2022-02-11T08:01:45", "background_image": "https://media.rawg.io/media/screenshots/147/147a07360f529c50bb9b5dfe3c1a20da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GoldenDonkeyProductions"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}