{"id": 73729, "slug": "jason-killer-horror-house-game", "name": "Jason Killer Horror House Game", "name_original": "Jason Killer Horror House Game", "description": "Sinister grin, terrifying mask, weapon splashed with something blood-like… You are a real horror of this awful country house! Your madness is whispering to you: kill or be killed! Listen to your inner voice, find all these weak people, wreak panic and havoc and just have fun playing Jason Killer Horror House Game!<br/>Become the fear itself! You are really strong and fantastically horrifying scary maniac, but not all your ‘guests’ are that simple and inoffensive: some of them are really aggressive to you! Seek your prey being really noiseless and have fun playing Jason Killer Horror House Game!<br/>You are the death itself! Grab your knife or chain saw or forcer and show them all who is the boss here! Destroy, slash and shred the bodies till the death! Watch these stupid people carefully, because they can call the 911 – so when the police arrive, you’d be dead immediately! Kill them all before the police come and become the most blood-thirsty and crazy maniac the world ever knew!<br/>Be really accurate to earn as much points as possible and unlock new powerful weapon such as forcer, machete, bat or axe! Power up such personal characteristics as speed, noise level, stealth and hunter mode to make this place really dangerous!<br/>Jason Killer Horror House Game features:<br/>•\tAmazing crazy maniac killer simulator game<br/>•\tDifferent types of rivals<br/>•\tWide range of weapons for more fun<br/>•\tRealistic 3D graphics<br/>Stupid humans thought that anybody is home, so now they should be ready to say ‘hello’ to their worst nightmares! Here you have a unique chance not to be a victim, but to be the maniac himself, so unleash your crazy fury and turn the life of every poor tourist into the hell before the police or SWAT arrive!<br/>Welcome to the worst nightmare of every human being – neglected country house, which actual host is the real mad maniac! Become this maniac and destroy everything alive with Jason Killer Horror House Game!", "metacritic": null, "released": "2017-06-07", "tba": false, "updated": "2019-08-12T04:47:31", "background_image": "https://media.rawg.io/media/screenshots/9dc/9dc0bab10aac49d29823e0a3e93521f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayga Games OOO"], "genres": ["Simulation"], "publishers": ["Tayga Games OOO"], "esrb_rating": "Teen"}