{"id": 73734, "slug": "cube-survival-story", "name": "Cube Survival Story", "name_original": "Cube Survival Story", "description": "Civilization is dead. You are the last bulwark of humanity. You and your gun. The inhospitable world outspread around wants to devour you. The only person who can help you survive is yourself. You, the last remaining human, will need to adapt to the environment, inhabited by the living dead, mutants and wild animals not yet reached by the virus. When danger lurks around every corner and every step may be your last one, the only thing that matters is to survive at any cost!<br/><br/>– Build your own base and make it a survivor’s unassailable fortress. Having your own house is a necessity, as there are hordes of zombies prowling about out there. Obtain resources and wall your own piece of uncontaminated land to hide from endless fights with the undead and store treasures acquired in travels and exploration of game locations. <br/><br/>– Get a lot of materials on hand to assemble everything necessary for survival. In the hostile environment one should always stay alert. Learn new recipes and blueprints, make unexpected decisions and show zombies what every drop of the last survivor’s blood is worth! <br/><br/>– Explore the huge global map, every section of which is full of surprises. Fight various monsters guarding treasures, essential for staying alive. Special abilities of the walking dead make the outcome of battles uncertain, so you never know whether the next fight will be your last one.<br/><br/>– Gain experience and develop your character. Every zombie defeated, every tree cut and every stone shattered make you stronger and let you throw yourself a new challenge. Develop your skills and do whatever it takes to claim your place at the top of the food chain back!<br/><br/>This hostile world craves for salvation, and you are the only one who can save it. In this war all means are permitted. It’s time to take the destiny of mankind in your own hands and reclaim the title of the pinnacle of evolution. Put aside all doubts and take up the gun – the time has come to show murderous monsters what the last remaining human is capable of!", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-10-22T14:05:33", "background_image": "https://media.rawg.io/media/screenshots/a90/a90eb2e4f18310457d808b8814a05129.jpg", "website": "http://mishka-production.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Mikhail Talalaev", "Mishka Production"], "genres": ["Action", "Adventure"], "publishers": ["Mikhail Talalaev"], "esrb_rating": null}