{"id": 737572, "slug": "archon-evolution-3d-prototype", "name": "Archon Evolution 3D (Prototype)", "name_original": "Archon Evolution 3D (Prototype)", "description": "<p><strong>+++ Introduction</strong></p>\n<p>I guess some (or maybe more) people know this game! Archon has been a legacy on classical computers. I will provide a small blogpost about my motivation on re-creating this game, but</p>\n<p>TLDR: This is my 3D prototype where I tried to build a game in the spirit of Archon.</p>\n<p>This is far from being finished and it has it's problems, but if you are interested in playing this prototype and providing some feedback about it, I can use this when continuing it. </p>\n<p>My approach was to build as fast as possible a prototype that covers most of the game mechanics to proof that this game ist still fun nowadays.</p>\n<p><strong>+++ How the game works</strong></p>\n<p>Each player takes control of one of 2 factions and plays either the light or the dark side. The figures are placed on a chess board. </p>\n<p>Players take turns moving their figures and try to beat the opponent. </p>\n<p>If 2 figures are on the same field, one not only wins. Instead they are transported to a battle arena, where they fight. The winner keeps the field.</p>\n<p>Lost energy is persisted.</p>\n<p><strong>+++ Not implemented from Archon</strong></p>\n<ul><li>Light and dark influence of the fields (light dark cycle)</li><li>Spells</li><li>Winning the game by occupying the power spots</li><li>Flying units</li></ul>\n<p><strong>+++ Controls</strong></p>\n<p>It is best played in local couch co-op model.</p>\n<p>Controls are required for moving the selector on the board and selecting/de-selecting figures. The same controls are used to move and attack.</p>\n<ul><li>Player 1 uses WASD and left control</li><li>Player 2 uses cursor keys and right control</li></ul>\n<p>This game is implemented with controller support, but it is very raw and I can't guarantee that it will recognize your controllers. I tested it with the X-Box controller but since I am still using Unity old input system, the integration is bad.</p>\n<p>There is also an AI implemented for Player2 if you want to try out, but this AI is very stupid and brute force. In addition to this: If you play against an AI, the fact that the game is not \"perfectly\" balanced becomes a real problem :-D</p>\n<p>You can also choose no players and watch how the crappy AIs kill each other.</p>\n<p><strong>+++ Feedback</strong></p>\n<p>Please use the comment section on the game page to drop your feedback. I appreciate this!</p>", "metacritic": null, "released": "2022-02-07", "tba": false, "updated": "2022-02-11T09:59:31", "background_image": "https://media.rawg.io/media/screenshots/333/3331afbc350208c738d5b2d3fd4e8f2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["firegate666"], "genres": ["Action"], "publishers": [], "esrb_rating": null}