{"id": 737644, "slug": "conveyor-belt-game-prototype", "name": "Conveyor Belt Game Prototype", "name_original": "Conveyor Belt Game Prototype", "description": "<p>NOTE:</p>\n<p>The game has compatibility issues with certain browsers. Here is a list of browser of compatible browsers:</p>\n<ul><li>Google Chrome<br/>\n</li><li>Microsoft Edge<br/>\n</li><li>Opera GX</li></ul>\n<p>If you are using Brave or another browser and the game does not work, open the game in another browser. </p>\n<p>This prototype was designed to test a game concept where two pong-like paddles try to catch incoming packages while slapping packages back to throw each other off. In this prototype, there are 4 modes:</p>\n<p>Single Player: 1 Player controls both paddles. The player must catch the incoming packages; the faster the package caught, the greater the score earned. The speed of the packages can be increased by slapping them away from the paddles. If the player misses 3 packages, then the game restarts. </p>\n<p>CO-OP: Same rules as the Single Player, except with two players. One player controls the left paddle, while the second player controls the right paddle. Both players try to work together to earn the highest score possible. </p>\n<p>VS: 2 Players  compete in getting the highest score. Players can slap packages back to try to throw the other player off. First person to miss three packages loses. </p>\n<p>VS. AI: Same rules as VS mode, except with an AI opponent. The AI has have 5 difficulty settings, affecting their ability to catch and slap packages, ranging from Very Easy to Very Hard. </p>\n<p>CONTROLS:</p>\n<p>W - Move left paddle up</p>\n<p>S - Move left paddle down</p>\n<p>D - Slap left paddle</p>\n<p>Up Arrow - Move right paddle up (Single Player, VS, and CO-OP only)<br/></p>\n<p>Down Arrow - Move right paddle down.</p>\n<p>Left Arrow - Slap right paddle</p>\n\n<p>Escape: Pause Game</p>", "metacritic": null, "released": "2022-02-07", "tba": false, "updated": "2022-02-11T10:16:14", "background_image": "https://media.rawg.io/media/screenshots/4ad/4ad2757ab5a96e24297bda9171d2dfef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Blast Studio Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}