{"id": 73766, "slug": "pirate-kings", "name": "Pirate Kings", "name_original": "Pirate Kings", "description": "<p>Ahoy Mateys! Be a Pirate King in this Swashbuckling Adventure Game!<br />\n•   Spin the wheel for big wins and master your own island adventure - it&#39;s Pirate Kings!<br />\n•   Collect coins and other prizes to build up your island! You can even play with friends!<br />\n•   With bonuses, prizes and fun aplenty, claim the seven seas and raid your friends’ loot in this island adventure!<br />\nBonuses and Loot A-Plenty In This Epic Island Adventure Game!<br />\n•   Get daily bonuses and spin the wheel every hour! Win coins, master and upgrade your island, win chances to attack and more in the coolest pirate game of the seven seas!<br />\n•   Get the chance to rob your friends’ islands: spin the wheel and win up to 100k coins on every spin! Use your coins to master your island’s defenses, upgrade pirate ships, and even your parrots!<br />\n•   Upgrade your entire island for bigger, better islands - and then defend them (from your friends’ revenge attacks)!<br />\n•   Complete island adventure game Pirate Quests! Damage your friends’ islands, and steal their stuff, then upgrade your own items for even more glorious pirate game goodies!<br />\n•   Win big with the Island Tales Pirate Album! Each new album tells a pirate story - collect cards as you complete quests for HUGE extra building games rewards!<br />\nLove pirate games? Love pirate games with friends? Play Pirate Kings!<br />\nAttack, Steal and Defend When You Play With Friends - It’s a Pirate’s Life!<br />\nLove playing adventure games with friends?<br />\n•   Master this truly pirate-tastic building game island adventure in Pirate Kings -  it&#39;s even MORE fun when you play with friends, and STEAL THEIR STUFF! This is Pirate Kings - the multiplayer game where you can attack your friends’ islands!<br />\n•   Spin the wheel to play games with friends and...<br />\n•   Attack your enemies (or your Pirate Kings friends!) - choose where to fire your cannon, and loot away!<br />\n•   Steal coins from the Cash King! Pick where the Cash King is hiding, and you’ll get to steal his bounty!<br />\n•   Steal coins from other players too! No need to attack - just choose what your heart desires, and steal it for yourself! Enjoy building games as you&#39;ve never played before in Pirate Kings, the coolest coin game on the high seas!<br />\n•   Get in the adventure game spirit - and loot, steal and attack too! What else are island adventure multiplayer games and coin games for?<br />\nPirate Games to Play with Friends..and Defend What’s Yours<br />\n•   Pirate Kings is the coolest way to play games with friends -  master this multiplayer game with a difference!<br />\n•   Get your Facebook friends to join you for even more goodies, spin the wheel and then steal their pirate stuff!<br />\n•   Master your Mateys’ islands! Steal their good stuff (and coins) for yourself - it&#39;s a pirate’s life!<br />\n•   Defend your islands from your Matey’s return attacks! It’s a pirate game, after all!<br />\n•   Send coins and gifts to your mateys when it suits you - who said pirates were bad? Everything goes in the most pirate-tastic of multiplayer games and building games!<br />\nSpin the wheel hourly for a new island adventure every day in Pirate Kings, the coolest coin game around!</p>", "metacritic": null, "released": "2013-11-14", "tba": false, "updated": "2023-02-09T02:31:25", "background_image": "https://media.rawg.io/media/screenshots/de8/de8607026c527bae723a6a860246e433.jpg", "website": "https://www.jellybtn.com/cashking/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Jelly Button Games"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["Jelly Button Games"], "esrb_rating": "Teen"}