{"id": 7376, "slug": "war-of-eclipse", "name": "War of Eclipse", "name_original": "War of Eclipse", "description": "People say<br/>- Another great game from Game Stew - by DarkDjango<br/>- An excellent follow-up to the quirky Tower of Fortune - by Retr0spective<br/>- Fantastically retro - by Stumpyjay<br/>- Great minimalist pixel art. Sharp looking game - by ForestRayColson<br/>- Gonna buy tower of fortune just because its from the same guys!!!! - by Droskie<br/>- Hard as heck but wonderful! - by Admiral Snackbar<br/>- Just as fun as Tower of Fortune! And just as addicting! - by Juliet M<br/>- Original and fun - by 4ppleseed<br/>- The gameplay is much deeper than what you see on the surface. Can't stop playing!! - by MilkcanRocks<br/>- Very charming and elegant - by Ponder_Rosa<br/> <br/>Review<br/>- War of Eclipse is great - by 148Apps, 4/5<br/>- ... a near perfect balance between casual distraction and hardcore game - by AppsHappens<br/> <br/>Appstore Customer Ratings<br/>Average rating for all versions: 4.5/5<br/> <br/>----------------------------------------------------------- <br/>War of Eclipse is a retro style game that combines timing action, role playing, and adventure elements. You play as a captain who crashed in a battle but is saved by human survivors. As the fight against the aliens wages on you will unveil the truth about the war for the human world.<br/><br/>Features<br/>- One button gameplay that is easy to learn and play<br/>- Retro style pixel graphics with detailed 8 bit art<br/>- Challenge high scores in survival mode and see your ranking in the world<br/>- Detailed tutorial and tips that are available at any time<br/>- 7 air battleships to build and customize, including one ultimate battleship<br/>- 7 endings to discover, see the story and experience the possibilities from different angle<br/>- 35 enemy types to fight; they will shoot, charge, and ambush you, and also bomb your base<br/>- Collect lost data that unveils the history behind the aliens and human world<br/>- Random equipment includes: 20 kinds of parts combine with 50 kinds of abilities and 10 LV upgrade<br/>- Different challenges during the battle, such as avoiding an ambush, battling in a lightning storm, and destroying the falling boss enemies before atmospheric friction burned you<br/>- 20 achievements to conquer!<br/><br/>-----------------------------------------------------------<br/>Facebook <br/>http://www.facebook.com/WarofEclipse<br/><br/>Gameplay Video<br/>http://youtu.be/urCha_Bqdzg", "metacritic": null, "released": "2012-11-09", "tba": false, "updated": "2019-10-22T14:29:19", "background_image": "https://media.rawg.io/media/screenshots/c5a/c5a24a60ce5e622b121dd4c4ec1f0141.jpeg", "website": "http://www.facebook.com/WarofEclipse", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Stew"], "genres": ["Action", "Adventure"], "publishers": ["GUAN LING WU"], "esrb_rating": "Everyone 10+"}