{"id": 737685, "slug": "the-bizarre-raid", "name": "The Bizarre Raid", "name_original": "The Bizarre Raid", "description": "Story\r\n<p>On an ordinary night, a spaceship landed in a forest, and some creatures called Snoopers came down from it. They came to the earth searching for a weird mineral that will give them the power and ability to control the universe's laws as they please. This situation caused the world to get into an emergency state and the world powers began to take action, however,  the snoopers had the advantage with their technology and caused an epic invasion, a <strong>raid</strong>. At some point, the world was in a critical situation, with every country weak, it seemed that there was no future for the world.</p>\r\nDefeat them\r\n<p>In The Bizarre Raid, you get the place of a survivor of the invasion, which is determined to take action on the invasion. You will use the Snoopers technologies and your skills against it.</p>\n<p>Use their Fireballs and BURN them. Use their wood boxes and SMASH them. Use your reflexes and EVADE them. And, use all of the above to DEFEAT them!</p>\r\nCustomize yourself\r\n<p>Besides, you will be able to customize the look of your player. The more you play the more customization objects you will get, due you will get coins for every Snooper you kill!</p>\r\nAND MORE!\r\n<p>In The Bizarre Raid, everything has an interesting story, and in the Discovery Diary, you will know them. Besides, some secrets will get discovered if you are curious enough.</p>\n<p>And more stuff is waiting for you in <strong>The Bizarre Raid</strong>.</p>\n\r\nExtra information\r\n<p>The game will get updates fixing bugs and, every so often, some content updates will come.</p>\n<p>You can submit your issues with the game on the \"Issue tracker\" community subcategory.</p><p>If do you like the game, please, share it!</p>", "metacritic": null, "released": "2022-02-07", "tba": false, "updated": "2022-02-11T10:27:30", "background_image": "https://media.rawg.io/media/screenshots/e52/e5273f834c1db466c76d608b5b8929f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android"], "developers": ["The Shoddy Box"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}