{"id": 73776, "slug": "cooking-diary-tasty-hills", "name": "Cooking Diary: Tasty Hills", "name_original": "Cooking Diary: Tasty Hills", "description": "FASCINATING STORY<br/><br/>Your grandfather has invited you to Tasty Hills to fulfill your dream of becoming the greatest chef in history. Solve the mystery of the collapse of his restaurant empire, make new friends, and battle cunning competitors. Prove your skills before a tough but fair culinary critic.<br/><br/>UNIQUE GAMEPLAY<br/><br/>Cooking Diary is a fast-paced, exciting time management game. Put your multitasking skills to the test. Prepare dozens of fabulous dishes with your grandfather and assistants to win your customers' hearts. Join a culinary guild or create one of your own and enter thrilling competitions.<br/><br/>SATISFY YOUR CUSTOMERS<br/><br/>Open new restaurants, decorate them to your liking, and become the best chef in Tasty Hills! Put a new sound system in your restaurant to satisfy your customers' musical tastes and get better tips, or get a brand new TV to entertain your customers while they wait for their orders. Be the interior designer of your very own restaurant! Redesign your walls and floors and decorate your eatery with eye-catching paintings and curtains.<br/><br/>CULINARY FASHION<br/><br/>Become the chicest chef in town with HUNDREDS of different articles of clothing and accessories. Grow a beard or a mustache or change your hairstyle, eye color, or even the shape of your face!<br/><br/>KEY FEATURES:<br/><br/>- Open your very own dream restaurant with a unique design and delicious dishes<br/>- Decorate your restaurants to suit your taste<br/>- Customize your character's appearance with 300+ articles of clothing and accessories<br/>- Enter culinary guild contests<br/>- Regular free updates<br/><br/>Start your journey and create your very own fascinating story in Cooking Diary today!<br/><br/>Join us on social networks to keep up with the latest news from Tasty Hills:<br/>https://www.facebook.com/CookingDiaryGame/<br/>https://www.youtube.com/channel/UC_4hNXHvg5xwDy4qDSsi83w<br/>https://www.instagram.com/cookingdiary_official/", "metacritic": null, "released": "2018-08-07", "tba": false, "updated": "2019-10-22T14:24:34", "background_image": "https://media.rawg.io/media/screenshots/162/1620e0ce28f5f94dbf4264a22c286798.jpg", "website": "http://www.mytona.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["MyTona"], "genres": ["Adventure", "Simulation"], "publishers": ["MyTona Pte"], "esrb_rating": null}