{"id": 73787, "slug": "bounty-bots", "name": "Bounty Bots", "name_original": "Bounty Bots", "description": "**** 3 Epic Wild West Locations to Duel it out with your friends! **** <br/>**** Easy Play Single Player Training Mode! ****<br/><br/>Make your fortune in the Welded West! <br/><br/>Take part in the classic tale of greedy robotic desperados hurling explosive cacti and toxic goo at each other in the historic frontier town of Deadbolt. <br/><br/>Okay, so maybe it's not so classic, but Bounty Bots is a frantic multiplayer action game with outrageous weapons and zany powers in a West that never was. Customize your 'bot, choose your weapons, and get rich in the craziest shooter available on mobile devices.<br/><br/>• Full Resolution Retina Support for the New iPad <br/>• Full Resolution Retina Support for the iPhone4 and iPhone4s <br/>• Multiple paths to victory. It's not all about who's the fastest on the draw (although that helps) <br/>• An action game world unlike any you've ever seen <br/>• For the quickest draw, take advantage of weapons with the Apaxmai Auto-Firing Sniper Chimps <br/>• For the more skilled, the manual fire weapons have more firepower than a chimp can handle <br/>• Dozens of strange weapons and powers for you to mix and match to customize your bot <br/>• Smooth online multiplayer from the studio that brought you the IOS first person shooter hit, \"Archetype\" <br/>• Simple controls quickly get you into the action <br/>• Explosive cacti! SO MANY EXPLOSIVE CACTI! <br/>• Free to play. No fooling, play as often as you like. No film-flam, hustle, grift, or bamboozlin' <br/>• Earn a badge every day on the first round that you finish <br/>• Earn 3 badges every time you level up<br/><br/>Game runs on iPhone 3GS, iPhone 4, iPhone 4S, iPad 1, iPad 2, iPod Touch 3rd generation or newer running iOS 4.3 or later. Needs an active 3G or Wifi connection to play.<br/><br/>------==Gameplay Tips==------<br/><br/>• Coins collected need to be deposited in one of them banks! <br/>• Coins banked will be yours when the round ends! <br/>• If you're an early quitter, you forfeit your winnings <br/>• XP is earned by picking up coins, even if they aren't banked <br/>• You can get significant bonus by depositing more coins at once, but you also become a bigger target<br/><br/>Many new features are in the works. Please help Bounty Bots grow by rating us favorably in the App Store or sending feedback from the settings menu. Also use the feedback to let us know what features you would like to see or go to Facebook or twitter to take part in the Bounty Bots community.", "metacritic": null, "released": "2012-04-05", "tba": false, "updated": "2019-07-29T17:36:12", "background_image": "https://media.rawg.io/media/screenshots/843/843f4a8bd1d9cf27aa8a7c33e167eb22.jpg", "website": "http://www.munkyfun.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MunkyFun"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["MunkyFun"], "esrb_rating": null}