{"id": 7378, "slug": "jake-escapes-hd", "name": "Jake Escapes HD", "name_original": "Jake Escapes HD", "description": "Support us and rate the game!<br/><br/>A new and original arcade action game with a unique grindhouse visual style.<br/><br/>&amp;quot;Featured in AppsGoneFree. Your daily free app resource&amp;quot;<br/><br/>------- PRESS QUOTES ----------<br/><br/>Apple’n’apps: 4 out of 5<br/>Jake Escapes is a brilliantly designed iOS game that is a wonderful change of pace that stands out from the pack. The game perfectly suits iOS, and there are so many different aspects to enjoy. Jake Escapes is a should buy that is a thoroughly engaging and unique adventure that is begging for more content.<br/><br/>Apptudes  (4 out of 5 - users 5 out of 5)<br/>If there’s one bothersome aspect of the App Store, its the lack of originality. Many developers are content with releasing tweaks on the same formula, which makes for a platform cluttered with cheap clones. Just Funny Games must’ve read my mind: their new release Jake Escapes (universal) is an original piece of work, both in its gameplay and its presentation.<br/><br/>Appstorearcade.com (8 ½ out of 10)<br/>I’m just going to come out and say it, no clever paragraph transitions or anything like that. I’m exhilarated that Jake Escapes HD feels and plays like it’s conceived for touch devices!<br/>Jakes Escapes brings a remarkably new enjoyable experience over to the iPhone ad iPad. Smile.<br/><br/>Appshack<br/>Graphics-wise, the game looks great. Each of the character models are well designed, and the buildings have plenty of detail....The music and sound effects also go along perfectly with the graphic look and feel of the game......it really is a nice flowing, highly entertaining game with fantastic cut-scenes, a nice story, and great gameplay.<br/><br/>Mac-talks.com<br/>Jake Escapes is a great pick-up-and-play game that’s plenty of fun, and well worth its $2 price tag.<br/><br/>-----------------<br/><br/>Meet Jake, the world&amp;#39;s greatest thief. In fact he is such a good thief that he has become somewhat bored with stealing altogether and he is now desperate for the ultimate challenge.<br/><br/>Then there&amp;#39;s Doc, Jake&amp;#39;s friend and clever scientist. Doc managed to crack the Echelon Network and discovered the existence of an alien artifact known only as the G.R.A.I.L., hidden away in Area 51.<br/>Stealing the G.R.A.I.L. is the least of Jake&amp;#39;s worries; dealing with its awesome power is another matter entirely! Oh yeah, and the Crime Lords...<br/><br/>When the news of Jake&amp;#39;s daring heist - and the existence of the G.R.A.I.L. - is revealed it seems everyone wants to get their hands on the mysterious artifact, including the most dangerous and devilish Crime Lords across the globe!<br/><br/>Then there&amp;#39;s Bob. The U.S. Government is determined to capture Jake and recover the G.R.A.I.L. by any means, even if that entails unleashing the legendary and unfailing Secret Agent Bob! Watch out, Jake!<br/><br/>3d graphics<br/>- in stunning HD compatible with the New iPad retina display.<br/><br/>A comic adventure<br/>- build your story by completing the jobs in any order you like and watch it unfold through colorful comic-style cut scenes.<br/><br/>Unique gameplay<br/>- use intuitive touch screen controls to stay ahead of the chase!<br/>- complete jobs by collecting items and help solve the G.R.A.I.L. enigma.<br/>- tap on enemies to have Doc blast them.<br/>- defeat the deadly Crime Lords in challenging battles.<br/>- climb, dodge, jump and fight as you scale the skyscrapers of each Crime Lord.<br/><br/>An original soundtrack<br/>- feel the world of Jake Escapes come to life!<br/><br/>Think you can handle the chase? It&amp;#39;s time to get in shape. The escape starts now!", "metacritic": null, "released": "2012-05-10", "tba": false, "updated": "2019-10-22T14:29:19", "background_image": "https://media.rawg.io/media/screenshots/caa/caad55e501e88d93dc924876264efa7a.jpeg", "website": "http://www.justfunnygames.com/jake-escapes", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Just Funny Games"], "genres": ["Action", "Arcade"], "publishers": ["Just Funny Games"], "esrb_rating": "Teen"}