{"id": 738039, "slug": "hands-of-war-3", "name": "Hands of War 3", "name_original": "Hands of War 3", "description": "<p>Hands of War 3 is the sequel to Hands of War 2, released in March of 2013. There was going to be an Expanded Edition of the game, with a new faction (the Keepers of the Red Sand) and a new land to explore. However, it was cancelled in favor of a fourth main game. </p>\n<p>Hands of War 3 is different from the previous two main games. The first noticeable change is that the player can choose their gender (with dialogue options being similar for both genders, however), something new to the Hands of War series. The second is that the graphics are scaled-up, and look a lot more realistic than the previous games.</p>\n<p>Whereas before clicking with the mouse fired an attack, it now is used to move the character (the arrow keys can also be used too). Another is that the player could talk to NPCs by walking up to them before, but now has to click on the NPC to talk to them. Quests can now also be responded to, with multiple choices that will slightly affect the player&#39;s reputation depending on how they respond to a question.</p>\n<p>As in the first game, Hands of War, each time you level up, all stats you can upgrade with points are increased by 1. You can also reset the points you get by leveling whenever you wish, as in Hands of War Tower Defense.</p>\n<p>The mathematics are also slightly changed, for an overview, see Hands of War 3 Mathemathics.</p>\n<p>The factions the player ally will not just affect the storyline, but also which skills you can learn. There are now Faction Merchants in every faction that sell you skills and items for Faction Emblems.</p>", "metacritic": null, "released": "2013-03-01", "tba": false, "updated": "2022-02-12T04:03:07", "background_image": "https://media.rawg.io/media/screenshots/4e0/4e0ac3d2395e003ad600acc655af113e.jpg", "website": "https://www.newgrounds.com/portal/view/614993", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}