{"id": 738015, "slug": "mario-adventure", "name": "Mario Adventure", "name_original": "Mario Adventure", "description": "<p>As of 2006, this is hailed as one of the greatest NES hacks of all time. This Super Mario Brothers 3 hack changes the game right down to the core by tweaking the actual game engine itself!</p>\n<p>Aside from the ‘typical’ graphics and text changes, this hack alters musical melodies, a full line up of all new levels, new power ups, new abilities for Mario, and even new enemies! When I say new, I’m not talking about changed graphics; I’m talking about completely new power ups and monsters. Money mushrooms, invisible Mario, time stopping potions, Kuribo shoes in any level that don’t disappear, shy guys that create projectiles, heat seeking bullet bills, and others are just the beginning of the changes made to this game.</p>\n<p>On top of that, you have random weather patterns on every stage, boss battles on every stage, and infinite lives, so your coins go to more useful purposes. They will be used to buy items from Toad’s house and get some level exits to appear. Let’s not forget stored, and switchable, power ups such as those found in Super Mario World!</p>\n<p>This description really doesn’t do this hack justice. It’s certainly impressive to say the least. Just download it and try it out! It’s definitely one of the most advanced SMB3 hacks to date and pretty darn fun as well!</p>", "metacritic": null, "released": "2004-01-01", "tba": false, "updated": "2022-02-11T18:42:33", "background_image": "https://media.rawg.io/media/screenshots/dd0/dd05d60b5b91dfd15f61edbce49e3cf7.jpg", "website": "https://www.romhacking.net/hacks/70/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "NES"], "developers": [], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}