{"id": 738041, "slug": "he-man", "name": "He-Man", "name_original": "He-Man", "description": "<p>Join new facebook page to comment and suggest ideas more convenient :</p>\n<p>https://www.facebook.com/pages/HeMan-SheRa-VideoGame/689118917790572?ref=hl</p>\n<p>Comes with map of Eternia, Versus Fighting mode, shooting/riding stages ( 28 total on map) and Giant Bosses.</p>\n<p>He-Man, Man-At-Arms, BattleCat, Sorceress, Skeletor, Evil-Lyn, She-Ra , Ram-Man , Teela and Lion-O are playable now.</p>\n<p>Characters requests or special moves requests are welcomed especially now when i&#39;m creating characters and figuring out all animations and special moves.</p>\n<p>There is windows version heman-pc.zip for windows operating system and android version hemanshera.apk  for tablets and smartphones to download .</p>\n<p>You need at least 1.5ghz device or dualcore like galaxy s2 to play the game on Android, its in 960x480 resolution and older phones and other devices that wont support that resolution cant handle it (first galaxy i9000 cant) and gameplay is choppy , skipping frames and overall not that enjoyable.</p>\n<p>Some sprite animations can be seen on http://bwwd.deviantart.com/gallery/</p>\n<p>More recent info:<br />\nhttp://www.chronocrash.com/forum/index.php?topic=1299.0</p>\n<p>You can also subscribe on YouTube to get most recent info and video updates about the game and visit my other games.</p>\n<p>All animations and sprites were made using fantastic Stickman software made by  Sven Nilsen   thats available on CutoutPro website http://www.cutoutpro.com/download.html</p>\n<p>Also with great software called Spriter from Brashmonkey</p>\n<p>https://brashmonkey.com/</p>\n<p>Music and Backgrounds come straight from the show cel scans or screengrabs for 100% authenticity.</p>\n<p>Thanks for playing. You have the power !</p>", "metacritic": null, "released": "2013-11-20", "tba": false, "updated": "2022-02-12T15:41:49", "background_image": "https://media.rawg.io/media/screenshots/9f7/9f7a2f25f418de002f658e08dbb446b2.jpg", "website": "https://gamejolt.com/games/he-man/19434", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action"], "publishers": [], "esrb_rating": null}