{"id": 738181, "slug": "2030-la-mutacion-del-covid", "name": "2030: La Mutación del Covid", "name_original": "2030: La Mutación del Covid", "description": "<p>Han pasado seis años desde que el SARS-COVID-19 irrumpió en la vida cotidiana de la humanidad. Al principio los gobiernos del mundo decidieron que la mejor opción era aislarnos y evitar los contagios hasta que la vacuna llegara. A pesar de no contar con el tiempo necesario que requiere una vacuna, diferentes empresas privadas y laboratorios estatales lograron traer una decena de ellas en tiempos record. Las muertes en las Unidades de Terapia Intensiva (UTI) disminuyeron como los contagios. La vida volvió a su antigua normalidad, pero no duró demasiado. En diferentes puntos del planeta los casos de personas con movimientos involuntarios, déficit de racionalidad y acciones violentas asolaron cada país. ¿Fueron las vacunas o fue el mismo virus que mutó? Ya es demasiado tarde para buscar una respuesta. Es hora de una solución definitiva. Y aquí estamos, mi estimado amigo, luchando con la única solución que se pudo encontrar: pistolas automáticas con vacunas nucleares de origen ruso. Nadie todavía pudo encontrar una explicación, pero de alguna forma ayudan a eliminar el efecto zombie de las personas y retrotraerlos a su etapa de normalidad. Solamente es necesario un disparo y quien sea alcanzado recobrará su humanidad, como si de revivir se tratara. Somos de los pocos que han sobrevivido en esta zona y posiblemente en el mundo.\r\n</p>\n<p>Controles:\r\n</p>\n<p>A-D: Movimiento izquierda a derecha.\r\n</p>\n<p>Barra espaciadora: Saltar\r\n</p>\n<p>Click izquierdo: Disparo\r\n</p>\n<p>Integrantes:\r\n</p>\n<p>Herr_Bardo: Programación\r\n</p>\n<p>Shisho: Game design, búsqueda de assets\r\n</p>\n<p>Sapukái: Artista 2D\r\n</p>\n<p>Arestuck: Narrativa\r\n</p>\n<p>Pepper: Game design, programación, música\r\n</p>", "metacritic": null, "released": "2022-02-14", "tba": false, "updated": "2022-02-14T03:55:07", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c447db4b6c6fc29ec3b6ef4343f7588.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pepper", "Sapukai", "Arestuck", "Shishodev"], "genres": [], "publishers": [], "esrb_rating": null}