{"id": 738148, "slug": "magic-girl-zero", "name": "Magic Girl ZERO", "name_original": "Magic Girl ZERO", "description": "[Undercover work]<br/><br/>Ruby \"I am Ruby. I have been dispatched from the Kingdom.<br/>Do you know that In recent years, there are quite a few incidents where<br/>young females are disappearing in Ocean region?<br/>I came here to investigate the cause of these disappearances.\"<br/><br/><br/>[RPG]<br/><br/>This RPG shows how Ruby is smeared with shame.<br/>It is the story where Ruby does not know what love is. <br/>Serving the kingdom, serving the queen, and act in a matter of fact approach for her missions.<br/><br/>Ruby still does not know the reality.<br/>Her sexual identity as an woman,  turns in to a heavy weight for Ruby.<br/>Rape, humiliation, shame ...<br/><br/>Everytime she is raped, her uterus started to ache.<br/>Ruby who has lived strictly was whaled with shock from sexual desire.<br/>What will Ruby feel as she is shamed sexually in front of a large number of buyers as a slave.<br/><br/>You can start playing from the spot (the enemy level will go down, when you retry) even when you are defeated.<br/>However, when you retry the game, your game level (evaluation)  will decrease.<br/>If your game level is at extreme, there will be some bonus, where you can look at rough sketches that were made during the development.<br/><br/><br/>[Conflict]<br/><br/>Ruby who has fallen in love.<br/>Can she prioritize the mission than love,  as  one who  serves the kingdom?<br/>Goodbye ... those who I loved ...<br/><br/><br/>[Sacrifice]<br/><br/>Ruby can self-sacrifice in order to carry out the mission.<br/>she will continue to endure desperately even toward erotic things as she is humiliated as she fights.", "metacritic": null, "released": "2022-02-12", "tba": false, "updated": "2022-02-14T03:42:23", "background_image": "https://media.rawg.io/media/screenshots/aeb/aeb7374032e1e85e2d9d6409ac0848c0.jpg", "website": "http://h-game.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vitamin CCC"], "genres": ["RPG"], "publishers": ["H-GAME"], "esrb_rating": null}