{"id": 738110, "slug": "boom-bears-on-stream", "name": "Boom Bears on Stream", "name_original": "Boom Bears on Stream", "description": "Boom Bears on Stream is a fun game for Streamers! <br/>Integrated into Twitch to let Streamers interact with their viewers in a fun and unique way.<br/>Play with up to 100 of your viewers or bots in this cute procedurally simulated Battle Royale.<br/><br/><br/><br/>Players will battle it out till one is remaining champion. <br/>Using various different items that spawn randomly around the platform like Bombs, Rocket Launchers and Air Strikes!<br/>The on screen leaderboard will help you keep track of how the Bears are doing, how many kills they have and if they are alive or not.<br/><br/>Winner of the previous round will be given a crown and the \"Champion\" title in the next game.<br/>The host &amp; the champion will also automatically be entered into the next match.<br/><br/>During gameplay players can gain experience for playing which will count towards their level.<br/>At the end of the match the winners statistics will be shown off.<br/><br/>Gameplay Features:<br/> - Procedural platform<br/> - Up to 100 Bears<br/> - Randomly spawning items<br/> - Username &amp; color matching players Twitch account<br/> - Champions<br/><br/>Application Features:<br/> - Channel Point integration for starting games<br/> - Different join types: First or Raffle*<br/> - Spawn bots during countdown<br/> - Change game speed during gameplay (slow-motion or speed up)<br/> - Daily Leaderboard on Screen<br/> - Can be used as OBS Overlay with Color or Luma Key to key out Black color<br/> - Edit countdown &amp; max player count and more<br/> - Automatically give &amp; remove VIP to winning players<br/><br/>* = Join type \"Raffle\" means that upon your chat typing the \"!join\" command they'll be put into a raffle that is drawn at the start of the match and picks random players until the game is full to participate. While join type \"First\" is a first come first serve in the order the chat command is entered live.<br/><br/>Boom Bears is dependant on the Twitch API and requires the user to be logged in through Twitch at all times during gameplay. It is integrated for the Streamer to be able to play with their viewers and let anyone participate!", "metacritic": null, "released": "2022-02-11", "tba": false, "updated": "2022-11-16T22:16:51", "background_image": "https://media.rawg.io/media/screenshots/523/523135bf542e9005e73ebf725dc6e783.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hideout Games"], "genres": ["Action", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["Hideout Games"], "esrb_rating": null}