{"id": 73839, "slug": "celebrity-house-3d", "name": "Celebrity House 3D", "name_original": "Celebrity House 3D", "description": "Sofia is a smart little girl. Her teacher has punished her to write a report about what she is doing tonight that has to be turned in tomorrow morning. Because she was not paying attention to her teacher in her Math’s class. <br/>Instead, she was using her phone and reading an article about a reality show superstar and her MYSTERY BOYFRIEND. No one knows who it is. Now she is curious about this rumor and decides to go into her house and find the truth. <br/>Celebrity House is one of the most simulating games of 2017. The game is full of thrilling missions inside the celebrity house. Be smart and complete these missions to find the truth and write a report. <br/>You’ll love its thrilling missions. Get a picture of celebrity’s dog, avoid cameras, and sneak into the STUDY. Find her Journal and learn who her MYSTERY BOYFRIEND is. Take a picture of her beautiful dining room. Get a selfie while wearing one of her dresses. Try on her makeup and take another selfie.<br/>In the end, expose her secret by taking a selfie of celebrity with her boyfriend. <br/>No need to wait. Let’s download and have FUN!!<br/><br/>Features:<br/>Different Rooms and Mysteries to solve!<br/>Amazing 3D Graphics and Sound Effects!<br/>Addictive Game Play!<br/>Challenging Missions!<br/>Interesting Missions to complete!<br/>Easy Controls!<br/>Direction map and Hints!", "metacritic": null, "released": "2017-11-17", "tba": false, "updated": "2019-07-29T17:58:05", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a00cb44654b681393120dde72f1eb3d_7nsa0GZ.jpg", "website": "https://www.facebook.com/Z-K-272960199793720/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["zubair anwar"], "genres": ["Adventure", "Simulation"], "publishers": ["zubair anwar"], "esrb_rating": "Teen"}