{"id": 738473, "slug": "welcome-to-my-parlour-by-sander-alsema", "name": "Welcome To My Parlour by Sander Alsema", "name_original": "Welcome To My Parlour by Sander Alsema", "description": "<p>--- Welcome To My Parlour ---</p>\n<p>Written by Sander Alsema for the 10-liner competition 2022.</p>\n\n<p>Language: Commodore 64 Basic v2</p>\n<p>Category: PUR-80</p>\n\n<p>--- Description &amp; Instructions ---<br/></p>\n<p>That's an other fine mess you've gotten yourself into!</p>\n<p>Having smelled the sweet scent of a rotting carcass, you accidentally</p>\n<p>wandered into a room crowded with hungry spiders. This is definitely not an</p>\n<p>ideal situation for a common housefly to be in.</p>\n<p>You must manoeuvre between the spiders that are dangling from the ceiling</p>\n<p>and reach the other side unscathed. Every time you succeed in this, you</p>\n<p>will rise one level. It takes ten levels for you to escape and win the</p>\n<p>game. However, if a spider does manage to catch you, it's game over for</p>\n<p>you.</p>\n\n<p>These are the controls:</p>\n<p> - Press '&gt;' to move forward.</p>\n<p> - Press '&lt;' to move backward.</p>\n\n<p>--- Code Explanation ---</p>\r\n\r\nLine 0: Make a string with quotation marks. These will become the feet of\r\n        the fly.\r\n        Read the following strings from data elsewhere in the program:\r\n        The rest of the fly, The wing colours of the fly, The victory text\r\n        and The spider.\r\n        By repeating construct a string with spider thread and a vertical\r\n        orientation string.\r\n        Set the vertical position of the fly string.\r\nLine 1: By repeating set the five vertical positions of the spiders and\r\n        their height destinations to randomly generated values.\r\n        Construct the complete string of the fly.\r\nLine 2: Set the wing colour indicator.\r\n        Set the background colour to black.\r\n        Clear the screen and display the current altitude of the fly.\r\n        Set the horizontal position of the fly string.\r\n        The rest of the line contains data for the following strings:\r\n        The rest of the fly and The wing colours of the fly.\r\nLine 3: Start the repeat cycle for the displaying of the five spiders and\r\n        their threads on their respective positions.\r\n        If the fly has reached the 11th vertical screen position (10th\r\n        altitude) then set the final text display string to the victory\r\n        text and jump to line 8.\r\nLine 4: Read the keyboard.\r\n        Let the spiders ascend/descend one position towards their height\r\n        destinations.\r\n        If a spider has reached its height destination, then randomly\r\n        generate a new one.\r\nLine 5: If the key pressed was '&gt;' or '&lt;' (actually ',' or '.'), then\r\n        calculate a new value for the horizontal position of the fly.\r\n        If that value is equal or greater than zero, then it becomes the\r\n        new horizontal position of the fly.\r\n        If the fly has reached the far right side of the screen, then\r\n        move it up one position and jump to line 2.\r\nLine 6: Display the fly on the screen with alternating wing colours.\r\n        (Black makes the wing invisible, grey makes it visible)\r\n        Increase the wing colour indicator.\r\n        If the wing colour indicator is too high, then reset it.\r\n        The rest of the line contains data for the victory text string.\r\nLine 7: Calculate a screen memory position near the fly.\r\n        At this point complete the repeat cycle for the displaying of the\r\n        spiders.\r\n        Use the earlier calculated position to see if the area around the\r\n        fly is clear on three places. If so, then jump to line 3.\r\nLine 8: Clear the screen, display the final altitude of the fly and the\r\n        \"GAME OVER\" text. In case of jumping from line 3, the victory\r\n        text will also be displayed.\r\n        Clear the keyboard buffer.\r\nLine 9: This line contains data for the spider string.\r\n        Wait until a key is pressed.\r\n        Restart the game.\r\n<p>---</p>", "metacritic": null, "released": "2022-02-13", "tba": false, "updated": "2022-02-14T05:09:18", "background_image": "https://media.rawg.io/media/screenshots/e3d/e3d61b252c4f98f78f52d8600a0fa941.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": ["Action"], "publishers": [], "esrb_rating": null}