{"id": 73841, "slug": "survival-arena", "name": "Survival Arena: Tower Defense", "name_original": "Survival Arena: Tower Defense", "description": "Build and customize your arsenal of deadly towers, ammunition, and power-ups until other players start stealing your deck ideas. Did someone say other players? We've got WHOLE TOURNAMENTS full of people for you to dominate over. Stacks upon stacks of people. Like a tower of meat and bones.<br/><br/>We've spent the last few years spinning the TD genre into something so wild and dangerous, we’re not even sure if the world is ready for it. But hey, it’s your game now, you tell us — we’re in it for the long haul.<br/><br/>A word of warning, though:<br/>This game is hardcore. If you’re into tickling digital kittens, stick to playing The Tribez (Get good vibes — play The Tribez!©).<br/>This game will make you miss your stop during your daily commute!<br/>This game will make you cry tears of joy in unexpected places.<br/><br/>The Survival Arena focuses on these key factors: it’s not about hiring the best troops or winning PvP battles, it’s about prevailing against all odds! Build mighty towers, upgrade them, and try to hold off hordes of incoming enemies!<br/>You know that feeling when it seems like Friday, but it's actually Thursday? Survival Arena is kind of like that. It’s so addicting that when you finally put down the game, you'll realize you’re 93 years old with 20 grandchildren. And it'll have all been worth it.<br/><br/>▪ Non-stop explosive TD action!<br/>▪ One handed, on-the-go gameplay. Play with one hand, shake the president’s hand with the other.<br/>▪ Play against other players in dozens of tournaments.<br/>▪ Assemble a unique arsenal mix fit just for your style of play.<br/>▪ Race against time against an onslaught of enemies to win against all odds<br/>▪ Choose YOUR strategy, there are many like it, but this one’s yours.<br/>▪ Full livestream support — this game was made to be watched by millions.<br/>▪ Most important of all — survive!<br/><br/>High in the raging cyclone of thunder and endless gales, a huge flying Arena Ship makes its way across the endless ocean below. The Arena is legendary and surrounded with myths and superstitions. They say it's run by a Captain long lost to madness. A man who has pirated and plundered more than all other captains combined. To have some fun with all the treasures in his late years, he decided to throw the biggest challenge across the floating isles — The Survival Arena Tournament.<br/><br/>Any Captain brave enough can venture into the eye of the storm, and if fortune turns its favorable side, they will find the arena. Thousands have tried to beat the challenges and survive, but none could beat the records. It’s time for a new challenger to accept the challenge of the Arena and to become the Grand Champion.<br/><br/>Survive if you dare.<br/><br/>VIP auto-renewable subscription info:<br/>Survival Arena now comes with the option to buy a VIP Subscription. VIP is a weekly subscription service that gives you a free VIP Chest every day, helping you stand out from the crowd with a unique badge, while also removing ads!<br/>VIP Subscription costs 0.99 USD/week (or local equivalent).<br/>A 7-day trial of VIP Subscription is available. Any unused portion of a free trial period will be forfeited when the user purchases a subscription.<br/>The payment will be charged to your iTunes account at confirmation of purchase and the subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Your account will be charged for renewal within 24-hours prior to the end of the current period, at the subscription price option you have previously selected.<br/>You can manage your subscription and turn off auto-renewal by going to your Account Settings after purchase. There is also a button in-game that takes you to these settings. If you cancel after your subscription has been activated, you won't be refunded for the remaining active period of the subscription.<br/><br/>Privacy policy: http://www.game-insight.com/site/privacypolicy<br/>Terms &amp; Conditions: http://www.game-insight.com/site/terms", "metacritic": null, "released": "2017-05-10", "tba": false, "updated": "2019-07-29T19:20:16", "background_image": "https://media.rawg.io/media/games/8d0/8d0621dd27cedd459c9e2b288d595309.jpg", "website": "http://www.game-insight.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Game Insight"], "genres": ["Action", "Strategy"], "publishers": ["Game Insight UAB"], "esrb_rating": "Everyone 10+"}