{"id": 73853, "slug": "mysteries-of-the-past", "name": "Mysteries of the Past", "name_original": "Mysteries of the Past", "description": "Go back to the 19th century and solve a series of murders in this captivating hidden object adventure game. Investigate crime scenes for clues, bring suspects in for questioning and analyze evidence to catch the killers. Are you ready to prove your detective skills?<br/><br/>FEATURES:<br/>• Investigate crime scenes in a city from another epoch<br/>• Examine clues and analyze samples to look for evidence<br/>• Interrogate witnesses and suspects<br/>• Bring the killer to justice<br/>• Works on iPhone 4S and above and on all iPads<br/>• iPod Touch 4th generation devices are currently not supported<br/><br/>PLEASE NOTE – Criminal Case: Mysteries of the Past! is completely free to play, however some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>Under our Terms of Use and Privacy Policy, you must be at least 13 years old to play or download Criminal Case: Mysteries of the Past!<br/><br/>Terms of Use: http://www.prettysimplegames.com/terms-of-use<br/>Privacy Policy: http://www.prettysimplegames.com/privacy-policy<br/><br/>Pizza is a weekly subscription service that allows you to increase your energy bar to 170 and enjoy an advertising free experience. Pizza costs 2.99 USD/week (or local equivalent) and will be charged on your iTunes Account after the 3 days free trial and when the subscription renews weekly.<br/>Subscription will renew automatically unless auto-renew is turned off at least 24-hours before the end of the current period.", "metacritic": null, "released": "2018-02-21", "tba": false, "updated": "2019-07-29T18:40:38", "background_image": "https://media.rawg.io/media/screenshots/5e4/5e4717122557071fb8de264b700085bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pretty Simple"], "genres": ["Adventure", "Puzzle"], "publishers": ["Pretty Simple"], "esrb_rating": "Teen"}