{"id": 738687, "slug": "masamune-muramasa", "name": "Masamune & Muramasa", "name_original": "Masamune & Muramasa", "description": "<p>made for my cats Masa and Mura</p>\n\n<p>ENGLUISH<br/></p>\n<p>Try to balance the number of bunnies! Don't let it get above 11 nor bellow 5 WASD / Left-Stick / D-Pad - to walk (tank control) Spacebar / X (Joystick) - Magical breath R / Start - Restart Esc - Quit Your objective is to maintain the bunnies population in balance, in an island where bunny killing monsters and proliferating stars spawn. The monsters will try to get close by the bunnies to diminish its population and the bunnies will try to get close by the stars raise it own population. You play alternating between Masamune (The brighter cat) and Muramasa (The darker cat). They alternate when the clock in the superior left of the screen completes a rotation. Masamune's breath destroys stars and multiply bunnies. Muramasa's breath destroys the monsters and kill bunnies. Try to maintain de number of bunnies close to 8 as long as possible. Left and Right Arrows (Keyboard) and Right-Stick (Joystick) turns the camera, but be careful. Use with your own risk. There is no button to reset the camera</p>\n\n<p>PORTUGÊS</p>\n\n<p>Tente equilibrar o número de coelhos! Não deixe chegar acima de 11 ou abaixo de 5. WASD / Left-Stick / D-Pad - para andar (tank control). Barra de espaço / X (controle) - assoprar magia. R / Start - Restart. Esc - Quit. Seu objetivo é manter em equilíbrio a população de coelhos em uma ilha que aparecem monstros que matam os coelhos e estrelas que os proliferam. Os monstros tentarão se aproximar dos coelhos para diminuir sua população e os coelhos tentarão se aproximar das estrelas para aumentar sua população. Você joga alternando entre Masamune (gato mais claro) e Muramasa (gato mais escuro). Eles trocam quando o marcador no canto superior esquerdo completar uma volta O sopro de Masamune destrói estrelas e multiplica coelhos. O sopre de Muramasa destrói os monstros e mata coelhos. Tente deixar o número de coelhos perto de 8 o máximo de tempo possível. Setas pros lados gira a câmera, mas tome cuidado. Use por sua conta e risco. Não existe um botão de resetar a câmera.</p>", "metacritic": null, "released": "2022-02-13", "tba": false, "updated": "2022-02-14T06:14:44", "background_image": "https://media.rawg.io/media/screenshots/7bd/7bd4aa6b6a412354067635073601cb03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Gilberto Mayworm III"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}