{"id": 738624, "slug": "noscape-kiacity", "name": "Noscape Kiacity", "name_original": "Noscape Kiacity", "description": "<p><em>Escape Velocity</em> was a 1996 Mac OS game by <em>Ambrosia Software</em>. This nonsensically-titled game of mine is a demake / clone of that.<br/></p>\n<p>This was made in 2022 (Feb 5-13) for NOKIA 3310 JAM 4, in which games are (superficially) limited to the aesthetics of the classic Nokia hardware -- namely two colors, 84 x 48 resolution, 12-button keypad controls, monophonic sound.<br/></p>\n<p>The theme of the jam is 'UPGRADE'. So: You can upgrade your ship at the outfitter while planetside on \"Backwater\"... though I didn't have enough time to make a nice scrolling shop interface with icons and all that, so it's just a linear series of upgrades that ends in infinite missile capacity increases.<br/></p>\n<p>Sadly I wasn't able to work on it as much as I would have liked, but I've done most of what I set out to do for the jam. Still, it should be said that there's no jumping to other star systems, missions, friendly or neutral ships, factions, cargo space, shipyards, resource trading... there's just one enemy type, and numerous other limitations. But if you want all that stuff, go track down the original EV games -- they're classics.</p>\n<p>I wanted to try to make some sound effects in bfxr or something, but again, no time, so thank you to Trix for the sound pack provided in the jam resources.<br/></p>\n<p>This game is dedicated to the brave Mujahideen fighters of Afghanistan.</p>\n<p>Thank you for playing!<br/></p>\r\nControls\r\n<p>This is a little complicated, bear with me here.<br/></p>\n<ul><li>The 12 controls are the 123/QWE/ASD/ZXC keys.</li><li>WASD to maneuver.<ul><li>The rear S key rotates the ship opposite to current movement direction. It does not provide any reverse thrust.</li><li>A&amp;D are also used as left and right buttons to navigate planet menus. The top three keys are also hotkeys for planet menu options.</li></ul></li><li>1 is a modifier key.<ul><li>1+W activates the afterburner, if purchased. It has limited fuel but fills back up after a short delay.<br/>\n</li><li>1+2 selects the nearest enemy target, instead of cycling  through them in order, and clears the target if that one is already  selected.\r\n</li></ul></li><li>2 selects enemy ship targets.</li><li>3 selects planetary targets.</li><li>Q auto-rotates toward the current target.<ul><li>Also toggles audio mute, if paused.</li></ul></li><li>E lands on a nearby planet, if moving slowly enough.<ul><li>Also selects menu options while planetside.</li></ul></li><li>Z and C are used for primary and secondary weapons, if they have been purchased.<ul><li>The secondary weapon has limited ammunition and can be restocked by landing.</li><li>Turrets require an active enemy ship target. Front-facing weapons can be fired without one.</li></ul></li><li>X opens a pause / stats menu.\r\n<ul><li>This key would also ideally be used to open the starmap and allow system jumping, but that feature was not implemented.</li><li>X also closes menus (outfitter) and is an alternative key to take off from a planet.</li></ul></li><li>Alternatively, Numpad controls are available, but not recommended.<ul><li>The top row of the numpad (Numlock, Num/, Num*) can cause issues.</li><li>Numlock was disabled, because it turns out you don't want to lock the nums. Numpad controls instead use Num- in place of the top left key, but the position no longer matches the icons for menu hotkeys.</li><li>Also had an issue in testing in Firefox, where Num/ would open a search bar.</li><li>Otherwise, the bindings are the same -- 2 in place of X, for example. I myself find it unintuitive; using the E landing key to navigate menus feels right to me, but when you translate that over to Numpad 9, it doesn't really work unless you also use your left hand for it anyway.</li></ul></li></ul>", "metacritic": null, "released": "2022-02-13", "tba": false, "updated": "2022-02-14T05:58:20", "background_image": "https://media.rawg.io/media/screenshots/869/869b8b518c05e65169cc6fc831259866.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zackarotto"], "genres": ["Action"], "publishers": [], "esrb_rating": null}