{"id": 73878, "slug": "magic-sword-2", "name": "Magic Sword+", "name_original": "Magic Sword+", "description": "\"Shall we date?: Magic Sword\" is the first ever western fantasy created by shall we date series based on the legendary King Arthur. Let the Magic Sword transport you as a princess and your knights back in the Arthurian time and start your adventure romance.<br/><br/>===Main features===<br/>- Play basic story for FREE: A new fantasy story based on the legendary King Arthur<br/>- Choose your favorite character: Handsome knights who will capture your heart! You can choose among the three men to begin your romance.<br/>- Multiple-endings: The choices you make will determine how each story ends.<br/>- Beautiful still graphics: Check out the beautiful artwork by the Japanese illustrator.<br/>- Decorate your own avatar: Decorate your own avatar and show your creativity!<br/>- The basic story plot is the same as the paid version \"Shall we date?: Magic Sword\".<br/><br/>=== Story ===<br/>This story is all about, you were assigned to look after the Excalibur sword, the sword has been around for decades, passed down from generations to generations until it was stolen...by the legendary King Arthur with his mysterious behavior.<br/><br/>You vow to get it back. Now you (player) also a fighter and three brave knights set out on a journey to get the sword back. It's a journey full of thrilling adventure, battles, humorous and not to forget romances. Experience the stunning beautiful story and the handsome knights like never before.<br/>Find out how this journey changes you.<br/><br/>=== How to buy coins ===<br/>Once the tutorial is cleared, you will see a Menu button at the bottom of the page,<br/>Tap Menu &gt; then tap Buy Coin, here you can buy Coins that can be used for all in-app items.", "metacritic": null, "released": "2014-05-27", "tba": false, "updated": "2019-10-22T14:24:37", "background_image": "https://media.rawg.io/media/screenshots/1e8/1e87f64e00395777ceaf26b928bc6143.jpg", "website": "http://shallwedate.jp/en/free.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["NTT Solmare"], "genres": ["Adventure", "Simulation"], "publishers": ["NTT Solmare"], "esrb_rating": null}