{"id": 73882, "slug": "kings-knight-wodd", "name": "KING'S KNIGHT -WoDD", "name_original": "KING'S KNIGHT -WoDD", "description": "---------------------------------------------<br/>Service for “KING’S KNIGHT” has ended as of June 26, 2018(Japan Time).<br/>We would like to extend our deepest gratitude to our players for their patronage.<br/>---------------------------------------------<br/><br/>On the 30 (+1)-year anniversary of its original release, King’s Knight is reborn! Witness the evolution of the classic wall-smashing adventure!<br/><br/>[Story]<br/>6th Moon of the Luvan Year 320<br/>Princess Claire of Olthea is abducted <br/>by the Dark Dragon Tolfidan.<br/><br/>Meanwhile in Olthea, four brave souls <br/>receive the blessing of the time god <br/>Khalam, and embark on a quest to    <br/>rescue the captured princess.<br/><br/>After numerous trials and tribulations, <br/>the four heroes arrive at the gates of <br/>Tolfidan's stronghold...<br/><br/>[Game Details]<br/>-New battle system<br/>Enemies and traps abound on a vertically scrolling stage. Take down giant enemy bosses part by part! Unleash a powerful King's Might attack to obliterate your foes!<br/><br/>-Multiplayer mode with up to 4 players<br/>Test the limits of player unity and strategy in co-op mode! When the four heroes line up in formation, inconceivable power shall<br/>descend from the sky.<br/><br/>-An army of allies and comrades!<br/>Over 50 new characters appear in this all new epic adventure set in the mythical kingdom of Olthea.<br/><br/>-Switchable control schemes<br/>Switch between classic virtual controls using two hands (left for movement, right for action) and one-handed controls optimized for smartphone play.", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2019-10-22T14:24:36", "background_image": "https://media.rawg.io/media/screenshots/6fb/6fb2c46a6121fcefb94ccab9eb100db5_HYTVRqY.jpg", "website": "http://www.finalfantasyxv.com/kingsknight", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Square Enix"], "genres": ["Action", "RPG"], "publishers": ["Square Enix"], "esrb_rating": "Teen"}