{"id": 739, "slug": "the-bards-tale", "name": "The Bard's Tale", "name_original": "The Bard's Tale", "description": "<p>Comedic action role-playing games have a certain public to appease and The Bard’s Tale, a separate title from the series with a similar name, succeeds. Players control the Bard, a cynical, sarcastic opportunist in the world of magic and swords. He is not interested in saving the world, but when it comes to getting a reward, or his own head is on the line – he’ll gladly jump into the action. And when the cult members recruited him to save the Caleigh, a beautiful princess, he considers that it might be worth his time.<br />\nThe Bard’s Tale (2004) was a deviation from the main series, not only with a 3D environments but a moral choice system. The Bard has a choice in almost every dialogue to give either snarky or nice response, which might have lasting consequences through the entirety of the game. The game introduces summoning mechanic, which is improved with every musical instrument Bard finds during the story that allows players to call for the help of a companion. Companion specialty varied and they might be attacking defensive or utility. And because the game is focused on a musician, the player will view many musical numbers and songs.</p>", "metacritic": 70, "released": "2004-10-26", "tba": false, "updated": "2024-01-25T19:46:17", "background_image": "https://media.rawg.io/media/games/f59/f5930ff42471e790969566e9fd98a075.jpg", "website": "http://www.thebardstale.com/", "rating": 3.52, "rating_top": 4, "added_by_status": {"yet": 112, "owned": 1455, "beaten": 105, "toplay": 39, "dropped": 60, "playing": 1}, "playtime": 3, "achievements_count": 103, "ratings_count": 159, "suggestions_count": 553, "game_series_count": 0, "reviews_count": 159, "platforms": ["Android", "PlayStation 2", "Linux", "macOS", "PC", "iOS"], "developers": ["InXile Entertainment"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Vivendi Universal Games", "inXile Entertainment"], "esrb_rating": "Teen"}