{"id": 73928, "slug": "big-business-deluxe", "name": "Big Business Deluxe", "name_original": "Big Business Deluxe", "description": "The amazing next-gen economic strategy game for true-born businessmen!<br/><br/>Have you ever dreamed of becoming a business tycoon? Big Business Deluxe gives you a chance to turn this dream into reality! Build a modern metropolis, set up your own business and make millions right now! Of course, there is a bumpy road ahead. It’s easy to start your business; the real challenge is to make it profitable and successful. On your way to the top you will build factories, manufacture your products and learn the secrets of effective management to keep all your enterprises under control.<br/>Put your economic skills to work! Use different business tactics to be always one step ahead of your competitors and become the best entrepreneur possible. While reaching for fame and riches, do not forget to take care of your citizens. Expand your territory, develop infrastructure, extinguish fires and participate in public life.<br/>Remember that your potential is limited by your ambition only! Start the game now: your boss chair is waiting for you!<br/><br/>Key features:<br/>• This game works in offline mode without Internet – play it on the plane, in subway or on the road. Enjoy!<br/>• Realistic atmosphere: life in the city goes on even when you are not in the game. Everything changes, just like in the real world. Your employees work and factories grow, making you wealthier with each passing hour.<br/>• Competitive spirit: play together with your friends, participate in exciting contests and win unique prizes. Prove that you are the best and achieve success faster than your competitors!<br/>• Manage your city: you hold the real power here. Your word is law! Take advantage of the endless possibilities the game offers you and build the ideal city!<br/>• The game doesn’t require a permanent online connection: play anytime, anywhere you want.<br/> <br/>Facebook Comunity: https://www.facebook.com/BBusinessGame <br/>Game Trailer: http://youtu.be/Uni-GfFKm-4", "metacritic": null, "released": "2013-11-06", "tba": false, "updated": "2019-10-22T13:56:22", "background_image": "https://media.rawg.io/media/screenshots/ca0/ca0e548d72a132d69726a763fc67baeb.jpg", "website": "http://www.game-insight.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Game Insight"], "genres": ["Strategy", "Simulation"], "publishers": ["Game Insight UAB"], "esrb_rating": null}