{"id": 73933, "slug": "troll-face-quest-tv-shows", "name": "Troll Face Quest TV Shows", "name_original": "Troll Face Quest TV Shows", "description": "The ultimate pranking game is back with a new victim of choice: TV shows! With more than 50 million installs worldwide, the Troll Face Quest franchise is the world’s most successful pranking game out there. Troll your way around this wacky world and become King of the trolling world! Sherlock the crap out of head-scratching puzzles and prank your favorite TV characters! <br/><br/>WACKY FEATURES<br/><br/>• 35+ loony puzzles that will make you laugh your butts off!<br/>• Unlock off the wall achievements!<br/>• Conquer the global trolling leaderboard!<br/>• Play anytime, anywhere. Wi-Fi not needed!<br/><br/>TV SHOW MANIA<br/><br/>As you progress through mind-boggling levels of trolling, you’ll notice a lot of characters and scenes from hit TV shows. The prank’s either on them or on you!  When Winter comes, the trolling undead walk freely. Prepare for the ultimate trolling battle by slipping on some yellow anti-trolling jumpsuits and by hiring a crooked lawyer just in case you need a quick get-out-of-troll-jail card.  It’s only a matter of time before you’ll troll your way up to the White House. Ring any bells?<br/><br/>TO TROLL, OR NOT TO TROLL: THAT IS THE QUESTION.<br/><br/>This nonsensical world of baffling puzzles will have you banging your head against the wall. If you let it get to you, these crazy levels of non-stop trolling will have you admitted to a loony bin in no time. Try to keep your cool and beat the relentless trolls at their own game!<br/><br/>Are you sane enough to endure such trolling pain? Find out when you troll or get trolled.", "metacritic": null, "released": "2017-03-01", "tba": false, "updated": "2023-03-19T08:01:32", "background_image": "https://media.rawg.io/media/screenshots/1a0/1a07e97c0de45245d42525a6142d0f36.jpg", "website": "http://www.spilgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["SPIL GAMES"], "genres": ["Adventure", "Puzzle"], "publishers": ["SPIL Games"], "esrb_rating": "Everyone 10+"}