{"id": 739393, "slug": "cest-la-vie-furiouzdev", "name": "C'est la vie (FuriouzDev)", "name_original": "C'est la vie (FuriouzDev)", "description": "<p>A la recherche du secret ancestral du Kipkiptalala Tululu Of Life...</p>\n\n<p><strong>Mon Idée </strong></p>\n<p>J’avais une idée de jeu où il fallait effectuer des missions qui n’ont aucun sens ! En revanche concernant l’environnement j’avais une idée bien précise : un coin de paradis sur la plage !\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Ce qui s’est bien passé pendant le Challenge </strong>\n</p>\n<p>J’ai mis en place un système de missions, il n’est pas optimisé mais il fonctionne c’est ce qui compte. J’ai également bien réussi les interactions entre les personnages et l’environnement même si il reste quelques petites choses à améliorer.\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Ce qui s’est mal passé pendant le Challenge </strong>\n</p>\n<p>J’ai eu beaucoup de mal à gérer les communications entre blueprints. J’ai également eu un gros souci au moment de la compilation de mon jeu. Ayant utilisé le plugin Water de UE qui avait permis un super rendu, la compilation était impossible. Il a fallu supprimer le plugin et remplacer l’océan par des meshs pour pouvoir produire mon jeu….\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Ce que j’ai appris durant ce Challenge </strong>\n</p>\n<p>J’ai beaucoup appris au niveau de la gestion des animations, j’ai même réussi à en créer une ! J’ai également mis en place une petite cinématique au début, une chose que je pensais inaccessible jusque là.\r\n  </p>", "metacritic": null, "released": "2022-02-11", "tba": false, "updated": "2022-02-14T09:32:37", "background_image": "https://media.rawg.io/media/screenshots/750/750f5930636b306af5d595e280f00599.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FuriouzDev"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}