{"id": 739444, "slug": "bullion-the-curse-of-the-cut-throat-cattle-demo", "name": "Bullion - The Curse of the Cut-Throat Cattle (Demo)", "name_original": "Bullion - The Curse of the Cut-Throat Cattle (Demo)", "description": "<p>Captain Long John Silverside and his crew of scurvy sea-bulls have landed on the legendary Islands of Ser-Lloyn and incurred the wrath of the gods! It's every bull for himself in a back-stabbing, treasure-grabbing struggle, and only one may survive the curse of the cutthroat cattle...</p>\r\n \r\n<p>Bullion: The Curse of the Cut-Throat Cattle is a local multiplayer brawler for up to four players, featuring a cast of backstabbing bovine buccaneers and a unique blend of PvP and co-op gameplay.</p>\n<p>Stranded on the Islands of Ser-Lloyn, the heathen gods have declared that only the one bringing the greatest offering of treasure shall live - so each pirate must grab as much loot as they can! Even death will not deny the gods their game; fallen pirates become ghosts and can return to life at their gravestones. However... should the entire crew fall at the same time then the game ends with no winner - so players must balance working together in order to keep at least one crewmember alive with doing whatever it takes in order to have the most treasure at the end of the battle!</p>\r\nControls\r\n<p>Bullion is best played via controller, although players 3 and 4 can also be controlled by keyboard:<br/></p>\r\n\r\n\r\nActionXbox ControllerPlaystation ControllerP3 keysP4 keys\r\n\r\n\r\nMovementLeft stickLeft stickW/A/S/DArrow keys\r\nAttackA buttonX buttonSpaceReturn\r\nBlockB buttonCircle buttonLeft shiftRight shift\r\nDashY buttonTriangle buttonTabBackspace\r\nUse Power-upR1 shoulder buttonR1 shoulder buttonESlash\r\n\r\n\r\n<p>Full game information can be found on the player's guide page of the Bullion website.<br/></p>\r\nDemo Version Features\r\n<ul><li>Two playable characters- Long John Silverside and Bovy Jones</li><li>Two avarice-mode (timed) rounds - Gyutan Sands and The Locker</li><li>One defiance-mode (boss battle) round - Salty Swamp</li><li>One voyage-mode (cup-style play) sequence</li></ul>\n<p><strong>Note:</strong> Screenshots are taken from the full version of the game - some of the stages and characters featured are not available in the demo version</p>", "metacritic": null, "released": "2022-02-11", "tba": false, "updated": "2022-02-14T09:47:33", "background_image": "https://media.rawg.io/media/screenshots/835/835afe25569b4c9abace49239ba95271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Leda Entertainment"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}