{"id": 739624, "slug": "bible-master-2-the-chaos-of-aglia", "name": "Bible Master 2: The Chaos of Aglia", "name_original": "Bible Master 2: The Chaos of Aglia", "description": "<p>Bible Master 2: The Chaos of Aglia is a hybrid of a real-time strategy and a role-playing game. The game is set in a fictional medieval fantasy world and its story takes place on the continent of Aglia. Many primary and secondary characters are featured and eventually become controllable by the player, but the initial segment of the story begins in the small southern kingdom of Finice-Deal, focusing on a young knight who has completed his nobility initiation and must protect his country from hostile pagan worshipers.</p>\n<p>The game is divided into scenarios, each built like a large-scale tactical battle that takes place in a location comprising outdoor areas and towns. The player navigates characters in real time on the overhead battle field in a point-and-click fashion, with enemies moving in real time as well. Each character represents a unit of a different type (such as knights, archers, magicians, etc., some with a general leading them). When a player-controlled and an AI-controlled unit are near each other the player can opt to view a full-screen animated battle sequence, the outcome of which is decided depending on the combatant&#39;s parameters. Like in regular RPGs, towns can be visited and establishments such as inns, shops and bars can be accessed (however, without free movement through the rest of the town). This can be done in the middle of the battle, provided a character is positioned near a town gate. Characters gain experience points, level up, and can equip a variety of weapons, armor and accessories.</p>", "metacritic": null, "released": "1994-07-08", "tba": false, "updated": "2023-02-08T10:42:53", "background_image": "https://media.rawg.io/media/screenshots/043/043c57cff5e0f0381971f9571c46b910.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["RPG"], "publishers": [], "esrb_rating": null}