{"id": 739637, "slug": "dying-1983", "name": "DYING: 1983", "name_original": "DYING: 1983", "description": "Dying 1983 is the new adventure from the Dying franchise. In this first person puzzle game, Dying 1983, you will operate the protagonist to freely explore the 3D scenes, using a variety of props collected to solve one puzzle after another, ultimately discovering the hidden truth behind the scenes.<br/><br/><br/><br/><br/>The game retains the critically acclaimed puzzle gameplay of its predecessor, with three times as many puzzles. Hundreds of strange items have been added to make the exploration experience a quantum leap forward.<br/>Instead of the level system of the previous game, the maps are all through, incorporating Metrovania-style exploration elements.<br/><br/><br/><br/><br/>The text of the script is five times larger than the predecessor, and the narrative and performances have been greatly enhanced.<br/>The game will be dubbed in Japanese.<br/>The iconic character of the series, Fishhead, will appear in a more unexpected form this time!<br/><br/><br/><br/><br/>Beneath the world visible to the eye, there is a deeper reality.<br/>Unnameable madness grows between realities, and foreign objects that break through the rules of reality silently operate by their own rules.<br/>Understanding them is the only way to control and exploit them for the chance of survival.<br/><br/><br/><br/><br/>When you are fearful, fear will surround you as well.<br/>Overcoming fear is the only way to survival.", "metacritic": null, "released": null, "tba": false, "updated": "2022-02-18T03:06:58", "background_image": "https://media.rawg.io/media/screenshots/ceb/cebb2681757f6409b9c3128535db82fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NEKCOM"], "genres": ["Action", "Adventure"], "publishers": ["2P Games"], "esrb_rating": null}