{"id": 7396, "slug": "wurds", "name": "Wurds", "name_original": "Wurds", "description": "Wurds is a unique, varied and hugely enjoyable word puzzle game.<br/>Not only are there literally hundreds of millions of unique FREE puzzles that you can play as much as you like. You can also create and share your own games for a truly endless experience.<br/><br/>Create enough words to fill the board from the letter tiles you are given before running out of time to advance through the levels and up the leaderboards. Play without time limits in laid-back mode or create a globe of words in word matrix games.<br/><br/>Each level is generated dynamically, so there are an almost limitless amount of levels to play. The words you have to find are not predefined either, so as long as you enter a real word that fits on the game board, you can play it.<br/><br/>Create your own custom games by defining a set of letters and words to find. Add a time limit, or not, and share it for any of your Wurds friends to play.<br/><br/>Optional, plural and singular word checking and automatic entry. Say goodbye to the tedious process of entering slightly altered words over and over again.<br/><br/>You can play the standard game, free forever. You never have to buy anything.<br/><br/>• Hundreds of millions of unique levels<br/>• Five different game modes (One unlimited game mode in the Ad Supported version)<br/>• Games generated by Wurds itself, so no expansions to buy. Ever!<br/>• Optional, plural and singular word checking and automatic entry<br/>• Create your own custom levels and share them with Email, iMessage and AirDrop<br/>• Worldwide leaderboards to track yours and your friends progress<br/>• Lots of achievements to aim for<br/>• Challenge your friends to beat your best scores<br/><br/>If you like word games, you will love Wurds.<br/><br/>There is just one in-app purchase which removes the adverts, adds four new game modes and helps to ensure the future development of Wurds. We don&amp;#39;t nag you about making a purchase, there will never be an irritating popup asking you to buy or an advert getting in the way of the game in Wurds.", "metacritic": null, "released": "2015-07-04", "tba": false, "updated": "2019-10-22T14:29:20", "background_image": "https://media.rawg.io/media/screenshots/8fb/8fba2133033d8360c5f4a93683e4da3d.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Stuart McLean"], "genres": ["Puzzle"], "publishers": ["Stuart McLean"], "esrb_rating": "Everyone 10+"}