{"id": 739670, "slug": "deadly-infestation", "name": "Deadly Infestation", "name_original": "Deadly Infestation", "description": "Deadly Infestation is a survival game in a procedural world infested with Zombies. Explore a totally destructible world and, of course, always have a good weapon to fight the animals and the infected.<br/><h3>Collect resources to survive:</h3>With such resources found in nature, it is possible to feed, create weapons, tools, refined items, buildings and objects such as the work table, for example.<br/>Water is essential for survival, collect water with a rainwater collector or an underground water collector.<br/>Build your base with wood or bricks, so you'll be better protected from the dangers that can be found outside and have a cozy place to store your stuff.<h3>Hunt uninfected animals for meat and other resources:</h3>The most nutritious food is meat, so hunting is a good option to avoid getting hungry. Collected foods can be made even more nutritious by baking or cooking in the oven or on the fire.<h3>Four classes of beings that can be found:</h3><ul><li> <strong> Uninfected animals:</strong> they are animals that can be aggressive or passive, the aggressive ones attack regardless of whether you attacked them or not, while the passives when they notice your presence they will run away from you.<br/></li><li> <strong>Infected Animals:</strong> the virus has infected such animals, they are all aggressive.<br/></li><li> <strong>People infected by the virus:</strong> people infected by the virus, the longer the infection, the stronger they are..<br/></li><li> <strong>Creature X:</strong> CONFIDENTIAL</li></ul><h3>Evolve your skills:</h3>When When performing certain actions, the player will acquire experience, where, through the skills tree, it will be possible to evolve certain skills. Skills are divided into five classes:<br/><ul><li><strong>Woodwork:</strong> the higher your level of woodworking, the more complex items can be produced on the worktable.<br/></li><li><strong>Strength:</strong> increase damage dealt when attacking.<br/></li><li><strong>Survival:</strong> increase maximum health, maximum thirst and other abilities that will help your survival.<br/></li><li><strong>Resistance:</strong> when performing actions the character loses stamina, reduce this loss or increase the maximum stamina.<br/></li><li><strong>Efficiency:</strong> both tools and objects will be more efficient as you level up.</li></ul><h3>in the dark everything gets harder:</h3><br/> The world of Deadly infestation cycles through day and night, build torches, fires and shelters to stay alive until dawn. At night it becomes harder to see enemies, so always have a light source to help you or use the bed to speed up the dawn.<h3>A lot more:</h3>Explore the world each time with a different experience. Are you ready to fight your worst nightmares and understand what is happening in the world of Deadly Infestation?", "metacritic": null, "released": "2022-02-14", "tba": false, "updated": "2022-02-18T03:28:15", "background_image": "https://media.rawg.io/media/screenshots/f06/f06752cdef6e283f66c2b75a842f473b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gsb Studios"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["Gsb Studios"], "esrb_rating": null}