{"id": 739658, "slug": "across-the-ocean", "name": "Across the ocean", "name_original": "Across the ocean", "description": "game introduction<br/>\r\n\"Across the ocean\" is a sailing adventure game. The game has a rich and exciting plot, unknown dangers are coming quietly, pirate ships come to plunder, and giant BOSS in the depths of the ocean. Most of the levels in the game require players to combine their hands and brains, challenging your management skills and operations.<br/>\n<br/>\r\nGame Features<br/>\n<br/>\r\nThe combat system is to improve your own strength by adding shells to your own ships to defend against foreign pirate ships and obtain more money.<br/>\n<br/>\r\nThe trade function is a very important feature. If you can trade well, then you will get more money, and you will also improve your strength faster in order to defeat more powerful sea monsters.<br/>\n<br/>\r\nMake the most of your abilities: The better you play, the stronger you can become. When you defeat each enemy, you will get their treasure, when you have enough strength, you can go to the depths of the ocean to challenge the sea monsters.<br/>\n<br/>\r\nJoin us, let's sail together in the vast sea<br/>\n<br/>\r\nLet's improve our ability to find hidden bosses in the advanced sea area to defeat him to get richer rewards<br/>\n<br/>\r\nOperation introduction:<br/>\r\nUse W-A-S-D to operate the boat's front, rear, left and right<br/>\n<br/>\r\nUse the Z key to pick up items<br/>\n<br/>\r\nUse the C key to open the ships page<br/>\n<br/>\r\nUse the B key to open the backpack<br/>\n<br/>\r\nUse the right mouse button to fire a cannonball", "metacritic": null, "released": "2022-02-13", "tba": false, "updated": "2022-02-18T03:19:15", "background_image": "https://media.rawg.io/media/screenshots/b59/b5910f9168a4d66708f1cea62fa05e8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cc Game"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": ["Cc Game"], "esrb_rating": null}