{"id": 739712, "slug": "hacker-simulator-free-trial", "name": "Hacker Simulator: Free Trial", "name_original": "Hacker Simulator: Free Trial", "description": "https://store.steampowered.com/app/1768940/The_Smugglers/<br/><h3>Important note about this Trial version</h3>This version of <strong>Hacker Simulator</strong> is a <strong>trial version</strong> and will give you access to the tutorial and the first contracts. To access the rest of the content, please go to the full version available here:<br/>https://store.steampowered.com/app/1754840/Hacker_Simulator/<br/><br/><strong>Important note:</strong> Please note that Hacker Simulator is <strong>not</strong> a realistic 1:1 hacking simulation and that the mechanics are only <strong>inspired</strong> by real-life hacking methods.<br/><br/>With <strong>Hacker Simulator</strong>, I wanted to bring a fun and immersive experience on the theme of hacking so that you can have a better vision of some of its aspects (being alone, I certainly can't cover all of them).<br/><br/><br/><br/>In order to keep your business running, you need to stay anonymous regularly by hiding behind various wifi networks. To do this, you will learn how to use the famous suite of tools called <strong>Aircrack-ng</strong>!<br/><br/><br/><br/>A lot of research has been done to bring you a simplified and enjoyable version of real-life hacking methods such as <strong>bruteforce</strong>, <strong>exploits</strong>, <strong>phishing</strong> and more!<br/><br/><br/><br/>You will learn a lot during your adventure, but you will also learn that hacking is not without risk. The networks you will explore will be secured and the wifi connections will be monitored, requiring a high level of attention.", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-02-18T03:58:15", "background_image": "https://media.rawg.io/media/screenshots/84c/84c8f4531088ae89bd6e46b35bcf4e6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Save All Studio"], "genres": ["Simulation", "Indie"], "publishers": ["PlayWay"], "esrb_rating": null}