{"id": 739779, "slug": "helm-or-high-water", "name": "Helm or High Water", "name_original": "Helm or High Water", "description": "Grab your sword, man the helm, ready the crew, and loose all sails!<br/><br/>Helm Or High Water is a VR pirate ship combat game with asymmetrical local co-op. Work together with a friend on keyboard and mouse or gamepad to control all aspects of the ship from the helm and sails to the cannons and crew. Pick your voyages carefully and with great cooperation you may have enough gold to upgrade your ship, improve the local island, to dress like the pirate lord you are, or just to pile up real big in the middle of town.<h3>Asymmetrical Co-op</h3><strong>As the Captain (VR)</strong>, steer the ship clear of danger, give the order to fire the cannons, and use your flintlock pistols to thin out the enemy crew.<br/><br/><strong>As the Crew (Keyboard or Gamepad)</strong>, adjust the sails, allocate crew members, choose cannonball types, and relay important information about the map, enemies, and ship status to the Captain.<h3>Features</h3><ul><li>Feel the Waves: Buoyancy physics simulation makes it feel like you’re really on a ship. Watch the bow of the ship rise and fall or keep your eye on the horizon if you’re feeling sea sick.<br/></li><li>Mind the Wind: Sailing directly into the wind will make you a sitting duck. Angle your sails and use the wind to your advantage.<br/></li><li>Station the Crew: Your ship has 3 kinds of crew members; Sailors, Gunners, and Deckhands. Allocating crew members is vital to voyage success.<br/></li><li>Choose your Ammo: Switch to Grape Shot for a better chance at hitting enemy crew, load the Chain Shot to do extra damage to the sails, or stick with Round Shot to damage the hull.</li></ul><h3>Planned Features</h3><ul><li>Pick your Voyage: Balance risk and reward when you carefully choose your voyage from the replayable, radiant voyage system.<br/></li><li>Style to Intimidate: Ditch the sea soaked rags and dress to impress with coats, gloves, hats, eyepatches, earrings, and beards to boot. Repaint the hull and, of course, the sails must be black.<br/></li><li>Upgrade your Ship: Reinvest some Gold into making your feared flagship even more formidable. Add more cannons, strengthen the hull, expand the crew cabins, and more.<br/></li><li>Improve the Town: It’s time to do some pirate infrastructure spending. Build better housing for your crew, open a Tavern to help them unwind, or hire a weaponsmith to make new swords and guns.</li></ul>", "metacritic": null, "released": "2022-02-17", "tba": false, "updated": "2022-02-18T04:42:56", "background_image": "https://media.rawg.io/media/screenshots/26c/26c3e52a81499bc69cd22b89d581f6d1.jpg", "website": "http://www.jordanhobgood.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jordan Hobgood"], "genres": ["Action", "Simulation"], "publishers": ["Jordan Hobgood"], "esrb_rating": null}