{"id": 739715, "slug": "the-wilds-2", "name": "The WILDS", "name_original": "The WILDS", "description": "Prepare to enter The WILDS! Become the animal of your choice, tasked with surviving the unforgiving challenges of the wilderness. Search for food and water to sustain your vitals while staying vigilant for hungry predators that lurk in the depths of the forest. Explore a beautiful realistic world, hunt your prey, fend off foes, form bonds with other animals, create a family, and even raise babies!<br/>\n<br/>\r\nTHREE PLAYABLE ANIMALS<br/>\r\nChoose your species to enter into the world with; Wolf, Deer, or Bear. This roster will continue to increase as we get more and more of the core gameplay implemented.<br/>\n<br/>\r\nDEEP ANIMAL CUSTOMIZATIONS<br/>\r\nOver two dozen different ways to customize the look of your animal. Create your perfect animal and even edit the looks of your companions!<br/>\n<br/>\r\nOPEN WORLD SURVIVAL<br/>\r\nAn expansive world will reveal challenges to your daily fight for survival. Mark your territory and make a home for your family in advantageous areas to make life a little easier!<br/>\n<br/>\r\nBUILD YOUR FAMILY<br/>\r\nSearch and bond with up to 3 other animals of your species to form a formidable family that will help you fight off threats and hunt down food!<br/>\n<br/>\r\nDYNAMIC DAYS / SEASONS / WEATHER<br/>\r\nGorgeous sunsets over crystal clear lakes, moonbeams glowing down through towering pines, and snow covered peaks during harsh winter storms. The world around you will change dynamically through the year bringing brand new experiences each new day!<br/>\n<br/>\r\nINTERACTIVE WORLD AND NEXT-GEN GRAPHICS<br/>\r\nHighly detailed renderings of real world environments create the ultimate immersion as you live your life in the wilds. Grass bends under your foot, dirt is kicked up by your stomping hoof, a cold puff of fog from your panting wolf in winter. No detail will be ignored.<br/>\n<br/>\r\nWelcome to the world first Wildlife Interactive Life / Death Simulator, or as I like to call it, The WILDS!", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2024-03-22T03:36:09", "background_image": "https://media.rawg.io/media/screenshots/33c/33c49cce4c91f9a110fe8aeea44c0977.jpg", "website": "http://glutenfreegaming.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Gluten Free Games"], "genres": ["Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": null}