{"id": 740075, "slug": "the-last-sausage", "name": "The Last Sausage", "name_original": "The Last Sausage", "description": "Controls - \r\n<p><strong>A</strong> - Walk left</p>\n<p><strong>D</strong> - Walk right</p>\n<p><strong>E</strong> - Attack</p>\n<p><strong>Spacebar</strong> - Jump</p>\n<p><strong>P</strong> - Pause</p>\r\nSummary\r\n<p>This game is a simple point A to point B platformer, with a variety of hazards blocking your path. There are also collectables scattered around the level that are required for you to proceed to the next level.</p>\r\nStory\r\n<p>The main story. You are a hunter who has stumbled upon The Pig King (a big blue pig), a rare species that people thought had extinct. So you decide to slay him and turn him into a premium sausage. The last sausage that will be ever made from this species, and you must get to the nearest grill before the sausage loses its freshness.</p>\n<p>You spawn in a tutorial level where you get to learn the basic mechanics (like the movements and attack buttons) of the game, and upon reaching the sign at the end of the tutorial you travel to the first level. Level one is where you get introduced to spikes, and learn how to avoid them. There are also coins scattered around the level for the player to collect. Upon reaching the end of the level, the player must touch a flag to proceed to the next level.\r\n</p>\n<p>Level two is where the player gets introduced to his first enemy, an angry pig. You’re equipped with an iron fork as your one, and only weapon as the spear that you used to kill the Pig King has been destroyed. With the fork you can defeat your enemies with a simple jab, or jump over them if you want to avoid combat. Since level two is a lot bigger than the first level, the player is also introduced to moving platforms. Moving platforms simply travel left and right at a constant speed. But beware, as the platforms are hard to stay on.</p>\n<p>Once the player reaches the flag at the end of the second level they will be satisfied with their accomplishments as they are greeted with an astonishing sight of the Pig King’s sausage, cooking on the grill.</p>\r\nDon't click the Quit button (:", "metacritic": null, "released": "2022-02-17", "tba": false, "updated": "2022-02-18T06:01:12", "background_image": "https://media.rawg.io/media/screenshots/109/1093584f8f8c163904d59449d3507d6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lukaszkumkowski"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}