{"id": 74027, "slug": "galactic-frontline", "name": "Galactic Frontline", "name_original": "Galactic Frontline", "description": "Collect and upgrade a vast array of combat units and escort vessels, unlock and develop tactical skills, and increase your fleet’s firepower.<br/> <br/>Battle in real-time with players from around the world and climb the global rankings and take part in worldwide tournaments. <br/><br/>Travel through the galaxy to experience the epic story of three races – the Terrans, Ensari and Zoltarians – as they fight for survival and supremacy on the Galactic Frontline. <br/><br/>Battle Guide: <br/>As the battle begins, both sides’ ships will occupy opposite ends of the map. Each captain will command a ship, up to 4 tactical escort vessels, and up to 6 combat units. Producing units and using skills requires energy. Energy cost, maximum energy level and regeneration rates vary based on time, upgrades, and map features. <br/><br/>The ship is the core system of any battle. If the enemy’s ship is destroyed, you win the battle. You need to use your energy wisely and make strategic decisions based on your opponent’s actions. Using your tactical skills in the right place at the right time, as well as deploying the best combat units for the situation, is the key to victory.<br/><br/>Take the opportunity to attack your enemy’s ship right away and dictate the rhythm of the battle. <br/><br/>The Galactic Frontline is waiting. Join the fight!<br/><br/>Features:<br/>  Battle in real-time, anytime! <br/>  Challenge players worldwide!<br/>  Build and command an interstellar fleet! <br/>  Collect over 50 different combat units and tactical escort vessels.   <br/>  Follow an epic storyline and explore a galaxy at war. <br/>  Lead an alliance against the world's best!  <br/>  Join exciting global tournaments! <br/><br/>Official Website: <br/>https://galacticfrontline.163.com <br/><br/>Facebook Fanpage: <br/>https://www.facebook.com/GalacticFrontline/", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2019-07-29T18:11:10", "background_image": "https://media.rawg.io/media/screenshots/f72/f722bfd66ed2132ec4aaf25a1d6574d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 435, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["NetEase Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Netease"], "esrb_rating": "Everyone 10+"}