{"id": 74057, "slug": "war-of-colony", "name": "War of Colony", "name_original": "War of Colony", "description": "An epic strategy war game you absolutely can't miss! War Of Colony takes you back to the age of colonization!<br/><br/>Assemble your army and plunder resources to fuel your conquest!<br/>Build your base and repel invaders; your army needs your full efforts to grow stronger!<br/>Work up from Private 3rd class to Grand Marshal, and expand your territory to every corner of the world!<br/><br/>Game Features:<br/><br/>Base Development<br/>World conquest starts with building a formidable base.<br/>Increase resource production and storage; soldiers are no good on an empty stomach!<br/>Upgrade castles, barracks and technologies to improve your base's defenses and military power.<br/><br/>Troops <br/>Units have their own strengths and weaknesses. Use this knowledge to counter your enemies!<br/>Generals each have their own special skills!<br/>Excellent commander utilizes the battlefield environment to maximize the effect of troop deployment. Learn to get the best results with minimum costs! <br/><br/>Battle:<br/>The age of colonization is an age of war!<br/>PVE, PVP, 1v1, or even World War; the choice is yours!<br/><br/>Alliance<br/>Join an Alliance to speed up development!<br/>Rally your allies to attack and defend simultaneously. Strength in Unity!<br/>Ready yourself for blood-boiling Alliance Wars that will rock the very world!<br/><br/>Visual Effects:<br/>Stunning graphics presented by top artists devoted to polishing every detail of the game.<br/>Experience the features of that glorious era, and recreate the sites of history's greatest battles.<br/><br/>For more details, download the game now!", "metacritic": null, "released": "2017-05-29", "tba": false, "updated": "2019-08-02T03:12:38", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb6e8dd8271e539f87dfc1f9ebbe236.jpg", "website": "https://www.nutspower.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 499, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["NUTS POWER ONLINE ENTERTAINMENT", "kkwan"], "genres": ["Strategy", "Simulation"], "publishers": ["NUTS POWER ONLINE ENTERTAINMENT"], "esrb_rating": "Teen"}