{"id": 740772, "slug": "echo-service", "name": "Echo Service", "name_original": "Echo Service", "description": "<p>Hello, player. I would like to welcome you to the future. Where all our hopes and dreams of easy comfortable lives have come true. We now have robots to do all the dangerous or tedious jobs we used to do, just because we have less to do, does not mean that our desire to buy useless/unnecessary things has gone away.<br/></p>\n<p>That just means humans have more time to lay around at home, order things online. That is where robo delivery services come in. Ready and willing to deliver what you need anytime of the day.  \r\n</p>\n<p>This is where you come in, in this game you will be playing as Echo, a delivery bot. Your mission is to deliver packages to all of your customers, On each level there will be packages you will need to collect.\r\n</p>\n<p>There will be power-ups to help you, the first one will be grab. So by getting close to the green recycling bins and holding G you will be able to move them around, so you can jump on them to get to higher places.\r\n</p>\n<p>The second power-up is a double jump, to help you get to hard to reach packages.\r\n</p>\n<p>Beware there are red enemy bots from a rival company that will try and stop you. You have 3 lives if one of the bad bots touch you then you will lose one. If you lose all of them then, you will have to start from the beginning of the level.\r\n</p>\n<p>Move Echo around using WASD, use the spacebar to jump. You can press P at any time and pause if you need to, you can also hit Esc button to go back to the main menu. If you want to be reminded of the rules/controls then you could open the opinion menu before you start playing.\r\n</p>\n<p>Now get out there Echo and start delivering happiness.</p>\n\n\n<br/>", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-02-18T09:08:15", "background_image": "https://media.rawg.io/media/screenshots/add/add6a4fb35b0965d5c97bce0709cb135.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["323429matthewjones"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}