{"id": 740822, "slug": "magne-tech-prototype-v2", "name": "MAGNE-TECH Prototype V2", "name_original": "MAGNE-TECH Prototype V2", "description": "<p>Hi, we're a student dev team, we would love if you could give us any feedback on our WIP game project V2 😊🙏<br/><br/>Now up to prototype version 2, the Beta build. We listened to your feedback last time and made some changes based on it, and will do so again after this next round of feedback 😄</p>\n<p><em>After playing please answer this short survey if you have time, or give some feedback in the comment section, cheers: </em>https://forms.gle/CmsJCFJQdrCzXjKo7</p>\n<p><em>\r\nThank you very much - </em>\n</p>\n<p>\n</p>\n<p>----------------------------------------------------------------------\r\n</p>\n<p><strong>How to play:</strong>\n</p>\n<p>The overall aim of our game is to use nothing but your magnet pod firing tool gun to solve a puzzle in each area to progress to the next area. You cannot press buttons, you cannot pick things up, you can only shoot pods to interact with things.<br/><br/></p>\n<ul><li>Magnetic materials are the only interactable surfaces/objects you can manipulate, aiming the gun at anything will let you know if it's magnetic or not (green light, sparks)</li><li>Your gun shoots magnet pods, they work in pairs.\r\nShoot Pod 1 on Object A &amp; Pod 2 on Object B, these 2 objects will then move towards each other and/or snap together with magnetic forces.\r\n</li></ul>\n<ul><li>Recall the magnet pods to reuse as many times as you need, there is no limit or ammo to worry about.<br/><br/>\n</li><li>Experimentation is key, what can be moved? what can be broken?, what can be combined with something else to solve a problem? try everything! \r\nTry to think logically about mass, explosions, physics and magnetic forces to solve puzzles.<br/><br/>\n</li><li>You can collect a maximum of 3 pod pairs to use as you progress, red, green and blue pod pairs, but don't worry, each pod pair only reacts magnetically to its paired colour pod while ignoring the other pairs.<br/><br/>\n</li><li>With each pod pair collected, you now weild more magnetic power and also more strategies to use multiple pod pairs at the same time to achieve something.\r\n<br/>\n<strong>Eg.</strong> <em>Something previously too heavy could now possibly be moved with 2 or 3 pod pairs.\r\nMaybe a door needs 1 pod pair to hold it open but you needed a 2nd pod pair to pull something through it etc</em><br/><br/>\n</li><li>There are now 8 new sections with unique puzzles to solve, and some old favorites return.</li><li>Hint: Use Reverse polarity (MMB) to build up momentum on certain things... or to use as a on/off switch for electrical things, or to unstuck things, it will be useful later, try to practice with it occasionally.</li></ul>\n<p>----------------------------------------------------------------------\r\n</p>\n<p><strong>Controls:</strong>\n</p>\n<p>- ESC to pause game<br/>- WASD to move<br/>- Space to jump<br/>- LMB to shoot magnetic pod<br/><br/>\r\n- RMB (hold) to bring up the HUD wheel to recall pods, drag mouse in direction of pod colour you wish to recall. </p>\n<p>- MMB (hold) to bring up the HUD wheel for reverse polarity, drag mouse in direction of pod colour you wish to reverse polarity on. <br/><br/>- Shift + RMB recall all fired pods.</p>\n<p>No fall damage or health.\r\nNo crouch.\r\nNo run.\r\n</p>\n<p>Known bugs/issues:  The very last level can softlock the game if you're not careful, this is being fixed in a later build, and there's a quick fix code in that level which you will see to reset things if it does softlock, you'll see it written in the truck on what the cheat code is.<br/></p>\n<p><strong>--------------------CHEATS:--------------------</strong>\n</p>\n<p>- Hold T during gameplay to bring up a list of teleport locations, usefull if you're just too stuck and wish to skip to later areas to experiment. Keep in mind this will likely result in glitches or ruined continuity of puzzle solving, use at your own risk.<br/></p>\n<p>- Hold M+Y to mute the game for whatever reason.</p>\n<p>- Hold P+3 to enable all 3 pod pairs.<br/><br/></p>\n<p><strong>-----Solutions to puzzles: (SPOILERS, DUH):-----</strong></p>\n<p>Finish the easy tutorial area, cross the long caged in bridge to the opposite end to enter room 1 with the forklift.</p>\n<p><strong>---</strong>Room 1: Shoot the pipe blocking the forklift then shoot a wall so it pulls the pipe out from under the forklift, it will begin moving automatically. Open the door the forklift waits in front of by shooting the doors base then the ceiling to lift it open. Wait till the forklift picks up a pallet and comes back out. Take the top crate off the pallet and use it to climb the wall up to the green unlocked door.</p>\n<p><strong>---</strong>Room 2: Power the robot arm with something metal by bridging the gap in the sparking wires. Let the robot arm finish its routine, then unplug its power again. Stick a pod on the chrome part of the arm, and a 2nd pod on the ceiling to lift the arm up. Head over to the blue barrel pile, stick a pod just above the pile, and the 2nd pod on the held red barrel the arm is holding above the fence, hopefully this will explode and move the blue barrels so you can exit through the hole, if not, try again.</p>\n<p><strong>---</strong>Room 3: Stick a pod to the gameboy looking key, &amp; a 2nd pod to the ceiling (so you can get the key over the fence.) Then stick the key into the 2nd machines empty slot so it powers it up and gives you a new pod pair. Use your now 2 pod pairs to lift the elevator to the top (2 pods on floor, 2 pods on ceiling of elevator shaft) exit elevator into the next room (can't go back after this)</p>\n<p><strong>---</strong>Room 4: Another gameboy key in this section, move it into the fan that has no cover on the lower floor, it will suck it up to the top floor where you are. Move the key over to the top floor fan with no cover, so it will be sucked down into the other lower section thats fenced in (try to recall all pods when it starts pulling the key down to the bottom level, to avoid occasional glitches). Now go back to the first 2 fans on the right side, shoot a pod on a fan blade and then anywhere else to stop the fan, do this for both top and bottom fans so the air flow stops, climb into the fan duct to get to the bottom level. Go over to the fence that is blocking you, the key should be sitting in or near the bottom fan, use it to bridge the sparking wire on the fence door so it opens. Go inside and move the key to the yellow machine slot to power it up. Glass flasks (explosive) should now come out on the conveyer belt, use one to blow up the lower fan cover. Disable both fans on the left side of the room so you can now walk inside the now open ducts. Walk through to next section.</p>\n<p><strong>---</strong>Room 5: (Note, fans blow you around in this area very fast, it may appear you got teleported and can be disorienting, but it will be fixed later)<br/>Use the pods to stop the giant fan blades so you can use them as bridges. Get to the other side in whatever way you find works, if they start spinning when you're on top of one you'll be blown back to the very start. Once you're across, you'll be in a fan maze, first stop the blue fan in the floor so you can walk over it, then you'll see a red floor fan with sparks, power it with a steel crate thats visible below it inside the duct. This will blow you upwards, but a fan in the duct directly above you will pull you sideways and make you stuck against its grill, disable this fan and walk back above the red floor fan again so it pushes you even higher, you should be hovering in the air and a purple fan in front of you, recall ONLY the pods you stopped the sideways fan with, use those 2 pods to stop the purple fan so you can walk past it. Continue on till you see a large duct with 4 fans in it, stop all 4 with your 2 pod pairs, walk past them and drop down into the next area.<br/></p>\n<p><strong>---</strong>Room 6: (Warehouse) Use your pods to slide the large crate pallets out of your way however you prefer, there are several ways to get through to the other side. Try to aim as low as possible on the crate so it wont tilt when sliding. Apologies for the red stand-in blockers, later those will be non magnetic pallets blocking the player. Find youre way through and exit via the door. Go up the short winding staircase area using the crates on the floor to bridge any gaps, but be careful because the brown crate is a rusty crate, it will release from the wall after a few seconds, dropping you back down if you don't time it well. Get to the top door and exit to the next area.</p>\n<p><strong>---</strong>Room 7: (AI control room) The goal here is to power up the panels in the room in the correct sequence, power up by bridging the gap between wires using the steel chairs, putting current through the cables around, or through the steel consoles themselves, you will always know where there is some live power to use because it will emit blue sparks. You can chain the steel chairs together to bridge larger gaps too. The correct sequence to power everything up in is: 1. Chain power through the console on the right side of the room using 2 chairs for the 2 gaps \"production control\" should power up and youll see 3 screens turn on and text telling you its complete. 2. Power the cable hanging from the ceiling, then power \"Utilities control\" with the now electrified cable hanging above it. 3. Chain power from \"Environmental Control\" to the cable on the floor leading to the centre console using 2 chairs, it will electrify the centre console and the other cable leading from it, use that cable to power \"Logistical Control\", this will keep the centre console electrified, allowing you to remove all chairs from the earlier power source, now use the centre console as the power source to power the last console \"Transport bay Control\" using 2 chairs. Once powered, the elevator doors will open, step inside, it takes you to the final section.</p>\n<p><strong>---</strong>Room 8: (a lot of stand-in models still WIP here) 1st, step out of the elevator (elevators are automatic here, if you step back inside it takes you to the lower floor, and vice versa) step into the small circular room with panels, the \"Door control\" panel doesn't do anything, but its your power source, is it to power the 2 panels on either side, one will move the crane, one will power the cranes magnet, you have to move it over the truck on the right side, so power the Movement panel, keep an eye on the crane and stop it above the truck (using reverse polarity as a power switch with a chair is a good idea and will be used later), no need to power the magnet yet, leave by entering the elevator to go to the bottom floor, when exiting the elevator at the bottom, to your right is a fuel pump, to your left is a broken fuel pump and handle on the ground, use pods to drag the handle over to the working fuel pump. use it to bridge the gap in the sparking wires. Recall all pods but make sure the handle stays electrified in that gap. On that same fuel pump there's a lever, pull it down until the pipe extends into ther truck, it will explode and a hole will be open on the other side of the truck, climb inside the truck and claim the final blue pod pair. Move some of the small crates from this truck and bring them over to the other truck so you can climb up using the crates later. But first go back into the elevator, power up the crane magnet (try to leave the chair in the gap without pods so it stays powered), then go back outside and climb up the side of the truck where the crane is waiting. Inside you'll see a large cargo crate (and youre cheat code in case of softlock), use all 3 pod pairs on this cargo to lift it up towards the powered crane (concentrate all 3 pod pairs on one spot on the cargo or it might not move otherwise as its very heavy) if you tilt it up enough it will snap to the crane, you can recall all your pods now and the cargo will stay attached until the crane is unpowered again. <br/>NEXT STEPS ARE CRUCIAL: [1.] Go to the force field covered small booth between the two huge doors, go inside, use 1 pod pair to hold the lever down which disables the force field (you must leave this pod pair here and not recall it), [2.] Go back to the control room via elevator, power the crane movement panel again, stop it so the cargo the crane's carrying lines up with the now vunerable booth with no force field, the idea here is to swing the cargo and to release it so it falls on top of the booth, so line it up so it can do this. [3.] Carefully place a pod pair on the chair thats powering the cranes magnet without unpowering it.. otherwise the crane will drop the cargo (softlocking the game) place the pods on this chair in a way so that if you reverse that pods polarity it will push the chair out of the electricity and so dropping the cargo at the right time during the swing over the booth. <br/>[4.] Go back outside via the elevator, at this point you should only have one pod pair left, place 1 pod on the crane/cargo in a good spot as low as possible, place 2nd pod on the centre pillar close to the same height to the first pod, the trick here is to use Reverse polarity MMB on the crane pods to start swinging it back and forth building up momentum, be very careful to use MMB only on the correct pod to swing the crane, and memorize which pod to reverse at the right time to turn off the cranes power so it drops the cargo right when its over the booth. Build up momentum by swinging it at least 5-6 times back &amp; forth, standing outside watching it carefully to judge when it has enough momentum to release the cargo and land on the booth correctly, if successful, it will crush the booth and that will open the 2 huge doors, VICTORY, GAME OVER.</p>\n<p>----------------------------------------------------------------------\r\n</p>\n<p><em>Have fun! and cheers for playing!</em>\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-02-18T09:21:45", "background_image": "https://media.rawg.io/media/screenshots/4dd/4dd4ae35bdf8376f19154dde69e4a5dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 284, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team CHONK"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}