{"id": 740839, "slug": "dungeon-dudes", "name": "Dungeon Dudes", "name_original": "Dungeon Dudes", "description": "<p>.....................................................<br/></p>\n<p><strong>-- GAMEPLAY --</strong></p>\n<p>-The main objective of the game at the moment is to use the Hellish dungeon as much as possible. It requires a red key that can be found while adventuring in the 3 regular dungeons.</p>\n<p>-<em><strong>TRAINING STATION</strong></em> will turn a Goon into a Trainee, giving them a slightly higher survival chance.</p>\n<p>-<em><strong>BLACKSMITHING STATION</strong></em> creates one from random assortment of weapons when 3 metal is given. </p>\n<p>-<em><strong>THE MINE</strong></em> will only work if its occupied by miners carrying pickaxes. Slowly, they will produce metal which can be placed into the blacksmithing station. </p>\n<p>-<em><strong>THE SHOP</strong></em> will upgrade the more books you give the shopkeeper. 16 is the last shopkeep book amount, but he still gives 750 gold per book.</p>\n<p>-<em><strong>THE WRITER</strong></em> is a rare NPC that creates books slowly, which can be given to the shopkeep for money and levels. He has a 1 in 250 chance of spawning in a normal dungeon.</p>\n<p>-<em><strong>STRAYS</strong></em> can be found literally ANYWHERE on the map. Give them a health potion and they will turn into goons. If you send them into the dungeon, they have a 100% chance of dying.</p>\n<p>-<strong><em>SUMMONER </em></strong>will accept human sacrifices in exchange for a randomly generated Mutant that can be sent into the dungeon.<br/></p>\n\n<p><strong>.....................................................<br/></strong></p>\n<p><strong>-- KEYBINDS: --</strong></p>\n<p>Click and drag to move characters.</p>\n<p>right click a character to drop thier weapon.</p>\n<p>click the red button to begin adventures.</p>\n<p>drag a weapon onto a character to equip it.</p>\n<p>.....................................................</p>\n\n<p>Most artwork is sourced directly from: https://opengameart.org/content/dungeon-crawl-32x32-tiles . This may change in time with a graphical overhaul.</p>\n\n<p>.....................................................</p>\n<p><strong>-- DETAILS AND BUGS: --</strong></p>\n<p>-The runner is currently not available in game. It will be an addition to the shop in the next version.</p>\n<p>-The blacksmith does not actually require his hammer to operate.</p>\n<p>-The sacrifices mechanic is still a work in progress, so keep an eye out for any issues there.</p>\n<p>-Some items did not have the option to sell, and instead did completely nothing when dragged over the selling station. If you experience any issues there, please let me know.</p>\n<p>-Issues with survival rates have been resolved. A new mechanic, 'Torment', now gives a low chance your character will die even with really good gear. This chance does not increase/decrease the more gear you bring in, nor will you experience it often.</p>\n<p>-Issues with memory leaking were experienced earlier in development. Please report any cases of a memory leak error. The error message will be a code error including \"failed to allocate ...\". </p>\n<p>-Under some unknown condition it is possible a mutant will return from a dungeon as a human, which doesn't make sense.</p>\n<p>-I have never seen the Rusty Knife in game, so it may not actually be working. </p>\n<p>-The summoner can be sacrificed. Don't do it though, please...</p>\n<p>Any other errors should also be reported.</p>\n\n<p>.....................................................</p>\n<p>-<strong>- ADDITIONS: --</strong></p>\n<p><em>NEW WEAPONS</em> such as the Karag, Fotor and Rusty Knife</p>\n<p><em>NEW DUNGEON</em> the wilderness, takes 6x as long as a normal dungeon, but carries awesome loot. Has a higher torment chance than any map before it.</p>\n<p><em>MUTANTS</em> completely random characters that can be armed and sent into the dungeon like every one before them.</p>\n<p><em>SUMMONERS ROOM</em> where you can make sacrifices to get a mutant in return.</p>\n<p><strong>And a bit more!</strong></p>\n<p>.....................................................</p>\n\n<p><strong><em>ANY SUGGESTIONS WILL BE TAKEN ON BOARD!</em></strong></p>", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-02-18T09:25:27", "background_image": "https://media.rawg.io/media/screenshots/932/932cab5f3e6697c5598cbd1aa18ba243.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["just makin games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}