{"id": 74083, "slug": "era-of-celestials", "name": "Era of Celestials", "name_original": "Era of Celestials", "description": "The enemy army have marched all the way to the gate of the last bastion. The Celestials looked to their greatest champions. Answer the call and embark on the Path of Vanquisher! Fight for the glory!<br/><br/>[Ultimate Game Experience]<br/>Smooth control, smart blow feedback, realistic sounds, and stunning visuals with splendid special animation effects and detailed 3D graphics integrated to bring an ultimate game experience.<br/><br/>[Unique Elysian Transformation System]<br/>With the unique Elysian Transformation system, courageous heroes can transform into invincible Elysians and mow down murderous enemies. Elysians with different capabilities are waiting to be unsealed in your journey, harness the power of Elysians and use them wisely to face different dilemmas!<br/><br/>[Sprite Companions]<br/>In Era of Celestials, sprites are your most loyal protectors. In the heat of battle, they will always be right by your side! Different sprites provide different forms of assistance, and you may switch between them at will, opening up a wealth of strategies to help you overcome any situation.<br/><br/>[Spectacular Costumes]<br/>Era of Celestials contains a bewildering array of spectacular costumes, complete with awesome glow effects. So now there's no excuse not to look your best, even on the battlefield.<br/><br/>[Real-Time PvP Battles]<br/>From the 1v1 real-time combat of Showdown to the multiplayer brawls of the Sanguine Contest and Lava Expedition, Era of Celestials is filled with action-packed combat and generous spoils for the victors.<br/><br/>[Boss Hunts]<br/>The Path of the Vanquisher is paved with amazing equipment, and hunting bosses is the main way of getting equipment and crafting materials in Era of Celestials. Kill world bosses, instance bosses, the evil dragons that show up for limited amounts of time, or any of the many other bosses to earn handsome rewards and send your BR soaring.", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2023-05-05T04:40:56", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fccd127480a5c61d9b3dd489e4c040a.jpg", "website": "https://eoc.gtarcade.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 33, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 789, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "iOS", "Android"], "developers": ["GTarcade", "YOUZU GAMES HONGKONG", "Shanghai Youzu Information Technology"], "genres": ["Adventure", "RPG"], "publishers": ["YOUZU GAMES HONGKONG", "Shanghai Youzu Information Technology"], "esrb_rating": null}