{"id": 740872, "slug": "beats-in-unity", "name": "Beats In Unity", "name_original": "Beats In Unity", "description": "Description\r\n<p>Try to make your way through some popular songs and get the highest combo possible in this Unity based rhythm game!\r\n  </p>\r\nControls\r\n<p>WASD or Arrow Keys – Press Corresponding Arrow Button\r\n  </p>\n<p>Left Mouse – Click Buttons to Select Song or Play Song on Level Select Screen, use Pause Menu In-Game\r\n  </p>\n<p>Escape – Quit on Level Select Screen, Pause / Resume toggle In-Game\r\n  </p>\n<p>Minus (-) and Plus (+) – Adjust Music Volume\r\n  </p>\r\nHow To Play\r\n<p>This game is a standard rhythm game. There are two different types of notes.\r\n  </p>\n<ul><li>Standard Note: Press the corresponding button to the beat of the music.\r\n  </li><li>Hold Note: Hold the corresponding button to the beat of the music (indicated with a line).\r\n  </li></ul>\r\nInteresting Features\r\nRead-In Chart Files\r\n<p>Each song’s chart is created in an excel sheet and exported into a text file as a comma separated list for the game to read-in. This makes editing the song’s notes easy since it does not require editing the project directly.\r\n  </p>\r\nSong Information Singleton\r\n<p>The game has a song information singleton, meaning that the data for the song playing is stored in a game object that is moved across all scenes. With this, each song is played using the same scene but with different information stored in the singleton.\r\n  </p>\r\nCamera Pulse\r\n<p>Through the use of Cinemachine, the camera’s FOV zooms in and out with the BPM of the music, creating a cool pulsing effect.\r\n  </p>\r\nVolume Control\r\n<p>Through the use of Singleton logic, PlayerPrefs and UI, the player is able to control the volume of the music in any scene.\r\n  </p>\r\nPause Menu\r\n<p>While in-game, the player may pause whenever they want by pressing the Escape button. There, they can either press escape to resume the game, or use the buttons to either resume or go back to the level select screen.\r\n  </p>\r\nCountdown Timer\r\n<p>At the start of the game and when resuming the game, a countdown is shown before the song starts or continues.\r\n  </p>\r\nUnity Input System\r\n<p>This project uses the newest experimental version of Unity’s Input System instead of the old GetAxis and GetKey input system. A Control Scheme is used, which makes it much easier to allow for different types of devices for input, if needed.\r\n  </p>\r\nAssets Used\r\nVisuals\r\n<ul><li>Unity Built-In Assets Used: Cylinder, Plane, UI (TextMeshPro)\r\n  </li><li>Song Track Texture: Created using Clip Studio Paint\r\n  </li><li>Arrow Texture: https://www.citypng.com/photo/196/cartoon-green-arrow-transparent</li></ul>\r\nSongs\r\n<ul><li>Sadness from Friday Night Funkin’ – The Trollge Files Mod: https://gamebanana.com/mods/293462<ul><li>Created by MaliciousBunny. Music by EZHalt, Original Charting by 0Wilde\r\n</li></ul>\n</li><li>Promenade from Friday Night Funkin’ – ENTITY: https://gamebanana.com/mods/284934<ul><li>Created by SugarRatio, Music by Saruky, Original Charting by AlcoholicDJ, Pointy, Cerbera\r\n</li></ul>\n</li><li>Megalomaniac from Friday Night Funkin’ – VS. Sans: https://gamebanana.com/mods/44736<ul><li>Created by fuzzehead06, Remix by fuzzehead06, Original Music by Toby Fox, Original Charting by fuzzehead06\r\n</li></ul>\n</li></ul>", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-02-18T09:32:25", "background_image": "https://media.rawg.io/media/screenshots/eda/eda7c2770aa2c42fd08b363536750fe8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["P. Gomes"], "genres": [], "publishers": [], "esrb_rating": null}