{"id": 740845, "slug": "tap-tap-fight-finger-battle", "name": "Tap Tap Fight - Finger Battle", "name_original": "Tap Tap Fight - Finger Battle", "description": "<p><strong>Let the Tap Tap Finger Battle begin!</strong></p>\n<p>    Welcome to the championship where everyone can fight in speed, agility or luck, and the finger will help in this. The first rule of the Tap Tap Finger Battle is to tell everyone about the Tap Tap Finger Battle! The second rule of the Tap Tap Finger Battle is to find an opponent and prove to him that in the battle of the fingers, your finger is the Champion!</p>\n<p>    The finger is a formidable weapon, but alone it is not enough for Tap Tap Battle. Find an opponent, choose one of seven characters, and finally solve such global questions as:</p>\n<p> • Will your finger wash the dishes today?<br/> • Who has the fastest finger at school or at work?<br/> • Is your finger the king of this party? ...<br/> … and many more questions can be solved in the Tap Tap Finger Battle! Just Tap! Tap! &amp; Fight!</p>\n<p><strong>Features:</strong></p>\n<p> • <strong>Tap Tap Finger Battle</strong> – is an easy and fun way to decide who is the coolest! Or just arrange a small competition anywhere!<br/> • <strong>Tap Tap Finger Battle</strong> – is a battle with an opponent on the same device.<br/> •<strong> Tap Tap Finger Battle</strong> – 7 fighters to choose from. Each fighter has a unique skill.<br/> • <strong>Tap Tap Finger Battle</strong> – is 5 battle arenas.<br/> • <strong>Tap Tap Finger Battle</strong> – is a very small game that does not require an internet connection.<br/> • <strong>Tap Tap Finger Battle</strong> – is just Tap! Tap! &amp; Fight! and Fun!</p>\n<p><strong>And Fighters!</strong></p>\n<p>   • <strong>Tap Fighter (Fighter)</strong> – fast fighter with a chance to make double hit.<br/>   • <strong>Tap Fighter (Devil)</strong> – the devil, himself, constantly wants to steal the soul.<br/>   • <strong>Tap Fighter (Viking)</strong> – bearded, stern! And like any Viking, he wields a shield well.<br/>   •<strong> Tap Fighter (Alien)</strong> – using telekinesis, it penetrates the brain and  confuses the blows of the enemy.<br/>   • <strong>Tap Fighter (Clown)</strong> – what gives children joy, deprives the enemy of a blow.<br/>   • <strong>Tap Fighter (Zombie COP)</strong> – once a law enforcement officer, and now a zombie with the ability to extend his life.<br/>   • <strong>Tap Fighter (Punk)</strong> – child of the streets, stun is his signature move.</p>\n\n<p><strong>Social Networks - Welcome!</strong></p>\n<p>https://www.instagram.com/madpoint.games/</p>\n<p>https://www.instagram.com/madpoint.art/<br/></p>\n\n\n<p><strong>The game is always updated and<br/></strong><strong>different modes are added.</strong></p>\n\n<p><strong>Join now!</strong><br/></p>", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-02-18T09:26:51", "background_image": "https://media.rawg.io/media/screenshots/107/107a8e8cbe73f453c688a5e0652c0840.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["MADPOINT"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}