{"id": 74093, "slug": "off-road-monster-truck-game", "name": "Off-road Monster Truck Game", "name_original": "Off-road Monster Truck Game", "description": "Impossible Monster Truck Tracks Racing Stunts are for those who are tired of playing regular and easy impossible car tracks and Car driving games of monster truck Impossible Track. Open new realm of impossible truck tracks and monster truck games with this heavy truck driving crazy stunts game 2018. Get behind wheels of racing truck and ride on the roads of something we call 98% impossible. You will find many of the largest vehicles of stunt racing games on racetrack of this 6x6 monster truck driving. Fasten your seat belt and get ready for real adventure to explore skies in the sky kissing racetracks. If you are afraid of heights this Furious stunts game is not for you or if you dare to accept the challenge then you will not be afraid to be on the sky kissing racetracks anymore.<br/>Impossible car driving is modern type of Car racing games where you have an elevated track in the skies above the clouds and garage full of racing trucks. Your destiny calls you ahead on the tricky impossible tracks where sharp edges and tricky corner are there to test stunt ramp skills with monster truck racing. Hesitating from ramp stunts and avoiding impossible stunts is out of question when it comes to accept the dare of dangerous stunts in monster truck stunts game like you sometimes do in monster truck games. All the impossible tracks are tested and verified that they can be cleared with skills of impossible driving of car racing games.", "metacritic": null, "released": "2018-03-10", "tba": false, "updated": "2019-10-22T14:24:42", "background_image": "https://media.rawg.io/media/screenshots/393/3933760992a3e8dbab039632ed57cbb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Imran Ramzan"], "genres": ["Simulation", "Racing"], "publishers": ["Imran Ramzan"], "esrb_rating": "Everyone 10+"}