{"id": 74119, "slug": "best-fiends-puzzle-adventure", "name": "Best Fiends - Puzzle Adventure", "name_original": "Best Fiends - Puzzle Adventure", "description": "Join over 90,000,000 people who are already playing this top-rated FREE puzzle adventure!  Enter the world of Minutia and collect cute characters, level them up and defeat the Slugs! With more than 3,000 levels, enjoy hours and hours of fiendish fun!<br/><br/>\"Must List!\" - Entertainment Weekly<br/>\"Best Fiends is the addictive result of a one-night stand between Angry Birds and Candy Crush!\" - PC Mag<br/>\"Best Fiends is well-polished and super-cute!\" - 148apps.com<br/><br/>STORY:<br/><br/>The little creatures of Minutia lived in peace and harmony until the meteor smashed into Mount Boom, bringing with it a strange force that transformed the Slugs who lived there into an army of greedy, greenery-gobbling pests.<br/><br/>Now, the Slugs are taking over the world, munching a path through Minutia and sliming up everything they touch!<br/><br/>But a brave band of heroes is fighting back! Left alone when the Slugs conquered most of Minutia, these unlikely champions are on an epic quest to solve the mystery of Mount Boom and beat back the Slug advance.<br/><br/>To get to Mount Boom, they’ll need to become… the BEST FIENDS!<br/><br/>FEATURES:<br/><br/>* FIENDISH PUZZLES Casual puzzle gameplay that is easy to play, hard to master.<br/>* COLLECT &amp; LEVEL UP Build a team of Best Fiends and discover their special powers!<br/>* THE BEST OF BOTH WORLDS Line matching puzzle game with RPG character development!<br/>* DAILY EVENTS Play and win something new every time you open the game!<br/>* COMPETE AGAINST YOUR FACEBOOK FRIENDS Win massive rewards!<br/>* IMMERSIVE EXPERIENCE Dazzling graphics and finger-tapping music!<br/>* WATCH ANIMATIONS Discover awesome Best Fiends videos!<br/>* STAY TUNED More levels, characters, gameplay and some surprises coming soon!<br/><br/>PLEASE NOTE! Best Fiends is completely free to download and play but some game items may be purchased for real money. To disable this, turn off the in-app purchases in your device’s settings.<br/><br/>* The minimum iOS version required is iOS9<br/><br/>VIP SUBSCRIPTION<br/>Best Fiends now offers a monthly VIP subscription on top of the other great gameplay features. VIP players have Infinite Energy, Ad-Free Play (Spin the Fiend of Fortune and win - without ads) as well as Exclusive Discounts!<br/><br/>The VIP subscription is available on a monthly tier, which auto-renews. The monthly subscription is priced at $14.99 / month. The payment will be charged to your iTunes Account at confirmation of the purchase.<br/><br/>Your subscription automatically renews unless auto-renew is turned off in at least 24-hours before the end of the current payment period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase. No cancellation of the current subscription is allowed during active subscription period.<br/><br/>Privacy policy: https://www.seriously.com/privacy-policy/<br/>Terms of Service: https://www.seriously.com/terms-of-service/<br/><br/>Like Best Fiends on Facebook http://www.facebook.com/bestfiends<br/>Follow Best Fiends on Twitter http://www.twitter.com/bestfiends<br/>Watch Best Fiends on http://www.youtube.com/bestfiends<br/>Follow Best Fiends on Instagram http://www.instagram.com/bestfiends<br/>Follow Best Fiends on Pinterest http://www.pinterest.com/bestfiends<br/>Follow Best Fiends on Snapchat http://www.snapchat.com/add/bestfiends http://www.bestfiends.com/<br/><br/>THANK YOU!", "metacritic": null, "released": "2014-10-09", "tba": false, "updated": "2019-07-29T17:37:05", "background_image": "https://media.rawg.io/media/screenshots/aef/aefbb677b39e237a880249c08e19c364_GTj6DqQ.jpg", "website": "http://www.bestfiends.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Seriously"], "genres": ["Adventure", "Puzzle"], "publishers": ["Seriously Digital Entertainment Oy"], "esrb_rating": null}