{"id": 741141, "slug": "time-is-honey", "name": "Time is Honey", "name_original": "Time is Honey", "description": "<p>Hello!</p>\n<p>This mini-game is an exploration of optimal foraging behavior and decisions in honeybees. There's a general trend towards thinking only humans are capable of complex thought and decisions. Think again! Optimal foraging theory suggests that foragers forage specifically to maximize their rate of resource acquisition.  That's a mouthful! Essentially, what this means is that animals like bees have to make smart foraging decisions that conserve energy but still yield the best nectar haul. Flowers are not often evenly distributed, so this often means that bees have to make minute calculations while considering nectar distribution and distances between foraging patches. Check out some of these unique and complex decisions by trying them out for yourself in this mini-game.<br/><br/><br/><br/><br/><br/><br/>References used:<br/>Rivera, Michael D., Matina Donaldson-Matasci, and Anna Dornhaus. \"Quitting time: When do honey bee foragers decide to stop foraging on natural resources?.\" Frontiers in Ecology and Evolution 3 (2015): 50.<br/>Stabentheiner and Kovac on honeybee foraging economics: Stabentheiner, Anton, and Helmut Kovac. \"Honeybee economics: optimisation of foraging in a variable world.\" Scientific Reports 6.1 (2016): 1-7.</p><p>Music attribution: <br/>8-bit Hyperpop - Spice - Kelly Moon: https://www.looperman.com/loops/detail/253544/8-bit-hyperpop-spice-kelly-moon-fr...</p>\n<br/>", "metacritic": null, "released": "2022-02-14", "tba": false, "updated": "2022-02-18T10:40:48", "background_image": "https://media.rawg.io/media/screenshots/42c/42ca5b5e07a0d9f3eaba0be724496c5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["meyaohyeah"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}