{"id": 741281, "slug": "justcubes", "name": "JustCubes", "name_original": "JustCubes", "description": "<p><strong>v0.1</strong></p>\n\n<p><strong><em>You're a cube. The developer of this game is lazy.  Dodge the red stuff, it's a fundamental concept in most games. In certain levels you become invisible, your speed increases, the fog around you increases and more. And yes. There's a Boss Fight. Don't ask me how that works, play the game (hehe). Also a mysterious dude helps you through out the game. By that I mean the developer shows text on your screen which will help you.</em></strong></p>\n\n<p>If you know Brackeys you probably are familiar with this.</p>\n<p>This is my first game made in unity and I took his concept and expanded it.</p>\n<p>It's not just a game where you are a cube and dodge stuff. Well... it is, but there's more to it. For example, there's a <strong>BOSS FIGHT</strong> (sadly you dont <em>fight </em>anyone but your progression in the Boss Fight level reduces his health).</p>\n<p>20 levels, including 3 'training' levels (to prepare you for the boss fight) and the boss fight itself. It would take you 20-30 minutes to complete the game.</p>\n<p>The game's pretty simple,  you only need two press two keys (A and D). If this does get popular I'd like to add more features such as a pause button,  a play button in the menu and fix bugs and issues in general.</p>\n<p>Please do give your feedback!</p><p><em>You can download the game for free by skipping the donation part by clicking  'No thanks, just take me to the downloads'. However, donations are greatly appreciated!</em></p>\n<p>Game trailer coming soon.</p>", "metacritic": null, "released": "2022-02-14", "tba": false, "updated": "2022-02-18T11:26:20", "background_image": "https://media.rawg.io/media/screenshots/3a4/3a425c44d188ded39f1c60b89228e8b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frocxter Studios"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}