{"id": 741245, "slug": "yatka", "name": "Yatka", "name_original": "Yatka", "description": "<p>YATKA is one of many Tetris implementations available. Motivation behind this one was, on the one hand, to create a game that would conform to modern rules of the game, while, on the other, to make possible running it on resource-limited platforms (e.g. Bittboy or JZ4760-based handheld consoles). This is the reason I use SDL 1.2, which is considered outdated, or develop my own simplistic solutions instead of relying on third-party dependencies.</p>\n<p>The game is in constant development. Feel free to report errors as it helps to improve the game. There are no full-time testers working on it so I appreciate any feedback.</p>\n<p>Features:</p>\n<ul><li>three game modes - play Marathon (classic survival), Sprint (play as fast as possible until you clear 40 or more lines) or Ultra (play for 3 minutes to get the high score),\r\n</li><li>skin system - choose a visual style according to your taste from a set of predefined skins or create your own,\r\n</li><li>music playback - listen to the tracks included in the game or provide your own songs,\r\n</li><li>Super Rotation System - use sophisticated tactics known from the modern versions of Tetris,\r\n</li><li>low hardware requirements - the game can run on devices without accelerated graphics as it was developed using SDL 1.2, a time-proven multimedia library,\r\n</li><li>multi-platform design - the game can be easily ported to any operating system supporting a limited set of dependencies required by YATKA,\r\n</li><li>customizable rules - you can change parameters affecting the tetromino generator, lock delay or easy spin, even during the game.\r\n</li></ul>\n<p>Supported platforms:</p>\n<ul><li>MiyooCFW - Bittboy, PocketGo, Powkiddy V90, Powkiddy Q90, etc.</li><li>RetroFW - LDK, LDK Landscape, RS-97, RG-300, etc.</li></ul>\n<p>If you would like to see the game on other platforms, leave a proper comment down below. Keep in mind that donating the project helps me to spend more time on its development.</p>\n<p>More information available at https://github.com/szymor/yatka.</p>", "metacritic": null, "released": "2022-02-14", "tba": false, "updated": "2022-02-18T11:15:21", "background_image": "https://media.rawg.io/media/screenshots/f57/f5762d96ebfec5e490415f7c4b2aadd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vamastah"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}