{"id": 74139, "slug": "x-plane-control-pad", "name": "X-Plane Control Pad", "name_original": "X-Plane Control Pad", "description": "For X-Plane Mac/Windows/Linux 11.00 and later:<br/><br/>When the Pros fly their flight simulators for currency-checks, an instructor is hiding behind the scenes, setting location, weather, and inducing simulated aircraft failures during the flight test.<br/><br/>The goal is to survive the flight… despite the impossible weather, aircraft weight and balance, and equipment failures that are being triggered by the devilish instructor cowering behind the pilot.<br/><br/>Now, you can get this experience in X-Plane for Macintosh, Windows, and Linux personal computers by running this App on your iPad or iPhone (…with, of course, a willing tormentor to set all the various failures at the worst-possible time! Or just set them yourself.. the interface is clean and fast.<br/><br/>Here is how it works:<br/><br/>Simply fire up X-Plane on your Macintosh, Windows, or Linux personal computer and Control Pad on your iPhone or iPad. As long as they are all logged into the same WIFI network, they will see each other, and: Viola! You now have an Instructor Operator Station for X-Plane on your iPhone or iPad!<br/><br/>Now, on your iPad, you can load aircraft, set location, set the weight and balance of the airplane you are flying, set the weather in X-Plane, see a map complete with plan and profile views to see how well you are flying your approaches, and even induce any of the aircraft equipment failures possible in X-Plane (currently, about 1,000 possible failures!)<br/><br/>So, with this App, you can take X-Plane from a fun flight simulator up to a pro-level training experience.. assuming, of course, that you can handle the heat.", "metacritic": null, "released": "2015-06-29", "tba": false, "updated": "2019-07-29T17:58:41", "background_image": "https://media.rawg.io/media/screenshots/277/277f39bff640f38f73d2f5270426d1cd.jpg", "website": "http://www.X-Plane.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Laminar Research"], "genres": ["Simulation"], "publishers": ["Laminar Research"], "esrb_rating": null}