{"id": 741486, "slug": "la-princesse-speculaire", "name": "La Princesse spéculaire", "name_original": "La Princesse spéculaire", "description": "<p><em>Après la mort de ma mère, j'ai découvert dans son journal que les contes qu'elle me racontait quand j'étais enfant avaient un fond de vérité.<br/></em></p>\n<p><em>C'est ce qui m'a lancé sur les traces de la mystérieuse Princesse spéculaire.</em></p>\n<p>Ce jeu est ma participation au concours de fiction interactive francophone 2022.</p>\n<p>Liste non exhaustive de commandes utiles :</p>\n<ul><li>« examiner [objet] » (peut être abrégé en « x [objet] »)</li><li>« prendre [objet] »  (peut être abrégé en « pr [objet] »)  </li><li>« poser [objet] », « mettre [objet 1] sur/dans [objet 2] » pour poser un objet par terre ou dans/sur quelque chose</li><li>« inventaire » pour afficher la liste de ses possessions (peut être abrégé en « i »)</li><li>« n », « s », « h », « b », etc. pour aller au nord, au sud, vers le haut, vers le bas…</li><li>« regarder » pour afficher la description de l'endroit (peut être abrégé en « r »)</li><li>« sauver » et « charger » pour sauvegarder ou charger une partie</li></ul>\n<p>Et bien sûr, n'oubliez pas d'essayer d'autres actions logiques. Si par exemple vous trouvez une vanne, essayez de la tourner, de l'ouvrir ou de la fermer !</p><p>---<br/></p><p>La release 2 résout un problème critique où il était impossible d'interagir avec un objet important. (Il était toujours possible de terminer le jeu, mais on ratait un élément important de l'histoire.) D'autres problèmes mineurs ont été réglés (voir le journal de développement pour les détails).<br/></p><p>Si vous aviez une partie en cours et que vous rechargez la page, vous perdrez votre progression. Vous pouvez néanmoins sauvegarder votre partie avant de recharger la page, et télécharger la release 1 pour continuer votre partie sur la première version.</p><p>Bien que rien ne vous oblige à le faire, je recommande néanmoins de recommencer votre partie sur la release 2.</p><p>Pour preuve de bonne foi, la release 1 est toujours disponible au téléchargement, et la source du jeu, avec l'historique des modifications, est également disponible sur GitLab.<br/></p>", "metacritic": null, "released": "2022-02-13", "tba": false, "updated": "2022-02-18T12:25:35", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Natrium729"], "genres": [], "publishers": [], "esrb_rating": null}