{"id": 74147, "slug": "zombie-frontier-3-sniper-fps", "name": "Zombie Frontier 3: Sniper FPS", "name_original": "Zombie Frontier 3: Sniper FPS", "description": "A dangerous vaccine has caused a powerful virus that mutates humans into zombies. This lethal virus has spread out causing a zombie outbreak, meaning that humans are in danger. Survivors must fight in this war to escape from death... Turn yourself into a zombie killer and make your way through a number of challenging levels!<br/><br/>Challenge yourself in this zombie apocalypse world! Face zombies with the best weapons in this Survival FPS!<br/><br/>REALISTIC SURVIVAL FPS<br/>Experience a real zombie war: Excellent graphics in a super realistic 3D apocalypse world, perfect for fans of horror and shooting games.<br/><br/>Become a professional zombie killer and test your shooting skills to survive in more than 120 levels!<br/><br/>HUGE VARIETY OF ZOMBIES AND WEAPONS<br/>The game includes 5 challenging bosses, 60 main missions, several secondary missions, 2 DLC maps, and many special events celebrated regularly.<br/><br/>Choose from more than 30 different guns to kill zombies, from an MP5 or AK47, to a shotgun, and even to a devastating grenade! As the ammo is scarce in a post-apocalyptic world, it will be very important to plan any strategy, such as saving bullets doing headshots!<br/><br/>Upgrade weapons and gear to become a stronger survivor and face more challenging enemies!<br/><br/>The apocalypse is here, so take part in this game and become a hero fighting the undead!  Will you run away or shoot your way out in this zombie invasion?", "metacritic": null, "released": "2016-01-08", "tba": false, "updated": "2023-02-09T02:33:23", "background_image": "https://media.rawg.io/media/screenshots/a0d/a0dd90720c750800a325fb460e99f6bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 547, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["FT Games", "Feelingtouch"], "genres": ["Action", "Adventure"], "publishers": ["Feelingtouch"], "esrb_rating": null}