{"id": 741535, "slug": "ainevoltas-ii", "name": "Ainevoltas II", "name_original": "Ainevoltas II", "description": "<p>Ainevoltas II is a 2D platformer with minor RPG elements. It is the sequel to the earlier game Ainevoltas, but also partly a remake as many of the original elements have been kept. Eleven years after the defeat of Azazel in the first game, players control Justin as he had to rid Aengsvik once more from monsters that have infested its surroundings again. Justin can jump, attack and duck to recover health. Defeating enemies provides small drops that fill up an experience bar. When it is full, skill points become available to upgrade health, strength, jump power and health recovery. Health recovery as a skill is new to the second game.</p>\n<p>A large part of the game is spent on exploration. There are many secrets to uncover and certain gems provide additional abilities such as extra strength or a swarm of insects that surrounds him and attacks enemies. Optionally Justin can join a guild to complete side quests. He can also get married and have a child. While playing he can teleport to any of the discovered areas at any time.</p>\n<p>After completing the game, it can be played again with another character, the first time Amos and the second time Richter Belmont from the Castlevania series. Richter uses a whip, the insects are replaced with flying bibles and he has an additional attack to launch a flaming cross in exchange for a small amount of experience points. The game contains deadpan humour, which is mostly shown through the conversations. Progress is saved automatically.</p>", "metacritic": null, "released": "2008-03-12", "tba": false, "updated": "2022-02-19T01:43:11", "background_image": "https://media.rawg.io/media/screenshots/16c/16c0a0575c2b7c762132b3a5771af355.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["RPG", "Platformer"], "publishers": [], "esrb_rating": null}