{"id": 741667, "slug": "game-889", "name": "78", "name_original": "78", "description": "78 is a puzzle/adventure game. Use the boy to go through suspicious rooms and trials<br/>\r\nWe aim to return safely to the real world.<br/>\r\nThere are various thoughts as we go through the ordeal, but we still have to persevere until the end.<br/>\n<br/>\r\nThe game aspect of 78 was a lot of reference to the atmosphere of the RPG maker game.<br/>\r\nIt can help your play by looking around and looking for things that might help.<br/>\n<br/>\r\nSynopsis<br/>\n<br/>\r\n● A boy comes home at dawn, lamenting his condition and trying to sleep.<br/>\r\n    The boy falls asleep and wakes up to the alarm, but the room feels strange.<br/>\r\n    After that, you will be taken to a strange room and try to escape from that room.<br/>\n<br/>\r\nfeature<br/>\n<br/>\r\n● 78 There are three trials in total. At each gate, there is something to enjoy, such as puzzles and mazes.<br/>\n<br/>\r\n● Realistic graphics and soundtrack for each ordeal<br/>\n<br/>\r\n● Guess the hidden story through puzzles and riddles!<br/>\n<br/>\r\n● It is a form in which the player and the main character think together and solve the problem.<br/>\n<br/>\r\nhow to play<br/>\n<br/>\r\n● You can move with the keyboard arrow keys.<br/>\n<br/>\r\n● Press the space bar to start a conversation.<br/>\n<br/>\r\n● During the game, if a selection appears on the screen, you can click it with the mouse.<br/>\n<br/>\r\n● For the English version, enter the library attribute and change it to 78eng in the beta file.<br/>\n<br/>\r\n● 1024 * 768(resolution) is recommended.", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T03:31:04", "background_image": "https://media.rawg.io/media/screenshots/5e5/5e5793d17f39dd06ae0834a3c0af6c59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gaori"], "genres": ["Indie"], "publishers": ["Gaori"], "esrb_rating": null}