{"id": 741685, "slug": "legend-of-the-outlaw-mage", "name": "Legend of the Outlaw Mage", "name_original": "Legend of the Outlaw Mage", "description": "<strong>Overview</strong><br/>Dive into the world of the Outlaw Mage as you cast and blast your way through countless enemies in this Cowboy-Magic-themed 3rd-Person Action RPG. With a vast array of spells at your disposal, you are a force of nature, wreaking havoc as you explore canyons and caves in pursuit of the one who wronged you.<br/><br/><strong>Gameplay</strong><br/>Legend of the Outlaw Mage is a 3rd-Person Action RPG that combines elements of dungeon crawlers with stylish, fast-paced combat.<br/><br/>Dive into canyons and caves, defeating powerful enemies to advance. Collect powerful spells to build your arsenal and wreak havoc upon your foes. Gather enough style points to fill up your style meter and unleash your ultimate spells. You are the Outlaw Mage. You are not trapped in here with them. They are trapped in here with YOU.<br/><br/><strong>Story</strong><br/>The former leader of a bandit group, Charlotte is in hot pursuit of the one who betrayed her. With her gun in one hand and her spell gauntlet in another, the Outlaw Mage will stop at nothing to get her revenge. <br/><br/><strong>Features</strong><br/><ul><li>Fast-paced casting &amp; blasting<br/></li><li>Collect powerful spells to defeat countless enemies<br/></li><li>Full gamepad support</li></ul>Become the Legendary Outlaw Mage.", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T03:44:42", "background_image": "https://media.rawg.io/media/screenshots/367/3674456cba1726ec3dd5d316262aeac0.jpg", "website": "http://outlawmage.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SMU Guildhall"], "genres": ["Action", "Indie"], "publishers": ["SMU Guildhall"], "esrb_rating": null}