{"id": 741669, "slug": "stop-the-saturnians", "name": "Stop the Saturnians!", "name_original": "Stop the Saturnians!", "description": "Stop the Saturnians is a shooter inspired by classic arcade games like Galaga, Asteroids, Missile Command and Centipede.<br/><br/><br/><br/><br/><br/>Exciting gameplay where you need not only keep yourself alive, but protect the Earth from incoming threats, as well!<br/><br/>Procedurally generated alien waves that act on distinct A.I.  No enemy patterns to memorize.  It's all down to your reflexes and split second decisions!<br/><br/>25 separate levels and 40 different enemy types to test your piloting skill.<br/><br/><br/><br/>Collect resources and alien tech from destroyed enemies, all while dodging enemy fire.<br/><br/>Please the brass in various ways to achieve promotions and awards to help level you up!<br/><br/>Use what you've collected to upgrade your ship and the Earth, with 40 different technologies.  Your ship will visually evolve with each new piece of tech.<br/><br/><br/><br/>Features an epic soundtrack with more than 20 songs by award winning film composer, Adrian Ellis.<br/><br/>Receive detailed briefings before each mission, fully voiced and subtitled.<br/><br/>Receive voiced updates and advice from your commanding officer and civilian liaison in the midst of combat.<br/><br/><br/><br/>Endless gameplay.  Even after you win the game, you can choose to continue into another war where you retain everything you've unlocked but the enemy technology gets a drastic upgrade.<br/><br/>Five different difficulty settings, so everyone can play the way that's fun for them!<br/><br/>Use Keyboard, Keyboard and Mouse or Gamepad (with full rumble support) to defeat the aliens!  Rebind any and all keys the way you want!", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T03:33:11", "background_image": "https://media.rawg.io/media/screenshots/3a8/3a8f4c91642e2cf7b9d50e192fc76a7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jeff Sinasac"], "genres": ["Action"], "publishers": ["Jeff Sinasac"], "esrb_rating": null}