{"id": 741699, "slug": "demons-rise-up", "name": "Demons Rise Up!", "name_original": "Demons Rise Up!", "description": "<p>😈The Game:<br />\nDemons Rise Up! is a kinetic futanari visual novel about a pro-gamer named Suzy who summons a succubus through a cursed video game created by developers from the pits of hell. After a night of lovemaking with her creation, the succubus decides to bring along some of her demon friends for some multiplayer action. There&#39;s just one problem! After finding Suzy playing on her console, it&#39;s now up to the three demons to push her away from her gaming session so that she can push them onto her bed! Can they do it? Read and find out!<br />\n😈Gameplay:<br />\n- A visual novel with a kinetic story. Can be played and finished on idle.<br />\n- A diverse range of five expressive and sexy characters with full voice work ranging from playful to shy to sultry.<br />\n- A playful and cheerful soundtrack to match the comedic and erotic dialogue and h-scenes.<br />\n- A colorful and cartoony 2D art style.<br />\n- Seven animated h-scenes featuring Futa x Futa, Futa x Female, group sex, and a solo futa scene.<br />\n😈Fetishes/Kinks:<br />\nFutanari (Futa x Futa, Futa x Female), Tomboy, Harem, Vibrator, Succubus, Masturbation, Anal, Paizuri, Facials, Oral Sex, Teasing, Piercings, Ahegao, Orgies, Body Worship, Defloration, Creampies, Gyaru, Snuggling, Handholding, Tattoos, Foot Worship, Bondage, Double Penetration, Frotting, Strap-On, Shimapan, Hair Pulling, Cum Swapping, Mutual Masturbation, Boob Smothering, Lactation, Heart Pupils, Womb Tattoos, Armpit Licking. Facesitting, Pubic Hair<br />\nAll characters depicted in this story are over 18 years of age.</p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2024-01-04T20:58:55", "background_image": "https://media.rawg.io/media/games/653/6530f08b8e7d462835d418fe20075f54.jpg", "website": "https://berryswebsite.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1}, "playtime": 1, "achievements_count": 20, "ratings_count": 1, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["The Berry Guild"], "genres": ["Casual"], "publishers": ["Shady Corner Games", "The Berry Guild"], "esrb_rating": null}