{"id": 741658, "slug": "five-nights-at-floppa", "name": "Five Nights At Floppa", "name_original": "Five Nights At Floppa", "description": "Five nights at Floppa - Point on click First-person action horror in which you have to defend yourself from evil cats with the help of cameras and a desk lamp.<br/><br/>Your hero gets a security guard in the office, but he does not know what awaits him in his new place. The work shift starts at night and in the first seconds you notice how strange things happen, because there's someone else here...the terrifying Floppa and the terrifying Bingus and Pop Cat! They're already coming for you. Do your best to scare away the uninvited guests and keep them from approaching your location. The office consists of several rooms, each with a surveillance camera. Switch between them and keep an eye on the floppa's movements .<br/>You're an insurance salesman security guard.<br/>The game has a dark atmosphere and lots of modern memes! <br/>But more and more quickly you realize that this is not such a safe job. After all, you have to keep an eye on cat-meme Slap! You have to ensure that he did not eat dumplings, and Floppa does not like it. He and his friends will try to kill you!<br/>The game has three game modes, five nights and an extra hardcore night! With each night the difficulty will increase and the game will be harder to play, and there will be new more difficult cats. You must make it to 6am using cameras and a desk lamp.", "metacritic": null, "released": "2021-08-09", "tba": false, "updated": "2022-02-25T15:10:58", "background_image": "https://media.rawg.io/media/screenshots/a88/a8853caa027883ba3413ad015dbfb932.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FreezyCat"], "genres": ["Action", "Indie"], "publishers": ["FreezyCat"], "esrb_rating": null}