{"id": 741697, "slug": "elf-wives-cheat-to-ride-my-meat", "name": "Elf Wives Cheat to Ride my Meat", "name_original": "Elf Wives Cheat to Ride my Meat", "description": "<p>You used to be an adventurer like them, until you took an arrow to the knee. Spending your days issuing quests instead of going on them has its perks, like seeing the two strongest and sexiest members everyday. The only downside is that they always bring their stupid husbands along to spoil your lewd fantasies... Unable to watch these sexy elves flirt with their husband’s day in and day out, you get to work looking for an opportunity to get yourself a piece of that elf booty!<br />\nYour chance comes when Keira&#39;s husband is trying to rank up with the guild and you seize the opportunity by convincing Keira to let you give her a ride on your monster meat to fast track her husband&#39;s adventurer evaluation. He&#39;ll be delving deep into the dungeon for dozens of days while you use that time to pour all that pent up frustration into her pussy! Keira, exhausted from your insatiable apatite for dark elf pussy, ends up tricking the pure Sissel into sleeping with you to take a literal load off herself. With a lie that “sleeping with the guild clerk will help her discover the ‘joy of sex’ and help her have a happy marriage”, you&#39;ll show her the joy of sex alright.<br />\nWith these two banging elf wives wrapped around your finger, you&#39;ll have your work cut out if you want to turn Keira and Sissel from loving wives to mind-broken cock craving sluts! After all, who wants to be an adventurer when getting to fuck two sexy married elves is a way better reward than money or EXP!<br />\nTranslated version of the original Japanese Visual Novel<br />\nKeira and Sissel are fully voiced with original Japanese dialogue<br />\nOriginal artwork HD upscaled with 16:9 and 4:3 variants<br />\nHours of story content<br />\nAudio including music and special effects<br />\nEnhanced with character sprite animations<br />\nGallery and Scene selections<br />\n20 scenes of pure elf corruption.<br />\nElf Wives Cheat to Ride my Meat! Is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong> PLEASE NOTE </strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T13:23:15", "background_image": "https://media.rawg.io/media/games/88c/88cd8f1b336c2f0fd099d8701bb69da5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 485, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}