{"id": 741662, "slug": "guns-and-roses", "name": "Guns and Roses", "name_original": "Guns and Roses", "description": "This game is a first-person shooting adventure game. There are rich levels and battles waiting for players. Players will experience a shooting game that is different from traditional shooting games until the final victory.<br/>\n<br/>\r\nGame plot<br/>\r\n\"Black Rose\" is a private military organization that targets terrorist organizations. Its board of directors is composed of many beautiful girls, and its chairman is called Ai Qing. It was commissioned by an international anti-terrorist organization and participated in the operation against an international terrorist organization (Grey Parliament), but unexpectedly suffered a tragic attack, and the organization suffered heavy casualties. So they had to invite you, a seasoned, well-limbed, muscular veteran, Jones (Jones Warren), to assist them in their fight against the terror group.<br/>\n<br/>\r\nmain feature:<br/>\r\nIntense first-person combat, a total of eight battle levels are waiting for you to challenge.<br/>\r\nRich vehicle combat, a variety of weapons and equipment.<br/>\r\nLeisure and entertainment chariot showdown, fight with Ai Qing in the arena by manipulating the car!<br/>\n<br/>\r\nGame operation description:<br/>\r\n  W A S D controls player movement<br/>\r\n  Esc to call out the menu<br/>\r\n  R supplementary ammo<br/>\r\n  Space jump<br/>\r\n  Left mouse button Shoot/Confirm", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T03:28:18", "background_image": "https://media.rawg.io/media/screenshots/e0e/e0e32d914247d4a6f4f32787e846bf04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR RETRO REMASTER"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["VR RETRO REMASTER"], "esrb_rating": null}