{"id": 741615, "slug": "a-hint-of-a-tint", "name": "A Hint of a Tint", "name_original": "A Hint of a Tint", "description": "<p>Mandy can&#39;t figure out why every creature she has met since finding herself in this strange new world speaks of her as if she had literally just been born. They all keep referring to a device known as &quot;The Spawn Symbol&quot; as her origin. But if Mandy had really been created by such a device, why is it that her memories of her past are so real?</p>\n<p>Her problems are compounded by the apparent absence of anything for a human to drink. Will Mandy solve the mysteries surrounding her sudden presence in this world before time runs out for her?</p>\n<p>Game system:<br />\n- Features pretty much everything you expect from a classic roguelike: Maps uniquely generated at run-time, turn-based combat/exploration, enemies and loot with varying degrees of rarity, an identification system for loot, and (in Survival Mode only) permanent death.</p>\n<ul>\n<li>\n<p>Make use of a wide range of tactics. Brute force through your enemies, sneak past them while they sleep, bribe them with gifts to persuade them to ignore you or even fight on your side, teleport them or yourself away from the action, use the Demoralize Wand to make them afraid of you, or anything else you can come up with to stay alive in Isterway Sanctuary.</p>\n</li>\n<li>\n<p>It&#39;s all about the loot! In A Hint of a Tint there is never a worthless item. Some items have important uses not mentioned in their descriptions that are up to you to discover, and almost anything can be thrown at an enemy for small damage or to get her attention.</p>\n</li>\n</ul>\n<p>Two modes of play:<br />\nStory Mode, while delivering an engaging tale full of surprises, teaches you how to play the game. When you make a fatal mistake in Story Mode you can continue from the start of the room you were defeated in.</p>\n<p>In Survival Mode, choose one of the characters who appear in Story Mode to play as with the goal of delving as far into the dungeon as you can before you inevitably make the aforementioned fatal mistake.</p>", "metacritic": null, "released": "2012-06-05", "tba": false, "updated": "2022-02-21T01:25:57", "background_image": "https://media.rawg.io/media/screenshots/d98/d9872974129b486961270975c6620919.jpg", "website": "https://rpgmaker.net/games/4140/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["RPG"], "publishers": [], "esrb_rating": null}