{"id": 741738, "slug": "memory-bots", "name": "Memory Bots", "name_original": "Memory Bots", "description": "<p>Memory Bots is a 2D Puzzle Platformer about cute robots who shut down when they run out of memory. You control a Memory Bot with a very small hard drive. As you move around, your memory fills, and once it is full, your Memory  Bot will shut down. Fear not, this is part of the natural chaotic cycle of the game. Once a Memory Bot shuts down, it will remain in the level as an object to interact with while another Memory Bot is spawned at the nearest checkpoint. Making sure your Memory Bot is in the right position when it shuts down is key to solving the many puzzles of the game.</p>\n<p>How to Play:</p>\n<p>Your Memory Bot is controlled by using the A and D keys to move left and right and the Space key to jump. The goal of the game is to reach the battery at the end of the level. In order to do this, you must use both active and inactive Memory Bots to avoid hazards and solve puzzles. Be warned, only one shut down Memory Bot can exist at once, so once your new Memory Bot shuts down, the previous one will disappear.</p>\n<p>More Info:</p>\n<p>Memory Bots was created for the Mini Game Jam 100 with the theme of Overload. This theme can be seen in the core gameplay where Memory Bots shut down when their memory is overloaded. The game jam also had the additional limitation of chaos being involved. This can also be seen in the game as Memory Bots have short and chaotic life cycles. The gameplay is also chaotic as you quickly have to figure out what to do with your Memory Bot shuts down. All art was made by me within GameMaker Studio 2 while all sound was freely sourced from Freesound.org.</p>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-21T04:11:45", "background_image": "https://media.rawg.io/media/screenshots/76a/76aa8425e0f9863e8af4faa0da896bd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["benhen_26"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}