{"id": 741705, "slug": "thy-creature", "name": "Thy Creature", "name_original": "Thy Creature", "description": "<strong>The severely wounded 「Nameless Creature」 was chased by the humans, and fled to a mysterious tower.</strong><br/><strong>The Creature dares to climb the tower for its one single wish... The eerie tower where reality and memories are intertwined.</strong><br/><strong>What is the Creature's wish that he aspires to make come true in its adventure in the tower?</strong><br/><br/><strong>A dark fantasy story adventure to face the long-forgotten 「memories」!</strong>◆<strong>An unknown tower the Creature must climb</strong>The severely injured Creature, that managed to get away from the humans, enters the tower...<br/>To make its earnest wish come true. <br/>◆<strong>Bizarre events in the tower</strong> Transcendental beings occupy each floor. Overcome various ordeals that get in the way of the Creature's journey in the tower!<br/>As the Creature faces the ordeals, it will step closer into the Creature's forgotten memories and the truth. <br/>◆<strong>Secrets that unveil as you go up the tower</strong>The path to the top of the tower is full of various puzzles and secrets. Collect items and solve puzzles to get to the top.<br/>◆<strong>Suspicious tower residents</strong>There are dodgy people who have been living in the tower since long ago. Who are they and what’s their story?<br/>◆<strong>Stolen precious ‘memory fragments’ of others</strong>The Monster goes on an adventure in the tower and finds other people’s valuable ‘memory fragments’ that have been taken away from them. Who do these memory fragments belong to? Maybe these people need the Monster’s help…<br/>", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-02-21T03:59:36", "background_image": "https://media.rawg.io/media/screenshots/550/550dda502df4e8035080e3ea4b3aca2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 2}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 357, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MazM"], "genres": ["Adventure", "Indie"], "publishers": ["Growing Seeds"], "esrb_rating": null}