{"id": 741710, "slug": "regame", "name": "Re;Game", "name_original": "Re;Game", "description": "<p><strong> STORY (RPG)<br />\nthis product is about different-dimensions.<br />\nalso about loops.<br />\nthe story has a multi-ending.<br />\nthere&#39;s a true end, and an infinite virgin losing rape loop ending.<br />\nthe game is a battle fuck system.<br />\nduring battle, specified enemies may attack you.<br />\nthe main character Yukine, has the power of going back in time when raped.<br />\nwhich makes her go back in time until she doesn&#39;t get rapped.<br />\nYukine is a virgin.<br />\nwith her powers, she is sent back in time when she gets rapped,<br />\nand she returns to being a virgin.<br />\ntherefore, she will become a virgin every time this power is activated.<br />\nso, every sex scene of Yukine,<br />\nis a virgin getting raped.<br />\nYukine will experience unbearable pain numerous times.<br />\nhave fun watching her hymen get ripped by big fat dicks over and over again.<br />\n</strong> CHARACTER<br />\n- main character<br />\nYukine Asagiri<br />\na girl that loves different-dimension stories.<br />\nshe admires Majika-chan, who is the main character of the anime isekai-shojo-majika,<br />\nand has cosplay experience of her many times.<br />\nbright personality, but being raped many times, she turns darker and darker.<br />\n- friends<br />\nNorea<br />\nolder than Yukine. a knight.<br />\nnot very smart.<br />\nvery strong, as strong as men.<br />\nno talent for magic, but has top class sword skill. looks after people well.<br />\nwants to learn magic, and is jealous that Yukine has magic talent.<br />\ndoesn&#39;t like horny things, and hate perverted men.<br />\nsaved Yukine from an ojisan trying to rape her in a slum.<br />\n<strong> synopsis<br />\nYukine Asagiri, a girl who loves different-dimension fantasy,<br />\nparticipated in the cosplay summit dressing up as a character from a famous anime, isekai-shojo-majika.<br />\non the way back, a disgusting otaku tries to rape her.<br />\nYukine manages to run away from him, but gets hit by a car.<br />\nwhen she woke up, she was in god&#39;s room.<br />\nand was told that she was in between life and death by the goddess there.<br />\nthe goddess will save her life.<br />\nbut, in return she is asked to go to a different dimension and defeat Satan.<br />\nsince Yukine admired the different dimension world, she said ok to the goddess.<br />\nher life in the different dimension starts off in the slum.<br />\nshe is confused by the fact that in reality, the different dimension isn&#39;t what she imagined, she starts gathering information about Satan.<br />\nbut unfortunately she gets raped by a dirty ojisan while she&#39;s trying to gather information.<br />\nafter being raped over and over again, Yukine realized that she&#39;s back to where she started.<br />\nbeing confused, she realizes later.<br />\nthat if she is raped, she has to go back and start again...<br />\n</strong> other<br />\nstandard CG11 pieces (including minor differences over 100 pieces)<br />\nsex scene 14 scenes<br />\nbattle fuck standard CG 8 kinds (including minor differences 40 pieces)</p>", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-02-21T13:20:04", "background_image": "https://media.rawg.io/media/games/90d/90d3e2daf5e4ca7a0d0b1aba38b3058d.jpg", "website": "http://h-game.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 432, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Neko Kick"], "genres": ["RPG"], "publishers": ["H-GAME"], "esrb_rating": null}