{"id": 741703, "slug": "feng-nozhu-zi-zao-miao-sannoyao-guai-tui-zhi", "name": "風の祝子 ～早苗さんの妖怪退治～", "name_original": "風の祝子 ～早苗さんの妖怪退治～", "description": "Aerial action with lots of jumping!<br/>Take control of Sanae and try to get through the five stages!<h3>How to play</h3><ul><li> Shot: Default Z key<br/></li><li> Jump: Default X key<br/></li><li> Hovering: default spacebar<br/></li><li> Dash: press and hold the shot key on ground</li></ul><h3>Shot</h3><br/>This is a low-risk action that allows you to attack safely from a distance.<br/>You need to align your axis with the enemy, so you can combine it with hovering for a concentrated attack.<br/><br/><h3>Jump</h3><br/>You can jump even when you are in the air. You can jump in the air as many times as you want.<br/>When jumping in the air, the attack is judged to be downward. The power is three times that of the shot.<br/>You can stomp on enemies as you pass by them, or position yourself above them to increase your firepower.<br/><br/>.<h3>Hovering</h3><br/>Keep your fall speed much lower and stay in the air.<br/>It's the lifeblood of aerial combat, whether you're moving carefully through a danger zone or moving precisely to align your axis with the enemy.<br/><br/>.<h3>Dash</h3><br/>Increases movement speed, and while dashing, attack judgments are generated around you.<br/>Use it to intercept enemies coming towards you, or just hit them with your body.<br/>You can safely dispose of troublesome enemies on top of steps by continuing to hit them!<br/><br/>.<h3>Other</h3><br/>There are no remaining units, if you get hit, you will have to start over from the midpoint<br/>Estimated play time: about 1 hour", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T03:58:05", "background_image": "https://media.rawg.io/media/screenshots/949/94949d6ec8a2586c466be195b7f628c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Javelin Studio"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Javelin Studio"], "esrb_rating": null}