{"id": 741735, "slug": "km-2", "name": "K&M", "name_original": "K&M", "description": "<p>Kiffen and Maintane. They are characters. They happen to, quite potentially, exist. And they want to live a peaceful life by a lake.</p>\n<p>...but you kind of maybe need shelter to live somewhere.</p>\n<p>With the duo, help them find materials and explore the world around them so that they can build a place fitting to call \"home.\" Watch your residence evolve from a camp fire to a full house, and decorate it with some goodies found along the way.</p>\n<p>Features:<br/></p>\n<ul><li><strong>FULL ONLINE MULTIPLAYER SUPPORT FOR FOUR PLAYERS. </strong>That is correct. Four  players. Four! But if your question is \"well who are the other two  beside Kiffen and Maintane,\" the answer is \"Kiffen and Maintane  cosplaying as school idols who are quite a-muse-ing because we needed  more player sprites and had a scrapped costume cheat code.\"</li><li>A giant, detailed and beautiful world with a lot of spikes and enemies  that is fit to  make you get frustrated and die a lot and be sad but you  can watch your  friends who are in multiplayer die too so it's funny.  It also might push  how much the game engine can render without  imploding because of the  amount of collision objects, so maybe close  your web browser before playing...?</li><li>A dash mechanic to increase jump height along with holding on the jump button for more jump height. Use it wisely! It's needed sometimes!</li><li>Adorable custom graphics and artwork and animations that are very cool and make you go \"wow!\" It's beautiful and epic and this is completely unbiased. </li><li>Full chat feature for multiplayer. You can now make fun of each other  for hitting a spike by accident without using another application or  something.</li><li>An original soundtrack that only uses one instrument for the sake of <em>style </em>and also because it's simple but it works well enough.</li><li>Easy mode. Because sometimes, dying 20 times to the same spike is not  relaxing, and having the ability to set your spawn point anywhere can  make it a little nicer.</li><li>Single player mode, because sometimes, you don't want Kiffen <em>and</em>  Maintane, but just Kiffen (they are epic) or just Maintane (she is  cute).</li><li>Spectator mode...? It kinda is there if you got more than four players   and you can press 1/2/3/4 to see each player's position, but it also   wasn't tested much? It exists, what can I say. It is not advised to use unless you really want to.</li><li>Adorable house building by a cute lake at sunset. What more could you want?</li></ul>\n<p>This game was made for the GDevelop Game Jam #1 (the theme was build, so here's cute house building). <br/></p>\n<p>Online Multiplayer Note: this game uses <strong>peer to peer </strong>communication. The quality of the experience is tied to how well your computers can communicate to each other, so each player being farther apart from each other or having a poor connection <em>will</em> cause some input delay. But, if you all have a decent connection, then congrats, you can see your friends die to a spike live!</p>\n<p>Free Soundtrack Download Here!</p>\n<p>----------------------------------------------------------<br/></p>\n<p><strong>Controls:</strong></p>\n<ul><li>WS/Arrow Keys/Controller - Move</li><li>W/Up Arrow/some button on your controller you can configure - Jump</li><li>Shift/some button on your controller you can configure - Dash</li><li>R - Respawn at last checkpoint</li><li>L - Teleport back to the lake/build your house</li><li>Space/Start - Set a checkpoint at your location (for easy mode)</li><li>T - Chat</li><li>Enter - Send chat message</li></ul>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-21T04:10:54", "background_image": "https://media.rawg.io/media/screenshots/a66/a663009f4016241262ef37487711d292.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["socks and hair"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}