{"id": 741843, "slug": "40-parsec-delivery", "name": "40 Parsec Delivery", "name_original": "40 Parsec Delivery", "description": "<p>Just another day on the job, right? Well, you wish! In 40 Parsec Delivery, you play as a space truck driver, carrying packages from a corner of space to the otherto sell them. Maneuver your way through tricky asteroid fields,  dangerous shooting ranges, and keep your cool against the nasty space pirates (which happen to work for a rival company). Avoid losing the cargo with all the chaos, and always remember: The package arrives in 40 parsecs or less, or you get your money back, guaranteed!</p>\n\n<p>Arrow keys to move</p>\n<p>X to press the (X) button</p>\n<p>Z to press the (O) button</p>\n<p>\n</p>\n\n\n\n<p>The game features 2 different Life Systems and Package Modes.</p>\n<p>Life System: You start with 5 lives, and gain 1 more per 2 packages sold. If you lose all lives, you lose the game</p>\n<p>Ring System: Like Sosnic :D - When you get hit you lose packages as usual. If you get hit while having no packages, you lose the game</p>\n<p>Snake Packages: Packages will offset a little bit to give more depth and feel to the game.</p>\n<p>Stiff Packages: Packages will teleport behind the player. Might help to better avoid enemies.</p>\n\n<p>40 Parsec Delivery is a game created in 72 hours for the Mini Jam 100. This jam's theme was \"Overload\", and its limitation was \"Chaos is everything\". It's also my first game ever made with PICO-8 (and in general)!</p>\n<p>As such, it is a little rough around the corners, and definitely has some bugs. I tried to fix them all, but if you do find one, I'm very sorry. I don't know if I'll update it after the jam. There were some things that I wanted to include not present in the game, like powerups or more enemies. I also think the difficulty is a little bit too high (That's why the Ring System exists - for people who want it to be a little easier).</p>\n\n<p>Special thanks to my dad for giving me the idea for the game, zep.p8 (Lexaloffle) for making PICO-8 and the Mini Jam staff for being awesome!</p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T04:36:35", "background_image": "https://media.rawg.io/media/screenshots/803/8038ec7c4d994d5e90850e1d500587f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Moracan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}