{"id": 74181, "slug": "cops-n-robbers-fps-3d-pixel", "name": "Cops N Robbers (FPS): 3D Pixel", "name_original": "Cops N Robbers (FPS): 3D Pixel", "description": "This is an online sandbox shooting game of 3D pixel style. It is easy to handle and will give you an exciting firing experience!<br/><br/>● REAL-TIME WORLDWIDE BATTLE<br/>Provide multiple servers for players around the world. Support up to 16 players in one game room.<br/>Come and play with your friends, neighbors and family on the battleground now.<br/><br/>● PVP, BE THE WINNER IN ALL GAME MODES<br/>Team Mode, Death Match Mode, Peace Mode, Stronghold Mode, Ghost Mode, Hide &amp; Seek Mode, Battle Royale Mode…<br/>Different combat modes bring different game experiences! Destroy the enemy and become an ace player!<br/>Don't miss the fierce season tournament. Will you be the next \"Master\"?<br/><br/>● PVE, STORY MODE - JAILBREAK, ZOMBIE MODE - SURVIVAL<br/>Story Mode: A classic mini mobile game combines island &amp; desert survival and jungle adventure.<br/>Zombie Mode: Solo or collaboration? Successfully defend against all zombies offenses and get rich rewards!<br/><br/>● SANDBOX CRAFTING - PIXEL WORD IS WHAT YOU MAKE IT<br/>Custom maps, weapons, armors, skins, and even gameplay, you can create everything you want!<br/>Use bullet hole, muzzle flash and weapon effect to make your weapon even more unique. Freely set weapon attributes according to your shooting habits!<br/>In the workshop, thousands of creations are waiting for you to download!<br/>Just free your imagination and create whatever you want.<br/><br/>● PERFECT EQUIPMENT SYSTEM - ABUNDANT ARMORY &amp; COOL ARMOR<br/>AK47, M4, Sniper, G36K, UZI, Desert Eagle… Awesome &amp; colorful pixel 3D model and texture!<br/>Besides the classic guns, there are super modern technology weapons!<br/>Warfare is ubiquitous! Pick up your gun to shoot and kill enemies and try best to survive!<br/><br/>If you are fond of multiplayer games, if you wanna a free game, if you want to be an epic hero… Download this fun fighting simulation now!<br/> <br/>*** Support &amp; Feedback ***\t<br/>Mail: support@joydogames.com<br/>Twitter: https://twitter.com/Riovox<br/>Facebook: https://www.facebook.com/riovoxofficial<br/><br/>Privacy Policy: http://www.riovox.com/en/privacy/index.html<br/>Terms of Use: http://www.riovox.com/en/terms/termsofuse-cnrfps.html", "metacritic": null, "released": "2013-08-26", "tba": false, "updated": "2019-07-29T17:51:39", "background_image": "https://media.rawg.io/media/screenshots/ebe/ebe16d0bd2ad27f54755f4c9748edb81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["JoyDo Entertainment"], "genres": ["Action", "Adventure"], "publishers": ["Liu Tao"], "esrb_rating": null}