{"id": 74182, "slug": "house-designer-fix-flip", "name": "House Designer: Fix & Flip", "name_original": "House Designer: Fix & Flip", "description": "House Designer is a simulator that allows you to try yourself as an interior and landscape designer, using your imagination, creativity and creative ideas. Buy abandoned houses, renovate and decorate them. Give them a second life and live in them or sell them for a profit!<br/>\n<br/>\r\nAt the beginning of the game you will have access to a small but cozy house. There you will be able to practice and start to reveal your skills as a designer in search of your interior style.<br/>\n<br/>\r\nUsing all the tools in your kit, you will have to perform tasks to clean and furnish houses and lots. Earn experience and improve your skills and abilities.<br/>\n<br/>\r\nExperiment with the hundreds of interior furnishings and decorations available in a variety of styles and colors. Start by furnishing a kitchen or a cozy bedroom. Make your own recording studio in the basement or decorate a children's room. Use a wide range of floor and wall coverings to decorate your home to your taste.<br/>\n<br/>\r\nCreate harmony and beauty on your property.Plant flowers and arrange decorative flower beds with exotic plants. Install a gazebo, place comfortable chairs in it, or tile the pool area and place sun loungers. It's all up to you. Plan the whole area according to your imagination.<br/>\n<br/>\r\nEnjoy hours of fascinating repairs with realistic interior models. A large number of interesting locations with their own history and curiosities lie ahead.", "metacritic": null, "released": "2018-08-17", "tba": false, "updated": "2023-12-11T04:59:44", "background_image": "https://media.rawg.io/media/screenshots/f9c/f9c8f99edd5e865973400094ad82adc9.jpg", "website": "", "rating": 4.75, "rating_top": 5, "added_by_status": {"owned": 5, "beaten": 2, "toplay": 4, "playing": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "iOS", "Android"], "developers": ["Sergey Kizima", "Karate Goose Studio"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["Sergey Kizima", "Karate Goose Studio"], "esrb_rating": "Everyone"}