{"id": 741882, "slug": "dungeon-of-anxiety", "name": "Dungeon of Anxiety", "name_original": "Dungeon of Anxiety", "description": "<p><em>The kobolds have invited you to a party in their dungeon. You are quite a shy wizard, but you decide to try and participate anyway...</em></p>\r\nControls\r\n<p>Arrow keys move your character around.</p>\n<p>Z and X activate your magic shield.</p>\n<p>CTRL + R resets the cart to try again.</p>\r\nRules\r\n<p>The magician can move all over the map. Your objective is to get a high score by grabbing as many coins as you can without getting touched by the kobolds. You get more points for time you've survived.</p>\r\nCOINS\r\n<p>They appear randomly around the grid of the map. Each time you collect one, another one appears right away. Each time you collect a coin, a kobold appears.</p>\r\nKOBOLDS\r\n<p>For each coin collected, a new kobold flows out from the gate, in a random direction at random speeds. They bounce around the map each time they touch a wall. Touching any of them results in a game over.</p>\r\nMAGIC METER\r\n<p>Your magic refills after usage, until the meter is full. With Z or X, you can activate your magic bubble.</p>\r\nMAGIC BUBBLE\r\n<p>The magic bubble can be activated for a short time when the magic meter is full. While it's activated, kobolds can't touch you and you phase through them. Careful not to touch a kobold right after it ends!</p>\n\n<p>\n</p>\r\nBehind The Scenes\r\n<p>A weekend of work for this game - and was it fun to make! Might be the first time I have to use a combination of Tile + Pixel position for collision checks. Didn't go too bad at all, after a few tries.</p>\n<p>I didn't actually imagine it at the start as an allegory for Social Anxiety at all. I just imagined you looting a dungeon of kobolds... but then I realized the similarities. I think it adds to the mood of it all - the costant attempting to not come in contact with others.</p>\r\nCredits\r\n<p>Game made in Pico8\r\n</p>\n<p>Design and Programming by KaaSnake\r\n</p>\n<p>Music and SFX by KaaSnake</p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T04:47:17", "background_image": "https://media.rawg.io/media/screenshots/587/5877a902bdf9606052d390347bd5f4aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KaaSnake"], "genres": ["Action"], "publishers": [], "esrb_rating": null}