{"id": 742049, "slug": "dunjon-mustard", "name": "Dunjon Mustard", "name_original": "Dunjon Mustard", "description": "<p>Hello!<br/></p>\n<p><strong>Dunjon Mustard</strong> is a seven-level dungeon crawler with simple on-screen combat mechanics, original monsters and map sprites and animations, full of pop-culture references and (hopefully) humorous dialog.\r\n</p>\n<p><strong>Dunjon Mustard</strong> is a working demo, you can play it all the way through and it has a defined ending. Fastest playthrough can be done in just over 20 minutes, early reports say it takes about 30 to 40 minutes to complete, depending on your play style.\r\n</p>\n<p><strong>Dunjon Mustard</strong> is not a \"classic\" RPG Maker game. I am simply using the RGP Maker MV program as the engine for my game. It does not utilize the combat theater or default game mechanics commonly associated with RPG Maker games.\r\n</p>\n<p><strong>Dunjon Mustard</strong> is the start of an idea that is nowhere near complete. The magic-based combat is nonexistent, there's no boss fight theatre per se', and in my mind these seven levels represent the \"tutorial\" or \"orientation\" of a bigger, 40-level adventure. But the one thing I learned for sure from my first demo is - don't spend a year polishing a turd no one wants to play to begin with. So I'm getting this preamble out in a demo form that is complete enough to playthrough to see if it leaves you wanting more before I go make any more of it.\r\n</p>\n<p><strong>Dunjon Mustard</strong> can be played online, but there are issues with lag loading the screens and heavier images if you have a slower connection. It can also be downloaded in EXE form which is a stand alone program for Windows that installs nothing. You know the drill.\r\n<br/><br/>\n<strong>Dunjon Mustard</strong> features Yanfly Engine Plugins, music from One Man Symphony, and tons of support from RPG Maker fans and forums like you.\r\n</p>\n<p>To report bugs or weirdness or constructive compliments you can reach me here or on most social media platforms @ webgamesetc\r\n</p>\n<ul><li>Download the ZIP file DunjonMustard.zip and put it into a folder you can locate easily.\r\n</li><li>Unzip (or ‘unpack’) the DunjonMustard.zip file then delete the DunjonMustard.zip file.\r\n</li><li>Inside the folder Dunjon Mustard double-click the game.exe file to run the game.\r\n</li><li>As the game does not install any software but runs off a stand-alone exe, you may need to right-click and “run as administrator” and click “yes” to the warning sign to proceed.\r\n</li><li>The game runs as a compiled exe from the RPG Maker MV engine, and I have not modified it nor added any programs or utilities to it.\r\n</li><li>There is no guarantee or warranty against effects on your computer or loss of data.\r\n</li></ul>\n<p>Dunjon Mustard Copyright © 2022 by Easyterminal Corp • Version A.22.051\r\n</p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T05:28:12", "background_image": "https://media.rawg.io/media/screenshots/696/696dc040a2ff3325138ffef2be38b0d4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 395, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WebGamesEtc"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}