{"id": 742056, "slug": "core_error", "name": "core_error", "name_original": "core_error", "description": "<strong>THE GAME</strong>\n<p>The system has been struck by a swarm of malware, and it's up to you to stop it! Unfortunately, you're not the one in charge of defences. The disk, on the other hand, is all fragmented, and nobody's cleaned it for months! Can you reorder everything, provide the system resources needed to fight off the horde, and avoid having your PC used as a bitcoin miner?</p>\n<p>If it gets difficult telling the different coloured tiles apart, you can turn on colourblind mode to add symbols to the tiles! You can use it even if you aren't colourblind (probably).<br/></p>\n<strong>THE CONTROLS</strong>\n<p>Controls are said to be:</p>\n<ul><li>Mouse to drag around tiles on the grid, hover over things, click things and so on</li></ul>\n<p>And that's all you need!</p>\n\n<strong>MY THOUGHTS</strong>\n<p>It's interesting to look at this game and then the tower defence game I made about a year ago, Attack on Alderia  - even though I had less time to make this one, it definitely has more content, which is impressive! It doesn't feel like I've improved that much, but clearly something must have happened between now and then. As for the game as it stands now, I like it; it has a decent amount of content, a fairly unique mechanic, an actually competent AI system, and a match-4 grid that I wasn't sure would work when I started. That being said, I also would've liked a little more polish, some sort of introduction, a better menu and UI and so on, though I guess I can't have it all. And, who knows, maybe I'll have added all that in the next tower defence game I make a year from now! I hope you enjoy playing the game as I had figuring out how it'd work, and do tell me if you beat all 3 levels - I'd love to hear!<br/></p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T05:34:11", "background_image": "https://media.rawg.io/media/screenshots/06f/06fd0e6035214c6b3fe4097f2d57adb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cakestorm"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}