{"id": 74200, "slug": "real-boxing-2-rocky-ko-fight", "name": "Real Boxing 2 ROCKY: KO Fight", "name_original": "Real Boxing 2 ROCKY: KO Fight", "description": "\"The boxing game we deserve.\" 8/10 – Gamezebo<br/>\"A big, brash boxing game that's surprising tactical at heart.\" 8/10 – Pocket Gamer<br/>\"Stunning graphics powered by Unreal Engine 4.\" — App Advice<br/>\"Not just a button masher.\" – Slide to Play<br/><br/>BECOME ROCKY BALBOA AND FIGHT FOR GLORY <br/>Enter the ring as Rocky Balboa and relive the epic boxing saga as you face legendary opponents including Apollo Creed, Clubber Lang and Ivan Drago. Explore the world of<br/>ROCKY with unique ROCKY-themed content and fight your way to the top!<br/><br/>JOIN AN ENDLESS MMO FIGHTING EXPERIENCE<br/>Challenge an elite of boxing champions and fight players from around the world, night or day, in single and multiplayer gameplay across hundreds of exciting events, story fights, and tournaments in a never-ending Career Mode.<br/><br/>ENGAGE IN FAST PACED ON-THE-RING ACTION<br/>Master jabs, hooks, uppercuts, body punches and combine them with devastating Special Punches and Focus abilities creating the ultimate combo to KO your opponent.<br/><br/>BATTLE AGAINST UNIQUE BOSSES<br/>Take on a new type of challenging opponent, each one available to challenge for a limited time before they’re gone. Defeat them all, claim their epic gear, and use it to wreak havoc in the ring.<br/><br/>CHOOSE YOUR STYLE OF BOXING<br/>Develop your boxer’s Strength, Stamina, Speed, and Endurance, level up your abilities, and equip powerful boosts to create your own unique fighting playstyle.<br/><br/>UNLOCK HUNDREDS OF POWERFUL ITEMS<br/>Progress and gain access to a huge number of unique, upgradable and customizable gear, enhancing fighting stats and abilities of your boxer.<br/><br/>CREATE THE ULTIMATE FIGHTER<br/>Use a robust set of options to create your own boxer – from body mass, muscle sculpture, and attitude, to details as small as eye color and nose shape.<br/><br/>CONNECT WITH FRIENDS<br/>Invite a friend and duke it out in real-time PVP action to find out who’s the best boxer right here and now. Fight for the quickest KO and best scores across a variety of leaderboards. Send and receive gifts with friends and rivals. Never stop competing!<br/><br/>PLAY EXCITING MINI-GAMES<br/>Train your fighter in exciting mini-games with legendary Mickey Goldmill and try your luck in the Daily Lottery for a chance to win awesome rewards.<br/><br/>FEEL THE POWER OF UNREAL ENGINE 4<br/>Witness jaw-dropping graphics fully utilizing the power of Unreal Engine 4 technology to create the most dynamic and visually stunning MMO fighting game experience.<br/><br/>Important information: Real Boxing 2 ROCKY™ is best experienced while playing on high-end devices. The game requires a persistent Internet connection to access all features.<br/><br/>Official Website: www.realboxing2.com<br/>Follow Real Boxing 2 ROCKY™ on Facebook: www.facebook.com/realboxing<br/>By downloading the game you accept our End User License Agreement, Terms of Service and Privacy Policy: http://support.vividgames.com/policies<br/><br/>Join the club, create your fighter and start boxing with Real Boxing 2 ROCKY™ – The Ultimate Fighting Game.", "metacritic": null, "released": "2015-11-18", "tba": false, "updated": "2019-10-22T14:24:44", "background_image": "https://media.rawg.io/media/screenshots/965/9658d8f4defb7848a694d2a19679b7ed.jpg", "website": "https://vividgames.com/gry/real-boxing-2-rocky/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vivid Games"], "genres": ["Action", "Sports"], "publishers": ["Vivid Games"], "esrb_rating": "Teen"}