{"id": 742264, "slug": "wie-wir-uns-an-dich-erinnern", "name": "Wie wir uns an dich erinnern", "name_original": "Wie wir uns an dich erinnern", "description": "<p>Du spielst Tabea, welche während der Vorbereitung zur Beerdigung ihrer Großmutter möglichst viele verschiedene Erinnerungen an diese sammeln möchte, um eine Grabrede zu schreiben und in dieser dem Leben ihrer Großmutter gerecht zu werden. Dabei wird sie an schöne Zeiten mit ihrer Oma erinnert, lernt aber auch Seiten von ihr kennen, von denen sie vorher nichts wusste.</p>\n<p><strong>Designziel</strong></p>\n<p>Wir wollten darstellen, wie unterschiedlich und facettenreich das Leben einer Person sein kann und wie unterschiedlich Menschen sich in ihrer Trauer dann dieser Person erinnern. Letztendlich kennt jeder einen anderen Ausschnitt von ein und derselben Person. Es mag viel verloren gehen mit dem Tod einer Person, aber die Erlebnisse dir wir hatten werden auf ewig prägen,  wie wir uns der Person erinnern. Das Spiel soll damit eine Erfahrung bieten, die Anregen soll darüber nachzudenken, wie komplex Personen sein können und wieviel Bedeutung, die Erinnerungen unterschiedlicher Personen haben können.</p>\n<p><strong>Steuerung</strong></p>\n<p>Das Spiel wird mit Tastatur und Maus gespielt. Gesteuert wird über WASD oder die Pfeiltasten, mit Enter kann interagiert werden. Zum Zusammenstellen der Grabrede können die Zettel per Drag and Drop auf den Notizblock gezogen werden.</p>\n<p><strong>Zukünftige Pläne</strong></p>\n<p>Es wäre schön noch weitere Dialogoptionen, welche wir uns schon überlegt haben auszuformulieren und dabei zum einen nochmal ein komplexeres Persönlichkeitsbild der Großmutter zu zeichnen und zum anderen auch nochmal Gegenstände intergrieren könnten, um auch die Rolle von materiallen Gütern für das Erinnern einer Person zu thematisieren. Gerne würden wir das Spiel auch noch mit einem atmosphärischen Soundtrack zu hinterlegen. Außerdem würden wir gerne noch den Hintergrund und die Dialog UI fertig gestalten und eine Laufanimation hinzufügen und die Gesamterfahrung durch mehr Playerfeedback runder gestalten.</p>\n<p>Team: Lena, Kira</p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T06:31:20", "background_image": "https://media.rawg.io/media/screenshots/29b/29b911a599add3b0de7de3bb2dc7f5ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lena"], "genres": [], "publishers": [], "esrb_rating": null}