{"id": 742302, "slug": "matisse-un-amour-du-jeu", "name": "Matisse: Un amour du jeu", "name_original": "Matisse: Un amour du jeu", "description": "<p><em><strong>Matisse : Un amour du jeu</strong></em> is a VR art game about Henri Matisse. <br/></p>\n\n<p>Guided by the voice of the master, make a breakthrough in his artstyle and enjoy, as Matisse would say, \"<em>with a tremendous spirit of adventure and a love of play</em>\". <br/></p>\n<p>Travel inside the canvas, inside the mind of Matisse, and create your own work of art in the style of the master. <br/></p>\n<p>Every color used in the game comes from Matisse artwork.<br/>Every word pronounced in the game comes from his writings &amp; interviews.<br/></p>\n<p>This game has been developped in 48h by Jean-Baptiste Leonelli and Simon-Pierre Mattei during the <strong>Pixel Weekend 2022</strong> (02/18/2022-02/20/2022), hosted by the Fab Lab Corti and the University of Corsica Pasquale Paoli.</p>\n<p>The two themes were : <strong>Matisse in Corsica</strong> and \"<strong>voler</strong>\" (both fly and steal in French).</p>\n<p>We hope you will enjoy this adventure in Matisse's mind as much as we loved to create it <br/></p>\n\n\n<p><em><strong>Matisse : un amour du jeu</strong></em> est un Art Game en RV sur Henri Matisse. <br/></p>\n\n<p>Guidé par la voix de l'artiste, entrez dans son art et amusez-vous \"avec un esprit formidable et un amour du jeu\". <br/></p>\n<p>Voyagez dans les toiles, dans l'esprit de Matisse, et créez votre propre œuvre d'art dans le style du maître. <br/></p>\n<p>Chaque couleur utilisée dans le jeu vient de l'œuvre de Matisse. <br/>Chaque mot prononcé dans le jeu vient des écrits et entretiens de Matisse. <br/></p>\n<p>Ce jeu a été développé en 48h par Jean-Baptiste Leonelli et Simon-Pierre Mattei pendant le <strong>Pixel Weekend 2022</strong>, du 18/02/2022 au 20/02/2022, par le Fab Lab Corti et l'Università di Corsica Pasquale Paoli. <br/></p>\n<p>Les deux thèmes : <strong>Matisse en Corse</strong> et <strong>Voler</strong>. <br/></p>\n<p>Nous espérons que vous aimerez cette aventure dans le monde de Matisse, autant que nous avons aimé la créer <br/></p>\n\n<p><strong>&lt;3<br/></strong></p>\n\n<p>Ce jeu a été développé sur le moteur de jeu Unity, avec Blender, Gimp, Audacity et la Suite Adobe. Merci à eux !<br/></p>\n<p>Toutes les œuvres utilisés dans ce jeu à visée non-commerciale appartiennent à leurs ayant droits.<strong> </strong>Merci à eux.</p>\n<p>Pour les œuvres de Matisse : © 2018 Succession H. Matisse / Artists Rights Society (ARS), New York<br/>Pour les œuvres de Louis Armstrong : Louis Armstrong™<br/>Pour les œuvres de Django Reinhardt : Copyright © – Universal Music S.A. France<br/></p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T06:39:24", "background_image": "https://media.rawg.io/media/screenshots/e0b/e0b481183537a07a8e96e0198f597458.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chaplisk", "jaybee1996"], "genres": [], "publishers": [], "esrb_rating": null}