{"id": 742467, "slug": "ice-cream-clicker-gabe-games-studio", "name": "Ice Cream Clicker (Gabe Games Studio)", "name_original": "Ice Cream Clicker (Gabe Games Studio)", "description": "<p>You live in Hawaii The country that sells ice cream it's very famous for desert a shopkeeper named john you are john! The worker in Hawaii Manage Cream. The Manager left and asks you to be in charge of the shop while On vacation. The customers wanted ice cream and sell it to use the ice-cream maker 2000 made in 1563 in the old times the machine is powerful it can make millions of ice cream!</p>The controls are to click the ice cream to buy money to give the ice cream to customers don't feel too tired of clicking it yourself just use auto clicks! known as ice-cream maker 2000's take the money 1+ for customers auto clicks increase.<br/>All about this game, it is made by one person to code, not real code only scratch code clicking the ice cream unstresses your brain to relax and chill down. Hawaii has a great population and amazing islands and cities! Go to Hawaii it is pretty cool and great and also beautiful it has tall mountains, hills, and good and pretty flowers!It started with a family, The Good Brooks. When John was a kid he dreamed of being an ice-cream shopkeeper when he is 14 the manager decided to say: \"John our shopkeeper left and went to break\" he allowed the manager to work for him they went on a plane and went to Hawaii to a shop on a beach it was a small stand named Hawaii Manage Cream.<br/>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T07:22:56", "background_image": "https://media.rawg.io/media/screenshots/f3e/f3e2cd94a2e414465e89283b71e58f48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gabe Games Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}