{"id": 7426, "slug": "metal-slug-attack", "name": "METAL SLUG ATTACK", "name_original": "METAL SLUG ATTACK", "description": "▼Simplified control!<br/>\"METAL SLUG ATTACK\", the very latest entry in the legendary game series from SNK PLAYMORE, is a strategy game with simple controls which can be enjoyed by everyone, and 2D dot-pixel characters who move and battle each other smoothly! Moreover, the newly added \"Support System\" feature will offer players deeper strategies and even more fun!<br/><br/>▼A plethora of missions!<br/>\"METAL SLUG ATTACK\" has different types of missions for all types of players with its \"ATTACK!\" game mode, in which players have to free military bases occupied by Morden's Armies, as well as the \"P.O.W. RESCUE\", \"COMBAT SCHOOL\" or \"TREASURE HUNT\" game modes.<br/><br/>▼Improve your Units!<br/>Collect items throughout your missions, and use them to customize your favorite Units. Make them evolve, level them up or activate their skills by equipping your Units with items!! Let's try to make the most impressive and poweful units!<br/><br/>▼Worldwide battles!<br/>In addition to the \"Real Time Battle\" mode which can be played and enjoyed by 4 players simultaneously, up to 6 decks can clash together in asynchronous battles! Defeat all your challengers, and hone your skills to become the Best Player in the World!<br/><br/>▼Play in co-op with brother-in-arms!<br/>Battle in co-op missions with brother-in-arms in the \"Guild Raid\" and \"SPECIAL OPS\" game modes, and communicate with them via the chat and mailing options. Make sure to fully enjoy \"METAL SLUG ATTACK\" with your best partners!<br/><br/>Official Facebook fan page:<br/>https://www.facebook.com/SNK.METALSLUGWORLD/<br/><br/>", "metacritic": null, "released": "2016-02-15", "tba": false, "updated": "2023-05-30T21:39:50", "background_image": "https://media.rawg.io/media/screenshots/26e/26e2d673f9d07e6c7a9441912cd0860e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 3, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 269, "game_series_count": 16, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["SNK"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["SNK"], "esrb_rating": "Teen"}