{"id": 742631, "slug": "tofu-1-the-highly-responsive-to-prayr", "name": "Tofu 1 ~ the highly responsive to prayr", "name_original": "Tofu 1 ~ the highly responsive to prayr", "description": "<p> I was 30 years old when touhou 5 came out I was a very naïve child that liked tohou projrectum But I didn’t have any moneys to buy official game So What did I do I cracked the game on crackagamea.coma And so One day I was at a garage sale And then I was at comiket and I went to the toho stand A weird Asian guy with no hair and a big fat fucking moustache went to see me and say “mmmmm judging by your style I assume ur a touhou fan mh is that right” …it was right, I was a touhou fan. What do u want, old gay person? (I was a very rude person at the time) The old man said: “I am also a touhou fan, do u want the official bta copy of touhou 1???? It’s a real one that zun gave me, I am his friend in highschiol” I said : HELL YEAH!!!!! I AM SO FRIKIN HAPPY!!!! Im going to play the official beta Time to play on my pc98!!! After doing my daily wanking on sakuya futa porn, istarted plugged my Nintendo pc985, and I started playing the OFIICCIAL beta of tofu projectrectum 1!!!!! Highly constipative to ballers (or ballas in the hood) Ok so when I started the game, I saw reimu from tohou project made by zun junya ota with hyperrealistic eyes!!!!!! OMG!!!!! I AM SCREMING WHILE I CAME ON MY FUMO COLLECTION like evcery touhou fan right BUT I didn’t really think of it, I thought it was a glitch, so I kept playing I continued playing the game. The game had only one option!!!!! “press start to play” I presed start and started the game The stage one started like normal. The only problem is that the background looked hyperrealistsic, like a REAL photo, all the blocks looked normal, only that they had reimu hakurei faces, weird…and reimu looked badly drawn. And when the blocks were destroyed, the rock vine effect sound was played!!!!! Wow!!!! So scary!!!! Also the timer was stuck at 666!!! Very scare!!!! Aaaaaaaaa!!!! I kept playing….BUT the levels were getting VERY scarier….the reimus looked sad, and then they bled blood from their eyes.;;;;; But I thought it was only a glitch and I continued playing and then reimu started being realistsic and very scary and im crying and then se came out of my screen and said…. ITS OVER JACK!!!! I AM GOD!!!! LIKE SONIC EXE!!!!!! HAHA!!! U R DED AND GAYYYYY and British AND SO I died. the end Never play the touhou beta!!!!!</p><br/><p>btw assets and orignal shit is from team shanghai alice it is only a joke, and a shitpost</p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-02-21T08:00:46", "background_image": "https://media.rawg.io/media/screenshots/915/915ec878b209e5275d501cbc70b4e702.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shaffy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}