{"id": 74260, "slug": "miami-crime-simulator-2018", "name": "Miami Crime Simulator 2018", "name_original": "Miami Crime Simulator 2018", "description": "Prepare yourself for the most challenging and action filled crime auto and robbery game ever as we take you to the Miami crime city where everything and anything happens all the time!! From fun to crime and robbery altogether! That is why the police and cops are always on the run with their gangster auto catching vehicles to catch anyone indulging in criminal robbery and auto theft mafia!!!<br/>The Miami grand gangster offers criminal gangsters the city liberty to complete their mission but not so easy, there will be a shadow of cops, police, FPS machine guns, auto theft, robbery and mafia gangsters looming around in this shooting game. It is full of thrill, going crazy, partying, drinking, stealing, criminal robbery and breaking the rules! With a lot of weapons, and mafia gangster and criminal auto gangs in the city Miami lined up, watch the game evolve into an intense city battlefield simulator of shooting games!<br/>You can enjoy multiple mafia gangster game features by playing this theft grand city Miami crime game! The best thing about this crime auto mafia and robbery game is that you’re neither the bad guy nor good guy! You are on a Miami grand mission which requires the mafia Miami city gangster to do auto theft crime, robbery, stealing in order to earn enough to finish the mission.<br/>No one can stop you or your mafia gang in this game because you rule the Miami crime city! Always being tracked down by the police and other mafia gang members this becomes the ultimate and newest kind of survival city battle game! But obviously police need to do their job so if you want to perform the theft gangster crime auto in Miami crime city, be vary of the police and other mafia gangsters!<br/>Download this Miami mafia crime city battle simulator, shooting game adventure of a lifetime as the Miami crime gangster and enjoy the auto theft to its hilt! Play the unforgettable Miami crime city simulator now to experience the gangster auto like never before! The city is already labeled a centre of sin so have a little extra ordinary fun and criminal auto breaking the rules!<br/>Enjoy the crime gangster adventure every moment of the auto theft game play! It is a dangerous theft gangster ride so be brave and daring and enjoy but also finish your mission! Live your life as a mafia gangster for a day in the sinful and enjoyment filled Miami  crime city!!<br/>There are so many gangster auto and mafia gangster in the crime city simulator just running around here and there.<br/>You have a few new features in this grand Miami shooting auto crime city simulator game, you can now unlock a specific number of rewards as health restore, bullets or money through watching some video tidbits! You now can have access to maximum variety of machine guns and special other weapons being a gangster like AK 47, UMP 45, M4 A1 etc.<br/>Get any Miami city auto and citizens car you find and rush to the mafia gangster clan to rescue your gangster friends!<br/>HOW TO PLAY GAME:<br/>● Start the city auto game<br/>● Select player from the given (3 males)<br/>● Enter grand Miami crime city location<br/>● You will receive mafia gangster video-based mission<br/>● The mission will also be video based from your gang<br/>● Mission includes to save your gang friends held hostage by enemy mafia gangsters<br/>● Receive cash from your leader<br/>● Follow navigation radar to perform all missions like going to weapon shop<br/>● Go to enemy of the mafia gangster to save your friend<br/>● Using onscreen controls fight with the mafia gang<br/>● Keep filling your health stamina bars<br/>● Next mission is running from police<br/>● Steal the city auto and car from citizens and escape<br/>● Steal from the bank as well to give your mafia gang<br/>● Restore your health meter<br/>FEATURES:<br/>● Time and mission based tasks<br/>● Navigation system<br/>● Theft crime and Miami crime city simulation<br/>● Story based mafia gangster game<br/>● HD graphics and fun game play<br/>● 3D simulation<br/>● Virtual city effects<br/>● Variety of guns<br/>● 3 characters", "metacritic": null, "released": "2018-05-11", "tba": false, "updated": "2019-10-22T14:24:46", "background_image": "https://media.rawg.io/media/screenshots/b3f/b3f8f0fc1b5eb8f4a39b6c8748c79595.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Saeed"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Usman Saeed"], "esrb_rating": "Mature"}