{"id": 74270, "slug": "scary-nun-horror-escape", "name": "Scary nun horror escape", "name_original": "Scary nun horror escape", "description": "Experience the most creepy escape story ever. You would love this mystery game as there are real<br/>haunted scenes in the escape house church and you will hear the realistic sound of the screaming all<br/>around you. This angry scary asylum game is all about the suspense and the secret mission that you will<br/>going to find out. Play the thrilling missions in this nun survival escape house simulator. Start the horror<br/>nun game now and find out the secret story behind the horror castle and the church.<br/>Let’s involve in the story of the horror nun escape:<br/>Are you afraid of the horror story? Do you want to hear the story of the escape plan from the scream<br/>house? You want to listen about the incident of the scary nun? Do you know that she lives in a haunted<br/>mansion where no one is dared to live? She is the only horror nun there in that abandoned house. But<br/>there is an escape story behind this. Once it was a castle of happy family. Everything seemed so<br/>contented in their lives. They lived there happily but soon some mystery happened in that castle and<br/><br/>everything was out of the control. The family members began to escape from the castle and one day the<br/>house was abandoned with this scary horror story. No one know what happened to the family.<br/>Are you courageous enough to solve the secret mission of this horror haunted mansion besides the<br/>church where no one is dared to go? Let’s find out how you can make the scary escape plan for this<br/>mystery game. You need to be careful about the horror nun house as she needs to be out of that<br/>abandoned house when you are going in there otherwise you will lost there. This scary asylum must be<br/>your survival mission in this nun escape house.<br/>Now it’s getting outside and you saw no one is there in that scary haunted mansion. So this is the best<br/>time to enter into the house because scary nun is out from the scream house. Now you are in the scary<br/>asylum. Roam around the rooms of the castle. You might find something about the mystery. You are<br/>entering into the room where scary nun sleeps. Did you hear some kind of scream? Oh! Did you hear<br/>someone locked the door? Go there and check if the door is locked or not! Alas! There you are! You are<br/>now trapped in the scary asylum escape house church. There is nothing you can do now. You can’t<br/>escape from this horror church.<br/>Now don’t be afraid or scared. You need to make a nun survival escape plan right now!! Don’t think of<br/>being trapped here for lifetime. Make a plan in this scary nun house before nun comes back. You need<br/>to find out the keys of the locked door in this horror nun house church. You don’t have enough time for<br/>this as you have only 5 days for the survival mission otherwise the scary nun will come back to the<br/>haunted mansion and will injured you with her axe and sword. If you don’t want to survive in this horror<br/>escape house then you need to find out keys and also the axe for the combat attack.<br/><br/>HOW TO PLAY THIS GAME<br/>Tap to start the scary nun house escape mission<br/>You are now in the scary nun house church<br/>Search for the keys to unlock the door of the haunted mansion<br/>Easy to use on screen controls to roam around the nun house<br/><br/>FEATURES<br/>3D extreme haunted escape nun house environment<br/>Horror creepy background sounds<br/>5 days to accomplish the horror escape plan<br/>Trapped in the horror nun house<br/>Search for the keys in the abandoned house within 5 days", "metacritic": null, "released": "2018-07-23", "tba": false, "updated": "2019-10-22T14:24:46", "background_image": "https://media.rawg.io/media/screenshots/568/568007f88f1beee717b5914661df66da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Saeed"], "genres": ["Adventure", "RPG"], "publishers": ["Muhammad Usman Saeed"], "esrb_rating": "Mature"}