{"id": 742769, "slug": "builder-defender-ags-cut", "name": "Builder Defender (AG's cut)", "name_original": "Builder Defender (AG's cut)", "description": "<p><strong>[Disclaimer]</strong></p>\n<p>I don't own any of the assets in this game, all assets are from the course / Code Monkey (except for the music in title screen). You can check out the course from the link below.</p>\n<p><strong>Settings:</strong></p>\n<p>This is my result of Code Monkey's <strong>\"Awesome Builder-Defender Course\"</strong>.  My purpose is just to show you what my version of this game is, it may give you an idea of what you could learn from his course. </p>\n<p><strong>Moment to moment gameplay:</strong></p>\n<p>You build buildings around the natural resources which are all scattered around the map to get resources, you will spend resources to not only build more buildings to generate resources faster, but also create defenses to defend the HQ. </p>\n<p>Once the HQ is destroyed you will lose the game, however all the buildings are repairable if you have the required resources, so that you can always have a chance to recover from previous mistakes and keep playing.</p>\n<p><strong>Fun Factor:</strong></p>\n<p> - Short and Easy to play, you can just jump right into it and play for 15mins.</p>\n<p><strong>Special feature added not from the course:</strong></p>\n<p> - Difficulty selection, you can play it on easy or hard difficulty to make it more challenging,</p>\n<p><strong>Course Link:</strong></p>\n<p>https://www.udemy.com/course/awesome-builder-defender-game-in-unity/</p>\n<p><strong>Lastly...</strong></p>\n<p>Hope you enjoy it, although I know that this is not my original project, but I have learnt a lot when making it. Thank you for reading till the end and I hope you have an awesome day. See you at the next project.</p>", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-02-21T08:46:20", "background_image": "https://media.rawg.io/media/screenshots/1cb/1cb4e3c9714f980abecf9289a5c0c0de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amulet Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}