{"id": 742807, "slug": "the-legend-of-asamnir", "name": "The Legend of Asamnir", "name_original": "The Legend of Asamnir", "description": "The Legend of Asamnir V0.3.0\r\n<p>The Legend of Asamnir is an adventure RPG, in which you play a dwarf named Thorin, who searches for the way back to Svartalfheim (his home). On your way you find items, kill enemies, talk to NPCs and endure many bad jokes.</p>\n<p>The game is free and open source. For the source see the GitHub Page of this project.</p>\n<p>The graphics that I used for this game are all taken from itch.io and are available for free. Most of the characters came from Elthen's Pixel Art Shop. The tileset was created by pipoya, and most of the menu graphics were created by pixelfrog.<br/></p>\n<p>This pre-release version includes the main map and 2 out of 5 planned levels.\r\n The game includes about 2-3 hours of content. It can be saved and continued at any time.\r\n There are still some bugs left to fix, but these should not be critical for the gameplay (see known issues).\r\n </p>\r\nIncluded Levels\r\n<ul><li>Proloue\r\n</li><li>Tutorial\r\n</li><li>Main Map\r\n</li><li>Dark Forest\r\n</li><li>Graveyard's Vault\r\n</li></ul>\r\nMissing Levels (working titles)\r\n<ul><li>Northern Hills\r\n</li><li>Southern Area\r\n</li><li>Final Dungeon\r\n</li></ul>\r\nKnown Issues\r\n<ul><li>When a game is started and the player navigates back to the main  menu, the game cannot be started anymore (it needs to be restarted  completely) <ul><li>Workarrounds: <ul><li>Quit the game and start it again. The first time a game is started or loaded, everything works.\r\n</li><li>While the game is started, a different game state can be loaded from the pause menu.\r\n</li></ul>\n</li></ul>\n</li><li>In rare cases, a bomb that would be in range of an enemy or an object, misses and doesn't deal damage <ul><li>Workarround: In places where the bombs are needed to proceed, there  is a spawn point for new bombs that spawn as soon as the player runs  out of bombs. So just throw some more bombs...\r\n</li></ul>\n</li><li>In rare cases, items that are dropped (by destroyable objects like barrels, by chests or by enemies) cannot be picked up. <ul><li>Workarround: If the items are critical to continue (like keys), you need to reload the last checkpoint from the pause menu.\r\n</li></ul>\n</li><li>The scaling of the  background image of the in-game menus is wrong, when the  size of the game window is changed (or when the game is started in  fullscrene mode) <ul><li>Workarround: None (just a displaying issue)\r\n</li></ul>\n</li></ul>\r\nRoadmap for the next releases\r\n<p>It is planned to add <strong>3 new levels</strong> with some new items, enemies and <strong>3 new boss fights</strong>.\r\n Also it is planned to add some more sound effects and background music. And a lot more bad jokes will be added to the story :)\r\n</p>", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-02-21T08:57:09", "background_image": "https://media.rawg.io/media/screenshots/d89/d8931b9869759bc641355a2948b1ef0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Tux4711"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}