{"id": 742896, "slug": "world-nations-game-itch", "name": "World Nations Game (itch)", "name_original": "World Nations Game (itch)", "description": "<p>World Nations Game is an online MMO game in which you can have your own virtual life. You can join a nation, buy vehicles, items, properties, open a political party, fight in international battlefields, participate in races, take part in special agent fights between agents from other countries, attack other citizens space colonies on any country map, be a nation senator or president, be part of the world congress, vote on nation issues and you can do many other activities.<br/><br/>Upon joining World Nations Game the player starts his life as a citizen and is assigned to a virtual country citizenship based on his choice from when joined the game. Each of these countries are named after an actual country in the real world. Once started the game a citizen also has assigned his own space colony in his country teritory that he can use to produce items and attack other citizens colonies.<br/><br/>World Nations Game tends to be a combined version of the real world with the fun of a game where citizens can play the game and also follow the footsteps of world politics where anyone can be a country senator or country president and they are chosen by direct vote from other citizens. The government of a country is also part of the international World Congress which is the governing body of the world.<br/><br/>Training, working, fighting in wars, attacking other player space colonies and taking part in races is done on a daily basis. One of the main drawing points of the game is that it has all features of a game like multiplayer with rpg part and strategy included so you can have fun in many ways and most importantly you decide the time you want to invest in it and what you want to do as an activity inside the game.</p>", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-02-21T09:24:28", "background_image": "https://media.rawg.io/media/screenshots/732/73285661d6b2b05e7bb7b10eec52faff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SCLITIFY IT"], "genres": ["RPG", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}