{"id": 74296, "slug": "scary-death-creepy-scream", "name": "Scary Death Creepy Scream", "name_original": "Scary Death Creepy Scream", "description": "With the increasing trend of horror games join us as we take you on a horror survival in this haunted<br/>hospital game where you are trapped by the scary nurse! The horror hospital is full of scary things and<br/>multiple traps so that the scary nurse can make sure you don’t leave the hospital!<br/>Witness how a simple desire for treatment turns into an endless nightmare of house escape from the<br/>haunted hospital!<br/>You are lying peacefully on your hospital bed when suddenly the lights turn dim and the night falls low<br/>and everything begins to change. There is a stinky hospital smell rummaging about the hospital building<br/>and you’re confused what to do. You start hearing scary noises and want to escape immediately! But<br/>there seems to be nor way!<br/>There are multiple escape doors of the horror hospital but all are locked by the scary nurse! She is<br/>hidden the keys in different rooms and in order to escape you need to run out of your room and find the<br/>keys in the rest if the hospital!<br/>Never did you know you’d end up trapped in a scary and haunted hospital when all you wanted was to<br/>go to the hospital to get treated! This is what makes the more adventurous like many other horror<br/>games!<br/>It is the struggle to escape from the survival horror since every step you take is nothing but a huge risk<br/>but that is what amounts for the adventure! Be very tactful and learn to escape the horror hospital<br/>without being caught by the horror hospital nurse!<br/>It seems like the enclosure and coming of the apocalypse and everything and everyone has been<br/>affected in the hospital. But you’re the only one safe and now have to house escape!<br/>You must stay through this survival game and escape the horror hospital very carefully for it is slowly<br/>becoming a mental hospital!<br/>Now the chase is, you have to make the escape from the horror hospital, run away from your room and<br/>go in the other rooms to find the main escape key of the main hospital door! They must be hidden in<br/>drawers, cupboards and other places like under the bed.<br/><br/>Beware of the ghosts haunting the haunted hospital of the horror survival game and obviously the<br/>haunted nurse!<br/>If you get caught by the nurse, you’re done for. Definitely stay away from her she won’t let you go in this<br/>horror adventure! She’s definitely crazy! You have very little days to house escape from this horror<br/>hospital!<br/>Using on screen controls you can hide from the scary nurse and other ghosts under beds or behind<br/>doors but don’t get caught and as soon as you find all the keys escape and run away immediately!<br/>HOW TO PLAY GAME:<br/>- Begin the haunted hospital game<br/>- Use the on screen controls to quietly escape the room<br/>- Cross pathways of the horror hospital to enter other rooms<br/>- Use the controls to hide in designated corners<br/>- Use controls to open drawers and cupboards and pick keys<br/>- Follow navigation map to lead you to the keys<br/>- Use joystick to move around<br/>- Run after collecting all the keys<br/>FEATURES OF THE GAME:<br/>- Hospital simulation<br/>- Multiple on screen controlling features<br/>- 3D simulation<br/>- HD graphics<br/>- Escape house game<br/>- Navigation map<br/>- Evil and scary nurse simulator<br/>- Player perspective game play visuals", "metacritic": null, "released": "2018-04-26", "tba": false, "updated": "2019-10-22T14:24:47", "background_image": "https://media.rawg.io/media/screenshots/185/18549000d267c6a2497cfcfca2d98d21_67N4CeG.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Saeed"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Usman Saeed"], "esrb_rating": "Mature"}