{"id": 7429, "slug": "arctic-shuffle-2", "name": "Arctic Shuffle 2", "name_original": "Arctic Shuffle 2", "description": "Chill out with puzzle gameplay from the arctic arcade. The pinball penguins you loved from the original version are back! With adorable artwork, original music and addictive gameplay, Arctic Shuffle 2 is flinging good fun.<br/><br/>Arctic Shuffle 2 features:<br/>-Great new scoring system<br/>-Challenging new levels <br/>-Fun animations and amusing obstacles <br/>-Improved performance <br/>-Pause and restart gameplay<br/>-Play your own tunes during game play<br/><br/>Play by aiming your penguin pal at the target. But watch out for obstacles that block, bounce, drown and destroy your precious penguins. Start with ice curling, mix in some mini-golf, try to prevent your penguins from exploding and more! <br/><br/>Improve your score by completing the levels quickly and use the fewest number of penguins you can. Once you’ve mastered all 50 levels buy additional level packs as an in-app purchase.<br/><br/>Want to learn more? See a sample gameplay video and additional screenshots on our developer site. Or try Arctic Shuffle Lite for free with 10 complete levels.<br/><br/>Praise for Arctic Shuffle:<br/><br/>“it’s sort of curling with penguins, and it’s a whole lot of fun. The penguins are really cute and there’s a lot of levels, so you’re not going to get bored anytime soon.” Mr. Mobile<br/><br/>“Arctic Shuffle is a fun little puzzler.” appVersity<br/><br/>“Arctic Shuffle is definitely a fun game. . . It’s a quick distraction that doesn’t cost much and rewards a little play here and there.” The 10k.com<br/><br/>“The best way to describe it would be as a thinking puzzler. . . and you get graphics of the cute penguins in their snow caps celebrating after you beat a level.” Portable Gamer", "metacritic": null, "released": "2009-08-15", "tba": false, "updated": "2019-10-22T14:29:21", "background_image": "https://media.rawg.io/media/screenshots/821/8212a658ea1e88b6440152234f37247c.jpeg", "website": "http://www.arcticshuffle.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["zinc Roe"], "genres": ["Arcade", "Puzzle"], "publishers": ["zinc Roe"], "esrb_rating": "Everyone 10+"}