{"id": 742979, "slug": "try-to-balance-it", "name": "Try To Balance It!", "name_original": "Try To Balance It!", "description": "<p>Cute little animals will keep you company. They like to eat, wear cool clothes, and get in your way. Relaxing leisurely game with unique gameplay! You have never seen such a game! Nice 3D graphics, physics, animations and sounds! Balance items in baskets. Balanced items are destroyed. More items in baskets - more points. The game has 46 levels and endless modes! Try to score 3 stars in each of them and earn all the achievements in the game.</p>\n<p>Different game rules:</p>\n<p>Destroy items - destroy food by balancing the libra.</p>\n<p>Balance all the items - balance the food before the time is up.</p>\n<p>2048 - merge the same cubes and keep the balance. The minimum cube is 2, the maximum is 2048.</p>\n<p>\"Match3\" - stack spheres of the same color and balance the baskets.</p>\n<p>Combo system - for the destroyed item and the merger of cubes or spheres you get coins. More coins - more points. At the end of the round, the animals compare the number of coins.</p>\n<p>Earn crystals and spend them on power-ups:</p>\n<p>Additional attempts - put items at the end of the queue if you run out of space.</p>\n<p>Lightning - helps to separate cubes or spheres.</p>\n<p>Bomb and dynamite - will help get rid of unnecessary items.</p>\n<p>Doubling - increase the quality of a cube or sphere.</p>\n<p>Free game modes with endless waves of items. Try to score 1, 2 or 3 million points! Take the top lines of the leaderboard! Good luck!</p>", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-02-21T09:45:00", "background_image": "https://media.rawg.io/media/screenshots/60c/60c87faf04a984c61f8e9b9934451518.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FenixAsa"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}