{"id": 743041, "slug": "winds-of-change-itch-klace", "name": "Winds of Change (itch) (Klace)", "name_original": "Winds of Change (itch) (Klace)", "description": "<em>\"Winds of Change is a thrilling fantasy visual novel about the oppressed and downtrodden finding hope and doing everything they can to change their world for the better, a story everyone can enjoy.\"  <br/></em><strong>Gamer Escape - 100/100</strong>\n<em>\"For those who have always been curious about Visual Novels and what they bring to the video game table, Winds of Change is a great first step into that world.\" <br/></em><strong>GameSpace - 90/100</strong>\n<em>\"It is clear that the developers put in some serious time woodshedding, doing their homework, hitting the gym, or whatever metaphor you fancy over the past few years, because Winds of Change is a tremendous improvement over Major/Minor and a total labor of love.\" <br/></em><strong>RPGFan - 84/100<br/></strong>\n<em>\"This is a thoroughly absorbing piece of fiction that manages to justify being a video game by virtue of skillfully integrated choices and missable content, making multiple playthroughs a potentially appealing prospect. The voice acting throughout is extremely impressively performed, the UI and controls are nearly perfect.\" <br/></em><strong>NintendoLife - 80/100</strong>\r\nWinds of Change was also nominated for an Ursa Major Game of the Year award, and was awarded/ranked as one of the Best and Most Discussed Games of 2021 by Metacritic. We hope you enjoy your journey in Alestia!\r\n\n<p>You are The Seer of Valinorth.</p>\n<p>Blessed by the realm of spirits, you are given visions of the future in order to steer your nation's history down the right path. However, one night, a vision shakes the very foundation of everything you know. Forced to leave your home for good, you are thrust into the larger world of Alestia, and taken in by the arms of The Rebellion. Vying for freedom from the tyrannical rulers of the world – The Triumvirate – The Rebellion fights for liberation.</p>\n<p>At the center of this conflict is the mysterious “Blade of Exodus”. Once belonging to The Triumvirate themselves, it seems the key to victory may lie in using their own weapon against them. But who can wield an artifact of such immense power? Is victory really within reach, or will The Rebellion fall and be lost to history? The fate of everything rests on your shoulders alone, Seer.</p>\n<p>Choose wisely, and enjoy your adventure...</p>\n\n<ul><li>In-Depth point and click interface!<br/>\n</li><li>Massive story line set in an incredible fantasy world!<br/>\n</li><li>Fully voice acted by a stellar cast!<br/>\n</li><li>Bond with your comrades!<br/>\n</li><li>Pursue friendships, and even romances! (not limited by gender)<br/>\n</li><li>Non-linear story flow! Feel free to stop and explore!<br/>\n</li><li>Open world atmosphere. Return to past areas at any time!<br/>\n</li><li>Find hidden objects and books in the environment! Learn about the world!<br/>\n</li><li>Stop and chat with your party members at any time!<br/>\n</li><li>Watch your party members interact with each other in skits!<br/>\n</li><li>View scenes taking place all across the world! Multiple stories at play!<br/>\n</li><li>Experience side quests and optional stories!</li></ul>\n\n<p><em><em>Winds of Change features a massive voice cast, featuring top talent from the industry! The game is FULLY voice acted, with every line of dialogue being spoken. There are around 25,000 lines of dialogue in Winds of Change across 15 hours of VO audio. Voice Talent in Winds of Change can also be heard in the following games/franchises:</em></em></p>\n<ul><li>The Legend of Zelda<br/>\n</li><li>Pokemon</li><li>Marvel's Avengers</li><li>Persona 5<br/>\n</li><li>Hunter x Hunter<br/>\n</li><li>One Punch Man<br/>\n</li><li>One Piece<br/>\n</li><li>Fire Emblem<br/>\n</li><li>Re:ZERO <br/>\n</li><li>Dust: An Elysian Tail</li></ul>", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T10:00:52", "background_image": "https://media.rawg.io/media/screenshots/294/29413779febdbf286ec6617505cb9d44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 452, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Klace"], "genres": [], "publishers": [], "esrb_rating": null}