{"id": 74307, "slug": "darkness-rises", "name": "Darkness Rises", "name_original": "Darkness Rises", "description": "Darkness crawls throughout the land and within it lurks a horde of ferocious demons ready to breach our gates. The path ahead will be grueling, but you must persevere and descend into hell itself to destroy this evil before it ravages our world.<br/><br/>Darkness Rises is a revolutionary Action RPG that blends gorgeous graphics, innovative gameplay, and intense boss battles, all within the palm of your hands.<br/><br/>From the earth-shattering Berserker to the magic-wielding Wizard - choose from a number of classes that fits your playstyle. Decimate fearsome monsters with a flurry of powerful skills or unleash them in the arena against other players.<br/><br/>Conquer the darkness before it conquers you.<br/><br/><br/>Key Features:<br/><br/>BOSS FIGHTS<br/>Engage in challenging boss battles that will put your skills to the test as you venture deeper into the abyss<br/><br/>AWE-INSPIRING GRAPHICS<br/>Experience stunning visuals that will truly immerse you into the world of Darkness Rises<br/><br/>GROUNDBREAKING GAMEPLAY<br/>Use the Soul Link ability to seize control of monsters and turn your enemies against themselves <br/><br/>EPIC DUNGEON RAIDS<br/>Gather your allies and guildmates to explore menacing dungeons and discover rare loot<br/><br/><br/>Follow us on official communities to get latest news and updates!<br/>Facebook: www.facebook.com/NexonDarknessRises<br/>PLUG: www.plug.game/darknessrises/<br/><br/>Terms of Service: http://m.nexon.com/terms/304<br/>Privacy Policy: http://m.nexon.com/terms/305<br/><br/>Recommended Specifications: iPhone 6S or higher / iOS 9.0 or higher<br/>Minimum Specifications: iPhone 5S / iOS 11 (For iPhone 6S or higher: iOS 9.0)<br/><br/>■ App Permissions Information<br/>In order to provide the below services, we are requesting certain permissions.<br/><br/>[Optional Permission]<br/>- Optional permission does not affect gameplay.<br/>Camera: Taking screenshots to help with customer service inquiries<br/>Photos: Attaching screenshots for customer service <br/><br/>[Permission Management]<br/>▶ Settings &gt; Privacy &gt; Select the permission<br/>※ This app offers in-app purchases. You can disable this feature by adjusting your device settings.", "metacritic": null, "released": "2018-06-25", "tba": false, "updated": "2019-10-22T14:34:06", "background_image": "https://media.rawg.io/media/screenshots/b93/b937ddfbdd502f8a6594afd0b359f933.jpg", "website": "", "rating": 4.0, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 4, "beaten": 2, "toplay": 3, "dropped": 8, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 642, "game_series_count": 0, "reviews_count": 10, "platforms": ["Android", "iOS"], "developers": ["NEXON Company"], "genres": ["Action", "RPG"], "publishers": ["NEXON KOREA"], "esrb_rating": "Teen"}