{"id": 743181, "slug": "game-890", "name": "1865", "name_original": "1865", "description": "FR \r\n<p><em><strong>1865, </strong></em><strong><em>la Guerre des Robots fait rage, votre train est inarrêtable, juqu'où irez-vous pour l'amour de l'or ?</em></strong> est un prototype que nous avons développé en 48 heures dans le cadre de la <strong>#AsusGameJam</strong> avec pour contrainte le thème <strong>\"Vous pouvez vous arrêter, mais...\"</strong></p>\n<p>Comme le laisse deviner son titre évocateur, le but du jeu est de collecter le plus d'or possible, tout en esquivant les robots qui attaquent les rails. <strong>Vous pouvez vous arrêter</strong> pour consulter la carte et optimiser votre trajet, <strong>mais...</strong> en contre partie, cela fera augmenter la température de votre locomotive, et donc sa vitesse.  À la fin de chaque trajet, <strong>vous pouvez arrêter</strong> la partie et confirmer votre score, ou continuer <strong>mais...</strong> risquer de tout perdre !</p>\n<p><strong>Jusqu'où irez-vous pour l'amour de l'or ? ☠️</strong></p>\n\r\n- À propos de nous : Les Crafteurs -\r\n<p>On est un studio de quatre créatifs basés à Lille. Ensemble, on a décidé d’unir nos forces pour fabriquer tout un tas de projets originaux, dont <strong>Toasterball</strong>, un jeu de sport multijoueur avec des grille-pains.</p>\n\n\r\nEN\r\n<p><strong><em>1865, the War of Robots rages, your train is unstoppable, how far will you go for the love of gold?</em></strong> is a prototype that we developed in 48 hours as part of the <strong>#AsusGameJam</strong> with the theme <strong>\"You can stop, but...\"</strong></p>\n<p>As the title of the game indicates, the goal is to collect as much gold as possible, while dodging the robots that attack the rails. You can stop to consult the map and optimize your route, but it will increase the temperature of your locomotive, which will then go faster and faster. At the end of each section, you can stop the game and confirm your score, or continue but risk to lose everything!</p>\n<p><strong>How far will you go for the love of gold? <strong>☠️</strong><br/></strong></p>\n\n\r\n- About us: Les Crafteurs -\n<p>We are a studio of four creatives based in Lille. Together, we decided to join forces to make a whole bunch of original projects, including Toasterball, a multiplayer sports game with toasters.<br/></p>", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T10:34:28", "background_image": "https://media.rawg.io/media/screenshots/6ab/6ab2820e23d2967d2b740757aa4ee8b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Les Crafteurs"], "genres": ["Action"], "publishers": [], "esrb_rating": null}