{"id": 743288, "slug": "flag-quiz-by-1000logos", "name": "Flag Quiz by 1000Logos", "name_original": "Flag Quiz by 1000Logos", "description": "<p>Do you remember the order of colors on the flag of Russia or Italy? Do you know what the Estonian flag looks like? This free educational app will refresh your memory on the topic of national flags and introduce you to the flags of exotic countries around the world.</p>\n<p>Why is this quiz better than many other games about flags?</p>\n<p>Because here you will find all the flags of independent countries and dependent territories of the world! All flags are grouped by continent.</p>\n<p>You can learn flags separately for each continent: from Europe and Asia to Africa and South America.</p>\n<p>The game offers 2 levels of difficulty:</p>\n<p>1. You can independently enter the name of the country you see on the flag</p>\n<p>2. You can choose one of the 4 proposed options.</p>\n<p>In addition, you can use the hints:</p>\n<p>- Remove 2 extra choices</p>\n<p>- Show a random letter in the word</p>\n<p>- Remove extra letters in the word</p>\n<p>- Show the whole name of the country.</p>\n<p>If you can't guess the country within 30 seconds, you'll get a hint (the name of the capital).</p>\n<p>A great game for anyone studying world geography. Maybe you can remember what the flag of the USA, France, or another of more than 190 countries around the world looks like.</p>\n<p>A great game for everyone who studies geography from the creators of the game \"1000 Logos Quiz\". Beautiful and clear design will help you test your memory and learn new flags.</p>", "metacritic": null, "released": "2022-02-18", "tba": false, "updated": "2022-02-21T11:01:55", "background_image": "https://media.rawg.io/media/screenshots/97c/97cf2491fd1ac978aae3437ab90eca65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["ALX Software Development"], "genres": [], "publishers": [], "esrb_rating": null}