{"id": 74327, "slug": "scary-teacher-haunted-school", "name": "Scary Teacher Haunted School", "name_original": "Scary Teacher Haunted School", "description": "Do you feel it too? Something doesn’t feel so right around you. You no longer hear the chanting noise of the school kids or the shouts of the virtual teacher is everybody gone? Goosebumps are creeping up your neck, this cannot be a reality, and this must be some scary game!<br/>Yikes! This is not your room, it’s a spooky house! You are kidnapped?! The rope is strangling your hands and a cloth covering your mouth, this must be a fake scary game! The evil scary teacher has kidnapped you and trapped you in the haunted school spooky class room, nobody can rescue you, and you are alone to escape from this evil high school teacher!<br/>This creepy high school horror school holds a lot of scary and evil secrets which you never knew but now need to be disclosed to help you escape the scared famous scary teacher haunted high school game. You have to be weary of the teacher’s wrath and her curse or you might lose your life in a blink of an eye! The hello bully teacher 3d is fond of kidnapping kids for her blood appetite and there are many other kids who are lost and kidnapped!<br/>The hello bully teacher 3d will not let you live or spare you for invading her secret territory but if you remain in this spooky class room for a long time, you might as well suffocate to death! So play these survival houses escape game and escape the haunted high school class room, the Goosebumps inducing prison which will swallow your light in its room haunted darkness!<br/>The evil neighbor has helped the scary teacher in kidnapping you because the neighbor hates your guts! He is taking revenge by trapping you in the room haunted in the horror high school game, so you no longer can be seen in the evil neighborhood of the scary teacher high school. Now you have to design an escape plan game to rescue yourself from the spooky creeping Goosebumps of the horror survival escape game!<br/>In this scary high school teacher game you are trapped and if you try to escape the evil teacher she will give you a scary a punishment! You have to devise a high school escape game plan to save yourself; you’re trapped all alone in this quest of house escape for five days!<br/>Only one way to save you, look around and sneak in every spooky class room without making any noise and search for the key to the house. Remember you only have 5 days to try and escape the haunted school and scary teacher after which you might become a forever captive!<br/>HOW TO PLAY SCARY TEACHER GAME:<br/>•\tDOWNLOAD the scary teacher game<br/>•\tThe character is trapped in class room environment<br/>•\tUse onscreen touch controls to silently move out of the class room <br/>•\tIf you sense the evil teacher around, hide from her<br/>•\tEscape plan game by sneaking from one class room to another <br/>•\tUse game play keys and icons to find key in other class rooms <br/>•\tSearch in cupboards and drawers too.<br/>•\tHide under bed or closet when spotting scary teacher<br/>•\tWhen you find the key, silently leave the haunted high school <br/>•\tTry not to make any noise<br/>FEATURES OF THE SCARY TEACHER GAME:<br/>•\tHaunted High school simulation <br/>•\tOnscreen touch controls move about<br/>•\tEscape game <br/>•\tRealistic graphics <br/>•\t5 game play episodes as for 5 days<br/>•\tScary virtual teacher", "metacritic": null, "released": "2018-05-13", "tba": false, "updated": "2019-10-22T14:24:48", "background_image": "https://media.rawg.io/media/screenshots/701/701e4ff434b65332111599fac7582284.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Saeed"], "genres": ["Adventure", "RPG"], "publishers": ["Muhammad Usman Saeed"], "esrb_rating": "Mature"}