{"id": 743402, "slug": "succubus-rhapsodia", "name": "Succubus Rhapsodia", "name_original": "Succubus Rhapsodia", "description": "<p>A few days have already passed without the witch Ramil, the master, suddenly waking up.<br />\nLaurat, a disciple of Ramil, was worried that he would not regain consciousness at all.<br />\nSearch the master&#39;s lab and find a mysterious record there.<br />\n&quot;Dream interference&quot;<br />\n&quot;This is a dream. It&#39;s just a dream.&quot;<br />\nThe research record entitled Dream Interference is not like a master,<br />\nOnly the contents that seemed extremely rough were described.</p>\n<p>Before I knew it, it was a cloudy dream world.<br />\nThis world is a magical land where a threat called &quot;Incubus&quot; with a bewitching appearance spreads.<br />\nThey are the leaders of the fall that seduce humans and turn them into abandoned people.<br />\nLaurat&#39;s dreams are filled with lewdness by them.<br />\nIs it a frenzy dream or a reality of well-being?</p>\n<p>-Golden Incubus tells you not to expect a reply.<br />\n&quot;Idiot. Dreams can&#39;t be unreal.&quot;</p>\n<p>All battles in this game are SEX.</p>\n<p>Almost all the enemies that appear are attractive women called &quot;incubus&quot;.<br />\nThe player wins the battle by giving pleasure to the incubus and making it cum.<br />\nIn addition, in order to resist the attack of the Incubus, we will make friends by contracting with the Incubus that we have met, and we will face the enemy Incubus together.</p>\n<p>Don&#39;t be drowned in the sweet temptation of the Incubus, explore the world of dreams and aim for the end.</p>", "metacritic": null, "released": "2016-08-15", "tba": false, "updated": "2022-02-21T16:33:27", "background_image": "https://media.rawg.io/media/screenshots/532/532f01cddfd130374ea4dcc9f3d6ba32.jpg", "website": "https://www.dlsite.com/maniax/work/=/product_id/RJ181931", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["RPG"], "publishers": [], "esrb_rating": "Adults Only"}