{"id": 743509, "slug": "is-the-demon-lords-life-endangered-by-the-elf-knig", "name": "Is the Demon Lord's Life Endangered by the Elf Knightess?", "name_original": "Is the Demon Lord's Life Endangered by the Elf Knightess?", "description": "<p>I&#39;m Latina the elf knightess.</p>\n<p>You are the Demon Lord, who has begun a battle with humanity to free the rest of your kind.<br />\nIn your way stands a elf knightess, who has come to defeat you.<br />\nWhat conclusion will result from their battle...?</p>\n<p>[Outlines ]<br />\n- Become the Demon Lord, and battle Latina the elf knightess with sexy commands.<br />\n- Branch off into different sex scenes during the battle,<br />\nand depending on your actions, discover 4 different endings.<br />\n- The game has two parts. There are two branches from the first battle,<br />\neach of which branches into two different endings.</p>\n<p>[Features]<br />\n- A command-style battle system with active gauges.<br />\nBuilding up your gauge allows you to unleash various skills.<br />\n- Clothing / equipment damage is included, even down to gauntlets and socks.<br />\n- Receive skill points from battle, and use them to power up, or learn new skills.<br />\n- H Skills include time-stopping magic, hypnotizing magic,<br />\nclothing destruction techniques, techniques for knockdown, etc.<br />\n- Branch off into 4 different endings depending on battles and dialog.<br />\n- Each ending includes different sex scenes.<br />\nPreviously viewed scenes can be viewed anytime!<br />\n- H scenes include missionary, doggy, cowgirl, handjob, fellatio, breastfuck, face sitting, etc.<br />\n- 30+ scenes including variations<br />\n- Strip the heroines at your measure (or not!). Creampie timing is up to you!<br />\nHeroine pleasure levels can be changed as well.<br />\n- Different creampie animations are included for each position.<br />\n- Cross-sections can be toggled ON / OFF</p>\n<ul>\n<li>Creampie animations can be repeated via the manual mode.</li>\n</ul>", "metacritic": null, "released": "2020-03-30", "tba": false, "updated": "2022-03-08T15:39:47", "background_image": "https://media.rawg.io/media/games/090/09070a57b7974d58dee4a27239003339.jpg", "website": "https://www.dlsite.com/maniax/work/=/product_id/RJ282669.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action", "Casual"], "publishers": [], "esrb_rating": "Adults Only"}