{"id": 743670, "slug": "cubytet", "name": "Cubytet", "name_original": "Cubytet", "description": "<strong>Cubytet</strong> is a 3D puzzle game in which you need to place pieces of different shapes on the playing field in order to score as many points as possible. This game is based on the world's most famous 2D puzzle game and is its 3D analog with some additional game mechanics!<br/><br/>The player can freely rotate the camera around the playing field and view it from different angles. The game has 2 difficulty levels and 12 different pieces.<br/><br/>When the horizontal panel is completely filled with cubes, this panel will be removed from the playing field, and the player will be awarded points. The player receives points for the following actions:<br/><ul><li>5 points - placing a piece on the playing field;<br/></li><li>100 points - filling one panel with cubes;<br/></li><li>400 points - filling two panels with cubes at the same time;<br/></li><li>900 points - filling three panels with cubes at the same time;<br/></li><li>1600 points - filling four panels with cubes at the same time. </li></ul><br/>The speed of the game will increase over time and decrease when the panels are removed.<br/><br/>The game has a leaderboard that will allow players to find out their current rank among all players in the world, as well as compete for first place.<h3>Unique game mechanics</h3><strong>The constructor:</strong><br/><br/>This mechanic allows the player to add and remove additional cubes to the next piece. This makes the gameplay more interesting and diverse, and also helps the player to get out of a difficult situation.<br/><br/><strong>The cut:</strong><br/><br/>This mechanic allows the player to make the cubes translucent to look inside the playing field. In addition, those areas of the playing field that are currently completely inaccessible will be highlighted in yellow. This simplifies orientation on the playing field and helps the player to make a decision faster.", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T03:38:43", "background_image": "https://media.rawg.io/media/screenshots/740/7409191d9e4347acbbd8c2f36edb7eb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AP2 Games"], "genres": ["Casual", "Indie"], "publishers": ["AP2 Games"], "esrb_rating": null}