{"id": 74375, "slug": "delicious-emilys-childhood-memories-free", "name": "Delicious - Emily's Childhood Memories - FREE", "name_original": "Delicious - Emily's Childhood Memories - FREE", "description": "The heartwarming hit game is now fully customized and available on iPad!<br/><br/>Players simply love this game:<br/>“I think the storyline is unique and entertaining. Keep games like this coming!”<br/>“Really enjoyable game. Every bit as good as the previous ones!”<br/>“It’s a lovely game. I finished all the levels and immediately started again!”<br/><br/>Rekindle the magic of growing up with Delicious - Emily's Childhood Memories, a brand-new game in the timeless hit series! Emily's parents are selling the farm she grew up in, making her recall wonderful memories from the past. Follow Emily, her family, and friends on this touching journey as they live out moments of their past that made them who they are today.<br/><br/>FEATURES:<br/>+ Reminisce with Emily in a touching time management adventure <br/>+ Meet old friends, play games from the past and get out of childhood predicaments <br/>+ Enjoy new content, such as a memory scrapbook<br/>+ Watch some of your own childhood memories come to life<br/>+ Now fully customized for iPad in HD quality!<br/><br/>GameHouse Guarantee: We take pride in the loyalty and trust our customers show us when they purchase a GameHouse product. If you are not completely satisfied with your recent purchase, please contact us at iphone-games@real.com.", "metacritic": null, "released": "2012-04-26", "tba": false, "updated": "2019-07-29T11:43:53", "background_image": "https://media.rawg.io/media/screenshots/e93/e93818325ba60d16c41b5772410d7783.jpg", "website": "http://gamehouse.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameHouse"], "genres": ["Strategy", "Puzzle"], "publishers": ["RealNetworks"], "esrb_rating": null}