{"id": 74381, "slug": "line-runner-2", "name": "Line Runner 2", "name_original": "Line Runner 2", "description": "Line Runner 2, the long awaited sequel to the smash hit with more than 25 million players on mobile devices is now available finally available for your Mac, packed with amazing new boost items, spectacular crashes, beautiful themes, cool characters and new tricky obstacles.<br/>Run through various tracks from easy to bone breaking, use different kind of boosts like a Shield, Head start, etc. and beat your friends scores within the integrated leader board.<br/><br/>★★★★★ Regular content updates with new and amazing stuff coming every few weeks! ★★★★★\u2028\u2028<br/><br/>★ From the makers of various top 100 apps like Stickman Base Jumper, Stickman Cliff Diving, Stick Stunt Biker, Rope'n'Fly, Wingsuit Stickman, Line Birds, Line Surfer, RunStickRun and more\u2028<br/><br/>FEATURES:<br/>- Various tracks from easy to bone breaking<br/>- Special easy to play 'Kids Mode' <br/>- Amazing boost items like Shield, Head Start, Resume, Block Marker, Magnet, etc.<br/>- Beautiful themes including Classic, Desert, Space, etc.<br/>- Amazing animated physic enabled characters<br/>- Various characters to choose from<br/>- Game Center<br/>- Directly compare yourself against all other players or your friends<br/>- any many more…<br/><br/>Take a look at the amazing video trailer : http://www.youtube.com/watch?v=OiflG9nhdh8\u2028\u2028<br/><br/>Feel free to post your ideas, we will try to implement them as soon as possible\u2028<br/>Thank you very much for all your support and interest in our games! We would love to hear your suggestions!", "metacritic": null, "released": "2013-01-28", "tba": false, "updated": "2019-07-29T22:44:06", "background_image": "https://media.rawg.io/media/screenshots/81a/81a19efc6ecffbab6630bbcd1764ea0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS"], "developers": ["Djinnworks"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Djinnworks"], "esrb_rating": "Everyone 10+"}