{"id": 74383, "slug": "bubble-wrap", "name": "Bubble Wrap", "name_original": "Bubble Wrap", "description": "BUBBLE WRAP® is the ultimate bubble wrap simulator for your iPhone or iPod Touch. If you enjoy popping bubbles, you owe it to yourself to get this app. <br/><br/>NOW WITH 3 MINI BUBBLE WRAP GAMES!!!!!<br/><br/>You can just relieve stress by popping virtual BUBBLE WRAP for as long as you want, OR you can play one of the 3 mini games:<br/><br/>1. Blitz Pop - How many bubbles can you pop in a minute<br/>2. Pop 500 - How fast can you pop 500 bubbles<br/>3. Pop All - How fast can you pop the entire Bubble Wrap sheet<br/> <br/><br/>-------------------<br/>\"Haha fun! So much better than all of those other bubble wrap games, this is actually addicting and doesn't give you a massive headache.\" - iTunes review<br/>-------------------<br/><br/>There are over 2000 bubbles on a single sheet for you to pop - just swipe your finger to reveal more bubbles and pop them all.  And once you're done, you can do it again!  Just shake your iPhone/iPod/iPad and a fresh new sheet will appear! You will NEVER run out of bubbles to pop, and you will always have it with you in your purse or pocket.<br/><br/>Select black or white bubbles to match your iPhone or iPad. Or, if you prefer color, you can go with slate, sage, or pink.<br/><br/>You can also change the size of the bubbles. Pinch with two fingers to change the size just as you would with a photo. As you change the size, the popping sound will change as well. Bigger bubbles will make a deeper popping sound. <br/><br/>And for the ultimate bubble wrap thrill, try popping multiple bubbles at once! <br/><br/><br/>BUBBLE WRAP has it all: <br/><br/>- over 2000 bubbles per sheet - swipe your finger to move the sheet, shake to refresh.<br/>- 3 SUPER addictive and FUN mini games<br/>- Game Center Leaderboards<br/>- 5 different colors to match your iPhone or your mood (double-tap \"colors\" to change and then swipe up/down) <br/>- multi-touch so you can pop multiple bubbles at once <br/>- resizable bubbles - change the size of the bubbles by pinching. <br/>- realistic, professionally recorded popping sounds that change as you change the bubble size.  <br/>- endless popping fun<br/><br/><br/>--------------------------------------------<br/>Bubble Wrap® and BubbleWrap and Flag Design® are registered  trademarks of Sealed Air Corporation (US) used under license.", "metacritic": null, "released": "2010-12-22", "tba": false, "updated": "2019-10-22T14:24:49", "background_image": "https://media.rawg.io/media/screenshots/d8a/d8a003e92c2bc9ef7bb897f74fb3fbb0_vkaiYzj.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lima Sky"], "genres": ["Family"], "publishers": ["Lima Sky"], "esrb_rating": "Everyone 10+"}