{"id": 74391, "slug": "playman-winter-games", "name": "Playman Winter Games", "name_original": "Playman Winter Games", "description": "Game Description:<br/>Experience the thrill of victory in an electrifying Winter Sports competition optimized for the iPhone and iPod touch.<br/><br/>Join Playman in five exhilarating events that are sure to warm you up when it's cold outside. How fast can you go in speed skating? Can you nail the big jump in freestyle moguls? Is your aim steady enough for the Biathlon? Choose your favorite character from 12 different sports heroes and tackle these and two other exciting competitions separately, or take part in all five contests at once to become a true champion!  <br/><br/>Play with up to five friends in the hot-seat multiplayer mode and post your high scores with Game Center. It's an exciting sports challenge that will keep you coming back for more!<br/><br/>FEATURES: <br/>• Five thrilling events including Speed Skating, Snowboard Cross and Freestyle Moguls.<br/>• Select from 12 sports heroes to become a true champion. <br/>• Play solo or challenge up to five friends in the multiplayer mode.<br/>• Post your record scores with Game Center<br/><br/>Highly recommended for fans of the award winning Playman Track &amp; Field series, winter sports games, and competive casual gamers!<br/><br/>GameHouse Guarantee: We take pride in the loyalty and trust our customers show us when they purchase a GameHouse product. If you are not completely satisfied with your recent purchase, please contact us at iphone-games@real.com.", "metacritic": null, "released": "2011-01-06", "tba": false, "updated": "2019-10-22T14:24:51", "background_image": "https://media.rawg.io/media/screenshots/4a9/4a941d4e5c9c3d0ad242237107a1ddb0.jpg", "website": "http://www.gamehouse.com/iphone-games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["GameHouse"], "genres": ["Action", "Sports"], "publishers": ["RealNetworks"], "esrb_rating": null}