{"id": 74393, "slug": "fabulous-wedding-disaster", "name": "Fabulous - Wedding Disaster", "name_original": "Fabulous - Wedding Disaster", "description": "Fabulous - Angela's Wedding Disaster<br/><br/>Say “Yes!” to the dress in this wedding-themed time management game!<br/><br/>Get ready to take on the New York bridal scene! <br/><br/>Dealing with a new mentor, bridezillas, and even momzillas, Angela’s dress designing skills are put to the test in Fabulous – Angela’s Wedding Disaster! Angela faces her biggest challenge yet as she and her besties, the “Fab 4”, team up to plan a wedding. Will she be able to handle the stress… or will it end in a mess? Find out in this hilarious wedding-themed, time management game!<br/><br/>- PLAY THE 4TH SEASON of the hit story game and find out what happens when Angela takes on wedding gowns<br/>- JOIN ANGELA in 60 story levels, 24 bonus levels, and 6 improved endless levels<br/>- IT'S ALL ABOUT WEDDING FASHION with new fashion-focused mini-games in every level<br/>- COMPLETE ANGELA'S DESIGN SCRAPBOOK by unlocking all 17 achievements<br/>- EARN UPGRADES and customize your shops with the best and most glamorous items<br/>- CREATE YOUR DREAM OUTFIT in Angela's dress-up game, with over 100 fashion pieces - and share your model's style with your friends<br/>- TRAVEL TO UNIQUE BRIDAL BOUTIQUES across 6 glamorous locations<br/>- EXPERIENCE A NEW STORY full of weddings, fashion and friendship!<br/><br/>Following her successful Queen for a Day Prom Dress line, Angela continues to design dresses to help women be their most Fabulous selves! This time, she’s entering the bustling world of bridal boutiques. When it comes to marriage, all you need is love... and the perfect dress, of course! Angela’s relying on you to lend her a hand and make every bride look beautiful on her special day!<br/><br/>But the most important marriage of all is for her friend, Fran. Angela and the rest of the Fab 4 join forces to give him the grandest party possible. However, like everything Angela does, things don't quite go according to plan. Can Angela save Fran's wedding from disaster, or will she only make it worse?<br/><br/>*Enjoy this bridal fashion time management game brought to you by GameHouse Original Stories, the creators of the Delicious and Heart's Medicine series!*<br/><br/>Follow Angela on Facebook: https://www.facebook.com/AngelasGame/<br/><br/>*Download the GameHouse Original Stories app and enjoy other amazing games like Delicious, Heart's Medicine and Fabulous:* https://goo.gl/SXb8sa<br/><br/>Subscribe to Gamehouse Original Stories for unlimited access to all the best story games!<br/><br/>More about GameHouse Original Stories subscriptions:<br/>- You can subscribe to play this game and all other GameHouse Original Stories games without Ads.<br/>- GameHouse Original Stories offers a choice of one subscription: monthly<br/>- Monthly subscriptions will be charged at $9.99/month*<br/>- You will be able to access unlimited stories for the duration of your subscription<br/>- Payment will be charged to your iTunes Account at confirmation of purchase<br/>- Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period<br/>- Account will be charged for renewal up to 24 hours prior to the end of the current period<br/>- Subscriptions may be managed by the user, and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>- No cancellation of the current subscription is allowed during the active subscription period<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/><br/>* Prices are equal to the value that \"Apple's App Store Matrix\" determines is the equivalent subscription price in $USD<br/><br/>By using GameHouse Original Stories, you agree to our Terms of Service and Privacy Policy.<br/><br/>Terms of Service: https://www.gamehouseoriginalstories.com/static/terms-of-service.html<br/>Privacy Policy: https://www.gamehouseoriginalstories.com/static/privacy-policy.html", "metacritic": null, "released": "2018-04-30", "tba": false, "updated": "2019-07-29T11:42:56", "background_image": "https://media.rawg.io/media/screenshots/74b/74b833608ea7c62e28e82ecd0ddf2fdf_8lVWKDZ.jpg", "website": "http://gamehouseoriginalstories.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GameHouse"], "genres": ["Adventure", "Simulation"], "publishers": ["RealNetworks"], "esrb_rating": null}