{"id": 744066, "slug": "paralelo", "name": "Paralelo", "name_original": "Paralelo", "description": "<p>Paralelo is quite the handyman. This guy can do basically anything, as long as he has the right tools... Even though he looks like a weak figure, don't let yourself be fooled… With the right set of items, he becomes a true letter delivery dart! With all his agility and commitment to professional ethics, Paralelo will deliver every  letter that reaches his hands, even if he has to climb a mountain to do so!<br/></p>\n\n\n<p>While playing Paralelo, you will encounter an array of mechanics and hazards that stand between the character and his objective. You start as a regular postman with no special abilities, but every mysterious world contains heirlooms you can collect that help you forge his tool set.</p>\n<p>After you find some incredible blue gloves, our hero can, and will, grab walls. Well, if you press the right button, that is.</p>\n<p><strong>Pressing </strong>the interact button will make the character wall slide. If you <strong>press </strong>the jump button while sliding, Paralelo will perform his signature wall jump! Nothing you have seen before, he promises.</p>\n\n<p>After his passing, an elderly pink mage left his pink cape behind somewhere in his world. Our hero is surely able to efficiently glide around the environment with it. Unfortunately, he has to find it first...</p>\n<p><strong>Pressing</strong> and <strong>holding </strong>the jump key after a regular jump will activate the gliding mechanic. Smoooooth...</p>\n\n<p>This is a prototype being developed as a preparation for two 3D platformers that I have been designing. You probably won't be hearing about them in the near future, as they will take a long time (also money) to develop.<br/>For now, this is all I have to show. It is nothing special, but it checks some of the requirements for what I believe is a successful narrative platformer: gameplay variation through items, weird and interesting characters and a variety of levels that teach the mechanics progressively without spoon-feeding the player.<br/></p>\n<p>There are some known issues to the current state of the game, namely:</p>\n<ul><li>Placeholder sfx and music;</li><li>Inconsistent collisions;</li><li>Invisible walls that the player can exploit;</li><li>The control scheme is not comfortable for mobile. </li></ul>\n<p>And some smaller issues not worthy of mention...<br/><br/>I am currently looking for a sound designer to help us finalize this pico8 prototype. More information soon.</p>\n<p>If you find any game-breaking issues, please let me know in the comment section.<br/></p>\n\n<p>Design and programming by Pedro Silva.<br/>Art and incredibly interesting level ideas by Pedro Nogueira.<br/>Special thanks to Sara, Inês and Salvador for play-testing the earlier versions of the game.<br/><br/>Thank you for your interest!</p>", "metacritic": null, "released": "2022-02-24", "tba": false, "updated": "2022-02-25T06:14:52", "background_image": "https://media.rawg.io/media/screenshots/2fe/2fe65e9d246812686e3a4267169ae2f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["pedr0silva", "Pedronog"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}