{"id": 744073, "slug": "fishie-keep-the-sea-plastic-free-zx-spectrum", "name": "Fishie - Keep the sea plastic free! (ZX Spectrum)", "name_original": "Fishie - Keep the sea plastic free! (ZX Spectrum)", "description": "<p>Controls: e: UP; d: DOWN; o: LEFT; p: RIGHT.</p>\r\nFishie - Keep the sea plastic free!\r\n<p><strong>Fishie - Keep the sea plastic free! </strong>is a small game with a big ecological message. Help Fishie keep the sea clean of plastic waste, by catching the oxygen bubbles that emerge from the water before they pop. Whenever you catch a bubble, the garbage on the same line will disappear and Fishie will score a point. Contact with plastic waste is harmful and will make you lose one life.</p>\n<p>Fishie - Keep the sea plastic free! has been coded in BASIC language for the Sinclair ZX Spectrum homecomputer and is my second (here's the first) entry to the 11th edition (2022) of the BASIC 10 Liner Contest, PUR-80 category.<br/></p>\n<p>Emulation powered by JSSpeccy.\r\nSinclair and ZX Spectrum are © Amstrad / Sky In-Home Service Ltd. \r\n</p>\n<p>Bubbles background designed by macrovector / Freepik.\r\n  </p>\n<p>THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.   IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY   CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,   TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE   SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\n</p>", "metacritic": null, "released": "2022-02-24", "tba": false, "updated": "2022-02-25T06:16:17", "background_image": "https://media.rawg.io/media/screenshots/582/58200be4f7d40035e32e778e7b3cadb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["marco's retrobits"], "genres": ["Action"], "publishers": [], "esrb_rating": null}