{"id": 744104, "slug": "balloon-flight-prototype", "name": "Balloon Flight Prototype", "name_original": "Balloon Flight Prototype", "description": "<p><em>Controls: [SPACE] to get the balloon to bounce. Collect money but avoid the bombs!</em><br/></p>\n<p><strong>Purpose:</strong></p>\n<p>The original version of this game was buggy and was provided through Learn.Unity.com. The following bugs in scripts and the editor needed to be fixed:<br/></p>\n<ol><li>Player cannot control the balloon\r\n</li><li>Background only moves when the game is over\r\n</li><li>No objects are being spawned\r\n</li><li>Fireworks appear on the side of the balloon\r\n</li><li>Background is not repeating properly. \r\n</li></ol>\n<p>Additional functionality to be added:</p>\n<ol><li>Balloon bounces and makes a noise when it hits the ground</li><li>A upper boundary restricts the balloon flying too high </li></ol>\n<p>Please see the original version at: https://tedman.itch.io/buggy-balloon-flight</p>\n<p>Since then, these bugs have been fixed and additional functionality has been added. <br/></p>\n<p><strong>Methodology</strong></p>\n<ol><li>The player was unable to control the balloon because the balloon's rigidbody was not initialized in the Start function. Initializing it allows the AddForce function to act on the RigidBody and move the balloon.<ol><li>Use <strong>playerRb = GetComponent&lt;Rigidbody&gt;()</strong>; in Start()</li></ol></li><li>The background did not move because of an if statement that states the background can only move if the game is over. Setting the if statement when the game is NOT over will allow the background to move, and then stop when the game is over.<ol><li>if (playerControllerScript.gameOver) --&gt; if (<strong>!playerControllerScript.gameOver</strong>)</li></ol></li><li>Objects did not spawn because of a typo. <ol><li>InvokeRepeating(\"<strong>PrawnsObject</strong>\" --&gt; InvokeRepeating(\"<strong>SpawnObjects</strong>\"</li></ol></li><li>Fireworks appeared on the side of the balloon because they were not made a child of the Player Game Object. Setting fireworks as the child resolves this.</li><li>The background was not repeating properly because the repeatWidth utilized the background's Y value instead of its X value.<ol><li>repeatWidth = GetComponent&lt;BoxCollider&gt;()<strong>.size.y</strong> --&gt; ...<strong>size.x<br/></strong></li></ol></li></ol>\n<p>Additional functionality was added with:</p>\n<ol><li>Under the OnCollisionEnter method, an if statement that, when the player touches the \"ground\", the balloon's rigidbody will experience a vector3.up force. Include an line that calls upon an audioclip to be played whenever this occurs. Make sure to create a tag called \"ground\" and label the ground.</li><li>Add a boolean that checks the height of the player. Whenever the player is above this height, prevent them from adding force. Whenever the player is below this height, they are able to add force. Additionally add a ceiling with a box collider that prevents the player from accumulating a lot of force when near the ground.</li></ol>\n<p>Even more improvements can be added:</p><ul><li>UI screen that records amount of money collected.</li><li>Menu screen that features the player's top score for that session.</li></ul>", "metacritic": null, "released": "2022-02-24", "tba": false, "updated": "2022-02-25T06:23:42", "background_image": "https://media.rawg.io/media/screenshots/3cf/3cf6001f5fe72d99a24555875912d15e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tedman"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}