{"id": 744195, "slug": "qi-48kb-spectrum", "name": "QI -48KB Spectrum", "name_original": "QI -48KB Spectrum", "description": "<p>QI es un pequeño robot encargado de reparar el equipo electrónico de su nave. La computadora a bordo ha tomado parte del control desviando la energía hacia una central que no corresponde. QI ha logrado recuperarla, pero debe guiarla por los circuitos para alimentar el equipo que le devolverá el control de su nave. <br/></p>\n<p>QI puede colocar flechas para guiar a la<strong> “chispa de energía” </strong>  hacia los puntos verdes del circuito . Se colocará una flecha dependiendo de la dirección del robot. Cuando la chispa choque contra una flecha, tomará el sentido que ésta le indique. </p>\n<ul><li>RESUELVE LOS PUZZLES DE CADA NIVEL</li><li>LLEVA LA CHISPA AL PUNTO VERDE</li><li>UTILIZA LAS HERRAMIENTAS </li><li>UTILIZA LAS FLECHAS DE MANERA INGENIOSA </li><li>NO ATRAVIESES LAS RESISTENCIAS O PARTES ROJAS </li></ul>\n<p>ENG</p>\n<p>QI is a small robot tasked with repairing your ship's electronic equipment. The on-board computer has taken over some of the control by diverting power to a wrong plant. QI has managed to get her back, but he must guide her through the circuits to power the equipment that will restore control of his ship.</p>\n<p>QI can place arrows to guide the “energy spark” to the green points on the circuit. An arrow will be placed depending on the direction of the robot. When the spark hits an arrow, it will take the direction indicated by it.</p>\n<ul><li>SOLVE THE PUZZLES OF EACH LEVEL</li><li>TAKE THE SPARK TO THE GREEN SPOT</li><li>USE THE TOOLS</li><li>USE ARROWS INGENIOUSLY</li><li>DO NOT CROSS THE RESISTORS OR RED PARTS</li></ul>", "metacritic": null, "released": "2022-02-24", "tba": false, "updated": "2022-02-25T06:50:53", "background_image": "https://media.rawg.io/media/screenshots/93f/93fbcee671c3a10fe7ba5c864d9675b2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MemSoftware"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}