{"id": 74456, "slug": "pocket-chibi-anime-dress-up", "name": "Pocket Chibi - Anime Dress Up", "name_original": "Pocket Chibi - Anime Dress Up", "description": "« Welcome to Pocket Chibi »<br/><br/>The ultimate Chibi Maker app! Create your own anime styled chibi characters and dress up in your favorite fashion outfits! Choose from thousands of clothes, hairstyles, hats, weapons and much more! After designing your characters, enter the Studio and create any scene you can imagine! As a chibi creator, you can place your chibi anywhere on the screen, strike up your favorite pose, and add text bubbles with your own messages!<br/><br/>Choose from a hundred backgrounds to create the perfect scene! For even more fun, add pets, props, and special effects to your scene to create endless story possibilities! Make epic battle scenes with any character you can imagine! Join the Chat to use your chibi avatar and talk with other players across the world! Grab your favorite clothes from the closet, and go play Pocket Chibi!<br/><br/>« Game Features »<br/><br/>- Dress up your chibi with the latest anime fashion! Mix and match thousands of clothes, weapons, hats, and more! You are the ultimate creator!<br/>- Customize your chibi! Change your hairstyle, eyes, mouth, and more!<br/>- Create your own scenes in Studio Mode! Enter custom text for your characters and choose from many different poses and backgrounds!<br/>- Add pets, props, and special effects to your scenes!<br/>- Chat with players across the globe using your chibi avatar!<br/>- Cosplay as your favorite anime hero or OC!<br/>- Free 2 Play, you can earn free Gems easily!<br/>- Play offline! No Wi-Fi is needed to play! (Only for Chat)<br/><br/>« Notes »<br/>- The game has been optimized for newer Apple devices and may lag/crash on older devices.<br/>- Please restart the game if you experience lag over time.<br/><br/>Thank you for playing Pocket Chibi!!!!! ポケット ちび", "metacritic": null, "released": "2017-11-28", "tba": false, "updated": "2019-07-31T04:30:49", "background_image": "https://media.rawg.io/media/screenshots/f16/f1687f050876cdf554b93b59ae52e56b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Lunime"], "genres": ["Simulation", "Casual"], "publishers": ["Lunime"], "esrb_rating": null}