{"id": 74452, "slug": "dual", "name": "DUAL!", "name_original": "DUAL!", "description": "<p>Between people, across screens.<br />\nDUAL is a local multiplayer game where two players use their mobile devices to shoot from one screen to the other. It&#39;s easy to pick up and play any of the competitive or cooperative modes: DUEL, DEFLECT, and DEFEND.<br />\nFeatures:<br />\n+ Battle locally over WiFi or Bluetooth.<br />\n+ DUEL - Tilt your phone, dodge bullets, charge, and shoot your friends in this classic duel standoff.<br />\n+ DEFEND - Work together to defend the middle from an onslaught of attackers.<br />\n+ DEFLECT - Score goals by blasting, banking, and curving the ball from one screen to the other.<br />\n+ Only one person needs to have the full version unlocked to play DEFEND and DEFLECT with another player.<br />\n+ Collectable color sets unique to your device; unlock them all by playing against different people.<br />\n+ Single one-time in-app purchase to unlock the full game, and restore it on all your devices using the same account.<br />\n+ Stats, achievements, and leaderboards.<br />\n&quot;Working together right next to each other really brings back the magic of couch gaming.&quot;<br />\n- Chris Carter, Destructoid<br />\n&quot;...it&#39;s a really fun way to engage with another live human, up-close and personal.&quot;<br />\n- Rick Broida, CNET<br />\n&quot;You play it with someone, anywhere, and it actually brings you closer together...&quot;<br />\n- Chris Priestman, Kill Screen<br />\n&quot;...sending bullets across to someone else’s phone as you sit opposite them has a curious sense of technological magic to it.&quot;<br />\n- Chris Charlton, Kaijupop<br />\nQuick Troubleshooting Guide:<br />\n+ Make sure your WiFi is enabled and both players are on the same WiFi network.<br />\n+ Use Manual IP Discovery from the WiFi lobby if unable to find each other while on the same WiFi network.<br />\n+ To restore your purchase go to the Unlock screen and select the Restore Purchases button.</p>", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-07-29T18:44:14", "background_image": "https://media.rawg.io/media/screenshots/1a8/1a8fe4d817d78d580f7d88ef68bda58d.jpg", "website": "http://www.letsdual.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Seabaa"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Seabaa"], "esrb_rating": null}