{"id": 74457, "slug": "maplestory-m", "name": "MapleStory M", "name_original": "MapleStory M", "description": "[For the best gaming experience, MapleStory M requires OS 8.0, CPU dual-core and RAM 1.5GB or higher. Some devices under the specification may have difficulties running the game.]<br/><br/>The highly anticipated MapleStory M is here and the hype is real! MapleStory M brings the nostalgic world of MapleStory to your mobile device, and delivers an authentic MMORPG experience that you can enjoy whenever and wherever you want, right in the palm of your hand. <br/><br/>Play as the classic MapleStory Explorers that you know and love: Dark Knight, Bow Master, Night Lord, Bishop, and Corsair! Compete with friends to level up and become the first to achieve the 4th job just like the good old days! Recruit the best players for your guild and defeat epic bosses together! <br/><br/>■ FEATURES<br/>▶ Relive the MapleStory experience straight from your mobile device!<br/>▶ Explore familiar cities like Henesys, Perion, Kerning City, Elinia, and more!<br/>▶ Play in a real-time, open world MMORPG with live game events.<br/>▶ Celebrate your individuality with an endless variety of cosmetic decorations!<br/>▶ Compete with players from around the world in Level Ranking, Mu Lung Dojo, and more!<br/>▶ Create or join a guild with friends to raid challenging epic bosses!<br/>▶ Meet MapleStory’s iconic raid boss, Zakum! Join a raid party with up to 10 players and battle against Zakum for exclusive rewards!<br/><br/>■ Support &amp; Community<br/>Are you having problems? Contact our 1:1 Support in-game or send us an inquiry at<br/>help_MapleStoryM@nexon.com<br/><br/>Follow us on our official communities to get the latest news and updates!<br/>Facebook: http://www.facebook.com/PlayMapleM<br/><br/>Terms of Service: http://m.nexon.com/terms/304<br/>Privacy Policy: http://m.nexon.com/terms/305 <br/><br/>■ App Permissions Information<br/>In order to provide the below services, we are requesting certain permissions.<br/><br/>[Essential Permission]<br/>Camera: Taking screenshots to help with customer service inquiries<br/>Photos: Attaching screenshots for customer service<br/><br/>[Permission Management]<br/>▶ Settings &gt; Privacy &gt; Select the permission", "metacritic": null, "released": "2018-08-01", "tba": false, "updated": "2019-10-22T14:33:38", "background_image": "https://media.rawg.io/media/screenshots/482/4827ff8a841fe8a2401dddcea3b4ae6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 359, "game_series_count": 5, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["NEXON Company"], "genres": ["RPG"], "publishers": ["NEXON KOREA"], "esrb_rating": null}