{"id": 744591, "slug": "dream-journey", "name": "Dream Journey", "name_original": "Dream Journey", "description": "<p>Dream Journey è un videogioco è un videogioco RPG per Windows. <br/>E’ stato sviluppato nel 2022 utilizzando RPG Maker MV come game engine, e  deepdreamgenerator.com e ostagram.me, che hanno svolto un ruolo fondamentale per la creazione della maggioranza delle componenti grafiche. <br/>Si tratta di programmi che utilizzano una rete neurale convoluzionale per trovare e migliorare i patterns nelle immagini tramite la pareidolia algoritmica, creando così un aspetto psichedelico e da sogno nelle immagini sovraelaborate. </p>\n<p>L’idea del progetto nasce in seguito alla lettura di dream journals e posts  pubblicati online da dagli utenti di piattaforme come DeviantArt, Tumblr e Reddit che volevano condividere i propri sogni con il pubblico di internet. <br/>Il mio progetto vuole dare forma e rielaborare questi sogni, creando un mondo dei sogni contemporaneo virtuale nel quale lo spettatore può muoversi come preferisce, vivendo così una sua personale esperienza onirica nei sogni di qualcun altro.</p>\n<p>Le 43 mappe esplorabili sono composte da tanti piccoli tiles della misura di 50x50 pixel e l’aspetto di ognuno di questi quadratini deriva dall’unione tra l’immagine del tileset di default offerto da RPG Maker, e un’immagine raffigurante temi, paesaggi o figure descritte nei sogni degli utenti online.</p>\n<p>Anche le creature che popolano queste terre hanno come origine il mondo dei sogni del cyberspazio e sono state disegnate dall’artista Chiara Gualtieri. <br/>Alcune di queste potranno essere compagni fedeli che accompagneranno il giocatore nel suo viaggio, mentre altre saranno agguerriti nemici che cercheranno di ostacolarlo nella sua scoperta del mondo dei sogni.</p>", "metacritic": null, "released": "2022-02-22", "tba": false, "updated": "2022-02-25T08:50:41", "background_image": "https://media.rawg.io/media/screenshots/603/6031f993be09b431fd83da59e670cee8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dynomitegames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}