{"id": 744912, "slug": "lords-of-solgrund-itch", "name": "Lords of Solgrund (itch)", "name_original": "Lords of Solgrund (itch)", "description": "<p>Lords of Solgrund combines elements of city building and slow-paced tactical battles. The game features detailed animations and systems inspired by the early middle ages, combined with magical, spiritual and other fantastical elements that are based in an entirely seperate reality from ours.</p>\r\nDiscord\r\n<p>Join the Lords of Solgrund community on discord to share your opinions, ideas and get the earliest updates and further insight into the development.</p>\n\r\nGameplay\r\n<p>Before the game starts, you will choose a combination of a character and a school of magic. Each character has several positive or negative attributes, such as having head start on specific researches, cheaper market prices, strong or weaker soldiers and more. Your school of magic then determines what kind of spells your magi will have access to. Each school of magic has a different theme with a set of spells associated with it.</p>\n\n<p>During the game, you will manage your economy and ensure your people have enough to eat and have decent housing. Houses can be upgraded to have higher income and hygiene but also require more needs and luxuries, such as furniture, clothing or decorations.</p>\n\r\nEditor\r\n<p>Create your own custom maps, campaigns or mini scenarios with the ingame editor and share them with other people!</p>\n\r\nLocalization\r\n<p>The game is built to support as many languages as possible, you can volunteer to help translate the entire game into your native language (or any language you are fluent in). Localizing maps and campaigns is also possible.</p>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T10:31:13", "background_image": "https://media.rawg.io/media/screenshots/d70/d703f5920501f88c6779f625275996f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KoltiraLifeweaver"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}