{"id": 745020, "slug": "gender-reveal-ultimate-party", "name": "Gender Reveal Ultimate Party", "name_original": "Gender Reveal Ultimate Party", "description": "<p>Torne o chá de revelação mais dinâmico e interativo com Gender Reveal Ultimate Party</p>\n<p>O Gender Reveal  Ultimate Party é um jogo co-op (cooperativo) local, para dois jogadores. Para dar início a ação, uma terceira pessoa deve preencher as informações sobre o sexo e nome de seu bebê, caso tenha sido definido. Os jogadores estouram os balões, dentro do tempo limite, para descobrir o sexo e nome do filho.</p>\n<p>A plataforma interativa oferece um ambiente em um playground, no qual ambos os personagens devem correr contra o tempo para estourar os balões que estão espalhados pelo cenário, e que vão aparecendo ao longo do tempo. </p>\n<p>Para jogar, utliza-se apenas o teclado do computador para controlar os personagens, sendo o jogador um com as teclas WASD para movimentação e barra de espaço para estourar os balões, e o jogador dois com as setas para movimentação e a tecla Enter estourar os balões.</p>\n<p>Também é possível configurar para utilizar um ou dois joysticks para controlar os personagens e atingir o objetivo.</p>\n\n<p>---------</p>\n\n<p>Make the gender reveal party more dynamic and interactive with Gender Reveal Ultimate Party</p>\n<p>Gender Reveal Ultimate Party is a two-player local co-op game. To initiate the action, a third person must fill in the information about the sex and name of your baby, if it has been defined. Players pop the balloons, within the time limit, to reveal the child's gender and name.</p>\n<p>The interactive platform offers an environment in a playground, in which both characters must race against time to pop the balloons that are scattered around the scene, and that appear over time.</p>\n<p>To play, just use the computer keyboard to control the characters, being player one with the WASD keys to move and the space bar to pop the balloons, and player two with the arrow keys to move and the Enter key to pop the balloons.</p>\n<p>It is also possible to configure to use one or two joysticks to control the characters and reach the objective.</p>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T11:00:00", "background_image": "https://media.rawg.io/media/screenshots/213/213e210d7770301da42256ed532d15de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 322, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gender Reveal Ultimate"], "genres": [], "publishers": [], "esrb_rating": null}