{"id": 745060, "slug": "guess-word", "name": "Guess Word", "name_original": "Guess Word", "description": "Call your friends, challenge them to find your word, try to guess theirs!\r\nGuess Word is a game whose objective is to guess the opponent's words. In addition to suggesting letters, you have special options that will help you get there and make the game much more exciting! The last player whose word was not been discoverd wins the game!\r\n\r\n<br/>\r\nWhant to play it on Android? Dowload it here!\r\nPlease support us! Your help will be very appreciated.\r\n<p>The game is in its beta, so if you find something buggy or want to suggest anything, give us a feedback!</p>\n<p>Languages available: English and Brazilian Portuguese</p>\r\nSymbols meaning:\r\n@ (at) : choose between any vogal\r\n$ (dolar) : set of consonants to choose \r\n! (exclamation) : set of opponents' letters that were not chosen\r\n# (hashtag): block user attack; attack user option; make user loose a turn\r\n* (asterisk): Choose any letter\r\n6 (six): hide a user word (hidden for 3 rounds)\r\no.o : in case you forget your word, hold for a while to see it\r\n\r\nAttack order:\r\n# attacks first 6, then # and then * (asterisk).<br/>Use # to unhide a word. \r\nThe number below the username is the amount of additional options that user has stored.\r\nIt needs at least 2 players to begin a match. Maximum of 5 players.\r\nIf you enter a random room, you must wait for another random opponent to play. You only play with other random players of the same language.\r\nThe last user standing in the match, wins!", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T11:11:01", "background_image": "https://media.rawg.io/media/screenshots/92b/92b991e276f8933bc44748a0e08dd824.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["flow"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}