{"id": 74522, "slug": "clown-horror-survival-game", "name": "Clown Horror Survival Game", "name_original": "Clown Horror Survival Game", "description": "The scary evil clown is expected to be lurking in the dark streets of nashvil city and people are scared to death locking themselves up since five days! Killer horror clown is looking for new ways of kidnapping kids and filling his asylum night creepy house with more bogeyman to produce an army of evil horror clown to launch a clown attack on nashvil! This will help the killer clown to take over the entire city and call it a haunted mansion city horror asylum!<br/><br/>The police and investigation agencies are working on a plan to arrest the killer clown outside the asylum night haunted mansion to also gauge details of his plan and finish this creepy house horror game liberating the citizens. This has now become a survival horror game and the police departments are going crazy, the killer clown is not just an ordinary mindset it can give you eerie Goosebumps making the house scream with terror! The investigation team has to remain careful or they might lose another loved one.<br/><br/>DANG IT! The horror killer clown sent the police department a video of torturing one of their sons! This can’t be happening! Eerie Goosebumps are creeping up your neck; your kid is in the domain of that horror asylum haunted mansion and is lying stifled and unconscious in a spooky room drenched in eerie blood! Your kid has to help his own self now, has to escape this spooky house scary game by searching for the key to the door of the creepy house horror asylum, SILENTLY!<br/><br/>The survival horror asylum game has three evil scary clown characters to add variety to your haunted mansion house scream game! Take one WARNING; you will have to plan and attempt an escape in horror game within five days else you will become an everlasting prisoner of the eerie survival horror game. You have to save yourself and your family from the torture of this horror creepy clown, or you will soon turn into the zombie bogeyman like all other failed prisoners!<br/><br/>You have just one way to run off from this eerie creepy house clown, which is to search for the key to the main spooky asylum night house gates. You will have to search for the key in every spooky room, checking in the drawers and cupboards without making any house scream or knocking noise! If you see the scary evil killer clown heading your way, simply duck under the bed or hide in the cupboard to escape the murderous horror clown terror.<br/><br/>Once you leave the spooky eerie room without making any noise, keep yourself alert and don’t scream because the bogeyman corpses reside in this house of survival horror game as their own grave house. They will give you Goosebumps in every spooky room of the scary evil clown game house, but you have to make no noise or go near them, it might reawake them compromising your dear life in one swift move forever!<br/><br/>How to play <br/>&gt; Download the survival horror game from your play store<br/>&gt; The character is trapped in the spooky room<br/>&gt; Use onscreen touch controls to step out of the room in escape game<br/>&gt; If you sense the evil creepy clown near you, hide under the bed or in the cupboards<br/>&gt; Sneak in from one spooky room to another to escape the creepy house<br/>&gt; Use icons to find key in each spooky room direction<br/>&gt; Search for the key in cupboards and drawers too.<br/>&gt; Once the key is found, tip toe to the gates of the haunted mansion<br/>&gt; Don’t go near the bogeyman monsters<br/>&gt; Avoid making any noise while escaping<br/><br/>FEATURES OF GAME<br/>&gt; Asylum night creepy house simulation <br/>&gt; 3 scary evil killer clown deadly characters<br/>&gt; Easy to use on screen touch controls to control movements<br/>&gt; Eerie spooky house background music effects<br/>&gt; Realistic and high quality HD visual graphics <br/>&gt; FIVE days to escape the spooky horror asylum", "metacritic": null, "released": "2018-07-25", "tba": false, "updated": "2019-10-22T14:24:53", "background_image": "https://media.rawg.io/media/screenshots/6a0/6a035dd5d58cf76af517a46760731efb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Usman Saeed"], "genres": ["Adventure", "Simulation"], "publishers": ["Muhammad Usman Saeed"], "esrb_rating": "Mature"}