{"id": 745288, "slug": "super-pizza", "name": "Super Pizza", "name_original": "Super Pizza", "description": "<p>Super Pizza Mağara Jam #4 için geliştirilmiş bir oyundur.</p>\n<p><strong>Tema ==&gt; Senin süper gücün <em>UÇMAK</em></strong><br/></p>\n\r\nHİKAYE:\r\n<p>Uçma süper gücü olan bir pizza kuryesi bu gücünü işi için kullanarak şehirdeki en iyi pizza kuryesi olmayı amaçlar.</p>\n\n<strong>KONTROLLER:</strong>\n<p>Oyunun mekanikleri oldukça basit olmakla beraber şu şekildedir:</p>\n<p><strong>W A S D </strong>tuşlarından karakterimizi yönlendirebiliyoruz.</p>\n\n<p><strong>Space </strong>tuşuna <strong><em>\"BASILI\" </em></strong>tutarak ise Enerji Barında enerjimiz olduğu taktirde de uçma yeteneğimizi kullanabiliyoruz.</p>\n\n\r\n      Enerji Barı ==&gt; \r\n\r\nOYNANIŞ:\r\n\n<p>Canlarınız bitmeden yapabildiğiniz kadar çok sipariş teslimi yapmaya çalışın ve şehirdeki en iyi pizzacı olduğunuzu herkese kanıtlayın!</p>\n<p>* Super Pizza'da 3 canımız vardır ve bu canları ekranın sağ üst koşesinde bulunan pizzalar simgelemektedir.</p>\n\n\n<p>* Yeni bir sipariş gelince haritada siparişin olduğu yerde bir uyarı ışığı yanmaya başlar ve amacımız sipariş zamanını geçirmeden siparişi yerine ulaştırmaya çalışmaktır.<br/></p>\n\n\n<p>* Siparişi zamanında teslim edemediğinizde bir can kaybedersiniz :(</p>\n<p>* Siparişleri ne kadar çabuk teslim ettiğinize bağlı olarak puan kazanırsınız.</p>\n<p>* Haritada bazen rastgele noktalarda ekstra bir can bulunur ve bunu aldığınız taktirde can kazanmış olursunuz.</p>\n<p>* Bu canlar, üzerinde pizza simgesi bulunan ve arkasında yeşil bir ışık bulunan noktalardadır:</p>\n\n<p>* Super Pizza'nın özelliği ise pizzacımızın <strong>UÇMA</strong> yeteneğinin olmasıdır!!!! Bu yetenek ile pizzacımız, zamanında yetiştiremeyeceğini düşündüğü siparişleri motosikleti ile birlikte binaların üzerinden uçarak siparişler ne kadar uzakta olurlarsa olsunlar yetiştirebilir !!!!</p>\n<p>* Tabi ki pizzacımız için bile her şey öyle göründüğü kadar kolay değildir. Pizzacımız yalnızca enerji barında yeterli kadar enerjisi olduğu taktirde uçma yeteneğini kullanabilir :( </p>\n<p>* Ama üzülmeyin, tıpkı siparişler gibi enerji güçlendirmeleri de haritada rastgele olarak ve \"sıklıkla\" çıkmaktadır :)</p>\n<p>* Sarı bir arka plan ışığı ve bir şimşek görüntüsünün olduğu yerlere giderek pizzacımıza enerji kazandırabilirsin !</p>\r\n\r\n\r\nİşte Super Pizza'yı oynamak bu kadar kolay! Eğer şehirdeki en iyi pizza kuryesinin sen olduğunu düşünüyorsan hemen oyna!!\r\n\r\nKullanılan Hazır Asset'ler:\r\n<p>* Moody Tunes - (Arka plan müziği)</p>\n<p>* Delivery Vehicles Pack (Vespa motor)</p>\n<p>* Cute Male 3 (Pizzacı)</p>\n<p>* Pizza ve şimşek resimleri \"Flaticon\" sitesinden alınmıştır.</p>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T12:17:06", "background_image": "https://media.rawg.io/media/screenshots/982/982b4d9f2e1ced173244ccee5bf056ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YuSoft Games"], "genres": [], "publishers": [], "esrb_rating": null}