{"id": 74523, "slug": "battle-of-arrow-survival-pvp", "name": "Battle of Arrow: Survival PvP", "name_original": "Battle of Arrow: Survival PvP", "description": "Shoot the arrow and stay alive in this real-time PvP game!<br/><br/>Grab the reins then mount up your horse with a bow, <br/>Enter the arena to duel against global gamers in this real-time PvP action game!<br/><br/>Battle of Arrow offers real-time PvP combat against global gamers armed with a variety of bows, set armors, and mounts.<br/>It is truly free-to-play, and there are various game modes including the Arena mode, and the Campaign mode, and the Raid mode.<br/><br/>The gyroscope control delivering an immersive thrill is built that players have to focus on aiming with tilting their device. <br/>So do not be out to lunch no matter what you take the lead, you will be fallen from your mount by the final arrow released from your opponent!<br/><br/>FEATURES:<br/>▶ Offer real-time PvP combat dueling against players worldwide.<br/>▶ Experience the dynamic thrill of horseback archery PvP duels.<br/>▶ Create a truly immersive experience with gyroscope control.<br/>▶ Customize your combat style with various type of weapons, set armors, and skills.<br/>▶ Team up with your friends to defeat massively powerful raid bosses.<br/>▶ A friendly match that you can duel your friend full of fun at any time.<br/><br/>Facebook : https://www.facebook.com/battleofarrow/<br/>Discord : https://discord.gg/p9kedmj<br/>Customer Support: https://helpdesk.433.co.kr/?game_name=1487842223", "metacritic": null, "released": "2017-11-22", "tba": false, "updated": "2019-07-29T19:18:59", "background_image": "https://media.rawg.io/media/screenshots/462/4620086a92e3e2cbff14ec71bbf09cb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Four Thirty Three", "FourThirtyThree"], "genres": ["Action", "Strategy", "Sports"], "publishers": ["Four Thirty Three"], "esrb_rating": "Teen"}