{"id": 74526, "slug": "animatch-animal-matching-game", "name": "AniMatch: Animal Matching Game", "name_original": "AniMatch: Animal Matching Game", "description": "AniMatch is great FUN for kids and adults alike! <br/><br/>\"This is a MUST HAVE APP for anyone with an iPhone and YOUNG KIDS... The buttons are BIG and very easy to navigate, the animal sounds are wonderful and the 'little jiggle' the animals do when you succeed at a match had my kids very excited.\" - Customer Review (US)<br/><br/>\"Excellent! (*****) - My 6 year old is always grabbing my iPod to play this...  I have to admit I have found myself opening this app and enjoying it myself. A+\" - Customer Review (US)<br/><br/>\"Kid Perfect (*****) - Lost my Touch to my 3yo over this game\" - Customer Review (US)<br/><br/>\"Animatch is FANTASTIC!!! (*****) - ... a must have app the HOLDS THEIR ATTENTION and develops memorization skills. My 2 1/2 year-old toddler love this one. She can play alone, or we take turns and make it a fun game together. Excellent for distracting them while you finish your dinner and wine at a restaurant!!\" - Customer Review (US)<br/><br/>\"Very Addictive even for adults! (*****) - I can't stop playing this game since installing it. Love the graphics and animal sounds\" - Customer Review (US)<br/><br/>***************************************************<br/><br/>Now with retina display graphics and native iPad support!<br/><br/>AniMatch has reached the #1 Top Paid Kids' app spot in the USA, France, and Germany,  and has been a top selling Kids' Game for over two years!<br/><br/>***** AniMatch was mentioned in the NEW YORK TIMES Travel Section as a great game to have on trips for restless kids! and was featured by Apple in \"BEST KIDS' GAMES\" *****<br/><br/><br/>::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br/>Kids LOVE AniMatch!<br/>::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br/><br/>With its super-cute animal graphics and funny animal sounds, AniMatch is perfect for kids, but loved and played by grown-ups as well, who often get it for their kids and then end up playing it themselves.<br/><br/>AniMatch will keep your kids educationally entertained, all the while developing their concentration, memory, and cognitive skills, and teaching them what sounds animals make. AniMatch will also keep your kids quiet while they play it again, and again, and again.... right when you need that much-needed break in a restaurant, on a plane, or in a car. <br/><br/>While kids can play the game all on their own, it is even more fun when you take turns and play AniMatch with them! And, costing less than a pack of bubble-gum, it will be the best money you've ever spent.<br/><br/>AniMatch was designed to be kid-friendly! There are no complicated menus for kids to get confused by, or multiple options to get lost in. The moment the game loads, kids can start playing it right away - it is so simple and engaging that we have seen even 11-month olds interact with it! And 2 to 6 year olds just can't have enough of AniMatch!<br/><br/>This adorable pairs match concentration game also doubles as an animals sound machine.<br/><br/>FEATURES:<br/>- UNCOVER A NEW ANIMAL WITH EACH PLAY (31 different animals in total, 10 shown in each game)<br/>- Educational and fun animal sounds - each animal will make its sound when flipped<br/>- Develops memory and cognitive skills<br/>- Keeps kids entertained<br/>- High score and best time<br/>- Adorable graphics<br/>- Fun, Fun, Fun!!!!", "metacritic": null, "released": "2008-10-16", "tba": false, "updated": "2019-07-29T18:58:13", "background_image": "https://media.rawg.io/media/screenshots/fd9/fd97a7aa189c325dc29f6be560087764.jpg", "website": "http://www.LimaSky.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lima Sky"], "genres": [], "publishers": ["Lima Sky"], "esrb_rating": null}