{"id": 74549, "slug": "stickman-soccer-2014", "name": "Stickman Soccer 2014", "name_original": "Stickman Soccer 2014", "description": "The 2014 sequel to the world hit Stickman Soccer with more than 10 million players. Experience pure soccer fun with fast paced gameplay, an astonishing atmosphere, stunning smooth animations, simple controls, insane action and tons of replay value. Choose your national soccer team and rank up while playing various seasons, cups or world cups in spectacular stadiums or simply dominate in street or beach soccer style matches. Decide whether you want full control over your players with manual running and shoot timing or use the automatic running mode where you have control over precise pass timing and watch your players tackle your opponents. Choose your favorite national soccer team from more than 40 different skilled teams and lead them to glory!\u2028\u2028<br/><br/>• Winner of the \"Best Soccer Game 2015\" by German Soccer Culture Academy<br/>• The sequel to the #1 Soccer game in multiple countries<br/>\u2028• MOGA and game controllers support<br/>\u2028• From the makers of various top hits like Stickman Skate Battle, Stickman Downhill, Stick Stunt Biker, Stickman Tennis,Stickman Basketball,  Stickman Cliff Diving, Stickman Base Jumper, Rope'n'Fly and more...\u2028\u2028<br/><br/>FEATURES<br/>• New game modes including World Cup, America Cup, Europe Cup and more<br/>• New short and long season<br/>• New stadiums, new fields<br/>• New game modes including Penalty Shootout, Beach Soccer and Street Soccer<br/>• New game mechanics including Fouls, Penalty shoots, Long Pass, Winner animations, etc.<br/>• New ‘Pro’ difficulty level for the real experts<br/>• New teams, more countries<br/>• Quick game<br/>• 11 vs. 11 and 4 vs. 4 game modes\u2028<br/>• Various stadiums and configurable game time\u2028<br/>• 4 difficulty levels for longterm motivation (easy, medium, hard, pro)\u2028<br/>• iOS7 MFI and MOGA Game Controller support\u2028<br/>• Simple yet powerful touch controls with timing control\u2028<br/>• Automatic or Manual Running<br/>\u2028• 40 different soccer teams to choose from<br/>\u2028• Match statistics<br/>\u2028• Smooth animations with 60 frames per second \u2028<br/>• Compete with your friends with the integrated world ranking leaderboard\u2028\u2028<br/>• Pure soccer action!\u2028\u2028<br/><br/>Take a look at the Stickman Soccer 2014 Trailer : https://www.youtube.com/watch?v=Hjo-0XQWrhM<br/><br/>Feel free to post your ideas, we will try to implement them as soon as possible\u2028.<br/><br/>Thank you very much for all your support and interest in our games! We would love to hear your suggestions!", "metacritic": null, "released": "2014-06-04", "tba": false, "updated": "2019-07-29T22:41:51", "background_image": "https://media.rawg.io/media/screenshots/dc7/dc70ae3bc97f579fbbd53fed92d51fff.jpg", "website": "http://www.djinnworks.at", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Djinnworks"], "genres": ["Action", "Sports"], "publishers": ["Djinnworks"], "esrb_rating": "Everyone 10+"}