{"id": 745582, "slug": "arm-ageddon", "name": "Arm-ageddon", "name_original": "Arm-ageddon", "description": "Arm Yourself!\r\n<p>In Arm-ageddon, you play as B. E. A. R, a robot trying to survive and escape from a post apocalyptic world of robots, radiation, and rock.  In this demo, you'll attempt to survive against hoards of enemies for as long as possible.  To do so, you'll need to equip various arms- the hand cannon or the carpel gunnel.  You can carry two arms at the same time, but be careful.  Taking damage will damage your active arm, but so will shooting, so aim your shots wisely!</p>\r\nControls\r\n<p>The controls are as follows:</p>\r\nMoveA / D or left and right arrow keysJumpW or up arrow keyPick Up ArmEAttack with equipped armLeft mouse buttonSwap active armRight Mouse ButtonDiscard ArmQ\r\nFeedback Questions:\r\n<p>When providing feedback for the game, please respond to the following questions:</p>\n<ol><li>How long did you survive against the enemies (If you remember the time on the in-game clock when you died) and how did you feel about the difficulty of doing so? </li><li>Did you feel like the number of enemies was in a good place? Were there too many, not enough, or just the right amount? </li><li>Did you feel that swapping arms was intuitive, or would you rather have both arms bound to different buttons? </li><li>Did the controls feel smooth and make sense? </li><li>Did you feel that the UI presented information in a way that made sense?</li><li> Was anything hard to see, and did the art style communicate information well? </li><li>Did you encounter any bugs? If so, were there any bugs you think added to the experience rather than detracted from it?</li></ol>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T13:49:31", "background_image": "https://media.rawg.io/media/screenshots/3b2/3b26c15925b4eb373abf04a67791ee96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hhaak"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}