{"id": 745628, "slug": "motto-haramase-honoo-no-oppai-isekai-ero-mahou-gak", "name": "Motto! Haramase! Honoo no Oppai Isekai Ero Mahou Gakuen!", "name_original": "Motto! Haramase! Honoo no Oppai Isekai Ero Mahou Gakuen!", "description": "<p>The protagonist, Takumi Kazuya, is a contributing author to the erotic light novel website [Let&#39;s do erotic novels!], where he writes erotic fiction. Soon after, he was contacted by a light novel publisher and his work reached a million hits. He sat back in his bathtub thinking of his erotic novel and his road to fame.</p>\n<p>&quot;How long are are you gonna be in there? Dumb brother!&quot;, His younger sister yelled out to him as he was thinking of his novel. Annoyed, his sister elevated the bath temperature to MAX and there was an accidental explosion.</p>\n<p>He heard a voice across the white light. He soon fell out of the white light to the other side.<br />\n&quot;Oooohhhhh!&quot;<br />\nKazuya had arrived in a different bath in a new location, surrounded by a bunch of surprised girls.</p>\n<p>&quot;Is this heaven?&quot;<br />\nEvery one of these girls had gigantic boobs. It&#39;s like milk was just ready to come bursting out of them. As soon as Kazuya thought that, a magic square came forth and the girls&#39; breasts started shooting milk all over. Could he now use magic? Screams of surprise filled the room.</p>\n<p>In the women&#39;s hot springs of a parallel world Kazuya was now reborn. This is just like in the erotic light novel that he had written. He now realized his erotic desires work as magic on girls!? It&#39;s time to conquer this other world with ero-magic!</p>", "metacritic": null, "released": "2018-04-27", "tba": false, "updated": "2022-02-25T14:05:19", "background_image": "https://media.rawg.io/media/screenshots/37f/37fd5e3abc320063f066e48b96986cab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Casual"], "publishers": [], "esrb_rating": "Adults Only"}