{"id": 745653, "slug": "social-interaction-simulator", "name": "Social Interaction Simulator", "name_original": "Social Interaction Simulator", "description": "<p>In this game, you'll take the role of an everyday person, faced with seemingly simple tasks. You'll try and make it through these tasks — purchasing food at a restaurant, buying groceries, and booking a doctors appointment — making as few mistakes as possible, going as fast as you can. </p>\n<p>This game focuses on the idea of social and environmental overstimulation. In the game, you're pressured to move quickly to achieve the best score possible, and you're openly called out if you make too many mistakes. I also tried to target the fear many people have of approaching social situations, where things go wrong or differently than what you had expected and prepared for.</p>\n<p><strong>Game made in 72 hours for Mini Jam 100: Overload.</strong></p>\n<p>Post-jam thoughts:</p>\n<p>Overall, I'm pretty pleased with how this turned out for my first ever jam. I missed the first day and had work so in all I probably made this in about 10 hours, without adding in the time it took my partner (@Ramyuuu on Instagram for more art) to finish the assets. I had hoped to add more gameplay elements and more \"punishments\" but time got the best of me. Also, the main menu has no music, and there's a couple weird visual errors in the text printing. Other than that, not a bad first try!</p>\n<p>As a disclaimer, the audio is broken on Safari, but appears to work on Google Chrome. </p>", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-02-25T14:14:38", "background_image": "https://media.rawg.io/media/screenshots/1a0/1a0285d7ff578485f4e865369cae296c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kiraTFUP"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}