{"id": 745784, "slug": "initium-legenda", "name": "Initium Legenda", "name_original": "Initium Legenda", "description": "<strong>\"A new and grand fantasy world that has never existed before opens.\" </strong><br/><strong>\"You're the adventurer who will start the legend with Siryu!\"</strong><br/>Initium Legenda is the first authentic SRPG game developed and launched by Legenda Inc.<br/><br/>1. Interesting game story<br/>Initium Legenda is an epic set in a fantasy world. Each stage of Initium Legenda the user encounters does not stop at just defeating enemies. The small but deep and interesting stories created by the main characters in the game will become an opportunity for users to become immersed in the game.<br/><br/>2. Character development<br/>Users who play Initium Legenda can meet a variety of characters that are constantly added. Each character can foster abilities and various skills that suit their characteristics. The skill ability of the character expressed in the skill tree will become more powerful as it is upgraded.<br/><br/>3. Strategic play<br/>Every battle stage of Initium Legenda is not easy. Strategic play should be made considering the characteristics, skills, monster abilities, and placement on the map. Through intelligent play, users can enjoy the pleasure of winning the battle stage. In addition, the ranking level obtained with victory will be a measure of how effective the user's strategy was.<br/><br/>4. Item acquisition and combination<br/>The user who wins the battle can get various loot by defeating monsters. Users who play Initium Legenda will enjoy the thrill of being able to purchase armor and weapons that can be made stronger in the store with gold coins, and creating new items by combining store items and loot.", "metacritic": null, "released": "2022-02-25", "tba": false, "updated": "2022-02-28T03:11:26", "background_image": "https://media.rawg.io/media/screenshots/b9a/b9a41f0c334545b07865f5d3ab46de76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LEGENDA"], "genres": ["RPG", "Indie"], "publishers": ["LEGENDA"], "esrb_rating": null}