{"id": 745771, "slug": "grisaia-phantom-trigger-vol8", "name": "Grisaia Phantom Trigger Vol.8", "name_original": "Grisaia Phantom Trigger Vol.8", "description": "\"Grisaia: Phantom Trigger\" is a visual novel. Returning character artist Akio Watanabe and writer Ryuta Fujisaki bring you the last installment in the acclaimed Grisaia series, \"Grisaia: Phantom Trigger\".<br/>This is the final instalment in the Phantom Trigger series! What will become of the members of SORD at the end of this long, grueling battle?<br/><strong>This final volume contains over three times as much text and voiced lines as the previous volumes.</strong><br/><br/>Story:<br/>At last, an all-out war is at hand.<br/><br/>The battle against the religious organization, The Fatal Answer (TFA), has entered its final phase, with CIRS and SORD preparing to send all of their troops into TFA's stronghold.<br/><br/>The battlefield soon descends into total chaos. Black rain pours down, civilians become desperate for water, and shots are fired at friend and foe alike. Not even the trenches are safe from the anti-aircraft guns TFA employs, the explosions bombarding the combat zone that the girls are tasked with invading. Such a feat is not unlike invading the depths of hell itself. The underground base is quickly being suffocated by gunpowder, and the dark forest that surrounds the battlefield reeks with the stench of death. But both contain within them the faint yet tenacious flames of life; will those flames be able to withstand the harsh realities of war?<br/><br/>This must never, ever be repeated again...<br/><br/>\"Listen up, everyone! Final equipment checks!\"<br/>\"Yeah, there's nowhere to retreat to.\"<br/>\"Is it okay to kill them?\"<br/>\"We can die happy.\"<br/>\"Thank God! I'll never let you go again!\"<br/>\"Life itself is war...\"<br/>\"Prepare for close-quarters combat!\"<br/>\"Holy crap! Look! They're charging right at us!\"<br/>\"They've completely lost their minds...\"<br/>\"Well then, I guess it's time to end this... What are you going to do, Enishi-san?<br/><br/>The girl places her finger on the trigger of fate...<br/><br/>\"Why... Why do you fight?\"", "metacritic": null, "released": "2022-02-24", "tba": false, "updated": "2022-11-03T16:28:29", "background_image": "https://media.rawg.io/media/screenshots/6fa/6fa42d424ec949d815b8ba9b1844e320.jpg", "website": "http://grisaia-pt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 1}, "playtime": 9, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 357, "game_series_count": 18, "reviews_count": 1, "platforms": ["PC"], "developers": ["Frontwing"], "genres": ["Adventure", "Casual"], "publishers": ["Frontwing USA"], "esrb_rating": null}