{"id": 745758, "slug": "ikai", "name": "Ikai", "name_original": "Ikai", "description": "<p>Ikai is a first-person psychological horror game drawing inspiration from Japanese folklore. Live the horror by the hand of its defining yokais and submerge into the superstitions of the past driven by a unique story and exploration.</p>\n<p>Ikai embodies the spirit of the classical psychological horror genre with a defenceless main character incapable of attacking the evil creatures. However, it explores a new sense of horror by making the player face the threats directly neither fleeing nor attacking.<br />\nEvery mechanic of the game is meant to raise this relatable feeling of helplessness and create a tense atmosphere. The slow, precise and natural movements as a way of interaction resemble real life’s to foster immersion in the uncanny world of Ikai.<br />\nSTORY<br />\nRumors have spread even through the most sceptical villagers, giving way to fear and hysteria. It’s not just a matter of gossip this time. The blood-stained leaves indicate that evil creatures are getting closer and closer to humans. It is believed that a new demon has turned up in the underworld. Its will is to cross the doorway into our world as soon as it finds what it is looking for. Such a situation requires the priest to head to the village, leaving the shrine under his niece’s control, the priestess.</p>\n<p>The crowd’s fear hasn’t reached the shrine far away in the mountains, where the priestess, Naoko, works as usual, too busy to worry. Sweeping and sweeping, time goes by, with or without the priest. Without giving much importance to this sort of demon and ghost stories she ascribes to fearful children, Naoko leaves the shrine to get to the river before it gets dark. Villagers’ dreads seem to take shape in the gloomy forest. She keeps walking, increasingly tense, until her doubts are dispelled; but not her fears.</p>\n<p>She soon loses consciousness of her soul and body and falls to the ground; almost dead, almost alive. The shrine’s bell screams for help, but it is no longer a sacred place. All Gods have gone, giving way to monsters, ghosts and spirits.<br />\nGAMEPLAY<br />\nFEAR: Experience the horror in first-person by the hand of Japanese spirits, monsters and yokais<br />\nEXPLORATION: Wander around a feudal shinto shrine and explore to unveil the story behind Naoko, the main character<br />\nDRAWING: Concentrate on drawing protective seals over the strange sounds and events happening around<br />\nPUZZLES: Pit your wits against the several puzzles that will try to stop you<br />\nSTEALTH &amp; RUN: Be silent, do not disturb the evil… Or just run, run away from it all, if you can…</p>", "metacritic": null, "released": "2022-03-29", "tba": false, "updated": "2024-03-30T12:49:19", "background_image": "https://media.rawg.io/media/screenshots/315/315d2794bd4a9bb66ecf70a8d05a5a77.jpg", "website": "https://www.endflame.com/ikai", "rating": 3.22, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 21, "beaten": 10, "toplay": 7, "playing": 1}, "playtime": 4, "achievements_count": 25, "ratings_count": 8, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Endflame"], "genres": ["Adventure", "Indie"], "publishers": ["PM Studios"], "esrb_rating": null}