{"id": 74584, "slug": "ultimate-ninja-blazing", "name": "Ultimate Ninja Blazing", "name_original": "Ultimate Ninja Blazing", "description": "Test your ninja battle tactics in the latest NARUTO SHIPPUDEN game! Take part in Shinobi Formation Battles and battle online with all of your friends. Experience the original story from the popular anime in the first-ever mobile game from the NARUTO Ultimate Ninja series!<br/><br/>NARUTO SHIPPUDEN: Ultimate Ninja Blazing is the ultimate fighting RPG game featuring the all-new Shinobi Formation Battle system: a strategic RPG fighting system with intuitive controls that unleash exhilarating combination attacks with your allies while avoiding group hits from the enemy.<br/><br/>Master team field skills, discover new fighting tactics and become the next Hokage in this first-ever mobile game in the Ultimate Ninja series!<br/><br/>Create Your Very Own Ninja Team!<br/>• Form your very own ninja team with over 100 of your favorite NARUTO heroes, each with their own unique attacks and skills!<br/>• Use special team moves together on the frontiers of battle for massive damage!<br/><br/>Play Through the Storyline from the Beloved Anime!<br/>• Relive NARUTO’s classic missions from the original series!<br/>• Relive popular scenes from the Anime, re-created for an unforgettable RPG experience! <br/><br/>Unleash Ninjutsu and Secret Fighting Techniques!<br/>• Master a huge range of ninjutsu, from powerful offensive attacks to ninjutsu that can seal an enemy's movements! <br/>• Some characters also possess even more powerful secret fighting techniques!<br/>• Unleash combination attacks with the Shinobi Formation Battle system!<br/>• Use Field Skills with special characters to turn the tide of battle!<br/><br/>Strategize and Strike at the Right Moment!<br/>• Create battle strategies based on the position of your teammates with Shinobi Formation Battle<br/>• Avoid group hits and to unleash special team maneuvers!<br/><br/>Battle with Other Ninjas Around the World!<br/>• Take the fight online and ally yourself with other players in various missions!<br/>• Play missions with up to 3 people in multiplayer!<br/><br/>Challenge Other Players in Phantom Castle Mode!<br/>• Top the online leaderboards in monthly Phantom Castle events!<br/>• Battle against other players for the most points and see who has the better fighting tactics! <br/>• Take down a multitude of enemies that await you as you climb the Phantom Castle!<br/><br/>BANDAI NAMCO Entertainment Inc. Website:<br/>http://bandainamcoent.co.jp/english/<br/><br/>By downloading or installing this app, you agree to the BANDAI NAMCO Entertainment Terms of Service.<br/><br/>Terms of Service:<br/>http://legal.bandainamcoent.co.jp/terms<br/>Privacy Policy:<br/>http://legal.bandainamcoent.co.jp/privacy<br/><br/>Note:<br/>This game contains some items available for in-app purchase that can enhance gameplay and speed up your progress. In-app purchases can be disabled in your device settings,  see http://support.apple.com/kb/HT4213 for more details.<br/><br/>Note About \"Family Sharing\":<br/>This application currently does not support the \"Ask to Buy\" feature included with Family Sharing. As a result, using this feature to make an in-app purchase on a device with Family Sharing enabled may result in an error. We ask that you do not use the \"Ask to Buy\" feature when purchasing items until we have updated our application to support this feature.<br/><br/>This application is distributed under the official rights from the license holder.", "metacritic": null, "released": "2016-08-24", "tba": false, "updated": "2019-10-11T04:23:48", "background_image": "https://media.rawg.io/media/screenshots/d3a/d3a1d1a8d1fb588addd6c7b70251c264.jpg", "website": "https://naruto-blazing.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Bandai Namco Entertainment"], "genres": ["Action", "Puzzle"], "publishers": ["Bandai Namco Entertainment"], "esrb_rating": null}