{"id": 745839, "slug": "endlanders", "name": "Endlanders", "name_original": "Endlanders", "description": "Follow us on Kickstarter to get notified when we launch our campaign!<br/><br/>https://www.kickstarter.com/projects/endlanders/endlanders<br/><br/>Build your deck, glitch through enemies, translate unknown languages and decipher the mysteries of this universe, in this grid-based real time combat indie game.<br/><br/>Endlanders features two main characters with diverging storylines in the same universe, fighting and exploring their way through vastly different planes with anachroninstic themes.<br/><br/>The game features :<br/><br/>A deck-building system, where cards are instant spells :<br/><br/><br/><br/>A grid-based real time combat, where our two characters have distinct gameplay styles :<br/><br/><br/><br/>And a translation system, where by collecting runes the player will be able to advance the story further :<br/><br/><br/><br/>The game takes place across many planes, and each character visits a few of them, exploring, researching and trying to understand a strange substance called Source, which appears on all living (and some times not) lifeforms. Players will keep their thoughts on their log which is updated throughout the game through interactions.<br/><br/>Each character analyzes the mysteries of this substance in their own manner, offering different insights.<br/><br/>Our two playable characters are :<br/><br/>Cosmos, who has a more combo-oriented fast combat style, and their attacks emphasize by building combo points using \"Tempo\" cards, and using \"Finisher\" cards that deal more damage based on the amount of combo points. However if some time passes and they haven't landed a hit, the combo points reset to zero, and since finisher cards deal most of the damage, starting a combo but letting it fall flat will decrease the damage output.<br/><br/>Cosmos is more concerned with the \"why\" questions regarding this substance, and their log has entries that explore themes of purpose, faith and existentialism.<br/><br/><br/>and Quls, who has a more reactive calculated combat style, and their attacks fill the tank with gas by using \"Combiner\" cards, or deplete it by using \"Diffusant\" cards. However being at the edges (full tank or empty tank) might cause unexpected outcomes, such as explosions or debuffs, so the player need to be careful. Being at edges however has its own rewards, since Quls's attacks deal more damage if their chemtank is empty or full.<br/><br/>Quls is more concerned with the \"how\" questions regarding this substance, and their log has entries that revolve around how to use this substance, how to create it, and it's interactions.<br/><br/>Our characters could be conceived as binary opposites on their thoughts and actions, however the more players indulge on the story the more they will understand that things are more complicated.", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T03:47:00", "background_image": "https://media.rawg.io/media/screenshots/66b/66b44acadba6addc1bbdee5fa2f7cae4.jpg", "website": "https://www.kickstarter.com/projects/endlanders/endlanders", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Eteros Studios"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Eteros Studios"], "esrb_rating": null}