{"id": 745822, "slug": "ikusaaaaaaan", "name": "IKUSAAAAAAAN!", "name_original": "IKUSAAAAAAAN!", "description": "<h3>Experience of 193% exhilaration like never before </h3>Use the <strong> completely invincible </strong> fever system to shoot down the oncoming enemies!!<h3> Operation method </h3>Compatible with gamepads and keyboards.<br/><br/><ul><li> Shot: An attack that can be shot without restrictions.<br/>Pad: A button / Keyboard: Z key<br/></li><li> Spell: An attack that consumes and shoots a spell gauge.<br/>Pad: X button / Keyboard: X key<br/></li><li> Fever: Fever will be invincible as long as the remaining time allows and the shot will be strengthened.<br/>Pad: R1 button / Keyboard: L-Shift key<br/></li><li> Pose: Pause the game.<br/>Pad: Start button / Keyboard: ESC key</li></ul><br/>* Key assignment can be changed with the key config.<h3> Shot </h3>It's a low-powered attack instead of shooting without limits.<br/><ul><li> Straight shot<br/>Simple shot 1, attack range is a little narrow.<br/>When combined with high speed, it can cover the narrow range to some extent.<br/><br/><br/></li><li> Wide shot<br/>Simple shot 2, perfect for clearing Zako.<br/>The power when hitting all is the same as straight.<br/><br/><br/></li><li> Rolling shot<br/>It can cover all directions, but ...<br/>The power when hitting all the shots is the highest, but the use at the bottom of the screen is very poor ...<br/>For advanced users as it is premised on using Fever's invincible time<br/></li></ul><h3> Spell </h3>It's a powerful attack that consumes energy and releases it.<br/>Energy will recover to 100% in 2 to 3 seconds, so use it sparingly.<br/>You can check the energy with the gauge around your ship.<br/><ul><li> Blue: 100%, Spell available.<br/></li><li> Green: Less than 100%, Spell available.<br/></li><li> Red: Spell disabled.</li></ul><br/><br/><ul><li> Bomb<br/>High-powered bullet that explodes when touched.<br/>When it explodes, the attack range expands over a wide area.<br/><br/><br/></li><li> Thunder<br/>Fires a penetrating attack in a straight line with the nearest enemy.<br/><br/><br/></li><li> Kaihou<br/>Tracking laser.<br/>Chase and wipe out enemies for a certain period of time.<br/></li></ul><h3> Fever </h3>Super important system for capture.<br/>When you activate Fever.<br/><strong> Your ship becomes invincible and your shots are super-powered up. </strong><br/><br/><br/>Even if it hits an enemy bullet, it will not make a mistake and will eliminate the touched enemy bullet.<br/>* Even if it hits the laser, it will not be a mistake, but it cannot be extinguished.<br/><br/>You can check the usable time in the fever time on the upper left of the screen.<br/><br/><br/>Fever time increases by acquiring peach items.<br/>", "metacritic": null, "released": "2022-02-25", "tba": false, "updated": "2022-02-28T03:36:20", "background_image": "https://media.rawg.io/media/screenshots/8f0/8f0f0d35027260e8a2aac525874f07e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["幽々燦々(yuyusansan)"], "genres": ["Action"], "publishers": ["幽々燦々(yuyusansan)"], "esrb_rating": null}