{"id": 746062, "slug": "the-night-after", "name": "The Night After", "name_original": "The Night After", "description": "THE NIGHT AFTER\r\n\n<p><strong>What if your whole life has been a lie? What if your whole past was rooted deep into a disturbing mystery?</strong><br/></p>\n\n<p>The Night After is a visual novel point and click adventure game set in a fictional world where monster exist. This is a short demo of a game that I am working on and it showcase the overall gameplay of how the whole game is going to be.</p>\n<p>This game has horror and mystery element into it and mostly, I am excited about making the puzzles in the game. I really love puzzles and it has been a dream to make a game like this.</p>\n\n<p><strong>What is \"The Night After\" about? </strong></p>\n<p>We follow a regular brother and sister who's living their life happily, doing their Universities and pursuing their careers. One day, both of their parents died mysteriously and without a trace. They said it was a car accident, but they never got to see their bodies. Their life changed after that.</p>\n<p>One year after their parents death, they received a mysterious package related to their parents. They received the package from an unknown source and now they have to go to figure out what is going on and the mystery surrounding their parents death.</p>\n<p>Follow them as they venture into a strange land that doesn't exist in any map. A land where everything doesn't make any sense.</p>\n\n<p>There are a lot of characters in this game and I am always excited writing these characters. The player can choose between two characters, Jake Voss and Sally Voss. Jake and Sally are brother and sister.</p>\n<p><strong>JAKE VOSS</strong></p>\n\n<p><strong>SALLY VOSS</strong></p>\n\n<p>There are more characters in the game but I don't want to spoil it to you guys. So I only put the main characters here. These are the characters that you can pick in the game. Currently I am focusing on Jake's story, so Sally's story is not done yet.</p>\n\n<p><strong>CURRENT CONTENT</strong></p>\n<p><strong>Point-and-click Puzzles</strong></p>\n<p>There will be a lot of puzzles in the game. This is a point-and-click game, player will have to solve a lot of puzzles to escape from certain situations or figure out what to do next. Player needs to finish these puzzles in order for the story to continue.</p>\n<p><strong>Character Interaction</strong><br/></p>\n<p>Player can also interact with characters that are in the player's party. You can interact with them at certain scenes and if you want the full experience, make sure to talk with all of them if you want. Characters can sometime hint on puzzles or add more information about the story.</p>\n<p><strong>UPCOMING CONTENT</strong></p>\n<p><strong>Romance</strong></p>\n<p>There's also going to be romance in this game, but the romance system is not in this demo yet. I just planted the seed of what's to come in the upcoming game. Who said the you can't make a relationship despite being in a strange land?</p>\n<p><strong>Map Exploration</strong></p>\n<p>There's also going to be exploration in this game. I won't spoil anything but I am excited working on this feature. This game is going to be pretty big and long.</p>\n<p>===========================================================</p>\n\n<p><strong>WRITING AND PROGRAMMING:</strong></p>\n<p>This game is fully written and programmed by me. I am working in this game alone, but I would like to have some small team members that can help me making this game. I don't have any budget at the moment so I am working with what I have.</p>\n<p><strong>ARTS:</strong></p>\n<p>The arts in the games are various. I drew a lot of the arts but there are also some arts that I got from the Internet as the background and for the character too. A lot of the background arts and musics are placeholder at the moment.</p>\n<p><strong>Character arts:</strong></p>\n<p>Characters in the game I made with an app called \"Magic Furry Dress Up\" on Google Play Store by DanielMoralesnue.<br/></p>\n<p><strong>Background arts:</strong></p>\n<p>By \"Noraneko Games\", The Reaver art by PopCorn96 on instagram, Klace Portrait by Cyan Pyrra on telegram, Forest Background (Night) for Visual Novel by Viridea</p>\n<p><strong>Musics and SFX:</strong><br/></p>\n<p>- \"Page Turn 1.mp3\" by SilverIllusionist, \"Car Crash\" by squareal, \"tangcomplete.wav\" by escortmarius, \"AMB noche grillos.mp3\" by missteik, \"shower.mp3\" by mpfeiffer, \"Fireplace - Silencyo_CC_Fire in Fireplace_Close Up_Reverberant.aif\" by silencyo, \"Barrel Breaking - Barrel Break 4.wav\" by kevinkace under CC0 1.0 Universal (CC0 1.0) Public Domain Dedication </p>\n<p>- \"Alien Ice Creature - Alien Ice Creature - 04.wav\" by GregorQuendel, \"Happy Music Background Music\" by Migfus20, \"Alien Ice Creature - Alien Ice Creature - 02.wav\" by GregorQuendel, \"Wood - Breaking wooden plank\" by jorickhoofd, \"Wall Clock Ticking.wav\" by straget, \"Knocking On Door\" by LPHypeR, \"Relaxing Music - Relaxing Music\" by Migfus20, \"Epic Orchestra - Panic Background Music\" by Migfus20, \"Orchestra - Mysterious Background Music Orchestra\" by Migfus20, \"Sad Music - Sad Music\" by Migfus20 under  Attribution 3.0 Unported (CC BY 3.0)</p>\n<p>- \"Running, Snow, A.wav\", \"Heartbeat, Regular, Single, 01-01, LOOP.wav\",  \"Rain on Windows, Interior, A.wav\", \"Door, Front, Opening, A.wav\" by InspectorJ</p>\n<p>- \"Body Falling\" by NeoSpica of Freesound.org , \"Acoustic guitar - Sleepy - Acoustic Guitar - Sleepy - br ch 1 - 127bpm Bb.wav\" by afrodrumming of Freesound.org , \"Unlock the door (1)\" by Breviceps, \"Horror/Surreal\" - \"Closing in 2\" by Eric Matyas</p>\n<p>-\"Steampunk Crossbow Shot 1\" by Iwan ‘qubodup’ Gabovitch under CC-BY 3.0 License</p>\n<p>===========================================================</p>\n<p>That's all from me, thank you for reading and I hope you enjoy your game! I really appreciate the help and support.<br/></p>\n\n<p><strong>You can contact me on:</strong></p>\n<p><strong>  </strong>     </p>\n\n<p><strong>Discord: RulfFoxton#4919</strong></p>\n\n<p><strong>If you want to support me on the development of this game, you can support me with PayPal and Patreon:</strong></p>\n\n\n<p>===========================================================</p>\n<p>===========================================================</p>\n\n<br/>", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-02-28T05:04:55", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf9863f3bdb7d1f11c19a09e3310d90b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Rulf Foxton"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}