{"id": 746152, "slug": "la-terreur-sur-roues", "name": "La Terreur Sur Roues", "name_original": "La Terreur Sur Roues", "description": "<p><strong>NOTICE: THIS IS A DEMO</strong><br/><br/><br/><br/>The curtains pull to reveal you, Viscountess Liliane Fay. Ready to travel the world with her husband's blessing, she is cordially invited on the Golden Eagle; a newly built train where only the finest can hitch a ride to the city of the wealthy: Ozoisshire. <br/><br/>As she embarks on the train, she finds herself in a fateful encounter with Viscount Thibault Brodeur, her childhood friend infatuated with her before she met her future husband. That isn’t the only surprise, as the train starts towards the city she is soon met with the body of an old lady. <br/><br/>Stuck on a moving train with the conductor refusing to stop, how will she be able to escape her childhood infatuation and a sneaky killer?<br/></p>\n<p><strong>WILL OUR PROTAGONIST MAKE IT TO THE DREAM CITY? OR WILL SHE BE LOST IN THE WHEELS OF TIME?</strong></p>\n<p>Based in France during the 1920s,  La Terreur Sur Roues will have you meet a colorful cast each with their own dreams and ambitions awaiting them in Ozoisshire. Try to find out who the killer is through hints in dialogue, the train guest's habits, and your own sneaky conclusions!</p>\n\n<ul><li>Immersive Story: Step into the 1920s France when music and culture are all the rage! You'll find our dialogue, art, backgrounds, and story is written to be as period-accurate as possible. </li></ul>\n\n<ul><li>Two Endings: You can achieve two endings! A good one and a bad one. Be sure to pay attention to the story to see what to do.</li></ul>\n\n<ul><li>Colorful Cast: You'll be playing as the excitable Liliane Fay, thrown headfirst into a world she doesn't particularly prefer. Within the wealthy cast includes a local casino owner, a song-writer, a comedian, a rising actress, a steward, train conductor's wife, photographer, and detective!</li></ul>\n\n<p>Creative Director/Lead Writer: Oishii <br/></p>\n<p>Co-writer: Biscuwuit</p>\n<p>Project Co-leader: Alyssa<br/></p>\n<p>Programming: NSAID<br/></p>\n<p>Lead Artist: Catsket</p>\n<p>Music/Sound Effects: Soundimage.org</p>\n<p>Special Thanks: DevTalk<br/></p>", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-02-28T05:30:59", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e016a61e1814d083169f93133717bf2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oishii"], "genres": [], "publishers": [], "esrb_rating": null}