{"id": 74624, "slug": "bee-brilliant", "name": "Bee Brilliant", "name_original": "Bee Brilliant", "description": "\"Bee Brilliant is a match-3 puzzler with quite possibly the best theme song ever\" - AppSpy.com<br/>\"Luv this app. Colorful, easy until you get to a certain level - then very challenging and fun!\" - coozoe<br/>\"Always love finding these gems. Great game.\" - andrewthewriter<br/><br/>Explore the world of Beeland and meet the singing Babees, the crazy Busy Bees and the cheeky spiders in this buzzing FREE puzzle game. Get ready to connect colourful lines of Babees and make awesome combos! Release your inner bee and join the beedazzling adventure TODAY! <br/><br/>FEATURES:<br/>• Easy, addictive gameplay! Match and connect one colourful line of bees after another to unleash combos!<br/>• Play your way through Beeland in 6 different game modes and hundreds of addictive levels!<br/>• Challenge your friends! Can you Bee Brilliant enough to top their high scores?<br/>• Lots of crazy bees! Meet Ms. Honey, Sgt. Sting, Beecasso and others! And, of course, the singing Babees will not miss a chance to break into their buzzing mix of disco and barber shop!<br/>• Loads of different game modes: Pop the cheeky spiders' web, collect honey pots and much, much more!<br/>• Not to forget: A lifetime's supply of bee puns!<br/><br/>Already played and enjoyed the game? Stay tuned for updates and do drop us a review! Also, check out these sources for all the latest news and info:<br/><br/>Facebook: facebook.com/BeeBrilliantGame<br/>Twitter: twitter.com/BeeBrilli<br/>Instagram: instagram.com/beebrilliantgame/<br/>Terms of Service: tactile.dk/legal/tos.html<br/><br/>See you in Beeland! THANK YOU!", "metacritic": null, "released": "2014-10-15", "tba": false, "updated": "2019-07-29T12:43:56", "background_image": "https://media.rawg.io/media/screenshots/ba9/ba9016b1e6b8dc85941f13592eb023ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Tactile Games ApS", "Tactile Games"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Tactile Games ApS"], "esrb_rating": "Everyone 10+"}