{"id": 74637, "slug": "kill-shot-bravo-sniper-fps", "name": "Kill Shot Bravo: Sniper FPS", "name_original": "Kill Shot Bravo: Sniper FPS", "description": "Play the #1 FPS Shooting Sniper Game on Mobile! <br/><br/>Arm yourself with deadly assassin sniper weapons, assault rifles, machine guns and the latest military gear to complete covert combat missions deep inside enemy territory!<br/><br/>OVER 2400+ MISSIONS<br/>Trained as a Special Forces soldier you will navigate secret missions across the globe, eliminating hostile forces and terrorist organizations that stand in the way of a peaceful world.<br/>If you love sniper games you'll love this.<br/><br/>•\tMove through environments to find the best sniper vantage points and take the all-important Kill Shot! <br/>•\tCommandeer vehicles to turn the tide of battle! Navigate close quarter combat down narrow alleys in the back of a jeep, or take out hostile threats by air in hazardous helicopter missions! <br/>•\tComplete breach missions to enter occupied buildings and clear them of any threat! Survive a full on enemy attack in multiplayer assault missions and outshoot your opponent. <br/> <br/><br/>ENEMIES<br/>•\tEncounter different enemy types each with their own strengths and combat objectives. <br/>•\tSeek out and neutralize Flying Drones, Exo-Suit Soldiers, Mechs, Heavy Gunners, Enemy RPGs, Sniper Marksmen, Riflemen, and Commando Bombers.<br/><br/>LIVE PVP SNIPER DUELS<br/>•\tTest your skill against other real snipers in live ranked Player Vs Player matches in PVP mode! <br/>•\tBe the hunter before you are the hunted!<br/>•\tUse your heat meter to zone in on the enemy threat. <br/>•\tFind your target. Take aim. Fire!<br/><br/>JOIN ALLIANCES AND BOUNTY EVENTS<br/>•\tBuild powerful alliances with other players and help each other to be successful completing the high risk missions. <br/>•\tDiscover and kill enemies with bounties on their heads before they can escape! New Zombie Event modes.<br/>•\tFriends can join you on missions, spotting the targets and assisting you to terminate enemies.<br/>•\tFull Chat function in game to allow tactical discussions with other players.<br/><br/>CUSTOMIZE<br/>•\tCustomize your avatar and get Perks to help in battle! <br/>•\tUnlock and equip cool Gear, including helmets, uniforms, body armour, goggles, facemasks, gloves, boots, and more.<br/>•\tGet a fresh Kill Shot moment with every victory! Now YOU get to control the Kill Shot camera as the final round zooms towards its target for the ultimate hit!<br/><br/>3D TOUCH<br/>•\tGround-breaking 3D Touch support allows unprecedented control of the action. Aim, zoom and shoot without the use of on-screen buttons!<br/><br/>REPLAYKIT<br/>•\tUse ReplayKit to record gameplay videos and capture the amazing shooter action! Share your favorite Kill Shot moments with friends and other players online.<br/><br/>GAME CENTER LEADERBOARDS AND ACHIEVEMENTS<br/>•\tLog in with Game Center and share progress between your iPhone, iPad and the NEW AppleTV!<br/>•\tCompete for high scores alone or with your Alliance against opposing Alliances.<br/><br/><br/>Elite Membership – Premium Subscription<br/>•\tSubscriptions are from $4.99 USD weekly, $14.99 USD Monthly, and $59.99 USD annually and includes 15% faster energy recharge rates, 20% faster weapon upgrade deliveries, 25% more bucks in Campaign missions, and a Premium Weapon. <br/>•\tPayment will be charged to iTunes Account at confirmation of purchase<br/>•\tSubscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>•\tSubscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase <br/>•\tAny unused portion of a free trial period will be forfeited when the user purchases a Premium Subscription.<br/><br/>PLAY THE #1 FPS SNIPER SHOOTING GAME ON MOBILE FOR FREE!<br/><br/>Kill Shot Bravo is rated 17+ and contains frequent/intense realistic violence. By downloading this app you are agreeing to be bound by the terms and conditions of Hothead's Terms of Use (www.hotheadgames.com/termsofuse) and are subject to Hothead's Privacy Policy (www.hotheadgames.com/privacy-policy).<br/><br/>", "metacritic": null, "released": "2015-11-17", "tba": false, "updated": "2019-10-22T14:24:56", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9508d2aa27039e30a0d1b21f8a6a0f.jpg", "website": "https://www.facebook.com/killshotbravo", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hothead Games"], "genres": ["RPG", "Simulation"], "publishers": ["Hothead Games"], "esrb_rating": "Mature"}