{"id": 746564, "slug": "fear-of-the-dark-itch-patrickbard", "name": "Fear of the Dark (itch) (patrickbard)", "name_original": "Fear of the Dark (itch) (patrickbard)", "description": "<p>This is my submission attempt for the Brackeys 2022.1 Game Jam</p>\n<p>The idea is that you are afraid of the dark that is inside your nightmares, but once there is enough light you are immune to any danger, because they are not real, they are only in your mind.</p>\n<p>This game uses procedural generation, deeply inspired by titles like Binding of Isaac and Spelunky.</p>\n<p>There was a lot of things that need to be improved on this game that could not be finished on the game jam time, here is a list of couple I remember:</p>\n<ul><li>Create a goal, at the moment is cool to play with the system but there is no objective <ul><li>The idea was to have a stair in distant room to go to another levels, then the goal could be a simple \"how far can you reach?\"</li></ul></li><li>Some game design improvements<ul><li>I wish to make some situations where the player must be invulnerable to get or access something </li></ul></li><li>Sound design<ul><li>I could only set some basic soundtrack for the game with free assets, that I think fit the game perfectly. But it desperately really needs some SFX .</li></ul></li><li>Further testing<ul><li>I'm not sure if the procedural object placement algorithm is fair enough, it would be nice to test it more and make some tweaks if necessary</li></ul></li><li>Fix some bugs<ul><li>Music doesn't change when game restart<br/></li></ul></li></ul><p><strong>ASSETS ATTRIBUTION:</strong></p><ul><li><em><strong>Code</strong></em><ul><li>This project was started following this tutorial, in case you want to know more about procedural generated content. It served as a basis, but <strong><em>a lot </em></strong>of changes were necessary to accomplish what I had in mind</li></ul></li><li><em><strong>Graphics</strong></em><ul><li>Most of the rooms were made with Dungeon Tileset II from 0x72</li><li>Other rooms and items were made with Interior Pack from Gif</li><li>Main character can be found here</li><li>Ghost character was purchased here</li></ul></li><li><em><strong>Music</strong></em><ul><li>All soundtracks are from Patrick de Arteaga</li></ul></li></ul>", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-02-28T07:30:49", "background_image": "https://media.rawg.io/media/screenshots/5ff/5ff99ae454c67e34e829e823b82940ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["patrickbard"], "genres": [], "publishers": [], "esrb_rating": null}