{"id": 746623, "slug": "insomnia-itch-yupr", "name": "Insomnia (itch) (Yupr)", "name_original": "Insomnia (itch) (Yupr)", "description": "<p>Insomnia is a game made by Junior Game Dev students as a submission for the Brackey's 2022.1 Game Jam and it's theme \"its not real\".<br/><br/>The game talks about a boy who's having trouble sleeping and thinks he has Insomnia because of his nightmares and lack of sleep, you play through one of his nightmares where he has to escape the ghost, solve a little puzzle, obtain the key to his parents room and escape. The plot twist is that the boy actually does not have parents and he is in an orphanage. It is not real, the dream wasn't real, his parents weren't real. There's also a few things in the game that follow the theme of \"it is not real\".<br/><br/></p>\n<p>We wish you a fun little 10 minutes of gameplay and even though there are a few bugs here and there, the game is fully playable and enjoyable. Please leave any comments as it helps a ton.</p>\n\n<p>* Hints:</p>\n<p>- You can press 'E' to hide in the fridge, under the bed, or in the storage.</p>\n<p>- You can press 'M' to mute all sounds.</p>\n<p>- If the Main Menu does not have sound try clicking the mute and unmute.</p><p><strong>If for some reason you cannot play the game, here is the submission: </strong></p><p><strong>(It's recorded with screen capture unfortunately but it still shows the game features. You are meant to take more time in the game to find the numbers for the safe but I speed ran for time and speed)</strong></p><br/>", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-02-28T07:46:22", "background_image": "https://media.rawg.io/media/screenshots/78c/78cfbb08aec88a348b506c57bf5da0ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yupr"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}