{"id": 74672, "slug": "sas-zombie-assault-3-hd", "name": "SAS: Zombie Assault 3 HD", "name_original": "SAS: Zombie Assault 3 HD", "description": "5-star zombie-shooting action, heaps of upgrades, and co-op multiplayer!<br/><br/>Elite SAS operatives handle the darkest missions, the worst hot zones - things we are not meant to know. Inserted without backup, either alone or as a 4 person squad, you will be sought by the walking dead, by hordes of unspeakable numbers. Your only option - paint the ground with every last one of them.<br/><br/>From the creators of Bloons TD4 comes the best action shooter on iOS in full HD glory! Rank up 50 times and unlock awesome weapons and perks with every rank. Dozens of guns and special weapons, 5 unique maps, and hundreds of zombies on screen at a time.<br/><br/>And that's just single player! Play co-op multiplayer at any time with super-easy matchmaking geared to your level. Huge fun to jump into a game at the same time with friends, and doesn't matter what iOS you have - iPads play seamlessly with iPhones.<br/><br/>Based on the ground-breaking flash game by Ninja Kiwi, but completely rebuilt and optimized for iOS, SAS 3 has been battle hardened by millions of plays and undergone extensive tuning and balancing to create the best action shooter available on the App Store!<br/><br/>Killer Features:<br/>- Intense zombie-blasting action shooter gameplay in beautiful HD!<br/>- Eviscerate the zombie hordes in single player or in 4 player co-op multiplayer<br/>- 50 Ranks to unlock, each granting access to a new weapon or perk<br/>- 44 devastating weapons like Auto Shotguns, Browning Machine Guns, Flamethrowers, and RPGs<br/>- 2 Sentry gun classes and 3 grenade types for serious room clearing<br/>- 5 challenging maps, each with very different hazards and kill zones<br/>- 9 relentless zombie types, with graphics that support hundreds on screen<br/>- 3 vicious game modes - Onslaught, Purge, and Apocalypse<br/>- Multiplayer play from anywhere in the world, whether on iPad, iPhone, or other smartphone platforms", "metacritic": null, "released": "2011-12-21", "tba": false, "updated": "2019-07-29T19:16:00", "background_image": "https://media.rawg.io/media/screenshots/478/478a880186ee7dd64f1202b925ce6f25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ninja Kiwi"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Kaiparasoft"], "esrb_rating": null}