{"id": 74698, "slug": "jellipop-match", "name": "Jellipop Match", "name_original": "Jellipop Match", "description": "Match 3 candies to collect jelly drops in order to advance along the candy track. With sweet surprises around each corner, a new mystery unfolds in every realm of the Jelly Kingdom. Whether you enjoy the excitement of brain teasers or seek a fun way to relax, Jellipop Match provides the ultimate experience of high quality entertainment. <br/><br/>Help Lily and her friends on their journey to save the Jelly Kingdom! Playing as Lily, you will fight off witches, monsters, mysterious elves, and more on your travels throughout the many realms of the kingdom. Master your moves and match up more than three candies to be rewarded with a variety of board clearing boosters! Use jelly spoons, cross bombs, sweet juice, and other magic boosters to step up your game. Jellipop Match offers a variety of new features, game modes, and battles. Take on the Jelly Kingdom alone or compete with your friends for the highest score! <br/><br/>With built in game currency, Jellipop Match is completely free to play! To buy more lives, extra moves, and other special items, payment with real money is required. The payment feature can be turned off by disabling in-app purchases in your device’s settings.<br/> <br/>Jellipop Match Features<br/>·      Hundreds of candy filled levels with more added every month!<br/>·      Harvest new rewards every day.<br/>·      Up to 10 spins on the Spin to Win reels to earn gold, magical boosters, and more!<br/>·      Raccoon’s Requests to earn fun rewards.<br/>·      Leaderboards to track your friends' and competitors' scores.<br/>·      Easily sync the game between mobile and tablet devices.<br/> <br/>Already a fan of Jellipop Match? Like us on Facebook for the latest news!<br/>https://www.facebook.com/JellyBlast/ <br/> <br/>Contact us directly at jellyblast_service@microfun.com <br/> <br/>Most importantly, a big THANK YOU to everyone who has played Jellipop Match!", "metacritic": null, "released": "2016-10-04", "tba": false, "updated": "2019-10-25T03:38:15", "background_image": "https://media.rawg.io/media/screenshots/4d4/4d46c3242978c2060f15d09386f39803.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Microfun"], "genres": ["Family", "Puzzle"], "publishers": ["Microfun"], "esrb_rating": "Everyone 10+"}