{"id": 747048, "slug": "the-fake-post", "name": "The Fake Post", "name_original": "The Fake Post", "description": "<p>Fake news are a big problem of today, making the population believe things that are not exactly <em>true</em>. You surely already <em>encountered</em> a lot of them on the internet and on the television, you hopefully <em>recognised </em>them, or maybe you even <em>fell </em>for some of them. <strong>But what if we told you that now you can <em>deliver</em> them?</strong><br/><br/><em><strong>The Fake Post</strong></em> is a simple game where you deliver newspapers around the town, riding your red bike and wearing a blue postman cap. Sometimes, breaking news will pop on the screen. Please choose wisely and</p>\n<p>start believing.</p>\n<p>Every time you choose to deliver a fake news, that crazy and unreal statement becomes instantly <em>true</em>. Everything and everyone in your little game town will be affected, no matter what.</p>\n<p><strong>You can change your believed piece of news once every ten (10) newspapers delivered.</strong></p>\n<p>Some news will be good for you, some others won't. You know, it's hard to predict what would happen if you choose to deliver a page entitled <em>\"Flowers: secretly bombs?\".</em></p>\r\nHow to play\r\n<p>After pressing <strong>Play</strong> in the main menu, you can:</p>\n<ul><li>Move around with <strong>WASD </strong>or the <strong>Arrow Keys</strong>.</li><li>Throw a newspaper by pressing the <strong>Left Mouse Button</strong>. The shoot direction depends on the current mouse position.</li><li>Increase your shooting power by holding the same <strong>Left Mouse Button</strong>: a bar will load and show you how far you will throw the paper roll.</li></ul>\n<p>You correctly <strong>deliver a newspape</strong><strong>r</strong> when it reaches the goal areas signaled with flags. Blue arrows around the screen will show you where to go to find new goals.</p>\n<p>Every 10 delivered newspapers, two fresh fake news will pop on the screen; you can select your preferred one by clicking on it with the <strong>Left Mouse Button</strong>.</p>\n<p>Some fake news might hurt you. The <strong>Health Bar</strong> on the top left corner of the screen will show you the situation. When you finally reach the end of it, you can consider your daily job completed :)</p>\r\nDevs Notes\r\n<p>We developed this game for the Brackeys Game Jame 2022.1. The theme was <em>\"It is not real</em>\", so talking about <em>fake news</em> seemed like a funny idea. <br/></p>\n<p>Well, it turned out it was far harder than we expected, as we're still learning how to make proper games (we have been developing them since one month ago, more or less). We wanted to add so many news and twists to the core games, but we barely inserted five of them :(</p>\n<p>This game is now a demo; we'll update it with more after the Jam evaluation period ends. <br/>In the meantime, feel free to comment, critique and suggest your ideas about this! We'll be pleased to read all of them :)</p>\r\nTechnical suggestions\r\n<p>If you experience any issues, please download and use the executable.</p>\r\nDevelopers\r\n<p>Thoozee, cat.astro.</p>\n<p>Made with Godot 3.4.2 and Blender 3.0.1.</p>", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-02-28T09:49:49", "background_image": "https://media.rawg.io/media/screenshots/bcd/bcdf1cc9fb5283994490001725ec8398.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Web"], "developers": ["Thoozee"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}