{"id": 747095, "slug": "the-universe-is-dying", "name": "The Universe is dying", "name_original": "The Universe is dying", "description": "<p>This Game is part of the Brackeys Gamejam 2022.1</p>\n<p>The music used can be found here: </p>\n\n<p>Setting of the game:The hope is not real</p>\n<p>An unknown force is destroying the universe, the last habitable part of the universe is secured by an Energetic Field Emitter(EFE). Unfortunately death cults are attacking the EFE.</p>\n<p>The Goal is it to defend the EFE so it can slow down the destruction of everything.</p>\n<p>This can be accomplished by, shooting down enemys and destroying the enemy bases.</p>\n<p>Bases will reveal themself once they launch an ship to attack the EFE.</p>\n\n<p>How to play:</p>\n<p>W to move forward</p>\n<p>A/D to steer</p>\n<p>Space to shoot missiles</p>\n\n<p>In the lower half of the screen is an radar, which points in the direction of different points of interests.</p>\n\n<p>Blue- EFE</p>\n<p>Yellow-closest star</p>\n<p>Black-known enemy base</p>\n<p>Red-enemy ship</p>\n\n<p>PS:I ran a bit out of time so a few planned aspects are missing like, upgrades, buying ressources and simple transport quests. There was even an price system planned where prices would skyrocket in a longer run cause of the missing planets and therefore missing ressources and workers.(maybe i will take this ideas up after the jam)</p>\n<p>Also for some reason my particle system crashed a few hours before the end of the jam which is the reason why the world looks a bit empty.</p>", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-02-28T10:03:00", "background_image": "https://media.rawg.io/media/screenshots/893/893b416905f7e87ea706d8217fcdd2db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kaiser der Menschheit"], "genres": [], "publishers": [], "esrb_rating": null}