{"id": 74705, "slug": "bike-race-pro-motor-racing", "name": "Bike Race Pro: Motor Racing", "name_original": "Bike Race Pro: Motor Racing", "description": "Bike Race Pro version has:<br/>● BETTER graphics <br/>● all levels unlocked<br/>● NO ADS <br/><br/>Ride your bike through amazing tracks with jumps and loops in this simple and fast-paced physics-based game.<br/><br/>Multiplayer! You can challenge your Facebook friends! <br/><br/>Tilt your device to lean your bike and touch the screen to accelerate/brake. <br/><br/>Features: <br/>- Single and multiplayer modes <br/>- Simple controls <br/>- All levels and Worlds already unlocked<br/>- 9 addictive worlds <br/>- 72 challenging tracks <br/>- Touch to accelerate, tilt to lean the bike<br/><br/>Note: On the user created levels section, if you want to play more than 3 featured levels per day, you will need to buy a level pack. You can play unlimited free levels created by you or your friends if you have the code. You can also play unlimited free levels shared publicly on the internet by other users. Levels can not be created on a mobile device. To create a level go to: www.bikerace.com<br/><br/>Bike Race Plus subscription<br/>- Bike Race Plus subscription has a Free Trial option that lasts 7 days. After that, this option costs $7.99 per week, auto renewable.<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Subscription automatically renews for the same price and duration period as the original \"one week\"/\"one month\"/\"one year\" package unless auto-renew is turned off at least 24-hours before the end of the current period<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package)<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase<br/>- No cancellation of the current subscription is allowed during active subscription period<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period<br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a Bike Race Plus subscription<br/>- Subscription prices and durations: weekly $7.99 | monthy $19.99 | yearly $99.99<br/><br/>Links to our Terms of Service and Privacy Policy can be found below<br/>Privacy Policy: https://www.topfreegames.com/games/bikeracepro/legal/privacy<br/>Terms of Use: https://www.topfreegames.com/games/bikeracepro/legal/tos<br/><br/>* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD", "metacritic": null, "released": "2012-07-17", "tba": false, "updated": "2019-07-29T19:36:56", "background_image": "https://media.rawg.io/media/screenshots/bce/bce8b16abbeb235317c789dc7a06fdde.jpg", "website": "https://www.topfreegames.com/games/bikeracepro", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Top Free Games"], "genres": ["Action", "Racing"], "publishers": ["Top Free Games"], "esrb_rating": null}