{"id": 74709, "slug": "big-win-soccer-world-football", "name": "Big Win Soccer: World Football", "name_original": "Big Win Soccer: World Football", "description": "The #1 soccer game in over 100 countries! <br/>Welcome to world class football fun with BIG WIN™ Soccer! No matter what you call the “beautiful game”, BIG WIN Soccer is the game for everyone. <br/><br/>Step into the role of team manager and coach your defenders, midfield players and strikers to be a top eleven team. You can make a real impact on your fantasy football club and the world soccer stage. <br/><br/>FRIENDS MODE <br/>Connect to Facebook and challenge your friends to action packed football matches <br/><br/>EVENTS MODE <br/>Players can compete in limited time cup events for a chance to win HUGE prizes <br/><br/>TROPHY MODE <br/>Choose the number of games you want to play, rally your players and battle it out in Pro and Amateur trophies to reach the top of the table <br/><br/>QUICK MATCH MODE <br/>Practice your fluid ball skills and test your team’s abilities in this fast, casual game mode <br/><br/>CREATE your own unique dream team, COMPETE against opponents from around the world, WATCH your team battle it out on the pitch, BOOST your player’s passing, shooting, dribbling and other skills and get ready for the ultimate BIG WIN! <br/><br/>HIGHLIGHTS <br/>* Full team and player customization allowing you to create your own fantasy team! <br/>* Flick through and open Bronze, Silver and Gold card packs to find new players and skill boosts to improve your team <br/>* Play match-changing Big Impact cards and watch them affect the outcome when they come to life on the field! <br/><br/>BIG IMPACT CARDS <br/>* Super Strike <br/>* Crunching Tackles <br/>* Great Ball <br/>* Free Kick Focus <br/>* Off The Woodwork <br/>* Penalty Power <br/>* and many more… <br/><br/>Other games in Hothead Games' BIG WIN Sports™ Series include:<br/><br/>BIG WIN Racing<br/>BIG WIN Baseball<br/>BIG WIN Basketball<br/>BIG WIN Football<br/>BIG WIN Hockey<br/><br/>Play your favorite sport with BIG WIN SPORTS! Go for the BIG WIN!<br/><br/>By downloading this app you are agreeing to be bound by the terms and conditions of Hothead's Terms of Use (www.hotheadgames.com/termsofuse) and are subject to Hothead's Privacy Policy (www.hotheadgames.com/privacy-policy).<br/><br/>", "metacritic": null, "released": "2012-02-25", "tba": false, "updated": "2019-07-29T21:02:37", "background_image": "https://media.rawg.io/media/screenshots/2c2/2c245a0701570fa05ae069f38b8f12d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hothead Games"], "genres": ["RPG", "Sports"], "publishers": ["Hothead Games"], "esrb_rating": null}