{"id": 747398, "slug": "the-ringing-of-psychic-bells", "name": "The Ringing of Psychic Bells", "name_original": "The Ringing of Psychic Bells", "description": "Ghosts are not real:\r\n<p><strong>An entry to the Brackys Game Jam. The theme was \"It is not real\", so to fit that theme, you play as a \"Psychic\" from the 1910s in this \"extra\" visual novel game. </strong></p>\n<p>Try to hold a fake seance for 3 characters with punny names, try not to get caught out and, oh yeah, try to make sure you have fun! It's small enough to try a couple of playthroughs and see how you do!</p>\n<p><strong>Please note</strong>, the Web Version is experimental, it has slightly worse audio and may not fully work. For a smoother game, try downloading!</p>\r\nResearch\r\n<p>As an expert \"Psychic\", Madame Renarde is well connected and does thorough research on all her clients. Here's some research about her clients tonight...<br/></p>\r\n\r\n    Research\n<p><strong>Mr Harold Hoodunit</strong> - An old stage magician, he was born Eric Vice, but changed his name to Harold Hoodunit when he was young, partly to sound more magical, but also to hide his past as a thief for his family. It was in prison he met his mentor, Jesiah Rann. He introduced Hoodunit to his now-wife, who has been his assistant in every show of his, even when he hit the big time. There are rumours of an affair he had with Sir Doily's deceased wife, but these have never been proven. </p><p><strong>Sir Arnold Copper Doily</strong> - The author of a famous detective series, Sir Doily is a massive spirit nut. He believes 100% that the other side exists, and his father, who hated him for his fame, and his wife, who he loved passionately, exist there and will bring him messages. He and Hoodunit are old friends and, even if they disagree on spirits, he is sure that Hoodunit would never betray him. </p><p><strong>Rae Porter</strong> - Not much is known about this Society Pages reporter. She had an easy, if not boring, childhood, with the only sour moment of her dog's death. She is also a massive royalty nut. Try to stay on her good side, if we get a good report, we could go world-wide! </p>\r\n\r\nControls:\r\n<p>Use the mouse to click on dialogue options and press the buttons under the table with your feet.</p>\n<p>Left button dims the lights, Right button makes a knocking noise, Middle Button makes a spooky ghost noise!</p>\r\nCredits:\r\n<p>Wall + Table Cloth materials taken from CC0 textures</p>\n<p>Character Models + Chair made taken from Kenney Game Assets and edited in Blender</p>\n<p>Dialogic (The Godot addon used to create the interactive story) created by Emilio Coppola</p>\n<p>Woman 1910 photo taken from Wikimedia - Artist and Model unknown</p>\n<p>Fancy Font - Black Chancery Regular Font by Doug Miles, </p>\n<p>Newspaper Font - Judges SC Font by JLH Fonts</p>\n<p>released to the Public Domain</p>\n<p>Audio taken from Sidearm Studios Ultimate SFX Pack</p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T11:35:50", "background_image": "https://media.rawg.io/media/screenshots/130/1309f4c0bd30141418669e2dd39a4e9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GreenClovers"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}