{"id": 747503, "slug": "illusions-brackeys-7-entry", "name": "Illusions (Brackeys-7 Entry)", "name_original": "Illusions (Brackeys-7 Entry)", "description": "<p>The pressures of game development are getting to you, and you've decided to face the problem by going inside the dungeon of your mind and eliminating the root of your troubles (which, of course, is a bunch of goofy little slime blobs and their goofy little slime turrets). Unfortunately, the pressure getting to you is making you see some things, like more goofy little slime men that aren't there. Attacking these will damage your mental health (which, in your mind, is just your health) so be careful where you point that sword of yours!<br/></p>\n<p>This game was made for Brackeys Game Jam 2022.1. The theme was \"It is not real.\" I think I could've made better gameplay out of it but this was fun to make.</p>\n<p>Do note that as this is my first game jam entry, there's only one level and this not the most polished game I've ever made. If you've been around this page since the last thing I posted, I probably didn't make it worthwhile to have waited since September of last year (or whenever I made Flutter 2) for a new game, so my bad.</p>\n<p><strong>INSTRUCTIONS:</strong></p>\n<p>WASD to move, point and click to attack. Avoid the illusions! If a slime is transparent, attacking it will damage it. They'll disappear once you defeat the rest of the enemies.</p>\n\n<p><strong>NOTES:</strong><br/></p>\n<p>This is my very first game jam entry. And, quite frankly, I think I should've picked a less-difficult game jam with an easier-to-use theme. The experience was healthy, but man am I unsatisfied with the result. But hey, what do I know?</p>\n\n<p>Anyway, regardless of what you think of my game, thanks for checking it out! It means a lot :D</p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T12:08:32", "background_image": "https://media.rawg.io/media/screenshots/c04/c04b40d84d2ae853a865ae5c65ff9dfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Valdriks the Jazzborn"], "genres": ["Action"], "publishers": [], "esrb_rating": null}