{"id": 74760, "slug": "galaxy-on-fire-manticore-rising", "name": "Galaxy on Fire - Manticore RISING", "name_original": "Galaxy on Fire - Manticore RISING", "description": "[Experience the official prologue to the next chapter of the GOF series with Galaxy on Fire - Manticore RISING.]<br/> <br/>Get in the mood for the next epic instalment of GOF on mobile with this high-energy space action game for Apple TV. Take over the role of hotheaded rookie pilot Hayley “Manticore” Snocom and rescue your friends and crew from death-dealing space pirates. Assemble a hard-hitting squad and fight off countless waves of enemies in epic environments – more than 200 square miles in size and full of amazing details! <br/><br/># # # STORY &amp; SURVIVAL - ARCADE ACTION AT ITS BEST # # #<br/>With different ships at your disposal, you will find yourself at the very center of the most intense dogfights ever – fighting “coop-style” with wingmen by your side. Live through three captivating chapters in “Story” mode or go after the global high-score in “Survival” mode. Pierce through dense asteroid fields! Dash by giant space stations! Destroy the evil pirate hordes that roam the fabled Neox Sector! <br/><br/># # # NEXT-GEN MOTION CONTROLS # # #<br/>Steer your ship like a pro with the new Siri Remote. Its motion and touch controls allow tight combat and spectacular maneuvers.<br/><br/># # # BE PART OF A REAL BLOCKBUSTER # # #<br/>A prime example of premium-quality gaming on next-gen Apple devices, Galaxy on Fire™ - Manticore RISING defines an all-new standard for Apple TV exclusives with an orchestral score, stunning visual effects, vast game worlds and high-end graphics powered by Deep Silver FISHLABS’ original ABYSS® Engine.<br/> <br/># # # TRUST THE MEDIA &amp; FANS # # #<br/>The international press is thrilled about Galaxy on Fire™ - Manticore RISING and calls it \"beautiful” (Pocket Gamer), ”impressive” (Computerbild) and “incredibly gorgeous\" (Business Insider). The fans are equally excited, saying that they “have been waiting for this for years” (Ayden W. on YouTube) and that “the trailer and screenshots are making me droo!” (Mark L. on Facebook).<br/> <br/># # # JOIN THE COMMUNITY # # #<br/>Get in touch with thousands of other Manticore Rising fans through our official website, forums and social media profiles! We’re looking forward to hear from you!<br/><br/>Official website: http://www.gofmanticore-rising.com  <br/>Official Facebook fan page: http://www.facebook.com/gof3manticore <br/>Official Instagram profile: http://www.instagram.com/gof3manticore<br/>Official Twitter profile: http://www.twitter.com/gof3manticore <br/>Official forums: https://forum.dsfishlabs.com/ <br/>User Area (exclusive content and goodies): http://users.dsfishlabs.com", "metacritic": null, "released": "2015-10-12", "tba": false, "updated": "2019-07-30T01:25:17", "background_image": null, "website": "http://www.gofmanticore-rising.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 6, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fishlabs Entertainment"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["FISHLABS"], "esrb_rating": null}