{"id": 747611, "slug": "slicing-4d-raytracer", "name": "Slicing 4D Raytracer", "name_original": "Slicing 4D Raytracer", "description": "Slicing 4D raytracer\r\n<p>A small 4D raytracer of the slicing kind — meaning that it shows you a small 3D slice of a 4D world. The gimmick of this raytracer is that it's entirely in first person. You can rotate on the WY plane so that you can turn the camera to look towards the fourth dimension.\r\n</p>\n<p>Concerning what you can do in it, you can sort of fly around and look at some hypercuboids and hyperspheres. There's also a little fenced area and a little house to find. The most interesting part is definitely rotating on the WY plane, so make sure to do that a lot.\r\n</p>\n<p>In technical terms, rotating on the WY plane more or less replaces the world's Y axis with the W axis in the visualization. When the WY rotation is above 180° the world is mirrored, so generally the interesting range of WY rotation is below 180°. <strong><em>Downloads can be found near the bottom of the page.</em></strong></p>\n\r\nExplanation\r\n<p>To understand what's going on a bit better, you should firstly understand that trying to draw a 4D space on a 2D computer screen is as difficult as turn a 3D room into a 1D drawing. On a 1D drawing, colors can only be different horizontally and not vertically — or the other way around, the important thing is that there is only one dimension. This means that you can show that objects are to the left or to the right of other objects, but you can't show that objects are above or below other objects, which doesn't make it very easy to show the whole room in the drawing. If you were to make a 1D drawing of a room, what you would probably end up doing is essentially drawing a flat slice of the room. This is essentially like taking a photograph of the room, and then cutting away almost the whole picture except a very thin horizontal sliver in the middle. You would be left with an (almost) 1D slice of the photo.\r\n</p>\n<p>\n</p>\n<p><em>Here's an example of that, but I stretched the 1D image vertically so you can actually see it slightly.</em>\n</p>\n<p>Imagine if a computer drew a such a 1D slice for you, fifty times a second, and then you would have to navigate the room with those computer drawings. A 1D slice doesn't show that much of the room, so this would certainly be very difficult. This raytracer is using a somewhat similar technique, but instead of turning a 3D room into a 1D drawing, we're turning a 4D room into a 2D drawing. Just like a 3D room is difficult to navigate with only 1D drawings, a 4D room is difficult to navigate with only 2D drawings.\r\n</p>\n<p>It's important to understand that you're only ever seeing a very thin slice of the 4D room. This thin slice of the room that you're seeing is actually 3D — your computer screen is a 2D surface with width and height, and the third dimension is depth, which is implied in the 2D picture you're seeing (humans are used to seeing 2D pictures of 3D spaces because that's how our eyes work). Because the program only shows you a 3D slice of the 4D world, there's always a fourth dimension that you're not seeing. Depending on your WY rotation, this fourth dimension you're not seeing is either W or Y.\r\n</p>\n<p>When you start the program, it looks just like any normal 3D scene, because you're only seeing the X, Y, and Z dimensions (for those less mathematical: those are the normal three dimensions that you can always see), and it's only when you rotate on the WY plane that it starts to look slightly special. It's mostly the way the world changes as you're rotating and moving on the 4th axis that's very special.\r\n</p>\n<p>Because you're only seeing three out of four dimensions in this raytracer at any given point, it doesn't necessarily give you a very convenient overview of the 4D world. The program contains a game (not the best game, but no less a game) where you have to find a white hypersphere, and if you try to find it a few times you will definitely realize that it can be quite challenging. In truth the hypersphere usually isn't really hidden. After the second time you find it, the hypersphere is always in mid-air somewhere. In a normal 3D scene you would see a white sphere immediately if it were hovering around in mid-air, but if you can only see a thin slice of the world at a time, then even something in mid-air can be difficult to find. A being with proper four-dimensional vision would be able to find the hypersphere in an instant, because he would be able to see the entirety of the scene.\r\n</p>\n<p>If you rotate and move in the fourth dimension a lot, it's possible to get a bit of a feeling for it, although it is definitely very difficult to understand. However, because of the technique this raytracer uses, you never get a very good overview of the 4D world no matter how much you get used to it.\r\n</p>\n<p>Why do the spheres grow and shrink? That's because you're looking at thin slices of a hypersphere. To explain further, let's first note for a moment that a circle is a round 2D shape, a sphere is a round 3D form and a hypersphere is a round 4D form. Just like how a paperthin slice of a sphere <em>(3D)</em> is a circle <em>(2D)</em>, a thin slice of a hypersphere <em>(4D)</em> is a sphere <em>(3D)</em>. If you would take a thin slice out of a sphere, the slice would be biggest if you cut through the middle and smaller if you cut near the sides. Similarly, the <em>(3D)</em> slice of a <em>(4D)</em> hypersphere is biggest when you cut through the center, and smaller when you cut near the sides. That's why the spheres you're seeing grow and shrink — you're seeing different slices of a hypersphere.\r\n</p>\r\nWhat you can find\r\n<p>Here's a list of all the forms in the world:\r\n</p>\n<ul><li>Two hard-to-miss green hypercuboids that look a bit like a grass field.\r\n</li><li>A blue hypersphere.\r\n</li><li>A big red hypersphere.\r\n</li><li>A red hypercuboid with four square faces (two small squares and two big squares).\r\n</li><li>A small white hypercuboid and a small red hypercuboid that are touching each other.\r\n</li><li>Two white hypercuboids that are meant to look a little bit like clouds.\r\n</li><li>Four hyperspheres at the corners of the grass: Grey, blue, red, and green.\r\n</li><li>A small black hypersphere that turns white when you get close. I made the other forms intentionally easy to find, but this one has arbitrary coordinates so it's a bit more challenging.\r\n</li><li>A little fence area consisting of six red hypercuboids\r\n</li><li>Last but not least, a tiny little house\r\n</li></ul>\n<p>If you're a very goal-oriented person, I also added a thing where you get points for touching a white hypersphere. Try finding it a couple of times. It becomes progressively more difficult.\r\n</p>\n<p>Lost? Press F3 to show your coordinates and remember that you're only seeing a small sliver of 4D space, so you may need to move on the W or the Y axis to find things back. The blue hypersphere can be seen when Y and W are 0, so you can use that to orient yourself. Also helpful to know is that you start at the coordinate (0, 0, 0, 0).\r\n</p>\r\nLinux installation\r\n<p>I didn't include the shared library dependencies with the program on Linux (I might do this some other time, though). Here's how to install the necessary packages on Ubuntu or an Ubuntu-like distribution:\r\n</p>\r\n\r\nsudo apt install libsdl2-2.0.0 libsdl2-ttf-2.0.0\r\n# Explanation for beginner Linux users:\r\n# \"sudo\"\r\n#   DO something as Super User (super user is equivalent to admin on Windows)\r\n# \"apt install\"\r\n#   Run APT (the package manager for Debian and Ubuntu)\r\n#   and tell it to install something.\r\n# \"libsdl2-2.0.0 libsdl2-ttf-2.0.0\"\r\n#   The two packages we need for this program. Here we're installing SDL2,\r\n#   which is a code library which videogames often use for things like creating\r\n#   a window and checking which buttons were pressed. \r\n<p>For other distributions, simply find and download the packages for SDL2 and SDL2-TTF.\r\n</p>\r\nTechnical issues\r\n<p>At the start, the program automatically adjusts its resolution to give you a decent refresh rate. If the viewport is too small, you can press F3 and then repeatedly F4 to change it.\r\n</p>\n<p>If you have any other technical issues, please post a comment.\r\n</p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T12:39:35", "background_image": "https://media.rawg.io/media/screenshots/803/803a334a91638dfbb7a26e110e49b919.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Zowie van Dillen"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}