{"id": 747615, "slug": "glories-of-the-hunt", "name": "Glories Of The Hunt", "name_original": "Glories Of The Hunt", "description": "<p>Six years ago, a Dragon laid waste to a simple farm, leaving behind a single survivor, Anabeth, forever scarred by the trauma.</p>\n<p>Today, she sets out with her sweetheart, Artemis,</p>\n<p>Their hunting companion Ace,</p>\n<p>And a scholar of Dragon lore, Arthur.</p>\n<p>On a quest for revenge, justice, and closure.</p>\n<p>Watching their journey is the God of Fury himself, pushing them to defy their destiny, guiding them to do the impossible, testing their resolve...And rewarding their glories and triumphs with his Favor...</p>\n<p>---</p>\n<p>Glories of the Hunt is the 3rd game in my Shackles of Varn setting.</p>\n<p>It's an isolated story that can be enjoyed completely on its own, but you'll also find plenty of small references to Illusions of Loyalty and Heresies of Discord.</p>\r\nGameplay:\r\n<p>Glories of the Hunt is a 3 to 5 hour RPG that spans 3 short dungeons, filled with \"on-map\" enemies that can be fought or evaded.</p>\n<p>The \"Aggression-based\" Combat system from Illusions of Loyalty returns, with two new twists to the formula, still loaded with challenging fights and high impact abilities that can shape the flow of battle.<br/></p>\n<p>The combat system uses an ATB (speed bar) combat system (that pauses when you take an action), as well as new \"Glory\" skills that allow you to dramatically shape the battle by passing turns to other characters, revive allies instantly, and much more.</p>\n<p>Enemies also drop potent accessories that can give you a substantial edge, like negating certain status effects, or providing temporary extra hit points.<br/></p>\n<p>There are 5 Difficulty Modes, covering your needs whether you are just here for the story, or whether you crave a difficult challenge.</p>\r\nCharacters\r\n<p><strong>Anabeth</strong></p>\n\n<p>Anabeth used to be a farmer's wife, and the last person you'd find doing anything seriously dangerous. Years after losing her family to Dragonfire, she's grown into a hardened warrior, walking the Path of the God of Fury.</p>\n<p>Still haunted by the trauma of that day, she has decided that she can never find closure until the Dragon that destroyed her family is dead.</p>\n<p><strong>Artemis</strong></p>\n\n<p>An expert Huntress and devoted follower of Fury, and also Anabeth's girlfriend. Artemis seems rather brusque and rough around the edges, particularly in a fight, but she harbors a softer side that Anabeth has helped cultivate over the years.</p>\n<p><strong>Arthur</strong></p>\n\n<p>A scholar and expert of Dragon Lore, from the far-off Desert of Kyln. Arthur is new to Fury's Path and is thus unused to the danger he'll soon find himself in. Despite his reservations, he remains committed to the mission purely to get his hands on the \"hoard\" he believes the Dragon is guarding.</p>\n<p><strong>Ace</strong></p>\n\n<p>Third in a line of exceptionally clever hunting dogs, Ace is both a lovable ally and a vicious combatant. When he's not mauling a threat to the party with tooth and claw, he enjoys naps, chasing insects and demanding belly scratches.</p><p>---<br/></p>\n<p>This game was made for the RPGmaker.net \"50 Days of Representation event\".</p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T12:40:45", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a76a8817143cb2d3bf16ba2b0466f95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aegix Drakan"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}