{"id": 747863, "slug": "cube-escape-paradox-2", "name": "cube-escape-paradox", "name_original": "cube-escape-paradox", "description": "<p>When the infamous detective Dale Vandermeer wakes up in an ominous room without any recollection of his past, he soon finds himself part of a bizarre game orchestrated by an old foe. Dale must solve increasingly challenging puzzles to escape the room and recover his memories. <br/> </p>\n<p>Cube Escape: Paradox Features: <br/> </p>\n<p>    A unique, never-before-seen, game/film crossover experience <br/>    The absorbing gameplay, atmosphere and wealth of puzzles fans would expect from the tenth Cube Escape game <br/>    A ton of connections and interactions with Paradox - A Rusty Lake Short Film <br/>    There will be two different chapters available (one for free and one premium) with multiple endings <br/>    Beautiful paintings handmade by Johan Scherft <br/>    Immersive and atmospheric soundtrack by Victor Butzelaar <br/>    Powerful voice-overs by Bob Rafferty and lead actor David Bowles <br/>    Supporting 14 different languages <br/> </p>\n<p>Why download Cube Escape: Paradox Chapter 2? <br/> </p>\n<p>You will wake up in the same room, but soon this new story will take some suprising turns. Chapter 2 contains numerous fresh and more challenging puzzles. You will encounter old friends and enemies. Go deeper into your mind, learn more about the meaning of \"Paradox\" and discover the fate of Dale Vandermeer. <br/>Paradox - A Rusty Lake Film <br/> </p>\n<p>Paradox: A Rusty Lake Film will be released together with the accompanying game: Cube Escape: Paradox. In this unique crossover you follow detective Dale Vandermeer who needs to escape the room in parallel universes. Both game and the short film will be connected in various ways: find secret symbols, unlock multiple endings and above all experience the same room in different ways.</p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T13:51:43", "background_image": "https://media.rawg.io/media/screenshots/33a/33a6eb400c4e12e2e8d24fa3757566ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jimitos"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}