{"id": 747851, "slug": "otohimes-probably-canon-pregnancy", "name": "Otohime's Probably-Canon Pregnancy", "name_original": "Otohime's Probably-Canon Pregnancy", "description": "<p><strong>WARNING: Contains hyperpregnancy expansion fetish material.<br/></strong></p>\n<p>Hello! Here's a mini-game based on a question that some of us have had watching One Piece: How is Otohime the mother of the gigantic Shirahoshi? Well, maybe she got this big. Anyway, big thanks to Himitsu for answering this question by making the original artwork, then granting me permission to make this with it! You can check out his art on Twitter or DeviantArt.</p>\n<p>In this game, you can watch Otohime's ponderous pregnancy as it progresses, by clicking the clock icon to advance it. Depending on whether you set hyper sized mode on the warning screen, the progress is marked either by the month, or by the week, lasting a tad longer than the typical time spans.</p>\n<p>Controls:<br/>On the warning screen, you can toggle hyper sizes (disabled is default) as well as kicking (enabled by default), and sounds; make sure to select the preferred settings, and click the orange arrow in the main game to reset and change them.<br/>R to reset progress<br/>Click the clock at the top left to advance the pregnancy by a month/week<br/>Click the belly to bounce it a bit<br/>The game ends when it says so.</p><p>There's still stuff I feel I should change, mainly with the early size progression, so updates are likely.<br/></p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T13:48:45", "background_image": "https://media.rawg.io/media/screenshots/f51/f51c702c3bb5606e98540f8629afdb9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blunder Jub"], "genres": [], "publishers": [], "esrb_rating": null}