{"id": 747907, "slug": "onas", "name": "ONAS", "name_original": "ONAS", "description": "<p>This game is a Five Nights At Freddy's  fan game called One Nights At Spoonal. If you know how FNAF works you'll be fine but if you don't know here's a link of what it is : https://en.wikipedia.org/wiki/Five_Nights_at_Freddy%27s . THIS IS A WARNING BECAUSE I DID NOT PUT ONE IN THE GAME THIS GAME HAS FLASHING IMAGES SO PEOPLE WHO ARE SENSITIVE DO NOT PLAY I REPEAT DO NOT PLAY. If you want to support our channel: https://www.youtube.com/channel/UCMDYDrA4L_nqFkiZMcdJxbw for a second ONAS game that include the following</p>\n<ul><li>More Characters</li><li>More Doors</li><li>MASK</li><li>More Creepy</li></ul>\n<p>Then comment that you like the game and boom out. If you don't like it and need me to add something I always have the project. SO ENJOY!</p>\n<br/><br/>\n<p>What the animatronics need to say to you.</p>\n\n\n\n<p>SPOONAL \"I'm the leader I make an evil laugh once you here this and see me with your flash light close the door.\"</p>\n\n\n<p>FORKY \"I make an evil laugh just like Spoonal but mine is slightly faster once you here this and see me with your flash light close the door.\"</p>\n\n\n<p>KNIFALIA \"I'm know for being a silent killer so if you don't see me check your door with your flashlight, just saying.\"</p>\n\n\n\n<p>PLATEL \"I really love track but my owner never let me sign up so if you here running footsteps close your door immediately because you cant see me at the door.\" </p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T14:06:56", "background_image": "https://media.rawg.io/media/screenshots/5bd/5bd09d16525b574a301409826c48e14b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BIGBAUK"], "genres": [], "publishers": [], "esrb_rating": null}