{"id": 747924, "slug": "friendship-effort-victory", "name": "Friendship Effort Victory", "name_original": "Friendship Effort Victory", "description": "HOT-BLOODED YOUTHS!\r\nTENSE MELODRAMA!\r\nSHONEN ACTION!\r\n<p>Join the fray in Friendship, Effort, Victory, a shonen battle manga tabletop roleplaying game. Inspired by works such as Bleach, One Piece, Naruto, My Hero Academia, and other battle manga, Friendship, Effort, Victory uses the acclaimed Powered By The Apocalypse Engine to deliver the flashy, dynamic battles and intense, climatic drama of those sensational works. \r\n</p>\n<ul><li>Choose from 10 classic archetypes to quickly and easily make your character. From the overly cheerful, friendmakers to the angsty, vengeful loners to the fiery, unpredictable rivals, your characters will feel like they would fit right into your favorite stories. \r\n</li><li>Friendship, Effort, Victory subtly guides players to the themes and key moments of classic battle manga by guiding conflict resolution with simple mechanics. \r\n</li><li>The dual health system keeps battles tense and emotional. Characters have the ability to buy off their physical damage by taking emotional damage in its place. Death only comes when a character chooses to accept its embrace. When that time comes, accepting death gives the character a burst of power and a second wind that ensures the hero goes out in a blaze of glory.\r\n</li><li>No one is ever left out of the fight. In a genre known for amazing one-on-one battles, players may worry they could be left out. The spectating mechanics allows non-combatants to offer support to any match, even if they aren’t present for the scene. At any time, non-combatant can introduce how their character is interpreting the fight, giving characters bonuses, buffs, and debuffs as makes sense. \r\n</li><li>The Arcs, General, and Villain systems keep the world dynamic and the threats serious. The Arcs system manages many different threats the world faces due to the Villains mechaniations. The General and Villain system ensures that Villains never fall easily and keep the Sagas from ending too soon. Through the plot armor the Villain system provides, Villains always feel like a major threat. By making the Generals key to removing that plot armor and making the Villains vulnerable, stories grow horizontally. Instead of a mad dash to the Villain, heroes focus on their own matchups, knowing that their victories against the Generals take the team closer to ultimate victory. \r\n</li></ul>\n<p><strong>Check out some of our other cooperatively design and profit shared RPGs!!</strong></p>\n<p><strong>  </strong></p>", "metacritic": null, "released": "2022-02-26", "tba": false, "updated": "2022-02-28T14:11:15", "background_image": "https://media.rawg.io/media/screenshots/fe9/fe93896c41d4a8903fff93626ab59a0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Far Horizons Co-op"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}