{"id": 7480, "slug": "super-crossfighter", "name": "Super Crossfighter", "name_original": "Super Crossfighter", "description": "To celebrate the announcement of Overload, a new game from Radiangames and the creators of Descent (playoverload.com): ALL RADIANGAMES TITLES ARE ON SALE!  <br/><br/>The award-winning Super Crossfighter (formerly Super Crossfire) is back with a vengeance!  Old school arcade shooting meets dazzling graphics and energetic music. <br/><br/>Blast alien invaders while warping between the top and bottom of the screen in this heart-pumping adventure from Radiangames. Unlock upgrades and acquire special power-ups as you obliterate wave after wave of enemies. <br/><br/>With a massive campaign, intense action, and eye-popping visuals, Super Crossfighter sets a new standard for arcade action.<br/><br/>Features:<br/>• High intensity action + stylish graphics and music<br/>• 150+ waves of alien-exterminating mayhem spread across 5 chapters<br/>• Survival mode and Dark chapters extend the life of the game even further<br/>• Upgrade your ship in 10 distinct areas using skill points<br/>• Collect Victory Points and unlock even more bonuses and upgrades<br/>• GameCenter Achievements and Leaderboards<br/>• Slider, tilt, or virtual button control options, along with iOS7 MFi controller support!<br/><br/>NOTE: You do not need to buy Super Crossfighter if you bought the original Super Crossfire.  Email support@radiangames.com with any questions.", "metacritic": null, "released": "2014-07-30", "tba": false, "updated": "2019-07-30T01:46:23", "background_image": "https://media.rawg.io/media/screenshots/f67/f67da0c7466b7121effc9e127622e7c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Radiangames"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Luke Schneider"], "esrb_rating": "Everyone 10+"}