{"id": 748090, "slug": "punk-in-the-trunk-enfr", "name": "Punk in the trunk [EN/FR]", "name_original": "Punk in the trunk [EN/FR]", "description": "<p><strong>Français↓↓<br/></strong></p>\n<p><strong>What awaits you?</strong><br/>This game will propose you a short randomly generated setting (Yes, it will be hardboiled and, yes, a trunk will be involved). It will be unique and will only appear once. After that you will have 5 minutes to write your story. Your writing can not be consulted by anyone unless you share it so feel free to create as you like.<br/></p>\n<p><strong>Content warning</strong><br/>Violence, blood, captivity, claustrophobia, strong language<br/></p>\n<p><strong>Credits</strong><br/>This game is licensed under CC BY-NC-SA.<br/>It is inspired by 5-min-e by Yenofven and the following jam.<br/>The images are provided under CC license by Flickr users through loremflickr.com.<br/>The theme of the game is inspired by a famous trope.</p>\n<p><strong>Pay for this game<br/></strong>Punk in the trunk is free to play. However consider supporting the nonprofit organisation of your choice and/or indie creators. Have a look at https://itch.io/b/1227/solo-but-not-alone-2 and http://twinery.org/donate.<br/>You can also help me by informing me of typos, bad english, non-inclusive wording... Very much appreciated!</p>\n<p>-------</p>\n<p><strong>Qu'est-ce qui vous attend ?</strong><br/>\r\nCe jeu vous proposera une courte situation générée aléatoirement (oui, ce sera du polar et, oui, un coffre de voiture sera impliqué). Elle sera unique et n'apparaîtra qu'une seule fois. Ensuite, vous aurez 5 minutes pour écrire votre histoire. Vos écrits ne pourront être consultés par personne à moins que vous ne les partagiez, alors sentez-vous libre de créer comme bon vous semble.</p>\n<p><strong>Avertissement sur le contenu</strong><br/>Violence, sang, captivité, claustrophobie, langage cru</p>\n<p><strong>Crédits</strong><br/>Un jeu par Gaét Hoth sous licence CC BY-NC-SA.<br/>Il est inspiré du jeu 5-min-e de Yenofven et de la jam qui a suivie.<br/>Les images sont fournies sous licence CC par les utilisateurs de Flickr par le biais de loremflickr.com.<br/>Le thème du jeu s'inspire d'un trope célèbre.<br/></p>\n<p><strong>Payer pour ce jeu</strong><br/>Punk in the trunk est un jeu gratuit. Cependant, considérez la possibilité de soutenir l'organisation à but non lucratif de votre choix et/ou les créateurs indépendants. Jetez un coup d'œil à https://itch.io/b/1227/solo-but-not-alone-2 et http://twinery.org/donate.<br/>Vous pouvez également m'aider en m'informant des fautes de frappe, des erreurs d'anglais ou de français, des formulations non inclusives... Merci beaucoup !</p>", "metacritic": null, "released": "2022-02-25", "tba": false, "updated": "2022-02-28T14:58:34", "background_image": "https://media.rawg.io/media/screenshots/db2/db216d2c7d4fdaf053c5ace1c10345e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gaét Hoth"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}