{"id": 748141, "slug": "emikos-pledge-itch", "name": "Emiko's Pledge (itch)", "name_original": "Emiko's Pledge (itch)", "description": "<p>Emiko's Pledge is a 2D Platform Action game based on the story of a Half Demon girl called Emiko, whose mission is to fulfill her dream of becoming the best warrior in the Demon world and also, to protect the Ettaze state from the enemies who infiltrated into the territory.</p>\n\n<p>There has been a long term conflict between the Ettaze and Trettaze states since the time when the Ettaze ruler decided to accept the fact that the human beings had the rights to co-exist with the demons in the Ettaze state where the majority of the state were the demons. This was the kind gesture of the ruler who gave the human beings the equal opportunities to join the universities and have a working career in the state even when some demons had a notion of looking down upon the humans. Under the leadership of Gabbon, the Ettaze ruler, the humans and demons learned to co-exist with each other which the ruler of Trettaze state could never accept. </p>\n<p>The ruler of the Trettaze state started to attack them in every possible way, banning imports and exports, barring tourists from the state to enter the territory etc. This had led to a war breaking out between the two states. However, Trettaze was the first one to officially declare the war against the Ettaze and threatened to kill all of the humans and the demons of the state. </p>\n<p>The ruler of the Ettaze had a hunch that a war between the states would break out anytime. He hired the best warriors of the state, the team of the three Demon Girls called Tri-Demon Girls who were said to be the strongest team of warriors in the state, in order to eliminate the intruders at all costs. Meanwhile, Emiko, the granddaughter of the Ettaze ruler, decided to step in at her own will and helped out the Tri-Demon girls team in her own way in order to protect the state against the intruders. Even as a half-demon she had a strong will and determination to achieve something big. </p>\n<p>Emiko with her own \"Devil Weapon\" begins her journey to defeat the enemies, and to become the best warrior in the state and abroad.</p>\n<p><strong>You play as Emiko and your mission is to fight against the enemies in order to protect the weak.</strong></p>\n\n<p><strong>Key Features:</strong><br/></p>\n<p>-15 Levels to play!</p>\n<p>-Different kinds of enemies including three-headed monster!</p>\n<p>-Lots of deadly traps and obstacles to overcome!</p>\n<p>-3 Firing modes which include regular, laser and Plasma modes.</p>\n<p>-Ability to freeze the enemies and double jump!</p>\n<p>-Story Driven!</p>\n<p>-Difficult situations and hard to master!<br/></p>", "metacritic": null, "released": "2022-02-25", "tba": false, "updated": "2022-02-28T15:15:07", "background_image": "https://media.rawg.io/media/screenshots/7cd/7cddc3c51033e839f7a88d7f535dceac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["AMAXANG GAMES"], "genres": ["Action", "Shooter", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}