{"id": 748293, "slug": "stay-with-me-alien-abduction-story-mobile", "name": "Stay with Me! Alien Abduction Story (Mobile)", "name_original": "Stay with Me! Alien Abduction Story (Mobile)", "description": "(Warning: this game is a pre-alpha demo of Stay With Me! for mobile phones, it may contain graphical, alphabetic or other errors, its controls are adapted to play on PC and MAC, the final game will be released sometime in 2022 for iOS and Android)\r\n\r\nMode: Single Player - First Person Game \r\nGenres: Psychological Horror\r\nLanguage: English\r\nControls: Keyboard and Mouse\r\nOther features: The demo includes 3 different endings\r\n\r\n\r\nRequirements:\r\n<ul><li><strong>RAM: 4GB </strong></li><li><strong> GPU: NVIDIA GeForce GTX 650 </strong></li><li><strong> Processor: Intel Core Duo</strong></li></ul>\n\n<p>Stay with me! is a narrative psychological horror game. Experience firsthand the damage fear can do to your mind by losing yourself alone in a series of unexplained events. As a player we embody Ana who travels on her way to her house, however she ends up getting lost on the way to experience a series of strange events that will trigger contact with aliens.</p>\n<p>In November 1999, a young woman named Ana got lost near a mountain forest. Her whereabouts are unknown to this day. The police searched for her for many years indicating that she may have suffered an accident, likewise other indications indicate that she was murdered and that her body was hidden in the forest. However, locals speculate that her disappearance may be related to strange lights seen in the forest and in the night sky.</p>\n<p>She assumes the role of Ana to discover her whereabouts.</p>\n<p>As a player, you will experience psychological terror directly from the first person perspective, you will slowly get lost in the forest, you can decide your path, but this will lead to different results. You will find obstacles that more than once will prevent you from continuing, examine the environments to be able to decide how to advance. </p>", "metacritic": null, "released": "2022-02-25", "tba": false, "updated": "2022-02-28T16:02:10", "background_image": "https://media.rawg.io/media/screenshots/57d/57d5e49012b2f55e6bc40df8896d66e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Dreams of Heaven - Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}