{"id": 748260, "slug": "rolly-ball-tedman", "name": "Rolly Ball (tedman)", "name_original": "Rolly Ball (tedman)", "description": "<p><em>Controls: A / D to rotate the camera left or right. W/S to move the ball forward or backwards. Note, the ball moves relative to the camera! </em><br/></p>\n<p>You can grab a potion that lets you knock off enemies more easily, but beware! Grabbing the potion makes you more attractive to the enemy. Double-edged sword.<br/></p>\n<p><strong>Purpose: Gameplay mechanics such as enemy waves and powerups</strong></p>\n<ul><li>Create enemies that chase the player</li><li> Create powerups for the player to help fight off enemies<ul><li>powerups don't last forever</li></ul></li><li>Create waves of increasing amount of enemies</li></ul>\n<p><strong>Methodology:</strong></p>\n<ul><li>Enemies chase the player by taking the player's <strong>current position and subtracting it from the current position of the enemy</strong>. This gives the direction (Vector3) for the enemy.</li><li>When the player touches the power up, a<strong> OnTriggerEnter </strong>method occurs. This includes an If Statement that sets a PowerUp Boolean to true, and start a<strong> Coroutine / IEnumerator </strong>method. This makes Unity wait for  7 seconds before reading the next line of code, which sets the boolean back to false, and deactivates the powerup  indicator.</li><li>A <strong>OnCollisionEnter</strong> method checks whether the player has collided with an enemy and the powerup boolean is true. If so, a force acts on enemy's rigidbody that pushes the enemy away from the player</li><li>Additional waves of enemies were added with a ForLoop. The<strong> ForLoop </strong>tells Unity to to spawn as many enemies as the previous wave. A parameter is passed through this ForLoop method that indicates how many enemies were in the previous wave, and to add an additional enemy.</li></ul>\n<p><strong>Additional functionality was added:</strong></p>\n<ul><li>The PowerUp indicator spins rapidly so the player associates with being more powerful.</li><li>Additionally, grabbing the PowerUp increases the speed of the enemy heading towards the player. The Enemy script checks for the PowerUp Boolean in the Player script. </li></ul>\n\n<p><strong>Notes for future:</strong></p>\n<p>A UI system should indicate the number of waves the player has lasted. The UI system should also indicate how many enemies are left remaining. It would also be nice to see a bar that indicates how much time the player has left on the Power Up. Particles effects and audio clips played upon collision of enemies / power ups would be a nice touch. <br/></p>", "metacritic": null, "released": "2022-02-25", "tba": false, "updated": "2022-02-28T15:54:36", "background_image": "https://media.rawg.io/media/screenshots/52f/52f9776c591e10037da34d1e9c5c7317.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tedman"], "genres": ["Action"], "publishers": [], "esrb_rating": null}