{"id": 748263, "slug": "indies-lies", "name": "Indies' Lies (itch)", "name_original": "Indies' Lies (itch)", "description": "<p>Indies' Lies is a roguelike deck-building game where you craft a deck, spark talents, discover runes, and assemble your team with partners' cards! Play unique stories for every character and explore a world caught in the clash of gods.<br/></p>\r\nFun for Beginners, Depth for the Experienced\r\n<p>With the hope to introduce fun of the deck building strategy to more players, we have adjusted and optimized traditional deck-building mechanics to create a smoother and more beginner-friendly gameplay. Meanwhile, more experienced players will find gameplay less restrictive yet challenging enough.</p>\r\nTake 9 Characters with Unique Traits on a Roguelike Journey\r\n<p>Indies’ Lies now has 9 playable characters from 3 classes: Wizards, Rangers and Mechanists, and each character comes with a unique set of cards and talents. It will be a different journey each time on the procedurally generated maps, where you pick different cards, learn different talents, encounter different events and enemies. Explore the possibilities and find your favorite strategy!<br/></p>\r\nA Partner System to Spice it Up\r\n<p>Indies’ Lies puts you in command of a team of 1 hero and up to 2 partners. There are over 10 partners, all with distinctive cards and strengths. You can match the hero deck with hundreds of partners' cards to try different tactics. Instead of acting as a mere tank, the partner brings on more room for flexible strategies and team tactics.<br/></p>\r\nCraft Your Talent Tree\r\n<p>A unique talent tree is procedurally generated for each run, and talents were designed to suit different classes and builds. There are over 200 talents in total, designed to meet the need for deck development at different stages and for different builds.<br/></p>\r\nExplore a Medieval Fantasy World\r\n<p>Step into Mekaa, a world caught in the clashes of Gods. By collecting clues for each character, you can unlock story mode and dive into their quests, whether it is chasing a lost love, fighting the Seven Nightmares, or finding the culprit behind Mekaa’s fall into this dark frenzy.</p>\n\n<p>Follow our latest news on:</p>", "metacritic": null, "released": "2021-09-23", "tba": false, "updated": "2022-11-03T17:27:34", "background_image": "https://media.rawg.io/media/screenshots/17b/17bb58e2b428bb2c25462dca411e7498.jpg", "website": "http://www.funcgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 2, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "PC"], "developers": ["ErabitCN", "方寸遊戲"], "genres": ["Strategy", "Card"], "publishers": ["Playbest Games"], "esrb_rating": "Teen"}