{"id": 748414, "slug": "aperture-desk-job", "name": "Aperture Desk Job", "name_original": "Aperture Desk Job", "description": "<p>Aperture Desk Job reimagines the been-there-done-that genre of walking simulators and puts them in the lightning-spanked, endorphin-gorged world of sitting still behind things.</p>\n<p>You play as an entry-level nobody on their first day at work — your heart full of hope and your legs full of dreams, eager to climb that corporate ladder. But life’s got other plans, and they all involve chairs.</p>\n<p>Designed as a free playable short for Valve’s new Steam Deck, Desk Job walks you through the handheld’s controls and features, while not being nearly as boring as that sounds.</p>\n<p>Not Portal 3!</p>\n<p>Lower your expectations: This is not a sequel to Portal. Now get ready to raise them slightly, because it is in the expanded universe of those games. Desk Job puts you squarely in the driver’s seat at Aperture Science. Then quickly removes the driving part and adds a desk in front of the seat.</p>\n<p>Steam Deck: A Desk For Your Hands</p>\n<p>Up until now, real life mostly involved sitting, and video games were the virtual fantasy world you could escape to. With the portable Steam Deck, we flipped that, freeing your body to run marathons and jump out of planes while your brain and hands simulate all the sitting you used to do.</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2024-03-20T18:11:20", "background_image": "https://media.rawg.io/media/games/acc/acc3de7aaa850ad998d49b15f8901e23.jpg", "website": "http://aperturedeskjob.com", "rating": 3.89, "rating_top": 4, "added_by_status": {"yet": 58, "owned": 2069, "beaten": 237, "toplay": 58, "dropped": 21, "playing": 5}, "playtime": 1, "achievements_count": 0, "ratings_count": 176, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 177, "platforms": ["PC", "Linux"], "developers": ["Valve Software"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Valve"], "esrb_rating": null}