{"id": 74856, "slug": "soccer-star-2018-top-leagues", "name": "Soccer Star 2018 Top Leagues", "name_original": "Soccer Star 2018 Top Leagues", "description": "Ever dreamed of being one of the greatest soccer players in the world? Do you aspire to join the biggest teams in the highest leagues? Want to be an international superstar and enjoy fame and renown?<br/>Experience all that and much more FOR FREE in Soccer Star 2019: Top Leagues!<br/><br/>From the creator of Soccer Star: World Legend, here comes the ultimate soccer experience! <br/>Start small and become a real soccer idol! Free and easy to play soccer game: you just need one finger to experience the many different sides of football!<br/><br/>Play in leagues from every country, and lead your team to the top of worldwide football! Enjoy the most important soccer competitions of the globe. How many seasons will it take you to win your first league? <br/>Change your club as much as you want and feel the rush of a new league. Negotiate your contract to get the most out of your career!<br/>Try different training modes to become the star of football you aim to be. Polish your free kicks, your strength, your penalties...<br/>Enjoy the social life of a superstar and look after your relationship with your fans, your coach and more! <br/>Experience luxury! You will love being sponsored by famous brands, wearing the best soccer kits and epic pairs of boots...<br/><br/>Your soccer career has just begun, and your time has come. Become a Soccer Star!<br/><br/><br/>VISIT US:<br/><br/>http://facebook.com/SoccerStar2016<br/>http://generagames.com", "metacritic": null, "released": "2017-06-08", "tba": false, "updated": "2019-10-22T14:24:59", "background_image": "https://media.rawg.io/media/screenshots/8ad/8adeb596cb26a2f90e133daa07f46029.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Genera Games"], "genres": ["Simulation", "Sports"], "publishers": ["Genera Games"], "esrb_rating": "Teen"}