{"id": 7485, "slug": "elite-dangerous", "name": "Elite Dangerous", "name_original": "Elite Dangerous", "description": "<p>One of the interesting facts about Elite Dangerous is its realistic scale representation of the Milky Way which is an open-world and the gameplay is itself open-ended. It is the first game in the series to feature MMO-kind of gameplay, where every players&#39; action affects the plot of the games universe. This is the fourth installment in the Elite video games series and it&#39;s the sequel to Frontier: First Encounters. This is one of those successful Kickstarter campaigns which launched in 2012. The pre-released version of Elite Dangerous was available since December 2013 and after one long year it was finally released as a full game on Microsoft Windows. In 2015 it was released on OS X and Xbox One and one year later  - on PlayStation 4. The game also supports VR devices including HTC Vive and Oculus Rift.<br />\nElite Dangerous is set in a year 3304. Its premise, as with the other games in the series, is to start as a small ship with a small amount of money and then with measures of trading, mining, bounty-hunting, piracy and assassination to go up your career. <br />\nThere are three different factions in the game including Empire of Achenar, the Galactic Federation, and the Alliance of Independent Systems and four player status levels (combat, CQC Championship, exploration and trading).</p>", "metacritic": 80, "released": "2015-04-02", "tba": false, "updated": "2024-04-18T14:12:48", "background_image": "https://media.rawg.io/media/games/b69/b69a67833630dd96d8eee9d2c8c27574.jpg", "website": "http://www.elitedangerous.com/", "rating": 3.95, "rating_top": 4, "added_by_status": {"yet": 213, "owned": 2854, "beaten": 73, "toplay": 90, "dropped": 294, "playing": 118}, "playtime": 14, "achievements_count": 177, "ratings_count": 460, "suggestions_count": 492, "game_series_count": 3, "reviews_count": 465, "platforms": ["Xbox One", "PC", "macOS", "PlayStation 4"], "developers": ["Frontier Developments"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Massively Multiplayer"], "publishers": ["Frontier Developments"], "esrb_rating": "Teen"}