{"id": 748606, "slug": "dickdown-duel", "name": "Dickdown Duel", "name_original": "Dickdown Duel", "description": "Dickdown Duel is an erotic card game RPG about a card game that got lewd cards modded into it.<br/>Acquire new cards, build decks, challenge cute girls and dominate them in Lewd card based duels.<br/>Strip them down, Equip lewd items on them, and make them squeal with pleasure as you acquire more and more lewd cards.<h3>Features</h3>4 Animated Live2d Girls to seduce and challenge in the Dickdown Duel Arena.<br/>47 cards to collect, including 9 with lewd effects.<br/>Cg photos to receive for various challenges completed - from selfies to cosplay photos to more lewd ones.<br/><br/><br/><br/><br/>The Cast<br/><br/><br/>Nat<br/>Age: 24<br/>Occupation: Artist and Game Maker<br/>The ringleader at the underground arena. Spends most of her days off enjoying raspberry flavoured slushies.<br/>======================<br/><br/><br/>Kate<br/>Age: 24<br/>Occupation: Streamer<br/>Despite her chosen occupation, Kate is very shy. She lives a fairly hermitted life, staying in her room most of the time gaming and chatting with friends online.<br/>Every now and then, Kate can be spotted outside ordering her favourite spicy ramen, She also sneakily watches the other girls in the arena get dicked down, but has yet to enter the ring herself.<br/>======================<br/><br/><br/>Taiga<br/>Age: 21<br/>Occupation: Barman<br/>Outgoing and cheerful, Taiga is the life of the party, she runs the bar in the VIP area under the arena, where Nat lets people she likes stay.<br/>======================<br/><br/><br/>Lucia<br/>Age: 23<br/>Occupation: Bouncer<br/>Lucia is a proud member of the demon race. She's in charge of ejecting anyone who breaks the peace at the arena. The rules are clear: no drugs or other illegal substances are permitted, and you will comply or be met with force! <br/>She tells people the reason she doesn't wear pants is because she cant find any to accomodate her fluffy tail... but Taiga thinks she just doesnt like wearing pants.", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T03:22:45", "background_image": "https://media.rawg.io/media/screenshots/f9f/f9ff26caf987d8b6bbf52ac10e74c069.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Azurezero"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Azurezero"], "esrb_rating": null}