{"id": 748677, "slug": "natalia", "name": "Natalia", "name_original": "Natalia", "description": "A remote island country, the Kingdom of Arias.<br/>\r\nNatalia, who lives there, lived a free-spirited life while running a shop for everything.<br/>\n<br/>\r\nOne day under Natalia, a strange work comes in.<br/>\r\nIt is to hire a maid exclusively for the second prince Creto from the common people.<br/>\r\nIt was caused by an event that caused a little noise in the town.<br/>\n<br/>\r\nThe client of the job strongly wanted to be hired by this maid, and Natalia himself<br/>\r\nHe asked me to do my best to be hired.<br/>\n<br/>\r\nNatalia receives the request with one reply in front of the exceptional reward.<br/>\r\nCan Natalia do this work involving the royal family properly?<br/>\n<br/>\r\nNatalia<br/>\n<br/>\r\nA girl who runs a shop in the town of Corona near the Royal Palace in the Kingdom of Arias.<br/>\r\nWith fun as our motto, we value our relationships with the people of the town.<br/>\r\nI love money, and if I have a lot of rewards, I can do dangerous work without hesitation.<br/>\r\nHe has a positive and cheerful personality and lives honestly with his feelings.<br/>\n<br/>\r\nCreto Carlton /capture character<br/>\n<br/>\r\nSecond Prince of the Kingdom of Arias.<br/>\r\nHe is living a free-spirited life because his excellent brother has succeeded to the throne.<br/>\r\nDo something out of the ordinary in a mood shop.<br/>\r\nTired of living in a boring royal palace, he has a keen interest in the nearest town of Corona.<br/>\r\nOnly Oswald and Elvira are set aside, and they are separated from the others.<br/>\r\nIt is isolated.<br/>\r\nOnly eccentricities are noticeable to people, and they are called metamorphosis princes in the streets.<br/>\n<br/>\r\nOswald Russells /capture character<br/>\n<br/>\r\nA servant of Creto, the second prince of the Kingdom of Arias.<br/>\r\nAs an escort, he is always by his side as Creto's sword.<br/>\r\nHe has had a relationship with Creto since he was a child, and his sword arm is the best in the country.<br/>\r\nIt is kept away from the surroundings, probably because of its quiet personality.<br/>\r\nIt is called Oz by the close Creto and Elvira.<br/>\n<br/>\r\nNiro /capture character<br/>\n<br/>\r\nA young man who lives with Natalia and runs everything together.<br/>\r\nHe has spent time with Natalia since he was a child and has a family-like relationship.<br/>\r\nI like Natalia, but the distance is too close to be noticed.<br/>\r\nIn addition, I think that it is not necessary to forcibly proceed with the relationship, and accept the current relationship obediently.<br/>\n<br/>\r\nElvira<br/>\n<br/>\r\nA servant of Creto, the second prince of the Kingdom of Arias.<br/>\r\nAs a maid, she has been taking care of Creto's personal belongings since she was a child.<br/>\r\nHe is like Creto's older sister, playing with Creto in his spare time.<br/>\r\nMaybe because he is close to Creto, he doesn't get along well with other maids.<br/>\r\nIt is called El by the close Creto and Oswald.<br/>\n<br/>\r\nThe player becomes the main character and chooses his own destiny.<br/>\r\nBring happiness to his beloved and many others.<br/>\r\nVisual novel.<br/>\n<br/>\r\nThis work includes elements of sexual activity and disagreeable sex.<br/>\r\nContains nudity or sexual content.<br/>\r\nThere are depictions of drugs and alcohol.<br/>\r\nContains explicit or fresh adult sexual content.<br/>\n<br/>\r\nFixed text box design to improve character recognition rate in OCR translation.", "metacritic": null, "released": "2022-03-02", "tba": false, "updated": "2022-03-04T04:11:32", "background_image": "https://media.rawg.io/media/screenshots/2a4/2a482d4d562e7900c026d62c24f892d0.jpg", "website": "http://magichouse.uh-oh.jp/12natalia_1.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagicHouse"], "genres": ["Adventure", "Indie"], "publishers": ["MagicHouse"], "esrb_rating": null}