{"id": 748623, "slug": "papertris", "name": "Papertris", "name_original": "Papertris", "description": "Papertris is an interesting and fun arcade puzzle game in which colored cubes dissolve in all 6 possible directions and you decide where to place your cubes.<br/>In addition, there are also power cubes and numerous possible combinations in a classic but modern and lovingly hand-painted game.<br/><br/><br/><br/><ul><li>The Challenge mode is tricky with various tasks where the player has to solve suitable tasks in order to get to the next level, which are more difficult at each level<br/></li><li>In the Endless mode, which gets faster and more difficult from level to level, you can score points as long as you can<br/></li><li>The 2 player VS mode demands tactical skill in which players can use numerous combos to send each other blocking cubes to block the opponent's options<br/></li><li>Combinations of the cubes in all 6 directions<br/></li><li>Atmospheric music<br/></li><li>Icon option for color blind people<br/></li><li>Dark mode<br/></li><li>Full Controller support</li></ul><br/><br/><br/>The game itself was designed with a lot of fun and inventiveness with my kids (4y &amp; 2y) and the majority of the game was hand-painted by them, which thus has a beautiful and playful charm.<br/>We really had a lot of fun creating and collecting ideas for the game and hope to inspire you as much as we do.<br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T03:33:26", "background_image": "https://media.rawg.io/media/screenshots/931/931f306379659329fe18b81b66070395.jpg", "website": "http://paper-games-gaming.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paper_Games"], "genres": ["Casual", "Indie"], "publishers": ["Paper_Games"], "esrb_rating": null}