{"id": 748625, "slug": "kanpeki", "name": "Kanpeki", "name_original": "Kanpeki", "description": "After learning that she had come to school with smudged makeup, perfectionist and Gyaru fashion aficionado Hoshi Morimoto, has a mental breakdown. She finds herself trapped within a nightmarish version of her rural hometown. Abandoned streets, portals to buildings in different dimensions, deranged teenagers affected by some strange  ‘Choking Game’, and a mysterious light in the distant forest that watches her every movement. Hoshi attempts to escape from the new twisted world she finds herself in. But the golden light emitting from the outskirts of the town, compels her to stay… <br/>\n<br/>\r\n• Fixed camera angles and a nostalgic artstyle.<br/>\r\n• Classic survival horror gameplay.<br/>\r\n• Explore abandoned high school grounds and otherworldly locations.<br/>\r\n• Fully voice acted characters and cutscenes.<br/>\r\n• Fight off twisted versions of the town’s residents while actively managing the charge on your taser. <br/>\r\n• Warp the world around you to explore new paths and discover secrets by holding your breath.<br/>\r\n• Look through the environment for unique items and any notes the town’s citizens left behind.<br/>\n<br/>\r\nThis game is intended for mature audiences and may not contain content suitable for all ages.<br/>\n<br/>\r\nDepictions of violence, mature themes, and self mutilation by asphyxiation may be present within the game.", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-04T03:34:40", "background_image": "https://media.rawg.io/media/screenshots/c55/c5551f8e2db88607433dd4214b95b723.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StreetLight Studios"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["StreetLight Studios"], "esrb_rating": null}