{"id": 748641, "slug": "eep-17-rail-railway-construction-and-train-simulat", "name": "EEP 17 Rail- / Railway Construction and Train Simulation Game", "name_original": "EEP 17 Rail- / Railway Construction and Train Simulation Game", "description": "<strong>EEP 17 eisenbahn.exe professional</strong><h3>The Leading Railway Construction and Control Simulation</h3><br/>With <strong>eisenbahn.exe professional - EEP</strong> you can create complex railway worlds from your PC or laptop. You modify the terrain, design mountains and valleys, equip your facility with real estate and set up a sophisticated traffic system. The various traffic lanes can then be populated with rail and road vehicles, which can be regulated with a sophisticated signalling system. Air and sea traffic is also represented. However, the focus is set on the railway world with steam, diesel and electric locomotives, as well as passenger and freight cars, all available in a wide selection. In addition to the high quality reproduction of the rolling stock, which aims to be faithful to the original, EEP offers a great depth of play with endless possibilities for building and operating a great network with complex scenarios.<h3>EEP EISENBAHN.EXE PROFESSIONAL 17 - NEW</h3><ul><li>Two complete train sets of the Alstom Coradia iLint, the first passenger train in the world to be powered by a hydrogen fuel cell for environmentally friendly zero-emission transport. (Edition 2020 – 2021) </li></ul><ul><li>Complete new design of the ICE4 train set BR412 with the multiple unit number 9005 as \"ICE 582\" </li></ul><ul><li>Lots of new models on the subject. of hydrogen mobility (as real estate or rolling stock) </li></ul><ul><li>Over 100 new models from various themes: animated SST (Single Slip Turnouts) and DST (Double Slip Turnouts); bridge cranes with movable load; train station \"Baden-Baden; various track construction and track maintenance machines, etc. </li></ul><ul><li>Improved editor functionalities in many areas: e.g. setting up models according to predefined rules; automatic docking of real estate and landscape elements to other models; simplified, automatic turnout construction and much more. </li></ul><ul><li>Configurable cross span assembly for up to 9 tracks </li></ul><ul><li>The 3D track (viaducts and bridges whose length and curvature can be adjusted)</li></ul><ul><li>30 new Lua functions </li></ul><ul><li>Improved sound features for cabin views</li></ul><ul><li>Signals can be edited in height and rotated around z-axis</li></ul><ul><li>Height is held when copying objects with \"Ctrl + C\".</li></ul><ul><li>Improved trax library </li></ul><h3>EEP EISENBAHN.EXE PROFESSIONAL 17 - FEATURES</h3><br/><ul><li>Complete railway simulation including all traffic roads</li></ul><ul><li>Extremely realistic all the way down to the smallest detail</li></ul><ul><li>Comfortable editing of the tracks in 2D and 3D</li></ul><ul><li>Immediate switch between editor and simulation</li></ul><ul><li>Steerable driver’s cabins</li></ul><ul><li>Cargo loading and animated people</li></ul><ul><li>Track control desks and routes</li></ul><ul><li>Lua scripting language with a large command set</li></ul><ul><li>Thousands of ready-to-use 3D models included</li></ul><ul><li>Can be extended with a myriad of models, installations and tools</li></ul><ul><li>Video tutorials and tutorial layouts for a quick start</li></ul>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T03:47:33", "background_image": "https://media.rawg.io/media/screenshots/9fe/9fe5665908371a22deaaa826de4a0a0c.jpg", "website": "https://eepshopping.de/eep17", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trend Redaktions- und Verlagsgesellschaft mbH"], "genres": ["Simulation"], "publishers": ["Trend Redaktions- und Verlagsgesellschaft mbH"], "esrb_rating": null}