{"id": 748635, "slug": "dungeon-raider-menace-below", "name": "Dungeon Raider: Menace Below", "name_original": "Dungeon Raider: Menace Below", "description": "Slay monsters, dodge trap in roguelike duneon crawler. What treasures await?<br/>\n<br/>\r\nFrom the makers of Twerk Hero, comes another critically acclaimed, second title to be nominated for Oscars and Galactic Supreme Awards by their creators, comes game so groundbreakingly shattering, it's impossible to pass it more than 10 times, straight to your home, city, country and WORLD!!!<br/>\n<br/>\r\nDungeon Raider is a hack 'n slash runner with RPG elements. You play as an adventurer lost in a dungeon with enemies and traps behind every corner. Explore a seemingly endless tunnel full of mystery and death, find mythical creatures, many foes, and few friends!<br/>\n<br/>\r\nLegends say that no one has ever left the dungeon, do you think you have what it takes? Use your fingers wisely and see how far you can make it.<br/>\n<br/>\r\nFeatures:<br/>\r\n-Endless runner: A dungeon so long it has no end, are we still in our world.<br/>\r\n-Hack 'n Slash: Hoards of monsters block the way, slay them before they slay you!<br/>\r\n-RPG: Take the role of an adventurer fighting to survive.<br/>\r\n-Roguelike:  Randomly generated dungeon and no refuge from death makes every run unique.<br/>\r\n-High score: Compete with other players to see who is the best at surviving.<br/>\n<br/>\r\nCan you Survive this action-heavy dungeon crawler, the hidden traps, and the hungry monsters?", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T03:42:05", "background_image": "https://media.rawg.io/media/screenshots/ca7/ca742d4f035fe5d5a2ee84db403b403c.jpg", "website": "https://www.ronigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roni Games"], "genres": ["Action", "Casual"], "publishers": ["Roni Games"], "esrb_rating": null}