{"id": 748676, "slug": "chaos-girl", "name": "Chaos Girl", "name_original": "Chaos Girl", "description": "[game introduction]<br/>\"CHAOS GIRL\" is a 2D platform jumping game. Players need to kill enemies to obtain the power of chaos to improve their power. During the game, you need to pass through layers of dangerous levels and kill BOSS in order to obtain the final victory. The game's attack methods are divided into ordinary attacks and skill attacks. Players can use the power of chaos to increase attack damage, and they can also use the power of chaos to learn new skills or improve the effect of skills.<br/><br/>During the game, players can obtain emblems by opening treasure chests or killing bosses. Different emblems have different attributes. Players can equip multiple emblems to improve themselves.<br/><br/>[Game background]<br/>The seal of the millennium was broken, and evil came back to the world. Only those who possess the power of Chaos can seal the evil again. You will experience an adventurous journey against evil. And you have someone who can fight with it, you will pass the threshold and usher in the dawn of a new world.<br/><br/>[Game Features]<br/>The protagonist of the game can perform a wind shock (charged shock) when he is in the air. The wind shock can move quickly. During the fast movement, the enemy will automatically attack and the damage will be increased.<br/>Wind Blast can pass through special terrain.<br/>Wind Impact can quickly attack the enemy and can also quickly leave the enemy's attack range. Using this very well can make your operation show off the sky.", "metacritic": null, "released": "2022-03-02", "tba": false, "updated": "2022-03-04T04:10:56", "background_image": "https://media.rawg.io/media/screenshots/fa9/fa9900f4964e51f2f20095a9b270031a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Small Game"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Small Game"], "esrb_rating": null}