{"id": 748742, "slug": "hellfull-the-last-hope", "name": "HellFull - The Last Hope", "name_original": "HellFull - The Last Hope", "description": "The perpetual peace that once was only found in cemeteries has been disturbed by spiritual forces that raised the dead! Now that there is no more room in hell, dead shall walk the earth relentlessly. The chosen ones are the last hope in restoring humanity from hell itself and from the risen undead. Zombies are not capable of love, for all they know is the love they have for flesh.<br/><br/>Life as we once knew it is passing away in front of our eyes in the unforeseen terror of something new that has emerged to take place in the presence of God. We have been thrown into a spiritual war, a world we will never fully understand. You are the future of humanity and now that the world has changed, it is up to you to find more survivors and escape the horrors that awaits each new chapter.<br/><br/><br/><strong>Weapons </strong><br/>There are a wide variety of weapons, ranging from assault rifles to pistols. More weapons will come with future updates!<br/><br/><strong>Characters</strong><br/>There are 6 different characters to choose from, making every experience unique! <br/><br/><strong>Zombies</strong><br/>These zombies are AI driven and is programmed to find the shortest possible route to kill you. They have eyes to see and ears to hear. Do not underestimate them!<br/><br/><strong>Chapters</strong><br/>There is a total of 1 complete chapter, 2 of which will be released in future updates. Each chapter consists of 4 - 5 unique levels that can be either maze like or open world maps that are explorable for the real adventurers!<br/><br/><strong>Vehicles</strong><br/>Having the ability to drive around in a vehicle is probably the best idea to have in a zombie apocalypse! Look for the Big Red Truck, then no zombie will be able to touch you! More vehicles will arrive with future updates!<br/><br/><br/><strong>HF-TLH</strong> was created using Unreal Engine 4, which is the best Game Engine out there. <br/><br/><br/>Niël is the sole developer of HF-TLH and it was a 5 year learning process to learn about game development, how UE4 works and publishing the first packaged game to Steam.", "metacritic": null, "released": "2022-03-03", "tba": false, "updated": "2022-03-04T04:55:53", "background_image": "https://media.rawg.io/media/screenshots/cc5/cc5694907c97ff031ce185951868ddd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Niël Slabbert"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Niël Slabbert"], "esrb_rating": null}