{"id": 74872, "slug": "qworde", "name": "Qworde", "name_original": "Qworde", "description": "Look no further! The best word and puzzle game is now here!<br/><br/>The aim of the game is simple: draw on your vocabulary and experiment with words to try and get through more than 500 puzzles available in Qworde. Use the letters and bonuses in each puzzle and try to score as many points as possible to win all of the stars and unlock every level. If you manage to use all of the letters in a level you score the QWORDE - the game's super bonus!<br/><br/>The possibilities are endless. There are no restrictions for the words you can use, nor time limit. You don't even need an Internet connection to play! <br/><br/>EVERY valid word is accepted. You're free to experiment to see if you can find solutions that will earn you a maximum number of points. It's a great way to have fun, improve your vocabulary, boost your brain power and develop your concentration for hours on end!<br/><br/>QWORDE:<br/>- A new concept that is both simple and intense<br/>- More than 500 different levels<br/>- A way to play on the subway, in your living room, in your garage, and even underwater!<br/>- An effective way to improve your vocabulary, and develop your brain power and concentration<br/>- Simple bonuses that add a tactical element (Double Word Score, Triple Word Score, Double Letter Score, Triple Letter Score)<br/>- Free hints every day!<br/><br/>NOTES<br/>- Qworde contains advertising and in-app purchases.", "metacritic": null, "released": "2018-07-28", "tba": false, "updated": "2019-10-22T14:24:59", "background_image": "https://media.rawg.io/media/screenshots/ca8/ca805b67110e3da3a3cfbe432d6a2f85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IsCool Entertainment"], "genres": ["Puzzle"], "publishers": ["IsCool Entertainment"], "esrb_rating": "Everyone 10+"}