{"id": 748738, "slug": "orbis-fugae", "name": "Orbis Fugae", "name_original": "Orbis Fugae", "description": "<strong>Anya's Story: </strong>Follow self-crowned Pirate <strong>Queen Anya Ophelia Morgan</strong> on a world-spanning quest to uncover the truth about her father, a secret treasure, an unknown cult and – most of all – herself. Her Adventure might lead her to places she didn't expect. <br/><br/><strong>Past meets present</strong>: <strong>Orbis Fugae </strong>combines traditional Point&amp;Click Gameplay with puzzle design straight out of popular Escape Room mechanics and ideas.  Many puzzles require the player to investigate the environment and documents, check rooms and scenes for irregularities, clues or hints, and think outside the box. <br/>Solutions might not be clear, but hidden within another puzzle. <br/><br/><strong>Escape!</strong> Escaping puzzle rooms is a big part of <strong>Orbis Fugae</strong>: In many cases, Anya will find herself in a locked room environment and will have to discover a way to escape. The correct way out might not always be clear - so be sure to check everything at your disposal.<br/><br/>Meet interesting people, find exciting treasures and learn to escape any trap you might encounter. <br/><br/><br/><br/><strong>Orbis Fugae</strong> is a story-driven Point&amp;Click Escape Adventure featuring hand-drawn art and animation, and an atmospheric soundtrack. <br/><br/>Everything in your environment may be part of a puzzle - so keep your eyes open and your brain running!<br/><br/><strong>Kitty wants pizza</strong> is a one-person indie project by Timo from Germany. This is a project I'm trying to do all by myself, without prior programming knowledge. All graphics and animations are hand-drawn, all music composed from scratch. <br/><br/>If you like the game, have questions, need help or just want to voice your opinion, feel free to contact me via Email or Social Media. <br/>And most of all, I hope you're looking forward to the game. I know I do!", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-04T04:53:10", "background_image": "https://media.rawg.io/media/screenshots/65b/65b85f835327da76ebcb4a4c1f249d94.jpg", "website": "https://orbisfugae.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["kitty wants pizza"], "genres": ["Adventure", "Indie"], "publishers": ["kitty wants pizza"], "esrb_rating": null}