{"id": 748708, "slug": "scp-abhorrent", "name": "SCP: Abhorrent", "name_original": "SCP: Abhorrent", "description": "SCP: Abhorrent is a survival horror game based on the stories of SCP-363 (Not Centipedes). <br/>\n<br/>\r\nQuick Back-Story:<br/>\r\nThe horrid SCP-363 escapes containment and scurries into the abandoned tunnels underneath the city. An Agent task force is quickly thrown together to deal with 363 before it can start killing and taking over the minds of the citizens. But, as all horror games start, it goes terribly wrong. SCP-363 ambushes the Agents in the darkness of the tunnels where it has already created more of itself by killing construction workers and grown to a MASSIVE size. SCP-363 kills all the Agents but one as he barely escapes just to be knocked unconscious by slamming into a wall at a full sprint. Two hours later Agent Sigma awakes, wishing he wouldn’t have been looking over his shoulder as SCP-363 murdered his fellow Agents. Sigma doesn’t remember how to get to the ladder they used to get into the tunnels. He must now find his way out to survive…<br/>\r\nGameplay:<br/>\r\nIn this game, you are Agent Sigma. You are equipped with a Pistol, Flame Thrower, Motion camera (detects the original SCP-363) and a Paint Spray gun. Use the Spray gun to help remember where you’ve been so you don’t get lost. Sneak around, run away from, or defeat your fellow agents as their minds have been taken over by SCP-363. Find the Ladder and live survive this horrible situation…<br/>\n<br/>\r\nFeatures:<br/>\r\nFully Procedurally Generated Map. The map/level is completely random each time you play. So, the experience has a uniqueness to it every time!<br/>\r\nAll original music and 3D models. <br/>\r\nWe believe this is the first Video Game based on SCP-363 ever!", "metacritic": null, "released": "2022-03-02", "tba": false, "updated": "2023-11-07T23:36:14", "background_image": "https://media.rawg.io/media/screenshots/ea4/ea4df05532cba5576b3b8d88f2389f06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Blackivy"], "genres": ["Action", "Indie"], "publishers": ["Blackivy"], "esrb_rating": null}