{"id": 748720, "slug": "dead-profit", "name": "Dead Profit", "name_original": "Dead Profit", "description": "The war between Hell and the Above needs a constant supply of weapons. Manage your resources and craft a variety of <strong>magical items</strong>.<br/><br/>Dead Profit is a time management game, although resources and item forging happens passively (idle), everything can be optimized for best performance. The more orders you fill means new requests, unlock new resources, forge items &amp; enchants. After finishing the main campaign, the orders are <strong>randomly generated</strong> so you must be prepared for any request.<h3>Production</h3>Filling orders require you to have the right resource, creating the right item each needing a different amount of resources and then enchanting/selling the item. To enchant an item you must time it right or it fails, enchanting multiple items in a row without it failing will <strong>stack a combo</strong> meaning the item sells for more.<h3>Orders</h3>Orders come in for items and you have a limited time to craft/enchant the requested amount, if you don't manage to fill the order in time the orders will come again to have a second shot. You wont be able to fill every order but once you know what its for you can prepare all the necessary items ready for when it comes back around. With the different combinations of resource/forge item/enchants it allows for hundreds of different orders.<br/>After the main orders have been completed they are randomly generated meaning there is a <strong>constant supply and new challenges</strong>.<h3>Artifacts</h3>Once your getting further into the game you will be able to craft an \"artifact\" these are powerful weapons once owned by high ranking members of Hell's army. They offer passive and active abilities such as buffs to harvesting/forging Speed, increased sell value ect...<br/>There is a bank to store resources, artifacts consume them to grow in power allowing for <strong>infinite scaling</strong> and optimization.<h3>Stats &amp; Collectables</h3>For all of you like us who enjoy seeing the numbers and efficiency of you production, stats can be viewed. Try and <strong>beat your highest</strong> combo or item sell value.", "metacritic": null, "released": "2022-03-03", "tba": false, "updated": "2022-03-04T04:40:52", "background_image": "https://media.rawg.io/media/screenshots/048/048a807babd825de550365216c330894.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 18, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Official LAMBs"], "genres": ["Casual"], "publishers": ["Official LAMBs"], "esrb_rating": null}