{"id": 748876, "slug": "the-reflection-beta-version", "name": "The Reflection Beta Version", "name_original": "The Reflection Beta Version", "description": "<p>The Reflection is a game that offers a brand new view on space and matter. The game explores the connection to an alternate dimension called The Reflection that contains all the matter of the world inverted. The portal to this dimension is characterized by a plane of water. From the surface, there appears to be simply a reflection of light, but submerging into the water reveals that this dimension is completely tangible, mirroring the world perfectly. Even moving objects and enemies are reflected, allowing players to interact with them from another angle (literally).</p>\n<p>Every aspect of the gameplay is carefully designed to utilize and expand the possibilities of The Reflection. Portals throughout the world enable the player to travel from a surface in The Reflection to its corresponding surface (now a ceiling) in the world. Some enemies exist in The Reflection and appear upside down in the world. Underwater sections of moving platforms disappear completely when reflected. The player also has a grappling ability that allows them to reach portals on the ceiling, which will become the floor once the player teleports to the corresponding surface in the world.\r\n</p>\n<p>Experience:\r\n</p>\n<p>• Mind-bending action situations: travel between the world and The Reflection to approach conflicts from a different angle, i.e. attack enemies from below by standing on the reflected ceiling above them (and below them in The Reflection)\r\n</p>\n<p>• Challenging precision gameplay: complex platforming sections and intense combat encounters, formulate plans to defeat enemies, utilize the reflected maps to gain an advantage over large groups of foes\r\n</p>\n<p>• Easy to read stylized graphics: experience a world with beautiful colors, accentuated with toon outlines and bright particle effects that pop for players to easily read and understand the level\r\n</p>\n<p>• Simple first-person shooter combat: defeat enemies in epic battles, repeatedly click or hold to fire, weapon ammo automatically regenerates (caps at 10)\r\n</p>\n<p>• 10 levels: progressively increasing in length and complexity (game length should last 2-5 hours depending on player skill)\r\n</p>\n<p>• Endless mode: unlocked when the 10 levels have been completed, large map with enemies swarming in from all sides</p>\n<p>Note: there may still be minor bugs but it is still playable.  Post any bugs you find in the comments below.  Please feel free to contact me here: Contact</p>", "metacritic": null, "released": "2022-02-23", "tba": false, "updated": "2022-03-04T05:30:49", "background_image": "https://media.rawg.io/media/screenshots/455/455ad499cb50c2888ceba4419dc2a1d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Batyaggy"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}