{"id": 748807, "slug": "minigame-madness-demo", "name": "Minigame Madness Demo", "name_original": "Minigame Madness Demo", "description": "<p><strong>Minigame Madness is a frantic multiplayer party game for up to 16 players online. Compete with friends or strangers in a massive, ever-growing collection of fun and unique free-for-all minigames to earn awesome outfits and gadgets!</strong></p>\n\r\nTHE MINIGAME MEGA-LIST!\r\n<p>Minigame Madness contains a massive, ever-growing collection of fun, frantic and unique free-for-all minigames! Knock your friends into the abyss in <em>Surreal Sumo</em>, try not to get hit by the bullets in <em>Blazing Bullets</em>, and don't be the one holding the bomb when it goes off in <em>Explosive Exchange</em>. New minigames of all types and genres will be added regularly, with over one-hundred minigames planned!<br/></p>\r\nPLAY HOW YOU WANT!\r\n<p>Play casual minigames back-to-back in <em>Arcade</em>, be the last man standing in <em>Royale</em>, or join forces with your friends in <em>Teams</em>! Designed to be played with up to 16 players online, but can also be played in single-player with bots. Experience the game with friends or strangers in first- or third-person mode, and play with mouse and keyboard, controller, or both!<br/></p>\r\nPERSONALIZE YOUR MUB!\r\n<p>Earn coins by playing minigames, and get gems by winning them! Coins can be spent to randomly unbox awesome faces, stylish clothes and wonderful hats; while gems can be used to design the exact outfit you like! Finish the daily challenge to spin the <em>Wheel of Madness</em>, where you have the chance to win amazing prizes like epic capes, cute pets and more!<br/></p>\r\nUNLOCK ALL ACHIEVEMENTS!\r\n<p>There are countless challenging achievements to unlock, awesome badges to earn and interesting statistics to showcase on your in-game customizable player profile. Compare your profile with those of your friends to figure out who's the very best, and check your ranking for each and every minigame on the global leaderboards daily!<br/><br/><br/></p>\r\nVOTE ON MINIGAMES!\r\n<p>Features an intelligent voting system that makes sure everyone is having fun! Before each round begins all players get the opportunity to vote for one of three selected minigames. The options are generated based on worldwide popularity of the minigames and the preferences of players in the server. The minigame with the most votes will be played!<br/></p>\r\nHOST PRIVATE SERVERS!\r\n<p>Official servers are hosted by us all around the world, but you can host a private server for you and your friends as well! In love with a particular minigame? Create a Gameroom, disable all other minigames, and play it non-stop. Almost everything can be customized!<br/></p>\r\nCONSTANTLY EVOLVING!\r\n<p>Minigame Madness is our forever-game, something we plan to continue expanding in content and features indefinitely. On top of that we have some crazy luxury ideas, including support for more than 16 players in-game, fully competitive single-player bots, exciting new modes like <em>Ranked</em> with skill-based matchmaking and even custom minigames with visual scripting!<br/><br/>The growing scope may change the price in the future, but once purchased you will always have access to the game. It’s great to have you along for the ride!</p>\n\r\nDOWNLOAD DEMO &amp; WISHLIST ON STEAM!", "metacritic": null, "released": "2022-03-03", "tba": false, "updated": "2022-03-04T05:14:01", "background_image": "https://media.rawg.io/media/screenshots/87f/87f539d16d456becd7e458a8fda78d75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chaotic Entertainment"], "genres": ["Action"], "publishers": [], "esrb_rating": null}