{"id": 748955, "slug": "holen", "name": "Holen", "name_original": "Holen", "description": "Trailer :<br/>\n<br/>Synopsis :\r\n<p>Au début du XXe siècle, Suzanne Juhel, l’une des dernières alchimistes françaises, est à la recherche de la mythique Pierre Philosophale. Vivant au Mont Saint-Michel avec sa sœur et étant la seule personne à avoir des connaissances scientifiques et occultes sur l’îlot rocheux, elle est amenée à travailler comme consultante pour la police locale. Réveillée par Jean Guivarch, chef de la police du Mont Saint-Michel, elle est conviée à résoudre une enquête des plus étranges : sur les côtes non loin du Mont, des corps mutilés d’animaux ont été retrouvés. Elle ne s’en doute pas encore, mais cette enquête pourrait bien changer la face des côtes normandes...</p>\n\r\nLes Personnages:\r\n<p>Suzanne Juhel<br/>Alchimiste de profession et malgré ses 27 ans, Suzanne reste une femme assez volatile, guillerette et simple. Bien qu’elle attise la sympathie, elle n’est pas prise au sérieux. Vue comme une marginale ou même une escroc, on dit souvent  d’elle qu’elle est “fausse docteur\" ou “scientifique autoproclamée\". Vivant avec sa sœur et à ses dépends, elle profite de la popularité de celle-ci pour avoir quelques clients en tant que médecin.</p><p>Jules Péron<br/>Le jeune Jules Péron fait partie de ces gens qui marquent aux premiers regards. Un peu rêveur, assez arrogant et surtout très maladroit, il occupe le poste de policier dans la ville de Pontorson. Cependant il passe la plupart de son temps au Mont, où il peut passer du temps avec les sœurs Juhel. Assez frivole, il passe plus de temps à regarder la mer qu'à faire son métier, ce qui lui vaut de nombreuses réprimandes de ses supérieurs.</p><p>Léna Juhel</p><p>Soeur de Suzanne et véritable star des environs, la belle Léna Juhel possède nombre d’admirateurs. Travaillant en tant que serveuse dans un café du Mont Saint-Michel, elle permet à sa sœur de vivre avec elle, au Mont. Être asthmatique et fumeuse n’aident pas sa santé déjà fragile. Derrière ces airs de femme accomplie, se cache une personne fragile qui fuit le conflit comme la peste.</p><p>Jean Guivarch</p><p>Né à Pontorson et y ayant vécu toute sa vie, Jean Guivarch prend son métier de Commissaire très au sérieux. C’est pour lui une véritable vocation que de maintenir l’ordre et le calme dans les rues de sa ville mais également dans celles du Mont Saint-Michel auquel il est très attaché. C’est un homme droit mais juste, au cœur tendre, qui prend toujours la défense de ceux qui en ont le plus besoin.</p><br/><br/>The Morrigan Studio :\r\n<p>Nous sommes un groupe d'étudiants en Game Design de l'école parisienne Sup de Création. <br/>Notre premier jeu \"Holen\" a été réalisé dans le cadre de nos études. <br/></p>\n<p>Ce groupe est composé de :<br/>Duncan Chauvin<br/>Elliot Fenech<br/>Yanna Fremaux<br/>Melvyn Keoxay<br/>Guillaume Gauduchon</p>\n\r\nOù nous trouver :\r\n\r\n<p>Instagram<br/></p>\n<p>Twiiter</p>\n<p>Youtube<br/></p>", "metacritic": null, "released": "2022-03-03", "tba": false, "updated": "2022-03-04T06:01:22", "background_image": "https://media.rawg.io/media/screenshots/358/3580c6e805da768855af25c0da95d321.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Morrigan Studio"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}