{"id": 74934, "slug": "racing-penguin-slide-and-fly", "name": "Racing Penguin: Slide and Fly!", "name_original": "Racing Penguin: Slide and Fly!", "description": "Racing Penguin is a physics based slide and fly game!<br/><br/>Slide down the mountains of Antarctica and flap your wings to fly. Go as fast as you can to escape from the polar bear.<br/><br/>6 addicting worlds, 48 racing levels. Clear levels to earn stars - the faster you go, the more stars you get. Use your stars to unlock new worlds!<br/><br/>Includes a multiplayer mode! You can challenge your friends!<br/><br/>Get it while it is FREE!<br/><br/><br/>Race Penguin VIP subscription<br/>- You can subscribe for unlimited multiplayer matches<br/>- Payment will be charged to iTunes Account at confirmation of purchase<br/>- Subscription automatically renews for the same price and duration period as the original \"one week\" package unless auto-renew is turned off at least 24-hours before the end of the current period<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package (weekly, monthly or yearly package)<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's iTunes Account Settings after purchase<br/>- No cancellation of the current subscription is allowed during active subscription period<br/>- You may cancel a subscription during its free trial period via the subscription setting through your iTunes account. This must be done 24 hours before the end of the subscription period to avoid being charged. Please visit http://support.apple.com/kb/ht4098 for more information<br/>- You may turn off the auto-renewal of your subscription via your iTunes Account Settings. However, you are not able to cancel the current subscription during its active period<br/>- Any unused portion of a free-trial period, will be forfeited when the user purchases a Race Penguin VIP subscription<br/>- Subscription price : Weekly $7.99<br/><br/>Links to our Terms of Service and Privacy Policy can be found below<br/>Privacy Policy: https://www.topfreegames.com/games/bikerace/legal/privacy<br/>Terms of Use: https://www.topfreegames.com/games/bikerace/legal/tos<br/><br/>* Prices are equal to the value that \"Apple's App Store Pricing Matrix\" determines as the equivalent of the subscription price in $ USD", "metacritic": null, "released": "2011-06-16", "tba": false, "updated": "2019-07-29T19:34:34", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cfcb101bdc5ca0c6f44a756ba1bd0b0.jpg", "website": "https://www.topfreegames.com/games/racingpenguin", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Top Free Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Top Free Games"], "esrb_rating": null}