{"id": 74940, "slug": "puzzlebox-puzzles-collection", "name": "PuzzleBox - Puzzles Collection", "name_original": "PuzzleBox - Puzzles Collection", "description": "Fond of classic puzzles but tired of so many separate single puzzle games? Puzzle Box is a mystery box. It is a collection of addictive logic puzzles, including Flow, Tangram, Escape, One Stroke, Blocks, Plumber, Fill, Rolling Ball, Sudoku, Weave a Line, Huedoku and Number Link. More free games are on their way to your puzzle kingdom!<br/>If you are a fan of classic logic puzzles, Puzzle Box will be the best one stroke. Come and challenge the puzzle flow free, gain the jigsaw pieces and build your kingdom.<br/><br/>Currently these logic puzzles have been collected in Puzzle Box. We promise, one line one stroke.<br/>※ Flow ※<br/>Connect dots with same color to create a Flow at free time. When you draw one line, please make sure not to weave the line into another and all spaces on the board be filled. <br/><br/>※ Tangram ※<br/>Move the colored tangrams to fill up the board, a classic dissection Chinese puzzle. Tangram is a jigsaw. The goal is filling the entire board by dragging the geometric shapes. Tangram is a great reasoning puzzle that trains your spatial intelligence.<br/><br/>※ Escape ※<br/>Escape is a famous game called Chinese Sliding-Block. Move the yellow block to find the exit and escape from the room. This game burns brain and tests your observation skills.<br/><br/>※ One Stroke ※<br/>One Stroke, has another name one line one stroke. In One Stroke, you merely need to draw one line. One single line to link all points and form a nice pattern. <br/><br/>※ Blocks ※<br/>Blocks is similar with Tangram. Different shapes of blocks in jigsaw box. Drag the block, move it onto the board and match the right place. <br/><br/>※ Plumber ※<br/>Plumber also called Pipes. Simply turn the different pipe pieces by touching them and connect all of them to make the flows work free (that's the work of a plumber!) <br/><br/>※ Fill ※<br/>The rule of Fill is extremely simple. Just fill in all blocks by using one line. Therefore, choosing which block to get started is pretty important. <br/><br/>※ Rolling Ball ※<br/>Rolling ball is a path guiding game that you need to slide the blocks to create a channel which makes the ball move from the start point to the end. <br/><br/>※ Sudoku ※<br/>Classic Sudoku for beginners and advanced players. Whether you’d like to relax or keep your mind active, pass time in a pleasant way!<br/><br/>※ Weave a Line ※<br/>Drag any line to a point and divide it into two new lines. Weave the lines and drag them to shape certain patterns. <br/><br/>※ Huedoku ※<br/>Huedoku is a hue blend sudoku, which challenges your ability to distinguish and arrange colors. If you like both hue and sudoku, it’s always an option!<br/><br/>※ Number Link ※<br/>Number Link is a classic free Japanese puzzle also known as Lines or Arukone. Connect the pairs of numbers without leaving any empty square on the board. <br/><br/>※ More puzzles are coming soon ※<br/>Thousands of new levels are under designing and more logic puzzles will be added in. Try your best to build your own puzzle kingdom!<br/><br/><br/>Why Puzzle Box – Classic Puzzles All in One?<br/>&gt;&gt;&gt;One-Stop Puzzle Games<br/>Tired of searching? Too many downloads? Upgrade all the time? Out of storage? Dozens of games need to handle? Now you have the solution: Puzzle Box! Get all classic puzzles in a single download! <br/><br/>&gt;&gt;&gt;Over 10 mini casual games and 3000+ fun levels<br/>Over 10 logic puzzles and 3000 levels are collected. 5 difficulty levels for your challenge. Don’t underestimated these brain teasers!<br/><br/>&gt;&gt;&gt;Simple but exquisite UI<br/>Minimalism graphics style is perfectly inherited by classical puzzles, and all<br/>the details have been optimized.<br/><br/><br/>Any suggestion please email to: pb_support@tapskygames.com <br/>Like us on Facebook to stay Up-to-Date! https://www.facebook.com/Puzzle-Box-200045577392543/", "metacritic": null, "released": "2018-05-03", "tba": false, "updated": "2019-10-22T14:25:00", "background_image": "https://media.rawg.io/media/screenshots/e15/e159dc26f789617ba7d7428a0f439beb_zcRerCC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Qingquan Hou"], "genres": ["Puzzle"], "publishers": ["Qingquan Hou"], "esrb_rating": "Everyone 10+"}