{"id": 74942, "slug": "guild-of-heroes-fantasy-rpg", "name": "Guild of Heroes: Fantasy RPG", "name_original": "Guild of Heroes: Fantasy RPG", "description": "<p>Heed the call of the magicians guild - conjurers, witches, archers and templars are needed! Monsters and dragons roam the realm, and your friends have already picked up the gauntlet, bow and arrow as well as sorcerer hats to raid dungeons, gain fame, and fight warlocks in the arena against other guilds!<br />\nGuild of Heroes delivers everything the classic fantasy has to offer, with devious dwarves and ancient elves, nasty orc shamans and troll sorcery, epic action and dark caves, quests and raids as befits the best medieval style RPG in the lineage of tabletop games.<br />\nHowever, the epic journey through the huge, colorful game world is not only fairy tales of mystic dungeons and dragons, but also battle against mages in the arena, controlled by other players!<br />\nIn a nutshell:<br />\n◆ Action-packed fantasy RPG in best game graphics<br />\n◆ Equip character classes such as mage, hunter and warrior, interchangeable at any time<br />\n◆ PVP against other teams in arena guild wars<br />\n◆ Craft medieval weapons and armor with hundreds of combinations<br />\n◆ Thousands of different monsters from diabolic exorcists to ... oh, discover for yourself!<br />\nNow, enough of the heroic ballads; grab your wand, sword and shield, and into the best, free fantasy RPG you&#39;ll ever experience!<br />\nOh, do not forget: Follow the Guild of Heroes Community on Facebook - Events, Fan Art, Guild Friends and Contests are waiting to be explored!<br />\nhttps://www.facebook.com/goheroesgame/</p>", "metacritic": null, "released": "2016-02-05", "tba": false, "updated": "2023-04-29T14:28:27", "background_image": "https://media.rawg.io/media/screenshots/bc4/bc40b90bc471d3d533372844bb7da6d2_EAO6D8e.jpg", "website": "http://gohero.es/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 506, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["BIT.GAMES PBL"], "genres": ["Action", "RPG"], "publishers": ["PBL BITDOTGAMES PUBLISHING"], "esrb_rating": null}