{"id": 74955, "slug": "summoners-greed-idle-rpg-td", "name": "Summoner's Greed: Idle RPG TD", "name_original": "Summoner's Greed: Idle RPG TD", "description": "The great and powerful summoner has broken into the king’s castle and stolen the royal<br/>treasure! You take the loot back to your lair, but the king has sounded the alarm and his endless<br/>army of heroes is on the way to steal it back! It’s time to ready your defences! <br/><br/>In this idle TD game, you have to strategically place your towers and cast powerful spells to<br/>defend against endless waves of the kingdom’s mightiest heroes. Defend your stolen loot against<br/>a variety of do-gooding heroes like the lowly peasant, axe-wielding lumberjack, ice mage and the<br/>elite king’s knight – you don’t want to mess with him!<br/><br/>SUMMON MONSTERS &amp; MINIONS TO FIGHT THE KING’S ARMY!<br/>Earn magic orbs for defeating waves of armies - use them to power the summoner’s portal to call<br/>forth a variety of monsters, creeps and minions to aid your defense. Recruit the common slimes,<br/>slimey and grimey, the rare and absurdly cute hellhound mocha, or Teddy – the epic teddy bear<br/>with superhuman strength. With dozens of creatures to call to your defense, do you have what it<br/>takes to defend against the heroes of the kingdom?<br/><br/>CAST POWERFUL SPELLS. OBLITERATE THOSE WHO DARE TO ATTACK YOU<br/>Is the king stupid or has he forgotten you can shoot fireballs from your hands? In addition to your<br/>misfit army of monsters, you can cast powerful spells to bring death to your enemies. Use<br/>fireballs, lightning, ice and more to power up your own monsters, rebuild defences and defend<br/>your lair against the king’s army. <br/><br/>-- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --<br/>SUMMONER’S GREED – HIGHLIGHTS<br/>-- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --<br/>• Dozens of monsters and towers to summon<br/>• Defend against endless waves of heroes and bosses<br/>• Each monster has their own unique abilities and secondary powers<br/>• Upgrade your towers to increase their effectiveness<br/>• Collect common, rare, epic and legendary monsters<br/>• Defeat a variety of enemy heroes, each with their own unique skills<br/>• Strategically place your towers to cause maximum damage<br/>• Use &amp; upgrade spells to destroy, rebuild defences and buff your minions <br/>• Original graphics &amp; unique gameplay for a totally new kind of TD experience<br/><br/>SUMMON. DEFEND. DESTROY. DOWNLOAD SUMMONER’S GREED TODAY!", "metacritic": null, "released": "2017-08-14", "tba": false, "updated": "2019-10-22T14:37:53", "background_image": "https://media.rawg.io/media/screenshots/fa8/fa8e9e980332e7631cdc61042a56ba5e.jpg", "website": "https://www.facebook.com/summonersgreed/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PIXIO"], "genres": ["RPG", "Strategy"], "publishers": ["PIXIO"], "esrb_rating": "Everyone 10+"}