{"id": 749696, "slug": "arole", "name": "Arole", "name_original": "Arole", "description": "<p><strong>Commande clavier navigateur :<br/></strong><strong>   -Z,Q,S,D :</strong> Touches diréctionnelle<br/><strong>   -A :</strong> Bouton A<br/><strong>   -E: </strong>Bouton B<br/><strong>   -Shift Gauche:</strong> Bouton select<br/><strong>   -Entré:</strong> Bouton Start</p><p><strong>ATTENTION, LA VERSION NAVIGATEUR NE PREND PAS EN CHARGE LES SAUVEGARDES</strong></p><p>--------------------------------------------------------------</p>\n<p>Dans le monde d’Arole, la nature et ses habitants vivent paisiblement dans une paix et une harmonie entretenues par 4 déesses élémentaires.</p>\n<p>Mais un terrible jour, Malmahat, déesse de l’ombre bannie de ce monde par les déesses élémentaires 700 ans plus tôt, réussit à revenir sur Arole et neutralise les déesses en les plongeant dans les terribles cauchemars de leur passé.</p>\n<p>Maintenant sans défense, le monde d’Arole se voit envahir des Sbires de Malmahat. Mais les fées, ancien peuple d’Arole sort lui aussi de l’ombre, avec un dernier Atout en poche, une jeune habitante de l'île de la terre du nom de Samiel, dont les origines mystérieuses pourrait être la clé de la victoire contre Malmahat. </p>\n<p>Au fil de son aventure, Samiel découvrira le monde d’Arole, aquierera de nouvelles compétences et en apprendra plus sur les mystéres de ses origines. Son objectif ? réunir les pierres élémentaires dans le but fou de sortir les déesses de leur cauchemard et sauvé Arole du chaos causé par Malmahat.</p>\n<p>Samiel sera t’elle a la hauteur de sa mission?<br/><br/></p><p>Découvrez le monde d'Arole. Obtenez de nouvelles compérences, apprenez en plus sur vos mystérieuse Origines.<br/>Votre Objectif? Réunir les pierres élémentaires dans le but de sortir les déesses de leur cauchemard et sauvé le monde d'Arole du chaos causé par Malmahat! </p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T09:11:12", "background_image": "https://media.rawg.io/media/screenshots/602/602558eab67c042a0e3b713552a97e98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SamielArole"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}