{"id": 749601, "slug": "origami-lovers", "name": "Origami Lovers", "name_original": "Origami Lovers", "description": "Origami Lovers is about finding your origami friend after stranding on an island. On the way there, you will need to explore and traverse the island that is ahead of you. You will have to find new origami figurines, that you can shapeshift into and use their abilities in the level. While linear gameplay lasts about <strong>30 minutes</strong>, embark on a sweet and short journey to rescue your lost friend. Different playstyles like speedrunning or collecting crowns provide more playtime.<br/><br/><br/><br/><ul><li><strong>Bite-Sized Brilliance: </strong> Dive into a 20-30 minute origami adventure, perfect for quick escapes or repeated plays. <br/></li><li><strong>Origami Odyssey:</strong> Transform into unique paper shapes to unlock special abilities, unveil secret paths and find hidden crowns.<br/></li><li><strong>Crafted World:</strong> Immerse in a stunning 3D platformer landscape inspired by paper, origami, and cardboard artistry.<br/></li><li><strong>Speedrunner's Delight:</strong> Challenge yourself in \"Hardcore\"-mode, race against time, and climb the leaderboards.</li></ul><br/><br/><br/><br/><br/><strong>The Human</strong><br/>Paperthin and versatile, <strong>the Human</strong> can traverse obstacles with ease and adapt to any challenge that arises. Unleash your inner explorer, strategist, and adventurer as you embody the most adaptable form in the game.<br/><br/><strong>The Crane</strong><br/>Elegance takes flight with <strong>the Crane</strong>. Glide through carboard landscapes with this shape, effortlessly surfing the winds. As the Crane, you'll master the art of navigation, mapping your own path through the skies, and discovering hidden secrets that await above. <br/><br/><strong>The G.O.A.T.</strong><br/>Unleash chaos and power with <strong>the Goat</strong>, a shape that's all about raw, unbridled energy. As the Goat, you'll thunder through obstacles with unstoppable force, leaving destruction in your wake. Smash through barriers, break down walls, and blaze your own trail of mayhem.", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2023-10-23T03:18:38", "background_image": "https://media.rawg.io/media/screenshots/04d/04da9dc56523eba79cbe25cc394ddcd3.jpg", "website": "https://loneflowergames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LoneFlower", "Lone Flower Games"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Lone Flower Games"], "esrb_rating": null}