{"id": 749673, "slug": "super-cave-runner-dx", "name": "Super Cave Runner DX", "name_original": "Super Cave Runner DX", "description": "<p>Super Cave Runner DX is based from a game developed at the 2022 Global Game Jam by Graeme White and Timothy Drew.\r\n  </p>\n<p>The theme from the game jam was “Duality”. Inspired by the game Canabalt, we designed an endless runner game set in a cave filled with various hazards. One of these hazards would be a wall or barrier that would be one of two colours. To break through these barriers, the player would have to match the colour of the barrier.</p>\n<p>After 48 hours, we had a prototype where an animated character would automatically start running, ground would generate at different heights and at different distances from each other, and the player could control the jump. </p>\n<p>The prototype was filled with bugs and many of the planned mechanics were not implemented. I decided to continue working on this as a personal project and challenge to complete this in one month.</p>\r\nCredits\r\n<p>Design, programming, sprites, announcer voices - Graeme White\r\n  </p>\n<p>Music - Timothy Drew.</p>\n<p>Special thanks to Lewis Innes and Robert O'Brien for testing and feedback.</p>\r\nTools and Assets\r\n<p>Game developed with the Unity engine (version 2021.2) and the C# programming language.\r\n  </p>\n<p>Sprite assets created with Aseprite.\r\n  </p>\n<p>Announcer voices recorded with Audacity.\r\n  </p>\n<p>“Press Start 2P” font designed by “CodeMan38”. Available from Google Fonts.</p>\n<p>Sound effects by Taira Komorio. Available from \"Let's Play with Free Sound Effects\".</p>\n<p>Additional sound effects by InspectorJ, Jofae, se2001, and TheSoundcatcher. Available from freesound.org.</p>\n<p>“Button Pressed” sound effect created by David McKee (ViRiX) and available from Open Game Art.</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T09:06:23", "background_image": "https://media.rawg.io/media/screenshots/4dd/4ddc1dec2aa7f60d940e24cadee9c227.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["gw0001"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}