{"id": 749652, "slug": "quirk-mobile", "name": "Quirk Mobile", "name_original": "Quirk Mobile", "description": "<p>This is a game of 'Go Fish' with a twist. So if you love the traditional card game, you will love Quirk!<br/><br/>In Quirk!, you play hands of characters; you'll be collecting Monkeys, Dogs, Robots, Pirates and much much more! Collecting the most sets makes you the winner!<br/><br/>But that's not all, you also get special action cards, STEAL, BLOCK and STOP cards, allowing you to change the odds of the game and bank more Quirks by the end of it.<br/><br/>In each deck available, there are 13 Quirks to collect, collect as many as you can each game and fill up your sticker book! Once you've completed it, you can make all your characters BRONZE, SILVER or GOLD, if you keep playing and collecting them.<br/><br/>OR you can explore the rest of the Quirk! world and play the new characters in each deck, within the in-app purchases.<br/><br/>This game is 100% family friendly and children absolutely love it! It's super easy to pick up and play and includes an interactive tutorial for first time players.<br/><br/>You play as a colourful Mischief Monster of your choice, against THREE other Mischief computer players vying for first place, this single player aspect makes the game perfect for offline play. No wifi needed after downloading, so you can play on the go, practically anywhere.<br/><br/>What you get:<br/>- Single player mode only.<br/>- Play offline, no wifi needed.<br/>- Children and family-friendly.<br/>- Play the first deck for free.<br/>- Collect stickers, then make your Quirks bronze, silver and gold.<br/>- Includes in-app purchases for new decks, Castle deck, Night deck and Beach deck.<br/>- Skippable ads on the free version.<br/>- Calming soundtracks for chilled out play.<br/>- Keeps your mind sharp by memorizing where cards are.<br/>- Simple to use, easy to play.<br/>- Includes interactive tutorial.<br/><br/>Based on the real card game: Quirk! The Laugh-Out-Loud family card game is currently published by Gibsons, retailing in John Lewis, Waitrose and Amazon in the UK.</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T08:59:03", "background_image": "https://media.rawg.io/media/screenshots/551/551a64f49781ac4c36d4a3c10f7ace3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gamesdisk"], "genres": [], "publishers": [], "esrb_rating": null}