{"id": 749735, "slug": "wheres-the-floor-2", "name": "Where's The Floor?", "name_original": "Where's The Floor?", "description": "WHERE'S THE FLOOR\r\n\n<p>Where's The Floor is an experience where you play as Meatball, building knowledge of the map as you paint nearby walls with your blood and take leaps of faith one after the other! Be quick though, as your blood only lasts so long on these stain-resistant tiles; lest you want to make your next move off of <em>memory</em>...</p>\n\n<p>As you progress through the levels, classic puzzle items like keys, pressure plates, and a... Makarov pistol? will test your ability to learn and infer in unfamiliar environments. You'll need more than your eyes to see where you're going next! Challenging and fulfilling stages build off of each other culminating into complex and difficult gameplay, but you'll be ready...</p>\n\n<p>But beating this 'game' isn't enough, is it? You were never satisfied with the endings you were given. Do you remember?</p>\n\n\r\nControls:\r\n<p>Arrow Keys - Basic Movement</p>\n<p>Escape - Open Menu</p>\n<p>Left Click - You click buttons dude.</p>\n\n\r\nDONATIONS WILL HELP ME TO FUND MY UPCOMING GAMES :3\r\n<p><strong>Paypal:</strong> paypal.me/HollysTyping</p>\n\n<p>With your support, I'm looking to add 20+ levels, more achievements, loads of secrets, new items, 5+ songs, level transitions, costumes, an options menu, controller support, and much more! I just need to make at least $20 off of donations to unlock all of Construct 3's features for a month. Of course, the game's still free for anyone who just wants to enjoy my work! &lt;3</p>\n\n<p><strong>Youtube:</strong> https://www.youtube.com/channel/UCckcQKgEtV9rZViYzLNd3-Q</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T09:24:48", "background_image": "https://media.rawg.io/media/screenshots/43c/43cbc049742938762ec9ff730f9e49fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HollyType"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}