{"id": 749787, "slug": "straw-dash-4", "name": "Straw Dash 4", "name_original": "Straw Dash 4", "description": "<p>EN:</p>\n<p>strawredguy has back. he we return of straw dash series! the caveie has next to levels to done with that game. but the only thing Master starting for the lighting phone with scanning bad guy has only do spaceship, bug, robot, yam yam, firefly and butterfly, the straw kid well be start miner!</p>\n<p>SP:</p>\n<p>Strawredguy ha vuelto. ¡Regresamos de la serie Straw Dash! el caveie tiene próximos niveles para terminar con ese juego. pero lo único que Master comienza con el teléfono iluminado con el escaneo del chico malo solo tiene que hacer nave espacial, insecto, robot, ñame ñame, luciérnaga y mariposa, ¡el niño de paja comenzará a ser minero!</p>\n<p>RU:</p>\n<p>соломенный парень вернулся. мы возвращаемся из серии соломенных тире! у пещерного человека есть несколько уровней, которые нужно закончить с этой игрой. но единственное, что Мастер начинает для освещения телефона со сканированием плохого парня, это только космический корабль, жук, робот, батат, светлячок и бабочка, соломенный ребенок может начать шахтер!</p>\n<p>AR:</p>\n<p>عاد Strawredguy. انه نعود من سلسلة اندفاعة القش! لدى caveie ما يلي المستويات التي يجب القيام بها مع تلك اللعبة. لكن الشيء الوحيد الذي يبدأه المعلم في هاتف الإضاءة مع مسح الرجل السيئ هو فقط سفينة الفضاء ، والبق ، والروبوت ، واليام اليام ، واليراع والفراشة ، سيكون طفل القش جيدًا يبدأ عامل المنجم!</p>\n<p>HE:</p>\n<p>strawredguy חזר. הוא אנחנו חוזרים מסדרת מקש קש! ל-caveie יש כמעט רמות לעשות עם המשחק הזה. אבל הדבר היחיד שמאסטר מתחיל לטלפון התאורה עם סריקת הבחור הרע יש לו רק חללית, באג, רובוט, יאם יאם, גחלילית ופרפר, ילד הקש טוב להתחיל כורה!</p>\n<p>JP:</p>\n<p>ストローレッドガイが戻ってきました。 ストローダッシュシリーズが帰ってきました！ 洞窟はそのゲームでやるべきレベルの隣にあります。 しかし、悪者をスキャンして照明電話を始めたマスターは、宇宙船、虫、ロボット、山芋、ホタル、蝶だけをやっています。わらの子供は鉱夫を始めましょう！</p>\n<p>KR:</p>\n<p>스트로레드가이가 돌아왔습니다. 밀짚 대시 시리즈의 우리가 돌아왔다! Caveie는 그 게임과 관련하여 다음과 같은 수준을 가지고 있습니다. 하지만 마스터가 나쁜 놈을 스캔하면서 조명 전화를 시작하는 유일한 방법은 우주선, 벌레, 로봇, 얌마, 반딧불이, 나비뿐입니다.</p>\n<p>CH (SIMPLIFIED):</p>\n<p>稻草人回来了。 他我们回归稻草冲刺系列！ 该caveie已经完成了该游戏的关卡。 但是Master开始用扫描坏人的照明手机只做飞船，虫子，机器人，山药，萤火虫和蝴蝶，稻草人很好是开始矿工！</p>\n<p>CH (TRADITIONAL):</p>\n<p>稻草人回來了。 他我們回歸稻草衝刺系列！ 該caveie已經完成了該遊戲的水平。 但是Master開始用掃描壞人的照明手機只做飛船，蟲子，機器人，山藥，螢火蟲和蝴蝶，稻草人很好是開始礦工！</p>\n<p>IT:</p>\n<p>pagliaccio è tornato. lui ritorniamo della serie di trattini di paglia! il caveie ha accanto a livelli da fare con quel gioco. ma l'unica cosa che il maestro inizia per l'illuminazione del telefono con la scansione del cattivo ha solo astronave, insetto, robot, igname, lucciola e farfalla, il ragazzo di paglia, beh, inizia il minatore!</p>\n<p>FR:</p>\n<p>Stradguy est de retour. il nous revient de la série de tirets de paille! le caveie a à côté des niveaux à faire avec ce jeu. mais la seule chose que Maître commence pour le téléphone d'éclairage avec le balayage du méchant n'a que le vaisseau spatial, l'insecte, le robot, l'igname, la luciole et le papillon, le gamin de paille bien commencer le mineur !</p>\n<p>RO:</p>\n<p>strawredguy are spate. el ne întoarcem din seria Straw Dash! Caveie are niveluri de făcut cu acel joc. dar singurul lucru pe care l-a început Maestrul pentru telefonul de iluminat cu scanarea tip răul îl are doar să facă navă spațială, insectă, robot, yam yam, licurici și fluture, puștiul de paie e bine să înceapă miner!</p>\n<p>PO:</p>\n<p>Strawredguy wrócił. wracamy serii słomkowej kreski! Caveie ma kolejne poziomy do zrobienia w tej grze. ale jedyną rzeczą, którą Mistrz zaczyna od telefonu z oświetleniem i skanuje złoczyńcę, jest tylko statek kosmiczny, robak, robot, pochrzyn, świetlik i motyl, dzieciak ze słomy może być górnikiem!</p>\n<p>GE:</p>\n<p>Strohmann hat zurück. er wir kehren von der Stroh-Dash-Serie zurück! Der Höhlenmensch hat neben Levels mit diesem Spiel zu tun. Aber das einzige, was der Meister für das Beleuchtungstelefon mit dem Scannen des Bösewichts beginnt, muss nur Raumschiff, Käfer, Roboter, Yam Yam, Glühwürmchen und Schmetterling tun, das Strohkind ist ein Startbergmann!</p>\n<p>SE:</p>\n<p>стравредгуи се вратио. хе ве ретурн оф слав дасх серије! цавеие има низ нивоа које треба урадити са том игром. али једина ствар коју Мајстор почиње за осветљење телефона са скенирањем лошег момка има само да уради свемирски брод, бубу, робота, иам иам, кријесницу и лептира, сламнато дете добро да почне рудар!</p>\n<p>TU:</p>\n<p>Strawredguy geri döndü. o saman çizgi serisine dönüyoruz! Caveie'nin yanında o oyunla yapılacak seviyeler var. ama Master'ın kötü adamı tarayan aydınlatma telefonu için başlattığı tek şey sadece uzay gemisi, böcek, robot, yam yam, ateş böceği ve kelebek yapıyor, saman çocuk madenci olmaya başlasın!</p>\n<p>CR:</p>\n<p>strawredguy se vratio. on we return of slaw dash serije! caveie ima nekoliko razina koje treba učiniti s tom igrom. ali jedina stvar koju je Učitelj započeo za osvjetljavajući telefon sa skeniranjem lošeg momka ima samo svemirski brod, bubu, robota, yam yam, krijesnicu i leptira, slamnati klinac dobro počni rudar!</p>\n<p>CZ:</p>\n<p>strawredguy se vrátil. vracíme se k sérii slaměných pomlček! Caveie má s touto hrou co do činění s dalšími úrovněmi. ale jediná věc, kterou Mistr začíná pro osvětlovací telefon se skenováním padouch, má pouze dělat vesmírnou loď, brouka, robota, yam yam, světlušku a motýla, slaměné dítě může začít horník!</p>\n<p>FI:</p>\n<p>strawredguy on palannut. he palaamme straw dash -sarjaan! caveie on vieressä tasoja tehdä, että peli. mutta ainoa asia, jonka Mestari aloittaa valaistuspuhelimen skannauspahiksen kanssa, on tehdä vain avaruusalus, bugi, robotti, jamssi, tulikärpänen ja perhonen, olkipoika aloita kaivosmies!</p>\n<p>HI:</p>\n<p>Strawredguy वापस आ गया है। हम स्ट्रॉ डैश सीरीज़ की वापसी करते हैं! केवी के पास उस खेल के साथ करने के लिए अगले स्तर हैं। लेकिन खराब आदमी को स्कैन करने के साथ लाइटिंग फोन के लिए मास्टर शुरू करने वाली एकमात्र चीज केवल स्पेसशिप, बग, रोबोट, यम याम, जुगनू और तितली है, स्ट्रॉ किड वेल स्टार्ट माइनर!</p>\n<p>FR (frisian):</p>\n<p>strawredguy hat werom. hy wy werom fan strie dash rige! de caveie hat neist nivo te dwaan mei dat spul. mar it iennichste ding Master begjint foar de ferljochting telefoan mei skennen minne guy hat allinnich dwaan romteskip, bug, robot, yam yam, firefly en flinter, de strie kid goed wêze begjinne mynwurker!</p>\n<p>SL:</p>\n<p>strawredguy má späť. Vraciame sa zo série slamených pomlčiek! Caveie má s touto hrou čo robiť. ale jediná vec, ktorú majster začína s osvetľovacím telefónom so skenovaním, má zlý chlap iba robiť vesmírnu loď, chrobáka, robota, yam yam, svetlušku a motýľa, slamené dieťa môže začať baník!</p>\n<p>GR:</p>\n<p>Strawredguy έχει πίσω. αυτός επιστρέφουμε της σειράς άχυρο παύλα! το caveie έχει δίπλα σε επίπεδα να κάνει με αυτό το παιχνίδι. αλλά το μόνο πράγμα που ξεκινά ο Δάσκαλος για το τηλέφωνο φωτισμού με τη σάρωση του κακού έχει κάνει μόνο διαστημόπλοιο, ζωύφιο, ρομπότ, γιαμ γιαμ, πυγολαμπίδα και πεταλούδα.</p>\n<p>IN:</p>\n<p>strawredguy telah kembali. dia kami kembali dari seri dasbor jerami! caveie memiliki level yang harus diselesaikan dengan game itu. tetapi satu-satunya hal yang dimulai oleh Guru untuk menyalakan telepon dengan memindai orang jahat hanya memiliki pesawat ruang angkasa, serangga, robot, ubi, kunang-kunang dan kupu-kupu, anak jerami itu akan menjadi penambang pemula!</p>\n<p>IR:</p>\n<p>Tá droim ar ais ag strawredguy. sé ar ais againn de shraith Fleasc tuí! Tá an caveie aice le leibhéil a dhéanamh leis an gcluiche. ach an rud amháin Máistir ag tosú le haghaidh an teileafón soilsiú le scanadh Guy dona bhfuil ach spásárthach, fabht, robot, yam yam, firefly agus féileacán, an kid tuí maith a bheith tosaithe miner!</p>\n<p>MA:</p>\n<p>Niverina indray i strawredguy. izy we miverina ny straw dash series! ny caveie dia manana ny ambaratonga tokony hatao amin'io lalao io. fa ny hany Master manomboka amin'ny telefaonina jiro amin'ny scanning olon-dratsy dia tsy manao afa-tsy sambon-danitra, bug, robot, yam yam, firefly sy lolo, ny zaza mololo tsara ho manomboka mpitrandraka!</p>\n<p>MA (Malay):</p>\n<p>strawredguy telah kembali. dia kami kembalikan siri straw dash! caveie mempunyai tahap seterusnya untuk dilakukan dengan permainan itu. tetapi satu-satunya perkara yang Master bermula untuk telefon pencahayaan dengan pengimbasan lelaki jahat hanya melakukan kapal angkasa, pepijat, robot, keladi keladi, kelip-kelip dan rama-rama, anak jerami juga menjadi pelombong permulaan!</p>\n<p>MA (Malayalam):</p>\n<p>strawredguy തിരിച്ചെത്തി. അവൻ ഞങ്ങൾ സ്‌ട്രോ ഡാഷ് സീരീസ് തിരിച്ചുവരുന്നു! കേവിക്ക് ആ ഗെയിം പൂർത്തിയാക്കാൻ അടുത്ത ലെവലുകൾ ഉണ്ട്. എന്നാൽ സ്‌കാനിംഗ് ബാഡ് ഗൈ ഉപയോഗിച്ച് ലൈറ്റിംഗ് ഫോണിനായി ആരംഭിക്കുന്ന ഒരേയൊരു കാര്യം മാസ്റ്ററിന് സ്‌പേസ്‌ഷിപ്പ്, ബഗ്, റോബോട്ട്, യാമം, ഫയർഫ്ലൈ, ബട്ടർഫ്ലൈ എന്നിവ മാത്രമാണ്, വൈക്കോൽ കുട്ടി ഖനിത്തൊഴിലാളിയായി തുടങ്ങട്ടെ!</p>\n<p>FI (Filipino):</p>\n<p>bumalik na si strawredguy. he we return of straw dash series! ang caveie ay may susunod na mga antas na gagawin sa larong iyon. ngunit ang tanging bagay na nagsisimula si Master para sa pag-iilaw ng telepono na may pag-scan ng masamang tao ay nagagawa lamang ng spaceship, bug, robot, yam yam, alitaptap at butterfly, ang batang dayami ay magiging nagsisimulang minero!</p>\n<p>PO (Portuguese):</p>\n<p>o palhaço voltou. ele voltamos da série de traço de palha! o caveie tem ao lado de níveis para fazer com esse jogo. mas a única coisa que o Mestre inicia para o telefone de iluminação com escaneamento do bandido só tem que fazer nave espacial, inseto, robô, inhame inhame, vaga-lume e borboleta, o garoto de palha bem começa mineiro!</p>\n<p>BU:</p>\n<p>strawredguy се върна. той ние се връщаме от серия slaw dash! caveie има до нива, за да свърши с тази игра. но единственото нещо, което Учителят започва за осветителния телефон със сканиране на лошия човек, има само да направи космически кораб, бъг, робот, ям ям, светулка и пеперуда, сламеното хлапе да започне миньор!</p>\n<p>TU (Turkmen):</p>\n<p>strawredguy yzyna gaýdyp geldi. sypal çyzgy seriýasyna gaýdyp gelýäris! gowakda şol oýun bilen ýerine ýetirilmeli derejeleriň gapdaly bar. badöne erbet adamy skanirlemek bilen yşyklandyryş telefonyna başlaýan ýeke-täk zat diňe kosmos gämisi, bug, robot, ýam ýamy, kebelek we kebelek, saman çagasy magdançy bolup başlaýar!</p>\n<p>NL:</p>\n<p>Stroredguy is terug. hij keren we terug van de stro-streepserie! de caveie heeft naast de levels te doen met dat spel. maar het enige dat Master voor de verlichtingstelefoon begint met het scannen van een slechterik, heeft alleen ruimteschip, bug, robot, yam yam, vuurvlieg en vlinder, het strojongetje moet beginnen met mijnwerker!</p>\n<p>DA:</p>\n<p>strawredguy er tilbage. he we return of straw dash serie! caveien har næste niveauer at gøre med det spil. men det eneste, mester, der starter til lystelefonen med scanning af skurken, kun har rumskib, bug, robot, yam yam, ildflue og sommerfugl, halmbarnet skal godt starte minearbejder!</p>\n<p>TH:</p>\n<p>Strawredguy กลับมาแล้ว เรากลับมาของซีรี่ย์ฟางแดช! Caveie มีระดับที่ใกล้เคียงกับเกมนั้น แต่สิ่งเดียวที่อาจารย์เริ่มต้นสำหรับโทรศัพท์ส่องสว่างด้วยการสแกนคนเลวมีเพียงยานอวกาศ, แมลง, หุ่นยนต์, มันเทศ, หิ่งห้อยและผีเสื้อ, เด็กฟางก็ควรเริ่มขุด!</p>\n<p>YI:</p>\n<p>strawredguy האט צוריק. ער מיר צוריקקומען פון שטרוי לאָך סעריע! די קאַוועי האט ווייַטער לעוועלס צו טאָן מיט דעם שפּיל. אָבער דער בלויז זאַך האר סטאַרטינג פֿאַר די לייטינג טעלעפאָן מיט סקאַנינג שלעכט באָכער האט בלויז טאָן ספּייסשיפּ, זשוק, ראָבאָט, יאַם יאַם, פיירפליי און פלאַטערל, דער שטרוי קינד געזונט זיין אָנהייב מיינער!</p>\n<p>JA:</p>\n<p>strawredguy wis bali. he kita bali saka seri dash darami! caveie wis jejere tingkat rampung karo game sing. nanging mung bab Master miwiti kanggo telpon cahya karo mindhai wong ala wis mung nindakake spaceship, bug, robot, yam yam, firefly lan kupu, bocah kang dipercoyo uga bakal miwiti miner!</p>\n<p>PE:</p>\n<p>نی نی برگشته است. او ما بازگشت از سری خط تیره نی! caveie دارای سطوح بعدی برای انجام با آن بازی است. اما تنها کاری که استاد برای نورپردازی گوشی با اسکن آدم بد شروع می کند، فقط سفینه فضایی، اشکال، ربات، یام یام، کرم شب تاب و پروانه است، بچه نی خوب است که معدنچی را شروع کند!</p><p>UK (Ukrainian):</p><p>strawredguy повернувся. він ми повертаємось із серії соломи! caveie має поруч рівні, які можна зробити з цією грою. але єдине, що Майстер починає для освітлювального телефону зі сканування поганого хлопця, має лише зробити космічний корабель, жук, робот, ям ям, світлячок і метелик, солом'яний малюк добре, щоб почати шахтар!</p><p>IC:</p><p>strawredguy er kominn aftur. he we return of straw dash series! the caveie hefur næstum stig til að gera með þeim leik. en það eina sem Master byrjar fyrir ljósa símann með að skanna vondi kallinn hefur bara gert geimskip, pöddu, vélmenni, yam yam, firefly og fiðrildi, strákrakkinn vel að byrja miner!</p><p>AR (Armeniam):</p><p>strawedguy վերադարձել է: նա մենք վերադարձնում ենք ծղոտե գծերի շարքը: caveie-ն ունի այդ խաղի հետ կապված մակարդակներ: բայց միակ բանը, որ Վարպետը սկսում է հեռախոսը լուսավորելու համար վատ տղայի հետ սկանավորումով, ունի միայն տիեզերանավը, սխալը, ռոբոտը, այմը, կայծոռիկն ու թիթեռը, իսկ ծղոտի երեխան լավ է, որ սկսի հանքափոր:<br/></p>", "metacritic": null, "released": "2022-02-20", "tba": false, "updated": "2022-03-04T09:36:06", "background_image": "https://media.rawg.io/media/screenshots/091/091204e88c118f83b2a049ee4fc7f85d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["amirthegamecreate"], "genres": [], "publishers": [], "esrb_rating": null}