{"id": 749829, "slug": "onerous", "name": "Onerous", "name_original": "Onerous", "description": "<p>Onerous is a 2D narrative-based game, where players will experience the monotonous routine of the main character’s life, repeating the same tasks over and over, and in doing so experience a narrative with the message that overworking yourself is not good and can lead to a decline in your mental health and feeling overwhelmed. You play as an average office worker, who day in day out goes about the same monotonous routine. Each day you get out of bed, head to the train station to get to work, make it through the workday, clock out and go back home.</p>\n<p>All you want is to make it to the end of the work week. The days are long however, and your grasp of reality is loosening. Each day you must complete your tasks to the best of your ability, but the further you go the more overwhelming they become, and the state of the world reflects that. As the days go by, your neighbours start saying things they would not usually say, you hallucinate memories of times of when you were happier, and the thoughts in your head start inhabiting the real world. </p>\n<p>With a dull and monotone colour scheme, and a sombre and melancholic atmosphere to match, Onerous aims to tell a story that those who find themselves overworking themselves can relate to and warn them of the dangers of doing so.</p>\n<p>Developers:<br/></p>\n\n<p>Lead Programmer - Mark Auman https://mark-auman.itch.io/</p>\n<p>Lead Designer - Sienna Wilton</p>\n<p>Lead Artist - Jessica Childs</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T09:50:17", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d56367f1a1419787e1ccca2172898af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SiennaFay33"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}