{"id": 749819, "slug": "the-haunting-of-killoch", "name": "The Haunting of Killoch", "name_original": "The Haunting of Killoch", "description": "<p>Haunted by trauma and the ghosts of your family, you were raised alone by your Aunt Lucia in the south of England. Your family all died in a tragic accident when you were young, and you were there to witness every gruesome detail. Now, as a young 20-something, you claim not to remember their deaths, or that experience at all. Because you don't. Right?</p>\n<p>Memories flash by you when you sleep, nightmares choking you in the depths of darkness, bloody details you'd wiped from your mind. But the night is never as bad as the day, where visions and sounds that no one else can see or hear plague your waking hours. Are you haunted or just unwell? Only time will tell.</p>\n<p>Now? You're a paranormal investigator with your two closest friends. Known on the internet as the Supernatural Sleuths, you have an up-and-coming Youtube channel and travel the world in search of supernatural mysteries, hoping to one day prove that this world isn't all it's cracked up to be.</p>\n<p>One day, your friend Marzena finds the latest story for you to follow. A woman has been found murdered on the outskirts of a forest in a secluded part of Ireland. No one knows who she is, and nobody has claimed the body. The closest village feigns ignorant. Apparently, this woman is a ghost. Worse still, there are reports that the woman was covered in occult markings and tattoos.</p>\n<p>Will you get to the bottom of this mysterious woman's death? Will you uncover the terrifying secrets hidden within the village of Killoch? Or will your own demons consume you before you get the chance?</p>\n<p>It looks like you've got your work cut out for you.</p><p>CONTENT WARNINGS  (more added as game progresses)\r\n</p>\n<ul><li>Death\r\n</li><li>Gore\r\n</li><li>Murder\r\n</li><li>Graphic depictions of violence\r\n</li><li>Ghosts\r\n</li><li>Paranormal entities\r\n</li><li>Demons\r\n</li><li>Hallucinations (visual and auditory)</li></ul>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T09:48:13", "background_image": "https://media.rawg.io/media/screenshots/725/725a9e84d166d3a8fa4511c4c2c5dedb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tori"], "genres": [], "publishers": [], "esrb_rating": null}