{"id": 749856, "slug": "smugglers-of-cygnus-early-access", "name": "Smugglers of Cygnus - Early Access", "name_original": "Smugglers of Cygnus - Early Access", "description": "<p>This is the Early Access Alpha for Smugglers of Cygnus. The current development point is Alpha 0, with over a year left until Release.<br/></p>\n<p>Development is rapidly progressing, and new updates will be uploaded every couple weeks as we proceed. To join in and provide feedback, check out the forum or the chat room. We're utilizing Butler to reduce the update size of patches, so the Itch launcher might be useful. Right now, gamepad controls are still being added, and control remapping save is disabled (though you can use esc to bring it up or dismiss it to see the current).<br/></p>\n<p>At the opening of the <em>Age of Cygnus</em>, a great era of commerce begins. Traders ply this vast frontier, transporting cargo between planetary systems, discovering markets, and establishing trade routes. </p>\n<p>The player, newly graduated from Trade Academy, has the option to chart their career path among the stars. As a space mariner, smuggler, or pirate (or a cunning mix), the player collects crew members and star maps needed to succeed in the unforgiving void of space. Friends and foes are everywhere, and whom the player can trust often is based on loyalty to profit over loyalty to the player.</p>\n<p>Explore the Cygnus Galaxy in first and third person views as you pick up and deliver cargo, track down bounties, hunt or defend against pirates or heavily armed merchants, and find or craft new parts to upgrade your ship with. Use those parts and the paint shop to customize, upgrade, and color your ship to suit your taste and style.<br/></p>\n<p>With remappable controls and and the ability to change the UI  coloring, you can take customization to the next level and fly the  galaxy in comfort.  </p>\n<p>There are over 100 solar systems full of opportunity out there to discover, what are you waiting for? \r\n</p>", "metacritic": null, "released": "2022-03-01", "tba": false, "updated": "2022-03-04T09:56:11", "background_image": "https://media.rawg.io/media/screenshots/9f1/9f1bb7168c6e5f051de6ab81bb59ac3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 401, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["Longplay Games"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}