{"id": 749932, "slug": "mistrick", "name": "Mistrick", "name_original": "Mistrick", "description": "<p>-----------------------------------------------------<br/></p>\n<p>This game can only be played with a keyboard. Please keep that in mind!</p>\n<p>-----------------------------------------------------<br/></p>\n<p>You play as John Blanc, a narcissistic convict, who finds himself trapped in a strange pocket dimension. Soon after his arrival, he is greeted by a former cell neighbor and executed serial killer, Chase Colt. While Chase claims that John has already died, this quickly turns out to be a malicious lie to keep John trapped in this world. Will he be able to figure out a way to escape, or will he die to the many tricks of this wicked place?</p>\n<p>-----------------------------------------------------</p>\n<p>Mistrick was made within one month for the Yandere Jam 2022</p>\r\nCONTENT WARNINGContains depiction and mentions of blood, violence, murder and kidnapping\r\n\n<p>-----------------------------------------------------</p>\n<p>It features:</p>\n<p>- 3 Endings</p>\n<p>- 13 unique ways to die</p>\n<p>- 40-60 minutes of gameplay</p>\n<p>- 5 CGs</p><p>- Available languages: English, German (Windows only)</p>\n<p>If you get stuck please consult the walkthrough which you can download further down :) Alternatively both Lola and Chase give you in game hints through their dialogue.<br/></p>\n<p>-----------------------------------------------------</p>\n<p>Mistrick is a spin-off to my other game 'Misfiction'. It is not necessary to play Misfiction to understand Mistrick, since the events of Misfiction are retold through a intro cutscene (And not all that important later on). That being said, if you still plan on playing Misfiction I would advise you to do that first, or alternatively skip the intro cutscene of Mistrick, as it does contain spoilers for Misfiction.</p>\n<p>-----------------------------------------------------</p>\n<p>Let's play/Streaming guidelines: </p>\n<p>Feel free to stream/Let's play this game. Have the credits on screen at least once and link to this page in the description though.</p>\n<p>Translations: </p>\n<p>If you would like to volunteer a translation of this game, please dm me on twitter @HatogeGames </p>\n<p>If you find any bugs or make fan content and want to show me, please write me a DM on twitter @HatogeGames, or write me an E-Mail at hatogegames@gmail.com :)</p>", "metacritic": null, "released": "2022-02-28", "tba": false, "updated": "2022-03-04T10:16:53", "background_image": "https://media.rawg.io/media/screenshots/759/75982b6d49140f9fdef56b9e1a6fdc00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Hatoge"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}