{"id": 750, "slug": "final-fantasy-xv", "name": "FINAL FANTASY XV", "name_original": "FINAL FANTASY XV", "description": "<p>Final Fantasy XV is an action RPG developed by Square Enix and is not connected to the previous installments of the series.</p>\n<p>The story takes place in a world of Eos. Noctis Lucis Caelum, the heir of the Lucis Empire throne sets out on a quest with his comrades in order to recover a stolen magical gem the theft of which sparks a global conflict between all the nations in Eos.</p>\n<p>The combat system resembles the same one featured in Final Fantasy Type-0 but is heavily modified. There is no option to control any of the four main protagonists apart from Noctis himself, yet it is possible to command your teammates. It is possible for the players to use vehicles such as tanks or robots or summon beings that differ in rank based on their size. There are no battle-specific battle screens in FFXV.</p>\n<p>Magic is also present in the game. By consuming the power of natural elements from their sources, Noctis is able to cast spells. The Protagonists have the ability called Link Form which allows for contextual attacks.</p>\n<p>The main emphasis is put on the road trip with your friends. FFXV features a massive open world which can be freely explored. Dynamic day-night cycle and weather systems are also present.</p>", "metacritic": 82, "released": "2016-11-29", "tba": false, "updated": "2024-04-21T12:52:04", "background_image": "https://media.rawg.io/media/games/2ee/2eeed8524931b4fae1e4a40d0e5443b5.jpg", "website": "https://finalfantasyxv.square-enix-games.com/", "rating": 3.87, "rating_top": 4, "added_by_status": {"yet": 351, "owned": 3462, "beaten": 1103, "toplay": 285, "dropped": 389, "playing": 138}, "playtime": 5, "achievements_count": 687, "ratings_count": 1387, "suggestions_count": 536, "game_series_count": 27, "reviews_count": 1403, "platforms": ["PlayStation 4", "PC", "Xbox One"], "developers": ["Square Enix"], "genres": ["RPG"], "publishers": ["Square Enix"], "esrb_rating": "Teen"}