{"id": 750032, "slug": "the-awful-maze", "name": "The Awful Maze", "name_original": "The Awful Maze", "description": "What this game is: \r\n<p>    This game is made to test your skills for orientating and navigating in mazes , this particular maze generates new version of itself every time you start playing the game. You own a few spray tags for unlimited use, that can prevent you from losing yourself and spinning in circles. There are 7 sizes of mazes, Extra Small, slightly bigger than extra small, called X type, Small, Medium, Large, Extra Large, and finally The Backrooms sized maze. Your only goal in this game is to finish the mazes as fast as possible (In case you can finish the maze).        There are 3 types of modes in this game:</p>\n<ul><li>Standard, where you just need to find the way out, without worrying about anything.</li><li> Challenge, where you can challenge yourself with a certain time, chosen by you, and try to finish the maze. However, if you don't manage to finish in time you lose the game, and your record is not counted.</li><li> Scary, which is made for fun and a little bit more feeling of anxiety when you are trying to finish the maze. In this mode you are being chased by the ghost keeper of this maze, if he catches you, you lose the game.       </li></ul>\n\r\n Game lore:\r\n<p>   Scientists are sending you again and again in a weird anomaly maze built in a random asteroid in the deep space. They have noticed that every time they send you there the maze is always different, even though it doesn't appear to move physically anyhow.   They are trying to figure out what is happening there by sending you to explore and try to find the way out each time, until they find the needed answers. In this time, you have discovered that the maze has a guardian, that hunts down anyone who enters inside. It appears that the guardian looks like some sort of glowing astronaut that has the ability to fly, even though there is gravity, and also to go through the walls of the maze. The scientists name him The Maze Phantom. In all the cases you should avoid all possible contacts with him.              </p>\n\r\nGame controls:\r\n<p> W,S,A,D - move around </p>\n<p>Mouse - Look around </p>\n<p> Left Mouse - Spray tag </p>\n<p> Z - Turn on flashlight</p>\n<p> X - Choose \"X\" mark tag </p>\n<p> C - Choose sad face tag</p>\n<p> V - Choose home/house tag </p>\n<p> B - Choose \"Been Here\" tag</p>\n<p> Arrows - Choose arrows tags        </p>\n\r\n Additional info: \r\n<p> All the mazes are possible to beat for extremely short period of time if you pay attention to your surroundings.</p>\n<p>  Each mode has its own way type of hardness. </p>\n<p> You can mark the place where you were spawn, so you will know where you are if you get lost and inadvertently appear on the place you started. </p>\n<p> You can mark the place where you are going or where you came from to have better idea of where you are later. </p>\n<p>The best way to start is to walk straight in whichever direction, until you hit the maze edge. The chance that you are on the side of the maze where the exit is located is 25%. </p>\n<p> There are always 2 exits on each maze.</p>", "metacritic": null, "released": "2022-02-28", "tba": false, "updated": "2022-03-04T10:43:18", "background_image": "https://media.rawg.io/media/screenshots/0e7/0e7ee56b8c342c5c4cb828cd506f6976.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SinnerStudio"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}