{"id": 75029, "slug": "whats-my-iq-pro", "name": "What's My IQ? PRO", "name_original": "What's My IQ? PRO", "description": "Stupidness 2 &amp; 3 ranked overall #1 in more than 20 countries, you will definitely won't want to miss it's sequel, What's My IQ?™. <br/><br/>What's My IQ?™is a whole new puzzle game with a series of creative puzzles, and absurd solutions that you will never ever thought of!  Each puzzle is unique and pushes your creative thinking to the limit. Think out-of-box, don't think straight!<br/><br/>What's My IQ?™ gives you an IQ score at the end of the day, and it tightly integrates you to your Facebook friends so that you can see who has a higher IQ in creativity! Get your friends and family to try it out. Watch and laugh at how stupid they can be at these highly unusual questions! The solutions are simple but are never obvious! Your IQ score will be based on number of mistakes and time taken, so take a deep breath before you get started with this intense, mind-blowing game!<br/><br/>Features:<br/>✚ ‶100+ cunning questions″<br/>✚ ‶Out of the box answers that you can never guess!″<br/>✚ ‶Solutions with 20 Free Cheats (just in case)″<br/>✚ ‶Fun for all ages″<br/>✚ ‶Compete your IQ with Facebook friends″<br/>✚ ‶Simple yet addictive″<br/><br/><br/>Testimonials don't lie, read some of our Stupidness 2 reviews:<br/><br/>❝Stupidness Pro 2 would be a great game to pull out at your next party. No matter how old you are, you will find the questions silly, challenging, and somewhat mystifying. It is worth your money if you enjoy comedy and a little witty humor.❞ - AppAdvice.com<br/><br/>Amazing - ✭✭✭✭✭<br/>❝I love this game! It has the best brain teasers! Love love love it!❞<br/><br/>This is an Awesome App!!! - ✭✭✭✭✭<br/>❝This was one of the best apps I've played. It's so out of the box.❞<br/><br/>Love it! - ✭✭✭✭✭<br/>❝I'm 7 and play it on my mom's phone every day. Stupidness rocks!❞<br/><br/>Many \"Duhs\" are in your future - ✭✭✭✭✭<br/>❝This game is fun because it points out the flaws in your logic and forces you to think... I mean reaaallllyyy think! I feel smarter already. Thanks Stupid.❞<br/><br/>What A Game! :) - ✭✭✭✭✭<br/>❝This game can be a head scratcher, but I love it. It is fun,clever,tricky and awesome!!! I recommend anyone to download this app!!! :)❞<br/><br/><br/>NOTE: Please turn off ZOOM setting under Settings &gt; General &gt; Accessibility &gt; Zoom<br/><br/><br/>❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖<br/>Stupidness 2&amp;3 earns an average of 4½ Stars Worldwide!<br/>You won't want to miss it's sequel, What's My IQ?™, download now!<br/>❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖❖", "metacritic": null, "released": "2012-08-14", "tba": false, "updated": "2019-10-22T14:25:01", "background_image": "https://media.rawg.io/media/screenshots/172/1723d5ae6bc72ee79edbe2187d9ccf67.jpg", "website": "http://www.orangenosestudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Orangenose Studios"], "genres": ["Action", "Puzzle"], "publishers": ["Chien Ming Liang"], "esrb_rating": "Everyone 10+"}