{"id": 750398, "slug": "epic-2007", "name": "Epic (2007)", "name_original": "Epic (2007)", "description": "<p>One level for any boom compatible and limit removing ports. PrBoom-Plus or GZDoom are recommended. To play this PWAD file, unzip it into the directory with your PWADs then start: glboom-plus.exe -file epic.wad -complevel 9 (g)zdoom.exe -file epic.wad</p>\n<p>Important:</p>\n<p>Do not play map05 in the current prboom (up to 2.4.8 for now), because of:</p>\n<p>a) All existing versions of prboom are buggy on levels with big open areas - precision problems. The latest Eternity release (3.33.33) also can&#39;t handle map05 correctly - the same precision problems. Use the latest SVN alphas.</p>\n<p>b) The current glboom-plus (2.4.8.2.beta) is much faster on levels with sectors which have too many lines. I got 80 fps in glboom-plus instead of 50 in glboom at map05.</p>\n<p>c) Vanilla GLBoom doesn&#39;t have an option for quality rendering and it is very noticeable on some levels, especially on the big tower at map05 and in the second room at map03 - big white strips and dots on corners. The effect doubles on ATI cards. Light sky is a headache of prboom. So gl_render_precise should be 1. I hope this variable will be removed in the future versions and quality mode will be forced.</p>\n<p>Note: gl_depthbuffer_bits in glboom-plus.cfg should be 24 or 32 to avoid some rare small glitches.</p>\n<p>Yo can download the latest prboom-plus here: http://prboom-plus.sourceforge.net/history.html</p>", "metacritic": null, "released": "2007-10-10", "tba": false, "updated": "2022-03-06T14:22:16", "background_image": "https://media.rawg.io/media/screenshots/b5b/b5ba475205ff464d883a4e65a7224029.jpg", "website": "https://www.doomworld.com/idgames/levels/doom2/Ports/d-f/epic", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}