{"id": 750367, "slug": "a-punishment-for-mai", "name": "A Punishment for Mai", "name_original": "A Punishment for Mai", "description": "<p>Mai is a 28 years old young woman with a sad and dark past from which she remember almost nothing but a deep pain.<br />\nWithout knowing how, or why, Mai wake up one day in a motel room, wondering, she comes out only to find that she&#39;s in a place that she never saw on her life and which has nothing to do with her usual reality.<br />\nThe girl, who initially thought she was alone in this city, ends up discovering that there is more life than she thought: monsters, demons, strange people and, last but not least, a kind of<strong> sect of people in cassocks who seem to be the &#39;lords of the place &#39;. Under such conditions, Mai, plucks up courage and starts to seek for a way to get out of there, but unfortunately for her, after several</strong> months of searching she finds nothing.<br />\nHowever, someone<strong> has been watching Mai most of this time, a mysterious man who appears infront of her. He calls himself the &#39;Driver&#39; and hides his face behind a mask.<br />\nDespite the initial distrust, Mai has no choice but to accept the help of the &#39;Driver&#39;, which, promises he will help her get out of the town.<br />\nTime passes and Mai begins to lose patience, strange dreams beset her, surviving in the town is becoming </strong>more dangerous, the doubts of what the town is and why is she <strong>there and above all that, a deep sense</strong> of sadness, are making the she starts to doubt on his sanity and to top places of her previous life started to appear in <strong>the town, including the house where she lived before appearing here.<br />\nAll seems lost, but one day the &#39;Driver&#39; appears and tells her it&#39;s time to leave the town, but first she shall pass a test...</strong></p>", "metacritic": null, "released": "2015-06-19", "tba": false, "updated": "2022-03-06T00:51:14", "background_image": "https://media.rawg.io/media/screenshots/b91/b91c3ec2ac56cbfd333f51033eed1954.jpg", "website": "https://gamejolt.com/games/a-punishment-for-mai/74693", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}