{"id": 750345, "slug": "deathforest-escape-from-the-forest-proliferation", "name": "DeathForest ~ Escape from the forest ~ [Proliferation]", "name_original": "DeathForest ~ Escape from the forest ~ [Proliferation]", "description": "<p>Let&#39;s freeze with a terrifying horror! [Online novelization]</p>\n<p>[Story]<br />\nOne summer day when it became hot and humid, there was a Japanese man who enjoyed a carefree trip on a moped.<br />\nMy current location is somewhere in Fukui prefecture, and sometimes it&#39;s dusk. The hotel I reserved is still far away, &quot;I can&#39;t make it in time.&quot;<br />\nWhile drinking canned coffee at the parking lot of the convenience store, grasping the current situation, suddenly checking the map on the smartphone,<br />\nNotice that there is. &quot;If you go through here, you don&#39;t have to go around the forest to get there, right?&quot;<br />\nThe map did show a thin line through the woods. The man who poured coffee all at once grabbed the steering wheel .....</p>\n<p>【way of proceeding】<br />\nExplore the woods, get 4 bike parts (white objects) and secure an escape route<br />\nYou can escape by returning to the bike after doing. Also in this forest is the end of the victims of the murders that once occurred in this forest (enemy). I will follow you, but please sprinkle it well and run away! Also, if you collect the forgotten memories (white square objects) scattered on the stage, you can see them in the bonus menu.<br />\nIf you touch it, you will die instantly and return to the beginning, so be careful!</p>", "metacritic": null, "released": "2014-09-17", "tba": false, "updated": "2022-03-05T22:59:31", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bcb848386938dc899bc09b960e36c90.jpg", "website": "https://www.freem.ne.jp/win/game/7158", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}