{"id": 750465, "slug": "survival-quiz-city", "name": "Survival Quiz CITY", "name_original": "Survival Quiz CITY", "description": "Survival Quiz CITY is a multiplayer Survival Quiz Battle Royale game where only your smarts and skills will help you survive! Players answer questions and divide into two groups: the winners (correct answers) and the losers (incorrect answers). Fight as a team to win each round and survive to become the winner!<br/><br/><h3>How to Compete in Survival Quiz CITY</h3> <br/> <strong>Take a multiple choice quiz and race to be one of the first to the correct answer!</strong><br/><br/><br/><br/>For those that answer the quiz correctly, you'll have access to the finest in loser-stopping weaponry! Earn money by pelting players trying to make it to the goal. Knock them off, slow them down - anything to keep them away from the prize!<br/><br/><br/>If you answer incorrectly, make a mad dash through an obstacle course full of pits, pendulums, precarious platforms - all while being attacked by the other team! Reach the goal and you'll be rewarded with sweet, sweet cash to improve your avatar for the next round. <br/><br/> <strong>Be the Last One Standing!</strong><br/><br/>Each round, the winners and losers in the quiz switch again and again, and as players are eliminated, try to be the last one standing!<h3>Game Modes</h3> There are two types of game modes: Survival and Bounty Hunters!<br/>In <strong>SURVIVAL</strong> the last player alive wins, and in <strong>BOUNTY HUNTER</strong>, the player with the most coins at the end of the last round wins!<br/><br/><br/> <br/> <strong>Power Up in the Shop</strong><br/>At the end of each round coins will be awarded, which can be used to buy new weapons and abilities!<br/><br/><br/>Between rounds, shop at the store for powerups and cosmetics! Fancy some extra speed? Spend that hard-fought cash on the latest in Survival Sneaker Technology! Want to upgrade your guns so you have a better chance of blasting players off the stage? Get that shiny new grenade launcher! Or perhaps you just want to look fly as you sprint past the other contestants? Trick out your avatar with different gear and accessories!<br/><br/><br/> Use a variety of weapons to slow down the Losers!<br/>Attack the Losing team using equipped weapons as the Bomb, Machine Gun or Bazooka! Which options work for you?<br/><br/><br/><br/><strong>Other features</strong><br/> <br/> Custom matches：Custom matches allows you to enjoy the game with your favorite game modes, stage level, official or original quizzes etc.!<br/><br/> Original quiz<br/>Make your own quizzes and import them to your custom mathes! You cal also use the quizzes created by other players.<br/><br/> <br/><br/> Play the game and earn cosmetic items!<br/>Meet various conditions to get new emotes as rewards.<br/><br/><br/><br/> You can visit Survival Quiz CITY with an \"Visitor's Pass\" for free!<br/>Play for as long as you’d like, but as a visitor there are a few restrictions.<br/>Visitor's Pass holders can join rooms hosted by their friends or other players with the full version of the game, but won’t be able to join Quick Matches.<br/>They also won’t be able to create their own rooms or original quizzes.<br/><br/>", "metacritic": null, "released": "2022-03-04", "tba": false, "updated": "2022-03-07T03:08:10", "background_image": "https://media.rawg.io/media/screenshots/65a/65a60e6e33b2bfa59368cf8638e1a1ab.jpg", "website": "https://sqcgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bandai Namco Entertainment"], "genres": ["Action", "Casual", "Massively Multiplayer"], "publishers": ["Phoenixx"], "esrb_rating": null}