{"id": 750432, "slug": "zogs-nightmare-the-national-socialist-movement", "name": "ZOG's Nightmare: The National Socialist Movement", "name_original": "ZOG's Nightmare: The National Socialist Movement", "description": "<p>ZOG&#39;s Nightmare: The National Socialist Movement (often shortened to ZOG&#39;s Nightmare) is a first-person shooter game developed and published by Resistance Records under the auspices of the Detroit-based Neo-Nazi political party National Socialist Movement (NSM). In the game, the player controls a Neo-Nazi conspiracy theorist for ZOG (Zionist Occupation Government), which is a conspiracy theory where Jews are actually controlling the government in the U.S. In the game, the player kills Jews, African Americans, etc. The game received a sequel called ZOG&#39;s Nightmare 2: The War Continues!, which followed the plot of the first game.</p>\n<p>The game was banned in Germany after the game was submitted to the Index of Media Harmful to Young Persons, and had content which are criminally relevant to sections 131 (Graphic Violence) and 86a (Depiction of Nazi or Fascist symbolism), which resulted in the game be put on list B, although the game has still not yet been confiscated by any court.</p>\n<p>In January 2015, a user of the Neo-Nazi forum stormfront.org indentified as &quot;mmaragos&quot; (later &quot;Wolfdie Entertainment&quot;) created a fan-made last sequel for ZOG&#39;s Nightmare 2, called ZOG&#39;s Nightmare 3: Message from C18. ZOG&#39;s Nightmare 3 was even more flawed than the two original games, and fell on oblivion too.</p>", "metacritic": null, "released": "2006-01-01", "tba": false, "updated": "2022-03-06T16:26:54", "background_image": "https://media.rawg.io/media/screenshots/f63/f63f47291b3a4edd4a736c9ec1d515ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}