{"id": 750555, "slug": "hank-the-tank-bitsy-exploration", "name": "Hank the Tank - Bitsy Exploration", "name_original": "Hank the Tank - Bitsy Exploration", "description": "<p><strong>Artist Statment:</strong></p>\n<p>My aim for my Bitsy game is for the player to reflect on the way  their daily lives affect animals in their communities and hopefully gain  some empathy for them. This is why they take on the role of “Hank the  Tank”, a bear who has recently become infamous for breaking and entering  Lake Tahoe homes and eating human food. Recently, it was discovered  that this was due to three separate bears and none of them will be  euthanized, but when this game was being conceived they were being  considered for euthanasia. The community of Lake Tahoe was divided  -  some wanted Hank gone because he proved as a danger to residents, but  others believed his behavior was due to climate change interrupting his  hibernation schedule. <br/></p><p>By playing as Hank, players are forced into a very different point of view from what they are used to. This uses transformation as enactment to hopefully achieve personal transformation in the player as taking on the role of Hank for a few minutes may help them gain sympathy for his situation. By giving the player the agency to move around in the game world and interact with things inside it as Hank, this furthers the enactment of being Hank. Areas that are meant to be outside and cold mainly use a cooler color palette and are open, while indoor areas use a warm color palette and are enclosed by walls. This is to demonstrate the way Hank may see the world now that he is so used to interacting with humans for food.<br/></p>\n<p>I used the sequence dialogue option for several NPCs and all of the television dialogue. This is because I wanted these interactions to be more spaced out and have different parts of their dialogue split up. With the television dialogue, this gives the illusion of time passing by as the player interacts with it again. I also have a variable that keeps track of if the player picks up the pizza left by an NPC which then changes said NPC's dialogue. This is to show how some residents of the town are reinforcing Hank's behavior by giving him human food and making the problem worse.</p>\n<p><strong>Credits:<br/></strong></p>\n<p>Inside sound effects: https://freesound.org/people/nixeno/sounds/416002/</p>\n<p>Winter sound effects: https://freesound.org/people/TRP/sounds/575245/</p>\n<p>Picture of Hank the Tank for the cover:<strong> CBS 13 Sacramento </strong><br/></p>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2022-03-07T04:05:09", "background_image": "https://media.rawg.io/media/screenshots/5a5/5a5d438dcf46257507ab42d28c466b1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["bentocat"], "genres": [], "publishers": [], "esrb_rating": null}