{"id": 75068, "slug": "hotel-hideaway", "name": "Hotel Hideaway", "name_original": "Hotel Hideaway", "description": "Jump into the world of Hotel Hideaway: a social online 3D role playing game full of opportunities to meet new people and make new friends. The Hotel is a lively and vibrant world full to the brim with social adventures and fun activities!<br/> <br/>Dress to impress and make yourself stand out in the crowd with an abundance of stylish clothing, items and accessories. Learn secret gestures and dance moves, and then party into the early hours in unique public rooms!<br/> <br/>No matter what you like to spend your time doing, Hotel Hideaway is the place to be. There’s oodles of fun to be had and secrets to discover, so jump in and make sure the other guests recognise your name!<br/> <br/>CREATE AND CUSTOMIZE YOUR 3D AVATAR<br/> <br/>   •  Customise your avatar down to the smallest detail, with a huge array of amazing <br/>       clothes, accessories, hairstyles, jewellery, face items and even tattoos!<br/>   •  Reflect your own personal style in your avatar, or go overboard with outrageous <br/>       costumes. The outfit combinations are endless!<br/>   •  Express yourself, your style and your mood by creating your own outfits from <br/>       hundreds of items and colors.<br/>   •  From formal to casual, streetwear to fantasy and everything in between, there’s items <br/>       for everyone.<br/>   •  New exciting items released every week!<br/> <br/>SOCIALISE AND MAKE NEW FRIENDS<br/> <br/>   •  Chat with other guests and form tribes. Making new friends and influencing others is <br/>       the only way to become the most popular guest!<br/>   •  Complete daily tasks with your friends for great rewards.<br/>   •  Explore the Hotel with other guests and discover hidden secrets.<br/>   •  Show off your sense of style and become an icon among your companions!<br/><br/>3D LIVE SOCIAL ROLE PLAYING GAME<br/> <br/>   •  Hotel Hideaway is a 3D virtual world where you can become who you’ve always <br/>       wanted to be.<br/>   •  Chat live and meet with other people from around the world!<br/>   •  Visit unique locations and explore what the Hotel has to offer. Relax in the spa, party <br/>       at the beach or hang out in the many other public rooms with your friends!<br/>   •  Be at the center of attention with stylishly designed clothes and outrageous outfits!<br/>   •  Take part in themed seasonal events; there's new things to see and do in the Hotel <br/>       every month!<br/> <br/>So, what are you waiting for? Jump into the unique world of Hotel Hideaway NOW and leave your mark!<br/> <br/>Please note that Hotel Hideaway is for ages 17+.<br/> <br/>FOLLOW US:<br/>facebook.com/HotelHideawayTheGame<br/>instagram.com/hideaway_official", "metacritic": null, "released": "2016-11-29", "tba": false, "updated": "2019-10-22T14:25:01", "background_image": "https://media.rawg.io/media/screenshots/25f/25fb42eb35b396a65f4b3a35444b8be9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Sulake Corporation Oy"], "genres": ["RPG", "Simulation"], "publishers": ["Sulake Corporation Oy"], "esrb_rating": null}