{"id": 750726, "slug": "geowitch", "name": "Geowitch", "name_original": "Geowitch", "description": "<strong>THE GAME</strong>\n<p>Melchiresa the witch has her eyes set on some ice cream - just a shame that she can't get at it! Can you use her powers of earthshaping to craft a path there (whilst trying to avoid being impaled)? Or will you run out of jumps and forever been doomed to write out rude words with the earth and admire the scenery?</p>\n\n<strong>THE CONTROLS</strong>\n<p>Controls are:</p>\n<ul><li>WASD / arrow keys to move and jump</li><li>Left click to pick up a block (that doesn't have spikes on it)</li><li>Release left click to drop the block</li></ul>\n\n<strong>MY THOUGHTS</strong>\n<p>I like how this game turned out! I didn't have as much time on it as I would've liked, since I had to get it done over the weekend, so I missed Friday. For 48 hours, though, I'm pleased! The graphics turned out pretty well, the character animation looks nice (and I finally figured out how run cycles work!), and the mechanic's pretty interesting too - though I wonder if anyone else thought it up for their jam game too. If that's you and you're reading this, hi! One thing I would've liked is more polish, though - I feel like this is the kind of game where I can add a metric ton of polish to it. So many particle effects, noises, things that move when you click them, if only I had time to add them all! Still, for what it is, I like the end product. Particularly that little intro comic I added too, it's nice to finally add some context to some of my games. And I hope you liked playing it as much as I did making it! What was your time taken to beat it? I'd love to hear in the comments!<br/></p>", "metacritic": null, "released": "2022-03-06", "tba": false, "updated": "2022-03-07T04:50:18", "background_image": "https://media.rawg.io/media/screenshots/d6f/d6f34928b380a370ea760ca6daf67329.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cakestorm"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}