{"id": 750968, "slug": "alien-slaphead", "name": "Alien Slaphead", "name_original": "Alien Slaphead", "description": "<p><strong>Alien Slaphead (C) 2022 Joesoft</strong></p>\n<p>Difficulty - It's for Kids.</p>\n<p>Concept, Code and Graphics by John Davies</p>\n<p>Fabulous Loading Screen by Andy Green</p>\n<p>Awesome Original AY Music by Pedro Pimenta</p>\n<p>Music Album - https://jumperror.bandcamp.com/album/alien-slaphead-ost</p>\n<p>Written using The Amazing AGDx Mini</p>\n<p><strong>The Story</strong></p>\n<p>You are Alien Slaphead</p>\n<p>You landed on earth on a one way ticket with the intent of spying on it's inhabitants in preperation for war and planetary takeover. But you fell in love with the kindness of humans. Especially a fantastic little boy named Joe, well who else, who taught you about the wonders of the world. You decided to abort the mission and report back to your superior slapheads informing them that the planet was not yet ripe for colonisation.</p>\n<p>But your spaceship was out of fuel so to return back to your dimension in space you must collect various items which you can convert to fuel and leave the planet and it's people unharmed.</p>\n<p>As most knowledgeable people are aware, a slaphead needs a constant supply of helium to survive as he cannot breath the natural atmosphere. Fortunately a large supply of helium packs were jetisoned from your ship, for use during your stay, before you landed.</p>\n<p>Part of your mission was to build up your KOT (Knowledge of Terra) whilst on the planet and report back your findings. Hopefully you have learnt a lot as in order to retrieve the extra rocket fuel also contained in helium packs you must pass a KOT test.</p>\n<p>Your mission will begin at 11:55pm December 31st, New Years eve to take advantage of the celebrations for your cover, allowing you to go unnoticed whilst searching for fuel on the way to your spaceship. Trouble is a bunch of other aliens on earth have noticed your bald, shiny, green slaphead. </p>\n<p>Your aim is to find your spaceship, in the depths of a dormant volcano, with enough fuel to leave and an A1 U.R.A. Ranking to your name to prove your KOT is second to none. Your mission will then be deemed a success with or without the colonisation go ahead.</p>\n<p>Good Luck Alien Slaphead.</p>\n<p><strong>The Game</strong></p>\n<p>Alien Slaphead is a tiny sprite platform game for kids. You control Slaphead and must reach the helium tank, which provides helium, bonus rocket fuel on answering a KOT question correctlym and advancement to the next stage of your journey. You can also pick up items on the way which can be converted to rocket fuel too. Answering questions correctly and collecting items to boost your fuel level is vital as it directly correlates to your U.R.A Ranking at the end of the game, whether you complete it or not, and nobody wants to be known as a U.R.A Rotting Slug. So good luck in returning home in your rocket, slug face.</p>\n<p><strong>The Controls</strong></p>\n<p>Q-Left, W-Right and M-Jump. Joystick control also available.</p>\n<p><strong>Featuring</strong></p>\n<p>Slaphead, Aliens, Dogs, Cows, Flying Saucers, Helium, Fire, Water, Stampers, Fireworks, Spikes, Pie, Beehives, Hearts, Skulls, Apples, Bananas, Lightning Bolts and Krafty KOT Questions</p>\n<p><strong>Special Thanks to...</strong></p>\n<p>Allan Turvey, Sparkling Additional Code in AGDx Mini</p>\n<p>Sebastian Braunert, Brilliant Tape File Build</p>\n<p>David Saphier, Marvelous Musicizer II </p>\n<p>Jonathan Caudwell, The Wonderful AGD</p>\n<p>Paul Jenkinson, Fantastic Tutorials</p>\n<p>...and also everyone else who's helped me at all along the way.</p>\n<p>You know who you are. Cheers once again.</p>", "metacritic": null, "released": "2022-03-06", "tba": false, "updated": "2022-03-07T06:01:52", "background_image": "https://media.rawg.io/media/screenshots/a2c/a2ce64dea2244bfb26e5b8c907ad92bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Snagultoof"], "genres": ["Educational", "Platformer"], "publishers": [], "esrb_rating": null}