{"id": 751059, "slug": "fortnight-z", "name": "Fortnight Z", "name_original": "Fortnight Z", "description": "<p>WASD/Arrows - Move Mouse - Look Around Click/Space - Shoot, Use Item, Eat E - Pick up, Interact Q - Drop F - Build 1,2,3,4,5,6 - Switch Item Z - Emotes (Online) B - Get Unstuck from a wall! L - Leave Modes In the Lobby you can view your Stats, equip your skins and gliders, and even buy and sell a plethora of skins and gliders in the shop. To buy things, you need to save up Zaps-Coins, which you get by playing well in battle. It's important that you save your progress - You can Save and Load your data any time, by save code, with the Save+Load buttons. To get to the good stuff, click the big button in the bottom right - it will display one of 3 Gamemodes, which you can switch between by pressing the Change button above Play. There are 3 Gamemodes: Battle, Exploration, &amp; Online. - Battle Royale is a 25-player offline (bots) face-off, dropping from the Tac-Z onto the main island, gather items, fight with them, and try to be the last man standing before the purple storm closes in. - Exploration sends you into the same main island, but there are no other players and no storm. You're free to experiment and do whatever you want in this mode. - Online Playground is a Cloud Multiplayer where you can mess around with other players using a selection of items that are independent between players. </p>\n<p>       The skins and gliders you equip will be shown online. - Love, favorite, follow - If you have questions, suggestions for future things, or bug fixes, please comment them! :)</p>", "metacritic": null, "released": "2022-03-05", "tba": false, "updated": "2022-03-07T06:26:33", "background_image": "https://media.rawg.io/media/screenshots/257/25759afc1ff9d67810d82dc81e951dde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jayfeatherpro"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}