{"id": 75108, "slug": "habbo-virtual-world", "name": "Habbo - Virtual World", "name_original": "Habbo - Virtual World", "description": "Habbo – Chatting, Role playing , Craft and Trade in an EPIC pixelated virtual world!<br/><br/>Habbo, the EPIC social, trading, crafting and building MMO game is available on your iPhone and iPad device!<br/><br/>Take your friendships and creations wherever you go, role-play on the move and take part in live events wherever you are. <br/><br/>With stunning pixel art graphics and a gigantic community of more than 3 million, Habbo provides an immersive virtual world where you can chat, build, trade, craft and participate in challenges and games.<br/><br/>Personalisation<br/><br/>Decide how your avatar looks, choose from extensive fashion lines to make them unique and create your own space to show off to your friends. Habbo puts all this freedom in your hands. <br/><br/>Social<br/><br/>Habbo is the largest teen chat network on the planet! Meet new people and make new friends, plus with numerous user created groups like Builders’ Club, the Army, Mafias, Hospital and Hogwarts, there really is something for everyone.<br/><br/>Master Builder<br/><br/>More than 300 million rooms have been built in Habbo, with players using a variety of furni and pixel items to create their dream spaces. The only limit is your creativity!<br/><br/>Become 'Habbo Rich’! <br/><br/>Habbo has a huge live marketplace for players to trade their way to Habbo richness. Regular release of limited edition and rare items means the trading floor it always busy. Buy low, sell high!<br/><br/>OTHER:<br/>Competitions such as quizzes, quests and other live events<br/>Create your own store to trade with other Habbos<br/>Weekly items updates and additions<br/><br/>We have tools to monitor all text 24/7 across our platform, and all areas of Habbo Hotel have a word filter which removes offensive words from being seen<br/><br/>Requirements: Requires iOS 8.0 or later. Compatible with iPhone, iPad, and iPod touch. This app is optimized for iPhone 5, iPhone 6, and iPhone 6 Plus.<br/><br/>Contact: https://help.habbo.com/anonymous_requests/new<br/>Support: https://habbohelpen.zendesk.com/entries/88483687-Habbo-on-iPhone-iPad<br/>Privacy Policy: https://help.habbo.com/entries/23029106-Privacy-Policy <br/>Terms of Service: https://help.habbo.com/entries/23027093-Terms-of-Service", "metacritic": null, "released": "2014-05-27", "tba": false, "updated": "2023-12-08T06:50:13", "background_image": "https://media.rawg.io/media/screenshots/d29/d29fdb45f85ed9c20e1d986c99c6163b.jpg", "website": "", "rating": 4.1, "rating_top": 4, "added_by_status": {"owned": 5, "beaten": 6, "dropped": 5, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 10, "platforms": ["Web", "iOS"], "developers": ["Sulake Corporation Oy"], "genres": ["RPG", "Simulation"], "publishers": ["Sulake Corporation Oy"], "esrb_rating": null}