{"id": 751048, "slug": "outer-zach-winn", "name": "OUTER (Zach Winn)", "name_original": "OUTER (Zach Winn)", "description": "<p>This is a game about the inner struggles of being queer and the effect being closeted has on the mental health of an individual.</p>\n<p>The tone of this game is approachable and simple so even if you don’t play video games, you can play this one. Think of it as an interactive storybook! The entire experience takes 15-20 minutes. I wanted the message to be understandable and accessible to all individuals in all walks of life. From young children to the young at heart, it’s important for everyone to know just how much of an impact we all have on those that are unfortunately shunned in our society, regardless of if their struggles are loud or silent.</p>\n<p>This is a very personal project for me. For those of you that don’t know, I am a gay male. While I have been “out” for many years, I have never shared my experiences completely open and fully honest before with the public. Video game development has opened up a new avenue for me as a form of expression. I am always inspired by the bravery of others in the LGBTQIA+ community as they share their stories with others, and I have always wanted to add my voice to this important cause. All of their words, and my own, are important and needed if we intend to continue to develop our world towards the better. Please, I invite you to bring your families, your friends, yourself, to experience this story and come to your own conclusion.</p>\n<p>Enjoy!</p>", "metacritic": null, "released": "2022-03-06", "tba": false, "updated": "2022-03-07T06:21:29", "background_image": "https://media.rawg.io/media/screenshots/f4e/f4e631154edf662b8cf46bbd1fed04f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zach Winn"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}