{"id": 7511, "slug": "mental-hospital-iii", "name": "Mental Hospital III", "name_original": "Mental Hospital III", "description": "Mental Hospital III, is a first-person survival horror with astonishing graphics and a really frightening atmosphere.<br/><br/>Our story started quite ordinary. The main character got an offer to record a video of a special forces raid in one of the psychiatric hospitals where secret experiments were supposed to be carried out. Sounds easy enough… That was what he thought.<br/><br/>But he will forever remember that night. The night everything went wrong from the very beginning: Horrible weather, problems on the news, and the car breaking down appeared to be inevitable, as was missing the start of the clinic capture operation. Having arrived at his destination late, the main character decides to find Lieutenant Sidorov as soon as possible, hoping to film at least something. After the main character gets inside of the hospital and is introduced to it's inhabitants he understands that it will be nearly impossible to describe what he saw there. You can of course erase the footage, but there is no option to erase your memories.<br/><br/>This is reality. Will the main character emerge from this fateful hospital alive, or will he too, like it's residents, be trapped here for the remainder of his life.<br/><br/>● ● ●<br/><br/>▶▶▶ Awesome game with awesome graphics also SCARY (by Kodeman 956)<br/><br/>Awesome game! With great graphics too. Also SCARY as heck! So should definitely make a mental hospital 3.<br/><br/>▶▶▶ Best horror game up to date! (by (PeaceWalker))<br/><br/>Really amazing detail, graphics, frame rate and response time, as well as storyline and new technique like hiding in doors and a sprint button. Many levels required me to think before I could pass. That girl at the end of the first level scared the living hell out of me! Great great app I recommend it to people who like First person horror games.<br/><br/>▶▶▶ Awesome (by Axkontn611)<br/><br/>Awesome game 10/10<br/><br/>● ● ●", "metacritic": null, "released": "2014-12-09", "tba": false, "updated": "2019-10-22T14:29:24", "background_image": "https://media.rawg.io/media/screenshots/ba0/ba079acca32af96d5c751b0fc8771590.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["AGaming+", "Igor Migun"], "genres": ["Action", "Adventure"], "publishers": ["Igor Migun"], "esrb_rating": null}