{"id": 7512, "slug": "sacred-legends", "name": "Sacred Legends", "name_original": "Sacred Legends", "description": "Sacred Legends is an epic fantasy RPG that &amp;quot;does a wonderful job bringing the series to a small screen&amp;quot; (Pocket Gamer). Explore the dungeons, rule the battlefield and dominate the PvP arena!<br/><br/># # #   BEFORE YOU ENTER THE FIGHT, CHECK YOUR HARDWARE   # # # <br/>Attention: iPhone 4S (or older), iPad 2 (or older), iPad mini 1 (or older) and iPod touch 5 (or older) are not supported.<br/><br/># # #   FIGHT ALONGSIDE FRIENDS &amp;amp; RULE SUPREME IN PVP   # # #<br/>Free the ill-fated realm of Ancaria from the tight grip of demonic oppressors. Team up with your fellow players to form hard-hitting parties. Benefit from your companions’ progress and experience as you face monsters, necromancers and other henchmen in normal, veteran and elite campaigns. Or stand your ground in the PvP arena to make your name known throughout the kingdom.<br/><br/># # #   ALL THAT IS SACRED BECOMES LEGEND   # # #<br/>When the Gates of Hell are opening, true heroes must rise to save Ancaria! Fight gruesome monsters, collect epic loot, forge magic items and become a powerful hero in Sacred Legends, the brand-new mobile multiplayer game based on the popular fantasy RPG! <br/><br/># # #   VALIANT VALUES   # # #<br/>• An epic RPG: Play the new Sacred game on your smartphone and tablet<br/>• Real-time combat in 3D: Use a unique skill system to defeat gruesome enemies<br/>• Embedded asynch. multiplayer: Recruit your friends to join your party<br/>• Flexible character development: Shape your hero, loot powerful gear and forge epic items <br/>• Three distinct character classes: Play as seraphim, warrior or archer<br/>• Explore Ancaria: Undiscover a vast game world full of wonder and danger<br/>• Made for mobile: Enjoy addictive gameplay and apt touchscreen controls<br/><br/># # #   COSTS &amp;amp; REQUIREMENTS   # # #<br/>Sacred Legends requires at least iOS 7 and runs on iPhone 5 (or higher), iPad 3 (or higher), iPad mini 2 (or higher) and iPod touch 6. The app contains in-app purchases. If you do not want to use them, you can disable them in your device’s settings. <br/><br/># # #   OTHER DESTINATIONS   # # #<br/>• Deep Silver FISHLABS website: http://www.dsfishlabs.com/<br/>• Deep Silver website: http://www.deepsilver.com/ <br/>• Chimera Entertainment website: http://www.chimeraentertainment.de/", "metacritic": null, "released": "2016-08-24", "tba": false, "updated": "2019-10-22T14:29:23", "background_image": "https://media.rawg.io/media/screenshots/c0e/c0e7a6d1f2303ee59f3ade15e4b7b6e1.jpeg", "website": "http://sacredlegendsgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fishlabs Entertainment"], "genres": ["Adventure", "RPG"], "publishers": ["FISHLABS"], "esrb_rating": "Teen"}