{"id": 751473, "slug": "wasting-time-tylerdotdev", "name": "Wasting Time (tylerdotdev)", "name_original": "Wasting Time (tylerdotdev)", "description": "<p>Wasting Time is a game about fighting against time. The goal is to not let your clock hit zero before both of the grandfather clocks. You can only run away and defend against the clocks' attacks.</p><p>Art made by my wicked smart friend, Works.<br/></p>\n<p><strong>Directions</strong><br/></p>\n<ul><li>If time bombs hit your body, you lose 15 seconds on your clock</li><li>If you reflect a time bomb and it hits a grandfather clock, it loses 15 seconds on its clock</li><li>If your clock hits before the grandfather clocks do, you lose</li><li>If both grandfather clocks' time hits zero before you, you win.</li></ul>\n<p><strong>Controls<br/></strong></p>\n<p>WASD/Arrow keys to move.</p>\n<p>Space to dash</p>\n<p>Source code can be found here<br/></p>\n<p><strong>Retrospective<br/></strong></p>\n<p>I wanted to get way more done than I did here. Way more. I underestimated the amount of time it would take me to both learn rapier, and working with it in bevy.</p>\n<p>The idea was to have multiple types of attacks coming from the grandfather clocks. We also wanted to have multiple stages with other kinds of enemy clocks (eg. Atomic Clock, Doomsday Clock).<br/></p>\n<p>The shield was meant to be more of a short CD ability kind of thing, but kept putting it off. We have a lot more graphics made that I didn't have time to get in as well.</p>\n<p>We had sound and animations made as well that I didn't have time to put in.</p>\n<p>Overall I'm not satisfied with what I got done, but I did learn a lot and it pushed me to make a game start to finish in bevy.<br/><br/></p>", "metacritic": null, "released": "2022-03-04", "tba": false, "updated": "2022-03-07T08:11:08", "background_image": "https://media.rawg.io/media/screenshots/a63/a63fb4602b423cc9174ca1badbf10c3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["tylerdotdev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}