{"id": 75158, "slug": "bored-button-games", "name": "Bored Button - Games", "name_original": "Bored Button - Games", "description": "Discover many addictive games with every tap, save the games you love and build your own game list.<br/><br/>Tap the Bored Button and start your journey into series of games specially selected for you. Every game will try its chance to entertain you with their best features. If they succeed, you can play as much as you like and save it to your favorites for another time. But they may seem boring to you, in that case just tap the bored button again and it will give another game a chance to impress you. <br/><br/>Bored button has series of games specially selected for you to play with the extra luxury to change it anytime with just a tap. But do not be mistaken, you will not be downloading any of the games, you will be streaming them from our newly established fast servers. And they will always be available for you to play. <br/><br/>Also some of your most played games and some selected games are available for you to play offline.<br/><br/>Bored Button serves you large number of games which is increasing every week with new arrivals. You can play them only by tapping the Bored Button again. <br/><br/>There is no need to update for new games. <br/><br/>We are open for any suggestions and criticisms. Feel free to contact us for whatever you have in mind.", "metacritic": null, "released": "2017-03-29", "tba": false, "updated": "2019-07-29T07:01:01", "background_image": "https://media.rawg.io/media/screenshots/e92/e9282642b7a1326d033081faca654a42.jpg", "website": "http://gabblestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gabble Studios"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Gabble Mobile Teknoloji Anonim Sirketi"], "esrb_rating": null}