{"id": 751639, "slug": "faultsurfers", "name": "FAULTSURFERS", "name_original": "FAULTSURFERS", "description": "<p>Earthquakes around the world are opening cracks in the earth and swallowing cities! As a member of FAULTSURFERS, an elite squad of dudes with grappling hooks, your job is to save as many civilians as you can from the carnage. Good luck, and don't fall too deep!</p>\r\nHow to Play\r\n<p>The game is controlled using a mouse. By aiming and using <strong>left-click</strong> you can launch off of falling objects with your grappling hook. Use this to move around and keep yourself in the air! When charged (green cursor), you can <strong>right-click</strong> to perform a powerful mid-air dash towards the cursor. This can be used to gain lots of height or break debris before it knocks you down.</p>\n<p>You can also press <strong>F</strong> to toggle fullscreen mode, which may be handy for the web version!</p>\r\nScoring\r\n<p>The goal of the game is to get points by rescuing falling civilians. Grab them by touching them <em>or</em> grappling off of them. You'll get more points for grabbing civilians at lower depths. Grabbing multiple civilians in a row will start a<strong> combo,</strong> which multiplies your points while active. You can also dash through debris to increase and extend your combo value!</p>\r\nDanger\r\n<p>Going deep isn't just a good source of points--it comes at a risk. If you fall below a depth of 500m, <em>you will die!</em> Be sure to grapple debris as it falls to maintain your height, and don't forget that your dash can save you in a pinch!</p>\r\nCredits\r\n<p>Made for LÖVE Jam 2022. All code &amp; assets except for music were created by Hugues Ross during the jam.</p>\n<p>In-game music is \"Level 3\" by Juhani Junkala, released under CC0, downloaded from https://opengameart.org/content/5-chiptunes-action<br/></p>", "metacritic": null, "released": "2022-03-04", "tba": false, "updated": "2022-03-07T08:58:56", "background_image": "https://media.rawg.io/media/screenshots/3c5/3c562c435a52192fe008b2d30de4934a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["Hugues Ross"], "genres": ["Action"], "publishers": [], "esrb_rating": null}