{"id": 75172, "slug": "photo-finish-horse-racing", "name": "Photo Finish Horse Racing", "name_original": "Photo Finish Horse Racing", "description": "*** The best horse racing series on mobile! ***<br/><br/>Can you win the Cup and take the Crown of Horse Racing? The Quest has begun! <br/><br/>Hire a jockey, train your horse, and compete in a variety of races from a local derby all the way up to winning the quest for the Cup! Photo Finish Horse Racing is the ultimate horse race simulation, featuring lifelike animation, stellar graphics, addictive gameplay and intense competition. Live the life of a jockey, owner, and spectator in the Sport of Kings! <br/>Play a quick race in a spare minute, or battle your way through the major derby to win the Cup!<br/>--------------------------------------<br/><br/>CHAMPIONSHIPS:<br/>Breeder, Jockey, Cup Champion. Triple the roles, triple the fun. Be it all in Photo Finish Horse Racing!<br/>Have Kentucky dreams? Belmont ambitions? Intentions for Epsom? Start your racing quest now!<br/>Will you earn your crown as Champion? Breed a championship caliber horse to win <br/>Rise in ranks until the day comes – the day you race in the derby! Get to the stable and get going!<br/><br/>BREEDING: <br/>Develop your stable and breed the ultimate stallion!<br/>Do you have what it takes to be the best breeder? Breed the best to beat the best!<br/>Make your stable a haven for the fastest horses!<br/><br/>RACING EXPERIENCE: <br/>Triple your rewards in online stakes! <br/>Graphics so good you’ll think you’re racing in VR! <br/>Race every day to reach the haven of the success! <br/>Race online against players from Belmont to Epsom!<br/><br/>TESTIMONIALS: <br/>Lloydo 2000 – “fantastic game, honestly the best I’ve played on my phone.”<br/>Hannabooba – “This game is amazing if you haven ‘t downloaded yet, go download now”<br/>Jungnshjej – “I love how you can breed the horses and enter contests”<br/>Oh My Gosh Shelby A Wolf – “OH MY GOSH LUV IT!!!”<br/>Hemlock Stable – “I love every aspect of this game”<br/>Matfat – “I’ve been playing this game every day for two weeks!”<br/>Spilla R. – “It is exactly like being in the Kentucky Derby, but being in it” <br/>Erica I. – “wish each tier of horse could have triple crown depending on their record for their season” – Added more races to every tier! <br/>Luke W. – “create your own jockey, name your horse, race others online, all this on a phone”<br/>Shah S. – “Best horse racing game I have ever seen in my lifetime”<br/>Miguel N. – “Fun chance to play all roles – jockey, trainer, breeder and owner” <br/><br/>Well, what are you waiting for? You haven‘t begun your quest for the crown! <br/><br/>--------------------------------------<br/>* PLEASE NOTE! Photo Finish Horse Racing is free to play, but it contains items that can be purchased for real money.<br/>Meet other players and find out more about Photo Finish Horse Racing:<br/>* Facebook: http://www.facebook.com/photofinishgame<br/>* Twitter: @photofinishgame (http://twitter.com/photofinishgame)<br/>* Privacy Policy: http://bit.ly/ThirdTimePRIVACY<br/>* Terms of Service: http://bit.ly/ThirdTimeTOS<br/>Note: Kentucky, Belmont, and Epsom are examples of cities and states our players have played in. No race takes place in Kentucky, Belmont, or Epsom. VR not supported, though we do love VR as much as the next VR enthusiast.", "metacritic": null, "released": "2015-08-20", "tba": false, "updated": "2019-07-31T08:01:04", "background_image": "https://media.rawg.io/media/screenshots/d2e/d2e65722558ecff93f798b07800df7d2.jpg", "website": "http://facebook.com/photofinishgame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Tilting Point"], "genres": ["Sports", "Racing"], "publishers": ["Tilting Point"], "esrb_rating": null}