{"id": 751780, "slug": "kick-the-critter-smash-him", "name": "Kick the Critter - Smash Him!", "name_original": "Kick the Critter - Smash Him!", "description": "<p>“Kick the Critter is funny, colorful and highly addictive - an excellent combination for any game to strive for.” Supergamedroid</p>\n<p>“I was surprised at how much time I spent with Kick the Critter – Smash Him! as it’s the kind of game that creeps up on you. I had burned through a battery by the time I reached the end of area two, and I had a blast getting there.” Slimgamer</p>\n<p>The Story<br />\nMr. Critter (Mr. C. for friends, if he had any) is a goofy little creature who lives in a colorful &amp; cartoony world. Once upon a time it started to rain and all the wacky little monsters had to flee from the upcoming flood. Most found safety on the ship of the Grumpy Old Guy, but some were left behind. And even though he asked politely, the Grumpy Old Guy refused to take Mr. Critter with him on his ship.</p>\n<p>So here we are... Mr. Critter is left behind and has to find his own way to the ship and show the Grumpy Old Guy he messed with the wrong wacko! Fortunately he finds himself a catapult in the shape of a gigantic boot (called &#39;The Kicker&#39;), and he&#39;s able to launch himself into the air. That&#39;s where you come in...</p>\n<p>The Controls<br />\nIt&#39;s your goal to keep Mr. C. in the air as long as possible, without slowing down and crashing into the ground. Our petite critter buddy has no wings, so he has to rely on other critters to stay airborne. The most convenient way to stay in the air is to smash into other wacky little monsters (called &#39;Batties&#39;) that he encounters in the sky. When you tab the screen, Mr. C. starts spinning like crazy and smashes into everything in front of him. When you hit something (like diamonds and monsters), Mr. C. bounces off and his speed and altitude will increase. Smashing into other flying monsters will not be enough, sometimes you have to bounce off the ground. Of course, this will reduce your speed and height. Fortunately there are boost / power-ups on the ground that can launch you again (like a super robot or a cannon). Mr. Critter will also find other creatures running on the ground whom he can use for even higher bounces.</p>\n<p>The Kicker<br />\nEvery game begins with launching Mr. Critter by kicking him with a giant boot (tough love?). Adjust the power and trajectory to launch our silly friend into the air. The Kicker can be improved by buying upgrades or unlocking new versions. You start out with a basic boot Kicker, but you can unlock a battering ram, cannon, ray gun etc. Use diamonds to purchase items in the store. These diamonds can be found throughout the levels and inside loot chests, which appear after a certain distance.</p>\n<p>Upgrade the kicker for:<br />\n- Better accuracy when aiming<br />\n- Powerful kicks<br />\n- Extra kicks, for when you&#39;re about to crash</p>\n<p>The Critter<br />\nUpgrading the Kicker will not fix all the problems for our wacky little monster. Give him upgrades and perks by collecting stars. These stars can be earned by reaching a certain distance or by leveling up. Higher levels will also unlock some foolish new passive skills.</p>\n<p>Upgrade Mr C. for:<br />\n- Increased bounciness and smashing skills<br />\n- More absurd boosts and power-ups<br />\n- Increased speed and altitude</p>\n<p>The Mini Games<br />\nThis goofy cartoon will keep you hooked due to the humorous gameplay and silly Mini Games. Unlock the following absurd, yet entertaining mini games by leveling up your critter:<br />\n- Floor is Lava<br />\n- you&#39;re drunk Mr. C.<br />\n- Soviet Critter<br />\n- Duck and Cover!<br />\n- Flappy Batty</p>\n<p>The Fun &amp; Giggles<br />\nKick the Critter – Smash Him is a goofy &#39;puzzle&#39; meets &#39;arcade&#39; kind of game with a colorful 2D art style and a fast-paced soundtrack. Smash your way through the air and confront the Grumpy Old Guy at the end. Prepare for launch. Power up. Aim. Kick. Bounce. And... pretend to fly!</p>\n<p>Do you like the game? Please vote or leave a comment.</p>\n<p>Why yes, we do use social media too. Give us a like or leave a message!<br />\nFacebook - https://www.facebook.com/VascoGames<br />\nTwitter - https://twitter.com/VascoGames</p>", "metacritic": null, "released": "2016-09-06", "tba": false, "updated": "2022-03-08T15:52:13", "background_image": "https://media.rawg.io/media/screenshots/7ca/7cacde5f7af95059870e7fd8004b178f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["VascoGames"], "genres": ["Arcade"], "publishers": ["VascoGames"], "esrb_rating": null}