{"id": 751796, "slug": "gyro-2015", "name": "GYRO (2015)", "name_original": "GYRO (2015)", "description": "<p>GYRO is a wonderfully simple yet fiendishly addictive arcade puzzle game like none you’ve ever seen before; a game of pure old school arcade beauty that serves up that ‘just one more go’ factor in spades.</p>\n<p>★ ★ ★ ★ ★</p>\n<p>&quot;Four game modes that offer something for everyone. Its difficulty is perfect for short sessions. Audio and visuals are basic, but fit well.&quot; - 4/5 - Gamezebo</p>\n<p>&quot;This arcade game is one of a kind with its amazing concept. It is a minimalist, retro game that mixes casual gameplay with gorgeous graphics and intuitive controls. Although GYRO may be considered somehow simple, it doesn’t take away its greatness.&quot; - 4.5/5 - Gamewoof.com</p>\n<p>&quot;Definitely download it. It’s fun, simple to play, highly addictive and free! If you like your games casual, well designed and addictive, this is absolutely the game for you.&quot; - 5/5 - Antroidtapp.com</p>\n<p>&quot;They must be drinking some special vodka because they’ve given the world a stonking good bit of fun. Bizarrely addictive!&quot; - 4/5 - Androidgamesreview.com</p>\n<p>&quot;It shines for its simplicity which adds to the beauty of this game, not only is it very addictive and fun, but it also looks great. It’s one of those games that you don’t want to uninstall because you keep coming back to it, even if it is for a quick round.&quot; - 4.5/5 - Androidspin.com</p>\n<p>★ ★ ★ ★ ★</p>\n<p>Use one finger to rotate the multi-colored wheel 360 degrees whilst making sure that the colored balls flying onto the screen land in the matching part of the wheel. Sounds easy? Throw in more balls and increasingly faster speed over time and GYRO becomes a fast-paced game of skill and nerves, urging you to collect power-ups, rack up massive scores and last as long as you can whilst your skills are tested to the absolute max!</p>\n<p>Key Features:<br />\n- Beautifully simple controls and design<br />\n- Incredibly addictive arcade gameplay<br />\n- Gazillions of points to collect<br />\n- Arcade, Time Attack, Hardcore and Challenges game modes<br />\n- Unlockable color sets and 8-bit sound set<br />\n- Online Leaderboards and Achievements</p>\n<p>Become our fan on Facebook:<br />\nhttps://www.facebook.com/subpixels/</p>\n<p>★ ★ ★ ★ ★</p>\n<p>Permission &#39;READ PHONE STATE AND IDENTITY&#39; - Quote from Swarm website: Allows Swarm to prevent fraud and create a secure environment (no personally identifiable information is used). Is announced to be removed in the next version of Swarm.</p>", "metacritic": null, "released": "2015-07-16", "tba": false, "updated": "2022-11-02T20:37:15", "background_image": "https://media.rawg.io/media/screenshots/af0/af00844f3ab0ef8e53edff6edac8dc52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["SUBPIXELS"], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}