{"id": 75176, "slug": "jeep-drive-traffic-parking-simulator-car-driving", "name": "Jeep Drive Traffic Parking Simulator Car Driving", "name_original": "Jeep Drive Traffic Parking Simulator Car Driving", "description": "Let's have a drive with most challenging hurdles and experience the thrill of driving with \"Jeep Drive Rally Traffic Parking Simulator\" and have some crazy FUN!<br/><br/>It is the most addictive driving and parking game that puts your driving awareness and dexterity to the ultimate test.<br/><br/>Become an elite driver in this ultimate street jeep racing game. Beware of Hurdles and Test your driving skills.<br/><br/>Jeep Drive Rally will give you hours upon hours of entertainment. So hold onto your real-life driving skills today! Download Now \"Jeep Drive Rally Traffic Parking Simulator - Real car Driving Test Racing Game\" and test your skills...<br/><br/>Game Features Include!<br/>• Massive open world for unlimited Jeep Driving, drive around freely<br/>• Many different tracks and obstacles<br/>• 3D environments with bus stops, amazing Jeep Rally and realistic traffic<br/>• Simple simulator controls of your choosing<br/>• Responsive Gameplay<br/>• Realistic pile ups, crashes, overthrows, push outs and deformations<br/><br/>Have Fun!!!<br/><br/>Leave a review and rating to let us know what you think about this game. We would really appreciate your rating…<br/><br/>Download Now and don't miss our amazing updates!<br/><br/>We always try to give our best and exciting mobile games for users on AppStore...", "metacritic": null, "released": "2016-09-16", "tba": false, "updated": "2019-10-22T14:05:55", "background_image": "https://media.rawg.io/media/screenshots/b87/b87c276badca68854007fa87a4811c57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atta Ur Rehman Riaz Ahmad"], "genres": ["Simulation", "Racing"], "publishers": ["Atta Ur Rehman Riaz Ahmad"], "esrb_rating": "Everyone 10+"}