{"id": 751781, "slug": "rpg-hero-story", "name": "RPG Hero Story", "name_original": "RPG Hero Story", "description": "<p>Enter a massive fantasy world filled with magic, danger, heroes and legendary creatures as you battle for supremacy in this mix of RPG, bubble shooter and puzzle!  Compete with other players, make new friends, and use teamwork and strategy to create the strongest alliance!</p>\n<p>Three kingdoms battle for absolute dominance in this action-packed mix of RPG and bubble shooter.  Explore a vast and colorful world filled with mighty gods and fearsome monsters!  Choose your brave warrior from 18 different heroes.  Prepare your hero to use a unique gem puzzle battle system.  Connect three or more gems of the same type during the gem phase to strengthen your hero and ensure victory during the battle phase.  Pick up various magic items and equipment, and learn powerful skills.  Join or create your own alliance, and participate in events such as boss raids and Alliance Wars or become a loner and test your strength against other players in the PvP arena!</p>\n<p>An epic adventure awaits you!</p>\n<ul>\n<li>\n<p>Exciting gameplay mixing RPG, bubble shooter and puzzle</p>\n</li>\n<li>\n<p>12 unique Heroes to choose from and 6 more to unlock!</p>\n</li>\n<li>\n<p>Over 200 items and 70 skills to discover and obtain</p>\n</li>\n<li>\n<p>Compete with other players in the PvP arena - Use powerful skills to turn the tide of battle in your favor</p>\n</li>\n<li>\n<p>Connect gems during the Gem phase to upgrade your hero</p>\n</li>\n<li>\n<p>Make combinations to strategically link gem sets</p>\n</li>\n<li>\n<p>Chat and discuss tactics with other players online - A unique Alliance system with Alliance versus Alliance functionality</p>\n</li>\n<li>\n<p>Wonderful artwork with vivid graphics</p>\n</li>\n<li>\n<p>Captivating fantasy music</p>\n</li>\n</ul>\n<p>** Please note that although the application is free, it contains content paid for real money that the user may wish to purchase to enhance the gaming experience.  You can control the in-app purchases made within this app using password protection which can be enabled on the app&#39;s setting page of the Google Play Store.</p>", "metacritic": null, "released": "2014-06-04", "tba": false, "updated": "2022-03-08T15:55:42", "background_image": "https://media.rawg.io/media/screenshots/c8e/c8e527be417a736c03abaaee9d52a187.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["iCandy Games"], "genres": ["RPG"], "publishers": ["iCandy Games"], "esrb_rating": null}