{"id": 751790, "slug": "dragon-tale-fantasy-shooting-rpg", "name": "Dragon Tale - Fantasy Shooting RPG", "name_original": "Dragon Tale - Fantasy Shooting RPG", "description": "<p>Dragon Tale is the game inspired by classic arcade shooting games.  Join this legendary adventure and explore incredible levels as you face relentless and challenging enemies on a quest to rescue stolen dragon eggs.  Play Dragon Tale now and help the dragons!</p>\n<p>Brave the dangers of the Plain, Forest, River, Cave and Volcano.  Face off against Griffins, Wasps, Puffers, Bats, Goblins and a powerful boss in each stage.</p>\n<p>What are you waiting for?  Playing Dragon Tale is simple and fun!  Drag your dragon across the screen to move it and avoid enemies.  Hit enemies to defeat them and collect stars to earn points.  Use gold to unlock new dragons!</p>\n<p>SPECIAL DRAGONS</p>\n<p>Choose dragons with unique abilities to play with:</p>\n<p>• Blaze - This is a versatile dragon, a great choice for beginners</p>\n<p>• Nemo - This dragon is powerful but doesn&#39;t have many lives</p>\n<p>• Bub &amp; Bob - Twin dragons with the best firepower among all dragons</p>\n<p>• Rocky - An earth element dragon with a wide range</p>\n<p>• Draco - A black dragon with powerful fire powers</p>\n<p>• Flora - A dragon fairy who shoots beautiful magical flames</p>\n<p>• Spike - This is a skeleton dragon with ghostly powers</p>\n<p>• Drake - A tough-to-kill dragon with an immense pool of lives</p>\n<p>HIGHLIGHTS</p>\n<p>• Three types of modes: normal, hard and expert</p>\n<p>• Classic arcade shooter game</p>\n<p>• Multiple characters with unique abilities</p>\n<p>• Challenging enemies</p>\n<p>• Giant stages with amazing illustrations</p>\n<p>Attention!  This game is free to play but contains items that can be purchased for real money.  Some extra features and items mentioned in the description can also be purchased for real money.</p>", "metacritic": null, "released": "2015-10-17", "tba": false, "updated": "2022-03-08T20:47:47", "background_image": "https://media.rawg.io/media/screenshots/ff9/ff9596d596c8e2609e6d7ddd1ac242e7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Tapps Games"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}