{"id": 751832, "slug": "defense-rpg", "name": "Defense RPG", "name_original": "Defense RPG", "description": "<p>[Game outline]<br />\nDefense RPG is the simulation RPG which repulses the monster which strengthens a country with the system of a turn system strategy simulation game, and is called Evil Beast with the combat system of RPG of a turn system.</p>\n<p>A unit is composed and raised from nine occupations, it defends by strengthening a rampart, the income is raised in strengthening of the country by internal affairs, and the more powerful equipment for a unit is purchased by dealings.<br />\nAll Evil Beast periodically attacked to a castle are the boss character classes, and are 30 or more kinds.<br />\nEvil Beast more powerful as it repulses, of course attacks.<br />\nIn order to repulse, a unit must be raised and 100 or more kinds of items and 60 or more kinds of skills must be utilized.<br />\nEvil Beast cannot be won only by advancing the turn.<br />\nFor what is the gold which enters when the income and Evil Beast of every turn are repulsed used?<br />\nThe timing to which Evil Beast attacks whether a rampart is strengthened for whether it uses in order to increase an income more, or a unit is strengthened must be chosen at its own discretion, and a country must be strengthened.<br />\nMoreover, taking advantage of a unit&#39;s characteristic, it is necessary to perform sortie retreat and to oppose strategically in a battle.<br />\ncan bear how far Evil Beast attacked obstinately, or the attack of Evil Beast continues how far -- the fate of the Gendum country -- you -- it is order.</p>\n<p>[How to play]<br />\nA country is strengthened with a main screen.<br />\nIf a turn is advanced with an advance button, gold will increase by the income of every turn.<br />\nSince Evil Beast will attack if the turn is advanced, please repulse.<br />\nAn easy tutorial can be seen if it starts with a new game.</p>\n<p>[About advance mode]<br />\nIn an advance mode, it is the mode which usually added the following change to the mode.<br />\n- The physical strength of Evil Beast is strengthened for a while.<br />\n- It will become game over if repulse of Evil Beast goes wrong 3 times continuously.<br />\n- If it succeeds in repulse of Evil Beast, the material item for converting arms and a protector can be obtained.<br />\n- The arms and protector which are possessed from the warehouse of a dealings screen are convertible.</p>\n<p>[About bug report]<br />\nWhen a bug etc. are discovered, it will be saved if you can connect with the way of the bulletin board (BBS) installed in a nekosuko site (http://nekosuko.jp).<br />\nIt corresponds as promptly as possible.</p>", "metacritic": null, "released": "2014-08-31", "tba": false, "updated": "2022-03-09T00:45:13", "background_image": "https://media.rawg.io/media/screenshots/398/398562f8ed58f7d65bee868670cc3b60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": [], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}