{"id": 751825, "slug": "eredan-arena", "name": "Eredan Arena", "name_original": "Eredan Arena", "description": "<p>BECOME THE MASTER OF THE ARENA!</p>\n<p>Do you recognize me?  It&#39;s me, Amnezy!  I am the owner of this beautiful arena you see around you... Surely you are wondering what you are doing here.  Take a good look at the people around you: they will be your new combat companions.  On the other side of the arena, a team awaits you, ready for battle.</p>\n<p>It&#39;s up to you to make your team win!</p>\n<p>Amnezy, a young woman who has been mistreated by the clans, demands revenge.  She has found a way to kidnap the most iconic of this world&#39;s heroes and is intent on avenging the wrongs she has suffered by having them fight in the center of her arena.  Thus, characters from formerly enemy clans will have to collaborate and characters from the same clan will meet face to face.</p>\n<p>After the incredible success of EREDAN iTCG, FEERIK offers you its new collectible card game: ARENA EREDAN.</p>\n<p>In ARENA EREDAN, each player uses a deck of 5 cards to defeat their opponent.  Each card is a character that has useful characteristics to face the opposing character.</p>\n<p>A SIMPLE, RICH AND STRATEGIC GAMEPLAY</p>\n<p>Enable your characters&#39; abilities through the Dice system, a game mechanic based on a dice system, and win your battles!</p>\n<p>COLLECTIBLE AND EVOLVING CHARACTERS</p>\n<p>Discover a multitude of heroes divided into five different themed clans.  Each of these characters can evolve and gain power as you fight!</p>\n<p>AN ENGAGING UNIVERSE</p>\n<p>ARENA EREDAN evolves in the original universe and written by EREDAN, with five years of existence.</p>\n<p>PLAY AS MUCH AS YOU WANT</p>\n<p>In ARENA EREDAN, there is no limit to the number of matches you can play.  You might as well play just a few minutes or several hours!</p>\n<p>Follow us on Twitter @EredanArena</p>", "metacritic": null, "released": "2022-02-08", "tba": false, "updated": "2022-11-02T19:54:38", "background_image": "https://media.rawg.io/media/screenshots/b14/b14ddd80345cbe7934570076f6c46ce7.jpg", "website": "https://itcg.eredan.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Android"], "developers": ["Feerik"], "genres": ["Card"], "publishers": [], "esrb_rating": null}