{"id": 751860, "slug": "unity-chans-action-shooting", "name": "Unity-chan's Action Shooting", "name_original": "Unity-chan's Action Shooting", "description": "<p>This game is recommended for 2D side-scrolling jump action shooting game fan!<br />\nUnity-chan&#39;s objective is to defeat the eight boss.<br />\nIn support Internet Ranking, you can compete in the Unity-chan&#39;s Action Shooting RANKING.</p>\n<p>● Simple operation, Let&#39;s play this jump action shooting game!<br />\n● Let brilliant jump action using the movement keys and jump buttons!<br />\n● Jump force changes in the length and press the jump button. you can double jump, the degree of freedom that can be highly action!<br />\n● Unity-chan would be able to have eight shots.<br />\n● It is okay in the jump action shooting game beginner, you can get used to operation in order from a simple stage!<br />\n● The game as the second half, high technique is required! It is time to show your techniques!</p>\n<p>● You can shop at the point where accumulated in the game play! And get the useful items!<br />\n● Last stage in the world is a boss battle!<br />\n● When defeat the eight boss, new boss will appeared!!</p>\n<p>● Given a rank by score earned in each stage. Let&#39;s aim at &quot;ALL S RANK&quot;!<br />\n● Given a grade to a player from the evaluation of the stage you have ever played! Let&#39;s aim to &quot;十段&quot;!<br />\n● You can play the stage Once Played any number of times re-challenge! Many times trying to acquire a further high score by playing.<br />\n● If you are compatible Internet Ranking, It is hot high score competition with rival! Let&#39;s show your action technique in the world!<br />\n● You can also give the difference to other players by clearing the high difficulty daily stage!<br />\n● You will get the trophy by specific conditions are met! Also get further bonus points!<br />\n● Enjoy the character voice of &quot;UNITY-CHAN&quot;, &quot;ASSET-SAN&quot; and other</p>\n<p>Cast<br />\nMafuyu Hiiragi :UNITY-CHAN and other<br />\nMegumu Morino :ASSET-SAN and other</p>\n<p>This content is provided in the &quot;unity-chan license&quot;.<br />\nhttp://unity-chan.com/download/license.html</p>", "metacritic": null, "released": "2019-07-07", "tba": false, "updated": "2022-03-09T11:53:08", "background_image": "https://media.rawg.io/media/screenshots/7ae/7aecd4088d5570611ab068d7efe879dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["EZDAEMON"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}