{"id": 751898, "slug": "dark-dot-unique-shoot-em-up", "name": "Dark Dot - Unique Shoot 'em Up", "name_original": "Dark Dot - Unique Shoot 'em Up", "description": "<p>FORMATION BASED ACTION SHOOT &#39;EM UP (SHMUP)<br />\nDark Dot is an unique vertical scrolling action shooter (SHMUP) that allows you to draw and manipulate your very own army of Darklets using formations. You&#39;ll find familiar SHMUP controls alongside unique features and characters that will enhance your gameplay experience like no other!</p>\n<p>DRAW, RESIZE &amp; ROTATE<br />\nYou can Draw, Resize and Rotate to manipulate your formations and shoot to eliminate all who would stand in your way! Dark Dot takes drawing to a brand new level with easy to use controls and manipulation.</p>\n<p>•Draw any shape -- Unleash your creativity! Conquer the levels using a circle, square, a cat or an unicorn! The possibilities are endless!<br />\n•Resize -- Shrink your formation to focus fire or expand to widen the range covered. Customize your play style like no other!<br />\n•Rotate -- Maneuver around obstacles or rotate to avoid projectiles! Do it like a pro!</p>\n<p>STORY MODE: OVER 100 LEVELS<br />\nPlay and challenge over a hundred levels in Dark Dot to take over the Elemental Worlds! Find out why Dark Dot is doing what it&#39;s doing! Unlock all memory fragments!</p>\n<p>OVER 80 UNIQUE DARKLETS<br />\nCollect and upgrade or evolve over 80 unique Darklets, each with their very own skills and power.<br />\nUnlike other shoot &#39;em ups, you can get special Darklets like the Pandarklet and the Azure Dragon Darklet, each more unique then the other and watch them lead your army to victory. That&#39;s right! No planes here. Only cute and unique Darklets!</p>\n<p>UNLEASH THE ELEMENTAL POWERS<br />\nThere are 9 Elemental Darklet types that you can equip to your team, each with a different power! Just like any other SHMUP you&#39;re used to, customize your attacks and use them to your advantage!<br />\n•Dark - Moderate range of Projectiles<br />\n•Air - Homing Projectiles<br />\n•Electric - Electric Energy that flows from Darklet to Darklet, damaging anything that gets between them<br />\n•Fire - Short range but widespread Rapid Flames<br />\n•Magma - Leaves a trail of Magma, damaging enemies upon contact<br />\n•Earth - Very short range, deals damage to all direction and also blocks enemies&#39; Projectile<br />\n•Mud - Moderate range and blocks enemies&#39; Projectile<br />\n•Water - Fixed range, concentrated attack that shoots over obstacles<br />\n•Ice - Ice shards that re-bounce and break into smaller shards upon first contact</p>\n<p>ENDLESS MODE &amp; MORE<br />\n•Endless Mode -- Top the leaderboards and show &#39;em who&#39;s the King!<br />\n•Powered Boss Mode -- Daily Boss Fights with big rewards!<br />\n•Daily Loot Runs -- Gather rare resources and level up your team!</p>\n<p>Lead your Darklets and conquer the world!!!</p>\n<p>NEW FEATURE<br />\nThe Darkest of Terrors has learnt to channel his powers through the Sigil! The Powers grow stronger the more Darklets you obtain (via Morphing or via any other channels) and Evolve.</p>\n<p>Powers that grow:<br />\n- Extra shields at the start of the stage<br />\n- Having Darkness Break at the start of the stage<br />\n- Getting shield per Darkness Break gained<br />\n- Increasing Darkness Break Limit</p>\n<p>See the new D.O.T tab under &#39;ABILITIES&#39; for more information!</p>\n<p>Support<br />\nIf you&#39;re facing any problems, please send us a message at support@inzenstudio.com! We&#39;ll send help asap!</p>", "metacritic": null, "released": "2019-04-19", "tba": false, "updated": "2022-03-09T23:39:07", "background_image": "https://media.rawg.io/media/screenshots/837/837622fe079dd6867eba2c0a63e940ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Inzen Studio", "iCandy Games"], "genres": ["Shooter"], "publishers": ["INZEN STUDIO PTE", "iCandy Games"], "esrb_rating": null}