{"id": 751873, "slug": "dan-mu-nojian", "name": "弾幕の檻", "name_original": "弾幕の檻", "description": "<p>The barrage cage is a &quot;barrage shooting game&quot;. There is no charge and you can play for free. Please enjoy the geometric and beautiful barrage.</p>\n<h2>The barrage game has the impression that it is &quot;difficult&quot;, but this app has a mode that even beginners can enjoy. Please try it out!</h2>\n<p>Observation mode:<br />\nIt is not a game in the mode of observing the enemy&#39;s attack.</p>\n<hr />\n<p>Normal mode:<br />\nIt is a mode to compete for points. You will get a high score if you &quot;destroy only the core&quot; without destroying the turret or sub-core.</p>\n<hr />\n<p>Flashy mode:<br />\nThe enemy will attack with full power from the beginning.</p>\n<hr />\n<p>Kouha mode:<br />\nIn this mode, you can only hit the core of an enemy ship (you cannot destroy the sub-core or turret). It&#39;s sober, but the difficulty is the highest.</p>\n<hr />\n<p>Endurance mode:<br />\nFrom the beginning, the enemy hits the core with all his might and there is only a judgment. Moreover, the durability is 4 times the normal mode for advanced users.</p>\n<hr />\n<ul>\n<li>This game is compatible with the &quot;tilt sensor&quot;, and you can change the direction of the shot according to the tilt of your smartphone. This function is turned off by default, but if you are interested, please turn on &quot;tilt detection&quot; on the &quot;setting screen&quot;.  </li>\n</ul>\n<p>● There are 3 types of own machines, and the shields and usable items are different.</p>\n<hr />\n<p>Orange：<br />\nIt is an aircraft for beginners equipped with automatic aiming. The defense performance is high, the shield is 5 and the item is barrage deleted at the maximum.</p>\n<hr />\n<p>Indigo：<br />\nSince there are many shots with 4 rays and a wide angle of fire, you can damage the enemy even if you concentrate on avoidance. Items are decoys and attract bullets aimed at their own aircraft.</p>\n<hr />\n<p>Violet：<br />\nShots are usually 3 rays, but you can increase them to 5 by using items. It is an aircraft for advanced users with only one shield.</p>\n<hr />\n<h2>● For advanced users</h2>\n<p>For advanced barrage players, even the most difficult &quot;Kouha mode&quot; may not be enough. In that case, please compete with other people for the high score in &quot;normal mode&quot; (compatible with Game Center).<br />\nThe point to get a high score is to destroy only the core without destroying the turret or sub-core (additional points will be added by the remaining number of turrets and sub-cores).<br />\nDefeating only the core is quite difficult.</p>\n<hr />", "metacritic": null, "released": "2020-04-13", "tba": false, "updated": "2022-03-09T20:51:35", "background_image": "https://media.rawg.io/media/screenshots/176/1769333a7d62f0ad6b7dba4da9e2cf25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": [], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}