{"id": 751800, "slug": "star-crush-2", "name": "Star Crush", "name_original": "Star Crush", "description": "<p>Star Crush is a simple little game that will keep you busy and annoyed for hours. Rules are simple: crush / destroy as many stars as you can by clicking them in groups of the same color (2 or more). Sounds easy? It is! Ain’t this the greatest game ever? We think so :)</p>\n<p>More stars you destroy at once the higher score per star you will get. Group as many stars of the same color together to crush them at the same time to receive highest scores. If you need to destroy a single star you need to use a rocket to do so. But rockets are limited so make sure to calculate the best possible way to clear the level before using any.</p>\n<p>Instructions: Destroy all the stars by clicking them in groups of the same color. You need to use a rocket if you want to remove a single star.</p>\n<p>You can also compare your score with your friends or others playing Star Crush.</p>\n<p>Star Crush is available for Android phones and tablets!</p>\n<p>Star Crush features:<br />\n- Eye candy graphics to keep you excited<br />\n- Leaderboards to compare score with your friends and others<br />\n- Amazing sound effects that can be turned ON/OFF on demand<br />\n- Challenging levels<br />\n- 500+ levels, saga never stops, how many can you solve?</p>\n<p>Thank you for downloading Star Crush. Please share it with others to help us develop more awesome games and apps!</p>", "metacritic": null, "released": "2014-06-11", "tba": false, "updated": "2022-03-08T22:06:05", "background_image": "https://media.rawg.io/media/screenshots/f92/f92430b1d02e435dca70aaab558374cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Classic Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}