{"id": 751827, "slug": "1000-ways-to-die-in-a-circle", "name": "1000 ways to die in a circle", "name_original": "1000 ways to die in a circle", "description": "<p>The best Cirle runner</p>\n<p>A fun and addictive runner games app with cool game elements right in your pocket.</p>\n<p>Bump through the circle and avoid the deadly assassin spots by jumping from wall to wall.  Collect gems and tap points to get points.  But be aware - Every time you touch a point the playing forms do a complete u-turn.  Sometimes you run, sometimes the circle spins, and sometimes a circle suddenly disappears.  Stay cool!  Depending on the game mode you also have to switch between jumping and changing gravity in the same race.  Another point suddenly changes the position of the spikes or let it run the other way around.  Bumb your way through obstacles and feel the Zen in you.</p>\n<p>Did you want to reach 100 points yet?  Don&#39;t be shy and share your best points with your friends.  Become the best of the best!</p>\n<p>Make them work - ARCADE FUN</p>\n<p>The higher the points you reach the faster the game runs then the harder it becomes to avoid those dumb spikes.</p>\n<p>Crash and dash through the orbit and enjoy the ever-changing color modes while trying to beat your latest highscore again Stay calm like a Zen master to stay focused.</p>\n<p>Your jewelry gains increase in stages after reaching 20, 40 or 60 points at two, three and four.</p>\n<p>Make them run and die or die trying!</p>\n<p>Build your own BLOB FARM</p>\n<p>After conquering this dumb ring of death for the sake of collecting gems, it&#39;s best to take a rest from your journey and these impossible to overcome killer spikes and jump over your slime farm.  Improve your appearance or collect more jelly.  No need to stick with the same hero all the time - Free other cool heroes stand in line waiting to be unlocked like the awesome Mr &amp; Mrs Jelly, Spike Eater or Poopy.  Collect jelly by tapping your blobs and buy more characters or just watch a video.  No joke, these drops are dumb enough to jump into this cursed circle to find their own ways to die!</p>\n<p>Upgrades can be purchased through Farm Gems and unlock fun and beautiful environment for the jelly army, including background decor like birds and clouds, a house and even a ketch!</p>\n<p>APP RESOURCES</p>\n<ul>\n<li>\n<p>Fun &amp; cool game play with changing orbital phases</p>\n</li>\n<li>\n<p>Addictive Arcade Video Games Action</p>\n</li>\n<li>\n<p>Stylish flat art</p>\n</li>\n<li>\n<p>Unlock dumb and amazing heroes</p>\n</li>\n<li>\n<p>Free the Jelly and build a farm for your blobs</p>\n</li>\n<li>\n<p>Spikes!  Don&#39;t touch them!</p>\n</li>\n<li>\n<p>Google Play Services - Achievement and Leaderboard Support to compete for points</p>\n</li>\n</ul>", "metacritic": null, "released": "2015-04-21", "tba": false, "updated": "2022-03-09T00:38:49", "background_image": "https://media.rawg.io/media/screenshots/553/5537ee1c3eef64f556b1dca5b6b7d313.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": [], "genres": ["Arcade"], "publishers": [], "esrb_rating": null}