{"id": 751924, "slug": "baikoh-words", "name": "BAIKOH: Words", "name_original": "BAIKOH: Words", "description": "<p>Hey, human!  I&#39;m BAIKOH, and I&#39;m a wordplay.  Write words by tapping blocks that fall randomly from the top of the screen.  Each block has a letter, so... you&#39;re getting the idea, the genius.</p>\n<p>Type fast and constantly to destroy blocks and keep them at the top of the screen, or just use power-ups to make everything explode.  That will work too.</p>\n<p>The list of &quot;interesting things&quot;:</p>\n<p>• COMPLETELY FREE WORD GAME!  Yes, written in capital letters to get your attention, you narrow-minded human.</p>\n<p>• ONLINE BATTLES in real time.  Make your friends suffer by sending them bombs, boulders, freezing letters and much more.  The first to reach the top loses the game!</p>\n<p>• EARN BADGES with the power to cut, ignite and blow things up.</p>\n<p>• LEVEL UP!  The better you get, the more your words will win and the more you will suffer.</p>\n<p>• OBSESSIVELY MADE WITH LOVE by my human slaves: design, code, everything.</p>\n<p>• Sarcastic humor.</p>\n<p>• 100% candy-free application.</p>\n<p>• No pay to play, no pay to win.</p>\n<p>• IT&#39;S FREE!  What else do you want?</p>\n<p>Storage permission is to cache advertisements on SD memory card.  The reasons are:</p>\n<ol>\n<li>\n<p>To save internal storage space and save data when not connected to WiFi.</p>\n</li>\n<li>\n<p>More chances to watch rewarded ads (I confess that this benefits me more than you).</p>\n</li>\n</ol>\n<p>NO human, I don&#39;t want to peek into your files for self-excavations or embarrassing nudes.  For more information on what I do with your data read my &quot;Privacy Policy&quot;.</p>\n<p>FOLLOW ME ON FACEBOOK!  (That&#39;s an order, human!)</p>\n<p>www.facebook.com/playbaikoh</p>\n<p>I&#39;d really love to hear your suggestions and comments...totally.</p>\n<p>ANY QUESTIONS?  READ THE EXPERIENCES SECTION:</p>\n<p>www.playbaikoh.com</p>\n<p>...</p>\n<p>Seriously, has anyone actually read all of this?</p>", "metacritic": null, "released": "2021-11-30", "tba": false, "updated": "2022-11-02T18:50:14", "background_image": "https://media.rawg.io/media/screenshots/49e/49e0cd986aee80a726d12bb0733422e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android"], "developers": ["Mum Not Proud"], "genres": ["Arcade", "Puzzle"], "publishers": [], "esrb_rating": null}