{"id": 751923, "slug": "dan-mu-noqi-2", "name": "弾幕の器2", "name_original": "弾幕の器2", "description": "<h2>Barrage Vessel 2 is a &quot;barrage shooting game&quot; that captures enemies by making full use of 7 types of items. There are 100 types of enemies! .. You can enjoy 4 more modes!</h2>\n<p>● Common rules<br />\nYour ship is shielded and can withstand up to 4 damage. However, be aware that the damage will change depending on the type of enemy bullet (the larger the bullet, the greater the damage).</p>\n<hr />\n<p>● EASY mode<br />\nThe beginning is a tutorial. Check the text on the menu before trying.<br />\nEquipped with automatic aiming, you can concentrate on avoiding bullets relatively.</p>\n<hr />\n<p>● HARD mode<br />\nFrom here is the production. A barrage game with added puzzle elements. The point is to use items to weaken enemy ships.<br />\n○ For advanced users<br />\nIn HARD mode, the number of diamonds displayed in the menu changes depending on the situation at the time of clearing. The conditions for acquiring diamonds are as follows, and if you meet all the conditions at the same time, you can acquire 3 diamonds.<br />\n・ Capture the enemy<br />\n・ No damage at the time of capture<br />\n・ Timer is 0 or more at the time of capture<br />\nIf you can capture all the ships of the previous work, you can clear it with no damage, but you need to make full use of the items to capture it before the timer reaches 0.</p>\n<hr />\n<p>● HELL mode<br />\nA mode in which support aircraft are added instead of weapons not being available. I think that the difficulty level will increase, but I can clear it unexpectedly.</p>\n<hr />\n<p>● Lunatic mode<br />\nHELL mode is surprisingly easy, so I added it in a hurry. No weapons or support aircraft. Furthermore, since there is no shield, even one shot is over.</p>\n<hr />\n<p>The capture video has been uploaded to youtube. If you are stuck, please search on youtube for &quot;Burning vessel 2 capture&quot;.</p>", "metacritic": null, "released": "2020-11-22", "tba": false, "updated": "2022-03-10T01:11:48", "background_image": "https://media.rawg.io/media/screenshots/0d9/0d907dddeb9ac34a6349eb2bbea818fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 126, "game_series_count": 1, "reviews_count": 1, "platforms": ["Android"], "developers": [], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}