{"id": 751903, "slug": "ponami", "name": "Ponami", "name_original": "Ponami", "description": "<p>In the game you control Ponami, a young archer who defeats spiritual beings corrupted by human Wars.  The game&#39;s style mixes platforming with RPG elements.  As you progress, you&#39;ll equip items, level up, collect pets, defeat increasingly powerful bosses, and unlock the secrets of the Ponami universe about an evil that arose from a great war in the past.</p>\n<p>The game consists of 6 amazing worlds to explore, each with 8 stages, a boss, a secret temple and unique items per region.</p>\n<p>----- In the current version:</p>\n<p>The first and second worlds are available, 16 stages plus 2 Secret Temple, three pets and 42 items.</p>\n<p>----- Introduction</p>\n<p>Ponami is an RPG platform game that narrates the adventure of a young archer from the Cordillera de Sajor.  Ponami is the representation of struggle, resistance and pride of an almost extinct people who, through the struggle, remain strong and resistant.  With the initiative to face her fears, she decides to leave her home and follow the trails of the Forest of the Cordillera de Sajor.</p>\n<p>-----Description</p>\n<p>Side-scroller game made by fans of video games from the 90&#39;s, it has a progressive difficulty where it takes time to get used to the advanced stages.  The gameplay is unique, where the bow is controlled by a virtual joystick.  Amazing graphics, beautiful and inspiring, with unique themes in each world.  The soundtrack is charming that promotes the player&#39;s immersion in the environment of each level.</p>", "metacritic": null, "released": "2020-08-21", "tba": false, "updated": "2022-03-09T23:53:42", "background_image": "https://media.rawg.io/media/screenshots/e10/e109b4d6074fe567f595596135bdc4e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": [], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}