{"id": 752090, "slug": "aquarist-build-aquariums-grow-fish-develop-your-bu", "name": "Aquarist - build aquariums, grow fish, develop your business!", "name_original": "Aquarist - build aquariums, grow fish, develop your business!", "description": "https://store.steampowered.com/app/1244630/House_Builder__Build_all_over_the_world/<br/>https://store.steampowered.com/app/1137750/Farmers_Life__Farming_Simulator__farm_manage_survive/<br/><br/><h3>Hard task - hight reward </h3>Running an aquarium shop is a real challenge! Clients will entrust you with difficult tasks you have to cope with. In return, a reward awaits you. Intended for business development - buying new fish, exotic plants, a store or developing skills<br/><br/><h3>Recycling and ecology </h3>Every self-respecting entrepreneur cares about his business. Refurbishing and processing aquarium components will save you a lot of time and money and it's good for environment. <br/><br/><h3>Let your imagination run wild</h3>Create an aquarium in which each fish will want to live. Thanks to the variety of objects in the game, you can implement even the craziest ideas! A green, blooming oasis or raw, antique busts? The choice is yours.<br/><br/><h3>Underwater dance</h3>We provide you with many species of fish and freshwater plants. Your task is to create an ecosystem that is balanced and safe for the inhabitants of your aquariums. Remember that a slight deviation from the parameters necessary for the survival of one species may be crucial for the survival of another!<br/><br/><h3>A broad perspective</h3>Run your store the best you can! Take care of the exhibition, sell ready-made projects and carry out individual orders. In the heat of your duties, do not forget about your charges - you are responsible for ensuring their safety, health and food.<br/><br/><br/>THE PLOT<br/><br/>Create and observe Aqua World! Learn more about fish and their behaviour and take responsibility for their lives. Control the temperature, environment and nourishment to provide a suitable environment. Don’t forget to develop your aquarium and after a while you will be able to open an aquarist shop! <br/><br/>MAIN FEATURES<br/><br/>Set the aquarium of your dreams - plenty of fish, corals, algae and decorations to set up a perfect place for your pupils! <br/>Bring it to life - create an ecosystem that is balanced and safe for the inhabitants of your aquariums. A slight deviation from the parameters necessary for the survival of one species may be crucial for the survival of another!<br/>Run your shop - Deal with the clients and difficult tasks to develop your aquarist shop.<br/>Explore nature - learn more about fish and their behaviour.<br/><br/>", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2022-03-14T04:19:29", "background_image": "https://media.rawg.io/media/screenshots/202/202b0feb1aa536574090275093cddb8e.jpg", "website": "http://www.freemind.games", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20, "dropped": 1}, "playtime": 2, "achievements_count": 34, "ratings_count": 1, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Freemind"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "FreeMind"], "esrb_rating": null}