{"id": 752056, "slug": "alchemistry-2", "name": "Alchemistry", "name_original": "Alchemistry", "description": "<strong>Warning: following GIF are developpement builds, this is not final content.</strong><br/><br/><br/><br/>Through challenges, use the given elements to craft transitional elements to reach given objective !<br/>Challenges will gradually increase difficulties, starting with one or two steps crafts and finishing with dozen of intermediate elements !<br/><br/><br/><br/><br/><br/>Use sandbox mode to freely craft items together and maybe succeed to create rare items, and to discover everything !<br/>Hundred of elements are available to craft, some are easy to guess, but the latest are not that easy ...<br/><br/><br/><br/>Would you be able to craft every item ? To resolve every challenge ?<br/>Only one way to know: begin the new apprentice of Alchemistry !<br/><br/>Note: A Demo is available for free for you to try the game !<h3>Developer Notes</h3><br/>I am a solo developer working on that game for few months in my free time. I really hope you will have fun and relax with this game :) Working on a small and relaxing puzzle/crafting game was a dream I got for a while. I hope that game will be a new step in the direction of a full time indie life. So thank you for any small step you participate in to help me creating this game.<br/><br/>This game will be updated as long I have nice ideas I can add without redoing the game from scratch, as I did with the previous game. And even your features ideas can be added if compatible !<br/><br/>We also have a discord community, if you want to join us, where you can share your opinions, questions, etc. about the game.<br/><br/>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2023-04-25T17:50:21", "background_image": "https://media.rawg.io/media/screenshots/e47/e47dec86efa5ade390196f52c290cd51.jpg", "website": "https://dysnomia.studio", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["Dysnomia"], "genres": ["Casual", "Indie"], "publishers": ["Dysnomia"], "esrb_rating": null}