{"id": 752087, "slug": "star-salvager", "name": "Star Salvager", "name_original": "Star Salvager", "description": "On the way to the intergalactic drone fighting championships, your ship gets tangled up in an uncharted asteroid belt filled with space garbage.  The wreckage is mostly other unlucky vessels just like yours…<br/>\n<br/>\r\nFORTUNATELY,  you are the captain of a championship drone fighting team, so you might have a chance to escape this mess. You send your prized fighting drone into the belt to collect the materials you need to patch up your ship.<br/>\n<br/>\r\nUNFORTUNATELY, the rocks are home to a horde of alien cyborgs and your champion fightbot is repeatedly devoured, destroyed, humiliated, and sent home with its charred tail between its smoking legs.<br/>\n<br/>\r\nWill you finally make it to the centre of the asteroid belt where the sweet sweet scrap lies?   Will you repair your ship and turn this nightmare into a knee-slapping story over pints at the Mangledrome?  Or will your sluggish reflexes, numbed by cryo-sleep, succumb to the alien horde?<br/>\n<br/>\r\nCaptain?  Can you hear me... Captain?<br/>\n<br/>\n<br/>\r\nFEATURES:<br/>\n<br/>\r\n-   \tAn innovative core gameplay loop - feels like breakdancing in space.<br/>\n<br/>\r\n-   \tA smorgasbord of horribly cute alien cyborgs<br/>\n<br/>\r\n-   \tProcedurally generated maps.  Each run is WILDLY different. (Okay not that different)<br/>\n<br/>\r\n-   \tA roguelike metagame to keep you grinding for infinitesimal morsels of progress until you can’t remember what day it is. <br/>\n<br/>\r\n-   \tA groovy synth soundtrack that’s worth the price of the game right there<br/>\n<br/>\r\n-   \tMildly entertaining dialogue delivered by two dimensional characters who don’t move their lips.<br/>\n<br/>\n<br/>\r\nWARNING:  This product has not been widely tested. Known side-effects include uncontrollable fist-pumping, ‘tetris-y’ vibes, disco dancing, sudden bursts of uncharacteristic profanity, and, in one worrysome case, laughing like a deranged gibbon. Our team is working hard to resolve these issues.", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-14T04:16:51", "background_image": "https://media.rawg.io/media/screenshots/1ba/1ba286f1a4d5a41bd6bc30b880ad812a.jpg", "website": "https://agamestudios.ca/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A-Game Studios"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["A-Game Studios"], "esrb_rating": null}