{"id": 752028, "slug": "pirate-booty-and-the-bukkake-buccaneer", "name": "Pirate Booty and the Bukkake Buccaneer", "name_original": "Pirate Booty and the Bukkake Buccaneer", "description": "<p>As the Captain of the Unsinkable Dragoon, with a sexy as sin first-mate, things are looking pretty good for you …until you notice trouble on the horizon. One of the Navy&#39;s top pirate hunters, Elise, is making a beeline straight for you! Wanting to impress your first-mate, Jill, you put on a brave face and start the swashbuckling only to be ambushed by Rebecca, a rival pirate looking to steal your ship. Normally being surrounded by Rebecca and Elise might be a dream come true but not when they&#39;re trying to kick your ass!<br />\nTrying your best to fend off two of the sexiest ladies who sail the high seas, Jill reveals this &quot;ambush&quot; was all set up as a trap so she could make off with your ship! All seems lost as you are overwhelmed by Rebecca and Elise, watching your ship sail away as you black out...<br />\nLeft bound with no ship and no crew, you&#39;ll have to put together a real loyal crew and it just so happens there is an ocean of hotties who are looking for a tough and loving captain to serve under.<br />\nTranslated version of the original Japanese Visual Novel<br />\nThe Pirates and Naval Officers are fully voiced with original Japanese dialogue<br />\nOriginal artwork HD upscaled with 16:9 and 4:3 variants<br />\nHours of story content<br />\nAudio including music and special effects<br />\nEnhanced with character sprite animations<br />\nGallery and Scene selections<br />\nReally rock the boat as you spread your seed across multiple sexy scenes!<br />\nPirate Booty and the Bukkake Buccaneer Is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong>PLEASE NOTE</strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-07-16T07:15:55", "background_image": "https://media.rawg.io/media/games/2dd/2ddc827d163e196cfa8e73c13def2001.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 354, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}