{"id": 752055, "slug": "fireflies-figments-a-willows-journey", "name": "Fireflies & Figments: A Willow's Journey", "name_original": "Fireflies & Figments: A Willow's Journey", "description": "Adventure is better together! Using the buddy system, take control of two young adventurers as they journey deep into a mysterious forest full of fear and wonder, retracing the steps of teacher and KIN Willows founder, Hazel Willow, who disappeared over a century ago. Since her disappearance, her story has become legend, inspiring a generation to find their “KIN,” an acronym she coined for the guiding principles of Knowledge, Imagination, and Nature. Seemingly led by the light of the fireflies and opposed by the dark figments of the forest, the KIN Willows will need your help to test their skills, earn badges, and ultimately face their greatest fears to unlock the mysteries of the forest and solve the disappearance of Hazel Willow.<br/><br/>Fireflies &amp; Figments: A Willow’s Journey is a 3rd person, top-down, adventure game where you take control of both characters in a single player co-op experience as you solve puzzles, earn badges for new skills, and explore a mysterious forest where your imagination brings fear and wonder to life!<br/><br/>This is a fully-playable vertical slice game featuring Willow’s Rest, The Bramblewoods, Perry’s Cave, and the Blizzcrag!<br/><br/><strong><h3>Key Features:</h3></strong><br/><strong>Imagination Meter</strong> - Harnessing the power of the Imagination Meter will require balancing your fear and wonder to control the unexpected effects of imagination on your journey.<br/><br/><strong>Buddy System</strong> - It's not safe to go alone. Take control of two characters at once and work together to face your greatest fears and solve the mystery of the disappearance of Hazel Willow.<br/><br/><strong>KIN Badges</strong> - Earn KIN Badges by overcoming obstacles and mastering unexpected challenges to unlock new skills and become the adventurer you were meant to be!<h3>Additional Gameplay Details:</h3><ul><li>Single player<br/></li><li>Dynamic top-down 3rd person camera with zoom in and out based on distance of characters<br/></li><li>Dynamic visuals and gameplay triggered by Imagination meter, including combat and puzzle hints<br/></li><li>Unlock new skills through cooperative puzzle solving and exploration<br/></li><li>Light combat and platforming elements</li></ul>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2022-03-14T03:56:17", "background_image": "https://media.rawg.io/media/screenshots/1c3/1c31d8bbf54e9a884cd5800ca9271474.jpg", "website": "https://www.firefliesandfigments.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameCreateRepeat"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["GameCreateRepeat"], "esrb_rating": null}