{"id": 752022, "slug": "travelers-in-space-crack", "name": "Travelers in Space Crack", "name_original": "Travelers in Space Crack", "description": "Travelers in Space Crack is a survive PC game in deep space. Explore in different galaxy through space cracks. To find and gather useful resource, to trade and make money are all important to develop your own fleets. And only through build massive fleets, you triumph over the unknown evil forces. <br/><br/><strong>Build your own planet base</strong><br/>To scan and gather useful mineral information of a planet. You can build some mineral mine there. If you have some blueprints, you can also build factory and produce resources you need or to sell them. There are many special projects to be built. For example, the  space telescope helps discover distant planets. Stargates help to teleport ships to any planet. Space probes help detect enemies from deep space.<br/><br/><strong>Ship factory</strong><br/>There are different kind of ships you can build in the ship factory, ex. battle ship, laser station, cargo ships and scout. Ships have different kinds of weapon. <br/><br/><strong>Evil force</strong><br/>The evil force that comes from deep galaxy are trying to destroy all civilization in all planets they found. At the beginning, you may not have enough strength to fight with them. So to escape and to hide are good ways. When you have large fleets, you can play a force leader to protect your alliance too.<br/><br/><strong>Space crack</strong><br/>You have the ability to travel through the cracks in space. So you can walk through it and find a new planet to survive. Some cracks are closed and you have to defeat some bosses to reopen it.<br/><br/><strong>TRADE</strong><br/>If there is a trade center, you can trade with every planet. You can trade some resources you need, and you can also buy some blueprints or technologies. If space pirates come, you can trade with them. They may bring rare items and blueprints, too.<br/><br/><strong>Random meteorite event</strong><br/>Meteorites sometimes drop on planets where resources can be collected. Sometimes, some space junk also falls off. You can get some special materials or ships from it. You can build some orbital jammers, it helps to get bigger meteors.<br/><br/><strong>**Game never die**</strong><br/>Game scripts are editable. You can modify any content of this game if you are interested. But if you use personal scripts, steam achievements and leaderboards will be disabled.", "metacritic": null, "released": "2022-03-13", "tba": false, "updated": "2022-03-14T03:35:46", "background_image": "https://media.rawg.io/media/screenshots/120/120b7e80a181012aa11eba26491ef8af.jpg", "website": "https://www.facebook.com/Welovebot-Games-112630626765561", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xenon Lu"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["WELOVEBOT CO"], "esrb_rating": null}