{"id": 75203, "slug": "car-mechanic-simulator-2015-gold-edition", "name": "Car Mechanic Simulator 2015 Gold Edition", "name_original": "Car Mechanic Simulator 2015 Gold Edition", "description": "This edition has added 4 DLC's inside: Youngtimer, Visual Tuning, PickUp &amp; SUV and Trader Pack.<br/><br/>New cars, new tools, new options, more parts and much more fun in the next version of Car Mechanic Simulator! Take your wrench!<br/><br/>Create and expand your auto repairs service empire. Car Mechanic Simulator 2015 will take you behind the scenes of daily routine in car workshop. Take on the role of the car mechanic and repair cars for your clients. Spend the earned money on expanding your workshop and improving your skills.  Buy worn out cars, renovate them and sell with profit or become a famous car collector. If you manage your business well, you will surely succeed in the market.<br/><br/>Car Repairs<br/>The essence of the game. It is your job. It is the way you get cash. It is the way you live... Ok, it is maybe not that important, anyway that is the basic activity in the game. Customer comes in and mysteriously says that his car is broken but he needs it for tomorrow. The clock starts right now.<br/><br/>Mission system<br/>Jobs are generated randomly so you'll have to choose on which car you will work. It seems like there is a group of customers waiting in front of the workshop for the mechanic...<br/>Additionally you can take limited amount of jobs in the same time and every one of them is time-restricted. With different difficulty and complexity levels and of course, different payment levels, wise management is the key here.<br/><br/>Workshop management<br/>After whole day of hard work it is time to count your cash and then look around your business. What should I buy to improve my performance? What would attract more clients? You can always just buy more posters on the wall but it is not something called 'great investment' for such a serious business, right?<br/><br/>Car auctions<br/>Speaking of investments.There is a chance for making even more money in the car auction house. Choose wisely, buy used or old cars and renovate them to sell with profit... Or, if you are one of those vintage car lovers, you can have your own collection.<br/><br/>Car Models<br/>Cars are fully dismountable to the car frame with amazing level of detail. Every car is made of more than 200 interactive parts, which includes  an interior, a car body and the whole engine.<br/><br/>● ADDITIONAL INFORMATION ABOUT CAR MECHANIC SIMULATOR 2015 ●<br/><br/>We do NOT recommend that you play CAR MECHANIC SIMULATOR 2015 on any of the following unsupported graphic chipsets: <br/>HD3000 (2011 Mac Mini, 2011 MacBook Air, 2011 13” MacBook Pro)<br/>ATI Radeon HD 2000 series, HD 4670, HD 6490M, HD6630M <br/>NVIDIA 8000 &amp; 9000 series, GT100 series, 320M, 330M<br/>Intel Integrated GMA950, x3100<br/><br/>● Please Check System Requirements Prior to Purchasing. If you are unsure about your system specs, head over to GameAgent.com and let the MacMatch feature do it for you! ●<br/><br/>In order to run the game with satisfactory performance, your Mac must meet these minimum system requirements: <br/>2.4 GHz CPU Speed | 4 GB RAM | 4 GB free disk space | Intel HD 4000 | 1024 MB VRam", "metacritic": null, "released": "2016-07-15", "tba": false, "updated": "2019-08-02T02:59:06", "background_image": "https://media.rawg.io/media/screenshots/a2b/a2bf49c18a0e4b61adff9a9157f57a2b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["PlayWay"], "genres": ["Simulation", "Racing"], "publishers": ["PLAYWAY SPOLKA AKCYJNA"], "esrb_rating": "Everyone 10+"}