{"id": 752113, "slug": "four-winds-fantasy", "name": "Four Winds Fantasy", "name_original": "Four Winds Fantasy", "description": "An old man, shunned by the people of his town, has always stayed on the outskirts of his village. When his son disappears, however, he must enter the town and explore the cave nearby in order to understand what happened. The esports speedrunning Action RPG you've been dreaming of! Now in a definitive Steam version with FULL gamepad support, leaderboards, and achievements.<br/>\n<br/>\r\nEmbolden yourself to the mystery of the Winds. Take control of a lonely father discovering the paranoia behind a town that seems so mysterious and dangerous that only a genius could understand it. When the Winds call, you absolutely must follow.<br/>\n<br/>\r\nFour Winds Fantasy is an action/RPG presented in the traditional QUIMDUNG style. The dreamful graphics and abstract dialogue combine to give an overall nightmarish feel. The gameplay is simple but deep and could take a lifetime to master. The game's multiple endings encourage - nay, demand - multiple playthroughs.<br/>\n<br/>\r\n\"Four Winds Fantasy is a very peculiar yet rich gaming experience\" - Hardcoregaming101<br/>\n<br/>\r\n\"Four Winds Fantasy is fantastically bizarre and quite difficult\" - Brandon Sheffield, Insert Credit<br/>\n<br/>\r\n\"I don't quite understand what's going on in this game, but I like what I've played of it\" - Danny Cowan, GameSetWatch", "metacritic": null, "released": "2022-03-09", "tba": false, "updated": "2022-03-14T04:35:36", "background_image": "https://media.rawg.io/media/screenshots/23b/23bd1b1b64186f9f425cd41f88fc7ada.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bankbank", "GHXYK2"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Wainstop James"], "esrb_rating": null}