{"id": 752192, "slug": "hotel-transylvania-scary-tale-adventures", "name": "Hotel Transylvania: Scary-Tale Adventures", "name_original": "Hotel Transylvania: Scary-Tale Adventures", "description": "Explore classic fairy tale worlds with your favorite characters from the Sony Pictures Animation films in Hotel Transylvania: Scary-Tale Adventures! Take control of Drac and Mavis and play through unique worlds with their own spooky spin, including Little Red Riding Hood, The Emperor’s New Clothes and Ali Baba and the Forty Thieves.<br/><br/><br/><br/>Faced with fearsome foes and fiendish puzzles, you must brave your way through and utilize your special abilities to dash, glide and jump through these spook-tacular storybook worlds. You’ll even get to meet iconic Hotel Transylvania characters like Johnny, Murray, Wayne and more, who’ll guide you to complete exciting quests and solve devious challenges, along with a coffin-full of collectibles for you to discover. With so much at stake, Drac and Mavis are Count-ing on you to save the day!<br/><br/><br/><br/><br/>Dive into classic fairy tales with a spooky spin! Become Little Red Riding Mavis and watch out for Big Bad Wolf Wayne. Collect valuable trinkets for the King of Thieves to enter The Cave of Treasures. And solve puzzles to unlock the ruined temple and find Emperor Blobby’s New Clothes!<br/><br/><br/><br/><br/><br/><br/>Encounter  unique worlds to complete challenges as tricky as finding Griffin, the Invisible Man – oh wait, that is one of the challenges! Unearth hidden collectibles, cursed medallions and coins galore to spend in the shop. Discover all the secrets of each story to unlock treats tastier than a scream-cheese bagel!<br/><br/><br/><br/><br/><br/><br/>Gain powerful new vampire skills as you defeat the creatures haunting each chapter, and show the bad guy bosses who’s in charge! Power up Drac and Mavis with super strength, immobilization powers, super jump, and more.<br/><br/>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T05:31:28", "background_image": "https://media.rawg.io/media/screenshots/acc/acc3db3396f6d5e7b3b11fb8bbe11b59.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 476, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Drakhar Studios"], "genres": ["Action", "Adventure"], "publishers": ["Outright Games"], "esrb_rating": null}