{"id": 752198, "slug": "charlie-in-the-moistverse-of-madness", "name": "Charlie in the Moistverse of Madness", "name_original": "Charlie in the Moistverse of Madness", "description": "Charlie in the Moistverse of madness is a small fangame made to celebrate the amazing Moistverse meme that took the world by storm. On this 3D puzzle platformer, you can utilize different variants of Charlie with different abilities to defeat enemies and solve puzzles.<br/><br/>In the game you play as Charlie and his variants from the moistverse. You will need to adventure into the scientific facility you find yourself and dive into new unknown worlds. Solve puzzles and defeat enemies in the area in order to save the next variant which will have more abilities for you to unlock.<br/><br/>Here's a more In Depth Video about the game:<br/>https://youtu.be/_d02PDwoYgA<h3>Know more about each Charlie Variant:</h3><br/><strong>OG MoistCritical: </strong><br/><br/>The one that started it all! OG critical is fast and nimble which allows him for double jump. His presence is also inspiring for his variants but terrifying for his enemies.<br/><br/>Abilities: Double Jump, Battle cry ( Scares enemies in the area around you )<br/><br/><strong>Discord mod Critical:</strong> <br/><br/>Discord Critical is slow and cannot jump, but he certainly compensates for lack in physical strength by using his own body in devastating attacks. His high inteligence also allows him to hack into complex terminals and open doors.<br/><br/>Abilities: Ground Slam ( falls to the floor dealing damage to all nearby enemies ), Hack into terminal<br/><br/><strong>Chad Moist Critical</strong><br/><br/>Chad Critical is the strength of the group. He's capable of holding heavy boxes in order to assist on puzzles. He also has a really good diet with healing shakers at the ready for when the situation demands it.<br/><br/>Abilities: Healing Shaker, Grab Box<br/><br/><strong>Dog Moist Critical</strong><br/><br/>This feral companion is very fast, dealing quick slashes with his sword. It is also capable of passing through areas that are not accessible for other variants<br/><br/>Abilities: Sword Slash, Pass through vent", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T05:35:34", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a56bc7956649e2d2d82308709147721.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 424, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Logic Leo"], "genres": ["Action", "Indie"], "publishers": ["Logic Leo"], "esrb_rating": null}