{"id": 752123, "slug": "bethanys-talishop", "name": "Bethany's Talishop", "name_original": "Bethany's Talishop", "description": "<h3> Meet Bethany </h3>In the small country side, Bethany aspired to light up the hills with magic. To reach her goal, Beth became a master of utilizing gems to imbue object with magic so anyone can use it. The objects are commonly called talismans. To bring magic to her hometown, she set up a small shop that sells talismans. A Talishop, if you will.<h3> Help Needed </h3>Crafting talismans isn't easy work, so Bethany is looking to bring in an apprentice, someone she can pass her knowledge onto. That's you! You'll be stabilizing the magic within the crystals to imbue items for Bethany to sell in her shop, but don't worry, she'll teach you everything you need to know.<h3>Bring Stability</h3><ul><li> Crafting talismans is a uniquely challenge akin to connect the dots.<br/></li><li> Link 4 gems together using magical circles<br/></li><li> The color of the gem tells you how many links a gem needs to become stable<br/></li><li> When all gems are white, the talisman is stable enough to be sold<br/></li><li> Watch out, too many links will drain too much magic from a gem, rendering it inoperable</li></ul><h3> Handcrafted Talismans </h3><ul><li> Campaign Mode<br/>Help Bethany get her shop in order and solve handcrafted puzzles with increasing difficulty<br/></li><li> Infinite Mode<br/>Keep your skills sharp with an infinite supply of unique puzzles, each offering a new look to the familiar patterns</li></ul>", "metacritic": null, "released": "2022-03-09", "tba": false, "updated": "2022-03-14T04:43:15", "background_image": "https://media.rawg.io/media/screenshots/af0/af080e7e7b95487ceb4a144321ffd660.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Apple Pie Games"], "genres": ["Casual", "Indie"], "publishers": ["Apple Pie Games"], "esrb_rating": null}