{"id": 752105, "slug": "ignited-steel-mech-tactics", "name": "Ignited Steel: Mech Tactics", "name_original": "Ignited Steel: Mech Tactics", "description": "Aiming to fulfill its expansion instinct, humanity created an A.I. which controls and manages all necessary resources to expand the human race throughout the galaxy. Soon, a fatal flaw in the A.I. \"PharOS\" code was discovered: it could not and would not stop expanding. <br/><br/>With the hope to halt PharOS’ expansion, the human race depends on \"The Ignited Steel” program, a plan reliant on outdated technology which PharOS cannot control. <br/><br/>Old Mechs from past wars are now humanity’s only hope.<br/><br/><br/><br/><br/><br/>Attacking and moving mechs requires energy and can overheat the mech. If overheated, mechs output more damage while being more vulnerable to enemy attacks. <br/><br/>A key element to gameplay is finding the perfect balance between damage and vulnerability. <br/><br/><br/><br/><br/>Pilots from every corner of the universe volunteer to the Ignited Steel program, each bringing their unique personalities and tactics.<br/><br/>As the Ignited Steel program regains control of the galaxy, new pilots will join the cause against PharaOS. <br/><br/><br/><br/><br/>There're 3 types of mechs: Juggernaut, Stalker and Javelin, each with their own advantages and counterplay.  <br/><br/>Mechs are built using unique modules each with their own purpose. As the Ignited Steel program liberates the galaxy, they will earn  and purchase new modules with unique traits. <br/><br/><br/><br/><br/>The galaxy is full of contrasting planets and stories to be told. By jumping from node to node the ignited steel program will discover the galaxy's stories, and add new modules and pilots to the crew. New planets, pilots, modules, events and missions in every playthrough!<br/><br/>", "metacritic": null, "released": "2022-03-09", "tba": false, "updated": "2023-08-09T17:39:15", "background_image": "https://media.rawg.io/media/screenshots/324/3245ba621078f60aec6a86c95d01f676.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 14, "beaten": 1, "toplay": 2}, "playtime": 1, "achievements_count": 67, "ratings_count": 2, "suggestions_count": 377, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Yokaicade"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Meteorbyte Studios"], "esrb_rating": null}