{"id": 752106, "slug": "victorian-debutante", "name": "Victorian Debutante", "name_original": "Victorian Debutante", "description": "Step in the glorious Victorian Era and experience it as a young upper class woman preparing for her debut before the Queen and the royal family.<br/>You will be subject to various situations, each with four choices. Each and every one of them can and will impact your future. Who will you become when the time comes? Will you fullfill your family's expectations and ambitions? Will you find your own path?<br/><br/><br/><br/><br/><br/><ul><li> carve your own destiny, making decisions in 20+ situations,<br/></li><li> explore 4 possible endings, <br/></li><li> let hand drawn pictures and portraits set the mood,<br/></li><li> dive into deep and immersive plot,<br/></li><li> learn female perspective in one of the most popular eras in British history</li></ul> <br/><br/><br/><br/><br/>Debutante was a general term used to describe a girl coming of age, entering womanhood and society as an adult. The word usually relates to women of aristocratic or upper-class background. In the United Kingdom, the tradition of young women being presented at court was upheld for nearly two hundred years until Queen Elizabeth II abolished it.<br/>The debut and the season following it was the most important time for both the debutante and her family. If the woman was lucky and very hardworking, she would not only land a husband in her first season but secure a spot in the high society for herself and her prospective daughter. If she failed, she might have become an outcast and spend the rest of her life pretty much secluded...<br/><br/><br/><br/>Heyho! This is Jumack, the developer behind the Victorian Debutante. I am a novice single developer, passionate about games ever since I learnt how to use a computer mouse. It was before I learnt how to turn that machine on! Victorian Debutante is my official first project and it stems from the sheer love for games and the Victorian Era.<br/>I'm planning on developing the game with time, here's a little list of features I'll be adding:<br/><ul><li> localisations in different languages,<br/></li><li> full dubbing in localised languages,<br/></li><li> animations and environment sounds for stories pictures,<br/></li><li> in-game wiki for more and less known facts about the era</li></ul>Keep up with all the news and share your thought, or just come to say heyho! https://discord.gg/DBFd5Q54dW", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-03-14T04:30:14", "background_image": "https://media.rawg.io/media/screenshots/59b/59bf0aa780b6b4cf7520860b4b7c104c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Liquid Darkness"], "genres": ["Adventure", "Casual"], "publishers": ["Liquid Darkness"], "esrb_rating": null}