{"id": 752241, "slug": "orbital-bullet-the-360deg-rogue-lite", "name": "Orbital Bullet – The 360° Rogue-lite", "name_original": "Orbital Bullet – The 360° Rogue-lite", "description": "KILL. DIE. MODIFY.\nOrbital Bullet is a fast paced 360° action-platformer with rogue-lite elements, where all actions take place in a circular pattern. Fight your way through a variety of procedural planets and use body modifications, crafting, upgrades and heavy weaponry.\n<br/>\n<br/>\n\n  TRIGGERFINGER LICKIN’ GOOD ROGUE-LITE ACTION360° hard-boiled gunplay: Projectiles traverse in a 360°-degree pattern allowing for a new unrivaled gunplay feeling.\n<br/>\n<br/>\n“Just one-more-run”: Procedurally generated planets, mean enemies, bad-ass bosses, a diverse weaponry and game changing upgrades guarantee addictive gameplay.\n<br/>\n<br/>\nMake the most satisfying long-range curved snipes you have ever done or blast and shred enemies with a load of your hyper shotgun. Or are you more of a rocket launcher fella?\n<br/>\n<br/>\nFast paced unrelenting pixel style-action: each death is permanent, but let’s be honest, dying is part of the fun.   \n<br/>\n<br/>\n\n  A DEATH-DEFYING PROGRESSION SYSTEMSuck at the game? Don’t worry, we got you covered! After each death you will be able to spend Nanobytes to receive permanent upgrades and skills. \n<br/>\n<br/>\nHow about a bigger Medi-Backpack or extra Shield to last a little bit longer? \n<br/>\n<br/>\nOr activate the Combo System, to tremendously increase the pacing of the game and receive certain multipliers to currency drops and EXP. \n<br/>\n<br/>\n Don’t like your starting weapon? Unlock a new more powerful one right from the start and get your revenge.     \n<br/>\n<br/>\n\n  UNLIMITED FRAG-TASTIC REPLAYABILITYBuild your own custom skill tree with our Dynamic Skill Trees! Make clever decisions to empower skills and reach new power spikes while the tree changes every time you play.\n<br/>\n<br/>\n“We need guns, lots of guns.” Unlock, find, or buy more than 20 different guns, weapon upgrades and various power-enhancing perks that will change the way you’ll play.\n<br/>\n<br/>\nUnlock four different classes to choose from, like the turret-carrying Engineer or the fire-fueled Hellion, each with a different skill tree. \n<br/>\n<br/>\nAre you the type of person who enjoys some good ol’ pain? Good, because we got a Streak System that will make the game considerably more difficult (coupled with a few other surprises) with each completed run, until your streak ends. Don’t worry though, you will have plenty opportunity to die. \n<br/>\n<br/>\n<br/>\n\n  A HEAD-BLASTING SOUNDTRACKOrbital Bullet features a pounding electronica soundtrack composed by Niilo Takalainen &amp; Juha Korpelainen. If you die a lot, at least you can listen to some catchy tunes.\n<br/>\nHARDER. BETTER. FASTER. SHOOT-IER. JOIN OUR COMMUNITY NOW!", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-14T06:07:22", "background_image": "https://media.rawg.io/media/screenshots/83a/83ab059c6a6afbbee7b2bad5cd80150d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 505, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SmokeStab"], "genres": [], "publishers": ["Assemble Entertainment"], "esrb_rating": null}