{"id": 752237, "slug": "wo-you-yi-zuo-mou-xian-wu-i-have-an-adventure-hous", "name": "我有一座冒险屋 I have an adventure house", "name_original": "我有一座冒险屋 I have an adventure house", "description": "This game is based on the famous hot IP of the same name (text adventure)/(explore puzzles) realistic 2D story to game works. In the game, you will play a young boss Chen Ge of an adventure house on the verge of bankruptcy. Under the guidance of a black mobile phone, you will encounter one mysterious existence after another, solve one mystery puzzle after another, and discover the truth of the disappearance of your parents and your true identity.<br/><br/><h3> </h3><br/>Failing risk, young boss Chen song is plagued by business is pale and a large number of employees resigned, suddenly a legacy of the missing cases from Chen song parents \"phone\" black boot and begins to release to the Chen song task, and told that their released as the task completed, Chen song from their parents house inherited risk of terrorist level will be upgraded, To do not make the adventurous house that parents manage hard to close down, also be to seek the truth that parents is missing, Chen Ge set foot on to accept \"black mobile phone\" the task that releases, head for on the road that seeks unknown riddle in another horrible scene.<br/><br/><h3> Gameplay: </h3><br/>As the story progresses, you need to explore different scenarios, find key items or solve various puzzles, complete the \"Black Phone\" release mission, and unlock the story.<h3> </h3><br/>1. Thrilling drama, exciting real-time QTE battles.<br/><br/>2. Rich puzzle content, realistic scene depiction, and character dialogue.", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T06:02:12", "background_image": "https://media.rawg.io/media/screenshots/1fe/1fe98c78c5bd6bbb821eeaf5ccc24400.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["知音动漫"], "genres": ["Adventure", "RPG"], "publishers": ["知音动漫"], "esrb_rating": null}