{"id": 752210, "slug": "vruseum", "name": "VRUSEUM", "name_original": "VRUSEUM", "description": "Welcome to <strong>VRuseum</strong>, a virtual experience designed by <strong>Secondarybounce</strong> that invites the user to explore, through a 10,000m2 architectural space, a selection of world-renowned digital artists curated by  <strong>Boldtron</strong>.<br/><br/>Explore the museum with all the artworks or in \"architecture only\", also individually visualize each sculpture in an isolated visualization mode. Visit all the zones, discover all the artist sculptures installations, unlock viewing modes and complete your collectible album.<br/><br/><br/><br/><strong>VRuseum</strong> contains galleries and open spaces that exhibits sculptures created by artists from the digital world. You can visit the museum downloading for free the application and choosing between 3 different modes: 1 - Virtual reality headset. 2 - Keyboard and Mouse. 3 - Touch screen.<br/>View modes: VR, First person, Aerial view, Photo, Camera.<br/><br/><br/><br/>Line-up:<br/><br/>Benoit Challand - Boldtron -  Bumpy Junkie - ByElectra - Chris Bjerre - David Porte Beckefeld - Eva Cremers - Fausto Mauriz - Felipunch - Fmk7 - Frederic Kokott - Fvckrender - George Varodi - Ivan Fedorov - Jappari - Laurie Rowan - Lucas Aguirre - Marylou Faure - Matthias Winckelmann - Max Salzborn - Raman Djafari - Sean Sevestre - Secondary Bounce - Serial Cut - Shir Pakman - Silvia Puff -  Simon Appel - Six N. Five - SlurpTV - Tobias Wuestefeld - Ugly Stupid Honest - Untitled Army - Untitled, xyz - Visual Citizens - Zigor<br/><br/>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T05:43:13", "background_image": "https://media.rawg.io/media/screenshots/474/474fbd2d9b563615a43cc257d42a5e10.jpg", "website": "https://secondarybounce.com/vruseum", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SecondaryBounce"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["SecondaryBounce"], "esrb_rating": null}