{"id": 752225, "slug": "goodnight-3", "name": "GoodNight", "name_original": "GoodNight", "description": "A psychological horror game about the haunting experiences of Veronica’s family’s tragic death. Three years ago, Veronica’s family was killed in a fire that started in their home. No one survived except her. It was such a tragic event that led her to move from one house to another. Veronica is followed by a series of paranormal activities that lead her to have sleepless nights and nightmares. She is in a tormented state to end her endless nightmares. Will Veronica survive the haunting?<br/><br/><strong>Features: </strong><br/><br/><ul><li>Immersive gameplay: Realistic graphics and sound design as well as minimal or no user interface to achieve a total immersive experience.<br/></li><li>Flashlight: There is no other  must-have in a dark place  than a flashlight.<br/></li><li>Chilling atmosphere:  A chilling and creepy atmosphere that will enhance the sound design ambiance.<br/></li><li>Intense jumpscares: GoodNight will give you  nightmares when it comes to jumpscares. Scary ghost with scary and terrifying sounds equals perfect jumpscares.<br/></li><li>Scary environment: It takes place in the early 1990's and gives the player a creepy vibe.<br/></li><li>Realistic graphics: GoodNight comes with realistic graphics and design with volumetric lightings, real-time lights rendering, high-quality textures, and much more.</li></ul>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T05:53:11", "background_image": "https://media.rawg.io/media/screenshots/d6e/d6e17bc7f3da4990b0c08b56a8e27c45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Solitary Studios"], "genres": ["Indie"], "publishers": ["Lamina Studios"], "esrb_rating": null}