{"id": 752285, "slug": "pethack", "name": "PetHack", "name_original": "PetHack", "description": "<p><strong>My first 7DRL submission!</strong> It was a fun week with a lot of learning. </p><p><strong>Controls: Arrow Keys to move/attack, 'S' to search.</strong></p>\n<p>This is an alpha release, and the game is under active development! <em>Certain systems are disabled due to bugs in the browser-only version of the game but hopefully will be fixed in the coming days (after 7DRL 2022 has ended).</em></p>\r\nYou are the pet\r\n<p>I love NetHack, and I especially love using pets, so I had a dream of a NetHack variant where YOU are the pet. You start as an innocent kitten, pony, or little dog, but can grow up to be whatever you want. There is a \"catch [th]em all\" aspect to unlocking new starting pet abilities -- will you be able to survive the hardcore \"grid bug\" mode?</p>\n<p><strong>Inspiration, meet Reality...</strong></p>\n<p>In reality I only implemented the first dungeon level, full of grid bugs and a single pancake which you can't pick up because I had to disable my inventory system due to a bug in the WASM build. But, I have built a pretty robust ECS that I feel good about building on in the future, and these are bugs which I will squash in the coming days after 7DRL has ended.</p>\n<p><strong>PLEASE follow me here to receive updates as I continue development.</strong> I am excited to keep working on this project, and sharing code, learnings and new features with the community. The end goal of this is not to build <em>Yet Another NetHack Variant</em>, but to build an entirely new game that is worth playing on its own merits. </p>\n<p>I didn't accomplish that during 7DRL, so what did I accomplish?</p>\r\nFeatures accomplished during 7DRL\r\n<ul><li>ECS running systems for Action, Behavior, Advancement, Combat, Health, Interaction, Inventory, PlayerInput, Rendering, Spawning and Visibility, and supporting a variety of composable components such as Brain, Vision, Equipment<ul><li>Note: several of these systems are disabled in the browser build and I haven't released the downloadable game yet (soon!)</li></ul></li><li>Randomized level generation using BSP algorithm</li><li>Secret terrain such as doors</li><li>Message console</li><li>Field of view calculation for players and monsters</li><li>Character advancement a.k.a. Growing up</li><li>Combat, including different wieldable equipment (and monster attacks such as bites and claws)</li><li>WebAssembly build/package (although this has issues, see below)</li></ul>\n\r\nKnown issues\r\n<p>I need to fix many issues but I wanted to submit this game because it's the first time I've ever been able to take the time off of work to do a 7DRL, and I am proud that I was able to stick to it and upload something.</p>\r\nNo menu or help screen\r\n<p>The controls in the 7DRL submission are </p>\n<ul><li>Arrow keys to move/attack</li><li>S to search</li></ul>\r\nPerformance is slow\r\n<p>I apologize, I am using Ebiten (Golang) but building for WebAssembly and I had no idea the performance in the browser would be so dramatically different. </p>\r\nGame is incomplete\r\n<p>There isn't much to do yet. I think a good 7DRL submission should at least be a finished game, and I acknowledge that as of Sunday evening, this is more like a prototype.</p>\r\nCertain systems are disabled\r\n<p>I had hoped this could be a browser game but Ebiten and WASM do not support certain basic golang libraries I was using and I didn't have time to rewrite the code, so I just disabled the systems that were failing. Most notably, the inventory (loot and equipment) system is completely shut off in the current build.</p>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-14T06:24:47", "background_image": "https://media.rawg.io/media/screenshots/2a2/2a21c0f21d3bb405cfce2c50ea4db17b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kilobaud"], "genres": [], "publishers": [], "esrb_rating": null}