{"id": 752211, "slug": "mandala-2", "name": "Mandala", "name_original": "Mandala", "description": "A hypnotic and meditative bullet hell shooter. Let the flow inspire you while coloring geometric figures and discover more about yourself through immersive moods.<h3>What is a mandala</h3><br/><strong>Mandala</strong> in the eastern languages means <strong>circle</strong> and they are geometric shapes inspired by nature and the world surrounding us. They unfurl from a center and spread out towards the edges, in the direction of infinity. Drawing and coloring a mandala has been a meditative activity since a long time. It lets one explore themselves through an interesting choice of shades which represent a creative stimulation.<br/><br/>Mandala brings forth this experience in a videogame.<h3>Game experience</h3>The game's rhythm is not hectic, but it requires <strong>concentration and reflexes</strong> nonetheless: the mandala shoots slow and numerous bullets which move in a rotating fashion. The complex patterns are hard to predict and feel hypnotic. The colors and the music help creating a strong sense of immersion, aided by a steady gameplay rhythm.<br/><br/><h3>Customization</h3>The mandala's <strong>customization</strong> is essential: you can choose between various drawings, styles, brushes, tones, themes and music that influence both gameplay and aesthetics. Each game is unique and Mandala gives you <strong>total creative freedom</strong>.<br/><br/><h3>A linking story</h3>Thin, yet enduring threads link every mandala to each other... like true friendship. Discover the story of Camilla through the <strong>pages of a diary</strong>; unveil her story by completing all the mandalas in the book.<br/><br/><h3>The editor and social media</h3>When you complete a mandala, it is possible to view your score and be rewarded with various marks, depending on how well you played. There is also an <strong>editor</strong> in which you can customize the output of your game, export the image in .png format and share it both on social media and <strong>online leaderboards</strong>.<br/><br/><h3>Main features</h3><ul><li> Immersive, hypnotic gameplay<br/></li><li> 8 mandalas to color with a pastel-styled book<br/></li><li> 32 colors and 8 brushes to unleash your creativity<br/></li><li> In-game editor for sharing your inspiration on social media</li></ul>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T05:43:49", "background_image": "https://media.rawg.io/media/screenshots/8e7/8e7deb4c710af05a7a44c7d1be6716e5.jpg", "website": "http://alexofalco.com/games/mandala", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AlexoFalco"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Bee Games"], "esrb_rating": null}