{"id": 75234, "slug": "trucker-construction-parking-simulator-realistic-3", "name": "Trucker: Construction Parking Simulator - realistic 3D lorry and truck driver free racing game", "name_original": "Trucker: Construction Parking Simulator - realistic 3D lorry and truck driver free racing game", "description": "One of the world’s top racing games returns! Trucker is back and better than ever!<br/><br/>With more detailed environments, more vehicles, and more missions than you can shake a shift stick at, Trucker: Construction brings you more of the unique and challenging gameplay that made the original game such a massive hit. Five Million players can’t be wrong! <br/> <br/>** GAME FEATURES **<br/>• Bigger &amp; Better: Two trucks, 96 levels, endless entertainment.<br/>• Construction Site: Brand new immersive and detailed 3D environment to explore.<br/>• Handle with Care: Each Truck drives and handles completely differently.<br/>• Time Attack: The quicker you park, the more points &amp; stars you get!<br/>• Full Control: Choose your preferred controls - steering wheel, buttons or tilt control, all with adjustable sensitivity.<br/>• Changing View: Movable cameras for the perfect view of any obstacles in your way!<br/>• Young Truckers: An unlockable ‘Kids Mode’ - shorter trucks make for an easier drive!<br/>• Open Road: Free Drive mode for when you just want to motor around!<br/>• Top Trucker: Leaderboards and over 50 GameCenter achievements. Be the best!<br/>• iOS Optimisation: Trucker will run on anything from the iPad 1, to iPod Touch 4th Gen, even full iPhone 5 widescreen support.<br/><br/>So you think you've mastered Trucker: Parking Simulator? Time to test your skills in a REAL environment. Trucker: Construction adds the new realistic Construction site map, where you can take your brand new trucks around 96 challenging levels. <br/><br/>Feeling a little rusty? Never fear: you can practice driving in Free Drive mode.<br/><br/>Grade your performance against other players. Earn stars by completing jobs on time, and get higher scores for completing the job faster. GameCenter lets you compare scores against all of the Worlds' Truckers! Could you be the best Trucker the World has seen?!<br/><br/>** NEW TRUCKS **<br/>The Low Loader is a big, long and heavy truck that takes some careful positioning to get around the levels cleanly!<br/><br/>The Motor Grader, with its limited steering and long nose, is deceptively tricky to drive. Can you master this completely different handling truck and get the job done? Unlock the Motor Grader by collecting 100 stars with the Low Loader, or unlock it any time with an In-App Purchase.<br/><br/>What are you waiting for? Hop in the cab and truck on down to the site today in Trucker: Construction Parking Simulator!", "metacritic": null, "released": "2013-07-13", "tba": false, "updated": "2019-10-22T14:05:55", "background_image": "https://media.rawg.io/media/screenshots/437/437ffafab5fa2ecb548f62179eab0133.jpg", "website": "http://www.trucker-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Simulation", "Racing"], "publishers": ["Aidem Media"], "esrb_rating": "Everyone 10+"}