{"id": 75230, "slug": "rv-motor-home-parking-simulator-game", "name": "RV Motor-Home Parking Simulator Game", "name_original": "RV Motor-Home Parking Simulator Game", "description": "It’s a never-ending Vacation here at the Coastal Town! Drive 3 Amazing Touring Vehicles around increasingly challenging parking missions! Featuring an ALL NEW ‘birds eye view’, this is your best toolkit for the most precise driving you’ll need to get through the missions without damage.<br/><br/><br/>THREE AMAZING VEHICLES<br/>Motorhome: long and wide, the motorhome is literally like negotiating your house down the road. Have you got the spatial awareness required to pass without wrecking your expensive motorhome?<br/><br/>Caravan: long, heavy and awkward. Pulled by a powerful 4x4 SUV, take this beauty for a spin and park it up safely in some more difficult missions. <br/><br/>Boat Towing: win the ultimate prize by towing your ultra-precious luxury yacht to the Coast. This is a challenge meant only for the most skilled drivers! Can you pass in one piece?<br/><br/><br/>BEAUTIFUL LOCATIONS<br/>It’s a lovely day at the Coast! With environments reminiscent of the European Riviera and American coastal regions such as Cote D’Azur, Monaco, Florida and Hawaii, it’s never a dull day in our World!<br/><br/><br/>FREE &amp; FUN GAMING<br/>Loaded with missions, all free-to-play in the Normal difficulty mode. Various options are available via In-App Purchases to make your journey easier, if you need a helping hand.<br/><br/><br/>A WORLD OF CHALLENGE<br/>Each mode has separate GameCenter leaderboards to make for fair competition between drivers of all skill levels! Decide once and for all who’s the best driver in the World, or between you and your friends!  <br/><br/><br/>GAME FEATURES<br/><br/>▶ 3 Realistic 3D Touring Vehicles to drive and master! <br/>▶ Full 3D locations set in stunning Coastal cities!<br/>▶ Loaded with challenging Parking Missions!<br/>▶ 100% Free-2-Play Career Mode<br/>▶ Customisable control methods (tilt, buttons, wheel)<br/>▶ Easier modes available as optional In-App Purchases for an easier journey!<br/>▶ iOS Optimisation: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices.", "metacritic": null, "released": "2014-09-10", "tba": false, "updated": "2019-10-22T14:05:54", "background_image": "https://media.rawg.io/media/screenshots/5f4/5f4ea45af042101552fb2f7db55f5a9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": null}