{"id": 75240, "slug": "drag-racing-classic", "name": "Drag Racing Classic", "name_original": "Drag Racing Classic", "description": "Drag Racing is the most addictive, nitro fuelled racing game for your iPhone and iPad! Ranked the #1 Racing app with over 100 million players worldwide!<br/>Drive 50+ real licensed cars from the world’s hottest car manufacturers including BMW, Dodge, Honda, Nissan, McLaren, Pagani and the officially licensed 1200 bhp Hennessey Venom GT™  <br/>Challenge other players online: race 1 on 1, drive your opponent’s car or participate in real-time 10-player races in Pro League.<br/><br/>LOTS OF CARS:<br/>Do you dream about seeing 1000+ HP exotics pushed to the limit on a drag strip? Would you pick an iconic Skyline GT-R, a classic 69' Mustang, or a brand new BMW M4 as your ultimate driving machine? Buy your dream car, install performance upgrades and show your skills in 1/4 or 1/2 mile races<br/><br/>UNLIMITED DEPTH:<br/>Do you think racing in a straight line is easy? Try to find the right balance between power and grip while staying in your class. Tune your car and accelerate your way to victory, Add nitrous oxide for more fun, but don't hit the button too early! Go deeper and adjust gear ratios to shave off precious milliseconds through 10 levels of cars and race categories. <br/><br/>COMPETITIVE MULTIPLAYER:<br/>Racing on your own may be fun enough, but the ultimate challenge is in the \"Online\" section. Go head-to-head against your friends or random racers, beat them while driving their own cars, or race against 9 players at once in real-time competitions. Join a team to exchange tunes, discuss strategy and share your achievements.<br/><br/>CASHPLAY TOURNAMENTS<br/>Pit your Drag Racing skills against other players today and win your CashPlay real money bonus with potential winnings ranging from $0.40 to $10. Competition is fierce, but our unique skill matching algorithm ensures that players are pitted against others of similar ability.<br/>For more information read the Drag Racing Cashplay guide here http://cashplay.co/drag-racing-cash-tournaments-walk-through-guide/ for more details.<br/><br/>AWESOME COMMUNITY<br/>It's all about the players! Connect with other car game fanatics and enjoy Drag Racing together:<br/>Drag Racing Website: http://dragracing.creative-mobile.com<br/>Facebook: https://www.facebook.com/DragRacingGame<br/>Twitter: http://twitter.com/DragRacingGame<br/>Instagram: http://instagram.com/dragracinggame<br/><br/>TROUBLESHOOTING:<br/>- If the game doesn't start up, runs slowly or crashes, please get in touch and we'll do our best to help.<br/>If you have any questions, make sure you check out our FAQ at http://dragracing.creative-mobile.com/faq/<br/>...or use one of the two ways to contact us through our Support system: https://support.creative-mobile.com/ or via e-mail at support@creative-mobile.com", "metacritic": null, "released": "2011-10-17", "tba": false, "updated": "2019-07-29T20:07:10", "background_image": "https://media.rawg.io/media/screenshots/dd9/dd9c90261caf11a90821f214e5b6a73d.jpg", "website": "http://dragracing.creative-mobile.com/games/drag-racing/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creative Mobile"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Osauhing Creative Mobile"], "esrb_rating": null}