{"id": 752499, "slug": "freelance-monster-removal", "name": "Freelance Monster Removal", "name_original": "Freelance Monster Removal", "description": "<p>Paranormal Hunters is a first person adventure game.<br/></p>\n<p>Work as a freelancer agent keeping humanity safe from all sorts of supernatural threats. Except for zombies, as we all know the job center is responsible for zombies.</p>\r\nDevelopment Status\r\n<p>The current development status is \"Don't even try to find the bugs\", or to put it more formally - Early Development.<br/></p>\r\nCharacters\r\n<p>Different levels have different characters available. Each character has their own strengths and weaknesses. Depending on which you pick you will have a harder or easier experience.</p>\r\nCharacterAttackSecondary actionHealth<br/>Pain resistancePain multiplierJump velocityRun speedKiyomiSwordFlame breath300<br/>70.1600700NatukiThrowing dagger<br/>Magic circle?100<br/>20.3700600MiaHandgun<br/>Heal/Reload7530.2500500\r\n\r\nKiyomi\r\n<p>Carrying a flaming sword and breathing fire, Kiyomi is usually the appropriate agent to deal with hostile monsters. Has a tendency to spend all her salary on tail polish though.</p>\n<p>Picking this character usually means the player will have an easy time.<br/></p>\r\nNatuki\r\n<p>Natuki has a set of 3 enchanted throwing daggers. While each dagger is powerful, the limited amount makes dealing with large groups troublesome.<br/></p>\r\nMia\r\n<p>Hunting monsters is dangerous and agents very frequently end up injured. Mia works with the department of gender equality to patch up wounded operatives so they can go on their next assignment. Mia carries a handgun just in case, but it is rarely used.</p>\n<p>Picking this character usually means the player will have a hard time.<br/></p>\r\nSystem Requirements\r\n<p>TBD, however our best guess is:<br/></p>\n<br/>MinimumRecommended<br/>CPU Score<br/>20004000GPU Score<br/>5001000", "metacritic": null, "released": "2022-03-13", "tba": false, "updated": "2022-03-14T07:17:33", "background_image": "https://media.rawg.io/media/screenshots/fe1/fe18121b9167a57950161aa83eea5b68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whitewatt", "Arekku"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}