{"id": 75245, "slug": "monster-truck-arena", "name": "Monster Truck Arena", "name_original": "Monster Truck Arena", "description": "Enter the Monster Truck Arena and drive the biggest, meanest, most exciting Monster Trucks &amp; Cars. Use ramps as an excuse for amazing jumps, drive your Monster Truck across cars that look like toys compared to you, do loop-the-loops... Most importantly, do all of it with style. The game's controls are designed in a way that makes pulling off mind-blowing tricks easy and effortless. 50 different missions will not only test your driving skills, but allow you to show off your inventiveness and imagination.<br/><br/>A SELECTION OF MONSTER TRUCKS, EACH ONE BIGGER THAN THE LAST<br/>The game features 10 different variations of Monster Trucks. Select the biggest available Pickup, Van, Sports Car, Army Truck... there's even place for a Monster Truck version of a classic Fuel Truck and a School Bus. As long as it's larger than life and looks unbelievably cool - we have it!<br/><br/>ENTER THE VAST ARENA PACKED FULL OF CHEERING CROWD<br/>Your exploits are part of an event enjoyed by thousands of spectators. You're not supposed to drive safely here. Be as flashy as you possibly can and have fun. All of the game's 50 missions are set up in a way to not only challenge you, but give you a means of expressing yourself through breath-taking tricks.<br/><br/>MASTER THE CONTROLS TO PULL OF AMAZING TRICKS<br/>Controlling your Monster Truck doesn't stop while you're in the air. Manage your speed to do backflips and land on four wheels. <br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases.<br/>_____________________________<br/>GAME FEATURES <br/>▶ VARIED VEHICLES: Drive &amp; Park 10 Unique and Different Vehicles<br/>▶ PARKING: Over 50 Precision Driving Missions to Pass!<br/>▶ ARENA: Each track is a challenge full of obstacles and opportunities.<br/>▶ ALL FOR SHOW: Drive through flames, watch fireworks, feel like a part of an exciting event.<br/>▶ 100% Free-2-Play Missions<br/>▶ CONTROLS: Buttons, Wheel or Tilt Controls<br/>▶ CAMERAS: Multiple cameras including First Person view <br/>▶ iCLOUD: Supports play between your devices &amp; automatic progress backup with iCloud<br/>▶ OPTIMISED: runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (5th Generation)", "metacritic": null, "released": "2017-02-24", "tba": false, "updated": "2019-07-29T20:28:46", "background_image": "https://media.rawg.io/media/screenshots/52b/52b35727b2e61c73334a3f78ccd64815.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Sports", "Racing"], "publishers": ["Aidem Media"], "esrb_rating": null}