{"id": 752712, "slug": "mage-against-generic-enchantmnets", "name": "MAGE Against Generic Enchantmnets", "name_original": "MAGE Against Generic Enchantmnets", "description": "<p>\n</p>\n<p>MAGE Against Generic Enchantments was written in seven days, as part of the Seven Day Roguelike Challenge.  Its home on the web is http://www.zincland.com/7drl/mage</p>\n<p><strong>Setting</strong>\n</p>\n<p>You were a mage enrolled in the prestigious MAGE academy.  This academy's     recursive acronym is Mage Against Generic Enchantment.  The founding principle is a rejection of boring magic that can be tamed by orthogonal rules.  Each spell should have its own unique charm unrelated to other magic.\r\n</p>\n<p>It didn't take long to discover the academy was a scam.  The same boring rules underlie their magic as the rest of the multiverse, except they've hidden the connections behind thick layers of obfuscation.\r\n</p>\n<p>Escape is not so easy, however, for they've placed the academy on the top of a tall tower.  The lower levels are all inhabited by monsters that make short work of students that try to leave without a gate spell.\r\n</p>\n<p><strong>Details</strong><br/></p>\n<p>Many consider a grid based map part of the definition of a roguelike.  And I wouldn't argue the point.  But does the map have to be visible?</p>\n<p>MAGE eliminates the use of text-as-graphics and instead communicates with you solely with a message stream.  On Windows you can use the built-in Text To Speech and play without a monitor!  But the intent is to not build a MUD - underneath is a very traditional grid-based roguelike with all the tactical positioning you are used to.</p>\n<p>And if it proves too much, you turn the map back on again.</p>", "metacritic": null, "released": "2022-03-13", "tba": false, "updated": "2022-03-14T08:23:53", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7a9d319a20a4537604716a1c71985b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux"], "developers": ["jmlait"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}