{"id": 752731, "slug": "conqueror-of-time", "name": "Conqueror of Time", "name_original": "Conqueror of Time", "description": "<p>A Time-Traveling Rogue made for 7DRL in 2022.</p>\n<p>Programming was done in Unity using C#.</p>\n<p>All artwork was created by me using Krita.</p>\n<p>Sound effects were created by me using jsfxr.</p>\n<p><strong>Overview</strong></p>\n<p>Fight your way through time as your past, present, and future self. Defeat all enemies and spawners to advance to the next level. Reach level 10 to claim the title \"Conqueror of Time.\"</p>\n<p>Time Traveling can be confusing!</p>\n<p><strong>Goal</strong></p>\n<p>Kill all the enemies on each period map to advance to the next level. Reach level 10 to win.</p>\n<p><strong>Player</strong></p>\n<p>You control 3 characters. Your past self, present self, and future self. Every time one character levels up, the next period self also gains the benefit. Ex. if the past self-levels up HP, the present and future also level up. If a character dies the next period selves will also die. Ex.- if the past self dies, the present self and future self will also die. If the past self ever dies, the game is over.</p>\n<p><strong>Map</strong></p>\n<p>There are 3 maps. One for the past period, present period, and future period. The layout of the map is the same, but with different features (water or grass). You can only view one map at a time. After 30 turns, you must switch to a map that has a different player character. You can never switch to a period that does not have a player character. Your characters can time travel to other periods and join forces with their other-selves. There can never be more than 2 player characters in the same period. If you ever time travel, the number of turns to switch maps is reduced by 15. You can never time travel with less than 15 turns.</p>\n<p><strong>Enemies</strong></p>\n<p>Enemies can spawn in different periods. When an enemy spawns it will also appear in later periods. Ex- an enemy that spawns in the present will spawn in the future as well. If an enemy is killed its later self will also be killed. Ex- an enemy in the past that is killed, will no longer exist in the present or future. Take advantage of this.</p>\n<p><strong>Items</strong></p>\n<p>There are several items to collect in the game. You can only have 1 weapon, 1 armor, and 2 misc. items. When an item spawns in a period, it will also exist in later periods. However, if it is picked up, it will not exist in later periods. If you drop an item, it will reappear in later periods. However, it will not happen if the item was from a previous level. You can pick up an item in the future, time travel to the past. drop it in the past, and have past self pick it up.</p>\n<p>Controls</p>\n<p>Only the mouse is used. (Sorry, not enough time to have keyboard controls.)</p>\n<p>Left-click on a tile to move. </p>\n<p>Left-click an enemy to attack. Will automatically attack with a weapon.</p>\n<p>Right-click to pick up an item.</p>\n<p>Right-click on an item panel to drop the item.</p>\n<p>Left-click to use a certain item. (Medkit, Grenade)</p>\n<p>Click ability buttons to use ability. </p>\n<p>ESC - Opens option menu.</p>", "metacritic": null, "released": "2022-03-13", "tba": false, "updated": "2022-03-14T08:27:47", "background_image": "https://media.rawg.io/media/screenshots/941/941820d9a7ec6419f521e1c007121311.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["itskdog"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}