{"id": 75275, "slug": "extreme-aeroplane-pilot-flight", "name": "Extreme Aeroplane Pilot Flight", "name_original": "Extreme Aeroplane Pilot Flight", "description": "Do you ever dreamed to be a pilot? Well we are delivering you the realistic simulation of your dreams. Play as a pilot and fly the aircraft through extremely challenging obstacles.<br/><br/>Pay your utmost attention to avoid plane crash and become an extreme plane aviator. Flight simulator 3d is an extremely challenging and addicting adventurous flying journey through city airports, mountains, oceans and islands. <br/><br/>In this aircraft simulator you will play in 20 extreme levels in order to complete this wonderful game. Missions of this game include takeoff, landing and passing through different obstacles. To make it more interesting and challenging multiple modes are available including free flying mode and career mode. In this game you will be entertained with multiple camera views, one is cockpit view and other is from outside the plane. <br/><br/>Hope you will enjoy this virtual aviation experience with this fun contributor game.  <br/><br/>Features <br/>-Extremely challenging 12 levels of sky journey.<br/>-Free flying mode for flying freely.<br/>-Career mode for time limited missions.<br/>-Two different camera views to enhance gaming experience.<br/>-An Awesome journey through different environments.<br/>-Wonderful realistic graphics.<br/>-High quality background sounds.", "metacritic": null, "released": "2014-10-01", "tba": false, "updated": "2019-08-02T03:10:52", "background_image": "https://media.rawg.io/media/screenshots/284/284db1133c4f73b8196eb7fabbf03e64_QcFGUZl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OZITECH - GAMES"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["ozi technology"], "esrb_rating": null}