{"id": 752760, "slug": "run-the-rings", "name": "Run the Rings", "name_original": "Run the Rings", "description": "<p><strong>STORY</strong></p>\n<p>An interstellar war is raging between systems, scattered across the galaxy but connected by Ring Gates between them. You have evidence that could end the war, but no one can be trusted. You'll have to fly deep into enemy territory through the Ring Gates in hopes that you can deliver this crucial package to their home planet directly.</p>\n<p>The deeper you go into the enemy's territory, one ring at a time, the more resistance you'll encounter. Luckily, much of their territory has neutral space stations that are willing to trade with anyone. Take advantage of this to upgrade your ship as you can, and be careful not to run out of fuel!</p>\n<p><strong>GAMEPLAY OVERVIEW</strong><br/></p>\n<ol><li>Maneuver your ship through space using WASD or arrow keys.  Each movement burns 1 Fuel.  If you run out of fuel you will die and the game is over.\r\n</li><li>When you come into contact with another ship, combat will occur.  If you are destroyed during combat, the game is over.  (See: Combat)\r\n</li><li>After combat you will be rewarded with a small amount of Fuel and given the choice of additional Fuel or a new card to draft into your deck.</li><li>Fly over a Space Station and you can shop for a new System or purge an obsolete System.</li><li>Pass through the Ring in the top right to proceed to the next Sector.\r\n</li><li>Reach the destination in the Final Sector to complete your mission and win the game.\r\n</li></ol>\n<p><strong>COMBAT</strong></p>\n<ul><li>You start each combat with three cards in your hand.  \r\n</li><li>Hover over each card to see the full details. \n<ul><li><li>Cost\r\n<ul><li>The resources required to play the card.\r\n</li><li>P = Power.  W = Weapons.  \r\n</li><li>Resources are obtained from Systems.\r\n</li><li>Your current Resource totals are on the left side below your ship.\r\n</li></ul></li><li>Description\r\n<ul><li>What the card does.\r\n</li><li>Check the Glossary below for more details about specific keywords.\r\n</li></ul></li><li>Card Type\r\n<ul><li>System\r\n<ul><li>Only one System can be played each turn..\r\n</li><li>Stay in play and provide resources or other benefits.\r\n</li><li>Can add additional cards to your deck.\r\n</li></ul></li><li>Action\r\n<ul><li>No limit on the number that can be played each turn, as long as you can pay the resource cost.</li><li>Are moved to the discard pile after being played.</li></ul></li></ul><ul><li>Reaction\r\n<ul><li>Played automatically during the opponent’s turn when conditions are met like being attacked.\r\n</li><li>Are moved to the discard pile after being played.\r\n</li></ul></li></ul></li></li></ul></li></ul>\n<ul><li>Play cards by dragging them from your hand to the dark blue area in front of you or double-clicking on them.  The cost, if any, is automatically deducted from your resources.  Cards with a red border cannot be played at this time.</li><li>When you are finished playing cards for the turn, click End Turn or press Enter.</li><li>Your opponent will take a turn and when the End Turn button pops back up, it is your turn again.</li><li>When damage is dealt, it takes effect in the following order until all damage is nullified or absorbed: <ul><li>An Evade reaction card immediately nullifies all damage.</li><li>One card is discarded from the player's hand for each point of damage.</li><li>Systems with the Defense keyword absorb  one point of damage per point of defense.</li><li>One system is damaged for each point of damage.  Damaged systems are moved to the discard pile.</li><li>When a ship has no systems remaining, the next point of damage destroys the ship and the combat is over.</li></ul></li><li>If you survive combat, you will be rewarded a small amount of Fuel and given the choice of additional Fuel or a new card to draft into your deck.</li><li>After your choice, you are returned to the Sector map.</li></ul>\n<p><strong>BASIC SYSTEMS</strong></p>\n<ul><li>Systems are played to provide resources and other benefits to your ship.  </li><li>These resources are used to pay the costs of cards like additional Systems (Power) or Actions like Attacks (Weapons).  </li><li>Some cards will require multiple resources or resource types.  </li><li>You can only play one new System on your turn (even if you can afford to play more).  </li><li>Systems will start producing resources on the next turn after they are played.</li><li>Systems stay in play until they are damaged and discarded.</li></ul>\r\nSystem Name<br/>CostDescriptionImageBasic Reactor<br/>FreeThe Basic Reactor has no cost and provides 1 Power per turn.  \r\n<br/>It has the Topdeck ability, which means it starts each combat on top of your deck.Basic Engine1 PowerThe Basic Engine costs 1 Power and draws an extra card each turn.\r\n<br/>It also adds an Evade card to your deck.Basic Weapons<br/>1 Power<br/>The Basic Weapons System costs 1 Power and provides 1 Weapon per turn.<br/>It also adds 3 Attack cards to your deck.<br/>\n<p><strong>BASIC ACTIONS<br/></strong></p>\n<ul><li>An unlimited number of actions can be played per turn, as long as you can afford the cost.</li><li>Actions are moved to the discard pile after being played, unless they have the Consume keyword.</li></ul>\r\nAction Name<br/>CostDescriptionImageAttack1 Weapon<br/>Attack costs 1 Weapon to use.  It deals 3 Damage to the opponent.<br/>Three Attack cards are added to the deck by each Basic Weapons System card.<br/>\n<p><strong>BASIC REACTIONS</strong></p>\n<ul><li>Reactions are played automatically during the opponent's turn when the criteria is met.</li><li>Reactions are moved to the discard pile after being played, unless they have the Consume keyword.</li></ul>\r\nAction NameCostDescriptionImageEvadeFreeEvade is automatically played from your hand when an opponent deals damage.  <br/>Evade nullifies all damage from a single damage card.\r\n<br/>\r\nEvade has the Consume keyword.  It can only be played once during each combat.\r\n<p><strong>GLOSSARY</strong><br/></p>\n<ul><li><em>Topdeck </em>- These cards start each combat on top of your deck.  They will be drawn before any non-Topdeck cards.\r\n</li><li><em>Consume </em>- These cards can only be used once in each combat.\r\n</li><li><em>Defense </em>- These cards absorb the listed amount of incoming damage before other systems are hit.\r\n</li></ul>", "metacritic": null, "released": "2022-03-13", "tba": false, "updated": "2022-03-14T08:36:18", "background_image": "https://media.rawg.io/media/screenshots/5c0/5c035c9a5a6f8db1b2b04884bc6d3a4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["SlightlyMadman", "mikefictitious"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}