{"id": 752878, "slug": "dungeon-of-the-last-tour", "name": "Dungeon-of-the-Last-Tour", "name_original": "Dungeon-of-the-Last-Tour", "description": "## Background\r\n<p>Hi, 7drl community, this is my very first time joining an Itch Game Jam Event. This time, I'd like to design a multiplayer roguelike girls' last tour fan game to support those fright for Ukraine, I have finished the charsets, but turn out to run out of my time in the last few days... To be honest, this is not even a prototype or a proof of concept, but I think I should still submit it so that someone can find the potential of the EasyRPG multiplayer framework and help me to improve it in the future.<br/></p>\n<p>Inspired by [REM9](https://vgperson.com/games/rem9.htm), but not just randomize the connection between rooms, we would prefer to have a complete experience of a classical roguelike game. But RM2k3 doesn't have a built-in script language inside the engine, right? Although it is Turing-complete, I must say it is almost impossible to implement complex game logic using only common events. :(</p>\n<p>But RM2k3, in some sense, is open source (with https://github.com/EasyRPG/Player).</p>\n<p>You could modify the player code so that has CPP as a scripting language in RM2k3! This opens up a great deal of imagination. For example, you can use [emscripten](https://github.com/emscripten-core) to run your game in a web browser, and implement some multiplayer game logic like what they do in [ynoproject](https://github.com/ynoproject/). And of course, you can also use [libtcod](https://github.com/libtcod/) to make your life easier when writing roguelike!</p>\r\n## About the multiplayer features\r\n<p>Press Tab to toggle the focus window between chat and game. You must have a nickname so that can call common events through messages. (e.g. generate a random map, shot other player, etcs)</p>\n<p>In order to maintain the original flavor of the Dream Diary series of games, the originally [ynoproject](https://github.com/ynoproject/) didn't support execute common events across each client, so I modify lots of their code, now [my code](https://github.com/lychees/ynoclient) is in a mess, but can work in some sense.</p>\n<p>For example, you can actually shoot other players in the dream with your AK-47 if you want.</p>\n<br/>\r\n## About the gameplay\r\n<ul><li>[Demo](https://yno.yumenikki.info/?game=dungeon-of-the-last-tour)</li><li>[Source Code](https://github.com/lychees/Dungeon-of-the-Last-Tour)</li></ul>\n<p>This game is built on the top of [Yumehazard](https://yumenikki.info/archives/yumehazard/). (since it is a RM2k3 game, and has guns).</p>\n<p>There is a black cat inside your room, talk to it and you will teleport to a special dream, in this dream, you can play as Yuri or Chito, explore in a random maze generated with libtcod.<br/></p>\n<p>There are several hidden boxes inside the maze, find them and you will have free medel. Collect those medals you can upgrade existing weapons or buy new ones in Yumehazard more easily.</p>", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T09:07:13", "background_image": "https://media.rawg.io/media/screenshots/11a/11afd97efebd3e7547fcea5294aed27c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MinakoKojima"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}