{"id": 752821, "slug": "astroecologist-roguelike", "name": "Astroecologist Roguelike", "name_original": "Astroecologist Roguelike", "description": "<p>Made in 7 Days for 7DRL 2022</p>\n<p>Explore randomly generated islands, observe new wildlife and try to bring some creatures back with you to space to research in this causal Sandbox Roguelike!  Each creature has unique behaviors, interactions and routines that change throughout the day that you'll need to figure out if you want to be successful in getting them safely on board your ship.  Some may hide during the day, or only be active at night.  You can go for the straightforward method of tranq-ing and sokoban-ing unconscious  animals around. Maybe you want to outwit or corral them in by chasin' them around (or being chased?).   Once you got them onboard use your ships computer to open an close containment units to secure them in place before traveling back to the Orbital Research Station above the planet.  Each time you return to the surface you'll land on a new island.</p>\n<p>This is a low stakes / low violence game about discovery and interaction.  You don't even deal damage by bumping, but you might push things around.  There's no win state, and 11 different creatures to study.</p>\n<p>Throw Rocks with R, Shoot your Tranq Gun with F, X to cancel, Close Doors with C.  Bump your ship computer or the researcher at the station to get a list of operations it can perform too.  The only place to heal or restock ammo is at the space station.</p>\n<p>Fonts by https://somepx.itch.io/ / https://twitter.com/somepx</p>", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T08:50:57", "background_image": "https://media.rawg.io/media/screenshots/2bd/2bd15cdc03965219fc9e574aecc10b5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jay"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}