{"id": 753072, "slug": "through-a-misty-arch", "name": "Through a Misty Arch", "name_original": "Through a Misty Arch", "description": "<p>\n</p>\n<em><strong>In Through a Misty Arch you get lost in the ruins of Hautrell. Normally a calm place to visit and admire, these man-made structures date back to the 12th century.<br/><br/>On the faithful day of your visit, a heavy fog has rolled in. Inspired by how this makes the place look, you traverse deeper, only to find you might not be alone...</strong></em>\n\r\nControls:\r\n<p><strong>[Joypad stick]</strong> or <strong>[&lt;][^][v][&gt;] </strong>  Navigation<br/></p>\n<p><strong>[Joypad X] </strong>or [Q]   Attack, Interact<br/></p>\n<p><strong>[Joypad [] ]</strong> or<strong> [W]  </strong> Block, Target<br/></p>\n<p><strong>[Joypad O] </strong>or <strong>[E]  </strong>Jump<br/><br/></p>\r\nTips:\r\n<p>There's a friendly character near your starting location that will hand you a shield that might come in useful.</p>\n<p>If you feel like you cannot make a jump, try and find someone to give you some better shoes.</p>\n<p>Can't win a fight? Maybe don't start one.<br/></p>\n<p>Hold target, attack &amp; down while jumping to perform a jump attack.<br/></p>\r\n\r\n\r\nDeveloper's notes:\r\n<p><em>Through a Misty Arch is my submission for the 7-Day Roguelike challenge in which you have 7 days to programm a roguelike from scratch. All assets solo made within the timeframe. As often is the case, it turned out different than what I had imagined but I'm still pleased with how much I managed to get done within the timeframe (despite catching covid in the last few days).<br/></em></p>\n<p><em>I consider the challenge to be a succes in that I created a game with a start and end that has some core roguelike elements, though I feel I failed in re-creating the open-ended playstyle / player expression</em><em> possible in a good roguelike.<br/></em></p>\n<p><em>The game was made in godot which alongside 3D game programming I'm quite new to, though having a blast exploring it. Many sounds were placeholders that never got replaced, all sound effects + music were made on a modular synthesizer (Mutable Instruments Rings + Beads only), all models were done with primitive geometry inside the godot editor.</em><br/></p>", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T09:55:34", "background_image": "https://media.rawg.io/media/screenshots/991/991e5eb162fb80cd38a6b3c1d7a46d1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Supermuch"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}