{"id": 753017, "slug": "alien-vs-operator", "name": "Alien vs. Operator", "name_original": "Alien vs. Operator", "description": "<p><strong>ALIEN VS. OPERATOR #7DRL</strong><br/></p>\n<p>Remember the old XTA 4000? According to the documents you still have the equipment –and knowledge– to operate these clunky boys. There are some standing around in the deep floors of the first Mars mine. Probably collecting dust or repeatedly banging into the same wall for the last dozen of years. Yet they might be our only hope. Some alien creatures are breeding down there, rapidly multiplying in numbers. They are highly aggressive and if they'll escape the depths, the people of Forlorn will be no more. We were able to locate the alien queens and establish communication to some of the XTA 4000s. Here, take that manual in case you forgot to shoot their lasers. And good luck.</p>\n<p><strong>MANUAL</strong><br/></p>\n<p>Each turn you can send a list of commands to one active robot. Active robots are highlighted as yellow on blue. First press the robot's ID (1-9) and then\r\nsome of the following: <br/></p>\n<ul><li>wasd|hjkl|arrow key – move in that direction</li><li>WASD|HJKL|shift + arrow keys – shoot in that direction</li><li>. – send a photo of the surroundings</li><li>r – repeat the rest of the commands forever</li></ul>\n<p>You can always tap BACKSPACE to change your commands. You will see a preview of what the robot will do. Once you press ENTER the robot will execute the commands – whether active or\r\ninactive.</p>\n<p>An active and idle robot will send photos of their surroundings.\r\nIf a robot gets hit by an alien, it will deactivate. If a robot\r\ngets shot by another robot's laser, it will activate. At the start inactive robots may still have old commands.</p>\n<p>In a turn, first all robots will do their action in ascending ID order. Then all aliens will do their action in random order. Entities can push each other around. Entity A can see position B if the rectangle spanning from A to B contains no walls.<br/></p>\n<p>You can give up and see a replay or try again if you press q. Made for the 7DRL 2022.<br/></p>", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T09:43:19", "background_image": "https://media.rawg.io/media/screenshots/23c/23c647a08528791a0b3844320cd00423.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["xash"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}