{"id": 753053, "slug": "the-typists-quest-7drl", "name": "The Typist's Quest (7DRL)", "name_original": "The Typist's Quest (7DRL)", "description": "<p>Become a Typist and enter a dungeon to defeat some bad guys. The Typist’s Quest is a game combining roguelike with typing game, as all your actions have to be achieved using textual commands.</p>\n<p><strong>Controls:</strong></p>\n<p> - A-Z: Write commands</p>\n<p> - Backspace: Remove the last letter.</p>\n<p> - Arrows up/down: increase and decrease the music volume.</p>\n\n<p><strong>Some tips:</strong></p>\n<p> - In case the intro is not very clear about this, the thin panel on the left is a very important one, as it shows a list of letters and the amount that you own for each of them.</p>\n<p> - When you play a command, you have to pay each letter. If one letter is missing, the command cannot be played anymore! Be careful, especially with less frequent letters such as J, Q, X, Z...</p>\n<p> - Press TAB to see the list of commands that you can play. The number next to the command tells how many times it can be played, considering your letters reserves. The commands that are greyed out cannot be used in the scene (for instance, it is not possible to play an attack command while in the dungeon).</p>\n<p> - The power of a command depends on the rarity of its letters. The \"SQUEEZE\" command will deal a lot more damage than the \"CUT\" command.</p>\n<p> - Take as many chests as possible, learn new commands and reinforce letters. Before confronting the boss, you should have at least 3 different types of attacks.</p>\n<p> - Don't hesitate to flee. Sometimes it's better to run away and improve instead of wasting your precious letters on an enemy that will dodge, block or heal your damages.</p>\n<p><strong>7DRL:</strong></p>\n<p>This game was developed in 7 days for the 7DRL (https://7drl.com/). Everything was creaetd within the 168 hours, except:</p>\n<p> - The Unity engine and a few additional packages (Input System, 2D IK and TextMeshPro).</p>\n<p> - The sound effects all come from the \"Game Jingles and 8-Bit Sound FX\" asset created by wowsoundg on the GameDev Market. (https://www.gamedevmarket.net/asset/game-jingles-and-8bit-sound-fx-5358/)</p>\n<p> - The text font is called Goblin Script and is available for free. (https://www.1001freefonts.com/fr/golem-script.font)</p><p>If you want to have a look at the code, it's publicly available at https://github.com/nistace/7DRL_202203<br/></p>", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T09:51:44", "background_image": "https://media.rawg.io/media/screenshots/20c/20cc58523d33fba83376cea3e52b4353.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Nathan"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}