{"id": 75306, "slug": "3d-dubai-parking-simulator-drive-real-extreme-supe", "name": "3D Dubai Parking Simulator Drive Real Extreme Super Sports Car", "name_original": "3D Dubai Parking Simulator Drive Real Extreme Super Sports Car", "description": "Welcome to Dubai – home of the Ultra Exotic Sports Car! Prove your Parking &amp; Precision Driving Skills in the most insane GT Cars, Limos and Supercars on the Planet! <br/><br/>UNLOCK 15 EXOTIC CARS<br/>“Bling” takes on new meaning in Dubai! Collect &amp; Cruise in a beautiful collection of desirable motors! Can you earn them all?<br/><br/>MASTER YOUR PARKING <br/>Complete a series of Parking, Driving and Racing missions, including dealing with real traffic, obstacle courses, road blocks and tight corridors to navigate. Remember your cars are extremely valuable, so please try not to crash! <br/><br/>REAL ROADS, REAL CHALLENGE<br/>Discover Dubai in Ultra HD detail! Cruise the Boulevards, stop at the various Hotels, Shops and Gas stations in 75 challenging missions.<br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes, which alter the rules slightly to make the game easier, are available through optional In-App Purchases.<br/><br/>_____________________________<br/>GAME FEATURES:<br/>▶ 15 VEHICLES TO COLLECT: Sports Cars, Extreme Limos &amp; even a Police Supercar!<br/>▶ 75 PARKING MISSIONS: Go for GOLD on Every Level!<br/>▶ DELICIOUS DUBAI: Beautifully detailed location<br/>▶ DYNAMIC TRAFFIC SYSTEM: Deal with Real Traffic on the roads<br/>▶ 100% Free-2-Play, No Strings Attached<br/>▶ CUSTOM CONTROLS: Buttons, Wheel or Tilt Driving Controls <br/>▶ CAMERA VIEWS: Multiple Cameras, including Drivers Eye View  <br/>▶ iCLOUD: Supports play between your iDevices &amp; automatic progress backup with iCloud<br/>▶ OPTIMISED: runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (5th Generation)", "metacritic": null, "released": "2016-06-04", "tba": false, "updated": "2019-07-29T20:01:04", "background_image": "https://media.rawg.io/media/screenshots/6b5/6b54835d39218845223a3fc57e7bbc7c_tjUqP9s.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}