{"id": 753008, "slug": "caught-by-darkness-udc-jam", "name": "Caught by Darkness (UDC Jam)", "name_original": "Caught by Darkness (UDC Jam)", "description": "<p><strong>Made from Scratch for the Unity Developers Community Jam #21</strong><br/><br/>Caught by Darkness is an asymetric Killer vs Survivors multiplayer game.<br/></p>\n<p>The minimun players is 2 and maximum 4, where the game it's more enjoyable. So ask your friends to join or check in the game's discord link to find teammates.<br/><br/><strong>Bugs? Hopefully not many!</strong></p>\n<p>Of course we went for the no-no route of multiplayer, please be gentle with the bugs you may encounter on the way <br/><br/><strong>Copy Room ID does not work</strong></p><p>Yep, we spent time creating that beautiful button in a combination of Unity externs and Javascript for nothing, we didn't anticipate it was not going to work here in Itchio :(</p>\n<p><strong>Tutorial and How To Play</strong><br/><br/>One player is the Alien Shadow and the rest are the survivors in a space station.<br/><br/>The Shadow should \"touch\" all the survivors to deactive their lights and leave them in the darkness. If all the suvivors are deactivated, the Shadow wins.<br/><br/>Survivors should turn on all the interrupters and open the exit to the escape pods. <br/><br/><strong>Team</strong><br/><br/>- KiwiArgo:  programming, level design and Unity things<br/>- Chernita : UI design and illustrations<br/>- Zathmell: 3D art, texturing and animations<br/>- DarkThrone: Music and additional Javascript and webserver support <br/>- Eritrocito: Lots of testing, reporting and searching for friend to have playtest sessions during the week.<br/><br/>Everyone participated in game design!<br/><br/><strong>Development</strong><br/><br/>We created this game for the UDC Jam 21 using Unity (of course :P) and Photon for the multiplayer. We know that doing multiplayer was risky from many aspects but we still had tons of fun during these days. <br/><br/>If you are interested in knowing more about the development be sure to check out the discord link inside the game.<br/><br/><strong>Special Thanks</strong><br/>Thanks to all the friends who helped us to test this project, testing a 4 players online game in just a short amount of time with so many bugs appearing all the time was challening! <br/><br/>Moshy, Facu2rimea, vexxon, Ninjera, ToxicBionic, Marcos, Kyyn, Mirko,Heavens Door, Chuleta, Nicruz, CopsyQF, DraconInt</p>", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-03-14T09:41:50", "background_image": "https://media.rawg.io/media/screenshots/8e2/8e20ae870e5240dce9ac415344978260.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KiwiArgo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}