{"id": 753219, "slug": "pantheon-itch-mranaglyph", "name": "Pantheon (itch) (mranaglyph)", "name_original": "Pantheon (itch) (mranaglyph)", "description": "<p>A story driven world, spanning multiple layers of reality, with gods and monsters trying to stop you from finding the truth about your arrival. You will not find the story easily, but will need to piece it together from character dialogue, item descriptions, and a few sparse cutscenes. The battle system is as easy or as complex as you want it to be. If you choose, you can explore and grind, which increases the difficulty of the enemies you will encounter, or simply run from place to place. Despite being story driven, there is no penalty for ignoring the story, so enjoy any way you want!</p>\n<p>Features Include: <br/>Souls-Like\r\n</p>\n<p>Multi-Layered Reality\r\n</p>\n<p>Pixelated, Top-Down RPG\r\n</p>\n<p>Exploration Encouraged\r\n</p>\n<p>60 Different Enemy Types\r\n</p>\n<p>80+ Playable Locations\r\n</p>\n<p>Scaling Difficulty\r\n</p>\n<p>Turn-Based Battle System\r\n</p>\n<p>Huge Selection of Weapons, Armors, and Skills\r\n</p>\n<p>A Dozen Different (Main) Character Classes\r\n</p>\n<p>Multiple Endings [3]\r\n</p>\n<p>10-30 Hours of Content (Including Optional Content)\r\n</p>\n<p>WARNING ABOUT PHOTOSENSITIVITY/EPILEPSY SEIZURES:\r\n</p>\n<p>A very small percentage of individuals may experience epileptic seizures or blackouts when exposed to certain light patterns or flashing lights. Exposure to certain patterns or backgrounds on a television/monitor screen or when playing video games may trigger epileptic seizures or blackouts in these individuals. These conditions may trigger previously undetected epileptic symptoms or seizures in persons who have no history of prior seizures or epilepsy. If you, or anyone in your family has an epileptic condition or has had seizures of any kind, consult your physician before playing.\r\n</p>\n<p>IMMEDIATELY DISCONTINUE use and consult your physician before resuming gameplay.\r\n</p>\n<p>If you (or anyone playing the game) experience any of the following health problems or symptoms:\r\n</p>\n<p>Dizziness\r\n</p>\n<p>Altered Vision\r\n</p>\n<p>Eye or Muscle Twitches\r\n</p>\n<p>Loss of Awareness\r\n</p>\n<p>Disorientation\r\n</p>\n<p>Seizures\r\n</p>\n<p>Any Involuntary Movement or Convulsion\r\n</p>\n<p>RESUME GAMEPLAY ONLY ON APPROVAL OF YOUR PHYSICIAN.\r\n</p>\n<p>Use and handling of video games to reduce the likelihood of a seizure:\r\n</p>\n<p>Use in a well-lit area and keep as far away as possible from the television/monitor screen.\r\n</p>\n<p>Avoid large screen televisions/monitors. Use the smallest television/monitor screen available.\r\n</p>\n<p>Avoid prolonged playing of the game.\r\n</p>\n<p>Take a 15-minute break during each hour of play.\r\n</p>\n<p>Avoid playing when you are tired or need sleep.\r\n</p>\n<p>Stop playing immediately if you experience any of the following symptoms:\r\n</p>\n<p>Lightheadedness\r\n</p>\n<p>Nausea\r\n</p>\n<p>Any Sensation(s) Similar to Motion Sickness\r\n</p>\n<p>Discomfort or Pain in the Eyes, Ears, Hands, Arms, or Any Other Part of the Body.\r\n</p>\n<p>If the condition persists, consult a doctor.\r\n</p>\n<p>Thank you for your time, and thank you for playing!\r\n</p>\n<p>~Pantheon Dev<br/></p>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T10:27:07", "background_image": "https://media.rawg.io/media/screenshots/25b/25b5ac42b82e4f0e86cb8a2b3aa6f19a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mranaglyph"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}