{"id": 75330, "slug": "parkers-driving-challenge", "name": "Parker's Driving Challenge", "name_original": "Parker's Driving Challenge", "description": "Thunderbirds Are GO. Take on tons of exciting missions in the game based on the highly popular TV show! Become Parker - Lady Penelope's devoted driver - and Learn To Fly, Engage in Car Chases and Complete Precision Driving Missions!<br/><br/>You will be tasked with foiling the nefarious The Hood’s plan. Put an end to his scheming by completing all of the challenges put before you with precision and skill!<br/><br/>Using Brains' Lab, you will get to upgrade your car and try out crazy innovations such as flying abilities, hot-rod engines and even a Monster Truck version of the famous FAB 1 Car!<br/><br/>Hop into the driver's seat and prove you're skilled enough to stop The Hood... Thunderbirds Are Go style!<br/><br/>3 MISSION TYPES<br/>To stop The Hood from finishing his plan you'll have to complete multiple varied missions. Listen carefully to instructions from Lady Penelope and Mission Control to make sure you get everything right!<br/><br/>PRECISION PARKING<br/>Lady Penelope doesn't take kindly to car crashes, so learn to handle the FAB 1 and adjust to its changing performance! With each upgrade installed by Brains, your car will learn new tricks - make sure you get to know them! Start out with simple lessons and training, but The Hood won’t stay put for long. Your best driving skills may be required soon!<br/><br/>HUNT THE HOOD<br/>To stop The Hood you will have to locate him and engage in high-speed Car Chase missions. Ram him off the road... any way you like!<br/><br/>SEARCH &amp; RECOVER<br/>Search &amp; Rescue Missions will require you to find and pick up essential items using your Radar. Do it as quickly as possible to earn even more Research for Brains! Are you swift enough to recover everything in the time limit?<br/><br/>FAB UPGRADES<br/>FAB 1 can be upgraded with cool gadgets and enhancements in Brain's Lab. With each completed mission you will earn Research Funding. Complete your tasks quickly enough, and you'll get more! Don't keep Brains waiting - he's always eager to develop new inventions and upgrades!<br/><br/>SAVE THE WORLD<br/>Stop The Hood before he can complete his monstrous machine! If he succeeds in his nefarious plan, he'll be able to funnel all of the sun's energy into his evil hands. Don't let that happen! Only you can save the day!<br/><br/>OUR FREE TO PLAY PROMISE<br/>The Main Game Mode is 100% FREE to Play, all the way through, no strings attached! Extra Game Modes that alter the rules slightly to make the game easier are available through In-App Purchases.<br/><br/>GAME FEATURES<br/>▶ Be Parker! Drive the Famous Thunderbirds FAB 1 Car!<br/>▶ Precision Driving, Car Chase &amp; Search Missions!<br/>▶ Take on The Hood - He must be stopped!<br/>▶ Fly, Weave &amp; Park your way through 40 driving Missions<br/>▶ 100% Free-2-Play, No Strings Attached!<br/>▶ iCloud Support – continue your career on your other devices!<br/>▶ Customisable Control Methods (Tilt, Buttons, Steering Wheel)<br/>▶ Multiple Views (including Bonnet Cam)<br/>▶ Runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (5th Generation)", "metacritic": null, "released": "2017-01-18", "tba": false, "updated": "2019-07-29T20:05:36", "background_image": "https://media.rawg.io/media/screenshots/545/54506d340fd3aae0bd55d6b5a3e59a68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}