{"id": 753357, "slug": "undeads-vs-humans-demo", "name": "Undeads vs Humans Demo", "name_original": "Undeads vs Humans Demo", "description": "<p><strong>Deck construction</strong><br/>Build a deck of undead army with a fitting strategy to beat the levels. 3 cards will be dealt to your hand randomly. Pick one to build and defend against the incoming Humans. Your deck will refill itself when empty. If one single Human passed through your defend line, you would fail the level. Complete the levels to gain Blood Gems to unlock new undeads to improve your deck to beat the higher levels.<br/><br/><strong>Self Exploration</strong><br/>The game doesn't explain much and the player have to explore and figure out how each Undead and Human works. Which give rich contents for streamer/reviewers,<br/><br/><strong>It is NOT an easy casual Tower Defense (TD).</strong><br/>Normal mode gets harder and harder toward level 25, but Hard mode is on another level of difficulty, starting at level 1. New strategies are needed to beat the levels in Hard-mode, few wrong tower placements can cost the win.<br/><br/><strong>Game Contents</strong><br/>- 25 Normal levels<br/>- 25 Hard levels<br/>- 24 Undeads to be unlocked<br/><br/>If you find the game is too hard, then there are tutorial videos of how to beat Normal levels on Youtube. How to beat Hard levels is left for the Community to discover.<br/><br/>Would you be the first to beat all 25 Hard levels? Would you be the first to unlock every single undead?</p>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T11:07:24", "background_image": "https://media.rawg.io/media/screenshots/04a/04a6538a5bef3c021330b11fea0bd0da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UnknownMagicMain"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}