{"id": 753458, "slug": "dungeon-of-rogule-7drl", "name": "Dungeon Of Rogule (7DRL)", "name_original": "Dungeon Of Rogule (7DRL)", "description": "<p><strong><em>Dungeon Of Rogule</em></strong> is a mashup of everyone's favorite daily word guessing game and a roguelike. When I thought of this I didn't have much of a concept beyond \"<em>Wordle</em> is played in a grid, and so are roguelikes\" but I went and ran with it.</p>Controls<p><strong>On Desktop: </strong>You can just type in <em>Wordle</em> mode (or click the keys if you really want). In roguelike mode use WASD to navigate and attack adjacent enemies, press H to use a Heal Spell (I think you can also click that area).</p><p><strong>On Mobile: </strong>Use the keyboard as you normally word in <em>Wordle</em> mode. In roguelike mode swipe to move around or attack enemies, and tap the healing spell area to use one. Note that the mobile controls are experimental and might behave weirdly.</p>\r\nWord Guessing\r\n<p>Gameplay is simple. First you guess a word, as you do. Once you guess a valid word, the game will swap over to roguelike mode.</p>\n<p>Guessing the correct word is the only way to win. Rules are the same as <em>Wordle</em>, so green means you've positioned correctly, orange means it's in the word but in the wrong position, and gray means it's not in the word.</p><p>Unlike <em>Wordle</em> you can play as many times as you want every day.</p>\r\nRoguelike\r\n<p>The roguelike portion is an <em>868-HACK</em>-like, so you can only move around and attack adjacent enemies. You also have three Heal Spells that you can use to heal yourself at any time.</p>\n<p>Correctly guessed letters yield a treasure, which is usually just health but can be stat raising items. Missed guesses will cause a monster that looks like that letter to spawn. You have to defeat all of the monsters in order to get back to the word guessing portion.</p>\n<p>Enemies don't move (<em>Desktop Dungeons</em> style; as you can see I have attempted to steal ideas from as many games as possible) so you have to engage with them. Enemies will always attack you back.</p>\n<p>There's experience and leveling and stats and some amount of resource management. It's also very possible that it's not well balanced (for instance if you make a very bad guess) and sometimes you will just lose very badly. Also if you lose in roguelike mode you won't ever know what the word was, which is kind of sad.</p>\r\nOther Things\r\n<p>As this is a jam game, it has limited testing. I tested it on Safari and Firefox on my Macbook Air and in Safari on my iPhone, so there might be weird issues on other browser/OS combos. Mobile support is pretty rudimentary and might be a little finicky. If you find any really bad bugs let me know and I'll try to fix them!</p>\n<p>Thanks for reading, let me know what you think!</p>", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-03-14T11:32:54", "background_image": "https://media.rawg.io/media/screenshots/728/7283190b6875d516406df199254fba0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mantis-Eye Labs"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}