{"id": 75363, "slug": "extreme-off-road-truck-driver", "name": "Extreme Off-Road Truck Driver", "name_original": "Extreme Off-Road Truck Driver", "description": "Travel the most dangerous roads of world hill range to become a real truck driver. Play Offroad Truck Driver Simulator to experience reckless truck driving on rugged terrain. Drive 4x4 jeep, passenger bus and transporter truck on bumpy roads.<br/><br/>It takes guts of a daredevil to face dangers on slippery tracks around steep hills. Grab wheels of gigantic truck and embark on real trucker adventures in offroad driving mania 2016. Pick up tourists from the city in passenger bus and take them to mountain top. Drive oil tanker up the hill climb and deliver fuel supply to the gas station for refueling. Make money by driving transporter truck or semi trailer on hilly roads. Handling some big rig vehicles on uncontrollable truck roads is tough job for newbie driver. Steer the big truck and SUV cars on curvy roads and drive fast to transport cargo before deadline.<br/><br/>You’ve played school bus parking game in city streets, now as real driver show mad truck parking skills in 4x4 off-road trucks. Fire engine of gigantic vehicles and start career as a cargo transporter in powerful logging truck. Pick and drop hill climbers in a school bus at the mountain top. Skydivers are secretly visiting the town to jump off the hills in parachute. Get cash by transporting tourists to their desired locations in offroad truck. Your rides are parked in shelter, start the engine and kick off the endless journey. Enjoy free ride in the valley with expert driving in euro truck to transport logs and cargo containers.<br/><br/><br/>Game Features:<br/>20 epic truck driver missions on most treacherous roads<br/>Drive multiple crawler trucks, school bus, jeeps and transporter trailer<br/>Huge open world to explore around steep mountains<br/>Smooth car driving controls for best trucking experience<br/>Immersive 3D graphics and detailed car dashboard view<br/><br/><br/>Download Offroad Truck Driver Simulator game to enjoy challenging truck driving missions across most dangerous muddy terrains. Give us your valuable feedback in the reviews section so that we may improve our games in future releases.", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2019-08-02T03:10:30", "background_image": "https://media.rawg.io/media/screenshots/676/6765825368503ed411e8dcbce5ba0d21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["OZITECH - GAMES"], "genres": ["Simulation", "Racing"], "publishers": ["ozi technology"], "esrb_rating": null}