{"id": 75373, "slug": "roof-jumping-3-stunt-driver-parking-simulator-an-e", "name": "Roof Jumping 3 Stunt Driver Parking Simulator an Extreme Real Car Racing Game", "name_original": "Roof Jumping 3 Stunt Driver Parking Simulator an Extreme Real Car Racing Game", "description": "Roof Jumping Returns, in the biggest and best Roof Jumping Stunts game we’ve ever made!! Discover a huge city playground packed full of exciting jumps, stunts, secrets and 75 intensely challenging Missions. Collect and race 15 amazingly detailed Stunt-Tuned Cars to victory. Take your racing to the rooftops! <br/><br/>15 COOL CARS<br/>Enjoy a huge selection of incredible stunt-tuned cars. From 4x4’s, Sedans and Sports Coupes to Customized Race Trucks, Hyper-cars and even an Ice Cream van!<br/><br/>MASSIVE MAP<br/>Smash, Slide and Stunt your car through the detailed city courses. Jump over huge container ships, between tall buildings and over some ridiculous gaps! Race on narrow floating roads and road rally courses. Destroy some furniture! Push your driving to the limits to get the best rewards!<br/><br/>INSANE STUNTS<br/>You won’t believe what these cars can do! Enter 75 unique and crazy missions packed full of jumps, stunts, ramps and scarily narrow platforms all designed to put you driving to the test, but please don’t try this in real life! <br/><br/>FREE TO PLAY<br/>The main game is 100% FREE to play, all the way through with no strings attached! Extra Modes are available through In-App Purchases to alter the rules slightly and make the game easier. Each mode has separate leaderboards to make for totally fair competition.<br/><br/><br/>GAME FEATURES\t<br/>▶ STUNT DRIVING ACTION: Enter 75 Intense New Missions!<br/>▶ 15 COOL CARS: Collect 15 Awesome Stunt-Tuned Cars!<br/>▶ MASSIVE MAP: Discover Hundreds of Insane Jumps &amp; Stunts!<br/>▶ DESTROY: Beat the competition &amp; destroy some furniture whilst you’re at it!<br/>▶ 100% Free-to-Play, no strings attached!<br/>▶ Customizable Control Methods (Buttons, Steering Wheel or Tilt) <br/>▶ Multiple Views (including Bonnet Cam) <br/>▶ Extra “Easy” Game Modes available as optional In-App Purchases <br/>▶ Runs on anything from or better than the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (4th Generation)", "metacritic": null, "released": "2016-04-16", "tba": false, "updated": "2019-07-29T20:29:18", "background_image": "https://media.rawg.io/media/screenshots/88c/88c5bc217970f336499e3fb6b472a56a_cY3NzRO.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Sports", "Racing"], "publishers": ["Aidem Media"], "esrb_rating": null}