{"id": 75394, "slug": "sports-car-test-driver-monaco-trials", "name": "Sports Car Test Driver: Monaco Trials", "name_original": "Sports Car Test Driver: Monaco Trials", "description": "What better way to explore a beautiful coastal city than from behind the wheel of a luxury sports car? Pick one of the impressive, highly detailed vehicles and show your driving skills in this demanding environment. The city is your greatest friend and the greatest enemy. It will amaze and astonish you with its views, while demanding your full attention with its narrow streets and crowded intersections.<br/><br/>In addition to driving around the city you will enter complex mazes of multiple parking lots. It is there that you will have to drive with the utmost care. Getting out into the sun again after the visit in one of them will be a reward on its own. But not the only one, of course.<br/><br/>For your performance you will be rewarded with cash that you can use to buy better cars and gain access to more difficult challenges. Complete them all!<br/><br/>10 AMAZING CARS<br/>There’s no place for meager, second class cars here. Each of the available vehicles is a work of art, a beauty in form and performance. Luxury sports cars, a powerful 4x4, even a limo and a classic race car – every one of them is a pure joy to drive.<br/><br/>REALISTIC TRAFFIC<br/>The narrow streets of this coastal city are bursting with traffic. Be weary, especially on the intersections and roundabouts!<br/><br/>BEAUTIFULLY RENDERED CITY<br/>You will drive near the coast, turn around and go uphill into enchanting alleys, exploring every nook and cranny of this beautiful city. Behold its beauty, but don’t underestimate the challenges it puts before you!<br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases. Each mode has separate leaderboards to make for totally fair competition!<br/><br/>GAME FEATURES<br/>▶ IMPRESSIVE CAR COLLECTION : Drive 10 Awesome Cars<br/>▶ DYNAMIC TRAFFIC: Deal with Real Traffic AI<br/>▶ PRO PARKING MISSIONS: Huge campaign to beat, earn in-game money for your progres<br/>▶ 100% Free to Play Missions<br/>▶ CONTROLS: Buttons, Wheel, Tilt &amp; MFi Game Controller Support<br/>▶ CAMERAS: Multiple cameras including First Person view for full immersion<br/>▶ iCLOUD: Supports play between your devices &amp; automatic progress backup with iCloud", "metacritic": null, "released": "2017-05-19", "tba": false, "updated": "2019-07-29T20:30:01", "background_image": "https://media.rawg.io/media/screenshots/6c6/6c6a974dff8e8bf5a49c249fff1468ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Sports", "Racing"], "publishers": ["Aidem Media"], "esrb_rating": null}