{"id": 754035, "slug": "on-dragon-two-lives", "name": "On Dragon Two Lives", "name_original": "On Dragon Two Lives", "description": "<p>🚧THIS PROJECT HAS BEEN PAUSED - TEMPORARILY - SO YOU CAN STILL FIND SOME BIGS, BUT NOTHING THAT WILL HURT GAMEPLAY🚧</p>\n<p>- IN THIS GAME WE BRING YOU A DIFFERENT PROPOSAL WHERE YOU'LL HAVE TO MANAGE THE 4 CHARACTERS FINDING THE BEST STRATEGIES AT ALL TIMES</p>\n<p>- OBJECTIVE: DESTROY THE ENEMY BASE BEFORE YOURS IS DESTROYED</p>\n\n<p>- HP RECOVERY: YOU NEED TO KILL ANY ENEMY THAT SPAWNER A DRAGON EGG</p>\n\n<p>CONTROL: MOUSE RTS</p>\n<p>- WITH THE CHARACTER SELECTED LEFT CLICK ON THE PLACE YOU WANT THE PLAYER TO MOVE;</p>\n\n<p>- THE SORCERER RESURRECTS PLAYERS AND SELF RESCUES HERSELF</p>\n\n<p>- YOUR DRAGON IS YOUR BASE AND HE HELP YOU DESTROY THE ENEMY BASE - YOU DON'T CONTROL HIM - HE FIGHTS WITH THE GIANT AND THE ONLY ONE WHO I COULD HELP HIM IS HIS ARCHER FACING HIM</p>\n<br/>\n<p>- YOU HAVE A DEFENSE SYSTEM - AUTOMATIC - WHERE YOU DEFEND 100% REMOVE / DODGE THE ENEMY BLOW, BUT HE CAN ALSO DO THE SAME</p>\n\n<p>- YOU HAVE A POWER UP AND TO RELEASE IT YOU NEED TO WAIT FOR A COOLOWN. THIS RELEASE CAN USE, BUT CHOOSE WISELY, BECAUSE YOU CAN CHOOSE ONLY THE POWER OF ONE CHARACTER AT A TIME</p>\n\n<p>- YOU CAN CREATE BOTS WHOSE PURPOSE IS TO ATTACK THE ENEMY BASE. NO ONE BEYOND THE ENEMY BASE CAN TAKE HARM FROM THEM. WHEN THEY DIE YOU WAITED FOR THE COOLDOWN TO BE ABLE TO CREATE THEM AGAIN</p>\n\n<p>- EACH DEATH WE SUFFER WILL RELEASE HP TO THE ENEMY BASE; THIS ALSO OCCURS WHEN WE KILL AN ENEMY FOR OUR DRAGON'S HP</p>", "metacritic": null, "released": "2022-03-09", "tba": false, "updated": "2022-03-14T13:57:09", "background_image": "https://media.rawg.io/media/screenshots/e6d/e6d9269bc2127de243279cbcab76724a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Olekram Yanda"], "genres": [], "publishers": [], "esrb_rating": null}