{"id": 75400, "slug": "roof-jumping-parking-simulator-2", "name": "Roof Jumping: Parking Simulator 2", "name_original": "Roof Jumping: Parking Simulator 2", "description": "Take your driving to all new heights in this crazy game of Stunt Driving Action! Jump, Drift, Slide and Smash your way around stunning Rooftop Locations on your way to a spectacular victory!<br/><br/>Grab the wheel of 4 exciting Stunt-Tuned Cars including a classic American Muscle Car, tuned Japanese Drift Car, heavyweight Off-Road Special and lightweight Supercar. Realistic handling makes the driving fun and challenging!<br/><br/>SMASH &amp; CRASH<br/>Smash your way through the Missions, with tons of Dynamically Destructible scenery, ready and set for you to cause total havoc on the rooftops!<br/><br/>HIGHLY CHALLENGING<br/>Can you land every jump perfectly, drift every corner accurately, and complete the missions in the fastest time without falling to your death? Deft use of the Handbrake will give you the edge over the competition for the ultimate stage completion times, if you can master it! The stakes are as high as the buildings!<br/><br/>HIGHLY COMPETITIVE<br/>Race against the best drivers in the World. Compare your rank with the online leaderboards and see how high you can get!<br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to Play, all the way through, no strings attached! Extra Game Modes that alter the rules slightly to make the game easier are available through In-App Purchases. Each mode has separate GameCenter leaderboards to make for totally fair competition!<br/><br/>GAME FEATURES<br/>▶ FOUR Awesome Stunt-Tuned Cars!<br/>▶ EXTREME Jumps, Stunts and Drifting!<br/>▶ BEAUTIFUL Rooftop Locations to Discover!<br/>▶ TONS of Destructible Scenery for Exciting Moments!<br/>▶ 36 Crazy Missions to Master!<br/>▶ 100% Free-2-Play Stunt Career!<br/>▶ Customisable Control Methods (Tilt, Buttons, Steering Wheel &amp; NEW MFi Game Controller Support)<br/>▶ Multiple Views (including Bonnet Cam)<br/>▶ Extra “Easy” Game Modes available as optional In-App Purchases<br/>▶ Runs on anything from or better than the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (4th Generation)", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-07-29T20:28:26", "background_image": "https://media.rawg.io/media/screenshots/fb0/fb017cee428843fb467598dc598dae08_6BNYTCe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Sports", "Racing"], "publishers": ["Aidem Media"], "esrb_rating": null}