{"id": 754261, "slug": "house-party-non-explicit-version", "name": "House Party (Non-Explicit Version)", "name_original": "House Party (Non-Explicit Version)", "description": "<p><strong>This is the non-explicit base game version of House Party.</strong></p>\n<p>This version of the game <strong>can be upgraded to the explicit version at any time</strong> by purchasing and downloading the House Party Explicit Content Universal Uncensor Patch here.<br/></p>\n<p>If you do not currently own House Party, and you would like to purchase the <strong>full explicit version</strong> of the game, click here.</p>\n<p>---------------------------------------------------------------------</p>\n<p>Once hailed as Rock, Paper, Shotgun’s worst game of 2017, House Party has been winning awards since it first emerged on the adventure game scene. This sexually charged, 3D point-and-click adventure is all about player choice and partying the way you want.\r\n</p>\n<br/>\n<p><strong>One big house, hundreds of choices, dozens of stories</strong> </p>\n<p>Sweet news! Your buddy Derek invited you to a rager at Madison's house. Surrounded by a group of eccentric partygoers, you must navigate your way through the night - no matter how wild it gets!</p>\n<p>Step into a sandbox adventure party game where even your simplest choices can impact the game in a magnificent way.</p>\n<p>Explore thousands of unique branching narratives with fifteen distinct NPCs that react based on your every remark and action, paving the way for tons of hours of wild, steamy, and hilarious entertainment.</p>\n<p> House Party’s gameplay starts with the conversations and grows with the decisions made along the way. With no true ending but dozens of stories to navigate, the night is what you make it. </p>\n<p><strong>Hidden Items &amp; Wild Interactions</strong> </p>\n<p> Explore a two-story house jam-packed with over fifty hidden items to discover, where every object has a purpose and some can be used in a variety of ways. </p>\n<p> Change the party's music with the mp3 player, invite a surprise guest over with the laptop, get shitfaced drunk by drinking as much booze as you can find, and... well, we'll leave the most exciting surprises up to you to discover. </p>\n<p> Show these items to an NPC and they may react with varying dialogue or relationship fluctuations. If your end goal is sex, most of these hidden objects are vital for completing an NPC's personal storyline and unlocking their steamiest scenes. </p>\n<p> And sometimes you don’t need any items to cause a ruckus. House Party is an adult game, and your character comes fully “equipped” to make plenty of chaos all on their own.</p>\n\n<p><strong>NPCs (Not-Boring Party Comrades)</strong> </p>\n<p>You don't have to thank us, but we invited fifteen of our craziest and funniest acquaintances!</p>\n<p> A new-to-town sorority girl willing to do wild things to fit in, the most brahsome brah around, a busty mud-wrestling southern belle, a freakishly buff straightedge dude hawk-eyeing all the booze, and many more unique personalities await.</p>\n<p> Listen close and the characters will chat about your actions, conversations, and choices. Throughout the night, you may overhear information about their backstories or catch them gossiping about other guests at the party. </p>\n<p> Every NPC has favorite bands, personal beliefs, policies on drugs and alcohol, friends and enemies, and party goals for the night. Fully voiced by amazingly talented voice actors and actresses, the partygoers feel vibrant and alive from the moment you set foot through the door. </p>\n<p> With fifteen of the most interesting, reactive, and hysterical NPC partygoers to ever exist and a rapidly growing roster, there is always plenty of social variety around the house. All of them have inner motivations and strong personal opinions, making them fun to make various choices around and amusing to see interact with one another!</p>\n<p>\n</p>\n<p><strong>Make Friends… Or Enemies</strong>\n</p>\n<p>As you navigate the party, your words and actions will dictate whether each NPC digs your vibe or is seconds away from knocking you the F%^# out. </p>\n<p>One bad decision might get you beaten to a pulp, while a good choice might result in a sexy lady dancing topless for the rest of the night. </p>\n<p>Every response you choose when speaking to an NPC changes how they feel about you. Keep an eye on your social gauges and watch your gameplay impact whether an NPC is crushing on you, feels so-so about you, sees you as a good friend, or has you on their shit list. </p>\n<p> NPCs will respond differently whether they love or hate you, unlocking or blocking off potential party choices and unique interactions. Be careful with everything you do and say at this party, because one small choice can change everything. </p>\n<p><strong>Interact With Celebrity Cameos</strong> </p>\n<p>Ever heard of the Game Grumps? Make the right choices and you may find Dan and Arin landing unexpectedly in the middle of the house party! </p>\n<p>Explore their unique storyline, watch them hilariously navigate the festivities, and choose from one of the multiple paths to help them get back to their show! </p>\n<p>Looking for a sexy Spanish tutor to hop in and shake things up? Your decisions could make Lety Does Stuff come knocking on the front door. Explore her steamy, wild, and absolutely crazy side story if you want a real taste of adventure!</p>\n<p>As one of the only indie studios to ever integrate real-life celebrities into a video game, it has been a ton of fun connecting the cameos to the story and welcoming Dan, Arin, and Lety into the party. </p>\n<p>Keep an eye out, because there may be more exciting cameos on the way! </p>\n<p><strong>Sex™</strong> </p>\n\n<p>While nobody on our dev team has had it before, we’ve done tons of research online to find out what human sex looks like.<br/><br/>Completing the main NPC stories on the romance path in House Party isn't just fun and intriguing, it will also sometimes reward you with steamy encounters for various partygoers. Whether you're into guy love or girl love, you'll have some opportunities for sexy, romantic, or raunchy fun at this House Party!<br/></p><p>\n</p>\n<p>Join the Eek! Games Official Discord Server:\r\nhttps://discord.gg/87CGZKK\r\n</p>\n<p>        SYSTEM REQUIREMENTS\r\n</p>\n<ul>   MINIMUM:<ul><li>OS: Windows 7+\r\n</li><li>Processor:  Intel Pentium G4500, AMD FX8350 or equivalent\r\n</li><li>Memory: 8 GB RAM\r\n</li><li>Graphics: Direct X 11 GPU w/ 2GB Available Video Memory\r\n</li><li>DirectX: Version 11\r\n</li><li>Network: Broadband Internet connection\r\n</li><li>Storage: 8 GB available space\r\n</li></ul></ul>\n<ul>   RECOMMENDED:<ul><li>OS: Windows 7+\r\n</li><li>Processor:  Intel i5 6500, AMZ Ryzen 3-1200 or above\r\n</li><li>Memory: 8 GB RAM\r\n</li><li>Graphics: NVIDIA GTX 1060 6GB, AMD RX570 or above\r\n</li><li>DirectX: Version 11\r\n</li><li>Network: Broadband Internet connection\r\n</li><li>Storage: 8 GB available space\r\n</li></ul></ul>", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2022-03-14T14:59:52", "background_image": "https://media.rawg.io/media/screenshots/0ee/0ee09654449abdcfc684eada6645d020.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["eekgames"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}