{"id": 754230, "slug": "destiny-of-a-wizard-3-beyond-the-world", "name": "Destiny of a Wizard 3: Beyond the World", "name_original": "Destiny of a Wizard 3: Beyond the World", "description": "<strong>THE STORY THUS THEN...AND NOW</strong><br/><br/>After defeating Zarra and Darklin in the previous adventure, our newly formed hero kept a promise to his father to spread his wings and travel beyond the Vale Islands.  Despite her attempts to take over and engulf the world in darkness, our hero successfully defeated her and emerged victorious!<br/><br/>​Everyone celebrated the Blue Wizard's success!  They all dined on cookies and other foods.  They even had cake and that's no lie.  But the celebration was short lived, as a mysterious portal whisked away our blue hero into another world...<br/><br/>Before he had a chance to get a bearing on his surroundings, an unknown creature attacked him out of nowhere!  After breaking off with our audience kept on the edge of their seats, what has happened to our blue hero. . . ? Our story now continues <br/>in this unknown scenario. . .<br/><br/><strong>NEW FEATURES TO THE THIRD INSTALLMENT OF THE SERIES!</strong><br/><br/><br/><br/>* A new Quest Log System!  Keep track of your main and side quests!<br/><br/>* Developed in a new engine of Rpg Maker!  Rpg Maker MV!<br/><br/>* Voice overs return!  With over <strong>800+ lines of dialog</strong> featuring three new main characters!  The Blue Wizard silence is broken and has his own voice as well!  David Camperman makes his return from 2nd installment to voice over the third game!​<br/><br/>​​​* A <strong>new side battle view</strong> of combat!  Featuring <strong>dramatic camera</strong> and <strong>voices</strong> from party members!<br/><br/>* A <strong>new fast travel system</strong> for the world map makes to the third installment!<br/><br/>* Laughs return as new fourth wall references, parodies, and <strong>sassy smart chests</strong> enter into the adventure!<br/><br/>* <strong>Unlockable content</strong> after the main story, <strong>three difficulties</strong> to play from, &amp; <strong>bonus features</strong> included!<br/><br/>* <strong>Game Manual Included</strong> in the DEMO and FULL versions of the game!  You can find this game manual in game file folder.", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2023-03-17T07:23:19", "background_image": "https://media.rawg.io/media/screenshots/b48/b48ba00fa3ad47379aae76c8122fb563.jpg", "website": "http://www.ultimacjproductions.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UltimaCJ Productions", "UltimaCJ"], "genres": ["RPG"], "publishers": ["UltimaCJ Productions"], "esrb_rating": null}