{"id": 75427, "slug": "coast-guard-beach-rescue-team", "name": "Coast Guard: Beach Rescue Team", "name_original": "Coast Guard: Beach Rescue Team", "description": "Coast Guard will take you along the beaches and into the sea. Become a member of the coast guard squad, looking out for people in trouble and problems to solve! Drive patrol trucks on the sand, from there get on the road if you need to move to another location or hop into a rescue boat and pilot it into the sea!<br/><br/>Now updated with 5 new cars and 25 new missions! For the first time you will be able to drive a bike! Additionally the update introduces a quad with a trailer, fire truck and two new boats. Newly introduced missions open up new challenges. You will put out fires, tow boats, find people and items. Piloting boats you will have to be careful to avoid huge waves!<br/><br/>FEATURES:<br/>▶ REALISTIC ENVIRONMENTS: Sandy beaches, busy roads and an open sea<br/>▶ HUGE CAR &amp; BOAT COLLECTION: Drive &amp; pilot 15 different boats and cars<br/>▶ DYNAMIC DAY/NIGHT SYSTEM: See the time of day changing<br/>▶ DIFFERENT CONTROL SCHEMES: Cars and boats not only behave differently - the way you steer them also changes<br/>▶ DYNAMIC TRAFFIC: On the road you will have to mind other cars and watch out for traffic<br/>▶ A VARIETY OF MISSIONS: Huge campaign to beat, earn in-game money for your progress<br/><br/>The game features both cars and boats with different control schemes. Controlling these two vehicle types requires different approach. In a car you will have to watch out for traffic, but its maneuverability will help you react quickly to the dangers before you. The boat on the other hand with its inertia is more difficult to handle.<br/><br/>Some of the missions will require you to use your binoculars to scan the area. The signal flares will indicate the place you need to go to!<br/><br/>You will drive a guard pickup, truck, ambulance and even a quad for some offroad driving. That’s when a task you have to complete is on land. When you have to get out to sea, you will select from a rescue boat, hovercraft or a motor dinghy. Learn to drive and pilot all of them!<br/><br/>When driving on land you will have to take other cars into consideration. Crash and you won’t make it to your destination!<br/><br/>The game looks believably and authentically regardless of where the action takes place.<br/><br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases. Each mode has separate leaderboards to make for totally fair competition!", "metacritic": null, "released": "2017-05-05", "tba": false, "updated": "2020-12-16T15:19:59", "background_image": "https://media.rawg.io/media/screenshots/755/755533812131cd8136c43b6295d4b09c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 270, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "Android", "iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["BoomBit Games", "Play With Games"], "esrb_rating": "Everyone"}