{"id": 754215, "slug": "xenomorph-itch", "name": "Xenomorph (itch)", "name_original": "Xenomorph (itch)", "description": "<strong>OVERVIEW</strong>\n<p>A remake of Alien by Mind Games.  You control the crew of the Nostromo and must help them survive their encounter the the alien.  The graphics are deliberately basic, and the game uses lots of sound effects to convey what is happening.</p>\n<p>You can command the crew to move around the ship, pick up items, and use any controls (such as the airlocks).  They will perform some actions automatically, such as fighting the alien if they encounter it (and the Android) with whatever weapons they have, or putting out fires if they have the fire extinguisher.</p>\n<p>You will also get regular updates from Mother, such as the ship being damaged or a fire has started.  It's a desperate situation for the crew, and only you can help them.<br/></p>\n\n<p>CONTROLS</p>\n<ul><li>Select a member of the crew by clicking on their profile picture.  Their \"blip\" will become brighter to indicate their position.</li><li>To move a member of the crew from one location to another, you can either right-click on an adjacent room, or select an option from the Move To menu.</li><li>The crew will automatically attack the alien with their best weapon if they encounter it.</li><li>Crew who are not too wounded can heal themselves in the infirmary.  (This is automatic)</li><li>Any crew with a fire extinguisher will automatically try and put out any fires in their location</li><li>Any crew with either the net or cat box will try and capture Jones automatically.</li><li>F11 will toggle full-screen</li></ul>\n<p><strong>WAYS TO WIN (or rather, not lose too much</strong>)</p>\n<ul><li>The most successful method is to kill the alien, and have as many crewmembers left alive as possible.  There are two ways to do this: coax it into the airlock and then open the airlock, or just kill it with weapons (which is rarely that successful).</li><li>Alternatively, you can start the autodestruct and then escape on the Narcissus.  However, only 3 crewmembers can fit inside the escape shuttle, and you can't leave any crew behind.  You are also required to have caught Jones.</li></ul>\n\n<p><strong>CURRENT DIFFERENCES</strong><br/>The main differences between this and the original are as follows:-</p>\n<ul><li>No morale aspect (yet)</li><li>No tunnels (yet?)</li></ul>\n\n<p><strong>AND FINALLY</strong><br/></p>\n<p>Any feedback is much appreciated!</p>", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2022-03-14T14:45:40", "background_image": "https://media.rawg.io/media/screenshots/551/551549bee1f54215eb83ffa5f05663df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Steve Smith"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}