{"id": 754227, "slug": "1-night-at-yes-2", "name": "1 Night at Yes 2", "name_original": "1 Night at Yes 2", "description": "<em>1 Night at Yes 2</em>\r\nHey look, 1 Night at Yes actually got a sequel!\r\n\r\n<p>(It really took me 2 years to make a sequel, while this project just took a month.)\r\n</p>\n<p>This is a fangame of Five Nights at Freddy's, created by Scott Cawthon.\r\n</p>\n<p>I know this game is based around trial and error, but Freddy's mechanic is like Foxy's. That's about it. Just watch over him.</p>\n\n<em>Credits</em>\n<p>Textures are from: https://3djungle.net/\r\n</p>\n<p>Audio is from: https://freesound.org/\r\n</p>\n<em>Character Models: \r\n</em>\n<p><em>@JellyJake112</em> </p>\n\n<em>Room Models, Posing, and Coding: \r\n</em>\n<p><em>@reda19199</em> </p>\n<p>More detailed credits are in the game in the \"Extras\" menu.\r\n</p>\n<p>This game contains Jumpscares, Loud noises, and flashing lights. If you have any issues with those, such as having epilepsy, please do not play this game. Thank you!\r\n</p>\n<p>If you experience any virus detections, please let me know. I don't know if clickteam+ has been patched from that or not.\r\n</p>\n<p>Please enjoy the sequel, even though it's pretty rushed.</p>\n\n<p><em><strong>Resetting Your Save File</strong></em></p>\n<p><strong><em>How to reset your save file in-game:\r\n</em></strong></p>\n<ul><li>Go to the Title Screen and hold the DEL key for 5 seconds.</li><li>The Game should close and the save progress should be gone.\r\n</li></ul>\n<p><strong><em>How to reset your save file manually:\r\n</em></strong></p>\n<ul><li>Go to Windows Search and put in \"%appdata%\\MMFApplications\" and press enter.\r\n</li><li>Locate the file called \"1nightatyes2\" and delete it.\r\n</li><li>The save file is now gone. If you don't clear your recycle bin, you can restore the save. If you want to back it up, you can either move it to a different folder and put it back in when you need it loaded or just copy and paste the file and it should be called, \"1nightatyes2 - Copy\"\r\n</li><li>The backup will not be messed with if it has a different name. If you want to restore the backup, simply delete the current file and restore the backup and name it the same \"1nightatyes2\" name. Don't give it a file extension.\r\n</li></ul>", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2022-03-14T14:48:50", "background_image": "https://media.rawg.io/media/screenshots/246/246be7aad0476de29b54e9beddfe8bbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SuperStarGamerR"], "genres": [], "publishers": [], "esrb_rating": null}