{"id": 75421, "slug": "multi-level-7-car-parking-garage-park-training-lot", "name": "Multi Level 7 Car Parking Garage Park Training Lot", "name_original": "Multi Level 7 Car Parking Garage Park Training Lot", "description": "The Top Hit Parking Game Series returns – featuring an all-new location at the City Center Super Store! Drift and Park in Amazing Cars. Maneuver long Busses and make Freight Truck Deliveries! Show your Parking and Driving Skills in 50 Epic Missions at the Multi-Level Parking Lot!<br/> <br/>AMAZING CARS<br/>Drive, Drift and Park Muscle Cars and Supercars, MPV’s, Pickups Trucks, Family Sedans and SUV’s. Keep the area clean with the Road Sweeper truck and make deliveries to the store in the Freight Truck. Drive shoppers to the store in the City Bus and take your family shopping in the Family Car, Camper and 4x4 pickups! There is something for everyone in Multi-Level Parking 7!<br/><br/>REALISTIC TRAFFIC<br/>Drive with other traffic, all looking for their parking spaces at the store! Be careful on the roads and make sure not to damage your cars!<br/><br/>CITY CENTRE SUPER STORE<br/>Visit the realistically detailed parking garage with multiple floors, ramps, entrances and animated features such as opening ticket barriers. Find your way to the parking spaces without crashing and prove you have what it takes to drive a massive selection of vehicles like a pro!<br/><br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases.<br/><br/>_____________________________<br/>GAME FEATURES\t<br/>▶VARIED VEHICLES: Drive &amp; Park 10 Unique and Different Vehicles<br/>▶ PARKING: Over 50 Precision Driving Missions to Pass!<br/>▶ MEGA MULTI-LEVEL: Realistic Multi-Level &amp; Open-Air Parking Lots<br/>▶ REAL ROADS: Deal with Real Dynamic Traffic AI <br/>▶ 100% Free-2-Play Missions<br/>▶ CONTROLS: Buttons, Wheel or Tilt Controls<br/>▶ CAMERAS: Multiple cameras including First Person view  <br/>▶ iCLOUD: Supports play between your devices &amp; automatic progress backup with iCloud<br/>▶ OPTIMISED: runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (5th Generation)", "metacritic": null, "released": "2017-02-03", "tba": false, "updated": "2019-07-29T20:27:30", "background_image": "https://media.rawg.io/media/screenshots/4f3/4f393884ac2c39d06d58b8db75600505.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Sports", "Racing"], "publishers": ["Aidem Media"], "esrb_rating": null}