{"id": 754300, "slug": "al-pie-del-canon", "name": "AL PIE DEL CAÑÓN", "name_original": "AL PIE DEL CAÑÓN", "description": "<p>Este juego es un prototipo de realidad virtual que hice como trabajo final. En teoría es compatible con todos los visores de realidad virtual actuales pero solo he podido testearlo con las Oculus Quest 2.</p>\n<p>Aquí está un pequeño trailer que hice del prototipo:</p>\n<p>Dado que no todo el mundo dispone de un visor de realidad virtual aquí dejo un vídeo mostrando las mecánicas y explicando como jugar:</p>\n\n<p>Este proyecto fue el trabajo final que entregué para completar mi curso de especialización en tecnologías 3D. Para darle ese acabado visual usé materiales PBR y me inspiré en el videojuego Half-Life y en su estética industrial.</p>\n<p>La idea principal de este prototipo era explorar el movimiento en la realidad virtual, el problema es que este marea a la gente nueva, es por eso por lo que está pensado principalmente para personas acostumbradas a moverse en estos entornos. Al ser un prototipo lo que es el flujo del juego es muy básico esto lo hice así porque al fin y al cabo lo que pretendía era crear mecánicas de movimiento funcionales teniendo en cuenta la variedad de jugadores. Por ejemplo, los jugadores propensos a marearse pueden echarle un ojo al proyecto usando el movimiento teleport que evita el mareo. También dependiendo de si eres zurdo o diestro el juego se adapta automáticamente a ti sin necesidad siquiera de menús, basta con agarrar el cañón con tu mano hábil y el juego hace el resto.</p>\n<p>Por último quiero aclarar que todo lo que se ve en los vídeos, a excepción de la música, ha sido modelado, texturizado, programado, grabado, montado y narrado por mi.</p>\n<p><strong>Controles:</strong></p>\n<ul><li><strong>Moverse:</strong> Desplazar stick izquierdo</li><li><strong>Teletransportarse:</strong> Presionar botón secundario de cualquier mando y soltar apuntando a donde queramos</li><li><strong>Rotar la cámara horizontalmente:</strong> Desplazar stick derecho</li><li><strong>Saltar:</strong> Pulsar cualquier stick</li><li><strong>Agarrar:</strong> Presionar cualquier gatillo lateral encima de cualquier agarre del cañón</li><li><strong>Juntar dedos:</strong> Presionar cualquier gatillo frontal</li><li><strong>Disparar:</strong> Mientras agarras el cañón pulsar gatillo frontal del mando con el que es agarrado</li><li><strong>Sacar segundo agarre:</strong> Hacer doble pulsación en el botón primario del mando con el que se agarra el cañón</li><li><strong>Evitar retroceso:</strong> Agarrar el cañón con las dos manos y estar pisando el suelo</li><li><strong>Interacción con la UI:</strong> Apuntar físicamente con la mano y pulsar el gatillo para seleccionar la opción a la que hayamos apuntado</li></ul>\n\n<p><strong>Música que suena en el tráiler:</strong></p>\n<p>Vague Voices - Kelly Bailey</p>\n<p>Lambda Core - Joel Nielsen</p>\n\n\n<p><strong>SITIOS DE INTERÉS:</strong></p>\n<p>Mi Canal de YouTube</p>\n<p>Mi Portfolio</p>", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2022-03-14T15:09:01", "background_image": "https://media.rawg.io/media/screenshots/d47/d4767de9475e25fbfd9e68a5308c0e8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cerdo"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}