{"id": 754399, "slug": "transmusichype", "name": "Transmusic'Hype", "name_original": "Transmusic'Hype", "description": "<p>This project has been made under a 2 week schedule in workshop (workshop = internal \"game jam\" week) in collaboration with the Trans Musicales (https://www.lestrans.com/qui-sommes-nous-2/). The goal was to, in groups, conceptualize and make a simple, short and accessible game, that had as a strategy to showcase one or several axes of the Trans Musicales heritage, including the festival and their other activities. The project's strategy was to offer a bridge between the public - advised or not - and elements identified as relevant in a field documentary study with the Trans Musicales staff, by pulling them into a video game experience in respect with the Trans Musicales spirit.</p>\n<p>Transmusic'Hype is a game made for the Trans'musical festival. In this game, you will get an idea of what the atmosphere of the festival looks like and you will discover the artists that will perform in the future edition of the Trans'musical. In the game, you will act as a sound and light engineer, in the middle of the crowd, during a concert at the Trans'musical. With this game, you will be able to see the point of view of a technical team in a concert. Your goal is to complete some tasks that will appear as mini-games, the more you succeed, the more your score will rise, causing the crowd to get hyped and shout. The mini-games will come one after another and as the game goes on, they will get harder and with less delay. <br/></p>\n<p>Make sure to succeed the mini games to improve the hype and the atmosphere ! Good luck and enjoy !<br/></p>", "metacritic": null, "released": "2022-03-08", "tba": false, "updated": "2022-03-14T15:40:59", "background_image": "https://media.rawg.io/media/screenshots/4e9/4e95813cd04ccb08353b7c899ec4d239.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Pierre LAMBERT", "Corentin Guerin", "Ash2o", "Fraboulet Alexis", "Meetlok", "Maeva Tellier Simenel", "Eloi MICHEL", "Killian_Brillet"], "genres": [], "publishers": [], "esrb_rating": null}