{"id": 75447, "slug": "driving-pro-island-delivery", "name": "Driving Pro: Island Delivery", "name_original": "Driving Pro: Island Delivery", "description": "Uniquely varied &amp; exciting driving game! Think of a vehicle and it’s here! You’ll be driving small cars, big cars, trucks, a bus and evel pilot a boat completing challenging tasks &amp; missions!<br/><br/>FEATURES:<br/>▶ BEAUTIFUL NORTHERN ENVIRONMENT: Drive around an atmospheric island<br/>▶ IMMENSELY VARIED VEHICLE COLLECTION: Each one is different &amp; unique<br/>▶ MULTIPLE TASKS TO ACCOMPLISH: Drive, complete maintenance jobs, fish!<br/>▶ REALISTIC TRAFFIC &amp; PEDESTRIANS: Immerse yourself in a small island town<br/><br/>Enter a beautiful northern island full of impressive vistas! Drive along the breathtaking shoreline and discover a busy local town! Get the full picture of the area using a great variety of vehicles that allow you to see everything the game has to offer from multiple different points of view.<br/><br/>You will get multiple different tasks to accomplish - it’s not only driving from point to point, but also collecting passengers along the way, doing maintenance jobs on the streets and even fishing! Every one of them has to be completed in a timely fashion but also with safety and care!<br/><br/>You will be scored according to time spent, but if you crash along the way all will be lost! You will have to replay the mission or use our handy time rewind feature to correct your mistakes and be on your way again.<br/><br/>Most importantly, the game is completely free to play, from start to finish. Additional game modes and modifiers can be unlocked with optional in-game purchases.", "metacritic": null, "released": "2018-07-28", "tba": false, "updated": "2019-10-22T14:36:11", "background_image": "https://media.rawg.io/media/screenshots/ec5/ec5c62690adced331fc3fd79c9e7c5e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hybrid Touch Games"], "genres": ["Sports", "Racing"], "publishers": ["Hybrid Touch Games"], "esrb_rating": "Everyone 10+"}