{"id": 75452, "slug": "truck-parking-simulator-ice-road-truckers-edition", "name": "Truck Parking Simulator - Ice Road Truckers Edition", "name_original": "Truck Parking Simulator - Ice Road Truckers Edition", "description": "Take on the most dangerous Trucker jobs in the World in 3D Ice Road Truck Parking Simulator!<br/><br/>Master the controls of 3 challenging trucks and make your way across the treacherously slippery frozen lake in one piece! Don’t drive too slow or you’ll fall through the fragile ice layer and sink!<br/><br/>3 Awesome Trucks to drive, including: <br/><br/>Wood hauler: drive carefully to not topple and spill the heavy load.<br/><br/>Pickup truck: drive fast but control the skids on the slippery ice! <br/><br/>Road Train: if you think you’ve seen big trucks, think again! This double-trailer beast will trouble the Worlds best Truck drivers!<br/><br/>100% free career mode, with tons of diverse Parking levels set within the detailed lake environment, with snow drifts, hills and slopes, varying grip levels and weather!<br/><br/>From the creators of “The Best Parking Games on the App Store” (a comment given by many of our happy players!). See our other games for many more exciting Parking Simulator games!<br/><br/>GAME FEATURES<br/><br/>▶ Drive 3 Crazy new trucks! Hard &amp; Fun to Master!<br/>▶ Fantastic new Frozen Lake environment with varying grip levels!<br/>▶ 100% Free-to-play Career Mode<br/>▶ Customisable control methods (tilt, buttons, wheel)<br/>▶ Multiple views (including Drivers Eye view with real-time mirrors*) <br/>▶ Easy modes available (with separate leader boards) as optional in-app purchases for an easier ride!<br/>▶ iOS Optimisation: runs perfectly on anything from the original iPad 1, iPhone 4 and 4th Gen iPod Touch to the latest 5th Generation widescreen devices.<br/><br/>* Mirrors are features on iPad 2 / iPhone 4S and newer devices)", "metacritic": null, "released": "2014-04-30", "tba": false, "updated": "2019-10-22T14:16:21", "background_image": "https://media.rawg.io/media/screenshots/356/35671ed631a26d50675024156ef02230_PeANcd6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Racing", "Family"], "publishers": ["Play With Games"], "esrb_rating": null}