{"id": 754595, "slug": "twitch-aquarium", "name": "Twitch Aquarium", "name_original": "Twitch Aquarium", "description": "Overview\r\n\n<p>Twitch Aquarium is a new interactive overlay game built exclusively for Twitch streamers. With over 15 species of user-selectable aquarium fish, you're sure to get a colourful tank!\r\n</p>\n<p>Viewers can control their fish onscreen with the boost and flip commands. There's also a fish food minigame, and fun emotes. It includes interactive stream widgets that the streamer can enable to show useful information.\r\n</p>\n<p>Built with privacy in mind viewers choose to add their fish to the stream aquarium. This means that your lurkers can stay in lurk mode.\r\n</p>\n\n\r\nBenefits\r\n\n<p>Twitch Aquarium is fun and engaging for your viewers and will help bring a positive vibe to your stream. Increase viewer engagement and keep a visual representation of your streams viewers, as fish are kept in the tank even after viewers leave your stream.\r\n</p>\n<p>We also offer our streamers a support discord and documentation of Twitch Aquarium. So we're always there to help! As a Twitch Aquarium streamer, you'll also be actively promoted across our social channels and have a chance to shape the development.\r\n</p>\n\n\r\nEasy and Efficient\r\n\n<p>Twitch Aquarium is super easy to set up and you can have it on your stream within minutes of downloading it! It doesn't rely on any external web services, Twitch extensions and runs locally on your computer.\r\n</p>\n<p>It takes up only a few megabytes of disk space and is uses a low amount of resources. So it won't interfere with your game performance or networking.\r\n</p>\n<p>We're planning many new features and are always listening to our streamers feedback. So expect future updates and new features.</p>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2022-03-14T16:34:14", "background_image": "https://media.rawg.io/media/screenshots/29b/29ba56e1503cc992bb06b2d9373e0eb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["stinkyqueen"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}