{"id": 754670, "slug": "week-5-nikitavision", "name": "Week 5 (nikitavision)", "name_original": "Week 5 (nikitavision)", "description": "<p>The piece or system I chose to have contrasting behaviors was my potted flower plants. Some of the plants would enlarge the player's size, altering their ability to move through and above spaces on the platform. Other times, the potted flowers would shrink the players' size, allowing the character to jump higher and fit through smaller spaces; but make it more difficult to be precise with landing.</p><p>Either outcome affects the physical abilities of the character, thus altering the player's spatial relationship to the environment. Enlargement plant powerups would allow for more control of movement but would prohibit the character from reaching certain power-ups due to their size. <br/></p><p>An element that I wanted to fade in and out visually, was the angels in the scene. I had originally planned for the angels to emanate a glow, or pulse by altering sprite emission, but I was unsuccessful. I was, however, able to program the audio component to the sprites. Whenever the player would collide with the angels, a sparkling sound would play to confirm the interaction. The angels were initially set up as an audio-visual guide for the player to collect as many devils as possible before time ran out. <br/></p><p>The objects I chose to spawn multiples of were the devil sprites. Using the scripting framework from this week's classwork, I was able to spawn these creatures randomly across the scene. <br/></p><p>In terms of stationary objects, I used three overlaying custom tilemaps to create a custom terrain. I created multiple hills, valleys, and platforms to challenge the player. <br/></p><p> I had a lot of fun using free assets to make something of my own, for my final project I'd like to develop my own tilemaps. I learned a lot about splicing tilemaps, and I was able to experiment more than I originally anticipated. <br/></p><p>There is a one-minute timer on the game, in which the player must make it to the end of the scene and collect as many devils as possible. After the timer is done, the scene restarts. The player can also click escape to leave the game.<br/> <br/><br/><br/></p>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2022-03-14T16:56:23", "background_image": "https://media.rawg.io/media/screenshots/218/2188f8a0e87eb6a81ce3e88d783c0684.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nikitavision"], "genres": [], "publishers": [], "esrb_rating": null}