{"id": 75467, "slug": "ultimate-rhino-simulator-animal-survival-games", "name": "Ultimate Rhino Simulator - Animal Survival games", "name_original": "Ultimate Rhino Simulator - Animal Survival games", "description": "*****Be Aware! Angry Rhino is coming to you and want to attack on you! Save yourself*****<br/><br/>Fight for your lives! Shoot to kill the crazy Rhino in Animal Survival games.<br/><br/>Rhino is hungry so need to some meal, it can ace against the people, .car and everything in city! The map is massive so take your time to explore all the city areas. Run Run Run<br/><br/>These Wild Rhinos are very dangerous, try to explore all city , chase you target and shoot them. This game is a combination of Simulator games with new mission and levels. Funny Animal Racing Simulator Game! Download now!  This game has been designed for all ages.<br/><br/>AMAZING 3D WORLD ADVENTURE!!!<br/>Attacking city you explore a real life hunting 3D world<br/><br/>EXPLORE A THRILLING CITY!!!<br/>Immerse yourself in diverse environments and explore the visually stunning adventure!!! Watch out for attacking Rhinos!<br/><br/>Features Highlights!<br/>-Real life Rhino hunting adventure<br/>-Amazing 3D city environment! Wild animals in the city<br/>-Efficient control in every moves<br/>-Realistic Cool sounds effect<br/>-Different Safari Animals included<br/>-Console quality HD graphics<br/>-GAME CENTER Achievements and Leaderboard.<br/>-Fun controls and Addictive game play for unlimited hours<br/>-Don't miss a single Shot or you will end up losing this hunting season<br/><br/>Finally have a chance to experience the hunting challenge. Join the battle in this epic fighting game \"Ultimate Rhino Simulator\" and survive in the wilderness as long as you can.<br/><br/>Leave a review and rating to let us know what you think about this game. We would really appreciate your rating…<br/><br/>For more news and details:<br/>Like our page on Facebook: https://www.facebook.com/Creativedistrixgames<br/>Follow us on Twitter: https://twitter.com/CreativeDistrix", "metacritic": null, "released": "2016-12-09", "tba": false, "updated": "2019-10-22T14:23:48", "background_image": "https://media.rawg.io/media/screenshots/79c/79c4e53ec148c613fce2c47a42c5374a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atta Ur Rehman Riaz Ahmad"], "genres": ["Adventure", "Simulation"], "publishers": ["Atta Ur Rehman Riaz Ahmad"], "esrb_rating": "Teen"}