{"id": 754740, "slug": "space-panic-cpc", "name": "Space Panic (CPC)", "name_original": "Space Panic (CPC)", "description": "<p>(ENGLISH) (español más pabajo)</p>\n<p>I have read that Space Panic (1980), programmed by UNIVERSAL, is considered the first platform game, as it predates Donkey Kong (1981).<br/></p>\n<p>The challenging SPACE PANIC pits your character, a spaceman, against cunning space monsters prowling around. You must use defense tactics and dig traps in the ground for the enemies to fall into. Once they have fallen into the traps, fill them with dirt with your tool to destroy them.</p>\n<p>You must be careful! Some monsters must fall from more than one height. This and the use of the ladders to change the height of the cabin will allow you to escape from their craving for human flesh.</p>\n<p>But this is not the end of the difficulties. The place is inhospitable and your respiratory system is not able to assimilate this chemical combination of oxygen for a long time. This forces you to destroy all the enemies before it runs out.</p>\n<p>puedes Usar teclas de dirección y adicionalmente, utiliza una tecla para cavar trampas y otra para cerrarlas. Trankilo!! El juego te permitirá redefinir las teclas<br/></p>\n<p>Created with 8BP LIBRARY (8 bits de poder)</p>\n\n<p>thanks to: Siyei Er, Azimov, PacoVespa, XenoMorph, Brundij</p>\n<p>------------------------</p>\n<p>He leído que Space Panic (1980), programado por UNIVERSAL, es considerado el primer juego de plataformas, ya que es anterior a Donkey Kong (1981).</p>\n<p>El desafiante SPACE PANIC enfrenta a tu personaje, un hombre del espacio, contra los astutos monstruos espaciales que merodean por el lugar. Debes utilizar tácticas de defensa y cavar trampas en el suelo para que los enemigos caigan en ellas. Una vez han caído en las trampas, rellénalas de tierra con tu herramienta y así poder destruirlos.</p>\n<p>¡Deberás tener cuidado! Algunos monstruos deben caer desde más de una altura. Esto y el uso de las escaleras para cambiar de altura del habitáculo te permitirán escapar de sus ansias de carne humana.</p>\n<p>Pero no acaban aquí las dificultades. El lugar es inhóspito y tu aparato respiratorio no es capaz de asimilar mucho tiempo esa combinación química de oxígeno. Esto te obliga a destruir a todos los enemigos antes de que se agote.</p>\n<p>puedes Usar teclas de dirección y adicionalmente, utilizar una tecla para cavar trampas y otra para cerrarlas. Trankilo!! El juego te permitirá redefinir las teclas<br/></p>\n<p>fito</p>\n<p>Created with 8BP LIBRARY (8 bits de poder)<br/></p>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2022-03-14T17:15:43", "background_image": "https://media.rawg.io/media/screenshots/14c/14cc6dbfa87e6ef88c9f5f950bfa9922.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fitosoft", "X3NoMoRPH"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}