{"id": 75479, "slug": "police-arrest-car-driver-simulator-3d-drive-the-co", "name": "Police Arrest Car Driver Simulator 3D – Drive the cops vehicle to chase down criminals", "name_original": "Police Arrest Car Driver Simulator 3D – Drive the cops vehicle to chase down criminals", "description": "Get out of police car and run behind the escaping criminal to make an arrest. Drive the police car &amp; take on new exciting and thrilling missions in this realistic city environment. With real road traffic police Jobs becomes extreme dangerous! Police arrest car driver simulator 3D is really breathtaking high pressure action pack game; that you can ever face in a driver simulation! Stop the robberies from the banks, hotels &amp; city streets and take down the criminals.<br/><br/>Drive the cop’s car; rush through the city to the crime spot, chase and takedown the thieves. In this simulator game you will play in multiple challenging police adventures and sweep the crime from the city. Rush through the traffic and don’t panic keep calm and drive the vehicle with best of your driver skills. Drive the police cars in 10 challenging cops’ missions for having extreme driving fun. This simulation game is hell of fun for all driving lovers who love to play full of action thrilling games. <br/><br/>Features<br/><br/>-    Get out of police cars run down behind escaping gangsters <br/>-       3 Stunning police super cars to drive in open city map<br/>-       Face 10 exciting police arrest mission with police chase and action <br/>-       Multiple camera views to boost your gaming experience<br/>-       Different game modes to match your mood<br/>-       Smooth game play with retina HD graphics<br/>-        Large game play environment", "metacritic": null, "released": "2015-03-05", "tba": false, "updated": "2019-08-02T03:13:45", "background_image": "https://media.rawg.io/media/screenshots/a40/a400c8fe0448a0c8322a340894d8a109.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OZITECH - GAMES"], "genres": ["Action", "Simulation"], "publishers": ["ozi technology"], "esrb_rating": null}