{"id": 75478, "slug": "construction-truck-simulator-extreme-addicting-3d-", "name": "Construction Truck Simulator: Extreme Addicting 3D Driving Test for Heavy Monster Vehicle In City", "name_original": "Construction Truck Simulator: Extreme Addicting 3D Driving Test for Heavy Monster Vehicle In City", "description": "Do you think you can drive heavy-duty trucks?  This game will test and enhance your ultimate driving skills.<br/><br/>Construction truck simulator allows you to have an amazing experience of driving mega trucks. You drive a loaded vehicle from starting point and pass through different checkpoints to deliver it at the final destination. Multiple heavy vehicles, more than dozen difficult challenging levels to test you’re driving skills. If you are fun lover then this game will knock you off your senses. <br/><br/>Amazing 3D graphics and animation for realistic game-play, makes it extremely addicting and interesting.<br/><br/>Play “Construction Truck Simulator”, a time base challenging game-play. Reach at your final destination before the clock went off. This 3d simulation game provides you a realistic graphical game-play each time, which leads you to more thrilling and addicting gaming experience. Your goal in this game is to move heavy loaded goods and to the final destination. <br/><br/>Features<br/><br/>1.20 challenging game levels to test you’re driving skills.<br/>2.Multiple heavy vehicles to select and drive.<br/>3.Added free roaming mode for your driving practice.<br/>4.Career mode to accomplish levels on time base. <br/>5.Accomplish a level and have access to further tricky levels.<br/>6.Various camera angles to give you real life driving feel.<br/>7.Realistic 3D graphics to enhance gaming experience.<br/>8.Simple and nice game controls for smooth driving.", "metacritic": null, "released": "2014-07-13", "tba": false, "updated": "2019-08-02T03:10:24", "background_image": "https://media.rawg.io/media/screenshots/bdb/bdb81a6577021c5d3fb58694f3603d22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OZITECH - GAMES"], "genres": ["Simulation", "Racing"], "publishers": ["ozi technology"], "esrb_rating": null}