{"id": 754761, "slug": "fractalnator-tech-demo-1", "name": "Fractalnator - Tech Demo 1", "name_original": "Fractalnator - Tech Demo 1", "description": "<p>A partial proof-of-concept of a VR game I thought of. Have you ever pointed a webcam at a monitor displaying that webcam, and gotten trippy effects? That's what this is, but in 3D!<br/><br/>I've only tested it with Oculus Rift S, but it uses OpenXR, so it should work across most popular headsets.<br/></p>\n\n<p>I had an idea for a trippy  new VR experience, inspired by:</p>\n<ol><li>The phone app Fraksl, which uses mirrored and inverted video feedback to  produce trippy fractal videos. You change the visuals by pinch  zooming/rotating and panning around. (Play with an online version I made here.)</li><li>The VR app Cosmic Flow, which uses trippy mirrored textures on 3D  objects to produce a very unique 3D kaleidoscope effect. It has an  incredible shifting sense of depth and space.</li><li>That cool thing that happens when you point a webcam at a monitor  displaying the webcam's image fullscreen, and tilt the camera or move it  closer, further, in circles, etc. It's a little like Fraksl, but so  much more unsteady due to light glare, small human movements, etc.</li><li>The VR app SoundSelf, which is primarily a meditation aid/teacher that  uses toning and chanting. It looks a bit like a more dynamic version of  Cosmic Flow, but the way that it responds to the input from the player  entranced me, literally. It uses mostly sound and visual feedback, but  also some head motion feedback to help you know if your gaze is  wandering.</li><li>Mind Massaging Machine, which is a meditation/hypnosis VR app that lets  you use trippy visuals, play audio tracks, and do a few other things  that aren't relevant. Unfortunately, while I am impressed with the work  that has been done on the project, I am just not happy with the visual  or user experience.</li></ol>\n\n<p>I'm learning Unity right now in order to develop a VR experience that uses aspects from all of these. Here are the core mechanics I hope to implement:</p>\n<ol><li>Mapping the player's visual field onto a \"Feedback Texture\" in real-time.</li><li>Having one or more tunnel(s) that change shape and have mirrored and  tiled Feedback Texture. These and the rest of the \"Feedback Geometry\"  are locked to the user's head, with a moderate lag, like the tunnel has  inertia.</li><li>Having 3D Feedback Geometry that intersects with the tunnel and forms  rings of abstract geometry, which are animated to move and rotate  rhythmically. They intersect often, causing a kaleidoscope feedback  effect.</li><li>Having a \"Base Visuals\" texture as a skybox, which is ideally mostly  obscured at all times by the Feedback Geometry. This will provide color  and shape information in the edges and gaps around the 3D geometry while  allowing most of the visual field to form a feedback loop with the  Feedback Texture. This can be static or animated.</li><li>Adding a seamless and minimalist audio player, with the ability to  create and load playlists in-app and provide unobtrusive media controls  during a session.</li></ol>\n<p>This demo is a proof-of-concept of the Feedback Geometry concept. Here you can see some of that classic webcam feedback, but in 3D with some cubes, spheres, and monkeys! The Base Visuals for this test are just spirals for the skybox and a grid for the ground. I'm going to keep experimenting in my free time with this! Learning Unity is really fun and super easy!</p>", "metacritic": null, "released": "2022-03-07", "tba": false, "updated": "2022-03-14T17:24:47", "background_image": "https://media.rawg.io/media/screenshots/692/692c2360ed69945c97d16c90f2a6139c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ella Jameson"], "genres": [], "publishers": [], "esrb_rating": null}