{"id": 75471, "slug": "car-factory-parking-simulator-a-real-garage-repair", "name": "Car Factory Parking Simulator a Real Garage Repair Shop Racing Game", "name_original": "Car Factory Parking Simulator a Real Garage Repair Shop Racing Game", "description": "In Car Factory Parking Simulator you have to take on EVERY DRIVING JOB. Deliver parts using Trucks, Vans and Fork Lifts. Take your Car through the factory production line and watch it get built in stages from Rolling Chassis to a Finished Car. You can even paint it your favorite color in the paint booth! Then give it a Test Drive on the test track, and finally, deliver to customers using the Car Transporter truck!<br/><br/>Are you ready to start the career of your lifetime? <br/>_____________________________<br/>BUILD CARS<br/>Calling for Truckers and Test Drivers! Are you ready for a totally original Parking game challenge?!<br/><br/>You’ll be in charge of the full production chain… deliver parts, move cars through the busy production line, paint cars in the paint-booth, test drive cars on the test track, deliver finished cars to the top-deck of the Car Transporter Trucks and drive safely away! Can you handle the pressure?<br/>_____________________________<br/>REALISTIC FACTORY<br/>Explore all the departments in the factory including: metal pressing plant, robotized chassis welding, fitting and finishing, paint shops, quality control, car valet area, test track, offices and car storage areas! See how a car factory operates in your new job as the ultimate factory driver!<br/> <br/>_____________________________<br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes which alter the rules slightly to make the game easier are available through optional In-App Purchases. Each mode has separate leaderboards to make for totally fair competition!<br/><br/><br/>_____________________________<br/>GAME FEATURES\t<br/>▶ AWESOME VEHICLES: 7 Different Trucks and Cars to Master<br/>▶ CAR PARKING: Exciting missions to test the best drivers <br/>▶ 100% Free-2-Play Missions<br/>▶ CONTROLS: Buttons, Wheel, Tilt &amp; MFi Game Controller Support<br/>▶ CAMERAS: Multiple cameras including First Person view  <br/>▶ iCLOUD: Supports play between your devices &amp; automatic progress backup with iCloud<br/>▶ OPTIMISED: runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (4th Generation)", "metacritic": null, "released": "2016-02-23", "tba": false, "updated": "2019-07-29T19:55:29", "background_image": "https://media.rawg.io/media/screenshots/658/65802b89e25973dad852adc9816a5a62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}