{"id": 754942, "slug": "phantom-breaker-omnia", "name": "Phantom Breaker: Omnia", "name_original": "Phantom Breaker: Omnia", "description": "Buy now to receive a launch discount of 10%, plus exclusive early adopters bonus content – a free copy of the Phantom Breaker: Omnia Original Game Soundtrack (A $9.99 value) which includes all 34 remixed versions of the in-game soundtrack as well as the English and Japanese versions of the Opening and Ending Theme Songs. Contains both MP3 192 kbps and Uncompressed WAV. Offer ends on Tuesday, March 22!<br/><br/><br/><br/>Phantom Breaker: Omnia, a massive update to Phantom Breaker: Extra, a 1-vs-1 2D anime fighter originally released by Mages in 2013. The game features 2 guest characters, Kurisu Makise from Steins;Gate and Rimi Sakihata from Chaos;Head, as well as two brand new characters created specifically for Phantom Breaker Omnia.<br/><br/><br/><br/><br/><br/><ul><li><strong>20 Character Roster!</strong><br/>Includes all the characters and guest characters from Phantom Breaker: Extra like Kurisu Makise from Steins;Gate and <strong>two</strong> brand new characters created specifically for Phantom Breaker: Omnia.</li></ul><br/><ul><li><strong>Choose from 3 different fighting styles: Quick, Hard, and Omnia!</strong><br/>The 3 different styles in the game can drastically change your characters’ speed, power, and mechanics.</li></ul><br/><ul><li><strong>Retuned and Rebalanced!</strong><br/>The ability to pull off amazing combos and special attacks has never been easier as Phantom Breaker: Omnia's fighting system has been overhauled and rebalanced.</li></ul><br/><br/><br/><ul><li><strong>Dual Language Audio!</strong><br/>A Phantom Breaker series first, all the characters will have English voice acting. The game’s text will be also translated into English, Japanese, French, Italian, German, Spanish, Simplified and Traditional Chinese.</li></ul><br/><ul><li><strong>Modern, Remixed Soundtrack!</strong><br/>The background music for each character has been redone and remixed with the option to play the original background music.</li></ul><br/><ul><li><strong>The Complete Experience!</strong><br/>Players can immerse themselves with the stories from both the original Phantom Breaker and Phantom Breaker: Extra.</li></ul><br/><br/><br/>A mysterious man, known only as <strong>‘Phantom’</strong> appeared in <strong>Tokyo</strong>—the capital city of Japan—and manipulated vulnerable adolescents into fighting each other, bestowing upon them mystical weapons of great strength known as ‘Fu-mension Artifacts.’ In exchange, he promised to grant their wish if they survive.<br/><br/><br/><br/>Unbeknownst to the combatants, the fierce clashes between Fu-mension Artifacts caused distortions in space-time, which compromised the boundaries between parallel universes. The collapse of these parallel universes would ultimately break the seal, unleashing Phantom’s destructive powers.", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T03:46:14", "background_image": "https://media.rawg.io/media/screenshots/473/47327e43098571250b37d1198d9163bd.jpg", "website": "https://www.rocketpandagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 14, "toplay": 3}, "playtime": 5, "achievements_count": 191, "ratings_count": 0, "suggestions_count": 532, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MAGES", "GameLoop"], "genres": ["Action"], "publishers": ["Rocket Panda Games 🚀🐼", "方块游戏 CubeGame"], "esrb_rating": null}