{"id": 754932, "slug": "little-obedient-robot", "name": "Little Obedient Robot", "name_original": "Little Obedient Robot", "description": "Play this strange little idea that combines turn-based planning with old-school 2D side-scrolling.  I would call this game an experimental strategy game.  Build a deck and get a hand of cards.  Arrange those cards in the order that you want your little robot to follow.  Press play and watch your little obedient robot advance through the stage.<br/><br/><strong>You take control of a little obedient robot that you kind of program with cards you find.</strong><br/><br/>Learn your robot's movement cards by practicing with them.  Give them a try and see what each card does.  Once you know how to use them you can plan and try to dodge enemies as you make your way to the exit.<h3>HOW TO PLAY:</h3><br/><strong>You click and drag cards into whatever order you want. </strong><br/><br/><br/><br/><strong>Then when you're ready, hit the play button and watch your robot follow the commands on the cards.</strong><br/><br/><br/><br/><strong>You can add cards to modify your robot's moves.</strong><br/><br/><br/><br/>There are numerous different stages to explore along with dozens of special moves to discover.  The game features at least 2+ hours of gameplay.<br/><br/><strong>*Please note that the game may have some bugs as it is a prototype.  We'll try to squash anything nasty we come across.</strong>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T03:38:33", "background_image": "https://media.rawg.io/media/screenshots/eb0/eb0590af2ce4d876a64741a93e9d903f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 96}, "playtime": 1, "achievements_count": 9, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silver Dollar Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Silver Dollar Games"], "esrb_rating": null}