{"id": 754962, "slug": "dawn-of-the-monsters", "name": "Dawn of the Monsters", "name_original": "Dawn of the Monsters", "description": "The cataclysmic battle between giant monsters has begun in this manga-inspired, side-scrolling, kaiju beat-'em-up! Titanic creatures known as Nephilim have invaded Earth, and the only hope of stopping them is DAWN (Defense Alliance Worldwide Network), which unleashes its own colossal combatants to defend against the enemy hordes! Take control of four hulking behemoths - Megadon, Aegis Prime, Tempest Galahad, and Ganira - each with distinct abilities and play styles, and smash your way through destructible real-world environments spanning more than 35 missions! Power up with DNA augments, crush foes with devastating Rage moves and brutal finishers, and team up with a friend for 2-player co-op action! You are the planet's last line of defense...but will that be enough for mankind to survive the Dawn of the Monsters!?<br/>\n<br/>\r\nKey Features:<br/>\r\n-Four unique, monstrous playable characters: Megadon, Ganira, Aegis Prime, and Tempest Galahad<br/>\r\n-Earth-shattering monster-versus-monster one- or two-player co-op beat-'em-up action<br/>\r\n-Fully destructible cities based on real-world locations<br/>\r\n-Brutal Rage abilities, devastating Cataclysm Attacks, and merciless finishing moves<br/>\r\n-Fierce bosses and dozens of different enemy types<br/>\r\n-Customize your monsters with DNA augments!", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-16T06:09:11", "background_image": "https://media.rawg.io/media/screenshots/d35/d35ad7042225256ef50ea04eb9fc2e34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 9, "toplay": 1}, "playtime": 1, "achievements_count": 26, "ratings_count": 0, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WayForward Technologies", "13AM Games"], "genres": ["Action", "Adventure"], "publishers": ["WayForward"], "esrb_rating": null}