{"id": 754979, "slug": "not-our-home-2-2", "name": "Not Our Home 2", "name_original": "Not Our Home 2", "description": "Not Our Home 2 is a stealth third-person adventure game where Emily, the protagonist, tries to uncover the secrets to an evil that is causing the deaths and disappearances of many innocent people. Tons of people are disappearing without a trace, and even some are decaying into skeletons and living that way for all of eternity. Henry, Emily's best friend, is a victim of this evil and he will be by your side to fix what is wrong with him. You will uncover many secrets and discover what is causing this madness.<br/><br/>Experience a fully driven story full of secrets and mystery, along with different atmospheric environments. Many choices and decisions are up to you. Can you discover what is going on? Or will you be the next victim?<br/><br/>- <strong>Fully driven story:</strong> As you progress through the game, you will discover a lot about this evil that is causing this madness along with discovering who people are and where they come from.<br/>- <strong>Atmospheric environments:</strong> Each scene will have an atmospheric environment that matches with the game-play.<br/>- <strong>Three Chapters:</strong> Completely different chapters that get you closer to uncovering the truth. Each chapter will contain different features, characters, mechanics, missions, and most importantly: more story to uncover!<br/>- <strong>Player choices:</strong> Choose different personality types and choose different people to trust to uncover different endings.<br/>- <strong>Different characters:</strong> Interact and speak with others to help you get more clues on discovering the truth.<br/>- <strong>Pro Controller Support:</strong> Don't like playing with keyboard? Play with the Pro Controller for an even better experience!", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-18T04:11:44", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fb6cb297d2c00a17003a54a22536639.jpg", "website": "https://network5games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Network5 Games"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Network5 Games"], "esrb_rating": null}