{"id": 754957, "slug": "crystal-road-vale-of-memories", "name": "Crystal Road: Vale of Memories", "name_original": "Crystal Road: Vale of Memories", "description": "Crystal Road is an adult farming sim with a heavy focus on story content. This game is in active development and news regarding it's release will be made at a later date!<br/><br/><br/>Embark on a mystical adventure to solve the mystery of the Crystal Road. Guided by a strange voice, you find yourself in a world that has been ravaged by an all consuming fog. Residents of the Crystal Vale have been separated, and it's up to you to re-establish the land. Take on the role of the Crystal Seer and restore the vale to it's former glory as you settle down, obtain a home, and navigate your way through relationships!<br/><br/><br/><ul><li><strong>Farming System:</strong> Develop your farm and grow crops to make a living!<br/></li><li><strong>Dating System:</strong> Fancy someone? Invite them on dates and get to know them better!<br/></li><li><strong>Sex System:</strong> Dating usually leads to getting hot and heavy, unlock various locations and toys to explore your romantic side.<br/></li><li><strong>Character Customization:</strong> Personalize your experience! Change your hair, eyes, mouth and more!<br/></li><li><strong>Original Story</strong><br/></li><li><strong>Free Play Mode:</strong> Jump directly into the sex!<br/></li><li><strong>Original Soundtrack</strong></li></ul><br/><br/><ul><h3>Kaneko</h3>A sleepy Inn keeper with curious fox-like traits. Her aloof personality can be misleading at times, but she's one of the most caring residents of the Crystal Vale. If you're ever hungry or need some company, you'll do good by paying her a visit at the Sleeping Fox Inn.<h3>Nai</h3>Dr.Nai is a medical professional in charge of making sure that the Crystal Vale's residents are in good health. She is a staunch advocate of good sexual health and believes that overall well-being begins in the bedroom. Aside from her medical services, she runs an additional sex toy business, where you'll find all manner of things to spice up your romantic life.<h3>Hazel</h3>A traveling merchant with a bit of a greedy side. Hazel obsessively collects items that she comes across in the hopes of finding something important that she lost. Unfortunately, she doesn't remember what she is looking for. When she's not out searching for things to sell, you'll find her peddling her wares at her local shop.<h3>Rua</h3>Rua is a forager with a knack for crafting and survival. Her cold personality is merely a facade and she can be quite trusting and warm when she gets to know someone well. You'll be hard pressed to find someone more reliable than her to fix up your home or upgrade your tools in the Crystal Vale.<h3>+6 More characters to come!</h3></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-18T03:55:58", "background_image": "https://media.rawg.io/media/screenshots/299/2991fc4d2817e8e6ba6adae068063d84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 330, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tentakero"], "genres": ["Adventure", "RPG"], "publishers": ["Tentakero"], "esrb_rating": null}