{"id": 754968, "slug": "deadburg", "name": "Deadburg", "name_original": "Deadburg", "description": "The Xbox 360 Indie hit is now coming to PC!<br/><br/>Deadburg is a co-op survival game set in a procedurally generated city with thousands of buildings to explore and zombies to kill. Every building you see can be explored, exploited and destroyed one block at a time. Play alone or with friends and discover the secrets of the city while you craft items, find supplies and learn new skills.<h3>FEATURES</h3><ul><li> <strong>WORLD</strong> - A large procedurally generated city awaits you, filled with zombies and loot.  Every block can be broken, you can build a building or raze one to the ground.<br/></li><li> <strong>MULTIPLAYER</strong> - Play alone or with up to 3 friends.<br/></li><li> <strong>GAME MODES</strong> - Multiple game modes to tailor your zombie survival experience.<br/></li><li> <strong>DIFFICULTIES </strong>- Multiple difficulties to make the zombies more threatening if you feel you're up to it.<br/></li><li> <strong>CRAFTING</strong>- Craft weapons and supplies to utilize against the zombie menace.  <br/></li><li> <strong>BASE BUILDING</strong> - Build a 100% custom building, or modify an existing structure.  Full terrain editing means you can make whatever base you want.<br/></li><li> <strong>CHARACTER </strong>- As you survive your character will become stronger, unlocking additional bonuses and skills.  </li></ul><h3>GAME MODES</h3><ul><li> <strong>SURVIVAL </strong>- The base survival game.  Kill zombies, scavenge loot, craft weapons, build a base.<br/></li><li> <strong>DEFENSE </strong>- Surviving just got a little harder.  The horde will come for you, best you be prepared.<br/></li><li> <strong>LAST LIFE</strong> - Survival means little if there isn't a penalty for death.  If your character dies in Last Life it's game over.<br/></li><li> <strong>CREATIVE </strong>- Don't like the city?  Want to make some changes?  Creative mode allows you to modify an existing city and then convert it into another game mode.</li></ul>", "metacritic": null, "released": "2022-03-15", "tba": false, "updated": "2022-03-18T04:05:03", "background_image": "https://media.rawg.io/media/screenshots/e58/e589149331d4330938e84144429182ac.jpg", "website": "http://www.deadburg.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Reanimated Games"], "genres": ["Action", "Adventure"], "publishers": ["Reanimated Games"], "esrb_rating": null}