{"id": 755066, "slug": "necroland-undead-corps", "name": "NecroLand: Undead Corps", "name_original": "NecroLand: Undead Corps", "description": "<h3>Build an Unbeatable Army of the Undead!</h3>In NecroLand: Undead Corps, you compete in online \"battle royale\" action to be the last survivor in a zombie-filled wasteland. You control an Alpha Unit that can “tame” legions of wandering undead and add them to your squadron of allies who obey your commands.<br/><br/>NecroLand borrows elements from real-time strategy and role-playing games to emphasize decision-making over shooting skills. You can acquire the minions of enemies you’ve defeated, change your squad’s abilities by commandeering mechanical or chemical units and even develop new characters that can be leveled up and improved by research.<br/><br/><br/><h3>Features</h3><ul><li><strong>Online PVP action for 2 - 10 players </strong>competing in real time from all over the world<br/></li><li><strong>Use \"Taming Gas\" </strong>to convert hostile zombies into allies who fight with weapons<br/></li><li><strong>Control various types of Alpha Units</strong>, each with its own unique skills and advantages<br/></li><li>Defeat roaming “hostile neutrals” or enemy units and <strong>add them to your ranks</strong><br/></li><li><strong>Discover different kinds of items</strong> that can change the tide of battle in your favor<br/></li><li><strong>Play the highly competitive Battle Royale or Duo modes</strong> against other players, or team up to defeat hordes of enemies in the cooperative Defense mode</li></ul>", "metacritic": null, "released": "2021-06-29", "tba": false, "updated": "2023-11-04T15:09:06", "background_image": "https://media.rawg.io/media/screenshots/ff1/ff140f1f27ce6d7dd4374c602e7d3b1d.jpg", "website": "https://www.nicalis.com/games/necroland", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["JANUS LABS"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Nicalis"], "esrb_rating": null}