{"id": 755064, "slug": "snow-scout", "name": "Snow Scout", "name_original": "Snow Scout", "description": "In this exploration adventure on skis, which is experienced in virtual reality, you take a well-deserved time out. After everything that happened recently, you figure you really need to take a break and get away from it all. You sign up for a volunteer job with the Snow Scouts, a non-profit organisation that runs some ski resorts high in the mountains. You will be responsible to fix up an entire valley all by yourself, only being guided by your supervisor via radio. You'll try out and open all the different ski slopes, test the snow cover for any avalanche risk, and if need be, set off a calculated avalanche to ensure safety for others. Maybe you'll even come across some rare alpine birds, get a chance to open new paths and get to know your supervisor - and maybe even yourself - a little better through radio conversations. Up here in this pristine mountain environment, you all alone in nature, nothing can go wrong. Or can it?<br/><br/>FEATURES:<br/><br/>:: Move through a remote alpine valley using an immersive skiing simulation in virtual reality<br/>:: Descent as well as cross-country skiing<br/>:: Complete adventure and job-simulator like tasks based on real-life ski patrols<br/>:: Ride 21 different ski slopes and compete in their online leaderboards<br/>:: Build a relationship with your handler, whom you communicate with via radio<br/>:: Solve several kinds of optional side taks<br/>:: Relax in your ski hut after a hard day of work<br/>:: Collect a variety of different Steam achievements<br/>:: Over 2 hours of recorded dialogue, with more to come<br/>:: Contains an unreleased 50-minute documentary about the Serengeti<br/><br/>Currently confirmed VR compatibility:<br/>- Oculus Rift<br/>- Oculus Quest 1 &amp; 2 via PC-Link<br/><br/>", "metacritic": null, "released": "2022-03-17", "tba": false, "updated": "2022-03-18T05:08:36", "background_image": "https://media.rawg.io/media/screenshots/067/0676566fce7dd023ec15dcd1bb642384.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Muikkumedia Oy", "Tunermaxx Media"], "genres": ["Action", "Adventure", "Sports"], "publishers": ["Tunermaxx Media"], "esrb_rating": null}