{"id": 755049, "slug": "glorious", "name": "Glorious", "name_original": "Glorious", "description": "Forge your Glorious Legacy in blood and bronze, in this rogue-like action strategy game. The ancient world has been plunged into chaos and despair as the dark shadow of war looms over the land. Your people call for a leader and you have answered. Raise your army, summon your heroes and command them to victory through hard fought battle after battle. <br/><br/><br/><br/>Use superior tactics to defeat wave after wave of enemies. Catch them on the back foot through smart manoeuvring and choice of formation. Let them tremble at the sight of your mighty Phalanx, black out the skies with arrows! <br/><br/><br/><br/>From legendary Achilles and his Myrmidons to brave Leonidas. Your great heroes inspire your troops with special abilities. Encourage them to fight on harder and longer to vanquish your foes. Discover and unlock more heroes as you collect victories throughout your campaign. <br/><br/><br/><br/>Spend your gold wisely to equip your soldiers with the best armour and weapons gold can buy. Reinforce your squadrons and bring on fresh troops ready to fight on! Offer gold to the gods for incredible powers, turning the tide of battle. <br/><br/><br/><br/>Don’t win the battle only to lose the war! Navigate the ancient world and use your surroundings to your advantage. Balance risk and reward to attain greater power. Collect and unlock different warriors each journey through Greece as you travel different routes. What lies on the road less travelled?", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-18T04:58:03", "background_image": "https://media.rawg.io/media/screenshots/fd0/fd0be00df883a666db1791893c649e92.jpg", "website": "https://www.playglorious.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 304, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rainfall Games", "Bluemane"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Rainfall Games", "Bluemane"], "esrb_rating": null}