{"id": 755046, "slug": "screaming-loaf", "name": "Screaming Loaf", "name_original": "Screaming Loaf", "description": "Screaming Loaf is a wacky 2D puzzle-platform game.<br/>\n<br/>\r\nThe fridge contents have one goal; to become a sandwich. They'll stop at nothing to fulfil their quest of smearing themselves on some bread, but these fillings have chosen the wrong loaf to mess with. Loaf happens to have a scream so powerful that it can shatter jam jars, melt butter, and explode cheese!<br/>\n<br/>\r\nEach level has you control Loaf with the objective to destroy all enemies. To control Loaf you use 5 keys on your keyboard to; move left, move right, scream, jump, and drop a slice. Different enemies have different strengths, so some may require prolonged screaming to eliminate. Screaming is not only good for damaging enemies, Loaf's scream can also propel himself across water, push levers, inflate balloons, and more. Loaf is made up of 5 bread slices, Loaf has the ability to drop slices off his back and re-join with them later, any dropped slices will scream at the same time. More points are scored for completing levels quickly, so dropping slices next to where enemies are about to spawn is useful to defeat them more efficiently. Figuring out where to drop slices plays a big part in the game's puzzle solving. Slices also act as health, a slice is lost from Loaf upon enemy collision. Beware though, each slice you drop gives Loaf one less slice of protection. You will fail and have to retry the level if you lose your front slice.<br/>\n<br/>\r\nScreaming Loaf features 129 unique levels of puzzles and platforming, with many different enemies to scream at and a variety of obstacles to overcome. The game is spread across 3 stories with humorous cutscenes between each chapter. You can also unlock accessories for Loaf, just for fun!<br/>\n<br/>\r\nWill you manage to save Loaf from becoming a sandwich?", "metacritic": null, "released": "2022-03-17", "tba": false, "updated": "2022-03-18T04:55:22", "background_image": "https://media.rawg.io/media/screenshots/166/1661f27c769e25c860989e0a3ff55fab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AshumArcade"], "genres": ["Action", "Indie"], "publishers": ["AshumArcade"], "esrb_rating": null}