{"id": 755027, "slug": "party-rush-2", "name": "PARTY RUSH!!", "name_original": "PARTY RUSH!!", "description": "A cynical RPG in which you must stop the onslaught of beings from other dimensions!<br/>Use their powers against them to save your world!<br/><br/>Here we present, Party Rush!!, an RPG with great freedom in party making.<br/><br/><br/>The protagonist, Peppermint, only cries for help.<br/>\"Somebody help me!\"<br/>And your trusty allies shall help you out.<br/><br/>There are more than 100 different characters from other dimensions that will make your party unique in every way!<br/>Save your world with your favorite characters!<br/><br/><br/>Explorations can differ depending on which day of the week you're in.<br/>Even places that you think you've already explored might have different events and new characters to invite to your party.<br/><br/>So take your time and explore every nook and cranny!<br/><br/><br/>Magic or power. Single attacks or area of effect attacks. Buffs or debuffs. There are even skills that can be used only when you have a specific combination of characters in your party.<br/>Organize your party the way you like to defeat powerful foes.<br/>But don't forget the MP cost of these useful skills. MP management is key in making your party a strong one.<br/><br/>Engage in battles, explore the map, and experience the story.<br/>Until the day you save the world, enjoy the humorous and exciting life of a Party Maker!<br/><br/>Note: Images are that of the game still in development and the contents are subject to change.", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-18T04:42:31", "background_image": "https://media.rawg.io/media/screenshots/ddd/ddd3924f23220a20e33565b810146007.jpg", "website": "https://www.party-rush.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SECHAN"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["CREST"], "esrb_rating": null}