{"id": 755053, "slug": "battle-bands-rock-roll-deckbuilder", "name": "Battle Bands: Rock & Roll Deckbuilder", "name_original": "Battle Bands: Rock & Roll Deckbuilder", "description": "In this battle of the bands tournament, the winner takes all to become a rock &amp; roll legend. As the player progresses through the ranks from a garage band hero to a monster axe-wielding maestro, their deckbuilding prowess will be challenged in the ultimate card game showdown.<br/><br/><br/>Pick between guitar, bass, keyboard, or drums. Personalize your deck with hundreds of unique cards. Between your gigs you can refine your deck and coordinate with bandmates.<br/><br/><br/><br/><br/>Grab your gear, your bandmates, and set out for greatness. Customize everything from instruments to wardrobe and come up with a wicked band name.<br/><br/><br/><br/><br/>Perfect your solo or play with a group of friends against challenging AI adversaries in a 1-4 player, roguelike cooperative campaign that will test your musical mettle.<br/><br/><br/><br/><br/>Join 64 bands for the ultimate tournament experience. Work with bandmates as you duel your way to the final showdown and prove to the world your band is the greatest of all time.<br/><br/><br/><br/><br/>Thousands of combinations allow you to customize your perfect rock &amp; roll style. From your bass guitar to painting your van, what good is winning if you can’t jam with a flourish.<br/><br/><br/><br/><br/>Cosmetic store with daily updates to build out your wardrobe. Store cosmetics are purchased using The Battle Bands Credits virtual currency. These Credits are earned through gameplay or can be purchased through microtransaction. ALL cosmetics are available to everyone without microtransactions. <strong>We have absolutely zero pay-to-win mechanics.</strong><br/><br/><br/><br/><br/>Refine your deck, coordinate with your bandmates, and purchase the perfect gear from the music shop between matches. Maximize hype for your band and outperform the competition.<br/><br/><br/><br/><br/><ul><li>Hundreds of cards to play with, many customized to each instrument, making each deck you play unique.<br/></li><li>Challenging AI opponents in a single player campaign with specially themed cards.<br/></li><li>4v4 mode against 64 bands in a legendary tournament showdown.<br/></li><li>Unlock new cards and strategies as you play for even further customizability.<br/></li><li>Pick your clothes, gear, van and rocker in hundreds of combinations<br/></li><li>Absolutely zero pay-to-win mechanics<br/></li><li>Store cosmetics can be earned through gameplay or through purchasing credits.</li></ul><br/><strong>Online Singleplayer</strong><br/>Battle musical AI opponents in hard rock arenas with roguelike mechanics reminiscent of Slay the Spire and Monster Train. Battle Bands allows you to customize your deck and acquire relics of rhythmic power in your dash to become a rock star.<br/><br/><strong>Online Multiplayer</strong><br/>Don't let the competition take you for a musical loop. Let the rhythm of the soundtrack propel you and your bandmates to victory in the ultimate PvP combat. Upgrade your gear, build your set list and shred with your buddies in cooperative real-time tournaments.<br/><br/>", "metacritic": null, "released": "2022-03-17", "tba": false, "updated": "2022-03-18T05:01:09", "background_image": "https://media.rawg.io/media/screenshots/143/143bcaecc4691feddf67efd993c0e840.jpg", "website": "http://www.playbattlebands.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 4, "achievements_count": 39, "ratings_count": 1, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Aerie Digital"], "genres": ["Strategy", "Indie"], "publishers": ["Aerie Digital"], "esrb_rating": null}