{"id": 75529, "slug": "3d-boat-parking-simulator-game-real-sailing-drivin", "name": "3D Boat Parking Simulator Game - Real Sailing Driving Test Run Marina Park Sim Games.", "name_original": "3D Boat Parking Simulator Game - Real Sailing Driving Test Run Marina Park Sim Games.", "description": "Take to the seas in 3D Boat Parking Simulator: Marina edition! With brand new water physics and beautiful graphics, take the helm on 4 totally unique ships, including a sleek speed boat, a traditional sailing yacht, a beautiful luxury motorboat and a twin hull catamaran! Feel the thrill of sailing and navigating your ships safely whilst parking without damaging any expensive boats in the Marina! :)<br/>So put on your Captains Hat and set sail today. All Levels are 100% Free for ALL THESE FANTASTIC SHIPS!<br/>▶ Speed Boat: Nimble and fun to drive - the perfect boat to start your seafaring career!<br/>▶ Sailing Yacht: Take a gentler pace with the elegant sailing yacht! Get used to steering well in advance.<br/>▶ Luxury Motoryacht: With More power, comes more responsibility! Take the expensive luxury yacht out for a spin.<br/>▶ Catamaran: For the bravest captains, the huge twin-hull Catamaran will test your precision sailing to the limits.<br/>Experience the newest Parking Simulator from the masters of Parking Games! Often imitated, never bettered!<br/>Extra Fun Game Modes are available as In-App Purchases - each have their own leader boards, and change the Rules slightly to make for an easier ride!<br/><br/>GAME FEATURES<br/>▶ Realistic water physics to test your skills with 4 challenging boat types<br/>▶ Beautiful Marina environment to explore <br/>▶ Realtime Lighting and Reflections<br/>▶ Customisable control methods (tilt, buttons, wheel)<br/>▶ Many camera views to help you park<br/>▶ Fun, Kids and Baby modes for an easier trip!<br/>▶ Leader Boards for each Game Mode<br/>▶ How many Stars can you get? Test yourself to get a Gold award for every level!<br/>▶ iOS Optimisation: runs perfectly on anything from the iPad 1, iPhone 4 and  iPod Touch 4th Gen or better, with full iPhone 5 widescreen support.", "metacritic": null, "released": "2014-04-23", "tba": false, "updated": "2019-07-29T20:02:13", "background_image": "https://media.rawg.io/media/screenshots/411/411463c4afcd1a410ae8510fd71de6e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}