{"id": 7552, "slug": "order-up-to-go", "name": "Order Up!! To Go", "name_original": "Order Up!! To Go", "description": "Over 9 MEALion downloads!<br/><br/>Time to release the chef inside you…<br/><br/>Order Up!! To Go is a delicious blend of frantic kitchen cooking and restaurant empire building. Chop, roll, slice, and dice your way to culinary stardom. Optimized specially for iOS, featuring perfect controls and comic kitchen action, this is one time management game that will keep you busy for hours.<br/><br/>Press Quotes<br/>&amp;quot;It&amp;#39;s one of the best cooking games you&amp;#39;ll ever play.&amp;quot; — Classic Game Room<br/><br/>&amp;quot;This game is really good.&amp;quot; — GameSpot (Appetite for Distraction) <br/><br/>&amp;quot;If you like the time-management style of game, or are a fan of Cooking Mama and the like, then you’ll absolutely love this game.&amp;quot; — Capsule Computers, 9/10<br/><br/>&amp;quot;Order UP!! To Go is not only a great game, it approaches the Freemium structure in a way that doesn’t hold back on the fun.&amp;quot;— App Store Arcade<br/><br/>&amp;quot;Order Up!! To Go is brilliant...Adults will enjoy this game for its fun humour and nice gameplay and kids will enjoy it due to its great animations and music.&amp;quot; — App-Score, 8/10<br/><br/>&amp;quot;Highly recommended.&amp;quot; — AppTudes, 4/5<br/><br/>• RESTAURANT EMPIRE<br/>Cook your way across a variety of restaurants, each with their own menus to unlock and master. Put your culinary skills to the test as the challenge ramps up!<br/><br/>• ARE YOU A NATURAL IN THE KITCHEN?<br/>Use the perfectly designed gesture controls to prepare and cook your recipes. Flick burgers in the air, carefully chop your veg and drop fries into the fryer all with the touch of a finger!<br/><br/>• PERFECT GAMING RECIPE<br/>As well as chopping, slicing, flipping and frying you will also have to keep your kitchen in ship shape. Fight off fires, rat invasions and even health inspectors. <br/><br/>• A WORKER IS ONLY AS GOOD AS HIS TOOLS<br/>As you play through the game, upgrade your restaurants with new, better equipment. Purchase up to 6 restaurants in game, and even competed in the ultimate Fortified Chef contest!<br/><br/>Important Consumer Information. This app: Requires acceptance of EA&amp;#39;s Privacy &amp;amp; Cookie Policy, TOS and EULA. Collects data through third party analytics technology (see Privacy &amp;amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications and gifting. To disable see the settings in-game. <br/><br/>Terms of Service : http://www.ea.com/terms-of-service<br/>Privacy &amp;amp; Cookie Policy : http://www.ea.com/privacy-policy<br/>EULA : http://tos.ea.com/legalapp/mobileeula/US/en/OTHER/<br/>Visit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2012-01-19", "tba": false, "updated": "2019-10-22T14:29:25", "background_image": "https://media.rawg.io/media/screenshots/dd1/dd12600747936bc9e8923f3c3fb8ebf1.jpg", "website": "http://www.chillingo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": [], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Chillingo"], "esrb_rating": null}