{"id": 75551, "slug": "fork-lift-truck-driving-simulator-real-extreme-car", "name": "Fork Lift Truck Driving Simulator Real Extreme Car Parking Run", "name_original": "Fork Lift Truck Driving Simulator Real Extreme Car Parking Run", "description": "Start your new Career as a Fork Lift Trucker TODAY! The first in a new breed of Realistic Simulators! Collect and deliver crates around the Warehouse in over 50 missions and compete for the best score in the awesome Endless Mode! <br/> <br/>_____________________________<br/>FORK LIFT TRUCK DRIVER<br/>Carefully pick up and deliver pallets to the correct drop-zones quickly and efficiently! Drive fast to get the best scores but don’t crash the truck or drop your load… and remember… “Use the Forks, Luke”!<br/><br/>_____________________________<br/>DYNAMIC MAP<br/>Progress through simple tasks in training mode, to more advanced missions moving multiple pallets to multiple locations. Avoid moving obstacles, leaking steam pipes and drive safely over ramps, platforms and through narrow corridors. The Workshop is a dangerous and busy place to work!<br/><br/>___________________________<br/>ENDLESS MODE<br/>Think you have the endurance, focus and skill to take on the Endless Mode Challenge? Deliver packages for as long as you can – each delivery gets you a time extension to reach for the longest runs! Compete on the Score Leaderboards to prove once and for all who’s the Worlds’ Best Trucker!<br/> <br/>_____________________________<br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to Play, all the way through, no strings attached! Extra Game Modes that alter the rules slightly to make the game easier are available through In-App Purchases. Each mode has separate GameCenter leaderboards to make for totally fair online competition!<br/><br/><br/>_____________________________<br/>GAME FEATURES\t<br/>▶ REALISTIC – Learn to be a Fork Lift Truck Driver <br/>▶ REAL PHYSICS – Watch out for Hazards at the Warehouse<br/>▶ PRECISION DRIVING – The Ultimate Trucker Driving Challenge<br/>▶ ENDLESS MODE – How many deliveries can you make in time?<br/>▶ FREE GAME – 100% Free-2-Play Missions<br/>▶ CONTROLS: choose between Buttons, Wheel, Tilt &amp; MFi Game Controller Support<br/>▶ CAMERAS: multiple cameras including a Drivers view  <br/>▶ OPTIMISED: runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (5th Generation)<br/><br/>-------------------------------------------------<br/>From the creators of “The Best Parking Games on the App Store” (a comment given by many of our happy players!). See our other games for many more exciting Parking Simulator games!", "metacritic": null, "released": "2015-08-26", "tba": false, "updated": "2019-07-29T20:06:38", "background_image": "https://media.rawg.io/media/screenshots/ba2/ba26202576c2cb5294810882f6518b27_sNlUX4o.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}