{"id": 755572, "slug": "brrrrrrrt-v-02", "name": "Brrrrrrrt v 0.2", "name_original": "Brrrrrrrt v 0.2", "description": "<p>Fighting enemies earns you money, equipment, and items, which you can then use to fight stronger enemies. When you die, you can keep your equipment but lost all items half the money.</p>\n<p>A little game I've found in a dusty folder in a corner of my PC, it's has been there since 2019 still stays unfinished and untouched, It is a  side-scrolling shoot 'em up game with delicacy and complex mechanism. I will steady and slowly update it, at least I hope so.</p>\n<p>The current state of the game only has one chapter and three levels, but it will loop infinitely and enemies will become more difficult and powerful to defeat. (some items only cost 1$ (￣_,￣ ) just for test issue, but you can take advantage) more changes and more content will come.</p>\n<p>You can headshot the enemy, and the enemy can do the same.</p>\n<p>btw: The intro is awful you can press space to skip ; ) there is a readme in the folder, read it first to know how to control it. </p>\n<p>btw2: These are two reasons why you can't pick up equipment:</p>\n<p> 1 your slot is full </p>\n<p>2 your vehicle doesn't have this type of slot. </p>\n<p>For the first one just drop your old equipment with the same type and pick the new one. for the second one buy a new vehicle.</p>\n<p>btw2.1: equipment you dropped during battle No Way To reclaim! drop equipment in the station(where's the station? when U wasted! you will back to the station automatically) you can take it back at any time.<br/></p>\n<p>btw3: The secret level is not implanted so I don't suggest anyone buy any secret keys in-game, just don't buy it...</p>\n<p>btw4: Stand with Ukraine  </p><p>https://donate.redcrossredcrescent.org/ua/donate/~my-donation?_cv=1</p>\n<p>sorry for my broken English.<br/></p>", "metacritic": null, "released": "2022-03-16", "tba": false, "updated": "2022-03-18T07:31:34", "background_image": "https://media.rawg.io/media/screenshots/109/109fd885956836f9a035916bfa2e879a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cyman5"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}