{"id": 755600, "slug": "numismatic-car", "name": "Numismatic Car", "name_original": "Numismatic Car", "description": "<p><strong>Setting</strong>\n</p>\n<p>Kashmir Valley, A beautiful valley in State of Jammu &amp; Kashmir.\r\n  </p>\n<p><strong>Characters</strong>\n</p>\n<p>A Driver in his car, driving on the roads to collect the coins scattered all over the roads in Kashmir Valley.\r\n  </p>\n<p> <strong>Goal</strong></p>\n<p>The game’s goal is to collect the 50 coins that are spread all over the roads to win the game.\r\n  </p>\n<p><strong>Challenge</strong>\n</p>\n<p>Many hurdles like barricades are placed on the roads, and if the player collides with these hurdles, health of the car will decrease and if health of the car goes to 0 level fails. Along with this, there is a time limit of 3 minutes to collect the required numbers of coins and if the player fails to do so, then also level fails.\r\n  </p>\n<p><strong>Rules</strong>\n</p>\n<ul><li>Player have to drive his car on the roads by avoiding the hurdles, and if the player collides with any hurdle, the health of the car decreases.\r\n  </li><li>The player’s score will be displayed on the screen on top at the Leftmost corner.\r\n  </li><li>When the player collides with any hurdle, the health of the car decreases by 1, and when health becomes 0, the level fails and the player has to restart.\r\n  </li><li>Player can accelerate to a certain fixed speed.\r\n  </li><li>Along with the hurdles, there is a timer of 3 minutes and the player has to collect 50 coins in 3 minutes to win the game.\r\n  </li><li>Player can turn the car left and right with the help of Left and right arrow or ‘A’ and ‘S’ key on keyboard;\r\n  </li><li>Player can accelerate forward with forward arrow key or ‘W’ and backward with backward arrow key of ‘S’.\r\n</li></ul>", "metacritic": null, "released": "2022-03-16", "tba": false, "updated": "2022-03-18T07:44:14", "background_image": "https://media.rawg.io/media/screenshots/0f2/0f24da5d0573600f32ae6afc08469c6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yash Kumar Dromar", "AksM11", "aryanm17", "AriBora10"], "genres": ["Adventure", "Simulation", "Racing"], "publishers": [], "esrb_rating": null}