{"id": 75575, "slug": "car-parking-city-driving-3d-real-car-park-experien", "name": "Car Parking City Driving 3D - Real Car Park Experience In City and Traffic", "name_original": "Car Parking City Driving 3D - Real Car Park Experience In City and Traffic", "description": "Why not park the car all around the world ?<br/>C'mon join us with our free car parking game to park the car in city and world. We designed this game with real care, this game has multi levels, cities, driving experince. Real simulation and physics car simulator in 3D. Drive the car fastests with speed, and park the car as quick as possible. Teach your kid how to park a car, boy or girl.<br/><br/>Features<br/>- Magneficent real like visuals, extreme HD 3D graphics<br/>- 5 Maps, 100 multi levels <br/>- World Maps ( America, England, Turkey, India, China), drive your car and park it in any country<br/>- Special 3D models, HD designs<br/>- 15 super sport cars, extreme details, shadows, tire smoke, real time reflections<br/>- Incredible real like car driving experince, parking detectors ( car drive and driving aids )<br/>- Vehicle telemetry ( speed, gas percentage, crash indicator, parking sensors )<br/>- Steering wheel or arrow options, sliding gas and break simulations<br/>- Rewards, Daily gifts and Store options<br/>- A real life like car parking experience, extreme precision<br/>- This game is suitable for kids ( boy or girl )<br/><br/>Support<br/>Please email us or use our social media about anything you need to state<br/>We will be delighted if you enlighten us about new features you want in our games.<br/><br/>Thank you<br/>We wish for you the best real game play experience in 2016", "metacritic": null, "released": "2016-02-19", "tba": false, "updated": "2019-10-22T14:23:49", "background_image": "https://media.rawg.io/media/screenshots/ad9/ad96863eb834283249576a1bc72896bf.jpg", "website": "https://ultramadentertainers.wordpress.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mete Kaplan"], "genres": ["Simulation", "Racing"], "publishers": ["Mete Kaplan"], "esrb_rating": "Everyone 10+"}