{"id": 755870, "slug": "wild-force", "name": "Wild Force", "name_original": "Wild Force", "description": "Wild Force\r\n<p>Wild Force is the Final Project made for the Videogame Development and Design Master at EVAD. </p>\r\nStory\r\n<p>Wild Force is a special forces corps in charge of keeping \"Wild City\" save. When the zombie apocalypse started the members of Wild Force took swift action and created a shelter to help the survivors of the apocalypse. Now their job is to continue saving whoever is left.</p>\r\nCharacters\r\n<p>In wild force you take control of four different characters, each one of them with their own unique skill.</p>\r\nDoc\r\n<p>Doc also known as Ramses Gamal is Wild Foce's best doctor. He can support his allies while on missions making sure they accomplish their objectives.  </p>\n\r\nSparks\r\n<p>Sparks also known as Alexa Lamarr is Wild Force's younger member and brightest engineer. While on field she can make use of \"Bolt\" her scout drone who has the ability to stun an enemie for a short period of time.</p>\r\n\r\nHammer\r\n<p>Hammer also known as Alfredo Martínez Sánchez is Wild Force's heavy hitter and demolition expert. He can use his sledge hammer to hit ground dealing damage to surrounding enemies.</p>\r\n\r\nColt\r\n<p>Colt also known as Jing is Wild Force's best shot and weapon expert. Jing can shoot all enemies around her dealing heavy damage to all of them.</p>\n\r\nGameplay\r\n<p>Wild Force is a local cooperative game where you take control of a team of 4 police officers. Each player controls a member of that team, each with unique abilities. The game is uses a turn-based system, so each player can only act on their respective turn.</p>", "metacritic": null, "released": "2022-03-15", "tba": false, "updated": "2022-03-18T09:05:30", "background_image": "https://media.rawg.io/media/screenshots/6e8/6e8f0a16e12d3501e237d8f7aa2020b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Javier Egea"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}