{"id": 755810, "slug": "master-of-tiles-dkrajzew", "name": "Master of Tiles (dkrajzew)", "name_original": "Master of Tiles (dkrajzew)", "description": "<p>Master of Tiles <br/></p>\n<p>Master of Tiles is a simple puzzle board game for for the <strong>Commodore c64</strong> and 1 player. The game was written by the late Benjamin (Pumpkin) Bommer, back in the early 1990s, but never actually got released until now. Although the game was more or less finished back in the day. Daniel Krajzewicz and Richard Bayliss have teamed up help bring this final production to life. The game gets its music replaced with an exclusive tune by Richard and Daniel has fixed a shed-load of bugs that were left in the original back in 1990.</p>\n<p><strong>How to play:</strong></p>\n<p>This is a game for 1 player only. It is a simple strategy game, but there are some rules involved in game play. The game board consists of an 8 x 12 grid. The game starts with 6 different tiles. The idea of the game is to match either the colour or shape of the tiles onto the board. There is a slight catch however. Your shapes and colours cannot be placed on the board if either colour or shape is adjacent to linked shapes in certain areas. You will know if that happens, as the placement of the shape will be ignored. The idea is to try and fill the board with as many tiles as you possibly can. If you cannot link any more tiles, press the back arrow key to abort the game). Your final score will then be checked with high scores. You might achieve a hi score. Have fun.</p>\n<p><strong>Credits:</strong></p>\n<ul><li>Code: Benjamin Bommer</li><li>Graphics: Daniel Krajzewicz and Benjamin Bommer</li><li>Music: Richard Bayliss</li></ul>", "metacritic": null, "released": "2022-03-15", "tba": false, "updated": "2022-03-18T08:44:17", "background_image": "https://media.rawg.io/media/screenshots/a43/a43ec0b71d166991b5e65e0bd1bdc61c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dkrajzew"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}