{"id": 75585, "slug": "demolition-derby-multiplayer", "name": "Demolition Derby Multiplayer", "name_original": "Demolition Derby Multiplayer", "description": "The real time online multiplayer Demolition Derby game.<br/>Download and play against your friends and rivals now  for free!<br/><br/>Just some of the awesome features:<br/>- Real time multiplayer (random opponents)<br/>- Private multiplayer matches against friends<br/>- Practice offline<br/>- Choose your own car<br/>- Multiple tracks / arena's<br/>- Bragging rights - level-up and earn badges<br/>- Realistic wreckage and damage simulation<br/><br/>Choose from various cars and tracks and hit the Play button to instantly play against demolition derby rivals across the globe worldwide. Easy to play, but buckle up and fasten your seat belts as you smash your way to victory and become the demolition derby champion.<br/><br/>Play private matches against friends (HOW TO?)<br/>Not only can you play against (random) players, but you can also setup your own private matches against your friends, family or rivals.<br/>One player should first select HOST from the main menu to host a private match, then select the preferred track. The host will then get a LOBBY ID which can be shared with friends to join the private match. The other players can now select JOIN from the main menu and enter the LOBBY ID / CODE to join the match.<br/><br/>Multiplayer redefined<br/>Smash and crash into your opponents and see the full physics and damage emerge in front of your eyes even when playing online (3G, 4G, or WIFI) in real-time against rivals. With the Destruction Crews' new breathtaking peer-to-peer multi-player technology that has been optimized over the past years this game makes you experience multiplayer gaming like never before. <br/><br/>This is not your average racing game! Hit the install button and join the destruction and mayhem with Demolition Derby Multiplayer. Download and install for free now!", "metacritic": null, "released": "2016-09-03", "tba": false, "updated": "2019-10-22T14:23:49", "background_image": "https://media.rawg.io/media/screenshots/3d6/3d6969ba65a89727ec53f4f5997cc01d.jpg", "website": "http://www.destructioncrew.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Destruction Crew"], "genres": ["Sports", "Racing"], "publishers": ["Destruction Crew"], "esrb_rating": null}