{"id": 756028, "slug": "water-color-sort-itch", "name": "Water Color Sort (itch)", "name_original": "Water Color Sort (itch)", "description": "<p><strong>Water Color Sort: Puzzle Game</strong> – is a brand new color sorting puzzle game with a breakthrough in gameplay and sorting puzzles. Show your skills in sortpuz and pouring watercolors into the bottles, test tubes, glasses, soda bottles so that each container is filled up with the same color. If you love to play color sorting games and puzzle games or color pouring games, then this water color sorting game is the best choice for you. Color puzzle liquid games are challenging and best for brain exercise. If you like sorting water color puzzles, you will be interested in playing this water color sort game too.<br/><br/>Water color sorting game has addictive gameplay that will boost your brain activity. Color sort puzzle games are the best time killers. Firstly color sorting puzzle games and color matching games looks simple and easy to play. The higher the level, the higher the difficulty means you need to think hard for each move and test your brain. Color sorting games and puzzle games are really helpful in enhancing brain activities. Sort the colors and match them until all the colors are poured with the same colors in the bottles. Play water sort puzzle game and relax in fun liquid sorting games to pass your time. <br/><br/><strong>How to Play Color Sorting Game:</strong><br/><br/>• This color sorting game can be played using only one finger.<br/>• Tap the glass bottle and pour watercolor into another bottle.<br/>• You can only pour water color into another bottle if it has the same color and enough space. <br/>• If you get stuck, no worries, you can Restart the level at any time<br/>• Use the hint option to get the additional move.<br/><br/><strong>Features:</strong><br/>• Play with only one finger.<br/>• Free and easy to play.<br/>• Addictive gameplay.<br/>• No time limit.<br/>• Free offline playing option.<br/>• A family fun game for all ages.</p>", "metacritic": null, "released": "2022-03-15", "tba": false, "updated": "2022-03-18T09:46:44", "background_image": "https://media.rawg.io/media/screenshots/952/952f832bf222b72d56f485919637e476.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Penalogix"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}