{"id": 75614, "slug": "superhero-transform-robot", "name": "Superhero Transform Robot", "name_original": "Superhero Transform Robot", "description": "We would like to welcome you to our Superhero Transform Robot game. <br/>Superhero Transform Robot is especially for robot lovers fan who want robot transformer and robot fighting. <br/>▶ GAME PLAY ◀<br/><br/>&gt; Game will bring your mission after mission. You will face number of robots and breathtaking cars with fully weapons in each mission.<br/>&gt; Clear the mission will help free this earth from robots.<br/>&gt; Creates a different every time for hours of radioactive fun!<br/>&gt; becomes the world best player.<br/><br/>Superhero Transform Robot Features:<br/><br/>•\tDetailed environments with different Views.<br/>•\tHighly Intelligent Robots.<br/>•\tRobots car with sci-fi guns <br/>•\tRealistic Sound Effects.<br/>•\tFully equipped with realistic fighting animations and fantastic combat physics unseen in typical robotic simulator.<br/>•\tStunning gameplay with variety of transformer cars.<br/>•\tFuturistic HD 3D Graphics.<br/>•\tFuturistic game Environment<br/>Superhero Transform Robot is one of the best new generation transformer robot games. Let’s take you on another journey in Transformer Robot Superhero games that gives you the enjoyment of riding a drift cars and futuristic robots. Full of killer tricks, awesome freestyle action and insane stunts. Get through the Transformer Robot Superhero in this addictive game. If you love robots, limo cars, fun games, funny games, futuristic games, survival games, savior games, police cars, shooting games, transformer robot games, and endless games you will love this! <br/><br/>In this game use your Superhero Transform Robot and other fighter skills, mobo skills &amp; racing skills. You can transform into furious sports car, drift through the city, perform stunt as well and turn into a striking killer machine and wreck robots.<br/><br/>Superhero Transform Robot will be updated according to your suggestions. Don't forget to leave a review with your feedback.", "metacritic": null, "released": "2017-03-03", "tba": false, "updated": "2019-10-22T14:23:50", "background_image": "https://media.rawg.io/media/screenshots/d4c/d4c5ccd2d30d81092d5645ab384892a4_n4Q02jo.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": [], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}