{"id": 756192, "slug": "k9-uprising", "name": "K9 UPRISING", "name_original": "K9 UPRISING", "description": "Bring your best reactions, poise and dexterity. Because you'll need it to battle the waves of Alien Invaders in this high octane, adrenaline pumping fight for survival. <br/>\n<br/>\r\nStory<br/>\n<br/>\r\nTwo scientists create there final experimental team to save the planet from an Alien invasion. Will they succeed?<br/>\n<br/>\r\nFeatures<br/>\n<br/>\r\n- Hundreds of enemy patterns. Also very scarce randomized sections to keep you thinking.<br/>\n<br/>\r\n- Hand crafted enemy placement with casual to challenging difficulty. Some dogs will have an easier time than others because there weapons handle so differently.<br/>\n<br/>\r\n- Select any mission from the beginning, so people of all experience levels can enjoy a fantastic shooting experience.<br/>\n<br/>\r\n- 100 stages. Every mission has 10 stages (waves) to complete a mission.<br/>\n<br/>\r\n- Competitive scoring system (between the dogs). Each bullet type has a different score depending on the enemy they touch. Discover each dogs style of play to maximize your score.<br/>\n<br/>\r\n- You have Infinite lives so just keep on playing until your hearts content. At the cost of having Infinite lives you lose a 100.000 score if you get hit 3 times.  <br/>\n<br/>\r\n- K9's Uprising can appeal to casual or advanced players. Play for survival or score challenge all in the same mode.<br/>\n<br/>\r\n- 10 built in personal leader boards, one for each mission. Which dog will you dominate the boards with?<br/>\n<br/>\r\n- 5 different dog soldiers to select. Each has 3 unique weapons to master.<br/>\n<br/>\r\n- 15 Weapons and there base weapons upgrade automatically on later missions.<br/>\n<br/>\r\nSo that makes 25 in total.<br/>\n<br/>\r\n- Engaging story shows heavy script dialog from start to finish. You can speed up text or skip all the text entirely.", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-05-09T04:59:13", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2e8d7531784ac1d9dfbbe80c1e01fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["groovydoggames", "Groovy Dog Games"], "genres": ["Action", "Shooter", "Casual", "Indie"], "publishers": ["Groovy Dog Games"], "esrb_rating": "Teen"}