{"id": 75617, "slug": "monster-truck-xt-airport-derby", "name": "Monster Truck XT Airport Derby", "name_original": "Monster Truck XT Airport Derby", "description": "Airport Show is an exclusive stunt driving event and you’ve been invited to take part! Welcome to the high stakes, high-octane driving competition for the fiercest drivers! The biggest cars need only apply!<br/><br/>FEATURES:<br/>▶ UNIQUE STUNT ARENA: Drive around an old airport!<br/>▶ AWESOME MONSTER TRUCKS: Each vehicle handles differently<br/>▶ 70 MISSIONS TO COMPLETE: Drive, do tricks, beat records<br/>▶ FREE ROAMING MODE: Explore the area at your own pace<br/><br/>Taking place in an airport that’s been repurposed as an obstacle course for giant trucks, Monster Truck Airport Show will test your driving skills unlike anything you’ve seen before! Pick one of the amazing, unbelievably huge vehicles available and show that you’ve got what it takes to drive them!<br/><br/>Depending on the vehicle of your choosing, you will get multiple missions of varying difficulty to complete. You will have to dodge obstacles, use ramps for long distance jumps, drive over cars &amp; tree logs and more! Perform mind-blowing tricks, test your reflexes, become a master stunt driver!<br/><br/>There isn’t much that can compare to the power of a speeding monster truck, but that doesn’t mean you can be reckless! Drive safely and carefully and you will surely make it to the end in one piece. If you make a mistake along the way you can always use a rewind system to correct it without restarting the level from scratch.", "metacritic": null, "released": "2018-02-02", "tba": false, "updated": "2019-10-22T14:23:50", "background_image": "https://media.rawg.io/media/screenshots/2d7/2d79f176c7c2f141bb697d904a9e6efc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": null}