{"id": 756122, "slug": "the-kings-feast", "name": "The King's Feast", "name_original": "The King's Feast", "description": "<h3>THE KING'S FEAST... YOU'LL NEVER BE HUNGRY AGAIN!</h3>Become a legendary overseer of dinner parties and take control of your sword. Wielding your power as king, you will remove uninvited guests and would-be assassins from your affair. Will your subjects celebrate you as the \"Lord of Libations\" or the \"Bummer of Banquets\" at this grand feast? Only you and your trusty sidearm can tell what will be etched in the storybooks for future party planners to come.<h3>Features:</h3> <br/>Control the chaos of the room and where your blade will land.<br/>Medieval Fantasy setting with unique gameplay.<br/>Complete challenges and collect gold teeth to unlock new sword pieces and sets.<br/>Quick and easy playthroughs with endless replayability!<h3>You Are The Sword</h3>Take direct control of your blade and its direction, while attempting to traverse this endless dinner party. Punish those who have insulted The King and make those around them think twice. Or maybe choose to go for distance to show the wrong doers that the king is not to be trifled with. Whichever path is taken is chosen by YOU!<h3>Power Ups</h3>Use Magical Power Ups to quickly replenish and affect the sword's behavior as it flies through the air.<br/> <br/><ul><li>Levitate: allows the sword to float through the air replenishing itself as it goes, but be warned, tapping into this power too much may cause your telekinetic bond with your blade to fail.<br/><br/></li><li>Thrust: Pushes your sword forward with great speed and will replenish. However, be mindful of the skill cooldown!<br/> <br/></li><li>Repulse: Gives a boost of kinetic energy to your sword causing it to repulse against the ground. This skill too needs time to cooldown. Find replenishing buffs to reduce the cooldown faster! </li></ul><h3>Item Shop</h3>Visit the Wizard's shop to spend the gold you've earned to purchase new and exciting items to use in the Forge.<br/> <br/><h3>Forging System</h3>Utilize the forge to create and customize new swords. Mix and mash together sword parts to create endlessly unique cutlery that are yours alone!<br/> <br/><h3>Naming System</h3>Part of the Forging System, put your personal stamp on your creations by naming your swords, and forging the blade's legacy within the annals of feasting history!<br/> <br/><h3>Achievement and High Score Tracking</h3>Keep track of your high scores and try your best to beat them. Unlock very special items and cosmetics through achievements and accolades to create more unique swords!", "metacritic": null, "released": "2022-03-15", "tba": false, "updated": "2023-01-27T02:44:17", "background_image": "https://media.rawg.io/media/screenshots/b2c/b2cbb5f7502db5ca318b8e293b4556b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["2016mcook", "TriCenaTops", "Malik Upshur", "Lantern Light Studios", "TonyZocc", "JPSimon"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Lantern Light Studios"], "esrb_rating": null}