{"id": 756266, "slug": "king-of-slimes", "name": "King of Slimes", "name_original": "King of Slimes", "description": "<p>In the frozen aftermath of a war between slimes, can one little blob bring everyone together, or will it further the carnage?</p>\n\n<p>instructions - When the player is in freeze (cyan) mode, any unfrozen slimes (green) that the player touches will freeze (blue) and opposite for revive (purple) – use the ‘switch’ (Q) skill to alternate. Additional to unfreezing, revive will cause unfrozen slimes to join your side (pink); beware though, as freezing a slime that trusts you will make it rage (red), a different slime on your side can calm it down.  ‘burst’ (R) acts as if the player touches everything it hits.</p>\n<p>When a slime is unfrozen, it has a chance to become brittle (yellow) and will break in an explosion when frozen, causing other slimes to unfreeze with a high chance of becoming brittle. If the player is hit, it’s game over.</p>\n<p>An unfrozen slime will freeze when touching a frozen slime. When a slime is frozen for a while, it’ll eventually melt out with a high chance of being brittle.</p>\n<p>Tl;dr (not recommend)</p>\n<p>blue = frozen</p>\n<p>pink = friendly</p>\n<p>yellow = dangerous</p>\n<p>red = really dangerous</p>\n<p>This game is currently in beta (V. 0.2) and doesn't have a clear objective in it. I plan on working to improve this by adding bosses, more enemies, and possibly objectives in the game. If you would like to support the development of this project, then there should be a 'support this game' button above the description. whether you pay or not, thank you for supporting the game by playing! :)</p>\n\n<p>Tip - It is highly recommended that when starting you read the instructions to understand how the game works. (personally, I feel the instructions are a bit long so if anyone has suggestions for a shortened version, that would be much appreciated!)</p>\n<p>Tip - It's okay to die</p>\n\n<p>Credits - game, design, and animations are done by packed1000</p>\n<p>Check out my other games: https://packed1000.itch.io/</p>\n<p>Twitter: https://twitter.com/packed1000\r\n</p>\n<p>Reddit: https://www.reddit.com/user/packed1000\r\n</p>\n<p>floor material by Nobiax/Yughues: https://assetstore.unity.com/publishers/4986</p>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T10:56:31", "background_image": "https://media.rawg.io/media/screenshots/1b8/1b8163dfc7ab80fbbac4169f84d86bf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Packed1000"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}