{"id": 756368, "slug": "the-potion-witch", "name": "The Potion Witch", "name_original": "The Potion Witch", "description": "<p>This little MetroidVania-like game was made for the Metroidvania Month 15 Game jam.  the Theme was \"Potions\", so I decided to just go all in and build it from the ground up to be about, well, making a potion! </p>\n<p>Story: You are a potion witch (well, just an apprentice...).  You have been tasked with gathering some ingredients for your boss, who has a client wanting a love potion.  Gather the ingredients (a large toadstool, a newt eye, and an octopus tentacle) before delivering the potion to the lovestruck client.  But be careful: the creatures that those ingredients belong to would rather like to keep them for their selves, thank you very much!</p>\n<p>I know the controls are a bit... Janky, but I don't have time to fix them.  I plan to take my time after the jam and learn how to do key binding.  but for now, I am just kind of stuck with this</p>\n<p>Controls: <br/>Movement: Left and Right Keys<br/>Jump: Space<br/>Hover: Hold Space While Falling<br/>Change Attack : D<br/>Cast a Spell: A<br/>Shrink: Down<br/>Swim: Hold Space To Swim Up</p>\n<p>I also planed to have a simple dialogue to guide the player along, but I am stumped on that.  So, for now (until I have time at some unknown point in the future) there is no dialogue</p>\n<p> All of the art, mechanics, sound, etc. was made by me, using Gdevelop5, Aseprite, and 1bitDragon.  </p>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T11:24:36", "background_image": "https://media.rawg.io/media/screenshots/6d5/6d571743fa7a400014deeee0964b7a49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Eli Haun"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}