{"id": 756381, "slug": "crocodile-charades-game", "name": "Crocodile Charades Game", "name_original": "Crocodile Charades Game", "description": "<p><strong>Crocodile Charades Game</strong> - Show the word using gestures and facial expressions of the word from the card so that other players can guess it.</p>\n<p>In this case, you can not make any sounds, point to objects and draw!</p>\n<p><strong>Rules:</strong></p>\n\n<ul><li>The rules used for the acted charades are usually informal and vary widely, but commonly agree in essence with the basic rules:</li><li>The players divide into 2 or more teams.</li><li>One member of the team, the “actor”, gets a random phrase or word, which is kept secret from the remainder of the team, the “guessers”</li><li>The actor then has limited time in which to convey the secret phrases to the guessers by pantomime</li><li>The actor may not make any sounds or lip movements</li><li>The actor can act out the phrases in order of his choosing and can switch between phrases anytime</li><li>The actor cannot point out at any of the objects present in the scene, if by doing so they are helping their teammates</li><li>Most commonly, the actor is allowed to make any gestures other than blatantly spelling out the word</li><li>The guessers attempt to guess the words or phrases based on the actor’s performance. They can ask questions, to which the actor may give non-verbal responses, such as nodding in affirmation</li><li>If any of the guessers says the correct word or word within the time limit in the literal form, the team gets a point for that word</li><li>The teams alternate until each team member has had an opportunity to be the actor</li></ul>\n\n\n<p><strong>Download and play this game with a group of friends!</strong></p>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T11:28:05", "background_image": "https://media.rawg.io/media/screenshots/4a6/4a6ec00a6837fc373b78b8aa2b3d068a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vls_sergey_vls"], "genres": [], "publishers": [], "esrb_rating": null}