{"id": 756451, "slug": "abra-capy-dabra", "name": "Abra Capy Dabra!", "name_original": "Abra Capy Dabra!", "description": "Creators: Justin Alagon, Alaina Klaes, Nick Milton, Kevin Jung\r\n<p>Capybaras are adorable. But they're also magical! <strong><em>Abra Capy Dabra</em></strong>, you can explore a magical world as a Capybara and become the best Capybara Sorcerer in the land. Spring into action wielding one of many spells fighting off some of the evilest monsters in the land! Want to play co-op? Invite your friends to join as a trusty Capybara sidekick!</p>\r\nControls:\r\n<p>We are using the WASD setup for movement of the capybara player. To cast spells, click in the direction on the screen you want to cast the spell. The spell will charge upon clicking the mouse and shoots from where it stands towards where the mouse is. To change spells, simply use the scroll wheel on your mouse or press keys 1-5. Different color spells will yield different results!</p>\r\nSpells:\r\n<ul><li> Water burst - shoots 2 bursts of water that deals some damage</li>\n<li>Fireball - shoots a fireball that deals a lot of damage</li>\n<li>Plasma bullets (purple) - shoots a large number of bullets consecutively that deal small damage each but adds up</li>\n<li>Chum the waters (turquoise) - A bunch of sharks come out of the ground and chomp whatever they come up to</li>\n<li>Heal shield (green) - heals everything within its boundaries</li></ul>\r\nOnline Multiplayer\r\n<p>Players can create and connect to online servers and cast spells as capybaras together! The host simply has to type a name for the server into the “create server” prompt and press the create button. Anyone who wishes to join just has to type the server name into the “join server” prompt and press the join button. Once everyone has clicked the “join” button once, the host presses the “start game” button and then everyone can start making magic and have fun!</p>\r\nResources Used:\r\n\r\n<p>Pixel Art/Animations - Aseprite (steam)\r\n</p>\n<p>Unity addons: Cinemachine, 2D tilemap extras, and NavMesh 2D\r\n</p>\n<p>Cover Image - Paint Tool SAI ver.2\r\n</p>\n<p>Sounds: www.fesliyanstudios.com, MuseScore3</p>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T11:43:27", "background_image": "https://media.rawg.io/media/screenshots/130/130f87de3d97402be164d93c148a4860.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MiltonNH25", "Jalagon", "KStar510", "AlainaAK"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}