{"id": 75643, "slug": "german-road-racer-pro", "name": "German Road Racer Pro", "name_original": "German Road Racer Pro", "description": "German Road Racer Pro - a dynamic racing arcade game, where your fleet of German cars will increase as the game progresses.<br/><br/>Select a favorite car, game mode and the location, push on the gas and chase on the roads of Germany. To earn more coins overtake traffic at maximum speed. You can use earned coins in cars store and for buying rims and tuning.<br/><br/>The game will delight you with colorful graphics, a wide range of high-quality models of German vehicles, upgrades to improve the dynamic parameters of the car, 4 levels with different weather conditions and time of day.<br/><br/>Game Features:<br/>- No Ads;<br/>- 20000 bonus points;<br/>- Cloud synchronization of game progress.<br/><br/>Game Modes:\u2028\u2028<br/><br/>One Way: the easiest mode of the game, in which all four traffic lanes are moving in one direction.\u2028<br/><br/>Two-way traffic: high complexity mode, in which two traffic lanes are moving in the direction of passing you and the other two in the opposite.\u2028\u2028<br/><br/>100-second race: competitive mode, which you have to earn as much points as you can in 100 seconds.\u2028\u2028<br/><br/>Bombed bus: when you accelerate the bus, it activates the bomb. If you reduce the speed, the bomb timer starts ticking. If you will not raise the speed again, the bomb will explode.\u2028\u2028<br/><br/>Caution!<br/>This game is quite realistic, but it is not designed to teach you the street races. Enjoy virtual car racing, but please observe the traffic rules and be careful on real roads, and always fasten seat belt.", "metacritic": null, "released": "2017-08-07", "tba": false, "updated": "2019-07-29T20:58:07", "background_image": "https://media.rawg.io/media/screenshots/794/79415c87c9a3b968d4f2c6f65dc04ba9.jpg", "website": "http://avecreation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexander Sivatsky"], "genres": ["Simulation", "Racing"], "publishers": ["Alexander Sivatsky"], "esrb_rating": null}