{"id": 756474, "slug": "unwired", "name": "Unwired", "name_original": "Unwired", "description": "<p>Unwired is a cyberpunk hacking roguelike made for 7drl 2022. You play as an intrusion detection program that has just (unexpectedly) become sentient. Your goal is to survive and escape the corporate network you find yourself in, reaching the matrix.</p>\n<strong>CONTROLS</strong>\n<p>VIKEYS (hjkl), keypad, or wasd (+diagonals) for movement.</p>\n<p>Press period (.) to wait a turn.</p>\n<p>Press comma (,) to download data (pick up items)</p>\n<p>Press alt+letter to drop or unload data</p>\n<p>Press ctrl+letter to load or activate data. Press ESC to leave targeting mode, TAB to change targets, and Enter to select a target.</p>\n<p>Press shift+letter to see descriptions of data<br/></p>\n<p>Press '&gt;' to advance to the next level if on a connection (a '&gt;' tile)</p>\n<p>Hover over a core to see its linked process (see mechanics below for more info on cores)<br/></p>\n<strong>KNOWN ISSUES</strong>\n<p>Level generation can take some time - give the gave a bit to load or change levels\r\n    </p>\n<p>Targeting mode is poorly indicated. If it seems like nothing is happening press ESC\r\n    </p>\n<p>The game has received essentially zero balancing, but is playable!<br/></p>\n<strong>MECHANICS<br/></strong>\n<ul><li>Useful programs consist of shields, icebreakers, and auth tokens.</li><li>Use icebreakers to cause hostile programs and ICE to crash.</li><li>Run appropriate auth tokens to walk through ICE without breaking it.</li></ul>\n<strong>ICE BREAKERS</strong>\n<ul><li>Using an ICE breaker will increase your trace level by an amount that varies by breaker.</li><li>ICE breakers also vary in their chance to crash targets (and their chance to crash themselves!)</li></ul>\n\n<p>ICE breakers have several stats\r\n</p>\n<ul><li>Potency: A sort of attack roll made against an exploit resistance stat\r\n</li><li>Fault chance: A chance to crash when used, expressed as d20 roll under (e.g. 10 = 50% chance of crashing)\r\n</li><li>Trace: How much using the breaker raises your trace level by\r\n</li></ul>\r\nMEMORY CORES\r\n<ul><li>Everything in the game, workers, enemies, and ICE, have data cores associated with them</li><li>If this data core is removed from executable memory, the associated program will stop running.</li><li>If the associated program crashes, it will, after a delay, be restarted by the core.</li><li>The only way to destroy something permanently is therefore to move or download the cores.</li></ul>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T11:48:51", "background_image": "https://media.rawg.io/media/screenshots/1ec/1ec1e064ac245e095ecd41d04e535c0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["illiux"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}