{"id": 756472, "slug": "space-garbage-truck", "name": "Space Garbage Truck", "name_original": "Space Garbage Truck", "description": "<p>\"OKAY RECRUITS, LISTEN UP.\"</p>\n<p>\"Maybe you GAMERS who grew up in ARCADE PILOTING LAND with your STAR FOXES and ROGUE SQUADRONS think piloting a spaceship is easy, but it's NOT.\"</p>\n<p>\"Here's how it works:</p>\n<ol><li>Press the <strong>W KEY</strong> to engage your rear thrusters, that's going to increase your FORWARD velocity. These thrusters are the big daddies, they have the biggest force.</li><li>Press the <strong>S KEY</strong> to engage your front thruster. This will start to push you back</li><li>Use the <strong>A KEY</strong> and <strong>D KEY</strong> to turn. A will engage your RIGHT thrusters, which will push you LEFT. D will engage your LEFT thrusters, which will push you RIGHT.</li><li>Now here's where it gets complicated. <strong>UP ARROW</strong> and <strong>DOWN ARROW</strong> engage your top and bottom thrusters. TOP thrusters push your nose DOWN, BUTTOM thrusters push your nose UP.</li><li>Lastly, the left and right arrows will engage your rotation banking controls. <strong>LEFT ARROW</strong> will tilt your ship left using the RIGHT BANK thrusters, <strong>RIGHT ARROW</strong> will tilt your ship right using the LEFT BANK thrusters.\"</li></ol>\n<p>\"In SPACE, there's no FRICTION to slow you down. So once you START moving, you're going to KEEP MOVING until you apply an OPPOSITE FORCE to slow you down. Try to keep an eye on your velocity gauges, they can tell you how much velocity you currently have so you can try to get control of your craft.\"<br/></p>\n<p>\"Got all that? If it gets too much to handle, you can press the <strong>SPACE BAR</strong> to activate the QUANTUM GRAVITATOR and bring your ship to a COMPLETE stop.\"</p>\n<p>\"To recap: your controls are</p>\n<ul><li>W A S D</li><li>UP DOWN LEFT RIGHT</li><li>SPACEBAR\"</li></ul>\n<p>\"Oh yeah, in case your simulators didn't remind you: gravity is a thing. Try not to crash into any planets, please. Your ship is worth more than my entire retirement.\"<br/></p>\n<p>\"All you gotta do is clean up some trash around the Centrix system. Follow the arrow provided by your guidance computer. it will point you towards the closest piece of interstellar garbage. The distance will also be shown on your HUD.  Once you find it, just ram into it; your ship will handle the rest. Now GET GOING!\"<br/></p>\n\n<ul><li>Created in<ul><li>Unity 2021.2.15</li><li>~ 5 hours of work</li><li>See this and other projects in my Low Effort Jam GitHub Repo</li></ul></li><li>Attributions<ul><li>Space Skybox: https://tools.wwwtyro.net/space-3d/index.html#animationSpeed=0.24596817171857965&amp;fov=80&amp;nebulae=true&amp;pointStars=true&amp;resolution=1024&amp;seed=726c35l5ss1s&amp;stars=true&amp;sun=true</li><li>Planet textures created with: https://www.texturesforplanets.com/download.shtml</li><li>Music by: Pixxy</li></ul></li></ul>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T11:48:24", "background_image": "https://media.rawg.io/media/screenshots/137/137449ad3403f234f16eb3076d06f798.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nhahn"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}