{"id": 756494, "slug": "tome-of-ages", "name": "Tome of Ages", "name_original": "Tome of Ages", "description": "7DRL Failed Entry\r\nTome of the Ages\r\n<p>Plunge into the depths to uncover the long lost tome!... Or at least that's what you would have done, had I finished this project in time.  I'm leaving this up, since I really like the concept, and I'm proud of the art.  (I'm considering making the art a free public art pack; if you're interested, let me know!)</p>\n<p>There is currently no way to win this game, and a good many of the collectables do not have their functionality implemented yet.  Still, it's fun to play around with.</p>\r\nInstructions:\r\n<p>This is a very stripped-down roguelike.  You only have a couple of actions (dig, move, strike, zap, wait), and there are no weapons, potions, or equipables.  Instead, the fun of the game comes from the collectible artifacts, which buff your abilities.</p>\n<p>There's a level of emergent gameplay that comes from the interplay of the artifacts.  Some appear helpful but can ruin builds; some seem hurtful but could be useful in specific scenarios.</p>\r\nImportant Info for Gameplay\r\n<p>Main actions:</p>\n<p>(everything is point and click, but you can toggle your three main actions with the first three number keys)</p>\n<ul><li> Strikes (sword button or \"1\" key) are melee attacks</li><li>Zaps (lightning bolt or \"2\" key) are ranged magic attacks</li><li>Wait (ZZZ or \"3\" key) skips the rest of your turn</li></ul>\n<p>Other variables:</p>\n<ul><li>Agility (blue feather) is the number of actions left in your turn.  All agility recharges at the start of your turn.</li><li>Strength (grey weights) is the base damage for melee attacks.  (Sorry, never implemented the indicator for this one, so it's a secret.)</li><li>Charge (yellow bolt) is the base damage for your Zap spell.  When you cast Zap, you expend all your Charge and must wait for it to recharge.  You can cast zap at any Charge level, but the damage will be lower.</li><li>Regeneration is the amount of health you regain on your turn. (Also didn't finish making the indicator for this one.)</li></ul>\n<p>Items:</p>\n<ul><li>Older artifacts are more powerful, but are also found deeper underground. Hint: caves and ruins can sometimes spawn old artifacts!  (Lots of the older artifacts never got their functionality fleshed out... sorry.)</li><li>Gems were supposed to buff your stats according to their color (rubies buffed health, sapphires buffed agility, etc).  I never finished implementing that, so right now they're just pretty.</li></ul>", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-18T11:56:36", "background_image": "https://media.rawg.io/media/screenshots/3ea/3ea9d95acae1f3c3e18b5c6e12eaac28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thetgi"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}