{"id": 756535, "slug": "estrela-solitaria-lendas-de-pindorama", "name": "Estrela Solitária - Lendas de Pindorama", "name_original": "Estrela Solitária - Lendas de Pindorama", "description": "<p>Pindorama é como os povos indígenas chamavam a terra que hoje conhecemos como Brasil, e a ideia desse jogo é abordar temas, culturas e povos reais da época antes do descobrimento do Brasil, bem como temas, culturas e povos fictícios. <br/><br/>Para criar o jogo, eu me inspirei em Super Mario 64, Fire Emblem e The Lost Vikings, três jogos que aparentemente não têm muitas semelhanças (e não tem mesmo), mas que possuem ideias, conceitos e mecânicas muito interessantes. Pegando um pedacinho de cada um e fazendo uma mistura nada habitual, criei o protótipo de Estrela Solitária.<br/><br/>A história do jogo se passa séculos depois de um grande evento que destruiu quase tudo o que existia no mundo de Pindorama. Muitas pessoas morreram e muito do conhecimento foi perdido. Agora, grupos de jovens exploradores se juntam e formam clãs para encontrarem artefatos do passado, recuperando assim parte do conhecimento perdido, além de aprenderem mais sobre a própria história do mundo. No meio disso tudo, surge uma lenda sobre um poderoso artefato chamado de Estrela Solitária, que supostamente seria capaz de dar ao seu portador todo o poder e conhecimento acumulado entre as duas principais tribos que habitam Pindorama. Apesar de muitos duvidarem da existência desse artefato, ele se tornou objeto de desejo de muitos exploradores, que dedicam a vida para encontrá-lo.<br/><br/>A jogabilidade consiste em procurar artefatos perdidos em 8 áreas diferentes, e para isso você pode recrutar vários exploradores diferentes, cada qual com sua própria habilidade. Essas habilidades são necessárias para alcançar certas lugares das áreas a serem exploradas, por isso é muito comum voltar em locais já visitados quando você tiver um novo integrante no seu clã. Outro destaque da jogabilidade fica por conta do sistema de batalha, que é extremamente simples e automático, bem diferente daquilo que costumamos ver em jogos feitos no RPG Maker.<br/><br/>OBSERVAÇÃO IMPORTANTE:<br/>O jogo ainda é apenas um protótipo, pois tudo foi feito em uma única semana, para participar de uma JAM, por isso apenas dois baús estão disponíveis para serem encontrados.</p>", "metacritic": null, "released": "2022-03-13", "tba": false, "updated": "2022-03-18T12:10:44", "background_image": "https://media.rawg.io/media/screenshots/69f/69f0d00362e893b633243dbd2433c551.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SolonBarcelos"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}