{"id": 756575, "slug": "lost-artifacts-mysterious-book-collectors-edition", "name": "Lost Artifacts Mysterious Book Collector's Edition", "name_original": "Lost Artifacts Mysterious Book Collector's Edition", "description": "The team of experienced treasure hunters rushes off to meet adventure once again!<br/><br/>During a routine inventory of the museum, archeologist Claire stumbles upon an unfamiliar book with a mysterious puzzle lock decorated with precious stones. After trying in vain to open the book, the girl pushed the strange mechanism in her heart and all the stones fell out of it at once! The museum room around quickly changed into a forest of gigantic trees – the book dragged Claire and her team into its world.<br/><br/><br/><br/><br/>Can the brave treasure hunter find the lost stones and return home?<br/><br/>Embark on a heroic mission with Claire – quench her thirst for adventure and help her find all the stones!<br/><br/><br/>Go on an exciting journey through the world of The Mysterious Book!<br/>Funny dialogues, colorful comics, and memorable characters await you!<br/>Each level has hidden items -find them and collect the entire collection of ancient artifacts!<br/>Complete all 40 exciting levels.<br/>Visit 4 unique locations: the Rustic Forest, the Weightless Oasis, the Northern Islands, and Plamegor Volcano, and unravel their mysteries!<br/>More than 6 hours of gameplay.<br/>Fulfill a wide variety of quests, from building buildings, to battling treacherous enemies!<br/>Feel the beautifully themed music and awesome sounds!<br/><br/>", "metacritic": null, "released": "2022-03-18", "tba": false, "updated": "2022-03-21T03:28:50", "background_image": "https://media.rawg.io/media/screenshots/b9d/b9df4f29cf835427cd9e1ef59f0e2c82.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameOn Production"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["8Floor"], "esrb_rating": null}