{"id": 756646, "slug": "block-world-3d-craft-build", "name": "Block World 3D: Craft & Build", "name_original": "Block World 3D: Craft & Build", "description": "Block World 3D is an online open world sandbox game about building and survival, where you can explore, craft, survive, build and more with other players.<br/><br/>EXPLORATION<br/>Explore an endless world, various locations from hot desert to cold tundra, new animals from camels to polar bears, new plants from palm to spruce.<br/><br/>CRAFTING<br/>Collect resources and create various items and blocks from them. Use special crafting recipes to create, improve, repair, enchant unique items.<br/><br/>BUILDING<br/>Create and share your own unique buildings with real players. From a small house to a huge castle. You are only limited by your own imagination.<br/><br/>SURVIVAL<br/>Try to survive in a dangerous world, build shelters and traps, hide in caves and dungeons at night. Fight mobs to protect yourself and don't forget to satisfy your hunger.<br/><br/>CREATIVE<br/>Unlimited creativity, create any world, you have unlimited resources, craft any items and blocks, build anything you want. You can fly and be invulnerable. <br/><br/>ADVENTURE<br/>In adventure mode, it is impossible to destroy and place blocks, however, players can interact with mobs and objects, craft items.<br/><br/>MULTIPLAYER<br/>The game is available network game for all players, play online with your friends on the same server.<br/><br/>GAME MODES<br/>Survival, building, adventure, battle... Each mode has its own characteristics and unique capabilities.<br/><br/>GAME WORLD<br/>In each world you will find a variety of flora and fauna, blocks, caves, biomes, buildings, creatures, events.<br/><br/>CUSTOMIZATION<br/>Choose the color of the skin and eyes, hairstyle, boots, pants, shirt, gloves, cloak for your character.<br/><br/>ITEMS AND BLOCKS<br/>Many items - weapons, armor, clothing, tools, resources, ingots, stones, food, potions, dyes, plants and more.<br/>Many blocks - natural, building, decorative, interactive.<br/><br/>FREEDOM<br/>The game is a block sandbox, there is no main goal, players are not limited by anything and set their own goals. You can do whatever you want.<br/><br/>Join and play together with millions of players from all over the world!", "metacritic": null, "released": "2021-10-06", "tba": false, "updated": "2022-03-21T04:14:50", "background_image": "https://media.rawg.io/media/screenshots/624/624ebe91bb9a2f4b6e1352deed1d7116_aktEHtU.jpg", "website": "http://blockgamesstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dmitriy Nikitin"], "genres": ["Adventure", "Simulation"], "publishers": ["Dmitriy Nikitin"], "esrb_rating": "Everyone 10+"}