{"id": 756659, "slug": "raft-wars-turn-based-battles", "name": "Raft Wars: Turn-Based Battles", "name_original": "Raft Wars: Turn-Based Battles", "description": "Play this new version of the world-famous turn-based online game Raft Wars, a unique and fun artillery game with a colourful comic style. Aim and shoot with your self-build raft artillery beat the enemy teams, and earn yourself treasure chests loaded with gold!<br/><br/>Build your own raft, sail around the colourful Raft Wars world, find treasure chests and improve your raft to become the most excellent treasure hunter the great ocean has ever seen. Win turn-based battles and climb the online leaderboards. Discover everything Raft Wars has in store for you:<br/><br/>- WORLD MAP: Progress through different countries, namely USA, Japan, Ancient Greece, Germany, Beach, Candy Land, Swamp and Vikings. Crush your enemies and advance through unique maps.<br/>- Take on the cruel pirates, roaming bandits and fellow Raft Warriors in challenging turn-based PvE or PvP battles.<br/>- Join a Clan of fellow Raft Warriors or start your own and invite friends.<br/>- Fight in Clan Battles (coming soon) as a team against thousands of active players across the globe.<br/>- 30+ CRAZY CHARACTERS that keep your Raft Wars party going!<br/>- ONLINE LEADERBOARDS &amp; TURN-BASED TACTIC BATTLES!<br/>- 15+ WEAPONS &amp; ARTILLERY to master<br/>- 1000+ RAFT COMBINATIONS – build an insanely powerful raft and show it off to your friends!<br/>- Unique turn-based gameplay and fun levels for both masters and new Raft Wars players!<br/>- Beautiful 2D graphics and comic style characters.<br/>- Show your SKILLS and be showered with REWARDS!<br/>- Be CREATIVE, be POWERFUL and play with FRIENDS – this is the insane RAFT WARS mayhem!<br/><br/>Play now, don’t miss out, and become the first Raft Wars master!<br/><br/>Thanks so much for playing Raft Wars! We can’t wait to see you climb the online leaderboards. Enjoy!<br/><br/>PLEASE NOTE :<br/> <br/>Raft Wars is free-to-play and offers in-game purchases. Playing Raft Wars requires a network connection to play and access its social features. Raft Wars may also contain advertising.<br/><br/>- FOLLOW US -<br/> <br/>Facebook: https://www.facebook.com/RaftWarsMobile/ <br/>Discord: https://discord.gg/UNUku55Z <br/><br/>Need some help? Visit our support page in the Raft Wars app or send us a message at store@gamefacto.com.<br/><br/>Privacy policy: https://gamefacto.com/privacy<br/><br/>Terms of use: https://gamefacto.com/terms", "metacritic": null, "released": "2021-08-16", "tba": false, "updated": "2022-03-21T04:22:52", "background_image": "https://media.rawg.io/media/screenshots/5be/5be918745902cb97ac275740d2d993b5_fd593ko.jpg", "website": "https://gamefacto.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GAMEFACTO BILISIM ANONIM SIRKETI"], "genres": ["Adventure", "Casual"], "publishers": ["GAMEFACTO BILISIM ANONIM SIRKETI"], "esrb_rating": "Everyone 10+"}