{"id": 75664, "slug": "man-vs-dead-zombie-warfare", "name": "Man vs Dead: Zombie Warfare", "name_original": "Man vs Dead: Zombie Warfare", "description": "In 2061, Dr Heisenberg's scientific research fails and a virus spreads across the hospital.All of the patients transform into monsters.<br/>You are the only person who has virus resistance thus you are uninfected and a shooter. Unfortunately to stop the spread of the virus, you have to kill all the zombie patients.<br/>Walking deads are hungry for blood.When you battle in zombie warfare you will either win or die!<br/>You are the only one who can save the world. Hurry up! Shoot them all!<br/>_____________________________________<br/>ZOMBIES<br/>- Wipe out the zombies in the hospital and survive till the war ends.<br/>- The zombies may be in the hospital, dormitory or in Dr's room. <br/>- Aiming and shooting their heads is the best way to kill zombies.<br/>- Go for the zombie leaders so that their group can disband.<br/>- Fire your guns till all zombies dead.<br/>_____________________________________<br/>LEADERBOARD<br/>- Track and compare your progress with your friends; and beat your friends' score.<br/>- Reach the first place on the leaderboard.<br/>_____________________________________<br/>WEAPONS<br/>-Multiple weapons can be armed (knife, rifle, shotgun, machine gun, grenade launcher)<br/>-Take coins from zombies to buy new weapons<br/>-Try to use weapons efficiently, bullet may finish before wave ends<br/>_____________________________________<br/>INTENSE GRAPHICS<br/>- 3D Realistic graphics <br/>- Realistic terrifying zombie characters<br/>- Realistic blood effects<br/>- Zombie scream effects to make you feel scared<br/>_____________________________________<br/>AMMO AND HEALTH<br/>ammo and health drops from zombies randomly <br/>you can also load your magazine and health point from aid kit(next to main gate)<br/>No problem even if you dont have wifi or internet connetion, you can play this game in offline.", "metacritic": null, "released": "2015-02-18", "tba": false, "updated": "2019-07-30T02:46:48", "background_image": "https://media.rawg.io/media/screenshots/1e5/1e5b83894f4919ed170f76d0fc96a11c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EXTREMESOFT BILISIM REKLAMCILIK TICARET LIMITED SIRKETI"], "genres": ["Action", "Adventure"], "publishers": ["EXTREMESOFT BILISIM REKLAMCILIK TICARET LIMITED SIRKETI"], "esrb_rating": null}