{"id": 756638, "slug": "disney-twisted-wonderland", "name": "Disney Twisted-Wonderland", "name_original": "Disney Twisted-Wonderland", "description": "Characters inspired by Disney villains weave wicked schoolyard schemes in this magical adventure featuring rhythm games and RPG-style battles!<br/><br/>■Concept, main story, and character designs by Yana Toboso (Original creator of \"Black Butler\")<br/><br/>SUMMARY<br/>Perhaps there's more to \"villains\" than meets the eye...<br/><br/>Summoned by a magic mirror to Twisted Wonderland, a world altogether unlike your own, you arrive at Night Raven College, a prestigious arcane academy.<br/><br/>With nowhere else to go, you accept the masked headmaster's hospitality and begin searching for a way home.<br/><br/>You quickly find that the students of this school are as talented as they are dysfunctional—bickering and competition are the perpetual order of the day.<br/><br/>Will you be able to work with them and eventually return from whence you came?<br/><br/>And what secrets lie within the villainous hearts of these students?<br/><br/>■Enjoy simple turn-based battles and rhythm games!<br/><br/>GAME OVERVIEW<br/>You will take History of Magic, Alchemy, and Flight classes alongside the students of Night Raven College.<br/>As you dig deeper into your studies, you will unlock more of the story, which has gameplay divided into three parts:<br/>—Story segments, in which you advance through the tale of Twisted Wonderland<br/>—Battles, in which characters fight by slinging spells<br/>—Twistunes, in which you play a rhythm game and tap along to the music<br/><br/>A deliciously dark and enchanting drama awaits you.<br/><br/>■Featuring characters and dorms inspired by classic Disney movies!<br/>Night Raven College has seven dorms, each of which is home to unique characters:<br/>Heartslabyul Dorm—Twisted from Alice in Wonderland<br/>Savanaclaw Dorm—Twisted from The Lion King<br/>Octavinelle Dorm—Twisted from The Little Mermaid<br/>Scarabia Dorm—Twisted from Aladdin<br/>Pomefiore Dorm—Twisted from Snow White and the Seven Dwarfs<br/>Ignihyde Dorm—Twisted from Hercules<br/>Diasomnia Dorm—Twisted from Sleeping Beauty<br/><br/>STAFF<br/>Concept, main story, and character designs: Yana Toboso<br/>Supported by SQUARE ENIX<br/>Development and management: f4samurai<br/>Logo, user interface, emblem, and icon design: Wataru Osakabe<br/>Backgrounds: Atelier Musa<br/>Planning and distribution: Aniplex<br/>Music: Takumi Ozawa<br/>Opening animation: TROYCA<br/>Audio production: HALF H-P STUDIO<br/><br/>RECOMMENDED DEVICES<br/>iPhone 6s or later, iPad Air (third generation) or later, iPad mini (fifth generation or later), iPad Pro (first generation or later)<br/>Note 1: Please use the above-listed recommendations rather than what is listed on the App Store.<br/>Note 2: Please be aware that we will not be able to provide support or compensation to players using devices other than our recommended devices.", "metacritic": null, "released": "2022-01-19", "tba": false, "updated": "2023-04-23T18:59:15", "background_image": "https://media.rawg.io/media/screenshots/370/37055c2516e662174e41484ab12be999_1iSTJpP.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Aniplex"], "genres": ["Adventure"], "publishers": ["Aniplex"], "esrb_rating": "Everyone 10+"}