{"id": 756652, "slug": "mini-mini-farm", "name": "Mini Mini Farm", "name_original": "Mini Mini Farm", "description": "・An adorable farming game full of charming pixel art!<br/>・Easy to pick up and play with just one hand!<br/>・Perfect for small moments of free time throughout your day!<br/><br/>Mini Mini Farm is a farming game where you build up your own island farm little by little every day at your own pace.<br/><br/>Take on requests from villagers, earn money, and explore the island as you uncover its secrets and develop the land for its future inhabitants!<br/><br/><br/>■Story<br/>Long ago, when the land that people lived on was few and far between, you were sent to work on a remote, untamed island far away from your loved ones.<br/><br/>Now it's your job to earn money handling people's requests as you gather resources and build houses in this foreign land, all in the name of developing it into a place where people can reside.<br/><br/>All the while, you dream of reuniting with your family one day and living happily together with them once more...<br/><br/><br/>■What Makes Mini Mini Farm Special?<br/>・No pressure, no high stakes. Relax as you enjoy farming life on the island.<br/>・Pick-up-and-play gameplay allowing you to play and progress in short bursts while killing time.<br/>・Offline play. Playable at your own preferred pace.<br/>・Simple, yet hard to put down. Once they start, many players don't get tired of it!<br/>・Charming, popular, and free to play!<br/><br/><br/>■How to Play<br/>In Mini Mini Farm, all it takes to get most things done is some simple swipes across the screen and the occasional taps, no more and no less!<br/><br/>Moving around: Swipe across the screen<br/>Cutting trees: Move next to a tree<br/>Breaking rocks: Move next to a rock<br/>Plowing fields: Stand next to a crop field<br/><br/>When you want to interact with just about anything in this game, all you have to do is move your character next to it and he'll automatically get to work. Mini Mini Farm is fully designed to be played with one hand, making it the perfect game to play while on the way to school or work!<br/><br/><br/>■Gathering Resources<br/>As you explore the island, you'll come across things that will grant you a variety of resources you can put towards other things, as listed below.<br/><br/>Trees: Trees grow in at least three stages and provide wood or fruit. Fruit trees specifically have a fourth stage that let you pick fruits from them.<br/><br/>Rocks: Rocks are plentiful on the island and, unsurprisingly, provide stones for you to use. Rock piles always regenerate, so don't be shy about breaking them up and taking as many as you need!<br/><br/>Plant fields: Plant fields dole crops, with different types of land allowing you to harvest different types of crops. In particular, you can expect to come across daikon raddishes, tomatoes, carrots, and blueberries, among others. Moving onto a plant field space will make your character automatically plow it. Tapping on that same space once more will make him plant seeds. From there, you'll need to water your plants. Luckily, the soil on the island is rich, meaning no fertilizer is necessary, letting you run a completely organic operation from start to finish!<br/><br/>Sheep: Sheep provide wool. Like any other object in the game, all you have to do is make your character bump into one roaming your ranch in order to get to shearing. Be sure to show these critters affection so they know you're grateful!<br/><br/>Cows: Cows on your ranch let you milk, well, milk from them, turning your regular old island farm into a proper dairy farm!<br/><br/>Ore: Ores you stumble across can yield copper, silver, and more when mined. With some luck, you might even strike gold on the island!<br/><br/>Shrubs: Shrubs are plentiful, growing throughout the desert island and hide coins within their branches. It's a good idea to get in the habit of cutting them to help prepare the ground for harvesting.<br/><br/>Upon collecting them, all of these resources quickly regenerate over time so you don't have to wait long to stock up on more. Make sure to patrol your island early and often to make the most of everything you have available to you!<br/><br/><br/>■Development Team<br/>Programmer: @CafeBreakin<br/>Graphics: @Vryell, @BrvFlame", "metacritic": null, "released": "2020-10-06", "tba": false, "updated": "2022-03-21T04:18:43", "background_image": "https://media.rawg.io/media/screenshots/e6f/e6fefa9bb5a67a24cadcc514d5ec5963_0uX1itN.jpg", "website": "https://cobbee.net/ios/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["CoffeeBreak"], "genres": ["Adventure", "Simulation"], "publishers": ["CoffeeBreak"], "esrb_rating": "Everyone 10+"}