{"id": 756605, "slug": "college-bound-arctic-adventure", "name": "College Bound: Arctic Adventure", "name_original": "College Bound: Arctic Adventure", "description": "College Bound: Arctic Adventure gives you an chance to spend the best winter break of your life in picturesque Iceland! Meet new people (including hot, and sometimes even dangerous, Icelandic babes), play winter sports, gauge your fighting skill, try your luck in seducing local hotties, and even become a detective using your intellect and intuition to solve the case of a mysterious curse that has paralyzed the town.<h3>Hot Girls In A Cold Land</h3>If you’ve played the original version of College Bound, you’ll be pleased to see some of the characters you already know appear in this spin-off game. Blanca, Summer, Jess, Lynda, and Amber from College Bound are featured in this game, but you’ll also have an opportunity to meet several brand new characters with distinct personalities and traits: Zoe, Stacy, Katla, Isak, and Zack. Play your cards right and the girls will want to have more fun with you than just watching auroras or skating. Speaking of which...<h3>Quality Animations &amp; Hot Scenes</h3>Have no doubt, this is a game for adults and I mean it. Do you like blondes, brunettes, or redheads? The choice is yours - there are many animated sex scenes (with multiple camera angles) featuring the hottest girls for you to discover. Complete various quests, use your seduction skills or simply let the girl seduce you to get a sexy reward. Will you be a faithful boyfriend and spend this romantic getaway with only your girlfriend Summer? Or will you give in to temptation and go all the way in?<h3>Your Choices Matter</h3>This is a choice-based story, so expect different outcomes based on the decisions you make. There are multiple endings as well as different ways you can deal with the characters and situations you encounter - some will get you in trouble and some will get you out of it. Some will put you in the friendzone and some will get her moaning!  <br/><br/><br/>You can play College Bound: Arctic Adventure multiple times and experience a different story with each play-through, based entirely on the choices you make.<br/><br/>Check out the core College Bound game here - https://store.steampowered.com/app/1630080/College_Bound__Episode_1/", "metacritic": null, "released": "2022-03-18", "tba": false, "updated": "2024-02-01T07:56:47", "background_image": "https://media.rawg.io/media/screenshots/f63/f63a4043b2bc8e14e3706622e6aa0142.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 11, "beaten": 1, "toplay": 2}, "playtime": 1, "achievements_count": 14, "ratings_count": 3, "suggestions_count": 451, "game_series_count": 0, "reviews_count": 3, "platforms": ["macOS", "Linux", "PC"], "developers": ["FOZ"], "genres": ["Simulation"], "publishers": ["FOZ"], "esrb_rating": null}