{"id": 756792, "slug": "displace-it", "name": "Displace It", "name_original": "Displace It", "description": "Moving your finger to displace 3 objects in the correct position on the picture, but make sure they're in the right order as well. Solving an unending sequence of bizarre problems where discovering the solution will blow your mind – it's the funny and creative animations that each way triggers will keep you returning to the game for more brain-teasing levels. Sometimes there are misleading items, you need to open your mind to solve the puzzles.<br/>Let's see if you can move all of the things to their proper place in our brand new puzzle game Displace It - Brain Puzzle<br/><br/>Features<br/>  -The game has simple gameplay mechanic but discover the solution is not an easy task, your imagination will be taken to another level with mind blowing riddles<br/>  - There are already over 100 puzzles in the game, each with its own distinct hilarious setting and brand of insane logic that will test your thinking abilities.<br/>   -  With classic cartoon-style graphics, and the ability to keep attempting to solve the riddle until you find the proper solution, even the youngest players may enjoy brain training and logical thinking.<br/>   - Clean design, vibrant graphics, and upbeat soundtrack bring you a joyful place to spend time.<br/><br/>If you are a fan of Puzzle games and want to train your mind, Displace It - Brain Puzzle is one of the best options for you. Think outside of the box and challenge your imagination now!", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-03-21T05:36:20", "background_image": "https://media.rawg.io/media/screenshots/e6c/e6c7df75893c13aaeffb75633ec3ca62_p3ATIsW.jpg", "website": "http://skysoftstudio.mygamesonline.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Doan Thanh"], "genres": ["Casual", "Puzzle"], "publishers": ["Doan Thanh"], "esrb_rating": "Teen"}