{"id": 756705, "slug": "once-upon-a-match", "name": "Once Upon A Match", "name_original": "Once Upon A Match", "description": "Once Upon a Match is a free fairytale Match-3 puzzle adventure game that takes you into a fantasy realm filled with all your favorite storybook heroes... and villains too!<br/><br/>Legend says that if you collect all fairytale hero cards, you will level up your heroes to triumph, advance in this epic story, and save the kingdoms!<br/>Once Upon a Match offers exciting match 3 gameplay and incorporates all the depth and drama of a role-playing game.<br/>Do you have what it takes to send your enemies back to the Kingdom of Happily Never Ever?<br/><br/>Level up each hero to legendary status, travel from one realm to the next, collect hero cards, and defeat enemy after enemy to save the kingdoms!<br/>Blast into the lands of “Happily Ever After”, and find out what has been up with your favorite Fairy Tale heroes and fiends 20 years after the happily ever after endings you read about as a child. A dark evil has taken control of the kingdoms of the Enchanted Forest, Wonderland, Neverland, and Oz. As you conquer the map to gain loot, you will unveil a magical story.<br/><br/>Can you defeat the evil enemies, reunite the kingdoms, and create your own legendary story? Every hero you collect gives you access to more unique skills. The more gems you loot, the more power you have. Compete with other players - or join forces to win even more prizes and upgrade each hero to the max.<br/><br/>Together, your heroes will create an unstoppable force to blast through enemies in every kingdom!<br/><br/>Features:<br/>Blast the villains!<br/>Create powerful gem combos to send troops storming the battlefield to vanquish the villains.<br/>Collect Heroes!<br/>Unlock new heroes to reveal their unique abilities and add them to your ever-growing collection. From powerful heroes to legendary masters of combat - collect them all!<br/>Rebuild Your Castle!<br/>Win back Rapunzel’s castle and rebuild a beautiful fairytale town to train heroes, gather resources and craft boosters.<br/>Upgrade and customize!<br/>Level up heroes, learn new skills, select your party, and recruit veteran warriors to fight by your side.<br/>Follow the Story!<br/>Join the battle of good VS evil. Explore the land, and advance through the map to progress in the thrilling story.<br/>Stunning graphics!<br/>Feast your eyes on brave heroes and menacing villains, diverse lands, and electrifying special effects.<br/><br/>SUBSCRIPTION DETAILS<br/>- Subscribe to get 30 Daily Gems, 2nd Builder, Loot Tickets &amp; 1 Extra Daily Summon<br/>- Two premium memberships: Monthly track (for 4.99$/month) after 7-day free trial and Yearly track (for 49.99$/year) after 7-day free trial<br/>- Payment will be charged to your iTunes account at confirmation of purchase.<br/>- Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period.<br/>- Account will be charged for renewal within 24 hours prior to the end of the current period.<br/>- Subscription may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>- By downloading this App you agree to Crazy Labs’s Privacy Policy and Terms of Use at https://crazylabs.com/privacy-policy/ and at https://www.crazylabs.com/crazylabs-site-terms-of-use/.<br/>- Please consider that this App may include third party services for limited legally permissible purposes.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.<br/><br/><br/>To opt out of CrazyLabs sales of personal information as a California resident, please visit our Privacy Policy: https://crazylabs.com/app", "metacritic": null, "released": "2021-02-11", "tba": false, "updated": "2022-03-21T04:47:46", "background_image": "https://media.rawg.io/media/screenshots/543/543a1a9ca3606136ffafc638e2894877_Rhk8gvi.jpg", "website": "https://www.crazylabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crazy Labs"], "genres": ["Casual", "Puzzle"], "publishers": ["CRAZY LABS BY TABTALE , G.P."], "esrb_rating": "Teen"}