{"id": 756799, "slug": "decor-match", "name": "Decor Match", "name_original": "Decor Match", "description": "Do you love decorating and designing? If so, play Decor Match today and show off your home design skills! All kinds of rooms are waiting for you to decorate, each with various styles to choose from! Take your pick!<br/><br/>Decor Match is filled with hundreds of compelling puzzles and challenging match levels! Match, Swipe, Swap, Connect, and Crush! Solve a variety of match-3 levels with quick thinking and smart moves to unlock your dream rooms! How creative can you be?<br/><br/>GAME FEATURES:<br/>Swipe and Match<br/>- Free to play match levels for everyone - fun and compelling puzzles. Hundreds of challenging match-3 levels with amusing obstacles so you'll never get bored!<br/>- Match 4 or more to get powerful boosters and create explosive combos! Use them wisely so obstacles won't get in your way, such as ring boxes, ice statues, toasters, dishwashers, and more!<br/>- Test your wits and matching skills! Plan your moves by matching 3 or more in a row. Solve fun match-3 levels to challenge yourself! <br/>- Collect coins in Bonus Levels! Match to create powerful boosters to wipe the board!<br/>- Challenge yourself in the Daily Challenge! Play special match levels to earn more stars to decorate your rooms! <br/>- Beat more match levels to open more chests for awesome rewards, such as coins, boosters, and free energy!<br/>- Earn rewards and prizes with limited-time events that bring you tons of fun levels!<br/><br/>Decorate and Design<br/>- We provide a range of personalized style choices! Decorate your room with different styles to express your creative side. Various styles are waiting for you!<br/>- Choose every object’s style in a room, from floor to ceiling and wall to wall!<br/>- We have many different rooms in Decor Match for you to design and decorate, such as a living room, bedroom, kitchen, and more! What you do with them is up to you!<br/>- Fashionable furniture with various style schemes for you to feast your eyes on!<br/>- Take a photo of your room, save your designs, and collect them all!<br/><br/>Discover and Explore<br/>- Many different room styles with both indoor and outdoor locations!<br/>- Each room has its own story and name, and they're all waiting for you to unlock and explore!<br/>- Beautiful monthly landscapes to give you peace of mind!<br/><br/>Other Features<br/>- Share your designs on Facebook, Instagram, Discord, and Twitter. Let more people see your inspired designs!<br/>- Come up with creative decoration ideas and make them a reality!<br/><br/>Decor Match is free to play! Download and play exciting puzzle levels today! It’s time to put your match-3 puzzle skills to the test! Whether you want to decorate, design, or create the home of your dreams, Decor Match is the perfect way to spend your free time. Calling on all designers! Come and join now! Let’s see your flair for the creative shine!<br/><br/>Join our community! Get inspiration from seeing others’ rooms and discussions!<br/>Facebook: https://www.facebook.com/Decor-Match-110865144808363<br/>Instagram: https://www.instagram.com/decor_match/<br/>Discord: https://discord.gg/gvGYJSHE<br/>Twitter: https://twitter.com/DecorMatch<br/><br/>Need some help? Contact our support via in-game settings or send us an email at decormatch.support@zentertain.net.", "metacritic": null, "released": "2022-01-28", "tba": false, "updated": "2023-12-11T21:25:08", "background_image": "https://media.rawg.io/media/screenshots/7ed/7ed5d586e5995c71c4c989e316fd6d0e_ioGdGq5.jpg", "website": "https://zenlifegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["ZenLife Games"], "genres": ["Casual", "Puzzle"], "publishers": ["ZenLife Games"], "esrb_rating": "Everyone 10+"}