{"id": 756726, "slug": "solitaire-smash", "name": "Solitaire Smash", "name_original": "Solitaire Smash", "description": "Play your favorite classic Solitaire and win real MONEY tournaments.<br/><br/>Download and play for FREE with our in-game virtual currency or join our cash tournaments to win REAL money.<br/><br/>Discover a whole new world of fun in Solitaire Smash - A unique twist on a traditional Solitaire card game.<br/><br/>Immerse yourself in this fast-paced world, with a smooth and modern design, where good reflexes and some good old-fashioned skill win the game and fill your pockets with Real MONEY.<br/><br/><br/>We worked hard to bring you the best Solitaire experience, where you can train and sharpen your skills, play against others, and win real money prizes.<br/><br/>If you are familiar with games like Patience/Pocket7/Solitaire Cash/21 Blitz Solitaire/Spider/Freecell/Cube/Blackout or Big Run, then this is the game for you!<br/><br/>Download the game for FREE and have fun playing regular or cash tournaments, receiving rewards, winning prizes, and real money!<br/><br/>Get started with these exciting features:<br/><br/>· Winning cash isn’t hard - play in real money tournaments for cash rewards!<br/><br/>· Compete against players with the same deck &amp; same skill level in a tournament<br/><br/>· 100% secure deposits and withdrawals<br/><br/>· Easy, safe &amp; secure using PayPal<br/><br/>· Collect daily treats and rewards… they are Waiting for You!<br/><br/>· If you are unsure about your next Solitaire move, you can undo it during play<br/><br/>· Take part in special Challenges, Events &amp; Offers<br/><br/>· No distracting ads<br/><br/>· Endless fun and enjoyment<br/><br/>· And so much more!<br/><br/><br/>How to Play:<br/><br/>- Join one of our exciting tournaments (Either for our virtual currency or Real Money) and put your Solitaire skills to the test against other users at your level.<br/><br/>- Tap and drag cards to build a sequence in descending order and alternating colors in the tableau- The seven columns of cards in the game.<br/><br/>- If you uncover an ace, place it in one of the 4 foundations- The stack piles at the top of the board. <br/><br/>- If you uncover a king, you can place it in one of the empty spots in the tableau. <br/><br/>- If you no longer have face-up cards to move, tap on the stockpile to see if you can play a card. <br/><br/>- The aim is to build sequences of the same suit in one of the four stack piles at the top of the board. <br/><br/>- When you are out of moves, submit your score and take advantage of the bigger time bonus for finishing early.<br/><br/>- Timing is key. The faster you clear the board, the higher you rank, the bigger prize you will get!<br/><br/>- The top 3 finishers will win real money or gems (our virtual currency).<br/><br/>- Keep playing to win daily rewards and treats.<br/><br/>- Enjoy our unique and special events.<br/><br/><br/>Kindly note:<br/><br/>Cash tournaments are not available in the following states: Arizona, Arkansas, Connecticut, Delaware, Indiana, Iowa, Louisiana, Maine, Montana, South Carolina, South Dakota, and Tennessee.<br/><br/>*If you reside in a prohibited state, you can still play for fun with our virtual currency only.<br/><br/>Download Solitaire Smash NOW &amp; win big with your skills! <br/><br/>If you have any questions, feel free to reach out to our Support Team at support@solitairesmash.com,  we are always here to help!<br/><br/>!! INSTALL NOW and turn your solitaire skills into actual real money !!<br/><br/><br/>Enjoy playing our real money solitaire game? Then, please rate and review us, your feedback counts!<br/><br/>We are waiting for you!<br/><br/>https://www.solitairesmash.com", "metacritic": null, "released": "2022-02-16", "tba": false, "updated": "2022-09-04T13:02:12", "background_image": "https://media.rawg.io/media/screenshots/8de/8de8b5f041ebc1fb978c5f57f92ff8a5.jpg", "website": "https://www.solitairesmash.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS"], "developers": ["Appsolyut,tov"], "genres": ["Card"], "publishers": ["Appsolyut,tov"], "esrb_rating": "Mature"}