{"id": 756769, "slug": "life-way-life-simulator", "name": "Life Way - Life Simulator", "name_original": "Life Way - Life Simulator", "description": "Welcome to Life Way, where your possibilities are limitless! Take a dip in Sun Island - a beautiful city located on an island in the ocean. Your character has just graduated from university and is eager to arrange his new life! Help him build a career, find love, make new friends, buy an apartment or a house on the ocean, take a ride on his yellow Lamborghini around the island, discovering new and interesting places...<br/><br/>Help the main character to fulfill the goals set in the game, getting better and better every day. Go to fitness, eat in restaurants or cook yourself, watch your figure, dress in the best boutiques, change hairstyles at least every day.<br/><br/>But how to achieve everything? You have to choose which profession to master and start from scratch. From assistant manager to mayor of the city! Or maybe you are closer to the IT sphere, design or show business? Well, the choice is yours...<br/><br/>Features of the game:<br/>- Unique gameplay: choose a character and help him arrange his life in the metropolis, starting from the sleeping area and ending in the elite, where prices really bite!<br/>- Open world: Explore the island... by car, taxi or on foot. Interesting places are waiting for you!<br/>- Love and friends: meet on the street, take contacts and then have a great time, but be prepared to be rejected if you don't find a common language!<br/>- Development: keep track of calories and your figure, change looks in boutiques and hairstyles in beauty salons, read books and go to courses to raise your qualifications!<br/>- Goals: Complete goals and get exclusive rewards, money and points!<br/>- Career: Choose who you want to become and build your dream career!<br/>- Business: Manage an entire company when you're ready!<br/>- Leisure: go to various places, follow the needs of the character - energy, hunger and mood.", "metacritic": null, "released": "2022-02-23", "tba": false, "updated": "2022-03-21T05:23:02", "background_image": "https://media.rawg.io/media/screenshots/86d/86d7c193dcb91cc6020ad23656f3b356_MoHeZdm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nikita Poslanichenko"], "genres": ["RPG", "Simulation"], "publishers": ["Nikita Poslanichenko"], "esrb_rating": "Teen"}