{"id": 756860, "slug": "phone-evolution", "name": "Phone Evolution", "name_original": "Phone Evolution", "description": "Are you a time traveler? Do you remember what your first phone was? What is your phone now? Did you see all the evolutions of mobile phones? <br/>Over the years there have been many upgrades to telephones. Phones have always been changing as the technology developed.<br/>There are :<br/>• Years<br/>• Weeks<br/>• Days <br/><br/>Positive and negative gates. If you want to upgrade your phone you have to pass through positive Gates and increment the actual year of your phone. <br/><br/>By the way do not forget to take plenty of phone cases and accessories on the way. <br/><br/>There have been many functions of phones. Do you remember them all?<br/>• Calling<br/>• Sending SMS<br/>• Playing games<br/>• Sending emojis<br/>• Saving photos<br/>• Listening to music<br/>• Sending emails<br/>• Message sending via apps<br/>• Lifestyle sharing<br/>• Screen lock by swiping<br/>• Sending our thoughts in shorts<br/>• Sharing videos<br/>• Streaming<br/><br/>Get ready for a time-trip! Are you ready to see the oldies? See the evolution of mobile phones! Have you ever wondered the first ever mobile phone invented? Do you remember the evolution of the phones over the years? If it's a yes to you then you should see this collection of phones.<br/><br/>Best evolution game you have ever seen! Fun to play!You will relax while playing. You will get rid of all your stress. This game is for you! Simple but addicting gameplay and the visual feedbacks will make you satisfied. Fun gameplay will bind you! Show them who is the best time traveler.", "metacritic": null, "released": "2022-01-21", "tba": false, "updated": "2022-03-21T06:14:42", "background_image": "https://media.rawg.io/media/screenshots/2b0/2b0c2241a1ce8e75f24a3ed2093d8dfa_wxR7qZn.jpg", "website": "https://rollicgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ela Game"], "genres": ["RPG", "Simulation"], "publishers": ["ELAGAME YAZILIM ANONIM SIRKETI"], "esrb_rating": "Teen"}