{"id": 756834, "slug": "rugby-nations-22", "name": "Rugby Nations 22", "name_original": "Rugby Nations 22", "description": "Fight every ruck, power through every scrum and convert every precious point. With Rugby Nations 22… Every day is a Rugby day. Let’s play!<br/><br/>Featuring a slew of new gameplay features, graphical improvements and huge changes to player training/progression - allowing for deeper than ever customisation of your Rugby squad.<br/><br/>And, for the first time, the Women’s game is fully represented on an equal footing to the men’s game.<br/><br/>A complete visual overhaul has seen all of the players and stadiums lovingly recreated to make this an awesome looking Rugby game.<br/><br/>And, of course, the gameplay has been further enhanced to offer a fresh and distinctive challenge to Rugby fans all around the World.<br/><br/>Download Rugby Nations 22 for FREE now!<br/><br/>CREATE YOUR OWN CLUB<br/>Create your very own Rugby team, collect and build a team of legendary players and compete with the best teams from around the World to rise through the leagues and claim the silverware.<br/><br/>WOMEN’S RUGBY<br/>Women’s Rugby is one of the fastest growing team sports in the World, with over 2.7 million women and girls playing, it’s clear that no Rugby game would be complete without inclusion of the women’s game.<br/><br/>ALL NEW VISUALS<br/>Player visuals have been recreated and brand new animations added to bring the game closer to reality. On top of that, all of the stadium environments have been recreated with vastly more detail and a greater sense of scale. So, whether it’s a twilight match in New Zealand, a day match in bright sunshine in Australia or a rainy night match in England you’ll find it all beautifully presented.<br/><br/>ENHANCED GAMEPLAY<br/>All new Ruck, Maul, Scrum and Lineout game-play puts you more in control. Plus, individual player traits give each player extra flair and game-play options.<br/><br/>FEATURES<br/>- Women’s Rugby is fully represented for the first time in Rugby Nations.<br/>- All new player visuals for both male and female players.<br/>- Twelve lovingly recreated stadium environments.<br/>- Major improvements to game-play.<br/>- Brand new Ruck, Scrum, Maul and Lineout mini-games.<br/>- Enhanced stadium crowd rendering.<br/>- Referee and linesmen.<br/>- And, much much more!<br/><br/>IMPORTANT<br/>This game is free-to-play but does include optional in-app purchases, which can be purchased with real money.<br/><br/>FIND US<br/>WEB: www.distinctivegames.com<br/>FACEBOOK: facebook.com/distinctivegames<br/>TWITTER: twitter/distinctivegame<br/>YOUTUBE: youtube.com/distinctivegame", "metacritic": null, "released": "2022-01-19", "tba": false, "updated": "2022-03-21T05:59:31", "background_image": "https://media.rawg.io/media/screenshots/431/431861da2bb113212024ed5e6dd23818_UpyZ2zK.jpg", "website": "https://www.distinctivegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Distinctive Games"], "genres": ["Action", "Sports"], "publishers": ["Distinctive Developments"], "esrb_rating": "Teen"}