{"id": 756861, "slug": "mx-bikes-dirt-bike-games", "name": "MX Bikes - Dirt Bike Games", "name_original": "MX Bikes - Dirt Bike Games", "description": "Mx Bikes is a realistic 3d motocross game which includes real physics, extreme stunts and mad skills.<br/><br/><br/>All the power of Motocross in your hands, warm up your engines and get ready for the most realistic, exciting two-wheeled experience ever.<br/><br/>Get your dirt bike, helmet and hop onto your bike and go full throttle on your path to becoming a true Champion.<br/><br/><br/>Your career results will affect game progression, so don't forget to upgrade your bikes and purchase new bikes to defeat the supercross champions.<br/><br/><br/>Everything is so realistic in MX Bikes that it's easy to get confused. The iconic tracks, breathtaking rider suits, stunning helmets and remarkable dirt bikes are waiting for you.<br/>Make your dreams come true, let your imagination run wild on the tracks, choose the terrain type and customize every aspect of your dream bike.<br/><br/> <br/>Mx Bikes lets you explore new landscapes and hone your riding skills.\t\t\t\t<br/> <br/>Live the most authentic and immersive 2-wheels racing experience with new and improved features.\t\t\t\t<br/>Mx Bikes take the fun of 2-wheels racing to a whole new level.\t<br/> <br/>You can feel the real-life acceleration, torque, suspension and the thrill of off-road race.<br/> <br/> <br/>Multiplayer mode in mx bikes is coming soon....\t\t\t\t<br/>You can send us the suggestions and tips for multiplayer mode at contactgiantfish@gmail.com", "metacritic": null, "released": "2022-02-15", "tba": false, "updated": "2022-03-21T06:15:18", "background_image": "https://media.rawg.io/media/screenshots/0c9/0c94de129fa703d03bba52fa9b066e49_UHu7VaR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Giant Fish"], "genres": ["Sports", "Racing"], "publishers": ["Ramzan Arif"], "esrb_rating": "Everyone 10+"}