{"id": 7568, "slug": "fear-the-walking-dead-dead-runtactical-runner", "name": "Fear the Walking Dead: Dead Run–Tactical Runner", "name_original": "Fear the Walking Dead: Dead Run–Tactical Runner", "description": "Fear the Walking Dead: Dead Run Season 2 is now available with brand new levels of this exhilarating tactical runner!<br/><br/>Fear the Walking Dead: Dead Run puts you inside the apocalyptic fall of Los Angeles from AMC’s hit series Fear the Walking Dead. <br/><br/>Fear the Walking Dead: Dead Run Features:<br/><br/>- The official mobile game of AMC’s hit show<br/><br/>- Run for survival – Annihilate enemies and stay alive as long as you can in a world falling apart<br/><br/>- Exciting Episode Levels – 6 special show levels available, with more coming soon. Relive the most horrific events from the TV series and see if you would survive.<br/><br/>- Play as your favorite characters from the show – <br/>Unlock Travis, Nick, Madison, Strand, Daniel, Alicia, Ofelia and Chris. Each has their own strengths and weaknesses and come with their own weapons. Will they survive in your game?<br/><br/>- An arsenal at your fingertips – Over 40 weapons at your disposal. Load up with a powerful arsenal of shotguns, rifles, handguns and more.<br/><br/>- Outlive your friends – Connect to see who makes it the farthest through the city. Run past the lurching bodies of your undead friends!<br/><br/>Download for free now!<br/><br/>NOTE: Fear the Walking Dead: Dead Run does NOT run on iPad 2.", "metacritic": null, "released": "2016-04-10", "tba": false, "updated": "2019-07-30T09:07:27", "background_image": "https://media.rawg.io/media/screenshots/721/7219285b61a2b96b45a12fa235cd7a1c.jpg", "website": "http://getdead.run", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Versus Evil"], "genres": ["Action", "Adventure"], "publishers": ["Versus Evil"], "esrb_rating": null}