{"id": 75683, "slug": "bridge-construction-sim", "name": "Bridge Construction Sim", "name_original": "Bridge Construction Sim", "description": "Put your engineering skills, intuition and smarts to test in this brand new Bridge Construction Simulator. You will need to plan, improvise and – most of all – adapt to the task at hand. Use your resources to construct structures able to hold the weight of different vehicles. <br/><br/>You will design and construct increasingly elaborate bridges across four varied locations. Things may seem easy when you start out in a city, but once you move to the canyon, valley and finally mountains, the size and resilience of your structures will have to increase substantially.<br/><br/>In addition to the normal mode you will be able to select an easy (for an increased budget and more flexibility) or hard one (for an ultimate challenge). If you find yourself in a tight spot, a hint system will help guide you to the solution.<br/><br/>Realistic and detailed graphics make every level come to life and even offer a slight consolation when you fail. Because when your bridge collapses and the car falls down, you can at least be sure it looks spectacular!<br/><br/>Game features:<br/>- Superb physics<br/>- Multiple addictive levels accross four different worlds<br/>- State of the art realistic graphics<br/>- Fantastic, varied and detailed environments<br/>- Spectacular special effects<br/>- Mind bending, challenging puzzles<br/>- Varying difficulty levels for increased challenge or more relaxed gameplay<br/>- Built-in hint system", "metacritic": null, "released": "2016-06-10", "tba": false, "updated": "2019-07-29T20:22:33", "background_image": "https://media.rawg.io/media/screenshots/da0/da00abaddc8ad8d8f188152fbae840ae_UA0g2sW.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aidem Media"], "genres": ["Simulation", "Puzzle"], "publishers": ["Aidem Media"], "esrb_rating": null}