{"id": 756801, "slug": "another-life-life-simulator", "name": "Another Life - Life Simulator", "name_original": "Another Life - Life Simulator", "description": "A simple and addictive life simulator where you can live a different life... Reach new heights and become much more!<br/><br/>SWIPE FOR LOVE<br/>- Swipe right to find the love of your life.<br/>- Have fun going on dates and who knows?  You might even get married.<br/><br/>CAREERS<br/>- Get that dream job, maximize your salary, get PROMOTED and become the CEO!<br/><br/>EXTRAORDINARY PATHS<br/>- Complete achievements in the game to unlock cool and unique paths<br/><br/>LIVE YOUR SCHOOL LIFE<br/>- Enjoy the leisurely pace of school life<br/>- Study your favorite field to prepare for job opportunities<br/><br/>DRIVE YOUR DREAM CAR<br/><br/>BUY YOUR DREAM HOUSE<br/><br/>LIVE YOUR DREAM LIFE<br/><br/>And of course... much, much more coming soon to this life sim<br/><br/>If you have any suggestions, please don't hesitate to leave the feedback either in game, through email, or in the reviews.<br/><br/>Official Email Account:<br/>anotherbyteinc@gmail.com<br/><br/>Official Twitter Account:<br/>https://twitter.com/JustAnotherByte<br/><br/>Icons provided to this lifesim by:<br/>https://icons8.com/<br/><br/>This life simulator game is a game, all events and occurrences are fictional.  Any similarities with existing entities are purely coincidental.  We've developed this fun game for teens and up so that people may play the game of life in a way that is fun and exciting! The simulater can act as a second life in that players can enjoy a simulation or even a microcosm of life.  Since this game is freeplay and will forever be free to play, we've lowered the barrier to entry with this entry to games for teens section! Sink your teeth and stay around for a bit life simulator because it's a very immersive experience!", "metacritic": null, "released": "2020-03-12", "tba": false, "updated": "2022-03-21T05:41:06", "background_image": "https://media.rawg.io/media/screenshots/ede/edef25d28ed8fefb66ec2ad9c4efe0e7_JbnzjZi.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AnotherByte"], "genres": ["RPG", "Simulation"], "publishers": ["AnotherByte"], "esrb_rating": "Teen"}