{"id": 756958, "slug": "border-wars-army-games", "name": "Border Wars: Army Games", "name_original": "Border Wars: Army Games", "description": "Commander, you are needed to take control of your soldiers in the new army games. You are able to command troops ranging from pistol wielding units to snipers, tanks, machinegun jeeps and artillery. Inspired from some of the best military games on mobile which will challenge your skills in battle simulator.<br/><br/>Players of battle simulator and military games will love the trench warfare like style of each mission with warpips like strategy games.  You can deploy your troops like trench battles but also manage money like classic RTS games. The gameplay is styled to play like ww2 and ww3 strategy games with trench warfare like mechanics.<br/><br/>Fight on the borders of your country in a battle simulator of infantry units. Or command missions in the forests and fields of your country with trench defense. You must protect your home from the enemy in battles that take place in the harsh weather of the desert and finally you must command your troops in tank games where large tank battles take place in the city.<br/><br/>The goal of each mission in the military games is to destroy the enemy base or survive until reinforcements arrive. To win you will need to manage your money carefully and perform strategic advancement to win all the campaign missions. Mini warriors can be called to the battlefield by pressing their button from the soldier panel. Money is earned by killing enemy soldiers. Make careful use of tanks and artillery to win the battlefield. At the end you will have to fight the enemy general and defeat him by destroying the boss tank.<br/><br/>A lot of work and effort was put in developing this project so that it can be enjoyed and played like classic ww2 games and modern ww3 games combined. The gameplay of both these military games combined makes this a fun and one of the more challenging campaign games. I hope you will enjoy playing this and if you do please leave feedback here as it encourages me to add even more campaign missions to the game.", "metacritic": null, "released": "2022-02-16", "tba": false, "updated": "2022-03-21T07:07:37", "background_image": "https://media.rawg.io/media/screenshots/93b/93bb897068419322c606b299c8c7b4ac_vlAi9bn.jpg", "website": "https://zalmay.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Faraz Ahmad Khan"], "genres": ["Strategy", "Simulation"], "publishers": ["Faraz Ahmad Khan"], "esrb_rating": "Everyone 10+"}