{"id": 756954, "slug": "twerk-race-3d-fun-run-game", "name": "Twerk Race 3D — Fun Run Game", "name_original": "Twerk Race 3D — Fun Run Game", "description": "Twerking is a lot of fun. And a running game with twerking is even more fun! Meet Twerk Race 3D—an exciting runner featuring a fun race where your goal is to grow your body to become a twerking legend! Run, overcome various obstacles, and fight for the title of the best twerk dancer in history in this super exciting runner. <br/><br/>FUN BODY RACE <br/><br/>On your marks. Ready. Get set. Go! The fun race has begun! Run through the challenging obstacle course and pick up food to transform your body. In this running game, you can go from fat to fit in the blink of an eye. Collect healthy foods and your body will become fit. Pick up fast food and it will get bigger right before your eyes. Your goal is to finish the run with the biggest body imaginable. <br/><br/>CRAZY OBSTACLES<br/><br/>Watch out though: to get to the end, collecting hamburgers only won’t be enough—it takes a little strategy too! The race is packed with crazy obstacles: fragile glass platforms, barriers with different size holes, slides, and more. Sometimes your big body can be your weakness. Learn when to burn calories and go from fat to fit. Prove you have the brains to match your big muscles!<br/><br/>EPIC TWERKING BATTLE<br/><br/>A fun race isn't all this running game is about—there’s a twerking battle waiting for you when you get to the finish line. Each level ends with a grand finale—an exciting battle that will put your twerking skills to the test. Save all your strength for the mighty bump and bounce the opponent off the dance ring. Only the strongest and biggest body has a chance of winning the final shake-off! <br/><br/>Ready for the challenge? You have nothing to lose … except maybe a couple of pounds. Join the fun run, pick up different food, overcome all obstacles, and get prepared to win the final battle. <br/><br/>BEST FEATURES<br/><br/>● A one-of-a-kind running game! It’s a runner with a twerk battle at the end. There’s nothing like it!<br/><br/>● An exciting final battle! Make your body big and strong and crush your opponent with your thick muscles! <br/><br/>● Real dynamic tension! A fast and fun race with an endless variety of obstacles to blast your way through. Watch your body change as you tackle every hurdle!<br/><br/>● A new fun run—a fresh and cute look. There are plenty of opportunities to beautify your character. Choose the best outfit to accentuate your nice muscles!<br/><br/>A body race has never been this much fun! Join Twerk Race 3D to revel in an endlessly entertaining 3D runner that’s guaranteed to dispel your boredom and get you dancing all day!", "metacritic": null, "released": "2022-02-01", "tba": false, "updated": "2022-03-21T07:05:06", "background_image": "https://media.rawg.io/media/screenshots/b62/b625604b7d8ba88def18d8a7d1c50fa9_0HaOI0g.jpg", "website": "https://tap2play.me/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tap2Play"], "genres": ["Action", "Casual"], "publishers": ["Tap2Play"], "esrb_rating": "Everyone 10+"}