{"id": 756973, "slug": "rpg-dice-heroes-of-whitestone", "name": "RPG Dice: Heroes of Whitestone", "name_original": "RPG Dice: Heroes of Whitestone", "description": "The people of Whitestone are under attack! Use strategy to lead heroes into battles against orcs, elves &amp; goblins! Will you bring peace back to Whitestone - and the world? Put strategy and tactics to the ultimate test in this RPG board game! <br/><br/>RPG Dice: Heroes of Whitestone takes you on an adventure through an epic strategy board game. Summon and level up action fantasy heroes, collect gear, and save Whitestone from evil. Roll the dice to embark on a story-filled action fantasy adventure. Build a team of legendary heroes and face off in exciting boss battles tactical tabletop style.<br/><br/>After 500 years of peace, Whitestone is under attack and needs your help! Create an unbeatable team in weekly challenges and events. Play PvP against opponents to climb the leaderboards. Join a guild with your friends and compete in boss battles! Collect and level up fantasy hero classes such as paladins, wizards, and rogues! <br/><br/>Classic RPG battles against ferocious enemies! Defeat saurians, dwarves, beasts and complete quests to gain epic rewards! The game board changes as you discover its mysteries and secret paths. Roll battle dice to power up your hero’s attacks and defeat enemies. Collect different gear and level them up in this dice RPG!<br/><br/>Take on quests to level up your heroes’ stats, equipment and dice in an action RPG where true champions reign victorious! Assemble a team of legendary heroes, win loot and powerful gear, and roll forged battle dice.<br/><br/>Role playing games with action fantasy levels that let you battle through story campaigns. This  board game fantasy RPG has it all: boss battles, quests and campaigns, relic adventures, dungeon crawls, hero gauntlet battles, guilds, and PvP. Tabletop RPG board game adventure awaits!<br/><br/>Roll the dice and embark on a story-filled combat adventure today!<br/><br/>FEATURES<br/><br/>PvP, Guilds, Leaderboards &amp; More<br/>- PvP battles: Select &amp; level up legendary heroes to fight against other players in PvP Arenas<br/>- Battle against the ferocious Swine Chief Guild Boss &amp; collaborate with guildmates to raid &amp; fight formidable enemies in the Ziggurat<br/>- Hero RPG for champions! Dominate the leaderboards &amp; claim amazing rewards<br/>- Battle heroes unite! Advance through the ranks in PvP Arena leaderboards &amp; guild events<br/>- Bonus attempts for various dungeons allow you to perfect your adventure<br/><br/>Summon &amp; Level Up Heroes<br/>- Assemble a team of legends &amp; embark on a story-filled adventure<br/>- Summon heroes using Summoning Scrolls<br/>- Embark on story quests to gain extra gear and items<br/>- Level up heroes’ stats including health, shields, attack, defense &amp; accuracy<br/>- Battle your heroes &amp; amass great strength in this fantasy role playing adventure<br/><br/>Battle Enemies &amp; Complete Quests<br/>- Create your guild of heroes and battle magic foes to gain rewards &amp; recruit allies<br/>- Roll battle dice to destroy opponents<br/>- Use RPG strategies to determine the destiny of Whitestone<br/><br/>Tabletop RPG &amp; Board Game Mechanics<br/>- Adventure across the game board with every turn in this fantasy dice game<br/>- Battle through a fantasy world with a unique twist on role playing games<br/>- Strategy &amp; tactics (and a little luck!) are needed to crush your foes<br/>- Board game RPG: upgrade battle dice to craft powerful attacks &amp; create the perfect roll<br/><br/>Download today and embark on an epic quest to determine Whitestone’s fate!<br/>-<br/>RPG Dice: Heroes of Whitestone is completely free to install and play; however, some game items can be purchased for real money.<br/><br/>SUPPORT<br/>If you need help with the game, please contact us: support@wimogames.com<br/><br/>CONNECT WITH US<br/>Discord: https://discord.gg/aGNgfmzfW8<br/>Facebook: https://www.facebook.com/RPGDiceGame<br/>Twitter: https://twitter.com/RPGDiceGame <br/><br/>Privacy Policy: https://wimogames.com/privacy-policy <br/>Terms of Service: https://wimogames.com/terms-of-service", "metacritic": null, "released": "2022-01-18", "tba": false, "updated": "2022-03-21T07:15:43", "background_image": "https://media.rawg.io/media/screenshots/fda/fdab639462febb694c66f458e2ec7c00_HqNyevb.jpg", "website": "https://wimogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WIMO Games"], "genres": ["RPG", "Strategy"], "publishers": ["WIMO Games"], "esrb_rating": "Teen"}