{"id": 756950, "slug": "dark-nemesis-infinite-quest", "name": "Dark Nemesis: Infinite Quest", "name_original": "Dark Nemesis: Infinite Quest", "description": "Hack the evil, slash the dark! Dark Nemesis guarantees a fabulous MMORPG combat experience! Slash your way through a multi-dimensional world where good and evil collide!<br/> <br/>A 3D Journey Through the Multiverse <br/>-Enjoy the immersive dark fantasy world with stunning graphics, epic 3D effects, and exquisite characters! <br/>-Unlock and indulge in mysterious parallel worlds. <br/><br/>Breathtaking, Action-packed Boss Fights <br/>-Fight legendary dark bosses and become the strongest Peacekeeper. <br/>-Play as 4 unique classes with special skills and indulge in fast-paced action battles. <br/><br/>Real-time Massive PVP Battles <br/>-Large scale and real time war is rampant. Join time-limited Battle Royale with hundreds of players. Fight until you're the last one standing! <br/><br/>Team Up! Defend Your Guild <br/>-Team up in the core gameplay PVP Battleground! Build the strongest team to achieve the highest glory. <br/>-Grow with your guild through daily missions and time-limited Treasure Dungeon! Embark on adventures together to get abundant resources. <br/><br/>Level Up Your Spirit, Wings, and Companions <br/>-Boost your BP with hundreds of Spirit, Wings, and Companions. Be the center of attention!<br/>-Unlock more weapons and skills to customize your character. <br/><br/>Social Media <br/>Follow us on our Social Media for the latest news &amp; updates! <br/>Facebook: https://www.facebook.com/DNInfiniteQuest/", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-21T07:02:54", "background_image": "https://media.rawg.io/media/screenshots/c2e/c2e20606127f39de5eff798dcb87aede_rjNNOnM.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nuverse"], "genres": ["Action", "RPG"], "publishers": ["Nuverse"], "esrb_rating": "Teen"}