{"id": 757015, "slug": "ambulance-race-rescue-adventure-sim-3d", "name": "Ambulance Race & Rescue Adventure Sim 3D", "name_original": "Ambulance Race & Rescue Adventure Sim 3D", "description": "Drive your favorite ambulance and awesome custom emergency vehicles in an open 3D city!  Speed to the hospital, help rescue patients, and become a little doctor! Race your ambulance, hit jumps at the stunt track, or take it through a bubbling car wash!<br/><br/>Download the Ambulance Adventure Race &amp; Rescue today!<br/><br/>Game Features<br/><br/>+ AMBULANCE SIMULATOR - Super fun ambulance game in an activity filled 3D city! Drive different vehicles on different missions and activities!<br/><br/>+ RESCUE YOUR PATIENTS – Diagnose illness with stethoscope, thermometer, and EKG.   Scan with x-rays, and pick just the right treatments!<br/><br/>+ STUNTS AND RACES – Drive to the stadium for awesome monster stunts or race opponents on the track for record times!<br/><br/>+ LOTS OF VEHICLE AND COLOR COMBINATIONS – Try out colors on your favorite emergency vehicle.   Unlock new faster and more powerful vehicles by completing objectives!<br/><br/>+ DESIGNED FOR ALL AGES - Easy, clear button controls for little fingers with helpful hints and guidance!<br/><br/>+ CODED VELOCITY PROMISE - Our paid games always give the full game with NO ads and NO additional purchases!<br/><br/>Download Ambulance Adventure Race &amp; Rescue to experience the exciting life of an ambulance driver!<br/><br/>If you liked our ambulance sim then you will love our other kids games! Download our Construction Build &amp; Play, our Dolphin Swim &amp; Play, or blast aliens in Alien Annihilator!<br/><br/>Follow us on Facebook for more super fun kids games!<br/>facebook.com/codedvelocity<br/><br/>Follow us on Twitter too! We would love to hear your feedback and suggestions!<br/>twitter.com/codedvelocity", "metacritic": null, "released": "2015-04-03", "tba": false, "updated": "2022-03-21T07:39:46", "background_image": "https://media.rawg.io/media/screenshots/f6d/f6d7144b53afc6d5831457d3c32fb4a6.jpg", "website": "http://codedvelocity.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Coded Velocity"], "genres": ["Simulation", "Racing"], "publishers": ["Coded Velocity"], "esrb_rating": "Everyone 10+"}