{"id": 757017, "slug": "aerofly-fs-2022", "name": "Aerofly FS 2022", "name_original": "Aerofly FS 2022", "description": "Here is the latest installment of our popular flight simulator Aerofly FS, with more features, aircraft, regions and improvements than ever before. Now explore Europe with over 700 airports. There will always be something new to find in this large region. Do you have what it takes to land a Boeing 777 at an international airport or safely land a helicopter on a small platform? Try it out! <br/><br/>Whether you are a beginner or an experienced pilot, Aerofly FS has you covered.<br/><br/>FEATURES<br/><br/>- 26 aircraft: Boeing 777, Boeing 787, Airbus A320, Airbus A380, CRJ-900, EC-135 helicopter, Robinson R22 helicopter, F-18, Dash-8 Q400, Learjet 45, C172, Baron 58, ASG 29, Pitts S-2B biplane, B737-500, B747-400, F-15E, Ju 52, King Air C90 GTx, Aermacchi MB-339, Corsair F4U, Extra 330, Bücker Jungmeister Bü 133, Swift S1, P-38 Lightning and Sopwith Camel<br/>- Over 700 airports from all over Europe<br/>- Switchable information and flight tracks for computer generated traffic<br/>- Flight support with switchable co-pilot<br/>- Highly detailed, animated and operable 3D cockpits<br/>- Illuminated cockpit at night<br/>- Automatic navigation settings ( ILS, NDB and VOR )<br/>- Realistic flight physics<br/>- Highly sophisticated autopilot<br/>- Flight routes time jumps<br/>- Career mode and detailed statistics about your flying career<br/>- High resolution aerial photos<br/>- Show you terrain features like mountains, lakes and cities for easy navigation<br/>- Adjustable time of day<br/>- Landing lights and airport lighting<br/>- Configurable clouds<br/>- Adjustable wind speed, thermals and turbulence<br/>- Playback system<br/>- Various view modes", "metacritic": null, "released": "2021-12-11", "tba": false, "updated": "2022-03-21T07:41:06", "background_image": "https://media.rawg.io/media/screenshots/bab/baba469e7a0eb9b99749593282d08aba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IPACS"], "genres": ["Simulation", "Racing"], "publishers": ["IPACS"], "esrb_rating": "Everyone 10+"}