{"id": 757188, "slug": "wip-mari-xue", "name": "[WIP] Mari, Xue!", "name_original": "[WIP] Mari, Xue!", "description": "<p>This is a VN, that is not done yet, made for Wholesome Games Jam of 2022! About community, chaotic siblings, hustle culture, and mindful communication.  Plan to implement more the next day!</p>\n<p>This kinetic visual novel surrounds the story of Xue, whose parents are away and got caught up in work due to the pressure they and their past weighed upon themselves. To make amends with those feelings, they try to prove how much they could progress within society in such hustles. But is demanding more really the right way? Or accepting it, and reconciling with the past could do much more good? And how does one reunite with the community they isolated themself from?</p>\n<p><strong>┊ ┊ ┊ ˚✧</strong><br/></p>\n<p>Thank you for playing and checking this out, below are the credits!</p>\n<ul><li>Art, story-and-characters-made-on-the-fly, code by: Anonymocha! It's me :&gt;</li><li>GUI, wonderful interface coding, and the character owner of Seii: Seiiccubusherself</li><li>Pretty and adorable music from http://amachamusic.chagasi.com/</li><li>Super helpful Auto Highlight tool! And shoutout to Nanoff + Tofurocks for the textbox accessibility and layeredimage learning tools.</li><li>The classic. \"Gymnopédie No. 1,  Crinoline Dreams, Lobby Time, Airport Lounge\"  Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 4.0 License\r\nhttp://creativecommons.org/licenses/by/4.0/</li><li>And thank you for making our day by checking this out!</li></ul>\n<p>Psst! Here are some extra notes by Mocha for extra content just in case you finished our lil thing! Or check it early for my dumb ramblings.</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T08:30:17", "background_image": "https://media.rawg.io/media/screenshots/ff4/ff4fdd796057359c63500693625ab2a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Anonymocha"], "genres": [], "publishers": [], "esrb_rating": null}