{"id": 757199, "slug": "gunk-night", "name": "Gunk Night", "name_original": "Gunk Night", "description": "<p>Hello! This is our teams submission for the GXC #NoticeMe 2 week game jam with the theme \"Then the Night Changed Everything\"! Leave a rating and check out the gxc version at https://gxc.gg/games/zoybnh/Gunk-Night/</p>\n<p>Gunk Night is a fast paced and satisfying platformer with 2 distinct phases. At night you transform into a raccoon with an urge to roll and spread gunk to every nook and cranny of the level. Use the roll ability to break objects and displace larger items around the level to rack up bonus points. During the day, you run a raccoon cleanup service (Raccoon Maiden, LLC) and only feel a little guilty about it. Using a wetvac to cleanup the mess, vacuum up and down the walls and ceiling, sucking up everything along the way. Also use the vacuum to carry displaced items to their original positions.</p>\r\nThe Team\r\n<p>Patrick Hill (code, art, sound)<br/>https://twitter.com/CilethDev</p>\n<p>Sam Bragg (art)<br/>https://twitter.com/SwordnStallion</p>\n<p>Aron Hommas (code, shader wizard)<br/>https://alphazeba.itch.io/</p>\n<p>Tristan Deniet (music, sound)<br/>https://www.instagram.com/tristan_deniet</p>\n<br/>\n<strong>Controls</strong>\n<p><strong>Keyboard<br/></strong>Movement: Arrow Keys (press down while standing on pass through platforms to drop down)<br/>Jump: [ Z ]<br/>Roll / Vacuum: [ X ]</p>\n<p><strong>Gamepad </strong>(currently tested with xbox)<br/>Movement: Left stick<br/>Jump: ( A )<br/>Roll / Vacuum: ( B )</p>\n<strong>Story</strong>\n<p>While cleaning out a shed on the job (maid), Bellamy had a run in with a rabid and particularly filthy raccoon. Rolling out from a trash bin, the raccoon leaped out and attacked. Bellamy took a good scratch and was granted a bit of a mess...</p>\n<p>Feeling ill after the encounter, that night she went to bed early and had a vivid nightmare reliving the experience...but when she awoke in the middle of the night, she had become a raccoon with an urge to roll, spread gunk, and destroy! A colossal rampage ensued, leaving filth in every corner of the house.</p>\n<p>After the experience of destroying her own home, Bellamy came to her senses. That day she spent a long time cleaning up the mess, vacuuming up and down the walls, restoring items, and vacuuming up broken bits. After that experience, she had an epiphany...If she's going to turn into a raccoon rolling and destroying beyond her control...she may as well target her business specifically for Raccoon Cleanup ;)</p>\n\n<p><strong>Bug fix / Change log<br/></strong>- Addressed some performance issues in cleaning phase<br/>- Optimized clean % calculations. Game should run consistently smooth now!<br/>- Added ability to skip cutscenes (any speed runners out there?<br/>- Fixed bug with vacuum sound playing when audio turned off in settings<br/>- Updating draw depth on displaceable items so they are easier to spot<br/>- Added helper visual to better indicate requirements for cleaning completeness</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T08:32:33", "background_image": "https://media.rawg.io/media/screenshots/6d6/6d642e31b9bc1ed6723de6a5f97552fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cileth"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}