{"id": 75728, "slug": "save-granny-happy-wheels-2", "name": "Save Granny Happy Wheels 2", "name_original": "Save Granny Happy Wheels 2", "description": "We would love to welcome you to our Save Granny Happy Wheels 2 simulation game. Competitive Leader-board to compete your friends best Score! <br/><br/>Take to the streets with ANGRY Granny! <br/><br/> GAME MODES:<br/><br/>Traffic Time Mode<br/>Traffic Rider Mode in Highway<br/>Time Trial Mode<br/>Free Ride Mode<br/><br/>Different Environments:<br/><br/>- Desert <br/>- Jungle<br/>- Snow<br/><br/><br/>Our Granny has been locked away in the hospital by some mental doctors, she's plotting her escape with her grandson, and she needs YOU to handle her Wheel chair and guide her through the streets once she's busted out! She saw the fence: jump it! <br/><br/>Now she's rolling out, and she needs your help to roll out and jump it through the streets. It's a simple, classic running game where the goal is to be the best speed runner you can while dodging different cars, trucks, bikes, trains, hurdles. Can you make granny the ultimate speed runner? In this brilliant new running game YOU must help her run around tons of wacky objects and avoid traffic that are trying to ruin her crazy life of fun<br/><br/>Save Granny Happy Wheels 2 is one of the best new generation running games. Let’s take you on another journey in angry granny running games that gives you the enjoyment of riding a real wheel chair. Full of killer tricks, awesome freestyle action and insane stunts. Little confuse here, Save Granny Happy Wheels 2? If so, she could take the easiest way or hardest way, the Mountain snowy track, city track and Bridge track . At the Mountain snowy track there will be some off-road driving with quite a few hard jumps on the way. In order to complete the track she´d better have a rally happy vehicle like wheel chair…Get through the futuristic Granny running in this addictive top game. If you love scary granny, grandmother, grandpa fun games, funny games, futuristic games, survival games, saviour games and endless traffic running games you will love this! <br/><br/>You know, you will love it in the first time you see it. Drive Angry Granny Happy wheels wheelchair to rush on the roads in rush hours! You will enjoy an unbelievable speed feeling. If you are thinking about a endless running mobile game then this is exactly what you need. Use all your Ninja, Maui Thai, Boxing, futuristic robot and other fighter skills, running skills &amp; racing skills.<br/><br/>Let’s take you on another journey in futuristic running games that gives you the enjoyment of riding a real wheelchair. If you love racing games, cycle game, bicycle games, Futuristic robot games, death racing games, furious racing, police car racing and traffic racing games then you’ll love this Save Granny Happy Wheels 2 game.<br/><br/>Save Granny Happy Wheels 2 will be updated according to your suggestions.<br/><br/>Download for Free and Enjoy!", "metacritic": null, "released": "2018-08-19", "tba": false, "updated": "2019-10-22T14:23:51", "background_image": "https://media.rawg.io/media/screenshots/6db/6db9bf0ec239b16079c34c9a56659b06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": ["Simulation", "Racing"], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}