{"id": 757285, "slug": "past-lives-the-case-of-bletchley-manor", "name": "Past Lives: The Case of Bletchley Manor", "name_original": "Past Lives: The Case of Bletchley Manor", "description": "<p>\"Caught in a strange house that I cannot seem to leave, in my madness, I swear I can see previous lives of my own wandering around with me, trying to find an escape. Each one beckons a different clue as to the way out. Is there such a place? It seems I've been here forever, and nature has too: trees grow and rivers flow here. And an ever-present moon showers the space with light. Every wonder it seems has a secret to share…\"</p>\n<p>//</p>\n<p>You find yourself in an internal space full of staircases and platforms. But there seems to be no way out. Three different rooms interconnect by floating balconies. But some can only be accessed in another life...  Along the way in the different rooms, you notice three wonders you can interact with. Each puzzle leads to a key but you will need to rely on your past life to make your way out...</p>\n<p>//</p>\n<p>N.B. There are meant to be banisters surrounding the paths around the level, but I didn't leave enough time to add them all in ;P</p>\n<p>//</p>\n<p>This game was created for GJL Game Parade Summer 2022. Created in the space of a week, the theme for this game jam was \"Every Life Counts\".\r\n</p>\n<p>The creators of this game all met in one way or the other through the University of Edinburgh, with two of the team having a background in music composition &amp; sound design. \r\n</p>\n<p>Duncan Gallagher - Coder; Game designer; Sound Design</p>\n<p>Rossano Cariello - Music</p>\n<p>Jem Gursoy  - 3D Models<br/></p>\n<p>//</p>\n<p>Third-party Assets Used: Unity Standard Assets, Object Placement Script, Moon Model, Wood Texture, Grass Texture, Waterfall Particle System</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T08:52:18", "background_image": "https://media.rawg.io/media/screenshots/98b/98bfb1034d102599fb272ba4072c6ecf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Rdawg7", "Duncan Gallagher"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}