{"id": 757343, "slug": "gold-trigger", "name": "Gold Trigger", "name_original": "Gold Trigger", "description": "<p>Howdy there, pardners! Welcome to GOLD TRIGGER!</p>\n<p>All you gon' needs to play this here game is the space bar on yer keyboard and a USB mouse or trackpad!</p>\n<p>You start the game on top of the swirly wirly BANK icon in the middle o' the play field. Direct that chunky METAL DETECTOR a'yours 'round the field with a good ol' fashioned LEFT CLICK, and it'll go wherever you point it! Wherever it goes, it leaves a lil' DUST TRAIL behind so you know just where you've been. You can try a rapid DOUBLE left click to move faster for a bit, but there won't be NO TRAIL left behind if ya do.</p>\n<p>Yer metal detector's LITTLE RED LIGHT will start to go off when there's GOLD nearby, see? Once you unearth that gold by bumpin' into it, that one piece o' gold will be added to your inventory. If you decide to go back to the bank, all the gold in yer inventory in that moment will be added and saved to yer overall tally.</p>\n<p>Every time you return to the bank to cash in, all those dust trails will be wiped away, but there'll also be new nuggets o' gold to find in totally random locations! BE CAREFUL THOUGH, there'll also be less and less o' that gold spread out around the field, so if ya do cash in, cash in big time!</p>\n<p>There's a catch: if the little red light gets blinking REEEAAAL fast, that means there's a mine under ya! You never know where they could be! If this happens, DO NOT CLICK anywhere else whatever ya do, 'else it's gon' blow up and take all the gold in yer inventory away before you can cash it all in at the bank! The worst thing that could happen is if your metal detector travels and comes to a complete stop right on top of a land mine! There ain't no way to know where a mine is until you step right on top o' one and once you do, you'll really be between a rock and a hard place!</p>\n<p>Them metal detectors don't come cheap, so you only have a few spare to play around with. Once they all get blown up, that bank tally will be yer final score and y'all gotta call it quits now, ya hear? If you want though, you can tap the SPACE BAR at any time to trade some gold nuggets in that bank for an EXTRA metal detector, brand spankin' new and hot off the shelves! But don't get greedy now though, cuz a lower bank tally means a lower end game score and each time you buy a new one, the value goes up by 3 nuggets!</p>\n<p>That's economics for ya!</p>\n<p>Each o' them metal detectors also only got a limited amount of juice to use up before the little red light stops workin'. When it does, you can't unearth no more gold nuggets and you'll have no choice but to return to the bank so you can recharge it. If you ain't found no gold nuggets to cash in by then, sorry! Them's the breaks!</p>\n<p>BE REEEAAAL CAREFUL when you're goin' around with no juice because now, them land mines can explode right on contact and that little light won't be there to warn you!</p>\n<p>This is where them dust trails should come in handy, so just follow the trail back to the bank as best you can and you'll be right as rain to hunt for gold once again!</p>\n<p>If you ever start to feel the pressure settin' in, you can always pause your game and take an outhouse break at any time with that there RIGHT CLICK.</p>\n<p>Well, that's GOLD TRIGGER for ya! Give her a whirl and have fun, but don't get blown up now! YEEEE-HAAAW!</p>\n<p>(All audio used for Gold Trigger exists in the public domain, all 2D vector art and 3D models were created by me using Autodesk Graphic for iPad and Blender 3D respectively, fonts used in-game are free for personal use)</p>\n<p>NOTE FOR HEADPHONE USERS: There seems to be an audio bug that I can't address yet wherein the player returning to the main menu after getting a game over will experience the main menu music at twice the volume it was when they first booted up the game.</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T09:10:34", "background_image": "https://media.rawg.io/media/screenshots/07e/07e5d58e66d8dd0ff70d8b9b6247e3bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Bonsai Treehouse"], "genres": ["Action"], "publishers": [], "esrb_rating": null}