{"id": 757358, "slug": "combine-and-slide-godot-wild-jam-43", "name": "Combine and Slide - Godot Wild Jam (#43)", "name_original": "Combine and Slide - Godot Wild Jam (#43)", "description": "<p>This is my entry into the Godot Wild Jam (#43). My first ever game jam! Thank you to the Godot Wild Jam team for hosting this jam, it was a lot of fun!<br/></p>\n<p>In this puzzle game, you must connect the various blocks into the required shapes. Blocks will automatically connect when they are beside each other, and your shapes must fit the goal shapes perfectly!</p>\n<p>I wanted to keep things very simple, so I could give myself the best chance of actually finishing a project. That being said... Making puzzle levels is harder than I was expecting! But, I'm happy with how it turned out.  Some levels are really easy, some are pretty hard, some are just for fun. The difficulty isn't as linear as I would want it to be, but I'm not good at making puzzles, so... :)</p>\n\n<p>Note to judges:</p>\n<p>First of all... Thank you! Full access to the repository is available if desired (you can message me for access on your Discord server: brentcrane#3537), which details the commits and progress made along the way. Game was entirely made from scratch by me, assets included, all during the timeframe of the game jam (with one exception: the \"pop\" sound made when pieces connect - I made that for a different project of mine &lt;3).</p>\n<p>There are a few things I wish I could have added (such as a \"play next level\" button, and music), but I think it's in a \"good enough\" state for my first jam. I learned a LOT in the process of making this, and actually finishing and publishing something feels fantastic. Thanks for playing!</p>\n\n<p>Software used:\r\n</p>\n<ul><li>Godot\r\n</li><li>Inkscape\r\n</li><li>Aseprite</li></ul>\n\n<p>Theme:</p>\n<p>\"Combine\"\r\n</p>\n\n<p>Wildcard Used (sort of):</p>\n<p>The More The Merrier: Control more than one character</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T09:13:18", "background_image": "https://media.rawg.io/media/screenshots/159/15998fd555468b4ac5c7a9dbd1c1d152.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["brentcrane"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}