{"id": 757417, "slug": "philologus-a-la-quete-du-langage-perdu", "name": "Philologus: A la quête du langage perdu", "name_original": "Philologus: A la quête du langage perdu", "description": "<p><strong>Vivez des moments de l’histoire mérovingienne</strong></p>\n<p>Les sources historiques veulent que la longue chevelure du premier roi Clovis était à la source de son charisme et de son autorité, mais la  légende rapporte que c’est la couronne d’or, placée sur sa tête par l’évêque Rémi qui assura l’intégrité du jeune royaume de Francia. Mais cette couronne a disparu…\r\n</p>\n<p><strong>Portez le chapeau du philologue </strong>♕\r\n</p>\n<p>Sur les traces du trésor, vous détenez les manuscrits qui pourront révéler l’histoire de la couronne et de sa disparition, mais il reste un obstacle: un curieux fragment de texte composé au VIIe siècle, non pas dans un latin classique, mais transcrite dans le gallo-roman vulgaire  de l’époque. Découvrez les voies de l’évolution phonétique et l’arsenal de la linguistique diachronique.\r\n</p>\n<p><strong>Traduire le passé ! Saisir le présent !</strong> Rentrez dans le monde mérovingien pour vivre leur langage, faire accroître votre lexique et donner sens à ce fragment qui révèlera peut-être enfin le sort de ce magnifique trésor ? Sortez votre dictionnaire, votre pelle et votre intuition — vous dénicherez ce lointain ancêtre mérovingien de la langue française.\r\n</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T09:28:28", "background_image": "https://media.rawg.io/media/screenshots/590/59089464522bfa23c96892b616632508.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Marsheleene", "Cortex", "MrFabi04", "Hache1n1", "Oons", "faeriemoonlight"], "genres": ["Adventure", "Educational", "Puzzle"], "publishers": [], "esrb_rating": null}