{"id": 757439, "slug": "project-demigod", "name": "Project Demigod", "name_original": "Project Demigod", "description": "<p><strong>(In the Player Menu, please do not switch the menu type, leave it on \"Floating\" for now as there is an issue when switching he menu type where the laser pointer disappears.)<br/><br/>Project Demigod</strong><strong> </strong>is a Physics-Based, Superpower, Combat-Heavy, VR Game!<br/><br/>Become the <strong>Hero</strong> of your dreams, as you combine multiple fantastic superpowers in unique ways and take on Ninjas, Robots, Agents, and more!<br/></p>\n<ul><li>Fight, fly, swing, shoot, and smash your way through physics-based ragdoll enemies!<br/>\n</li><li>Physical weapons with full stabbing physics!<br/>\n</li><li>Collect new abilities, weapons, and items to develop your own personal combat style!<br/>\n</li><li>Switch power sets on the fly to create an infinite number of unique combos!<br/>\n</li><li>Grab an enemy Robot, throw it into the air, jet boost after him, and then punch him through a wall, before grappling him back to you for another round!<br/>\n</li><li>Destructible Objects! Use the environment to smash your enemies through walls, floors, and a ton of breakable items.<br/>\n</li><li>Future updates will include additional powers, enemies, levels, challenges, storylines, events, and more!\r\n</li></ul>\n\n<p><em>(Project Demigod is currently in Early Access, and will continue to receive constant updates.)</em></p>\n<p><strong>Quest 1 users, please note</strong>: Project Demigod was developed for PCVR, and then optimized and ported for Quest 1 and Quest 2. While the game does run on Quest 1, there may be times when the framerate drops.</p>\n<p>Discord: https://discord.gg/BydvBWVaEe\r\n</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T09:33:12", "background_image": "https://media.rawg.io/media/screenshots/2c5/2c5858cc6aea1087eff5bbdf8bfb0f94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["OmnifariousStudios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}