{"id": 75748, "slug": "helicopter-rc-simulator-3d", "name": "Helicopter RC Simulator 3D", "name_original": "Helicopter RC Simulator 3D", "description": "RC Helicopter game, Helicopter RC Simulator 3D is the latest Helicopter flight simulator game where you get to fly a collection of amazing radio-controlled helicopters in the house and outside in the back yard!<br/>Complete all 36 unique helicopter flying levels to become the best RC Helicopter pilot!<br/><br/>***This is the full version of HELIDROID 3***<br/><br/>!ALL 36 RC HELICOPTER LEVELS UNLOCKED, FLY AROUND FREELY IN SANDBOX MODE!<br/><br/>Helicopter RC Simulator 3D is the latest 3D radio-controlled helicopter simulation game, available now !<br/><br/>Fully equipped with weapons like missiles, machine guns, and loads more gear to perform special tasks throughout the levels in the Helicopter RC Simulator 3D!<br/><br/><br/>FEATURES:<br/>- Put out raging fires to rescue robots<br/>- Scare off pesky birds by shooting missiles at them!<br/>- Use super powerful magnets to pick ups heavy loads<br/>- Wreck anything in you path with a industrial wrecking ball!<br/>- Go head-to-head with other helicopters in flight combat<br/>- Chase and scare the naughty birds that cause trouble in the house<br/>- Perform risky and defying stunts, testing your flying skills!<br/><br/>Helicopter RC Simulator 3D is totally free, no \"in-app purchase\" ! All in-game bonuses are unlocked throughout the game, 3 helicopters ready to fly!<br/><br/>Helicopter RC Simulator 3D is a exciting, fun filled helicopter flying simulator game, using the latest game physics engine that let's you interact with the environment and objects in it.<br/><br/><br/>Sounds exciting? If you think so, get ready to play the new RC Helicopter simulation game, Helicopter RC Simulator 3D!", "metacritic": null, "released": "2016-09-12", "tba": false, "updated": "2019-07-29T19:48:29", "background_image": "https://media.rawg.io/media/screenshots/444/4442c7e77f5efced1f4327c844cc9a40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MH Production"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Phouthasone Bouapha"], "esrb_rating": "Everyone 10+"}