{"id": 75749, "slug": "extreme-heavy-trucker-parking-simulator", "name": "Extreme Heavy Trucker Parking Simulator", "name_original": "Extreme Heavy Trucker Parking Simulator", "description": "We hope you don’t suffer from “vertigo”. You’ll need a good head for heights in Extreme Heavy Trucker! Take on loads of intense construction site driving and parking missions in 7 Mega Heavy Duty Trucks. Moving cranes, narrow platforms and tricky surfaces await! <br/><br/>_____________________________<br/>7 MEGA TRUCKS<br/>Take control of Seven massive construction trucks. Prove your driving and parking skills in Diggers, Excavators, Cement Mixer Truck, Dump Truck, Fork-Lift &amp; 4x4 Pickup Truck! Drive carefully, but time is money, so don’t be too slow or you’ll have to find another job!<br/>_____________________________<br/>CRAZY EXTREME MISSIONS<br/>Experience the most extreme parking scenarios ever! Negotiate high platforms and even take a ride on moving cranes to reach the highest heights! You’ll need to take care that you don’t fall but keep your speed up to earn the best medals for your performance. The trucks are strong, but the Site Foreman won’t appreciate you wrecking!<br/>_____________________________<br/>AMAZING ENVIRONEMENT<br/>Stunning detailed map with tons of details, real-time lighting and animated cranes to transport your trucks from place to place – a first for any Parking game! Welcome to the most thrilling Parking game ever!<br/>_____________________________<br/>FREE TO PLAY<br/>The Main Game Mode is 100% FREE to play, all the way through, no strings attached! Extra Game Modes, which alter the rules slightly to make the game easier, are available through optional In-App Purchases. Each mode has separate leaderboards to make for totally fair competition!<br/><br/>_____________________________<br/>GAME FEATURES:<br/>▶ HEAVY: Drive &amp; Park 7 Mega Trucks<br/>▶ EXTREME: Take on the most EXTREME Missions ever devised! Can you survive them all?<br/>▶ REALISTIC: Stunning environment and realistic physics put your pants on the seat!<br/>▶ VERTIGO: Don’t be afraid of heights! It won’t “really” hurt if you fall <br/>▶ 100% Free-2-Play <br/>▶ CONTROL: Buttons, Wheel or Tilt steering controls<br/>▶ IMMERSIVE: Multiple camera views including First Person view  <br/>▶ iCLOUD: Supports play between your iDevices &amp; automatic progress backup with iCloud<br/>▶ OPTIMISED: runs on anything from (or better than) the iPhone 4, iPad 2, iPad Mini &amp; iPod Touch (4th Generation)", "metacritic": null, "released": "2016-04-02", "tba": false, "updated": "2019-07-29T20:05:00", "background_image": "https://media.rawg.io/media/screenshots/9cb/9cb29a8475b1da7ed77f98c2ed441e1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Play With Games"], "genres": ["Sports", "Racing"], "publishers": ["Play With Games"], "esrb_rating": "Everyone 10+"}