{"id": 757532, "slug": "clear-the-dungeon", "name": "Clear The Dungeon", "name_original": "Clear The Dungeon", "description": "<p>Clear the Dungeon is single player strategic card game based on the original card game of the same name by<strong> Mark S. Ball of Riffle Shuffle and Roll.</strong></p>\n<p><strong>INTRODUCTION</strong></p>\n<p>In Clear the Dungeon, you are a monster exterminator hired by the King to rid the royal dungeon of pesky beasts. You have been promised fame and fortune for success, but what if you fail? In the words of the King, “I will give you a terrible review on Yelp. Oh, and you will be executed.”\r\n</p>\n<p>As you tread through the dark dingy dungeon cells, monsters will appear. Beat them down with a powerful attack and wipe them out using their weakness against them. Exterminate the monsters before running out of power and victory will be yours.\r\n</p>\n<p><strong>RULES of PLAY</strong></p>\n<p>Each turn has three phases: draw, attack, &amp; discard.\r\n</p>\n<p><strong>DRAW</strong>\n</p>\n<p>To begin play, draw three cards from the Power Deck. These three cards make up your hand and represent your attack. How you distribute your attack is up to you, but each card will have to be played or discarded before drawing again.\r\n</p>\n<p><strong>ATTACK</strong>\n</p>\n<p>Survey the battlefield and decide how you want to play your cards. Place the cards on the monster that you are attacking.\r\n</p>\n<p>In order to defeat a monster, it must be hit with two cards that in combination are equal to or greater than the monster’s health level. For example, if you are attacking a J of Hearts, your first two attack cards must add up to 11 or more. In order to kill off the monster, your third attack card must be a heart of any value. Once the heart card is played, the monster is killed. It can be cleared away and the next monster in line is flipped over.\r\n</p>\n<p><strong>DISCARD</strong>\n</p>\n<p>If at any point cards in your hand cannot be played, they must be discarded prior to drawing the next three cards. Those attack cards are considered misses and must be discarded to the Miss Pile.\r\n</p>\n<p><strong>JOKERS</strong>\n</p>\n<p>Jokers are worth 10 points, and they may be any suit needed.</p>\n<p><strong>DUNGEON MONSTERS</strong></p>\n<p>Each monster type has a different health level.\r\n</p>\n<p>Jacks = 11 points\r\n</p>\n<p>Queens = 12 points\r\n</p>\n<p>Kings = 13 points\r\n</p>\n<p>In order to defeat a monster, three cards must be used to stage an attack. The first two cards must be equal to or more than the health level of the monster. The third card is the final part of the attack, but not not just any card can be played.\r\n</p>\n<p>Each monster has a weakness that must be exploited in order to finish it off. The monster’s suit is their weakness. When you are staging your attack on the monster, the third card played can be of any value, but it must be the same suit as the monster.</p>\n<p><strong>WINNING</strong>\n</p>\n<p>If you kill all of the monsters before running out of cards in the Power Deck, you win! You will rise from the dungeon a master of beasts, and you will be granted fame and fortune by the King.\r\n</p>\n<p>If you run out of cards before all of the monsters have been dispatched, you lose. You have run out of power and therefore cannot fight. The monsters will most likely tear you apart, eat you for a snack, and pick their teeth with your bones.\r\n</p>\n<p>Good luck!</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T09:54:32", "background_image": "https://media.rawg.io/media/screenshots/ac5/ac5c15d75787918df3fa8884468496ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neon Orbis"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}