{"id": 757584, "slug": "dreadlight", "name": "Dreadlight", "name_original": "Dreadlight", "description": "THIS GAME CONTAINS FLASHING LIGHTS AND LOUD NOISES THAT MAY BE DISORIENTING.\r\nDESCRIPTION\r\n<p><strong><em>Dreadlight</em></strong> is a 1981 action video game developed and released by Team Dreadlight for arcades in North America. The player controls Paula, a witch who must create magic shields to defend herself from enemies coming from four directions.</p>\r\nBACKSTORY\r\n<p>The above excerpt has been taken from the Lost Games Wiki. Though various sightings of <em>Dreadlight</em> have been reported in the past, independent parties have been unable to confirm its existence. The attached file uploaded in 2022 contains what appears to be the files for <em>Dreadlight.</em> However, it is unknown whether it is a recreation or not.</p>\r\nCONTROLS\r\n<ul><li>Use the Arrow Keys, WASD, Left Joystick, or D-Pad to move your shield.</li><li>Press Enter or Start to start the game.</li><li>Press Esc or Select to exit the game.</li><li>Press + and - to control the volume.</li></ul>\r\nTEAM DREADLIGHT\r\n<ul><li>Bryce Sheehan provided promotional and sprite art of many characters in <em>Dreadlight</em> before the attached game was uploaded, confirming his involvement with Team Dreadlight.<br/>\n</li><li>Cameron Kelly composed the music for the attached game. However, when asked about her connections with Team Dreadlight, she did not comment.</li><li>Hudson Samuels claims to be the original developer of <em>Dreadlight</em>, providing source code and images of a PCB board supposedly contained within the original cabinet.</li><li>Rachel Woon claims to have drawn promotional materials for <em>Dreadlight</em>. The truth behind these claims is unknown, but they have been attached here regardless.</li></ul>\n<p><em>Dreadlight was created by Bryce Sheehan, Cameron Kelly, Hudson Samuels, and Rachel Woon (Team Dreadlight) for the SGDA Arcade Jam. Used third-party assets can be seen here.</em></p><p><em>Our game fits the \"combo\" theme by requiring players to keep their combo to keep playing, rewarding/punishing players after blocking/getting hit by a slightly unfair but non-killing enemy, and rewarding risking a combo break by giving extra points for hitting optional enemies.</em><br/></p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T10:10:33", "background_image": "https://media.rawg.io/media/screenshots/6fd/6fdda17c57bb6f5111d556536463048c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RegularSalamander", "Emerald", "MajorMoxy", "ILiekPie"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}