{"id": 757527, "slug": "mournway-mansion", "name": "Mournway Mansion", "name_original": "Mournway Mansion", "description": "<p>Mournway Mansion is a scary first person adventure game with some action elements.</p>\n<p>It is developed in Unity and its world is made out of Voxels. <br/></p>\n\n\n<br/>The Story\r\n<p>You play as Karl, a boy that is - like many children - afraid of the dark. He has his own reasons to stay out of it, though.</p>\n<p>Your journey begins in your own room at home. A new home, where you are supposed to have a fresh start.</p>\n<p>One part of this new life is finding new friends. Getting into a new group of neighbourhood kids at this age can mean that you need to do something weird to get accepted, of course.</p>\n\n<p>When you set out into the dark on this fateful night, you do not know what to expect of it. But you surely do not expect the trip to have that much of an impact.</p>\n<p>When in fact you will not return as the same person. If you will return at all that is...<br/></p>\n<p>Find out what has happened to Karl, that started his fears and help him slowly overcome them to bring light into the darkness.</p>\n<br/>Gameplay\r\n<p>You will explore the abandoned house in first person perspective in search for clues or items that you need to solve puzzles to advance. You will have a classic inventory and will often directly manipulate the items in the environment, e.g. by dragging a drawer or pushing down a door handle.</p>\n<br/>Controls\r\n<p>ESC: Menu (or cancel closeup)<br/>WASD: Move / Rotate closeup<br/>LMB: Interact, skip dialog line<br/>RMB: Examine, cancel dialog<br/>MMB or TAB: Inventory<br/>SHIFT: Run (hit to skip dialog line)<br/>CTRL: Crouch<br/>SPACE: Jump<br/>Q/E: Flip through pages or items in closeup<br/>Mousewheel or PLUS/MINUS: Zoom closeup<br/>P: Save screenshot</p>\n<br/>Features\r\n<ul><li>Scary atmosphere in an abandoned house</li><li>No running or hiding from a monster</li><li>Fights and some riddles appear in the form of arcade minigames</li><li>Classic adventure inventory</li><li>Voxel 3D graphics</li></ul>\n<br/>Credits\r\n<p>The Darkness title theme was composed by Damian Potenzoni.<br/></p>\n<p>The cool pixel fonts used in this game were designed by Eeve Somepx.</p>\n<p>The game is still in development. It started on 15.02.2018.\r\n</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T09:53:36", "background_image": "https://media.rawg.io/media/screenshots/f59/f59834872bb279929cc9534708bc9d8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["ScaniX"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}