{"id": 757563, "slug": "no-stalgia-no-nes-retro-puzzle-maker-test", "name": "No! Stalgia! No! (NES Retro Puzzle Maker Test)", "name_original": "No! Stalgia! No! (NES Retro Puzzle Maker Test)", "description": "<p>Heyya, yet another game for one of Sezza's Twitch stream weekly themes.<br/></p>\n<p>This weeks theme (Feb 8th - 15th, 2022 ) - Nostalgia. Pretty much perfect for this kinda stuff I make haha.</p>\n\n<p><strong>\"Sezza's moving to a Meerkat farm! How exciting! But moving day also happens to be GARBAGE DAY! And the trash dude can't work out what boxes are full of rubbish and which are full of nostalgic goodies for the move...so get rid of them all!\"</strong></p>\n<p><strong>Push The Boxes or Collect The Hearts In Each Stage To Move On</strong>\n</p>\n\n<p><strong><em>Keyboard Controls:</em></strong></p>\n<p><strong><em>                                 Directional Keys  -  DPad</em></strong></p>\n<p><strong><em>                                 Z - A</em></strong></p>\n<p><strong><em>                                 X - B</em></strong></p>\n<p><strong><em>                                 Enter - Start</em></strong></p>\n<p><strong><em>                                 Space - Select</em></strong></p>\n\n<p>I recently came across software to make Nintendo Entertainment System puzzle games called 'Retro Puzzle Maker', and decided to go with something different than a Game Boy game this time. Put these thirty levels together in about an hour or so, and there's a bit of filler in there too so it shouldn't take too long to complete.</p>\n<p>Playable in-browser, using that box at the top of the page, or there's also a downloadable link for the ROM if you'd fancy playing that way. If you're playing using the browser version it'll work a lot better if you click the fullscreen button when the game loads. May not work properly on mobile though unfortunately but if I can suss a workaround for that I'll add it in.</p>\n<p>NES Puzzle Maker's pretty amazing too, especially for game making software that you can use in a browser. Now anyone and everyone can make their own NES game, which is very very rad and dope haha. Feel free to join the Discord if you have any questions too, or just wanna have a look at what people are putting together with the software.</p>\n\n<p>Aaaaanyway, hope you enjoy the game and have a great one.<br/>Peace out and much love &lt;3</p>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T10:05:46", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbfd54416a6c32ea5edb0590a0160c8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android", "Web"], "developers": ["GameBuoyGames - Michael Towns"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}