{"id": 757620, "slug": "zorlok-preview", "name": "Zorlok: Preview", "name_original": "Zorlok: Preview", "description": "This is a preview for the upcoming game Zorlok\r\n<p><strong>Zorlok </strong>is an interactive fiction game following the bizarre misadventures of a demon with no memories and the nerdy high schooler they’re bound to serve. Uncover mysteries and cause mayhem in this dark comedy about monsters, found family, personal identity, and the line between good and evil.\r\n</p>\n<p>The setting and story are inspired by campy horror movies, classic murder mysteries, and an old Monster of the Week campaign.\r\n</p>\n<strong><em>Zorlok</em>’s demo will be released on May 13th, 2022.</strong>\n<p><strong>Content Warning: </strong>The game and this blog are rated <strong>17</strong>+. Specific CWs will be updated as development progresses, but <strong>Zorlok</strong> will contain swearing, alcohol and drug use, sexually suggestive content, violence, religious themes, and death.\r\n</p>\n<p>You were a terrifying demon who wielded hellfire, fought angels, and corrupted souls (or something like that), but that version of you vanished the night you made your deal with Tommy, a high schooler who was willing to sell you his soul if you’d help him become “cool.”\r\n</p>\n<p>That should’ve been easy, right? You could’ve sat the kid in front of a box fan for a few minutes, let him cool down, collected his soul, and been on your merry way. But, no! Before you even got a chance to introduce yourself, Tommy told you to forget your past and start going by the name <em>Zorlok</em>.\r\n</p>\n<p>So, now you’re “Zorlok” and you have no idea who or what the Hell you really are. You know you’re a demon, but that’s it. You don’t know why or how you became a demon, how to control your powers, you aren’t even sure how these deals are supposed to work. (Like you tried the fan thing and nothing happened, so either that loophole doesn’t work or there’s some other trick to stealing souls you haven’t quite figured out yet.)\r\n</p>\n<p>But what does it mean to be a demon? With your memories and identity stripped away, where does that leave you? You are a demon, but are you still demonic?\r\n</p>\n<p>And just in case things weren’t complicated enough, you’ve gotten yourself involved with a group of monster hunters working for the local Fay Council. To make a long story short, Tommy ordered you to save someone being attacked by a monster, that person was a hunter, now you’re on a team with this hunter and another random human, and the three of you are supposed to protect the city of Casper from vicious predators, investigate strange deaths, and fight off evil. Whatever. You’re just happy to get a break from doing Tommy’s math homework.\r\n</p>\n<p>- Decide who you’re going to be now or attempt to discover who you were\r\n</p>\n<ul><li>Customize your gender and pronouns\r\n</li><li>Choose an alias (or use lots of them)\r\n</li><li>Design your human disguise and gradually unlock your true demonic appearance\r\n</li><li>Name your loyal hellhound and select which breed they’re disguised as\r\n</li><li>Become more demonic, more angelic, or remain neutral based on your actions\r\n</li><li>Continue to rail against your situation or decide that maybe this isn’t so bad…\r\n</li></ul>\n<p>- Learn to control your infernal powers and choose the three domains at your command: <em>Fire</em> or <em>Ice</em>, <em>Light</em> or <em>Spirit</em>, <em>Corrupting</em> or <em>Shapeshifting</em>\n</p>\n<p>- Tell elaborate lies or risk revealing dangerous truths\r\n</p>\n<p>- Help Tommy survive high school (or sabotage him at every turn)\r\n</p>\n<p>- Explore Casper, WA, a strange little city either surrounded by or inhabited by monsters depending on who you ask\r\n</p>\n<p>- Set everything on fire… <em>accidentally</em></p>\r\n\r\nTommy Osorio\r\n<p>Tommy is the 15 year-old who trapped you in this pact and then forced you to forget your past. You’ll get his soul in exchange for helping him become the coolest kid at his high school, but you’re starting to wonder if that’s an impossible task. Tommy seems to think that becoming popular will make his former best friend, Jin, less embarrassed to hang out with him and claims that this pact was all his idea. The first part of that checks out, but the second doesn’t. The Tommy you’ve gotten to know wouldn’t have thought to strip you of your memories and rob you of your identity. So, either this kid’s lying to you or someone else had a hand in this.\r\n</p>\r\nTommy is a cisgender male. Your relationship with Tommy can go in several directions including remaining neutral, growing to care for and protect him like a sibling, or seething with hatred and messing with him as much as you can.\r\n\r\nDev (RO)\r\n<p>The de facto leader of your monster hunting trio, Dev’s a career criminal who’s been entrenched in the supernatural world since xe got involved with a pixie mob over 10 years ago. You’ve heard that Dev became a member of the LAFC (the Los Angeles Fey Court) but don’t know why xe would abandon that life and return to the small town xe grew up in. Maybe it has something to do with the magic eye xe keeps hidden under that eye patch?\r\n</p>\r\nDev is gender selectable and can be nonbinary (xe/xem), cisgender male (he/him), or cisgender female (she/her). Dev is bisexual, grayromantic, and polyamorous.\r\n\r\nE.J. (RO)\r\n<p>Dev’s childhood friend, your new roommate, and a reluctant member of your monster hunting team. EJ is a human who was living a completely ordinary life unaware of magic’s existence until you showed up at their door. However, strange, unexplained phenomena have plagued EJ for decades and their uncontrolled arcane powers have only grown more volatile since you moved in.\r\n</p>\r\nEJ is gender selectable and can be nonbinary (they/them), cisgender male (he/him), or cisgender female (she/her). EJ is bisexual, biromantic, and monoamorous.\r\n\r\nAdam / Eve Park (RO)\r\n<p>A talented, young detective who’s dedicated to protecting the people of Casper from harm. Like most citizens, Park isn’t aware of magic’s existence, but they have their suspicions and realize that more’s going on here than meets the eye. They also firmly - and somewhat correctly - believe that their former friend turned bitter rival, Dev, is somehow involved with the strange phenomena plaguing the city.\r\n</p>\r\nDetective Park is gender selectable and can either be Adam, a transgender man (he/him), or Eve, a transgender woman (she/her). They’re demisexual, panromantic, and polyamorous.\r\n\r\nAinsley\r\n<p>The leader of a rival monster hunting team, Ainsley is incredibly well-trained. Like, if you had to guess - which you don’t but, you’re bored - you’d guess she’s ex-military. She also seems very warm and caring and based on the way she looks at you and Ciel, she doesn’t seem to hold much prejudice against monstrous beings. All in all, she seems really nice. You’re not sure how that makes you feel.\r\n</p>\r\nAinsley is not gender selectable, she is a cisgender female who uses she/her pronouns. She is not romanceable.\r\n\r\nLucía (RO)\r\n<p>A member of the rival monster hunting team, you haven’t had much of a chance to interact with Lucía. From what you’ve heard, you think she’s some kind of park ranger, which is impressive considering that the state park which borders Casper is “infested” with monsters. You wonder what kind of things she’s seen out there and what keeps bringing her back to the forest.\r\n</p>\r\nLucía is not gender selectable, she is a cisgender female who uses she/her or they/them pronouns. Lucía is homosexual, homoromantic, and monoamorous. She identifies as a lesbian and can only be romanced by female or nonbinary characters.\r\n\r\nCiel (RO)\r\n<p>The final member of the rival monster hunting team, Ciel is an enigma to you - an acerbic, reticent, goth enigma to be exact. At first glance Ciel appears human but when you <em>really</em> look at them you notice their pointed ears, yellow eyes, and short fangs. You aren’t sure exactly what Ciel is, but you’re 96% sure they’re not human.\r\n</p>\r\nCiel’s gender can be customized. They are always nonbinary but can go by she/they or he/they pronouns and be either feminine or masculine in appearance. They’re asexual (sex-positive), panromantic, and polyamorous.\r\n\r\n<p>There are several other main characters - including three more ROs (“The Celestial”, Danny, and Rose) - who I won’t discuss in detail at this time due to spoilers.\r\n</p>\n<ul><li>“The Celestial” is omnigender (ey/em). Ey is aromantic, pansexual, and polyamorous (and had some kind of relationship with Zorlok back when they were The Demon).\r\n</li><li>Danny is gender selectable - either nonbinary (any but she/he), cisgender male (he/him), or cisgender female (she/her). They are demiromantic, demisexual, and polyamorous.\r\n</li><li>Rose is a cisgender male (he/him). Rose is homosexual, homoromantic, and monoamorous. He is only romanceable by male or nonbinary characters\r\n</li></ul>\n<p><strong>Poly Routes:</strong> Dev &amp; A/E, Dev &amp; Danny, Ciel &amp; The Celestial, Ciel &amp; Danny\r\n</p>\n<p>For more on the main characters you can check out these posts:\r\n</p>\n<ul><li>Trope descriptions of ROs\r\n</li><li>RO romance tropes\r\n</li><li>More about Lucía and Ciel\r\n</li><li>More on the Celestial\r\n</li><li>Cast Artbreeder Portraits: Part 1\r\n</li><li>Cast Artbreeder Portraits: Part 2</li></ul>", "metacritic": null, "released": "2022-03-20", "tba": false, "updated": "2022-03-21T10:17:43", "background_image": "https://media.rawg.io/media/screenshots/9d9/9d985d28f4cd4e493169af5568e100ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["albie"], "genres": [], "publishers": [], "esrb_rating": null}