{"id": 75783, "slug": "russian-road-racer", "name": "Russian Road Racer", "name_original": "Russian Road Racer", "description": "Russian Road Racer — is an exciting arcade racing game, where your Russian car park will evolve during the game progress.\u2028\u2028<br/><br/>Choose a race mode, enjoyed track and hit the roads of Mother Russia. High speed and dangerous overtakes, will give you posibility to earn more coins. You will need coins to tune the existing cars and purchase new ones.\u2028\u2028<br/><br/>In the game you will find amazing graphics, a fleet of high-quality Russian car models, upgrades to improve the technical specifications of your cars, 4 levels with different weather conditions and time of day.\u2028\u2028<br/><br/>Game Modes:\u2028\u2028<br/><br/>One Way: the easiest mode of the game, in which all four traffic lanes are moving in one direction.\u2028<br/><br/>Two-way traffic: high complexity mode, in which two traffic lanes are moving in the direction of passing you and the other two in the opposite.\u2028\u2028<br/><br/>100-second race: competitive mode, which you have to earn as much points as you can in 100 seconds.\u2028\u2028<br/><br/>Bombed bus: when you accelerate the bus, it activates the bomb. If you reduce the speed, the bomb timer starts ticking. If you will not raise the speed again, the bomb will explode.\u2028\u2028<br/><br/>Caution!<br/>This game is quite realistic, but it is not designed to teach you the street races. Enjoy virtual car racing, but please observe the traffic rules and be careful on real roads, and always fasten seat belt.", "metacritic": null, "released": "2016-11-01", "tba": false, "updated": "2019-07-29T20:57:01", "background_image": "https://media.rawg.io/media/screenshots/3a0/3a0e519db2ec95465b7b639f0709b269.jpg", "website": "http://avecreation.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexander Sivatsky"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Alexander Sivatsky"], "esrb_rating": null}