{"id": 757893, "slug": "klass-of-99", "name": "Klass of 99", "name_original": "Klass of 99", "description": "<p>Welcome to Klass of 99, a re-release of the original remake from 1999, in glorious wide-screen-o-vision, and with a few extra little improvements.</p>\n<p>Please note, it's a very old code base, originally written for Windows 98. It has been successfully tested on Windows 10 and 11.  The only thing that doesn't seem to work these days is full screen mode, probably because it runs in 8 bit colour mode.</p>\n<p>Anyway, you play Eric, a troublesome schoolboy, and your task is to delete your report from the school computer network so that you don't get into trouble with your parents. To do this you must find the letters of the password and somehow gain access to Rose The Secretary's computer. She has an evil nephew in the school who may be able to help with that.<br/><br/>To make things even harder, the school is teaming with kids and teachers and you are expected to attend lessons! Einstein is a swot and will tell on you if you do anything naughty, Angelface is a bully and will try and get you into trouble, and Boy Wander is a harmless rogue who loves to write on blackboards! Do anything wrong or be in the wrong place at the wrong time and you will be given lines! Collect over 10000 lines and you will be expelled from school!<br/><br/>You have until the end of the week to delete that report!!</p><p>Eric can be controlled using the cursor keys or Q, A, O, P.</p>\n<p>Extra controls include:</p>\n<ul><li>W - Write on blackboard</li><li>T - Type on computer</li><li>S - Sit down/stand up</li><li>D - Drop crystal</li><li>F - Fire catapult</li><li>H - Hit</li><li>J - Jump</li><li>C - Pick up object</li><li>B - Drop bomb</li><li>Esc - Pause</li></ul>", "metacritic": null, "released": "2022-03-19", "tba": false, "updated": "2022-03-21T11:30:35", "background_image": "https://media.rawg.io/media/screenshots/2cd/2cd3eca8b1c4dac216d5b9ef62e4c841.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BitGlint Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}