{"id": 75785, "slug": "3d-drift-xtreme-racing-real-car-stunt-drifting-dri", "name": "3D Drift Xtreme Racing – Real Car Stunt Drifting Driver Simulator free games", "name_original": "3D Drift Xtreme Racing – Real Car Stunt Drifting Driver Simulator free games", "description": "Got Drift? Slide your way to a massive score and prove your Gymkhana skills in this challenging and creative skill-based racer. Your Stunt, Your Style!<br/><br/>Realistic ‘Drift’ Cars: lovingly recreated for an exciting, fun and satisfying Drifting experience. Designed by car enthusiasts, for car enthusiasts!<br/><br/>It’s not just about speed: You score points for drift style and length! Maintain balance for maximum points and try to beat the Pro Ghost!<br/><br/>It’s good to share: Whether you’re racing against the Pro’s or your own fastest time, Everyplay Replay Sharing allows you to show off your mad skills to your friends, and the rest of the world!<br/><br/>===========<br/>GAME FEATURES<br/><br/>▶ Master 5 Awesome Drift Cars with Real Physics on 30 diverse circuits!<br/>▶ Multiple modes: Earn your Drift License and learn the basics; put your skills to work in Drift Stunt Challenges; master the Drift Circuits or show off your creativity in Arena Freestyle!<br/>▶ New GHOST Tech: Race against the Spectre of a Pro, or your own best times to unlock new cars, levels and Career stages!<br/>▶ Easy to drive, but hard to master: Realistic Drift handling makes it satisfying to learn your craft. See yourself rise through the World Leaderboards!<br/>▶ Score high by keeping your Drift going! Style over Speed!<br/>▶ No upgrades or boosts for your cars: It's just you and the machine against equal competitors - a fair playing field to prove your Drifting Skills!<br/>▶ Exciting dynamic environment with animated scenery and obstacles.<br/>▶ Share your most EPIC REPLAYS with Everyplay!<br/>▶ Compete in the Championship: Try to get the World’s best scores for Drift and Speed!<br/>▶ Maximum Control: Supports Touch, Tilt and Analogue steering methods.<br/>▶ iOS Optimisation: runs perfectly on anything from the original iPad 1 to the latest 5th Generation widescreen devices.<br/><br/>===========<br/><br/>So it’s time to Get Creative, Get Sideways, and push your driving skills to the max with Drift Xtreme Racer!<br/><br/>===========<br/>NOTE: This game is 100% free-to-play, but also offers optional content for real money through IAPs. You may shut-off this feature by adjusting your device’s settings.", "metacritic": null, "released": "2014-02-09", "tba": false, "updated": "2019-10-22T14:01:02", "background_image": "https://media.rawg.io/media/screenshots/153/153dd9baa32fe8a26a8b8c7355b1a077.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hybrid Touch Games"], "genres": ["Sports", "Racing"], "publishers": ["Hybrid Touch Games"], "esrb_rating": "Everyone 10+"}