{"id": 757900, "slug": "devwill-too-prologue-mega-drive-sega-genesis", "name": "Devwill Too Prologue (mega drive / sega genesis)", "name_original": "Devwill Too Prologue (mega drive / sega genesis)", "description": "<p>Support my work and have acces to all games and exclusive content: https://www.patreon.com/amaweks</p>\n<p>Apoie meu trabalho e tenha acesso a este jogo e conteúdos exclusivos: https://apoia.se/amaweks\r\n</p>\n<p>Devwill Too Prologue</p>\n<p>Devwill Too Prologue is a original platformer game for Mega Drive / SEGA Genesis. You play as the Yellow homunculus, and have to jump over enemies and find new habilities to advance on the game.</p>\n<p>This is a Sega Genesis / Mega Drive rom file, you will need the real hardware or an emulator, such as Kega Fusion, to play the game.</p>\n\n<p>key Features<br/></p>\n<p>► Gorgeous pixel art and visuals<br/></p>\n<p>► Combo system to enhance the fun.</p>\n<p>► About 25 minutes of speed run gameplay<br/></p>\n<p>► English and Portuguese language select on options.</p>\n<p>► Jukebox screen to listen the exciting OST<br/></p>\n<p>► 5 full animated screens of comic panels<br/></p>\n<p>► Extra bonus for who completes 100% of the game ;)<br/></p>\n\n<p>CREDITS (Mangangá Team)</p>\n<p>► Art + music: Paulo “amaweks” Villalva - http://twitter.com/amaweks </p>\n<p>► Code: nemezes - http://twitter.com/laudelino7 </p>\n<p>► Testing: Luiz Villalva - http://twitter.com/lmvvml and Antônio Gabriel M. Villalva.<br/></p>\n\n<p>There will be a cartridge version some time this year by Mega Cat Studios. Stay Tunned ;)<br/></p>\n\n<p>A few words from the conception of this game:</p>\n<p>Devwill Too Prologue is a sort of prequel for Devwill Too MD. Now you play as one of the Yellow Homunculus in search for a reason for you existence. The game was made too like a remake from the 8 bit (ZX Spectrum / MSX) Devwill Doo version, expanded and reworked with new 16 Bit assets.</p>\n<p>We made this game, a 6 month project (but as usual took us a few more months to finnish), as a way to take a break from our other longer term project: Mega Devwill. Developing a game with such a small team is very time consuming. But these \"breaks\" in projects are healthy for the team, so we do not spend too much time without that feeling of completeness, of having even done something till the end. This renews our \"spirit\", our will to get back to the bigger project and keep it going till the end. Also, it's a way for us to deliver something new to you players, our evolution as developers, and provide minutes, or maybe hours, of fun for you.</p>\n<p>We hope that you take the most of this game, its challenge, its visuals and music, and its narrative. We'll see you soon, on Mangangá Tema next productions.</p>\n\n<p>Algumas palavras sobre a concepção deste jogo:\r\n</p>\n<p>Devwill Too Prólogo é uma espécie de prequela de Devwill Too MD. Agora você controla um Homunculo amarelo em sua busca existencial. O jogo foi concebido como um remake da versão 8 bits (ZX Spectrum e MSX) de Devwill Too, só que expandido e retrabalhado com gráficos e sons de 16 bits.<br/></p>\n<p>Nós realizamos este jogo, um projeto de 6 meses (mas que como sempre nos tomou uns meses a mais), como uma forma de ter uma pausa em nosso outro projeto de mais longo prazo: Mega Devwill. Desenvolver um jogo com uma equipe tão pequena é algo demorado. Mas estas \"pausas\" em projetos maiores é salutar para a equipe, pois assim não ficamos tempo demais sem ter aquela sencação de completude, de ter feito algo até o fim. Isso dá ânimo e renovação para todos retornarem ao projeto de mais longo prazo e levar ele até o fim. Além disso, é uma forma de entregarmos algo novo para o público, mostrando a nossa evolução como desenvolvedores, e proporcionar alguns minutos, ou quem sabe horas, de diverção para você.<br/></p>\n<p>Esperamos que aproveite bem este jogo, seu desafio, seu visual e músicas, e sua narrativa. Nos vemos em breve, nós próximas produções, mais curtas ou mais longas, do Mangangá Team.<br/></p>\n<p>________________________________________________________________</p>\n<p>Para brasileiros: caso tenham problemas em pagar via Paypal, ou se preferirem como alternativa, você pode comprar o jogo via transferencia PIX no valor de R$ 30,00.  Após a transferencia por favor envie um email para paulo_villalva@yahoo.com.br informando qual jogo você adquiriu.<br/></p>\n<p>Chave PIX: 476864fb-67e2-4cf3-a1e4-1ff45ed6c456\r\n</p>", "metacritic": null, "released": "2022-03-19", "tba": false, "updated": "2022-03-21T11:32:14", "background_image": "https://media.rawg.io/media/screenshots/c59/c59611c17365f3a3a7fd5683696ca6c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amaweks"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}