{"id": 758, "slug": "hue", "name": "Hue", "name_original": "Hue", "description": "<p>In a one-color world, one scholar, working in one of the universities, suddenly discovers the phenomenon of color. But where she works, nobody needs her discovery. And even worse - the scientist is expelled from the university. At the same time, the color discovered by this scientist is spreading in her one-color world. In punishment, the scientist is sent to another world - the world of impossible flowers. Impossible colors are those colors that are invisible to the human eye, they are outside the visible spectrum.</p>\n<p>The player plays for a little boy named Hue, who one morning wakes up and starts looking for eight visible сolors to save the scientist from the world of invisible colors.</p>\n<h3>Game mechanics based on color</h3>\n<p>In the game, objects can be seen, but with them you can do something only if the color of these objects is different from the color of the game&#39;s background. For example, you start with a black background, and you can see a black door on a black background - you can see its outline. But you can open it only if you change its color to some other one. or if you change the background color. And you can change the background color only when you find, &quot;open&quot; some color. For example, the first color to open in the game is Aqua. After you open this color, you can make this color the background color of the game. And then the door will be black and you will be able to open it. This technique is used in many games - but usually it is implemented only for one color, for example, white on black or vice versa. In Hue, the player deals with eight colors - after the opening of each next color, the game is correspondingly more complicated.</p>\n<p>There are many objects in the game that you need to interact with in order to go further. And each object has to be made real by using the color mechanics described above. And also find a way to properly interact with the object itself. There are many puzzles in the game, and often they seem to be unresolved, but after the decision is finally found, the player is usually surprised how he could not see this decision from the very beginning.</p>\n<h3>The Mysteries of the Final</h3>\n<p>In addition to the fascinating mechanics, the game also has a story - a story about a woman researcher who discovered color for a one-color world. This story develops throughout the game, its fragments open gradually and in the end everything will turn into one picture.</p>", "metacritic": 79, "released": "2016-08-30", "tba": false, "updated": "2024-03-26T11:01:27", "background_image": "https://media.rawg.io/media/screenshots/2d9/2d9f74addd8f5b5f83459c2cb700aaf4.jpg", "website": "http://huethegame.com", "rating": 3.39, "rating_top": 4, "added_by_status": {"yet": 219, "owned": 1910, "beaten": 180, "toplay": 25, "dropped": 125, "playing": 19}, "playtime": 2, "achievements_count": 62, "ratings_count": 325, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 329, "platforms": ["PS Vita", "PlayStation 4", "Nintendo Switch", "Xbox One", "macOS", "PC", "Linux", "iOS"], "developers": ["Curve Digital", "Serkan Binici", "Fiddlesticks Games", "Fiddlesticks"], "genres": ["Adventure", "Board Games", "Indie", "Puzzle"], "publishers": ["Curve Digital", "Serkan Binici"], "esrb_rating": "Everyone"}