{"id": 75818, "slug": "galaxy-clicker", "name": "Galaxy Clicker", "name_original": "Galaxy Clicker", "description": "<p>You are a smuggler who is going to have to change the history of the Universe. Assemble your fleet the likes of which the Galaxy had never seen before, and get ready to fight for your creed.<br />\n► Watch the most beautiful views of space<br />\n► Join the epic fights in orbits<br />\n► Create a team with your friends, tap and conquer the Galaxy rating<br />\n► Solve all mysteries of a main character and his missing ship<br />\n► Assemble a fleet with the desperados captains from all over the Universe<br />\n► Play the best of space clickers!<br />\nTAKE PART IN THE EPIC SHIP BATTLE<br />\nCollect a battle fleet from famous ships and huge flagships. Click as fast as possible, and get the spaceship of your dream! You will able to win all imperial bosses only by buying new kinds of weapons and improving them.<br />\nCONQUER THE GALAXY<br />\nDiscover the endless space of the Galaxy. You will travel to distant planets and civilizations. Admire the stunningly beautiful views of the space. Collect the dark energy and exchange it with the useful artifacts from cosmic traders.<br />\nENDLESS JOURNEY<br />\nPlay the best space clicker game ever. Click as fast as possible and become the top rated player of the Galaxy. Discover the mystery of disappearance of your spaceship, find out who of the captains is your friend, and who is a cunning betrayer. Take part in epic battles with legendary captains, win the bosses, improve your ship and become the conqueror of the Galaxy!<br />\nCREATE AN INVINCIBLE FLEET<br />\nTake part in an intergalactic war in the role-playing click game Galaxy clicker 2. Fight alone against your enemies or gather friends and create your team! Combine your efforts against the bosses online. Together, you will win in star wars. Now the future of this war depends on your team. Click and grind Imperial ships into space dust!<br />\nPLAY THE BEST SPACE CLICKER<br />\nGalaxy clicker 2 is a free space clicker game where every tap brings you closer to the interstellar domination!<br />\n- You will find a unique system of upgrading weapons and spaceships<br />\n- Amazing graphics of the Space; much attention is paid to the characters’ details: captain Steve and his team will not let you get bored.<br />\n-A simple, but very entertaining and amusing gameplay: click, tap and upgrade!</p>\n<p>The game is sure to appeal to fans of games in the genre of RPG clicker, evolution, and all fans of the interstellar battles! Tap and click as fast as you can!<br />\nJoin us on Facebook and follow our news:<br />\nhttps://www.facebook.com/GalaxyClicker2/</p>", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2022-03-08T15:50:33", "background_image": "https://media.rawg.io/media/screenshots/bd5/bd54273588cc84b448260f6da5d8279e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["tltGames", "TLT GEIMS, OOO"], "genres": ["RPG", "Simulation"], "publishers": ["TLT GEIMS, OOO"], "esrb_rating": "Teen"}