{"id": 75814, "slug": "sword-of-chaos-lame-du-chaos", "name": "Sword of Chaos - Lame du Chaos", "name_original": "Sword of Chaos - Lame du Chaos", "description": "Sword of Chaos, l'un des Action MMORPG les plus avancés jamais produit.<br/><br/>Sword of Chaos combine des éléments d'attraction fatale et de violence chaotique dans un festin visuel unique et détonnant. Plongez dans un monde de violence et libérez votre sauvagerie intérieure. Sentez, Dégustez, Piratez, Cinglez et Dominez le combat en chacun de vos mouvements alors que vous vous battez pour détruire tout ce qui se dresse devant vous !<br/><br/>Maintenant, pourquoi n'y goûterions-nous pas, mortels !<br/><br/><br/>Caractéristiques :<br/><br/>- Guidez votre aventurier à travers 20 niveaux difficiles<br/>- Acquérez des compétences magiques pour vaincre les armées de créatures féroces<br/>- Mesurez-vous aux centaures, loups-garous, centurions, hommes-chèvres et plus encore<br/>- Gameplays variés incluant tower defense, boss de monde et d'arènes<br/>- Construisez votre propre guilde et rejoingnez des amis pour combattre les joueurs sur les serveurs autour du monde<br/>- Participez à des combats PvP massifs 20 vs 20<br/>- Envoyez des messages en direct à vos coéquipiers afin de coordonner vos attaques<br/>- Personnalisez votre aventurier avec 68 ensembles de tenues carrément cool et mixez les pour les assortir<br/><br/>====<br/><br/>Facebook Fanpage : https://www.facebook.com/SwordofChaosFROfficial<br/>Page d'accueil : http://fr.soc.all-stargames.com/<br/>E-mail : fr.soc@all-stargames.com", "metacritic": null, "released": "2016-03-24", "tba": false, "updated": "2019-10-22T14:23:54", "background_image": "https://media.rawg.io/media/screenshots/c81/c811ca62abca81570f0102ce6df16492.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Allstar Games"], "genres": ["Action", "RPG"], "publishers": ["KUNLUN EUROPE"], "esrb_rating": "Teen"}