{"id": 758112, "slug": "terror-itch", "name": "TERROR (itch)", "name_original": "TERROR (itch)", "description": "<p>Get to know this game!</p>\n<p>You are Paul Davidson!</p>\n<p>You Have Been Kidnapped while walking home.</p><p>you have been taken into this test rooms.</p><p>everything is a test there!</p>\n<p>Enemies You Might Incounter Are Scary!</p>\r\n  Monster<br/>\n<p>Monster is a living blob who kinda looks like a character who is from fnf. i made it simular to bob by accident. who cares! inspired! so this thing's health is 15.</p>\n<p>it can eat you up so dont go near it.</p>\r\n S.C.A.R.E\r\n<p>Aka \"Scientificly Crafted Animals Rarely Encountered\"</p>\n<p>This fella is slow and does alot than \"BOB\" aka monster does. its health is 25</p>\n<p>and does alot more than eat. it can swing and hit a homerun with your head!</p>\r\n LilBratt \r\n<p>It is the most annoying thing in the game! [which i made annoying on purpouse]</p>\n<p>[and no its mouth does look like a na- symble. its not. its not from germany!]</p>\n<p>also it does 0.001 damage. how many they are = it can do alot of damage!</p>\n<p>its health is 30 btw lol</p>\n<p> Lord</p>\n<p>lord is the most op character i have ever made! plus its name is based on how strong it is! i recomend the revolver which you get in lvl 9 or a secret thing if you will.</p>\n<p>its health is a half quarter from yours! 50% hp for that guy. and more of him will kill you quicker than the lilbratts combined!</p>\r\n Blood Monster\r\n<p>same with those bob monsters but weaker and faster than Lord! they are a coloney of people who died in a pool of blood, came back like this! you can find them in lvl 8, 9, 10 and 15!!! sorry for spoilers! but i had to let you know!</p>\n<p>know your allies!</p>\r\n ok im sorry who invited you?\r\n<p>he is a person helping you? i guess? and you already know who kidnapped you on your way home.</p>\n<p>he is everywere ever since lvl 5. which i made horribly. also he made those monsters but lord is the one unstabble. exept one who is standing still not knowing who he is.</p>\n<p>he did not make the blood monsters!</p>\n\n<p>This Game will come out in april 23 i promise!</p>\n<p>if you want sequal, squeal in the comments- \"TERROR 2\"</p>", "metacritic": null, "released": "2022-03-18", "tba": false, "updated": "2022-03-21T12:25:11", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UnrealGenius2412"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}