{"id": 75827, "slug": "drift-max-car-racing", "name": "Drift Max - Car Racing", "name_original": "Drift Max - Car Racing", "description": "It's time to leave your skid marks on the asphalt! Keep your thumb on the throttle pedal and drift through 12 realistic tracks with high performance racing cars. Download the best FREE drift racing game ever!<br/> <br/>FEATURES<br/>- Realistic 3D graphics.<br/>- 20 amazing drift cars (including American muscle cars, European sports cars and legendary Japanese drift machines !!!)<br/>- Car customization and modification: Paint your car with 25 different colors. Customize your machine with a variety of decals and rim modifications. <br/>- 12 amazing racing tracks: Asphalt, winter, desert, industrial, downtown, village, roller coaster, tunnel, mountain, slalom, city, highway with beautiful skylines.<br/>- Cutting-edge car control system with touch or tilt steering options both including handbrake.<br/>- Different camera angles. New in car racing camera. Grab the steering wheel and start drifting.<br/>- \"Edge Drift”: Show your drifting skills by driving close to the walls and earn more coins.<br/>- Coin system: Earn coins by making drift points, edge drifting or earning time bonus in game. <br/>- Learderboard: For each track, compete your friends and other users in the world and reach the top.<br/>- Detailed Quality settings.<br/><br/>Tokyo drift lovers!!!! Accelerate and keep on drifting !!!! Drift Max is the king of drifting !!!!<br/>One of the best car drifting games!<br/><br/>DO NOT FORGET:<br/>****************<br/>YOUR COINS AND PURCHASED ITEMS WILL BE DELETED PERMANENTLY (AND CAN’T BE RESTORED) IF YOU UNINSTALL THE GAME!<br/> <br/>Follow Us:<br/>https://www.facebook.com/tiramisustudios", "metacritic": null, "released": "2015-01-14", "tba": false, "updated": "2019-07-29T21:36:56", "background_image": "https://media.rawg.io/media/screenshots/ee2/ee250e8b5f0d28f1ada7f1cbe22de5f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiramisu Studios"], "genres": ["Simulation", "Racing"], "publishers": ["TIRAMISU STUDIOS YAZILIM HIZMETLERI LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}