{"id": 758475, "slug": "nova-slash-unparalleled-power", "name": "Nova Slash: Unparalleled Power", "name_original": "Nova Slash: Unparalleled Power", "description": "Nova Slash: Unbelievable power &amp; full of excitement in this mortal combat game. The Walking dead, “Noven”, has become one with a dead star due to an experiment that aims make the absolute weapon. He vows vengeance against the world and wishes to save it from the corruption within it. The game is 3D with HD graphics, dynamic combat with unique &amp; easy controls, and many opportunity to unlock their unbelievable and excitements of mortal combat game series. <br/>\r\nNova Slash is a cool mortal combat game that gives you a great chance to show your skills to the world of players. Become a hero and save the universe from fall.<br/>\n<br/>\r\nNoven must protect humanity's destiny by engaging in combat against the world and wishes to save it from the corruption while uncovering the mystery behind their mind. Fight back with rage and courage if you want to win!<br/>\n<br/>\r\nNEXT LEVEL PERFORMANCE<br/>\r\nSuper fast paced fight.\u2028Parkour Jumps, Slides, Climbs.<br/>\r\nSuper impressive graphics<br/>\r\nLevel up your characters<br/>\n<br/>\r\n An immersive offline dynamic combat with unique controls .\u2028 <br/>\r\n- Get ready for action, cool brawls with powerful fighters, and an exciting adventure around the world\u2028<br/>\r\n- Customize your character (Noven) \u2028\u2028<br/>\r\n- Enjoy the original Nova Splash combat experience with enhanced 3D graphics and gameplay.\u2028\u2028<br/>\r\n- Play the single-player campaign  to protect Earth anytime, anywhere.\u2028\u2028<br/>\r\n- Story Mode: Delve into the story and fight to uncover the truth about these corruption in action-packed new levels.", "metacritic": null, "released": "2022-03-24", "tba": false, "updated": "2022-06-15T14:12:22", "background_image": "https://media.rawg.io/media/screenshots/d2d/d2df26efbbabeca000cddda66eea02a4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Icuzo"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Icuzo"], "esrb_rating": null}