{"id": 758560, "slug": "oblivity-find-your-perfect-sensitivity", "name": "Oblivity - Find your perfect Sensitivity", "name_original": "Oblivity - Find your perfect Sensitivity", "description": "<h3>Sensitivity Finder:</h3><br/>The sensitivity finder is a unique feature Oblivity is especially known for. It will help you to find an optimal mouse sensitivity for your favourite game!<br/><br/>You play a selection of scenarios matching your selected FPS game.<br/>Each round your mouse sensitivity changes. Oblivitys algorithm tracks your performance and mouse movement data to determine the sensitivity you perform best with. Over a longer playtime, Oblivity can collect enough data to show you exactly how well you perform on different mouse sensitivity levels.<br/><br/><h3>Aim Trainer:</h3><br/>In Oblivity's trainer you can try out your new mouse sensitivity right away. You will find anything in the continuously growing online library of scenarios and playlists. How high can you climb the leaderboards against other players and your friends? You can also create scenarios yourself, upload them and share them with the Oblivity community. Special aim training technies such as mouse pathing or metronom aiming are supported as well.<h3>Analysis:</h3><br/>After your training session, you can immediately view the statistics of your runs in the analysis section. Oblivity provides as much data as possible to show where you have weaknesses and do aiming mistakes. This includes the usual information like accuracy, mouse speed and score. But you will also see data such as the deviation from the ideal aiming path, overshoot, undershoot or aiming smoothness. <br/><br/><h3>Replay:</h3><br/>Every run can be rewatched with the replay tool. The timeline shows, where you did which mistake. Be it over- undershooting the deviation or your overall performance. The playback speed can be adjusted to any level. You can also turn on onscreen indicators that show your aim line compared to the optimal aiming path.<br/><br/><h3>Converter:</h3><br/>Oblivity also offers a converter. It is not only intended to convert your new Oblivity mouse sensitivity to that of your favorite game. You can very accurately convert the sensitivity of all supported first person shooters to that of any another game.<h3>Options:</h3><br/>Oblivity is fully customizable! You can adjust anything to create your perfect, individual aim training experience. To name some examples: Change any ingame colour, create your own crosshair, import your own sound effects and customize the ingame HUD. Of course you can also set all technical values. Oblivity supports different FOV types, each keybind can be changed, different monitor resolutions and aspect ratios are supported.<br/><br/>", "metacritic": null, "released": "2022-03-24", "tba": false, "updated": "2022-03-25T04:20:20", "background_image": "https://media.rawg.io/media/screenshots/58f/58f99efba665c640c9793cb430277ae6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 33}, "playtime": 2, "achievements_count": 20, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Poly Games"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Poly Games"], "esrb_rating": null}