{"id": 758589, "slug": "vanaris-tactics-demo", "name": "Vanaris Tactics Demo", "name_original": "Vanaris Tactics Demo", "description": "Vanaris Tactics is Coming Soon to GOG.<br/> You can wishlist it  here.\n\n\n\n<br/>\n<br/>\n\nVanaris Tactics is a fantasy turn-based tactical RPG that tells a story about refugees fleeing their occupied motherland.\n<br/>\nFollow a group of refugees looking for freedom outside the walls of Vanaris, unite your brethrens and use tactical prowess to escape your oppressors.\n<br/>\n<br/>\n<br/>\n<br/>\nVanaris Tactics tells the story of Morgana, in her struggle looking for freedom outside the walls of Vanaris. Accompanied by her brother Nigel and nephew Adrien, they must flee their motherland, a place they call home. Discover the vast land of Vanaris and meet new people on the same path, as they must leave everything behind to escape their oppressors and find peace.\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li> Vanaris Tactics implements a combat initiative unit turn order system inspired by the greatest fantasy tactics RPGs of all time.\n<br/>\n</li><li> Unite a band of unique characters with their own strengths, skills, and stories.\n<br/>\n</li><li> Gain new abilities and increase your range of options to deal with new challenges.\n<br/>\n</li><li> Different combinations of weapons and accessories and see a unit’s playstyle change drastically.\n<br/>\n</li><li> Travel the land of Vanaris to discover powerful treasures and hear untold stories. However, keep your guard up as danger lurks in every corner.\n<br/>\n</li><li> Unfold the story through 15 unique story encounters and X hand-crafted in-game cutscenes, as well as optional battles and boss fights.</li></ul>\n<br/>\n<br/>\n<ul><li> A rich blend between tactics and fantasy RPG; Vanaris implements an intuitive turn based combat inspired from the golden ages of turn-based tactics games. \n<br/>\n</li><li> Strategically plan your movement to attack your enemies, and be aware of their counterattacks.\n<br/>\n</li><li> Strike your foes from afar or jump into the fray, every decisions will prove crucial in combat.\n<br/>\n</li><li> Utilize various skills and status effects to aid your allies and cripple your enemies.</li></ul>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-25T04:40:36", "background_image": "https://media.rawg.io/media/screenshots/d12/d121a7ac9536f1281d02a826395e4643.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 24}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matheus Reis"], "genres": [], "publishers": ["Toge Productions"], "esrb_rating": null}