{"id": 758545, "slug": "chronicles-of-taldun-the-remainder", "name": "Chronicles of Tal'Dun: The Remainder", "name_original": "Chronicles of Tal'Dun: The Remainder", "description": "This is a story of two magi, Vyn and Ilar, who find themselves trapped in a collapsing tower with their only hope for salvation being a difficult ritual. Or at least that is what Ilar tells you. The thing is - you don’t remember anything, and Ilar’s story makes less and less sense the closer you are to the ritual. Are they hiding things to protect you from the bitter truth, or are they deceiving you for some more nefarious reason? <br/><br/>Guide Vyn’s actions to death and beyond and uncover Ilar’s truth. Are they your colleague, lover or something completely different? Read between the lines of what they are telling you, explore your surroundings for clues and use hands-on deduction to break the viscious circle and set them free.<h3>Features</h3><ul><li>Around <strong>50 different endings</strong><br/></li><li>Almost<strong> 140k words</strong> that explore a world of ritual magick, ancient technology, and a culture that marries mystic traditions of the orient and occident.<br/></li><li>Be lured into an occult world by artwork made to resemble alchemical manuscripts - intricately hand-drawn with pen and ink, then edited and animated digitally to bring to life.<br/></li><li>Immerse yourself in the haunting soundtrack weaved from organic sounds, ceremonial instruments, ritual chanting, and glitch effects.<br/></li><li>Chronicles of Tal'Dun: The Remainder contains Acts 1 to 3!</li></ul><br/>", "metacritic": null, "released": "2022-03-23", "tba": false, "updated": "2022-03-25T04:09:30", "background_image": "https://media.rawg.io/media/screenshots/67e/67ef968889b4c5b24e39e4d06515adee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9}, "playtime": 3, "achievements_count": 66, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Square Weasel Studio"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Square Weasel Studio"], "esrb_rating": null}