{"id": 758514, "slug": "world-of-retailing", "name": "World of Retailing", "name_original": "World of Retailing", "description": "<strong>If you want to be the greatest Retailer of all times, dont forget to put our Game on your Wishlist! :)</strong><br/><br/><strong>You can also join our Discord to report us bugs, chat with others or leave us feedback/update requests!</strong><br/><strong>If you want to know, at what stage of development a specific feature is, check out our Trello: https://trello.com/b/DCwz8WzT/world-of-retailing</strong><br/><br/>You are the new reseller in World of Retailing,<br/>The City only has one open Supermarket which is not quite good.<br/><br/>You are greeted by the owner of the first market, he's happy about the healthy market competition you are about to introduce, little does he know that this competitor will take over the whole city!<br/><br/>At first, the shopkeepers seems to be friendly, however, as you progress that may change.<br/><br/>Sounds easy, right? Just go, rent a store, fill the shelves with products and let it run it's course as your pockets fill?<br/>No! Competition can become fierce as competitors try to sabotage your store by hiring thugs to steal from you or advertise their store.<br/><strong>You need to be prepared in order to survive the tough world of retailing</strong>!<br/><br/><strong>In World of Retailing, you will find more than 600 Vocal lines!</strong><br/><br/><strong>Languages</strong><br/><br/>Currently the game is translated into German and English, we also have translated every vocal in our game (Tutorial and NPC Interaction) for both languages.<br/>In Future, we aim to provide more translations as the community grows.<br/><br/><br/><strong>Map</strong><br/>World of Retailing offers you a Live-Map of the map, showing you every npc in the map, let you scroll across it and even zoom.<br/><br/><br/><strong>Taxes</strong><br/>Yes, in World of Retailing, you need to pay taxes frequently - however, you could also try and corrupt the assistant, maybe she will only take a little bit for herself!<br/>You can also prevent tax payments by spending your money adequate instead of just horting it.<br/><br/><br/><strong>Collectables</strong><br/>You can find collectables all across the map which give you money, this way you can avoid getting bankrupt or just collect it for further investments.<br/><br/><br/><strong>Main Goal</strong><br/><br/>Be the only Retailer in Town, create the biggest Monopoly anyone ever seen.<br/><br/><br/><strong>Roaming People</strong><br/><br/>These folks are your clients.<br/>Serve them well or they wont come back again.<br/>They are procedurally generated.<br/><br/>You can always talk to them, trying to convince them to visit your shop.<br/>Due to the nature of procedural generation, all of them may react differently when you talk to them about the same topics.<br/><br/>They have a random chance of entering your shop and the amount of people in town increases with playtime.<br/><br/>You never know how much money they have or what products they look for, you may want your store's catalogue to offer various kinds of goods.<br/><br/><br/><strong>VIP's</strong><br/><br/>VIP's are the kind of customers which you can get the most money off of.<br/>You can't tell if someone is a VIP or not, which makes it harder to decide which customer to serve first.<br/><br/><br/><br/><strong>Shops</strong><br/><br/>Shops are pretty self-explanatory,  buildings that can be rented or bought, which you can use to display and sell products.<br/>There is only one shop that you cannot buy or rent from the very beginning:<br/>The shop of your rival who has to go bankrupt first, enabling you to rent or buy their property.<br/><br/><br/><br/><strong>Products</strong><br/><br/>The game offers you a lot of different, unique items that you can resell from consumables to computers and toys.<br/>There are[We] also Items that you must display in a freezer or Deli counter, depending on what kind of product you want to sell.<br/><br/>Of course there are also different shelves, counters, registers and desks to choose from with which to set up your shop, all of them having different properties and different designs, leaving it up to you to design the store according to your needs and wants!", "metacritic": null, "released": "2022-03-22", "tba": false, "updated": "2022-03-25T03:48:01", "background_image": "https://media.rawg.io/media/screenshots/e1a/e1a926261fd1ecb2af0f8cb94d3c8bf8.jpg", "website": "https://trello.com/b/DCwz8WzT/world-of-retailing", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MazeDEV", "Evoke-Gaming"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Evoke-Gaming"], "esrb_rating": null}