{"id": 758508, "slug": "duckhunt-missouri-kidz", "name": "DuckHunt - Missouri Kidz", "name_original": "DuckHunt - Missouri Kidz", "description": "Mindblowing novel patented computer vision algorithm enables you to shoot directly on the screen (using your cellphones)  and have ultimate fun with many of your friends divided into two teams - for target gallery duck shooting! (see instructions)<br/>Competitive experience for anyone with an itchy trigger finger. <br/>Super simple to use, absolutely no calibration – connect and shoot! <br/>Learn to lead into a target and shoot it down before competition or teammates do! Similar to the original DuckHunt game only now in multiplayer mode with literally no limit on the number of players! <br/>Play it on a large screen – the larger the better!<h3>FEATURES</h3><ul><li>So far unseen application of the novel patented computer vision algorithm that enables seamless and accurate aiming with your cellphone pointed at the computer screen<br/></li><li>Optional laser pointer design with personalized color schemes for each player guides aiming and shooting<br/></li><li>Ultra simple connection of players’ devices through free Apps for both platforms. No hassle - ZERO CALIBRATION!<br/></li><li>Kid-friendly, paintball-based DuckHunt Kidz adds a splash of creativity and color to the traditional carnival shooting game, making this a great game for the whole family.<br/></li><li>Fun custom hand-drawn graphics and animations add an element of amusement and character to play</li></ul><h3>HOW TO PLAY</h3><ul><li> Playing on the large screen makes it more fun<br/></li><li> Stand at a larger distance from the screen when playing - about 2 times the diagonal size of the screen - i.e. if the screen size is 65 inches  play the game from 130 inch distance.<br/></li><li> Avoid having magenta or bright white color around the screen on which the game is running. </li></ul><h3>INSTRUCTIONS</h3><br/>", "metacritic": null, "released": "2022-03-21", "tba": false, "updated": "2022-03-25T03:43:02", "background_image": "https://media.rawg.io/media/screenshots/c41/c4158e22aba0824878c405b04fc79abd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Predrag Lazic"], "genres": ["Action", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["MobileTVGames"], "esrb_rating": null}