{"id": 758519, "slug": "sweet-surge", "name": "Sweet Surge", "name_original": "Sweet Surge", "description": "In Sweet Surge you control the fate of a small ship crew made of sugar cubes. This crew navigates the unending ocean of Cioko in search for the ultimate opponent. Well, this and the greatest treasure ever glimpsed by any sugar cube. Sometimes your crew casts their ship's anchor near a mythical construction. This building shall be the site where you meet your next encounter. Usually this is the time when you meet opposing crews, but on rare occasions you meet something greater.<br/>\n<br/>\r\nKey features:<br/>\r\n-Orchestrate your cubes in various ways to overcome challenges. Essentially, for each cube you set a sequence in which they attack.<br/>\r\n-Customize the attacks by detailing their effects. Each cube knows a limited number of attacks. Assign effects to each attack to customize their actions to your crew's needs in the field.<br/>\r\n-Customize the base stats of each cube by equipping various items. Go all-in on one set, or mix and match equipment to your liking.<br/>\r\n-Set a formation for your cubes for each round of battle.<br/>\r\n-Then watch your team and the opposition duke it out.<br/>\r\n-Each encounter may consist of various rounds and multiple matches depending on which and how many crews arrive on the scene.<br/>\r\n-Collect rewards based on the outcome of the encounter and how your team is ranked at the end of these ad-hoc tournaments.<br/>\n<br/>\r\nThere are various encounters to be played, currently counting over 30. Additionally, there are numerous random encounters which shake up gameplay. And a moon made of sugar spices things up with random modifiers to refresh the experience.", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-03-25T03:52:16", "background_image": "https://media.rawg.io/media/screenshots/bb2/bb23734dcee00a206104b4072b9cf016.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chocolate Ship Games"], "genres": ["Casual"], "publishers": ["Chocolate Ship Games"], "esrb_rating": null}