{"id": 758618, "slug": "hellslave-demo", "name": "Hellslave Demo", "name_original": "Hellslave Demo", "description": "Hellslave is coming soon and can be wishlisted \nhere<br/><br/>\n<br/>\n<br/>\nThe world of Hellslave\n<br/>\nThe world is coming to an end and humanity is on the brink of extinction. Save it from a demon invasion by making a pact with the Devil and praise one of 6 demons to avoid humanity’s demise into darkness. Use your newly acquired demonic power against the invaders but it may have a bigger impact on you than you thought... \n<br/>\n<br/>\nA unique experience\n<br/>\nHellslave is a dungeon crawler unlike others following on the footpath of classic dungeon crawler but introducing new mechanics and drawing its inspirations from Dark fantasy universe, poems and artists (such as John Milton).<br/>\n<br/>\nUnleash unique powers and skills\n<br/>\nCustomize your character around a passive skill tree, discover and experiment with dozens of skills and demonic powers. Take advantage of synergy between skills to achieve combo and defeat your foes.  \n<br/>\n<br/>\n<br/>\n<br/>\nA dark world to explore\n<br/>\nTravel on world maps filled with dozens of unique landmarks but beware of what lurks in the dark. From villages to graveyards and crypt, destroy your foes, retrieve old relics to help the inhabitants of this doomed world. \n<br/>\n<br/>\n<br/>\nFight your way through this perilous world\n<br/>\nDeal with dozens of different enemies from zombies, ghosts, demons and bosses straight from hell to fight for your life and this world’s survival.  \n<br/>\n<br/>\n<br/>\nGameplay driven by a strong art direction\n<br/>\nContemplate unique visuals during your journey in hell on earth through handcrafted cut-scenes and visuals. \n<br/>\n<br/>\n<br/>\n<br/>\nYour journey in Hell is just beginning\n<br/>\nExperience different playthroughs depending on the powers of your starting Demon. If the first journey wasn’t enough for you, enjoy this hellish invasion a second time with the challenging New Game +.\n<br/>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-25T05:05:36", "background_image": "https://media.rawg.io/media/screenshots/ced/ced86a46b0a6ab9a8a2853fb583251bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ARS GOETIA"], "genres": [], "publishers": ["PID Games"], "esrb_rating": null}