{"id": 758613, "slug": "zombie-rollerz-pinball-heroes-demo", "name": "Zombie Rollerz: Pinball Heroes Demo", "name_original": "Zombie Rollerz: Pinball Heroes Demo", "description": "The full version of Zombie Rollerz: Pinball Heroes  is available on GOG.COM. You can purchase it here here<br/><br/>\n\nZombie Rollerz: Pinball Heroes is the ultimate mashup of classic pinball and zombie defense with rogue-like elements to ensure no two playthroughs are ever the same!\n<br/>\n<br/>\n<br/>\n<br/>\nShoot, slam and smash your way through hordes of adorkable zombies in this fusion of pinball, point defense and zombie horde gameplay.\n<br/>\n<br/>\nSelect from 10 different heroes, each with their own special ability to shoot zombies in hilarious ways. Discover and unlock hundreds of helpful powers and items to boost your hero.\n<br/>\n<br/>\n11 epic boss fights await, requiring pinballing precision and careful ability management to be taken down!\n<br/>\n<br/>\nRogue-like elements: 4 worlds wait to be explored by you via the overworld map. Random generation ensures that no playthrough is the same. You must adapt at each and every turn if you want to rid all worlds of the rampaging zombie plague – pinball-style!\n<br/>\n<br/>\nBetter than ever! Zombie Rollerz: Pinball Heroes is the new and improved continuation of the famous original game that fascinated millions on mobile devices already!\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>Fight 50 different types of adorkable zombies by pinballing through a cartoony world\n<br/>\n</li><li>Addicting mashup of classic pinball and zombie defense\n<br/>\n</li><li>Epic zombie boss fights that will test your skills\n<br/>\n</li><li>Random generation of 4 different worlds ensures that no playthrough is the same\n<br/>\n</li><li>More than 300 trinkets and skills for you to unlock, including legendaries!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-25T05:01:30", "background_image": "https://media.rawg.io/media/screenshots/96d/96d4cb74bcbf00fc629feeabf8d478bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 26}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zing Games"], "genres": [], "publishers": ["Daedalic Entertainment"], "esrb_rating": null}