{"id": 75863, "slug": "gitex-ambulance-rescue-duty", "name": "Gitex Ambulance Rescue Duty", "name_original": "Gitex Ambulance Rescue Duty", "description": "Gitex Ambulance Rescue Duty: Emergency Fast Driver is specially designed for those who always love to play rescue driver &amp; city ambulance games of 2017! Welcome to the gitex rescue ambulance game of 2018 and we are very excited to offer you such an amazing ambulance game 2018!<br/><br/>Gitex Ambulance Rescue Duty: Emergency Fast Driver Game Play:<br/><br/>The game play of this Gitex Ambulance Rescue Duty: Emergency Fast Driver is very amazing and interesting to play! You are a master of ambulance Emergency Fast Driver &amp; you have to pick &amp; drop the patients from injured point to hospital. You have to focus on timer in each level of this gitex ambulance.<br/><br/>Gitex Ambulance Rescue Duty: Emergency Fast Driver Features:<br/><br/>* Engaging ambulance driver missions.<br/>* New ambulance siren HD background sound.<br/>* Endless ambulance doctor journey.<br/>* Different routes across the futuristic city.<br/>* Easy to use ambulance driving controls.<br/>* 10 challenging missions to play.<br/>* Full 3D city environment with realistic graphics.<br/>* Transport the seriously injured people to the hospital.<br/><br/>You are an ambulance rescue driver. And you are provided with different rescue missions. You are the best ambulance driver of 2017. Fulfil your rescue duty in your areas. This city is in thrill and accident and you have to safely drive your city ambulance and take injured people to the nearest hospital. The best ambulance game of 2018 is here!<br/><br/>In this rescue ambulance: road accident simulator game you have been given to perform the role as skilful ambulance driver, keep in your mind that seconds are counting as you make your way through the traffic of the realistic city environment. In these real new ambulance doctor games 2018, we give you multiple siren ambulances ranges.<br/><br/>Gitex Ambulance Rescue Duty game has beautiful futuristic environment. You will feel like you are driving ambulance in your real life. Always be alert when you are on duty because an accident can happen anytime and anywhere so be an active ambulance driver.<br/><br/>In this ambulance games: 911 Rescue simulation 3d game your duty is to accept paramedic rescue challenges and drive your ambulance to save injured peoples. We will give you realistic crazy rescue 911 helpline number that people used to take your emergency ambulances services.<br/><br/>If you enjoy playing driving simulator games, then this ambulance rescue simulator like Gitex Ambulance Rescue Duty: Emergency Fast Driver is best for you. You have to play the role of an ambulance driver, who has to tackle the hustle and bustle of the busy city alone. Complete multiple missions of ambulance doctor games in the realistic 3d environment of winter 2018 and make sure to keep an eye on the running timer. <br/><br/>This ambulance game has many rescue missions and you must be in a state of emergency all the time. You can driving around the big city, suburbs, construction sites, parks and even the beach. It's crazy how the city lives - people are walking, cars are crossing. Get in your ambulance, fasten your seat belts and become a city traffic racer.<br/><br/>Drive one the best ambulance rescue driving game of 2018. Gitex Ambulance Rescue Duty: Emergency Fast Driver simulator full of actions that you need to take on emergency calls for taking patients from emergency spot to hospital in minimum time. Ambulance driver job on mega city roads is dangerous so be careful!<br/><br/>Lives are at stake; it’s a rescue mission! Rush your ambulance around the city to get to the scene of accident on time. Drive fast, yet safely, and provide first aid in the state of emergency. Turn on the sirens and push the throttle!<br/><br/>If you have interest in ambulance games, city rescue and emergency driver games then this Ambulance Rescue game of 2018 is just developed for you! Get ready to play such crazy emergency driver game of 2018!<br/><br/>WE VALUE YOUR FEEDBACK:<br/><br/>Gitex Ambulance Rescue Duty: Emergency Fast Driver will be updated according to your suggestions. Don't forget to leave a review with your feedback.", "metacritic": null, "released": "2017-12-23", "tba": false, "updated": "2019-10-22T14:23:55", "background_image": "https://media.rawg.io/media/screenshots/5bc/5bcc9ac13cf1afc49a386c1ede5b0f53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": ["RPG", "Simulation"], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}