{"id": 758631, "slug": "keno-games-with-cleopatra", "name": "Keno Games with Cleopatra", "name_original": "Keno Games with Cleopatra", "description": "VEGAS STYLE KENO GAMES! All-time casino favorites right at your fingertips.<br/><br/>The only app with the most popular keno games.<br/><br/>- CLEOPATRA KENO<br/>- Classic Keno<br/>- Multi-Card Keno<br/>- Four Card Keno<br/>- Ultimate X Keno<br/>…with more of your keno favorites on the way!<br/><br/>Tons of free coins to play every day.<br/><br/>Keno is a classic casino game that is fun and easy to learn. Players select a bet amount and choose between 2 and 10 numbers on their Keno card. Numbers are then randomly drawn and appear on the keno card as they are drawn. The more numbers you pick correctly, the more you win!<br/><br/>Cleopatra Keno has a free play bonus if the last number drawn hits a marked spot in a winning game. The bonus is 12 free plays where any wins are multiplied by two.<br/><br/>Multi-Card Keno is Classic Keno, times twenty! Fill up to 20 Keno cards and let the good times roll.<br/><br/>Ultimate X Keno takes Four Card Keno and combines the thrills of the Ultimate X multiplier action to create the most excitement ever experienced in a keno game.<br/><br/>This game is intended for an adult audience (21+) for amusement purposes only and does not offer ‘real money’ gambling, or an opportunity to win real money or prizes based on game play. Playing or success in this game does not imply future success at ‘real money’ gambling.", "metacritic": null, "released": "2021-12-20", "tba": false, "updated": "2022-03-25T05:14:29", "background_image": "https://media.rawg.io/media/screenshots/3e9/3e9f8236302f03a18467a78751c6016f_9NV6zYc.jpg", "website": "https://www.videopoker.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VideoPoker.com"], "genres": ["Card"], "publishers": ["Action Gaming"], "esrb_rating": "Mature"}