{"id": 758608, "slug": "terror-of-hemasaurus-demo", "name": "Terror of Hemasaurus Demo", "name_original": "Terror of Hemasaurus Demo", "description": "Full version of Terror of Hemasaurus is coming soon! You can wishlist it here\n<br/><br/>\n\nJOIN US ON DISCORD\n<br/>\n\n<br/><br/>\n<br/>\nPlay as a giant monster and wreak havoc on humanity in this retro city smash ‘em up! Punch buildings, slap helicopters, eat humans, kick cars – enjoy multiple ways to cause carnage! Satisfying arcade action and mindless destruction for up to 4-players!\n<br/>\n<br/>\n<br/>\n<br/>\nEarth is on the brink of a climate catastrophe! The Church of the Holy Lizard hatches a dubious plan to save humanity from its own reckless disregard of the planet – unleash a monster to kill, destroy, and inflict terror!\n<br/>\n<br/>\n<br/>\n<br/>\nEmbark on a rampaging trail of total devastation across multiple stages as one of four recently defrosted monsters. Roar with delight as you stomp terrified citizens and pulverise buildings in an apocalyptic, retro arcade blast of awesome monsters, satisfying destruction, and farcical fatalities!\n<br/>\n<br/>\n<br/>\n<br/>\nTerror of Hemasurus is the latest game from Super Blood Hockey creator, Loren Lemcke.\n<br/>\n<br/>\nMONSTERS!\n<br/>\nHemasaurus! Clocksloth! Salamandrah! Autonomous Hemasaurus! Four terrifying (but also kind of adorable) beasts, each with their own killer moves!\n<br/>\n<br/>\nDESTRUCTION!\n<br/>\nExplosive pixel devastation and mayhem on a monstrous scale! Reduce buildings to dust. Topple skyscrapers. Destroy everything!\n<br/>\n<br/>\nDEATH!\n<br/>\nHurl humans into helicopter blades! Butt slam into crowds of terrified citizens! Eat people for nourishment! Smoosh them all to save the planet!\n<br/>\n<br/>\nSTAGES!\n<br/>\nDo what the game tells you across a variety of levels! Kick cars into buildings! Rescue the cats and dogs! Total a tower in record time!\n<br/>\n<br/>\nFRIENDS!\n<br/>\nGot buddies? Good for you! Put them to use by getting them to join you for some local co-op carnage! Up to four friends can cause terror together!\n\n<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-25T04:57:02", "background_image": "https://media.rawg.io/media/screenshots/809/809b6bbe52feb5a627adbcd75c0fc221.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Loren Lemcke"], "genres": [], "publishers": ["Digerati"], "esrb_rating": null}