{"id": 758681, "slug": "racing-kings", "name": "Racing Kings", "name_original": "Racing Kings", "description": "Racing kings driving simulation game brings a revolution to mobile car racing games. This game provides everything you want in a traffic racing game - exotic cars, detailed customizations, body decals, rims, different playing modes, multiplayer system and more. Download the game now, master driving as if you were in a car driving school and experience the thrill of racing through traffic.<br/><br/><br/>Car Customization Options<br/>---<br/>Detailed car models<br/>Customize vehicle body color<br/>Tinted windows<br/>Various modern rim styles <br/>Cool decals for your vehicles<br/>and much more!<br/><br/><br/>Car Power Options<br/>---<br/>Upgrade max speed<br/>Upgrade acceleration<br/>Upgrade brakes<br/>Upgrade handling<br/><br/><br/>Game Modes - There are 4 popular racing modes available<br/>---<br/>One way traffic mode<br/>Two traffic mode<br/>Time attack mode - reach as far as you can and collect as many points as you can in a limited time frame<br/>Free ride mode - don't want to collect points, just want to drive? Select this mode and drive as long as you want, no crashes or anything, just pure driving through traffic<br/><br/><br/>Multiplayer<br/>---<br/>Bet the amount you want and try to beat other players while driving through traffic and see who reaches the finish line first<br/><br/><br/>Unique Maps<br/>---<br/>Choose between 4 different maps<br/>Forest map<br/>Seaside town<br/>Desert<br/>Snow", "metacritic": null, "released": "2022-01-06", "tba": false, "updated": "2022-03-25T05:41:45", "background_image": "https://media.rawg.io/media/screenshots/699/699bc27db25357e2b7780ae6401dc3ee.jpg", "website": "https://mbplus.hr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MB Plus"], "genres": ["Simulation", "Racing"], "publishers": ["MB PLUS"], "esrb_rating": "Everyone 10+"}