{"id": 758705, "slug": "ef-defense", "name": "EF Defense", "name_original": "EF Defense", "description": "The Darkness surges upon the continent of Akaros, the land of abundance.<br/>Rally the Heroes of various tribes and form a strong defense for the showdown!<br/><br/>1. Unique Heroes of various tribes<br/>Heroes of varying tribes have gathered to defend the Akaros continent!<br/>Train unique and powerful Heroes to unlock their hidden abilities!<br/><br/>2. Diverse battlefields and powerful, specialized traps <br/>Leave behind the simple, boring backgrounds and collect growing maps that assist you in protecting the kingdom!<br/>A monster from beyond the ice wall will roar, and terrorize enemies<br/>and the arm of a god will appear through a portal to push enemies away, aiding you in your fight!<br/><br/>3. Protectors that protect the battlefield with powerful skills!<br/>Despite their cuteness, Protectors aren’t just the mascots, but possess the power to turn the tide of a battle!<br/>Collect Protectors that hatch from tiny eggs, take control of the battlefield, and protect their allies!<br/><br/>4. This isn’t just about Defense!<br/>Ditch the traditional model of just blocking for defense and experience all sorts of different styles of combat!<br/>The Frontier, to conquest the enemy bases beyond the defense that only protects the kingdom!<br/>The Arena, to win the honorable combat against powerful opponents for the position of the strongest!<br/>The Grand Arena, to fight across three different battlefields to claim victory!<br/>The Tower of Trials, to climb floor by floor, defeating the guardians of each stage!<br/><br/>5. A variety of unique enemies!<br/>Enemies, that only walk or fly from one side to the other? Too easy!<br/>[Frog Defense], where you face off against enemies that fall from the sky and skip floors. <br/>[Goblin Defense], where enemies appear on random floors through portals.<br/>[Ghost Elimination], where you face off against enemies that attack both the earth and the air.<br/><br/><br/>■ Customer Support<br/>- You can receive more detailed guide by indicating your ID when sending us the inquiry.<br/>- The basic information are indicated automatically in the inquiry mail if sent via 1:1 Inquiry menu in Game Setting screen.<br/>- Customer Support: cs@managf.com<br/>- Official Facebook : http://www.facebook.com/efdefenseglobal/<br/><br/>■ Note<br/>- By downloading or installing this app, you are considered to have agreed to the terms and conditions of Mana Game Factory.<br/>(Terms of Use &amp; Privacy Policy: http://policy.managf.com/policy.html)<br/>- This game contains in-app purchases of items to help you with the game.<br/>- In-app purchases can be restricted through your device settings.<br/>For more information, please visit https://support.apple.com/ko-kr/HT204030.", "metacritic": null, "released": "2022-03-14", "tba": false, "updated": "2022-03-25T05:54:57", "background_image": "https://media.rawg.io/media/screenshots/168/168c80ec76071c88f4e81207c0c1c66a.jpg", "website": "http://www.managf.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MANA GAME FACTORY"], "genres": ["Strategy", "Simulation"], "publishers": ["MANA GAME FACTORY"], "esrb_rating": "Everyone 10+"}