{"id": 75876, "slug": "furious-boat-racing-2017", "name": "Furious boat racing 2017", "name_original": "Furious boat racing 2017", "description": "RACE AGAINST YOUR ENEMIES IN THIS EXTREME BOAT RACE SIMULATOR<br/>Viking Studio would like to welcome you to our first speed boat simulator game. Furious boat racing simulator games have never been this much fun! How fast can you go as a driver speedboat racer? Even more important, how fast can you go on a Furious boat racing and have perfect handling control at the same time? This game gives you the opportunity to show the world you are a talented driver speedboat racer and a hero in this fast and furious game race.<br/><br/>This action-packed power ship racing simulation game is full of epic ship races against your enemies in your insane speed boat. Cruise ships are nice and look good, but nothing beats a fast speed boat cruising on the open ocean.<br/><br/>This game is not like other ship driving simulator games, Ferry boat racing, power boat racing or Jet Ski simulator games. The speed boat ships in this Furious boat racing simulator are fast, strong and perfect for the ultimate speed boat race.<br/><br/>Game play of Furious boat racing 2017:<br/>This is pretty awesome boat racing game ever! Gameplay of Furious boat racing is simple, you have to defeat your opponent to win the Race. It’s Knockout mode game its mean if you want to access new level then you shouldn’t be remain in Last position.<br/>Will you become the fastest pilots of speedboat Racing? There is only a way of knowing this if you win the title.<br/><br/>Furious boat racing Features:<br/>•\tStunning 3D graphics<br/>•\tSmooth &amp; realistic boat handling<br/>•\tAwesome background sounds<br/>•\tControl ships like epic cruise ships in this ship simulator<br/><br/>Race your hydroplane powerboat in the ultimate race and crush your opponents in knockout mode in Furious boat racing now! Furious boat racing is best acclaimed and most popular 3D motorboat racing game. Furious boat racing combines excellent visuals and sound with stunning gameplay and knockout competition to create a new type of hydroplane racing experience.<br/><br/><br/><br/><br/>How to Play Furious boat racing 2017:<br/>•\tPress Race button to increase speed<br/>•\tPress Left button to move left side.<br/>•\tPress Right button to move right side.", "metacritic": null, "released": "2017-03-20", "tba": false, "updated": "2019-10-22T14:23:55", "background_image": "https://media.rawg.io/media/screenshots/d81/d81dcd6a5f8ee97b88a171f517813f38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": [], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}