{"id": 758780, "slug": "immune-defense-ulsan-itchymaxi", "name": "Immune Defense (ulsan, ItchyMaxi)", "name_original": "Immune Defense (ulsan, ItchyMaxi)", "description": "<p>If you play tested this game, feel free to fill out this feedback survey:\r\n</p>\n<p>https://docs.google.com/forms/d/e/1FAIpQLSfSQMFYozectbJhprmO6JuUu1Cs-5WyxRyHX5-Q...<br/></p>\n<br/>\n\n<p>Advanced Instructions</p>\n<p>Controls:</p>\n<p>1: Spawn a Neutrophils cell (10 glucose). Modes: Chase, and Return. Neutrophils have an ability that allows them to absorb smaller enemies on contact, gaining food when doing so. They can be put into Return mode if they have collected any food. Return mode allows them to head to the player and transfer any food they have collected to the player. </p>\n<p>2: Spawn a Monocytes cell (15 glucose). Modes: Chase. Monocytes has a multi-target attack that allows him to damage 2 enemies at once, or one enemy twice.</p>\n<p>3: Spawn a Eosinophils cell (25 glucose). Modes: Chase, and Sentry. While in Sentry mode, is stationary but gets a ROF increase. </p>\n<p>4: Spawn a Basophil cell (30 glucose). Modes: Chase. Shoots a missile that damages anything in its explosion radius. </p>\n<p>WASD to move.</p>\n<p>Q: Puts selected cells into their primary mode.</p>\n<p>E: Puts selected cells into their secondary mode, if possible. (Shortcut) If there is no selected cells, then all Neutrophils cells will go into return mode, if able.</p>\n<p>Selection options:</p>\n<p>LeftClick a cell to add it to selection</p>\n<p>Click and Drag to do a rectangle selection</p>\n<p>RightClick to clear your selection</p>\n<p>ESC to pause</p>\n<p>Tips:</p>\n<p>If having trouble getting the hang of the game, try spawning more Neutrophils and taking advantage of their Return mode and absorb ability to generate more food. </p>", "metacritic": null, "released": "2022-03-24", "tba": false, "updated": "2022-03-25T06:24:33", "background_image": "https://media.rawg.io/media/screenshots/506/506542cc8f6606a29c6d44ba92352d12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ItchyMaxi", "ulsan"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}