{"id": 758701, "slug": "spiderninja", "name": "SpiderNinja", "name_original": "SpiderNinja", "description": "Throw, hook, pull, jump…<br/>This is an exciting puzzle action game, featuring a Japanese ninja and his grappling hook. Make full use of the grappling hook like spider silk to make the ninja's way through, and lead him to the goal by collecting cherry blossoms on all 140 stages.<br/><br/>It can be easily controlled with one hand, and is enjoyable for anyone! Physics engine brings you this simple yet profound system. Just touch and let go of the screen.<br/><br/>-how to play-<br/>* The ninja will spin and jump upwards when he is on the ground (or when touching an obstacle), with a tap on the screen.<br/>* The ninja will throw the grappling hook to the direction where he is facing, with a touch on the screen when the ninja is in the air. The hook will be fixed at the point when you let your finger off the screen.<br/>* The ninja will pull on the grappling line and will make a long jump with a long continuous touch on the screen, when the ninja is clinging to the grappling line.<br/>* The ninja will make a short jump with a short touch on the screen, when clinging to the grappling line.<br/>* The grappling hook will come off and the ninja will not jump, with a tap on the screen when clinging to the grappling line.<br/><br/>-tips-<br/>* The grappling line is elastic. If you jump when the line is expanded all the way, the ninja is able to jump further than usual.<br/>* When the ninja is spinning in midair, the spin will stop when you throw the grappling hook. And with a slight tap on the screen right after the throw, the ninja will pull back and restore the grappling hook. Using this movement allows you to face in any direction you want in midair.<br/><br/>Master the handling of the grappling hook, and you will be able to go through any difficult stage! Please try this game to become a grappling hook master! We'll be waiting for your challenge.", "metacritic": null, "released": "2011-10-05", "tba": false, "updated": "2022-03-25T05:52:50", "background_image": "https://media.rawg.io/media/screenshots/9d1/9d12b4fb99428cffebad6c4401410195_q6F5r77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iLeaf"], "genres": ["Action", "Puzzle"], "publishers": ["Atsushi Hirasugi"], "esrb_rating": "Everyone 10+"}