{"id": 758706, "slug": "cooking-town-restaurant-game", "name": "Cooking Town - Restaurant Game", "name_original": "Cooking Town - Restaurant Game", "description": "Cook, decorate your restaurant and serve your customers the best dishes! Start a highly addictive time management game in which you can build your restaurant, decorate the buildings of the block, and make it a cooking paradise, with a more refreshing operating experience! <br/><br/>Welcome to Cooking Town, and your grandma and friends are in urgent need of help - the family restaurant, and this once bustling gourmet town, is disappearing because of excessive real-estate development.<br/><br/>Features: <br/>● Rebuild various themed restaurants and shops such as burger restaurants, pet shops, dessert carts, and coffee houses. <br/><br/>● Cook hundreds of cuisines of characteristics throughout the world. <br/><br/>● In-game boosters such as overcook protector, cook accelerator and auto dish distributor will make you a great chef! Join the game to discover more possibilities!<br/><br/>● Decorate the whole block and all its buildings on your own preferences to make Cooking Town shine again!<br/><br/>● Join a variety of cooking activities, take part in gourment travel on hot air balloons, and record a masterchef TV show! <br/><br/>● Fill your villa and garden with the trophies and medals you won in cooking contests!<br/><br/>● Adopt cute pets, make more friends, and enjoy your time in Cooking Town! <br/><br/>● Interact with town residents and learn about the stories of Cooking Town! <br/><br/>More Gameplay: <br/><br/>1. All you have to do is to slide the screen - it provides better experience on time management. <br/><br/>2. Party Time mode - get more combo hits to pass levels faster! See what you can do!<br/><br/>3. Mean Customers mode - meaner customers with more demands... What will you do?<br/><br/>Come to Cooking Town and leave a wonderful mark in its history! <br/><br/>Enjoy Cooking Town? Follow and join us on Social Media:<br/>Facebook: https://www.facebook.com/Cooking-Town-104492228058544<br/>Instagram: https://www.instagram.com/cookingtowngame<br/>Twitter: https://twitter.com/cookingtowngame<br/><br/>Any question? Feel free to contact us via: cookingtown@outlook.com<br/><br/>PLEASE NOTE: <br/><br/>Cooking Town is FREE for downloading and playing while it provides in-app purchases. You may disable in-app purchases from your device settings.<br/><br/>Privacy Policy: https://sites.google.com/site/magic7privacypolicy/", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-03-25T05:55:33", "background_image": "https://media.rawg.io/media/screenshots/9be/9befcc678c8d9de20feff7e704cc2a49_Bpc56uh.jpg", "website": "http://ogzhimyr.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MagicSeven Co"], "genres": ["Strategy", "Simulation"], "publishers": ["MagicSeven Co"], "esrb_rating": "Everyone 10+"}