{"id": 758846, "slug": "typehack", "name": "Typehack", "name_original": "Typehack", "description": "<p>Typehack is a prototype created for Serious Game Design (GAME 238) at Johnson County Community College.  As such, it should not be viewed as a complete and fully developed game, but rather a concept for what a full typing tutorial game could be.</p>\r\n\r\nMission Statement\r\n<p>Typehack enhances the touch-typing learning experience by reinforcing and rewarding correct hand position and technique through challenging and engaging gameplay as a counter-cyberterrorism agent</p>\r\nGame Summary\r\n<p>Defend the Central Cyber Command (CCC) servers from foreign cyberthreats and look for opportunities to strike back at the hackers using your typing skills.  The faster and more accurate you are, the stronger your defense and the more opportunities to counterstrike you’ll have.</p>\n<p>Players will be instructed on proper hand position and technique and presented a sequence of typing tasks that increase in complexity and speed.  Players will type in keywords to thwart an active hacking attempt on the CCC servers.  Once a threshold level of accuracy and speed are reached, a long phrase is presented as an opportunity counterattack the hacker and shutdown their connection.  Once a hacker is thwarted, the player moves to the next level where the keywords become more challenging to type, the accuracy thresholds become tougher, and the keywords must be entered more quickly.</p>\r\nOverview of Gameplay\r\n<p>Typehack is a story-driven typing tutorial game for PC.  As opposed to a simple drill-style tutorial such as the classic Mavis Bacon Typing or even modern tutorials such as TypingCat.com, Typehack motivates the player to learn and become better through an engaging narrative, skills-based gameplay, and an achievement badge system to reward successful hard work.</p>\r\nPlayer Experience\r\n<p>Much of the life of a counter-cyberterrorism agent is spent behind a keyboard.  If you’re to be successful, you must hone your typing skills to razor sharpness.  Being faster and more accurate than your adversaries is the only way to succeed.  To this end, you will use the keyboard exclusively for game commands and control.  Right from the first screen, the Main Menu, the keyboard Function keys are what you will use to select from the options of setting your character’s name, beginning a new game, loading a previously saved game, viewing the game credits, or quitting the game and returning to the desktop.</p>\n<p>Upon selecting New Game or Load Saved Game, you move to the server room where Winston “Fingers” Gilmore gives you advice on how to position your hands and informs you on the type of keywords you will need to use to thwart the current threat.  As you see the keywords appear on your monitor, you will need to type those words onto the terminal’s command line with your keyboard.  A horizontal timer bar will inform you on how much time you have remaining to enter the keyword in correctly.  As you type, the colour of the keyword will change from amber to green.  Complete the word correctly and within the time limit and you’ll be presented another keyword to type.  Make a mistake, and you’ll have to start typing the keyword in again from the beginning.  When you successfully enter all the keywords for a given mission, you’ll be presented with a counter-attack phrase.  Type this phrase in correctly and within the time limit to close the hostile agent’s connection, defeating their hacking attempt.</p>\n<p>Upon completing each mission, you are graded on your accuracy and speed.  There are three tiers of reward based on how many mistakes you made and how quickly you completed the mission.  The top-tier reward can only be achieved by scoring 100% accuracy and completing the mission in no more than half of the allotted time.  If you run out of time or make a mistake five times in succession, you fail the mission and must start the mission over again.  Each new mission will present you with a more complex typing challenge and decrease the amount of time allowed per keyword.  After completing a mission, you may always revisit the mission and continue to practice and strive for a higher reward.</p>\r\nGameplay Guidelines\r\n<p>All the language used in the dialog and all the keywords and counter-attack phrases will be age-appropriate for early-teen players.  No profanity or sexually explicit words or phrases are allowed.  All submitted character names are checked against a blacklist of words to prohibit inappropriate names being used.\r\n</p>", "metacritic": null, "released": "2022-03-24", "tba": false, "updated": "2022-03-25T06:56:38", "background_image": "https://media.rawg.io/media/screenshots/13e/13ef3b0f2ac3e26998f6ac712fc1d92e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["J. Douglas Patterson"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}