{"id": 75888, "slug": "bus-hill-climbing-simulator-3d", "name": "Bus Hill Climbing Simulator 3D", "name_original": "Bus Hill Climbing Simulator 3D", "description": "Bus Hill Climbing Simulator is a challenging game for iPhone and iPad with realistic physics and awesome 3D graphics.<br/><br/>Drive different buses with cabin and real steering wheel on dangerous roads! Enjoy the natural environments while you are testing your bus driving skills on hill climbing roads.<br/><br/>Drive uphill like a real bus driver directly from the driver position. There are multiple cameras so you can view your bus from different angles. The most realistic downhill bus driving simulator is ready for you to play it for free!<br/><br/>Perform your duty as the pro coach driver on dangerous hill and mountains and prove yourself as an expert Bus Driver. <br/><br/>This hill bus simulator game will give you a real feel of driving heavy vehicle because is made for bus driving gamers. If you like heavy vehicle driving, download this bus hill racing game and enjoy the feel of a real bus driver.<br/><br/>Driving a bus on off road with dangerous turns, steep paths, mountain tops and harsh weather conditions is not as easy as it looks. Try to reach the hill station while driving on these steep hills and mountains path.<br/><br/>Choose from new bus coach from wide variety of buses &amp; hit the road.<br/><br/>Playing this hill climb bus racing game gives you many hours of nonstop coach gaming fun! Playing hill speed driving games have never been this much fun. So get in your real bus and get the experience of the bus hill climbing simulator game of 2017. This is a game for boys and girls.<br/><br/>Bus Hill Climbing Simulator Features:<br/>&gt; Realistic bus physics.<br/>&gt; Bus cabin with steering wheel.<br/>&gt; 6 cool buses with interior view.<br/>&gt; Customize the color of each bus.<br/>&gt; 7 Camera modes: interior cabin view, wheel, top, front, static, cinematic, orbit.<br/>&gt; Multiple driving modes: arrows, steering wheel, accelerometer.<br/>&gt; Attractive gameplay.<br/>&gt; Bus side mirrors, Bus Horn, Hazard Lights, Headlights, Stop and Reverse lights.<br/>&gt; Realistic Environments with different levels: summer, winter, desert.<br/>&gt; Best hill bus sim climb game of 2017.<br/>&gt; offline game<br/>&gt; free game without wifi<br/><br/>Mobimi Games would love to listen your feedback so feel free to share your experience with our hill bus simulator game and help us improve our experience of making the best simulation games for you.", "metacritic": null, "released": "2018-02-28", "tba": false, "updated": "2019-07-29T20:33:35", "background_image": "https://media.rawg.io/media/screenshots/43f/43f70968a8be6db8855a59c5a47e0b07.jpg", "website": "http://www.mobimigames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobimi Games"], "genres": ["Simulation"], "publishers": ["Mobimi Games"], "esrb_rating": null}