{"id": 75893, "slug": "drift-zone-2", "name": "Drift Zone 2", "name_original": "Drift Zone 2", "description": "Sequel to Drift Zone!!<br/>5/5 “Great game! The graphics are unreal, The cars handle perfectly, Get this racing game!”<br/>5/5 “No doubt it's the most addictive game for iOS”<br/><br/>Over 30 different racing tracks are ready for the ultimate sports car driver to burn rubber and compete for gold in the best iOS racing game . Stunning graphics, Unique sports cars especially designed to achieve a realistic driving experience and challenging missions that require both real racing skills and extreme coordination.<br/><br/>-If you are a drift racing enthusiast = This is the game for You! <br/>-Burnout on each challenge = one set of your racing car tires burned! <br/>-Just One rule = You can only score if you are driving sideways<br/><br/>With a wide range of racing cars all ready to drift race and lots of race tracks to compete on this stylish and exciting race game you can be sure you'll drive for hours...<br/><br/>Awesome Industries support safe driving, we strongly advise you not to drag race or perform any type of real racing if you are not a trained racing car driver. This game is intended to remain on you mobile and tablet and not to be taken to the streets, it is both illegal and dangerous to perform these activities <br/><br/>In The Game: <br/>- Fun - Pure car drifting free fun game play<br/>- Speed - Drive cars at crazy speeds <br/>- G-force on every turn<br/>- Shiny rims - Lots of awesome upgrades for your racing car<br/>- Awesome graphics - Real awesome 3D game graphics for racing tracks and cars<br/>- 10 different seasons - Hours of real racing fun across 10 seasons.<br/>- 30 different levels, and this is just the beginning! <br/>- Car customisation - Personalise your car and make it yours<br/>- bullet time -&gt; NEW FEATURE helping drive your drifts to perfections <br/>- leaderboards -&gt; Race against your friends and reach the top<br/><br/>===---Like our fanpage on facebook !---===<br/>https://www.facebook.com/pages/Drift-Zone/548314448598031?ref_type=bookmark", "metacritic": null, "released": "2016-06-23", "tba": false, "updated": "2019-10-22T14:23:56", "background_image": "https://media.rawg.io/media/screenshots/3e6/3e6aaf0073ebed2f8faa522a794d66eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Awesome Industries"], "genres": ["Simulation", "Racing"], "publishers": ["Awesome Industries"], "esrb_rating": null}