{"id": 75901, "slug": "flying-police-car-chase-simulator", "name": "Flying police car chase simulator", "name_original": "Flying police car chase simulator", "description": "Flying Car!<br/>Brand new challenge for car racing enthusiasts!<br/>Flying Car adventurers! Start your engines and get set for the brand new epic in police flying car stunts simulation!<br/>The thrill of driving car on road and meanwhile fly in a sky and perform amazing stunts by collecting rings is super astonishing.<br/>With groundbreaking car models and breath-taking 3D graphics that will also please Flying car stunts simulation enthusiasts. Do a corkscrew stunt, and catch free coins all while you collect maximum rings! Accept the challenge to be the ULTIMATE flying car stunt driver!<br/>Enjoy different luxury flying car models with customization and upgrades! Perform high flight to collect maximum rings and claim to be the ultimate flying car champion.<br/>Push on the throttle, steer well, expand your car wings and fly your awesome cars. Challenge your car flying skills in the most amazing and gazing car flying game ever to be released!<br/><br/>Turn on the police sirens and patrol the sky and streets of the city. With the latest police game flying car simulator, enjoy both fast driving and realistic flight flying in the futuristic police vehicle. Watch the wings transform from the car to take off and fly high in the sky. Get straight into the action that is the flying police car simulation!<br/>Take control of the steering wheel of a highly modified police car. Do loops and flips, and tricks, drift, crash, boost, and slide all around the city streets and the wide open sky above it!<br/><br/>Activate airplane flight mode and watch the wings transform from the patrol cruiser car turn into a unique flying police car!! In an instance you went from a top car driving expert to a professional airplane pilot!<br/><br/><br/>!!!DOWNLOAD FOR FREE!!ONLY ON IOS!!!<br/><br/><br/>-Fly anywhere in massive open world city environment, dodge and weave between skyscrapers and flying traffic!<br/>-Perfect the skill of a flying car and become the world's best pilot<br/>-Go to extreme speeds with super charged nitro boosts<br/><br/>Flying Police Car Simulator is for all gamers, from novices to experts, flight and driving simulation game fans, everyone can enjoy the best experience in one game!<br/><br/>GAME FEATURES:<br/>Beautiful HD Graphics <br/>Real life racing car modified for flight capability<br/>Realistic flying car physics<br/>Number of collectables to collect<br/>Amazing and Challenging 3D Environment For Flying Car Stunts<br/>Modern Flying Car Models<br/>Responsive and Intuitive flying &amp; Driving Experience<br/>Smooth &amp; easy Controls<br/>Engine, Brake and Boost Updates<br/>Guaranteed Fun Through Carefully Designed Levels<br/>Cool visual and sound effects<br/>Numbers of Amazing Flying car Missions", "metacritic": null, "released": "2016-11-30", "tba": false, "updated": "2019-10-22T13:54:35", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a96c267b32fcba9633a0c276b6aa8a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Darshit Patoliya"], "genres": ["Sports", "Racing"], "publishers": ["Darshit Patoliya"], "esrb_rating": "Everyone 10+"}