{"id": 759096, "slug": "nothing-to-loose", "name": "Nothing to loose", "name_original": "Nothing to loose", "description": "<p>How to :</p>\n<p>Pour se déplacer : utiliser les touches du clavier</p>\n<p>Lorsque vous changez de direction, le personnage se tourne dans la direction choisie pour permettre de viser sans avoir à se déplacer. </p>\n<p>Pour tirer : touche X</p>\n<p>Principe du jeu : faire le meilleur score possible.  Les niveaux sont infinis et la difficulté augmente au fur et à mesure qu'on avance dans les niveaux.</p>\n<p>Lorsque vous tuez un zombie il fait tomber un pack de balle. Les balles du dernier zombie de la map sont perdues.</p>\n<p>Lorsque vous êtes pris en chasse et que le zombie se cogne sur un objet, il reste quelques secondes sans pouvoir bouger. Il ne reprend pas sa chasse tout de suite après, il retourne à ses occupations pendant un moment.</p>\n<p><strong>Servez-vous de ces astuces pour faire le meilleur score et partagez le dans les commentaires ! :)</strong></p>\n<p>Histoire : Billy est un militaire fâché avec les zombies et il a décidé d'en découdre avec eux. Il n'a rien à perdre mais au cas où... Aidez Billy à les abattre tous !</p>\n<p>Vous noterez que Billy est bien camouflé un niveau sur 2, c'est fait exprès :)</p>\n<p> Ce jeu a été réalisé dans le cadre de la gamejam #35 de Gamecodeur</p>\n<p><strong>Je suis élève de Gamecodeur depuis 2018. </strong>J'ai codé pendant un an et demi et je suis tombé sur un \"pallier de progression\". Je n'arrivais plus à m'améliorer en Lua, le passage au C# était trop flou pour moi et d'autres projets de vie faisant j'ai plus ou moins abandonné petit à petit. J'ai tenté plusieurs fois de m'y remettre sérieusement mais faute de pratiquer j'avais tout oublié. Ca devenait de plus en plus dur de reprendre jusqu'à laisser totalement tomber.</p>\n<p>Problème : Ca me manquait.  En février cette année j'ai décidé de reprendre tous les cours Gamecodeur depuis le début. Je me suis dit que même si je me voyais peu avancer si j'avais persévéré je saurai probablement beaucoup mieux coder aujourd'hui. Ca va me servir de leçon.</p>\n<p>Je retrouve à la fois mes \"sensations\" et les logiques que j'avais acquise (bien que j'ai pas encore retrouvé mon niveau précédent).</p>\n<p>Je venais tout juste de terminer le cours sur l'IA justement quand David à annoncé la gamejam !</p>\n\n<p><strong>Post mortem :</strong><br/></p>\n<p>Pour bien remettre en pratique j'ai décidé de mettre en pratique sur la pico 8 !</p>\n<p>Je n'aimais pas ça avant, j'ai commencé à plus ou moins l'aimer par \"flemme\" de bosser des graphs ! Je suis très mauvais à ça et à chacune de mes gamejam ça m'a fait perdre un temps de dingue (+60% du temps passé à dessiner des trucs moches).</p>\n<p>J'adore Pico8 maintenant ! Je vais prochainement tenter coder sur un éditeur de code plus standard (sublime ou vs code) car la police de caractèrePico8 pique les yeux quand on y reste un moment et le voyage constant entre les tabs est fastidieux.</p>\n<p>Graphismes, sons et code est 100% de moi, je n'ai rien copié/collé du cours. Je me suis surpris de ne pas avoir besoin du cours comme antisèche, je suis très fier de ça. Après l'atelier IA j'avais passé pas mal de temps à améliorer les comportements. Je n'ai pas eu le temps de tout recoder, j'ai même plutôt une IA simpliste mais ça fonctionne.</p>\n<p>J'avais prévu de faire au moins 4 ou 5 maps différentes mais j'ai préféré me focus sur les fonctionnalités. Je pourrai à tout moment rajouter des map au fur et à mesure.</p>\n<p>J'ai dû y passer une bonne vingtaine d'heures, max 30h.</p>\n<p>Lua est vraiment un langage unique, très simple. On couche rapidement les idées, pas de perte de temps.</p>\n<p>L'environnement tout en 1 de la pico-8 est super. Pour apprendre et réapprendre c'est topissime. On met rapidement les idées en place.</p>\n<p>Je pense me resservir prochainement de cet outil soit pour les jams (publication et partage facile) soit pour des idées persos.</p>\n<p>Le gros désavantage est la petite palette de couleur. Pas de perte de temps sur le choix mais justement : trop peu de choix. Le jeu est très gris sur la première map et très vert sur la seconde. </p>\n<p>Je n'ai pas encore essayé l'éditeur de musique, le fonctionnement est encore un peu flou pour moi.</p>\n<p>J'appelle ce jeu un proto car il y a encore quelques bugs et quelques fonctionnalités pas codées. Par exemple je voulais que les balles ricoches sur les objets (poubelle, chars, etc). J'aime beaucoup l'effet de vague de zombie qui popent du même endroit (après le level 2) mais c'est un \"bug\", ils ne sont pas sensés apparaitre de cette façon.</p>\n<p>Pour autant je pense que ça pourrait être un petit jeu steam (gratuit ou à 1 ou deux euro) avec du travail, quelques graphs plus pro, quelques maps en plus... Pourquoi pas plus tard...</p>\n<p>C'est surement très présomptueux mais ce jeu me fait penser au jeu Monaco : What's Yours Is Mine.</p>\n<p>Merci de m'avoir lu jusqu'ici !</p>", "metacritic": null, "released": "2022-03-23", "tba": false, "updated": "2022-03-25T08:22:35", "background_image": "https://media.rawg.io/media/screenshots/efb/efb16c0367924dcd3ce7f343ac6b7ee9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Baishin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}