{"id": 759141, "slug": "striqer-duqs", "name": "striqer duqs", "name_original": "striqer duqs", "description": "<p><strong>MUST USE CONTROLLER</strong><br/></p>\n<p><strong>PROTOTYPE</strong></p>\n<p><strong>CONTROLS (</strong><em>based on Xbox mappings</em>)</p>\n<p><strong>LT</strong> (<em>hold</em>)  &gt;  possess ball if close enough</p>\n<p><strong>RT </strong>(<em>hold</em>)  &gt;  sprint</p>\n<p><strong>A   </strong>&gt;  pass ball - hold for more power</p>\n<p><strong>B   </strong>&gt;  shoot ball - hold for more power</p>\n<p><strong>LB/RB</strong>  &gt;  adds curve to shots</p>\n<p><em>striqer duqs</em> is a project I spent many weeks on a few months back.  There is not an actual soccer \"game\" ready to be played, but you can do free play and run around and practice some cool curving shots!<br/></p>\n<p>Where I went wrong on this project was in the fundamental way I built it - I did not use a component-based structure in building it up.  Static classes had just \"clicked\" for me at the time, and I basically made a \"God Class\" that is nearly impossible to maintain.  </p>\n<p>The problem is not so much this class, as it is just a helper class, but rather with how I built everything around it.  The class is awesome, has tons of overloads, and makes building a soccer game tremendously easier.</p>\n<p>One thing I'm really proud of with this project is the camera system.  I used Cinemachine and its state system to swap the camera from player to player whenever they gain possession.  It turned out really well in my opinion.</p>\n<p>The shooting is also something fun to do - just stand at midfield and take shot after shot (the ball moves to center when exiting field bounds).  You can curve the shot by holding RB or LB.   The longer you hold shoot and RB/LB, the more spin you will have on your shot.</p>\n<p>I can't think of another project I've done that I spent more time on than this one.   Making and publishing a soccer game is a big goal of mine.  I play the Gamecube version of Mario Strikers with my son and we both have a blast playing it.  I'd love to make something similar one day.</p>\n<p>I plan on continuing this project one day, but I'm going to need to start fresh.  I will likely use the static class I was talking about earlier and build a flexible component-based game around it to avoid it becoming unmaintainable, which is exactly what this project turned into unfortunately.</p>\n<p>It still taught me a ton and I have no regrets in doing it as I think I still have a skeleton for what could be one day a great arcade-style soccer game.</p>\n<p>The audio synthesizer in the main menu is also really cool to me, though I can't take credit for that - I used an asset from the Unity Asset Store  to accomplish this.</p>\n<p>You can find the code for this at my Github.  You can find the \"God Class\" I was referring to at: <strong><em>/Scritps/Util/Game.cs  *</em>p</strong><strong>lease note</strong> - I only version controlled the \"Assets\" folder of this project.</p><p>Please let me know what you think!</p>", "metacritic": null, "released": "2022-03-23", "tba": false, "updated": "2022-03-25T08:38:15", "background_image": "https://media.rawg.io/media/screenshots/536/536bc61b6fd4c7346c68b87648c0efe1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["duqgames"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}