{"id": 75922, "slug": "flying-car-simulator-2018", "name": "Flying Car Simulator 2018", "name_original": "Flying Car Simulator 2018", "description": "Flying car games are the newest trend on mobile and brings you an excitement new gameplay mode over the classic car driving simulator games.<br/><br/>Our Flying Car Simulator 2018: Air Stunts game gives you the opportunity to drive cars around the city streets and even above the tall skyscrapers.<br/><br/>Drive fast (over 60km/h) in order to activate the airplane flight mode and take off with your car. At a press of a button the wings will come out and you will be in a flying car ready to explore the open world. Sky is the limit now! You will have total freedom and you can perform air stunts, complete missions or simple explore the open world. If you want to get to extreme speeds with your vehicle you will have to get more speed before you transform into an flying vehicle. Another option to became a fast flying car is to get a lot of altitude, then disable flight mode to get in a free fall while the front of the car is facing down and just before you crash enable the wings and glide at high speed.<br/><br/>In order to unlock new cars you have to complete all the missions designated to each car: both driving and flying tests.<br/>In the car driving test hard you will have to complete all the checkouts while driving your car before the timer reaches zero. <br/>In the car flying test hard you will have to pilot your car throught the checkouts (yellow circles) before you run out of time.<br/><br/>Flying car simulator 3D games give you the opportunity to be an auto driver but also a plane pilot by flying your futuristic car in mid air. You can take off in your flying car from both the city streets and the off road area.<br/><br/>Glide high in the sky like a true expert plane pilot and enjoy the views of the city from above. Pilot you car with care because there are also other cars floating around and you don't want to crash into them and fall to the ground.<br/><br/><br/>Flying Car Simulator 2018 - Game Features:<br/>- Open world city environment<br/>- Stunning HD Graphics<br/>- Realistic car driving physics <br/>- Intuitive mobile controls<br/>- Multiple camera angles<br/>- Simulated airplane flight physics<br/>- Offline Play (No WiFi)<br/><br/>Download now and enjoy total freedom and endless hours of fun in your own futuristic flying car! Download more 3D games from Mobimi Games!", "metacritic": null, "released": "2018-02-18", "tba": false, "updated": "2019-07-29T20:33:24", "background_image": "https://media.rawg.io/media/screenshots/5fb/5fb2e9bbf4b8889b45b11794871cc0d1_cOBAupV.jpg", "website": "http://www.mobimigames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mobimi Games"], "genres": ["Action", "Simulation"], "publishers": ["Mobimi Games"], "esrb_rating": null}