{"id": 75929, "slug": "ambulance-simulator-3d", "name": "Ambulance Simulator 3D", "name_original": "Ambulance Simulator 3D", "description": "Ambulance Simulator 3D is the best simulator of ambulance of emergency in 3D. Try yourself as a real rescue worker and feel on the practice, what is the hospital delivery after accidents and how will an ambulance save lives. <br/><br/>You are an ambulance car driver, and only your agility, alertness and courage determine -  Will the doctors and paramedics rescue the patient? Take calls from the field of emergency and accidents, rescue people who become ill or injured or even have a deal with gang shootings. Do not forget that you are playing against not only the time: dense traffic, the city filled by the cars and ran out of gas throw a real challenge to your abilities.<br/><br/>Features:<br/>- 8 ambulance cars: from the most legendary Russian ambulances to modern German cars<br/>- Different camera position for your comfort: choose from the outside of the cat to a direct view from the salon, where doctors and paramedics are trying to save patient<br/>- completely realistic medical equipment: from the couch to the emergency wheelchair<br/>- The Real City with Unique Traffic control system with AI: traffic jams, accidents and the ability to use a siren and flashing lights<br/>- Gas control in a real-time: don't forget to visit a gas station<br/>- Unlimited set of accidents for emergency calls: car accidents, injuring, heart attacks, helping people on the streets, fire, and even wounds after gang warfare<br/>- Progress control system: check the counter of successful calls and unlock new ambulance cars<br/><br/>Always wanted to know how does Ambulance on call work? Wanted to see how to save lives, making your way through the dense traffic with a siren? Then the Ambulance Simulator 3D - your choice!", "metacritic": null, "released": "2015-11-12", "tba": false, "updated": "2019-07-29T20:49:22", "background_image": "https://media.rawg.io/media/screenshots/660/66066ebbb2d24791365f497272ebff7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oleg Andreev"], "genres": ["Simulation", "Racing"], "publishers": ["Oleg Andreev"], "esrb_rating": null}