{"id": 759657, "slug": "cat-mouse-itch-lemonl1ke", "name": "Cat & Mouse (itch) (LemonL1ke)", "name_original": "Cat & Mouse (itch) (LemonL1ke)", "description": "<p>My second project for DATT2300-Game Development I at York University. A simple version of my board game for the project1 of that course. Also, my first game uses this ingenious engine, Pico-8. </p>\n<p>Since this is only a simple version, the gameplay might be boring. If you are interested, I suggest taking a look at the \"complexed\" version of this<em> Cat &amp; Mouse</em>, a board game with a unique map design and different types of interesting cards. It is a free workshop item published on steam made by Tabletop Simulator and here is the link: https://steamcommunity.com/sharedfiles/filedetails/?id=2747751423</p>\r\nControls\r\n<p>Press \"<strong>X</strong>\" on your keyboard to start the game. Press \"<strong>C</strong>\" on your keyboard to roll a die so that you can navigate your character by using the <strong>arrow keys</strong>.</p>\r\nRules\r\n<p>The cat must catch all the mice before they collect three pieces of cheese on the board. Meanwhile, the team mouse's goal is to collect the cheese. </p>\n<p>Players can move their character in any direction as they want basing on the number of the die they rolled. However, all the characters can't jump over a wall block and should only roll the die once per turn. The cat takes turns first and then the gray mouse and then the brown mouse.</p>\n<p>Additionally, team mouse has a feature that after they collect one cheese, their number six of the die is replaced by number two. And after they have collected two cheese, their number five of the die is replaced by number one as well. </p>\r\nCredits\r\n<p>All the codes, art and music are designed by LemonL1ke. (me, the publisher). Additionally, I wanna say \"thank u\" to these two Youtube channels as they really help teach me how to use the Pico-8 engine. I highly recommend them to anyone who wanna try and learn the engine Pico-8. </p>\n<p>Lazy Devs: https://www.youtube.com/c/LazyDevs/featured</p>\n<p>Gruber: https://www.youtube.com/c/Gruber_Music</p>", "metacritic": null, "released": "2022-03-22", "tba": false, "updated": "2022-03-25T12:08:47", "background_image": "https://media.rawg.io/media/screenshots/d5c/d5cc948a26f8c53c02c4234f98bfcf68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["LemonL1ke"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}