{"id": 759837, "slug": "writers-block-tic-toc-games", "name": "Writer's Block (Tic Toc Games)", "name_original": "Writer's Block (Tic Toc Games)", "description": "<p>Writer’s Block is a roguelike word game where writing is fighting. \r\n  </p>\n<p>Enter the wondrous world of an author’s imagination. Battle mental  monsters standing in the way of writing a book. Spell out words to fight  absurd opponents and evade their devious abilities. Your vocabulary  means the difference between victory and defeat.\r\n    </p>\n<em>\n</em>\n<p><em> </em><br/></p>\n<ul><li>Choose your protagonist! In the land of fiction,  writing  implements are warriors. Play as the heroic fountain pen Font in  the  demo, with more characters to come in the full release. \r\n</li></ul>\n<ul><li>Face  challenging enemies with unique powers and weaknesses.  Stay on your  toes and adjust your strategy to defeat them. The biggest  word isn’t  always the best one.  \r\n</li></ul>\n\n<ul><li>Endlessly replayable. Each run provides a  randomized map, three  vast lands to explore, and a wide variety of  villains to vanquish. \r\n</li></ul>\n<ul><li>Collect literary  devices to boost your strength and unlock  alternate strategies. Demolish  an enemy with an alliteration, deploy a  deus ex machina, protect  yourself with plot armor. An ample arsenal of  upgrades ensures that no  two playthroughs are ever the same. \r\n</li></ul>\n\n<ul><li>Help an aspiring writer vanquish avatars of  stress, doubt, and  procrastination to achieve the dream of writing a  book. Your quest is  her novel. \r\n</li></ul>\n<ul><li>Read your masterpiece! Each victorious run is summarized in book form, forever immortalized on a library shelf. \r\n</li></ul>", "metacritic": null, "released": "2022-03-21", "tba": false, "updated": "2022-03-25T13:19:43", "background_image": "https://media.rawg.io/media/screenshots/ee5/ee52ab8752de736d0ca91ac7095fcf4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Tic Toc Games"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}