{"id": 75982, "slug": "nascar-manager", "name": "NASCAR Manager", "name_original": "NASCAR Manager", "description": "NASCAR® MANAGER is the all new official NASCAR game that puts you in control! Take the Crew Chief seat in the most popular motorsport in North America. Decide your strategy, run the best tactics and make the calls that guide your driver to victory! Are you ready for a real challenge?<br/><br/>Pick your pitstop strategy, tire use and driving style as you attempt to guide your driver from the back of the pack to the winner's circle. Improve your chances of success between races by upgrading the car, training the team and negotiating sponsorship deals in order to take your driver from rookie to Chase winner. Featuring all the officially licensed tracks and drivers of the 2014 season, compete against (and beat) the stars of the sport like Dale Earnhardt Jr, Jimmie Johnson and Danica Patrick to see your driver crowned NASCAR Sprint Cup Series Champion!<br/><br/>KEY FEATURES:<br/><br/>• Features all the OFFICIAL drivers, race tracks, cars and sponsors from the 2014 Sprint Cup Series<br/>• Guide your driver from SPEEDWEEKS rookie to championship contender in CAREER MODE<br/>• Make the calls for your favorite driver from a line up of 43 officially licensed 2014 Sprint Cup Series competitors and champions in SEASON MODE<br/>• Upgrade your car to create the perfect setup for every track on the NASCAR calendar<br/>• Unlock new sponsorship opportunities to boost your finances<br/>• Train your crew to shave valuable seconds off your pitting time<br/>• Make the calls to give your driver the edge in stunning gameplay sequences with GENRE-LEADING GRAPHICS", "metacritic": null, "released": "2014-02-20", "tba": false, "updated": "2019-10-22T14:23:58", "background_image": "https://media.rawg.io/media/screenshots/cc6/cc6611392cfab233ee849e0d4067f698.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["704 Games Company"], "genres": ["Strategy", "Racing"], "publishers": ["704 Games Company"], "esrb_rating": "Everyone 10+"}