{"id": 75996, "slug": "trial-xtreme-4", "name": "Trial Xtreme 4", "name_original": "Trial Xtreme 4", "description": "***with over 150,000,000 downloads!!!  The Trial Xtreme series is proud to present – the best trials bike riding game ever!!!***<br/><br/>Feel the adrenalin pumping as you take your bike on MORE THAN 100 CHALLENGING AND SPECTACULAR LEVELS of pure motoring fun.<br/>Earn cash in races, tournaments and in head to head duels. Prove yourself as the best extreme rider among your friends and then make your way to the top of the world ranking charts!<br/><br/>This is no ordinary skill base riding game – our brand new Xtreme physics engine and super responsive controls will help you burn through crazy obstacles and take you for a ride like you wouldn't believe :)<br/><br/>EXTREME TOURNAMENTS ARENA – race against other riders from your country and around the world and win cash or other amazing prizes.<br/><br/>EXTREME DUELS – want to make some big bucks? In the duels arena you can bet against other riders and double your cash. <br/><br/>EXTREME COURSES – the craziest 3D graphics you've ever seen come together with perfectly designed levels to form an insane riding experience.<br/><br/>SPONSORSHIP DEALS – prove yourself as top rider to get cash from sponsors when racing against the big guns <br/><br/>EXTREME Upgrades- upgrade your bike abilities; improve your ‘on track’ performance and the look of your bike with the most hardcore stuff available.<br/><br/>SWAG! –bling up your rider with tons of awesome gear and match your style to your abilities.<br/><br/>Privacy Policy:http://www.deemedya.com/privacy<br/>Terms of Use: http://www.deemedya.com/license<br/>Visit our official site at: http://www.deemedya.com<br/>Like us on Facebook at: http://www.facebook.com/Deemedya<br/>For support: support@deemedya.com<br/>For feedback and suggestions, please visit: https://www.facebook.com/Trial4<br/>Check out our videos and game trailers on: https://www.youtube.com/user/DeemedyaMS", "metacritic": null, "released": "2015-01-14", "tba": false, "updated": "2019-07-29T19:53:36", "background_image": "https://media.rawg.io/media/screenshots/94e/94e472fc113151875c227ad74e3e49af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Deemedya"], "genres": ["Sports", "Racing"], "publishers": ["Deemedya"], "esrb_rating": "Everyone 10+"}