{"id": 75997, "slug": "fps-dinosaur-city-smasher", "name": "FPS Dinosaur City Smasher", "name_original": "FPS Dinosaur City Smasher", "description": "Dinosaurs and gorilla have returned to rule the Earth. They have fled Jurassic World on the unstable island and they’re roaming free in your cities and neighborhoods. A vigorous dinosaur war, telling hundreds of millions of years of glorious in Mesozoic! You were cast away on a mysterious Gorilla island, full of giant dinosaurs and Gorillas. Dying of hunger and cold, you have to hunt. You need to do your best to survive among hungry giant dinosaurs and immortal Gorillas inhabiting the island. Can you complete your Gorilla mission and make it to the rendezvous point, or will you be devoured by the island's most dangerous predators?<br/><br/>Kill dinosaurs and Gorillas in lush and dangerous Jurassic king environments like the shipwreck-strewn coast target, overgrown jungle and dinosaur bone yard! kids But be careful run, because not only you are hunting robo cops in the forest, but also you are connect being hunted like shooting games. You can have different ocean dino species, build underwater home, and build your Jurassic underwater World. Explore the mysterious lost world of prehistoric animals.<br/><br/>FPS Jurassic World Shooting: Dinosaur City Smasher is a shooting journey to the Jurassic jungle world and hunts the wild T REX Gorilla and different dinosaurs to survive in the dangerous jungle. This real shooting and wild hunting Gorilla adventure will move you back to the prehistoric Jurassic hunter. Load your weapons and Hunt T REX (Tyrannosaurus) in Jurassic jungle world. A new challenge game of shooting you don’t want to miss! Go back to the Jurassic age and hunt down the dinosaurs and Gorillas. Shoot your target, you are dead if you miss it!<br/><br/>Replay epic kills with incredible bullet-time. For any hunter unlucky enough to be caught in the enemy’s gaze then prepare to face off against your opponent’s fury in a nail-biting quick-time event. <br/><br/>You’ll only have seconds to react. Different dangerous wild dinosaurs will come to attack on you and finish you in couple of seconds. So, kill these wild T REX dinosaurs as soon as possible and stay alive and conquer dangerous Jurassic jungle world. You don't have to be a dinosaur digger and dig the ground in the search of dinosaur bones and fossils, in this epic video game of the dinosaur apocalypse the dinos aren't extinct. <br/><br/>Dinosaurs were created from DNA, and further dinosaur evolution is now going. Super dinosaur shooting city smasher provides a jungle park environment to find and hunt different dino with one of the best assault gun with him. Drive crazy jeep and enters into jungle to hunt different types of dino with assault shooting gun. There is lot of wild dinosaurs you have to hunt them before they hunt you and this is time to show your hunting skills. In the most deadly environment you have to kill specific amount of dinosaurs with in a limited time.<br/><br/>You're a hero survivor walking in an incredible and huge African natural environment, where your mission is to stay alive. In this exciting dinosaur game only one winner, you or your enemies - ruthless bloodthirsty dinosaurs. You can rescue your life by a speed run racing yourself from dinosaurs or attack them in this dinosaur war. Do not stand still, fire and reload your weapon's charge, it isn't a dinosaur puzzle. Move, at this time your damage value from a clash with the ancient monsters will gradually decrease.<br/><br/>Experience the thrill of being an actual Tyrannosaurus - the king of all Dinosaurs as he rules the land in the prehistoric Jurassic period and hunts for prey! <br/><br/>We Value your Feedback", "metacritic": null, "released": "2018-08-05", "tba": false, "updated": "2019-10-22T14:23:59", "background_image": "https://media.rawg.io/media/screenshots/b40/b401d1297652227302ae5711f409efbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": ["Adventure", "Simulation"], "publishers": ["Sajwar Khizar"], "esrb_rating": "Teen"}