{"id": 759979, "slug": "making-friends-autumnotopia", "name": "Making Friends (Autumnotopia)", "name_original": "Making Friends (Autumnotopia)", "description": "Make Friends, and Maybe Some Monsters Too\r\n<p>A lonely witch finally completes her prized creation after years of mischievous preparation... and it's cuter than she ever imagined! Follow her, her homunculus, and a forgotten friend in this informative course about emotions and magic 🔮<br/></p>\n<p><em>Content Warning: Just a heads up, this game deals with some concepts involving emotional manipulation!</em><br/></p>\n<p>This game was created for the Tiny Games Bundle, a bundle with the goal of supporting small creators and normalizing the idea that tiny games have value. If you haven't already, be sure to check out the other incredible, small, games featured!</p>\n<p>Making Friends is a collaboration between Autumnotopia and Elita, a duo from the PNW who are active in local indie game scenes. Together they've made tiny games about various subjects, including: dodging stuff while being gay, getting trapped in space with a monster, and hypnotizing eldritch gods for fun and profit.</p>\n<p>Featuring music and sounds by Ace Luke, a trans nonbinary composer from the PNW who specializes in making music for games. They’ve worked on multiple projects such as a sapphic witch saving a princess and a struggling digital artist.</p>\n<p><strong>Featuring!</strong></p>\n<p>💀 A deeply goth witch protagonist <br/>✨ A sickly sweet homunculus (wow!) <br/>🐌 A concerned know-it-all (ugh...) <br/>🎭 Choose your emotions, not your actions <br/>🍵 Five endings that teach you new potions based on the feelings you embrace <br/>📖 A spellbook collecting what you've learned</p>", "metacritic": null, "released": "2022-03-21", "tba": false, "updated": "2022-03-25T14:12:04", "background_image": "https://media.rawg.io/media/screenshots/bcd/bcd4d1e8aa8ff2334cbcc82eee3908b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Autumnotopia"], "genres": [], "publishers": [], "esrb_rating": null}