{"id": 760027, "slug": "strike-the-light", "name": "Strike the Light", "name_original": "Strike the Light", "description": "<p>Delve into a grim world, struck by constant rain and fog. Massive floodings laid waste to whole cities and drove mankind to adapt by using and relying on boats for traversal. Additionally a never-ending cover of thick clouds prevents almost all sunlight to grace the surface of the planet, resulting in darkly lit days, the blackest of nights and viciously freezing temperatures.<br/></p>\n\n<p>In this interactive Fiction,<br/>experience two of the remaining people tackling the odds<br/>in an unforgiving situation,<br/>where your decisions are crucial for their survival.</p>\n\n\n<p>New <strong>Update v0.15</strong> is out now, adressing Visuals, UI, Dialogue and more!<br/>See the full changelog here.</p><p>This Visual Novel was initially made in a 1-Week GameJam at the Uni \"HAW Hamburg\" and is my first in many regards, including developing a Visual Novel, using Ren'Py, creating a Plot with Characters, Story, Dialogue and Decisions and creating a completable Game in general.</p><p>Huge Thanks to Michael Benrad, Mareike Ottrand and fellow colleagues for valuable feedback, ideas and general support! &lt;3</p>\n<p>I truly hope you enjoy what I achieved so far ^_^<br/>As I'm anxious to develop this even further, please let me know of any feedback, critique and ideas you can think of!<br/>Also don't forget to rate and share as you please!</p>\n<p>For more Updates and Content, be sure to follow my Socials.</p>\n<p>And if you truly love what I do, you can support me on Patreon and Buy Me a Coffee!</p>\n\n<p>CREDITS</p>\n<p>Main Menu Music: Brotherhood by Monplaisir on Chosic<br/>Musical Ambiances by RenderRides on Gumroad<br/>Various SFX on Freesound</p>", "metacritic": null, "released": "2022-03-21", "tba": false, "updated": "2022-03-25T14:23:30", "background_image": "https://media.rawg.io/media/screenshots/0ce/0ceb788337fbde635f21b7889b1f4a35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["domfiglhuber"], "genres": [], "publishers": [], "esrb_rating": null}