{"id": 76005, "slug": "primal-wars-dino-age", "name": "Primal Wars: Dino Age", "name_original": "Primal Wars: Dino Age", "description": "Join the savage real-time battle against players from around the world for dominion in Primal Wars, the epic dinosaur-themed MMO strategy game brought to you by 37Games. As the Chief, you need to develop your territory by constructing buildings, training units, breeding trap plants, and even taming formidable dinosaurs. Hone your blades and unleash the beasts! It’s time to build a force to be reckoned with and regain the lost lands and glory for your tribesmen!<br/><br/><br/>Features:<br/>- A Vast World<br/>Explore massive lands filled with resources and treasures, encounter dangerous cannibals and dinosaurs.<br/><br/>- Sauroi &amp; Saurpets<br/>Recapture the lost lands and tame mighty dragons and dinosaurs that grant remarkable support in and out of battle.<br/><br/>- Build an Alliance<br/>Fight alongside your comrades from around the world with the help of real-time translation.<br/><br/>- Global Server<br/>Your friends are too far away? Feel free to relocate your territory to any region as you like.<br/><br/>- First-rate 3D Graphics<br/>Feast your eyes on beautifully crafted battle scenes that you have never witnessed on smart devices. <br/><br/><br/>Official Website:  https://mnews.37.com/pw/<br/>Facebook: https://www.facebook.com/PW.37Games/<br/><br/>PLEASE NOTE!  <br/>Primal Wars is a free to play strategy game, however, you can also buy some in-game items with real money. Under our Terms of Service and Privacy Policy, you must be at least 12 years of age to play or download Primal Wars.<br/>A network connection is required.<br/><br/>SUPPORT<br/>Having problems? <br/>For questions or support we are here to help! <br/>Please visit us at http://support.37.com/en/create<br/>Privacy Policy:<br/>http://support.37.com/en/about/privacypolicy <br/>Terms of Use:<br/>http://support.37.com/about/termsofuse", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-10-22T13:53:16", "background_image": "https://media.rawg.io/media/screenshots/49d/49df923987b1f2b3d073eff87bf30145.jpg", "website": "https://www.facebook.com/PW.37Games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["37GAMES"], "genres": ["RPG", "Strategy"], "publishers": ["G-MEI NETWORK TECHNOLOGY CO"], "esrb_rating": null}