{"id": 76008, "slug": "idle-armies", "name": "Idle Armies", "name_original": "Idle Armies", "description": "Highlighted as a top 10 tapper of 2016 by the Apple App Store. Over 800,000 downloads across all platforms so far!<br/><br/>An idle game like no other; a great clash of good and evil, where you play on BOTH sides.<br/><br/>Follow Ivan as he sets off on his quest to kill a vicious orc known only as… Max. Recruit allies; the sarcastic Sabrina, the enthusiastic Lil Dan and the ever silent Meg. Choose game-changing perks. Unlock powerful spells to freeze your enemies or blow them to smithereens. Unlock masses of upgrades at your local lab or hire archers at the nearby barracks. Rank up, level up and upgrade to fight against the never ending stream of skeletons, orcs, goblins and bosses who want to eat you up… and then…<br/><br/>Swap. Play as the misunderstood Max, an Orc with a lot to prove. Put up with an older brother, an over-zealous mummy and an anxious cave troll. Visit swamps and wastelands, run your own gold mine full of human prisoners. Unlock powerful curses, purchase powerful items. Upgrade, rank up and battle endless waves of farmers, peasants, soldiers and bosses… and then…<br/><br/>Battle your armies. To the winner: lots of rewards, to the loser: less rewards. Use these rewards to improve your armies permanently, so that the next time through you’re even more powerful. Wow this circle is practically never-ending… you could play this game forever…<br/><br/>If you like idle games this is a must! If you don't, give it a try as you might be surprised.<br/><br/>If you've read this far well done, when you find a hermit be sure to use the code: WA4EVER!<br/><br/>Features<br/>+Control two armies - each with distinct heroes (and villains), technologies, spells and upgrades.<br/>+26 characters to unlock, all with funny (and not so funny) conversations as you play.<br/>+Pretty retro graphics - travel from grassy forests to stark wastelands, icy planes to dank swamps.<br/>+Earn millions, trillions, quintillions... even octodecillions!", "metacritic": null, "released": "2016-09-14", "tba": false, "updated": "2019-10-22T14:24:00", "background_image": "https://media.rawg.io/media/screenshots/980/980c8b50527751971f0bd96c1be0b604.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Grumpy Rhino Games"], "genres": ["Adventure", "RPG"], "publishers": ["Grumpy Rhino Games"], "esrb_rating": null}