{"id": 760037, "slug": "as-lauded", "name": "As Lauded", "name_original": "As Lauded", "description": "<p>Guide the child through the maze by mapping out the route to the exit from the child's initial location, then completing puzzles to open the doors on the route. As a ghost, you cannot leave the maze yourself, nor can you enter the room the child is, but you are in no danger of being trapped by the impossible-to-solve red puzzles like the one that killed you.</p>\n<p>The child will go through open doors if there are any (the maze will close doors behind the child), and start playing with whatever puzzles are available if there aren't.</p>\n<p>The controls are mouse (click)-based:</p>\n<ul><li>Click the floor to pull up the map of the maze as you build it by exploring. (Click off the map to put it away again.)</li><li>Click a wall to the side to face it: the left wall to turn left, the right wall to turn right.</li><li>Click the wall in front of you to go forward, including through a wall or closed door. (You're a ghost.) You can't enter anywhere the child is, or exit the maze itself.</li><li>Click a puzzle to work toward solving it. (Click off the puzzle to leave it.) Once it's solved, click it again to open its door. The child will go through any open door accessible from the child's location, except if you are in the room the child would be entering. (The child is scared of your ghost vibes.)</li></ul>\n<p>There's no audio. I made everything you see here.</p>", "metacritic": null, "released": "2022-03-21", "tba": false, "updated": "2022-03-25T14:25:41", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b3ccc82b486c5540a53e0e91f895dfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["dysprositos"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}