{"id": 760147, "slug": "dulce-et-decorum", "name": "Dulce et Decorum", "name_original": "Dulce et Decorum", "description": "It is sweet and fitting to die for one's country. Unless, of course, you can't die at all. In <strong>Dulce et Decorum</strong>, after your parents were killed in a robbery gone wrong, you begged for help from any god that would listen. One deity did, and now you can shoot beams of light and you resurrect back in this musty cave whenever you perish. Pretty neat! Now, years later, a man who claims he cannot die either has laid siege to the village you have lived in as a hermit for years... of course you step up and decide to use your powers to put an end to this threat.<br/><br/>There are three methods of combat you can use to defeat your foes in this platformer shooter. One is a normal blast of magic dealing moderate damage, one is a more precise, slower, and shorter ranged burst of magic dealing more damage, and one is a faster and wild bolt of magic that deals a very small amount of damage but applies a ticking curse dealing damage over time to the enemy. Switching combat modes gives you a short buff to your Luck, increasing the chance of random drops, so be sure to vary what attacks you use!<br/><br/>Features:<br/><ul><li>Pixel art graphics I had to buy instead of learning how to make myself </li><li>A combat system designed for people with a deficit of attention </li><li>Beautiful tracks by OwlTheoryMusic</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-28T02:47:48", "background_image": "https://media.rawg.io/media/screenshots/24d/24ded54a56538ae872c65a815e972014.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zachary Hilsman"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Zachary Hilsman"], "esrb_rating": null}