{"id": 760150, "slug": "world-of-epicia", "name": "World of Epicia", "name_original": "World of Epicia", "description": "A short single-player roguelike adventure inspired by Dwarf Fortress. <br/><br/>The goal of the game is to destroy the skeleton castle which is getting more powerful. You can do this by allying with surrounding kingdoms and fight evil together, or by becoming the strongest and conquest all kingdoms by yourself.<h3>Game Features</h3><br/><strong>Combat</strong><br/>Melee and ranged combat is present, with characters automatically picking rocks to throw at enemies. There are no health bars, only probabilities of injuring enemies.<br/><br/><strong>Item wear and tear</strong><br/>Items might get broken from use, from getting old, from absorbing hits. Different materials have different fragility. Also, Items lying on ground get old and turn into shatters.<br/><br/><strong>Crafting</strong><br/>The game features simple crafting system where you can choose which weapons your characters will craft for themselves. If not, characters will go and craft basic weapons. there are 4 resources (wood, stone, metal, cloth) which are gathered automatically but you can prioritize certain resources, or character making, over others.<br/><br/><strong>Logs</strong><br/>Every character in Epicia has logs attached which includes his deeds, all combat activities, injuries.<br/><br/><strong>Damnation</strong><br/>It's possible for all kings in Epicia to become damned by killing creatures (as opposed to injuring them but letting live). Damned kings can't craft but their units get strength bonus, and the only way for them is to conquer others.<br/><br/><strong>Quests</strong><br/>Player is given quests to obtain items, or kill a certain beast. If quest giver is eliminated, the quest becomes unavailable.<br/><br/><strong>More</strong><br/>These features are mostly visual and have little impact on gameplay:<br/><ul><li>Changing weather<br/></li><li>Wounds history with healed wounds<br/></li><li>Character attributes</li></ul>", "metacritic": null, "released": "2022-03-27", "tba": false, "updated": "2022-03-28T02:49:49", "background_image": "https://media.rawg.io/media/screenshots/532/532e3575beacd876d5d4d674727645ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adam Stępiński"], "genres": ["Indie"], "publishers": ["Adam Stępiński"], "esrb_rating": null}