{"id": 760176, "slug": "trigger-spree", "name": "Trigger Spree", "name_original": "Trigger Spree", "description": "Putting the Fun back in F.P.S., Trigger Spree is an unrealistic, fast-paced Multiplayer FPS with focus on variety, speed, and simplicity. Spanning across many themes and settings, the insane weapons and unique maps provide a Triggering experience!<h3>ENDLESS POSSIBILITIES</h3>Trigger Spree's vast selection of weapons and maps allows you to play a FPS in new ways. Grab hold of bizarre weapons, like the Nadeballa, Disco Death Beam, or Acid Nozzle. Of course there's plenty of conventional weapons such as the Refiner revolver, U22i submachine gun, and the quadshotgun. Examples include playing as a pack of squirrels having a shootout with jetpacks in a mall, zombies &amp; undead running around a church graveyard with flamethrowers, or as aliens using alien weapons in a futuristic city, the choice is yours. Mix it up with fun cheats or elements such as jetpacks, unlimited ammo, instagib, bunnyhopping, etc.<h3>FEATURES:</h3><br/><ul><li>Fun &amp; Fast: Enjoy straightforward run &amp; gun gameplay. No need for kill-streaks, loadouts, or classes, all you need to know are the weapons and maps.<br/></li><li>Maps, spanning many unique environments and themes<br/></li><li>Over 30 cool weapons ranging across experimental / conventional / alien / futuristic / weird<br/></li><li>Cast of offbeat characters, including a human-sized-squirrel, robots, aliens, dogs &amp; a Mecha Kitten<br/></li><li>Tons of customization: Change weapon spawns, gravity, player speed, toggle jetpacks, bunnyhopping, and more!<br/></li><li>Platforming Fun!: When you traverse the maps, you have many paths to choose from. Use your platforming skills to take shortcuts or help your getaways and ambushes. Some areas in some maps can only be accessed by skilled players.</li></ul><h3>MAPS</h3><ul><li><strong>Area 57:</strong> Secret facility located in the arctic mountains. There are rumors of alien research going on here...<br/></li><li><strong>Mall:</strong> A medium-sized shopping mall. Contains many different shops, palm trees, bathroom, maintenance hallways, and a large 2-story atrium. Great for intense quick action.<br/></li><li><strong>Cemetery:</strong> A place of worship and death. Get around the map using the chapel, underground tunnels, and hedge-maze.<br/></li><li><strong>Avenue:</strong> Takes place in the heart of a large city, between 2 skyscrapers. Features underground subway, parking garage, bank, and night club<br/></li><li><strong>Laboratory:</strong> Blue Matter Labs is situated in the middle of the desert, surrounded by satellite dishes. This map is a mix of indoor/outdoor action, with large corridors and chambers. The labs were shut down in 20XX when it was discovered to be involved in drug manufacturing.<br/></li><li><strong>Resort:</strong> Beachfront hotel with canals and sunshine, take a ride on the tour boats! Or hide in a hotel room<br/></li><li>+Many More</li></ul><h3>GET TRIGGERED</h3>Weapons range from wacky to conventional and everything in between. Here are some of the cool weapons you can use<br/><br/><ul><li><strong>Refiner:</strong> Your trusty, (default) starting weapon. A strong accurate revolver gives you a fighting chance against almost any other weapon.<br/></li><li><strong>Nade-balla:</strong> Fire a bouncy explosive Nade-ball that can roll around and be remotely detonated.<br/></li><li><strong>Blazer:</strong> A Flamethrower, keep your enemies close and burn them to toast!<br/></li><li><strong>Rocketrix:</strong> A special rocket launcher where you can toggle the speed of the rocket in mid air.<br/></li><li><strong>PP77:</strong> Compact, prototype sub-machine gun. Incredibly rapid, but also very inaccurate.<br/></li><li><strong>NRG Streamer:</strong> An experimental weapon of unknown origin, Shoots a precise constant stream of energy.<br/></li><li><strong>Chain-o-saur:</strong> A chainsaw, there's not much else to say except its shaped like a dinosaur's head.<br/></li><li><strong>Acid Nozzle:</strong> A high-powered \"water-gun\" that shoots acid instead of water.<br/></li><li><strong>Laser Pistol:</strong> Bounce lasers off the wall with this alien weapon, great for shooting around corners &amp; trapping enemies.<br/></li><li><strong>G.T.A.R.:</strong> Guitar Type Audio Rifle. Shatter your opponents with heavy metal guitar riffs that can block hallways and explode after a few seconds<br/></li><li><strong>Firework Launcher:</strong> Shoots a live firework that will explode in 1 second or if it hits somebody. Dont get distracted by it's beautiful explosion.<br/></li><li><strong>Suicide Squirrel:</strong> Remote-controlled, mecha-squirrel. Guide it to the enemy then detonate. Be careful, youll be vulnerable when using it.<br/></li><li>+ Many more!</li></ul><h3>GAMEPLAY MECHANICS &amp; SPECIFICS:</h3><ul><li>No weapon limit - use all the weapons you pick up from the map or dead enemies<br/></li><li>Weapons are spawned on maps, each spawn slot can be changed or randomized<br/></li><li>Quick player speed (no need for a sprint button/mechanic)<br/></li><li>No regenerating health (in default modes)<br/></li><li>Bunny hopping (toggle-able option)<br/></li><li>Static crosshair (no aim down sights except scoped weapons)<br/></li><li>Jetpack (optional)</li></ul><h3>DISCLAIMERS</h3><ul><li>All information, details, features on this page are subject to change</li></ul><br/>Thanks for checking out Trigger Spree! Please consider checking out my other games below:<br/><br/>https://store.steampowered.com/app/340340/Domestic_Dog/<br/>https://store.steampowered.com/app/776790/Squirrel_Sphere/<br/>https://store.steampowered.com/app/334690/Squirreltopia/", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-28T03:08:59", "background_image": "https://media.rawg.io/media/screenshots/108/10817091b2c611b8be2a1f5eb089f94d.jpg", "website": "https://www.surrealdistractions.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sean Davy"], "genres": ["Action", "Indie"], "publishers": ["Sean Davy"], "esrb_rating": null}