{"id": 760151, "slug": "yuan-ling-shen-hai-yi-meng-medusa-the-origin-lost-", "name": "原灵·深海遗梦 Medusa the Origin ~ Lost Dream of the Deep", "name_original": "原灵·深海遗梦 Medusa the Origin ~ Lost Dream of the Deep", "description": "This is a visual novel product.<br/>\n<br/>\r\nThis work has designed more than 20 different scenes and 10 special events with CG, and created scripts with more than 80000 Chinese characters.<br/>\n<br/>\n<br/>\r\nThe story begins in Zhijiang in June 2022.<br/>\n<br/>\r\nThe idol group A-SOUL, which is composed of five girls: Ava, Bella, Carol, Diana and Elieen, will face two important things!<br/>\n<br/>\r\nThe first thing is to celebrate the birthday of the youngest member, Ava, in the evening on June 12. In the evening, She will also hold a special concert!<br/>\n<br/>\r\nThe second thing - at the end of June, A-SOUL will finally be on the stage in the Northern Capital that has always been dreamed of!<br/>\n<br/>\r\nOriginally, everything went smoothly... Until that day, five girls inexplicably contacted the spirit in the universe...<br/>\n<br/>\r\nThe hometown of spirits, Capital of Light, and Zhijiang, a beautiful human city, have a track of intersection for the first time.<br/>\n<br/>\n<br/>\n<br/>\r\n*This is a co authorship based on A-SOUL members*<br/>\n<br/>\r\n*A-SOUL is a virtual idol group operating in reality and currently operates in BiliBili*<br/>\n<br/>\r\n*Except for Xiangwan, Beila, Jiale, Jiaran and Nailin, all the characters are original characters of this work*", "metacritic": null, "released": "2022-03-27", "tba": false, "updated": "2022-03-28T02:50:44", "background_image": "https://media.rawg.io/media/screenshots/747/747450f80db647e19bc2e066c27584de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 416, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["原灵·深海遗梦制作组"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["原灵·深海遗梦制作组"], "esrb_rating": null}