{"id": 760170, "slug": "epic-pirate", "name": "Epic Pirate", "name_original": "Epic Pirate", "description": "Evil Pirate Skeletons have taken over the World !<br/>\r\nClear those Bad Dudes from several progressively challenging levels.<br/>\r\nUse Your various sword combat skills in Combinations.<br/>\n<br/>\r\nSome of the Game's features and content included are Collectathon, Brawler Style Sword Battles, Permadeath, across several amazing Levels.<br/>\r\nEssentially, You can expect Seafaring and swashbuckling while engaging in daring adventures with bravado and flamboyance in gameplay.<br/>\n<br/>\r\nHints/Tips :<br/>\r\nTry 'Locking On' to Enemies for better accuracy.<br/>\r\nIf You approach an Enemy from behind, sometimes You can get a 'Sneak Attack' Kill<br/>\r\nMake sure to use Your Combat 'Skills' while fighting.<br/>\r\nYou can quickly switch between the Combat Skills while fighting this will give You an advantage.<br/>\n<br/>\r\n* The game features PermaDeath, so, If You Die or Quit, You have to start over again from the beginning ! *<br/>\n<br/>\n<br/>\r\n*** Challenges ***<br/>\n<br/>\r\n\"Easter Egg\" Challenge - How many Archor Games Logos Appear in the Game ?<br/>\r\n\"Speed Run\" Challenge - What is the Fastest Time You can Complete the Game ?<br/>\r\n\"Walk Don't Run\" Challenge - Only Walk (No Sprinting) for the Entire Game and Post Your Full Video online.<br/>\r\n\"Gotta Catch 'Em All\" Challenge - Kill every Bad Dude in the entire Game (Some are in the less traveled areas of the levels). - How Many Bad Dudes are there Total ?<br/>\r\nEvan the Adventurer Challenge - Explore every inch of the entire map on each game level.<br/>\r\n\"Musically Challenged\" Challenge - Some Levels have more than one Music Track, How Many Tracks Total are in the entire game ?<br/>\r\n\"No Skills to Pay the Bills\" Challenge - Don't use any Combat Skills during the Entire Game. (This will be very, very hard)<br/>\r\n\"#KobayashiMaru\" Challenge - Don't Jump, Don't Lock-on, Don't use Combat Skills, Walk Only, No Running, No Blocking, No Sneak Attacks.<br/>\r\n(Basically You can only Move and use the 'Hit' Button and nothing else.)<br/>\r\n** Warning : It will be really hard to play the game this way and may get frustrating at times. **<br/>\r\n\"Steamy Streamer\" Challenge - Get ALL of the Archor Games products available on Steam and Stream ALL of them Beginning to End.", "metacritic": null, "released": "2022-03-25", "tba": false, "updated": "2022-03-28T03:04:40", "background_image": "https://media.rawg.io/media/screenshots/39d/39d2d5066bcce66a183c34cb2562bc89.jpg", "website": "http://store.steampowered.com/search/?publisher=Archor%20Games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 516, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Archor Wright"], "genres": ["Adventure"], "publishers": ["Archor Games"], "esrb_rating": null}