{"id": 760172, "slug": "the-conqueror-of-battles", "name": "The Conqueror of Battles", "name_original": "The Conqueror of Battles", "description": "<h3>A NEW TYPE OF GAME</h3><br/>In <strong>The Conqueror of Battles</strong> the objective is simple: eliminate the enemy characters and kill the boss adversary, your victory will not depend on your agility or reflexes, but on the strategy that you will adopt and your choices. Your weapon to influence on the battle will be your cards with devastating effects on the battlefield. You will plunge into incredible real-time multiplayer battles <strong>1vs1</strong> or <strong>2vs2</strong> where every action is important. Discover also a progression and important rewards. You can <strong>invite your friends</strong> to fight together against other opponents.<h3>THE CHARACTERS</h3><br/>Before starting the battle you must select 3 characters who will fight for you, they differ by their spells, their cards and their distance of attacks. Each character holds cards that you can play during the battle. These differences allow for many associations between the characters and define your gameplay.<h3>THE BATTLE</h3><br/>During the battle your characters and those of the adversary players will fight, your role will be to influence on the battle with your powerful cards. When all the enemy characters are dead, the adversary boss appears, your objective is to inflict him as much damage as possible to kill him. Note that every 30 seconds the dead characters come back to life and the boss disappears. If you fail to kill the boss before the reappearance of the enemy characters, the boss will reappear the next time with his last state of life.<h3>THE CARDS</h3><br/>This is probably the most important. They allow you to influence on the course of the battle in different ways. Each character holds a list of cards and every 10 seconds you will get a random card from one of your characters. The effects of the cards are many, utility, increase of damage, reduction of damage and inflicting damage to the adversary characters...<h3>THE ITEMS</h3><br/>The items allow you to increase the power of your characters, you get them after the battles or against gold from the seller. Gold is obtained after the fights as a reward. You are limited to 6 items per character. You can increase many characteristics and also create your gameplay.", "metacritic": null, "released": "2022-03-25", "tba": false, "updated": "2022-03-28T03:06:16", "background_image": "https://media.rawg.io/media/screenshots/790/790d31ff20bc36134981cb24c4ac5d21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EldoGames"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["EldoGames"], "esrb_rating": null}