{"id": 760187, "slug": "school-simulator-rpg", "name": "School Simulator RPG", "name_original": "School Simulator RPG", "description": "Sara and Kenichi join as college students on Sakura city school academy at the age of 20. Here, they will have their adventure of friendship, love, and mysteries. Play as either a boy or girl in this virtual school simulator to interact with many friends and date a senpai.<br/>\r\nBoth the kouhai Sara and Kenichi has developed a feeling for their senpai. You will choose their boyfriend or girlfriend depending on your chosen character. On your adventure you will meet a rival that is also fallen in love with senpai and want to get rid of you. It is your job to gain senpai's love and uncover the teacher mysteries of the city simulator Sakura Academy.<br/>\r\nEnjoy college campus virtual life on anime sim games. You can study on your class, play sport game, ride a bicycle , drive scary car, date a senpai, prank the teacher or fight the enemies. You can go around the school in day or night time. But be careful, in the night there is some zombies and ghost lurking around the area. Also after the academia graduation ceremony, there is an imposter who dressed like the college students. Your job is to find it and uncover the 3D simulator of virtual metaverse secret stories!<br/>\n<br/>\r\nFEATURES:<br/>\r\n- Interesting story about campus mysteries!<br/>\r\n- Beat all gangsters in the campus.<br/>\r\n- Join all campus club and attend the class!<br/>\r\n- Master various skills and weapons.<br/>\n<br/>\r\nCONTROLS:<br/>\r\nWASD: move<br/>\r\ne: talk/examine<br/>\r\nq: quest<br/>\r\ni: equipment<br/>\r\nk: skill<br/>\r\nc: stats<br/>\r\nspace: Jump<br/>\r\n123: use skill<br/>\r\nmouse: action", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-03-28T03:17:16", "background_image": "https://media.rawg.io/media/screenshots/c6f/c6f47cb61127572d0b4453ad4f1b6361.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Scary Creepy Pasta"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Nugroho Industries"], "esrb_rating": null}