{"id": 760208, "slug": "orbitindustries-demo", "name": "orbit.industries demo", "name_original": "orbit.industries demo", "description": "orbit.industries is coming soon and can be wishlisted \nhere<br/><br/> \n\nIn space, no one can hear you scream - neither a victorious cry, nor one loaded with frustration. So what shall it be, Space Pioneer, when you are the Captain of it all?\n<br/>\n<br/>\nBUILD A WONDROUS VIEW\nBuild, install and redesign your station to perfection in a full 3D view taking advantage of the spectacular visuals provided by Unreal Engine 4. Look at your creation in a 360 degrees view, zooming in and out to marvel at its beauty.\n<br/>\n<br/>\nLook at the magnificent in-game star constellations, nebulas, and planets the development team spent weeks researching to realistically provide in-game visualizations within the endless game sky.\n<br/>\n<br/>\nFOCUS ON THE ABSTRACT\nMonitor and set up production cycles, resources, and their distribution. Focus either on efficiency or yield, treating everything as a diligent spreadsheet master - but with an abstract layout system resembling a circuit board to help you design the best connections, nooks, and crannies to make your station a resounding engineering success!\n<br/>\n<br/>\n<br/>\nECONOMICS, ERRORS AND MORE!\nA unique economic system provides you with a key objective - make your station efficient and profitable or fail!\n<br/>\n<br/>\nThe normal route of business can be, however, disrupted by a number of disruptions: from hacker attacks to errors and malfunctions each module and its system entail in your management of the station.\n<br/>\n<br/>\nYour production may also simply overload, given the production strain - so plan, execute and design to perfection!EXPLORE UNKNOWN PLANETS\nThere are 3 distinct campaign missions where you need to terraform a given planet, make it habitable, and easy to extract resources from.\n<br/>\n<br/>\nBuilt with a background narrative, each of these missions enables you to focus on the two-game modes in order to build your station in such a way as to successfully fulfill its objectives. \n<br/>\n<br/>\nAre you going to be the most efficient, the most industrious, or have the most graphically appealing modules setup? Anything goes as long as the mission is successful!\n<br/>\n<br/>\nENDLESS DREAMS\nYou can also kick back and focus on building the greatest and either best looking or most efficient station there ever was - within either our Creative or Endless modes built especially for this purpose.\n<br/>\n<br/>\norbit.industries blends inspiration from classic science fiction literature, movies, and popular space-opera TV series with actual knowledge and progress achieved in the field of space exploration, space engineering, and orbital stations development.\n<br/>\n<br/>\nKEY GAME FEATURES<ul><li> Full 360 degrees, 3D view of an orbital station within Unreal Engine 4\n<br/>\n</li><li> An abstract 2D stylized view of management cycles and resource planning\n<br/>\n</li><li> 3 Gameplay Modes: Campaign, Creative and Endless\n<br/>\n</li><li> 54 Modules varieties to build and design your station with\n<br/>\n</li><li> A technological tree to explore and expand</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-03-28T03:31:57", "background_image": "https://media.rawg.io/media/screenshots/fbc/fbcb0629b17708ce7604c1a403207af7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 27}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LAB132"], "genres": [], "publishers": ["Klabater"], "esrb_rating": null}