{"id": 760271, "slug": "s-i-g-n-a-l", "name": "S-I-G-N-A-L", "name_original": "S-I-G-N-A-L", "description": "<p>Created for PyWeek 33. S-I-G-N-A-L is my first ever entry into a game jam. It was a lot of fun, but I did not do as well as possible. I learned a lot about time management from this!</p><p>REQUIRES PYTHON (3.9+) TO RUN.<br/></p><p>COPIED FROM README:</p>\r\n# S-I-G-N-A-L\r\nSignal is a pattern matching game with 3* levels. \r\nYou are a signal coordinator who must match and oppose the enemies signal.\r\nIf you don't you will take damage as the enemy successfully attacks. Survive 3 rounds,\r\nand you will be able to send the signal to attack back.\r\n##settings\r\nTo change settings use `[A]` and `[D]` to select different options,\r\nand use `[W]` and `[S]` to change the settings value.\r\nIF YOU DON'T SEE ANY SETTINGS KEY HIGHLIGHTED WHEN THE GAME LAUNCHES PRESS `[D]` FOUR TIMES. THEN `[S]` THREE TIMES TO\r\nENABLE BLINKING. (thanks Cosmologicon `:)` )\r\n##controls\r\nTo play the game use the `[&lt;]` and `[&gt;]` keys to change the frequency of your signal.\r\nTry match the enemy's frequency. \r\nUse `[^]` and `[v]` to change the peak of your signal. Try to oppose the enemies peak.\r\npress `[SPACE]` to send out a signal. You will hear a ping when it is best to send out your signal.\r\nYou are trying to cancel out the enemy's signal at the dashed line.\r\nSo when the enemy Signal reaches the thick line is when it is best to send out your signal.\r\n##morse code\r\nYou have been equipped with a morse code machine and translator.\r\nWhen you hear and see the morse code along the top of your screen switch to the \r\nsettings knob which says 'translate' and 'off'. When you select translate the game will pause.\r\n##running the game\r\nSimply run main.py.\r\nThe game begins paused. \r\nI recommend using the `[WASD]` keys to change settings to your liking first.\r\nTHE GAME IS VERY DIFFICULT. USE THE SPEED KNOB TO SLOW IT DOWN IF IT IS TOO HARD. MAY CAUSE A FEW AUDIO BUGS\r\n##contributions\r\nAll assets where created by me (DragonMoffon).\r\nAll code was written by me (DragonMoffon)\r\nI used the arcade library.\r\nfeel free to use any of the code. It sucks anyway, so I don't know why you would.\r\n##notes*\r\nNot everything is as it seems. Pay attention to the morse code. It is where the story of the twins appears.", "metacritic": null, "released": "2022-03-27", "tba": false, "updated": "2022-03-28T03:50:37", "background_image": "https://media.rawg.io/media/screenshots/3fc/3fc33042cf99015668203021efa0648d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DragonMoffon"], "genres": [], "publishers": [], "esrb_rating": null}