{"id": 76036, "slug": "idle-apocalypse", "name": "Idle Apocalypse", "name_original": "Idle Apocalypse", "description": "Ever wanted to run a cult? Summon legendary demon gods? Control hordes of unwashed monsters? Craft a tower so tall it defies all laws of physics? Or… destroy the world?<br/><br/>No? Well, why not give it a try anyway?<br/><br/>Idle Apocalypse is the best cult, clicker apocalypse simulator of 2018! Craft your tower and build it high into the sky and deep underground. Tap to create hordes of goblins, demons and beasts to do your bidding. Cast spells on any brave heroes foolish enough to get in your way. Summon the legendary Idols – a feared group of gods – and bring about the End Times in this novel idle tapper game.<br/><br/>Idle Apocalypse is a game about resource management, strategy and evil!<br/><br/>- Features -<br/><br/>Craft Your Tower<br/>- Collect materials to unlock over 40 new rooms!<br/>- Unlock research stations to discover technologies.<br/>- Tap generators to accelerate progress!<br/>- Build mines, juicers, kitchens and factories.<br/><br/>Create Monsters<br/>- Craft over 20 unique monsters to do your bidding.<br/>- Evolve, upgrade and improve them.<br/>- Collect goblins, beasts and demons.<br/><br/>Incremental Action<br/>- Play as much or as little as you like!<br/>- Your monsters keep fighting even while you’re offline!<br/>- Resource management gameplay. Watch as your tower evolves with just a few taps!<br/><br/>Endless Idle Game<br/>- Summon Idols to bring about the Apocalypse!<br/>- Prestige to unlock valuable chants and grow your tower higher.<br/>- Evolve and craft your tower on multiple play-throughs, unlocking new mechanics!<br/><br/>Lovers of simulation games and incremental clickers won’t be able to put down this idle monster breeding RPG. And if you do you’ll pick up again a few hours later, because it’s an idle game and there’s loot to collect!", "metacritic": null, "released": "2018-07-31", "tba": false, "updated": "2019-10-22T14:24:01", "background_image": "https://media.rawg.io/media/screenshots/237/2373a1089cdf1e4dc822ad1506b3ae63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Iron Horse Games", "Grumpy Rhino Games"], "genres": ["RPG", "Simulation"], "publishers": ["Grumpy Rhino Games"], "esrb_rating": "Teen"}