{"id": 76064, "slug": "kung-fu-street-fighting-ninja", "name": "Kung Fu Street Fighting Ninja", "name_original": "Kung Fu Street Fighting Ninja", "description": "Play in the tough street as a mortal street fighter and be victorious against competitors fighting against you. If you want to experience a thrill of fighting than join this game right now! <br/>The early remote controller fighting games are now in your phones to make fighting games more close to you all the time. With this fighting game you can do the usual and fight enemies for succeeding to the next levels. Be a victor!! <br/>This game is really easy and fun to play. All you have to do after downloading the street fighter fighting game is select your street fighter and proceed with the game. Then you will encounter your competitor whom you can fight with your various kung fu fighting skills. Just like an entire arcade in your phone. <br/>You can knock out your competitor enemy with controls like jump, kick and punch and to save yourself defence button is also on screen to help save yourself! <br/>Defeat your enemy in the given time or the fighting game will be over and make sure to finish the competitor’s health bar before they finish yours. Keep fighting and don’t lose! <br/>Keep your fighter strong in the fighting game because the enemy count will increase in each level. And each time you succeed a fighting game you will go to the next stage! Your environment will automatically shift and slide to the next one where more enemy competitors will come to fight! So be aware be careful and stay focused! <br/>The exciting features and sound effects will keep you glued to this fun filled action fighting game. <br/>How to play street fighter game:<br/>•\tSelect your player out of a multiple <br/>•\tSelect level from 15 of street fighter game levels <br/>•\tThe environment is continuous and un-static <br/>•\tWhen a stage is cleared your screen will extend to the new level in the same environment of street fighter game <br/>•\tFight enemy with controller on screen <br/>•\tController options includes 4 buttons;<br/>&gt; punch<br/>&gt; kick<br/>&gt; jump <br/>&gt; defence <br/>•\tBegin fight with approaching enemy <br/>•\tThe 3D game has 2D simulation for a width wise view <br/>•\tBegin the fight and complete it before the given time limit is over or game will be over<br/>•\tDefeat the enemy before health bar runs out <br/>•\tDon’t lose and succeed to the next level<br/>•\tLevel counts of enemy will increase per round so be carefull<br/>Features of street fighter game: <br/>•\tMultiple street fighter players<br/>•\t15 exciting levels <br/>•\tOn screen controller with four main control buttons <br/>•\tUnlock and proceed to new level after completion of one level <br/>•\tHealth bar provided for both street fighter and enemy <br/>•\tEnemy count increases with level difficulty <br/>•\tTime limit bar <br/>•\tExtending environment <br/>•\tFighting sounds <br/>•\tRealistic sound effects <br/>Engage in furious street brawl and be a champion! Test your limits by playing this street fighter fighting game!", "metacritic": null, "released": "2018-01-19", "tba": false, "updated": "2019-10-22T14:24:02", "background_image": "https://media.rawg.io/media/screenshots/0d0/0d0f50a3b5dc53985c176bd0ecac9ba4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiran arif"], "genres": ["Action", "Adventure"], "publishers": ["Kiran arif"], "esrb_rating": "Teen"}