{"id": 760694, "slug": "proverbs-of-hell-demo", "name": "proverbs of hell (DEMO)", "name_original": "proverbs of hell (DEMO)", "description": "🫀Warning!🫀\r\n<ul><li><em><strong>Blood is integral to the plot<br/></strong></em></li><li><em><strong>(</strong></em>Human) death, suicide, bodily harm</li><li>Unreality</li><li>Drugs, alcohol </li><li>Emetophobia</li></ul>\n<p>💉</p>\n<p>You’re Lithium--phlebotomist, amnesiac, and zombie. Your whole un-life revolves around your job at GNCO, the company behind \"Blood+\": enhanced blood that gives its users superpowers. What people do with them is none of your business--or so you thought. A medical misadventure and a mysterious mailwoman rip you away from GNCO and sends you on a hunt for its mythical founder, Glorious Chairman. You can barely remember where you put  your arms; how will you survive the Wastes outside the city?<em>\n</em><br/></p>\n<p>Except sometimes you’re  Shan, the exiled son from the  all-powerful Oh family. Survival is the only thing you have time  for, until a chance encounter with another disgraced former-rich kid sets you on a  path of vengeance. The only way to win is to destroy GNCO, your former  family’s blood empire . One of their only rivals will die any day now, leaving the  company more powerful than ever.  But genetics granted you an incredible power of your own: exploding spit!</p>\n<p>💉</p>\n<p>🩸Original assets and soundtrack</p>\n<p>🩸 Explore two sides of a sometimes quirky, sometimes surreal dystopia<br/></p>\n<p>🩸Variety of sidequests and bonus content</p>\n<p>🩸Over 100 skills to collect</p>\n<p>🩸 Skilltree and crafting system to further customize gameplay<br/></p>\n<p><strong>Streamers: The music is not under copyright.</strong><br/></p>\n<p><strong>The demo has roughly three hours of content and represents about a fifth of what will be the finished game overall. </strong><strong>This is for beta testing, not the final release. </strong>Join our discord server<strong>. </strong><br/></p>", "metacritic": null, "released": "2022-03-27", "tba": false, "updated": "2022-03-28T05:36:28", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d09c27b478570ee8af246a76f7f2108.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["saifey"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}