{"id": 760689, "slug": "five-nights-at-freddys-multiplayer", "name": "Five Nights at Freddy's: Multiplayer", "name_original": "Five Nights at Freddy's: Multiplayer", "description": "<p><em><strong>Helped By SupAnimatorGuy https://itch.io/profile/supanimatorguy</strong></em></p>\n\n<p><em>These games are for the FANS! Nothing here is official or meant to be taken serious. This is fan-made content made by fans, for fans. These projects contain one night (recoded) from Scott Cawthon’s FNAF 1 and 2 with the aspect of multiplayer surrounding it. Any projects here are made for fun and for people to enjoy them. Nothing more. All rights belong to Scott Cawthon.</em><br/><em>(FNaF 2 will be uploaded eventually, there will be more updates afterwards.)</em></p>\n\n<p>Gameplay:</p>\n<p>Welcome to your new summer job at Freddy Fazbear's Pizza, where kids and parents alike come for entertainment and food as far as the eye can see! The main attraction is Freddy Fazbear, of course; and his two friends. They are animatronic robots, programmed to please the crowds! The robots' behavior has become somewhat unpredictable at night however, and it was much cheaper to hire you as a security guard than to find a repairman.\r\n</p>\n<p>As the new security guard working nights, your job is to monitor cameras and make sure nothing goes wrong after-hours. The previous guard has complained about the characters trying to get into the office (he has since been moved to day-shift). So to make your job easier, you've been provided with your very own empty Freddy Fazbear head, which should fool the animatronic characters into leaving you alone if they should accidentally enter your office.<br/><br/>As always, Fazbear Entertainment is not responsible for death or dismemberment.\r\n</p>\n\n<p>Fnaf Multiplayer:</p>\n\n<p>Play as either Freddy, Bonnie, Foxy, Chica or the Toy Versions, or even the guard himself! You can win trophies, prizes, and keep scores! No Gamejolt account? No problem! You can log in as a guest and still have all the fun experiences playing with your friends! In order to join lobbies, you can simply type the name of your friend's lobby and join instantly! You can make your own lobby and share the name or you can see all the public listings and play with others! <strong>No</strong> special apps, or games required. Just download the game and play straight away with your friends!</p>\n\n<p>System Requirements:</p>\n\n<p>OS: XP, Vista, Windows 7, Windows 8, Windows 10\r\n</p>\n<p>Processor: 2 GHz Intel Pentium 4 or AMD Athlon or equivalent\r\n</p>\n<p>Memory: 1 GB RAM\r\n</p>\n<p>Graphics: 1 GB\r\n</p>\n<p>Direct X: Version 9.0\r\n</p>\n<p>Storage: 200 MB available space</p>\n\n<p>We Moved The Fangame From Gamejolt To Itch.io</p>\n\n<p>But You Need To Login In Gamejolt To Login In FNAF Multiplayer </p>", "metacritic": null, "released": "2022-03-27", "tba": false, "updated": "2022-03-28T05:35:18", "background_image": "https://media.rawg.io/media/screenshots/9e5/9e5eeeb80ade86ce4c810e3d54bc552a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheJayPlayz"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}