{"id": 760864, "slug": "memoires-de-fer", "name": "Mémoires de fer", "name_original": "Mémoires de fer", "description": "<p><em>« Mon Alix,<br/></em><em><em>Le cancer me rattrapera bientôt. Je suis désolé de n’avoir jamais pris le temps d’en parler avec toi.</em><em><br/><em>J’ai besoin que tu fasses quelque chose pour moi.</em></em><em> </em><br/><em>Tu as une famille que tu ne connais pas, J'ai deux frères et une sœur. Ça fait 40 ans que je ne leur ai plus parlé, ils ne se parlent plus non plus d’ailleurs.</em><em><br/><em>J’ai besoin que tu fasses quelque chose pour moi si tu veux en savoir plus à propos d‘eux.</em></em><br/><em>C’est une grande souffrance pour moi de partir en laissant les choses ainsi, avec ces silences entre nous.</em><em><br/><em>J’aimerais que tu essayes de reconstituer le cours des évènements en leur parlant. Peut-être parviendras-tu à recréer un dialogue entre eux.<br/></em></em><em><em>Je t'aime. »</em></em><br/></em></p>\n<p><strong>Mémoires de fer</strong> est un visual novel social et familial. Alix doit faire la lumière sur le passé de sa famille. Entre discussion avec des parents inconnus, vieilles rancœurs familiales et désindustrialisation, pourrez vous l'aider à réconcilier les mémoires d'une famille éclatée et réaliser les volontés de son père ?<br/></p>\n<p><strong>Mémoires de fer</strong>  a été conçu et réalisé par des  étudiants du master Audiovisuel, médias numériques interactifs, jeux de l'Université de Lorraine, dans le cadre de <em>Memories, Images &amp; History </em><em>accross borders</em>, projet  co-produit par l'INA, l'université de Lorraine  (Crem, Crulh et Loterr) et le CNA. Inscrit dans le programme de la manifestation Esch'2022 capitale européenne de la culture, ce projet est labellisé \"Présidence française du Conseil de l'Union européenne 2022\". Il s'inscrit dans la fresque vidéo de l'INA <em>Au fil de l’Alzette… Territoires et destins partagés</em>.</p>\n\r\nLogos de l'INA, de l'Université de Lorraine, Memories, Images &amp; History  accross borders et Esch'2022 capitale européenne de la culture", "metacritic": null, "released": "2022-03-26", "tba": false, "updated": "2022-03-28T06:28:17", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b27d6c79825bcb15e7facfa68655778.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MetzJeu", "Enoryel", "Jokerleouf"], "genres": [], "publishers": [], "esrb_rating": null}