{"id": 760879, "slug": "tots-c-the-officialist-tigerj-stream-companion", "name": "tots-c! The Officialist TigerJ Stream Companion!", "name_original": "tots-c! The Officialist TigerJ Stream Companion!", "description": "t.o.t.s.-c.!\r\n<em>The Officialist TigerJ Stream Companion</em>\n<p>Welcome to the EXTREMELY early access page for tots-c! (pronounced \"tot-see\")</p>\n<p><strong>What is tots-c?</strong></p>\n<p>tots-c is a companion app for the TigerJ game jam streams (https://www.twitch.tv/tiger_j). It allows you to browse the archive of streamed game jam games with links to the games, their streamed moments (highlights) and other cool stuff!</p>\n<p><strong>How do I use this?</strong></p>\n<p>\n</p>\n<p>A web version is currently being developed which will appear Is at the top of this page, and a downloadable version is available for windows and linux. A mac version is on the way too. Simply download and unzip/run the program, or click \"Run Magical Thingy\" on the web player. </p>\n<p>There is a button on the top right to switch between the archive of streamed games and the live queue.</p>\n<p><strong>I feel like there is lag, it doesn't seem to update instantly..</strong></p>\n<p>Yup! it checks for a new json file every minute for the live queue. The file is written based off the current live queue every 5 minutes. So there will be a small amount of delay.</p>\n<p><strong>Why is this a thing?</strong></p>\n<p>In the olden days, many moons ago, I used to use public spreadsheets and manually maintained the queue by copy and pasting from chat. A few years ago I changed this to an automated process using bots, but the downside is I implemented a database instead of using spreadsheets which inadvertently disabled the ability for any viewers to see and/or interact with the queue(s). tots-c restores the ability for viewers to engage with the submission list and archive. </p>\n<p><strong>There is a bug what do I do..?</strong></p>\n<p>Comment in the community thread: https://itch.io/t/2012018/suggestions-and-bugs</p>", "metacritic": null, "released": "2022-03-26", "tba": false, "updated": "2022-03-28T06:32:04", "background_image": "https://media.rawg.io/media/screenshots/bb1/bb1356f541c53edf0387cf10d777b875.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Linux", "Web"], "developers": ["TigerJ"], "genres": [], "publishers": [], "esrb_rating": null}