{"id": 7609, "slug": "ar-defender-2", "name": "AR Defender 2", "name_original": "AR Defender 2", "description": "AR Defender 2 is a multiplayer tower defense game with Augmented Reality capability!<br/><br/>Ready for battle?!<br/><br/>Defend your base at all costs: repel wave upon wave of enemies who will do their damnedest to destroy your tower. Position your defensive turrets and embody any one of six heroes, each with their own unique gameplay. Plenty of variety, no end of fun!<br/>Whatever your style, you’ll find the right ally for you!<br/><br/>Play where you like: on your bedroom floor, in the garden, in the street… simply place an easy-to-print marker on the floor and the battle comes to life before your eyes, in the real world!<br/>For even more fun, play in co-op with three of your friends, using the Wi-Fi function, and join in the competition for the best score.<br/><br/>Features:<br/>- Play in augmented reality mode or classic mode at the press of a key<br/>- Unblock up to 6 heroes with different gameplay styles<br/>- 9 types of upgradable turret to defend your position<br/>- Confront more than 15 different types of enemy!<br/>- 40 levels, in four different virtual environments… or an infinity of real ones!<br/>- Up to four players can play at once over Wi-Fi<br/>- Universal application, Retina and iPhone 5 compatible<br/><br/>-------------------------------<br/>CURIOUS? More info on: <br/>-------------------------------<br/>bulkypix.com<br/>facebook.com/Bulkypix<br/>twitter.com/Bulkypix<br/>youtube.com/Bulkypix", "metacritic": null, "released": "2012-12-13", "tba": false, "updated": "2023-08-10T22:36:36", "background_image": "https://media.rawg.io/media/screenshots/cc3/cc32abf890c3630ca432cc3ec1e3ac57.jpeg", "website": "http://www.bulkypix.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Bulkypix"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": "Everyone 10+"}