{"id": 760965, "slug": "metrosync-by-eric-henneke", "name": "MetroSync by Eric Henneke", "name_original": "MetroSync by Eric Henneke", "description": "<p><strong>“MetroSync”</strong><strong>  by Eric Henneke  </strong>\n</p>\n<p><strong>2022 BASIC 10-Liner  PUR-80</strong>\n</p>\n<p><strong>Coded in Atari BASIC for Atari 8-bit Computer systems</strong>\n</p>\n<p> \r\n  </p>\n<p><strong>Objective:</strong>\r\n In the virtual future, life is dominated by a never-ending quest to acquire as many “Experience Tokens” as possible (since these Tokens are the only way for people to experience anything of interest in the virtual world… they are the single remaining source for the spice of life). \r\n  </p>\n<p>Behind the scenes, these Experience Tokens are exchanged via a complex network known as the MetroSync.  Deep within the cogs of the MetroSync, your Avatar must navigate a mesh of Synchros, Interconnect Paths, and Redirection Routers, to locate and secure new Experience Tokens. Never yielding, and in a perpetual state of chaotic motion, the MetroSync is an intimidating, pulsing vortex of energy, always working to grind up and dispose of your vulnerable Avatar. \r\n  </p>\n<p><strong>Your mission is very straight-forward: Navigate the MetroSync by guiding your Avatar through Interconnect Paths and Synchros to secure as many Experience Tokens as possible before your Life Energy is depleted. </strong>\n</p>\n<p>Be forewarned that the MetroSync will be incessantly working to cleanse itself by grinding up your Avatar and jettisoning it off the grid in short order.  When your Avatar is expelled off either side of the MetroSync grid, you will lose an entire unit of Life Energy and must re-enter the grid and repeat your quest.   \r\n  </p>\n<p>In your journey, you will also encounter Redirection Routers.  The Redirection Routers can be both your best allies, as well as your worst enemies.  For when your Avatar engages a Redirection Router, all of the motion of the MetroSync immediately reverses.  You can use this to your advantage as a way to influence the flow of the MetroSync, or you can be manhandled and expelled, swept up in a moment of redirection gone afoul. \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Gameplay:</strong>\n</p>\n<p>Your Avatar will start at the bottom of the MetroSync grid.  And the first Experience Token will appear somewhere at the top of the grid.  \r\n  </p>\n<p>Seek the fastest path to secure the Experience Token on the opposite side of the MetroSync since your Life Energy (denoted by the energy bar at the top of the screen) will constantly be trickling away. \r\n  </p>\n<p>But you must be cautious in your journey as well, because if you are careless and allow your Avatar to be expelled off either side of the grid, you will lose an entire unit of Life Energy and be forced to repeat your efforts from the original entry point. \r\n  </p>\n<p>If you are successful in traversing the grid and you secure the Experience Token, a new Token will appear at the bottom of the grid.  Now you must navigate downward through the MetroSync once again, in pursuit of the next Token.  And on it goes, as the insatiable quest for Experience Tokens will continue indefinitely until your Life Energy is exhausted.\r\n  </p>\n\n<p>\n<strong>Scoring:</strong>      +1 point for each Experience Token secured \r\n  </p>\n<p> \r\n  </p>\n<p><strong>Controls:</strong>\r\n Use the joystick to move up or down across the MetroSync.  \r\n  </p>\n<p>Left and right movement is achieved by riding on the ever-moving Synchros that make up the MetroSync grid. \r\n  </p>\n<p>When the game is over, start a new game by pressing the fire button. \r\n  </p>\n\n<p><strong>\r\n Compatibility:</strong>\r\n Works on Atari 8-bit computer systems with Atari BASIC loaded. \r\n</p>", "metacritic": null, "released": "2022-03-26", "tba": false, "updated": "2022-03-28T06:54:28", "background_image": "https://media.rawg.io/media/screenshots/4e7/4e74a861a0326039fd9b96fb2d196182.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BASIC 10Liner"], "genres": ["Action"], "publishers": [], "esrb_rating": null}