{"id": 761007, "slug": "triangels", "name": "TriAngels", "name_original": "TriAngels", "description": "<p>If you are having problems with the browser version, try the downloaded version.<br/></p>\n<p>TriAngels is an arcade color-matching puzzle game. Drop triangles! Make same-color sides touch, and the triangles will clear after 4 seconds, giving you points. Connect multiple triangles together to get even more points!</p>\n<p><strong>Modes:</strong></p>\n<ul><li>Dig deep: Field starts full of triangles. Clear all triangles above the line to score 50,000 points, and spawn more triangles. With both digging and chains, score as much as possible in 2 minutes.</li><li>Versus: Play dig mode vs. a CPU or another local player. Scoring points will send extra triangles to your opponent! The first player to clear all triangles above the line, or top their opponent out, wins.</li><li>Take your time: Matched triangles stay lit up until you drop a triangle that doesn't match anything. The game ends when you drop your 60th triangle. Score as high as possible!</li><li>Go go go: Field starts empty. Score as much as you can in 2 minutes!</li><li>Triathalon: Play all three singleplayer modes back to back, and score as high as you can!</li></ul>\n<p><strong>Keyboard Controls:</strong><br/>Move left/right: A/D, Left/Right<br/>Rotate counterclockwise/clockwise: Z/X, Q/E, Num7/Num8, Num2/Num6<br/>Hard drop: Space, W, Up<br/>Soft drop: S, Down<br/>Pause: Esc, P, Backspace, Shift</p>\n<p><strong>Gamepad Controls:</strong><br/>Move left/right: DPad, Left stick<br/>Rotate counterclockwise/clockwise: Xbox A/B, Xbox X/Y, Nintendo B/A, Nintendo Y/X,<br/>                    Playstation Cross/Circle, Playstation Square/Triangle<br/>Hard drop: DPad up, Left stick up, R1, L2<br/>Soft drop: DPad down, Left stick down, L1, R2<br/>Pause: Start</p>\n<p><strong>Mouse Controls:</strong><br/>Move left/right: Move mouse cursor<br/>Rotate clockwise: Right click<br/>Rotate counterclockwise: Side button click<br/>Hard drop: Left click<br/>Soft drop: Middle click<br/>Pause: Esc, P, Backspace, Shift<br/></p>\n<p><strong>Tips:</strong></p>\n<ul><li>In every mode except Take your time, you can drop pieces to the side and still continue a chain of matches. If you don't have the right colors, drop pieces to the side (or work on a second chain at the same time)!</li><li>Chains of triangles instantly clear if you make 5 normal matches. This can be useful in Dig mode, instead of waiting for triangles to vanish.</li><li>Balancing a triangle on its point and then dropping another to push the first over into a match is worth extra points, and also doesn't count toward the 5 match cap. This is one of the best ways to boost your score. On the other hand, starting the tumble by clearing triangles underneath will award no points if the tumble results in a match.</li><li>Dropping a triangle that matches two neighboring pieces counts as 1 match, but it scores extra points.When attacked in Versus mode, you won't receive damage until your active chains time out. You can keep them going to stall for a little bit.</li></ul>", "metacritic": null, "released": "2022-03-26", "tba": false, "updated": "2022-03-28T07:07:57", "background_image": "https://media.rawg.io/media/screenshots/2cd/2cd5120ca89327a081dadd22e3de2d85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Web"], "developers": ["Boatsand Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}