{"id": 76119, "slug": "day-r-premium", "name": "Day R Premium", "name_original": "Day R Premium", "description": "Can you survive in the world destroyed after a nuclear war? With radiation, hunger and diseases around you. You have to cross the whole country and save your family. Who knows if they are alive, or maybe radiation and deadly virus have already reached them? Reveal a secret of the apocalypse and get your memories back during a journey across the huge territory of the USSR in the 80th. <br/><br/>It is not easy to survive after apocalypse. You'll face the real hungry games! Monsters, zombie, thirst, uncountable diseases and injuries, blood-thirsty enemies – you have to fight it all. Craft all your resources: weapons, clothes, means of transport. <br/><br/>- Hardcore survival:<br/>Hunger, zombie and radiation won't give you a chance to relax.<br/><br/>- Realistic world:<br/>The turn of the seasons, huge map of USSR and more than 2500 different towns and cities. Hunt animals, but be careful: even rats can injure you seriously! Explore the wilderness!<br/><br/>- A lot of opportunities:<br/>Multicraft, obtaining skills, hundreds of crafting schemes, a lot of ammunition.<br/><br/>- People and stories:<br/>Interesting quests and helpful allies. An open game world.<br/><br/>- Improve your skills:<br/>Mechanics, medicine, chemistry and many others.<br/><br/>- Cooperative mode:<br/>The Online mode  with a chat room, exchange of items and united fightings. Multiplayer survival game.<br/><br/>Benefits of Premium version: <br/>- 2500 caps every new game<br/>- button \"Disable ad\" <br/>- save in any place <br/>- chat without any limitations <br/>- sending parcels without any limitations <br/>- access to all kinds and colors of map markers.<br/><br/>Survive in post-nuclear USSR: defeat diseases, hunger and enemies! Play Online also! Survive with other players together.<br/><br/>Explore the abandoned houses and shelters. Find weapon and build transport using various materials.<br/>Remember everything you learnt on chemistry and physics! It is the most realistic surviving game! <br/><br/>Features: <br/>- Сraft system – get resources, hunt, find useful objects or weapon and create your own one! <br/>- Hardcore simulator of survival <br/>- Journey across the wilderness map in the multiplayer mode <br/>- Choose the difficulty mode: sandbox, real life or online<br/>War never changes. In 1985 USSR went down before an unknown enemy. In a few days the entire country became a radioactive wasteland - violence, hunger and diseases reign here now. When you no longer loose in the fight with the death, the other survivors wait for you in the cooperative - the Online mode let you survive together dealing with difficulties, talking in the chat room and sending gifts to each other.<br/><br/>License agreement: https://dayrtech.ru/conditions/en/", "metacritic": null, "released": "2016-02-02", "tba": false, "updated": "2019-08-02T05:05:07", "background_image": "https://media.rawg.io/media/screenshots/57b/57b4c22b697b774ed96afe76c0d188a1.jpg", "website": "http://vk.com/day_r_android", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 395, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["tltGames", "TLT GEIMS, OOO"], "genres": ["RPG", "Simulation"], "publishers": ["TLT GEIMS, OOO"], "esrb_rating": null}