{"id": 76120, "slug": "grand-heist-online-2", "name": "Grand Heist Online 2", "name_original": "Grand Heist Online 2", "description": "The best open-world action-adventure is back! The beautiful Rock City needs a true hero<br/>to became a safe city again! Make heists, expose corrupt cops, free the city of gangsters and criminals! <br/><br/>Are you ready for the challenge? Your brave actions will determine the future of Rock City!<br/><br/>Drive a thousands of free vehicles, ships, airplanes and helicopters! You have even a war tank! The fun is guaranteed in this game!<br/><br/>The action took place in Rock City and choose a huge set of guns for your arsenal. Enjoy the best graphics ever seen on mobile and fell free to play all special heists and missions!<br/><br/>You are the boss! Choose if you gonna play with Isabella or Edward to free Edward, an ex condemned, for the pursuit of gangsters and criminals. Make heists to empty their money and win this fight!<br/><br/>As you progress in the game many challenge situations are going to happens! Be ready for a real open-world experience!<br/><br/>MAIN FEATURES:<br/>- 17 guns, machine guns, explosives and rocket launchers<br/>- Open-World city with everything you expect of it: airport, skyscrapers, slums!<br/>- Gangsters wars, fighter missions, heists, police pursuits!<br/>- Action from the beginning to end!<br/><br/>If you like open-world games, with a lot of action, gangsters, corrupted cops, amazing graphics and free to choose characters and missions: be prepared! <br/><br/>You gonna love Grand Heist Online 2!", "metacritic": null, "released": "2017-11-30", "tba": false, "updated": "2019-09-06T03:32:47", "background_image": "https://media.rawg.io/media/screenshots/86d/86d00de24141f4fc62d958f4df9614e6_2NONYd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thetis Consulting"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Thetis Consulting"], "esrb_rating": null}