{"id": 761374, "slug": "my-little-colony", "name": "My Little Colony", "name_original": "My Little Colony", "description": "In <strong>My Little Colony</strong>, you play as an aspiring ant keeper. My little colony is a 2D ant simulator game which uses game play elements such as simple clicking and dragging actions to build your colony. Players will get to relax and sit while watching their colony grow to ensure players are at ease while your colony does all the work! You will get to choose your colony from Black ants to Fire ants and more. Build and connect more ant setups in thousands of different combinations, only limited by your imagination, around your room to expand your colony. But make sure your queen has all the food and water she needs to keep the colony growing! Good luck! <br/><br/>You as a player will get to start by selecting which ant species you like. Once selected your desk can now start holding your colony. As the colony progresses you will need to buy and store food for your ants as well as build more nests and homes for your ants. Over time your colony will grow and expand in size. As well as the need for maintenance. But don't worry with the use of food and build menus you will quickly get a hold of what its like to have your own ant colony!<br/><br/>Ant Care/Earnings<br/>Ants in your colony will need to always have food and water. The queen and the ants all have a timer where they must get one of each resource per minute otherwise the colony will be at risk of dying. Players must make sure to maintain this as the colony grows and consumers more food. To get food players must purchase food from the food menus earned from hatching ants.", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T03:51:36", "background_image": "https://media.rawg.io/media/screenshots/c5d/c5d0a62f87c4b6efbb72a882669526f8.jpg", "website": "https://forms.gle/e66r8GZrJz3UyHoq7", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrew Sepulveda"], "genres": ["Simulation"], "publishers": ["Andrew Sepulveda"], "esrb_rating": null}