{"id": 76133, "slug": "bicycle-race-rider-pro", "name": "Bicycle Race Rider Pro", "name_original": "Bicycle Race Rider Pro", "description": "Viking Studio would like to welcome you to our cycle racing simulation game. Bicycle Race Rider Pro is a special design for highway game fan who love racing. Bicycle Race Rider Pro is the best racing game with insane and stunt action! That is the perfect game for speed on a bicycle. Racing games have never been this much fun! How fast can you go as a driver? Even more important, how fast can you go on a Bicycle Race Rider Pro and have perfect control at the same time? This game gives you the opportunity to show the world you are a talented driver racer and a hero in this fast and furious cycle racing game.<br/><br/>▶ GAME MODES ◀<br/>- 5 Knockout Levels<br/>- Futuristic stunts<br/>- Race with other opponents.<br/><br/><br/>Bicycle Race Rider Pro Features:<br/><br/>•\tDetailed environments with different Views.<br/>•\tKnockout gameplay for hour-long playing.<br/>•\tAbsorbing gameplay<br/>•\tRealistic Sound Effects<br/>•\tDo Stunts while trying to be on First position.<br/>•\tFuturistic HD 3D Graphics.<br/>•\tFuturistic game Environment<br/><br/>Bicycle Race Rider Pro is one of the best new generation bicycle racing games. Let’s take you on another journey in bicycle rider race games that gives you the enjoyment of riding a real bicycle racing and Moto drag simulator. Full of killer tricks, awesome freestyle action and insane stunts. Bicycle Race Rider Pro Simulator is a high paced racing adventure! <br/>Get through the futuristic sports bicycle in this addictive game. If you love Tour de France, bicycle sports and endless traffic racer games you will love this! <br/>This Bicycle Race Rider Pro racing game is involving the sports bicycle in the bicycle race and real action with the bicycle simulator. Being a best sports bicycle rider, it’s time for you to perform the wonderful bicycle rally with one of the best Sports bicycle. So get set to show some extreme stunts to ride the bicycle race in the newest combination of bicycle racing games. Play the true game of war on the highway. Artificial intelligence advance made the life much easier.<br/><br/>You know, you will love it in the first time you see it. Drive your motor to rush on the roads in rush hours! You will enjoy an unbelievable speed feeling. If you are thinking about a bicycle mobile game then this is exactly what you need. Use all your Ninja, Taekwondo, Maui Thai, Boxing, futuristic robot and other fighter skills &amp; racing skills.<br/>Let’s take you on another journey in futuristic bicycle race games that gives you the enjoyment of riding a real sports bicycle racing and Moto drag simulator. If you love racing games, cycle game, bicycle games, Futuristic robot games, death racing games, furious racing, police car racing and traffic racing games then you’ll love this Bicycle Race Rider Pro game.<br/><br/>Bicycle Race Rider Pro will be updated according to your suggestions. Don't forget to leave a review with your feedback.", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2019-10-22T14:24:05", "background_image": "https://media.rawg.io/media/screenshots/11c/11ce325161609dd85b32244213144d1d_JIQfhBz.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": [], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}