{"id": 761356, "slug": "murasame", "name": "Murasame", "name_original": "Murasame", "description": "<strong>RPG that walks with romantic comedy</strong><br/><br/><strong>■What is \"Murasame\"?</strong><br/>There are laughter, tears, and a little sadness.<br/>Here comes the slapstick fantasy love-comedy RPG!<br/><br/><strong>■Charming heartwarming romantic comedy story</strong><br/>The dichotomy between gag and serious!<br/>The curtain rises on a romantic comedy that mixes in perfect balance and is sure to make your heart pound!<br/><br/><strong>■Heroines with too much individuality</strong><br/>All the heroines are troublesome!<br/>The story accelerates in an oblique direction due to the outbursts of the super troublesome heroines with too many quirks!<br/><br/><strong>■Casual and easy-to-play game system</strong><br/>The scenario is divided into fast-paced episodes and<br/>The intermission between each episode strengthens the character and progresses the quest!<br/>For users who are not good at fighting, there is a \"cheat mode\" that starts at the strongest Level max!<br/><br/><strong>■Additional elements for the Switch version included</strong><br/>EX scenario \"Seiou no Butokukai Hen\" added after clearing the main story<br/>New characters \"Brünnhilde, Sword Princess of the White Silver Sword\" and \"Glenn, Deputy Commander of the Order of the Holy Emperor<br/><br/><strong>■Synopsis</strong><br/>Excalibur, the sword-and-dragon dragon, suddenly appeared in the Highland Holy Empire.<br/><br/>Before the overwhelming power of the Sword Demon Dragon and its absolute defensive barrier that nullifies all attacks<br/>The Knights of the Holy Order of the Highlanders were helplessly defeated, and a city was destroyed.<br/><br/>Yuto, who lost his own sister, Yurihime, to the disaster.<br/>A girl with the only sword that can kill the avenging Sword Demon Dragon, \"Sword Breaker\".<br/>Satsuki, a young woman with a strong sense of humor.", "metacritic": null, "released": "2022-04-03", "tba": false, "updated": "2022-04-04T03:26:48", "background_image": "https://media.rawg.io/media/screenshots/3a5/3a5b221ffbcc517862b62907797fa0c5.jpg", "website": "http://iron-sword.sakura.ne.jp/murasame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["あいあんそぉど"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["あいあんそぉど"], "esrb_rating": null}