{"id": 761365, "slug": "tumbleweed-destiny", "name": "Tumbleweed Destiny", "name_original": "Tumbleweed Destiny", "description": "<strong>The eighth of low-price series of Kimidorisoft! \"LOST BUBBLES: Sweet mates\" appeared!</strong><br/><br/><strong>For video creators and streamers</strong><br/>KIMIDORI SOFT permits monetization through partner programs using KIMIDORI SOFT games.<br/><br/>The somewhat hateful and slightly charming tumbleweed is the star of the game.<br/>This game is a tumbleweed life simulator that depicts the fate of tumbleweeds in my own imagination.<br/><br/>Why do tumbleweeds tumble?<br/>Where are the best tumbling fields?<br/>What lies beyond the tumbled...?<br/><br/>\"Hey, do you want to tumble with me?\"<br/><br/><strong>Game overview:</strong><br/>The game system is similar to a clicker game. The difference from clickers is that you do not earn points by clicking, but by tumbling weed and breaking cacti.<br/>Operate tumbleweeds and explore the wilderness. Through their adventures, they grow, learn new truths, meet new friends, and experience a variety of things.<br/>Tumbleweeds earn TP (Tumblepoints) by moving. Use the TP you earn to gain abilities and increase your TP even more efficiently.<br/><br/><strong>Feature:</strong><br/>Online multiplayer: Up to 16 players can play together. There are quick matches and friend matches, both of which you are free to enter and exit at any time. In Quick Match, soaps from all over the world are trying to reach the soap holder at their own pace. In Friend Match, you can easily play with specific friends only by using one keyword. Of course, you can also play alone.<br/><br/>Growth: You can use the TP (tumble points) you get from rolling to grow.<br/><br/>Living proof there: Tumbleweeds are alive. What is alive will eventually die. But when the plant dies, a new life will sprout in it.", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-11-07T14:43:16", "background_image": "https://media.rawg.io/media/screenshots/2dd/2ddb3ab2ed030e9363600786892ea84b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "beaten": 2}, "playtime": 2, "achievements_count": 12, "ratings_count": 2, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["KIMIDORI SOFT"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["KIMIDORI SOFT"], "esrb_rating": null}