{"id": 76132, "slug": "flight-simulator-flywings-online-2014-premium", "name": "Flight Simulator FlyWings Online 2014 Premium", "name_original": "Flight Simulator FlyWings Online 2014 Premium", "description": "WEEKEND OFFER --&gt; 50% PRICE CUT!!!<br/><br/>Flight Simulator X 2014 is the most advanced simulation already developed for MacOSX. <br/><br/>We have been improving the physics for years, and finally we are proud to announce our flight simulator! <br/><br/>Prepare for the real experience of flying a aircraft over New York city! <br/>Choose one of the most famous airports in the world and fly with more than 16 aircraft, over 400 different missions! <br/><br/>The game also simulates weather conditions, with clear sky, thunderstorms, turbulence and more! <br/><br/>Become a Airliner Pilot, freelance pilot, military skilled pilot or a acrobatic pilot! Your choice! <br/><br/>We created 4 separate sets of planes: <br/>- learning aircraft <br/>- commercial aircraft <br/>- cargo and transportation aircraft <br/>- military jets <br/><br/>Those are the planes you can choose: <br/>- Boeing 747-400 <br/>- Boeing 757 <br/>- Boeing 707 <br/>- Airbus A320 <br/>- Cessna 172 <br/>- Beech Musketeer <br/>- Learjet 60 xr <br/>- Antonov Av-12 <br/>- Antonov Av-24 <br/>- British Aerospace BAE 147 <br/>- F-18 <br/>- F-22 <br/>- F-86 Saber <br/>- MIG-29 <br/>- SU-35 <br/>- Antonov Av-24 Militar <br/><br/>And also, we created the 8 detailed airports in New York City <br/>- La Guardia international Airport (LGA) <br/>- John F Kennedy International Airport (JFK) <br/>- Newark Liberty International Airport (EWR) <br/>- Essex County Airport (CDW) <br/>- Morristown Municipal Airport (MMU) <br/>- Lincoln Park Airport (N07) <br/>- Teterboro Airport (TEB) <br/>- Linden Airport (LDJ) <br/><br/>FEATURES: <br/>- 16 aircraft <br/>- 400 missions <br/>- Exclusive missions depending on your aircraft! <br/>- Military Jet exclusive missions <br/>- Detailed airports <br/>- Detailed world, with threes, buildings, clouds, water and ocean. <br/>- Functional instruments. <br/>- 2 types of controls: Accelerometer or touch to control the aircraft. <br/>- Dynamic instruments <br/><br/>Some technology provided by Nasa: <br/>- Realist terrain using Nasa’s photos and elevation. <br/>- Using Nasa’s utility FoilSim 3 to calculate the physics of the airplane (really realistic). <br/>- Using real airfoils from our library in the aircrafts, like NACA airfoils and BAC airfoils. <br/><br/>Real world simulation: <br/>- Weather forecast (clear sky, some clouds, raining and storms) <br/>- Turbulence and G-Force <br/>- Real clouds <br/>- Crashes and fire on engines. <br/><br/>We are thinking everything we can to improve the flight simulator experience! So please, feel free to contact us to give your feedback! <br/><br/>Have a nice flight pilot!", "metacritic": null, "released": "2014-05-08", "tba": false, "updated": "2019-09-06T03:32:53", "background_image": "https://media.rawg.io/media/screenshots/a97/a979de4ffccf98ef566fe317ac844f0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Thetis Consulting"], "genres": ["Action", "Simulation"], "publishers": ["Thetis Consulting"], "esrb_rating": null}