{"id": 761417, "slug": "planet-td-2", "name": "Planet TD", "name_original": "Planet TD", "description": "<h3>Key features:</h3><ul><li>An epic defensive battle!<br/></li><li>Easy and fast gameplay!<br/></li><li> Replayability with different strategies!<br/></li><li> Sweet Low Polygon graphics!<br/></li><li> 6 different types of towers!<br/></li><li> Different upgrade options for each tower!<br/></li><li>Possibility to develop 3 levels for towers during the game!<br/></li><li>Level dependent enhancement options!<br/></li><li> 4 planets with different characteristics!<br/></li><li>Snowy and glacial maps, Desert and arid lands, Greenery mountainous<br/></li><li> 25 different enemies. Drones, Tanks, Biorobotic enemies and many different ground and air vehicles!</li></ul><br/><br/><br/>Prepare to defend the solar system against invaders! The solar system, which has been living in peace for years, is occupied by robots sent by an advanced civilization. There are 4 different planets in this star system that you have to defend. <br/><br/>Between mountains, forests, glaciers, and deserts, you must defend your lands and fend off invaders in order to achieve victory and set your civilization free again. While making your defense, you should use 6 different towers in the most strategic way. <br/><br/>By paying attention to resource management and making tower upgrades correctly. You have to place the towers in the correct positions.<br/><br/><strong>Tower rarity mechanic:</strong> Each tower starts with 1st level rarity at the beginning of the game, this level can be improved with in-game experience. <br/>There are 4 different colors for each tower: blue, green, red and yellow. As you go from blue to green, the towers get stronger. <br/><br/>When you build the tower during the game, a tower of these 4 colors is produced depending on the rarity level of that tower. The higher the level, the higher the probability of getting a yellow tower. As the power of the towers increases with the colors, the amount of back sales also increases. <br/><br/>When you produce a yellow tower, you can sell it for a higher price than your purchase price. At this point, tactics come into play. Will you strengthen your economy and fight with more towers or will the strong tower be enough for you?", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T05:12:10", "background_image": "https://media.rawg.io/media/screenshots/e6f/e6f267a1635636acf0aa15077f6a6544.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 3}, "playtime": 0, "achievements_count": 61, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MD Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Next in Game"], "esrb_rating": null}