{"id": 761424, "slug": "the-ditty-of-carmeana", "name": "The Ditty of Carmeana", "name_original": "The Ditty of Carmeana", "description": "An epic action-adventure video game that is definitely <strong>not</strong> a legend.<br/><br/><br/>If you're looking for a game where you blow up a lot of stuff or murder a lot of people... this is not your game.<br/><br/>If you're looking for a game that's a beautiful visual spectacle... this is not your game.<br/><br/>But, if you're looking for witty razor-sharp satire on the themes of video games in our society... this is still not your game.<br/><br/>If you are looking for a zany spoof in the style of Monty Python and Mel Brooks... this is your game.<br/><br/><br/>The beautiful, redheaded, and obnoxiously thin Princess Carmeana has been kidnapped and held ransom. The King, not wanting to incur the expense of deploying the army, decides to recruit a \"fairy boy\" to Rescue the Princess™. Meanwhile, there lived a poor farm boy named Kai (pronounced \"Lance\"). One day as he was trudging back to town, he encountered a fairy named Tabitha and saved her from financial ruin. Tabitha decided to tag along with Kai for awhile (it was the least she could do). As luck (or Destiny, depending on whether you believe Tabitha or Kai) would have it, they soon encountered an army recruiter who was looking for a \"fairy boy\". Kai's Glorious Quest™ to save the hot rich skinny redhead had begun.<br/><br/>In this third-person action adventure, Kai will travel all over the ostensibly medieval kingdom of Bowtudgel (rhymes with \"cow cudgel\") in his quest to Rescue the Princess™. Along the way, he will solve puzzles, make money, conquer a set dungeons that are one-to-one with the Kingdom's major biomes, help people (sort of), kill enemies (sort of), buy hats, and find future DLC sidequests that you know very well the game developers will never get around to making.  Along the way, he'll discover that there might be something even bigger at stake than a missing princess....", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-04-04T05:35:37", "background_image": "https://media.rawg.io/media/screenshots/c85/c85c3a532f3025ba85df0e75bf43e385.jpg", "website": "http://www.thedittyofcarmeana.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tampered Evidence"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Tampered Evidence"], "esrb_rating": null}