{"id": 761448, "slug": "imperial-grace", "name": "Imperial Grace", "name_original": "Imperial Grace", "description": "The free demo version of Imperial Grace is available on GOG.COM. You can download it  here<br/><br/>\n<p>\nThis game is intended for a mature audience. It includes verbal (but not visual) descriptions of violence and consensual sex (optional). The game, especially through the petitions, also alludes to topics that may be sensitive, such as arranged marriage or suicide.\n</p><br/>\n<br/>\n<br/>\nImperial Grace is a visual novel / otome game, focusing on politics and romance in an imaginary medieval world. As the new Empress of Calidya your choices will determine your future and your kingdom's, so rule wisely. \n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nPlay as a strong and ambitious woman, and hold an entire country in the palm of your hand. Thanks to the many choices offered throughout the game and the avatar customisation options, become the Empress you want to be! \n<br/>\n<br/>\n<br/>\n<br/>\nFall under the charm of the three love interests and their flamboyant personalities, and discover the kingdom of Calidya through colourful and well-developed secondary characters. \n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nGuide your subjects by addressing their petitions, and navigate the crises unsettling your realm. It's up to you to tackle the many dilemmas that will change the history of Calidya... for better or for worse.\n<br/>\n<br/>\n<br/>\n<br/>\nEnjoy the story with infinite resources, or spice up your game by wisely managing your kingdom's resources, making each choice even more difficult.\n<br/>\n<h3>Join our community</h3>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-04T06:51:12", "background_image": "https://media.rawg.io/media/screenshots/ec4/ec4b3a9420cadd4aa8f6973406e7ea0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Synstoria"], "genres": [], "publishers": ["Abiding Bridge"], "esrb_rating": null}