{"id": 761519, "slug": "dealers-trick", "name": "Dealer's Trick", "name_original": "Dealer's Trick", "description": "<p>This is my submission for Ludum Dare 50. Webgl build is pending when I have more time   In this game you are the dealer at a table of players playing a trick taking game, every round you must decide which player gets each card and which one to shuffle back into the deck. </p>\n<p><strong>How to play (todo)</strong><br/></p>\n<p>Every round you draw 4 cards from the deck.    You must choose one to give to  each player and one to shuffle back in the deck.    To make a choice, hover over a card and  hit the number key on your keyboard associated with the player (return to deck is 4 or space).  </p><p>Once you have finished dealing cards (after the round in which you give someone the judgement card).    The players will play a trick taking game with the cards you dealt them.   </p><p>There are 4 suits, each with the numbers 1-9.   The star suit is the trump suit</p><p>There are 3 special cards in the deck, that aren't actually cards but instead roles you give to players.  </p><p>The fool: the player who recieves this will give you -1 point for each trick they win</p><p>The key: the player who recieves this will give you +1 point for each trick they win</p><p>Judgement:  When this is given to a player you  stop drawing cards from the deck and the players will play.  When cards are shuffled back into the deck they always go in front of wherever the judgement is.   The player who recieves the judgement will lead the first trick</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-04T08:24:13", "background_image": "https://media.rawg.io/media/screenshots/0a6/0a69a3564014b1fe67288bd718489468.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZacharyMorris"], "genres": [], "publishers": [], "esrb_rating": null}