{"id": 76152, "slug": "lovestruck-choose-your-romance", "name": "Lovestruck Choose Your Romance", "name_original": "Lovestruck Choose Your Romance", "description": "Lovestruck is your portal to the greatest interactive romance stories! <br/><br/>Choose your ideal romance and enjoy the love you've always wanted to in this unique visual romance novel game! Find a story that captures your heart and decide who you want to fall in love with from a  selection of over 70 unique characters! <br/><br/>Currently available series are:<br/><br/>TALES OF THE WILD: If you're brave enough to embrace the call of the wild, you may find your soulmate within a hidden world of animal shapeshifters!<br/><br/>WICKED LAWLESS LOVE: On a frontier ruled by monsters and ghouls, there's nowhere for an outlaw to run...but right into their embrace...<br/><br/>REIGNING PASSIONS: One day you're a barmaid the next you're a...Princess?! Can you find the truth of who you are, and who your heart is destined to love?<br/><br/>SIN WITH ME: Fall into a world of danger, pleasure, and vice with the Seven Deadly Sins. Discover your passionate romance lurking in the shadows.<br/><br/>QUEEN OF THIEVES: Being a starving artist isn't so romantic, until you're swept up in a heist by the Gilded Poppy: the world's most infamous thieves!<br/><br/>SWEET ENCHANTMENTS: Desserts are just the icing on the cake when you stumble upon a magical cafe and fall in love with a magician! <br/><br/>HAVENFALL IS FOR LOVERS: Vampires, Werewolves, and Demons, oh my! Find your Supernatural Soulmate in this mysterious and exciting story! <br/><br/>GANGSTERS IN LOVE: The most dangerous and sexy gang in Los Angeles is after you… and your heart! <br/><br/>LOVE &amp; LEGENDS: Destiny takes you from your everyday life to a world of swords and sorcery! Now you must tie your fate to one of seven fantasy heroes.<br/><br/>STARSHIP PROMISE: Explore the universe and discover a galaxy of love in this exciting spacefaring romance set far in the future!<br/><br/>ASTORIA: FATE’S KISS: The fate of the world will change with just one kiss!  Fall in love with the Gods and Monsters of Greek Mythology! <br/><br/>ASTORIA: LOST KISSES: Experience the magic of romancing Greek Gods and Monsters once again! Your favorite characters are back for a new spin-off that takes place right after Season 1 of Astoria: Fate's Kiss!<br/><br/>VILLAINOUS NIGHTS: In a world of super-powered humans, you find yourself with a group of powerful Super Villains and discover that love can bloom even in the darkest of nights. <br/><br/>CASTAWAY! LOVE’S ADVENTURE: A pleasure cruise gone wrong leaves you stranded on a remote island with 5 Sexy Strangers! <br/><br/>TO LOVE &amp; PROTECT: One minute you are a normal college student, the next, you are the secret love child of the President of the United States! <br/><br/>SPEAKEASY TONIGHT: Enjoy the glamorous but dangerous world of a speakeasy filled with illegal booze, hot jazz, and even hotter romance!", "metacritic": null, "released": "2017-03-01", "tba": false, "updated": "2020-06-12T02:24:17", "background_image": "https://media.rawg.io/media/screenshots/55f/55f1fdba0bfef522b4fa32afb013478c.jpg", "website": "https://www.lovestruckgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Voltage Entertainment USA"], "genres": ["RPG", "Simulation"], "publishers": ["Voltage Entertainment USA"], "esrb_rating": null}