{"id": 761778, "slug": "eventually-corn-runs-out", "name": "Eventually Corn Runs Out", "name_original": "Eventually Corn Runs Out", "description": "<p><strong>Eventually Corn Runs Out</strong></p><p>What do you spend all day doing when the world ends? Eating corn of course!</p><p>Eventually Corn Runs Out is a strategy game for the Gameboy Color and Gameboy</p><p>The world has fallen to a zombie apocalypse and your job is to keep the United States running for as long as possible. Keep the population alive as long as possible to reach a maximum score.</p><p><strong>Controls:</strong></p><p>DPAD/WASD/Arrow Keys - Move</p><p>Start/Enter - Open Menu</p><p>A/Z - Select</p><p>B/X - Back</p><p><strong>How to play:</strong></p><p>Select a city and after a short briefing you are presented 3 options:</p><ol><li>Feed: Provides 1 food to this city</li><li>Cure: Converts 1 zombie into a human</li><li>Nuke: Destroys all zombies and humans in a city so you no loner have to watch it</li></ol><p>Food can be found at certain locations around the map at random times and in random amounts. Providing food to a city grows its population. If there are at least 2 humans in a city every 5 seconds 1 food is consumed and another human is born.</p><p>Cures are a very limited resource, these can be used to convert zombies into humans. If a city drops to just 1 person it cannot produce more so a zombie must be cured to continue growth. Cures are a finite resource and do not spawn anywhere.</p><p>If the number of zombies is larger than the number of humans then a city will appear run down. This is a visual indicator that the city needs help. You cannot rebuild a rundown city.</p><p>If a cities human population reaches 0, either by zombies or a nuke, then the city becomes destroyed and you can no longer interact with it.<br/></p><p>Pressing enter at any time opens the pause menu, here you can check your score, see how many humans are left, see how much food and cures you have, and save the game.</p><p>While any menu is open in the game the world is paused and your score does not increase.<br/></p><p>The game also has limited GBC support.</p><p>One final note is that you can cheese the game super easy by curing DC and then nuking the rest of the cities. I didn't have time to make a counter to this and does it really sit morally with you to bomb an entire country to save 20 people?</p>", "metacritic": null, "released": "2022-04-03", "tba": false, "updated": "2022-04-04T11:02:00", "background_image": "https://media.rawg.io/media/screenshots/be2/be22959641f4efb05670ac7154d04fba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jacob Bashista"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}