{"id": 761750, "slug": "you-are-the-snooze-button", "name": "You Are The Snooze Button", "name_original": "You Are The Snooze Button", "description": "<p>The human is asleep. The human set the alarm — but the human doesn’t like being woken up. The human will try to hit the snooze button. YOU are the snooze button. The human will try to hit YOU!</p>\n<p>The human will try to <em>delay the inevitable</em>. Your job is to <em>deliver the inevitable</em>: to wake the human up.\r\n</p>\r\nHow To Play\r\n<p>You play as an alarm clock. It keeps moving forward at all times. Zoom around the apartment and collect musical notes which wake the human up. Avoid the human’s hands which try to press the snooze button — a single press will end the round. For some reason the hands are inexplicably big and even-more-inexplicably not attached to a body, and yet-even-more-inexplicably they fall out of the sky, but don’t worry too much about it.\r\n</p>\r\nPlatforms &amp; Controls\r\n<p><em>You Are The Snooze Button</em> is a WebGL game written in JavaScript. It’s playable in all modern browsers, both on desktop and mobile.\r\n</p>\n<ul><li>Desktop: Arrows to turn left, right, and jump (up). Use the down arrow to tilt the camera a bit.\r\n</li><li>Mobile: Tap and hold to turn left and right. Tap and release to jump.\r\n</li></ul>\r\nTeam\r\n<p>This game is a Ludum Dare 50 Compo game. The theme was <em>Delay the inevitable</em>.</p>\n<p> I used my custom WebGL engine called Goodluck.</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-04T10:53:28", "background_image": "https://media.rawg.io/media/screenshots/629/62964973cd7fceecced4b0f0adeb72d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["piesku"], "genres": [], "publishers": [], "esrb_rating": null}