{"id": 76185, "slug": "gunship-battle-wars", "name": "GunShip battle wars", "name_original": "GunShip battle wars", "description": "Gunship Battle Wars<br/>Are you prepared for the most thrilling fighting gunship battle game? Gunship Battle Wars is the world's most powerful battle game and airplanes are at your fingertips. Turn into a strike fighter and participate in gunship battle missions all over the world. Select from a range of rotating and fixed arm aircrafts to complete your levels in such a pacific war. Gunship Battle Wars locates you in the shooter seat of the most devastating combat mission airplanes.<br/>Gunship Battle Wars Game Play:<br/>The game play of this Gunship Battle Wars is very devastating but pretty simple because at the start of the game, we’ll select a gunship simulator airplane and we have to shoot our hostile enemies which are located on their home bases with heavy shooting missiles and other force arena weapons.<br/>The main stimulating factor of this world warfare game is that we would be able to shoot on our enemies while we’ll be flying in the air. There will be 10 levels of this Gunship Battle Wars mafia game. After switching to the second level our gangster enemies would also have airplanes to shoot on us like other air fighting games.<br/>Gunship Battle Wars Features:<br/>10 levels in pacific war mode &amp; ultimate challenging air war mode.<br/>Enjoy controls optimized for 3D flight.<br/>Realistic 3D graphics and stunning visual effects.<br/>Multiple airplanes with a variety of weapons and equipment.<br/>A variety of Customizable Gear.<br/>New realistic First-Person Gameplay, Cockpit Mode.<br/>New Stories with New Gunships.<br/>Endless Rivalry with other Pilots, Challenge Mode.<br/><br/>The opponent has traversed into your land and now the mafia gangsters fighting is taking place in the streets of the air war city and you are the only upcoming ghost shooting gunship striker who can end their advances. Defend your country. You have to get success in the world war at any cost as the upcoming of the whole country depends on you.<br/>The army of the battle war survival arena looks helpless, the attack on ground is not promising. The only chance of getting success in this war is an air strike from our shooting airplanes in this battle city 3d. Take-off the attack on the most hazardous terrorists now before it gets too late. You will become an incredible global striker and defeat wars and terrors in several devastating air assault of the world.<br/><br/>The rival is very strong in this chopper game but you don’t worry because you are well trained cleaver shooter. You have arrived in the middle field of desert of the world war and you want to target their ships, diploid area camps, missile bases, tanks and other equipment. You are overloaded with full of missiles as a global striker and worlds best up-to-date equipment.<br/>To launch the mission of this air assault you requisite to start up cleaver first from the home base and fly in the direction of the air war force arena. When your shooting airbot enters the death zone of your hostile combat mission, first mission is to target then strategy to destroy the targets and protect yourself from their missiles, fires and rocket launchers as a gunship striker.<br/>In this pacific war planes you have to use all the innovative skills and use detector to locate the force arena tanks and bases. Take a target and pull your trigger of rocket launcher to hit the air assault rival forces. No faults are requisite because your shooting enemy is proficient and overloaded with super arms and incredible missiles like other air fighting games.<br/>In this devastating Gunship Battle Wars you need to be efficient because if your opponent started to shoot you, your whole life will droplet and dropping chance will be at altitude even if you’re a strike fighter. So be cautious and defend your country zone in combat mission which is mist over due to the throne battle and force arena environment.", "metacritic": null, "released": "2018-01-03", "tba": false, "updated": "2019-10-22T14:24:08", "background_image": "https://media.rawg.io/media/screenshots/267/2678722ddeac1067f91d570085c2e859.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": ["Action", "RPG"], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}