{"id": 76202, "slug": "fly-ing-police-car-sim-ulator-3d", "name": "Fly-ing Police Car Sim-ulator 3D", "name_original": "Fly-ing Police Car Sim-ulator 3D", "description": "Turn on the police sirens and patrol the sky and streets of the city. With the latest police game flying car simulator, enjoy both fast driving and realistic flight flying in the futuristic police vehicle. Watch the wings transform from the car to take off and fly high in the sky. Get straight into the action that is the flying police car simulation! <br/><br/>Take control of the steering wheel of a highly modified police car. Do loops and flips, and tricks, drift, crash, boost, and slide all around the city streets and the wide open sky above it!<br/><br/>Activate airplane flight mode and watch the wings transform from the patrol cruiser car turn into a unique flying police car!! In an instance you went from a top car driving expert to a professional airplane pilot!<br/><br/>-Fly anywhere in massive open world city environment, dodge and weave between skyscrapers and flying traffic!<br/>-Perfect the skill of a flying car and become the world's best pilot<br/>-Go to extreme speeds with super charged nitro boosts<br/><br/>Flying Police Car Simulator is for all gamers, from novices to experts, flight and driving simulation game fans, everyone can enjoy the best experience in one game!<br/><br/>GAME FEATURES:<br/>-Beautiful HD Graphics <br/>-Real life racing car modified for flight capability<br/>-Huge immersive city open world environment<br/>-Fun, realistic, and easy driving controls<br/>-Interact with flying car AI traffic!<br/>-Dynamic camera angles<br/>-Realistic police sirens<br/>-Intuitive airplane flight physics<br/>-Free to play and easy to use", "metacritic": null, "released": "2017-05-05", "tba": false, "updated": "2019-10-22T14:24:08", "background_image": "https://media.rawg.io/media/screenshots/5d0/5d0a693d0a29e0a987cbfdcd64e442ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["i6 media"], "genres": ["Simulation", "Racing"], "publishers": ["i6 media"], "esrb_rating": "Everyone 10+"}