{"id": 76226, "slug": "american-muscle-car-racing-3d", "name": "American Muscle Car Racing 3d", "name_original": "American Muscle Car Racing 3d", "description": "Take yourself on an American muscle cars driving racing experience! If you think you have a great taste in American muscle cars and you can do some neat racing and drifting stunts then this game is perfect for you! Accelerate in the suburban areas and dodge other cars while racing and drifting to the top.<br/><br/>This simulator drifting game of American muscle cars will give you the thrill of dodging, drifting and driving beautiful vintage and classic muscle cars which you get to select on your own choice. Once you are done, get ready for a game of action, fun and destruction with drifting and racing! <br/><br/>Drift and dodge your favourite cars like the Lamborghini or Ford Mustang since you will get the option of playing the American muscle car game by selecting a car of your choice! You will be given the top cars of the millennium to choose from. Just dodge the other cars and be in for an exciting driving experience in thrilling car and racing games. <br/><br/>Be able to make millions of coins by driving and drifting a muscle car as much as you can! <br/><br/>The amount of your drift and drive will determine the amount of your scores. So now you can make the top high score in stunt car dodging games! Make high scores and reach your target by becoming a crazy drift classic muscle car driver and unlock new levels for exciting new prizes! All you have to do is control and accelerate your amazing vintage muscle car and draft aside and dodge other driver participants of the game.<br/><br/>Drive in luxurious and beautiful cars on various environmental tracks, like those in the snow or on tracks of desert areas and hilly mountains! Get the chance to experience off-road driving stunts which helps gain more coins. To gain more points you can collect all coins and even bonus stars to stay at top in car dodging games!! <br/><br/>Features of the game:<br/>• environmental tracks such as that on;<br/>&gt; snowy area<br/>&gt; hilly area<br/>&gt; desert area <br/>• 15 levels of endless thrills for car acceleration and drifting provided in the game <br/>• follow the given time to reach point as shown on timer on screen <br/>• Various vintage and classic cars to choose from<br/>• customize the car of your choice with the given specs <br/>• controller on screen <br/><br/>How to Play: <br/>• The Muscle Car challenge begins by selection of your car:<br/>- Nissan GTR <br/>- Didsmobile<br/>- Dodge<br/>- Ford Mustang<br/>- Pontiac GTH<br/>- Bugatti<br/>- Chevy<br/>- Agera<br/>- Lamborghini<br/>- GTH<br/>• Select the muscle car drift game level<br/>• Select the track for the muscle car drifting.<br/>• Play the game and start dodging other cars<br/>• Drift the car the most for excessive points <br/>• collect coins <br/>• Unlock new levels <br/>• unlock new drifting techniques with the coins <br/>• Use the on screen controller to drift the car, control the car and speed<br/>• apply braking to drift <br/>• tilt control and acceleration to move your car sideways is provided <br/>• Use the gears provided to drive, brake, drift, reverse and forwarding<br/><br/>Go on a drift driving adventure of your life by downloading this thrilling muscle car drift racing game and be a drifting champion!!", "metacritic": null, "released": "2018-01-19", "tba": false, "updated": "2019-10-22T14:24:10", "background_image": "https://media.rawg.io/media/screenshots/02c/02c81d1f1afd32789a9143ddbb4904db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiran arif"], "genres": ["Simulation", "Racing"], "publishers": ["Kiran arif"], "esrb_rating": "Everyone 10+"}