{"id": 76231, "slug": "mom-virtual-family-simulator", "name": "Mom Virtual Family Simulator", "name_original": "Mom Virtual Family Simulator", "description": "Oh no your babies have made the house un tidy again! Looks like virtual mom has to become super mom again and tidy the messy house, the kitchen, the living room, do the cooking, dish washing, ironing and cleaning and looking after the babies.<br/><br/>Help the virtual reality mommy tidy her messy house and do some cleaning. Help her do<br/>cooking for her husband and babies in virtual family games as a family simulator super mom. Mommy has to do a lot in her home after marriage.<br/><br/>She has to raise the babies, she has to be caring, she has to stop the house from getting messy, help her do the cleaning in the leaving room, help her do the ironing of clothes, help her do the cooking and dish washing in the kitchen<br/><br/>Let’s see if you have the potential to help mommy tidy the messy house and be the super<br/>mom hero of the next generation!!<br/><br/>The house looks gross and a lot of cleaning needs to be done after the mess the babies and even husband have made in the virtual reality virtual house. It’s time to take the role of the super mom and be the mommy and wife of the day.<br/><br/>Witness what it’s like to be your mommy in family simulator virtual family games.<br/><br/>The kitchen is filled with dirty dish and you are home alone with all the mess created, the<br/>fridge has dirty food. Do all the cleaning of your house in family games. Do dish washing<br/>and cooking of delicious food as the super mom in the virtual reality family games for the<br/>babies and husband. Mommy and her kids will help in cleaning house and be super mom. Ironing of the clothes<br/>and laundry need to be done. Then take care of the babies.<br/><br/>This game is full of activity and adventure of super mom in virtual family games.<br/><br/>Help babies play and find things. Clean the living room and tidy the messy areas. Be a role<br/>model for new generation. After cleaning and being super mom collect coins after completing tasks. Take care of pets too in virtual reality family games.<br/><br/>Virtual mom Game Features: <br/><br/> Exciting game play<br/> 3D simulation<br/> Multiple and clear controls for the cleaning and housekeeping in the game.<br/> Multiple fun filled tasks.<br/> On screen controls icon for helping mom perform tasks. <br/> Realistic sound effects and<br/>Realistic graphics in the virtual game. <br/> Time based tasks assigned.<br/><br/>How to Play Virtual mom game:<br/><br/> Start the game<br/> Select your character<br/> Perform the given tasks<br/> Notice the target in each level<br/> Complete the tasks within the given time<br/> Tasks include cleaning, taking care of children, cooking and other housekeeping<br/>chores<br/> Use the joystick to control mommy simulator and mover her around the house to<br/>perform household tasks<br/> Earn coins from completing levels and tasks<br/>Use buttons on screen to perform animation tasks<br/><br/>Take care of your home, tidy the messy places, and perform other kitchen and cleaning tasks and be the super mom in the superhero mommy virtual reality and virtual home family games!", "metacritic": null, "released": "2018-03-17", "tba": false, "updated": "2019-10-22T14:24:10", "background_image": "https://media.rawg.io/media/screenshots/f16/f16e5e80d6e52a1365f8ae7cfdee237b_ik8uGya.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiran arif"], "genres": ["Adventure", "Family"], "publishers": ["Kiran arif"], "esrb_rating": "Everyone 10+"}