{"id": 762493, "slug": "the-lost-alchemist", "name": "The Lost Alchemist", "name_original": "The Lost Alchemist", "description": "<p><em>The Lost Alchemist</em> est un jeu d'action/Survie créé durant la Perpignan Game Jam 2022 par deux personnes : Xavier Buridant et Romain Giner\r\n  </p>\n<p>Histoire du jeu : Vous incarnez un alchimiste ayant bu une potion de trop qui a rendus son corps instable. La potion a créé un cycle de téléportation entre votre monde, et un monde parallèle peuplé de démons. Toutes les minutes, vous allez vous retrouver dans l’autre monde !! Votre but est de récupérer des plantes pour fabriquer des potions a votre établi, d’une pour vous défendre, et d’autre pour trouver la potion qui annulera l’effet de téléportation !\r\n  </p>\n<p> \r\n  </p>\n<p>Gameplay :   </p>\n<ul><li>Trouvez des plantes et des fioles dans les deux mondes\r\n  </li><li>Trouvez les recettes pour fabriquer des potions toujours plus puissantes\r\n  </li><li>Jetez vos potions sur les monstres pour ne pas vous faire submerger et mourir dans d’atroce souffrances\r\n  </li><li>Trouver la recette pour annuler la potion instable et retrouver une vie normale\r\n  </li></ul>\n<p> \r\n  </p>\n<p>Comment Jouer :\r\n  </p>\n<p>Téléchargez simplement le jeu et lancez vous dans cette aventure en vue de dessus !\r\n  </p>\n<p>Utilisez les touches ZQSD pour vous déplacer dans la carte et la touche E pour récupérer des ingrédients\r\n  </p>\n<p>Utilisez la touche A près de votre établi pour commencer à faire de l’alchimie\r\n  </p>\n<p>Utilisez les touches 1-2-3-4-5 de votre clavier pour changer de potion à lancer\r\n  </p>\n<p>Cliquez sur le bouton gauche de votre sourie pour jeter une potion là où votre curseur se trouve.\r\n  </p>", "metacritic": null, "released": "2022-04-03", "tba": false, "updated": "2022-04-04T16:04:44", "background_image": "https://media.rawg.io/media/screenshots/fd9/fd9c0b30222dd42d1eba09ba9324cd4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Wazercube"], "genres": ["Action"], "publishers": [], "esrb_rating": null}