{"id": 76258, "slug": "flying-dragon-clash-simulation", "name": "Flying Dragon Clash Simulation", "name_original": "Flying Dragon Clash Simulation", "description": "Flying Dragon clash Simulation In this game, myth and fantasy is a reality. Feel the terror and menace of being a dragon! Using a bird’s eye view, aim at your target from above with fire balls. Fly from your rocky nest and sow the path of destruction! Adventure with powerful dragons and become the ultimate magical creature in flying Dragon Online, the fantasy that puts you in the powerful wings of a dragon!<br/><br/>QUEST through a medieval fantasy world, slay DRAGONS, BATTLE enemies, and BUILD the strongest GUILD. Train your dragons for battle and show off their strength by engaging in combat with other dragons!<br/><br/>Enjoy a full experience playing on your Ios device. How to train your dragon? Now you can take care of your dragons anytime, anywhere! Some dragon dictation rumor’s that dragon speak but dream works dragons can’t speak. <br/>Your Dragon tribe gets to fight against other Dragon sim tribes in a leathery winged battle for supremacy. That’s a Constitutional right, by the way, not a privilege. That’s true – you can look it up.<br/><br/><br/>Flying Dragon Clash Simulation Game Play:<br/>&gt; Simulator in-depth: feel what it’s really like to be a dragon<br/>&gt; Adventure in a fantasy simulation complete with multiple dragons<br/>&gt; Simulator challenges you to maintain health and energy<br/>&gt; Different Levels to fight against dragons and enemies.<br/><br/>Flying Dragon Clash Simulation Features:<br/>&gt; Monstrous 3D Animated Dragons for you to control and fly<br/>&gt; Smooth controls And Amazing Visual Effects<br/>&gt; Realistic Fire Breathing Action<br/>&gt; 5 Amazing gameplay level<br/><br/>Battle Dragons is one of the best combat strategy or best real time strategy games you'll play! You can really see Battle Dragons shine while attacking.<br/>Have fun playing Dragon Clash Simulator!", "metacritic": null, "released": "2017-04-11", "tba": false, "updated": "2019-10-22T14:24:11", "background_image": "https://media.rawg.io/media/screenshots/f29/f2912c4b29e6bcfee3440524535e74b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sajwar Khizar"], "genres": ["Adventure", "Simulation"], "publishers": ["Sajwar Khizar"], "esrb_rating": "Everyone 10+"}