{"id": 762654, "slug": "return-to-glitchland-thezzazzglitchs-april-fools-e", "name": "Return to Glitchland - TheZZAZZGlitch's April Fools Event 2022", "name_original": "Return to Glitchland - TheZZAZZGlitch's April Fools Event 2022", "description": "<p>It's just a save file. But if you load it inside your favorite Game Boy Advance emulator, together with a <em>Pokémon Emerald </em>ROM, you're in for an entirely new adventure. Maps are downloaded in real time by utilizing the console's link cable connection. The game's ROM is unmodified in any way - you just have to load the save! Everything is achieved through the magic of arbitrary code execution exploits.</p>\n<p><strong>You will need to register on the event site before playing. Refer to the same site for setup instructions and online leaderboard.</strong></p>\n<p>Check out my profile page for a more detailed description of what this is.<br/></p>\n<p>This year, you can return to the region introduced back in April Fools 2018 and see what's changed. Receive points, achievements and special titles for completing quests! Battle for the top score - top scores will be featured on my niche Pokémon glitching YouTube channel.</p>\n<p>And if you're into this kind of thing, there are also some CTF-like hacking challenges. But don't worry - the whole game can be completed without the need to be a hacker!</p>\n<p>Check out the previous April Fools challenges:<br/>Fools2021: Road to Infinity<br/>Fools2019: Trouble in Glitch Islands (an unofficial server is available if you want to play!)<br/>Fools2018: Welcome to Glitchland (an unofficial server is available too!)<br/>Fools2017: missingno.sav</p>\n<p>Note: the ROM is not included in the downloads; you're on your own on that one.</p>", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T17:10:21", "background_image": "https://media.rawg.io/media/screenshots/0cc/0ccfe9ab85e3d9798a122c5dc0fe7ef5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheZZAZZGlitch"], "genres": [], "publishers": [], "esrb_rating": null}