{"id": 762756, "slug": "sticky-gumball", "name": "Sticky Gumball", "name_original": "Sticky Gumball", "description": "<p>This is my entry to the redemption game Arcade Jam titled \"<strong>Sticky Gumball</strong>\" (My team name is Rocket Games). <strong>Sticky Gumball</strong> is a game of skill where players have to time the release of gumballs to navigate the course, only landing in the white sections of the wheels to continue to the next level. <br/></p><p><strong>** Best played full screen. Click icon in top right corner. **</strong></p>\n<p>\n</p>\n<p><strong>Controls</strong>:</p>\n<p>[<strong>C</strong>] = Insert coin</p>\n<p>[<strong>SPACE</strong>] = Release gates</p>\n<p>[<strong>O</strong>] = Options screen</p>\n<p>The game can easily be incorporated into a cabinet with minimal controls needed to play. I'm imagining two large buttons in keeping with the gumball theme: One to start/release the gumball, the second button to release the gates. The game can easily be digitally created on a large screen or recreated physically with moving wheels and balls rolling down platforms.</p>\n<p>\n</p>\n<p><strong>Options Screen</strong>:</p>\n<p>Pressing [<strong>O</strong>] will reveal the Options screen. Here you can see the drop out points within the game, giving you the percentage for each wheel. You can also see the number of credits taken and the number of tickets issued.</p>\n<p>It is able to display the total up time and periodically log the number of credits per hourly increments. </p>\n<p>The jackpot percentage is displayed and it is this that drives the difficulty of the game in order to maintain the 10% achievement amount.</p>\n<p>The ticket multiplier allows you to increase the number of tickets awarded for each wheel.</p>\n<p><strong>Linkin Park</strong>:</p>\n<p>Twitter: https://twitter.com/RocketJez</p>\n<p>My games: http://rocketgames.co.uk</p>\n<p>Personal blog: https://www.rustyrocket.co.uk</p>", "metacritic": null, "released": "2022-04-02", "tba": false, "updated": "2022-04-04T17:51:23", "background_image": "https://media.rawg.io/media/screenshots/ce3/ce3f230392101519add010bfaf066dfc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RustyRocket"], "genres": [], "publishers": [], "esrb_rating": null}