{"id": 762718, "slug": "rushwood-forest-tale", "name": "Rushwood Forest Tale", "name_original": "Rushwood Forest Tale", "description": "<p><em>\"In the forest of Rushwood, with the\r\nbouncy Silvertale River, legends of hidden caves, the absent\r\nwizard's tower, the rare Green Smackbat and a Jerkywoc infestation. Where you're on a quest for the princess' crown.\"</em></p>\n<p>This is a first person adventure, exploration game set in the Rushwood forest. It plays like a lite version of the Elder Scrolls series.<br/></p>\n<p>Discover weapons to fight a corrupted evil, from the lowly rock to legendary swords of legend:</p>\n\n<p>Share your experience with <strong>Jerkywocs</strong>, odd creatures who have a javelin for an arm. They typically won't bother you unless you bother them.<br/></p>\n\n<p>Eat foresty foods to increase your power.</p>\n\n<p>Discover items and chests, instrumental in solving the forest puzzles.</p>\n\n<p>Various forest signs put up by the nearby Kingdom of Rushwood may help or confuse you.</p>\n\n<p>Potions will have differing effects.</p>\n\n<p>The Green Smackbat will take your coins, be sure you have enough.</p>\n\n<p>Use your wits to  figure out how to solve the forest secrets on your own, there's no guidance or quest arrows.</p>\n<p><strong>Controls:<br/></strong></p>\n<ul><li><strong>Movement:</strong> Arrow Keys or WASD</li><li><strong>Look: </strong>Mouse</li><li><strong>Use/Pick Up:</strong> E</li><li><strong>Drop:</strong> R</li><li><strong>Use Held Item:</strong> Mouse 1</li><li><strong>Jump:</strong> Space</li><li><strong>Menu: </strong>Tab or Esc</li></ul>\n<p>Player movement is physics based, it should be easy to quickly get around, you can even jump on water if you time it correctly.</p>\n<p>This game was made all in-engine, even the animation and modeling. Well except for Photoshop work for sprites and stuff, you can't do those in-engine but the main parts were so that doesn't count. You can't do anything without Photoshop so it still gets that coveted \"Made entirely In-Engine\" seal of approval.</p>\n\n<p>[Interesting Note: Did you know the guy who came up with the story for Star Wars Rogue One helped develop Photoshop? Crazy stuff man.]<br/></p>\n<p>More Info:</p>\n<ul><li>Supports up to 1440p.</li><li>There's not one single texture used in this game, it's all solid colors. NOT A ONE</li><li>Built in timer.</li><li>Has a sweet chromatic aberration effect which looks <em>amazing</em>. No you can't turn it off haha.</li><li>Most of the music was machine generated so if you like one of the tunes in-game know that it was created by cold, mechanical hands that know nothing of feeling.</li><li>It has a frame rate cap because without it the CPU freaks the f out.</li><li>There might be a super secret, nearly impossible to find weapon to be found but you're not supposed to find it because it's a secret.</li><li>Turns your mouse cursor into a sweet sword!</li></ul>\n<p>Anyway if you like this game follow these things:</p>\n<p> <br/></p>\n<p>Next game will be a retro-ish FPS, Stealth, collect-a-thon monstrosity or a very <em>buggy </em>game. Actually they're both <em>buggy </em>games. In the future come back to this line you'll be like \"Oh I get it\", then you will have a sensible giggle.</p>\n<p>Check out the sniper game too.<br/></p>", "metacritic": null, "released": "2022-04-02", "tba": false, "updated": "2022-04-04T17:34:41", "background_image": "https://media.rawg.io/media/screenshots/f97/f97abe2cffd8529f31218cc4fd92701f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Echomune"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}