{"id": 762707, "slug": "vecta", "name": "Vecta", "name_original": "Vecta", "description": "<p>Vecta, Vektör ve Delta (VectorΔ) isimlerinden türettiğim 1.bakış açılı online savaş oyunudur.</p>\n<p>Neden Half Life sesleri? Neden Half Life benzeri silahlar? Neden Half Life mapi? </p>\n<p>Bu cümleleri kurabilirsiniz. Bu proje kendimi geliştirmek için ve arkadaşlar arasında oynanması için geliştirilmiş bir oyundur. Öncelikle bu proje kendimi geliştirmem de çok büyük katkılar sağlamıştır. Bu oyun sayesinde online orta seviye-ileri seviye oyun geliştirebilme seviyesine gelmiş bulunmaktayım. Oyun şuan kapalı-beta durumunda, oyun dili tamamen İngilizce. Bunun sebebi ise tüm dünyadan insanlar çekebilmek için yapıldı. İngilizce genel dil sayıldığı için ve tüm ülkeler de bu dilin eğitimi alındığından dolayı yapıldı. İleriki zamanlar da Türkçe dil desteği gelecektir.</p>\n\n<p>Üstte de bahsedildiği gibi oyun kapalı-beta da ve erkenden çıkış yapabilmesi için çoğu özellik çıkartıldı ve tam olarak test edilmedi. Oyunda bulduğunuz açık (bug), fikirleriniz, tavsiyeleriniz ve şikayetlerinizi aşağıdaki Discord sunucumuza katılarak bana bildirebilirsiniz.</p>\n\n<p>Oyuna getirilecek tüm özellikler burada paylaşılmaktadır.</p>\n\n<p>Şimdi gelelim kullanılan modelleme ve tasarımlara ;</p>\n<p>Oyunun UI kısmındaki görseller için, Ellwy#0001</p>\n<p>Oyun yapılırken bazı zamanlar test ettiği için, yashi yan çar#9781</p>\n<p>Discordda bulunup bana moral, fikir vb. desteği vererek mutlu edenlere teşekkür ediyorum.</p>\n\n<p>Sketchfab sitesinden kullandığım objeler ve çizim ; </p>\n<p>Anime girl with gun, demongirl289</p>\n<p>Galaxia anime girl , Tatenashi</p>\n<p>SPAS 12 Shotgun, Elliot Whitehouse</p>\n<p>MP5 &amp; Grenade Launcher, Elliot Whitehouse</p>\n<p>Half Life Crossfire, vrchris</p>\n\n<p>Oyun ile ilgili fikirleriniz, yorumlarınız, telif hakkı durumu, itch.io sayfasındaki Türkçe yazım yanlışı vb. her şey için Discord'a gelerek bana yazabilirsiniz.</p>\n<p>\n</p>\n<p>Please contact me on Discord for any copyright issues.</p>\n<p>https://discord.gg/fsVutVh3sJ</p>\n\n<p>Itch.io sayfası yakın zamanda sıfırdan düzenlenecektir....</p>\n<p>Sunucuya maksimum 20 kişi girebilir. Bu sorun için kusura bakmayın, yeni güncelleme ile bu sayı 100 kişiye çıkartılacaktır. Eğer oyuncu sayısının artması için bağış yapacak kişiler olursa gerekli para toplandığın da oyuncu sayısını arttırmak için paket satın alacağız. 100 dolar sanırım 500 veya sınırsız kişiye izin veriyordu.</p>\n<p>Not : Düşük hassasiyet için oyunu kapatıp tekrar açarsanız sorununuz düzelir. Eğer 1 kez kapattınız düzelmediyse  birkaç kez kapatıp açın.</p>", "metacritic": null, "released": "2022-04-02", "tba": false, "updated": "2022-04-04T17:30:44", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a9a09ef88975595ec8e7913a2a27089.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ichuusy"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}