{"id": 762976, "slug": "suddenfell", "name": "Suddenfell", "name_original": "Suddenfell", "description": "A procedurally generated turn-based kinda-roguelite card  game.\r\n<p>Suddenfell is a procedurally generated, card-collecting, kinda-roguelite barrel of fun! The aim is to gradually improve your deck, figure out new combos, and face off against opponents to try and deal the most damage to sacrifices in the combat arena.</p>\n\n<em>The snow biome in Suddenfell</em>\r\nHow does winning work?\r\n<p>Every match you start will get a random sacrifice pulled in from the overworld. You and your opponent will take turns placing down spells to try and deal the most damage to the sacrifice while they run around the room. The match is over when the sacrifice has died!</p>\n\n<p>Feel there's no risk when duking it out with your fellow dungeon inhabitants? There's plenty risk since you need to wager a card from your deck were you to lose the match.<br/></p>\n\n<em>What winners usually see</em>.\r\nAbout the project itself.\r\n<p>Suddenfell is a passion project for myself. The idea had spawned around 2016, and through many iterations of coming back to the idea of this game, I have finally committed to making it an actual thing.</p>\n<p>Suddenfell is currently under <strong>heavy </strong>development, and any bugs or game changing changes(?) are to be expected. The aim is to gradually add more features, mechanics and improve the overall game, thus new builds will be pretty frequent. :)</p>\n<p>If you want to follow the progress of the game, there's a few links available:<br/>Twitter | Discord | Trello<br/></p>\r\nOther info that might be handy.\r\nControls:\r\n<p>Movement/Navigation: <strong>WASD</strong><br/>Jump/Confirm: <strong>Space</strong><br/>Inventory: <strong>Tab</strong><br/>Interact: <strong>E</strong></p>\r\nCombat:\r\n<p>Before entering combat you will need a deck. Luckily one gets given to you every new game you start! Open chests or beat opponents during combat to get more cards that you can swap around in your deck.<br/></p>", "metacritic": null, "released": "2022-03-26", "tba": false, "updated": "2022-04-04T19:32:02", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c4dc650705fd11973c9b8d50b2057cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["towersvault"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}