{"id": 763190, "slug": "wordles-of-zzt", "name": "Wordles of ZZT", "name_original": "Wordles of ZZT", "description": "<p><strong>Wordles of ZZT</strong> is a ZZT v3.2 compatible recreation of <em>Wordle</em>.</p>\n<p>ZZT provides just 20,000 bytes of memory to the entire board for its code and visuals. ZZT provides a limited number of variables, and has no concept of strings, requiring letters be stored in other formats such as a series of boolean flags. The engine is an exercise in cramming the entire game into a one puzzle per board format.</p>\n<p>Unlike actual Wordle and more accurate clones a few features have unfortunately not made the cut:</p>\n<p>* There is no word list for guesses to be verified against. While ZZT can display text files external to its world files, it cannot run code from external sources.<br/></p>\n<p>* There is no randomness. A set of twenty-three hard coded puzzles are included which play in the same order every time.</p>\n<p>* There is no hard mode. Information from previous guesses only persists visually.</p>\n<p>* There is no display of information about previously guessed letters. Attempts were made, but the memory was not sufficient to include even the crudest methods I could come up with.</p>\n<p>* There is no direct keyboard input. ZZT only accepts limited keys for input. Letters are selected by touching an object and choosing from a menu.</p>\n<p>* There are only five guesses per word rather than six. This is due to a mixture of memory limitations and me somehow not noticing that I only supported five guesses rather than six until 90% complete with development</p>\n<p>A full postmortem write-up of how the engine works as well as the development process will be released to the public on April 10th on the Museum of ZZT. Worlds of ZZT patrons pledging at least $2 per month may read the article immediately.</p>\n<p><strong>Beating the Timer</strong></p>\n<p>This engine began as a planned April Fool's Day joke. As such, after finishing a puzzle, you'll have to wait 24 hours until the next puzzle unlocks. You can circumvent this with cheats by standing next to the door,  typing \"<strong>?</strong>\", and then entering \"<strong>ZAP</strong>\" at the cheat prompt and hitting enter. Alternatively, after 10 seconds a crack in the wall opens </p>\n<p><strong>Additional Information<br/></strong></p>\n<p>Documentation is included in the downloadable versions of the game below. You may also read them in your browser on the Wordles of ZZT page for the game on the Museum of ZZT.<br/></p>", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T21:04:02", "background_image": "https://media.rawg.io/media/screenshots/943/943c28eb02987077a1bb92b93f20bfe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dr. Dos"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}