{"id": 763298, "slug": "phoenix-forest", "name": "Phoenix Forest", "name_original": "Phoenix Forest", "description": "Welcome to Phoenix Forest! \r\n<p>Your goal here is to take the barren, shallow soil before you and create a thriving, balanced ecosystem! </p>\n<p>But how?? </p>\n<p>Begin by planting grass in the dry soil. Grass does not cost much energy, but returns little as well. Maintaining a healthy meadow will allow you to summon rabbits, which restore your energy faster, but its real value may come at the end of every growing season, when the fire season begins. </p>\n<p>During this time, animals flee and your plants will be consumed by raging forest fires, burning them away and returning the map to a blank slate. But all is not lost! Plots that held plants when the fire began will be nourished by the ashes your plants become, allowing them to support more complex vegetation when the growing season begins again! Where grass once was, bushes will spring up, allowing you to summon more and different herbivores to feast on their fruits and leaves, and carnivores to keep their population under control (they may be a bit too good at this at the moment)! </p>\n<p>The more animals in your forest, the faster you will recover energy, but be careful not to overload your ecosystem! See how long you can last!</p>\r\nLayout\r\n\n<p>The left pane: icons for summoning animals or planting seeds.</p>\n<p>The right pane: Information hub. The top shows information as you hover over things, and the bottom gives you data: current level, energy, score, etc.</p>\n<p>Notice the bars on the bottom; the red one is a visual representation of how long until the next fire, whereas the green one is a visual representation of how much energy you have.</p>\r\nControls\r\n<p>Move camera: WASD</p>\n<p>Pause game: Space Bar</p>\n<p>Summon plants: Click on the icon for the plant you'd like to place, and click on the tile you'd like to place it. Clicking and dragging the mouse will result in placing multiple instances of that plant.</p>\n<p>Summon animals: Click on the icon for the animal you'd like to plant. Assuming you meet the requirements to summon it, it will spawn somewhere within the world.</p>\r\nThings of note\r\n<p>Burned plants do give you some energy back when the fire comes through.</p>\n<p>Berry bushes regrow their fruit after some time.</p>\n<p>Ash accumulates on tiles after plants are burned on them. When nothing has been replanted on a tile that has ash, it is a very dark brown, and when the tile can support planting a tree (which takes 3 instances of ash accumulation), the soil itself changes from a pale brown to a much deeper brown.</p>\n<p>The game is considered \"lost\" when one of the following conditions are met:</p>\n<ul><li>You do not summon an animal within a fire cycle.</li><li>All of your animals run out of food.</li><li>If you have no animals and you do not have any energy to, at a minimum, plant grass and summon a bunny.</li></ul>\r\nCredits\r\n<p>Make sure to check out the lovely folks I worked with on this project! </p>\n<p>Couch Sloth: https://twitter.com/CouchSlothV</p>\n<p>Glacier: https://oceanhahn.itch.io/ https://twitter.com/windfallapples </p>", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T21:55:43", "background_image": "https://media.rawg.io/media/screenshots/2e8/2e8ac22b63e4589c3f631c6a393f6a5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PixelTypist"], "genres": [], "publishers": [], "esrb_rating": null}