{"id": 76331, "slug": "combat-flight-simulator-2016-free", "name": "Combat Flight Simulator 2016 Free", "name_original": "Combat Flight Simulator 2016 Free", "description": "Combat Flight Simulator is the most complete experience flying combat aircrafts! Feel the adrenalin rush engaging battles above Europe countryside, while ground and air units will be shooting at you! Guns blazing and bombs blasting everywhere! Are you ready for the challenge?<br/><br/>You can choose 15 planes from three categories, WWI, WWII and modern aircrafts.<br/><br/>Fight with your plane equipped with 7 mm and 20 mm caliber guns, small (50 kg) bombs and big (250 kg) bombs, and advanced ranged missiles Sidewinder AIM-9 and AIM 120 AMRAAM.<br/><br/>Fight in tactical missions in a campaign or survival mode. There are 50 missions to play in the Europe territory, crowded with tanks, aircrafts and anti-aircraft units. The fight happens in five different location, including Stalingrad, Poland, Italy, Iwo Jima and the desert above the north of Africa. <br/><br/>Became a real Ace pilot! This flight simulator gives you all the controls you need to master and dominate the skies! <br/><br/>MAIN FEATURES: <br/>- 15 aircrafts<br/>- 50 missions<br/>- 5 different scenarios<br/>- big set of weapons<br/>- biplanes, triplane and fighter jets!<br/>- 2 special planes: Predator and Guardian drones!<br/>- 3D virtual cockpits, and high detailed aircraft models and scenarios. <br/><br/>Environment features:<br/>- Weather conditions<br/>- Turbulence<br/>- G-Force and blood pressure simulation<br/>- Air pressure depending on the altitudes<br/><br/>Simulated Fighters: <br/>- Richtofe Red Baron War 1<br/>- Foker Dreidcke 1<br/>- Sopwith Kamel<br/>- Must P-51<br/>- Spitfire Super World War 2<br/>- ME 109 Luftwaffe<br/>- Zero A6 Mitshu<br/>- Corair FU41 WW2<br/>- Corair FU41 (after WW2)<br/>- F-14<br/>- F-15<br/>- F-22<br/>- F-117 Stealthy<br/>- Drone MK9 Reaper<br/>- Drone MK9 Predator", "metacritic": null, "released": "2016-05-05", "tba": false, "updated": "2019-09-06T03:32:48", "background_image": "https://media.rawg.io/media/screenshots/ded/ded63f91ce96f370b84efd0253a6cc89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thetis Consulting"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Thetis Consulting"], "esrb_rating": null}