{"id": 763378, "slug": "entropic-decay-demo", "name": "Entropic Decay Demo", "name_original": "Entropic Decay Demo", "description": "<p>Wish list on steam here: https://store.steampowered.com/app/1786720/Entropic_Decay/</p>\n<p>Entropic Decay is an FPS that plunges the player into a volatile world filled with danger, from both the living and the dead. Featuring gameplay inspired by late 90's classics, and the atmosphere of a slow-burn-horror walking simulator, only fused with the movement and combat options of a shooter.</p>\n\n<p>Some time in the future, a signal is detected carrying a small meteor. The signal is tracked, and the crash site investigated on impact. A mineral is found. Astrobioligist's are amazed to find a living pathogen inside the mineral. The pathogen is extracted and experimented on, and the findings indicate aggressive cell growth when in contact with other organisms....dead or alive. Rapid cell mutation causes a rabies like disease. Anything infected with the pathogen becomes a hive-minded aggressor to everything not infected. The pathogen spreads and envelopes the world. Civilisation becomes an overgrown, decaying husk of the nature we once knew. The decay and despair is juxtaposed with beauty, as plant life flourishes due to the pathogens effect on cell growth, and everything man-made returns to nature, but rises again with a twisted skew. The last bastion of humanity are elitist's, deploying the military to kill anyone on sight who aren't in uniform. Military death squads roam in packs, taking orders for food and protection from the pathogen, while trading their humanity.<br/><br/>You awaken in a facility, fumbling for hazy memories of before the place you find yourself in.... Journey through a world foreign to all but the mutated, and find a place free from decay and entropy at any cost...</p>\n<br/>\n<p> Cunning, reactive A.I - The soldiers in Entropic Decay don't mess around. They react to grenades, can hear you, take cover, flee, and throw their own grenades. The mutated work in packs, can hear you running and will roam the area you were last seen. The military will shoot the mutated on sight, but taking them down is no easy task, even for the well trained.<br/><br/> A variety of mutated to fight against - Currently there are over ten different mutated to contend with. Ranging from agile spider mutants and dogs, to hulking tanks weilding lead pipes.<br/><br/> Puzzles to break up combat sequences - Puzzles and narrative pieces are used to keep the player engaged to avoid simply being one type of genre and keep things fresh and dynamic.<br/><br/> Physics interaction - Interact with the world with physics puzzles, and deceive enemies by throwing objects or craft a devious trap by arranging explosives in your environment to detonate on an unsuspecting foe.<br/><br/> Stealth, A.I and how they interact - Distract your foes by throwing an object or bring them closer to setup an ambush with a whistle, or simply sneak by and avoid combat all together. Use your wits and the environment and the A.I will respond allowing emergent gameplay and tactical options.<br/><br/> Narrative driven gameplay - The story will be told through the environment with the player merely an observer of things outside it's control. Find notes, audio logs, and data entries to piece together the collapse of society and the scientific ambition that caused it.<br/></p>", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T22:32:03", "background_image": "https://media.rawg.io/media/screenshots/b1b/b1be1e27157a28fbc13ad9ce9608c94e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["REKWARE"], "genres": ["Action", "Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}