{"id": 763385, "slug": "the-lost-dachshund", "name": "The Lost Dachshund", "name_original": "The Lost Dachshund", "description": "\n<br/>\r\nThe Lost Dachshund is a quick, relaxing point and click Adventure game where the player must find Peanut, a dachshund puppy who is running amok on peaceful Waldi Island, before the ferry arrives carrying your granddaughter.  Meant for casual gamers of all ages who are looking for  a small, bite-sized game that can be completed in under an hour.<br/>\n<br/>\r\nThe Lost Dachshund features include:<br/>\n<br/>\r\nFind items and clues to help solve puzzles that will help you locate Peanut before she gets herself into any more trouble.<br/>\n<br/>\r\nPhoto Surreal locations crafted in Unreal Engine convey a relaxing walk around a quiet island with simple tasks and objectives.l<br/>\n<br/>\r\nOriginal music score composed by Andres Ciambotti sets the tranquil tone and creates an idyllic atmosphere.<br/>\n<br/>\r\nProfessional voice narration and character work for friendly Postman Pete, who is always around to lend a helping hand.<br/>\n<br/>\r\nEasy going and accessible gameplay for players of any age looking for a quick and simple diversion.<br/>\n<br/>\r\nNo ads, no paywalls, no in-game purchases.  The Lost Dachshund is a 100% free game meant to be shared and enjoyed by animal lovers and casual adventure game fans.<br/>\n<br/>\r\nCreated by an all volunteer group of artists and programmers (and dachshund lovers) in 90 days as a group Discord project.", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-05-20T06:48:52", "background_image": "https://media.rawg.io/media/screenshots/331/3315b22c0c1f1c90cd025031c36ce7a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "Web"], "developers": ["Weenie Walker Games", "Little Glyph Games", "Fiddlepoke"], "genres": ["Adventure", "Indie"], "publishers": ["Little Glyph Games"], "esrb_rating": null}