{"id": 76339, "slug": "gems-magic-merge-jewels", "name": "Gems & Magic: Merge Jewels", "name_original": "Gems & Magic: Merge Jewels", "description": "PLAY A NEW HOT ADVENTURE PUZZLE GAME! New game mechanics and many levels of cool gameplay. A battle between of jewels and your brain begins!<br/><br/>In the game, you need to move the hexes with gems, collecting the whole picture. When the gems are connected, they light up, and if all the gems on the field begin to shine - you match a beautiful puzzle and pass the level.<br/><br/>Collect animals, fish, stars, equipment, figures, toys and treasures! It’s just an blast of fantasy! The game has a lot of challenging levels that will force you to strain up your brain or use hints.<br/><br/>Gems and Magic is absolutely free.<br/><br/>Features:<br/><br/>· А unique game that will help you increase your IQ<br/><br/>· More than 100 puzzling levels, and new ones on the way<br/><br/>· Free bonuses every day<br/><br/>· Unpredictable pictures. What kind of object is hidden on the hexes: cat, star, fish, candy, toy, treasure, or maybe a tank or a robot? Collect all the unique levels and discover all the secrets!<br/><br/>· Play with one finger<br/><br/>· Useful game - the brain strains, the IQ grows!<br/><br/>· An adventure with cool graphics and relaxing music - the best rest is guaranteed<br/><br/>· With Gems and Magic You, do not need to run anywhere. Instead, you can play at home, in the subway, at work or in your garden and discover colorful pictures.<br/><br/>NEW LEVELS are coming soon", "metacritic": null, "released": "2018-05-16", "tba": false, "updated": "2019-10-22T14:24:13", "background_image": "https://media.rawg.io/media/screenshots/155/155928c63ee18b655aaafa739b003d9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ice Storm"], "genres": ["Family", "Puzzle"], "publishers": ["ASG, OOO"], "esrb_rating": "Everyone 10+"}