{"id": 76343, "slug": "crazy-horse-crime-destroyer-3d-simulator", "name": "Crazy Horse Crime Destroyer 3d Simulator", "name_original": "Crazy Horse Crime Destroyer 3d Simulator", "description": "Have you played animal running and simulation games where you play as a wild horse going crazy and causing destruction everywhere?<br/>Have you played animal running and simulation games where you play as a wild horse going crazy...<br/>Those who love playing horse games or 3d simulator games will love to play as one of the wild horses. Are you a 3D simulator lover? <br/><br/>Do you like running games? Explore the city, unleash your fury and show the city how wild a horse can become.<br/>Includes 3 HUGE maps for hours of Horse riding and racing fun.<br/>Get into action with wild horse simulator and experience the thrill of being a horse.<br/><br/>Keep an eye on the energy bar as it goes down &amp; down &amp; you have to feed your Crazy Horse friend in time for survival before the Horse collapse &amp; finally dies. Crush the various obstacles on the way to increase score and earn points to unlock new Crazy Horse haven world of horses with all features as there are several Crazy Horse for you to unlock, earn points to unlock your favorite one.  <br/><br/>Wild Horse Fury is 3d animal simulator game that will let you take control of a wild horse going crazy on the farm fields. <br/>Complete destruction and horse simulator challenges and show your fury. Let’s inflict rampage and hit everything in your way.<br/>The ultimate goal is to do as much damage as possible to maximize your score.<br/><br/>Complete the tasks and destroy the city in this action packed grand city destroyer game.<br/>All New and Exciting Missions! Go And Take Whatever You Want as the Crime Lord!<br/>Its about survival and smashing in container. All happening is high quality 3D. <br/><br/>You can also play missions where you must hunt around for various objects, lights, signs. etc. Chase down the people.<br/>On the Farm, you get to smash into other horses, goat, sheep, chicken. Explore the miniature castle.<br/>Play as a real monster player - run, destroy, demolish and make the biggest rampage this world has ever seen.<br/>So “Download” now &amp; let My Crazy Horse adventure begin!<br/><br/><br/>GAME PLAY FEATURES:-<br/><br/>• Multiple Game play Challenges<br/>• Multiple Horses<br/>• Excellent sounds.<br/>• Running, Destruction &amp; Rampage •  100% Free game with all features<br/>• 3D Horse Simulation with the Wild Horse<br/>• Compatible with all new smartphones.<br/>• Explore the City<br/>• High Quality 3D graphics and exciting game play.", "metacritic": null, "released": "2016-07-23", "tba": false, "updated": "2019-10-22T14:24:13", "background_image": "https://media.rawg.io/media/screenshots/f58/f58051598fae16d8ac7f69ebff5009d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Darshit Patoliya"], "genres": ["Adventure", "Simulation"], "publishers": ["Darshit Patoliya"], "esrb_rating": "Everyone 10+"}