{"id": 763434, "slug": "excalibur-experiment-oct-round-2-skin-deep", "name": "Excalibur Experiment OCT Round 2- Skin Deep", "name_original": "Excalibur Experiment OCT Round 2- Skin Deep", "description": "<p>Welcome back! I'm happy to show off my entry for Round 2! As before, here's some general warnings and instructions. Enjoy the show!</p>\n<p>-The game might take a while to load on it's first run. If nothing is happening once you start the game and start clicking, just give it a minute or so to finish loading. Press the left mouse button to progress the story and speed up text. Note that there is, due to the limitations of the program used to create this, NO back button, so be careful!  You can save and load the file, however.  Furthermore, you can press the space bar to hide the text box and see the art behind it properly. Press space again to bring it back. If the game is bigger than your screen dimensions, either zoom out your screen, or there is a \"full screen\" button to the bottom right. \r\n</p>\n<p>-This round has a plenty of swearing, violence, and upsetting scenarios. Not for kids!\r\n</p>\n<p>-There are a LOT of cameos on this, but I got permission from their creators to use all of them. Trust me on this.</p>\n<p>-Crest is by ScrapPaper22 on Twitter. Check out his round too, it's amazing!</p>\n<p>-Total Number of Images: 158. Yaaay, I made it shorter!</p>\n<p>-Bonus Challenges included: Sight-Seeing (Night Market), Classic Crosseyes, Disgruntled Denizens<br/></p>", "metacritic": null, "released": "2022-04-01", "tba": false, "updated": "2022-04-04T22:58:18", "background_image": "https://media.rawg.io/media/screenshots/89c/89cbede2fd67ca4f61cab562f62dfcd7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Fallingfeather"], "genres": [], "publishers": [], "esrb_rating": null}