{"id": 76351, "slug": "blaze-of-battle", "name": "Blaze of Battle", "name_original": "Blaze of Battle", "description": "The most exciting SLG Game ever! Raise your own army, lead your powerful DRAGON and KNIGHTS to fight for Glory in Blaze of Battle! Build a mighty City and battle against millions of players worldwide.<br/><br/>Play for FREE in this award-winning strategy game now! Join a mighty Alliance to chat and make friends with players all around the world. Train multiple troops and get yourself prepared for attacks against countless rivals. <br/><br/>The whole City is counting on you! Claim your Destiny Now!<br/><br/>FEATURES:<br/><br/>-   Build and customize your own City.<br/>-   Raise a massive army to overwhelm your enemies with superior forces!<br/>-   Command the Dragon to lead your army to final victory.<br/>-   Summon the most faithful Knights to fight for your glory.<br/>-   Battle against millions of players worldwide.<br/>-   Join a mighty Alliance and Rally Wars against powerful rivals with allies!<br/>-   Talk and strategize with your friends in On-line Real-Time Chat. <br/>-   Conduct Researches to effectively boost the Development of your City.<br/>-   Forge powerful equipment for your Dragon. Bring up the greatest commander ever!<br/>-   Brutal Monsters roaming around, defeat them to get rare equipment ingredients totally for FREE!<br/>-   Participate in various events to win precious rewards every day.<br/><br/><br/>NOTES:<br/><br/>-   Network connection is required.<br/>-   Requires iOS 6.0 or later. Compatible with iPhone, iPad and iPod touch.<br/><br/><br/>CONTACT US:<br/><br/>If you have any problems or suggestions, please email us at bob_support@leyinetwork.com.", "metacritic": null, "released": "2016-09-15", "tba": false, "updated": "2019-10-22T14:37:23", "background_image": "https://media.rawg.io/media/screenshots/6ea/6ea7346b0dd6611b0677482a609f9631.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Shenzhen Qianhai Leyi Network Technology Co", "Shenzhen Leyi Network Co.,Ltd."], "genres": ["RPG", "Strategy"], "publishers": ["Shenzhen Qianhai Leyi Network Technology Co"], "esrb_rating": null}