{"id": 763524, "slug": "rizumu", "name": "Rizumu", "name_original": "Rizumu", "description": "<p>Rizumu is a rythm based game created and maintained by AE development team, formed by 5 high schoolers, based in Slovakia.\r\n</p><p>Work on this project started in October 2021 with target to build an \r\ninnovative rythmic game with outstanding features like item shop, level \r\neditor and fancy graphics.\r\n</p>\n<p>Rizumu reached it's final state on 31st March 2022 and it was submitted \r\nto IHRA game development competition governed by the University of Pavol\r\n Jozef Safarik, Kosice, Slovakia.</p>\r\n🕹How to play\n<p>After you open the game, go ahead and click the play button to see all \r\nthe available levels. They are ordered by their difficulty, pick the \r\nlevel you think is the best for you and click it to start.</p>\n\n<p>The gameplay screen is divided into 4 sectors, which represent the 4 ordinal compass directions. As the music plays, notes arise from edges of the screen. The goal is to press the corresponding keyboard key when it hits the player and release it when it passes. The game tracks all your steps and contructs simple analytics, which can be viewed when a track ends, where you'll also be given a grade depending on your accuracy - D, C, B, A or S (the best).</p>\n\r\n🎨Gameplay customization\r\n<p>If you'd like something new, you can always access our level editor from the main menu. Alternatively, you can enter the super-duper item shop, where you can customize your in-game experience in exchange for score points earned while playing.</p>\n\n<p>In case you prefer different keybind configuration, you can freely change it inside settings menu, as well as audio volume and video settings.</p>", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-04-04T23:36:56", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e6266bb504fc2cc7a5f6dfa6ba83834.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AE Game Development"], "genres": ["Action"], "publishers": [], "esrb_rating": null}