{"id": 763678, "slug": "illusionary-hope-unknown-border-of-rebellion", "name": "Illusionary Hope: Unknown Border of Rebellion", "name_original": "Illusionary Hope: Unknown Border of Rebellion", "description": "<strong>A Touhou x Madoka Magica</strong>\r\nRPG!\r\n\n\n<p>Shrine Maiden Reimu Hakurei falls into a slight depression after the events of the  Lunarian Invasion Incident. No longer feeling like the hero and more of a servant who doesn't get any thanks or pay in return. Unluckily for her, a new Incident pops up this time taking place outside of Gensokyo and in the outside world as a strong unknown energy has been detected. Meanwhile, the Holy Quintet are also dealing with some issues. Nightmares have seemingly stopped appearing as well as their fluffy mascot Kyubey now missing. Can the Heroines from both worlds discover the truth behind both their problems and end the incident? or is something more sinister happening behind the scenes...</p>\n\n<strong>An Unexpected Team-up!</strong>\n\n\n<p>The Gensokyo Gang  team up with the Holy Quintet! use their skills in battle to defeat the strange monsters plaguing Mitakihara and end this Strange Incident!</p>\n\r\nHelp out and Spend Time with the Residents of Gensokyo!\r\n\r\n\r\n<p>Throughout the game certain characters in Gensokyo will ask for your help... or just want you for something fun. Help them out and they'll pay you back in return! (Or you could just ignore them, there is a Incident to solve after all!</p>\n\n<strong>Watch friendships form between characters!</strong>\n<br/>\n<br/>\n<p>After exploring and investigating odd places, the heroines hang out back at the Mitakihara Park. During this time hangout events happen! Get to see what they're up too! Their stories might end up painting a bigger picture... as well as unlock powerful team skills!</p>\n<strong>Amazing CG by wonderful artists!</strong>\n<p>The game features art from both artists Umisaki and Chen both wonderful artists who deserve attention! Please check them out!</p>\n\r\nA Passion Project filled with love!\r\n<p>I've always wanted to make a crossover game since I was a kid! I'm not much of a programmer or too familiar with RPG Maker, but I hope you can still enjoy playing it even with a few minor bugs or so! I'm dedicated to telling this story and finally making a game!</p>\n<p>Please enjoy Illusionary Hope!<br/></p>\n\n<p>I do not own Touhou or Madoka Magica! Touhou is owned by Team Shanghai Alice/ZUN !  And Madoka Magica is owned by  SHAFT,Magica Quartet and Aniplex!</p>", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-04-05T00:47:51", "background_image": "https://media.rawg.io/media/screenshots/95a/95a620c0bc9840e502e5a1289b6d7994.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fatboysmough"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}