{"id": 7637, "slug": "murder-in-the-hotel-lisbon", "name": "Murder in the Hotel Lisbon", "name_original": "Murder in the Hotel Lisbon", "description": "Detective Case and Clown Bot in: Murder in the Hotel Lisbon is a videogame inspired by the classic point and click adventures from the 80’s and 90’s. It adopts these eras distinctive design and it is built using only the pixel art technique. The game itself runs at a native resolution of 256x192, the same resolution used by the old ZX Spectrum 48k and most recently by the Nintendo DS. <br/><br/>&amp;quot;Pretty funny and charming&amp;quot; - 148apps<br/>&amp;quot;Pushes the limits of our nostalgia&amp;quot; - Killscreen<br/>“The soundtrack is Awesome!” - Retromaniac<br/>&amp;quot;Don&amp;#39;t quote me!&amp;quot; - Anonymous<br/><br/>SYNOPSIS:<br/>A strange murder has occurred in the Hotel Lisbon, a man committed suicide with 14 stabs to the back while at the same time he peacefully drank his coffee. <br/>This case with contradictory facts was too complex for Policeman Garcia to solve, so he decided to hire the only detective duo in town capable of solving it: the mythical Detective Case and the unmistakable Clown Bot. <br/>Together, they will solve a network of love relations so complex and so intricate, that it would take at least 14 clairvoyants, 5 apocalyptic sect prophets who can predict the end of the world and 3 of those gypsies that can read the palm of your hand just to guess the final outcome. <br/><br/>CHARACTERS:<br/>With the mythical Detective Case, also known as the world worst detective, a man so rough and rude that his witnesses would rather be run over by a slow moving freight train than to be questioned by him. <br/>And the hilarious Clown Bot who, although he works as a Detective Case’s sidekick, he hopes in reality that one day he will get a job as a circus clown. Unfortunately, and no matter how many applications he sends, no circus will ever accept a clown that is afraid of children. He never sleeps, so besides working by day as a sidekick, he also works by night as a stand-up comedian in a local bar. People say that he is a joke machine.<br/><br/>KEY FEATURES:<br/>Murder in the Hotel Lisbon has THOUSANDS of key features!<br/>- A point and click graphic adventure game.<br/>- Play as Detective Case and Clown Bot.<br/>- Search for clues and interview witnesses.<br/>- Take a rest, have a nap.<br/>- Solve the murder in the Hotel Lisbon.<br/>- Includes 3 aditional cases.<br/><br/>ORIGINAL SOUNDTRACK:<br/>Murder in the Hotel Lisbon may be low res and retro on the visual side, but we made sure that on the audio side your ears would rejoice with a complete original soundtrack. Composed of an orchestral band, a jazz band and a typical Portuguese Fado trio, the musical landscape contrasts beautifully with the colorful graphics.<br/><br/>GAME MUSIC:<br/>Throughout the game you will ear over 20 different tracks of orchestral music composed and recorded specifically for the game.<br/>All these tracks were recorded on studio with a 10 member band composed of friends and colleagues. All of them brought their soul and heart to these recordings and the results are absolutely AWESOME!<br/><br/>JAZZ MUSIC:<br/>Inside the GAF Bar, a 4 man band plays some cool Jazz.<br/>The character at the Piano is actually Filipe Melo who is doing a cameo and allowed us the rights to use some songs recorded previously with John Ellis, Romeu Tristão and João Pereira! BAM!<br/><br/>FADO MUSIC:<br/>To top it all, inside the Noitadas Restaurante we have a Portuguese Fado trio ready to entertain the guests. The song they sing was also recorded on studio. It is called &amp;quot;A Caldeirada&amp;quot; and it was originally written for famous Fado singer Amália Rodrigues.<br/>SUAVE! <br/><br/>The game is only available in English and Portuguese.<br/><br/>Find us on:<br/>Official - http://caseandbot.com/<br/>Facebook - https://www.facebook.com/NerdMonkeys<br/>Twitter - https://twitter.com/Nerd_Monkeys", "metacritic": null, "released": "2013-11-05", "tba": false, "updated": "2019-10-22T14:29:27", "background_image": "https://media.rawg.io/media/screenshots/3b9/3b9faa739a1ed9a8835aea87497abb94.jpeg", "website": "http://www.nerdmonkeys.pt/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Nerd Monkeys"], "genres": ["Adventure"], "publishers": ["Nerd Monkeys"], "esrb_rating": "Everyone 10+"}