{"id": 76388, "slug": "free-limo-flying-car-simulator", "name": "Free Limo Flying Car Simulator", "name_original": "Free Limo Flying Car Simulator", "description": "Like to drive fast down city streets? Fly high in a airplane? Look no further and get straight into the fun that is the flying car!<br/>Get in the driver seat of the specially modified sports car, do amazing stunts and drifts in the city city streets or offroad or activate airplane flight mode and turn your fast sports car into a unique flying car!!<br/>In an instance you went from a top car driving expert to a professional airplane pilot!<br/><br/>Get to drive the most luxury limousine you've ever driven. All city people will turn their heads once you drive by! Start to play the most amazing limo driving simulator the google play store has the offer. Be a real city driver who isn’t afraid of driving an enormous luxury limousine through the big city. Yes, this limo driving simulator will make you feel like a real limo driver! This simulation game experience is simply up there with the best of them.<br/><br/>Being a real city driver is more than just doing a bit of city travel and enjoying the beautiful game surroundings. This job really requires some professional real city driver skills! <br/>Drive an enormous luxury limousine in a real crowded city with lots and lots of city traffic. This is, as you might imagine, pretty difficult.. are you FIT for this driving challenge.<br/><br/>Fly your car around the city to perform multiple stunts and drifts. Enjoy a realistic flying car simulator and be the best car stunt race driver 3d.<br/>The game will start off by giving an option of flying car selection for the user to select the best flying car.<br/>Get to drive the most luxury limousine you've ever driven. All city people will turn their heads once you drive by! Start to play the most amazing limo driving simulator the google play store has the offer.<br/>Real car racing 3d games are fun to play also this newest one is exciting as well..<br/><br/>This limo driving simulator will make you feel like a real limo driver! This simulation game experience is simply up there with the best of them.<br/>Becoming a limousine driver is not easy it is a hard job. Real car racing 3d games are fun to play also this newest one is exciting as well.<br/>The level environment is a simulation of a flooded city with high-rise buildings.<br/>This game is best Limousine Car Parking experience and have most superior controls.<br/><br/>You are free in a world that you can do what you want. drive your limo around the town, play with physics and take off to the skies in your limo, reaching newer and higher places. Drive on top of buildings, scale ramps and structures, smash up your limo and other cars, do stunts.<br/>Be Carefull ! If our flying car Crash with any other car in sky then that other car will be blast and our car will damage.<br/>If your car collide any chemise (Wall) four times then your car will be blast.<br/>But this is not only a limo driver game but also fun if you are a fan of real car racing 3D games. As you need to move very fast so race the traffic and go as fast as possible.<br/><br/>!!!DOWNLOAD FOR FREE!!ONLY ON ANDROID!!!<br/><br/>-Fly through and amazingly detailed city environment, dodge and weave between skyscrapers!<br/>-Perfect the flying car and become the world's best pilot<br/>-Go to extreme speeds with super charged nitro boosts<br/><br/>FreeLimo Flying Car Simulator is made for all of you flight and driving simulation game fans, with all the best parts in one game!<br/><br/>GAME FEATURES:<br/>-Put your driving and flight controls to the test<br/>-Incredible HD Graphics <br/>-Real life sports car modified for flight capability<br/>-Detailed and immersive city world environment<br/>-Fun, realistic driving controls<br/>-Dynamic camera angles<br/>-Intuitive airplane flight physics<br/>-Free to play and easy to use", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-10-22T14:24:15", "background_image": "https://media.rawg.io/media/screenshots/9c2/9c217296e2e82c1be6dc285c71054aad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Darshit Patoliya"], "genres": ["Simulation", "Sports"], "publishers": ["Darshit Patoliya"], "esrb_rating": "Everyone 10+"}