{"id": 763826, "slug": "untitled-gloople-demo", "name": "untitled gloople demo", "name_original": "untitled gloople demo", "description": "<p>A short Auto battler demo created by Mismatched Socks. I'm a professional TFT player and wanted to take a stab making my own deep autobattler.<br/></p>\n<p><strong>If you lost your previous saved difficulty press \"=\" at the main menu to automatically unlock the highest difficulty. </strong>Every time I re-upload the game with bug fixes and game improvements, it seems to be resetting everyone's difficulty modifier.<br/></p>\n<p>A Short tutorial (i'd recommend you just jump into the game first without a tutorial cause it's more fun that way)<br/>- start by pressing the room labelled R<br/>- you are the gloople swarm, the enemies are the guys with swords and stuff<br/>- click and drag hives to position them<br/>- you can 2-star units by having 3 copies of the unit on your board/bench<br/>- 2-star units have double hp and double damage<br/>- you cannot 3-star units<br/>- hover over enemies to see what they do<br/>- every time you spawn a unit, it costs hp<br/>- after the fight, you get the hp back from any surviving unit<br/>- fight difficulty scales with floor quadratically<br/>- elites are about 2.25x harder than regular monster fight<br/></p>\n<p>This game is heavily inspired by games I've enjoyed in the past including Slay the spire, amorphous+, and TFT. \r\n    <br/><br/>Note that this game is still in very very early development (as seen by the mspaint art, no animations, etc). The fate of this game is still unknown, but enough people enjoy it I'm definitely going to keep developing it. <br/></p>\n<p>Any feedback is appreciated. Feedback link: https://forms.gle/E7JB5uxiPgWQKG61A<br/></p>", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-04-05T01:49:34", "background_image": "https://media.rawg.io/media/screenshots/5e7/5e7ebdd1c90dce11c4fc16b82b7a35c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mismatched Socks"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}