{"id": 76405, "slug": "hill-climb-truck-transporter", "name": "Hill Climb Truck Transporter", "name_original": "Hill Climb Truck Transporter", "description": "Hill Climb Euro Truck Transporter -2018 lets you become a real Driver! Featuring different trucks with lots of customizations, this truck simulator delivers an exciting driving experience that will make you feel like driving real trucks. Travel across many hills ,  Play the career mode of this truck simulator, make money, purchase new trucks and upgrades, explore the trucking world !  Become the King of The Hill Climb by playing Hill Climb Euro Truck Transporter.<br/><br/>Are you crazy for carrier truck racing or simulation games?We offer you a drive Hill Climb Euro Truck Transporter or European Hill Climb Euro Truck Transporter -2018  on off-road and Hill Climb Euro Truck Transporter -2018 on different hill stations.  Hill Climb Euro Truck Transporter -2018 in mountain very carefully and transport heavy weight cargo reach safely and timely without losing and damage any cargo item in way. You are an Indian big truck driver as a real racing and your duty is drive heavy truck. Driving grand Pack and Truck Transporter -2018 drive on uphill roads is not easy but you have to enhance and show you’re great and expert level truck driving skills here and transport cargo on different locations safely and timely. You can enjoy twisted turns, real modern physic control and beautiful hills scenes. As a good grand truck games driver fulfill you transporter truck duty. From this truck games you can make an expert Truck driver city crush.<br/><br/>Off road heavy cargo trucks or Indian truck are very difficult to drive but you can control this impossible china truck duty with top speed and top level driving skills.<br/><br/>Enjoy the game and any suggestion then please give your valuable feedback.<br/>- Awesome Engine Sounds<br/>- Lots of trailers to transport<br/>- Achievements and Leaderboards<br/>- Drive across hill roads and with goods<br/>- AI traffic system<br/>- HD 3D Graphics and 2D Graphics<br/>- Smooth Control<br/>- Play Free and Enjoy !<br/>- Different types of goods<br/>- Check point system", "metacritic": null, "released": "2018-06-05", "tba": false, "updated": "2019-10-22T14:24:15", "background_image": "https://media.rawg.io/media/screenshots/d44/d4479ae7c755347b45fd321bcd2378c4_ERyaMHn.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Darshit Patoliya"], "genres": ["Simulation", "Sports"], "publishers": ["Darshit Patoliya"], "esrb_rating": "Everyone 10+"}