{"id": 764095, "slug": "la-brujula-de-zaza", "name": "La Brújula de Zaza", "name_original": "La Brújula de Zaza", "description": "<p><strong>| SINOPSIS</strong><em> |</em><br/></p>\n<p><em>&lt;&lt; La Esencia es una energía nacida de la Naturaleza que flota en lo más recóndito de la ciudad. Probablemente casi nadie sea consciente de su existencia. Años atrás un grupo de científicos tuvo la oportunidad de descubrirla y estudiarla a fondo, pero en la actualidad dicha energía parece haber quedado oculta en el olvido, y tampoco se conservan documentos gráficos o escritos acerca de ella.</em></p>\n<p><em>Sin embargo, una curiosa muchacha de pelo rubio y de personalidad tímida y reservada está recorriendo la ciudad en busca de esta energía. Al parecer se encuentra en medio de una misión que consiste en recolectar la mayor cantidad posible de Esencia por medio de un misterioso artefacto parecido a una brújula. ¿En qué consiste exactamente su misión? ¿Qué sabe realmente acerca de la Esencia? ¿Y cómo ha conseguido ese artefacto parecido a una brújula capaz de absorber Esencia y almacenarla en su interior? <br/></em></p>\n<p><em>Pronto se producirá en la ciudad una lucha entre la propia Esencia y el temido Miasma, una energía antagónica a ésta que lleva años enterrada en el más absoluto olvido. Zaza, junto a Naomi, una muchacha amigable que se ofrece a ayudarla en su misión y Maxim, un encantador pero reservadísimo geek, comenzará una particular odisea para evitar que dicho Miasma se acabe adueñando la ciudad y termine por desplazar para siempre a la prístina y pura Esencia &gt;&gt;</em></p>\n<p><strong>| DATOS GENERALES |<br/></strong></p>\n<ul><li>Autor: Pocari.</li><li>Software empleado: Rpg Maker Vx Ace.</li><li>Estado del juego: Juego completo.</li><li>Género: RPG/Aventura.</li><li>Idioma: Español.</li><li>Duración aproximada: 14 -16 horas.</li></ul>\n<p><strong>| SOBRE EL JUEGO |</strong><br/></p>\n<p>La Brújula de Zaza es un RPG en español que fue finalizado en el 2022. Es un j-rpg de corte clásico (combates por turnos, exploración, diálogos, recolección de ítems, equipamiento de armas y adquisición de habilidades) cuya historia se desarrolla en una ciudad en la época actual. Dicha ciudad constituye el 'hub' principal del juego. En ella podemos comprar armas, equipamiento o ítems diversos para nuestros personajes, así como avanzar la historia, la cual se desarrolla a lo largo de 27 capítulos.</p>\n<p>La historia posee un tono optimista y positivo en la mayoría de los capítulos, aunque la tanda final de los mismos tiende a mostrar acontecimientos turbios y bastante oscuros. Las backstories de algunos personajes también poseen matices tristes y deprimentes, que chocan con el 'happy vibe' que predomina en la mayor parte del argumento.</p>\n<p>La estructura del juego se desarrolla, como ya he apuntado, por medio de capítulos. Mi intención era crear un juego que se asemejase a un anime de tv, donde en cada capítulo ocurren unos hechos distintos, muchos de ellos autoconclusivos, y que van dibujando poco a poco la historia principal o de trasfondo, y la cual se despliega en su totalidad en los últimos episodios. Así pues, hay capítulos con énfasis en los combates por turnos o peleas contra bosses, otros que se centran en avanzar la historia o desarrollar los personajes, otros centrados en la exploración pura y dura, etc.</p>\n<p>Los combates se desarrollan por turnos, ayudados por las típicas barras de espera que se van llenando poco a poco. Podemos atacar, utilizar la Esencia (que viene siendo magia) y usar ítems curativos u ofensivos, básicamente. Las peleas son sencillas y van directas al grano. A pesar de su sencillez, constituyen el 75% o más del contenido del juego, por lo que tampoco hay que subestimarlas. <br/></p>\n<p>El sistema de adquisición de habilidades basadas en la Esencia, y que es otorgado por las peculiares brújulas que poseen los personajes, permite a los héroes obtener nuevas habilidades a medida que van usando las anteriores en combate (o fuera del mismo, en caso de habilidades curativas). Por lo tanto es importante utlizar la Esencia siempre que sea posible, para así poder tener acceso a mejores habilidades y Esencia más poderosa. En el tramo final del juego es casi imprescindible poseer la Esencia más avanzada.<br/></p>\n<p>La exploración es un aspecto vital dentro del juego. A lo largo y ancho de los mapas encontraremos cajas metálicas que contienen ítems o dinero, entre otros, así como spots de luz que nos indican la presencia de los mismos o incluso de ítems valiosos como las vitaminas o las agi-rivas, que suben permanentemente parámetros como el HP o la agilidad, respectivamente. <br/></p>\n<p>El juego posee una duración aproximada de 15-17 horas, incluyendo el contenido opcional como la realización de breves side-quests, la obtención de la Esencia más poderosa y la adquisición de  las armas finales de los personajes.<br/></p>\n<p>El aspecto gráfico es 100% original. Todos los tilesets, sprites, animaciones de batalla (exceptúando algunas que fueron tomadas de internet), battlers e iconos fueron dibujados por mí. La música fue recogida de bandas sonoras de diversos juegos, así como de webs gratuitas de recursos musicales y sonoros. El juego fue creado en el software Rpg Maker Vx Ace y el período de desarrollo se produjo entre el año 2019 y 2021. <br/></p>\n<p>En comparación con mi primer proyecto completo, ''Las Esferas de Capricornia'', este juego me ha costado bastante pulirlo, principalmente debido a la ingente cantidad de mapas que posee, a la gran cantidad de líneas de diálogo y a los múltiples despistes e inconsistencias en la historia que han ido surgiendo. El juego pasó por numerosos checkeos y re-checkeos. Aún en la versión aquí publicada, que se supone que es la definitiva, quedan algunos bugs y errores dispersos por un lado y otro. <br/></p>\n<p><strong>| BUGS |</strong><br/></p>\n<p>A pesar de que el juego es jugable al 100%, hay bugs o fallos menores que se encuentran repartidos a lo largo de la aventura, tales como errores gráficos, o algunos fallos en la ortografía. El juego ha sido testeado hasta en tres ocasiones para comprobar que no exista ningún bug grave que impida avanzar en el juego. De todos modos, cualquier problema que impida avanzar en el mismo, no dudéis en comunicármelo lo antes posible.</p>\n<p><strong>|TIPS Y RECOMENDACIONES|</strong></p>\n<ul><li>Tan pronto como puedas, deberías hacerte con el ítem ''<strong>Llévame</strong>'' (aparece en la tienda, en el capítulo 2), con el cual podrás moverte rápidamente por el mapa de la ciudad.</li><li>Durante los primeros capítulos todavía no tendremos acceso a la Esencia (la ''magia''), por lo que es recomendable equipar a los personajes con las últimas armas, así como tener a mano ítems curativos.</li><li>Hay ítems como las vitaminas o los Agi-riva que suben permanentemente determinados parámetros de los personajes. Busca las cajas que hay repartidas por los mapas.</li><li>Los <strong>CD-ROM dorados</strong> son unos ítems muy valiosos, puesto que permiten guardar la partida en cualquier sitio. Se encuentran en el interior de algunas de las cajas rojas que hay a lo largo de la aventura. Estaría bien que los reservases para los capítulos finales.</li><li>Al comienzo de cada capítulo estaría bien que visitases las tiendas de ropa y armas del centro comercial. Generalmente se ponen a la venta nuevas armas, ropa y accesorios cada pocos capítulos.</li><li>Para obtener hechizos de ESENCIA más poderosos es vital que uses siempre que puedas las brújulas en los combates. </li><li>La mayoría de las side-quests se desbloquean a lo largo de los capítulos 25 y 26. <strong>ES MUY IMPORTANTE</strong> que las completes antes del capítulo 27, puesto que una vez comience dicho capítulo, no tendrás acceso a la ciudad.</li><li>Hay una gran cantidad de ítems clave a lo largo del juego. Recuerda que la mayoría de ellos deben ser utilizados en determinados objetos/lugares/mapas por medio de la tecla <strong>S </strong>(dicha tecla abre el menú de selección de ítems clave).</li></ul>\n<p>Espero que disfrutéis del juego. Para cualquier duda, sugerencia o reporte de bugs, contactad conmigo. </p>", "metacritic": null, "released": "2022-03-30", "tba": false, "updated": "2022-04-05T03:53:10", "background_image": "https://media.rawg.io/media/screenshots/d91/d91a668883bb20dc96fdaa06936f3f4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pocari"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}