{"id": 76414, "slug": "racing-on-bike-free", "name": "Racing on Bike Free", "name_original": "Racing on Bike Free", "description": "Racing on Bike Free<br/>The best bike stunts game!<br/>Racing on Bike Free is an action packed fun game. Live life on the edge! Drive your bike through amazing landscapes and perform some amazing stunts!<br/>Tighten your seat belt and speed through some challenging levels. Each level is more thrilling than the previous level. Perform some serious stunts and race to the finish line really fast! <br/>Come and play the most exciting bike stunt game. In Racing on Bike Free, you will feel like a real stunt rider! Experience the fastest and most exhilarating 3D stunts action.<br/>FEATURES of Racing on Bike Free:\u2028<br/>- Stunning 3D graphics\u2028<br/>- Smooth and realistic bike handling<br/>- Realistic game sounds<br/>- Tilt steering<br/>- Different bikes to choose from<br/>- Simulator like controls<br/>- Easy to learn and drive<br/>- Dangerous hilly environment<br/>Racing on Bike Free is a fast paced, challenging game to play. Just tilt your phone to steer your bike to the left or right. Touch or press the gas (right) button to accelerate and the brake (left) button to slow down. The faster you drive the higher you score! Racing on Bike Free is an exciting bike stunts game that will get your adrenaline pumping!<br/>So what are you waiting for? Get Racing on Bike Free NOW and race to the finish line!", "metacritic": null, "released": "2017-01-17", "tba": false, "updated": "2019-07-29T20:13:42", "background_image": "https://media.rawg.io/media/screenshots/62a/62a8d267871eae43e83d6d0103c7cdf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lavkush Gupta"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Lavkush Gupta"], "esrb_rating": null}