{"id": 764349, "slug": "puff-daddy-goes-to-the-bathroom", "name": "Puff Daddy goes to the Bathroom", "name_original": "Puff Daddy goes to the Bathroom", "description": "Puff Daddy Goes to the Bathroom is a challenging (some might say frustrating) physics-based game where you help the puffer fish Daddy escape a restaurant! The gameplay is centered around movement and when you are controlling Puff Daddy you have three options to get around: flopping, jumping or rolling.\r\n<p>Flopping lets you move forward and is the basic way to get around. Jumping is really useful and helps Puff Daddy avoid gaps and hazards and also get up to higher places. </p>\n<p>Rolling lets you move around a lot faster and is also good for knocking over obstacles. The movement is purposefully made to feel tricky to challenge the player.</p>\n<p>__________________________</p>\n<p>The restaurant is filled with many obstacles and hazards. The stove spouts out bursts of flames and a hungry cat is roaming around the floor ready to eat you up. The game is made to be challenging but addicting, making you both frustrated for losing but still motivated to try and escape again. </p>\n<p>__________________________</p>\n<p>A crafty player might discover alternate routes and tricks to skip difficult parts of the game which rewards exploration and experimentation. The goal of the game is to find your way to the bathroom so you can flush yourself down to freedom! \r\n</p>\n<p>__________________________<br/></p>\r\nCredits:\r\nDesign &amp; code:<br/>Eira Saastamoinen<br/>Martin Hallgren<br/>Sigge Lindberg\r\nArt:<br/>Akharadet Ekchanok<br/>Fredrik Jansson (Music also)<br/>Wirachaya Tachakomol", "metacritic": null, "released": "2022-03-29", "tba": false, "updated": "2022-04-05T05:45:52", "background_image": "https://media.rawg.io/media/screenshots/e81/e810946a6a4fd8dc43c52db87252808c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["patetfisk", "eitherror", "Lillfingerpaj"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}