{"id": 764345, "slug": "unreal-and-wwise-integration-demo", "name": "Unreal and Wwise Integration Demo", "name_original": "Unreal and Wwise Integration Demo", "description": "<p>Hey all! <br/></p>\n<p>This is a modified level from Infinity Blade called \"Ice Lands\" which can be found on the Unreal Market Place. </p>\n<p>Lizard Wizard Base Mesh by Gareth Brewer: https://sketchfab.com/3d-models/lizard-wizard-base-mesh-5fd8bb96dd3b4c3aa0b0580e<br/></p>\n<p>Gameplay should be pretty straightforward: Follow the traders advice and find the dragon statue who will then advise your next move.<br/></p>\n<p>This was done to demo multiple wwise sytems as well as challenging myself to have a believable environment for a player to travel through. <br/></p>\n<p>For systems we have:</p>\n<p>-Footsteps/Jumps that change based on materials thanks to a line trace done in Unreal's blueprint system (This uses animation tagging)<br/></p>\n<p>-External and Internal Ambiences that are both controlled by attenuation sharesets in wwise as well as events that attenuate depending on the scenario (talking to the dragon statue lowers all internal ambiences for dramatic effect as an example)</p>\n<p>-Randomized looping ambience variables with slight variation in pitch to help alleviate any noticeable looping</p>\n<p>-Wwise reverb zone use (for inside the dungeon)</p>\n<p>-Wwise events triggered by Unreal trigger volumes (Both beginning overlaps and ending overlaps)<br/></p>\n<p>Enjoy running around! It's a very short experience but I hope that you enjoy the ambience and detail put into the audio experience.  </p>\n\n<p>*This was done for educational purposes only*</p>", "metacritic": null, "released": "2022-03-29", "tba": false, "updated": "2022-04-05T05:44:08", "background_image": "https://media.rawg.io/media/screenshots/f15/f151b211aad3a103c0fe02e1374c56d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Audiomancy"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}