{"id": 7645, "slug": "steampunk-tower", "name": "Steampunk Tower", "name_original": "Steampunk Tower", "description": "<p>Tower defense on the rise!<br />\n&quot;A shot in the arm for the tower defense genre&quot; — Modojo, 4.5/5<br />\n&quot;Simply fantastic&quot; — Capsule Computers, 9.5/10<br />\nTake charge of the immense Steampunk Tower and help the eccentric Lord Bingham protect his precious Etherium Mine.<br />\nThis app offers in-app purchases.  You may restrict in-app purchasing using your device settings.<br />\nAs the Imperial Army’s foot soldiers and mechanical monstrosities march into battle, fortify your epic spire with machine guns, cannons, lightning coil, saw launchers and more.<br />\nREACH FOR THE SKY<br />\nWork your way up the ranks through a heroic campaign spanning over 20 battlefields and seven challenge-based skirmishes. With each major promotion, unlock a new tier to your tower and take that extra firepower into battle.<br />\nCALL TO ARMS<br />\nLord Bingham is pulling out all the stops to protect his precious Etherium! With the help of his research head, Jane, research new technologies to upgrade your turrets and improve your chances of surviving the Imperial Army’s relentless attack.<br />\nBLOW OFF SOME STEAM<br />\nThey don’t call it Steampunk Tower for nothing. Immerse yourself in this stylized world filled with steampunk designs and a soundtrack made up of jazzy big band compositions.<br />\nGame Features:<br />\n• Tower defense taken to new levels!<br />\n• Stylish graphics and soundtrack inspired by Steampunk<br />\n• Upgrade every weapon and lay waste to enemies big and small<br />\n• Visually stunning Etherium powers!<br />\n• UNIVERSAL: Runs great on iPhone, iPod Touch and iPad<br />\nVisit the Chillingo room on the App Store to see more of our great games: appstore.com/chillingo<br />\nImportant Consumer Information. This app: Requires acceptance of EA’s Privacy &amp; Cookie Policy and User Agreement.Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy &amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications. To disable see the settings in-game. The app uses Game Center.  Log out of Game Center before installation if you don’t want to share your game play with friends.<br />\nUser Agreement : http://terms.ea.com/en<br />\nPrivacy &amp; Cookie Policy : http://privacy.ea.com/en<br />\nVisit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br />\nEA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates</p>", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2019-10-22T13:58:40", "background_image": "https://media.rawg.io/media/screenshots/fc4/fc48aa3ac4fffdc21b06692a1a8c0a2a.jpeg", "website": "https://chillingosupport.zendesk.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 1, "platforms": ["Web", "iOS"], "developers": [], "genres": ["Action", "Strategy"], "publishers": ["Chillingo"], "esrb_rating": "Teen"}