{"id": 764515, "slug": "the-orphan-with-a-big-family", "name": "The Orphan With a Big Family", "name_original": "The Orphan With a Big Family", "description": "<p>A young girl sets out on a long and perilous journey to save her family from a mysterious illness.</p>\n<p>A short and simple original fairy tale, animated as a kinetic novel.   Second in my series of LGBTQ+ fairy tales!  (More will be coming eventually, after I take some time to work on weightier projects...and learn more about animating in Ren'py.)<br/></p>\n<p>A bit under 5,000  words long.  No choices, just a quirky little fairy tale. <br/></p>\n<p>Most of the art in the game is available on itch.io (some for free, some purchased), but the hag's sprite was custom designed for this game by Raine.  There's a devlog giving full, specific credits, along with links to the assets used. <br/></p>\n<p><strong>Content Warnings:<br/></strong></p>\n<ul><li>Mentions of illness and death</li><li>Monsters, most of which are not even remotely scary</li><li>Mentions of marriages involving people whose free will has been impaired by an enchantment</li></ul>\n<p><strong>Other Warnings:</strong> <br/></p>\n<p>Please don't strain your eyes trying to read the facing page text on  the title screen:  it's just flavor to make the book look like an actual  book.   (And it's basically the same text as in the opening narration...only the opening narration version has been polished up a bit.)<br/></p>\n<p>Due to how Ren'py works and how the characters are animated,  some scenes make my computer slow down a bit.  More powerful PCs might not have that problem there, and less  powerful PCs might experience more (or  more intense) slowdowns.  As the  animation speed is not actually relevant to the story experience, this  doesn't seem too important, but I thought I should mention it anyway.<br/></p>", "metacritic": null, "released": "2022-03-29", "tba": false, "updated": "2022-04-05T06:58:40", "background_image": "https://media.rawg.io/media/screenshots/198/198d6c99a2fa2dc6cb8022c6f67aaaca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["PyrrhaIphis"], "genres": [], "publishers": [], "esrb_rating": null}