{"id": 76461, "slug": "learn-to-brace", "name": "Learn to Brace", "name_original": "Learn to Brace", "description": "People tend to believe that, in the event of a plane crash, all passengers are going to die. In fact, you can survive the vast majority of aircraft accidents. An important action that every passenger should be familiar with is to assume an appropriate \"Brace position\" before an impact occurs.<br/><br/>The Learn to Brace app, created by the Human-Computer Interaction Lab at the University of Udine, is an interactive game that allows you to experience an emerging landing and see the effects on your body of the positions you try.<br/><br/>The position the app considers as correct is the optimized one suggested by the latest tests conducted by researchers at the U.S. Federal Aviation Administration (see bibliography below).<br/><br/>The ideas and suggestions contained in the Learn to Brace app are NOT intended as a substitute for the information provided by the airline you are flying with and its staff. When you are on a plane, always follow strictly all the instructions provided by the airline and its staff.<br/><br/>BIBLIOGRAPHIC SOURCE<br/><br/>Taylor , A. , Moorcroft , D., Deweese, R. \"Effect of passenger position on crash injury risk\" , Proceedings of the Seventh Triennial International Fire &amp; Cabin Safety Research Conference , Philadelphia , USA , December 2013 .<br/>[The Abstract can be downloaded from the FAA's Web site at this link: http://www.fire.tc.faa.gov/2013Conference/files/Restraint_Systems/TaylorBrace/TaylorBraceAbs.pdf ]", "metacritic": null, "released": "2014-04-08", "tba": false, "updated": "2019-10-22T14:06:24", "background_image": "https://media.rawg.io/media/screenshots/d39/d390033479186e3800e6c37125711cb2_CFQyu9Q.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dipartimento di Matematica e Informatica - Universita' degli Studi di Udine"], "genres": ["Simulation"], "publishers": ["Dipartimento di Matematica e Informatica - Universita' degli Studi di Udine"], "esrb_rating": "Everyone 10+"}