{"id": 76478, "slug": "cliffhanger-chat-stories", "name": "Cliffhanger - Chat Stories", "name_original": "Cliffhanger - Chat Stories", "description": "READ the chat stories that everyone is becoming “addicted to” and people “can’t stop reading”. Snoop on thrilling conversations as they unfold before your eyes. Make CHOICES that determine who LIVES or DIES. Keep your heart racing with new stories added to CLIFFHANGER weekly.<br/><br/>Whether you have five minutes or five hours, love suspense or horror stories, you’ll be on the edge of your seat with twists you’ll never see coming.<br/><br/>If you’re a fan of short stories or up for a long read, Cliffhanger will keep you captivated till the very end. Don’t miss out on the new app everyone is talking about.<br/><br/>To contact support, please visit: https://cliffhangersupport.zendesk.com/hc/en-us/requests/new <br/><br/>By using Cliffhanger, you agree to our Terms of Use and Privacy Policy: http://getcliffhanger.com/<br/>Please note that Cliffhanger is free to read, and you are able to purchase in game items with real money that enhance the stories. Cliffhanger weekly, monthly and yearly FastPass Subscriptions allow you to read stories without waiting and view unlimited images. Subscriptions automatically renew unless auto-renew is cancelled in your Account Settings at least 24-hours before the end of the subscription period. Additionally, auto-renewals may be turned off in your Account Settings after purchase. Your iTunes Account will be charged when the purchase is confirmed. Any unused portion of a free trial will be forfeited if you purchase a subscription during the free trial period.", "metacritic": null, "released": "2017-08-14", "tba": false, "updated": "2019-10-22T14:24:17", "background_image": "https://media.rawg.io/media/screenshots/aa2/aa2cc9f12918543576c4b0f898056f27_zTi8ZRW.jpg", "website": "https://getcliffhanger.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hype Bits"], "genres": ["RPG", "Simulation"], "publishers": ["Hype Bits"], "esrb_rating": "Teen"}