{"id": 764754, "slug": "megaman-x-unleashed", "name": "Megaman X Unleashed", "name_original": "Megaman X Unleashed", "description": "<p>Megaman X Unleashed is a fangame with the intention of showing that there are still Megaman fans around the world.<br/>This project has the mission to create a fighting game based on the series Megaman X in 32-bit style, reviving the nostagia and putting a dream to see mavericks fighting against others in a 2d reindeer in practice with more than 20 selectable characters, including bosses and Secret Characters. It was 4 years of development in the first version plus 1 year to refine and improve it for this final version, with a different mechanics of the normal fighting games mixing systems of classes, elements of rpg and a bit of marvel vs capcom.\r\n</p>\n<p><em>Story:</em>\n</p>\n<p>In the 22xx year after the events of Megaman X8, Sigma before being completely defeated, he kept a plan B secret if his defeat happened before the jakob tower was built, in the midst of his research. Lumine discovered an energy immersed in in the middle of the space in which it was named \"Xenon\". This supposed energy allows the user to create dimensional portals between time and space known as Genesis Portals and control systems that have electrical energy. After seeing the potential Lumine discovery achieved a form of stabilizing it and manipulating it to its own interests. Placed in a satellite in earth orbit Sigma has designated Vile to trigger the device connected to sphere that would make several dimensional portals open causing several parallel lines of the time thus bringing enemies and Rivals back to the time with a plan to occupy X and the Mavericks Hunters in order to complete their plan for the destruction of the human race. Now X and the hunter mavericks must defeat defeated Mavericks and prevent Plans from Sigma and its allies from destroying humanity and dominating the world.\r\n</p>\n<p><em>Gameplay:</em>\n</p>\n<p>Megaman X Unleashed has a differentiated gameplay in which the player joins the style of the chosen character and build a strategy to defeat his adversary with the powers and ablities that his chosen character possesses. The game has a system of classes, each character possesses a class in which defines its style of gameplay, are: <strong>Defensive</strong>, <strong>Strategy</strong>, <strong>Fighter</strong>, <strong>Ofensive</strong> and <strong>Special</strong>.\r\n</p>\n<p><strong>Defensive:</strong> Just as the name already says the character who owns this class has the most pulled style for defense in which most of his attacks consist of projectiles and immobilization attacks. The character who owns this class his spice bars with loading faster, easier to reproduce or execute their specials in addition to possessing the \"Perry\" ability in which it allows the user to block any attack triggered by a 1 second making his special bar load faster (except the mavericks).\r\n</p>\n<p><strong>Strategist:</strong> This class is the most difficult to master, it is similar to the defensive class but it has some differences as the damage is smaller and more focused on fights at a distance.\r\n</p>\n<p><strong>Fighter:</strong> Unlike the other two mentioned, this class has a gameplay system more geared towards fighting games concentrating on their specials and spells around combos and attacks with directional ones.\r\n</p>\n<p><strong>Offensive:</strong> Similar to the fighter class, it has a greater variety of combos and discursive attacks with the same command line as the fighter. It also has the unique ability to load your special bar at any time you want in the middle of the game. class fighter have this ability)\r\n</p>\n<p><strong>Special: </strong>Class that possesses abilities of two different classes, making it possessed a unique style soon giving the class name.\r\n</p>\n<p>#MegamanXUnleashed #Megaman #fangame #arcade #multiplayer #FightingGame\r\n</p>\n<p>#MegamanX</p>", "metacritic": null, "released": "2022-03-28", "tba": false, "updated": "2022-04-05T08:55:45", "background_image": "https://media.rawg.io/media/screenshots/569/569cd76a3745e2103df4d130c8bfe7f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "PC"], "developers": ["伝説Corrupião"], "genres": ["Shooter", "Fighting"], "publishers": [], "esrb_rating": null}