{"id": 764813, "slug": "amelia-across-worlds-a-hololive-fangame", "name": "Amelia Across Worlds (A Hololive Fangame)", "name_original": "Amelia Across Worlds (A Hololive Fangame)", "description": "<p>Amelia Across Worlds is a procedurally generated minigame where you have to survive and not get caught by Mumei who is actively chasing you in a set world. Smol Ame must zoom past the guardian of civilization to win!</p>\n\n<p><strong>Disclaimer</strong></p>\n<p>This is a fangame and is not affiliated with Hololive nor does it represent Cover Corp. and other labels under the company. I do not own any ownership of any characters under the Hololive property. Support the V-Tubers and Amelia Watson of Hololive Myth which this game is based on! This application is completely free withs no form of monetization; I do not profit from this product. </p>\n\n<p><strong>Credits: (Music and Models)</strong></p>\n<ul><li>おもちゃのダンス @ フリーBGM DOVA-SYNDROME OFFICIAL YouTube CHANNEL - YouTube</li><li>Misteavous Myth-buster - YouTube - Composition and Arrangement: Camellia- Myth-buster - song by Watson Amelia</li><li>\"Smol Ame - Amelia Watson, HoloMyth\" (https://skfb.ly/o799D) by Seafoam is licensed under Creative Commons Attribution-NonCommercial (http://creativecommons.org/licenses/by-nc/4.0/).</li><li>\"Nanashi Mumei - Hololive EN Council\" (https://skfb.ly/orZ7Z) by TwiIight_3D is licensed under Creative Commons Attribution-NonCommercial (http://creativecommons.org/licenses/by-nc/4.0/).</li></ul>\n\n<p><strong>Other Notes from the developer(?): </strong></p>\n<ul><li>This game was developed as a school project under my final high school programming class, this is bound to have to have bugs as I am not that well versed in programming and unity, but I took this chance to challenge myself and create something that I actually enjoy, welcome to my first ever game.  (tbh, I myself question the game title as well www)</li><li>You can follow me on Twitter (@PixelNayt), but I mostly do illustrations and animations.</li><li>Also note that I'm quite busy and kind of limited with game dev. knowledge therefore might not be able to resolve bugs that appear, apologies for the inconvenience~ qwq</li><li>More credits: All Smol Ame animations are also made by the amazing Seafoamboi, again, please go check them out!</li><li><em>Known Issues: </em><ul><li><em>Audio being low when changing scenes (resolve by clicking options every time you are in the main menu)* SFX doesn't do anything as there is no SFX in the game*</em></li><li><em>Mumei may or may not glitch out of the world when she is chasing you on extremely high mountains (slopes) This is a very rare occurrence but is still possible.</em></li></ul></li></ul>", "metacritic": null, "released": "2022-03-28", "tba": false, "updated": "2022-04-05T09:29:27", "background_image": "https://media.rawg.io/media/screenshots/413/413455142361c51e17e0bc7ac9b0e183.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PixelNayt"], "genres": [], "publishers": [], "esrb_rating": null}