{"id": 764816, "slug": "humanity-cruscades", "name": "Humanity Cruscades", "name_original": "Humanity Cruscades", "description": "<p>Humanity Cruscades is suppose to be a sort of representation of a conflict between angels and demons on Earth.  The earth is over run with angels and demons alike and a balance needs to be restored. Only one race may have control over the Earth. Player 1's controls are WASD to move and then Q to activate its ability. Player 1's ability is to shoot two arrows that when colliding with clouds it will destroy the. In comparison Player 2's controls are the arrow keys and then SHIFT to activate its ability.  Player 2's ability is to create a cloud under itself as an emergency save. I really wanted to focus on theme and creating a visually appealing experience. I feel Humanity Cruscades achieves what I want it took and it looks well done. </p>\n<p>In terms of making the game I knew before starting that the new thing I wanted to add was abilities for both player 1 and player 2. The first thing I focused on what the sprite design for the characters. This took the longest by far I wanted to go with a more simple design but had aspects that were elaborate like the wings. I also had trouble implementing the abilities originally. The arrows were especially difficult because I only had one arrow object and I had to rotate them weird and shoot them out at an angle.  Overall, I think the most complicated and time consuming part of the project was drawing all the sprites. The arrows also do not work entirely as they should. Creating the functionality was a little simpler do to the time constraint of the elaboration but I think the overall feel of the game came out well. </p>", "metacritic": null, "released": "2022-03-28", "tba": false, "updated": "2022-04-05T09:31:25", "background_image": "https://media.rawg.io/media/screenshots/371/37190c8b39c6be4d969ee1140f19b776.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sojiadenusi"], "genres": [], "publishers": [], "esrb_rating": null}