{"id": 76495, "slug": "last-empire-war-z-strategy", "name": "Last Empire – War Z: Strategy", "name_original": "Last Empire – War Z: Strategy", "description": "Battle other survivors from around the world and train your own zombie army in Last Empire – War Z, the base-building war game! Defend your empire as the walking dead roam the streets and the apocalypse alliance tries to destroy your empire. Survive the zombie apocalypse in Last Empire - War Z and develop your empire with allied survivors to slaughter zombie troops. Can you be the strongest survivor of them all?<br/><br/>Last Empire - War Z is a zombie apocalypse-themed survivor game. Battle against zombies and other survivors to build your empire and army. Team up with allies from around the world to fight enemies, defend against the walking dead and participate in online events. Gather resources to support your army and grow your empire in Last Empire - War Z!<br/><br/>Last Empire - War Z Features:<br/><br/>End of the World Survivor Games<br/>*Play survivor games with other players online!<br/>*View zombie battles on the world map in real-time and chat with alliance members worldwide!<br/>*Fight an army of the walking dead and other survivors to expand your empire!<br/><br/>Build an Army of Survivors<br/>*Zombie Troops: Train deadly zombie troops as part of your army to destroy enemies!<br/>*Improve your army and recruit Officers with unique survival skills and abilities!<br/>*Use the Varied Skill Trees and develop your army to fit your play style!<br/><br/>Take on the Zombie Apocalypse Online <br/>*In-game events offer constant challenges and great rewards!<br/>*Work together to achieve powerful bonuses in survivor alliance activities!<br/>*Participate in base-building strategy games and use new technology to fight the walking dead!<br/><br/>Destroy zombies, clash with other survivors or join a powerful alliance as you struggle to survive the zombie apocalypse in the world of Last Empire - War Z!<br/><br/><br/>Download today and take part in the zombie war!", "metacritic": null, "released": "2015-12-04", "tba": false, "updated": "2019-10-22T14:39:02", "background_image": "https://media.rawg.io/media/screenshots/c8d/c8d81ce36bfe12bd558237b0cdfd6d98.jpg", "website": "http://www.im30.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LONG TECH NETWORK"], "genres": ["RPG", "Strategy"], "publishers": ["LONG TECH NETWORK"], "esrb_rating": null}