{"id": 764985, "slug": "open-mod", "name": "Open Mod", "name_original": "Open Mod", "description": "Open Mod is a free-to-play, tactical, extreme hardcore first person shooter that, for the time being is developed by only 2 developers. Our goal is to grow slowly and steadily, attract modders that would join forces with us in adding more content to the game as this game is supposed to be a public fps, developed and funded by the community.<br/><br/>The gameplay should be on point. This is a niche game that is addressed to players that like slow paced, extreme-hardcore, round-based no-respawning, competitive game modes and want to get immersed fully into the battle.<br/><br/>         - There is no in-game HUD, we've moved everything except the crosshair to a tablet that is a core element of the game. The tablet will be used to check the minimap, text chat, see equipped loadout, see objectives etc. There is much to say about it but to save you the reading of a lot of words you can simply check <strong>THIS</strong> short video which shows an overview of the tablet.<br/><br/>         - There is proximity voice chat and an animated radio voice chat that players can use to communicate. But with caution as the enemy could hear you talking if you are in their range. So when the player is in enemy area they can use the Left hand animations to communicate or the text chat from the tablet. Those mentioned features of the gameplay have been showed in Ep2 of Open Mod Showcase longer video which can be found <strong>HERE</strong><br/><br/>         - There is no scoreboard or killfeed during the round, only at the end of a round and at the end of the game. This should cause the players to get immersed into the game and communicate via radio when they took somebody down. However, the minimap will show dead player markers as well, so more or less, checking the tablet or using the radio voice chat for call outs is mandatory. <br/><br/>         - In the past month we've been reworking our mag system from the ground, the player can carry only 4 mags per weapon, we've added a mag check system and animations and a reload type that keeps the mag so you can use it later, that takes slightly more time to perform. To save you the reading of a lot of words you can simply check <strong>THIS</strong> short video out, which shows you an analysis of how the new mag system, mag check and reload keep mag works. <br/><br/>         - There is a decent weapon customization system as well as some cursed attachment setups available for you to play with. To check our Weapon customizaion showcase video click <strong>HERE</strong>. Some more attachments and skins have been added since this video, you would have to play the game and see them for yourself.<br/><br/>         - There are quite a few first person experience customizing options, such as the custom weapon positioning, custom and independent fields of views, dual render and non dual render scopes or ability to pick from a variety of weapon animations, such as reloads/draw. There are not too many weapons that have more than one reload/draw animation currently, but some do, such as the AKM, Scar or the pistols. There is a glimpse of how all the features mentioned at this bullet work and look in the Ep2 of Open Mod Showcase longer video <strong>HERE</strong>, somewhere around the middle of it.<br/><br/>         - There is a smart watch that will show the round timer, health points and armor points. Those will be also displayed on the tablet but to avoid having to draw it to check your health and armor you could simply have them in front of you all the time. Or, if you dont because you have a grip that keeps the hand with the watch downer and it wont be in front of you, you can use the Free looking to look at it, or adjust the weapon positioning or the fields of view in order to have it in view. This aspect has also been showed somewhere around the begining in <strong>THIS</strong> short video.<br/><br/>         - Our controller is written from the ground and has a lot of features, such as a realistic leaning, sliding, left hand anims, left handed mode, free looking, head nodding (head moves in the direction you are free looking), 4 vaulting mechanic types and more. It is also a full body controller meaning that if you are as crazy as us and not feel good if there are no legs, then this is for you!<br/><br/>         - There is a point budget inventory system that balances the loadouts so that players manage their points how they want, depending on their preference. This system is similar to Insurgency Sandstorm's and is designed to prevent fully maxed out loadouts. <br/><br/>         - All weapons and attachments from the game are unlocked from the start, there is no pay to win scheme, absolutely everything will be unlocked, the only thing that gets in the way is the point budget system mentioned in the above bullet. There will, however, be weapon skins and attachment skins that will be paid. Player model skins will always have their color scheme (dark swat-ish blue for military and dark red-ish for terrorist team) so nobody can say that we will sell camouflage skins for player models. There will also be paid animations. Basically some cosmetic items will have a price in our stores to help us sustain the game. (Oh, BTW, if you thought the animations might give an advantage, it is false, because all the animations e.g. reload empty of a specific weapon will have the same amount of time for all the animations)<br/><br/>         - There are 3 competitive game modes available at this time. Heist, Elimination and Demolition. We currently dont have a video available on Demolition as it was developed recently and did not have time to overview it in a video. However, you can check <strong>THS PHOTO</strong> to see a short description on how to play all of the game modes. The heist game mode has been featured, only cinematically, in <strong>THIS</strong> very short teaser video, our first Youtube video, but also more in-depth along with the Elimination game mode in <strong>THIS</strong> longer video, somewhere around the end of it, which is the 2nd episode of Open Mod Showcase that has been linked in 2 of the above bullets as well. There is, however, a glimpse of what the Demolition game mode is about in <strong>THIS</strong> video. It's pretty much a \"Plant the bomb\" similar to CS:GO or SD from CoD, but should be harder because you have to learn a code that is generated at the start of the round and manually insert it on the tablet, when you are in range of the bomb site. This should provide more immersion and it's more realistic as well, you could enter the code wrong while being under pressure. Additionally, the range of the bomb site is bigger than in traditional plant the bomb game modes, thus making the game harder as the attacking/defending teams should defend a slightly bigger perimeter to avoid losing the round.<br/><br/><br/>However, the essence of Open Mod lies in the concept of community - encouraging people to express their preferences and getting involved in any matter regarding the development of the game, as well as integrating user input as content in the game. The community functions on our Discord server Open Mod Republic; make sure you check it out to stay updated on things we have done, features that we are currently working on and plans for the future.", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-08T04:35:49", "background_image": "https://media.rawg.io/media/screenshots/c33/c332017f56f29178354347eb294c8858.jpg", "website": "http://hypergamey.studio", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 471, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hyper Gamey"], "genres": ["Action", "Indie"], "publishers": ["Hyper Gamey"], "esrb_rating": null}