{"id": 764971, "slug": "lucky-tlhalerwa-zombie-rampage", "name": "Lucky Tlhalerwa - Zombie Rampage", "name_original": "Lucky Tlhalerwa - Zombie Rampage", "description": "STORY PLOT: Verde Diamente Presidente Francisco Antonio Rodriguez Mobilizes La National Policia And Defense Force To Combat An Outbreak Of Zombies, Calling For The Manhunt, Arrest And Prosecution Of 3 Scientists Who Made The Outbreak At The Sunset Valley Laboratories, The 3 Scientists Identities Have Been Confirmed -Dr. Thomas Windsor, Dr. Sebastian McGarretson And Dr. Jacob Warren. The 3 Were Given Away By A Freelance Scientist Dr. Maria Elizabeth Who Was Involved In The Project But Unaware Of The Full Scope And Intentions, She Called Sunset Valley Security Enforcement General Garrettson And Informed Him, He Called The Presidente And Passed On The Information. More And More Details Of The Project Are Still Being Uncovered And Pieces Being Put Together, Security Enforcement General Garrettson With The Backing Of The Verde Diamente Government Deploys A Team Of 6 Involving: SGT Michael McAulife(The Player) , PVT Prince Lee Collin, COL Johnson Voorhies, PV2 David Winfrey, SPL Ripley Titus And CPL Richard Godfrey These Were Deployed To The Sunset Valley Shopping Mall And West Residential Block To Help Innocent People And Clear Zombies As The First Of Many Objectives Of Their Mission<br/><br/><br/><br/>STORY CAMPAIGN ELEMENTS: Lucky Tlhalerwa - Zombie Rampage has 7 Total Chapters And Takes 5-6 Hours To Complete The Linear Story Campaign, The Whole Game Takes Place In Verde Diamente's Capital City: Sunset Valley, The First Chapter Is Set In Sunset Valley Security Enforcement Head Quarters, Where S.V.S.E General Garrettson Deploys The 6 Man Team To The Sunset Valley Shopping Mall And West Residential Block On Their First Objective.<br/><br/>VEHICLE GAMEPLAY: Quad Bikes Can Be Found Throughout The Story On Parking Lots And Used To Travel Very Long Distances From One Place To Another.<br/><br/>SOLDIER GAMEPLAY: Lucky Tlhalerwa - Zombie Rampage Has A Shoot'Em Up Style Gunplay With Full Automatic Upgradable Assault Rifles, Where Michael McAulife (The Player) Faces A Wide Variety Of Enemies Including Killer Dogs, Regular Zombies, Exploding Zombies, Crawling Zombies, Armoured Zombie Brutes, Heavily Armed Terrorists And Bandits Etc. Michael McAulife (The Player) Carries 2 Assault Rifles The M16 And The AK-47 With A Mounted 3x Reflex Optic And A Grenade Launcher Under Barrel, He Has Melee Kick And Punch Attacks. He Can Shoot Freeze Energy Bursts Which Will Freeze Zombies In Place Temporarily For A Short Period Of Time Allowing The Player A Further Chance To Kill Them, Killing Enemies Awards The Player With XP, The Player Starts Off The Story Campaign On Level 1 / 20, This Gained Enemy XP Goes To Leveling Up Which Then Unlocks New Items And Upgrades Like: Increased Weapon Damage, Quick Draw Grip, Vertical Grip, Extended Magazine, Increased Freeze Energy And More. Besides The Freeze Ability The Player Has The Special Ability, Which Upon Activation Allows The Player To Use Timed Abilities Like: 30 Seconds Of Infinite Ammo, 30 Seconds Of Infinite Medikits, 20 Seconds Of Infinite Explosive Rounds Etc. Throughout The Story Campaign You Will Encounter Special Key Rooms Which Contain Secret Documents, Ammo, Dinero, Bombs And More, To Unlock Them You Need A Special Key Which Is Expensive And Can Be Bought At The Store Or Found In The Environment.<br/><br/>THE STORE / SHOP: Michael McAulife (The Player) Will Encounter Multiple Stores Throughout The Story Campaign Which Allow Him To Buy New Items Or Sell Items He Collected From The Environment, You Can Buy Medikits, Molotovs, Flashbangs, Flares, Special Keys, Refill Ammo And More. Selling Items Gives You Money (Dinero) Which Is In VDP Verde Diamente PESO.<br/><br/>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T04:15:35", "background_image": "https://media.rawg.io/media/screenshots/f3b/f3b0accedcc9c2d43e6592f85e40ec21.jpg", "website": "http://luckytlhalerwa.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 331, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lucky Tlhalerwa"], "genres": ["Action", "Adventure"], "publishers": ["Lucky Tlhalerwa"], "esrb_rating": null}