{"id": 764954, "slug": "godfall-ultimate-edition", "name": "Godfall Ultimate Edition", "name_original": "Godfall Ultimate Edition", "description": "<p>Smash through your enemies and seize ultimate power in this loot-powered action adventure set in a bright fantasy world.</p>\n<p>Godfall: Ultimate Edition is the best and most complete way to enjoy Godfall. Experience everything assembled in on package - the base game, the Fire &amp; Darkness Expansion, and unlock the Ascended and Pre-order Cosmetic Packs for your journey.</p>\n<p>Aperion is on the precipice of ruin. You are the last of the Valorian knights, god-like warriors able to equip Valorplates, legendary armor sets that transform wielders into unstoppable masters of melee combat. Tear through foes as you climb through the elemental realms and challenge the mad god, Macros who awaits you at the top. Ascend in Godfall, the first-of-its-kind, looter-slasher, melee action-RPG.</p>\n<p>Adventure through stunning vistas and challenge unique enemies in the Earth, Water, Air, and Fire Realms<br />\nEquip 12 unique Valorplates, each with evolving playstyles and fearsome looks<br />\nComplete challenges to unlock and show off your style with 123 unique Valorplate skins<br />\nMaster all five weapon classes, each with unique playstyles and a variety of longswords, polearms, warhammers, greatswords, and dual blades<br />\nLevel up, learn new skills, and uncover legendary weapons with devastating effects on the battlefield<br />\nTest your skills in the Dreamstones, Ascended Tower of Trials, and Lightbringer against the toughest foes and earn top-tier loot<br />\nFight solo, or alongside friends with three-player PvE online co-op play<br />\nUnlock cosmetic items from Ascended and Pre-order cosmetic packs:<br />\nChrome and Gold Valorplate skins for Silvermane, Phoenix, and Greyhawk<br />\nZer0’s Sword Longsword: Unleash the blade of a master assassin from another universe<br />\nGold Shield skin, Gold Royal Banner skin, 5x Gold Weapon skins<br />\nUnique multiplayer lobby title<br />\nRed Valorplate skin for Vertigo, Yellow for Typhon<br />\nExperience all the content in the Exalted Update:<br />\nDive deeper into the story of Orin, Macros and Aperion with all new cutscenes<br />\nNew Valorplate Shards, unlocking all new unique abilities for each Valorplate<br />\n35 new ways to style your gear – 25 weapon, 5 banner, and 5 shield cosmetics<br />\nDive into the Spirit Realms game mode with 6-player PvE online co-op play</p>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2023-11-25T11:52:42", "background_image": "https://media.rawg.io/media/games/94d/94d177b568edc2c9cbc19472c037f77e.jpg", "website": "https://www.godfall.com/", "rating": 2.88, "rating_top": 4, "added_by_status": {"yet": 6, "owned": 89, "beaten": 1, "toplay": 5, "dropped": 7}, "playtime": 3, "achievements_count": 63, "ratings_count": 8, "suggestions_count": 702, "game_series_count": 0, "reviews_count": 8, "platforms": ["PlayStation 5", "PlayStation 4", "Xbox Series S/X", "Xbox One", "PC"], "developers": ["Counterplay Games"], "genres": ["Action", "Adventure"], "publishers": ["Gearbox Publishing"], "esrb_rating": null}