{"id": 765032, "slug": "frontier-fortress", "name": "Frontier Fortress", "name_original": "Frontier Fortress", "description": "<h3>Frontier Fortress</h3><br/>Frontier Fortress is medieval-themed tower defense game. It combines tower defense with classic RTS vibes. The game is displayed in 2.5D axonometric view with 20x20 tiles grid-based map.<h3>Campaign Mode</h3><br/>In campaign mode you play as the leader of a nation trying to defend your land against enemy invasion. There are 3 campaigns representing 3 nations story, each campaign divided into 2 parts, each part with 5 scenarios. A campaign tells story of a nation struggling against the invasion by enemy faction. Every campaign has unique nation, enemy faction, and map type.<br/><br/>Campaign features:<br/><ul>* 30 total scenarios</ul><ul>* 3 campaigns divided into 2 parts, each part contains 5 scenarios</ul><ul>* 3 player nations (The Empire, The Republic, The Kingdom)</ul><ul>* 6 enemy factions (The Nomads, The Raiders, The Knights, The Horde, The Rebels, The Islanders)</ul><ul>* 6 map types (Valley, Coast, Tundra, Steppe, Forest, Town)</ul><ul>* 20 types of building/tower with varied characteristics and abilities, each unlocked after finishing certain campaign scenario</ul><ul>* 25 types of enemy unit with varied characteristics and abilities, each enemy faction has unique units</ul><ul>* More challenging \"expert mode\" campaign, unlocked after completing all scenarios perfectly</ul>", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-04-08T05:34:32", "background_image": "https://media.rawg.io/media/screenshots/b0d/b0d1ba3963a32253c05671fcb6e6dbf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Imperial Interactive"], "genres": ["Strategy", "Simulation"], "publishers": ["Imperial Interactive"], "esrb_rating": null}