{"id": 765072, "slug": "child-of-lothian", "name": "Child of Lothian", "name_original": "Child of Lothian", "description": "<strong>Disclaimer: This is an early access build &amp; will be further improved upon</strong><br/><br/>The streets of 18th century Edinburgh disappear beneath the shadows of witch hunters looming in the streets. Hushed whispers appear in every corner and suspicious gazes of townspeople fall upon their neighbors, as friends become enemies. Among the townsfolk of Edinburgh, there is a young orphan called Katheryn. A helpful man, who she now regards as her new mentor, is teaching her crucial survival skills to evade the evil witch hunters and survive the streets of Edinburgh. <br/><br/><strong>Key Features</strong><br/><br/><strong>KATHERYN</strong><br/>Become Katheryn, a recently orphaned girl, who is accused of witch craft. Katheryn is learning how to use her sling and stealthily traverse in order to survive the streets of Edinburgh.<br/><ul> <li>Find pebbles and use your sling to create distractions or destroy objects.<br/> </li><li>Evade the witch hunters by sneaking through the streets of Edinburgh and using the environment to your advantage.<br/> </li><li>Sharing is caring, any valuables people carry on them are not safe from your pickpocketing.<br/> </li><li>Scramble around the city to find loot or to get a better vantage point. </li></ul><br/><strong>THE OLD TOWN OF EDINBURGH</strong><br/>Explore the winding, damp streets of the old town on your journey to survive the witch hunts. The town is full of secrets and characters to meet and interact with. Every problem has its own set of solutions and completing errands for the town-folk leads to different outcomes. Make your own choices and live to see the consequences.<br/><ul> <li>Explore a reimagining of 18th century Edinburgh.<br/> </li><li>A bustling, living city. </li></ul><br/><strong>THE WITCH HUNTER</strong><br/>In an era of widespread fanaticism, witch hunters are roaming the city, searching everywhere for witches. These relentless zealots have accused, judged and executed your family. The witch hunters are onto you and will stop at nothing to hunt you down.<br/><ul> <li>A menacing force with an iron grip on the city.<br/> </li><li>Don’t get caught!<br/> </li><li>Witch hunters will use evidence you leave behind to find you and chase you throughout the world. </li></ul>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2023-04-22T09:15:44", "background_image": "https://media.rawg.io/media/screenshots/e1e/e1e9246c09e98754821cec1adb2cbd28.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 8, "ratings_count": 1, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Exploding Apples"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Breda University of Applied Sciences"], "esrb_rating": null}