{"id": 765014, "slug": "sigh-of-the-abyss-shadow-bonds-prologue", "name": "Sigh of the Abyss: Shadow Bonds ▪ Prologue", "name_original": "Sigh of the Abyss: Shadow Bonds ▪ Prologue", "description": "Shadow Bonds is an introduction to the world and characters of Sigh of the Abyss.<br/><br/>You have been chained to a stranger, a boy foolish—or brave—enough to flee the gilded cage where magi are kept docile and pliant.<br/>The curse will kill you both unless you find a way to break it. Anyone else would already be dead, but not you—for you hear the ancient voice of the Abyss, and have been blessed—or cursed—with powers dark and terrible.<br/><br/>Did the Abyss bestow upon you supernatural strength and agility? Do you have the power to manipulate the shadows and see what they see? Perhaps your dark gift is prying open the minds of others only to break them and have them do your bidding. <br/><br/><br/><br/>Embrace your emotions. The four humors color the tone of your responses and your personality: will you be the carefree sanguine, the thoughtful phlegmatic, the anxious melancholic or the fiery choleric?<br/><br/>Will you stay friends or seek something more? Learn more about your companions, see how they react to the curse placed upon you, accept or reject their aid. Shadow Bonds will give you a glimpse into the friendship and romance system of Sigh of the Abyss.<br/><br/><ul><li>An introduction to the characters and setting of Sigh of the Abyss<br/></li><li>Customize the protagonist's name and skills<br/></li><li>A branching narrative with hard choices and terrible consequences<br/></li><li>Three unique endings with several variations each<br/></li><li>Sample what the romance interests have to offer, or stay friends<br/></li><li>Learn more about the rich setting of Sigh of the Abyss  through codex entries</li></ul>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T05:12:40", "background_image": "https://media.rawg.io/media/screenshots/2b2/2b2aaafda79e6a580f8f7fdeddbce835.jpg", "website": "https://rascaldev.works/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 472, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rascal Devworks"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Rascal Devworks"], "esrb_rating": null}