{"id": 765047, "slug": "road-maintenance-simulator", "name": "Road Maintenance Simulator", "name_original": "Road Maintenance Simulator", "description": "Experience the everyday life in a German street maintenance service and complete a variety of realistic tasks in the area of road construction and maintenance! For your work you will have unique vehicles and various usable tools at your disposal.<br/><br/><br/><strong>Numerous tasks await you!</strong> In Street maintenance service, 30 extensive missions await you in a freely navigable road network. Complete a variety of exciting tasks in your daily work, including placing road markings, removing safety barriers, trimming trees, cleaning roadsides, installing traffic signs, crash barriers and delineators, and, of course, repairing roads. <br/><br/><br/><strong>Choose from a variety of vehicles! </strong>Drive in unique vehicles such as platform trucks and all-purpose vehicles in a freely drivable road network with highway, main and country road from your work yard to the site and complete your missions with combination roller and tar machine or even on foot!<br/><br/>For your work you have various usable tools and objects at your disposal. Among them are motor vibrators, garbage gripper, cordless screwdrivers, signs, delineators and crash barriers.<br/><br/><br/><ul><li>30 extensive missions on the highway and main roads<br/></li><li>Freely drivable road network with freeway, main and country roads<br/></li><li>Walkable depot with fleet of vehicles and material warehouse <br/></li><li>More than 8 different road maintenance vehicles, such as bulldozer, all-purpose vehicle, road marking vehicle and dump truck<br/></li><li>Realistic tasks such as securing the work area, removing safety barriers, placing road markings, trimming trees, cleaning guard rails, cleaning roadsides, repairing roads, placing traffic signs, placing guard rails, placing delineators and much more<br/></li><li>Several objects for securing and completing the missions (from barks to guardrail to vibration dampers)<br/></li><li>Openworld map with interconnected road network<br/></li><li>Realistic graphics (Unreal Engine)</li></ul>", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-04-08T05:57:00", "background_image": "https://media.rawg.io/media/screenshots/962/962dfdf48d80880191a43c9bc9105b12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 50, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Caipirinha Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Aerosoft"], "esrb_rating": null}