{"id": 765008, "slug": "arkheim-realms-at-war", "name": "Arkheim - Realms at War", "name_original": "Arkheim - Realms at War", "description": "Team up in a Realm of 15 for a ten week long strategic battle across the rediscovered flying Islands of Arkheim to conquer the Eternal Light! In this free to play team based strategy MMO each game round feels different and gives you a new chance to band together and go for victory. <br/><br/>You will start each round on a level playing field, competing with other player Realms for resources, territory and ascension. Your village will support the war efforts of your Realm with resources and a multitude of troops as well as valuable Warlord equipment gained from the vast dungeons. The real battle, however, is fought on the strategic real time map on each island, where your armies clash in epic battles. Here you do not only build up your own Realm, but also raid Orbs, conquer towers and fight wars against others to dominate the island. <br/><br/>With each Moon Phase, the most successful Realms can conquer Ascension Gates and move to a higher island, where more competition, but also more valuable resources essential for the final battle during the epic endgame phase await. In this last all out war, you reawaken all your fallen soldiers to send them against the vile demons holding the Eternal Anvils, all the wile your enemies move to destroy you forever.<br/><br/><strong>Key features of Arkheim - Realms at War:</strong><br/><br/><strong> Engage your realm in massive warfare:</strong> Unite in a realm with players from all over the world. Fight for territorial conquest and valuable, arcane orbs.<br/><br/> <strong>Choose your race and build a thriving city:</strong> Play as ruthless Elves or inventive Dwarves and turn your settlement into a flourishing city.<br/><br/> <strong>Command mighty armies and defeat your enemies:</strong> Command legendary Warlords, each with a unique set of abilities, and send multiple armies into epic PVP battles.<br/><br/> <strong>Ascend and conquer the New World:</strong> Harvest the power of the three moons and ascend with your Realm into Eternal Light.<br/><br/> <strong>Play this new fantasy MMO in true cross-platform: </strong>The depth of a PC game, with the accessibility of an app.", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T05:04:29", "background_image": "https://media.rawg.io/media/screenshots/919/91995becefc90ec2ea6e527622589c15.jpg", "website": "https://www.arkheim.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 492, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Travian Games"], "genres": ["Strategy", "Massively Multiplayer"], "publishers": ["Travian Games"], "esrb_rating": null}