{"id": 765031, "slug": "lust-academy-season-1", "name": "Lust Academy - Season 1", "name_original": "Lust Academy - Season 1", "description": "Our project is called \"<strong>Lust Academy</strong>\" and it's no secret that we were heavily inspired by the Harry Potter books and The Magicians TV series.<br/><br/><strong>Lust Academy</strong> - is a story-driven 3d visual novel where you play as a young 18-years guy who has just found that he is a wizard!<br/><br/>Currently, we have two game modes: <strong>Sandbox </strong>and <strong>Visual Novel</strong><br/><br/>In <strong>Sandbox</strong>, we've focused on freedom of choice and free roam. However, we don't like the grind, and our game has no mandatory grinding elements.<br/><br/>In <strong>Visual Novel</strong>, free roam and freedom of choice is limited because it's heavily focused on comfortable gameplay and delivering the story.<br/><br/><br/><br/>You play as an 18y.o guy who has missed an opportunity to go to college with a sports scholarship due to injury. <br/>However, a new, unbelievable opportunity knocks on your door the day you receive the letter from <strong>Cordale Academy</strong> of Magic and Wizardry.<br/><br/>Visit the oldest magic academy in New World, meet charming girls, true friends, and formidable enemies! Explore the magical world, solve mysteries and get from novice to an Almighty legendary wizard! <br/><br/>All of this, and more in <strong>Lust Academy</strong>.<br/><br/><br/><br/>Take a trip to <strong>Cordale</strong> - the oldest academy of magic and wizardry in the New World. This journey brings a lot of possibilities:<br/><br/><ul><li>Explore<strong> 25</strong> various locations with free roam<br/></li><li>Meet more than <strong>25</strong> potentially <strong>romanceable characters</strong> and find all the adult encounters<br/></li><li>Enjoy more than <strong>150</strong> smooth and beautiful <strong>60fps animations</strong><br/></li><li>Check out more than HQ<strong> 4500 renders</strong><br/></li><li>Marvel at our custom-made comfortable user interface. <br/></li><li>Don't forget to check out <strong>5</strong> different mini-games</li></ul><br/><br/><br/>This game is an adult visual novel with included <strong>18+</strong> content. Here's the list of what you may find in <strong>Lust Academy</strong>:<br/><br/><ul><li>Masturbation <br/></li><li>Handjob <br/></li><li>Blowjob <br/></li><li>Boobjob <br/></li><li>Vaginal sex<br/></li><li>Anal sex<br/></li><li>Sex with Magical creatures <br/></li><li>Pantyhose </li></ul><br/>Please note that the following features are entirely optional, and you won't encounter them accidentally:<br/><ul><li>LGBTQ+ content<br/></li><li>Futa\\Trans content</li></ul><br/><br/><br/><strong>Lust Academy</strong> is a Visual Novel game, which means the core gameplay is focused on point-n-clicking and enjoying the story.<br/><br/><ul><li>Your main goal is to explore the locations, interact with characters and complete their storylines to further your relationship.<br/></li><li>You can focus on whichever character you like and whom you want to ignore.<br/></li><li>The main quest revolves around getting from an average guy to a legendary mage through studying and solving problems.<br/></li><li>The game includes several mini-games that you can skip at any moment. None of them are mandatory and, we hope, that they can be pretty fun.<br/></li><li>All the interactable objects and characters are highlighted when you hover your mouse over them.<br/></li><li>If you need help with any of the storylines, use the Character Info tab on the interface.<br/></li><li>If you don't like wandering through locations, you can use the Calendar tab on the interface to fast-travel to any available character.<br/></li><li>You can get to know more about characters and check out extra renders in Lustagram app on the Phone tab.<br/></li><li>Every female character (and some male too) in the game is (or eventually will be) a love interest. Follow their questline to get to know them better.</li></ul>", "metacritic": null, "released": "2022-04-11", "tba": false, "updated": "2024-02-09T17:51:10", "background_image": "https://media.rawg.io/media/screenshots/abe/abe6324fccc64dc6aa17034340adc56d.jpg", "website": "", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 1, "owned": 42, "beaten": 7, "toplay": 7, "dropped": 1, "playing": 3}, "playtime": 7, "achievements_count": 86, "ratings_count": 5, "suggestions_count": 555, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "macOS"], "developers": ["Bear in the Night"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Bear in the Night"], "esrb_rating": null}