{"id": 765063, "slug": "best-forklift-operator", "name": "Best Forklift Operator", "name_original": "Best Forklift Operator", "description": "<h3>⚙️👷 ＳＵＭＭＡＲＹ 👷⚙️</h3>📢 <strong>Best Forklift Operator</strong> is a unique game about driving a <strong>forklift </strong>- a vehicle without which world trade would stop. You can experience the <strong>challenges </strong>of a forklift operator by playing as you like: on a <strong>gamepad</strong>, with a mouse and keyboard, or by immersing yourself entirely in this world by running the game on <strong>VR goggles</strong>.<br/><br/>📢 Take the training and show that you are ready for the <strong>challenges</strong>. Complete tasks <strong>fast and precisely</strong>, earn money and become the <strong>king of warehouses</strong>, yards, loading and unloading. Just be careful not to damage your equipment or products, if this happens your wallet will quickly become empty!<br/><br/>📢In the current version of the game (Early Access) - There’s a basic version of <strong>career mode</strong> in which you earn money by completing missions and enjoying life to the fullest in your forklift. This happens in two warehouses where we undertake a series of challenges.<br/><br/>📢The game features a combination of faithful simulation and entertainment that forklift fans have been waiting for for a long time.<br/><h3>⚙️👷 R O A D M A P 👷⚙️</h3>💬 <strong>Best Forklift Operator</strong> is a project that will be developed on an ongoing basis.<br/><br/>🔽 Currently we have to offer 🔽<br/>Now you can enjoy a realistic driving model, two warehouses, two forklifts, basic economy, ten missions, two extra missions with randomly generated challenges; experience the whole game also in VR mode, in which all tasks take on an entirely new flavor.<br/><br/>🔽 Here's what we have planned for the following updates: 🔽<br/>👷‍♂️ The third, new, largest warehouse space - connected to the loading yard;<br/>👷‍♂️ New and varied mission modes;<br/>👷‍♂️ Third (largest) forklift;<br/>👷‍♂️ Arcade mode;<br/>👷‍♂️ Native and Steam Leaderboards;<br/>👷‍♂️ Steam Achievements;<br/><br/><strong>We also count on the votes of the community, as we want to develop this game along with what you expect from it!</strong><br/>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2023-08-09T17:38:55", "background_image": "https://media.rawg.io/media/screenshots/de4/de4df82590b7c96e228a46f67528d4e5.jpg", "website": "https://discord.gg/XZSAGaByD5", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7}, "playtime": 1, "achievements_count": 17, "ratings_count": 1, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Setapp"], "genres": ["Simulation", "Racing", "Casual", "Indie"], "publishers": ["Gamedust"], "esrb_rating": null}