{"id": 76519, "slug": "toy-defense-world-war-i-strategy", "name": "Toy Defense. World War I – strategy", "name_original": "Toy Defense. World War I – strategy", "description": "Put your defense and strategic skills to the ultimate test in the new Tournament Mode! Defend your base from the never ending waves of enemies and compete with your friends in weekly tournaments! Play for as long as you can survive! <br/><br/>Experience a totally explosive gameplay in the new tower defense game in the WWI setting! Now you have even more opportunities, many more weapons and tactical tricks. Eliminate foes, defend your base and feel for yourself the atmosphere of the true born warfare. Lead your army to victory by any means! <br/><br/>Toy soldiers but real war! <br/><br/>Game features: <br/><br/>- Recreated World War I atmosphere <br/>- Over 90 thrilling war missions in a variety of worlds <br/>- 4 historically accurate weapons with 24 upgrades <br/>- Joint missions with your friends in the new Cooperative Mode!<br/>- Battles with 9 different enemies<br/>- Facebook and Twitter integration <br/>- 4 absolutely new cool features:<br/>*Repairmen. Now towers can be repaired without your assistance!<br/>*Resurrection. Revive a ruined tower and take part in the battle again!<br/>*Squashing. Help your army, join the battle yourself! Squash the enemy with your finger!<br/>*Protective barrage. Defend your base. Crush the enemy with a blast wave!<br/>- No ads!<br/><br/>In the up-coming updates you will get new worlds, new toy soldiers and new weapons upgrades. <br/><br/>Be the first to discover all the innovations: <br/>http://www.Melesta-Games.com <br/>http://www.facebook.com/ToyDefense <br/>http://www.twitter.com/MelestaGames<br/><br/>Make sure to check out our other games! <br/><br/>Toy Defense 2 – The most epic battles of World War II await you! <br/>Toy Defense 3: Fantasy – Face the fire – dragons are coming!<br/>Toy Defense 4: Sci-Fi – Defend the Universe from alien forces!", "metacritic": null, "released": "2014-04-17", "tba": false, "updated": "2019-07-29T21:53:06", "background_image": "https://media.rawg.io/media/screenshots/060/060e40340fefaffc92447c907f097815.jpg", "website": "http://www.melesta-games.com/toy-defense.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Melsoft"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["Melsoft"], "esrb_rating": null}