{"id": 765169, "slug": "stationery-beatriz-on-the-move", "name": "Stationery Beatriz: On the Move", "name_original": "Stationery Beatriz: On the Move", "description": "<p>D. Beatriz needs to go to her stationery in FEUP, but the path through the building isn't as easy as she expected, and there are obstacles everywhere! Help D. Beatriz solve the puzzles in her way and the various different opponents.</p>\n<p>You must reach the exit door as fast as possible, using whatever stationery supplies you find along the way (they might come useful)</p>\r\nInstructions\r\nControls\r\n<ul><li><strong>Movement </strong>- A, D / Key Left, Right</li><li><strong>Climb ladders </strong>- W / Up Key (Go up), S / Down Key (Go down)</li><li><strong>Throw Banana</strong> - J</li><li><strong>Throw Pencil</strong> - K</li><li><strong>Attack with ruler</strong> - L</li><li><strong>Deploy paper airplane (glider)</strong> - Left Shift</li></ul>\r\nItems\r\n<ul><li><strong>Pencil </strong>- Gives one pencil to the player, to throw at enemies to eliminate them.</li><li><strong>Disguise </strong>- The player disguises themselves as a cleaning lady to not get caught one time.</li><li><strong>Ruler </strong>- Gives the player two charges of ruler attacks, which they can use to eliminate an enemy from behind. After the two charges are used, the ruler breaks.</li><li><strong>Paper Airplane / Glider</strong> - Ability to glide until they collide with the ground. They can change direction mid-flight but the velocity is constant.</li></ul>\r\nEnemies\r\n<ul><li><strong>Cleaning Lady - </strong>Walks back and forth inside a designated area. If the player touches her, the player loses. The player can distract the cleaning lady by throwing a banana inside her cleaning area.</li><li><strong>Door Professor</strong> - Peeks through the door from time to time to see if it can detect the player. Their field of vision indicator goes red when the teacher is peeking. If a box is pushed in front of the door, it will no longer open.</li><li><strong>Pencil Thrower</strong> - Periodically throws pencils. These pencils travel until a wall/box is hit.</li></ul>\r\nEnvironment\r\n<ul><li><strong>Pressure plates and bridges/walls</strong> - Players can activate pressure plates using boxes or their own weight. Some pressure plates only need to be activated once, but some require an object on top to remain activated. When activated, they reveal hidden bridges or walls that the player can use.</li><li><strong>Ladders</strong></li><li><strong>Exit door (Objective) </strong>- In order to complete the level, the player must reach the exit door, marked with a green \"Exit\" sign.</li></ul>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-08T07:10:19", "background_image": "https://media.rawg.io/media/screenshots/769/7694efd418067823db7c068591071acc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["davide-castro20"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}