{"id": 765341, "slug": "celestwal-adventure", "name": "Celestwal adventure", "name_original": "Celestwal adventure", "description": "<p>One of the best adventure puzzle games offline!</p>\n<p>Beautiful graphics in this Story that will make you dream! Live the adventure, solve puzzles and quests in this adorable point &amp; click adventure game.</p>\n<p>Join <strong>Max</strong>, <strong>Flo</strong>, <strong>Dadi</strong>, <strong>Rafa</strong>, and <strong>Rob </strong>on their journey! Explore the mysterious world filled with puzzles, found the way to enter the master's house, and solve mystery enigmas and riddles. Explore and search for hidden treasures, and fulfill the adventure quests of the game. Escape the room and reveal the greatest mysteries of the game with Celestwald – Puzzles Adventure Game offline. </p>\n<p>No secret may remain hidden in this puzzles adventure game! choose your hero between 5 fantastic characters and prove your intelligence! Other brain games are merely crosswords while with this one you will be able to explore and help your hero to take care of the magical tree Celestwald by completing many quests and missions and solving countless puzzles! </p>\n<p>Act like an actual adventurer, solve the puzzles, find treasure chests and artifacts, and solve the adventure quests of the game! This is not a classic point-and-click game, use all your wits to find out how to make Babaorom and your Master happy! </p>\n<p>Why do you have to download and install Celestwald – Puzzle Adventure Game on your Smartphone or tablet instead of other free jigsaw games or mysteries games? </p>\n<p>✓ Celestwald – Adventure Puzzles Game is very easy to use so you need just to install it for free on your device and use it instantly. The best thing is that you don't need to create an account before playing our game. </p>\n<p>✓ Celestwald – Adventure Puzzles Game propose 6 chapters with many riddles and adventure quests. </p>\n<p>✓ Celestwald – Adventure Puzzles Game propose 5 Fantastic characters, choose your hero and enjoy the unforgettable adventure. </p>\n<p>Solve the mystery and the puzzle! Escape the locker room and enjoy the best Point'n'click adventure game. </p>\n<p>Get hints with the Questions/Answers and help with our walkthrough videos on our website: </p>\n<p>http://www.samcreation.ch/Ptitboutchoux/Celestwald-help.html</p>\n<p>• WHAT’S THE STORY BEHIND CELESTWALD ADVENTURE PUZZLES •  </p>\n<p>Master Theo, a great but old alchemist, wants to have an apprentice to help him to take care of the magical tree Celestwald. To satisfy him, complete many quests and missions and solve countless puzzles! </p>\n<p>  </p>\n<p>• LIKE THE CELESTWALD ADVENTURE PUZZLES •  </p>\n<p>https://www.facebook.com/Celestwald </p>\n<p> • ONLINE HELP•  </p>\n<p>http://www.samcreation.ch/Ptitboutchoux/Celestwald-help.html </p>\n<p> • LANGUAGES•  </p>\n<p>The detective game Celestwald puzzles adventure is available in English and French.</p>\n<p> • MORE•  </p>\n<p>Celestwald adventure puzzles and enigmas can be played offline! </p>\n<p>Celestwald adventure game and puzzles, displays no ads.</p>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-08T08:15:22", "background_image": "https://media.rawg.io/media/screenshots/d59/d5946888722fafa0aaa109021a3d77ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["AML Creation"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}