{"id": 765358, "slug": "bubble-run-skovzorus-rex", "name": "Bubble Run (SkovZorus Rex)", "name_original": "Bubble Run (SkovZorus Rex)", "description": "<p><strong>PITCH :</strong><br/>\n</p>\n<p>Vous souhaitez retourner en enfance ?\r\n</p>\n<p>Découvrez « Bubble Run », le jeu mobile de billes qui vous fait revivre vos meilleurs souvenirs d’enfants ! Parcours, sauts, obstacles, accélérations, mondes différents… laissez-vous tenter par cette incroyable expérience. \r\n</p>\n<p>On vous met au défi de « tiquer » le maximum de billes en prenant de la vitesse à la fin de chaque niveau pour espérer avoir le plus de points possible. <br/></p>\n\n<p>You wish to go back to childhood ?</p>\n<p>Discover « Bubble Run », the marbles mobile game that will let you go through your childhood memories again ! Courses, Obstacles, different worlds ... Let yourself be tempted by this incredible experience.</p>\n<p>We challenge you to hit on the biggest amount of marbles by taking speed in the end of each level in order to get the maximum amount of points.<br/></p>\n\n\n<p><strong>HOW TO PLAY :</strong>\n</p>\n<p>Ce jeu se joue en mode portrait.\r\n</p>\n<p>1. Appuyer sur le côté  gauche et droite sur l‘écran pour éviter les différents obstacles et faire avancer la bille sur le parcours.\r\n</p>\n<p>2. Le but du jeu étant de ne pas tomber dans la fosse malgré les obstacles et de toucher le maximum de billes à la fin du jeu pour gagner le plus de points. <br/></p>\n\n<p>This game is played in Portrait mode.</p>\n<p>1. Press on the left or right side of the screen to avoid obstacles and go forward with the marble.</p>\n<p>2. The goal is to avoid obstacles, falling of the track and to hit the maximum amount of marbles in the end of the level to gain lots of points.<br/></p>\n\n\n<p><strong>FEATURES :</strong>\n</p>\n<p>• Personnalisation de la bille\r\n</p>\n<p>• 50 niveaux dans plusieurs « mondes » (intérieur, extérieur…) <br/></p>\n\n<p>• Customization of  the marble<br/></p>\n<p>• 50 levels in several worlds (interior, exterior ...)<br/></p>\n\n\n<p><strong>CONTEXT : </strong>\n</p>\n<p>On est quatre étudiants de l’Institut de l’Internet et du Multimédia et on avait pour objectif de créer un jeu mobile hypercasual pendant 4 jours sur le thème des « jeux d’enfants ».\r\n</p>\n<p>On a choisi les billes car c’était le jeu phare à la récréation il y a encore quelques années. Pendant notre enfance, nos parents nous emmenaient souvent en balade au parc et dans la ville. On s’est dit que l’on recréerait ces souvenirs à travers les billes dans le jeu, grâce à des parcours en ville notamment.  <br/></p>\n\n<p>We are four students of the IIM and we had for objective to create an  hypercasual mobile game in 4 days on the theme « child games »\r\n  We choose marbles because it was leader of recess games until a few  years ago. During our chilhood, our parents used to take us for a walk in  the city and it's parks. <br/></p>\n<p>We told ourselves that we wanted to recreate  those memories through marbles in the game, using city levels for  example.</p>\n\n\n<p><strong>OUR TEAM : </strong>\n</p>\n<p>Artistic Director : Victoire GAILLARD\r\n</p>\n<p>Communication : Chloé ORER\r\n</p>\n<p>Game Developer : Adrien RIBEIRO &amp; Bastien BARNÉOUD-CHAPELIER</p>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-08T08:22:44", "background_image": "https://media.rawg.io/media/screenshots/15b/15be5ff17bed3627df9ab373348667dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android"], "developers": ["SkovZorus Rex"], "genres": [], "publishers": [], "esrb_rating": null}