{"id": 765456, "slug": "time-gate", "name": "Time Gate", "name_original": "Time Gate", "description": "<p><strong>Game Description</strong></p>\n<p>A unique mixture of 2D story and platformer game. Time Gate throws players into a world of random disarray of time and how it’s out of control. Being forced into the disorder, you must travel through multiple time gates to understand and solve what is happening with the world.</p>\n<p><strong>Development Log:</strong></p>\n<ul><li>When brainstorming about a game, I couldn’t think about a general direction or idea to build upon. Thus, I just flipped a coin on 2 words I was interested in and see what kind of imagination I can bring out with this word. It was between “time” and “maze” and it landed on time and thought maybe I can design a game with a past, present and future time theme game (realizing too late how hard this task but it was too late :c). To add the cherry on top, I decided to try making a 2D game because I’ve seen my friends create one before recently thus I gave it a try.\r\n</li><li>In terms of style and looks, originally I wanted to do a switch between the old village time and the modern city life but couldn’t find and have enough time to create sprites for the city. And my backup plan was to have a dark, gloomy forest area as a replacement. The next challenge was to find a character model to display the world but also creating/adjusting a script for moving was difficult to achieve. I do and did want to make my own asset and graphics for this game but given the time to learn and other stuff, I decided to fill the environment and models with similar settings/environments just to show the feeling. The next challenge I had was to have the camera movement with the character, most of the sources I found either crashed Unity, bugged out other parts of the map or didn’t work. Thus, at the moment, I can’t get the camera movement to follow the player without having Unity crashing every time I apply the script to the player.\r\n</li></ul>\n<ul><li>Overall, my experience using Unity was fun, interesting and challenging. It was hard to grasp and understand how Unity works for the first couple of times and frustrating at some points but after a few days, I started to get used to it a bit. But the coding part was not for me but the visualization and aesthetics design aspect.\r\n</li></ul>\n\n<p><strong><strong>Asset:</strong></strong>\n</p>\n<ul><li>Free Pixel Art Forest - Eder\r\n</li><li>Prototype Hero Demo - Pixel Art - Sven Thole\r\n</li><li>Sunny Land - Ansimuz\r\n</li><li>Easy Parallax - Anatomic \r\n</li></ul>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-08T09:12:27", "background_image": "https://media.rawg.io/media/screenshots/fe8/fe853aba6cde265c2080787111d4b993.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Absolab"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}