{"id": 76547, "slug": "age-of-magic", "name": "Age Of Magic", "name_original": "Age Of Magic", "description": "Age of Magic is a new mobile turn-based fantasy RPG about legions of epic heroes fighting on the remnants of an ancient magical world.<br/><br/>Welcome to the era of mages, warriors and dragons! Form your own squad of 5 heroes and discover their stories in Campaign mode, defeat other players in unforgettable PvP battles to reach the top of the Arena or Tournament, and prove your skills in the infamous Tomb of Horrors: a grim lair easy to enter, but hard to leave alive!<br/><br/>Collect and level-up legendary heroes to fight fast-paced battles in grand arenas. Take your pick from dozens of character among Kobolds, Elves, Demons, Druids, Changelings, Dragonkin, Ra’Archnes, and more!<br/><br/>Darkness descends upon the ruined remnants of a world floating in the void. Each night another light beam in the sky fades, devoured by the unstoppable demons of the Legion. Yet there is still hope. The Dragon Prophecy foretells of a True Mage that enters the Dark Tower to determine the fate of the universe. Might you be the chosen one?<br/><br/>=Age of Magic GAMEPLAY=<br/>• STORY CAMPAIGNS. Explore the vast Age of Magic world pierced through with the powers of light and darkness. Meet legendary heroes and fight epic battles with terrifying enemies. Follow the story of Roland the True Mage and his quest for the Dark Tower. Step into darkness and meet changeling assassin Sharazar, who will stop at nothing to get what he came for.<br/>• PVP. Build the ultimate party of heroes and challenge other players in the PvP Arena daily. But that’s not all! Prove yourself in the 24-hour Tournament every week. Fight your way to the top to win glory and epic rewards! To the most valiant fighter go the spoils!<br/>• LEGENDARY HEROES. Collect over 60+ epic heroes, level them up and gear them out with powerful weapons and armour, and upgrade their abilities and rarity. Use different strategies and form your dream team of heroes to build the strongest party in the world!<br/>• FAST-PACED BATTLES. Lead your party into quick but tactical turn-based epic battles in grand arenas where the visuals are stunning and every choice counts!<br/>• LOTS OF OTHER MODES. The Tomb of Horrors and Valley of Treasures will test your limits as you battle powerful enemies guarding unique rewards. Join events to face tricky characters with even trickier abilities, and test your strength no matter what the challenge!<br/><br/>Join the community and dive into Age of Magic hero lore: find out who inhabits their world, read their stories, learn more about their classes and factions, and explore how to use items, skills and so much more!<br/><br/>Facebook http://plkt.me/2v7y9<br/>Twitter http://plkt.me/lx0s6<br/>Youtube http://plkt.me/n0lgo<br/>Instagram http://plkt.me/mn5nz<br/>Discord http://plkt.me/c91s4<br/><br/>Travel through the era of mages, warriors and dragons! Dive into a fantasy world with turn-based battles and role-playing elements! Explore exciting stories, collect all the magic heroes, fight epic bosses, and dominate in the PvP Arena!<br/>Adventure is calling!", "metacritic": null, "released": "2018-04-29", "tba": false, "updated": "2019-07-31T03:10:30", "background_image": "https://media.rawg.io/media/screenshots/fe3/fe3cc3d168cabed94e8aad8ba9712d33.jpg", "website": "https://playkot.com/game/aom", "rating": 3.86, "rating_top": 5, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 430, "game_series_count": 0, "reviews_count": 7, "platforms": ["Android", "iOS"], "developers": ["Playkot"], "genres": ["RPG", "Strategy"], "publishers": ["Playkot"], "esrb_rating": "Teen"}