{"id": 7654, "slug": "defenders-2-tower-defense-battle-of-the-frontiers", "name": "Defenders 2: Tower Defense battle of the frontiers", "name_original": "Defenders 2: Tower Defense battle of the frontiers", "description": "THE SEQUEL TO THE AWARD-WINNING TOWER DEFENSE GAME OF THE YEAR<br/><br/>Meet the latest game in the legendary Prime Word: Defenders series, a unique combination of the Tower Defense and Collectible Card Game genres with more than 5 million players around the globe!<br/><br/>Enter a mysterious land stricken by a vast cataclysm and now thriving with powerful artifacts and immense treasures guarded by furious monsters. Build up your defenses and brace for the assault!<br/><br/>KEY FEATURES:<br/><br/>- Collect all 40 unique towers and 20 deadly spells!<br/>- Customize your collection with Runes to create the ultimate defense!<br/>- Use them to crush Underground, Intelligent, Swarming, Exploding, Phantom, Corpse-eating, and 20 other monster types and 29 unique bosses!<br/>- Fight with other players to pump up your towers into monster-slaughtering war machines!<br/>- Used to good weather? Well then, can your defenses survive night levels, tornadoes, and meteor storms?!<br/><br/>Awesome 3D graphics, immersive environments, Totems, Anomalies, Hunts, Raids, Assaults, and the rule-them-all Hard Mode button! Try the game now and join the struggle for Prime!<br/>Join us on Facebook at https://www.facebook.com/PrimeWorldDefenders<br/><br/>Recommended devices: iPhone 5 &amp; higher, iPad 3 and iPad mini 2 &amp; higher, iPad Pro.<br/><br/>Note: A network connection is required to play", "metacritic": null, "released": "2016-01-06", "tba": false, "updated": "2019-10-22T14:31:49", "background_image": "https://media.rawg.io/media/screenshots/346/346db37be21a86ecd380c31a5bef9649.jpeg", "website": "http://en.nival.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nival Interactive"], "genres": ["Strategy", "Card"], "publishers": ["Nival"], "esrb_rating": "Teen"}