{"id": 765421, "slug": "janitor-bleeds-bonus-stage-publishing", "name": "JANITOR BLEEDS (Bonus Stage Publishing)", "name_original": "JANITOR BLEEDS (Bonus Stage Publishing)", "description": "<p>JANITOR BLEEDS is a retro-inspired horror game set in an old arcade which you'll find in the dark forest after a car crash. Someone has recently been there, and you try desperately to look for help. A mysterious arcade machine called JANITOR pulls you to play itself, releasing a horrible force upon you.<br/><br/>The only way to survive is to go deeper into the arcade and keep playing JANITOR, but the further you go, the more the events of the arcade game start to influence the real world. When your eyes are glued to the screen, who knows what is happening right behind your back?<br/><br/><br/></p>\r\nFeatures\r\n<ul><li><strong>Explore a mysterious arcade:</strong> The dark corners and hallways hide many secrets. Collect coins and items to progress in the game and most importantly, keep yourself alive. Immerse yourself in the atmosphere of an amusement arcade from the 90s, abandoned long ago.<br/>\n</li><li><strong>Cursed arcade cabinet</strong>: Playing the coin-hungry machine affects more than it seems. Solve puzzles and open paths in both the arcade game and the real world to progress in the game. Just remember; the evil within the machine won't make things easy.<br/>\n</li><li><strong>Retro-inspired:</strong> The game is inspired by the video games of the 90s. The game hasn't been made to look like a carbon copy; instead, it has been inspired by the visual style of that nostalgic era of gaming and has brought it to the modern standards.\r\n</li></ul>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-08T08:58:50", "background_image": "https://media.rawg.io/media/screenshots/49b/49b1b9401b4241bf664ed007f6b37ed3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bonus Stage Publishing"], "genres": [], "publishers": [], "esrb_rating": null}