{"id": 765589, "slug": "shuv-it", "name": "Shuv-It", "name_original": "Shuv-It", "description": "<p>Made as a week-long solo game jam, Shuv-It is a minimalist puzzle game for the Playdate where you must collect all of the coins and reach the exit within a set move limit. Each maze has a set of tiles that will restrict your directional movement; at your disposal are switch boxes, which will allow you to control these tiles in unique ways.</p>\n<p>Think carefully about which moves to make and in what order—not every path leads to where you want to be, and opening some paths may close off others.\r\n</p>\n<p>Designed and developed by 💁‍♀️Audrey Gu using 🕹Playdate Pulp!</p>\n<p>Retrospective devlogs about the project are forthcoming—stay tuned ^^<br/></p>\n<p>\n</p>\n<p><strong>Features</strong>\n</p>\n<p>\n</p>\n<ul><li>🥺 Hypnotic rotating coins</li><li>✅ Working level select</li><li>👀 3 unique tile types</li><li>🤯 10 levels, including a bonus challenge stage!</li></ul>\n<p>\n</p>\n<p><strong>How to Play</strong>\n</p>\n<p>\n</p>\n<p>If you have your hands on a Playdate (lucky!), unzip and install the .PDX file. To play in a web browser, create a Pulp account from the main page, import the JSON source, and press play.\r\n</p>\n<p>\n</p>\n<p><strong>Known Issues</strong>\n</p>\n<p>\n</p>\n\n<p>\n</p>\n<p>These are issues that I ran into during development and play testing but didn’t have quite enough time to address by the end of the week. I may return and see if I can address them sometime in the future, but they’re documented here for now! Some of them are kind of funny, so you might want to discover them yourself first 🙂</p>\n<ul><li>Collision logic has not been implemented for directional tiles when pointing toward a wall rather than an open path. In some cases, you can actually break out of the level. I’m coming for you, A Way Out!</li><li>The only way to reset the level is to exhaust the total move counter. On later levels, this can get a bit tedious.<ul><li>In future iterations, I’d like to implement a restart function—as well as the ability to move back and forward step-wise through your moves using the crank (wouldn’t that be cool???). That would likely require more programming oomph than PulpScript is designed for though.</li></ul></li><li>Level states will sometimes reset incorrectly under certain conditions. PulpScript unfortunately lacks support for arrays, and I was not able to find a good alternative for every scenario in the intervening time.</li></ul>\n<p>\n</p>\n<p><strong>Acknowledgements</strong>\n</p>\n<p>\n</p>\n<p>SquidGodDev’s adventure game tutorial and example game helped me get to grips with updating game objects in the main game script; my implementation is based directly on his.\r\n</p>\n<p>Thank you to Tadeas Nemec for playtesting and providing keen, insightful feedback on both the game design and the technical implementation. Our discussions motivated me to design the final bonus level, which is probably the level I'm most proud of—and the one that makes the best use of all of the mechanics in the game.\r\n</p>\n<p>Thank you to Donna Xia, Tomo Kihara, and Weiwei Xu for their support and enthusiasm, and to Panic for making a rad handheld game console!</p>", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-04-08T10:10:01", "background_image": "https://media.rawg.io/media/screenshots/edf/edf92f1b09f81c321a9d405776e5c2d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["theinfinitestar"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}