{"id": 765596, "slug": "low-memory", "name": "Low memory", "name_original": "Low memory", "description": "<p>Présentation :</p><p>Je suis amateur dans la création de jeu vidéo depuis début 2021. Le seul moteur de jeu que j'ai utilisé jusqu'à présent est la Pico-8, une console virtuelle très pratique pour créer et partager des jeux vidéos en 8 bits.</p><p><strong>Mon idée :</strong></p><p>Au début j'avais en tête de faire un shoot' em up car c'est un genre du jeu vidéo dont je maîtrise plutôt bien la création. Mais comme les GameJam sont faites pour s'améliorer, j'ai finalement décider de faire un jeu dans lequel le joueur se déplace case par case au pixel (comme dans les premiers jeux pokémon) et dont le gameplay tourne autour d'une boîte de dialogue (ce que je n'avais jamais codé avant).</p><p><strong>Ce qui s'est bien passé pendant le challenge :</strong></p><p>Grâce à la Pico-8, je n'ai eu aucune difficulté pour créer les sprites, la map, et les (2) bruitages de mon jeu. Pour ce qui est du code, je n'ai eu aucun problème pour coder la base du déplacement case par case (sans que ça ne soit au pixel) et les collisions avec les éléments du décor. Concernant la gestion du temps, malgré le fait que je fasse des études supérieures, j'ai eu le temps de finir le jeu dans les temps.</p><p><strong>Ce qui s'est mal passé pendant le challenge :</strong></p><p>J'ai eu un peu de difficulté à comprendre comment faire un déplacement case par case au pixel. Mais finalement, ce qui aura été le plus dur à gérer, c'était la boîte de dialogue. D'ailleurs, je ne suis pas satisfait du résultat, car cette boîte de dialogue apparaît au début du déplacement du joueur, et non pas à la fin. Pour finir, je n'ai pas mis de musique car j'ai toujours eu du mal à en faire sur la Pico-8.</p><p><strong>Ce que j'ai appris durant ce challenge :</strong></p><p>Comme vous l'aurez compris, j'ai appris à coder un déplacement case par case au pixel et à gérer des boîtes de dialogue, bien que ça m'a énervé durant toute une après-midi à trouver, en vain, une solution pour faire apparaître au bon moment la boîte de dialogue.</p>", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-04-08T10:12:58", "background_image": "https://media.rawg.io/media/screenshots/860/86008ae406de03c2163d013ed8eabf43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nozywolf"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}