{"id": 76569, "slug": "off-road-kings", "name": "Off-Road Kings", "name_original": "Off-Road Kings", "description": "Offroad Kings is the most realistic offroad game for mobile phones. The vehicles in the game are based on real physics, no arcade simulations.<br/><br/>You can choose various vehicles from 6 different vehicle classes now: Trucks (SUVs and pickups), ATVs (quads), SxS, Rock Crawlers, Muscle Cars and Semi Trucks. There are 5 different maps where you can drive your vehicles - mountain woods, desert, snow mountains, rock park and stunt park.<br/><br/><br/>Vehicle Customization Features<br/>-----<br/>* Body mods - front &amp; rear bumpers, cages, roof lights, running boards, horns, winch, fenders etc.<br/>* Paint customizations + Wrap decals<br/>* Various rim style &amp; tire style selections<br/>* Tinted windows<br/><br/><br/>Vehicle Suspension Features<br/>-----<br/>* Change axle types on your vehicles<br/>* 5 different suspensions - Solid standard, Solid master, Independent standard, Champion independenet and I-Beam<br/>* Tune suspensions - choose your axle width, damping, travel, stiffness, rear steering, axle offset, shock size<br/>* Tune tires and rims - set tire width, tire radius and rim size<br/>* Test your rigs - test vehicles on ramps and terrains<br/><br/><br/>Upgrade Features<br/>-----<br/>* Upgrade your vehicles<br/>* Power upgrades<br/>* Tire grip<br/>* Reduce vehicle weight<br/>* Install snow tracks on all vehicles - ATVs, Trucks, Crawlers, SxS - you can switch between tracks and wheels<br/>* Install diesel to your trucks - you can switch between diesel and petrol<br/><br/><br/>Trailers<br/>-----<br/>* Choose different trailers<br/>* Choose different cargo for each trailer<br/><br/><br/>Different playing modes<br/>-----<br/>* Day &amp; night modes - do you prefer driving during the night? No problem, just select your mode<br/>* Play singleplayer modes<br/>* Or play multiplayer modes<br/><br/><br/>Are you ready to start exploring huge maps and drive around with your tuned and customized trucks? Enjoy driving through mud and water, drift on snow and ice. There are no limits in this game. No gas meters, no damage. Just pure offroad driving experience. Climb the hills, climb the rocks and conquer all maps.<br/><br/>In-App membership subscription:<br/>Offroad Kings Membership subscription is a 30-day (monthly) subscription. Weekly VIP Access subscription price is $12.99 after 3-day free trial which unlocks any 4 vehicles, removes all ads, unlocks all maps and provides 200 gold on a daily basis. Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged $4.99 for renewal within 24-hours prior to the end of the current period. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/>Privacy policy: http://labexception.com/policy.html<br/>Terms of service: http://labexception.com/terms.html", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-07-29T22:00:39", "background_image": "https://media.rawg.io/media/screenshots/667/6676a46cc2305004acca3feb241e4cea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Media Bit"], "genres": ["Simulation", "Racing"], "publishers": ["Media Bit"], "esrb_rating": null}