{"id": 765633, "slug": "tonikk-tycoon", "name": "Tonikk Tycoon", "name_original": "Tonikk Tycoon", "description": "This game is currently getting a tutorial built to help direct the player, in the current state you may feel lost, so watch a few gameplay videos to get a grasp for now.<br/><br/>Tonikk Tycoon[/b][/b] is an open world, money making simulator. You can work at the supermarket as a cashier or stock the shelves, or you can work at the restaurant and be a fry cook, a grill master, a food plater, and a server! You use the money you make at the jobs to buy things like cars, homes, and furniture. You may also invest that money instead to make more money, at places like, the casino where you can gamble away your thousands in hopes to make millions, or build homes and auction them off, or buy real estate to bring you cashflow. But where the real money comes in, is at the tycoons, there are four tycoons right now, with many more to come, you have an oil tycoon, where you can buy land and build massive oil rigs and storage for the oil that they produce, there is a train that runs through the city and every time it comes by, it sells all of the oil that is in your storage, however the train can only sell so much, so you can upgrade the train to sell more at a time! There is a money factory that you can purchase and upgrade machines that print cash, forge gold, and crush diamonds, that all go onto a conveyor belt, into your very own money truck, that, to sell you products that you have produced, you must drive the truck to the vault which is located at the other side of town, next to the bank where you can get loans. You also have a simple laundry tycoon, this tycoon allows you to purchase the property and purchase the individual machines inside, to create cashflow! You then have the car tycoon, where you can either, buy cars from the auction house or dealership, or steal cars, bring them to the body shop and change their appearance, then sell them in your own lot! Another way you can make money in Tonikk Tycoon is by doing a bit of crime, in this game you can rob both the bank and the jewelry store, but watch out for the cameras because one slip up will have you battling a horde of the police, another crime job is you can sell product in the ghetto, however with great returns comes great risk, sometimes you get ratted on and a police officer will pop out of nowhere and want your career in business ended today! All of this is ran on the clock so you are being timed during each run, when ever you start a new game, you get a bit of customization, like respawning, the amount of cars that randomly spawn on the road, if there is cops, if there is a helicopter that will shoot you from the sky if you have enough of cops or if you steal a car, you can choose at how much money you need for the timer to stop, you can also choose how much money and cashflow you start with. Also with customization, you can change the weather cycle, this includes the time of day, the speed of the day, the current weather and the speed of the weather, as well as the chance in which it rains. And finally to conclude this overview of Tonikk Tycoon, you may wonder, \"what do I do with all of the money I made?\" WELL IM GLAD YOU ASKED, you can buy cars and modify them to whatever you like, you can also race them in a timed trial, I would like to note that you can have as many cars out in the world as you want, when you load the open world level they will spawn right where you left them. Now another thing you can do with your hard earned cash is buy homes, as of making this overview we have 10 homes that you can buy paint, and decorate with furniture that you can buy at the furniture store! with loads of customization I assure you, that you can and will be able to make the home of your dreams.", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-04-15T04:59:30", "background_image": "https://media.rawg.io/media/screenshots/ad4/ad47307d75952f81ccfa4ec9cc72143d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cybertonikk Studio", "Devin Carlson"], "genres": ["Action", "Strategy", "Simulation", "Racing", "Casual", "Indie"], "publishers": ["Cybertonikk Studio"], "esrb_rating": null}