{"id": 765690, "slug": "sleep-walker-amytribop", "name": "Sleep Walker (AmyTriBop)", "name_original": "Sleep Walker (AmyTriBop)", "description": "<p>This game was created by Aj Osborn, Amy Bobb, and Dorothy Akpovwa</p>\n<p>Welcome to Sleep Walker, a 2D platformer in which the player is a sleepwalker trying to navigate through a nightmare. Battle bears and coat racks! Navigate through your nightmares and kill the enemies in order to reach the bed and get back to sound sleeping.</p>\n<p>Our assignment was filled with a few ups and downs but at the end of the day, our team was able to solve them. One challenge we faced in this assignment was getting GitHub to work. We realized that we had issues with our .gitignore file and also transferring scenes from one computer to another. It was a struggle trying to collaborate on unity through GitHub because members of the team were not well versed with GitHub.  To overcome this challenge, the team reached out to the TA and the professor and worked with them to come up with solutions as to why the game was not running the way it was intended.   This project taught us more about the importance of division of labor and how to effectively communicate with the team. A huge success for us was when the game started running properly and we were able to fix the bugs in our program.</p>\n<p>Moving forward, we would like to add aminations to the enemies as well as fix the code to have them move around on the platforms. We'd also like to add another enemy, such as a book that can fly towards the player. Since this enemy will not be level, allowing the player to shoot from different angles might be beneficial to implement as well. Editing the layout and the physics will also allow for a smoother gameplay.  Another addition we would like to make is working with the tilemapping. This is purely for the aesthetics of the game but will make it feel more interactive for the player. For the final level we would like to implement a boss, the one in control of all the objects becoming enemies, so the player can go back to sleep peacefully.</p>\n<p>During beta testing, player feedback included working with the physics, since the player seemed to be floating through the worlds. One level was scaled significantly larger than the others (Level 4) which needed to be fixed in order to make the jumping mirror a platformer game . The box colliders on the enemies were too large and would cause the player to lose lives when it visually was not in contact with the enemy, which lead to frustrations for the players. Once they collided with the enemy it would start the level over from the beginning, which lead to confusion as to why they kept dying with no contact. </p>", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-04-08T10:53:52", "background_image": "https://media.rawg.io/media/screenshots/623/623ad1cc7d175a7089d43527b9c0addb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AmyTriBop"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}