{"id": 765933, "slug": "and-then-you-fall-ld50-jam-entry", "name": "And Then You Fall (LD50 Jam Entry)", "name_original": "And Then You Fall (LD50 Jam Entry)", "description": "<p>Content Warning: Illness &amp; Viruses</p>\n<p>(Patched as of 4/5/2022, the majority of issues should be fixed) Protytype: Maybe horribly broken due to submission close to deadline. Made a lot of changes last minute and couldn't test them.<br/></p>\n<p>And Then You Fall is a game about a cashier of a faceless corporation just trying to do their job. However, they had just gotten back after getting sick, and now struggle to do their daily tasks. This is a game about delaying the inevitable, the inevitable realization that the life you had before is gone, and now you must forge a new path, or struggle in your old, dead life forever.<br/><br/>This was an entry for Ludum Dare Jam 50. my first ever Game Jam I completed on time. I intend to update this project in the future and make a full release. There may be bugs, there are a few known game breaking bugs. If the contest allows for bug fixes I will push them out.<br/><br/>-- <br/><br/>Patch 1<br/><br/></p><p>Fixed an issue where the game would hang on game over</p>\n<p>Fixed a crash related to global.new_day being undeclared.</p>\n<p>Patched an incredibly cursed crash where obj_level's sprite would become randomly undefined only present in the compiled version. Patch was also applied to other empty sprite objects too like obj_master and obj_audio_master</p>\n<p>Patched a bug where get_morale_face() and get_grade() would sometimes return undefined values.</p>\n<p>Patched several issues where ds_list_find would return undefined values in certain cases</p>\n<p>Patched an issue where money would be negative from unchecked overspending<br/>--<br/></p><br/>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T12:30:07", "background_image": "https://media.rawg.io/media/screenshots/ca6/ca64c631aa1fcfdb7fe2d779f8b9b817.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZackTheGreat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}