{"id": 765969, "slug": "the-prairie-house", "name": "The Prairie House", "name_original": "The Prairie House", "description": "<p>A student finishes their prairie field work but has to spend the night alone at an old house. Follow the story from dark evening to mysterious morning and get all the achievements to think up your best theory about what happened.<br/><br/></p>\n\n<p>This game is a classic parser style text adventure. Type one, two, or more word commands (usually two words) and press Enter.</p>\n<p>Here is a list of some basic commands:</p>\n<ul><li>Travel: North (N), South (S), East (E), West (W), Up (U), Down (D), Enter, Exit</li><li>Actions: \"take bin\", \"pick flower\", \"drive\", \"read\", \"look under rug\"...</li><li>Other useful commands: \"I\" (inventory), \"R\" (clear/refresh the screen), \"quit\" to restart, \"SaveF\" / \"LoadF\" to save and load the game, and \"choose theme\" to change the theme (font and palette)!</li></ul>\n<p>If you need help, an external map and solution guide can be downloaded along with the game.<br/><br/></p>\n\nThis game was created within about a month - March 2021 - for the Spring Thing 2022 Jam and a local Winnipeg Slow Jam March 2022. My initial motivation was to make a pixel art horror game with switchable palettes - inspired by World of Horror by panstasz and The Horror of Salazar House by Ignacio Maldonado (Maldo19, through Torture Star Video). Local artist and musician Kelsen Hadder (Hadd_) was the perfect partner to make the music and art for this game a reality.<br/>\n<p>At first I wasn't sure what the story would be, but then I drew inspiration from past scientific field work on the tall grass prairie in Manitoba, and some creepy experiences staying at field houses (especially a night of \"is there someone in that locked room?\"). I supplemented my knowledge of the local flora with historical research about Ukrainian Canadians who live in the area and the Anishinaabe/Ojibwe presence on the land prior to settlement.</p>\n<p>Finally I steeped myself in folk horror film theory and classic English ghost stories. At the time of making this game, I had an obsession with the beautiful open mystery of Picnic at Hanging Rock (1975) (especially the alternate ending) and an earlier viewing of the Canadian horror Deathdream (1974) (again, especially the emotional alternate ending).<br/><br/>Hopefully I was able to convey at least some of my enthusiasm for all of the above into this game!<br/><br/></p>\n\n<p>Written by : Chris Hay aka Eldritch Renaissance Cake</p>\n<p>Art and Music by : Kelsen Hadder (@kelsenhadder / Hadd_)</p>\n<p>Engine : Adventuron Version 1.0.0 Beta 75f by Chris Ainsley<br/></p>\n<p>Fonts :</p>\n<p>Most are by DamienG - homestead (Prairie theme), byteletter (Gothic theme), zx times (Canada theme), zx sierra quest (90s theme), panda (Nature theme), cushion (Sunrise theme); One font by Brandon Schoepf of Tepid Monkey Fonts - November (Spoohouse theme)</p>\n<p>Palettes :</p>\n<p>Mostly by Chris Hay / Eldritch Renaissance Cake (Prairie, Gothic, Canada, Nature); 90s was modified and built on from panstasz' World of Horror palette \"Neon Slasher\"; Sunrise is by SoundsDotZip (modified slightly); Spoohouse is by Hadd_ (a modified version of the palette used in their game, Spoohouse). <br/></p>\n<p>Special thanks to Garry Francis for playtesting an earlier version, and to the Adventuron Discord community for answering to my coding questions and providing moral support!<br/><br/></p>\n\n<p>Support the artist and composer : buy the soundtrack on Bandcamp or stream it on Spotify</p>\n\n\n<p>Support the writer - buy an album from Chris' Bandcamp.</p>\n<p>This game features Ukrainian-Canadian history. If you are able, consider making a donation to support Ukraine in this dark time. For example, the Canada-Ukraine Foundation is a reputable charity collecting funds for humanitarian aid.<br/></p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T12:49:01", "background_image": "https://media.rawg.io/media/screenshots/872/8721c431a76e58f1f4151d2e9e5e8448.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "macOS", "PC"], "developers": ["EldritchRenaissanceCake"], "genres": [], "publishers": [], "esrb_rating": null}