{"id": 76601, "slug": "helicopter-pilot-flight-simulator-3d", "name": "Helicopter Pilot Flight Simulator 3D", "name_original": "Helicopter Pilot Flight Simulator 3D", "description": "Helicopter Pilot Flight Simulator 3D, is a new exciting helicopter flying sim game. Take control of a super realistic Chinook army helicopter and go on top secret flying missions around the tropical islands ! ALSO CHECKOUT DRIVE JEEP MODE AND SANDBOX MODE !<br/><br/>Highly detailed 3D Chinook Helicopter <br/>30 Unique Chinook Helicopter Flying Missions!<br/>New and Exciting Open World Sandbox Game Mode and Army Jeep Driving Mode! Do Whatever You Want, Wherever You Want!<br/><br/><br/>Helicopter Pilot Flight Simulator 3D offers 30 exciting top secret missions where you, the pilot, will take control of an army Helicopter and carry out tasks that will involve rescuing people, collecting objects, shooting missiles at enemies, knocking over obstacles with wrecking balls, using super-powerful magnets to collect hazards, and much more!<br/><br/><br/>Early on in Helicopter Pilot Flight Simulator 3D there are easy missions, like learning to fly the army Chinook helicopter and getting used to controlling the helicopter.<br/>As you progress through this flight simulation missions will get harder, testing your helicopter flying skills by unlocking cool new gadgets and toys to help you complete the missions, like magnets and a destructive wrecking ball!<br/>When you complete all the levels in Helicopter Pilot Flight Simulator 3D, you will truly become an amazing army helicopter pilot!<br/><br/>Are you looking to test your flying skills and have an amazing time flying around in a realistic army helicopter? Well then, buckle up and learn to fly the Chinook army Helicopter in Helicopter Pilot Flight Simulator 3D!", "metacritic": null, "released": "2016-05-20", "tba": false, "updated": "2019-10-22T14:06:27", "background_image": "https://media.rawg.io/media/screenshots/564/56480d45c08f69f28c66508bb07a1b93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["i6 media"], "genres": ["Action", "Simulation"], "publishers": ["i6 media"], "esrb_rating": "Everyone 10+"}