{"id": 766042, "slug": "last-target-zombie-games-3d", "name": "Last Target - Zombie Games 3D", "name_original": "Last Target - Zombie Games 3D", "description": "<p>In this zombie games security service delta team enters bolan city when the zombie apocalypse happens, where they must find Dr. William Hunk the head of underground laboratory in the Bolan City hospital.Their mission is to assist the Alpha team in saving Dr. William Hunk from zombies beast and handing over his zombie antidote research to the military. On their way to Bolan's lab, they find zombies beast and dead evils. When they reach Bolan’s lab, the doctor is alive, and he has the samples.They soon find that one of the doctors survived the zombie attack and infected himself with the virus.The doctor creature proceeds to kill off most of the alpha team before disappearing. Best zombie survival games.<br/>The battle has started and we are in the war of the dead. Army of the dead has been raised and walking in the streets , it becomes evident that the virus has leaked citywide, and people are beginning to transform into flesh-hungry zombies. The Delta team and these commandos are the last hope for humanity who may find the antidote and save the world.<br/>All the delta team has been killed by the walking zombies monsters in the streets but one of the soldiers named commander Ervin survived. He is the best commando Who has a mission to complete and where you will enjoy killing the living dead.<br/><br/>Ready for the dead shooting sniper assault. Fight, target, kill and shoot-out as a zombie hunter in this zombie attack action zombie apocalypse FPS. Monster and zombie attack and walk in the city and you are the only one soldier left to survive and to kill each one of the mad zombies .It is an offline zombie shooting games.You will shoot-out every living dead in our zombie games. You will use the most powerful guns and weapons to be a zombies killing machine.<br/>Kill zombies with pistols, sniper rifles, miniguns, shotguns, assault rifles,smg and many more and enjoy the best action of zombie shooting games.It is the age of zombie apocalypse.<br/>Unlock zombies killer weapons and Kill hordes of zombies in this zombie survival games for that you need to be best zombie shooter.</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T13:24:05", "background_image": "https://media.rawg.io/media/screenshots/93f/93f1d8b4a12b96ca613056bb98590738.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Metal Heart Games"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}