{"id": 76600, "slug": "trials-of-heroes", "name": "Trials of Heroes", "name_original": "Trials of Heroes", "description": "Tired of stereotyped gameplay? No time to battle every minute but in badly need of material to upgrade your heroes?<br/>Come and try Trials of Heroes! At any time and at any place, go deep into steppes, marshes, labyrinths and other dungeons with your heroes while enjoying never-ending battles. Even if you are offline for a break, your heroes will still be fighting for you!<br/><br/>GAME FEATURES:<br/><br/>1. Most Relaxing IDLE Style<br/>Never bother to wait online but set up a team and choose a map, then all the wealth of this land is at your fingertips! Coins, material, equipment and all, offline auto-battle provides you with everything you need to strengthen your heroes. Just as simple as that!<br/><br/>2. Beat Powerful Monsters with Strategies<br/>Adjust your team, cooperate different skills, choose proper equipment and try more strategies. Even a swap between front and back lines may help immensely!<br/><br/>3. More than IDLE Style<br/>Climb up the Dark Tower for nonstop challenges, complete quests from various heroes in Tavern, launch an all-out attack in the Burning Crusade, forge legendary equipment for your heroes, defeat Dark Forest Bosses for special rewards, and enter various Raids for extra gains! More exciting contents are waiting for you to discover!<br/><br/>4. Fight with Your Allies<br/>Upgrade Guild Skills in Academy for bonuses, get rewards from Mine orders, win increasing rewards by taking down numerous guild bosses and participate in a week-long Guild Campaign with guild members. Make it to Finals for glory!<br/><br/>5. Show Your Skills in Arena<br/>Unique Championships and Elite Trials are offered in Arena. Array your team wisely, defeat those from all over the world and always aim to be the first!<br/><br/>6. Over 100 Cool Heroes<br/>After their star-rank being upgraded, heroes will get stronger attributes and skill effects. Their appearances change as well and is sure to amaze you. Try to collect every hero in the gallery!<br/><br/>Summon your hero now and let’s begin an epic adventure in this mysterious yet unknown land!", "metacritic": null, "released": "2018-06-07", "tba": false, "updated": "2019-10-22T14:06:23", "background_image": "https://media.rawg.io/media/screenshots/0e3/0e3c0ff0830b343b7ba69eb1a1749b44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 481, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "Android"], "developers": ["Mingming Gong", "Jupiter Entertainment"], "genres": ["RPG", "Strategy"], "publishers": ["Mingming Gong"], "esrb_rating": null}