{"id": 76616, "slug": "beer-smasher", "name": "Beer Smasher", "name_original": "Beer Smasher", "description": "!!! Grab Your Beer for FREE &amp; Enjoy!!!  <br/><br/>What customers reviewed about Beer Smasher for previous version? <br/><br/>“Good stress killer! Challenging, one more time aspect we all love. Good physics and satisfying sound effects also! Recommended! “ <br/>“You guys are crazy, physic TAMERS!! Strongly recommend!!!! “ <br/>“The game is so fun! Great game, great graphics, great physics, great controls...........GREAT!“ <br/><br/>--- From mid of June 2013 (Release Date) Beer Shooter already reached thousands of downloads and five stars asset with huge number of satisfied customers! This impressive success we want to share with you and say that this was JUST A BEGINNING --- <br/>Game became TOTALLY WORTH TO DOWNLOAD ASAP with its new features!!!!!<br/><br/>In updated Beer Smasher you’ll find:<br/><br/>* Cooler design<br/>* 12 new levels<br/>* Game Center &amp; Facebook full integration with BRAG functionality to challenge friends!<br/>* Unique and realistic physic engine ever! <br/>* Different objects to unlock and shoot with! <br/>* Rising bonus percent by completing different objectives! <br/>* Wallpapers to unlock for you device! <br/>* Entertaining explosions and much more!!! <br/><br/>Download Beer Smasher, engage yourself to break beer glasses and enjoy crashes with high quality visual and sound effects! <br/>Break as many glasses as you can with different objects which you have to unlock such are: stone ball, brick, skull and even toilet seat :). Find out various types of pyramids and piles and raze of the ground everything on your rear-sight! <br/>By crashing moving targets you’ll feel satisfaction with your sniper skills and astonishment of family members and friends. No word about how addictive is global competition with thousands of already addictive players… <br/><br/>YES!! YOU ARE A REAL SNIPER!!! <br/><br/><br/>!!! Absolutely MUST HAVE GAME for your games collection !!!<br/><br/>GET BEER SMASHER NOW - amazing 3D physic game and you’ll be definitely playing it nonstop, until your battery will be alive!", "metacritic": null, "released": "2012-06-04", "tba": false, "updated": "2019-10-22T14:06:22", "background_image": "https://media.rawg.io/media/screenshots/c1f/c1f293d986fe19dd8abec71ab15388c4_uM6dJOa.jpg", "website": "http://www.lemondo.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lemondo Games"], "genres": ["Action", "Arcade"], "publishers": ["Lemondo Games"], "esrb_rating": "Teen"}