{"id": 766288, "slug": "asleep-walking-demo-lvl1-vr-vive", "name": "Asleep Walking - demo - lvl1 - VR Vive", "name_original": "Asleep Walking - demo - lvl1 - VR Vive", "description": "<p><strong>Made with the Original Vive.  Hold the big D Circle Pad and swing your arms to move.</strong></p><p>Thanks for checking this out.  </p><p>This is my first VR project demo, I have 4 other levels in varying stages of completeness, with about 2 nearly done.  This first level has some things purposefully removed from it that I want to be a surprise for the final release.   I am hoping to get some feedback / support to complete the bigger vision for a full-length adventure game.  Maybe someone would like to join the team?<br/></p>\n<p>Essentially the story is about a disgruntled teenage boy, who dreams up all sorts of wild things...  It is adult and angel-demon themed with youthful kid stuff sprinkled throughout.   It is meant to be more of an atmospheric story and exploratory experience.  Rewarding those who explore, but essentially with a metaphorical ticking clock in the background to keep the story moving.  Without giving much away, there is kind of a \"escape the room\" element to progress as well, so you need to pay attention.</p><p>The music was made by me for the game, a lot of the content is modified from the Unreal marketplace.  A lot of the art/posters are original, but some is also creative commons.  A full list of the sources will be released with the full game release.</p><p>Want to help support the project?  Want to test it on your headset and controllers?  Dream up a level?  Want to help tighten things up with your Unreal skills to polish the experience?  Maybe a donation to keep things moving?</p><p>Want to help with a kickstarter?   I don't know, I just know I would love to collab on this and see what a small team could manifest.   Please contact me if interested. :)</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T15:17:23", "background_image": "https://media.rawg.io/media/screenshots/4f8/4f81d53e526b49f680d3c131247b47aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["atmastudios"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}