{"id": 76621, "slug": "airline-commander", "name": "Airline Commander", "name_original": "Airline Commander", "description": "Conquer routes worldwide, fly amid real traffic and build your fleet!<br/>Create the best airline in the world and manage dozens of airliners.<br/>Fly from the main hubs to open thousands of routes towards all the major airports of the world.<br/>Earn from contracts, completing takeoffs, landings, taxiing and exciting challenges in hundreds of airports with realistic runways and high definition regions.<br/>Increase your automatic earnings thanks to the routes you open and conquer the sky!<br/><br/>There are hundreds of licenses available to improve your skills. Learn how to use all airplanes controls, and to cope with faults, emergencies and unfavorable weather conditions. The more you improve the more you earn with your airline; build the definitive fleet amid real-time air traffic!<br/><br/>Features:<br/>- Dozens of airliners to build your definitive fleet: turbine, reaction, single deck or double deck<br/>- Dozens of main hubs with taxiways to open thousands of routes towards all the major airports of the world<br/>- Hundreds of realistic airports and runways. Regions and airports with high definition satellite images, maps and worldwide navigation<br/>- Thousands of different situations to handle during takeoff, landing, and all taxiing and airborne phases<br/>- Real-time air traffic, with real airlines, on the ground and in flight<br/>- Simplified flight system with navigation help or flight simulation for advanced users<br/>- Realistic SID/STAR takeoff and landing procedures with pushback system, taxiing and the possibility to dock at the finger with individual display<br/>- Compete against pilots and airlines from all around the world to prove you're the best<br/>- Realistic different times of the day with sun, moon, stars and real-time weather conditions<br/>- Customizable airline livery<br/><br/>Technical details of the flight simulator:<br/>- Control tower communication to manage air traffic and provide assistance<br/>- Takeoffs and landings from basic to advanced and with Instrument Landing System (ILS)<br/>- Primary Flight Display and Navigation Display<br/>- Advanced engine system with startup, faults and fire suppression<br/>- Fuel management with weight balancing, fuel dumping, real consumption, stall, APU and engine pressure<br/>- Autopilot with control of all flight parameters: altitude, speed, heading and vertical speed<br/>- Failure of sensors, instruments, ASM, fuel tanks, landing gear and engines<br/>- Malfunction of flaps, rudder, air brakes and radar<br/>- Hydraulic faults, tire problems, fire on board<br/>- Wind, turbulence and fog with various levels of severity<br/>- Ice and severe frost with ANTI-ICE system<br/>- Weather Radar to manage microbursts and faults caused by lightning<br/><br/>Support:<br/>For problems with the game and suggestions please write to: airlinecommander@rortos.com", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-07-31T00:18:39", "background_image": "https://media.rawg.io/media/screenshots/fca/fca0c2c6eb4a7aae34e544b55b292ac0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 4, "platforms": ["iOS", "Android"], "developers": ["RORTOS"], "genres": ["Action", "Simulation"], "publishers": ["Rortos"], "esrb_rating": null}