{"id": 76648, "slug": "blades-and-rings", "name": "Blades and Rings", "name_original": "Blades and Rings", "description": "3D Fantasy MMOARPG Masterpiece, Blades and Rings<br/><br/>Return to the dream worlds of the middle age<br/><br/>Start your fantastic ring hunting journey!<br/><br/><br/><br/>[Introduction] <br/><br/>Blades and Rings is a medieval fantasy 3D MMORPG mobile game. In this game, players travel to the wondrous homelands of the elves, dwarfs, gnomes, orcs, cyclopses and more in order to collect 27 powerful rings and save the world! Featuring many unique game modes and systems, such as the free equipment system, where equipment is obtainable only via killing monsters. The free trade system, in which players can freely trade items without price restrictions. A powerful and diverse social system, including Emperors and civilians, masters and apprentices, guilds and teams. Plus a balanced and exciting world boss system where bosses can be found across the world map and refresh all day long. <br/><br/><br/><br/>[Game Features]<br/><br/>——New Era, offline auto-combat<br/>Unique auto-combat system design that even offers offline auto-combat will help you to upgrade and kill bosses when you are busy, creating a win-win situation for both work and play.<br/><br/>——Advancement, exclusive customization system<br/>Featuring a fully customization system, in which you can advance as you see fit, outside the constraints of a traditional class system. Acquire your very own exclusive titles, spectacular skills and featured looks. <br/><br/>——Cool mounts, customizable looks<br/>Dozens of cool mounts including tyrannosaurus, skyfyre and griffins are at your service. Customizable equipment and looks will make you stand out of the crowd. <br/><br/>——Trade freely, buy or sell equipment<br/>In the market of this game, you can freely sell any unused or extra equipment obtained from killing bosses or completing quests. None of your resources or time shall be wasted. <br/><br/>——Splendid wings, fierce PvP<br/>PvP is allowed on all maps. You can team up to take on high level players and if you are lucky enough to give the finishing blow, then the ultimate equipment is yours. High drop rates add thrills and excitement.<br/><br/><br/>Follow our Facebook fan-page for more information and keep up to date with all the latest about Blades and Rings. We are looking forward to seeing your comments and messages!<br/><br/>Blades and Rings Facebook: https://www.facebook.com/BNR.37Games/", "metacritic": null, "released": "2016-12-05", "tba": false, "updated": "2019-07-29T21:03:32", "background_image": "https://media.rawg.io/media/screenshots/dd0/dd05c7b201a2c7f42a62794090a3d37d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["37GAMES"], "genres": ["Action", "RPG"], "publishers": ["G-MEI NETWORK TECHNOLOGY CO"], "esrb_rating": "Teen"}