{"id": 766461, "slug": "malpractice-dungeons-and-rockets", "name": "Malpractice (Dungeons And Rockets)", "name_original": "Malpractice (Dungeons And Rockets)", "description": "<p>Someone borrowed money from you; a lot of money. And after a terrible accident, they conveniently got sent to a specific hospital that is known for its unusual methods and low standards. Now you have a contract specifying that you will receive as much money back as possible for as long as your client is alive. Interact with the surroundings to make sure that he will be kept alive for as long as possible!<br/><br/>You can use your mouse to click on interactable entities to fix each and every problem possible, keeping the patient alive! Sometimes, a doctor will come to your aid, but it isn't that much - sadly, free healthcare isn't as good as it should be...<br/><br/>A game made by Alexander \"Alek\" Martins, Gabriel \"Red Yoshi\" Kiesshau, Guilherme \"Chaoseiro\" Maia, Lucas \"Ike\" Emmanuel, Tiago \"Bontah\" Carneiro and Vinicius \"Bottini\" Nipote for the game jam<strong> Ludum Dare 50</strong>, with the<em> Delay the Inevitable</em> theme.</p>\n\n<p>Currently at version 0.9.1 - We fixed a bug with our friend little rat, he loved the game so much he didn't wanted to leave when we asked him to.<br/><br/></p>\n<p>Known bugs:</p>\n<p>Vulture animation duration - Our birb friend is acting too fast, we compromise to add at least 3 seconds of spare time so you bird lovers out there can appreciate the feathery atmosphere without too much urgency.</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T16:35:03", "background_image": "https://media.rawg.io/media/screenshots/467/4672e51cde037d8e947116b49ac7e475.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dungeons And Rockets"], "genres": ["Action"], "publishers": [], "esrb_rating": null}