{"id": 766561, "slug": "the-lars-mission-behind-enemy-vines", "name": "The Lars Mission: Behind Enemy Vines", "name_original": "The Lars Mission: Behind Enemy Vines", "description": "<p><strong>Controls</strong> WASD to move. E to interact. Minigames require keyboard typing, A &amp; D, entering numbers and dragging sliders.<br/></p>\n<p><strong>Objective</strong> Delay the inevitable end to your settlement on Mars as long as you can to board as many researchers as you can onto your rocket ship. Overcooked vibes with hints of Among Us mini games, set in a beautiful sci-fi laboratory.\r\n</p>\n<p><strong>FAQ</strong>: We’ve had people ask, and <strong>YES, our music</strong> was created by our very own developer @Brainoid! I also created the sounds, so please do rate us in the Audio category!\r\n</p>\n<p><strong>Known Issues</strong>: If you get “stuck” on lab equipment, try pressing E again to “disengage” from it.\r\n</p>\n<p><strong>Streaming Our Game?</strong> Unreal games often run poorly in OBS. We recommend adding the game to your scene as a “Game Capture” and checking the “Limit capture framerate” option. Also try checking the VSync option on / off in the game options.</p>\n<p><strong><br/>THE PROBLEM:</strong><br/></p>\n<p>The GROWTH, an invasive species of plant, is expanding rapidly, consuming the planet! A dangerous large growth, known as the MOTHER VINE is destroying everything we’ve ever built. We need to get off this planet, abandoning the planet, leaving our settlements and precious research equipment behind.\r\n</p>\n<p><strong>THE SOLUTION:</strong>\n</p>\n<p>The only way off this planet is via my ROCKET. The trouble is, all the other RESEARCHERS are still at their settlements and need to make their way here. I must delay the inevitable Growth for as long as I can, to allow as many of my fellow researchers as possible to escape with me!\r\n</p>\n<p><strong>REMINDERS:</strong>\n</p>\n<p><strong>The Generator</strong>\n</p>\n<ul><li>Keep the <strong>GENERATOR </strong>fuelled! It powers most of the lab’s equipment.\r\n<ul><li>Remember to fill the <strong>FUEL CAN </strong>at the <strong>FUEL TANK</strong> before refuelling the generator!!\r\n</li></ul></li></ul>\n<p><strong>The Greenhouse</strong>\n</p>\n<ul><li>Keep the <strong>GREENHOUSE </strong>watered to continue growing our medical herbs\r\n<ul><li>Remember to fill the <strong>WATERING CAN </strong>at the <strong>WATER PUMP</strong> before watering the crops!!\r\n</li></ul></li><li>Use the <strong>WATER PUMP</strong> to resupply its water supply\r\n</li><li>CROPS will grow as long as the greenhouse soil isn’t dry\r\n<ul><li>Remember to <strong>HARVEST</strong> fully grown crops to allow new plants to grow.\r\n</li></ul></li><li><strong>HARVESTED CROPS </strong>will be used to produce the <strong>PREFLIGHT BOOSTER SHOT</strong>.\r\n</li></ul>\n<p><strong>The Researchers</strong>\n</p>\n<ul><li>Keep your eyes and ears open for <strong>RESEARCHERS </strong>arriving at the <strong>MAIN DOOR</strong>\n</li><li>Open the <strong>MAIN DOOR</strong> to allow <strong>RESEARCHERS </strong>into the Lab\r\n<ul><li>Remember the Lab needs to re-pressurise for a duration after opening the <strong>MAIN DOOR</strong>\n</li></ul></li><li><strong>RESEARCHERS </strong>will only board the rocket once they’ve had their <strong>PRE-FLIGHT BOOSTER SHOT</strong>\n<ul><li>Remember to <strong>HARVEST CROPS </strong>to produce additional <strong>PREFLIGHT BOOSTER SHOTS</strong>\n</li></ul></li></ul>\n<p><strong>The Growth</strong>\n</p>\n<ul><li>Use the <strong>CHAINSAW </strong>to remove any growth that’s obstructing lab equipment\r\n</li><li>If the <strong>MOTHER VINE</strong> gets to our lab, it’ll destroy the rocket and we’ll be doomed.\r\n</li><li>Delay the <strong>MOTHER VINE </strong>by hitting it regularly with missiles using <strong>MISSILE CONTROL</strong>\n<ul><li>Remember the <strong>SATELLITE </strong>needs to be aligned to use <strong>MISSILE CONTROL</strong>\n</li></ul></li></ul>\n<p><strong>The Rocket</strong>\n</p>\n<ul><li>The <strong>ROCKET</strong> can only launch after <strong>COMPILING THE LAUNCH CODE</strong>\n</li><li>Board to the <strong>ROCKET </strong>when ready to depart\r\n<ul><li>Remember to delay as long as possible - we must <strong>SAVE</strong> as many <strong>RESEARCHERS </strong>as possible!!\r\n</li></ul></li></ul>\n<p><strong>Housekeeping</strong>\n</p>\n<ul><li>Remember to put back the <strong>CHAINSAW</strong>, <strong>FUEL CAN</strong> and <strong>WATERING CAN</strong> back where you found them!\r\n</li></ul>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T17:22:40", "background_image": "https://media.rawg.io/media/screenshots/dc1/dc11b309cca255db144f455c1035c2fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HonestDan"], "genres": [], "publishers": [], "esrb_rating": null}