{"id": 766589, "slug": "holding-on", "name": "Holding On", "name_original": "Holding On", "description": "<p>A short, atmospheric, narrative-focused tower defense game about getting over a one-sided breakup. Made for Ludum Dare 50.<br/></p><p>You've been dumped. With each day that passes, you're contacted by friends and family as you continue hanging on to something you've already lost.<br/><br/>Chatting with your friends on the phone is followed by a wave of enemies -- the thoughts and activities that would have you forget about your ex. Choose between placing defenses and letting go of the relationship that's now behind you.</p>\n<p>Each wave, you may drag and drop a tower onto an empty space to begin building it, onto an unfinished tower to  complete it, or onto a completed tower to  upgrade it. Unfinished towers don't fire at enemies. You can also hover over a tower with your cursor, focusing on it to increase its firing rate.</p>\n<p>Each time you lose a life, you may place additional towers, but the difficulty increases; the themes and topics represented in your thoughts and chats increase with them.</p>\n<p>The game features atmospheric aesthetics, touching topics, and relaxing gameplay for a pleasant playthrough. Ultimately though, the goal is only to let go.</p>\n<p><strong>The game contains themes of grieving and relationships.</strong><br/></p>\n<p>CHANGE LOG</p>\n<p>The original jam version without bug fixes can be found as holding_on_win_original.zip. <br/></p>\n<p>April 5, 2022 <br/></p>\n<ul><li>Adjusted project settings to fix a screen scaling issue in some environments. </li><li>Changed the project window title to the correct one. </li><li>Fixed an issue with an incorrect dialogue box appearing during gameplay.</li><li>Linked an HTML version of the game in download &amp; install instructions</li></ul>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T17:32:54", "background_image": "https://media.rawg.io/media/screenshots/361/361c01edaf10eafab752e2a6086112dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Studio Avanto"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}