{"id": 76653, "slug": "war-and-order", "name": "War and Order", "name_original": "War and Order", "description": "Orc Knights, Elf Sages, Dragon Riders, and other incredible warriors are waiting to fight for your empire! Raise a massive fantasy army for HUGE, spectacularly animated battles! Axes fly, dragons roar, and fireballs sizzle as you clash with enemies from all over the world in real-time. Call on your allies to rush to your aid on horse- and lizard-back. Repay them with your undying loyalty as you take castles, slay ogres, and stake new territory as a tribe! THIS is the game you won’t be able to put it down as your screen lights up with constant new battles, chats, and upgrades!<br/><br/>You must battle to become more powerful than any king in history! But you can’t do it alone. It’s up to you and your allies to unite the fantasy races like never before as you conquer an endless world of empires and imagination.<br/><br/>◆HOMELAND<br/>• Recruit and train over 30 unique soldiers.<br/>• Construct and upgrade tons of buildings for new soldiers, buffs, and resources!<br/>• Research new technology FAST for cutting-edge tactics and weapons!<br/><br/>◆ALLIANCE<br/>• Friend, feud, and chat with players from around the world in real time.<br/>• Help each other build and expand your cities faster.<br/>• Rally together to take down enemies you could never face alone!<br/>• Share and expand territory to enjoy exclusive buildings and bonuses! <br/><br/>◆CONFRONTATION<br/>• Sweep the battlefield in huge real-time PvP matches!<br/>• Build your force to leviathan proportions!<br/>• Engulf other lords' castles as you expand your territory.<br/><br/>◆CONQUEST<br/>• Attack other player's castles to plunder their resources and climb power rankings!<br/>• Vanquish roaming monsters for their treasures, from man-eating Ogres to massive Dragons.<br/><br/>◆EMPIRE<br/>• Take over the Royal City to rule over the realm with unheard of power and privileges!<br/>• Explore unknown lands to find elite resources, ancient ruins, and more surprises!<br/>• Grow your alliance territory for richer rewards and resources! <br/><br/>Follow War and Order on Facebook:<br/>https://www.facebook.com/WarandOrder1/", "metacritic": null, "released": "2016-04-06", "tba": false, "updated": "2019-07-30T19:54:48", "background_image": "https://media.rawg.io/media/screenshots/30c/30c0e89ce96ee7be9e9c02286e2526a7.jpg", "website": "https://www.facebook.com/WarandOrder1", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["CAMEL GAMES", "CamelGames"], "genres": ["Strategy", "Simulation"], "publishers": ["Camel Games"], "esrb_rating": null}