{"id": 766665, "slug": "gods-of-divine-stuff-ragnarok", "name": "Gods of Divine Stuff: RAgnarök", "name_original": "Gods of Divine Stuff: RAgnarök", "description": "<p>\n</p>\n\n<p>Ra is unfazed by funky fan-mail. Until a threatening scroll detailing Ragnarök reaches him, that is. Accompany Ra as he meets new friends and foes and get to the bottom of this Ragnarök debacle in this tower defense with visual novel elements.<br/></p>\n<p>This game was made during Ludum Dare 50. The theme was \"Delay the Inevitable\", and, in our opinion, no genre fits that quite as well as tower defense! If you enjoy the game, please don't forget to vote! If anything else comes off of this project, you're likely to hear about it by following us on Twitter. The downloadable version might perform better on some systems.</p>\n\n\r\nInstructions\r\n\n\r\nThe Basics \r\n<p><strong>Controls</strong>: </p>\n<p>Right-click to interact</p>\n<p>Space, enter, or right-click to progress dialogue</p>\n\n<p>Place deities and subjects to defeat all enemies and win. You can hover over units to see what they do.</p>\n<p>These are the four most important things you'll have to keep track of:</p>\n<p><strong>Deity</strong>: A god type unit. There can only be one of each deity out at once.</p>\n<p><strong>Subject</strong>: A minion type unit. You can have as many subjects as you want.</p>\n<p><strong>Health</strong>: Your parties' health. If it reaches 0, you lose. In the campaign mode, health regens after each map.</p>\n<p><strong>Favor</strong>: The main currency. Favor is used for hiring, firing, and improving units. Enemies give favor when defeated, and clearing a round will give you additional favor.</p>\n\n\r\nPlacing and deleting units \r\n<p>Click on a deity or servant icon to select that unit. You'll be able to see a preview of the unit and the unit's range below your mouse cursor. Once you find a good position, click on that spot to place the unit. Units cannot be placed on the enemy path. Some spots might be blocked by obstacles.</p>\n<p>Units can only be selected and placed when you have enough favor.  </p>\n<p>Unhappy with a unit? Click on it on the map to bring up more options. Click on \"fire\" to get rid of the unit forever (or until you hire it again). Firing a unit will reimburse half of the original favor cost rounded up. </p>\n\n\r\nImproving deities \r\n<p>You can improve your deities by using favor. Improving a deity raises their damage output.</p>\n<p>To improve a deity, select it on the map and then click on improve. Their level will carry over between maps in the campaign.</p>\n<p>Subjects can't be improved. Instead, they get their level from the average level of all deities currently on the map. </p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T18:20:32", "background_image": "https://media.rawg.io/media/screenshots/8e9/8e9c6a3b10309cb007e022474c050038.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Anaxie Studio"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}