{"id": 766795, "slug": "apo-klypse-iv", "name": "Apo K'Lypse IV", "name_original": "Apo K'Lypse IV", "description": "<p>While you were going through a long journey aboard your space ship, you crashed on a wonderful planet. Recently, meteors started to fall endlessly. You have tried everything so far, you even constructed an ice station to cool the planet, but there is nothing to be done. It's a tragic decision for you, who loved this new place, but now it's an emergency. You HAVE to leave, and you know that you won't be able to save the planet.</p>\n<p>Your spaceship contains everything you need to get repaired, now you have to collect the last materials to finally escape the planet.<br/></p>\n\n<p><strong>Gameplay</strong></p>\n<p>Collect materials by searching it all around the planet :</p>\n<p>   - Get metal scraps to unlock power-ups and repair your space ship.</p>\n<p>   - Bring ice shards to the ice station, it's the only way for you to delay its explosion.</p>\n<p>Hitting a meteor or the lava will make you lose all your loots.</p>\n<p>Your spaceship contains different power-ups that will help you through your escape. Don't understimate the apocalypse.</p>\n<p><strong> Controls</strong></p>\n<p>- Move using \"A\" and \"D\" or directional arrows.</p>\n<p>- Jump with \"Space\"</p>\n<p>- Interact with the Rocket and Ice Station with \"E\"</p>\n<p>- Pause menu with \"Escape\" or \"P\"</p>\n<p><strong>Known bugs</strong></p>\n<p>-Sometimes you can't jump when on the planet. No fix known, it last for a second.</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T19:22:02", "background_image": "https://media.rawg.io/media/screenshots/b94/b948ea46cebd2e6a08d38ffff6851704.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["magik_mice"], "genres": ["Action"], "publishers": [], "esrb_rating": null}