{"id": 766771, "slug": "tominrigg-tactics", "name": "Tominrigg Tactics", "name_original": "Tominrigg Tactics", "description": "<p><strong>Synopsis</strong></p>\n<p>A tactics style game where you fight your way out of a doomed town while trying to save as many civilians as you can at the same time. </p>\n<p><strong>Plot</strong></p>\n<p>The king has abandoned us. No surprises there, the monarchy only cares about its coffer and a village like Tominrigg is apparently disposable. I'll have something to say to the royal bastard's face once we get out of here. For now though, we need to focus. The town is doomed, there's no denying that but there's still people stuck in amongst the chaos. These bony bastards may claim stake to Tominrigg today but we can still save lives out there! Let's get to it!</p><p><strong>Development</strong></p>\n<p>Done over the weekend while still having some time to play Elden Ring. All the code, art, animations and writing were done by me. The audio was from resources available only. Everything was done as part of the jam but some of the map logic was based on some rough work I had done previously.</p>\n<p>Ideally, there would have still been another level of polish but happy with where it ended up. It would have been nice to spend more time on the UI/UX and tidying up the quips, along with fixing some of the bugs (Particularly some pathfinding issues)</p>\n<p><strong>Licenses:</strong></p>\n<p>Battle Of The Creek by Alexander Nakarada | https://www.serpentsoundstudios.com\r\n</p>\n<p>Music promoted by https://www.free-stock-music.com Attribution 4.0 International (CC BY 4.0) https://creativecommons.org/licenses/by/4.0/\r\n</p>\n<p>Fonts:\r\n</p>\n<p>Alagard - https://www.dafont.com/alagard.font\r\n</p>\n<p>Colour Palette - https://lospec.com/palette-list/kalimba-26</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T19:07:37", "background_image": "https://media.rawg.io/media/screenshots/03a/03a94298a7a882c2984f0e0fda14925c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DanAllison"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}