{"id": 766761, "slug": "tax-haven", "name": "Tax Haven", "name_original": "Tax Haven", "description": "<p><em>Made for Ludum Dare 50 with the theme \"Delay the Inevitable\"</em></p>\n<p><strong>Fixed a bug 6th April -</strong> <em>Stopped net disappearing when reaching polygon limit.</em></p><p>In this world nothing is certain but death and taxes.</p>\n<p>You thought, because you were a billionaire, you could just hide away in a sunny tax haven, sailing your superyacht around, drinking piña colada’s, and not pay us a penny. </p>\n<p>Well we’re the HMRC. As we speak, your little piece of paradise is being surrounded and an amphibious naval destroyer is inbound. Just try and wriggle out of this one.</p>\n<p><strong>Instructions</strong></p>\n<p>- Escape for as long as possible from the HMRC amphibious ship that is chasing you. The more fuel you burn, the more expenses you can deduct, and the lower your tax bill will be in the end.</p>\n<p>- The chasing ship will lay a net behind it, so be careful not to get caught in that.</p>\n<p>- You have a canon which can fire incriminating documents overboard. The HMRC want to get their hands on your documents so they will make a beeline for them and give you a chance to get further away.</p>\n<p>- Watch out for the red buoys, they will slow you down if you crash into them, but if you navigate carefully you can use them to slow the chaser down instead.</p>\n<p><strong>Controls</strong></p>\n<p>- Use WASD or the Arrow Keys to move your superyacht around. </p>\n<p>- Aim with the mouse and click or press space to fire your incriminating documents overboard.</p>\n<p><strong>Credits</strong></p>\n<p>- Made in Godot</p>\n<p>- Art - Affinity Designer</p>\n<p>- Notes - Notion</p>\n<p>- SFX - Audacity</p>\n<p>- Music - FL Studio</p>\n<p>- Colour Palette - Sweetie 16 Palette https://lospec.com/palette-list/sweetie-16</p>\n<p>- Font - FT88 by Ange Degheest, Many Elbe, Oriane Charvieux from Fontesk [https://fontesk.com/ft88-typeface/](https://fontesk.com/ft88-typeface/)</p>\n<p>By the way, the HMRC is the governmental tax organisation in the UK, like the IRS in America. </p>\n<p><strong>Source Code</strong></p>\n<p>https://www.dropbox.com/s/y4mfam1loxx0r99/LudumDare50.zip?dl=0<br/></p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T19:01:21", "background_image": "https://media.rawg.io/media/screenshots/628/628f2dc760ceec22755335a6fefa5a1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["weirdybeardyman"], "genres": [], "publishers": [], "esrb_rating": null}