{"id": 766769, "slug": "ld50-garden-war", "name": "LD50 - Garden War", "name_original": "LD50 - Garden War", "description": "<p>Remember last time you have seen one of those cute dragons from rescaria? It must be about 6 months ago...</p>\n<p>This time, at anniversary-anniversary edition Ludum Dare 50 (and our 10th LD in total) Kurisou has well deserved some rest. Unfortunately he has been booked for a garden party - at least he thought!</p>\r\n\"Story\"\r\n<p>In Garden War, you play a manager who is running an event for advertising purpose.</p>\n<p>You distributed leaflets to invite people to your \"Hot Dog Party\" but secretly you wanted people to see your new advertisements so you are trying to keep them away from the hot dog grill as long as you can (In the end you did only buy 50 sausages)</p>\r\nHow to play\r\n<ul><li>Build fences and artillery to defend your sausages.</li><li>Use Bear traps to slow down people,</li><li>use spikes to deal damage to people walking over them.</li><li>If people walk through advert flags, you earn money.</li></ul>\n<p>Time is frozen in build mode, but buildings are actually built by drones at *runtime*. The order of placement matters, because one drone can only build one building at a time.</p>\n<p>In the end, you have to delay the inevitable end of sausage supply by \"decimating\" guests.</p>\n<p><strong>Hint: </strong>The guests will spawn in front of the house. Use fences and spikes for the first waves.</p>\r\nHow to build\r\n<p>In build mode, you can select the building you want to place on the left side.</p>\n<p>Now you can use your mouse to place that on the yard wherever you like. The actual build time starts as soon as you exit the build mode but only if there is a drone availabe. Drones can only build one building at a time, that means they will build those in the order you placed them in.</p>\n<p>It does for example not make sense to first place all fences, then fill the space with spikes.</p>\n<p>Instead, place a few fences, then spikes, then fences, ... The order can make the difference between win and lose.</p>\n<p>If you decide to cancel a build, use the Job List on the right side - You get 80% gold back then.</p>\n<p>If you decide to replace a building at a later time, open the build mode and click the building on the map without selecting a new building in advance. You can get up to 65% gold back - depending on the health of the building.</p>\n<p>Buildings can be destroyed by visitors. This is more likely to happen, if you are placing fences too near so that the gangways gets too small.</p>\n<p>If you happen to trap people, the panic - which will cause then to randomly attack your buildings directly. (You don't want that)</p>\r\nControls\r\n<p>Mouse. End.</p>\n<p>Select/Interact with LMB, Rotate objects with scroll wheel or RMB. Quite intuitive.</p>\n<p>No virtual people have been hurt by catapults by the way, they are shooting ice cream :) - Seriously!</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T19:04:41", "background_image": "https://media.rawg.io/media/screenshots/326/326baa289acf875eb4f86bd5400e54bb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Firesplash"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}