{"id": 766846, "slug": "mushrooms-of-the-end", "name": "Mushrooms of the end", "name_original": "Mushrooms of the end", "description": "<p>TW: Death, end of the world<br/><br/>Years ago, mushrooms ended human society. Now, other kinds of mushroom allows you to live prosper by trading their crystals. <br/><br/>These mushrooms take years to grow, losing even one of them would be disastrous, so try to keep as much as you can by watering them and protecting them from pests.<br/><br/>To prevent their inevitable death even longer, use the cristals harvested to buy more water or frog turrets to kill insects automatically.<br/><br/>Jump from slice of life to slice of life, trying to live as long as possible, trying to keep your farm intact as long as possible. But don't forget, sooner or later, everything ends...<br/><br/></p>\n<p>-------------------------------------------------------------- </p>\n<p>The game was made  in 72 hours for the Ludum Dare 50 which theme was \"Delay the inevitable\"</p>\n<p>Credits: Pordrack and Diriann for code and level design, Shrimpiano for music, Shrimpiano and MopMoppy for sound effects, Pendul and Pordrack for graphics. SubjectOmega also helped us when we encountered a technical issue. Note that every asset that is derived from a photo used a base that wasn't made by us, which is why we prefered to opt out of the graphics category. <br/></p>\n<p>--------------------------------------------------------------</p>\n<p> How to install: Open the itch.io link and play from browser or download the .zip and launch the .exe in it.<br/></p>\n<p>-------------------------------------------------------------- <br/></p>\n<p>How to control the game: everything is played using the mouse, an ingame image helps you understand which buttons do what (but we hope that the game in itself is clear enough so you wont need it)</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T19:42:29", "background_image": "https://media.rawg.io/media/screenshots/c5f/c5f317ed51c7e32228f1c8d7468c9d4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Pordrack"], "genres": [], "publishers": [], "esrb_rating": null}