{"id": 766874, "slug": "airborne-retribution-legacy-revelations-of-invasio", "name": "Airborne Retribution: Legacy: Revelations of Invasion: the Return IV Deluxe Edition Remaster: Gold", "name_original": "Airborne Retribution: Legacy: Revelations of Invasion: the Return IV Deluxe Edition Remaster: Gold", "description": "<p>Entry in Ludum Dare Game Jame 50<br/><br/>Take command of Earth’s last hope, the Shining Comet. As you fight to ward off an nearly endless wave of Zargions, the greatest evil earth has ever known. They have demolished and destroyed every galaxy in the Milky Way. Their secret is these Zargions are shapeshifters and have been able to take down every civilization from the inside. They have yet to do this to Earth thanks to our great hero, Sankari Helt. Who has found the Zargonian leader, Zoa Ond and has led Earth in a battle against these scourge of the Earth (though he was too late some Zargions infiltrated NASA and declassified Pluto as a planet, those bastards!) Anyway, Sankari has chosen you to lead his legion and his lead ship the Shining Comet. The only problem is your childhood archrival has grown jealous and cut a hole in the Shining Comet’s gas tank creating a leak. Your job is to make sure the ship stays constantly fueled. Are you up to the challenge and willing to lead the legion of the Shining Comet to victory?<br/></p>\n<p><strong>notable reviews</strong> “It’s kinda-“ -Cortland, Lubke Games.\r\n</p>", "metacritic": null, "released": "2022-04-05", "tba": false, "updated": "2022-04-08T19:55:06", "background_image": "https://media.rawg.io/media/screenshots/dc0/dc035a70e0eeba66923d73418f1e082b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RosyMapleMoth", "LorenzoLion"], "genres": ["Action"], "publishers": [], "esrb_rating": null}