{"id": 76687, "slug": "tap-knights-the-fate-war", "name": "Tap Knights: The Fate War", "name_original": "Tap Knights: The Fate War", "description": "In Tap Knights - Idle RPG, the world has been overrun by powerful monsters and dragons. Build a team of mighty warriors (Orcs, Trolls, Mages, Dwarfs and Dragons) and battle hundreds of enemies and boss mobs by tapping on them. In the endless frontier of clicker heroes, you'll need to upgrade your tap hero skills and mighty warriors equipment to take on the ever growing horde of monsters and dragons.<br/><br/>Tap Knights - Idle RPG is a tapping game that let's you slash mobs, collect items, and kill boss mobs while enjoying the ultimate benefits of the idle games genre. You don't have to be in game and tap monster all the time. You can play this clicker RPG whenever you want, leave the game, and this idle game will still let your team of clicker heroes slash mobs and collect loot!<br/><br/>Tap Knights - Idle RPG is a warriors tapping game with an extremely familiar style of gameplay similar to the tapper games genre. Have you ever played a tap tap game where you tap monsters to kill them and advance through endless levels? Tap Knights - Idle RPG is a tapping game with a fun spin on the tap games genre because you not only get to enjoy tapping game mechanics, but you get to also unlock new heroes, items, equipment, skills, crafting recipes and clicker heroes ultimate skill attacks! <br/><br/>Features<br/>- SUMMON a team of mighty warriors! (Berserker, Shaman, Gunslinger, Assassin, Dwarves and Dragons)<br/>- BATTLE legions of monsters and bosses! <br/>- COLLECT hundreds of epic equipment and loot! <br/>- UPGRADE your tap heroes skills and items!<br/>- EXPLORE 6 unique special areas to collect special items for your team of mighty warriors!<br/>- ADVANCE through thousands of levels and unleash the wrath of your tap heroes!<br/><br/>Download Tap Knights - Idle RPG today and experience a warriors tapping game where your team of mighty warriors slash mobs and slay boss mobs in a realm grinder action adventure tapping game!", "metacritic": null, "released": "2017-05-04", "tba": false, "updated": "2019-10-22T14:06:29", "background_image": "https://media.rawg.io/media/screenshots/b8a/b8af220bf6aef28d8855b02b71f32bba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chineseall"], "genres": ["Adventure", "RPG"], "publishers": ["Chineseall"], "esrb_rating": "Everyone 10+"}