{"id": 766955, "slug": "different-strokes", "name": "Different Strokes", "name_original": "Different Strokes", "description": "Check out the Deluxe Edition DLC to unlock 9 additional colors and numerous extra features!<br/>\n<br/>\r\nYour friend, a conceptual artist, has invited you to their latest exhibition.<br/>\r\nYou enter expecting to see their art adorning the walls, but to your surprise, the VISITORS are the ones drawing the art — they’re even drawing over each other’s work! It’s up to you to protect the exhibition from being covered in artwork that is, intentionally or otherwise, truly awful.<br/>\n<br/>\r\nGameplay consists of:<br/>\r\n- exploring the ever-expanding gallery<br/>\r\n- painting your own artwork on blank canvases<br/>\r\n- editing other player's artwork<br/>\r\n- rating completed artwork<br/>\n<br/>\r\nAll of the art exhibited in the game is 100% created and remixed and rated LIVE by other players. Yes, we host all of this art and load it in dynamically. We hope that you will choose to fix the (inevitable) unacceptable art!<br/>\r\nIn addition to the main gallery there is also a portal to the \"gallery of the week\". Every week there will be a new gallery with a particular theme. The main gallery is pretty crowded so your art may have a better chance of standing out in the gallery of the week!<br/>\n<br/>\r\nPaintings have a \"share link\" button that takes you to a web page you can use to share your work with other people outside of the game.<br/>\r\nPlayer's can optionally create a user account. When logged in, any paintings you create/edit will be marked with your username. Other players will be able to click on your username to see all the paintings you have created.<br/>\n<br/>\r\nYou can choose between setting up an account with a separate username/password that can be used cross-platform (Itch.io / browser version) or to login using your steam account in which case your account will always be tied to Steam.<br/>\n<br/>\r\nFrom the logged in screen you can see notifications when other players like your paintings and see how many total likes they've received.<br/>\n<br/>\r\nJoin the Discord and meet your favorite artists!<br/>\r\nhttps://discord.gg/7r7MtVmEnh", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2023-08-16T15:06:17", "background_image": "https://media.rawg.io/media/screenshots/660/66080fabbbbd56dc7907954b8f325b26.jpg", "website": "https://www.differentstrokes.xyz/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 158, "toplay": 1, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 4, "ratings_count": 4, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "Web"], "developers": ["swsteffes", "Different Folks"], "genres": ["Massively Multiplayer", "Indie"], "publishers": ["Different Folks"], "esrb_rating": null}