{"id": 766996, "slug": "the-endless-night-ludum-dare-50", "name": "The Endless Night - Ludum Dare 50", "name_original": "The Endless Night - Ludum Dare 50", "description": "<p>Vampires like the night, that's a well-known fact. And one particular vampire loves it so much that he created a little magic ritual to prevent the sun from rising. The only problem is that it makes him very thirsty...</p>\n<p>So go out in the night to feed on some hapless civilians! And as a bonus, it also turns them into little vampires themselves! If only those pesky hunters could leave you alone...</p>\n<p>Use WASD, ZQSD or Arrow Keys to move and E to interact with the environment.</p>\n<p>Prolong the night as long as possible. The longer your hold, the more you'll score!</p>\n<p>Move around the town to feed on civilians and recharge your blood meter. That's your energy to make some magic! Also, you'll gain a nice little emo vampire who will follow you and earn you more points.</p>\n\n<p>Avoid the vampire Hunters, they want to kill you! At least they're slow, but they're relentless. If they spot you, their Vigilance will increase... but you can go at the concert to hide a little!</p>\n<p>Prevent the Priests from stopping your magical endless night. They'll come right for your manor, so watch out!</p>\n<p>Finally, use some of your magic to summon zombies to get rid off a Hunter. Because they'll keep on coming and coming until you're overwhelmed...</p>\n\n<p>Stall the Night, Transform Civilians, Avoid Hunters. Should be easy enough, right?</p>\n<p>Well, share with us your best score!</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T20:43:09", "background_image": "https://media.rawg.io/media/screenshots/368/368b9bb3ee9f36744bb3e487877b2763.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Vidu", "Arivenzys", "VisionElf", "wRadion", "Mistersyms", "ikowa"], "genres": [], "publishers": [], "esrb_rating": null}