{"id": 76697, "slug": "tap-tap-fish-abyssrium", "name": "Tap Tap Fish - AbyssRium", "name_original": "Tap Tap Fish - AbyssRium", "description": "Tap Tap Fish - AbyssRium is a game that helps relax your nerve(VR APP). Level up your Stone, create your own fish and make the Aquarium belongs to you! A beautiful ocean world waiting for you to explore! Add VR Game mode, you can watch the fish immersive!<br/><br/>How to play?<br/>Level up the stone by tapping.<br/>Build Coral to double the vitality.<br/>Use vitality to create your fish.<br/>Use Cardboard to enjoy your abyss aquarium in VR Game mode.<br/><br/>Features:<br/>1. Simple Control---- create coral and fish with just a simple tap<br/>2. Amazing graphics---you can view every fish in 3D dimension in HD<br/>3. Lovely background music---- The song of a whale &amp; the sound of water droplets all guide you to a beautiful musical world. <br/>4. VR Game Support----Use Cardboard to enjoy your abyss aquarium in VR Game mode. You can watch little fish swimming overhead and right before your eyes—in 3D<br/><br/>Follow and contact us<br/>If you have any suggestions or errors to report, please contact abysshelp@conew.com. We will do our best to respond to your invaluable opinions.<br/><br/><br/>Subscription options<br/>We have the following subscription periods in our game:<br/><br/>1. Weekly Diamond Membership offers weekly subscription for $7.99 after 3-day free trial which provides 200 Rubies , 1 Prop on a daily basis and Removes ADS.<br/><br/>2. Monthly Diamond Membership offers monthly subscription for $19.99 which provides 200 Rubies , 1 Prop on a daily basis and Removes ADS.<br/><br/>3. Yearly Diamond Membership offers yearly subscription for $99.99 which provides 200 Rubies , 1 Prop on a daily basis and Removes ADS.<br/><br/>End of trial and subscription renewal<br/><br/>This price is established for United States customers. Pricing in other countries may vary and actual charges may be converted to your local currency depending on the country of residence.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase.<br/><br/>Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.<br/><br/>Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/><br/>Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/><br/>Canceling trial or subscription<br/><br/>You can turn off the auto-renew for the subscription whenever you want to through iTunes. Check https://support.apple.com/HT202039 . When your current trial/subscription period expires, you will be unsubscribed. The current active subscription period can not be canceled. When your subscription expires, you will no longer be able to use elements included in Subscription option.<br/><br/>If you have any questions or comments, feel free to contact us at bnb@conew.com <br/><br/>Privacy Policy: http://www.cmcm.com/protocol/site/privacy.html<br/>Terms of Service: http://www.cmcm.com/protocol/site/tos.html<br/>Terms of Subscription: https://bnbpay.cmcm.com/bnb/SubscriptionTerms.html", "metacritic": null, "released": "2016-07-15", "tba": false, "updated": "2023-10-12T20:04:30", "background_image": "https://media.rawg.io/media/screenshots/59a/59a56552a874f1a2f92c6b5c15a809f6.jpg", "website": "https://www.abyssrium.com/", "rating": 3.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 1, "beaten": 2, "toplay": 1, "dropped": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 6, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 6, "platforms": ["iOS", "Android"], "developers": ["Cheetah Games", "SangHeon Kim"], "genres": ["Strategy", "Simulation", "Educational"], "publishers": ["SangHeon Kim"], "esrb_rating": "Everyone 10+"}