{"id": 767077, "slug": "mechaliens", "name": "Mech&Aliens", "name_original": "Mech&Aliens", "description": "<p>Somewhere far away, on a dry desert planet...</p>\n<p>A powerful Mecha has been vaporising some alien bugs!\r\n</p>\n<p>Sounds like a hell of a lot of a familiar story, alright?\r\n</p>\n<p>Well, in this game we are not trying to fight the inevitable formulaic of such a scenario - we revel in it! What if... Mecha the Exterminator wasn't the hero we needed? What if the aliens were merely protecting their home? Would they be able to stand up to the aggressor?\r\n</p>\n<p>Up to you to decide!\r\n</p>\n<p>RULES:\r\n</p>\n<ul><li>Control just about nothing and watch endless aliens die gruesomely\r\n</li><li>Gather the XP (extermination points) and get new levels of Alien badassery!\r\n</li><li>Develop new alien types, make existing ones totally OP (overpatched) and hand this Mecha's rear end to it with the overwhelming waves of incoming brutality!\r\n</li><li>Do not allow Mecha to kill your little buggers for more than 10 minutes - the game will inevitably be over in that case!\r\n</li><li>Have fun!</li></ul>\n<p>CONTROLS: </p>\n<p>- Mouse - click the Alien upgrades as they come up.</p>\n<p>- Upgrades come in 3 varieties: new Alien Types, Alien improvements and Alien waves. It's up to you decide on the winning strategy!</p>\n<p>ALIEN TYPES:</p>\n<p>- <strong>Crawler</strong> - the most common alien, simply tries to catch the Mecha and bite it to death (usually that does not really happen). At least there will always be a lot of them.</p>\n<p>- <strong>Brute</strong> - a buffed up Crawler, effectively: very tough and hard-hitting, but also slow and does not spawn in such quantities aa it's little brother.</p>\n<p>- <strong>Spitter</strong> - a ranged attacker that will provide a rather agile but also unreliable source of damage to the Mecha. Isn't particularly sturdy.</p>\n<p>- <strong>Boomer</strong> - a fragile suicide attacker that will hit the Mecha for a significant damage if it manages to explode nearby.</p>\n<p>- <strong>Spider</strong> - a reasonably healthy and quick fighter that will slow the Mecha down if it manages to successfully attack it. Can be really dangerous in a combination with other Aliens!</p>\n<p>You might own up to 4 Alien Types in total.</p><p>P.S. By the way, you are not the only one getting upgrades out there. Mecha's getting stronger with every slain creep.<br/></p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T21:19:43", "background_image": "https://media.rawg.io/media/screenshots/803/803d8792476520f90ccede32281e7326.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["Nebulate.me"], "genres": [], "publishers": [], "esrb_rating": null}