{"id": 767084, "slug": "the-deadlands-demo", "name": "The Deadlands (Demo)", "name_original": "The Deadlands (Demo)", "description": "Welcome!\r\n<p>This is my first game release, I'm new to game development. I hope you enjoy this short demo of the game and I'm hoping it will get enough attention that you and many others will want to see the full version of this game. This game was influenced by the old school Castlevania games. If this game gets enough love I would love to actually put in music that gives more of that feel. This game was made purely from free assets, but depending on how things go I'd love to spend money on artwork and things to really make this game a work of art. </p>\n<p>Now I know most of you will notice something that seems like a glitch your first playthrough but there are two hidden mechanics in the game:<br/></p>\n<ul><li>Wall jumping- sometimes if you go from running to jumping and clip the wall just right you can wall jump. </li><li>Clinging- this mechanic doesn't have a special animation (...yet) but it will look like your running into a side of a wall or platform. While in actuality you are but also you are slipping, meaning you will eventually sink and fall if your not careful.</li></ul>\n<p>Now that you have taken the time to read all that please enjoy my game and if you interested in seeing a full game filled with story, bosses, tougher enemies, and more dangerous traps, then please let me know in the comments and if you can check out my Kickstarter campaign.</p>\n<p>http://kck.st/3DIZleM<br/></p>\n<p> Thank you all and enjoy my first game as a indie game developer!</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T21:22:04", "background_image": "https://media.rawg.io/media/screenshots/88c/88cd14e089be9fb9f6392006b40c9f20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Despair Games"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}