{"id": 767186, "slug": "trashy-towers", "name": "Trashy towers", "name_original": "Trashy towers", "description": "Trashy Towers\r\n<p>A Tricky Towers inspired game where you have to stack trash with your roommates until someone spills it.</p>\n<p>Entry for the Ludum Dare 50 with the theme \"Delay the inevitable\".\r\n</p>\n<p>This game is playable with a keyboard or one or more gamepads.<br/>The native Linux build has some difficult to reproduce issues with the gamepad disconnecting.<br/>If this happens, try the web build instead.<br/>\n</p>\r\nSetting\r\n<p>Taking out the trash is a pretty annoying chore.<br/>You've got to put on street clothes and go into this terrifying place called \"outside\".<br/>That's why in many living arrangements, this is procrastinated until the trash spills out of the can.<br/>By smartly placing your trash you can \"delay the inevitable\" spilling until hopefully someone else spills it so that it's their problem.<br/>This is a game about that.</p>\r\nGame modes\r\nSingle\r\n<p>Play alone to beat your highscore.</p>\n<p>This may be the least fun mode of play but since having friends around to play games is a rare privilege, there had to be some way to try the game alone.\r\n</p>\n<p>If you somehow can (Parsec/ actually meeting people/ whatever else) also try the other modes!\r\n</p>\r\nChaos\r\n<p>A chaotic mode in which you and a friend try to put trash in the same can simultaneously.</p>\n<p>Whoever has dropped the last piece before the heap spills loses.\r\n</p>\n<p><strong>Hot tip</strong>: If you see something moving after the other player has set it down, you can slow down your own trash falling.<br/>If you don't their trash might land after yours does, and you lose the game.<br/>Imagine this being a bit like when someone has put in something compressed that extends over time; if you happen to have thrown something in the trash before it's done extending, it will look like the spilling was your fault.\r\n</p>\r\nHotseat\r\n<p>Take turns with a friend putting trash in the same can.<br/>Whoever has dropped the last piece before the heap spills loses.</p>\r\nTechnology Used\r\n\n<ul><li>Game Engine: Godot\r\n</li><li>Sprite editing: Aseprite\r\n</li><li>SFX: sfxr\r\n</li><li>Music: GarageBand iOS\r\n</li></ul>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T22:06:48", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e6eb3bafe86220f06217261882d3651.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DysphoricUnicorn"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}