{"id": 76714, "slug": "tribal-wars", "name": "Tribal Wars", "name_original": "Tribal Wars", "description": "Tribal Wars is a massively-multiplayer, hardcore medieval strategy game where the winners take all, and every player is a potential enemy. Manage your village, construct formidable defenses, and raise a ferocious army in order to outgrow your enemies and plunder their resources. Assemble Tribes with other players, conduct real diplomacy with bordering leaders, and coordinate armies as a group in order to create strategic battle plans that devastate your enemies and conquer thousands of villages on the map. Servers exist as persistent worlds in real time, and only crucial decision making, long-term planning, and a watchful eye over your kingdom can secure success. It’s conquer or be conquered; make claim the glory for yourself! The only thing you take with you to the next world is the knowledge learned in the magnificent wars of the past!<br/><br/><ul><li>Compete in hardcore PvP strategy in persistent online game worlds</li></ul><ul><li>Expand your kingdom through conquest, go from 1 village to 1000</li></ul><ul><li>Plan deep strategies enabled by few rules and simple mechanics</li></ul><ul><li>Cooperate with real players to move large armies into tactical positions</li></ul><ul><li>Manage resources and troop movements in real time</li></ul><ul><li>Begin every round on truly equal footing with every player, winner takes all</li></ul>", "metacritic": null, "released": "2011-12-20", "tba": false, "updated": "2020-11-13T02:17:57", "background_image": "https://media.rawg.io/media/screenshots/4bc/4bcf552f992f3a1ea286810c1775b05c.jpg", "website": "https://www.tribalwars.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 57, "toplay": 1, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 459, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC", "Android", "iOS"], "developers": ["InnoGames"], "genres": ["Action", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["InnoGames"], "esrb_rating": "Everyone 10+"}