{"id": 767238, "slug": "crunch-itch-neisha-treesareop", "name": "Crunch (itch) (Neisha, treesAreOp)", "name_original": "Crunch (itch) (Neisha, treesAreOp)", "description": "<p>Crunch is a small game where the player has to keep their character awake for as long as possible. However they have procrastinated for too long so they are not able to meet their deadline. Therefore all nighters have to be pulled to finish as much work as possible. But the character is already very tired and exhausted and it is only a matter of time until their body inevitably crashes and they fall asleep, getting no further work done before the deadline.</p>\n<p>The player has to help their character stay awake for as long as possible through various actions like drinking coffee or getting fresh air.</p>\n<p>Be aware though that depending on the action the character does, it also affects their sleepiness and productivity, getting more or less work done.<br/></p>\n\n<p>Team:</p>\n<ul><li>Jenny Neuhard (Developer, @Neisha)</li><li>Adrian Bernhart (Developer, @TreesAreOp)</li></ul><p>Assets:</p><ul><li>Kenney Assets</li></ul>\n<p>Thanks for playing our entry for the Ludum Dare 50 game jam! We love participating in game jams, being able to get lots of ideas into actual prototypes and little games. We are in the process of starting out as a little indie company called \"Coffee Scream Studio\". Check out our website: coffee-scream.studio! We plan to release our first little mobile game this year (2022)!</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T22:25:30", "background_image": "https://media.rawg.io/media/screenshots/3ec/3ec4387bc5f2dbf3497283a34a9e2477.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Neisha", "treesAreOp"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}