{"id": 76723, "slug": "rugby-league-18", "name": "Rugby League 18", "name_original": "Rugby League 18", "description": "Tackle the speed, power and intensity of Rugby League on mobile, with the App Store's Number 1 mobile Rugby League simulation - Rugby League 18!<br/><br/>Completely rewritten, this year's game features the much-requested Career Mode, D-Pad controls and is improved in every area.<br/><br/>Rugby League 18 delivers those big hits with stunning 3D visuals, fluid animations &amp; fingertip controls. With game-play across five intense tournaments, Career Mode, Play Now, Challenges and Live Games - it provides the most complete Rugby League action on mobile.<br/><br/>SHAPE YOUR CAREER<br/>Expectations are high, as you aim to become a legend in the world of rugby league with an in-depth CAREER MODE spanning multiple seasons. Create your player and experience rugby at grassroots level and work your way up through the ranks to play for some of the giants in World rugby, with your eyes set firmly on the prize...international glory! Your performance on the field will determine how quickly your career develops and which teams offer you contracts! Do you have what it takes to perform on rugby’s biggest stage?<br/><br/>LIVE GAMES<br/>Join others and compete in regular LIVE GAMES. Earn points for your team and lead them to victory. Can you climb to the top of the influencers leaderboard?<br/><br/>FINGERTIP CONTROLS<br/>Whether you are a seasoned rugby pro or just getting started, show off your rugby skills with intuitive controls. Use the on-screen virtual buttons to guide your players around the field. For that extra bit of rugby flair, use swipe gestures to sidestep the oncoming defenders.<br/><br/>REPRESENT YOUR STATE<br/>Show your true colours and choose between New South Wales or Queensland and take part in the South Hemisphere's premier rugby league event, The State Series! Battle it out in a best of three rivalry to see who takes home the bragging rights!<br/><br/>FEATURES<br/>Over 120 teams at club and international level.<br/>5 exciting tournaments.<br/>Play Now<br/>Challenges<br/>Live Games.<br/>Intuitive controls.<br/>Motion captured animations.<br/><br/>FIND US<br/>WEB: www.distinctivegames.com<br/>FACEBOOK: facebook.com/distinctivegames<br/>TWITTER: twitter/distinctivegame<br/>YOU TUBE: youtube.com/distinctivegame", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-07-30T14:16:14", "background_image": "https://media.rawg.io/media/screenshots/b8f/b8f71744cf7c6d8f5bb50b965a48e7f7.jpg", "website": "http://www.distinctivegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Distinctive Games"], "genres": ["Action", "Sports"], "publishers": ["Distinctive Developments"], "esrb_rating": "Everyone 10+"}