{"id": 767295, "slug": "the-witch-princess", "name": "The Witch Princess", "name_original": "The Witch Princess", "description": "<p>The Witch Princess is a fairy tale set in Muslim Spain in the 11th century, with which you can learn the Spanish language, as well as history. Follow the adventures of Dalia, a young Muslim noblewoman who must travel to the castle of a rival family where she will discover that nothing is what it seems.<br/></p>\n<p><strong>Language learning</strong><br/></p>\n\n<p>Any game can help you learn languages, but this one has tools designed to do it better. The voices are in Spanish, with the texts in English. In addition, we have analyzed the most frequent vocabulary in the game, and before each scene we teach some new words that appear in it. We can even practice them with simple exercises if we want. These words will be repeated in the following scenes and exercises.</p>\n<p> Finally, if you know enough Spanish, you can also change the subtitles to Spanish. If you get lost at some point you have the possibility to see the last phrases with their translations and listen to them again.</p>\n\n<p><strong>History learning</strong></p>\n<p>Although the story is fictitious, the characters are related to real places and events in the history of Spain: The Christian kingdoms, the Caliphate of Córdoba, the Fitna of Al-Andalus, the Muslim Taifas,... and dozens of historical figures from that time. In addition, due to the fantastic character of the story, the mythology of the Iberian Peninsula will also be discussed. And all this accompanied by some of the best classical music by Spanish composers.<br/></p>\n<p><strong>A vision of tolerance and respect for diversity</strong></p>\n<p>A time when many religions and cultures coexisted can help to break myths and prejudices. Not only women and LGBT characters are protagonists in the game, but this diversity is also shown through historical events that are often forgotten.</p>\n<p><strong>Development</strong><br/></p>\n<p>The current prototype has provisional character voices, backgrounds, and images. Also the story will be improved for the final game, and new tools will be added. The current version lasts half an hour in which 60 words are practiced.</p>\n<p>The total game will last about 15 hours and you will be allowed to practice 2000 words. It will be divided into 5 chapters that will be published as they are ready. The script for the first chapter is already in development, and we hope it will be ready in May, although after that we will have to find financing for the voices, translation revision, music and final art.</p>\n<p>For more information and updates follow us or contact with us at:</p>\n<ul><li>https://twitter.com/LaPrincesaBruja</li><li>https://www.facebook.com/LaPrincesaBruja<br/></li><li>contacto@faerygames.com</li></ul>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-08T22:53:50", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bcaea657b22e5ec24d8628a7568cbf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Faery Games"], "genres": ["Adventure", "Educational"], "publishers": [], "esrb_rating": null}