{"id": 7673, "slug": "shooting-showdown-2-pro", "name": "Shooting Showdown 2 Pro", "name_original": "Shooting Showdown 2 Pro", "description": "\"The closest experience you can have to the actual thrill of being out on the range.\" - Sgt. Jeremy A. (USMC), Advanced Weapons and Tactics Instructor<br/><br/>Experience the game that changed the FPS genre forever. Match up against your friends, your enemies, or anyone in the world in the first virtual reality shooting range! No headset required!<br/><br/>• FEEL THE STEEL •<br/>With gyroscopic virtual reality, skill based reloading, and ultra competitive multiplayer, Shooting Showdown 2 is the most technically advanced shooter on the planet. <br/><br/>• DROPPING JAWS THE WORLD OVER •<br/>Hyper-realistic muzzle flash, bullet tracers, and true impact audio make for a spectacular next-gen experience. <br/><br/>• INSTANT MULTIPLAYER • <br/>With our exclusive Quick Match system, get placed in a lag-free multiplayer match in 5 SECONDS. No waiting. No lag. Just play.<br/><br/>• PRO FEATURES • <br/>- Extra Gold - Earn more gold to upgrade and customize your weapons!<br/>- All levels - Play on all Indoor and Outdoor shooting ranges without having to level up!<br/>- No Ads - Enjoy Shooting Showdown 2 without disturbance! **Occasional ads will run during the free launch sale, but will stop when the game returns to $0.99 <br/><br/>CALLING ALL SHARPSHOOTERS<br/>• Virtual reality controls let you take aim with your device-- how accurate are you really?<br/>• Head-to-head multiplayer<br/>• Physics-based shooting challenges with destructible targets<br/>• Practice range for honing your skills<br/>• Leaderboards and Achievements to track your improvement<br/>• Unlockable guns and upgrades<br/><br/>• JOIN OVER 100 MILLION GAMERS WORLDWIDE •<br/>Follow @Naquatic on Facebook and Twitter to find out why our apps like MonsterCrafter and Shooting Showdown have been featured by everyone from Apple to IGN, AppAdvice, and TouchArcade.", "metacritic": null, "released": "2014-10-16", "tba": false, "updated": "2019-07-29T22:09:49", "background_image": "https://media.rawg.io/media/screenshots/17f/17f9cf427b126346960c8ea3f286c65a.jpg", "website": "http://naquatic.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Naquatic"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Naquatic"], "esrb_rating": null}