{"id": 767462, "slug": "my-newborn-life-in-a-haremnsfw-18", "name": "My Newborn Life In A Harem(NSFW 18+)", "name_original": "My Newborn Life In A Harem(NSFW 18+)", "description": "◆Story\r\n<p>What happened? I……What happened? I looked down; my big belly had disappeared. Where was my 30-year-old big belly?<br/>Why am I so slim? Could it be… I've crossed over to an alien world? I’ve been reborn?<br/>Nonsense. It’s not one of those cheap, cheesy novels in which you get hit by a car and reincarnate in a different world...<br/><br/>So, you saved me?<br/>Well, sort of. I’m the one who reconstructed your face and took care of you.<br/>So why did you save me? Am I some chosen one who’s supposed to save the world?<br/>Ah? No. You’ve got some nerves…<br/><br/>You said yourself that if someone saved you, you’d do anything.<br/>Firstly, the bill. After a 10% discount, it’s 20 million. Here's the receipt. Your fingerprints are also stamped on it.<br/>What? You’re asking for money? And it’s way too much, isn't it? You're a scam! You must have stamped it on me while I was in a coma!<br/>Then you can help me collect \"love\" until you’ve collected enough to cover your debts.<br/><br/>Oh... I’ll do anything to pay off my debts... Although I don't understand what you mean by \"collect love\"...<br/>...Well, then, I had to get back to my life and find a job again. After all, I had to eat and pay my debts...<br/>With so many changes in my appearance, many things had to change as well, such as clothing, and so on...<br/>Anyway, let’s keep going…<br/><br/>Well, actually, let’s… start my new life!!!</p>\n\n<strong>◆Gameplay Instructions</strong>\n<p>This game is a first-person perspective AVG.Players will take on the role of a fat geek who has been in a car accident and put in a coma for six months, and who starts a life courting the women around him.<br/>To play the game, try getting back to work and spending time with different girls. You can explore their private lives and learn their secrets.<br/>There are 6+2 girls in the game to get to know.<br/>You can develop a relationship with them individually and discover what they don’t want other people to know about.<br/>Once you have collected enough “love”, you will face a choice. What will become of you?</p>\n\r\n◆Game Features\r\n<p>◇33 basic CGs, including more than 500 differences.<br/>◇Game text: 110,000 words.<br/>◇Visual Novel Game.<br/>◇Endings: 3 different kinds.</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2023-03-04T19:29:58", "background_image": "https://media.rawg.io/media/screenshots/0ac/0ac475a971c61b3dfcc076461ce81270.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "PC"], "developers": ["Playmeow"], "genres": [], "publishers": [], "esrb_rating": null}