{"id": 767489, "slug": "brain-burgers", "name": "Brain Burgers", "name_original": "Brain Burgers", "description": "<p>Your service job in fast food could really come in handy in a zombie apocalypse! In Brain Burgers, you serve the eponymous tasty treats to ravenous zombies to delay the inevitable… which in this case is becoming zombie food yourself. Ironic, isn’t it?</p>\r\nControls\r\n<p>Menus:\r\n</p>\n<ul><li>Click on button(s) Or\r\n</li><li>WA or arrow keys: Choose a button\r\n</li><li>E or Enter: Press the button\r\n</li></ul>\n<p>Game:\r\n</p>\n<ul><li>WASD: Move\r\n</li><li>Interact: E when wrench is not equipped\r\n</li><li>Attack: Space or LMB</li></ul><p>How to Play<br/></p><ol><li>Get a raw brain from the freezer\r\n</li><li>Put the brain in the frier\r\n</li><li>Put the cooked brain on to the assembly counter near the frier\r\n</li><li>Take a bun from the big pile\r\n</li><li>Put the bun in the toaster next to the pile\r\n</li><li>Put the toasted bun on the assembly counter\r\n</li><li>Once there is a toasted bun and a cooked brain on the counter, wrap a burger\r\n</li><li>Take the wrapped burger to the counter. The nearest zombie will come and take it<ul><li>You can also take the burger to the warmer behind the counter to store it<ul><li>Approach the warmer from behind to put a wrapped burger in it\r\n</li><li>Approach the warmer from the front to take a wrapped burger out\r\n</li></ul>\n</li></ul>\n</li></ol>\n<p>The burger ingredients and wrapped burgers take up inventory slot 1. You can only have one item in that slot at any given time. Picking up another item drops the previous item on the ground. The wrench takes up inventory slot 2 and cannot be replaced.</p>\n<p>The frier and the toaster have a limited number of uses before they break.\r\nIf you interact with them while the required item is not equipped, you can repair them at any time.<br/>You can also use the wrench to kill zombies.\r\n</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-09T00:20:52", "background_image": "https://media.rawg.io/media/screenshots/e45/e45c7f1dddf555f07f887334e1646169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Juhkoski", "jonjarv"], "genres": [], "publishers": [], "esrb_rating": null}