{"id": 767531, "slug": "boris-and-the-miserable-factory-of-mr-bossman", "name": "Boris and the Miserable Factory of Mr. Bossman", "name_original": "Boris and the Miserable Factory of Mr. Bossman", "description": "<strong>TOM</strong><strong>ATO SOUP INC RECRUITS!</strong>\n\n\r\nResponsible for Sorting Soups (F/M/NB)\r\n\r\nCompany Description :\r\n\nTomato Soup Inc, is a FAMILIAL and DYNAMIC company looking for NEW TALENTS to sort our delicious soups. Created in 2021, our 6 months of experience allow us to benefit from know-how worthy of the oldest traditions. Join a YOUNG and PERFORMING team by sending us an E-MAIL.\r\n\r\n\r\nJob Description :\r\n\r\nYou will have to sort the good soups from the bad soups and exercise JUDGMENT and SPEED (not like our last soup sorting manager: Boris Soupinich, whom we are late to fire.) Be careful to sort the different soups carefully to prevent our new machine(replacing the one Boris broke), from exploding.\r\n\r\n\r\nQualifications :\r\n\n<p>\n</p>\r\n-You benefit from two thumbs and a bit of savvy (not like Boris)\r\n-You are passionate about soup of all kinds and dream of making this passion your professional career\r\n-Your first name Does not start with \"Bo\" and does not end with \"ris\"\r\n-You have at least 10 years of experience in the canned soup industry\r\n\r\n\r\nAdvantages of the position to be promoted:\r\n\r\n -Free access to tomato soups for the entire duration of your contract (limited to one per week)\r\n- Unlimited access to the microwave in the cafeteria to heat up your meals for lunch! (especially soups)\r\n-A salary of up to 10 $ above the minimum wage for a minimum of 45 hours of work per week.\r\n\r\n\n\n<p>Attached Below are the documents corresponding to the company's expectations with regard to the position to be promoted.</p>", "metacritic": null, "released": "2022-04-04", "tba": false, "updated": "2022-04-09T00:44:21", "background_image": "https://media.rawg.io/media/screenshots/b84/b841d8d9adc785ba527e0f89c1fd2e72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boneco01", "Hugo KIEFFER", "Bapt's", "Nescience"], "genres": ["Action"], "publishers": [], "esrb_rating": null}