{"id": 76755, "slug": "street-soccer-17-football-fan-club-pes-games-ed", "name": "Street Soccer 17 - Football Fan club pes games ed.", "name_original": "Street Soccer 17 - Football Fan club pes games ed.", "description": "The best Street Football Game for 2017 has arrived. Run, Shoot, Compete, Play and WIN..... All the realism and quality of this free soccer simulator game is to be the future stars.<br/><br/>There are four game modes.<br/>-Training: Train your team for playing fantastic Soccer matches.<br/>-Friendly Match: Select your team and play with other teams.<br/>-Knockout: Choose your team and beat other two competing teams to win the knockout round.<br/>-Tournament: Play football with 9 others nations and WIN the tournament by getting maximum points.<br/><br/>Take control of your team on the field during league games or tournament games. Starting with a rookie team, you’ll need to improve your players’ abilities to reach the top league and compete against the best teams in the world for the championship and the cup. You will enjoy this ultimate football game.<br/><br/>Salient Features:<br/>-Top 20 Soccer playing nations are added.<br/>-Four playing modes that is Training, Friendly, Knockout, Tournament are added.<br/>-Three different stadiums are added.<br/>-Smoother, realistic and optimized graphics for both players and perfect stadiums.<br/>-Cool 3d sounds.<br/>-Simple yet powerful touch controls with timing control. <br/>-Compete with your friends with the integrated world ranking leader board <br/><br/>Social:<br/>To keep yourself update about new features and games join our social pages (facebook).<br/>\u2028https://www.facebook.com/bulkysports<br/><br/>Feedback:<br/>If you have any suggested features or improvements please leave a comment, or send us an email at ask.bulkysports@gmail.com.", "metacritic": null, "released": "2015-04-15", "tba": false, "updated": "2019-10-22T14:24:19", "background_image": "https://media.rawg.io/media/screenshots/436/436a1e0914a84637a2034e8656da4f71_iIXE5C5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Simulation", "Sports"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}