{"id": 76798, "slug": "frecce-tricolori-fs-pro", "name": "Frecce Tricolori FS Pro", "name_original": "Frecce Tricolori FS Pro", "description": "Fly like a real pilot on the Italian aerobatic team FRECCE TRICOLORI.<br/>Try the aerobatic simulator of the officially licensed ITALIAN AIR FORCE AEROBATIC TEAM.<br/><br/>Thanks to an innovative piloting system, you can try all the stunts that made the FRECCE TRICOLORI famous around the world. With three game modes, you can experience the thrill of a real military pilot according to your skill. You think you're really an expert? Try the simulation mode and push your reflexes to the maximum!<br/><br/>MANEUVER: OFFICIAL AND SPECIAL FIGURES <br/>Discover all the secrets of the maneuvers with the 3D briefing, take complete control and steer with the right timing on the rudder pedals, chassis, and smoke trail release! Try two-seat flying training aboard the Italian MB339 PAN and make all the figures of the program: \" CUORE,\" \" APERTURA DELLA BOMBA,\" the new \" SCINTILLA\" and all the best of the PAN repertory.<br/><br/>Now you can enter inside the cockpit as solo and perform a \"LOOPING\" to familiarize yourself with your aircraft and then use all your adrenaline in increasingly challenging and complex maneuvers until flying in formation: \"CARDIOIDE\" “APOLLO 313\" and \"ARIZONA,\" are just a few examples of all the possible shapes that you will be called upon to perform, covering all roles of the real FRECCE TRICOLORI pilots.<br/><br/>AIRSHOW<br/>Plan your airshow, choose official stunts at will in faithfully reproduced scenarios: Rivolto (IT), RAF Fairford (UK), Terracina (IT) and Manerba del Garda (IT). Your ultimate goal is to complete all the performances, with maximum freedom of choice, for each movement you decide what role to play among 10 PONIES.<br/><br/>DESIGN<br/>Create your aerobatic figures! Freely position the aircrafts inside the scenario; decide whether to start with a low altitude flight or at high altitudes and then take control of the aircraft. Nose up, loop the loop, light a smoke trail, fly as you like, and when you're satisfied end the recording session. Get spectacular combinations that you can play as in Maneuver mode and relive with evocative shots of camera replays.<br/><br/>FLIGHT SIMULATOR<br/>Discover the REAL WORLD technology and start planning your flight!<br/>Access our GLOBAL navigation system and FLIGHT PLAN with more than 500 AIRPORTS, DAY &amp; NIGHT CYCLE, weather, and mapping with AIR SPACES and more than 8,000 WAYPOINTS.<br/>Come on board and fly with the Italian air force aircraft AERONAUTICA MILITARE ITALIANA.<br/><br/>EXPERIENCE, SCORES AND MEDALS<br/>The system tell how accurate you have been, try to get perfect at all stages of the maneuver for increase your score. Prove you are a TOP PILOT; try the 18 OFFICIAL FIGURES to win the AIRSHOW medal in every scenario!<br/><br/>PILOTS AND HANGARS<br/>Learn from pilots by looking through their files and explore the details of the aircraft inside the 3D hangar.<br/><br/>FEATURES:<br/>-Aircraft: MB339 PAN, EUROFIGHTER*, TORNADO*, F-104 STRAIGHTER* (historical aircraft)<br/>-Innovative formation flying and assisted steering system<br/>-All the official figures of the FRECCE TRICOLORI; played in various roles<br/>-All configurations: ROMBO, PIRAMIDONE, CIGNO, CALICE etc<br/>-SPECIAL MANEUVERS: Immelmann turn, Cuban Eight, Split-S etc<br/>-AIRSHOW: Complete a real performance with a custom sequence of maneuvers<br/>-DESIGNS: Create your own custom acrobatic figure<br/>-FLIGHT SIMULATOR with WORLDWIDE TERRAIN and NAVIGATION SYSTEM *<br/>-FLIGHT PLAN, TAKEOFF, LANDING, RANDOM FLIGHT *<br/>-Realistic weather conditions with wind, rain, snow and lightning, and timetable selection<br/>-3D Virtual Cockpit with integrated instrumentation, rain/snow effect and other 6 game visuals<br/>-REAL 3D HD TECHNOLOGY Scenarios<br/>-3D Briefing display for easy understanding of the maneuver<br/>-Innovative help system with three difficulty levels to suit both beginners and experienced pilots<br/>-Accurate trajectory measurement system for score evaluation<br/>-Best world performance rankings<br/>-Multi-camera replay with dynamic views<br/>-HANGAR with exploratory area<br/>-PAN Section meet pilots<br/><br/>* Content available through in-app purchases.", "metacritic": null, "released": "2016-11-11", "tba": false, "updated": "2019-07-29T23:33:31", "background_image": "https://media.rawg.io/media/screenshots/4c5/4c5c1cb17b7c9731799ee68f716b9c32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["RORTOS"], "genres": ["Simulation", "Racing"], "publishers": ["Rortos"], "esrb_rating": "Everyone 10+"}