{"id": 768059, "slug": "the-quantum-cat", "name": "The Quantum Cat", "name_original": "The Quantum Cat", "description": "Quantum Cat is a 2D hand-crafted side-scrolling platformer that takes players on a quest to help the cat Mr. Mustaches to come back home after it got lost on the quantic world. Playing Schrödinger's cat, the player must alternate between \"alive\" and \"dead\" to move forward through the quantum space and to avoid obstacles the size of an atom, helping Mr. Mustaches to find a way back to its owner. Players will indulge in a memorable adventure packed with addictive gameplay and challenging levels.<br/><br/><br/>After getting lost on the Quantic world, Mr. Mustaches discovers it's not dead, altought it's not exactly alive. Just like Schrödinger's cat, it's alive and dead at the same time. In order to reach the portal that can bring it back home, the clumsy cat will have to alternate between \"alive\" and \"dead\" to move forward through the quantum space and to avoid obstacles the size of an atom. While \"alive\", avoid black zones and obstacles, and while \"dead\", avoid white zones and obstacles. Can the player manage this new skills and help Mr. Mustaches reach the final portal?<br/><br/><br/>- A single-player adventure with a charming cat protagonist playing Schrödinger's cat;<br/>- An inventive new mechanic that brings even more challenge to classic precision platform games;<br/>- A touching narrative that range from Pet Abandonment to myths and facts about the Quantum physics;<br/>- Handcrafted retro experience ranged from the pixelated art, music, and classic platformer gameplay mixed with modern elements;<br/>- 20 levels of hardcore precision platforming challenges;<br/>- Colorful pixelated art, with handcrafted nostalgic levels; <br/>- Original Soundtrack;<br/>- Game collectibles and many achievement to unlock.<br/><br/><br/>And don't forget to join our Discord server to be up to date with the development of our games, meet the developers and have early access to screenshots, videos and demos of your future projects!", "metacritic": null, "released": "2022-04-08", "tba": false, "updated": "2022-04-11T03:26:26", "background_image": "https://media.rawg.io/media/screenshots/e26/e267a7f6678a0d17640cdf0e579ade3c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Delta Arcade"], "genres": ["Casual", "Indie"], "publishers": ["Delta Arcade"], "esrb_rating": null}