{"id": 768038, "slug": "mirror-spirits", "name": "Mirror Spirits", "name_original": "Mirror Spirits", "description": "<strong>MIRROR SPIRITS.</strong>, is a co-op story-based thriller game that can be played with 2-4 people. Do your best to clean the house connecting to the parallel universe. Escape. Attack. Clean the house before you die.<br/><br/><strong><h3>Subject - Brief Summary</h3></strong><br/>Some people living in the same neighborhood receive a dinner invitation message on their phone. When they go to the invited house, they cannot find anyone and the curious friends start to examine the house. With the onset of supernatural events, they realize that it is not a dinner invitation, but rather a summons to be sacrificed.<br/><br/><strong><h3>2-4 Player Online Co-Op</h3></strong><br/>Take control of the house for up to 4 people in this unique online co-op game where you must work together to thwart the sacrificing spirits.<br/><br/><strong><h3>Difficulty</h3></strong><br/>Enemy Difficulty: <strong>MIRROR SPIRITS.</strong> turns into a game with hard-to-kill enemies as the level progresses. Decide well which enemy to kill and which enemy to escape.<br/>Puzzle Difficulty: <strong>MIRROR SPIRITS.</strong> generally uses puzzles that anyone can understand and solve.<br/><br/><strong><h3>Enemies</h3></strong><br/><br/><strong>MIRROR SPIRITS.</strong> Decide well who is your enemy and who is your friend. Some enemies will appear in the guise of their exact friends, while others will appear in the worse appearance of their friends. The game offers 8 different enemy types and 3 different enemy features.<br/><br/><strong><h3>Weapons and Loot</h3></strong><br/>Weapon : <strong>MIRROR SPIRITS.</strong> uses 2 different types of weapons that you can damage enemies. One is a pistol and the other is a rifle.<br/>Loot : Medicine to maintain your mental health, you need to loot to replenish your ammo. These are available in limited numbers in certain areas of the map. You have to spend your bullets carefully and take care of your mental health.<br/><br/><strong><h3>Puzzles</h3></strong><br/><strong>MIRROR SPIRITS.</strong> creates different puzzles for you to progress through the story and find equipment for your weapons. Each puzzle has a reward for you to progress in the game.", "metacritic": null, "released": "2022-04-09", "tba": false, "updated": "2022-04-11T03:01:44", "background_image": "https://media.rawg.io/media/screenshots/b30/b30a3874ab2869d2895fbbc1046ad231.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mehmet Barış Yıldız"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mehmet Barış Yıldız"], "esrb_rating": null}