{"id": 768068, "slug": "happy-mining", "name": "Happy Mining", "name_original": "Happy Mining", "description": "<strong><h3>Happy Mining</h3></strong><br/><br/>Travel to the beautiful and colorful world of Sunny Island for relaxation and distraction found from everyday life.<br/>The motivating game mechanics will draw you into the cheerful universe of Happy Mining.<br/><br/><strong>Game world:</strong><br/><br/>The bright and friendly world of Sunny Island is a small open world that can be freely explored.<br/>In the course of the game you can find closed paths such as e.g. B. Unlock bridges and access to<br/>to get new materials.<br/>The goal of the game is the relaxed exploitation of resources in order to then use the yield to<br/>Enlarge and automate workplaces. The world also invites you to explore.<br/><br/><strong>Character / Skill system:</strong><br/><br/>At the beginning of your journey, create a character that you can customize.<br/>Gender, appearance and outfit are customizable from a wide range.<br/>Your character can also improve their skills by purchasing new skills such as the<br/>Increase in mining speed, mining efficiency, etc.<br/><br/><strong>Game mechanics:</strong><br/><br/>As a collector, you start mining different stones. The collected resources<br/>you can then sell at the merchant to get new tools, skills or area unlocks<br/>acquire.<br/>Expand your workplace by building a mine, forge, smelter and more<br/>Hire workers (NPC) to collect even more resources.<br/><br/><strong>Story / Secrets:</strong><br/><br/>The world of Happy Mining also contains a subtle backstory, but not in the<br/>foreground. As you explore the world, in addition to degradable materials, you will also get open ones<br/>to discover mysteries.", "metacritic": null, "released": "2022-04-08", "tba": false, "updated": "2022-04-11T03:36:30", "background_image": "https://media.rawg.io/media/screenshots/a5d/a5d76b19df0e71564f8ace27f727a6fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 359, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HAILIGHT STUDIO"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["HAILIGHT STUDIO"], "esrb_rating": null}