{"id": 768048, "slug": "silver-axe-the-honest-elf", "name": "Silver Axe - The Honest Elf", "name_original": "Silver Axe - The Honest Elf", "description": "Silver Axe -The Honest Elf-  is a classic 2D action game centered around Boss fights. Delve deep into the ancient fairytale forest, defeat dangerous Insomniac creatures, and embark on the journey to awaken the goddess.<br/><br/>Based on one of Aesop's Fables \"The Honest Woodman\", fight strong enemies one after another in a fabulous fairytale world, recover the golden heart of the goddess and unleash the hidden power of your Silver Axe.<br/><br/>Play as a free elf as you complete the quests given by the forest dwellers for additional help, like the weakness of your enemy, secret path for ambushing, or partners that fight alongside you.<br/><br/>Choose either to enlist the help of the forest dwellers, or be an arrogant elf and clear the path with ancient powers. The story unfolds depending on your choices.<br/><br/><strong>Game Features</strong><br/><br/><ul><li>Unique magic system, cast spells freely by combining four magic keys.<br/></li><li>Levels designed around Boss fights with continuous battle experience.<br/></li><li>A fairy tale adventure and interactions with cute and humorous creatures.<br/></li><li>Smooth and responsive control which puts your gaming skills to the test.<br/></li><li>Multiple story branches and multiple endings, awaken the goddess and explore the secret of the forest.</li></ul>", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-11T03:13:41", "background_image": "https://media.rawg.io/media/screenshots/348/348a4fbbfd359d77da4f405f19c59f86.jpg", "website": "https://www.facebook.com/theislandproduction", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Island Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Milk Bottle Studio"], "esrb_rating": null}