{"id": 76805, "slug": "pixel-zombie-escape", "name": "Pixel Zombie Escape", "name_original": "Pixel Zombie Escape", "description": "Pixel Zombie Escape is the latest game of Pixel Zombie Shoot Series. After experiencing the thrill of zombie swarm, Pixel Zombie Escape is to escape from pixel zombies and survive to the next level. When you're in a zombie swarm, not only escape but also try your best to destroy them. There are three power stations in the zone, when they are fully charged with energy, the gate of survival will be opened. Of course, you will have some \"helpers\" on the road, such as heavy machine gun Gatlin shooting rifles, as well as your best winning skill: Run. Make your way to your survival! Pixel Zombie Escape has 3D graphics for the best gaming experience. Don’t be fooled by pixel zombies’ cute looking, they are still coming for your brain. Pixel Zombie Escape also simplified the escape operation so that players can enjoy the game as much as possible. It's a battle of life and death. Only those who have the courage and wisdom will survive. Now, RUN!<br/><br/>***Features***<br/>- Cute and Exciting Zombie Escape Game –<br/>Entering the game, you will see a simple and familiar 3D pixel apocalyptic world. Running from cute but brain-eating pixel zombies, you will need to open the gate of survival to escape. To survive, running is not enough, try to find power stations and fix them. Once all power stations are fully charged with energy, the gate to life will open. When there are too many zombies to run from, pay attention to supplies on the road. There are various of supplies such as the Gatlin machine gun which shoot any closing zombies, or TNT bomb which will wipe out the zombie swarm at once. There are also plasma shield, frost bomb and so on. Use them properly and make your way to survival. <br/><br/>- Winning Skill: Run Run Run -<br/>Pixel Zombie Escape uses most simplified operation. Left hand to run, right hand to accelerate and dash. Show no fear, you can always run and escape from the zombie swarm. You can play around with zombies, you can outrun zombies, you can kill zombies, all but try not to be caught by zombies. There is no other good time to show off your magnificent operation. Feel the excitement of swoop in and out hundreds of zombies harmlessly and satisfyingly. Remember to take a break at the power station, it’s the key to escape. Never mind, feel free to indulge pacing around zombies, nuke zombies, freeze zombies, find your own favorite way to enjoy the game. Now run!<br/><br/>- Global Competitions –<br/>Here you can compete pass through with players around the world, who can become the ultimate master of escape, we wait and see!", "metacritic": null, "released": "2017-06-02", "tba": false, "updated": "2019-10-22T14:06:31", "background_image": "https://media.rawg.io/media/screenshots/4d4/4d484903664bf6c22fa18606f0e550c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hero Entertainment Co"], "genres": ["RPG"], "publishers": ["Hero Entertainment Co"], "esrb_rating": "Everyone 10+"}