{"id": 768062, "slug": "bones-cafe", "name": "Bone's Cafe", "name_original": "Bone's Cafe", "description": " <br/>Bone's Café is a fast paced cooking and restaurant management game. Follow the journey of Bones the necromancer as you grow and expand your cafe. Serve your customers with fresh locally sourced ingredients, design your own cafe layout, discover new recipes, customize your menu, and raise an undead army of kitchen assistants.<br/><br/><br/><strong>Discover!</strong><br/>Start discovering all (70+) recipes available using a wide variety of ingredients. All customers have different tastes, so you'll have to play around with your menu to attract everyone. Design your menu around a concept, a taste, or whatever you'd like your restaurant to serve.<br/><br/><br/><br/><strong>Build and expand!</strong><br/>Get creative and customize the layout of your cafe for maximum cooking efficiency. Earn money and visit the shop to buy all the tools you'll need to create an efficient workflow. Grow your kitchen and dining area by increasing your cafe ranking. <br/><br/><br/><strong>Play with friends!</strong><br/>You can invite up to 3 friends to enjoy this fun and silly game together (Local couch co-op).<br/><br/><br/><br/><strong>Hire Help!</strong><br/>Feeling overwhelmed? Put your necromancy skills to the test and summon some undead assistants. Assign them simple tasks to take the burden off of your skull, you're going to need them in order to expand your business.<br/>", "metacritic": null, "released": "2022-04-08", "tba": false, "updated": "2022-04-11T03:28:55", "background_image": "https://media.rawg.io/media/screenshots/206/206015fecd8238108181afd1308792e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 2, "playing": 1}, "playtime": 5, "achievements_count": 30, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Acute Owl Studio"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Acute Owl Studio"], "esrb_rating": null}