{"id": 76816, "slug": "car-driving-simulator-3d", "name": "Car Driving Simulator 3D", "name_original": "Car Driving Simulator 3D", "description": "Car Driving Parking Simulator 3D is the latest extreme stunt driving simulation and the best one right now, available right now for free!<br/>Do you feel the need for speed? Now you can and drive on the most crazy stunts you will ever see! Race, boost, drift, jump, crash super realistic sports cars in the all new and exciting extreme stunt driver's paradise!<br/><br/>Be the best super car stunt driver in the city. Forget using the brakes and boost your sports cars onto tons of unique stunts and obstacles to perform the world's best stunt actions. Choose from a wide selection of vehicles and drive anywhere in the city paradise. Experience realistic car damage by crashing into other cars and obstacles, do the biggest, fastest drifts, and gain top speeds to execute difficult stunts like the loop de loop!<br/><br/><br/>GAME FEATURES<br/>----------------------------------------------------------------------------------------------------------<br/><br/>- Full heads-up display and dynamic camera angles<br/>- The best car drifting physics<br/>- Realistic vehicle damage, see real bumps and scraps with every crash!!!<br/>- Go and explore our massively detailed open world city environment<br/>- Choose from a selection of high quality vehicles, from super cars to ambulances!<br/>- Easy to use driving controls, touch and tilt, and both left and right handed controls!", "metacritic": null, "released": "2016-09-22", "tba": false, "updated": "2019-10-22T14:06:31", "background_image": "https://media.rawg.io/media/screenshots/b3a/b3a082ec801e1a175e6a8e81a53eb763_hbhlIRc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["i6 media"], "genres": ["Simulation", "Arcade"], "publishers": ["i6 media"], "esrb_rating": "Everyone 10+"}