{"id": 768171, "slug": "the-apprentice-knight", "name": "The Apprentice Knight", "name_original": "The Apprentice Knight", "description": "<p>The Apprentice Knight is an all-new souls-like adventure platformer. Where you take the young wizard apprentice Xander on a perilous adventure through the misty swamp, climb the steep cliff faces of Natsuevil Mountain, and enter the domain of Ramuh the Evil Sorcerer. On this journey, you will be collecting the pieces of the Sword of Galloway, a legendary sword and key that locked the evils of Arcania deep within the dark realm. Who has been stolen by the evil sorcerer, used to unlock the door to the dark realm, and then shattered and spread across the corners of the realm.<br/></p>\n<p>On your journey, you will have access to a plethora of spells that will help incinerate, obliterate, and push back the forces of evil. Including spells like your trusty fireball, a fiery spell that burns both enemy and vegetation to ash, or even your trusty earth pillar which launches you into the air to help you get to hard-to-reach locations, and has the ability to launch your enemies as well. Finally, we will have a handful of weapon options for Xander to use including both classics like Xander’s staff, his shield, and even more rare oddities like a pair of cestus known as THE BIG HAND. Maybe even one day you will wield the mighty Sword of Galloway, but who knows only time will tell. Every adventure starts with that great first step. Will you take it?\r\n</p>\n<p>FEATURES:</p>\n<ol><li>Magic Spellcasting \r\n</li><li>Dodge Rolling  (iframes)\r\n</li><li>Cell Shaded Environments\r\n</li><li> Melee combat system that makes for a dynamic duo with the magic system\r\n</li><li>An original story with three non-linear areas that will challenge players in unique ways.\r\n</li></ol>", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2022-04-11T04:45:57", "background_image": "https://media.rawg.io/media/screenshots/6ab/6abe91da30a461b6eb5ad87016cb9780.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ACartaya96"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}