{"id": 76810, "slug": "sea-stars-hd", "name": "Sea Stars HD", "name_original": "Sea Stars HD", "description": "Dash, dive, bounce, and blast through the dangerous deep blue sea!<br/><br/>Dante the Dolphin and his friends are leaping out of the sea and onto devices everywhere! Join the Sea Stars in a colorful, action-packed \"endless swimmer\" that'll keep you diving back in for more!<br/><br/>Simple one-touch controls are all you need to guide this adorable crew of characters through the depths of the sea! Collect as many Coins as you can while dodging angry Jellies, Sea Urchins, and Rocket Crabs. Dive deep to pick up speed, then leap into the air with a spectacular somersault to grab even more loot!<br/><br/>FEATURES:<br/><br/>· Swim as far as you can! Explore a cute, colorful world with simple yet challenging gameplay.<br/><br/>· One-touch controls! Tap and hold to dive; let go to swim up! Swerve around underwater obstacles or leap into the air and somersault over them!<br/><br/>· Collect all 12 Sea Stars – from Teeter the otter to Niji the narwhal – and discover their special abilities!<br/><br/>· Recruit Buddies to gain new powers: Dr. Scuttles the Crab will let you walk along the bottom of the sea, while Squinky the Squid lets you ink-blast into the sky!<br/><br/>· Unlock over 50 Pets that swim with you and help you collect Coins, recruit Buddies, and much more!<br/><br/>· Use awesome Items like Jelly Shield or Speed Blast to protect you from danger and bolt through hazardous waters!<br/><br/>· Discover and recruit Buddies to gain new swimming abilities – Dr. Scuttles the Crab will let you walk along the bottom of the sea, while Squinky the Squid lets you ink-blast into the sky!", "metacritic": null, "released": "2018-05-12", "tba": false, "updated": "2019-10-22T14:24:20", "background_image": "https://media.rawg.io/media/screenshots/0fe/0fe9a3c047a5c161b2ae1f917cdb9c17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PopReach"], "genres": ["Arcade", "Family"], "publishers": ["PopReach"], "esrb_rating": null}