{"id": 768389, "slug": "euphemia", "name": "Euphémia", "name_original": "Euphémia", "description": "<p>Welcome to the fantastic world of Euphemia! In this game, you play as Princess Euphemia, and escape your painful life at the castle.\r\n<br/></p>\n<p>You will travel the lands of the kingdom, facing terrifying slimes and reaping many treasures! The dynamic and engaging gameplay will allow you to relax peacefully, or face your friends by sharing your best score. Offering the craziest customization, Euphemia is the game of every moment.\r\n<br/></p>\n<p>This game is an Endless Runner. You can attack slimes and break barriers. When you collect an apple you earn a heart if you lost it, and when you collect a shield, you earn a shield heart. The golden apple is transforming you as a rainbow princess, who is invincible during a few times.\r\n</p>\n<p>Be careful because the trees and the rocks are very solid, so it will hurt you and removing you one heart, or even put the princess KO. The slimes are also dangerous, so, smash them !\r\n</p>\n<p>In the shop, you can buy scenes, which will change the environment (forest, desert, etc.), skins, which will change the appearance of Euphemia, and trails which will change the appearance of the trails when you are attacking.\r\n</p>\n<p>In the mission tab, you can find some missions to earn even more coins to buy all the skins you want.\r\n</p>\n<p>When you lose your game, you can share your best score with your friends !\r\n</p>", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2022-04-11T06:15:07", "background_image": "https://media.rawg.io/media/screenshots/3fc/3fc63b1b979b960930af710c2fa3fd0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HolsonCorp"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}