{"id": 768326, "slug": "candys-cafeteria-browser-edition", "name": "Candy's Cafeteria - Browser Edition", "name_original": "Candy's Cafeteria - Browser Edition", "description": "<p><strong>The game is available to download on Windows, Linux and Android too! See https://techwin.itch.io/candys-cafeteria.</strong></p>\n<p>There's this witch named \"Candy\", there are some rumours suggesting that she's a good witch, but her Cafeteria is haunted. She can help everyone with their feelings, this being done through a lemonade, \"Candy's Lemonade\". Another rumour is that whoever ends up in her Cafeteria will disappear, or (rarely) their dead bodies will be found in the forest. What happened to those who just simply disappeared? No one knows, but that's when you, the player, decides to find out. No one really approaches that region, because they're scared of it, but you aren't!\r\n#Credits\r\n- Everyone was credited at the end of the game, if I missed someone, please do tell me!\r\n#Notes\r\n</p>\n<p>- Copying, redistributing or reuploading this game anywhere without permission is strictly prohibited.\r\n</p>\n<p>- The game was made completely using free assets.\r\n</p>\n<p>\r\nP.S. - Originally, the game was supposed to be about Candy's Bakery, but I changed my mind as Candy's Cafeteria fit the story a bit better. If I should go back to Candy's Bakery, please do tell me!\r\n==SPOILERS==\r\n</p>\n<p>\r\n*FIRST ENDING*\r\nYou wake up at 2AM, you tried to fall asleep but you can't, so instead you decide to go outside for some fresh air, and perhaps try to find Candy's Cafeteria! You are feeling quite sad because you lost a pet that you loved, and now you're alone in this world.\r\n</p>\n<p>After you get close to the forest, you see a woman, she says her name is Candy, you found her! Or did you?\r\n</p>\n<p>She asks you if you'd like to come to her Cafeteria, but you aren't sure about it and are getting suspicious thanks to her excitement. You try to run but she hits you with something that didn't really hurt, but you still passed out. She brings you to the Cafeteria, apologizing for what happened and telling you that it's not safe out there, especially not after you met her. The player doesn't understand and keeps trying to run, making the situation much worse.\r\n</p>\n<p>\r\n*SECOND ENDING*\r\n</p>\n<p>It's the happy ending! Even if you lost a pet which was special to you, and you don't have anyone to spend time with or anyone that you could talk to, now you do! You've decided to stay with her after you found out what actually happened.  \r\n</p>\n<p>-I'm not going to tell you what happened though, play the game to find out!-\r\n</p>\n<p>*THIRD ENDING*\r\n</p>\n<p>It's another bad ending, like the first one, except this time the player dies. Candy gave you a gift, something that was alive, but you ate it and didn't wait to listen to what she had to say.\r\n</p>\n<p>(The used background, banner and cover image used on this itch.io page isn't owned or made by me, only being slightly edited, e.g. added text, filters...; the owners of these images have been credited in-game)\r\n</p>", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2022-04-11T05:48:03", "background_image": "https://media.rawg.io/media/screenshots/e65/e65ef400b1e04149f332411681d82589.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["techwin"], "genres": [], "publishers": [], "esrb_rating": null}