{"id": 768457, "slug": "curley-laboratory", "name": "Curley Laboratory", "name_original": "Curley Laboratory", "description": "<strong>Development.</strong><br/>This game only has One Level/Chapter to play currently.<br/>Game is Made in Unity3D &amp; MS Paint. <br/>Future Levels/Chapters will be in DLC.<br/><br/><br/><strong>Story.</strong><br/>The World is coming to an end. A Virus known as the \"Blue Leaf\" is causing a sickness to people, destroying everything and spreading fast.<br/>Soon a high end company called \"The Kebab Ladds\" strives to provide a cure. Scientists and engineers, develop a vaccine to save humankind. They created \"The Red Vine\".<br/>People form up in lines drastically. However adults can not use the vaccine as it causes side effects. Children on the other hand, have more mental path ways and low blood pressure which makes them suitable for testing.<br/><br/><strong>Characters.</strong><br/>Damien volunteers along side others to enter The Kebab Ladds company for the vaccine to help them with the world that's becoming hell. What everyone doesn't realise is that something else is also in the facility, deep down below playing a hand in this ordeal. <br/><br/>What's in it for Damian?<br/>What is the rule purpose?<br/>What is this facility hiding from the world?<br/><br/><strong>Design.</strong><br/>All Models, All Textures and All systems are done in MS Paint!!!<br/>A Cartoon horror Survival Game By - Kirley Games Team.<h3>(Creatures)</h3><br/>You are not alone. Anomalies are lurking around the facility looking for you. If caught by them, things can go wrong. <br/>So in other words...RUN.<h3>(Be careful of every corner)</h3><br/>It will be dark in every corner. Anomalies could be behind, Infront or even could be watching you.<br/>Always listen out for sounds from anywhere.<h3>(Use Items)</h3><br/>You can interact with items to find a way to escape. <br/>Batteries can be helpful to recharge your flashlight when in the dark.<h3>(Don't forget to Pat Slammy)</h3><br/>Their will be others roaming around the facility.<br/>Some can help you find ways to get into secret locations or unknown areas.", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2022-04-22T04:29:20", "background_image": "https://media.rawg.io/media/screenshots/3b5/3b5bdb39d0b2c60f4ede2bf9cb45afa9.jpg", "website": "https://kirleygames.itch.io/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KirleyGames", "Kirley Games"], "genres": ["Action", "Adventure", "Indie", "Puzzle"], "publishers": ["Kirley Games"], "esrb_rating": null}