{"id": 768540, "slug": "still-be-a-human", "name": "Still be a Human", "name_original": "Still be a Human", "description": "https://discord.gg/CbyF4Apz8M<br/><br/><strong>Still be a Human</strong> is an action roguelike with an emphasis on building artifact combinations. By choosing one of the characters, you descend from the top of the Tower of Shadows, on your way you will meet many enemies, the unique abilities of each of the heroes will help to fight them, and by placing the found artifacts in the abilities you will not leave a chance for the Cult of Shadows.<br/><br/><br/>3 characters:<br/><ul><li>Warrior - a melee master armed with a sword. Crushes enemies with piercing lunges, as if a whirlwind spins its sword and attracts distant enemies with a harpoon, leaving them no chance in a fight face to face.<br/><br/></li><li>The Ink Assassin is an agile and deadly master of throwing weapons. Shurikens, throwing daggers, and smoke bombs, combined with ink clones, allow him to dispatch enemies without them even touching him.<br/><br/></li><li>Mage - a great wizard who conquered the elements of the elements. Elemental combinations create fiery tornadoes, ice beams, lightning bolts and more. Competent combinations of different abilities will easily destroy even the strongest enemies.</li></ul><br/>30 types of weapons:<br/>A sword forged from volcanic magma, the blows of which create fiery explosions, a shuriken that creates copies of itself when it hits an enemy, or maybe a staff that releases a lot of bouncing beams?<br/>Who knows what might come in handy for the hero on his difficult journey from the top of the Tower of Shadows.<br/><br/>25 Artifacts:<br/>Abandoned and forgotten artifacts in the depths of the Tower, once they were objects of worship. Capable of creating black holes, fireballs, or healing badly wounded warriors, they were lost and forgotten for years to come. But who knows, maybe they will help you on your journey.<br/><br/>6 Feature Stones:<br/>Ordinary stones under the mysterious influence of the Tower received their unique properties. Survive a fatal blow, run away from a crowd of enemies, improve your skills with weapons, these fancy stones will help in all this, you just need to find the right one.<br/><br/>135 Ability Upgrades:<br/>In the process of descending from the top of the tower, the heroes are forced to improve their skills in exterminating enemies. The warrior, having sharpened the harpoon, will be able to pierce the enemies by pulling them all at once to him. The Ink Killer will tie multiple smoke bombs together to hit a lot more enemies. Having perfectly mastered the elements of the elements, the Mage creates several whirlwinds while simultaneously grinding the enemies caught between them.<br/><br/>Enemies:<br/>In the depths of the Tower, numerous, disfigured shadows of the Cult are waiting for you, once being people and even heroes, having become unwitting inhabitants of the Tower, they have completely lost their human appearance.<br/><br/>Bosses:<br/>Six cultists who sacrificed their bodies long ago to gain immortality as Shadows. But to complete the ritual, they lack the last, wandering shadow, which must find its own way, come to the Tower itself and give its life.<br/><br/>", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2023-02-28T16:59:52", "background_image": "https://media.rawg.io/media/screenshots/f77/f771168fbd6fed5136c0f2dd19969f76.jpg", "website": "https://vk.com/sirindiedev", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 18, "ratings_count": 1, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["SomethingIsntRight", "Something Isnt Right"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Something Isnt Right"], "esrb_rating": null}