{"id": 7685, "slug": "zip", "name": "Zip", "name_original": "Zip", "description": "When daring space cadet Zip and his trusty spaceship Alice get hit by a stray asteroid in a remote area of the galaxy, their adventures take an unfortunate turn. Help Zip run, fly, and dodge his way through dangerous sectors in a quest to power his spaceship and return home. But beware, not everything in this asteroid-laden region is what it seems…<br/><br/>A SPACE ADVENTURE UNLIKE ANY OTHER<br/>Explore 32 hand-crafted levels filled with grumbling aliens, menacing robots, steaming planets, booming explosions, and much more! With special boss encounters and an unfolding storyline to follow, there’s plenty of excitement in store.<br/><br/>UNIQUE PHYSICS-BASED GAMEPLAY<br/>There’s no up and down in space! Walk around planets with 360 degree freedom, then jump to another one as you advance towards your next checkpoint. With randomized gameplay, you have to keep a constant eye out on incoming dangers — or you’ll be sent flying into outer space. Unless you luck out, and end up landing on another planet…<br/><br/>AN AUDIO-VISUAL EXTRAVAGANZA<br/>With a cool “low-poly” retro look, and a pumping soundtrack to match, the adventure will be a treat to your eyes and ears. Parallax backgrounds, lighting effects, and smooth animations bring the world to life.<br/><br/>SIMPLE CONTROLS<br/>Take full control of Zip with ease. Just press-and-hold anywhere on the screen to move in that direction, then tap with two fingers or swipe up to launch your trusty rocket pack (you can also use the optional on-screen button controls). Zoom out to see what dangers lie ahead, master the effects of gravity, and learn how to deflect off planets.<br/><br/>ACHIEVEMENTS &amp;amp; LEADERBOARDS<br/>With Game Center achievements, you’ll have something extra to work towards. Collect scattered metal pieces to perfect levels and climb the leaderboards. Can you beat your friends’ scores?<br/><br/>100% INDEPENDENT SOFTWARE<br/>Created from pure love by three independent software developers, this game is guaranteed to contain no excess fat, additives, or smurfberries.<br/><br/><br/>SYSTEM REQUIREMENTS<br/>Recommended iPhone models: iPhone 4 • iPhone 4S • iPhone 5<br/>Recommended iPad models: All generations, including iPad mini<br/>Recommended iPod touch models: iPod touch 4th Gen • iPod touch 5th Gen<br/>iOS 4.3 or later required.<br/><br/>Universal application: works on all devices • Retina graphics • Game Center supported", "metacritic": null, "released": "2013-03-23", "tba": false, "updated": "2019-10-22T14:29:28", "background_image": "https://media.rawg.io/media/screenshots/65d/65d163aa81e5ed337e386e05d3228a11.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Martin Gimpl"], "genres": ["Action", "Adventure"], "publishers": ["Martin Gimpl"], "esrb_rating": "Everyone 10+"}