{"id": 76871, "slug": "baseball-megastar", "name": "Baseball Megastar", "name_original": "Baseball Megastar", "description": "Step up to the plate in Baseball Megastar as you take on the role of a rookie batter trying to make it big as a professional Baseball player.<br/><br/>Do you have the talent to progress from being a local hero, in the minors, into a legend in the Big League - becoming the ultimate Baseball Megastar.<br/><br/>Create your player, dig in at the plate, go on a hitting streak, get noticed by the major teams and follow the agony and ecstasy of a career in Baseball. <br/><br/>With easy pick-up-and-play tap and swipe controls, story led levels and stunning visuals this is a game that all Baseball fans can enjoy.<br/><br/>So, now's the time to step up to the plate and become a Megastar. Are you ready to play ball!<br/><br/>FEATURES<br/>- Pure Baseball fun.<br/><br/>- Game levels that follow your career, taking you from minors all the way to the major leagues.<br/><br/>- Upgrade your player’s gear to improve your performance.<br/><br/>- Simple and intuitive touch controls that are easy to learn, yet with depth for more expert players.<br/><br/>- High quality 3D visuals that provide an authentic and atmospheric experience.<br/><br/>IMPORTANT<br/>This game is free to play but does includes optional in-app purchases that may be bought with real money.<br/><br/>FIND US<br/>WEB: www.distinctivegames.com<br/>FACEBOOK: facebook.com/distinctivegames<br/>TWITTER: twitter.com/distinctivegame<br/>YOU TUBE: youtube.com/distinctivegame", "metacritic": null, "released": "2018-07-05", "tba": false, "updated": "2019-10-22T14:23:45", "background_image": "https://media.rawg.io/media/screenshots/5f0/5f0654f7aad3cecd42d1365fa0d0083b.jpg", "website": "http://www.distinctivegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Distinctive Games"], "genres": ["Action", "Sports"], "publishers": ["Distinctive Developments"], "esrb_rating": null}