{"id": 768781, "slug": "saint-seiya-rpg-asgard-chapter-v200-final", "name": "Saint Seiya RPG - Asgard Chapter v2.00 (Final)", "name_original": "Saint Seiya RPG - Asgard Chapter v2.00 (Final)", "description": "<p><strong>Sorry, this game in only available in portuguese. </strong><strong>¯\\_(ツ)_/¯</strong><br/></p>\n<p>Este é um jogo que eu desenvolvi na plataforma RPG Maker 2000 baseado na fase \"Asgard\" do anime \"Cavaleiros do Zodíaco\" (Saint Seiya) entre 2000 e 2003. É completamente freeware. Utilizei várias imagens e músicas, tanto do anime, quanto de outros jogos (principalmente da franquia \"Phantasy Star\", do Master System e Mega Drive). </p>\n<p><em>Sete guerreiros usando as lendárias \"Armaduras dos Deuses\" reuniram-se com Hilda, que é na Terra a representante de Odin, senhor de Asgard, no norte da Europa. Eles juraram destruir o Santuário de Athena. Quando Shido de Mizar surge, derrota Aldebaran de Touro no Santuário e depois vai para o Japão acabar com a vida de Saori Kido (Athena). Porém, Seiya e os outros Cavaleiros de Bronze surgem para protegê-las com suas novas armaduras de bronze, restauradas por Mu de Aries. Os Cavaleiros decidem ir até Asgard para investigar o que houve e descobrem que alguém colocou o Anel Nibelungo em Hilda. E para remover o Anel, eles precisam da lendária Espada Balmung, que só conseguirão se reunirem as sete Safiras de Odin, derrotando os sete Guerreiros Deuses. Enquanto isso Athena estará queimando seu Cosmo para impedir que os gelos nos polos derreta.</em></p>\n<p><strong><em>Este é um jogo feito de fã para fã, completamente freeware, sem nenhum propósito comercial. \"Saint Seiya\" é marca registrada da Toei Animation / Shueisha / Masami Kurumada. \"Phantasy Star\" é marca registrada da SEGA. Assim como as demais marcas registradas mencionadas pertencem aos seus respectivos autores.</em></strong></p>\n<p><strong>Obs.:</strong> Você não precisa ter o RPG Maker 2000 instalado, nem o pacote RTP, para executar este jogo. Ele é completamente independente e possui um instalador próprio.</p>\n<p><strong>Requisitos mínimos do sistema:</strong><br/></p>\n<ul><li>Pentium 166 MHz ou melhor (quer dizer, qualquer computador fabricado depois de 1998.\r\n</li><li>32 MB RAM.\r\n</li><li>Placa de vídeo Super VGA com 16-bit color.</li><li>10 MB de espaço livre no HD.</li><li>Windows 98 SE ou superior (também funciona no XP/Vista/7/8/8.1/10 e talvez no 11).</li><li>DirectX End-User Runtime 9.0c.</li><li>Algum navegador para visualizar o manual do jogo.</li></ul>", "metacritic": null, "released": "2022-04-09", "tba": false, "updated": "2022-04-11T09:02:05", "background_image": "https://media.rawg.io/media/screenshots/4dd/4dd3cd7cad835d45e38543ec08f1875f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Albert Viudes Dick"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}