{"id": 7687, "slug": "hank-hazard", "name": "Hank Hazard", "name_original": "Hank Hazard", "description": "App of the Day — Eurogamer<br/><br/>&amp;quot;Hank Hazard is definitely a game you’ll come back to play again and again, everything about it is great. 10/10&amp;quot; — App-Score<br/><br/>&amp;quot;Hank Hazard manages to lift itself above the anonymous crowd with some great design and a lot of fun&amp;quot; — PocketGamer, 8/10<br/><br/>&amp;quot;...who can resist a few hours entertainment for a single dollar, when it features puzzles, a wide-eyed hamster, and bombs.&amp;quot; — TouchArcade<br/><br/>&amp;quot;Put together, Hank Hazard is a fantastic physics puzzler. Amongst an App Store heaving with the genre, Hank Hazard stands tall, making it an unbeatable example.&amp;quot; — 148Apps, EDITOR&amp;#39;S CHOICE<br/><br/>&amp;quot;Hank Hazard has quality written all over it; the gameplay, the art style, everything, and you certainly won’t be disappointed if you’re in the market for an excellent new puzzle game.&amp;quot; — GodisaGeek<br/><br/>&amp;quot;Hank doesn’t hesitate when he’s racing down a ramp being chased by two bombs, and neither should you when downloading this game. Do it for Hank.&amp;quot; — Slide To Play<br/><br/>MUST HAVE AWARD — iReviewT<br/><br/>So you thought Evel Knievel was the last of the daredevils?<br/>Guide Hank, encased in his hamster ball, through increasingly challenging stunt courses while collecting stars and secret coins. Varied game mechanics and incredible level design make Hank Hazard: The Stunt Hamster a supreme arcade-puzzle experience.<br/><br/>• THERE’S A LITTLE HANK HAZARD IN ALL OF US…<br/>Live out your stuntman dreams from the safety of your sofa, fly over huge gaps, launch high into the air, get knocked around by spring-loaded boxing gloves and more.<br/><br/>• MORE STUNTS THAN YOU CAN SHAKE A STICK AT<br/>Guide Hank to the target in over 90 ingeniously designed levels requiring expert timing and logic. With 400 stars and secret golden nuts to collect, Hank Hazard will have you playing for hours!<br/><br/>• HE’S OK FOLKS!<br/>With its potent mix of addictive, challenging gameplay and a loveable mascot, Hank Hazard is the perfect marriage of arcade and puzzle gameplay. Things start off simple but soon you’ll be dodging fire pits and electrical fields intent on frying your furry friend!", "metacritic": null, "released": "2011-12-22", "tba": false, "updated": "2019-10-22T14:29:29", "background_image": "https://media.rawg.io/media/screenshots/132/1328a041bcf3d2bbaa679864361ab806_tFqwi9Q.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["游道易Yodo1"], "genres": ["Arcade", "Puzzle"], "publishers": ["Yodo1"], "esrb_rating": "Everyone 10+"}