{"id": 768718, "slug": "forest-of-the-lost", "name": "Forest Of The Lost", "name_original": "Forest Of The Lost", "description": "<p><em>The former king and queen were murdered in a plot to take over the throne. As the Heir's shadow, it is your responsibility to get the last survivor of the royal bloodline to safety and the only way to do that is to go through The Forest Of The Lost. You remember being told stories about how it came to be and about the people that reside inside of it, but mostly you remember that there are few that ever make it out alive.</em></p>\n<p><em>With The Thing that has been following you from the moment you first stepped into The Forest and the person you hired to guide you not caring about your lives, will you become another body lost to The Forest, a part of the many rumours that surround it, or will your mission succeed?</em>\n</p>\n<p><strong>This game is rated 18+ for:</strong> Violence, drugged like states , explicit depictions of gore, blood and death, corpses, drowning, body horror, starvation, mentions of rape - more can be added as the game progresses.</p>\n\n<ul><li>Play as male, female or non-binary<br/>\n</li><li>Make choices that will shape your path as well as your personality\r\n</li><li>Name your own eagle and let her help you on your journey.\r\n</li><li>Get to know the people of The Forest and uncover what really happened centuries ago,,,\r\n</li><li>Four RO’s to romance or form long lasting friendships with, all gender customizable\r\n</li><li>Succeed your mission, fail to get everyone to safety or maybe even walk a path you didn’t know existed</li></ul>\n\n<strong>The Watcher (m/f) - D </strong>\n<p>The person you hired to guide you through the forest. However, they are merely here to make sure you know its rules, would you be to break one...\r\n</p>\n<p>Colder than the Huohl mountains and terrifyingly efficient. They do not care about anyone but themselves, but regardless of their impatience, they are willing to teach you their ways. Can there be any warmth in those eyes or will this be the only side you’ll see of them?</p>\n<strong>The Heir (m/f) - Aeral von Cyneheard</strong>\n<p>The one you swore to protect and the reason for this journey. You’ve worked as their shadow for 10 years, will it be 10 more?\r\n</p>\n<p>Always adorned in bright colours and jewels, it’s strange to see them without it now. Don’t be fooled by their diplomatic words and honeyed smiles, they have a mind sharper than any blade you’ve ever held. You’d do well to listen to their advice.</p>\n<strong>The Confidant (m/f) - Judda</strong>\n<p>The heir’s right-hand person, they also happen to be your closest (only?) friend. You have worked alongside each other since the beginning, it’s no wonder they are coming with you on this journey.\r\n</p>\n<p>Known for their teasing and pranks, they are the pinnacle of a good time. However don’t cross the ones they care about, as even if they don’t know how to throw a proper punch, they are stupidly impulsive.</p>\n<strong>The Thing (m/f) - V</strong>\n<p>From the moment you stepped foot into The Forest they have been following you. Do they want something from you or are they just curious? Will you find out? The only thing you know is that they cannot be human...</p>\n\n<p>Tumblr: https://www.tumblr.com/blog/theforestofthelost</p>", "metacritic": null, "released": "2022-04-09", "tba": false, "updated": "2022-04-11T08:34:49", "background_image": "https://media.rawg.io/media/screenshots/b7f/b7f0de44fa474276b9f08065252aba37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["CroWoods"], "genres": [], "publishers": [], "esrb_rating": null}