{"id": 76889, "slug": "emergency-5", "name": "EMERGENCY 5", "name_original": "EMERGENCY 5", "description": "+++ Before you buy, expand this description and check the system requirements. You need an AMD or NVIDIA graphics to run the game, Intel graphics cards are not supported! +++<br/>Follow the how-to for a quick and easy requirements check on our support website: click \"EMERGENCY 5 Support\" on the right. <br/><br/>Act fast! – Rescue! Protect! Salvage! Extinguish! <br/><br/>There's no shortage of action in EMERGENCY 5.<br/><br/>You will direct tense rescue missions on four massive and detailed maps. To succeed, you gradually upgrade your fleet of vehicles and your relief units, and make sure that each unit is in the right place at the right time – if you've always wanted to be an officer in charge of directing fire brigades, the police, technical relief units and paramedics, you've come to the right place. Having the right strategy is essential in order to put a halt to the chaos. <br/><br/>Over the course of the extensive campaign, minor accidents alternate with complex major events, ensuring hours of gameplay. A co-op mode also lets up to four players solve special multiplayer events. <br/><br/>Game Features<br/> - Amazing graphics<br/> - Four different giant city maps <br/> - Ten major accidents in and over 50 free-to-play incidents will keep you in suspense<br/> - Fully control and coordinate all fire brigade, rescue, relief and police units<br/> - Join forces with other rescuers in multiplayer mode and provide support to each other as you combat threats<br/> - Provides all features of the Deluxe Edition including four maps and a historic rescue unit as a digital bonus<br/> - Extensions EMERGENCY 2016 and EMERGENCY 2017 are available as in-app purchases (the complete bundle with all content is available as separate app \"EMERGENCY 2017\" here in the store)<br/><br/>EMERGENCY 5 for Mac is the first Mac product of the successful EMERGENCY Game series.<br/><br/>Minimum system requirements:<br/> - macOS 10.11 „El Capitan“ or higher<br/> - 2.6 GHz Quad Core Intel i5 processor<br/> - 6 GB RAM<br/> - NVIDIA GeForce GT 650M or higher, or similar graphics card with 1 GB VRAM<br/> - No Intel graphics cards supported<br/> - 17 GB of free hard-disk space<br/><br/>Recommended system requirements:<br/> - macOS 10.12 „Sierra“<br/> - 3.5 GHz Quad-Core Intel i5 processor<br/> - 8 GB RAM<br/> - NVIDIA GeForce GTX 775M, AMD Radeon R9 M290X or higher<br/> - 17 GB of free hard-disk space<br/> - Broadband internet access<br/><br/>Notice:<br/> - Intel graphics cards are not supported!<br/> - We cannot answer questions in the App Store comments. Please contact our support in case of problems.", "metacritic": null, "released": "2015-11-25", "tba": false, "updated": "2019-10-22T14:06:35", "background_image": "https://media.rawg.io/media/screenshots/561/5612a12e199d6137a09b2e330f07ecb8.jpg", "website": "http://www.world-of-emergency.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 283, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS"], "developers": ["Promotion Software"], "genres": ["Strategy", "Simulation"], "publishers": ["Promotion Software"], "esrb_rating": null}