{"id": 7689, "slug": "rise-of-the-tomb-raider", "name": "Rise of the Tomb Raider", "name_original": "Rise of the Tomb Raider", "description": "<p>Rise of the Tomb Raider is the eleventh entry in the franchise, being a sequel to its predecessor, Tomb Raider, a reboot of the franchise. This story follows Lara Croft, one year after battling her supernatural experiences in Yamatai. This time she is trying to find the legendary city of Kitezh in Siberia, Russia. The legend behind the city begins in the 12th century and still comes nowadays, that this ancient city grants with a promise of immortality. While Lara tries to solve the mystery of Siberia, she encounters an organisation called Trinity. They want to retrieve this gift to themselves. Following the notes of her father, Lara tries to discover the secrets of the ancient city and stop Trinity in doing so.</p>\n<p>Exploring the Soviet motive, even more, the game has the DLC&#39;s - Baba Yaga, the Temple of the Witch, which follows Lara in the Soviet mine and confronting the legendary witch of Russian folk-tales, Cold Darkness Awakened, the story about a secret biological weapon and Blood Ties and Lara&#39;s Nightmare - a fight for ownership of the Croft estate. </p>\n<p>Besides craftmanship and exploring, the game focuses on a very progressive combat system giving a player a wide variety of strategic options. There is a way to evade your opponents in the bushes; stealth kills with bow and arrows or open combat with firearms like shotguns, pistols and other guns. WIth earning experience, you can give Lara new ways of encountering her enemies by three different specialisations - Hunter, Survivor or Brawler. Each skill tree offers various options of combat, for example using Lara&#39;s surroundings and fauna, traps or better aim. With these options, you can choose how to guide Lara Croft in her adventures.</p>", "metacritic": 86, "released": "2015-11-10", "tba": false, "updated": "2024-04-20T23:19:49", "background_image": "https://media.rawg.io/media/games/b45/b45575f34285f2c4479c9a5f719d972e.jpg", "website": "http://www.tombraider.com/us/", "rating": 4.04, "rating_top": 4, "added_by_status": {"yet": 653, "owned": 7401, "beaten": 2622, "toplay": 376, "dropped": 414, "playing": 155}, "playtime": 15, "achievements_count": 1119, "ratings_count": 2653, "suggestions_count": 668, "game_series_count": 22, "reviews_count": 2672, "platforms": ["Xbox One", "PC", "macOS", "PlayStation 4"], "developers": ["Feral Interactive", "Crystal Dynamics", "Nixxes"], "genres": ["Action"], "publishers": ["Square Enix", "Microsoft Studios", "Feral Interactive"], "esrb_rating": null}