{"id": 768912, "slug": "hyper-jump-kmcr", "name": "Hyper Jump (KMCR)", "name_original": "Hyper Jump (KMCR)", "description": "<p><strong>Description:</strong></p>\n<p>Hyper Jump is a 3rd person parkour game created by the Unity engine. The player plays as a cuboid who is jumping among constantly moving platforms. You need to collect coins while jumping and always be careful of the gaps under your feet. There are also moving enemies blocking your path on the platform, try to circumvent them or crush them with your superb jumping skills.  Death will bring you back to the beginning of the game, and you have to keep challenging yourself to reach the end - the blue crystal.</p>\n<p>When mentioned the Unity engine, my first reaction is the flash games I played on the web when I was young, so my inspiration also comes from them. In the limited time, I don't want to create a game that is too bulky or has too complicated mechanics, so I think the level-breaking type is the best choice. I took inspiration from Temple Run and some 2d platform parkour games then put their elements together. And finally, Hyper Jump is created.</p>\n<p>This is just a demo version, currently the game has only one level. I'll try to create more interesting and harder levels in the future if I get a chance. </p>\n<p><strong>Music source:</strong></p>\n<p>FREE Casual Game SFX Pack | Audio Sound FX | Unity Asset Store</p>\n<p>Free Music Tracks For Games | Audio Music | Unity Asset Store<br/></p>", "metacritic": null, "released": "2022-04-09", "tba": false, "updated": "2022-04-11T09:55:10", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e195d1d5203dcc58e5aee428335e4e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["KMCR"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}