{"id": 76915, "slug": "garfield-snack-time", "name": "Garfield Snack Time", "name_original": "Garfield Snack Time", "description": "Hate Mondays? Play Garfield: Snack Time - The brand new Puzzle Adventure featuring the hungriest hero of all time!<br/><br/>Don’t worry about the calories, eat all the Lasagna, Cookies, Cake and Ice Cream you want! Join Garfield and his friends in a scrumptious feast and delight your senses in this outrageous buffet! Enjoy yourself while connecting tasty lines of Snacks, the sweetest supply of combos, and release your inner puzzle foodie in this free Snack-venture NOW!<br/><br/>FEATURES: <br/>· Easy, fun &amp; addictive gameplay! Match and connect one tasty line of Snacks after another to unleash combos!<br/>· Explore Garfield’s world in 6 different game modes and over 1200 levels!<br/>· Challenge your friends! Who’s the best at defeating Garfield’s hunger?<br/>· Lots of funny Snacks and all the main Garfield characters! Meet the sweet Odie, the smart Arlene, the clumsy John, the cutest kitten Nermal and many more!<br/>· Loads of different game modes: defeat tasteless foods, collect Lasagnas and much, much more!<br/>· Endless fun with a new challenging Event every day!<br/><br/>Already played and enjoyed the game? Stay tuned for updates and drop us a review! Also, check out these sources for all the latest news:<br/><br/>https://www.facebook.com/GarfieldSnacktime/<br/><br/>Thank you for playing.", "metacritic": null, "released": "2018-04-06", "tba": false, "updated": "2019-10-22T14:33:40", "background_image": "https://media.rawg.io/media/screenshots/849/8499d5cbe47378dbc4da9f2577bf1a9f.jpg", "website": "http://www.promineostudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Grupo Promineo", "Promineo Studios"], "genres": ["Strategy", "Puzzle"], "publishers": ["Grupo Promineo"], "esrb_rating": "Everyone 10+"}