{"id": 76925, "slug": "soccer-games", "name": "Soccer Games", "name_original": "Soccer Games", "description": "Soccer Games is the original arcade soccer game, made for your iPhone!<br/><br/>Soccer Games features:<br/>- Play infinite times! Unlimited Lives, no waiting!<br/>- Take shots and try to hit top binz<br/>- Easy to play, HARD to master<br/>- Goalie improves every 5 levels<br/>- Fast games<br/>- Great HD graphics<br/>- Football shooting<br/>- Swipe to shoot<br/>- Curve shots mid air<br/>- Play offline (No Wi-Fi)<br/><br/><br/>This app contains Auto-Renewable Subscriptions that provides access to an ad-free experience and unlimited continues:<br/>• Pro Membership offered<br/>• 1 week Duration<br/>• Your subscription will be charged to your iTunes account at confirmation of purchase and will automatically renew (at the stated duration) unless auto-renew is turned off at least 24 hours before the end of the current period<br/>• Account will be charged for renewal within 24-hours prior to the end of the current period<br/>• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the Account Settings in iTunes after purchase<br/>• Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable<br/>• Privacy policy: http://www.puzzlecats.com/privacy-policy<br/>• Terms of use: http://www.puzzlecats.com/terms-of-use", "metacritic": null, "released": "2018-07-25", "tba": false, "updated": "2019-07-31T03:25:46", "background_image": "https://media.rawg.io/media/screenshots/b0f/b0fd1ee6f6a4b850542493cd904d3d51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Puzzle Cats"], "genres": ["Simulation", "Sports"], "publishers": ["Puzzle Cats"], "esrb_rating": "Everyone"}