{"id": 769397, "slug": "touch-some-grass-2", "name": "Touch Some Grass", "name_original": "Touch Some Grass", "description": "I complained on the internet, and someone told me to go touch some grass.  I went outside, but the graphics were terrible, and way too bright.  So I went back inside and made this game.  Now I can touch grass whenever I want, and if people tell me to go touch grass, I can prove that I already did - because I have an achievement that says so.<h3>KEY FEATURES</h3><ul><li> <strong>Prove You Touched Grass</strong> - Now, when someone tells you to go touch some grass, you can prove to them that you did.  You have an achievement that says so, and now they are essentially *required* to listen to you.<br/></li><li> <strong>Give the Gift of Touching Grass</strong> - Is someone complaining about ridiculous stuff on the internet?  Are they making crazy statements because of a video game?  Are basic concepts a little too difficult for them to comprehend?  Maybe they need the gift of touching some grass.  Grab an extra copy for them, and show that you care.<br/></li><li> <strong>Realistic Grass-Touching Experience</strong> - Grass reacts to every pat and stroke, flattening under the pressure of your hand.  Glorious visuals pair with dynamic audio feedback to provide the ultimate grass-touching experience.<br/></li><li> <strong>Pro Mode</strong> - Press \"P\" in-game to toggle \"Pro Mode\"!  Great for streaming!  Your viewers will *wish* they were touching some grass!  POGGERS!<br/></li><li> <strong>Leaderboards</strong> - Think you have what it takes to be a grass touching champion?  Find out how you compare with players from around the world, using our hyper-competitive leaderboard!  Only the strongest survive!</li></ul><br/><strong>TOUCH SOME GRASS</strong> is the pulse-pounding, edge-of-your-seat, hardcore, competitive experience you've always dreamed of.<br/><br/>How long can you touch some grass?", "metacritic": null, "released": "2022-04-11", "tba": false, "updated": "2023-01-26T13:21:08", "background_image": "https://media.rawg.io/media/screenshots/f58/f5874fd3c6a1be8634beb8a2db63e4ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "dropped": 1}, "playtime": 4, "achievements_count": 4, "ratings_count": 1, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["jpm_games"], "genres": ["Simulation", "Casual"], "publishers": ["jpm_games"], "esrb_rating": null}