{"id": 769391, "slug": "solitaire-jack-frost-winter-adventures-3", "name": "Solitaire Jack Frost Winter Adventures 3", "name_original": "Solitaire Jack Frost Winter Adventures 3", "description": "Good ol' Jack Frost continues his mission of giving the gift of joy and happiness to all around. This time he's chosen a little girl who forgot how to dream, promising to give her back her faith in magic, fairytales and adventure! Watch Jack and his frosty powers bring the Holiday spirit to life! Just for you he made 200 brand new winter layouts. Only true solitare experts can unfreeze all the cards and join in Jack Frost's merry fun!<br/>\n<br/>\r\nEnjoy classical solitaire improved with a new game mechanic – collect pairs of cards! A special multiplier increases your reward if you find card pairs quickly. Buy bonuses with your reward: mulligan, shuffle and joker. Choose your own difficulty level or complete the game twice – pro mode is a challenge to any true solitaire fan! The happy adventure is beginning with Solitaire Jack Frost!<br/>\n<br/>\r\n- A solitaire card game with winter layouts!<br/>\r\n- Entrancing gameplay!<br/>\r\n- Play for a few minutes or several hours in a row!<br/>\r\n- Collect bonus cards to get more coins and bonuses!<br/>\r\n- 12 locations, 120 levels to help you immerse yourself in an atmosphere of holiday cheer!<br/>\r\n- Original themed decks and 9 card backs!<br/>\r\n- Experience premium-quality graphics and an enchanting soundtrack!", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2022-04-15T03:28:27", "background_image": "https://media.rawg.io/media/screenshots/ae4/ae497bbe429ab29880e437a46df10bdf.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Somer Games"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}