{"id": 769310, "slug": "hidden-object-detective", "name": "Hidden Object: Detective", "name_original": "Hidden Object: Detective", "description": "<p>If you are an adventure lover and a seeker then undoubtedly, you have stopped at the right place. It’s our great pleasure to present Detective Harper on a Treasure Hunt- Hidden Object Game Offline, a brand new, most adventurous and thrilling game ever. Download this interesting game free of cost and play this addictive game without thinking about internet connectivity. But first of all, we have a couple of questions for you. Do you believe in tales of the cursed and doomed castle or house? Will you go to these places if you find out that these cursed places have hidden treasures and tonnes of jewels?\u2028<br/><br/>Detective Harper works for the government and ready to find this hidden treasure. Her\u2028Government officers ordered her for this mission and tell her to take help from someone\u2028who is more experienced in finding hidden objects and treasure. So why don’t you become an archaeologist and help her in finding that hidden and valuable treasure?\u2028<br/><br/><strong>How to Play Detective Harper on a Treasure Hunt- Hidden Object Game:-\u2028</strong><br/><br/>- Join Secret Detective Harper to investigate the crime scene.<br/>\u2028- Find Hidden Objects just by tapping on them.\u2028<br/>- By using ‘Zoom in’ feature, find ‘the hard to find’ objects.\u2028<br/>- Whenever you feel stuck in the scene using ‘Hints’.\u2028<br/>- Move the already zoomed picture to search for hidden artifacts.\u2028<br/>- Whenever you like to see the mystery scene again, Zoom the picture out.\u2028<br/>- Use these hidden objects for collecting evidence and solving puzzles.<br/>\u2028- Connect all these clues and find the real criminals.\u2028<br/><br/>Detective Harper on a Treasure Hunt- Hidden Object Game is going to be thebest Hidden Object Mystery game of 2021. Our game testers are in love with this game and the beautiful character of detective Harper. Well! We know that it is hard to believe. Then, experience it by yourself. Fasten your seatbelts and get ready to experience the doomed and cursed surroundings of the castle.<br/><br/><strong>Features you will get in Detective Harper on a Treasure Hunt- Hidden Object Game Offline:\u2028\u2028</strong><br/><br/>- Different Hidden Object scenes in Multiple Level.\u2028<br/>- More than 100000 Hidden Objects to find in the whole mysterious game.\u2028<br/>- The gorgeous and alluring character of Secret Detective Harper.\u2028<br/>- Picture search - for finding hidden objects quickly and easily.\u2028<br/>- Use HINTS to help yourself for searching the hidden objects.\u2028<br/>- Many levels with mysterious places full of hidden objects.\u2028<br/>- Fantastic game design that will leave you dumbstruck.\u2028<br/>- Picture search - for finding hidden objects quickly and easily.\u2028<br/>- Find the Difference – a game placed among the hidden objects.\u2028<br/>- Download Hidden Objects game for free.\u2028<br/><br/>Save the treasure from the pirates by helping Detective Harper and her team. Take your spyglasses out and follow the map to reach to the hidden and precious jewels. This Hidden object game is especially for adults, so show your concentration power and find out all the hidden objects within a minimum time period. Detective Harper on a Treasure Hunt- Hidden object games Free is also good for building up the vocabulary and sharpening the eyesight.<br/><br/>Download Detective Harper on a Treasure Hunt- Hidden Object Game Multi Level for free!!!\u2028<br/><br/>Get the addiction of playing this thrilling Hidden Object game and of course, enjoy the time with gorgeous yet talented Detective Harper. Grab the deal of playing Detective Harper on a Treasure Hunt- Hidden Object Game Offline for free and without an internet connection. Detective Harper is still waiting for you. Come and join her!!!</p>", "metacritic": null, "released": "2022-04-08", "tba": false, "updated": "2022-04-11T12:55:43", "background_image": "https://media.rawg.io/media/screenshots/8b4/8b441b70464dc3845aa33a233612a185.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Islasmeth"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}