{"id": 769335, "slug": "simba-the-cat", "name": "SIMBA THE CAT", "name_original": "SIMBA THE CAT", "description": "Simba the Cat will be able to drive a racing car, drive the Jeep, use the motocross and other racing motor bikes, ride a bicycle, ride the horse, fly with the space backpack in the infinite space, simba will also be able to swim underwater of the sea, use the ninja sword, you can also fly on the hoverboard there will be 30 different levels to visit with dimensional door, the game is a single player in third person and the character view can rotate 360 degrees, it's a platform/adventure. Simba can jump and pickup/collect the special or secret objects hidden in the maps game, Simba run to find all the golden chickens, Golden Croquettes, Golden Eggs , Golden Fish and Golden Cat Keys (that allow him to unlock the final boss level and unlock bonus levels).Simba in some levels will have to be careful of the dogs enemy, the dogs will have to be avoided otherwise simba will lose his life and you will start the level again, the levels are all different. The Final Boss Doggy will be waiting for you in the final level. To complete the whole game you will have to find all the golden objects ! The total percentage of the game to reach is 105%. You can play this game with Keyboard and mouse or with gamepad (for example Gamepad for Playstation 4 with tools DS4 Windows) The game has the auto save function, you can create your own game you have 3 different save blocks available. In this game, in some levels as an extra experience it will be possible to use the avatar of Salvo La Monica (creator of Simba The cat) and you can use the avatar of Francesca Vasques (mother of Salvo La Monica and Simba The Cat). This Video Game is Made with Unrel Engine 4: Simba The Cat ©  - I dedicate this game to my real cat Simba, he is die 31 march 2020, now Simba is a new 3d character, now he is a superhero and he will never die! Simba The Cat is created by Salvo La Monica Production ©", "metacritic": null, "released": "2022-04-08", "tba": false, "updated": "2022-06-24T04:03:13", "background_image": "https://media.rawg.io/media/screenshots/659/659bf2d90a66adda27058da84fa826d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Salvo la Monica"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["SLMPRODUCTION"], "esrb_rating": null}