{"id": 769388, "slug": "i-lost-my-luggage", "name": "I Lost My Luggage", "name_original": "I Lost My Luggage", "description": "I Lost My Luggage is a chaotic organization game, where you work in a lost and found facility. Organize the lost luggage in any way you like. Just make sure to remember where to find them when the forms describing them are printed out. As the game progresses, your inventive organization strategies will be tested against the accumulating chaos. You are accompanied by your work-from-home supervisor who facilitates hilarious story elements.<h3> </h3><br/>There's lots of forms:People lose their luggage a lot. They can fill in forms of their lost luggage, sending them directly to the printer in your office. The descriptions get more and more complex throughout the days.<h3> </h3><br/>And lots of luggage:New items come in three times a day, so they can pile up real fast. But don't worry, if you organize well, you'll be fine!<h3> </h3><br/>Match the forms with the correct item:If you drop the wrong item off, the conveyer belt will gladly give the item back to you. Feel free to try it again!<h3> </h3><br/>Organize the incoming forms:Organization is key, also when receiving a lot of forms. Organize them on the bulletin board or in a nice big pile. It's up to you!<h3> </h3><br/>Have some fun:Taking breaks improves your productivity. Hit a kobe or do something else to blow some steam off. Bill will be right there with you!", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-15T03:25:35", "background_image": "https://media.rawg.io/media/screenshots/99c/99c4736c5330d2556e27ea7d8cf674b3.jpg", "website": "https://www.ilostmyluggage.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Collision Games"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Collision Games"], "esrb_rating": null}