{"id": 769313, "slug": "hidden-object-haunted-resort", "name": "Hidden Object: Haunted Resort", "name_original": "Hidden Object: Haunted Resort", "description": "<p>Welcome to the Hidden Object Game free haunted resort! If you like hidden object games and you're ready to discover secrets in the haunted resort, you're at the right place!<br/><br/>Our free hidden objects game offers you a chance to find a hidden object and enjoy the wonders of the haunted resort. Play Hidden Object Mystery Game free and start the unforgettable adventure.<br/><br/>Can you solve the secret mystery of haunted resort? The hidden object seek and find games are waiting for you. Get ready for an incredible adventure in the mystery world and fall in love with beautiful new scenes of this Hidden object games free.<br/><br/><strong>Haunted House Secrets Hidden Objects Mystery Game features:</strong><br/>- Hidden object free games with 200 levels!<br/>- More than 1000 hidden objects to find in a haunted resort!<br/>- Multiple levels with mystery places full with hidden objects!<br/>- Magnificent graphics &amp; catchy sounds!<br/>- Find the hidden object from the menu below &amp; click on it!<br/>- Click on the magnifying glass button to use the hint for help!<br/>- Free of charge! No Internet connection required!<br/>- Find the Difference – a mini game to spot the difference!<br/>- Zoom out at any moment you like to see the mystery house again!<br/><br/>Search objects in this resort secret mystery hidden object game free and lurk through the haunted resort with no fear. If you enjoy playing mystery games and being a hidden object detective, it's time for you to solve some haunted resort mysteries! “Free hidden objects games” are the best hidden object mystery games!<br/><br/>Search objects in this haunted resort hidden object game free and lurk through the ghost town with no fear. Using the hints in the Haunted House Secrets Hidden Objects Mystery Game will help you find every item you cannot see.<br/><br/>So, download best Haunted House Secrets Hidden Object Game Offline for adults, hidden object mystery games for girls and boys for free.</p>", "metacritic": null, "released": "2022-04-08", "tba": false, "updated": "2022-04-11T12:57:11", "background_image": "https://media.rawg.io/media/screenshots/8db/8db0ae883051b384383212923c5e92e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Islasmeth"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}