{"id": 769458, "slug": "fuck-putin", "name": "FUCK PUTIN", "name_original": "FUCK PUTIN", "description": "FUCK PUTIN is a sandbox game based on making fun with the current president of Russia - Vladimir Putin. In FUCK PUTIN sky is the limit. Use the \"toys\" available in the game to make sure Putin is punished for the harm he has done to the Ukrainian people. Afterwards, don't forget to take some pics of him and share it with our community!<br/><br/><h3>PLAY MODE</h3>Sit back, relax and start having fun with Putin. Throw him to the walls or into the sky, piss on him, shoot him, do whatever you want. Use the in-game tools such as baseball, AK-47 or grenades to score points and help him knock his fucked up 'special military operation' ideas out of his head.<h3>SPAWN PUTIN</h3>Create an infinite number of Putins and play with them without limits. There are 6 Putin variations available in the game - Putin, Topless Putin, Big Titty Putin (super titty), Trans Putin, Black Putin and Putin Bear Slayer. Choose the ones that you like best and have fun.<h3> TOYS </h3>The best part of the game! Use the toys available in the game to create your own unique machine of endless suffering and agony for our beloved dictator. Choose from a wide range of torture tools such as sawblades, gallows, mines, giant hammers and others.<h3>PHOTO MODE</h3>A highly developed photo mode will help you get the perfect shot and allow you to edit every graphic aspect you can think of.<br/><br/><br/><br/><br/>✧･ﾟ: *✧･ﾟ:*   𝓟𝓻𝓲𝓬𝓮𝓵𝓮𝓼𝓼   *:･ﾟ✧*:･ﾟ✧<br/><br/><ul><li>Free to Play<br/></li><li>No Microtransactions<br/></li><li>No paid DLC's</li></ul><br/>Donate Ukrainians instead 💙💛", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2024-02-04T12:01:33", "background_image": "https://media.rawg.io/media/screenshots/354/3541f414fcc510f7d37a021094d29956.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "beaten": 1}, "playtime": 0, "achievements_count": 200, "ratings_count": 1, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["Tornado Games"], "genres": ["Simulation", "Indie"], "publishers": ["Tornado Games"], "esrb_rating": null}