{"id": 769468, "slug": "outcasts-of-dungeon", "name": "Outcasts of Dungeon", "name_original": "Outcasts of Dungeon", "description": "Outcasts of Dungeon is a third person fantasy action <br/>Being in the role of a powerful War Mage with dozens of deadly weapons and spells, defend your kingdom fortress from a rampaging mob of beastly invaders. <br/><br/>Battle enemies through a story-based campaign across multiple difficulty dungeon-like levels and upgrade your combat skills to match better your unique play style.<br/>Will you disintegrate ghouls with a powerful electric stream, pound scavengers flat with a sky falling rock spell, or freeze flying gargoyles and shatter them with a magic blast? No matter the weapons you choose, you’re sure the invaders will be crushed!<br/><br/>Features:<br/>-Procedurally generated dungeons – Twisting passages, long halls and wide-open chambers all need a war mage to clear them<br/>-Story-based Campaign – Fend off monsters across four acts to discover the mysterious power behind their relentless assaults<br/>-12 Unique Enemies – Including scavengers, ghouls, flying gargoyles, and of course, a whole bunch of ugly orcs<br/>-Multiple Weapons and Spells – From spear and sword to the magical power of the elements<br/>-Persistent Upgrades – Unlock improvements to your weapons and magic spells as you progress through the campaign<br/>-Outfit Usage – Light armor suits better for achieving, the best mobility and heavy armor for more defense potential<br/>-Scoring System and Leaderboard – Compete with your friends for the title of Master Outcaster!", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2022-04-15T05:01:23", "background_image": "https://media.rawg.io/media/screenshots/823/823fae13aadd7e1dc0bc6439e9e58aad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 353, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midnight Games"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Midnight Games"], "esrb_rating": null}