{"id": 769429, "slug": "uzo-2", "name": "UZO", "name_original": "UZO", "description": "UZO is a unique board game of logic and tactics.<br/>\r\nThe player is pitted against the computer.<br/>\r\nThe rules are simple but there is scope for deep tactical play.<br/>\r\nGames can last from two to twenty minutes.<br/>\n<br/>\r\nThis is a major evolution from traditional snakes and ladders. Where there was once only luck there is now logic and tactics. In UZO, the player(human or computer) who first manoeuvres their ring from one side of the board to the other is the winner. The tactical deployment of individual snakes and ladders enable players to influence the dynamics of play.<br/>\r\nThe UZO board's central grid of only 25 tiles gives a game with absolutely no slack ..... so from the moment play commences a winning situation is possible within as little as five moves(depending upon setup and a player's skill). The situation on the board can change very quickly and with it the balance of power. One mistake, one lapse of concentration and a player in the lead can suddenly find themselves losing. This is why individual games are often short and brutal, but also why a strong opening move(serve) is so important.<br/>\r\nUZO has a steep, but short learning curve. The best way to learn is by observing how the computer plays and following the in-game message display. Full game rules are available at the press of a button, as is the history board showing the last 14 moves played at any stage of the game. The player is notified if repetitive play occurs and advised to change tactics to avoid an impasse(draw). <br/>\r\nGames won are registered on a Tug-O-War score board. Whoever wins the Tug-O-War wins the match. <br/>\r\nThe player's skill is measured after each individual game(green stars) and as a continuous match average(gold stars).<br/>\r\nBut UZO is designed for casual/light play ....... there are no popups, no in-game purchases. Game performance is recorded and displayed only for the duration of a session so players don't get bogged down with scores. Game sessions are open-ended, which means any number of matches can be played at the player's convenience. <br/>\r\nMost players will be able to beat the AI, but it does of course require practice. <br/>\r\nFree updates in terms of AI and new skins will be forthcoming. An option allowing players to choose a more tournament style game session may well be introduced depending on demand.<br/>\r\nThe full rules are contained within the app.", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-15T04:13:44", "background_image": "https://media.rawg.io/media/screenshots/846/846c101bc7a03cf4bb1964692a3b0495.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nigel Gregory"], "genres": ["Indie"], "publishers": ["cavegames.uk"], "esrb_rating": null}