{"id": 76944, "slug": "indoor-soccer-futsal-2018", "name": "Indoor Soccer Futsal 2018", "name_original": "Indoor Soccer Futsal 2018", "description": "Indoor soccer is super fast soccer game in beautiful indoor arena. Download and enjoy the best free soccer game experience on your device with three unique replay angles.<br/><br/>Its five player format soccer game, players are super energetic. Take control of your team, challenge and win big matches against your opponent.<br/><br/>GAME PLAYING MODES WITH UNIQUE CHALLENGE:<br/>-Quick Match:<br/>Play different matches against national futsal teams, enjoy a long journey of your team career. Play wisely to score the best in each events to keep up your career line for qualifying in bigger europe leagues and championships.<br/> <br/>-Tournament: World Cup:<br/>Focus your team training to superstar status, made them irresistible for world cup. Compete against different futsal champions, change the game by smashing hard to score a  goal. Play different tournaments to earn world cup championship trophy.<br/><br/>AMAZING GRAPHICS AND SOUND EFFECTS:<br/>Now play the modernized art realistic 3D graphics for unique experience of indoor soccer in present-day behavior as you use to play with three unique replay angles.<br/><br/>GAME CONTROLS ARE SUPER EASY:<br/>- \"Pass button\" for pass and tackle.<br/>- \"Kick button\" for shoot the ball.<br/>- \"Direction Key\" to control the movement of the player.<br/><br/>CUSTOMIZE YOUR COUNTRY AND TEAM PLAYERS:<br/>Select the country you love and create your own star soccer squad, improve your players ultimate skills by increasing their kick, speed and power abilities. Choose different colors uniform for your team. Manage your team create best strikers, mid fielders, attackers and goal keepers. Show your love for the country as a hero team you like. <br/><br/>CHARMING SOCIAL FEATURES:<br/>Play daily and collect your daily prizes, replays, unlock different tournaments and leagues. Use leader board and qualifying screen to watch your achievements to track your career line.<br/><br/>JOIN ENDLESS INDOOR FUTSAL SOCCER:<br/>Be the king Champions of futsal soccer ever, best futsal soccer simulation game to learn soccer while playing anywhere on your smart phone. Best for every age of person who love soccer from kids to adults.<br/><br/>Start contesting your friends on single device and see who’s the best indoor footballer.<br/><br/>BEST INDOOR FUTSAL FIELD ENVIRONMENTS:<br/>Different indoor futsal fields distinctions for your better soccer practices. Crowd environments make you feel like you are playing indoor world cup and tournaments  in real. <br/><br/> Be Social For More:<br/>To keep yourself update about new features and games join our social pages.\u2028- https://www.facebook.com/bulkysports", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-10-22T14:06:38", "background_image": "https://media.rawg.io/media/screenshots/ee9/ee911bfdef0398bae9cff1ada61697d7_AneBbTr.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Simulation", "Sports"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}