{"id": 769420, "slug": "cursed-spire", "name": "Cursed Spire", "name_original": "Cursed Spire", "description": "<strong>Cursed Spire</strong> combines the best aspects of RPG and survival genres to offer a unique experience. Explore unknown islands, build a comfy house, fight or cooperate with other players to survive in a world full of mysteries and danger. It's up to you whether you want to become an archer, a soldier, or a mage. Discover lost artifacts to figure out all the secrets.<h3>Key Features:</h3><ul><li><strong>Seasons and Weather.</strong> Rain, fog, snow, and thunderstorm affect your character and gameplay.<br/></li><li><strong>Multiplayer.</strong> Play alone, with friends, or random people. Fight or work together towards your goal.<br/></li><li><strong>Combat Variety.</strong> Hundreds of weapons for your taste: swords, axes, spears, bows, crossbows, pistols. You can choose the one which fits your playstyle.<br/></li><li><strong>RPG Leveling and Progression.</strong> Advanced talents tree allows the player to make unique characters in each playthrough.<br/></li><li><strong>Building and Decorating.</strong> Every player needs a home. Build and customize it however you want.<br/></li><li><strong>Crafting</strong>. Find blueprints and learn how to make powerful weapons, tasty food, armor, furniture, or elixirs.<br/></li><li><strong>Story and Exploration</strong>. Complete quests to learn more about the world and figure out the secrets of mysterious islands.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-15T04:02:18", "background_image": "https://media.rawg.io/media/screenshots/077/0771fc298fcdbb0b3de946f878e47cef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Soulstices Developments"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Soulstices Developments"], "esrb_rating": null}