{"id": 769405, "slug": "seawolf-vr", "name": "SeaWolf VR", "name_original": "SeaWolf VR", "description": "Dive into the deep virtual waters and become a SeaWolf. Shoot your missiles and torpedoes at hostile submarines, minesweepers and tankers, actively avoid depth charges and enemy torpedoes, use defensive shield while trying to protect sea animals.<br/>\n<br/>\r\nThink strategically, manage your ammo wisely, don't take unnecessary risks and try to survive to the last level and achieve the maximum score! If you dodge enemy attacks and eliminate all the enemies, you can advance to the next level. Beware that if you fail and lose your last life, you return to the beginning of the game. <br/>\n<br/>\r\nContains 10 levels:<br/>\r\n- different difficulty, enviroments, attack formations<br/>\r\n- limited time and ammo<br/>\r\n- 3 lives for each level <br/>\n<br/>\n<br/>\r\nSeaWolf VR is easy to operate, suitable for all ages, perfect for VR cafes. Train your reflexes, attention, composure, accuracy and concentration, enjoy adrenaline fun or just soak up the atmosphere of the underwater world.<br/>\n<br/>\r\nThis is the first game of independent developer 3DA, creator of educational apps Hindenburg VR, Great Pyramid VR and Blue Flame VR.<br/>\r\nI plan to further develop and improve the game, I will appreciate all your ideas and suggestions! And if you like it, comment, share or shoot gameplay videos.<br/>\n<br/>\r\nInspired by a legendary shooter video game Sea Wolf by Midway, released in 1976.", "metacritic": null, "released": "2022-04-11", "tba": false, "updated": "2022-04-15T03:44:22", "background_image": "https://media.rawg.io/media/screenshots/522/522ef599406ea1a2434f7a119298b1b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Michal Bárta"], "genres": ["Action", "Casual", "Indie"], "publishers": ["3DA"], "esrb_rating": null}