{"id": 769474, "slug": "tribal-the-12-gates", "name": "TRIBAL \"The 12 Gates\"", "name_original": "TRIBAL \"The 12 Gates\"", "description": "<strong>TRIBAL is a Persistent Online Multiplayer 2D RTS/RPG</strong> where you take the role of Tribe Chieftain and lead your medieval tribe to global domination… or not. <br/><br/><strong>Access to the lands of TRIBAL are guarded by 12 powerful bosses</strong> that award a unique spell to any tribe that defeats them. Only Tribe Chieftains can learn and use these spells. <br/><br/><strong>You can pick from 6 different Tribe Chieftains each with unique spawn trees</strong>. Your tribe’s success depends on you and how you command and control them to grow and prosper.<br/><br/><strong>Recycle and Spawn Tribe Raid Teams</strong> on the fly and use them to conquer new lands and rid them of the Dark Lords and their minions that infest them. Each Raid Team has a different configuration and purpose. <br/><br/><strong>It’s a little bit micro and a little bit macro</strong>. You control everything your Tribe Chieftain does. You have to micromanage every step, strategy, and consequence. Once you spawn one or more Tribe Raid Teams the Game AI will macro-manage each team according to what you spawned them for.<br/><br/><strong>Grind and buy your way to destiny</strong>! You can save up gold and technology resources (yeah, like 100M) and pay for essential Tribe improvements and upgrades. You can level up by earning experience (and you earn experience for pretty much anything) and the bonus is… wait for it, your Tribe Raid Teams continue grinding away and gaining your Chieftain XP even when you are busy doing other things.<br/><br/><strong>The challenge continues even after defeating the 12 Gates</strong> – because each boss encounter gets harder (way harder) after the 12th Gate, and you can do it all over again in Tribal Evolved!<br/><br/><strong>Your tribe worships you and will perform their duties until death</strong>. Spawn different raid teams such as Combat (an aggressive team with a Tank and DPS to attack enemies); Defense (a mixed team that will hold steadfast until threatened); Conquest (a team of builders to quickly assemble structures for resource generation); Chaos (a team of destroyers that quickly raise enemy structures); Siege (a multi-purpose team to hold and defend a map you conquer); and Zen (a team of healers and clerics to protect you and your tribe).<br/><br/><strong>You do you, while your Raid Teams perform their duties even when you are not online</strong>. The Tribes of the 12 Gates including the Dark Lords and the bosses who rule them never sleep. They are always learning new things and preparing for your return (assuming you keep a server running when you’re not). <br/><br/><strong>Tribe Spellcasters can cast over 60 different spells</strong> and take on one of three roles, DPS, Healer, or Protection. Their roles are determined by the type of Raid Team you spawn.<br/><br/><strong>You’re going to need gold, and lots of it</strong>. The quickest way to bootstrap your economy and power up your Raid Teams is using Gold and Technology resources to research over 40 unique technologies and upgrades to give you the advantage.<br/><br/><strong>Tribe Builders can build over 100 different structures</strong> depending on the type of land available and the climate around them. You can let them build whatever they want or focus their efforts on a particular resource you need. <br/><br/>You can adventure alone (Single-Player), with your friends or larger groups on community servers (Custom Server) or on the main TRIBAL Multiplayer Server with up to 144 other tribes. Tribal is available on Windows and MAC OSX.<h3>So what’s the goal? </h3>Build your tribe. Conquer new lands. Enlighten your people. Get rich. Rejoice. Rule the world with an iron fist or gentle hand. Rush, turtle, explore, idle… the choice is yours. Defeat the bosses at the 12 Gates to gain access to new maps and higher levels. Help other tribes or crush them. Play alone or with the masses. But ultimately the goal is simple, survive and prosper.", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2022-04-15T05:08:18", "background_image": "https://media.rawg.io/media/screenshots/d00/d00b3bd5c0bd2008afb6be0b7019df98.jpg", "website": "https://tribal.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Tribal.Games"], "genres": ["Action", "RPG", "Strategy", "Simulation", "Massively Multiplayer"], "publishers": ["Digital Media One", "Clan Corrallo Studios"], "esrb_rating": null}