{"id": 76955, "slug": "car-mechanic-garage-3d", "name": "Car Mechanic Garage 3D", "name_original": "Car Mechanic Garage 3D", "description": "Love car mechanics garage games? Open own workshop garage and fix cars! Great job simulator! Diagnose problems, change parts and earn money! Fix the issues!<br/><br/>Build your dream muscle car with all latest four cylinder or V8 engine parts using top gear from tools kit. Show your extreme auto tuning skills and place piston,.<br/><br/>Car Mechanic Master 3D is a car repairing and car fixing game-play with perfect auto mechanic features. The newest in car engine maintenance, car painting and car modified game’s categories. Buckle up! And run your auto mechanic service station and fix the car in your special repair garage. A real carmaker in auto factory where car engine mechanic is considered all in all to perform repair car tasks at its auto workshop. <br/><br/>Do you want to be called as the best auto mechanic with perfect car repairing skills? If yes then then Car Mechanic Garage gives you this opportunity to gets hands on experience in auto repairing in your own car fixing workshop. You are going to perform different jobs in car mechanic garage i.e. engine repairing, car stickering, wheel changing, car paint jobing, car denting and car light fix ing using various car repair tools and equipment. <br/><br/>Realistic controls, detailed environment and multiple modification options makes this game a class apart.", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-10-22T14:06:39", "background_image": "https://media.rawg.io/media/screenshots/c50/c504902fc862a8b0130d528d13e4ee17_DghnKfZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zap Zap"], "genres": ["Simulation"], "publishers": ["Zap Zap"], "esrb_rating": "Everyone 10+"}