{"id": 76953, "slug": "elvenar-fantasy-kingdom", "name": "Elvenar - Fantasy Kingdom", "name_original": "Elvenar - Fantasy Kingdom", "description": "BUILD THE CITY OF YOUR DREAMS IN MAGICAL ELVENAR<br/><br/>Choose between elves and humans to build a beautiful, fantasy city. Discover a world of magic and mystery as you constantly build, develop and expand your realm. You decide how to advance your city as you gather resources, trade with other players and research ancient technologies. Whether you want to build a whimsical paradise or a well-organized metropolis, it’s easy to create a home for fantasy creatures and enjoy the detailed beauty of Elvenar.<br/><br/>CHOOSE YOUR RACE<br/>Play as powerful humans or magical elves to build as you see fit<br/><br/>START INSTANTLY<br/>City building is quick and easy with a friendly introduction and active community<br/><br/>EXPLORE THE WORLD<br/>Discover new provinces to expand your city<br/><br/>TRADE WITH FRIENDS<br/>Trade goods and resources with fellow players and merchants in the marketplace<br/><br/>ADVANCE YOUR CIVILIZATION<br/>Upgrade your buildings to supply your growing population<br/><br/>WELCOME NEW CREATURES<br/>Create a home for dwarves, fairies, dragons and other charming fantasy races<br/><br/>Elvenar is based on the successful browser city-builder, published by InnoGames. Now players can enjoy the online fantasy fun on mobile, tablet and PC browser – all from the same account. <br/><br/>Elvenar is free to download and install. However, some game features can also be purchased for real money. If you don’t want to use this feature, you can disable in-app purchases in your device’s settings. A network connection is also required.<br/><br/>General Terms and Conditions: https://legal.innogames.com/portal/en/agb<br/>Imprint: https://legal.innogames.com/portal/en/imprint", "metacritic": null, "released": "2017-11-01", "tba": false, "updated": "2019-07-29T23:32:52", "background_image": "https://media.rawg.io/media/screenshots/001/001ea540b6a553c85028ed57d16d84b8.jpg", "website": "https://www.elvenar.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["InnoGames"], "genres": ["Strategy", "Simulation"], "publishers": ["InnoGames"], "esrb_rating": null}