{"id": 76964, "slug": "mlb-home-run-derby-18", "name": "MLB Home Run Derby 18", "name_original": "MLB Home Run Derby 18", "description": "HOME RUN DERBY IS BACK!<br/><br/>The 2018 season is here, and Home Run Derby is back with more competition, more challenge and more dingers than ever before! <br/><br/>In MLB Home Run Derby 18, you can dominate in your very own Derby competition and swing for the fences against millions of players worldwide. <br/><br/>The only official Home Run Derby Game on the App Store presented by Major League Baseball and the MLBPA. Play genuine bracket-style timed rounds in Single Player Derby mode based on the official Derby format.<br/><br/>The Opening Day 2018 update adds a huge range of updates and improvements making Home Run Derby 18 better than ever before...<br/><br/>IMPROVE YOUR PLAYERS<br/>Earn packs and collect cards to unlock and improve your players. Upgrade your stats to be competitive at any level!<br/><br/>SLUGGERS AROUND THE LEAGUE<br/>We’re adding all new fan favorite players that have never been in the Derby before throughout the season. Players such as World Series MVP George Springer will be added periodically, and will be available for a limited time. <br/><br/>“HEADS UP” MULTIPLAYER:<br/>Multiplayer mode has been completely overhauled to be faster paced and more competitive!  This “heads up” style of play delivers faster, more intense, and more decisive multiplayer experience, with greater rewards than ever before.  Check it out today!<br/> <br/>ALL 30 MLB BALLPARKS!<br/>Now you can play in any of our latest parks including Progressive Field, Nationals Park, Tropicana Field, and even the 2009 Yankee Stadium.<br/> <br/>LEVEL YOUR GEAR!<br/>Every piece of gear can now be upgraded to keep you competitive!<br/> <br/>MORE REWARDS THAN EVER!<br/>Improved daily rewards and new daily tournaments offer more competitions and more upgrades!  New card packs are loaded with rewards at every level choose from:  Gold Pack (contains 54 cards, including at least 10 Rare and 3 Epic cards), Silver Pack (contains 30 cards, including at least 3 Rare cards) Bronze Pack (contains 12 cards), and special limited time only packs including the Home Run Derby 2017 Pack (contains 50 cards.) <br/><br/>AWARDS<br/>2016 Webby Awards Honoree for Games<br/>2016 &amp; 2015 Clio Sports Award Winner for Digital/Social Game<br/>2015 Appy Award Winner for Best Action/Arcade/Sports Game<br/>4.2+ App Rating*<br/><br/>-----------------------------<br/>Follow:<br/>https://twitter.com/HRDerbyGame<br/><br/>Like:<br/>https://www.facebook.com/hrderbygame/ <br/>-----------------------------<br/><br/><br/>", "metacritic": null, "released": "2013-05-06", "tba": false, "updated": "2019-10-22T14:36:38", "background_image": "https://media.rawg.io/media/screenshots/427/42709420f516246f756205191d235c44.jpg", "website": "http://mlb.mlb.com/mlb/fantasy/hr_derby/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["MLB", "MLB Advanced Media, L.P."], "genres": ["Simulation", "Sports"], "publishers": ["Major League Baseball Advanced Media"], "esrb_rating": null}