{"id": 770014, "slug": "multiverse-adventure", "name": "Multiverse Adventure", "name_original": "Multiverse Adventure", "description": "<p><strong>Overview</strong><br/></p>\n<p>Multiverse Adventure is a two-player racing and battle game. The game has two levels, each an obstacle race-course of a different kind – the first is a horizontal level and the second is a vertical one. In Level1, players race and fight with each other to reach the door to enter the next level. Enemies and obstacles along the way also damage their health. In level 2, players climb up the platforms and fight for the gem (Heart of Energy). Level2 also has trees of life, touching which replenishes the player’s health.\r\n</p>\n<p><strong>Characters</strong><br/></p>\n<ol><li>The Boy\r\n</li></ol>\n<p>This character is just a regular kid around the block who is in high school and gets trapped in the underworld of mysterious creatures (kind of like the Digimon cartoon). He gets special powers (like dragonball-z) to fight these creatures in the dark underworld. He can also upgrade his powers (not in this game though)\r\n</p>\n<ol><li>The Butterfly\r\n</li></ol>\n<p>The butterfly is the citizen in this universe. However, after an energy leakage which damaged the environment in this universe, the butterfly got mutated and grew a pair of legs. He was abandoned by his family and forced to go on an adventure to find a new home for himself, where he can be accepted and start a new life.\r\n</p>\n<ol><li>Rock Scientist\r\n</li></ol>\n<p>The rock scientist used to be a famous rock star. However, he eventually became a scientist because he found he had more passion for exploring the universe, and he kept his stylish haircut all the time. He disappeared during a space mission, and no one has been able to contact him since then.\r\n</p>\n<ol><li>Cyber Samurai\r\n</li></ol>\n<p>The Cyber Samurai is an ambitious half-robot who is eager for power. Her weapon is a combination of the lightsaber and the Japanese katana. When she gets hurt, it triggers a glitching animation because her system is also under attack.\r\n</p>\n\n<p><strong>Background Stories:</strong></p>\n<p>The scientist encountered an interstellar storm during a scientific expedition in outer space, so he got lost, ran out of fuel for his spaceship, and was trapped on a mysterious green planet. Here he met with a butterfly that had been living on the planet for her whole life. This butterfly was the only creature with wings on the planet, and she was very eager about the outside world.</p>\n<p>The scientist and the butterfly sometimes competed for resources and attacked each other, but usually, they worked together against the vicious dogs of hell and evil poisonous flowers and worked together to find the special door to leave the planet.\r\n</p>\n<p> \r\n</p>\n<p>However, when they thought they had found the door to leave the planet, they did not expect the door to not only change the space and time but also allow them to change into other people's bodies.\r\n</p>\n<p>The scientist became a high school student. (The scientist and the high school student were aliens to the planet they lived on)\r\n</p>\n<p>The butterfly became a cyber samurai. (The butterfly and cyber samurai were the natives of the planet they lived on)\r\n</p>\n<p> \r\n</p>\n<p>On this new planet, there was a Heart of Energy. Whoever got the Heart of Energy would be able to obtain the mysterious energy enrichment. On the way to find the Heart of Energy, there were many Life Trees, which were nourished by the Heart of Energy, so they had the magical ability to heal creatures.\r\n</p>\n<p>The cyber samurai had great ambitions. She did whatever it took to get the victory, even transforming herself into a semi-robot so she desperately wanted to get the Heart of Energy to become the strongest samurai in the world. The high school student wanted to return to the Earth to reunite with his parents and live a peaceful life. He needed to use the power of the Heart of Energy to go back home. They started a new round of fantasy adventures to fight for the Heart of Energy.\r\n</p>\n\n<p><strong>Development Process</strong><br/></p>\n<p>March 2 - characters\r\n</p>\n<p>Each of us designed our own character, and made them walk and idle.\r\n</p>\n<p>March 9 - motions and environment\r\n</p>\n<p>Each of us developed our character: we added jump, shoot, hurt, and die interaction. We also designed our environment with enemies and moving/falling platforms.\r\n</p>\n<p>March 23 - multiplayer game structure\r\n</p>\n<p>After Spring Break, we came together as a team and combined our characters in the same scene, as well as created the multiplayer inputs. We discussed our whole game structure, game story, interaction, and level design.\r\n</p>\n<p>March 30 - Prototype\r\n</p>\n<p>We improved our games into 2 levels: the horizontal level 1 and the vertical level 2. We decided to have only two players in one level because that’s more controllable for inputs. We added the opening scene, characters selection scene and the final scene, in order to make the game experience more accomplished.\r\n</p>\n<p>April 6 - Beta\r\n</p>\n<p>We did a playtest with our classmates and received lots of useful feedback. We made a list of suggestions and each of us picked several to fix based on our capabilities. \r\n</p>\n<p>April 13 - Final\r\n</p>\n<p>We made our presentation and shared our game. At the same time, we got some new feedback and figured out our future iterations.\r\n</p>\n\n<p><strong>Feedback</strong><br/></p>\n<p>1.\tSet Username input to differentiate two players\r\n</p>\n<p>2.\tClear instructions or guides to help players get into the game faster\r\n</p>\n<p>3.\tImprovements to the UI buttons\r\n</p>\n<p>4.\tAdding a cooldown to each skill so players can use more strategies\r\n</p>\n<p>5.\tOne more level to show more about the background story\r\n</p>\n<p>6.  More sound effects\r\n</p>\n<p><strong>Future revisions </strong>\n</p>\n<p>We would like the future revisions of the game to have power upgrades for the players as well as more shield upgrades to defend against opponent players’ attacks. Jump height upgrades also are a good option. Collecting diamonds/gold in the game allows purchasing these bonuses.  \r\n</p>\n<p>To increase adventure we can add more dangerous enemies that can move and also shoot. I also would like to add a few fatal obstacles like falling into spikes, poison, lava etc. that can kill the player in one shot.\r\n</p>\n<p>To connect the two levels, the winner in race one can earn his tag-team player in Level 2 a health boost of 10% as an advantage over their opponents. Added health can help you survive longer in the game.\r\n</p>\n<p><strong>Credit:</strong>\n</p>\n<p>Clint Bellanger, 2013,  Gem Icons, https://opengameart.org/content/gem-icons#\r\n</p>\n<p>Joshua Mclean - Mountain Trails, https://www.youtube.com/watch?v=L_OYo2RS8iU\r\n</p>\n<p>Sound effects: https://freesound.org/ \r\n</p>", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2022-04-15T09:21:03", "background_image": "https://media.rawg.io/media/screenshots/282/282732fbb7367bdf1cf00a33220b856a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["xcc_89"], "genres": [], "publishers": [], "esrb_rating": null}