{"id": 77000, "slug": "merge-home-city", "name": "Merge Home City", "name_original": "Merge Home City", "description": "Build your very own mega city in this incremental idle game with a unique puzzle twist!<br/><br/>Start by mixing and combining your houses and watch them grow into awesome buildings and towers. Fill your city with cool hotels, bungalows, condominiums, penthouses and parks.<br/>Each house can be merged with other houses of the same variety to form a bigger home. Every house built on the land will earn you money - the bigger the home, the more you will earn. The more you earn, the more houses you can purchase, and the more you can push the clock to develop faster. Use your spoils to discover new homes, and to expand into all new towns.<br/><br/>Game features:<br/>-Simple, intuitive and easy to use controls <br/>-Easy, addictive and very challenging <br/>-Fun to play and the best time pass as a leisure activity <br/>-Simple, intuitive and instinctive graphics and gameplay <br/>-Money , levels and Time to get you going<br/><br/>Collect profits and cash from your city even and buy more buildings from the shop. Complete challenging tasks, gain rewards and achievements. There is also a prestige feature to gain powerful bonuses.<br/><br/>If you are stuck in traffic, standing in lift, free in office or unable to sleep, this is the best leisure game activity you can have to pass your time in the most amazing and exciting way,<br/>Just start the game and help merge your home to get far as possible.<br/><br/>Succeed as mayor and a tycoon! Expand your small town to a mega metropolis!", "metacritic": null, "released": "2018-04-25", "tba": false, "updated": "2019-10-22T14:40:12", "background_image": "https://media.rawg.io/media/screenshots/40b/40b411386ae5014f312facab17b10351.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vacharachai Nuiklom"], "genres": ["Simulation", "Puzzle"], "publishers": ["Vacharachai Nuiklom"], "esrb_rating": null}