{"id": 770077, "slug": "conscience", "name": "Conscience", "name_original": "Conscience", "description": "You play as Conscience, the newest strand in a multi-galaxy hivemind dedicated to helping recently deceased biologicals. But your tasks seem arbitrary, and your boss seems suspicious. Is there really an objective morality? and if so, why are you the arbitrator of it? <br/><br/><strong>Uncover the mystery by sifting through the personal lives and tragedies of these alien beings.</strong><br/><strong>Xeno:</strong> A siliconoid popstar trying to give everyone a good time the only way they know how.<br/><strong>Kayi:</strong> A snailien, shy and hopeless after being ousted from her friend group. <br/><strong>Octavia:</strong> A hybrid doctor who fails to see the nuance of life.<br/><strong>Coliope:</strong> A xarnien smuggler struggling with their self worth.<br/><strong>Rodreck:</strong> A helien war veteran trying to make up for his past and reunite with his daughter. <br/><br/>you'll interact with more than just them of course, but the rest don't matter.  they aren't real <br/><br/><strong> Warning: </strong> this game is not suitable for children or those who are easily disturbed. it covers very heavy topics such as death, discrimination, and disassociation.<br/><br/><strong> play style and features <strong><br/>this game has a branching story line, which means that your choices effect future events. There are also several rng elements. Each chapter has an average of 5 endings, the finale game has 3 (not including secret endings). All of this is to encourage replay value, as it's easier to get the whole story after multiple play throughs.</strong></strong>", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2023-07-28T03:57:30", "background_image": "https://media.rawg.io/media/screenshots/c20/c20e380641917a89377029ffac4267b0.jpg", "website": "https://sites.google.com/view/ruined-closet-games/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["SarasotaPolytechStudios", "Ruined Closet Games"], "genres": ["RPG", "Indie", "Platformer"], "publishers": ["Ruined Closet Games"], "esrb_rating": null}