{"id": 770012, "slug": "affirmations-20", "name": "Affirmations 2.0", "name_original": "Affirmations 2.0", "description": "<p>A short game about Healing, Self-care and the Exploration of Community. </p>\n<p>Traverser sprawling levels, interact with journal prompts,  encounter unknown enemies and immerse yourself in the world of Affirmations!</p>\n<p>Negative thoughts plague the self-consciousness of Black, Indigenous, and people of color (BIPOC) and affect how we proceed through our days. Through my own struggle with this I developed a personal coping mechanism of visualizing and facilitating an encounter with both the negative and positive attributed versions of myself as a Black woman. </p>\n<p>Affirmations is the Visualization of these encounters. This project directly addresses the concerns of mental health perceptions in the traditionally underrepresented group of Black women and children by highlighting the contributing factors of internalized systemic oppression, and this project is grounded in the theoretical framework of pleasure activism and healing as community care work in order to resist neoliberalist perceptions of health as individualistic responsibilities. Creating Affirmations was a love letter to my self, my black community and all of the women who have nurtured and guide my growth. <br/></p>\n<p><strong>HOW TO PLAY</strong></p>\n<p>Traverse through all 4 level in Affirmations 2.0 completing mission objectives and exploring the levels for hidden events, but watch out for the negative thoughts that will be prowling the level!</p>\n<p><strong>CONTROLS</strong></p>\n<p>WASD: Move</p>\n<p>SPACE: Jump</p>\n<p>P: Pause Menu</p>\n<p>C: Cutscene</p>\n<p>ESC: To Exit Game </p>\n<p><strong>FEATURES</strong></p>\n<ul><li>4 Expansive levels with character interactions</li><li>Writing and journaling prompts to engage with</li><li>Running or choosing to interact with negative</li></ul>", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2022-04-15T09:20:26", "background_image": "https://media.rawg.io/media/screenshots/fdb/fdbce67b5c72e2e707bc55814cdc3a94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 245, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diamond E. B. Porter"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}