{"id": 770306, "slug": "speed-racing-itch", "name": "SPEED RACING (itch)", "name_original": "SPEED RACING (itch)", "description": "<p>SPEED RACING is a 3D car racing game made with unity. Currently, this is a single-player game. In the game, you will drive a muscle car to enjoy the fun of racing on a beautiful park track. Enjoy the game!</p>\n\n<p><strong>DESIGN THEORY AND PROCESS</strong></p>\n<p>Since I personally like racing games, in the initial settings and ideas of the game, I decided to make a simple but fun racing game. Whether a racing game is fun or not depends on several factors, such as the car model, track design, sound effects, and handling. Among them, the feeling of manipulation is a very important factor that I think affects the quality of racing games. So, when making the game, I spent a lot of time researching how to make a Car controller script that makes the handling and driving feel more like a real car. I adjusted the car setup data including max speed, brake force, racing grip, steering angles...etc. to make the car feel better and more realistic. After setting up the car, I added the virtual camera settings to the car, I adjusted the viewing angle of the control and made the viewing angle always follow the car.</p>\n<p>On the racing model, I use the muscle car as my player model. Because I think the muscle car will be more ornamental than the ordinary GT racing car in terms of the effect of turning and the movement state of the model, and there is a wobbly feeling. Muscle cars represent a kind of car culture, and I really like it. For the track, I use free assets from the Unity asset store. It's a great track, it has 7 corners in all. These corners are gentle enough for drifting maneuvers. How can a racing game lack a lap timer? I set the starting and ending reference points on the track, and then use the timer script to give the game timing and keep record functions.</p>\n<p> In the initial menu of the game, I added some racing elements, such as checkered flags. Make players know that this is a racing game as soon as they enter the game. The current version of the game's menu is still relatively simple, with only play and exit functions. I believe that more functions and settings will be added in future versions, such as racing selection, map select etc.</p>\n\n<p><strong>GAMEPLAY</strong></p>\n<p>The gameplay is to control the car to complete the track as fast as possible. And try to beat your fastest lap record. The car has a grip system, and players need to control the throttle to avoid losing control when turning. At the same time, the car has a drift function, and you can try to run your fastest time in any driving style.\r\n</p>\n\n<p><strong>KEY SETTING/GAME CONTROL</strong></p>\n<ul><li>Throttle/forward: W\r\n  </li><li>Back: S\r\n  </li><li>Turn left: A\r\n  </li><li>Turn right: D</li><li>Brakes: SPACE</li></ul>\n\n<p><strong>ASSET USED:</strong></p>\n<ul><li>Race track</li><li>PROMETEO: Car Controller</li></ul>", "metacritic": null, "released": "2022-04-12", "tba": false, "updated": "2022-04-15T11:23:42", "background_image": "https://media.rawg.io/media/screenshots/a98/a98ca0f4243bc656f737e3cbedc9db9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YuminWu"], "genres": [], "publishers": [], "esrb_rating": null}