{"id": 770376, "slug": "snapsquatch-sadmeme", "name": "SNAPSQUATCH (SadMeme)", "name_original": "SNAPSQUATCH (SadMeme)", "description": "<p><strong>SNAPSQUATCH</strong> is a local-multiplayer arcade action game where players compete to take the best wildlife photos in a setting inspired by Yellowstone National Park. The game will be simple enough to appeal to a broad audience, but deep enough to satisfy core action gamers.</p>\n<p><strong>Update for 0.6.0</strong><br/></p>\n<p>Detailed notes are available here.</p>\n<p>We have also prepared a list of supported controllers:</p>\n<p>PS4 and PS5 controllers with full haptic support.</p>\n<p>Xbox 360 Controllers (no haptics).</p>\n<p>Nintendo Switch Pro Controller (Blutooth only, no haptics).</p>\n<p>We plan on testing more Microsoft controllers ASAP, and adding haptics to those, and hopefully to the Nintendo controller as well.</p>\n<p><strong>UPDATE FOR 0.4.0</strong><br/></p>\n<p>Controllers now default to the dual stick world relative control scheme. Keyboard uses the arcade scheme still, with Q to wind.</p>\n<p>The wind mechanic is now enabled by default, and is performed by holding the wind button (Q or L1 / L2).</p>\n<p>We have done other changes as well, check out the patch notes!</p>\n<p><strong>UPDATE FOR 0.3.0</strong><br/></p>\n<p>There are now some new settings available on the ready screen for trying out new control schemes, as well as the new \"winding\" mechanic.</p>\n<p><strong>There are two new control schemes...</strong></p>\n<p>Both schemes currently only work on controller. You can still use the arcade scheme on keyboard.</p>\n<p>The world-relative 3D controls uses a dual-stick control style. Aim by pushing the right stick the way you want to aim, and push R1 or R2 to take your photo.</p>\n<p>The 3D dual stick scheme allows you to aim in 3D. Hold R1 or R2 or aim, then using the right stick while aiming to look around and find the perfect photo. This scheme controls in a console FPS style.</p>\n<p>Check out the screenshots section of this Itch to see controller diagrams.</p>\n<p><strong>New Winding Mechanic</strong><br/></p>\n<p>This mechanic can be enabled and disabled on the ready screen. When enabled, you will be required to wind your camera after every shot. Mash L1 or L2 // the Q key to wind your camera. You need to wind 3 times before you'll be able to take another photo. You should feel your controller vibrating when you wind.</p>\n<p><strong>Supported Controllers</strong></p>\n<p>PS4 and PS5 controllers with full haptic support.\r\n</p>\n<p>Xbox 360 Controllers (no haptics).\r\n</p>\n<p>Nintendo Switch Pro Controller (Blutooth only, no haptics).\r\n</p>\n<p>We plan on testing more Microsoft controllers ASAP, and adding haptics to those, and hopefully to the Nintendo controller as well.\r\n</p>\n\n<p><strong>General Playtest Instructions (from the first playtest):</strong></p>\n<p>To start the game, click through to the Ready page. Each player should hit start // enter to join the game. PhotoShootOut supports 1-4 players currently. Once everyone is signed in, hit ready and the game will begin.</p>\n<p>Take as many great photos as you can before time runs out. You can hold two frames at a time, one is expended each time you take a photo. Once they're used up you need to return to the photo relay (where you started) to upload them and get two new frames.</p>\n<p>A good photo includes an animal doing an interesting behavior while not being too close or too far. It's better if the animal is facing you and centered in the photo. More animals increase the value of the photo. You don't want other players in your photo.</p>\n<p>Try photobombing other players to mess up their score.</p>\n<p>Move with left stick // WASD</p>\n<p>Take a photo with the north or west button or right trigger (R2) // enter key</p>\n<p>To aim hold the photo button, turn your character, and release to take a photo.</p>\n<p>Dash with the south or east button // space key or left shift key</p>\n<p>We're still working on the ability to play a second match within the client, and hope to have that working in a couple days. For now, please refresh the game window (on WebGL), or open and close the client on Windows to play again. Sorry for the inconvenience!</p>\n<p><strong>Bug Report Form:</strong><br/></p>\n<p><strong>https://forms.gle/TqbV7jPLbD8ug45o7</strong></p>\n<p><strong>Credits</strong><strong>:</strong><br/></p>\n<ul><li>Aaron Solon - Team Lead, Co-Producer, Technical Designer</li><li>Antonio Vasquez - Level Designer, Narrative Designer</li><li>Emma Christensen - 2D Artist, Concept Artist</li><li>Lia Fry - 3D Animator, 3D Artist</li><li>Xiao Ma - 3D Artist</li><li>Benjamin Person - UI/UX Designer, Programmer</li><li>Jonathon Moore - Programmer</li><li>Sadeem Boji - Co-Producer, Programmer</li></ul>\n<p><strong>Additional help from:</strong>\n</p>\n<ul><li>The Iron Galaxy Mentor Team</li><li>Dominic Vasquez - Composer</li><li>Gaby Bendtsen - Sound Designer</li></ul>", "metacritic": null, "released": "2022-04-12", "tba": false, "updated": "2022-04-15T11:53:17", "background_image": "https://media.rawg.io/media/screenshots/06d/06df71ce0fbe8ffa6961260bd9d18472.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SadMeme"], "genres": ["Action"], "publishers": [], "esrb_rating": null}