{"id": 770301, "slug": "mad-pentaworks-pentaworks", "name": "M.A.D. (Pentaworks) (Pentaworks)", "name_original": "M.A.D. (Pentaworks) (Pentaworks)", "description": "Link for our LDJam entry this game is based on\r\nDefend Fort Riot\r\n\r\n<p>You are a dictator and want to stay in power with all your might.\r\nYour people are dissatisfied and want to overthrow you. <strong>How long can you delay the inevitable?</strong> More and more rebels will attack your fortress. Sooner or later you <strong>will</strong> lose. Want to bet?  </p>\r\nDefend your fortress. (1)\r\n<p>If the fortress falls, you have lost.</p>\r\nUse the military (2)\r\n<p>The most versatile troops are in the military base. But be careful: If the military base falls, you lose your most efficient force.</p>\r\nUse the store (3)\r\n<p>Buy new troops or blockades in the store.\r\nYou will automatically get more money. After all, a dictator collects taxes.</p>\n\r\nShop\r\n\r\nPalace guard\r\n<p>The Swiss Guard works for you as a palace guard. They are your best unit. Unfortunately, the Swiss demand a lot of wages and are not the fastest...</p>\r\nPolice\r\n<p>The police units are fast, but unfortunately weak and perish quickly.</p>\r\nBlockade\r\n<p>Blockades are very cheap and can give you some breathing room. Unfortunately, you only hold off the rebels for a certain amount of time. \r\nAttention: Blockades can only be moved once.</p>\r\nArmy\r\n<p>The army is much stronger than the police, but unfortunately also slower. \r\nAttention: If the military base falls, you can't buy a new military unit.</p>\n\r\nShortcuts\r\n\r\n\r\n\r\n\r\nKey\r\nEffect\r\n\r\n\r\n\r\n\r\n<strong>q</strong>\r\nRun back to base \r\n\r\n\r\n<strong>s</strong>\r\nOpen shop   \r\n\r\n\r\n<strong>Space / ESC</strong>\r\nPause\r\n\r\n\r\n<strong>Ctrl / Shift + [1-0]</strong>\r\nAssign selected troop to the number\r\n\r\n\r\n<strong>[1-0]</strong>\r\nSelect the assigned troop\r\n\r\n\r\n<strong>Left click</strong>\r\nSelect / move selected troop (dragging the selected unit is also possible)\r\n\r\n\r\n\r\nGame Modes\r\n\r\nDefend Fort Riot\r\n<p>Default game mode, where you have to buy troops to defend your palace.\r\nThe game is over once the palace health reaches 0.</p>\r\nOther, hopefully also, fun game modes:\r\n<p><strong>1v1</strong>: Try to survive 1 vs 1. Good luck.</p>\n<p><strong>Doomsday</strong>: You have exactly one palace guard, which is indestructible, but unfortunately slow and there are far too many rebels coming at the same time. You have no change... </p>\n<p><strong>Instant Kill</strong>: This time you have an indestructible police unit. Rebels are wiped out immediately. At the beginning everything is relaxed. The few rebellions are quickly eliminated. Unfortunately, the rebels reorganize again and again. More and more are coming. How long can you delay the defeat? </p>\n<p><strong>Rebel Collect</strong>: You can't destroy the attackers. You have a police unit, but it is much too nice. The police simply take the rebels with them. But be careful, if you move away too fast, the rebels can escape again. Also, you can't collect an infinite number of rebels. Keep the attackers away from the fortress if possible, otherwise you have lost. </p>\n<p><strong>Push</strong>: Again, you only have one police unit. This one is very scary. The rebels are retreating. So you can't wound them. As soon as you move away, the rebels approach your seat of government again. It is hopeless...</p>", "metacritic": null, "released": "2022-04-12", "tba": false, "updated": "2022-04-15T11:21:28", "background_image": "https://media.rawg.io/media/screenshots/da0/da0d74d462da05102567b1deaed68082.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Pentaworks"], "genres": [], "publishers": [], "esrb_rating": null}