{"id": 770655, "slug": "loopdog", "name": "LoopDog", "name_original": "LoopDog", "description": "Welcome to LoopDog!\r\n<p>A game where you play as a dog that's trying to bite its own tail! *monch*</p>\n\r\nControls\r\n<p><strong>This game was designed to be played on mobile devices so I'm sure you'll find it more comfortable to use your mouse as if it was your finger. This is the recommended way of experiencing the game, but if you still want to use your keyboard, then please continue reading.</strong>\n</p>\n<p>The controls are explained inside the game, but basically:\r\n</p>\n<p>[WASD/Arrow Keys/Mouse Swipe] = Movement\r\n</p>\n<p>[R] = Restart Level\r\n</p>\n<p>[M] = Go to Main Menu \r\n</p>\n<p>[N] = Go to Next Level \r\n</p>\n<p>[T] = Toggle Camera View</p>\r\nMore about LoopDog\r\n<p>This game was created as an entry to the Black and White Jam 8. I challenged myself to design a game for mobile devices with support for WebGL; in the future, this game will have links to the App Store and Play Store so you can continue Looping on the go!</p>\n<p>I don't intend to make LoopDog a full-fledged game. It was more of a neat little experiment for me to try out the challenges of deploying for more than one platform (believe me, it was an interesting ride!) and have something that's easy to play and accessible to everyone.</p>\n<p>I hope you enjoy my game and have as much fun playing LoopDog as I had creating it for you!</p>\r\nMobile Store Links\r\n<p>Once the game becomes available on the Play Store and App Store, I'll make sure to put the links here :)</p>", "metacritic": null, "released": "2022-04-12", "tba": false, "updated": "2022-04-15T13:43:15", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9c07248aafb635e056ff1d8f69150c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zcyon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}