{"id": 770686, "slug": "moonfall-post-jam", "name": "Moonfall (Post-Jam)", "name_original": "Moonfall (Post-Jam)", "description": "Gameplay:\r\n<p>You have to select the moon and drag it around with the mouse, use the shadow instead of the moon to take care of the fires and don't stay too long in the same place, if the whole family dies it's Game Over!\r\n</p>\r\nStory:\r\n<p>The world has turned into chaos because the sun and the moon got out of their orbits, you as a god's apprentice have to help the earth before all turns into dust, your mission it's to protect as long as you can a family composed by : Molly (The mother), Billy (The father), and, the best character ever, Timmy (The son), while god takes care of the rest of the world. You have at your disposal a piece of the moon, which you can use to calm the fires, but be careful because if you stay a long time at the same spot you're gonna awake the dead!\r\n</p>\r\nFun facts:\r\n<p>This game is for the Trijam of April 11th, it took me more than 3 hours to complete it, mostly because of polishing and having to make all the resources (From music to art), but i'm happy that i acomplished my goal of finishing a game in less than one day (Also this is my first game using clickteam, hope you like it!) My highscore it's currently 3300 (Basically from 2500 upward it's kind of imposible) also it's canon that the whole family died because you focused too much on the score and less on protecting them so yeah</p>\r\nFixes:\r\n<p>This page it's basically to try repairing all the awful mistakes i commited with my submission, here are some fixes i made so far:</p>\n<ul><li>You can now drag properly the moon instead of the moon just centering the mouse, which can be used for achieving corners of the map</li><li>The shadow of the moon changes depending on your position</li><li>\"Fixed\" the highscore, it doesn't store your data anywhere but at least if you get a highscore while the program it's executing you'll get a  nice highscore message :-)</li><li>Fixed the Fullscreen not storing the user's configuration</li><li>Changed the score's font so that it's not clickteam's default counter font</li></ul>\r\nAdditions:\r\n<ul><li>You can now exit anytime ingame by pressing escape</li><li>Added a fullscreen button in the main menu</li><li>THE HTML 5 VERSION IT'S ALREADY HERE! YOU CAN NOW PLAY THE FULL GAME WITHOUT NEEDING TO DOWNLOAD!!</li></ul>\r\nFuture plans:\r\n<p>I personally consider that this project is finished and there will be no \"full version\", however,  if i find anything interesting to add, i'll update this page with the changes (Hope to see you soon!)</p>", "metacritic": null, "released": "2022-04-12", "tba": false, "updated": "2022-04-15T13:58:31", "background_image": "https://media.rawg.io/media/screenshots/8c3/8c3a44180fa23d5a3ff3fd1b2889d7ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Relatif"], "genres": [], "publishers": [], "esrb_rating": null}