{"id": 770768, "slug": "orbit-defender-itch-rthurmed", "name": "Orbit Defender (itch) (rthurmed)", "name_original": "Orbit Defender (itch) (rthurmed)", "description": "OrbitDefender\r\nLoop around your base defending from enemies\r\n\r\n<p>This game was created for Black and White Jam #8\r\n</p>\n<p>Instructions</p>\n<p>Shoot the enemies that attack the base and the asteroid that can hit it. You only move in loops around the base. Bonus are generated by the base every 24 seconds. Enemies can also drop bonus when killed.\r\n</p>\r\nkeyactionesc, p\r\npause\r\nz\r\nshoot\r\nx\r\nturn around\r\nc\r\nthrow bomb\r\nv\r\nbuild turret\r\n↑\r\ngo up\r\n↓\r\ngo down\r\n\r\n<p>Lore</p>\n<p>The year is 3022. Humanity has spreaded through out the galaxy in search of a new planets to live. As a way of producing cheap energy to power all the ships and keep the expansion, the Galactic Federation leaders have signed a secret contract with Dark Energy Inc, a energy mega-corporation.\r\n</p>\n<p>The plan was to artificially create a black hole and extract its gravitational energy. This was set to be build on top of star system #80, a poor mining-focused system on the edge of the galaxy. All people and animals living there will be killed by the explosion used to build the black hole. The rumor of the construction has raised groups of people to fight against this plan.\r\n</p>\n<p>You are Lieutenant Evan, born in the star system #80 and member of the Force of Intergalactic Liberation. You and your friends are several months fighting against Dark Energy Inc and you are losing the war.\r\n</p>\n<p>After a stealth mission you and 2 other pilots managed to steal documents that prove the plan. Your only chance is to transmit the documents to ally bases and spread to as many people possible. To do so you must protect the last standing base while enemy ships are attacking it. Good luck pilot! You are the last hope of system #80.\r\n</p>\n<p>Credits</p>\n<p>Sound effects were made by OwlishMedia: 8-Bit Sound Effect Pack\r\n</p>\n<p>Programming, art and everything by @rthurmed.\r\n</p>\n<p>This project was made with Godot Game Engine (v3.4.4).\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-04-12", "tba": false, "updated": "2022-04-15T14:31:46", "background_image": "https://media.rawg.io/media/screenshots/b0e/b0e3232aec6f8051e0535726953142c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["rthurmed"], "genres": ["Action"], "publishers": [], "esrb_rating": null}