{"id": 77074, "slug": "fanatical-pro-basketball-2018", "name": "Fanatical PRO Basketball 2018", "name_original": "Fanatical PRO Basketball 2018", "description": "Do you love basketball games?<br/><br/>Try PRO basketball dunkers 2k18, its time to play basketball 3d simulation game. Take control of your team and defeat the world’s best teams. It’s time to manage your basketball team to play the world best Fanatical PRO Basketball 2018 &amp; world dunkers mania game as a pro club manager. PRO Basketball masters game will challenge you by providing different basketball flinging tasks. With different basketball goal modes, you need to practice shooting basketball into the hoop under different positions. Grab the ball, shoot from the downtown or perform master dunks, and rise to the challenge with fanatical star basketball match. Fling the ball and make amazing basketball shots. Dribble, shoot, score. Fanatical PRO Basketball 2018 &amp; world dunkers’ mania is an addictive game designed for basketball fans. <br/><br/><br/>Now enjoy the amazing &amp; Fanatical PRO Basketball 2018 &amp; world dunkers’ mania game. Prepare to experience the joy of playing best basketball game with real people. You need to score as many points as possible within the given time. There is a quick play mode where you just have to pick your team and the opponent team and enjoy the real simulation of this basketball game. Or you can play tournament with different teams throughout semifinal and final. Fanatical PRO Basketball 2018 &amp; world dunkers mania is a fast arcade basketball game where players are challenged to hit the target scores to move onto the next level and try to beat the highest score. This game provides two play modes. Quick play mode and career mode. You need to score as many points as possible within the given time. Pick the ball and flick it towards the hoop, try to reach the goal within time limit.<br/><br/><br/>Fanatical PRO Basketball 2018 &amp; world dunkers’ mania is an addictive game designed for basketball fans that simulates the realistic physics and features great graphics. In this game you will play real basketball matches with challenging rivals teams. There is a quick play mode where you just have enjoy the real simulation of basketball game and play tournament. Play Fanatical PRO Basketball 2018 &amp; world dunkers’ mania simulates the realistic and amazing graphics. Prepare yourself to experience the extreme fun of playing best basketball game with real stars. In direction to win the game you have to make best bouncy hoops, shoots, dunks in opponents bucket goal. Let’s try to target the hoop quickly, aim and shoot like a pro player into the goal. Quickly pass the ball, trickle down the court, and shoot to get in for the slam dunk. <br/><br/>How to Play: <br/>You need to score as many points as possible within the given time. Dunk a ball and score a three-pointer or a jump shot in this basketball game before the time runs out. Block your opponent's basket shot, dunk, and do counter attacks to score and win this awesome 3d basketball game.<br/><br/><br/>Fanatical PRO Basketball 2018: World Dunkers Mania Game Features: <br/><br/>•\tBuild and manage your jam team<br/>•\tChoose your team among top 10+ basketball players<br/>•\tImprove your players by win matches to earn coins<br/>•\tSuper fun sports basketball simulator game <br/>•\tEnjoy different basketball game playing modes<br/>•\tTraining learn your basketball practice and dunk, dribble, shot, and hoops techniques<br/>•\tQuick play 2-on-2 action, friendly match between selected teams<br/>•\tWorld Tour, compete with the best jam teams of the world<br/>•\tTop fanatical basketball stars teams to win world cup<br/>•\tKnockout you have to win all 8 matches to be a knockout winner<br/>•\tLeague again play with the best teams. The team with higher score at the end will be the winner", "metacritic": null, "released": "2018-03-22", "tba": false, "updated": "2019-10-22T14:24:23", "background_image": "https://media.rawg.io/media/screenshots/419/4197b1a7088e5d5d56a8c2cb982c5177.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Simulation", "Sports"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}