{"id": 7709, "slug": "rpg-machine-knight", "name": "RPG Machine Knight", "name_original": "RPG Machine Knight", "description": "<p>NOW YOU CAN PLAY FOR FREE!<br />\nUSD5.99-&gt;FREE!!!<br />\nFor the world, and for its sin, a young man meets betrayal and friendship beyond the “gate”!<br />\n※ This game features some IAP content, such as powerful items and extra dungeons. While they require additional fees, you can play through the end of the game without it.<br />\n■Story<br />\nThrough the excesses of science, a “black sun” was created, leading to energy shortages. The world faced a certain doom.<br />\nAfter tremendous effort, scientists discovered a chance to save their world by acquiring an unknown energy source in another world beyond the “gate.&quot;<br />\nThe mission to research the new world fell to a young scientist named Frain, in Schutzheim. He threw his body into the “gate” alone.<br />\nThe other world was filled with nature and mystery, things he had never seen.<br />\nBut what really awaited him was treachery and betrayal, by his own world.<br />\nPeople were trampled by machine soldiers, chasers were everywhere, and monsters stood in every avenue of escape…<br />\nDespite these hardships, though, he found new companions who trusted and supported him.<br />\nAnother-world adventure fantasy RPG on an overwhelming scale!<br />\n■Adventure and deception, stretching into another world!<br />\nFor the sake of his world, a young man named Frain traveled to another. However he was betrayed by his own people.<br />\nThreatened by his own world, oppressed in the new world where he was trapped, lonely and hurt. But two heroines reached out their hands to this young man, and the story went on.<br />\nWhat’s is the truth behind the betrayal? Can Frain return to his world? What will happen between Frain and the two heroines?<br />\nThe adventure of betrayal and friendship will start, with great feeling and deception.<br />\n■Dot art work in a warm atmosphere<br />\nDot art work in expressive characters and monsters give the game a warm atmosphere<br />\nAnother world beyond the “gate” is colored with dot art work.<br />\n■A challenging game system<br />\nThis game system is filled with challenging elements, including the “Machina Board” system through which you can learn various jobs and skills, creating weapons by collecting materials, playing various sub quests, and challenging extra dungeons, as well as the main story!<br />\n■Who will you choose between the two heroines?<br />\nBell and Aulin are the two heroines who reach out their hands to the young man Frain.<br />\nThe generous sister Bell and the cheerful, spirited Aulin.<br />\nDuring the adventure, these two heroines show their different personalities.<br />\nWhich one will you choose?</p>\n<hr />\n<p>[ Get the latest information on deals and sales! ]<br />\nSubscribe to our Newsletter<br />\nhttp://kemcogame.com/c8QM<br />\nLike our Facebook page<br />\nhttp://www.facebook.com/kemco.global</p>\n<hr />\n<p>(C)2011-2012 KEMCO/Hit-Point</p>", "metacritic": null, "released": "2013-07-01", "tba": false, "updated": "2023-02-09T02:31:25", "background_image": "https://media.rawg.io/media/screenshots/c92/c923fe8bd52d2f0f346df09fae6b3f63.jpg", "website": "http://www.kemco.jp/3ds/mk/ja/pc/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo 3DS", "Android", "iOS"], "developers": ["KEMCO", "Kotobuki Solution Co", "Hit-Point Co."], "genres": ["Adventure", "RPG"], "publishers": ["KEMCO", "Kotobuki Solution Co"], "esrb_rating": "Everyone 10+"}