{"id": 77101, "slug": "football-kicks-title-race", "name": "Football Kicks: Title Race", "name_original": "Football Kicks: Title Race", "description": "Take a swipe at the Soccer season with Football Kicks Title Race! <br/><br/>Create and train your dream team to dominate match day, where YOU take all the shots at goal. From penalties to corners and crosses, your soccer skills coupled with your squad stats decide whether you go up or down in the league. As well as all of this you can play Live Soccer with our brand new LIVE GAMES mode.<br/><br/>Score against real players in Live Games and decide if your team wins the tournament by scoring the most points. Show you’re a true fan of this beautiful sport by supporting your team on Facebook, or taunting the losers!<br/><br/>Train your players to create your fantasy team, build amazing stadiums and hit the Transfer deadline for the best soccer players on the world TRANSFER MARKET all with the tap of a button.<br/><br/>With a weekly FREE PRACTICE championship, stunning graphics and mini games, Football Kicks: Title Race is the premier soccer management and flick soccer game.<br/><br/>For more soccer banter, FREE gold and competitions, join us on Facebook.com/fktitlerace. You can also tweet us @distinctivegame with #titlerace<br/><br/>--------------------------------<br/><br/>If you like Football Kicks: Title Race, please check our other soccer games: Football Kicks and Football Kicks Frenzy!", "metacritic": null, "released": "2014-01-15", "tba": false, "updated": "2019-07-30T14:16:07", "background_image": "https://media.rawg.io/media/screenshots/e98/e98f657a7828f1a3d241ef8bd78660ee.jpg", "website": "http://www.distinctivegames.com/games/item/football-kicks-title-race", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Distinctive Games"], "genres": ["Strategy", "Sports"], "publishers": ["Distinctive Developments"], "esrb_rating": null}