{"id": 771008, "slug": "devour-shikharbind", "name": "Devour (ShikharBind)", "name_original": "Devour (ShikharBind)", "description": "<p>You are Germund, a farmer trying to make ends meet in the harsh medieval era. Your farmland is constantly ravaged by monsters who destroy and eat your livestock. One day you undergo a change, some divine creature has decided to help you. You can now weaponize your produce, whatever you eat, you will be able to make cannons of it and show those monsters who’s boss.</p>\n<p>For each level you will be able to view the incoming monsters in advance, and will have to put together a plate of assorted foods, all of them with different stats. You will devour them and charge into the oncoming waves of monsters. Beware, all foods have different uses, one might seem too expensive, but what the use of stashing up on bananas if they cannot damage the monsters fast enough.</p>\n<p>Some basic information to get you started:</p>\n<p>The atrributes on the fruits are Shooter, Piercing and Defence.</p>\n<p>Shooter - As the name suggests, once placed, the cannon will start shooting out the fruit and damaging the incoming enemies.</p>\n<p>Piercing - Shooting category fruits will only be able to damage the enemy that is at the front, where as Piercing fruits will damage the enemy across the entire lane.</p>\n<p>Defence - These fruits serve the purpose of stalling the enemy, they can be placed down as a sort of damage absorber, as a tank so to say.</p>\n\n<p>You might be tempted to take all bananas, but know this, the banana cannons might be efficient, but they take too long to kill the enemy. What if an enemy is on the brink of breaching your defenses? Maybe you can use some of the more expensive foods to quickly mow them down, at the cost of increased calorie count of course.</p>\n<p>To get some more information, click on the info button on the game's main screen. The player will be able to view detailed information about the fruits such as; damage per shot, number of shots, calories required, or some infromation about the monsters, such as their health, damage, and speed.</p>", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2022-04-15T16:29:45", "background_image": "https://media.rawg.io/media/screenshots/b6b/b6ba11e7b040aeb9025b4c5cfbccc711.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShikharBind"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}