{"id": 77112, "slug": "pro-soccer-challenges-2018", "name": "PRO Soccer Challenges 2018", "name_original": "PRO Soccer Challenges 2018", "description": "Pro soccer challenges 2018 &amp; world football stars is the best free kick shoot football 3d game on store. Feel of genuine football ground environment during soccer match and feel the heat of unlimited penalty kick challenges. Build the best soccer players squad and lead them all the way to win the soccer league tournament or football cup challenges. Also challenge the women soccer rivals of the world champion league. Escape from sudden attacks of ground bumpy hurdles, pass and dribble around opponents, take aim, shoot and goal. Split defenses with precise through balls, or bend shots into the top corner, putting you in control for an experience. It’s the last minute of the game and your opponent has the ball, but he’s lost it. What a chance to score as winner. You can also customize your soccer 18 dream hero experience by changing shirt, shorts, skin. Show off your style and score to defend your national star colors. Pro soccer challenges 2018 &amp; world football stars is the best mobile football soccer simulation game, smooth controls, realistic animations and ultimate actions. You can also control every player of your team through the easy joystick controls. <br/><br/><br/>Pro soccer challenges 2018 &amp; world football stars game is here, and it’s better than ever. Now let’s play against women world soccer rivals in this game to excite the football team lovers as the best team captain ever. Become the legend top scorer of the league championship in this thrilling &amp; adventurer world football tournament. Select top super star players to build your own real world football team. Lead your best soccer team players to the victory stand in this professional soccer leagues 2018 &amp; women football cup. Playing professional soccer leagues 2018 &amp; stars football cup more exciting &amp; latest mobile soccer 3d game. Contest in different soccer matches with different countries to be a legend player and take the cup to your home country club.<br/><br/><br/>Pro soccer challenges 2018 &amp; world football stars is the latest soccer game with amazing &amp; different challenges like 1-on-1 penalty kicks. Realistic passes, powerful shots in this football game will add an amazing football gameplay experience. Unite your football team stars with the spirit of, as they are finest football club’s stars. The opponent women soccer team players will shoot the ball, dribble, and kick the penalties only to win. Declare yourself as a top goal scorer of the soccer league final match in real competition style, challenge your opponents from all over the world. Now this is your chance to build the best soccer team in the world. The realistic graphics and sound effect for football player, football field, and stadiums will make the football match come to life on your screen during games. <br/><br/><br/>PRO Soccer Challenges 2018 - World Football Stars Game Features: <br/><br/><br/>•\tIncredible &amp; unlimited soccer challenges to prove yourself<br/>•\tEach levels brings you in a challenge, you have limited time to win the matches<br/>•\tQuick &amp; smarter moves of your player and opponents on the soccer ground<br/>•\tSelect your favorite country, player skin, player uniform &amp; shoes<br/>•\tCreate, customize and control your pro soccer team players<br/>•\tLatest visual effects and cut scenes more like television football match<br/>•\tRealistic graphics and sound effect will enhance the gameplay experience", "metacritic": null, "released": "2018-03-17", "tba": false, "updated": "2019-10-22T14:24:24", "background_image": "https://media.rawg.io/media/screenshots/705/7057ddfee2798c0b0a28fd5effb91b9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Simulation", "Sports"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}