{"id": 77113, "slug": "ragnarok-vikings-at-war", "name": "RAGNAROK Vikings at War", "name_original": "RAGNAROK Vikings at War", "description": "Play RAGNAROK - Vikings at War, a classic MMO strategy game, and enter the mysterious world of the Vikings. Battle with thousands of other players in an epic war for power. Raise your kingdom and become a living legend!<br/><br/>\"Land!\", yells the Jarl from the bow of the longboat. It took many days to cross a storm-lashed sea and reach your destination. As the fog lifts, you glimpse the shores of East Anglia. Many miles away from home, you are ready to do what is the trade of the Vikings: to plunder, pillage and conquer. However, this time it looks as if the Anglians are prepared to hold their ground. They stand along the coast with shield poised and swords drawn and await your landing. Hammering your fists on chests and shields with full power, you and your clan unleash an intimidating sound of war. You are ready to feast with the gods in Valhalla. But this time, Odin must wait. The end will come, and the world of gods and men shall wane. But not today! Not before you have claimed your victory! Not before bards shall sing about your deeds in their songs!<br/><br/>RAGNAROK - Vikings at War is a classic construction and strategy MMO featuring PvE and PvP. You impersonate a fearless Viking warrior and manage a settlement. The game features an authentic medieval world with dozens of kingdoms and countries to raid and conquer. Striving for wealth and power, you send your ships in all directions. With the right tactics and strategy, your warriors will return on ships filled to bursting point with goods and gold. The treasures and loot of your raids help you to evolve your settlement into a big trade town. Band up with other players, form a clan and take part in challenging PvE and PvP fights. Win in events and climb the ranks, so that you can equip your avatar with decorative armor.<br/><br/>Features:<br/>- Awesome builder and strategy game with more than 20 unique buildings and a rewarding trade system<br/>- An epic war strategy game featuring trainable Viking heroes and tactical challenges<br/>- Realistic Viking setting with music that befits the scene and stunning graphics<br/>- Competitive content featuring PvE, PvP and rewarded rankings. Measure yourself with other players!<br/>- Enjoy exciting content with events, clans, single &amp; multiplayer battles, achievements, events, a ranking system and much more to explore<br/>- Join thousands of players across many platforms in a single shared MMO game world<br/>- There are no horned helmets here ;)<br/><br/>RAGNAROK - Vikings at War is a free-2-play game with in-app-purchases and rewarded videos to speed up game progression.<br/><br/>Thank you for playing our game! We are always striving to improve RAGNAROK - Vikings at War. If you have any suggestions or ideas, we are more than happy to hear from you through our support team.", "metacritic": null, "released": "2018-08-29", "tba": false, "updated": "2019-10-22T14:24:24", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8d1b3941abdfa0b73698bda3bbbbedd.jpg", "website": "http://vikingsatwar.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["seal Media"], "genres": ["Action", "Strategy"], "publishers": ["sealMedia"], "esrb_rating": null}