{"id": 77114, "slug": "home-design-decorating-game", "name": "Home Design: Decorating Game", "name_original": "Home Design: Decorating Game", "description": "Are you a fan of decorating and try to find new ways to improve the décor of your home? All you need to do is to get this decorating game right away! It allows you to enter various homes and decorate them as you see fit.<br/>If you are a creative person, you will see that there are lots of great possibilities when you decorate each home. You will get a limited budget, so you will have a few restrictions in regards to what you can buy at first.<br/><br/>When you run out of initial budget, you can match candy, collect coins and keys and continue with your design. As you play, you can unlock new houses, increase your budget and truly show your design prowess at its best. If you love placing décor or moving around pieces of furniture, Home Design will help you get all of that and so much more in no time! And since there are hundreds of items, you will have no problem experimenting with new designs all the time.<br/><br/>Home Design will automatically offer you a rating at the end, so you can easily compete with other people as you try to obtain the best score. <br/><br/>Features:<br/>•\tPlay the role of an interior decorator<br/>•\tCreate the best designs you can, unlock new homes<br/>•\tImprove you design skills<br/>•\tBuild up a design portfolio and share your designs with friends<br/>•\tChoose from hundreds of items to add in your home<br/>•\tMatch candy in match-3 mode and collect coins and keys<br/><br/>Let's see what you got!", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:24:25", "background_image": "https://media.rawg.io/media/screenshots/8e5/8e5ce6c7ae55918344102931c3a1d0d4_Y6kJKrN.jpg", "website": "http://nullapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["nullapp"], "genres": ["Simulation", "Puzzle"], "publishers": ["MICRO MEDIA"], "esrb_rating": "Everyone 10+"}