{"id": 771280, "slug": "izmir-an-independence-simulator", "name": "Izmir: An Independence Simulator", "name_original": "Izmir: An Independence Simulator", "description": "Dive into a post WW1 fiction where you lead the people for the independence of Izmir.<br/><br/>Our game combines the theme of world war 1 and the future, offering you a different tower defense gameplay.<br/><br/>Our game consists of 2 different parts.<br/><br/>Chapter 1 is where you play as tower defense.<br/><br/>The second part is the part where you progress by making some choices, that is, you actually rule a country at the same time.<br/><br/>The mysterious glass-hour inside the Izmir Watch Tower lets you use sci-fi tech. However, the more you use this glass-hour, the more likely your people drive crazy due to the chemicals released from the device.<br/><br/>Therefore you must seek balance using this glass-hour. These attributes are money, morale, allies, tech points. You should think twice before making any decisions in order to keep the balance.<br/><br/>If any of those attributes goes to *0* you lose.<br/><br/><strong>Manipulate People:</strong><br/>Spread gossip or even post a job offer with help of the bartender. Earn attributes by doing so<br/><br/><strong>Different Lines of Vision:</strong><br/>Every character in the game thinks differently and your relationship with them changes with every choice you make. Hence you must consider your decisions wisely.<br/><br/><strong>Game Progress:</strong><br/>After every level you proceed you take little steps towards vast possibilities of the interactive storyline.", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-06-09T21:29:24", "background_image": "https://media.rawg.io/media/screenshots/692/69227989f2db61b1fdd685b096b04bf3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 3}, "playtime": 0, "achievements_count": 41, "ratings_count": 0, "suggestions_count": 369, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trainspotting Studio", "Next in Game"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["Next in Game"], "esrb_rating": null}