{"id": 771273, "slug": "wailing-guignol", "name": "Wailing Guignol", "name_original": "Wailing Guignol", "description": "*All characters in this game are 18 or older<br/><br/>Desert city, Ergerita.<br/>Fighting evil and violence to protect the love of my life.<br/><br/>[Game overview]<br/>Your home is Ergerita, a town in the middle of the desert.<br/>You will need to explore and conquer dungeons to move forward.<br/><br/>The dungeons are filled with bosses and \"Nonasomy types\", <br/>a relentless monster who evolved and adapted to the harsh conditions of the desert.<br/><br/>You will explore the world with your childhood friend, Shunoliege.<br/><br/>Use the bonus points to increase your abilities as you move on.<br/><br/>Will you be able to protect your lover? Her fate is in your hands.<br/>(Turn based battle PRG)<br/><br/>[Story overview]<br/>Guignol.<br/>A weapon of mass destruction created by humans.<br/>A cold blood-thirsty machine made to kill.<br/><br/>Humans came close to extinction due to them.<br/>The world was turned upside down...<br/><br/>Unable to cope with all the violence anymore,<br/>the humans decided to capture <br/>and eliminate all Guignols.<br/><br/>Slowly, the Guignols were destroyed one by one<br/>and buried into the ground.<br/><br/>Although the humans were successful in destroying the Guignols,<br/>they lost something that they could never get back.<br/><br/>Once all the Guignols were gone...<br/>There was nothing but sand and steel left on earth.<br/><br/>But the people didn't give up. <br/>They stuck together and tried to survive the harsh environment...<br/><br/>Then, a boy was born in the town of Ergerita...", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-04-18T03:32:16", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9bdf92a4e5e536dcf261605ac6d30ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 466, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["栗pick"], "genres": ["RPG", "Indie"], "publishers": ["WASABI entertainment"], "esrb_rating": null}