{"id": 771275, "slug": "meifumado", "name": "Meifumado", "name_original": "Meifumado", "description": "Meifumado is an action role-playing game set in a post-apocalyptic, immersive, open world  inspired by Japan. It features an in-depth combat system and puts heavy focus on RPG elements allowing player to change the course of the story and its ending depending on the  choices you make throughout the game.<br/>The central conflict of the story is a war among several rival factions for control over a large island called Yamatai, that is left lying in ruins after the devastating global war. Player will get to choose a side and play a key role in shaping the future of the land of Yamatai and lives of its inhabitants.<br/><br/><strong>FEATURES</strong><br/><ul><li>Deep combat system offering multiple fighting styles, special attacks/abilities, sub-weapons and various weapon types.<br/></li><li>Different non-combat skills: crafting, hunting, stealing.<br/></li><li>Exploration of a vast, detailed open world ruined by a global war, consisting of many different kinds of locations divided into multiple metroidvania-structured levels; each with its unique environment and atmosphere.<br/></li><li>Heavy focus on RPG elements: choices with consequences, multiple endings depending on player's actions, factions with their own ideologies, that player can join.<br/></li><li>Story-driven side quests with multiple ways to complete.<br/></li><li>Numerous side activities: guarding or raiding caravans, participation in fighting tournaments, gambling.<br/></li><li>Highly detailed, beautiful pixel art with fluid animations.</li></ul><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-18T03:36:09", "background_image": "https://media.rawg.io/media/screenshots/cf9/cf903a511226e1c96a402122184f5f17.jpg", "website": "https://www.indiedb.com/games/meifumado/presskit", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "toplay": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 575, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Old Bit Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Old Bit Studio"], "esrb_rating": null}