{"id": 771298, "slug": "s-e-v-e-r-a-n-c-e-2", "name": "S E V E R A N C E", "name_original": "S E V E R A N C E", "description": "A decade ago, the Overflow transformed Sci-Two into a dying metropolis. In its remains, a smuggler stumbles upon a corpse, shipment of contraband, and gang of mercenaries out for his life. Meanwhile, a doctor rushes to rendezvous with a team of ex-soldiers in search of the cure for a disease tearing through the world. In their shadows, a scavenger who’ll do anything to turn a profit sees their predicament as the opportunity of a lifetime.<br/><br/>The fates of the three are intertwined with the miracle drug Halcyon, a by-product of Forges that power cities across the world. As they approach the truth, the Forge’s owners and a shadowy third party seek to eradicate anyone close to discovering the truth.<br/><br/><strong>F E A T U R E S</strong><br/><ul><li>Dive into a classic, SNES-era JRPG experience with a turn-based, ATB battle system<br/></li><li>Experience story-rich experience with a focused, fast-paced adventure narrative exploring themes of mental health support, post-traumatic stress, and social class<br/></li><li>Explore the dystopia of Sci-Two, traverse diverse dungeons, and tackle side-quests to find new weapons, items, and equipment for your party over 20+ hours<br/></li><li>Earn AP through victory to learn new combat skills, abilities, and Riftwork magic and unleash them in battle<br/></li><li>Take on challenging boss encounters that test your battle-system knowledge</li></ul>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T04:03:22", "background_image": "https://media.rawg.io/media/screenshots/934/934fa26e15804f135cf4b9bdb6ccf0ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Polybit_Game"], "genres": ["RPG"], "publishers": ["Polybit_Game"], "esrb_rating": null}