{"id": 771286, "slug": "sirens-call-2", "name": "Siren's Call", "name_original": "Siren's Call", "description": "<strong>Siren’s Call, Florida, 2011, 60 miles north of Cape Kennedy</strong><br/><br/>The final days of your adolescence are coming to a close…<br/><br/><br/><br/>Having solved the strange and terrifying mysteries of this quiet beach town, you have finally found the time to relax with your friends. In the two weeks since your adventure ended, the six of you have mostly cherished your time together—your spirits wafting beautifully on the precipice of adulthood. <br/><br/>Even so, all good things must end.<br/><br/>With only one day left in Siren’s Call, all that’s remains is for you to pack your bags and say goodbye to them. <br/><br/>Don’t leave without making sure they know how you really feel. Only then can you finally be satisfied with what’s to come.<br/><br/><br/><br/><strong>Judith</strong>, the exceptionally sweet (and extraordinarily intense) sovereign of Siren’s Call; <br/><strong>Andi</strong>, the sovereign’s sassy twin sister whose strength and spunk speak volumes on their own;<br/><strong>Ashton</strong>, a hero in training whose sizable fist is matched only by the size of his heart; <br/><strong>Emil</strong>, the once timid boy turned man who will not stop until he reaches absolute perfection;<br/>and <strong>Violet</strong>, waiting patiently as always.<br/><br/>There's a couple others too...I guess.<br/><br/><br/><br/><ul><li>7+ hours of Visual Novel Gameplay with dire consequences for how you choose to spend this final day of yours.</li></ul><br/><ul><li>55 journal entries and and 60 unlockable gallery images for those who want to explore everything this town has to offer.</li></ul><br/><ul><li>An original story centered on saying goodbye to friends rather than saying hello to strangers.</li></ul><br/><ul><li>A dynamic, evocative soundtrack made by The Pocket Protectors meant to perfectly capture the feel of central Florida music.</li></ul><br/><ul><li>A cast of lovely characters that only want what's best for you.</li></ul><br/>", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-04-18T03:51:45", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b68e05bd76106b6539a219a067d0e7e.jpg", "website": "https://escapesirenscall.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ThePenSword"], "genres": ["Adventure", "Casual"], "publishers": ["ThePenSword"], "esrb_rating": null}