{"id": 77126, "slug": "sensible-soccer-skills", "name": "Sensible Soccer Skills", "name_original": "Sensible Soccer Skills", "description": "Sensible Soccer Skills is back in time for the World Cup and for the very first time on the iPhone and iTouch with Series of 10 mini games.  Train and guide your team to win the Cup!<br/><br/>You can now take up the challenging job of coaching your team by leveraging you tactical and strategic skills to the test and watch them tear up your opponents. Strengthen your team’s Attack, Defence and Stamina by taking the players through a series of training games.<br/><br/>Sharpen their Attacking Skills with: <br/>1. Assist- complete a one-timer with the help of a teammate<br/>2. Accuracy - alter a series of kick trajectories to score against a goal-keeper  <br/>3. Corner Kick- get the ball to a vantage point in the opponents box for another to score  <br/><br/>Boost their Stamina with:<br/>1.\tKeep-Ups – bounce a ball on their head for as long as possible<br/>2.\tConcentration - dribble the ball around the cones without knocking any of them out<br/>3.\tEndurance – condition players to perform moves while running <br/><br/>Strengthen their Defenses with: <br/>1.\tBall Control –perfectly control the ball through a series of passes and “nutmegs”.  <br/>2.\tDodge –evade defenders with complex dribbling moves<br/>3.\tKeeper Practice - train the goalkeeper to block incoming penalty shots<br/><br/>And if these training games aren’t enough, prepare your team to play difficult levels by giving them Free Play training practice without any penalties. <br/><br/>The training is an on going process so watch out for the results and scope for improvements as they compete against their opponents to conquer the Amateur and Pro League cups.", "metacritic": null, "released": "2010-06-16", "tba": false, "updated": "2019-07-29T22:51:12", "background_image": "https://media.rawg.io/media/screenshots/cc0/cc0c5a5ee28aaa69fa81bd9c2a43ac90.jpg", "website": "http://www.jumpgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Reliance Big Entertainment UK Private"], "genres": ["Strategy", "Sports"], "publishers": ["Reliance Big Entertainment UK Private"], "esrb_rating": "Everyone 10+"}