{"id": 771300, "slug": "prison-of-the-mind-2", "name": "Prison of the mind", "name_original": "Prison of the mind", "description": "I ... this is me. Everything starts with you and ends with you. This is a plan that you have to design in your mind<br/><br/>It was true that I was released, but not from myself. There is still a prisoner inside me ... a prisoner that no one sees from the outside, but you continue to suffer, you suffer, you suffer until the moment comes when you close your eyes forever.<br/>And you will choose which window to fly to in the end<h3>Story </h3>The story in this game tries to recognize a very small amount from the mind of a human being who is known as a killer in his community and express it to the player in a calm and slow way. The main environment of the game is abstract and dark. You should be able to pay attention to details and use them to solve puzzles.<h3>Gameplay</h3>Gameplay This is a first person title in which you have control of an imaginary character in imaginary spaces and you should know that there is no continuity in the game spaces.<br/>You are in the illusions and imaginations of a murderous mind. You should be able to be calm and be friends with him to solve the puzzles of the game and reach the end of the game.<br/>The gameplay and genre of the game is designed with adventurous psychological concepts and of course with a little scary background. In the gameplay, you have to pay close attention to the details of the environment to be able to solve the designed puzzles.<br/>There is freedom of action in the gameplay and there is only one way to solve the puzzles. You may be able to solve the puzzles in different ways. It depends on your creativity.<br/>The music chosen for the game is the opposite of the goal you must achieve.<br/>Do not neglect your imaginary enemies in the game that you must destroy. They are not very fast or have high power in the game. They are only designed to fight your focus at the beginning of the game.", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T04:05:21", "background_image": "https://media.rawg.io/media/screenshots/2d0/2d0aad5414b428bce1c30f986da86088.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Igame"], "genres": ["Adventure", "Indie"], "publishers": ["Igame"], "esrb_rating": "Mature"}