{"id": 77134, "slug": "jumpscare-3-free-horror-games", "name": "Jumpscare - 3 Free Horror Games", "name_original": "Jumpscare - 3 Free Horror Games", "description": "3 original survival horror games! Free Horrors!<br/><br/>WARNING: If you get scared easily this game is not for you. <br/><br/>Great new indie horror game ! Scary as slender.. but not another slender-like!<br/><br/>First person perspective indie horror game. If you like Slender, Eyes, 5 Nights at Freddy's, Amnesia, and Zombie games you'll like this too. <br/><br/><br/>The Forest:<br/>After dating for a girl for a week, she takes you to her favorite place in the forest to play a game. Find her love notes and a trail of horror's she leaves behind. Shivers will shoot down your spine as you play through this bone-chilling game. <br/><br/>Plane Crash:<br/>After your plane crashes, you are the sole survivor. Demons are after your soul and they will stop at nothing until they rip you limb from limb. They will scare the living daylights out of you, and their breathing will rattle your ears.<br/><br/>Old West, New Blood:<br/>You owe money. It's either this, or your life, so you decide to visit the old cursed mine, with nothing but a lamp and a revolver. But you may have been better off if you didn't go at all, the old town is a hell of its own, teeming with blood thirsty savage cannibals . Escape them if you can, or stand your ground and blow out their bones and heads with your weapon.<br/><br/><br/>3 great storylines that will make your skin crawl and make your bones shake as you play through!<br/><br/>Can you beat them all, and survive through the thrills, terrors and horrors? <br/>Find out by downloading Jumpscare today!", "metacritic": null, "released": "2015-06-23", "tba": false, "updated": "2019-08-02T03:26:27", "background_image": "https://media.rawg.io/media/screenshots/eec/eec5225bee2f6acd55d287d0de805cc9.jpg", "website": "https://itunes.apple.com/us/artist/henry-sorren/id490673725", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Henry Sorren"], "genres": ["Action", "Adventure"], "publishers": ["Henry Sorren"], "esrb_rating": null}