{"id": 771409, "slug": "fung-ku-fire-tongue-air-taming-art", "name": "Fung Ku - Fire Tongue Air Taming Art", "name_original": "Fung Ku - Fire Tongue Air Taming Art", "description": "<p>The Fire Tongue Air Taming Art is an ancient technique. At any given moment, only one action is available to the user. What action it is depends on 2 things:</p>\n<p>1) What the user is currently doing.</p>\n<p>2) What their opponent is currently doing.</p>\n<p>The first round in the game is a practice round - your opponent cannot damage you. Use it to get a hang of the flow of actions in Fire Tongue Air Taming Art.</p>\n<p>In more detail:</p>\n<p>If you are in your idle stance, press X to attack in case your opponent is also idle, or to block if your opponent is about to attack. Pay close attention to slight shifts in your opponent's movement to determine if they are about to attack.</p>\n<p>If you are attacking or blocking, press X to cancel this and revert to your idle stance.</p>\n<p>If you successfully block an opponent's attack, you have a very small window (before they have recovered from their attack, and before your block maneuver concludes) in which to execute an immediate counter-attack that cannot be blocked (also by pressing X). </p>\n<p>True masters of the Fire Tongue Air Taming Art needn't launch any attack - they merely await their opponent to show his hand by slightly moving, then they successfully block and counter-attack to devastating effect. But this requires careful timing - block too early, and counter-attacking becomes very difficult. Block too late and your opponent might actually manage to strike you. <br/></p>\n<p>~</p>\n<p>Made in 2:50 hours for Trijam 165. It took 2 hours to design the game and write a design document, and then 2:50 to implement it and draw it... and about 30 minutes to prepare the submission.</p>", "metacritic": null, "released": "2022-04-17", "tba": false, "updated": "2022-04-18T04:52:48", "background_image": "https://media.rawg.io/media/screenshots/952/95249471b30f0a5fc7891ec9e97fca85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Suhail Habib"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}