{"id": 77141, "slug": "masha-and-the-bear-hair-salon", "name": "Masha and the Bear: Hair Salon", "name_original": "Masha and the Bear: Hair Salon", "description": "Let’s learn how to do make-up and take care of yourself with Masha! Create a fashion styles for the characters of your favorite cartoon \"Masha and the Bear\" in a new game by Indigo Kids!<br/> <br/>- 3 characters besides Masha: a squirrel, small pig named Rosie and the Lady Bear<br/>- original voice acting from the cartoon with favorite Masha’s phrases<br/>- do the make-up by patterns or in the free mode<br/>- taking care of animals: hairstyles, make-up, choosing accessories and more<br/>- 5 funny developing mini-games<br/>- several exciting game modes<br/> <br/>The mischievous Masha is almost grown-up - it's time to learn how to be beautiful and make beauty together! Let’s do a hairstyle, make a mask, choose eye-shadows, powder and lipstick - and right before our eyes Masha turns into a real beauty from the glossy magazine “VOGZALLE”! Add a few accessories and choose clothes!<br/> <br/>Masha will become a great girlfriend for stylish girls and a guide in the world of fashion and beauty – she will answer many questions that attract interest every girl. How to apply the tone correctly? How to make the color of the eye-shadows harmonize with the lipstick? How to choose accessories? This game won’t only be an excellent entertainment for many hours, but also the first fashion world textbook for girls!<br/> <br/>Delicate and natural, strict and accurate or, perhaps, insolent and rebellious - what style do you prefer? Only in this game Masha can try on them all! Level by level, open new color palettes and tools, explore new styles and get reward.<br/>In addition to tasks on the patterns, the game has a free make-up mode, where any girl can try herself as a stylist and create her own styles for Masha!<br/> <br/>And, of course, what game about Masha can be without her friends - animals? In the game \"Masha and the Bear: hair salon and make-up games\" the child will be able not only to pick up a new style for Masha, but also to her friends - the She-Bear, the little pig named Rosie and the squirrel! Animals in the woods also want to be beautiful, which means that they will need special care - to keep the fur clean, to choose hairstyles and accessories and even to make up!<br/> <br/>This game about make-up art not only reveals the creative abilities of the child, but also helps to increase attention, trains memory and fine motor skills in a collection of mini-games, such as: photo-hunting, speedy pop of soap bubbles, washing animals, matching forms and others.<br/> <br/>You will never get bored - favorite cartoon characters, many levels and surprise comments of tireless Masha will make the game his favorite pastime. And with it simple and handy interface the game will fit for all from 2 years old!<br/> <br/>Contact us:<br/>E-mail: support@indigokidsgames.com<br/>Website: http://indigokidsgames.com<br/>Facebook: https://www.facebook.com/IndigoKidsCom/", "metacritic": null, "released": "2017-11-21", "tba": false, "updated": "2019-10-22T13:54:38", "background_image": "https://media.rawg.io/media/screenshots/d73/d73e76cc2262c858c6a6b6c3ef862e8d.jpg", "website": "http://indigokidsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Indigo Kids"], "genres": ["RPG", "Family"], "publishers": ["INDIGO KIDS"], "esrb_rating": "Everyone 10+"}