{"id": 7714, "slug": "ikaro-racing-hd-air-master", "name": "Ikaro Racing HD: Air Master", "name_original": "Ikaro Racing HD: Air Master", "description": "Introducing the most realistic Air Racing game and flight simulator for iOS with 22 different racing tracks , 6 high performance planes to pick from, 5 amazing scenarios maps and Game Center achievement and leaderboard integration. Air Play Streaming.<br/>Become the next Air Master flying Ikaro Racing HD in a reckless race using all your boost speed to be the number one.<br/> <br/>The graphics and gameplay in this universal app are stunning and the game is designed to take full advantage of the iPad 2 and the iOS platform across a range of supported Apple devices with specific optimizations for iPhone 4 Retina Display and and iPad . Check it out now. <br/><br/>\u2028\u2028Comes with…\u2028 <br/>- Five stunning environments: <br/>from desert canyons to oceanic islands, from mountains to modern cities. <br/>- 22 Racing Tracks.\u2028 <br/>-  Five high performance planes : Mustang, Bandit, Goliath, Thunder, Eagle, Viper.\u2028 And more to come<br/>- Free Flight on every level. <br/>- 6 Camera views: 3rd person; in-cockpit; fixed position. <br/>- Game Center leaderboard and achievement integration. <br/>- Career, Quick Race and Time Trial mode. <br/>- Fully recordable races with replay, stats and journal. <br/>- Different realistic flying modes with Classic drive and Wing Simulation. <br/>- 3 Different Controls : Accelerometer, Joy Pad and Mouse Pad. <br/>- 3 Difficulty Levels. <br/>- Different daylight and weather conditions. <br/>- 6 Languages localizations <br/>- Air Play Streaming<br/><br/><br/>----------------------------------------------------------<br/>For information, videos and support visit \u2028http://www.nuoxygen.com <br/>Twitter @nuoxygen<br/>----------------------------------------------------------", "metacritic": null, "released": "2012-02-05", "tba": false, "updated": "2019-10-22T14:29:30", "background_image": "https://media.rawg.io/media/screenshots/12c/12c6b70f5fce0937238c54f499366e77.jpeg", "website": "http://www.nuoxygen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NuOxygen"], "genres": ["Action", "Sports", "Racing"], "publishers": ["NuOxygen"], "esrb_rating": "Everyone 10+"}