{"id": 771502, "slug": "yo-yo", "name": "Yo-yo", "name_original": "Yo-yo", "description": "Overview\r\n\n<p>Yoyo is a fun and thought-provoking dungeon crawler game that uses captivating pixel art and music.</p>\n<p> Step into this world where everyone is against and trying to block her freedom. In order to fulfill her wishes has only yo-yo and music. Pass all the rooms that come her way of freedom. Everything she once thought she had has now turned its back on her.  Are they being controlled by their biggest fear, the bogeyman? Will she be able to face all these difficulties and regain her freedom?<br/></p>\n<strong>Gameplay</strong>\n\n<p>The gameplay is mainly about quick thinking and reflexes. You must defeat your enemies using your yo-yo and have to solve the passwords with the clues given to you. Everytime you make a mistake the level starts again. (Note : There is a bug related to this. If you have a problem with starting the level from the beginning when you die, you have to return to the menu with esc and start over :(</p>\n<p>In the final boss, all you have to do is run away from the bogeyman and get rid of it with the help of your yo-yo.</p>\n\n<p>-------------------------------spoiler------------------------------</p>\r\nBedroom\r\n\r\n<p>As soon as the start button is pressed, we open our eyes in our room. The bedroom level consists of two separate phases and in order to escape from this room we have to decipher the code separately. </p>\n<p>We need to complete the puzzle standing on the ground and  defeat the clowns who are controlled by the evil force as well.</p>\n<p>Clowns are reborn after every password mistake. After solving the first puzzle second phase begins. </p>\n<p>We need to get the numbers seen in our second clue among the numbers that computer throws at us. If we dont get the correct numbers shown in the hint then we take damage.</p>\n<p> When correct numbers are reached, the second password will also be deciphered and the piece needed for escaping the room is completed. </p>\r\n\r\nKitchen\r\n<p>After the difficulties in the first room, a bigger challenge awaits us The Cooker Chief. Everyone need food to live. The only way to get them is to fight the chief and catch the food pieces drops to the ground before chief catch us. </p>\n\r\nThe Bogeyman\r\n<p>In order to escape from the house, remaining only and biggest enemy stands before us, the bogeyman evil itself. We must escape the bogeyman that moves faster than us and have to fight it and get rid of it before bogeyman gets us. When the bogeyman's life bar is over, we have overcome all obstacles and attained our freedom, reached a happy ending</p>\n\r\nControls\r\n\r\nMoveWASDAttackLeft Click\r\n<strong>Credits</strong>\r\nBekir Tuncer\r\nGame Designercoqorekh#6666\r\nHan Kara\r\nMusic &amp; SFX, Game DeveloperThe Han#2721Özgür GürbüzGame DeveloperTristiana #0860<br/>Setenay Emül\r\nPixel ArtistEmulz#6666", "metacritic": null, "released": "2022-04-17", "tba": false, "updated": "2022-04-18T05:30:38", "background_image": "https://media.rawg.io/media/screenshots/533/53343ff9bfbe52ae2957f60119682ac5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Emulization"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}