{"id": 771807, "slug": "hunting-season-demo", "name": "Hunting Season [DEMO]", "name_original": "Hunting Season [DEMO]", "description": "<strong><strong>------------------------------------------------</strong></strong>\n<em>Hunting Season</em> is a fast-paced rogue-lite FPS. This game is a combination of first person arena shooters and rogue-likes with items, combinations and many more.\r\nPeople have been fighting in a war against the monsters from the underground for decades. It seems that all hope has been lost a long time ago. But <em>you</em> are not giving up just yet. Will you be able to end people's suffering?\r\n<em>For now, this is just a demo. It features 1 region, that has 3 levels, with the final level having a boss. These levels are procedurally generated. Everything is subject to change and, of course, bugs are also present. Feel free to leave feedback on the </em><em>project!</em>\n\n\r\n\r\nThere are 3 weapons available in the demo!\r\n<ul><li><strong><em>Revolver</em></strong>. This weapon will help you deal good amount of damage in a short time. Revolver has a unique reload, which makes it explode. You can use it to deal damage to several enemies at once.</li></ul>\n\n<ul><li><strong><em>Double-barreled shotgun</em></strong>. Very powerful in close-range combat. Though it's more dangerous because of the small range,  you can use this shotgun's knockback to push yourself around and fly above enemies.</li></ul>\n\n<ul><li><strong><em>Winchester</em></strong>. A rifle that can shoot 8 bullets and reload in small amount of time. It has the biggest magazine and high damage, which means it has the biggest damage per magazine.</li></ul>\n\n\n\n<p>Items give you different passive effects.</p>\n<p>On your journey through the depth of the underground you will find a lot of items that will help you progress further and become stronger. From gaining hp to literally making your weapons shoot electricity. You will find everything you need. <em><strong>Every item is not final and everything is subject to change.</strong></em><br/></p>\n<p>You can get the same items in any amount you want because they can stack. Collect similar items to stack their effects and become unbeatable.<em> </em></p>\n\n<p><strong>Of course you will find much more on your journey. Dangerous enemies, powerful combinations and synergies. But you will have to do that yourself! The demo is completely free and anyone can play it. I hope you enjoy it!</strong></p>\n\n\r\n------------------------------------------------\r\nCONTROLS\r\n------------------------------------------------\r\n\n\r\nAnd also TAB - For minimap and scroll wheel for zoom.\r\n(Sorry, forgot to add it)\r\n------------------------------------------------\r\nCREDITS\r\n------------------------------------------------\r\n<p><strong>Lifty (Me, https://liftyforever.itch.io) -</strong> Programming, 3D and 2D art, Game Design.</p>\n<p><strong>BlueMoonLight</strong> <strong>(https://twitter.com/ight_blue)</strong> - Music.<br/></p>\n<p><strong>MadxBoy (https://twitter.com/boy_madx)</strong> - Shopkeeper model.</p>\n\n<p><strong>Pepego on Sketchfab</strong> - Shotgun (Used it for reference).</p>\n<p><strong>ArtLeaving on CGTrader </strong>- Deer Skull 3d model.</p>\n<p><strong>stasbelyk13 on Sketchfab</strong> - Flamethrower.</p>\n<p><strong>HFL17 on CGTrader</strong> - Gas mask.</p>\n\n\n<p>Also here's my youtube channell, maybe I will post devlogs there: https://www.youtube.com/channel/UCQ5Fn86PfHeTaJCMLKve9SQ</p>\n<p><strong>If you have feedback or encountered bugs you can write them in the comments below or contact me by: </strong>karagodin.artem27@gmail.com</p>", "metacritic": null, "released": "2022-04-17", "tba": false, "updated": "2022-04-18T07:30:57", "background_image": "https://media.rawg.io/media/screenshots/e2c/e2c15a3057625c78366e7c064c79ae4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LiftyForever"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}