{"id": 77202, "slug": "skate-3d-true-board-skater", "name": "Skate 3D - True Board Skater", "name_original": "Skate 3D - True Board Skater", "description": "Skate 3D is one of the best skate board games available today. <br/><br/>The graphics are in beautiful HD, and completely 3D. Simply swipe your finger to control the board. Its easy and so fun to skateboard in this epic skate game! This game is great for both beginner skaters and pros! Teach yourself to skate bowls and halfpipes, or simply practice new tricks. This is both a game and a simulator, so you can complete fun skate challenges, or simply just skateboard around.<br/><br/>Now you can rewind time to try a skateboarding trick as many times as you want! There is also a slow motion mode, so you can skate board however you want!<br/><br/>Just like in real skateboarding or fingerboarding, Skate 3D is a game of skill that takes 10 minutes to understand but a lifetime to master. Learn the tricks, complete challenges, and unlock new skateboard parts.<br/><br/>Get the highest score in time-limited Competition mode, rip freely and complete challenges in Jam Session mode.<br/><br/>True innovative finger controls together with real physics simulation let you pull off tricks like ollies, pop shuvits, kickflips, heelflips, impossibles, powerslides, lip tricks, stalls, drops, 5-0’s, 50-50’s, crooks, tailslides, bluntslides, darkslides etc in endless combinations, or why not do them in nollie, fakie or switch? - Only your skill and imagination set the limit!<br/><br/><br/><br/>FEATURES<br/>- Realistic physics and stunning 3D graphics<br/>- 3 free roam game modes: freeplay, deathmatch and glass smash<br/>- Tutorial videos - watch and try yourself!<br/>- Natural multi-touch controls<br/>- Tilted camera view, similar to True Skate and Touchgrind<br/>- Three different skateparks with bowls, ramps, curbs, boxes and over 2.000 meters of rails<br/>- Complete the 100 challenges to unlock decks, wheels, grip tapes and stickers<br/>- True skating experience <br/>- Trick name detection<br/><br/>Skate 3D brings all the fun of skateboarding to your mobile device allowing you to ride in 8 completely unique locations. Jump on your board, learn new moves and improve your skateboarding skills to land sick combos. <br/><br/>Play with your friends using the new online multiplayer mode or challenge skaters from all over the world using the online leaderboards. Complete achievements, gain experience and upgrade your favorite skater. You can also customize your outfits, boards, trucks and wheels with real brands. <br/><br/>HIGH DEFINITION <br/>Skate<br/> 3D includes next generation 3D graphics specially optimized for your mobile hardware to provide you with the best skateboarding experience.<br/><br/>CAREER MODE <br/>Complete over 40 achievements to unlock new items and locations. Gain experience to upgrade your favorite skater’s attributes to perform better and achieve higher scores. <br/><br/>FREE SKATE <br/>Practice and improve your skateboarding skills without any time constraints. <br/><br/>ONLINE MULTIPLAYER <br/>Challenge your friends to a skateboard battle and let’s see who can land the baddest tricks! Share and brag your results with your friends on Twitter. <br/><br/>LEARN TO SKATE <br/>Over 40 unique tricks to master and hundreds of combinations. Follow the tutorial to get started and progress as you go. Execute the craziest combos and trick sequences to rack up some impressive high scores, gain experience and make a name for yourself. <br/><br/>GAME CONTROLLER<br/>Compatible with most game controllers available.<br/><br/>CUSTOMIZABLE CONTROLS <br/>New fully customizable control system to configure your own button layout. Use the right or left handed control mode, select a control preset or create your own. Use the analog stick or accelerometer option as you wish. Adjust your truck tightness to change your steering sensitivity.", "metacritic": null, "released": "2017-04-26", "tba": false, "updated": "2019-08-02T03:26:16", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d0bcade6ab9c11560b7ce640b398492.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Henry Sorren"], "genres": ["Simulation", "Sports"], "publishers": ["Henry Sorren"], "esrb_rating": null}