{"id": 772064, "slug": "a-superman-style-flight-experience-ue5", "name": "A Superman Style Flight Experience (UE5)", "name_original": "A Superman Style Flight Experience (UE5)", "description": "<p><strong>A Superman Style Flight Experience (UE5)</strong><br/><br/>This project was built simply as a test for what a future Superhero game like Superman might be like in a large scale modern city running on UE5. I dream of a modern Superman game and with the release of UE5, seemed like fertile ground for some experimentation with the amazing packages Epic has made available. <br/></p>\n<p>This game uses<strong> Epic's The Matrix Awaken's Project City</strong> and replaces the character with a flying superhero variant of my own design using other marketplace assets. <br/>This was a quick thrown together test, there could be any number of issues and problems, but I am putting it out there for anyone who is keen to give it a go. Also, for legal reasons, <strong>this character isn't Superman </strong>and I have made sure this is totally<strong> free.</strong></p>\n<p>Please note that this is an<strong> incredibly heavy game </strong>and<strong> lower end PC's will struggle</strong> potentially. Even on a<strong> 3090</strong> I have run into streaming issues...  <br/>Again, this is based on <strong>Epic's Matrix Demo</strong>, just for fun, and I haven't done any kind of optimisation myself, it's just plug and play. </p>\n<p>Either way this is just for those of us who one day dream of a<strong> Superman open world</strong> game, I hope this scratches that itch a little bit for now. </p>\n<p>And no, I am not currently working on this in any major compacity further, again, just for fun and I have other commitments, but may consider revisiting in the future. </p>\n<p>Enjoy! </p>\n\n<p>---</p>\n<p>Shout out to Alec Shea for helping me with some SFX work, check him out<br/>Itch: https://slaleky.itch.io/ Twitter: twitter.com/slaleky Music Links: bio.to/AlecShea<br/></p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T09:59:22", "background_image": "https://media.rawg.io/media/screenshots/f9d/f9d9de0bd78c27328876e0083b8bbe6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tyson Butler-Boschma"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}