{"id": 772080, "slug": "beeftown-beatdown-early-card-game-demo", "name": "Beeftown Beatdown - Early Card Game Demo", "name_original": "Beeftown Beatdown - Early Card Game Demo", "description": "<p>This is a Gameplay Demo for Beefotwn Beatdown.</p>\n<p>The game is still in developement so minor bugs and balance issues are to be expected.</p>\n<p>In the Kitchen you can pick your enemy, and create your menu. Right now you can cheat ingredients with the button at the top! Your menu can have up to 5 dishes. <br/>Press the red Bell to enter the ring.</p>\n<p>The game is played as a best of 5. Every round you eat one of your dishes, giving you the opportunity to buff cards and add new ones into your deck!<br/>The goal of each round is to push the Momentum Counter on the left all the way to the enemies side. You can do so by placing cards in the ring. Every round the board shifts towards the counter and any cards on the left enter combat.<br/></p>\n<p>Every card has three main Stats. <br/></p>\n<p>The Green one is its costs: Every round you gain two stamina shown at the bottom left. You can also play cards you can't afford, paying your debt by taking damage.</p>\n<p>The Blue one is its speed: Cards with higher speed must be placed further away from the Momentum Counter.<br/></p>\n<p>The Red one is its power: When cards enter combat, they strike each other and deal any excess damage to the Momentum Counter if they break their opponent.<br/></p>\n<p>You can left-click cards to focus on them and hover their colorful Keywords for additional information.<br/></p>\n<p>Now enter the ring and be victorious!<br/></p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T10:06:30", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e9f43dc774ae004b04f5bd563a909b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Xahutek"], "genres": [], "publishers": [], "esrb_rating": null}