{"id": 772021, "slug": "historias-de-terror-tears", "name": "HISTORIAS DE TERROR -TEARS", "name_original": "HISTORIAS DE TERROR -TEARS", "description": "<p>EL HORROR ES SIN FIN</p>\n<p>**************************************************** ****************************</p>\n<p>Los enlaces de descarga se encuentran en la parte inferior de la página (Download)</p>\n<p>**************************************************** ****************************</p>\n<p>SINOPSIS</p>\n<p>Sumérgete en historias interactivas que mezclan misterios y miedo, en la encrucijada entre lo fantástico y lo terrorífico en forma de libros de novelas visuales.</p>\n<p>A lo largo de los capítulos, descubre nuevos personajes enigmáticos a través de lugares fríos y lúgubres en la frontera entre los sueños y las pesadillas.</p>\n<p>El ser que existe entre lo real y lo imaginario siempre estará ahí para hacer cada historia aún más horrible. Pero, ¿cuál es su verdadero propósito?</p>\n<p>Lo descubrirás muy rápido porque aquí no eres un simple lector.</p>\n<p>No, para la supervivencia de varios personajes habrá que tomar decisiones. Algunos de los cuales pueden ser dolorosos. Pero cuidado, ya es posible que ya sea demasiado tarde y que te lleve al más allá...</p>\n<p>En la encrucijada entre los gritos de las tormentas y el abismo, ¿puedes finalmente encontrar el bien más preciado que es el de la libertad? Desconfianza ante el ser de la discordia que permanece al acecho en las sombras.</p>\n<p>¿Debería ser este objetivo el próximo en dejar al mundo en un dolor insoportable como desean los corruptos?</p>\n<p>Al más mínimo paso en falso, y ya será el final...</p>\n<p>Si no tienes la paciencia para esperar a que lleguen los próximos capítulos, ¡puedes desbloquearlos en la vista previa!</p>\n<p>¡Mientras esperas que lleguen nuevas historias y capítulos, los personajes te están esperando!</p>\n<p>********************************************************</p>\n<p>Para leer aún más, las historias están disponibles en 9 idiomas:</p>\n<p>Francés, Inglés, Español, Alemán, Italiano, Portugués, Japonés, Chino Simplificado y Coreano.</p>\n<p>********************************************************</p>\n<p>Somos un estudio de juegos y aplicaciones de terror, conocido principalmente por el desarrollo de \"Historias de terror interactivas\" y \"Leyendas urbanas\".</p>\n<p>****************************************************** **** ******************************\r\n</p>\n<p><strong>Contacto :    https://forms.gle/8NbHHJv5aJLf2qiG8</strong>\n</p>\n<p><strong>Facebook </strong> =&gt;   https://www.facebook.com/Lessdessdoux\r\n</p>\n<p>****************************************************** **** ******************************\r\n</p>\n<p>Descubre todos nuestros videojuegos aquí:  https://lessdessdouxstudio.itch.io/</p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T09:33:11", "background_image": "https://media.rawg.io/media/screenshots/855/8557d9cb9a76c661156a963830a6e89d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["LessdessdouxStudio"], "genres": [], "publishers": [], "esrb_rating": null}