{"id": 772030, "slug": "horror-stories-blood-tears", "name": "HORROR STORIES BLOOD - TEARS", "name_original": "HORROR STORIES BLOOD - TEARS", "description": "<p>THE HORROR IS ENDLESS<br/></p>\n<p>************************************************** **********************************</p>\n<p>Download links are at the bottom of the page (Download)</p>\n<p>************************************************** **********************************</p>\n<p>SYNOPSIS</p>\n\n<p>Immerse yourself in interactive stories mixing mystery and fear, at the crossroads between fantasy and horror in the form of visual novel books.</p>\n<p>Throughout the chapters, discover new enigmatic characters through cold and gloomy places on the border between dreams and nightmares.</p>\n<p>The being that exists between the real and the imaginary will always be there to make every story even more horrible. But what is its real purpose?</p>\n<p>You will discover it very quickly because here, you are not just a simple reader.</p>\n<p>No, for the survival of several characters, choices will have to be made. Some of which can be painful. But be careful, it is already possible that it is already too late and that it will take you to the afterlife...</p>\n<p>At the crossroads between the cries of the storms and the abyss, can you finally find the most precious good that is that of freedom? Mistrust in the face of the being of discord who remains lurking in the shadows.</p>\n<p>Should this target be the next to leave the world in excruciating pain as the corrupt people desire?</p>\n<p>At the slightest misstep, and it will already be the end...</p>\n<p>If you don't have the patience to wait for the next chapters to come, you can unlock them in preview!</p>\n<p>While waiting for new stories and chapters to come, the characters are waiting for you!</p>\n<p>********************************************************</p>\n<p>For even more reading, the stories are available in 9 languages:</p>\n<p>French, English, Spanish, German, Italian, Portuguese, Japanese, Simplified Chinese and Korean.</p>\n<p>********************************************************</p>\n<p>We are a horror games and applications studio, mainly known for the development of \"Interactive Horror Stories\" and \"Urban Legends\".</p>\n<p>********************************************************</p>\n<p><strong>Contact :    https://forms.gle/8NbHHJv5aJLf2qiG8</strong>\n</p>\n<p><strong>Facebook </strong> =&gt;   https://www.facebook.com/Lessdessdoux\r\n</p>\n<p>****************************************************** **** ******************************\r\n</p>\n<p>Discover all our video games here :  https://lessdessdouxstudio.itch.io/</p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T09:40:54", "background_image": "https://media.rawg.io/media/screenshots/6fb/6fbe72994396440b90d84b7806587972.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["LessdessdouxStudio"], "genres": [], "publishers": [], "esrb_rating": null}