{"id": 772035, "slug": "walk-through-the-valley", "name": "Walk Through the Valley", "name_original": "Walk Through the Valley", "description": "<p>So I love location-based games. Well, that's not entirely true. I love the <em>idea</em> of location-based games. Even before Pokemon Go was a thing, when I was just a wee lad, my friends would daydream how cool it would be to layer the fantastic world of a video game over the real one. To explore our neighborhood like we were exploring a dungeon, avoiding dangers, looking for treasure and secrets.\r\n</p>\n<p>But something never quite fulfilled me about the way Pokemon Go utilized the idea. When I first played it, I set aside time for it. I would lace up my shows and pick a nice place to go for a walk. But before long, I wasn't walking anymore. PoGo became something I flipped open on the bus, in the subway, when I had a minute to kill--not a way to get out and explore the world.\r\n</p>\n<p>In Pokemon Go, it doesn't really matter where you go, because \"over there\" is the same as \"over here\". All you have to do is move around a bit so the game feeds you more encounters. It can feel like a collect-a-thon strapped to a step counter--and I say this as someone who's gotten a lot of joy, not to mention exercise, out of Pokemon Go, and has commensurate respect for the work that went into it.\r\n</p>\n<p>It's also a little weird that you spend all your time in the game looking at your phone--not the real-live world around you, which is supposedly the game's best feature. Again, you can't blame developers for this. How else can you engage with the game's mechanics? There are good reasons for these kinds of games to be structured the way they are.\r\n</p>\n<p>But I wonder if this was the only way. I wonder if location games could, under different circumstance, have evolved into something different entirely.\r\n</p>\n<p>\"Walk Through the Valley\" is something different--a location-based game where you get to spend more time looking at the world than at your phone.</p>\n<p>Certainly it's no PoGo. It's nothing but a little one-person experiment, my first 'real' videogame--probably with the bugs to prove it. But it approaches the idea of a \"location-based game\" in a way that I don't think anyone else has. It's even single-player! It's a game where the direction you walk in doesn't just matter--it's the primary decision you make.</p>\n<p>You are the pilot of a time-travel probe catapulted into the distant future. Wherever you go in the real world, your probe goes on future Earth. So you must navigate the world around you while at the same time dodging mutants and radioactive fallout, searching for the story of a mysterious apocalypse.<br/></p>\n<p>This is a single-player experience; no mobile data needed! Earbuds are recommended, however, since most information is communicated through sound.</p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T09:43:28", "background_image": "https://media.rawg.io/media/screenshots/55e/55ece5b7ba333f6154958d005c335028.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Irreducible Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}