{"id": 772001, "slug": "storie-horror-blood-tears", "name": "STORIE HORROR BLOOD - TEARS", "name_original": "STORIE HORROR BLOOD - TEARS", "description": "<p>L'ORRORE È INFINITO</p>\n<p>************************************************** ******************************</p>\n<p>I link per il download sono in fondo alla pagina (Download)</p>\n<p>************************************************** ******************************</p>\n<p>SINOSSI</p>\n<p>Immergiti in storie interattive che mescolano misteri e paura, all'incrocio tra il fantastico e l'orribile sotto forma di romanzi visivi.</p>\n<p>Attraverso i capitoli, scopri nuovi personaggi enigmatici attraverso luoghi freddi e cupi al confine tra sogni e incubi.</p>\n<p>L'essere che esiste tra il reale e l'immaginario sarà sempre lì per rendere ogni storia ancora più orribile. Ma qual è il suo vero scopo?</p>\n<p>Lo scoprirai molto rapidamente perché qui non sei solo un semplice lettore.</p>\n<p>No, per la sopravvivenza di più personaggi bisognerà fare delle scelte. Alcuni dei quali possono essere dolorosi. Ma attenzione, è già possibile che sia già troppo tardi e che ti porti nell'aldilà...</p>\n<p>Al crocevia tra le grida delle tempeste e l'abisso, riesci finalmente a trovare il bene più prezioso che è quello della libertà? Sfiducia di fronte all'essere della discordia che resta in agguato nell'ombra.</p>\n<p>Questo obiettivo dovrebbe essere il prossimo a lasciare il mondo in un dolore lancinante come desiderano le persone corrotte?</p>\n<p>Al minimo passo falso, e sarà già la fine...</p>\n<p>Se non hai la pazienza di aspettare che arrivino i prossimi capitoli, puoi sbloccarli in anteprima!</p>\n<p>Nell'attesa che arrivino nuove storie e capitoli, i personaggi ti aspettano!</p>\n<p>********************************************************</p>\n<p>Per una lettura ancora maggiore, le storie sono disponibili in 9 lingue:</p>\n<p>Francese, Inglese, Spagnolo, Tedesco, Italiano, Portoghese, Giapponese, Cinese Semplificato e Coreano.</p>\n<p>********************************************************</p>\n<p>Siamo uno studio di giochi e applicazioni horror, noto principalmente per lo sviluppo di \"Interactive Horror Stories\" e \"Urban Legends\".</p>\n<p>****************************************************** **** ******************************\r\n</p>\n<p><strong>Contatto:    https://forms.gle/8NbHHJv5aJLf2qiG8</strong>\n</p>\n<p><strong>Facebook </strong> =&gt;   https://www.facebook.com/Lessdessdoux\r\n</p>\n<p>****************************************************** **** ******************************\r\n</p>\n<p>Scopri i nostri altri videogiochi qui: https://lessdessdouxstudio.itch.io/<br/></p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T09:21:45", "background_image": "https://media.rawg.io/media/screenshots/430/430e39aa14a2cd02d3b0c54ba52122db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LessdessdouxStudio"], "genres": [], "publishers": [], "esrb_rating": null}