{"id": 77212, "slug": "hockey-classic-16", "name": "Hockey Classic 16", "name_original": "Hockey Classic 16", "description": "EIGHTY teams, SEVEN amazing game modes, ONE all-star player - get your game on with Hockey Classic 16!<br/><br/>From the developers that brought you Hockey Nations, Patrick Kane’s Hockey Classic and Patrick Kane’s Arcade Hockey, experience the latest and greatest hockey game on mobile. Take your national team to the ice and win GOLD in Winter Games or face your biggest city rival in Face-Off, all the while enjoying incredible game day atmosphere and fluid controls.<br/><br/>GO BIG OR GO HOME<br/>Take a break from the Playoffs with our brand new game mode HOCKEY GIANTS! Now you can go crazy with this big bobble headed smash. With no rules and no clock, the first to score 5 takes the game making it a fun filled, fast paced hockey hit. <br/><br/>OWN THE OUTDOOR SERIES<br/>With seven action-packed game modes to choose from, pick your hockey team and smash the RIVALS SERIES, claim the PLAYOFFS cup or take intense competition to a new level with the OUTDOOR SERIES. Under cold blue skies, six teams will battle it out on lakes and stadiums to be crowned the Outdoor Series Champions.<br/><br/>LIVE IN THE MOMENT WITH LIVE GAMES<br/>Revel in fierce ice hockey rivalries with our exclusive LIVE GAMES. Hit the rink for a live, time limited game where you decide whether your team wins. Destroy your opposition and taunt their fans, or share your bragging rights on Facebook.  Keep your eyes on the prize and check the status of the current event direct from your Apple Watch! <br/><br/>GET IN THE ZONE WITH TOUCH CONTROLS<br/>Play where the puck is going to be with innovative touch controls that deliver a smooth and authentic feel to taking shots, body checks and puck clearance. Control your team with ease in offence and defense using intuitive swipes on screen, feeling all the big hits, goals and more!<br/><br/>ENJOY A REAL GAME DAY EXPERIENCE <br/>With stunning visual effects, your game will come to life as you immerse yourself in the exhilarating game-day atmosphere.  Watch the crowd go wild in stunning arenas and relish incredible game play with loose puck pickup, goalie vision &amp; positioning that deliver a fast paced and authentic ice hockey experience.", "metacritic": null, "released": "2016-03-09", "tba": false, "updated": "2019-07-30T14:15:16", "background_image": "https://media.rawg.io/media/screenshots/457/45759518a83af4efc1f3ebe171b79245.jpg", "website": "http://www.distinctivegames.com/games/item/matt-duchenes-hockey-classic", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Distinctive Games"], "genres": ["Action", "Sports"], "publishers": ["Distinctive Developments"], "esrb_rating": "Teen"}