{"id": 772183, "slug": "little-greeble-helper-music-ver-in-dls", "name": "Little Greeble Helper (Music Ver. In DL's)", "name_original": "Little Greeble Helper (Music Ver. In DL's)", "description": "<ul><li><strong>PLEASE READ BEFORE PLAYING</strong></li><li><strong>WARNING: </strong><strong>There are flashing lights that happen during screen or room changes.</strong></li><li><strong>UPDATE: The music version should now work properly. Re-download the latest zip to fix it</strong></li></ul>\n\n<ul><li><strong>WASD - To move and interact with objects</strong></li><li><strong>If you want to play with the music enabled you have to download the music version and open the HTML file.</strong></li><li><strong>I recommend letting the text auto scroll instead of trying to force the text by hitting a key.</strong></li></ul>\n<p>Explore a small game made with bitsy, where you see what cats are up to when we can't see what their chasing.</p>\n<p>Little Greeble Helper is the second full game I've released and I'm pretty excited to share it with everyone. It's the first game I made that is story driven through the text compare to my previous game creeping cold. Which was a game with pretty little text. Hopefully everyone enjoys the game though, I had a lot of fun coming up with the story, art, and music.</p>\n<p>Credit to my friend for proofreading and playtesting. He's a poet/writer and was a great support to have through the development of the game. </p>\n<p>I will link his twitter right here <strong> ------&gt;</strong> @JesseDomingos2 <strong>&lt;--------</strong></p>\n<p>Feel free to leave comments below and follow me on my twitter and check out Creeping Cold if your up for trying out another game I made.</p>\n<p>Follow  my twitter to see my art or other things I'm working on: @Chio_Butterfly</p>\n<p>Everything was made using Bitsy, BeepBox, and  Bitsymuse. Attached to each of those are links that will bring you to their page.</p>\n<p>The game is free so no pressure to donate unless you want to and if you do any amount is appreciated. At the end of the day though I just want people to have fun and show people the game so others can have fun as well.</p>\n<p><strong>Disclaimer: Feel free to use the music in other projects just make sure to credit me please.</strong><br/></p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-18T11:14:52", "background_image": "https://media.rawg.io/media/screenshots/2bf/2bf673505ae7628b4f6cb335d1c0fa8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ChioButterfly"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}