{"id": 772299, "slug": "paper-warfare-v10", "name": "Paper Warfare v1.0", "name_original": "Paper Warfare v1.0", "description": "<p>Paper Warfare is a top-down combat game for the PC that was developed with Unity. It is a proof of concept game that originated from a childhood game “Paper Aircraft Flick and Hit” game in Hong Kong primary schools, where teenagers played paper-folded aircraft back in their childhood. In that real-life game, each player first uses a piece of paper to fold their own aircraft, then they put their self-made aircraft onto the desk, then flick their aircraft and try their best to knock out their opponent. The first aircraft that gets knocked out of the desk will lose the game. Our game is mainly based on this mini-game concept, as we wish to arouse people with those nostalgic memories. </p>\n<p>In the game, players can customize their paper aircraft, and control them on the battlefield to duel with other aircraft creations by their opponents. We employ this in real-time control to make the game more intense and added different elements to try to make the game fun. </p>\n<p>The game is currently in a proof-of-concept state so we want to hear what players think about the game. There will be updates if there were many be added if many positive feedbacks. Constructive suggestions are also welcome! </p>\n<p>If you are interested in WebGL build, please visit https://simmer.io/@vinesmsuic/paper-warfare-16-9. <br/></p>\n<p>How to Control:</p>\n<ul><li>Left Click to pull and release (You can start pulling from anywhere): Movement Attack </li><li>Right Click: Heavy Attack (Shockwave) </li><li>Key 1: Head Skill</li><li>Key 2: Wing Skill </li><li>Key 3: Tail Skill</li></ul>", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-04-18T12:18:07", "background_image": "https://media.rawg.io/media/screenshots/e38/e3834ab05b24b97da8dd75131cac2414.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vinesmsuic"], "genres": ["Strategy", "Fighting"], "publishers": [], "esrb_rating": null}