{"id": 77229, "slug": "pool-live-tour-mobile", "name": "Pool Live Tour Mobile", "name_original": "Pool Live Tour Mobile", "description": "» Play with friends and millions of pool players from all over the world.<br/><br/>The incredible pool game enjoyed by millions of players every month is available for your iPad, iPhone or iPod touch! Challenge your friends, compete against millions of players, or practice offline in single player mode, as you collect trophies, claim unique cues, and discover all the lively locations that make up this exciting pool game!<br/><br/>PLAY 8 BALL POOL AND 9 BALL POOL<br/>· Go head-to-head against real players from around the world or invite a friend to a match<br/>· With over 4 million matches being played every day, you’ll find a worthy opponent in seconds!<br/>· Win coins and increase your rank as you play through various pool variations and levels - all for FREE!<br/><br/>NATURAL TOUCH CONTROLS — UTILIZE REAL POOL SKILLS<br/>· Intuitive touchscreen controls that feel just like the real thing<br/>· Pull to set power and direction then release to shoot and add some spin with a simple swipe <br/>· Wide selection of cues that enhance your controls  <br/><br/>ONLINE, OFFLINE, ON THE BUS — PLAY ANYWHERE, ANYTIME<br/>· Multiple ways to play makes it possible to enjoy pool no matter where you are<br/>· On Facebook, Game Center, or your tablet or phone - enjoy pool seamlessly on any device <br/>· Enjoy offline matches using bluetooth or duel it out on a single screen - perfect for those long journeys together!<br/><br/>FROM HUMBLE MOE’S PUB TO THE LUXURIOUS MANHATTAN SKY LOFT<br/>· 6 amazing levels, each supporting aim-assist and no aim-assist modes.<br/>· Move through the levels and play for increasingly higher stakes against increasingly tougher opponents<br/>· Experience variations on the standard 8 ball rules including 9 ball, and more!<br/><br/>BECOME A CUE AFICIONADO<br/>· Find your perfect cues among our ever-changing catalog each with their own power, spin, and aim attributes<br/>· Choose from over 90 cues like the simple-but-crazy Bamboo cue to a beautiful masterpieces such as the Dragon<br/>· Collect rare cues from special events and offers<br/><br/>A LIVING POOL WORLD<br/>· Challenge yourself with our Daily Challenges<br/>· Take part in special events and win unique prizes", "metacritic": null, "released": "2013-04-04", "tba": false, "updated": "2019-10-22T13:54:38", "background_image": "https://media.rawg.io/media/screenshots/fc3/fc3d97aa52f07613ec444749f41493e7_QWN2U45.jpg", "website": "http://www.poollivetour.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Geewa"], "genres": ["Simulation", "Sports"], "publishers": ["Geewa"], "esrb_rating": "Teen"}