{"id": 772234, "slug": "growing-my-grandpa", "name": "Growing My Grandpa!", "name_original": "Growing My Grandpa!", "description": "<h3>GROW YOUR GRANDPA!</h3>In Growing My Grandpa! you take the role of Adrienne, an intensely introverted little girl in an unhappy home. She is as creative as she is shy.<br/>In a trash-strewn basement that appeared to be the site of a strange scientific study, Adrienne discovers a weird secret that defies all but the most imaginative biological explanations. With a desperate wish, she begins raising an powerful entity who she knows as her Grandpa. Given a little food, it begins to grow. Spoken with a bit, it begins to have conversations. However, this entity abides by a strange and deadly logic, and Adrienne must discover the secrets of the basement if she is to have a chance at a happy life.<h3>FEATURES</h3><ul><li>A story of the pain of desire, the weight of loneliness, and the need for intimacy<br/></li><li>Dark, dense lore that combines science fiction, sympathetic magic, and speculative neuroscience<br/></li><li>Virtual Pet Elements: The entity known as your Grandpa needs to be fed and educated! Keep Grandpa content and it will have much to offer you...<br/></li><li>Unsettling FMV-inspired graphics<br/></li><li>An intensely atmospheric soundtrack<br/></li><li>Two very different endings based on your understanding of the lore and your interactions with Grandpa<br/></li><li>An average playtime of 90 minutes.</li></ul>", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2023-02-08T11:51:24", "background_image": "https://media.rawg.io/media/screenshots/88c/88c3054e732ac9e06f51ff162b654156.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 11, "beaten": 2, "toplay": 1}, "playtime": 3, "achievements_count": 4, "ratings_count": 1, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS"], "developers": ["Yames"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Yames"], "esrb_rating": null}