{"id": 772316, "slug": "abcdefg-motomami-game", "name": "Abcdefg - Motomami Game", "name_original": "Abcdefg - Motomami Game", "description": "<p><strong>ESP</strong></p>\n<p>Pulsa letras en tu teclado para que Rosalía te diga palabras que empiecen por esa letra.</p>\n<p>Recrea su canción <strong>Abcdefg</strong> del disco Motomami, ¡o escribe lo que quieras!</p>\n<p>Escribe y ¡descubre palabras ocultas! Puedes ver las que has encontrado en el apartado \"Secrets\" o leer pistas para encontrar las que te falten. ¡Intenta encontrarlas todas!</p>\n\n<p><strong>ENG</strong></p>\n<p>Type a letter on your keyboard to make Rosalía to say things that start with that letter.</p>\n<p>Recreate the song <strong>Abcdefg</strong> of Motomami Album or write what you want!</p>\n<p>Write and discover secret words! You can see the ones you finded on the \"Secret\" menu or read hints to find the remaning ones. Try to get them all!</p>\n\n\n\n\n<p><strong>¿Cómo descargar y jugar?</strong></p>\n<p>Pulsa el botón rojo que pone \"Download Now\". Aparecerá una pestaña donde podréis poner el precio que queráis pagar por el juego. Por supuesto, puedes poner 0.00$ si quieres jugarlo gratuitamente. Allí, descarga Abdefg_TheGame.rar. Si tienes un programa de descomprimido de archivos como WinRar o 7Zip solo tendrás que abrir el archivo y dentro dar doble click a Abcdefg.exe. Si no, tendrás que descomprimirlo primero.</p>\n\n<p><strong>¿How to download and play?</strong></p>\n<p>Press the \"Download Now\" red button. A window will appear where you can put the price you want to pay. Of course, you can pay 0.00$ to play free. There, download Abcdefg_TheGame.rar. If you have an unarchiver software like WinRar or 7Zip you only have to open the file and double click the file Abcdefg.exe. If you not have it, you have to unarchive it first.</p>", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-04-18T12:24:52", "background_image": "https://media.rawg.io/media/screenshots/605/605deb7802a700020ea33b794753f8df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alejandro núñez"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}