{"id": 77235, "slug": "ninja-punch-boxing", "name": "Ninja Punch Boxing", "name_original": "Ninja Punch Boxing", "description": "Climbing to the top of the world ranking is not too easy. Some bigger dreams never come true without hard work and great pain. Learn from lives of professional ninja boxing fighters. Learn from their cruise, which took them from beginners to legendary hero status by playing Ninja Boxing Punch Fight Game on your mobile.<br/><br/>Do you love fight and actions? <br/><br/>Play the best Ninja Boxing Punch Fight Game. Join the world of action venture where you are going to get the taste of real boxing in ninja mode. Rush in to the game. Train yourself better and get ready for the deadly challenges against legend ninja punch boxers, grow your career line and relive the epic boxing saga in real action. <br/><br/>Ninja Boxing Punch will engage you in the hardcore ring side action. This includes hard punches, Master jabs, body punches; combine devastating special punches, hooks, counters, uppercuts and many ultimate combos to KO your opponent fighter. Find your own fighting style and your one lucky power punch can make you world champion. <br/><br/>Prove yourself a best boxing warrior and fight against the legendary champions by firstly beating lower level fighters, beat them all and claim their epic gear. Enhance your fighting to grow your stat to get your glory.<br/><br/>- Learn: <br/>Master your self defense by playing GAME and learn hand to hand fight, unarmed against criminal activities with punches and kicks.<br/><br/>- Amazing graphics and sound effects:<br/>3D realistic graphics, boxing arenas and sound effects will provide you a real exposure of ninja boxing.  <br/><br/>- Combative action game play:<br/>Range of devastating punches and combos with immense quality animations on each move. Knockout your opponent using special game changing power up’s, feel each move in real. <br/><br/>- Made your own ultimate fighter: <br/>Choose your fighter you like and start sharpening your player boxing skills, stamina, strength and endurance to stand out in the battle with dangerous famous fighters. <br/><br/>- GAMEPLAY MODES:<br/>- Career mode:<br/>Fight over with several different fighters a never ending action journey.<br/>- Knock out mode:<br/>Fight and knockout different professional boxers around the world in lesser rounds and make records.<br/>- Battle mode: <br/>Bloom your ninja boxing career, beat famous legendary ninja boxing champions and gets their place.  <br/><br/>- Fascinating social features:<br/>- Get punctual and play ninja boxing punch regularly, come back daily to get your amazing prizes and daily rewards.<br/>- Use leader board and level screened to impend on your box fighting career line.<br/>-  Play Ninja Boxing Punch while sitting with your friends and see who can knockout in lesser fight rounds.<br/><br/>- Join Endless Experience: <br/>Hundreds of exciting and dramatic fighting events, tournaments, title fights, story fights and intrusive challenging fights in a single game pack. <br/><br/>- Be Social For More:<br/>To keep yourself update about new features and games join our social pages", "metacritic": null, "released": "2018-08-04", "tba": false, "updated": "2019-10-22T14:24:27", "background_image": "https://media.rawg.io/media/screenshots/e6d/e6d765e82e46e91a928e266245519cd2.jpg", "website": "http://www.facebook.com/myFinz", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["S Tanveer Hussain"], "genres": ["Action", "Sports"], "publishers": ["S Tanveer Hussain"], "esrb_rating": "Teen"}