{"id": 772461, "slug": "xenoseekers", "name": "XenoSeekers", "name_original": "XenoSeekers", "description": "<p>43 Years Ago, an unidentified alien spacecraft, broke apart in low orbit. Debris from the wreck was scattered across the Earth. This was just the beginning, as soon, large parts of the spacecraft collided with Earth, including its reactor. The reactor’s fumes coated the planet with a toxic substance that caused mutations across species. The remnants of humanity appropriated the alien tech found in the debris to build domed cities and survive. Unfortunately, replacement parts couldn’t be made, so a new initiative was required. Enter the Relic Seekers: those who travel the wasteland searching for alien technology. Your personal goal? Make as much money as possible.</p>\n<p> CAUTION: This game is actually pretty hard. For best experience use an XBox controller.<br/></p>\n<p>Features:\r\n  </p>\n<ul><li>5 Dungeons\r\n  </li><li>50+ Items\r\n  </li><li>25+ Enemies\r\n  </li><li>A killer soundtrack\r\n  </li></ul>\n<p> \r\n  </p>\n<p>Controls:\r\n  </p>\n<p>Q,E / RB,LB – Turn\r\n  </p>\n<p>W,A,S,D / Left Joystick – Move\r\n  </p>\n<p>J/A – Interact / Basic Attack\r\n  </p>\n<p>K/B – Menu / Cancel\r\n  </p>\n<p>L/Y – Drop Flare\r\n  </p>\n<p>Left Shift / X – Sprint\r\n  </p>\n<p>Sprint + Interact – Skip Turn</p>\n\n<p>Strategy - Home Base</p>\n<p>- Sleep in the bed to save the game. Save often as you'll have to restart when you die</p>\n<p>- Purchase items on the computer. Coordinates are used to unlock dungeons. Crystals are one time use items that release a powerful attack, they are very helpful if you run into a boss. Other expensive items are modules for your robot and give you access to strong attacks. It is recommended to start by buying 3 bandage</p>\n<p>- The tinker table allows you to equip up to 3 attacks and one passive. Passives include: A minimap, armor, and healing</p>\n<p>- The storage locker allows you to stash items away so they don't take up inventory space</p>\n<p>- The driver's seat lets you move to another dungeon once unlocke</p>\n<p>- Finally the door lets you enter the dungeon</p>\n\n<p>Dungeon Strategy:</p>\n<p>- Your goal is to find a way to advance to the next floor. In the first dungeon, look for a mound</p>\n<p>- Your other goal is to collect items, an average of 5 items will spawn per level in rooms. There are many kinds of items of varying uses. Bandages replenish health. Batteries replenish your robot's energy. Pills increase your maximum health permanently. Capacitors increase your maximum energy permanently. Whetstones increase your basic damage permanently. Scrap sells for a lot of money and has no other use. Gears are attack and utility modules, they are extremely rare and you should always make them a priority. Finally oxygen tanks will reset your oxygen</p>\n<p>- pressing L or going into the menu lets you drop a flare. Flares can be used to mark where you've been and help navigation significantly pre-minimap</p>\n<p>- pressing J will allow you to use a basic attack, it is weak but costs nothing</p>\n<p>- within the k menu you can use items or robot attacks</p>\n<p>- there is no reward for killing enemies they are simply an obstacle</p>\n<p>- if you hear boss music... Run</p>\n<p>- be careful when moving in range of an enemy, they will attack you first. Instead hold the sprint button and press interact to skip your turn. This will allow you to keep the initiative</p>\n<p>- always keep an eye on your health.</p>\n\n<p>Credits:\r\n  </p>\n<p>Developed by HiImWren\r\n  </p>\n<p>Art by Dorii\r\n  </p>\n<p>Music and Sound Design by Evan G. Griffith\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Known Issues:</strong></p>\n<p><strong>Fully exiting the game will corrupt the save data. You will know this occurred if you see ITEM 1 appearing in the driver's seat, or if accessing inventory or shop doesn't work. To fix, max sure that you select new game.</strong></p>\n<p><strong>Do not enter the Bloodvine Sewers without an escape ring. After reaching floor 6 the dungeon currently breaks. </strong></p>\n<p><strong>Scrolling in the UI requires the mouse.\r\n  </strong></p>\n<p><strong>If you hover over a UI element with the mouse, the joystick will “detach” from the UI until a new window is opened.</strong></p>\n<p><strong>Firearm is actually a \"Fire\"-arm</strong></p>\n<p><strong>Item duplication can occur when equipping modules. Enjoy it while it lasts :)</strong></p>", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-04-18T13:31:00", "background_image": "https://media.rawg.io/media/screenshots/9d2/9d2871565396cfe3cc5880ae65330dfb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HiImWren", "Evan G. Griffith", "dorii"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}