{"id": 772561, "slug": "general-practitioner-2", "name": "General Practitioner 2", "name_original": "General Practitioner 2", "description": "Live the life of TWO doctors in this brand-new medical simulated Visual Novel. Andrew and Julie are siblings and MDs and they recently inherited a once-renowned medical clinic from their aunt. Join them in rebuilding the clinic, hiring staff and living their lives.<br/><br/><strong>This time there are two of them!</strong><br/>Choose to live each chapter of the main story from Andrew or Julie's point of view. Different paths mean different stories to unfold, people to meet and consequences to play!<br/>Make them professional, respected doctors or corrupt them down to a path of money, lust or even crime! While a sibling might be a saint, the other one might be the exact opposite! Who knows where you could get them into!<br/><br/><strong>Clinical cases</strong><br/>In the best tradition of the General Practitioner franchise, dozens of clinical cases to explore. Choose the correct way to diagnose an illness with the renewed codex, or do your best to ruin people's lives by giving them a wrong diagnosis. You could also try and get some extra cash by threatening them by exposing some dirty secrets to their family or local police. It's up to you.<br/><br/><strong>Medical accuracy</strong><br/>Written with deep research and the help of a real MD, General Practitioner 2 focuses on medical accuracy. Every medical information you will find in the game is consistent with the actual medical knowledge. Please remember this is a game, however, and if you need medical help you should always ask your doctor to help you.<br/><br/><strong>New gameplay</strong><br/>Hire new staff members and manage the hospital in a new story-based gameplay. No more idle days trying to figure out what to do. The game is a full story and even hiring staff and managing stuff (!) is always story-oriented. No chapter will be like another as you get to know pediatricians, midwives, tech gurus, social media marketers and nurses!<br/><br/><strong>Game over IS possible</strong><br/>Make the wrong choices and the clinic will be shutted off. You will need to balance your bad habits in a way the Medical Board won't open an investigation against you. And if they will... It's up to you to change their mind.<br/><br/><strong>Optional Sexual encounters</strong><br/>You can try to flirt and romance dozens of characters in the game, including coworkers and patients! But beware, not everything is what it looks like!<br/>The game won't be rated 18+ on Steam since Vanilla mode will always be active. Vanilla mode is a feature which disables nudity content. You can find every information about Vanilla mode and how it works on the game's main website!<br/><br/><strong>General Practitioner 2: are you ready to become a doctor again?</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-22T04:11:59", "background_image": "https://media.rawg.io/media/screenshots/21b/21b4bed83cac0bf42da0da2d7c2f1209.jpg", "website": "https://generalpractitionergame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Bruni Multimedia"], "genres": ["Simulation", "Indie"], "publishers": ["Bruni Multimedia"], "esrb_rating": null}