{"id": 772509, "slug": "creature-simulator", "name": "Creature Simulator", "name_original": "Creature Simulator", "description": "<p>You are a semi-powerful god overseeing creatures (the spider-looking things). The creatures can eat food (little red spheres), and can also eat smaller creatures. These creatures have traits such as size, speed, and a smell radius. However, these creatures EVOLVE. Survival of the fittest. They pass those traits to the next generation, with a chance of mutation. Some of these creatures can pollute, which can increase temperatures and kill off the whole population. You have to \"steer\" evolution to save the creature population by giving creatures cookies and smiting them with a lightning bolt. However, these resources do not come free.There is a management window where you can manage the amount of cookies and lightning bolts that you have and can produce per second. Manage it wisely, as the world can get pollution from that as well. You must find the balance to save the population. The fate of the creatures are in your hands</p>\n<p>Controls:<br/>Use WASD to move around<br/>Hold SHIFT to look around 360*<br/>Hold CTRL to sprint<br/>Click on a creature to view its info<br/>Interact with buttons and sliders<br/>Press ESCAPE to quit to main menu</p>\n<p>Credits:<br/>Developers: Mateo Rissman, Asher Fogg<br/>Made with: Unity Personal 2020.3.26f1<br/>Other Tools: Adobe Photoshop 2022<br/>Music: \"Black Mass\" by Brian Bolger<br/>Special thanks to Rhazes Spell, and Games for Change.</p>", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-04-18T13:56:17", "background_image": "https://media.rawg.io/media/screenshots/e4f/e4f9ae2497e8182c77266beefaed713e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["twelfth dimension"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}