{"id": 772593, "slug": "codestar-dungeon-xing-lao-shi-lian-suo", "name": "Code:STAR DUNGEON 星牢:试炼所", "name_original": "Code:STAR DUNGEON 星牢:试炼所", "description": "Code name: Star Prison is a high-degree-of-freedom hack, slash, shooting and magical dungeon game. The player is almost never locked in a fixed room in the game, which brings a high degree of freedom of combat and breakthrough experience.<h3>The main features of the game:</h3>Multi-role real-time switching of the battle system, players need to constantly go deep into the star prison, constantly collect new characters, and use the acquired resources to improve their performance and unlock new talents.<br/>      More characters will bring more matching combinations. Players can choose three characters to form a team to enter the star prison adventure. The proficient mastery of roles and skills and reasonable matching will make you deeper into the star prison and get closer The whole ending.<br/>      Once as a science fiction writer, the wonderful plot is also the highlight of the game, and the final ending will take many weeks to truly be revealed.<br/>      In the Star Prison, players will also prepare a large number of well-designed level gameplay and props, characteristic NPCs, various elite monsters, and bosses, making the game experience worthwhile.<h3> Message from the production team:</h3>      The code name Xinglao is an independent game carefully developed by Neon Cell Studio. The working group promises to continue to update and bring more high-quality content to players.", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-22T04:50:44", "background_image": "https://media.rawg.io/media/screenshots/248/24887a5ec2e4fb5afb2c7ea311f1ee27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Neon Cells Studio"], "genres": ["Action", "Indie"], "publishers": ["Neon Cells Studio"], "esrb_rating": null}