{"id": 772542, "slug": "signals-of-chaos", "name": "Signals of Chaos", "name_original": "Signals of Chaos", "description": "<h3>In the beginning:</h3>You find yourself in a vessel adrift and alone. With no other paths forward you jump into combat against a fiercesome foe. Odds are greatly stacked against you when you do, and the only way to survive is with upgrades, allies, power adjustments and grit. Once you gather enough resources from this endless stream of chaos, you can choose to jump back to safety. If you do, you might begin to realize that there is more to this world than meets the eyes.<br/><br/>Your ship is filled with systems both ambient and interactive. Some are for combat, where others are for gaining a better understanding of the larger universe that surrounds you and your vessel.<br/><br/>If you enjoy immersive tower defense style space combat games with a deeper universe that you can choose whether or not to explore, then this is the game for you!<br/><br/><h3>What's included:</h3><ul><li>Your own virtual “space” ship.<br/></li><li>An intense variety of ship upgrades.<br/></li><li>Electrifying power distribution options.<br/></li><li>Ally ships that can give you a helping hand in destruction.<br/></li><li>Endless waves of enemies.<br/></li><li>Hidden secrets and lore to a greater universe.<br/></li><li>Command bindings, allowing you to set combat controls to any key combination.<br/></li><li>Highscores and leaderboards.</li></ul><h3>A quick note:</h3>Do bear in mind that this is a smaller game. You won’t get a vast fully immersive universe here, but you will get a compact thrilling and challenging experience that’s polished with care!", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T03:49:05", "background_image": "https://media.rawg.io/media/screenshots/2df/2dfbe7ded5641fa20b1e1e3a137d842b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Memory Delta"], "genres": ["Action", "Indie"], "publishers": ["Memory Delta"], "esrb_rating": null}