{"id": 772587, "slug": "retirement-simulator", "name": "Retirement Simulator", "name_original": "Retirement Simulator", "description": "Dear retirees, welcome to Retirement Simulator!<br/><br/>In this game, you will encounter hilarious retirement stories, experience various lifestyles and fulfil your ultimate goals in unusual and bizarre ways.<br/><br/><strong>Want to travel around the world?</strong><br/>Arrange your worldwide travel schedules, visit various sights and tourist attractions and collect the souvenirs. In need of more money? Feel free to write down your travel stories and earn yourself a first-class ticket!<br/><br/><br/><strong>Want to become a global influencer?</strong><br/>With your camera on, nothing can stop you from being an Internet celebrity. Do live streaming, earn more followers or even engage yourself in a flame war… Do everything you can to catch the eye and dominate the cyber world!<br/><br/><br/><strong>Want to live as a KungFu Master?</strong><br/>Promote traditional KungFu and let it thrive! Learn the moves, accept disciples, develop different branches and grow your sect! Create your own invincible KungFu moves, defeat the enemies and become a KungFu Grandmaster!<br/><br/><br/><strong>Want to lead a fulfilling life?</strong><br/>Take your time to raise different pets - be it a cat, a dog, a parrot or even a ​​marmot. Encounter a wide range of unique characters to know about their stories, prepare yourself for all kinds of social events, decorate the community center, and play various minigames including the deck-building battle. Your busy retirement life starts from here!<br/><br/><br/><strong>Want to set your own pace?</strong><br/>Just plan your retirement life at your will and forget about your lofty aspirations. Do what you like and develop yourself into a unique individual in the coming 2 years!<br/><br/><br/>DoubleThink Studio sincerely invites all of you to claim the retirement certificate that only belongs to you. Grab it now and kick start the retirement life that goes beyond your imagination!<br/><br/>Contact email: retire@doublethink.wang", "metacritic": null, "released": "2022-04-19", "tba": false, "updated": "2022-04-22T04:43:31", "background_image": "https://media.rawg.io/media/screenshots/24c/24c53c73ea15483006eadfd1264d04e1.jpg", "website": "https://weibo.com/u/7292196131", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 7, "achievements_count": 16, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DoubleThink Studio"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["DoubleThink Studio"], "esrb_rating": null}