{"id": 772547, "slug": "coal-mining-simulator-prologue", "name": "Coal Mining Simulator: Prologue", "name_original": "Coal Mining Simulator: Prologue", "description": "<strong>Welcome to the world of Coal Mining!</strong> <br/><br/>Start with almost nothing and get to the top - develop your mine, sell coal, buy new machines and avoid dangers in this sandbox simulator.<br/><br/><br/><br/><br/><strong>Coal Mining Simulator </strong>is a sandbox experience in which it's up to you to create new tunnels and pathways. Make your mine truly yours, as you go deeper and deeper in order to mine more coal.<br/><br/><br/><br/><br/><strong>Take control of numerous mining machines.</strong> Destroy, mine, drill, transport and blow things up - just remember to follow safety protocols and regularly maintain your equipment. Nothing works forever - if something gets broken, it's up to you to repair it.<br/><br/><br/><br/><br/>There is no end goal in <strong>Coal Mining Simulator</strong> - you can take contracts and complete special assignments to get unique rewards or just follow your own path. The choice is yours!<br/><br/><br/><br/><br/>Mining is a dangerous job. Avoid earthquakes or gas explosions and be prepared for anything - whatever you buy, you can very easily lose if you are not careful!<br/><br/><strong>You think it's enough? Wrong! Because you can also:</strong><br/>-Exchange resources<br/>-Manage your heavy equipment and expand your kingdom for more resources<br/>-Be a master of micro and macro management in your coal kingdom<br/>-Be the biggest and fastest coal supplier in you region<br/><br/>And many more!", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T03:55:04", "background_image": "https://media.rawg.io/media/screenshots/6cb/6cb9ddb957c81b30955c7ffb88eb52b5.jpg", "website": "https://grandegames.pl/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Grandé Games"], "genres": ["Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["G-DEVS.com", "GamePlanet"], "esrb_rating": null}