{"id": 77255, "slug": "soccer-blocky-hero-mobile-ed", "name": "Soccer Blocky Hero – Mobile Ed", "name_original": "Soccer Blocky Hero – Mobile Ed", "description": "Love to play football?? Soccer Blocky Hero has brought you the new era soccer for the lovers of football playing in a gaming mode best for kids and adults. People want something new and we have brought in the change with unique advance effort in soccer football. Soccer Blocky Hero is a best high paced 3D graphics football game; you will get most amazing fun experience of soccer with this mingled realistic physics and humorous lofty paced game. It takes its place in new games. <br/><br/>Grab your football run, dribble, use head shot, power kicks swipe right and left to aim and shootout the ball to score a goal by dodging the rivals and driving through the defense in a professional approach and be a score hero. The whole world is waiting for your action, the field is full of crowd, show your blocky soccer action and get your place you justify, get all the excitements and tensions. Play gently to win the soccer match. Enjoy the all new blocky soccer game with your own tactics in the match and take on thrilling clash action that drop you into your soccer passion with challenges on career line. <br/><br/>Learn soccer in pixels art game, strive through tournaments and dream leagues to climb leader boards and get winning awards, keep up with more amazing features.<br/><br/>3D HIGH PACED GRAPHICS:<br/>High quality cubic graphic and physics to bring you classic 3D soccer ball experience. Now play the modern version of retro soccer in new behavior as you use to play. <br/><br/>GAME CONTROLS ARE SUPER EASY:<br/>-  \"Pass button\"  for pass and tackle.<br/>-   \"kick button” for shoot the ball.<br/>-  \"Sprint button\" for fast running.<br/>-  \"joystick” to control the movement of the player.<br/><br/>COMPETITIVE GAMEPLAY MODE:<br/><br/>Play different club matches. Train your team well as a best coach and dominate yourself as a super team captain and take your squad toward leagues like Spanish, English, German and French. Qualify in championship series and battle against different legendary famous team’s super stars and icons to take their place and win champion trophy.<br/><br/>AMAZING STADIUM ENVIRONMENTS AND SOUND EFFECTS:<br/>Crowd is all around you, imagine yourself a team player and team manager and you need to win the championship, select stadium of your choice from several soccer field distinctions. Select the suitable for your better experience. Enjoy the intuitive sound effects for your realistic practice.<br/> <br/>CUSTOMIZE YOUR OWN FASCINATING TEAM PLAYERS:<br/>Customize your players, their skills, create ultimate squad and chart your track to world cup. Use coins to unlock and enhance your soccer champs speed, power and attack skills. Create best striker, midfielder, defender, attacker and goal keeper, also explore different countries teams and uniforms, select the right what you love.<br/> <br/>FASCINATING BLOCKY PIXEL SOCCER SOCIAL FEATURES:<br/>Playing blocky soccer will draft you come back daily to collect daily amazing prizes to unlock different tournaments, series and leagues, use leader board and qualifying league screened to watch your career line and achievements you have done. Make it personal and Start contesting your friends, invite and play mobile pocket soccer anywhere with friends and see who the champion of blocky soccer football is. <br/><br/>FEEDBACK: <br/>If you have any suggested features or improvements please leave a comment. In case something is not working correctly please let us know, I'll be glad to fix that. <br/>Please post comments and feedback. When posting low rating please describe what is wrong to give the possibility to fix that issue.", "metacritic": null, "released": "2018-08-05", "tba": false, "updated": "2019-10-22T14:24:27", "background_image": "https://media.rawg.io/media/screenshots/870/870db74606bd1dbfda16c8e83694c5be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hamza khalid"], "genres": ["Simulation", "Sports"], "publishers": ["hamza khalid"], "esrb_rating": "Everyone 10+"}