{"id": 772583, "slug": "smys-show-me-your-stairs", "name": "SMYS: Show Me Your Stairs", "name_original": "SMYS: Show Me Your Stairs", "description": "SMYS is local multiplayer party game <strong>(NO SINGLEPLAYER MODE)</strong>. Challenge your friends in this building race to the top! Gather blocs during various minigames and then use them to build your stairs as fast as possible, use your items wisely to create disturbance into your friends' minds and capture the flag first.<br/><br/>-<br/><br/>In SMYS, you play as a zglub, a little mouthless creature, and as a member of the Mighty Flag tribe it is no surprise you'd be willing to fight over your comrades to be the first to touch a flag suddenly falling from the sky to receive its blessing. Through the use of canons, grapples and trampolines you'll be gathering blocs to build a staircase to the mighty flag.<br/><br/><h3>PICKING PHASE</h3>Each round always starts with a picking phase during which you'll play one of various minigames the game has to offer. During these minigames you'll have to gather a library of blocs and items to be used later in the game. In most minigames, all players will have access to the same blocs and items and will have to fight over each others to add the items they want to their personal library.<br/><br/><br/><h3>BUILDING PHASE</h3>After the picking phase, the building phase starts. Your goal is to build a staircase that allows you to capture the flag before the other team. It is the main stage of the game in which you'll be using all the blocs and items you have gathered previously. Here starts a building race during which you'll have to choose wisely how to place the blocs you have gathered and when to use the special items you have gathered to slow the opposing team as much as possible. <br/><br/><br/>When one player captures the flag, he scores for his team and another round begins.", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-22T04:36:23", "background_image": "https://media.rawg.io/media/screenshots/ad2/ad2db5c465f319460288063378fc7c07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["StarvingFox Studio"], "genres": ["Action", "Casual", "Indie"], "publishers": ["StarvingFox Studio"], "esrb_rating": null}