{"id": 772615, "slug": "between-two-stars", "name": "Between Two Stars", "name_original": "Between Two Stars", "description": "Between Two Stars is a 2D procedurally generated space exploration game. Players take control of a newly constructed Pytheas class starship, as part of a simulation on behalf of the Orpheus Corporation and explore the Sierra Galaxy via their ship's jump drive to discover new worlds and new materials with which to trade, craft and build bases.<h3>Explore</h3>The Sierra Galaxy consists of approximately 500 million star systems to explore, each with different configurations of raw materials to be harvested. The procedural generation means each star system consists of anywhere between one and a dozen planets, with their temperature, mass, atmospheric conditions all determined by their proximity to their star (or stars).<h3>Harvest</h3>Harvest planetary samples by building and deploying probes. Probes gather samples of the planet's raw materials. Every star system has a different makeup of minerals, gases and chemicals - each of which have different strengths and weaknesses, that affect their crafting quality. Some planets are capable of supporting life, allowing players to harvest not only inorganic materials but flora and fauna from the planet.<h3>Craft</h3>Craft better ship parts, such as engines, jump drives, power generators, and comms arrays - or use materials to build new bigger and better ships, or space stations. Need more resources? Build mining and harvesting platforms to harvest minerals in a system whilst you're offline or away exploring.<h3>Trade &amp; Socialise</h3>Build space stations to control a system, and get a cut of the traffic and trade that flows through it. Build marketplaces on your station to allow players to trade the raw materials they find or the objects they craft with one another whilst taking a cut of the credits that change hands. Build better comms array for your ship so that you can receive messages from systems further away and cast a participate in a wider community.", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T05:15:11", "background_image": "https://media.rawg.io/media/screenshots/412/412471e7018a39801391a07955534adf.jpg", "website": "https://betweentwostars.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["AdamGreen.tech"], "genres": ["Strategy", "Massively Multiplayer"], "publishers": ["AdamGreen.tech"], "esrb_rating": null}