{"id": 772649, "slug": "motogp-22", "name": "MotoGP 22", "name_original": "MotoGP 22", "description": "<p>Engines running: let’s get the most immersive and authentic MotoGP™ gaming experience ever started.THE ENTIRE MOTOGP™ WORLDExplore all the contents of the 2022 season in the MotoGP™ classes and in all the other categories.<br />\nMore than 120 riders, over 20 official circuits and all the excitement of the official championship are waiting for you.<br />\nAnd if you want to take a leap into the past, over 70 historic champions will let you relive the best of MotoGP™ history.NINE SEASON 2009Relive one of the most exciting championships in MotoGP™ history!<br />\n17 Chapters, one for each Grand Prix of the 2009 season, lie ahead! Put yourself in the boots of legends such as Rossi, Lorenzo, Stoner and Pedrosa at the peak of their careers. In each episode you will face different challenges reliving firsthand the most iconic moments of the world championship.<br />\nAll contents will be enhanced by more than 50 minutes of real footage at the beginning of each chapter, entirely narrated and directed by the extraordinary Mark Neale.WHERE CHAMPIONS ARE MADEEnter the MotoGP™ ACADEMY to reveal the champion in you: through new game challenges you will learn all the tricks of the trade to be the fastest on every track.<br />\nBecome the rider you&#39;ve always wanted to be with new tutorials that will help you improve quickly through short gameplay sessions.ENJOY THE MOST REALISTIC GAMING EXPERIENCE AND CUSTOMIZE YOUR RACEDive into the most realistic and immersive MotoGP™ experience ever!<br />\nFrom the faces of your heroes to the restyling of the official pits, attention has been given to every detail like never before!<br />\nCreate your world in the MotoGP™ videogame and ride with even more style. By using 5 graphic editors, you will be able to customise every look of the game, from the liveries to the riders’ suits.PLAN YOUR SUCCESS WITH THE MANAGERIAL CAREER!Create your own team or join an official one. Choose your staff and develop your bike improving engine, frame, aerodynamics, and electronics: take full control of your gaming experience!<br />\nCreate a junior team in Moto2™ and Moto3™: hire a team manager, technical director and a rider to achieve new goals.NEW MULTIPLAYER MODEFor the first time in the franchise, you will be able to challenge your friends in split-screen mode. Don&#39;t miss this chance!</p>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2024-01-07T03:18:08", "background_image": "https://media.rawg.io/media/screenshots/d22/d226e97c3afcc046d11cc331a557bddc.jpg", "website": "http://motogpvideogame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 31, "beaten": 1, "toplay": 1, "dropped": 4}, "playtime": 3, "achievements_count": 100, "ratings_count": 3, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC", "Nintendo Switch", "Xbox Series S/X", "Xbox One", "PlayStation 4", "PlayStation 5"], "developers": ["Milestone"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Milestone"], "esrb_rating": "Everyone"}