{"id": 772632, "slug": "another-path-2", "name": "Another Path", "name_original": "Another Path", "description": "A concealed island extends closer to you. Investigate this mysterious yet mesmerizing desolated land in the supernatural world of <strong>Another Path</strong>, a single-player puzzle exploration game. You play as <strong>Evan</strong>, a little boy that deserted on an uninhabited island in the middle of the ocean. After getting separated from your parents, you have to find a way home in a forest full of wildlife, abandoned ancient civilization, and a monumental building that invites your whole being. Equipped with an arcane amulet and a determination to go back home, you got accompanied by a peculiar wolf that will accompany you to explore this obscure island, enter the core of the building, and discover its hidden mysteries.<h3>Key Features:</h3><br/><br/><strong>Explore and Investigate</strong> - Discover this desolated land while keep looking for your way home step by step. Interact with wild animals, pick up and examine items you found, or take a walk to take in the nature <br/><br/><strong>Solve puzzles</strong> - Pave your way through the abandoned buildings in the middle of ancient civilization and their concealed stigma<br/><br/><br/><strong>Switch characters</strong> - Swap between Evan and the peculiar wolf to understand both capabilities in between solving complex puzzles or exploring unveiled areas<br/><br/><br/><strong>Find secrets and collectibles</strong> - Immerse yourself more into the background of this little boy by divulging dozens of secrets and collectibles<br/><br/><strong>Be immersed</strong> - Get in a mesmerizing world full of imaginable wonders through the mixture of fascinating music and environment<br/><br/>If you enjoyed the following games, you'll love Another Path:<br/>- RiME<br/>- Lost Ember<br/>- The First Tree<br/>- Spirit of the North", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-22T05:38:33", "background_image": "https://media.rawg.io/media/screenshots/cff/cff91def5ccd2fad6362ad4469f5b375.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MyHand Studio"], "genres": ["Adventure", "Indie"], "publishers": [], "esrb_rating": null}