{"id": 772639, "slug": "puzzle-battler-mirai", "name": "Puzzle Battler! Mirai", "name_original": "Puzzle Battler! Mirai", "description": "<h3>Skill attack and defense is surprisingly exciting!</h3>Chain the pieces and activate skills!<br/>If you time Skill with the boss's special move, you can activate \"Skill Double Payback\"!<br/><br/> - The more you chain, the faster your skill activation!<br/>Whether to focus on skill activation with skill pieces or recovery priority with heart pieces...the order in which the chain is assembled is also important.<br/><br/>- Monitor the HP remaining and get the chain of custody ready quickly!<br/>Enemies will attack while the piece is also moving.<br/>Let's keep an eye on the HP remain and consider whether to start the chain or stick around a little longer.<br/><br/>- It's \"Skill Double Payback\" against the boss's special move!<br/>If then skill effects can be doubled, for more damage and effectiveness.<br/>Let's go for it aggressively!<br/><br/><br/><br/><h3>Collect skills and upgrade!</h3>Defeat an enemy, you may get that enemy's skills from the treasure.<br/>Collect many useful or weird skills by defeating various enemies.<br/><br/>Chained EXP pieces can be used to upgrade skills. Keep upgrading your favorite skills.<br/>Skills have a rarity. The higher the rarity, the greater the maximum level.<br/><br/><br/><br/><h3>You can play at your preferred difficulty level</h3><br/>Whether you want to wipe out the zako-enemies in a crispy fashion or progress through the higher stages with a thoughtful skill structure, please enjoy the game the way you like to play it.<br/><br/>If you just can't get through, use the living expenses (Coin pieces) you've collected to help raise Mirai-chan!<br/><br/><br/><h3>Kawaii pixels and a cheap story!</h3>The main character Mirai-chan was restless with her secret debt.<br/>One day, she is lured by a free crepe ticket and goes to rescue a kidnapped princess, but...<br/><br/>Loose kawaii characters add a certain amount of flair through cheap skits between puzzle battles.", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T05:48:27", "background_image": "https://media.rawg.io/media/screenshots/0f0/0f0e601d40e7adcad0347330577d6d02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wandering Wonder Studio"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Wandering Wonder Studio"], "esrb_rating": null}