{"id": 772646, "slug": "samurai-bringer", "name": "Samurai Bringer", "name_original": "Samurai Bringer", "description": "<p>Samurai Bringer is a roguelite action game with levels which change with every playthrough, where you cut down hordes of Samurai and Demons to collect combat techniques and polish your fighting style in order to defeat Yamata-no-Orochi, the eight-headed dragon of Japanese mythology.Regain your divine power and challenge Yamata-no-OrochiSusanoo, a powerful deity, challenged Yamata-no-Orochi to save Kushinada, who was to be sacrificed to the dragon. However, he was bested by the dragon and his power was taken from him.<br />\nCast down to the land of Nakatsukuni, now he must fight a multitude of samurai and demons summoned from across space and time to regain his lost strength…<br />\nMix and match combat techniques to create your own fighting styleDefeat the advancing hordes of samurai and demons to obtain Combat Scrolls.<br />\nTechniques such as slice, thrust and jump can be equipped to change the way you attack.<br />\nFurthermore, you can create your own loadouts with Combat Techniques to create your very own combat style.<br />\nFrom spinning slashes to fire attacks and even combos to chain your attacks together. Build up your own fighting style for a combat experience unique to you.<br />\nDefeat over 100 legendary Japanese warriorsOver 100 legendary warriors from Japanese legend and history including Oda Nobunaga, Date Masamune and Sanada Yukimura will be summoned to stand against you.<br />\nDefeating them will reward you with their weapons and armor imbued with various status boosting effects.<br />\nDonning this armor will not only give you an advantage in battle, but also add a little style to your loadout too.<br />\nAccumulate experience and strength through defeatLevels are procedurally generated, with enemy placements and type being different every time, which also means different Combat scrolls for you to collect.<br />\nFalling in battle does not mean you lose everything, so keep building up your loadout and fighting style until Susanoo regains his lost strength.<br />\nPrepare yourself by creating a versatile loadout to deal with various combat situations and aim to bring down the mighty eight-headed dragon, Yamata-no-Orochi.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-03-17T09:35:15", "background_image": "https://media.rawg.io/media/games/204/2042f465a2fc9453cee10e8b5569ba12.jpg", "website": "https://playism.com/game/samurai-bringer/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 44, "toplay": 2, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 90, "ratings_count": 1, "suggestions_count": 508, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Nintendo Switch", "PlayStation 4"], "developers": ["ALPHAWING"], "genres": ["Action", "Indie"], "publishers": ["Playism"], "esrb_rating": null}