{"id": 772630, "slug": "detour-bus", "name": "Detour Bus", "name_original": "Detour Bus", "description": "ARRIVING 2021!<br/><br/><strong>Detour Bus</strong> is a VR construction-comedy adventure, where you build ridiculous winding highways, to take the dysfunctional Flowers family on a journey across Post-Infrastructure America. Nostalgia junkie Daddy Flowers aims to revive his family's bonds before the end of Summer vacation, by taking them on a good old-fashioned road trip, but stuck together in a restored microbus, workaholic Momma, communist-in-training Junior, and social-media-baby Goldie have a lot more to fight about than unite over. Meanwhile, the open road is under threat; you'll have to get in the construction groove to take on corrupt Senator Joseph McCarthief’s attempts to turn all freeways into pay-to-drive tunnels and reclaim your right to transportation.<h3>Featuring:</h3><br/><ul><li>play with the world's grooviest toy car track using accessible one-button snap-and-place controls <br/></li><li>eight iconic landmarks to navigate - from Mt. Busmore National Monument to the depths of the active Buscano<br/></li><li>explore environments in a unique psychedelic art style - never before seen in VR<br/></li><li>voice over from your passengers that responds to how you build<br/></li><li>a giant tow truck mech to take down<br/></li><li>bustomize your vehicle with hats, hubcaps, and more</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-22T05:36:24", "background_image": "https://media.rawg.io/media/screenshots/8dd/8dd0f2fb50321a683183b32fb6e0e5eb.jpg", "website": "https://detourbus.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Late Stage Interactive"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Late Stage Interactive"], "esrb_rating": null}