{"id": 772613, "slug": "darzas-dominion", "name": "Darza's Dominion", "name_original": "Darza's Dominion", "description": "The Dominion takes no prisoners! Fight for your survival in the unforgiving terrains that surround you, strengthen your hero through slaying the dangerous creatures, gather a group of allies to multiply your strength, and bring the battle to Darza!<br/><br/>As a cooperative bullet-hell MMORPG, Darza’s Dominion is a fast-paced game centered around being ready to dodge as many projectiles that can fit on the screen at once; the harder the difficulty, the more insane everything gets. You’re going to have to hope your reaction time is up to the test!<br/><br/>Taking back the Dominion is all about teamwork. Thankfully for you, all of your closest (and farthest!) friends can help you out! Group up in the Tavern, form a Guild, or just find them in the Dominion and take on the toughest challenges the game has to offer.<h3>FAST-PACED GAMEPLAY</h3>Face off against foes in a 2D orthographic roguelike featuring permadeath mechanics in a speedy bullet hell environment.<h3>UNIQUE CHARACTER CLASSES</h3>Discover the full power of seven class abilities by looting special gear capable of leveling the playing field.<h3>RANDOMLY GENERATED UNIQUE DUNGEONS</h3>Challenge the dungeon bosses of the Dominion in their own individually created stages and make it out alive.<h3>INTENSE BOSS FIGHTS</h3> Engage in battles against an expanding roster of bosses boasting different phases and collect loot along the way to upgrade your characters.<h3>MULTIPLAYER ONLINE BULLET-HELL</h3> Utilize your character classes and work together against Darza and his minions by fighting alongside dozens of players at any time against the perils that await you in the Dominion.<h3>VIBRANT PLAYER-BASED ECONOMY</h3>Sell and buy your way up to the top by bartering with other players in an economic environment controlled by players just like you.", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-08-22T00:10:33", "background_image": "https://media.rawg.io/media/screenshots/c1a/c1ac7cd2feacafd182a97a4827d6ee75.jpg", "website": "https://darzasdominion.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 61}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Ripple Studio"], "genres": ["Action", "Adventure", "RPG", "Massively Multiplayer"], "publishers": ["Ripple Studio"], "esrb_rating": null}