{"id": 772675, "slug": "trolley-problem-inc", "name": "Trolley Problem, Inc.", "name_original": "Trolley Problem, Inc.", "description": "<p>There is a runaway trolley careering down the railway tracks. On the tracks are five people unable to move. You are next to a lever. If you pull this lever the trolley will switch to a different set of tracks. However, you notice that there is a person on the other track.<br />\nWatch the situation play out and five people die. Choose to pull the lever and only one person gets killed - but by you.<br />\nWhat will you do?<br />\nAnd that’s just for starters. Trolley Problem, Inc. is a darkly comedic narrative game based on real world philosophical papers, in which you are asked to make a series of impossible choices from two awful answers. Wrestle with your moral compass, decide the fate of millions – and then see how your choices compare to the rest of the world.<br />\n<em> A tightly-wound, two-hour narrative experience.<br />\n</em> Questions are based on genuine philosophical papers, complete with references.<br />\n<em> It’s you vs The Narrator as every decision you make is challenged.<br />\n</em> Compare your choices with other players.<br />\n* Full Twitch integration - let your audience help guide your decisions<br />\nTrolley Problem, Inc. is a brilliant, challenging, uncomfortable, comedic game from Samuel Read-Graves, the executive producer of Gang Beasts.<br />\nWhat will you do?</p>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2023-11-01T08:35:08", "background_image": "https://media.rawg.io/media/screenshots/c96/c96f22a4854a347c4d2af07f2d79e9ac.jpg", "website": "https://www.yogscast.games/trolley-problem-inc", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 34, "beaten": 6, "toplay": 1}, "playtime": 2, "achievements_count": 12, "ratings_count": 4, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Read Graves"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Yogscast Games"], "esrb_rating": null}