{"id": 772678, "slug": "dickie-a-cumming-the-prequel-part-i", "name": "Dickie A Cumming: The Prequel (Part I)", "name_original": "Dickie A Cumming: The Prequel (Part I)", "description": "From the author who brought you the critically acclaimed paperback book, \"Dear Celebrity\", comes an altogether different beast as he turns his talents toward the digital medium of visual novel...<h3>Snowflake Warning</h3><br/>If you are easily offended, please be advised this is <strong>not</strong> the game for you. It is widely anticipated to become the <strong>most</strong> controversial game on Steam!<h3>Overview</h3><br/>In this third-person interactive visual novel, you play Dickie A. Cumming; a decorated war hero who has recently been discharged from the British army. As Dickie, you must come to terms with a new life on 'civi street' and a brave new world of 'wokeness', 'social justice warriors' and 'cancel culture'.<br/><br/>But Dickie is rather an old-fashioned chap who will struggle to understand these new concepts. As he naively grapples with this new era and the challenges it presents, Dickie inevitably comes into conflict and encounters hostile resistance. And, as if things weren't complicated enough, he finds himself afflicted with a severe sex addiction!<br/><br/>This is an erotic comedy that refuses to take itself (or the craziness of modern Western culture) too seriously! It represents the author's (often flawed) attempts to understand what is a rapidly changing political and societal landscape.<br/><br/><strong><h3>Features</h3></strong><ul><li><strong>Real influence</strong> - your decisions will truly influence the story. Up to four choices may be presented in a typical scene and each may lead to a new branch of the story.<br/></li><li><strong>Dynamic and animated scenes</strong> - many scenes feature moving images, special effects and animations.<br/></li><li><strong>3D Sex</strong> - most of the many sex scenes are presented in 3D and animated (with audio).<br/></li><li><strong>Multiple endings</strong> - depending on the pathways you choose, you will end up with one of many possible conclusions!</li></ul>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T06:39:28", "background_image": "https://media.rawg.io/media/screenshots/958/958bcf135c92b7006b607611a3f5e098.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Julian Henley"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["Julian Henley"], "esrb_rating": null}