{"id": 772611, "slug": "glover-2022", "name": "Glover (2022)", "name_original": "Glover (2022)", "description": "Save the World...Single-handed!<br/><br/><br/>The Kingdom's peaceful world has been shattered! The wizard, while mixing potions with his magical gloves has caused a huge explosion, turning him instantly to stone and dislodging the seven crystals that give the Kingdom its energy. Without the crystals, the castle and its world will fall apart and the wizard will be lost!<br/><br/>It's down to Glover, one of the magical gloves, to find the crystals, now disguised as rubber balls and return them safely to the castle. Guide Glover and the balls through seven magical worlds full of puzzles and hidden surprises. Watch out! The evil glove is lurking in the shadows, and he'll stop at nothing to foil Glover's attempts at restoring peace.<br/><br/><ul><li>30 levels to explore across six unique worlds<br/></li><li>Innovative duo of Glover and ball<br/></li><li>Clever themed puzzles that require the use of both glove and ball<br/></li><li>Inspiring power-ups! Change the form of the glove and the property of the ball<br/></li><li>Over 30 bizarre and funny characters, like nothing you have seen before </li></ul><br/>Finally the wait is almost over. The N64 Era Cult Classic Glover is coming soon! This version of Glover is a completely redone from the original source code (N64 version of the game), and improved for modern PCs.<br/><br/>Tentative release date is April 20, 2022. <br/><br/>Add to your Wishlist now!", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T05:10:30", "background_image": "https://media.rawg.io/media/screenshots/bda/bda76ca25b8da110844b6c56ff4b5d9e.jpg", "website": "http://pikointeractive.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 2, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Piko Interactive"], "genres": ["Action", "Adventure"], "publishers": ["Piko Interactive", "Bleem!"], "esrb_rating": null}