{"id": 772690, "slug": "fighter-pilot-heavyfire", "name": "Fighter Pilot: HeavyFire", "name_original": "Fighter Pilot: HeavyFire", "description": "FighterPilot: HeavyFire is an arcade fast paced action-adventure game, where you step into the boots of a fighter pilot, and fly some of the most iconic modem-era jet combat airplanes loaded with some real heavy fire power. <br/><br/>Experience the thrill of commanding some of the most lethal machines ever built, as you swat baddies with a click of your button while you lord over the skies of the battlefield. The game is completely free-to-play, runs offline , and has great features like:- <br/><br/>Iconic Aircraft<br/>- Cold war era favourites like the Jaguar and the Su-25.<br/>- Swing wing ‘go faaasst’  airplanes like the Mig-27 and the Tornado ! watch those wings fold back as you zoom away !<br/>- And the iconic A-10, the best close air support aircraft in the world that is considered nothing less than a flying tank !<br/><br/>Progressive Hangar system<br/>- Progress across the base tier of airplanes and unlock more advanced tier.<br/>- Expand the performance of the airplane by fine-tuning engine, armour and gunnery parameters.<br/>- Load the airplane with real-world inspired weaponry, from rockets, to missiles, to some large area damage bombs ! <br/><br/>Immersive visuals<br/>- Fly around a wide variety of environments across mountains, deserts and beaches.<br/>- Unlock different skins for your favourite airplane - inspired by real-world liveries of these aircraft from their operators.<br/><br/>Progressive levels<br/>- As you become more comfortable with handling your airplanes, the levels will become harder to test your newly acquired skills.<br/><br/>Enjoy an experience that lets you grow with the game in terms of your skills and abilities, opens up more and more airplanes and levels, and even lets you accelerate that pace through in-app-purchases, rewarded ads, or even by referring friends.<br/><br/>Take your time exploring the beautiful hand-crafted levels, while you keep improving your skills of handling the aircraft and becoming the baddest, fastest, most accomplished fighter pilot out there.", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2022-09-30T08:13:23", "background_image": "https://media.rawg.io/media/screenshots/60f/60f583057c6a72f048e7b472923c8df4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Threye"], "genres": ["Action", "Adventure"], "publishers": ["THREYE INTERACTIVE PRIVATE"], "esrb_rating": "Everyone 10+"}