{"id": 772708, "slug": "x-survive-open-world-sandbox", "name": "X Survive: Open World Sandbox", "name_original": "X Survive: Open World Sandbox", "description": "Open world sandbox that features the utmost fun of building and surviving! Discover a game world where you can build a house with an amazing view, use Sci-Fi tools and drive vehicles. Unleash your inner creative power!<br/><br/>Realistic weather system, day and night cycle bringing game to a new level. Whether you fight like a lone wolf against the environment in survivor mode or just build a base in creative mode, there are always surprises awaiting you!<br/><br/>- Open world sandbox<br/>- Futuristic blocks to build a house<br/>- Realistic physics and vehicle driving<br/>- Simple building mechanic<br/>- Creative freedom<br/>- Digging feature<br/>... even more, 500+ blocks to craft and build a house. Sci-Fi equipment will help to mine, fight and even dig. Vast landscapes can be changed in many various ways, you will make a real impact on the game world!<br/><br/>X Survive is a unique open world sandbox experience where you decide what adventure you want to take. Explore the open world and build everything from the simple house to the grandest of castles or futuristic bases. Find materials and produce weapons to fend off dangerous mobs as well as parts to build a house. Create, explore and survive!<br/><br/>Show the world what you just built! Post your design through the camera mode with hashtag #xsurvive and let your friends see how creative you are!", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2022-04-22T07:14:23", "background_image": "https://media.rawg.io/media/screenshots/110/110d1c56585077d72969f712e2bf6b21_6be0adg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 402, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Victor Kirillov"], "genres": ["Adventure", "Simulation"], "publishers": ["Victor Kirillov"], "esrb_rating": "Teen"}