{"id": 772726, "slug": "anime-music-edm-hop-tiles", "name": "Anime Music EDM Hop Tiles", "name_original": "Anime Music EDM Hop Tiles", "description": "Anime Music EDM Hop: Rush Ball - EDM, Piano, Nightcore, OST Music Game.<br/><br/>Have you ever heard \"Anime Music EDM Hop : Rush Ball\"? It will be your favorite music game. Let's play and enjoy music in motion EDM Tiles,test your reflexes and rhythm skills as you guide the ball from tiles to tile and become a master of anime dancing ball games with Hop Rush Ball, one of the latest music games.<br/><br/>our goal is to jump on the Beats Drop from slow to fast. Listen to the beat of the music and move left or right and auto-jump from platform edges,to jump up and collect diamond!<br/><br/>How to play \"Anime Music EDM Hop\"1. Follow the beats and tap the screen when the ball hit the tile.2. Hop on the tiles.3. Don't miss the tiles.4. Listen to the music and play to get the perfect score.5. Move your fingers to experience the thrills of compact rhythms.Follow the beat and use your musical reflexes to guide the ball from tile to tile,We suggest you use headphones to feel the beats.<br/><br/>Game features<br/>- Easy to play, One button control<br/>- 3D visual effects<br/>- New experience in every scene, The ever changing backdrops!<br/>- Collect beautiful skins for the ball<br/>- Keep your best scores<br/><br/>\"Anime Music EDM Hop: Tiles Hop EDM\" is now completely free! Let's enjoy this EDM music rush 3D game right now!", "metacritic": null, "released": "2022-02-27", "tba": false, "updated": "2022-04-22T07:31:22", "background_image": "https://media.rawg.io/media/screenshots/d93/d93275d5ca28bf89f2a94bd5bffdfbbf_X7UZui6.jpg", "website": "https://www.alfatihstudio.my.id", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ahmad Ramli"], "genres": ["Casual"], "publishers": ["Ahmad Ramli"], "esrb_rating": "Everyone 10+"}