{"id": 772778, "slug": "bike-games-3d-motorcycle-games", "name": "Bike Games 3d Motorcycle Games", "name_original": "Bike Games 3d Motorcycle Games", "description": "The New Year 2022 is near, with a start of new year we are presenting you a realistic motorcycle driving game, play this new game and explore huge and beautiful city, drive bike freely, go anywhere you want to go, while driving bike in an open world, you can select different challenging level modes with in the city. Pick your desired level and press start to play.<br/><br/>REALISTIC MOTORCYCLE PHYSICS<br/><br/>This game consists on a real physics of motorcycles with advance physics of engine, every bike has its own physics which you can play and feel the difference.<br/><br/>OPEN WORLD ENVIRONMENT<br/><br/>Test your bike driving skills in an open world huge environment, it contains wide roads, buildings, parks, hospitals, airports, sea ports, bridges and other things, this environment is extremely detailed. Just explore it.<br/><br/>ENJOYABLE SOUND AND MUSIC<br/><br/>All the sounds of motorbikes are real having the strongest feeling to the player. From the strongest racing bike sounds to burning offroad engines, every motorcycle has its own special sound recorded from real racing motorcycles!<br/><br/>REALISTIC AND DETAILED GRAPHICS<br/><br/>This game provides the most realistic graphics and deepest 3D ever on mobile. You will have a hard time distinguishing your motorcycles from the reality!<br/><br/>MANY MOTORCYCLES TO CHOOSE FROM<br/><br/>Pick your favourite motorbike and ride in a giant open world map! The best motorcycle game is waiting for you!", "metacritic": null, "released": "2021-12-24", "tba": false, "updated": "2022-04-22T08:18:08", "background_image": "https://media.rawg.io/media/screenshots/04b/04b25156a93136c5a358f8cd047b2360_2461W3i.jpg", "website": "https://97l2.yodo1.app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hafiz Muhammad Farhan Mamoon Muhammad Mamoon Ul Haq"], "genres": ["Sports", "Racing"], "publishers": ["Hafiz Muhammad Farhan Mamoon Muhammad Mamoon Ul Haq"], "esrb_rating": "Everyone 10+"}