{"id": 772780, "slug": "road-warrior-nitro-car-battle", "name": "Road Warrior: Nitro Car Battle", "name_original": "Road Warrior: Nitro Car Battle", "description": "Give life to your machine. Bathe the road in your rivals' oil and gasoline. Rise to glory, shiny and chrome!<br/><br/>Arm your car with a diverse arsenal of post-apocalyptic weapons and nitro powered gear and take on furious road as you race, flip and battle your way to victory!<br/><br/>Blow up your rivals in fierce pvp battle races while defending yourself from unrelenting waves of fiery lead! Prove your skill on the  mad roads and wastelands of a desert dystopia as you risk everything in perilous flips and tricks to rev up your engine to the max and leave only fire and rubble in your wake!<br/><br/>HIGHLIGHTS<br/><br/>Play nitro-fueled, explosion-filled battle races against players from all over the post-apocalypse world in thrilling, real-time multiplayer race matches. Can you shoot and explode your way to the top of the global and local leaderboards with your car tuning skills?<br/><br/>Unlock and collect a whole, powerful combat arsenal of post-apocalyptic turbo racing cars equipped with powerful guns! From fast and slick turbo sedans to massive, rock 'n' roll death machine monster trucks, master each car's unique weapons and guns and special ability to be prepared for everything the road throws at you in these post-apocalyptic dystopia wastelands!<br/><br/>Upgrade and customize your car battle vehicles with awesome combat items and skins and make opponents all over the post-apocalypse world witness your turbo nitro-powered glory, shiny and chrome! Unlock new guns and car tuning customization options as you win more and more battles in the desert wastelands!<br/><br/>Execute  mad risky flips with your car while you race and combat to rev up your engines and get a glorious nitro speed boost to push your racing to the max!<br/><br/>Dominate the road in the wastelands of desert dystopia while powered by a blood-pumping rock 'n' roll soundtrack that will get your heartbeat racing as you dodge enemy fire and explosions and use your mad car tuning skills to the max!<br/><br/>The open road is inviting you to conquer it through the apocalypse, but out there in the barren and ruthless expanses, only the strongest and gun-savvy car battle vehicles and monster truck drivers survive!<br/><br/>Speed into a post-apocalyptic dystopia-like world of battle races and road war-ready cars, monster trucks and other explosion-causing death machines and fight with all you have to keep racing to the top and earning new combat customization items!<br/><br/>Road Warriors from all over the post-apocalypse world are challenging you to join them in turbo fast multiplayer post-apocalyptic combat races! Master each deadly weapon and special skill in your rock 'n' roll arsenal of monster trucks and car battle vehicles in order to reach the finish line and become the glorious world champion in every racing leaderboard!<br/><br/>Get into your car battle vehicles, load up your weapons and race, shoot and flip towards your fate as THE road warrior to rule them all through the rock 'n' roll apocalypse!<br/><br/>CONSTANTLY EVOLVING<br/><br/>Look out for new Car Tuning Options, Customization Skins, Maps, Special Racing Events and Games Modes in the future.<br/><br/>PLEASE NOTE! Road Warrior is a completely free to play battle racing game, but in-game items can also be purchased for real money. If you don't want to use or let someone else use this feature, please disable in-app purchases.", "metacritic": null, "released": "2021-02-09", "tba": false, "updated": "2022-04-22T08:20:11", "background_image": "https://media.rawg.io/media/screenshots/b46/b4677371c32716f8979502db58712c1b_vGb5Uch.jpg", "website": "https://www.byaliens.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["By Aliens"], "genres": ["Action", "Racing"], "publishers": ["By Aliens"], "esrb_rating": "Everyone 10+"}