{"id": 772737, "slug": "hidden-journey-2-find-objects", "name": "Hidden Journey 2: Find Objects", "name_original": "Hidden Journey 2: Find Objects", "description": "Explore the area and start hunting for hidden objects! Hidden Journey 2: Find Objects is a new kind of seek and find games where you'll be searching for objects! <br/>Your search will be a true pleasure with objects staying at the same positions. The adventure puzzle game to enjoy!<br/>On each level you'll have to solve a picture puzzle: search for highlighted items and complete hidden object challenges.<br/>Sounds quite easy, ha? We dare you to find all missing items!<br/><br/>Hidden Journey 2: Find Objects has tons of maps and locations, awesome graphics and hidden object art, fun minigames, bonuses and lots more.<br/>Use your investigative skills to find an object after object on your puzzle quest.<br/>Enjoy the simple and intuitive interface. Boost your concentration and have fun!<br/>Easy controls will help you find hidden figures faster, as well as helpful boosters!<br/>The best scavenger hunt game around!<br/><br/>Features of Hidden Journey 2: Find Objects:<br/>- Highly-detailed, awesome graphics<br/>- Different object finding mechanics<br/>- Level map with unique locations<br/>- Varieties of instruments to help your search<br/>- Additional challenging levels<br/>- Lots of levels with silhouettes<br/>- Countdown timer to make the game more dynamic and immersive<br/><br/>Additional levels contains:<br/>- Puzzles<br/>- Spot the differences<br/>- Find 10 identical items<br/>- Pairs<br/><br/>Win stars to open treasure chest and find mystery prizes!<br/><br/>Great adventure awaits you!", "metacritic": null, "released": "2020-08-28", "tba": false, "updated": "2022-04-22T07:40:51", "background_image": "https://media.rawg.io/media/screenshots/3dc/3dc890ee249f26143fab4930f5d828c6_06Ta6Jr.jpg", "website": "https://azurgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Azur Interactive Games"], "genres": ["Casual", "Puzzle"], "publishers": ["AZUR INTERACTIVE GAMES"], "esrb_rating": "Everyone 10+"}