{"id": 772794, "slug": "barood-clash-battles", "name": "Barood - Clash Battles", "name_original": "Barood - Clash Battles", "description": "Welcome to Barood World! <br/><br/>Introducing Barood: NEW AGE Battle Royale Shooter Game.<br/><br/>Dive into expansive Battlegrounds, search for strategically placed weapons, vehicles, and consumables, and fight for survival in a shrinking desert storm playable area.<br/><br/>Experience the action-packed thrill and gameplay and become the last one standing!<br/><br/>There are two modes of the game<br/><br/>Battle Royale Mode (Survival shooter in its best form)<br/>Search for weapons, stay in the play zone, loot your enemies and become the last man standing. Along the way, go for legendary airdrops while avoiding airstrikes to gain that little edge against other players<br/>Sheikh Mode (Fast pace 5v5 team death match mode)<br/>Be the sheikh in Barood, or be one of his brave tribesmen who repel the invaders to save the sheikh till the time runs out with all their guns and bravery.<br/><br/>More realistic and dynamic gunplay<br/>Barrod is a feature pack with customizable controls, training mode, and voice chat with friends. Experience the smoothest control experience on a mobile device and the most realistic gameplay on your phone.<br/><br/>Next generation action-based explosive gameplay<br/>Unique gameplay with an all new never played before Sheik mode and unmatched battle royale mode with unique guns, vehicles and animals fighting for survival.<br/><br/>Wide Array of skins and avatar to choose from<br/>You can select from a variety of avatars and customize as you like with a lot of local and cultural options available like never before.<br/><br/>Custom Room <br/>Create your own custom room and invite your friends over to play a special match or practice with your clan mates only in a elite custom room.<br/><br/>Download today and become a Barood Legend!<br/><br/>For full terms and conditions, please see:<br/>https://umxstudio.co/en/terms-condition<br/>For privacy policy:<br/>https://umxstudio.co/en/privacy-policy<br/>For any suggestion Contact Technical Support:<br/>support@umxstudio.co<br/>Follow us on social media:<br/>@playbarood", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-04-22T08:33:45", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbf67a2c9bb0044932e2504eae7638e7_xQ7ui2x.jpg", "website": "https://umxstudio.co/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["UMX STUDIO FOR TECHNOLOGY"], "genres": ["Action", "Strategy", "Sports"], "publishers": ["UMX STUDIO FOR TECHNOLOGY"], "esrb_rating": "Mature"}