{"id": 772701, "slug": "train-simulator-city-rail-road", "name": "Train Simulator City Rail Road", "name_original": "Train Simulator City Rail Road", "description": "If you want to visit the famous places in the city so you should travel on a modern futuristic trains. Start your journey as a train driver who gives you the best luxury atmosphere to the passenger during their travelling. The railway station department introduces the brand new euro public train for valuable customers. The duty of the modern city train driver is to pick up the passenger from the railway station and drop them at their assigned location. The people of the enjoy the travel and are satisfied with the railway services. The futuristic train driver to do multiple tasks and transfer the passenger to their destination. The passengers reach the railway station on time and book their train to take ruide. The city train picks up the passenger from multiple different railway stations and drops them at their assigned location. The passenger visits the famous places of the city travel on the futuristic train in the railroad games.<br/><br/>* Key Features *<br/>Pick and drop the passenger from different location of the city<br/>Transfer the heavy luggage from one city to another rail station<br/>Visit around the city and transfer the passenger on multiple location<br/>Multiple brand new 3d trains with realistic control <br/>Lots of stunning tasks easily accomplish on time", "metacritic": null, "released": "2022-04-11", "tba": false, "updated": "2022-04-22T07:07:37", "background_image": "https://media.rawg.io/media/screenshots/197/197ea48e2728cfd1426c85e752d41caf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Akram"], "genres": ["Adventure", "Simulation"], "publishers": ["Muhammad Akram"], "esrb_rating": "Everyone 10+"}