{"id": 772747, "slug": "angel-saga", "name": "Angel Saga", "name_original": "Angel Saga", "description": "Welcome to an exciting world of angels, magic, dungeons, treasure, and more!<br/>Experience the great-escape action adventure of Myel, an angel who was summoned to the underworld.<br/>The fate of an angel rests in your hands!<br/><br/><br/>◈ Key Features ◈<br/><br/>▶ Simple controls that anyone can learn<br/>▶ Unlimited combinations of randomized special skills<br/>▶ Gorgeous battles with dynamic, full-screen magic effects<br/>▶ Choose your own path through randomly generated stages<br/>▶ Lots of huge bosses with unique attack patterns<br/>▶ Character customization with various equipment combinations<br/><br/><br/>◈ Details ◈<br/><br/>Avoid all kinds of enemy attacks with simple control.<br/>Use different attack skills to defeat huge bosses.<br/>Become a legend by your own hand.<br/><br/>Enjoy roguelike action and rise up to the highest level in just 30 minutes.<br/>60 different skills for unlimited combinations that always keep the action fresh and fun.<br/>With new stages and monsters every run, you'll never get bored.<br/>Avoid the arrows of the demon archers, and the attacks of the dark wizard!<br/>Dozens of bosses with different attack patterns await your challenge.<br/><br/>It's time to put down the bow! Equip new gear and a wield a powerful magic wand.<br/>All legendary gear in the game can be crafted with enough time and effort.<br/>When your character fails, you have to start from the beginning, but your equipment is saved.<br/>Don't be afraid of restart, and keep fighting against your enemies!", "metacritic": null, "released": "2021-03-13", "tba": false, "updated": "2022-04-22T07:50:15", "background_image": "https://media.rawg.io/media/screenshots/f08/f086557ef5d2c59ed392010751b4049f.jpg", "website": "http://www.alchemistgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AlchemistGames"], "genres": ["Action", "RPG"], "publishers": ["Alchemist Games"], "esrb_rating": "Everyone 10+"}