{"id": 772783, "slug": "color-time-paint-by-number", "name": "Color Time - Paint by Number", "name_original": "Color Time - Paint by Number", "description": "● Premium &amp; Exquisite Paintings: Color Time has exclusive cooperation with well-known painters! After 1500+ hours of painting and pics selection, we provide you with a completely different coloring experience!<br/>● Set as Wallpaper with One Click: All the pics in Color Time are designed according to the wallpaper size. With only one click, you can set your favorite picture as wallpaper.<br/>● Simple and Diverse Gameplay: There are three ways to color— matching numbers, tapping the color on the bottom to find the corresponding color blocks, and long-pressing on the color blocks to find the corresponding color.<br/>● Share Quickly: Share pics and videos with your friends and families!<br/><br/><br/>WHAT DO WE HAVE<br/><br/>- Flower: Various kinds and postures of flowers! The best choice for relaxing yourself~<br/>- Anime: Take you into the world of animation! Enjoy it!<br/>- Lifestyle: Here are delicious foods and colorful hobbies! Pick one!<br/>- Love: Fall in love with Color Time!<br/><br/>We also have Character, Animal, Fantasy, Mandala, Sights, Festival and so on. If you encounter difficulties in the coloring process, watch videos to get free props!<br/><br/>In order not to affect your gaming experience, we need to access the photos, media and files on your device. To prevent your coloring works from being lost, you can log in to your Color Time account to permanently remain your works.<br/><br/>It’s our great pleasure to provide you with a wonderful color by number game experience! Thank you for choosing Color Time!", "metacritic": null, "released": "2022-01-19", "tba": false, "updated": "2022-04-22T08:23:51", "background_image": "https://media.rawg.io/media/screenshots/c47/c47d0290f834f4377c483f697655cc0a_wlHiltz.jpg", "website": "http://www.noxmatrix.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nox(HongKong)"], "genres": ["Board Games", "Casual"], "publishers": ["Nox"], "esrb_rating": "Everyone 10+"}