{"id": 772735, "slug": "kout-kwt", "name": "Kout كوت", "name_original": "Kout كوت", "description": "Kout is one of its kind collaborative cards game where you can chat with your friends with video and audio options in the chat room.<br/>It is a popular Spades variant from the middle eastern. It is a team-based card game that is very popular in the Gulf region.<br/><br/>Learn and enjoy playing Kout against your friends or enjoy challenging other people in our daily friendly tournaments, and play either the 4 player or 6 players variant of the game.<br/><br/>Or upgrade to a Pro account to participate with video, voice, and audio in chat rooms and tournaments also see your rating increase to be listed in our leader boards.<br/><br/>Subscriptions for using Pro account features:<br/>- Kout subscriptions renew weekly, monthly, quarterly or yearly, depending on your plan.<br/>- Before completing payment, you’ll see the plan price.<br/>– Payment will be charged to your Apple ID account at the confirmation of purchase.<br/>– The subscription automatically renews unless it is canceled at least 24 hours before the end of the current period.<br/>– Your account will be charged for renewal within 24 hours prior to the end of the current period.<br/>– You can manage and cancel your subscriptions by going to your App Store account settings after purchase.<br/>– Any unused portion of a free period, if offered, will be forfeited when user purchases a subscription to that publication, where applicable.<br/><br/>Terms and conditions: https://www.koutbo6.com/about/terms<br/><br/>Privacy policy: https://www.koutbo6.com/about/privacy", "metacritic": null, "released": "2011-04-15", "tba": false, "updated": "2022-04-22T07:39:13", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdc37aba76ebc995146adb1a1f4a074e_jQKgJFN.jpg", "website": "http://www.koutbo6.com/iphone/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KBSoft"], "genres": ["Simulation", "Card"], "publishers": ["KBSoft Co. For Information Technology"], "esrb_rating": "Mature"}