{"id": 772883, "slug": "slide-to-freedom", "name": "Slide to Freedom", "name_original": "Slide to Freedom", "description": "Explore one of the oldest, most intriguing and addictive sliding puzzles. <br/><br/>In Slide to Freedom the goal is to move the large red block to the exit by only moving the blocks horizontally or vertically. Try to do this with a minimum number of moves.<br/><br/>More than 500 predefined levels are included.<br/><br/>A level editor with integrated solver allows you to discover this puzzle step by step. <br/><br/>Complete list of features:<br/><br/>GAME-PLAY<br/>- 530 predefined levels.<br/>- Levels grouped into 5 categories (intro, easy, medium, hard, extreme).<br/>- The minimum number of moves ranges from 6 till 150.<br/>- None of the levels are initially locked.<br/>- The best score for each level is saved.<br/>- Unlimited undos.<br/>- No lag while dragging a block.<br/>- Video controls to review your moves after completion of a level.<br/>- No ads, no in-app purchases, no subscriptions and no asking for reviews.<br/><br/>DISPLAY<br/>- Fresh, modern, minimalistic look.<br/>- Option to choose a light or dark display background.<br/>- Dark mode support (iOS 13+).<br/>- Support for all four landscape and portrait device orientations.<br/>- Support for all screen sizes.<br/><br/>SOUND<br/>- Ability to listen to your own music while using the app.<br/>- Option to switch off all sounds of the app itself.<br/><br/>HINTS<br/>- Hints button gives the minimal number of moves. <br/>- Animation of the minimal solution.<br/>- Adjustable animation speed (1 move per 2 sec - 4 moves per sec). <br/>- Number of hint moves can be restricted by stopping the animation. <br/>- If hint moves are used, the result is not qualified as a new score.<br/><br/>EDITOR<br/>- Simple to use level editor, designed to need very few taps.<br/>- Any level can serve as a starting point for editing.<br/>- Add your levels to favorites and share these with others.<br/>- Solver-button to report the minimum number of moves while editing.<br/><br/>SOLVER<br/>- Handles any configuration of blocks.<br/>- Minimizes the number of moves.<br/>- Minimizes total number of moved-over squares for solutions having the same number of moves.<br/>- Detects if no solution exists.<br/>- Solve time less than 1 second for most levels.<br/><br/>- 64-bit compatible.<br/><br/>- iOS, iPadOS 15 tested.<br/><br/>We hope you enjoy Slide to Freedom.", "metacritic": null, "released": "2017-06-19", "tba": false, "updated": "2022-04-22T09:55:51", "background_image": "https://media.rawg.io/media/screenshots/6d4/6d43a99fc27e816bbb0b7ebf9d4b45c5.jpg", "website": "https://sites.google.com/view/slide2freedom-app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rolfs Apps"], "genres": ["Board Games", "Educational", "Puzzle"], "publishers": ["Rolf Steenge"], "esrb_rating": "Everyone 10+"}