{"id": 772854, "slug": "gods-civilization-ragnarok", "name": "Gods & Civilization: Ragnarok", "name_original": "Gods & Civilization: Ragnarok", "description": "Create your Empire<br/><br/>Ragnarok has started, the gods are in utter dismay and the divine world calls for the aid of a new Hero, you. Are you prepared to fight for world domination? Will you be the one to save what little remains of this world and make it your own, conquering the divine and mortal alike?<br/><br/>Build an army and travel through the worlds of Greek, Egyptian, Roman and Norse mythology:<br/>Assemble Gods in 4 universes and lead Thor, Odin, Zeus, Poseidon, Osiris, Hercules, Venus...etc to fight the evil.<br/>Gather a horde of mythological creatures and build your legendary army, conquer Asgard and restore balance to the world after Ragnarok.<br/><br/>Enjoy the next generation of 4X Real-Time Strategy Game. Download the app now and rebuild the universe after Ragnarok!<br/><br/>KEY FEATURES:<br/><br/>Bring The Gods To Life<br/>Conquer - Fight to save the world after Ragnarok, cleansing it of its own destruction, Loki and many other evil gods have amassed powerful armies to stop your advance, you will need to build your army with the greatest Heroes you can find, and conquer different levels of mythical lands to improve both your empire and your wealth before you can even begin to stop him - whatever the cost.<br/><br/>Repel Vast Invasions From Beyond<br/>PVP - The age of peace has ended, and now a new power seems to be rising in the horizon. Invasions from different players and heroes will come, and you will have to use your resources in the best way possible in order to repel the invaders, maybe even consider taking the fight to their lands?<br/><br/>Seek Help From Distant Lands<br/>Co-op - Sometimes your own effort isn't enough, by building alliances with other players in your Guild, you can help and support each other’s empires and take on bigger enemies together, as opposed to solo.<br/><br/>Become The Ultimate Ruler<br/>Expand - Grow bigger, build bigger, become bigger. The world is at your feet, and now is your time to rise to the pinnacle of power. By assembling Gods and Heroes, customising them with the finest of rare mythical equipment, you will become unstoppable.", "metacritic": null, "released": "2022-04-11", "tba": false, "updated": "2022-04-22T09:27:28", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cf581c922a6c1a93afb3a5f0d86aa56_dEgG2WF.jpg", "website": "https://www.6waves.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Six Waves"], "genres": ["Strategy", "Simulation"], "publishers": ["Six Waves"], "esrb_rating": "Everyone 10+"}