{"id": 772893, "slug": "monster-rancher-2021", "name": "Monster Rancher (2021)", "name_original": "Monster Rancher (2021)", "description": "◆◆ The legendary monster training game “Monster Rancher” is back! ◆◆<br/>22 years since its release, the legendary monster training game “Monster Rancher” is bringing back the exciting days of growing and training your unique monsters!<br/>Discover, raise, combine, and train your monsters from more than 200 available types to make the strongest original monster of your own.<br/>You can even choose how you want to train them! Will you dote on them or enforce an intense training regime? Find your own style among endless possibilities!<br/><br/><br/>----------------------<br/>◆ Game Features ◆<br/>----------------------<br/>▼ About “Monster Rancher”<br/>“Monster Rancher” is a monster training simulation game in which you become a monster breeder to create a variety of monsters, train them, and make them fight against other monsters.<br/>The most unique feature of this game is the option to obtain new monsters from music CDs. Different CDs produce different monsters, including some very rare ones!<br/><br/><br/><br/><br/>▼ Aim to become the best monster breeder!<br/>◇◇ Acquire your monsters ◇◇<br/>In this title, you can use a CD database to obtain your monsters. Search through the database and<br/>discover what kind of monsters can be born from your favorite tracks, from old nostalgic songs to fresh new ones!<br/>And of course, some monsters can be obtained for free at the market as well.<br/><br/><br/>◇◇ Develop a training menu from a variety of options ◇◇<br/>All monster stats, such as their health, strength, and resilience, are directly affected by the work and training you put them through.<br/>And by praising and scolding their achievements, you can help them grow even further!<br/>Of course, don’t forget about the importance of proper rest!<br/>Pick your own training strategy and raise your unique monsters with the help of your reliable assistant Holly!<br/><br/><br/>◇◇ Take your monsters out to compete ◇◇<br/>Once you've trained your monsters, register them for competitions and let them fight.<br/>During a fight, you can give your monster instructions to guide them to victory.<br/>But if their loyalty is low, they might not listen to you, so this is where the quality of your training comes into play.<br/>Win an official match to advance and aim to become an S Rank Monster Breeder!<br/><br/><br/>▼ Compete against your rivals around the world!<br/><br/>You can download monsters raised by breeders all over the world and battle them against your own monsters.<br/>Raise the strongest monsters and become the best monster breeder!<br/><br/><br/>▼ More new features!<br/>◇◇ Share your achievements on social media ◇◇<br/>Press the Camera icon on the screen to easily take screenshots and share them with your friends!<br/><br/><br/>◇◇ Autosave ◇◇<br/>The autosave feature will save your data every in-game week for your peace of mind!<br/><br/><br/>◇◇ Bluetooth controller compatibility ◇◇<br/>Battles can now be played with a Bluetooth controller!<br/>\"Note: Some controllers may not be compatible with this game.\"<br/><br/><br/>-------------------------<br/>◆ Compatible Devices ◆<br/>-------------------------<br/>iPhone, iPod touch, iPad<br/>(Requires iOS 10.0 or later)<br/><br/><br/>-------------------------<br/>◆ Disclaimer ◆<br/>-------------------------<br/>1. Please note that customer support will not be provided for not supported operating systems.<br/>2. Depending on the usage, the application may become unstable, even on a compatible device.<br/>3. Please note that the application may not support the latest version of the operating system, even if it is listed as \"iOS XXX or higher\".<br/>4. Unless otherwise stated, the monsters created through the music database are assigned at the company's discretion, and there is no correlation between the artists and “Monster Rancher”.<br/><br/><br/>■ Privacy policy<br/>https://www.koeitecmo.co.jp/privacy/PrivacyPolicy_en.pdf<br/><br/>(c)KOEI TECMO GAMES CO.,LTD All rights reserved.", "metacritic": null, "released": "2021-12-08", "tba": false, "updated": "2022-04-22T10:05:19", "background_image": "https://media.rawg.io/media/screenshots/811/8115f3d64de05ffc80d154235604b09b_zNrJWQk.jpg", "website": "https://www.koeitecmoamerica.com/mrdx/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["KOEI TECMO GAMES CO"], "genres": ["RPG", "Simulation"], "publishers": ["Koei Tecmo Games"], "esrb_rating": "Teen"}