{"id": 772806, "slug": "superhero-run-adventure-game", "name": "Superhero Run Adventure Game", "name_original": "Superhero Run Adventure Game", "description": "Run Superhero is a great opportunity to test your agility! Feel like a real superhero and go through the obstacle course. Various trials and obstacles await you on your way! Go around them and come to the finish line on time! Be careful, because your success depends on it. Choose the right superhero to take advantage of his powers! Apply the power of one of the characters and easily go around obstacles!<br/>You need to make decisions quickly! During the race, you will flock with various traps. Use the power of a certain superhero to get around all obstacles. For example, the Captain can destroy walls and defend against enemy attacks with a shield. Hammer Man destroys enemies and disables electrical barriers with a lightning hammer. And Tarantula’s super ability will allow you to fly over obstacles on the web and tear it apart when it blocks your way!<br/>Show the app to your friends! Let them install the game on their device and you can compete together. Check how far you can go and prove to everyone that you are the most attentive player! Dodge obstacles with ease and be the first to reach the finish line!<br/>Thanks to the beautiful design and smooth animation, the gameplay will bring you incredible pleasure! Install the application as soon as possible and see for yourself! Believe me, vivid emotions and unforgettable impressions await you.<br/>Hurry up - a virtual adventure awaits you!<br/>Premium Features:<br/>- Unlocked all characters;<br/>- Unlocked of super powers<br/>- Unlimited Lives<br/>- Access to all levels<br/>Notice: You need to be subscribed to access apps features, there is no free functional inside.<br/>Upon confirmation of purchase of your subscription, payment will be charged to your iTunes account.<br/>Subscription will auto-renew unless auto-renew is turned off at least 24 hours before the end of the current period and payment is charged to your iTunes account.<br/>The renewal cost depends on your subscription plan. Our standard subscription plans:<br/>1 week subscription is $ 5.99<br/>For other currencies, the price matches the price level in the App Store Price Matrix.<br/>Subscription with a free trial period automatically renews to a paid subscription. You can cancel or manage the automatic renewal of the free trial by going to your Account Settings after purchase. Cancellation will take effect 24 hours after the last day of the current subscription period and you will be transferred to a free service.<br/>Please note: Any unused portion of the three-day free trial period (if offered) will be forfeited when purchasing a premium subscription during the free trial period.<br/>For any other information, see our privacy policy and terms of use.<br/>Privacy Policy:  https://docs.google.com/document/d/11Yr2rxpZygXWl02AgzwuRRMo2Ki4OH0ZjqxfMwAdlkM/edit?usp=sharing<br/><br/>Terms of use:  https://docs.google.com/document/d/1vqzl_qOT83gPPEwPh_2mYgCK3KGglaUa06xi8PwS7cI/edit?usp=sharing", "metacritic": null, "released": "2021-08-09", "tba": false, "updated": "2022-04-22T08:44:30", "background_image": "https://media.rawg.io/media/screenshots/328/328d290d6f29d9bbba3636ee6b094436_y5sYffg.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oleksii Yudintsev"], "genres": ["Racing", "Casual"], "publishers": ["Oleksii Yudintsev"], "esrb_rating": "Everyone 10+"}