{"id": 772828, "slug": "league-of-angels-chaos", "name": "League of Angels: Chaos", "name_original": "League of Angels: Chaos", "description": "League of Angels: Chaos is a fantasy Action MMORPG designed to give you the ultimate RPG experience on mobile.<br/>Ragnarok has engulfed the world in chaos and the heavens themselves have been torn asunder. You, a champion of the gods, are the last hope to bring back order and restore the realm.<br/>Embark on your journey to become a legend!<br/><br/>[Game Features]<br/><br/>〓 Summon Angels ◆ Unleash True Power 〓<br/>Summon forth the Angels and wield their divine power!<br/>Each Angel possesses mighty abilities that will change the tide of battle.<br/>Attack, Defense and Support-orientated Divine Blessings add more strategy to the combat.<br/><br/>〓 3 Legendary Classes ◆ Unique Combat 〓<br/>Choose from Dragoon, Mage or Archer, each with their own skill sets and play styles.<br/>Dragoon - Champion of justice that fights to uphold honor and the glory of his order. Wielding massive blades on each hand, he is a whirlwind of steel and death on the battlefield.<br/>Mage - Master of the elements that controls the primal forces at his fingertips. Possessing generations of knowledge, he can unleash devastating spells on his foes.<br/>Archer - Deadly marksman that never misses her mark. Trained by the ancient elves, her mastery of the bow is unmatched even by the gods themselves.<br/>Plus more classes coming in future updates!<br/><br/>〓 Alliance Warfare ◆ Cross-Server Conquest 〓<br/>Participate in cooperative Raids, join powerful Alliances, fight across Cross-Server battlegrounds, and claim glory for your server!<br/>Clash in spectacular battles solo or alongside your comrades in a highly immersive combat experience!<br/><br/>〓 Forge Equipment ◆ Become A Champion 〓<br/>Collect all kinds of gear, including equipment sets and Divine weapons; Craft and enhance your way to greatness!<br/>Forge Legendary Equipment, upgrade Set Attributes, build up your power to conquer the battlefield!<br/>Charge into battle on mythical Mounts while and illuminated Wings.<br/><br/>〓 Trade Freely ◆ In-depth Planning 〓<br/>Trade to your heart’s content at the Auction House! Find the perfect equipment or make a profit playing the market!<br/>Carefully plan your resource management to get ahead of the competition!<br/><br/>〓 Loot Loot and More Loot ◆ Auto Progression 〓<br/>Every Instance, Boss, and Raid showers you with shiny loot.<br/>Farm without lifting a finger with auto mode! Make progress even when you can’t access your phone!<br/><br/>Facebook: https://www.facebook.com/LeagueofAngelsChaos<br/>FB Group: https://www.facebook.com/groups/loachaosofficial/<br/>Discord: https://discord.gg/a24Z7P3KGS<br/>Website: https://loachaos.gtarcade.com/", "metacritic": null, "released": "2022-03-31", "tba": false, "updated": "2022-04-22T09:07:16", "background_image": "https://media.rawg.io/media/screenshots/cd0/cd0be2e19a15b46026f9959b678e6f9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YOOZOO (SINGAPORE) PTE"], "genres": ["Action", "RPG"], "publishers": ["YOUZU (SINGAPORE) PTE"], "esrb_rating": "Teen"}