{"id": 77298, "slug": "ichallenger-return", "name": "iChallenger-Return", "name_original": "iChallenger-Return", "description": "#Game overview <br/><br/>You can simply enjoy the game with the tough character's cool action and the sense of batting. <br/><br/>We guarantee smooth moving and control of it. <br/><br/>It support various game modes so that you will not be bored as well as this game looks like a simple game but it will never let you down. <br/><br/>Please enjoy the game with great fun. We are expecting a good review from you. <br/><br/><br/># Main function<br/><br/>Three game modes of story mode, survival mode and infinity mode. <br/><br/>#Story mode : The final boss has to be killed within an hour. <br/><br/>#Survival mode : There are enemies which present continuously so you need to drive the enemies away. <br/><br/>#Rush mode : There are flying weapons that you need to keep off. <br/><br/>The several tens of wearable weapons, various enemies and monsters, traps. <br/>An artificial intelligence monster and an enemy are made up with fun and brightness. <br/>the advent of upgrade armor and an unique weapon according to the certain frequency of a combo. <br/><br/><br/># Tips <br/><br/>Remove enemies' suit of armor first and make an attack on the inside of the armor to kill them. <br/><br/>The more you make the combo, the more you are given various compensation. <br/>If you move a shield fast up and down , a barrier will be produced. <br/><br/>The barrier will be depends on the shield that you are wearing. A sheild and a knife can guard against from the flying weapons. <br/><br/>There exists a thing which can be kept off by using one of those weapon. You need to choose one from them which go with the situation. <br/><br/>If the durability of the shield goes down, you can not wear it anymore. Also, if enemies' shield get damage a lot it will be broken. <br/><br/>Certain amount of combos can make the usage of the skill. The skill is changeable upon a weapon. <br/><br/># Iinstructions <br/>You need to slide your finger fast right and left on the skill zone. <br/><br/>1. In the story mode, the player must clear the all stages within 1 hour.<br/><br/>2.Weapon impossible to defend using the shield / Weapon possible to defend using the sword<br/><br/>3.If the player arrests a weapon impossible to defend using the sword, the player’s sword may be bounced off. The player can pick up the fallen sword and can use it again.<br/><br/>4.If the player does the 10 comb, an available upgraded weapon is flown before the player. After defending against the flying weapon, the player can pick up and use it. <br/><br/>5.If the player does the 10 comb, an available upgraded weapon is flown before the player. After defending against the flying weapon, the player can pick up and use it. <br/><br/>6.Player’s shield can defend against various weapons flying toward the player, and the layer can sweep the sword to bounce them.<br/><br/>7.At defending with the sword, the player can get high-level combo through the way of continually bouncing weapons by severally sweeping the sword.  <br/><br/>8.Whenever the 10 combo is succeeded, the player’s armor is newly restored.<br/><br/>9.The player can pick up the ax, the sword or the mace fallen by the enemy and use them.<br/>But the spear and the weapons of boss can’t be used.<br/><br/># Operation method<br/><br/>You can make an attack of three volumes. Also you can move a shield by sliding up and down on the inside of screen. You can make a move by tilting the screen right and left. <br/><br/><br/># Combo<br/><br/>Combo 10 : Repair Armor <br/>Combo 20 : Unique Sword <br/>Combo 25 : Level Up Armor <br/>Combo 40 : Unique Sword <br/>Combo 50 : Level Up Armor <br/>Combo 60 : Unique Sword <br/><br/><br/>E-mail : game@dnddream.com <br/>Homepage: HTTP://DNDDREAM.COM <br/>Facebook: Facebook.com/projectsoul", "metacritic": null, "released": "2011-09-15", "tba": false, "updated": "2019-07-29T22:34:47", "background_image": "https://media.rawg.io/media/screenshots/14c/14c9d25e290842a6f448947d9c67d1af.jpg", "website": "http://DNDDREAM.COM", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["D&D Dream"], "genres": ["Action", "RPG"], "publishers": ["D&D Dream"], "esrb_rating": null}