{"id": 77301, "slug": "real-basketball-2015", "name": "Real Basketball 2015", "name_original": "Real Basketball 2015", "description": "Real Basketball 2015 is next generation gaming experience. This game is carefully crafted for basketball fans with elegant graphics and sounds. There are fun game modes and realistic game mechanics.<br/><br/>=======<br/>Controls<br/>=======<br/>-Smart joystick control can be used to move player<br/>-Pass control to pass the ball to friendly player<br/>-Tackle control to snatch ball from opponent player when its near<br/><br/><br/>===========<br/>Game Modes<br/>===========<br/><br/>-There are total 2 Game Modes and 10 teams from world's top chart.<br/>-Quick Match: It sets the match with a random team.<br/>-Tournament: Play tournament, win matches and qualify to final<br/><br/>==========<br/>Social Features<br/>==========<br/>-Share your score with friends on Facebook<br/>-Shout on social media when you manage to beat your opponent team in match<br/>-Invite friends to play game<br/>-Make your place in global leader board and compete players from all over the world<br/><br/><br/>=======<br/>Feedback<br/>=======<br/>If you have any suggested features or improvements please leave a comment, or send us an email at techmowo@gmail.com. In case something is not working correctly please let us know, I'll be glad to fix that. <br/>Please post comments and feedback. When posting low rating please describe what is wrong to give the possibility to fix that issue.", "metacritic": null, "released": "2014-11-20", "tba": false, "updated": "2019-10-22T14:24:29", "background_image": "https://media.rawg.io/media/screenshots/ed3/ed39ba308625e898374b37fba36243fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["S Tanveer Hussain"], "genres": ["Simulation", "Sports"], "publishers": ["S Tanveer Hussain"], "esrb_rating": "Everyone 10+"}