{"id": 77317, "slug": "bloody-roads-california", "name": "Bloody Roads, California", "name_original": "Bloody Roads, California", "description": "Found your own Motorcycle Club in Bloody Roads, California:<br/><br/>Chopper, Biker and dirty streets, that is what awaits you in Bloody Roads, California. Found your own Motorcycle Club (MC) and drive around, terrifying the neighborhood and get the district under your control. In Bloody Roads, California you become a merciless outlaw, who not only loves his bike but loves having power as well. Play with strategic thinking and tactic to get the best out of the game and always be one step ahead of other players to reach your goals.<br/><br/><br/>Of bikers and outlaws – the story:<br/><br/>Back then, three years ago, I was making good business, mainly firearms. A bit of extortion, a couple girls. All on a pretty good scale. In those days, I had it all! But then I got too careless and the ATF raided my crib. Luckily, they didn’t have too much evidence against me. Still, that mess brought me three years in Rikers Island. During a yard exercise, a guy tried to knife the President of the Bastards of Hell MC. Usually, of course, the first rules in the slammer are: Don’t see, don’t listen, don’t tell. And most importantly, don’t get involved. But the MC guys were honest types. I guess that was why I didn’t just turn my head. Now the Club owed me. I guess I could a joined the MC, but I preferred doing my own thing. Still, the whole appearance of these guys really impressed me. <br/>Three years later I am finally a free man again and the clink did not tame me one bit. However, it is time to start something new. Ever since I can imagine I loved living my freedom on my chopper. My bike always was more to me than just a vehicle. So founding my own motorcycle club and painting the streets red with my fellas ever since felt natural. Together we keep the streets free of those who think can mess with us. <br/><br/><br/>That’s what you ought to do:<br/><br/>Just out of jail and free again but with your own district now that you can manage from underground it is your duty to start your career as a gangster anew and found your own mc club. Your goal must be to expand the Motorcycle Club (MC) and rule the district with the help of your biker friends. Earn money, expand your influence and attack and rob other players in game. But watch out! The cops got their eyes everywhere so always remember to briber them and be sure that they keep their eyes shut and stay out of your business. <br/>With fortunes and tactic you’ll be the king of the road and rule them with merciless severity.<br/><br/>In game Features:<br/><br/>Bloody Roads, California is a strategy and building game, that asks for strategic thinking, fortunes and tactic. These are the features you get in the game and that will keep you entertained and on the edge of your seat for hours.<br/><br/>•\tFound your very own MC<br/>•\tFight against bikers from other players in merciless streetwars<br/>•\tGet onto your chopper and built up your own empire<br/>•\tEarn money by running tattoo studios, bars and other establishments, to expand and built up your MC<br/>•\tTrain your bikers to keep your business going.<br/>•\tHave a blast with this multiplayer strategy game", "metacritic": null, "released": "2015-11-10", "tba": false, "updated": "2019-10-22T13:49:16", "background_image": "https://media.rawg.io/media/screenshots/2fb/2fb5965ae05f3407a995b41b69918631.jpg", "website": "http://bloodyroads.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["seal Media"], "genres": ["Action", "Strategy"], "publishers": ["sealMedia"], "esrb_rating": "Mature"}