{"id": 773100, "slug": "cwis", "name": "C.W.I.S", "name_original": "C.W.I.S", "description": "<p>Welcome all the C.W.I.S, A tactical shooter where you controls the weapons systems of a naval destroyer that was constantly under missile attack. </p><p>I've decided to remake the game that I first developed back in 2020 for a game jam. I have lots of plans for the game with an aim to release a first release build by the end of the year with development builds when major progress is achieved. Feel free to follow for future updates!</p><p> </p>Devlog<p>This game has a video devlog to go along with it where I talk about progress made on the project, future plans &amp; discuss feedback and suggestions from the community. The full playlist can be viewed here:</p><br/>\r\n RoadmapVersion 0.1.x (In Progress)<ul><li>New input setup for future multi-player support.</li><li>New weapon control systems for more modular weapons.</li><li>Updated visuals for weapons systems.</li><li>Copy of original endless survival gameplay.</li></ul>Version 0.2.x (Upcoming)\r\n<ul><li>Game menu layout</li><li>Controller support.</li><li>Basic Weapon Upgrades</li></ul>Version 0.3.x (Upcoming)\r\n<ul><li>AI improvements<ul><li>Missiles are shot at you in a variety of attack styles instead of totaly randomly. </li><li>AI can intercept your counterattacks. </li></ul></li></ul>Version 0.4.x (Upcoming)<ul><li>Game tutorial &amp; first play experience improvements</li></ul>Version 0.5.x (Upcoming)<ul><li>Wave based missions with varying objectives. </li></ul><p><em>Further updates to be determined. </em></p> <p> </p>Jam Version\r\n<p>The jam version of the game is the one I made in 72 hours which is what this game is based on. The full page for the original game can be found here: https://carter-games.itch.io/cwisss9, below is the vital information on how to play the game in its current state. This will be removed when the game has its own tutorial. </p>\r\nJam Version Controls\r\n<strong>Action</strong>\n<strong>Control</strong>\r\nShoot\r\nLeft Mouse Button\r\nAim\r\nMove Mouse Around\r\nChange Weapon (to C.W.I.S 1)\r\n1\r\nChange Weapon (to C.W.I.S 2)\r\n2\r\nChange Weapon (Chaft)\r\n3\r\nChange Weapon (Missiles)\r\n4  \r\nJam Version | How To Play<p>The goal is simple, survival as long as possible, once your ship is out of heath the game is over! Your score will is submitted to the leaderboard when you lose the game!</p>\n<p>\n</p>\n<p><strong>C.W.I.S Guns</strong>\n</p>\n<p>You have two C.W.I.S guns at your disposal, both shoot lots of bullets in rapid succession. There are great at taking on close range misisles but overheat with too much use. Aim these with the mouse and press and hold Lft Mb to shoot. Its recommended you fire in bursts to both consevre ammo and keep the guns working. You lose score if your guns overheat or you try to shoot a gun that has overheated!These weapons can be upgraded when they climb a rank, indicated by a flashing icon on the hot bar, clicking this icon will bring up the upgrades panel and pause the game. \r\n</p>\n<p>\n</p>\n<p>Each C.W.I.S has 3 upgrade types to choose from, rate of fire, ammo capacity and cooling. more on what each ability does can be seen by clicking the icon you want to see more about, the text on the right will change to display what that power will do. Once you are happy with your choice, press the green confirm button to upgrade the gun and continue playing!\r\n</p>\n<p>\n</p>\n<p><strong>Chaft</strong>\n</p>\n<p>The chaft is a defensive screen that can be activated to block incoming missiles. This is great when you have a swarm of missiles about to hit you. The chaft upgrades itself over the amount of times it is used to last for longer periods and cool down faster. \r\n</p>\n<p>\n</p>\n<p><strong>Missiles</strong>\n</p>\n<p>Missiles if you couldn't guess is a weapon for intercepting missiles that are further out. These will not fire at close range, only at medium to long range. They automatically target the latest missile shot at the ship and show up on the radar with a yellow triangle icon. Like the chafts, this weapon upgrades itself when used and it upgrades to allow more frequent use.\r\n</p>\n<p><strong>Supply Crates</strong>\n</p>\n<p>These are small boxes that float towards the ship, they can be shot with C.W.I.S to open them early or by allowed to hit the ship itself to open them. They are essential to your survival! each crate always has some C.W.I.S ammo which is split evenly between both turrets along with a chance of containing some missiles and a rare chance of containing some ship health. When you get a supply crate a UI will pop up showing what you got to the right of the ship. \r\n</p>\n<p>\n</p>\n<p><strong>Radar</strong>\n</p>\n<p>The radar is really useful for seeing what is coming at you, the green circles are missiles heading towards you and any yellow triangles are your missiles heading to intercept. Use this as a tool to plan ahead for how you are going to defend your ship and what weapons to use. \r\n</p>Connect\r\n<p>Join my community discord to chat to me and get the latest progress on our games and assets. http://carter.games/discord<br/></p>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T11:37:56", "background_image": "https://media.rawg.io/media/screenshots/cbb/cbb451e299cae759054710c2acd46721.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Carter Games"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}