{"id": 773288, "slug": "gorospin", "name": "Gorospin", "name_original": "Gorospin", "description": "<p>Customize and battle with Goros in a galactic battle royal on 4 different maps. Based on the Nyanners beyblade stream.</p>\n\n<strong>Twitch Integration instructions<br/></strong>\n<p>To play with twitch chat follow this Twitch Login link to log in to twitch and receive an OAuth token, enter this token in the options menu.<br/></p>\n<p><strong>Note:</strong> Any OAuth token with  chat:read scope would work, if the above redirect is down a site such as https://twitchapps.com/tokengen can be used instead.</p>\n\r\nMultiplayer (Beta)\r\n<p>Online Multiplayer can be enabled in the options menu. Note that this feature is still in beta and might contain bugs or be unavailable depending on server conditions.</p>\n<p>\n</p>\n<p>Big thanks to the playtesters Anon and Anon</p>\n\r\nThe Lost Goros\r\n<p>This game doesn't strictly fit in with Nyanners canon,  thus to justify the existence of multiple Goros participating in a galactic battle royal I have written the following fanfic:</p>\n\n<p>Another unsuccessful clone is guided by Nyanners prime into the basement. This one was normal at first but a month ago got fixated on bimbofication videos and what she called “slut pop”. The effects of this obsession were readily visible on her appearance and personality now.\r\n </p>\n<p>She is guided into a room but before the door is closed and latched up a tuft of white cotton candy comes floating out, escaping confinement. Like those before her this clone seemed to have formed a tulpa as well. Somehow the clones instinctively know how to give it physical form from space dust and tears in the same way Goro Prime was formed. This one kind of resembles Ironmouse, the Goros sometimes form some crude representation of someone who had a big impact on the clone when the clones too far gone to consciously shape them. Unfortunately there's nothing Prime can do for this masterless Goro who will soon float into space to join its countless brethren.\r\n </p>\n<p>With time the Goros in spacecreated simplistic games and rituals to entertain themselves, they seem to still retain some consciousness even after their masters lost theirs.\r\n </p>\n<p>The stardust in the Goros bodies seem to compel them to spin around, mimicking their big brothers formed of the same dust that was not swept up by the Crawling Cringe, the unlucky dust that formed stars, planets and galaxies and was never blessed with consciousness. As such many games involve the Goros endlessly twirling around.\r\n </p>\n<p>While the urge to spin scratches that primordial itch brought unto them by the stardust, there is another need the Goros have inherited. For, you see, tulpas take on some attributes from their creator, they can never be completely independently made. In the case of the tulpas of clones that manifests itself as lust. Much to Primes embarrassment, no Nyanners clone has ever been made that could shake off that vice, at best she managed to create clones that suppressed their lust, however the lust always manifested in some way in the end. In one instance it caused a shy clones breasts to grow to unsightly proportions due to her subconscious desire to attract a mate, in another case that caused a big ruckus a clone emitted an aura causing every female in a mile to spontaneously become pregnant. After the horror of cleaning up after that Prime gave up trying to temper it.\r\n </p>\n<p>Luckily the Goros do not inherit the raw lust of their creator. At most they simply desire some contact with other Goros, seeing as there's no other life forms up there. This attraction causes them to fly around the galaxy, spinning with outstretched arms as they near each other to make contact with each other.<br/></p>\n<p>Prime feels 2 Goros closing in on each other. The first one, made by a clone that was mostly successful, but unfortunately did not live up to the expectations placed on it and was executed, can hardly contain his anticipation of the inevitable  contact he will have with the other Goro, one formed by a clone which developed a nasty smoking habit. A satisfying slap and the executed clones Goros paw sinks into the soft ass of the smoker Goro. The silent Gachi scream he let's out might not travel in space but Prime senses it and lets out a soft “aah my ass” in a deep voice, much to the confusion of onlookers. With the increased Goro population these outbursts are becoming more frequent, making prime worried for the future. The Smoker Goro collapses and drifts away. Goro remains undefeated.</p>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T13:04:48", "background_image": "https://media.rawg.io/media/screenshots/fb3/fb3ff4cfa72df0bc131f39cfe6cddd22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Astridson"], "genres": [], "publishers": [], "esrb_rating": null}