{"id": 773279, "slug": "war-fi", "name": "War-Fi", "name_original": "War-Fi", "description": "<p>Game made in 10 days for OperaGX Game Jam, 2021.  Made with GameMaker.</p>\n<ul><li>Programmer, Designer, SFX and Art: FoxyOfJungle. </li><li>Assistant artist: JaderStorm.</li><li>Music: Space Cowboys, Space Melodies and Do You Just Space.</li></ul>\n<p>My personal highscore is <strong>23936</strong>, can you beat it? :D</p>\r\n\r\nHISTORY: War-Fi\r\n<p>\"Due to the scarcity of resources in an alien civilization named B (with its arms and expansionist policy), it decided to attack civilization A which defends a pacifist and sustainable policy towards the worlds on which they colonized.</p>\n<p>After the defeat of Civilization B, foreseeing a critical shortage of resources, they needed to attack technologically inferior worlds.\r\n</p>\n<p>On earth, a cold war has been going on for many decades, and nations, to protect their media from possible attacks with electromagnetic pulse bombs, have decided to put some kind of protection in their media.\r\n</p>\n<p>However, civilization B after years of spying on the land, decided to steal all internet media, including Wi-Fi transmitters, in order to attack undetected, incapacitating most of the earth's defenses.\r\n</p>\n<p>Urgent steps have been taken to build advanced weapons that do not rely on radio frequency communication.\r\n</p>\n<p>With great difficulty, the earth's armies manage to destroy the threats, capture the alien UFOs and discover their plans and their enemies, as well as the aliens' language and the technology used in the construction of UFOs, making it possible to create more advanced ships that will be used to attack the invading civilization, causing a war over the internet, named \"War-Fi\".\"\r\n</p>\r\n\r\nGameplay:\r\n\r\n<ul><li>There are two modes: Endless and Battle*.\r\n</li><li>In infinite mode you can play with your friend in an epic battle against asteroids and UFOs**.\r\n</li></ul>\n<p><em>*Battle Royale with Capture the Flag mode not included in this version.</em>\n</p>\n<p><em>**Enemy not implemented in this version.</em></p>\r\n\r\nControls:\r\n\r\n<ul><li>Player 1: <strong>W, A, S, D</strong> &gt; Move | <strong>Space</strong> &gt; Shoot | <strong>Shift:</strong> Use Wi-Fi Energy Orb.\r\n</li><li>Player 2: <strong>Arrows</strong> &gt; Move | <strong>O</strong> &gt; Shoot | <strong>P:</strong> Use Wi-Fi Energy Orb.\r\n</li></ul>\n\n<p><strong>Side Note:</strong></p>\n<p><em>Unfortunately I wasn't able to implement enemies in the game because I didn't have time... (only asteroids). The game also lacked a lot of things, like a decent menu, the key mapping screen (the internal system already has this, but you can't change it in the game). Missed Game Over screen and some powerups, sorry. I was planning to do a two player battle royale mode with capture the flag. Players could go into bases and there would be really cool stuff in there. In infinite mode I planned on switching the game to a procedural platform mode, before changing the direction of the ship, making the game more varied and fun.\r\n</em></p>\n<p><em>However, I loved making this game and being part of the Opera GX Game Jam.</em>\n</p>\n\n<p>Thanks for playing! :D<br/></p>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T13:00:23", "background_image": "https://media.rawg.io/media/screenshots/d5f/d5f707f8b9fbf624d1e346cfeceeda31.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Foxy Of Jungle"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}