{"id": 773373, "slug": "the-legend-of-zelda-retro-wild-waty", "name": "The legend of Zelda: Retro Wild (Waty)", "name_original": "The legend of Zelda: Retro Wild (Waty)", "description": "<p>/English/</p>\n<p>Rediscover the exciting world of <em>The Legend of Zelda: Breath of the Wild</em> in a charismatic retro aesthetic. Roam the forests, grasslands, and caves of Hyrule in full-color pixel-art. Experience the unique mechanics of <em>Breath of the wild</em> brought and adapted to 2d. Combat, Explore, Climb plus all the functions of the <em>Sheikah Slate</em>.</p>\n<p>The legend of Zelda: Retro Wild is an early access game. Today, you will only be able to explore the Great Plateau (the tutorial area of the original game), and a few mechanics are not yet implemented (cooking, stealth, or horseback riding). But I will continue working on this project, including one by one all the zones, enemies, temples, weapons and history that it needs to be the perfect adaptation of <em>The Legend of Zelda: Breath of the Wild</em> to... game boy? nes?, super nes?. retro console.</p>\n<p>/Español/</p>\n<p>Vuelve a descubrir el apasionante mundo de The legend of Zelda: Breath of the wild en una carismática estética retro. Recorre los bosques, praderas y cuevas de Hyrule en pixel-art a todo color. Experimenta las mecánicas únicas de Breath of the wild traídas y adaptadas al 2d. Combatir, Explorar, Escalar mas todas las funciones de la piedra sheika.\r\n</p>\n<p>The legend of Zelda: Retro Wild es un juego en acceso anticipado.  Hoy, solo podrás explorar la Meseta de los albores (la zona tutorial del juego original), y unas cuantas mecánicas aun no están implementadas (la cocina, el sigilo, las armaduras o los kologs). Pero seguiré trabajando en este proyecto, incluyendo una a una todas las zonas, enemigos, templos, armas e historia que le hacen falta para ser la perfecta adaptación de The legend of Zelda: Breath of the Wild al... ¿game boy?, ¿nes?, ¿super nes?. Consola retro.\r\n</p>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-22T13:39:51", "background_image": "https://media.rawg.io/media/screenshots/270/270bfb52b7c03267461bf53d50aa5bc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Waty"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}