{"id": 77348, "slug": "real-football-penalty-kicks-2014-footccer", "name": "Real Football Penalty Kicks 2014 - Footccer", "name_original": "Real Football Penalty Kicks 2014 - Footccer", "description": "Champions aren't born. They're made. Do you have what it takes to be the Soccer Superstar? <br/> <br/>Play Football flick shoots, the most intense free-kick soccer game to practice your free-kick skills. This game will give you the highest level of complete control and pinpoint accuracy.<br/><br/>Penalty shootOut Football game is here! Football flick kicks is all about mastering your free shoots, earning your kit and locations through blood, sweat and tears on the pitch.<br/><br/>You a football or soccer games fan?  You are a football cup lover ? then what are you waiting for start scoring penalties in this football game. It is a free fantasy simulation and a comprehensive manager football shoots game, all in one football game package. Experience the free-kick action of your favorite 3D football game like no other! Kickoff from the centre of the football field, dribble your way to the opponent's goal, and kick the ball in for a score. This game will have you hooked for many hours as you watch your player make it to the finals. From realistic to powerful shots, this football game has it all. If you like to play famous football kicks(soccer) then this amazing game is for you.<br/><br/>--------------------<br/>How to Play:<br/>--------------------<br/><br/>- Flick the ball to kick it out<br/>- Swipe to adjust the direction of the ball while it is in the air<br/><br/>----------------------<br/>Game Modes:<br/>----------------------<br/><br/>Real Football Flick Kicks contains five Game Modes<br/>- Beat the levels<br/>- Dare the Knock out<br/>- Play against clock<br/>- Get easy coins<br/>- Beat the wall<br/><br/>-------------------------<br/>Game Features:<br/>-------------------------<br/> <br/>- Game contain 6 different modes.<br/>- Level mode contains easy to difficult 36 awesome levels.<br/>- Top 10  league club teams players to choose from.<br/>- smoother and more realistic and optimized graphics for both players and  perfect football stadiums.<br/>- cool 3d sounds.<br/>- Real football Flick kicks game contains realistic kick, goal keeper and pass animations.<br/>- Smooth animations with 60 frames per second <br/>- Simple yet powerful touch controls with timing control <br/>- Compete with your friends with the integrated world ranking leaderboard <br/>- Pure soccer action!<br/><br/>--------------------<br/>Be Social :)<br/>--------------------<br/><br/>To keep yourself update about new features and games join our social pages.<br/>\u2028- https://www.facebook.com/footccer<br/>\u2028- https://twitter.com/footccer<br/><br/>----------------<br/>Feedback: <br/>----------------<br/><br/>If you have any suggested features or improvements please leave a comment, or send us an email at techmowo@gmail.com. In case something is not working correctly please let us know, I'll be glad to fix that.<br/>Please post comments and feedback. When posting low rating please describe what is wrong to give the possibility to fix that issue.", "metacritic": null, "released": "2014-05-29", "tba": false, "updated": "2019-10-22T14:24:30", "background_image": "https://media.rawg.io/media/screenshots/a5b/a5b1a6ae123654c3dda520bc1892b529.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["S Tanveer Hussain"], "genres": ["Sports", "Arcade"], "publishers": ["S Tanveer Hussain"], "esrb_rating": "Everyone 10+"}