{"id": 77342, "slug": "word-connect-best-word-games", "name": "Word Connect – Best Word Games", "name_original": "Word Connect – Best Word Games", "description": "If you’re looking for an addictive word puzzle game with offline mode &amp; unlimited free hints, Word Connect is the one for you. Share the fun with your family &amp; friends and enjoy Word Connect now!<br/><br/>Swipe letters and find as many words as possible. Discover all words and enjoy the fun and excitement of building words! With tons of unique levels, you’ll enjoy the challenge of testing your vocabulary while earning tons of coins! Train your brain and learn new words. You can even customize word connect game with colorful themes!<br/><br/>Get stuck? Don’t worry, unlimited free hints are with you. Get free hints by watching rewarded video. You can also share levels and ask friends for help. <br/>No Wi-Fi? Don’t worry, you can play Word Connect offline anytime, anywhere!<br/>Afraid to lose in the game? Don’t worry, with no time limits, you can play word puzzle at your own pace!<br/><br/><br/>FEATURES<br/>•\tEasy and addictive gameplay! Swipe your letters to build words<br/>•\tHundreds of levels with tons of words await you<br/>•\tLog in everyday and collect your daily bonus<br/>•\tUnlimited free hints, watch rewarded video for free hints<br/>•\tAsk your family members and friend for help when get stuck<br/>•\tWith no time limits, discover new words at your own pace<br/>•\tSimple and colorful graphics will bring you a highly enjoyable game experience<br/>•\tNo internet connection needed! Play anytime, anywhere you want<br/>•\tSupported on both phone and tablet<br/>•\tCustomize your game with fancy themes<br/><br/>CONTACT US<br/>https://www.facebook.com/Word-Connect-Word-Pet-121185152004782/<br/><br/>Thank you for playing Word Connect! We update word connect regularly, stay tuned<br/><br/>Please rate us 5 star if you like our game, we’re glad to hear any feedback/suggestion/request from you.", "metacritic": null, "released": "2018-04-22", "tba": false, "updated": "2019-10-22T14:24:30", "background_image": "https://media.rawg.io/media/screenshots/26d/26d771574e929e31b638af4037e4987d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jing Du"], "genres": ["Puzzle"], "publishers": ["Jing Du"], "esrb_rating": "Everyone 10+"}