{"id": 773608, "slug": "hidden-object-royal-palace", "name": "Hidden Object: Royal Palace", "name_original": "Hidden Object: Royal Palace", "description": "Hidden Object Game : Royal Palace\r\n<p>Get ready to find the hidden objects games for free offline NOW! Agent Olivia’s hidden object adventure journey in a royal palace is a must-have for all the find Hidden Object game lovers!\r\n</p>\n<p>\r\nFind hidden clues and solve exciting puzzles across 400 levels that draw you right into the heart of the mystery in a new hidden object game‎!\r\n</p>\n<p>Stunning adventure scenes await you in an adventure story game of free hidden objects and find the object games. Enjoy the story of the royal palace and Download free hidden object game 400 levels!\r\nPlay and enjoy the action, romance, rivalries, and adventure in every episode of this new hidden object story.\r\n</p>\n<p>\n<strong>Royal Palace Hidden Mystery Adventure Game Free features:</strong>\r\n– Hidden Object Adventure mystery game free!\r\n– More than 2000 hidden objects to find in stunning scenes!\r\n– 200 levels with mystery place full of hidden objects!\r\n– 200 levels of challenging find the Difference!\r\n– Find the hidden object from the list below &amp; click on it!\r\n– Use the pinch zoom feature to help you find the object!\r\n– Use magical hints to help find difficult objects!\r\n</p>\n<p>\r\nHelp Olivia to find objects games free clues and solve puzzles, revealing the truth about mysterious secrets in hidden object story games free.\r\nJoin Olivia and play the best puzzle hidden object game free. Begin your hidden object journey with Agent Olivia in Royal Palace Hidden Mystery 400 levels- Hidden Object scenes.\r\n</p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T15:29:47", "background_image": "https://media.rawg.io/media/screenshots/e5e/e5e50546314acf6fcb65a992f9684525.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Islasmeth"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}