{"id": 773633, "slug": "the-secret-weirdo-society", "name": "The Secret Weirdo Society", "name_original": "The Secret Weirdo Society", "description": "What's it about?\r\n<p><strong><em>The Secret Weirdo Society</em></strong> is a first-person indie survival horror game based in an underground society of crazy people who really, really hate \"normal\" people and believe they are special or gifted in some kind of way. You've been taken into their society and have no idea why you're there. Will you survive?</p>\r\nGameplay:\r\n<p>-The player can freely roam the level and find things to interact with and ways to progress on.</p>\n<p>-The player can find and use a Flashlight.</p>\n<p>-The player can find and use a Crowbar to break wooden boards off doors and kill weirdos if they try to attack or if they just want to kill them.</p>\n<p>-As of Early Test Build 0.2, there are currently <strong>5</strong> weirdos walking around the level. The weirdos' actions are unpredictable and they'll attack the player at random times.</p>\n<p>-The player will have to manage their health and look for medpacks around the level.</p>\n<p>-The player must look after their hunger and thirst. To do this, they'll have to look around for oat bars and cans of water.</p>\n<p><em>There'll be <strong>3</strong> <strong>levels</strong> and more gameplay features in future updates of course, so stay tuned for that.</em></p>\r\nDevelopment Info\r\n<p>The game is still in early development, but I've decided to release test builds up until the full release so you can all test the game and give me feedback as I develop it. I already know what I'm going to do for future updates, but as mentioned before, it would be nice to get some feedback/suggestions and if you find any bugs/issues, be sure to let me know as well!</p>\n<p><em>Follow me on Twitter if you would like to see future updates or teasers I may post about this game or others I work on in the future: @omogonix</em></p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T15:41:57", "background_image": "https://media.rawg.io/media/screenshots/417/4174d4bd0951d6275fdc96dca33c3db5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lachlan Shelton"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}