{"id": 773691, "slug": "the-backrooms-itch-kcistrying", "name": "The Backrooms (itch) (KCisTrying)", "name_original": "The Backrooms (itch) (KCisTrying)", "description": "<p>A survival horror game focusing on the Backrooms mythos. <em>Done by three students for a game development class; do not expect this to be perfect, but the goal is for it to be entertaining :&gt;.  </em></p>\n<p>Update Log: </p>\n<p>Final deliverable, 3 levels. Main menu works, escape to get to main menu added; S3 doors fixed, many bug fixes enacted. S4 worked on offscreen; if we do not present Wednesday, we'll gladly add that, but for now. It's DONE, and I'm proud.</p>\n<p>W12- New code for S3 doors created, though glitches still exist. Offscreen work on S4 and main menu. Mainly a bug fix week right now. </p>\n<p>W11 - S3 layout done; new prefab for more complex mazes; new prefab for door; offscreen began S4; importing more monsters; bug fixes in particularly display code. </p>\n<p>W10 - primarily bug fixes. Replaced monster asset. Added invisible maze to level 2. Closet fixed; minor POV fix. Level 3 drafting began (offscreen).<br/></p>\n<p>W9 for Play Testing - same controls as before; mini game removed due to unfixable crashes. Key asset updated. For play testers, a reminder: WASD movement, E to interact with doors, only need to touch key to collect. Also, if camera is still jumpy, please note it is an imported asset so we have yet to figure out how to fix it, lol. </p>\n<p>W8 - Finished mini game (though it is crashing for me [Kenzie], so did not remove the button implementation at the moment). Added several assets to scene 2. Dimmed lights, but did not figure out how to turn them off yet. Not shown: early development of scene 3. </p>\n<p>W7 - Changed floor texture and fixed gaps in scene 1; added monster script and some furniture in scene 2; added sfx script; made progress on implementation of lockpick mini game {in isolated scene, inaccessible for now}.</p>\n<p>W6 Part 2 - see W6; added rough implementation to beginning of scene 2. </p>\n<p>W6 for Play Testing - everything below, as well as additional maze functionality; door 1 is now key-mandated (find the key to carry on!); door 2 is button activated. WASD movement, E to interact with doors, only need to touch key to collect. Not shown: lockpick mini game in progress, music (not uploaded yet), title screen (complete but text was stubbornly refusing to show up once in play mode). </p>\n<p>W5 - Functional to walk and explore maze; Unity crashes prevented complete development of maze, but it works for now. Not shown, but in file: beginnings of lockpick mini game.</p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T16:13:19", "background_image": "https://media.rawg.io/media/screenshots/5d8/5d8c11b0d0cd63b6ef1b7cee5a3a2892.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KCisTrying"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}