{"id": 773723, "slug": "war-simulator", "name": "War Simulator", "name_original": "War Simulator", "description": "<p>Dominasi dunia dan bertempurlah melalui berbagai bidang sejarah di Dominasi! Bangun kerajaan Anda dan pimpin negara saat Anda membuat mereka tumbuh dari desa kecil menjadi kota metropolitan yang berkembang, dan bertempurlah sebagai salah satu peradaban besar dari sejarah dunia.<br/><br/>Bangunan dasar memenuhi permainan strategi pamungkas. Bisakah Anda memimpin pasukan Anda menuju kemenangan? Pertahankan basis Anda dari berbagai negara dan mulailah kampanye bersejarah yang maju melalui sejarah. Setiap peradaban, mulai dari Romawi hingga Kekaisaran Jepang semuanya memiliki kekuatan dan unit yang unik.<br/><br/>Bangun basis Anda untuk membangun bangsa Anda. Mulai sebagai pemukiman awal dan tumbuh selama berabad-abad, dari awal sejarah hingga era modern. Pelajari strategi perang, teknologi, dan banyak lagi di bawah orang-orang hebat dalam sejarah di Universitas, seperti Leonardo Da Vinci dan Catherine the Great. Bangun Keajaiban Dunia dan ciptakan teknologi dengan kemajuan yang akurat secara historis. Bangun markas Anda dan perkuat pertahanan Anda lebih jauh dengan Dewan. Tetapkan tokoh sejarah sepanjang waktu ke dewan Anda. Perkuat pertahanan Anda di Kamar Utama. Tingkatkan serangan dan perkuat markas Anda selama masa perang dengan Penasihat yang ditunjuk.<br/><br/>Bawa kekuatan, kecerdasan, dan strategi ke dewan Anda dan buat Penasihat dengan tingkat kelangkaan yang lebih tinggi untuk maju saat Anda berperang. Bangun pasukan Anda, uji strategi Anda melawan pemain lain dalam pertempuran PvP, atau bentuk aliansi untuk menaklukkan dunia bersama dalam Dominasi.<br/><br/>FITUR DOMINASI:<br/><br/>MEMBANGUN BANGSA ANDA: PILIH BANGSA ANDA DAN PIMPIN TENTARA<br/>• Bangun pangkalan dan pertahankan negara Anda<br/>• Taklukkan dunia sebagai salah satu dari 8 Bangsa yang menakutkan dalam perjalanannya melintasi waktu.<br/>• Pilih salah satu peradaban besar dari sejarah seperti Romawi, Inggris, Cina, Prancis, Jerman, Jepang, Korea, dan Yunani.<br/>• Atasi kampanye pertempuran bersejarah untuk mengumpulkan sumber daya penting dan meningkatkan kota Anda saat Anda maju melalui sejarah!<br/><br/>EPIC COMBAT - BENTUK ALIANSI DAN PERANG DUNIA UPAH<br/>• Uji Negara Anda yang kuat dalam pertempuran PvP.<br/>• Serang kota musuhmu untuk mendapatkan banyak jarahan!<br/>• Manajemen sumber daya melalui mekanisme perang. Pertempuran untuk kekayaan yang tak terhitung dan dominasi dunia total.<br/>• Bekerjasama dengan penguasa terampil lainnya dan membentuk Aliansi yang tak terhentikan.<br/>• Lepaskan kekuatan penuh pasukan Anda dengan strategi pertempuran unik untuk mengecoh dan bertahan lebih lama dari lawan Anda dalam perang Aliansi 50 lawan 50.<br/>• Taklukkan dunia dalam Perang Dunia dan bawa pulang rampasan perang!<br/><br/>STRATEGI GAME SEJARAH MEMENUHI STRATEGI<br/>• Bangun jalan Anda ke depan dengan berkonsultasi dengan tokoh-tokoh hebat seperti Leonardo Da Vinci, Catherine the Great, Raja Sejong, dan perintis lainnya dalam sejarah.<br/>• Rancang strategi perang dan perkuat Bangsa Anda!<br/><br/>GAME PERANG: PERTEMPURAN DARI ZAMAN BATU KE USIA RUANG ANGKASA<br/>• Pimpin koloni pemburu dan pengumpul awal dalam penaklukan mereka selama berabad-abad dari awal peradaban hingga era modern.<br/>• Rancang peradaban kecil dan kembangkan menjadi kota metropolitan yang berkembang.<br/>• Bangun Keajaiban Dunia yang bersejarah, termasuk landmark terkenal seperti Piramida Mesir dan Colosseum Romawi.<br/><br/>TEMUKAN TEKNOLOGI BARU<br/>• Meneliti peradaban, material baru, menciptakan persenjataan canggih, dan mengembangkan perdagangan untuk menumbuhkan ekonomi yang ramai<br/>• Melalui penemuan ilmiah, perkuat pasukan Anda dengan peralatan yang lebih baik, tingkatkan bangunan dan pusat kota Anda dengan material modern.<br/>• Buat strategi perang untuk memperkuat pertahanan Anda saat Anda tumbuh lebih kuat.<br/><br/>ACARA BARU!<br/>• Game strategi dengan tujuan waktu terbatas yang menyenangkan berdasarkan peristiwa aktual dari sejarah.<br/>• Kumpulkan hadiah langka untuk membantu Bangsa Anda maju sehingga mereka dapat menaklukkan dunia!<br/><br/>Bangun salah satu peradaban terbesar dalam sejarah dan kembangkan strategi pertempuran untuk menaklukkan lawan. Bergabunglah dengan aliansi dan raih dominasi dunia di DomiNations!<br/><br/>Unduh sekarang untuk mulai membangun peradaban Anda!<br/><br/>Kebijakan pribadi:<br/>https://drgamesid.com/privacy-policy/<br/><br/>Persyaratan Layanan:<br/>https://drgamesid/terms-of-use/</p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T16:28:35", "background_image": "https://media.rawg.io/media/screenshots/ae5/ae5945dd35925c36a1a17d91a8f30571.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DR Games Indonesia"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}