{"id": 773727, "slug": "coding-simulator", "name": "Coding Simulator", "name_original": "Coding Simulator", "description": "<p>Tycoon: dapatkan jutaan, buat game offline &amp; jadilah miliarder di taipan game idle. Apakah Anda suka game bisnis dan game taipan menganggur secara offline? Kemudian buat game taipan dan dapatkan dari simulator bisnis Anda bersama kami! Taipan kerajaan sedang menunggumu!<br/>Mulai dari awal sebagai pembuat game biasa dan jadilah selebriti taipan game terbesar dari game Idle Tycoon!<br/><br/>Apakah Anda selalu ingin menjalankan game simulasi bisnis taipan menganggur? Atau mengelola studio taipan? Apakah Anda suka bermain game bisnis? Sudahkah Anda mencari \"simulator taipan\"? Jadi buka pintu game simulasi bisnis dan offline taipan - taipan pengembang dan game perusahaan cocok untuk Anda!<br/><br/>Game taipan simulator bisnis ... Apa arti kata-kata ini bagi Anda? Mulai simulator taipan game ini. Mulai dari studio game kecil hingga pembuat game terhebat di game manajemen offline taipan ini! Buka dunia taipan kekaisaran yang menganggur dan dapatkan permainan uang!<br/>Buat game bisnis sukses dan nikmati game simulator ini.<br/><br/>Selamat datang di taipan &amp; game idle. Di taipan bisnis ini Anda memulai perusahaan studio game Anda sendiri. Buat simulator bisnis terlaris, teliti teknologi baru game offline untuk meningkatkan taipan simulator Anda dan temukan jenis taipan game baru di simulator taipan ini. Menjadi pemimpin pasar taipan menganggur menikmati game simulasi.<br/><br/><br/>Taipan game - game simulasi bisnis<br/><br/>Setelah Anda berhasil merilis beberapa game bisnis, Anda dapat pindah ke studio idle Anda sendiri dan membentuk tim offline game taipan yang menganggur. Pekerjakan karyawan, latih mereka dalam simulator taipan bisnis &amp; gamer.<br/><br/>Mulai jalan Anda di simulator pembuat game!<br/>Sekarang adalah waktu paling bahagia untuk memulai karir Anda di taipan ini seperti di streamer. Jangan malas, tenang dan jadilah pahlawan dari taipan game yang menganggur! Membuat game simulasi. Mempopulerkan game taipan &amp; simulator bisnis seperti pada simulator taipan streamer dan memulai jalan Anda menuju karir terkenal di dunia simulator menganggur. Buat taipan perusahaan dan buat game bisnis yang sedang tren di dalamnya. Jadikan karier game taipan Anda populer! Jadilah simulator pembuat game. Atau akankah Anda membuka kantor Tycoon di Mars dan mengembangkan simulator pengembang game dari game indie inc di sana? ... Dengan taipan offline semuanya mungkin seperti dalam simulator taipan &amp; streamer hitd &amp; youtube!<br/><br/><br/>GAME EMPIRE TYCOON IDLE - FITUR:<br/><br/>- Buat game offline untuk meningkatkan pendapatan taipan menganggur Anda<br/>- Gamedev Empire Tycoon: dapatkan penghasilan bahkan offline dari taipan game seperti di taipan game gila<br/>- Investasikan dengan bijak dan buka studio taipan Anda sendiri<br/>- Rekrut karyawan di taipan menganggur - simulator game paling keren dari jenisnya<br/>- Merasa seperti taipan smartphone &amp; pahlawan simulator pc, tetapi jangan lupa tim di mana semua orang memainkan peran penting dalam kemakmuran game taipan menganggur Anda secara offline<br/>- Mulai pengembangan game taipan - lebih kreatif daripada di taipan tv<br/>- Dapatkan wawasan baru dari taipan game idle<br/>- Buat mesin game khusus seperti di cyber dude<br/>- Pindah ke kantor yang lebih besar di game indie offline taipan<br/>- Bentuk tim pengembangan kelas dunia seperti simulator dalam aliran dan dapatkan permainan uang<br/>- Dan nikmati suasana piksel dari game simulasi bisnis &amp; taipan game gila<br/><br/>Juga beberapa fitur permainan perusahaan:<br/><br/>- Otomatiskan perusahaan Anda untuk membuat game taipan menganggur Anda menjadi lebih besar secara offline<br/>- Dapatkan untung dari investasi, keterampilan, dan kaya di taipan game idle<br/>- Menjadi pengusaha game manajemen<br/>- Menjadi pencipta game sejati seperti di simulator youtube!<br/><br/>Jika Anda menyukai game taipan &amp; simulator bisnis dan game taipan menganggur offline, Anda akan menikmati simulator game kami! Gim kasual yang mudah dimainkan di mana keputusan strategis harus diambil untuk mengembangkan simulator pembuat gim dengan hasil yang menguntungkan. Tingkatkan permainan bisnis offline taipan Anda.<br/><br/>Penggemar taipan atau game indie? Mari kita mulai game simulasi bisnis ini. Tunjukkan keahlian Anda di taipan game idle ini!</p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T16:30:05", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DR Games Indonesia"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}