{"id": 773778, "slug": "steins-fishing-tale", "name": "Stein's Fishing Tale", "name_original": "Stein's Fishing Tale", "description": "Description\r\n<p>Stein’s Fishing Tale is a survival, role-playing, fishing game. </p>\n<p>In this game, the player will play as a scientist who recently moved to an island. To survive on that island, the player will need to continue fishing as it’s the only reasonable source of food. But the player needs to be very careful around them as some of the fishes have become very aggressive due to nuclear radiation. And throughout this process of exploration and survival, the player will eventually discover the truth of the world and learn the protagonist’s true identity.<br/></p>\n<p>Other than eating the fish for survival, the player can use the fish they caught and turn them into fish bones to upgrade and obtain different fishing rods for better efficiency. Moreover, the player will discover many tasks waiting for them to complete, and by doing so, the player will unlock story fragments learning about the protagonist’s identity. There are also special items spread around multiple scenes in the game uncovering a part of the history of the world. Collect all story fragments and special items to grasp a full picture of the history and face a final decision regarding the protagonist and the whole world!\r\n</p>\n\r\nCredits\r\n<p>Team loIs: Anna Li, Hongdan Wang, Shiye Li, Zhige Wang, Zhijie Zhao\r\n</p>\n<p>Music Support: Xiang Lian\r\n</p>\n<p>Voice: Nick Dolloff\r\n</p>\r\nWeb Build\r\n<p>https://www.zhijiezh.me/SteinsFishingTaleBuild/Web%20Build/index.html</p>Simplified Chinese Versions<p>04/20/2022 Released: simplified Chinese version</p>\n<p>Warning: This language versions experienced less playtests, so it may not be as stable as English version.</p>", "metacritic": null, "released": "2022-04-19", "tba": false, "updated": "2022-04-22T17:00:27", "background_image": "https://media.rawg.io/media/screenshots/12b/12b339fa1c6b1b597d717623d4d82f4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["zhijiezh", "annaleee", "shiyeli", "AkarinMaki", "wang-hd"], "genres": [], "publishers": [], "esrb_rating": null}