{"id": 773721, "slug": "western-spirit", "name": "Western Spirit", "name_original": "Western Spirit", "description": "<p>Western Spirit por The Four Club<br/></p>\n<p>(6° 1°) Temática : Survival<br/><br/></p>\n<p><strong>Descripción:</strong><br/><br/>-Historia: Nuestro protagonista se adentra en el peligroso desierto, sin saberlo entra en el territorio del vengador del oeste, este con sus poderes envía ilusiones idénticas al protagonista para poder matarlo. Junto con las ilusiones el vengador también envía a su mascota el gusano de arena. <br/><br/>-Controles: el jugador se puede mover tanto con las flechas como con wasd, por comodidad se recomienda usar las flechas, ataca con z y rueda con x, al rodar obtiene un breve efecto de invulnerabilidad pero es muy corto también gasta 500 puntos de stamina así que hay que pensar bien cuando usarlo.</p>\n<p>-Características del juego: el juego cuenta con dos niveles. Para poder completar el primer nivel y pasar al siguiente el jugador deberá vencer al gusano de arena, el jugador si quiere puede matar a todas las ilusiones pero esto es opcional, eso si, el jugador cuenta con solo 3 vidas al comienzo de cada nivel, las ilusiones le quitan 1 de vida y el gusano y el vengador le quitan 2 de vida, al matar a las ilusiones el jugador tiene una probabilidad del 25% de recuperar 1 de vida.<br/><br/>-Final: el juego termina luego de eliminar al vengador del oeste, tras hacerlo aparecerá la pantalla de game over y el jugador podrá salir o reiniciar desde el principio.</p>\n<p><strong>Integrantes</strong></p>\n<p>Matias Reynoso, Agustin Tapia, Matias Lima, Nahuel Flores</p>\n<p><strong>URL</strong></p>\n<p>https://matiasreynoso.itch.io/western-spirit</p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-04-22T16:27:34", "background_image": "https://media.rawg.io/media/screenshots/713/7139fa35bb60f60453fd69e8661bf76a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["matiasReynoso"], "genres": [], "publishers": [], "esrb_rating": null}