{"id": 77399, "slug": "3on3-freestyle-basketball", "name": "3on3 Freestyle Basketball", "name_original": "3on3 Freestyle Basketball", "description": "This is the real-time 3 on 3 Basketball MOBA game you’ve never played before! A brand-new multiplayer basketball game with a mixture of hip-hop, bringing streetball right to your fingertips. Build up your team, customize your players and dominate in the exciting world of competitive street basketball! <br/><br/>√Key Features<br/>Classic 3 on 3 half court game or challenge your friend in a 1 on 1 match among other various game modes. Play to the exciting beat of hip-hop music and in the backdrop of unique street graffiti; customize your players’ skills and accessories to make them stronger and show off your unique style.<br/><br/>√Real-time<br/>An authentically competitive real-time basketball game with instant voice and display communication. Coordinate with your club mates to dominate the courts. Experience silky control for the first time ever!<br/><br/>√Awesome Moves<br/>Unlock fancy basketball moves that you don’t see in typical basketball games! Drive to the net and perform a reverse dunk over your opponent, bounce the ball under your opponent’s legs and do a layup, shoot at the sound of the buzzerbeater and land a shot from outside the three point line! Unlock new Graffiti and moves to grow your players and take your team to a higher ranking! <br/><br/>√Customized Players<br/>Stop wearing the same jerseys to every game. Dress up as a superhero, style your Mohawk, play in your teams mascot costume, there are no rules to what you can wear on the court! Customize the players to your unique style and create the most awesome looking team in the Streetball World!<br/><br/>This is my Turf. You want it? Come get it!", "metacritic": null, "released": "2018-04-29", "tba": false, "updated": "2022-12-26T22:54:21", "background_image": "https://media.rawg.io/media/screenshots/4d1/4d1b04dd838fd99b70db8ff8f4e2be08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["uminton", "Uminton Sports"], "genres": ["Sports"], "publishers": ["Chengdu Uminton Interaction Technology"], "esrb_rating": "Teen"}