{"id": 77409, "slug": "olympus-rising-hero-defense", "name": "Olympus Rising: Hero Defense", "name_original": "Olympus Rising: Hero Defense", "description": "Download Olympus Rising now, and prove that you have what it takes to become a god in this cutting-edge action-strategy game!<br/><br/>- Fight large-scale battles with hundreds of units<br/>- Customise your unique team of Heroes with almost infinite variations of powerful loot<br/>- Recruit fantastic beasts from Greek myth and legend<br/>- Build a fabulous city on Mount Olympus<br/>- Strategically design your defenses to defeat attacking players<br/>- Form an unbeatable Alliance and fight epic campaigns in the Alliance Wars<br/><br/>This game requires Camera and Microphone access, in order to use the broadcasting feature. Declining the permission to use either of these features, will result in the broadcasting feature not working.<br/><br/>This game is ad-supported and no in-app purchases are required to progress.<br/>This game may include \"Interest Based Ads\" (please see our privacy policy for more information).<br/><br/>- - - Terms of Service and Privacy Policy - - -<br/>By accessing or using a Flaregames product, you're agreeing to our Terms of Service (www.flaregames.com/terms-service/) and Privacy Policy (http://www.flaregames.com/privacy-policy/).<br/> <br/>- - - For Parents - - -<br/>Olympus Rising is free to download and play, however some game items can also be purchased for real money. Parents can find more information on our games and policies here: http://www.flaregames.com/parents-guide/", "metacritic": null, "released": "2016-05-03", "tba": false, "updated": "2019-07-29T22:40:02", "background_image": "https://media.rawg.io/media/screenshots/86d/86d153c4ea8031428cc0d630e47f37a4.jpg", "website": "http://flaregames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 544, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["flaregames"], "genres": ["Action", "Strategy"], "publishers": ["Flaregames"], "esrb_rating": "Teen"}