{"id": 774027, "slug": "ten-tales-from-the-records-of-the-adamant-gambit", "name": "Ten Tales from the Records of The Adamant Gambit", "name_original": "Ten Tales from the Records of The Adamant Gambit", "description": "<p>This anthology of ten short slice-of-life games explores life aboard a generation starship, originally made over ten days in December 2021 for the Variety Megajam.</p>\n<p>This collection includes:\r\n    </p>\n<ul><li> <strong>All ten tales</strong> from aboard the generation ship <em>The Adamant Gambit</em>, now in a single downloadable launcher\r\n</li><li> Exclusive <strong>developer commentary</strong> from the four of us on each game\r\n</li><li> Carrie's <strong>original soundtrack</strong>, in both MP3 and FLAC formats\r\n</li><li> <strong>Lead sheet music</strong> for each piece in the soundtrack\r\n</li><li> Rose's <strong>HD illustrations</strong> from <em>\"A True History of The Adamant Gambit\"</em>\n</li></ul>\n\n<p><strong><em>Ten Tales from the Records of The Adamant Gambit</em><br/></strong></p>\n<p><em>Eight-Red City Museum of Spaceflight <br/></em></p>\n<p>The Adamant Gambit's thousand-year journey has long fascinated and frustrated scholars. While none debate its historical impact, little documentation survived the generation ship's early grounding days; we are left trying to piece together a story from re-used and re-made artifacts, decaying machinery, and contradictory and incomplete family legends. The last remaining survivor of the journey, the ship's own intelligence AMM-NET, has been famously quiet about what, if anything, it remembers of the journey. <br/></p>\n<p>However, the ERCMS is thrilled to announce that AMM-NET has broken its silence, and allowed the museum access to a selection of its records of the journey. Under AMM-NET's supervision, our staff have meticulously created ten interactive experiences so visitors can experience life during the Adamant Gambit's journey. We are thrilled to welcome the public  to participate in this groundbreaking new exhibit, where they will be able to  perform routine ship maintenance, visit the ship's library, cook traditional Adamant Gambit meals, and more.<br/></p>\n<p>This new addition to the museum's permanent collection is now open.<br/></p>\n<p>If you're just looking to play the original games, they're each available online here.</p>\n<p><em>The Adamant Gambit</em> was created by Emma, Rose, Sean, and Carrie.\r\n</p>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-04-22T19:02:44", "background_image": "https://media.rawg.io/media/screenshots/803/8038dd5ad22358d1662cfed7a4e5b65c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Sean", "dumplingsquid", "carrie z", "The Adamant Gambit", "ModernModron"], "genres": [], "publishers": [], "esrb_rating": null}