{"id": 77403, "slug": "putt-putt-golf-4g", "name": "Putt Putt Golf 4G", "name_original": "Putt Putt Golf 4G", "description": "Putt Golf 4G has been updated to perform better on iPhone 3GS, iPhone 4, iPod 3G &amp; iPod 4G devices.  Putt Putt Golf 4G &amp; Putt Putt Golf 3D share the same experience. <br/><br/>The OFFICIAL Putt Putt Golf game! The legendary name in mini-golf with over 90 holes of putting fun! <br/><br/>You don’t have to play golf to love Putt Putt mini golf, it’s a fun experience for all with the fantastically fun courses in the beautiful levels of: Fantasy Lane, Roman Road, Arctic Lands, Pirate Paradise and Jungle fever. <br/><br/>For best playing experience: Keep your finger on the phone and not swipe too fast and it works well <br/><br/>THE REAL EXPERIENCE <br/>Watch out for the water! And the giant moving snail or that strange rotating cakes! Inspired from the miniature golf putting courses from the famous Putt Putt Golf capturing all the skill and fun to make the game truly enjoyable. Do well and you might even get a medal! <br/><br/>MULTIPLE GAME PLAY MODES <br/>Putt Putt Golf let’s you enjoy multiple styles of play: <br/>‘Quick Play’ select any hole to beat your score <br/>‘Pass &amp; Play’ to challenge your friends <br/>‘Time Trial’ for those in for a quick challenge against the clock <br/>‘Championship’ for those ready to push themselves and test their skills <br/><br/>LET THE WORLD KNOW YOUR SCORE! <br/>Post to friends through Facebook and Twitter, and post your high-scores on the world leader board – compare your rankings across the globe! <br/><br/>As well as the pass and play mode, the game stores up to 5 different profiles, so the whole family can play at their own pace (no worry about overwriting scores!). <br/><br/>Thank you and enjoy!", "metacritic": null, "released": "2010-12-17", "tba": false, "updated": "2019-10-22T14:23:13", "background_image": "https://media.rawg.io/media/screenshots/014/014f9c8dd6b25fd26cf28c357fae8b23.jpg", "website": "http://www.jumpgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Reliance Big Entertainment UK Private"], "genres": ["Sports"], "publishers": ["Reliance Big Entertainment UK Private"], "esrb_rating": "Everyone 10+"}