{"id": 774017, "slug": "run-cleopatra-run", "name": "Run Cleopatra Run", "name_original": "Run Cleopatra Run", "description": "Cleopatra runner, Desert rush subway with addictive endless running game!\r\nRush as fast as you can\r\n<p>,Careful the rolling stones in the desert! Intuitive controls to run left or right, jump in the sky to obtain more coins, excited slide to safety!<br/><br/>Help your character to escape the chasing monster! Use thunder power after double tapping, experience the unique thunder power on the rush.<br/></p>\r\nThe more score multiplier you collect, the higher score you get.\r\nCleopatra runner, Desert rush is an endless desert subway running game\r\n<p>, Get more coins to get more characters, Get more and more key of life or coins as you can!<br/>Dash forward, run fast and use all kinds of boosts and power ups, such as flying shoes to jump high, thunder power to protect you from crashing, tap the falcon button at any time to use the falcon wings.<br/><br/>How to play:<br/>👉 Mouse up to jump, Mouse down to slide, Mouse  left and right to move sideways.<br/>👉 Double Click to use the thunder power.<br/>👉 Avoid obstacles and stay ahead of chasing Monster.<br/>👉Use power-ups, upgrade it to increase power-up duration<br/><br/><strong>Cleopatra runner, Desert rush Features:<br/>.Subway, temples and ancient houses scene.<br/>.Rush as fast as you can.<br/>.Influent screen touch &amp; gravity control.</strong><br/>.Colorful and vivid HD graphics.<br/>.Powerful music.<br/>.Upgrade all the properties to get endless power.<br/>.Get more and more keys of life.</p>", "metacritic": null, "released": "2022-04-14", "tba": false, "updated": "2022-04-22T18:56:05", "background_image": "https://media.rawg.io/media/screenshots/785/7856c3916e04d739b08b69f7e89a4c10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["egyindie"], "genres": ["Action"], "publishers": [], "esrb_rating": null}