{"id": 774241, "slug": "wildfire-itch-laserpanzerwal", "name": "Wildfire (itch) (LaserPanzerWal)", "name_original": "Wildfire (itch) (LaserPanzerWal)", "description": "<p>The forests are on fire.</p>\n<p>You are in control of all emergency units to fight the flames, but you lack time and resources.  Saving the nearby towns is impossible, but you have to try everything you can to hold the inferno back long enough for the people to evacuate. Delay the inevitable so everybody can survive!</p>\n<p>This is an entry for Ludum Dare 50. Theme: Delay the inevitable.</p>\n<p>Please note: The HTML5-Version is identical to the native versions but depending on your OS, browser and hardware you may experience performance issues. Please download and run the native version of the game if you encounter any problems.</p>\n<p>This game was created in a very short time span and thus may contain bugs. Please feel free to report any bugs you find. Check back in at a later point for  future versions with fixes and additional content that is missing due to time limitations.<br/><br/></p>\n<p>How to play:</p>\n<p>For each level you are given a set of emergency response units for your task to fight the fire and evacuate the towns. People are packing and leaving, but it is going to take some time to get everyone out. Use your units to both keep the fire away and assist in the evacuation process.</p>\n\n<p>The map consists of square cells of different types: forest, towns, roads, etc. Most of these cells contain plants and thus can burn. Burning cells can ignite neighboring cells, spreading the fire. Wind will carry the fire in its direction, speeding up the spread.</p>\n<p>The game ends when all town cells are either evacuated or burned.</p>\n\n<p>Controls:</p>\n<p>Mouse to select and control units, right-click to cancel selection.<br/></p>\n<p>WSAD or Arrow keys to move camera.</p>\n<p>Mouse Wheel to zoom.</p>\n\n<p>Unit Overview:</p>\n\n<p>Each unit is represented by a card in the top of the screen. You can select units by clicking the card, pressing the corresponding number key on your keyboard or clicking the unit on the map (provided you have no other unit selected). You can deselect units by right-clicking.</p>\n<p>Each unit has a unique purpose and its own advantages and disadvantages.</p>\n<p>Some units have a cool-down period before they can be used again. This is indicated by a countdown on the grayed-out card.</p>\n<p>Some units can only be used once and will disappear from your deck once activated.</p>\n<p>Ground units can temporarily stay in burning cells, but will take damage fast and be destroyed if exposed to fire for too long. Make sure they don't get trapped in the flames.</p>\n<p>Firetruck <br/></p>\n<p>The firetruck is your base unit to fight the fire. It can extinguish up to three cells at once, but needs roads to move and thus can only reach cells adjacent to roads. Extinguishing takes some time though.<br/></p>\n<p>Cells that are currently being extinguished will not spread fire, so firetrucks can block an approaching wall of fire up to a certain amount.</p>\n<p>Police car</p>\n<p>Police cars can speed up the evacuation process in adjacent cells. They are useful especially in areas that are currently highly threatened by fire to ensure the evacuation is finished before the cells are lost.</p>\n<p>Helicopter</p>\n<p>Helicopters are used for aerial firefighting. They move fast and can extinguish cells instantly, however, they can only extinguish a single cell at once and need to refill after each approach, adding additional delay to the next use.</p>\n<p>Helicopters are useful for selective assistance for firetrucks and to fight fires that are not accessible by roads.</p>\n<p>Bulldozer</p>\n<p>Bulldozers can be utilized to create fire breaks. These are rows of 5 cells that cannot be ignited as all plant life and flammable material was removed from them.</p>\n<p>They start instantly but can only clear forest cells and only be used once.<br/></p>", "metacritic": null, "released": "2022-04-19", "tba": false, "updated": "2022-04-22T20:31:24", "background_image": "https://media.rawg.io/media/screenshots/499/49903f95332d16839003479e1c7c679e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["LaserPanzerWal"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}