{"id": 77429, "slug": "olympique-de-marseille-manager", "name": "Olympique de Marseille Manager", "name_original": "Olympique de Marseille Manager", "description": "OLYMPIQUE DE MARSELLA FC FANTASY MANAGER 2018 – BE THE BOSS: the edition of the most addictive mobile football manager game has arrived for iPhone and iPad! Lead the team of your dreams and defeat thousands of users for FREE.<br/><br/>THE MOST ADDICTIVE FOOTBALL MANAGER FOR MOBILE DEVICES<br/><br/>Your team. Your club. Sign, train, challenge and defeat thousands of rivals from around the world.<br/><br/>SIGN THE BEST PLAYERS IN THE WORLD<br/>Sarr, Cabella, Gomis, Thauvin, Diaby, as well as a whole host of other forwards, midfielders, defenders and goalkeepers from around the world. Train them, increase their level, improve their skills and let them play. If you work hard, you can develop an unbeatable team.<br/><br/>DO YOU KNOW FOOTBALL? CAN YOU BECOME THE LEAGUE’S BEST?<br/>A competition like the league can prove just how much you know about football. The main competition in Olympique de Marsella Fantasy Manager is the league, where you'll have to give your all to be in top shape for each game and fight to reach the top division. Play with the best and prove that you really know your football.<br/><br/>GO UNDEFEATED IN ALL COMPETITIONS!<br/>Develop the best team and have your opponents trembling by challenging your rivals to head-to-head matches or when facing them in tournaments.<br/><br/>PLAY AGAINST YOUR FRIENDS AND THOUSANDS OF OTHER USERS<br/>Friends who also play can help you advance in the game, and, of course, FACE YOU!<br/><br/>THE POINTS ARE BASED ON REALITY<br/>Linked to reality! One of the features that make this game realistic is the players’ point values. These vary according to their performances in real life so ensure you pay attention every week to make sure you have the best players from your team on the field.<br/><br/>POWER UPS AND ENHANCEMENTS<br/>Strengthen your team with virtual power ups. The more virtual goods you have, the more possibilities you have of winning games!<br/><br/>Download OLYMPIQUE DE MARSELLA FANTASY MANAGER for free now and lead your favourite team.<br/><br/>Thanks for playing Olympique de Marsella FC Fantasy Manager!<br/><br/>(Available for iOS 8.0 and above)<br/><br/><br/>OFFICIALLY LICENSED PRODUCT OF FROM THE BENCH - trademarks and copyrighted works, including the Clubs logo, and other intellectual property rights are owned and/or held by From The Bench and may not be used without From The Bench’s written consent. Visit http://www.fromthebenchgames.com/ for more information.<br/>To be able to play this application, you will need internet connection. This application offers in-app purchases which you can disable in your device settings.<br/>By using this application, you accept the “Privacy Policy” and the “Legal Notice”. It contains advertisements of “From The Bench, S.L.” and their partners, including advertisements within the game. It also collects data through analysis technology and delivers third party advertisements including network and GPS locations. The app contains direct links to social networks for those above the age of 13 and also direct links to the internet.", "metacritic": null, "released": "2017-01-19", "tba": false, "updated": "2019-07-29T23:12:32", "background_image": "https://media.rawg.io/media/screenshots/9c9/9c95bbe4ad4bf79e36325153ddd52af6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FROM THE BENCH"], "genres": ["Simulation", "Sports"], "publishers": ["FROM THE BENCH"], "esrb_rating": null}