{"id": 77432, "slug": "fashion-pet-makeover-games", "name": "Fashion Pet Makeover Games", "name_original": "Fashion Pet Makeover Games", "description": "~~~~Hurry up! The Fashion Pet show is about to begin~~~~<br/><br/>Download ***Fashion Pet Makeover***! Help the Pet to look trendy for the mega show. Can you help out with this big event?  It’s Showtime!<br/><br/>*The Adorable Pet needs a Makeover and Spa. Dress up your pets with adorable outfits and accessories!<br/>Be ready to show your fashionable taste with your favorite pet. Dress up them for a big event. Puppy pet needs an amazing SPA  and makeover. Help them to choose perfect outfits. Explore the world of a real fashion pet star. It’s time to help the pets compete in talent shows, Show is going to start. Hurry up!<br/><br/>*Pet can’t wait to be all dressed up! Pick up the perfect clothes and accessories to make them the most adorable and glamorous pets in the fashion show. It is a chance of a lifetime to become the pet star. Play with fun!<br/><br/>Exciting Game Features:<br/>* DRESS UP - Customize pet with dozens of style options<br/>* MAKEUP SALON - Polish your Puppy pet for the Big show’<br/>* SPA SALON – Lots of amazing Spa activities. Pet will look so shiny <br/>* TALENT SHOW -  Perform in different pet talent award show challenges <br/>* PET CHARACTERS - Choose the different pet characters as you want<br/>* FASHIONISTA-  Show off your fashionista in pet makeover and dress-up show challenge!<br/>* RED CARPET – Steal the show on the red carpet! Let’s do it now<br/><br/>*Beautiful Pet will win your heart. It will be looking gorgeous fashion star, Don’t miss out on the Fun! Download “Fashion Pet Makeover Games” and become greatest pet superstar.<br/><br/>Leave a review and let us know what you think about this fun game. We will use feedback In our upcoming updates! <br/><br/>For more news and details:<br/>Visit our website: http://www.creativedistrix.com/<br/>Like our page on Facebook: https://www.facebook.com/Creativedistrixgames<br/>Follow us on:<br/>Twitter: https://twitter.com/CreativeDistrix", "metacritic": null, "released": "2017-12-08", "tba": false, "updated": "2019-10-22T14:23:14", "background_image": "https://media.rawg.io/media/screenshots/614/6148307600e9c1dd64fca556c48c5632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hamza Awais"], "genres": ["RPG", "Family"], "publishers": ["Hamza Awais"], "esrb_rating": "Everyone 10+"}