{"id": 77435, "slug": "teenage-crush-love-story-games", "name": "Teenage Crush Love Story Games", "name_original": "Teenage Crush Love Story Games", "description": "Hello, teenagers! Are you ready for an awesome love story adventure? Are you looking for high school games with high school love storyline? Are you willing to help an attractive heroine win the heart of the boy she likes? Download the brand new game Teenage Crush Love Story Games and create your own love story with the most attractive characters, excellent visuals, and tricky choices. This interactive story presents you with a deciding choice – once you choose your own path, there's no turning back! <br/><br/>- BECOME A HEROINE: Be the leading actress of your own story.<br/>- DRESS FOR SUCCESS: Dress up your character in the latest fashion.<br/>- FIGHT FOR LOVE: Don't let the one guy you care about get away.<br/>- NOURISH A FRIENDSHIP: Help your BFF get out of trouble.<br/>- DEFEAT YOUR ENEMIES: Prove to yourself that you're stronger than them.<br/>- CHOOSE WISELY: Make choices which change the storyline.<br/><br/>- SUPPORTED LANGUAGES: English, Spanish, Portuguese, German, French, Russian, Italian, Polish, Turkish, Slovak, Serbian and Arabic.<br/><br/>*** Make your own story with your first crush! Have fun! ***<br/><br/>Get ready for an unforgettable love adventure in the summer before college! Find your high school love in the summer camp and feel the butterflies in your stomach. Dress up to be the most beautiful girl at the party and let the school romance begin. If you're looking for episode games for teenage girls, this will be one crazy love journey which will help you create your own love story. The new college year is about to begin, so will you find your first love this summer? High school story games are waiting for a real girly girl and our latest game Teenage Crush Love Story Games offers you the visuals like you've never seen before.", "metacritic": null, "released": "2018-03-09", "tba": false, "updated": "2019-07-30T03:03:23", "background_image": "https://media.rawg.io/media/screenshots/947/947af0d3cd9d408df11c3813d0464b77_Y6dQxuD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Midva Games"], "genres": ["RPG", "Simulation"], "publishers": ["Midva"], "esrb_rating": null}