{"id": 774666, "slug": "mythic-defender", "name": "Mythic Defender", "name_original": "Mythic Defender", "description": "** Join us on discord and get involved in Mythic Defender development! **<br/>https://discord.gg/M4QtfqVXtY<br/><br/>The gods need your help, hero!<br/>Evil creatures are reaching the god's domain to steal their loots. You have been chosen to protect their kingdom using your mighty bow and the tower of the gods.<br/><br/>In this VR game combining Tower Defense &amp; Archery, you will require strategy to place wisely towers attacking enemies and dexterity to aim well with your bow.<br/><br/><br/>Chose between 6 towers with a strong identity and setup your own strategy to defeat enemies waves. But be careful: tower cost you gold and you're only wining gold by killing enemies.<br/><ul><li>Artemis: A basic tower firing arrows<br/></li><li>Ares: A tower firing explosive projectiles<br/></li><li>Zeus: A tower firing an electric projectile bouncing between enemies<br/></li><li>Hades: A tower with very high damage but very low attack rate<br/></li><li>Poseidon: A support tower with low damage but slowing enemies<br/></li><li>Apollo: A support tower revealing and weakening enemies</li></ul><br/><br/>Grab your bow, teleport to the tower giving you the best angle of attack, aim, and unleash a rain of physically based arrows onto your opponents: the more you pull the string, longer the arrow will be fired, so aim correctly and manage the pulling!<br/><br/><br/>Fight against mythological enemies like satyrs, cyclopes or bards. Enemies have different properties, capabilities or type, they can be elite (stronger and more resistant), mounted on a cute boar, or even bosses! Choose wisely which one you need to kill first, as your choice could lead to victory, or defeat ...<br/><br/><br/><br/>** DISCLAIMER **<br/><ul><li>This game uses OpenXR and you may need to configure your Oculus/SteamVR app correctly the first time. A very easy tutorial is available on our website and our discord server. Don't hesitate to contact us if you have some troubles.<br/></li><li>Valve Index and WMR should be supported using SteamVR but haven't been tested yet. This is why we are not announcing officially support for those headsets. If you still decide to get the game and face some issue, please feel free to reach us on discord or by email.</li></ul>", "metacritic": null, "released": "2022-04-23", "tba": false, "updated": "2022-04-25T03:21:14", "background_image": "https://media.rawg.io/media/screenshots/89a/89ae4d15a728b752e88af23e30168608.jpg", "website": "https://www.hexware-studio.com/mythic-defender/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hexware Studio"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Hexware Studio"], "esrb_rating": null}