{"id": 774687, "slug": "keepup-hunter", "name": "KeepUp Hunter", "name_original": "KeepUp Hunter", "description": "STOP - KeepUp Hunter will be in EA process for some time (probably 3 to 6 months) to work out balancing with community and find any problems. Therefore, only buy it if you agree with it or wait for this time. <br/><br/><strong>Please read the Early Access notes.</strong><br/>Early Access - means that the game is still in development.<br/><br/><h3>KeepUp Hunter: A classic wave-based zombie game. </h3><br/><strong>The world</strong> has been overrun by a ravenous zombie wave and everyone is fighting to survive on their own. Smaller groups have also joined forces to stop the zombies. Are you one of them?<br/><br/><strong>Are you ready?</strong> Your concentration will be challenged to the point of exhaustion. How many waves can you manage? Compete alone or with friends in co-op mode with up to 3 players against the enemy zombie herd. Your task is to hold off the ravenous zombies for as long as possible. With each wave that starts, the zombie wave gets stronger. You earn points and can exchange them for new weapons, traps and other areas at any time. <br/><br/><strong>Be ready to help your teammates at any time.</strong> When a player is injured, you'll hear it through a pulsating heart. You only have a few seconds to save him, otherwise he'll be lost forever until you finish your wave.<h3>Single player and multiplayer mode</h3><br/>- Single player<br/>- Multiplayer co-op mode up to 3 players<h3>Level-Up and Rank System</h3><br/>KeepUp Hunter includes a level-up and rank system. Once you reach a certain level, you will be assigned a rank. The better you are, the higher your rank. Each rank unlocks more possible charactere and playable maps. Note the deposited information in the description.<br/><br/>If you die or get injured several times in the game, you will lose points, which can lead to losing the rank.<h3>Difficulty level</h3><br/>The difficulty level increases additionally with the number of players.<h3>Character has complex body mechanics</h3><br/>- Selectable characters<br/>- Pleasant body movement<h3>Weather System</h3><br/>Rain and fog - random system<br/><br/><strong>Dynamic day / night cycle</strong><br/><br/>With a great soundscape", "metacritic": null, "released": "2022-04-22", "tba": false, "updated": "2022-04-25T03:41:34", "background_image": "https://media.rawg.io/media/screenshots/aa8/aa8b7feab05bbe232193918bc24f52c3.jpg", "website": "https://store.steampowered.com/franchise/witte-studio", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Witte´s Studio"], "genres": ["Action", "Adventure", "Strategy", "Indie"], "publishers": ["Witte´s Studio"], "esrb_rating": null}