{"id": 77473, "slug": "stickman-war-lightsaber-games", "name": "Stickman War Lightsaber Games", "name_original": "Stickman War Lightsaber Games", "description": "Stickman Warriors are back again! This time Stickman is coming with neon lightsaber~~~Use your lightsaber to kill other warriors! Make a trick and attack with neon sticks, become an epic fighter!<br/><br/>Stickman War Lightsaber Games is the best free amazing and addictive game most realistic stickman games ever!<br/><br/>Become the strongest Neon Stickman! Fight in the most epic battle arena that you have never seen before.<br/><br/>The Best game of Survival, You will be a super warrior by killing and destroy different enemies, This fighting game is conducted between neon stickman characters. You need to fight until the last drop of blood. Use your weapons and neon stick to kill your opponent. Join this epic and dangerous fight and play Stickman War action games.<br/><br/>Warriors come with full of speed, you need to show your heroic kills in the game. Glowing sticks and other neon weapons are available. Avoid the enemies and Survive. Experience the real fight and neon atmosphere in the best stickman game! Use your skills and tricks to crash the warriors, destroy them and win this Epic fighting game.<br/><br/>Special features: <br/>*Epic Stickman Fighting game is here<br/>*Full of destruction and action ~ best in stickman games!<br/>*Dynamic gameplay! Stern battles in each level<br/>*Fun and addictive hardcore gameplay<br/>*Become the first epic fighter – Make highscore!<br/>*Multiplayer supports on one screen<br/>*Well-designed background and neon style characters<br/>*Real Stickman and Cowboy shooting characters<br/><br/>Dodge the most dangerous opponent that you will face, BEWARE of spikes and obstacles. The strongest warriors who will survive till the last will be the winner of this game. Is it you? Let's try it*<br/>Download Now \"Stickman War Lightsaber Games\". Smash up all enemies! Ultimate Boxing and fighting challenge. Only Hardcore Challenge***<br/><br/>Have a good game!<br/><br/>Leave a review and let us know what you think about this fun game. We will use feedback In our upcoming updates! <br/><br/>If you have any queries feel free to ask! Thanks for playing<br/><br/>For more news and details:<br/>Like our page on Facebook: https://www.facebook.com/Creativedistrixgames<br/>Follow us on Twitter: https://twitter.com/CreativeDistrix", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-07-29T22:03:26", "background_image": "https://media.rawg.io/media/screenshots/d36/d36c3525c2c52ee8cc96d8f2f09ecd49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 71, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hamza Awais"], "genres": ["Action", "Sports"], "publishers": ["Hamza Awais"], "esrb_rating": null}