{"id": 774716, "slug": "faulty-apprentice-best-elf", "name": "Faulty Apprentice: Best Elf", "name_original": "Faulty Apprentice: Best Elf", "description": "Best Elf is a lighthearted dating sim that features hand-painted reward illustrations with Live2d animations, and high-quality voice acting.<h3>FEATURES</h3><br/><ul><li>Animated illustration event CG's!<br/></li><li>Multiple endings with different routes!<br/></li><li>Harem ending!<br/></li><li>Fully voiced! A talented cast of English voice actresses!<br/></li><li>Gallery Mode! Enjoy the art you've unlocked at any time!<br/></li><li>Set in the world of Faulty Apprentice.</li></ul><h3>CHARACTER</h3><br/><br/><strong>Eleanna</strong><br/>A haughty elf and Archery Instructor at Stars Reach Castle. <br/>When she's not berating you for checking out her butt, she enjoys long walks in the Hidden Forest and feasting on vegetarian delights. <br/><br/><br/><strong>Zariinna</strong><br/>A devious dark elf trying to find her place in the kingdom of Thaelyn. <br/>When she is not picking pockets or delving into dark magic, she enjoys solving riddles and testing her limits with spicy foods.<h3>STORY</h3><br/>Since the battle, Stars Reach Castle has been peaceful and light. However, for a certain two elves, things haven't been going quite right... Is it the result of a contest with tunics most wet, or perhaps two personalities that conflict and don't set, a feud has erupted between two elves that just met.<br/>From training proclivity to fun time activity, no matter the task, no matter the reason, these girls have not limit, well except maybe treason. Has Eleanna's want to be the best gone from desire to obsessed? Or have Zariinna's reprisals gone from taunts to torments? This rivalry is sure to get worse before it relents, and soon comes the time to give your two cents.<br/><br/><strong>As Champion of Stars Reach, strong-bodied and good health, do you have what it takes to determine who is best elf?</strong><br/><br/>The timeline of Faulty Apprentice: Best Elf takes place according to the <strong>true good ending</strong> of Faulty Apprentice. It is a standalone visual novel.<h3>JOIN THE COMMUNITY</h3>Join the conversation here or Faulty Apprentice official Discord Server, and let the AGL studios team know what you think of the game. We read all of the player's feedback!", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-25T04:21:58", "background_image": "https://media.rawg.io/media/screenshots/85f/85f4e9a023d2a3b107833e46023c2027.jpg", "website": "http://www.aglstudioart.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AGL Studios"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["AGL studios"], "esrb_rating": null}