{"id": 774748, "slug": "pop-icon-clashes", "name": "POP ICON CLASHES", "name_original": "POP ICON CLASHES", "description": "CCF Presents POP ICON CLASHES<br/><br/> <br/><br/>POP ICON CLASHES is where, politicians, pundits, lobbyists, journalist, celebrities; real and self-declared; routinely battle it out, in a covert, underground, Washington, DC, to obtain positions of power and become The Champion. <br/><br/> <br/><br/>Play with your friends as you fight in unique locations that will test your grit.  Find peace and calm and then rank yourself on the Agrometer. Let no one stand in your way to bridge the gap between peace and harmony in matches featuring Mixed Martial Arts, Boxing, Wrestling, and basic Street Brawls; where bloody fists and bruised knuckles are the weapons of preference.<br/><br/> <br/><br/>Jump into the action as you select your Champion to win the day. Spread your reign of control with Multiplayer where you to battle it out with your friends in unique locations that will test your grit. <br/><br/> <br/><br/>- Classic joystick controls put you in complete charge of the fighting action. <br/><br/>- Training room, Campaign mode, and Multi Player modes<br/><br/>- Regular, Focused, Special, and Ultra attacks for each character<br/><br/>- Share your progress with friends on social media<br/><br/>- Earn in game currency to purchase favor and merchandise<br/><br/>- More characters to appear soon", "metacritic": null, "released": "2020-10-25", "tba": false, "updated": "2022-04-25T04:54:42", "background_image": "https://media.rawg.io/media/screenshots/0b8/0b8fb0cfec41d1beb5a9c60b319fc1b5_KQXQItX.jpg", "website": "http://www.capitolcagefight.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ransom Notice"], "genres": ["Action", "Sports"], "publishers": ["Ransom Notice"], "esrb_rating": "Everyone 10+"}