{"id": 774771, "slug": "idle-ant-colony-sim-game", "name": "Idle Ant Colony - Sim Game", "name_original": "Idle Ant Colony - Sim Game", "description": "This little idle tycoon game is all about building your own anthill and creating new colonies in different territories. Provide for your ant queen, hatch thousands of workers and establish ant trails to gather food and resources to further your idle ant colony!<br/><br/>- Upgrade your throne room to hatch more ants <br/><br/>- Create and improve ant trails to transport resources<br/><br/>- Trench chambers in your anthill to make room for more ants<br/><br/>- Research new technology and recipes to advance your colony<br/><br/>- Conquer new continents to establish more colonies<br/><br/>- Collect special manager ants to boost your productivity<br/><br/>- Manage your storage and improve your production line<br/><br/>- Unlock achievements to increase your rewards and output<br/><br/>Join the idle ant colony to build the largest ant colony on earth. Play slow and max out your first anthill before you unlock the next continent or rush the first colony to gain great variety faster. Install idle ant colony now to see what's coming in the near future as the game is still in development and will be updated regularly with new features and content. <br/><br/>This is an idle clicker or incremental game which means you will generate ants and research points even when you are not actively playing. <br/><br/>Thank you to all testers and to all people who sent us their feedback! We couldn’t do it without you.<br/><br/>Got a problem in the app? Send us a ticket by going to the settings, tap the “FAQ &amp; Support”- button, tap the blue question mark and enter your info. Or send us an email to support@blingblinggames.com! <br/><br/>Feel free to send any feedback to feedback@blingblinggames.com!<br/><br/>JOIN OUR COMMUNITY<br/><br/>https://www.facebook.com/BlingBlingGames/ <br/>https://www.instagram.com/bbgants/ <br/>https://discord.gg/ZMfuBM5sRa <br/><br/>INFO<br/><br/>This game can partially be played offline. An internet connection is needed to play events, claim rewards and connect your Game Center account for achievements and leaderboards. <br/><br/>This mobile game is completely free to play. Some in-game items can be purchased for real money. If you wish to disable this feature of the app, please turn off the in-app purchases in your phone or tablet's Settings. This app includes non-forced in-game advertising. <br/><br/>Privacy Policy<br/>https://idleantcolony.com/privacy.html", "metacritic": null, "released": "2022-04-19", "tba": false, "updated": "2022-04-25T05:16:47", "background_image": "https://media.rawg.io/media/screenshots/78e/78e81ec96076fd53522aa05e67fdf722_EBQ6Ibc.jpg", "website": "https://idleantcolony.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bling Bling Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Bling Bling Games"], "esrb_rating": "Everyone 10+"}