{"id": 774744, "slug": "akindo", "name": "Akindo", "name_original": "Akindo", "description": "This is a real-time battle RPG focused around themes of \"reconstruction and development\" in a comical and fun pixel-art world. Explore a deteriorating island, gather materials, invest in industrial facilities, and build roads to revitalize the economy.<br/><br/>◆ Real-time battle that you can enjoy with easy controls!<br/>Just trace the map with your finger and specify the route you want to explore, and the game will move and fight automatically.<br/>If you are at a disadvantage in battle, activate the skills of your escort characters.<br/>You can also damage enemies with the coin gun, which can only be used by the main character, the merchant.<br/><br/>◆Gather materials through exploration to develop the island!<br/>You can get materials and gold by exploring each area and defeating enemies. Invest the gold you get in industrial facilities to develop the island's economy or craft materials to create equipment for your companions.<br/><br/>◆Invest in industrial facilities and build roads to encourage distribution! <br/>By building industrial facilities and roads with the materials and gold you acquire, the island's economy will be revitalized and the island's population will increase. By liberating the island within the amount of days set by the merchant guild, you will be able to explore new islands.<br/><br/>◆ Boost your escorts!<br/>During battle, the player themselves has no means of attack. Your companions will automatically fight for you. There are various types of guards, so you can organize your party according to the route you choose to explore. You can even enhance the rarity of your guards by leveling them up or synthesizing them.", "metacritic": null, "released": "2022-04-10", "tba": false, "updated": "2023-11-26T20:01:43", "background_image": "https://media.rawg.io/media/screenshots/ff4/ff48f9bbbbe4a106a3813cefc07c7729_z9Dierj.jpg", "website": "https://smp-akindo.web.app/", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Zoo"], "genres": ["RPG", "Simulation"], "publishers": ["Zoo"], "esrb_rating": "Teen"}