{"id": 774755, "slug": "gt-car-driving-racing-games-3d", "name": "GT Car Driving Racing Games 3D", "name_original": "GT Car Driving Racing Games 3D", "description": "Get behind extreme drifting Real Super Car Driving:Racing Simulator games and let's begin to amazing racing Adventure.  We would like to introduce extreme car stunt racing Ramp for all speed stunts hero and impossible car stuntman. Forget all racing Car Simulator, just boost up your city GT car speed and get a chance to become a professional driver.  Feed your passion of speed car parking and racing adventure. This Extreme car GT Racing Stunts simulator on impossible race tracks is going to be an amazing experience.<br/><br/>Real super Car driving racing Simulator 3D introduces Ultimate endless racing for all street racer. Burn the asphalt on city track in Racing with Highway Car &amp; Top Racer of sports cars with high speed engine &amp; furious racing car tracks. Race, Break and start high speed testing derby demolition Challenge to meet incidente stradale crash car engine.  Don't miss the chance to crash furious racer and stunt car city traffic rally driver on crazy speed in street racing game. Feel the real Motorcycle accident in extreme destruction derby csr racing and accept Car flip Derby racing challenge. <br/><br/>Real extreme racing car drifting has started now, select your new 3d racing car and Get started with an endless racing fever. This challenging car game mode will offer you to choose your best racing car and get ready for the race in a stunning 3d Racing Environment. This Ultimate car racing game makes you a top Gear driver in the car racing world. If you have a thrill of new offline car racing games and are still handy at car driving games, try this racing car game and dive into the fun of new car games challenges.<br/><br/>Features:<br/><br/>1=High Speed driving challenge<br/>2=Car Crash Engine Simulator<br/>3=Turbo Driving Racing<br/>4=Endless arcade racing<br/>5=Amazing Endless gt car drive<br/>6=Endless Race cars driving games<br/>7=Extreme Gt car racing game", "metacritic": null, "released": "2022-03-05", "tba": false, "updated": "2022-04-25T05:03:05", "background_image": "https://media.rawg.io/media/screenshots/e63/e63d455c7acc8dd962e59179fbded7f8_KsOAyrz.jpg", "website": "https://mobilegames.monster", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hoang Thi Tai"], "genres": ["Sports", "Racing"], "publishers": ["Hoang Thi Tai"], "esrb_rating": "Everyone 10+"}