{"id": 77513, "slug": "would-i-rather-adult-games", "name": "Would I Rather - Adult Games", "name_original": "Would I Rather - Adult Games", "description": "The #1 Dirtiest Would You Rather for Adults !<br/><br/>Are you ready to play our would you rather dirty game?<br/><br/>This version of the classic would you rather game is so kinky, only the most adventurous ones will dare to explore our naughty, kinky, funny and surprising questions!<br/><br/>This dirty would you rather game will keep you, and whoever is joining the party, entertained for sure!<br/><br/>What are you waiting for? Give our would you rather game a shot now!<br/><br/>Pro membership offers a paid monthly subscription after 3 day free trial. Membership unlocks all decks and removes all ads while you are an active subscriber. After free trial ends,  subscription converts and payment will be charged to iTunes Account. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. To read more about our terms of service and privacy policy, please visit: wouldyouratherdirty.com/legal.html", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-10-22T14:23:15", "background_image": "https://media.rawg.io/media/screenshots/6b1/6b1caa939fadfce8ae7c8723bd6c3f9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alex Lucas Consel"], "genres": [], "publishers": ["Alex Lucas Consel"], "esrb_rating": "Mature"}