{"id": 7752, "slug": "robbie-williams-racing", "name": "Robbie Williams Racing", "name_original": "Robbie Williams Racing", "description": "Join Robbie Williams on a wild ride while listening to music from his new album, “Reality Killed The Video Star”. Race against Robbie across the Mojave Desert on a classic motorcycle as seen in the recent “Bodies” video, or race in a buggy on a course modeled on Robbie&amp;#39;s own private track!<br/><br/>Unlock videos, photos and more as you ride in ROBBIE WILLIAMS RACING, bringing the world renowned singer and entertainer closer to home than ever before in this, his first ever interactive game!<br/><br/>Game Features:<br/><br/>- Enjoy in-game versions of “Bodies” and “Difficult For Weirdos”<br/><br/>- Unlock up to 9 special remixes of “Bodies” throughout the game!<br/><br/>- Unlock behind-the-scenes videos and photos of Robbie by tackling the treasure hunt!<br/><br/>- Exclusive commentary by Robbie Williams guides you all the way to the finish line!<br/><br/>- Race on the beautifully-crafted Mojave Desert course or on a buggy track based on Robbie’s real track from his own backyard!<br/><br/>- Enjoy several racing options—choose vehicles, tracks, lengths, and more!<br/><br/>- Purchase Robbie’s new album using a direct link to the iTunes store<br/><br/>- Earn the fastest lap times and rule the Leaderboards!<br/><br/>- Support for Facebook Connect<br/><br/>------------------------------<br/><br/>We welcome you to help us improve the application by sending us feedback, please direct comments to cs@botme.com and we’ll check it out. Thank you! <br/><br/><br/>Try other exciting games by ALife: Adult Swim&amp;#39;s Amateur Surgeon, Amateur Surgeon Christmas Edition, Five Minutes to Kill (Yourself) &amp;amp; Meowcenaries, BMW Sauber F1 Team Racing 09, BMW Z4 Experience, iDroidsMania, iSink U, iSoccer Backstreet®, Linkin Park 8-Bit Rebellion!, PANDORUM, Red Bull Air Race World Championship, Red Bull Racing Challenge, Spartacus: Blood and Sand and VERMINATOR®<br/><br/>Follow us on Twitter for the latest news: http://twitter.com/alifegames<br/><br/>Join us on Facebook: http://www.botme.com/ref/alife-fb<br/><br/>Check out our videos: http://www.youtube.com/user/alifegames", "metacritic": null, "released": "2009-11-27", "tba": false, "updated": "2019-10-22T14:29:31", "background_image": "https://media.rawg.io/media/screenshots/7e0/7e0c79c687add7d813b50d15c1bbc58a.jpeg", "website": "http://www.artificial-life.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Artificial Life"], "genres": ["Racing"], "publishers": ["Artificial Life"], "esrb_rating": "Teen"}