{"id": 775249, "slug": "picocross-joseph", "name": "PicoCross (Joseph)", "name_original": "PicoCross (Joseph)", "description": "Controls\r\n<p>Arrow keys - Move selector up / down / left / right.</p>\n<p>x - Select</p>\n<p>z - Back / Return to level select</p>\r\nHow to play\r\n<p>A nonogram is a cell based picture puzzle, where you must find all of the shaded cells. If you find all of the shaded cells then you will reveal the hidden picture!</p>\n<p>The numbers above and to the left of the grid describe the number of consecutive shaded cells in the row or column. For example, if we imagine a 10x10 grid and we have a ( 10 ) above the first column, then we know that all ten cells are shaded for that column. If in the first row we have the clue ( 5  4 ) this tells us that there are five shaded cells, a gap of at least one non shaded cell, and then four shaded cells.</p>\n\n<p>See below for a small example on a 6x6 grid. We see that the shaded cells reveal a smiley face!</p>\n\n<p>If the above is unclear please leave feedback! </p>\r\nBackground\r\n<p>PicoCross took most of a week to create. I have had experience creating projects in Unity before, but this was my first attempt at something for the Pico 8. I am very happy with how this turned out and would love to receive some feedback, even if critical.</p>\n<p>This was my first attempt at creating music and sound effects for a game and I am quite happy with the result. It took a good part of a day to get the music right. It is simple, but a jam!</p><p>Recently I have gotten into the handheld emulator community and really enjoyed playing Picross on the original GameBoy. It was really fun making an inspired game for the Pico.<br/></p>\r\nCredits\r\n<p>Made by Joseph.</p>\n<p>@JosephMakesGame</p>", "metacritic": null, "released": "2022-04-24", "tba": false, "updated": "2022-04-25T08:36:16", "background_image": "https://media.rawg.io/media/screenshots/a9e/a9e075b51195756b3db705aa8e7bdf54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Joseph"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}