{"id": 77536, "slug": "out-of-body", "name": "Out of Body", "name_original": "Out of Body", "description": "Souls are on the loose! They need your help in guiding them higher and higher towards the heavens in this terrifically twisted and exciting endless adventure!<br/><br/>Being dead sure isn’t easy. These poor souls have to navigate tricky environments in order to spirit away. Help them evade obstacles (these souls don’t like bonking their heads on things any more than living people do!) and collect precious gems; use these gems to unlock new worlds and explore amazing new stories. <br/><br/>Each character has his or her own soulful story to tell. Embark on an endless adventure with them to learn more about each one. Find out why they’re floating away as souls and help them on a truly ethereal journey like no other!<br/><br/>Halloween is also just around the corner. Enjoy some truly spooktastic levels of endless adventures that are full of devious tricks and valuable treats. Have you got what it takes?<br/><br/>Frighteningly Fun Features:<br/>•        7 wicked worlds for<br/>•        7 colorful characters with<br/>•        7 special stories<br/>•        Compete with friends to see who can float towards a best score that’s truly out of this world<br/>•        Ghoulish and gorgeous graphics<br/>•        Special Halloween themed levels just in time for the scariest day of the year!<br/>•        Endless adventure fun!<br/><br/>** Please note that while the app is free, please be aware that it contains paid content for real money that can be purchased upon users' wish to enhance their gaming experience. **", "metacritic": null, "released": "2015-10-28", "tba": false, "updated": "2019-10-22T14:23:15", "background_image": "https://media.rawg.io/media/screenshots/2c5/2c5bc6f82fdd7465644aa2e474223767.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Animoca Brands"], "genres": ["Arcade"], "publishers": ["Animoca Brands"], "esrb_rating": null}