{"id": 775481, "slug": "wizard-pong-numberkay", "name": "Wizard Pong (numberkay)", "name_original": "Wizard Pong (numberkay)", "description": "<p>Here are thine instructions. Attend them well, for with each of thy victories, the pace of the contest shall increase, and more magical abilities shall become available.<br/></p>\n<p>Place thy left hand on the \"home row.\"</p>\n<p>Press [Enter] to pause and resume the contest.</p>\n<p>During a contest, the [left] and [right] arrow keys position thy hand, to cast or block spells.</p>\n<p>\n</p>\n<p>[F] summons a magical fireball, which shall fly from thy hand.</p>\n<p>[S] turns thy hand into a magical shield, able to swat away any attack.</p>\n<p>[H] heals damage done to thy health.</p>\n<p>Once unlocked:<br/></p>\n<p>\n</p>\n<p>[D] drains the reservoir of thine enemy's magical power, drawing it back unto thyself.</p>\n<p>[A] summons magical armor to surround thee, which shall diminish the effects of all magic sent thy way.</p>\n<p>[W] sends forth a large drop of water from thy hand, which puts out fires and can be a useful distraction.</p>\n<p>[E] propels a knife at thine enemy, doing terrible damage, provided it encounters no resistance.</p>\n<p>[Q] shall prepare thy next spell to travel more quickly and do increased damage. However, beware that such a spell will require extra magical energy to cast. Cancel this preparation by pressing [Q] again.</p>\n<p>[R], once unlocked, shall cast the most powerful spell known in this court. A freezing crystal of ice shall fly at thine enemy, which not only drains their health and magic but will freeze that wizard solid. Legend also tells us, the crystal's speed and potency can be altered using other spells...                \r\n</p>\n\n<p>Stone floor image: Black stone wall (flash) by Iwan Gabovitch, used with minor alterations<br/> Parchment image by pieceofeightdotcom<br/> Both are licensed under Creative Commons</p>", "metacritic": null, "released": "2022-04-23", "tba": false, "updated": "2022-04-25T10:07:57", "background_image": "https://media.rawg.io/media/screenshots/d51/d519deb60ae4326a45328a0f8442af15.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["numberkay"], "genres": ["Action"], "publishers": [], "esrb_rating": null}