{"id": 775622, "slug": "dead-forest-itch-games-manul", "name": "Dead Forest (itch) (Games Manul)", "name_original": "Dead Forest (itch) (Games Manul)", "description": "<p> In search of a single answer to one question that has long tormented him, the cursed animal Laki approaches the mysterious dark wood called the Dead Forest. But he will not manage to travel alone - Laki encounters Claude, a spider who is odd just like he is. What will Laki discover about his companion and about himself? What do the ancient ruins hide? Will he be able to find the right path among the tangled trails of the Dead Forest, where such a path is easy to miss?<br/></p>\n\n\n<p>A curious lynx who, by the will of fate, is drawn to the Dead Forest. He needs to find a magical spring to get rid of his curse, but more than one obstacle will appear in his way.</p>\n<p>A lone spider, Laki's first guide along the gloomy roads of the Dead Forest. He volunteers to help and shows Laki the way, but what is he really after?</p>\n<p>A smug and haughty shaman who died in the distant past. Laki is able to overcome the shackles of time, but will he be able to save Ramiro from a death foretold?</p>\n<p>A wayward and clumsy red panda who wants to bring Yong Hen's memories back. What connects him with the cemetery and what are his true intentions?</p>\n<p>A mysterious spirit with no memory of his own past that lives near the cemetery. What secrets does he hide behind the ghostly shell of his curse?</p>", "metacritic": null, "released": "2022-04-23", "tba": false, "updated": "2022-04-25T11:03:35", "background_image": "https://media.rawg.io/media/screenshots/6ed/6ed470ce7a7be01ace8532970fd54ccc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Games Manul"], "genres": [], "publishers": [], "esrb_rating": null}