{"id": 77564, "slug": "fixies-tamagochi-kids-games-puzzles-cartoons", "name": "Fixies Tamagochi - Kids Games, Puzzles & Cartoons", "name_original": "Fixies Tamagochi - Kids Games, Puzzles & Cartoons", "description": "Fixies Tamagotchi is your virtual companion. In this funny game you will care for your favorite Fixies. Play the new Fiksiki - Kids Games, Puzzles, Match three (three in row) and watch all series of the cartoon!<br/><br/>Nolik, Simka, Fire, Verda, Toola and Digit is awaiting you in all-new game for kids from 3 years old. Choose your favorite character and unveil the entire world of Fixies full of funny games with all cartoon series!<br/><br/>This game appeals to children of all age: fancy graphics, various gameplay and simple control - all these are welcome you in it. If you like Masha and the Bear cartoon and games, you fall in love with Fixies, so you fix all the things around.<br/><br/>ALL FIXIES<br/>Who you like most? Beautiful Verda or uncatchable Fire? Unlock all characters to play your favourite one!<br/><br/>6 MINI-GAMES<br/>Free kids games: here you can play match three (three in row), find a pair, jigsaw puzzles and ride a flyboard!<br/><br/>CARE FOR FIXIES<br/>The most important thing for Fixies is obviously fixes! And of course after fixing something they will need you to care for them. Your companions need to be washed and dried-up, and then they’ll need your help to clean-up the room!<br/><br/>ALL CARTOON SERIES<br/>Unlock cartoon series together with Fixies in the game, so watch videos in a single app! This is the best activity for you when Fixies goes for fixing. If you like cartoon Masha and the Bear, you definitely like the Fixies!<br/><br/>= = = = = = =<br/>The app is free to download and use. We also offer in app purchases and a subscription package.<br/><br/>Subscription service conditions:<br/>The cost of the subscription is £0.79 for 1 month (includes 1 week free trial-period), the cost of the subscription is £2.49 for 3 months, £4.49 for 6 months, £7.99 for 12 months (has no free trial-period) or equivalent summ in your national currency.<br/><br/>Payment will be charged to your iTunes Account at confirmation of purchase. Your subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/><br/>Your account will be charged for renewal within 24-hours prior to the end of the current period. You can manage your subscription and switch off in iTunes account settings on your device.<br/><br/>For Terms and Conditions, and Privacy Policy you can visit http://indigokidsgames.com/privacy-policy/?lang=en and we always appreciate your feedback - just send us a message to support@indigokidsgames.com<br/><br/>If you have any suggestions about the game Fixies Tamagotchi, you can freely contact us via form on our site<br/>http://indigokidsgames.com<br/><br/>Subscribe to our Vkontakte and Facebook pages to stay tuned with latest news:<br/>https://vk.com/indigokidsru<br/>https://www.facebook.com/IndigoKidsRu", "metacritic": null, "released": "2016-12-16", "tba": false, "updated": "2019-10-22T14:23:16", "background_image": "https://media.rawg.io/media/screenshots/904/904ceec594e565ced913165c4db88530_nkLiwE0.jpg", "website": "http://indigokidsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Indigo Kids"], "genres": ["RPG", "Family"], "publishers": ["INDIGO KIDS"], "esrb_rating": "Everyone 10+"}