{"id": 77582, "slug": "after-the-end-forsaken-destiny-2", "name": "After the End Forsaken Destiny", "name_original": "After the End Forsaken Destiny", "description": "Get ready to flex your mental muscles and be wow’ed in After The End: Forsaken Destiny.<br/><br/>Solve stunning 3d puzzles of ever-increasing difficulty; discover a breathtaking, ancient world ready to be unearthed; and finally, unravel the mystery behind a father-son duo journey - on parallel paths, separated by time. <br/><br/>Begin the Journey and find what comes After The End!<br/><br/>Solve Dynamic Puzzles<br/>Master a variety of complex puzzles that surround you! Turn hidden levers and press secret switches to create new pathways.<br/><br/>Explore Ancient Lands<br/>Manipulate a world, waiting to be discovered. Find new possibilities with the swipe of a finger and help guide each character through ever-evolving landscapes.<br/><br/>Discover Timeworn Marvels<br/>Traverse across sun-swept landscapes and explore massive ruins, dark temples and more!<br/> <br/>Collect Relics of the Past<br/>Gather ancient stone fragments scattered along your journey to rebuild statues honoring your ancestors.<br/><br/>Embark on a Mysterious Journey<br/>Experience the parallel journeys of a father and son, separate but intertwined. See whether they will ever be reconnected in the end.<br/><br/>For optimal gaming experience, we recommended the following:<br/><br/>Devices<br/>iPhone 6 or later, iPad Air2 or later, iPad mini 4 or later, 6th Generation iPod touch or later.<br/><br/>Operating System:<br/>iOS 9.4 or later<br/><br/>Game requires a Wifi connection to download", "metacritic": null, "released": "2017-03-01", "tba": false, "updated": "2019-07-29T22:41:55", "background_image": "https://media.rawg.io/media/screenshots/484/484b57f9e6bb9205c3222a113cedc3f2.jpg", "website": "http://nexonm.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NEXON M"], "genres": ["Adventure", "Puzzle"], "publishers": ["NEXON M"], "esrb_rating": null}