{"id": 775858, "slug": "epic-ping-pong", "name": "Epic Ping Pong", "name_original": "Epic Ping Pong", "description": "<p>Demo Link: https://youtu.be/6fzIQIo830w</p>\n<p><strong>*Play in full screen*</strong></p>\n<p><strong>Local Two Player! Grab a friend :)<br/></strong></p>\n<p>DISCLAIMER: I personally could not make the webGL, I had to get a classmate to do so due to the vast amount of errors while trying to build it. So I could not make any adjustments to the game after getting the build. Unfortunately, WebGL likes to slow things down when built so the ball for the web version moves pretty slow. I had to add the webGL to itch.io but please don't play it  The downloadable files are below. Thanks. </p>\n<p>For my project, I chose a very well known classic video game that's fun for everyone. Ping pong has been around for years and I wanted to make my own 3D version of it. You have the classic overheard view of an original pong table and you along wit a friend can battle it out in game. I chose the game to be 2 players because I wanted to make a game that is playable with friends, something to enjoy together and something to even fight over :)  As you can probably gather, my game play goal is competition. I achieved it with the 2 player system.  </p>\n<p>The workload for this game was semi-intense. Making the UI was pretty simple because I learned that from class but when it came to the scripts, I needed to do extra research which caused for very long work sessions. </p>\n<p>I am the only person that worked on this project, the only thing I took from CSI4380 was the textures from the 3D solar system assignment.</p>", "metacritic": null, "released": "2022-04-23", "tba": false, "updated": "2022-04-25T12:36:56", "background_image": "https://media.rawg.io/media/screenshots/dd8/dd891c2fb02e3b64329d5b87087d192c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["mhaggen"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}