{"id": 775804, "slug": "pilot-pesawat-simulator", "name": "Pilot Pesawat Simulator", "name_original": "Pilot Pesawat Simulator", "description": "<p>Perkenalkan simulator penerbangan generasi terbaru. Lepas landas, terbang ke bandara di kota sekitar &amp; mendarat. Bangun &amp; kelola armada pesawat. Dan ini hanya sedikit dari yang ditawarkan Airline Commander, sebuah game pesawat realistis!<br/><br/>Fitur terbang:<br/>✈ Puluhan jenis pesawat: turbin, reaksi, dek tunggal atau dek ganda.<br/>✈ Puluhan hub utama dengan taxiway untuk membuka ribuan rute ke semua bandara utama dunia.<br/>✈ Ratusan bandara dan landas pacu realistis. Citra satelit HD, peta, dan navigasi skala dunia untuk setiap wilayah &amp; bandara.<br/>✈ Ribuan situasi untuk dihadapi.<br/>✈ Lalu-lintas pesawat real time, dengan maskapai sungguhan, di darat dan udara.<br/>✈ Sistem penerbangan sederhana dengan bantuan navigasi atau simulasi penerbangan untuk pemain tingkat lanjut.<br/>✈ Prosedur takeoff dan pendaratan SID/STAR yang realistis dengan sistem pushback, taxi, dan kemampuan docking.<br/>✈ Mode kompetisi untuk membuktikan kamu adalah pilot terbaik.<br/>✈ Waktu harian realistis dengan matahari, bulan, bintang dan kondisi cuaca real time.<br/>✈ Livery airline yang dapat dimodifikasi.<br/><br/>Waktunya lepas landas!<br/>Di simulator penerbangan ini, kamu mulai sebagai pilot baru yang harus belajar menerbangkan pesawat besar. Ikuti petunjuk pilot senior, lepas landas dari bandara, pahami semua kontrol di kokpit &amp; lakukan pendaratan yang aman. Dapatkan lisensi pilot &amp; mulai bangun maskapaimu di game pesawat realistis ini!<br/><br/>Kembangkan armadamu<br/>Menangkan kontrak baru &amp; terbang dengan cuaca yang realistis dengan lalu-lintas real time &amp; hasilkan uang untuk membesarkan armada. Beli pesawat baru. Pesawat yang lebih besar. Pilih rute penerbangan baru, tingkatkan keahlian &amp; dapatkan lisensi pilot baru. Makin banyak terbang di simulator ini, makin banyak pilihanmu untuk mengembangkan armada.<br/><br/>Ada masalah apa di pesawat ini?<br/>Karena Airline Commander adalah game simulator pesawat realistis, semua hal bisa menjadi masalah. Kegagalan sensor, instrumen, ASM, tangki bahan bakar, roda pesawat &amp; mesin. Gagal fungsi flap, rudder, rem angin &amp; radar. Belum lagi angin, turbulensi &amp; kabut dengan berbagai tingkat keparahan. Ini adalah impian setiap penggemar game simulator penerbangan yang mencari pengalaman realistis dan imersif.<br/><br/>Sistem penerbangan sederhana<br/>Belum siap untuk pengalaman simulator pesawat yang sesungguhnya? Game pesawat tidak harus susah dikendalikan. Pilih sistem penerbangan sederhana dan biasakan dirimu dengan menjalani lepas landas &amp; pendaratan. Tidak semua pilot harus bisa mendaratkan pesawat tempur di kapal induk, jadi biasakan dulu menggunakan simulator penerbangan yang dimudahkan.<br/><br/>Modifikasi pesawatmu<br/>Game dalam genre simulator penerbangan biasanya memungkinkan modifikasi berbagai pesawat, dan begitu juga Airline Commander! Ganti livery setiap pesawat di armadamu dan nikmati tampilannya dalam grafis 3D yang indah.<br/><br/>Airline Commander - simulator penerbangan yang benar-benar berbeda<br/>Game terbaru dari para pembuat RFS – Real Flight Simulator menghadirkan realisme yang lebih dari game simulator penerbangan biasa. Baik bagi pilot berpengalaman atau pengguna yang belum pernah memainkan simulator penerbangan, Airline Commander memberi pengalaman sensasi terbang yang sungguh berbeda. Unduh sekarang &amp; kendalikan pesawatmu dalam game sangat realistis ini.<br/><br/>Dukungan:<br/>Untuk masalah dalam game dan saran, silakan mengirim email ke: mxdevelopmentinc@gmail.com</p>", "metacritic": null, "released": "2022-04-23", "tba": false, "updated": "2022-04-25T12:15:52", "background_image": "https://media.rawg.io/media/screenshots/78c/78c07de29c3b6582a71ead3e9aeaf82b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MX Development.Inc"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}