{"id": 775925, "slug": "immune-basiliskonline", "name": "Immune (BasiliskOnline)", "name_original": "Immune (BasiliskOnline)", "description": "<p><em>You are a survivor of the zombie plague that broke the world, you are Immune. You, side-by-side with other Immune, are the last hope humanity has to survive. You protect your settlements, scavenge in the wasteland for supplies and strike at the zombies that consumed your world in hopes of a better tomorrow.</em>\n</p>\n<p><strong>IMMUNE</strong> is a fast-paced, high-action zombie-splatter role playing game inspired by video games like Left 4 Dead and board games like Zombicide. <br/></p>\n<p>The Immune that stand between the dead and the living brave the wasteland for a variety of reasons, but almost all of them involve keeping people safe and getting your settlement what it needs.</p>\n<p>Characters are empowered by their weapons, each weapon choice provides Maneuvers which allow you to dispatch walkers with ease and/or drive high damage against the special infected that stalk the wasteland, and is the primary form of \"class\" assembling a loadout of 3 items allows you to customize your character in a variety of ways.</p>\n<p><strong>IMMUNE</strong> is intentionally left short, at 4 pages the game is fully playable with customizable characters, a wide range of mission suggestions, rules for managing individual walkers, different size hordes, 6 special infected and 1 boss zombie, the Wormhost.<br/></p>\n<p>The game will receive a wide range of similarly sized modules that will provide <em>options</em> to expand your game, allowing you to easily pick and choose what features go into your Immune campaign, if you choose to move beyond the base game at all.</p>\r\nCost Break Down\r\n<p>The following indicates the amount I'll need to make to recoup costs of the labor of myself and my partner at moderate pay rates<em>. </em></p>\n<ul><li><strong>Writing @ 3500 Words at $0.15/word:</strong> $525</li><li><strong>Editing @ 2265 Words at $0.10/word:</strong> $227</li><li><strong>Layout @ 7 pages at $10/page:</strong> $70</li><li><strong>Art @ Photomanipulation and curation:</strong> $100</li></ul>\n<p><strong>Total:</strong> $922<br/></p>\r\nCommunity Copies are available!\r\n<ul><li>Launch with 25 Community Copies.\r\n</li><li>Every <strong>Sale</strong> is +1 Community Copy.\r\n</li><li>Every <strong>Rating</strong> is +1 Community Copy.<ul><li>If you plan to leave a less than 4-star rating, please leave a review on what you think could improve it.\r\n</li><li>Please do not leave a bad rating if you don't like the Lumen system, post apocalyptic settings, zombie apocalypse, or any other working as intended features, just because they are not to your preference.\r\n</li></ul>\n</li></ul>", "metacritic": null, "released": "2022-04-22", "tba": false, "updated": "2022-04-25T13:03:47", "background_image": "https://media.rawg.io/media/screenshots/bbf/bbf856ebf96b919c8c2b626b4478c5b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BasiliskOnline"], "genres": [], "publishers": [], "esrb_rating": null}