{"id": 775917, "slug": "boing-jyrosensation", "name": "BOiNG! (JyroSensation)", "name_original": "BOiNG! (JyroSensation)", "description": "<p><strong>Credits</strong></p>\n<p><strong>Boing! was originally released in 1983 for the Atari 2600 by First Star Software. It was developed by Alex Leavens and Shirley A. Russell. All work, property, and credit belongs to them. This Game Boy port was developed in GB Studio 3.0.3 created by Chris Maltby.</strong></p>\n<p><strong>System</strong></p>\n<p>Controls</p>\n<p>Boing! includes a 1-player and 2-player game. The D-PAD moves BUBBLE in four directions: up, down, right and left. The BUBBLE cannot move diagonally.  When the BUBBLE reaches the edge of the playfield, it can go no further. You can move one step at a time by tapping the D-PAD.</p>\n\n<p><strong><em>PLAYER 1                                                  PLAYER   2 </em></strong></p>\n\n<p><strong><em>UP</em></strong> = ARROW UP                                <strong><em>UP</em></strong>= W</p>\n<p><strong><em>DOWN</em></strong> = ARROW DOWN            <strong><em>DOWN</em></strong>= S</p>\n<p><strong><em>LEFT</em></strong>= ARROW LEFT                        <strong><em>LEFT</em></strong>= A</p>\n<p><strong><em>RIGHT</em></strong> = ARROW RIGHT               <strong><em>RIGHT</em></strong>= D</p>\n<p><strong><em>A</em></strong>= Z</p>\n<p><strong><em>B</em></strong>= X</p>\n<p><strong><em>START</em></strong>= ENTER</p>\n<p><strong><em>SELECT</em></strong>= SELECT</p>\n\n\n<p><strong>The Game</strong></p>\n<p>You bounce the BUBBLE around a playfield of 36 STEPS (6 rows of 6). The BUBBLE must land on each step and turn it \"on\", sometimes in a particular order. The BUBBLE EATER or the PIN will pop the BUBBLE if either comes in contact with it. The BUBBLE EATER chases the BUBBLE, while the PIN descends the steps from the top row down. The PIN will pop the BUBBLE or the BUBBLE EATER if they are in its path.</p>\n<p>The object of the game is to jump the BUBBLE around and turn each step on. When you first begin the game a short tune will play before you can start. On some levels you must turn on a particular row or rows of steps before you can turn on steps in any other row (see LEVELS).<br/></p>\n<p>The BUBBLE EATER always start out in the lower right corner, waits a couple of seconds and then tries to catch you (the BUBBLE). If he lands on you or you land on him, you lose a BUBBLE. The PIN starts out at the top, randomly choosing one of the 6 columns. Avoid the PIN as it is a fatal to the BUBBLE! You can temporarily zap the BUBBLE EATER by luring him under the oncoming PIN. The BUBBLE EATER disintegrates and starts glowing. After a few seconds the BUBBLE EATER reappears and continues the chase. You can turn on steps while the BUBBLE EATER is out of commission. When the BUBBLE EATER is stunned and glowing, the BUBBLE can jump on him without popping.\r\n</p>\n\n<p>2-PLAYERS</p>\n<p>In 2-players, the second player takes control of the BUBBLE EATER. Chase the BUBBLE and if player 1 loses all their lives you win. The same rules and gameplay apply to both players as in 1-player (see THE GAME).</p>\n\n<p>BUBBLES\r\n</p>\n<p>You start the game with 5 BUBBLES. which are displayed at the bottom of the screen. Every time you are popped you lose a BUBBLE. If you are popped while on the lower right hand step, you will automatically be moved one step to the left to avoid being popped repeatedly.\r\n</p>\n<p>Upon losing the last BUBBLE, the game will end, bringing you to the title screen.</p>\n<p>LEVELS\r\n</p>\n<p>There are 3 game levels, numbered 1 through 3. In each level of play there are 5 waves.  If you complete all 5 waves you will advance to the next level. The new level number will be displayed briefly at the bottom of the screen and a short tune will be played.</p>\n<p>Level 1: If the BUBBLE jumps on any step is off, the step turns on. Landing on a step more than once has no effect.\r\n</p>\n<p>Level 2: Jumping on a step turns it on. However you must turn on all the steps of the indicated row before going to the next row. The indicated row is clearly marked by the white edges. You start with the bottom row and turn on all 6 steps across. Once the bottom row is complete, you must then turn on the 6 steps of the next row up. This continues all the way up to the top row.\r\n</p>\n<p>Level 3: Jumping on a step turns it on. However you must turn on the steps of all three even rows before you can turn on the steps of the 3 odd rows. The rows to turn on are clearly indicated with white.</p>\n<p> \r\n</p>\n<p><strong>Scoring</strong></p>\n<p>You score points every time you turn on a step.</p>\n<p> \r\n</p>\n<p><strong>Strategy/Tips</strong>\n</p>\n<p>The BUBBLE will move quicker if you wait until it has landed . One important feature to realize is that you may jump through the BUBBLE EATER or the PIN. If the BUBBLE is in the air the same time that the attacker is, the BUBBLE will remain intact.\r\n</p>\n<p>Watch out when you are on the top row, because the PIN starts on this row. The PIN starts randomly at any of the top 6 steps and proceed down. If you are popped on the top row, it is wise to jump off to the next row down immediately with your next BUBBLE to avoid being popped again. </p>\n<p>The PIN will pop either the BUBBLE or the BUBBLE EATER if they are in its path. Therefore, you may lure the BUBBLE EATER in front of an oncoming PIN and purposefully pop it. The BUBBLE EATER is chasing the BUBBLE, so you move the BUBBLE and watch the descending PIN, timing your actions so that the BUBBLE EATER becomes disabled. </p>\n<p>Be careful, the glowing BUBBLE EATER comes back to life without warning.</p>\n\n<p><strong>Downloading</strong></p>\n<p>As a result of complicated scripts, the game is naturally slower than normal. However, you may speed up the game when playing in a program of your choice to get the originally intended experience. </p>\n<p>When playing with the Game Boy's controls, you will have to set the movement keys to the following buttons for the 2nd player to be able to play:</p>\n<p><strong><em>A</em></strong>= LEFT</p>\n<p><strong><em>B</em></strong>= UP</p>\n<p><strong><em>START</em></strong>= DOWN</p>\n<p><strong><em>SELECT</em></strong>- RIGHT</p>", "metacritic": null, "released": "2022-04-22", "tba": false, "updated": "2022-04-25T12:59:54", "background_image": "https://media.rawg.io/media/screenshots/818/818b677212433f3a5374dd87d86480d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JyroSensation"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}