{"id": 776020, "slug": "waygate-wizard", "name": "Waygate Wizard", "name_original": "Waygate Wizard", "description": "<p><strong>Welcome to Waygate Wizard!</strong></p>\n<p><strong>Gameplay Video</strong>: https://streamable.com/4218hk</p>\n<p><strong>Controls</strong></p>\n<p>Your goal is to get to the GOLDEN KEY in each level to progress to the next stage.</p>\n<p>Use [A] and [D] to move left and right.</p>\n<p>Use [SPACE] to jump.</p>\n<p>The color of the cursor indicates which portals can be built.</p>\n<p>[LEFT CLICK] to build blue portal. </p>\n<p>[RIGHT CLICK] to build orange portal. </p>\n<p>Press [ESCAPE] to reset the scene.</p>\n<p><strong>Overview</strong></p>\n<p>The player's goal in Waygate Wizard is to find the Gold Key in each level to progress to the next. To reach the key they either have to solve platforming puzzles or portal puzzles. The portal mechanic allows players to teleport from one portal to another. Some levels contain static portals and others allow the player to cast the portals themselves. Whether or not a player can cast a portal is indicated by the color of the cursor.</p>\n<p>Another goal of the project was to get several levels playable that taught the player the basic mechanics of the game set up as micro puzzles. This would include a static camera so the  player could see everything that was in play for each level. With these basic tutorial levels completed, the next steps would include combining the mechanics in interesting ways to further challenge the player. </p>\n<p>It was my gameplay goal to create a relaxing puzzle solving platformer with a minimal graphic style. It retrospective, I would have liked for the levels to be more challenging but my main priority was getting the functional mechanics in place. </p>\n<p>Along with more challenging levels, I would also would have liked to have more feedback to the players in the form of animations, visual an audio effects. But again, the cool was to get the basic mechanics down as a proof of concept. </p>\n<p><strong>All development was done by Jesse Brown.</strong><br/></p>\n<p>- Custom Art</p>\n<p>- Custom Music</p>\n<p>- Scripting</p>\n<p>- Level Design</p>\n<p>- Modified Player Controller from CSI 4380 2D platformer project for basic player movement</p>\n<p>- Portal Mechanic inspired from several different YouTube tutorials (Channel: Jake Makes Games)</p>", "metacritic": null, "released": "2022-04-22", "tba": false, "updated": "2022-04-25T13:44:41", "background_image": "https://media.rawg.io/media/screenshots/6ca/6ca68e9308bb7083664f122a5b0e1790.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["br0uun"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}