{"id": 776066, "slug": "saghala-heroes-of-the-last-world-early-demo", "name": "Saghala: Heroes of the Last World Early DEMO", "name_original": "Saghala: Heroes of the Last World Early DEMO", "description": "<p><strong>THIS IS EARLY DEMO VERSION of Saghala. </strong></p>\n<p><strong>Soon on Kickstarter &lt;Follow Saghala&gt;!</strong></p>\n<p>Steam Product Page &lt;<strong>Here</strong>&gt;</p>\n<p><em>It's 2081. Earth is now called Saghala. </em><br/></p>\n<p><em>60 years earlier, an nuclear war decimated humanity. 5 years later (as if that were not enough...) devastating solar flares and coronal mass ejections from the Sun damaged other electronics on the then Earth. Chaos ensued... 4 facions fight for controll od Saghala and The Core...</em></p>\n\n<p>As a hero, you have to overcome all challenges (<em>and there will be many of them!</em>) and complete the main goal of the game - find and repair the world's last underground fusion reactor <strong>The Core</strong>. The road to the goal is strewn with many adversities and difficult choices. Your adventure will start in a tiny settlement somewhere in <strong>Saghala</strong>. You have to explore the continent (or rather what's left of it...), expand your own settlement, prepare your armies to fight enemies who are also looking for a reactor.</p>\n\n<p>You will encounter many other settlements, explore the ruins and undergrounds of <strong>Saghala</strong>, develop your own settlement, produce resources, craft NEW BATTLE CARDS, obtain additional equipment and artifacts, visit merchants and other in-game NPC's, complete so many side quests, fight enemies and develop your own hero! <br/><br/><br/><br/>All with a little bit of black humor ;)</p>\n<ul><li>4 factions (Brotherhood of Atom, Flaming Skull, Worshipers and Mutants)<br/>\n</li><li>4 bioms (Underground, Deadly Plants, Wasteland and Greenlands)<br/>\n</li><li>You will be able to explore inside of buildings/shelters!<br/>\n</li><li>Manage your settlement - you will be able to upgrade buildings and build new ones.<br/>\n</li><li>Collection and production - in the game you will manage 5 main resources: Coins, Food, Wood, Steel and Scrap.<br/>\n</li><li>CRAFT NEW COMBAT CARDS for your Hero!<br/>\n</li><li>Random characters, settlers, traders, bandits and more.<br/>\n</li><li>Upgrades, weapons and items to find during your adventure.<br/>\n</li><li>NPCs in the game may have a lot of side missions<br/>\n</li><li>for you to complete... with someblack humor ;)<br/>\n</li><li>Once a week your settlement may be attacked by the bandits from a Clan of Nomads.<br/>\n</li><li>The day and night system and the passing weeks.<br/>\n</li><li>Combat is built like a card game!<br/>\n</li><li>And more!\r\n</li></ul>", "metacritic": null, "released": "2022-04-21", "tba": false, "updated": "2022-04-25T14:07:50", "background_image": "https://media.rawg.io/media/screenshots/d7a/d7a4dcec130ddc4c6394c715bc858cb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["KovalGames"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}