{"id": 776279, "slug": "dash-and-slash-2", "name": "Dash And Slash", "name_original": "Dash And Slash", "description": "<strong>Slash and Dash through your enemies in this pixel-art, one-button, hack and slash! Cut through the city, break into its' core and descend to its' depths.</strong><br/><br/><h3>Game Features</h3><ul><li> <strong>Combat you pick the pace of, all controlled with a single button</strong> -  Hold down left mouse to focus, slowing down time, allowing you to aim. Release said button to rocket forward, bouncing off of walls and slashing enemies to pieces. Utilizing the bounce is key to success, allowing you to strike down your foes, before they even know you're there.<br/></li><li> Fight through <strong>8 hand-crafted levels</strong> - Rooftops of towering buildings, drone filled Shipping Yards and the interior of the towering, industrial Core. Every single one filled with challenging enemies, each requiring a distinct strategy to take down!<br/></li><li> Challenge 2 <strong>powerful bosses</strong> to really test your skills. - These foes will push you to your limits, keeping the pressure on with bullet-hell attacks!<br/></li><li> Accessibility features - Allowing you to turn down (or completely turn off ) certain effects. Also included is an invincibility toggle, in case the level is becoming a struggle (best times will not be counted while invincibility is turned on, however the level can still be completed).<br/></li><li> Time Attack - A time attack mode is unlocked after a level is completed, allowing you to further refine your time. Earn up to 3 trophies per level (or boss), making for a total of <strong>30 to collect</strong>!<br/></li><li> Full Controller Support!*</li></ul><br/>*Keyboard and Mouse recommended", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2022-04-29T03:33:49", "background_image": "https://media.rawg.io/media/screenshots/3c6/3c653b38f1922d8b983ec22b1951d518.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alexander John Noles"], "genres": ["Action", "Indie"], "publishers": ["Monitor Break"], "esrb_rating": null}