{"id": 776262, "slug": "hellscreen", "name": "Hellscreen", "name_original": "Hellscreen", "description": "<p>Fight your way forwards (or backwards) through digital demons in a Giger-inspired Hellscape. Inspired by 90s FPS classics, you must find new weapons, unlock new abilities &amp; warp to connected maps to destroy an ancient device corrupting the afterlife. Objects In Mirror Are Closer Than They Appear!</p>\n<hr />\n<p>ＦＩＲＥ　ＢＥＨＩＮＤ　ＹＯＵ<br />\nＤＥＴＥＣＴ　ＩＮＶＩＳＩＢＬＥ　ＥＮＥＭＩＥＳ　ＩＮ　ＴＨＥ　ＭＩＲＲＯＲ<br />\nＳＥＥ　ＩＮ　ＴＨＥ　ＤＡＲＫ<br />\nＦＩＮＤ　ＨＩＤＤＥＮ　ＭＥＳＳＡＧＥＳ<br />\nＭＯＶＥ　ＦＯＲＷＡＲＤ　ＦＯＲ　ＤＯＵＢＬＥ　ＤＡＭＡＧＥ<br />\nＵＰＧＲＡＤＥ　ＷＥＡＰＯＮＳ　ＴＯ　ＯＶＥＲＣＯＭＥ　ＯＢＳＴＡＣＬＥＳ<br />\nＦＩＮＤ　ＳＯＵＬＣＯＲＥＳ　ＴＯ　ＵＮＬＯＣＫ　＆　ＴＥＬＥＰＯＲＴ　ＴＯ　ＮＥＷ　ＷＯＲＬＤＳ<br />\nＤＥＳＴＲＯＹ　ＡＮＣＩＥＮＴ　ＭＡＣＨＩＮＥＳ</p>\n<h1>STORY</h1>\n<p>Before the old times, ancient gods once held the eternal responsibility of sending the good to heaven and the wicked to hell. After growing tired of everlasting life and having grown older than time itself, the gods built a gigantic monolithic machine.This titan of a device was to take on their endless burden of soul sorting and allow them to die.<br />\nThis &quot;Hellscreen&quot; machine was soon constructed. But there was no rejoicing, only relief. In a flash, the old gods were gone, lost to time.</p>\n<p>After millennia of sorting countless souls, the machine begins to malfunction and displaces you.</p>\n<p>You are taken from the real world at the point of your death and deposited in the Hellscreen realm, instead of the peaceful afterlife you deserve.</p>\n<p>You are given an inhuman form and are called upon to destroy the machine and its infernal biome.<br />\nIt must be stopped from dismantling the fabric of all existence and destroying all reality and only you can stop it and reset order.</p>\n<p>Once this is done then perhaps you can return to your eternal resting spot.</p>\n<h1>EARLY ACCESS INFORMATION</h1>\n<ul>\n<li>Episode 1 - Releases Q1 2023  </li>\n<li>Episode 2 - Releases mid 2023  </li>\n<li>Episode 3 - Releases Late 2023</li>\n</ul>", "metacritic": null, "released": "2023-03-09", "tba": false, "updated": "2023-03-10T08:00:07", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf7a10a0bfc75d36ea18f7870dfc16ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 5, "owned": 5, "toplay": 9}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 434, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Uk_resistant", "Jamie D"], "genres": ["Action", "Shooter", "Indie"], "publishers": ["Jamie D"], "esrb_rating": null}