{"id": 776297, "slug": "draco-knight", "name": "Draco Knight", "name_original": "Draco Knight", "description": "Don your armor and take up the spear and shield, for evil walks the land once more.<h3>The Game</h3><br/><br/>Draco Knight is a brutal and difficult combat based 2D action-platformer with a touch of metroidvania. The game uses twin stick controls to provide an intricate and hard to master gameplay. Combat is deliberate and impactful, requiring both finesse and quick decision making skills. You will die a lot, but as long as you learn from every encounter every enemy will eventually fall.<br/><br/><h3>Engage Oppressive and Menacing Foes</h3><br/><br/><br/><br/>Encounter increasingly more challenging and horrifying monsters as you continue your journey. Each enemy will have their own strengths and weaknesses, the former is to be respected while the latter exploited. A knight without vigilance will meet his end in battle, yet a skilled and careful knight can engage an entire army. <br/><br/><h3>Epic Boss Battles</h3><br/><br/><br/><br/>Boss battles are designed to be brutal and challenging.  Study your foes and test your ability to adapt, perhaps with enough tenacity and skill even the greatest of foes can be defeated.<br/><br/><h3>Empower the Knight </h3><br/><br/><br/><br/>Overcome the toughest enemies to break through human limits and unlock your draconic powers. Secure aid from allies who may know a thing or two about smithing. As you unlock new skills &amp; improve your armor, your ability to navigate through environments increases along with your capacity to devastate your enemies.<br/><br/><h3>Story</h3><br/><br/>Our story takes place in the kingdom of Draconia where humankind and dragons coexist in peace. Yet now a shadow looms over the land, where once there was peace, monsters now roam. Currently, the kingdom still holds due to the might of the Draco Knights, great and noble warriors who turned the tides of the Great War. <br/><br/>Experience the tale of a lone knight who fights to reclaim a fortress lost to evil forces. Explore a massive Castle and beat back the threat to discover the mysterious nature of the enemies that now beset the land.", "metacritic": null, "released": "2019-12-18", "tba": false, "updated": "2022-05-02T14:32:26", "background_image": "https://media.rawg.io/media/screenshots/129/1290541bddb3acdfa8f891fb8e0d9ace.jpg", "website": "https://dracoknight.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 501, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["teamhen"], "genres": ["Action", "Adventure", "RPG", "Indie", "Platformer"], "publishers": ["TeamHen"], "esrb_rating": null}