{"id": 776376, "slug": "trinitys", "name": "TrinityS", "name_original": "TrinityS", "description": "<h3>All of the Fun, None the \"MMO Grind\"</h3><br/>TrintyS highlights the best parts of MMO endgame content by skipping the repetitive grind for levels or gear.<br/>Get straight to the action with well-designed boss encounters that will test players' timing, skills, and coordination.<br/><br/><br/>Up to three players can challenge a variety of formidable bosses, each with its own unique fight mechanics and attacks.<br/>In this game, where <strong>movement</strong> and <strong>positioning</strong> are crucial, a momentary error in judgment can be fatal.<br/>Dive right into the excitement of MMO endgame content with your friends.<br/><br/>Trinity is the Magic Number!<br/><br/><h3>TrinityS features three unique characters</h3><ul><li>Grey is a Knight who serves as a shield to protect his allies.<br/></li><li>Emile is a Wizard who clears away enemies with powerful magic.<br/></li><li>Bell is a Priest who supports allies with her healing power.</li></ul><br/>Each adventurer has different skills that can be customized between battles, allowing you to fine-tune each to your play style.<br/>Choose the role that suits you best and learn to use the adventurer's different characteristics and skills with your team to take down the bosses!<br/><h3>Positioning &amp; Communication are the Keys</h3>In TrinityS, position and communication are paramount to defeating the bosses.<br/>Being in the right place lets you avoid massive damage from attacks and access powerful passive buffs the longer your character stands in place.<br/>Communicate with your team to coordinate positions and timing of special skills to your party to victory!<br/><h3>Play Solo</h3>TrinityS is a cooperative online action game but can also be played solo.<br/>Parter with AI companions to hone your skills on different bosses, experiment with other skills or learn to play a different adventurer.<br/><br/>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2022-04-29T05:38:25", "background_image": "https://media.rawg.io/media/screenshots/4f1/4f1376d23165744e766548a0af20933a.jpg", "website": "https://www.indie-us-games.co.jp/trinitys", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 2, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 551, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Indie-us Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Indie-us Games"], "esrb_rating": null}