{"id": 776346, "slug": "i-hate-you-please-suffer-basic", "name": "I Hate You, Please Suffer - Basic", "name_original": "I Hate You, Please Suffer - Basic", "description": "I HATE YOU, PLEASE SUFFER is a turn-based RPG of a woman doing a bunch of side quests to make rent while making new friends and fighting assorted weirdos.<h3>This game features:</h3><br/><strong>QUESTS!</strong><br/>While there's different ways of making money, the biggest draw is doing the quests offered by the local adventuring guild. Maybe Ramona can make some friends in the process?<br/><br/><strong>FIGHTING!</strong><br/>I HATE YOU PLEASE SUFFER is a standard turn-based RPG experience with some experimental things. Each party member distinguishes themself with a gimmick to keep things fresh, like Ramona risking some of her hard earned money to do moves, or Devon having to build up focus to use his magic attacks. There's enemy scaling, especially for bosses, so you can't just brute force your way through things!<br/><br/><strong>MONEY MAKING!</strong><br/>Adventuring is just as respectable a job as any. Sell items you get from fighting people. Do the main quests. Hunt down the bounties of weird monsters and serial killers for the bounty office. Go fishing. Get a loan. Or maybe try to take the easy way out with some basic gambling minigames.<br/><br/><strong>INCONVENIENCES!</strong><br/>The world is a mean place. Maybe you'll get inconvenienced by a random phone call while minding your business. Or some person you made angry will come up to start something. Such inconveniences are lovingly captured in this rude RPG.<br/><br/>------------<br/><br/><strong>This is the BASIC version of the game, which contains about 3/5ths of what I originally pictured for the game. The COMPLETE version of the game, which will come out... one day... will be the fully realized experience that will be a commercial release. You may wonder, \"hey, why don't you just make this Early Access or something?\" Well, see, I'm bad at consistently focusing on things and I don't want to feel the pressure of delivering regular updates. So, everyone will just get the rest of the game all at once.</strong><br/><br/>The game contains about 3 - 5 hours of content and currently includes three party members. It also contains a bunch of rude stuff that'd probably make you mad.<br/><br/>The music used in the game is all public domain stuff created by LOYALTY FREAK MUSIC. Go check out their work if you dig their vibes.", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2022-04-29T04:55:48", "background_image": "https://media.rawg.io/media/screenshots/32e/32e1a7cc19deadad0d527c6eac0cdcc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["scitydreamer"], "genres": ["RPG"], "publishers": ["scitydreamer"], "esrb_rating": null}