{"id": 776383, "slug": "panmorphia-awakened", "name": "Panmorphia: Awakened", "name_original": "Panmorphia: Awakened", "description": "<h3>The Legend of Panmorphia</h3><br/>The legend goes that in each generation a child is born, a sentinel, bound to the land of Panmorphia and the four elements that govern it. The sentinels have the ability to wield each element and transform themselves into an animal that best represents it. With the use of the amulet they are able to combine all four elements and travel through the aether. They are called upon for help in times of need.<br/><br/><br/><br/>In the first adventure, you transformed into a cat, bird and fish, and saved the four trapped elements! In your second adventure, you visited the Lost Temple and upgraded the amulet to enable you to swap freely between the four elemental forms!<br/><br/><br/><br/>In your third adventure, you are heading back to Panmorphia! <br/><br/>You can now use the amulet to transform freely between the four forms. Each transformation affects your world view!<br/><br/>The spirit of Panmorphia has tasked you with finding the four sentinels and awakening them.<br/><br/>The future of Panmorphia depends on your success!<br/><br/>Good luck, Sentinel!<br/><br/><h3>Features:</h3><ul><li>A point and click, puzzle adventure game!<br/></li><li>A beautiful world to discover!<br/></li><li>Morph into a cat, bird or fish and gain unique perspective in the world!<br/></li><li>Custom designed beautiful graphics!<br/></li><li>Many items to collect and puzzles to solve!<br/></li><li>Dynamic map and notebook that track your discoveries!<br/></li><li>A Hint System that gives you the next task and the location on the map!<br/></li><li>A beautiful soundtrack and original sound effects!<br/></li><li>Auto-saves your progress!</li></ul><br/>", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2022-05-20T11:26:33", "background_image": "https://media.rawg.io/media/screenshots/f23/f232bbb16b8320ffa64001f1fdd17dcb.jpg", "website": "https://www.lkmad.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 470, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Linux", "macOS", "PC"], "developers": ["LKMAD"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["LKMAD"], "esrb_rating": "Everyone 10+"}