{"id": 776344, "slug": "turbo-sliders-unlimited", "name": "Turbo Sliders Unlimited", "name_original": "Turbo Sliders Unlimited", "description": "Turbo Sliders Unlimited is a spiritual successor of many classic top-down racing games, but in 3D and with modern online features and extensive customization and modding possibilities. It goes far beyond being just a racing game - it is a community driven platform where anyone can create their own levels, vehicles and game modes. It can be played as a serious esports game or as a fun casual game. It can be played alone, as online multiplayer or as local multiplayer.<br/><br/>The game is already fully playable with most main features implemented, but many new features are still to be added and old ones polished. Feel free to join the Discord server to stay up to date with the news and affect development by communicating with the developers!<br/><br/>Main features:<h3>Online multiplayer</h3><ul><li> Supports up to 20 players (and spectators)<br/></li><li> Based on authoritative server and client side prediction (good for esports)<br/></li><li> Anyone can host their own public or private servers and decide levels, vehicles and rules there<br/></li><li> Support for dedicated servers and server-side scripting</li></ul><h3>Local multiplayer</h3><ul><li>Couch gaming with up to 4 local players in split-screen<br/></li><li>Possible to join online MP games together, too</li></ul><h3>Camera</h3><ul><li>Multiple camera presets, all of which can be extensively tuned <br/></li><li>Camera modes include 3rd person (close or far), 1st person, top-down, fixed position, free camera</li></ul><h3>Level and vehicle creation and sharing</h3><ul><li>Feature rich in-game level editor and vehicle editor included<br/></li><li>Sharing via Steam Workshop or by automatic downloading in online games</li></ul><h3>Recording games</h3><ul><li> Any game can be recorded and watched later from possibly different camera angles and with different playback speeds</li></ul><h3>Customization</h3><ul><li>Vehicle looks can be customized by changing color, paint jobs and paint properties (metallicness, smoothness)<br/></li><li>Possible to buy customization packs unlocking new colors, paint textures, more paint commands per a paint job, and more range for paint properties</li></ul><h3>Hotlapping and Leaderboards</h3><ul><li>Possible to play alone and try to beat leaderboard times, optionally against ghost recordings<br/></li><li>Local leaderboards for all levels and vehicles<br/></li><li>Global leaderboards for built-in levels and vehicles - and for selected user generated ones</li></ul><h3>Special game modes</h3>In addition to normal racing and its variations, there is support for many different game modes like car parkour, platforming or sumo battle. More game modes are planned to be added later, partially based on player feedback. Possible future game modes include (not promised yet):<br/><ul><li>Vehicle soccer<br/></li><li>Race with weapons<br/></li><li>Battle with weapons<br/></li><li>Tag<br/></li><li>Race with metagame between races (buying weapons, improving vehicle etc.)<br/></li><li>...</li></ul><h3>Single player campaign</h3><ul><li>Not implemented yet but the plan is to have something in the final game - whether it would be just a quick tutorial to get to MP or something bigger is not decided yet<br/></li><li>Possible future feature (not promised): Allowing players to create and share their own campaigns (with their own tracks, levels and AI)</li></ul>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2023-04-10T18:45:32", "background_image": "https://media.rawg.io/media/screenshots/d02/d02eacbe5f3ff6d99d57458bd8c9732c.jpg", "website": "https://www.turbosliders.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 516, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Antti Mannisto"], "genres": ["Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Antti Mannisto"], "esrb_rating": null}