{"id": 776331, "slug": "unlife", "name": "Unlife", "name_original": "Unlife", "description": "<h3>Story</h3>After the invention and uncontrolled use of nuclear weapons at the end of World War II, humanity almost destroyed itself in endless conflicts. Dust eclipsed the sun, and global warming caused all the glaciers to melt. The remnants of the scarred land turned the ocean into a muddy slush, in which the evolutionary process began under the influence of radiation. In the poisonous water, a parasite appeared that mutated almost all living things. But there were people who managed to survive in this nightmare and adapt. In the vast expanses of the Black Ocean, they built many platforms where they worked and survived. What used to be used for war has become a bulwark of life. Ships and submarines became the main travel arteries. The main character of the game — the last survivor on his platform, he is seriously ill, but decides to leave his station, and go on a submarine to other platforms, along the way trying to help other survivors and find the way to salvation and healing.<br/><br/><h3>Gameplay</h3>The game is a 2d platformer in which you need to overcome various obstacles, swim under water, search for weapons and supplies, and destroy merciless monsters. The hero will have to move between platforms on a large submarine from the Second World War. The player will also have the opportunity to personally control a small submarine. Collecting various trash, you can create items on the workbench necessary for survival. The genetic material of the killed creatures can help cure the hero of the disease, which will affect the end of the game.<br/><br/><h3>Game features</h3><ul><li>dark mysterious atmosphere </li><li>hand-drawn graphics  </li><li>animated and CG cutscenes</li><li>dynamic gameplay and battles with dangerous monsters</li><li>submarines and water locations</li><li>multiple endings, three difficulty levels</li><li>themed dark soundtrack  </li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-29T04:35:10", "background_image": "https://media.rawg.io/media/screenshots/b92/b92e642236a49b461768f29ad4240158.jpg", "website": "https://vk.com/diedemor", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diedemor Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["diedemor studio"], "esrb_rating": null}