{"id": 776305, "slug": "disinfection-2", "name": "Disinfection", "name_original": "Disinfection", "description": "Play alone or as a team of up to 4 players as you battle a deadly nanomachine infection, while tasked with the job of identifying and destroying these infections.<br/><br/>You will be hunted by horrifying amalgamations of flesh and machine, whilst having to deal with the dangers of living in space as the environment around you is being corroded away slowly but surely. Explosive decompression, oxygen deprivation and machinery malfunctions will be the least of your worries.<br/>Trust nothing, not even your team, as things will not be as they seem.<br/><br/>Good luck, astronaut...<br/><br/><strong>Story</strong><br/>The discovery of an alien nanomachine technology in the 60's has launched humanity into an age of rapid technological development. Curious to see what's out there a new space-race ignites and spreads humans over our solar system. However it's all about to change. Troubling reports of ships and stations malfunctioning have started flooding in and people have started disappearing.<br/><br/>Now it is up to brave astronauts to unravel a mystery that may yet undo all that humanity has achieved.<br/><br/><strong>Key Features</strong><br/><ul><li> Complete immersion: realistic graphics and sounds, minimal user-interface and all interactions are through the player character and the environment.<br/></li><li> Procedurally and randomly generated environments will require you to adapt to and overcome unexpected situations.<br/></li><li> Play alone or with up to 4 players in Co-op.<br/></li><li> Unique infections, each with their own abilities, strengths and weaknesses.<br/></li><li> VR support (coming soon) for Oculus and HTC Vive</li></ul>", "metacritic": null, "released": "2022-05-01", "tba": false, "updated": "2022-04-29T04:03:04", "background_image": "https://media.rawg.io/media/screenshots/728/728c98c853d9de5cf62be211200b1315.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evil Turtle Productions"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Evil Turtle Productions"], "esrb_rating": null}