{"id": 776303, "slug": "chardonnay-romancia", "name": "Chardonnay Romancia", "name_original": "Chardonnay Romancia", "description": "<p>It will launch with the first two chapters of the story,<br />\nafter which chapters three through seven will be added in subsequent updates.<br />\nAt the start of the game, you can select either the &quot;Grown-ups plan,&quot; which features explicit content, or the &quot;Good Kids Plan,&quot; for a more safe-for-work experience.<br />\n&quot;Good Kids Plan&quot; is only available in Japanese.<br />\n*To prevent spoilers, please refrain from posting gameplay videos of Chardonnay Romancia from Episode 3 and beyond.<br />\nPlease note that this game contains content not suitable for minors, and this circle will not be held liable if your account gets into trouble from posting videos of this game online.<br />\n◆　◆　◆　◆　◆<br />\nIn an idyllic town frequented by Heroes, there is a small guesthouse called the Grapes Inn that&#39;s (in)famous for a particular reason:<br />\n&quot;Feel free to find another place to stay if you can&#39;t comply with the terms.<br />\nI&#39;m sure there are many other inns suited for Heroes like you.&quot;<br />\n&quot;I won&#39;t change my mind. Even if my inn will be the only one that will never let Heroes stay in it.&quot;<br />\nIts innkeeper, a young man named Rudolf, absolutely detests Heroes!<br />\nBut one day, through some twist of fate, a Hero lands on his doorstep.<br />\nThis stranger, Figaro, explains that he has lost all of his memories. Not only that, one look at Rudolf has made him fall in love at first sight!<br />\nRudolf desperately tries to drive the pesky Hero away, but circumstances force him to hire Figaro as his helper instead.<br />\n&quot;But I wanna staaay! I can be your helper! Pleeeeease?&quot;<br />\nThe timing couldn&#39;t have been worse as Rudolf already had his hands full with his other guests:<br />\nJey, a bibacious merchant, and Kinos, his taciturn bodyguard.To make things even more chaotic, Nazk, a young mage, just moved in to open an apothecary next door.<br />\nFurthermore, the threat of a notorious syndicate also looms on the horizon.<br />\nIn this story of Heroes, debts, hot springs, festivals, tentacles, family, and an inn that must be rotected at all costs, what does destiny have in store for this poor innkeeper?</p>", "metacritic": null, "released": "2022-04-25", "tba": false, "updated": "2022-05-02T12:40:50", "background_image": "https://media.rawg.io/media/games/7c2/7c2777c911ac7e0e68d4d0e1ae424fc4.jpg", "website": "https://www.chardonnayromancia.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 456, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["リストランテ助六"], "genres": ["Adventure", "Simulation"], "publishers": ["リストランテ助六"], "esrb_rating": null}