{"id": 776317, "slug": "loony", "name": "LOONY", "name_original": "LOONY", "description": "<strong>LOONY</strong> is a multiplayer strategy, role-playing and thriller where one player takes on the role of the killer and kills those who try to escape from the map, and other players try to escape the map by finding the killer or completing missions.<h3>CAN THE ENEMY BE NEAREST?</h3><ul><li><h3>Online Co-op for 4-10 Players</h3></li></ul>Survive in an environment where you cannot completely trust your friends and must work together to escape a LOONY who is lurking among you to kill you.<br/>You can also get the randomly assigned LOONY role in each new session. If you're LOONY, play smart and don't let anyone get away.<br/><br/><h3>CAN YOU ESCAPE THE LOONY?</h3><ul><li><strong>People Stranded</strong></li></ul>Your goal is to escape LOONY without being caught, or detect LOONY and send him into isolation at meeting time. When the electricity is sabotaged, it's going to be really hard to escape if it's not fixed.<br/><ul><li><strong>Loony</strong></li></ul>You are completely alone. By deceiving people, you must divert suspicion and neutralize your victims undetected. Don't forget to sabotage it to make it harder for people to escape.<br/><ul><li><strong>Ghost</strong></li></ul>As a ghost, you can help or hinder your friends. He cannot give information to his friends. It can try to interfere with LOONY just by interacting with the doors.<br/><ul><li><strong>Replayability</strong></li></ul>The places where the keys of locked doors, door-safe codes, electrical fuses, Loony vaccines and screwdrivers appear are constantly changing. That's why you have to learn to work as a team.<br/><ul><li><strong>Multiplayer Feature</strong></li></ul>Play with your friends or play with other players using the server browser.<br/>Use our in-game text chat.<br/><br/><br/><br/><h3>Warning</h3>This game contains flashing lights and effects that may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. The player is advised to be careful.", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2022-04-29T04:16:29", "background_image": "https://media.rawg.io/media/screenshots/262/262eb62fca28eb16057c2d1d5712a467.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Konrul Game"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Konrul Game"], "esrb_rating": null}