{"id": 776395, "slug": "park-story", "name": "Park Story", "name_original": "Park Story", "description": "<h3>CRASH INTO A NEW ACTION RPG ADVENTURE</h3>One rainy night, tyres screech and a car crashes into an abandoned park. Parker crawls from the wreckage to find themselves trapped in a forgotten place twisting in the grip of the demon raven Caim. The enemy may be a Great President of Hell, but Parker is going to discover they have demons of their own.<h3>MEET THE ANIMALS AND GHOSTS LEFT BEHIND</h3>There’s no way out unless Parker follows the lead of the Lairds — the park’s animal parliament. Parker will need to decide if wildlife who wear waistcoats can be trusted. It’s not the only quest. Ghosts roam the park with their own unfinished business and only Parker can help.<h3>EXPLORE ABANDONED MAHAGOW GLEN COUNTRY PARK</h3>Explore a huge overworld packed with secrets, hidden caves and eerily familiar attractions. Discover more as the mystery unfolds, taking you deeper and deeper into the park.<h3>UNRAVEL HANDCRAFTED PUZZLE DUNGEONS</h3>Venture into unique dungeons each with their own distinct puzzles to solve. Unlock new tools and abilities, unpick interconnected rooms, and learn the history of Parker’s hometown to get closer to freedom. Absolutely nothing procedural, just like classic action RPGs.<h3>TRANSFORM INTO THE ANIMALS OF THE PARK</h3>Parker will need more than two legs to overcome Caim. Take on the forms of the Lairds — a squirrel, a fox, a duck and a pigeon. Use their natural gifts to crawl, dig, swim and fly to the road home.<h3>BATTLE THE DEMON RAVEN CAIM AND HIS GENERALS</h3>Caim hasn’t come alone. His Generals lurk within the dungeons. Twisted versions of their former selves, they opened the gateway for Caim. They’ll do whatever it takes to make sure that it’s others that suffer the consequences.<h3>Embrace the Park. Overcome underachievement. Find your way home.</h3>", "metacritic": null, "released": null, "tba": false, "updated": "2022-04-29T06:03:53", "background_image": "https://media.rawg.io/media/screenshots/d7f/d7f69b05594db706ed7e20cec87d8170.jpg", "website": "https://www.parkstorygame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Person of Interests"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Person of Interests"], "esrb_rating": null}