{"id": 776363, "slug": "full-of-work", "name": "Full of work", "name_original": "Full of work", "description": "This is a 2D fetish game. You can feed girls and make them so full that their bellies will be round after some training, also girls can gain weight if you will feed them something high calorie. Try to work as sales manager in Food marketing company. First month of the game you should work well or the game will end for you. After this period it would be easier to gain weight and increase capacity of your boss Ann. Also remember about the reputation. If it will become 0, you will be fired. <br/>\r\nAlso there 3 side lines with stuffing and 2 other girls in the game, find all the opportunities. You can find other girls in the club (Alexa) and cafe (Aurora).<br/>\r\nThe gameplay is simple- you choose dialogues or use icons to communicate or to do some action. In fact the game is a sequence of pictures appearing when you do something.<br/>\n<br/>\n<br/>\r\nWarning! Read this before you buy!<br/>\n<br/>\r\nIf you follow me, you should know, that for now I create multiple short games with some sort of game mechanics in almost standard interface. It is literally a bunch of images, that appear in different circumstances and there is almost no weight gain. All my games are stuffing games. And for me the main value is that they are different. Different models, morphs, clothes, different style of interactions. Every game is an experiment. They are as they are. Some people, such as me like such things and diversity. So if you are not into it, i ask you to understand and to forgive))", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2022-04-29T05:22:10", "background_image": "https://media.rawg.io/media/screenshots/3d4/3d4531f6e0c1de9115c23a292e0fc8e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yuliya Kovach"], "genres": ["Indie"], "publishers": ["Yuliya Kovach"], "esrb_rating": null}