{"id": 776409, "slug": "animals-collision", "name": "Animals Collision", "name_original": "Animals Collision", "description": "Animals Collision is a party game for up to 4 human (online) or computer-controlled players. The game features several different levels in which the goal is to defeat opponents. The last player standing wins the round and the first player to win a set number of rounds wins the game. The main mode of play is Free for All, but online is possible in 2v2 teams.<br/><br/><strong>FEATURES</strong><br/><br/><ul><li>Different levels with different crazy things happening. Sheep with rockets, turtles with chainsaws, flying penguins... Falling boxes from the sky with a reward or not, everything can change very quickly in your favor or harm. Apart from that, you have to show your fighting skills on the arena against different opponents.</li></ul><ul><li>Humanoid animal characters with unique look, attacks and skills. Choose between: Cat, Lizard, Bear, Rabbit, Ram, Wolf.</li></ul><ul><li>AI Bots as bonus in addition. Initially, the game was planned to be played online only, but bots were added. They are not very smart, but it's better than nothing. This will allow you to play offline (Single player mode) and no need to connect in online game rooms. You can choose versus how many bots to play: 1, 2 or 3. Also keep in mind that they will all attack only you (yes, they are friends) - this can be a challenge that will be definitely a lot of fun.</li></ul><ul><li>Game Modes: Single player, Lan or Online up to 4 players. Also available game types are: Free for All or 2v2 teams (online).</li></ul><ul><li>This is \"Free To Play\" game. If you are worried that there will be no one to play with... you can invite your friends and play with them. It's better than AI bots in Single player mode (and probably more fun).</li></ul><ul><li>It's not \"Pay To Win\" game. Only additional content as DLC (Maps, Characters, Skins).</li></ul><ul><li>Even if you don't have a DLC content for this game, you can play online on DLC maps, if the host player has them and chooses them.</li></ul><ul><li>Partial Controller Support: Xbox 360, Xbox One (native support) or PS3, PS4 (with SCPDS3, DS4Windows, XOutput, x360ce).</li></ul><ul><li>Integration of some Steam features such as: Achievements, Leaderboards, Cloud.</li></ul><br/>NOTE: This \"Free To Play\" version of the game contains the following game content - Maps: Forest 1, Forest 2, Forest 3 and Tournament 1 - Characters: Cat and Lizard. Additional game content can be found as paid DLC.", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2022-04-29T06:22:25", "background_image": "https://media.rawg.io/media/screenshots/5f6/5f60204701ffa2ab2974f51ac0a011ce.jpg", "website": "http://www.algames.eu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 440, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AL Games"], "genres": ["Action", "Casual", "Indie"], "publishers": ["AL Games"], "esrb_rating": null}