{"id": 776450, "slug": "ich-sage-flussig-1-zerstorter-joy-park", "name": "ich sage flüssig (1 zerstörter joy park)", "name_original": "ich sage flüssig (1 zerstörter joy park)", "description": "<p><em>ich sage flüssig (1 zerstörter joy park)</em> entstand im Rahmen einer einwöchigen Residenz vom 20.-29.04.2022 am PATHOS München als Teil der Experimentalreihe DIE TOD UND DAS MÄDCHEN zu digitalem Theater im Slot GAMING.</p>\n<p><strong>⚠️ Beim Showing am 29.04. (20-21 Uhr) wird die Version des Games noch Baustellen aufweisen, die in den nächsten Tagen und Wochen noch bearbeitet werden, um weitere geplante Teile sowie Pro- und Epilog des Projektes und des Parks zugänglich zu machen. ⚠️</strong></p>\n<p>[W A S D] - Laufen</p>\n<p>[Leertaste] - Springen</p>\n<p>[ESC] - Beenden</p>\n\n<p>+ + +</p>\n<p><em>ich sage flüssig (1 zerstörter joy park)</em> ist eine virtuelle Umgebung, in der #collignon#friedland# Auszüge aus einem seit Oktober 2021 via Google Doc entstehenden Theatertext (AT:<em> ich sage flüssig</em>) in den digitalen Raum bringen. Der Text nimmt in teils sehr verdichteter, poetischer Sprache eine große Bewegung vor, thematisiert festgeschriebene Machtverhältnisse zwischen sozial konstruierten Geschlechtern, einen weißen* Umgang mit einem nach wie vor präsenten Erbe kolonialer Gewalt und neokolonialen Strukturen. Das digitale Projekt setzt sich mit der Ästhetisierung sogenannt „weiblich“ gelesener Körper im Schmerz auseinander, die sich angeeignet werden, die nicht widersprechen können, die zum total Passivem, zum Anderen, zum Toten erklärt werden. Es geht u.a. um Evelyn McHale, trans* Sein, Krieg, KI, mediale Oberflächen, Werbeflächen, Vater-Tochter- und Mutter-Kind-Beziehungen sowie Übergriffe. Das Mädchen rächt sich mit die Tod. Sie treffen im narrativen Raum – Zwischenraum, zwischen, Zwischenraum – aufeinander und es wird auch eine Hummel beerdigt.</p>\n\n<p>+ + +</p>\n<p> nicole collignon (sie/ihr) studierte u.a. kulturanthropologie in leipzig (2017-18), kreatives schreiben und kulturjournalismus (2018-2021) in hildesheim im gleichen jahrgang mit luka*s friedland und inzwischen sprachkunst (2021) an der universität der angewandten künste in wien und gehört der diesjährigen redaktion der JENNY, des literaturmagazins der angewandten, an. u.a. erschienen texte von ihr in der zeitgenossin, dem feministischen magazin VAKUUM, sowie im publikationsprojekt FUTUR II des literaturinstituts hildesheim 2021 und der anthologie des treffen junger autor*innen 2020. sie nahm an der nahaufnahme 2021 der berliner festspiele teil und fokussiert sich auf lyrik, kurzprosa und drama.\r\n </p>\n<p> luka*s friedland [---/luka/they] (*1999) lernte nicole collignon über das b.a. studium kreatives schreiben und kulturjournalismus, medien und theater (2018-2021) kennen. luka schrieb their bachelor*arbeit zu videospielen und visueller poesie. they studiert im moment m.a. literaturwissenschaft: texte. zeichen. medien in erfurt. luka ist u.a. game developer*in, writer*in, dramatiker*in, performance artist und medienkünstler*in, arbeitet intermedial und digital und speziell zu theater in verbindung mit digitalen spielen. luka war z.b. in literaturvermittelnder tätigkeit mitglied im wortbau e.v. und hat zahlreiche kleinere veröffentlichungen (zeitschriften, anthologien, internet) und auszeichnungen irgendwo, z.b. literaturlabor wolfenbüttel 2019, treffen junger autor*innen 2019 und lyrix 2019 &amp; 2021 (&amp; so on).</p>\n\n<p> <strong>ÜBER #collignon#friedland#</strong>\n</p>\n<p> Im Rahmen des Hildesheimer Performancefestivals STATE OF THE ART 11 erarbeiteten sie in Zusammenarbeit mit Linda Ludwig eine Schreiperformance (Arbeit mit Körperfarbe, mit Klangmeditation und mit Videoinstallation) und beim STATE OF THE ART 12 waren Collignon &amp; Friedland mit der kritisch rahmenden wie parodierenden und intermedialen Bademagazinperformance “Willkommen im Bad von Morgen” vertreten, das veraltete Gendernormen in der kapitalistischen Werbemaschinerie thematisierte und theatral bearbeitete. (Siehe dazu auch die digitalen Spiele DIY Matschtisch und Badtour, die im Rahmen dieses Projektes entstanden.)</p>", "metacritic": null, "released": "2022-04-29", "tba": false, "updated": "2022-04-29T06:40:48", "background_image": "https://media.rawg.io/media/screenshots/fa4/fa44d7d7b3f2527778e2229a489ac305.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["luka"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}