{"id": 77640, "slug": "hidden-object-vampires-temple-find-objects-in-myst", "name": "Hidden Object Vampires Temple – Find Objects in Mystery and Fantasy Pictures", "name_original": "Hidden Object Vampires Temple – Find Objects in Mystery and Fantasy Pictures", "description": "Are you looking for wonderful vampire games? Do you want to become a true vampire hunter? Here is an excellent vampire adventure for you! We have created this hidden object game which will entertain you and help you practice vocabulary! If you always loved playing mystery hidden objects, you're at the right place! Haunted house, cemetery, vampire's castle – all horror environments especially for you! Download house secrets hidden objects and solve a mystery in the vampire world! If you like horror games free, Hidden Object Vampires Temple will become your favorite pastime! Welcome to the mystery society of vampires and other scary creatures – enter the haunted castle and find objects in a messy room!<br/><br/>Features:<br/>More than 1000 hidden objects to find!<br/>Amazing HD graphics – 3D environment!<br/>Text mode - good for kids for learning object names.<br/>Collect at least three stars to move on to the next level!<br/>Collect the maximum amount of points and beat the clock!<br/>Use hint system to find an item!<br/><br/>Hidden objects adventure is waiting for you! If you're looking for free hidden object games with mystery story mode, you're at the right place! Come to the hidden object expedition with us and find the hidden objects in the vampire's castle! This find the hidden object game offers you exquisite design and interesting gameplay! If you like time games and search and find games,  Hidden Object Vampires Temple offers you just what you need! Find hidden objects in the haunted house, vampires temple, and other haunted places, and win all the stars! This hidden object game is the right choice for you!  Spot it, find it, and have a lot of fun! Say 'I spy with my little eye' and enjoy playing these free hidden object games for young kids. If you like vampires and hidden object mystery games, these vampire games free will blow your mind! Scary games free with hidden objects and messy rooms for you to clean up and enjoy playing!<br/><br/>Hidden objects search and find games for kids! If you're looking for new hidden objects game,  Hidden Object Vampires Temple will be an excellent choice for you! Find the object free games with vampire theme will test your concentration, focus, and speed! Use your quick fingers to find objects before the time runs out! Find objects in pictures of haunted castle, haunted cemetery, secret garden, and other mystery places! These object finding games are suitable for users of all generations! Become an excellent vampire hunter and enjoy your vampire adventure with these seek and find hidden objects game! Find the hidden objects free of charge and share it with your friends! Hidden objects games for all fans of vampires and vampire world! Enjoy playing these free puzzle games and mind games to help you with your memory and vocabulary! Find the objects free games only for your eyes!", "metacritic": null, "released": "2016-06-02", "tba": false, "updated": "2019-10-22T14:23:17", "background_image": "https://media.rawg.io/media/screenshots/f5c/f5c60ccc0e7f701ec26854b867cf3cb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Midva Games"], "genres": ["Puzzle"], "publishers": ["Midva"], "esrb_rating": "Everyone 10+"}