{"id": 7765, "slug": "crystal-cave-classic", "name": "Crystal Cave Classic", "name_original": "Crystal Cave Classic", "description": "Collect gemstones from ancient tombs and pyramids in this amazing adventure logic game from Rake in Grass, the creators of Archibald&amp;#39;s Adventures!<br/><br/>Crystal Cave Classic is a quest for long-lost treasures buried in pitch black caves, pyramids and temples of ancient civilizations. Huge gemstones were sheltered from the sunshine for eons of time waiting for explorers brave enough to unearth them. You - as an intrepid treasure hunter - will need all your ingenuity to pass the traps and dangers of the underground and collect the treasure in more than 170 levels.<br/><br/>Crystal Cave Classic offers gameplay mixed of action and puzzle elements for players of all ages!<br/><br/>If you want to play easier levels, choose the game&amp;#39;s spin-off Crystal Cave: Lost Treasures.<br/><br/>Main game features:<br/>- Explore lost tombs and ancient dungeons<br/>- Lots of logic riddles - train your brain!<br/>- Play in over 170 levels<br/>- Use teleports, boulders and other types of rocks to solve levels<br/>- Four graphic scenarios<br/>- Listen to original music<br/><br/>Touch the screen with two fingers to enable level view mode, then use one finger to drag the level around or two fingers to zoom in/out. Tap the screen to return to game.<br/><br/>TRY BEFORE BUY!<br/><br/>Download LITE version with 30 levels for free!<br/><br/>Visit game&amp;#39;s web site for videos, screenshots and more reviews!<br/><br/>* Available in English, French, German, Spanish and Czech language.<br/><br/>You can find collection of walkthrough videos at http://crystalcave.rakeingrass.com/help.php<br/><br/>Follow us on Twitter or Facebook at www.rakeingrass.com", "metacritic": null, "released": "2009-09-08", "tba": false, "updated": "2019-10-22T14:29:31", "background_image": "https://media.rawg.io/media/screenshots/549/549b080f38dc5325f9eb112a3cf4fa06.jpeg", "website": "http://crystalcave.rakeingrass.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Rake in Grass"], "genres": ["Adventure", "Arcade", "Puzzle"], "publishers": ["Rake in Grass", "Pavel Tovarys"], "esrb_rating": "Everyone 10+"}