{"id": 77652, "slug": "beast-quest-2", "name": "Beast Quest!", "name_original": "Beast Quest!", "description": "An evil wizard has enchanted the magical Beasts of Avantia - only a true hero can free the Beasts and stop them from destroying the land. Are you the hero Avantia has been waiting for?<br/><br/>Embark on an epic action-adventure in a huge open world. Battle hordes of dangerous enemies and take on giant Beasts in huge boss battles. Explore snowy peaks and sandy beaches, seeking out ancient artifacts and lost treasures.<br/><br/>Get ready for action-packed combat against multiple foes at once, timing your attacks, blocks and dodges to defeat your enemies. Complete quests to upgrade your equipment and give you the edge.<br/><br/>Only your skill and bravery can bring peace to the Kingdom of Avantia - it’s time to become a hero in BEAST QUEST!<br/><br/>FEATURES<br/><br/>• An epic journey through the huge open world of Avantia!<br/>• Epic battles against the mighty Beasts!<br/>• Collect lost treasures and powerful artifacts!<br/>• Level-up and upgrade your equipment!<br/>• Master an action-packed combat combo system!<br/>• Hundreds of challenges, secrets and in-game achievements!<br/>• iCloud support: save your game progress across multiple iOS devices!<br/><br/>** Please note that while the app is free, please be aware that it contains paid content for real money that can be purchased upon users' wish to enhance their gaming experience. **", "metacritic": null, "released": "2018-07-22", "tba": false, "updated": "2019-10-22T14:06:41", "background_image": "https://media.rawg.io/media/screenshots/063/063f49527c91d4258843d7dcae9408b4_8AfDlus.jpg", "website": "http://www.animocabrands.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Animoca Brands"], "genres": ["Adventure", "RPG"], "publishers": ["Animoca Brands"], "esrb_rating": null}