{"id": 776673, "slug": "among-the-skies", "name": "Among the Skies", "name_original": "Among the Skies", "description": "Among the Skies is an indie naval-style game based around medieval airships built like castles.<br/>\n<br/>\r\nThe goal is to construct a base, build an airship, and conquer territory. <br/>\n<br/>\n<br/>\n<br/>\r\nThere is 47 different areas to conquer. <br/>\n<br/>\r\nAnd throughout your conquest of this vast land, you will encounter many different enemies. <br/>\n<br/>\n<br/>\n<br/>\r\nWith 19 different enemies appearing in your quest.<br/>\n<br/>\r\nThese enemies are constructed of lost, foreign technology. <br/>\n<br/>\r\nBuilt up of unfamiliar stones they fly around seemingly on their own will.<br/>\n<br/>\n<br/>\n<br/>\r\nAnd they will grow stronger and more numerous the farther you progress. <br/>\n<br/>\r\nIf you best all of these enemies and conquer all there is to be conquered but still crave blood, <br/>\n<br/>\r\nThen there is a feature to reset your territory and scale enemy strength while still keeping your technological progression.<br/>\n<br/>\n<br/>\n<br/>\r\nThere is 6 buildings and 12 upgrades to construct for your base.<br/>\n<br/>\r\nYou can use these buildings to help you research technology, create new modules, and gather more resources.<br/>\n<br/>\n<br/>\n<br/>\r\nThis game uses a modular airship construction system. <br/>\n<br/>\r\nYou can use 28 different modules to construct a fantastical airship of your design to eliminate enemies.<br/>\n<br/>\r\nThese modules can reinforce your ships armor or give you powerful buffs at your command.<br/>\n<br/>\n<br/>\n<br/>\r\nIncase you're unsure, there's a demo available.<br/>\n<br/>\r\nI hope you enjoy, regardless.<br/>\n<br/>\n<br/>\n<br/>\r\nI plan on regularly updating this game into the foreseeable future.", "metacritic": null, "released": "2022-04-23", "tba": false, "updated": "2022-06-06T04:20:46", "background_image": "https://media.rawg.io/media/screenshots/c94/c94bd4faa67c8106e37d544bed2d9662.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ATSDev"], "genres": ["Action", "Indie"], "publishers": ["ATSDev"], "esrb_rating": null}