{"id": 776672, "slug": "oxygen-caliber", "name": "Oxygen Caliber", "name_original": "Oxygen Caliber", "description": "Oxygen Caliber is an exciting physics based puzzle game where you traverse the unforgiving void of space.<br/><br/>Your mission is to navigate the galaxy through wormholes! Unfortunately, local clusters of planets stand in your way. Use your wits and a bit of creativity to safely explore the uncharted regions of space!<br/><br/><h3>USE YOUR TOOLS TO TRAVERSE SPACE</h3>Strategically jump from planet to planet with your space age grappling hook! Feeling adventurous? Catch a ride on a wayward meteor!<br/><br/><h3>EXPLORE THE GALAXY</h3>Discover a wide variety of planets, stars, and asteroids! Some want to pull you in, others want to push you away, and some sport some stylish rings! But be careful, some planets are more friendly than others!<h3>EXPERIENCE A UNIQUE COSMIC ATMOSPHERE</h3>Beautiful 2D graphics, outstanding sound design and above all, an atmosphere that’s out of this world!<br/><br/><br/><br/><br/>Oxygen Caliber was created as part of the University of Southern California’s Interactive Design and Production class by developers Robbie Goldberg and Andi Ren, with music by Justin Petrovych. For more information, please visit our publisher page. To learn more about the USC Games program, the #1 Games Program in the world, check out the USC Games website, linked to the right.", "metacritic": null, "released": "2022-04-24", "tba": false, "updated": "2023-05-05T03:05:11", "background_image": "https://media.rawg.io/media/screenshots/ac7/ac7a94820819b94fe3902af4dc971b30.jpg", "website": "https://cinema.usc.edu/interactive/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["RobbieGoldberg", "Andi Ren", "Robbie Goldberg"], "genres": ["Action", "Adventure", "Casual", "Indie", "Platformer"], "publishers": ["USC Games"], "esrb_rating": null}