{"id": 776684, "slug": "pootle-tootle", "name": "Pootle Tootle", "name_original": "Pootle Tootle", "description": "Pootle Tootle\r\nUnder Construction\r\n<p><strong>Pootle Tootle</strong> is a single-player, pixel art retro 2D parkour-platformer for <strong>PC/Linux</strong> where the player, a 'marked' to be recycled computer called <strong>Harddrive</strong>, is in a race against time to escape his own obsolescence through a labyrinth of levels. <strong>Harddrive</strong> must outwit the Recyclopods in a \"fast-paced fever dream of agility and finesse\" (apparently). <strong>Dell</strong>, the robot-courier responsible for delivering <strong>Harddrive</strong> to his fate at the recycling factory, takes pity and tries to help <strong>Harddrive</strong> by leaving floppy disks with special programs to assist him.</p>\r\nSchedule\r\nITERATIONSIZEFOCUSDETAILS1 (DONE)MEDIUMFramework DevelopmentMain Scene, Menu Scene, Game State Machine, Save File, Empty Levels (for testing state transition), Level Info Layer &amp; Level Completion Layer, Pause Menu. <strong>After Iteration 1 an empty shell should be playable with all of the major UI components working</strong>2 (DONE)MEDIUMArt ProductionSprites, Textures, Sound Effects, Level Music 3 (DONE)MEDIUMMain Game Object DevelopmentPlayer Character, HUD, Disk System, Character controller, state machine and scenes, plus scenes and functionality for disk power-up system<br/>4 (DONE)LARGELevel DesignBuild out the first few levels in editor to validate the framework, then sit down with pen and paper and design 10 to 15 levels to introduce all of the game mechanics.<br/>5 (IN PROGRESS)LARGELevel Design / Enemy Characters<p>Complete designed levels in editor and develop Enemy characters in line with introducing them into the levels they feature in.<br/>Actually make the first 10 original level ideas.</p>6MEDIUMTesting / Bug FixesFinalise Project, Run play tests, fixing any bugs and reporting on enhancements made through play testing7MEDIUMSpit &amp; PolishRework of any really bad/unfinished ideas, animations, logic, sprites etc.<br/>8EXTRA LARGERedo EverythingRework of initial prototype levels, Attach loading, disk swapping, memory usage and in-game UI  aesthetics, Leaderboard, Settings page, Plan next block of levels<br/>", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2022-04-29T08:22:14", "background_image": "https://media.rawg.io/media/screenshots/551/5517569cb0213b561821d6581eaa33cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["anycode"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}