{"id": 776730, "slug": "fnf-rulay", "name": "FnF Rulay", "name_original": "FnF Rulay", "description": "<p>FnF Rulay is a cross-over with La Ganga, a new Latin Trap music group.<br/></p>\n<p>This project is more of a promo game than a mod. I built it from scratch using Unity so don't expect it to play as good as the original fnf  <em>:/     (og fnf is a master piece!!!)</em><br/></p>\n<p><em>(Theres only 1 playable song here (Rulay) and its 3.2 minutes long)</em><br/></p>\n<p>This game was supposed to release on mobile platforms only.... but yeah things didn't go so well and we wanted to give iOS users a backdoor to play this. SO NOW ITS ON PC BROWSERS!!! HOORAY!!</p>\n<p>The game is buggy on the browser so if ya have an android go get it on google play!!  This was a fun project to work on. Hope ya'll stick around till the end and watch those credits roll / play that secrete game mode, I'd appreciate it!</p>\n<p>Also for anyone who likes <strong>FREE</strong> stuff check the link below, I've made the art assets I created for this project free to download. Use it however you want!<br/></p>\n<p><strong><em>Thanks for reading! (if ya did... if not its cool. *T-T*) happy gaming!</em></strong><br/></p>\n<p><strong>[CONTROLS]</strong></p>\n<p>Enter - Menu/Confirm <br/>Arrow Keys - Controls Arrows <br/>RMB - For menu clicks<br/><em>*Touch Screen compatible*</em><br/><br/></p>\n<p><strong>[KNOWN BUGS]<br/></strong>- Audio resets when game is paused <em>(restart the scene in pause menu to fix)<br/></em>- Having to press enter twice during the performance mode unlocked prompts<br/><strong>[FREEBIES]</strong></p>\n\r\nDownload the hi res project files!<br/>", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2022-04-29T08:40:22", "background_image": "https://media.rawg.io/media/screenshots/aa1/aa1607c3d8ac76ee93d777be24e0e3b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Crisos"], "genres": [], "publishers": [], "esrb_rating": null}