{"id": 77676, "slug": "masha-and-the-bear-art-games", "name": "Masha and the Bear: Art Games", "name_original": "Masha and the Bear: Art Games", "description": "How to combine love for drawing and the cartoon \"Masha and the Bear\"? Only with the new, most picturesque of all beautiful games - \"Masha and the Bear: Coloring Games for all\"!<br/> <br/>Let's paint this wonderful world! Together!<br/>- huge number of pictures for coloring<br/>- original voice acting from the cartoon<br/>- game in both coloring and free modes<br/>- large selection of tools for drawing and a real space for imagination<br/>- 5 albums for coloring with pictures from the most popular series<br/> <br/>\"I hadn’t painted something for a long time\" - said Masha, suddenly she got carried away and began to create masterpieces better that Picasso! :) A game that not only enthralls, but also develops imagination and fantasy, revealing the child's creative potential!<br/> <br/>Add life to pictures from the cartoon \"Masha and the Bear\", paint them with all the colors of the rainbow, you have magic brushes and many other tools – so everything is possible in this game! In addition to the usual tools like filling, there is a rainbow brush that draws with several colors at once, a magic pencil that can mix colors and weapon of true wizard - a magic wand that turns the picture into a genuine masterpiece of art!<br/> <br/>5 albums (with 10 coloring pages in each) of the most beloved episodes of \"Masha and the Bear\", as well as free drawing mode will enthrall your child for a long time. In addition, the results of his work can be easily shared with friends via social networks or simply by saving the picture on the phone.<br/> <br/>Due to the simple and intuitive interface even the small you will be able to play \"Masha and the Bear: coloring games for all\"! Moreover, Masha herself will describe the tools and names the colors with original and exclusive voice-over!<br/> <br/>A bit older you will also be able to show their talents and enjoy the game, mixing colors and painting in water-colors like real artist!  As for the most creative natures there is a special mode of free drawing - blank canvas, a lot of tools and boundless possibilities for creation!<br/> <br/>It is very easy to play and develop with Indigo Kids!<br/> <br/>Contact us:<br/>E-mail: support@indigokidsgames.com<br/>Website: http://indigokidsgames.com<br/>Facebook: https://www.facebook.com/IndigoKidsCom/", "metacritic": null, "released": "2017-11-22", "tba": false, "updated": "2019-10-22T14:23:18", "background_image": "https://media.rawg.io/media/screenshots/246/246375d3a6c0fd5210b5e456ec9d92e1.jpg", "website": "http://indigokidsgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Indigo Kids"], "genres": ["Family"], "publishers": ["INDIGO KIDS"], "esrb_rating": "Everyone 10+"}