{"id": 776777, "slug": "hidden-object-game-free-mystery-place", "name": "Hidden Object Game Free: Mystery Place", "name_original": "Hidden Object Game Free: Mystery Place", "description": "Hidden Object Game Free : Mystery Place\r\n<p>App Invent presents another wonderful hidden object game Offline. All you need to do is concentrate on objects listed and find objects from beautiful scenes. Be ready to face the real challenge of finding hidden objects and give a complete home makeover to mystery places. Our unique hidden objects story offers you a chance to find a hidden object and enjoy the wonders of the mystery places! If you like solving mystery cases and looking for hidden object games, you're at the right place!</p>\n<p><strong>Features:</strong> </p>\n<ul><li> Hidden object game Many levels!\r\n</li><li>More than 10000 hidden objects to find in this mystery world!\r\n</li><li>Zoom in-out to find the precise hidden object\r\n</li><li>No Internet connection required to play!\r\n</li><li>Free hidden object game!\r\n</li><li>High-resolution graphics!\r\n</li><li>Hidden Object scenes change every time you play!\r\n</li><li>Unique locations\r\n</li><li>Hints Available!\r\n</li><li>This hidden objects game is fun to play with amazing sound effects\r\n</li><li>More than 100000 hidden objects to find and 25000 levels inside this game\r\n</li><li>Amazing graphics environment\r\n</li><li>Collect the maximum amount of points and beat the clock\r\n</li><li>Classic Find the difference puzzle game\r\n</li></ul>\n<p>Play best hidden object games inside this awesome hidden objects bunch. Why are you looking for free online hidden objects puzzles game? Here you can play with hidden object games offline! Yeah, Download this free hidden object games on your tablet and phone...Hidden object games are one of the most played games online and offline. All you need to do is concentrate on objects listed and find objects from the list.\r\n</p>\n<p><strong>How to Play:</strong>\n</p>\n<ul><li>Look carefully at each screen and try to locate items on the list.\r\n</li><li>Tap an item to collect it. Work fast for a better score!\r\n</li><li>If you're stuck, you can use Three types of hints to help you out\r\n</li></ul>\n<p>Play this outstanding and brand new hidden object and be top rated investigator. Download this hidden object free game for endless fun with your friends and family! Download For Free!!</p>", "metacritic": null, "released": "2022-04-28", "tba": false, "updated": "2022-04-29T09:00:58", "background_image": "https://media.rawg.io/media/screenshots/78d/78dd0626a6d573d56b8d4fbb95674bad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Islasmeth"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}