{"id": 776987, "slug": "days-in-the-life-of-mental-illness-singaporean-edi", "name": "Days in the Life of Mental Illness - Singaporean Edition", "name_original": "Days in the Life of Mental Illness - Singaporean Edition", "description": "<p><strong>Subtitle: </strong>Experiencing life through the eyes of someone with mental health issues, in a Singaporean context<br/></p>\n\n<p><strong>Central Aims:</strong>\r\nOur idea aims to explore mental illness in a Singaporean societal context. We seek to bring awareness on the general issues faced by people suffering from mental illnesses, providing insight into their personal experiences. We also wish to highlight and comment on certain challenges and problems faced that may be more unique in nature due to the Singaporean society as an environment. These include: <br/></p>\n<ul><li>Generational thinking\r\n</li><li>Workplace culture<br/>\n</li><li>Medical/insurance policies\r\n</li></ul>\n<p>Our target audience is the general public - anyone who would be capable of understanding and empathizing with experiences and issues pertaining to mental illnesses. 16 years of age and above would be a good age recommendation, although younger audiences are welcome if they are able to comprehend and take away the key ideas.</p>\n<p>In our creative project, players will explore and interact with parts of a home through the lens of a person with mental illness. Through these interactions, commentary from the character will be present, providing insight into their everyday life and personal thoughts. revealing commentary from the character. Certain aspects may strike a familiar chord in the Singaporean way of living. <br/></p>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2022-04-29T10:29:38", "background_image": "https://media.rawg.io/media/screenshots/524/524a50f4575cbd43cd7f18f3f7f62190.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["luoyuxuan"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}