{"id": 776960, "slug": "kaibutsu-another-world-flashcards-prototype-2", "name": "Kaibutsu: Another World - Flashcards Prototype #2", "name_original": "Kaibutsu: Another World - Flashcards Prototype #2", "description": "<p>Developed by Scott McKie of Belief Engine</p>\r\n\r\n\r\nGAME02: Spaced Repetition Prototype\r\n<p><strong>Kaibutsu: Another World</strong> is an in-development Japanese learning game. This is the <strong>SECOND</strong> in a series of small prototypes being developed to get the hang of working in the Defold engine, and get a head-start on some of the minigames that will be available in the larger game. (Check out the 1st Prototype Here)</p>\n<p>This second prototype continues more with the flashcard game mechanics, but now introduces a <strong>Spaced Repetition System</strong>, or SRS for short. SRS is a scientifically proven method for learning and easier memory retention, while minimizing unnecessary revision. If you've ever used Anki, or Duolingo, you've experienced this sort of mechanic in action.</p>\n<p><em>(As an important side-note, if you're currently not studying Japanese, you may not get much out of this in it's current state.)</em>\n</p>\r\nInstructions\r\n<ul><li>This second prototype lets you review the kanji. The lessons are broken up according to James W. Heisig's book, Remembering the Kanji, which I highly  recommend for anyone studying kanji.</li><li>Pick a lesson from the list &amp; review the cards.</li><li>The SRS system will do its magic &amp; pick a due date for the card based on whether you got it right.</li><li>Return to review your cards the following day.</li><li>Whenever you're comfortable, pick a new lesson to study &amp; it'll add those cards to your review.</li><li>The arrow buttons at the bottom let you cheat! They change the prototype's \"current time\", which let you skip ahead a few minutes or a day to see how many cards you will have due, or review early.</li></ul>\r\nControls\r\n<ul><li>Mouse is required.\r\n</li><li>You can also press Space to continue to the next question / skip a question.\r\n</li></ul>\r\nSome Background For\r\nKaibutsu: Another World\r\n<p>I've been learning Japanese on my own for a little while now, and have tried out several different methods. All have their pros and cons, but trying to use multiple methods at the same time has proven incredibly unwieldy. Additionally, different methods progress at different rates or have different lesson plans, so doing 2 lessons concurrently leads to a lot of wasted effort.\r\n</p>\n<p>I've tried some games to help me study hiragana &amp; katakana, and those were great. But after graduating from that, the game space for language learning dried up. There are some interesting games out there, but they didn't quite click for me as they tended to be somewhat superficial- only focusing on a small aspect like simply teaching you vocabulary. They tend to also stick pretty closely to \"traditional\" Japanese-as-a-second-language education, while there's some pretty excellent literature out there on better ways to approach language acquisition and make it stick.\r\n</p>\r\nThe Refold System\r\n<p>In devising my own lesson plans, which I'm implementing in the game, the biggest source of inspiration is the <strong>Refold</strong> system of language study (which is an evolution of the <strong>Mass Immersion Approach </strong>to learning a new language). Refold mirrors a lot of what I'd been reading about Stephen Krashen's research into language acquisition.\r\n</p>\n<p>The core guiding philosophy of Refold is <strong>immersion in the language</strong>: where you can learn a language much faster and easier if you are constantly surrounded by it (usually live in the land using it) and are required to adapt to it, versus trying to practice it in isolation.\r\n</p>\n<p>While myself or most anyone can't quite pack up casually and move to Japan, I'm aiming to build a game with all its design around this philosophy, and push the learning language games field forward.\r\n</p>\n<p>And finally, just the act of having to research and verify the language to use it properly in this game has been a helpful exercise in retaining what I've learned so far. \r\n</p>\r\nSign up for more upcoming Prototypes and development news\r\n<p>Please feel free to leave comments and feedback!\r\nOr reach out to me at Belief Engine.\r\n</p>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2022-04-29T10:17:00", "background_image": "https://media.rawg.io/media/screenshots/550/5507bd986343606089d761babf010ca0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Belief Engine"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}