{"id": 77691, "slug": "hot-chariot", "name": "Hot Chariot", "name_original": "Hot Chariot", "description": "Steady, we can win!<br/>No guns, no guns, enemies to help us. Start only a cannon, equipment depends on the build, this Sunday you are free, please eat chicken at night<br/>New 3D hand tour chariot Battle Royale, hot listing.<br/>There is no need to push the tower, playing off all enemies is the only goal. To that is so cool, upgrade your chariot, we allow you in the hail of bullets in a wave of waves, no teammates call you, my mother no longer worry I met you 3 brother.<br/><br/>Game features:<br/>1. real-time multiplayer war, 360 degrees free operation, the old driver win<br/>2. Provide man-to-action and qualifying, so you can practice your skills in a place without a network<br/>3. A variety of career options, a variety of attributes can be upgraded, the perfect property and professional match can be victorious<br/>4. More than 30 kinds of fun and interesting free skin, such as take-away delivery car, the legendary Wuling Hongguang, and pull the garbage cleaning truck. The The More aircraft carriers, flying saucers, rover such a high-tech. Through the task you can have them free of charge, no recharge.<br/>5. Provide a variety of glory lists such as kill rankings, winning rankings, MVP rankings and points ranking<br/>6. More content waiting for you to dig, yes, free to provide excavator skin.<br/><br/>Well, this classmate, please start your performance", "metacritic": null, "released": "2017-09-19", "tba": false, "updated": "2019-07-29T23:21:14", "background_image": "https://media.rawg.io/media/screenshots/409/4097ae196c7b09d2143f1482a27bf0b4.jpg", "website": "http://www.var3d.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yu Feng"], "genres": ["RPG", "Sports"], "publishers": ["Yu Feng"], "esrb_rating": null}