{"id": 7769, "slug": "broken-sword-ii-the-smoking-mirror", "name": "Broken Sword 2 - The Smoking Mirror (Remastered)", "name_original": "Broken Sword 2 - The Smoking Mirror (Remastered)", "description": "<p>Direct sequel in story, genre and art style, Broken Sword 2 – the Smoking Mirror: Remastered is a remake of 2010 release that takes place 6 months after the events of the first game, where George Stobbart and Nicole Collard visit an archeologist to gather information on the mystery Mayan stone Nicole found while working on a news story. But they’re ambushed and separated, and now George has to escape the burning building, reunite with Nicole and uncover the secrets of a Mayan stone, leading to a lost temple.<br />\nThe game is played like any other point-and-click adventure, where the player controls the characters and interacts with the environments through the mouse clicks, or in case of a PlayStation release through the controller. The game has over 60 characters player can interact with unique voice lines regarding every game item players can get in their inventory. Remastered edition replaced pixelated backgrounds with more detailed ones, fixed the quality of FMV’s and general audio and added fully animated facial features.</p>", "metacritic": null, "released": "2009-12-02", "tba": false, "updated": "2024-01-19T13:14:35", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bc5be3c955655e4ae46dee83f5217e5.jpg", "website": "", "rating": 4.02, "rating_top": 5, "added_by_status": {"yet": 94, "owned": 1405, "beaten": 119, "toplay": 19, "dropped": 21, "playing": 3}, "playtime": 1, "achievements_count": 11, "ratings_count": 138, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 139, "platforms": ["Android", "Linux", "macOS", "PC", "iOS"], "developers": ["Revolution Software"], "genres": ["Adventure", "Puzzle"], "publishers": ["Kalypso Media", "Virgin Interactive", "Revolution Software", "SCEE", "Crave Entertainment"], "esrb_rating": null}