{"id": 777270, "slug": "super-commando-1997-dos-game-canceled-prototype", "name": "Super Commando (1997 DOS game) Canceled Prototype", "name_original": "Super Commando (1997 DOS game) Canceled Prototype", "description": "<p><strong>\"Super Commando\"</strong> is a side scroller platform adventure game made in DOS and released in 1997. Very rare pixel art game with influences from the classic Shinobi. Made with photographs of real people, in the same style used in \"Mortal Kombat\".\r\n</p>\n<p>Doxbox version optimized to run on current computers.</p>\n<p>Super Commando game, created by Dimitri Kozma in 1997 when he was a teenager.</p>\n<p>Thanks: Roberto Hypólito Braga Caldeira who configured the dosbox installer to run the game on current computers.</p>\n<p>ATTENTION: This game has never been finished, but it has many completed stages and can be played fully until the end of the \"jet pack\" stage.</p>\n<p><strong><em>PORTUGUÊS:</em></strong></p>\n<p><strong>\"Super Commando\"</strong> é um jogo de aventura e plataforma side scroller feito em DOS e lançado em 1997. Jogo muito raro em pixel arte com influências do clássico Shinobi. Feito com fotografias de pessoas reais, no mesmo estilo usado em \"Mortal Kombat\".</p>\n<p>Versão em Doxbox otimizada para rodar em computadores atuais.</p>\n<p>Jogo Super Commando, criado por Dimitri Kozma em 1997, quando ele era adolescente. </p>\n<p>Agradecimento: Roberto Hypólito Braga Caldeira que configurou o instalador do dosbox para rodar o jogo nos computadores atuais.</p>\n<p>ATENÇÃO: Este jogo nunca foi finalizado, mas tem muitas fases completas e pode ser jogado totalmente até o término da fase do \"jet pack\"</p>", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2022-04-29T12:34:38", "background_image": "https://media.rawg.io/media/screenshots/d61/d61bc23996aa4fbf335b220bac965146.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dimitri Kozma"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}