{"id": 777215, "slug": "vr-visit", "name": "VR Visit", "name_original": "VR Visit", "description": "Gameplay\r\n<p><em>VR Visit </em>est un jeu sérieux projetant l'utilisateur au sein de l'époque médiévale. Il est possible de se balader librement dans un château et sa cour, ainsi que dans un petit village externe.</p>\n<p>De nombreux personnages non-joueurs présents sur place vous donneront des indications sur les lieux et vous expliqueront les activités que vous pouvez réalisées : en effet, mettez-vous dans la peau d'un chevalier en vous entraînant contre un mannequin en bois, en visant des cibles avec votre arc, ou encore en combattant votre adversaire dans une épreuve de joute intense !<br/></p>\r\nDéplacements\r\n<p>Vous pouvez vous déplacer dans le monde virtuel grâce à un mécanisme de téléportation. Pour cela, activez la téléportation grâce au bouton primaire de la main droite, visez l'endroit désiré puis appuyez de nouveau sur le bouton primaire afin de confirmer la téléportation. Si vous souhaitez annuler cette dernière, appuyez simplement sur le bouton secondaire de la main droite.<br/></p>\r\nContrôles\r\n<ul><li><strong>Interaction avec les interfaces et les personnages non-joueurs </strong>: gâchette située sur l'index (sur n'importe quelle main)</li></ul>\n<ul><li><strong>Saisie des objets du monde </strong>: gâchette située sur le majeur (sur n'importe quelle main)</li></ul>\n<ul><li><strong>Téléportation </strong>:<ul><li>Activation / Confirmation : Bouton primaire de la main droite</li><li>Annulation : Bouton secondaire de la main droite</li></ul></li></ul>\r\nContexte\r\n<p>Ce jeu sérieux a été développé dans le cadre du cours <em>8INF849 - Interaction 3D et Réalité virtuelle </em>à l'Université du Québec à Chicoutimi, pendant la session d'hiver 2022. Les membres du groupe ayant contribué au projet sont :</p>\n<ul><li>Corentin AMARGER</li><li>Jules HERY</li><li>Abir LOUARD</li><li>Killian OECHSLIN</li></ul>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2022-04-29T12:09:26", "background_image": "https://media.rawg.io/media/screenshots/1cd/1cd7ad663d1d06b4c9394a8077b0570e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["koechslin"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}