{"id": 777302, "slug": "grandmasters-revenge", "name": "Grandmaster's Revenge", "name_original": "Grandmaster's Revenge", "description": "Black hordes are in a hurry to desecrate the remnants of Whitehills and turn everything into a gloomy land, where there will be no place for bright colors and other values.<br/>Grandmaster Bor does not agree with this, who calls on the help of the inhabitants of Whitehills epic heroes of singles. These heroes have the stamina of elephants, one-hit death, regenerate like vampires, and take on the form of defeated foes as mimics.<br/>Your role is to guide such heroes in battles and choose the best strategy for defeating the forces of the Horde.<br/><br/><br/>- Turn-based tactical battles where hordes of enemies each time use a variety of battle formations. A curious mixture of the use of simplified chess rules tactics and various skill bonuses available only to heroes.<br/><br/>- there will be a lot to do. You will either have to go on a decisive Assault, or retreat in search of a safe haven in order to save the accumulated resources and the life of the hero. Either manage the Citadel, or choose the direction of the main attack on the campaign map. Gather resources from subordinate domains or solve a variety of puzzles that have multiple solutions.<br/><br/>- when attacking enemy territories, try to complete the tasks that are constantly given by the Administration of the Whitehills Citadel. As a reward, you will receive Glory Points that can be used at the Merchant. The Merchant will help you recruit new chess clans. The chess clan selected as a priority will give the heroes an additional special advantage in battles.<br/><br/>- a large arsenal of various skill bonuses available only to epic heroes makes them even stronger. The effectiveness of skills depends very much on the time and place of their application. A well-applied bonus can come in handy in almost hopeless situations or radically change the course of a battle. Experience and skill matter more than blind chance.<br/><br/><br/>- do not forget to develop the Citadel, the capital of Whitehills, in which more then ten most important buildings are located. All of them can be improved many times over. Each improvement has a significant impact on the effectiveness of the heroes in battles and the ease of passing the Campaign. Until a complete victory in the campaign, all buildings cannot be improved. It is up to the Ruler to decide which upgrades to the Citadel's buildings best fit his victory strategy.<br/><br/>- even at night, the capital of Whitehills cannot be completely safe. Constant Sabotage will be a problem until victory. To develop Counterintelligence and put up new barriers for enemy saboteurs to enter the city or solve puzzles where there is no room for error, and then, with the help of the Inquisition, take away valuable resources from captured enemies, again, the Ruler decides.<br/><br/>- as the heroes progress, more commoners will decide to become Copycats. Imitators seek out the remnants of enemy units in the liberated territories and destroy the leaders so that the rest of the enemies scatter in a panic.<br/><br/><br/>- the style of passing the Campaign depends on the preferences of the Ruler. You can rush into the most dangerous fights with little preparation, but victory will be a great test of luck, intelligence, and sometimes the reaction of the Ruler and will require a lot of effort. And you can start with simple tasks to accumulate resources, develop the Citadel and call on the help of the Copycats, who will make a significant contribution to the victory over the Horde.<br/><br/>- control over key areas of the global map - clan domains, among which are: Academies, Castles and Obelisks, provides a periodic influx of various resources. All resources are very important for the economy of Whitehills. Spend the resources you earn after receiving and you will become an even greater threat to the Horde.<br/><br/>- destroy the most powerful figures of the Black Horde - queens, who are always armed with smashing two-handed swords and get Revelations. With the help of the received Revelations and archivist Agnotius, you will be able to restore the frescoes in the Temple of the Grandmaster and learn the background of this conflict and possibly other secrets.<br/><br/>- The more successful you become in the fight against the Black Horde, the more dangerous surprises you will meet on your way. Various game situations will constantly alternate making each battle special. There are already nine special game situations in the game: Ambushes, Spellcasters, Psychic Attacks, Warlocks, Acid Rains, Specials, Caches, Obstacles and Hostages.<br/><br/>- Numerous advisors will guide you through the story and help you understand the details of the war for Belogorye. Support and help in difficult times. Each passage of the Campaign will develop somewhat differently.<br/><br/>- pleasant melodies of Whitehills from glorious minstrels will help you immerse yourself in the atmosphere of the world of the Battle of Grandmasters even better.<br/><br/><br/>In the process of working on the game, We aimed to create a game \"for more than one evening\", which will give players a varied and enjoyable gaming experience. New mechanics are revealed gradually as you progress through the main Campaign. We have provided several different ways to learn including a full-fledged educational campaign, Bonusopedia, the storyteller Agnotius and others.<br/>We hope you enjoy playing this small but deep game.<br/>", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2023-12-18T07:07:54", "background_image": "https://media.rawg.io/media/screenshots/bab/bab2f2c265225ef7ca02283308bfe3ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nick_Ryz", "Nick Ryz"], "genres": ["Action", "Strategy", "Puzzle"], "publishers": ["Niryz Games"], "esrb_rating": null}