{"id": 777322, "slug": "drawings", "name": "dRAWings", "name_original": "dRAWings", "description": "<p>Game developed for the GameDev.js Jam 2022 (Sadly it didn't get deployed correctly on time)</p>\n<p>Hey guys, you won't believe what happened!</p>\n<p>My friend and I were designing our game for this Jam (Our first game, we kinda suck), so we drew a couple levels on a sketchbook, with pencil, a raw design really, not much, we were just making a rough sketch of what we had in mind.. Anyway, after long days and nights full of coffee and time-wasting on HBO, we realized we weren't gonna make it on time, so we just gave up. A couple days later, something amazing happened! We opened our sketchbook to say goodbye to our drawings and... our game was alive! We're completely clueless on what might have happened or what kind of magic intervened, it's kind of creepy if you think about it, but it works! Our raw design came to life!<br/>\n</p>\n<p>\n</p>\n<p>We hope you enjoy it.\r\n</p>\n<p>\n</p>\n<p>PS: Should you find any bugs, it's the magic's fault, we just drew stuff on a paper.\r\n</p>\n\n<p>Hi everyone, thank you all for playing!</p>\n<p>Our game represents the concept of 'RAW' by being a literal playable raw design. The very first stage on game development, at least for us, is sketching the idea on paper. From there, we developed the game and respected the original drawings, we didn't beautify anything, every single thing in the game was hand-drawn and not changed afterwards. We also composed and recorded the music ourselves.\r\n</p>\n<p>\n</p>\n<p>Created by:<br/>-LaRemolacha (GitHub: am-camila)<br/>-valentindri (GitHub: valentindri)\r\n</p>", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2022-04-29T12:58:13", "background_image": "https://media.rawg.io/media/screenshots/cf3/cf3ed9d86c3b0cf655fda3a5498a23e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["valentindri", "LaRemolacha"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}