{"id": 777438, "slug": "golem-caves", "name": "Golem Caves", "name_original": "Golem Caves", "description": "<p>Venture into a cave guarded by many golems, and try to mine as many raw ores as possible. If you leave the cave alive, you'll double your score! Compete with other players using your NEAR account, and win limited-time golden pickaxes for being the top daily scorer (Rewards feature unfinished).<br/></p>\n<p>Hosted using 4Everland. To play with decentralized features, go here: https://golem-caves.4everland.app/<br/></p>\n<p>Made using https://github.com/svntax/godot-near-sdk<br/></p>\n<p>Controls:</p>\n<ul><li>Arrow keys to move</li><li>Z/C to use your pickaxe</li><li>Golems can take damage from your pickaxe, but you will die from a single hit.</li></ul>\n<p>Decentralized Notes:<br/></p>\n<ul><li>NEAR: The game communicates with a NEAR smart contract that stores the daily high scores of the top 10 players. Since the cave generation is seed-based, you can pick challenge mode, which uses the seed from the contract rather than a random seed. The idea here is that, at the end of each day, the high scores reset and a new seed is generated, but I couldn't get a daily task scheduling to work in time for this.</li></ul>\n<ul><li>IPFS: The idea behind the high scores is to award golden pickaxe NFT's to the top scorers of the day. There are 10 golden pickaxe NFT's currently, with their media link hosted using https://nft.storage, but I couldn't get the rewards contract to work in time, so the only way to get them is by manual transfer rather than an automated process. If you have the NFT, your pickaxe becomes a golden pickaxe rather than a stone pickaxe.</li></ul>", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2022-04-29T13:55:51", "background_image": "https://media.rawg.io/media/screenshots/d21/d216f05273517928c93990094ddef3db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["svntax"], "genres": [], "publishers": [], "esrb_rating": null}