{"id": 777519, "slug": "bus-simulator-indonesia", "name": "Bus Simulator Indonesia", "name_original": "Bus Simulator Indonesia", "description": "<p>Bus Simulator Indonesia (alias BUSSID) akan membawa kamu merasakan keseruan, suka, dan duka menjadi seorang sopir bus di Indonesia. BUSSID mungkin bukan yang pertama, tapi merupakan satu-satunya game simulator bus dengan fitur terlengkap (ada klakson om telolet om juga lho!) dan rasa paling Indonesia.<br/><br/>Berikut adalah fitur-fitur andalan Bus Simulator Indonesia:<br/><br/>- Desain livery kamu sendiri<br/>- Kontrol yang mudah dan elegan<br/>- Lingkungan dan kota-kota lokal asli Indonesia<br/>- Bus-bus asli Indonesia<br/>- Klakson bus telolet<br/>- Om Telolet Om<br/>- Kualitas grafis yang detil<br/>- Tidak ada banner iklan yang menutupi area berkendara<br/>- Data permainan tersimpan secara online dan otomatis<br/>- Sistem leaderboard<br/>- Mod kendaraan<br/>- Main bersama dengan mode konvoi online multiplayer<br/><br/>Hadir-nya Bus Simulator Indonesia di tahun 2017 ini hanyalah awal dari perjalanan panjang kami untuk menghadirkan permainan simulator bus Indonesia terbaik, yang dapat kita semua banggakan bersama. Dan yang paling penting adalah, kami Tim BUSSID berkomitmen untuk akan selalu mendengar masukan pemain dan akan selalu mengembangkan game ini untuk menjadi lebih baik dengan fitur-fitur yang semakin lengkap!<br/><br/>Tunggu apalagi, download dan mainkan game Bus Simulator Indonesia sekarang juga!<br/><br/>Emoji icons provided free by emojione.com.</p>", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2022-04-29T14:31:08", "background_image": "https://media.rawg.io/media/screenshots/6e8/6e8e4d2925e0cf52c8c754ac98b13933.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MX Development.Inc"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}