{"id": 777514, "slug": "super-simple-salad-simulator", "name": "Super Simple Salad Simulator", "name_original": "Super Simple Salad Simulator", "description": "<p>It's springtime again, which means one thing: it's time for my favorite salad! The French call it the Russian salad, the Russians call it the Olivier salad, and the Croats and Slovenians call it the French salad. It's called the Italian salad if you're in Denmark, and the potato salad in Czechia and Slovakia. But here in Poland it's known under the simple name of <em>sałatka jarzynowa</em>, the vegetable salad.</p>\n<p>Discover the (simplified) recipe and design the process of preparing the ingredients! You can cook them, peel them and cut them into slices, but not all ingredients require all forms of processing. <em>Super Simple Salad Simulation</em> is a sandbox simulation game and a hommage to The Incredible Machine.</p>\n<p>You can also use the menu in the top-right corner to control and adjust the parameters of the simulation. Have you ever made a salad in low-gravity environment? Ever made a salad from 10,000 potatoes? Here's you chance to make your dreams finally come true.</p>\n<p>Due to the Real Life™️ intervening, the game doesn't have a proper ending. Just try to collect all ingredients into the red bowl. Drag and drop the wooden plans to direct the stream of ingredients, rotate all utensils by scrolling with the mouse wheel over them.</p>\n<p><em>Super Simple Salad Simulation </em>is a submission to Gamedev.js Jam 2022. The theme was 'Raw.' My goal was to make an open-ended playground game where you can experiment with different designs and see how they perform with different settings. I've had the most fun reducing the interval of spawning the ingredients and seeing the screen fill up with thousands of raw and processed food items.<br/></p>\r\nControls\r\n<ul><li>Mouse over utensils: <strong>grab to move, scroll to rotate</strong>.</li><li>Mouse over the background: <strong>grab to pan, scroll to zoom</strong>.</li><li>(Touch is not supported at this time, but I'll try to add it after the jam.)</li><li>Adjust the simulation parameters in the top-right corner.</li></ul>\r\nKnown Issues\r\n<ul><li>The pot with the boiling water doesn't have a proper exit. Cooked food just falls down from its bottom.</li><li>I didn't know how to visually mark cooked food, so I added a slight halo around them. Ideally, smoke particles could work, but I didn't have time to implement them.</li><li>The physics can be quirky. It's my custom engine with sphere vs. capsule collisions, which I'd love to improve in the future.</li><li><strong>WARNING: the game may hang your tab if there are too many things flying around.</strong><br/>\n</li></ul>", "metacritic": null, "released": "2022-04-26", "tba": false, "updated": "2022-04-29T14:28:13", "background_image": "https://media.rawg.io/media/screenshots/528/528fb5db0ae5f42dd4db75037fb8fca7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["stas"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}