{"id": 777737, "slug": "fck-fairy-godmothers", "name": "F*ck Fairy Godmothers", "name_original": "F*ck Fairy Godmothers", "description": "<p>\"You and your friends are stuck in a Fairy Tale being directed by an Eldritch being only known as, the Fairy Godmother. Why are you smiling, don't you know how much danger you're in? This isn't a pastel world, mass produced by a mouse in red shorts! People get ruined in actual Fairy Tales: turned into sea foam, fall from towers, are blinded by thorns, beaten, tortured, and stoned! Now some of that isn't as easy for a Fairy Godmother to pull off anymore, the times have changed and it's harder to make people take the stories to some of those extremes, but don't get it twisted. If you aren't careful you and your friends might just be forced into romances you don't want to be in, be robbed of your agency, have a future you don't want forced onto you. However, all hope isn't lost. There are others in this fight that aren't too fond of Fairy Godmothers, and they've decided to help you, but they can't do it for you. Fight for your independence from the societal norms that the Fairy Godmother is trying to force on you, Fight for your ability to make your own future.\"</p>\n<p>Fuck Fairy Godmothers is a Caltrop Core based system where you and a group of friends (designed for 4 players plus a godmother) get to break the bonds of societal norms and the fairy tale life by saying \"Fuck Fairy Godmothers!\"\r\n</p>\n<p>In this, one person will play the Godmother while the others play a group of characters with a variety of talents and motivations. The players will try to regain their control over their own story while the Godmother continues to try and take hold! It is played in scene sets where players will roleplay out scenes while the Fairy Godmother tries to run and ruin the players lives by making them fit into the \"Happily Ever After\" mold. The game ends when either all the players lose their power to fight the Fairy Godmother or the Fairy Godmother no longer has control over the players stories and lives.\r\n</p>", "metacritic": null, "released": "2022-04-25", "tba": false, "updated": "2022-04-29T16:09:38", "background_image": "https://media.rawg.io/media/screenshots/11a/11ad128f3bc94879c2f78c0e5006f380.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lost Guide"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}