{"id": 7777, "slug": "fingerzilla", "name": "Fingerzilla", "name_original": "Fingerzilla", "description": "Fingerzilla is a fast-paced, explosive game of utter destruction. Using your own finger(zilla), rain fiery chaos down upon buildings, cars, and people. The interface is simple, but the joy of squashing your boss is priceless!<br/><br/>We just had our 4 MILLIONTH player download the game! Download Fingerzilla yourself for:<br/><br/>- Retina graphics! All buildings, victims, and landscapes have been lovingly rendered in high-res for you to destroy. We also have all-new victims to squish!<br/><br/>- Multiplayer Support!<br/>Play head-to-head against friends over Wi-Fi or Bluetooth. Any map you've unlocked can be played head-to-head, plus we have a new set of Multiplayer maps with modified rules and visuals!<br/><br/>- Gameplay Boosts!<br/>We've added over a dozen boosts to take your gameplay to the next level. Extend mission times for extra smashing power; spill out more people to squish; add unique and named buildings with special abilities, and a bunch more!<br/><br/>- Collections!<br/>All buildings now have a chance to spit out collectible items (like a soda bottle or an SUV). Collect these and trade them in for bonus score, free tokens, and free boosts!<br/> <br/>- Universal App -- Fingerzilla runs on the iPad, and displays the full Retina graphics as well!<br/><br/>- New Levels -- new places to destroy, and new unique building variations to crush.<br/><br/>- Mini-Games &amp; Bonus Missions -- Play \"Fingers vs. Zombies\" or spend time crushing cars on the 101!<br/><br/>- Compete and share with friends -- when your friends play, you'll get a bonus! You'll also see your best score on each level, and scores of other players that you're beating!<br/><br/>- Game Center! Compete with Leaderboards and Achievements versus the world!<br/><br/>- Squish Your Friends!  Turn on the Names Pack, and squish all your Facebook friends, or colleagues from your contacts.<br/><br/>- Game Enhancements -- in addition to the Mutation Pack, you can add bonus-bearing victims, level upgrades, and more!<br/><br/>- Unique buildings and vehicles -- add on skyscrapers, boats, new houses, taxis, city hall, and other buildings, each with unique behavior (factories explode, towers flood out executives, etc.)<br/><br/>- Great performance on all devices -- get 60FPS smooth animation on all recent phones, iPods and tablets, and much better playability even on the original iPhone!<br/><br/>=====<br/><br/>As always, please write us at support@inertsoap.com if you have any problems and we'll get them fixed!", "metacritic": null, "released": "2010-02-13", "tba": false, "updated": "2019-07-30T17:20:17", "background_image": "https://media.rawg.io/media/screenshots/2da/2da9bf70bdae2742fc8d85de18575c35.jpg", "website": "http://www.inertsoap.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Inert Soap", "Thomas Ricket"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Inert Soap", "Thomas Ricket"], "esrb_rating": null}