{"id": 778120, "slug": "triune-legacy", "name": "Triune Legacy", "name_original": "Triune Legacy", "description": "<p>Three heroes from distant lands heed the call of the Triune, and band together to take on the forces of evil threatening the hallowed halls of their ancestors.</p>\n<p>Play alone or with up to 2 other people as you control one of three distinct heroes to  defeat the enemies and fulfill the Triune Legacy.<br/></p>\n<p>This game takes gameplay inspiration from Gauntlet and Trials of Mana, and was created in partnership with the fine folks at HomeTeam GameDev.</p>\n<p>Project developed from December 8 2021 - April 24 2022, with contributions from:</p>\n<p><strong>Tyler Funk</strong><br/>Project lead, core gameplay, network code, player models (including materials and animations for both turtle and hippo), spider enemy, follow AI, stone and brick wall materials, level layouts, torch model, pickup orbs, lighting (baking and volumetric), health/mana functionality, trees, avatar switching, animation blending, water shader, UI, spellcasting, sword, rocks, grass, assorted bug fixing</p>\n<p><strong>Patrick J Thompson</strong><br/>Crate with texture, player control fix, goblin enemy, in-game menus, options menu, menu color adjustments, pause menu</p>\n<p><strong>Andy King</strong><br/>Portal jet effects (with variations), torch flames, shockwave effect with distortion</p>\n<p><strong>Christer \"McFunkypants\" Kaitila</strong><br/>Dungeon pillars and stone walls, spiderwebs, menu and logo improvements, chains, stair fix, crystals, candles with related flame effects, footstep integration</p>\n<p><strong>Luis Montaña</strong><br/>Barrel (model, materials, and two broken variations)</p>\n<p><strong>Rob Tunstall</strong><br/>Heal sound, magic attack sound, melee attack sound</p>\n<p><strong>Michael \"Misha\" Fewkes</strong><br/>Dungeon music</p>\n<p><strong>Stebs</strong><br/>Mute toggle, stone step sound</p>", "metacritic": null, "released": "2022-04-25", "tba": false, "updated": "2022-04-29T19:08:00", "background_image": "https://media.rawg.io/media/screenshots/396/3961ec173643dc523028dcf939ee4350.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 239, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["tfunk"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}