{"id": 778188, "slug": "ci-mo-xi-ren-thorn-demon-hunter", "name": "刺魔猎人THORN DEMON HUNTER", "name_original": "刺魔猎人THORN DEMON HUNTER", "description": "Background story<br/>\r\nThey are neither gods nor demons. They come from people's prayers. They have unimaginable power, but no one knows what their purpose is. Some are willing to save lives, some like killing, and some are like a stone without purpose, but they can't directly enter our world. They will invade someone in spiritual form and come to our world with his body reincarnation.<br/>\r\nYanorek has been helping the Holy Church destroy and investigate the affairs of alien life, but one day his sister Evelyn went to the imperial city to investigate. Evelyn also lost information and disappeared when the maid disappeared. Afterwards, the Holy Church recalled yanorek who went out to the imperial city to investigate, but everything came too suddenly. All the people in the imperial city lost their senses overnight<br/>\r\nbattle<br/>\r\nThe player will play yanorek to investigate the incident in the imperial city and save his sister Evelyn. The character has props and equipment such as medicine bomb and revolver. The player can get props and supplies by destroying the enemy. There is a holy stone tablet in the level, and you can restore life and medicine bottles by praying on the stone tablet.<br/>\r\nGame features<br/>\r\n is an AVG exploration action game. Its story appears in the form of completing a task or solving a puzzle. Players can defeat the enemy and solve one puzzle by using actions such as bomb, revolver, chop and so on.", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-02T03:17:04", "background_image": "https://media.rawg.io/media/screenshots/5f7/5f7a60fbeda8ef3701fe30ff418bd6fc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LIN YUANHUI"], "genres": ["Action", "RPG", "Indie"], "publishers": ["LIN YUANHUI"], "esrb_rating": null}