{"id": 778193, "slug": "dust-a-post-apocalyptic-rpg", "name": "DUST - A Post Apocalyptic RPG", "name_original": "DUST - A Post Apocalyptic RPG", "description": "A survival game with randomly generated events, that will challenge your decision making in each situation. It has been inspired by classic post apocalyptic role playing games such as: Fallout and Wasteland series. Every decision you make in the game has consequences that can result in success or death, both in short term or long term.<br/><br/><strong>FEATURES</strong><br/>- A deep system that us easy to pick up and play, but difficult to master.<br/>- Unlock new character that can be customized to your own personal play style, through: attributes, skills, perks, armor, weapons and other equipment.<br/>- Scavenge and trade equipment, carefully plan what to carry with you when exploring the radioactive wasteland.<br/>- Choose what missions and quest to pursue. Discover valuable information from wasteland dwellers; that helps your survival.<br/>- This apocalyptic radioactive wasteland is unforgiving. Make decisions that will affect your chances to stay alive.<br/>- Discover new settlements, abandoned locations, ancient relics, mutants and monsters that hide the lost post apocalyptic world.<br/>- Experience an atmospheric apocalyptic world; that has an old school gritty environments, accompanied with mastery composed apocalyptic soundtrack.<br/>- The game receives constant updates with new content, expansions, big fixes and balance and it’s easy to get in contact with the developer.", "metacritic": null, "released": "2022-05-01", "tba": false, "updated": "2022-05-02T03:28:51", "background_image": "https://media.rawg.io/media/screenshots/c4e/c4e128c5f3e8b12b24a18b6809104589.jpg", "website": "https://segediinc.com/dust-a-post-apocalyptic-role-playing-game", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Segedi"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["SEGEDI"], "esrb_rating": null}