{"id": 77822, "slug": "jeffy-puppet-sml-adventure", "name": "Jeffy puppet SML adventure", "name_original": "Jeffy puppet SML adventure", "description": "Jeffy Puppet and his best friends Rosalina and Mario-Monster have a great challenge to save the world against the enemies Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby, Britknee and Toad attacking our best forest and jungle .<br/><br/>Jeffy Puppet is a great hero, as he is brave to fight all subway enemies, and these friends Rosalina and Mario-Monster are sick and can not move.<br/><br/>Mario-Monster: best friend of Jeffy Puppet.<br/>Mario-Monster was blasted during previous bouts in the subway against enemies Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby, Britknee and Toad. But he always gives advice to Jeffy Puppet to defend the jungle.<br/><br/>Rosalina: best friend of Jeffy Puppet.<br/>Rosalina was also sick, but her magical strength to know the subways, the jungle to help Jeffy Puppet guide her during her race and heal against enemies Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby, Britknee and Toad.<br/><br/>Jeffy Puppet is a good boy in the world SML to help in this difficult adventure these friends Bowser Junior, Rosalina, Cody and Mario-Monster against enemies Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby Britknee And Toad.<br/><br/><br/>Subway Jeffy Puppet adventure: racing through multiple worlds full of obstacles, subway, dangerous monsters, enemies Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby, Britknee and Toad.<br/><br/>Get ready to test your speed and reflexes! In our best free game Subway Jeffy Puppet adventure<br/><br/><br/> How to play Subway Jeffy Puppet adventure <br/><br/>Use the super acceleration of Jeffy Puppet hero subway and reach speeds of madness and destroy everything happening on your way and subway.<br/>Use the skills of Hero Jeffy Puppet to avoid the dangers, jump on the barriers at full speed. In addition, Jeffy Puppet's remote attack allows you to eliminate your enemies, Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby, Britknee and Toad. And obstacles!<br/>Discover the secrets of subway adventure game Jeffy Puppet superheroes and unlock bonuses and make the most of the game.<br/>Take care of Jeffy Puppet hero in the subway, play, feed, play, avoid enemies, Nancy Jeffy Puppet, Jeffy Puppet The Killer, Loan Dolphin, Nazi Cheeseburger, Charcoal Baby, Britknee and Toad. And obstacles! :)<br/><br/>Addictive stimulating action game awesome!<br/>Amazing graphics, gentle gameplay in order to play this game for hours.<br/>action game will lead you through a series of classic levels.<br/><br/>Go Download this best game Subway Jeffy Puppet adventure now and have fun with your friends in the subway !!<br/><br/><br/>Game Disclaimer Subway Jeffy Puppet adventure <br/>Our application is not official of Jeffy The Puppet, it is only for the purpose of the fans, it is not allowed or created by the original creator.", "metacritic": null, "released": "2017-07-17", "tba": false, "updated": "2019-10-22T13:54:27", "background_image": "https://media.rawg.io/media/screenshots/e0b/e0b6913eb1dcc19465d3bbe570c883ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["hassan adlaimi"], "genres": ["Action", "Adventure"], "publishers": ["hassan adlaimi"], "esrb_rating": "Everyone 10+"}