{"id": 778212, "slug": "idle-spiral", "name": "Idle Spiral", "name_original": "Idle Spiral", "description": "<strong>What's Idle Spiral?</strong> <br/><br/>This is a beautiful \"Idle\", \"Incremental\" game based on spirals and mathematics. Your goal is to make the spiral grow longer and longer. The game is very simple, but it is very deep and can be enjoyed for a long time.<br/><br/> <strong>How to play </strong> <br/><br/>By buying upgrades, you can grow your spiral more efficiently. There will be a lot of mathematical equations, but don't be afraid. The upgrades themselves are not that strategic and you hardly need to understand this formula. However, as you continue to play, you will gradually come to understand the mechanics.<br/><br/> <strong>Layered prestige mechanics</strong> <br/><br/>The game has various reset mechanisms called Prestige (as seen in many Idle games!). Prestige resets much of the game's progression, but allow you to progress further and faster than before.<br/><br/> <strong>Battle Spiral</strong> <br/><br/>In Battle Spiral, your spiral is used as a weapon to fight various designs of spirals; to gain an advantage in Battle Spiral, it is important to consider what rewards to choose and in what order to fight the enemies. An extremely powerful boss with a very complex shape awaits you in the second half of the game!<br/><br/> <strong>Challenges</strong> <br/><br/>Challenges aim to achieve a specific goal under strong constraints. In challenges you will face debuffs, constraints, and fundamental gameplay changes while trying to achieve a certain goal. After reaching the goal, the challenge is completed and you receive big rewards.<br/><br/> <strong>Endless Content</strong> <br/><br/>Tornado Prestige is just the beginning of this game. It will take some time to progress through the game, but more content is waiting for you!<br/><br/> <strong>Music by AKIYAMA HIROKAZU from H/MIX GALLERY</strong>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2023-10-16T17:12:04", "background_image": "https://media.rawg.io/media/screenshots/af0/af0d5238b89607465012982b053c42d0.jpg", "website": "", "rating": 2.67, "rating_top": 4, "added_by_status": {"yet": 2, "owned": 209, "beaten": 1, "dropped": 5, "playing": 1}, "playtime": 1, "achievements_count": 22, "ratings_count": 6, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC"], "developers": ["Archimedes Geeks"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Idle System"], "esrb_rating": null}