{"id": 778207, "slug": "zero-point-2", "name": "Zero-Point", "name_original": "Zero-Point", "description": "<h3>Zero-Point is a 3D space roguelike inspired by the indie hit FTL: Faster Than Light.</h3><br/><br/>With the fate of Earth resting in your hands, you'll embark on a dangerous mission to save the Star Federation and face down the rebellion known as the Galactic Liberation Front!<br/><br/>Zero-Point is coming very soon to Early Access, and will include multiple races, different ships and a wide variety of weapons. There'll be an immersive soundtrack as well as many engaging event scenarios and voice acting for ship crews.<br/>It'll be a relatively high difficulty roguelike that rewards repeat play and encourages players to learn from their mistakes.<br/><br/>One of the big things about Zero-Point is the immersive 3D look at the interior of your ship. You'll be able to see your ship's corridors, crew, room damage and more as each battle and scenario unfolds.<br/><br/>Combat is realtime and will see ships facing off with an arsenal of weapons ranging from beams to lasers, torpedoes and more. Similarly to FTL, there will also be random events in each sector of space that you visit, such as the opportunity to purchase a weapon, plus multiple choice events, like having to decide between saving or destroying a stricken rebel ship that appeals for your aid.<br/><br/>Our art style for Zero-Point is semi-toony, bringing the simple graphical style of the original FTL formula to life in a 3D game world in a way that hopefully excites and creates keen interest among fans!<br/><br/><strong>Get ready, Captains - your mission to save the Star Federation starts soon!</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-02T04:07:06", "background_image": "https://media.rawg.io/media/screenshots/c0a/c0afc6b8a94402ddd9b024c8a5c3ab2f.jpg", "website": "https://www.twitter.com/ZeroPoint_Dev", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zero-Point"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Zero-Point"], "esrb_rating": null}