{"id": 778215, "slug": "private-property", "name": "Private Property", "name_original": "Private Property", "description": "<h3>Private Property</h3>The brand new VR zombie shooter set at the end of the XIX century Montana provides endless hours of great fun! <br/>Defend the property from zombies that want to destroy everything around them without mercy.<h3>But how do I fight zombies?</h3>To fight the zombie hordes, you have several different firearms to choose from. With these, you can blast the zombies into tiny pieces. A grenade launcher will be very convenient ;). In addition to the standard set of weapons, you can also use the Gatling gun which you can find on the map.<h3>Sounds scary?</h3>It would seem that a VR game about zombies must be scary and terrifying. <br/>Nothing like this! The atmosphere is rather light, and the zombies are not an immediate threat to you. Unless they throw dynamite at you.<h3>Then how can it be challenging?</h3>These are not zombies that can barely walk. You should prepare yourself for the growing hordes of zombies running uncontrollably towards the buildings you have to defend. As if that wasn't enough, zombies can throw various objects at you. Oh, and do not forget about the larger monsters, which aren't that easy to defeat.<h3>Online multiplayer</h3>You don't have to fight alone. You can coordinate your fight against zombies along with other players from all over the world.", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-02T04:29:31", "background_image": "https://media.rawg.io/media/screenshots/756/756459a11ffcd292c9a847c0b81e6c59.jpg", "website": "https://www.wenklystudio.com/private-property", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 477, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wenkly Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Wenkly Studio"], "esrb_rating": null}