{"id": 77879, "slug": "cross-the-bridge-extreme-bike-riding-survival-arca", "name": "Cross the Bridge - Extreme Bike Riding Survival Arcade (Long Mountain Trail Gear)", "name_original": "Cross the Bridge - Extreme Bike Riding Survival Arcade (Long Mountain Trail Gear)", "description": "You are trying to cross the bridge. The trouble is it is full of obstacles you must not crash into - so step up your dodge game. That's not all, though, because the bridge is also under construction! This means there are gaps and holes, and the bridge constructor has even built tricky roads in multiple layers - so be sure to select to correct road or you might fall off the bridge and drop into the water! Help the three motorcycle buddies move and jump all the way to the other side.<br/><br/>Collect coins to increase your score and unlock more and better riders! <br/><br/>As a nitro motocross and boost rally mania addict, your best and only logic is full throttle and high speed. Your philosophy is to drive until your front wheel falls off. However, you must refine your skills, prepare to take your brain up a gear, and adapt to the challenges of a half-completed maze and labyrinth looking bridge. Can you avoid all the parked cars and construction work, and ride, run, and bounce your way to safety? <br/><br/>Intuitive Tap 2 Hop finger touch controls ensures a pleasant bike riding trip! Start your engines, check your fuel, and get ready for an extreme arcade / action survival game on the bridges along the beautiful Long Mountain Trail. The Cross the Bridge frenzy craze is open for traffic!", "metacritic": null, "released": "2014-05-09", "tba": false, "updated": "2019-07-30T16:40:45", "background_image": "https://media.rawg.io/media/screenshots/441/441ff3c2ae3c268984bb955fc626636a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oliver Saylor"], "genres": [], "publishers": ["Oliver Saylor"], "esrb_rating": "Everyone 10+"}