{"id": 778772, "slug": "beach-defender-demo", "name": "Beach Defender [DEMO]", "name_original": "Beach Defender [DEMO]", "description": "<p>Thanks for checking out my first publicly released demo for Beach Defender! I am planning a fall 2022 release. It is an action rpg/tower defense game. This demo demonstrates some of the game mechanics. More things are being added in development. I have staarted work on the full version and will build a more updated demo prior to release with some of those features added in. Here are some hints to get you started:</p>\n<p>First, go up and talk to the guide NPC standing by the cliff.</p>\n<p>If you walk up to something and nothing happens, try hitting spacebar. Some interactions are automatic in this demo. I have been tweaking things during development and can't remember which ones were automatic when I made this build.</p>\n<p>There are a few things hidden around the little demo/tutorial island, including a second weapon, health upgrade, and coins. With a special resource object for both stone and wood, there are enough resources to play around with tower building to experiment with all available upgrades. The tower graphics are temporary, as I still need to find an artist for those, so there is no visual as to what levels the towers attributes are.</p>\n<p><strong>Controls</strong><br/>Pause: Escape<br/>Move: WASD<br/>Action button: Spacebar<br/>Sword attack: Left Mouse click<br/>Spear attack: Middle Mouse click</p>\n<p><strong>Camera Controls</strong> (on numpad):<br/>Step Zoom: +, -<br/>Min/Max Zoom: /, *<br/>Reset: Enter</p>\n<p>Join the BeachBlock Games Discord server: https://discord.gg/pXPgnXZUGQ</p>", "metacritic": null, "released": "2022-05-01", "tba": false, "updated": "2022-05-02T08:44:01", "background_image": "https://media.rawg.io/media/screenshots/7a9/7a9619dc8d00af000ea663cccc3a60c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BeachBlock Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}