{"id": 77888, "slug": "page-adventures", "name": "Page Adventures", "name_original": "Page Adventures", "description": "Here's a fun, action-filled reflex game that's sure to entertain you for hours and hours on end! Simply tap the correct square or get squished by the page.  Featuring the world's favorite boy wonder, Atom the Astro Boy and his friends, based on the famous Astro Boy manga and anime characters created by the legendary Osamu Tezuka!<br/><br/>Help Astro Boy escape Prof. Ochanomizu's long and dreary lecture books by moving him to the correct square before he gets crushed by the next page!  This game requires you to think fast and react faster!<br/><br/>HOW TO PLAY:<br/>- Watch where the hole on the next page will be and quickly move your character to the safe square. <br/>- Collect as many coins as you can to help your character level up. To make it more challenging, the page flips will gradually increase speed. This is a true test of your wits and reflexes!<br/><br/>Play Page Adventures now!<br/><br/>FEATURES:<br/>- The world's favorite robot, Astro Boy, in a challenging reflex adventure!<br/>- Simple, addictive, FREE!<br/>- A casual game that will surely keep you on your toes.<br/>- Unlock various characters with unique abilities, including Astro Boy's friends, like Uran, Prof. Ochanomizu, Black Jack, Dr. Tenma, Pinoko and more!<br/>- Over 140 achievements to attain!<br/>- Adjust the difficulty: Easy, Norrmal, and Hard modes!<br/>- Cute graphics", "metacritic": null, "released": "2017-06-28", "tba": false, "updated": "2019-10-22T14:23:23", "background_image": "https://media.rawg.io/media/screenshots/198/198339788b1a5920bee4aad5903d56c6.jpg", "website": "http://animocabrands.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Animoca Brands"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Animoca Brands"], "esrb_rating": "Everyone 10+"}