{"id": 778849, "slug": "loopy-wizard-itch", "name": "Loopy Wizard (itch)", "name_original": "Loopy Wizard (itch)", "description": "Loopy Wizard\r\n<p>Control a wizard and make wise use of spells. Can you outsmart the monsters and reach the end?</p>\n<p><strong>Various Spells</strong><br/>There are various spells, such as Hurt, Heal, Put to Sleep, Poison, Shock (with electricity), and many others. Spells can be used on monsters, but also on yourself if you so wish! Some other spells include Clone (play with multiple wizards!), Explode, Convert (get monsters on your side!), polymorph, and so on.</p>\n<p><strong>The \"Magic Clock\"</strong><br/>Spells are placed on the Magic Clock. After each move the clock hand turns and you <em>must </em>make use of the spell it points at. This means that if you're the only one left, you are forced to use a spell on yourself. This can be deadly, so plan carefully! Sometimes, it's good to keep a weak monster around.</p>\n<p>The spells remain on the clock indefinitely. If you wish to get rid of a spell, you can drag it from the clock directly to a target. It will be executed once more and disappear.</p>\n<p><strong>Tablets</strong><br/>On the 5th floor of each stage you can find a mysterious tablet. Tablets give you extra powers, each of which you can use once per stage.</p>\n<p><strong>Controls</strong><br/>Use arrow keys or W,A,S,D and the mouse.</p>\n<p>Enjoy this hectic puzzle game and become a \"Loopy Wizard\"!</p>", "metacritic": null, "released": "2022-05-01", "tba": false, "updated": "2022-05-02T09:16:43", "background_image": "https://media.rawg.io/media/screenshots/adf/adff484ae4f5a7ff21279a371c9f0670.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Venbrux"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}