{"id": 77896, "slug": "little-warlock-school", "name": "Little Warlock School", "name_original": "Little Warlock School", "description": "Help young warlocks defend their beloved academy against sinister forces in this awesome, electrifying mix of RPG, tower defense, siege, and real time strategy (RTS) on your mobile device!<br/><br/>2,000 years ago, the Frost Queen draped the continents in a cold, eternal winter. Darkness enveloped the world, and it was a time of strife and tumult.  In the midst of wintry chaos, as the world spiraled to a cataclysmic end, one extraordinarily powerful wizard, known only as the Archmage, rose against the Frost Queen and sealed her in a dimension untouched by fate and time. 2,000 years have come and gone, and the seals that contain the Frost Queen’s prison weaken. But with the Archmage gone, who can stand against the icy wrath of the Frost Queen?<br/><br/>You are the new headmaster of the Little Warlock Academy—it falls on your shoulders to prepare a generation of young warlocks and witches for what is to come. Manage a giant pool of spellcasting prodigies and protect the school from the Frost Queen’s nefarious forces! Train, upgrade, and command a colorful army of warlocks to put an end to evil and prevent another endless winter! <br/><br/>Features<br/>- Vivid fantasy world with a unique cartoon-inspired art style!<br/>- Warlock student training simulation!<br/>- Fend off the Frost Queen’s army in 80 quests!<br/>- Level up and upgrade your weapons and spells!<br/>- Construct up to 70 facilities, and feast your eyes on 5 beautiful levels of the Little Warlock Academy!<br/>- Compete amongst 200+ other schools to be the top warlock academy!", "metacritic": null, "released": "2014-11-01", "tba": false, "updated": "2019-10-22T14:23:22", "background_image": "https://media.rawg.io/media/screenshots/617/617eb05f240b81093d150da8aa050bf7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Animoca Brands"], "genres": ["RPG", "Strategy"], "publishers": ["Animoca Brands"], "esrb_rating": "Everyone 10+"}