{"id": 778929, "slug": "the-biumvirate", "name": "The Biumvirate", "name_original": "The Biumvirate", "description": "<p><strong>Work with your other head in the Birumvate to bring the Kingdom through a period of tribulation. Play your cards right in order to provide enough political power to win crisises and solve people’s problems!\r\n  <br/></strong></p>\n<p>This game was made for the Curdle Jam #24 with limited bugtesting, so please treat it gently. You can break it if you try hard enough! The theme was two heads are better than one. \n</p>\n<p><strong>Controls:<br/></strong></p><p>Mouse: Click on cards to move, let go of mouse near the slots to use them. Move forward text too.<br/></p><p>Space: Enlarge card when held. Move forward text.<br/></p>\n<p><strong>How to play<br/></strong></p>\n<p><strong>In short: Use cards on crisises, and keep each faction's power below 50%.</strong><br/></p>\n<ul><li>Play cards into each card slot at the bottom of each crisis that comes up. The other head of the birumvate will then play theirs at the top. Work together to apply enough progress for a certain faction so that the crisis is resolved!</li><li>Clicking on a crisis card will zoom it in or zoom it out so you can read and apply cards to it.</li><li>Clicking and holding on a card while pressing space will toggle large mode for that card for easier reading.</li><li>Select which faction you want initial support from in the first crisis and they will give you 4 powerful themed cards around their faction to your deck.</li><li>Pay special attention to the story quests presented by your other head (the white wolf) as they give you a powerful card in your deck as a reward.</li><li>Crisises will also affect the balance of power in their outcome. For the general crises if you resolve them with the same faction then they'll likely reward you with a card.</li><li>A crisis has to have enough progress to pass the bar, otherwise it'll fail.</li><li>Crime crises are opportunities to gain very powerful crime cards, but they can rapidly cause crime to run out of control! However, they can be an effective way of reducing the power of a certain faction - as winning a crime crisis with a certain faction will reduce their power.</li><li><strong>Make sure a faction does NOT gain over 50% power!!</strong> If a faction goes over 50% then you get a bad ending.</li><li>Survive until the clock reaches the top (30 turns) to win!</li></ul>\n\n<p><strong>The Factions:<br/></strong></p>\n<ul><li>People: The people work with all other factions, so it can be helpful to have a card of other faction types in your hands to improve your cards. They can release the power of chaos and revolution to have a sudden power swing!</li><li>Military: The military is all about using drafts and cashing in power on a specific crisis by calling in the military. They get a card that lets you draw drafts as well.</li><li>Economic: The Economic gains power by investing cards that will give power per turn. Cash in your power for a sudden progress spite with a specific card!</li><li>Nobel: Crush the other factions under your feet as you play strong cards. Just make sure not to get too powerful from your own doing, however!</li></ul>\n<p><strong>Tips:<br/></strong></p>\n<ul><li>The AI will also choose a faction opposite you. Pay attention to what faction they are as they are biased to play those cards in crisises!</li><li>Working with the AI is usually the only way to win all the crisises.</li><li>Winning a crisis as another faction instead of your starting one will keep the balance of power in a better position.</li><li>You can only play a maximum of 3 cards per crisis.</li><li>Winning a crime crisis will lower the power of the winning faction (except for military, which is crime's foil).</li><li>Some crisises have specific foils from certain factions winning.</li><li>The bar chart show the progress of a faction in that crisis. You have to get at least one bar to pass the line to win, with the largest bar being the overall victor.</li><li>The economy party are a bunch of arseholes, you're doing fine, they just want money from criseses.</li><li>Most Crisises require at least 3 progress to avoid the bad result. The exceptions are the tutorial and the first story crisis.</li><li>If a faction if particularly happy with how you solved a crisis then they'll give you a powerful card.</li><li>You will always get a powerful card of the type you use to solve the crisises presented by your other head (the white wolf).</li><li>Clicking and holding on a card while pressing space will toggle large mode for that card for easier reading.</li></ul>\n\n<p><strong>Credits:<br/></strong></p>\n<p>Thalpy(Fermi#1350) - Coding, voice acting, 3D models, writing.</p>\n<p>Sithlordal - Coding, voice acting, writing</p>\n<p>Missive - Coding, writing.</p>\n<p>Kivea - Writing, voice acting.</p>\n<p>Gravedogg - Art<br/></p>\n<p>Mae McAllister - Music<br/></p>\n\n<p><strong>Glossary<br/></strong></p>\n<p><strong>Power - How much power a faction has (top left).</strong> If one faction goes over 50% it's game over</p>\n<p><strong>Progress - How much progress a faction has in a crisis.</strong> The faction with the most progress over the line will win. If you don't pass then you fail the crisis.</p>\n<p><strong>Happiness/Mana - </strong>A cut feature, don't worry about these.<br/></p>\n\n<p><strong>Known bugs:<br/></strong></p>\n<p>- The dialogue breaks when I fullscreen: Please don't fullscreen! It's a bug with the multiple different UI things we have and I have no idea how to fix it so for now keep it 1080p.<br/></p>\n<p>- The AI's slots for cards are sometimes filled in from previous events that happened in that space from the previous crisis. It's frustrating, but I can't fix it cause Destroy() does nothing and unity is terrible.</p>\n<p>- Spelling - we finished this game with 30s to get, so the writing was very much influenced  by panic!!</p>\n<p>- The AI is ruining my day by paying crime cards. We deliberately decided to implement this feature in order to solidify that crime in government should never be accepted. Ok, no we didn't, it's because the AI was able to select crime cards accidentally as it's starting deck and we couldn't fix it in time.  just think of it as hard mode! <br/></p>\n<p>- There's no sound on this line: Please comment the broken lines and we'll fix! Also some start slow because wrangling voice actors in time was hard enough as is.<br/></p>\n\n<p><strong>Cheats:<br/></strong></p>\n<ul><li>Clicking the deck to the left of you will let you draw a card. Please use this if the game breaks! But otherwise, try to not.</li><li>You can discard cards too by clicking the right one. This can also solve some weird card bugs that I'm pretty sure I fixed.</li><li>You can also do this with the AI, but I have no idea how the AI will react if it has no cards (it'll crash probably).</li></ul>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T09:53:49", "background_image": "https://media.rawg.io/media/screenshots/16f/16fefcf0a97bb6224d51da5239ac8107.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["FermiCat"], "genres": [], "publishers": [], "esrb_rating": null}