{"id": 779083, "slug": "los-primos", "name": "Los Primos", "name_original": "Los Primos", "description": "<p>Los Primos es un videojuego basado en hechos reales, narra la inimaginable y surrealista aventura que vivieron 3 primos en su adolescencia.</p>\n<p>Tres primos.  Muchas aventuras. Muchos amigos durante el camino. Embárcate en un viaje épico a través del vasto y asombroso universo de El Vertedero y descubre las fascinantes historias de cada uno de los tres primos.</p>\n<ul><li>Juega en el papel de muchos personajes diferentes, cada uno con una historia propia y lore oculto que desentrañar.</li><li>Explora los numerosos mundos de El Vertedero, un universo tan fascinante como peligroso, y descubre la historia de cada personaje durante el viaje.<br/>\n</li><li>Usa la labia, talentos y los trucos del almendruco únicos de cada personaje (acciones de senda) en diálogos frenéticos.<br/>\n</li><li>Disfruta de un sistema de decisiones de mierda muy completo y a la vez accesible, y rompe la defensa enemiga al revelar su...<br/>\n</li><li>Avanza por las historias principales y no secundarias (no hay) de distintas formas y toma decisiones que determinarán (bastante poco) tu camino. <br/>\n</li><li>Disfruta de unos gráficos inspirados en RPG Maker MV con preciosos elementos realistas dentro de un mundo en casi 3D.<br/>\n</li></ul>\n<p>Los Primos está disponible en Itch.io. (Y ya)</p>\n\n<p>DISCLAIMER</p>\n<p>(La versión de Windows debería ser utilizable en Linux, pero no estamos seguros así que la opción no está marcada.)</p>\n<p>(Casi ningún tipo de sustancia alucinógena fue ingerida durante el desarrollo del videojuego.)</p>\n<p>(Ningún Pokénom fue dañado durante el desarrollo del videojuego.)</p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T10:53:44", "background_image": "https://media.rawg.io/media/screenshots/156/1564edd7a0b2997223d327e6d4ac521f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Los Primos"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}