{"id": 779022, "slug": "spirit-sense", "name": "Spirit Sense", "name_original": "Spirit Sense", "description": "<p>Spirit Sense - A small horror game made in 3 hours!</p>\n<p><strong>Please run the game full-screen, preferably before it finishes loading!<br/></strong>Otherwise the camera will act funky and you have no idea what you're looking at<br/></p>\n<p>You have the gift to heighten your senses to higher levels, allowing you to see spiritual things for a few seconds while rooting yourself in place. With this gift, you've become a spirit hunter, able to capture (soon to be) malevolent spirits. However, angry spirits that are aware of your presence will be able to harm you, even in the physical world!</p>\n<p>In order to capture a spirit (and win the game) you must find and collect 3 spirit items by using your spirit sense, then place a trap, and then get the angry spirit that's actively hunting you to walk into the trap. The spirit is harmless until you pick up the first spirit item. After that, if you see it, it will start hunting you.<br/></p>\n\n<p>Controls:</p>\n<p>* WASD - movement<br/>* Mouse - camera<br/>* Space - spirit mode<br/>* Shift - sprint (as if you can run lol)<br/>* E - Place trap (once spirit items are gathered)</p>\n\n<p>I made this game from scratch in 3 hours. I did have to fix a bug afterwards, related to the mouse cursor being visible and unlocked. I hope those few extra minutes don't matter too much for the competition :D I'm sure there were a few loading screens while I was doing nothing that can compensate for that. Timelapse of development is here </p><br/>\n\n<p>Known bugs: <br/>* The camera isn't capped when looking up and down. Also it can be bugged when not playing fullscreen.<br/>* I forgot to apply a different material to the trap<br/></p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T10:30:31", "background_image": "https://media.rawg.io/media/screenshots/084/084e6fe3480a688f9dc7bebd572d0140.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Frib"], "genres": ["Action"], "publishers": [], "esrb_rating": null}