{"id": 779013, "slug": "the-guest-itch", "name": "The Guest (itch)", "name_original": "The Guest (itch)", "description": "Requirements\r\n<p>The game requires KVM (Kernel-based Virtual Machine) to run the in-game computer. This might already be enabled on your system, but if the game doesn't run, this could be the reason why.</p>\r\nControls\r\n<p>WASD (physical keys) to move.<br/>Left mouse click to interact with objects/terminals.<br/>Left/Right mouse click to leave terminals.</p>\r\nKnown Issues\r\n<p>- Resizing the game window will clear terminal screens.<br/>- Loss of connection to the in-game computer (e.g. poweroff or network down) will cause the game to freeze.<br/></p>\r\nLicense\r\n<p>This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version.</p>\n<p>Source code can be found at: https://github.com/lihop/the-guest.<br/></p>\r\nCredits\r\nFreesound\r\n<p>\"Door_Hinge03.flac\" by corpocracy licensed under CC-BY-3.0</p>\n<p>\"Computer Glitching, Digital Data Corruption, 02-04 LOOP.wav\" by InspectorJ licensed under CC-BY-4.0</p>\n<p>\"LockedDoor.wav\" by MindlessTrails licensed under CC0-1.0</p>\n<p>\"door_open.wav\" by palkonimo licensed under CC0-1.0</p>\n<p>\"Gate-Heavy-OpenClose-WAV.wav\" by Omnisis licensed under CC0-1.0</p>\n<p>\"Hiking Boot Footsteps on Stone\" by Fission9 licensed under CC0-1.0</p>\n<p>\"Thud-dry.wav\" by juskiddink licensed under CC-BY-4.0</p>\r\nOpen Game Art\r\n<p>\"Old Terminal\" by Michael Carey licensed under CC-BY-3.0</p>\r\nSketchfab\r\n<p>\"Fallout Style Wall Terminal\" by Rashaun Sanders licensed under CC-BY-4.0</p>\n<p>\"The '90s Game Machine\" by Beinaja licensed under CC-BY-4.0</p>\n<p>\"retro cyberpunk computer screens\" by ribot02 licensed under CC-BY-4.0</p>\n<p>\"Hi-tech Doors - Red\" by Unknown licensed under CC-BY-4.0</p>\n<p>\"Armchair\" by Tyler Ferrington licensed under CC-BY-4.0</p>\n<p>\"Potted Plant, Mediterranean med leaf, low poly\" by dudecon licensed under CC-BY-4.0</p>\n<p>\"Coffee Table Blue\" by Kirkieb licensed under CC-BY-4.0</p>\n<p>\"Server V2 +console\" by FlevasGR licensed under CC-BY-4.0 / Texture modified to obscure visible brand logo.</p>\r\nShaders\r\n<p>\"Glitch Effect Shader\" by Yui Kinomoto licensed under MIT</p>\r\nPlugins\r\n<p>\"Godot Post Process Outlines\" by João Marinheiro licensed under MIT</p>\n<p>\"GodotXterm\" by Leroy Hopson licensed under MIT</p>\n<p>\"Godot-Thief-Controller\" by Alex Nagel licensed under MIT</p>\n<p>\"Godot-3D-text-plugin\" by Roujel Williams licensed under MIT</p>\n<p>\"Godot Verlet Rope\" by Shashank C licensed under MIT</p>\n<p>\"gdtemu\" by Leroy Hopson licensed under MIT</p>\r\nFonts\r\n<p>\"DSEG\" by Keshikan けしかん licensed under OFL-1.1</p>\n<p>\"Routed Gothic\" by Darren Embry licensed under OFL-1.1</p>\n<p>\"FreeSans\" by Primož Peterlin, Steve White licensed under GPL-3.0-or-later</p>\r\nOther\r\n<p>\"Together We Type\" by Leroy Hopson licensed under CC-BY-4.0 / Derived from:</p>\n<ul>\n<li>\"Together We Can Do It\" by DonkeyHotey licensed under CC-BY-2.0</li>\n</ul>\n<p>\"ascii-invadersl\" by Thomas Munro licensed under GPL-2.0-or-later</p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T10:27:41", "background_image": "https://media.rawg.io/media/screenshots/b24/b24c3cfc55effd6c567f62028b83ff16.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["lihop"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}