{"id": 779159, "slug": "necroncide-arena", "name": "NECRONCIDE ARENA", "name_original": "NECRONCIDE ARENA", "description": "<p><em>Necroncide Arena</em> is a local multiplayer game where two players take turns controlling their respective teams of 3 “hero” mercenary characters with their own tactical abilities and stats. It uses a target selection system (similar to XCOM) but is played from the third person perspective. The objective is to eliminate the opposing team. There is also a mutant pod that spawns randomly in the map that, when destroyed, will spawn a mutant teammate, the <em>Necron</em>, for the team that frees it giving them a slight edge in firepower. If this event occurs the non-mutant controlling team can still try to win by eliminating the mutant and running to the exfil location (demarcated by green signal smoke) to win the game.</p>\n\n<p>To play remotely, we recommend Parsec which is now owned by Unity! https://parsec.app/</p>\n\n\r\nFEATURES:\r\n<p>- 3v3 PvP action with asymmetrical tactical elements to turn the tide in your favor!<br/></p>\n<p>- Turn-based target lock combat played from the third person perspective.</p>\n<p>- 3 Hero characters: The Shadow, Savage and Infiltrator each with their own unique weapons and stats.</p>\n<p>- Unique tactical abilities for each hero: penetrate solid walls with the Shadow’s Vantage Strike sniper shot, stop the opfor in their steps with the Savage’s Paralyzer Rounds and leap away from the enemy’s fire with the Infiltrator’s Exo!</p>\n<p>- Locate and destroy the drop pod to free the terrifying X-III Necron – a monster of flesh and steel who will fight for its captors!</p>\n<p>- Featuring a 3 lane map with 2 levels of verticality with fully immersive sound, VFX and animations!</p>\n<p>- Destroy patrolling drones in an explosive fashion to gain healthpacks!</p>\n\r\nTOOLS USED:\r\n<p>Game Engine – Unity\r\n  </p>\n<p>Modeling Suite – Maya, 3DS Max, Zbrush\r\n  </p>\n<p>Texturing – Substance Painter, Photoshop\r\n  </p>\n<p>Animation – Maya, Mixamo\r\n  </p>\n<p>Music/SFX – Audacity, LMMS, Reaper, FreeSound.org, Licensed (attributions mentioned in game credits)\r\n  </p>\n<p>VFX – Unity Shader Graph, Unity Particle Pack\r\n  </p>\n<p>Programming Lang/Editor – C#, Visual Studio </p>\n<p> Version Control - Github</p>\n\r\nACCOLADES:\r\n<p>IEEE GameSIG 2022 Finalist</p>\n<p>FOR A FULL LIST OF DEVELOPERS AND THEIR ROLES, PLEASE REFER TO OUR PAST PLAYTEST BUILDS HERE AND HERE.</p>\n\r\nCHANGES IN THIS BUILD:\r\n<ul><li>Full VFX Pass.</li><li>Optimized and cleaner shadow.</li><li>Additional set pieces to environment.</li><li>Fully working Tactical abilities for each Mercenary.</li><li>Changes to Loadout window in the main menu.</li><li>Added intro cutscene and improved visuals to exfil zone.</li><li>Improved soundscape and SFX.</li><li>Improved invisible walls and flight routes for drones.</li></ul>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T11:33:06", "background_image": "https://media.rawg.io/media/screenshots/43d/43d7ce6f17c5e1f9ab9d0f21db4ed124.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 580, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mechwolf"], "genres": ["Action", "Shooter", "Strategy"], "publishers": [], "esrb_rating": null}