{"id": 779150, "slug": "pour-les-yeux-de-la-reine", "name": "Pour les Yeux de la Reine", "name_original": "Pour les Yeux de la Reine", "description": "Pour les Yeux de la Reine\r\n<p>Le Royaume de Terah est au bord de l'effondrement et la Reine Ephialtela demande votre aide pour le sauver. Il faudra vous enfoncer dans les terres oubliées des Anciens, prendre le contrôle de leurs Artefacts et les réunir afin de créer une source illimitée d'énergie, apte à rétablir la balance des nappes de magies. Mais prenez garde : même si les Anciens ont disparus depuis des siècles, leur cité est protégée par de puissants monstres. Oserez-vous les affronter pour sauver votre peuple ? Oserez-vous scander la devise du royaume de Terah : \"Pour les yeux de la Reine\" ? <br/></p>\r\nGameplay\r\n<p>Catapulté dans les Plaines Ytudes, vous allez devoir parcourir les ruines des Anciens pour retrouver les différents Artefacts de puissance. </p>\r\nBâtissez des extracteurs d'armes\r\n<p>Lors de la phase de préparation, vous pouvez construire des extracteurs d'armes aux endroits où des armes antiques ont été ensevelies des siècles auparavant. </p>\r\nDéclenchez des vagues de monstres\r\n<p>Vous pouvez déclencher des vagues de monstres en vous signalant comme prêts. Battez-vous et tuez les monstres pour récupérer du mana et activer les sortilèges des anciens ! Eradiquez les monstres restant lorsque la phase d'apparition est terminée pour lancer de nouveau une vague énergétique et relancer les extractions. </p>\r\nCollectez du mana et récupérez des armes puissantes\r\n<p>Vous remarquez que l'apparitions de monstres coïncide avec l'activation d'antiques mécanismes. Lors de cette phase précise, vous pouvez extraire des armes si vous avez construit un extracteur et extraire du mana auprès de fontaines. </p>\r\nParcourez les terres des Anciens \r\n<p>Lorsque vous vous sentez prêts, vous pouvez payer un certain coût en mana pour débloquer la zone suivante et découvrir de nouvelles zones d'extractions et de nouveaux paysages. </p>\r\nExtrayez des artefacts er réveillez des puissances endormies\r\n<p>Au cours de votre exploration, vous tomberez sur les artefacts que votre Reine vous a demandé de retrouver. Mais prenez garde : ces derniers sont protégés par des monstres surpuissants qui ne se laisseront pas faire...   </p>\r\nCommandes\r\n<ul><li>[Clic gauche] : attaque avec arme au corps à corps</li><li>[Clic droit] : attaque avec arme à distance</li><li>[E] : interagir avec l'environnement (poser un extracteur, ouvrir une porte, acheter une arme)</li><li>[Espace] : réaliser un sprint</li><li>[R] : prévenir ses camarades et le jeu que l'on est prêt à lancer une nouvelle vague de monstres</li></ul>\r\nCrédits\r\n<p>Jeu réalisé dans le cadre du cours de Laboratoire de Jeu Vidéo à l'Université du Québec à Chicoutimi entre janvier et avril 2022 avec  : </p>\n<ul><li>Paul DELARUE</li><li>Aymeric FERRON</li><li>David GOND</li><li>Stéphane HULOT</li><li>Célestin MOËNNE-LOCCOZ </li><li>Julia MOURIER</li></ul>\r\nVersions\r\n<p>PourLesYeuxDeLaReine_V1.0 : première version du jeu (<em>29 avril</em>)</p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T11:28:14", "background_image": "https://media.rawg.io/media/screenshots/420/42062bccca76405d996dd42a3655779e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aymeric4444", "CelestinML", "OctoJul", "Nharelys"], "genres": [], "publishers": [], "esrb_rating": null}