{"id": 77914, "slug": "pooyan-big-and-wolf", "name": "Pooyan－Big and wolf", "name_original": "Pooyan－Big and wolf", "description": "Mama Pig defends her home and rescues her \"Pooyan\" (the kidnapped piglets) riding an elevator car moved by two \"Buuyan\" (controlled by the player with a Y-axis [up and down] joystick), and uses a bow and arrow with slabs of meat against the balloon-riding wolves and their boss (the latter being pink in color while the former are red).<br/><br/>There are two stages. In the first, the wolves are riding to the bottom of the screen, and if Mama does not shoot them down, they will climb up the ladders and try to eat her. In the second (occurring after an \"intermission\" sequence), the wolves are riding to the top of screen, and if enough wolves get there, they will push a boulder on top of Mama, resulting in a life being lost. In both cases, the stage is cleared by shooting all the wolves, though in the second stage the boss must be shot down (which will take many shots unless the meat is used), otherwise the wolves will keep coming.<br/><br/>After the second stage is cleared a bonus round begins. In one type, Mama must shoot all the wolves only using meat, while in the other she must use regular arrows on the fruits. Afterward, the game begins anew with higher difficulty.<br/><br/>When the game starts, \"The Other Day I Met a Bear\" can be heard during the opening scene (in which the wolves kidnap Mama's babies). The first stage theme bears a very slight resemblance to the main theme music from Frogger, another Konami arcade game. The song is a part of the Desecration Rag (An operatic Nightmare) by Felix Arndt, the portion that mimics the beginning of Antonín Dvořák's Humoresque Opus 101 Number 7. After the second stage is cleared a second time, a part of \"Oh! Susanna\" can be heard.", "metacritic": null, "released": "2015-01-14", "tba": false, "updated": "2019-10-22T14:23:22", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c5b4e4fa2829ce6e7de4e352e6ff9c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DING DAN"], "genres": ["Family"], "publishers": ["DING DAN"], "esrb_rating": "Everyone 10+"}