{"id": 779264, "slug": "isler-island-builder-v001", "name": "Isler - Island Builder - V0.01", "name_original": "Isler - Island Builder - V0.01", "description": "<p>Hey! Welcome to the initials versions of the prototype about my game ideia \"Island Builder\". </p>\n<p>I had one project in mind and i am placing the game here to get some help in evolving my concept into something cool. Basically the ideia is a roguelike/lite where the player spawn on a simple island with a builder character. That builder is used to build other adjacent islands and continue to explore the world. The game will have enemies to fight and bosses to discover.<br/></p>\n<p>--------------------------------------- C O N T R O L S -----------------------------------------------</p>\n<p>Moving player: A W S D</p>\n<p>Dash : Space Bar</p>\n<p>Attack: Right Mouse and the attack will face the mouse direction</p>\n<p>-------------------------------------------------- --------------------------------------------------------<br/></p>\n<p>My concept is still in the very beginning but i am posting here so that i get help with ideias and transform them into a fun and playable game. If you have something in mind that would fit good in this game feel free to share it :D</p>\n\n<p>What i have in mind right now:</p>\n<p>- When the builder is building an island, enemies will spawn and the player have to protect the builder.\r\n</p>\n<p>- I will create a second enemy that shoots spear and a third one that breaths fire.\r\n</p>\n<p>- With the number of islands the builder creates, enemies will spawn in waves.\r\n</p>\n<p>- Enemies have a chance to appear on the spawned islands.\r\n</p>\n<p>-Some islands will have dungeons and tresures to find.\r\n</p>\n<p>-The player will get resorces from the islands (wood,rocks,etc) to build houses and equipment to improve the player stats.\r\n</p>\n<p>-Spawning islands require energy\r\n</p>\n\n<p>This is just the prototype so i can see if the game would be fun and if is it worth to invest the time to build it.\r\n</p>\n<p>What i am strugle with is with ideias xD</p>\n\n<p>--------------------------------------- | | --------------------------------------------------------</p>\n<p>Last Updates: </p>\n<p>- Added a Unity asset store model to my player so it doesnt look like a cilinder</p>\n<p>- Added movement animations and a \"dark souls like\" dask</p>\n<p>- Added a simple slime enemy with simple AI and basic attack system</p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T12:39:27", "background_image": "https://media.rawg.io/media/screenshots/b3e/b3e39f1e61fd6b5444eca6ea8c278554.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["FH_Creator"], "genres": [], "publishers": [], "esrb_rating": null}