{"id": 779272, "slug": "bird-quest-dankboi68", "name": "Bird Quest (Dankboi68)", "name_original": "Bird Quest (Dankboi68)", "description": "<p>Watch the fuck out, Nint*ndo, there's a new epic video gamer coming in!</p>\n<p>Long ago in the time before man, the kingdom of the birds ruled over mankind. These days are marked in history by the name of \"Birdtime\" to refer to the birds. Dragons also exist and one is super evil. 5 years later, long after these events have come and gone, fading into legend, myth, and obscurity, the heir to the Bird throne embarks on a dangerous quest with his trusty knight and together the two must brave the dangers of the world, recruiting many allies, and making dangerous enemies... Only once the time has come, can the truth be learned about the origin of the Birds....</p>\n<p>That's right, Bird Quest is a fully expansive immersive wonderous world set in the land of [unnamed]. Fight through interesting enemies as you unravel a thick plot that goes deeper than anyone could've imagined!.... Not. Yeah, this game is NOT serious, it's something I made in 3* days in SRPG Studio's free trial. Despite this, there is some serious merit here, being a short and sweet compression of a standard Fire Emblem game, seeing all of the basic tropes such as</p>\n<p>A bad Lord unit with great growth rates</p>\n<p>A good Jagen unit with bad growth rates</p>\n<p>Two axe guys</p>\n<p>A guy who is secretly a dragon (don't tell anyone)</p>\n<p>A girl</p>\n<p>And more!</p>\n<p>Read the official strategy guide here</p>\n<p>https://docs.google.com/document/d/1izzdJymmjp8igDHU69rAO2d3ws8u5wJ3wH6ZPXJdB9Y/...<br/></p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T12:43:39", "background_image": "https://media.rawg.io/media/screenshots/a69/a690a8c3c3d482a135cafe8eeb3b9029.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dankboi68"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}