{"id": 779269, "slug": "extraterrestrial-escape", "name": "Extraterrestrial Escape", "name_original": "Extraterrestrial Escape", "description": "<p>Thaddeus Buford Fletcher and Gloria Eloise Fletcher, who own and run The Cosmos Cradle; a cattle and corn farm in the middle of nowhere U.S.A. They have lived on the farm for decades, but within the last few months they have been noticing strange occurrences on and around the farm. Glowing lights flashing across the sky, strange patterns being flattened into the corn fields, and finally a number of their herd disappearing from the pastures without a trace. Thaddeus and Gloria decide to plan a stake out and see if they can identify what's attacking their farm. Only a few hours into their watch they are met by a giant UFO and a gang of otherworldly beings. The Fletcher’s step out of their hiding spot and face the aliens, demanding they leave the farm, but it doesn’t go as smoothly as they would have hoped.</p>\n\n<p>This game was a product of students from Patriot Tech at Wheeling Park High School, and was originally created for the Interactive Application and Video Game Development contest during the 2022 SkillsUSA WV State Leadership and Skills Conference. The game will continue to be updated, but as of now, it is still quite early in development. </p>\n\n<p>Programming - Ethan Waldeck</p>\n<p>Conceptualization/Documentation - Leah Coleman</p>\n<p>Artwork - Jacob Kuntz</p>\n<p>Music - Maxwell McGovern</p>", "metacritic": null, "released": "2022-04-30", "tba": false, "updated": "2022-05-02T12:41:54", "background_image": "https://media.rawg.io/media/screenshots/ebd/ebdf965c5d01a1b354b7663ffb85ade9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheEthanMaverick"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}