{"id": 779388, "slug": "me-and-my-eldritch-parasite-itch-apehardware", "name": "Me and My Eldritch Parasite (itch) (ApeHardware)", "name_original": "Me and My Eldritch Parasite (itch) (ApeHardware)", "description": "<p>You are another resident in the Eternal Residence, where we all live with the company of out great friends the Eldritch Parasites.\r\n</p>\n<p>And you really, really don't like your parasite.</p>\n<p>There might be a way to get rid of it, but it will take plenty of tries. And maybe some body horror.</p>\n<p><strong>&gt;Welcome to the Eternal Residence</strong></p>\n<p>\"Me and my Eldritch Parasite\" is a realistic game in the sense that you don't get any mercy for being the player.</p>\n<p>Explore a randomly generated building and enjoy a bizarre artstyle made out of surreal photo collages. This game aims to use random generation to increase the fear of the unknown. Even if you learn every enemy and hazard, you will never know where they will strike.</p>\n<p><strong>&gt;A virtual pet but fleshier</strong></p>\n<p>Your parasite has needs. Make sure to grab food and buggrubs along the way. Otherwise, there will be consequences...</p>\n<p><strong>&gt;In company of... creatures</strong></p>\n<p>You are not alone. More than 20 types of parasite hosts wander the residence. Some will ignore you, others will attack, and they might have the same faces.</p>\n<p>Be prepared to dodge attacks at any time in a bizarre game of bullet hell.</p>\n<p>One of these hosts has taken a key with them. A key for a chest. A chest with tools that can get rid of a certain parasite. Find that host, follow close and wait until they grow up and drop it.</p>\n<p>Be careful, \"growing up\" is not a metaphor here...</p>\n<p><strong>&gt;Varied horrible consequences</strong></p>\n<p>So you just got some tools. The thing is... this place doesn't have doctors.</p>\n<p>6 different consequences of trying to remove your parasite by yourself await you. Can you find the least horrible one?</p>", "metacritic": null, "released": "2022-04-29", "tba": false, "updated": "2022-05-02T13:37:22", "background_image": "https://media.rawg.io/media/screenshots/217/217eb9071d187b32ca848ae43fcef28b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 349, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["ApeHardware"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}