{"id": 779370, "slug": "sushi-flow", "name": "Sushi Flow", "name_original": "Sushi Flow", "description": "<p>In Sushi Flow, a calm cooking game with fun colors and a slew of different ingredients to choose from, players will create orders and respond to customer feedback while managing their inventory.  There is a store the players can buy from, and a number of days in which to create a variety of different sushi meals.  With the menu creation screen, players can dictate the food they want to serve at the beginning of each day, and change their preferences as the in-game week progresses. </p>\n<p>Instructions:</p>\n\n<p>Sushi flow is a click and drag game.  Every day, first choose the recipes you’d like to make by clicking and dragging them into the “active” slot.  Then, customers will come and order different rolls based off your menu.  Be sure to check the “order” tab in the bottom left to see what’s been ordered!  When you make a roll, the customer will leave a review based on accuracy and speed.  Be sure to remember to pop back in and out of the store to pick up new ingredients as you need them!</p>\n\n<p>This is a final project for a class, created by myself and my partner, Abby Floyd.   With her permission, I've put her personal website below:</p>\n<p>abby-floyd.com</p>\n<p>As for me, I can be found right here.  We had a lot of fun creating this and hope you enjoy it!</p>\n<p>-Livia</p>", "metacritic": null, "released": "2022-04-29", "tba": false, "updated": "2022-05-02T13:28:54", "background_image": "https://media.rawg.io/media/screenshots/de7/de749767c74540f41e12f1bc97aa147e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Livia"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}