{"id": 779589, "slug": "queen-marys-script-retold", "name": "Queen Mary's Script Retold", "name_original": "Queen Mary's Script Retold", "description": "<p>Queen Mary's Script is a game created in 2013 by Maimie's Toybox. It tells the peculiar story of a girl thrust into the world of dolls and contracts. Join Mary, Clause and Edmund as the three travel between worlds, facing their past demons and learning more about themselves that they never intended to. They question just what it is they want as well as if it's worth the sacrifice to get it. </p>\n\n<p>Queen Mary's Script - Retold is a complete overhaul of the main game. Updated graphics are not the only thing you'll see. Story changes, new havens/characters and different outcomes for certain characters will give you a whole different experience from the original!</p>\n<p>QMSR is a free RPG maker game created by Gabicho. </p><p>- 1 ending</p>\n\n<p>5/1:: Reported bugs have been fixed! For anyone who is running the old version, please download the new version and copy paste your save files if you have trouble!\r\n</p>\n<p>Bug fixes;\r\n</p>\n<p>- Shortcut is unusable. This was a remnant file and not meant to be in the download. Please just delete it and use the game exe in the folder.\r\n</p>\n<p>- String Kingdom bug - fixed in the new version 1.2. If you want to keep using the old version, don't attack the invisible enemies in the room. You can attack when the enemies appear! \r\n</p>\n<p>Thank you to everyone who reported a bug! \r\n</p>\n<p>-----------------------</p>\n\n<p>- It is free to stream as individuals (corporations and agencies, please email)</p>\n<p>-It is free to translate so long as you do not claim as your own, do not charge and do not censor or change any story elements. </p>", "metacritic": null, "released": "2022-04-29", "tba": false, "updated": "2022-05-02T15:05:42", "background_image": "https://media.rawg.io/media/screenshots/b18/b186194351c8ce3f7594c04ae53fc1e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maimie's Toybox"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}