{"id": 779692, "slug": "osmond-ward-adventures-farvassen-the-city-of-iron", "name": "Osmond Ward Adventures: Farvassen, the City of Iron", "name_original": "Osmond Ward Adventures: Farvassen, the City of Iron", "description": "<p>Farvassen is a module developed as pay what you want, with the intent of giving all proceeds to<strong> Easter Seals British Columbia and Yukon </strong>- an organization that sends children with disabilities to summer camp. Any profit beyond a certain point will be split amongst the talents on the project team for their contributions.</p>\n<p>In the Far East, beyond the Asivian Sea, sits the province of Haka.\r\nA great tundra of ice and frostridden stone, the people here have lived their lives in as best a way they can - setting up research posts to study rare plants and dyes found only here and selling rare fish caught in the shores around the province - but a looming threat of pirates and great enemies in the north meant the place never took to much of a population outside the coast.\r\n<br/><br/>It is in this frigid land we set our tale - one of heroism, hardship, and struggle, as a group of adventurers set off to conquer a great city of time dilating magic - Farvassen, the City of Iron.\r\nAbandoned centuries ago, the city has been the site of a great amount of study and treasure hunting as humans and lupine and everything inbetween travel the great expanse of tundra to take from the Monolith Mechanism - a legendary artifact that can mess with spacetime.\r\n<br/><br/>You are no different - sent as adventurers with the task of collecting parts from the mechanism by companies, adventurer leagues, and corporations alike. Will you survive the perilous journey? Or will this place be the end of you? </p>\n\n<p>After all...\r\nIts only a matter of time until you fall.<br/></p>\n<p>Farvassen: City of Iron is a project developed with the intent of producing a quality, voice acted game module for Osmond Ward. The people who have worked on this project have volunteered dozens of hours of their lives, blood, sweat, and tears to bring their A game to this project, and their work has paid off in an action packed adventure of intrigue, puzzles, and combat.\r\n</p>", "metacritic": null, "released": "2022-04-29", "tba": false, "updated": "2022-05-02T15:49:25", "background_image": "https://media.rawg.io/media/screenshots/576/57687691e58bf9a846c8a484d55da031.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Chiyoko"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}