{"id": 779746, "slug": "game-de-hakken-tamagotchi-2", "name": "Game de Hakken!! Tamagotchi 2", "name_original": "Game de Hakken!! Tamagotchi 2", "description": "<h2>&#39;Game de Hakken!! Tamagotchi 2&#39; (otherwise known as ゲームで発見！！たまごっち2) is a Nintendo Game Boy title released on October 17, 1997  in Japan. It features forest and ocean-dwelling Tamagotchi characters, both of which would later be adapted into the physical handheld series: &#39;Mori de Hakken! Tamagotchi&#39; (Forest Discovery! Tamagotchi) and &#39;Tamagotchi Ocean&#39;.</h2>\n<p>Being the second installment of the Tamagotchi video game series, it greatly expands upon its gameplay mechanics and Tamagotchi roster. For starters, it offers the player the choice of two modes: &#39;Adventure Mode&#39; and &#39;Tamagotchi Care Mode&#39;. Selecting adventure mode puts the player in the shoes of Mikachu, a girl residing in a village, who can explore freely in search of items (used for care mode), or to simply visit the residents to gain advice or learn more about their home. Extra minigames are also included in this mode.</p>\n<p>Tamagotchi Care Mode works similarly to the first Tamagotchi Game Boy title, where the player fosters an egg until it hatches, and continues to care for it until it evolves (or matures) into different types of Tamagotchi- dependent on how it&#39;s cared for. However, neglecting the Tamagotchi for too long will cause it to pass away, forcing the player to start with a new egg. </p>\n<p>Unlike its first installment, the player can bring up two Tamagotchi pets at once: one terrarium for forest creatures, and the other, a tank, for ocean dwellers.</p>", "metacritic": null, "released": "1997-10-17", "tba": false, "updated": "2022-05-04T14:09:20", "background_image": "https://media.rawg.io/media/screenshots/86c/86c01a54c0b6fa0687539df260fc64c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 19, "reviews_count": 0, "platforms": ["Game Boy"], "developers": ["Tom Create"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["Bandai"], "esrb_rating": null}