{"id": 779786, "slug": "takkoman-kouzatsu-world", "name": "Takkoman -Kouzatsu World", "name_original": "Takkoman -Kouzatsu World", "description": "This title is a derivative work based on the Touhou Project, developed by the two-person dojin circle known as illuCalab. - known for games such as GENSOU Skydrift and A Magical High School Girl.<br/>Interweaving the vibe and worldview of the Touhou Project series with the chaotic sensibilities of the old-school internet, Takkoman brings its A-game when it comes to crazy and stylish 2D bullet hell action.<br/><br/><h3>Story</h3><br/>A world of bounty and order--Gensokyo.<br/>A world of ruin and chaos--Kouzatsukyo.<br/><br/>A great calamity evoked by an unknown being,<br/>which spun these opposite worlds together.<br/><br/>Within this destroyed world, a single girl awakens,<br/>Her name was Takorin.<br/><br/><h3>Game System</h3><br/>Takkoman is an epic side-scroller overflowing with action elements.<br/>Defeat the mini and main bosses in each stage. Show them who's the real boss!<br/><br/>Take down all enemies that stand before you!<br/>Gracefully sidestep waves of enemy fire!<br/>Strike fear into the bad guys with a rich variety of attacks! <br/><br/>Magic gauge filled up? Well, it is time to show off your special attack!<br/>Boost your score by being the flashiest you you can be!<br/><br/><h3>Actions and Attacks</h3><br/>Takorin is a girl capable of all sorts of crazy actions and attacks.<br/><br/>Long range shots for enemies far away? Check.<br/>A two-stage charge attack? Check.<br/>A powerful kick for enemies nearby? Check.<br/>Master more than ten different skills using the directional keys!<br/><br/>Additionally, Takorin can dodge around enemy attacks while dashing!<br/>Not to mention her ability to dash up to twice in mid-air!<br/><br/>", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T04:49:31", "background_image": "https://media.rawg.io/media/screenshots/a23/a2320a1d68b7679be2a4b36250d63fcb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["illuCalab"], "genres": ["Action"], "publishers": ["Playism"], "esrb_rating": null}