{"id": 779759, "slug": "heartstop", "name": "Heartstop", "name_original": "Heartstop", "description": "Heartstop is an emotional, story-driven game, taking place in a world where every living being has suddenly stopped moving.<br/><br/>Play as Cora, who finds herself completely isolated by a mysterious event and is set on finding a way to bring back her friends and family. But as months pass, hope begins slipping away from her and being stuck in one's mind for so long, can be a scary thing. <br/><br/>While new hope is suddenly sparked when Cora meets a stranger who, as her,  seems to have been unaffected by the event, new questions start arising about this girl who is not only moving but also has a completely different outlook on this life. <br/><br/>An uncertain relationship between these two girls begins to form as they seek to unravel the mystery of this petrifying event.<h3>Key Features:</h3><ul><li><strong>IMPACTFUL CHOICES </strong><br/>Each of the many choices in the game, will have an important effect on how the story plays out and how the relationship between the two girls will dynamically grow.<br/><br/></li><li><strong>MULTIPLE ENDINGS</strong><br/>Step into a multitude of branching paths that will eventually lead you into one of the many different endings.<br/><br/></li><li><strong>AN ATMOSPHERIC WORLD </strong><br/>Walk around and interact with the many soothing, yet unsettling locations you will discover throughout your journey.</li></ul>", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2022-05-06T04:20:44", "background_image": "https://media.rawg.io/media/screenshots/9c3/9c3d64f4f9803dc07eedbf0e64f60bf1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["M.A. Starling"], "genres": ["Adventure", "Indie"], "publishers": ["M.A. Starling"], "esrb_rating": null}