{"id": 779758, "slug": "yokai-art-night-parade-of-one-hundred-demons", "name": "Yokai Art: Night Parade of One Hundred Demons", "name_original": "Yokai Art: Night Parade of One Hundred Demons", "description": "By accident, you broke the seal of the mysterious book in your household's storage. The mythical book contains an enormous magical power that allows users to control any Yokai by defeating them and recording their names. This godly power is too much which alerts all the Yokai. So they are coming for the power. You must find your own way to defeat and survive.<h3>Features</h3><ul><li>Experience strong Japanese yokai-culture inspired environment concept.<br/></li><li>Collect various unique yokai girls and unlock their gallery throughout the journey.<br/></li><li>Earn by destroying the enemy and spending your resources to upgrade each unit type.<br/></li><li>Strategically position your units onto a chess-based battlefield to defend your territories.<br/></li><li>Planning ahead to defeat elite Yokai and its minions<br/></li><li>Roguelite upgrade card system to dynamically enhance your units into your playstyle. <br/></li><li>Vary Japanese folklore yokai with different attack patterns—long-range, melee, tanky unit.<br/></li><li>Elemental strength and weakness applied for both ally and enemy units.<br/></li><li>Many levels with different strategies to apply: day, night, and many more...<br/></li><li>Personal skills with multiple upgrade paths to support your strategies.<br/></li><li>Replayable gameplay with various difficulties.</li></ul><h3>Yokai Girls</h3>Collect various unique yokai girls and unlock their gallery throughout the journey.<br/><br/><h3>Enemies</h3>Vary Japanese folklore yokai with different attack patterns.<br/><h3>Chess-style tower defense</h3>Strategically position your units onto a chess-based battlefield to defend your territories.<br/><br/><h3>Upgrade</h3>Gather different materials to upgrade your units.<br/><br/><h3>Day &amp; Night</h3>Many levels with different strategies to apply: day, night, and many more...<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2023-09-12T11:47:33", "background_image": "https://media.rawg.io/media/screenshots/77e/77edda5cf3ba364a6f4a6d55576a7c41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "beaten": 1, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 57, "ratings_count": 2, "suggestions_count": 543, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Secret Labo"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Secret Labo"], "esrb_rating": null}