{"id": 779791, "slug": "its-hard-being-a-dog-2", "name": "It's Hard Being A Dog", "name_original": "It's Hard Being A Dog", "description": "THIS GAME IS EARLY ACCESS AND STILL IN DEVELOPMENT. THERE ARE STILL SOME PLANS AND POLISHING TO BE DONE. THANK YOU &lt;3<br/>please see \"future plans\" (at the bottom) for more details.<br/><br/>A 2D roguelike, Hack and Slash Platformer game where you play as a dog! Defeat creatures and gain power by using your (dog-like?) abilities: Biting, Barking, and Dashing. As you progress through waves the enemies get stronger but don't worry, as various items spawn to fuel your limitless dog-power. Each map has its own theme and setting belonging to a god. Arachne dwells deep within a creepy dungeon. Artemis arises from the ash, dust, and debris of a fallen ruin. What other gods may you dethrone?<br/><br/><br/><br/><strong>Maps and bosses</strong><br/>Each boss in this game is inspired by a Greek mythos! I've given them all my own creative twists, so they aren't exact replicas of their mythology. There are 5 total maps and bosses:<br/><br/><ul><li>GODDESS OF ARACHNIDS, ARACHNE - BOSS OF THE DUNGEON</li></ul><ul><li>GOD OF THUNDER, ZEUS - BOSS OF THE FOREST</li></ul><ul><li>DEER GOD, ARTEMIS - BOSS OF RUINS</li></ul><ul><li>GUARDIAN, CERBERUS - BOSS OF THE VOID</li></ul><ul><li>????? - BOSS OF THE LIBRARY</li></ul><br/><br/><br/><strong>Cool cosmetics!</strong><br/>I've created quite a few of cool (if i do say so myself) cosmetics to decorate your lil dog. A player can have one of each type of cosmetic; a hat, a trail, and a pet. Pets are special types of cosmetic items that provide you with additional stat boosts, like increased movement speed.<br/><br/><br/><br/><strong>message from dev, malgow &lt;3</strong><br/>hi potential players, fyi, this is my very first attempt at an actual pc game! despite that, i am very proud of how far i've come with this project, so i rightfully have developed a massive bias when it comes to how great this game is. however, if this game isn't as polished as others out there, or if it isn't exactly your cup of tea, please be kind, supportive, and patient with me, i am still very new to all this :), i hope you all enjoy my game !<br/><br/><br/><br/><br/><br/>become the dog god you always wanted to be and play ihbad!", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T04:55:01", "background_image": "https://media.rawg.io/media/screenshots/e3d/e3db1d9670cd2d62d418bae331388357.jpg", "website": "http://malgow.net/ItsHardBeingADog", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 15, "ratings_count": 0, "suggestions_count": 271, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MALGOW"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["MALGOW"], "esrb_rating": null}