{"id": 779876, "slug": "the-tales-of-bayun", "name": "The Tales of Bayun", "name_original": "The Tales of Bayun", "description": "<p>The Tales of Bayun is a narrative role-playing adventure set in a dark pagan fantasy world. The game consists of two episodes, each with enjoyable gameplay, its own main characters, storyline, and multiple endings.<br />\nThe game takes place in a flat world resting on the backs of three demon bears. There live—sometimes even of their own free will—favorite characters of pagan and Eastern European folklore. On your way, you will meet bogatyrs, knights, pagans, wild steppe warriors, chorts, vodyanoys, goblins, the Malachite Maid, and even the three-headed dragon Gorynych. And Bayun the Cat, this mean snarky guide, will help...<br />\n(He will help, I said, not like the last time, you fluffy bastard!)<br />\nyou and the main characters unravel the twists and turns of fate and solve complex moral dilemmas... Or come to a sticky end. Who knows?<br />\nFeatures:<br />\nA fascinating story that allows you to live the fate of different characters and decide how you will behave. Do you want to be rude to everyone and then quietly whine about your hard life? Or, on the contrary, be kind and sympathetic while pursuing your own motives? Or just pick a fight at every opportunity? Here you can be anything you want and get the ending you deserve.<br />\nNonlinear gameplay. From 5 to 7 endings in each episode (excluding secret ones), many dialogue and action options. 80% of those who tried the demo version wanted to replay the game with different answers.<br />\nA complex system of interaction with the outside world, along with easy and understandable gameplay, perfectly designed to reveal the plot. Our mission is to let you plunge into a new colorful world and follow a fascinating story, making difficult decisions.<br />\nA signature soundtrack of more than 30 folklore compositions and voice acting in several languages.<br />\nA colorful world, living by its own rules in a thoroughly developed setting. Dozens of locations, characters, and creatures hand-drawn by a team of AAA artists<br />\nA cat. A blue snarky, mean, fluffy cat.<br />\nLast but not least: we intended each game session to last a couple of hours per episode (there are several of them in the game). Everything so that you can relax in the evening or at the weekend and also have time for something else. An exciting, enjoyable, and unforgettable adventure—that&#39;s what we want to give our players.</p>", "metacritic": null, "released": "2023-02-16", "tba": false, "updated": "2023-08-31T08:21:40", "background_image": "https://media.rawg.io/media/screenshots/5e9/5e983c5ca97b6195626be78f3d79aca0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 7, "beaten": 2, "toplay": 12, "dropped": 1}, "playtime": 5, "achievements_count": 10, "ratings_count": 2, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["FlyinDogs"], "genres": ["RPG", "Indie"], "publishers": ["FlyinDogs"], "esrb_rating": "Adults Only"}