{"id": 779803, "slug": "wtf-do-you-know", "name": "WTF Do You Know?", "name_original": "WTF Do You Know?", "description": "<strong>(This game, as well as many others in our bundle, is FANTASTIC for Youtubers &amp; Streamers to create content, engage with their audience, &amp; allow their audience to better get to know them through answering a series of questions about the content creator! This creates a unique experience for all parties involved, and players playing the game themselves can enjoy the solo experience tremendously all on their own as well!)</strong><h3>WTF Do You Know?</h3><br/><br/><strong>Your task is simple.<br/>You will be given a series of facts...<br/>All you have to do, is decide which fact is true, and which fact is false by using your intuition &amp; big-brain skills!<br/>Some of these facts are true.<br/>Some of these facts are false.<br/>But ALL of these facts will make you INCREDIBLY uncomfortable...<br/>You will be scored and evaluated based on your answers and in the end, we will see how you stack up against thousands of others around the world!<br/>Do you have what it takes to decipher the truth from the lies?<br/>Can your brain, stomach, and balls (Or Ladyballs), handle the mind-trickery that awaits you?<br/>One way or another... We WILL find out the answer to... \"WTF Do You Know?\"<br/>And then... We'll find out WTF Do Your Friends Know.<br/><br/><br/><br/>Warning:  WTF Do You Know?  is an adult-themed game with graphic textual details. It is not intended for younger audiences or those who are prudish in any way, shape, or form. Some of the topics involved may be deemed lewd, crude, and incredibly offensive. We hope you enjoy your time playing, and may your panties remain unbunched!<h3>Features:</h3><br/><ul><li> Short and sweet<br/></li><li> Be a part of history with Player - Developer interaction<br/></li><li> The only game with this theme of its kind<br/></li><li> Very atmospheric, psychological, and stupid<br/></li><li> Sit back, relax, and answer in-depth True or False questions to reveal ridiculous facts that SHOULDN'T exist!<br/></li><li> Super affordable for a unique experience<br/></li><li> Disgustingly hilarious and disturbingly revealing</li></ul></strong>", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T05:11:36", "background_image": "https://media.rawg.io/media/screenshots/157/157f8f0bbd1702b47914e79341488415.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Randumb Studios"], "genres": ["Simulation", "Indie"], "publishers": ["Randumb Studios"], "esrb_rating": null}