{"id": 779817, "slug": "fidget-spinner-rpg", "name": "Fidget Spinner RPG", "name_original": "Fidget Spinner RPG", "description": "<strong>Spin, craft, upgrade, and violate the laws of physics.</strong><br/>Fidget spinner RPG is all about spinning a fidget spinner to absurd RPMs. <br/>Along your journey you will level up skills such as mining, blacksmithing, and alchemy. <br/>You will craft equipment to augment your stats and enhance your power. <br/>You will achieve tasks &amp; advance through a nonlinear progression. <br/>You will buy and sell items of all sorts to NPC merchants. <br/>And you will unlock talents that increase your capabilities in exciting ways.<br/>All in the pursuit of more RPM.<br/><br/><strong>Skills, Abilities, and Talents</strong><br/>Level up 7 different skills: Competency, Spinning, Mining, Blacksmithing, Jewelcrafting, Haggling, and Alchemy.<br/>Each skill provides it's own perks: base stat bonuses, unlocked abilities &amp; features, and a passive talent tree to spend points in.<br/><br/><strong>Items, Crafting, and Stats</strong><br/>Items can have nearly any combination of the game's main 13 stats, as well as unique effects that shake up the way you play.<br/><br/>In your pursuit of better gear you'll find that every item you craft increases your crafting proficiency for that item, making subsequent crafts of the same item roll better stats.<br/><br/><strong>Insane Speed</strong><br/>Progress through over the top effects as you reach higher and higher RPM.", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2023-10-10T14:09:02", "background_image": "https://media.rawg.io/media/screenshots/272/2724c9d4f40f40b82d7dd7287a86f928.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "dropped": 1, "playing": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Bryce Summer"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Bryce Summer"], "esrb_rating": null}