{"id": 7798, "slug": "robbery-bob-2-double-trouble", "name": "Robbery Bob 2: Double Trouble", "name_original": "Robbery Bob 2: Double Trouble", "description": "The true king of thieves is back in business!<br/> <br/>Luckless burglar Bob is up to his old tricks again in Robbery Bob 2: Double Trouble.<br/><br/>Sneak around security guards, past patrolling pensioners and evade cunning traps as you try to get your sticky mitts on as much loot as possible.<br/><br/>Robbery Bob 2: Double Trouble Features:<br/><br/>The man of steal is back! – and he’s landed himself in all sorts of trouble. Help Bob plan a wedding for a mobster’s daughter, stop Dr. Thievious’ devious plans and find out if aliens really do exist?<br/><br/>60 new levels of lootin’ fun! ­– What goodies will you loot as you sneak around the streets of Playa Mafioso, Shamville and Seagull Bay?<br/><br/>Hide and Seek – Sneak around on tip-toe, hug walls to stay out of sight, make noise to distract guards and, if you’re caught red handed, get out of there quick!<br/><br/>Old Bob, New Tricks – Use RC Cars, Teleportation Mines and tons of new gadgets to help Bob get out of a tight squeeze.<br/><br/>Suited and looted – Sneak in style with a variety of outfits from Cassie’s Costume Rental service.<br/><br/>Follow more of Bob’s antics on the Robbery Bob Facebook: http://www.facebook.com/RobberyBob<br/><br/>Important Consumer Information. This app: Requires acceptance of EA’s Privacy &amp;amp; Cookie Policy and User Agreement.Includes in-game advertising. Collects data through third party ad serving and analytics technology (see Privacy &amp;amp; Cookie Policy for details). Contains direct links to the Internet and social networking sites intended for an audience over 13. Allows players to communicate via Facebook notifications. To disable see the settings in-game. <br/><br/>User Agreement : http://terms.ea.com/en<br/>Privacy &amp;amp; Cookie Policy : http://privacy.ea.com/en<br/>Visit http://www.chillingo.com/about/game-faqs/ for assistance or inquiries.<br/><br/><br/>EA may retire online features and services after 30 days notice posted on www.ea.com/1/service-updates", "metacritic": null, "released": "2015-06-04", "tba": false, "updated": "2019-10-22T14:29:33", "background_image": "https://media.rawg.io/media/screenshots/a92/a92014025f08813704381c561afb512c.jpeg", "website": "https://chillingosupport.zendesk.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": [], "genres": ["Action", "Adventure"], "publishers": ["Chillingo"], "esrb_rating": "Everyone 10+"}