{"id": 779895, "slug": "paige-turner", "name": "Paige Turner", "name_original": "Paige Turner", "description": "<h3> Complete the story and reconnect a father and daughter! </h3><br/>This is a game created by students at the University of Central Florida in the GaIM program.<br/><br/>In this adventure, you'll travel through a magical library and enter storybooks in order to reconnect a father and daughter after tragedy tore them apart.<br/><br/>Players take on the role of Auri, the healer of giants, an origami creature of unknown origin.<br/><br/>Players will be able to transform into different forms in order to run and jump their way to the end of this story.<br/><br/>This roughly 40-minute-long adventure lets you jump and glide your way over various puzzles over 5 different and varied levels. Players can expect to run up against some interesting platforming puzzles and narrative interludes.<h3> An environment with a story! </h3><br/>Explore a library lost to time at the hands of grief and help heal the troubled keeper of the library, Turner, from the grief that ails him. The library holds the key to the source of Turner's anguish. Player's will be guided throughout the library by magic candles that have been imbued by some form of protective magic, leading you to the next piece of the story.<h3> Key Features </h3><ul><li> Platforming and puzzling through 5 distinct and varied levels!<br/></li><li> A touching story about reconnection.<br/></li><li> Full controller support.<br/></li><li> 4 unique abilities to assist traversal!<br/></li><li> Fully voice-acted!</li></ul>", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2022-05-06T06:59:35", "background_image": "https://media.rawg.io/media/screenshots/c2f/c2fc1bfc656d28f925502d936c7f5ad6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Storytelling Sort"], "genres": ["Adventure", "Indie"], "publishers": ["The Storytelling Sort"], "esrb_rating": null}