{"id": 779821, "slug": "trpg-workshop", "name": "TRPG Workshop", "name_original": "TRPG Workshop", "description": "Driven by their intense zeal for making an easier-to-use and more user-friendly online TRPG platform providing players more freedom, these veteran gamers develop TRPG Workshop. It is deemed as a comprehensive TRPG auxiliary platform that gives players a great degree of freedom. This means that TRPG Workshop almost contains all the functions needed for TRPG games and renders a visible and simple solution.<br/><br/><br/><ul><li><h3>Interactive Visualnovel-like gameplay brings more engaging game experience</h3></li></ul><br/><br/><br/><ul><li><h3>Act as GM, Player or Spectator</h3></li></ul>The GM and Players in a single room have different abilities and rights including visible methods to throw a dice or switch the background -- all for your convenience!<br/><br/><br/><ul><li><h3>Check visible profiles in game anytime</h3></li></ul><br/><br/><br/><ul><li><h3>In-game map editor</h3></li></ul>Share maps via Steam Workshop or other ways. On a map, there exists the Fog of War blocking your vision, little Tokens representing your characters, and even different accidents that may take place to change the world.<br/><br/><br/><br/><ul><li><h3>Replay your game when it ends!</h3></li></ul>Every game in TRPGWORKSHOP will be recorded. Any choice you have made and any throwing of dice will remain unchanged. Logs are replayable and shareable.<br/><br/><br/>Rulebooks are supported. Share them with friends or on Steam Workshop!<br/><br/><br/><br/><ul><li><h3>Share and re-create</h3></li></ul>Steam Workshop will be fully available for TRPG Workshop. Backgrounds, character illustrations, map, map resources, scenario mods and even rulebooks or character cards are all free to customize and share on Steam Workshop at will.<br/>Powerful resource manager is also supported for TRPG Workshop. Just one click to sort out your creations as easy as blowing off dust.<br/><br/><br/><ul><li><h3>Future</h3></li></ul>Apart from various built-in resource packages for the platform, we are engaging in developing many convenient functions including QuickNote, voice-to-text log or even illustration production and facial capture for Live2D visual characters.", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-06T05:33:22", "background_image": "https://media.rawg.io/media/screenshots/52b/52bc703f30233874da4e1a4862b40f66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Starship Studio"], "genres": ["Adventure", "RPG", "Strategy", "Simulation", "Casual"], "publishers": ["Starship Studio"], "esrb_rating": null}