{"id": 779912, "slug": "unlock-the-feelings", "name": "Unlock the Feelings", "name_original": "Unlock the Feelings", "description": "Unlock the Little Inner Monsters we all have.<br/><br/>Do you know your Little Inner Monsters? These are the different feelings we deal with on a day-to-day basis.<br/>In the Little Inner Monsters universe, we have 36 feelings, portrayed as cute monsters. They will be present in a Card Game to be released soon.<br/><br/><br/><br/>For now, in this Wordle-like game, solve the enigma by finding the correct sequence of 1 Arena and 4 feelings.<br/>The secret sequence is one specific out of 500,000 possible combinations! By thinking like a codebreaker, you can use your logical skills to narrow down the possibilities and find it.<br/>As in real life, luck can be useful, but the more you improve your strategy, the less you depend on it.<br/> <br/>At the end of your turn, you are invited to record your thoughts in your journal. From the solution choose one of the feelings, put it in the Arena, and write how you feel about it. Your personal journey will be available for you to view at any time!<br/><br/><br/><br/>The cards include:<br/>- The 36 monsters from the Little Inner Monsters card game, representing the feelings and emotions we deal with in our daily lives.<br/>- The 6 Arenas representing different environments we can be.<br/><br/>The enigma contains: an Arena, a Feeling that belongs to that arena, plus 3 other Feelings.<br/><br/>Ths solution follows these rules:<br/>- The first position is an Arena;<br/>- The first feeling is related to that Arena;<br/>- There is no more than one feeling from the same Arena.<br/><br/>Start from scratch and make your hypothesis.<br/><br/>After entering a sequence, the feedback will show your correct and incorrect attempts:<br/>- Green: The feeling is in the correct position;<br/>- Yellow: the Feeling is in the solution, but the position is wrong;<br/>- Blue: the Feeling isn't present in the solution, but its Arena is in the correct position;<br/>- Red:  the Feeling isn't present in the solution, and its Arena is not in that position.<br/><br/><br/><br/>You have up to 8 attempts to find the solution (6 in the most challenging mode)!<br/><br/><br/>- When an enigma is solved, you can register your reflections about the Arena and one of the monsters, creating your personal gallery.<br/>- Calming background music related to the chosen arena.<br/>- The game is <strong>FREE and COMPLETE</strong>. Play as much as you want: no daily limits, no paid additional content, no paywall.<br/><br/><strong>Get the Artbook and Soundtrack and support the developers!</strong><br/><br/>", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2022-05-06T07:20:46", "background_image": "https://media.rawg.io/media/screenshots/45b/45b885e95cfae0f4634ebaf8bfe74814.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mens Sana Interactive"], "genres": ["Strategy", "Casual"], "publishers": ["Mens Sana Interactive"], "esrb_rating": null}