{"id": 780, "slug": "starbase-orion", "name": "Starbase Orion", "name_original": "Starbase Orion", "description": "\"The best 4X game currently available for mobile\" - PocketTactics.com<br/>\"This one is geek heaven\" - AppAdvice.com<br/>\"Master of Orion in Your Pocket” - GamePro.com<br/>\"Starbase Orion has an epic-feeling\" - TouchArcade.com<br/>\"Starbase Orion is here, and it's glorious.\" - TUAW.com<br/><br/>Explore. Expand. Exterminate. Can you defeat your friends and become the ruler of the galaxy?<br/><br/>Starbase Orion is an old-school 4X space strategy game that draws inspiration from titles such as Master of Orion and Galactic Civilizations. Lead your empire from the birth of its space age; colonize new worlds, explore new horizons, and discover other players attempting to do the same. It is a race to the stars where only one empire can declare victory over the galaxy.<br/><br/>New to 4X Strategy Games? No Problem<br/><br/>Starbase Orion includes a hand tailored tutorial mission perfect for those new to the genre. It features high-quality voice acting provided by the very talented Maurice Thomas.<br/><br/>Aged like a Fine Wine<br/><br/>With nearly a five year life span the dedicated community of Starbase Orion players and the developer have produced twenty-four fantastic updates. Each update has introduced new features and player suggested functionality to make the game better, more strategic, and more immersive.<br/><br/>Strong Single-Player Experience<br/><br/>Compete against a battle-tested artificial intelligence. Our AI was derived from our entry into to 2010 Google AI contest, where it placed in the top 15% of thousands of competing intelligences. Go head-to-head against a single AI opponent, or ramp up the carnage with a 4 way free-for-all.<br/><br/>GameCenter Multiplayer Turn-Based Games<br/><br/>Starbase Orion was designed to provide a fantastic multiplayer experience. Launch the game, sign into GameCenter, and start a new multiplayer game. No need to coordinate play times or seek out other players. Just go play, when you want and on your terms.<br/><br/>Choose Your Race, Or Create Your Own<br/><br/>There are five uniques races included; Human, Draske, Vass, Cyban, and Isather. You can also create your own custom race by picking and choosing between different race characteristics.<br/><br/>Intense Space Combat<br/><br/>Design your ships from a variety of weapons, hull, and systems. Send them into battle against the enemy. Give them orders, then watch the battle in unfold as they duke it out in the dark expanses of space.<br/><br/>Diplomacy, Espionage, Free Agents<br/><br/>Direct confrontations not your cup of tea? Negotiate your way to victory through diplomatic endeavors. Confound your enemies with an army of spies. Contract one of the many power and unique leaders to help you to victory.<br/><br/>iCloud Support<br/><br/>Starbase Orion is built from the ground up for iOS 5. It supports iCloud so that your saved games are instantly available on all of your devices. Start a game at home on your iPad, then pick it up again the next day on your iPhone. Simple, streamlined, fantastic.<br/><br/>Universal - You Bought the Cool Gadgets, Go Play on Them<br/><br/>Full support for iPad, iPhone, iPod, standard and Retina displays. Play when you want, where you want.<br/><br/>Guaranteed Pricing<br/><br/>While it is quite common for apps to become “free for a day”, Starbase Orion is not one of those apps. The standard price for Starbase Orion is $7.99 USD; it will never run a “free for a day” campaign. Tens of thousands of players have placed their confidence in us by purchasing Starbase Orion, and this is our guarantee to you.<br/><br/>Guaranteed Free Updates<br/><br/>We have a lot more planned for Starbase Orion. We plan to release all updates for free, without any hidden fees or In-App Purchases.", "metacritic": null, "released": "2011-10-12", "tba": false, "updated": "2019-07-30T15:56:12", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c0ff833d2f83788991af7e9b8fdf39e.jpeg", "website": "http://www.chimerasw.com/starbaseorion/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chimera Software"], "genres": ["Strategy", "Simulation"], "publishers": ["Chimera Software"], "esrb_rating": null}