{"id": 780146, "slug": "end-of-despair", "name": "End of Despair", "name_original": "End of Despair", "description": "End of Despair\r\n<p><strong>End of Despair </strong>is a pixel action game with rogue-like elements about a man who is tired of routine and self-flagellation. Talk to other people, find all the secrets, defeat the bosses in randomly generated locations.<br/></p>\n\n<p>Work overtime within four walls, return to the empty apartment, go to the office again. Day after day, year after year -- this is how Nathan lives.<br/></p>\n<p>Loneliness, burnout and a variety of angry thoughts slowly dragged him into the abyss of despair. And he will not get out on his own.<br/><br/>Help him in his endless battles with difficult memories, search with him the source of his state. Put an end to his despair.<br/><br/><br/></p>\r\nKey Features:\r\n<ul><li><strong>A Huge Glowing Cat!</strong>\n</li></ul>\n<p>You won’t be alone on your dangerous journey! Co-workers, childhood friends, old acquaintances — all will offer ways to help. And you can find a big fluffy cat who loves shinies!<br/></p>\n<ul><li><strong>Various types of enemies and locations</strong>\n</li></ul>\n<p>Explore Nathan's memories, look for the secrets, defeat a large number of hostile creatures to find a way out of his suppressed consciousness.<br/></p>\n<ul><li><strong>You are not alone</strong>\n</li></ul>\n<p>In Nathan's memories, you can find other people who found themselves in a difficult situation. With their help, overcome his mental problems and also help others!<br/></p>\n<ul><li><strong>Share stickers with others. Stickers change everything!</strong>\n</li></ul>\n<p>They affect your shots, attributes, enemy behavior — and combine for new effects. You can also send them to Nathan’s friends and hear their personal take on each one!<br/></p>\n<ul><li><strong>We put our souls into the game</strong>\n</li></ul>\n<p>A magical soundtrack, pleasing visuals and rogue-like gameplay are not all we want to give. The plot contains problems and topics that we experienced as well. If you recognize yourself in these stories, we want you to know -- you are not alone, keep on fighting. We believe in you!</p>\nCheck out our socials: <p> </p><p>E-MAIL: <em>trioskaz@gmail.com</em></p> Check out our demo (download here or on Steam)", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2022-05-06T09:03:21", "background_image": "https://media.rawg.io/media/screenshots/f20/f20eb8aa006b9702af46d52a2180b4e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trioskaz"], "genres": ["Action"], "publishers": [], "esrb_rating": null}