{"id": 780184, "slug": "playlist-cars-multiplayer-fun", "name": "Playlist Cars Multiplayer Fun", "name_original": "Playlist Cars Multiplayer Fun", "description": "<p>Are you ready to enjoy the fun with your friends? The best car mini games you can play on mobile are in this game. Fight with your friends in different game modes and win the game. Different modes and different maps are waiting for you. Play the Playlist Cars game online as you wish with your friends and different people and enjoy the fun.</p>\n<p>Sumo Mode:</p>\n<p>-Knock out your enemies from the green and be the last one.</p>\n<p>-According to the game, you can get a big car and throw the enemies out of the field, or you can buy a small car and run away from the enemies, get under their cars and narrow them down.</p>\n<p>-Destroy your opponents with your own Playstyle.</p>\n<p>- Show them who is the boss in the game.</p>\n<p>Face To Face Mode:</p>\n<p>-Reach the opposite zone before here and reach the next level car.</p>\n<p>-The enemies will come the same way. You can push them or ignore them and play to win easily. Be careful, the enemies may think like you too.</p>\n<p>-The most important thing in this mode is to think better than everyone else and choose your moves properly.</p>\n<p>-The one who reaches the last car is the winner of the game.</p>\n<p>New game modes and maps will be added to the game soon. You can tell us the features, modes and maps you want to be added to the game. The game evolves and mods are added at the request of the players.</p>\n<p>Prepare to defeat your enemies.</p>\n<p>Who contributed:</p>\n<p>-Yusuf Akbulut</p>\n<p>-Eyup Akgüç</p>\n<p>-Ahmetcan Akgüç</p>", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2022-05-06T09:19:24", "background_image": "https://media.rawg.io/media/screenshots/906/9068399f8b8bed49deff6d5260c14d0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TheFlash01453"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}