{"id": 780212, "slug": "nightfall-itch-samvog-voidmist707-manchmalscott-sh", "name": "Nightfall (itch) (samvog, voidmist707, manchmalscott, Shaik_Pasha, Maya55)", "name_original": "Nightfall (itch) (samvog, voidmist707, manchmalscott, Shaik_Pasha, Maya55)", "description": "Nightfall\r\n<p>You must make crucial decisions and do whatever it takes to survive. You have been stranded on an alien planet, all by yourself. Nothing ever goes your way and you must use your limited oxygen efficiently and effectively in order to gather materials so you can make it to the next day. Unfortunately, your work does not end when the sun sets and the unfamiliar stars rise. A diverse array of enemies will attack you fiercely at night and you must find their weakness to take them down. You must defend your own life as well as everything you've built in order to make it home. <strong>Win the game by collecting enough crystals to repair your satellite dish and communicate back home!</strong></p>\n\r\nCONTROLS\r\n\n\r\nGUIDE\r\n<ul><li>The game <strong>saves</strong> every dawn! Click \"Load Game\" to access a save (if it exists).</li><li>Gather <strong>Wood</strong> from fallen trunks hidden in the glowing grass</li><li>Find mineral <strong>Met</strong><strong>als</strong> embedded into the jagged cliff-faces </li><li>Use resources to <strong>synthesize Climbing Hooks </strong>and <strong>Bridges</strong></li><li>Collect mysterious <strong>Crystals</strong> to repair your dish</li><li>Return near your base to replenish <strong>oxygen</strong></li><li><em>Defend your base at night from creatures that emerge from the moonless night</em></li></ul>\n\r\nPOST MORTEM\r\n<p>Overall, what we felt went well was the overall team communication. As we had worked together last semester we already knew each other's strengths and weaknesses, and after two jams with random teams we had come to appreciate the ease with which we worked together all the more. We all knew from the beginning that we could rely on each other and that made the process easier and less stressful.\r\n</p>\n<p>\tThe major problem that we faced was a lack of time to devote to the project. We all found ourselves busy with other classes and especially finals at different times, and during the beginning of the project our busyness overlapped meaning we lost valuable time we could have used to polish the game and/or add more content. Other problems came from Unity's instability, troubles with Git integration, and the organization of our files.</p>\n<p>\tWe overcame the lack of time by dramatically simplifying the game. We decided to modify the amount of things to collect and do in the game so we could spend what time we had focusing on the core gameplay: exploring a strange world to collect power crystals in order to activate your rescue beacon.\r\n</p>\n<p>\tAs far as changes go, we reduced the number of materials the player was able to collect (now only power crystals, metal, and wood), we tuned the crafting system to no longer include different weapons and tools, we removed one enemy type (the flying enemy), we removed the oxygen tank upgrading, and finally removed the scripted difficulty increase on the enemies. Obviously, there were many features we did get into our prototype, but the scope of our initial design document was just too great.</p>\n<p>As a team,  we learned the importance of creating smaller goals.  One of our best jumps in progress came when we all focused on achievable milestones allowing us to have what was close to a vertical slice. By planning out things more carefully the whole didn't feel as overwhelming. As individuals we all learned a lot: Unity and Git workarounds, coroutines, streamlining UI creation, low poly modeling, how to more effectively reference people's code, proper topology, rigging, and more.</p>\n\r\nTEAM MEMBERS\r\n Team 18 - CPI 211 \r\n<ul><li>Patrick Gelvin</li><li>Suhaas Godavarthy</li><li>Shaik Pasha</li><li>Samuel Vogel</li><li>Cristina Maya</li></ul>", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2022-05-06T09:32:03", "background_image": "https://media.rawg.io/media/screenshots/573/5739670a8b05716a74824597a8f650a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Maya55", "Shaik_Pasha", "voidmist707", "manchmalscott", "samvog"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}