{"id": 780332, "slug": "sockys-puppet-show-ep-1", "name": "Socky's Puppet Show! Ep. 1", "name_original": "Socky's Puppet Show! Ep. 1", "description": "Welcome to Socky's Puppet Show!\r\n<p>Socky's Puppet Show!™ was the most popular kids show on the planet...until a child in the audience was mysteriously murdered. The studio was quickly shut down and Socky's! was off the air permanently. As an investigative journalist, you decide to explore the abandoned building and find out what <em>really </em>happened. Oh, and there's been mysterious things going on. It's <em>fine</em> though! You just need to grab a folder with the info on the accident and you can be on your way...</p>\n<p>__________________________________________________________________________</p>\n<p>Episode 1 of Socky's Puppet Show lets you explore a small portion of the studio. Your goal is to find the folder and get out. There's some secrets and extras as well. Once you have found the folder, you can try to leave. This is mostly a short backstory to the next one, which will be puzzle focused. Hope you enjoy, follow us for updates on the next episode!</p>\n<p>---------------------------------------------------------------------------------------------</p>\n<p>Features:<br/></p>\n<p>- A well made environment<br/>- Terribly hand drawn art!<br/>- Super creepy and atmospheric<br/>- Short length, terrifying experience thanks to our patented dynamic horror system<br/>- Secrets!</p>\n<p>Thank you for playing! Please let us know about any bugs so we can fix them ASAP. If any developers would like to use this premise or any of our art, let us know in the comments and we can contact you :)</p>\n<p>---------------------------------------------------------------------------------------------</p>\n<p>NOTE: Please note that this is a short set-up for the next episode which will feature lots more gameplay. Do not expect more than 10 minutes of playtime. Thank you.</p>", "metacritic": null, "released": "2022-05-04", "tba": false, "updated": "2022-05-06T10:26:53", "background_image": "https://media.rawg.io/media/screenshots/f86/f86aa70dfeb1103584802c7feba246cb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagicChickenStudios"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}