{"id": 780788, "slug": "pokemon-rocket-edition-evil-ash", "name": "Pokémon Rocket Edition: Evil Ash", "name_original": "Pokémon Rocket Edition: Evil Ash", "description": "<ul><li>This rom hack is made by me Gbt773, It took quite not that long I had to keep exporting images from pokemon ash gray and</li><li>importing them to a known already-existing rom hack called \"Pokemon Rocket edition\" So, If your wondering. What if</li><li>Ash was evil? What if ash was working with team rocket? I've thought about creating a rom hack like this I have no idea why</li><li>Doesn't a rom hack like this exists like this idea is the coolest thing I've ever thought of and I feel like this is a dumb</li><li>Idea. I don't know why doesn't a such a game exists but I feel like I get the cool ideas here. So, The charater of ash</li><li>was copied from Pokemon Ash Gray Version, And If you get promoted to an admin on the game you might switch into a grunt</li><li>Not ash anymore, I tried to change the admin version character and same for the executives, But I never found them Using</li><li>Overworld Editior rebirth Edition. So, If you know how I can change the admin and Executive character let me know in the</li><li>comments on my itch.io. So, Heres a fun fact. The other grunts might be ash aswell, So you might not be the only ash, When</li><li>I was changing the main character somehow it applied to all the other grunts including the player. It was only meant for</li><li>the player but theres now a million dark ashes here. Thank you for playing the mod. And One day I'll find how to change</li><li>Your character from an Admin and executive.</li></ul>", "metacritic": null, "released": "2022-05-03", "tba": false, "updated": "2023-04-27T08:28:20", "background_image": "https://media.rawg.io/media/screenshots/ae5/ae55bed08b79e061cdcc6567e9d4a58a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "PC"], "developers": ["GBT773"], "genres": ["Action"], "publishers": [], "esrb_rating": null}