{"id": 78082, "slug": "burracoon", "name": "BurracoON", "name_original": "BurracoON", "description": "The most traditional and loved game, now can be played for free and without limits of moves. <br/>Enough with buying coins to play!<br/><br/>BurracoON was created with the highest technological features, respecting the classic configuration of the game, that will give you the most realistic  and vivid gaming experience. <br/><br/>Burraco is a card's game for four people, distributed in 2 teams.<br/><br/>Here are 20 excellent reasons for you to download the funnier game of the category!<br/><br/>− BurracoON  is 100% for free and unlimited! <br/>− It's not necessary a register to play, play fast and hassle free. <br/>− You'll never need to buy coins or chips to play with us. <br/>− Thousands of players are ALWAYS ready to play with you. <br/>− Diary, monthly and general rankings, stay at the highest spot and make fun of your friends.<br/>− Dynamic and animated screens turn it into a more fun and interactive game. <br/>− The chat is open during the game to speak out and make new friends<br/>− 30 different avatars for you, to choose the one that fits you the most. <br/>− Multiplayer game, invite your friends to your table and play online. <br/>− Play using 3G, 4G, or Wi-Fi. <br/>− Create your registration and use it also to play TrucoON<br/>− Your data will be stored online and protected by your password. You can logon from any device and access your profile.<br/>− Promotions and giveaways at our facebook fanpage<br/>− BurracoON was developed, adapted and tested on the most diversified devices and screen formats, for the purpose of guarantee the best playability and performance to all IOS devices.<br/>− Animated and illustrated interface<br/>− Application frequently updated bringing improvements suggested by players.<br/>− Developed in HTML5<br/><br/>Everything 100% free and unlimited! Download now, check it  and rate it! =)<br/><br/>Don't know how to play Burraco?  <br/><br/>BASICS CONVENTIONS OF BURRACO<br/><br/>Players: 2 or 4<br/><br/>Numbers of cards: 108 (2 decks with 2 jokers each)<br/><br/>Distribution: 11 cards  to each player and two  stockpiles with eleven cards in each one.<br/><br/>Target: The team who makes more points wins.<br/><br/>To make a meld: A meld is formed by 3 or more cards of the same suit, arranged in numerical sequence. The sequence goes from the 2 to the King (K). You can put the Ace (A) before the 2 or after the King. During the game you can add more cards to the meld. <br/><br/>Buying the discard pile: To buy the discard pile, just click on the cards that are on the discard. <br/><br/>Stockpile: A deck of 11 cards that a player receives when the cards of his hand are over. If the game is with 4 players, each stockpile corresponds to a double. Only the first player of the double, who ends with his cards, can pick up the stockpile. It’s not possible that the same double, or even the same player,  to pick up two stockpiles. If the bunch’s cards  reaches the end , and if there is any stockpile at the table, this one will be automatically used as bunch. <br/><br/>Going out: To go out means when the cards of a player ends, if this player or team has already picked up the stockpile. If the stockpile hasn’t been picked by any player, the only way to go out is when both stockpiles become bunch and the cards in the player’s hand has ended. <br/><br/>Going out directly: It’s when the player ends up with his cards without discarding any, in other words, all the cards goes to his melds. If there’s any stockpile, the player will pick it up and will continue to play without buying any card. <br/><br/>Going out indirectly: Occurs when the players ends the cards in his hands discarding any other. If there’s a stockpile, the player will pick it up, playing only at the next round, when it’ll be his turn again.<br/><br/>Canasta: Meld of seven cards or more of the same value or in sequence, of the same suit. There are four types of Canastas.<br/><br/>To know the Project better enter: <br/>- www.burracoon.com<br/>- facebook.com/burracoon", "metacritic": null, "released": "2012-03-21", "tba": false, "updated": "2019-10-22T14:23:26", "background_image": "https://media.rawg.io/media/screenshots/344/3448283a9bbf4ff2f09a0598cfca9ded.jpg", "website": "http://onrizon.com.br", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gartic"], "genres": ["Board Games", "Card"], "publishers": ["Henrique Almeida"], "esrb_rating": null}