{"id": 78092, "slug": "detective-love-choices-games", "name": "Detective Love Choices Games", "name_original": "Detective Love Choices Games", "description": "Create your own story by making choices carefully! Detective Love Choices Games is a brand new love story dating game with many interesting episodes and captivating crime stories! Help our main heroine prove that she is a true detective, capable of crime scenes investigation and solving mystery murders! Find time for love in your busy schedule and choose life partner in these virtual episode story games! Choose your own ending to these detective stories – join a murder investigation, solve mystery cases, interrogate witnesses and suspects and put an end to wars of mafia and organized crime in your city! Enter the mind of the criminal behind the mysterious murder - play as a policewoman – a renowned detective and investigator – and solve crimes and mysteries in the best love story games with chapters and episodes! If you are a fan of detective fiction, crime investigation games, love stories and virtual novels, you are in the right place – download love games 2018 and choose your story today! <br/><br/>- Do serious detective work: Investigate clues, follow leads and interrogate suspects and murder witnesses to get to the truth! <br/>- Read interactive stories: Play simulation life games and enjoy interactive storytelling!<br/>- Escape from dangerous situations: Negotiate with criminals, dodge a bullet, protect your partner!<br/>- Solve criminal cases: Discover who killed the young guitar player - catch the perpetrators red-handed and protect case witnesses from angry gangsters!<br/>- Find your true love: A handsome detective or a romantic artist – who will be your prince charming in the end?<br/>- Dress with style: Casual, trendy or chic – play dress up games and find your favorite style!<br/>- Write your story: Your choice matters – select carefully and choose your ending in the best simulation games 2018!<br/><br/>Supported languages: English, Deutsch, Español, Français, Italiano, Polski, Português, Slovenčina, srpski, Türkçe, Русский,العربية <br/><br/>Detective stories in English – read a real crime story today!<br/>Detective Love Choices Games is a perfect romantic love story for girls who love kissing games and dating apps, and a mysterious action game for boys who enjoy crime solving games and crime stories! Interactive detective stories will keep you entertained for a long period of time – if you enjoy reading mystery fiction combined with romantic love stories, you are in the right place. Help a beautiful investigator solve crimes and write your story with a happy ending by making the right life choices!", "metacritic": null, "released": "2018-06-13", "tba": false, "updated": "2019-07-30T03:05:31", "background_image": "https://media.rawg.io/media/screenshots/a6e/a6e827c2b07b5618637e029502c2cc99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Midva Games"], "genres": ["RPG", "Simulation"], "publishers": ["Midva"], "esrb_rating": null}