{"id": 7812, "slug": "dungeons-of-evermore", "name": "Dungeons of Evermore", "name_original": "Dungeons of Evermore", "description": "The Dungeons of Evermore combines the easy accessibility of board-based role-playing games like Wrath of Ashardalon and Descent: Journeys in The Dark with the complexity of the computer-based role-playing game, creating a game that is simple to understand, easy to pick up and play, and yet challenging.  <br/><br/>Dungeons of Evermore Features:<br/><br/>* A party based system allowing up to 4 characters in the party<br/>* 5 different classes (warrior, adventurer, priest, mage and bard) and 5 different races<br/>* Randomly generated dungeons with a difficulty level based on the number of characters in the party, so you can adventure solo, as a duo or as a full party<br/>* Multiple mission types to keep you on your toes<br/><br/>Dungeons of Evermore combines rogue-like elements with a full party experience, balancing traditional rogue-like features such as permanent death with the ability to bandage your fallen comrade if you can get to him in time.  The dungeon also offers a means of escape, so if your party is beaten back, you can run for the exit.   This creates both a challenge and a level of excitement.<br/><br/>Note: The public domain tilesets used in Dungeons of Evermore come from the RLTiles collection. Additional graphics come from Antifarea, William.Thompsonj, Redshrike, XCVG, Justin, Nichol and Liosan from opengameart.org and Ayene-chan from DeviantArt.  Some of the sounds used come from www.freesfx.co.uk, including sounds by qudobup,.", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-07-30T05:45:29", "background_image": "https://media.rawg.io/media/screenshots/b0c/b0cc36c226d27f81294fc53e512c7a9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Nations"], "genres": ["RPG", "Board Games"], "publishers": ["Daniel Nations"], "esrb_rating": null}