{"id": 781346, "slug": "slot-game-rpg", "name": "Slot Game RPG", "name_original": "Slot Game RPG", "description": "<p>Slot Game RPG is a casual arcade-RPG slot machine game where the player can spin with out real money being involved. You can trade your herb for berries and sharpen your attack skills at the cost of diamonds. Luck is the main requirement for this RNG based game, which is something you can enjoy testing while changing the tone of the game to the color of your choice!</p>\n<p>Gather Mode:\r\n  </p>\n<p>Requiring a minimum of 10 items total to continue to battle mode, gather mode gives the player the option to spin to collect money, herbs, diamonds, and berries. This is useful for before entering a battle, where the berries can be used for healing, by luck of course. The diamonds and money can be used in the shop, you can use the diamonds to upgrade your attack damage by +3, and you can use the money to buy items. The herbs are mainly used to trade for berries, since the player has no other usage for them.\r\n  </p>\n<p>Battle Mode:\r\n  </p>\n<p>            The main difference with slots is now you can’t collect herbs, the berry slots will consume a berry for health, with the potency depending on how many berries you roll. The sword slots do damage towards the enemy and the skull slot does damage towards you.\r\n  </p>\n<p>            <em> Will you be lucky enough to defeat all the enemies on your first go? </em>\n</p>", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T18:04:06", "background_image": "https://media.rawg.io/media/screenshots/533/53322edabd934d46de88926a270a18db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Weslington"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}