{"id": 78135, "slug": "4-members-1-kpop-boy-group", "name": "4 Members 1 KPop Boy Group", "name_original": "4 Members 1 KPop Boy Group", "description": "Here is a new \"4 Members 1 KPop Boy Group\" quiz game featuring different KPOP boy groups. You are presented with 4 images of a member. Your task is to recognize the member and name the KPOP boy group.<br/><br/>We not only included the current most popular groups, we also included those groups that already disbanded and also an image of a member that no longer in the group.<br/><br/>Test your KPOP knowledge and distinguish your favorite groups with the others.<br/><br/>Features:<br/>-107 Levels: Frequent Update<br/>-HIGH-QUALITY DESIGN: optimized for all screens (phones/tablets)<br/>-OFFLINE SUPPORT: Use offline, no internet needed<br/>-100% FREE: This game is free to download and play.<br/>-HELPFUL HINTS: You stuck in a hard puzzle? dont worry you can solve the puzzle using your free hints! -You can even consult your friends on facebook<br/><br/>If you love quizzes and love KPOP, then this is the perfect app for you. You can even use it offline when you don’t have an internet connection, as the app works offline too.<br/><br/>How well do you know your favorite boy group member?!<br/><br/><br/>Disclaimer:-<br/>-All images are copyright of their respective owners. If we have violated any copyright by use of any images included in this game, please get in touch with us at admin@techiurus.com and we shall promptly remove it.", "metacritic": null, "released": "2018-07-26", "tba": false, "updated": "2019-10-22T14:23:27", "background_image": "https://media.rawg.io/media/screenshots/a80/a8001f2c9bd838dc6012341d302c94ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Denis Slava"], "genres": ["Puzzle"], "publishers": ["Denis Slava"], "esrb_rating": "Everyone 10+"}