{"id": 781463, "slug": "lantana", "name": "Lantana", "name_original": "Lantana", "description": "Lantana\r\n<p>Can you reduce the spread of the invasive Lantana before it overcomes the indigenous landscape? Plant trees to block the path of the Lantana spread, and dig trenches next to the water to cut off it's path.</p>\n\r\nHow it works:\r\n<p>Each turn you can perform one action before progressing to the next turn. Each turn the goal is to use either a tree or a trench to block the Lantana spread.</p>\n<p>Trees can be planted anywhere on the grass, just be sure to allow them one turn to grow so that they can block the Lantana's path. Be careful though, if a tree is planted right next to a Lantana the Lantana can kill the tree before it is able to grow!<br/>Dig trenches anywhere next to water in order to immediately cut off the path of the Lantana.</p>\n<p>Perform one of these actions each turn to try and limit the spread of the Lantana.<br/>Each turn the Lantana will grow out in the four adjacent tiles (As shown by the gifs alongside). Be sure to block the path it will take!</p>\n<p>You'll need to reduce the spread as much as possible in order to progress each level. If you get stuck however, the solutions will be available on the Discord.</p>\n\r\nControls:\r\n<p>WASD/Arrow Keys:     Move the tile selector<br/>Space:               Plant tree / dig trench<br/>Enter:               Progress turn<br/>Mouse/Touch:         Plant tree / dig trench</p>\n\r\nWhat are Lantana flowers?\r\n<p>The invasive flower Lantana is an alien plant in the South African landscape and is a serious threat to indigenous species. Lantana replaces indigenous species and reduces the biodiversity of the ecosystem. This costs farmers millions of Rands (Hundreds of thousands of Dollars) each year and negatively effects the native wildlife.</p>\n\r\nState of the game:\r\n<p>This game is not yet everything I want it to be and I will still be working on it into the future. Mt plans for the game include; more levels, more mechanics to add to how you can play, and possibly even a level editor to allow you to share your own designs with others!</p>Credit:<p>Background music: when - Stephen Siebert</p>", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T18:54:36", "background_image": "https://media.rawg.io/media/screenshots/692/692e4470b63da93060e5e26aaebdeff1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sam Brading"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}