{"id": 781429, "slug": "the-deep-there-be-monsters", "name": "The Deep: There Be Monsters", "name_original": "The Deep: There Be Monsters", "description": "<p>The Deep</p>\n\n<p>Created by High Pressure Studios</p>\n<p>Min Hyune Bae</p>\n<p>Colby Breitenbach</p>\n<p>Cameron Cavossa</p>\n<p>Jack Murray</p>\n<p>Christopher Trenary</p>\n<p>Sebastian Wittig</p>\n<p><strong>Walkthrough</strong></p>\n<p> Explore unknown depths of the Marianas Trench. As you progress in the game you will encounter several enemies and a two-stage boss fight. There are several pickups to collect as you progress that can both help you in the overworld and in combat. Each pickup has a glowing white aura to differentiate them from the rest of the plants.</p>\n<p>During combat, you can choose between two different attack types, bracing, and using pickups to enhance attacks or heal. There is a small window on both attack and defense where an icon pops up signifying a quick time event that can empower attacks and increase damage resistance. </p><p>There are several green beacon plants that indicate the correct path to each boss. There are also breakable walls in the overworld that require one Bombeii Worm pickup to destroy. The minimap can also be used to navigate the space, both enemies and pickups appear on the minimap.</p>\n<p><strong>Story</strong></p>\n<p> Natural disasters ravage the planet and scientists have tracked the source to the Marianas Trench. Your crew is one of many sent to investigate the source and put a stop to it. As you explore the deepest parts of the world's ocean you encounter new species of plants and animals, and discover an ancient eldritch creature. This creature isn't interested in letting you leave the trench alive. </p>\n\n<p><strong>Special Thanks</strong><br/></p>\n<p>Nick Corcillo - Music Composer</p>\n<p>Harrison Dresser - Intern</p>\n<p>Stan Morris - Professor Voice Actor</p>\n<p>Gideon Shbeeb - Executive Producer</p>", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T18:38:57", "background_image": "https://media.rawg.io/media/screenshots/b78/b782382386e1900d670da20375cb5c6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FloridaManCam"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}