{"id": 7815, "slug": "death-tour-racing-action-3d-game-with-awesome-hot-", "name": "Death Tour - Racing Action 3D Game with Awesome Hot Sport Classic Cars and Epic Guns", "name_original": "Death Tour - Racing Action 3D Game with Awesome Hot Sport Classic Cars and Epic Guns", "description": "Death Tour is a vehicular combat game with amazing graphics, awesome classic cars and epic guns in the best traditions of popular console games! Death Tour is optimized for iPhone 4s and above, iPod touch 5th gen and above, iPad 2 and above.<br/><br/>BECOME AN ACTION HERO<br/>Deliver highly valuable cargo, but watch out: you’re being hunted down. Drive through the racy storyline at full speed, reveal the secret of the stolen briefcase and revenge a gang of cold-blooded assassins. <br/><br/>CHOOSE YOUR OWN PATH<br/>Reach the top of criminal world shooting everything that moves. Choose the car you like, upgrade it in the garage and ram your enemies in Demolition Derby or destroy them with lethal weapons in Survival. For the first time on your iPhone and iPad: the best classic car combat on breathtaking race tracks and battle arenas.<br/><br/>THIS GAME IS NOT COMPATIBLE WITH THE 3rd or 4th GENERATION iPOD TOUCH, iPAD 1, iPHONE 4 AND iPHONE 3GS.<br/><br/>KEY FEATURES<br/>* Top notch graphics and special effects. Get all you can from your mobile device!<br/>* Advanced physics: car frames and doors get dented and smashed like real! <br/>* Classic cars collection for connoisseurs: Ford Hot rod, Chevrolet, Porsche, Cadillac, Hippie Van and even the Soviet Volga! <br/>* Garage with a selection of unbelievable frames, engines, bumpers and body kits that are unique for every car. <br/>* Awesome pack of killer weapons: guided spider drones, stingers, self-guided supersonic ram and a heap of other crazy perks. <br/>* Several exquisitely modeled locations in unusual parts of the world: famous skyscrapers, an abandoned canyon, an old chapel and many more.<br/><br/>INSPIRE OTHERS<br/>Show your friends who’s the boss! Customize your cars and share them to Facebook.<br/><br/>----<br/>Check out our game trailer on http://www.youtube.com/watch?v=VACRS_D2N_g<br/>Visit our official site at www: http://pragmatix-corp.com", "metacritic": null, "released": "2013-10-10", "tba": false, "updated": "2019-10-22T14:33:37", "background_image": "https://media.rawg.io/media/screenshots/2f6/2f6afc2bad8a068d432f2fe186fc4423.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pragmatix"], "genres": ["Action", "Racing"], "publishers": ["Pragmatix"], "esrb_rating": null}