{"id": 781576, "slug": "carpathian-vampire-talp", "name": "Carpathian Vampire (TALP)", "name_original": "Carpathian Vampire (TALP)", "description": "Introduction\r\n<p>Deep in the Carpathian Mountains, the Romanian villagers tell tales of the strigoi. The strigoi are said to be troubled spirits that have risen from the grave. They are attributed with the abilities to transform into an animal, become invisible and to gain vitality from the blood of their victims.</p>\n<p>There have been recent reports of peasant children dying mysteriously in the local village. Their bodies had been drained of blood and they had puncture wounds in their necks. The villagers believe that a recently deceased count is responsible. They believe he's a strigoi. In Western culture, we would call him a vampire.</p>\n<p>The villagers have hired you to kill the vampire. After a long journey, you have arrived at the former count's castle. A cold shiver runs down your spine. Killing vampires is never easy. Why should this one be any different? But hurry. You don't want to be his next victim!</p>\r\nInstructions\r\n<p>This is a traditional text adventure that was written for Text Adventure Literacy Jam 2022, 21 March to 2 May 2022. See the jam page for the jam rules.</p>\n<p>A text adventure is a form of computer game that presents you with a story. You take on the role of the main character in the story and control that character's actions. The story has a goal and you will need to solve puzzles in order to achieve that goal. The computer tells you where you are, what you can see and what's happening around you. You can then move around, examine the things you find and manipulate those things by telling the computer what to do using simple English commands.</p>\n<p>Commands consist of a verb phrase, optionally followed by a noun phrase. Most commands can be abbreviated to a verb followed by a noun. For example, OPEN THE FRONT DOOR can be abbreviated to OPEN DOOR.</p>\n<p>If the verb is followed by a preposition, this may alter its meaning. For example, GET BED will attempt to pick up the bed, but GET ON BED will attempt to climb onto it.</p>\n<p>In some cases, the verb phrase and the first noun phrase may be followed by a second noun phrase. The two noun phrases are usually separated by a preposition. For example, DIG GRAVE will attempt to dig a grave with your hands (as you didn't specify a second noun phrase), but DIG GRAVE WITH SHOVEL will attempt to dig a grave with the shovel. If you only use a verb and a noun, the game will generally tell you if it needs an extra phrase or implicitly try to deduce what is needed for the second phrase.</p>\n<p>Don't panic! It's not as complicated as it sounds. Just use simple English sentences starting with a verb and it will all feel quite natural.</p>\r\nMovement\r\n<p>To move around, use commands like GO NORTH or NORTH. You can move in any of the four cardinal compass directions, as well as UP and DOWN. To save typing, movement commands can be abbreviated to N, S, E, W, U and D. You can sometimes use other movement commands such as CLIMB, ENTER, EXIT, IN, OUT, GET ON or GET OFF. These will be reasonably obvious when the time comes.</p>\r\nExamining things\r\n<p>Make sure you EXAMINE everything you come across, even insignificant things like scenery and objects mentioned in room descriptions, as subtle hints and clues are scattered everywhere. To save typing, EXAMINE can be abbreviated to X. For example, EXAMINE KNIFE can be abbreviated to X KNIFE.</p>\n<p>You can also try your other senses when it seems appropriate, e.g. SMELL, TOUCH or LISTEN. Unlike EXAMINE, these actions aren't necessary to solve any puzzles, so don't feel obligated to use them.</p>\r\nManipulating objects\r\n<p>Apart from examining things, most of your time will be spent manipulating objects. Use commands like GET or TAKE to pick up an object, e.g. GET GARLIC. Use commands like DROP or DISCARD to drop an object, e.g. DROP GARLIC. Use WEAR to wear something, e.g. WEAR COAT. Use REMOVE to remove something that is already worn, e.g. REMOVE COAT.</p>\n<p>To see what you're currently carrying and wearing, use INVENTORY (or I). As you are not a pack horse, you can only carry eight items and wear two items at a time, but you may be able to put things in containers if you need to increase your load. If your inventory is full, just drop something that you no longer need. Inventory management is part of the game.</p>\n<p>There are many other verbs that can be used to manipulate objects. These will be fairly obvious when the time comes. Common verbs include OPEN, CLOSE, LOCK, UNLOCK, LIGHT, EXTINGUISH and so on. Use PUT, PLACE or INSERT to put objects into containers or on supporters, e.g. PUT ROCK IN BARREL or PLACE PLATE ON TABLE. Hints to which verb to use are quite often included in the responses to other commands, so read responses carefully.</p>\r\nScoring\r\n<p>You are awarded points for discovering important items and achieving tasks. The maximum score is 100. The score and the number of moves is shown in the status bar at the top of the screen. You can also use SCORE to see how you're going.</p>\r\nTutorial\r\n<p>This game features a tutorial mode. When you start a new game, the tutorial is on by default. If you are new to text adventures, it is recommended that you leave the tutorial on and follow all the suggestions. If you are an experienced text adventure player, use TUTORIAL OFF to turn the tutorial off.</p>\n<p>Once the tutorial is turned off, it is recommended that you leave it off. You can use TUTORIAL ON to turn it back on again, but if you turn it back on later in the game, some of the tutorial responses may seem out of context.</p>\r\nAdvanced features\r\n<p>You can use IT or THEM to refer to the noun used in the previous command, e.g. EXAMINE NOTE, READ IT, EXAMINE MARBLES, PUT THEM IN BAG.</p>\n<p>You can refer to multiple objects by separating the objects with AND, e.g. GET KNIFE AND NOTE. Using IT and THEM in the next command will only refer to the last of those objects, e.g. EXAMINE IT will refer to the note.</p>\n<p>You can use ALL to refer to all the appropriate objects with GET and DROP, e.g. GET ALL to get everything in the current location, GET ALL FROM TABLE to get everything on the table, DROP ALL to drop everything you're holding.</p>\n<p>When using ALL, you can use EXCEPT or BUT to exclude some objects, e.g. DROP ALL EXCEPT HAMMER AND NAILS.</p>\n<p>Finally, you can enter multiple commands on the same line by separating them with a period, e.g. UNLOCK DOOR. OPEN IT.</p>\r\nOther commands\r\n<p>Use LOOK (or L) to refresh the display.</p>\n<p>Use VERSION to get the game version. Use ABOUT or INFO to get background information and credits for the game. Use CREDITS to get the credits only.</p>\n<p>Use SAVE to save your progress. Use RESTORE to restore a saved game.</p>\n<p>Use UNDO to undo the last move. This is handy if you change your mind, make a mistake or just want to experiment with something.</p>\n<p>Use AGAIN (or G) to repeat the last command.</p>\n<p>Use WAIT (or Z) to do nothing apart from pass the time.</p>\n<p>Use HELP to get a brief reminder of how to play the game or HINT to get a context-sensitive hint related to the current location.</p>\n<p>Use RESTART to restart the game from the beginning. Use QUIT (or Q) to quit without restarting.</p>\n<p>Most importantly, have fun, enjoy the game and kill that vampire!</p>\r\nKeyboard shortcuts\r\n<p>Some interpreters have keyboard shortcuts. If you are using an interpreter on a computer with a conventional keyboard, most will allow you to press the up and down arrow keys to cycle through your past commands. This is handy if you want to repeat the previous command or correct a typo.</p>\r\nPlaying the game\r\n<p>There are two ways to play the game.</p>\n<ul><li>Click the 'Run game' button (above) to play the game in your browser.</li><li>Download the z5 file and play the game using a z-code interpreter (see below).</li></ul>\r\nFinding a z-code interpreter\r\n<p>There are a variety of z-code interpreters for all the major platforms, as well as many minor and retro platforms. There are far too many to list here. The best source of downloads is probably the Interactive Fiction Archive. Navigate to infocom/interpreters for z-code interpreters and interpreters-multi for interpreters that interpret both z-code games and other formats.</p>\r\nCommon z-code interpreters\r\n<p><strong>Android:</strong> I recommend Hunky Punk or Fabularium from Google Play. (There are others, as well.)</p>\n<p><strong>iOS:</strong> I recommend Frotz from the Apple App Store. (There are others, as well.)</p>\n<p><strong>Linux:</strong> See the links above.</p>\n<p><strong>Mac:</strong> See the links above.</p>\n<p><strong>Windows:</strong> I recommend Windows Frotz from the infocom/interpreters link above. (There are others, as well.)</p>\r\nCredits\r\n<p>Inform 6 compiler, language and library originally written by Graham Nelson and now maintained by David Griffith, David Kinder, Andrew Plotkin et al.</p>\n<p>PunyInform library written by Johan Berntsson, Fredrik Ramsberg, Pablo Martinez, Tomas Öberg et al.</p>\n<p>Original concept by Jaume Alcazo Castellarnau.</p>\n<p>Original story by Dr Franz Hartmann.</p>\n<p>Game design and coding by Garry Francis.</p>\n<p>Play testing by Amanda Walker, Christopher Merriner, Dee Cooke, Edo Rajh, Jade J Aincioa, Johan Berntsson, Lionel Ange, Ray Leandro and Shawn Sijnstra.</p>\n<p>Background image adapted from a free wallpaper by an unknown artist.</p>", "metacritic": null, "released": "2022-05-02", "tba": false, "updated": "2022-05-06T19:43:59", "background_image": "https://media.rawg.io/media/screenshots/274/274628f4b2dd1facc8018a9f96b6f490.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "macOS", "PC"], "developers": ["Garry Francis"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}