{"id": 78163, "slug": "battle-fortress-war", "name": "Battle Fortress War", "name_original": "Battle Fortress War", "description": "Battle for WORLD DOMINATION over progressive Age’s, beginning in the Stone Age, and advancing all the way through to the Space Age (if you survive!). Research technologies to make your base and units more POWERFUL. Earn gold by killing your enemies to spend on more powerful units*. Deploy your Super Weapons to crush your enemy.<br/><br/>To win you will need to employ military style tactics rather than just send out waves of troops. You will need to balance your attack and defense strategies with limited resources. Learn to deploy your Super Weapon at the right moment to gain the upper hand, with the knowledge that your enemy will be trying to do the same.<br/><br/>Features<br/>-\tOver 20 Game Center Achievements<br/>-\tBeautiful graphics that depict the current game Age<br/>-\tGraphics change for day or night<br/>-\tCool battle sound effects<br/>-\tGame time acceleration option for faster game play<br/>-\tDifferent unique Super Weapon’s for every Age<br/>-\tIncreasing AI toughness with each Age (look out!)<br/>-\t9 levels of difficulty to choose from<br/><br/>* Purchase of additional gold is available if you really want to DESTROY your enemy quickly, rather than fight it out over the Age’s. Purchasing gold can turn the tide of a game, however it is possible to win the game by just earning gold from killing the enemy.<br/><br/>*Note* that this is the ‘Kingdom’ version, where you can play 2 Ages for free. If you like the game, please consider purchasing the upgrade to continue onto subsequent Ages (and of course play many times again, Ad Free).", "metacritic": null, "released": "2013-10-17", "tba": false, "updated": "2019-07-30T04:21:04", "background_image": "https://media.rawg.io/media/screenshots/47b/47becabbc9da0a169f789edae1e0bb7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Daniel Asto"], "genres": ["Adventure", "Strategy"], "publishers": ["Daniel Asto"], "esrb_rating": null}