{"id": 78188, "slug": "word-wow-big-city", "name": "Word Wow Big City", "name_original": "Word Wow Big City", "description": "<p>***Over 3 million players have joined the Word Wow community. Thank you for your support, we hope you enjoy the newest adventure.</p>\n<p>&quot; (5/5) Big City was worth the wait! I&#39;m enjoying it even more than Word Wow and those are some big shoes to fill.&quot; - Rosalee M.</p>\n<p>Word Wow BIG CITY is here!  Worm is back for another adventure and this time the race has moved to the city.</p>\n<p>Challenge your word making skills to help navigate Worm down buildings of death defying heights. Puzzle your way down and around obstacles, before time runs out.</p>\n<p>Think strategically to earn bonus points and stars. Your live worldwide rank will be revealed at the end of each level.</p>\n<p>You&#39;ll be equipped with letter-clearing bombs along the way, but be sure to earn more to use in a pinch.</p>\n<p>Collect all of the hidden gems to unlock secret bonus levels where you can really rack up the points!</p>\n<p>The bigger the word, the more points you&#39;ll earn. Try and make enough points in each level to earn all three stars.</p>\n<p>Word Wow BIG CITY will sharpen your brain as well as your reflexes. Help a worm out!</p>\n<p>FEATURES<br />\n• Leave the dirt behind, there are buildings to climb!<br />\n• Over 420 challenging levels to hone your word making skills and sharpen your brain.<br />\n• Adorable character and bright, colorful graphics transport you to the city.<br />\n• 63 hidden bonus levels for those that are dedicated.<br />\n• Earn boosters along the way.<br />\n• Live Ranking for each level among other Word Wow BIG CITY Players.<br />\n• Daily bonuses to help you when you need it.</p>\n<p><strong> Word Wow REVIEWS </strong><br />\n5/5 “Highly Addictive!!! Can&#39;t get enough of Word Wow! Fun and easy to play!&quot;<br />\n5/5 “This is a lot of fun and the worm is so cute!”<br />\n5/5 “Keeps your brain really sharp! Once you get started you just can&#39;t put it down.”</p>", "metacritic": null, "released": "2015-11-19", "tba": false, "updated": "2019-07-30T16:10:29", "background_image": "https://media.rawg.io/media/screenshots/2ec/2eced1f8bb623019604c6ef593065409.jpg", "website": "http://donkeysoft.ca", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "macOS", "iOS"], "developers": ["DonkeySoft"], "genres": ["Puzzle"], "publishers": ["DonkeySoft"], "esrb_rating": null}