{"id": 7820, "slug": "era-deluxe", "name": "ERA Deluxe", "name_original": "ERA Deluxe", "description": "ERA Deluxe is here! A beautiful Sci Fi TD game for iOS!<br/><br/>Features:<br/><br/>【40 Levels &amp;amp; an epic finale in Campaign, 45 Levels in Challenge &amp;amp; 9 Levels in Endless mode!】 <br/>--Including both Fixed-Path and Open-Field maps! <br/>--Battles begin in [Dark Forest] on planets of G581, and continue all the way through to the [Glacial] &amp;amp; mysterious [Mayan], and finally reach the CORE of relentless enemies, a total of *8 series*, and NOT one boring fight! <br/><br/>【A staggering variety of 100 Enemies!】, 30 unique of them with their own skills that you&amp;#39;ve never seen before in a defense game. <br/>--Including 8 Space Ships and Submarine, and secret creatures to be discovered! <br/><br/>【6 Bosses】, and an 【Ultimate Mega-Boss】 <br/>--Intense Boss fights, and remember, it’s not only defense anymore, Commander! <br/><br/>【10 Forces】, with 10 advanced abilities. <br/>--A variety of types with solid upgrading, and each has special ability (to be unlocked) that will significantly help you fight against all sorts of enemies. <br/><br/>【4 Heroes】, with 11 Abilities, 3 Special Skills <br/>--Teleport the Hero wherever you want, and use abilities to control the battle. Hero levels up and unlocks more and more seriously powerful abilities when you progress through Campaign. <br/><br/>【3 Modes】, including the non-repeating “Endless” challenge! <br/>--[Campaign]: 3 Difficulty, a variety of gameplay &amp;amp; heaps of fun. <br/>--[Challenge]: Extreme &amp;amp; intense levels that bring gameplay to a whole new level! <br/>--[Endless]: The most challenging mode where almost EVERY wave of enemies is new (not repeated), and compete with players all over the world through Game Center leaderboard. <br/><br/>【35 Achievements + E.R.A. Wiki】 <br/>--Heaps of interesting achievements and background stories for you to check out, plus over 40 tips and hints designed to help you become an expert in no time. <br/><br/>【More Features On Their Way】 <br/>--You can enjoy the game thoroughly without having to buy any IAPs, they are only designed to enable quick access to level-up or Special Skills. And we are constantly adding new cool features into Deluxe! <br/><br/>Commander, best of luck! We surely hope that you will enjoy this journey! <br/><br/>Follow us for the latest info and game news!<br/><br/>• http://crescentmoongames.com/other-games/<br/>• http://facebook.com/crescentmoongames<br/>• http://twitter.com/cm_games", "metacritic": null, "released": "2013-05-16", "tba": false, "updated": "2019-10-22T14:29:33", "background_image": "https://media.rawg.io/media/screenshots/520/520aa4bfda9d4b5e7ace6bf77c870fb4.jpeg", "website": "http://crescentmoongames.com/other-games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Crescent Moon Games"], "genres": ["Action", "Strategy"], "publishers": ["Crescent Moon Games"], "esrb_rating": "Everyone 10+"}