{"id": 782124, "slug": "dreg", "name": "Dreg", "name_original": "Dreg", "description": "<p><em>Dreg</em> is a narrative simulation game about tending  to sick machines in an exploding desert. You are a repairman trained to  monitor and treat the biomechanical 'herds' that keep our present whole.  But something has gone wrong, and the herds are failing. A seethe has  begun: Flora, fauna, and detritus from another time are erupting into  your world, bringing an uncanny lushness to the long-dry desert. Our  world and our time are in danger of being subsumed altogether. Play your  part.\r\n  </p>\r\nTEND THE HERDS \r\n<p>Each herd is made up of sensitive little mechanisms, and they're  under siege. You are an expert: You diagnose, treat, and maintain the  herds. Inspect their cellular makeup through a microscope. Carefully  pluck parasites with your tweezers, or knock them off with a mallet.  Harvest otherworldly ingredients to brew restorative tonics, then inject  them carefully—or just toss them back yourself.\r\n    </p>\r\nSEE THE WORLD WHILE YOU CAN\r\n<p>The desert is ancient. It is filled with the traces  of many violences—the vestiges of centuries-old colonialism, the brutal  transformations of a misused planet, the empty homes of uncared-for  peoples. Amid the dunes and the wreckage are secrets, the stories of a  disappearing world and the descendants of the disappeared. To understand  what is happening, you will have to learn what has happened—to contend  with the heat, the dry, and the thin air to know this place before it is  swallowed up.\r\n    </p>\r\nBE A PART OF SOMETHING\r\n<p>You are not the only person in the desert. Old  friends know you from a life you hardly remember. Strangers pursue  strange ends. Others are emerging from another time, but as invaders or  as refugees? To enter this world you will have to be a part of it—to  decide who to save and who to spurn, who to trust and who to betray, to  help create a community that might survive the seethe that tears the  world apart.\r\n    </p>\n<p><em>Dreg</em> is currently under development. This is a demo showcasing the beginning of the game. More is on the way.\r\n    </p>\n<p>For updates, follow me on Twitter here.\r\n</p>", "metacritic": null, "released": "2022-04-20", "tba": false, "updated": "2022-05-06T23:19:48", "background_image": "https://media.rawg.io/media/screenshots/26b/26b596718d8333de013c5bd6068610b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gewl"], "genres": [], "publishers": [], "esrb_rating": null}