{"id": 78235, "slug": "monsterland-fairy-tales", "name": "Monsterland. Fairy Tales", "name_original": "Monsterland. Fairy Tales", "description": "*** Restless kids vs tired parents - all-too-familiar tale! ***<br/><br/>The catchy physics based puzzle about the endless action between sleeping dad and energetic child! <br/>Help active Junior to get to snooze Senior for wake him up by pop the monster blocks and clear a path to continue the fun games! <br/><br/>The adorable music, cartoon art, son's merry laugh and Senior's grumble in this 2-nd story of Monsterland will put a smile on your face, guaranteed!<br/><br/>FEATURES of the Monsterland. Fairy Tales 2 brain game:<br/>- 100+ interesting levels &amp; different cartoon worlds<br/>- catchy brain physics-based puzzles for learning and playing<br/>- attractive cartoon films about Junior vs Senior<br/>- cute comic monsters blocks<br/>- nice music, charming art &amp; catching kids' laugh<br/>- don't know what to do, call the alarm clock for help<br/><br/>MONSTERLAND STORY:<br/>Сhildren like fun, Junior is no exception. The full of energy child crazily wants to jump, run, play and fool around. But Senior decided to sleep and does not want to have fun with the little son.<br/>The MONSTERLAND habitats guard the Senior's rest.<br/>And it makes this logical brain puzzle just much more interesting! <br/><br/>HOW TO PLAY:<br/>Pop the monsters, use elevators &amp; portals, travel around the Monsterland world to solve a variety of attractive puzzles and join a playful Child with his tired Daddy for endless fun. <br/>Collect candies, check the pops to open more new interesting levels in different packs such as Junior vs Senior, Junior Revenge, Junior Returns, One more Junior. <br/><br/>NEW LEVELS:<br/>30 new levels in the Challenge tale. Now Junior has a little sister Jenny! Help the little one and his sis wake up the Senior!<br/><br/>Monsterland. Fairy Tales is a continuation of Monsterland. Junior vs Senior story which many children, girls &amp; boys and their parents like.<br/>The exciting 2-nd part puzzle from ALMA Games presents you an unforgettable adventure in the fairy tale world.<br/><br/>Join our community at Facebook.com/almagames <br/>Will be thankful for your positive review &amp; 5 stars in the store.<br/>Also, don't hesitate to write your remarks at contact@alma-games.com<br/><br/>If you like brain physical puzzles try other cool math games by ALMA Games:  Monsterland. Junior vs Senior , Snoring. Elephant game, Alarmy &amp; Monster Family, Hungry cat around the world.", "metacritic": null, "released": "2017-01-20", "tba": false, "updated": "2019-10-22T14:23:29", "background_image": "https://media.rawg.io/media/screenshots/fdf/fdf087a4e6f0d424bddb8a63cbefa31a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oleksandr Mykhailov"], "genres": ["Adventure", "Puzzle"], "publishers": ["Oleksandr Mykhailov"], "esrb_rating": null}