{"id": 782301, "slug": "jian-zhong-swords-tomb", "name": "剑冢 Swords Tomb", "name_original": "剑冢 Swords Tomb", "description": "<h3>1. Catch pets - baby pets grab at will</h3>50+ racial pets, there are carefree elf, half-orc from barbarian tribe, Gaoda who invades the world, knight commander who leads the army... These pets have a certain chance to mutate, red name, shine, they are the battle main force.<h3>2. Pet development-strategic collocation</h3>All kinds of pets have their own specialties, and they are divided into 7 grades according to their innate qualifications. Each type of pet has the potential to reach the highest qualification rating. According to the growth points, skill learning and basic attack demand attributes will have various combinations. This is a topic that players often discuss, and it has unexpected fun to develop.<h3>3. Any combination of skills - vast possibilities</h3>There are 400+ skills in the game. The combination of various skills creates unique sparks and produces different genres. According to different enemies, there are different skills and selective targeting, use your imagination.<h3>4. Draw skills - a moment of non-European</h3>Some people are happy, some are worried, and they spend hours of hard work, but once the lottery is drawn, it will be non-European, some people are worried about not being able to extract key skills, and some people are worried about how to use up top-level skills, no guarantee is so true!<h3>5. Death Pigeon - Every death will make you stronger</h3>Death is a new life, once you accept your weakness, you are invincible!<h3>6, copy</h3>The dungeon not only has rich rewards, but also a testing ground for output and resistance. Do you want to know your limit? Endless monsters are waiting for you to appear, and powerful bosses will tear you to shreds.<h3>7. Pet + hatching</h3>Train better pets", "metacritic": null, "released": "2022-05-05", "tba": false, "updated": "2022-05-09T04:32:56", "background_image": "https://media.rawg.io/media/screenshots/e37/e37440223c6e9980cfb016374ab742d3.jpg", "website": "https://www.taptap.com/app/232628", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["游戏事业接班人"], "genres": ["Strategy", "Indie"], "publishers": ["没有发行"], "esrb_rating": null}