{"id": 782334, "slug": "nagori-rokudo-striving-to-be-her-ideal-self-the-in", "name": "Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer", "name_original": "Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer", "description": "<p>GAME OVERVIEW:<br />\nStriving to be the perfect &quot;Nagori Rokudo&quot;!!!<br />\nShe&#39;ll show you her superior female techniques.<br />\nA virgin, Nagori Rokudo, strives to be the perfect woman!<br />\nTo most men, she looks unattainable, but is actually still a virgin.<br />\nIt is the story of a young adult virgin striving for perfection.<br />\nThis story is a visual novel.GENRE:An inexperienced woman&#39;s love adventureCONCEPT:This is the story of a virgin looking to become her ideal self!<br />\nIt is a romance in which she tries to seem experienced in love but actually isn&#39;t!<br />\n1) Nagori&#39;s true self -<br />\nThe heroine, Nagori Rokudo, is a gorgeous woman.<br />\nShe seems hard-to-get, driving many men crazy and making many women envious.<br />\nHowever, she&#39;s actually still a virgin.<br />\nShe looks like an unattainable gorgeous lady, but actually is an inexperienced beginner.<br />\nAs the hero confesses his love to her, she gets together with him to learn about men&#39;s psychology, but nothing goes well.<br />\nEnjoy seeing her complicated nature.<br />\n2) Having sex, the gorgeous woman&#39;s way -<br />\nShe&#39;s a virgin but takes the lead in bed.<br />\nShe isn&#39;t very experienced but dominates and has sex utilizing a technique she had practiced with a cucumber.<br />\nActually, she always tries her best. Relax and enjoy her story.<br />\n3) Nagori&#39;s progression -<br />\nWhat will Nagori think after dating the hero? How will she change and can she still remain a highly-prized woman?<br />\nPride or pure love...what will she get in the end? See for yourself.<br />\nThis is the story of a woman&#39;s progress who has trouble in love.CHARACTER:Nagori Rokudo<br />\nDATA:<br />\nSex: Female  Age: 25  Blood Type: B<br />\nHeight: 5&#39;5&quot;  Weight: 112 lbs.<br />\nMeasurements: 34(B) / 23(W) / 32(H)<br />\nPROFILE:<br />\nShe&#39;s a young female lecturer at a University.<br />\nWithout intent, she attracts and plays mind games with many men.<br />\nA young guy suddenly confesses his love for her and she mysteriously accepts it and gets together with him.<br />\nOn that same date, she demands they start living together.<br />\nHowever, she plays hard-to-get and thoroughly controls his sexual satisfaction.<br />\nHer field is psychology.<br />\nShe teaches it, utilizing real-life practice and anecdotes as well as theory.</p>", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-05-09T13:04:36", "background_image": "https://media.rawg.io/media/games/0fe/0feb9af6e79b1604e976fcc8d03dec87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 313, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["INTERHEART glossy"], "genres": ["Adventure"], "publishers": ["ARTLINK"], "esrb_rating": null}