{"id": 782343, "slug": "cursed-to-golf-2", "name": "Cursed to Golf", "name_original": "Cursed to Golf", "description": "<p>Play as The Cursed Golfer, trapped in Golf Purgatory after a freak accident takes you out as you’re about to take the winning shot of an international tournament! Legend says that playing through the devious courses across Golf Purgatory will get you back to the land of the living and, more importantly, to the trophy you were about to win. Each course is governed by a ghostly Legendary Caddie, who will tutor you in the mystical ways of golf to aid you on your quest for redemption and revival.<br />\nCursed to Golf offers a fresh take on the golfing and roguelike subgenres. Make your way through a hole within the PAR Count or your curse will take you back to the beginning of the course! To add to the challenge, these courses don’t just have bunkers and rough spots but are also chock full of mad obstacles like high powered fans, spikes, TNT boxes, teleporters and a whole load more. It’s all par for the course in this twisted take on the classic game!<br />\nBeing cursed to play golf forever in the eternity of Golf Purgatory has its benefits, too! Use Birdie-Eye to catch a view of the whole course and see what trials lie ahead. Par count running low? Luckily,  gold and silver Shot Idols are peppered throughout the holes, smashing through them with a cinematic flourish will replenish your shots. Ace Cards will turn the odds back in your favour, channeling your otherworldly powers to manipulate the game in incredible ways. Scattershot, U-Turn, Rocketball, Mulligans are just some of 20+ cards you have up your sleeve to turn the tide back in your favour!<br />\nEvery shot counts!<br />\nExplore the golf-themed world and characters of Golf PurgatoryPrecise “Golf-Like” gameplay across a randomly-ordered course in 4 biomesNavigate tough dungeon-like holes filled with wacky hazards Golf in style using over 20 unique Ace Card power-ups Challenge the world in online leaderboards80+ holes and the Daily Challenge Mode will keep you swinging for eternity</p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2024-02-01T16:11:41", "background_image": "https://media.rawg.io/media/screenshots/66d/66d2f52c850b3d6e8ea2f622a3416012.jpg", "website": "https://www.chuhailabs.com/games", "rating": 2.62, "rating_top": 3, "added_by_status": {"yet": 36, "owned": 81, "beaten": 2, "toplay": 13, "dropped": 10}, "playtime": 2, "achievements_count": 40, "ratings_count": 12, "suggestions_count": 339, "game_series_count": 1, "reviews_count": 13, "platforms": ["PlayStation 5", "PlayStation 4", "PC", "Nintendo Switch", "Xbox Series S/X", "Xbox One"], "developers": ["Chuhai Labs"], "genres": ["Action", "Adventure", "Sports", "Indie"], "publishers": ["Thunderful Publishing"], "esrb_rating": null}