{"id": 782321, "slug": "call-me-under", "name": "Call Me Under", "name_original": "Call Me Under", "description": "Dive into the 1950s and explore an eldritch-horror-infested world soaked in dark magic, mystery, and romance. Call Me Under takes place in the mysterious underwater city of Styx, a haven inhabited by humans, sirens, and a host of unknown otherworldly entities. <br/><br/>Play as a choice of two different faceless protagonists from The Surface seeking to leave their past behind and start fresh in a new city, even if it is one only rumored to exist at the bottom of the ocean. They do say there's nothing like a clean slate...<br/><br/>But maybe not if you find yourself thrown into the middle of a brewing fight between the Shadows and the Light; two ancient, otherworldly entities embroiled in a centuries-long battle for power. <br/><br/>Our two demos (demo two can be found on lunarisgames.itch.io/callmeunder) are a very early example of what you will see in the final game, with many elements and features still a work in progress. We created this preview with the intent of introducing you to the characters and giving you a peek into the world of Styx, and we look forward to bringing you an incredible game when completed!  Blue is the only character that is voiced in the demos, but all seven of our main characters will be in the completed game. The game will be available on PC, Mac, and Nintendo Switch upon release.<br/><br/><br/><br/><br/><br/>Archie (he/him) - Voiced by Stephen Fu<br/>Eve (they/them) - Voiced by Farah Naz Rishi<br/>Callie (she/her) - Voiced by Tracy Ifeachor <br/>Penny (she/her) - Voiced by Allegra Clark<br/>Blue (he/him) - Voiced by Robbie Daymond<br/>Adrien (they/he) - Voiced by Noshir Dalal<br/><br/><br/><br/>- Two playable (faceless) protagonists<br/>- Six individual, diverse romances <br/>- Two additional polyamorous romances<br/>- Choose your pronouns<br/>- Investigative elements <br/>- Keepsakes and collectibles<br/>- Multiple 'Good' and 'Bad' Endings<br/>- CG Gallery <br/>- Voice acting", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-09T04:59:07", "background_image": "https://media.rawg.io/media/screenshots/37e/37e761ce8e0f80412744d9902ebca7cb.jpg", "website": "https://www.lunarisgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Lunaris Games"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["Lunaris Games"], "esrb_rating": null}