{"id": 782342, "slug": "paper-cut-mansion", "name": "Paper Cut Mansion", "name_original": "Paper Cut Mansion", "description": "<strong>Paper Cut Mansion</strong> is a roguelite horror set in a papercraft world. Play as Toby, a police detective arriving at a mysterious old mansion. Explore the mansion floor by floor as you seek to unravel the story behind this bizarre place, with each run giving you the opportunity to collect another piece of evidence to be added onto your Evidence Board. The Mansion also hosts a mysterious cast of characters who may help or hinder your progress on each run...<br/><br/><br/><ul><li>A creepy and thrilling storyline unfolds (pun intended) as you progress in the game and unlock different endings depending on your performance<br/></li><li>Game mechanics designed for high replayability<br/></li><li>Perma-death<br/></li><li>The more you fail and start over, the more you learn about the mechanics<br/></li><li>Unique AI for each enemy type - unexpected behaviours - makes enemies creepier and more fearsome<br/></li><li>Logical puzzles are designed to make the player think<br/></li><li>Collectible Upgrades<br/></li><li>Customize your equipment before each run to shape your own play style</li></ul><br/><br/><br/><br/><br/>Run by run, <strong>Paper Cut Mansion</strong> will offer you the opportunity of defining your playstyle as you unlock new abilities and discover new equipment that will give you a better chance of overcoming the challenges each procedurally generated run throws at you. Each new item offers further customisation to your ultimate build, allowing for truly unique set ups. Do you want to get in close as a melee fighter or take shots from afar as a ranged marksman?<br/><br/>Set yourself up with a drone who can do the fighting for you or create an engineering build who can lay down traps and turrets as you back enemies into them. Completing quests will also grant you temporary perks, making each run feel fresh as you may not get the same perks to choose from next time! The possibilities are endless and there is no correct way to overcome the ever-shifting procedural rooms of the mansion.<br/><br/><br/><br/><br/><br/>The mansion itself also has a dimension-hopping twist. Each floor contains portals that lead you to alternate versions of the same location. Each dimension switches up the aesthetics and gameplay. You always start in the NeoCortex dimension, which plays out like an escape room, filled with challenges, puzzles and surprises.<br/><br/>From there, you will receive quests that take you into the Reptilian Complex and the Limbic System Dimensions. In the Reptilian Complex, the mansion takes on a fiery appearance as it is overrun with monsters. The Limbic system sees an icy chill overtake the mansion. You’ll need to move quickly and stay near heat sources as the cold damages you on your search for hidden items or torches to light up.<br/><br/><br/><br/><br/><br/>With a variety of enemies, clues, quests, secrets, loot and compelling logic puzzles scattered throughout the mansion, there is always something intriguing to discover on each run. There’s always something for you to keep track of - from kit upgrades, puzzles that need solving or quests to complete. Between each level a musical interlude will reveal more of the twisting story, with decisions you make throughout your run subtly affecting the final outcome - with 27 different possible endings wrapping up the tale.<br/><br/>All this, combined with its incredible aesthetics, makes <strong>Paper Cut Mansion</strong> a roguelite you won’t want to miss.<br/><br/><br/>", "metacritic": null, "released": "2022-10-27", "tba": false, "updated": "2022-11-01T11:10:00", "background_image": "https://media.rawg.io/media/screenshots/1be/1beda0d60f530ffadfae5afda6a0ed2e.jpg", "website": "http://spacelizardstudio.com/work/paper-cut-mansion/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 15, "toplay": 12, "playing": 1}, "playtime": 1, "achievements_count": 52, "ratings_count": 0, "suggestions_count": 443, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Space Lizard Studio", "Space Lizard Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Thunderful Publishing"], "esrb_rating": null}