{"id": 782338, "slug": "time-to-hunt", "name": "TIME TO HUNT", "name_original": "TIME TO HUNT", "description": "A battle royale game where you could not only experience pulse-pounding combat on land, but also on the sea within one match. On the water, engage in thrilling naval battles between massive medieval sailing ships. On land, feel the confrontation between various cold weapons and firearms. Ride horses to travel across Continental Europe of Middle Ages, sail ships to explore mysterious seas ......fight or hide，Law of the Jungle or win-win cooperation......there is only on goal, to survive to be the last one standing.<br/><br/><br/><br/>【Battles on both Land &amp; Sea】<br/>100-player combat experience features diverse battlegrounds, here you could freely switch from land battlefields to sea within one match, ship battle or land combat? depends on you!<br/><br/><br/><br/>【Medieval Sailing Ships】<br/>Versatile Standard Ship, devastating but heavy Fire-pour Ship, quick-striking but inflexible Raiding Ship, defensive but lightly-armed Armored Ship, stealthy but fragile Scout Ship, maneuverable but vulnerable Harass Ship; ambushes, flanking attacks, confrontation and \"head-on\" assaults...... engage yourself in thrilling ship battles!<br/><br/><br/><br/>【Melee &amp; Ranged Weapons】<br/>Invisibility Guise with dagger to sneak stab, Mage Robe with staff to cast devastating fire and lightning, Plate Armor with sword to inflict deadly damage, Archer Wear with bow to become Robin Hood, hatchet, crossbow, war hammer, musket...... Time to Hunt offers you a unique fantasy land combat experience.<br/><br/><br/><br/>【Customize &amp; Upgrade】<br/>Loot and pick up materials to upgrade and customize your gears, weapons, and ships. The force storm is coming, are you ready Captain?<br/><br/><br/><br/>【Tactical Diversity】<br/>Choose gears, ships, cannons, attachments in a variety of tactical decisions； ambush, explore, fight, survive......a wide range of strategies for you to employ. Squad up and voice chat with friends, be the last team standing.<br/><br/>【From Developers】<br/>Through a number of failures, we started development with the notion that Time to Hunt would be our last opportunity. It took us a long period of 3 years to develop the game with small number of developers and lack of resources, finally it comes out, really appreciate that Steam platform makes it so much easier for small teams to publish games. Though Time to Hunt is far from perfect in many aspects compared with Fortnite, PUBG, Naraka: Bladepoint.....we will do our best to make the game more complete and satisfying!", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-05-09T05:19:17", "background_image": "https://media.rawg.io/media/screenshots/aed/aed022f8d3ea7170ff783a7d238f58a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 427, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wuhan NetCiao Technology Co"], "genres": ["Action", "Adventure"], "publishers": ["Wuhan NetCiao Technology Co"], "esrb_rating": null}