{"id": 782331, "slug": "is-simon-there", "name": "Is Simon There?", "name_original": "Is Simon There?", "description": "A simple, short, horror experience - focusing primarily on creating an atmosphere full of tension and suspense. <br/><br/><strong>**Please note: Is Simon There? is heavy with Walking Simulator elements. If you are not a fan of Walking Simulator horror games, I do not recommend this game for you.**</strong><br/><br/><br/><br/><br/><br/><strong>Hi, is Simon there?...</strong><br/><br/>A few months have passed since the death of my son, Simon. Ever since that tragic day, I find myself falling into the darkest emotions I could ever imagine. I am haunted everyday with what I have done; But sometimes, I am haunted by more than just my emotions... <br/><br/>It's freezing outside, and there is no neighbor in sight. Where do I turn if my very own home is not safe anymore? And why does someone keep calling and asking for Simon. Why Simon? He's... never mind.<br/><br/><br/><br/><br/><br/><strong>Is Simon There? is a short horror experience with an approximate completion time of 40min. Is Simon There? also includes a single checkpoint at the mid-point of the game for those of you who want to explore alternate ending options. </strong><br/><br/>Is Simon There? offers a small atmospheric environment for you to explore and interact with. Solve several puzzles scattered throughout the house in order to reach the final truth. Who is Simon and why is someone calling for him?<br/><br/>Solve puzzles and unlock up to 3 alternate endings, each with completely different conclusions and journeys - Some of which may be completely unexpected and out of the ordinary. And of course, a nice little Easter Egg to sweeten the pie a little!<br/><br/>If you have played any of my previous games, Is Simon There? offers a similar experience. However, one major difference with Is Simon There? is a greater focus on atmosphere and smooth progression rather than many puzzles and player interactions. <br/><br/><br/><br/><br/><br/>It's been only a few months and I am already publishing another game. Within Skerry just came out! Well... Is Simon There? is a small project I've been picking away on the side. Is Simon There? is a bit interesting, in that, it places a significant focus on creating an atmosphere for the player with smooth progression instead of cluttering the game with all sorts of little puzzles and random interactions just to increase the length of the game (Of course, there still will be puzzles, but fewer). With that being said, Is Simon There is on the shorter end of the spectrum - approximately 40-45min to complete a single ending.<br/><br/>In terms of endings, I took a completely different approach than what I am used to. As always, ending 1 is the simple/ normal ending. However, ending 2 is a completely different ending (could be viewed as a different game, altogether). I took some inspiration with a few creepy pastas and wanted to create something with that as an ending. Fortunately my story works a bit with it, so we will see what you all think about that :) I personally find it neat.<br/><br/>What you will also notice is a graphical increase. Because Is Simon There? is a little smaller than my previous games, I took the initiative to spend more time texturing assets (rather than just slapping textures onto models and calling it a day) and also applying 2K textures, as opposed to 1k. Big big difference. I also outsourced a few assets rather than building a sub-par version myself, so that is also very nice. Saved some time and makes the game pop a little more :)<br/><br/>As always, I truly appreciate your continued support and I hope this game hits a sweet spot for you :)<br/><br/>Cheers, everybody, and happy gaming!<br/><br/>Stan. T", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-09-13T22:19:26", "background_image": "https://media.rawg.io/media/screenshots/3e6/3e69dcd40596281be149c1cf619db49c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "beaten": 5}, "playtime": 2, "achievements_count": 8, "ratings_count": 2, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Stanislaw Truchowski"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["TurnVex"], "esrb_rating": null}