{"id": 782572, "slug": "swap-squad-hasenknopf-lyred-hasenknopf-lyred", "name": "Swap Squad (Hasenknopf, Lyred) (Hasenknopf, Lyred)", "name_original": "Swap Squad (Hasenknopf, Lyred) (Hasenknopf, Lyred)", "description": "<p>Herzlich Willkommen zu unserer Evaluation von Swap Squad,</p>\n<p>wir wollen gemeinsam mit Dir unser Mobile Game<em> Swap Squad</em> auf Herz und Nieren prüfen. Besonderen Fokus wollen wir dabei auf unsere zwei Kernsysteme legen. Dabei handelt es sich um das Belohungssystem und das Monetarisierungssystem. </p>\n<p>Ein weiterer Bestandteil unserer Evaluation ist ein Fragebogen, welchen du bitte nach dem Spieletest ausfüllst. Wir versuchen dir hier das Spiel so gut wie möglich zu erklären und dir eine Schritt für Schritt Anleitung zu geben und dich durch den Test zu führen.</p>\r\nWie installiere ich Swap Squad?\r\n<p>Um unser Spiel spielen zu können musst du dir auf deinem mobilen Endgerät die SwapSquad.apk Datei herunterladen, welche du am Ende dieser Seite findest. Einmal heruntergeladen musst du diese nur noch ausführen und Swap Squad wird installiert. Eventuell bekommst du eine Warnung, dass die Datei aus einer fremden Quelle stammt. Das liegt daran, dass Swap Squad noch keine offizielle App ist, welche auf dem Playstore verfügbar ist.</p>\n<p>Am besten gehst du in deine Einstellungen und aktivierst den Punkt \"Fremden Quellen vertrauen\" an. Dann kannst du das Spiel leicht herunterladen. Vermutlich wirst du auch eine Meldung vom Google Playstore bekommen. Diese ist aber auch unbedenklich. Klicke einfach auf \"Trotzdem Herunterladen\" bzw. \"Trotzdem Installieren\"</p>\r\nWie spiele ich Swap Squad?\r\n<p>Swap Squad ist ein rhythmusbasierter 2D-Platformer. Das Ziel des Spiels ist es möglichst weit nach rechts über die Plattformen zu springen, ohne dabei herunterzufallen. Umso weiter man voranschreitet, desto mehr Münzen sammelt man ein, welche man im Shop/Inventar wieder ausgeben kann. </p>\n<p>Einen besonderen Twist bietet das Spiel durch das rhythmische Wechseln der zwei verschiedenen Arten von Plattformen. So gibt es immer zwei Phasen. In der jeweiligen Phase sind die entsprechenden Plattformen aktiviert und der Spieler kann auf diesen landen. Die anderen Plattformen sind währenddessen deaktiviert und der Spieler fällt durch diese hindurch. In einem natürlichen Rhythmus zu Beginn des Spiels wechseln sich die Phasen jeweils nach der gleichen Zeit ab.\r\n</p>\n<p>Allerdings gibt es auch die Möglichkeit einen Wechsel der Phasen auf Knopfdruck sofort auszulösen, um sich beispielsweise gerade so auf eine Plattform zu retten. Das hat allerdings zur Folge, dass der natürliche Rhythmus aus dem Gleichgewicht gerät.  Somit kommt es dabei auf ein ausgeglichenes Nutzen des Wechsels an, um so gut wie möglich den Rhythmus aufrecht zu erhalten und soweit wie möglich voranschreiten zu können.</p>\r\nSteuerung\r\nMit dem Slider bewegst du den kleinen Charakter.Mit Hilfe des Springen-Buttons kannst du in die Luft springen.Durch einen Klick auf den Switch-Button, welchselst du die aktuelle Phase.Auf dem Item-Button wird immer das aktuelle Item angezeigt. <br/>Einige Items sind passiv, wie z.Bsp. das Totem oder die Flügel. <br/>Andere hingegen sind aktiv und müssen durch einen Klick aktiviert werden.Der Slider zeigt dir immer an in welcher Phase du dich befindest.<br/>Außerdem zeigt er dir wann der nächste Wechsel ansteht.\r\nKaufen von Items, Charakteren und Hintergründen\r\n\r\nAm Ende einer jeden Runde bekommst du Münzen, welche du im Shop / Inventar benutzen kannst.\r\n\n\r\nZusätzlich kannst du auch Charaktere und Hintergründe mit Diamanten freischalten. Diese musst du allerdings kaufen.\r\n\n\r\nKlicke dafür einfach auf das + im Hauptmenü neben den Diamanten\r\n\n<p><strong>ACHTUNG:</strong> Auch wenn die Rede davon ist, dass das Kaufen von Diamanten Echtgeld kostet, ist dies nicht der Fall. Die Diamanten sind alle kostenlos erhältlich. Trotzdem ist es wichtig, dass Du als Tester nur dann Diamanten kaufst, wenn du dies auch mit Echtgeld tun würdest.\r\n</p>\r\nSchritt für Schritt\r\n<p>Zum Abschluss wollen wir dir noch Schritt für Schritt das Vorgehen Erklären:</p>\n<ol><li>Installiere dir Swap Squad, wie oben beschrieben</li><li>Spiele Swap Squad einige Runden über die nächsten Tage</li><li>Gehe zu unserem Fragebogen und beantworte dort alle Fragen</li></ol>\n<p>Bei Fragen kannst du dich an Richard oder Erik wenden.</p>\n<p>Und das war es dann auch schon. Mit diesen drei einfachen Schritten, hilfst du uns unser Forschungsprojekt weiterzuführen.</p>", "metacritic": null, "released": "2022-05-08", "tba": false, "updated": "2022-05-09T07:00:59", "background_image": "https://media.rawg.io/media/screenshots/e19/e19b709406040597f48105fe3b0f8681.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hasenknopf", "Lyred"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}