{"id": 782732, "slug": "pattuglia-arcana-intergalattica", "name": "Pattuglia Arcana Intergalattica", "name_original": "Pattuglia Arcana Intergalattica", "description": "<p>(Descrizione in italiano più in basso)</p>\r\nIntergalactic Wizard Force is now completely in Italian!\r\nNow with 209.1% more puns*!\r\n<p>Follow the adventures of Maldrek and Xandar across the galaxy and unveil the mystery behind the creepy disappearances!</p>\n<p>Game created for LocJAM5, a worldwide localization jam organized by @alain_invasion.</p>\n<p>*Calculation based on the effective amount of new puns.</p>\r\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;Don't have time to play the game? The translation is not properly loaded? You played ad nauseam? Fear not, you can check the translated script here: [https://bit.ly/IWF-Ita-loc]&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\r\n<p>\"Join Prince Xandar, hero of the cosmos and Maldrek, the galactic wizard on an adventure through time (forwards) and space (forwards, but also sideways and diagonally).</p>\n<p>Swap between wizards to cast their own spells, such as Charm Humanoid, Mesmer, and Hyperdrive.</p>\n<p>Fly between 18 quintillion* planets</p>\n<p>Meet a bizarre cast of space aliens and wizard all over them.</p>\n<p>Enjoy \"Space Chicken\" responsibly.</p>\n<p>*Early estimates may be exaggerated, but at there's at least 2.</p>\n<p>INSTRUCTIONS</p>\n<p>If you're stuck, use your spells! Or chat to your wizard pal! [Or check the walktrough here!]</p>\n<p>Click ground to walk, and objects/characters to interact.</p>\n<p>Move your mouse to the top of screen to open your inventory, and later to change characters</p>\n<p>Equip items by clicking them. </p>\n<p>Use an equipped item by clicking it on an object or character.</p>\n<p>Right Click, or Click empty space to unequip the current item.\" </p>\n<p>(Text kindly provided by the authors)</p>\n<p>\n</p>\n\r\nGioca a Pattuglia Arcana Intergalattica, la versione italiana di Intergalactic Wizard Force!\r\nOra con il 209,1% in più di giochi di parole*!\r\n<p>Segui le avventure di Maldrek e Xandar attraverso la galassia e svela il mistero che si cela dietro le inquietanti sparizioni!</p>\n<p>Gioco localizzato per la LocJAM5, una maratona mondiale di localizzazione creata da @alain_invasion.</p>\n<p>*Calcolo effettuato sulla base dell'effettivo numero di giochi di parole aggiuntivi.</p>\r\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;Non hai tempo di giocare? La traduzione non viene caricata? Hai già giocato fino alla nausea? Non temere, puoi trovare il testo tradotto qui: [https://bit.ly/IWF-Ita-loc]&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\r\n<p>\"Parti per un'avventura attraverso il tempo (solo verso il futuro) e lo spazio (in avanti e anche lateralmente) assieme al principe Xandar, l'eroe del cosmo, e a Maldrek, il mago galattico.</p>\n<p>Passa da un mago all'altro per lanciare i loro incantesimi unici, come Incanta-mente, Ipnosi e Iperguida.</p>\n<p>Vola attraverso 18 quintilioni* di pianeti</p>\n<p>Incontra uno strampalato cast di alieni spaziali e di onnipresenti maghi.</p>\n<p>Consuma \"pollo spaziale\" con moderazione.</p>\n<p>*Le stime iniziali possono essere esagerate, ma ci sono almeno due pianeti.</p>\n<p>ISTRUZIONI</p>\n<p>Se non riesci a procedere, usa i tuoi incantesimi! O parla con il tuo collega mago! [O dai un'occhiata alle soluzioni qui!]</p>\n<p>Fai clic sul terreno per camminare, e sugli oggetti e personaggi per interagire con essi.</p>\n<p>Sposta il cursore sulla parte superiore dello schermo per aprire il tuo inventario e, in seguito, per cambiare personaggio.</p>\n<p>Raccogli gli oggetti facendo clic su di essi. </p>\n<p>Utilizza un oggetto in tuo possesso facendo clic con esso su un oggetto o un personaggio.</p>\n<p>Per rimuovere l'oggetto selezionato, fai clic con il tasto destro o su uno spazio vuoto.\"</p>\n<p>(Testo gentilmente fornito dagli autori)</p>\n<p>___________________________________________________________________</p>\n<p>This work is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License.</p>\n<p>The LanaPixel font (c) 2020, eishiya (https://mastodon.art/@eishiya) is licensed under the Creative Commons Attribution 4.0 International License.</p>", "metacritic": null, "released": "2022-05-08", "tba": false, "updated": "2022-05-09T08:11:36", "background_image": "https://media.rawg.io/media/screenshots/4cd/4cd0767b3e907cd5a3c6ee5d67363dd0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Chiara@LoQAce"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}