{"id": 78317, "slug": "2-fotos-1-palabra-2k18", "name": "2 Fotos 1 Palabra 2k18", "name_original": "2 Fotos 1 Palabra 2k18", "description": "2 Fotos 1 Palabra!\" es un Fascinante y Adictivo juego donde tendrás que Combinar las 2 imágenes que aparecen en pantalla y formar 1 Palabra. Tendrás que poner aprueba tus conocimientos y habilidades para adivinar la palabra.<br/><br/>* NUEVOS RETOS *<br/>Hemos agregado nuevos retos ¡Increíbles! solo para ti, incluimos +40 niveles y categorías, e incluso estamos en creación de nuevos niveles que estarán disponibles muy pronto<br/><br/>* TAMBIÉN PUEDES APRENDER *<br/>2 Fotos 1 Palabras es un entretenido juego donde no solo te divertirás, también aprenderás nuevas palabras compuestas, así que es más que un típico juego de Palabras, podrás compartir los niveles con tus amigos y pedirles que te ayuden a resolverlo, también podrás obtener pistas para avanzar de nivel más rápido.<br/><br/>¿Te atreves a solucionar todos los Fantásticos y Desafiantes niveles que este juego de trivia tiene para ti? ¿Podrás llegar hasta el Final?... <br/><br/>¡Te RETO a comentar/dejar en la reseña de nuestro juego \"¡Lo Logre!\" al completar todos los niveles! , claro si es que puedes ;-)<br/><br/>*** Características ***<br/><br/>* Interfaz Amigable<br/>* Más de 45 Desafiantes Niveles<br/>* Gana Monedas cada vez que avanzas de nivel para adquirir pistas<br/>* Opciones para pedir ayuda a tus Amigos si no descubres la respuesta correcta<br/>* Opciones para recibir monedas rápido y gratis si necesitas pistas<br/>* \"2 Fotos 1 Palabra\" es un Juego Completamente Gratis", "metacritic": null, "released": "2018-08-05", "tba": false, "updated": "2019-10-22T14:23:31", "background_image": "https://media.rawg.io/media/screenshots/770/770e5222502b68b5f63a613595219934.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Denis Slava"], "genres": [], "publishers": ["Denis Slava"], "esrb_rating": "Everyone 10+"}