{"id": 783110, "slug": "draconian-union", "name": "Draconian Union", "name_original": "Draconian Union", "description": "<p>CURRENTLY A PROTOTYPE</p>\n<p>Draconian Union is a 2D action-platformer metroidvania. The idea involves the player being a form of living flame that takes over the scaled remains of a long dead soldier from an age long past, forced to take action at the whims of the Fire Mages who, for now, have control over the flame.</p>\n<p>But given it's a prototype, you don't get none of that. So here's the real deal:</p>\n<p>You control a character that was sitting around somewhere in my image files after I drew it, exploring a 3 level prototype and fighting a few basic enemies, and a boss! Over the course of the 3 levels, you'll obtain the ability to dash, to cling on walls, air jump and perform a special air attack. Despite being only 3 levels, you'll face challenge, and pass through them multiple times, with the level possibility expanding each time.</p>\n<p>Or, if you are really clever, you can do them once and break the progression. Up to you!</p>\n<p>Play with mouse and keyboard or with a controller.\r\n<br/></p>\n<p>I sought to test out movement, some basic abilities and ideas, and most importantly, see whether Godot was a viable engine to make the game in. This prototype has given me valuable experience and ideas. If you'd like to give feedback based on the prototype, go ahead! Just keep in mind that I'm focussing on gameplay over visuals and sound for this.<br/></p>", "metacritic": null, "released": "2022-05-07", "tba": false, "updated": "2022-05-09T10:44:30", "background_image": "https://media.rawg.io/media/screenshots/2e5/2e5f5b374502e62622d8b882001d4427.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Janblu Poggio"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}