{"id": 783152, "slug": "settlement-crafting-and-trading-demo", "name": "Settlement Crafting and Trading Demo", "name_original": "Settlement Crafting and Trading Demo", "description": "<p>This is a small demo of the project I have been working on recently. It has a bit of tech in it, and I have learned a lot, but I think a lot of the complexity needs to be stripped from it if I want to make something that is fun. Before I do that, though, I decided to work it into a state that would be fit to keep a copy of in my portfolio.<br/></p>\n<p>I develop on Linux, and while I plan to release games on Windows, I haven't bothered porting this demo, since I don't actually care if people play it yet! It is all written directly for X11, with no hardware acceleration, so it should be easy enough to port, when I do.<br/></p>\n<p>If you do want to play, the basic controls are WASD to move, E to pick items up, F to use them, Q to put them back down. Q also closes any menus you have open. Feel free to interact and trade with the different NPCs, and keep in mind that anything they can do, you can do also!</p>\n<p>The two products of the game's economy are food, and tools, but you can also make bowls which are useful for carrying berries and grain in larger quantities. You can buy raw resources from the different NPCs, to make food and tools to keep, or you can sell wood to the farmer or the blacksmith and they will make things themselves, or you can skip the NPCs altogether and make everything from scratch!</p>\n\n<p>There are other keybindings that are useful to know, or that you might hit accidentally:</p>\n<ul><li>Escape closes menus and ultimately opens a pause menu for saving or loading the game and for starting over.</li><li>+ and - zoom the camera in and out. You can also scroll the mouse wheel up or down.</li><li>The square brackets [ and ] rotate the camera by 90 degrees. It is slightly disorienting, but 2D camera rotation is an interesting concept to me that I would like to work on more.</li><li>By holding down the middle mouse button you can pan the world around, which when combined with the scroll wheel to zoom can allow you to look at things far away.</li><li>Backtick (`) enters fast-forward mode, which is useful if you want to walk long distances or wait for things to grow. Fast-forwarding at the start of a game can be useful if you want to buy resources but the NPCs haven't made anything yet.</li><li>C enters a layout view, that shows some of the internal logic of the NPCs, and allows you to view far away areas of the map.</li><li>R tells you what item you are currently holding, and allows you to drop that item. It was supposed to be an inventory menu, but I never made the systems to handle multiple items, due to the unnecessary complexity that I want to strip out of the game.</li><li>P takes a screenshot, which it records as a non-animated GIF file.</li><li>K starts recording an animated GIF of whatever is on screen, including menus. Press K again to save that GIF. There is no way to tell if it is still recording, so try not to get confused!</li></ul>\n<p>Also, be careful about closing the game! It will just silently close and delete any unsaved progress. I assume that people who aren't invested in the game want it to close when they tell it to close! But if you are invested then you might accidentally delete your work.</p>\n<p>Let me know what you think of it here, or on Twitter: https://twitter.com/SpiveeWorks<br/></p>", "metacritic": null, "released": "2022-05-07", "tba": false, "updated": "2022-05-09T11:03:51", "background_image": "https://media.rawg.io/media/screenshots/f33/f33ac73b6b790f4e1f9ab9362371c3aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux"], "developers": ["Spivee"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}