{"id": 783291, "slug": "grimmlins-tale-demo", "name": "Grimmlins Tale Demo", "name_original": "Grimmlins Tale Demo", "description": "<p>Grimmlins Tale is LIVE on Kickstarter! go support it!!!<br/>Grimmlins Tale is an action adventure monster tamer where you catch, train, and bond with all fairy tale inspired monsters. Fight alongside your monster friends in deep, real-time strategic combat, and hop on their backs to explore and collect in the whimsical world of Never Everland.<br/><br/></p>\n<p><strong>Fairy Tale Monsters</strong></p>\n<p>In Grimmlins Tale, all monsters are inspired by a fairy tale and characters within them. </p>\n<p>Here we have Froggold, a water type based on The Frog Prince.<br/><br/><br/></p>\n\n<p>Howlhuff, a wind type based on Little Red Riding Hood and The Big Bad Wolf</p>\n\n<p>Gremlidge, a life and earth type based on the bridge troll in Billy Goat's Gruff<br/><br/></p>\n<p>These creatures are going to help you along your journey. In grimmlins, your partners can be out and interact with you and the world totally fluidly. In Never Everland, the setting of the game, the world plays out almost like a predetermined play. All grimmlins live in a magical loop of fate where certain events will ALWAYS happen to them regardless of what they do. This is all done by an entity known as \"The Director\" who makes their lives play out in a way that echoes the stories they emulate from our world. In this way, grimmlins have no free choice, unless you save them from this fate.</p>\n\n<p><strong>Catch and Train!</strong></p>\n<p>Grimmlins is a lot of things, and one of those things is an rpg with lots of room for growth and player expression in their grimmlin and team building</p>\n<ul><li>Catch any and all of the more than 60 fully fleshed out and deep monsters from your favorite fairy tales</li><li>Train them to get stronger with a variety of customizable systems including equippable cooldown moves, equippable static abilities, and directly choosing stat investments each level!</li></ul>\n<p><strong>Command Them in Real Time!</strong></p>\n<p>Grimmlins Tale offers a deep strategic control system over your monsters while allowing you to use multiple monsters at once.</p>\n<ul><li>Order your grimmlins where to position and who they should attack</li><li>Activate and aim a variety of equippable cooldowns on each grimmlin</li><li>Command multiple grimmlins at once with up to 5 grimmlins on each team in some battles! Don't worry, to keep your wits about you there is a focus mode that puts the game into slow motion so you can think and strategize on the fly</li><li>Build the perfect team full of equippable static abilities and preset ai strategies for each grimmlin on your team</li></ul>\n<p><strong>Fight Alongside Them!</strong></p>\n<p>Grimmlins Tale is all about depth. Not only do you command multiple grimmlins at once, but you also directly control your player character while you battle.</p>\n<ul><li>Dodge roll from incoming attacks with precision</li><li>Use your hands! That's right, fighting alongside your grimmlins means throwing hands at enemy grimmlins. But be careful, because your player character is your kingpin. All grimmlins will get back up again, but when a trainer is knocked out, that trainer loses the battle.</li></ul>\n<p><strong>Explore and Collect!</strong></p>\n<p>There is lots of exploring to be done with your grimmlin friends! Throughout the game you will be collecting golden books mysteriously checked out under your name like a modern day collectathon!</p>\n<p><strong>Let's Ride!<br/></strong></p>\n<p>The player can climb and explore freely, but that's nothing compared to what your grimmlins can do for you! </p>\n<p>In Grimmlins Tale, riding and unique platforming abilities are taken to the extreme!</p>\n<p>Each grimmlin can help you get around and platform, and the large ones let you control them directly when riding! Double jump, build platforms, dash, roll, glide, and more with the help of your fairy tale friends!</p>", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-05-09T11:56:53", "background_image": "https://media.rawg.io/media/screenshots/544/544f0493a40db664d468a890e46240d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["patwert95"], "genres": ["Adventure", "RPG", "Strategy"], "publishers": [], "esrb_rating": null}