{"id": 7833, "slug": "aya", "name": "Aya", "name_original": "Aya", "description": "The game-play story begins with Satan's exploration of Aya's soul; with graphics in grainy black and white to signal that it is a inescapable nightmare. Armed with a storm lantern, light as friend, Aya enters the world of evil.Subsequently after the nightmare, Aya will get attacked by many of the evil spirits of Satan, which he successfully wards off with the deadly 13 nightmares of his evil maze. Aya needs to escape the 13 nightmares and free her soul from the darkness caused by the curse of Satan. <br/><br/>Will you help her?<br/><br/>Highlights:<br/><br/><br/>**Scary Visual**<br/><br/>Explore haunted mazes as you guide Aya through her nightmare with only a storm lantern to guide you through the darkness. Get additional night vision and thunderstorm for extra shock value!<br/><br/>**Simple Control &amp; Gameplay**<br/><br/>The whole gameplay story is finding a gate of light to get Aya out of her nightmares. Stay calm, and think your way out!<br/><br/>**Intense horror atmosphere**<br/><br/>Listen closely to the eerie sounds around you. Feel the fear as They creep closer.. <br/><br/>**13 mystery scary levels to enjoy the Halloween.**<br/><br/>Can you make it out before it’s too late? Or will you be consumed by Evil and the endless darkness of the night… <br/><br/><br/>WARNING: NOT RECOMMENDED FOR THE FAINT OF HEART!", "metacritic": null, "released": "2015-10-08", "tba": false, "updated": "2019-10-22T14:29:33", "background_image": "https://media.rawg.io/media/screenshots/e8e/e8eb1e003756a4830c5fada48d506e71.jpeg", "website": "http://www.pine-entertainment.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pine Entertainment", "Topebox Co"], "genres": ["Action", "Adventure"], "publishers": ["Pine Entertainment Company", "Topebox Co"], "esrb_rating": null}