{"id": 783382, "slug": "indiepocalypse-28", "name": "Indiepocalypse #28", "name_original": "Indiepocalypse #28", "description": "ISSUE #28\r\nCover - Joanna Krótka\r\n\r\n\n<p>Hello and welcome to Indiepocalypse!</p>\n<p>Indiepocalypse is a curated monthly collection looking to highlight the very best of the indie game scene. </p>\n<p>Each month features games by 10 different developers, including a newly commissioned game exclusive to the bundle-zine. The games cover a wide variety of styles, genres, and themes as they fight against any definition of \"indie game\" as a genre.</p>\n<p>Also, and this part is very important to me and should truly be taken as given, each contributor is paid and developers are paid royalties on all future sales.</p>\r\nThis Month's Games\r\n<br/>Q-Cubed (WIN/MAC) by Carolyn Lu\r\n\n<p>Q-Cubed is a puzzle platformer where you navigate 3D levels while seeing the world from two orthogonal perspectives</p>\n\r\nThe Nine Lives of Nim: Fortune's Fool (WIN/MAC) by Claire Ahuriri-Dunning of Sky Bear Games\r\n\n<p>Where has the Prince of Cats gone? Nim, his servant, leaves the safety of the faerie court to find where the leader of the cat spirits has gone. She finds herself in the city of Vanora, where players will meet many familiar Shakespearean characters. Stuck here for a month until the next full moon, Nim has to navigate the busy city searching for the Prince. Forced to fit in with the humans, she has to learn new skills in classes, or take jobs to make money to survive. Will Nim remain untainted by the mortal world, find her Prince, and return him to Faerie? Or has entering the city of Vanora changed her fate forever? <br/></p>\n<p>This game is a narrative life simulation, with a focus on scheduling and exploration. It features multiple endings, including several different marriage options.</p>\n\n\r\nGun Ugly (WIN) by Paul Daulby, Alex Hetherington, Thomas Watkins\r\n\n<p>Gun Ugly.  A surreal comedy action game from another dimension inspired by classic FPS games. </p>\n<p>Rise through the Tactical Chaos Operations ranks, prevent the multiverse fracture, and save ALL the worlds.</p>\n<p>\"Every time I think 'yea, this is it, cant get any weirder from here' it does\" - Ash_k</p>\n\n\r\nSUPER IS HOT (WIN/MAC/Linux) by Pyrofoux a.k.a Younès Rabii\r\n\n\n<p>Break the rules of time and rearrange them to get out of tricky situations in SUPER IS HOT: the puzzle-shooter made of bullets and pushblocks.</p>\n<p>« It's the most innovative shooter I've painfully debugged in years »</p>\n<p>Made by Pyrofoux for 7DFPS, ProcJam and Secret Santa Jam.</p>\n<p>Nominated at GDoC 2021 and AMAZE 2022.</p>\n\r\nText Tac Toe. (WIN) by SirMilkman\r\n\n<p>Text Tac Toe is Tic Tac Toe, but a text adventure.</p>\r\nWhistling Wolf Café (Physical) by Laura Govednik ~ Lucky Newt Games\r\n\n<p>Whistling Wolf Café is a physical game version of a café sim. Keeping a cozy yet fun vibe, you play a master brewer who is more focused on what a customer might need rather than what they want, and that can complicate things. All you need is a deck of playing cards, a handful of six-sided dice, and writing implements. Meanwhile, Enchanted Blend can be a journaling game or thought exercise, whatever best makes your day magical. Create the hot drink you need and use it throughout your day, or create a new blend every time you need something different. </p>\n<p>All three games are included in The Tea Bundle at a reduced price to raise money for commissioned artwork by the talented and sweet Koshi (@Koshijin on Twitter). The artwork is specifically for Whistling Wolf Café, though any extra will be used for art on another game that will be voted on should we surpass the goal.</p>\n\n\r\ndandelions (WIN/MAC/Linux) by lotus\r\n\n<p>a short story collage and a meditation on change. a game about trying to start a new life on a dying planet. memories of dandelions and mushrooms and rooftop campfires. made in rpg maker mv, for the 2020 vextro game jam.</p>\n\n\r\n\r\nNo Honour (WIN) by Flavedo\r\n\n<p>A poetry based narrative adventure about Laika - the first dog launched into space by Russia.</p>\n\r\n\r\nPsychological Assessment Test V1.0 (WIN) by Tanija\r\n\n<p>Thank you for trying out our free first session for your future therapy and agreeing to try out our in-development new form of psychological analysis - directly from your device at home! </p>\n<p>For future diagnosis, please fill out the paper sheets and this questionnaire until the next session. If you find any bugs in our assessment test application, feel free to contact our team so we can adjust the application and thus help future patients!</p>\r\n\r\n*NEWLY COMMISSIONED FOR INDIEPOCALYPSE*\r\nGraveyard Dude (NES) by Rani Baker\r\n\n<p>A spooky NES puzzle game, first NES release from ROM hacker/game developer Rani Baker/TimeKey Games.</p>\n\n\n<p> </p>\n<p><strong>*BONUS*Electric Zine Maker </strong>(WIN/MAC) by alienmelon</p>\n\r\nLauncher Courtesy of MM Bundle Launcher\r\n\r\nIndiepocalypse zine contents\r\n<p><strong>COMICS<br/></strong><em>Open and Close </em>by Sam Pender</p>\n<p><strong>FEATURES</strong><br/><em>Cassidy's Bad Game Corner: Resident Evil 2 (game.com) </em>by Cassidy<br/>Parts 61-63 of <em>69 Games About Romance</em> by Andrew<br/></p>\n<p>Interested in the Indiepocalypse being delivered straight to you every month? Sign up for the <strong>PATREON</strong>.</p>\n<p>If you are interested in contributing to Indiepocalypse check out the submission page:</p>\n<p><strong>SUBMIT YOUR GAME TO THE INDIEPOCALYPSE</strong></p>\n<p><strong>TUNE INTO INDIEPOCALYPSE RADIO, SATURDAYS 2pm EST</strong></p>\n<p><strong>FOLLOW INDIEPOCALYPSE ON TWITTER</strong><br/></p>\n<p><strong>COMIC ARTISTS AND OTHER ZINE CONTRIBUTORS APPLY HERE</strong></p>\n<p><strong>SIGN UP FOR THE NEWSLETTER </strong>(and get free copies of the PDFs!)</p>\n<p><strong>THE FULL INDIEPOCALYPSE CATALOG</strong></p>\n<p><strong>DISCORD</strong></p>\n<p><strong>ADVERTISE WITH US</strong></p>", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-05-09T12:35:02", "background_image": "https://media.rawg.io/media/screenshots/717/7173999302d191d521754c09934db981.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["PIZZAPRANKS"], "genres": [], "publishers": [], "esrb_rating": null}