{"id": 783407, "slug": "color-lines-andreasklein", "name": "Color Lines (andreasKlein)", "name_original": "Color Lines (andreasKlein)", "description": "<p>     </p>\n<p>As one of my favorite time wasters, GAMOS' Color Lines is a wonderful puzzle game similar to Tetris that is easy to learn, but difficult to master.<br/></p>\n<p>The idea, as described on the official site, goes as follows: \"Game field is a square divided into 9x9 cells on which balls of different colors appear every now and then.   </p>\n<p>Your goal is to reach the maximum score and to capture the Main prize - the Golden Crown of the Champion. You earn points for removing balls from the field. There can only be a single line on the game field that is made up of five or more balls of the same color. By moving the balls around the field, these lines can be created. As long as no other balls remain between the initial and destination cells, a ball may move along vertical and horizontal (but not diagonal!) lines.</p>\n<p>Jumping over other balls is not allowed.</p>\n<p>Each turn allows you to transfer one ball, regardless of how far it travelled. In your next turn, three more balls are dropped (their colors and locations are random). Therefore, your next move will be more challenging!</p>\n<p>It sounds simple, right? The next portion of balls won't appear immediately if your move has caused a line to disappear.</p>\n<p>Like Tetris, this cross between Othello and Tetris is maddeningly addictive - and you don't need good reflexes to master it.</p>\n<p>A great way to waste time at the office ;)</p>\n<p>Two thumbs up, way up! You'll be pleasantly surprised by one of the best puzzle games ever made.</p>\n<p><strong> </strong><strong>Features of this game:</strong></p>\n<ul><li><em>The game gives a 100% charm of the old version.\r\n  </em></li><li><em>Contrary to the Dos version, this game is equipped with a leaderboard so that you can track your game progress.\r\n  </em></li><li><em>Save your game progress\r\n  </em></li><li><em>Infinite number of levels.\r\n  </em></li><li><em>The original concept of \"king\" and \"pretender\" is faithfully reproduced\r\n  </em></li><li><em>In contrast to the old Dos version, this version is playable on MacOS as well as Linux.\r\n  </em></li></ul>\n<p><em> </em>\n</p>", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-05-09T12:43:26", "background_image": "https://media.rawg.io/media/screenshots/8ec/8ecb67eca211d82f96b5320fad62ccf6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["andreasklein"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}