{"id": 783546, "slug": "escaping-the-world", "name": "Escaping The World", "name_original": "Escaping The World", "description": "<p>Your ship has been destroyed and you are in great danger. Run as fast as you can. Jump to escape enemies. Collect energy cells to repair your ship and escape the planet. </p><p>The game is configured as Endless runner (Infinite Runner), a sub-genre of platform game in which the player's character is forced to run for an infinite amount of time,  avoiding obstacles. The player's objective is to reach a high score by surviving as long as possible.</p><ul><li><strong>Character</strong></li></ul><p>The main character of the game is a peaceful and exploring alien who dedicates  his time to knowing and unlocking the secrets of the universe.</p><p>Unfortunately, his ship was hit by an unknown enemy and he had no choice but to make an emergency landing  on a hostile planet full of evil creatures. Fearing the evil that haunts him, his only alternative is to  run as fast as he can and collect as many energy cells as possible to repair his ship and escape this treacherous planet.</p><p>The game consists of running as fast as possible to collect as many energy cells as possible and finally managing to repair your ship to escape the planet. </p><p>By collecting as many energy cells as necessary to repair your ship, you will be able to complete the central objective of the game which is to escape the planet and save yourself from enemies.</p>", "metacritic": null, "released": "2022-05-06", "tba": false, "updated": "2022-05-09T13:45:22", "background_image": "https://media.rawg.io/media/screenshots/4c2/4c22e175e6aa061ceacc281b93675e9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["AdInfinitum Studios"], "genres": [], "publishers": [], "esrb_rating": null}