{"id": 7835, "slug": "gluddle", "name": "Gluddle", "name_original": "Gluddle", "description": "Free the Gluddle from The Supervision in this eye-catching bouncy game for iPhone and iPad! <br/><br/>Aim and shoot springy globular characters called Gluddle. Freeze them in mid-air to help other Gluddle bounce about and defend their privacy and freedom from the evil eyes-in-the-sky...The Supervision!<br/><br/>It's pinball meets trampoline, it's Peggle meets Angry Birds, it's a totalitarian invasion eye-to-eye with a resilient resistance.<br/><br/>No In-App Purchases!<br/><br/>••••• Kotaku Gaming App of the Day ••••• <br/>••••• Eurogamer App of the Day •••••<br/>••••• Control Industry Award Nominee for Best Dutch Game 2012 •••••<br/>••••• Major Fun Award Winner •••••<br/>••••• It’s one of the best iOS puzzlers I’ve ever played - TheAppShack ••••• <br/>__________________________<br/><br/>Gluddle features:<br/>• 116 colorful levels of springy madness, eye-popping challenges, magical pickups, transportational phenomena, gravity-defying physics and recreational explosions, all in beat with flowy interactive music (may contain earwurms) and ear-tingling sounds. <br/>• unlimited Gluddle with an optimistic attitude (\"Oi!\")<br/>• 1 invasion of The Supervision with slightly more vocabulary. <br/>• magical pick-ups with amazing powers<br/>• rocks.<br/>• lots of credits.<br/>• real-life statistics of Oi!s and launches.<br/>• a complete absence of zombies, goblins, vampires and aliens!<br/><br/>This version of Gluddle runs on iPad3, iPad2, iPad, iPad Mini, iPhone 5, iPhone 4s, iPhone 4, iPod Touch 4rd generation and iPod Touch 3rd generation on IOS 4, 5 and 6. Now with Game Center support! <br/><br/>__________________________<br/><br/>Reviews:<br/><br/>\"There truly is no other game quite like Gluddle.\" - IndieGameMag<br/><br/>\"Clever and well-realized, rock-solid, highly addictive gameplay. These goofy eyeballs bounce into near-perfect physics perfection.\" - Kotaku<br/><br/>‎\"Gluddle made me laugh. Several times. Out loud. (...) It’s a puzzle, a physics game, and there’s a lot to figure out, and the thing is, you can’t lose, and it makes you laugh. It is fun. Major Fun. It will make you laugh. It will keep you playing. It will make you laugh some more.\" - Majorfun.com<br/><br/>\"Gluddle, which is one of the most addictive physics-based iOS games I’ve come across, has just been bumped to version 2.0. In its initial state, Gluddle is already a fantastic physics puzzler. But now, in its updated version, the game is even more so.\" - AppAdvice<br/><br/>\"Gluddle is a fantastic, creative game that doesn’t just copy the mechanics of other puzzle titles, it takes them, mashes them together, and pushes them farther than they have been previously, and has had some great support through updates from the developers. For that, it’s definitely worth checking out.\" - TheAppShack<br/><br/>\"Lots of physics-based knock out games will really raise your blood pressure (Angry Birds and Cut the Rope are notorious for this).  For some reason, Gluddle doesn’t do this.  It’s mellow.\" - BestKidsApps<br/><br/>\"It’s like throwing a bouncy ball very hard indoors and seeing what it smashes. Fun, in other words.\" - Games Asylum<br/><br/>\"Wa-Wa-wow! This game is absolutely immense!\" - WeDoCode<br/><br/>\"When George Orwell sat down to write dark dystopian novel Nineteen Eighty-Four, he couldn't have known that he would one day inspire Gluddle, a physics-based iOS puzzler where you dislodge spying Big Brother-style eyes in the sky.\" - Eurogamer App of the Day<br/><br/>\"Gluddle is a solid title. This hidden gem is packed with amusing gameplay, impressive music and colorful graphics that make it one of the top physics-puzzler games in my book.\" - AppsOnTap<br/><br/>\"That game is confusing, obscure, weird and has a soundtrack that is almost annoying. Played the demo for a couple of minutes, fell in love with it and bought the full version. Great job, and great game!\" - ZombieGorilla", "metacritic": null, "released": "2012-02-15", "tba": false, "updated": "2019-10-22T14:29:34", "background_image": "https://media.rawg.io/media/screenshots/816/816623f5ece3dbe009d1374e2cc4fd9a_SGnYpHU.jpeg", "website": "http://gluddle.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Creative Heroes"], "genres": ["Action", "Puzzle"], "publishers": ["Richard Van tol"], "esrb_rating": null}