{"id": 783693, "slug": "the-gloomvale-king", "name": "The Gloomvale King", "name_original": "The Gloomvale King", "description": "<p>!!!!!Windows and Mac hardware test demo available for download!!!!!!!</p>\n<p>The more feedback I get the better. So I can design it even  further to get the most out of older CPU and GPU</p>\n\n<p>An open world fantasy game for windows, power pc OSX and Intel.</p>\n<p>Drawing on inspiration from classic games like Daggerfall/Hexen/Heretic/Diablo. A unique open world featuring 2d and 3d textures/sprites.</p>\n<p>Built in unity  version 2.6 to suit older video cards down to 16mb (Hopefully!)</p>\n<p>Native support for osx 10.3.9 and up (Universal binary)</p>\n<p>Windows 2000 and up</p>\n<p>Unique soundtrack and ambient sounds</p>\n<p>Set 80 years after the defeat of the black magic. A volcanic eruption destroys the grand mages cave. The chest of light is presumed lost and the grand mage dead. </p>\n<p>Meanwhile the king of the United Realms is struck by a terminal sickness. Using unconventional methods to prolong his life he creates and wields a new magic by practising ancient rituals.  He unintentionally unleashes forces beyond his control. Thus creating 'The Gloomvale'. A land where crops wither and die. A land where water turns black and foul. </p>\n<p>As his influence spreads the days grow dark and evil takes hold. The once clear skies are clouded by a thick green fog. One by one the people of the realms fall under his spell.</p>\n\n<p>A lone traveller arrives in Hemwick after his caravan is attacked in the forest.  Will the traveller survive The Gloomvale? </p>", "metacritic": null, "released": "2022-04-17", "tba": false, "updated": "2022-05-09T14:45:52", "background_image": "https://media.rawg.io/media/screenshots/16c/16cad9d332e3fa277fc0365985e33369.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Hodslate"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}