{"id": 783703, "slug": "lilas-sky-ark-2", "name": "Lila's Sky Ark", "name_original": "Lila's Sky Ark", "description": "<p>Lila’s psychedelic world is in grave danger. Help her and her eccentric friends stop the Conductor’s minions from destroying all things musical and magical in this meditative action-adventure game.</p>\n<p>Explore this dark yet groovy world as you unravel the poetic mystery that is Lila’s story. Discover secrets, solve puzzles, and battle bizarre beasts and punishing bosses as you attempt to unite the Spirits and save the mysterious Sky Island from ruin.<br/><br/>Along the way, hunt down alchemy recipes to unlock new weapons. Battle enemies with rocks, Titan Eyes, cluster bombs, and anything else you can throw at them as you wander this music-inspired pixel dreamscape during Lila’s strange yet beautiful journey.</p>\n\n<strong>Features</strong>\n<ul><li>Explore Lila's pyschedlic world and get to know her quirky cast of friends, such as the fantastically bespectacled Doctor-Father-Sir and the raven shopkeepers.<br/>\n</li><li>Search this groovy dreamscape for hidden secrets, recipes, and even new glasses for a certain Sir.<br/>\n</li><li>Unravel Lila's puzzle-like story, which explores themes such as loss, loneliness, grief, and depression, in this moving prequel to Resolutiion.<br/>\n</li><li>Battle music-inspired enemies and punishing bosses using an array of strange weapons unlocked through alchemy recipes.\r\n</li></ul>", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-05-09T14:50:34", "background_image": "https://media.rawg.io/media/screenshots/5b6/5b68b86d3a5cd17462686be2c74a46b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Graffiti_Games"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}