{"id": 783748, "slug": "hive-3", "name": "H.I.V.E.", "name_original": "H.I.V.E.", "description": "H.I.V.E. is a roguelite autochess strategy game where the player leads the Clone revolution. <br/>\n<br/>\r\nIt's  the year 2424 a technology corporation has created the \"H.I.V.E.\" (Hyper Intelligent Virus Exterminators) clones to take care of sanitation tasks. But now these beings have gained awareness and in their beliefs all living forms aside from them are a plague. Now the clones and are taking over the city while fighting every human, robot or cyborg they might find. Lead the clones to the victory and let the H.I.V.E. win.<br/>\n<br/>\r\nManage your resources to create a small but effective batallion of clones. Upgrade them by installing chips that will increase their stats and give them special habilities. But make sure to take care of them, if a clone dies in action you will lose it for ever and all the chips that it was carrying. Every run has randomized levels that will become larger and more challenging as you progress, choose your path wisely.<br/>\n<br/>\r\nFace different game modes in every level experiencing diferent roles when it comes to attacking or defending. The clones will act on their own once the enemies start arriving but you will be in charge of their placement and choosing the strategy they will follow.<br/>\n<br/>\r\nRemember your first revolution may fail. Learn from your mistakes, save money to buy permanent upgrades and in the end the H.I.V.E. will succed.", "metacritic": null, "released": "2022-05-09", "tba": false, "updated": "2022-05-13T04:44:22", "background_image": "https://media.rawg.io/media/screenshots/191/191bd45681238c751e858429f0666650.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 19, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fernando Escribano Diez", "Antonio Galiana", "Álvaro Gil Miguelañez", "Jorge Ruiz Gallego", "Pablo Trigo", "Ángel Trompeta Merino"], "genres": ["Strategy", "Indie"], "publishers": ["Ángel Trompeta Merino"], "esrb_rating": null}