{"id": 783818, "slug": "swarm-the-city-full-release-prologue", "name": "Swarm the City: Full Release Prologue", "name_original": "Swarm the City: Full Release Prologue", "description": "<h3>Assemble an army of zombies to swarm the city</h3>You will revive as the king of zombies, infect humans to form an army of zombies, free the sealed zombie generals, fight against human weapons, raze human cities, and liberate humans from this paradoxical society!<br/><h3>Take advantage of extensive skills in the game to track and kill humans</h3>Take advantage of more than ten types of fantastic and stress-relieving General Skills such as Rain of Fire or Zombie Ball to make a toy out of humans in the palm of your hand. Use more than ten types of Zombie King skills, such as Lightning Storm, Blizzard or Corpse Explosion and obliterate anyone who gets in your way!<br/><br/>Devour the brains to acquire memories and abilities of human soldiers and let your zombies develop an affinity towards human weapons and carriers. Open the Black Mist Treasure Chest to gain powerful and precious abilities.<br/><h3>Fight against diverse enemies</h3>You will face dozens of enemies such as snipers, three-headed dogs, MG6 mechs, mechanical dragons and many more! Find out their combat strategies and eradicate all of them with your abundant skill set!<br/><br/>Increase your power and obtain the power of extinction!<br/>Study mankind's fear during battle and its will to restore their power and hope, and continuously upgrade your ranks to obtain various powers of destruction. More than 20 different spells at your disposal！<br/><h3>Evolve your generals!</h3>Raid crystal resources to evolve your zombie generals to their maximum potential in 4 different paths! Amass crystal's power and dominate the battlefield!<br/><h3>Take over the world and celebrate the return of the King of Zombies!</h3>5 stages, 20+ levels, diverse level mechanics. The King of Zombies is back and will rule the world once more!<br/>", "metacritic": null, "released": "2022-05-10", "tba": false, "updated": "2022-05-13T06:10:10", "background_image": "https://media.rawg.io/media/screenshots/e52/e52852c6ec97ca0ab967a590908ab143.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 490, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seed Lab"], "genres": ["Action", "RPG", "Strategy", "Casual"], "publishers": ["Seed Lab"], "esrb_rating": null}