{"id": 783810, "slug": "the-pest", "name": "The Pest", "name_original": "The Pest", "description": "Johnny is a funny and friendly guy. He is curious, clever and ingenious. And also, he's a virus... Yeah, literally a computer virus, seriously. Like a dangerous computer virus meant to send the world into chaos... Do you think it can be a problem?<br/><br/><br/>Johnny is the unique computer virus designed to adapt to challenges he encounters. So on your way to the Core, you will need all three of Johnny's forms:<br/><ul><li> Standard square form - average speed and jump height but stronger than other forms so is able to move objects </li><li> Tall form - low speed and high jump height, the best to drop through narrow spaces or get to high places </li><li> Flat form - high speed and low jump height, can squeeze under a low ceiling and fast enough to avoid dangers </li></ul>You will need to understand all three forms to help Johnny on his path.<br/><br/><br/>Octagon - is the headquarters of the World Security Organisation, which is responsible for order and control over the world. And now Johnny is on his way to the Core of the global security system. Just imagine what a disaster can be caused by a pest in such a system. But never mind, the system is protected with lasers, traps and unbitable puzzles, and any pest wouldn't be able to squeeze inside. They are sure of it, but with ingenuity and sleight, any system isn't impenetrable ;)<br/><br/><br/>So, as we accompany Johnny on his journey, maybe we should stop him? Possibly destroying the world is a bad idea? But the Programmer created Johnny with a purpose, how can \"son\" go against his \"father\"? Why should the world be destroyed? <br/>Oh, so many questions. I have a headache. Please, go and find your own answers in hidden parts of the system's labyrinths and help Johnny make the right decisions.", "metacritic": null, "released": "2022-05-10", "tba": false, "updated": "2022-05-13T06:01:33", "background_image": "https://media.rawg.io/media/screenshots/a9f/a9f330141f7a1dca516b5040540e0bdd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Ostap Trush"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Ostap Trush", "Multiverse Experience"], "esrb_rating": null}