{"id": 783854, "slug": "sky-resort-delphi-jessy", "name": "Sky Resort - Delphi & Jessy", "name_original": "Sky Resort - Delphi & Jessy", "description": "Sky Resort has a new manager... And that'd be you!<br/><br/>As the head of the resort, your duty is to satisfy your guests' wishes and desires, fulfill their requests no matter how lewd they are, and ensure that they'll have an unforgettable stay.<br/><br/>Are you up for the task?<br/><br/><br/><br/>Sky Resort - Delphi &amp; Jessy is the first of a series of kinetic eroges with high-quality 3D art that will cater to your kinks.<br/><br/>If you're into Cum Inflation, Futanari Sex, and Threesomes, this is the perfect game for you!<br/><br/><br/><br/>Carefree and quite a tease, Delphi will stop at nothing to seduce and have her way with her target anywhere and anytime. She enjoys provoking Jessy with the people that have nailed her down, but mostly to get under her skin.<br/><br/>She needs a reason for Jessy to dominate her in bed, after all!<br/><br/><br/><br/>Despite her menacing looks, Jessy's a laid-back girl who's always up for a good time. She likes to be in control of the situation, but knows when to give someone else the lead, especially when Delphi's around.<br/><br/>Nothing turns her on more than to see other people use her girlfriend to satisfy themselves!<h3>◆ Features</h3>◇ An erotic story around 20k+ words long (from 2 to 3 hours of gameplay)<br/><br/>◇ Many lewd scenes that will ignite your senses (and make you play with one hand)<br/>◇ Two steamy girls for you to meet (and bang)<br/>◇ 4k high-quality graphics<br/>◇ ~300 unique CGs<br/>◇ Detailed 3D backgrounds with multiple variations<br/>◇ Unlockable Image gallery, music room, and replay scene functionality<br/>◇ Achievements, Easter eggs, and more!", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2024-02-05T18:18:05", "background_image": "https://media.rawg.io/media/screenshots/5e1/5e127a7a0253c469df4e146c2d343288.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 10, "beaten": 1, "toplay": 5}, "playtime": 1, "achievements_count": 9, "ratings_count": 1, "suggestions_count": 361, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["CrazySky3D"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["CrazySky3D"], "esrb_rating": null}