{"id": 783874, "slug": "the-centennial-case-a-shijima-story", "name": "The Centennial Case: A Shijima Story", "name_original": "The Centennial Case: A Shijima Story", "description": "The Centennial Case: A Shijima Story is a new unique mystery-adventure game.<br />\nDirected by Koichiro Ito, and with Yasuhito Tachibana as the Cinematographer and Scenario Director, beautiful yet thrilling live-action footage intertwines with mysteries to solve, creating highly immersive gameplay.<br />\nThe player follows a chain of murders which take place over the span of a century. Four murders have been committed in three different time periods - 1922, 1972, and 2022.<br />\nEach episode is comprised of three parts, the Incident phase, the Reasoning phase, and the Solution phase, inviting the player to seamlessly enter into this world of mystery.<br />\nExplore these time periods, collect multiple clues, and solve a 100-year mystery.<br />\nThe Shijima family have suffered a chain of inexplicable deaths over the past century.<br />\nWhen Haruka Kagami, a mystery novelist, visits the Shiijmas, she finds herself taking on four different murder cases - occurring at different points in time.<br />\nThe red camellia and the Fruit of Youth, which invite only death.<br />\nAnd the truth behind it all, waiting to be uncovered...<br />\nHaruka Kagami, the main character, is an up-and-coming mystery writer.<br />\nPlay as Haruka Kagami and pit your wits against the murder cases.<br />\nEach murder case comprises of three parts.<br />\nThe Incident phase: See the entire murder as it unfolds, from start to end. The keys needed to solve the mysteries surrounding the murder can always be found in the video itself.<br />\nThe Reasoning phase: Put together the [Clues] and [Mysteries] found during the Incident phase and create a hypothesis in your cognitive space. You can create multiple hypotheses, but not all of them will be correct. Some things you uncover may lead you down the wrong path.<br />\nThe Solution phase: Pin down the killer based on the hypothesis you created in the Reasoning phase. Select the correct hypothesis to determine the killer. When facing a trickier culprit, they may attempt to refute your claims, so strike back with your reasoning!</p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2024-01-14T09:41:01", "background_image": "https://media.rawg.io/media/screenshots/f74/f7400a8cf34f61367fdc3094e7e3721a.jpg", "website": "https://support.square-enix-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 18, "beaten": 1, "toplay": 7}, "playtime": 9, "achievements_count": 6, "ratings_count": 2, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 2, "platforms": ["Nintendo Switch", "PlayStation 4", "PlayStation 5", "PC"], "developers": ["Square Enix"], "genres": ["Adventure"], "publishers": ["Square Enix"], "esrb_rating": "Teen"}