{"id": 783824, "slug": "lost-nova", "name": "Lost Nova", "name_original": "Lost Nova", "description": "Lost during a vacation gone wrong, help Mia gather what she needs to fix her ship and get home. Use your trusty salvaging laser to harvest resources and earn currency for buying upgrades and unlocking new activities. Meet new friends and help each other get yourselves unlost.<h3>A COZY ADVENTURE</h3>There's no rush! With no time limits or enemies to worry about, you can take your time collecting resources, making friends with the locals, or spending a relaxing day fishing in the nearby lava pools.<br/><br/><br/><h3>A CHANGING WORLD</h3>See how the peoples and places of this world change based on your actions. Create a hub for your friends to gather. Rediscover old characters in new locations. Earn your wealth through farming, mining, fishing, or exploration. Use that wealth to revitalize the local pet store and buy a cat tree for your spectral cat. Your time here makes a difference.<h3>FEATURES:</h3><ul><li><strong>Explore</strong> at your own pace. Take your time finding what's around every corner and behind every boulder.<br/><br/></li><li><strong>Craft</strong> the resources you gather into helpful <strong>upgrades</strong> for your equipment or exchange them for currency and buy items that will aid in your exploration.<br/><br/></li><li><strong>Find secrets</strong> and hints of a larger mystery. <strong>Discover</strong> why so many seem to end up in this world and why it's so hard to leave.<br/><br/></li><li>Meet others who are lost and also need help finding their way. Teach a ghost how to be scary, help a single parent with his many bear children, and help a robot work through their artistic burnout.</li></ul><br/><br/><br/>", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2023-06-03T17:49:47", "background_image": "https://media.rawg.io/media/screenshots/f3e/f3effdd5158594cfb6b384a9027a3276.jpg", "website": "https://lostnovagame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 83, "beaten": 2, "toplay": 4, "dropped": 2, "playing": 1}, "playtime": 4, "achievements_count": 17, "ratings_count": 4, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Jon Nielsen"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["HopFrog"], "esrb_rating": null}