{"id": 783885, "slug": "house-flipper-farm-dlc", "name": "House Flipper - Farm DLC", "name_original": "House Flipper - Farm DLC", "description": "\nExperience fresh farm vibes, thanks to the latest addition to the House Flipper family.\n<br/>\nLet your surroundings be filled with the sounds of the life of your animal companions!\n<br/>\nBuild homesteads and look after swine, sheep, chickens, and more!\n<br/>\nYour very own farming adventure begins now!\n<br/>\n<br/>\n<br/>\nWouldn’t an extra room in your perfectly designed house be a handy addition?\n<br/>\nDo you dream of a garage for your brand new car?\n<br/>\nIt’s now all possible, thanks to the Farm DLC\n<br/>\nA revolutionary house extension mechanic will forever change your everyday renovations.\n<br/>\n<br/>\n<br/>\nHungry? It's thyme for dinner! Lettuce celebrate!\n<br/>\nNo matter what you plant, you better take care of creating the right conditions for your vegetation!\n<br/>\nA selection of unique tools and a set of farming skills will help you with that!\n<br/>\nPrepare the soil, spare no water, and you shall be harvesting plentiful crops in a blink of an eye!\n<br/>\n<br/>\n<br/>\nKeeping your farm in check is not just a responsibility, but also a pleasure!\n<br/>\nWhistle for your favorite steed, hop in the saddle, and go for a ride around your land.\n<br/>\nKeep in mind that this is just the beginning of your adventure, farmer.\n<br/>\nMaplebloom Village awaits you!\n<br/>\n<br/>\n<br/>\nFarm DLC includes:\n<br/>\n<br/>\n- Multiple farm properties\n<br/>\n- Dozens of different farm-themed items\n<br/>\n- New story orders\n<br/>\n- Farm animals such as cows, sheep, chickens, and more\n<br/>\n- Crop plants that you need to take care of\n<br/>\n- More space with the possibility to build extensions of your house\n<br/>\n- Horse riding\n<br/>\n...And many, many more!", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-13T07:31:54", "background_image": "https://media.rawg.io/media/screenshots/826/826e662bfc974172811549f2dd0d5ae4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Empyrean"], "genres": [], "publishers": ["Frozen District"], "esrb_rating": null}