{"id": 783826, "slug": "new-yankee-battle-for-the-bride", "name": "New Yankee: Battle for the Bride", "name_original": "New Yankee: Battle for the Bride", "description": "Set off on an adventure in the name of love!<br/><br/>Embark on an adventure with a ragtag crowd of royals and help prevent a greedy knight from marrying Sir Lancaster’s daughter for money, all while facing deadly enemies and dastardly puzzles.<br/><br/><br/>Players on their journey, using strategy to determine the best use of available resources and the fastest way through each of the game's levels, all of which offer unique quests. Each step forward will unlock cunning new bonuses, provide access to thrilling mini-games and provide an opportunity to discover and earn dozens of achievements. The faster the player finishes each level, the more rewards and boosters he or she unlocks.<br/><br/><br/>Travel throughout the diverse and beautiful lands of Camelot as you attempt to prove Sir Culhwch’s love is pure.<br/>If you are feeling ready you must set out right away, Sir Culhwch needs your help and time is not on your side!<br/><br/>GAME FEATURES:<br/>- 70 unique and challenging timed levels<br/>- Minigame levels showcasing 3 addictive minigame types<br/>- Achievements<br/>- Hidden puzzle pieces to collect and assemble<br/>- Step-by-step strategy guide<br/>- High quality downloadable soundtrack included<br/>- A collection of beautiful wallpapers<br/>- Character biographies<br/><br/>", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2022-05-13T06:22:25", "background_image": "https://media.rawg.io/media/screenshots/b71/b7190d4e7411d5aa1499d5acffaba21e.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yustas Games Studio"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}