{"id": 783855, "slug": "exorcist-2", "name": "Exorcist", "name_original": "Exorcist", "description": "<strong>WARNING:</strong> This game may trigger seizures from people with photosensitive epilepsy. It is left to the discretion of the player.<br/><br/><strong>IMPORTANT NOTE:</strong> The game is exploration-oriented and you need to research your surroundings thoroughly to progress in the game.<br/>The Exorcist is a first-person psychological horror game.<br/><br/><strong>Environment</strong><br/>The game story takes place in a house in the forest, far from the city.<br/><br/><strong> The subject of the game </strong><br/>David Livingstone, who has been engaged in exorcism and magic for many years, is now tired of work fatigue and at the time of his retirement received a letter from a woman named Margaret Carney. The letter says that her husband is a ship captain. Her husband went to the Vatican on business and bought a ouija board for his daughter. And when he got home, he brought this ouija board with him and gave it to his daughter. After messing with this ouija board for a while, the little girl came into contact with a demon and was possessed by the devil. Margaret Carney is waiting for the help of David Livingstone, known by the title of Exorcist, as he is no better at Exorcism than she is.<br/><br/><strong>Note:</strong><br/>There are 2 different endings in the game, good and bad.<br/><br/><strong>Exorcist Vision</strong><br/>With its size changing feature, it allows you to see all the magic things that a normal person cannot see.<br/><br/><br/><strong>Run Stones</strong><br/>Allows the removal of magical barriers that hinder your progress.<br/>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-13T06:55:50", "background_image": "https://media.rawg.io/media/screenshots/624/62467c4a573fb178df9ae4d7355fc7a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KAYDEM Studio"], "genres": ["Action", "Adventure", "Simulation", "Indie"], "publishers": ["KAYDEM Studio"], "esrb_rating": null}