{"id": 783858, "slug": "cepheus-protocol-anthology-season-1", "name": "Cepheus Protocol Anthology Season 1", "name_original": "Cepheus Protocol Anthology Season 1", "description": "Cepheus Protocol: Anthology is a linear limited edition prose featuring the first twelve chapters of the Novelization, visual novel. Experience the outbreak of the Pangu Virus from multiple perspectives as the brave heroes of the Center for Epidemic Research and Control battle tirelessly to stop the spread of a cataclysmic alien virus that has mutated innocent people into monstrous creatures of unimaginable power with a single-minded goal spread.<br/><br/>Told from various perspectives of the outbreak, before and during, discover how the Pangu Virus was discovered, what led to the creation of the C.E.R.C., how the virus came to American shores, and who is Patient Zero. As the outbreak spreads, millions of innocent lives hang in the balance. Every day, the virus becomes more virulent as it progresses to its true nature. <br/><br/>Faced with a threat it was never meant to fight will the heroes of the C.E.R.C. be strong enough to save not just a city but prevent the extinction of the human race? See for yourself in this eye-catching visual novel that allows you to explore Cepheus Protocol's frightening events like never before.<h3>Inspired from the RTS game Cepheus Protocol </h3>https://store.steampowered.com/app/979640/Cepheus_Protocol/", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-13T06:59:06", "background_image": "https://media.rawg.io/media/screenshots/def/def820a7a9d271cd7011becd1feb06a8.jpg", "website": "https://www.cepheusprotocol.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 462, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Halcyon Winds"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Halcyon Winds"], "esrb_rating": null}