{"id": 783833, "slug": "ninja-jajamaru-the-great-yokai-battle-hell", "name": "Ninja JaJaMaru: The Great Yokai Battle + Hell", "name_original": "Ninja JaJaMaru: The Great Yokai Battle + Hell", "description": "<p>・New ninja and yokais with brand new action!<br />\nThe army of ghosts is attacking!<br />\nJoin Jajamaru, Blue jaja, and friends to fight back!<br />\nThis iteration has the most yokais that JaJaMaru and his friends have ever battled against.<br />\nFans of the series will see yokais from the past but will also be introduced to all new yokais making their series debut.<br />\nCollect over 20 playable characters - each with different powers and characteristics.<br />\nYou can also play 2 player mode simultaneously while sharing a single screen.<br />\nRegister your high score Online ranking stages are also available.<br />\nCollect the Jalecoins available in Normal Mode and fulfill the conditions to unlock the Hell Mode.<br />\nYou&#39;ll be faced with stages you&#39;ve never seen before, and some tough monsters.<br />\nThe heros, JaJaMaru and BlueJaJa have also been upgraded to Super JaJaMaru and Super BlueJaJa.<br />\nWhen you level up, Super JaJaMaru becomes a power type.<br />\nAnd the &quot;Super Blue Jaja&quot; will be powered up as a long-range shooting type that excels in wide-range attacks.<br />\nCollect the Experience Items that appear when you defeat the yokais and aim for further growth!<br />\nIf you clear all the new chapters...!?【About the Game】<br />\n・Simple rules and flashy ninja skills!<br />\nBasic controls are movement, attack, and jumping.<br />\nThe stage is cleared by defeating all the yokais that keep coming.<br />\nThere is a health gauge on both the player and yokai and once the player loses their health, the game is over.<br />\nUse your shifty Ninja skills by jumping and attacking your yokai.<br />\nDestroy all enemies to clear the stage.<br />\nAttack the enemy&#39;s footing or destroy enemies to pick up powerup items such as Invisible Potions or the Minecart,which will allow the player to plow through enemies.<br />\nActivate ninjutsu action through collecting scrolls - such as flood and fire ninjutsu.Then, Ninpo Gama Pakkun will trigger fever time.You can swallow stunned enemies with Gama Pakkun.<br />\nThe well-known &quot;Gamapackun&quot; also makes an appearance!<br />\n・Unlock your collection!<br />\nIf you collect a certain number of Gold or Souls, you can exchange them for Jalecoins and be able to play more characters.<br />\nEnjoy the variety of characters with unique moves.<br />\nYou can also collect Jalecoins to unlock songs or game documents<br />\nYou can enjoy old BGMs from JaJaMaru classics or enjoy new song and arrangements for this new title.<br />\nThere are also game documents that are only going to be able to be seen in this game.</p>", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2023-07-11T07:42:21", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e0db28f8a68d075499d8ffa59dc8978.jpg", "website": "https://ninja-jajamaru.com/jp/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 38, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 7, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch", "PlayStation 4"], "developers": ["CITY CONNECTION", "HELLO QUEST"], "genres": ["Action"], "publishers": ["CITY CONNECTION"], "esrb_rating": null}