{"id": 783950, "slug": "caperucita-roja-una-historia-diferente", "name": "Caperucita roja, una historia diferente", "name_original": "Caperucita roja, una historia diferente", "description": "<p><em>Caperucita roja, una historia diferente </em>es un juego de rol para una jugadora y una Narradora. En él descubrirás la verdadera historia del cuento clásico, reinventado la fantasía a una estética grimdark. Durante el viaje Caperucita y la Narradora colaborarán mediante la narración compartida para crear los puntos claves del viaje, lucharán por obtener el control narrativo de la escena y descubrirán juntas el gran secreto del bosque.</p>\n<p>El diseño simplista de las mecánicas de juego ayuda a establecer los puntos claves de cada escena y dejar al puro azar quién obtiene mayor peso en lo que está a punto de acontecer. Es una lucha hasta el final, es una historia que intenta construirse a sí misma luchando contra su propia Narradora.</p>\n<p>El grimdark, o más conocido como fantasía oscura, es la ambientación elegida para este viaje por el bosque. El peligro acecha en cada esquina, los lobos aullan durante el día y la luna llena sale más veces de lo que debería. El mundo es peligroso y cada vez más, se vuelve más oscura a medida que pasan los días, el bosque se retuerce sobre sí mismo como un monstruo condenado a pudrirse y morir. Esto es el grimdark impuesto en <em>Caperucita roja, una historia diferente, </em>un mundo que intenta devorarte a cada paso.</p><p>El juego contiene un total de 4 páginas en pdf interactivo para poder jugar sobre la misma maquetación.<br/></p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-13T08:00:11", "background_image": "https://media.rawg.io/media/screenshots/8e7/8e74073896b0218e7d1307114df56aba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fran Núñez Gavira"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}