{"id": 784065, "slug": "tilefinder-roguelike-rpg-free-open-alpha", "name": "Tilefinder Roguelike RPG (Free Open Alpha)", "name_original": "Tilefinder Roguelike RPG (Free Open Alpha)", "description": "Free Open Alpha<p>Tilefinder is currently in an Open Alpha phase. Let me know anything you didn't like, bugs or any improvement you think would help the game! Here's the official Discord where I gather feedback.</p><p>Alternatively, you can send anonymous feedback here.</p>Tilefinder\r\n<p><strong>Tilefinder</strong> is an indie rogue-like turn-based grid RPG in which you slay hordes of monsters through a procedurally generated kingdom to find the legendary Tile shards! While excavating the castle, a floor tile came loose, releasing eldritch corruption that overtook the kingdom. Now, with the floor tile broken, it is your job to bring all the pieces together and assemble the Tile to seal the evil back where it came from! <br/><br/>Tilefinder is my passion project; having worked on it solo for years, it has finally come to reality! Although it has bizarre encounters and whimsical dialogue, make no mistake: Tilefinder can be a difficult game in which every choice matters!<br/></p>Simple Yet Deep Combat\r\n<p>Pick your characters of choice and advance through procedurally generated kingdom maps and slay enemies in a tactical combat game that plays like chess! There are loads of interactions to explore and combos to try on the board!<br/>Will you die? Probably. Can you succeed in the end? Absolutely! Each run, you will encounter different enemies, spells, and most importantly, different loot - each time, another opportunity to show your best!<br/></p>Tons of Content\r\n<p>Pick 2 out of 3 playable characters and march on! Each character is unique and has over a dozen learnable spells (which you can get randomly, by the way), so each run will make you adapt your strategy to your spell and item options as you battle through <strong>over 35 distinct monsters, 10 uniquely designed bosses and gather over 100 items and passive treasures</strong>! All these make for tons of different strategies and maps to discover as you go, and even more secrets, Easter eggs and special interactions wait around every corner!<br/></p>Nagnus Will Remember That.\r\n<p>Buy upgrades? Pff. Where do you think you are, the underworld?You unlock upgrades by doing specific things inside the game! How about finding the blacksmith’s lost tools to unlock free equipment every run? Or try beating the lord of hell himself for a permanent power boon! There are loads of upgrades that persist from run to run, and they are all beautifully integrated into the gameplay and story!<br/></p>Open To Feedback\r\n<p>You dig it but not quite there yet? Let me know and I'll try my hardest to make the game the best version of itself! You can mail me directly, message me on Steam or even tweet to me!</p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-13T08:49:16", "background_image": "https://media.rawg.io/media/screenshots/8b6/8b66a322e021f700e4d3c84fa3ac2bd8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dave Doublee"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}