{"id": 784117, "slug": "pizza-challenge", "name": "Pizza Challenge", "name_original": "Pizza Challenge", "description": "<p>Pizza Challenge es un juego muy adictivo y entretenido.<br/><br/>Sé el más rápido en atrapar las porciones de pizza y vence a la CPU.<br/><br/>Instrucciones del juego:<br/>- Puedes jugar con dos jugadores o contra la CPU.<br/><br/>Juega contra la CPU:<br/>- Modo de juego contra la CPU, toca el color de tu mantel, para accionar el brazo y coger la rebanada de pizza.<br/>- Los indicadores, de qué color debes tocar tu mantel, se encuentran en la parte inferior de la pantalla.<br/>- Tienes ocho rebanadas de pizza para atrapar, trata de ser el más rápido, para conseguir las rebanadas.<br/>- Si puede tomar los ocho cortes y la CPU ninguno, USTED GANARÁ.<br/>- Si te llevas la mitad de las porciones, es decir, cuatro para el jugador y cuatro para la CPU, empatarás.<br/>- Si te llevas más de la mitad de las rebanadas de pizza, ganarás, tienes un indicador en la parte superior de la pantalla, donde te indicará las rebanadas que tienes, tanto gráfica como numéricamente.<br/>- Quien logre ganar tres veces ganará el juego, también indicado en la parte superior de la pantalla.<br/><br/>Juega contra otro jugador:<br/>- El modo de juego para dos jugadores es el mismo que jugar contra la CPU, pero esta vez, el jugador 2 debe tocar el color de su mantel, para operar su brazo y tomar las rebanadas de pizza.<br/>- Buena suerte y consigue la mayor cantidad de rebanadas de pizzas.<br/><br/>Características del juego:<br/>- Dos modos de juego.<br/>- Marcador de juegos ganados, por la CPU o por ti.<br/>-Juego de acción con emocionantes sonidos y animaciones.</p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-13T09:10:37", "background_image": "https://media.rawg.io/media/screenshots/f6b/f6bc537a47d35053b4ce493fc556a0ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Neda Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}