{"id": 784310, "slug": "shadow-work-game-jam-jan-2022", "name": "Shadow Work (Game Jam, Jan 2022)", "name_original": "Shadow Work (Game Jam, Jan 2022)", "description": "<p>SHADOW WORK</p>\n<p>Play as Jenny (and her dark side) as she platforms and puzzles her way out of a shadowy twisted house. </p>\n<p>Jenny is depressed and finds it hard to leave her house so she shuts herself away in the darkness of her trauma and mental battles. Through a puppet show, the game tells the story of how Jenny overcomes her shadow self by working together with it and eventually leaving her house with a stronger sense of identity. The player can switch between both the shadow-self and the real-self, or control both simultaneously, in order to solve complex puzzles that include unlocking doors, pushing objects and activating pressure plates and levers. This game was inspired by the mystical world of Media Molecule's LittleBigPlanet and it's use of puppets to tell a meaningful tale.</p>\n<p>For this 48 hour game jam for Global Game Jam '22, we had to come up with a game that matched the theme of 'Duality'. I explored the idea of using Carl Jung's Shadow Self concept from which sprung the gameplay mechanic of controlling both yourself and your shadow. Disassociating and reconnecting with your shadow also came about in order to mimic the idea of \"working with one's darker side to make progress as a human\". I came up with this game concept and narrative structure, programmed the camera work, movement, designed the first half of the level, the final puzzle and ending of the game. </p>\n<p>My ideas that couldn't be implemented within the 48 hours include: levels that utilise audio and visuals to create unease and make each puzzle a unique depiction of a different trauma. Narration throughout the game, similar to that of LittleBigPlanet but with a more pyschological focus. Gameplay mechanics where shadows of objects merge with Jenny's shadow self and push Jenny deeper into despair as she 'loses control' of her shadow self (and her shadow controls/plays differently depending on her form).</p>", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-13T10:28:43", "background_image": "https://media.rawg.io/media/screenshots/540/540cdb9de6635974055c525cf5485ded.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["forevastill"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}