{"id": 784455, "slug": "world-annihilation-operations-part-1-propagationex", "name": "World Annihilation Operations Part 1: Propagation/Extinction", "name_original": "World Annihilation Operations Part 1: Propagation/Extinction", "description": "<p><em>(voir plus bas pour la description en français)</em><br/></p>\r\nSummary\r\n<p>This is a short game I've made for my current research on the idea of impossible worlds and figures in video games. The objective, in this case, was to explore operations emerging from similar actions based on what I've chosen to call propagation (of light, shadows, objects, controls, camera views, etc.) and which creates situations that I believe may be interpreted as logical contradictions. For example, a part of the fictional world that may be perceived to accept simultaneous and contradictory spatial properties (position, rotation, scale...). </p>\n<p>This is still a work in progress. I plan to release similar small experiences like this one, based of other types of actions. In the end, I hope to be able to better understand how logical contradictions (if I may even use such an analogy) can or cannot be used in video games in order to extend what, in a more general sense both in the real world and in most fictional worlds, is considered possible. </p>\n<p><strong>The game lasts about 10 minutes. It does have an ending!</strong></p>\r\nControls\r\n<p>W, A, S, D: Move around<br/>Mouse directional : Move camera around<br/>ESC: Pause the game<br/><em><strong>NOTE </strong>: You are flying, not walking, thus you may also go upward and downward (depending where you look)</em></p>\r\nRequirements\r\n<p>While I do not have exact minimum gear requirements, note that some parts are very GPU intensive, and considering this is, for the moment, more of a conceptual experiment from my part, some operations used are not optimally implemented.<br/></p>\n<p>Regardless, it should play very well in 1080p on most recent high-end gaming PC (Windows).</p>\r\nCredits\r\n<p><strong>---Programming/Design</strong><br/>Jesse Aidyn </p>\n<p><strong>---Visual Assets/Tools</strong> <br/>Creepy cat: 3D scifi kit vol 3 <br/>MacAlpine Ventures: Desert Environment - Town &amp; Palace | CITADEL <br/>KraftMaru: Japanese Alley <br/>Nathaniel Doldersum: Mesh Combine Studio 2 <br/>Crescent Dial Games: Post Apocalyptic World Pack <br/>Eldamar Studio (fonts and main menu background) </p>\n<p><strong>---Music&amp;SFX</strong> <br/>Quiet Music for Tiny Robots - You Were My Robot Lover <br/>  <em>  License: CC-BY (https://freemusicarchive.org/music/Quiet_Music_for_Tiny_Robots/The_February_Album/09_You_Were_My_Robot_Lover/)</em> <br/>Meydän - Underwater <br/>    <em>License: CC-BY (https://freemusicarchive.org/music/Meydan/For_Creators/Underwater_1569)</em> <br/>Jesse Aidyn (Main menu tests) <br/>    <em>You may do whatever you want with these sound tests.</em> <br/>Q Up Arts LLC <br/>GameDev Market <br/>Pixabay.com <br/>    <em>License: Simplified Pixabay License (https://pixabay.com/service/license/)</em></p>\n\r\nRésumé\r\n<p>Ceci est un court jeu que j'ai fait dans le cadre de mes recherches actuelles sur l'idée de mondes et figures impossibles en jeu vidéo. L'objectif, dans ce cas, était d'explorer des opérations émergeant d'actions similaires que j'ai choisi d'appeler propagation (de lumière, d'ombres, d'objets, de mécaniques, de vues de caméra, etc.) et qui créent des situations qui, il me semble, peuvent être interprétées comme des contradictions logiques. Par exemple, une partie du monde fictionnel qui semblerait accepter des propriétés spatiales (position, rotation, échelle) contradictoires en simultané. </p>\n<p>Il s'agit d'un travail en cours. Je prévois publier d'autres petites expériences similaires basées sur d'autres types d'actions. Ultimement, j'espère pouvoir mieux comprendre comment des contradictions logiques (en présumant que je puisse même utiliser une telle analogie) peuvent être ou ne peuvent pas être utilisées dans un jeu vidéo pour étendre ce qui, dans un sens plus général s'appliquant à la fois au monde réel ainsi qu'à la plupart des mondes fictionnels, est considéré possible. </p>\n<p><strong>Le jeu dure environ 10 minutes. Il contient une fin!</strong></p>\r\nContrôles\r\n<p>W, A, S, D : Se déplacer <br/>Mouvements de la souris : Tourner la caméra<br/>\r\nESC : Mettre en pause<br/>\n<em><strong>NOTE  </strong>: Vous volez, vous ne marchez pas. Ainsi, vous pouvez aussi vous déplacer vers le haut et vers le bas (selon la direction vers laquelle vous regardez). </em></p>\r\nExigences matérielles\r\n<p>Si je ne peux offrir d'exigences matérielles minimales, notez que certaines parties de l'expérience sont très exigentes pour le GPU, et comme, pour le moment, il s'agit plus pour moi d'une expérience conceptuelle, quelques opérations ne sont pas optimalement implémentées.</p>\n<p>Néanmoins, le jeu devrait très bien fonctionner en 1080p sur la plupart des PC de jeu haut-de-gamme (sur Windows).\r\n</p>\r\nGénériques\r\n<p><strong>---Programmation/Design</strong>\n<br/>\r\nJesse Aidyn \r\n</p>\n<p><strong>---Composantes visuelles/Outils</strong> <br/>Creepy cat: 3D scifi kit vol 3\r\n<br/>\r\nMacAlpine Ventures: Desert Environment - Town &amp; Palace | CITADEL\r\n<br/>\r\nKraftMaru: Japanese Alley\r\n<br/>\r\nNathaniel Doldersum: Mesh Combine Studio 2\r\n<br/>\r\nCrescent Dial Games: Post Apocalyptic World Pack\r\n<br/>\r\nEldamar Studio (polices de caractère et arrière-plan du menu) \r\n</p>\n<p><strong>---Musique et effets sonores</strong> <br/>Quiet Music for Tiny Robots - You Were My Robot Lover\r\n  <em>  <br/>    Licence : CC-BY (https://freemusicarchive.org/music/Quiet_Music_for_Tiny_Robots/The_February_Album/09_You_Were_My_Robot_Lover/)</em>\n<br/>\r\nMeydän - Underwater\r\n    <br/><em>    Licence : CC-BY (https://freemusicarchive.org/music/Meydan/For_Creators/Underwater_1569)</em>\n<br/>\r\nJesse Aidyn (tests du menu principal)\r\n    <br/><em>    Vous pouvez utilisez ces tests sonores comme bon vous semble.</em><br/>\r\nQ Up Arts LLC\r\nGameDev Market\r\nPixabay.com\r\n    <br/><em>    Licence : Simplified Pixabay License (https://pixabay.com/service/license/)</em>\n</p>", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2022-05-13T11:27:03", "background_image": "https://media.rawg.io/media/screenshots/a30/a309c650d9849fc7b9775c940ee98228.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JesseAidyn"], "genres": [], "publishers": [], "esrb_rating": null}