{"id": 784553, "slug": "centum-knight", "name": "Centum Knight", "name_original": "Centum Knight", "description": "<p>YOUR CONTROLS:\r\n</p>\n<p>WSAD, or arrow keys.\r\n</p>\n<p>SPACE allows you to spin your sword faster, but you move slightly slower.</p>\n<p>use ZXCV and G to pause when playing with arrow keys.\r\n</p>\n<p>Use JKL; and Q when playing via WSAD.\r\n</p>\n<p>ESC allows you to save your game in the hub room. (see fig 3 and 4)  HOWEVER. IT ONLY WORKS INSIDE  THE HUB ROOM.\r\n</p>\n\n<p>Take control of Kagliento, the cursed prince of this once great land of Ozeraft.</p>\n<p>You and your fellow heroes were going to the castle in order to kick some treasonous king-killer butt when suddenly, beyond your control, the world started to collapse.</p>\n\n<p>Now, you're stuck in your camp, having to endlessly repeat the same stretch of combat, until you can somehow, possibly, manage to fix this error of the universe.</p>\n\n<p>WHAT DOES THIS GAME CONTAIN?</p>\n<p>1.  Due to Kagliento's curse allowing them to see the ways that reality is falling apart, this game features a variety of mixed media images, cutscenes, and miscellaneous artworks in a variety of forms, like hand-drawn menus, or monochrome pixel cutscenes you can admire as your reality slowly collapses around your ears.<br/></p>\n<p>2. An interesting form of arcade combat as you spin your magical blade constantly around your person, meaning you'll have to manoeuvre your body whilst trying to get your sword to hit an enemy to get that killing blow</p>\n<p>3. Hear an auditory extravaganza as you listen to 8 unique tracks created by yours truly, the developer!</p>\n<p>4. A scintillating method of arena combat, as the only way to \"win\" the game is to kill 100 enemies!</p>\n\n<p>WHAT WILL THIS GAME CONTAIN?</p>\n<p>This is currently Build 1 of the game.</p>\n<p>This means that, instead of giving you the ENTIRE experience at once, the game will update over time, adding on the rest of the game as it's made.</p>\n<p>*THIS IS NOT THE FINAL PRODUCT*</p>\n<p>Here's what you can look forwards to:</p>\n<p>1. Four special skills, activated by Z,X,C,V, (or J,K,L, and ; if you're playing with WSAD)</p>\n<p>*You'll be able to get: Arrows! Boomerangs! Bouncing spells!  and everybody's favourite, Military Grade Explosives!</p>\n\n<p>2. Bosses to analyse, challenge, and eventually CRUSH INTO SHREDS.</p>\n<p>*You will be able to unlock boss fights by beating goals the arena gives you.</p>\n\n<p>3. Non Playable Characters to talk to!</p>\n<p>*NPC's will be shopkeepers, and so you'll get these characters when you get the skills.</p>", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2022-05-13T12:02:28", "background_image": "https://media.rawg.io/media/screenshots/bfd/bfd8b50cc5a3bb33c6ab762570685ea6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fancy Fairy Co."], "genres": ["Action"], "publishers": [], "esrb_rating": null}