{"id": 784538, "slug": "stillfleet-regras-quickstart-ptbr", "name": "Stillfleet ☉ Regras Quickstart (PTBR)", "name_original": "Stillfleet ☉ Regras Quickstart (PTBR)", "description": "<p><strong><em>Stillfleet </em></strong><strong>é um novo RPG de mesa sobre explorar espaçonaves arruinadas—destroços—e planetas habitáveis análogos à Terra, sem contato com a Terra por décadas ou séculos—pedras.</strong></p>\n<p>Jogadores assumem os papéis de “froteiros”—exploradores e mineradores siderais trabalhando para a Venerável Companhia de Froteiros, mais conhecida como a Companhia, ou <strong><em>CF</em></strong> (Companhia de Froteiros). O lar deles, a estação espacial apelidada de Fuso—imagine uma lesma marinha de pedra preta ondulada com quilômetros de altura—é um mistério para os próprios habitantes. Ainda por cima, o lugar é repleto de portais espaço-temporais chamados <strong>trambolhos</strong>, muitos dos quais já estão amarrados a mundos habitáveis…\r\n</p>\n<p>Este Quickstart contém vinte e oito páginas de <strong>regras, aliens, cenários e tabelas aleatórias, </strong>além de um documento separado com oito <strong>Personagens Prontas</strong>—todas de classes e espécies diferentes.\r\n</p>\n<p>O sistema de regras de <em>Stillfleet </em>é único e super flexível. Nós o testamos com jogadores de RPGs old-school, novatos, fãs de sci-fi, e transeuntes aleatórios.\r\n</p>\n<p>Se você gostar deste Quickstart, nos apoie no Patreon, assine nossa lista de e-mail, siga-nos no Instagram e no Twitter, e junte-se a nós no nosso Discord! Nós vamos lançar novos módulos logo, no processo de compor o Livro Básico.\r\n</p>\n<p>Muito obrigado a todos os nossos playtesters, incluindo a equipe do fantástico podcast Fun City!\r\n</p>\n<p><strong><em>Stillfleet </em></strong><strong>é:</strong>\n</p>\n<ul><li>Game design e texto - Wythe Marschall\r\n</li><li>Arte - Ethan Gould\r\n</li><li>Design gráfico - Erich Lazar\r\n</li><li>Edição - Stephen Aubrey\r\n</li><li>Marketing/design adicional - Sunaree Paiwong\r\n</li><li>Web design/desenvolvimento do app - Aaron Hill\r\n</li></ul>\n<p>Este Quickstart foi localizado em português brasileiro por Leonardo Andrade.\r\n</p><p><strong>Esta versão do layout não é a versão final. Nós estamos testando as águas com o público falante de português para decidir se atualizamos o layout ou não, e se traduzimos mais do nosso material. Por favor, compartilhe sua opinião conosco e reporte erors na tradução!</strong><br/></p><p><em>From the English-language Quickstart:</em></p>", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2022-05-13T11:57:44", "background_image": "https://media.rawg.io/media/screenshots/852/8524dbe76206d27abd6023da8ac3e2b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["stillfleet"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}