{"id": 78478, "slug": "memory-match-justin-bieber-edition", "name": "Memory Match - Justin Bieber Edition!", "name_original": "Memory Match - Justin Bieber Edition!", "description": "Memory Match - Justin Bieber Edition! is a addictive puzzle memory game for kids and adults with amazing HD Graphics! <br/><br/>Comes with 15 great HD icons and interactive sounds! <br/><br/>Works on all iOS devices (iPhone, iPad, iPod). <br/><br/>Comes with casual and speed game modes with over 20 levels! <br/>* Fun - Easy: 4 cards (2 pairs) <br/>* Enjoyable - Medium: 12 cards (6 pairs) <br/>* Tricky - Hard: 20 cards (10 pairs) <br/><br/>Every time you start a level it will be different (different icons and different placements) so you can play the game as many times as you want and you won't be board. It is also fun for the kids since the icons change place every time! <br/><br/>You can also share scores on Facebook and Twitter with friends and family to see who has the best memory! <br/><br/>Full memory game features include: <br/>* Casual game mode which counts number of tile turns <br/>* Speed game mode where you can race the clock <br/>* Over 20 levels of entertainment <br/>* Game saves all high scores to device <br/>* Share high scores with friends and family of Facebook, Twitter and over email <br/>* All icons and tiles are randomly generated so you will never get bored! <br/><br/>There will be times when you play to see how fast you can finish a level as well as how many tries it took to finish the level. Memory Match Justin Bieber Edition and Score!", "metacritic": null, "released": "2014-02-13", "tba": false, "updated": "2019-07-29T23:45:45", "background_image": "https://media.rawg.io/media/screenshots/259/259b73babecb16f26cbefaa67271b86b.jpg", "website": "http://buzido.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Leigh Be"], "genres": ["Puzzle"], "publishers": ["Leigh Be"], "esrb_rating": null}