{"id": 784902, "slug": "multiplayer-tic-tac-toe-demonking715", "name": "Multiplayer Tic Tac Toe (DemonKing715)", "name_original": "Multiplayer Tic Tac Toe (DemonKing715)", "description": "Intro:\r\n<p>A multiplayer game using the Network Transport Layer in Unity for the Multiplayer Systems class in the Fall 2021 semester.</p>\r\nClient Instructions:\r\n<p>You will need both files listed below, run the Server Build first, then open the Client build twice (You need at least 2 clients connected to make the game playable).</p>\n<p>Create a new account and login, or use an existing account you already created.</p>\r\nMatchmaking &amp; Chatting:\r\n<p>To start a new game, click on \"<strong>Start Matchmaking</strong>\". When you have authority, you will be able to select a slot, you can see your letter (x/o) in the top centre screen. If you leave at any time, the other player in the match will get disconnected.</p>\n<p>You can chat with other people in the server by clicking the text box, type a message and click send.</p>\n<p>Since this game has a functional matchmaking system, you can connect multiple clients lets say 6, and they can all be in their own match. That makes for a total of 3 games being played simultaneously on the same server!</p>\r\nSpectator mode:\r\n<p>You can also join a match as an observer, click on \"<strong>Join as Observer</strong>\", you have the authority to chat with people in the server, you can watch other people play in the game, but you don't have authority to play the game, since you are spectator, not a player. There is no limit for how many spectators you can have in one match.</p>\r\nReplay mode:\r\n<p>Last but not least we have replay mode.  After a winner is determined in a game, the game footage is uploaded to the server and every client in the server can view it. Simply click in \"<strong>Replay Mode</strong>\" from the main menu, select a recording, and watch the play back. You can pause, play, fast forward and rewind the recording.</p>\r\nServer Instructions:\r\n<p>The server has a server console system implemented so that you can add specific accounts to a 'ban list', or remove them from the ban list, you can kick players from the game as well, which will also automatically ban them. Type '<strong>/help</strong>' to get a list of possible commands to choose from.</p>\r\nPort: \r\n5491\r\nIP Address:\r\n<p>Your own ipv4 address, or just type in <strong>127.0.0.1</strong> to connect to localhost (if your running the server and client on the same network).</p>", "metacritic": null, "released": "2022-05-10", "tba": false, "updated": "2022-05-13T14:26:09", "background_image": "https://media.rawg.io/media/screenshots/ab6/ab6db4c808388e547b5c431423ae786e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DemonKing715"], "genres": [], "publishers": [], "esrb_rating": null}