{"id": 784946, "slug": "lootun", "name": "Lootun", "name_original": "Lootun", "description": "Lootun allows you to control a team of up to 10 adventurers, split them into sub-teams of up to 3 and send them off to clear dungeons for you while you equip, salvage or upgrade the items they find.<br/><br/><strong>Core Features:</strong><br/>Lootun offers 3 core classes to choose from each with a custom set of skills and 3 ascendancy classes to upgrade into.<br/>There are a total of 21 default skills and 18 cooldown skills available. Each skill has 8 different passives to choose from allowing for a wide variety of builds. In addition each class and ascendancy class offers a total of 25 passives to choose from.<br/><br/><strong>350+ Unique Items</strong> to acquire providing a high level of customization when equipping your adventurers.<br/><strong>60+ Monsters and 20+ Bosses</strong> to fight each with their own selection of abilities and item drops with 90+ monster abilities being currently available.<br/><strong>14 Unique Flasks</strong> to craft and upgrade allowing you to augment your combat experience depending on your needs.<br/><strong>40+ Powerful Endgame Enchants</strong> allowing you to take your builds to the next level.<br/><strong>75+ Unique Achievements</strong> to complete with over 300 total ranks.<br/><br/><strong>Upgrades:</strong><br/>As you progress through Lootun you will be able to use your acquired materials to purchase powerful, gameplay altering upgrades including the ability to collect more, better quality, equipment, unlock crafting, professions, a flask system and powerful socketable gems.<br/><br/>Lootun provides a number of powerful automation features such as auto salvage, automatic ability casting and automatically restarting combat upon defeat. Such automation features allow you to have multiple teams of adventurers active at once.<br/><br/><strong>In-game Glossary:</strong><br/>Lootun provides a comprehensive in-game glossary which attempts to provide all the information you may need while playing. This glossary includes a breakdown of game mechanics and descriptions of every attribute. <br/><br/>As you progress through the game you will unlock additional information about each monster you encounter, the abilities they use and the items they drop. In addition information on every item, flask and enchant is available to unlock including drop locations and bonus attributes.", "metacritic": null, "released": "2022-05-10", "tba": false, "updated": "2023-11-06T21:40:26", "background_image": "https://media.rawg.io/media/screenshots/f95/f95cf72c928aa740848553420b5a5fad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 1}, "playtime": 4, "achievements_count": 113, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["ArrowSoft", "ArrowSoftGames"], "genres": ["RPG"], "publishers": ["ArrowSoftGames"], "esrb_rating": null}