{"id": 785045, "slug": "new-dimension-incomplete", "name": "New Dimension [Incomplete]", "name_original": "New Dimension [Incomplete]", "description": "<p><em>Today's your 17th birthday. You wake up, analyzing the list of people you plan to invite to celebrate, but notice something feels... off. Then you hear your little sister call for you downstairs, and learn you and your entire neighborhood have been transported to ANOTHER world!</em></p>\n<p><em>What happens next, how your story unfolds is dictated by your decisions... including your very first choice!</em></p>\n<p><strong>Features:</strong></p>\n<ul><li>Nameable protagonist!</li><li>11k+ words</li><li>1 available ending</li><li>Sci-fi or fantasy leaning plot, depending on the route you land on</li><li>Unfinished, so plenty of abrupt endings (wait, why is that listed as a feature?)</li></ul>\n<p><em>New Dimension</em> was my attempt at my own Choose-Your-Own-Adventure style novel, which was last modified January 24, 2009 (so I may have started it in 2008) and never finished. In 2011, upon discovering Ren'Py (and before starting Tofu Sheets Visual), I was going to convert this idea with some changes to a fully voiced visual novel (and I mean <em>fully voiced,</em> including narration). That was a huge undertaking that didn't quite get off the ground and remains in development hell to this day.  But it set a series of events into motion that caused TSV to even exist--getting a PM from Alexander Kwan interested in voicing, casting him in \"Operation: Magic Hero\", starting my first gen  team, etc.!</p>\n<p>So despite this story predating TSV, I still consider it important to my dev'ing journey since it's the earliest example of me writing a multi-route story, similar to how VNs work minus any pictures or audio. It also gave me an excuse to finally try my hand at the Twine engine, which I found to be the best way to present this story--as a text adventure!</p>\n<p>Please keep in mind, since it is unfinished, there will be many abrupt ends, including some choices leading to the default \"double-click to edit text\". Only 1 ending was ever finished, and is available to reach in this story. Even so, I hope you enjoy reading what is there. If the story is popular enough, I may consider finally bringing it to a conclusion, otherwise it shall remain as is for historical purposes.</p>\n<p>With that said, I hope you enjoy the story regardless! It certainly was ambitious!</p>", "metacritic": null, "released": "2022-05-10", "tba": false, "updated": "2022-05-13T15:32:54", "background_image": "https://media.rawg.io/media/screenshots/8d0/8d04e06d8ccf556497e127e5a8ac0c68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tofu Sheets Visual"], "genres": [], "publishers": [], "esrb_rating": null}