{"id": 785037, "slug": "999-blocks", "name": "999 Blocks", "name_original": "999 Blocks", "description": "<p>A musical, emergent puzzle about exploring possibilities! Move and arrange blocks in certain patterns to create different blocks, which can create other patterns that lead to more blocks! The vast possibility space constantly creates opportunities for emergent gameplay that invite you to experiment and find new ways to organise the production of blocks… or revel in the chaos!</p><br/>\n<ul><li>Find new patterns by exploring and arranging blocks cleverly!</li><li>Create an ordered factory of blocks, or embrace the chaos!</li><li>Take your time - no pressure and (almost) no way to lose!</li><li>Dynamic music based on your actions!</li><li>Share your highest scores or speedrun getting to 999!</li><li>A perfect game to play on the toilet, the bus, or a boring class!</li></ul>\n<p>999 Blocks is a game about exploration, and we highly encourage you to try finding ways to advance on your own - but if you need a little help, highlight the text down here 👇!</p>\n<ul><li>An arrow next to a block generator will create a line of blocks!</li><li>Put two line generators together to automatically create blocks of a higher tier!</li><li>The value of a spawned block is one tier down of the value of the generator that spawned it. Update your generators!</li><li>Too many arrows getting in the way? Put two arrows in opposite directions adjacent and pointing to each other and they'll disappear!</li></ul>", "metacritic": null, "released": "2022-05-10", "tba": false, "updated": "2022-05-13T15:29:02", "background_image": "https://media.rawg.io/media/screenshots/258/258dc5ed1ce2baf4212e41142749ff53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["prsas", "dartikus"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}