{"id": 78518, "slug": "christmas-colorfly-free-coloring-book-for-kids", "name": "Christmas Colorfly – Free Color.ing Book for Kids", "name_original": "Christmas Colorfly – Free Color.ing Book for Kids", "description": "Something brand new and completely unexpected! “Christmas Colorfly – Free Color.ing Book for Kids” is an amazing color app that is now available to you 24/7! Enjoy drawing with this incredible and funny app and you will certainly feel as if you are a true artist! A great variety of pictures awaits you! Explore totally new dimensions of digital coloring! This coloring book is now here to entertain you as the happiest holiday is approaching!<br/><br/>- Lots of different illustrations per each category is now at your disposal! <br/>- Easy to color – you just need to tap to select a palette and pick a color!<br/>- Tap to paint and pinch to zoom in/out! <br/>- Many interesting picture designs to paint: Snowman, Santa Claus, Christmas Tree, presents and a lot more!<br/>-  It contains a music player - choose the tune you want to listen to while coloring!<br/>- You can save and share your masterpieces via Facebook, Instagram, Messenger and Pinterest!<br/>- This amazing app works offline so you don't need to have Internet connection!<br/><br/><br/>Have you ever tried an app that would relief you from stress and everyday anxiety? Try out this one and you will most definitely not regret it! Relax with the best color therapy and start enjoying this funny app even today! This awesome app contains an easy to use interface so everyone can paint using this coloring book app! All kids and all adults who feel like kids can take a break with this unique and entertaining app! Grab it even today and check out how it works! Choose among different color shades, filters and effects and paint a wonderful picture in your own way! Work on your creativity because it is easy with this app! Everyone can be an artist! Save your works and share them via social networks! The best of everything is that this app is for free! Invite all your friends and their children to download the app! Color the Christmas pictures for free and feel like a kid again!", "metacritic": null, "released": "2016-12-02", "tba": false, "updated": "2019-07-29T23:56:31", "background_image": "https://media.rawg.io/media/screenshots/aa9/aa9f5de6a74dd6bd823b12da9a92c6af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Milica Vuksanovic"], "genres": ["Board Games", "Puzzle"], "publishers": ["Milica Vuksanovic"], "esrb_rating": null}