{"id": 785405, "slug": "theme-park-itch", "name": "Theme Park (itch)", "name_original": "Theme Park (itch)", "description": "Controls\r\n<p>Arrows: Move cursor around the screen.</p>\n<p>x: Select tool/menu/option.</p>\n<p>z: Return to previous menu.</p>\r\nHow to play\r\n<p>Take an empty field and turn it into the next big Theme Park! </p>\n\n<p>Select the Tools to access the build menu. Start by placing paths, shops and your first ride. Watch out for the cost of the buildings to be sure to not run out of money. Guests will be attracted to your park over time and spend money at each of your rides and shops. Be sure to keep them happy by providing them with rides, food and toilets.</p>\n<p>As you save more money, better rides become available for you to build. Try to build them all and keep track of your park records.</p>\n<p>Tips:</p>\n<ul><li>Happy guests will attract more visitors.</li><li>Guests will lose happiness if they are hungry or need the toilet, so be sure to spread these around your park.</li></ul>\r\nBackground\r\n<p>My second completed project for the Pico 8!</p>\n<p>This started as a test for myself to build an efficient pathfinding algorithm for use in Pico 8. The test started with just paths and up to 2500 guests walking to different parts of a maze.</p>\n<p>This is the first time I had struggled with the token limit and towards the end I was really squeezing extra space out of my code to finish the project, and more squeezing can be done still I am sure!</p>\n<p>I had a lot of fun building this project, and although it is not very long, I hope you can have fun playing it too!</p>Changes for v1.01<ul><li>Fixed the demolish tool, should now work as expected.</li><li>Improved logic checks for placing buildings.</li><li>Improved visitor logic for choosing next destination.</li></ul>\r\nCredits\r\n<p>Game created by Joseph</p>\n<p>@JosephMakesGame<br/></p>", "metacritic": null, "released": "2022-05-09", "tba": false, "updated": "2022-05-13T18:04:04", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d036ffcedf02f3637ae2e15685c8dd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Joseph"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}