{"id": 785542, "slug": "rock-paper-scissors-sojiadenusi", "name": "Rock Paper Scissors (Sojiadenusi)", "name_original": "Rock Paper Scissors (Sojiadenusi)", "description": "WARNING YOU WILL HAVE TO ZOOM OUT\r\n\r\n<p>This is a rock/paper/scissors mod. The standard rules apply but there is a twist. We have added a virus card and ranks to all of the cards in the game. The ranks will represent the amount of point you will receive should you win the round. The ranks are denoted by the stars on top of each card. The virus card on the other hand is special. It is created by the combination of a rank one rock , rank one paper and rank one scissors card in your hand. This will happen automatically. The virus card beats all cards except another virus card which will result in a draw. </p>\n<p>Additionally, we have added both a combination state and dissolving state. In the combination state you can combine cards together to create cards of higher rank. You can combine two one star cards to create a two star card. You may also combine a one start card with a two star card to create a three star card. The virus cards on the other hand can be only be combined with a two or three star cards. If combined with a two star card a rank 4 card will be created. This is denoted by a two star card with a virus token. If a virus card is combine with a three star card then a rank 9 card will be created, denoted similarly to the rank 4 cards but with three stars instead. Importantly, combinations excluding virus cards can only be done on cards of the same type.  Virus cards may be combined with any card type.</p>\n<p>In the dissolving state you can break down cards into their components.  Two star cards will break down into two one star cards. One card will go into your hand and the other will be discarded. Three star cards will break down into three one stars. One will go into your hand and the other two will be discarded. Rank 4 cards will dissolve into one two star card and a virus card. The virus card will be discarded and the two star card will be returned to your hand. Rank 9 cards function the same as rank 4 cards in the dissolve state but you will receive a 3 star card instead of a two star card. </p>\n<p><strong>Most importantly, you can only combine once each round and you can only dissolve once each round.</strong> Once you combine you are unable to do it again. The same notion goes for dissolve.  You must hit the next button to signify you are done with your actions in the current state. One you combine you must hit next to be moved to the dissolve state and then from dissolve you will be moved to the play state. In the play state that is were you select your card to be played against the computer. One you have selected a card the round is over and a winner will be determined and the scores will be adjusted. </p>\n<p>Lastly, should the ai achieve the virus card you are unable to combine or dissolve that turn. You must pick a card from your hand as it is and the round will end. Once the player's score reaches 10 they win. Also, when the UI shows attack will decrease the computer score and defend will increase your score. The computer score is top left and the player score is bottom right. Overall, the game isn't complex in any fashion we focused on keeping the rules simple but making the game very visually appealing and attractive to all players. </p>\r\nSIDE NOTE. LET ALL THE ANIMATIONS PLAY THROUGH BEFORE HITTING NEXT BUTTON\r\n<p>We think the game is a good rendition of a plain old rock paper scissors game we have all grown to love. We spent ample time on making sure the game felt right and that our additions were both easy and fun to use. A lot of time was spent on the sprite work and the combinations as well as the ability to dissolve were not that easy to implement either. We really wanted the player to feel like they had options and we wanted to create another layer to the game that isn't normally there. In sum we created an experience for the player that is not only full of the luck you would normally expect in a standard game of rock paper scissors but we added new visuals to create a better overall feel to the game. <br/></p>", "metacritic": null, "released": "2022-05-09", "tba": false, "updated": "2022-05-13T18:58:56", "background_image": "https://media.rawg.io/media/screenshots/a0d/a0d5b01ac2989bf9302b50411128d00d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sojiadenusi"], "genres": [], "publishers": [], "esrb_rating": null}