{"id": 785546, "slug": "castle-defender-v10", "name": "Castle Defender v1.0", "name_original": "Castle Defender v1.0", "description": "<p><strong>Castle Defender</strong> is a medieval high fantasy trading card game where players command powerful monsters and creatures in combination with powerful magic in order to conquer their opponent's castle in a fast-paced one-on-one multiplayer duel.<br/><br/><strong>FEATURES:</strong><br/>⚔️ Hybrid trading card game &amp; board game<br/>🃏 3 Decks:  Ranger, Knight, BattleMage<br/>👥 1 v 1 online multiplayer<br/>🎮 Competitive, medium-paced play<br/><br/><strong>OBJECTIVE:</strong><br/>The goal of the game is to destroy your opponent's castle by strategically using your spells to knock down its HP meter.</p>\n<p><strong>TURNS:</strong><br/>In the first phase (setup phase), players are able to move where they want their castle to be placed. Once you are done with the setup phase, players are given a random set of cards to use in order to help defend or destroy a castle. <br/><br/><br/><br/>Depending on which deck you choose you may be placed in either a defensive or offensive playstyle. Depending on the card it can do the following: <br/><br/>🗡️ Creatures can move and attack<br/><br/>🗡️ Traps are only seen by you and are activated when an enemy steps on it<br/>🗡️ Spells can be cast on targets from their description<br/>🗡️ Enchantments can only be used on the units you cast<br/>🗡️ When a token can move or attack, its highlighted green (e.g., your turn)<br/>🗡️ Cards can only be used if you have enough resources<br/><br/><br/><br/>Once you feel satisfied with what you've done, you can end your phase and it will now be your opponent's turn. Be aware of your resources, however, as spending too much or too little may hurt you in the long run!<br/><br/><strong>CARD DECKS:<br/><br/></strong>🔮 BattleMage -<br/>As an expert in magic, you must cast your deadly spells on evil forces. You will summon magical creatures which will help you in your battle of defeating your opponent's castle.</p>\n<p>🛡️ Knight - <br/>A tough, brute-force fighter of the land. They may not be able to cast many magical spells, but they can sure stand their ground and make a huge impact with the troops they can cast.</p>\n<p>🎯 Ranger -<br/>Trained in the way of stealth archery, you won't be able to bat an eye. You will channel creatures that will aid you in your quick and colorful attacks. Your opponent will not know what's going on!<br/><br/><strong>Do you have what it takes to be a castle destroyer?<br/><br/>Artists: <br/></strong></p>\n<p><strong>Caitlin Duff - https://cduff-home.glitch.me/ <br/>Ngan Tran - https://ngantran-azure.github.io/ngantran.github.io/index.html <br/>Logan Crist - https://www.lokriart.com/illustration <br/>Cristy Aguilar - https://cristyaguilarart.weebly.com/ <br/>Jennifer Guo - https://jenguoart.weebly.com/ <br/>Gini Lo</strong></p>", "metacritic": null, "released": "2022-05-08", "tba": false, "updated": "2022-05-13T19:00:15", "background_image": "https://media.rawg.io/media/screenshots/f36/f361ae977be9de732c40423df1afbf18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["puch"], "genres": [], "publishers": [], "esrb_rating": null}