{"id": 785684, "slug": "bountyheart", "name": "BountyHeart", "name_original": "BountyHeart", "description": "<strong>BountyHeart</strong> is a twist on <strong>roguelikes</strong> that combines <strong>Match 3</strong> with<strong> Tactical Turn Based Combat</strong>! Each run, you will recruit a party and upgrade them with powerful items in an attempt to capture the Legendary Bounty!<h3>OVERVIEW</h3>Move your characters in order to make <strong>matches </strong>of 3 or more orbs!<br/><br/><br/><br/>By matching Attack Orbs  or Charisma Orbs , you can either<strong> KILL </strong>or <strong>RECRUIT</strong> the enemies you encounter on your journey. <br/><br/><br/><br/>Killing the enemy allows you to claim their <strong>BOUNTY</strong>, granting you gold and powerful items to upgrade your party. <br/><br/>Recruiting the enemy allows you to add new members to your <strong>PARTY</strong> and make the best crew possible!<h3>ITEMS</h3>Along your journey, you will discover items that buff your characters in unique ways. Combine them with your characters to create powerful builds for your party. Each run is different, so there will be new combinations to discover every time!<br/><br/><br/>- <strong>Over 20 characters</strong> with unique abilities and stats to encounter and recruit!<br/><br/>- <strong>50 different items</strong> to mix and match to upgrade your party!<br/><br/>- <strong>Replayable Roguelite Fun</strong>. Each run is different! Adapt and strategize based on the choices you’re given.<br/><br/>- Varying Ascension levels to unlock to add even more replayability!<br/><br/>- A beautiful score composed by <strong>Alex Meade</strong><br/><br/>", "metacritic": null, "released": "2022-04-27", "tba": false, "updated": "2023-05-12T03:43:15", "background_image": "https://media.rawg.io/media/screenshots/6f8/6f85f9127ea74b28ac1d03a8f91e4bf8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Larry Wu", "BountyHeart", "BountyHeart Team"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Spookulele Games"], "esrb_rating": null}