{"id": 785798, "slug": "succubis-trap-dungeon-of-seduction", "name": "Succubi's Trap Dungeon of Seduction", "name_original": "Succubi's Trap Dungeon of Seduction", "description": "※ All characters that appear in this game are over the age of 18.<br/>\n<br/>\r\n【Story】<br/>\r\nThe town of warriors, Kazanstall...<br/>\r\nKazanstall aimed to bring up fine warriors who could vanquish monsters in the future.<br/>\n<br/>\r\nOf course, all the young men in town had dream jobs they sought after.<br/>\r\nSome wanted to be swordsmen, others wanted to be spell casters, martial artists, or monks...<br/>\r\nOne morning, Mirai (the protagonist of this story) woke up and went out in town to greet his childhood friends and fellow monster slayer trainees.<br/>\n<br/>\r\nMirai thought that another ordinary day would pass by...<br/>\n<br/>\r\nHowever, an incident strikes him out of the blue.<br/>\r\nA flock of succubi attacked the town.<br/>\r\nAll the men were kidnapped. No one knew what happened to the women.<br/>\n<br/>\r\nWhen Mirai woke up, he was inside a prison.<br/>\r\nHe was completely stripped of his weapons and equipment.<br/>\r\nHe looked around the cell and saw his fellow trainees inside...<br/>\n<br/>\r\nApparently, the succubi had successfully created their next by camouflaging themselves as humans.<br/>\r\nThe succubi launched a direct assault to prey on the humans, now that they had enough manpower.<br/>\r\nMirai, Tsubasa, Kai, and Kaoru... Could these four men successfully escape this nest,<br/>\r\nand bring peace back to Kazanstall?<br/>\n<br/>\r\nThere are various traps within this nest set up to not allow any escape.<br/>\n<br/>\r\nSome traps are human-shaped. Other traps are in the form of items... They come in all sizes and shapes.<br/>\r\nOf course, there is a chance that the men may encounter the succubi.<br/>\r\nMirai must go through the nest while fighting and trying to avoid the traps.<br/>\r\nHe must escape, no matter what happens...<br/>\n<br/>\r\n【Main Characters】<br/>\r\nMirai<br/>\r\nProtagonist<br/>\r\nHe has a cute face and is popular with girls.<br/>\r\nHe lost his parents in war and lives on his own right now.<br/>\r\nMirai aims to become a spell caster because his father was a profound wizard.<br/>\n<br/>\r\nDespite his adorable looks, he has a brave personality,<br/>\r\nand he has the courage to go against life's hardship.<br/>\n<br/>\r\nTsubasa<br/>\r\nTsubasa wants to become a swordsman. He has a leader-like position within his group of friends.<br/>\r\nHe is incredibly bright and has a cool, collected personality.<br/>\r\nHowever, there are times that his body moves before he can think things through.<br/>\n<br/>\r\nTsubasa has known Mirai for a long while and has been taking good care of him.<br/>\r\nBecause he cares for Mirai so much, he gets into fights with Marill often.<br/>\n<br/>\r\nKai<br/>\r\nKai is a passionate fellow who wants to become a martial artist.<br/>\r\nJust like Mirai, Kai lost his parents when he was younger because of a war.<br/>\r\nThe similar circumstances they share allowed them to become friends.<br/>\n<br/>\r\nPerhaps because of his eager desire to become independent as soon as possible,<br/>\r\nKai is rarely in town. He is usually training every day from dawn to dusk.<br/>\r\nThanks to his vigorous training, he is the strongest out of the four men.<br/>\n<br/>\r\nKaoru<br/>\r\nKaoru is a cowardly boy who wants to become a monk.<br/>\r\nHe takes care of the horses in his barn. He is a son of a rich family.<br/>\n<br/>\r\nKaoru cares for his friends a lot and he pursued a career as a monk because he wanted to protect everyone.<br/>\r\nHis mother died of an illness, so there is a part of him that misses her a lot.<br/>\n<br/>\r\nMarill<br/>\r\nMarill is the aristocratic daughter of the mayor of Kazanstall.<br/>\r\nShe has known Mirai since they were children. She likes Mirai, but cannot be honest with her feelings.<br/>\r\nShe is worried about Mirai, who has decided to become a spell caster since his parents' deaths during the war.<br/>\n<br/>\r\nShe may look like she has a strong personality, but inside she is quite vulnerable.<br/>\r\nIt's her dream to marry Mirai in the future.<br/>\r\nShe has an older sister who is beautiful and gentle.", "metacritic": null, "released": "2022-05-13", "tba": false, "updated": "2022-05-16T04:49:50", "background_image": "https://media.rawg.io/media/screenshots/68f/68fbf560077b15fadd8caa5b0a71de51.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ドライドリーム"], "genres": ["RPG", "Indie"], "publishers": ["WASABI entertainment"], "esrb_rating": null}