{"id": 785793, "slug": "anna-vs-the-aimaze", "name": "Anna VS the A.I.maze", "name_original": "Anna VS the A.I.maze", "description": "A physics-based platforming game in which you escape a virtual maze. Solve some mini puzzles, fight some mechanic based bosses and perform awesome physics based platforming skills using jumping and grappling.<br/><br/><br/><br/>The physics based elements were the primary focus of gameplay, hopefully you will enjoy them<br/><br/><br/>The bow is also a big focus, both for grappling and fighting certain enemies. Getting the aiming to work with both controller and mouse was a challenge but hopefully it is fun to use<br/><br/><br/><br/>There are some casual platforming elements as well as some more challenging precision platforming elements. The game was created for a younger relative who is pretty good at platforming but hopefully all ages will enjoy. It also has some timed modes where the player can challenge their skills after completing the campaign.<br/><br/><br/><br/>Troubleshooting:<br/><br/>The game was created using the Xbox Controller as the primary input device. Testing in this regard is a bit limited but it should work with most controllers as long as they have triggers available. Keyboard and Mouse will also work but a controller is recommended for gameplay.<br/><br/>The minimum requirements suggest a dedicated GPU and I think that is for the best. The game has been tested on laptops with integrated graphics and it will work at lower resolutions but might not be a very good experience. Testing in general has been somewhat limited due to the available devices available at the time.<br/><br/><br/>This is the first game I have created and I have tried to test it well but if there are any issues please email the link under support with the details and I will try my best to address them.<br/><br/>Thank you", "metacritic": null, "released": "2022-05-12", "tba": false, "updated": "2022-05-16T04:43:20", "background_image": "https://media.rawg.io/media/screenshots/0ee/0eeba20ddd66cfbccf9f8b705faa6127.jpg", "website": "https://pishah.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pishah"], "genres": ["Action", "Adventure"], "publishers": ["Pishah"], "esrb_rating": null}