{"id": 785768, "slug": "mercury-abbey", "name": "Mercury Abbey", "name_original": "Mercury Abbey", "description": "In a mansion surrounded by mist, as the curse made by the Alchemist and Fairy reappears, the danger is quietly lurking in the darkness, awaiting its visitors. \r\nFollow the pair of uncle and nephew to unravel an incredible story in Mercury Abbey, and go on an adventure that you would only find in mystery novels.\r\n【1】 Vintage pixel art and brilliant lighting\r\n<p>The game captured the essence of pixel art and partnered it with American comic-style illustrations. \r\n</p>\n<p>The Fossil Hall, Greenhouse, Labyrinth of Shrubs, Botanical Garden, Underground Cave… and many more scenes will bring you to a visual feast. The unique lighting technology creates an engaging atmosphere, presenting an unforgettable and immersive experience.\r\n</p>\n\r\n【2】 Classic cultural elements and a unique worldview\r\n<p>The game fused mystery novels' early works and incorporated the classic cultural elements from the stories into the game. This world is created with an imaginative worldview and personified animal (Furry) characters; everything about this world, from the social construct, the custom and legends to the relationship between the ethnic groups, is waiting for players to discover.\r\n</p>\n\r\n【3】 Intriguing stories\r\n<p>Bizzare things are happening in the mysterious abbey up on the mountain, and the curse of the Alchemy family is spreading everywhere. \r\n</p>\n<p>The legends of Fairies, a Society that only appears during midnight, guests who all came here with different intentions. An investigation out of curiosity has led to the discovery of inconceivable secrets. \r\n</p>\n<p>Clues dotted around the place will eventually join together to uncover the myths. Danger constantly surrounds our protagonists; how will they write the ending for this story...\r\n</p>\n\r\n【4】 There are many elements to collect and achievements to unlock\r\n<p>There are many things for you to collect, from character information to legendary stories, from collectable items to written notes and from pictures taken to gossip overheard. At the same time, exciting achievements are all over the place; each action and choice you make will take you one step closer to unlocking them. So be brave and try it out!\r\n</p>\n\n\r\n---FOLLOW US---", "metacritic": null, "released": "2022-04-15", "tba": false, "updated": "2022-05-13T20:20:51", "background_image": "https://media.rawg.io/media/screenshots/21b/21bd807992fdedc9cd64fcaa04704253.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 441, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamera Game"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}