{"id": 785827, "slug": "aery-a-new-frontier", "name": "Aery - A New Frontier", "name_original": "Aery - A New Frontier", "description": "<h3>Aery – A new Frontier is a story-driven 3D flight exploration game in which you control a bird-like creature in space and on distant planets. </h3><br/>You can observe how humanity slowly evolves, inhabits new planets and discovers the secrets of the galaxy. <br/>While you progress through the story you will be able to see the different stages in which humanity has been at every state of their evolution. <br/>The story itself talks about different events and milestones that have been reached as well as different happenings in between. <br/><br/>You can quite literally fly through space and time and different stages of human development.<br/>Follow an interesting story through a wonerful, peaceful Sci-Fi world and enjoy the speed of flying at the same time. <br/><br/>This story-driven game is non-violent so that you can enjoy the intuitive and relaxing gameplay in 8 giant different stages that are waiting to be explored.<br/><br/>The game offers the following:<br/><ul><li> Experience the feeling of flying with fluid and responsive flight controls<br/></li><li> Literally fly through space and time and the different stages of human development <br/></li><li> Follow an interesting story through time <br/></li><li> See the world with the eyes of a god-like bird creature <br/></li><li> Enjoy the intuitive and relaxing gameplay<br/></li><li> Experience the speed of a bird without enemies or other threats<br/></li><li> Explore 8 vast landscapes with a different theme, style, and mood<br/></li><li> Collect the crystals to unlock the next area<br/></li><li> Immerse into the atmosphere with a vibrant minimalistic yet sometimes even surreal art style<br/></li><li> Enjoy the beautiful bright colors with interesting and different color themes in every area<br/></li><li> Discover hidden areas and many little surprises on your way</li></ul>", "metacritic": null, "released": "2022-05-13", "tba": false, "updated": "2023-08-05T09:22:44", "background_image": "https://media.rawg.io/media/screenshots/59f/59fcb009fa77966c75dcd4ccf319f536.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "playing": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 1, "suggestions_count": 560, "game_series_count": 15, "reviews_count": 1, "platforms": ["PC"], "developers": ["EpiXR Games UG"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["EpiXR Games UG"], "esrb_rating": null}