{"id": 786083, "slug": "net-legends", "name": "Net Legends", "name_original": "Net Legends", "description": "<p>Era hace una vez, un joven Franciscano de mediada estatura, tez morena, y unos ojos llenos de brillo. Un día tenía que presentar una gran tarea para pasar el semestre. Estaba ingresando a diferentes páginas en busca de información para su deber y buscar si alguien ya había realizado su deber en la web. En su búsqueda encontró una página web que parecía tener todas las soluciones, para ello debía responder algunas preguntas como contribución para obtener el archivo que contenía los resultados de su tarea. Al dar clic en iniciar, se encontró en una web un poco rara, diseñada al puro estilo de las primeras páginas web, pero esto no le importo, la idea era obtener si o si los resultados de la tarea, después de todo quien se iba a dar cuenta que es una tarea copiada.</p>\n<p>Al inicio todo estaba bien, pero al darse cuenta que eran la media noche y debía presentar la tarea a primera hora en la mañana, aun faltándole más de la mitad de la tarea entro en desesperación pronunciando con voz suave la frase “ojalá me lleve el diablo” inmediatamente olió un olor raro como a huevo podrido seguido de un humo gris, era nada más y nada menos que el diablo, el cual le ofreció muy comedidamente su ayuda para facilitar las respuestas a las preguntas con la condición de que si no terminaba antes de las 6 am todos sus datos personales de su computadora serán de él, Franciscano acepto y rápidamente el diablo puso a trabajar a sus diablillos en semejante tarea, sin embargo, al ir avanzando cada vez más con las respuestas este no se dio cuenta que estaba entrando a un sitio que contenía malwares y diversos peligros que atentaban contra la seguridad de su computadora.\r\n</p>\n<p>Al darse cuenta de esto Franciscano, reto al diablo a ver quién de los dos terminaba la tarea antes del momento pactado por el profesor. Si el diablo terminaba la tarea a tiempo Franciscano dejaría expuesta su computadora a un mundo de pena y angustia exponiendo sus datos personales a viles tiranos que usarían su información para actos malévolos. Pero si Franciscano terminaba primero obtendría todas las respuestas y su computadora estará libre de ataques de ciberseguridad.\r\n</p>\n<p>El diablo con una riza gruesa y obscura acepta, Franciscano estaba satisfecho con el trabajo que estaba haciendo el Diablo, pero comenzó a arrepentirse del trato que había hecho, cuando uno de los diablillos no prestaba atención, Franciscano borra uno de los ejercicios propuestos en la tarea.\r\n</p>\n<p>Al amanecer del día siguiente el momento pactado por el profesor para la entrega de la tarea, el diablo exigió claramente su pago. Franciscano le mostró que faltaba un ejercicio y, por lo tanto, dado que el Diablo no había cumplido cabalmente con su parte del pacto, el contrato era nulo. Engañando y enfurecido, el diablo desapareció en una nube de humo.</p>", "metacritic": null, "released": "2022-05-15", "tba": false, "updated": "2022-05-16T07:42:07", "background_image": "https://media.rawg.io/media/screenshots/f76/f76222e8fa0f1bf71230f2adf022d65a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PaulAlvarezC"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}