{"id": 786099, "slug": "labyrana", "name": "Labyrana", "name_original": "Labyrana", "description": "Navigate your way through procedurally generated mazes in pitch darkness, but don't stay out there for too long or you die!\r\n<p>Try to find all the frogs and guide them to the center pond in a game that pushes your spacial awareness to the limit. Traversing mazes is difficult enough, but can you do it with your eyes closed and a ticking clock on top of that? Make sure to always remember the way back, and return before darkness snuffs you out!</p>\n\r\nTUTORIAL:\r\n<p>Use the WASD or arrow keys to move, esc to return to menu. Venture into the maze following the markers that reveal the locations of nearby frogs. Spending time in the darkness will cause your light to diminish, and if it goes out completely, you die, so make sure to return to safety before that happens. After approaching a frog, it will start following you. Lead it back to the center pond and it will expand the center light area. Entering that area will refill your own light completely.</p>\n\r\nDIFFICULTY SETTINGS:\r\n<p><strong>EASY </strong>- Meant to showcase the game mechanics and give a little challenge, this difficulty is a good starting point. 7 frogs are positioned close to the pond.</p>\n<p><strong>NORMAL </strong>- The intended difficulty that will provide a decent challenge. 12 frogs are scattered around the maze.</p>\n<p><strong>HARD </strong>- An unforgiving difficulty where every mistake is deadly. With 16 frogs in hard to reach places, and a more complex maze structure, it will be the true test of your maze dwelling skills.</p>", "metacritic": null, "released": "2022-05-15", "tba": false, "updated": "2022-05-16T07:49:35", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bc4d017ef5897026501daf0f214b9af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TrAceX"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}