{"id": 786397, "slug": "cheesy-trials-vic-20", "name": "Cheesy Trials (Vic 20)", "name_original": "Cheesy Trials (Vic 20)", "description": "<p>A devilish platform game for the 24K expanded Vic 20.  </p>\r\nExperiment\r\nQuestion\r\n<p>Can Mousekind demonstrate cognition?</p>\r\nMaterials\r\n<p>1. Mad scientist<br/>2. Mouse D.N.A.<br/>3. 1.21 gigawatts</p>\r\nMethod\r\n<p>1. Clone subject<br/>2. Place subject in room<br/>3. If success iterate with next room</p>\r\nInstructions\r\n<p>There are three experiments to complete, select one to play using the function keys (F1, F3, F5) or the action buttons on TheVic20's 'TheJoystick'. Can press these keys / buttons at any time to switch experiments without losing your progress.</p>\n<p>The experiment main rooms reveal doorways to the trial rooms. Initially in each experiment you will see just the first trial room. Complete it to reveal more,</p>\n<p>Control Echo the Mouse with a joystick and learn his abilities as you go. Hint, it is best to start with Experiment 1.</p>\n<p>To beat a trial room collect a piece of cheese before the time runs out. You only have 5 seconds to do this between each cheese and more of the room is revealed. Sometimes there will be more than one cheese and your choice can drastically affect the room.</p>\n<p>You have infinite clones but must be successful to proceed. If a trial room in one experiment is proving to be too challenging, jump over to one of the other experiments instead.</p>\n<p>Complete the trials in all three experiments to win Echo's freedom.</p>\n<ul><li>Learn each room</li><li>Don't hesitate</li><li>Be precise</li><li>Experiment!</li></ul>\r\nCredits\r\n<ul><li>Game design, code and graphics - Andy Hewitt</li><li>Devilish level designs - Ross Hewitt</li></ul>\n<p>Created using Turbo Rascal. The full source code for this game is included. Turbo Rascal is a very easy way to make assembler-fast 8-bit and 16-bit games using a Pascal-like language. </p>\n<p>(C) 2020 HEWCO </p>\r\nCompetition Winning Game\r\n<p><strong>Cheesy Trials</strong> was a winner in the <strong>TheC64 Winter Game Development 2020 competition</strong> held by Retro Games Ltd, coming in joint first place with a Commodore 64 game. The competition was held to celebrate new games for their flagship devices; TheC64 and TheVic20. Cheesy Trials runs fine on the original Vic 20 computer of course, but there is some additional support for TheJoystick on these new devices.</p>\r\nBuy the game on Tape\r\n<p>Want the full retro experience? The Future Was 8Bit have kindly bundled on to a real cassette tape with inlay as you might have seen it back in the day. </p>\n<ul><li>Buy your copy for only £6.99</li></ul><p>Or download the full game for free, no donation necessary.</p>", "metacritic": null, "released": "2022-05-15", "tba": false, "updated": "2022-05-16T09:52:05", "background_image": "https://media.rawg.io/media/screenshots/beb/beb89b6b623b3f32ee6b3df9453571e8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hewco"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}