{"id": 786524, "slug": "ai-rts", "name": "AI + RTS", "name_original": "AI + RTS", "description": "<p>Automated game where two AIs fight to control the oponent's base. The player can give simple orders to single units and to the whole faction using the icons in the botom left corner, this icons being Shield for defensive stance, Sword for agressive stance and the Fist for Total War, where both factions will fight to death in order to invade the other's castle. The faction that is able to keep a unit inside the enemy base for 5 seconds wins.</p>\n<p>There are 3 units:</p>\n<ul><li>Knights: melee units that have a higher movement speed, but they have a hard time traveling by forest. In addition, they prefer roads to the prairie. They have  a more aggressive behavior than the other units. Represented by a sphere.</li><li>Rangers: These units are the only ones with a range of ranged attack. They carry out patrols and prefer to move trough the forests. In defensive mode they will seek to position themselves at strategic points wherethey will wait for enemies. Represented for a square.</li><li>Warriors: Units with greater physical strength than the others. Their pathfinding avoids the woods (although not as much as the knight). Represented by a capsule.</li></ul>\n<p>In order to go to a destination, the units are using an A* algorithm to determine the best path to that point. The map is divided in different types of terrains, each of them affecting the movement of the different units.</p>", "metacritic": null, "released": "2022-05-15", "tba": false, "updated": "2022-05-16T10:40:03", "background_image": "https://media.rawg.io/media/screenshots/d3a/d3a991056e0b3f36531f6513cd17b5ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gnemegorl"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}