{"id": 786789, "slug": "fnaf-ms-paint-edition-complete-tetralogy", "name": "FNaF MS-Paint Edition Complete Tetralogy", "name_original": "FNaF MS-Paint Edition Complete Tetralogy", "description": "<p>These are my old FNaF Fangames. Even though they are utterly broken, I decided to RErelease them as they are somewhat integral to the plot of the fifth game, \"Never Enough\". </p>\n<p>Back in 2018, I wanted to remake the original four FNaF games with my own weird revision of the storyline, taking into account the recent lore of SL and FFPS. But since I didn't know how to draw or make games, I tried to play these games off as nothing more than a joke; an ironic creation. But no... they were genuine attempts at trying to retell the story of FNaF.\r\n</p>\n<p><strong>But for as embarrassing as these creations are, I decided to bring them back. With that being said, these are really, really, really, really, REALLY bad! So play these four games at your own risk! You may lose countless brain cells, or even die from cringe!</strong>\n</p>\n\n<p>I'm pretty sure these games can run on just about anything. If you can run FNaF 1-UCN on your device, surely you are able to play these, too. Just be sure to install the fonts that come with the games.</p>\n\n<p>Five Nights at Freddy's was made by Scott Cawthon. All rights belong to him. These are merely DEmakes of the first four FNaF games but are not meant to make fun of the originals. Please support the original release. Or better yet: support other small developers who make actually good fangames.</p>\n\n<p><strong>There are a few things you should know before playing:</strong></p>\n<ol><li>Don't listen to the phone calls. They are unhelpful, really corny, poorly improvised, and are a waste of time.\r\n</li><li>Patience is key to beating any of these games legitimately. But if you don't feel like waiting, just use the cheat codes.\r\n</li><li>The control scheme is really strange. If you left-click on something (such as a light switch or a panel to open cameras), then you'll have to RIGHT-click to undo it.\r\n</li><li>I've lost the .MFA files for the first three games so I am unable to patch or fix any issues with the game. Please don't comment any bugs because I won't fix them. All that remains of these games are the executable files.\r\n</li></ol>", "metacritic": null, "released": "2022-05-14", "tba": false, "updated": "2022-05-16T12:23:42", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e9301376e9705804cf9adf090990184.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frigid_Mouse"], "genres": [], "publishers": [], "esrb_rating": null}