{"id": 786719, "slug": "pixel-art-four-color-portraits-4-colors-like-in-ga", "name": "Pixel Art - Four color Portraits (4 colors like in game boy)", "name_original": "Pixel Art - Four color Portraits (4 colors like in game boy)", "description": "<p>Beautiful Portraits in four color retro art style for your project. (based on old handheld video games) There are ten unique characters, totaling 40 artworks. Each character has four versions of the same portrait redrawn at different resolutions. You can choose between 4 images which best matches the image resolution of your project. you can also use the smaller versions as icons for the larger portraits. In addition, these images are a great starting point for prototyping your projects, serving as a parameter for you to design your own arts based on the same style or use them as they are. <br/></p>\n<p><strong>Features Overview: </strong><br/></p>\n<ul><li>Ten unique characters with four image sizes Portraits for each. (A total of 40 artworks)</li><li> Images in PNG format with dimensions of 64x64, 128x128, 256x256 and 512x512. </li><li>Four color palette (with dithering effect) plus alpha transparency.</li><li> Art style of old handheld video games. </li></ul>\n<p><strong>Extras: </strong><br/></p>\n<ul><li>A compressed folder with extra Aseprite palette files. </li></ul>\n<p><strong>PS:</strong><br/></p>\n<ul><li><em> To decompress the files you need a file extractor like Win-zip, WinRAR or 7zip, which are third-party programs and are not included. <br/></em></li><li><em>To use the palette files you need to have Aseprite, which is a third-party program and is not included.( This does not affect the use of the images.) <br/></em></li><li><em>The visual style of the characters was created exclusively for this pack, any resemblance to other characters is purely coincidental.</em></li><li><em> The nicknames given to the characters are solely and exclusively for the identification of images and folders. They can and should be modified to match your project.</em></li></ul>", "metacritic": null, "released": "2022-05-14", "tba": false, "updated": "2022-05-16T11:57:00", "background_image": "https://media.rawg.io/media/screenshots/7d5/7d594bfdec56fe87633c2ad2d3e818bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Man Neko"], "genres": [], "publishers": [], "esrb_rating": null}