{"id": 786738, "slug": "lockdown-flame-flicker-interactive", "name": "Lockdown (Flame Flicker Interactive)", "name_original": "Lockdown (Flame Flicker Interactive)", "description": "\"LOCKDOWN\"\r\n<p>Lockdown is an isometric game, set in the futuristic dystopian Republic of Dimaren during an epidemic of the H84 virus. The main character James F. Rando is a Special Forces agent, whose task it is to escort vaccines for said virus to Dimaren’s capital – Gallyck. His task is interrupted by a rebellious group – The Freedom Fighters, who blow up all of the trucks containing the vaccines. James ends up being the only surviving man in his unit, and with the help of his supervisor on the radio, he somehow has to save the vaccines before the rebels destroy them!</p>\n<p>The game is downloadable for free. To play the game, download all files. Unzip them. Then open the folder and click the file with the syringe icon. The game should start and you should see the main screen.<br/><br/><br/>Lockdown Version 1.0.1</p>\n<p>All updates:</p>\n<p>- Solved several optimization issues!<br/>- Fixed several issues with sound volume in dialogue recordings.<br/>- Fixed an issue with the volume of the in-game music.<br/>- Added HUD information for abilities and music track menu.<br/>- Fixed an issue with scene loading.<br/>- Fixed an UI issue when opening billboard interface.<br/>- Fixed a scene issue after losing in the boss fight.<br/>-  Added new explosion sound effect.<br/>- Removed unnecessary particle effects for armored enemies.<br/>- Improved game's performance when the player is in combat with multiple enemies.</p>", "metacritic": null, "released": "2022-05-14", "tba": false, "updated": "2022-05-16T12:03:36", "background_image": "https://media.rawg.io/media/screenshots/ea4/ea452096cd4ab1373a3b90770dd98e2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flame Flicker Interactive"], "genres": ["Action"], "publishers": [], "esrb_rating": null}