{"id": 786746, "slug": "guzzy-edit", "name": "Guzzy Edit", "name_original": "Guzzy Edit", "description": "<p>This is a project I'm working on about little dudes (guzzys) that you can play around with. <br/></p>\n<p>Right now,  there are 5 guzzys, one type of ground, and a bad placement system. This will improve as time goes on, so stay tuned.</p>\n<p><strong>Controls:</strong></p>\n<p>Click the Icons to create a guzzy/ground object. Click again to let go.</p>\n<p>Drag objects into the bin (which is currently using a placeholder as a cross) to delete them.<br/></p>\n<p><strong>Guzzy (The One With The Blue Hat):</strong></p>\n<p>This guzzy is just a normal guzzy. He falls when there is no ground, pushes fuzzys into the void, and is the most basic guzzy of them all.</p>\n<p><strong>Fuzzy (Flying Guzzy With Orange Hat):</strong></p>\n<p>The fuzzy can fly, so it doesnt fall when it's not standing on the ground. It gets knocked over by Juzzys and Guzzys though, so don't think it's invulnerable.</p>\n<p><strong>Juzzy (Robot Guzzy):</strong></p>\n<p>The juzzy is a robot, so it is very heavy. It is bigger than the other guzzys, and falls faster too. When it falls into a fuzzy, the fuzzy will fall faster due to the weight of the juzzy.<strong><em> Fun Fact: He's called a \"juzzy\" and not a \"ruzzy\" because my brother said I should add a robot guzzy, so I put J for Jack, instead of R for Robot</em>.<br/></strong></p>\n<p><strong>Wuzzy (Walking Guzzy With Purple Hat):<br/></strong></p>\n<p>The wuzzy has a big ego, and decides he's better than everyone else because he can walk. He pushes past everyone, except stuzzys because he respects the law (which is actually something he just says so he looks better, he doesn't really like it.)</p>\n<p><strong>Stuzzy (Red Hatted Guzzy With Stop Sign):</strong></p>\n<p>The stuzzy works at the GCF which works to contain bad guzzys. He mainly targets wuzzys because of their big ego and how they bully everyone. He stops them in their tracks and lectures them until he decides to leave.</p>\n<p><strong>I hope you enjoy :D</strong><br/></p>", "metacritic": null, "released": "2022-05-14", "tba": false, "updated": "2022-05-16T12:07:20", "background_image": "https://media.rawg.io/media/screenshots/f4b/f4b544c2f9a80c6d7ad07b7cd835edd9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Binancil"], "genres": [], "publishers": [], "esrb_rating": null}