{"id": 78681, "slug": "wwii-tower-defense", "name": "WWII Tower Defense", "name_original": "WWII Tower Defense", "description": "◆◆◆ WARNING: This tower defense game is now 1.5x HARDER!! Can you beat it?? ◆◆◆<br/><br/>Full real time TD strategy for iOS. Get ready for WWII Tower Defense battles in HD. <br/><br/>Defend your lands against the evil invaders. The powerful graphics, artwork and sound effects will excite you to the fullest. Your team will consist of modern snipers, gunners, rockets, ice towers and much more. Do you have the skills to master one of the best tower defense games?<br/><br/>A deep conflict has been brewing between you and the evil invaders. Fight to protect your freedom and liberty. Fight on tropical islands, in mountains, and in deserts.<br/><br/>◆◆◆ BE THE TROOP COMMANDER ◆◆◆<br/><br/>Command your HD iron troops and find the best tower defence strategy to become number one in this awesome TD game with epic battles in jungles. Your commanding skills will be crucial!<br/><br/>◆◆◆ DO YOU HAVE THE SKILLS TO BE THE WINNER? ◆◆◆<br/><br/>There will be some intense battles. Trust us, you need to show your best defense strategies if you want to master the td game. The unique graphics, sound effects and tons of different soldiers, tanks, guns will just engage and additionally amuse you. You’ll love every second spend playing! Awesome tower defense with great units and characters.<br/><br/>◆◆◆ WWII Tower Defense<br/> features: ◆◆◆<br/><br/>◆ Epic HD battles <br/>◆ Lots of soldiers, tanks, and guns. <br/>◆ 3 islands with unique levels that allow you to fully defend and have the full battle experience <br/>◆ 6 unique towers <br/>◆ Unique and fired-up enemies <br/>◆ 24 defense levels in tropics, deserts and jungles<br/>◆ 3 extra bonus levels with Game Center integration<br/>◆ Enemies from infantry to aviation <br/>◆ Upgrade your units in the laboratory <br/>◆ Multiplayer mode (TD Battles)<br/><br/>WWII Tower Defense has never been so extreme and beautiful.<br/><br/>One of those stunning td hd games that you will never want to turn off!<br/><br/>Your feedback is greatly appreciated! <br/>info(at)buzido.com", "metacritic": null, "released": "2016-12-12", "tba": false, "updated": "2019-07-29T23:43:23", "background_image": "https://media.rawg.io/media/screenshots/d83/d836cdbee9e0553d30f14a23359d8552.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Leigh Be"], "genres": ["Action", "Strategy"], "publishers": ["Leigh Be"], "esrb_rating": null}