{"id": 787054, "slug": "we-the-people", "name": "We The People", "name_original": "We The People", "description": "<p>ViolenceCorp©®™ is going to bring about Doomsday in 14 days. How exactly, we aren't sure, but we think it involves guns and violence. Lots and lots of guns and violence. It is up to you to stop them, the only way you know how: hanging around their factory fence and yelling slogans. Can you convinve enough people to join your movement and generate enough love to thwart ViolenceCorp's©®™ evil plan before it is too late? Can you deal with the fake news media and big business oligarchs who are trying to stop you? We The People, United, Will Never Be Defeated!</p>\n\n<p><em>This game was originally created for the 42nd GM48 game jam!</em></p>\n\n<p><strong>Controls:</strong> Left Mouse Button - Pretty Self Explanatory Escape Button - Pause/Menu</p>\n\n<p><strong>Tips:</strong> The aim of the game is to manage your Love, Money and Protesters resources and buy upgrades such that you can generate 100,000 Love within 14 days. Watch out though, as unexpected crises occur at the end of each day!</p>\n\n<p><strong><em>CHECK OUT THE OTHER GAMES I'VE WORKED ON HERE:</em></strong></p>\n<p><strong>Cardseer -</strong> A roguelike card game with a campaign and gauntlet (Formerly known as Aventia):</p>\n<p><strong>STEAM    </strong><strong>ITCH</strong></p>\n<p><strong>Wor6le -</strong> A Wordle clone with the dimensions swapped; 6 letters, 5 guesses, 1 streak:</p>\n<p><strong>ITCH</strong></p>", "metacritic": null, "released": "2022-05-14", "tba": false, "updated": "2022-05-16T14:19:14", "background_image": "https://media.rawg.io/media/screenshots/010/0101bff9718302c6b7037c9adc69ed8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aventia Entertainment"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}