{"id": 787148, "slug": "racecourse", "name": "Racecourse", "name_original": "Racecourse", "description": "<p>Hipódromo es un juego muy adictivo y entretenido.</p>\n<p>Siempre que las partes lleguen a su vecindario, que desea jugar, ya que con una pista de carreras se puede jugar tantas veces como desee.<br/><br/>Las instrucciones del juego:<br/>- Seleccionar un caballo de los tres disponibles.<br/>- Tocar la pelota quiere que se lance a la pizarra y la pelota estará en condiciones de ser lanzado, una vez colocado, una flecha a su vez, de lado a lado, tocar la pelota para elegir la dirección, una vez que haya elegido la dirección obtendrá la barra de fuerza, tocó el balón para elegir la fuerza.<br/>- tratar de introducir la bola en los orificios de color amarillo, rojo y azul.<br/>- Depende del color de donde se inserta la pelota, su caballo se ejecutará más o menos.<br/>- Evitar poner la bola en el agujero blanco, debido a que su caballo no se ejecutará.<br/>- Ser rápido, para ganar la carrera.</p>\n<p>Características del juego:<br/>- Tres colores de los caballos para elegir.<br/>- ocho tablas para jugar, todos diferentes.<br/>- Cuatro colores de diferentes agujeros.<br/>- Cada junta mantendrá sus carreras ganadas o perdidas.<br/>- Activar y desactivar la música, a su gusto.<br/>- Activar y desactivar los efectos de sonido, a su gusto.<br/>- Borrar gana y se pierde carreras.<br/>- Juego de Acción con sonidos emocionantes, efectos y música pegadiza.</p>", "metacritic": null, "released": "2022-05-13", "tba": false, "updated": "2022-05-16T15:00:46", "background_image": "https://media.rawg.io/media/screenshots/c85/c855d7d57eeec73b05915d33d2e352a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Neda Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}