{"id": 787113, "slug": "mikey-adventure", "name": "Mikey Adventure", "name_original": "Mikey Adventure", "description": "<p><strong>Game Overview</strong><br/>The game is an Adventure RPG where the main character sets out to manage the root of the waste problem and along the way, you will meet two friends to help each other in the journey, each with different abilities, help each other through the levels and conquer enemies that destroy the environment.<br/><br/></p><p><strong>Game Concept</strong><br/></p><p>Zero Waste<br/>Sustainable<br/>Engagement<br/><br/><strong>Gameplay</strong><br/>Minigame 1</p><p>It's a game where players are asked to build things. There will be a waste that is assigned to the player to use creating everything not to be left as rubbish<br/>Minigame 2<br/></p><p>Help a friend separate non-compostable waste from the compostable compost bin by selecting left and right.</p><p>Minigame 3<br/></p><p>Help a friend by sorting out the trash to the correct type of bin eg. The green waste bin is a waste bin for glass bottles. The blue trash bin is a waste bin for paper waste.</p><p>Minigame 4<br/></p><p>Takedown the boss by Choosing something that loves the environment that makes the environment more sustainable.</p>\n<p>There will be a problem and audio commentary. For example, if you want to leave the house, you should turn on the light or turn off the light.</p><p><strong>Rewards of Access</strong><strong><br/>When you reach the village, you will receive the house key. To enter the mini-game after clearing the level will receive items and the followers will receive clothes made from garbage to put on or can't wear to promote Thai projects.</strong><br/><br/></p>", "metacritic": null, "released": "2022-05-13", "tba": false, "updated": "2022-05-16T14:43:52", "background_image": "https://media.rawg.io/media/screenshots/989/9899c7e7764ec69dd26435408b65a74a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Napatsawan.K"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}