{"id": 787235, "slug": "baladins-demo", "name": "Baladins | Demo", "name_original": "Baladins | Demo", "description": "<p><strong>Baladins is an online multiplayer (1 to 4) narrative game inspired by RPGs and tabletop games. It is easy to pick-up, excellent with friends and it carries the feels of a whole campaign,  packed through 1-hour sessions. Replaying allows you to unlock new story lines, places and characters on your way!<br/><br/>Gather your team</strong>, choose your characters and launch yourself on an epic adventure in the world of Gatherac. You play as a troupe of itinerant artists, caught up in <strong>the</strong> <strong>gargantuan task of entertaining a dragon</strong>. But each time you fail, the beast sends your heroes back in time, again and again!</p>\n<p>Your quest: <strong>explore the world, organize the feast, face the dragon</strong> <strong>and break the time loop!<br/><br/><br/><br/><br/></strong><strong>BALADINS</strong></p>\n<p>Buskers, party animals, troublemakers... People gave them many names, but they call themselves <strong>Baladins</strong>! They travel from one town to another to fulfill <strong>their noble quest: entertainement!</strong><br/><br/>A hard task with many faces. They can sing, dance, cook and throw a party. One day they help the community, and the other they create chaos! They can be glorious, they can be annoying, and they are always unexepected!<br/><br/><strong>Their name is as old as the land itself and their origin long-forgotten</strong>. Their deeds are told in the folktales, to amuse or to inspire. Their legend precedes them and give hope and joy to the people.</p>\n<p>~<br/><br/><strong>PICK A CHAMP</strong><br/></p>\n<p>Choose between four original heroes! Each busker has a unique skill, from <strong>cooking to fireworks, dance or luxomancy</strong> (the ancient magic of being very very good at fixing lamps). Don't judge a book by its cover, and check characteristics and classes while picking your champ!<br/></p>\n<p>~</p>\n<p><strong>EXPLORE THE WORLD</strong></p>\n<p>Travel the strange lands of Gatherac and<strong> unravel all its secrets and legends</strong>. Everybody knows a good myth is based on some truth, and myths may be a lot closer than you think. The<strong> turn-based exploration </strong>allows every player to feel the thrill of unveiling new places along the way!</p>\n<p>~</p>\n<p><strong>CHOOSE YOUR OWN PATH: ONE STORY, MANY ADVENTURES</strong></p>\n<p>Every decision taken can affect the world around, and you're the one in charge! <strong>Tailor your adventure as you go</strong> but be ready to face the consequences. The decisions you have to make are not moral choices, but <strong>creative approache</strong>s that will have very <strong>different outcomes!<br/><br/></strong></p>\n<p><strong>TRY THE DEMO!</strong></p>", "metacritic": null, "released": "2022-05-13", "tba": false, "updated": "2022-05-16T15:35:56", "background_image": "https://media.rawg.io/media/screenshots/72b/72b3dd94b300d0b0c08f6d475adfdfc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Seed by Seed"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}