{"id": 787250, "slug": "druids-of-dumnonia-xr", "name": "Druids of Dumnonia XR", "name_original": "Druids of Dumnonia XR", "description": "<p>This is a University Exploration Project into replacing VR controllers with just one Leap Motion Controller</p>\n\n<p><strong>REQUIRES A LEAP MOTION CONTROLLER FROM ULTRALEAP</strong><br/></p>\n<ul><li>If you are using an Oculus Quest (Meta Quest 1 or 2) It requires an Oculus Link cable to a PC</li><li>Requires to be run via a PC</li></ul>\n\n\n<p><strong>Instructions</strong></p>\n<ul><li>Turn your left hand to face towards your face, this will open the Elemental select GUI.</li><li>Press any of the elemental buttons to select that element<ul><li>Water</li><li>Fire</li><li>Thunder</li><li>Air</li></ul></li></ul>\n<ul><li>Make a gun gesture with either hand and pull back your hand to fire an elemental bullet</li><li>Aim using your hands!</li></ul>\n\n<p><strong>Known Bugs</strong></p>\n<ol><li>Animation on the enemy glitches every now and then</li><li>Buttons sometimes don't release to allow you to press them. To combat this, move your head either up or down and press the button to allow Gravity Physics to depress the button</li></ol>\n\n\n<p><strong>Future Development:</strong></p>\n<ol><li>Add audio for the enemy attacking and being struck</li><li>Add tutorial text and audio to explain the instructions better</li><li>Fix the Game Over canvas to display the amount of enemies killed</li></ol>\n\n<p>I welcome any and all criticisms and feedback, as this was an exploration project into new territory and thus, ever since Gestures were deprecated in LeapMotion for Unity, I have had to rely on a 3rd party asset to bring back Gesture control.</p>", "metacritic": null, "released": "2022-05-13", "tba": false, "updated": "2022-05-16T15:43:35", "background_image": "https://media.rawg.io/media/screenshots/fcf/fcfc4cb573918fe7ea6eca1ca7a1354c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midgento"], "genres": ["Action"], "publishers": [], "esrb_rating": null}