{"id": 787597, "slug": "the-valiant-2", "name": "The Valiant", "name_original": "The Valiant", "description": "<p>We are the brave, the Valiant, and the strength of our brotherhood will see us to victory in our quest.<br />\nTHE STORY<br />\nFollow the story of Theoderich von Akenburg, a former crusader knight who, after becoming disillusioned with the cruelty of war, is called back into action by events set into motion 15 years ago when he and his former brother-in-arms, Ulrich von Grevel, stumble upon a fractured piece of an ancient artifact - the Rod of Aaron.<br />\nA young monk named Malcom appears at Theoderich’s doorstep, bringing him news that the Rod contains power never meant for mortals, and Ulrich has become obsessed with finding the remaining pieces and unifying the rod, an event that could bring untold evil and suffering to the world.<br />\nTheoderich takes on the quest of locating the remaining relics to keep them from Ulrich and begins a journey that will lead him across Europe and the Middle East.<br />\nThroughout his journey, he’ll meet many other warriors that decide to rally to the cause, from the old, seasoned Reinhard von Kempten of the Teutonic Order to the ambitious young mercenary Grimhild Eidottr and her Raven Company, each joining for different reasons, but slowly forming bonds that will keep through the trials and tribulations to come.<br />\nGAMEPLAY<br />\nSquad-based RTS with a range of units, from tanky Swordsman to quick cavalry<br />\nSelect hero-squads and auxiliary squads across 15 exciting, hand-crafted Single Player missions, each with custom cinematics, narrated journals, difficulty levels, and more<br />\n5+ Hero Squads each with 3 different skill trees providing players with unique passive and active skills to choose from while leveling up their heroes<br />\nLarge array of weapons and armors to loot and equip throughout the campaign, each with their own stats and special skill options<br />\nCombine hero skills and weapons/equipment for a huge selection of hero builds<br />\nPlay cooperative with friends in the 3-player “Last Man Standing” mode, where you face hordes of enemies and earn experience to level up your knights and unlock new skills and cosmetics<br />\nPlay competitively in multiple pvp game modes that support 1v1 and 2v2, with cosmetic meta-progression and special rewards for ranked play</p>", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-11-01T12:18:53", "background_image": "https://media.rawg.io/media/games/eea/eea68c3bb152cdc87d5085ced943d5cd.jpg", "website": "https://thevaliantgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 8, "toplay": 8}, "playtime": 14, "achievements_count": 32, "ratings_count": 0, "suggestions_count": 551, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kite Games"], "genres": ["RPG", "Strategy"], "publishers": ["THQ Nordic"], "esrb_rating": null}