{"id": 787574, "slug": "hot-liches-in-your-area", "name": "Hot Liches in Your Area", "name_original": "Hot Liches in Your Area", "description": "Hot Liches in Your Area\r\n\n\n<p>Hot Liches In Your Area is a comedic  dating simulator in which the player, taking on the role of the lonely  lich overlord Askarios, attempts to secure a future spouse to co-rule  the Empire of Zyx. Through his (supreme lack of) charisma, out-of-touch  nature, and success rate at various Bejeweled-inspired puzzles, Askarios  is able to achieve differing endings with his chosen paramour,  resulting in either a positive, neutral, or negative path.<br/></p>\n<p>This  demo covers two dates with each of the game's five dateable characters —  Greg \"Mothman\" Mothman, Bellatrix Mnemos, Eyevan Ocular, Myra Limus,  and a secret fifth option — the core of the puzzle gameplay, and fifteen  potential epilogues.\r\n</p>\n\n<p><strong>Story Description:</strong><br/></p>\n<p>Zyx — an empire without border; an empire of ghosts. Long had it stood at the far reaches of the region of Kaz, its diabolic citadels and towering obsidian structures plaguing the natural beauty of the land, standing as edifices of death and subjugation. For centuries did its reach expand, its armies of undeath casting the living to eternal damnation with little difficulty. </p>\n<p>Yet Zyx was weak, for Emperor Xyrik, the last of his bloodline, had grown complacent in his conquest. He had grown careless, and his armies soon stagnated on their advance. Soon, rebellion began, and civil war turned the restless undead against one another. It appeared as if Zyx would have finally fallen, its dominion crumbling with each and every skeletal remain of its military. </p>\n<p>That, however, proved an opportunity. For I, Askarios, Lord of Undeath, Master of Secrets, and All-Powerful (and handsome) Lich Lord of Skentira, staged a coup that overthrew Emperor Xyrik as his focus remained on the encroaching warfront. </p>\n<p>Centuries have since passed, and I, Askarios the Tyrant, continue to rule Zyx absolutely, my rule having never once waned. I once more subjugated those that rebelled against Zyx, culling any who dared attempt to destroy the Empire from within. The dead obey my every command, enslaved to my will, and the living hold such great fear that they cower at the mere mention of my name. My conquest has reached every corner of Kaz, and soon, the world shall know my wrath. </p>\n<p>But there is one issue — I am lonely. The fun in conquest has grown boring, and I find myself in need of someone to share my sadism with. But as it would seem, none can move past their fears of me enough to even attempt courtship! ...Or they are a mindless thrall, but I have standards.  </p>\n<p>As a result, my closest minion, Skully, has set me upon a path of “dating around,” as he refers to it. I have been given the knowledge of a far-off city where many suitable paramours may be located. I shall set forth on this journey of love searching on the morrow. </p>\n<p>Ready thyselves, denizens of Paleon City, for Askarios the Tyrant will soon be gracing your lands!</p>\n\n<p><strong>The Cast:<br/></strong></p>\n<p><strong>The Main Man: Askarios the Tyrant<br/></strong></p>\n\n<p>\"Askarios — Lich Lord of Skentira, Tyrant of Zyx, Master of Undeath... whatever his other titles are today — is the main man here. The boss is a bit lonely in his all-controlling rule, so I looked to get him someone to enjoy some passionate love makin' with. He's just... gotta get over himself, honestly.\"<br/></p>\n\n<p><strong>Date Option #1: Greg \"Mothman\" Mothman<br/></strong></p>\n\n<p>\"Greg’s a bit of a chill guy, y’know? Think we’re catchin’ him out on his vacation, and to me, that means you two could indulge in some sweet, sweet, relaxin’ love makin’. ‘Course, he’s a bit... out there, in terms of personality, but I think you two will get along, assuming you can handle his laid-back demeanor and philosophical thoughts.\"<br/></p>\n\n<p><strong>Date Option #2: Bellatrix Mnemos<br/></strong></p>\n\n<p>\"Bellatrix — screamo enthusiast, airheaded mantis lady, and lover of succulents. Don’t let her thrift shop grandma clothes fool you (she calls it “cottagecore”), she’s a bit of a freak on the downlow. I think there’s some common ground between you two, given that you two both like dark, evil, and dead things, but ya just gotta not let yourself get misled by appearances alone.\"</p>\n\n<p><strong>Date Option #3: Eyevan Ocular<br/></strong></p>\n\n<p>\"Eyevan’s an odd case. The man clearly doesn’t like his job, he’s dismissive of anyone wantin’ to get into his personal space, and he doesn’t like bein’ bothered. Inside, though, I think he’s probably got somethin’ to hide — nothin’ weird or vile, mind you, but... somethin’ endearing. Just... don’t bring up his eye or the bad pun of his name. Shit seems to annoy him.\"<br/></p>\n\n<p><strong>Date Option #4: Myra Limus<br/></strong></p>\n\n<p>\"Myra’s a sweetheart wrapped inside of a slimy, malleable exterior. She may look sad all the time — and believe me, she sure acts like it — but I think she’s just lackin’ in confidence and love. She’s a university student, so she’s probably just stressed out and doubtin’ herself, but that doesn’t mean that she’s unavailable for romancin’!\"</p>\n\n<p><strong>Askarios's Minion: Skully Mortis<br/></strong></p>\n\n<p>\"And then there's me! I found the boss all these dates in Paleon City, and I'm lookin' forward to seein' how it all goes for him... for better or for worse.\"<br/></p>\n<p>\n</p>\n\n<p><strong>Thank you for playing!</strong></p>\n\n<p><strong>Credits:</strong></p>\n<p>- <em>Writing/Narrative Design/Game Design:</em> Nick Novello</p>\n<p> - <em>Character Art:</em> Jude Fry</p>\n<p> - <em>UI Assets:</em> Alexis Mayberry</p>\n<p> - <em>Environment Art:</em> Denice Carrera</p>\n<p> - <em>Sound Design:</em> Zoe Maddix</p>\n<p>- <em>Music:</em> Santana Lee Silcott<br/></p>\n<p> - <em>Programming:</em> Michael Nadasky, Jose Villafranca</p>\n\n\n\n<p>If you wish to download the game, feel free to click below.</p>", "metacritic": null, "released": "2022-04-22", "tba": false, "updated": "2022-05-16T18:03:07", "background_image": "https://media.rawg.io/media/screenshots/8cd/8cd10d2b847dd67d3b2fbb31e0bbc890.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["UghItsMike"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}