{"id": 787643, "slug": "stonegeon-mi-shi-di-lao", "name": "Stonegeon 迷石地牢", "name_original": "Stonegeon 迷石地牢", "description": "In the ancient ruins, a special magic circle leading to the dungeon suddenly appeared one day, and people attracted by the dungeon soon gathered in this ruins. As one of the adventurers attracted to the dungeon, can you survive the battle with the powerful monsters in the dungeon and explore the secrets hidden in the deepest part of the dungeon?<br/><br/>\"Stonegeon\" is a 2D action-adventure game that combines collecting resources, making item and equipment. By collecting map resources that appear in specific dungeon, and collecting materials dropped by monster that appear in specific dungeon, to make new item and equipment, constantly challenge powerful monster in dungeon, and advance to deeper dungeon!<br/><br/><ul><li><h3>Collect Resource</h3></li></ul><br/><br/>Gather herbs, mine ores, cut down trees and other important resources on the map of constantly appearing monsters. Before fighting with monsters, you must first strive to survive in this mysterious dungeon.<br/><br/><ul><li><h3>Fight Monster</h3></li></ul><br/><br/>Monsters that only appear in the dungeon. Fight and defeat various monsters and collect materials that only monsters drop.<br/><br/><ul><li><h3>Make Item and Equipment</h3></li></ul><br/><br/>In order to advance to the deeper dungeon, more powerful item and equipment are required. Use the collected resources and materials to make healing potions, sharp swords and sturdy armor. Of course, better pickaxes can be made to mine ore faster.<br/><br/><ul><li><h3>Challenge Powerful Monster</h3></li></ul><br/><br/>Boss level monster only appear in dungeon with special layer. There is no doubt that the monster with the title of Boss is powerful, only in special layer appear, seemingly to resist the people exploring the dungeon to go deeper.<br/><br/><ul><li><h3>Search Mysterious Treasure Chest</h3></li></ul><br/><br/>A treasure chest that will randomly appear in a room in the dungeon. There are magical rings hidden in treasure chest that can improve the various ability of the character, the deeper that treasure chest appears in the dungeon, the ability of the ring is stronger.", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T06:23:25", "background_image": "https://media.rawg.io/media/screenshots/0e6/0e6dc3d39aa8d1acb65c6f05676a89e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["面包鱼工作室"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["面包鱼工作室"], "esrb_rating": null}