{"id": 787634, "slug": "abyss-protection", "name": "Abyss Protection", "name_original": "Abyss Protection", "description": "<strong>Abyss protection</strong> — is a tower defense game in which you have to defend the lands of your fief from a multitude of enemies who have come from the depths of the abyss, encroaching on your lands! There will be various towers at your disposal to guard the passages to your castle. Build and upgrade your towers. Defend your castle and lands. Survive and fight !!!<br/><br/><ul><li><strong>One castle, one attempt, one world</strong><br/> Defend the last kingdom in one of an infinite number of worlds, or give it to the darkness by trying your strength next time.<br/></li><li><strong>Many variations of towers</strong><br/>From archers and barracks to the magical power of elemental towers. Choose a basic building and develop it to the limit.<br/>Create your own variations of buildings with your own combinations of mechanics.<br/><br/></li><li><strong>3 technology branches</strong><br/>Pick the necessary technologies to protect your lands by opening new improvements and development paths for towers.<br/></li><li><strong>11 unique enemies and [In Development] mysterious mutations</strong><br/>Including ogres, infernal bats, and, of course, a whole herd of ugly goblins.<br/>But be careful, enemies can mutate and adopt the features of other creatures living in the Abyss.<br/></li><li><strong>Campaign</strong><br/>Fight off the minions of the abyss for days and nights, discover the mysterious force responsible for these attacks.<br/>In Development] Get settled taking into account the peculiarities of the world<br/>Your success depends not only on the buildings and combinations of towers, you also have to take into account the variability of changing the behavior of monsters depending on the change of day and night and the effects of the world itself.<br/></li><li><strong>Replayability</strong><br/>Try new towers and their combinations in the endless battle of worlds with hordes of darkness.</li></ul><h3>[In Development] Build your settlement</h3><br/>Build houses and set up food production for the settlers. They will join your kind in this world captured by the abyss in order to survive, live and work in it.<br/><br/>Extract natural and fossil resources using various structures. Upgrade buildings to increase their efficiency.<br/><br/>Don't let the Abyss swallow you up!<h3>Magical effects</h3><br/>Enjoy the graphics! Our artists have drawn a lot of wonderful artwork: beautiful buildings with their own animation, thousands of frames of animation to get the smoothest movements.", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-20T06:11:26", "background_image": "https://media.rawg.io/media/screenshots/839/839bde0c44e768bf7341717671f9a29a.jpg", "website": "https://exbytestudios.ru/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exbyte Studios"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Exbyte Studios"], "esrb_rating": null}