{"id": 787621, "slug": "solitaire-game-christmas", "name": "Solitaire Game Christmas", "name_original": "Solitaire Game Christmas", "description": "The 12 days of Christmas. What do they have in store for you?<br/>\n<br/>\r\nOn the first day of Christmas we gave to you: exciting gameplay! Make chains of cards and remove the golden cards to complete the level!<br/>\n<br/>\r\nOn the second day of Christmas we brought for you: 120 new and unique levels – that's 120 new, original games of solitaire.<br/>\n<br/>\r\nOn the third day of Christmas we got a special gift for you: 12 luxurious Christmas-themed locations!<br/>\n<br/>\r\nOn the fourth day of Christmas we present to you: over 15 hours of gameplay!<br/>\n<br/>\r\nOn the fifth day of Christmas we made for you: two difficulty modes – novice and professional. Choose the one that will make the game comfortable and fun for you.<br/>\n<br/>\r\nOn the sixth day of Christmas we gave to you: premium-quality graphics in a Christmas setting!<br/>\n<br/>\r\nOn the seventh day of Christmas we want you to kick back with Christmas-themed music. Our relaxing tracks won't distract you from the game.<br/>\n<br/>\r\nOn the eighth day of Christmas we got you three in-game bonuses to help you complete levels faster and easier: shuffle, mulligan and the Joker. Find the special bonus cards or buy them in the shop!<br/>\n<br/>\r\nOn the ninth day of Christmas we offer you the chance to get bonus coins by making a 25-card chain!<br/>\n<br/>\r\nOn the tenth day of Christmas, we got a surprise for you: 9 themed card backs with different color sets and Christmas symbols!<br/>\n<br/>\r\nOn the eleventh day of Christmas we got you: three styles of decks – classical, letters and numbers, and a special Christmas style. Choose the one you like most and enjoy playing solitaire!<br/>\n<br/>\r\nOn the twelfth day of Christmas we made you more than 20 special tasks and beautiful winter trophies for fans of excitement.<br/>\n<br/>\r\nThis game is the perfect Christmas present for solitaire fans! Merry Christmas and Happy New Year!", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T05:55:51", "background_image": "https://media.rawg.io/media/screenshots/fd7/fd726ca06aa1e6abcd1b65e7b5cf710d.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creobit"], "genres": ["Casual"], "publishers": ["8Floor"], "esrb_rating": null}