{"id": 787699, "slug": "monuments-flipper-prologue", "name": "Monuments Flipper: Prologue", "name_original": "Monuments Flipper: Prologue", "description": "https://store.steampowered.com/app/1257280/Monuments_Flipper/<br/>https://store.steampowered.com/app/1703180/Handyman_Corporation/<br/><br/><br/><br/><br/>Monuments Flipper: Prologue is just part of the amazing adventure that awaits you in the full version of the game Monuments Flipper. Monuments Flipper: Prologue gives you a unique opportunity to play a few hours of the game before you decide to purchase a full version of Monuments Flipper. Yours adventure  a game in which you play the role of a professional monument renovator. The game not only allows us to experience an amazing story while rebuilding these beautiful monuments, but also learn about their extraordinary stories. Immerse yourself in the world of the world's greatest monuments.<br/><br/><br/>In Monuments Flipper: Prologue you organize, fill and paint. You rebuild collapsed walls, renew old frescoes. Do everything to bring the monument back to its glory days. Skills, proper management and planning will be extremely important in the game. Organize your work in such a way that it is as efficient as possible. Each of these buildings deserves a return to its glory days.<br/><br/><br/>Improve your skills in using various tools, use different materials and renovation will become more efficient and more enjoyable. In the game you will be able to use different materials and tools, each of them will fulfill a different task. Use them wisely so as not to destroy the building. In the game you will gain adequate knowledge about the equipment you use.<br/><br/><br/>Take care of the details when you work. Check the plans for the correctness of your work and make sure that the renovation proceeds in accordance with the project. In the game, you will be able to use projects, thanks to which you will know exactly what to do. Every professional monuments renovator knows how to read plans and organize their work with them.<br/><br/><br/>The last stage is interior furnishings. Make the famous building functional as well. Renovation, the right tools, the use of plans are not all you can count on in the game. Each of these beautiful objects will have to be re-equipped from the inside to make it fully functional.<br/><br/><br/>Ready for the next challenge? The next great monuments are already waiting for your help. Become a professional monument renovator, there is a building waiting for you all over the world that needs your help. Be the best at what you do and you will learn the secrets and history of these amazing buildings.", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2024-03-25T22:43:33", "background_image": "https://media.rawg.io/media/screenshots/768/76825bf1ee578f1657aa529d42bff4ce.jpg", "website": "https://games-i.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 124, "beaten": 2, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 6, "ratings_count": 2, "suggestions_count": 415, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Games Incubator", "Monuments Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Games Incubator"], "esrb_rating": null}