{"id": 787690, "slug": "poker-loafer", "name": "Poker Loafer", "name_original": "Poker Loafer", "description": "As an entertaining and reassuring Blackjack game, Poker Loafer aims to cancel the border between office work and video games. Its game interface will remain fully transparent unless hovered by mouse, and is always windowed and silent. <br/>Blackjack is a classic poker game, in which players try to make their hands reach 21 points without exceeding it. In Poker Loafer, players need to win as much chips as possible in 21 rounds of Blackjack. Optional +10 and -10 decks are provided, +10 decks will make hands easier to bust, and -10 decks harder.<br/><strong>Features:</strong><br/>·efficiently quitting game engagement<br/>·classical strategic poker game<br/>·a nice price<br/><br/><strong><h3>A brand new way to self-hide</h3></strong><br/>Poker Loafer doesn’t miss a chance to hide itself. Once the mouse exit the game’s interface, it turns 100% transparent,until house enter again. Now, exiting and hiding game interface is not only faster and not click-requiring, but also more intuitive and unnoticeable. Drag your mouse, that’s all. You don’t even have to look at your screen.<br/><br/>Once re-enter the game’s interface, the player can continue the game from where it was left without losing game progress. <br/>What’s more, Poker Loafer got itself a less visual-attractive icon and taskbar icon.<br/><br/><br/><br/><br/><strong><h3>AD Shield mode</h3></strong><br/>Enabling the AD Shield mode will make let a picture of advertisement (the “AD Shield”) take over the game interface once mouse exit it, instead of full transparency. The player can move the mouse all over the AD Shield without worrying about showing the game interface; the AD Shield can only be removed by clicking on it. The AD Shield covers up all components of the game interface, including title bar. <br/><br/><br/><strong><h3>Wining high scores</h3></strong><br/>Different from cash games, Poker Loafer ask players to score as high as possible within 21 rounds.", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T07:17:57", "background_image": "https://media.rawg.io/media/screenshots/e2a/e2a61a7a0bffea3655e58c7de4d1a63b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Egg Fried Rice"], "genres": ["Strategy", "Casual"], "publishers": ["Egg Fried Rice"], "esrb_rating": null}