{"id": 787666, "slug": "before-the-kingdom-falls", "name": "Before The Kingdom Falls", "name_original": "Before The Kingdom Falls", "description": "Before The Kingdom Falls is a tower defense RPG that will have you defending against waves of enemies while exploring the map to gain Gold and gain new abilities/weapons.<h3>Game play:</h3><br/>Equipping weapons: You will need to find and locate weapons and shields laying around the fort in order to fight off the attacking monsters.<br/><br/>Gold acquiring: You can acquire gold by defeating monsters using the weapons you find.<br/><br/>Re-spawning: You will need gold to be able to keep re-spawning. Defeat monsters in order to keep coming back.<h3>The Story:</h3><br/>Good day Sir Knight<br/><br/>The kingdom is under siege by the demon king and his armies. Everything seems lost. However the hero is coming and will arrive shortly. You must hold out until they can get to us and defeat the demon king.<br/><br/>Defend the fort for as long as you can. You will face countless enemies day after day. The longer you fight then the more time you will be able to hold out until the hero arrives to save you and the people of the land.<br/><br/><br/><br/>***Disclaimer****<br/>Due to the game being in early access. There will be bugs which will be fixed and new features will be implemented. The early access description of what the game currently holds is accurate. You can join the discord to track the progress of the game if you are interested to see where it is going.", "metacritic": null, "released": "2022-05-17", "tba": false, "updated": "2022-05-20T06:50:48", "background_image": "https://media.rawg.io/media/screenshots/dc7/dc7206d1514e5789b4917cb0f1747bce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FrozenMelter"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["FrozenMelter"], "esrb_rating": null}