{"id": 787633, "slug": "hyperbase", "name": "Hyperbase", "name_original": "Hyperbase", "description": "A series of disappearances of research ships sent to the center of the galaxy leaves the Earth government and scientists in disarray. Sent to investigate, your ship crashes and you find yourself on a mysterious alien base from which no one has ever escaped. Explore the base's perilous inner mazes to uncover ancient secrets, escape from this hellish trap and warn humanity of the impending danger.  <br/><br/>Ahead of you are many randomly generated levels filled with a strange ether gas whose nature and purpose are unknown. Clear the mazes of the ether to earn points and ensure timely detection of dangerous organisms, the number of which is growing rapidly over time! Disable incubators where monsters are born, or close off from them by moving moving blocks to advance to the next level. Each time you make a decision - explore the level thoroughly to find important alien artifacts, make useful discoveries and get bonuses, or escape faster, because with every minute the level space is filled with dangerous creatures.<h3>Key features:</h3><br/><ul><li>More than a hundred randomly generated maze levels, involving different ways of passing.<br/></li><li>A large number of secret artifacts and discoveries, to find all of which will not be enough for one or even two playthroughs of the game.<br/></li><li>Your electronic partner - AI girl Elise will help you explore alien technology, understand what kind of place you are in, and get out of it.<br/></li><li>The fate of the game at later levels depends on how you played and what decisions you made in the earlier stages.</li></ul>", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T06:10:27", "background_image": "https://media.rawg.io/media/screenshots/1d8/1d8b7951fd37240e5f31786a836ee59c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flotsky"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Flotsky"], "esrb_rating": null}