{"id": 787799, "slug": "match-triple-tile", "name": "Match Triple Tile", "name_original": "Match Triple Tile", "description": "Match Triple Tile game is inspired mahjong - zen match game where the rule is to match 3 tiles and clear the board. Enjoy this tile master-classic match game, have a moment of peace all around your day to soothe your thinking and boost your brain. Sharpen your mind with so many different tile matching levels that little by little increase puzzle difficulty.<br/>HOW TO PLAY:<br/>You match tiles to put them into the stack. 3 similar tiles will be matched and removed from the stack.<br/>Once you clear all tiles, you win! Continue your tile connect journey to become a genuine match master one day!<br/>You fail when you can not get at least one merge for limited 7 stacks. Keep in mind that you have a maximum of seven moves.<br/>To get a high score in match master games, you should merge those tiles faster and faster to trigger off the score multiplier.<br/>FEATURES:<br/>◈ Unlimited play<br/>◈ Easy to play with simple rules, addictive gameplay, suitable for all ages.<br/>◈ A lot of styles of cute tiles<br/>◈ Challenging levels, collect more stars, and unlock more rewards<br/>◈ Use 2 helpful boosters to help you beat levels<br/>◈ Play FREE anytime, anywhere<br/>Free matching games classics. Match Triple Tile is the royal match game for adults and the onet 3D game for kids at the same time! The simple triple match tile rules and relaxing gameplay bring relaxing time to anyone.", "metacritic": null, "released": "2022-04-16", "tba": false, "updated": "2022-05-20T09:19:20", "background_image": "https://media.rawg.io/media/screenshots/dc7/dc7b1ee5a3ca2369100d86da37b8a762_tjd07l1.jpg", "website": "http://matchgames.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MATCH GAMES"], "genres": ["Board Games", "Puzzle"], "publishers": ["MATCH GAMES"], "esrb_rating": "Everyone 10+"}