{"id": 78774, "slug": "shanghai-majong", "name": "Shanghai Majong", "name_original": "Shanghai Majong", "description": "Whether you only have a few minutes to spend, or hours, this is a classic Chinese game with simple rules and relaxing gameplay, available on your mobile devices!<br/><br/>The goal is to clear the playing area of tiles by matching pairs. You may only remove a pair of tiles if they both satisfy the following criteria: <br/>- There are no pieces directly to the left or right of the tile you wish to remove. <br/>- There are no pieces directly above any part of it.<br/>You can only remove the tiles one pair at a time.<br/><br/>In addition to being a fun way to pass the time, Mahjong Solitaire is also a great way to support health by developing concentration, improving cognition, increasing memory skills and decreasing anxiety.<br/><br/>This game is also known as Mah Jongg, Mah Jong, Mah-jong, Majong, Mahjongg, Mahjongg, Kyodai, Majiang or Taipei.<br/><br/>FEATURES<br/>- Optimized for mobile devices: clean user interface and large tiles to play.<br/>- Daily challenges: complete new challenges each day.<br/>- Different themes: custom backgrounds and tiles.<br/>- Four difficulties: for beginners to experts.<br/>- A unique random board generator: complete all daily challenges to unlock unlimited gameplay.<br/>- New community group: join our player's community and have fun interacting with current members.<br/>- No interference with music player: listen to your favorite songs while playing.<br/><br/>Feedback? Suggestions? Issues? Please contact us at helpdesk@redstonegames.mobi or from within the app itself. Your feedback is valuable to us, ​and we’ll do our best to assist you.", "metacritic": null, "released": "2017-04-07", "tba": false, "updated": "2019-07-30T04:42:29", "background_image": "https://media.rawg.io/media/screenshots/aac/aaca5389daa42032f88be091d8d812a9.jpg", "website": "http://www.redstonegames.mobi/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Redstone Games"], "genres": ["Board Games", "Card"], "publishers": ["REDSTONE GAMES LTDA - ME"], "esrb_rating": "Everyone 10+"}