{"id": 787791, "slug": "octopus-robot-car-game-3d-war", "name": "Octopus Robot Car Game 3D- War", "name_original": "Octopus Robot Car Game 3D- War", "description": "Get this robot game with multiple robot transformations. Do you want to enjoy modern robot wars with big battle machines? You should definitely try this robot war game. <br/>Action, adventure and thrill; this game will never disappoint you. A vast selection of robot warriors in different battle modes will boost your playing experience.<br/><br/>Mode Selection:<br/><br/>You can select any war mode of four:<br/>1. Career Mode<br/>2. Racing Mode<br/>3. Survival Mode<br/>And<br/>4. Gun Game Mode<br/><br/>Robot Selection:<br/><br/>There are variety of robots with multiple robot transformations, you can choose your battle machines.<br/><br/>Landing Gears:<br/><br/>The way you enter in the battlefield is most thrilling factor. Here we offer multiple landing gears, battle staff carriers and parachutes to jump into city of warriors.<br/><br/>Missions and Storyline:<br/><br/>Enemy robots have taken full control over the city from buildings to vehicles roaming around, everything is programmed to follow their rules. You need to destroy the complete setup of alien robots and rebuild the whole world again.<br/><br/>Note:<br/>-\tYou can get indicators on map to find enemies location.<br/>-\tYou can transform into monster truck, car and octopus anytime during the mission.<br/>-\tGet more coins and unlock new items.<br/><br/>Support:<br/>Minorbugs2021@gmail.com", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-05-20T09:12:19", "background_image": "https://media.rawg.io/media/screenshots/f46/f467536d5770ffa962165f30f76c251a_2tq0h0i.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MINOR BUGS"], "genres": ["Adventure", "RPG"], "publishers": ["MINOR BUGS"], "esrb_rating": "Teen"}