{"id": 787777, "slug": "syberia-20th-anniversary-bundle", "name": "Syberia: 20th Anniversary Bundle", "name_original": "Syberia: 20th Anniversary Bundle", "description": "<p>We&#39;re celebrating 20 years of Syberia with a special offer!<br />\nBuy all four Syberia Games, including the brand new Syberia - The World Before - for a limited time, you can get the four games for a bargain price.<br />\nSyberia: 20th Anniversary Bundle includes:<br />\nSyberia<br />\nKate Walker, a young ambitious lawyer from New York, is handed what seems to be a fairly straightforward assignment. Just a quick stopover to handle the sale of an old automaton factory hidden in the alpine valleys, then straight back home to New York. Little did she imagine, when embarking on this task, that her life would be turned upside down.<br />\nSyberia II<br />\nHaving searched Eastern and Western Europe for a missing heir, Kate Walker finally completed her long and arduous journey. Mission accomplished? Perhaps, but not for her... Kate and her eccentric companion face obstacles far more dangerous than ever before, testing their courage and determination. Far and beyond, a mystical Syberia awaits their arrival.<br />\nSyberia 3: The Complete Journey<br />\nKate is found dying on the edge of a river by the Youkole tribe, a nomadic people migrating with their snow ostriches. Stuck in Valsembor village, together they must find a way to continue their journey in a race against their enemies and unexpected obstacles, not to mention Kate&#39;s past, which catches up with her.<br />\nSyberia: The World Before<br />\nSet off on an adventure across continents and through time. Play as both Kate Walker and Dana Roze as you get to the bottom of mysteries that have remained buried for too long. Explore the fantastic and poetic world of Benoît Sokal, with its breathtaking sceneries and iconic characters. Solve complicated puzzles and riddles in keeping with the tradition of the saga.<br />\nLanguages, features and system requirements may vary between games - please check individual product pages for details.</p>", "metacritic": null, "released": "2023-01-01", "tba": false, "updated": "2023-03-22T08:33:58", "background_image": "https://media.rawg.io/media/games/25e/25e06e4b67477bef153a9d81de8d49d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 633, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Microids", "Microids Studio Paris"], "genres": ["Adventure"], "publishers": ["Microids"], "esrb_rating": "Teen"}