{"id": 787806, "slug": "skip-solitaire-win-real-cash", "name": "Skip Solitaire: Win Real Cash", "name_original": "Skip Solitaire: Win Real Cash", "description": "Welcome to Skip Solitaire! This is a brand new fun-filled, exciting card game in which players use strategies to play out your stock card piles.<br/><br/>GAME RULES:<br/>The deck consists of 162 cards, which comprises of cards with numbers 1 through 12 and WILD cards, which may be played as any number.<br/>Each player is dealt 10 cards for their pile with the top card visible, and a hand of five cards. The remaining cards are placed face down to create a common draw pile. The main play area allows up to four build piles, which must be started using either a ‘1’ card or a ‘WILD’ card.<br/>Each player also has up to four personal discard piles. Each turn the active player draws until they have five cards in hand. They must play either the next card in sequential order or a wild Skip Boss card, using either cards in hand, the top card of their Stock pile, or the top card of any of their four discard piles. If the player can play all five cards from their hand, they draw five more and continue playing. When no more moves are available, the player discards one card to either an empty discard pile or on top of an existing one and play passes to the next player. When a build pile reaches 12, it is removed from the board and that space becomes empty for another pile to be started. The game thus continues until one player has played their final card.<br/><br/>GAME FEATURES:<br/>• Play with no distracting ads.<br/>• Head to head game playing, both players solve the same deck and the player who finishes with the most points wins.<br/>• Large and multiplayer tournaments.<br/>• Win cash and real-life prizes. <br/>• 100% safe and secure withdrawal via PayPal.<br/><br/>If you have any questions feel free to reach us at dailypuzzle@hotmail.com<br/>If you have any questions about the Skillz® system or cash tournaments please contact: support@skillz.com", "metacritic": null, "released": "2022-02-16", "tba": false, "updated": "2022-05-20T09:25:27", "background_image": "https://media.rawg.io/media/screenshots/db0/db082f5912e694c90a79da24142bc5d0_SllLQuf.jpg", "website": "https://www.mygoldenwood.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["puzzle games for free"], "genres": ["Board Games", "Card"], "publishers": ["Golden Wood Co"], "esrb_rating": "Mature"}