{"id": 787881, "slug": "fitness-club-tycoon-idle-game", "name": "Fitness Club Tycoon-Idle Game", "name_original": "Fitness Club Tycoon-Idle Game", "description": "Boss, your gym is overcrowded, so come build a unique luxury gym!<br/><br/>\"Slimming Club\" is a casual simulation game with exquisite graphics. In the game, you will play the role of a slimming club's boss, annd run slimming boot camps, help customers who need to slim down exercise to lose weight and help them regain their perfect figure. As the boss, your task is to set up a team of excellent trainers, turn this place into a first-class gym and launch a chain full of stores all over the world! (oﾟ▽ﾟ)<br/><br/>========Game Highlight========<br/><br/>•Build your very own gym<br/>Huge map scenarios where you're free to expand anywhere! Like the Hawaiian style beach theme? Or do you prefer the forest theme of the Amazon rainforest? Or do you want to cover the outside of your gym with super cool rides? All you need to do is flick your fingers and it'll be right in front of you without having to wait!<br/>•Immersive Realistic Gym Experience<br/>There are treadmills, battle ropes, swimming, calisthenics, boxing and a wealth of other sports, each with a unique and interesting visual animations. Watch the guests working out hard in each gym and feel the fat burning!! You'll even move along with the poses of the customers to the upbeat music!<br/><br/>•Recruit employees with unique personalities.<br/>Have you ever seen a tricky employee who comes to work with a bombastic hairdo? Ever seen an NBA player come out of retirement to teach you how to train with a battle rope? A chef who comes to apply for a job in order to lose weight, whom you even have to watch out for him sneaking out the food prepared for the customers! But our professional trainers will keep an eye on those lazy customers for you, so you just need to enjoy the beauty of it all in front of your screen!<br/>•Fun interaction with customers<br/>They need to be pushed during the weight loss process! Quickly encourage those customers who want to give up halfway and keep them going. In the end, your customers will successfully slim down, have a noticeable change in their bodies, and become handsome and beautiful while having better health. Also, when exercising they need energy! Don't forget to provide them with food, drinks, and even leisure services such as spa and private cinema, they will love it here and you will be one step closer to global fame!<br/><br/>Whichever of the following players you are, be sure to download and play!<br/>•Fitness enthusiasts who often go to the gym<br/>•Handsome men and women who want to slim down and have a perfect body<br/>•Newcomers to fitness who want to lose weight and love restaurant food<br/>•Casual players who want to play anytime, anywhere and collect idle earnings<br/>•People who are looking for a idle or simulation game worth their time<br/>•Management professionals who enjoy building and tapping to upgrade in simulation games<br/><br/>========Follow Us========<br/>Join our FB fan club now and get the latest news, first-hand!<br/>※Official Fan Group:https://www.facebook.com/Fitness-Club-Tycoon-102604252431754<br/>※Official Email:hotgamesteam.hw@gmail.com", "metacritic": null, "released": "2022-04-22", "tba": false, "updated": "2022-05-20T10:37:19", "background_image": "https://media.rawg.io/media/screenshots/ec6/ec6aafbd17094bcac6f2faa3cfb10081_wt6dGKf.jpg", "website": "https://fableyjg.github.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["武汉哈乐沃德网络科技有限公司"], "genres": ["Simulation", "Casual"], "publishers": ["Wuhan Hello World Network Technology Co"], "esrb_rating": "Everyone 10+"}