{"id": 7878, "slug": "aviation-empire-platinum", "name": "Aviation Empire Platinum", "name_original": "Aviation Empire Platinum", "description": "Do you have the business instincts to conquer the globe and build an aviation empire? Well now you can soar to success with our new strategic airline game: Aviation Empire Platinum.<br/><br/>Starting back in 1919, the historical year that KLM Royal Dutch Airlines launched their first flight, it is your mission to build, invest in and connect destinations across the world. Each time period takes you to new phases of airline history – with technological and structural advances that help to improve your infrastructure.<br/><br/>Create your very own airline by choosing your destinations, investing in aircrafts and designing your airports. Keep your aircrafts in good condition and your customers happy by figuring out the most popular connections and increasing the luxury of your airports.<br/><br/>Can you make it to the present day with a caring and innovative airline? It’s time to take to the skies.<br/><br/>Key features:<br/>- Develop your own flight paths, creating connections all around the world.<br/>- Invest in the landing rights to 145 cities across the globe.<br/>- As the world develops, so can your airline with bigger and faster aircrafts.<br/>- Upgrade your airports to make them more luxurious for passengers: hotels, theme parks, shopping centres and so much more!<br/>- Examine the useful statistics board to become a superior CEO.<br/>- Log in with Facebook, Twitter or Google+ for social features and other advantages.<br/>- Check-in at a real life airport to unlock the destination in-game!<br/><br/>CONNECT WITH US<br/>Facebook: https://www.facebook.com/aviation.empire<br/>Twitter: https://twitter.com/All_4_Games<br/>YouTube: https://www.youtube.com/channel/UCZM264rqhBWtPdCTY8691jQ<br/> <br/>* Please note – the game is free to play, however some items can also be purchased for real money, and there is no restriction on the amount of purchases that can be made. If you don’t want to use this feature, please disable in-app purchases in your device’s settings.<br/>**This game does not support iPhone 4S, iPad 3, iPod Touch 5th Generation or earlier devices **<br/> <br/>In order to deliver a personalised, responsive service and to improve the game, we remember and store information about how you use it. The information is completely anonymous and will never include any personal details. It is used only by Channel 4 or the trusted partners we work with. If you wish, you can switch off our analytics software within the “Options” screen of the game. The game contains promotions for Channel 4’s other products and services as well as some promotions of third party products and services. By downloading this application, you agree to our terms of use (http://www.channel4.com/programmes/all-4-games/articles/all/game-terms-and-conditions), privacy policy and cookies policy.", "metacritic": null, "released": "2017-01-23", "tba": false, "updated": "2019-10-22T14:29:35", "background_image": "https://media.rawg.io/media/screenshots/e56/e5651525ceb5d90ee96d12fd04f36ea5_ovchi80.jpg", "website": "https://game.klm.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Channel 4", "Channel 4 Television"], "genres": ["Strategy", "Simulation"], "publishers": ["Channel 4"], "esrb_rating": null}