{"id": 787864, "slug": "soccer-city-club-manager", "name": "Soccer City - Club Manager", "name_original": "Soccer City - Club Manager", "description": "you can have your own soccer club with a team of players you always loved.<br/><br/>You are the manager.<br/><br/>Build your team, adjust team tactics, adjust formations and compete with other clubs. . .<br/><br/>*** The match is completely simulated to be a real coaching experience, so be careful about the players, formations and team tactics in the game. If you win, you earn money from sponsors and fans.<br/><br/>Features:<br/><br/>- Build your soccer team with the best players<br/>- Form an alliance with friends<br/>- Public &amp; alliance online chat inside the game<br/>- Compete with other users' teams in fully simulated football matches<br/>- buy players in transfer market<br/>- play online in different soccer leagues and try to win prizes<br/>- sell players on the bench<br/>- Coaching and determining team formations, tactics, etc. before the start of the match<br/>- manage a ticket office, sports equipment store, fast food, etc. next to the stadium<br/>- Train players to increase their power in various fields<br/>- Recover players to regain energy lost during matches<br/>- Upgrade existing buildings in the city<br/>- Make Money From Stadium Revenue Businesses<br/>- Choose a sponsor to financially support your club<br/>- Earn money through sponsorship ads and contracts with FIFA at your stadium<br/>- Accurate and intelligent transfer system with search capability available between players", "metacritic": null, "released": "2022-03-09", "tba": false, "updated": "2022-05-20T10:21:12", "background_image": "https://media.rawg.io/media/screenshots/941/94116e41b9da09614cc9938055bbb0d4_iAY9DBP.jpg", "website": "https://nesedijital.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["NESE DiJiTAL"], "genres": ["Simulation", "Sports"], "publishers": ["NESE DIJITAL BILISIM YAZILIM SANAYI VE TICARET LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}