{"id": 787879, "slug": "motorcycle-bike-car-driving-2", "name": "Motorcycle Bike Car Driving 2", "name_original": "Motorcycle Bike Car Driving 2", "description": "Morotorcycle Simulator 2022 Byke Game<br/><br/>VARIOUS MODES<br/>There are many modes you can chose from. Be the first rider reaching the finish lines or reach finish line before time runs out. Shift your engine into extreme driving and eliminate the other behind rider. You can even drive whatever motorcycle you like to race and jump into the free mode, where you can complete missions and claim your rewards. You can also drift on the street for bonus. Various modes make this racing 3d a fun game.<br/>SHOW YOUR STYLE<br/>As you play these driving games, you will receive plenty of rewards including coins. You can use coins to make the cool motorbikes yours. Expand your collections and appreciate them from all angles. Upgrade your motorcycle for extreme driving or for handling. You can even make a drift and cross through the traffic. Once you buy the motorcycle from the showroom, you have the access to modify it in your ways with different spray paint, wheel hub and sticker. Trick out as you wish in bike racing games and show your personality as a rider.<br/>MUTIPLE CHARACTERS, DIFFERENT SKILLS<br/><br/> Become the best of the absolute best and be the moto bike king in this stunning furious city moto bike racer simulator.<br/><br/>Main Features:<br/><br/>- Realistic physics, simulating every aspect of motorbike behavior<br/>- Drive more than 20 powerful and exciting, highly detailed sport motorbikes<br/>- Customize your motorbikes with exclusive paint jobs and rims<br/>- Realistic engine sounds<br/>- Turbocharger, gearbox and tires sounds<br/>- Realistic 3D graphics<br/>- Drift slow motion<br/>- Change your rider and passenger<br/>- Stunning speed city moto vehicles to collect and unlock<br/>-  Motorcycle games with a twist that will rock your world<br/>-  Many hours of city driver challenges<br/>- Other motorcycle racing games will follow shortly<br/><br/>Street Drag Racing: Car Multiplayer online - is ad supported, and completely free to download.<br/>PREMIUM MEMBERSHIP SUBSCRIPTION:\u2028Here's what you're getting with the Premium Subscription:<br/>\u2028- 1 Motorcycle\u2028<br/>- Remove Ads<br/>\u2028- 150 gems weekly\u2028<br/>- 50,000 coins weekly<br/>Premium subscription is provided on a weekly basis.\u2028The cost of subscription in the amount of (4.99 USD) will be charged to your account at confirmation of purchase.\u2028Your account will be charged for renewal of your subscription automatically within 24 hours after your current subscription expires.\u2028You can turn off auto-renewal by going to your iTunes account at least 24 hours before the end of the current period.<br/>Terms of use: https://alunsud.site/terms.html<br/>Privacy policy: https://alunsud.site/privacy.html", "metacritic": null, "released": "2022-02-04", "tba": false, "updated": "2022-05-20T10:35:27", "background_image": "https://media.rawg.io/media/screenshots/448/448831057744b531ea43e2f5a485befb.jpg", "website": "https://alunsud.site", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Olga Cucu"], "genres": ["Simulation", "Racing"], "publishers": ["Olga Cucu"], "esrb_rating": "Everyone 10+"}