{"id": 787865, "slug": "offorad-monster-truck-driving", "name": "Offorad Monster Truck Driving", "name_original": "Offorad Monster Truck Driving", "description": "Do you love Limitless speed, tuning and offroad driving adventure? You are at right place Monster Truck: Lets Go Offroad offers you to get behind the amazing four wheeler monster truck to test your driving skills. Drive and Chase the car rivals by driving extreme jeep in spectacular environment and unlock amazing terrain car racing vehicles. Jump over extreme ramps that will polish your insane speeds off car racing skills and just go for massive aerial stunts. Barrel through tricky trial like turbo champion by escaping intense climbing on twisting heights, rocky paths with futuristic hotwheels mmx driving simulator. <br/><br/><br/><br/>The Monster Truck: Lets Go Offroad will challenge you to show your skilled racing by performing crazy stunts on climb the highest mountains with super muscle cars. This endless  offroad mega car racing is specially designed to thrill you through twisty Tracks for unlimited racing mania within precious milliseconds. Adjust your nitro button gearbox for breathtaking Monster truck race to perform like amazing car racer. Get into Stunt Car driving Simulator at impossible tracks to show who’s the boss of csr racing mania. Get ready! Drive your rage on the dash hills of amazing open world. The race starts now! <br/><br/><br/>Have you ever wished to participate in off road Top Speed drag racing genre? The new open world off-road driving simulator is here with Monster Truck: Lets Go Offroad. Fasten your seatbelt put yr monster mayhem truck simulator on mid-air ramps and explore the amazing mountains rocky paths to Beat challengers.  Earn money and upgrade your csr car. Make it stronger, faster, look more a level up to drive anywhere and get cool rewards. <br/><br/>Try to be fast to beat the Checkpoint Hunt challenges, use your off-roading skills to reach checkpoints in Pathfinder challenges. Find and transport the required materials for Transport challenges! Prepare yourself for this next level top gear adventurous speed racer challenging tracks and enjoy unlimited racing drive with Monster Truck: Lets Go Offroad.<br/><br/>Game Features:<br/><br/><br/><br/>Explore beautiful Environment<br/>Multiple offroad cars to unlock <br/>Exciting challenges to beat &amp; Climb hills<br/>Extreme Monster truck driving simulation <br/>High Quality sounds and Different camera.<br/>Smooth controls &amp; immersive Sounds<br/>Unique gameplay", "metacritic": null, "released": "2018-09-13", "tba": false, "updated": "2022-05-20T10:22:20", "background_image": "https://media.rawg.io/media/screenshots/d2b/d2b8f97f7be5ebfd462601e91452d3ae_xmKwZBn.jpg", "website": "http://metadort.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meta Dort"], "genres": ["Simulation", "Racing"], "publishers": ["Meta Dort"], "esrb_rating": "Everyone 10+"}