{"id": 787899, "slug": "fashionista", "name": "Fashionista!", "name_original": "Fashionista!", "description": "Eat, sleep, manage, repeat! If this is your motto this game is for you! Expand your reach buy new stores and items to establish your dynasty on the mall! Manage your stores and be the best manager in town!<br/><br/>Start your business and make money selling all kinds of wigs to your customers. People love your style, so you will gain profits very fast! Be the most fashionable in the mall, or better yet the town! Start selling wigs and make your way to hats and glasses. Sky is the limit! Make people beautiful and make them shine. Expand your shops through the mall and make people shop until they fall. Every sale counts as well as every smiling customer. Create fashionistas all around the town!<br/><br/>After you earn enough money, you can start expanding your store, create and sell better products and increase your profits even more.<br/><br/>Don't forget to hire some assistans to help you on your job because you won't be able to reach and serve all the needs by yourself, there are TONS of people want to purchase your awesome hair, wig, hat and glasses products!<br/><br/>Be the fashionista!<br/><br/>Key features:<br/>- Beautiful art style and models,<br/>- Crisp animations, smooth graphics,<br/>- Easy gameplay with easier mechanics,<br/>- Hundreds of different content,<br/>- Lots of unlocks and progression options, <br/>- Endless FUN!", "metacritic": null, "released": "2022-04-13", "tba": false, "updated": "2022-05-20T10:54:29", "background_image": "https://media.rawg.io/media/screenshots/b48/b48143602d66b5a48a36b014f094b583_mNQ68F2.jpg", "website": "https://rollicgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tolga Coskun"], "genres": ["RPG", "Casual"], "publishers": ["Tolga Coskun"], "esrb_rating": "Everyone 10+"}