{"id": 787808, "slug": "piano-beat-edm-music-rhythm", "name": "Piano Beat: EDM Music & Rhythm", "name_original": "Piano Beat: EDM Music & Rhythm", "description": "Love piano tiles game &amp; EDM Music ? Play Piano Beat and get addicted popular songs!<br/><br/>How to Play:<br/>Similar to other music tiles games, press the tiles continuously to follow the music and don't miss any tile. Fast and accurate you can play!<br/><br/>Game features:<br/>. Play EDM songs with vocal - update weekly.<br/>. Upload custom songs on your phone.<br/>. Cool piano tile styles.<br/>. Daily rewards and lucky wheel.<br/>. Save progress by login facebook for another devices.<br/>. Compare scores with friends and top players.<br/>. Easy to play but hard to master.<br/><br/>If any producer or label has an issue with any of the music used in the game, please send email to us and it will be deleted immediately if necessary.<br/><br/>***VIP SUBSCRIPTION***<br/>- You can subscribe for 100+ premium songs and upcoming songs.<br/>- The subscriptions are $1.49 weekly<br/>- You'll be able to play all premium songs for the duration of your subscription*.<br/>- Payment will be charged to iTunes Account at confirmation of purchase.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>- Account will be charged for renewal within 24-hours prior to the end of the current period at the cost of the chosen package.<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.<br/>- No cancellation of the current subscription is allowed during active subscription period.<br/><br/>Terms of use: https://sites.google.com/view/wingsmob/term-of-service<br/>Privacy Policy: https://sites.google.com/view/wingsmob/privacy-policy<br/><br/>*Support:<br/>Are you having any problems? Send the email to wingsmob@outlook.com", "metacritic": null, "released": "2021-09-24", "tba": false, "updated": "2022-05-20T09:27:23", "background_image": "https://media.rawg.io/media/screenshots/c91/c9198f84169d8ea0bc9b0a749adb86fc_fAvFGLb.jpg", "website": "https://games.wingsmob.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Richard Liu"], "genres": ["Casual"], "publishers": ["Richard Liu"], "esrb_rating": "Everyone 10+"}