{"id": 787886, "slug": "pool-blitz-win-cash", "name": "Pool Blitz - Win Cash", "name_original": "Pool Blitz - Win Cash", "description": "Play Pool Blitz Game - The gaming competition app where you win real money by playing Pool. Why not having fun playing Pool and win prizes at the same time? Try it out today!<br/><br/>Win prizes by playing Pool games against opponents at the same level! Users are matched with other same level players, so everyone gets its chance to win! Our games are totally fair and only skill-based.<br/><br/>Play against only real players, no bots are allowed.<br/><br/>POOL BLITZ FEATURES<br/><br/>- Get unlimited gaming for free<br/>- Train with practice mode. Pool Blitz lets you play games in practice mode! Get trained before playing real cash games :)<br/>- Win trophies and get to the top of the leaderboard<br/>- League<br/>- Spin &amp; Go<br/>- Choose among a variety of gameplay<br/>- Get daily rewards and bonus.<br/>- Enjoy daily challenges and win rewards!<br/>- Wheel spins for fun and win prizes / coins!<br/>- Paypal deposits<br/>- VIP program and perks<br/>- And many more!<br/><br/>Pool Blitz - Win Cash is FREE to download and play!<br/><br/>CASH GAMES<br/><br/>Please note that Cash competitions are only available in the following US States: District of Columbia, Alabama, Alaska, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming.<br/>If you don't live a region where cash game are enabled you can still play for free.<br/><br/>FEEDBACK &amp; SUPPORT<br/><br/>- If you like Pool Blitz, don't hesitate to rate us on the App Store.<br/>- If you have any question, feedback or any suggestion feel free to contact us at poolsupport@blitz-app.io<br/><br/>Thanks for playing Pool Blitz!", "metacritic": null, "released": "2022-05-09", "tba": false, "updated": "2022-05-20T10:41:32", "background_image": "https://media.rawg.io/media/screenshots/188/18825304f2d2d7304148843ef0450a6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["VLB"], "genres": ["Sports", "Casual"], "publishers": ["VLB"], "esrb_rating": "Mature"}