{"id": 787807, "slug": "ultimate-hearts-card-game", "name": "Ultimate Hearts: Card Game", "name_original": "Ultimate Hearts: Card Game", "description": "Enjoy the world’s favorite classic card game: Hearts! This deluxe experience is the best available on mobile. Just make sure to avoid the Queen of Spades!<br/><br/>Unlike Spades, the lowest score wins! Avoid collecting Hearts and the dreaded Queen of Spades to beat your computer friends. Think you're ready for a challenge? Take on our premium and deluxe computer opponents.<br/><br/>Clubs, Diamonds, Hearts, or spades! Use the correct card. Hearts, while not a trump card, give one penalty point each, hence the game's most common name \"Hearts\".<br/><br/>It’s easy to play with large, clear Hoyle cards, a beautiful interface with no banner ads, plus challenging computer players. It’s Hearts, the classic card game, as the most deluxe experience on phone and tablet for free.<br/><br/>Hearts is the perfect classic card game for those who play Spades &amp; Euchre online or offline with their friends. Uno &amp; Gin Rummy are also beloved by Hearts players!<br/><br/>If you already play baccarat, Canasta, Pinochle, Backgammon, Gin Rummy 500, or Solitaire, then you'll love this classic card &amp; board game. Learn to play free Hearts “live” in a game with great hints. Friends will call you a Hearts pro in no time!<br/><br/>Make a friendly game and convince your friends to play all together against AI. Time for a free Hearts trick-taking game.<br/><br/>Unlike poker or blackjack casino games, Hearts Plus is a game for the whole family, from the youngest to the oldest can play. Just like Spades! Take into account the value of each card, and the value of each combination to win the match. Follow our tutorial to understand the rules and the different mode games. Enjoy the best card game ever! Free Hearts (Black Lady) time!<br/><br/>Hearts is a game from the specialists at Wildcard Games who make free card table games. Trust in our extensive experience in this type of games for a unique experience! If you like pvp cards game, try this free Hearts game, a classic card game. Plus, you can also play the board game Cribbage free!", "metacritic": null, "released": "2022-04-19", "tba": false, "updated": "2022-05-20T09:26:24", "background_image": "https://media.rawg.io/media/screenshots/49e/49ee752bec2fc92d5dc6dee01df999f8_y2KeEJN.jpg", "website": "https://wildcardmobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WildCard Games"], "genres": ["Board Games", "Card"], "publishers": ["WildCard Games"], "esrb_rating": "Everyone 10+"}