{"id": 787861, "slug": "color-painting-color-by-number", "name": "Color Painting-Color By Number", "name_original": "Color Painting-Color By Number", "description": "Color Painting, also known as color by number, paint by number, coloring book and picture coloring, is your best way to de-stress and relax! A free color by number game with 10000+ coloring pictures, try it and color your own artwork! <br/><br/>It‘s not only a happy color game, but also a beautiful coloring book, with a great number of artworks categories that can be easily accessible and intuitive controlled. You can paint by number with just one hand! At home, on the way, anywhere, open the game and enter the world of coloring for an extremely relaxing experience.<br/><br/>Find new artworks and color over 20 popular categories:<br/>Girls/Fantasy / Animals / Cottage/ Travel/ Flowers/ Heart /Mandalas /Interior /Water Color / Oil /Nature / Princess / Holiday / Glitters / Portrait/ Illustration / Food / Kids<br/>…and many more!!<br/><br/>We are committed to providing players with the best coloring experience.Check out these powerful features:<br/>- Easily to paint by number: Just tap to color in the order of the numbers.<br/>- Every picture is a masterpiece：Masterpieces to ensure a pleasant coloring experience.<br/>- New artworks added daily: Every day there are different pictures to give you different feelings.<br/>- Smooth interface: Smooth experience and gorgeous animation.<br/><br/>Subscription pricing and terms：<br/>In Color Painting we offer you the following two subscription options:<br/>1. A weekly subscription costing $4.89 (or equivalent in your currency) per week.<br/>2. A monthly subscription costing $9.99 (or equivalent in your currency) per month.<br/>2. A monthly subscription costing $69.99 (or equivalent in your currency) per year after a 3-day free trial period.<br/>After buying  the subscriptions, you will remove the non-optional banner and interstitial adverts from the game. In addition, you'll get unlimited hints and unlimited buckets, and remove watermarks from all completed pictures.<br/><br/>Download Color Painting now and become an artist! Color by number any time and anywhere! Find a sense of accomplishment in the best coloring game ever! <br/><br/>Terms of Service and Privacy Policy please go to the following link:<br/>Terms of Use:<br/>https://firedragongame.com/doc/color-painting/user-agreement.html<br/>Privacy Policy:<br/>https://firedragongame.com/doc/color-painting/privacy.html<br/><br/>If you have any questions or concerns, please do not hesitate to contact us:<br/>mintgames@gmail.com", "metacritic": null, "released": "2022-03-12", "tba": false, "updated": "2022-05-20T10:18:44", "background_image": "https://media.rawg.io/media/screenshots/21b/21b702b3121f9019fe9cd47a7793a61a.jpg", "website": "https://www.firedragongame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["games mint"], "genres": ["Board Games", "Casual"], "publishers": ["games mint"], "esrb_rating": "Mature"}