{"id": 787802, "slug": "easy-color-by-number", "name": "Easy Color by Number", "name_original": "Easy Color by Number", "description": "Easy Color, is a color by number app with breathtaking and unique artworks: animals, landscapes, flowers, mandala... So many inspiring pictures you can start coloring right now! <br/><br/>Need a break? Come and relax with our awesome coloring book! <br/><br/>Painting by number has never been easier: choose the drawing you like and start your coloring experience. All the zones are marked by numbers, complete a first one, then another, and the next thing you know, you’ve completed a beautiful artwork, congratulations! It’s so easy and satisfying. <br/><br/>Come and discover the coloring pages our artists made for you! We spent months doing research on exactly what makes coloring by number so great, satisfying and relaxing! Also, all our pictures are drawn by professional artists.<br/><br/>Want to share your drawings to your friends and family? Well of course you can! After you complete your drawing, you can download the image or the accelerated gif of your drawing and send it to whoever you want!<br/><br/>Want to share your feedbacks with us, suggest some upgrades or new ideas of drawings, or maybe just say hello? Send us an e-mail at support-color-number@mwm-apps.com.<br/><br/>Read more about our terms and conditions here:<br/><br/>Terms of service: https://musicworldmedia.com/products/easycolor/tos<br/><br/>Privacy policy : https://musicworldmedia.com/products/easycolor/policies", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-05-20T09:21:50", "background_image": "https://media.rawg.io/media/screenshots/092/09224be022100f00f99f6891cdf1cec7_3WwGsNi.jpg", "website": "https://musicworldmedia.com/products/easycolor/tos", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MWM"], "genres": ["Board Games"], "publishers": ["MWM"], "esrb_rating": "Everyone 10+"}