{"id": 787920, "slug": "ragdoll-fall-break-the-bones", "name": "Ragdoll Fall: Break the Bones!", "name_original": "Ragdoll Fall: Break the Bones!", "description": "Want to relax after a hard day’s work? Ragdoll Fall dismount is made for you! In this stress relief game, your task is to make the buddy break all the bones falling from the high buildings under construction! Bash and bounce from construction cranes, beams, floors, and other surfaces to break the dummy’s bones even harder!<br/><br/>Break as many bones as you can to reach the highest score, get game points, and open new skins for your ragdoll guy ! Play the falling simulation game, beat new records and open new cool costumes to make your ragdoll dismount fall like a star!<br/><br/>Why you’ll love this torture game:<br/><br/>- Fun breaking bones' dismount gameplay: push the ragdoll buddy down from the highest building for maximum damage! Experience somersaults and barrel rolls in convincingly accurate 3D physics simulation!<br/>- Turbo dismount experience: the most convincing personal impact simulation seen on mobile devices!<br/>- Bright stylized 3D graphics and sounds: the crunchiest graphics and sound effects ever had in a digital entertainment product<br/>- Many challenging levels: play the falling game, beat new records and open new cool costumes to make your ragdoll dismount fall like a star!<br/>- Relaxing experience: push the ragdoll buddy, break all the bones he has and lay one of the best stress relief games!<br/><br/>Are you ready for the turbo dismount? Let the dummy fall and watch him break the bones! Download Ragdoll Fall right now and play one of the best stress relief games!", "metacritic": null, "released": "2022-04-18", "tba": false, "updated": "2022-05-20T11:13:14", "background_image": "https://media.rawg.io/media/screenshots/a3a/a3a2eeb52cf328c37e05f678f70ca994.jpg", "website": "https://aigames.ae", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["AI GAMES FZ"], "genres": ["Action", "Simulation"], "publishers": ["AI GAMES FZ"], "esrb_rating": "Teen"}