{"id": 787946, "slug": "redeal-solitaire", "name": "Redeal Solitaire", "name_original": "Redeal Solitaire", "description": "Redeal is a compendium of 50 solitaire games presented using superb 3-dimensional graphics and realistic card motion. <br/><br/>Use/take your own photos for the table, the background or the card backs!<br/><br/>Play against your friends with the same shuffle of cards, using barcode scanning and sharing unique deal seeds!<br/><br/>Try and beat your highest score in any of 42 popular Solitaire types totalling 50 variants:<br/><br/>Aces Up<br/>Baker's Dozen<br/>Black Hole<br/>Bowling<br/>Calculation<br/>Canfield<br/>The Carpet<br/>Clock<br/>Crescent<br/>Cruel<br/>Doubles<br/>Easthaven<br/>Eight Off<br/>Fortress<br/>Fortune<br/>Forty Thieves<br/>Fourteen Out<br/>FreeCell<br/>Gaps<br/>Golf<br/>Good Measure<br/>House Of Commons<br/>Half Klondike<br/>Klondike<br/>Double Klondike<br/>La Belle Lucie<br/>Martha<br/>Monte Carlo 13s<br/>Nestor<br/>Poker Solitaire<br/>Pyramid<br/>Rail<br/>Scorpion<br/>Simple Simon<br/>Six By Six<br/>Spider<br/>Thieves<br/>Three Blind Mice<br/>Tri Peaks<br/>Westcliff<br/>Windmill<br/>Yukon<br/><br/>Uses an intuitive control system designed specifically for touch screen devices - drag or tap cards to move them from place to place. Supports Mouse on devices.<br/><br/>Features optional sound effects / music and intelligent camera motion to automatically present the perfect view of the cards.<br/><br/>Carefully optimised native application for Tablets and Phones.<br/><br/>We recommend a screen size of at least 3.5\", but some of the solitaire variants are best experienced on a larger screen.", "metacritic": null, "released": "2013-04-22", "tba": false, "updated": "2022-05-20T11:35:13", "background_image": "https://media.rawg.io/media/screenshots/169/169c22139183e47c5f9e75b88c493b41_7za93hu.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tim Herbert"], "genres": ["Card"], "publishers": ["Tim Herbert"], "esrb_rating": "Everyone 10+"}