{"id": 787935, "slug": "bubble-shooter-jelly", "name": "Bubble Shooter Jelly", "name_original": "Bubble Shooter Jelly", "description": "Bubble shooter Jelly is an addictive, classic match 3 and time-killing bubble shooter game, once you get started,it won’t stop,<br/>Bubble shooter Jelly is a bubble shooter game with 650+ well-designed puzzles, and more levels are coming soon! In this Bubble shooter Jelly game, you can be sure that this is EXTREMELY fun!<br/>Bubble shooter Jelly helps you experience interesting challenges to get rid of stress after tiring work.<br/><br/>Aim, shoot, and pop bubbles to save all the baby bears.<br/><br/>Bubble shooter game Features:<br/>- More than 650+ well-designed bubble pop levels.<br/>- You can play the bubble shooter game without WIFI,anytime, anywhere.<br/>- Try to use limited bubbles to win bonus levels.<br/>- Various bubble items can help you get higher scores.<br/>- Various gameplay features make you can't stop playing.<br/>- Great visual effects.<br/>- Regular updates.<br/><br/>How to play the Bubble shooter game:<br/>1. Choose a level to play<br/>2. Aim carefully and tap where you want to pop bubbles<br/>3. Match at least 3 same color bubbles to make them pop, free all the trapped baby bears in the bubble!<br/>4. Use your strategies to clear all the bubbles for higher scores and 3 stars<br/>5. Easy to play and control <br/><br/>NOTES<br/>• Bubble shooter Jelly contains ads like banner, interstitial and video ads.<br/>• Bubble shooter Jelly is free to play, but you can purchase in-app items like AD FREE and coins.<br/>Bubble shooter Jelly is a very funny and wonderful bubble shooter game that you should not miss.<br/><br/>You will love this bubble shooter game! Pop bubbles to rescue the Babies trapped inside the bubbles!<br/>What are you waiting for? Get ready and download Bubble shooter Jelly now! <br/><br/>Enjoy this Free Bubble Game! If you have any suggestions,please contact us: bubbleshooter@infno.com.<br/><br/>Thank you everyone for playing Bubble shooter Jelly!", "metacritic": null, "released": "2019-09-11", "tba": false, "updated": "2022-05-20T11:25:37", "background_image": "https://media.rawg.io/media/screenshots/49d/49d158bb92f263541ce42f7e4c796e28_Bwky5s6.jpg", "website": "http://games.infno.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["元忠 林"], "genres": ["Strategy", "Casual"], "publishers": ["元忠 林"], "esrb_rating": "Everyone 10+"}