{"id": 787905, "slug": "air-attack-3d-sky-war", "name": "Air Attack 3D: Sky War", "name_original": "Air Attack 3D: Sky War", "description": "Welcome to the world of Air Attack 3D, full of adventure and action!<br/>Air Attack 3D is a new action game with great graphics! This new game has raised the bar in classic sniper games and brought innovation to sniper games!<br/><br/>Download and start playing now to experience the excitement of realistic air battles and fight with enemies with adrenaline-filled Air Attack 3D! Enjoy being a sniper with the Air Attack 3D game inspired by real helicopters! You will find yourself in a great adventure of battle games!<br/><br/>Air Attack 3D is a kind of war game where you can destroy enemies and enemy targets with various weapons. The helicopter will move and stop at different points and you will be able to destroy the enemies by shooting at the points where you stand.<br/><br/>You will experience various conflict areas and scenarios! You can destroy the soldiers and machine guns in the bastions of the prison, fight with the fugitive cavalry in the desert, shoot the terrorists hiding behind the hostages on the roof with your weapon!<br/><br/>Scenarios and missions will change with each level. In this game you will protect innocent people from evil, attack enemy bases and targets. These targets can be vehicles, helicopters or ammunition depots. Just find the target, focus, hold your breath and release the trigger!<br/><br/>Air Attack 3D is the best of battle and shooting games. Destroy all the targets, become the best shooter!<br/><br/>Start playing Air Attack 3D now and become an expert sniper! Experience the thrill of air battles and skirmishes with the adrenaline-filled Air Attack 3D! <br/><br/>Enjoy Air Attack 3D committed to the action!", "metacritic": null, "released": "2022-05-14", "tba": false, "updated": "2022-05-20T10:59:44", "background_image": "https://media.rawg.io/media/screenshots/e7f/e7fd68f76d4941e7a76c488cd5416df7.jpg", "website": "https://airattack3d.matchingham.gs", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 479, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MATCHINGHAM GAMES"], "genres": ["Action", "Simulation"], "publishers": ["MATCHINGHAM GAMES"], "esrb_rating": "Teen"}