{"id": 787951, "slug": "ethieboy", "name": "EthieBoy", "name_original": "EthieBoy", "description": "Join Ethie's musical journey to find the music note taker. Dodge, jump, and fly past tornadoes of musical notes as they escape from the composers staff. Witness the breath taking music score and a story of happiness and tragedy. And experience a musical game like no other! Born of shadow. Guided by light. The boy named Ethie, has been given life! <br/><br/><br/><br/>THE GAME!<br/><br/>Who knew musical notes could prove to be such a menacing obstacle! Guide Ethie through the composers music staff while avoiding them at all costs. Run, dodge, and jump your way through a magical world of musical disaster! Collect and mend the broken hearts. Using their power will provide you with extra abilities! Collect other power-ups along the way. Don't let Ethie's journey end on a sour note!<br/><br/><br/>THE STORY!<br/><br/>Who is Ethie? Or the music note taker?  <br/>Play the game, to find out sooner or later..<br/><br/>The mystery behind the game begins to unfold. <br/>Level by level, more of the story is told. <br/><br/>The further you get, the more you will know. <br/>I'll give you a hint, Ethie needs to save souls. <br/><br/><br/>THE MUSIC!<br/><br/>Immerse yourself to a beautifully composed soundtrack (by developer &amp; composer, Dennis J. Stovall) while playing the game!  Use headphones for a better experience!", "metacritic": null, "released": "2020-05-04", "tba": false, "updated": "2022-05-20T11:39:33", "background_image": "https://media.rawg.io/media/screenshots/82f/82f429d38ef27325b53bf70936fa3569_X8Khxsq.jpg", "website": "http://www.dennisjstovall.com/ethieboy.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dennis Stovall"], "genres": ["Casual"], "publishers": ["Dennis Stovall"], "esrb_rating": "Everyone 10+"}