{"id": 78809, "slug": "thats-right-live-gameshow", "name": "That's Right Live Gameshow", "name_original": "That's Right Live Gameshow", "description": "We’re a real gamechanger. That’sRight is the first ever gameshow app that combines a dynamic, live quiz show with an exciting drawing at the end that anyone can win.<br/><br/>The idea sparked from two dreams we had as gameplayers ourselves. We wanted to play a quiz game where the winners split a prize, but we also wanted every player to survive all the way to the end and have a chance to win even more. Who doesn’t love a chance to win cash, right?<br/><br/>So, we became the game we wanted to see in the world. We made it ourselves. That's right, just a couple of humble good ole boys from  Louisiana's northeast have created their vision of the future of entertainment right in their own hometown. We figure, there's no more American way to show the big game shows how it's done than by building this in our backyards in between neighborhood crawfish boils!<br/><br/><br/>In the first way to win, all players who answer every question right split a prize. Well deserved. They are the smartest in the room.<br/><br/>But who is the luckiest? That is decided in our second way to win: a whole new prize is awarded to one of the players by drawing a winning number from a ball machine. (And, yes, I know what you are thinking – the quiz winner could also be the winner of the raffle prize! Can you be the smartest AND luckiest one in the room? Try it!)<br/><br/>Each player receives a ticket just for entering the game. How fair is that!?! Then, as you get more right answers, you get more tickets. That’s Right! Players who get more questions right have a higher chance to win the raffle prize.<br/><br/>That’s not all though. All of this action and fun happens in the excitement of a live show with a live host. We know there are other live apps out there, but ours offers unique chances to win, all the way until the end.<br/><br/>What’s that? Somebody changed the game?<br/><br/>That’s Right. We sure did.<br/><br/>Now let’s play!", "metacritic": null, "released": "2018-06-28", "tba": false, "updated": "2019-10-22T13:54:31", "background_image": "https://media.rawg.io/media/screenshots/931/9315b016020ff281387b2dfc273d4eea.jpg", "website": "http://www.thatsright.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["That's Right"], "genres": [], "publishers": ["That's Right Network Services"], "esrb_rating": "Mature"}