{"id": 788245, "slug": "lucid-itch-world-champ-game-co", "name": "LUCID (itch) (World Champ Game Co.)", "name_original": "LUCID (itch) (World Champ Game Co.)", "description": "Combat nightmares in the minds of another to protect the veil between dreaming and waking life. Play as Dream Warriors with powers surreal. Carry out missions to pursue your goals and protect reality. \r\n\n<p><strong><em>LUCID</em></strong> is a gm-less tabletop roleplaying game for 1-5 players. unique dual-phase play allows for casual and conversational pondering and planning while awake with surreal and psychedelic conflict and combat in the dream realms. can be used for single session play around an hour or an ongoing campaign against the forces of nightmares. <br/></p>\n\r\nCONTENT WARNINGS: psychological strife, physical violence, manipulation and coercion, dissociation, horror themes and imagery.\r\n<p>For fans of movies like <em>Possessor, Inception, Nightmare on Elm Street, Waking Life,</em> and more. Designed by Adam Vass in May 2022. Published by World Champ Game Co.</p>\n\n<p>\n</p>\n<p>The two phase structure is inspired by the rally-raid roleplaying game TORQ by Will Jobst available at goodluckpress.co.</p>\n<p>The mission structure on randomly generated psychedelic landscapes is derivative of my stoner metal science fantasy game Necronautilus, available at worldchamp.io/store. </p>\n<p>This work is based on the Push SRD, developed, authored, and edited by Cezar Capacle (https://capacle.itch.io/), and licensed for our use under the Creative Commons Attribution 4.0 International license (https://creativecommons.org/licenses/by/4.0/). It is an entry to the PUSH jam. <br/></p>", "metacritic": null, "released": "2022-05-19", "tba": false, "updated": "2022-05-20T13:47:42", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd40b731a8e7946ae0a154769b8b76dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["World Champ Game Co."], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}