{"id": 78828, "slug": "pool-fan-open-table-billiards", "name": "Pool Fan - Open Table Billiards", "name_original": "Pool Fan - Open Table Billiards", "description": "•The World's Best pool billiards snooker game - now on iOS!•<br/><br/>Gametime! Play with friends! Play with Legends. Play the hit 8 ball pool games (classic 9 ball mode  also support) on your mobile and become the best snooker baller! become the ball king!<br/><br/>COMPETE 1-ON-1 OR IN 8 PLAYER TOURNAMENTS<br/><br/>Refine your skills in the practice arena, take on the world in 1-vs-1 matches, or enter tournaments to win trophies and exclusive cues! Train yourself to become a better snooker baller<br/><br/>PLAY FOR pool COINS AND EXCLUSIVE ITEMS<br/><br/>Customize your cue and table! In every competitive 1-vs-1 match you play, there’ll be pool Coins at stake – win the match and the Coins are yours. You can use these to enter higher ranked matches with bigger stakes, or to buy new items in the snooker store.<br/><br/>CHALLENGE YOUR FRIENDS<br/><br/>In Pool Fan - Open Table Billiards Shrimp, playing friends is easy: sign in with your or Facebook account and you’ll be able to challenge your friends straight from the game. Challenge friends Vengeance them anytime, anywhere and show off your skills. Wipeout all ball with less cue, then show them that your are the king of atp tennis! The giants of table!<br/><br/>LEVEL UP<br/><br/>8 ball pool’s level system means you’re always facing a challenge. Play matches to increase your ranking and get access to more exclusive match locations, where you play against only the best pool snooker balloons players.<br/><br/>--Download pool by NOW!--<br/>*Pool Fan - Open Table Billiards requires internet connection.<br/><br/>It's gametime to have fun with Pool Fan - Open Table Billiards! The best snooker game! It's gametime to wipeout all balls and become ball king now!", "metacritic": null, "released": "2015-07-17", "tba": false, "updated": "2019-07-30T00:37:56", "background_image": "https://media.rawg.io/media/screenshots/e10/e107aafba63d620659fe8ac0a817d685.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wei Wang"], "genres": ["Sports", "Puzzle"], "publishers": ["Wei Wang"], "esrb_rating": null}