{"id": 788383, "slug": "metal-commander", "name": "Metal Commander", "name_original": "Metal Commander", "description": "<p><em>Metal Commander is a small academic project developed by students from UPB Colombia inspired by Action-RPGs and Strategy-RPGs of the '90s.</em></p>\n<p>Meet <strong>William Perceus VI</strong>, habitant of the millenary islands of Rossaint Soul and descendant of an ancient revolutionary who fought against the tyrant Thomas Carlyle, a bloody dictator who imposed his regime on the entire region.</p>\n<p>Now it's time for him to do the same as his predecessor, command a revolution, and set free the lands of Rossaint Soul once again from the hands of the new tyrant and descendant of Thomas Carlyle.</p>\r\nMeet the party\r\n   \r\n<p><strong>William Perseus VI </strong></p>\n<p>Descendant of William II duke of Northerland and creator of the mechanic gear machines that all the people use around the Islands. Thanks to his charisma and bloodline he's the leader of the New Revolution against the army of Roussaint. He's very skilled in the use of the sword.</p>\n\n\n<p><strong>Vincent Nova</strong></p>\n<p>He's William's closest friend, both born with prestigious bloodlines. Vincent has been learning how to use a gun since he was 7 y/o, and he was appointed as William's bodyguard at just 18 y/o surpassing his father as the youngest in this role, they say he can hit a bird 250 meters away.</p>\n\n<p><strong>Juliet Maitland</strong></p>\n<p>She's the head leader of the Bluevales, a group inside the revolution who are in charge of educating the youngsters in the art of magic powers. She's one of the most respectable persons in the revolution thanks to her vast knowledge of the magic arts, being probably the most intelligent person in all the Islands and the main counselor of William.</p>\n\n<p><strong>Hoover Ramsbottom</strong></p>\n<p>He used to work in despicable conditions for the army of Rossaint as his main technician and worked under the radar in various experimental armors that ended up in the wrong hands and killed a soldier of Rossaint reason for his exile from the city. Now he has found a home in the revolution and kept on working on armors to be used for the greater good.</p>\r\nOur Dev Team\r\n\n<p><strong>From left to right.</strong></p>\n<p>Néstor Cano - Game Producer / Julián Rosero - Lead Programmer</p>\n<p>Alejandro Quiceno - Main Artist / Nicolás Gómez - SFX &amp; Programmer</p>\n<p>David Arrubla - Music</p>", "metacritic": null, "released": "2022-05-19", "tba": false, "updated": "2022-05-20T14:49:19", "background_image": "https://media.rawg.io/media/screenshots/342/342e5b77d9c7ab3f19ec21b8715d9f34.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SkarddY"], "genres": ["Action"], "publishers": [], "esrb_rating": null}