{"id": 788330, "slug": "crypto-game", "name": "Crypto Game", "name_original": "Crypto Game", "description": "<p><strong>Controles: Usa las teclas \"B\" y \"S\"  para comprar y vender más rápido!</strong></p>\n\n<p>Adéntrate en el mundo de las criptomonedas jugando! </p>\n<p>Aprende las bases del trading y comprueba lo rápido y ágil que eres comprando y vendiendo criptomonedas!</p>\n<p><strong>Modos de juego:</strong></p>\n<ul><li><strong>1 min:</strong> Tienes un minuto para ganar el máximo beneficio posible! Ten cuidado porqué la volatilidad del mercado es muy alta y los precios cambian rápidamente! </li><li><strong>Infinite</strong>: Cuanto tiempo aguantarás comprando y vendiendo antes de quedarte sin dinero? (Modo de juego aún no disponible)</li></ul>\n<p>*Aviso a los listill@s! Las gráficas serán distintas cada vez que juegues! Hay más de 20 gráficas diferentes que se colocan una detrás de la otra de manera aleatoria! No te va a servir aprendértelas de memoria! :P</p>\n<ul><li><strong>Learn: </strong>Usa el tutorial para aprender como jugar y resolver tus dudas antes de empezar!</li><li><strong>Practice:</strong> Alguna vez te has preguntado cuanto dinero tendrías si hubieras empezado a tradear con BitCoin des de sus inicios? Ahora puedes hacerlo! Juega en su gráfica y comprueba  donde podrías haber llegado!  (Modo de juego aún no disponible)</li></ul>\n\n<p><em>Juego realizado para el concurso #Bit2MeChallenge</em></p>\n\n<p><em>CNMV: \"La inversión en criptoactivos no está regulada, puede no ser adecuada para inversores minoristas y perderse la totalidad del importe invertido”. </em></p>\n<p><em>Disclaimer: Esto no es un consejo de inversión ni de ningún tipo. No soy un experto. Haz tu propia investigación y toma tus propias decisiones sobre cualquier cuestión comentada en este juego.</em></p>", "metacritic": null, "released": "2022-05-19", "tba": false, "updated": "2022-05-20T14:26:06", "background_image": "https://media.rawg.io/media/screenshots/5c5/5c527d6adeed0ddd86bbb855069c5b90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android"], "developers": ["xmaymo"], "genres": [], "publishers": [], "esrb_rating": null}