{"id": 788458, "slug": "the-datura-estate-i", "name": "The Datura Estate Ⅰ", "name_original": "The Datura Estate Ⅰ", "description": "<p><strong>How to play this game:</strong></p>\n<p>Download all the files and print them.</p>\n<p>This game requires five players and a facilitator.</p>\n<p>Before the game starts, the players each have to decide on their role. Players need to learn the story and background of the character by reading their character's script and deducing the spy hidden among them by using clues.</p>\n<p>The facilitator takes control of the game and helps the players to play the game according to the host's manual.</p>\n<p><strong>Instruction</strong></p>\n<p>This is a game similar to Murder Mystery Game.</p>\n<p>But the difference is that instead of finding the killer, the players need to find a spy in this chapter of the game.</p>\n<p>In order not to be dramatic, I can't write more about the story here. But if you're a fan of LARP games too, give it a go!</p>\n<p><strong>The goal of this game</strong></p>\n<p>Finding out the real spy!</p>\n<p><strong>Inspiration</strong></p>\n<p>The reason for making this game is that I personally love the Mystery Murder Game, not only do I enjoy the deduction and finding out the truth, but I am also fascinated by the cooperation and arguments when playing with friends.</p>\n<p>The theme of this chapter is finding the spy because I recently reviewed a Chinese film about spies, The Message.  And in my opinion,  it is no less fun to find out who is hiding among people than it is to find the real killer.</p>\n<p><strong>Troubles and Thinking</strong></p>\n<p>Although I had written a few scripts before this, this was my first attempt at making this type of game.</p>\n<p>In the process of making it, I found it to be very different from writing a script. The designer needs to think over and over about whether he has given all the necessary information in the script and whether the clues are too obvious.</p>\n<p>But overall, I really enjoyed the process of making this one. Because it's the kind of story I like, and it's the kind of game I like.</p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T15:16:56", "background_image": "https://media.rawg.io/media/screenshots/1d9/1d92cb99695a79ec5a04f508adf5efe7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yuyif5"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}