{"id": 788487, "slug": "the-lonely-souls", "name": "The Lonely Souls", "name_original": "The Lonely Souls", "description": "<p>This is a small project made as a testing prototype for collecting reviews, made by two students, one as an artist, another as a programmer and the story writer(That's me!).</p>\n<p>It was made for a bachelor's thesis on the theme of \"Computer Gaming Offers Analysis for LGBT subcultures\". If you can spare a moment, complete the two Surveys provided- one at any point, and another after completing the game at least once. <br/></p>\n<p>It is an incredibly short visual novel, just the very beginning of the story, where you could meet up to three characters, get a small glimpse into their characters, and over the span of the game make some choices, that will impact your starting relationships with them. <br/></p>\n<p><strong>Story</strong><br/></p>\n<p>It begins with you arriving at the camp called The Lonely Souls, a place for those searching for their love, but unable to find one in the normal world, so they come here, to the place set up to find love and relationships, where anybody going around alone is, well, alone. Who are you? Somebody and nobody, and in the end, up to you to decide. You're really gay, however, so there is that. Nothing bad about it, and all good, so don't worry, there are many like you here. </p>\n<p>There are 5 pseudo endings, depending on the amount of points collected with the amount of characters. They differ in the end, black screen, text, and the achievement name pop up. There are no achievements for specific characters, only the amount of points collected during the day with the overall characters.<br/></p>\n<p><strong>Problems and more problems<br/></strong></p>\n<p>Built on Unity, this is not a perfect visual novel by far. I'm not going to sugarcoat it- if something breaks, I'm really sorry. Also, sounds are really lacking, expect to have a singular audio track for the whole game, or better disable the sound in the settings(It's actually off by default. Huh. Well. Then you can turn it on?). <br/>Story- Well, I tried, but faced a lot of problems and some mistakes in the writing. It's short, in my views sweet, but CW mentions of racism against a race, and just sometimes sad boys and all that. <br/><br/></p>\n<p>I hope you will enjoy!<br/></p>\n<p>Surveys-</p>\n<p>Survey One- LGBTQIA+ Gaming. You can complete this at any point, it's not connected to the game</p>\n<p>Survey Two- The Lonely Souls. Please complete this after completing the game at least once. You can go for more, and you can always return back to it and change your answers. Thanks.<br/></p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T15:26:48", "background_image": "https://media.rawg.io/media/screenshots/1be/1bef2b9e7ba81c26855d2d732b8199d2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sinantrarion"], "genres": [], "publishers": [], "esrb_rating": null}