{"id": 78856, "slug": "midnight-mysteries-salem-witch-trials-collectors-e", "name": "Midnight Mysteries: Salem Witch Trials - Collector's Edition", "name_original": "Midnight Mysteries: Salem Witch Trials - Collector's Edition", "description": "A storm is brewing in Salem—can you solve this Midnight Mystery?<br/><br/>Explore 10 adventurous missions in this intriguing hidden-object adventure game. The famed writer Nathaniel Hawthorne has died during a freak snow storm, and his ghost has come to you, asking for help. There’s more to this case than first appears, and only you can help free his spirit.<br/><br/>Travel back and forth in time from the scene of the author’s demise to the 17th century, where a town is going mad with rumors of witchcraft and a woman is facing accusations and the gallows. Explore the spooky terrain and structures of Salem village inside and out, interview ghosts, solve brain-teasing puzzles and collect hidden objects.<br/><br/>Search for collectible clovers in each scene to unlock unlimited hidden object mode! Scour scenes for ravens to use as hints along the way. Or, use your lantern to figure out the shape of the object you’re searching for.<br/><br/>Unravel the secrets of Salem’s accused witches and solve the mysterious death of Hawthorne in this Midnight Mystery!<br/><br/>COLLECTOR'S EDITION<br/><br/>Detailed, illustrated Strategy Guide<br/>Find two hidden Easter Eggs to play special hidden object modes<br/>Artful character sketch index to explore<br/>Research history gives you insight into<br/>– the Salem Witch Trials<br/>– Nathaniel Hawthorne<br/>– and a spoiler topic that you can unlock!<br/>Explore the Panic Room and all of the paranormal activities from Midnight Mysteries!<br/>Visit Salem Under Construction, a before and after look at the village as it takes shape<br/>Deleted Scenes include both sketches and finished scenes that didn’t make the final version of Salem Witch Trials<br/>Exclusive House of the Seven Gables Silver Dollar Hunt unlocked at the end of game—<br/>find all 100 silver dollars!<br/><br/><br/>……………………………………………………………………………………<br/>Visit us on the App Store at http://itunes.apple.com/us/artist/mumbojumbo/id312416866<br/>to find more amazing casual games from MumboJumbo including: the Luxor Series, Midnight Mysteries Series, 7 Wonders Series and more! <br/><br/>Find us on Facebook: http://www.facebook.com/MumboJumboGames <br/>Follow us on Twitter: @MumboJumboGames<br/>……………………………………………………………………………………", "metacritic": null, "released": "2010-12-16", "tba": false, "updated": "2019-07-30T02:00:46", "background_image": "https://media.rawg.io/media/screenshots/2c5/2c511512b81c106c96944057afb987a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["MumboJumbo"], "genres": ["Adventure", "Puzzle"], "publishers": ["MumboJumbo"], "esrb_rating": null}