{"id": 788665, "slug": "white-maze", "name": "White Maze", "name_original": "White Maze", "description": "<p><em>The White Maze - An online video game experiment</em></p>\n\n\n<p>You are invited to participate in a research study about your attention and awareness. \r\n</p>\n<p>\n</p>\n<p>Why should you participate? Participating in this study may be enjoyable for you, and it will help us learn how individuals subjectively experience their attentional lapses. </p>\n<p>If you agree to participate in this study, you will play a video game for a total time of 15 minutes, through three blocks of a first-person Pac-Man copy. The goal of the game is to find and collect coins whilst exploring a white maze. During the game,  you will be asked to answer questions about your experience. As well, at the end of the game, you will find a longer questionnaire.</p>\n<p><strong>Participation in this study is voluntary</strong> and <strong>you must be 18 years old or older</strong> in order to take part.\r\n</p>\n<p>If you participate in the study and finish all three blocks and the final questionnaire, you will get the opportunity to win a $50 voucher for Patagonia as compensation for your time (if your shipping address is not eligible or inconvenient you will be offered alternatives). If you agree to share your contact details in the final questionnaire, we will email you separately to let you know if you are the winner.</p>\n<p>In addition, we are taking this opportunity to ask you to join us and campaign for Mind with an open donation. Mind provides advice and support to empower anyone experiencing a mental health problem. Mind campaigns to improve services, raise awareness and promote understanding. If you want to contribute now, click HERE.</p>\n<p>All your data will be fully anonymised, securely stored and aggregated for analysis. If you choose to take part in the draw for the $50 voucher, you will be asked for your email address, so we can contact you in case you win.\r\n</p>\n<p> The email addresses will be stored on a different server than all other data we collect and cannot be associated with it. After the draw, the list of email addresses will be destroyed.</p>\n<p>This study complies with the General Data Protection Regulation (GDPR) and Data Protection Act 2018. The data controller is Inhalation, the legal basis for this research is GDPR Articles Article 6 (1) (e). Please contact us for any data protection questions, comments or complaints.\r\n</p>\n<p>This study is part of a research initiative launched by Inhalation's Mind and Cognition Lab, with the collaboration of Milan University/Cognition in Action Unit, York University/IGGI, and Tokai University.</p>\n<p>For further information, you contact us at <em>info@inhalation.dev . </em></p>\n<p>Thank you for supporting our research.</p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T16:36:18", "background_image": "https://media.rawg.io/media/screenshots/32b/32b1974067495fd0c2e80208c1af4455.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mind and Cognition Lab"], "genres": [], "publishers": [], "esrb_rating": null}