{"id": 788670, "slug": "starz-seeker", "name": "Starz Seeker", "name_original": "Starz Seeker", "description": "<p><strong>Hello! This is my second project, \"Starz Seeker\", built on Construct 2 engine (30-40 hours of work). Fullscreen mode is recommended!</strong><br/></p>\n\n<p><em>You are a lonely spaceship lost in the galaxy (far far away!). You need to find your way home thanks to the constellations. To do so, you have to scan stars with your probes. The stars' colors teach you the constellation's location and your compass gives you the angle.</em></p>\n\n<p><strong>It's a pretty cosy and easy game, and I hope you'll enjoy it! :3</strong></p>\n\n<p>------------------------</p>\n<p>[FR]</p>\n<p><strong>Yo ! Je vous présente mon 2e petit projet \" Starz Seeker\" développé sur Construct 2 en une trentaine, quarantaine d'heures. Je vous conseiller de passer le jeu en plein écran pour y jouer dans de meilleures conditions ! </strong></p>\n\n<p><em>Vous incarnez un vaisseau spatial perdu dans l'univers. Pour rentrer sur votre planète-mère, vous devrez vous orienter grâce aux constellations. Pour cela, vous devez scanner les étoiles que vous rencontrez grâce à vos sondes. La couleur des étoiles dévoilées vous permettra de localiser la constellation tandis que votre boussole vous renseignera sur son orientation.</em></p>\n\n<p><strong>C'est un jeu tranquille, confortable et j'espère que vous l'a</strong><strong>pprécierez ! :3</strong></p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T16:38:14", "background_image": "https://media.rawg.io/media/screenshots/364/3645fafa5b33a439748ea034a559b1aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Floppyboy"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}