{"id": 788677, "slug": "raid-elite", "name": "Raid Elite", "name_original": "Raid Elite", "description": "<p>This game is a combination of real time strategy game and raid in MMORPG. In this game, you will control five characters to defeat a powerful boss. There are two bosses you can choose to fight, and the challenge would be harder. Only when you are familiar with both the characters and boss’s skill well, you can defeat them. The inspiration is the time I was in raid progression. We would check the raid manual again and again, and try dozens of times. In this game, you would be like a team leader, command your team member to move, attack and use skill properly.</p>\n<p><strong>Control</strong></p>\n\n<p>Select: Left click to select a character. </p>\n<p>You can click the avatar picture on left tab to select a character,</p>\n<p>And you can press 1-5 on your typing key.</p>\n<p>MultiSelect: Left click and drag your mouse to select all the </p>\n<p>Characters in the select box.</p>\n<p>Deselect: Left click somewhere else to cancel all the select.</p>\n<p>Move: Right click to move all the selected characters to your</p>\n<p>Mouse position.</p>\n<p>Attack: Right click an enemy to command your characters to</p>\n<p>attack an enemy. When the melee characters has an enemy on </p>\n<p>Their attack range, they will attack automatically.</p>\n<p>Skill: The skill tab is in bottom-right. The active tab the first character’s skills who is selected. You can click the skill button or press Q, W, E to use the skill. Some skills need a legal target, you might need to have a target enemy or select a target character.</p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T16:41:53", "background_image": "https://media.rawg.io/media/screenshots/60b/60bc72a995745c3aceb9c4677c38a286.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AaaaaaDa"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}