{"id": 788706, "slug": "save-the-walking-dead", "name": "Save The Walking Dead", "name_original": "Save The Walking Dead", "description": "Vision Document:\r\n<p>Click here.</p>\r\nDescription:\r\n<p><em>Save The Walking Dead</em> is a narrative adventure game where the typical \"Human vs. Zombie\" tale is flipped on its head, with you playing as a zombie trying to defend against an evil human. Meanwhile, the game takes place in a child's bedroom because the narrative is really just one of his imaginary playtime scenarios. With goofy music, pop-culture-related quest titles, and unexpected quest events, this game doesn't hold back on the entertainment.</p>\n<p>In order to create this experience, I used/modified many different resources, including <em>YouTube Music</em>, <em>FreeSound.org</em>, <em>Mixamo</em>, and the <em>Pixel Crushers' Dialogue System</em>. One of the largest difficulties I had while in development was figuring out how to make the cutscene function properly. Because my character models were scaled disproportionately to the Pixel Crushers' default camera angles, I wasn't allowed to use the default camera angles. Instead, I had to modify the camera angle collection prefab, and add custom camera angles to fit my characters. Another issue I encountered was trying to let the player only interact with the workbench one time. In order to achieve this, I had to create both a boolean value to keep track of the workbench's use, and a quest state listener component to deactivate its usable component if the boolean returned true. Together, these two problems created a more fluid game flow upon correction.</p>\r\nImportant Controls:\r\n<p><em>Open Journal/Quest Log</em> - <strong>J Key</strong></p>\n<p><em>Escape Game</em> - <strong>Alt + Tab Keys/Win Key</strong></p>\r\nCredits:\r\n<p>Animations &amp; Models - Mixamo</p>\n<p>Sound Effects - Free Sound</p>\n<p>Background Music - YouTube Music</p>\n<p>Narrative Elements - Pixel Crushers Dialogue System</p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T16:54:24", "background_image": "https://media.rawg.io/media/screenshots/a0e/a0ef4b16038e179b726030b64fcc18bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JoeyDiamond115"], "genres": [], "publishers": [], "esrb_rating": null}