{"id": 788757, "slug": "potion-game-working-title", "name": "Potion Game (Working Title)", "name_original": "Potion Game (Working Title)", "description": "Quick Summary\r\n<p>You are an alchemist who's found themselves in an abandoned cabin. All you have is a tattered notebook left behind from your mentor (not actually in the game yet but shhh) and your wits. So grab your spoon and go out there! Those potion ingredients aren't going to collect themselves, and it sounds like some of them might be hard to get your hands on. Guess you better prepare.</p>\r\nGameplay Overview\r\n<p>The game is played from a first-person perspective. The player starts with a weak but infinitely usable melee weapon. They have access to a number of potion-creating implements in a small cabin, but no materials with which to make potions. Those materials can be found in the Dark Forest.\r\nThe player travels to and explores the Dark Forest, where they gather potion materials. These come from environmental pickups around the forest, as well as monster drops. Monsters will be difficult to slay with the melee weapon alone, and so the player will have the easiest time collecting environmental pickups, crafting damaging and healing potions, then attacking the monsters. Those monsters will then drop the materials for a higher level damaging potion. When the player feels reasonably well-stocked on both damaging and healing potions, they may progress to the area boss, the Abandoned Golem.<br/>\n</p>\r\nControls\r\n<p>WASD - Movement<br/>Space - Jump<br/>Ctrl - Crouch<br/>Shift - Sprint<br/>E - Use/Collect/Craft<br/>1-9 &amp; mouse wheel - Swap Potion<br/>Tab - Open Inventory<br/>Left Click - Throw Potion<br/>Right Click - Swing Spoon<br/>F - Lantern</p><p>Potion Game (Working Title) is a game made by the J Squad (Joyce, Jake, and JD) for Professor Santello's Spring 2022 3D Game Development course at the College of DuPage.</p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T17:12:47", "background_image": "https://media.rawg.io/media/screenshots/111/1110d31e25014fbeec8e7ea3616e8022.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["J Squad"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}