{"id": 788723, "slug": "storysoup", "name": "StorySoup", "name_original": "StorySoup", "description": "<p><em>StorySoup</em> is a simple “card-deck” based story-telling prompt generator app that suggests basic story components you may like to use to create a story. So if you are after a short story writing or story telling challenge, run <em>StorySoup</em>, hit “Go”, and let the creative juices flow.</p>\n<p>The story components are;\r\n</p>\n<ul><li><strong>Challenges</strong> – Challenges the characters need to overcome or find solutions for.\r\n</li><li><strong>Characters</strong> – Who the significant players in this story are.\r\n</li><li><strong>Events </strong>– Things of note that happen during the story.\r\n</li><li><strong>Locations</strong> – Places where the story is set or that may be passed through as the story unfolds.\r\n</li><li><strong>Objects</strong> – Items of significance to the story.\r\n</li><li><strong>Endings</strong> – The end point for the story.\r\n</li></ul>\n<p><em>StorySoup</em> will not write the stories for you.  That's up to you.  But it will give you a good framework to create from.\r\n</p>\n<p>The story element database of about 6000 items covers a number of different genre. Choose from\r\n</p>\n<ul><li><em><strong>Adventure Kids</strong></em> - Dastardly villains, school bullies, and lashings of ginger beer. All are part of the <em>Adventure Kids</em> genre.\r\n</li><li><em><strong>Animal Fables</strong></em> – In the <em>Animal Fables</em> genre, Animals are the main characters and the challenges of survival are the main themes for this genre.\r\n</li><li><em><strong>Detective Noir</strong></em> - <em>Detective Noir</em> is the classic gumshoe detective genre with gangsters, speak-easys, dark ally-ways, and dubious clients.\r\n</li><li><em><strong>Fairy Tales</strong></em> - Once upon a time …. something happened …. and they lived happily ever after. That might happen, but maybe not.\r\n</li><li><em><strong>Fantasy</strong></em> - The <em>Fantasy</em> genre covers anything from Tolkien's “Lord of the Rings” to Charles De Lint's urban fantasies, to China Mieville's dark worlds, to steampunk.\r\n</li><li><em><strong>Horror</strong></em> - The <em>Horror</em> genre includes story components that encompass the range from the subtle implied horror of H.P. Lovecraft, to the splatter-fest of apocalyptic zombie horror.\r\n</li><li><em><strong>Murder Mystery </strong></em>- The <em>Murder Mystery</em> genre draws its inspiration from the “Cluedo” board game, Agatha Christie's “Hercule Poirot” and “Miss Marple”, and the “How to Host a Murder” games.\r\n</li><li><em><strong>Myths and Legends</strong></em> - The <em>Myths and Legends</em> genre encourages the story teller to develop new legends inspired by indigenous cultural stories from around the world.\r\n</li><li><em><strong>Science Fiction</strong></em> - Where technology, people, thought, environment and society may be going are all things for the story teller to speculate upon as they maneuver their way through the story components for the <em>Science Fiction</em> genre.\r\n</li><li><em><strong>Wild West</strong></em> - Saddle up in the <em>Wild West</em> genre where outlaws, snake oil salesmen, dusty towns, and the open sky beckon the story teller.\r\n</li><li><em><strong>Custom Genre </strong><strong>(Custom Card Sets)</strong></em> - Of course you can also make up your own lists to add into the mix.\r\n</li></ul>\n<p>or just mix it all up with the default “<em><strong>Everything</strong></em>” genre which calls on all the story elements in the StorySoup database.\r\n</p>\n<p>For more information, cruise over to the StorySoup page on <strong>TechMonkeyBusiness.com</strong> </p>\n<p>Have fun, feel inspired.\r\n</p>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-05-20T17:01:15", "background_image": "https://media.rawg.io/media/screenshots/482/482f056e31dcba1dc55f736a95481526.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "PC"], "developers": ["HamyTNT"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}