{"id": 7888, "slug": "ys-chronicles-ii", "name": "Ys Chronicles II", "name_original": "Ys Chronicles II", "description": "After a hard fight to recover the six sacred books in Ys Chronicles I, Adol is back for a sequel!<br/><br/>Ys II -- also known as Ys II: Ancient Ys Vanished – The Final Chapter -- is an action-packed, heroic fantasy JRPG game that immerses you in a beautiful Japanese artistic universe. After defeating Dark Fakt, you (as Adol) must continue your quest to unravel the island’s secrets. Use your sword skills, wield new weapons, and for the first time discover magic to free the legendary city of Ys from evil. With your unfailing determination, you must restore hope to a land besieged by demons and weakened by despair!<br/><br/>Featuring an epic, enchanting soundtrack, a rich, poetic atmosphere with beautiful artistic direction, and a deep story, Ys II uses the same “BUMP” system as its predecessor, requiring you to attack enemies by pouncing on them. This fighting style equates to more intuitive, more dynamic touch gameplay! <br/><br/>• Easy-to-master gameplay<br/>• Hint system<br/>• Choose between three soundtracks: Chronicles, Original, and PC-88<br/>• Two game modes: Adventure and Time Attack<br/>• Two graphics modes (available in Adventure mode only): Chronicles and Original<br/>• Four difficulty levels<br/>• Achievements<br/>• HD Menus<br/>• Virtual Pad and joystick support<br/>• New artifacts, weapons, and armor<br/>• Numerous spells to defeat your enemies with<br/>• No ads, no in-app purchase, no hidden costs! Enjoy the full content!<br/><br/>Continue your adventure in the Ys universe with this epic sequel to the godfather of all Japanese action-RPGs! Enjoy this mobile version anywhere, anytime -- no Internet connection required!", "metacritic": null, "released": "2016-02-09", "tba": false, "updated": "2019-08-02T04:39:55", "background_image": "https://media.rawg.io/media/screenshots/22f/22f45aa7bbc959826cedbd2a69925f37.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["DotEmu"], "genres": ["Adventure", "RPG"], "publishers": ["DotEmu"], "esrb_rating": null}