{"id": 788958, "slug": "afterlyte", "name": "AfterLyte", "name_original": "AfterLyte", "description": "<p>This is a rouge like game that i made with my friend Jesper for a school project</p>\n<p>You get to select between a melee and a range player. You progress by killing and getting to the stairs in each level to get to the next level, as you kill enemies you pick up coins and crystals that you will be able to use on chests through the dungeon and getting stronger (the crystals increase your stats, you press 1 one in game to see your stats and 2 to see your coins).</p>\n<p>After level 3 you will be able to find the boss room that contains a toombstone that spawns enemies. To proceed you will need to destroy the toombstone. </p>\n<p>As you proceed thorugh the levels you get stronger, and the enemies increase in numbers and their strenght.</p>\n\n<p>My plan is to work on this project some more on my freetime and upload a bugfix update soon :)</p>\n<p>BUGS:<br/>*the stairs can sometime spawn in the main room<br/></p>\n<p>*the esceape menu sometimes dosen't work</p>\n<p>*the enemy Ai is very wierd </p>\n<p>*the stats dosen't reset  after you have died</p>\n<p>*the healthbar can show a different value sometime</p>\n<p>*there are some ocations you can't proceed through the dungeon an need to restart</p>\n<p>*it can happen that a room destroys itself</p>\n\n<p>It probably exists some more bugs that I haven't noticed<br/></p>\n\n<p>Things i want to add:</p>\n<p>*A boss(you can see him in the top right of the page actually)</p>\n<p>*Two more enemies</p>\n<p>*A black market with items</p>\n<p>*Redo the dungeon generation with more decorations</p>\n\n<p>Comment more stuff i should add :3</p>\n\n<p>This is my second actual game that i have made, give me tips on how to improve the game ;)<br/></p>", "metacritic": null, "released": "2022-05-17", "tba": false, "updated": "2022-05-20T18:33:22", "background_image": "https://media.rawg.io/media/screenshots/f79/f7941ade5875d45bb0ac43d0a5bf5cab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OohTacoMan"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}