{"id": 789, "slug": "helsings-fire", "name": "Helsing's Fire", "name_original": "Helsing's Fire", "description": "When the implacable Professor Helsing and his assistant Raffton travel to The Shadow Blight, they'll need every weapon at their disposal to defeat Dracula's vampire horde. In this captivating, dark Gothic puzzle-adventure, use Dr. Helsing's powerful torch and tonics to save the world from the demonic uprising!<br/><br/>AWARDS AND ACCOLADES<br/>This is no ordinary game! Helsing's Fire is recognized around the world as one of the App Store's premier puzzle games; full of charm and challenge.<br/><br/> IGF 2011 - Best Mobile Game Finalist<br/> IGF 2011 - Excellence in Design Honorable Mention<br/> IGF 2011 - Excellence in Visual Art Honorable Mention<br/> SlideToPlay - The 50 Best iPhone Games of 2010 (#7)<br/>TouchArcade - Best iPod Touch and iPhone Games (Puzzle)<br/> AppAdvice - The Very Best iPhone Games of 2010 (Puzzle)<br/> TheAppera - Best iPhone Games 2010<br/> TouchGen - Editor's Choice Awards (Puzzle Runner-up)<br/><br/>PRESS QUOTES<br/><br/>SlideToPlay<br/>... Helsing's Fire is one of those puzzle games that does something completely original and is unbelievably entertaining.<br/><br/>Eurogamer<br/>... With its insidious wit and gothic charm, Helsing's Fire is a joyously original instant classic that iPhone owners should buy immediately.<br/><br/>TouchArcade<br/>... It's one of the most unique games I've ever played and is a true App Store gem. Surely only a creature of darkness would let this one slip by them.<br/><br/>TheAppera<br/>... Helsing's Fire reinvents the puzzle yet again with some light and dark dynamics I guarantee you have NOT seen yet. Prepare to be enthralled!<br/><br/>GamePro<br/>... This is a game that would absolutely only work on the iOS platform, and it's hands-down one of the best games on the App Store. It gets my highest recommendation.<br/><br/>ADDICTIVE PUZZLES<br/>Helsing's Fire features a brand-new puzzle mechanic never before seen: use the touch-screen to position Helsing's torch to illuminate different combinations of monsters, then destroy them in the correct order using Raffton's supply of different tonics. The quick, rewarding puzzles make it a perfect game for brief play-sessions, but you'll always want to play 'just one more level'!<br/><br/>A HUGE, DARK UNIVERSE<br/>With puzzles set across four worlds, with 30 different levels in each world, all featuring fifteen different monster types including four bosses, Helsing's Fire provides an incredibly<br/>rich, deep, and varied game experience. And because on replays puzzles are re-generated randomly, the game will always be fresh!<br/><br/>COMPELLING SETTING<br/>The Victorian theme, Gothic setting, and engaging characters make Helsing's Fire one of the most appealing story-oriented puzzle games released. Add to that the distinct minimalist style of the character portraits, the incredible dynamic lighting of the shadows cast by your moving torch, and an original soundtrack, and it's clear that Helsing's Fire presents an epic experience. Designed just for the iPhone, this is high-quality mobile gaming at its finest.<br/><br/>MULTIPLE MODES AND ACHIEVEMENTS<br/>As if the 120 distinct levels weren't enough, Helsing's Fire also comes with additional Endless Survival and Online Bounty modes, for the bravest of the brave! And when you've stood against the horde as long as you can, you can post your scores on the fully-integrated Crystal leaderboards, earning achievements for your accomplishments and claiming bragging rights from your friends.<br/><br/>Dracula must be stopped. Raffton, take the tonics: it's time to head into the Blight!", "metacritic": null, "released": "2010-07-10", "tba": false, "updated": "2019-10-22T14:27:33", "background_image": "https://media.rawg.io/media/screenshots/ac1/ac1671bcc611831337f19e342fd0a889.jpeg", "website": "http://helsingsfire.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["3909"], "genres": ["Strategy", "Puzzle"], "publishers": ["3909"], "esrb_rating": null}