{"id": 7890, "slug": "stealth-assassin", "name": "Stealth Assassin", "name_original": "Stealth Assassin", "description": "AN ASSASSIN FROM THE FUTURE<br/>In each mission, your objective is to kill the target and escape back to the future. Guards will chase and attack you on sight, complete the assassination before they hunt you down. It&amp;#39;s hard to stay alive once you are seen. <br/><br/>USE YOUR SPECIAL ABILITIES<br/>Speed ability makes it easier to sneak around and run away from the guards. Cloak ability is good for hiding and getting out from any deadly situation.<br/><br/>INFINITE POSSIBILITIES<br/>Randomized movement patterns combined with unpredictable guard behavior makes it a new experience every time you play a mission. <br/><br/>25 MILLION PLAYERS LOVED IT<br/>Stealth Assassin is developed by the creator of the flash game series, Ultimate Assassin. Stealth Assassin&amp;#39;s predecessors were played more than 25 million times. <br/><br/>ONE FINGER CONTROLS<br/>Virtual joystick appears anywhere you put your finger on the screen. Double tap to activate speed, tap and hold to activate cloak.<br/><br/>120 ASSASSINATIONS<br/>Stealth Assassin features 30 different level designs and 120 missions. Missions are unlocked based on the success (achievements) in the current ones. <br/><br/>STEALTH IS THE KEY TO SUCCESS<br/>You need to be a real assassin in order to complete Professional Missions and unlock all 480 achievements!<br/><br/>WATCH THE GAMEPLAY VIDEO <br/>http://tinyurl.com/StealthAssassinVideo <br/><br/>FOLLOW US<br/>http://facebook.com/games121com<br/>http://twitter.com/games121", "metacritic": null, "released": "2013-02-16", "tba": false, "updated": "2019-10-22T14:29:36", "background_image": "https://media.rawg.io/media/screenshots/bf4/bf4f46470b1affa445e32ab5e288db2d.jpeg", "website": "http://mobile.games121.com/p/stealth-assassin.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Erman Haskan"], "genres": ["Action", "Arcade"], "publishers": ["Erman Haskan"], "esrb_rating": "Teen"}