{"id": 789033, "slug": "secunda-book-of-tizian-early-alpha", "name": "Secunda - Book of Tizian (Early Alpha)", "name_original": "Secunda - Book of Tizian (Early Alpha)", "description": "<p>There is \"Book of Tizian\", a personal route of \"Secunda\", the visual novel in dark fantasy setting where you play as a warlock of desires, an lord of the northern coven. This series in development is a story telled by a villain, a dark lord of islands of the mist, telled in gothic, flowery language of inner deception and corruption of your hero. </p>\n<p>As the project is on the earliest of possible stages of the developing it is builded in need and delight of your view - it also starts a call to rebuild the Story of the North, an starting point of the series as among the time and differences of such it can bloom in different story, with different, mature and more complicated, tones and shades and designs of the world. </p>\n<p><em>In the world of the fallen empire of black magic and forbidden cults, a violent, black soul of a thousand-headed snake flourishes - the heir of an ancient family was born in a house of malicious and gloomy, where the lands of winter last for years and nights - for months. Here the stream of consciousness and sensuality opens from a restless and passionate soul, and its mind is formed along with the growth of the nature of their master within - and with them vice and perversion consume their allies, home and lovers. </em></p>\n<p><em>Your heart and love are immeasurable - protect your coven from an ill will, fill their cup to the brim and continue to fight for power and omnipotence in the name of the black hand -  know the darkest creatures of your world and build alliances that will shake the archipelago. </em></p>\n<p>In this book we propose you to see and build a story of the corruption - and of the divine domain, as the Tizian is an undead sorcerer along with whom your character, posessed warlock, may build the empire of the ominous lord and his devilish soulmate.</p>\n<p><em>The story is written from the perspective of an unreliable storyteller, and, despite the fact that their feelings and heartfelt experiences are given the lion's share of attention, the romance does not stand in the main place - the main character can burn with passion both for each of the interests or not succumb to anyone, delving only into the warmth of his own family, care for a prosperous future and in ourselves - knowing the passion of the black and all-devouring nature, the Archon is an ache that cannot be fullfiled, a road without end. </em></p>\n<p>Both of our projects are waiting your review - and each of them welcomes you warmly and wholeheartedly in our blog, where we make all amends, and discussions, and share delight of your company in any of the ways that you may find suitable: AukaneMin.tumblr.com</p>\n<p>You may also freely download and see the \"Story of the North\", first part of the story that is also going to be reforged on itch.io: aukanemin.itch.io/secunda</p>\n<p>I believe that each meeting is an start of something beautifull - any of your interest in world, or characters, or story - past and new, or craft and building of the project, of discussions and shared creating are precious and treasured in deepest, fullest of all ways&lt;з</p>", "metacritic": null, "released": "2022-05-17", "tba": false, "updated": "2022-05-20T19:07:24", "background_image": "https://media.rawg.io/media/screenshots/778/778bd7de3a54ff623a068b81ccc331fa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AukaneMin"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}