{"id": 789157, "slug": "the-cheat-code-for-happiness-is-single-player-play", "name": "The Cheat Code for Happiness Is... Single Player Playtest Build", "name_original": "The Cheat Code for Happiness Is... Single Player Playtest Build", "description": "<p>WELCOME TO THE PROTOTYPE OF THE CHEAT CODE TO HAPPINESS IS...  </p>\n<p>HEADPHONES RECOMMENDED  </p>\n<p>This is a highway note rhythm game.  </p>\n<p>You play the beat by either pressing the \"M\", \",\", \".\", and \"/\" (the four keys to the left of the right shift button) OR by using a controller and flicking the analog sticks up or down.</p>\n<p>[*Dev Note: The HTML5 build currently does not support controller, please download the Mac/Window build to play with a controller]</p>\n<p>[**PLAYING WITH A CONTROLLER IS HIGHLY RECOMMENDED...**] </p>\n<p>If you are to use a controller the layout of the judgement bar (the four bottom boxes) is as follows:  </p>\n<p>Left stick up, Left stick down, Right stick down, Right stick up.   </p>\n<p>Think of it as a split between the four lanes down the middle where the left and right two lanes represent the left and right analog sticks respectively.   </p>\n<p>The direction in which you flick the analog stick is also laid out to mimic natural thumb movement: you flick your thumbs inward to hit the two middle lanes of notes, and you flick your thumbs outward to hit the two outer lanes of notes.  </p>\n<p>Since this is a play-test mode you can reset the beat map by pressing \"R\" on the keyboard, and rewind and fast forward using \"A\" and \"S\" (1 measure of the song) or \"Q\" and \"W\" (4 measures of the song). You can also press \"Space\" to pause the song.</p>\n<p>Much is to be optimized down the line so any play-testing feedback would be great!  </p>\n<p>Thanks for playing our game!</p>", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T19:56:36", "background_image": "https://media.rawg.io/media/screenshots/31d/31d77af3e46429cfa52b11edab7bc6e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["Zxgnjason"], "genres": [], "publishers": [], "esrb_rating": null}