{"id": 789286, "slug": "typing-turret", "name": "Typing Turret", "name_original": "Typing Turret", "description": "<p><strong>WARNING<br/></strong>game in early alpha, no testing or debugging has been done on this version of the game. it barely even functions, give it a break when it eventually is a pile of sh*t<br/></p>\n<p>Typing turret is an asynchronous local co-operative rogue-like apocalyptic typing game.</p>\n<p>The game is split into two roles. A survivor, and a typist.</p>\n<p>The typist plays on keyboard, each zombie perusing the player has a name tag, containing a random word from a large list. The typist simply has to type out this word to damage the zombies.</p>\n<p>The survivor is the one in charge of maintaining the turret. Giving it ammo, clearing jams(they cant shoot if they make too many mistakes) and carrying it foward on the level.</p>\n<p>The ui is as follows:<br/>top right: survivor's ammo, and survivor health</p>\n<p>low left: turrets ammo, and mistake counter.</p>\n<p>when the survivor picks up ammo from the level, it goes into survivor ammo, then the survivor presses maintain when next to the turret to move it to the turret ammo.</p>\n<p>Controls are as follows:</p>\n<p>A: grab turret</p>\n<p>B: pick up bullets and health packs</p>\n<p>Y: move bullets to the turret, and fill mistakes bar</p>\n<p>X: drop turret</p>\n<p>Joystick/dpad: move</p>\n<p>controls are bound for xbox only, for dualshock controllers, use ds4windows<br/></p>\n<p>Thanks for playing my game.</p>\n<p>Game does not restart. Once the game ends, press ESC on keyboard to quit the game, and launch the exe again to restart.</p>\n<p>the game is currently in beta. control binding is not available. all art and assets by boltsnfrosty. im never gonna give you up. if you publicly find this game, im sorry for you. im never gonna let you down. spam f4 while holding dpad down to get the secret ending. never gonna run around. this game is easy to softlock, for minimal risk.<br/><br/>Never drop the turret while passing through the forcefeild. and kill zombies to prevent your ram from filling up.<br/><br/></p>", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T20:49:19", "background_image": "https://media.rawg.io/media/screenshots/3e8/3e8692b655b9047f956142bae7dea30e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tundra Studios"], "genres": [], "publishers": [], "esrb_rating": null}