{"id": 789471, "slug": "povest-o-karlove-moste", "name": "Pověst o Karlově mostě", "name_original": "Pověst o Karlově mostě", "description": "<p>Jako školní projekt jsme měli vytvořit hru za pomocí Charles Games Enginu, který pracuje s videem a lze s ním tvořit vizuální novely. Já jsem se rozhodla natočit záběry ze zasněžené Prahy a vyprávět pověst o stavbě Karlova mostu. Ve hře je možné přecházet z jedné křižovatky na druhou (ty jsou na mapce vyznačeny tmavě hnědou barvou), povídat se se sochami, kachnami a občany za zavřenými dveřmi (na mapce růžově vyznačeny). Hra má český dubing, za který vděčím své rodině a všechny rozhovory jsou vedeny humornou formou. Příběh hry je lineární, protože se snažíme odhalit skutečnou pověst, nicméně dialogy se větví, takže hráč má jistý vliv na hru a třeba i na délku dialogu.</p>\n\n<p>Časový limit, který jsme mohli do hry investovat byl 25 hodin, takže hra není zcela dodělaná - chybí mapka pro zobrazení a nějaké nápovědy. Navíc má hra pár chyb, které se mi bohužel nepovedlo najít během tohoto limitu (například problikávání videí). Ráda bych tuto hru v budoucnu dodělala a přidala i anglické titulky.</p><p>Hra má skoro 2GB, takže je ke stažení z externího odkazu. Přidávám ke stažení i game design document, nicméně, pokud si nechcete nechat vyzradit příběh, tak bych do něj nekoukala ;)</p><p>Budu ráda za jakýkoliv feedback a doufám, že se vám hra bude líbit :)</p>", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T22:11:36", "background_image": "https://media.rawg.io/media/screenshots/9eb/9ebd07a0fcc594a0176e682607abec1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tereza Kadlečková"], "genres": [], "publishers": [], "esrb_rating": null}