{"id": 789469, "slug": "kfc-madness-20", "name": "KFC Madness 2.0", "name_original": "KFC Madness 2.0", "description": "<p>LORE</p>\n<p>KFC MASTER = ENEMY</p>\n<p>CHAD = YOU</p>\n<p><strong>KFC MASTER looked at the warped knife in his hands and felt concerned.\r\n</strong></p>\n<p><strong>He walked over to the window and reflected on his dull surroundings. He had always loved rural Florida with its gifted, great Good Building Quality. It was a place that encouraged his tendency to feel concerned.\r\n</strong></p>\n<p><strong>Then he saw something in the distance, or rather some<em>one</em>. It was the figure of Chad 100. Chad was a clumsy monster with solid elbows and grubby moles.\r\n</strong></p>\n<p><strong>KFC gulped. He glanced at his own reflection. He was a brave, helpful, brandy drinker with curvy elbows and fluffy moles. His friends saw him as a gifted, great god. Once, he had even rescued a mashed disabled person from a burning building.\r\n</strong></p>\n<p><strong>But not even a brave person who had once rescued a mashed disabled person from a burning building, was prepared for what Chad had in store today.\r\n</strong></p>\n<p><strong>The hail pounded like running men, making KFC angry.\r\n</strong></p>\n<p><strong>As KFC stepped outside and Chad came closer, he could see the grubby smile on his face.\r\n</strong></p>\n<p><strong>\"I am here because I want The KFC Back,\" Chad bellowed, in an intuitive tone. He slammed his fist against KFC's chest, with the force of 5873 ostriches. \"I frigging hate you, KFC MASTER.\"\r\n</strong></p>\n<p><strong>KFC looked back, even more angry and still fingering the warped knife. \"Chad, welcome home, son,\" he replied.\r\n</strong></p>", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-05-20T22:09:45", "background_image": "https://media.rawg.io/media/screenshots/e55/e551fbb010839e8f2e62defc8106802a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tusieklkenny"], "genres": ["Shooter", "Simulation", "Fighting"], "publishers": [], "esrb_rating": null}