{"id": 7898, "slug": "replica-a-little-temporary-safety", "name": "Replica: A Little Temporary Safety", "name_original": "Replica: A Little Temporary Safety", "description": "** Winner of Impact Award at IndieCade 2016, Honorable Mention for Excellence in Design from Independent Games Festival(IGF) 2017, Grand Prix Award at Taipei Game Show 2017, Excellence in Narrative Award at BIC Festival 2016, Best of Narrative Award &amp; Best of Game Design Award at Indie Stream Fes 2016 **<br/><br/>Replica is an interactive novel game played through a cellphone and social media. <br/><br/>______________________________________<br/>Story<br/><br/>\"This country needs more than a building right now. It needs hope.\" - Evey Hammond<br/><br/>You are given a cellphone of an unknown owner. <br/>You must look for evidence of terrorism by hacking into the cellphone owner's account, under governmental coercion. Then inspecting the cellphone usage history and social media activity records.<br/>The insane experience of peeping into someone's private life through a cellphone will transform you into the state's greatest patriot.<br/><br/>______________________________________<br/>Reviews<br/><br/>“Replica is a detective game about privacy, investigation, moral dilemma.”, PC Gamer<br/><br/>“The sinister, clever Replica is Papers, Please but with iPhones instead of passports.”, Rock Paper Shotgun<br/><br/>“More than an interactive game, Replica gives you a whole new experience. Its genious idea and intense atmosphere making this game shockingly great.”, INDIENOVA <br/><br/>______________________________________<br/>Features<br/><br/>12 Multiple Endings <br/>8 Achievements<br/>12 Languages supported (English, Italian, Japanese, Chinese, Spanish, Turkish, Polish, Korean, German, Russian, French, Brazilian Portuguese)", "metacritic": null, "released": "2016-11-14", "tba": false, "updated": "2019-10-22T14:29:36", "background_image": "https://media.rawg.io/media/screenshots/4cc/4cc7b79b963f6afa57888bc60b882f0c.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zero Rock Entertainment"], "genres": ["Adventure", "Puzzle"], "publishers": ["Zero Rock Entertainment"], "esrb_rating": null}