{"id": 78985, "slug": "pickers-hd-full", "name": "Pickers HD (Full)", "name_original": "Pickers HD (Full)", "description": "Get ready for the ultimate treasure hunt!   Your shop, Rusted Gold, has shelves to fill, auctions to run, and money to make—and you can only do that with the best finds.  <br/><br/>Check out the dozens of locations from run-down farms to back road antique shops to abandoned storage units to see if you can stumble upon your next great treasure.  What do you do once you’ve found something?  Shine it up or sell it as is to see if you can turn a profit, or if you hit bust.  Haggle with crazy characters as you try to build your reputation for having the best picks around and learn more about what makes each person tick.  Consult with an expert to avoid being hoodwinked!  Combine items to increase their values and learn how to increase your odds along the way.  <br/><br/>Price your picks to sell them in your shop, or take your chances on the auction block to see if you can make an even bigger profit!  <br/><br/>FEATURES<br/><br/>Fill the shelves of Rusted Gold to try to turn a profit<br/>Check out 12 cool locations and the nooks and crannies of each one to find your next great pick!<br/>Meet America’s quirkiest characters and try to haggle them down<br/>Build up your reputation for being the best Picker around<br/>Combine items you find to turn an even bigger profit!<br/>Don’t be fooled—consult an expert to appraise your items<br/>Unique combination of Adventure, Resource Management, and Hidden Object game play<br/><br/><br/>……………………………………………………………………………………<br/>Visit us on the App Store at http://itunes.apple.com/us/artist/mumbojumbo/id312416866<br/>to find more amazing casual games from MumboJumbo including: the Luxor Series, Midnight Mysteries Series, 7 Wonders Series and more! <br/><br/>Find us on Facebook: http://www.facebook.com/MumboJumboGames <br/>Follow us on Twitter: @MumboJumboGames<br/>……………………………………………………………………………………", "metacritic": null, "released": "2012-03-23", "tba": false, "updated": "2019-10-22T14:23:42", "background_image": "https://media.rawg.io/media/screenshots/122/12277e6b6bb41e45dbf0a32850cd72c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MumboJumbo"], "genres": ["Strategy", "Simulation"], "publishers": ["MumboJumbo"], "esrb_rating": "Everyone 10+"}