{"id": 789917, "slug": "monstopia-chronicle-of-jades", "name": "MONSTOPIA: Chronicle Of Jade's", "name_original": "MONSTOPIA: Chronicle Of Jade's", "description": "‘MONSTOPIA : Chronicle of Jade's’ is a strategy defense game with the purpose of making a lot of money by helping ‘Jade’, <br/>a cat merchant who sinned and was scored by the roots of Yggdrassil.<br/><br/>After catching monsters and growing them, we need to kill the ‘Cat Soldier’ who tries to ruin the store of ‘Jade’.<br/>Please help Jade kill the vicious Cat Soldier.<h3>1 . Capture and Grow Monsters.</h3> - You can ‘capture’ the ‘wild monsters’ that appear on each stage to make Jade’s colleague, and create more powerful monsters through ‘growth’.<br/>   Please grow your monsters strong and kill the warriors who are coming in quickly.<h3>2. Collect and Build</h3> - There are various items to be collected on the map, and you can build a building using items acquired through collection.<br/>   Each building has its own special abilities, and it also helps defend Jade’s shop.<br/>   Build a building and unleash more strategic tactics.<h3>3 . Kill and Win the Loot</h3> - If You Kill A Warrior, You Can Earn A Loot.<br/>   Loot can be used for monster capture &amp; growth, building construction &amp; upgrade, and more.<h3>4 . Win and Save Money</h3> - You can earn money if you win the stage. Win the stage quickly and earn more money.<h3>5 . Complete the Way</h3> - The drawing provides information about monsters or items acquired by the stage, and the warriors who killed them.<br/>   Uncover the hidden stories of over 100 characters and items.<br/><br/>Jade is waiting for you to make yourself rich. Use monsters and buildings to lead Jade to win!<br/><br/>", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2022-05-23T05:35:45", "background_image": "https://media.rawg.io/media/screenshots/d2f/d2f16ff8bb0230be5e5280662183e69f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Team2"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Game Team2"], "esrb_rating": null}