{"id": 789958, "slug": "virtual-circuit-board", "name": "Virtual Circuit Board", "name_original": "Virtual Circuit Board", "description": "<strong>Virtual Circuit Board</strong>, or <strong>VCB</strong>, is a minimalist sandbox drawing-based logic simulator featuring an assembler and a powerful simulation algorithm. All of it designed to allow you to be free to build and experiment with logic circuits to your heart’s content.<br/><br/><h3>A Sandbox Experience</h3>Being <strong>exclusively a sandbox game</strong>, in <strong>VCB</strong> you will set your own goals of what and how you want to build, this comes with the assumption that you already have some basic knowledge about logic gates. Knowing programming concepts will also help you to build advanced computers using the assembler, although it is by no means mandatory, designing by drawing is just as fun! It is up to you to decide how you want to create things in <strong>VCB</strong>.<br/><br/><h3>Powerful Simulation</h3>High-performant deterministic simulation with adjustable speed and the ability to pause and advance by steps. Simulate with a frequency of up to <strong>millions of updates</strong> per second.<br/><br/><h3>Assembler</h3>Assembly editor where you can define <strong>your own instructions</strong> to create a program that will be assembled to a <strong>Virtual Memory</strong> that can be accessed by the circuit.<br/><br/><h3>Editing and Simulating</h3>Working in <strong>VCB</strong> is divided in two modes, while <strong>editing</strong> you can use the drawing tools to modify your circuit, and the assembly editor to write any programs, and during <strong>simulation</strong> you can see your circuit running and visualize the instructions being executed in the assembler.<br/><br/><h3>Drawing-based Interface</h3>Build circuits by drawing <strong>color-coded entities</strong> like logic gates and traces, and use the specialized tools such as the <strong>Array</strong> to optimize your workflow by drawing multiple traces simultaneously. Both the electronic components and the traces support multiple input and output connections.<br/><br/><h3>Decoration</h3>Customize the appearance of circuits by drawing in the <strong>Paint Layers</strong> that override the component's default colors. This allows you to create things such as buttons and labels that change appearance depending on the component's state.<br/><br/>", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T06:27:55", "background_image": "https://media.rawg.io/media/screenshots/426/42643cb426fda8d55f7c4900e2a41fe4.jpg", "website": "https://www.virtualcircuitboard.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 14, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Reverie Foundry"], "genres": ["Simulation"], "publishers": ["Reverie Foundry"], "esrb_rating": null}