{"id": 789943, "slug": "news-reacts", "name": "News Reacts", "name_original": "News Reacts", "description": "<h3>A game with funny details</h3><br/><br/>News Reacts is an open world game about surviving in a slightly weird city where the player is an ordinary young man finding himself accused as a terrorist.<br/><br/>Wherever he goes, he is treated as the most wanted enemy of the state. He has to escape the law enforcement, special forces and sometimes panic-stricken citizens.  The news media disinformation makes circumstances more and more complicated.<br/><br/>The player has to solve why and who has set him up as a terrorist. When doing this the player meets action at every turn. The player has to survive only with his own brain and with NO weaponry.<br/><br/>The city is full of interiors, shops, restaurants, offices, apartments and places to go. Thousands of doors, cabinets and lockers to open and examine. Thousands of items to operate, pick up, eat or buy.<br/><br/><h3>Exceptional features</h3> <br/><br/>The News Reacts has no traditional game missions, things just happen when the player enters the wrong place at the wrong time.<br/><br/>The city items are highly interactive where only mouse clicking is needed, NO confusing menu jungle!<br/><br/>Hundreds of ads and signboards can be replaced by the user with any pictures found in the user's own computer.<br/><br/>3D modelled computers all over the city have fully functional browsers that can be operated directly in the game's 3D space.<br/><br/>Every time the game is started, some items in the city may have changed.<br/><br/>Citizens's business, opinions, hobbies and their human errors show lots of comical characteristics.<br/><br/>You can find a lot of references to the details of famous movies and popular culture.<br/><br/>In 'movie mode' you can enjoy the game view without any maps, score points etc.", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T06:07:29", "background_image": "https://media.rawg.io/media/screenshots/626/6260a9dca3f70ac42a50ad1c02e09a7e.jpg", "website": "http://www.newsreacts.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tutanet Games"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Tutanet Games"], "esrb_rating": null}