{"id": 789981, "slug": "the-use-of-life", "name": "The Use of Life", "name_original": "The Use of Life", "description": "The Use of Life is a “game book”-style multi-ending RPG.<h3>Scenarios with changing conclusions in The Use of Life</h3>In this game the main character’s various “attachments” fluctuate in accordance with the choices the player makes, changing the character’s way of thinking. The ending you experience changes depending on “the use of life” you choose through your journey.<br/><br/><br/><br/>Will the main character uses their “life” for their own good, or for the benefit of others? This all depends on the decisions and choices you make as the player. The game’s ending represents the natural conclusion of the way this life was lived, and there is no “good ending” or “bad ending”.<h3>Tense battles based on the theme of “stillness and motion”</h3>The battles in this title are characterized by a fusion of \"command-style battle strategy\" and \"QTE action\".<br/><br/><br/><br/><br/>With both sides acting three times per turn, the player must work out \"How will I handle the enemy's powerful attacks?\", and \"How will I execute a devastating blow?\" Victory will be determined by your skills and strategies.<br/><br/>This is a game in which even if you aren’t able to defeat an enemy at first, you will learn how to fight them appropriately and win after a few tries. For the boss battles in particular, we aim to create a game where you can overcome the tension of “life or death” and enjoy a sense of accomplishment once you’ve defeated a powerful enemy.<h3>”Game book”-style events</h3>In this game, events proceed with a unique game book-style narration, sometimes using TRPG-like dice rolls to decide outcomes as various events unfold.<br/><br/><br/><br/>Even contents of the same event can change based on the various actions you take, the decisions you make, and their outcomes.<br/><br/><br/><br/>It is up to you as the player to decide whether to play it safe and proceed with caution, or to go full-on and throw yourself into battle with reckless abandon.<br/>These actions will also affect the way the main character thinks.<h3>Character customization</h3>The main character, having acquired power via a certain curse, is able to enhance any skill of his choosing by coming into contact with “death”. The success rate of each event will change depending on which abilities are more honed, which will greatly affect not only battles but also normal events.<br/><br/><br/><br/>Additionally, various skills can be learned by increasing his level and upgrading his class.<br/><br/><br/>----------------------------------------------------------------<br/>・The \"Fighter\" carves up enemies with pure physical attack power and a high number of moves<br/>・The \"Samurai\" unleashes unabashed power for fierce critical strikes<br/>・The \"Mage\" specializes in high-risk, high-reward super-firepower using magical chants<br/>・The \"Sorcerer\" toys with their opponent by utilizing special attacks such as status ailments<br/>----------------------------------------------------------------<br/>Myriad fighting styles can be utilized depending on the class you choose to upgrade.<h3>A “good new” type of JRPG</h3>While this title is technically a JRPG, we are not aiming for a \"good old JRPG\" style, but rather a \"good 'new' JRPG\" style, in hopes of showing that this kind of evolution is absolutely possible.<h3>■Early Access Ver. Features</h3>①Play even further through the story than the trial version.<br/>②The Early Access version is for the purpose of making the game more fun to play.<br/>  In Early Access, developers can experiment by implementing elements they'd like to try out, and then using the feedback received from users to develop/improve the full version.<br/>③Players who have purchased the Early Access version will be able to receive and switch to the full version upon completion and release.<br/>④Since it's cheaper than the full version, it's a better deal than purchasing the game after official release.", "metacritic": null, "released": "2022-05-21", "tba": false, "updated": "2022-05-23T06:56:25", "background_image": "https://media.rawg.io/media/screenshots/4bf/4bfa272f3bfd3037ef5824f037487afe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 3}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 433, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["だらねこげーむず/Daraneko Games"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Playism"], "esrb_rating": null}