{"id": 789973, "slug": "change-district", "name": "Change District", "name_original": "Change District", "description": "<strong>Change Distric</strong>t is a sprawling RPG where you take control of a faction known as the TechieFae, a people in pursuit of uniting all of Kingeia. 5 other kingdoms and races field armies of their own, and legions of monsters roam about inbetween. To field your journey, you'll have to collect items and armor, level up and recruit a massive army to fight goes in your path. The game features the ability to convert enemy units into more of your own, as well as the possibility of losing members and having them locked into copies essentially of the units they face. The combat is fairly linear, onscreen and automatic giving you just enough control to manage it's flow. <br/><br/><br/>Features:<br/><br/>- Combat is automatic, onscreen and continous. Engage foes and scurry about!<br/>- Loot, treasure, recovery items, armors and weapons are found throughout.<br/>- You start out by in your own base camp.<br/>- You take control of a faction known as the TechieFae with its own units.<br/>- You can collect items, members and train, leveling them up and giving them equipment. <br/>- You can even convert your units into a different stronger class or clone them.<br/>- You also gain XP by fighting foes and doing various other things<br/>- XP can either be used to transform enemies into more party units for you, or to purchase Skills.<br/>- There are 5 other factions with their own bases and locations.<br/>- Each faction and their units has unique units.<br/>- Each faction has a distinct personality when they convert and brainwash you into their mental state.<br/>- There are a total of over seven regions to explore, from cliffsides, to swampy marshes, to mechanical factories to the hellish Afterworld.", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T06:46:49", "background_image": "https://media.rawg.io/media/screenshots/095/0957562b9672c2beb999910478ddf5aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Brandygang"], "genres": ["Adventure", "RPG", "Strategy", "Simulation"], "publishers": ["Project Mercury"], "esrb_rating": null}