{"id": 789938, "slug": "karagon-prelude", "name": "Karagon: Prelude", "name_original": "Karagon: Prelude", "description": "<h3>This is a free to play prelude for the full game Karagon!</h3>Experience the start of Karagon in this free to play prelude!<br/><br/>The prelude includes an area of the full map and the first few progression tiers in the game. Most of the core features listed below are available in the prelude.<br/><br/><strong>Survive, shoot, construct, and ride killer elemental robots.<br/>Explore multi-floor buildings, craft equipment and obtain schematics, progress through technology tiers, build a base.<br/>Alone or with friends in this post apocalyptic open world survival robot riding crafting shooter game!</strong><br/><br/><ul><li><strong>Survive</strong> against robotic creatures using your crafted guns and constructed rideable robots! Dangerous robots will try to take you down with melee attacks and plasma lasers.<br/></li><li><strong>Craft</strong> guns, swords, tools, armor, workbenches and forges from technology you unlock and schematics you obtain! Gather natural resources and collect machine parts from fallen robot parts and destroyed robots.<br/></li><li><strong>Multi-floor buildings</strong> with killer robots and countless unique loot and equipment schematics await. You'll find single houses, multi-floor sky high buildings, tents and garages, bus stations, robot upgrade stations, portals, and more.<br/><br/><br/></li><li><strong>Explore &amp; Progress</strong> through a apocalyptic open world filled with discoveries and dangerous robots. Choose your path to becoming the strongest as you progress through technology tiers and become strong enough to face new exciting areas and robots.<br/></li><li><strong>Construct &amp; Ride</strong> killer robots from scanned robots and resources you collect and craft. Weaken robots to scan and reconstruct! Shoot robots in the weakest spots to make them fall off and cause a lot of damage, or ride your robots and use them to attack!<br/></li><li><strong>Build</strong> your base to store and protect your items, machines, and robots. Alternatively you can also take over existing buildings.<br/><br/><br/></li><li><strong>Elemental</strong> robots and elemental guns &amp; swords (Fire, Frost, Shock, Sharp) will be crucial to your journey, but will you be strong enough to obtain them?<br/></li><li><strong>Rare Exciting Occurrences</strong> await you in the world, from dark constructor storms to 4 unique rare variations of each robot (which you can scan and construct), you'll always be surprised by what you might find.<br/></li><li><strong>Singleplayer &amp; Multiplayer:</strong> join a community server or get your friends to survive the robots and explore the world with you.<br/></li><li><strong>UE5 Lumen:</strong> experience cutting edge UE5 lumen global illumination and reflections technology: this means the graphics will look better than ever before in this next generation game!</li></ul><h3>WISHLIST THE FULL GAME</h3>https://store.steampowered.com/app/1818610/Karagon/?snr=1_5_1100__1100<br/>Discord Server", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-08T16:51:33", "background_image": "https://media.rawg.io/media/screenshots/adc/adc47a9e01a9cb21d6d8d5f80f3ef8ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tbjbu2"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Tbjbu2"], "esrb_rating": null}