{"id": 790024, "slug": "world-of-chess-3d-pro", "name": "World Of Chess 3D (Pro)", "name_original": "World Of Chess 3D (Pro)", "description": "***************************************<br/>- Board Games, Brain Games, IQ Games supported:<br/>***************************************<br/><br/>*************<br/>* Chess 3D   * https://en.wikipedia.org/wiki/chess<br/>*************<br/> • Chess 3D Animation : Real Battle Chess 3D Online is meaningful three-dimensional chess , use strong chess engine and LibGDX framework. Combat oriented game mechanics, complete with richly animated game pieces.<br/> • Chess is a two-player strategy board game played on a checkered board with 64 squares arranged in an 8×8 grid.The game is played by millions of people worldwide. Chess is believed to be derived from the Indian game chaturanga sometime before the 7th century. Chaturanga is also the likely ancestor of the Eastern strategy games xiangqi (Chinese chess), janggi (Korean chess), and shogi (Japanese chess). Chess reached Europe by the 9th century, due to the Umayyad conquest of Hispania. The pieces assumed their current powers in Spain in the late 15th century; the modern rules were standardized in the 19th century. <br/><br/>****************<br/>* Go (game) 3D  * https://en.wikipedia.org/wiki/Go_(game)<br/>****************<br/> • The word \"Go\" is derived from the full Japanese name igo, which is derived from its Chinese name weiqi.<br/> • The Korean word baduk derives from the Middle Korean word Badok, the origin of which is controversial; the more plausible etymologies include the suffix \"dok\" added to \"Ba\" creating the meaning \"flat and wide board\", or the joining of \"Bat\", meaning \"field\", and \"Dok\", meaning \"stone\". Less plausible etymologies include a derivation of \"Badukdok\", referring to the playing pieces of the game, or a derivation from Chinese 排子, meaning \"to arrange pieces\".<br/><br/>*************<br/>* Xiangqi 3D * https://en.wikipedia.org/wiki/Xiangqi<br/>*************<br/> • Xiangqi (Chinese: 象棋; pinyin: xiàngqí; English: also called Chinese chess, is a strategy board game for two players. It is one of the most popular board games in China, and is in the same family as Western (or international) chess, chaturanga, shogi, Indian chess and janggi. Besides China and areas with significant ethnic Chinese communities, xiangqi is also a popular pastime in Vietnam, where it is known as cờ tướng.<br/><br/> • The game represents a battle between two armies, with the object of capturing the enemy's general (king). Distinctive features of xiangqi include the cannon (pao), which must jump to capture; a rule prohibiting the generals from facing each other directly; areas on the board called the river and palace, which restrict the movement of some pieces (but enhance that of others); and placement of the pieces on the intersections of the board lines, rather than within the squares. <br/><br/>- Featuring:<br/> • online Game<br/> • 1000 Chess Puzzles Game (End Games)<br/> • 1000 Xiangqi Puzzles Game (Endgame)<br/>• 3D richly animated game pieces.<br/>• 8 AI levels (3000 Elo)<br/> • use book<br/> • Free rotate camera.<br/> • Real time chat", "metacritic": null, "released": "2016-05-20", "tba": false, "updated": "2022-05-23T07:36:29", "background_image": "https://media.rawg.io/media/screenshots/065/065c4ac27e1abbadabdb5cc03ffe2e1b_5nE0KGl.jpg", "website": "https://v-game.us", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vuong Tai"], "genres": ["Strategy", "Board Games"], "publishers": ["Vuong Tai"], "esrb_rating": "Everyone 10+"}