{"id": 790003, "slug": "city-car-simulator-2022-games", "name": "City Car Simulator 2022 Games", "name_original": "City Car Simulator 2022 Games", "description": "Ultimate Car Driving Game is Here!! Now you can play every car game including crazy car stunts, advance car parking and open world city car driving all in one game. There are different modes for each car game. Polish car parking games skills along with crazy car stunt in this car driving simulator. This realistic city car driving brings the most exotic cars with detailed interiors for you. You can customize each car with great detail.<br/><br/><br/><br/>Crazy Car Stunts: Impossible Tracks<br/>Crazy car Simulator offers you the best of all car games including crazy stunts ,speed stunts and car racing. In this mega ramp car games, you will experience stunt car jumping. In this top speed car games, select your favorite racing car like extreme car simulator and drive freely on impossible tracks in crazy car driving games. Burn up the impossible tracks with the fantasy and most stunning crazy car driving simulator 2. A car driving game will drive you crazy. The sickness of car driving games with impossible car stunts will fulfill in the game. Come towards the objectives of crazy car stunts game with impossible tracks is recommended for you to understand the missions and objectives in this offline stunt driving games. Keep driving with no fear upon difficult tracks and hot tracks in crazy car stunt.<br/><br/><br/><br/>Huge Open World Environment<br/>Open world city is designed in a creative way to test your extreme car driving skills and provide the best gameplay experience. This car games 2021 offer great high quality city with pedestrian and traffic cars. This is a realistic new games car with detailed animated city where you can drive your supercar around. How does a car simulator sound in the open world games category? We know it's exciting and the good news is: we've done it! You can start steering in the open world right away!<br/><br/><br/><br/>Crazy Car Stunts: Impossible Tracks<br/>Crazy Car Simulator offers you the best of all car games including crazy stunts ,speed stunts and car racing. If you are into new car games 2021 where you can enjoy Mega Ramps with Ultimate races then download this offline game 2021. In this top speed car games, select your favorite racing car like extreme car and drive freely on impossible tracks in crazy car driving games. Download now this mega ramp game, this game is a car stunt game. Get now this offline game 2021 if you like playing car jumping games. There are several types of cars in this new game 2021 where you can enjoy car stunt races. This stunt car game - car driving simulator will make the users professional player of car racing games. Come towards the objectives of crazy car stunts game with impossible tracks is recommended for you to understand the missions and objectives in this offline stunt driving games. Keep driving with no fear upon difficult tracks and hot tracks in crazy car stunt.<br/><br/><br/><br/>Cars Customization<br/>This Crazy car game has high quality cars with detailed interior of each car. Also each car has its real world sound. So enjoy the realistic city car simulator with super cars. You can customize supercars according to your choice. Specially designed vinyls &amp; car paints are available. You can adjust suspension and chamber in this car game.<br/><br/><br/><br/>Advance Car Parking<br/>New Car Parking Game starts a new era of Car parking simulation game play with super stunning graphics and challenging multi-stage levels. Burn up the city with the fastest and most visually stunning car driving game and car parking games 2021. In this free car parking game, you won’t need any special skills; you will improve your driving and parking skills as you level up. It is a great time-killer game; make your free time fun time by playing these free car games. You can set the camera angle by swiping on-screen: up, down and left, right. Zoom in and out by double touch.", "metacritic": null, "released": "2021-12-14", "tba": false, "updated": "2022-05-23T07:17:06", "background_image": "https://media.rawg.io/media/screenshots/b51/b5195c3a440b591de5a9f3d7ddc9225a_hhWwfrS.jpg", "website": "https://web.facebook.com/codeXsolutionsinternational", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rehan Abdul Qayyum"], "genres": ["Sports", "Racing"], "publishers": ["Rehan Abdul Qayyum"], "esrb_rating": "Everyone 10+"}