{"id": 790088, "slug": "spell-unka-demo", "name": "Spell Unka (Demo)", "name_original": "Spell Unka (Demo)", "description": "<p>'Spell Unka' is a retro style platform exploration game demo based on the classic arcade cabinet games of the early 80's.<br/></p>\n<p>Inspiration has been taken from classic such as Pitfall and of course Spelunker and 80's / 90's movie, TV and game related references can be seen throughout. </p>\n<p>You play as Cavin' Colin an underground adventurer who, whilst exploring in the deepest, darkest jungles of Peru, has uncovered the entrance to the ancient temple of UNKA...</p>\n<p>Who or what are the UNKA?</p>\n<p>Only the bravest of adventurers will uncover that secret! </p>\n<p>The game is being developed using Gdevelop5 and started out as just a test of my abilities to create games, it was never intended to be a full release, however I am beginning to get attached to it and am considering continuing on...</p>\n<p>Even though I know that I have an awful long way to go to make a finished project if I do decide to complete it, I'd love to hear what you guys think!<br/></p>\n<p>Feedback is extremely important to me, firstly to see whether you enjoy what I have created so far, but also to find out ways in which to improve, not only this project, but also any future game development that I may undertake.</p>\n<p>Thank you for reading this, if you decide to try the demo out then thank you for playing and I hope that you enjoy it!</p>\n<p>I'm sure there will still be a few glitches and the fullscreen toggle is currently not working as stated on screen...</p>\n<p>Please let me know any other bugs and issues that you may encounter whilst playing the game and I will try to iron them out.<br/></p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-23T08:00:35", "background_image": "https://media.rawg.io/media/screenshots/09b/09bce78f9ab081897044bb07e03ad58a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spexxy"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}