{"id": 790016, "slug": "raid-boss-a-guilds-journey", "name": "Raid Boss: A Guild's Journey", "name_original": "Raid Boss: A Guild's Journey", "description": "Be the boss of your own guild! Your guild is waiting for you!<br/><br/><br/><br/>Building a guild isn't easy and those raid bosses aren't going to defeat themselves. It’s up to you to grow your guild and defeat the epic raid bosses that await you! Don't worry though, there are lots of new Guild Members waiting for you to recruit them. Recruit and train your Guild Members to take on challenging battles. Do you have what it takes to lead your Guild Members to victory? Can you become the best guild on the server and conquer the ultimate challenge ― the Lich King!?<br/><br/><br/><br/>Remember those days in a classic mmorpg where you raided with 10-, 20-, 40-person raids!? Relive those glorious battles in Raid Boss. You can control not just 1-5 Guild Members like all the other games out there; control up to 20 of your Guild Members in battle AT ONCE in innovative real-time squad combat.<br/><br/><br/><br/>It isn't just the raids that make a mmorpg awesome. It’s the players. Each Guild Member in Raid Boss has a unique personality that’s inspired by real mmo players. There’s DruidJenkins, the healer that is way too aggro; GarbageDeeps, the power-tripping guild officer; TheRedDragon, who thinks this is an RP server; and Uther, who always rolls greed when loot drops. Over 40+ Guild Members and growing! Come play a character collector like you’ve never seen before.<br/><br/><br/><br/>***GAME FEATURES***<br/><br/><br/><br/>[Be the Boss]<br/>Start your very own guild and fight your way to become the best in this role playing fantasy game inspired by mmos!<br/><br/><br/><br/>[Real-time Multi-squad Combat]<br/>Battle with up to 20 Guild Members AT ONCE in real-time! Each squad has 3-8 Guild Members but it’s up to you to control your squads. You choose where to move, how to dodge, and when to execute Super Abilities at the perfect moment. Real-time strategy has never been seen this way on mobile before!<br/><br/><br/><br/>[Recruit and Train]<br/>Recruit from 40+ unique Guild Members and earn their trust! Each Guild Member has their own kit of 5 abilities plus a Super Ability. Each Guild Member needs equipment and weapons. They level up and tier up! And don't forget to upgrade those abilities!<br/><br/><br/><br/>[Expeditions]<br/>Come play a character collector like you’ve never seen before! Raid Boss is a fresh spin on traditional gacha and shard collector games. Expeditions allow you to earn shards offline! Send your Guild Members off and come back later to earn some new shards...all while being idle! Focus on which Guild Members you want to improve through Expeditions and Shard Shop recruitment. Earn a new ability each tier!<br/><br/><br/><br/>[Fight Epic Bosses]<br/>Battle mighty raid bosses with up to 20 Guild Members AT ONCE! Each raid boss has special mechanics for you to learn and it requires strategy and skill. Be careful! Any mistake could result in a full wipe! Dragons, zombies, golems, and many more monsters are will challenge you in this fantasy adventure.<br/><br/><br/><br/>[Alliances]<br/>Join with 30 of your friends to take on even tougher challenges as you cooperate with your alliance and be the best multiplayer alliance!<br/><br/><br/><br/>[Craft Legendary Gear]<br/>Craft equipment and weapons for your Guild Members. 300+ armor and weapons spread across 20 rarities and 17 classes! Crafting is so easy and extremely powerful! Gear up your Guild Members to unlock their maximum potential!<br/><br/><br/><br/>[Diverse Worlds]<br/>Fighting across vast worlds each with different and varied monsters and raid bosses from dragons to zombies has never been so much fun. Farm crafting materials and unique gear sets from each world to power up your guild in this fantasy adventure.<br/><br/><br/><br/>[Challenges]<br/>Challenges provide increasingly challenging puzzles that can only be solved by a specific class of Guild Member for special rewards.<br/><br/><br/><br/>[Evil Clone Tower]<br/>Fighting evil doppelgangers of Guild Members in a persistent tower where each floor presents a new tougher battle sound like a challenge? Can you make it to the top?", "metacritic": null, "released": "2021-11-07", "tba": false, "updated": "2022-05-23T07:29:15", "background_image": "https://media.rawg.io/media/screenshots/37b/37b96f14396453d287c8b5918139f7a0_djMTBap.jpg", "website": "https://pizzaclubgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pizza Club Games"], "genres": ["RPG", "Strategy"], "publishers": ["Pizza Club Games"], "esrb_rating": "Everyone 10+"}