{"id": 790251, "slug": "gemsmith-gwj45", "name": "Gemsmith - GWJ45", "name_original": "Gemsmith - GWJ45", "description": "<p>This game was made for the Godot Wild Jam #45, a challenge to make a complete game within 9 days.</p><p>The theme for the jam was: <strong>Underground</strong></p><p>The following wildcards (optional challenges) were included:</p><p>- BREATHTAKING: Include a scenic view<br/>- NEXT!: Have your character change visually after death<br/>- DEAL WITH THE DEVIL: Make a trade that you'll regret</p><p>-----------------</p><p>In Gemsmith, your clients will need gemstones for their jewellery, and you'll have to go through the whole process: from picking a crystal to jewel setting!<br/></p><p>Controls:</p><p>User interface (buttons, sliders) all via mouse</p><p>First person view:<br/>- WASD To walk<br/>- Space to jump<br/>- Mouse to look and turn<br/>- Mouse click to read, mine and use the machine<br/>- Hold SHIFT to run<br/>- ESC to release the mouse</p><p>Clients will make requests:</p><p>Of course you don't need to know all the crystals from the back of your head. There is a book full of pictures so you know what to look for in the mine:</p><p>As you find out what you need, time to go crystal hunting and mining:</p><p>But you can't take the book with you to the mine - you'll rely on your memory down there. Of course you can always go back and check again - there is no time limit.</p><p>With the right crystal on hands, time to work on it:</p><br/><p>The gem design is inspired in real world gem cutting, but simpler and easier: adjust a profile by dragging the dots, pick a few options, and the profile will be cut in several sides. You can see a stone preview in real time as you tweak! </p><p>If you did everything right, all is fine - time for next client! If you messed up, you waste the stone, but you always have time to go back to the mine and bring another one - the client will wait, don't worry.</p><p>The game has no end - apart from the mine being finite.</p><p>Music from SergePavkinMusic (Creative Commons, https://youtu.be/oEjNVO5QmOE, https://youtu.be/KzWR3FlAzec), HDRI from polyhaven, everything else is original.</p>", "metacritic": null, "released": "2022-05-22", "tba": false, "updated": "2022-05-23T09:02:09", "background_image": "https://media.rawg.io/media/screenshots/363/363a00cb194e0632cbc698b7feed6776.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Mad Parrot Studios"], "genres": ["Simulation", "Educational", "Puzzle"], "publishers": [], "esrb_rating": null}