{"id": 790307, "slug": "opposite-cubes-igyucel", "name": "Opposite Cubes (igyucel)", "name_original": "Opposite Cubes (igyucel)", "description": "<p><strong>Description:</strong></p>\n<p>Opposite Cubes is my submission for the Hisar Jam 2. It has two characters with opposing colours, one blue and one orange. Both characters can interact with the other coloured platforms. As a result, the orange character can interact with the blue platforms, and the blue character can interact with the orange ones. Both characters can interact with the white platforms. They, on the other hand, pass through their own coloured platforms. The figures can also contact and jump off of one another. You will need to consider these elements as you go through the levels.\r\n</p>\n<p>Every level has a certain number of coins that must be collected to progress to the next level. Without collecting them all, you can’t continue.\r\n</p>\n<p>When you collect all the coins in a level, you need to bring the characters to the end spot which is often indicated by the direction of the light or glowing arrows.\r\n</p>\n<p><strong>Controls:</strong>\n</p>\n<p>The w-a-s-d keys control the blue character, while the arrow keys control the orange character.\r\n</p>\n<p><strong>Tips:</strong>\n</p>\n<p>The same principle that applies to the platforms also applies to the boxes. The orange character can only push blue boxes, and the blue character can only push orange boxes.\r\n</p>\n<p>When the characters are on top of each other, you can reach great heights if you time both their jumps correctly. (While both on-air, the character on top could use the one on the bottom as a platform to jump from.)\r\n</p>\n<p>If you need to restart a level at any moment, simply press \"R.\"\r\n</p>\n<p><strong>Note:</strong>\n</p>\n<p>The credits and assets used are all listed in the game's \"Credits\" section.\r\n</p>\n<p>After downloading the game, you can extract the zip file and start playing. \r\n</p>\n<p>Good luck, and I hope you have a good time!\r\n</p>", "metacritic": null, "released": "2022-05-22", "tba": false, "updated": "2022-05-23T09:23:06", "background_image": "https://media.rawg.io/media/screenshots/af3/af3536dd40ecbd4bd0dd6e2fcffa057a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["igyucel"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}