{"id": 790382, "slug": "slava-ukraini", "name": "Slava Ukraini!", "name_original": "Slava Ukraini!", "description": "This is a game. Or rather, it is a tribute to the courage of the people and armed forces of Ukraine.<br/><br/>In Slava Ukraini!, the goal is to defend Ukraine from the Russian invasion. You will do this by chosing which battles to fight in order to delay the invasion while receiving support from friendly nations around the world. Over time, you will be given access to more weapons and equipment, while the enemy resolve is weakened by international sanctions and battlefield casualties. The game features a strategic mode and a few different tactical modes, where the strategic mode is played on a full map of Ukraine while the tactical modes (or \"battles\") are played in first person, each \"battle\" lasting only a few minutes.<br/><br/>At release time, the \"battle\" scenes of the game will be mainly about ambusing enemy columns and defending fixed positions. These battles are all played in static first person mode. The plan, however, is to keep developing the game, adding features and improving gameplay for as long as needed. More on what's being considered will follow.<br/><br/>Slava Ukraini! is completely free-to-play and contains no commercial ads. However, if you would like to support the Ukrainian armed forces, place a donation to the special fund set up by the National Bank of Ukraine.<h3>On the future of Slava Ukraini!</h3>The initial release of the game will contain mainly very short battles in static first person perspective, meaning that it's like an FPS but the player cannot move, always fighting from a stationary position. This is somewhat adequate for the ambush- and air-defence missions that will be in the initial release.<br/><br/>There are plans to add additional gaming modes, including armoured warfare gunnery and more complete FPS features. Some thought is going into adding political features and administration of humanitarian aid for the strategic mode, as well as artillery spotting, intelligence analyzing, cyber warfare components and so on. The base game is fairly modular, so the limit is set by imagination. Player requests for additional game modes will definitely be considered.", "metacritic": null, "released": "2022-05-22", "tba": false, "updated": "2022-05-27T06:18:17", "background_image": "https://media.rawg.io/media/screenshots/feb/febd0c75d2975b36cdad3866889f621a.jpg", "website": "https://thorgaming.eu/slava-ukraini/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["africacrossgames", "Thor Gaming"], "genres": ["Action", "Strategy", "Simulation"], "publishers": ["Thor Gaming"], "esrb_rating": null}