{"id": 7904, "slug": "army-antz", "name": "Army Antz", "name_original": "Army Antz", "description": "◈◈◈ #1 Strategy and #1 Action Game in US ◈◈◈<br/><br/>“A pretty whimsical art style and theme.” - Touch Arcade<br/>&amp;quot;A truly fun spin on the idea of the five versus five combat.&amp;quot;- App Advice<br/>&amp;quot;iOS App of the week.&amp;quot; - IPHONEFAQ<br/>&amp;quot;Army Antz is a Terrific Combat Game&amp;quot; - PocketFullOfApps<br/><br/>Build an epic army of Antz and GET READY to combat in the most ultimate real-time strategic action-packed game with 5 on 5 battle arena.<br/><br/>Your mission is to progress towards the enemy&amp;#39;s base, take their base flag, cut their support and invade the Queens lair. Rally with your troops till the Queen is brought down.<br/><br/>FEATURES<br/><br/>• 19 battle arenas carefully designed to be enjoyed and combat<br/>• 13 strong Antz in the cadre, each with it’s own class of weapon<br/>• 4 difficulty modes Easy, Normal, Hard and Kamikaze, increased difficulty will have the enemy become more aggressive with new behaviors<br/>• 10 support items to help your army conquer the world<br/>• 19 achievements to unlock hours of fun and a game-play to challenge your skills.<br/>• Upgrade your Antz to become more powerful<br/>• Training to get you trained before you take on the world<br/>• Watch and share replays of your strategy to hone your skills. <br/><br/>SINGLE PLAYER CAMPAIGN<br/><br/>Pave your path to take down the enemy’s Queen battle by battle for non-stop fun.<br/><br/>TWO PLAYERS MODE<br/><br/>Play with your friends on your iPad in split screen mode especially designed for iPad Pro big screen<br/><br/>CONTROLS<br/><br/>Easy to use controls, tap-to-move your army effortlessly and navigate in the battle with one finger and zoom with two fingers.<br/><br/>Want to tell us anything about your experience with the game? Reach us at info@digitalworldstudio.com", "metacritic": null, "released": "2015-11-19", "tba": false, "updated": "2019-10-22T14:29:36", "background_image": "https://media.rawg.io/media/screenshots/2cf/2cf9480df808095946ea69d78922db5a.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Digital World Studio"], "genres": ["Action", "Strategy"], "publishers": ["DIGITAL WORLD STUDIO"], "esrb_rating": "Everyone 10+"}