{"id": 7905, "slug": "corona-indie-bundle", "name": "Corona Indie Bundle", "name_original": "Corona Indie Bundle", "description": "5 HIT INDIE GAMES FOR ONLY $0.99 — $7.95 VALUE<br/><br/>Help us break 100,000 and we&amp;#39;ll unlock a 6th game!!!<br/><br/>www.CoronaIndieBundle.com<br/><br/>✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮✮<br/><br/><br/>THE SECRET OF GRISLY MANOR<br/><br/>★ Over 280,000 downloads ★<br/>★ Top 10 Ranked app in Great Britain! ★<br/><br/>*************************************************** <br/><br/>Grandpa always was a little eccentric. A fantastic engineer, he was always buried in his work, always coming up with new ideas and inventions that as a child held you wide-eyed in awe.\u2028\u2028<br/><br/>Now, after many years, you return to the house that holds so many fond memories for you, with a promise from Grandpa to show you something truly amazing. You can&amp;#39;t even begin to imagine what it could be!\u2028\u2028<br/><br/>It&amp;#39;s a dark and stormy night as you arrive at Grisly Manor. The rain beats down hard, lightning flashes in the sky as the sound of thunder fills your ears. You already feel a little creeped out, but when you make your way inside, the house is curiously empty. Grandpa is nowhere to be found!\u2028<br/><br/>But his presence is everywhere. Familiar objects have been re-engineered to create puzzles for you. Clues abound, and as each puzzle is solved, the solution to others present themselves. As well as new puzzles, of course. Grandpa obviously spent a lot of time making sure that nobody could solve the myriad of puzzles strewn about the house. Nobody but you, his favorite grandchild…\u2028<br/><br/>Can you solve the mystery of Grisly Manor?\u2028\u2028<br/><br/><br/>CHICKEN&amp;#39;S QUEST<br/><br/>★ Over 100,000 downloads! ★\u2028<br/>★ iPad Games New and Noteworthy in United States, Australia, Canada, China, Japan, Mexico, New Zealand ★<br/><br/>***************************************************<br/><br/>\u2028\u2028Once upon a time somewhere in the country, was a quiet night and nobody could image that their future would be inexorably changed.\u2028\u2028<br/><br/>Now they need your help to go back home and finally hug their mom and dad for the very first time!\u2028<br/><br/><br/>WALKABOUT<br/><br/>★ Over 250,000 downloads! ★<br/><br/>&amp;quot;A colourful and challenging puzzler that is refreshingly easy to get stuck into and surprisingly long-lasting&amp;quot; ~ Pocket Gamer. Awarded a MEDAL<br/><br/>*************************************************** <br/><br/>Queenie needs your help collecting the Magic Stars scattered throughout her kingdom. But be careful, one wrong move could leave you trapped with no way out.\u2028\u2028<br/><br/>There are 64 levels to negotiate, split across 4 regions of the kingdom. Along the way you&amp;#39;ll find keys to unlock 8 further Bonus levels. You&amp;#39;ll have to be at your best to complete them all!\u2028<br/><br/><br/>ROBOT 99<br/><br/>★ Over 40,000 downloads!<br/>★ FWA App of the Day ★<br/><br/>***************************************************<br/><br/>\u2028Robots live up in the clouds. Sometimes they might miss a step and accidentally fall down from the sky. The player&amp;#39;s goal is to rescue as many robots as possible and help them fly back home. \u2028<br/><br/><br/>FLOAT<br/><br/>★ Over 1.6 Million downloads! ★<br/>\u2028★ 4/5 AppSpy.com ★\u2028<br/><br/>***************************************************<br/><br/>\u2028\u2028Float is a game that makes you feel happy. Try to keep the balloons in the air and off the spikes. Tap, bobble, and bump your way to fun. With multiple games modes, achievements, and leader boards there is something for everyone. So what are you waiting for?", "metacritic": null, "released": "2011-10-07", "tba": false, "updated": "2019-10-22T14:29:36", "background_image": "https://media.rawg.io/media/screenshots/fb0/fb08a26f8c95c3520fd50cf38762f04b.jpeg", "website": "http://www.coronaindiebundle.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Corona Labs"], "genres": ["Arcade", "Puzzle"], "publishers": ["ansca"], "esrb_rating": "Everyone 10+"}