{"id": 79067, "slug": "worms-crazy-golf-hd", "name": "Worms Crazy Golf HD", "name_original": "Worms Crazy Golf HD", "description": "4/4 - “Must Have” - “Terrific fun that mixes classic Worms game play with golf, resulting in a hilarious and creative little game” – SlideToPlay.com.<br/><br/>9.0/10 - “Amazing” – “Worms Crazy Golf is a super blend of puzzler and strategy game wrapped up in easy-to-understand golf-themed packaging” – IGN.com.<br/><br/>9/10 – “Get it today, and make your life better.” – MobileChoiceUK.com <br/><br/>4.5/5 – “Worms Crazy Golf is, literally, a blast. It's a great spin (pun intended) on both artillery and golf titles, blending both genres together to create something that's new and different” – Gamezebo.com.<br/><br/>4.5/5 – “Worms Crazy Golf is an all-in-one entertainment pack that includes exciting gameplay, exploding worms and some very difficult obstacles to overcome on the way to a hole in one” – 148apps.com.<br/><br/>8/10 – “A remarkably generous offering from Team17. Fun, playable, and stuffed to bursting point with content” – Pocketgamer.co.uk.<br/><br/>4/5 – “Worms Crazy Golf is not only a fun golf game, but adding the charm of Worms to it, along with all the obstacles, bonuses, and utilities, makes for a really fun gameplay experience” - Appspy.com.<br/><br/><br/>Worms™ Crazy Golf HD for iPad is a hilarious mixture of the explosive action of Worms™ and the puzzle-based challenges of crazy golf! All of the trademark Worms™ humour, comic violence, and cartoon visuals are present, combined with addictive yet accessible golf gameplay. With extensive and replayable single-player options, extra iPad content with an additional 18-hole course, and hot-seat multi-player for up to 4 players, this is not just a load of balls!<br/><br/><br/>KEY FEATURES:<br/><br/>• Single player career mode   x 4 18 hole courses. Britannia, Pirate Cavern, Graveyard and Carnival – with achievements.<br/>• Single player challenge mode with leaderboards.<br/>• Hot seat multi player for up to 4 players.<br/>• Crazy golf! Navigate the hilarious holes in unique ways with interactive objects, utilities and ball spin.<br/>• Worms™ humour! Exploding sheep, teleports, ball whacking Old Women, ball stealing moles, mines, magnets and even new bats!<br/>• Customise the name, hat, club, speech and balls of your worm, and earn in game cash to unlock even more customisation options.<br/><br/><br/>APP STORE SPECIFIC FEATURES:<br/><br/>• Game Center integration.<br/>• Fast App switching.<br/><br/><br/>iPad specific features:<br/><br/>•Additional content for the iPad version – master the Carnival Course!<br/>•Crisp high definition visuals, graphical enhancements and special effects.<br/>•Flip the screen! Great for ‘coffee-table’ style play given the support of the screen orientation feature.", "metacritic": null, "released": "2011-10-18", "tba": false, "updated": "2019-07-30T03:01:35", "background_image": "https://media.rawg.io/media/screenshots/efd/efd6814080ad54c28e1c36ace44ab995.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Team17 Digital"], "genres": ["Action", "Sports"], "publishers": ["Team17 Digital"], "esrb_rating": "Everyone 10+"}