{"id": 79090, "slug": "race-illegal-high-speed-3d-free", "name": "Race Illegal: High Speed 3D Free", "name_original": "Race Illegal: High Speed 3D Free", "description": "The smell of freshly burnt rubber on tarmac, the feel of the soft leather in your hands, the sound of engines roaring and crowds cheering, open your eyes and experience racing in its purest form, get ready to take to the streets in Race Illegal.  <br/><br/>Finally the true street racing experience has arrived on your phone.  Starting your career as a rookie; you need to earn respect out there before you can challenge the best, work your way through an intense and engaging storyline to prove yourself top dog.  With 20 tracks to race, 9 cars to choose from and a whole host of customisations there’s plenty here for the petrol-head to tinker with.  <br/><br/>Real driving physics, insane drifts and nitrous boosts and some of the most visually stunning locations to drive around, Race Illegal has it all.  Check out your own driving stats and compare your times and honours with other players worldwide.  <br/><br/>Have you got what it takes to Race Illegal?<br/><br/>Game Features<br/><br/>- Amazing 3D graphics<br/>- 20 tracks and 9 cars<br/>- Car tuning and customisation<br/>- Engaging storyline<br/>- Compete in online races<br/>- Authentic street race atmosphere<br/>- Personal stats and online records table<br/>- Realistic driving physics<br/>_______________________________________<br/>Thanks for choosing Race Illegal! If you like the game, please consider rating or leaving your review. We appreciate all the feedback!<br/><br/>Keep track of HeroCraft game news and updates!<br/>twitter.com/Herocraft <br/>youtube.com/herocraft <br/>facebook.com/herocraft.games", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2019-07-30T03:13:35", "background_image": "https://media.rawg.io/media/screenshots/b1b/b1b3c1b2e3d0ebc3b43a94d6dd6706ad.jpg", "website": "http://www.herocraft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HeroCraft"], "genres": ["Simulation", "Racing"], "publishers": ["HeroCraft"], "esrb_rating": null}