{"id": 7910, "slug": "sage-fusion-2-rpg-vn", "name": "Sage Fusion 2 (RPG VN)", "name_original": "Sage Fusion 2 (RPG VN)", "description": "* Grand Prize Winner of Tizen App Challenge in Role-Playing and Strategy Games category *<br/><br/>&amp;quot;...provides you with everything a fan of the first stellar outing could have ever hoped for, and then some more.&amp;quot; - iFanzine (5.0/5.0)<br/><br/>&amp;quot;Sage Fusion 2 is an interesting game that raises some valid philosophical points and lets you shoot space thugs with dual pistols. Awesome.&amp;quot; - Capsule Computers (7.5/10)<br/><br/>&amp;quot;A well crafted RPG novel game, well executed and designed&amp;quot; - Best Tizen Apps (4.5/5.0)<br/><br/>&amp;quot;Kidalang successfully made the perfect composition between exploration and combat so that the game is not boring.&amp;quot; - Games In Asia ID<br/><br/>Set in a futuristic universe in which artificial intelligence is considered religious taboo, Sage Fusion 2 tells the adventure of a businessman and his bodyguard who descend to an underground world, trying to get back their reportedly stolen spaceship after it fell and crashed in the middle of the city—an accident behind which lies a conspiracy that involves the galactic government, the military, the church, and centuries-old historical legend.<br/><br/>Sage Fusion 2 is a hybrid between Role-Playing Game (RPG), adventure, and visual novel. This is the sequel of the previously released Sage Fusion game, and is the last chapter which concludes the story. However, the game is designed and written so that new players who haven&amp;#39;t played the first game can also play it.<br/><br/>Video trailer: www.kidalang.com/sagefusion2<br/><br/>Sage Fusion 2 builds on the story and gameplay set by the first game, and improves them in almost every aspect:<br/>- longer playtime (Sage Fusion 2 is roughly twice as long as the first game)<br/>- more areas to explore<br/>- more engaging battles and action scenes<br/>- more interesting puzzles<br/>- faster-paced story progression<br/><br/>Features:<br/>- Story as the most important aspect of the game<br/>- More than 120 hand-drawn backgrounds and story illustrations<br/>- A lot of character interactions and dialogue<br/>- Story-driven RPG gameplay with science fiction setting<br/>- RPG-style turn-based battle system with no random enemy encounters<br/>- Optimized control for touch screen – no virtual joystick<br/>- Side quests<br/>- No in-app purchase<br/><br/>* Supported devices: iPhone 4 or newer, iPod touch (4th generation) or newer, iPad 2 or newer.<br/><br/>---- <br/>Developed by Kidalang: www.kidalang.com", "metacritic": null, "released": "2013-08-14", "tba": false, "updated": "2019-10-22T14:29:36", "background_image": "https://media.rawg.io/media/screenshots/2be/2beaf9023b1a142db62eb91c797519d6_UPC862W.jpeg", "website": "http://www.kidalang.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kidalang Pte"], "genres": ["Adventure", "RPG"], "publishers": ["Kidalang Pte"], "esrb_rating": "Teen"}