{"id": 791187, "slug": "titityler-a2", "name": "Titityler (A2)", "name_original": "Titityler (A2)", "description": "<p>Titityler: A Soapy Platfohrmer</p>\n<p>In high school I drew a webcomic in which my friend Tyler was a bar of soap. Last time PJ visited home, Tyler couldn't help but notice his old friend really needed a bath. Maybe he doesn't have any soap? As Tyler, it's your job to collect 300 pennies from around the house so you can ship yourself to your old friend PJ. </p>\n<p>My goal was to make a flick-screen platformer in the style of Monty on the Run or Jet Set Willy with the advantages of new hardware, hoping to create something that's equally fresh, familiar, and fun, allowing players to earn a sense of achievement in a game that relies only on their own skill and wit. </p>\n<p>\r\nSo. Collect 300 pennies and get your bubbly butt to the mail box. \r\n</p>\n<p>\r\nWith this alpha release, I'd love to hear everything you hate about it and think needs to be fixed or changed. Then I can make list of your brilliant insights with which to mold this into a thing strangers will want to play. \r\n</p>\n<p>\n<strong>GAME CONTROLS:</strong> (should work as expected with any generic gamepad):<br/>\r\nMove with left and right (or Z and X)<br/>\r\nJump with Use key (or SHIFT)<br/>\r\ntoggle mini map with Menu Key (or M)\r\n</p>\n<p>\n<strong>DEV CONTROLS:</strong><br/>\r\nR: Reset from room (also respawns coins/resets mini map)<br/>\r\nL: Reset from Hero starting position<br/>\r\nV: toggle visibility of map layer 2<br/>\r\nH: toggles visibility of hit box<br/>\r\nO: Delete Saved Game*<br/>\r\nT: Restore Screen Resolution (in case of error display)\r\n</p>\n<p>\n<strong>GOALS FOR BETA:</strong><br/>\r\nbugs fixed<br/>\r\nrefined map<br/>\r\nbetter functioning mini map<br/>\r\nhandsome graphics (all in alpha 1 are placeholders)<br/>\r\ntitle screen/load/high scores<br/>\r\nmenu options on mini map<br/>\r\nbackgrounds<br/>\r\nending scene</p>\n<p>\n<strong>GOALS FOR FINAL:</strong><br/>\r\nmore maps<br/>\r\nsoundtrack<br/>\r\npolish<br/>\r\nbuild for apple/linux/android</p>\n<p>\n<strong>KNOWN ISSUES:</strong><br/>\r\n*Without a Saved game, you'll have infinitely replenishing blue bubbles, however you may get trapped instead of respawning at your save point\r\n</p>\n<p>\r\nTitityler was designed for users to easily make their own maps in ohrrpgce's custom. Maps are made entirely of tiles, converted to slices. No walls and no npcs. The scripts will read your starting map and starting position defined in custom.</p>", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T15:27:10", "background_image": "https://media.rawg.io/media/screenshots/302/3027ec5a728535e4999443a368bf7c75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["meredosia"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}