{"id": 791122, "slug": "bloodless-point-n-sheep-filipeagb-antoniohr-danilo", "name": "Bloodless (Point N' Sheep, Filipeagb, AntonioHR, Danilo Freire, Skhar, Clarc)", "name_original": "Bloodless (Point N' Sheep, Filipeagb, AntonioHR, Danilo Freire, Skhar, Clarc)", "description": "<p>⛩ Bloodless is being developed by Point N' Sheep game studio, scheduled to release for PC in late 2023. </p>\n<p>⭐️ Add Bloodless now to your Steam Wishlist!</p>\n<p>👺 We're also on Twitter and Instagram, follow us to stay tuned with Bloodless development updates.</p>\n<p>*********************************************************************************</p>\n<p><strong>TECH-DEMO</strong>\n</p>\n<p>The project was created during Ludum Dare 45 game jam in October 2019, and we felt really embraced by the Ludum Dare and Itch.io communities, both of which encouraged and helped us in improving the concept and polishing the prototype, giving us the indication that we could expand that experience into something bigger.\r\n</p>\n<p>Since then, between some small projects also born in game jams (<strong>check our profile</strong>),\r\n</p>\n<p>we understood our needs and goals as a team, gave ourselves the name <strong>Point N ’Sheep,</strong> and found the necessary strength to redesign <strong>Bloodless</strong> into a full game experience, taking inspiration from action-adventure games like Hyper Light Drifter.\r\n</p>\n<p>This tech demo is the first slice of a much richer experience we're developing, aiming to illustrate various aspects of our vision of the game; from the retro-modern atmosphere that gives life to the land of Bakugawa (inspired by feudal Japan) to its gameplay that combines fast-paced combat with our signature counter mechanic and a narrative centered on the return of ronin <strong>Tomoe</strong> to the land of Bakugawa hoping to confront ghosts from her past.</p>\n<p><strong>CONTROLS</strong></p>\n\n<p>Thank you so much for your support and love. Feel free to use the <strong>community section</strong> down below to share with us any kind of feedback, whether is an improvement suggestion or a bug report.<br/></p>", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T14:59:54", "background_image": "https://media.rawg.io/media/screenshots/109/109ff0d6c7df7457ef78dc3a87afe0ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["AntonioHR", "Danilo Freire", "Skhar", "Filipeagb", "Point N' Sheep", "Clarc"], "genres": ["Action"], "publishers": [], "esrb_rating": null}