{"id": 79126, "slug": "word-home-cat-puzzle-game", "name": "Word Home - Cat Puzzle Game", "name_original": "Word Home - Cat Puzzle Game", "description": "The Story: <br/>One young newly-married couple found three small homeless cats in a box outside their house: they were all white, dirty, hungry and cold. The young couple brought them into their house. They named these cats: Mun, Miu, Mon. Mun has different-color eyes: yellow and blue, hyperactivity, on the other hand, Miu and Mon are rather shy. They finally found a warm home with love and happiness and started to learn human language... Everyone deserves to have a family and to learn good things even if they are cats.<br/><br/>Word Home is a simple and exciting word connecting puzzle game that makes you addicted!<br/>Are you ready to discover all the hidden words at the home of our lovely cats?<br/>It is funnier if you enjoy Word Home with friends and family. Challenge them to see who will become the word master.<br/><br/>How do you play?<br/>• Simply connect the letters to make a meaningful word and earn coins.<br/>• Find all the hidden words to finish a level.<br/>• Enjoy moments of collecting all hidden words.<br/><br/>WHAT MAKES WORD HOME SO SPECIAL?<br/>• Simple, easy and addictive<br/>• Classic Mode with 2000 levels to be discovered<br/>• Competition Mode: Competition Mode: challenge yourself within 5 minutes to complete difficult daily level with up to 8 letters. Get your score, rank-up and beat your friends on the global leaderboard to become the Best Word Master of the world. Open at Level 133.<br/>• Daily Challenge Mode: Join and have fun with 5 rounds of daily challenges!<br/>• Daily Bonus: earn Bonus by playing the game every day.<br/>• Monthly Bonus: monthly check-in to earn Big Gift<br/>• Bonus Word Treasure: Discover Secret Treasure by collecting the Hidden Words<br/>• New Theme: Chocolate, Green Garden, Halloween<br/>• Play without Wifi<br/>• Support iPhone and iPad <br/>• New version update for FREE<br/><br/>NOTES<br/> \"Word Home\" contains ads like banner, interstitial and video ads.<br/> \"Word Home\" is free to play, but you can purchase In-app items like AD FREE and in-game currency to buy hints alike.<br/><br/>Fanpage: https://www.facebook.com/WordHomeGame/<br/>Customer Service: support@athena.studio", "metacritic": null, "released": "2018-06-21", "tba": false, "updated": "2019-10-22T14:38:33", "background_image": "https://media.rawg.io/media/screenshots/4e1/4e13e552edbc612885db07f754c7be2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Athena Studio"], "genres": ["Educational", "Puzzle"], "publishers": ["Athena FZE"], "esrb_rating": null}