{"id": 791393, "slug": "slide-figure", "name": "Slide Figure", "name_original": "Slide Figure", "description": "Do you like casual and platform games?\r\n\r\n<p> If so, you will love Slide Figure. A game with simple figures that you can use to pass levels and unlock other game modes. Being a 3D environment you will be able to see the colors clearly. Slide Figure apart from giving fun when playing, will help you increase your ability to think quickly and make decisions. </p>\r\nSlide Figure has three game modes:\r\n<ol>\n<li>Cube Mode: It is the mode in which you slide through the platforms and jump between them to reach the others.</li>\n<li>Triangle Mode: It is the mode in which you must rotate to be able to pass through the sides of the platforms without having to touch them.</li>\n<li>Sphere Mode: It is the mode in which you slide freely through the platforms avoiding spikes.</li>\n</ol>\n<p>For added convenience, you will be able to adjust the directional buttons and change the look of the game which would be by switching from light mode to dark mode.</p>\n<p>That waits? Play it now!!! :D</p>\r\n\r\n¿Te gustan los juegos casuales y de plataformas?\r\n<p>Si es así, te encantará Slide Figure. Un juego con figuras simples que puedes usar para pasar niveles y desbloquear otros modos de juego. Al ser un entorno 3D podrás ver claramente los colores. Slide Figure además de dar diversión al jugar, te ayudará a aumentar tu capacidad de pensar rápido y tomar decisiones.</p>\r\nSlide Figure tiene tres modos de juego:\r\n<ol>\n<li>Modo Cubo: Es el modo en el que te deslizas por las plataformas y saltas entre ellas para llegar a las demás.</li>\n<li>Modo Triángulo: Es el modo en el que debes girar para poder pasar por los costados de las plataformas sin tener que tocarlas.</li>\n<li>Modo Esfera: Es el modo en el que te deslizas libremente por las plataformas evitando los pinchos.</li>\n</ol>\n<p>Para mayor comodidad, podrá ajustar los botones direccionales y cambiar el aspecto del juego, que sería cambiando del modo claro al modo oscuro.</p>\n<p>que espera? ¡Juega ahora! :D</p>\n<p><em>anthonyzok@gmail.com</em></p>", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T16:51:13", "background_image": "https://media.rawg.io/media/screenshots/ef0/ef0171fbbafb2eb70cb677d6003b5bae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["AC GAMES"], "genres": ["Educational", "Platformer"], "publishers": [], "esrb_rating": null}