{"id": 791417, "slug": "spherical-alliance", "name": "Spherical Alliance (itch)", "name_original": "Spherical Alliance (itch)", "description": "The Plot\r\n<p>When decades ago, Ian the wizard summoned a portal of great power in one of his magical practicing sessions, he didn’t expect to be dragged in a mysterious world of puzzles by it. <br/></p>\n<p>When it appeared, blue and glowing like nothing his master’s books ever have taught him, he was ecstatic. He was trying to get a closer look when his pal and good friend, an intelligent and quite curious spherical being, found him. The moment the sphere came close to the purple thing, something changed. It began to pull the wizard and his friend into it with a strength, than neither of them could resist and every thing went dark.</p>\n<p>When Ian the wizard and his friend regained consciousness they were no longer home. They were in a different world with just one way to escape: Ian has to bring the sphere to the next blue whirling portal to hopefully one day return home with his spherical friend. </p>\n<p>Now you are wondering what this old story has to do with you, young wizard? You are the only one who can lead Ian the wizard through the puzzles by building a safe path, help him defeat the monsters. Ready your wand young one, it’s gonna be a long day!</p>\n\n<p>Help the little Wizard guiding his Sphere through the levels by making and breaking blocks. But watch out - the evil is always there and everywhere! \"Spherical alliance\" is a classic platformer / jump and run game with a lot of strategy elements. It contains a lot of classic elements like doors / keys, teleporter, one way passable walls, hidden items, bonus levels, shots ( just to name some ) and of cause a bunch of nasty enemies.</p>\n<p><strong>Features</strong></p>\n<ul>\n<li>build your own way through the levels</li>\n<li>156 levels, 7 bosses to fight</li>\n<li>2 player coop mode</li>\n<li>play bonus levels</li>\n<li>solve puzzles</li>\n<li>find hidden items</li>\n<li>collect Items</li>\n<li>avoid nasty enemies or ... trap 'em, trick 'em or kill 'em ;)</li>\n<li>wide range of difficulty from easy going 'collect everything' levels to brain and finger acrobatic levels\r\n</li>\n<li>start each world separately - no need to unlock one world after another</li>\n<li>unique sound track</li>\n</ul>\n<p>\n</p>\n<p>Anmerkung: Dieses Angebot gilt nicht in Österreich.<br/></p>", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T17:02:02", "background_image": "https://media.rawg.io/media/screenshots/87e/87e4a3b1ced47b8e1b25fd3fef7914a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["preussie"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}