{"id": 791459, "slug": "bonnies-bakery", "name": "Bonnie's Bakery", "name_original": "Bonnie's Bakery", "description": "Welcome to Bonnie's Bakery!<br/><br/>Hi! I'm Bonnie, a hardworking baker who makes sweet pastries for the local town animals! Huh? Basement? Don't worry about that! Why not try one of my six pastries instead? I work hard to bake everything fresh daily!<br/><br/>In this cute, story-driven cooking game, play as Bonnie as she bakes up sweet treats for the local townsfolk! There are several game modes to explore and enjoy as you hop into the world of Bonnie's Bakery:<br/><br/><ul><li> Story Mode - In this mode, you play through the main story of Bonnie's Bakery, serving customers and baking dishes in the first half, and escaping the basement to freedom. The baking portion is a mix between visual novel and point-and-click cooking sim, while the basement is- No wait, there's nothing to worry about in the basement! Ha ha ha~<br/></li><li> Night Mode - Free yourself. Carefully sneak through the basement and collect all of the clues you need to get the keycode and escape. Navigate the basement in first person and watch out for her-<br/></li><li> Investigation Mode - Explore the cute, cartoon town filled with adorable animals, and follow the certain little nuisances that keep getting in your way in a first person perspective! Learn about them by following their every move and planning out your trajectory for your hunt! <br/></li><li> Hunt Mode - Deal with the adorable little animals you followed throughout the day by being quick or stealthy! You can choose to avoid being spotted by other NPCs or BONK anyone who gets in your way! Whether you're fast or sneaky, nothing matters as long as you can bag your target! Run through the same, adorable town with a darker perspective. . . Because it's night time!<br/></li><li> Endless Baking Mode - Being a baker is hard work! It feels like there are constantly customers to serve! In this mode, keep baking for an endless wave of customers, similarly to the first half of story mode! But watch out! You only have three lives, so if you fail too many customers, that's game over!</li></ul><br/>You'll also find all sorts of fun things here, such as:<br/><br/><ul><li> Six fun recipes to bake!<br/></li><li> A cute town to explore!<br/></li><li> Adorable animal NPCs to interact with!<br/></li><li> A basement.<br/></li><li> Four targets to hunt! <br/></li><li> Secrets scattered throughout the town!<br/></li><li> Multiple Endings!<br/></li><li> And an endless baking mode!</li></ul><br/>The bakery's been getting really popular recently, so you should be quick to make sure you can get a seat! I hope you stop by!<br/>", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2023-07-17T04:17:54", "background_image": "https://media.rawg.io/media/screenshots/e90/e9077078be66732e76a24f6d08910ba0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Fracta Mundi", "peachygeck", "aislebsoupid", "Sandtastegreat", "luminene", "DesyncDev", "ArSparkion", "Melty Clown Studio"], "genres": ["Indie"], "publishers": ["Melty Clown Studio"], "esrb_rating": null}