{"id": 791419, "slug": "sandys-basics-chapter-two", "name": "Sandy's Basics: Chapter Two", "name_original": "Sandy's Basics: Chapter Two", "description": "\n<p>BACKSTORY: Forty years earlier, your friend had forgotten his seven notebooks and asked you to go get them. You met a teacher named Sandy, who was nice to you at first, but you couldn't solve her impossible question. After Sandy started chasing you, you had to survive impossible odds. But you did it. You managed to escape. But after forty years, she'd been waiting for you. Somewhere different, somewhere never before spoken of. It seems she always returns no matter what happens. You've unearthed something ancient, something truly evil. There is no going back anymore. The true question is, will you survive? You wake up in a dark room you don't recognise, you have a headache and it feels like someone has hit you over the head. The only thing that lights up the room is your flashlight lying on a table. The main door is covered with different locks and now you have to search the house and find keys and other objects to unlock the door and escape. But you have to be careful, because Sandy hears everything and if you drop something on the floor or walk on a creaking floorboard she will start running to the place she heard that sound. You also need to watch out for her bear traps and other dangers lurking in the dark, like her pets. You can hide in wardrobes and cabinets but be careful that she does not see where you are hiding. There is another way to escape. At the bottom of this house there is a garage. In the garage there is an old car. If you manage to start it and open the garage door you can escape that way. You can protect yourself from Sandy using one of the two different types of weapons you can find in the house. But it only stops her for a while. But it's worth it. There are five different levels of difficulty. Extreme, Hard, Normal, Easy and Practice. If you play in Practice mode, you are in the house without Sandy and have the opportunity to try different things without major difficulties. But the house is not completely free from dangers. Sandy gives you five days in the house. If you have failed to escape after the last day... well, probably you can figure out what happens then. Good luck!</p>", "metacritic": null, "released": "2022-05-20", "tba": false, "updated": "2022-05-23T17:02:53", "background_image": "https://media.rawg.io/media/screenshots/472/4727ff92f6e8b80bde674b1786b98118.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cratty Klanz Game"], "genres": [], "publishers": [], "esrb_rating": null}