{"id": 791559, "slug": "a-cat-in-the-forest", "name": "A Cat in the Forest", "name_original": "A Cat in the Forest", "description": "<p>THIS GAME IS NOT MEANT TO BE TOUCH SCREEN PLEASE DO NOT USE TOUCH SCREEN FEATURES AS IT WILL MESS UP THE GAME. <br/></p>\n<p>First Upload:  0.1 4/14/22 (check the dev notes for bug fixes!)</p>\n<p>Newest patch: 0.4 Fixed the loading issue of the fairy's minigame. The original export removed the files needed to play it making the one part of the game unplayable.<br/></p>\n<p>You wake up in a forest as a little cat who can’t remember how they got there. You have to find your way out back to your owner. The animals and creatures of the forest may try to help you or trick you in your adventure home! This game has no battling and is just a simple puzzle and exploration game made for the Black and White Game Jam. The game is made in RPG Maker MV.<br/></p>\n\n<p><em>This game was made for the Black and White game Jam   I entered in late and had 5 days to make this. A lot of content was cut out due to the time limit including art for busts, and end cards. The current art is PLACEHOLDERS. If there is interest I will try to fix bugs, and add missing contest/art.</em></p>\n\n<p><strong>This is my FIRST completed game so please bare with me and THANK YOU For trying it out! I made a Google Survey to help me learn/get feedback, and to ask you some questions about the game if you had time!</strong></p>\n<p>https://forms.gle/r5fR93QbwNijrE9x7<br/></p>\n<p><strong>Credits</strong></p>\n<p>\n</p>\n<p>Yanfly-Plugin</p>\n<p>Atelier-Plugin</p>\n<p>Whtdragon- animal sprites</p>\n<p>Pop!Horror by Vexed- fog picture, window<br/></p>\n<p>Mjshi-Plugin</p>\n<p>Truemisfit- Story help/flow help</p>\n<p>Owltears- Game concept and story, art, mapping, eventing, basically anything besides plugins and the few custom sprites<br/></p>\n<p><strong>If I did not credit you properly please send me a PM and I will gladly fix it!</strong></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-23T18:01:27", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Owltears"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}