{"id": 79152, "slug": "shark-simulator-3d-2016-ocean-animals", "name": "Shark Simulator 3D 2016 - Ocean animals", "name_original": "Shark Simulator 3D 2016 - Ocean animals", "description": "\"Shark Simulator 3D\" - Slip into the role of an angry hungry shark and spread fear and terror in a huge, realistic ocean environment and search for food. Detect seals, fishes or humans and attack them in order to survive.<br/><br/>The goal of this simulator is to survive as long as possible with a preferably large food score. In \"hungry shark simulator 3D\" you take on the role of the most dangers sea dweller. But beware of the big Megacolon shark that will attack you. <br/><br/>This hungry shark simulator contains a highly animated water combined with an extraordinary, complex, highly populated underwater terrain with a mysterious deep-sea area which gives your wanderings with your hungry shark an exciting and realistic feeling. In this animal simulator you have the choice between 3 different sharks: bull shark, blue shark and of course the famous great white shark.<br/>Shark Simulator <br/>*attack human swimmers<br/>*realistic water animation<br/>*angry shark simulator - huge terrain with other sea animals like squids, fishes, orcas, other sharks, seals, whale<br/>*shark attack simulator - be a killer shark attack other animals or swimmers<br/>*sea animal simulator squids, fishes, orcas, other sharks, seals, stingrays<br/>*Shark Simulator contains 3 different sharks(bull shark, blue shark, great white shark)<br/>*survival game mode<br/>*open world game mode<br/>*easy touch controls<br/>*score system", "metacritic": null, "released": "2016-09-10", "tba": false, "updated": "2019-10-22T14:23:44", "background_image": "https://media.rawg.io/media/screenshots/eb3/eb3c3c8576cb2768fdb5b343a9919d94_fUc1fHo.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mnhksdevelopment"], "genres": ["Action", "Simulation"], "publishers": ["H. K. Solution Gesellschaft mit beschraenkter Haftung"], "esrb_rating": "Everyone 10+"}