{"id": 79158, "slug": "sea-diver-simulator-3d-the-ocean-world", "name": "Sea Diver Simulator 3D - The ocean world", "name_original": "Sea Diver Simulator 3D - The ocean world", "description": "Sea Diver Simulator – Explore a huge 3d open underwater world populated by different kinds of sea animals like sharks, whales, squids, orca, stingrays, dolphin, many fish species and other secret creature like the extinct megalodon a primeval animal. This open world game allows you to be a sea diver in a realistic ocean environment<br/><br/>You like sea animals or aquarium animal simulator games then this game would perfect for you. Get into the mysteries of the ocean world, discover the secrets on the ocean bottom. Watch one of the most amazing predators like killer whales or the great white sharks how they hunt for other animals for surviving. Or get your diver carefully into the deep water environment to search a gigantic squid that may will attack you.<br/><br/>-Deep Sea Diver Simulator-<br/>*underwater simulator 3d / ocean simulator <br/>*huge underwater 3d map(open world) <br/>-&gt; very detailed with different underwater plants and a realistic structure<br/>-&gt; different Biomes (Deep Sea, Coral Reef, Sand) with varied sea animal population<br/>*realistic 3d graphic and water animation (requires a good graphic performance)<br/>*animal simulator – This submarine game simulates the behaviour of many underwater animals<br/>-&gt; orca simulator, shark simulator, octopus simulator, dolphin, crabs and more <br/>*easy touch control<br/>*2 camera perspectives<br/>sea diver simulator", "metacritic": null, "released": "2016-09-17", "tba": false, "updated": "2019-10-22T14:23:44", "background_image": "https://media.rawg.io/media/screenshots/769/7691390cabc475f50e7a1606406ac108.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mnhksdevelopment"], "genres": ["Adventure", "Simulation"], "publishers": ["H. K. Solution Gesellschaft mit beschraenkter Haftung"], "esrb_rating": "Everyone 10+"}