{"id": 791670, "slug": "automaton-kingdom", "name": "Automaton Kingdom", "name_original": "Automaton Kingdom", "description": "Automaton Kingdom is a <strong>2D Autochess puzzle game</strong>. It has two different phases, the <strong>edit phase</strong> and the <strong>play phase</strong>.<br/><br/><strong>-Gameplay.</strong><br/>In the edit phase, different characters can be placed in different areas of the map and you can customize many parameters such as direction to face, inventory, team, etc. You can also interact and edit some game objects directly by clicking on them in this phase. After completing the edit phase, the player can see the resolution of the game as the characters <strong>interact on their own</strong> with the level and with each other.<br/> <br/><strong>-Mechanics.</strong><br/>The player can interact with different elements on the map to alter the outcome.<br/>Some elements allow <strong>direct interaction</strong>, such as some ladders, the inventory, Characters or the team to which the character belongs. On the other hand, there are the elements with which the player <strong>interacts in an indirect way</strong>. Either by placing a character in the path of a lever so that it activates it, or giving him an object that allows him to destroy an obstacle.<br/><br/><strong>-Items.</strong><br/><br/><strong>-Characters.</strong><br/>Adventurer: The basic character moves in the selected direction and is able to interact with levers and open doors if he has the key equiped.<br/><br/>Knight: Heavy character capable of breaking fragile floors and he can also destroy boxes with the hammer equiped.<br/><br/>Backpacker: This character has a larger inventory, and is capable of giving items to other characters.<br/><br/>Archer: Equipped with a bow, this character is capable of shooting with items other than arrows. like keys to open locked doors.<br/><br/>Assassin: This character cannot carry items but is very effective in combat and has great agility.<br/><br/>Smith/Mechanic: This character has the ability to fix certain objects if he has the necessary pieces.<br/>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T05:57:00", "background_image": "https://media.rawg.io/media/screenshots/16c/16c39df4a0d346605f11a887ddf86c50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trail Studio"], "genres": ["Strategy", "Indie"], "publishers": ["Trail Studio"], "esrb_rating": null}