{"id": 791652, "slug": "empyre-dukes-of-the-far-frontier", "name": "EMPYRE: Dukes of the Far Frontier", "name_original": "EMPYRE: Dukes of the Far Frontier", "description": "<p>Rising out of the desert in Monument Valley is a city unlike any other ever made. Perched atop massive pillars too impossible to be designed by human hands but built by strange robots called Mekanikals.</p>\n<p>It is a refuge from the disasters plaguing the rest of the country. The coasts are flooded, and the land is overrun by devilish plant-like monstrosities. Life for humankind is nearly impossible and nature has taken complete control. Only the desert remains free from threat.</p>\n<p>Sitting on a train to this city of wonders, you have a first class ticket to the easy life. But this utopian city holds dark secrets and getting inside in one piece will not be as easy as it seems.</p>\n<p>Once you enter, riding high on the winds of change, will the city ever be the same again? Will you drag its mysteries into the light? What will become of the city if the truth is unleashed? Your journey to the far frontier will decide the fate of the last traces of humanity; are you prepared to change the world?</p>\n<p>Features:</p>\n<p>Cowboys, Robots and …<br />\nRetro-Futuristic City: Explore a city unlike any other<br />\nRobot Battles: See robots duke it out for the top prize<br />\nNew Character Creation System: Make your own character with selected skills and perks<br />\nCustomizable Professions: Create your own custom professions for your character<br />\nExpanded character options: More solutions to solve challenges<br />\nEvolved combat system: Controlling the battle is now more fluid<br />\nImproved Arsenal: New special weapons added<br />\nParty Inventory system: Easily share equipment between party members</p>", "metacritic": null, "released": "2022-06-03", "tba": false, "updated": "2022-06-06T03:48:18", "background_image": "https://media.rawg.io/media/screenshots/b19/b191d22467a5c9db5c66e63f0201f503.jpg", "website": "http://empyrethegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coin Operated Games"], "genres": ["RPG"], "publishers": ["Work Shift Play"], "esrb_rating": null}