{"id": 791666, "slug": "fiefdom-2", "name": "Fiefdom", "name_original": "Fiefdom", "description": "We’re a team of 2 lifelong friends from Colorado. One of us has been making games all of his life and the other loves developing deep and enriching stories. Together, we want to create unique and entertaining games refined from community engagement. We aim to carve our own niche in the indie gaming community. We'd love to chat more on our discord server.<h3>Roadmap For the Future</h3><ul>Keep in mind, Fiefdom is very early in development. So, we are looking to add much more content than what is released right now. Each update will also include a whole host of new events. With each major update, we plan to increase the price a small amount to reflect the time, effort, and love we’ve put into it. Topics for future updates include (but aren’t limited to) the following:<li><strong>Wildlife Update:</strong> This will aim to make the area surrounding your fief feel more alive and also make you feel like you can have a more direct impact on the local fauna. Included with this update will also be a weather revamp to make seasons feel more unique. We are already developing this and should be released by the start of Q4 2022!<br/></li><li><strong>Military Update:</strong> This will most likely be the largest of any of the major updates. It will focus on a warring system where you can both invade and get invaded by adjacent kingdoms. Combat simulations and conquering systems will allow you to grow your kingdom at a rapid pace or drive it into the ground. Depending on the depth of the update and the demands of life (we still have real jobs for now), we’re hoping to have this out some time in 2023.<br/></li><li><strong>Adventure Update:</strong> This update will focus on expanding the family tree system that’s already in place by allowing family members to go on adventures to earn glory or disgrace themselves trying. Minigames may also be incorporated within this system to allow for more engaging gameplay during downtime. No estimates for release date yet.<br/></li><li><strong>Magic Update:</strong> This will add a magic system that is intertwined with other aspects of the game, adding more depth and customizability. No estimates for release date yet.<br/></li><li><strong>Other Areas of Improvement:</strong> Control settings, accessibility settings, improving efficiency, saving and loading fiefs, resource/population graphs over time, steam achievements, family tree portraits, and more!</li></ul>", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2022-05-27T05:52:53", "background_image": "https://media.rawg.io/media/screenshots/373/373c334b737a18d704611be591b54a03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lunatinea"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Lunatinea"], "esrb_rating": null}