{"id": 791664, "slug": "the-illusion-nightmare", "name": "THE ILLUSION: NIGHTMARE", "name_original": "THE ILLUSION: NIGHTMARE", "description": "THE ILLUSION NIGHTMARE Is a horror game made by professional crew In the art of horror.<br/>\n<br/>\r\nYou will have the opportunity to experience one of the most powerful types of psychological horror<br/>\r\nBased on an environment designed in every detail to be a real hell that makes you afraid and terrified.<br/>\n<br/>\n<br/>\r\nOne day, a man named Martin was conducting investigations about a secret cult, he was exposed and arrested by Zorya.<br/>\r\nHe was imprisoned In the Nightmare which is Zorya's mysterious mansion surrounded with dark energy, ghosts and Illusions <br/>\n<br/>\r\nMartin has to pass a psychological and mental exam to be adopted into the mysterious cult, or to be forgotten in the world of Illusions<br/>\r\nBut the abandoned mansion is full of ghosts, evil forces and intricate puzzles where he will be punished by Zorya for every wrong decision.<br/>\n<br/>\r\nThe game begins when martin finds himself trapped in the nightmare mansion.<br/>\r\nYou have to help him escape by solving the puzzles in the twenty four main rooms,<br/>\r\nWhere you will get a key in each room allow you to enter the next room<br/>\r\nBetween The Rooms You Have To Cross Switch Portals, Loop Rooms, And The Big Maze<br/>\r\nIn every place of the game you will be attacked by ghosts and you will suffer from<br/>\r\nIllusions and strange events that will happen around you.<br/>\n<br/>\n<br/>\r\nDo you have the ability to challenge Zorya? <br/>\r\nWill you help Martin pass the Nightmare?<br/>\r\nOr you will leave him imprisoned in the illusions world.", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T05:50:33", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab595f439d2211fcbef7c48893eb2a5e.jpg", "website": "http://raven-games.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 356, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raven Games"], "genres": ["Adventure"], "publishers": ["Raven Games"], "esrb_rating": null}