{"id": 791692, "slug": "meowtopia-expedition", "name": "Meowtopia: Expedition", "name_original": "Meowtopia: Expedition", "description": "“Meowtopia: Expedition” is a cat-themed and heart-warming Match 3 game. Join and experience the urban fairy tale between Xiaoxiao and “Toffee” the cat, dress yourself up with a cat-themed fashion style, and decorate your own cozy home! You can also enjoy the company of adorable cats while engaging in the upgraded puzzle-like Match 3 gameplay. <br/><h3>Game Features:</h3><h3>[Various Cat Skills and Fancy Gameplay to Develop Your Own Style]</h3>A bunch of new Cat Skills are introduced! Each cat has its own unique Skill Sets: Coin Boost, Bomb Enhancement &amp; Duplication, Faster Charging......Combine the effects as you wish and achieve amazing Combos of your own style! <br/><h3>[Heart-warming Storyline, an Urban Fairy Tale of Cat and Girl]</h3>In a rainy night, a young girl, Xiaoxiao met the stray cat “Toffee”, and their happy life begins then. Although the process of pursuing dreams could be rough, with Xiaoxiao’s kindness and persistence, she could always be surrounded with friendship and love, and overcome life’s challenges. All dialogues in game are dubbed to bringing a warm experience to you who love stories. Come and enjoy the urban fairy tale of cat and girl!<br/><h3>[A Upgraded Match 3 Gameplay and Mysterious Surprises in Meow Store]</h3>A fully upgraded match-3 gameplay with fluffy balls, toy mouse, kitty’s paws......More skills could offer more strategic options on your way to success. In addition, there are special discounts offered by Meow Store with kitty managers. You can refresh items sold in Meow Store with discounts every 5 levels, and a lot more interesting items await you to explore!<h3>[Decorate Your Home with A Theme, Build Your Own Fancy Meow Town]</h3>Customize your decoration with dozens of furniture and build your own special house! A sea-themed classic blue, a princess styled pink, a natural green or a shiny &amp; mysterious purple, design your own themed unique Meow Town! <br/><h3>[Treasure Hunt with Roguelite Elements, Attention! Kitty Expedition! ]</h3>Endless stages, different drops and coin systems, together with various level design and final boss challenges, you could challenge yourself through the whole process! Hold on to the love and friendship you received on your adventure, and never give up on overcoming difficulties in life!<br/>", "metacritic": null, "released": "2022-05-24", "tba": false, "updated": "2022-05-27T06:19:27", "background_image": "https://media.rawg.io/media/screenshots/825/825f836881d8c203b17def81b5b970be.jpg", "website": "https://myz.herojoys.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Duoyi (Hong Kong) Interactive Entertainment"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Duoyi (Hong Kong) Interactive Entertainment"], "esrb_rating": null}