{"id": 791690, "slug": "bewbewbew-2", "name": "BEWBEWBEW", "name_original": "BEWBEWBEW", "description": "BEWBEWBEW is a lovingly crafted, unique, and colorful action-arcade game!<br/><br/><ul><li><strong>Completely original fighting system!</strong> Charge spawns before releasing them in one big wave. Fights are all about optimizing your move usage to hit as many spawns as possible.</li></ul><br/><ul><li><strong>A ton of playable characters and abilities!</strong> 30+ characters, each with their own set of abilities from a pool of 100+ unique moves of different types, elements, and usage. No two characters play the exact same!</li></ul><br/><ul><li><strong>Partake in intense 1-vs-1 and whole party fights!</strong> Each side can have up to 3 party members. Hectically switching between your party members to burn through all your energy and cooldowns is key!</li></ul><br/><ul><li><strong>Hand-drawn graphics!</strong> Nearly every sprite and background in this game was drawn on paper first before being digitally colored, all done to make the art pop out.</li></ul><br/><ul><li><strong>Combine different attacks for devastating effects!</strong> Set embers ablaze to start a fire! Place down a lightning rod before using a shock attack to do massive damage! Plant seeds and grow spiky roses!</li></ul><br/><ul><li><strong>Play through 30+ fun levels!</strong> Some levels have unique twists and conditions. Be ready for anything!</li></ul><br/><ul><li><strong>Endless Classic mode!</strong> Unlock characters and play through an endless gauntlet of levels as your power up your party!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-27T06:16:42", "background_image": "https://media.rawg.io/media/screenshots/39a/39a5c23f99de425e0659988bc3864dae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Almusal"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Almusal"], "esrb_rating": null}