{"id": 791642, "slug": "my-little-pony-a-maretime-bay-adventure", "name": "MY LITTLE PONY: A Maretime Bay Adventure", "name_original": "MY LITTLE PONY: A Maretime Bay Adventure", "description": "<p>Bring magic back to Equestria and play with the new generation of MY LITTLE PONY characters, in an adventure full of fun, fashion and good friends!</p>\n<p>Earth Pony Sunny wants to make the world a better place by hosting Maretime Bay Day, a forgotten celebration of friendship and magic. But some pony is out to spoil the celebration - and they&#39;re stealing cakes, letting bunnies loose, and even spoiling Pipp&#39;s paintings!</p>\n<p>Only you can help Sunny throw the most magical celebration Equestria has ever seen. Use your magic to put on fashion shows, find the cutest animals, fly with the Pegasi and more. Customize your ponies by unlocking new skills and accessories, including new hats and jewelry, rollerblades, and fashion magic.</p>\n<p>Your friends Hitch, Izzy, Zipp and Pipp are here to lend a helping hoof every step of the way. And you can invite another player for multiplayer minigames! The ponies need you to make Maretime Bay Day unforgettable – can you find the mysterious party pooper and bring back the magic?</p>\n<p>BE A PONY – Play as Sunny the adventurous Earth Pony and use her magic powers<br />\nLEARN NEW POWERS – Unlock pony skills and accessories including clothing, purses, and magic abilities<br />\nEXPLORE MARETIME BAY – Adventure across Maretime Bay and beyond to bring the magic back<br />\nMULTIPLAYER PARTY – Two players can put on a fashion show, herd bunnies and more!</p>", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2023-08-11T18:50:06", "background_image": "https://media.rawg.io/media/screenshots/96f/96faf3cb98a7ada93ef4b7b46185bc53.jpg", "website": "https://outrightgames.com/games/my-little-pony-a-maretime-bay-adventure/", "rating": 0.0, "rating_top": 3, "added_by_status": {"yet": 1, "owned": 25, "beaten": 5}, "playtime": 3, "achievements_count": 21, "ratings_count": 5, "suggestions_count": 439, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "Xbox Series S/X", "Xbox One", "Nintendo Switch", "PlayStation 4"], "developers": ["Melbot Studios"], "genres": ["Adventure"], "publishers": ["Outright Games"], "esrb_rating": null}