{"id": 791743, "slug": "nayuta-no-kiseki-kai", "name": "Nayuta no Kiseki: KAI", "name_original": "Nayuta no Kiseki: KAI", "description": "[Game Description]<br/>■Exhilarating co-op action!<br/>Nayuta, the protagonist, uses a series of attacks with simple controls, while Noi can unleash powerful season-based magic.<br/><br/>■Blaze new trails by crafting gear!<br/>The the action-packed key to victory!<br/>Nayuta and Noi work together to activate Gear Craft, which can be used to attack enemies, move, remove traps, and much more!<br/><br/>■An adventure through four distinct seasons!<br/>By interacting with the world around him, Nayuta can switch between spring, summer, autumn, and winter!<br/>Not only will the appearance of the action stages change, but the enemies, terrain, and strategies will, too. Unique seasonal events, as well as hidden scenarios closely related to the main storyline can also be unlocked.<br/><br/>■About Nayuta no Kiseki: KAI for Steam®<br/>Originally released in Japan in 2012, Nayuta no Kiseki is an action-packed RPG reborn as the newest member of the KAI series for Steam®!<br/><br/>The Asian version of Nayuta no Kiseki: KAI for PlayStation®4 features HD resolution and high-speed Skip Mode, which were later added to the Japanese version. The Steam® version also contains new and improved graphics for an even more immersive gameplay experience. Embark upon Nayuta's magnificent adventure with the most stunning visuals to date!<br/><br/>■Game Introduction<br/>Rubble from the heavens is falling unto our island...<br/><br/>This world has an \"end\". We have been taught this for as long as anyone can remember.<br/>Even the limitless stretching seas has a distinct end, beyond which one cannot go.<br/>That’s why many scholars say, \"This world is flat.\" A pretty common perception of the world. ...I wonder if it's really true.<br/>No, I’m sure it's wrong. There are still a lot of unknowns in the world. What are these images we see within the Star Fragments?<br/>I strongly believe that the world is much bigger than that. Yes. The world must be much, much bigger...", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T07:16:20", "background_image": "https://media.rawg.io/media/screenshots/2fb/2fb169dae8e409c3802fda6488708f91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 31, "ratings_count": 0, "suggestions_count": 613, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nihon Falcom"], "genres": ["Action", "RPG"], "publishers": ["Clouded Leopard Entertainment"], "esrb_rating": null}