{"id": 791752, "slug": "decarnation", "name": "Decarnation", "name_original": "Decarnation", "description": "<p>Where do you run when the monsters are chasing you from inside your mind?<br />\nExplore a haunting world, both real and metaphorical, and find the keys needed to battle inner and outer monsters. Get caught up in an intensely emotional story unfolding in a malignant, elaborate setting. Experience diverse gameplay featuring twisted puzzles, threatening creatures, lovecraftian environments, and metaphorical minigames.<br />\nDecarnation takes inspiration from the best 2D adventure-horror and survival-horror games from the past eras, as well as cult movies from Satoshi Kon (Perfect Blue) and David Lynch (Mulholland Drive).<br />\nParis, 1990. Gloria is at the end of her rope. A struggling cabaret dancer dealing with the fraying of her relationships, career, and self-esteem, she takes on a new artistic endeavor sponsored by a mysterious benefactor. Would the generous proposal be Gloria&#39;s lucky break, or something worse?<br />\nA survival story with layered psychological stakes, Decarnation explores the contrast between battling limitations in the physical realm, and the subconscious landscapes one can&#39;t escape.<br />\nDecarnation is an emotional, startling story-driven experience that will keep you on your toes until the very end.<br />\nDecarnation mixes traditional survival horror elements (cryptic puzzle to solve, inhospitable environments to explore, lethal predators to avoid, terrifying boss to defeat, etc.) with a wide variety of symbolic minigames (puzzles, reflexes, rhythm, etc.) accounting for real life situations (performing a cabaret show on stage) or metaphorical ones.<br />\nOnce uncovered, key elements of Gloria&#39;s life aid her in defeating monsters in her dreams in unique battles that marry the grotesque and the sublime to represent her struggle for survival. Overcoming challenges in her dreams strengthens Gloria against real life difficulties, and her real life issues create new challenges in her dreams.</p>", "metacritic": null, "released": "2023-05-30", "tba": false, "updated": "2023-12-11T20:45:36", "background_image": "https://media.rawg.io/media/games/c0f/c0f6bbf11ab1b6448e1613eedac58833.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 7, "owned": 5, "beaten": 5, "toplay": 25}, "playtime": 3, "achievements_count": 15, "ratings_count": 4, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Atelier QDB"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Shiro Unlimited", "Coming soon"], "esrb_rating": null}