{"id": 791768, "slug": "yosemite-forest-ranger", "name": "Yosemite Forest Ranger", "name_original": "Yosemite Forest Ranger", "description": "<strong>Yosemite Forest Ranger is a story rich emotional journey set in an open world Yosemite Valley.</strong><br/><br/>It's the early 1980's. You will step in the shoes of Theodore Thompson, a retired man with an emotional history. His Grandfather used to be a Forest Ranger in the Yosemite Valley. A beautiful wilderness heavily inspired by the real world location in Yosemite National Park, USA. <br/>This beautiful location needs a new Forest Ranger and you, as Theodore, need a break from the life you had and will return to Yosemite Valley where you spent all your summers as a young kid learning outdoor skills from your grandfather.<br/>But why has it been so long since you last came here? What makes this beautiful place a place with beautiful memories and on the flipside such heavy and dark emotions..? <br/><strong>Will you be able to fill those footsteps your Grandfather left empty? Will you find the answers you're looking for? Will you have what it takes to become the next Yosemite Forest Ranger?</strong><br/><br/>During Yosemite Forest Ranger you will get to know Theodore and learn what happened in his very emotional and heartbreaking past. Voice Acting queues, like memories and other artifacts play a very important role in discovering what he went through. You may find these while <strong>exploring</strong> the <strong>open world</strong> wilderness and the various POIs.<br/><br/><strong>Yosemite Forest Ranger is a Community Project created by ThirstyThursten's YouTube Gaming community, and is created out of passion from Gamers for Gamers by volunteers and hobbyists.</strong><br/><br/><strong>NOTE: Before posting negative reviews or negative comments, please make sure to check the Discord for any currently known issues, to ask questions or to give feedback. We are working hard to find and apply fixes for any possible issues! Thank you for your understanding and patience! &lt;3 </strong><h3>Features:</h3><ul><li> Fully Voice Acted Character: Theodore Thompson<br/></li><li> Large handcrafted open world wilderness to explore<br/></li><li> Rich emotional story to uncover<br/> </li><li> Find Casette Tapes (and Newspapers) with tales and info of the past <br/></li><li> Several beautiful Points of Interest (POIs) to discover and explore. (And more to come)<br/></li><li> Day/Night cycle<br/></li><li> Full dynamic Weather and Seasons<br/> </li><li> Weather and Temperature Probabilities dynamically change per Season<br/></li><li> Cinematic Sleep Sequences (to skip nights)<br/></li><li> Survival aspects<br/></li><li> Forage for your food<br/></li><li> Cooking and Crafting </li></ul><h3>Future Ideas/Roadmap:</h3><ul><li> Adding more Achievements<br/></li><li> Tutorial System<br/></li><li> Wildlife. Hunting/Trapping system<br/></li><li> Rideable Horses<br/></li><li> Drivable cars<br/></li><li> Minigames/Puzzles for engagement (during nights etc)<br/></li><li> Fishing<br/></li><li> Farming <br/></li><li> More POIs<br/></li><li> Building/Fixing of custom Cabins*<br/></li><li> Adding music and more sound design<br/></li><li> Adding more and more Story content<br/></li><li> Expansion of the Game area<br/></li><li> Controller Support</li></ul><br/>* These are uncertain, they depend on the integration with the story.<br/><br/>If you like what you see and you feel like helping out in the project or giving ideas and/or feedback, join our Discord! :)<h3>AND WISHLIST! &lt;3</h3>", "metacritic": null, "released": "2022-05-26", "tba": false, "updated": "2022-05-27T07:45:43", "background_image": "https://media.rawg.io/media/screenshots/6a6/6a658544ae15cfbebfa38fafac40e045.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 459, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TT Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["TT Studios"], "esrb_rating": null}