{"id": 79209, "slug": "medieval-survival-world-3d-lite", "name": "Medieval Survival World 3D lite", "name_original": "Medieval Survival World 3D lite", "description": "Get into the dark and mysterious world of the middle age. Survive as powerfull knight on a huge, detailed medieval map. Search for food, tresures, items and explore other secrets in dungeons, caves. Beaware of robber knights wich will attack you. Get into amazing battles to earn coins in order to buy new weapons, armor parts and medieval furniture. Be creative and build up your own medieval castle domicile!<br/><br/>Medieval Survival Game 3D Overview:<br/><br/>-3d open world game<br/>  very large and compplex 3d map filled with diffrent things to discover like castles, dungeons, forest, medieval villages and caves.<br/>-realistic medieval scenery with a high quality 3d grafic<br/>-survival game and medieval simulator<br/>(seek for food and get in combat with enemy kngihts)<br/>build mode:<br/>-establish your very own medieval domicile<br/>-combat game: get in epic battles againts equally equipped knights<br/>-earn coins by combats with other knights ot crusadors<br/>-many weapons to archieve:<br/>sword, greatsword, javelin, speer, bow, and more<br/>-collect or buy other medeival stuff<br/>-ride horses to move faster<br/>-dress up and protect your knight with armor or a chain mail<br/>-3rd person RPG perspective", "metacritic": null, "released": "2017-02-10", "tba": false, "updated": "2019-10-22T14:07:17", "background_image": "https://media.rawg.io/media/screenshots/71a/71a6735ecc81b1d4f2f4c4e1386db853_f0krGUs.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["mnhksdevelopment"], "genres": ["RPG", "Simulation"], "publishers": ["H. K. Solution Gesellschaft mit beschraenkter Haftung"], "esrb_rating": "Teen"}