{"id": 79215, "slug": "weaphones-antiques-firearm-sim", "name": "Weaphones Antiques Firearm Sim", "name_original": "Weaphones Antiques Firearm Sim", "description": "Travel back in history and take hold of some of the most significant weapons of all time. From the creators of the popular Weaphones series comes a new experience set in the time of black powder guns, outlaws and revolutionaries. <br/><br/>Imagine yourself in the Old West as you load the classic Colt Single Action Revolver or as you crank the lever on the legendary 1873 Winchester Lever Rifle. Perhaps you fancy yourself a Civil War soldier hurrying to prime the pan and give fire on the unyielding Flintlock Rifle or maybe you just want to send a wall of lead out of the Pirate's favorite weapon the Blunderbuss. All of this is just a download away. Stay safe and have fun as you learn about the weapons you have only seen in movies and museums.  <br/><br/>Weaphones Antiques is not another run-of-the-mill gun app. We have toiled over the details to make it the most authentic firearms simulator. Each weapon operates identical to its real life counterpart when loading, priming, cocking, cycling and firing. To enhance the simulation enable the flash feature which will set off your device's flash with each shot. Grab a hold of your device and fine tune the layout of the weapon to truly immerse yourself in the experience of being a gunslinger. Check out the step-by-step animated tutorials to quickly help you get familiar with each weapon. There is no in-app-purchases or up-sells, just  a one of a kind journey into the history of firearms.<br/>_______________________________<br/><br/>» Realistic Fire, Sound, Smoke, Flash &amp; Recoil Effects<br/>» Full Interaction and Control<br/>» Authentic Weapon Mechanics<br/>» No Up-Sells or In-App-Purchases, You Get Everything Plus Free Updates<br/>» Detailed Full HD Graphics<br/>» Customizable to Fit User’s Hand Size and Preference<br/>    - Lefty Flip<br/>    - Rotate 180°<br/>    - Scale<br/>    - Move<br/>» User Adjustable Variables<br/>    - Unlimited Ammo<br/>    - Auto-Reload <br/>    - Accelerometer Reloading<br/>    - Camera Flash Shooting<br/>» Weapon State Indicator (“Why Am I Not Shooting?”)<br/>» Ultra Detailed Step-By-Step Animated Tutorial for Each Weaphone<br/>» Multi-Touch, Accelerometer &amp; Camera Flash Support<br/>» Social Media Driven Future Content<br/>_______________________________<br/><br/>Interactive Features:<br/><br/>CAPLOCK BLUNDERBUSS: » Hammer » Percussion Cap » Ramrod » Powder Horn » Wad and Lead Balls » Trigger <br/><br/>COLT 1851 NAVY: » Hammer » Cylinder » Round » Percussion Cap » Pan Charger » Loading Lever » Trigger <br/><br/>COLT SINGLE ACTION: » Loading Gate » Hammer » Cartridge » Cylinder » Ejector Rod » Trigger <br/><br/>WINCHESTER MODEL 1873: » Lever Safety » Dust Cover » Lever » Hammer » Trigger <br/><br/>FLINTLOCK RIFLE: » Hammer » Frizzen » Pan Primer » Ramrod » Powder Horn » Wad and Lead Ball » Trigger <br/><br/>COACH GUN: » Barrel Latch » Barrels » Shotgun Rounds » Hammers » Triggers <br/>_______________________________<br/><br/>» Please rate, review and join us on Facebook and Twitter to help decide what the next Weaphone should be.<br/><br/>» If Antiques are not your thing, check out the original and highly rated Weaphones: Firearms Simulator app featuring 20+ modern weapons, search “Weaphones”.", "metacritic": null, "released": "2015-03-24", "tba": false, "updated": "2019-07-30T02:44:19", "background_image": "https://media.rawg.io/media/screenshots/a06/a066173d35143e97a862ff1a7f6c0e2f.jpg", "website": "https://www.youtube.com/user/OranginalPlan", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mark Raykhenberg"], "genres": ["Action", "Simulation"], "publishers": ["Mark Raykhenberg"], "esrb_rating": null}