{"id": 792252, "slug": "praeda-poyrazbahcivan", "name": "Praeda (poyrazbahcivan)", "name_original": "Praeda (poyrazbahcivan)", "description": "<p>Hikaye:\r\n  </p>\n<p>Arcadia mağarasında ailesi ve arkadaşlarıyla huzurlu bir yaşam süren yarasa Zat bir sabah uyandığında ailesinin yanında olmadığını fark eder ve onları aramaya koyulur. Yolculuğu boyunca türlü zorluklarla karşılaşan karakterimiz mağarada saklı anahtarları bulup kilitli kapıları açarak ve labirentlerde yolunu bularak mağaradan kaçmaya çalışır. Ormanda hayvan arkadaşlarının ölü bedenlerini gördüğü için dehşete düşer ve onların kaderlerini yaşayarak ailesine kavuşamadan bir avcı tarafından katledilir. Sürdürülebilir Kalkınma Amaçlarından 14. (Sudaki Yaşam) ve 15. (Karasal Yaşam) ilkelere dayanan bu oyun, sualtı ve karasal ekosistemde yaşamını sürdüren canlı türlerini korumaya, biyoçeşitlilik kaybını önlemeye ve hayvan haklarına dikkat çekmek amacıyla tasarlanmıştır. Mağarada gizlenen Easter Egg odasını ve 5 solucanı bulmaya çalışın!\r\n  </p>\n<p>Kullanılan Assetler:\r\n  </p>\n<p>Bu oyundaki bütün assetler, şarkılar ve bunun gibi bütün içerikler Team Per Aspera Ad Astra tarafından tasarlanmış olup, internetten hiçbir hazır tasarım alınmamıştır. \r\n  </p>\n<p>Kontroller:\r\n  </p>\n<p>Hareket: WASD, Ok tuşları\r\n  </p>\n<p>Kilit Açma/Anahtar Alma/Solucan yeme: E tuşu\r\n  </p>\n<p>Kamera sahne değişimine göre karakteri takip etmektedir.\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T11:54:23", "background_image": "https://media.rawg.io/media/screenshots/93b/93b761eb159b326cd13923892bebbfb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poyrazbahcivan"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}