{"id": 792232, "slug": "multi-era-of-sustainability", "name": "Multi-Era of Sustainability", "name_original": "Multi-Era of Sustainability", "description": "<p>Oyunumuz, tarih öncesi çağda yaşayan bir mağara adamının zamanda yolculuk yaparak geleceği keşfetmesi ve sınırlı kaynakların kullanımı sonucu Dünya’nın sürdürülemez hale gelmesi halini anlatmaktadır. Oyunun amacı, karakterin oyunda bulunan 3 bölümde sırası ile güneş paneli, rüzgâr türbini ve su damlalarını toplayıp oyunun sonunda bu kaynakları kullanarak sürdürülebilir enerji elde edebileceğini fark etmesi ile sonlanır. Oyunumuzun dikkat çektiği nokta, sürdürülebilir kaynakların kullanımının Dünya’yı geri dönülemeyecek iklim krizinin sonuçlarından kurtarabilecek olmasıdır. Oyunun 1. Bölümü tarih öncesi bir dönemde geçmektedir. Açık renkli ve ferah bir tema kullanılan bu bölümde herhangi bir kirlilik bulunmamaktadır ve karakterimiz parkurlardan geçerek rüzgâr türbini toplamaktadır. Aynı zamanda bölümün düşman ve tuzakları da çağa uygun olan kartal ve kaktüslerdir. Birinci bölüm sonunda ara sahne bulunmaktadır ve karakterimiz elindeki rüzgâr türbinini incelemektedir. Oyunun ikinci bölümü sanayi devrimi döneminde geçmektedir. Karakterimiz sanayi devriminin sonuçlarından biri olan hava kirliliği sonucu biraz daha koyulaşmış bir tema kullanılan bu bölümde parkurlardan geçerek güneş panelleri toplamaktadır. Bu bölümdeki düşman ve tuzaklar ise atlı asker ve dikenli tellerdir. İkinci bölümün sonunda da ara sahne bulunmaktadır ve karakterimiz bu çağa birden bire nasıl geldiğini sorgularken aynı zamanda da topladığı güneş panellerini inceler. Oyunun üçüncü ve son bölümü ise günümüzde geçmektir. Teması, karanlık ve harap olmuş bir Dünya olan bu bölümde karakterimiz, parkurlarda su damlaları toplamaktadır. Bölümün düşmanları ve tuzakları ise Covid-19 virüsü ve arabalardır. En son sahnede ise karakterimiz, topladığı rüzgâr türbini, güneş paneli ve su damlalarını enerji eldesinde kullanabileceğini fark eder ve insanlık adına anlamlı bir mesaj vererek oyun sonlanır.</p>", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T11:44:40", "background_image": "https://media.rawg.io/media/screenshots/ba1/ba10663f6ca1cdab4eeae653d6888309.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cagan55555"], "genres": [], "publishers": [], "esrb_rating": null}