{"id": 792395, "slug": "journey-within", "name": "Journey within", "name_original": "Journey within", "description": "<p>As the title suggests, this text-based game called <strong>Journey within</strong> embarks the player on a journey of self-discovery.  You go to therapy, remember back to certain things from your childhood, trying to figure out what shaped you into the person you are today and what can you do to leave some patterns and experiences in the past.<br/></p>\n<p>Many stories come from my childhood, and the inspiration behind it was simply to have them stored in some form so I can make sure they stay with me. By writing these, I relived some of the moments which either filled me with joy or simply gave me some answers and lead. However, it is a mix between my own experiences and fiction. I will leave it up to you to decide which part is which. ;)<br/><br/><em>p.s. I consider this version of the game a demo or trailer. I would like to continue it, expanding it and maybe even make a bigger, more interactive game out of it. But first, I would like to get some feedback regarding the whole concept. :) Happy playing, hope you'll enjoy it.<br/><br/></em><strong><em>And an important disclaimer!</em></strong></p>\n<p>The answers and methods of the therapist are not made or approved by psychologists, it’s all written by me, either from experience, research or pure intuition, considering what I think I would like to hear now - as if I was my own therapist-. If you are easily triggered by this topic or feel like it might influence you negatively, then please do not play this game. If you still continue, then please do it at your own risk. The game is meant to picture the aforementioned things from a little bit of a different point of view. It does not replace real life therapy by any means!</p>\n\n<p><em>p.p.s. I had some troubles with the sidebar in the mobile version so for now I recommend playing the game only in the browser.</em></p>", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T12:59:40", "background_image": "https://media.rawg.io/media/screenshots/020/020b015a48b189659a97a7bb7434b811.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hhelheim"], "genres": [], "publishers": [], "esrb_rating": null}