{"id": 792334, "slug": "antumra-penumbra-on-android", "name": "Antumra: Penumbra on Android", "name_original": "Antumra: Penumbra on Android", "description": "The legendary horror game \"Penumbra: Black Plague\" is now on mobile devices. Face your fears, find your way to the light and try not to go insane... in an updated format.<p>Dream or reality? Darkness or light? Death or salvation?<br/></p>\n<p>They say there are no hopeless situations. Perhaps so, unless we are talking about an endless nightmare from which one cannot wake up.</p>\n<p>Behind you are the cold of the icy wastelands and the dampness of the abandoned mines. Ahead are only the dark corridors of underground laboratories. Around only desolation, loneliness and death. When the sense of reality disappears and with it the belief in a happy outcome leaves the soul, all that is left is to keep moving forward into the unknown...</p>\n<p>Features:<br/>- The scariest game of a generation - the feeling of unspeakable horror will follow you relentlessly on your heels;<br/>- Mystical storyline, forcing you to peek into the darkest recesses of human consciousness;<br/>- Graphics, the likes of which no mobile horror game has;<br/>- Puzzles built on realistic physics of the game environment;<br/>- Famous analog controls - open doors, pull levers and twist valves as if your finger were an extension of your real hand.</p>\n<p>Differences from the original game:<br/>- Touchscreen-adapted controls, as well as redesigned puzzles in this regard, which now have to pass in a slightly different way.</p>", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T12:28:49", "background_image": "https://media.rawg.io/media/screenshots/0c7/0c78c36a21ae12e7c2c0b6ca2cba01ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["CreaTeam"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}