{"id": 79237, "slug": "strategy-tactics-world-war-2", "name": "Strategy & Tactics World War 2", "name_original": "Strategy & Tactics World War 2", "description": "\"New pretender to the World War 2 throne makes good.\" - gamezebo.com<br/><br/>\"The amount of Campaigns, Strong AI,  and variety of modes makes this an easy recommend.\" - appstorearcade.com<br/><br/>Relive the greatest battles of WWII in this grand strategy masterpiece. Take command of the Axis to conquer Europe - then command the armies of the USSR and Allies to retake it.  <br/><br/>In Strategy &amp; Tactics: World War II, you battle impressive AI enemies in three campaigns with a classic turn-based battle system and serried ranks of historically-accurate troops. Fight your way through eighteen missions with an exсiting storyline and charismatic characters across Europe, Asia and Africa, research new technologies to improve your troops and build industry, and lead your armies to victory.<br/><br/>If you manage to finish all that,there are also skirmish games, several classic scenarios, plus hot seat mode to play. All this displayed, in a highly-detailed, powerful but simple to understand interface. <br/><br/>The following content is available in free version:<br/> - 3 Missions of Axis Campaign - \"The Birth of Tragedy\";<br/> - One Skirmish mode map with fixed game settings;<br/> - \"The Decline of the West\", \"The Reds in the UK\" game scenarios;<br/> - One Hot-seat multiplayer mode map;<br/><br/>The following content is available in premium version:<br/> - Complete Axis Campaigns - \"The Birth of Tragedy\" and \"Twilight of the Gods\";<br/> - Complete USSR Campaigns  - \"Eastern front\" and \"Victory Day\";<br/> - Complete Alliance campaign – \"Roads of Freedom”;<br/> - Full alternative history campaigns \"World War III\" and \"Better Dead than Red\", 17 missions in total;<br/> - Multiple Skirmish mode maps with various customisable game settings;<br/> - Sixteen unique game scenarios available;<br/> - Several Hotseat multiplayer mode maps with various customisable game settings;", "metacritic": null, "released": "2013-03-21", "tba": false, "updated": "2019-07-30T03:10:36", "background_image": "https://media.rawg.io/media/screenshots/319/319e2b1d3485e68ed18f8ff83280fd18_l8d9JEx.jpg", "website": "http://www.herocraft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HeroCraft"], "genres": ["Strategy", "Board Games"], "publishers": ["HeroCraft"], "esrb_rating": null}