{"id": 79236, "slug": "odysseus-kosmos-episode-1", "name": "Odysseus Kosmos - Episode 1", "name_original": "Odysseus Kosmos - Episode 1", "description": "Odysseus Kosmos and his Robot Quest it’s a traditional 2D point’n'click game with retro-pixel style graphics. You are the ship engineer Odysseus Kosmos; you and your service robot Barton Quest are stuck in deep space near a black hole, all by yourselves. Your shipmates are down on the surface of a planet where time moves far, far slower and you, along with your robot, have been waiting for years for them to return to your orbital station. You were used to your comfortable boredom, but then the ship starts acting funny: it looks like this mysterious black hole affect your ship in strange and unexpected ways, cutting off your communications and threatening with de-orbiting the station and sending you stranded into deep space… unless you can do something to stop it!<br/><br/>Odysseus Kosmos is a family friendly, hand-animated, puzzle-filled point-and-click adventure game with stylized visuals and a brilliant soundtrack that will make you laugh as you solve mind-bending puzzles.<br/><br/>Game features:<br/>Old-school 2D point-and-click adventure<br/>Solve riddles and puzzles to save your ship<br/>Explore outer space in a cool retro pixel-art style!<br/>Immerse yourself in a sci-fi story whit a pinch of good-hearted humor<br/><br/>_____________________________________<br/><br/>FOLLOW US: twitter.com/Herocraft<br/>WATCH US: youtube.com/herocraft", "metacritic": null, "released": "2018-01-12", "tba": false, "updated": "2023-12-18T17:35:22", "background_image": "https://media.rawg.io/media/screenshots/c12/c12629168053f6616ea78315eeb11843.jpg", "website": "http://odysseus-kosmos.com", "rating": 2.24, "rating_top": 1, "added_by_status": {"yet": 63, "owned": 1187, "beaten": 8, "toplay": 1, "dropped": 15}, "playtime": 1, "achievements_count": 12, "ratings_count": 66, "suggestions_count": 474, "game_series_count": 0, "reviews_count": 66, "platforms": ["iOS", "PC"], "developers": ["HeroCraft", "Pavel Kostin"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["HeroCraft"], "esrb_rating": null}