{"id": 792374, "slug": "snackiro-shani-dips-twice", "name": "Snackiro: Shani Dips Twice", "name_original": "Snackiro: Shani Dips Twice", "description": "<p>You are Shani, a devious dip connoisseur and double-dipper. The party is in full swing and the hosts have laid out a glorious spread. It's time to get dipping!</p>\n<p>Navigate the hallways of the house party dipping your nacho in as many dips as possible, then chow down on that flavour triangle for maximum points. Can you go for the legendary five-dip chip? How many points can you score in three minutes?</p>\n<p>Not everyone will appreciate your double-dipping ways, however. Don't get caught in their line of sight with two dips on your chip, unless you want to be publicly embarrassed.</p>\n<p><strong>Controls:<br/></strong>W,A,S,D - move<br/>E - pick up nacho, dip nacho<br/>Spacebar - eat nacho<br/><br/>Developed by Charles Britton over three weeks as part of the Code Camp module of the National Film and Television School's Games Design and Development MA.</p>\n\n<p><strong>Credits</strong><br/>Director/Designer/Lead Programmer - Charles Britton<br/>Composer - Nir Perlman<br/>Sound Designer - Joseph Russell<br/>2D Artist - Melwin George Mathew</p>\n<p>Assets used:</p>\n<p>PolygonTown<br/>KiraAvatar<br/>Furniture Mega Pack, Brick Project Studio, Dining set, House Furniture Pack, Kitchen Props<br/>Freepik on Flat Icon<br/>Freesound.org<br/>DaFont<br/></p>\n<p>Special thanks to :<br/>Ellie Silkstone, Ned Birkin, Ted Chaplin, Alan Thorn, Mariia Kharitonova, Harvey Hayman, Holly Hudson, Thomas Porta, Nick McKenzie, Enam Banaja, and Wid Alhajjaji, without whom I would have lost it a long time ago</p>", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-27T12:48:56", "background_image": "https://media.rawg.io/media/screenshots/bc5/bc5959d2ef338ae0ed238ccab87b1b1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Charles Britton"], "genres": [], "publishers": [], "esrb_rating": null}