{"id": 79255, "slug": "stenches-a-zombie-tale-of-trenches", "name": "Stenches: A Zombie Tale of Trenches", "name_original": "Stenches: A Zombie Tale of Trenches", "description": "Deploy to the Trenches once again to take on a new and more deadly foe, the Zombie Horde. Lead your British Royal Expeditionary army as the last stand in Western Europe during the Great War and prove yourself as a true hero. Do you have what it takes to defeat the Armies of the Hundead or will you fail and join their ranks?<br/><br/>********* <br/><br/>-=- GameCenter Global Cooperative Multiplayer with VoiceChat and Friend Invites -=- <br/><br/>Stenches v1.1 is now out ... GameCenter global multiplayer with VoiceChat. Now, you can coordinate attacks with your friends. Flip on WiFi ... load-up on Stenches ... and start making zombie bits! <br/><br/>********* <br/><br/>***<br/>Press Reviews:<br/><br/>Apple, Game of the Week - \"Use your armies to send the walking dead back to their graves in this week's selection, a zombie battler that plays every bit as good as it looks\"<br/><br/>TUAW - \"Unique Twist on real time strategy. Great game -- definitely check it out.\"<br/><br/>Touch Arcade - \"A deep-enough weapons upgrade system and the inclusion of enemies with odd weaknesses to said upgrades fleshed out the game, which quickly became a favorite of mine. \"<br/><br/>SlideToPlay - \"Good variety of enemies; great graphics, and a successful mix of genres \"<br/><br/>AppSmile - \"Replay value is very good, as little changes in strategy can have significantly different outcomes. Honing your strategy can be quite addictive.\"<br/>***<br/><br/>Stenches is the sequel to Trenches infamous Zombie Horde mode, but the fight isn’t over yet! Pick up where Trenches left off as the Zombie Horde makes a grand appearance in an attempt to take over all of Western Europe. (That's what we call deadication!) Take on the role of the British Commander once again and drive back the Zombie Horde!<br/><br/>Stenches packs countless hours (maybe even days!) of zombie-filled, carnage-laden mayhem. Punish wave after wave of brain thirsty zombie horde and bosses. <br/><br/>They've come for your brains ... drive them back to the hole that spawned them!<br/><br/>FEATURES<br/><br/>√ Over 200 Wave Levels across Four Beautifully Constructed, Artful Maps<br/>√ Unlimited Distance Mode<br/>√ Unique and Nasty Zombie Bosses Each with their own Special Devious Ability Bent on your Destruction<br/>√ Cooperative GameCenter global multiplayer with VoiceChat<br/>√ Original Voice Acting<br/>√ Epic Original Musical Composition<br/>√ Riveting World Class Art<br/>√ Captivating \"Pick-up and Play\" or \"Stay and Play\" Gaming<br/>√ More Cowbell than Legally Allowed in Seven Countries<br/>√ Listen to your own music<br/><br/>----<br/><br/>Future Updates will include:<br/>• Versus Multiplayer ... you control the zombie horde!<br/>• New Zombie Bosses<br/>• More Game Modes<br/>• Any other freakishly nasty thing the players think up<br/><br/>Zombies eating your brains? Got a beef? Found a bug? Tell us about it. Remember we can't respond to your reviews, but we do read every email we get and respond to 95% of them. If you’ve got an issue with any of our games, we want to solve it. support@thundergameworks.com <br/><br/>As always your five star reviews encourage us and allow us to keep the updates coming.<br/><br/>Follow us on Twitter to receive new information about Stenches and future projects at http://twitter.com/thundergamewrks (@thundergamewrks) <br/><br/>Support and brains online at http://www.thundergameworks.com", "metacritic": null, "released": "2010-11-11", "tba": false, "updated": "2019-10-22T14:22:50", "background_image": "https://media.rawg.io/media/screenshots/776/776856a23044de7981170e1d73846d76.jpg", "website": "http://www.catapultconsulting.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Catapult Consulting"], "genres": ["Action", "Strategy"], "publishers": ["Catapult Consulting"], "esrb_rating": "Everyone 10+"}