{"id": 792554, "slug": "draft-city", "name": "Draft City", "name_original": "Draft City", "description": "<p>DraftCity is a card-base roguelite city builder. Play cards to grow your city and get more buildings. Complete goals to win the game and gain access to new cards.<br/></p>\r\nCards\r\n<p>The game has three card types:</p>\n<ul><li><strong>Instant effects</strong> will give you immediate resources or other effects.</li><li><strong>Buildings </strong>will produce or consume resources over time, supply people or enhance instant effects.</li><li><strong>Upgrades</strong> will enhance existing buildings with better production.</li></ul>\n<p>You will be dealt 5 cards per turn from the draw pile. Instant effect cards and unplayed cards will move to the discard pile at the end of the turn. Once the draw pile is empty the discard pile gets shuffled on it.</p>\n<p>Each turn you will be able to add new cards to your discard pile. Four cards will be on offer at the top of the screen. These cards are valued by people counts. You will be able to add as many cards as people are living in your city.</p>\r\nMap\r\n<p>Each game will have a randomly generated map. Four types of terrain are available on all maps: Grass, Forest, Water and Mountain. Small coloured hexagons on each building/upgrade card will indicate on which terrains these can be placed.</p>\r\nRealtime\r\n<p>Time moves independently from turns. Buildings will produce and consume resources over time. Depending on their housing people will consume different resources over time.</p>\r\nVarying goals<p>\n</p><p>Each game has a random set of goals. Complete all goals to win the game. Winning a game will allow you to research a new card in the Research Tree.</p>\r\nMeta-progression\r\n<p>Initially you will have a very basic set of cards available. After each win you will be able to research a new card. This card will turn up in the offers in all future games. New cards will also enable additional goals.</p>\r\nRoadmap<p>Next steps on the development roadmap are:</p><ol><li>Additional goals, including discoverable goals on map<br/>\n</li><li>Visual feedback on spent resources</li><li>Random events</li><li>More cards</li><li>Improved animation performance</li></ol>Credits\r\n<ul><li>Icons - Freepik</li><li>Music - Alexander Nakarada</li><li>Sound effects - Kenney</li></ul><em>This is a gameplay prototype, feel free to submit feedback and bugs in the comments. Thanks for playing!</em><br/>", "metacritic": null, "released": "2022-05-24", "tba": false, "updated": "2022-05-27T14:14:51", "background_image": "https://media.rawg.io/media/screenshots/969/969677907fafab08f0b151235a58f84f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mort_on"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}