{"id": 79251, "slug": "sky-gamblers-storm-raiders-2", "name": "Sky Gamblers - Storm Raiders", "name_original": "Sky Gamblers - Storm Raiders", "description": "Sky Gamblers: Storm Raiders is an Apple Design Award winner!<br/><br/>THIS IS THE ULTIMATE WWII AIR COMBAT GAME! You’ll participate in visceral dogfights, protect <br/>cities and fleets, bomb enemy structures and even fly through tunnels. Everything is set up in accurately <br/>recreated real life locations like Pearl Harbor, Coast of Dover, Midway, Germany and France. <br/><br/>AMAZING QUALITY AND IT’S ON OSX! <br/>Unparalleled visuals, special effects and audio including: specular masks, bump mapping, atmospheric <br/>scattering, volumetric clouds with realistic lighting, sun glare, day &amp; night transitions, God rays, high <br/>definition textures, 4x anisotropic filtering, High Dynamic Range (HDR) rendering, radial blur, heat haze, <br/>refractive raindrops and more! <br/><br/>IMMERSIVE GAMEPLAY <br/>Take off and land on landing strips and carriers. You will fly in fully recreated cities with realistic <br/>weather, accurate atmospheric scattering with aerial perspective and highly detailed planes with <br/>interactive cockpits. <br/><br/>HUGE HISTORIC FLEET <br/>Fly highly detailed WWII top aces planes. Watch the progressive damage affecting planes and finally <br/>being shredded into pieces. <br/><br/>HUGE COLLECTION OF ONLINE MODES  <br/>Invite your friends to play online! Choose between cooperative and competitive modes: Survival, Last <br/>Man Standing, Free Flight, Free for All, Team Match, Capture the Flag and the new Assault. <br/><br/>CROSS PLATFORM MULTIPLAYER<br/>Play with iOS players on both WiFI matches and online ones.<br/><br/>GAME CENTER and iCloud <br/>Since this all takes place on Apple devices, iCloud support has been integrated so players can save <br/>and share progress across devices. Climb the Game Center leaderboards, challenge friends and unlock all achievements. <br/><br/>Online play requires a Wi-Fi or 3G/4G internet connection. <br/><br/>Please send us your impressions and suggestions, help us identify bugs. We want to make your gaming <br/>experience the best you’ve ever had. Please visit our support site at www.atypicalgames.com/support. <br/><br/>Like us on Facebook: www.facebook.com/skygamblersstormraiders <br/>Follow us on Twitter @sg_stormraiders", "metacritic": null, "released": "2013-01-10", "tba": false, "updated": "2019-07-30T02:51:32", "background_image": "https://media.rawg.io/media/screenshots/b54/b542d210addd50f1c147791c5ad1b0d2.jpg", "website": "http://www.atypicalgames.com/StormRaiders/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Atypical Games"], "genres": ["Action", "Simulation"], "publishers": ["Atypical Games"], "esrb_rating": "Teen"}