{"id": 792680, "slug": "little-red-riding-rosie", "name": "Little Red Riding Rosie!", "name_original": "Little Red Riding Rosie!", "description": "<p>USING RTP ASSETS AND LACKING THE WILL TO IMPROVE, IT'S FINALLY HERE! THE RED RIDING HOOD RETELLING THAT YOU NEVER WANTED AND DEFINITIVELY NEVER NEEDED!</p>\n<p>AKA my very first RPG Maker game EVER! I think it was made last year around 6/27/21 going by the project files but who knows lol</p>\n<p>INCLUDES: bad jokes, garbage grammar + misspelling, sussy characters, the most underwhelming and unbalanced battle system you've ever seen, weird character motivations, a garbage amount of bugs (easy to fix), log abuse (no animals were harmed in the making of this dumpster fire), not one but tWO endings, and more!</p>\n<p>LACKING: cake :/</p>\n<p>***</p>\n<p><strong>THE PLOT:</strong><br/></p>\n<p>Rosie is a little girl living with her mom, and all she wants to do is play games and eat cake! But she has to take a basket of goods to her grandmother's. Forget all that nonsense about venturing off the path, what zany characters will you meet on the way to grandmother's house? And will Rosie ever get her cake??</p>\n<p>***</p>\n<p><strong>How to play:</strong></p>\n<p>Typical RPGMaker MV controls</p>\n<p>wasd to move</p>\n<p>z and x to enter or exit but i forget which is which</p>\n<p>\"enter\" also enters stuff</p>\n<p>hopefully shift makes people run faster but idk if I ever put that in</p>\n<p>***</p>\n<p>This is more to measure my progress than anything else honestly, if you have fun playing it I'm glad! :) I made it back when I knew very little about RPGMaker MV, but I definitively learned a lot along the way.</p>", "metacritic": null, "released": "2022-05-24", "tba": false, "updated": "2022-05-27T15:05:05", "background_image": "https://media.rawg.io/media/screenshots/13d/13d07351248b89958ec5bee972493634.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ghostinthegame"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}