{"id": 79261, "slug": "wonder-blade", "name": "Wonder Blade", "name_original": "Wonder Blade", "description": "When the king says jump, you say \"how high?\". When the king says fight, you fight. When the king says \"save my princess from a villainous maniac and his castle-sized pet golem\", you say \"what...?\".<br/>\n<br/>\r\nWhat are you waiting for? Grab that trusty weapon of yours, free the princess and save the world, all before breakfast! With all those sweet combos, killer finishing moves and devastating magic abilities the bad guys won't know what hit them. Don't forget to wear a costume to make you a one-of-a-kind adventurer. Will you be a sneaky ninja, smacking enemies with a frozen fish? Or a lightsaber-wielding raccoon with a score to settle? It's all up to you!<br/>\n<br/>\r\nHigh-speed cart chases through the forest, a fishing competition in the ocean, zombie hordes and high-tech soldiers, we've got it all! This world is full of thrills, mystery and surprises the likes of which you've never had before.<br/>\n<br/>\r\nWhat do you get when you cross a whimsical adventure, humorous characters and combat to die for? Wonder Blade - an awesome experience you won't soon forget.<br/>\n<br/>\r\nThe question is...<br/>\r\nAre you ready?<br/>\r\n___________________________________<br/>\n<br/>\r\nFeatures:<br/>\r\n* A fascinating tale of butt-kicking, love and woe that doesn't take itself too seriously.<br/>\r\n* Spectacular combos, flashy finishing moves and butter-smooth animation.<br/>\r\n* A variety of stages and experiences - more than just whacking bad guys with a sword.<br/>\r\n* Bosses, mini-bosses, big bad guys and little bad guys, oh my!<br/>\r\n* Ever rode a pig? A battlebot? A fire-breathing dragon!? Now you can!<br/>\r\n* Collectible outfits and weapons.<br/>\r\n* Unlock and upgrade badass skills as you level up.<br/>\r\n* And that's just a taste! You'll have to discover the rest for yourself. Good luck, adventurer.", "metacritic": null, "released": "2018-08-09", "tba": false, "updated": "2022-11-11T21:12:35", "background_image": "https://media.rawg.io/media/screenshots/0ed/0edb36f0a130721cca7142c3893b5765.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2}, "playtime": 0, "achievements_count": 90, "ratings_count": 3, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 3, "platforms": ["PlayStation 4", "Xbox One", "PC", "iOS", "Android"], "developers": ["Bending Spoons Apps IVS", "Hit Box Games", "Huang YueFeng", "Puppet Depot Games", "east2westgame"], "genres": ["Action", "Adventure", "RPG", "Arcade", "Casual", "Indie"], "publishers": ["Bending Spoons Apps IVS", "East2West Games", "Huang YueFeng", "east2westgame"], "esrb_rating": null}