{"id": 792781, "slug": "voidplane", "name": "Voidplane", "name_original": "Voidplane", "description": "<p>Voidplane is an open world survival game about surviving in a new strange dimension. Also will incorporate <em>some </em>elements from the horror genre, such as jumpscares.</p>\n<p>VERY <strong>VERY</strong> EARLY in development, so early that this shouldn't even be on this site, but feel free to try it out. Currently there are very few features.</p>\n<p><strong>CONTROLS<br/></strong></p>\n<p>Standard WASD controls, but there is no jumping. This is an intended feature of the game. Will add a replacement feature for jumping in the future.<br/></p>\n<p><strong>THE MAP</strong><br/></p>\n<p>The map currently consists of two large islands that are in the middle of an ocean. A large river travels in between these islands. This is also where your base is located. Around the islands you can find large grassy and stony hills and some void ocean \"bubbles\" that can be climbed on top of.<br/></p>\n<p><strong>FEATURES<br/></strong></p>\n<ul><li>Wacky physics. If you manage to get into a situation where you are in mid air, you can pick up serious momentum and even fly around the map. Try getting to a high point, dropping down and using hills to bounce around. If managed, it's super fun.</li><li>Stationary health bar. Your health bar is located at your base, so you never know what your health is if you're not near your base. This is an intended feature. The health bar works, but if it goes down to zero, nothing will happen yet. There is also no way to replenish your health bar as of right now.</li><li>Void aurora. Just a particle system to mimic a type of weather found in the area.</li><li>Enemy. There is a blue capsule that will follow you around the map. The AI can be a little buggy right now and I'm working on fixing that.</li></ul>\n<p>Have fun! :D</p>", "metacritic": null, "released": "2022-05-24", "tba": false, "updated": "2022-05-27T15:45:23", "background_image": "https://media.rawg.io/media/screenshots/1af/1af0c3ac69e8c20aaec28dd44cf7ab68.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["2coolmon2"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}