{"id": 79284, "slug": "heroes-and-castles-premium", "name": "Heroes and Castles Premium", "name_original": "Heroes and Castles Premium", "description": "The Undead Horde and their Orc and Goblin allies are at your castle gates, the King is on the brink of death, and only you stand between the enemy and complete annihilation! Choose one of many powerful heroes, summon an army to fight beside you, and defend your castle in Heroes &amp; Castles, a seamless blend of 3rd person Action-RPG, Strategy, and Castle Defense elements! <br/><br/><br/>-----FEATURES-----<br/><br/>CASTLE DEFENSE, STRATEGY, AND ACTION-RPG GAMEPLAY!<br/>Take to the battlefield in an immersive 3rd person perspective, summon entire armies to fight beside you, and defend your castle to the death! Fight in the middle of a huge battle that you control!<br/><br/>UNIQUE, POWERFUL HEROES!<br/>Level up, learn new skills and abilities, find randomized Runes and loot, and destroy your enemies with one of many unique heroes!<br/><br/>SUMMON HUGE ARMIES TO FIGHT BESIDE YOU!<br/>Summon Dwarves, Archers, Pikemen, Giants, Catapults, Mages and much more to aid you in your defense! Watch them battle the enemy right beside you!<br/><br/>BUILD AND UPGRADE YOUR CASTLE!<br/>Build Towers, upgrade your castle walls, and build buildings to upgrade your units!<br/><br/>2 PLAYER COOPERATIVE MULTIPLAYER!<br/>Team up with a random ally or one of your friends and compete in the GameCenter leader boards! <br/><br/>TONS OF ENEMIES TO BATTLE!<br/>Fight against dozens of enemies on screen at once, from hordes of the Undead, to Orcs, Goblins, Ghouls, Siege Wagons, Trolls, Catapults, Mummies, and more! <br/><br/>ADVANCED GRAPHICS AND TONS OF FEATURES!<br/>Incredible mobile graphics and lighting, iCloud saving, full iPhone 5 widescreen display support, and much more!<br/><br/>----------<br/><br/>Search for Heroes &amp; Castles on Youtube for awesome gameplay footage!<br/><br/>Visit the forums at http://heroesandcastlesforum.com for all your Heroes and Castles questions, answers and discussion!<br/><br/>Follow us on Twitter @FoursakenMedia or like us on Facebook for more Heroes &amp; Castles news!", "metacritic": null, "released": "2013-01-17", "tba": false, "updated": "2019-07-29T10:58:42", "background_image": "https://media.rawg.io/media/screenshots/ffb/ffb71c9e075c21f543c9045620d7643a.jpg", "website": "http://foursakenmedia.com/?portfolio=heroes-castles", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Foursaken Media"], "genres": ["Action", "Strategy"], "publishers": ["Foursaken Media"], "esrb_rating": null}