{"id": 79287, "slug": "zombie-derby-race-and-kill", "name": "Zombie Derby: Race and Kill", "name_original": "Zombie Derby: Race and Kill", "description": "Do you have the drive to survive? Real men have two favourite things: cars and guns. And no stinking zombie apocalypse is going to change that. <br/><br/>Take control of your car to see how far you can get and how many zombies you can kill – and if you can actually escape with your brains intact.  6 cars are available to get you to the final fort, each capable of holding progressively more loot. Ranging from the simple Redneck pick-up and the classy Hunter and to the tough Sledge and frankly-silly Harvester, you’ll enjoy throwing these bodged-up jalopies at the lines of the undead. <br/><br/>Each is highly customisable, with 15 upgrades including spiked bumpers, improved tyres, buffed engines, and more ammo, fuel and nitros. With 5 locations to traverse, handsome 3D graphics and gory shambling bodies, Zombie Derby is a killer game. How far can you get before they get YOU?<br/><br/>Game Features:<br/>- 6 killer cars to drive<br/>- 5 vast levels to explore<br/>- Massively customisable vehicles<br/>- Gory 3D graphics<br/>- Addictive gameplay<br/>______________________________________ <br/>Thanks for choosing Zombie Derby! If you like the game, please consider rating or leaving your review. We appreciate all the feedback!<br/><br/>Keep track of HeroCraft game news and updates!<br/>twitter.com/Herocraft <br/>youtube.com/herocraft <br/>facebook.com/herocraft.games", "metacritic": null, "released": "2014-04-10", "tba": false, "updated": "2019-07-30T03:11:11", "background_image": "https://media.rawg.io/media/screenshots/056/056d06ceb263ed1fa1bf1687b79cf49c.jpg", "website": "http://www.herocraft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HeroCraft"], "genres": ["Action", "Racing"], "publishers": ["HeroCraft"], "esrb_rating": null}