{"id": 792970, "slug": "a-little-block-of-land", "name": "A Little Block Of Land", "name_original": "A Little Block Of Land", "description": "<p>A minimalist farming game. Grow a selection of crops on plots of land to earn as much money as you can in three years. Decide which crops will make the best use of your limited time, make sure they get the right amount of water and watch out for winter!</p>\n<p>'A Little Block of Land' is in development. Feedback is welcomed.\r\n</p>\n<p>Enjoy!\r\n</p>\n<p>- TJ\r\n</p>\n\n<p>Hotkeys: (press the indicated number button)</p>\n<p>[1] Select water</p>\n<p>[2] Select compost</p>\n<p>[3] Select harvest</p>\n<p>[4] Next day</p>\n\n<p>HOW TO PLAY</p>\n<p>The goal of the game is simple: earn as much money as you can from your little block of land in three years. The amount is cumulative, so don't worry about investing in more plots or crops. </p>\n<p>Your journal: see information on your land's progress so far, and information on all the crops you have unlocked.\r\n</p>\n<p>The catalogue: use this to add new plots to your land and unlock new crops.</p>\n<p>Simply select which crop you'd like to plant from the selection on the right and click on which plot you'd like to plant it on. When you're ready to move to the next day, click the next day button (or press the number 4 on your keyboard - see hotkeys above). </p>\n<p>You can place compost on your crops to improve their quality (and sell price) for $20. Select the compost button and click on the crop you'd like to mulch.</p>\n<p>When you see a water drop appear above your crop, it needs to be watered.  Select the water button and click on your crop to water. Water costs $5. If you don't water your crops often enough they'll die.</p>\n<p>When you see an exclamation bubble pop up over your crop it's ready to be harvested. Select the harvest button and click on the crop. Your plot is now ready for another crop!</p>\n<p>Keep an eye on the date. There are 25 days in each season and all your crops will die in winter, so make sure you have enough time to harvest whatever you plant.</p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T17:02:34", "background_image": "https://media.rawg.io/media/screenshots/561/561c26bb8a869f2d7e13129a6fc5e9a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tj"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}