{"id": 792921, "slug": "logic-flag", "name": "Logic Flag", "name_original": "Logic Flag", "description": "<p>Logic Flag is a game combining the minesweeper loved worldwide with nonogram. Use your concentration and logic to find all the flags. It may be simple but once you play the brain stimulating puzzle, you won’t be able to get your mind off of it.</p>\n<p>You can figure out the location of the flags by looking at the numbers written on the puzzle. By comparing the numbers given vertically, horizontally, and in middle, you can logically figure out where the flags are located.</p>\n<p>How to play</p>\n<p>•The numbers above the column tell you the number of flags in that column.</p>\n<p>•The numbers on the left of the row tell you the number of flags in that row.</p>\n<p>•The number in the square tells you the number of flags in the 9 squares around the number square.</p>\n<p>•Left click to mark the squares where there are no flags.</p>\n<p>•Right click to place flags on the squares.</p>\n<p>•By pressing on ‘Memo’, you can temporarily mark where there are flags or not.</p>\n<p>•When the puzzle is too difficult to solve, press ‘Hint’ and touch the square you are having trouble with.</p>\n<p>How can I become a master of Logic Flag?</p>\n<p>•First, try finding the squares where you know there are flags for certain. As you take time and look carefully at the numbers, you will be able to find the flags easily.</p>\n<p>•Trying using the memo when your stuck. If you keep a memo of where you think the flags are, you will find out if the square you thought has flag or not. </p>\n<p>•Try comparing the two numbers at once. If you combine the information from a number on one side to the information from another number on the other side, you can specify the location of the flags.</p>\n<p>•Look carefully around the flag you have just found. The flag you have just found can be a clue to finding other flags around.</p>\n<p>•Find the flags in places where the number of flags are complex. In Logic Flag, the player earns greater score when finding flags in areas where it’s hard to be found.</p>", "metacritic": null, "released": "2022-05-24", "tba": false, "updated": "2022-05-27T16:41:57", "background_image": "https://media.rawg.io/media/screenshots/16b/16b8da7782717d542ed527f317b772b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CogDice"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}