{"id": 79297, "slug": "construction-simulator-2012", "name": "Construction-Simulator 2012", "name_original": "Construction-Simulator 2012", "description": "Roll up your sleeves and join us on the construction site! <br/><br/>Step in the shoes of a real construction worker with all it needs to set up small, mid-sized and big buildings. In the „Construction Simulator 2012” you have the possibility to take all the steps it needs for the construction of those buildings yourself. Heave the base of a small garage with a mini-digger or cast the concrete of your neighborhood’s new elementary school. Get behind the wheel of an angledozer and compress the base for a new parking lot. Or just transport pallets of roof tiles to the site…<br/><br/>If you ever dreamt of driving a telescopic crane or a flat bed truck – then this simulation is also something for you. Next to working on all important steps of a construction, you will have the chance to check out a huge fleet of realistic vehicles. No matter if you want to drive a wheel-loader, digger or regular truck – all machines will excite you with their performance. Enjoy a realistic 3D-graphic – both in your environment and the cockpit of the cars. All machines and people are well animated and elaborately portrayed.<br/><br/>Different missions lead you to diverse corners of your town: Work in a dwelling zone, an industrial area or at the harbor. The possibilities are huge!<br/><br/>Explore the big virtual world and get to know how it feels like to be the master of your own construction! <br/><br/><br/>Features:<br/><br/>•Huge fleet with realistic vehicles <br/>•Many different construction sites with exciting missions guarantee longlasting game fun<br/>•You can try out all vehicles in the gravel-pit<br/>•Likeable avatars and different cut-scenes lead to high identification with your task<br/><br/>Minimum system requirements:<br/><br/>Mac OSX 10.6.6<br/>Intel Core2 Duo with 2,4 GHz <br/>2GB RAM <br/>Ati Radeon 2600 with 256 MB VRAM, NVidia 8000 Series  with 256 MB VRAM", "metacritic": null, "released": "2012-02-05", "tba": false, "updated": "2019-07-30T04:11:37", "background_image": "https://media.rawg.io/media/screenshots/d8d/d8d98ceadeba38ca419adaeae7c8182e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 188, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["astragon Entertainment"], "genres": ["Simulation"], "publishers": ["Astragon Entertainment"], "esrb_rating": null}