{"id": 793035, "slug": "spider-web", "name": "Spider Web", "name_original": "Spider Web", "description": "1. Introduction\r\n<p>The world is a dangerous place for a spider. This is a fact that Lydia the spider knows too well. Day to day, she must build her delicately spun web and defend it from pesky bugs and ornery humans. With her unique set of stunning skills, maybe these irritating bugs can become a delightful treat?</p>\r\n2. Objective\r\n<p>The objective of <em>Spider Web</em> is simple: protect your web and survive as long as possible. You can move around your web in any direction to avoid getting hit by the two bugs flying sporadically around your web and the human's swatter which is both trying to help and hurt you. Using your stunning powers, you can fire at the bugs to stop them in their tracks and leave theme vulnerable. Once you've stunned a pesky bug, you can eat it and increase your strength. Be careful, though, because your stunning ability won't last forever!</p>\n<p>As you continue to stun and eat bugs, your environment will change and the bugs and human will become more irritated, moving faster and swinging their swatter harder and more often. Try your best to manage the bugs and avoid the swatter to make it all the way to the end!</p>\r\n3. Game Controls\r\nGame Reset Switch\r\n<p>The game reset switch located on your Atari 2600 will reset all your progress and return your game to the beginning logo screen.</p>\r\nPlayer Skill Switches\r\n<p>These two switches, left &amp; right difficulty, determine the starting level once you enter the game from the title screen. For normal gameplay, it is recommended to leave both switches on Novice or B to begin the game from level 1. The following table outlines the possible settings.</p>\r\nLevel161116Left DifficultyNovice (B)Expert (A)Novice (B)Expert (A)Right DifficultyNovice (B)Novice (B)Expert (A)Expert (A)\r\nTV Type Switch\r\n<p>Set this switch to <strong>COLOR</strong> if you have a color television set. Set it to <strong>B-W</strong> to play the game in black-and-white.</p>\r\nGame Select Switch\r\n<p>This switch is not used for this game. But if you try, you may find some unexpected use.</p>\r\n4. Using the Controllers\r\n<p>Use the <strong>CX10</strong> or <strong>CX40</strong> Joystick Controllers with this Atari(r) Game Program(tm) cartridge. Be sure that the controller cables are firmly plugged into the <strong>Left Controller</strong> and <strong>Right Controller</strong> jacks at the back of your Atari Video Computer System(tm) depending on the Game Variation selected. For single-player games, use the <strong>Left Controller</strong> jack. Twin stick or two-player games require a second joystick controller be plugged into the <strong>Right Controller</strong> jack.</p>\n<p>Hold the controller with the red button to your upper left toward the television screen. See Section 3 of your Video Computer System Owner's Manual for further details.</p>\n<p>The joystick controller plugged into the <strong>Left Controller </strong>jack will always control the vertical and horizontal movement of the player. In single-player games, the button on the joystick will fire a projectile in the direction that the player is facing when pressed.</p>\n<p>The joystick controller plugged into the <strong>Right Controller</strong> jack will control the direction of and fire the projectile when engaged and playing in twin-stick or two-player games.</p>\n<p>When in twin-stick or two-player games, the buttons on both joystick controllers are only used to progress through game screens.</p>\r\n5. Game Variations\r\n<p>\n</p>\n<p><strong>Spider Web </strong>has three main variations determined by which joystick presses the button on the title screen.</p>\r\nA. Single Player\r\n<p>This variation is selected by pressing the button on the joystick plugged into the <strong>Left Controller</strong> jack. Only one joystick controller is required.</p>\n<p>The joystick determines the movement and direction of fire of the player. The button on the joystick fires projectiles from the player and can be held down to rapidly fire.</p>\n<p>This variation can prove to be more difficult because the player is required to both evade and stun bugs using the same directional input while also avoiding the swatter.</p>\r\nB. Twin-Stick\r\n<p>This variation is selected by pressing the button on the joystick plugged into the <strong>Right Controller</strong> jack. It is required that two joystick controllers be plugged into the <strong>Left Controller</strong> and <strong>Right Controller</strong> jacks and that both joystick controllers are placed firmly on a steady surface.</p>\n<p>One player uses both joysticks at the same time, the joystick plugged into the <strong>Left Controller</strong> jack to control the movement and the joystick plugged into the <strong>Right Controller</strong> jack to control the firing direction of the player. Button presses are not required to control the player in this variation.</p>\n<p>This variation can make evading and stunning bugs easier for a single player by controlling movement and firing independently.</p>\r\nC. Two Player\r\n<p>This variation is selected by pressing the button on the joystick plugged into the <strong>Right Controller</strong> jack. It is required that two joystick controllers be plugged into the <strong>Left Controller</strong> and <strong>Right Controller</strong> jacks.</p>\n<p>One player uses the joystick plugged into the <strong>Left Controller</strong> jack to control player movement, and the second player uses the joystick plugged into the <strong>Right Controller</strong> jack to control the firing direction of the player. Button presses are not required to control the player in this variation.</p>\n<p>This variation allows one player to focus on evading danger and eating bugs to gain points while the other focuses on stunning bugs.</p>\r\n6. Helpful Hints\r\n<p>Avoid staying close to the sides for too long. Bugs will respawn near the edges of the playfield once eaten and may catch you off guard. Always keep moving. If you stand still, the swatter may have a better chance of hitting you.</p>\n<p>Once you've stunned a bug, keep firing at it with your stunning ability as you approach it. It will make sure that it remains still until you eat it.</p>\n<p>If you're having trouble progressing beyond a certain level, try setting the difficulty switches to practice at a higher level with more life or try playing in twin-stick mode to give you better control over the player.</p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T17:26:54", "background_image": "https://media.rawg.io/media/screenshots/a35/a35aa16b1b2f7ee6314bfc7e0f40c1c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cooper Dalrymple"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}