{"id": 793017, "slug": "whenever-you-can-breathe", "name": "whenever you can breathe", "name_original": "whenever you can breathe", "description": "whenever you can breathe\r\nRPGMaker MV (2022), 30-60 minutes (3 endings)\r\n<p><em>[<strong>content warnings:</strong> this game explores mental health, self harm, suicide, the difficulties of growing up queer, parent issues, dysmorphia, and some drug use. this game is largely autobiographical. engage with it but also please take care of yourself.]</em></p>\n<p><strong>whenever you can breathe is an autobiographical short RPG about grocery shopping. It's about being stuck. It's a hanging out with your friends sim. It's about weird spatial relationships. It's about grounding. </strong>I thought I could make this game, but I really barely could. </p>\n<p>I find that through my art practice, I narrow myself into a tunnel \"looking for a solution,\" and through the process, remember there is never just \"a solution.\" We hang out at the local grocery store (before, around 1AM, now, around 10PM). We look at products we don't need and won't buy. There isn't much money. Someone sends a text message. Someone else doesn't see it.</p>\n<p>I really want to make cool looking radical political games, but I still have a lot of issues to sort through. Mood-based art practice, game dev rooted in emotions. Not everything is \"right\" here.<br/></p>\n<p>But we're working from within the margins, and that can be kind of political, too.</p>\n<p>This game has been many games before being this one / / /<br/></p>\n<p>I think I'll make a roguelite next / / /<br/></p>\n<p>I think I'll go back to video art / / /</p>\n\n\n<p><strong>Instructions:</strong><br/>move - arrow keys<br/>interact - z<br/>camera - q, e</p>\n<p>thanks to royaltyfreak music for songs<br/>thanks cutievirus for the RPGMAKER 3D MV PLUGIN</p>\n<p>special thanks to mariken for sprite generation help<br/>special thanks to my friends mary, resni, taylor <br/>who have helped a great deal&lt; 3 &lt; 3 &lt; 3<br/>and everyone else, the discord, my roommates <br/><br/><em>whenever you can breathe was in part made with <br/>funds from the queer games bundle 2021.<br/><br/>please email me with bugs. I'm sure there are many ~</em></p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T17:20:28", "background_image": "https://media.rawg.io/media/screenshots/ad2/ad25635766caad10fb88ab86b12e63c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["nilson"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}