{"id": 793155, "slug": "war-of-the-gems", "name": "War of the Gems", "name_original": "War of the Gems", "description": "<p>THIS GAME IS IN VERY EARLY ALPHA<br/>THIS IS A PROTOTYPE WITH MANY FUTURE FEATURES PLANNED<br/><br/>The baseline features for singleplayer playthroughs have been finished, but multiplayer functionality is intended to be made in the future.<br/><br/>War of the Gems is a turn-based procedurally generated war strategy game.<br/>May or may not be inspired by the ancient SNES/SEGA classic, Gemfire.<br/><br/>When starting a new game, you can change settings for your playthrough's world, and then world(s) will be generated for you. <br/><br/>A world map is made up of hexagonal tiles (and possibly bridges), and is initially entirely owned by one faction. There is a pre-war simulation at the start of a game, during which several tile states should revolt against their rulers and fight for independence as new factions. Factions then proceed to fight other factions for tile dominance in order to spread their influence.<br/><br/>Battles with the player involved take place in battle scenes, in which units are controlled to either wipe out all opposing units or capture the enemy's flag.<br/><br/>There are gems in every world (unless the feature is turned off), and gems are owned by factions. Gems will always be magic-using units, and will either be mages or dragons. When a new faction gains it's independence, it attempts to steal some gems from the faction it succeeded from, and when a faction is eliminated, it's successor takes all the gems that they owned prior.<br/><br/>The first faction to own every tile in a world's map wins the game.<br/><br/><br/>note: pressing \"P\" at any time while the game is running will take a screenshot!<br/><br/><br/>Let me know if you enjoy the game, it's been a lot of work, and i'll be happy to add more to it if it's well received.<br/><br/></p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T18:17:49", "background_image": "https://media.rawg.io/media/screenshots/d7b/d7b988cc69cd18058ff73cf9cdf946e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["sprvlln"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}