{"id": 793151, "slug": "dan-powers-puzzle-dungeon", "name": "Dan Power's Puzzle Dungeon", "name_original": "Dan Power's Puzzle Dungeon", "description": "Go Fool Yourself!\r\n<p>...is what my friend Dan would say when he pitched this game, over 10 years ago now.</p>\n<p>Hi, I'm Josh. This game was made by my friend Dan Power, who I haven’t seen since 2009. This was the last thing he sent to me before he stopped responding to my texts. I’m sharing this now in desperation, I’ve tried tracking him down just to make sure he’s okay and I can’t find him. I think he would have wanted me to release this for him, to share his passion for games. If nothing else, maybe someone who sees this knows him.</p>\n<p><strong>Before you play this</strong>, know that Dan can be a bit... eccentric. He's an older gamer and he comes from a time and place that had a very specific definition of what a gamer looked like. A lot of his earlier work was just blatant references to other material he enjoyed. But<strong> please be patient with him</strong>, because past his narrow-mindedness and those dumb \"puzzles\" that no one would ever figure out if he didn't have a walkthrough in the game is a really sweet old guy who just really likes video games, and I want to find him and make sure he's okay.</p>\n<p>If you have any information about Dan, please reach out to me at josh@joshaaronmiller.com.</p>\n<p>Thanks.</p>\n\n\n<em>The Adventure That Plays You!</em>\n<p><em>\"Using a novel <strong>Decision Parser</strong> to predict your every move and create your personal hell of a dungeon!\"</em></p>\n\n\n\n\r\nPlay time: 2-3 hours\r\n\n\r\nAccessibility Details\r\n<p><strong>+</strong> Playable with mouse and keyboard (never requires both at the same time or coordination between them)</p>\n<p><strong>+</strong> Minimal timing challenges (mostly turn-based)</p>\n<p><strong>+</strong> No color-only cues</p>\n<p><strong>+</strong> No audio-only cues</p>\n<p><strong>-</strong> Some low-contrast elements may be difficult to see for vision-impaired players</p>\n<p><strong>-</strong> Moderate color flashes</p>\r\n\r\nContent Warnings\r\n<p>Dan can sometimes be a bit strong in his language, abusive toward the player, and sometimes he comes off as bigoted toward various groups. For more details, email me at josh@joshaaronmiller.com</p>\r\n\r\nControls\r\n<p>This is a mouse and keyboard game. Please refer to Dan's included manual for how to play.</p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T18:15:44", "background_image": "https://media.rawg.io/media/screenshots/fc0/fc08159a0e33e6bf89c169c050775cbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["joshaaronmiller"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}