{"id": 793165, "slug": "battle-toys", "name": "Battle Toys", "name_original": "Battle Toys", "description": "BattleToys\r\n<p>builds on the original idea of a minigame called <strong><em>Wii Tanks</em></strong> and greatly expands into every direction. Navigate your little tank through various tough levels and worlds.<br/>At every end of the world an unique strong <strong>boss</strong> awaits you.</p>\r\nInclued Features:\r\n<ul><li><strong>36 available levels</strong> spread across 4 worlds, more in development.</li><li><strong>4 available difficulties</strong>, from beginners and to pro-level gamers to offer a real challenge.</li><li>Unlock<strong> customizations </strong>and unique <strong>abilities</strong> that will help you through your campaign to make your journey easier (Currently available, but will be finished later on).</li><li>Full <strong>controller support</strong>. Navigating through menus and choose between 2 different control options.</li><li>Optimized for <strong>Low-End devices,</strong> available through the Graphic-Settings.</li></ul>\n\r\nPlanned Features:\r\n\r\n<ul><li>Create your own levels with a <strong>level editor</strong> and share them online to challenge other players.</li><li>At least <strong>80-100 levels</strong> with an unique completely different final boss.</li><li><strong>Achievements</strong>, combined with unlockables such as customizations and abilities.</li><li><strong>Steam Release</strong>: When it's finished, or ready for Early Access.</li><li>(Mobile version): Already tested and supported with mobile UI/Controls. Might be released later on.</li><li>(In consideration): A short simple story.</li><li>(In consideration): Different Gamemodes</li><li>(In consideration): Local Coop</li></ul>\r\n\r\nFeedback:\r\n<p>Feedback and playtesters are strongly needed to improve the game and find undiscovered bugs.<br/>If you have any bugs/questions/ideas or improvements for the game, please mail me under: <em><strong>support@sperlich.at</strong></em> or <strong><em>pifoxd@gmail.com</em></strong> or write a comment :)</p>\r\nNotice: \r\n<p>This is not the final product and it may differ from the final product. It is still in Beta and development has been going on for about <em>~10 months</em>. You may encounter various bugs, Save-Game problems or launching issues. If you have any specific informations, please send me a mail.</p>\n\r\nGitHub:\r\n<p>Did you know? You can look up most of my source code on GitHub too:<br/>BattleToys GitHub</p>\n<p>Thanks for anyone that is willing to try my game!</p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T18:22:06", "background_image": "https://media.rawg.io/media/screenshots/b8a/b8a3486fc48f9f4f17efa0cc35050545.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MrPifo"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}