{"id": 793258, "slug": "inner-room", "name": "Inner Room", "name_original": "Inner Room", "description": "\n<p>Before the <strong>pandemic</strong>, many of us lived in a world where we were constantly stretched to the limit. Constant overwork to reach the <strong>heights of success</strong> is a path around which many build their <strong>lives and identities</strong> in society. <br/></p>\n<p>Life as we knew it took a twist a couple of years ago. People lost jobs, friends, and family members. They were ordered to stay at home by themselves, trying to figure out how to adapt, create, and exist in this <strong>new world</strong>.\r\n</p>\n\n<p><strong>Mental health</strong> took a backseat in many countries. Protecting individuals’ physical well-being demanded an urgent response - and other treatments were put on pause. For many, the start of the pandemic was not a trigger but a multiplier of a previous condition. How is it possible to manage <strong>depression</strong> when you must remain detached from those around you? How is this impacting our lives <strong>today</strong>?\r\n</p>\n\n\n<p>The challenges of living with <strong>mental health</strong> illness often make you see the condition as something alien. We believe that <strong>psychoeducation</strong> is a key factor for people who are struggling with their <strong>mental health</strong> and also for generating awareness for those who don’t understand it.\r\n</p>\n<p>Intense stigma persists around <strong>depression</strong>. If our game can communicate one idea it would be to seek <strong>help</strong>, advice, and guidance in an attempt to remove the shame and <strong>guilt</strong> attached to this struggle. Ultimately the realization of our main character is that he needs to look at himself with different eyes to work on his <strong>healing journey</strong>.\r\n</p>\n\n<p>The other theme we want to address is the importance of self-reflection. In our game, we deal with intergenerational <strong>trauma</strong>. Our protagonist is carrying the weight of his past and when he confronts it he can make <strong>new meaning</strong> out of it.</p>\n\n\n<p><strong>Inner Room</strong> is a game where you play three days of <strong>lockdown</strong> as a person dealing with <strong>depression</strong>, where his place of true <strong>elaboration</strong> is in his <strong>dreams</strong>. </p>\n<p>When awake, our main character must complete the most <strong>mundane tasks</strong> – waking up, eating, showering, and opening a window. In any typical game, these tasks would require just one click. Now you will need your whole keyboard to sort them out.\r\n</p>\n\n<p>When dreaming, the character will connect with his inner life and past, trying to answer one question that appears small but weighs very heavily on him: '<strong>Why can't I cry?</strong>'</p>\n<p>Our <strong>typing</strong> game approach will help you to make sense of the world around you, both awake and asleep. And the unconsciousness will pop up from time to time to interpellate the player and deconstruct and construct new ideas that ultimately, through an elaborative process, will help you look at your condition from a closer and more <strong>meaningful perspective</strong>.</p>\n\n\n<p>Look at the letters on the screen and type to interact with the game.</p>\n\n<p><em>This game was made for the May Day Mental Health Game Jam 2022. All assets, music, and programming were made at the time of the jam. Enjoy.</em><br/></p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T19:01:43", "background_image": "https://media.rawg.io/media/screenshots/7a3/7a3638aff70463f8732170350d9ceec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Expo", "fallthem000", "byebyesama", "Mateo Alayza", "PabloCarrito", "alberto.aznaran", "Jaime Chirif - Sound", "Triunfaremos"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}