{"id": 793226, "slug": "mobile-game-simulator", "name": "Mobile Game Simulator", "name_original": "Mobile Game Simulator", "description": "<p>A game about playing mobile games in order to learn about their unethical tricks and to occasionally laugh at their low quality. The game was originally intended to be satirical and not particularly educational but I pivoted towards an educational angle towards the end. I'll let you be the judge of if any of the satire that I left landed (though there wasn't much to begin with).</p>\n\n<p>This is just a prototype and I imagine it'll stay that way, except for maybe some bug fixes and a couple of features in an update. I might not update it at all though. This was originally planned to be more fleshed out but time constraints... I'll probably release the original design document and other things later on though if you're curious to know what got cut and how it changed.</p>\n\n<p>If you're curious to see how I made the game, I'll probably make a full devlog series on its development soon. But in the meantime or if you want a closer look, the source code is available on my GitHub under a GPL 3 license.</p>\n\n\n\n<p>Known issues (I might fix these at some point):<br/></p>\n<ul><li>Saving and loading doesn't work (it's not implemented at all yet :P)</li><li>The light gets stuck in the dark state in DNG if you hold click</li><li>Some of the facts are probably inaccurate :/</li></ul>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T18:47:18", "background_image": "https://media.rawg.io/media/screenshots/127/12793913b35fc6570da6203557271802.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Nico Clack"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}