{"id": 793236, "slug": "escape-the-shark", "name": "Escape the Shark!", "name_original": "Escape the Shark!", "description": "<p>Controls:<br/></p>\n<p>W = up,</p>\n<p>S = down,</p>\n<p>A = left, </p>\n<p>D = right,</p>\n<p>Q = use/throw,</p>\n<p>Comma/\",\" = swap items left,</p>\n<p>Full stop/\".\" = swap items right</p>\n\n<p>Research:</p>\n<p>https://wakecoll.sharepoint.com/:w:/r/teams/STU-DEL3MGD2F000-21-Channel2/Shared%... <br/></p>\n\n<p>Desc(ription):</p>\n<p>IMPORTANT!</p>\n<p>This game is not 100% complete, neither an official game, nor the best game in the world. It has only been made for a programming project that I could practice my skills on, so I apologise if it's quite bad.</p>\n\n<p><em>The Story</em></p>\n<p>You’re a mermaid/merman (or any other creature, if you wish) swimming in the ocean, minding your own business – when suddenly “Dun dun. Dun dun. Dun dun, dun dun”! A SHARK swims at you with its sharp, pointy teeth! You dodge its attack and swim as fast as your fins and tail can take you as the shark swims after you!</p>\n<p>As you swim, you rapidly notice there are other nasty sea creatures including <strong>electric eels</strong> that, with one touch, can stun you; as well as <strong>spikes </strong>pointing out of the ground, and <strong>arrows </strong>that are shooting from your left and right.</p>\n<p>But you also notice there are strange-looking man-made objects like a <strong>sea scooter</strong>, to help you swim faster; an <strong>arc jacket</strong>, to protect you from being electrocuted by eels; a <strong>shield </strong>to hold between you, spikes and arrows, to keep you from being hit; and many other items.</p>\n<p>You think to yourself “I must use these objects to guard myself from the dangers of the sea, or else – I’ll be SHARK BAIT”.</p>\n<p>Remember: Use those collectible items, “Just keep swimming” and you’ll be alright. Otherwise, the shark WILL get you!\r\n</p>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T18:51:58", "background_image": "https://media.rawg.io/media/screenshots/7f4/7f49fbe24041a9bcf31956af6f1296a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ste17001813"], "genres": [], "publishers": [], "esrb_rating": null}