{"id": 793248, "slug": "biotopico", "name": "Bíotópico", "name_original": "Bíotópico", "description": "Welcome to Bíotópico!\r\n\t\t\r\n\t\tFocus Your Breath, Grow (Real!) Trees\r\n\t\t<p>\r\n\t\t\tBíotópico (bee-oh-toh-pea-ko) is the first and only breath exercise game designed specifically for the Playdate™ system.\r\n\t\t</p>\n<ul>\n<li>Focus on breath practice as a daily ritual with your Playdate</li>\n<li>Gather Oxygen and use it to plant (real!) trees</li>\n<li><em>[Coming Soon]</em>  Collect unique and rare seeds</li>\n<li><em>[Coming Soon]</em>  Plant to restore balance across 7 distinct biotopes</li>\n<li><em>[Coming Soon]</em>  Maintain your soil and sunlight to optimize growth</li>\n<li><em>[Coming Soon]</em>  Cultivate and harvest ripe plants</li>\n<li><em>[Coming Soon]</em>  Collect unique and rare seeds through breath practice</li>\n</ul>\r\n\t\t\r\n\t\tWait. . . The Breath As Gameplay?\r\n\t\t<p>\r\n\t\t\tAbsolutely! Intentional breath focus, even in short sessions, has numerous physical and cognitive benefits. Our focus is on reminding the player that taking that moment to breathe feels good, both in the context of the gameplay moment and more generally. <br/><br/>\r\n\t\t\t\r\n\t\t\tIn addition to its full-scale breath and meditation features, Bíotópico will also integrate micro-exercise breath practice directly into the gameplay flow in future iterations.\r\n\t\t</p>\r\n\t\t\r\n\t\tGrow Yourself, Grow A Tree\r\n\t\t\r\n\t\t<p>\r\n\t\t\tOur breath intrinsically links us to the ecological life cycle of plants, through oxygen and carbon dioxide exchange. This is one of the reasons we've picked biotopes as the theme and gameplay focus.<br/><br/>\r\n\t\t\t\r\n\t\t\tIn Bíotópico, players <strong>can grow real trees</strong> using the Oxygen resource that is produced from their breath practice. We’re partnering with OneTreePlanted.org to plant a physical tree on the player’s behalf each time a digital tree is grown.<br/><br/>\r\n\t\t\t\r\n\t\t\tWe’re committed to offsetting the carbon footprint of this game’s development time, and this is one facet of that effort. It also gives the player a small amount of external motivation, which is sometimes all it takes to launch a healthy routine.\r\n\t\t</p>\r\n\t\t\r\n\t\tWhy the Playdate?\r\n\t\t\r\n\t\t<p>\r\n\t\t\tGood question. We love that the Playdate allows for intentional focus on a single experience. It’s convenient, purposeful, delightful, and restorative; everything we hope Bíotópico can be. The unique built-in crank inspires a ton of creative use allowing for unique practice types, and its tiny form factor makes it easy to keep nearby all the time. We think starting a routine of breath practice is right at home with Playdate.<br/><br/>\r\n\t\t\t\r\n\t\t\tScroll Down For Playdate Download<br/><br/>\r\n\t\t\t\r\n\t\t\tIf you don't own a Playdate you are interested in playing the game on your PC/Mac (without access to the console's adorable crank...), please download the Playdate SDK, install it, and then open the downloadable .PDX file at the bottom of this page. Please note that this SDK tool is meant for game development, and isn't optimized or ideal for actually playing games with.<br/><br/>\n</p>\r\n\t\t\r\n\t\tUpcoming Features, Reaching Further\r\n\t\t\r\n\t\t<p>\r\n\t\t\tAs it goes with most game jams, there wasn't even close to enough time for us to realistically get done what we designed (while maintaining our healthy and \"crunch\"-free working pace)! Below are a few of the things we couldn't find time to implement, but have fully designed and will implement after game jam is completed:\r\n\t\t</p>\n<ul>\n<li>7 distinct and diverse biotopes, including Frozen Tundra and Savanna</li>\n<li>Dozens of additional scientifically-proven breath practice variations</li>\n<li>100+ seeds to collect, with 15 plants per biotope</li>\n<li>iOS and Nintendo Switch releases, potentially</li>\n<li>The “Grounded” expansion: use harvested fruits, vegetables, flowers, and leaves to create specific nutrient-rich compost and soils that encourage plant health and growth speed!</li>\n</ul>\n<p>\r\n\t\t\tIn addition to our committed interest in the Playdate, our intention may be to eventually give a more diverse audience access to Bíotópico. Many of the breath practices in the game are specific to the hardware and format of the Playdate; these will be thoughtfully reconsidered and adapted to mobile device touch screens and other platforms.\r\n\t\t</p>\r\n\t\tThe Game Jam Schedule\r\n\t\t\r\n\t\t<p>\r\n\t\t\tThe experience of Bíotópico is meant to target one specific aspect of mental health treatment, the breath, by incorporating it directly into the gameplay loop design. The game was <strong>conceptualized and developed entirely from scratch</strong> during the 3-week DeepWell DTx May Day Mental Health Jam 2022.<br/><br/> \r\n\t\t\t\r\n\t\t\t\r\n\t\t\t\r\n\t\t\tWe spent the first week deep at an off-site retreat, in full-blown R&amp;D mode, playing a myriad of health-related experiences and conceptualizing aspects of a few general design directions. Once we settled on the breath as a topic, the week was almost exclusively focused on how that could be restorative for players. It was important to us that this part of the experience could stand on its own; in the event that we (inevitably) ran out of time during the game jam, it could still exist as a useful breath practice tool.<br/><br/>\r\n\t\t\t\r\n\t\t\tThe second week was spent primarily honing that concept and ideating on how to integrate it directly with various gameplay mechanics. We also spent many days doing physical sketches of a variety of things, including art drafts, designs, and plenty of gameplay organization spreadsheets.<br/><br/>\r\n\t\t\t\r\n\t\t\tThe final week was spent prototyping it in code, using the Playdate’s SDK and Lua as the platform. Over the three weeks, we spent roughly 150 hours total across the two team members. About 70% of that time was spent on ideation, design, and iteration. The remaining 30% was spent making the assets and programming. As mentioned above, to us the idea and concept were more important than rushing the execution. We plan to continue development after the game jam is compelete, and encourage any feedback from the judges or members of the community.<br/><br/>\n</p>\r\n\t\t\r\n\t\tThe Team\r\n\t\t\r\n\t\t<p>\r\n\t\t\tBíotópico was made by Everyday Lemonade (@Everyday_Lemons), a two-person creative studio. <br/><br/>\r\n\t\t\t\r\n\t\t\tFoster Douglas - Design/UX, Audio, Programming, \"Marketing\"<br/>\r\n\t\t\t@_FosterDouglas<br/><br/>\r\n\t\t\t\r\n\t\t\tCorey Marr - Design, Art, Engineering<br/>\r\n\t\t\t@Uncle_Spaghetti\r\n\t\t</p>\n<strong>PLEASE VIEW THE MOST RECENT DEV LOG<br/>FOR A LINK TO THE NEWEST BUILD v 1 . 0 . 4 !</strong>", "metacritic": null, "released": "2022-05-23", "tba": false, "updated": "2022-05-27T18:57:50", "background_image": "https://media.rawg.io/media/screenshots/744/7441978b90f04771936246ac2620bbff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Everyday Lemonade"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}