{"id": 793431, "slug": "the-faction", "name": "The Faction", "name_original": "The Faction", "description": "In The Faction you will experience a story of action, invasion and adventure!<br/><br/>The game takes place in a camp, in an area belonging to the rival faction to that of the protagonist, where you will be able to explore the entire scenario unrestrictedly. In this area you will have to complete some objectives, like eliminate some members that are there, get some notes and steal a cargo that is in the area. For that, you'll have a medium-long-range weapon and a pistol, and you'll have to use them strategically in order to achieve your goals and make it out alive.<br/><br/>You will control Ruan, in first person and you will have to complete some tasks before reaching your main objective, being able to complete the missions stealthily or kill it. Do what you want, but leave the area alive and with the drug that must be stolen.<br/><br/>The game will provide you with a unique experience, with lots of action and strategy!<br/><br/><br/>Ruan, a member of a criminal faction, goes to a rival faction's point of operation to obstruct his enemies drug operations. Arriving in the area, Ruan comes across a paramilitary group that has taken over the place first and possibly intends to use the locality for drug operations. So Ruan decides to eliminate the members of the group to the military, and steal the drug from the rival faction that is in the locality. Arriving at the place, he realizes that the rival faction's operations log is there, and decides to take it so that his boss can investigate where the rival faction has been operating.<br/>After destroying the entire operation, and capturing the necessary information, Ruan calls the police and reports all operations in the region.<br/><br/>Are you ready to help your faction by taking down the enemy faction? Find out in The Faction.<br/><br/>", "metacritic": null, "released": "2022-05-16", "tba": false, "updated": "2022-09-09T05:18:04", "background_image": "https://media.rawg.io/media/screenshots/70a/70ae9debd0337120842750cd6535a23b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamesBraz", "waybigexe studio"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["GamesBraz"], "esrb_rating": null}