{"id": 79349, "slug": "st-medieval-wars-deluxe", "name": "S&T: Medieval Wars Deluxe", "name_original": "S&T: Medieval Wars Deluxe", "description": "The history of medieval Europe is rich in bloody wars and conflicts. The Norman invasion, the Crusades, the Hundred Years' War, the Reconquista, the Wars of the Roses, the Albigensian Crusade and endless peasant riots… A new game in the Strategy &amp; Tactics series gives you an opportunity to try your strength in confrontations between the most ruthless conquerors.<br/><br/>In Medieval Wars: Strategy &amp; Tactics you are to lead the armies of England and France as well as the armies of crusaders in three campaigns and try to win the biggest wars and battles of European medieval history. Scenario maps will let you take part in Russian feuds, stop the Saracens under the flag of Charles the Great and lead The Hussites.<br/><br/>After winning all the fascinating battles of Campaign and Scenario mode, try Hotseat multiplayer mode.<br/><br/>Medieval Wars: Strategy &amp; Tactics: It’s time to march off!<br/><br/>Game Features:<br/>- No in-apps<br/>- 4 historical campaigns, with 25 missions in total<br/>- 11 independent historical scenarios<br/>- Several Skirmish mode maps<br/>- 21 types of units <br/>- Multiplayer mode Hotseat<br/>- Turn-based battles, economic and military research<br/>- 13 states will fight a brutal war for European supremacy in 6 scenarios<br/>______________________________________ <br/><br/>Keep track of HeroCraft game news and updates!<br/><br/>twitter.com/Herocraft <br/>youtube.com/herocraft <br/>facebook.com/herocraft.games", "metacritic": null, "released": "2015-02-25", "tba": false, "updated": "2019-07-30T03:15:25", "background_image": "https://media.rawg.io/media/screenshots/d5a/d5a44a681274c437880a6142de065497.jpg", "website": "http://www.herocraft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HeroCraft"], "genres": ["Strategy", "Board Games"], "publishers": ["HeroCraft"], "esrb_rating": null}