{"id": 793402, "slug": "an-untitled-zombie-game", "name": "\"An Untitled Zombie Game\"", "name_original": "\"An Untitled Zombie Game\"", "description": "<p><em>\"An untitled zombie game\" is a first person zombie survival shooter game which takes inspiration from Call of Duty: Black Ops Zombies. </em></p>\n<p>Make your way through the rounds and buy perks to increase your mobility, with multiple mechanics such as upgradable weapons and doors to open, there isn't a shortage of things to do in \"AUZG\", purchase the electricity and make your way to the time machine to go back to reality and finish the story. There are also a couple of Easter eggs scattered around so be on the look out as they can give you a quick boost of cash.</p>\n\r\nQuotes\r\n<strong>Alex (naughty corner games owner)</strong> - \" When I was first introduced to \"AUZG\" I was in the darkest point of my life. my husband had just left me, my son put me up for adoption and I was into cock and ball torture practices (I still am). But ever since the release of \"AUZG\" nothing has changed. I am planning on ending it all, this game prevented my incoming demise for a few weeks but now the voices are getting to me and I cannot go on while knowing the terrible acts I have committed (read the bible its a long story). thank you LARGEUZIVERT for letting me get a shitty demo version of \"AUZG\".\"\r\n<strong>Lord Finnigus The Great (naughty corner games representative ) </strong>- \"Untitled Zombie Game is one of the most ambitious and influential games of this generation and deserves more praise. However, the game seems to be lacking deez nuts.\"\r\n<strong>Me(Me)</strong> - \"Burh\"\r\n<strong>not Alex (not Alex)</strong> - \"im not Alex\"\r\n<strong>Leo(cringe) </strong>- \"Game of the year\"\r\n<strong>Doug(cool) - </strong>\"Would have been better if came to class on time everyday\"\r\n<strong>Doug(cool) - </strong><em>\"#1 amount of time spent in naughty corner</em><em>\"</em>\n<strong>Ivan(Pro Discord Mod) - </strong>\"It has Walter White in it I thought it was pretty cool\"\r\n<strong>Alex Pannell (homie/ homo) - </strong>\"We're gay, that's why\"<strong>Antek (pog) - </strong>\"Was gonna say A tier but Walter White reference makes it an instant S\"", "metacritic": null, "released": "2022-05-19", "tba": false, "updated": "2022-05-27T20:01:21", "background_image": "https://media.rawg.io/media/screenshots/df7/df79ccefcbb6339776971c0305654ce5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["LargeUziVert"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}