{"id": 793513, "slug": "betters-alien", "name": "Betters Alien", "name_original": "Betters Alien", "description": "<p>An prototype that lets the player take the role of an alien slayer, the original goal was to have a laser beam descending from the sky in which it will inevitably terminate the player , the lore of this game can be simplified as a simulation created by aliens who underestimated the capabilities of the human race by trapping the player in an endless loop of bloodshed for their kind by the player’s hand on his objective to delay his death, the development was however less than smooth and we ended up delivering an unfinished title (it was for the Luddum Dare Game Jam but we failed to deliver something) but we learned a lot from this experience and we will apply this knowledge on our next games, we thank you for you time!</p>\n<p>RETROSPECTION:</p>\n<p>Coming with the idea new material (for an game jam)but not really knowing what we wanted at same time. It was a lot challenging cause I never wanted creating this generic game that is boring, you know I don't want having the player playing to this game and being like:</p>\n<p>\"Well, I've already seen that. It was just an waste of time.\".</p>\n<p>I wanted experimental material.</p>\n<p>DISTRIBUTION:</p>\n<p>Like I've already write, I've didn't wanted this generic material but to being honnest, I feel like it's a bit generic at this moment but it still an prototype that will probably evoluate so I would like to give an demo in HTML5 here and after that having some more feature to distribute this game as an Android app. </p>\n<p>I hope you will enjoy the whole direction of the project and you will have some fun with-it! </p>\n<p>Account's friend:https://hugo-games.itch.io</p>\n<p>CREDITS:</p>\r\nThank to Godot\r\n<p>For the sounds:</p>\r\nRetro Footsteps:\r\n<p>https://audiojungle.net/item/retro-footsteps/32953536</p>\r\nShotgun Firing (4):\r\n<p>https://pixabay.com/sound-effects/shotgun-firing-4-6746/</p>\r\nCrackling Fireplace - Nature Sounds:\r\n<p>https://pixabay.com/sound-effects/crackling-fireplace-nature-sounds-8012/<br/></p>\r\nAmbience Night Rural Campground New Zeala:\r\n<strong>https://freesound.org/people/robotjay/sounds/518555/</strong>\r\n9mm-pistol-shoot-short-reverb-7152:\r\n<p>https://pixabay.com/sound-effects/9mm-pistol-shoot-short-reverb-7152/<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-27T20:44:44", "background_image": "https://media.rawg.io/media/screenshots/91d/91d0d9ff11b950cc90ddbc828289b4d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Invitation"], "genres": ["Action"], "publishers": [], "esrb_rating": null}