{"id": 793571, "slug": "lifes-too-short-playdate", "name": "Life’s Too Short (Playdate)", "name_original": "Life’s Too Short (Playdate)", "description": "<p>In Life's Too Short, you take on the role of a celestial marriage councilor as you're tasked with repairing a rift between two vampires who have dramatically fallen out and confined themselves to their respective coffins...<br/></p>\n<p>You'll need to explore the mansion, meet various spooky characters and solve simple puzzles in order to put the mansion back together and mend the rift in the vampires' relationship!</p>\n<p>Please note: The game does not have a save function (Because I can't figure it out yet...) but I'm hoping that as you progress and learn the puzzle solutions that if you need to come back you can quickly whip back through...</p>\n<p>Also, please be gentle with any bugs that might arise! I'll be adding updates as and when these come up.</p>\n<p>Updates:</p>\n<p>- V1.1: Update to the ending music</p>\n<p>- V1.2: Small gameplay tweaks</p>\n\n<p>Early reviews &amp; kind comments:</p>\n<p>- “Well , I like it!” Abbie (Ollie’s partner)</p>\n<p>- \"Life’s Too Short was really really good. It’s reminds me of Maniac Mansion.\" Seacreak</p>\n<p>- \"Short but charming. Worth a look.\" Callmesteam</p>\n<p>- \"Absolutely loved it. Great puzzles and comedy.\" SideScrollFrank</p>\n<p>- \"Played and completed it this evening, great game! My favourite non-season title to date.\" vimto_boy</p>\n<p>- \"This game was a lot of fun! It really reminds me of one of my favorite games, Hugo's House of Horrors.\" hmhrex</p>\n\n<p>Credits:</p>\n<p>- SquidGodDev for teaching me most of what I know about Pulp (www.youtube.com/c/SquidGodDev)</p>\n<p>- Ben Perry (Beanpear) for the awesome ending music</p>\n<p>- Abbie for coming up with the name (And some decent ideas)</p>\n<p>- Everyone who helped test the game and give feedback<br/></p>\n<p>- The Playdate Discord community for being awesome</p>\n<p>- Neven for being the awesomeist <br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-27T21:09:33", "background_image": "https://media.rawg.io/media/screenshots/161/161bc7e7ee101237a18b518e4325bd6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Olliecoe"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}