{"id": 793694, "slug": "undying-lantern", "name": "Undying Lantern", "name_original": "Undying Lantern", "description": "Undying Lantern is a third-person action game set in the fantasy world of Zagrat. You work for the Holistic and Abnormal Unit for Nabbing Tricksters, also known as HAUNT. Pursue, Preserve, Persist. That is the Haunter code.<h3>Explore Mysterious Locations</h3><br/>Tricksters are dangerous criminals who will stop at nothing to escape justice. They hide in places only a Haunter can reach. <br/><h3>Master the Lantern</h3><br/>Haunters use a power known as Luminancy. Their source of power comes from the lantern that hangs from every agent’s hip. Understanding and mastering these abilities is paramount to overcoming the dangers you will face.<br/><h3>Uncover Secrets</h3><br/>Everyone has a story, and every Trickster has a weakness. It is up to you to piece together what is going on. Only then will you have a chance of taking down your target.<br/><h3>Capture the Trickster</h3><br/>You will face difficult odds that will require you to think on your feet. A fight with a Trickster is rarely a straightforward duel. <br/><h3>Core Features</h3><ul><li>Each stage has a core puzzle that needs to be solved<br/></li><li>Unlock new abilities after every level<br/></li><li>Each boss has one or more weaknesses<br/></li><li>A story told through fragmented pieces of information<br/></li><li>Includes a story mode difficulty<br/></li><li>Relatively short game with six stages in total</li></ul>", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-05-30T05:46:30", "background_image": "https://media.rawg.io/media/screenshots/055/05569c528b01687b24c1c92720e1f259.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GoldenGratus"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["GoldenGratus"], "esrb_rating": null}