{"id": 793689, "slug": "umichan-sorani", "name": "Umichan Sorani", "name_original": "Umichan Sorani", "description": "Things are rough for Zytra, rent just went up and DDDD size bras don’t come cheap. So it’s up to her to find some cash and make it quick. The mall sounds like a good place to find work. There’s plenty of jobs there but there’s also some guys that have their eye on her. Maybe she can convince them to give her some cash in exchange for letting them take her for a ride. Should she get the money the hard way? Or the “hard” way? It’s up to you in Umichan Sorani. <br/><br/><h3>Feature list</h3><ul><li>Discover 10 spicy sex scenes in Zytra’s quest for di-, I mean money (2+ different animations per scene).<br/></li><li>Explore Sorani’s branching storyline to find new “friends” to play with ;)<br/></li><li>Tired of riding cock? No problem! Zytra’s friend Violet is happy to step in and help her out.<br/></li><li>Check out some lewd selfies, we promise nobody is looking.<br/></li><li>Experience the first person perspective of being an anime girl with massive honkers. Apologies to “feet” fans but you won’t be able to see those over Zytra’s rack.<br/></li><li>Play the cafe and bar minigames to earn extra cash and meet more clients for after hours work....<br/></li><li>Unlock skimpier outfits to get extra cash or just to show off the goods.<br/></li><li>Replay the fun with the unlockable gallery.</li></ul><br/><br/><br/>", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-05-30T05:39:18", "background_image": "https://media.rawg.io/media/screenshots/9c6/9c688615886c50722bc59cb3dafb55f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1}, "playtime": 1, "achievements_count": 40, "ratings_count": 0, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vortex00"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Spiralvortexplay"], "esrb_rating": null}