{"id": 79367, "slug": "goat-simulator-waste-of-space-2", "name": "Goat Simulator Waste of Space", "name_original": "Goat Simulator Waste of Space", "description": "** IMPORTANT - SUPPORTED DEVICES<br/>iPhone 4S, iPad 2, iPod Touch 5 or better.**<br/><br/>You've already been through the zombie apocalypze in Goat Z and made friends with NPCs in the computed world of Goat MMO Simulator. What on earth is there left for you to do? The answer is NOTHING! That's why we leave earth behind and travel to space!<br/><br/>Be a space goat and build a space colony by headbutting people and taking their money. Who knows best how to spend it but a goat? Build a Command bridge training simulator, a space museum or even your very own spaceship. Shoot down asteroids and space pirates or travel to a nearby planet. <br/><br/>You no longer have to fantasize about colonizing space as a simulated goat. Your dreams have finally come true! <br/><br/><br/>Key features<br/><br/>* Be the first goat in space<br/>* Crowdfund a space colony and get other people to pay for it and do all the work!<br/>* Fly and shoot stuff in space, because nobody makes games about flying and shooting in space anymore<br/>* Endless space full of planets to visit. but seriously it would take forever to go there so why bother<br/>* There is one planet nearby though. Go to that one<br/>* Learn how to be a real bridge commander like that spock dude from mars or whatever<br/>* The biggest map in goat simulator history<br/>* So much content you will have to charge your phone lots of times<br/>* Tons of unlockable goats with special powers - Create black holes, 3D print stuff in the world and fling people with your mind", "metacritic": null, "released": "2016-05-26", "tba": false, "updated": "2019-08-02T05:05:04", "background_image": "https://media.rawg.io/media/screenshots/0ae/0ae8d73c357356c7642f46e6c4939bd4.jpg", "website": "http://www.coffeestain.se", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Coffee Stain Publishing"], "genres": ["Adventure", "Simulation"], "publishers": ["Coffee Stain Studios"], "esrb_rating": null}