{"id": 793881, "slug": "the-dance-of-death-game-boy-edition-2022", "name": "The Dance Of Death - Game Boy Edition 2022", "name_original": "The Dance Of Death - Game Boy Edition 2022", "description": "<p>\n</p>\n<p>Hans Holbein was a famous painter from Germany, who settled in London and depicted members of the court of Henry the VIII. Before he painted Henry the VIII he was well known for what we commonly refer to now as “The Dance of Death”.\r\n </p>\n<p>Hans Holbein’s “Dance of Death” is a 16th century print series satirising late medieval society. Using a common motif of the time, a dancing skeleton, to represent the abstract idea of death. This series was arguably the first comic satire in print and ancestor of the comic book.\r\n </p>\n<p>In 2020 I collaborated with the FABLAB at the New University of Lisbon. The project was to produce a series of 20 miniature prints at the same size as Holbein’s. I used google’s deepdream generator to embellish my drawings with Hans Holbein’s style. These drawings were then engraved onto acrylic plaques that were used to print onto paper. The resulting miniature prints are 45mm by 65mm and can be seen here (Dance Of Death 2020 on flickr).\r\n </p>\n<p>The motive of the project was to see what fun dancing skeletons would get up to in our society of corporations, technology and markets. I hope it entertains and provokes.\r\n </p>\n<p>This is a pixel version I have made into a Game Boy Rom.\r\n </p>\n<p> <strong>How to use</strong>\n</p>\n<p>Run the Game Boy emulator in your browser, on your computer or on your phone. Press the button above that says “Run Game”.Use the arrow keys on your computer keyboard and “Z, X”. If you are on a smartphone, you hopefully will get a Game Boy interface of a d-pad and buttons. These can be used to navigate through the images.\r\n  </p>", "metacritic": null, "released": "2022-05-29", "tba": false, "updated": "2022-05-30T07:10:24", "background_image": "https://media.rawg.io/media/screenshots/351/351e504e6e51e4670a8d090b5f1cdf7b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bad_Dad"], "genres": [], "publishers": [], "esrb_rating": null}