{"id": 793968, "slug": "spots-and-mobbers", "name": "Spots and Mobbers", "name_original": "Spots and Mobbers", "description": "<p>You're a Ladybug, who's duty is to defeat as many aphids as possible:</p>\n\n<p>Your energy starts at 30 and drains by 1 every second</p>\n<p>Use WASD to move in 8 directions - up, left, right, down, diagonal</p>\n<p>Run into aphids to collect them and gain 4 energy</p>\n<p>The Max energy is 60, if you happen to accumulate enough</p>\n<p>Spiders spawn in randomly, they are programmed to spawn in front of paths and in general spaces. Spiders then leave after a couple of seconds</p>\n<p>If you run into a spider you lose 5 energies every half-a-second whilst you're within the spider's reach</p>\n<p>Before spiders spawn in, the spider's shadow is cast over the area to give you a brief heads-up, don't worry, you can walk through the shadows with no penalty.</p>\n<p>For every 5 aphids you collect, your \"boost\" value will increase by 1. If you press the Space Bar when you have at least 1 boost point, you will consume the boost point and your travel speed will temporarily increase for 6 seconds.<br/></p>\n<p>GOAL: Collect as many aphids as you can before your energy runs out</p>\n<p>TIP: Some aphids may be trapped on paths blocked by spiders, think carefully for what you should do in this situation, what would be most cost effective use of your energy? <br/>- waiting for the spiders to leave? <br/>- going around longer paths?                                                                                                                                                                    - bulldozing through the spider?</p>\n<p>(a speed boost may help when traveling long distances or in escaping a spider's barrage of attacks faster when passing through)<br/></p>", "metacritic": null, "released": "2022-05-29", "tba": false, "updated": "2022-05-30T07:41:17", "background_image": "https://media.rawg.io/media/screenshots/31b/31ba2410d0a6fae3f88d6e3035d7fb1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Roscoelite"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}