{"id": 79397, "slug": "zen-pinball-esports-edition", "name": "Zen Pinball – eSports Edition", "name_original": "Zen Pinball – eSports Edition", "description": "Compete in real cash competitions with Zen Pinball – eSports Edition Powered by Skillz<br/><br/>Zen Pinball – eSports Edition is the premiere competitive pinball game for mobile devices. Put your pinball skills to the test as you compete against players from all around the world in special virtual currency or real cash competitions Powered by Skillz.<br/><br/>Zen Pinball – eSports Edition Features<br/><br/>- Tables available for unlimited free play<br/>- NO In-App Purchases and NO Advertising. Zen Pinball – eSports Edition is completely free to play <br/>- Multiplayer skill-based matchmaking and leaderboards - Powered by Skillz<br/>- Real money competitions<br/>- Tournaments with real money prizes <br/>- New to pinball? We have provided a tutorial for you to learn the basics<br/>- Advanced table guides provided to help you improve your game and achieve higher scores<br/>- Game Center: achievements and online leaderboards<br/><br/>From the makers of Zen Pinball, Star Wars Pinball, Marvel Pinball, South Park Pinball and The Walking Dead Pinball.<br/><br/>Be sure to visit us at blog.zenstudios.com for more information on Zen Pinball and other games in the Zen Studios lineup. Additionally, follow us on Twitter at http://twitter.com/zen_studios or Like us on Facebook at http://www.facebook.com/zenstudios.<br/><br/>Watch trailers for our upcoming projects on YouTube at http://www.youtube.com/user/ZenStudiosGames.", "metacritic": null, "released": "2015-06-10", "tba": false, "updated": "2019-07-30T01:09:32", "background_image": "https://media.rawg.io/media/screenshots/26e/26e4ec160949c198ed41dddd5c30a214_cWlwvtt.jpg", "website": "http://blog.zenstudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zen Studios"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Zen Studios"], "esrb_rating": null}