{"id": 794038, "slug": "jame-gam-time-is-money-i-was-40seconds-to-late", "name": "Jame Gam: time is money, I was 40seconds to late :()", "name_original": "Jame Gam: time is money, I was 40seconds to late :()", "description": "<p>A game made in 2.5 days for the &lt;<jame gam=\"\">&gt; game jam but I was so in hurry that I finaly posted it 40 seconds late. The reason is that one day before I felt really bad and didn't do any programming. But I was already deep in the game so couldn't make it shorter. the only thing left was to make a shop between levels, make the levels and perfect the enemy AI. The next morning I had around 5 hours to hurry to finish a basic AI and then make at least one level, credits and the tutorial. Sadly I had to cut on the score system, the shop between levels, as well as level design. It's sad because I had made images and scripts for 4 other ground troops and images for 4 turrets as well as written everything for the shop system on paper but had no more time to spawn them in the game.</jame></p>\n<p>Press \"m\" to deactivate the crew voice if it gets to loud because sometime the path finding will break and cause their voice system to go crazy (had to use the path finding that came with my program instead of making my own because time restraints).</p>\n<p>Press backspace to go back to the menu at any time, warning you will loses any progress</p>\n\n<p>I hope you will still like the game even if it was made in only two and a half days.</p>\n<p>Please leave any comments about what I could improve so I can better my self in to next project.</p>\n\n<p>Let me know if you are interested about what the finished product would look like, I plan on giving it another 5 hours which is around what I lost when I felt bad and slept instead of working on the project. With these 5 hours I could add more levels, gore, a shop system and perfect the AI to at least stop it to yell when the path finding gets broken.</p>", "metacritic": null, "released": "2022-05-29", "tba": false, "updated": "2022-05-30T08:12:46", "background_image": "https://media.rawg.io/media/screenshots/bae/baec17bc045916ceba5b3b9df3579d3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Survival_man1"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}