{"id": 794007, "slug": "sphonx", "name": "SPHONX", "name_original": "SPHONX", "description": "<p>Sphonx lets you discover scientifically advanced technology and antique artifacts on an archaeological expedition in an ancient egyptian pyramid. You are Ignacio \"Iggy\" Dias, a young and interested archaeologist in the near future. He helps Dr. Allan Nowicz, an experienced scientist and archaeologist who was involved in the development of some of the most advanced technological breakthroughs in recent archaelogy. He is leading the current research on the dig site and he's also managing the buerocratic side of the expedition in Egypt today. Dr Nowicz is very proud to have a Death Erasing Multispectral Ultrawave Mummified Material Igniter Ray Device with him on this site. It's purpose is to revive even partially conserved cells in old, very old and even ancient egyptian tissue and give it back its previous human form. </p>\n\n<p> Of course, such advanced technology needs careful use and planned application. So Dr Nowicz wants to wait for Dr Sebranovic to arrive, the spiritual and logical father of the very advanced tissue reviving device. Ignacio Dias, a studious but a bit clumsy apprentice working for Dr Nowicz instead wants to finally see results and start the live study of ancient life with support of the DEMUMMI-RAY rather yesterday than waiting even longer.<br/> Tension between the two clashing opinions escalates and late at night Iggy sneaks into the excavation / laboratory deep inside the darkest parts of the age-old pyramid only to get involved in a centuries spanning adventure.<br/> Playtime is still manageable in one to two lunch breaks...</p>\n\n<p><em>\n</em></p>\n\n<p>The current techdemo is only possible thanks to the incredible voice talent of Durq, Durinde and CaptainD. Thank you!</p>\n<p>Now the Techdemo is also available with German Texts!<br/></p>\n\n<p><em>\n</em></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-05-30T07:57:27", "background_image": "https://media.rawg.io/media/screenshots/e2f/e2f6829306a48ab57077ffa715bb96a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Toxic Tuba"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}