{"id": 794234, "slug": "water-lilies", "name": "Water Lilies", "name_original": "Water Lilies", "description": "<p>Water Lilies es un juego muy adictivo y entretenido.</p>\n<p>Destruye todas las flores de los nenúfares.</p>\n<p>Instrucciones del juego:</p>\n<p>- Tienes dos personajes que comienzan aleatoriamente, y van de arriba hacia abajo, cuando creas que estás en posición de golpear el proyectil en la flor, toca el botón para disparar.</p>\n<p>- Toque los botones en la parte inferior de la pantalla para disparar el proyectil, cada botón dispara desde un lado, pero tenga cuidado, solo puede disparar un proyectil a la vez, tendrá que esperar a que el proyectil golpee su objetivo o falle para que pueda disparar de nuevo.</p>\n<p> - Tienes 100 segundos para eliminar las flores de los nenúfares, si se acaba el tiempo y hay flores en los nenúfares, perderás.</p>\n<p>- Tienes 30 proyectiles para disparar, si te quedas sin proyectiles y hay flores en los nenúfares, perderás.</p>\n<p>- tienes que dar justo en el centro de la flor (PISTILO), para poder eliminarla.</p>\n<p>- Tendrás que pasar cinco subniveles para pasar el nivel.</p>\n<p>- Concéntrate y apunta bien para quitar las flores de nenúfar.</p>\n<p>- En los sistemas operativos Windows &amp; MacOS, puedes usar las teclas de dirección – (Derecha &amp; Izquierda).</p>\n<p>Características del juego:</p>\n<p>- Niveles ilimitados.</p>\n<p>- 100 segundos por nivel.</p>\n<p>- 30 conchas.</p>\n<p>- Dos personajes que disparan proyectiles a cada lado.</p>\n<p>- 5 subniveles para pasar de nivel.</p>\n<p>- Juego de acción con emocionantes sonidos, animaciones y música pegadiza.</p>", "metacritic": null, "released": "2022-05-29", "tba": false, "updated": "2022-05-30T09:32:36", "background_image": "https://media.rawg.io/media/screenshots/424/424f4f7e4f84b8a2113b4c133c0822a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Neda Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}