{"id": 794300, "slug": "warehouse-paperclips", "name": "Warehouse Paperclips", "name_original": "Warehouse Paperclips", "description": "Warehouse Paperclips is a resource management game were you create paperclips inside a factory room.\r\n\r\nIf you like the game feel free to comment with screenshots of your factory designs, the best part of making this was seeing all the different conveyor belt systems my friends made.\r\n<p>All assets and code were made by me over 4 days except for the free CC-0 sound effects and Ben Esposito's free First Person Drifter.</p>\n<p>It was made for the Jame Gam #18, with the Theme \"Time is Money\" and Special Object \"Clip\". The theme implied an incremental game to me but there was already one about paperclips, one that is on a literal universal scale. I decided to make one on a smaller setting. Instead of making paperclips across the galaxy, you make them in a factory room.<br/></p><p>I'd recommend playing the downloadable version because of performance, but the web version should be fine too.</p>\n<p><strong>paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip paperclip</strong></p>\n<p><em>Thanks Totally</em><em> and Rokonuxa for helping with playtesting.</em></p>\r\n\r\nChanges and Updates:\r\n-Added mute button\r\n-Added sound effects to build mode, station upgrades, achievements and more\r\n-Fixed a bug that allowed you to get money from selling a station without actually selling it", "metacritic": null, "released": "2022-05-29", "tba": false, "updated": "2022-05-30T10:01:23", "background_image": "https://media.rawg.io/media/screenshots/bc4/bc43435889aa7427dc70cee7908d19e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Luka Rizzi"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}