{"id": 79431, "slug": "myst-francais", "name": "Myst Français", "name_original": "Myst Français", "description": "Bienvenue dans Myst. Où que vous soyez. <br/><br/>Voici Myst pour iPhone et iPod touch. Les mondes de Myst tiennent maintenant dans la paume de votre main, dans toute leur élégance d'origine. <br/><br/>Vous vous souvenez comment les îles surréalistes étaient devenues votre monde? La note, le jardin, les livres, les pages, les frères, les choix? Vous pouvez maintenant retourner dans le monde de Myst, où que vous soyez. <br/><br/>Les images et les sons d'origine de Myst ont été rassemblés avec soin pour recréer une expérience unique sur iPhone et iPod touch. Vous retrouverez tout ce dont vous vous souvenez de l'univers de Myst dans un format qui vous permet de simplement toucher l'écran ou d'y faire glisser votre doigt pour vous déplacer dans le monde. <br/><br/>Rebienvenue dans Myst... Où que vous soyez! <br/><br/>---- <br/><br/>Caractéristiques (FEATURES)<br/>- Tous les Âges d'origine <br/>- Grande qualité d'image (encore meilleures qu'à l'origine) <br/>- Effets sonores et trame musicale complète<br/>- Vidéos et animations d'origine<br/>- Fonction de sauvegarde automatique (quand vous quittez l'application ou quand vous recevez un appel) <br/>- Système de «signets» pour enregistrer vos progrès et reprendre votre partie<br/>- Faites glisser un doigt sur l'écran pour tourner<br/>- Zoom automatique dans certaines zones en gros plan <br/>- Accès rapide au guide d'astuces<br/><br/>----", "metacritic": null, "released": "2009-12-18", "tba": false, "updated": "2019-07-30T02:10:20", "background_image": "https://media.rawg.io/media/screenshots/c92/c92ec8aa69b2c713bcc76100cee928a0.jpg", "website": "http://www.cyanworlds.com/iOS_Myst/Francaise", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 340, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Cyan Worlds"], "genres": ["Adventure", "Puzzle"], "publishers": ["Cyan Worlds"], "esrb_rating": null}