{"id": 79458, "slug": "pocket-bandit", "name": "Pocket Bandit", "name_original": "Pocket Bandit", "description": "Top 11 Best Apple Watch Games : \"It’s such a smart use of the device’s most distinctive feature\"  -  Mac World <br/>Top 15 Apple Watch games you should play : \"It’s clever, and, as a plus, requires no actual lawbreaking.\" - Tom's Guide<br/>\"Best Apple Watch games list \"  - Techradar<br/>\"Best Apple Watch games list \" - iMore<br/><br/>Pocket Bandit is a fun and fast-paced puzzle game for Apple Watch. To orchestrate your heist, the Apple watch will be the key : use the crown to move and vibrations to find the good combination ! <br/>Each successful heist will give you a treasure and there is more than 100 of them : Steal'em all to become the King of Bandits !<br/>Note : You will need an Apple Watch to play Pocket Bandit (you dont need an iPhone).<br/><br/><br/>FEATURES<br/>* The perfect puzzle game for Apple Watch : quick, fun and deep gameplay !<br/>* More than 100 treasures to find. This month, steal Santa Claus factory !<br/>* Complications for Apple Watch and 10 stickers for iMessage.<br/>* Beautiful and stylish visuals.<br/>* Pay Once and play forever ! Events and new content are on the way...<br/><br/><br/>HOW TO PLAY THE GAME<br/>* Use the digital crown to move the cursor<br/>* When the Apple watch starts vibrating, it means that you are on a good number.<br/>* Touch the Apple Watch to validate the number.<br/>* If it's the good number, the safe will open !<br/>* You win a treasure. There's more than 100 to collect !<br/><br/>DEVELOPER<br/>Seele games is a company specialized in iPhone and AppleWatch games. We make great games on small devices, with outside the box concepts, created with love, passion and generosity.<br/><br/><br/>Thank you !<br/>http://seelegames.com/", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-07-30T03:17:59", "background_image": "https://media.rawg.io/media/screenshots/7b3/7b30395320febb2de97379defac15227.jpg", "website": "http://seelegames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Seele Games", "Juan Pedro Lozano"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Seele Games", "Juan Pedro Lozano"], "esrb_rating": null}