{"id": 794779, "slug": "speechless-lumen-jam-2-ver", "name": "Speechless (Lumen Jam 2 ver.)", "name_original": "Speechless (Lumen Jam 2 ver.)", "description": "Speak It Into Reality\r\n<p>You are a <strong>Speaker</strong>, one whose Voice can effect reality. With a word, you can rend the flesh of your enemies, give yourself the power of flight, or even change the weather. You were born into this power— your body marked with your True Name at birth— but only you can decide whether to hone it, through practice and training, and let your Voice bend the world around you to your will.</p>\n<p>The Speakers Union seeks out those with the Voice and offers to train them, mold them into heroes, elevate them in the eyes of the people. The Voice awakens in people at different times in their lives— anywhere between birth and death; therefore Union Academies offer classes at all levels of schooling to accommodate any and all Speakers who with to attend. They believe that anyone can become a formidable Speaker, regardless of age.\r\n</p>\n<p>Those who opt <em>not </em>to join the Union usually do not progress very far with their talent in the Voice. But there <em>are</em> those with the strength of will to hone their skills alone, and it is those people who pose the greatest threat to the Speakers Union. When a powerful Speaker turns to a life of crime, they essentially become a supervillain. With the power of the Voice at their command, no non-Speaker can stop or even obstruct them.\r\n</p>\n<p>Over time, many of these rogue Speakers have banded together to create their own union, of sorts. They call themselves Shriekers, and they target newly-awakened Voices at their most vulnerable and try to sway them to their side.\r\n</p>\n<p>It is up to you and your allies, Speaker, to protect the common people from those who would use the Voice for evil.\r\n</p>\n<p>Concentrate your will.\r\n</p>\n<p>Choose your words carefully.\r\n</p>\n<p>Speak it into reality.\r\n</p>\n\r\nWhat Is Speechless?\r\n<p>Speechless is a game Illuminated by the LUMEN ttrpg system, and made for the second LUMEN Jam. It is inspired by the magic system from a deeply problematic BL manga called Loveless, which I cannot in good conscience recommend that anyone read. The magic system is very cool, which is why I've riffed on it here, but the work itself depicts a number of wildly inappropriate relationships between minors and adults. </p>\n<p>I've thought for years that the core concept of combatants who cast spells by reciting prose and poetry with imagery and vocabulary that evokes the form and effect of the magic they want to cast was glorious enough that it deserved to live in a work that wasn't full of so many awful things. The LUMEN system finally gave me a framework on which to build from that concept, and I think I've done it justice here.</p>\n<p>This is just a small portion of what I would like to eventually create, but it should be enough to give you an idea of what I'm trying to do. I hope you enjoy it, and look forward to seeing the full release in the future.</p>", "metacritic": null, "released": "2022-05-28", "tba": false, "updated": "2022-05-30T13:12:57", "background_image": "https://media.rawg.io/media/screenshots/2c3/2c3794d4a5771ec8ea9fa4959c1c697d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pyreflies"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}