{"id": 794765, "slug": "waffle-gamedevtv-jam-2022", "name": "Waffle (GameDev.TV Jam 2022)", "name_original": "Waffle (GameDev.TV Jam 2022)", "description": "<p>CONTROLS: Arrow Keys</p>\n\n<p>This is my submission for GameDev.TV Jam 2022.</p>\n<p>Wally Waffles has dreams.</p>\n<p>Not worthwhile dreams, but they are his. To chase after them, he needs his trusty tools.</p>\n<p>The mighty bacon which slew many hearts.</p>\n<p>The loyal bunch of bananas. When thrown, would always magically came back.</p>\n<p>And bread.</p>\n<p>With these deceitful items, Wally will enter the fortress of toaster and save the princess. It's just a little warm in here.  Can someone turn down the temperature?</p>\n<p>My first Jam and first Unity game built on my own. Just finished the Unity 2D course several days ago. Kept the game simple so that I could complete it. Learned a lot through all the mistakes I made. If I have the time before the jam is over, I will add more levels.<br/></p>\n<p>The jam theme is \"DEATH IS ONLY THE BEGINNING!\".</p>\n<p>I had a few ideas bouncing around and they kept transforming. Settled with a simple game similar to Adventures of Lolo and other block pushing games. You control waffles that try to make it to the toaster. To activate the toaster, the waffle must collect the three breakfast items. Once collected, the waffle will need to get to the toaster, jump in and get burnt! Not the best application of the theme, but it's my first game and I really wanted to finish it given my green skills.</p>\n<p>Enjoy! Any criticisms, advice or comments are welcome.</p>", "metacritic": null, "released": "2022-05-28", "tba": false, "updated": "2022-05-30T13:06:39", "background_image": "https://media.rawg.io/media/screenshots/4ab/4ab034d7ca796b2d2f65663ce586527a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["waijee"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}