{"id": 794773, "slug": "spookulele-demo", "name": "SPOOKULELE (Demo)", "name_original": "SPOOKULELE (Demo)", "description": "<p><em><strong>Play notes. Fight ghosts.</strong><br/></em></p>\n<p><em>When a fabled disaster causes ghosts to spill into the human world, an apathetic reaper and a fearless young girl with magical powers must use their musical abilities to fight ghosts and save the world from an endless night.</em></p>\n<p><em><strong>SPOOKULELE</strong></em> is an action-adventure combat game where you play a pair of ghost reapers and use musical abilities to fight ghosts.</p>\r\nINNOVATIVE GAMEPLAY\r\n<p><em>SPOOKULELE</em> features innovative gameplay, especially in its music-based combat system, where you cast devastating spells by playing certain combinations of notes. The game also offers the opportunity to switch between the two protagonists, Spooky and Haru, in order to access their unique combat styles and abilities. </p>\r\nA UNIQUE FANTASY WORLD\r\n<p>Whether you’re investigating the jazzy, multicolored French Quarter or scouring the debris-ridden, abandoned areas of New Orleans hit hardest by ghost attacks, exploring the city offers the chance to take in the arresting visuals that give this world vibrant life.</p>\r\nBECOME A GHOST REAPER\r\n<p>With dangerous ghosts with their own unique abilities haunting the streets of New Orleans, you must use your melee weapon and powerful spells to “reap” the ghosts and save the city!</p>\n\r\nMore on SPOOKULELE | Follow our socials!\r\n\n\r\nWATCH OUR STATE OF PLAY\r\n\n\n<p><strong>THIS IS A DEMO OF THE GAME. NOT INDICITIVE OF FINAL PRODUCT.</strong></p>\n\n<p>SPOOKULELE™ © 2022 Spookulele Games LLC. Published by Spookulele Games. “SPOOKULELE” is a trademark or a registered trademark of Spookulele Games LLC. All right reserved</p>", "metacritic": null, "released": "2022-05-28", "tba": false, "updated": "2022-05-30T13:09:50", "background_image": "https://media.rawg.io/media/screenshots/ffa/ffaca2535913b0be38a505baac39be61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SPOOKULELE"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}