{"id": 794825, "slug": "uc-love", "name": "UC Love", "name_original": "UC Love", "description": "UC Love is a humorous, touching, and wholesome anime-style dating simulator with characters that have three-dimensional personalities. The characters are personifications of many of the University of California schools + a few surprises ( ͡° ͜ʖ ͡°)! There are various locations to visit, minigames to play, and secrets to find!<br/><br/><strong>GAME FEATURES</strong> <br/><ul><li>5 Romanceable UC Girls (Left to Right: UCB, UCLA, UCI, UCR, and UCSB)<br/></li><li>Two Secret Romanceable Characters  ( ͡° ͜ʖ ͡°)<br/></li><li>Cameos of the other UCs!<br/></li><li>Unique Storylines for Each Romanceable Character!<br/></li><li>4 Mini-Games!<br/></li><li>Sprite Sets and Various Expressions!<br/></li><li>9 Endings to explore!<br/></li><li>Chill original music!<br/></li><li>Wholesome vibes and funny jokes!</li></ul><br/><strong>TIPS</strong><br/><ul><li>Finish the game by successfully asking one of the characters to the dance!<br/></li><li>Each UC Lover has a set schedule that they follow each day. Explore the campus and pay attention to when you see your love interest in a particular place!<br/></li><li>Your UC Lover will only agree to go on a date with you if they are close to you, and will only agree to go to the dance with you if they are really close to you! <br/></li><li>Love interests will be more open and interested with you as they get closer with you! To build a relationship with someone, talk to them repeatedly and/or give them gifts! Each love interest has a loved gift, liked gifts, and disliked gifts, except for a certain Mr. Tree in the Mud, who hates all gifts. <br/></li><li>If you are at a dating stage, do well with the date minigame for some extra brownie points!<br/></li><li>After you are able to successfully ask them out on a date, you may be able to ask them out to the dance! :)</li></ul><br/><strong>EXTRA TIPS (SPOILERS)</strong><br/><ul><li>If you're looking to date Tommy, you can find him by taking a walk in the garden at night! :) <br/></li><li>If you're looking to date Stan Ford, you can find him in the field after you beat the gym minigame on hard! :) <br/></li><li>There are 5 cameo UCs hidden around the campus! Explore the campus to find: Mercedes (UCM), Diana (UCSD), Crystal (UCSC), Davina (UCD), Francesca (UCSF), Hailey (UC Hastings)</li></ul><br/><strong>GAME NOTES</strong> <br/>This was developed as a student project as part of ACM UCLA's 2022 Student Run Studios!", "metacritic": null, "released": "2022-05-28", "tba": false, "updated": "2023-03-03T05:47:08", "background_image": "https://media.rawg.io/media/screenshots/05e/05e69e33ac7b9bba09deae8822dcd8e3.jpg", "website": "https://olaycolay.itch.io/uc-love", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web", "Android"], "developers": ["gooompy", "OlayColay", "junibee_joy", "kiwinunu", "scottpark", "Plush Cat Studios"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["Plush Cat Studios"], "esrb_rating": null}