{"id": 794872, "slug": "deaths-driver", "name": "Death's Driver", "name_original": "Death's Driver", "description": "<p>The game is made using Unity 2021 LTS and uses CC0 (Public domain) free to use assets and the LeanTween library which is under MIT license.</p>\n<p>I've tried organizing the source files in folders with the name of the sources for each asset. Those without a folder were made by me for this jam.<br/></p>\n<p>I also tried my best to code as orderly as possible, but it got messy after half the jam time was used up. It didn't help that I kept changing game ideas and removed stuff I'd added in the day before with new stuff. There probably is some unused code in some classes as a result of this.<br/></p>\n<p>As mentioned earlier, I used the knowledge I've gained from making previous games. Some examples of that knowledge used in this project:</p>\n<ul><li>Unity Input System: Learned to use it while developing Riri Rhythm.</li>\n<li>Basic player movement logic: Implemented in DOOG for the first time, but much more refined now and adapted to use Unity's Input System rather than the old Input Manager.</li>\n<li>Pooling system: I learned to implement it while developing Riri Rhythm (pooling rhythm game notes). In this project it is used for all the obstacles and pickups.</li>\n<li>LookAtCamera script: Implemented it for DOOG (billboard 2D enemy sprites rotate to face the camera) and used in this project to align the soul pickups sprites.</li>\n<li>Unity's Audio Mixer: Learned about it and used it for the first time when making Chrono Crux. In this project I also improved the volume sliders for smoother volume level changes.</li>\n<li>XML file handling: First implemented it in DOOG for text localisation. In this project it is used to read the game level maps.</li>\n<li>JSON file saves: First implemented in Mumei's Memory Juggling (but with additional stuff). This project implements it on a more basic level.</li></ul>", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-05-30T13:55:37", "background_image": "https://media.rawg.io/media/screenshots/52c/52ca8cd767ceeaef63adf07b92661ece.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["David Wu SoftDev"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}