{"id": 794982, "slug": "co-optographers", "name": "Co-optographers", "name_original": "Co-optographers", "description": "<p>In a fantasy world without danger, there was nothing to do, until one day a grand wizard opened the gate to all dungeons in the realm. Adventurers flooded into the dungeons but were met by various traps and complex puzzles. How frustrating. These dungeons were very dangerous places but adventurers who died there found themselves returning to where they last slept.</p>\n<p>The world needs maps for these dungeons so that adventurers can rush the boss without fear of death by falling spikes or sudden pitfalls.\r\n  </p>\n<p>The players are a team of cartographers who go to charter the dungeons, creating a safe passageway for adventurers by solving puzzles to disable traps and helping them acquire rare loot.\r\n</p>\n\n<p>This game was created for a collaborative project at Staffordshire University.</p>\n\n<p>Credits:<br/></p>\n<p>David Ball - Senior Animator<br/>Harry Dougan - Senior Environment Art<br/>James Bell - Senior Designer<br/>James Slater - Senior Environment Art<br/>James Wild - Senior Character Art<br/>Steven Lewis - Senior Technical Designer<br/>Angelina Okay - Junior Environment Art<br/>Callum Brittle - Junior Designer<br/>Harry Thomas - Junior Technical Designer<br/>James Goff - Junior Character Art<br/>Max Cooper - Junior Environment Art<br/>Maya Alicajic - Junior Character Art<br/>Oskar Adamczyk - Junior Character Art<br/>Robert Steele - Junior Designer<br/>Tiago Lopes Posser - Junior Technical Designer</p>\n\n<p>Made in Unreal Engine 4<br/></p>", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-05-30T14:43:27", "background_image": "https://media.rawg.io/media/screenshots/212/212550cbfe9435893ab052b8e14994ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamerJames", "LawLewis", "JamesWild3d"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}