{"id": 794906, "slug": "armchair-detective", "name": "Armchair Detective", "name_original": "Armchair Detective", "description": "<p>You play as the Armchair Detective, a corrupt private investigator sifting through newspaper clippings to procure evidence to catch (or frame) criminals. You receive a payout from the police every time you successfully 'catch' someone, but a heavy fine is placed on you every time you fail to catch someone. You're losing money fast, so you've gotta speed through these cases without falling into debt.</p>\n<p>This game was made in 3 days as a part of the 18th Jame Gam. This was my first game jam, and I had a lot of fun putting this game together. It's not my best work, but I learned a lot while speeding through, and I feel a lot less on-edge about jams now. Admittedly it was less than 3 days would seem, as I had school and things to do during the time, so I would estimate I spent about 12 or 15 hours on it in total.<br/></p>\n<p>This game is built using the Unity engine. The code is spaghetti and the entire thing is about as organized as my sock drawer but it works (usually). For some reason the game seems to have a preference for the triangle hair guy to be the suspect, but that can't be helped. I also meant to remake the sprites, but as I write this I only have like ten minutes until I've gotta do something so can't be helped. It's also the farthest thing from optimized I've ever seen, but it's small so I didn't focus on optimization at all.</p>\n<p>Thanks to Cathran for the music. I meant to add sound effects, however, aforementioned time limit kicks in in now about 7 minutes so I cut them. Thanks also to the organizers of Jame Gam for hosting this!<br/></p>\n<p>Total: 577 lines of code thereabouts. Not too much but a good amount for an amateur like me I think.<br/><br/><br/><br/><br/><br/><br/><br/><br/></p>", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-05-30T14:11:14", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carnoraptor"], "genres": [], "publishers": [], "esrb_rating": null}