{"id": 795071, "slug": "cathedral-3-d-itch", "name": "Cathedral 3-D (itch)", "name_original": "Cathedral 3-D (itch)", "description": "Puny humans have entered your domain and think they can chase you out of it – prove them wrong. Use your fiery breath and incredible agility to defend your Cathedral for as long as possible and let this fast-paced, arcade, endless arena FPS transport you back to the 90s!\r\n\n<p>👹 <strong>Get it off your chest</strong> – Enjoy unique gameplay focused around protecting the box that contains your heart.\r\n</p>\n<p>👹 <strong>Moves like scragger</strong> – Master the super-fluid movement system with double jumps, strafing, rocket jumping, and shotgun flying.\r\n</p>\n<p>👹 <strong>1, 2, 3, you’re dead to me</strong> – Use the three attack modes – rapid-fire, cluster shot, and firebombs, to paint the walls red with vermin.\r\n</p>\n<p>👹 <strong>CUSTOM ENGINE </strong>- Cathedral 3-D has been made completely from scratch, created by one developer on his very own game engine.</p>\n<p>👹 <strong>You learn something every day</strong> – Unlock special new abilities by staying alive as long as possible.</p>\n<p>👹 <strong>Without a glitch</strong> – Transport to the 90s thanks to an old-school rasterized look complete with unfiltered textures and jagged animations.</p>\n<p>👹 <strong>A unified vision</strong> – Marvel at the harmony of handcrafted graphics and sounds working in unison with a custom engine, all created by a single developer.</p>\r\nYou are the boss of this Cathedral", "metacritic": null, "released": "2022-05-27", "tba": false, "updated": "2022-05-30T15:23:14", "background_image": "https://media.rawg.io/media/screenshots/234/2345578c040c3739daffada83911874b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 545, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Feardemic"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}