{"id": 79505, "slug": "leps-world-z", "name": "Lep's World Z", "name_original": "Lep's World Z", "description": "Help! The undead are coming... The world is being overrun by zombies! Are you brave enough to help Lep and his friends?<br/>\"Zombie Platformer with plenty of variety and excellent graphics: 9.4 out of 10 points\"<br/><br/>Ready for an adventure? The creators of \"Lep's World\" present a platformer with menacing zombies, lots of heroes with different skills, impressive boss battles and much, much more!<br/><br/>\"Lep's World Z\" is an action-packed adventure in a world after the zombie invasion! Lep is fleeing with his mobile home from the gigantic zombie hordes. On his journey, he meets other survivors, who join forces with him to overcome the dangerous zombie ringleaders and put an end to the invasion. Are you prepared to take on this challenge?<br/><br/>FEATURES<br/>+ iPhone X support<br/>+ Discover new areas (more than 60 levels in a breathtaking game world)<br/>+ Play with different heroes (Lep, Officer Giles, Darren Watson, Mary Whyte and plenty more)<br/>+ Fight against many challenging opponents<br/>+ Intense boss battles<br/>+ Wonderful animations and game graphics<br/>+ Compare your progress with that of your friends on Facebook!<br/>+ Seamless synchronization with the Facebook version<br/>+ Game Center with tricky achievements and cool ranking lists<br/>+ Multiplayer feature<br/>+ Optimized for all iPhone, iPod touch and iPad models<br/><br/>Note: Although \"Lep's World Z\" can be downloaded and played completely free of charge, some in-game items can also be purchased for real money. If you prefer not to make use of this feature, please deactivate in-app purchases in the settings for your device.<br/><br/>Website:<br/>www.ZombieWorldGame.com<br/><br/>Facebook:<br/>facebook.com/LepsWorld<br/><br/>Support:<br/>If you are having problems, go to www.ZombieWorldGame.com/#bottom<br/><br/>Data privacy policy:<br/>Go to www.ZombieWorldGame.com/privacypolicy<br/><br/>You can also give our other games a try: Lep’s World, Lep’s World 2, Lep’s World 3, Solitaire.<br/>Enjoy \"Lep's World Z\"!", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2019-10-22T14:23:45", "background_image": "https://media.rawg.io/media/screenshots/6f7/6f71a2be03ed9d0f53f1b39e5b177909.jpg", "website": "https://www.zombieworldgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["nerByte"], "genres": ["Action", "Adventure", "Arcade"], "publishers": ["nerByte"], "esrb_rating": null}