{"id": 795190, "slug": "fate-of-a-dying-star", "name": "Fate of a Dying Star", "name_original": "Fate of a Dying Star", "description": "GameDev.tv Game Jam Submission: \"Fate of a Dying Star\"\r\n<p>Theme: <strong>\"Death is only the Beginning\"</strong><br/><br/>You are a forgotten god that is about to be subjugated by the Elder Gods. You will prevail against them only  if you can ascend into the pantheon of the Elder Gods yourself.  Only then will you show them how powerful you actually are!</p>\r\n\r\nControls:\r\n<p>Camera Movement: W,A,S,D or Arrows.<br/>Left Mouse Button to click and drag cards.<br/>Left Mouse Button to Activate Draws from the Deck piles.<br/>Right Mouse Button to zoom in on Cards.<br/>Drag cards over Discard and Burn zones in order to Discard or Burn a card.</p>\r\n\r\nRules:\r\n<ul>\n<li>All cards have a Cosmic Dust requirement in the upper left corner to play.</li>\n<li>Stars and Planets - both have a Dust reclaim value in upper right corner you get back when you feed on them.</li>\n<li>You can only play Civilizations to Planets.</li>\n<li>Civilizations have requirements to play, a <strong>Star</strong> type and a <strong>Planet</strong> type. <strong>\"?\"</strong> means any star/planet</li>\n<li>Civilizations have a level found at the bottom of the card.</li>\n<li>You only ascend if you feed on a Star/Planet that has a Civilization that is 1 level higher than your current Ascension level</li>\n<li>Every time you feed on a star or planet you will trigger an event.</li>\n<li>You lose the game if you trigger all events before you reach you Ascendency Goal</li>\n<li>You win the game once you reach your Ascendency Goal of Level 4</li>\n</ul>\r\n\r\nDisclaimer:\r\n<p>I was unfortunately interrupted due to a death in the family. I had to rush the upload. I was unable to play test before a bunch of last minute changes to add a rushed tutorial.</p>\n<p>I was not able to put in the auto-draw system or restrict burning cards.</p>\r\n\r\nWarning:\r\n<p>I got to use a family members computer to see if it worked. Bummer, I broke something in the last minute changes. It works to place only 1 star after the tutorial and then wont let you place any more stars. I wont be back until Tuesday May 31, 2022. Past the submission time to fix. Hopefully you can play and see what I was going for. It is at least a demo experience!</p>\r\n\r\nCard Types:\r\n<ul>\n<li>Star Card:</li>\n<li>Planet Card:</li>\n<li>Civilizatoin Card:</li>\n<li>Action Card:</li>\n<li>Feeding Card:</li>\n<li>Event Card:</li>\n</ul>", "metacritic": null, "released": "2022-05-26", "tba": false, "updated": "2022-05-30T16:18:44", "background_image": "https://media.rawg.io/media/screenshots/5bb/5bb0d3a1db075573e789f0bd3462f84e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mbalrog6"], "genres": [], "publishers": [], "esrb_rating": null}