{"id": 795198, "slug": "more-than-me", "name": "More than Me", "name_original": "More than Me", "description": "<p><strong>The Story</strong><br/></p>\n<p>On a Wednesday morning, you leave your doctor's office with the diagnosis of an inoperable brain tumour and the knowledge of estimated four months left to live.</p>\n<p>Suddenly left without any direction in your life, you find yourself in a support group for the terminally ill. Where you expected to find sadness, melancholy and a looming sense of dread at thought of a fast approaching death - all the same feelings you harbour - you find smiles and laughter instead.\r\n</p>\n<p>You're drawn in by the people you meet there, curious and confused by their carefree attitudes. They're kind to you, they take you in, they turn your frown upside down - literally and figuratively. And just when you think you might be beginning to accept your fate; they decide to throw all caution to the wind and whisk you away on the adventure of a lifetime.\r\n</p>\n<p>You don't know what will come of the next four months but with your new friends at your side, you're excited to find out. After all, this is the only life you've been given, and though it may be ending soon; you might as well live it to the fullest.\r\n</p>\n<p><strong><em><strong><em>More Than Me </em>is a story about love, friendship, found family and acceptance. It will deal with heavy topics such as death and illness, and may be uncomfortable for some readers. Viewer discretion is advised.</strong></em></strong></p>\n<p><strong>Features:</strong></p>\n<ul><li>Full character customisation including, but not limited to, appearance, personality and gender\r\n</li><li>Meet and befriend a cast of characters, five of which you'll be able to pursue a romance with\r\n</li><li>Experience a new world as you road trip cross country with your new friends\r\n</li><li>Uncover multiple endings\r\n</li><li>Take a deep breath and live your life as much as you can\r\n</li></ul>\n<p><strong>Romance Options</strong></p>\n<p><strong>Adelaide Scholz - 29 • F </strong></p>\n<p>A bit rough around the edges, Adelaide is a personality that takes some getting used to. Sharp tongued, self deprecating and blunt as baseball bat, Adelaide always has something to say - most times at the annoyance of others. But a stage 4 lung cancer patient such as herself doesn't have the time nor patience to care what anyone thinks of her. With her leather jacket and a carton of cigarettes in her back pocket, doomed to forever be unlit, she's ready to see the sights and if need be, kick some ass. She'll try, at least.\r\n</p>\n<p><strong>Hayden Della Rocca - 31 • F/M </strong></p>\n<p>Hayden is probably the happiest person you'll ever meet, despite their failing heart. Diagnosed with cardiomyopathy just shy of graduating university, they've been on the transplant waitlist ever since but they haven't let that stop them. Having been cooped up in their studio working as a freelance artist, they're now ready to take on the world, pacemaker and all; and heaven help you if you try slow them down.\r\n</p>\n<p><strong>Gabriel Torres - 30 • M </strong></p>\n<p>There's not much to say about Gabriel, mostly because no one knows anything about him besides his chronic liver failure. He's silent and mysterious but he's always happy to spare a smile if he catches you staring. Though preferring to keep to himself, he's more than willing to share his secrets as long as you're willing to listen.\r\n</p>\n<p><strong>Jordan Michaels - 32 • F/M/NB </strong></p>\n<p>Your support group's therapist, somewhat unwillingly dragged along on your adventure. Very straight-laced and a stickler for rules, Jordan fears the worst the second they agree to join you. Now the designated driver and parent of the group, Jordan tries their hardest to keep everyone in line. But despite their initial reluctance, they'll learn to let loose and finally have fun; so long as everyone takes their meds.\r\n</p>\n<p><strong>Mavis/Maverick Chen - 31 • F/M</strong></p>\n<p>A quirky and eccentric bartender you meet on your journey. Longing for a change of scenery, they jump at the offer to join you. Beyond their eccentricities - somehow both charming and strange - they fit in surprisingly well among your group, bringing new life to the party; pun intended. They help open your eyes to new experiences and hey, if all else fails, they can at least make you a mean drink.</p>\n<p>UI and template by Vahnya.</p>", "metacritic": null, "released": "2022-05-25", "tba": false, "updated": "2022-05-30T16:21:25", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ryan"], "genres": [], "publishers": [], "esrb_rating": null}