{"id": 795394, "slug": "grim-tranquility", "name": "Grim Tranquility", "name_original": "Grim Tranquility", "description": "<strong>EARTH IS DEAD. THE STARS AWAIT.</strong><br/><br/>After centuries of environmental exploitation, the Earth is all but destroyed… its resources depleted… its climate uninhabitable. Humankind has used the last available resources to search for a home in a new world that may be harsher than even Earth was.<br/><br/>Grim Tranquility is a sci-fi-themed roguelite, tactics-based RPG where you explore alien worlds and battle vicious enemies in your quest to establish the first human settlement in space. Will humanity finally learn from their past mistakes or are they doomed to repeat the avoidable tragedies of their ancestors?<h3>Key Features</h3><br/><br/><strong>Master The Alien Battlefield</strong>: Leap into battle utilizing proven tactical RPG mechanics to strategize movement, capture map objectives, and unleash special attacks on hostile alien enemies.<br/><br/><br/><strong>Fight The Power</strong>: Rebel against a corrupt empire and take out selfish leaders in high-stakes boss fights - or replace them.<br/><br/><strong>Build Your Own Team</strong>: Every run choose a team from 3 original classes.<br/><br/><br/><strong>Gain Political Benefits</strong>: Secure valuable buff effects for your party by bribing alien officials -  or just take them by force in the roguelite cycle.<br/><br/><strong>Experience A Different Battle Every Time</strong>: Procedurally generated levels deliver a different tactical challenge in every playthrough.<br/><br/><br/><strong>Take on Side Quests</strong>: Even heroes need side gigs! Take on Moonlight Missions to earn money, weapons, and to learn more about the people who need your help.<br/><br/><strong>Enjoy Heroic Voices</strong>: Feel the diverse characters come to life through renowned vocal talents including Steve Blum (Shazam!, Mortal Kombat series), Ray Chase (Final Fantasy XIV, Evangelion, Nier: Automata), Misty Lee (Star Wars Jedi: Fallen Order, Just Cause 4), Darin De Paul (Mortal Kombat Legend: Scorpion’s Revenge, The Outer Worlds), and Alexandra Gray (Empire, Transparent).", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T03:37:54", "background_image": "https://media.rawg.io/media/screenshots/560/560e89ff4846ce7aaa6c48b7b897625f.jpg", "website": "https://www.poorlytimedgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 589, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Poorly Timed Games"], "genres": ["RPG", "Indie"], "publishers": ["Poorly Timed Games"], "esrb_rating": null}