{"id": 795392, "slug": "gravitar-recharged", "name": "Gravitar: Recharged", "name_original": "Gravitar: Recharged", "description": "A lone pilot, far from home, must navigate an abstract universe of uncharted planets and space stations guarded by mysterious, hostile aliens in Gravitar: Recharged. You must complete missions in each solar system, navigating a variety of challenging environments, each with varying levels of gravity that will test your skills as a pilot. Complete each mission within a solar system and you will be transported to the next through a massive black hole. Will you ever make it home?<br/>\n<br/>\r\nWith Gravitar: Recharged Atari revisits an incredibly ambitious arcade title. The 1982 original took the rotate, thrust and fire mechanics of Asteroids and Space Duel, combined them with the gravity of Lunar Lander, and added exploration and elements of cave flying. The result was an extremely challenging arcade game that was eventually ported to the Atari 2600. The game, which did not achieve broad commercial success, has become a cult classic among Atari enthusiasts. <br/>\n<br/>\r\nThe visual aesthetic of Gravitar: Recharged takes the Recharged series in a new direction, with expansive environments rendered in painterly style and pastel tones. In the capable hands of industry-veteran composer Megan McDuffee, the original soundtrack complements the art style with soothing, atmospheric tracks that evoke a sense of wonder.<br/>\n<br/>\r\nKey Features:<br/>\r\n- Arcade mode: fly from planet to planet and progress through ever-more-challenging solar systems in a quest to get home. <br/>\r\n- Missions: 24 taxing challenges with global leaderboards.<br/>\r\n- Power-Ups: Pick-up power-ups with your tractor beam, including homing missiles and EMP disruptors <br/>\r\n- Co-op: Play with a partner in each game mode, which connects two players on a tether, requiring a significant level of coordination.<br/>\r\n- Get in the Groove: Megan McDuffee continues to deliver with an ambient score that transports you into the depths of the unknown.", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2024-03-24T21:17:20", "background_image": "https://media.rawg.io/media/screenshots/902/9022a1a31c88d17fd36146b163f8f616.jpg", "website": "http://recharged.atari.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 11, "owned": 11, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "macOS"], "developers": ["SneakyBox", "Adamvision Studios"], "genres": ["Action"], "publishers": ["Atari"], "esrb_rating": null}