{"id": 795473, "slug": "forward-defense", "name": "Forward Defense", "name_original": "Forward Defense", "description": "Forward Defense combines fast-paced turn-based gameplay with the look and feel of classic military style RTS games. You're in charge of a well equipped United Coalition Force artillery regiment. Build and maintain a wide array of Turret Structures ranging from high velocity Smoothbore Cannons to Howitzers firing 155mm air burst shells. Use Hesco Walls to provide perimiter protection. Your choices truly matter, as each defensive structure has their own unique pros and cons.<br/><br/><h3>Balanced Unit &amp; Turret Design</h3>Choose from six different Turret designs and learn which ones work best in different situations. Rotary Cannons will work well against lightly armored targets, while Missile Launchers will be your best bet against long range hostiles. An easy to read Information Window will show you the stats you're looking for.<br/><br/><h3>Unique &amp; Detailed Maps</h3>Visit uniquely detailed locations across a vast Middle Eastern country. Hold the line at a sabotaged oil refinery, defeat enemy forces in a war-torn destroyed city and defend fertile farmland near a mountainous village. Each level has a completely different layout so you have to take the environment into account when considering Turret placement. <br/><br/><br/><h3>The Backstory</h3>\"On June 6 2028, the United Coalition Force invaded the sovereign state of Kardastan. After a brutal three year war, the UCF succeeded in hunting down and assassinating the Kardastani dictator Haddar Sharif. The war sparked civil unrest and led to the rise of the Revolutionary Freedom Army, an insurgent faction who wishes to avenge Haddar Sharif.\"<br/><br/><h3>For the Players</h3>Forward Defense is launching in Early Access first, so you'll be able to play the game very early on. We're very open to community feedback and want to slowly expand the game with new features, while keeping a close eye on performance. If you have any ideas or concerns, we would love to hear from you!<br/><br/><h3>System Requirements</h3>While we’re doing everything we can to ensure a steady framerate on any system, we do recommend having at least a mid-range CPU and a mid-range GPU. Some of our levels feature large amounts of units onscreen which will run best on a modern graphics card.<h3>Full Ultrawide Support</h3>Forward Defense is optimized to work at both 16:9 as well as ultrawide resolutions.<br/><br/><br/>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T05:11:45", "background_image": "https://media.rawg.io/media/screenshots/3a9/3a9fe65e9b386738bfcf687cafa41f83.jpg", "website": "https://www.indiedb.com/games/forward-defense", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 498, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pinpoint Interactive"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Pinpoint Interactive"], "esrb_rating": null}