{"id": 795416, "slug": "rogue-sweeper", "name": "Rogue Sweeper", "name_original": "Rogue Sweeper", "description": "In addition to the rules of Minesweeper, we will explore the stage by making good use of the items obtained during the exploration. <br/>Various treasures are hidden in the treasure chests along the way. <br/>Some items hard to come by.<br/>Let's collect treasures steadily in the Unique world of gypsy jazz with stages full of surprises!<h3>Game overview</h3>A dungeon exploration adventure game where you search for treasure according to the rules of Minesweeper.<br/>There are 10 types of dungeons in total. It gets harder as you proceed.<br/>Let’s collect treasures using tool you got along the way.<br/>You can collect 25 kinds of unique treasures!<br/>Can you grant your grandpa’s life long dream? It’s up to you How it will turn out to be.<h3>The charm of this work</h3><strong>【View of the world】</strong><br/>10 dungeons are decorated with fascinating world views such as grasslands and witch towns and gypsy jazz.<br/><br/><strong>【Items to reduce luck factors】</strong><br/>When it comes to difficult levels of Minesweeper, luck factors tend to get involved.<br/>Therefore, we are reducing the luck factor peculiar to Minesweeper with special items.<br/>·mobile phone<br/>An item that safely digs 1 square in the direction you are facing<br/>・ Bulletproof vest<br/>Items that protect you from dynamite<br/>・ Space-time device<br/>An item that can be used to warp one level ahead<br/><br/><strong>【System that does not induce mistakes】</strong><br/>・ Bulk digging system<br/>You can dig around 8 squares where nothing is written on the squares at once.<br/>This will prevent you from accidentally digging for dynamite!<br/>・ Flag system<br/>You will not be able to dig where you have flagged.<br/>Where do you not understand? You can also put!", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2022-06-03T04:05:11", "background_image": "https://media.rawg.io/media/screenshots/d7a/d7ade0a897ee6d761b364bf71121b8d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mankind Games"], "genres": ["Casual", "Indie"], "publishers": ["Mankind Games"], "esrb_rating": null}