{"id": 79549, "slug": "chipper-sons-lumber-co", "name": "Chipper & Sons Lumber Co.", "name_original": "Chipper & Sons Lumber Co.", "description": "Welcome to Beaver Forest, where little Tyke is about to venture out into the world for the first time! You'll plant trees, chomp trees, and build a wide variety of things using the lumber that you gather!<br/><br/>Find trees and cut them down to collect the wood. Take the wood to Mr. Chipper (your Dad) and he will make lumber for you. Using that, as well as the items you collect, you'll build things ranging from Lumberbots, to Totem Poles, to Crab Cabanas, and in the process you'll unlock new and more advanced blueprints!<br/><br/>There are also plenty of mini-games offered by the inhabitants of the forest, each rewarding you with unique and helpful items, such as fungal fertilizer and storm callers, which can summon a rain storm at the press of a button to help your trees grow!<br/><br/><br/>-Do favors for the other creatures of the forest and they'll send helpful items to you through the mail!<br/><br/>-Create Lumberbots to chop wood for you while you're away and they'll send you lumber in the mail!<br/><br/>-Five mini-games; including island jumping, mushroom bouncing, and termite treasure-hunting!<br/><br/>-30 blueprints to unlock!<br/><br/>-Over 50 items to collect and use in your creations!<br/><br/>-Earn Beaver Coins by building things and use them to buy pets and power-ups!", "metacritic": null, "released": "2013-12-30", "tba": false, "updated": "2019-10-22T14:23:46", "background_image": "https://media.rawg.io/media/screenshots/60c/60c7a5456cf40871a86d4552bac96d80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Scott Cawthon"], "genres": ["Adventure", "RPG"], "publishers": ["Scott Cawthon"], "esrb_rating": "Everyone 10+"}