{"id": 795474, "slug": "mad-bullz", "name": "Mad Bullz", "name_original": "Mad Bullz", "description": "<h3>Think like a bull</h3>Have you ever wondered what it's like to be a four-legged pile of muscles with two sharp horns? Now you have a chance to run around and destroy anything that stands on your way. With the mouse, you have a full control over the bull's head movement. The game uses advanced active ragdoll physics - enemies are not just puppets, the animation only drives the physics engine, so you can interact with their movement.<br/><h3>Use the environment</h3>Anything that you can pick up can be a weapon: use tables, benches, boxes and other stuff to defeat your enemies. Every item has its limits and will be destroyed after few hits. <br/><h3>Keep the distance</h3>Your horns are a deadly weapon, but why taking the risk? Keep your distance and throw items into the enemies, they will regret attacking you.<br/> <h3>Bull the impaler</h3>The quickest way to kill an enemy is to throw him on some sharp objects... like a hay fork. They must be so stupid to leave those lying around like that.<br/> <h3>Nasty axes</h3>Watch out for the axe throwers, they are easy to defeat but are deadly on the distance. Look how beautifully the axe pierce your skin, it must be sharp as hell.<br/> <h3>Early Access</h3>The game is in Early Access right now, but you can already have fun in 100% playable endless mode. Choose how many enemies and objects you want, and try to stay alive. Learn how to use the environment and physics to defeat those nasty peasants. I will really appreciate your honest feedback. MOOO!", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T05:12:47", "background_image": "https://media.rawg.io/media/screenshots/239/239213b66933d6c4256a48afd6c4c91d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 197, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["APP-Software"], "genres": ["Indie"], "publishers": ["APP-Software"], "esrb_rating": null}