{"id": 795451, "slug": "morph-king", "name": "Morph King", "name_original": "Morph King", "description": "<h3>Developer's Note</h3>MORPH KING began as a little experiment on an idea for a Chess variant, one that I wasn't planning on selling until the scope grew a bit. <strong>Please expect MORPH KING to be a small, re-playable, arcade score-chaser game where the only goal is to constantly beat your previous score.</strong> Feel free to contact me through my email address or on Twitter with any feedback, or anything wrong with the store page.<br/><br/><h3>What's this?</h3>MORPH KING is an arcade chess variant that has you control only one piece, but this piece is special: every time it moves, it <strong>morphs</strong>. Use this ability to outmaneuver predictable enemies, and don't let them swarm you!<h3>Gameplay</h3><ul><li>On your turn, you'll move your only piece, then morph into a random piece type (you can see the next 3 morphs).</li><li>On the enemy turn, every enemy will move in perfectly predictable ways.</li><li>For every enemy you capture, you gain a score point, successive captures increase the points gained.</li><li>If you get captured, you'll be locked as a King for some turns, if you're captured as a King, it's game over.</li></ul><br/><h3>Features</h3><ul><li>Master the ability to morph and use it to escape sticky situations.</li><li>Use a come-back mechanic creatively to not just avoid death, but take out pesky enemies.</li><li>Determine the patterns of enemy pieces, then exploit them.</li><li>Chase your high-scores in either static difficulties or escalating difficulties.</li><li>Find creative solutions to quickly beat randomized waves of enemies.</li><li>Listen to piano covers of traditional Russian folk music.</li><li>Attempt to last as long as you can in Impossible difficulty</li></ul><h3>Credits</h3>Most soundtrack pieces are by Sheet Music Boss, sound effects are retrieved from various royalty free SFX sites.", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-03T04:44:24", "background_image": "https://media.rawg.io/media/screenshots/dc0/dc00492e2af4116f2799c83090fd4e96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elias Diez Urbizu"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Elias Diez Urbizu"], "esrb_rating": null}