{"id": 795456, "slug": "insect-swarm", "name": "Insect Swarm", "name_original": "Insect Swarm", "description": "*Note: The game is still in development, the current version is not all content<br/>\n<br/>\r\n\"Insect Swarm\" is a flying shooting game from a top-down perspective. The feature is that players need to fight against a large number of insect swarms, explore freely in the borderless map, collect resources and upgrade spaceships and weapons.<br/>\r\nThe keyboard controls the spaceship to move, and the mouse is used to shoot. Players can carry a main weapon and a secondary weapon to fight<br/>\r\nAll upgrade items in the game have no level cap, and you can always upgrade as long as the resources are sufficient.<br/>\n<br/>\n<br/>\r\nGame background introduction:<br/>\r\n       Battleship pilot recruitment information: \"Can you deal with hundreds or even thousands of disgusting alien insects at one time? If you can, then come and join the battle! By the way, if you encounter huge insects, you'd better save your life first. .\" — from an outdated message that keeps on sending in a wasteland.<br/>\n<br/>\r\n       That's right, you are the only one left on this planet, and there are countless giant bugs. Just a few years ago, the probe discovered this planet in the vast universe. Although it is a barren desert planet, there are many rare minerals on the surface of the planet that do not seem to belong here. This mineral contains extremely high energy. , people began to build mining bases on this planet to mine this valuable mineral, until one day.... There was a roar of infiltrating people from the ground, and then an amazing number of alien creatures crawled out, calling it \"blood.\" worm\", and later found that this mineral is actually a blood crystal formed by the coagulation of high-concentration blood of blood worms! Our large minecarts seem to disturb these slumbering creatures and revenge us violently, destroying almost all mining bases and equipment. And as a hapless bastard who didn't have time to evacuate, you have to find a way to survive in this hell and evacuate, if possible.... Destroy this place to avoid future troubles! Good luck!", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T04:51:25", "background_image": "https://media.rawg.io/media/screenshots/95c/95c20270bcb967e35337e67a609c51df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 13, "dropped": 1}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Parallel Portal"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Parallel Portal"], "esrb_rating": null}