{"id": 795461, "slug": "exile-origin", "name": "Exile Origin", "name_original": "Exile Origin", "description": "As a felony, you are exiled to C42, which is a barbaric, desolate and fearful hell. Among other unforgivable prisoners, there are only monsters and darkness that devour everything. here you will experience: [/]<br/><br/>Build your Rebel team: build your 4-person team among many criminals. Each character has a variety of skill matching options and additional skill options. According to the characteristics of your enemy, give a fatal blow, explore the secret of \"origin\" religion, a variety of team matching, rich tactical options, and more in-depth cultivation space. Are you ready to face the unspeakable fear?<br/><br/>Explore the secrets of origin Religion: the purpose of tongue cutting ceremony is to return to the legend of the mother planet. What secrets are hidden by origin religion on C42? You need to explore all the way and look for secrets in the depths of the earth. Every step you take forward, you will have fear and strangeness waiting. Whether to join silently or fight back, you need to have your own answer set up your own team to uncover the truth of this exotic planet [/] game features: [/]<br/><br/>The origin of exile is a roguelike round RPG with the theme of waste punk played by a single person. It explores the barren planet, faces the unknown fear, seven unique felons and hundreds of skill combinations for you to explore the unknown world. With freely matched tactics and various random events, you will have a new and exciting experience every time in the dungeon", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T04:57:05", "background_image": "https://media.rawg.io/media/screenshots/801/801dc6f6bfd36b2040b2eb432d006321.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Origin Studio"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Origin Studio"], "esrb_rating": null}