{"id": 795434, "slug": "chu-fa-ba-mou-xian-jia", "name": "出发吧冒险家", "name_original": "出发吧冒险家", "description": "Support 1-2 people to take risks together (yes, you can go online with a small partner)<br/><br/><br/><br/>There are 120 basic treasures and 200 advanced treasures in the game. The effect is [infinite superposition]!<br/><br/>The effects that can be combined are endless, and each adventure is different<br/><br/><br/><br/>In addition to chopping and killing, you will encounter various NPCs on the road.<br/><br/>Businessmen, blacksmiths and the like are loved by everyone;<br/><br/>But the beggar who tries to test your love keeps asking you for money. Will you give it or not?<br/><br/>Rescued the beautiful princess from the boss. Are you holding her or releasing her to repay her kindness?<br/><br/>......<br/><br/>There are many NPCs with different personalities. If you have a bad temper, you can choose to rob directly without saying a word; However, if you are not strong, you may be killed on the spot<br/><br/><br/><br/>On the road, you can also plant fields, buy a stove for cooking, and build an arrow tower for fire output<br/><br/>In the end, the team you trained passed an adventure. Does rougelike mean that it's over?<br/><br/>no<br/><br/>Your team will [Guard] this adventure. Do other players dare to take risks? The last big boss is you!<br/><br/><br/><br/>---------------------------<br/><br/>The game can [watch the war] and [bullet screen chat]<br/><br/>You can also [play investment], invest in a team and watch the war. If he wins, you can pay dividends<br/><br/>There is also [self design adventure]. You design extremely difficult adventures, and other players can break through. They pay you [tickets], and if they pass the customs, you have to give them [bonus]; If you don't pass the customs, the [ticket] will fall into your pocket<br/><br/><br/><br/>This is a sincere and creative game. I hope you can be more patient and will bring you fun", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T04:24:44", "background_image": "https://media.rawg.io/media/screenshots/a78/a78bfd83ac17f931883123bd84d2d5a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 256, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["海上游戏"], "genres": ["Adventure", "RPG", "Strategy", "Casual"], "publishers": ["海上游戏"], "esrb_rating": null}