{"id": 795517, "slug": "higurashi-when-they-cry-hou-rei", "name": "Higurashi When They Cry Hou - Rei", "name_original": "Higurashi When They Cry Hou - Rei", "description": "<h3>Story</h3><br/>The tragedy of Hinamizawa is over. <br/>Those held captive within its grip are free from the fate that bound them to June 1983. <br/>Yet the tale of Hinamizawa is not truly complete. <br/>There are many worlds not yet explored. <br/>Three such worlds await in here, but are you prepared to reveal what was left in obscurity?<br/><br/><strong>Saikoroshi-hen</strong><br/>This is a tale of Furude Rika reaching the summer of 1983. Her power allows her to choose one of many worlds, but is this world truly the best for her?<br/>The difficulty here is malicious, for all you dear connoisseurs who prefer it that way.<br/><br/><strong>Hirukowashi-hen</strong><br/>This is a tale involving a peculiar dispute over the most precious jewels - the Magatama of Fuwarazu, capable of granting mutual love - which befalls the club members. <br/><br/><strong>Batsukoishi-hen</strong><br/>Within these pages is a bible of blazing passion for today's modern, apathetic youths! Even though it was meant as an after-party for Meakashi-hen, it completely ruins the impact of that chapter! Deemed too dangerous for consumption, this legendary scenario was sealed away!<br/>Continue only if you can vow that you are truly degenerate.<h3>Gameplay</h3>Higurashi When They Cry is a sound novel. The music, backgrounds and characters work together to create a world that is the stage of a novel for the user to read. They laugh and cry and get angry. The user takes the point of view of the protagonist to experience the story.", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-07-11T04:35:34", "background_image": "https://media.rawg.io/media/screenshots/aed/aed70fcd88fa2ee46b84eca89b860b89.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 6, "owned": 41, "beaten": 3, "toplay": 3, "playing": 1}, "playtime": 2, "achievements_count": 7, "ratings_count": 1, "suggestions_count": 313, "game_series_count": 9, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["07th Expansion"], "genres": ["Adventure"], "publishers": ["MangaGamer"], "esrb_rating": null}