{"id": 79558, "slug": "twister-game-spinner", "name": "Twister game spinner", "name_original": "Twister game spinner", "description": "A must have app for the wildly popular Game of Twister! <br/><br/>It is the perfect solution to play with your friends or family. <br/>The app makes it possible for two people to play without the need of a third person to \"spin the wheel\" (as it used to be played with a physical spinning wheel).<br/><br/>Important notice: Make sure your device is not muted and your volume is high enough to hear the speaking assistant. <br/><br/>Features:<br/>• Speaking Assistant <br/>   It can speak the turns to help you stay focused on your game at all times. <br/> <br/>• Automatic and Manual modes <br/>   - Automatic mode gives you the possibility to set the desired duration between turns and once you start, the app will automatically play, show and tell the next turn.<br/>   - Manual mode on the other hand, requires a tap on the screen to display the next turn. <br/><br/>• Funny mode <br/>   - The app can tell jokes between turns or tell hilarious instructions to make the game more enjoyable<br/><br/>• Background Music<br/> <br/>The app has been tested and improved for years and as a result it has been ranked in Top 30 on the App Store on five continents for the past 2+ years.<br/><br/>*Twister is a game played on a large plastic mat that is spread on the floor. The mat has four rows of large colored circles on it with a different color in each row: red, yellow, blue and green. A spinner is used to determine where the player has to put their hand or foot. After spinning, the combination is called (for example: \"right hand yellow\") and players must move their matching hand or foot to a circle of the correct color. In a two-player game, no two people can have a hand or foot on the same circle; the rules are different for more players. Due to the scarcity of colored circles, players will often be required to put themselves in unlikely or precarious positions, eventually causing someone to fall. A person is eliminated when they fall or when their elbow or knee touches the mat.", "metacritic": null, "released": "2015-02-18", "tba": false, "updated": "2019-07-30T02:35:16", "background_image": "https://media.rawg.io/media/screenshots/6f9/6f9852179e17d5e46539971c22465711.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Georgi Zlatinov"], "genres": ["Adventure", "Sports"], "publishers": ["Georgi Zlatinov"], "esrb_rating": "Everyone 10+"}