{"id": 795510, "slug": "hover-the-edge", "name": "Hover The Edge", "name_original": "Hover The Edge", "description": "Sometime in the future, you're hired by a well-funded group of individuals that uses time travel to cautiously extract ancient artifacts from secret locations just before they are destroyed by an apocalyptic event, not to mess with the timeline, of course.<br/>\n<br/>\r\nAs an Extractor in Hover The Edge, you'll be dispatched to an exotic island to recover the Sword of Souls, a weapon forged in another dimension to protect the human world from otherworldly threats, you'll be armed with a futuristic hoverboard and a combat suit, these will allow you to recover the artifact and return to base before the apocalyptic event.<br/>\n<br/>\r\nExtracting isn't easy but it sure is exciting! Use your body movements with snowboarding-like balance control to steer while boosting, jumping or flying through beautiful locations, dodge deadly obstacles and collect pickups which, with some luck, may make the journey easier for you.<br/>\n<br/>\r\nHover The Edge's gameplay is challenging, exciting and quite intense, in the game, you'll be hovering through Kamilu Island which consists of several changing environments which are randomly generated using your body movements to steer and your controllers to boost, break and jump to avoid deadly obstacles and collect pickup items.<br/>\n<br/>\r\n*Please take it easy at first if you tend to get motion sickness in VR.", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-06-03T05:56:13", "background_image": "https://media.rawg.io/media/screenshots/818/8187560a1c52f6aabaeb861f571ad00e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Delarion Games"], "genres": ["Action", "Adventure", "Racing", "Casual", "Indie"], "publishers": ["Delarion Games"], "esrb_rating": null}