{"id": 7957, "slug": "spaliens", "name": "Spaliens", "name_original": "Spaliens", "description": "In a far far galaxy live the Spaliens. Cute little creatures, who love to party and just have fun!<br/>But, oh-no! Their planet is about to explode!<br/>They must escape! And Only YOU can help them.<br/><br/>Are you up for the task??<br/>Will you help them??<br/><br/>Launch their bubble-spaceship and match at least 3 Spaliens of the same color to teleport them to their mother spaceship.<br/>As you know, no good deed goes unrewarded!<br/>So for every successful teleport, you earn star dust points, as well as the number of Spaliens you saved. The more Spaliens you save and the more teleports you make in a row, the higher you score. <br/>There are 40 locations (Levels) where Spaliens wait for you to rescue.<br/>The Spaliens are counting on you! Don&amp;#39;t let them down.<br/><br/>************************************************<br/>★★★★★ Great Game!<br/>by Emt King<br/>This game reminds me of bust a move with cute little aliens great gameplay and I love the animations.This game is lots of fun and challenging. Get it<br/><br/>★★★★★ Fun, Fun, Fun!<br/>by Gypsy Cruiser <br/>What a cute game. I liked before and after the update for me. The little aliens are adorable. Not a hard game. Easy to score but not so easy that it&amp;#39;s not challenging.<br/><br/>★★★★★ Great Bubble Shooter Game!<br/>by iBumbleBeez<br/>If your a fan of bubble popping puzzle games this is a game for you! Simple to understand, with various levels of difficulty, and cute graphics. Saving the little Spaliens is addicting!! This is a keeper and my current favorite time waster on my iPhone!<br/>************************************************<br/><br/>Game Highlight Features:<br/>* 3 difficulty levels<br/>* 40 levels to master<br/>* Spaliens are always breathing, dancing, blinking and stretching – they are so cute…<br/>* Spaliens will get bored if they wait too long, and you can wake them up by tapping on the screen<br/>* Score more points by forming as many sequential Spaliens matches.<br/>* Get a &amp;quot;Teleport Combo&amp;quot; after 5 sequences of Spaliens matches.<br/>* Save as much Spaliens as you can – High score bar contains also the total number of Spaliens that you saved in all games.<br/>* Bonus time at the end of each level to earn more points.<br/>* If the game is exited in the middle of a game or anything interrupts the application (like a phone call) the game will auto-save.<br/><br/>Good luck!<br/>----------------------------------<br/><br/><br/>If you want to know more about the Spaliens, go ahead and visit them at http://spaliens.blogspot.com/.<br/>You can also make friends with the Spaliens on their Facebook page.<br/>See you there!<br/><br/>************************************************<br/>Spaliens was created and developed by EcoSoft<br/><br/>All Rights Reserved<br/>http://www.ecosoft.co.il<br/><br/>No Spaliens were harmed in the making of this game.", "metacritic": null, "released": "2010-04-16", "tba": false, "updated": "2019-10-22T14:29:38", "background_image": "https://media.rawg.io/media/screenshots/f57/f5740c7e9bc94fe68d71b7852ada7ee7.jpeg", "website": "http://spaliens.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EcoSoft"], "genres": ["Puzzle"], "publishers": ["EcoSoft"], "esrb_rating": "Everyone 10+"}