{"id": 795703, "slug": "ashes-of-the-sea-a-quickstart-adventure-for-numene", "name": "Ashes of the Sea: A Quickstart Adventure for Numenera", "name_original": "Ashes of the Sea: A Quickstart Adventure for Numenera", "description": "<p>An ancient device has sent you and your friends, in the blink of an eye, to distant reaches unknown. The key to returning home—or anywhere else—lies within another prior-world site. But entering the towering Icon, topped by its mysterious, many-armed statue, is taboo to the locals—and the ruin contains a dangerous legacy of its original function. . . .</p>\n<p><em>Ashes of the Sea </em>is a complete adventure—plus complete quickstart rules that introduce concepts and character types from <em>Numenera Discovery</em> and <em>Numenera Destiny</em>—for novice and veteran Numenera players. If you’ve never played Numenera, or don’t even own the game rules, you’ll find everything you need (except dice!) to learn, run, and play the adventure. And experienced players will love the adventure itself. It even comes with a set of six characters, fully pregenerated and formatted to make it easy to learn Numenera.\r\n</p>\n<p><em>Ashes of the Sea</em> includes:\r\n</p>\n<ul><li>A complete Numenera adventure, filled with the splendor and wonder of the Ninth World.\r\n</li><li>Quick-start rules to get you going, even if you’ve never played Numenera or the Cypher System.\r\n</li><li>A set of six pre-generated characters in a beautiful and handy format that’s great for novice players as well as Numenera veterans.\r\n</li><li>A mini-bestiary with all the details on the creatures encountered in this adventure.\r\n</li></ul>\n<p><em>Ashes of the Sea</em> was written by Sean K. Reynolds. It was the 2018 Free RPG Day adventure for Numenera.\r\n</p>", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-06-03T07:31:48", "background_image": "https://media.rawg.io/media/screenshots/b39/b39a3a692ee7d0c6669f6b0d74057abb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Monte Cook Games"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}