{"id": 795751, "slug": "verduras", "name": "Verduras", "name_original": "Verduras", "description": "<p>Verduras es un juego muy adictivo y entretenido.</p>\n<p>Prepárate para cortar todas las verduras con el cuchillo y que no te falte ninguna.</p>\n<p>Instrucciones del juego:</p>\n<p>- No debes tocar las verduras, porque si no, no las vas a cortar, debes colocarte muy cerca de ellas, pero sin tocarlas, como si estuvieras cortando, pero sin tocar las verduras, así mismo las bombas, puedes activa el cuchillo para saber dónde estás posicionado.</p>\n<p>- Verduras, consta de tres modos de juego (un fallo, por tiempo y receta).</p>\n<p>- Un solo defecto:</p>\n<p>Tendrás que cortar todas las verduras que salgan, sin que se te escape ninguna, también tendrás que hacer estallar las bombas que salgan, hay dos tipos de bombas, las bombas malas y las bombas buenas.</p>\n<p>- Bad Bomb: Tendrás que cortarlo antes de que explote o perderás (en su parte central los colores que parpadearán serán de rojo a verde).</p>\n<p>- Buena bomba: Si la cortas, producirás una explosión, provocando el corte de las verduras que están en la pantalla (en su parte central los colores que parpadearán serán de amarillo a azul).</p>\n<p>- Para el tiempo:</p>\n<p>- Igual que el juego de un solo fallo, pero esta vez tendrás que conseguir al menos el 50 por ciento de aciertos, cortando las verduras, las verduras que se escapen contarán como un fallo, pero cuidado con la bomba mala, que no se escapa porque el tiempo se acaba y perderás.</p>\n<p>- Receta:</p>\n<p>- En el lado derecho de la pantalla, te saldrán las verduras que tienes que cortar, con el número de veces que tienes que cortar, pero ojo, porque si cortas una verdura que tiene 0 veces que tienes que cortar, te perder y el juego ha terminado.</p>\n<p>- En el juego Receta, no hay bombas.</p>\n<p>Características del juego:</p>\n<p>- Niveles ilimitados</p>\n<p>- Seis tipos de verduras (Brócoli, Zanahoria, Cebolla, Pimiento, Patata y Puerro).</p>\n<p>- Tres tipos de juegos (Un fallo, Por tiempo y Receta).</p>\n<p>- Árboles para salvar la tierra de la basura.</p>\n<p>- Puntuación, nivel y receta guardados automáticamente.</p>\n<p>- Botón de música, encendido o apagado.</p>\n<p>- Botón de efectos de sonido, encendido o apagado.</p>\n<p>- Botón Eliminar (devolviendo el juego a su estado inicial).</p>\n<p>- Juego de acción con emocionantes sonidos, animaciones y música pegadiza.</p>\n<p>- Buena suerte y conviértete en el mejor cortador de verduras.</p>", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-06-03T07:53:09", "background_image": "https://media.rawg.io/media/screenshots/be9/be9645fe67099d99e51edcff63cba806.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Neda Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}