{"id": 795831, "slug": "rekuroi-itch", "name": "Re:Kuroi (itch)", "name_original": "Re:Kuroi (itch)", "description": "<p><strong>■Story<br/></strong>This is a tale of wizards fighting against monsters that have suddenly begun to appear.</p>\n<p>Kaito, a young, bullied boy, meets wizards of different professions: a parttime teacher, a waitress, a retired soldier, and a suspicious dealer of information. What lies ahead for them as their different ways of thinking, emotions, and lifestyles come together?</p>\n<p><strong>■Game Features<br/></strong>-Turned-Based RPG</p>\n<p>Battles combine real time and turn-based combat.<br/>Time your blocks correctly to defend against enemy attacks!<br/>Read your enemies’ actions and seize victory!</p>\n<p>-Magic System<br/>Become stronger the more you use magic.<br/>Unlock new kinds of magic as you level up, progress in the story, and even in the middle of combat.</p>\n<p>-Level Cleared Adventure<br/>Once you’ve cleared a level, you can replay it as many times as you want!</p>\n<p>You can revisit the past by reviewing the story, and level up when you’re stuck in battle somewhere.</p>\n<p>-Beautiful, moving events<br/>Enjoy all of the many scenes showing off the characters’ living, breathing dialogue.<br/>You can also skip over messages, set it to autoplay, and even remove the UI from the screen.<br/>Dive into the scenes and live the game.</p>\n<p>-An expansive world<br/>This game is the sequel to HIBIKAKEYIRONOKISEKI, which has been downloaded more than a hundred thousand times!<br/>It features an upgraded game system based on the previous game in the series.<br/>Some characters from the previous game appear and you can see how their stories continue.</p>\n<p>(This game can be enjoyed without playing the previous game.)</p>", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-06-03T08:28:38", "background_image": "https://media.rawg.io/media/screenshots/20a/20a595ad98c9376e6e87b816b8d2d36a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 355, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["GotchaGotchaGames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}