{"id": 796006, "slug": "garenburg-penitence-the-riflebird", "name": "Garenburg Penitence: The Riflebird", "name_original": "Garenburg Penitence: The Riflebird", "description": "<p>Feel free to try the demo! Features four levels, four game modes, four difficulty options, and the <strong>Custom Level Editor! </strong>Customize music, backgrounds, the player, spheres, and more!</p>\n\n<p>Garenburg Penitence is an action-puzzle arcade game about matching sphere colors and exploring the collapsing psyche that destroyed the world.<br/><br/>With over 70 unique level maps, additional game modes, a level editor, and a tragic tale spanning across seven databases, learn the story of a fragile girl and her regretful actions.<br/><br/>If everything has a cost, then how much would it be to make the world a better place?</p>\n\n<ul><li>Fast, dynamic arcade gameplay. Fire spheres and match colors before they reach the end, and speed up or slow down to retain accuracy!<br/>\n</li><li>Story Mode: Clear a campaign of levels and unlock files to understand the truth of the world<br/>\n</li><li>Classic Mode: Fire spheres and match colors before they reach the end<br/>\n</li><li>No Mistakes Mode: Instead of worrying about spheres reaching the end, focus on matching the right colors<br/>\n</li><li>GREEN Mode: Significantly less colors, but harder to distinguish the differences between them<br/>\n</li><li>Wave Mode: Gain powerups to clear spheres more easily, but each wave increases the difficulty<br/>\n</li><li>Multiplayer Versus: Grab an enemy or friend and battle to see who can get the most score or survive the longest<br/>\n</li><li>Custom Level Editor: Full support for player-made levels with both Steam Workshop integration and local level loading<br/>\n</li><li>Six different worlds with unique themes and 12 unique level maps each for a total of 72 levels<br/>\n</li><li>Achievements: Complete and obtain numerous achievements within the game, testing your skill against difficult challenges<br/>\n</li><li>Four different difficulties, from a safe and relaxed time with Easy and Normal, to a challenge with Hard and a nightmare with Lunacy<br/>\n</li><li>File System: Spanning seven databases, take a look into the tragic story of a fragile girl. If her story is not your interest, it is not necessary to read to experience the gameplay<br/>\n</li><li>An original soundtrack with a multiple unique themes for each world and the music distorting as spheres get too close to the end<br/>\n</li><li>Numerous configurable settings to toggle effects and visuals in case distracting or for better performance\r\n</li></ul>\n\n<p>This game relies on color matching and has fast movement and imagery. While fast movement graphics can be toggled off if they are an issue, distinguishing colors apart from each other is a key component of gameplay. It is not recommended for those with color blindness.</p>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T09:38:03", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c068347d1cacf4abaf3a143e9047fb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creatalsoftware Games"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}