{"id": 79607, "slug": "infecct", "name": "infeCCt", "name_original": "infeCCt", "description": "infeCCt is an addictive, mind bending game that keeps you entertained for hours! Based on research in cognitive and memory psychology, this game is easy to learn, but difficult to master.<br/><br/>Object of the game is to draw a line that covers all the tiles in a given level. It sounds a lot easier than it is - with blocks, intersections and tunnels, there is always exactly one solution. In order to solve each of the numerous and tricky puzzles, you have to think more than one step ahead. But every success also means that your brain can apply previously acquired knowledge to a new situation. Do you want to improve your intelligence?<br/><br/>Can you find each elusive solution?<br/><br/>Can you beat just one more challenge?<br/> <br/>Forget about Sudoku! The simple and ingenious puzzle game infeCCt will captivate you! Train your brainpower in a playful manner and use the online leaderboards to compete with other players around the world. <br/><br/><br/>**************<br/>Get infeCCted!<br/>**************<br/><br/>Features:<br/>- based on cognitive science and memory research<br/>- addictive puzzles for everybody<br/>- animated tutorial for an easy start<br/>- training of intelligence, memory and creativity<br/>- optimization of thinking processes<br/>- downloadable level packs<br/>- hundreds of tricky challenges<br/>- online leaderboards", "metacritic": null, "released": "2010-02-12", "tba": false, "updated": "2019-07-30T03:38:19", "background_image": "https://media.rawg.io/media/screenshots/dfc/dfc16bd202d8c18f1839c18a4a2fd942.jpg", "website": "http://www.handy-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Handy Games"], "genres": ["Puzzle"], "publishers": ["www.handy-games.com"], "esrb_rating": "Everyone 10+"}