{"id": 796117, "slug": "housing-crisis", "name": "Housing Crisis", "name_original": "Housing Crisis", "description": "<p><em>Made for ARTG 120 Final Game </em></p>\n<p><em>Created by Margarita Rodrigez, Aaron Vuong, and Denae Ficks</em></p>\n<p><em>Contributions:</em></p>\n<p><em>Margarita- Planet items, stats screen, instructions screen, story preview scene, scrolling space background, scrolling planets background, some sounds effects, and some of the code</em></p>\n<p><em>Aaron: Most of the code or all of the code and its organization </em></p>\n<p><em>Denae: Title screen, planets you choose from, On Planet backgrounds, Shop, Protagonist, NPC's, some sound effects, and Background music </em></p>\n\n<p><em><strong>*The Game ends when you get to the first planet, its a work in progress, thanks for checking out what we have so far*</strong></em></p>\n\n<p>Welcome far-off traveler to this vast new world, we recently noticed that you have been looking every corner of the galaxy to find a place to call home. That's where we come in to simulate this experience in our game called </p>\n<p><strong>Housing Crisis</strong></p>\n<p>In this game you are a cute little alien who is looking for that one planet where they can fit in, you will be visiting a couple planets and talking to the locals through intense dialogue to be determined if you really are fit for the planet. You will use your skill of disguise to find clever ways to get the locals to like you and the art of choice through dialogue options. </p>\n<p>Going to lots of planets is a difficult journey so you will have to find what you can through shops filing back up o the needed essentials</p>\n<p>Learn about the locals and planets as you play coming to an ending, multiple endings are possible so please collect them all if you wish </p>\n<p>We hope you find the perfect place to settle down into and again encourage you to choose wisely and with all you have to figure out what planets like and don't like from a newcomer </p>\n<p>*Fullscreen for best experience*</p>\n<p><strong>Happy Hunting!!</strong></p>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T10:17:01", "background_image": "https://media.rawg.io/media/screenshots/e42/e42a7c410d6039ffd3d4f23069a2a23e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DenaeF"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}