{"id": 796198, "slug": "frozen-match", "name": "Frozen Match", "name_original": "Frozen Match", "description": "<p>Freeze Match: match 3 puzzle game meets frozen food. It’s a calm but challenging puzzle that you’ll be addicted to in no time!</p>\n<p>Swipe blocks on a 8x8 board and form rows or columns to keep your freezer board clean. Play for as long as you can without running out of moves to beat your high score!\r\n<br/></p>\n<p>How to Play:\r\n<br/></p>\n<p>* Swipe food blocks on the board to form rows or columns of frozen food.\r\n</p>\n<p>* Fill a row or column to clear frozen food blocks from the board.\r\n</p>\n<p>* Freeze fire blocks to earn bonus moves.\r\n</p>\n<p>* Be careful with Moldy Blocks, they won’t freeze so instead Match 3 Moldy Blocks to keep your board clean.\r\n</p>\n<p>* Clear multiple rows and columns to earn Big Combos!\r\n</p>\n<p>* Earn as many points as you can to beat your daily high score, average high score, or all time high score!\r\n</p>\n<p>* Have fun and stay cool!\r\n<br/></p>\n<p>It’s a unique fresh zen game that’s easy to learn, but challenging to master! Take your time and take it easy, but watch out for Moldy blocks or else they’ll fill up your freezer board.\r\n<br/></p>\n<p>Featuring:\r\n<br/></p>\n<p>* Beautiful graphics and satisfying sound effects\r\n</p>\n<p>* Relaxing gameplay with no pressure or time limit\r\n</p>\n<p>* Unique one of a kind match 3 gameplay\r\n</p>\n<p>* A light, small game that won’t take space on your device\r\n</p>\n<p>* Playable offline so you can enjoy this classic anywhere\r\n</p>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T10:50:12", "background_image": "https://media.rawg.io/media/screenshots/82e/82e408c11dd344872548f8ca2e634da0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["FishyCharmer"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}