{"id": 796232, "slug": "il-viaggio-del-saggio", "name": "Il Viaggio Del Saggio", "name_original": "Il Viaggio Del Saggio", "description": "<p>Grazie a tutte le persone che giocheranno al gioco, questo gioco è un amatoriale per ricordarsi dei vecchi giochi del passato che amiamo, spero di divertirvi con il mio progetto.</p>\n<p>La Storia:</p>\n<p>Fin dai tempi antichi i malvagi hanno sempre temuto i più valorosi paladini del bene, i Saggi! Il loro scopo è sempre stato quello di proteggere il mondo dai pericoli che minacciavano di distruggere la vita e la serenità dei popoli.\r\n</p>\n<p>I Saggi si sottoponevano a un lungo addestramento, in seguito al quale acquisivano una conoscenza piuttosto profonda in tutte le branche di magia e tecniche (normalmente un combattente privo di addestramento da saggio può usare 2, massimo 3 tipi di magia). Tuttavia, questa grande versatilità si traduceva nell'incapacità di avere una conoscenza completa nelle singole scuole magiche.\r\n</p>\n<p>Nei tempi antichi si narra che il RE DEI DEMONI stesse per portare morte e distruzione nel mondo, ma grazie ai 3 Grandi Saggi, allievi del primo Saggio mai conosciuto dalle genti, venne sigillato al centro della terra.\r\n</p>\n<p>Quel periodo storico veniva chiamato “L’epoca d’oro dei Saggi”, in seguito al quale molte altre persone iniziarono il cammino da saggi ispirati da tanto eroismo dimostrato dai tre eroi.\r\n</p>\n<p>Nel tempo odierno però molti saggi iniziano a non venire più avvistati, questo succede proprio all’inizio del viaggio dell’apprendista saggio protagonista della storia.</p>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T11:05:18", "background_image": "https://media.rawg.io/media/screenshots/00d/00d0a093ddfef9ebc4380ba278214d5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Diego Gramiccioli"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}