{"id": 7962, "slug": "1942-mobile", "name": "1942 MOBILE", "name_original": "1942 MOBILE", "description": "Set in the Pacific theater during World War II, this vertically scrolling shoot 'em up tasks players with battling through the entire enemy fleet. Shoot down enemy planes, avoid enemy fire and perform rolls and loops to avoid certain death in this epic nail-biter from the past.<br/><br/>--------------------------------------------------------------------<br/>Note:  The game has been optimized for the unique play experience of smartphones and may differ in some ways from prior releases.<br/>--------------------------------------------------------------------<br/><br/>Classic Arcade Action - Take control of a vintage warbird and challenge the enemy's army.<br/>Shoot For the Stars - Dodge fierce enemies and set your sights on a 100% kill rate.<br/>Roll With Danger - Failure is not an option.  Escape from the jaws of death with a well timed barrel roll. <br/>Touch Screen Controls - Experience the intensity of this 8-bit classic with one finger control<br/>Two Modes -  “Casual mode\" has been adjusted for ease of play and \"classic mode\" follows the original specifications.<br/><br/>Please Note:<br/>- To use the leaderboard and achievement system, you need a \"Google account linked with gamer ID\". You can not create \"gamer ID\" from an iOS device.<br/>- In order to participate in ranking, it may be necessary to change the setting of the Google account. Google Account settings can not be changed from iOS device.", "metacritic": null, "released": "2017-03-09", "tba": false, "updated": "2019-07-31T02:38:48", "background_image": "https://media.rawg.io/media/screenshots/a94/a945dfa9aa9547e353a2c3890c140727.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Capcom"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Capcom"], "esrb_rating": null}