{"id": 796361, "slug": "ball-and-chain-drmortalwombat", "name": "Ball and Chain (drmortalwombat)", "name_original": "Ball and Chain (drmortalwombat)", "description": "<p>Deep down in the dark and gloomy dungeons of the Spike Empire, an innocent bouncy ball has been held in captivity, chained to…. a ball, a heavy iron ball that is!</p>\n<p>Ball and Chain is an endless runner where the difficulty ramps up until you inevitably “drop the ball.”<br/></p>\n<p>One day, after a generous helping of helium (no idea where he found it), our hero decides to flee the Spike Empire and return to the land of fun and games.</p>\n\n<p>You control the helium filled hero and while the iron ball limits your movement, it can also be used as a weapon! Your escape for freedom comes to an end when you either collide with an enemy, or are crushed by a wall. Pressing the fire button shortens the chain and gives tighter control over the iron ball, releasing the button pushes the iron ball to the opposite direction.</p>\n<p>The score increases the longer you stay alive. Collect coins and stars along the way to increase your score further. Stars improve the time base scoring factor, but come at a cost. They also increase the mass of the iron ball, thus increasing its weight and inertia until you are unable to spin it or even lift it from the ground.<br/></p>\n<p>Destroying enemies release powerup bubbles with one of four color coded perks:\r\n  </p>\n<ul><li>Yellow : Coin magnet\r\n  </li><li>Grey : Iron skin - Protects the rubber ball for a short time\r\n  </li><li>Blue : Changes the iron ball into a balloon with no weight or inertia\r\n  </li><li>Green : Slows the scrolling down\r\n</li></ul>\n<p>Music by</p>\n<p>Crisps</p><p>Soundtrack now available</p><br/>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T12:17:24", "background_image": "https://media.rawg.io/media/screenshots/afb/afbbca06df2790a55ce5f58f4114defe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["drmortalwombat"], "genres": ["Action"], "publishers": [], "esrb_rating": null}