{"id": 79630, "slug": "choice-of-games", "name": "Choice of Games", "name_original": "Choice of Games", "description": "The choice is yours!<br/><br/>Choice of Games is a magnificent library of interactive novels: action, adventure, drama, historical, war, humor, supernatural, and more. Our games are entirely text-based—without graphics or sound effects—and fueled by vast, unstoppable power of your imagination. Choose your path: your choices control the story.<br/><br/>Try a few of these Choice of Games classics:<br/><br/>• Affairs of the Court: Choice of Romance — Plunge into court politics and change the course of history, or pursue a love affair that rocks the kingdom to its foundations!<br/>• Choice of Broadsides — Step into the shoes of the greatest naval hero of all time... you!<br/>• Choice of the Deathless — Battle demons and undead attorneys, and win souls to pay back your student loans!<br/>• Choice of the Dragon — Become a fire-breathing dragon who sleeps on gold and kidnaps princesses!<br/>• Choice of Kung Fu — Become the world's greatest kung-fu fighter or find true enlightenment.<br/>• Choice of Robots — The robots you design will change the world! Will you show them the true meaning of love, or conquer Alaska with your robot army?<br/>• Choice of the Vampire — A 200-year journey of love, power, and redemption.<br/>• Creatures Such as We — A philosophical romance with game designers on the moon. In this game within a game, there has to be a better ending! Awarded 2nd place in the 2014 IFComp.<br/>• For Rent: Haunted House — Rent out a haunted house under the tyrannical eye of a ruthless boss. Screw over your tenants! Ignore supernatural phenomena!<br/>• Grand Academy for Future Villains — Taking over the world? Welcome to the world's finest preparatory villain school!<br/>• Heart of the House — What will you sacrifice when trapped in a haunted manor? Will you destroy this evil or claim its power? And can love bloom in a haunted house?<br/>• Psy High — What's scarier: the principal, your psychic powers, or finding a date for prom?<br/>• Silverworld — Survive the past, save the future, and explore a savage Stone Age world!<br/>• Tally Ho — A Jazz Age comedy of manners—only a perfect servant can solve a perfect mess!<br/> <br/>Learn more at https://choiceofgames.com", "metacritic": null, "released": "2018-04-05", "tba": false, "updated": "2019-07-30T01:20:12", "background_image": "https://media.rawg.io/media/screenshots/755/755392effbe9cac49ea3b5bd776455dd_PUdvFth.jpg", "website": "https://www.choiceofgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Choice of Games"], "genres": ["Adventure", "RPG"], "publishers": ["Choice of Games"], "esrb_rating": "Teen"}