{"id": 796352, "slug": "tic-tactics-toe", "name": "Tic-Tactics-Toe", "name_original": "Tic-Tactics-Toe", "description": "<p><strong>Tic-Tactics-Toe</strong> is a project made by Immanuel Bücking and Gérald Montúfar for an university assignment about networking.</p>\n\r\nDescription\r\n<p>This game is an approach to spice up the simple game Tic-Tac-Toe.</p>\n<p>Instead of simply placing your Xs and Os on the grid and try to win by luck, in this game you have a deck of units, which move across the board at the begin of their owners turn. Each unit has an attack and defense value that decides if a unit can push an opponent unit in its way or not. To win you still have to get three units in a row, but to archive this you now have to think ahead and plan your next moves.</p>\n<p>Currently there are 5 different units to play with and with that this is a very small game with still much strategic potential.</p>\nDisclaimer\r\n<p>Online multiplayer with people that are not in your network is not supported.</p>\r\nFeedback\r\n<p>We would love to receive feedback on what you think about this game! Either comment here or message either one of us:\r\n</p>\n<ul><li>Immanuel: immanuel.buecking.bsns@gmail.com<br/>\n</li><li>Gérald: Twitter @geraldsaccount</li></ul>\n\r\nLegal stuff\r\n<p>All assets in this game are either free to use, already owned or made by one of us. No copyright infringement or any sort of violation intended. Should we have somehow missed any details, failed to mention any creators or used anything without permission, please contact us and we will sort it out as soon as possible.<br/></p>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-03T12:11:41", "background_image": "https://media.rawg.io/media/screenshots/3cd/3cd8ef0a90ace28315ec897b700b36cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gerald", "JuuzouBLAACK"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}