{"id": 79658, "slug": "battle-bears-zombies-ar", "name": "BATTLE BEARS ZOMBIES AR", "name_original": "BATTLE BEARS ZOMBIES AR", "description": "Play the very first BATTLE BEARS game that started the award-winning series with over 30 MILLION downloads! <br/>\"Best Games of the Year\" TouchArcade<br/>\"Top 100 iPhone Games\" iLounge<br/>“Battle Bears is a must have!” SlideToPlay<br/><br/>“A survival shooter with a ridiculous story line that is almost worth the price of entry by itself.” –Touch Arcade <br/><br/>“The story for Battle Bears is hilarious, it’s one of the reasons I kept on going through the levels.”  -TouchGen<br/><br/>\"That one game that brings everything you've experienced up to that point sharply into focus. A gaming epiphany... Friends, I have found that game, and it is Battle Bears.\" -iPhoneLife.com<br/><br/>BATTLE BEARS stars OLIVER, a teddy bear stuck behind enemy lines who must fight off unending waves of Pink Bears wishing to HUG HIM TO DEATH.<br/><br/>Game play is simple and fun.  Use one thumb to aim and the other thumb to tap-and-fire.   <br/><br/>AR TIPS:<br/>AR mode requires iOS 11 and ARkit on iPhone X, iPhone 8, iPhone 7, iPhone 6s, iPhone SE, iPad Pro, or iPad 2017. AR mode is best experienced in a well-lit open space with AirPods or headphones if you dare! <br/><br/>To Save AR Video Recordings: Use the Share Button THEN press Save Video.<br/><br/>To PAUSE the game: Tap on the pink bear icon.<br/><br/>CAMPAIGN TIPS:<br/>To fire the LASER: Press and HOLD for a long time while using your other thumb to aim the laser beam.  Aim at COLBEAR's feet, hands, and face!<br/><br/>COLLECT ALL THE BB GAMES! <br/>Battle Bears Gold Multiplayer FPS (FREE!) <br/><br/>FOLLOW US:<br/>Discord.gg/BB join the revamp talks<br/>Facebook @BattleBears <br/>Instagram @BattleBears <br/>YouTube @BattleBears <br/>Twitter @BattleBears <br/><br/>A LETTER FROM BEN:<br/>Using ARkit, we've brought to life our classic hit game BATTLE BEARS ZOMBIES. Players can experience Zombie Huggables &amp; Unicorns chasing them in real life. Players simply tap to zap them away as long as they can. On sale for a limited time, players also get the 64-bit optimized award-winning offline campaign mode which won TouchArcade's Best Games of 2009 for its hilarious cutscenes, wacky weapons, and epic boss battles. With over 4 million downloads, we're happy to introduce AR to the BATTLE BEARS' iOS fan base with this epic new update that's under 150MB for space savings. <br/><br/>This is the first update for BB ZOMBIES in 5 beary long years! Thank you for everyone's patience and support. It's great to get a least one of our BB TRILOGY games updated to 64-bit for iOS 11.  We're hard at work on revamping BB GOLD ROYALE with new weapons, new maps, new mode, chat and clans.  <br/><br/>SHOUT OUT to all the amazing fans that have stuck with us since 2009: <br/>InstableGriff, Wilpower784, Hackey5, Grimreaper0100, thecheeselover, Clinkzbone, Lethal, Massengrab, Soo_hey, smtony, FISHDO, CryCry, MooseOnTheLoose, Oyster, Can'tTouchThis, Dban1, TeddyRuxp, DrMilkyWay, Reckless04, Boboimo, SSP Rism, SSPooky, Cloud[SS], LoneWarWolf, TacticalWarrior, Nightlock429, Assassins Ace, saltshaker99, Pirate, N.Y.C.O, goose, alpha, NooseOnTheLoose, ChaoTicKraze, TrueChico1415, HuggableIsTrue, Oops_killed_ya, Fluttershyisbestpony,Slate, eXTCy, SleepylilReapy, Earmuffs, DoodleQuick, LXSXL, Naporu, MyLittlePwnies123, Muzzle, FishThing, theLurker, Guyfromanotherplanet, OCOliver234, Dylan, Dunchaxman, Hug2Death, Zorua52, Gnifle, Buckets, Alpha, candyissweet, akurotetsu, Cat_God, Spectrum_of_truth, Quantum,Slimefon, ComfySofa, WingedDragon, Imapeaceadvocate, Cryo, Ultimate_Bear, Wraith, FREESH, 88kai1, UltimateSwimmer, AI Crunk, AI Evil Surge, icezazae, NUGAT, DTA Delirious, chanceyboii, S8 Royalty, Chase81, WhiteHero, SnapPlay, DTA OssianKllYou, Cruzzzey, Sloaney panda, WeNoodle, Wildman, Nuclear Dawn, Shane77, AI Dank123, Hectic, S8 MARIO, OG Evolution, M0rty, Garlic, SAmik37, kidgunso, Hayden, Mudssun, Grunt, Kenmister1, Kenneth, Crayola.bbg, GrieverXVII, Storm, TotallyExist, PlasticMemories, bwearpoe, Conkers, Freddy, Gebarmutterhals and many more. WE &lt;3 YOU ALL!<br/><br/>BATTLE BEARS was created by @BenVu and developed @SkyVu in Omaha, Nebraska. BATTLE BEARS is a registered trademark of SkyVu Inc.", "metacritic": null, "released": "2009-08-31", "tba": false, "updated": "2019-07-30T03:21:36", "background_image": "https://media.rawg.io/media/screenshots/bb8/bb8b7a21060ca414b008e38243f434d7_NYp2cRi.jpg", "website": "http://www.BattleBears.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SkyVu"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["SkyVu"], "esrb_rating": null}