{"id": 79655, "slug": "truck-simulator-pro-2", "name": "Truck Simulator PRO 2", "name_original": "Truck Simulator PRO 2", "description": "This is the moment everybody has been waiting for - we present the brand new Truck Simulator PRO 2, a bigger and better version of the highly successful last year’s edition. Build up your transporting empire driving huge and powerful trucks on American soil in the best and most advanced simulator<br/>game available on mobile devices.<br/><br/>An enormous open world with thousands of miles of precisely mapped roads awaits for your arrival. Admire carefully designed viaducts, huge road intersections and bridges as well as more diversified routes amongst hills, valleys, deserts and swamps.. TSP2 enables you to explore the eastern half of<br/>USA's highway system and visit 12 big cities: Las Vegas, Denver, Phoenix, San Francisco, Los Angeles, Helena, Portland, Salt Lake City, Seattle, El Paso, Albuquerque, San Diego.<br/><br/>Have you ever wondered what is it like to work as a professional truck driver? Experience the struggle through realistic fatigue and fuel consumption systems that can leave you with your gas tank empty in the middle of nowhere! You need to plan the route carefully and manage every aspect of your work to deliver your cargo on time and maximise your gains. Remember, you are not alone on the road – the police will be watching closely, so any type of reckless driving, speeding or damaging other vehicles can result in tickets and penalties that affect your wallet.<br/><br/>Along the long and winding road to wealth you will get to acquire and drive 8 different, fully customizable trucks, each with a different driving model. You can customize various elements of your trucks, from mechanical like gearboxes and engines to visual like wheels, fenders, exhausts and other<br/>chrome goodness- you are limited only by your imagination!. Feel free to create a powerful truck of<br/>your dreams and compare your designs to those of your friends.<br/><br/>Sick and tired of repetitive tasks? That is no longer an issue! In Truck Simulator PRO 2 you will<br/>experience realistic quests of a professional driver – like delivering timber to sawmills or heavy<br/>machinery to road works. Hundreds of missions to accomplish will keep you occupied for a long<br/>period of time!<br/><br/>Features:<br/>▶ 8 trucks with different driving models that you can own, customize and upgrade<br/>▶ Variety of cargos to transport across a huge map covering the eastern half of USA<br/>▶ Over 30 different types of shipments/cargos to deliver<br/>▶ Breathtaking open world to explore<br/>▶ 12 big cities to visit<br/>▶ Realistic fuel consumption and fatigue system<br/>▶ Expanded customization<br/>▶ Hundreds of realistic quests<br/>▶ Detailed interior view for each truck", "metacritic": null, "released": "2017-02-02", "tba": false, "updated": "2019-08-02T05:09:40", "background_image": "https://media.rawg.io/media/screenshots/089/089a6460ff8ad913683c06075d04d086.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["CONSULIT PIOTR KAZMIERCZAK MICHAL MIZERA SPOLKA CYWILNA", "Mageeks Apps & Games"], "genres": ["Simulation", "Racing"], "publishers": ["CONSULIT PIOTR KAZMIERCZAK MICHAL MIZERA SPOLKA CYWILNA", "CONSULIT KRZYSZTOF STARZECKI MICHAL MIZERA SPOLKA CYWILNA"], "esrb_rating": null}