{"id": 7966, "slug": "raptor-call-of-the-shadows", "name": "Raptor: Call of the Shadows", "name_original": "Raptor: Call of the Shadows", "description": "Top rated vertical shoot&amp;#39;em-up from the 90&amp;#39;s, Raptor: Call of the Shadows has been given the deluxe treatment for modern day gaming on the go.<br/><br/>Prepare to experience one of the most popular PC shareware games, now available on iPhone devices!<br/><br/>Full Version Includes:<br/><br/>Three complete episodes with huge boss battles:<br/>-Bravo Sector: Original shareware game (lite)<br/>-Tango Sector: Greater challenge awaits<br/>-Outer Limits: To the moon, and beyond!<br/>(27 missions + 4 difficulty levels each)<br/><br/>Five extra powerful weapons only available in the full version:<br/>-Plasmaray: Nicknamed the &amp;#39;Deathray&amp;#39;<br/>-Laser Turret: Auto-targeting laser strike<br/>-Power Disrupter: Overloads enemy equipment<br/>-The Bomb: Destroys ground units on a budget<br/>-Twin Laser: The ultimate weapon<br/>(17 power-ups available)<br/><br/>Perfect conversion to the iPhone.  Relive the memories, or learn firsthand why fans love Raptor.<br/><br/><br/>Features:<br/><br/>- Fly through deserts, jungles, cities, and space as a hired gun for money and adventure, but mostly money<br/>- Buy weapons and catch power-ups to upgrade your firepower and abilities<br/>- Seamlessly updated to run on modern handheld devices<br/>- Excellent new touch controls bring you into the action<br/>- Great game play that stands the test of time<br/>- &amp;quot;Watch out for the Battle Cow!&amp;quot;<br/><br/>Are you good enough to survive the onslaught of enemies that are coming to shoot you down?  If you are looking for old-school shoot&amp;#39;em-up action, then try Raptor today!<br/><br/><br/>The Story So Far:<br/><br/>Your engine&amp;#39;s turbines roar as you scream out of the sky.  Startled troops look up just in time to see your wing cannons blaze.  You feel the plane buck slightly as your missiles streak toward their targets.  A flash in the distance tells you that they have done their job and so have you.  The Mega-Corps pay well, for those good enough to survive.  They call you into the shadows with dreams of wealth, and you answer, the only way you know how.<br/><br/>Welcome to the world of Raptor.  You and your plane are the best there is, and you&amp;#39;re ready to face your ultimate challenge.  Earn cash from each successful mission to buy upgrades for your plane and outfit it with the best that money can buy.  Keep those shields charged with Energy Modules and stock-up on high tech gadgets, because you are going to need it!<br/><br/><br/>-------------------------------------<br/><br/>Ported to iPhone devices by Blitwise:<br/><br/>Blitwise, best known for creating Pocket Tanks (also in the App Store), has taken on the challenge of porting one of the best 2D shoot&amp;#39;em-ups to the latest in mobile technology.  It is our honor and privilege to squeeze Mountain King Studios, Inc. classic game into a handheld device with fantastic touch screen controls.  <br/><br/>Michael P. Welch says, &amp;quot;Raptor: Call of the Shadows was one of the first PC games I ever played, and its fluid graphics and game play just blew me away.  How could I resist?&amp;quot;<br/><br/>Learn more about us at:<br/>www.blitwise.com", "metacritic": null, "released": "1994-04-01", "tba": false, "updated": "2023-02-08T10:41:49", "background_image": "https://media.rawg.io/media/screenshots/303/3033b7e609f1b1a5a42dcb399ab84122.jpeg", "website": "http://www.blitwise.com/raptor_iphone.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 5, "beaten": 3, "toplay": 3, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "iOS"], "developers": ["Cygnus Software", "Blitwise Productions"], "genres": ["Action", "Arcade"], "publishers": ["Apogee Software", "Blitwise Productions"], "esrb_rating": "Everyone 10+"}