{"id": 79667, "slug": "the-manga-works", "name": "The Manga Works", "name_original": "The Manga Works", "description": "Make history with manga! Turn your work into anime, drama, and even movies!<br/><br/>It's the manga artist experience you've been waiting for!<br/><br/>Create a manga masterpiece and draw your way into the nation's heart.<br/><br/>Start out as a fledgling manga artist in a small and empty room... Armed with only a single pen, draw the best manga you can and march proudly to the publishers to show off your work.<br/><br/>This is a manga artist simulation game that follows you on your path to greatness.<br/>Over 5 years, your aim is to grow and progress from small-time scribbler to famous manga artist, and try to win all the publisher's prizes.<br/>Fight your way up the rankings, and become the number 1 manga artist!<br/><br/>▼Game Flow<br/>First, let's draw a manga. Choose a theme and a scene that you think will fit together well, and then you can draw a great manga.<br/>Send your manga to publishing companies and get on good terms with the publishers. If you complete various requests for one-shot manga, you might be asked to produce a series. This is why it's a good idea to please the publishers.<br/>Train your skills so you can draw amazing manga day after day. Training is tied directly to improving your manga's quality.<br/>Once your manga has been serialized, try to progress up the ranks. Obtain Plot Points and use them to set plans so you can draw the best manga the world has ever seen!<br/><br/>▼About Manga Creation<br/>The better your manga fits together, the more experience points you'll obtain. The more popular the combination, the longer the manga will be. <br/>The more volumes of manga you produce, the more requests and interviews will pour in. You can acquire more themes and scenes by buying them from the shop. <br/>Perhaps you will also get them by completing requests for one-shots... Try and challenge yourself to form lots of different combinations for your manga.<br/><br/>▼About Publishing Companies<br/>Publishing companies single-handedly take care of selling of your manga, and support you (the artist) completely. The more manga you have in circulation, the more power the publishers have. Make sure you choose a publisher who fits your manga, or it will be difficult to obtain a high popularity rank.<br/><br/>If you keep declining requests from publishers, they will stop sending requests. If that happens, you'll have to draw a new manga and take it to the publishers again.<br/><br/>▼About Serialization<br/>If you want to rise high in the popularity rankings, you'll need to use Plot Points.<br/>The amount of Plot Points you use determines the atmosphere of the manga. For example, if you use only a few Plot Points, the manga volume will have an Ordinary Arc... However, if you use more, then the manga volume will have a Highlight Arc.<br/>Occasionally you might link three weeks' atmospheres in a particular order, and your manga will change to become even better.<br/><br/>Increase your manga artist stats, and keep an eye on the use of your Plot Points!<br/><br/>▼About Manga Artist Rank<br/>As you sell more manga volumes, you will be acknowledged and your manga artist rank will increase.<br/><br/>As your manga artist rank increases you will be able to buy more things in the shop. You will also discover more themes and scenes, and even be able to take your manga to new publishers.<br/><br/>Produce the best manga the world has ever seen, and write your name down in history!<br/><br/>Try searching for \"Kairosoft\" to see all of our games!!<br/><br/>Developer Homepages. Feel free to follow me♪", "metacritic": null, "released": "2016-08-11", "tba": false, "updated": "2023-12-25T10:32:56", "background_image": "https://media.rawg.io/media/screenshots/754/754407d579aa022c1939b3e3dc384fe9.jpg", "website": "https://kairosoft.net/game/appli/manga_ippon.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 7, "beaten": 3, "toplay": 1, "dropped": 2}, "playtime": 7, "achievements_count": 6, "ratings_count": 4, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "Nintendo Switch", "Android", "iOS"], "developers": ["Kairosoft"], "genres": ["Adventure", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Kairosoft"], "esrb_rating": null}