{"id": 79664, "slug": "lifeline-whiteout", "name": "Lifeline: Whiteout", "name_original": "Lifeline: Whiteout", "description": "Alone in a frozen wasteland with no memory of how he got there, a lost adventurer’s only hope is his last line of communication – to YOU! Guide him to safety and help him find his identity in this gripping story of survival. Your choices shape the story as you play!<br/><br/>3 Minute Games has partnered with Eipix Entertainment for the next installment of the critically-acclaimed Lifeline series. Lifeline: Whiteout introduces a brand new character, V. Adams! Play on the go with real-time notifications sent to your device or check in with V. Adams throughout your day – waiting for the bus, eating lunch, before bed!<br/><br/>Decisions can have a profound effect. Finish the game and then play again to discover a whole new story when you make different choices.<br/><br/>WATCH US: http://www.youtube.com/c/LifelineGame<br/><br/>Praise for Lifeline:<br/><br/>“This is the best game on the Apple Watch.” – Time.com<br/><br/>“I’ve played many games that I find engrossing, but Lifeline may be one of the first that changed the way I thought about my daily routine, which leapt off the screen and became a part of my lived experience.” - Eli Cymet, Gamezebo<br/><br/>“For a few brief hours I cared – really cared – about the fate of a completely fictional character. I don’t think any other game I’ve played has made me feel that way before.” - Matt Thrower, PocketGamer", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2019-07-31T03:29:18", "background_image": "https://media.rawg.io/media/screenshots/767/767351db9d2fef731534f2ae5025ac60.jpg", "website": "http://3mingames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1, "beaten": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 3, "platforms": ["iOS", "Android"], "developers": ["3 Minute Games"], "genres": ["Adventure", "RPG"], "publishers": ["3 Minute Games"], "esrb_rating": null}