{"id": 79675, "slug": "lifeline-halfway-to-infinity", "name": "Lifeline: Halfway to Infinity", "name_original": "Lifeline: Halfway to Infinity", "description": "Taylor's journey continues! Deep in the isolated vacuum of space, trapped in orbit around a strange black hole, our intrepid astronaut must once again reach out for a lifeline - YOU! Inside the spaceship Veridian, Taylor thought it was time for some hard-earned quiet solitude and a little R&amp;R, but a very unexpected guest has other plans… <br/><br/>The story unfolds in real-time, and every decision you make shapes the course of the story. Taylor's life, the fate of humanity, and time itself are in your hands. No pressure!<br/><br/>*This game is best experienced on iPad 4/iPad Mini 2nd gen and up.*<br/><br/>• Taylor’s epic struggle for survival continues!<br/>• The sixth installment in the hugely popular Green Series! <br/>• Acclaimed author and fan favorite Dave Justus returns!<br/>• Immerse yourself in this sci-fi adventure with notifications from Taylor delivered throughout your day.<br/>• Your decisions could change the course of humanity... and possibly time itself!<br/><br/>Praise for Lifeline:<br/><br/>“I’ve played many games that I find engrossing, but Lifeline may be one of the first that changed the way I thought about my daily routine, which leapt off the screen and became a part of my lived experience.” - Eli Cymet, Gamezebo<br/><br/>“For a few brief hours I cared – really cared – about the fate of a completely fictional character. I don’t think any other game I’ve played has made me feel that way before.” - Matt Thrower, PocketGamer", "metacritic": null, "released": "2016-12-14", "tba": false, "updated": "2019-07-31T06:50:46", "background_image": "https://media.rawg.io/media/screenshots/4ec/4ec93e62cfe2fc20bd84604c07436fde.jpg", "website": "http://3mingames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["3 Minute Games"], "genres": ["Adventure", "RPG"], "publishers": ["3 Minute Games"], "esrb_rating": null}