{"id": 796996, "slug": "cult-birthright", "name": "Cult Birthright", "name_original": "Cult Birthright", "description": "<p>You have been sacrificed by the Cult of Rebirth in order to enter Heaven and complete your ultimate mission - destroy God!</p>\n<p>But be wary: His warped followers stand in your way. Use the 'Fire1' button to attack them with your unholy blade, or avoid them and ascend through Heaven with 'Jump'.<br/><br/>Destroying His followers will earn you points. Grab a health tonic of unholy essence to restore hearts and earn bonus points.<br/><br/>Can you defeat God?!<br/></p>\n<p><strong>Our submission for the GameDev.tv 2022 Game Jam with the theme, \"Death is only the beginning\". Coded almost entirely in Unity Visual Scripting (AKA Bolt) from start to finish, with a little help from the free version of DOTween. The 3D art by Christmas2 was created in Blender.</strong>\n</p>\n<p><strong>Gameplay Tips:</strong><br/><br/>There are a few hidden health tonics littered throughout the stage at critical moments. If you fall off Heaven, or hit a fatal trap, you will be restored to the last checkpoint and take a point of damage.<br/><br/>The final gauntlet of moving platforms before God is <em>NOT</em> impossible. Pay close attention to the timing and only commit to a jump when you think you can make it. Of course, some of His followers may appear and ruin that...!<br/><br/>If you're reeeeally struggling with your health, there are two keyboard keys which restore/remove health that we used for debugging... ;)\r\n</p>\n<p><strong>Version History:<br/><br/>1.0/Source - Initial submission<br/></strong><strong>1.1/Source - Fixed victory screen UI display/score bug and mid-level health spawner bug.</strong><br/><strong>1.2/Source - Restored missing final platform to God (it's not impossible now, just hard!), \"Quit\" button on victory screen and 'Fire1' typo.</strong></p>\n<strong>\n</strong><p><strong>Credits:</strong></p>\n<p><strong><br/>Code, Design, UI - Young Scott<br/>3D Models, Concept, Level Design - Christmas2<br/>Some 3D Models, Sounds, Fonts - Kenney<br/><br/>A BIG special thanks to the learning resources we used for this project, including:<br/><br/>CodeMonkey's Udemy courses and YouTube channel<br/>Gamedev.tv's Udemy courses and live streams</strong><br/></p>", "metacritic": null, "released": "2022-05-30", "tba": false, "updated": "2022-06-03T17:15:27", "background_image": "https://media.rawg.io/media/screenshots/883/883bdee124ce38f5e9752e7690861fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Young_Scott"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}