{"id": 796992, "slug": "guidance-sapobi", "name": "Guidance (Sapobi)", "name_original": "Guidance (Sapobi)", "description": "<p>Hi there! <br/>I'm Sapobi, and I work in the void between death and the afterlife.  I need to guide all these souls to their new home. But Aaaaah! Due to my personal life and suddenly deciding to Participate in a GameJam. I have no time at all!<br/>Please help!<br/></p>\n<p>-----------</p>\n<p>Art from  https://cainos.itch.io/pixel-art-top-down-basic \r\n<br/>How I wish I could have made more from the beautiful artwork Cainos had made. Maybe some other game in the future :D\r\n</p>\n<p>Submission for the GameDev.tv GameJam 2022\r\n</p>\n<p>-----------<br/>-----------</p>\n<p>Personal story<br/></p>\n<p>Well then, that was some intense few days. I only decided to join later on when the gameJam was already halfway through or so. Honestly I had no idea what to do for the theme \"Death is only the Beginning\", but ended up deciding on the idea of guiding souls. Sadly I have almost no experience with Unity (or any gamedev thing...), so the development process ended up being more like a study time, and I learnt SO much!<br/>I did feel like giving up on actually submitting anything due to not feeling like I really have a game, but I'm glad I didn't. Because even though it's far from being anything fleshed out, having clicked submit and having made something that \"works\" from start to finish is actually such an amazing feeling!</p>\n<p>Hope to show my skill improvements in the future &lt;3 And I'm rooting for all you fellow game developers out there! Especially you fellow beginner!</p>", "metacritic": null, "released": "2022-05-30", "tba": false, "updated": "2022-06-03T17:13:13", "background_image": "https://media.rawg.io/media/screenshots/759/759e8e20a7fc2e4049411fd5b85a0e2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Sapobi"], "genres": [], "publishers": [], "esrb_rating": null}