{"id": 79700, "slug": "real-snow-drifting-racer-reckless-drift-racing-gam", "name": "Real Snow Drifting Racer - Reckless drift racing game fever 2016", "name_original": "Real Snow Drifting Racer - Reckless drift racing game fever 2016", "description": "Real snow drifting racer, is best free drifting game that gives you a unique pleasure in handling sports car by simple &amp; instinctive way.Real snow drifting racer also gives you a matchless experience in the handling of most modern cars by the simple and the challenging way on any  road and snow environment.Get ready for the thrills of roads which doesn't exit anymore.Enjoy the real snow drifting racer  with road and snow environment. Let's speed off in beautiful winter graphics with no restrictions.<br/><br/>Drive your car in a crazy freezing environment at extreme speed and simulate real snow drift ing racer of luxury cars in snow environment and avoid to crash down from touch to other cars.Become the driver of some of the fastest cars and drift in the snow environment.This amazingly real snow drifting  racer game is packed full of super cool fast  drift cars and exciting,dynamic racing levels.<br/><br/>If you are really enthusiastic about real snow drifting  racer game than this game is for you.Burn your tyre on each drifting track.Earn best drifting trophy by showing your top driving skills.If you like to drift, get ready to spend many hours playing this game.Use separate hand brake button to start drifting.Insane feeling of powerful real snow drifting  racer . Unique driving on road  environment.<br/><br/> How to play:<br/><br/>Play this free real snow drifting racer game and drifting on multiple snow and desert way to assembling  and leave the mark on snow environment  with your full spirits and passion.<br/><br/>Drift safely on track to avoid your sports car crash but don’t attempt real snow drifting racer , your car engine &amp; transmission are full of power &amp; energy so you will not be able to control it in real snow drifting racer, Be a real drifter and not a drag racer or Snow racer. Game has special feature of slow motion drift button for slow car drifting view.<br/><br/>Select car, start engine, Boost acceleration and drift your luxury vehicle in snow environment.<br/>Forward and reverse buttons are on the right bottom of the screen.<br/>You can select tilting, steering or arrows to drive your car.<br/><br/>Feature:<br/><br/>- Realistic Drift Car Physics with turbo engine.<br/>-  Smoothest gameplay<br/>- Outclass drifting<br/>- Addictive sound to vibrate your mind<br/>- Easy to learn, a challenge to be skillful<br/>- Awesome cars and track to explore<br/>- Multiple tracks with Smooth Interfaces.<br/>- Load of traffic<br/>- Thrilling adventure<br/>- Completely free game", "metacritic": null, "released": "2016-05-04", "tba": false, "updated": "2019-10-22T14:31:11", "background_image": "https://media.rawg.io/media/screenshots/55f/55f7b2f0bbd4466b64efae6531a0171e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["Sports", "Racing"], "publishers": ["jolta technology"], "esrb_rating": "Everyone 10+"}