{"id": 79717, "slug": "dungeons-of-chaos-lite", "name": "Dungeons of Chaos - LITE", "name_original": "Dungeons of Chaos - LITE", "description": "This is the LITE version of the popular retro RPG Dungeons of Chaos. Play the first chapter, and level characters up to level 5. The full game has no level caps and 80+ hours of gameplay.  The full game is a separate app under the same title, there is no IAPs to upgrade, the LITE version is a standalone app.<br/><br/>Dungeons of Chaos is a retro-style 2D RPG that takes you on an epic journey with numerous spells, skills and tactical combat to employ in order to win the battle against evil. Huge locations to explore (both unique and randomised). Totally ad-free. A 4.8 star rating and a very engaged fanbase on our facebook page and steam forums, where I discuss frequent updates and additions.<br/><br/>Favourite fan quote to date (Kristian Borcheck): \"If you were a fan of Ultima 3,4,5 or games of that ilk then this game will feel like coming home\"<br/><br/>Quotes:<br/><br/>\"An Old-School-RPG with great character development, rewarding exploration, turn-based combat and well designed dungeons and quests. Retro-Fun!\" - RPGWatch<br/><br/>\"Deeply immersive and a whole lot of fun, Dungeons of Chaos belongs on the iPad of any self-respecting 1980s role-playing fan.\" - iRumorsnow <br/><br/>\"If Avernum and Ultima 4ish had a genius baby, this would be it.\" - Aldinach<br/><br/>\"The little guy who made this game made a gem. [...] It's very fun and deep. Creating characters is the bomb. It's great!\" -- anabolicMike <br/><br/>FEATURES: <br/>- retro-style RolePlayingGame (RPG) in the spirit of old classics <br/>- vast locations to explore in a top-down 2D tile-based view<br/>- many different character classes, spells and skills to employ. Guilds can give access to advanced classes<br/>- rewarding quests to fulfil <br/>- atmospheric music, and detailed lighting and line-of-sight visual mechanics<br/>- non-linear content and exploration: many locations exist outside the main storyline, with unique monsters and treasure and secrets<br/>- some locations are fully randomised and different each time you play (procedural content generation). Some are randomised and re-settable. And there are over 30 fixed locations supporting the main storyline.<br/>- many rare item properties make for over 5,000,000 combinations that let your armour, weapons and accessories take on powerful bonuses<br/>- defeat many different monsters with unique abilities and challenges. level up your characters and upgrade their abilities.<br/>- find important NPCs to expand your skill sets, find magic books to boost your spell knowledge and improve your equipment by trading your bounty with various shop owners<br/>- intricate fight mechanics: flanking or being flanked makes an encounter change from being easy to being dangerous, and vice versa; using the right boost/support/attack spells and skills will prove vital for survival<br/>- control a party of 6 characters, which you can generate using 9 starter classes and unique character features <br/>- try out different classes, experience different randomised locations, find different equipment, for great replay value<br/>- various difficulty levels. Higher difficulty yields better loot but also much tougher enemies and game mechanics<br/><br/>DETAILED GAME MECHANICS, TACTICS and HINTS are available at the support website https://dungeonsofchaos.wordpress.com. <br/><br/>Some gameplay videos:<br/>https://youtu.be/NXEK7R5hB5c?list=PLMAEZZoVxsGLS_YtEEWFYxPL93heVaqOq<br/>https://youtu.be/RF45sJk_l2M?list=PLMAEZZoVxsGLS_YtEEWFYxPL93heVaqOq<br/><br/><br/>DEVICE SUPPORT:<br/>Dungeons of Chaos is designed to work on as many devices as possible and back to iOS6. Issues DO arise on very old devices with low memory (RAM of 256MB or less), such as iPad2 or iPad Mini or iPhone 4S and 5C if the latter run iOS 8 or 9. The game works fine on iPhone 5S,6,6S,6Plus and on newer iPads like iPadAir 1 or 2, or iPad3. <br/><br/>For any problems or suggestions we would love to hear from you at: dungeonsofchaos@gmail.com .", "metacritic": null, "released": "2018-04-23", "tba": false, "updated": "2019-07-30T13:25:38", "background_image": "https://media.rawg.io/media/screenshots/279/2795a0d62e01a6d592c1526eaaee23b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Volker Elzner"], "genres": ["Adventure", "RPG"], "publishers": ["Volker Elzner"], "esrb_rating": null}