{"id": 79730, "slug": "minecraft-skin-studio", "name": "Minecraft: Skin Studio", "name_original": "Minecraft: Skin Studio", "description": "The OFFICIAL Minecraft Skin Creator!  With 1.4 MILLION skins and support for Java and Bedrock Edition... we're sure you'll love Skin Studio.<br/><br/>Now you can create, upload and share Minecraft skins on-the-go! Get creative and design an epic skin for your character. Why stick with plain old Steve when you can choose from over a MILLION community created skins or design your very own personalized skin using our easy to use studio! <br/><br/>• Design your own Minecraft skins, upload to Minecraft or share with the world! <br/>• We have 1.4 MILLION community skin designs to choose from!<br/>• NEW: Compatible with Minecraft Bedrock Edition! (NOW FREE!)<br/>• NEW: Supports 1.9+ transparency (alpha) on the hat/armor layer<br/>• NEW: Completely remastered user interface! <br/>• NEW: Choose from either the Steve or Alex models (4px or 3px arms)<br/>• NEW: See your masterpiece in 3D while editing!<br/>• NEW: Creative Pack contains loads of new editing tools to help you design epic Minecraft skins (NOW FREE)<br/>• NEW: 3D Touch support (iPhone 6S and 6S+ only)<br/>• NEW: Full Skin Mode — no need to keep switching skin parts<br/>• NEW: Shading tool (3D touch compatible devices only!)<br/>• Discuss, like or dislike community submitted skins<br/>• Import skins from Minecraft.net (skin stealer), tweak and upload<br/>• Upload your creation (or a community skin) directly to Minecraft.net for the PC edition of Minecraft*<br/><br/>==== IMPORTANT ==== <br/>\"Minecraft\" is a trademark of Mojang AB. <br/>Skins can only be uploaded to supported Minecraft platforms (i.e. Java and Bedrock Edition only at this moment in time). However, you can still design and share skins if you don't play these editions. The app does NOT support the creation of custom skins for Xbox edition at this time (it's impossible for us to add because the games don't support them!), although if the game allows it in the future, we will defiantly add definitely for it. <br/><br/>This version of the app may pop-up to tell you about important announcements from 57Digital Ltd. However, this will only happen in rare cases and will only ever pop-up once.<br/><br/>*** Uploading skins to Minecraft.net or Bedrock Edition requires the Minecraft game.", "metacritic": null, "released": "2012-10-16", "tba": false, "updated": "2019-08-02T05:40:28", "background_image": "https://media.rawg.io/media/screenshots/fef/fef719bd741c856ea4ee1d3a5fe16b77.jpg", "website": "http://www.minecraftskinstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["57Digital"], "genres": ["Adventure", "Simulation"], "publishers": ["57Digital"], "esrb_rating": null}