{"id": 797593, "slug": "throne-of-the-lazybones", "name": "Throne Of The Lazybones", "name_original": "Throne Of The Lazybones", "description": "<p>(I was going to make this playable in the browser, but for some reason I couldn't get it to work. Because of this, in order to preserve my sanity and <em>not</em> go past the deadline of the game jam I made this for, I've decided to just make it a downloadable project.)<br/></p>\n<p>Experience the feeling of being a lazy monarch, commanding your subjects to gather resources to upgrade your city (and their productivity) while you do basically none of the work!</p>\n<p>Direct your population to gather the four main resources of wood, stone, gold, and cotton (never said I was going for realism here), then use these resources on increasing your subjects' productivity and turning your humble campsite into a bustling city.</p>\n<p>v1.0.0 was made entirely by me (sound effects, art, coding, etc.) in 6 days for Wonderjam 2, and the current version is just v1.0.0 with some major bugs fixed. I may make an updated/better quality version of this game which includes the features I wanted to add but didn't have time to (and which is hopefully playable in web browsers) - no guarantees, though. (Also, I didn't have much time for playtesting, so sorry in advance for any balancing issues or bugs.)</p>\n<p><strong>Controls:</strong><br/></p>\n<ul><li>Click on the areas around your city (forest, cave, bunch of cotton) to gain resources.<ul><li>The type of resource(s) you get depends on which area you click.</li></ul></li><li>Click on the city to open a menu that allows you to increase your population at the cost of gold.<ul><li>The \"+MAX\" button gives you the maximum amount of population you can afford.</li></ul></li><li>Press E to open/close the population/upgrade management menu, from which you can buy upgrades and manage what percentage of citizens are working at each resource area.<ul><li>In order to manage how many citizens work at each resource area, use the buttons next to the bar near the bottom of the screen.</li></ul></li><li>Press Shift + S or click the Save Game button in the top right corner to save. Your most recent save will automatically be loaded upon starting the game.</li><li>Press Shift + R and then click \"Yes\" on the resulting prompt to reset your progress. This will not reset your save data, but saving after resetting your progress will overwrite your old save data.<ul><li>There is currently a bug with this, and I would instead recommend going to <strong>C:/Users/[username]/AppData/Roaming/Godot/app_userdata/Throne Of The Lazybones</strong> and deleting the file <strong>savegame.save</strong> if you want to reset your progress.</li></ul></li><li>The Z and X buttons can be used as an alternative to clicking.</li></ul>\n<p><strong>Known bugs:</strong></p>\n<p>\n</p>\n<ul><li>Increases to the amount of resources you get per click (except for gold/click) persist between progress resets.</li><li><ul><li>Saving after resetting and then closing and reopening the game will partially fix this, but the level of the Better Axes upgrade may be incorrectly saved, resulting in this upgrade being at a higher level than it should be.</li><li>If you want to truly reset your progress, you can go to <strong>C:/Users/[username]/AppData/Roaming/Godot/app_userdata/Throne Of The Lazybones</strong> and delete the file <strong>savegame.save</strong>.</li></ul></li><li>When getting some levels of upgrades, there seems to be a bug where the game will either crash or not give you the upgrade if you try to buy it. This only seems to happen when the cost is approximated (for example, as 1.0k), and also happens when trying to increase your population. I would recommend saving your progress before trying to get upgrades.</li></ul>\n<p>\n</p>\n<p><strong>Known bugs (fixed):</strong></p>\n<ul><li><strong>(fixed in v1.0.2)</strong> It is possible for your citizens to completely stop producing resources if you get the final Faster Workers upgrade, save, and then close and reopen the game.<br/>\n</li><li><strong>(fixed in v1.0.1)</strong> It is possible to use the +5 and +25 population buttons to go above the population limit for your current city.</li><li><strong>(fixed in v1.0.1)</strong> Once you are at exactly 9 population (though due to an unknown bug this displays as 8 population in certain (unknown) circumstances), it is impossible to increase the population further without the game crashing.<ul><li>Increasing your population when you have more than 9 population seems to work fine, so you can use the +5, +25, or +MAX population button to bypass getting exactly 9 population to avoid this. If you save while having exactly 9 population, though, you are locked out of getting more population unless you reset your progress.</li></ul></li></ul>", "metacritic": null, "released": "2022-05-30", "tba": false, "updated": "2022-06-03T21:48:07", "background_image": "https://media.rawg.io/media/screenshots/9bd/9bd58431bfdd0ef57c56e0792ef2430c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Onatron"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}