{"id": 797930, "slug": "trail-of-the-damned", "name": "Trail of the Damned", "name_original": "Trail of the Damned", "description": "In <strong>Trail of the Damned</strong> you explore the hellscape known as Damnation, solving mysteries, unlocking secrets, and surviving endless dangers on your quest for Salvation.<br/><br/><h3>Branching Gameplay!</h3><br/>Uncover an unforgiving branching narrative, as you travel in an Oregon Trail style of gameplay, filled with unnerving encounters and unlikely companions. Hideous dangers lurk around every corner and <strong>your choices</strong> will determine who you are, where you go, what you do, who you meet, and ultimately how your story ends.<br/><br/><h3>Encounter Disturbing Horrors!</h3><br/>The art style is very stark and full of contrast - meant to evoke the feelings of darkness and dread appropriate to such a world of horrors.<br/><br/><h3>Solve Mysteries!</h3><br/>The game invites you to explore these horrors at your own pace. Along the way you'll find a land filled with mystery, possibility, and danger. Uncovering and solving certain mysteries will open new locations for exploration.<h3>Features!</h3><ul><li> Seek Salvation, an escape from all that ails, with multiple endings and a variety of challenges along the way.<br/></li><li> The choices you make determine who you are. Are you a con artist? A bully? A scavenger? How you navigate the perils Damnation is up to you.<br/></li><li> Explore a unique fantasy hellscape inspired by creepy silent horror films and other unnerving works.<br/></li><li> Solve puzzles and riddles to unlock mysterious hidden areas.<br/></li><li> Your adventures are underscored by an eerie yet exciting string quartet OST inspired by and combining the kinds of instruments one might hear in a silent movie house.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-06T03:55:55", "background_image": "https://media.rawg.io/media/screenshots/9b1/9b1d655c88e25437d581afeeef80fa7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Silhouette Games"], "genres": ["Adventure"], "publishers": ["Silhouette Games"], "esrb_rating": null}