{"id": 7979, "slug": "rocks-rider-new-generation-for-current-iphone-ipad", "name": "Rock(s) Rider - New Generation for Current iPhone, iPad and iPod touch - (HD Edition)", "name_original": "Rock(s) Rider - New Generation for Current iPhone, iPad and iPod touch - (HD Edition)", "description": "*** PLEASE NOTE: Compatible with iPhone 4s, iPad 2, iPad mini, iPod touch (5th generation) or newer ***<br/><br/>------------------------------------------------------<br/><br/>Quotes from the review with 4/5 stars rating on TouchArcade:<br/><br/>\"Rock(s) Rider – HD Edition is absolutely gorgeous, but it’s also a fun Trials-like motorbike racer.\"<br/><br/>\"You know how many developers brag about their game’s “console-quality” visuals? Well, Rock(s) Rider HD’s visuals can definitely be called console-quality.\"<br/><br/>“Fortunately for us, Rock(s) Rider HD is very fun to play, the kind of game that’s all about glorious, repeated failures on the way to a satisfying victory.”<br/><br/>------------------------------------------------------<br/><br/>Do you dare? Do you want to overcome your limits? Test yourself and face the boss and his gang!<br/><br/>Kick-start your bike, turn on the hard hitting rock music, throw yourself into the underground race and pull the impossible off! Mastering obstacles and risky traps wait for you on the hot tracks. Everybody will see you doing incredibly mad tricks! Grab the all bonus rewards. Race the boss or bet him on a trophy. Slide with the motorbike on dangerous constructions, go through adrenaline on a trike and show to everybody how far you can get with the Hill Climbing motorcycle. Or slow down the reality as in a movie… Show off, get respect among your friends and on the Global Leaderboards… Just enjoy unexpectedly REALISTIC and POWERFUL experience!<br/><br/>8 EXCEPTIONAL features which DIFFERS Rock(s) Rider - HD Edition in its category:<br/>• EXTRAORDINARILY UNIQUE GRAPHICS on the same level as CONSOLE games<br/>• SLIDING with the motorcycle on metal constructions thanks to steel bars welded on wheels or handlebars of the motorbike<br/>• CRAZY ride on a TRIKE<br/>• EXTREME rising with the HILL CLIMBING motorcycle to the top of the factory chimney<br/>• INCOMPARABLY SENSITIVE physics of the motorbike on iOS<br/>• ROCK SOUNDTRACK including 17 full tracks ideal for headphones<br/>• Slowing down the reality thanks to SLOW MOTION ZONES (In-App Purchases)<br/>• Better protection against crashes with help of SAFETY CAGE SYSTEM (In-App Purchases)<br/><br/>Other features:<br/>• 64 levels in 5 industrial environments<br/>• More than 150 challenges<br/>• RACES SIDE BY SIDE WITH THE BOSS<br/>• RAGDOLL PHYSICS of a rider<br/>• 56 Achievements<br/>• 65 Global Leaderboards<br/>• UP TO 9 CONTROL VARIANTS for perfect gameplay<br/>• BET THE BOSS and get the better position on the Leaderboards<br/>• Catapults, lifts, ramps and other movable traps<br/>• Hunting fiery flames, falling traverses and car wrecks<br/>• Nitro Oxide System for the higher performance (In-App Purchases)<br/>• 15 graphic skins for a bike<br/>• 15 outfits for a rider<br/>• More than 200,000 objects on the tracks<br/>• You do not need to be on-line to play the game!<br/>• ReplayKit support<br/><br/>The Rock(s) Rider - HD Edition in contrast with its forerunner, the Rock(s) Rider, is based on HIGHLY DETAILED 3D MODELS and BRAND NEW TEXTURES in double size resolution! We have granted funs’ wishes of our former game and have brought RAGDOLL PHYSICS of a rider and PERFECTLY REFINED PHYSICS of the motorcycle! Many WONDERFUL EFFECTS have been added and more than 80,000 NEW OBJECTS have been placed to the all environments!<br/><br/>Do not forget we are interested in your game evaluation and want to know your opinion. If you identify with our enthusiasm, we will really appreciate your 5-stars rating on the AppStore!<br/><br/>----------------------------------------------------------<br/><br/>Visit our homepage at www.eca-games.com to get more info about the game<br/>Follow us on Twitter at www.twitter.com/ecagames or like us on Facebook at www.facebook.com/ecagames<br/>Check out a game trailer and step-by-step walkthroughs at www.youtube.com/ECAGamesOfficial", "metacritic": null, "released": "2015-09-03", "tba": false, "updated": "2019-07-30T11:55:35", "background_image": "https://media.rawg.io/media/screenshots/c4d/c4d7ebe0117855264a9bfe2818cdf060.jpeg", "website": "http://www.eca-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ECA-Games"], "genres": ["Action", "Racing"], "publishers": ["ECA-Games"], "esrb_rating": null}