{"id": 798116, "slug": "super-slime-seriously-sticky-sassy-scripted-surviv", "name": "Super Slime Seriously Sticky Sassy Scripted Survival Simulator", "name_original": "Super Slime Seriously Sticky Sassy Scripted Survival Simulator", "description": "<p>IF YOU RECORD OR STREAM THIS I WOULD <strong>LOVE</strong> TO SEE IT!!<br/><br/>Also note this can be a somewhat difficult game at points because some of the \"puzzles\" are a bit obscure! I'm sssooorrry!<br/>*NOTE  that spamming things likely will break the game as I didn't have enough time for quality control &gt;0&lt; Also sometimes it may be paused waiting for a click or input [ insert grumbles about spaghetti code]<br/><br/>Get a closer look into the daily hazards a common slime may have during their lifetime.  Adapt. Survive. EVOLVE. Not just your character, but your mind will slowly come to figure out the ins and outs of this cute little puzzlish- simulator as you die, repeat and learn from your mistakes! Can you figure out how the species all survive?<br/><br/>There is so much more I wish I could have improved and worked on for this project, but all things considered, I am SUPER proud of what it is! If this prototype is received well I may even turn it into a full game so make sure to share your thoughts!<br/><br/>This is my entry for the GoGodotJam3 being held this year! This is both my first gamejam and my first game \"release\" so I apologize if things don't work, are buggy, etc! In my solo week and a half of building this adorable project I tried to sink many sleepless nights and lots of love into it! Hope you all love it!<br/><br/><br/>Audio credits are in the in-game menu~</p>", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2022-06-06T06:12:06", "background_image": "https://media.rawg.io/media/screenshots/303/30356ac45a38105515ec2916cf15d826.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Riazey"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}