{"id": 798369, "slug": "dusty-ghost", "name": "Dusty Ghost", "name_original": "Dusty Ghost", "description": "<p>[ENG]</p>\n<p>Hello guys! This is my 3rd game, a modest tribute to <em>Hotline Miami</em>, but in a minimalist style and a spooky ambiance!</p>\n<p>You are a <strong>Dusty Ghost Hunter</strong> and also a treasure seeker. Dusty Ghosts love dust:  it allows them to hide themselves and move faster. But, one thing is certain: they hate <strong>water</strong>! You can kill them thanks to your bubble-gun and clean the dust with your water bombs. Be careful, water bombs aren't lethal, but the dust might be covering a <strong>trophy</strong>. :] If you collect <strong>10 trophies</strong>, you can go to the next level, but you can also stay a little bit more if you want to score more points.</p>\n\n<p>Enjoy! </p>\n<p><strong>Features:</strong></p>\n<p>- 8 rooms chosen randomly with different difficulties.</p>\n<p>- Spawns are determinated randomly. So, each run will be different.<br/></p>\n\n<p><strong>Controls:</strong></p>\n<p>- Arrow keys to move.</p>\n<p>- Mouse to aim.</p>\n<p>- Left click: shoot with your bubble-gun.</p>\n<p>- Hold &amp; Release right click: drop a water bomb to clean dust.</p>\n<p><strong>Good luck! And don't hesitate to share your best score and feedback in the comments! </strong></p>\n<p>-------</p>\n<p>[FR]\r\n</p>\n<p>Yo ! Je vous présente mon 3e jeu, Dusty Ghost, modeste hommage à <em>Hotline Miami </em>dans un style minimaliste et une ambiance spooky !</p>\n<p>Vous êtes un <strong>Dusty Ghost Hunter</strong>, littéralement un chasseur de <em>fantômes poussiéreux</em>. Vous ne le savez peut-être pas mais vous êtes aussi avide de trésors, et surtout de trophées ! Comme leur nom l'indique, les fantômes poussiéreux adorent la <strong>poussière </strong>: elle leur permet de se dissimuler tout en les rendant plus rapides. On sait une chose sur eux : ils détestent <strong>l'eau </strong>: vous pouvez donc les éliminer à l'aide de votre canon à bulles et nettoyer la poussière grâce à vos bombes à eau. Ces dernières ne sont pas létales, mais la poussière cache peut-être de fabuleux trophées, indispensables à votre progression. Ramassez <strong>10 trophées </strong>pour rejoindre le prochain niveau. Mais vous pouvez aussi traîner plus longtemps pour gagner plus de points ! :]</p>\n<p>\n</p>\n<p><em>Enjoy!</em> \r\n</p>\n<p><strong>Caractéristiques :</strong>\n</p>\n<p>- 8 niveaux choisis aléatoirement avec différents niveaux de difficulté.</p>\n<p>- Les points de <em>spawn</em>/d'apparition sont aussi déterminés aléatoirement. Toutes les <em>runs </em>seront donc différentes ! :)</p>\n<p><strong>Cont</strong><strong>rôles </strong>:\r\n</p>\n<p>- Flèches directionnelles pour se déplacer.</p>\n<p>- Bouger la souris pour viser (aidez-vous du curseur !).</p>\n<p>- Clic gauche : tirer avec votre canon à bulles.\r\n</p>\n<p>- Maintenir et relâcher le clic droit : lâcher une bombe à eau permettant de nettoyer le sol.\r\n</p>\n<p>Bonne chance ! Et n'hésitez pas à partager votre meilleur score et avis dans les commentaires ! :)</p>", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2022-06-06T08:35:03", "background_image": "https://media.rawg.io/media/screenshots/e37/e3734220bc066b78215978dd222aeec9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Floppyboy"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}