{"id": 798302, "slug": "cursed-catacombs", "name": "Cursed Catacombs", "name_original": "Cursed Catacombs", "description": "<p>Cursed Catacombs</p>\n<p>By Walter Ariel Risi, 2022</p>\n<p>Also available in cassette format from Chronosoft, here.</p>\n<p>For hundreds of years, the best explorers and adventurers tried to recover the treasures hidden in the Cursed Catacombs. Built deep underground and protected by supernatural and merciless creatures, the catacombs are deadly ground, and all who dared entering them never returned alive.</p>\n<p>Our hero, Zeddy Jones, has determined to recover the treasures hidden in the ten deadly chambers of the catacombs. From an dusty notepad recovered from a past, unlucky explorer, he got some tips for his journey ...</p>\n<p>\"As I write this I observe my imminent doom in the hands of the vicious tomb guardians. For those who find this notes, consider that guardians seem to move following two patterns. Sometimes they pursue you and sometimes they just wander randomnly. Observe them and calculate your move carefully. I wish you have better luck than I had!\"</p>\n<p>The aim of the game is to recover all treasures from the ten rooms of the Cursed Catacombs. Collecting all treasures from a room allows you to move to the next room. </p>\n<p>Recommended started level is \"Easy\" and as you finish the game in this mode, you may try harder ones. The \"insane mode\" is more for party playing, to see how far can you go, since it's almost impossible to finish the game in this mode.</p>\n<p>In the original version, you control the player using OPQA keys or cursor keys (which allows to use cursor based joysticks).</p><p>There is also a ZXPand+ version available for download, that allows to use this type of joystick (note that this version does not support keyboard, so you must use one or the other version depending on your preference).</p>\n<p>Good Luck!</p>", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2022-06-06T07:54:06", "background_image": "https://media.rawg.io/media/screenshots/88c/88ce470565f86de4a6ecae6e81e41926.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Naranjito Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}