{"id": 798323, "slug": "fragment-forge", "name": "Fragment Forge", "name_original": "Fragment Forge", "description": "<p>This game initially arose out of a need to work on something concrete in order to help the Card Game Framework  mature in capabilities. It is meant to push the capabilities of the  framework to the max and where lacking, push the framework’s improvement  as well.\r\n    </p>\n<p>Why this specific game concept? I’ve always been a big fan of the  results demo effect coders achieve. They are amazing works of art and  receive criminally little attention. Typically only by other coders.     </p>\n<p>I felt that the awesome graphics of a Fragment Shader would fit very  well in a digital card game as card illustration and animation which  infinite more variability than any other card game could achieve, at  only a small fraction of the size. However it would be very hard to make  the varied art out there git a game’s theme…unless that game was about  the demoscene itself!\r\n    </p>\n<p>This is further helped by the fact that demo effect coders, unlike a  lot of more traditional artists, release their art directly to the  common, which a commons-game like this could utilize in order to  kickstart their visuals.\r\n    </p>\n<p>TL;DR: I thought it would look fucking cool to have animated shaders as card art. And I think the results speak for themselves!     </p>\r\nCredits and Thanks\r\n<p>The game is only possible due to the amazing work that is the Godot Game Engine.\r\n    </p>\n<p>It would also not be what it is, without all the shader arts released into the commons via Shadertoy. Go check it out and especially the artists whose art I’ve reused for Fragment Forge.\r\n    </p>\n<p>However not all art can be Shaders and this is where Artbreeder comes in, where professional-quality art for personality-based cards can be procured.\r\n    </p>\n<p>And finally a ton of thanks to everyone who releases assets into the  commons and helps improve humanity as a whole. I only hope this little  game of mine adds something worthwhile as well.\r\n \t\t\t\t\t\t\t\t\t\t\t\r\n</p>", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2022-06-06T08:08:44", "background_image": "https://media.rawg.io/media/screenshots/622/622ac45e240bf55d82986cccea3d6bbd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["db0"], "genres": [], "publishers": [], "esrb_rating": null}