{"id": 798382, "slug": "get-more-diamonds-vic20", "name": "Get More Diamonds (VIC20)", "name_original": "Get More Diamonds (VIC20)", "description": "<p><strong>Reset64 is proud to present: </strong></p>\r\nGet More Diamonds (VIC20) \r\nBy Derek.\r\n<p><strong>Synopsis:</strong>\n</p>\n<p>Diamond Dylan is at it again! He finally collected enough diamonds to buy his country cottage. Unfortunately, on arrival at the bank, he discovered housing prices had risen and he requires more diamonds to pay for his dream home. Help Diamond Dylan navigate each of the 8 levels to 'get more diamonds' so he can finally retire in peace and get away from the traffic, once and for all. </p>\n<p>Get More Diamonds is a 1 player game for your 35kb expanded VIC20, featuring colourful graphics, in game sound and 8 fiendish levels.\r\n</p>\n<p>Get More Diamonds will work on both PAL and NTSC VIC20s.\r\n</p>\n<p><strong>NOTE: </strong>We can and will not take responsibility for broken joysticks and screens. We encourage deep breathing if you encounter heightened levels of rage.</p>\n<p><strong>VIC20 instructions:</strong>\n</p>\n<ul><li>GUIDE DYLAN AROUND THE EIGHT LEVELS COLLECTING DIAMONDS.</li><li>AVOID THE BADDIES, COLLECT EXTRA LIVES AND USE INVINCIBILITY SHIELDS TO KILL BADDIES.</li><li>COLLECT KEYS AND UNLOCK THE CORRECT DOORS TO ACCESS OTHER PARTS OF THE LEVEL.  ON SOME LEVELS KEYS MUST BE COLLECTED IN A CERTAIN ORDER OTHERWISE YOU WILL BE STUCK WITH AN UNPASSABLE DOOR!</li><li>ONCE ALL DIAMONDS ARE COLLECTED, DYLAN CAN EXIT TO THE NEXT LEVEL.</li><li>IF YOU GET KILLED, YOU WILL RESTART THE CURRENT LEVEL AT THE NEAREST RESTART POINT.</li><li>YOU CAN JUMP ONTO ROPES AND LADDERS BY USING UP AND DOWN AS YOU JUMP PAST TO GRAB THE ROPE OR LADDER, BUT YOU MUST BE CAREFUL WITH THE JUMP AS IF YOU JUMP TOO LATE YOU WILL MISS AND COULD FALL TO YOUR DEATH.</li><li>ONCE YOU HAVE REACHED THE END OF LEVEL 8, THE GAME STARTS AGAIN BUT RETAINING YOUR SCORE.</li><li>USE JOYSTICK OR USE KEYS  Q - UP, A - DOWN, O - LEFT, P - RIGHT AND SPACE TO JUMP.</li><li>USE SHIFT-H TO PAUSE (ONCE PAUSED, ANY CONTROL INPUT WILL CONTINUE THE GAME).</li><li>USE SHIFT-F7 TO QUIT THE GAME </li></ul>\n<p>Get More Diamonds will work on a Commodore VIC20, TheC64/TheVIC20 or your favourite VIC20 emulator. A file configured and ready to play on the The C64/TheVIC20 is included in the downloads, as well as a standard PRG file and D64 image.<br/></p>\n<p><strong>NOTE: Get More Diamonds requires 35kb RAM Expansion to work. </strong>\n</p>\n<p><strong>Credits:</strong>\n</p>\n<p>Design, Programming, Graphics &amp; Sound: Derek\r\n</p>", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2022-06-06T08:40:51", "background_image": "https://media.rawg.io/media/screenshots/a3b/a3b4d6ddb2b17d32b78005342bf46927.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Reset64 Magazine"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}