{"id": 7984, "slug": "around-the-world-in-80-days-the-game-premium", "name": "Around the World in 80 Days: The Game (Premium)", "name_original": "Around the World in 80 Days: The Game (Premium)", "description": "* In Top-10 games in over 100 countries! Check out yourself why people love it! <br/>* Great Game Award: Top Match-3 Game (RealNetworks®, Inc.) <br/><br/>You only have 80 days to circumnavigate the globe. Think that sounds easy? Travel back in time to the late 19th century and get ready for spectacular adventures on land, sea and air together with the English daredevil Phileas Fogg and his loyal French servant Passepourtout. Use the unique chance to visit four continents and complete the inconceivable journey to win the fantastic 20,000 pounds wager with this outstanding puzzler inspired by the classic adventure novel of the same name written by Jules Verne. <br/><br/>*** ENJOY THESE FEATURES ***: <br/>- Adventure game with outstanding storyline, beautiful animation and challenging puzzles <br/>- Extremely addictive gameplay with 81+ levels <br/>- Careful iPhone adaptation of game levels <br/>- High-quality colorful graphics and soundtrack <br/>- Game Center Support: Achievements and Leaderboards <br/>- Marvelous adaptation of the Jules Verne Victorian travelogue <br/>- Book a trip. It will be first class! <br/><br/>More Great iPhone/iPod Touch apps from Playrix: <br/>* (NEW!) ROYAL ENVOY - Take the King&amp;#39;s challenge! <br/>* CALL OF ATLANTIS - Heed the call and save Atlantis in this award-winning puzzler! <br/>* BRICKSHOOTER EGYPT - Unravel the mysteries of ancient hieroglyphs! <br/><br/>Playrix games are available for iPad and Mac. Search App Stores for &amp;quot;Playrix&amp;quot;. <br/><br/>WANT MORE PLAYRIX FUN? <br/>Visit us at Playrix.com <br/>Follow us on Twitter.com/Playrix <br/>Find us on Facebook.com/PlayrixGames", "metacritic": null, "released": "2011-03-23", "tba": false, "updated": "2019-10-22T14:29:39", "background_image": "https://media.rawg.io/media/screenshots/417/417210bcdbd050d43efa0c796e07d376_V2xZARF.jpeg", "website": "http://www.playrix.com/games/ios/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Playrix Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["PLR Worldwide Sales"], "esrb_rating": "Everyone 10+"}