{"id": 798489, "slug": "outscripter", "name": "OUTSCRIPTER", "name_original": "OUTSCRIPTER", "description": "<p><strong>OUTSCRIPTER</strong> is a short game made in RPG Maker, where everybody lives in a metaverse called Script. You, however, had break free from the automatic way of thinking, and now lusts to be released from the Script and live in the real world again.</p>\n\r\nDefeat Bosses\r\n<p>In order to do that, you need to defeat the guardian of the layer they reside in the Script. There are five layers, each one of them guarded by the will of the consciousness that live there. You start in Happiness, going up through Love, Acceptance,  Leisure, and Money.</p>\r\n\r\nSolve Puzzles\r\n<p>You character only will have the strength to defeat them by leveling up. This is possible by solving puzzles you will encounter in each map, rewardind you with XP and unique equipments and consumables. By equiping the right ones, a boss battle otherwise difficult might be a breeze.</p>\n\r\nQuestion Yourself and The World\r\n<p>Someday, will we live like this? All of our consciousness clogged up in a digital space? The will and motivation of your character is right? Is it wrong? Does it matter? It's up to you to choose.</p>\n\r\nNote - beta 0.2:\r\n<p>If you're reading this note, it' because the game is currently in a beta version. It's being tested out and bugs are still present. Some features are included in this version to make testing easier, but will be removed in the final product. These features include:</p>\n<ul><li>Save and Load through Menu options;</li><li>Playtests (or Cheats) option.</li></ul>\n<p>This note will me erased after the launch of the finished game.</p>\n\r\nPortuguês:\r\n<strong>OUTSCRIPTER </strong>é um jogo curto feito no RPG Maker, onde todos vivem em um metaverso chamado Script. Você, no entanto, se libertou do modo automático de pensar, e agora deseja sair do Script e viver novamente no mundo real.\r\nDerrote Chefes\r\nPara fazer isso, você tem que derrotar o guardião da camada que ele reside no Script. Existem cinco camadas, cada uma delas guardada pela vontade das consciências que vivem lá. Você começa em Felicidade, subindo através de Amor, Aceitação, Lazer, e Dinheiro.\r\nSolucione Enigmas\r\nSeu personagem só terá a força para derrotá-los se subir de nível. Isso é possível resolvendo enigmas que você irá encontrar em cada mapa, o recompensando com XP e equipamentos únicos e consumíveis. Ao equipar os certos, uma batalha de chefe outrora difícil será uma brisa.\r\nQuestione você mesmo e  O Mundo\r\nAlgum dia, iremos viver assim? Todas as nossas consciências abarrotadas em um espaço virtual? A vontade e motivação do seu personagem é correta? É errada? Realmente importa? Cabe a você decidir.", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2022-06-06T10:36:13", "background_image": "https://media.rawg.io/media/screenshots/aad/aad0d7fc342248b2b5e535432c5a8464.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bluememories studio"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}