{"id": 79847, "slug": "hero-project-redemption-season", "name": "Hero Project Redemption Season", "name_original": "Hero Project Redemption Season", "description": "America's #1 reality show for heroes is back for another season! Harness your superpowers to steal the spotlight, win votes, and save your sister!<br/><br/>\"The Hero Project: Redemption Season\" is the first installment in a new series of interactive novels by Zachary Sergi set in the \"Heroes Rise\" universe. Your choices control the story. It's entirely text-based--129,000 words, without graphics or sound effects--and fueled by the vast, unstoppable power of your imagination.<br/><br/>In a contest where everyone has superpowers, your opponents can cause earthquakes and explosions, but you're an average Ani-Powered who wakes up with different animal attributes every day. Will your hawk eyes or canine claws take you far enough in the competition to satisfy the only person who can help your sister? And what happens if winning isn't enough?<br/><br/>As you advance, the decisions you make will transform viewers' ideas of what it means to be a hero. Will you fight for your own goals, or make sacrifices for the good of society? Strive for what you believe is right by following the rules, or take down the whole system with more radical methods? Would you take wealth and fame over changing the world?<br/><br/>Choose wisely. It's Redemption Season.<br/><br/>• Play as male, female, trans, or nonbinary; gay, straight, or bi.<br/>• Begin a new story in Millennia City, influenced by your actions in the \"Heroes Rise\" trilogy.<br/>• Play as a new hero, in a new season of The Hero Project!", "metacritic": null, "released": "2016-04-07", "tba": false, "updated": "2019-07-30T01:23:17", "background_image": "https://media.rawg.io/media/screenshots/115/115c4bc1efeb01b01538fa55a901e341.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Choice of Games"], "genres": ["Adventure", "RPG"], "publishers": ["Choice of Games"], "esrb_rating": "Teen"}