{"id": 798460, "slug": "galaxis-electronic", "name": "GALAXIS electronic", "name_original": "GALAXIS electronic", "description": "<p>Ravensburger game from 1980</p>\n<p>---------------------</p>\n<p>English (translator version):</p>\n<p>Installation:</p>\n<p>Windows users must install Python 3.7 or higher (see https://bodo-schoenfeld.de/installation-von-python-unter-windows-10/ ).</p>\n<p>It's important to set mark „Add Python 3.8 to PATH“ there.</p>\n<p>Reboot after installation!</p>\n<p><strong>Or start directly galaxis.exe (no Python is needed).</strong></p>\n<p>Virus warnings can only arise with the exe. This is because the py was compiled without a certificate. But this is 100% virus-free!<br/></p><p>Python3.x should already be pre-installed in Linux systems. However, possibly pip3 has to be installed afterwards (sudo apt install python3-pip).</p>\n<p>Unzip the zip and start galaxy.py in the resulting directory (Linux users have to select \"run in terminal\").</p>\n<p>Missing libraries should be installed automatically on first start.</p>\n<p>In Linux, if no \"run in terminal\" option is available or a launcher is created, run starter.sh (adjust the path).</p>\n<p>Or create launcher with command line (e.g. MATE Desktop):</p>\n<p>mate-terminal -e /home/user/galaxis.electronic/galaxis.py # Adjust the path!</p>\n<p>The terminal is only necessary for the online game!</p>\n<p>You can adjust the language in the config.ini (language = en).</p>\n<p><strong>The config.ini file and the data directory are always necessary.</strong></p>\n\n<p><strong><em>Game Instructions:</em></strong></p>\n<p><strong>Offline (1 player)</strong> starts if NO nickname is entered:</p>\n<p>There have been 4 starships lost in the galaxy.</p>\n<p>It is important to find them.</p>\n<p>Right-click on a point in the coordinate system.</p>\n<p>Searching for spaceships. Namely horizontally, vertically and diagonally.</p>\n<p>The number of detected spaceships is then displayed on this dot.</p>\n<p>Spaceships behind a spaceship are of course not recognized.</p>\n<p>Points where no spaceship can be can be marked in black with the left mouse button.</p>\n<p>Clicking on it again removes the marking.</p>\n<p>For example, with a 0 there are definitely no more spaceships to be found in all 8 directions from this point. These points can be marked in black.</p>\n<p>The game is over when all 4 spaceships have been found.</p>\n<p>PS:</p>\n<p>The high score is 9 moves. If you beat them, take a screenshot and post it here:</p>\n<p>https://www.ltspiceusers.ch/threads/ravensburger-galaxis-electronic-1980-f%C3%BC...</p>\n\n<p><strong>Online (2 players)</strong> starts when a nickname is entered (at least 3 characters):</p>\n<p>Now you have to hide your 4 spaceships (right mouse button), which your opponent has to find.</p>\n<p>After the first move you have 60 seconds to think and aim. Otherwise the opponent gets a turn.</p>\n<p>Available opponents in the network are displayed in the console, in which a chat is also running. Here you can enter messages, which will then be sent to all players present.</p>\n<p>Enter 'opponent={nickname}' to connect to an opponent (eg opponent=daniel ). Now the \"found\" sound is played to alert both players.</p>\n<p>In rare cases, the message \"Your opponent has disappeared from the network. Please restart.\" appears.</p>\n<p>This happens when your opponent unexpectedly abandoned the game.</p>\n<p>Then you have to restart the game and hide the spaceships again.</p>\n<p>Other suggestions and bug reports are welcome.</p>\n<p>Have fun</p>\n<p>Daniel</p>\n<p>Home of this game: https://www.ltspiceusers.ch/threads/galaxis-electronic-1980-von-ravensburger-pyt...</p>\n<p>----------------------------------------</p>\n<p>Original Text in deutsch:</p>\n<p>Installation:</p>\n<p>Windows-User müssen Python 3.7 oder höher installieren (siehe https://bodo-schoenfeld.de/installation-von-python-unter-windows-10/ ).</p>\n<p>Es ist wichtig, ein Häkchen bei „Add Python 3.8 to PATH“ zu setzen.</p>\n<p>Nach der Installation einen Reboot machen!</p>\n<p><strong>Oder gleich galaxis.exe starten (keine Python Installation notwendig).</strong></p>\n<p>Virenwarnungen können nur bei der exe entstehn. Das rührt davon, weil die py ohne Zertifikat compiliert wurde. Diese ist aber 100% virenfrei!<br/></p><p>In Linux Systemen sollte Python3.x bereits vorinstalliert sein. Allerdings muss da möglicherweise pip3 nachinstalliert werden ( sudo apt install python3-pip ).</p>\n<p>Zip entpacken und galaxis.py im entstandenen Verzeichnis starten (in Linux \"im Terminal ausführen\" auswählen).</p>\n<p>Fehlende Bibliotheken sollten beim Erststart automatisch installiert werden.</p>\n<p>In Linux, wenn keine Option \"im Terminal ausführen\" zur Verfügung steht oder ein Starter angelegt wird, starter.sh (den Pfad anpassen) ausführen.</p>\n<p>Oder Starter anlegen mit Befehlszeile (zBsp MATE Desktop):</p>\n<p>mate-terminal -e /home/user/galaxis.electronic/galaxis.py # Den Pfad anpassen!</p>\n<p>Das Terminal ist nur für das online Game notwendig!</p>\n<p>Die Sprache kann in der config.ini eingestellt werden (language = de).</p>\n<p><strong>Die config.ini Datei und das Verzeichnis data sind immer notwendig.</strong></p>\n\n<p><strong><em>Spiel Anleitung:</em></strong></p>\n<p><strong>Offline (1 Spieler)</strong> startet, wenn KEIN Nickname eingegeben wird:</p>\n<p>Es sind 4 Raumschiffe in der Galaxis verloren gegangen.</p>\n<p>Diese gilt es zu finden.</p>\n<p>Mit rechter Maustaste auf einen Punkt im Koordinatensystem klicken.</p>\n<p>Es wird nach Raumschiffen gesucht. Und zwar horizontal, vertikal und diagonal.</p>\n<p>Die Anzahl erkannter Raumschiffe wird dann auf diesem Punkt angezeigt.</p>\n<p>Raumschiffe hinter einem Raumschiff werden natürlich nicht erkannt.</p>\n<p>Mit der linken Maustaste können Punkte, in welchen kein Raumschiff sein kann, schwarz markiert werden.</p>\n<p>Erneuter Klick darauf entfernt die Markierung wieder.</p>\n<p>ZBsp bei einer 0 sind in allen 8 Richtungen von diesem Punkt aus sicher keine Raumschiffe mehr zufinden. Diese Punkte können schwarz markiert werden.</p>\n<p>Das Spiel ist fertig, wenn alle 4 Raumschiffe gefunden wurden.</p>\n<p>PS:</p>\n<p>Die Hi-Score ist 9 Spielzüge. Falls Du diese unterbietest, mach doch einen Screenshot davon und poste den unter:</p>\n<p>https://www.ltspiceusers.ch/threads/ravensburger-galaxis-electronic-1980-f%C3%BC...</p>\n\n<p><strong>Online (2 Spieler)</strong> startet, wenn ein Nickname eingegeben wird (mind. 3 Zeichen):</p>\n<p>Nun musst Du Deine 4 Raumschiffe verstecken (rechte Maustaste), welche Dein Gegner zufinden hat.</p>\n<p>Nach dem ersten Zug hast Du jeweils 60 Sekunden Zeit zum überlegen und anpeilen. Sonst kommt der Gegner zum Zug.</p>\n<p>Verfügbare Gegner im Netz werden in der Konsole angezeigt, in welcher auch ein Chat läuft. Hier kannst Du Nachrichten eingeben, welche dann an alle anwesenden Spieler gesendet werden.</p>\n<p>Gib 'gegner={nickname}' ein, um Dich mit einem Gegner zu verbinden (ZBsp  gegner=daniel  ). Nun wird der \"gefunden\" Sound abgespielt, um beide Spieler aufmerksam zu machen.</p>\n<p>In seltenen Fällen kann es vorkommen, dass die Meldung \"Dein Gegner ist aus dem Netzwerk verschwunden. Bitte neu starten.\" erscheint.</p>\n<p>Das geschieht, wenn dein Gegner das Spiel unvorhergesehen abgebrochen hat.</p>\n<p>Dann musst Du das Spiel neu starten und die Raumschiffe nochmal verstecken.</p>\n<p>Weitere Anregungen und Bugreports sind willkommen.</p>\n<p>Viel Spass</p>\n<p>Daniel</p>\n<p>Dieses Spiel ist hier zuhause: https://www.ltspiceusers.ch/threads/galaxis-electronic-1980-von-ravensburger-pyt...</p>", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2022-06-06T10:04:52", "background_image": "https://media.rawg.io/media/screenshots/a88/a889915d744c7b8a6a2a086457d460f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ltspicer"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}