{"id": 798416, "slug": "tears-of-adria", "name": "Tears of Adria", "name_original": "Tears of Adria", "description": "<h3>Embark on a Mystical Journey</h3><br/>Step into the enchanting realm of Tears of Adria, where old-school classic fantasy meets innovation in an RPG that immerses you in a world inhabited by orcs, dwarves, elves, and the undead, each with its own tales and rivalries. Get ready for a captivating adventure filled with secrets and surprises.<br/><br/><strong>Key Features:</strong><br/><br/><ul> <li><strong>Exploration:</strong> Uncover hidden dungeons, lost artifacts, and powerful items as you traverse a rich and mysterious world teeming with secrets.<br/> </li><li><strong>Auto Combat:</strong> Engage in fast-paced, strategic battles on a 20x20 grid, where the wrong setup will cost you the victory.<br/> </li><li><strong>Random Level Up:</strong> Experience unique character progression with randomized level-ups, abilities, and events.<br/> </li><li><strong>Multiplayer:</strong> Team up with friends for cooperative adventures, challenging free-for-alls, or intense team battles.</li></ul><br/><strong>Shape Your Own Destiny</strong><br/>Assemble your perfect party, from companions who join you in quests to henchmen who enhance your ranks. Each character boasts randomized level-ups, offering diverse skills and abilities every playthrough. With up to 80 henchmen and a select group of companions, your strategic options are limitless.<h3>Developers journey</h3>My adventures started with fantasy roleplaying game Drakar &amp; Demoner(Swedish) as the wolfman-warrior Heno when I was 7. <br/>Buying miniatures with my brother every chance we would get (not many stores had them). Staying up all night playing Moonstone on Amiga with my friends or board games such as Talisman and Hero Quest. The thrill of exploring a magical world finding great artifacts and killing monsters with friends, never left me. Even though we most often would just end up killing each other and claim the spoils.<br/>I would also spend countless time on the computer, playing games such as Kings Bounty and hotseat on Heroes of might and magic 2 with my friends, every turn taking forever but so much fun. A bit older I would enjoy games like the amazing Baldur's Gate 1 and 2. <br/><br/>I wanted to make a game that works in multiplayer with friends where all these aspects fit in. I also like the randomness and hardcore happenings from old board games that you don’t see in today’s video games. Video games today go in the opposite direction, holding people’s hands. No random level up, level/loot/skill scaling, shared loot, nothing can be op, never too hard or easy, too streamlined gameplay. I want the opposite, I want perma wounds, I want players to suffer from bad choices, I want a player to get a super good permanent power which only has a super small chance to unlock. Diablo 2’s original skill system was super broken, but it was fun to explore because of how broken it was, some skills was super bad, and some were super overpowered. It was fun! Today you find a new shiny golden sword with item power 832 instead of the one you have with power 830. I love the level up and injury tables from games such as blood bowl, where if you get lucky your character get super strong.<br/><br/>I try to add some sense of realism in this fantasy world. In today’s games the different races (Human, Elves, orcs and so on) is more of a cosmetic change. I want a big Orc with a two-handed axe to be stronger and more dangerous than a small gnome in melee combat.<br/><br/>this is where I come from when making Tears of Adria, hope you will enjoy it! See it as a board game from the old days!<br/><br/>Sincerely<br/>Fredrik", "metacritic": null, "released": "2022-06-05", "tba": false, "updated": "2023-11-17T06:05:14", "background_image": "https://media.rawg.io/media/screenshots/b8d/b8d5af87242c5e12c6b3172709cc07fb.jpg", "website": "http://www.tearsofadria.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 237, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["FredrikSwe", "Ark Island Studio"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Ark Island Studio"], "esrb_rating": null}