{"id": 798545, "slug": "still-life-project", "name": "Still Life Project", "name_original": "Still Life Project", "description": "<p>Completed as part of Unity's Creative Core Pathway. The lesson was on Shaders and Materials and the requirements was to create custom materials and shaders! For this demonstration I made a Still Life composition that featured a variety of materials.<br/></p>\n<p>From left to right:</p>\n<p>1. I lit the lemons using Unity's Universal Render Pipeline, but in different ways. <br/></p>\n<ul><li>The lemon that is closest to the viewer and is shiniest uses \"Complex Lit.\"</li><li>Middle lemon uses \"Simple Lit\"</li><li>Furthest in the back uses \"Unlit,\" so the light does not interact with it.</li></ul>\n<p>2. I show two different workflows for the bananas: Metallic vs Specular</p>\n<ul><li>The ones on the stand uses a Metallic workflow. From left to right, I decreased the metallic level , while keeping the smoothness level the same. You can see it go from a shiny green to a more subdued green.</li><li>The ones on the table uses a Specular workflow. From left to  right, I decreased the bananas' specularity. You can see it go from  being a shiny chrome to a dull green.</li></ul>\n<p>3. I  utilized base, metallic, normal, height, and occlusion mapping (provided by Unity) for the boxy stands and the blue mug.</p>\n<p>4. Regarding the plant stem, provided by Unity, I used alpha clipping to cut the mesh and make it invisible. <br/></p>\n<p>5. For the purple mug, I set a Transparent surface type, and switched the Render face to \"both.\" I also turned up the smoothness to liken its appearance to glass.</p>\n<p>6. For the shader beside the transparent mug, I used Unity's Shader Graph to combine various nodes. There are two noise layers that move over time (which creates movement), and its color, scaling, and offset can be customized. <br/></p>\n<p>In all I used 11 custom materials and 1 custom shader.  <br/></p>", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2022-06-06T11:45:08", "background_image": "https://media.rawg.io/media/screenshots/716/716ca5d7fc8eb99cc10d0c8df95b3cb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tedman Nguyen"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}