{"id": 79859, "slug": "rip-em-a-new-one", "name": "Rip ‘Em A New One", "name_original": "Rip ‘Em A New One", "description": "Command an elite squad of commandos in this action packed retro shooter game. Upgrade your devastating arsenal of weapons, recruit iconic commandos, and attack the enemy in fierce, epic battles. <br/><br/>Unlock new campaigns as you shoot your way through thrilling situation after another to save the world from the enemy’s evil plan to turn everyone into mindless, zombie like hordes. If the enemy is not stopped soon, the world as we know it will be no more. You have been chosen to lead the ultimate commando squad across the global to rescue your comrades, wipe out all of the enemy's bases, and kill everyone else you encounter!<br/><br/>Lock and load soldier, it's time to roll! <br/><br/>Still need convincing private? Checkout these features!<br/><br/>UNIQUE CAMPAIGNS<br/>Each campaign has a unique theme including deadly jungles, frozen arctic tundra, and scorching desert wastelands.<br/><br/>UNLOCK ICON COMMANDOS<br/>Recruit special commandos to add them to your squad which you can use on future missions.<br/><br/>DESTRUCTIBLE LEVELS<br/>Do you love explosions? Awesome, so do we! You can blow up all sorts of stuff on the missions. Want to see what a rocket launcher does to a palm tree or a grenade to tank? The power is in your hands, or should we say weapon?<br/><br/>TONS OF ENEMY VEHICLES TO DESTROY<br/>Tanks, sniper towers, gunboats, snowmobiles, and attack helicopters to name a few. If you can dream it, you can destroy it!<br/><br/>BIG BAD BOSSES GALORE<br/>The game is full of tough, big bad bosses including:<br/>- The Rocket Brothers who are twin brothers who both wield multishot rocket launchers!<br/>- Killer Yeti Warriors who will stop at nothing to eat you.<br/>- Giant, genetically engineered alligators - need we say more?<br/>- Corpus Natas an evil cult leader who is on a quest for immortality..<br/><br/>Good luck commando!", "metacritic": null, "released": "2018-08-30", "tba": false, "updated": "2019-10-22T14:22:54", "background_image": "https://media.rawg.io/media/screenshots/465/465de5f685ad259e348f0484b958de55.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 281, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Anarchy Enterprises"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Anarchy Enterprises"], "esrb_rating": null}