{"id": 79856, "slug": "the-sims-2-castaway-stories", "name": "The Sims 2: Castaway Stories", "name_original": "The Sims 2: Castaway Stories", "description": "The classic The Sims 2: Castaway Stories returns to the Mac, exclusively on the Mac App Store!<br/><br/>Based off of The Sims 2 engine, this updated version of The Sims Castaways Stories includes several enhancements available for the first time on Mac:<br/>• Native resolution support, including 4K and Retina!<br/>• Drastically improved performance, thanks to an all new renderer<br/>• Gesture Support for zoom and rotate<br/>• Tons of bug fixes and tweaks<br/><br/>Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters, craft unique items, and discover many useful treasures and ancient mysteries hidden deep within a diverse jungle environment filled with plants, fruits, and even wildlife. Your Sims change as they take on the challenges of island life and learn to survive in style. Create a new life for your Sims on an uncharted island in The Sims Castaway Stories.<br/><br/>Brand New Environment to Play In - Play exciting new story adventures as a castaway on a desert island who needs to survive and thrive. Create and customize your Sims and play through 24 whole new dynamic chapters. Adopt an orangutan, fight off wolves, and choose your own romantic interest, taking on an adventure that is completely your own.<br/><br/>Tell Your Own Story, Over and Over Again - Create multiple profiles and tell a new, unique story every time.<br/><br/>Two New Fun Ways to Play - all new directed Story mode and classic Free-play mode<br/><br/>• Additional information about The Sims 2: Castaway Stories • <br/><br/>If you encounter problems playing the game, please visit support.aspyr.com. Our Customer Support team is happy and eager to help. Your feedback helps us make better games. <br/><br/>In order to run the game with satisfactory performance, your Mac must meet these minimum system requirements: 2.2 GHz CPU Speed | 4 GB RAM | 10 GB free disk space | (ATI): Radeon HD 3870; (NVidia): GeForce 8800 | (Intel): HD 3000 | 256 MB VRam <br/><br/><br/>NOTICE: The following video chipsets are unsupported for The Sims 2: Castaway Stories: <br/><br/>•ATI RADEON HD 2600 and older<br/>•NVIDIA 8600m, 9400 and older<br/>•Intel Integrated GMA 950 <br/>•Intel Integrated x3100 <br/><br/>NOTICE: This game is not supported on volumes formatted as Mac OS Extended (CaseSensitive) <br/><br/>", "metacritic": null, "released": "2015-12-10", "tba": false, "updated": "2024-02-09T20:16:02", "background_image": "https://media.rawg.io/media/screenshots/551/5513b93780d4a9bbf8a426bd4ddeb861.jpg", "website": "http://aspyr.com/games/the-sims-2-castaway-stories?utm_source=MacApp&utm_medium=ProductLink&utm_campaign=the-sims-2-castaway-stories", "rating": 3.86, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 6, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 250, "game_series_count": 0, "reviews_count": 7, "platforms": ["macOS"], "developers": ["Aspyr Media"], "genres": ["RPG", "Simulation"], "publishers": ["Aspyr"], "esrb_rating": "Teen"}