{"id": 798598, "slug": "dimming-worlds-kevin-ng", "name": "Dimming Worlds (Kevin Ng)", "name_original": "Dimming Worlds (Kevin Ng)", "description": "<p>The player controls two characters Light and Dark, Light and Dark exist in two separate worlds that due to an Artefact has started to affect each other, whatever Light does in their world can affect Dark’s world, and vice versa. However Dark is not very smart and can only destroy obstacles in Light's way, Light on the other hand can move obstacles like boxes to help dark reach higher places in his world, both Light and Dark must destroy the Artefact which is causing the two worlds to collide.</p>\n\n<p> <strong>Game Instructions</strong>\n</p>\n<p>           You control two different characters on the screen, Light and Dark.</p>\n<p>           Light can move boxes horizontally while interacting them and activate Levers</p>\n<p>           Dark can break barriers blocking a path and activate pressure plates.\r\n</p>\n<p>           \r\n</p>\n<p><strong>Movement</strong>\n</p>\n<p>Left Arrow Key ← to move selected character left\r\n</p>\n<p>Right Arrow Key → to move selected character right\r\n</p>\n<p>Spacebar to Jump\r\n</p>\n<p><strong>Interactions</strong>\n</p>\n<p>E Key to Interacts with objects (Only Light can interact)\r\n</p>\n<p>Left Click on character to switch to them.\r\n</p>\n<p><strong>Game Mechanics</strong>\n</p>\n<p><strong><em>Boxes</em></strong> : Boxes can be dragged around by Light, they can be used to either get to higher places or activate Pressure Plates.\r\n</p>\n<p><strong><em>Barriers </em></strong>: Barriers can only be broken with Dark, to break the barrier just run into them with Dark.\r\n</p>\n<p><strong><em>The Artefact </em></strong>: The main objective, you need to run into it with either Light or Dark to destroy it and continue onto the next level.\r\n</p>\n<p><strong><em>Levers</em></strong> : Levers are switches that can only be activated by Light, they open gates. \r\n</p>\n<p><strong><em>Gates </em></strong>: Gates are an obstacle that can only be opened by either activating a Lever or having a Pressure Plate be activated.\r\n</p>\n<p><strong><em>Pressure Plates </em></strong>: Pressure Plates can be activated by either having a box over the Pressure Plate or having Dark stand over a Pressure Plate. </p>\n<p><strong><em>Dark Energy </em></strong>: Used by Dark to destroy multiple barriers, Dark always starts with one Dark Energy to use.</p>", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2022-06-06T12:43:15", "background_image": "https://media.rawg.io/media/screenshots/2fe/2fe43480d18157fbd21e182d2b025e61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Kevin Ng"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}