{"id": 79858, "slug": "stunt-moto-traffic-rider-2017", "name": "Stunt Moto Traffic Rider 2017", "name_original": "Stunt Moto Traffic Rider 2017", "description": "Racing Moto Traffic Rider is one of the popular thrilling and exciting racing game which is free to play. Take moto racing skills with this traffic rider game to boost your driving skills. Earn stars to race new levels and complete achievements to get awesome 3D bikes for free to ride. Racing Moto Traffic Rider 2016 take you to the high level of motorcycle riding with best 3d racing game environments. .<br/><br/>The essence of smooth arcade racing game is still there but in the shell of the next generation. Racing Moto Traffic Rider 2016 your bike in the endless highway racer, desert racing, mountains bike riding, roads overtaking the traffic. Collect pictures and videos of your crashes. Customize your bike rider and motorcycle to give them your style!Now it is time to hit the roads with a motorcycle!<br/><br/>REAL HD GRAPHICS<br/><br/>Completely designed as three dimensional, Racing Moto Traffic Rider 2016: player was developed in order to provide you a realistic racing experience.<br/><br/>REALISTIC WEATHER <br/>Get ready to race in Snowy, Highway, Desert, Mountains and Foggy conditions.<br/><br/>Racing Moto Traffic Rider Features<br/>- Traffic Rider encompass Amazing 3D graphics for Bike racers.<br/>- Realistic Moto racing driving <br/>- Three different weather conditions: Snowy, Rainy, Foggy weather   <br/>   conditions <br/>- Realistic traffic systems <br/>- Manually adjust the Graphics level according to choice. <br/>- Night and day moto driving with excellent locations.<br/>- Real motorcycle/motocross bike sounds<br/>- Set Motor bike settings according to choice.<br/>- Stunning 3D graphics with high quality environment.<br/>- Moto Racer gives you realistic environment to play the game.<br/>- Beautifully designed environment with attractive features.<br/>- Ride the bike endlessly on the highway.<br/>-Timers, Fuels Just pure endless fun!<br/><br/>Play on single player to improve your SKILLS.<br/>FUN guaranteed with motorcycle riding skills.<br/>Simple and INTUITIVE controls to ride the bike.<br/><br/>Racing Moto Traffic Rider 2016 is new racing game and we need your feedback in the form of reviews to improve the game.", "metacritic": null, "released": "2016-03-11", "tba": false, "updated": "2019-10-22T14:31:09", "background_image": "https://media.rawg.io/media/screenshots/11b/11bcb90a0d7593cffbd27cef6cc3304f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["jolta technology"], "esrb_rating": "Everyone 10+"}