{"id": 798647, "slug": "steel-love-damians-gambit", "name": "Steel Love - Damian's Gambit", "name_original": "Steel Love - Damian's Gambit", "description": "<p>Take control of Trik and help Damian restore Gigantimus and avert the apocalypse. Also smack a lot of stuff with your tail in the process!<br/></p>\n<p>This game is far from complete, but there is a small story chain as well as a few combat areas to tackle and multiple enemy types. So a bit of content to explore and interact with if you're interested. I've included a menu with debug functions too so that you can unlock the whole map, all enemy enounters, spawn random weapons, make yourself invulnerable and more!</p>\n<p><strong>Controls<br/></strong>Camera - Mouse<br/>Movement - WASD<br/>Attack / Dodge/ Talk - Spacebar<br/>Pickup item / Swap Item - Shift<br/>First Person View - F (buggy - not really intended for more than looking around)<br/>Pause / Settings Menu / Status Screen / Debug Features - ESC</p>\n<p><strong>Gameplay Tips</strong><br/>Line up enemies to knock them into each other and cause chain damage. <br/>Knocking an enemy into another stops their special attacks.<br/>You're invulnerable to ground wave damage while performing your attack.<br/></p>\n\n<p><strong>Installation</strong><br/>It's a zipped Unity executable.</p>\n\n<p><strong>How Development Evolved + Things that didn't make it<br/></strong>The original plan was pretty different. The game was going to be a very small NPC hub area featuring an elevator built into Gigantimus' spine that would take Trik to various levels of 2D Zelda style dungeons with a fixed camera view. Getting the level elements ready in time was starting to look impossible so I decided to expand parts of the hub world to become combat areas instead.<br/></p>\n<p>A lot of the enemy designs were created and tested for a 2D Zelda perspective and didn't end up translating quite as well to a more open world 3rd person design. Poor pink robot never got it's special ability, which was going to be causing nearby robots to temporarily become invincible and cause damage if struck. This was just a bit too painful in this format. The red robot was going to be able to carry weapons but weapons themselves never got fully implemented.<br/></p>\n<p>Grabbing stuff with your tail was also meant to be a much more critical gameplay feature. Zelda'esque style puzzles with grabbable fuses and batteries to power lasers, elevators, doors, pits, fans, etc. Along with many more low durability weapons scattered around with a variety of special abilities and stats.</p>\n\n<p><strong>Changelog</strong><br/></p>\n<p>v095 - Finally fully fixed the pathing issue. Enemies weren't adjusting their stopping distance properly based on their current state so certain enemy types were getting stuck when wandering. Likely wouldn't be noticed by most people but it was driving me nuts as I thought it was a collider conflict.<br/><br/>v094 - Removed some debug settings I forgot to turn off and fixed some of the debug menu features that weren't always working as intended.<br/><br/>v093 - Fixed an enemy pathing issue due to a mis-baked navmesh and a few typos.<br/><br/>v092 - Fixed a couple dialogue bugs that were preventing progress. Added a skip to the intro sequence.<br/><br/>v091 - Fixed some minor cursor lock issues on menues and the game over screen.<br/><br/><br/></p>", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2022-06-06T13:51:23", "background_image": "https://media.rawg.io/media/screenshots/930/9309394cfda0b4c794c629e179b4ed09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pixel_drake"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}