{"id": 7986, "slug": "dungeons-of-evilibrium-rpg-card-battle-role-playin", "name": "Dungeons of Evilibrium (RPG) – Card Battle Role-playing Game", "name_original": "Dungeons of Evilibrium (RPG) – Card Battle Role-playing Game", "description": "NEW EVENT – ANGELS VS DEMONS!<br/>Download #1 BEST FREE RPG and see why THOUSANDS of people enjoy this game all over the world! (Heavy.com)<br/><br/>Dungeons of Evilibrium is a card battle RPG with tactical elements of TCG strategies and the dungeon crawling exploration of roguelike games. Collect and evolve characters, build and enhance your army deck, beat other players and seize dungeon treasures! The whole world’s fate depends upon your choices and skills! <br/><br/>==FEATURES== <br/>• FREE TO PLAY <br/>• BATTLE in adventures and PvP <br/>• CUSTOMIZE your army deck to gain a strategic edge <br/>• OBTAIN rare artifacts and EVOLVE your heroes <br/>• JOURNEY through the vast world and events <br/>• GET new characters and dungeons in free updates <br/><br/>Build and enhance your deck, explore mysterious dungeons, earn powerful treasures, fight the creatures of darkness, compete with other adventurers; and always remember – in order to defeat the forces of Evil you have to play by their rules! <br/><br/>================================= <br/>Dear players! In case you have encountered any problems, please contact us at evilibrium@orcwork.com. This is the only way for us to respond to your problem and solve it! We really want you to enjoy our game!", "metacritic": null, "released": "2014-03-20", "tba": false, "updated": "2019-10-22T14:29:39", "background_image": "https://media.rawg.io/media/screenshots/536/536dff20695971a3a6f647af61c68a19.jpeg", "website": "http://evil-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zillion Whales"], "genres": ["Adventure", "Card"], "publishers": ["Zillion Whales"], "esrb_rating": null}