{"id": 798746, "slug": "stardust-butterfly", "name": "Stardust Butterfly", "name_original": "Stardust Butterfly", "description": "<p>Two years after the events of <em>Silicon Soul</em>, in a nearby solar system, a ragtag crew of bounty hunters struggle to survive in their trusty starflyer, the Shoegazer. Led by the amnesiac Sumiv Warring, the trio warps across the solar system chasing after the past. Sumiv believes that locating a giant robot will awaken her lost memories. Gloz, the last surviving Grazaloid, searches to find another survivor of her kind. And not much is known about Jebbrey Ocean, a mysterious, possibly insane, but helpful one-armed cyborg. What adventures are in store for these three? Find out in Stardust Butterfly, the board game continuation of the <em>Steel Love</em> series!</p>\n<p>In this 3-player action drafting game, players compete to have the biggest reputation. Hunt down targets and achieve your personal goals to earn points, but since you’re all part of the same crew, helping and hindering one another is not optional. Not to mention the Events that cause even more chaos among the crew…\r\n</p>\n<p>This is a submission to the Steel Love Game Jam (Robot Party Jam 2022).<br/>Character: Sumiv Warring<br/>Cool New Ability: Forager Goggles</p>\n<p>While this has been designed as a board game, there are a few ways to play digitally. MeBID created the digital version that automates a lot of the rules and math and features six endings that expand on the story! The pcio version can be used to easily  play with friends online. The print-and-play version will be released sometime after the jam.</p>\n<p>Credits:\r\n<br/>\r\nZoql - Game design, art, story<br/>MeBID - Programming and development<br/>BIG-FR0G - Ending artwork<br/>Ly - Art<br/>rust dogg - Playtesting</p>", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2022-06-06T14:50:50", "background_image": "https://media.rawg.io/media/screenshots/4a0/4a083e2afa7b733e7f16bc0696a3eab1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zoql", "MeBID"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}