{"id": 798775, "slug": "the-forest-of-candles-and-the-man-with-a-lighter", "name": "The Forest of Candles (And The Man With A Lighter)", "name_original": "The Forest of Candles (And The Man With A Lighter)", "description": "<p><em>The forest never forgives, and neither do I.</em></p>\n<p>The Forest of Candles (And The Man With A Lighter) follows Maggie, a young woman with a fear of forest fires sparked by an old town folk tale. She's spent years trying to escape her hometown and the fear it inspires in her, only to be called back for the funeral of an old friend. As she looks into the mysterious death, she finds all is not as it seems - not her friend's death, not the folk tale, not even her long-time boyfriend. </p>\n<p>This is a narrative-heavy, text-based dramatic horror game developed in Twine. It does have dialogue branches and two different endings, but the majority of the story is fairly linear. Often, it reads like a short story. It's about 12,000 words in total.</p>\n<p>If you find any bugs in this game, please let me know! I'll be fixing any I find and uploading new files.</p>\n<p>If you'd like to read this game's trigger warnings before purchasing it, please click here (spoilers beware)! This game works best in Google Chrome, although I have not tried running it in Safari.</p>\n<p>25% of every payment from this game will go to TreePeople, an LA based charity dedicated to planting trees and restoring ecosystems damaged by wildfires in Southern California. If you can't afford a $2 donation, please let me know and I'd be happy to send you a copy.</p>\n<p><strong>Credits:</strong></p>\n<p>Cover art by Jenna Yow</p>\n<p>Beta testing by Anna W. and Sam</p>\n<p>Coding help by Scott and GC Baccaris</p>\n<p>Moral support by all of these wonderful people and all of my friends who had to listen to me scream about this game for almost a year &lt;3</p>", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2022-06-06T15:05:06", "background_image": "https://media.rawg.io/media/screenshots/aa1/aa17821e6c6e09aa14eab7e1c48aedda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Nessa Cannon"], "genres": [], "publishers": [], "esrb_rating": null}