{"id": 798730, "slug": "manitas-kitchen", "name": "Manitas Kitchen", "name_original": "Manitas Kitchen", "description": "<strong>Manitas Kitchen</strong> is a cooking game in which you play as Trexito, a Tyrannosaurus with a dream to fulfil: make  <strong>P I Z Z A S</strong>, but their short little hands are making it hard.<br/><br/>Bring together a group of dinosaurs with extraordinary skills to make up the best kitchen brigade the world has ever seen. All under the supervision of a very rude and very tiny boss<br/><br/><br/><br/>Dough, ingredients, oven... wait, don't forget the sauce! All together to make the perfect pizzas and deliver up on time through the more modern and cool delivery tube a cave has even seen!<br/><br/>Last, but not least: <strong>BEWARE THE DINO-SQUAD!</strong> <br/>Trexito will be helped by a group of skilled, smart and dangerous dinos! Meet Freckles \"The Dough Expert\", Marsh \"The Oven Master\" and Collini \"The Sauce Guy\"<br/><br/><h3>Features of 'Manitas Kitchen':</h3><br/><ul><li> Pizza-gression: make delicious pizzas from the start and unlock new recipes by buying ingredients!<br/></li><li> Crime Drama Narrative: Alpadino hides something in the restaurant's basement and Trexito is starting to suspect… will be you the one that exposes Alpa's secret?<br/></li><li> Mental State Management: help Trexito to manage his stress-levels in order to have a good chef performance. Although, be careful and don't over-stress Trexie or else they will close earlier!<br/></li><li> Dino-Squad Ultimates: each dino (except from 'The Boss') has a specialty that, in-game, is reflected through their chore mechanics, which ranges from a flamethrower to bake the pizzas to smashing dough with their tale!</li></ul><h3>And Don’t Forget Your Pizza!</h3>", "metacritic": null, "released": "2022-06-04", "tba": false, "updated": "2023-12-18T07:10:21", "background_image": "https://media.rawg.io/media/screenshots/120/1208985e1479273e8892019b16d8c4c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ali", "Dre Otero", "Xiera - Knight of the Heart", "Trexito", "laracabido", "darl", "TobuRisu", "marcybenper", "Little Arrow Games"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Entalto Publishing"], "esrb_rating": null}