{"id": 79876, "slug": "boat-sim", "name": "Boat Sim", "name_original": "Boat Sim", "description": "Blast around in a cool speed boat, go sailing in a fishing boat or be the skipper of a large car ferry!<br/><br/>Boat Sim is a boat simulation you can enjoy anytime!<br/><br/>Enjoy a scenic bay in a virtual speed boat, alongside fishing boats, sailing and other motor boats with lots of scenery and various docks and cities to visit, or take out your fishing boat at night, or try your hand at driving a car ferry between multiple docks!<br/><br/>By design there's no objectives, no score to get, simply relax and enjoy your speed boat, fishing boat and now car ferry.<br/><br/>Enjoy simulated boating!<br/><br/>Listen to music and sail as long as you want!<br/><br/>So what are you waiting for? Jump on-board your virtual boats today and enjoy the scenery as you’re cruising around!<br/><br/>Reviews around the world ! (thank-you)<br/><br/>\"I love the feeling of being out on the water in a boat, it's so relaxing\" - USA<br/><br/>\"Sweeeeet!!!!!!! Love the detail!\" - USA<br/><br/>\"I've wanted this game for years and this is the best\" - Australia<br/><br/>\"...its a great simulator, Iam looking forward to the upcoming updates. I love the concept with no missions or timelimits, very relaxing :)\" - Denmark<br/><br/>\"What a great simulator! There is no purpose if not the freedom to navigate your boat in this picturesque bay. What a great hobby! The driving model is really realistic. Recommended to all!\" - Italy<br/><br/>\"...for ship lovers a must\" - Netherlands<br/><br/>\"It's the best feeling to have your favorite songs playing in the background, as you drive your boat to wherever. Tranquility at it's finest.\" - USA<br/><br/>Own your own boats today!<br/><br/>In the next update we're focusing on improving the graphics and adding more docks, so stay tuned it'll be available shortly.<br/><br/>For suggestions or support, please contact support@boatsims.com.", "metacritic": null, "released": "2013-08-03", "tba": false, "updated": "2019-07-30T01:24:00", "background_image": "https://media.rawg.io/media/screenshots/b09/b09164c28e3bc749ab1f56bca0d7da70.jpg", "website": "http://www.boatsims.com/apps/boat-sim/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gary Chambers"], "genres": ["Simulation"], "publishers": ["Gary Chambers"], "esrb_rating": null}