{"id": 79888, "slug": "meter-maid-city", "name": "Meter Maid City!", "name_original": "Meter Maid City!", "description": "From the creators of the hit game Airport Scanner comes Meter Maid City! - a super fun, super addictive Arcade style Sim Game!<br/><br/>Step into the exciting world of parking enforcement in Meter Maid City! Hunt down and ticket illegally parked cars and earn cash to upgrade parking scooters and build your city!<br/><br/>Features:<br/><br/>• Three Fun Game Modes – Go on patrol, work a shift or beat challenges. <br/><br/>• Fun HD retro style graphics.<br/><br/>• Enhance and upgrade your scooters!  Tons of fun powerups and items to equip your scooter with.<br/><br/>• Build out your City to create an ever-changing game experience.<br/><br/>• Complete a variety of fun challenges including races and missions.<br/><br/>Haven’t you wondered what it’d be like to be a Meter Maid?<br/><br/>Sign up for duty as a Junior Parking Officer! Zip through traffic on your souped-<br/>up scooter while enforcing ridiculously strict parking laws. Ticket and tow illegally parked cars with ruthless impunity and earn mountains of cash to fuel the development of your City. Use all the dirty tricks in the book to get the job done! <br/><br/>Get help from coworkers like Bert the tow-truck driver and your mentor, Old Betty. <br/><br/>Show those cocky traffic cops that you don't need a badge and a gun to make people follow the rules!<br/><br/>But watch out! The crooked mobster Sly Slawinski has a vendetta against you and has corrupted the ordinary citizens of Sleepydale, creating a legion of parking offenders who won't pay their parking tickets unless you catch them in the act. <br/><br/>Track ‘em, slap ‘em with a parking boot so they can't escape and Burt will tow ‘em off the streets – and you cash in on the reward!<br/><br/>Another game you can’t put down from the creators of the #1 smash hit game Airport Scanner!<br/><br/>We’ve had lots of questions about why an Internet connection is required. <br/>Meter Maid City! has a really cool feature built in that lets you play on multiple devices and syncs your progress automatically. We also have some awesome plans for multiplayer gameplay that will also require connectivity to the Internet! Stay tuned!<br/><br/>Please note that Meter Maid City! is free to play, but you are able to purchase game items with real money. If you don’t want to use this feature, please disable in-app purchases. <br/><br/>Your use of this application is governed by the End User License Agreement available at https://www.metermaidcity.com/terms-and-privacy/. Collection and use of your data are subject to the Privacy Policy available at https://www.metermaidcity.com/terms-and-privacy/.", "metacritic": null, "released": "2014-10-23", "tba": false, "updated": "2019-07-30T03:03:44", "background_image": "https://media.rawg.io/media/screenshots/31b/31bf54f9cc0eebf13c69a3ba8f4fbecf.jpg", "website": "http://www.metermaidcity.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kedlin Company"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Kedlin Company"], "esrb_rating": null}