{"id": 79882, "slug": "desert-sniper-war-action", "name": "Desert Sniper War Action", "name_original": "Desert Sniper War Action", "description": "CHECK YOUR SHOOTING SKILLS!!! your shooting power on running enemy vehicles, eliminate enemy squad troops, helicopter, tanks and war machines with your weapon firepower. Get Desert sniper war action in your iPhone's &amp; iPad's.<br/>Do you have the sniper skills to destroy the tanks &amp; military jeeps on highway?<br/><br/> Desert Sniper War Action gives you the opportunity to kill the armed vehicles on highway using your sniper weapon. This will give you a moving sniper skill to increase your fire rate.<br/>Hold your breath and fire your weapon to destroy as much traffic armed vehicles as you can.<br/><br/>Enjoy the #1 most modern first person sniper shooter game in the real desert environment.<br/><br/>Stunning Features:<br/> - Realistic FPS (First Person Shooting) game<br/> - Easy and smooth realistic controls (Tap to shoot)<br/> - Engaging and Stunning 3d graphics<br/> -  Modern accurate Sniper Rifle<br/> - Variety of traffic vehicles to destroy<br/> - Highly addictive game play<br/> - Challenging multiple missions<br/> - Choose your best battle truck sim with various engine and weapons<br/> - Amazing 3d truck driver sim experience with smooth controls and real physics<br/> -  Superb Desert Mountain with amazing action pack animation<br/> - Realistic simulation with very engaging background music to enhance your game play", "metacritic": null, "released": "2016-02-20", "tba": false, "updated": "2019-10-22T14:34:32", "background_image": "https://media.rawg.io/media/screenshots/320/320eec3f3ff2af1342a5130b3991f88c_EwtUMlZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jolta Technology"], "genres": ["Action", "Arcade"], "publishers": ["jolta technology"], "esrb_rating": "Teen"}