{"id": 798853, "slug": "robocat-2", "name": "RoboCat", "name_original": "RoboCat", "description": "RoboCat\r\n<p>Join RoboCat, an advanced robotic cat tasked with exploring through the streets of a futuristic city and locating missing cats to return to their loving homes. After an unfortunate accident, RoboCat’s mechanical body is left broken, and they are relieved of their duties; but even this won't stop RoboCat. Assist RoboCat in platforming through different sections of the city  all the while locating the remaining missing cats in need of help, and uncovering new mechanical parts to repair RoboCat’s broken body. As you slowly repair RoboCat’s functionalities, they regain their old abilities, including a propeller tail to reach further heights and a set of strong claws to cling to walls and jump off of them, which will help them in reaching new locations to save cats in need. Clear all three unique levels of the game - the junk yard, the park, and then finally the downtown city - in order to repair RoboCat back to their former glory!\r\n</p>\n\r\nThe RoboCat Development Team:\r\n<p><strong>Elizabeth Arnold </strong>- Sprite Artist, Sprite Animator, Cutscene Director, Lead Story Writer, Game Programmer</p>\n<p><strong>Ryan Hueckel</strong> -  Lead Game Programmer, Sound Effects Designer</p>\n<p><strong>Ziyang Li</strong>  - Background Artist<br/></p>\n<p><strong>Autumn Plaxco</strong>  - Game Programmer, Level Designer, Music Composer, Dialogue Writer</p>", "metacritic": null, "released": "2022-06-03", "tba": false, "updated": "2022-06-06T15:38:03", "background_image": "https://media.rawg.io/media/screenshots/62c/62ccdf0252acd7f2232b53d299f5bb04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rhueckel", "aplaxco", "VulonDev", "ziyangLi0923"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}