{"id": 798955, "slug": "chess-warriors", "name": "Chess Warriors", "name_original": "Chess Warriors", "description": "<p><strong>NEW unique game that unites Chess Features, RPG &amp; Seamless Map, where battles occur in real-time. Become a part of AG world!</strong>\n</p>\n<ul><li>Chess figures &amp;  movements involved,\r\n</li><li>RPG features,\r\n</li><li>Fast expansion in PvP seamless map,\r\n</li><li>Long-term Tower Defence.\r\n</li><li>Strategic adrenaline action over several areas - all at once!\r\n</li></ul>\n<p><strong>Commonly, Armygrid is played on a 2.5D mode. Worth to mention that this game also offers a 2D option for weaker devices and phones.</strong>\n</p>\n<p>\n</p>\n<p>You will start the game having only this figure. It moves just by a single square step by step. It might feel tiresome, to move quite slowly, but don't worry ! Shortly,  you will unlock the next chess figure - <strong>Bishop</strong>!\r\n</p>\n<p>\n</p>\n<p>\n</p>\n<p><strong>Bishops</strong> can move pretty far, you just need to upgrade them. Also, in this game Bishop has classic movements combined with <strong>Pawn</strong> ones, so you are able to switch the lane when needed.\r\n</p>\n<p><strong>And the list doesn't end here -</strong> keep in mind that by progressing you will discover all of the chess figures. \r\n</p>\n<p>\n</p>\n<p>Right after the quick tutorial completion, you will be dragged into a huge zone -<strong> Maze</strong>. It's a <strong>PvE zone</strong>, safe from PvP &amp;  floats just like the main progression zone where you will \"grind\" a.k.a keep attacking NPCs and level up your King.\r\n</p>\n<p><em><strong>P.S. </strong>Your chess figures will be automatically upgraded while progressing - you won't have to do it manually.</em>\n</p>\n<p>\n</p>\n<p><strong>So.....</strong>  You will need to wipe this whole area - burn down every wall, tower, &amp; conquer every square field. This way you can increase your <strong>Gold Income</strong>, <strong>Level up</strong> &amp; find <strong>R</strong><strong>are Items</strong> to equip with. Also, you will get various quests on the fly. \r\n</p>\n<p>And after this stage is completed, you will be introduced to another one - <strong>a stronger one.</strong> In the meanwhile, the old Maze zone is replaced with a new unique zone where you can continue farming.\r\n</p>\n<p> \r\n</p>\n<p><strong>As you reach level 12, you will have an access to the PvP zone</strong>. It won't take long - promise! \r\n</p>\n<p><em>P.S. That's doable in ~30 minutes from the game start (10 mins for hardcore players).</em> \r\n</p>\n<p>\n</p>\n<p>What you see here - is a freshly launched server and the first 9 players who reached level 12 &amp; accessed the PvP zone. \r\n</p>\n<ul><li>It's a seamless zone where players can<strong> attack neighbors</strong>, <strong>loot gold</strong>, <strong>conquer enemy castles</strong> &amp; <strong>fight in real-time.</strong>\n</li><li>Deploy Chess pieces to attack enemies, build up Towers and Walls to protect your area, and conquer Fields and Totems for a higher stats bonus. \r\n</li><li>Here is actually the best fun action of this game! \r\n</li></ul>\n<p>\n</p>\n<p><strong>\n</strong>\n</p>\n<p><strong>ALLIANCES </strong>- are so powerful! Players can research many different bonuses which apply to all ally members. Also, members can deploy troops in the PvP zone from allied castles and help fellow warriors to defend against enemies even if they are offline! You can communicate with your allies through chat.\r\n</p>\n<p><strong>\n</strong>\n</p>\n<p><strong>MORE AREAS</strong>. I could continue here with the next areas - Cave and Crusade, but it's gonna be more exciting to discover them by yourself. Remember, each area has its own unique features. For example, in the <strong>Maze area </strong>- all figures can burn down everything, while in the <strong>PvP zone</strong> - only Pawns can burn down. And in <strong>Cave</strong> - nothing can be burned down.\r\n</p>\n<p>\n</p>\n<ul><li>Servers restart every 9 weeks - basically, they get wiped off. \r\n</li><li>All players who sustain the first 5 weeks will participate in the final Apocalypse event, which lasts for 4 weeks. \r\n</li><li>The whole server, all together, will work on surviving as long as possible, to get cross-server rewards - Skill Points. \r\n</li><li>The longer you survive - the better rewards. \r\n</li><li>The more players are demolished by NPC, the stronger attack will come the next day. Players are using their most powerful abilities to stop the enemy before it get's split towards all event participants.\r\n</li></ul>\n<p>This game is long term and you will be awarded with <strong>Skill Points</strong>, which persist forever between servers. You will also be able to <strong>sell</strong> your collected Skill Points or <strong>buy</strong> from the others.</p>\n\n\n<p>\n</p>\n<p>ARMYGRID.COM<br/></p>", "metacritic": null, "released": "2022-06-03", "tba": false, "updated": "2022-06-06T16:23:29", "background_image": "https://media.rawg.io/media/screenshots/78a/78abfdb5fd84b349a31938b7b9255479.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ChessWarriors"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}