{"id": 79901, "slug": "mildly-interesting-rts", "name": "Mildly Interesting RTS", "name_original": "Mildly Interesting RTS", "description": "Mildly Interesting RTS (MIRTS) is a touch-based real time strategy game that is mildly interesting. Emphasizes planning over APM.<br/><br/>- Built with love by an indie game developer.<br/>- No loot boxes.<br/>- No ads. Ever.<br/>- No energy bars, coins, or other scummy nickel-and-dime IAP.<br/>- No crippled gameplay.<br/>- One, single, solitary IAP that unlocks all of the Veteran Content (forever and ever).<br/><br/>What people are saying about MIRTS:<br/><br/>\"This doesn't mean he can't do smarter and bigger things, just that a port of A Dark Room is not that, and neither were his other descriptions of projects he did in the meantime (for example, look at the screenshots for Mildly Interesting RTS).\" - Jonathan Blow, creator of Braid and The Witness<br/><br/>\"This RTS is indeed, mildly interesting.\" - A random person<br/><br/>\"I was able to play my friend over wifi, during lunch, one-handed. My other hand was holding a delicious sammich.\" - RTS enthusiast<br/><br/>\"My significant other beat me. How is this possible?\" - Former diamond league Starcraft player<br/><br/>\"This old guy played against me and he won, but my APM was so high. How did he do that?\" - Angsty teen who is inexperienced at RTS's <br/><br/>\"I don't get this game. What is an APM?\" - Someone who doesn't play RTS's and probably shouldn't have downloaded MIRTS <br/><br/>\"The description of this game is probably better than the game itself. But I'll download it anyways.\" - Pessimistic viewer<br/><br/>\"Meh.\" - Hobby game developer<br/><br/>\"Wait, are you just quoting anyone that reaches out to you?\" - Photographer<br/><br/>\"I love bamboo.\" - A panda bear", "metacritic": null, "released": "2017-02-13", "tba": false, "updated": "2019-07-30T01:26:47", "background_image": "https://media.rawg.io/media/screenshots/a3d/a3de1d2cacef6858698fc2710adec0c6.jpg", "website": "http://amirrajan.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Amirali Rajan"], "genres": ["Strategy", "Simulation"], "publishers": ["Amirali Rajan"], "esrb_rating": null}