{"id": 799191, "slug": "zivs-redemption-part-1", "name": "Ziv's Redemption: Part 1", "name_original": "Ziv's Redemption: Part 1", "description": "<p><em>Actual Description Below This</em><br/></p>\n<p>\"The Classic Franchise Returns!</p>\n<p>Based on the world renowned young adult novel franchise \"Steel Love\", whose run ended in 2004, Ziv's Redemption shows the deep world through new eyes. Explore the underbelly of Envocron, and find out what really happened to Ziv, and how he returned!</p>\n<p>Accolades:</p>\n<p>\"Why did they bring back a novel series as a game? I don't want to have to play some shooting computer game just to review a book series!\" - Famous Book Reviewer (who declined to be credited)</p>\n<p>\"Way too short\" - Important Games Website</p>\n<p>\"Too ... much ... brother drama\" - Kyle Bosman, at some point\"</p>\n<p>Actual Description:</p>\n<p>This is  my submission for the Robot Party Game Jam 2022 https://itch.io/jam/robot-party-jam-2022 . To run, extract and run game.exe from the zip. Following the premise of a game reviving a wildly popular young adult novel series that abruptly ended after a universally hated twist, the game follows one of the characters, Ziv, through a narrative-drive on rails shoot 'em up. Entirely built, from scratch, in C++ and OpenGL, the game features a unique blend of 2D \"sprite\" and 3D meshes to create a rapid moving, pixel-art heavy, shooter filled with visual depth.<br/></p>\n\n<p>The game is intended to be played only on Windows (Tested only with Windows 10) and using keyboard and mouse.</p>\n<p> More information on credits in the included readme file. The game does not currently contain any sound. Please be sure to run the game in a 16:9 aspect ratio, ultra-widescreen will not play properly.</p>", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2022-06-06T18:11:32", "background_image": "https://media.rawg.io/media/screenshots/f49/f49d32f4461d68247aef60baa2a372f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bcagan"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}