{"id": 79918, "slug": "little-boy-waynes-train", "name": "Little Boy - Wayne's Train", "name_original": "Little Boy - Wayne's Train", "description": "\"A good set of extra activities related to story. The option to record your own narration. Multiple language versions included in the price. Ease of use. No distracting elements.\" (AppySmart)<br/><br/>\"A series of beautiful stories for children to delve into a world familiar, reassuring and colorful. Kids may ask for more! Fortunately, they have choice.\" (ViPad.fr)<br/><br/>*******************<br/><br/>Based on the well-known collection of books \"Little Boy\" (over 500,000 books sold each year), the application \"Wayne's train\" features a fun, interactive story, giving kids a chance to find out in a playful way what it's like to be a train driver.<br/><br/>Train ready for departure! Wayne is taking you for a ride aboard his nice steam train. Look for the sounds and interactive animations on the screen, then record your own voice instead of that of the narrator. Give your answers to the quiz and play with the jigsaw puzzles and the coloring books. And finally, why don't you take a picture of yourself with Wayne's train!<br/><br/>\"Wayne's train\" is a story where your child can identify with the hero and let his imagination wander.<br/><br/>• Interactive story for preschoolers<br/>• Record your own voice!<br/>• Snap yourself in the train!<br/>• Quiz about Wayne's story<br/>• 5 jigsaw puzzles, 3 levels<br/>• 5 coloring books<br/>• Read or listen in English or French to learn languages the funny way!", "metacritic": null, "released": "2015-08-04", "tba": false, "updated": "2019-10-22T14:22:55", "background_image": "https://media.rawg.io/media/screenshots/d06/d064b0a13fc686a2e6f4bb8611a16b5b.jpg", "website": "http://www.humongous.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Humongous Entertainment"], "genres": ["Family"], "publishers": ["Tommo"], "esrb_rating": "Everyone 10+"}