{"id": 799189, "slug": "tribunal-reload-gamejam-edition", "name": "Tribunal (reload gamejam edition)", "name_original": "Tribunal (reload gamejam edition)", "description": "<p>Tribunal is a retro fps made in the free version of easy fps editor for the reload magazine game jam.</p>\n\n<p><strong>Story:</strong></p>\n<p>Many years ago, the rapture occurred, and when God looked down upon the earth to decide who would be saved, they realized that all of humanity was irredeemable. Anguished with such knowledge, God died of a broken heart and fell to the earth. With their creator dead, the angels of heaven went mad and waged a war on earth as they slowly go insane and are corrupted into horrific displays of unholy flesh and blood. You play as Elliot, an veteran soldier trying to survive in the apocalypse one day at a time when one morning, you receive a distress signal originating from a bunker from a nearby city asking for help. You know that cities are often filled with monsters and you know that this could possibly be a trap, but you also know that this signal could be legit. armed with your knife and a few rounds in your six-shooter, you head towards the city hoping to save someone.</p>\n\n<p><strong>Gameplay:</strong></p>\n<p>gameplay involves you traversing through various parts of the city fighting off various monsters as you find more weapons and survive in the city.</p>\n<p>(note this gamejam/demo of the game is much less cooler than the description entitles)</p>\n\n<p><strong>Controls:</strong></p>\n<p>WASD - move forward, backward, left and right</p>\n<p>Mouse - look around</p>\n<p>Left Click - shoot</p>\n<p>E - interact</p>\n<p>Space - jump</p>\n<p>F - flashlight</p>\n\n<p>Credits:</p>\n<p>Game was made using the free version of Easy FPS editor - https://jessicochan.itch.io/easy-fps-editor-lite</p>\n<p>Art - Jack D</p>\n<p>Game Design - Jack D and Undev</p>\n<p>Level Design - Jack D</p>\n<p>Sound Design - Jack D and Ragnar Random</p><p>Various Help - Ragnar Random</p>", "metacritic": null, "released": "2022-05-31", "tba": false, "updated": "2022-06-06T18:10:29", "background_image": "https://media.rawg.io/media/screenshots/7db/7dbe5d4dcac8d724fae8b379fac131c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boneguy"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}