{"id": 799297, "slug": "kotiro", "name": "Kotiro", "name_original": "Kotiro", "description": "<strong>Kotiro is an adult game in the Souls-like genre.</strong><h3>Story</h3><br/><br/>The earth has been obliterated by evil. To save the human race, a brave fighter has established a system to boost the power of humans through a power selection system.<br/><br/>Each boy born can take a chance to contribute his genetic heritage. To this end, he must defeat the Guardians stopping him on his way of reproduction. These girls are trained from a young age to become formidable opponents. They are in control of the territory assigned to them.<br/><br/>So, to be worthy of an offspring, you will have to defeat the Guardians. Don't be fooled by appearances; these girls won't hesitate to kill you if you don't prove yourself worthy of their power.<br/><br/>Be brave and glorious or be miserable and wiped out - it's up to you.<h3>Features</h3><br/><br/><ul><li>A Dark and Post-Apocalyptic Universe<br/></li><li>Progression through character improvement<br/></li><li>Simple gameplay<br/></li><li>Interesting Guardians<br/></li><li>A world with a lore to discover<br/></li><li>Thrilling boss fights<br/></li><li>Quests to guide you<br/></li><li>Intimate scenes with the Guardians</li></ul><h3>Informations</h3><br/><br/>Kotiro is divided into several territories. Each territory is different, with specific monsters, different locations, a Guardian as well as quests and gameplay elements etc...<br/><br/>This version includes only one part to present the game with only one territory and one Guardian. The game is under development. The final release should take some time and will require a fee.", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-10T03:46:25", "background_image": "https://media.rawg.io/media/screenshots/258/2586067d66ed0d3189ad31397d47ad39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Primal Bone"], "genres": ["Action", "Indie"], "publishers": ["Primal Bone"], "esrb_rating": null}