{"id": 799299, "slug": "aim-god", "name": "Aim God", "name_original": "Aim God", "description": "Shooting simulator designed to help FPS players maximize their reflexes and aim. <br/>Join our community on discord, where you can connect with other players and show off your best score. Please keep in mind that this is not the final version of the game. The content will be updated over time also according to your feedback.<h3>Game aspects</h3>The game contains many different modes, the mechanics of which push the player for better results. You can choose from modes with static and moving objects, but also with AI objects that will try to dodge your shot at all costs. Before starting the round, you can choose the degree of Precision difficulty, which adjusts the size of the objects.<br/><br/>During the round, the health of your character is added or taken away, depending on whether you hit the object. The more objects you hit in a row, the bigger the combo will be and you will get more points for hitting the object.<br/><br/>After completing the round, you will see all the statistics you achieved during the round. For example, shooting accuracy, average reaction time, fastest and slowest reaction time, number of kills per second, and more. <br/><br/>In the settings, you can set everything exactly according to your ideas, from graphic settings, through sound settings, to mouse sensitivity settings, weapon visibility, cursor size and color changes, and more. <br/><br/>All your best statistics are listed in the Leaderboards section. This way you can compete with other players, break their records and get to the top of the rankings.", "metacritic": null, "released": "2022-06-06", "tba": false, "updated": "2022-06-10T03:49:04", "background_image": "https://media.rawg.io/media/screenshots/e6c/e6c1c308412f40285553ce2c7b3435be.jpg", "website": "https://aimgod.netlify.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sumo Studio"], "genres": ["Action"], "publishers": ["Sumo Studio"], "esrb_rating": null}