{"id": 799267, "slug": "aliens-dark-descent", "name": "Aliens: Dark Descent", "name_original": "Aliens: Dark Descent", "description": "<p>In Aliens: Dark Descent, command a squad of hardened Colonial Marines to stop a terrifying Xenomorph outbreak on Moon Lethe. Lead your soldiers in real-time combat against iconic Xenomorphs, rogue operatives from the insatiable Weyland-Yutani Corporation, and a host of horrifying creatures new to the Alien franchise.</p>\n<p>You are the commander. They are your weapon.</p>\n<p>Infiltrate large open levels and annihilate enemies with your squad, dispatching orders strategically and intuitively at the touch of a button. Tread carefully, as your foes will adapt their tactics to your actions while hunting you down because death is permanent. Forge unique paths for survival, uncovering shortcuts, creating safe zones, and setting up motion trackers in a persistent world where your actions impact levels forever.</p>\n<p>Customize your squad with a selection of different classes. Level up and specialize your soldiers with unique abilities and an arsenal of weapons, armor, and perks, for high stakes missions in treacherous territory. Develop your base to research new tech and improve your squad even further.</p>\n<p>Manage your resources wisely and take calculated risks to outsmart the deadliest creature mankind has ever faced. Can you and your squad stop the outbreak before it’s too late?</p>\n<p>• Face off in a gripping original Alien story against iconic Xenomorph creatures ranging from Facehuggers to Praetorians, Alien Queens and many more, including rogue human commandos and a brand-new threat unique to this Alien storyline<br />\n• Lead strategically and change squad tactics from mission to mission, carefully managing your soldiers’ health, resources, and sanity, to avoid permanent team losses and mental breakdowns<br />\n• Forge unique paths for survival in a persistent world, uncovering shortcuts, creating safe zones and setting up motion trackers to stay one step ahead of these creatures<br />\n• Assemble and level up squads composed of 5 starting Marines classes, with dozens of specializations, unique abilities and weapons.</p>", "metacritic": null, "released": "2023-06-19", "tba": false, "updated": "2024-03-28T17:37:39", "background_image": "https://media.rawg.io/media/games/826/8260752e19cc614a56a0a682f050e548.jpg", "website": "https://www.focus-entmt.com/games/aliens-dark-descent", "rating": 4.17, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 35, "beaten": 16, "toplay": 60, "dropped": 9, "playing": 3}, "playtime": 5, "achievements_count": 53, "ratings_count": 16, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 18, "platforms": ["Xbox Series S/X", "PC", "PlayStation 5", "PlayStation 4", "Xbox One"], "developers": ["Tindalos Interactive"], "genres": ["Action", "Strategy"], "publishers": ["Focus Entertainment"], "esrb_rating": null}