{"id": 799272, "slug": "american-arcadia", "name": "American Arcadia", "name_original": "American Arcadia", "description": "<p>Escape from a televised utopia in Out of the Blue’s brand new puzzle-platformer game.</p>\n<p>Welcome to Arcadia! A 70’s retro-futuristic metropolis where all its citizens enjoy a life of luxury and comfort… unaware that they’re being broadcast live 24/7! Arcadia is not an ordinary city, but the most watched reality show on the planet - where a drop in popularity ratings comes at the highest cost: death.</p>\n<p>Uncover the truth and escape with your life in ‘American Arcadia’!</p>\n<p>ESCAPE FROM A 70&#39;S TELEVISED UTOPIA<br />\nThe gripping story will be presented as a documentary with interviews and police interrogations of the characters as you progress through the game.</p>\n<p>TWO EXPERIENCES, ONE GAME<br />\nAmerican Arcadia gives you control over two characters in completely different environments and unique playstyles: A 2.5D action side-scroller including challenging platform action, breath-taking chases, stealth and puzzles. As well as a full 3D first-person game, with hacking, exploration, stealth elements, and puzzles to solve.</p>\n<p>IMPRESSIVE VOICE OVERS<br />\nYuri Lowenthal (Spider-Man 1 &amp; 2, Prince of Persia The Sands of Time, Call of the Sea), Krizia Bajos (Cyberpunk 2077, League of Legends) and Cissy Jones (Firewatch, Life is Strange, Call of the Sea), among others, breathe life into the characters in American Arcadia.</p>", "metacritic": null, "released": "2023-11-15", "tba": false, "updated": "2024-04-19T21:02:57", "background_image": "https://media.rawg.io/media/games/2fa/2fa47aee51dd1b7a53e40cbf8bea66b1.jpg", "website": "https://americanarcadiagame.com", "rating": 4.15, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 7, "beaten": 15, "toplay": 47, "dropped": 3, "playing": 1}, "playtime": 1, "achievements_count": 14, "ratings_count": 12, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["Out of the Blue", "Out of the Blue Games"], "genres": ["Adventure", "Indie"], "publishers": ["Raw Fury"], "esrb_rating": null}