{"id": 799325, "slug": "cazzarion-demon-hunting", "name": "Cazzarion: Demon Hunting", "name_original": "Cazzarion: Demon Hunting", "description": "Mysterious incidents were reported in abandoned locations. The Gate of Hell has been opened and demons are troubling here. Ram Ganger, special agent of WOM, arrive to send the brood of evil back to hell.<br/>\r\nYou landed in the middle of the Demons Apocalypse, try to stay alive as long as possible.<br/>\r\nThe good news: You don't have to crawl into hell to fight the demons, the demons come to you in places such as the Chateau, Palace, Pandora, Laketown, abandoned castles, etc. The usual dark caves and tombs are of course also present.<br/>\r\nThe bad news: You can't win, you'll die.<br/>\r\nDeath is certain for you. You cannot win in this game, the game will beat you. This game is like life, it ends with death.<br/>\r\nDon't look for the demons, the demons will search and find you. Search for weapons and ammunition to stay alive as long as possible. Use the weapons properly: Strong weapons for strong demons, flamethrowers for flying demons, etc.<br/>\r\nMove through the map and collect ammunition, extra lives and weapons.<br/>\r\nYou start with a limited number of lives and ammunition. Ammunition and extra lives are spawned after some time. With every minute you survive, the game becomes more difficult, every minute more demons attack you and you find less ammunition and extra life every minute. Once all your lives are exhausted, the battle for survival is over for you.<br/>\r\nYou can win an Ingame award on each map: Bronze if you survive 10 minutes, silver if you survive 20 minutes. The best of the best win gold after 30 minutes.<br/>\r\nREMARK: The awards are only Ingame, no steam archievements are available.<br/>\n<br/>\r\nPros:<br/>\r\n- 10 Maps<br/>\r\n- Sexy vampire women who kill you<br/>\r\n- Zombie granny on Ecstasy<br/>\r\n- Tranfeminine, lesbian werepig<br/>\r\n- Funny splatter, dismemberments and physics effects<br/>\r\n- Special weapons for exorcising demons:<br/>\r\n        Multi Rocket launcher and Flamethrower<br/>\r\n        Boomshot for short distance splatter and dismemberment. The Reaper do this job on the long distance<br/>\r\n- Demons of Color: Green lizards and green weresnakes. Blue-grey weresharks and multicoloured insectoids, rose werepigs, brown werewolves and flesh colored, naked vampires. Reddish-brown fire-breathing dragons. Grey decayed zombie Grandmothers with pitchfork. Lava colored exploding devils.<br/>\r\n- No lengthy tutorials necessary: ​​choose your weapon and start shooting (\"Roarrr....BOOM\")<br/>\r\n- An average of 15 kills per minute<br/>\r\n- 21:9 Screen support<br/>\r\n- DRM free<br/>\n<br/>\r\nCons:<br/>\r\n- No \"Heroes of Color\" no \"Female/Diversity Heros\"<br/>\r\n- The hero is a toxic white old man<br/>\r\n- No keyboard remapping<br/>\r\n- No brightness adjustment<br/>\r\n- No FOV slider<br/>\r\n- No Windowed mode<br/>\r\n- No Steam archievements<br/>\r\n- No mouse sensitivy adjustment<br/>\r\n- Exploding, small, suicide lava devils that annoy you (this devils are a disease!)<br/>\n<br/>\r\nWho is the game suitable for:<br/>\r\n- For people who don't have time to waste in any tutorials and weapon lessons/instructions<br/>\r\n- For people who just want to shoot down demons/monsters (\"Groarrr.....BOOOOOM\")<br/>\r\n- For people who like to shoot around with \"Boom-Splatter\" weapons<br/>\r\n- For people who can do without a story<br/>\r\n- For people who like shooting games<br/>\n<br/>\r\nWho is the game NOT suitable for:<br/>\r\n- For people who want to play \"Heroes of Color\" and \"Female/Diversity Heros\".<br/>\r\n- For people who don't want to play a toxic white old man as a hero<br/>\r\n- For people who can't see blood<br/>\r\n- For people who are afraid of the dark and easily startled<br/>\r\n- For people who don't like shooting games<br/>\n<br/>\r\nIMPORTANT REMARKS: <br/>\r\n- Only Xbox Controller and Xbox compatible Controller are supported !!<br/>\r\n- For the Menue the Mouse is required<br/>\r\n- If you wish to use the Xbox Controller you need to enable \"USE GAMECONTROLLER\" in the SETTINGS/CONTROLS Menue<br/>\r\n- \"REVERSE Y-AXIS\" in the SETTINGS/CONTROLS Menue is used for Mouse and Game Controller", "metacritic": null, "released": "2022-06-09", "tba": false, "updated": "2022-06-10T04:21:42", "background_image": "https://media.rawg.io/media/screenshots/326/326da9f78da6ed4a5ed903f2205976b3.jpg", "website": "https://www.cazzarion.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 572, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zarpazo"], "genres": ["Action"], "publishers": ["Zarpazo"], "esrb_rating": null}