{"id": 799334, "slug": "the-backrooms-mass-extinction", "name": "The Backrooms: Mass Extinction", "name_original": "The Backrooms: Mass Extinction", "description": "This game can be played with or without a VR headset!<br/><br/>If you're not careful and you noclip out of reality in the wrong areas, you'll end up in the Backrooms. The old moist carpet, the mono-yellow rooms and the hum-buzz of the fluorescent lights will be your only comfort in the endless purgatory you have found yourself in. Don't bother crying out for help. Nobody is coming. Nobody is left.<br/><br/><strong>Level 0 (The Lobby)</strong><br/>Level 0 is the first level of the Backrooms.<br/>Level 0 is a non-linear space, resembling the backrooms of a retail outlet. It is a collection of infinite randomly segmented rooms, hallways, and staircases. The wallpaper is a mono-yellow, the carpet is damp, and the ceiling is decorated with office lights. Some walls have electrical outlets, security cameras, or mold growing on them.<br/>The installed lighting flickers inconsistently and hums at a constant frequency.<br/>While most areas of Level 0 are lit with a mono-yellow light, some areas are in total darkness. Other areas have dimmer than usual lights and some areas even have colorful lighting. <br/><br/>The Backrooms: Mass Extinction is a game created by Mitchell Hepburn using Unreal Engine 4. It is currently in early access and will receive updates and new content as the game develops. In the current build, you can:<br/>•     Explore Level 0, a maze of non-Euclidean rooms stretching infinitely in all directions.<br/>•     Use your trusty torch to light areas shrouded in darkness.<br/>•     Search for the Manila room, which can be found behind a wall you can noclip through.<br/><br/>In the upcoming build, the following updates have been made:<br/>•     Level 0 will be three times bigger than the previous build, with all new locations and easter-eggs to find!<br/>•     A demo of the Poolrooms level will be discoverable within Level 0.<br/>•     Level 0.2, also known as 'Remodeled Mess' will be discoverable within Level 0.<br/>•     You'll be able to seamlessly switch between regular and VR play modes.<br/>•     You will now be able to find books around the map, containing lore and details about the world.<br/>•     There will be ladders that the player can climb and doors for players to open.", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-10T04:34:23", "background_image": "https://media.rawg.io/media/screenshots/408/408757c5b3b9dfdb72f9c17d26779fe8.jpg", "website": "https://cheropiebusiness.wixsite.com/thebackrooms", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mitchell Hepburn"], "genres": ["Adventure", "RPG"], "publishers": ["Mitchell Hepburn"], "esrb_rating": null}