{"id": 799346, "slug": "sinister-night", "name": "Sinister Night", "name_original": "Sinister Night", "description": "Inspired by John Carpenter's The Thing, Sinister Night perfectly fuses social deduction with the psychological horror brought by paranoia and mistrust. To take part in a horror reality show, a group of streamers arrived at a haunted church school site. During their visit, some of them were possessed by demonic spirits. As the crimson dream descends upon them with shrieks of terror, one of the streamers falls to the ground bleeding to death. What kind of spirits is hiding in their human form? Those souls who meet their tragic ends in this school readily tell you of the place's mysterious past.<br/><br/>Sinister Night is a game of screams and deception. Don't jump the gun to trust anyone since there are two evil spirits in disguise among those eight players. Either find the offerings to stop the wicked ritual or banish the nearby spirits to prevent yourself from being served as their \"last supper.\"<br/><br/><h3>Who Has Been Possessed?</h3>Confusion and suspicion will arise among you and your companions. Use every means possible—items, tasks, location information, and frequent communication—to identify potential culprits and prove them guilty. Find those disguised evil spirits and banish them!<h3>Immersive Psychological Horror</h3>Supernatural phenomena and the spirits of those who died tragically at the school are not the terrifying entities here. When suspicions and doubt spread throughout the group, no one knows whom to trust. It’s hard to avoid killing one another under the pressures of paranoia<br/><br/><br/><h3>A Variety of Strategies</h3>Will you use the holy cross to ward off the evil spirit, or would you use crystal balls to find clues? Can you trust the person with the baseball bat? The evil spirits could possess anyone.<h3>A Thrilling Banquet of Slaughter</h3>Unleash the evil inside your heart, drag everyone into the crimson dream and murder them while they scream in terror. In addition, use your acting skills to clear yourself from others' suspicion, shift the blame on others and create chaos while hiding within the group.", "metacritic": null, "released": "2022-06-08", "tba": false, "updated": "2022-06-10T04:50:06", "background_image": "https://media.rawg.io/media/screenshots/744/7449ae1452aa316621d3543460a04a25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 0, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zstar"], "genres": ["Action", "Adventure"], "publishers": ["zstar"], "esrb_rating": null}