{"id": 799314, "slug": "second-thoughts-2", "name": "Second Thoughts", "name_original": "Second Thoughts", "description": "<h3>Second Thoughts</h3> A short, psychological experiment where each day you are tasked with executing someone based on the limited information provided until one person remains with their full story revealed.<br/><br/><br/>You will be required to evaluate data on eight different subjects. Each day you will select one of these subjects to be executed using the data provided to make your decision. For each time an execution is performed you will be provided additional information about every subject. <strong>Including those you have already killed.</strong><br/><br/>If you so wish you can read this new information despite the subject being already dead.<br/>Or you can pretend it does not exist and focus on those who are still alive.<br/>By the end of the week the surviving subject will be allowed to go free.<br/><strong>It is said that knowledge is power.<br/>We will find out if this statement is true.</strong><br/><br/><br/><br/><h3>This is what you will experience:</h3><br/><ul><li>Eight diverse subjects each with their own hidden stories to be uncovered.<br/></li><li>Choices that matter as only one of the subjects will get to go free by the end.<br/></li><li>Seven days made up of each choice you make to execute one of the subjects.<br/></li><li>An observation room to check how many subjects remain and their states.<br/></li><li>Permanent decisions as once you choose to kill someone, it cannot be undone.<br/></li><li>Simple to understand menus and controls so anyone can partake in the experiment.</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-10T04:06:20", "background_image": "https://media.rawg.io/media/screenshots/207/2078fcad22ccf19e4e7443c52772b091.jpg", "website": "https://gestmorphgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Gestmorph Games"], "genres": ["Casual", "Indie"], "publishers": ["Gestmorph Games"], "esrb_rating": null}