{"id": 799302, "slug": "arcade-flight", "name": "Arcade Flight", "name_original": "Arcade Flight", "description": "You're controlling a plane that is going forward in an infinite and randomized space filled with barriers. Use your reflexes to dodge the incoming barriers in high speed. Collect coins along the way to later spend them in the store section.<br/>\n<br/>\r\nIn the store section you can:<br/>\r\n- Unlock 7 different planes.<br/>\r\n- Unlock and upgrade 4 different gameplay mechanics.<br/>\n<br/>\r\nThose gameplay mechanics are:<br/>\r\n- Barrier Void Bomb: When you unlock this, bombs will spawn randomly in the map. Collecting these bombs will destroy every barrier around you within a range. You can upgrade the Barrier Void Bomb to increase the range.<br/>\r\n- Anti Collider Mode: When you unlock this, collectable items will spawn randomly in the map. Collecting these items will enable you to fly through barriers for a time. You can upgrade the Anti Collider Mode to increase the time.<br/>\r\n- Theme Changer: When you unlock this, collectable items will spawn randomly in the map. Collecting these items will change the current color theme of the map and will give the game a different look.<br/>\r\n- Negative Matter Missile: When you unlock this, you will be able to launch missiles from your plane. These missiles flies forward and destroys the first barrier they collide with. You can upgrade the Negative Matter Missile to increase the range.<br/>\n<br/>\r\nThere are also some in-game achievements. You can see your progress in these achievements and when you complete an achievement you will be awarded with coins.", "metacritic": null, "released": "2022-06-06", "tba": false, "updated": "2022-06-10T03:53:39", "background_image": "https://media.rawg.io/media/screenshots/d9f/d9f1b07f8c9c9cf5773295a309de1ed1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AHMET ALP"], "genres": ["Indie"], "publishers": ["AHMET ALP"], "esrb_rating": null}