{"id": 799352, "slug": "jian-yu-tao-hua-the-sword-and-peachblossom", "name": "剑与桃花 the sword and peachblossom", "name_original": "剑与桃花 the sword and peachblossom", "description": "<h3>The game is introduced</h3>This is a country strange theme of short visual novel.<br/>The game tell the story of the protagonist, who is about to graduate from university, returned to his long-lost hometown and returned to his cousin. Later, the hero is in danger in the mountain-forest. Take this opportunity to explore the myths and legends of the village spread for a long time, learned the story of “the sword and peach-blossom”, but also opened the past that led to his childhood away from home. In the investigation, the distance between the hero and his cousin is also getting closer, and they finally put the past behind them and move forward towards a new future.<h3>How to play the game more cheaply?</h3>The game  is discounted during the initial sale and subsequent sales. If you want to save money, put it on your wish list and wait for a sale before you buy it.<h3>Producer remarks</h3>This is the first visual fiction game made by Wind Chime Hall, and due to the lack of experience and technology, there may be some bugs and unsatisfactory aspects.<br/>If you find this game unsatisfactory , feel free to speak up.<br/>We readily accept any reasonable criticism and negative comments, and should strive to do so.<br/>We are going to take some ideas and suggestions from that game and try to make it a great game for everyone.<h3>Other</h3>The game has part of the text of classical Chinese.<br/>This game is purely fictional and has nothing to do with real history.<br/>If you don’t like the game, you can post a bad review in the comments section and submit a refund request to Steam customer service . If you like the game it has realized its valve. We hope to hear from you favorably comments, if it is convenient for you.", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-06-10T04:59:08", "background_image": "https://media.rawg.io/media/screenshots/426/426489d6900c9b57f1d8786498ba7bde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["風鈴堂"], "genres": ["RPG", "Casual", "Indie"], "publishers": ["風鈴堂"], "esrb_rating": null}