{"id": 799364, "slug": "estrus-princess", "name": "Estrus Princess", "name_original": "Estrus Princess", "description": "<p>It&#39;s time for the princess to go to town and search for a potential groom.<br />\n<em>Recommended.<br />\nYou can relax and play because there is no battle.<br />\nFor those who like cute illustrations and hentai illustrations.<br />\nThose who want to immerse themselves in a relaxing and peaceful world.<br />\nIt creates a cheerful atmosphere that has not been seen in previous sexual games.<br />\n</em>Exploration and conversation<br />\nThere are various people in the town. Visit unique people and ask them about their problems and requests.<br />\nWhen you solve the problem, you can move on to the next step. Sometimes you may end up in a naughty situation.<br />\nInteracting with the people of the town is important to the story.<br />\n<em>Hints for the next step<br />\nYou will not get lost because you will automatically get a note to help you know what to do next.<br />\nProvides a comfortable playing experience.<br />\n</em>Features<br />\nAlthough it is in the form of an RPG, it can be easily compared to a novel game where you move around in a map.<br />\nThe main focus is on conversation and releasing sexual scenes.<br />\nEventually, you will find your son-in-law. This is a game to enjoy the process of becoming a princess.<br />\n<em>Sexual Events<br />\nThere are a total of 10 types of events.<br />\nYou will proceed to the event scene by having conversations and receiving requests.<br />\n</em>Graphic Art<br />\nIllustrations and dots are originals created by the producer from the beginning.<br />\n<em>10 basic CG pictures (total 72 pictures including differences and standing pictures)<br />\n</em>Manual, strategy, and high-resolution illustrations used are included in the game folder.</p>", "metacritic": null, "released": "2022-06-09", "tba": false, "updated": "2022-06-10T14:05:56", "background_image": "https://media.rawg.io/media/games/d56/d5672e1bb00fd9cc50877f013503188d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Uzura Studio"], "genres": ["RPG"], "publishers": ["Uzura Studio"], "esrb_rating": null}