{"id": 799358, "slug": "futanari-sex-the-gym", "name": "Futanari Sex - The Gym", "name_original": "Futanari Sex - The Gym", "description": "<p>About the game<br />\nAn explicit erotic visual novel following the story of a sexy futanari personal trainer taking the training of her sweet and oldest friend to another level…<br />\nVisual Novel Description<br />\nIt’s Friday evening, and Juliet Jones had an excruciating long day at work.<br />\nHer new gym – “ JULIE’S FLEX APPEAL ” is getting more crowded with each passing day. Clients are happy, business is booming…her biggest dream is finally coming to life.<br />\nThe days are getting longer, and they keep adding up, so the last thing she wants at the end of a full week is to train another client.<br />\nBut this is Daisy Walker – not only the girl who pushed Juliet into getting that loan and opening her dream gym, but also the one who pushed every single one of her buttons before she disappeared from the face of the Earth.<br />\nThe hot futanari trainer was left behind sick with lust, and heartbroken.<br />\nAfter years of absence, Daisy called at the gym and asked for Juliet to train her, no matter the cost.<br />\nThat gives Juliet the perfect opportunity to get back at her.<br />\nNAKED training, or NO training – This is the only offer Juliet is willing to make.<br />\nWill Daisy agree to Juliet’s terms and take her training to the next level?<br />\nFollow the story and find out…</p>", "metacritic": null, "released": "2022-06-09", "tba": false, "updated": "2022-12-22T10:26:37", "background_image": "https://media.rawg.io/media/games/fa9/fa98879d65c91b4c69ab976f11ac0f6e.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EroticGamesClub"], "genres": ["Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}