{"id": 799331, "slug": "pixelshire", "name": "Pixelshire", "name_original": "Pixelshire", "description": "<ul><li>Develop the perfect town and farm of your dreams with terraforming features that allow you to carve and craft the landscape.<br/></li><li>Build and decorate your own unique house.<br/></li><li>Your town will grow with each citizen you encounter along the way.<br/></li><li>Each villager has his own house that you must place and design. </li></ul><br/><br/><ul><li>Build your farm, plant, and grow crops and raise livestock.<br/></li><li>Choose from a variety of trades. Farming, mining, woodcutting, fishing, cooking, brewing, and more are all waiting to be mastered!<br/></li><li>Manage your shop and sell valuable items you find in your adventures, or goods that you produce.</li></ul><br/><br/><br/><ul><li>A whole continent ready to be explored, full of new adventures and hidden treasures.<br/></li><li>Travel and fight your way through enchanted forests, mountain jungles, and many more.<br/></li><li>Discover procedurally generated islands that shift each time you enter the magical mist.<br/></li><li>Mine for ore as you descend into randomly generated dungeons.</li></ul><br/><br/><ul><li>Become part of Pixelshire’s community and make friends with the inhabitants, each with their own personality. You may even find romance!<br/></li><li>Improve relationships with the townsfolk by helping them with daily jobs and learn new skills from them.<br/></li><li>Invite townsfolk with unique skills to assist you in quests and adventures, tagging along as you head out into the world.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-10T04:30:19", "background_image": "https://media.rawg.io/media/screenshots/39a/39aa21db905330191ed027773bb170f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "toplay": 6}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kappa Bits"], "genres": ["Adventure", "Indie"], "publishers": ["Merge Games"], "esrb_rating": null}