{"id": 799581, "slug": "shleepy-stories-nighty-night", "name": "Shleepy Stories: Nighty Night", "name_original": "Shleepy Stories: Nighty Night", "description": "<p><strong><br/>Shleepy Stories</strong> is a unique helper for parents to relax their little young before bed and bring a new item to the kid's bedtime routine with some educational elements. The game <strong>helps reduce kids' activity</strong> in the evening. It's also a good way for parents and children to spend the evening together before getting ready for bed. <strong>This is a good alternative to watching cartoons on YouTube or Netflix before bedtime.</strong></p>\n\n<p>It's a cozy and aesthetic interactive game for kids from 2 y.o with simple gameplay.<strong> It helps children to form a bedtime ritual, educates and learn more new things.</strong> The ritual is formed due to the fact that the main task of the player is to put all the animals of the Magical Forest to sleep, fill the Jar of Dreams and then go to bed himself.</p>\n<p><strong>Our game:</strong></p>\n<ul><li>Motivates the child to go to sleep with pleasure\r\n</li><li>Helps children relax and soothe before bed\r\n</li><li>Helps parents and children spend quality time together\r\n</li><li><strong><em>Has educational elements that help improve a child's cognitive development</em></strong>\n</li><li>Is safe for kids. It has parental control and AD-free\r\n</li><li>Is made in soft yellow colors with a sleepy atmosphere\r\n</li><li>Contains  high-quality soothing music and relaxing sounds created by our sound designer\r\n</li><li>Contains illustrations created by professional artists of children's books\r\n</li><li>Is <em>free</em> and available on iOS, Android, macOS platforms\r\n</li></ul>\n\n<p><strong>What</strong> <strong>children learn from playing Shleepy Stories:</strong></p>\n<ul><li>The game helps kids to try <em>game-based learning</em> before kindergarten and preschool programs\r\n</li><li>Children learn the names of new animals and objects\r\n</li><li>The child learns sounds coming from different objects and animals. Kids form a strong relationship between the sound and a familiar image\r\n</li><li>The child acquires a bedtime routine, forming a new ritual of preparing for sleep in the form of our game\r\n</li></ul>\n<p><strong>We will also add more educational features to the game in the future: </strong></p>\n<ul><li>An opportunity to teach a child in a playful format to perform small household chores\r\n</li><li>Interacting with various objects in the animals' homes so that the child understands how these things function and what they are for\r\n</li><li>The child will learn even more new animals when we add new characters to the game\r\n</li></ul>\n<p>You can read more about them <em>below</em> in the section <strong>Roadmap.</strong><br/></p>\n\n<p>As soon as a kid opens the game, he immediately finds himself in the Magical Forest, and a pleasant female voice tells him who lives here and what needs to be done. Then you get to a meadow with animal houses.</p>\n<p>To complete the game little one needs to fill the Jar of Dreams.  Filling the jar is simple — just make all the animals of the Magical Forest fall asleep by turning off the lights in their houses. Choose any house, click on it and you will get inside. In the house, the kid will find the animal and some lights to turn off. Turn off the light, and the animal will go to bed on its own. <br/></p>\r\nEvery time one of the beasts falls asleep, the Jar of Dreams fills up\r\n<p>When all the animals are already asleep, you get into your house and you need to fill the Jar of Dreams with the last dream - yours. Blow out the candles, so finally, the light goes out, and the jar is filled to the end. Now it's the player's turn to go to bed.</p>\n\n<p><strong>Check out the gameplay:</strong></p>\n\n\n\n<p><strong>All animals are drawn with love and skill</strong> <strong>by professional</strong> <strong>kids' books illustrators. Each character has its characteristics and hobbies.</strong></p>\n\n\n\n<p> We have already created 8 locations. The Magical Forest, 6 characters' houses, and the final scene at the end of the game. </p>\n\n<p> All the houses are located on one large meadow, so it is convenient for little children to play - a kid can click on any house and get into it.  No extra moves.</p>\n\n<p>We thought carefully about every detail of the forest and the location of the houses. For example, the owls’ house is in the hollow of a tree, like in real life. Two times a year the seasons in the game change corresponding to the real seasons in life. <strong>It also helps children learn new things about the world around them. </strong></p>\n\n<p>All animal houses are different:\r\n</p>\n<p>1. There are small houses, two-story tree houses, burrows, and lairs. \r\n</p>\n<p>2. Each home is decorated according to the animals' personalities and hobbies.\r\n</p>\n<p><strong>Such precision in creating houses increases the learning process during play: a kid learns which houses are inhabited by different animals and the names of new objects. In the future, we want to make it possible to interact with objects inside houses.</strong>\n</p>\n\n<p>The lights in all houses are turned off, so the kid finds himself in his own house in the Magical Forest. Candles are burning on the windowsill, but they are quickly blown out. <em>It is time for the player to refill the Jar of Dreams with the very last dream - his!</em>\n</p>\n<p>All the lights went out, the jar was filled, and the off-screen voice offers the child to go to bed, wishes him good night, and <em><strong>offers to help the animals tomorrow</strong></em>. <strong>Such a call helps the child develop a new ritual before bedtime. In this way, the kid knows that he has to put his virtual animals to bed every night before he goes to bed himself. This is a healthy alternative to watching cartoons on YouTube or Netflix before bedtime.</strong></p>\n<p><strong>In</strong> <strong>the</strong> <strong>future, your little</strong> <strong>one will be able to click on any book on the shelf and a bedtime story will begin to play. There will be a new bedtime story every day.</strong></p>\n\n\n<p><strong>Merch</strong></p>\n<p>You can order the merchandise of Shleepy Stories — digital printable coloring book made special for you.</p>\n<p>Example:<br/></p>\n\n\n\n<p>Or you can order also a T-shirt with Shleepy Stories' characters:</p>\n\n<p>Wee can deliver all over the world.</p>\n\n<p>Our game has several key features that make Shleepy Stories stand out from other mobile bedtime stories:</p>\n\n\n<p>The game is created with the inclusion of the whole team. The illustrators draw all that is needed, then hand it over to the animator, who brings the character to life using Spine 2D and After Effects, while the sound designer creates the animal's music and sounds. In the end, we hand over all the materials to the developer and he builds everything into the game.</p>\n\n<p><strong>We </strong><em><strong>don't use stock</strong></em><strong> music.</strong> All sounds and melodies that are in the game are created by our sound designer Amal: the steps of the characters, the crackling of the fire, the sounds of the clock, the sounds that the characters make, and many more. <strong>This music helps kids practice their musical hearing and sound perception.</strong>\n</p>\n<p><strong>Just listen.</strong> You will hear the birds singing here. This is a recording of the voices of <em>real</em>forest birds.\r\n</p>\n<p>https://soundcloud.com/daria-borisova-708184732/shleepy-stories?utm_source=clipb...</p>\n<p><strong>Intro and hints in the game are voiced by a professional storyteller Janlyn:</strong>\n</p>\n<p>https://soundcloud.com/daria-borisova-708184732/intro?utm_source=clipboard&amp;utm_m...</p>\n<p><strong>Here's how we voice characters:</strong>\n</p>\n\n\n<p><strong>Two</strong> <strong>professional illustrators in our team drew illustrations for children's books, before working with us.</strong>\n</p>\n<p>The Illustrators begin drawing a freehand sketch on a plain piece of paper. The sketch contains the general features of the character, his house, clothes, and all the details.\r\n</p>\n\n<p><strong>This is the process of drawing the characters from idea to preparation for animation:</strong></p>\n\n\n\n<p><strong>DOTBAKE is a small indie game company started by a team of creative, passionate, and committed individuals.</strong> Our team consists of 2 illustrators, a 2D animator, a developer, a founder, a product manager, a media buyer, a sound designer, and a social media manager. All work processes in the team are interconnected and debugged. <br/></p>\n<p><strong>All of us are united by a common value - the creation of quality apps for kids</strong>. <strong>All of our team members have younger brothers and sisters, and the founder of our team has a young daughter, Mia. So we make our game with love, putting our souls and energies into the work</strong>. And our younger siblings use Shleepy Stories before bedtime. <strong>We don't make products that we wouldn't give to our children.</strong>\n</p>\n<p><strong>Join the video about our team and workflow:</strong></p>\n\n<br/>\n\n\n\n\n\n<p>Shleepy Stories’ creation story began in October 2021. Before creating this game, we studied the market for apps and games, as well as research on this topic, and realized that a fairly large percentage of games and apps are simply not suitable for children. There are a lot of unfiltered ads that kids shouldn't view, and many educational apps contain almost no educational content. Also, we studied many books and articles about parenting and child development to understand what can and cannot be used in children's games and apps.\r\n</p>\n<p>We wanted to create a multifunctional quality game for young children: in soft soothing colors and without harsh colors, with good music, without ads, with a small educational load for toddlers, and helping to form a bedtime ritual so that children go to bed with pleasure. And so it turned out Shleepy Stories.\r\n</p>\n<p>The founder of Dotbake, Victor, has a little 1-year-old daughter, and this, among other things, prompted him to create quality games for children.\r\n</p>\n\n<p>Connect with our team and Shleepy Stories community in any convenient way for you. We are always glad to see new friends. Just come to say “hi”!</p>\n\n\n\n\n<p><strong> Nice to meet you :)</strong></p>", "metacritic": null, "released": "2022-06-06", "tba": false, "updated": "2022-06-10T07:01:22", "background_image": "https://media.rawg.io/media/screenshots/011/0117a4bd60fa0bcb4c0e49a2c4d0ce47.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DOTBAKE"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}