{"id": 79954, "slug": "north-south-the-game-lite", "name": "NORTH & SOUTH - The Game Lite", "name_original": "NORTH & SOUTH - The Game Lite", "description": "RELIVE THE NORTH &amp; SOUTH CULT GAME REMODELED!<br/>An absolute must for all retro fans!  North &amp; South offers the highly popular gameplay, now charged with intuitive touch controls especially designed for iPad.<br/><br/>It’s back at last: the Union (Northern States) against the Confederation (Southern States). The real-time strategy game set during the American Civil War (1861-1865) is as simple as it is fun to play!<br/><br/>Experience a game full of variety and humor that recreates and enhances the feeling of the old days, so it will appeal to nostalgic old-gamers and new players alike!<br/><br/>Immerse yourself in the fascinating world of “North &amp; South” in this LITE VERSION, and lead your troops to victory!<br/><br/>Features in the LITE VERSION<br/>- A map (1861)<br/>- A battlefield<br/>- One difficulty level (easy)<br/>- Single player mode<br/>- Without Mexicans, Indians and a weather feature<br/><br/><br/>Key features in the FULL VERSION<br/><br/>CHARGE INTO THE NEW INTERPRETATION OF THIS CLASSIC GAME ON A NEW PLATFORM!<br/>The popular strategic gameplay is back with brand new features and controls that have been developed specifically for the iPad.<br/><br/>NORTH OR SOUTH: CHOOSE YOUR SIDE!<br/>Play the Civil War on the side of the North or the South.<br/><br/>3 DIFFERENT GAME MODES COMBINE TO CREATE AN INNOVATIVE GAME EXPERIENCE!<br/>Plan your next moves in Board Game mode and fight quick, action-packed battles in the “Whack a Mole” game and Battlefield mode.<br/><br/>PLAY SOLO OR COMPETE AGAINST OTHER PLAYERS!<br/>An extensive single player campaign takes you through the years of the Civil War, and you can challenge your friends in various multiplayer modes locally on the iPad or online using the matchmaking function.<br/><br/>GAMEPLAY THAT WILL NEVER GET BORING!<br/>Different features like weather, ships, Western towns, Indians and Mexicans will influence the game events, and you must adapt your strategy accordingly.<br/><br/>EASY TO LEARN, BUT HARD TO MASTER!<br/>A game that combines strategy and action elements with intuitive controls that can be played either as a casual game or for long periods using the iPad anytime, anywhere!", "metacritic": null, "released": "2012-07-18", "tba": false, "updated": "2019-07-30T03:39:15", "background_image": "https://media.rawg.io/media/screenshots/d12/d125cd88adce61fdedf50a38a11deaab.jpg", "website": "https://www.handy-games.com/en/games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Handy Games"], "genres": ["Strategy"], "publishers": ["www.handy-games.com"], "esrb_rating": "Everyone 10+"}