{"id": 799638, "slug": "downstream-dream", "name": "Downstream Dream", "name_original": "Downstream Dream", "description": "Game Controls\r\n\r\nLegend:\r\n<p>⬅️➡️⬆️⬇️ = D-Pad or Keyboard Arrow Keys\r\n    </p>\n<p>🅾️ = Button 1 or Keyboard Z <br/></p>\n<p>❎ = Button 2 or Keyboard X</p>\n<p>Note: The downloadable version supports many USB gamepads out-of-the-box via the underlying Pico-8 application. Give yours a try! See the Pico-8 manual for more information on configuration.<br/></p>\r\n\r\nMovement:\r\n<p>⬅️ + 🅾️ - Paddle counter-clockwise\r\n    </p>\n<p>➡️ + 🅾️ - Paddle clockwise<br/></p>\n<p>⬆️ + 🅾️ - Steady ahead <br/></p>\n<p>⬇️ - Move backwards (with motor)<br/></p>\r\n\r\nOffense/Defense:\r\n<p>❎ - Throw<br/></p>\r\n\r\n\r\nHow to Play\r\n\r\n\r\n<p>\n</p>\r\n\r\nFrom the Developer\r\n\r\n\n<p>My mom loved both adventure and the American southwest; she traveled there many times over her life, and her home was filled with art and souvenirs she'd collected from her visits to the region.</p>\n<p>When I was about seven years old, my parents rented a minivan and took me on a long roadtrip across the United States. I don’t remember a lot from that trip other than staring out the window while the landscape slowly changed from cities and farmland, to mountains, to desert, but one memory stands out from the endless monotony of the road; a stop at the Grand Canyon where my mom went white water rafting.</p>\n<p>My dad never learned how to swim, and someone needed to watch me anyway, so the two of us waited downstream in the hot afternoon sun, looking for mom's boat to come in. I don’t think the water was particularly rough at that time of year; but like my dad, I’ve never been good at swimming either, and I spent most of the time thinking about how scary the water looked to me. I imagined how if I was on the boat with mom, I would probably fall out and be carried away by the river. She seemed very bold and brave that day!</p>\n<p>A couple years before she left this world, mom offered to take me on a trip out west; possibly to Las Vegas, or maybe the Grand Canyon. I politely turned her down for some made-up reason, while the real one probably had something to do with still being in my 20s and wrongly believing that I was too cool to go on vacation with my mother. As a young adult, I assumed that there would always be more time with the people in my life. Now that I'm a little older, I'm learning that there is rarely ever enough. I don’t know where we might have gone or what we might have done on that trip, if I hadn't foolishly said no; but sometimes, it’s nice to dream about it.</p>\n<p>Anyway, I hope you enjoy the game. It contains a lot of love, a little regret, and the best game I could make with Pico-8.<br/></p>\n<p>-ridgek<br/></p>\n\r\n\r\nCredits and Thanks\r\n\r\nExternal Libraries:\r\n<ul><li>PX9 by Zep</li><li>Local fillp() by Makke &amp; Felice</li><li>pic2pico by Nodepond</li><li>GEM by Paul Hammond</li></ul>\r\nPlaytesters:\r\n<ul><li>Paul Nicholas (@Liquidream)</li><li>John Loiterman (@protonperson | http://sbigames.com)</li><li>Lex Rendon</li></ul>\r\nSpecial Thanks To:\r\n<ul><li>Fred Souchu</li><li>Johan Pietz</li></ul>\n\r\nPurchase Includes:\r\n\r\n<ul><li>Binaries for Windows, MacOS, Linux, Raspberry Pi\r\n</li><li>A Pico-8 .png \"cartridge\" file\r\n</li><li>An unminified, commented .p8 file. (Note: This file is too large to actually run in Pico-8 and is included for reference.)\r\n</li></ul>", "metacritic": null, "released": "2022-06-09", "tba": false, "updated": "2022-06-10T07:28:34", "background_image": "https://media.rawg.io/media/screenshots/d0b/d0b6be603d4dc17b5025ad8f85aef7d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["ridgek"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}