{"id": 799783, "slug": "spider-man-beat-em-up-prototype", "name": "Spider-Man Beat-em-up Prototype", "name_original": "Spider-Man Beat-em-up Prototype", "description": "<p>This is a simple prototype of a Spider-Man beat-em-up inspired by classic arcade games in the genre. It currently features 3 procedurally generated shooter goons, which you have to take down making use of rudimentary melee combat and ranged web attacks!</p>\n<p>Needless to say, the project in its current state is very barebones. It's very very early stages, but this foundation could be expanded upon quite greatly. As it is, it's more of a testing field for a few mechanics and systems I hadn't tried implementing before. Some of the more relatively impressive stuff is actually behind the scenes:</p>\n<ul><li>tried out some interesting shader and material variations:<ul><li>the enemies' clothes change every time you boot up the level!</li><li>the level itself uses a single material, the colors of which I can change with a script per structure/building internally</li></ul></li><li>implemented simple AI with pathfinding and avoiding the player</li><li>flexible scripts designed to be used in as many ways as possible<ul><li>open for new variations of pretty much every element of it</li><li>this is something I usually try to do, but here it's taken to the next level</li></ul></li></ul>\n<p>Hoping to get back to this project in the future, but until then, I hope you see the potential in this incredibly short demo that I do!</p>\n<p>(also, there's a hidden barely-working Iron Spider outfit somewhere in the level, can you find it?)</p>\n<p>Twitter thread of random notes from the development process:<br/>https://twitter.com/scrillrock/status/1428501019227533321?s=20&amp;t=O5KMWAgphfkx_-2...</p>", "metacritic": null, "released": "2022-06-09", "tba": false, "updated": "2022-06-10T08:38:32", "background_image": "https://media.rawg.io/media/screenshots/ecc/ecc711f5fae8ec4747ac058b3cb6952d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Scrillrock"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}