{"id": 800070, "slug": "the-backrooms-found-footage-early-demo", "name": "The Backrooms: Found Footage - EARLY DEMO", "name_original": "The Backrooms: Found Footage - EARLY DEMO", "description": "<p>\n</p>\n\n<strong>\n</strong>\n\n\n\n\n<p><strong>WELCOME TO THE BACKROOMS<br/></strong></p>\n\n\n<p><strong>THE BACKROOMS: FOUND FOOTAGE </strong>is a psychological horror game with roguelite elements where <strong><em>you</em></strong>,\r\n the protagonist- find yourself trapped in a seemingly infinite maze of \r\noffice spaces. Your goal is to survive and escape by finding provisions \r\nto survive and collecting clues that will lead you towards the exit- all\r\n while dealing with dangerous creatures called <strong><em>entities</em></strong>.</p>\n\n\n<p><strong>600 MILLION SQUARE MILES</strong></p>\n<p>The known Backrooms consists of approximately 600 million square miles of randomly segmented office spaces, and is continuously lit by distracting, buzzing lights. Get the traditional Backrooms experience as you encounter entities like the <strong><em>Smiler</em></strong>,  or try out Purist mode and simply immerse yourself in the madness.</p>\n\n\n<p><strong>DESCENT INTO MADNESS</strong></p>\n<p>The very nature of the Backrooms eats away at the mental and physical strength of its inhabitants, requiring them to meditate, and rely on substances like <strong><em>Almond Water</em></strong> for sustenance. In the Backrooms you will have to scavenge to survive, using your knowledge of lore to make the right decisions. As you progress you will unlock new madness-induced hallucinations, new usable items, and permanent stat buffs, which will benefit you on subsequent playthroughs.</p>\n\n\n<p><strong>YOU ARE NOT ALONE</strong></p>\n<p>You are not the first person to be stuck in the Backrooms, nor the only thing inhabiting it. Throughout your escape you will gather information left by those who came before you. Unlock journal entries related to new entities- then experience them as you replay. Build on your knowledge and learn from their mistakes and remember- If you hear anything wandering nearby, it's definitely already heard <strong><em>you</em></strong>.</p>", "metacritic": null, "released": "2022-06-08", "tba": false, "updated": "2022-06-10T10:44:00", "background_image": "https://media.rawg.io/media/screenshots/52e/52ef14d9edc39316d1f48eb8bbb11008.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["baddweather"], "genres": [], "publishers": [], "esrb_rating": null}