{"id": 800012, "slug": "duck-and-seek-classic", "name": "Duck and Seek Classic", "name_original": "Duck and Seek Classic", "description": "<p>This is an updated version of  Duck And Seek 2 that was made in Scratch 2.0 and is available on the Scratch website. The original Duck And Seek is also available on the Scratch website. </p>\r\nThis is a local multiplayer game that can only be played with two players on the same system!\r\nControls\r\nDuck Controls\r\n<p>Use WASD to move the duck</p>\n<p>In the gamemodes Heist and Ninja: Press E to activate the smoke bomb</p>\r\nHunter Controls\r\n<p>Use the mouse to aim</p>\n<p>Left click to shoot</p>\r\nGamemodes\r\nClassic\r\n<p>The duck needs to blend in and survive for ONE minute. If the player duck is killed the hunter wins, if the player duck survives or if the hunter kills the wrong duck, the player duck wins.</p>\r\nHeist\r\n<p>The player duck needs to collect the four pieces of the hamburger while avoiding getting detected by the hunter. Smoke bombs are available for the player duck to use in this gamemode.  </p>\n<p>If the player duck is killed the hunter wins, if the player duck collects all pieces of the hamburger or if the hunter kills the wrong duck, the player duck wins.</p>\r\nNinja\r\n<p>The player duck's goal is to collect as many cherries as possible. Smoke bombs are available for the player duck to use in this gamemode.  </p>\n<p>This gamemode is highscore based and the player duck can't win. The game ends when the hunter shoots the player duck. In this gamemode the hunter can shoot all non-player ducks without losing.</p>\r\nRace\r\n<p>The player duck needs to cross the finish line without being shot.  In this gamemode all none player ducks only move back and forth, never up or down. </p>\n<p>If the player duck is killed the hunter wins, if the player duck crosses the finish line or if the hunter kills the wrong duck, the player duck wins.<br/></p>\r\nCredits\r\n<p>The sound effects and music was found on various websites and are all available for free for the public to use<br/></p>\n<p>Everything else was made by me (Pixel art, programming, gamedesign, etc)\r\n</p>", "metacritic": null, "released": "2022-06-08", "tba": false, "updated": "2022-06-10T10:20:22", "background_image": "https://media.rawg.io/media/screenshots/08a/08a68e2ea49202070f5d882d6931b4e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ToxicSeal"], "genres": ["Action"], "publishers": [], "esrb_rating": null}