{"id": 80000, "slug": "one-hour-one-life-for-mobile", "name": "One Hour One Life for Mobile", "name_original": "One Hour One Life for Mobile", "description": "This game reached #1 paid RPG and #3 of all paid games in AppStore Japan!<br/><br/>This is an adaptation for iOS of the original desktop game by Jason Rohrer. If you have played the original, you will recognize Jason's cute and quirky graphics and sounds, as well as the wonderful premise: rebuilding civilization from scratch, together with other players and across countless generations.<br/><br/>You are born either as a baby to one of the other players, or as a young woman if no suitable mother is found. Every minute of real time is one year in the game and your maximum age is 60 years. A single life is limited, but the things you make during your lifetime are left for your children and grandchildren once you are gone. Try to make life a little bit easier for those who come after you, so your family line will have a chance to prosper for generations to come.<br/><br/>Sometimes you will spawn alone in the wilderness. You need to build a fire to stay warm and trap rabbits to get meat and furs for clothes. A sharp stone may be your best friend in the beginning. Try to find a good spot to settle and grow some food, because other players may soon arrive as your children, and will need to be taken care of until they are grown enough to help you.<br/><br/>Sometimes you will be born in a sprawling city, with farmers, cooks, blacksmiths, shepherds and hunters. There will be clothes and equipment ready for you, prepared by players who may be your grandparents or distant relatives. Maybe you will gather some friends and set out to start a settlement of your own, maybe you will inherit a farm job from your uncle, or maybe you will slay bears and wolves. The choices are endless, but remember: unless you leave the world better after you have lived than when you arrived, you have not really achieved anything.<br/><br/>Every life you play will put you in contact with new players. Some are more experienced than you, some are less. Some will teach you and some will learn from you. Some may even be disruptive to the civilization you are building, and will need to be dealt with accordingly. It will be up to you and your fellow players to shape the world for a brief moment in time, before the following generations take over.<br/><br/>After your game life is over, you can look at your family tree and see how your descendants are doing. You can take pride in each of your younger relatives who survives into adulthood and in each new generation that follows you, knowing that you helped make it happen.", "metacritic": null, "released": "2018-08-17", "tba": false, "updated": "2019-10-22T14:22:57", "background_image": "https://media.rawg.io/media/screenshots/1bf/1bff1c95fc5c220516617d63f50b0ce2.jpg", "website": "https://onehouronelife.app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Wereviz", "Dual Decade"], "genres": ["Adventure", "RPG"], "publishers": ["Wereviz"], "esrb_rating": null}