{"id": 800005, "slug": "the-sacred-acorn", "name": "The Sacred Acorn", "name_original": "The Sacred Acorn", "description": "EXPLORE THE FURTHEST REACHES OF AN ENCHANTED LAND IN PERIL\r\n<p>A mysterious force known as The Chaos has begun creeping into the once peaceful Tansira, infecting the land and corrupting everything it touches. It’s spreading fast, from the lush Emerald Thicket all the way to the Roaring Tundra. Nothing is safe from its corruption; the landscape is withering, friends are turning on each other, and once beautiful havens are becoming desiccated wastelands. There is only one that can harness the ancient power of the essence and stop this calamity before it’s too late… you.\r\n</p>\n\r\nTHE GAME\r\n\r\n<p>The Sacred Acorn is a beautiful top down adventure that will take you on a journey across a vast enchanted world. Explore ancient forests, mysterious caves, frigid tundras, murky swamps, and deadly volcanoes. Fight fearsome monsters, befriend cute and strange creatures, unlock new powers\r\n</p>\n<p>and discover long lost ancient secrets to save your tribe.\r\n</p>\n<p>Can you purge the Chaos in time?\r\n</p>\n\r\nGAME FEATURES\r\n<ul><li>Top-down 2D metroidvania action adventure with challenging combat.</li><li>You are a squirrel! Brave, adorable and uniquely gifted.</li><li>Explore an expansive world full of beautiful vistas and hidden secrets.\r\n</li><li>Cute, charming and strange creatures ready to greet you around every corner.\r\n</li><li>Enemies galore! Fight formidable trees that move, vicious shells that shoot spikes, noxious mushroom creatures, and many many more.\r\n</li><li>Companions that will follow you on your journey and assist you in their own unique ways.\r\n</li><li>Listen to a beautiful soundtrack, hand crafted to fill every moment with wonder and excitement.\r\n</li><li>Puzzles and secrets hide all over Tansira - what mysteries will you find?\r\n</li></ul>\r\nIN DEVELOPMENT\r\n<p>This game is in active development, meaning that the demo version will receive frequent updates that may break saves and change fundamental game elements from time to time.\r\n</p>\r\nJOIN THE COMMUNITY\r\n<p>Join in discussions, report bugs, make suggestions and chat with the dev team.<br/>http://discord.afewdragons.com<br/></p>", "metacritic": null, "released": "2022-06-08", "tba": false, "updated": "2022-06-10T10:17:42", "background_image": "https://media.rawg.io/media/screenshots/0d8/0d881c98c287ca8e2070d5266f8f86f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["A Few Dragons"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}