{"id": 800186, "slug": "a-book-for-my-dear-mary-obsolete-lol", "name": "A Book For My Dear Mary (OBSOLETE LOL)", "name_original": "A Book For My Dear Mary (OBSOLETE LOL)", "description": "<p>Hiiiii if you're seeing this you've stumbled across my silly goofy project. <br/>This is old. I'm rebuilding this entire concept from scratch when I get around to it, so this version is kinda useless to me. But it has like two years worth of progress into it so I wanted to have a place to memorialize it and share with friends! Plus it's the first time I've tried making a traditional RPG, and seeing how old Cherry's brain operates is very funny to me. <br/></p>\n<p>If you aren't my friends seeing this, hi. This is not a normal game, nor my level of quality anymore. It is also unfinished. There's some charm to it, but it'll be awhile to see any of it come to fruition since I'm working on a different project atm. Don't worry though, if for some reason you get attached, it's the next thing I'm planning on tackling :&gt;</p>\n<p>(Also like. General content warning for child abuse, child endangerment, and discussions of mental health issues and suicide. I call this game \"silly and goofy\" because I know the characters inside and out and they are very dear to me. However, the themes this game touches on can get pretty dark! At the time I was trying to write these issues with tact, and while I would make some better pacing decisions and clean up the dialogue, nothing in the base game will hopefully be too triggering or upsetting. There's only one optional and difficult to find area that I doubt anyone will even come across that gets particularly heavy. A lot of Sedric's expressions of suicide are very reflective of mine at the time, so I feel the writing still holds up pretty well there! Still, if I misread the vibe or anything is too much and needs a more detailed warning, just let me know! I doubt many people will play this but still haha.)<br/></p>\n<p>Anyway here are my boys (:<br/><br/><br/></p>", "metacritic": null, "released": "2022-06-07", "tba": false, "updated": "2022-06-10T11:35:16", "background_image": "https://media.rawg.io/media/screenshots/851/851fc1725852c0bafd4dbdb24faad4d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cherry but EVEN SILLIER"], "genres": [], "publishers": [], "esrb_rating": null}