{"id": 800154, "slug": "rescue-tank", "name": "Rescue Tank!", "name_original": "Rescue Tank!", "description": "<p>RESCUE TANK! is a tongue-in-cheek humanitarian learning game. It was developed as a tech demo in C++ and SDL2 by Matthew Stevens of Lessons Learned Simulations and Training (mstevens@llst.ca / www.llst.ca).</p>\n\n<p><strong>Instructions:</strong></p>\n\n<p><strong>-------------</strong></p>\n<p>Aim: A and D</p>\n<p>Deliver Funds: Hold the space bar to charge the delivery. Release to send the delivery.</p>\n\n<p><strong>Game Rules:</strong></p>\n\n<p><strong>-----------</strong></p>\n<p>The RESCUE TANK delivers life-saving supplies to people in need. </p>\n<p>As with all humanitarian operations, the tank requires funding to operate. If you are unable to secure adequate funding, the humanitarian program will collapse. </p>\n<p>Aim the aid delivery device using the A and D keys. Hold down the spacebar to charge up the aid delivery vehicle. The longer you hold the spacebar, the faster and the aid is dispatched. However, charging the delivery vehicle costs funds. The more you charge the aid delivery vehicle, the more the delivery will cost.</p>\n<p>Funding is provided by donors when the project team successfully delivers aid to communities in need.</p>\n<p>Communities in need are represented by purple squares. As time passes, the community shrinks as the people living are faced with no option but to move on. Serving smaller communities means smaller funding rewards from donors. However, if you fail to serve a community, donors will reallocate your funding towards restrictive border control activities.</p>\n<p>While a small community may be increasingly difficult to serve, and decreasingly lucrative for your organisation, you will avoid punishment by successfully delivering aid. Sometimes this will mean the difference between a sustainable aid effort and a failed one. <br/></p>\n<p>You will have to choose which communities are best to target... but hurry, because the clock is ticking!<br/></p>\n\n<p><strong>Why Rescue Tank?</strong></p>\n\n<p><strong>----------------</strong></p>\n<p>RESCUE TANK! is a tech demo. While it does explore some key real-life tensions between donors, humanitarian actors, and the people we attempt to serve, including the increasing militarization of aid, it was created primarily as a skill-building exercise. Neither LLST nor Matthew Stevens advocates for the aid delivery methods featured in RESCUE TANK!.</p>\n<p>This project was coded entirely in C++ and SDL2. It demonstrates the following abilities:</p>\n<ul><li>Basic game engine development in C++, including:<ul><li>establishing a main game loop,</li><li>tracking of multiple game objects, </li><li>collision detection, and</li><li>basic physics such as gravity and application of forces.</li></ul></li></ul>\n<ul><li>Use of SDL2 libraries</li><li>Dynamic memory management techniques</li><li>Object pooling</li></ul>\n<p>See the source code at: https://github.com/LLST-Learning-Games/Rescue-Tank</p>\n\n<p><strong>Acknowledgements:</strong></p>\n\n<p><strong>-----------------</strong></p>\n<p>RESCUE TANK! was created as a project for CMPT1267 at Douglas College. It would not have been possible without the instruction of Prof. Mohammad Aboofazeli. It also drew heavily on the text 'Game Programming in C++' by Sanjay Madhav.</p>\n<p>RESCUE TANK! was designed to emulate the gameplay experience of Tank Wars (1986), Atari console games, and arcade games such as Missile Command.</p>\n<p>The fantasic music in RESCUE TANK! was composed by Music composed and produced by Tomasz Kucza (http://magory.net/music): <br/>(licence: CC-BY 4.0 https://creativecommons.org/licenses/by/4.0/ ).</p>\n<p> <br/></p>", "metacritic": null, "released": "2022-06-07", "tba": false, "updated": "2022-06-10T11:21:36", "background_image": "https://media.rawg.io/media/screenshots/43d/43d5a490657429f62b40c52d15a30910.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LLST"], "genres": ["Action"], "publishers": [], "esrb_rating": null}