{"id": 8006, "slug": "zombitsu", "name": "Zombitsu", "name_original": "Zombitsu", "description": "ZOMBITSU (noun: zom-bit-su) - a traditional form of Japanese sword combat against warriors of the undead.<br/><br/>The evil Lord Nakatomi has torn apart your land and unleashed his army of soldiers for total destruction. Play as Hiro, the last known Zombitsu expert, on his epic journey through the glorious streets of his Japanese village, the devastated lava world and the picturesque floating kingdom.<br/><br/>Run, jump and fight your way through the hordes of zombies to become an unstoppable ninja. <br/><br/>Are you brave enough to take the challenge and save your world?<br/><br/><br/>******<br/> <br/>CHOOSE YOUR OWN PATH<br/>Enjoy greater freedom of movement than any other 3D runner as you run and jump through wide, tall and open levels.  <br/><br/>OLD SCHOOL ARCADE CONTROLS<br/>Use tilt to steer and two buttons to jump or attack. Combine button presses in sequence to perform combos.<br/><br/>COMBAT THE ZOMBIE HORDES<br/>Slice and dice your way through the undead army of Lord Nakotami. Perform devastating combos such as the Hammer Chop or Uppercut.<br/> <br/>RANDOMLY GENERATED LEVELS<br/>Each run is unique and each level is filled with random paths and secrets that require keen attention and platforming skills<br/> <br/>UNLOCK THE ANCIENT SECRETS OF ZOMBITSU<br/>Complete missions to learn new combos and discover power-ups. Will you learn the dragon dash or unlock the fireballs?<br/> <br/>THREE AREAS TO EXPLORE<br/>Run through the Castle, Sky and Lava areas, each with their own unique challenges and dangers.<br/><br/>CLIMB TO THE TOP OF THE NINJA RANKS<br/>Compete on Game Center leaderboards for the highest number of zombie kills in a run.<br/><br/>******<br/><br/>Read more on our blog here<br/><br/>Email support enquiries or suggestions to: support@rumastudios.com<br/><br/>Follow us on twitter: @rumastudios<br/><br/>Like us on Facebook: https://www.facebook.com/rumastudios", "metacritic": null, "released": "2013-10-31", "tba": false, "updated": "2019-10-22T14:29:39", "background_image": "https://media.rawg.io/media/screenshots/541/541153d66a253711fc5084c6fab0f232.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ruma Studios"], "genres": ["RPG", "Arcade"], "publishers": ["Ruma Studios"], "esrb_rating": "Teen"}