{"id": 80083, "slug": "gun-club-3", "name": "Gun Club 3", "name_original": "Gun Club 3", "description": "Take to the range with an incredible arsenal of the world’s finest weaponry. Gun Club 3 combines challenging, addictive gameplay with stunning visuals &amp; unsurpassed detail; the only thing missing is the smell of gun powder.<br/> <br/>The newest release in the best-selling Gun Club series, Gun Club 3 brings a whole new world of excitement to the most popular gun simulator ever.<br/><br/>NEW CHALLENGE MODE<br/>Lay down your best run then send it to your friends to battle for prizes! Watch as they tackled your score with all-new replays.<br/><br/>UNPARALLELED REALISM<br/>Highly detailed interactive 3D weapon models. Each weapon is fully operational, features real-world ballistics, and can be panned, zoomed, and rotated to catch every angle of detail.<br/><br/>ADVANCED CUSTOMISATION<br/>Custom-fit your weapons with hundreds of different attachments. From scopes to lasers to grenade launchers, the picatinny rail system allows for any load-out you can imagine. Combine it with the multitude of camo options and the weapon customisation possibilities are endless. <br/><br/>INTERACTIVE RANGES<br/>Fire your weapons in a multitude of different range scenarios, from hostage rescue to long distance marksman to the dreaded zombie apocalypse. And for true shooting purists there is the classic target range. No time limits, no scores, just you and your weapon.<br/><br/>RISE TO THE TOP<br/>Square off against some of the best shooters in the world with Competition Mode. Shoot your way through each round of the tournament until you are finally crowned as the Ruler of the Range.<br/><br/>FRESH CONTENT<br/>With unique daily trials every day, regular theme packs containing new weapons, ranges, accessories, achievements, leaderboards, and the soon-to-be-released multi-player challenge mode, there is always something new to do in Gun Club 3.<br/><br/>UNIVERSAL APP<br/>Play across all supported devices - iPhone 4, iPhone 4s, iPhone 5, iPhone 5C, iPhone 5S, iPad 2, iPad 3, iPad 4, iPad Mini, Air or iPod Touch 5 - and continue your progress.<br/><br/>The best weapon sim of all time has just gotten better. Are you ready for the challenge? <br/><br/>Gun Club 3 is free to play, and requires no in-app purchases to progress. Users do have the option to purchase items with real money. These purchases can be disabled via your device's iOS settings.<br/><br/>Please note, Gun Club 3's game data was previously saved to an external server. This version has no account system in place and all game information is stored locally on the device. Game data can be transferred to new devices using the device backup and restore functionality. Be sure to backup your device, game data that is not backup up is unable to be restored.", "metacritic": null, "released": "2013-11-21", "tba": false, "updated": "2019-07-30T12:12:12", "background_image": "https://media.rawg.io/media/screenshots/e10/e101af30f149adb2045a6d66b8185a7e_acuasfL.jpg", "website": "http://www.thebinarymill.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Binary Mill"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["NextGen Reality Pty"], "esrb_rating": null}