{"id": 80092, "slug": "chefs-quest", "name": "Chef's Quest", "name_original": "Chef's Quest", "description": "Travel the world on your quest to become the ultimate chef and restaurateur. Switch and match your way through hundreds of culinary challenges in this most delectable puzzle adventure. Amass a wealth of opulent decor and acquire a cult following as you turn your quaint little diner into a global celebration of multicultural cuisine.<br/><br/>Take on this adventure solo or play with friends visiting their own unique restaurants or challenging their scores!<br/><br/>Chef’s Quest features:<br/>- Use dozens of power ups to sizzle, pop, and grill your way to the top!<br/>- Collect coins to design and furnish your very own restaurant<br/>- Discover dozens of unique restaurant decor items in your travels <br/>- Visit friends restaurants to forage for new design ideas<br/>- Challenge friend's scores on every puzzle<br/>- Attract celebrities for huge bonuses based on restaurant objectives<br/>- Challenging master chef battles when graduating from a region<br/>- Leaderboards &amp; achievements to match with your friends<br/>- Delightful orchestrated soundtrack<br/>- Seasonal updates (Halloween, Easter, Valentine's Day, Christmas - there’s always something special cooking!)<br/>- Play on iPhone or iPad as your progress carries over<br/>- Support for 14 languages<br/> <br/>Visit us at https://thebinarymill.zendesk.com/ if you need any help!<br/><br/>Follow us to get news and updates;<br/>facebook.com/thebinarymill<br/>Twitter: @thebinarymill<br/>https://www.youtube.com/user/binarymill<br/>http://www.thebianrymill.com/<br/><br/>Chef’s Quest is completely free to play but some optional in-game items will require payment.<br/><br/>You can turn off the payment feature by disabling in-app purchases in your device settings.", "metacritic": null, "released": "2016-11-23", "tba": false, "updated": "2019-07-30T12:12:27", "background_image": "https://media.rawg.io/media/screenshots/f76/f763dd7820128e33a8ef3f9b16c46e22.jpg", "website": "http://www.thebinarymill.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["The Binary Mill"], "genres": ["Adventure", "Puzzle"], "publishers": ["NextGen Reality Pty"], "esrb_rating": "Everyone 10+"}