{"id": 80100, "slug": "slotz-racer-zenos-special", "name": "SlotZ Racer Zenos Special", "name_original": "SlotZ Racer Zenos Special", "description": "Experience the thrill of belonging!<br/><br/>This version of SlotZ Racer is an exclusive demo of the awesome new Zenos E10 sports car and its extreme turbocharged E10S big brother.<br/><br/>Experience British lightweight track-day sports cars at their best with the E10, E10S and spectacular E10R.<br/><br/>A new special edition version of the original and best slot car racing game for iOS! SlotZ Racer Zenos Special is an all new edition of the epic game from Strange Flavour, authors of Fish!, Flick Fishing, SlotZ Racer and Any Landing.<br/><br/>Jump in and start racing, with simple one button control that everyone can master, with a kids mode for the learners and the Nnaargh mode for those that want a serious challenge (and achievements).<br/><br/>Challenge yourself and try and win all the different championships then challenge your friends with the Game Center Time Trials Leaderboards and achievements.<br/><br/>Play against up to 3 friends on the same device in multiplayer mode.<br/><br/>Compatible with MFi (Made For iOS) controllers, including 4 player multiplayer. (play via AirPlay to an AppleTV for even more fun!). <br/><br/>Now includes a free sticker pack to use in Messages on iOS 10!<br/><br/>The Zenos E10, E10S, E10R and Zenos logos appear with kind permission of Zenos Cars (www.zenoscars.com)", "metacritic": null, "released": "2015-04-22", "tba": false, "updated": "2019-10-22T13:54:19", "background_image": "https://media.rawg.io/media/screenshots/92b/92b5418e4103f0082cbd8d4a644f0643.jpg", "website": "http://www.strangeflavour.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Strange Flavour"], "genres": ["Simulation", "Racing"], "publishers": ["Strange Flavour"], "esrb_rating": "Everyone 10+"}