{"id": 80101, "slug": "boat-sim-2-ships", "name": "Boat Sim 2 (Ships)", "name_original": "Boat Sim 2 (Ships)", "description": "Boat Sim 2 (Ships) puts you at the controls of a large Icebreaker (cruise ship will be added in next update), out in the ocean in heavy seas.<br/><br/>Carefully weather the stormy weather as you hear the ocean sounds around you, view the land in the distance.<br/><br/>Watch other large ships ride the waves, go up close and BLAST your ships horn !<br/><br/>Navigate to the dock or sail along the coastline, or take your ship out to sea.<br/><br/>Unlike games, this ship simulation has no time limits or objectives, be the skipper anytime you want, for as long as you want.<br/><br/>Building on the original Boat Sim which enabled users to sail round scenic islands in a speed boat and fishing boat, this takes it to a new level with heavy seas and ships.<br/><br/>NEXT UPDATE<br/><br/>ALL additional ships and scenery areas are included, buy once get additional ships as released.<br/><br/>A start menu will be added as requested to select starting position and ship to board.<br/><br/>CAMERA ANGLES<br/><br/>Multiple camera angles let you view your ship from the front, top, side and aft, as well as 2 external views.<br/><br/>CONTROLS<br/><br/>Easy to use controls, control your ship with the throttle lever, right joystick controls rudder (left / right) and top half of screen controls view.<br/><br/>So what are you waiting for Skipper, time to ride the waves and steer your ship through the storm !<br/><br/>FEEDBACK AND SUPPORT<br/><br/>Please post ideas, feedback and requests for support on our forum (support link), this is v1.3, we look forward to hearing from you to keep improving the app.", "metacritic": null, "released": "2014-03-14", "tba": false, "updated": "2019-07-30T01:24:10", "background_image": "https://media.rawg.io/media/screenshots/af7/af75aefbae991d3839c464e146ccf8ad.jpg", "website": "http://www.boatsims.com/apps/boat-sim-2/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gary Chambers"], "genres": ["Simulation"], "publishers": ["Gary Chambers"], "esrb_rating": null}