{"id": 801075, "slug": "evils-den", "name": "Evil's Den", "name_original": "Evil's Den", "description": ".<br/>Evil's Den is a rogue-lite dungeon crawler featuring procedurally generated levels where you will battle through hordes of monsters to close a portal to Hell opened in the village's church.<br/><br/><strong>Help Redlovo villagers</strong><br/>The local priest, in his stupidity, made a human sacrifice on the altar. He did not expect that this act of evil would open a portal to the world of demons.<br/>Put an end to the waves of monsters coming out of the portal, help the inhabitants of the village of Redlovo. The villagers are afraid for their lives and their loved ones, and the kingdom of Pomerania is also in danger,if you do not stop the enemies by closing the portal, they can threaten the entire continent. <br/><br/><br/><strong>Rise from the dead</strong><br/>Thanks to the help of mages, you are almost immortal. If something gets in your way and you fall, they will resurrect you by magic in the city. All hope is in you! <br/><br/>Try, die, resurrect, repeat.<br/><br/><br/><strong>New challenge, new dungeons!</strong><br/>Dungeons are procedurally generated meaning you'll never play the same level twice, it builds up a new challenge every time you enter the den of evil. Each run will be slightly different, when entering the portal, expect a new challenge.<br/><br/><strong>Loot!</strong><br/>One-handed and two-handed swords, axes, katanas, shields, bows and even new spells. All of this is waiting for you in the dungeons, dear adventurer. Get the blueprint and make a new weapon in the city to help you on your next run!<br/><br/><br/><strong>Grow strong</strong><br/>You can use the acquired gold to rearm before the next attempt to defeat the lord of the Evil’s Den. Thanks to this, his filthy minions will cause you less trouble and you will be closer to your goal. The mages will teach you new spells and the blacksmith will make a weapon according to the crafting recipes you provided. To the battle, become a legend!", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-13T04:02:58", "background_image": "https://media.rawg.io/media/screenshots/f26/f26c0e1989a9a7e9d7a30c0517308de9.jpg", "website": "http://overbuiltgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 334, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Overbuilt"], "genres": ["RPG", "Indie"], "publishers": ["Overbuilt"], "esrb_rating": null}