{"id": 801123, "slug": "greedventory", "name": "Greedventory", "name_original": "Greedventory", "description": "Greedventory is a gorgeous pixel-art action RPG experience, where the only thing standing between you and an embarrassingly swift death is your mouse. Strike, parry, and cast powerful spells on your enemies, loot increasingly magnificent treasures and equipment, get lost in a beautifully brutal world, take down a centuries old not-so-secret society, and become the hero you REALLY don’t want to be!<br/><br/><br/><br/>In a world where magical artifacts are common, an ancient brotherhood rules and strives to collect and hoard every facet of ancient magic. The main rule of survival here is to always be aware of your surroundings and keep your reflexes in tip-top shape, as the realm runs on GREED, and no mortal being can resist the urge to steal, lie, and throw you to the wolves if it means THEY get something for YOUR trouble.<br/><br/><br/><br/>Put your reflexes to the test in a reactive combat system, where every move is made with your cursor, every precious second counts, and quick reaction is the key to not getting blown up or cut into pieces!<br/><br/><br/><br/>Explore every inch of a masterfully and passionately crafted pixel-art world chock full of magic, secrets, GREED, and very sassy humor! Collect practical, yet absolutely DASHING armor, deadly weapons, and if that isn’t enough, imbue them with ancient magic to bestow special abilities, mix and match magical powers to maximize their potential!<br/><br/><br/><br/>Live (or die) through a brutal story of deception and fraud, where even the friendliest looking fella is looking to rob you, be smart, and learn to use their weapons against them!<br/><br/>", "metacritic": null, "released": "2023-05-17", "tba": false, "updated": "2024-04-20T23:14:38", "background_image": "https://media.rawg.io/media/screenshots/d2f/d2f501b01a251ce70e1ce33c89d8c8c1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 4, "beaten": 1, "toplay": 4, "dropped": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 507, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Black Tower Basement"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Nordcurrent", "Nordcurrent Labs"], "esrb_rating": null}