{"id": 801108, "slug": "spyer", "name": "Spyer", "name_original": "Spyer", "description": "In Spyer you will live a story of action, mystery and observation.<br/><br/>The game takes place in a rural area, in the middle of a forest, where you must explore the area to complete the objectives. You will have a rifle and a silenced pistol to help you in combat, and you will have to face an area full of terrorists heavily armed, all of them prepared for combat.<br/><br/>You will control Denny, in first person, and you will have to complete some tasks to exterminate the terrorist group that inhabits that region, in an intelligent way, trying not to be seen, for that, you will have to take some photographs, carry out interrogations and collect some other information in the area, all this with a lot of intelligence and preparation, because the area will be full of armed men. You'll be able to play in your own way, be it silently, in stealth mode or by breaking everything and shooting everyone. Go to the area, investigate, collect evidence and try to escape unharmed.<br/><br/>The game experience provides a mix of suspense, which when combined with strategy, makes everything perfect.<br/><br/><br/>Denny, a government spy, is assigned to investigate a remote area where there is supposed to be a terrorist group. Upon arriving at the scene, Denny comes across several armed individuals, and finds possibly the largest base of the terrorist group.<br/>In this situation, Denny decides to invade the base to try to take some photographs and interrogate one of the group leader's trusted men, in order to obtain information about the group's future plans. It will not be an easy task to invade a place full of terrorists armed to the teeth. Any mistake could be fatal!<br/><br/><strong>Are you a good spy? Find out on Spyer.</strong><br/><br/><br/><br/>", "metacritic": null, "released": "2022-06-10", "tba": false, "updated": "2022-06-13T04:40:18", "background_image": "https://media.rawg.io/media/screenshots/349/3499ad8ec2e6626993e898eefe62de1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 453, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GamesBraz"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["GamesBraz"], "esrb_rating": null}