{"id": 8012, "slug": "rescue-heroes-in-action", "name": "RESCUE: Heroes in Action", "name_original": "RESCUE: Heroes in Action", "description": "Out now: The first expansion for RESCUE: Heroes in Action: Rising Storm with new vehicles and missions! Download the free expansion to your mobile device via in-app purchase!<br/><br/>Dive into realistic, suspense-packed missions with your firefighting unit, where your decisions can often mean the difference between life and death. Find out what it means to be a true &amp;quot;Hero in Action&amp;quot;.<br/><br/>When the sound of sirens fills the streets of your city, the blue flashing lights reflect in the windows of the house fronts, the stampede of soot-blackened boots against the asphalt rings in your ears and the command &amp;quot;Water on!&amp;quot; is shouted out, everyone knows: It&amp;#39;s that time again - THE FIRE DEPARTMENT IS HERE to win the fight against the flames.<br/><br/>Experience the exciting daily activities of a big city fire department in this new addition to the POPULAR RESCUE SERIES, developed entirely for mobile devices. <br/><br/>HOW MANY LIVES WILL I SAVE TODAY? <br/>You’ll have to ask yourself this question of questions every day as a firefighter in &amp;quot;RESCUE: Heroes in Action.&amp;quot; Take full control of thrilling rescue missions, build your team of ready and effective firemen and women and constantly expand your fleet of vehicles. <br/><br/>Maybe then you’ll be able to answer the question of questions with &amp;quot;EVERY SINGLE ONE.&amp;quot; Do you have what it takes to be a &amp;quot;Hero in Action&amp;quot;? There&amp;#39;s only one way to find out. <br/> <br/>Rescue: Heroes in Action: Rising Storm is the first expansion for the popular RESCUE: Heroes in Action. RESCUE: Heroes in Action : Rising Storm adds a new scenario, 10 missions, new emergency vehicles, 4 new and unique characters and much, much more to the main game. <br/><br/>Ravaged by the fierce coastal storm Nina, which caught the city completely off guard, disaster control is rushing to rescue citizens from the impending floods in the hopes of averting a large-scale catastrophe. The people need a hero they can look up to! Are you ready for the challenge?<br/><br/>What the media is saying about RESCUE: Heroes in Action: <br/>&amp;quot;With RESCUE: Heroes in Action, rondomedia proves that more challenging strategy and simulation games can be fun on mobile devices too.&amp;quot; http://topbesteapps.de <br/><br/>&amp;quot;Fans of the genre are sure to have fun with this game!&amp;quot; http://www.appgefahren.de/ <br/><br/><br/>You can play &amp;quot;Rescue: Heroes in Action&amp;quot; on these devices:<br/>- iPhone 5 / 5C / 5S / 6 / 6+<br/>- iPad 3 / 4 / mini 2 / air / air 2<br/><br/>Features:<br/>•\t Out now: RESCUE: Heroes in Action: Rising Storm expansion pack<br/>•\t Adds a new scenario, 10 missions, new emergency vehicles, 4 new and unique characters and much, much more to the main game. <br/>•\t Easy-to-learn firefighting gameplay<br/>•\t Customize your firefighters&amp;#39; uniforms and vehicles with a range of country-specific colors, designs and markings <br/><br/>•\t A variety of realistic firefighting scenarios set in a large city, including an emergency landing by an airplane, a gas explosion, a car crash and a blaze at an oil refinery.<br/>• \tInnovative control system for firefighters and fire trucks<br/>•\t Captivating blend of simulation and strategy from the makers of the bestselling PC game &amp;quot;RESCUE: Everyday Heroes&amp;quot;<br/>•\t Unlock upgrades like bigger tanks, enhanced water extinguishing power, improved engine performance, greater hose range, more durable suits and increased fire extinguisher capacity, and help increase the operational efficiency of your squad. <br/>•\t Each member of your team has their own biography.", "metacritic": null, "released": "2015-06-18", "tba": false, "updated": "2019-11-25T02:25:32", "background_image": "https://media.rawg.io/media/screenshots/fa3/fa326133f617c59eabd31f8fc2896caa.jpg", "website": "http://www.rescuethegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Astragon", "Rondomedia"], "genres": ["Simulation"], "publishers": ["rondomedia Marketing & Vertriebs"], "esrb_rating": "Everyone 10+"}