{"id": 801272, "slug": "la-faim-delvis", "name": "La Faim d’Elvis", "name_original": "La Faim d’Elvis", "description": "<p>Jeu en perspective cavalière (pseudo-3D) dans le cadre de la Game Jam 36 de Gamecodeur (consacrée à la mini-console Thumby).</p>\n<p>Aidez Elvis à s’empiffrer de hamburgers tout en évitant les soucoupes qui tentent de l’enlever !</p>\n<p><em>[/!\\ J’ai dû désactiver le mode aventure (= niveaux prédéfinis) à cause d’un problème de gestion du format CSV… Je pense tenter de corriger cela aussi vite que possible, voire dès cette nuit (12/06/2022), comme on a le droit de s’occuper des bogues après publication. Merci de votre compréhension !! Le mode aléatoire est en revanche jouable.]</em></p>\r\n[Informations pour la Game Jam, reportées ici]\r\n<p><strong>Elève Gamecodeur depuis... (si membre)</strong><br/>Pas membre Premium.<br/></p>\n<p><strong>Temps passé</strong><br/>Un peu plus de 30 h. (Exclusivement à base de Pomodoros : concentré de tomates !)\r\n</p>\n<p><strong>Raconte-nous la génèse et l'histoire de ta création<br/></strong>Aimant bien la pseudo-3D en général (et ayant un plus gros projet qui en utilise), je me suis dit que ce serait sympathique de concevoir un petit jeu utilisant ce concept, qui est un peu un défi avec l’API limitée de Thumby. Je prévoyais notamment de gérer la profondeur d’affichage (= superposition) (ce que j’ai finalement laissé de côté car pas essentiel, mais cela m’a permis d’y réfléchir et de trouver comment faire !).</p>\n<p>Je me suis posé quelques défis comme créer de la musique avec Denver en programmant mon propre petit lecteur interne de partitions (et en composant un peu aidé de BeepBox), et la gestion des collisions selon le mouvement interpolé était intéressant aussi.<br/>Je me suis aussi plutôt contraint à ne pas trop « étendre » l’API de Thumby en n’utilisant pas de sprites qui ne soient pas en 8x8 (par exemple, Elvis est formé de quatre carrés 8x8), mais je me suis rendu compte assez tard que c’était une erreur et que j’aurais sûrement mieux fait de me permettre de gérer directement les sprites de dimensions arbitraires et de créer une version étendue de l’utilitaire fourni (ce qui aurait aussi permis de gérer le noir non transparent pour mon idée de gestion de la profondeur).<br/></p>\n<p>J’ai donné une touche d’humour avec le contexte (le King qui slalome en chaussures bleues entre les OVNI pour ramasser des burgers qui courent !), c’est toujours agréable d’être un peu original et de rire un coup au passage. ;)<br/><em>Petite énigme : d’où vient la mélodie du menu et du jeu ? Si vous trouvez, vous êtes fort. ;) Je le révélerai ultérieurement !</em><br/></p>", "metacritic": null, "released": "2022-06-12", "tba": false, "updated": "2022-06-13T06:04:59", "background_image": "https://media.rawg.io/media/screenshots/f79/f7948a8d25798d210872d25edcef9541.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["Mossieur Patate"], "genres": ["Action"], "publishers": [], "esrb_rating": null}