{"id": 80121, "slug": "crazy-basketball-hd-multiplayer", "name": "Crazy Basketball HD ★★★MULTIPLAYER★★★", "name_original": "Crazy Basketball HD ★★★MULTIPLAYER★★★", "description": "☆☆WITH GAME CENTER MULTIPLAYER☆☆ <br/><br/>☆Crazy Basketball game for the iPad gives you a fun and different way to play basketball a using physics engine. Just Fun and Simple☆ <br/><br/>Crazy Basketball have a physical engine, interesting backgrounds with Hundreds of animations and dozens of achievements. <br/><br/><br/>☆FEATURES☆ <br/>Different Balls with different stats! Football, Golf, Tennis, Bowling and Alien dude! <br/>- 6 Maps with free map! <br/>- 6 Line Colours! <br/>New Game Modes: <br/>Crazy Mode and unique Sniper Mode with dozens of levels! <br/>Hoops Mode with 3 point 2 point and 1 poin Hoops! <br/><br/>GAMEPLAY: <br/>The game features simple touch and drag controls and realistic physics. Tap and drag anywhere on the dotted line to change the power and angle of your shot and release to shoot <br/><br/>★PLAY WITH FRIENDS! LOCAL AND GAME CENTER GLOBAL MULTIPLAYER!★ <br/><br/>☆iOS 4.1 Support + Game Center! <br/>☆Intuitive touch-screen controls are easy to pick up and play for the whole family. <br/>☆Unlimited Gameplay and entertaining free updates! <br/>☆STATS, you can know your: Total shots, Total goals, Total misses et c. <br/>☆Bonuses: 7 in a row bonus - Full Line, accuracy and Long shot Bonus, 8 in a row bonus - 2x Scores!! <br/>☆Slow Motion! <br/><br/>☆TRY☆ <br/>*Online and offline high-scores, competition system for your friends or other players <br/>*Realistic physical engine <br/>*Dozens of achievement and Hundreds of animations and 1000 OpenFeint points. <br/>*Captivating Gameplay for every age <br/>*Send your high-score at Facebook and Twitter <br/><br/><br/>☆☆☆☆☆☆ <br/>Your account will not be debited for retrying operation at In App Purchse. When you retry downloading the content you will get the message that You've already purchased this,Tap OK to download it again for FREE. <br/>☆☆☆☆☆☆", "metacritic": null, "released": "2010-05-20", "tba": false, "updated": "2019-10-22T14:22:59", "background_image": "https://media.rawg.io/media/screenshots/e21/e21389a95ee70e22c424d5387f7516e6.jpg", "website": "http://yogamen.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YOMEN"], "genres": ["Sports"], "publishers": ["Demis Mezirov"], "esrb_rating": "Everyone 10+"}