{"id": 801345, "slug": "demonschool", "name": "Demonschool", "name_original": "Demonschool", "description": "<p>Demonschool is a new-style tactics RPG where motion equals action. Defeat big weirdos in between the human and demon worlds as Faye and her misfit companions, while navigating university life on a mysterious island.<br />\nTactics: Rewind any action during the planning phase and create combos to dispatch your foes.<br />\nStory: A light horror narrative told through huge avatars with side quests aplenty.<br />\nSchedule: Plan your school schedule to level your characters and build their skills.<br />\nFriendship: 15 characters with whom to build relationships.<br />\nUnits interact contextually with their environment. Enemies will be struck, objects moved, or the character will simply dash.<br />\nPlan movements at your leisure, and execute them all at once. You can also rewind actions during the planning phase.<br />\nBuffing friendlies and debuffing enemies compounds damage output. Note the damage numbers!<br />\nCombos do big damage and produce unique elemental attacks, which you can use to exploit enemy weaknesses.<br />\nExplore a mysterious island that reveals its mysteries morning, noon, and night, day by day, week by week, across a university semester. Plan your team&#39;s schedule to enhance their skills and gain new abilities. Gain new teammates and enhance their relationships depending on who you choose to pursue.</p>", "metacritic": null, "released": "2022-06-12", "tba": false, "updated": "2022-06-13T10:36:46", "background_image": "https://media.rawg.io/media/screenshots/5a2/5a28cf229c037557b32d777271e11c24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 475, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Necrosoft Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}