{"id": 80135, "slug": "ice-fishing-derby", "name": "Ice Fishing Derby", "name_original": "Ice Fishing Derby", "description": "NOTE: There was a bug in version 1.09 that kept the game from starting  This is fixed in version 1.10.<br/><br/>The free version of Ice Fishing Derby: It's a five day fishing derby with a twist.  The forecast for the first day is pretty nice, but it's going to get much, much colder as the days go by.  Start each day at the bait shop to get the tackle you need.  Catch bluegills, crappie, perch, walleyes and northern pike.  At the end of each day you'll collect cash at the weigh-in for the fish you've caught.  Be sure to earn enough to pay for a portable shelter and heater or you're not likely to survive.  Start with some basic gear and catch some panfish, then work your way up to catching the bigger fish.  Once you have the necessities you might get yourself a sonar flasher or even an underwater camera system so you can see what's happening under the ice.  Your goal is simple: Survive the tournament, and earn as much money as possible.  Other fishermen may offer you some interesting trades out on the lake, but be careful what deals you accept!<br/><br/>The game is free but in-app purchases unlock a few items in the bait shop and give you the option of starting each tournament with more money.<br/><br/>Note: Some people have had problems running the previous version of the game due to a bug in iOS 8.0.  Either updating your device to iOS 8.1 or updating the game to 1.06 should fix it.  If you have any trouble with the game, please email us at support@pishtech.com and we'll be happy to help.", "metacritic": null, "released": "2014-11-05", "tba": false, "updated": "2019-07-30T16:01:27", "background_image": "https://media.rawg.io/media/screenshots/193/1935ae5a0ea92764e09d52ca06a7927f.jpg", "website": "http://www.pishtech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pishtech"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Paul Halter"], "esrb_rating": null}