{"id": 80145, "slug": "us-basketball-multiplayer", "name": "US Basketball - MULTIPLAYER", "name_original": "US Basketball - MULTIPLAYER", "description": "☆☆☆WITH GAME CENTER MULTIPLAYER☆☆☆<br/>Become basketball star wherever you go! <br/><br/>When there is no opportunity to play real basketball, enjoy virtual US Basketball! <br/>Who says that basketball can be played just with basketball on the sports ground? Compete with your friends on the screen of your devices using various spherical objects with unique characteristics – bowling and billiard balls, and even symbolic ball characters. <br/><br/>Take the most comfortable ball and set up records! <br/>Playing basketball visit famous places of the USA! <br/>A huge amount of achievements, bonuses, fantastic modes and even online – multiplayer are waiting for you in US Basketball. <br/><br/>★Real men’s fun! <br/>Due to our game you can make strategy both for sport games and way of life. You will learn to make decisions and be responsible for them. Our game will help you to become persistent, to come up to your goals, to share your powers correctly. <br/><br/>★ADDITIONAL FEATURES: <br/>Gained points will expand the choice of places which you dream to visit, colour design and create conditions for additional skills. Everyone can find something for his taste! <br/><br/>This game continues well-known “Crazy Basketball” which was previously released to the world championship in basketball and having won enormous popularity.<br/><br/>★PLAY WITH FRIENDS! LOCAL AND GAME CENTER GLOBAL MULTIPLAYER!<br/><br/>★ACHIEVEMENTS   <br/>USA Basketball will absorb you for a long time with a lot of possible achievements, some of them will require efforts from you.   <br/><br/>★ADDITIONAL FEATURES  <br/>Select locations, line color and balls. Everybody will find something to his taste. The update will bring more new opportunities.<br/>√Detailed maps each with its unique features!<br/>√Every ball has its own unique stats!<br/>√RARE H.O.R.S.E. Mode with multiplayer!<br/>√Bonuses and Skill upgrades!<br/>√Original Music and sound effects!<br/>√iOS 6.0 Support + Game Center!<br/>√Intuitive touch-screen controls!<br/>√STATS, you can know your: Total shots, Total misses, Total Goals, Total First Strikes, Total accuracy shots, Total Long Shots.", "metacritic": null, "released": "2011-03-23", "tba": false, "updated": "2019-10-22T14:23:00", "background_image": "https://media.rawg.io/media/screenshots/80f/80f0e3e2252034e1f4ab5527da6435f6.jpg", "website": "http://yogamen.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["YOMEN"], "genres": ["Sports", "Arcade"], "publishers": ["Demis Mezirov"], "esrb_rating": "Everyone 10+"}