{"id": 801472, "slug": "warriorssnuggery", "name": "WarriorsSnuggery", "name_original": "WarriorsSnuggery", "description": "This Page is still under construction!\r\nFor further information, please take a look at the Warrior's Snuggery Wiki!\r\nQuick Overview\r\n<p><em>!!! The story line is yet to be implemented. !!!</em></p>\r\n Warrior's Snuggery is a pixelart top-view shooter about a  shapeshifter trying to free the overworld from other bad creatures. The  player fights through different levels, battling with bosses, slowly  approaching the one that controls it all. During gameplay, new spells  and creatures can be unlocked and trophies are to be collected. Almost  every part of the world can be destroyed and the game is completely  moddable.\r\n\r\nBackground\r\n<p>Warrior's Snuggery originally was a tiny experiment to learn about  programming, graphics and creating games. However, it developed to a  fully moddable game with a lot of features. Every release, new mechanics  get added or old ones get improved. If you want to participate, really  don't hesitate to ask questions!\r\n</p>\r\nCurrent Release: Release 2.7<br/>\r\nRelease Notes\r\n<p>This  release, we do finally add some more gameplay. But along with new  (slimy) enemies, improved effect tree and mana distribution, some new  notable (and visible!) features have been implemented.\r\n </p>\n<ul><li>A new screenshaker lets you feel the vibration of an explosion close nearby.\r\n</li><li>Lighting is now properly implemented, which means you can see the  glow of spider eyes in the dark as well as the fire warming your hands.\r\n</li><li>Added a new effect that allows you to draw health from other enemies\r\n</li><li>A new weapon, as seen on the crab\r\n</li></ul>\n<p>In addition to that, the full OST of Warrior's Snuggery is now available (SoundCloud). Because it's not entirely clear yet how to include the music into the game, a separate mod package (more music) is downloadable below. Copy it into the mods folder and activate it ingame. Enjoy the new pieces after a fresh restart and in the later maps of the game!\r\n </p>\n<p>For modders: Along with those changes, modding support is now  properly implemented! This means you can easily modify the game  structure via standalone files and enable/disable mods as you like in  the ingame settings (although a restart is still required). To  understand the changes, you may also head over to the Modding Guide,  which has been refreshed a bit (although it's still incomplete). In  addition to the base game, there are also three example mods you can try  out and look into (which you can do regardless of the intention to mod  the game, because we all love rainbow lasers on crabs).\r\n A new Documentation page  helps you to directly navigate in-browser and without the need to  generate the document on your own. Also, a proper list of contents now  helps you navigate the documentation.\r\n </p>\n<p>And finally, for our <strong>Linux friends</strong>: Linux support is back again! You may try out the release and find some more issues to fix.\r\n For <strong>Mac users</strong>: hang in there, Apple is complicated and so is the dotnet  building system. It may still take a while till there is proper  support. A release build is included, yet it probably doesn't work. Yay.\r\n </p>\n<p>Along with all those changes, some bug fixes and minor improvements were made. You can have a look at the full list here.\r\n </p>\n<p>If you encounter any bugs or crashes regardless of the operating  system or you just want to share a new idea, don't hesitate and open an issue!\r\n</p>\r\nSource code &amp; further details (Modding Guide, Release Notes, Cheats) available on  Github!", "metacritic": null, "released": "2022-06-12", "tba": false, "updated": "2022-06-13T07:17:38", "background_image": "https://media.rawg.io/media/screenshots/3fa/3fa47091df208b3bc2659bc7c6f4f250.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["abc013"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}