{"id": 801585, "slug": "honeymind", "name": "Honeymind", "name_original": "Honeymind", "description": "<p>This game was created for the Crunchy Jam, limiting an individual dev to make a game in only 4 hours! Honeymind is a honeybee-themed Mastermind logic game.</p><p><strong>How to Play</strong></p><p>The queen wants to test the hive to find the smartest bee in her court. Her favorite type of honey is made from a specific mixture of flowers. It's your job to guess which flower pollen she wants today and in which order.</p><p>There are 5 different types of flowers and 5 slots for ingredients, but its not that simple. Sometimes she likes more of one flower than the others.</p><p><strong>Controls</strong></p><p><strong>Press LEFT and RIGHT </strong>to move to the next slot.</p><p><strong>Press UP and DOWN </strong>to change the flower type in the slot.</p><p><strong>Press X</strong> to submit the current pattern as your guess.</p><p>Don't worry, the queen doesn't just leave you guessing forever, she is happy to give you hints along the way. </p><p><strong>Hints</strong></p><p>After you click X to submit your guess, you will move up to the next row and so will the queen, after she leaves behind some hearts to tell you what she likes about your guess.</p><p><strong>No hearts</strong> = wrong flower completely</p><p><strong>White hearts</strong> = correct flower but an incorrect position</p><p><strong>Red hearts </strong>= correct flower in the correct position</p><p>You don't know which flower or which position she is talking about, you only know how many are correct by how many hearts she leaves. </p><p>This is where the logic comes into play! The more guesses you make, the more hints will help reveal the queen's secret pattern on top.<br/></p><p><strong>Win / Lose</strong></p><p>Win by guessing the queen's favorite honey recipe by guessing the exact same pattern she likes.</p><p>Lose by incorrectly guessing 6 times, and the pattern will be revealed. That's fine, her favorite honey changes with the wind, so you can try again!</p>", "metacritic": null, "released": "2022-06-12", "tba": false, "updated": "2022-06-13T07:58:16", "background_image": "https://media.rawg.io/media/screenshots/49b/49b798d5207af5622dcf5b2e9f289b49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nerdy Teachers"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}