{"id": 801584, "slug": "total-factory", "name": "Total Factory", "name_original": "Total Factory", "description": "<h3>Game under active development:</h3><ul><li>Total Factory is still in active development, but it is not an early access or alpha version of the game.<br/></li><li>All 8 stages of development are ready in the game, however, their balancing and changes can still happen. Yes, you can go through the game from the beginning to its logical end.<br/></li><li>Clean gameplay is already there for about 20 hours.<br/></li><li>The game is being polished, many game moments are being finalized and improved, starting from the menu and ending with the assembly machine.</li></ul><h3>Game description:</h3><strong>You</strong> are a robot with unrealistically advanced artificial intelligence on a previously unknown planet, people created you for one single purpose - to ensure the automatic production of the necessary resources and their dispatch. It would seem that what could go wrong?<br/><br/>You start the game from your base, your creators - the CosmoDoc Corporation - gave you the starting amount of the necessary resources and a couple of robots to protect your base from enemies.<br/><br/>Complete tasks from the task center to unlock new machines for automation and advance further in the game.<br/><br/>In the game, you can not only automate your factory, but also ensure its protection with the help of automatic turrets and allied robots.<h3>Game Features:</h3><ul><li>Quite a large procedural generated world<br/></li><li>Upgrade system<br/></li><li>Combat robots and robots engineers<br/></li><li>4 different biomes: Tundra, Meadow, Desert and Jungle<br/></li><li>More than 150 different game items<br/></li><li>Dynamic change of day and night<br/></li><li>Mining<br/></li><li>Growing and caring for vegetables and fruits grown from seeds<br/></li><li>Protection of your factory from enemy units ready to destroy everything in their path<br/></li><li>6 types of mined ore: Iron, Aluminum, Copper, Gold, Coal, Quartz<br/></li><li>Supply electricity to automated machines with solid fuel generators, the game has a whole power grid system, don't forget to take the wires!<br/></li><li>There are many machines in the game to automate the process, ranging from the simplest conveyor belt to an assembly machine<br/></li><li>Isometric graphics</li></ul>", "metacritic": null, "released": "2022-06-10", "tba": false, "updated": "2022-09-30T05:12:18", "background_image": "https://media.rawg.io/media/screenshots/db1/db1bae9f392742c8564ea1f2f9fdd815.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Total Craft Games", "TotalCraftGames"], "genres": ["Action", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Total Craft Games"], "esrb_rating": null}