{"id": 80165, "slug": "multiplayer-for-minecraft", "name": "Multiplayer for minecraft", "name_original": "Multiplayer for minecraft", "description": "### Play Minecraft PE multiplayer online with other players from around the world ###<br/><br/>New: Public IP for your Minecraft PE server. Share your server to other Minecraft players without our app.<br/><br/>Very SIMPLE and EASY HOST or JOIN local WiFi games.<br/>Server registration is not required.<br/>Only app which support up to 5 players for Minecraft PE (5 players is Minecraft limit).<br/><br/>Using this application connect to centralized network (Open Game Network) and feel like in one big local WiFi network. <br/>Application will help to find other multiplayer game players. <br/><br/>Create server: <br/>- VERY SIMPLE. Open Game and play your multiplayer game as game owner. Your game will be visible to other Open Game Network users. <br/>- Server registration is not required <br/>- Host server from WiFi and 3G <br/><br/>Join server: <br/>- Join to other games directly from your game. Other games will be visible as local WiFi games<br/>- Join servers from WiFi <br/><br/>- no additional costs <br/>- Chat with other Open Game Network users <br/><br/><br/>Currently application supporting such games:<br/>- Minecraft Pocket Edition<br/>- Ashphalt 8<br/><br/>In the future we will add more supported games.<br/><br/>Important information!!!<br/>- Our app is using VPN (Virtual Private Network) connection. VPN configuration profile is included. Installation of profile is easy. You need to be sure that your Internet connection allows VPN connections.<br/><br/>Buying our application you will get:<br/>- Access to Open Game Network infrastructure to play local WiFi games over internet (supported games listed in our homepage)<br/>- Chat with other Open Game Network users<br/><br/>Disclaimer – this app is not related with Minecraft game and developers of Minecraft game.", "metacritic": null, "released": "2013-12-31", "tba": false, "updated": "2019-07-30T03:20:44", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe43075cd78d2e061919ab503e7400d7.jpg", "website": "http://ogn.mozello.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["OGN"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["OGN SIA"], "esrb_rating": null}