{"id": 80166, "slug": "bliss-lite-a-game-for-lovers", "name": "Bliss Lite - A Game for Lovers", "name_original": "Bliss Lite - A Game for Lovers", "description": "Bliss Lite, the Game for Lovers, is a romantic game for a couple in love to play in bed. Unlike many adult oriented computer games, Bliss emphasizes romance and intimacy rather than blatant sexuality.<br/><br/>Bliss Lite uses advanced computer technology to adapt itself to your personal romantic preferences. Bliss keeps track of:<br/>  • your favorite background music<br/>  • your romantic preferences<br/>  • even what you are wearing<br/>to give you and your lover a surprising new experience in lovemaking!<br/><br/>Bliss Lite is played much like a board game. Each turn, you roll the dice and move around the board. When you arrive at a space on the board, you will be given an action to do. Bliss chooses an action for you based on the space you landed on, what you are wearing, how long you have been playing the game, what toys you have available, and other factors. As the game progresses so do the actions. Bliss is the world's first intelligent romantic game for lovers!<br/><br/>Bliss Lite features:<br/>  • Over 500 built-in actions<br/>  • Add your own favorite mood music from your music library or enjoy the built-in songs<br/>  • A beautiful wood game board or use your own photo<br/><br/>The full version of Bliss - The Game for Lovers has even more features:<br/>  • Over 700 built-in actions<br/>  • Additional actions available for purchase and for free<br/>  • Nearly 60 clothing options<br/>  • Over 25 toys<br/>  • Two more passion levels, Volcanic and Nuclear<br/><br/>Bliss is based on the popular PC game available at gamesforloving.com.  What people have said about Bliss:<br/><br/>\"…so up my alley, it's hard to write a column about it because I'm too excited. I fidget in my chair and can't think of any words to describe my thoughts without sounding like a marketing copywriter.\"<br/>  - wired.com<br/><br/>\"…a labor of love that sets it apart from anything similar… Any (heterosexual) couple looking for romantic play… will be hard-pressed to find a more robust application.\"<br/>  - download.com<br/><br/>\"…We’re already recommending this game to every couple we know, and we have a few copies planned as anniversary gifts. You owe it to yourself and to your spouse to try this game… it will make such a difference.\"<br/>  - Cozy Romance Newsletter<br/><br/>\"I would recommend that any couple who wants to reconnect, spice things up, try something new or just have a bit of fun try this out. It is funny, silly, sensual and romantic.\"<br/>  - JaneW &amp; R, married 8 years", "metacritic": null, "released": "2011-06-06", "tba": false, "updated": "2019-08-02T03:42:56", "background_image": "https://media.rawg.io/media/screenshots/54b/54b13070437061df87182fdb5c6c63e2.jpg", "website": "http://www.gamesforloving.com/iBlissDetails.aspx", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Games for Loving"], "genres": ["Board Games"], "publishers": ["Games For Loving"], "esrb_rating": null}