{"id": 80173, "slug": "spot-it-duel", "name": "Spot it Duel", "name_original": "Spot it Duel", "description": "Gotta match 'em all!<br/><br/>The game officially transposed from Spot It!, the famous symbol-matching card game. In Spot It! Duel, match symbols to build combos with the help of your Dobble friends and his powers. Go through short, intense games against other players to earn the most points and get to the top of the leaderboards! Play with friends, family and other players worldwide in multiplayer or Special Events!<br/><br/>PLEASE NOTE! Spot It! Duel is free to download and play; however, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings. <br/>A network connection is required for play.<br/><br/><br/>GAMEPLAY: A FANTASTIC FRENZY<br/><br/>The game's principle is easy to understand. Each player has a disc filled with symbols. Your goal is to match similar symbols between discs to make them disappear and score points. But hurry, your opponent can also match symbols on your disc and ruin your flow! Choose the symbols you're matching wisely and you'll build up combos, granting you even more points. Find the right balance between strategy and speed and reach record breaking scores!<br/><br/>WORLDWIDE ARENA<br/><br/>Duel your friends or battle against players worldwide! With the multiplayer game mode, you can select any opponent and challenge them to a duel! A Dobble trained and customized by your opponent will fight back until the best player comes out ahead! Go to tougher and tougher arenas filled with more ferocious adversaries as your reflexes and skill increase and you climb the worldwide leaderboard claiming greater rewards. Special events with unique rules and rewards will give you opportunities for varied play!<br/><br/>BUILD A LARGE COLLECTION OF DOBBLE CHARACTERS TO HELP YOU ON YOUR WAY!<br/><br/>You can get your hands on Dobble characters with unique skills to sharpen your strategy and change up your game style!<br/><br/><br/>SHARPEN YOUR REFLEXES IN CHALLENGE MODE<br/>Re-discover the classic Spot it! sensation in Challenge Mode! Train your Dobbles and get special rewards as you master new rules with increasing levels of difficulty.<br/><br/><br/>FEATURES<br/>• Quick-paced, addictive gameplay inspired by the original Spot It! card game<br/>• Duel players from around the world <br/>• Unlock rewards and collect Dobble characters and upgrade their multiple powers<br/>• Construct the ultimate collection of Dobble characters to defeat opponents<br/>• Progress through multiple arenas all the way to the top<br/>• Participate in special events offering original gameplay and duels. Win to unlock rewards!<br/>• Re-discover the classic Spot it! game in Challenge Mode!<br/><br/>To find more information about Asmodee Digital, please go to: http://www.asmodee-digital.com/<br/><br/>Having an issue? Looking for support? Please contact us: https://asmodee.helpshift.com/a/spot-it-duel---a-dobble-game/<br/><br/>You can follow us on Facebook, Twitter, Instagram and You Tube!<br/><br/>Facebook: https://www.facebook.com/asmodeedigital/<br/>Twitter: https://twitter.com/asmodeedigital<br/>Instagram: https://www.instagram.com/asmodeedigital/<br/>You Tube: https://www.youtube.com/asmodeedigital<br/><br/>Languages available: English, French, German, Dutch, Italian, Spanish, Portuguese (Brazilian)", "metacritic": null, "released": "2017-06-28", "tba": false, "updated": "2019-07-30T07:10:45", "background_image": "https://media.rawg.io/media/screenshots/2a7/2a7a5d2f1162c94e4772c1b7028500b6_PPCmgYa.jpg", "website": "http://www.asmodee-digital.com/spotitduel", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Asmodee Digital"], "genres": ["Board Games", "Card"], "publishers": ["Asmodee Digital"], "esrb_rating": null}