{"id": 80179, "slug": "batter-up-baseball-the-classic-arcade-homerun-hitt", "name": "Batter Up Baseball - The Classic Arcade Homerun Hitting Game", "name_original": "Batter Up Baseball - The Classic Arcade Homerun Hitting Game", "description": "“Fun Home Run Derby style game, good graphics and extra surprises when you hit lights and such, attention to detail as usual from Skyworks.  Overall: Another winner from Skyworks. Realistic and quite fun and addicting”<br/>BuyMeAniPhone.com<br/><br/>“Where Batter Up Baseball scores is in the details. When you hit a target there’s always some sort of reaction… Hitting a light is actually location sensitive, so the part of the lights you hit actually go out instead of the whole thing. My favorite effect of all, however, is the flaming bat when you’re “on fire”… From the crack of the bat against the ball to the clunk when the ball fell short and hit the wall, everything sounded right.  As a result, Batter Up Baseball scores a home run in my book.”<br/>Technobrains.com<br/><br/>------------------------------------------------------<br/><br/>Always thought you were major league material? Then suit up and hit the field with BATTER UP BASEBALL™ from Skyworks®, creators of the best quality and most fun sports and arcade games on the iPhone/iPod touch!<br/><br/>To bat, tap screen on top and drag your finger down (but not below the game picture area).  Red lights will turn green, and a pitch will come your way. Hit the pitch by flicking your finger up.  Once the ball is in flight, you can influence its direction and speed using the accelerometer by tilting up/down or left/right! \u2028\u2028<br/><br/>KEY FEATURES:\u2028\u2028<br/>- HOME RUN RALLY MODE – Swing for the fences as many times as you can!\u2028<br/>- ARCADE MODE – Hit home runs while aiming for a variety of animated billboards!<br/>\u2028- FULLY 3D REAL-TIME RENDERED BALLPARK AND BATTER<br/>\u2028- ACCELEROMETER CONTROL – Influence the ball’s flight over the fence!<br/>\u2028- FULLY ANIMATED BONUS TARGETS – Hit these to earn extra swings!\u2028<br/>- SOUND VOLUME CONTROLS<br/>\u2028- LOCAL HIGH SCORE BOARDS\u2028\u2028<br/><br/>After you play BATTER UP BASEBALL, try FIELD GOAL FRENZY™ FOOTBALL and other hit titles from Skyworks, including ARCADE HOOPS BASKETBALL™,GOAAAL! SOCCER and ARCADE BOWLING™. Or, just search for “Skyworks” in the App Store search bar, find your favorite games, and have fun!!! <br/><br/>\u2028\u2028Look for more new games from Skyworks COMING SOON! \u2028<br/><br/>Skyworks – Find YOUR Game!", "metacritic": null, "released": "2009-03-27", "tba": false, "updated": "2019-10-22T14:23:00", "background_image": "https://media.rawg.io/media/screenshots/103/10350fa563514d3e398adb1d181c1549.jpg", "website": "http://www.skyworks.com/iphone/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Skyworks"], "genres": ["Simulation", "Sports"], "publishers": ["Skyworks Interactive"], "esrb_rating": "Everyone 10+"}