{"id": 801842, "slug": "warhammer-40000-rogue-trader", "name": "Warhammer 40,000: Rogue Trader", "name_original": "Warhammer 40,000: Rogue Trader", "description": "<p>You will take on the role of a Rogue Trader, a scion of an ancient dynasty of daring privateers, that reign over their own merchant empire and explore the fringes of Imperial space with the blessing of the Emperor Himself. Thanks to their Warrant of Trade - the Rogue Trader is endowed with privileges and power beyond imagination as well as the task of expanding the borders of the Imperium. At their disposal is a gargantuan voidship of immense power and innumerable servants and personnel ready to do the bidding of their lord. Their adventures begin in the vast Koronus Expanse - a treacherous region of unexplored space at the edge of Humanity’s domain.</p>\n<p>Exploration will bring the protagonist to mysterious lost and forgotten worlds as well as numerous planets claimed by humanity - from lush Agri-Worlds to steel-clad Forge Worlds, all of them ready to be claimed for your burgeoning merchant empire or plundered for their riches. While travelling between the stars, get ready to come across potential allies and dangerous enemies of the Imperium, Chaos cults and alien Xenos counting among the most treacherous and deadly.</p>\n<p>You will make fateful decisions that affect the lives of entire worlds. You will prove your strategic and tactical skills in high-impact turn-based battles against powerful opponents.</p>\n<p>No Rogue Trader travels alone: on this dangerous journey into the unknown, you will meet faithful and sophisticated companions. Imagine fighting alongside a mighty power armoured Space Marine, a lethal Aeldari Ranger, or even a courageous Sister of Battle armed with bolter and ardent prayer - these characters and many others will join you. Become a Rogue Trader endowed with great authority, discover new worlds and shape the future of the Imperium! Join this fantastic story!</p>", "metacritic": null, "released": "2023-12-06", "tba": false, "updated": "2024-04-22T16:29:16", "background_image": "https://media.rawg.io/media/games/edf/edf3bd3ffa486f5d6a84bda020765839.jpg", "website": "https://roguetrader.owlcat.games/", "rating": 4.16, "rating_top": 5, "added_by_status": {"yet": 21, "owned": 60, "beaten": 10, "toplay": 76, "dropped": 11, "playing": 14}, "playtime": 7, "achievements_count": 51, "ratings_count": 25, "suggestions_count": 398, "game_series_count": 39, "reviews_count": 25, "platforms": ["PC", "macOS"], "developers": ["Owlcat Games"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Owlcat Games"], "esrb_rating": null}