{"id": 801944, "slug": "i-am-future", "name": "I Am Future", "name_original": "I Am Future", "description": "<p>Many years has passed since the civilization collapsed. A city, once modern and alive, is now flooded and overgrown. Only the roofpoints stand above the water like small islands, and the billboards are overgrown with grass and trees. The nature took its toll: wild animals and birds are the new citizens. But when the night falls, the unseen fantastic creatures come, and bring the threat.</p>\n<p>One lovely day you find yourself on the roof of one the skyscrapers. It looks like there’s not a living soul around. But who said that the post apocalypse has got to be a dire place where you only fight for survival? Why don’t you start a new life, arranging yourself a home with the most fantastic view you can imagine?<br />\nFeatures<br />\nTurn the abandoned roof into your a big and cozy home</p>\n<p>Starting from the scratch on an empty roof, explore the surroundings, find the necessary resources, tools and gadgets. Step by step, build yourself a complicated multi-purpose base for work and for recreation - a custom place that would suit personally you and and your needs!</p>\n<p>Create the necessary gadgets out of ancient home appliance</p>\n<p>Old microwaves, rusty cars and antique computers - all will be handy! Carefully disassemble the devices to get the necessary details and put them to use for creating futuristic gadgets according to the blueprints you’ll get you hands on. By the way, have we mentioned that you will get to have a cyborg hand? Upgrade it too!</p>\n<p>Build the automated helpers and turn your buildings into sentient beings<br />\nMake some friends so you won’t get too lonely! Upload the AI to your buildings, talk to them, listen to their thoughts, concerns and advices, and develop the relationships! Or build yourself some pet drones - besides everything, they will be useful to automate the routine tasks.</p>\n<p>Go fishing, pick up farming and cooking</p>\n<p>The benefits of the collapse of human civilization? There’s now enough time to pick up new hobbies! The roof is very well suited for building a garden, and the surrounding sea is full of tasty fish for the tastiest Mediterranean dishes to cook!</p>\n<p>Protect your base</p>\n<p>It seems that the nature has changed significantly after all, and there are new dangers not known to humans before. Build your defense structures and be catious!</p>\n<p>Explore the sunken city and its mysteries</p>\n<p>What exactly happened with the civilization and how did you end up on the roof? The answers lay somewhere in the city ruins - would you try to get to the bottom of it?</p>", "metacritic": null, "released": null, "tba": true, "updated": "2024-01-04T11:30:35", "background_image": "https://media.rawg.io/media/screenshots/7c6/7c6fb6f663e625b63c4464e585406a9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5, "beaten": 1, "toplay": 7}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Mandragora"], "genres": ["Adventure", "Strategy"], "publishers": ["tinyBuild"], "esrb_rating": null}