{"id": 801968, "slug": "great-houses-of-calderia", "name": "Great Houses of Calderia", "name_original": "Great Houses of Calderia", "description": "<p>Great Houses of Calderia is a modern and accessible grand strategy game where you’ll have to lead your family through multiple generations, building its legacy of power in Calderia, a fantastic land full of legends and myths.</p>\n<p>You are not controlling a leader alone, you have also to manage the members of your family like the rulers of yore!<br />\nManage your house leaders and their unruly families through their own stories and wishes.<br />\nAppoint and manage your family members to key tasks against their will or not.<br />\nTake into consideration traits and personality of each character to get the best from them.<br />\nCharacters’ personalities and traits change over time and events that have occurred to them.</p>\n<p>Take the critical decisions during battles and major diplomatic events such as marriages, jousts, etc. to gain every advantage over your rivals to become the Greatest House of Calderia!<br />\nManage battles through the Real-time tactical resources management system.<br />\nAllocate resources in diplomacy and intrigue as well as social events.<br />\nSpend an equal amount of time managing diplomatic challenges and wars.</p>\n<p>Discover the fantastic land of Calderia, its legends and myths, shape it with your actions and generates endless stories<br />\nDefine the traditions, values and goals of your family. You have unlimited possibilities.<br />\nExperience the personal stories of your extended family and their descendants and see your reputation grow.<br />\nChange the world mythos and give new names to the places where your family has left their mark (battle/event…).</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-09-01T02:37:03", "background_image": "https://media.rawg.io/media/screenshots/154/15400ea022d788f66da8bf728f90a2c0.jpg", "website": "https://calderiagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Resistance Games"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Firesquid", "Firesquid Games"], "esrb_rating": null}