{"id": 802172, "slug": "sarkos", "name": "Sarkos", "name_original": "Sarkos", "description": "<p><strong>Nominated in Swedish Game Awards for GOTY 2022, BEST DESIGN 2022 and BEST AUDIO 2022!!</strong><br/></p>\n\n<p>“Sarkos has been on Earth for millions of years slaughtering anyone foolish enough to enter his dungeon, but now he's getting bored and is ready to leave. But first! There's more delicious souls to harvest. Become the Overlord in this deckbuilding autobattler game where being evil never felt more satisfying - or been as fun.”<br/></p>\n<p>Sarkos is a card based strategy game where you get to build your own dungeon and play as the bad guy. Your goal is to defeat the parodic heroes who have traveled the world to fight you. With their poor human souls as a currency, you buy trap rooms and monsters to help you. There are plenty of room and monster cards to choose from and as you progress in the game, even more options reveal themselves. How you make the heroes suffer is up to you! Acid, explosions, blood sacrifice… or are you more of a gambler? Then maybe the Casino Room will be part of your favorite combo!</p>\n\n\n<p><strong>Team:</strong><br/></p>\n<p>Albin Pettersson - Game Design <br/>Felix Sandegren - Game Design<br/>Clara Karlsson - Graphics <br/>Emmanuella Olomina - Graphics <br/>Katarina Andrijevic - Graphics <br/>Michael Rådström - Game Writing <br/>Carl-Vilhelm Johansson - Programming <br/>Jesper Larsson - Programming <br/>Martin Weidenborn - Music <br/>Julia Siljebo - Sound Design</p>", "metacritic": null, "released": "2022-06-10", "tba": false, "updated": "2022-06-13T11:33:21", "background_image": "https://media.rawg.io/media/screenshots/93f/93fb7c109f7a51e81df19f55b6d0b383.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LuckyThirteenGames"], "genres": ["Action"], "publishers": [], "esrb_rating": null}