{"id": 80215, "slug": "yardmaster-the-train-game", "name": "Yardmaster - The Train Game", "name_original": "Yardmaster - The Train Game", "description": "All Aboard! Can you run the control box of this busy train yard? <br/><br/>Reviews:<br/><br/>\"Yardmaster does for trains what Flight Control did for planes and Harbor Master did for boats.\"<br/><br/>\"All aboard! Great game! Super addictive. The kids mode is brilliant!\"<br/><br/>\"Excellent game play... Love it!\"<br/><br/>\"It is obvious that this game was made by train enthusiasts, the look and feel of everything surrounding the game is fantastic...\"<br/><br/>Keep your wits about you and wrap your head around the serpentine track changes or face a train wreck! <br/><br/>Using the simplest of controls, your job is to direct the train engines back to their sheds. It's easy to learn, but hard to become a master. Match the train color to the shed color or else the mayhem and madness will begin! <br/><br/>You won't be able to resist the highly addictive gameplay, as well as trying to beat your high score! <br/><br/>Want to keep those junior yardmasters happy for hours? Try \"Kids\" mode to let the fun continue indefinitely! <br/><br/>Don't delay, hop aboard the latest iPhone sensation right now - destination: fun! <br/><br/>How to play: <br/><br/>Tap the railroad crossings to allow the trains to change tracks. Tap a train to pull the emergency brake, but watch out: those drivers get impatient! <br/><br/>As you prove your abilities, you will naturally be rewarded with more complex work. Be sure to avoid collisions, or you will be fired! If you need a coffee break, tap the pause button. Want to stoke that boiler? Tap the ffwd button. <br/><br/>Features:<br/><br/>Easy and fun solo gameplay<br/>A quick tutorial takes you right into the action<br/>Listen to your own music, with or without the delightful in-game sounds <br/>High quality graphics<br/>Share scores on Facebook", "metacritic": null, "released": "2009-08-07", "tba": false, "updated": "2019-10-22T13:54:20", "background_image": "https://media.rawg.io/media/screenshots/2ef/2ef9786b54b92a2a675c6136eef3c344.jpg", "website": "http://www.codito.ca/yardmaster", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Codito Development"], "genres": ["Action"], "publishers": ["Codito Development"], "esrb_rating": "Everyone 10+"}