{"id": 80232, "slug": "the-sims-2-pet-stories", "name": "The Sims 2: Pet Stories", "name_original": "The Sims 2: Pet Stories", "description": "<p>The classic The Sims 2: Pet Stories returns to the Mac, exclusively on the Mac App Store!<br />\nBased off of The Sims 2 engine, this updated version of The Sims Pet Stories includes several enhancements available for the first time on Mac:<br />\n• Native resolution support, including 4K and Retina!<br />\n• Drastically improved performance, thanks to an all new renderer<br />\n• Gesture Support for zoom and rotate<br />\n• Tons of bug fixes and tweaks<br />\nThe Sims 2: Pet Stories invites your Sims to care for and train loveable but unpredictable pets. Take on a variety of challenges as you compete for 1st place in a local pet show. Learn to tame a variety of pet personalities. You even unlock rewards along the way as you achieve set goals.<br />\nThe Brand-New Pet Show - Your Sims can train their pets to strut their stuff and earn rewards by getting them to navigate an agility course, including walking along a see-saw, running through tunnels, and jumping over obstacles.<br />\nOpen-Ended Freeplay Mode - You create your Sims and their pets (choose from 70 dog and 30 cat breeds), fulfill their desires or dash their hopes, and tell their stories.<br />\nTwo Complete Stories in Directed Story Mode - Play as Alice who needs to win the local Dog Show Competition (and the large cash prize) with her loveable dog Sam in order to save her house. Or follow Stephen, an executive chef whose highly predictable life is thrown into chaos when he’s forced to take care of his cousin’s spoiled cat, Diva.<br />\n• Additional information about The Sims 2: Pet Stories •<br />\nIf you encounter problems playing the game, please visit support.aspyr.com. Our Customer Support team is happy and eager to help. Your feedback helps us make better games.<br />\nIn order to run the game with satisfactory performance, your Mac must meet these minimum system requirements: 2.2 GHz CPU Speed | 4 GB RAM | 10 GB free disk space | (ATI): Radeon HD 3870; (NVidia): GeForce 8800 | (Intel): HD 3000 | 256 MB VRam<br />\nNOTICE: The following video chipsets are unsupported for The Sims 2: Pet Stories:<br />\n•ATI RADEON HD 2600 and older<br />\n•NVIDIA 8600m, 9400 and older<br />\n•Intel Integrated GMA 950<br />\n•Intel Integrated x3100<br />\nNOTICE: This game is not supported on volumes formatted as Mac OS Extended (CaseSensitive)<br />", "metacritic": null, "released": "2015-12-17", "tba": false, "updated": "2024-02-09T20:16:00", "background_image": "https://media.rawg.io/media/screenshots/568/5681d440f0df1ec30b876e996ac6f528.jpg", "website": "http://aspyr.com/games/the-sims-2-pet-stories?utm_source=MacApp&utm_medium=ProductLink&utm_campaign=the-sims-2-pet-stories", "rating": 3.89, "rating_top": 4, "added_by_status": {"owned": 2, "beaten": 5, "toplay": 1, "dropped": 4}, "playtime": 0, "achievements_count": 0, "ratings_count": 9, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC", "macOS"], "developers": ["Aspyr Media"], "genres": ["RPG", "Simulation"], "publishers": ["Aspyr"], "esrb_rating": "Teen"}