{"id": 802438, "slug": "uncharted-space-project-3062", "name": "Uncharted Space - project 3062", "name_original": "Uncharted Space - project 3062", "description": "We are planning to make a free and open strategy game, which has a rich gameplay and challenging stages.<br/>\r\nTo achieve this, we have designed the game mechanics in such a way that the game is easy to expand. We have also spared no effort to make the game more friendly to gamers who want to customize their own games and mod makers alike.<br/>\n<br/>\r\nIn the part we have already made, in the strategy section, you can:<br/>\r\nAchieve different ways of development through selecting and building various space stations. For example, you can obtain resources only through space exploration, rather than war; you can also achieve this through trades with other colonies; meanwhile, you can protect yourself through diplomatic method; you can, of course, get rich by warring with others, conquering other planets and plundering their resources with your carefully built army. <br/>\n<br/>\r\nIn the tactic section, you can organize different types of battleships into different groups and create different tactic teams through their unique divisions of work. Then you can set your battle formation to minimize the loses in a battle. Yes, every one of your ship counts. So it is best that you don’t lose any of them. To achieve this, careful tactic planning and skillful micro management are both crucial.", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-06-17T06:56:21", "background_image": "https://media.rawg.io/media/screenshots/797/79702b1d03ff547f0652a59c32b17847.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kong Linghui"], "genres": ["Strategy", "Indie"], "publishers": ["Kong Linghui"], "esrb_rating": null}