{"id": 802475, "slug": "tower-of-spirit", "name": "Tower of Spirit", "name_original": "Tower of Spirit", "description": "Explore mysterious lands, meet and recruit new characters, face many dangers and try to reach the Tower of Spirit !  <br/><br/>As you progress in a run, you will face a series of random encounters. There is different types of encounters: combat, discovery, and bonfire. Each offers unique challenges and rewards. When you reach a bonfire, you will have the opportunity to add a new character to your party and increase your chances to go further on the road.<br/><br/>The core game experience is implemented. It offers 3 playable characters, 26 emblems to collect and more than 20 types of encounters right now which already gives players a lot of combinations to create unique builds and synergies.<br/><br/> <h3>Features</h3><ul><li> Randomness and Choices Everywhere: Everytime you embark on this journey, you'll face new encounters, new enemies and discover new secrets! Choices matter a lot and depending on your situation, some will rush you into despair when others will grant you immense benefits.<br/></li><li> Not your typical group RPG: Gather a group of different characters met on your way and try new synergy each time! <br/></li><li> Experiment with Emblems: Those relics grant a variety of powerfull bonuses and abilities. But you cannot equiped them all! Choose wisely and adapt your strategy accordingly.<br/></li><li> Hand-drawn Universe: The world of Tower of Spirit is full of cute looking, creepy and wired characters and monsters, drawn and animated frame by frame in an old fashion 2D style!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-17T07:38:46", "background_image": "https://media.rawg.io/media/screenshots/07c/07c2db95c2dc6699a01f7b5206af65bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hookaria Games"], "genres": ["RPG", "Indie"], "publishers": ["Hookaria Games"], "esrb_rating": null}