{"id": 802449, "slug": "sophie-2", "name": "Sophie", "name_original": "Sophie", "description": "Sophie is a Metroidvania game that presents pixel art graphics and RPG characteristics driven by a deep, immersive, dramatical, and philosophical narrative. The game tells the tale of Sophie, the main character: a strong-minded girl that ventures through the kingdom of Sharam, motivated by silhouettes she believes to be hallucinations.<br/><br/>Amongst her adventures, the people of the kingdom start to be attacked by shadowy creatures that cause mysterious and incurable diseases. Sophie finds out that, for some reason, she’s immune to them, being the only one that can defeat the shadows.<br/>Due to her immunity, the kingdom starts growing suspicious as time goes by, believing all the traumatic events are her fault. Then, our protagonist will start searching for the reasons causing these events and solving the mysteries behind the monsters, her immunity, her supposed hallucinations, and her magic powers.<br/><br/><br/>The gameplay is paired with very detailed landscapes, emotional moments, and real-time battles to create an immersive and fun experience. The player’s free to decide what to do: exploring the kingdom, completing side quests, fighting to get stronger, or follow along with the main story, divided into eight chapters. Every chapter presents a major villain and the player will confront him in a unique, three-part battle. <br/><br/>An open-world environment makes room for unique characters, collectible items, and varying challenging puzzles. The very metaphorical narrative creates an emotional and mysterious atmosphere that is surrounded by possibilities and theories. The detailed and vivid art, only matched by an impacting soundtrack, will grant you the remarkable and immersive experience that Sophie’s tale has to offer.", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-17T07:08:26", "background_image": "https://media.rawg.io/media/screenshots/809/809edf6edb12549b438627f28375f025.jpg", "website": "https://www.youthgaming.com.br", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 318, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Youth Gaming"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Youth Gaming"], "esrb_rating": null}