{"id": 802468, "slug": "futanari-sex-the-birthday-massage", "name": "Futanari Sex - The Birthday Massage", "name_original": "Futanari Sex - The Birthday Massage", "description": "<p>About the game<br />\nAn explicit erotic visual novel about a sexy young woman treating herself with a very expensive massage for her birthday. But when she finds out her masseuse has a cock hiding in her pants, she can’t help herself and asks for a happy ending instead of a happy birthday.<br />\nVisual Novel Description<br />\nDelia Lopez might be alone in a new city, but that doesn’t stop her from making the best out of her twenty-first birthday.<br />\nShe buys the perfect dress, drinks the most perfect bubbly, and treats herself with an amazing massage at the most expensive parlor in town before calling it a night.<br />\nAt least that was the plan…<br />\nUntil she met her very skilled masseuse, saw the huge bulge hiding in her pants and couldn’t stop the crazy question from bursting out her lips : “ Does this massage come with a HAPPY ENDING? “<br />\nJenna Davis is a Professional Massage Therapist. She was trained by the best in the ancient forms of massage and knows how to help you get rid of the tensions and stress of the modern world.<br />\nShe’s highly skilled and very coveted by a long list of wealthy clients.<br />\nBut not a day goes by without some idiot crossing the line by asking for a happy ending, imagining she’s one of those girls willing to do anything for some extra cash.<br />\nWill Jenna get angry and kick the birthday girl out of her exclusive parlor for disrespecting her? Or will she give the young woman the happiest birthday ending instead?<br />\nFollow the story and find out…</p>", "metacritic": null, "released": "2022-06-13", "tba": false, "updated": "2022-06-20T11:18:56", "background_image": "https://media.rawg.io/media/games/807/807312ac8be10eb399cc7e4ec6ffe98c.jpg", "website": "http://www.exosyphen.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EroticGamesClub"], "genres": ["Casual", "Indie"], "publishers": ["EroticGamesClub"], "esrb_rating": null}