{"id": 802540, "slug": "neura-mechanicusprologue", "name": "Neura Mechanicus:Prologue", "name_original": "Neura Mechanicus:Prologue", "description": "Neura Mechanicus is a turn-based squad tactics game where you operate robot squads in tournaments, each with unique abilities, upgrades, and different game mechanics. You play Aria, an orphan girl living in a harsh cyberpunk world. On her way to becoming a champion, Aria must assemble a team with different skills, while solving the mystery behind her father’s death. Her father was a talented engineer who was mysteriously assassinated. The only thing he left her was a tactical combat robot.<br/><br/>Enter a cyberpunk world full of strange homemade robots and challenging teams vying to be the best. Team up with others while leveling up your robots with unique skills and upgrades. Attend different tournaments. Be the best, if you can.<h3>Key Features</h3><ul><li><strong>A Great Blend of Turn-Based Squad Tactics and Real-Time Action</strong><br/>You don't simply press “shoot” in this game. Your aiming skills are based on real-time actions. Your robot’s hands shake based on your aiming skill. You make fancy laser ricochet skill shots, fly your drones with keyboard and mouse but based on your “operator” skills. A great blend of motor skills and a character sheet.<br/></li><li><strong>It's \"tactical\"</strong><br/>You don’t simply stand up cover, but you choose which side to use. You’ll choose your movement style from one covered area to another (free run, crouching) or shooting style (knelt slide, prone shoot, etc). All these tactical maneuvers will give you an advantage over the enemy. <br/></li><li><strong>Each robot and skill has unique gameplay experiences</strong><br/>Each robot in Neura Mechanicus is a unique cyber trait. We don't have archetypes like “tank” or “assault” types. You can find a little punk robot using a baseball bat for melee attacks and hologram abilities to surprise its opponents. A robot looking like a research project from the 90s can have incredible ninja abilities and walk on the walls. With each skill, you will learn a new mechanic with a different playing style. Mix and match to create your unique fighting robot!<br/></li><li><strong>Mastering skills are no easy task</strong><br/>You have to use your skills to improve. You cant simply add 10 points to aiming. Mastering any skill is exponentially hard. There will always be room for improvement.</li></ul><h3>Community Driven Development</h3>We have a master plan for the story and gameplay BUT (it’s a real but) we want to consider your ideas. What does the community want for different robots, skills, and gameplay experiences? We will be having a long-term early access development stage. Please join our discord, or forums to shoot your ideas.", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-06-17T08:51:32", "background_image": "https://media.rawg.io/media/screenshots/d9c/d9c90455838e50b95433b7d26c7a0652.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["62bits"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["62bits"], "esrb_rating": null}