{"id": 802584, "slug": "daggerfall-unity-gog-cut", "name": "Daggerfall Unity - GOG Cut", "name_original": "Daggerfall Unity - GOG Cut", "description": "<p>Play a reimagined version of the all-time RPG classic from The Elder Scrolls series. Daggerfall Unity – GOG Cut brings this amazing experience to modern gamers. It has been made possible thanks to a whole team of passionate creators working under the banner of Daggerfall Unity. </p>\n<br/>\nBefore / After\n<br/>\n<br/>\n<br/><br/>\n\nThis ambitious project, launched over a decade ago by Gavin “Interkarma” Clayton, is aiming to bring the unique experience of the classic open-world RPG game to a new generation of gamers. Thanks to the efforts of the GamerZakh, a gaming content creator with a love for classics, you can now enjoy a special GOG Cut of the Daggerfall Unity title.\n<br/><br/>\nAll you have to do is download the game and simply launch it. The GOG Cut of Daggerfall Unity doesn’t require any special actions or updates on your behalf. Thanks to settings and mods that were selected by GamerZakh you can explore the rich world of Daggerfall with enhanced visuals and gameplay.\n<br/><br/>\nHowever, please note that although we find the experience very enjoyable the work on the title is stil ongoing. Some technical issues might occur, so it’s wise to quicksave often (F9) :D\n<br/><br/>\nIf you’re ready for a deep dive into the rich fantasy universe of the game, more titles from The Elder Scrolls series await your discovery on GOG!\n\n<br/><br/><br/>\n\nThe ancient golem Numidium, a powerful weapon once used by the great Tiber Septim to unify Tamriel, has been found in Iliac Bay. In the power struggle that follows, the King of Daggerfall is murdered and his spirit haunts the kingdom. The Emperor Uriel Septim VII sends his champion to the province of High Rock to put the king’s spirit to rest and ensure that the golem does not fall into the wrong hands. Daggerfall offers you an opportunity to adventure in total freedom within a world where you destiny is of your own making and consequence evolves from your decisions. A world of love and darkness, magic and sorcery. Whether you choose to follow a quest or to venture out alone, you will interact with thousands of people as you travel across an expansive land in a time of fantasy and imagination.\n<br/><br/>\nThe much-awaited sequel to the critically-acclaimed Arena,  Daggerfall builds on its predecessor in the all the right ways, bringing more content, more stories and more combat. The introduction of guilds and commerce provide you with the means to create your own political intrigue and extend your influence in the world of Tamriel. Also receiving rave reviews at launch, Daggerfall is a must-play for Elder Scrolls and RPG-fans alike.\n<br/><br/>\n<ul>\n<li>Adventure through thousands of cities, villages, farms, ruins, dungeons, graveyards, shrines and castles\n</li><li>Interact with thousand of characters, both in dialogue and action\n</li><li>Customise your character, creating your own backstory, race and class\n</li><li>Participate in numerous large-scale, complex quests or venture on your own path\n</li><li>A multiple path story, with several different endings. You decide how the story plays and ends\n</li><li>Own property and ships, participate in the politics of guilds and other organisations, and trade goods and services</li></ul>\n<br/>\n<br/>\nList of mods:\nD.R.E.A.M. by King of Worms - KoW<br/>\nImproved Interior Lighting by ShortBeard<br/>\nBetter Ambience by Joshua Steinhauer<br/>\nLoading screen by TheLacus<br/>\nEnhanced Sky by Interkarma<br/>\nInteresting Eroded Terrains by Monobelisk and Freak2121<br/>\nDistant Terrain by Nystul-the-Magician<br/>\nBasic Roads by Hazelnut<br/>\nReal Grass 2 by TheLacus<br/>\nVibrant Wind by Uncanny Valley - TheLacus - VMblast<br/>\nTaverns Redone by Uncanny Valley<br/>\nHandpainted model replacements by AlexanderSig<br/>\nWindmills of Daggerfall by Kamer<br/>\nDetailed city walls by Cliffworms<br/>\nBirds in Daggerfall by Uncanny Valley<br/>\nFixed dungeon exteriors by Cliffworms<br/>\nLively cities by Cliffworms<br/>\nUnofficial Block Location and Model fixes by XJDHDR<br/>\nReadied Spellcasting Hands by jefetienne<br/>\nRoleplay and Realism by Hazelnut<br/>\nRoleplay and Realism Items by Hazelnut and Ralzar<br/>\nDaggerfall Skyshards by Uncanny Valley<br/>\nAirships by Kaedius<br/>\nArchaeologists guild by Hazelnut<br/>\nDaggerfall Unity Quest pack 1 by JayH2971<br/>\nDaggerfall Unity Quest pack 2 by JayH2971<br/>\nWorld of Daggerfall Project  by World of Daggerfall Team<br/>\nBestiary by Shapur<br/>\nFamous Faces of the Iliac Bay by Cliffworms<br/>\nYou Can Pet The Cat by technitaur<br/>\nAmbient Text by Regnier<br/>\nDarker Dungeons  by Ralzar<br/>\nDaggerfall Expanded Textures by Ninelan<br/>\nBestiary by Shapur<br/>\nLevelling Inspiration by Cliffworms<br/>\nTown Descriptions And Details by imsobadatnicknames<br/>\nRest Warning If Unwell by Kirk O<br/>\nWorld Tooltips by jefetienne<br/>\nConvenient Quest Log by Macadaynu<br/>\nJayH's Random Little Quests by JayH2971", "metacritic": null, "released": null, "tba": false, "updated": "2023-12-11T20:34:07", "background_image": "https://media.rawg.io/media/screenshots/92c/92c15660f548971664fdcc66bf15e729.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 41, "owned": 659, "toplay": 2, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 392, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["GOG"], "genres": [], "publishers": ["GOG"], "esrb_rating": null}