{"id": 802579, "slug": "midnight-manor", "name": "Midnight Manor", "name_original": "Midnight Manor", "description": "Midnight Manor follows the story of a man down on his luck, who happens to find himself at the doorstep of a luxurious manor as a terrible storm surges outside. Greeted by a generous, but lonely, old man - he's offered shelter in exchange for completing some simple tasks during his stay.<br/><br/>So... enter the Midnight Manor. Explore its winding hallways. Fulfill your piece of the bargain, and enjoy a night of luxury sheltered from the churning storm outside.<h3>Multiple Endings</h3>The game has been designed as a short experience that must be completed in a single sitting. Multiple endings are provided to encourage curiosity and replayability. There are FOUR endings to complete. Weigh your options and choose wisely.<h3>Speedruns Encouraged</h3>Each playthrough is timed to encourage speedrunning. Your in-game time will be displayed at the end of the game and your best times for each ending will be saved in-game.<h3>Powerful Secrets</h3>The manor has its fare share of secrets. Some of these can help you along the way. Keep an eye out for shortcuts and pickups that may grant you additional speed and abilities.<h3>Forge Your Own Path</h3>There is no predetermined path outside of completing the tasks assigned to you. The game is designed to be short and re-playable. Some routes are better than others and the game encourages you to complete multiple playthroughs to find the quickest and most efficient path to complete your goals.", "metacritic": null, "released": "2020-02-28", "tba": false, "updated": "2022-06-23T13:44:58", "background_image": "https://media.rawg.io/media/screenshots/05f/05f3f2e394bc2a752273be57b87ca59b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC", "macOS"], "developers": ["travm", "Travis Maynard"], "genres": ["Action", "Adventure", "Indie", "Platformer"], "publishers": ["Travis Maynard"], "esrb_rating": null}