{"id": 80264, "slug": "christmas-solitaire", "name": "Christmas Solitaire.", "name_original": "Christmas Solitaire.", "description": "Christmas Solitaire by Jose Varela is the #1 Solitaire card game on itunes, now available for Free.<br/>If you like Windows Solitaire, you're going to love Christmas Solitaire Free by Jose Varela!<br/><br/>We kept Christmas Solitaire true to the spirit of the classic card game (also known as Klondike or Patience), and crafted a carefully designed app with sharp and clean visuals. We specifically optimized the game for iphone phones and ipads of all screen sizes, for an unmatched solitary experience. <br/><br/>If you love Solitaire classic, Spider Solitaire, FreeCell solitaire, Mahjong, Pyramid solitaire or any other free solitaire patience card games, don't miss out on the best solitaire for your phone and tablet! Just give the game a try, and we promise Solitaire by Jose Varela will be the most beautiful and user friendly solitaire game you've ever played.<br/><br/>Christmas Solitaire Classic Highlights: <br/>- Klondike Solitaire Draw 1 card<br/>- Klondike Solitaire Draw 3 cards<br/>- Portrait and Landscape<br/>- Game Statistics<br/>- Both Solitaire Classic and Vegas Solitaire scoring<br/>- Custom free Solitaire themes<br/>- Auto complete<br/>- 3D animation effects<br/>- Phone and Tablet support<br/>- Solitaire classic supports left-handed play<br/><br/>If you enjoy our Christmas Solitaire Free App, check out our other card game: Solitaire Dungeon Escape Free.", "metacritic": null, "released": "2016-12-05", "tba": false, "updated": "2019-07-30T08:06:43", "background_image": "https://media.rawg.io/media/screenshots/115/115c4bc1efeb01b01538fa55a901e341_r0EOaPb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jose Varela"], "genres": ["Board Games", "Card"], "publishers": ["Jose Varela"], "esrb_rating": null}