{"id": 802699, "slug": "ankeps-demo-2", "name": "ANKEPs Demo 2!", "name_original": "ANKEPs Demo 2!", "description": "<p>https://discord.gg/x2dPECQRdt</p>\n<p>Hello and welcome to the demo! Please keep in mind that this game is still very early in development, so don't expect everything to be perfect. The main goals of this demo are 1 basically tell people this game exists and that I've made progress on it 2 mark a milestone in development 3 get feedback on primarily the <em>movement</em> and <em>mechanics</em>. Note that downloading is recommended, though the browser build works fine.</p><p>If you need to go to a different level, you can pause with Esc to go to the Hub, or go to the portal near the beginning of each level (usually to the left)</p>\n<p>ANKEPs (working title) is a 2D Platformer Roguelike with an emphasis on aerial movement. While most games have something like a jump, double jump, and maybe a dash, ANKEPs has 3 distinct movement options that can often be used multiple times before landing, as well as the ability to cling to ceilings and a 4th minor movement option. It's often possible to maneuver without ever touching the ground, although it can be tricky. All 4 of the movement options (Burst, Flip, Spin, Spec) have 5 variations that will be randomly given to you in the roguelike structure, and for now you can choose them freely by pausing. This is the second demo for the game, and likely the final public one. I've been working super hard on this for 2 full years now, so I'm glad you're able to be here to see what I've done.</p>\n<p>Being so early in development, some things will be, well, bad. This includes but is not limited to:<br/>-Graphics. This is barely enough to tell what's going on.<br/>-Audio. There is none currently.<br/>-Performance. I honestly have no idea how this will run on other devices.<br/>-Graphics. Please just don't say anything about the graphics, you won't really make me feel bad but it's just not helpful.<br/></p>\n<p>that being said...<br/>PLEASE GIVE ME FEEDBACK!!!</p>\n<p>HOW TO GIVE ME FEEDBACK:\r\nIdeally, sending me stuff in the #feedback or #playtesting channels in my discord: https://discord.gg/x2dPECQRdt. You can also comment on the itch page if you want, or DM me/respond in whatever server or platform you found this from. You can also chat with me about it on discord. Please give AS MUCH FEEDBACK AS POSSIBLE!!! Do whatever suits you, but a screen recording + voiceover is one of the best things you can do. Give feedback on everything from movement to level design to mechanics, except avoid graphics and audio because I know they're bad.\r\n</p>\n<p>Controls (defaults that can be completely remapped):</p>\n<p>WASD - standard movement<br/>J - Burst. Gives a smallish boost in the air, or charge on the ground<br/>K - Flip. Lots of vertical movement, though usually less horizontal<br/>L - Spin. Horizontal movement usually with an upward boost<br/>Space - Spec. Minor movement ability to aid the other 3<br/>H - Interact. Interact with green objects and claws<br/>/ - Multi button. Use this in combination with a direction to perform any of the previous moves outside of standard movement<br/>Shift - Latch. an alternate button to use to latch to ceilings instead of Up (i.e. W by default)<br/>Esc - Pause. Use the mouse on the pause screen to interact with it<br/></p>\n<p>DISCORD: https://discord.gg/x2dPECQRdt</p>\n<p>Now go play my game or else.<br/></p>", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-06-17T10:29:10", "background_image": "https://media.rawg.io/media/screenshots/c3b/c3b95725c25c13f9978ebf8b6908cd52.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hystrex"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}