{"id": 802710, "slug": "the-end-of-the-road-joas-b", "name": "The End of the Road (Joas B.)", "name_original": "The End of the Road (Joas B.)", "description": "<p>Your journey has been a long one.<br/>You've faced the elements day in and day out, your feet are worn, and each step feels heavy.<br/>But you're almost there.<br/>Just this one last bit, and then you're there.</p>\n\n<p>This is a small game where you can explore a natural, atmospheric environment using a unique mechanic: \"rhythmic walking\". This mechanic is meant to emulate the rhythm you get into when walking a long hike through nature, taking it one step at a time at a steady pace. Using this, you can explore the environment, see the sights, and meet other people as you experience this atmospheric, relaxing, and contemplative final act of your journey.</p>\n<p>This game is more of an extended prototype. It's a project I worked on throughout my last year of university and I am for the most part happy with its current state. I'd really like to expand on the idea, but it would require a pretty large-scale overhaul of the game's backbone. As such, this game is a bit rough around the edges and certainly far from perfect, but I'm releasing it now because I don't have any plans on doing said overhaul any time soon.<br/>If you find any issues, let me know!</p>\n<p>I hope you enjoy the experience!</p>\n<p>Available for Windows, Linux, and MacOS.<br/>Note: Due to my own limited resources, I have not been able to test on Linux or MacOS, and so I can't ensure everything functions as well - so if you run into any issues, do let me know!<br/></p><p>Credits:</p>\n<p>Me - Mostly everything<br/>Harry Dub - Sound effects &amp; Audio<br/></p>", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-06-17T10:33:27", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbfdc939d7aaad6d9f601400db68a797.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Joas B."], "genres": [], "publishers": [], "esrb_rating": null}