{"id": 802721, "slug": "bagchal", "name": "Bagchal", "name_original": "Bagchal", "description": "<strong>Bagchal: A Hunt for Goats</strong>\n<p>Two sides take part in the game: 4 tigers trying to capture the 20 goats who defend themselves by blocking the tigers. The game board consists of a grid of 25 points with lines of valid movement connecting them.<br/></p>\n<p>Moves are made along the lines drawn on the board. Notice that there is not any line between some of the points that could be diagonally connected, so there are some restrictions.</p>\n<strong>Objective<br/></strong>\n<p>Since forces are unequal, the objective is also different for both sides:</p>\n<ul><li>Goats must surround the four tigers so that any of them can't make any valid move according to the following rules. \r\n</li><li>Tigers win if they capture five goats\r\n</li></ul>\n<p>Sometimes it is said that tigers must capture all the goats to get the victory, but in practice when several goats are captured their possibilities of blocking the tigers are very few, so it is not worth extending the game when five goats have been already captured.<br/><br/></p>\n<strong>How does the game go on?</strong>\n<p>Before the start of the game, pieces are placed as follows:</p>\n<ul><li>The twenty goats are placed out of the board.\r\n</li><li>The four tigers are placed in the four corners of the board.</li></ul>\n<p>Players move alternatively, starting the goats. The actions made by goats divide the game into two phases: \r\n</p>\n<ul><li>While all the 20 goats have not been placed on the board, the only possible move is to place one of them at one of the free junctions on the board.\r\n</li><li>After all the goats have been placed on the board they may be moved from their position to any adjacent junction following any straight line.\r\n</li></ul>\n<p>The tigers, during the game, may perform two kinds of movements:\r\n</p>\n<ul><li>Same as goats, they may be moved along any of the lines to an adjacent junction.\r\n</li><li>They also may capture one goat placed on an adjacent junction by jumping over following a straight line and landing on the next junction adjacent to the position occupied by the goat.\r\n</li></ul>", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-06-17T10:37:26", "background_image": "https://media.rawg.io/media/screenshots/3e6/3e670bfd8e671840474797eda3bb3070.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["iamsuman"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}