{"id": 80276, "slug": "tiny-tails", "name": "Tiny Tails", "name_original": "Tiny Tails", "description": "Welcome to Tiny Tails! In this city building game with an RPG twist, you are a mouse in charge of building a small village into an engaging prosperous world. Armed with nothing more than a couple ingredients and a crafting pot, you will craft tools and weapons to use while adventuring where you battle ants, centipedes and other menacing creatures who are hoarding things you need to expand the village!<br/><br/>Key features of the game:<br/>• Create a thriving Mousewood village with expandable buildings and festive decorations<br/>• Visit and interact with friends’ villages to earn rewards and flaunt your game status<br/>• Level up through adventuring, utilizing casual combat with light RPG mechanics<br/>• Enhance your playable avatar with a variety of upgradeable weapons and armor<br/>• Assign craftsmice jobs to produce village revenue; customizable to match user play times<br/>• Explore a variety of levels based on difficulty to ensure hours of endless gameplay<br/>• Earn a variety of rewards via a robust quest system featuring over 300+ quests<br/>• Discover and create new items using over 1000+ recipes in the extensive crafting system<br/><br/>Tiny Tails is completely free-to-play, but some items can be purchased for real money.  If you don't want to use this feature, please disable in-app-purchases in your device's settings. Tiny Tails requires an internet connection to play.", "metacritic": null, "released": "2013-04-25", "tba": false, "updated": "2019-10-22T14:23:01", "background_image": "https://media.rawg.io/media/screenshots/b44/b44f3cf0b859596c8447fd7660a4de56.jpg", "website": "http://www.inmotionsoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["InMotion Software"], "genres": ["RPG", "Simulation"], "publishers": ["InMotion Software"], "esrb_rating": "Everyone 10+"}