{"id": 80288, "slug": "slapshot-frenzy-ice-hockey", "name": "Slapshot Frenzy Ice Hockey", "name_original": "Slapshot Frenzy Ice Hockey", "description": "------------------------------------------------------<br/><br/>\"This game has fantastic action and…really nice animation (including a zamboni which clears the ice between periods).  I found this to be an incredibly addictive game. Slapshot Frenzy is one of those games which can fill the various free seconds you have during the day, or wile away a few hours.\"<br/>JustAnotherMobileMonday<br/><br/>\"Slapshot Frenzy is the hockey fix for iPhone users. Sound effects are very exciting, as the game includes sounds for slapshots, the skates on the ice and the epic horn when a goal is scored. For me, it is the sounds that make Slapshot Frenzy exciting. The visuals are also quite good as they go very well with the in-game sound effects.\"<br/>iPhoneinCanada.ca<br/><br/>\"I have loved playing almost all Skyworks games on my iPhone. And this new Ice Hockey game called Slapshot Frenzy is just too cool.\"<br/>iPhoneIndiaBlog<br/><br/>------------------------------------------------------<br/><br/>Can’t get enough of Hockey season? Think you have what it takes to score top shelf? Now, from Skyworks®, creators of the best quality and most fun sports and arcade games on the iPhone/iPod touch, comes another addictive masterpiece, SLAPSHOT FRENZY™ ICE HOCKEY.\u2028\u2028<br/><br/>With SLAPSHOT FRENZY, test your one-timing skills to see if you can get the biscuit between the pipes. In Free Skate Mode, you have two minutes to practice your shots without defenders. In Classic Mode, the pressure is on to make every shot count. There are three action packed periods of 2 on 2 Hockey. You must work with two players to face-off, pass and shoot to score as much as you can in 4 and a half minutes.\u2028\u2028<br/><br/>KEY FEATURES:\u2028\u2028<br/>- FREE SKATE MODE: No defenders so you can practice your technique<br/>- CLASSIC MODE: 3 periods of 2 on 2 Hockey.<br/>- SOUND AND MUSIC VOLUME CONTROLS\u2028<br/>- LOCAL HIGH SCORE BOARDS\u2028<br/>- GLOBAL HIGH SCORE BOARDS: Compete against players from around the world!\u2028\u2028<br/><br/>After you play SLAPSHOT FRENZY, try other top selling SKYWORKS arcade-style games like WORLD CUP TABLE TENNIS™, GOAAAL! ™ SOCCER, and ARCADE HOOPS™ BASKETBALL. Or, just search for “SKYWORKS” in the App Store search bar to find your favorite games, and have fun!\u2028<br/><br/>Look for more new games from Skyworks COMING SOON! <br/><br/>Skyworks – Find YOUR Game!", "metacritic": null, "released": "2009-12-18", "tba": false, "updated": "2019-10-22T14:23:01", "background_image": "https://media.rawg.io/media/screenshots/2b2/2b2b8858311b4da4dd111a8f480c1b4e.jpg", "website": "http://www.skyworks.com/iphone", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Skyworks"], "genres": ["Simulation", "Sports"], "publishers": ["Skyworks Interactive"], "esrb_rating": "Everyone 10+"}