{"id": 802836, "slug": "saivu", "name": "Sáivu", "name_original": "Sáivu", "description": "<h3>SPILLE JA OAHPA SÁMI KULTUVRRA!</h3>Sáivu lea spilla mas sámi kultuvra lea vuođđun. Spilla doalvu du sámi gávcci <br/>jahkeáigodaga čađa, ja juohke áigodagas lea sierra hástalus. Jus nagodat hástalusa, <br/>de oaččut skeaŋkka maid sáhtát oaffaruššat sieidái go háliidat joatkit boahtte <br/>jahkeáigodahkii. Muhtun hástalusaide soaittát dárbbašit veahki, de lea ávkkálaš spillet daid iešguđetlágan veahkkespillaid álggos, - ovdamearkka dihte sáhtát geahččalit <br/>luohtemuitospilla, das oahpat luđiid. Dahje sáhtát guldait máidnasiid ja oahppat mot <br/>balddonasaid galggat časkit.<br/><br/>Spille 8 sámi jahkeáigodagaid čađa:<br/>1. Cegget ja stellet lávu<br/>2. Juoigat elliid<br/>3. Veahkehit noaiddi ráhkadit dálkasiid<br/>4. Doarrut balddonasaid vuostá<br/>5. Bivdit<br/>6. Njorostallat<br/>7. Oahppat duddjot – duddjot juoidá duoljis, čoarvvis dahje láiggiin<br/>8. Oaggut jieŋa alde<br/><br/>Spilla loahpas leat gažaldagat visot fáttáid birra maid leat oahppan olles spillas.<h3>SPILL OG LÆR OM SAMISK KULTUR!</h3>Sáivu er et spill basert på samisk kultur. Spillet følger de 8 samiske årstidene, med en <br/>utfordring for hver årstid. Klarer du utfordringen får du en gave som du kan ofre til <br/>offersteinen når du vil gå videre til neste årstid.<br/>For en del av utfordringene vil du ha nytte av å spille forskjellige hjelpespill først, - for <br/>eksempel kan du prøve joikememory for å lære de ulike joikene, eller du kan høre på <br/>eventyr om hva som skal til for å bekjempe de overnaturlige.<br/>Spill deg gjennom de 8 samiske årstidene:<br/>1. Bygge og innrede lavvo<br/>2. Joike til deg forskjellige dyr<br/>3. Hjelpe sjamanen å lage medisin.<br/>4. Slåss mot de overnaturlige<br/>5. Gå på jakt<br/>6. Fang rein med lasso<br/>7. Lær deg duodji - lag noe fint av skinn, garn og horn.<br/>8. Fiske gjennom et hull i isen.<br/>Avsluttes med et spørrespill om alt du har lært i hele spillet.", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2023-06-12T03:47:39", "background_image": "https://media.rawg.io/media/screenshots/531/531c1527bfecfbdedd79ed7b86584ae9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Stállu", "Minimedia"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Minimedia"], "esrb_rating": null}