{"id": 802933, "slug": "rainbow-sword-zhtgames", "name": "Rainbow Sword (ZHTgames)", "name_original": "Rainbow Sword (ZHTgames)", "description": "<p><em><strong>[EN]</strong></em> Has been invited to your brother's castle to have a great feast, but something is wrong. Some strange creatures have appeared in all the corridors causing havoc and terror.</p>\n<p>With the help of The Rainbow Sword, it is your duty defeat each creature and find the origin of it all. Rescue your brother and bring back the peace in this land.\r\n</p>\n<p>Explore, fight, resist and don't give up, your brother needs you!\r\n</p>\n\n<p><strong><em>[ES]</em></strong> Has sido invitado al castillo de tu hermano para disfrutar de un gran banquete, sin embargo, algo no esta bien. Unas extrañas criaturas han aparecido por todos los pasillos causando estragos y terror.<br/></p>\n<p>Con la ayuda de la <em>Rainbow Sword</em>, es tu deber vencer a cada una de las criaturas y encontrar el origen de todo esto. Rescata a tu hermano y devuelve la paz a estas tierras.</p>\n<p>Explora, pelea, resiste y no desistas, tu hermano te necesita.</p>\n\n<p> CONTROLS</p>\n\n<p>Z - Interact</p>\n<p>Arrows - Movement</p>\n<p>Enter - Menu</p>\n\n<p> <strong>MEANING</strong></p>\n<p><strong><em>[EN]</em></strong> This is quite a personal project, based on my life. During a lot of time I had questioned my sexuality, tormenting me and suffering in silence. Little by little I was fighting these internal battles against my own demons.\r\n</p>\n<p>I decided to create this video game to show the process that I had until my acceptance, pass from the moments of anger and confusion against myself until the most critical moments where do you break because you are not like other people expect you to be.\r\n</p>\n<p>A creative way to telling my brother all the stuff that I went through, also I hope that this game can help other people as did it help me to vent these feelings that I had inside.\r\n</p>\n<p>Be proud of who you are 🌈🏳️‍🌈\r\n</p>\n\n<p><strong><em>[ES]</em></strong> Este es un proyecto bastante personal, basado en mi vida. Durante mucho tiempo me había cuestionado mi sexualidad, atormentándome y sufriendo en silencio. Poco a poco fui librando estas batallas internas contra mis propios demonios.</p>\n<p>Decidí crear este videojuego para mostrar el proceso que lleve hasta mi aceptación, pasar desde los momentos de enojo y confusión contra uno mismo hasta los momentos mas críticos donde te quiebras por no ser como los demás esperan que seas.</p>\n<p>Una forma creativa de poder contarle a mi hermano lo que pase y también con la esperanza de que a mas personas le pueda servir como a mi me sirvió para poder desahogar estos sentimientos que tenia por dentro.</p>\n<p>Enorgullécete de quien eres 🌈🏳️‍🌈</p>\n\n<p> </p>\n<strong>SOUNDTRACK</strong>\n\n<p> <strong>SOFTWARE</strong><br/></p>\n<p>Piskel - Pixel Art</p>\n<p>Affinity Designer - Banners and publicity<br/></p>\n<p>beepbox.co - Music</p>\n<p>Unity - All game</p>\n\n<p><em>Un pequeño juego hecho con amor, para mi hermano &lt;3</em><br/></p>\n<p>ZHTgames 2021-2022</p>", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-06-17T12:06:33", "background_image": "https://media.rawg.io/media/screenshots/d88/d88fe6743f03c3580545c2f82de0cf4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZHTgames"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}