{"id": 802943, "slug": "gamester09s-games", "name": "Gamester09's Games", "name_original": "Gamester09's Games", "description": "<p>These are games that I designed while I am at Neumont, these are more like tech demos then games, but they are fun to play.  I do know that the games are buggy and don't always work the way intended but I do hope that you will enjoy them as they come out. Most bugs / issues that are in projects will likely not be fixed or worked on, but I would like it if you would put any issues, you have down in the comments.  Also new games / projects will be added in the future. And one last thing thank you to those that I got assets from, all the assets that I use either I created or were free for me to use so thank you for your time in making these assets<br/></p>\n<p>Currently Added:</p>\n<p>Invaders from Space: A 3d space invaders game where the camera is positioned right behind your spacecraft.  Shoot down the enemies and don't let them hit you.<br/></p>\n<p>Space Hockey 3D: A 3D physics game where you play air hockey in space against an AI opponent that really isn't that smart.</p>\n<p>Nim: Group Project that we created the game of Nim</p>\n<p>Pente: Group Project that we created the game of Pente</p>\n<p>Casino: Group Project that we created that has multiple different casino games mixed in</p>\n<p>Middara: This is a Middara Tracker for stats and also a dice roller, this was the first time of me using WPF and it isn't good nor a game. I honestly just love this board game and hate keeping track of stats in said game</p>\n\n<p>Once again thank you for looking into the games / projects that I have made, and I hope that you will stick around for other things that I am working on</p>", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-06-17T12:10:46", "background_image": "https://media.rawg.io/media/screenshots/dc8/dc8e204556876f31c8fd7217380ad8dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamester09"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}