{"id": 80291, "slug": "i-dig-it", "name": "I Dig It", "name_original": "I Dig It", "description": "* \"campaign mode is surprisingly deep, and continued mastery takes a long, enjoyable time.\", MacWorld<br/>* \"I Dig It has kept me coming back for more. I'm a sucker for games that have a great art style, and there are few games that rival that of I Dig It.\", Touch Arcade<br/>* Bringing elements of strategy and classic arcade gameplay together with an interesting plot make this game stand out from the rest, justifying its number one position in the App Store\", Gamer Syndrome<br/>**************<br/>Fallen on hard times, farmer Lewis converts an old bulldozer into a fantastic high-tech “diggin” machine.  Help him dig up stuff to sell (60+ unique diggings) in a race against the clock to pay the mortgage and save the farm (campaign mode).  <br/><br/>In addition there are 8 mini-game challenge matches, plus open-ended free play mode and even a tutorial game mode for beginners, offering hours of game play.<br/><br/>Manage fuel, temperature, and damage while searching for diggins.  Sell them at the farmhouse to earn cash.  Save cash to pay the mortgage, upgrade your digger, or make repairs.  Use the on-screen “analog” joystick, or touch-screen to control digger movement.  Watch out for rocks and caverns that disrupt your path. Have fun!", "metacritic": null, "released": "2009-06-06", "tba": false, "updated": "2024-03-20T13:29:04", "background_image": "https://media.rawg.io/media/screenshots/5ec/5ec13a2d7f9ef6c5c8441795188a453a.jpg", "website": "http://www.inmotionsoftware.com", "rating": 0.0, "rating_top": 4, "added_by_status": {"owned": 4, "beaten": 3, "dropped": 1}, "playtime": 0, "achievements_count": 16, "ratings_count": 5, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 5, "platforms": ["iOS"], "developers": ["InMotion Software"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["InMotion Software"], "esrb_rating": null}