{"id": 80301, "slug": "tank-battle-east-front-lite", "name": "Tank Battle: East Front Lite", "name_original": "Tank Battle: East Front Lite", "description": "Tank Battle: East Front Lite is an exhilarating turn based strategy game from the creators of Tank Battle: 1944 and Ancient Battle: Rome. Use hex based tactical combat to dominate foes on the Russian front of the Second World War. Fight as the Germans or the Soviets in a series of ever more complex missions.<br/><br/>The Eastern front of World War II saw some of the most ferocious fighting, as the Red Army and the Wehrmacht pitted ever increasingly powerful tanks at each other. While the early years of the war saw the Soviets struggle withstand against the German Blitzkrieg, the later stages of the war saw the Red Army counter attack in great force.<br/><br/>Missions vary from straightforward wipe out the enemy scenarios, to capture key objectives, to protecting vital supply convoys and assaulting enemy weapon dumps. There is a whole range of objectives to reflect the tactical complexity on warfare on the Eastern Front, and conquer your enemy with over 70 historical units.<br/><br/>The game system is based on, and a major upgrade of, the successful game engine developed for ‘Tank Battle: North Africa’.<br/><br/>Key Game Features:<br/><br/>• High Definition World War Two Era Graphics.<br/>• Play as the Soviets in the 7 mission ‘First Strike’ learning campaign that ends with two in depth missions.<br/>• Play as the Germans in the 5 mission ‘Lite’ campaign, experiencing combat from different years of the war.<br/>• 35 different German units; 17cm K18, 50mm PaK38, 75mm LefK 16na, 88mm FLaK36, 88mm PaK43-41, Panzerschreck, Hetzer, Jagdpanzer IV/48, Jagdtiger, Ju87, Marder IIa, Marder III, Panther, Panzer Ib, Panzer II Flamm, Panzer II Luchs, Panzer IIIe, Panzer IIIj, Panzer IIIj1, Panzer IIIn, Panzer IV, Panzer IVf2, Panzer IVh, Sdk.Fz 7/2, Sdk.Fz 7, Sdk.Fz 222, Sdk.Fz 232 8r, Sdk.Fz 234/2 Puma, Sdk.Fz 251, SiG Ib, StuG IIIf, StuG IIIg, StuG IV, Tiger I, Tiger II, Wurfrahmen 40.<br/>• 30 different Soviet units; 45mm Model 1937, 57mm Model 1943 ZIS2, 76mm model 1942 ZIS3 Artillery, 76mm Model 1942 ZIS3 ATG, 85mm Model 1939, 122mm Model 1938, 152mm Model 1938, BA-10, BA-64, BM-13, BM-31, BT-7, IS-2, ISU-122, KV-1, KV-2, KV-8, KV-85, M3a1 Armored Transport, OT-34, Shturmovik, SU-76, SU-85, SU-100, SU-122, SU-152, T26, T34-40, T34-43, T34-85, T70.<br/>• 6 common units; Flamethrower, HMG, Infantry, Mechanized Infantry, Mortar, Supply Dump, Truck.<br/>• Hi-definition summer and winter terrain.<br/>• Four troop classes; Raw, Average, Veteran and Elite.<br/>• Other Game Features; Detailed Combat Analysis, Flank Attacks\u2028, Strategic Movement, indirect fire, mounting and dismounting from vehicles.<br/>• Game Center Achievements and Leaderboards.\u2028<br/><br/>Find us on Facebook - facebook.com/huntedcow<br/>Follow us on Twitter - @HuntedCow<br/>Forum - forums.huntedcow.com/tankbattle<br/><br/>Thank you for supporting our games!<br/><br/>", "metacritic": null, "released": "2014-07-08", "tba": false, "updated": "2019-10-22T14:23:01", "background_image": "https://media.rawg.io/media/screenshots/601/601bf44583424ee105a9231b2b883392.jpg", "website": "https://www.hexwar.com/downloads/tank-battle-east-front/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HexWar Games"], "genres": ["Strategy", "Simulation"], "publishers": ["HexWar Games"], "esrb_rating": "Teen"}