{"id": 80309, "slug": "civilization-iv", "name": "Civilization IV", "name_original": "Civilization IV", "description": "HISTORY AS YOU KNOW IT, IS HISTORY<br/><br/>With millions of units sold and unprecedented critical acclaim from fans and press around the world, Sid Meier's Civilization is recognized as one of the greatest game franchises of all-time. Now this incredibly fun and addictive game is taken to new heights with new ways to play and win. Sid Meier’s Civilization® IV joins the Mac App store in a beautifully detailed, living 3D world that expands the gameplay experience. <br/><br/>In Sid Meier’s Civilization IV, rule throughout time and create your own legacy as you guide your civilization from the dawn of man through the space age and beyond. Implement new technologies, conduct diplomacy or wage war to grow your society and become the most powerful leader the world has ever known.<br/><br/>*** Please Check System Requirements Prior to Purchasing. *** <br/><br/>IMPORTANT:  Since the closure of GameSpy, internet multiplayer is no longer available for Civilization IV on the App Store.<br/><br/>* Intel Integrated video chipsets are not supported (GMA 950 / GMA X3100) <br/><br/>* Civilization IV expansion packs (Beyond the Sword and Warlords purchased via retail box, or digitally) WILL NOT work with Civilization IV from the Mac App store<br/><br/><br/>* If you experience any problems please contact our customer support at support.aspyr.com<br/><br/>* In order to run the game with satisfactory performance, your Mac must meet these minimum system requirements: 1.8 GHz CPU Speed | 512 MB RAM | 3.0 GB free disk space | (ATI): Radeon HD 2400; (NVidia): GeForce 8600 | 256 MB VRam<br/><br/>\"NOTICE: This game is <br/>not supported on volumes formatted as Mac OS Extended (Case Sensitive).<br/> <br/>______________________________________________________________________________<br/>BE THE FIRST TO KNOW!<br/>Get the latest Aspyr news, get insider information, deals and more…<br/>SURF US: http://aspyr.com<br/>LIKE US: http://facebook.com/aspyrmedia<br/>FOLLOW US: http://twitter.com/aspyrmedia<br/><br/>Thank you for playing Civilization IV from Aspyr!<br/><br/>", "metacritic": null, "released": "2011-07-07", "tba": false, "updated": "2023-11-02T02:48:36", "background_image": "https://media.rawg.io/media/screenshots/935/935e50f44378ff974f72a937c8602357.jpg", "website": "http://aspyr.com/games/sid-meiers-civilization-iv?utm_source=MacApp&utm_medium=ProductLink&utm_campaign=sid-meiers-civilization-iv", "rating": 3.95, "rating_top": 5, "added_by_status": {"owned": 4, "beaten": 12, "toplay": 3, "dropped": 7, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 21, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 21, "platforms": ["macOS"], "developers": ["Aspyr Media"], "genres": ["Strategy"], "publishers": ["Aspyr"], "esrb_rating": "Everyone 10+"}