{"id": 8030, "slug": "zombie-catchers", "name": "Zombie Catchers", "name_original": "Zombie Catchers", "description": "Let's go zombie hunting! Catch zombies for fun and profit!<br/><br/>*** TOP 10 game in over 90 countries! ***<br/>*** TOP 5 action game in over 100 countries! ***<br/><br/>Zombie Catchers is an action adventure game in a world riddled by a zombie invasion! Planet Earth is infested with the undead, but we’re in luck: A.J. and Bud, two intergalactic businessmen, have decided to set up shop on our homeworld! Together, they plan to catch all the zombies and make Earth safe once more - while also making a handsome profit...<br/><br/>Use an arsenal of gadgets and traps to hunt and capture ripe zombies, take them to your secret underground lab, and... profit!<br/><br/>FEATURES<br/>- Catch zombies!<br/>- Discover new territories! <br/>- Unlock exciting new gadgets!<br/>- Build a juicy and delicious business empire!<br/>- Expand and micro-manage your own underground lab!<br/><br/>Notice: Zombie Catchers is completely free to play, but the game also allows you to purchase some items for real money. If you do not wish to use this feature, change your device's settings and disable in-app purchases.<br/><br/>Zombie Catchers is allowed for download and play only for persons 12 years of age or over. Please refer to our Terms of Service and Privacy Policy for more information.<br/><br/>Download now, and get ready to kick some rotten zombie butt!", "metacritic": null, "released": "2014-10-29", "tba": false, "updated": "2019-07-31T03:37:44", "background_image": "https://media.rawg.io/media/screenshots/cb2/cb237727964dcc6329e99b61fa286ae8.jpg", "website": "https://www.zombiecatchers.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 4, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 3, "platforms": ["Android", "iOS"], "developers": ["Two Men and a Dog", "Deca Games"], "genres": ["Action", "Adventure"], "publishers": ["Two Men and a Dog Oy"], "esrb_rating": null}