{"id": 8031, "slug": "art-of-war-2-global-confederation", "name": "Art Of War 2: Global Confederation", "name_original": "Art Of War 2: Global Confederation", "description": "The year 2038. For 20 years, the Earth has been under the rule of the Global Confederation that united and brought under its control all the countries and continents.   The mankind entered a new era. Global territory wars that had been waged for a century subsided. The world economy no longer supported the military machine to be ready for action and turned towards the progress. The new scientific horizons on the Earth and in outer space were open. <br/><br/>But peace and quite in the Confederation is being increasingly disturbed by the outbreaks of rebellions of those who oppose the Senat's policies. The resistance movement is gaining momentum all over the world. The Senate throws the whole reserve of Condederation's scarce peace-keeping forces to suppress the rebellion.<br/><br/>In the east of Peru, near the city of Pucallpa, some signs of rebellious activity have been observed. Prior to that moment, South America was the calmest of regions. Your mission is to crush the revolt in Peru and to capture the leader of the rebellion.<br/><br/>You are charged with a mission on which the future of mankind depends. As a general of Confederation you are to suppress a revolt in Peru.<br/><br/>To attain the goal you must complete 7 missions of the campaign on diverse terrains from the Amazonian jungle to the mountain ranges of the Andes. The game features a variety of machinery, facilities and upgrades. Each side has unique equipment with its features and fighting qualities and so its own tactics. Dynamism of this game won't leave you bored through the campaign. And if you feel that campaign missions are not enough, there are many additional custom maps as well.<br/><br/>Game features:<br/>- beautiful modern 3D-rendered graphics;<br/>- 7 campaign missions in different locations from the Amazonian jungles to the highlands of the Andes;<br/>- Big variety of units and upgrades;<br/>- Each party has its own weapons and equipment with special characteristics;<br/>- Each party has its own battle tactics;<br/>- High dynamics of game;<br/>- 15 additional custom missions.<br/><br/>________________________<br/> Your reviews and starts are very important for us! Thank you very much!", "metacritic": null, "released": "2009-11-11", "tba": false, "updated": "2019-10-22T14:37:42", "background_image": "https://media.rawg.io/media/screenshots/7f4/7f493360ffd7569ebe19d04576c4c6be.jpeg", "website": "http://gear-games.com/wap/?p=c_aow21i&l=en", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gear Games"], "genres": ["Strategy", "Board Games"], "publishers": ["Gear Games"], "esrb_rating": null}