{"id": 803185, "slug": "residual-itch", "name": "Residual (itch)", "name_original": "Residual (itch)", "description": "<p>Residual... a new breed of survival platformer from OrangePixel.</p>\n<p>In a forgotten galaxy full of strange planets, a lone explorer crash-lands on one with an ancient alien secret. Venture forth from the shipwreck across a harsh, unpredictable, procedurally generated world. Harvest food and make campfires to stay alive. Craft science-fiction survival tools like teleporters and mining devices. Unearth alien technology capable of repairing the ship. Hunger, cosmic storms, hostile plant life and the mysterious ooze are among the many obstacles you'll face.<br/></p>\n\n<p>You won't be alone! PDB (a snarky floating Personal Disaster Bot) will follow and assist you along the way. Sometimes. PDB also helps you discover the hidden lore, revealing the history of the planet as you explore deeper and deeper, assuming you can survive!</p>\n\n<p>OrangePixel’s uniquely designed Nature Engine generates 1000's of planets from a vast set of environment-based rules, then drops explorers on a world brimming with potential. If a planet orbits close to the sun, intense heat, high winds, and sparse vegetation will pose a set of challenges wildly different from other worlds. Further from the sun, long nights make stamina easier to maintain, but reduced solar power turns every suit function—like scanning the planet—into a critical decision.<br/></p>\n\n<p>Residual welcomes players to a non-violent survival experience with limitless possibilities and no traditional combat. Jump and descend through colorful, highly detailed pixel art evoking classic 2D platformers. Solve light puzzles to reveal secrets of a long-lost civilization. Select a male, female, or non-binary protagonist, customize survival parameters like how fast time advances, and race to repair the ship, dig up ancient secrets, or collect data entries on hundreds of undiscovered objects.</p>\r\nJOIN THE COMMUNITY\r\n\n<p>Discord: https://discord.gg/orangepixel\r\nTwitter: https://twitter.com/orangepixel\r\nFacebook: https://facebook.com/orangepixel\r\nYoutube: https://youtube.com/orangepixelmobile</p>", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-06-17T13:56:39", "background_image": "https://media.rawg.io/media/screenshots/26d/26d0d70dbdaa35c71c9dc9f1e94f5370.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Orangepixel"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}