{"id": 803213, "slug": "lost-in-linearity", "name": "Lost In Linearity", "name_original": "Lost In Linearity", "description": "<p><strong><em>A whole new RPG Maker experience!</em></strong></p>\n<p>Inspired by the RPGM legends such as Yume Nikki/2kki, OFF, Lisa the Painful, and especially  lesser known games like Jimmy and the Pulsating Mass, Weird and Unfortunate Things are Happening, and No Delivery,  comes a new contender to the world of RPG Maker!</p>\n<p>Introducing Lost in Linearity,  a game made in RPG Maker MV that aims to combine the best aspects of these games with a fresh new coat of paint that ain't ever been seen before! The game is a \"Yumevania\",  combining the wide open ended exploration of Yume Nikki/2kki  and fun turn based RPG combat that aims to be better than most RPGMaker games that try to have combat. You'll play as Barley, scouring the Abstraction, seeing sights both tranquil and terrifying, battling foes, and collecting effects to allow further access to areas that you normally couldn't reach without them! </p>\n<p>This however is the kicker.  In the game's full release,  all of these side quests and areas will be COMPLETELY OPTIONAL. The whole point of the game being that in the full release, your main goal is to tackle a great maze that hides a great treasure in the center. It will be tough, and most likely kick your ass if you blindly go in. However with enough skill and luck, the game could theoretically  be beaten in less than an hour. Your default equipment is perfectly capable of carrying your entire run but where's the fun in that? Explore these unique worlds and become lost from your linear objective.<br/><br/><strong><em>(Soon to be) Features:</em></strong></p>\n<p>- Digital Hand Drawn art by yours truly, inspired by my favorite stuff like Captain Underpants, Kirby,  and especially a ton of cartoons that I like.</p>\n<p>- A mature story not about the destination, but about the hidden details of Barley and the world she inhabits. Unravel more of her past as you explore...or don't.</p>\n<p>- A wide variety of kooky worlds, some purely abstract dungeons that lead to even more abstract dungeons or towns with their own stories, characters, and rewards. The sky's the limit, usually being whatever comes to my first and I think would be neat to explore and fight through! Expect content updates that's just me adding in random ass worlds I thought would be cool!</p>\n<p>- No level grinding! Instead...</p>\n<p>- A wide variety of items, weapons, armor, and trinkets that will provide a whole bunch  moves and fighting styles! Each piece of gear is weirder than the last!</p>\n<p>-Fast paced and hectic turn based combat! Bring your wits because it's going to get rocky!</p>\n<p>-Dumbass improv dialogue, reminiscent of shows like Aqua Teen Hunger Force. I love dry ass humor. <br/></p>\n<p><strong><em>Credits:</em></strong></p>\n<p><strong>Art: Some Shmuck (ME!!!!!)</strong></p>\n<p><strong>Music: </strong>NarcolepsyDriver and Thandta Tub/Puke Nukem and Me</p>\n<p><strong>Music I don't own rights to and will be removed later (It's placeholder!):</strong></p>\n<p>Ghost by Machine Girl</p>\n<p>Ice Cream Headache from Skullgirls<br/></p>", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-06-17T14:08:09", "background_image": "https://media.rawg.io/media/screenshots/7cd/7cd156d4b39c11754eac66011260b246.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Some Shmuck"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}