{"id": 803310, "slug": "ready-builder-one", "name": "Ready Builder One", "name_original": "Ready Builder One", "description": "<p>Site to distribute test builds of project for Slalom Build Game Jam Hackathon 2022 <br/></p>\n<p><strong>Test versions:</strong></p>\n<p>\n</p>\n<p><strong>Windows:</strong></p>\n<p>- Keyboard and mouse: WASD, left mouse for Fire 1, Right Mouse for Fire 2</p>\n<p>- Gamepad controller left stick for movement, Right trigger for Fire 1, Left Trigger for Fire 2 and Ready.</p>\n<p><strong>Mobile </strong>- Virtual joystick for movement, touch screen to aim / fire and Ready up.<br/></p>\n<p>\n</p>\n<p><strong>Quest </strong>- thumbsticks for movement, right trigger for Fire 1, left trigger for Fire 2 and Ready.</p>\n<p><strong>Instructions:</strong></p>\n<p>One player starts the game, clicks on \"Launch Game\", enters a Player Name and Room Name for that game, shares it with other players who use that process to join that same game.</p>\n<p>Players in the game lobby can see other players as they join, along with their names entered. Each player is represented differently and presses \"R\" to Ready Up (mobile users just touch the screen to fire and Ready Up). </p>\n<p>When all players in the lobby are ready, the game starts.  Currently supports up to 4 players per session.</p>\n<p><strong>Gameplay:</strong></p>\n<p>All players have limited health and 3 lives. Players' health reduce when they are shot by other players or hostile environment objects such as laser turrets.</p>\n<p>When a player's health is reduced to zero, the player is destroyed. If the player still has a live remaining, the player respawns. If not, the player waits out  while the remaining players battle it out. The last player remaining wins a game.</p>\n<p>After the game concludes, the scoreboard is shown and another game starts again with another level. The first player to win 3 games wins the match.</p>\n<p>At the end of the match, the players are brought to the End of Match scene where the winner is shown.</p>\n<p>Players can Ready Up to play again or leave the game at that point. </p>", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-06-17T14:54:48", "background_image": "https://media.rawg.io/media/screenshots/08c/08ca9199d19ed4f1324b612c39bcf75d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EggMan28"], "genres": [], "publishers": [], "esrb_rating": null}