{"id": 803481, "slug": "utopia-sensing", "name": "UTOPIA (sensing)", "name_original": "UTOPIA (sensing)", "description": "<p>\r\nUTOPIA (Sensing)- TRAILER </p>\n<p>Environmental psychology has long been interested in studying how people perceive and experience their environment and surroundings. Each Human's emotional perception of their environment is contingent on not only environmental characteristics but also on the individual's cognitive functions and consciousness. According to Carl Jung's definition of psychological functions in his book \"Psychological Types,\" cognitive functions are distinct mental processes that exist within the psyche of every individual. This concept is a key pillar of support for his theory of personality types. In his book, he described four primary psychological functions: Thinking, Feeling, Sensation, and Intuition. UTOPIA is an experimental immersive virtual reality project comprising four environments representing Carl Jung's four primary psychological functions. We used Unreal Engine, a 3D computer graphics game engine, to design UTOPIA. Every individual could enter the UTOPIA and experience the four distinct virtual reality environments via a VR headset, each representing  Carl Jung's four primary cognitive functions. Each environment is designed based on specific physical features and meaning-related dimensions that correlate them with specified psychological functions. Experience with UTOPIA can elicit specific affective reactions for scientific, therapeutic, and recreational purposes.</p>\n<p><strong>Sensing: Jung presented sensation as \"that psychological function which transmits a physical stimulus to perception. [...] not only to the outer stimuli but also to the inner. Primarily, therefore, sensation is sense-perception, i.e., perception transmitted via the sense organs and 'bodily senses' .\" UTOPIA's sensing environment is a low-poly spherical environment in which the user floats weightlessly and can move in any direction. When the user approaches each face of the low-poly sphere, a trail of colored Luminous particles is scattered inside.</strong></p>\n\r\nCreators: Arefe Paydar, Ali Nakhaee, Amir Najimi\r\nEducator: Ali Andaji Garmaroodi, Pooria Baniadam", "metacritic": null, "released": "2022-06-14", "tba": false, "updated": "2022-06-17T16:04:02", "background_image": "https://media.rawg.io/media/screenshots/8e2/8e25a80dc170031bc8f18d618a8ec465.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["UTOPIA"], "genres": ["Adventure", "Simulation", "Educational"], "publishers": [], "esrb_rating": null}