{"id": 803573, "slug": "bad-and-good-hidden-object-game-free-offline", "name": "Bad And Good: Hidden Object Game Free Offline", "name_original": "Bad And Good: Hidden Object Game Free Offline", "description": "Bad And Good : Hidden Object Game Free Offline\r\n<p>Between Bad And Good is an exciting and addictive hidden object game of 2022. In this Hidden Object game lively and colorful locations of the luxurious palace, the medieval eastern city, the desert, the ancient temple, and many more!\r\n</p>\n<p>You can use the hints tips whenever trickier brain teasers has you stuck.<br/><br/>Why you’ll love Hidden Objects -Between Bad And Good Free seek and find hidden objects game:<br/><br/>- 2000 unique and thrilling treasure hunt scenes<br/>- Many stunning scenes across lots of challenging hidden object games levels<br/>- Pinch Zoom feature to zoom in on those hard to find objects<br/>- Use hint when you get stuck in your hidden object hunt mission 2022<br/>- New mysterious seek and find hidden object game<br/>- Exciting mini puzzle games - Find the differences.<br/>- Amazing sounds and graphics<br/>- Download the “best hidden object game” today<br/>- Collect the maximum amount of points and beat the clock !\r\n</p>\n<p>The puzzles can be played for as many times as you like and there are also many levels to play. Compared to the other scary or highly intensive games, this one is particularly relaxing graphics and music. It is also suitable for kids due to the cute characters and story.\r\n</p>\n<p>Download For Free Now !!\r\n</p>", "metacritic": null, "released": "2022-06-14", "tba": false, "updated": "2022-06-17T16:47:11", "background_image": "https://media.rawg.io/media/screenshots/0bc/0bc82759ffba091fdf7958e33e2ee855.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Islasmeth"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}