{"id": 80365, "slug": "chess-tchess-pro", "name": "Chess - tChess Pro", "name_original": "Chess - tChess Pro", "description": "tChess Pro is the high-quality, critically acclaimed chess game with the richest features for the iPhone, iPod touch, and iPad. It's perfect for every player:<br/><br/>Beginners:<br/>Not everybody is a chess master! Most chess games are too strong or just make random mistakes at easier levels. tChess Pro has unique algorithms to simulate human opponents.<br/><br/>Experts:<br/>tChess Pro has a top-tier chess engine. (Over 380 ELO points stronger than Caissa Chess.)<br/><br/>Enthusiasts:<br/>tChess Pro's Analysis Mode is like having a chess master in your pocket. You can get the engine's \"expert opinion\" about any game or position in real-time: which side is winning, and the best sequence of moves. Just like a professional desktop chess package.<br/><br/>More key features:<br/>- Perfect for 1- or 2-player games<br/>- Strong computer opponent<br/>- Play against any ELO rating from 500 to 2500<br/>- Integrated \"Learn Chess\" e-book app (Apple Staff Favorite!)<br/>- Opening Library feature lets you explore chess opening theory as you play<br/>- PGN Database feature lets you download and view PGN files<br/>- Support for 3-stage time controls with Fischer increments<br/>- Position Editor to enter positions from books, newspapers, etc.<br/>- Save and load games; export them in standard PGN format<br/>- Use the Profile feature to play rated games against the computer and track your progress<br/><br/>tChess Pro is developed by Tom Kerrigan, author of the TSCP and Stobor chess engines.", "metacritic": null, "released": "2008-11-05", "tba": false, "updated": "2019-07-30T06:50:17", "background_image": "https://media.rawg.io/media/screenshots/4cd/4cd2eb0a333ff07f817e54190d9e314c.jpg", "website": "http://www.tchessgame.com/pro.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tom Kerrigan"], "genres": ["Strategy", "Board Games"], "publishers": ["Tom Kerrigan"], "esrb_rating": null}