{"id": 803814, "slug": "r0-concourse-of-conquest", "name": "R0: Concourse of Conquest", "name_original": "R0: Concourse of Conquest", "description": "<p>On an island continent known as Eirea, an eternal war wages between humans. This conflict has been going on for centuries, on and off, a hot debate on how to use resources for the continued development of mankind at the center. Unknown to the people who reside on Eirea, however, a greater, more fated war is about to take place...</p>\n<p>R0: Concourse of Conquest is a game made with a combination of original and RTP assets in SRPG Studio that plays much like somewhat older SRPGs, but with a lot of quality of life that keeps it up to speed with the current generation. A fluid experience with several modes of play, allowing you to choose between a casual, laid back adventure or a brutal fight for survival.</p>\n<p>Along the way, join Laelynn Sinceritas, Princess and heir to the throne of the neutral country of St. Ronika, as she embarks on a journey to reunite with her father, and gets far more than she bargained for. Dragons, angels and secrets of the world of Eirea await in this story penned by a long time fantasy novel writer.</p>\n<p>Current features:<br/></p>\n<ul><li>13 chapters detailing the journey of Laelynn and her army, which currently can grow to a size of 22 members.</li><li>A complex web of interpersonal relationships can be unearthed by using your party members together in battle. Unlock a multitude of 'support conversations' between almost every single pair combination.</li><li>A finely crafted and tuned progression system that carefully maintains a steady power for your army to keep the game challenging and fun.</li><li>7 challenges unlocked after the main game to test the abilities of your army after you've exhausted the current story.</li><li>A comprehensive ranking system that judges your ability and rewards you for play well done, but never makes you feel like a failure.</li><li>Quality of life and polish in every corner of the game to make you feel like you're playing something more modern than what it appears.</li></ul>", "metacritic": null, "released": "2022-06-13", "tba": false, "updated": "2022-06-17T18:30:40", "background_image": "https://media.rawg.io/media/screenshots/5f3/5f3226300a91fa5988a77123b39cf976.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SchwerMuta"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}