{"id": 804115, "slug": "castle-war", "name": "Castle War", "name_original": "Castle War", "description": "In this real time strategy game, defeat your friends by destroying their castle. The last player with their castle still standing wins!<br/>\n<br/>\r\nPlayers must manage their economy, build their base and defenses, while producing and upgrading their units.<br/>\n<br/>\r\nBuild:<br/>\r\n  -House: generates money<br/>\r\n  -Forge: generates iron and upgrades your army's armor (3 different armor types: blunt, piercing, and slashing)<br/>\r\n  -Pillar: generates magic and enchants targeted unit, so that they bypass enemy non-magic armor.<br/>\r\n  -Barracks: recruit and upgrade soldier soldier<br/>\r\n  -Archery range: recruits and upgrades archers<br/>\r\n  -Foundry: recruits and upgrades canons<br/>\r\n  -Wizard tower: recruits and upgrades wizards.<br/>\r\n -Defensive Tower: shoots 3 arrows at enemies in the vicinity.<br/>\r\n -Walls: blocks unit movement.<br/>\r\n -Gate: A wall that can let units go through <br/>\n<br/>\r\nProduce your army from a range of 4 different units: <br/>\r\n   -Archer: attacks from afar with piercing damage but are more accurate at close range.<br/>\r\n   -Soldier: attacks with slashing damage, have higher HP and armor and can change their weapon type to counter their opponent's armor-type<br/>\r\n   -Canon: attacks from a long range causing blunt  damage, effective at taking down enemy defenses.<br/>\r\n   -Wizard: attacks from medium-range, causing blunt damage and can cast powerful fireballs and defensive shields at the cost of MP.<br/>\n<br/>\r\nUpgrade your army:  -There are 3 types of armor upgrades (blunt, piercing, slashing) available to your army, try to upgrade the right ones to counter your opponent's army.<br/>\n<br/>\r\n  -You can also level up your army's units, which will improve their attack power and max health<br/>\r\n  -the cost of upgrades depends on the number of units you own.", "metacritic": null, "released": "2022-06-12", "tba": false, "updated": "2023-04-21T02:32:31", "background_image": "https://media.rawg.io/media/screenshots/e1c/e1c17ad9e773d0c2c7d279d977598341.jpg", "website": "https://www.oneiric-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ztalexgor", "Oneiric Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Oneiric Games"], "esrb_rating": null}