{"id": 80432, "slug": "iq-test-pro-edition", "name": "IQ Test Pro Edition", "name_original": "IQ Test Pro Edition", "description": "Try Best Way To Know Your IQ!<br/>IQ Test Pro Edition. 2 Differents Tests With solutions<br/><br/><br/>Reviews<br/>\"There's always another app claiming to test your brain. This one delivered!<br/>I am very pleased with it. I'll be recommending this to all my friends. It's a great way to get the juices of the mind flowing. I don't know what the actual standard test consists of, however I can imagine it's pretty similar to this apps knowledge base! In closing -Sending my thanks to the developers!\"<br/><br/>\"I can't believe all these people bragging that they got IQ's of 135 and 140. The average is 100. Obviously, most of you people are lying. 3% of people have an IQ of 125 and over. 0.39% have an IQ over 140. One things I say, is that, 'the person who tells everyone how smart they are probably are not.' My sister is is pretty smart and has an IQ of 128. She's going to MIT. I think you people bragging about your iq probably aren't the smartest. If you were really smart, you'd know everyone would just say your lying and not tell everyone your IQ. I think it's a good, accurate app because my sister took a really long iq test and got the exact same score.\"<br/><br/>IQ Test like a Job Interview<br/>Available for iPad and iPhone.<br/><br/>2 different tests! And... IQ average ;)<br/>+39 Questions to get your IQ! iq test.<br/>+33 Questions to get your IQ! European iq test.<br/><br/>With solutions! <br/> <br/><br/><br/>An intelligence quotient (IQ) is a score derived from one of several standardized tests designed to assess intelligence. The abbreviation \"IQ\" comes from the German term Intelligenz-Quotient, originally coined by psychologist William Stern. <br/><br/>NOTE: This test is intended for entertainment purposes only. <br/><br/><br/>Try it.", "metacritic": null, "released": "2013-09-12", "tba": false, "updated": "2019-07-30T08:25:31", "background_image": "https://media.rawg.io/media/screenshots/274/274d23606a97c79761849765f779a768.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Santiago Romani Castroman"], "genres": ["Board Games", "Puzzle"], "publishers": ["Santiago Romani Castroman"], "esrb_rating": null}