{"id": 804307, "slug": "money-dungeon-milo-wilson-wadeparham", "name": "Money Dungeon (Milo Wilson, WadeParham)", "name_original": "Money Dungeon (Milo Wilson, WadeParham)", "description": "<p>This game was made by Wade Parham and Milo Wilson in the fall of 2021. We made almost all of the assets, Milo made the icons and Wade made the characters and animations. Wade did work on the building scene while Milo did work on the main gameplay and game logic. This is supposed to be a quick auto tower defense game where the player can sit back and watch their minions defeat the so-called \"heroic\" adventurers that invade your dungeon. You can change the enemies in the rooms, upgrade the dungeon, and watch adventurers fall to your minions. <br/></p>\n<p>The build of the game is an android APK. I don't personally own an android so I don't know if the APK works, let me know if not and I'll look to fix it. </p>\n<p>Here is a link to a gameplay video on my youtube: </p>\n<p>Lore:</p>\n<p>Greetings! Are you a Lich, Dragon, or Demon Lord wanting to earn some <strong>MONEY</strong> on the side? Consider investing in one of our dungeons! We’ll supply you with a space to call your own and enough <strong>GOLD</strong> to get started defending your home and to attract adventurers! <strong>EARN GOLD</strong>, <strong>COLLECT SOULS</strong>, and save up enough to improve your dungeon with us taking only a fraction(10%) of your profits! The more adventurers you slay, the better dungeon you will have! But don’t get slain yourself, otherwise, there will be a modest(⅓ profits) service fee to revive you! You can even get your <strong>FRIENDS</strong> involved too! There is no better time than <strong>NOW</strong> to buy a dungeon!\r\n</p>", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-06-17T21:53:34", "background_image": "https://media.rawg.io/media/screenshots/a84/a849a8f697cd11ef776da9c74c013cf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Milo Wilson", "WadeParham"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}