{"id": 804764, "slug": "ocha-ken-no-heya-ds", "name": "Ocha-Ken no Heya DS", "name_original": "Ocha-Ken no Heya DS", "description": "<h2>&#39;Ocha-ken no Heya DS&#39; (otherwise known as お茶犬の部屋DS) is a virtual pet simulator developed by MTO for the Nintendo DS. It was first released in Japan on April 27th, 2006, and later localized in the West as &#39;Petz Dogz 2&#39; (produced by Ubisoft). The localization retextured the tea-like dogs to be based on real breeds, and shares assets with &#39;Kawaii Koinu Wonderful&#39; (かわいい仔犬ワンダフル); another game developed by MTO.</h2>\n<p>Based on the official children&#39;s toyline produced by (J) SEGA Toys, Ocha-Ken invites you into a 3D house filled to the brim with tea-like dogs and cats to take care of! With a dollhouse setting in mind, you may adorn your six floors in any way you wish- with over 256 objects, decorate them with furniture, bowls of food, toys and outdoor equipment of your own choosing; each with its own purpose for your pets to interact with.</p>\n<p>When you feel you and your tea pets have had enough of the house, you can venture out into the village to try out some of the activities they have to offer. With leisurely prizes to be won, have a go at 16 minigames like poker and blackjack, bowling, hide and seek, portrait painting, and rhythm-based games to further your item collection. Continue building it up, and you and your tea pets will have their dreamhouse of glories!</p>", "metacritic": null, "released": "2006-04-27", "tba": false, "updated": "2022-06-22T01:45:18", "background_image": "https://media.rawg.io/media/screenshots/589/589d004b0fb970b65ff723d237e87d94.jpg", "website": "http://www.ocha-ken.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 9, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["MTO"], "genres": ["Simulation", "Casual"], "publishers": ["MTO"], "esrb_rating": "Everyone"}