{"id": 80485, "slug": "chessbase-online", "name": "ChessBase Online", "name_original": "ChessBase Online", "description": "The whole history of chess in an app: 5 million chess games from 1624 till 2014! And every week new games from world class tournaments are added to it. <br/>You can look through on your iPad ( or iPhone or iPod touch)  all the great tournaments, like Zürich 1953 or the Fischer-Spassky match 1972, the chess detective story Karpov versus Korchnoi 1978 or Nakamura's amazing victory in Wijk aan Zee 2011. Or you can load the games of Magnus Carlsen and see what makes the young Norwegian so irresistible. And you can also study the latest opening variations and access statistcs for all opening positions. Whether you are a chess professional or an amateur: the ChessBase Online database will become indispensable from the first time you use it. <br/><br/>Features:<br/>• 6 million games of chess: carefully edited and maintained by the ChessBase team of grandmasters<br/>• weekly games update:  up-to-date material from all important tournaments <br/>• searchable by opening position, player, tournament, year <br/>• super-rapid system response times <br/>• for every opening position, all the moves and the statistics<br/>• professional board graphics in 5 designs, with coordinates<br/>• easy move entry<br/>• games presented with complete notation<br/>• access to player info, including pictures<br/>• Engine (iPhone and iPod Touch: landscape only)<br/>• Import PGN files through iTunes file sharing", "metacritic": null, "released": "2011-04-13", "tba": false, "updated": "2019-10-22T14:23:04", "background_image": "https://media.rawg.io/media/screenshots/00b/00b7c66c0f68b9b77cae9033741887da.jpg", "website": "http://fritzmobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["ChessBase"], "genres": ["Strategy", "Board Games"], "publishers": ["ChessBase Schachprogramme- Schachdatenbank Verlags"], "esrb_rating": null}