{"id": 804818, "slug": "the-hotel-3", "name": "The Hotel", "name_original": "The Hotel", "description": "Do you remember when survival horror games where different?<br/>When weapons and ammo were limited?<br/>When \"TANK CONTROLS\" were a thing?<br/>Or when there were only \"fixed camera\" angles?<br/><br/>Well then you'll love <strong>The Hotel</strong>! <br/>Inspired by survival horror games of the last decade, The Hotel follows the story of Alex and Judie, as fate leads them to a dark and forgotten hotel while on vacation.<br/><br/><br/>It's not long before they are plunged into terror and encounter zombies and other creatures. In order to survive, they must solve a series of puzzles, find hints, and grab all the weapons and ammo they can find. Will they be able to escape? Only you can decide.<br/><br/>The main game takes place in an hotel that has almost 90 different rooms to explore and secrets to find. You'll need to solve puzzle to progress through the story. Some are easy, while others are more tricky. Your ammo reserves will be limited, so you'll need to play smart in order to stay alive and escape.<br/><br/>The Hotel features two different routes:<br/>At the beginning you will play as Alex. Once you finish his route, Judie will be unlocked and you'll play through a slightly different version of the story.<br/><br/>Finally, the choices you make along the way will unlock different costumes for your characters. Can you find them all?<br/><br/>The Hotel is fully compatible with Xbox(TM), Playstation(TM) and 8BitDo(TM) controller", "metacritic": null, "released": "2022-06-17", "tba": false, "updated": "2022-11-18T06:30:56", "background_image": "https://media.rawg.io/media/screenshots/9ad/9ad69b3034f42d5d8d21d35fb0ea66cb.jpg", "website": "https://www.fearmyhotel.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1, "dropped": 1}, "playtime": 4, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["IL PALA", "Constant_Art"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["IL PALA", "Constant_Art"], "esrb_rating": null}