{"id": 804855, "slug": "anger-foot", "name": "Anger Foot", "name_original": "Anger Foot", "description": "<p>Anger Foot is a lightning-fast hard bass blast of kicking doors and kicking ass. Crash through the caffeine-fueled fever dream of Shit City, putting the boot to a menacing menagerie of merciless gangsters.<br />\nUnleash the world&#39;s deadliest feet on a colorful cast of anthropomorphic enemies. Clearing out slums, sewers, and skyscrapers as you grab new weapons, unlock new sneakers, and upgrade your powers in absurd and wonderful ways. Kick and shoot your way to the exit as you leave behind a smoldering trail of shattered doors, broken bones, and crumpled energy drinks.Fast-Paced Ass Kicking ActionShit City is a disease and your foot is the cure. Lace-up a capricious collection of formidable footwear to fight through a diverse series of deranged city districts.Vibrant Visuals, Relentless BeatsEnjoy a concussive, bass-thumping soundtrack as you stampede through a feverish criminal underworld. An assault on all your senses. Including common sense.Run. Kick. RepeatAre you the god of style, speed, or power? Discover secrets and unlocks that encourage replayability - and learn to tackle levels in new creative, ridiculous, and devastating ways.Master The FootBecome one with the toes and be quick on the trigger. Your skills must surpass human comprehension if you are to prevail and learn the secret of the Anger Foot.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2024-04-05T18:04:15", "background_image": "https://media.rawg.io/media/screenshots/778/77898961e7645e88a2297b1bd2611810.jpg", "website": "", "rating": 3.71, "rating_top": 4, "added_by_status": {"yet": 20, "owned": 28, "beaten": 4, "toplay": 63, "dropped": 7, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 16, "suggestions_count": 641, "game_series_count": 0, "reviews_count": 17, "platforms": ["Linux", "PC", "macOS"], "developers": ["Free Lives"], "genres": ["Action", "Shooter"], "publishers": ["Devolver Digital"], "esrb_rating": null}