{"id": 804879, "slug": "jurassic-world-dino-hunting", "name": "Jurassic World Dino Hunting", "name_original": "Jurassic World Dino Hunting", "description": "Dinosaur Hunting survival game is the latest hunting adventure game, you are stuck in the jungle on your visit of with other players exploring jungle when your helicopter crashed and you are fallen in the jungle to shoot down realistic 3D dinos and dinosaurs dangerous babies. Get this Dinasour shooter game, and make your name to aim and shoot to survive till the end and shoot down the target dinosaurs in this jungle survival dinosaur shooter game. The game is quote simple get your target weapon from the environment and hunt for the final destination point get yourself survive from the dangerous dinosaurs attack and use your Advanced skills where the number of dinosaurs will increase. Use rifles, shotguns, machine guns and other assault rifles collected from the environment and make sure to get your kills complete your survival mission.<br/><br/>Be careful from the attack of dinosaurs coming in the form of waves and groups always be alert. use your gun shooting skills and an archer shooting Dynamics in this  Jurassic game of dinosaurs to make your name on the top list of dangerous dino shooter games free for gun shooters! experience this one of the best dinosaur shooting game with the different weapons perfect aim can give your more kills and increase your chance to survive, you can kill with sniper shooting as well where distant dino hunt needed, your escape from this raft island is only possible with your shooting skills as a real dino hunter. enjoy one of the best  survival era dinosaur hunting game and survive from this horror island.", "metacritic": null, "released": "2018-08-17", "tba": false, "updated": "2022-06-20T09:46:45", "background_image": "https://media.rawg.io/media/screenshots/2d8/2d82608d6fae4f9e6ea2d9df064935fc_9vrwCOC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["nauman aftab"], "genres": ["Action", "Adventure"], "publishers": ["nauman aftab"], "esrb_rating": "Teen"}