{"id": 804971, "slug": "iracing-companion", "name": "iRacing Companion", "name_original": "iRacing Companion", "description": "Are you looking for a reliable race schedule and stats app for iRacing that will inform you about upcoming races?<br/><br/>An iRacing schedule app that will let you add race reminders and sync your account on multiple mobile devices via the cloud?<br/><br/>Meet the iRacing Companion App – the official companion app of iRacing members. With the iRacing Companion App, you’ll never miss an event, and you’ll be able to stay on top of your iRacing profile.<br/><br/>Get the iRacing calendar, follow your favorite series, add reminders for races, leagues, and series, watch upcoming races, and much more directly from your phone.<br/><br/>►PROFILE<br/>Sync your iRacing account and see all your licenses, statistics, and last race times in one place.<br/><br/>►SERIES<br/>Explore all available series for each of your licenses. Favorite any series you like and have them quickly accessible in your favorites section. Also, add reminders for Series.<br/><br/>►UPCOMING RACES<br/>Have a clear overview of all upcoming races on iRacing. Filter your search by series, category, licenses, setup, and multiclass. View the time, conditions, schedule, standings, session times, and information for each race. Add reminders for any race and add races to your favorites.<br/><br/>►REMINDERS<br/>Add reminders for leagues and official series. The app will notify you before the race starts!<br/><br/>►NEWS<br/>Don’t miss any important updates for iRacing. See exciting updates from iRacing’s pro esports series, as well as content previews, gift cards, contest updates, and more.<br/><br/>►MY LEAGUES &amp; CONTENT<br/>View all of the leagues you have joined and add race reminders. Additionally, view and filter all your owned content on iRacing by owned/unowned, type, release, and price.<br/><br/>►ACCOUNT SYNCING<br/>All of your account data like reminders, notifications, time settings, owned content, and preferences are now synchronized on the cloud. Everything will be updated and synced automatically on up to three devices.<br/><br/>Now it’s time to take your iRacing career to a new level.<br/><br/><br/>Get the iRacing Companion App now and see why our users name it a must-have companion app for iRacing!", "metacritic": null, "released": "2022-06-08", "tba": false, "updated": "2022-06-20T11:12:58", "background_image": "https://media.rawg.io/media/screenshots/0f5/0f53f93d970485fa95faec7f781a25d7.jpg", "website": "https://support.iracing.com/support/home", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iRacing co Motorsport Simulati"], "genres": ["Simulation", "Racing"], "publishers": ["iRacing co Motorsport Simulati"], "esrb_rating": "Everyone 10+"}