{"id": 804905, "slug": "texas-holdem-live", "name": "Texas Holdem Live", "name_original": "Texas Holdem Live", "description": "Wanna play authentic Texas Hold’em Poker with real-time video chat?<br/>Wanna meet poker lovers from different countries across the world face-to-face?<br/>Wanna become a poker pro listed on the World Ranking?<br/>Wanna have an exciting poker time with your close friends? <br/>Get PokerLover now, and join the interesting face-to-face Hold’em game for free!<br/><br/>PokerLover is a Video Chat Hold’em Poker Game App that brings millions of poker lovers together without time and space limitations.<br/><br/>Features:<br/>1. SOCIAL EXPERIENCE: Enjoy poker time with your friends at the Friend Table, or talk to new friends face-to-face by playing the accessible Hold’em poker game.<br/>2. VIDEO CHAT HOLD’EM: Play and meet real players from home and aboard! Ready to show off your poker strategies? PokerLover might be exactly what you need.<br/>3. FRIEND SYSTEM: Follow poker masters on the World Ranking or players you met during the game! Send a nice gift or item to your friends, or sell your gifts for coins when you need to. Our constantly updated Coin Store will surely satisfy your expectation!<br/>4. STICKERS &amp; ITEMS: Various gifts and items enable interesting social interaction for both you and your friends.<br/>5. ABUNDANT BONUS: Get a welcome bonus of 2M FREE coins with your first log in at PokerLover! Then, claims the novice rewards of up to 12M coins with simple tasks. Remember, more interesting events and game modes are coming soon.<br/>6. FAIR AND REAL: Strategies, practice, and luck are all you need here! Players get cards that are randomly shuffled just like off-line poker games. <br/><br/>What are you waiting for? Join PokerLover, practice Hold’em skills and become a famous Hold’em Star!<br/><br/>We value your feedback! Write down your likes and dislikes about PokerLover on any App platform. Or you can contact us via E-mail: DynaTechnologyLimited@gmail.com<br/><br/>*Notice: Success at a social poker game does not imply future gains at real money gambling.", "metacritic": null, "released": "2021-12-22", "tba": false, "updated": "2022-06-20T10:12:58", "background_image": "https://media.rawg.io/media/screenshots/c73/c73d2801a0bc4b4162262781747dc17e_PcFjCCy.jpg", "website": "https://h5.livetexaspoker.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BUYLIVE TECHNOLOGY HONG KONG"], "genres": ["Board Games", "Card"], "publishers": ["BUYLIVE TECHNOLOGY HONG KONG"], "esrb_rating": "Mature"}