{"id": 804912, "slug": "ludo-legends-board-games", "name": "Ludo Legends Board Games", "name_original": "Ludo Legends Board Games", "description": "Learn how to move your red, yellow, green or blue pieces with strategy and luck on the best looking games board of this online dice app. This is a fast, dice roll based free board game that involves both luck and skill (just like parchisi, parchis)! Master the various tips and tricks of this exciting dice game and show your best talent to everyone! Be the ludo king of the world and become a ludo star!<br/><br/>Modern version of the royal game of Pachisi. A Ludo game which was played between Indian kings and queens in ancient times. Roll the Ludo dice and move your tokens to reach the center of the Ludo board. Become the Ludo King.<br/><br/>It is also known as Pachisi, and is very similar to a Spanish board game, Parchís.<br/><br/>New version of Ludo Star game which is free to play and can be played between friends and family. It is the game to share the great interests and childhood memories with your friends. Show us if you can master this game. A perfect Ludo Board Game that was loved by Mughals, Mahabharat 's King and many old king of India and world. It if for all Star of Ludo<br/><br/>How the play:<br/><br/>Ludo game starts with four tokens placed in each player's starting box. A dice is rolled in turns by each player during the game. The player's token will be placed on the starting point when a 6 is rolled on the dice. The main goal of the game is to take all 4 tokens inside the HOME area before the other opponents.<br/><br/>Basic rules:<br/><br/>- A token can start to move only if the dice rolled is a 6.<br/>- Each player gets a turn wise chance to roll the dice. And if the player rolls a 6, they will get another chance to roll the dice again.<br/>- All the tokens must reach the center of the board to win the game.<br/>- The token move clock-wise according to the number of rolled dice.<br/>- Knocking out other's token will give you an extra chance to roll the dice again.<br/><br/>Enjoy playing the best offline version of the Ludo game anytime anywhere with your friends and family.", "metacritic": null, "released": "2022-05-09", "tba": false, "updated": "2022-06-20T10:19:09", "background_image": "https://media.rawg.io/media/screenshots/515/515c688c759be2096f528aad7357bef6_FqyAWe1.jpg", "website": "https://www.oneup.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["One Up Games Studio"], "genres": ["Strategy", "Board Games"], "publishers": ["1UP GAMES STUDIO"], "esrb_rating": "Everyone 10+"}