{"id": 804974, "slug": "crazy-office-slap-smash", "name": "Crazy Office — Slap & Smash", "name_original": "Crazy Office — Slap & Smash", "description": "Get revenge on your boss!<br/><br/>It's another day at the office, and your boss is making you work overtime again. What a jerk! It's time to square your accounts. But before you whack your boss in real life, try Crazy Office—the smash-hit office game. <br/><br/>You think you’ve seen enough crazy games, huh? This office game will prove to be crazier than all the other work games you’ve ever played. <br/><br/>Today, your office is your wreck room, so let all your rage out. Turn off your brain and start wreaking havoc: fight your colleagues, kick your buddies, crash furniture, smash computers, and unleash complete anarchy on the entire office floor. Turn your anger into relaxation as you fight through the bootlicking white collars, pesky managers, and stupid security guards. <br/><br/>Try to destroy the entire office to get to your final target—the CEO. All your life you wanted to beat the boss, and now you finally can get your sweet revenge! From office supplies to golf clubs—there is an arsenal of weapons to smack your boss with. Have fun while you kick your buddies and beat the boss in this satisfying slap game. Plenty of work games will let you vent, but none quite like this one! This smash-hit slap game is surely the healthiest way of dealing with office stress and rage, short of yoga classes or breathing exercises. <br/><br/>Are you ready for the best day at the office?<br/>Exciting boss fighting. Dare to whack your boss and become the slap king of the month. <br/>Satisfying office room smash. This wreck room simulator has no limits—destroy the office rooms and fight your annoying coworkers!<br/>Cool 3D graphics. The most realistic office experience is guaranteed!<br/>Countless office maps. Be careful to not get lost in the office room maze.<br/>Unlimited arsenal of weapons. Smack your colleagues and beat the boss using whatever object you can find!<br/><br/>Crazy Office is the office game that you all have been waiting for! It’s nothing like the innocent work games you might have played before. Download this exciting slap game now and show ‘em who's the real boss of this office!", "metacritic": null, "released": "2022-05-18", "tba": false, "updated": "2022-06-20T11:15:42", "background_image": "https://media.rawg.io/media/screenshots/c24/c24d56884265ce9b0252d5ffb48c9059_FSWc43t.jpg", "website": "https://tap2play.me/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Freeplay"], "genres": ["Action", "Casual"], "publishers": ["Freeplay"], "esrb_rating": "Teen"}