{"id": 804928, "slug": "boxing-star-fight-hit-action", "name": "Boxing Star Fight: Hit Action", "name_original": "Boxing Star Fight: Hit Action", "description": "Get ready to be a part of an excited crowd, and impress them with your excellent boxing styles to prove to them that who is the greatest fighting world boxer. Real punch boxing game is designed for fighting enthusiasts and loves that idealize a good ring fighting. This game will let you go face to face with heavy weight boxers, get yourself trained to be able to stand a chance against them. You have the option to customize your player by giving them new fighting accessories like shorts, gloves, tattoos etc. Upgrade the strengths of your fighter now to knockout your opponents. Learn how to hook, face punch and jab with this game’s help. Get ready to start a creed wrestling tournament sports.<br/> <br/> <br/>This game has different modes:<br/> <br/>1.    Career Mode:<br/> <br/>If you are able to take risks and defeat the world strongest fighters then play in the career mode. Defeat all your opponents and be quick while making kick and taking shots in this mega brawl. Become a legendary creed ring boxer and win. Dodge your opponents and use your power and excitement for the match while playing martial arts sports.<br/> <br/> <br/>2.    Tournament Mode:<br/> <br/>In tournament mode which features boxers competing in different weight divisions. Fight using your best moves and through kick and punches at the opponents like a champion that you are. Dodge them, fight and take multiple shots to defeat them in this brawl.<br/> <br/> <br/>This game provides a personalized experience by giving option to customize your avatar. Intuitive touch controls and smooth gameplay will keep you hooked. Game has multiple creed challenges and levels play through to reach to the end. Awesome background music and environment will keep you engaged till the end. Get promoted in the game by defeating all the fighters. Try to survive in knockout levels to unlock more.<br/> <br/>Use your Martials arts boxing moves like a PRO wrestler. Your opponents might use expert punches and heavyweight fighting techniques. Beat them to their own fight and let them know who is a champion at boxing game. Feel every jab, KO and hook uppercut because of the most intuitive controls in top world fighting games on your mobile phone. They may be coming from kung Fu, taekwondo, samurai or UFC background, but you’ve got the ultimate boxing gloves fight like a star and become a new hero like Rocky.<br/> <br/>Real World Boxing: KO Star Features:<br/> <br/>• Select and customize your boxer with latest fighting gears<br/>• Real punch boxing fights &amp; training simulation game<br/>• Unlock super punches to surprise your rivals<br/>• Competition against strongest fighters to become superstar<br/>• Ultimate action packed punch boxing challenges<br/>• Realistic actions and genuine punch boxing moves", "metacritic": null, "released": "2021-12-07", "tba": false, "updated": "2022-06-20T10:33:29", "background_image": "https://media.rawg.io/media/screenshots/0e4/0e4e3e028c52cb6ecf92a6b4e6039a95_TGl39C1.jpg", "website": "http://bulkysports.xyz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bulky Sports"], "genres": ["Action", "Sports"], "publishers": ["Bulky Sports"], "esrb_rating": "Teen"}