{"id": 80497, "slug": "whip-swing", "name": "Whip Swing!", "name_original": "Whip Swing!", "description": "To become the world's most famous adventurer, pick up your trusty bullwhip and travel as far as you can across a field of spikes by swinging along the ceiling. Once you’ve started, there’s no rest until the game is over. Your whip is all that keeps you safe from a world of spikes below. You have to use all your skills in order not to fall down, try to do your best!<br/><br/>Game play is easy to learn but hard to master. If you hit a gap between the tangled branches you may fall into the spikes below. As you progress in the game, gaps become more frequent and larger, the spikes raise up and you'll need to avoid geysers and sharp rock pillars! Whip Swing is perfect for a 5 minute break but beware, it's hard to stop playing.<br/><br/>FEATURES<br/>• Simple one-touch gameplay and quick replays.<br/>• No Ads, No in-app purchases<br/>• Save &amp; share your progress and unlock achievements on Game Center.<br/>• Using the integrated Social Media sharing, easily share a screenshot of your best distance!<br/><br/>HOW TO PLAY<br/>Touch anywhere on screen to whip &amp; swing, lift your finger to release the whip.<br/><br/>WE VALUE YOUR FEEDBACK<br/>If you like our app, please take a minute to rate and review it.<br/><br/>If you have any questions or need help, please reach us at http://www.pixelenvision.com/support/ or by sending an email to support@pixelenvision.com", "metacritic": null, "released": "2014-12-18", "tba": false, "updated": "2024-01-05T19:14:37", "background_image": "https://media.rawg.io/media/screenshots/bad/bad8ca70530ae70517c3b26dcd383b4c.jpg", "website": "http://www.pixelenvision.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Pixel Envision"], "genres": ["Action", "Arcade"], "publishers": ["Pixel Envision"], "esrb_rating": "Everyone 10+"}