{"id": 804955, "slug": "echoes-of-magic", "name": "Echoes of Magic", "name_original": "Echoes of Magic", "description": "Echoes of Magic is a fantasy MMORPG where you can customize your hero however you want!<br/>Join now to set foot on an adventure &amp; build the strongest hero to protect your homeland!<br/><br/>Game Features:<br/><br/>&gt; Customize Your Classes<br/>In EOM, there is no class limit. Your class depends on your weapons and skills.<br/>Mage, Archer, Warrior... Fire, Frost, Evil... Over 20+ classes await you!<br/>You can go full-on warrior or be a hybrid of Assassin &amp; Mage -- it's your call!<br/><br/>&gt; Customize Your Skills<br/>Feeling bored to use the same skills repeatedly? Come to EOM and customize yours!<br/>Combine Guardian's Shield Wall with Mage's Blizzard. You can be a tanky warrior and a ranged DPS at the same time.<br/>Use Shaman Skills with any others and enjoy the thrill of unlimited skill casting!<br/><br/>&gt; Endless Combat Variety<br/>Over 10 different maps + Over 100 monsters + A pool of random skills + Freedom to choose = Never having the same combat experience ever!<br/><br/>&gt; Collect Assorted Mounts<br/>Now you can get mounts of all shapes and sizes in EOM -- the perfect partners for adventure!<br/>Radian Unicorn, Royal Lion... each of them has a unique appearance. Get them now and really shine~<br/><br/>&gt; Brand New Accessory System<br/>You can get tons of accessories in the Magic Rift which provide you with stat bonuses, skill strength, and even new abilities when collected as a set!<br/>All of the secret powers are waiting for you to identify! You can also transfer specific stats to a target accessory and build up your own set! You'll be invincible!<br/><br/>&gt; New Boss Hunting Event<br/>During the event, you'll have a chance to get clues and discover powerful bosses in daily battles.<br/>Beat them alone, or share the boss to your friends and guild members to challenge together! Each challenge will heap upon you rich loot and glorious honor!<br/><br/>&gt; Fair PVP<br/>New season of PVP mode Survival Arena is live! 8-person matches, random skill pools, and custom-picked classes &amp; skills! Fight with bosses, other players, and survive until the very end to become the Champion!<br/><br/>&gt; Make Friends Worldwide in Town<br/>Don't forget to join a guild and make friends when you walk in Ravine Town!<br/>Maybe you'll march side by side to achieve victory in the upcoming co-op mode!<br/><br/>PLEASE NOTE! Echoes of Magic is free to download and play, however, some game items can also be purchased for real money. If you do not want to use this feature, please set up password protection for purchases in the settings of your App Store. Also, under our Terms of Service and Privacy Policy, you must be at least 9 years of age to play or download.<br/><br/>Contact Us<br/>Official FB Fanpage: https://www.facebook.com/EOMGlobal<br/>Official Discord: https://discord.gg/4jSaCgbRyq<br/>Email: eom@onefun.ink", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2022-06-20T10:59:36", "background_image": "https://media.rawg.io/media/screenshots/659/65988cb23b3ee0a48ec9635b86aa9eb2_kwu491j.jpg", "website": "http://www.onefun.ink/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Shanghai Onefun Co"], "genres": ["Action", "RPG"], "publishers": ["Shanghai Onefun Co"], "esrb_rating": "Everyone 10+"}