{"id": 804913, "slug": "rich-inc-idle-life-simulator", "name": "Rich Inc. Idle life simulator", "name_original": "Rich Inc. Idle life simulator", "description": "Imagine you’re completely broke and have nothing but dreams! How are you going to get yourself out of poverty? Can you overcome all the obstacles and change your life?<br/><br/>You’ll have to start from the bottom, living in a small dormitory room, you'll got no job and no money in your pocket. Find yourself a job to make money for living. If you work hard, you’ll move up fast, find a better job and climb up the career ladder. Build up an amazing career, become a wealthy and respected member of society.<br/><br/>Enjoy playing one of the most exciting real life simulators! This game is as close to real life as it gets. Don’t forget to keep vitals of your character in balance, because they effect the game. Think carefully about your every next step. Your decisions can lead your sim to becoming a millionaire as well as starving to death on the streets.<br/><br/>Maintain good relationships with friends and coworkers. Find yourself a soulmate and make<br/>a virtual family. And don’t forget to treat your character right. Go to gym and hospital, have some<br/>rest, otherwise you won’t have enough energy to build the life of your dream!<br/><br/>Main features:<br/>Earn money, become richer and buy more fancy virtual stuff such as supercars, designer clothes and mansions.<br/>Learn new skills and try various professions to make more money.<br/>Take important decisions that will affect the life of your character, choose wisely, and you’ll end up a millionaire.<br/>The rich also cry, so don’t forget to keep up your spirit by attending concerts, going to<br/>bars or playing in casinos.<br/>Try your luck playing mini games, such as slot machine.<br/><br/>Play Rich Inc. to experience what it’s like to go from rags to riches. Try to become the richest man alive with our life simulator!", "metacritic": null, "released": "2022-05-07", "tba": false, "updated": "2022-06-20T10:20:11", "background_image": "https://media.rawg.io/media/screenshots/3b7/3b729259690e2c217e360a1f3e5b5c4b.jpg", "website": "http://idsigames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IDSI ARASTIRMA GELISTIRME YAZILIM BILGISAYAR SANAYI VE TICARET LIMITED SIRKETI"], "genres": ["Strategy", "Simulation"], "publishers": ["IDSI ARASTIRMA GELISTIRME YAZILIM BILGISAYAR SANAYI VE TICARET LIMITED SIRKETI"], "esrb_rating": "Teen"}