{"id": 805079, "slug": "nuclear-springtime", "name": "Nuclear Springtime", "name_original": "Nuclear Springtime", "description": "<p>Explore your surrounding. Plant some sunflowers. Breed new sunflowers. Decontaminate bramble. Expand your humble farm. <br/></p><p>Nuclear Springtime started out as a pandemic coding project to teach me how to use Godot for video game development. I had dreams of expanding it into a full-fledged game, but my architecture isn't scalable enough to do that, so I'm publishing the demo game as-is for whoever wants to take a look. Also check out the 10 track soundtrack on Bandcamp: https://linraesel.bandcamp.com/album/nuclear-springtime-ost<br/></p>\n<p>Music, sprites, code, and virtually everything else except fonts were made in-house. Demo takes less than an hour to complete and contains button remapping functionality. Supports two keyboard configurations and Dualshock controllers (plus Playstation and Nintendo according to Godot, although I haven't tested this).</p>\n<p>I've removed as many major bugs as I can, but there are definitely some left. I'm sorry about that. My next project will be better constructed to let me remove them more easily, but I know my limits well enough to know that this is as far as I'm getting with this one.</p>\n<p>Known issues:</p>\n<p>--I never implemented the tool quickselect<br/></p>\n<p>--Intro + rules never made it into the menu like I promised in-game<br/></p>\n<p>--Pressing cancel from the menu when you have zero actions teleports you into the bunker instead of closing the menu<br/></p>\n<p>--Menus and assets don't always display nicely on larger monitors<br/></p>", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-06-20T12:36:52", "background_image": "https://media.rawg.io/media/screenshots/c3d/c3df34b76438c8cd9a3f96b3b288fc32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["linraesel"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}