{"id": 805017, "slug": "diablo-immortal-2", "name": "Diablo Immortal", "name_original": "Diablo Immortal", "description": "A GROUNDBREAKING DIABLO EXPERIENCE<br/><br/>Diablo Immortal™ is a brand-new mobile game from Blizzard Entertainment. A genre-defining action role playing game series set between the events of Diablo® II: Lord of Destruction® and Diablo III®. <br/><br/>Clash with armies of demons, collect epic loot, and gain unimaginable power.<br/><br/>Explore the dark realm of Sanctuary like never before, now a massively multiplayer online role playing game (MMORPG) where angels and demons wage an endless war over dominion of the mortal realm. Join forces with other players on an epic quest to collect the shattered fragments of the corrupted Worldstone and prevent the Lord of Terror’s return. <br/><br/>Fans of Diablo and new players alike will embark on new adventures across a vast open world RPG game. <br/><br/>SLAY YOUR WAY<br/><br/>Customize your character and gear! Diablo Immortal gives you unprecedented flexibility to be who you want to be in the vast MMORPG world of Sanctuary.<br/>-\tBarbarian, Demon Hunter, Monk, and Wizard: Choose from four highly iconic and customizable classes.<br/>-\tGain new abilities with each successful encounter and clash to become the most powerful player in the arena of war. <br/>-\tGear up with all-new set items and legendary weapons.<br/>-\tLevel up your favorite weapons so they can grow in power alongside you. <br/><br/>VISCERAL, FAST-PACED COMBAT<br/><br/>Peerless MMORPG gaming experience delivering the best PC mechanics into snappy, intuitive controls on your mobile device. <br/>-\tAlways feel at command. Whether you’re on a raid or fighting hordes of demons solo. <br/>-\tDirectional controls make it easy to move heroes around the world<br/>-\tActivating a skill is as easy as holding a thumb down on a skill to aim, then release to unleash hell on your foes.<br/>-\tCross-platform and cross save - Experience role playing games online with your PC or Mobile<br/><br/>EXPLORE A VAST WORLD<br/><br/>From the war-torn surroundings of Wortham to the grand city of Westmarch and the shadows of the Bilefen Jungle - Players have a vast world in front of them to explore. <br/>-\tYour journey will take you through changing landscapes and ever evolving challenges.<br/>-\tExperience a rich Diablo story packed with quests, bosses, and challenges the Diablo series has never seen, including raids in huge ever-changing dungeons. <br/>-\tDiablo Immortal has something for everyone whether you enjoy fighting through endless dungeons or spending your time uncovering every corner of the world.<br/><br/>A MASSIVELY MULTIPLAYER EXPERIENCE<br/><br/>Players will have countless opportunities to meet and socialize with their fellow adventurers in the world of Sanctuary. Whether it's jumping into the arena of battle, embarking on a raid through the shadows of a dungeon, or upgrading gear - Diablo Immortal is here to support a rich MMORPG experience.<br/><br/>", "metacritic": null, "released": "2022-06-01", "tba": false, "updated": "2022-06-20T11:54:20", "background_image": "https://media.rawg.io/media/screenshots/991/991e9272c09e4e010ed5cab4890d5a06_FBafDPU.jpg", "website": "https://diabloimmortal.blizzard.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": [], "genres": ["Action", "RPG"], "publishers": ["Blizzard Entertainment"], "esrb_rating": "Mature"}