{"id": 805049, "slug": "adventure-sheet-for-gamebooks", "name": "Adventure Sheet: for Gamebooks", "name_original": "Adventure Sheet: for Gamebooks", "description": "Tested and approved on a large range of other Game Book series including \"Fighting Fantasy\" and the famous \"Lone Wolf\" saga.<br/><br/>Armed with the interactive adventure sheet, you will be ready to fully enjoy your favourite choose your story game book with a modern character sheet that keeps the vintage charm of the good old paper, pen and book setup.<br/><br/>PLAY YOUR OWN WAY<br/><br/>The interactive adventure sheet does not make any decisions for you, it simply accompanies you and your hero on your adventure in the traditional spirit of choose your own adventure and choose your story game books. The character sheet app adapts to your play-style, provides you with a dice roller if you do not wish to use real dices, allows you to either generate random characters sheet or create your very own.<br/><br/>The adventure sheet brings you quality of life and takes care of all the hassle!<br/><br/>GENERATE UNLIMITED HEROES<br/><br/>You can generate a random character sheet or customise your hero's stats exactly the way you want.<br/><br/>EXPERIENCE EPIC BATTLES (Adventure is a dangerous business)<br/><br/>All adversaries have their own set of dice, enabling you to fight several enemies at the same time.<br/><br/>MANAGE YOUR INVENTORY<br/><br/>The inventory will let you manage your hero loot and keep track of your meals and potions thanks to the smart items counter system.<br/><br/>TAKE NOTES<br/><br/>The logbook allows you to take as many notes as you deem necessary. Always have your clues on hand to crack even the darkest of mysteries without having to get through the entire book again.<br/><br/>CREATE BOOKMARKS<br/><br/>The bookmark system allows you to keep track of your progress in any choose your own story game book and leave a breadcrumb trail behind you. Just resume your adventure where you left it.<br/><br/>Be a hero and download the Interactive Adventure Sheet for Choose Your Own Adventure Game Books (CYOA) now and set off on your own adventure!<br/><br/>This app does not contain any choose your story, choose your own adventure or any CYOA books.<br/><br/>Follow us on https://twitter.com/madmustachecom1", "metacritic": null, "released": "2020-04-30", "tba": false, "updated": "2022-06-20T12:23:33", "background_image": "https://media.rawg.io/media/screenshots/51f/51fece93ad00bccc6649932e2936d89a_hpNXC86.jpg", "website": "https://www.facebook.com/madmustachecompany", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexandre Guidet"], "genres": ["Adventure", "RPG"], "publishers": ["Alexandre Guidet"], "esrb_rating": "Everyone 10+"}