{"id": 805034, "slug": "nova-iron-galaxy", "name": "Nova: Iron Galaxy", "name_original": "Nova: Iron Galaxy", "description": "-An Imposing Republican Space Station-<br/>In the dark and dangerous void, your imposing space station will be your haven and base. Complete Republican Orders and adjust your strategic deployment regularly. A powerful space station will be your first step toward the conquest of the galaxy. <br/><br/>-Unstoppable Space Armada-<br/>Select wisely among various warship blueprints. Forge your unique fleets with modular designs and assembling systems. Plan out your strategic options carefully and join in unprecedented space battles. Your choice will affect the outcome of every battle you’ll fight in.<br/><br/>-Establish Your Intergalactic Alliance-<br/>After the “Supernova Event”, the whole Renney Sector is in deep turmoil. In this chaotic state, you need to build a powerful intergalactic Alliance with the people you trust most. The future of the Renney Sector now depends on your cooperation.<br/><br/>-Endless Stars Endless Stories-<br/>Send out your fleets to explore and investigate the sector. Witness whimsical stories and the impressing intergalactic epic.<br/><br/>-And More-<br/>A Dyson Sphere is now available for takeover in “Goliath Galaxy”, the truth behind the “Supernova Event” is still lying in the dimming void. The Republic and the Coterminal have gone silent since the universal cataclysm. You and your Alliance will decide the future of the Renney Sector. Will you use your unchallengeable diplomatic mind to reach your strategic goal? Or are you planning to expand your territory with bloodshed? An interstellar journey unlike any other is about to unfold. <br/><br/><br/>SUPPORT<br/>Email us at support@gamestone3.com<br/><br/>Follow Us on Facebook<br/>https://www.facebook.com/NovaIronGalaxy/", "metacritic": null, "released": "2022-05-07", "tba": false, "updated": "2022-06-20T12:08:58", "background_image": "https://media.rawg.io/media/screenshots/694/69481e209e77089cce6d2b8a3f1be925_bKJnwAi.jpg", "website": "http://gamestone3.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 491, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["STONE3"], "genres": ["Strategy"], "publishers": ["STONE3"], "esrb_rating": "Everyone 10+"}