{"id": 8051, "slug": "dawindci-deluxe", "name": "daWindci Deluxe", "name_original": "daWindci Deluxe", "description": "Immerse yourself in daWindci Deluxe, the definitive edition of the Apple Design Award winning daWindci.<br/><br/>Paint wind, hurricanes and lightning on the screen with the tip of your finger and thereby navigate your balloon through the riddles and obstacles of each level. A world full of magical equipment and incredible inventions is waiting to be explored at a slow and relaxing pace: Monumental wind turbines on the horizon, an impressive hangar door behind you and a surreal fauna and flora around you.<br/><br/>Create your own hot air balloon with over 25 different designs. Embark in 50 expeditions in search of valuable items and mysterious puzzles. Sit down and enjoy the calming and meditative experience of playing daWindci – best enjoyed with headphones.<br/><br/>Deluxe Features<br/>•Full Retina support with a re-imagined, colorful and much improved art style<br/>•New free-form wind drawing mechanics for a more intuitive and natural experience<br/>•All new particle effects, crisper textures and post effect shaders push your devices’ hardware<br/>•Rebalanced and enhanced levels<br/>•Compatible with iPad 2 and later, iPhone 4S and later and iPod Touch (5th generation)<br/><br/>TouchArcade says: &amp;quot;With a smooth soundtrack driving the action and excellent puzzle solving gameplay, daWindci is a complete, beautiful, and unique puzzler that you really shouldn&amp;#39;t miss out on if you&amp;#39;re a fan of the genre.&amp;quot;<br/><br/>The innovative gameplay with intuitive gesture control, charming graphics and meditative soundtrack offers 5-8 hours of playtime and delights the casual player as well as core gamers. Play daWindci Deluxe at your own pace and relax.<br/><br/>•Intuitive, natural gesture control<br/>•Meditative soundtrack, beautiful landscapes<br/>•5-8 hours of playtime fun<br/>•50 levels and more than 25 designs for the balloon<br/>•14 special tasks as Game Center achievements<br/><br/>&amp;quot;If you enjoy physics challenges with a minor puzzle twist, this is the game for you.&amp;quot; - AppSpy", "metacritic": null, "released": "2014-07-17", "tba": false, "updated": "2023-09-06T07:02:52", "background_image": "https://media.rawg.io/media/screenshots/91b/91b8c78a563560583706e0c392e7a92f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Mimimi Productions"], "genres": ["Adventure", "Puzzle"], "publishers": ["Mimimi Productions UG"], "esrb_rating": "Everyone 10+"}