{"id": 805389, "slug": "caverns-of-mehillon", "name": "Caverns of Mehillon", "name_original": "Caverns of Mehillon", "description": "<p><strong>In the Caverns of Mehillon, players take on the role of Tamzene, a dryad warrior woman on a quest to explore a complex of caverns full of monsters. </strong></p>\n<p>Armed with her trusty sword and a variety of spells, Tamzene must use her agility and combat skills to navigate the treacherous caverns, battling hordes of monsters along the way. With combats in an<strong> hybrid action-text interface </strong>and secrets to discover, the Caverns of Mehillon offer a <strong>unique </strong>and challenging action-fantasy gaming experience. <strong>Every play through is different</strong>, as the monsters encountered are random, as are the events that occur. \r\n</p>\n<p>Every play is different as <strong>most of this game is generated.</strong> You may encounter the same or different monsters on each level, so there is always something new. This game features <strong>pseudo-figurative art </strong>that stimulates imagination, and is programmed from scratch in its own game engine in C#. \r\n</p>\n<p><strong>Caverns of Mehillon</strong> is a <strong>casual </strong>game but you can <strong>save and load your progress</strong> if you wish to <strong>continue your adventure where you left it.</strong>\n</p>\n<p>Players can <strong>create their own characters by adding images and setting stats, changing the name of the heroine if they so choose. </strong>\n</p>\n<p><strong>There will be free and paid extensions</strong> for this game, like <em><strong>new levels, new adventures, and new heroines.</strong></em>\n</p>\n<p><em>In this moment the game is in development (early access). It's fully playable, although there may be some bug. I say it's in development because I will add more features and extension packages.</em>\n</p>\n<p>I've set a 'pay what you want' price so you can consider it as a donation for the development of the game.\r\n</p>\n<p>All the feedback is welcome, and all suggestions will be considered, for the development of this game. Feel free to message me or comment! :)</p>\n<p><em><strong>Game credits:</strong></em>\n</p>\n<p>Soundtrack by Emily https://rollforfantasy.com/\r\n</p>\n<p>Programming and graphics:\r\n</p>\n<p>Jordi R. Cardona hiperia3d.com\r\n</p>\n<p>GAME REQUIREMENTS:<br/>Minimal:<br/>1280 x 800 pixels of screen resolution, Windows 10, 32 bits.<br/>Optimal:<br/>Bigger than 1280 x 800 screen resolution, Windows 10, 64 bits.\r\n</p>", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-20T14:59:24", "background_image": "https://media.rawg.io/media/screenshots/030/03094db5d38d64ace3f16e799d2fdd66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["intuitive-arts"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}