{"id": 805484, "slug": "system-disconnected", "name": "System Disconnected", "name_original": "System Disconnected", "description": "<p>Grampy Bob is on his way to see his granddaughter, who he hasn't seen since she was six, graduate from University  on Oriaxa-5. After dropping out of hyperspace he finds himself in an  asteroid field and now needs to keep his ship together during the  journey through. Through constant bombardment he needs to repair his ship, keep himself hungry, and reassure his granddaughter Meredith that he's going to make it. </p>\n<p><strong>How to Play</strong></p>\n<p>Control Bob and make sure the ship survives. <br/>Communication with Meredith is imperative - stay connected with her throughout the journey.<br/>Bob slows down the more hungry he gets, so eat food in the kitchen when hungry to sate him.<br/>The engine room drives the ship forward through the asteroid field - if the system disconnects then the ship stops moving forward... and if the engine reaches zero then it's game over.<br/>The shield room is where you can repair any damage taken to the shield from the constant bombardment. If you let the shield fall to zero then you will start taking direct damage to the hull which cannot be repaired.... and if the hull reaches zero... it's game over.<br/>The life support system provides oxygen to the ship. If the system is disconnected then the oxygen levels will drop, and if it drops to zero... it's game over.<br/></p>\n<p><strong>Controls</strong><br/></p>\n<br/>KeyboardGamepadMovementWASDLeft StickInteractR KeyX Button<br/>West ButtonPause, Skip<br/>EscStart", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-20T15:40:53", "background_image": "https://media.rawg.io/media/screenshots/cbc/cbca6571ddfe5a0a804bae89667b507d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ShootingDux"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}