{"id": 80542, "slug": "fill-more", "name": "Fill More!", "name_original": "Fill More!", "description": "The Soviet Union did not conquer the world, however they brought us some legendary computer games. Besides the most famous Tetris, it was the very popular and addictive Filler, now reinvented for you as Fill More!<br/><br/>What is the principle of the game? Just try that, it's free :)<br/>It is simple, but it is much easier to play Fill More! than to explain. But I'll try: Two opponents start at opposite sides of the game field. By changing their color they take over adjacent cells and expand their territory. Seams easy? Try that against your friends or computer opponents.<br/><br/>But be careful! Fill More! can be very addictive, especially if you play against your friends. You can beat them on your device or compare your skills in Game Center leaderboards.<br/><br/>Three different unique computer opponents will help you to find strategies and prepare for the real tournaments against your friends.<br/><br/>Lite version features:<br/>- limited game settings for single player game<br/>- two players game on one device<br/><br/>If you like the game, you can have even more fun with the full version of the game!<br/><br/>Additional features in full version:<br/>- single player campaign with leaderboards<br/>- fully customizable game settings (number of colors and cell size)<br/>- iCloud sync (your score is safely stored in iCloud (if available) and synchronised between your devices)<br/>- support for multiple Game Center accounts", "metacritic": null, "released": "2013-01-10", "tba": false, "updated": "2019-10-22T14:23:06", "background_image": "https://media.rawg.io/media/screenshots/6e4/6e454266c9fa11421fc52fb6869c2fa9.jpg", "website": "https://www.facebook.com/fillmoregame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alois Holub"], "genres": ["Board Games", "Puzzle"], "publishers": ["Alois Holub"], "esrb_rating": "Everyone 10+"}