{"id": 805431, "slug": "dark-patterns-clapostrophe", "name": "Dark Patterns (Clapostrophe)", "name_original": "Dark Patterns (Clapostrophe)", "description": "<p>LOST RELIC GAMES GAME JAM — “CONNECTION” <br/></p>\n<p>On the occasion of LOST RELIC GAMES’ very first game jam I decided (rather spontaneously and quite fittingly) to create my very first game. Luckily time-wise very generous (9 days &amp; theme announced a day prior). First 4 days all about approaching Game Maker (previously only known by name) by the means of tutorials, reddit threads, and that manual. Well, what a wild ride these 9 days turned out to be.<br/></p>\n<p>When it comes to the theme “CONNECTION” itself that went kinda like that: I thought of the word sharing its first latter with my YT channel name. As the C in my profile picture reminded me of some kind of token, I wondered if I could put that to some use. Yeah, lets start the game with only that. Then WORDLE came to mind – a game I. And it went on.<br/></p>\n<p>Yeah, I have not slept in over 32h, sorry. I kinda hope I can still edit this texbox after submitting the game (how very thrilling…). Here are some basic facts to close my word salad for now:</p>\n<ol><li>Player (you?!) has to guess a 5-letter word in a rather convoluted manner.</li><li>Guessing the workings is basically half the fun. The other is being stressed out a little, I guess.</li><li>Please also note, that there are always at least 2 correct solutions. These are guaranteed. All these words are pulled from the “official” WORDLE list of 5-letter words, but checked with a much larger collection to hopefully address whatever esoteric word you discovered.</li><li>PRO-TIP: Each portal has a different way to activate.</li><li>Fun-fact: press F1 to see the laughable stump of a help-system I was just about to set up.</li><li>Don’t get stressed.</li><li>It’s solvable. I won a few times.</li></ol>\n<p>LEVELS</p>\n<p>This version comprises exactly one semi-generated level. Several lovely elements didn’t make it into this version (way more variety with the music, some in-game assistance, more mechanics, and stuff), due to aabsolutely-no-frickin’-time-left. HOWEVER I have actual plans to rework this into something more approachable. Sorry, I can barely form words right now (zzzzzz…). Take care, everyone!<br/></p>", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-20T15:18:38", "background_image": "https://media.rawg.io/media/screenshots/25c/25cddf78269efaf5df7d8f7fb6332455.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Clapostrophe"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}