{"id": 805474, "slug": "lost-crystal-relic-defense", "name": "Lost Crystal Relic Defense", "name_original": "Lost Crystal Relic Defense", "description": "<p><strong>HOW TO PLAY</strong></p>\n<ul><li>Before you start the fight make sure to strategically place your defense towers.</li><li>When you survived a wave you'll be given new towers to place.</li><li>A level consists of multiple waves and this game has multiple levels.</li><li>Keep in mind that the defense towers are connected to the  crystal's energy.</li><li>The closer you place them to the crystal the more energy they drain from it but they also deal more damage.</li><li>Try to find the perfect balance between damage dealing and keeping enough energy to survive the incoming attacks.</li><li>And most importantly - have fun! =D</li></ul>\n<p>----------------------------------------------------------------------------------</p>\n<p>This is the first time for our two-ladies team to work together on a game jam.</p>\n<p>The theme for the <strong>Lost Relic Games Game Jam</strong> was <strong>\"Connection\"</strong>.</p>\n<p>We implemented this through a crystal that needs to sacrifice it's own energy to build defenses for itself. The closer the defense is to the crystal the more energy it costs but it also increases it's attack speed.<br/>So you have to decide whether you want multiple small defenses and keep some energy or if you want to go all-in and risk your crystal to be crushed easily by the enemies because you don't have enough energy left.</p>\n<p>We really wanted upload a WebGL version as well but the build took too long so please bear with us and give our game a shot even tho you have to download it^^\"</p>\n<p>P.S.:We're currently working on a 2.5D tactical RPG where you can build your own maps to explore and you can <strong>join our mailing list</strong> to support us and get updates on our progress =D<br/></p>", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-20T15:37:20", "background_image": "https://media.rawg.io/media/screenshots/8ed/8edc99171aec426a0d593d3adee584af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MiniMelonStudio"], "genres": [], "publishers": [], "esrb_rating": null}