{"id": 80552, "slug": "smartgo-kifu", "name": "SmartGo Kifu", "name_original": "SmartGo Kifu", "description": "SmartGo Kifu transforms your iPad into a Go board with a library of over 100,000 professional game records and 2,000 problems. Study master games, solve problems, explore joseki, play against the computer, and record you own games.<br/><br/>Features:<br/>- 102,000 professional games<br/>- 2,000 Go problems on the go<br/>- 30 annotated games (in English)<br/>- Joseki and fuseki analysis<br/>- Tree view for easy navigation<br/>- Record your own games<br/>- Import and export games<br/>- Use as a Go board for two human players<br/>- Replay games and explore alternate sequences<br/>- Annotate moves, edit game info<br/>- Guess Next Move<br/>- Tutorial with over 100 problems<br/><br/>Computer Play:<br/>- Strong game engine<br/>- Fast response (adjustable)<br/>- Automatic handicap adjustment on 9x9, 11x11, 13x13<br/>- Manual choice of handicap and board size up to 19x19<br/>- Track level per user<br/>- Computer resigns when too far behind (can be turned off)<br/>- Territory estimator<br/>- Hint<br/>- Undo<br/>- Replay<br/><br/>SmartGo Kifu is designed as a versatile tool for Go players who want to study professional games, practice Go problems, record their games, as well as play against the computer. If you're new to Go or just want a quick and challenging game against the computer, please check out our popular SmartGo Player app.<br/><br/>Go is also known as igo (囲碁), wéiqí (围棋), or baduk (바둑).", "metacritic": null, "released": "2010-04-01", "tba": false, "updated": "2019-07-30T06:13:19", "background_image": "https://media.rawg.io/media/screenshots/970/97080f41fc4ccec0a3864958938777d8.jpg", "website": "https://smartgo.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Smart Go"], "genres": ["Strategy", "Board Games"], "publishers": ["Smart Go"], "esrb_rating": null}