{"id": 80569, "slug": "napoleon-in-russia", "name": "Napoleon in Russia", "name_original": "Napoleon in Russia", "description": "Napoleons Invasion of Russia began on 24 June 1812 when the Grande Armée crossed the Neman River to engage and attempt to defeat the Russian army.  The Grande Armée was massive, with over 600,000 troops.  The French army initially advanced rapidly into Russia, winning a number of minor engagements and even a major battle at Smolensk in August.  But in the end the Russian army always managed to slip away, until finally there was the great battle of, and French victory at, the Battle of Borodino, at the Gates of Moscow.  But this was not enough.  The French army was ultimately defeated by the vastness of the country and by the dreadful Russian Winter.  By the end of 1812 the French Army was in retreat and would be destroyed on its long march home.<br/>\n<br/>\r\nNapoleon in Russia recreates 5 historical battles from the doomed Invasion of Russia.  There are also non-historical skirmish engagements included.<br/>\n<br/>\r\n● All missions, apart from the tutorial, can be played as both sides​.<br/>\r\n● Over 30 different unit types.<br/>\r\n● Four classes of infantry – Raw, Average, Veteran and Elite<br/>\r\n● Detailed Combat Analysis​<br/>\r\n● Map zoom<br/>\r\n● Flank Attacks​<br/>\r\n● Strategic Movement​", "metacritic": null, "released": "2015-10-24", "tba": false, "updated": "2023-11-05T15:36:51", "background_image": "https://media.rawg.io/media/screenshots/784/7844f3a55062142ebe8484aa7cf28726.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "iOS"], "developers": ["HexWar Games"], "genres": ["Strategy", "Simulation"], "publishers": ["HexWar Games", "Hunted Cow Games"], "esrb_rating": "Teen"}