{"id": 805773, "slug": "goldbergs-game", "name": "Goldberg's Game", "name_original": "Goldberg's Game", "description": "<p>Hi! Welcome to Goldberg's Game!</p>\n<p>This is a recreation of a game I used to play with my teacher in middle school.</p>\n<p>THE GAME:</p>\n<p>The object of the game is to make your colored numbers sum up to more than your opponent's colored numbers in each row and column. You could also think about it as red numbers being negative, whereas blue numbers are positive. You play with six blue and six red numbers on a 3 tall 4 wide game board. If the row or column sums to an even value, that is a point for the blue player. If it sums to a negative value, that is a point for the red player. If it sums to zero, neither player gets a point. The player with the most points after all numbers are placed is the winner!</p>\n<p>HOW TO PLAY:</p>\n<p>The blue player always goes first. They must click the space on the board where they wish to place a number, and then click the number they wish to place on the left side of the screen. The arrow on the bottom will then switch, indicating that it's the red player's turn. They must also first click the space on the board, and then click the number on the right side that the wish to place.</p>\n<p>After all six numbers are placed by both players, the winner will be displayed on the bottom.</p>\n<p>The music can be muted with the button on the top right, and the game can be reset with the button on the top left.</p>\n<p>Hope you have fun playing Goldberg's Game!</p>\n\n\n<p>Version 1.1:<br/></p>\n<p>- I misspelled the name of my game. lmfao.</p>\n<p>Version 1.2:</p>\n<p>- Added a blinking indicator to the space on the board where a number will be placed.</p>\n<p>- Added two more simple backgrounds, accessed by clicking on the logo on the top middle.</p>\n<p>Version 1.3:</p>\n<p>- Removed the red dot on the logo that I used to center it.</p>\n\n<p>I will not be working on this any longer, since there are a loooot of little things in the code that are just inefficient and hardcoded and make changing even little things a nightmare. I'm just going to take everything I learned from this project and bring it into my next!</p>", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-20T18:05:35", "background_image": "https://media.rawg.io/media/screenshots/8fe/8feb70edada88132381a3bc201dae469.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["daverd"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}