{"id": 805750, "slug": "no-place-like", "name": "no place like", "name_original": "no place like", "description": "<p><strong>Pour yourself a cup, take your time &amp; enjoy. </strong>Choose a cup you'd like to have your coffee in &amp; add in whatever else you like. This is a cozy point &amp; click game, where you can go at your own pace - there is no end goal, make as much coffee as you like! There are also 6 hidden little coffee beans for you to find in the kitchen. Remember, there's no place like home (whatever home might mean for you).<br/></p>\n<p>This is my submission for the AccessJam 2022 where the focus is on creating content with conscious decisions on how accessible your content is. Accessibility in games is something that is often overlooked, but is an important part of the process to ensure everyone can enjoy what is created. As a disabled person, I understand some of the barriers faced in daily interactions - though this jam highlighted a lot of areas where I could be more conscious of when creating games in the future. The jam offered an optional theme of \"home\" which is why I've chosen to have the setting of this game in a kitchen, where you can relax &amp; take things slow. I've created this game with colour-sensitivity in mind &amp; kept the controls simple, with mobile access to ensure people can play this game wherever they are.</p>\n<p><strong>Features:</strong></p>\n<p>☕ Customizable coffee cups!</p>\n<p>☕ Non-dairy milk options!</p>\n<p>☕ A friend to have coffee with!</p>\n<p>*All art created by me using Procreate &amp; Photoshop!</p>\n<p>[Note: Ran out of time to polish this one up so it will receive an update soon!]</p>\n<p>☕☕☕☕☕☕☕☕☕☕<br/></p>", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-20T17:55:22", "background_image": "https://media.rawg.io/media/screenshots/f87/f87acfec88470d3d80fa81337b3a0ad5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["steff"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}