{"id": 805905, "slug": "mediocre-wizard", "name": "Mediocre Wizard", "name_original": "Mediocre Wizard", "description": "Story \r\n<p> You are a wizard but you can't use your abilities correctly so you go on a quest to get stronger.<br/></p>\r\nHow To Play\r\n<ul><li>A-D to move left and right.</li><li>Space to jump.</li><li>ESC to pause or return to upgrade menu.</li><li>You can buy upgrades to get higher score.</li></ul>\n<ul><li>Enter a seed to get a specific room or leave it empty for a random seed and choose the difficulty your prefer.</li></ul>\n<ul><li>Shooting<ul><li>Aim with the mouse and shoot with left click.</li><li>The longer you hold left click the more power you shoot with.</li><li>The more power you use the shorter the travel distance of the fireball.</li><li>Holding max power for too long will damage the character.</li></ul></li></ul>\r\nCore Mechanic\r\n<p>The core mechanic or \"Connected\" part of the game is that fireballs will get back to you after traveling a specific distance and the more power you apply to your shot the more damage you deal but will make the distance shorter.  </p>\r\nNotes\r\n<ul><li><strong>The game doesn't really have a goal right now and only have 2 enemies but you can try to get a high score or beat a really hard room using a certain difficulty.</strong></li><li><strong>I may add more content like boss fights, more enemies and more story elements after the jam if people liked the game.</strong></li><li><strong>Rooms are procedurally generated and this is my first time trying this if you face any bugs feel free to report them or suggest changes.</strong></li><li><strong>You can use a seed to get a certain room or share interesting ones.</strong></li><li><strong>You can start at a specific room level to skip easy levels.</strong></li></ul>", "metacritic": null, "released": "2022-06-18", "tba": false, "updated": "2022-06-20T19:02:47", "background_image": "https://media.rawg.io/media/screenshots/289/289f74699d3a4c6b336229d95c4a93aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Samerezz"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}