{"id": 805917, "slug": "future-climate", "name": "Future Climate", "name_original": "Future Climate", "description": "<p><em>Future Climate</em> is a science-based climate model that allows you to simulate future global warming. It starts with the world today, and calculates global-averaged temperature based on your choices. </p>\n<p>There are three modes: \r\n</p>\n<ul><li>Simple mode allows you to change all pollutants (carbon dioxide, methane and aerosols) at once. </li><li>Sector mode lets you change each economic sector separately: electricity, transportation, industry, agriculture and buildings. </li><li>Gas mode allows you to change carbon dioxide, methane, nitrous oxide and aerosols individually. </li></ul>\n<p>If you're decreasing all emissions at once, temperatures will initially spike, due to the removal of aerosols, which block out the sun. Over the next few decades, methane decreases, and temperatures go back to where they were before you changed emissions. Carbon dioxide lasts an extremely long time in the atmosphere, so temperatures stabilize at around that same value. </p>\n<p>The app simulates three different possible future in each mode: one with a high climate sensitivity and large negative aerosol forcing (the dark red line), the middle range (red, number displayed as well), and a low climate sensitivity and low aerosol forcing case (yellow).  </p>\n<p>This model is a simplified version of the FaIR v1.3 climate model. </p>", "metacritic": null, "released": "2022-06-18", "tba": false, "updated": "2022-06-20T19:07:53", "background_image": "https://media.rawg.io/media/screenshots/552/552661a5068a8f7a5d4102aa05c44427.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["EarthGamesUW"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}