{"id": 806092, "slug": "cube-invasion-silentstrike46", "name": "Cube Invasion (Silentstrike46)", "name_original": "Cube Invasion (Silentstrike46)", "description": "<p>My submission for the Lost Relic Games Game Jam 1 with the theme \"Connection\". The game can be played either solo (to test your coordination), or with a friend (to test your friendship communication skills).<br/><br/>The point of this game is for the two players to survive as long as possible, but with a twist: These two players are connected together by a beam! No matter how far apart you are, the beam will always connect the two of you.<br/><br/>Red and green cubes approach from the right side of the screen and go towards the left. If either player or the beam touches a red cube , you lose a life; but if you touch a green cube you earn points. If the red cube reach the left hand side, you earn points - but if a green cube reaches the left hand side, you lose a life as well. Simple: grab the greens, and avoid the reds!<br/><br/>As time goes on, the number of cubes that spawn each second will increase, as well as their speeds. How long can you survive?<br/><br/>This is my first ever game jam I'm participating in, and first ever 'game' I've created. I also have a full-time job, so I could not spend as much time on the project as I would have liked (about 20 hours or so); but at the very least, I wanted to participate in the game jam and say that I've made something!<br/><br/>Game was created in Unity.<br/><br/><strong>Controls:</strong><br/>WASD: Controls the first (blue) player<br/>Arrow Keys: Controls the second (pink) player<br/><br/><strong>Credits:<br/></strong>Rizwan Ashraf - \"Free Music Tracks for Games\":  The amazing royalty-free background music that is used both in the menu and in the game (specifically Zephyr and Street Love):<br/>https://assetstore.unity.com/packages/audio/music/free-music-tracks-for-games-15...<br/></p>", "metacritic": null, "released": "2022-06-18", "tba": false, "updated": "2022-06-20T20:19:07", "background_image": "https://media.rawg.io/media/screenshots/8c1/8c17ce4affe9deee83fb3c3387e502a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Silentstrike46"], "genres": [], "publishers": [], "esrb_rating": null}