{"id": 806204, "slug": "improvised-mashup-game", "name": "Improvised Mashup Game.", "name_original": "Improvised Mashup Game.", "description": "<p>Controls below.<br/>I believe all bugs are ironed out. <br/>I know that - The character in the egg-finding screen does not go away after the first viewing, if you go into the toilets and come back out. Can't fix that person.<br/>Water triggers are iffy.<br/><br/>Controls - <br/><br/></p>\n<p>Movement - WASD/ Arrow keys<br/>A = Enter<br/>B = Shift <br/>Start = c (Start on Title Screen, nothing mapped to it in-game)<br/>Select = v (Switching character, used for advancing the story at times so best try it for different interactions!)</p>\n<p>--------------------<br/>Basically - <br/><br/>This is a mashup of various backgrounds and characters (Most original, some direct from RPGTsukuru or Animorphs) that I (for original stuff) have made/altered over the two years I've been learning to make games. At least two time periods from medieval to present/futuristic, so maybe 3.<br/>The storyline came from collecting a bunch of event points and throwing them into a randomiser then improvising a coherent story out of them, and winging the dialogue as I made the game according to the plot events.<br/><br/>I thank my friend Kingslayer for wanting a multiverse for inspiring this XD<br/><br/>----------<br/>More thoroughly explained - <br/><br/>As of 31st May 2022, I have been practicing for my challenge stream for, (To use one set of assets to make up a game Using Other People's Ideas On The Day. I am not allowed to script/plan it or know ideas before starting the event.) I have been making a game on the spot.<br/><br/>I admit I came up with the 15-ish plot events myself (looking at various books/DVDs/games around me + using Tavern Boy's original wanted idea) and dumped them into a randomiser, also decided on charas &amp; who has what happen, so it's not QUITE the same as 'Improvise with no pre-planning or event/character ideas' but I am basically only using what I have (made/recoloured) at this moment.<br/><br/>I've 'cheated' in the ways of updating my first ever backgrounds to ones that better fit the tile (8x8-pixel) limits, and using basic characters from RPG Tsukuru/Animorphs.<br/><br/>I know the character in the egg-finding segment is glitched. I cannot TRUE them into vanishing after the first sighting.<br/>I know the water sprite triggers are iffy. Pfft. It's fine with one character but multiple....???? XD I'll figure it out for the 3rd WIP game for my series.<br/>They DO change, but you need to manually change the characters to see land VS water.<br/><br/>This game was also inspired by my friend Kingslayer saying I needed to do something with a multiverse so HERE YA GO!<br/><br/>--------------------<br/>--------------------<br/><br/>Games/Franchises I've made these backgrounds/characters for - (Not just recoloured existing already, made with other assets from scratch)<br/><br/>Detroit Become Human (Mostly the fanseries by Octopunk I'm working on an adaption of, or my own fangame - So areas and character has been used.) (c) Quantic Dreams<br/>Animorphs Canon/fanfic (c) K A Applegate / Scholastic<br/>Zoids (Two OCs for this, one has been made flesh in this project) (c) TOMY<br/><br/>The Flood (c) Me<br/>Game I made for my parents' birthday (c) Me<br/>Tavern Boy / Potion Master /  3rd WIP game in series (c) Me<br/>WIP Project with apartment used in live Stream Starting opening (c) Me<br/>Zoid OCs (c) Me<br/><br/>--------------------<br/>--------------------<br/><br/>Games/Franchises I've taken these plot events from - <br/><br/>A Party Member Goes Through A Vital Transformation (c) The Last Unicorn by Peter Beagle<br/>Befriend Giant Scared Monster (c) The Last Guardian<br/>Check The Sunstone (c) Dinotopia<br/>[Playable Character] Is Secretly A God (c) inspired by - not a plot point AFAIK - The World Ends With You<br/>Two Teams Try To Capture One Character (c) Pokemon Ruby/Sapphire/Emerald<br/>Humans Are Minority, Mythicals Rule (c) Planet of the Apes<br/><br/>Finding Egg left in bar, princess raises Slime (c) Me<br/>Alternate world, Time is Screwed Up (c) Me<br/>Everyone Gets Cursed Into Monster Forms (c) Me<br/>--------------------<br/>Assets - <br/><br/>Harvest Moon (Building exteriors, crops)<br/><br/>VECTORPIXELSTAR (Various Tiles)<br/><br/>Pokemon (Character sprite bases, doors, houses, blocking rocks)<br/><br/>RPG Tsukuru GB (RPG Maker GB) (Castle interiors, barrels, dungeon desks, village/park/town tiles and Character Sprites recoloured, map tiles)<br/><br/>GBS Creator Chris Maltby (Cliff sides, ladder)<br/><br/>GBtilesheet4colours by rhys (Chair in Luiza's, desk altered)<br/><br/>HP1/2 (Simplified then altered chairs/sofa)<br/><br/>Final Fantasy Adventure (NPC Sprite changed to Harpy)<br/><br/>Final Fantasy Legend 2 (Baby Dragon) ??<br/><br/>VECTORPIXELSTAR (Various Tiles)<br/><br/>Animorphs (Animal sprites)<br/></p>\n<p>Breath of Fire II (Mountain background from fishing minigame)<br/><br/>Harvest Moon/2/3 (Building roofs, tree)<br/></p>\n\n\n<p>\n</p>", "metacritic": null, "released": "2022-06-18", "tba": false, "updated": "2022-06-20T21:10:24", "background_image": "https://media.rawg.io/media/screenshots/2ed/2ed64fc90973e5099466ec322193d1ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DeafonicsGameStudio"], "genres": [], "publishers": [], "esrb_rating": null}