{"id": 80630, "slug": "kanazawa-shogi-2", "name": "Kanazawa Shogi 2", "name_original": "Kanazawa Shogi 2", "description": "Here comes 'Kanazawa Shogi 2', the most popular Shogi (Japanese Chess) game in Japan.   <br/>This Shogi app is a sequel of the app 'Shogi Lv.100'<br/><br/>■What is 'Shogi' <br/>Shogi, also known as Japanese chess, is the most popular thinking game in Japan. Unlike chess, the captured pieces could be returned to the board to be used as a piece for the captured player.<br/>Why don't you challenge this exciting Japanese game!<br/>The Help feature within the game will help you understand the rules of Shogi.  <br/><br/>■Kanazawa Shogi 2 has 300 different levels of play from beginner to expert.<br/>The thinking engine 'Kanazawa Shogi' has improved and the stronger levels are at the top level for games without network communication.<br/>Also we have provided more levels for beginners to learn and enjoy this board game.<br/><br/>*The levels are set as:<br/>Level 1-100    For beginners<br/>Level 100-200  For intermediate (10k-1k) players<br/>Level 200-300  For advanced (1d-3d) players<br/><br/>Of course, you can change the handicap for each game so everyone can enjoy all the 300 levels! <br/><br/>■Challenge to win medals by defeating computer!<br/>You will win medals by defeating computer in off-line game.<br/>If you collect a certain number of medals, new types of board and pieces will be awarded.<br/><br/>■Other Features:<br/>- Human vs Computer, Human vs Human(sharing a single device)<br/>- Let you know your turn by vibration<br/>- Automatic zooming for easy viewing and operations<br/>- Save/Load game record<br/>- Hint feature<br/>- Enable to view full game history of the game record and restart game<br/>   from the selected move<br/>- Transmit game record by e-mail (CSA/Text format)<br/>- Beautiful graphics and realistic sound effects<br/>- Automatic reading out for each move in Japanese", "metacritic": null, "released": "2014-09-03", "tba": false, "updated": "2019-07-31T01:39:46", "background_image": "https://media.rawg.io/media/screenshots/e92/e922b7262b6750bb54420b0376044ad0.jpg", "website": "http://www.unbalance.co.jp/english/iphone/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["UNBALANCE"], "genres": ["Strategy", "Board Games"], "publishers": ["UNBALANCE"], "esrb_rating": null}