{"id": 8063, "slug": "espgaluda-ii-hd", "name": "ESPGALUDA II HD", "name_original": "ESPGALUDA II HD", "description": "### Game Overview ###<br/>An HD version of widely praised bullet hell shooter Espgaluda II is here!<br/>Enjoy the shooting sensation right at your fingertips on iPad2!<br/>Dodge and weave through waves of bullets as they fill the screen, and go for a high score!<br/><br/>###　Praise for ESPGALUDA II　###<br/>“Now that it's portable, Espgaluda II is a game that can truly be both casual and hardcore: a fun, satisfying time-killer as well as a high score-focused endurance run for the upper tier player on the go.”<br/>- 1UP.com<br/><br/>“It is easily the best 2D shooter experience in the App Store.”<br/>- TouchArcade.com<br/><br/>“It isn't just one of the best games on iPhone - it's one of the best shooters I've ever played.<br/>Few games are this spectacular.”<br/>- GamesRadar.com<br/><br/>### ABOUT THE FULL VERSION ###<br/>● TWO GAME MODES<br/>Smartphone Mode features a game system optimized for the iPhone: use the \"Awakening Pulse\" to touch and destroy bullets! Enjoy Arcade Mode, which is a port of the arcade hit!<br/><br/>Touch to destroy the bullets! Raise your multiplier and destroy enemies for golden point explosions!<br/><br/>● BGM UPDATED FOR SMARTPHONE MODE! ORIGINAL BGM FOR ARCADE MODE INCLUDED!<br/><br/>● 3 UNIQUE CHARACTERS, 3 DIFFICULTIES, CONTROL AND SCREEN SETTINGS<br/>With all of the customization options available at your fingertips, anyone from shooting game beginners to advanced players can enjoy the world of ESPGALUDA II!<br/><br/>● THE MOST INTENSE BULLET STORMS ON iPad <br/>CAVE has maintained the beautiful graphics of the arcade version and brought some of the most dense bullet patterns ever to the palm of your hand. <br/><br/>● DODGE FOR YOUR LIFE<br/>Controls adapted for smartphones feature slide controls for comfortable play on your device!<br/><br/>● COMPATIBLE WITH GAME CENTER<br/>Internet Rankings and Achievements included for all characters!<br/>*Compete with your friends on Game Center!<br/><br/>All game modes and characters are compatible with online rankings; compete with players all over the world for high scores! <br/><br/>Go for a full achievement list!<br/><br/>### IMPORTANT ### : For those about to purchase this application, please read the below before purchasing.<br/>ESPGALUDA II will only run on iPad2 (iOS 4.3 and up). Other devices are incompatible.<br/>※Since this application uses a significant amount of memory, it is possible that it will crash when device memory is low. If this happens, please consult our Support Page.<br/>※Turning the expand/shrink accessibility function \"ON\" may interfere with in-game play.<br/><br/>### VERSION INF ### : There are several different versions of Espgaluda II for iPhone/iPod touch and iPad2<br/>1. The Full Version, which includes Arcade Mode and Smartphone Mode<br/>2. Smartphone Version, with Smartphone Mode which includes use the new \"Awakening Pulse\" system<br/>3. Arcade Version, with the same exciting gameplay as the arcade release<br/>4. iPad 2 versions remastered in HD: Full Version, Smartphone Version, Arcade Version<br/>Please take note of the version you want when you buy the game!", "metacritic": null, "released": "2011-10-13", "tba": false, "updated": "2019-10-22T14:29:42", "background_image": "https://media.rawg.io/media/screenshots/308/308f7345d2329ac19fc7e398c18cd0fc.jpeg", "website": "http://www.cave.co.jp/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CAVE CO.,LTD."], "genres": ["Action", "Arcade", "Casual"], "publishers": ["CAVE Co"], "esrb_rating": null}