{"id": 806435, "slug": "shooter-of-war", "name": "Shooter Of War", "name_original": "Shooter Of War", "description": "<p>\n<strong>English:</strong></p>\n<p>I have a computer game \r\n\t<strong>\"SHOOTER OF WAR\"</strong> programmed with unreal 4 for Windows. This is a shooter game, where in the menu choose opponents to 21 bots and 10 maps for play. These maps are called \"Sanctuary, Sanctuary2, HighWall, HighWall2, GunHouse, GunHouse2, Forest, Forest2, House, House2\". Sanctuary2, HighWall2, GunHouse2, Forest2, House2 can even different animations play and thus changes to this map. There is also a map and he is called \"WeaponTraining\" where you can test all the weapons. There is in the game to all weapons have 33 weapons in the game, and these different Shot strength, range, ammunition, etc. There are 3 games of mods to the which play called \"FREE FOR all(Deathmatch), TEAM DEATHMATCH, ONE AGAINST ALL.\" The FREE FOR all(Deathmatch) TEAM DEATHMATCH MOD can choose their menu in the start, and ONE AGAINST ALL MOD you can do the in the in each to choose map an extra menu. In \"FREE FOR all(Deathmatch)\" mod \" play each against all. In \"TEAM DEATHMATCH\" play in a red or blue team with other bots. In \"ONE AGAINST ALL\" mod you play alone against all other bots. In the start menu you can choose even if you your game want to record what you have played in map and then look at this shot. The weapons that I programmed there in normal and large format. In the game you can play up to 24 and more different programmed opponents, there are also big enemies, and with up to 24 and more different game play characters themselves, it are also great game characters. Any map you play 30 minutes and who has more Points earned in feigned map which has won, if you kill an opponent then get You 5 points and when you are dead you get 2 points deduction from your total points. In each map, there's also ammunition to the collect if you need the ammunition, and health There is also in each map to the collect if you have too little life. There is also a map \"Sanctuary\" to play via LAN, since you can play up to 8 players via LAN. I have programmed this game in English language, but you need not so much English knowledge to play this game, you have to can shoot only good game in this shooter.\r\n</p>\n<p>\n<strong>Recommended PC with:</strong> Windows 7 64 bit operating system<br/>\r\n\t                                          Intel Core i5-4460 CPU or better\r\n\t<br/>\r\n\t                                          16 GB memory or more\r\n\t<br/>\r\n\t                                          NVIDIA GeForce GTX 750 graphics card or better\r\n\t<br/>\r\n\t                                          3 GB disk space\r\n</p>\r\nSee the gameplay video.\r\nGameplay Video      - Youtube\r\nGameplay Video2  - Youtube\r\nGameplay Video3  - Youtube\r\nGameplay Video4  - Youtube\r\nGameplay Video5  - Youtube\r\nGameplay Video6  - Youtube\r\nGameplay Video7  - Youtube\r\nGameplay Video8  - Youtube\r\n<p>\n<strong>Deutsch:</strong><br/>\r\n\tIch habe ein Computer Spiel \r\n\t<strong>\"SHOOTER OF WAR\"</strong> programmiert mit Unreal 4 für Windows. Das ist ein Shooter Spiel, wo Sie im Menü wählen können bis 21 Bots Gegner und 10 Maps  für spielen. Diese Maps heißen \"Sanctuary, Sanctuary2, HighWall, HighWall2,  GunHouse, GunHouse2, Forest, Forest2, House, House2\". In Sanctuary2, HighWall2, GunHouse2, Forest2, House2 können Sie selbst unterschiedliche Animationen abspielen lassen und damit <br/>\r\n\tändert sich dieser Map. Es gibt auch ein Map und er  heißt \"WeaponTraining\" wo Sie alle Waffen testen könnt. Es gibt im Spiel bis  33 Waffen im Spiel, und diese alle Waffen verfügen über unterschiedliche Schussstärke, Schussweite, Munition usw. Es gibt 3 Spiele Mods zum spielen welche heißen \"FREE FOR ALL(DEATHMATCH), TEAM DEATHMATCH, ONE AGAINST ALL. Die FREE FOR ALL(DEATHMATCH) und TEAM DEATHMATCH Mod könnt Ihr im Start Menü wählen, und den ONE AGAINST ALL Mod könnt Ihr im in jeden Map dazu wählen im einem extra Menü. In \"FREE FOR ALL(DEATHMATCH)\" Mod  spielen Sie jeder gegen jeden. In \"TEAM DEATHMATCH\" spielen Sie in einem von roten oder blauen Team mit anderen Bots. In \"ONE AGAINST ALL\" Mod spielen Sie alleine gegen alle anderen Bots. Im Start Menü können Sie wählen auch wenn Sie Ihr Spiel aufnehmen wollen was Sie gespielt haben in Map und dann diese Aufnahme anschauen. Die Waffen die ich programmiert habe gibts es in normal und groß Format. Im Spiel können Sie bis gegen 24 und mehr unterschiedlich programmierte Gegner spielen, es gibt auch große Gegner, und mit bis 24 und mehr unterschiedlich programmierte Spiel Charakteren selbst spielen, es gibt auch Große Spiel Charakteren. Jeder Map den Sie spielen dauert 30 Minuten und wer hat mehr Punkte gesammelt in gespieltem Map der hat gewonnen, wenn Sie einen Gegner töten dann bekommen Sie 5 Punkte und wenn Sie gestorben werden bekommen Sie 2 Punkte Abzug von Ihren gesamten Punkten. In jeden Map gibt es auch Munition zum sammeln wenn Sie die Muniton mal brauchen, und Gesundheit gibt es auch in jedem Map zum sammeln wenn Sie mal zu wenig Lebenspunkte haben. Es gibt auch einen Map \r\n\t<br/>\r\n\t\"Sanctuary\" zu spielen per Lan, da können Sie mit bis 8 Spieler spielen per Lan.\r\n\t<br/>\r\n\tDieses Spiel habe ich auf englische Sprache programmiert, aber Sie brauchen nicht so viel Englisch Kentnisse um dieses Spiel zu spielen, Sie müssen in diesem Shooter Spiel nur gut schießen können.\r\n</p>\n<p>\n<strong>Empfohlen PC mit:</strong>  Windows 7 64 Bit-Betriebssystem<br/>\r\n\t                                  Intel Core i5-4460 CPU oder besser\r\n\t<br/>\r\n\t                                  16 GB Arbeitspeicher oder mehr\r\n\t<br/>\r\n\t                                  NVIDIA GeForce GTX 750 Grafikkarte oder besser\r\n\t<br/>\r\n\t                                  3GB Speicherplatz\r\n</p>\n<p>\n<strong>Русский:</strong> <br/>\r\n\tЯ запрограммировал игру \r\n\t<strong>\"SHOOTER OF WAR \"</strong> с Unreal 4 на ВИНДОВС. В этой игре вы можете в меню выбрать до 21 Бота противника и 10 карт где вы можете играть. Эти карты называются \"Sanctuary, Sanctuary2, HighWall, HighWall2, GunHouse, GunHouse2, Forest, Forest2, House, House2\". В картах \"Sanctuary2, HighWall2, GunHouse2, Forest2, House2 \" вы можете с помощью анимаций сами изменять эти карты. Есть также одна карта которая называется \"WeaponTraining\", где вы можете попробовать все оружия в этой карте. В игре есть 33 пушки, и эти все пушки стреляют по разному, имеют свою силу выстрела, дальность выстрела и разное колличество боеприпасов итд. Есть 3 игровых мода в игре которые вы можете играть, которые называются \"FREE FOR ALL(DEATHMATCH), TEAM DEATHMATCH, ONE AGAINST ALL\". FREE FOR ALL(DEATHMATCH) и TEAM DEATHMATCH мод вы можете выбрать в стартовом меню, и  ONE AGAINST ALL мод вы можете выбрать в каждой карте в которой вы играете. В моде \"FREE FOR ALL(DEATHMATCH)\" вы играете друг против друга. В моде \"TEAM DEATHMATCH\" вы играете в синей или красной комманде с другими ботами противниками. В моде \"ONE AGAINST ALL\" вы играете один против других ботав противников. В игре какда вы играете, то вы можете это заснять а потом то что вы засняли, вы просто можете это посмотреть. В игре вы играете нормальными и большими пушками. В игре вы можете играть против до 24 поразному програмированных ботов противников, есть тоже большие противники, и также вы можете играть сами с до 24 разных персонажев игры, и также большими.\r\n</p>", "metacritic": null, "released": "2022-06-17", "tba": false, "updated": "2022-06-20T22:41:55", "background_image": "https://media.rawg.io/media/screenshots/1ed/1ede20d6b01e6dd55d1a506832e48f45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 582, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gamer5"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}