{"id": 806508, "slug": "the-wizards-apprentice-jongjungbu", "name": "The Wizard's Apprentice (Jongjungbu)", "name_original": "The Wizard's Apprentice (Jongjungbu)", "description": "<p><strong>The Wizard's Apprentice</strong> is a trading game inspired by classic games like <em>Trade Wars,</em> <em>Drugwars</em>, and <em>Dope Wars, </em>but with a more family-friendly theme.</p>\n<p>Buy low and sell high in the fantasy lands of <strong>Helios </strong>in order to pay off your student debt as a Wizard's apprentice. You have 30 days to to earn as much gold as you can by trading in <strong>Potions</strong>. What will your high score be?</p>\n<p>Local highscore records are saved to your game data.</p>\n<p><strong>Rules of the game:</strong></p>\n<ul><li>Press B to toggle your Bag of Potions. You may hold up to 4 different <em>types </em>of Potions, but there's no limit to how many each.</li><li>Each time you move to a new location or city, time will advance by 1 day and Potion prices will fluctuate. </li><li>When you move to a new location or city, there's a chance that a Potion type will be in abundance or in demand for one day. If you are lucky, it may be just what you need.</li><li>As you travel, there's a chance the Royal Guard may catch up to you and make you pay a fine for holding contraband. You can choose to fight or flee, to see if you gain a bag of gold or escape.</li><li>Visit the capitol Helios to pay off all or a portion of your student debt. Interest will accumulate every day on the remaining balance.</li><li>Visit the Mage Guild to study spells--for a fee. If your spells are powerful enough, you may be able to defeat the Royal Guards in a fight and seize any gold they may have.</li></ul>\n<p><strong>How to play?</strong>\n</p>\n<p>There are two ways you can play <strong>The Wizard's Apprentice</strong>.\r\n</p>\n<ul><li>You can sideload it to your Panic Playdate handheld console. Instructions can be found here: https://help.play.date/games/sideloading/\r\n</li><li>Or you can download it to your PC/Mac and play it in the Playdate Simulator. The Playdate Simulator is included in the <strong>free</strong> Playdate SDK. Link to SDK:\r\nhttps://play.date/dev/\r\n</li></ul>", "metacritic": null, "released": "2022-06-17", "tba": false, "updated": "2022-06-20T23:14:52", "background_image": "https://media.rawg.io/media/screenshots/93e/93eb3fcc41189e8d006162fe01baf926.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jongjungbu"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}