{"id": 806657, "slug": "sequencio-alpha", "name": "SequencIO - Alpha", "name_original": "SequencIO - Alpha", "description": "<p>Inspired by games like factori and ShapezIO, SequencIO is an engineering puzzle game where you design solutions to a problem instead of working out a correct answer. Each level contains a set of initial sequences and a set of output sequences that need to produced. This leaves the puzzling challenge of creating a sequence manipulation circuit up to you! Circuits are built up of actions, which follow common stack operations used in programming like pop, push, reverse, and more! <br/></p>\r\nThe SequencIO Manual<br/>\n<ul><li>Click an output node (Red) and then an input node (Blue) to connect them.</li><li>Output and input nodes can only have one connection. </li><li>Click on a connected input node to remove the connection. </li><li>Click on an action to move it, and right click whilst moving to rotate. </li><li>Click on the  tab at the bottom of the screen to open the toolbox. </li><li>Drag actions from the toolbox and place them into the workspace. </li><li>Actions can be deleted by dragging them over the red cross on the left of the toolbox.</li><li>Actions will only receive shapes if its outputs are connected and empty (Inputs and output buffer their sequences). </li><li>You can speed up time by clicking on the \"Fast Forward\" button in the top-right.</li></ul>\n<p>Background music - \"Library_2\" by sabrina_tvband, used with permission.</p>\r\nJoin the Discord for updates and to post suggestions: https://discord.gg/aKhPSACH", "metacritic": null, "released": "2022-06-17", "tba": false, "updated": "2022-06-21T00:21:05", "background_image": "https://media.rawg.io/media/screenshots/22b/22bb8250cf73a2ad9d940f7b1e5a3954.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SoggyKiwi"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}