{"id": 806700, "slug": "trippin-troll-trucker-tales", "name": "Trippin' Troll Trucker Tales", "name_original": "Trippin' Troll Trucker Tales", "description": "<p><strong>This game makes you work better, together!</strong></p>\n<p>In <strong><em>Trippin’ Troll Trucker Tales</em></strong>, you and your rowdy troll friends have taken your neighbours’ mining cart for a joyride. Guide the incomprehensible vehicle to its eventual demise as you face obstacles and hazards while doing your best to <em>work together as a team</em> and keep the dwarves’ mining cart going.</p>\n<p>\n</p>\r\nFEATURES\r\n<ul><li>Bask in the colourful, cartoonish aesthetics</li><li>Test your teamwork skills in local co-op</li><li>Play with up to three other players</li><li>Use simple controls</li><li>Control your troll with a gamepad or keyboard</li></ul>\r\nRESEARCH\r\n<em>The game was developed as part of the Master's in Digital Game Design and Development at Shenkar College of Engineering and Design.</em>\n<p>T4's goal is to study the impact of cooperative video games on group cohesion. Past research demonstrated how groups working together with set roles can become more effective. T4 tracks the performance of the group and of individual players. Together with questionnaires, we use the game to examine the group’s cohesiveness before and after playing the game.<br/></p>\n<p>For this purpose, the game was designed to be short, with abstract goals and a clear performance indicator – total distance covered.</p>\n<p>If you're interested in contributing to the study, please refer to this topic on our community forum.<br/></p>", "metacritic": null, "released": "2022-06-13", "tba": false, "updated": "2022-06-21T00:40:28", "background_image": "https://media.rawg.io/media/screenshots/9f1/9f19c5b1dfd85d19dffe058797a424ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zero Prep Games"], "genres": [], "publishers": [], "esrb_rating": null}