{"id": 806731, "slug": "erborista", "name": "Erborista", "name_original": "Erborista", "description": "<p>\n</p>\n<p>Simulation and Crafting genre game where players play the main character named Sekar who owns a herbal medicine shop to treat residents who are sick.\r\n</p>\n<p>To finish this game, Sekar has to sell her herbal medicine according to the disease from the buyer, in this game the character can also get plants that are efficacious to be used as herbal medicine by planting in the garden behind the shop.\r\n</p>\n<p>In this game, the character must pay attention to the ingredients to be formulated, because if there are buyers of the desired herbal medicine, the HP (Health Points) of the character will be reduced. In this game the character must complete all the existing missions, then when the mission has been completed the character can close the shop.\r\n</p>\n\n\n\n\n<p><strong>FEATURES</strong><br/></p>\n<p>1. Medical check-up, identify the customer's illness by bringing up a text dialogue interaction. </p>\n<p>2. Make/mix herbal medicine, after receiving the complaint and identifying the disease, the user/character will go to the herbal medicine manufacturing site/laboratory.   </p>\n<p>3. Customer acceptance, at this stage, just finished then the buyer pays according to the specified price (coins). Customers will react with a variety of different emotions once the customer uses/drinks the herbal medicine and will exit the screen. After the initial customer leaves, the next customer will walk to the scene, restarting the following phases.   </p>\n<p>4. In the garden, this stage is for growing various kinds of spice plants used for herbal medicine. Planting herbs by drag and dropping on the part of the plant that the player wants. To grow these plants, you have to wait until the plants grow at different times.<br/><br/>Don't forget to follow us on Instagram too!<br/>https://instagram.com/erborista_15?igshid=YmMyMTA2M2Y=<br/><br/>Team 15:</p>\n<p>Game Designer:<br/></p>\n<ul><li>Herica Christy \r\n</li><li>Firda Kusuma Ningrum\r\n</li></ul>\n<p>Game Project Management:</p>\n<ul><li>Lady Learny Glad Sahzah\r\n</li><li>Rahman Apriandi\r\n</li></ul>\n<p>Game Artist:</p>\n<ul><li>Aisyatul Faizah Ardiyanti\r\n</li><li>Nozha Nathania\r\n</li></ul>\n<p>Game Programmer:</p>\n<ul><li>George Richard Maramis</li><li>Michael Francis Wijaya</li><li>Randa Yuna Permana</li></ul>\n<p>Our Lovely Mentor: Dimas Ramdhan, S.Kom. M.Kom.</p>\n<p>#ICE #PMGD2022Batch1</p>", "metacritic": null, "released": "2022-06-02", "tba": false, "updated": "2022-06-21T00:52:15", "background_image": "https://media.rawg.io/media/screenshots/5df/5df5d61790869ea714ad4312b47128ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Syahard", "andylauwww", "Lady_learny", "nathan.zhaf"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}