{"id": 806815, "slug": "party-together", "name": "Party Together", "name_original": "Party Together", "description": "<p>Play with your friend and fight each other on multiple mini games.<br/></p>\n\n<p><strong>Characters</strong>\n</p>\n<p>All playable characters will have no difference except their appearance.\r\n</p>\n<p>They will all be presented in humorous forms and will not have a specific backstory. Nevertheless a small sentence will describe their personality.</p>\n\n<p><strong>ZRock</strong></p>\n<p>The strongest of the zouzou but also the stupidest. The story tells that one day someone asked him for the sum of 2 plus 2 and he is still waiting for the answer.</p>\n\n\n\n<p><strong>Bsabre</strong>\n</p>\n<p>His name is weird like his face. The story tells that one day a scientist had the idea to create a creature by copying what was done in nature but the experiment failed (or succeeded ?) and gave this Zouzou.</p>\n\n\n<p><strong>Valou</strong></p>\n<p>\r\nA very sympathetic ghost despite his drinking problems<strong>.</strong></p>\n\n<p><strong>Monf</strong>\n</p>\n<p>Behind this demonic face there is a heart that seeks only love.\r\n</p>\n\n<p><strong>Sena</strong>\n</p>\n<p>This Zouzou is rather special because he has the particularity to sleep in the most critical moments. He is also super lazy and always finds excuses not to work.\r\n</p>\n\n<p><strong>Games:</strong></p>\n<ul><li>Trail (Game 01)\r\n</li></ul>\n<p>Tron game like, you are moving around followed by a trail and your goal is to destroy other people with your trail.\r\n\r\n</p>\n<p>\n</p>\n<ul><li>Shoot the zouzou (Game 02)\r\n</li></ul>\n<p>You are on a map with the possibility to shoot players and the last one alive wins.\r\n</p>\n<ul><li>Save the zouzou (Game 03)\r\n</li></ul>\n<p>You have to dodge the obstacles that are coming in front of you and the last one alive wins.\r\n</p>\n<ul><li>BomberZouzou (Game 04)\r\n</li></ul>\n<p>Bomberman-like game. You have to be the last one surviving to win, you can kill the other player and they are bonus inside some of the blocks that you can destroy.</p>\n<ul><li>Find the Zouzou (Game 05)\r\n</li></ul>\n<p>Every player will be placed in a maze, they’ll have to find every Zouzou in it. The fastest one in the game ! But it’s not a normal maze, it’s an invisible maze. Every X seconds the maze is enlightened and you can see your way, but care to not fall off the platform. Memorize your way, and find the Zouzou before the others !\r\n</p>\n\n<p>Music made by Paul Mineraud: paulmineraudmusic@gmail.com</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-21T01:25:25", "background_image": "https://media.rawg.io/media/screenshots/172/172d6a7c9feedc4ada981482bbc6c62a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Monfred"], "genres": [], "publishers": [], "esrb_rating": null}