{"id": 806972, "slug": "lai-ren-lightworkers", "name": "来人 LIGHTWORKERS", "name_original": "来人 LIGHTWORKERS", "description": "<strong>SYNOPSIS:</strong><br/><br/>On New Year's Eve of Showa 1 (1926), Hiroshi meets Kiyoshi, his guardian angel. Following his advice, Hiroshi  reunites with his cousins for the first time since the Great Kanto Earthquake. In his new life with his relatives, Hiroshi gradually recognizes his destiny and embarks on a journey to fulfill his life's purpose.    <br/><br/><strong>PROLOGUE:  Ghosts of Sagami</strong><br/><br/>In the fall of Taisho 15 (1926), Hana and Kuyoin head to Sagami Castle Ruins after hearing about ghost sightings and find two ghost wolves. Hana sees the ghost wolves’ \"residual memories\" from their pasts, learning that the two wolves, covered in blood,  delivered letters to an unknown castle and then died there.<br/><br/><strong>CHAPTER 1:  Guardian Angel</strong><br/><br/>On New Year's Eve of Showa 1 (1926), Hiroshi encounters a man named Kiyoshi. Kiyoshi claims that he's a guardian angel and came to help him. Though sceptical, Hiroshi follows Kiyoshi's advice and gets reunited with his relatives for the first time since the Great Kanto Earthquake.<br/><br/><strong>CHAPTER 2:  Ghost of Yokohama</strong><br/><br/>In the winter of Showa 2 (1927), Hana &amp; Kuyoin invite Hiroshi to Mutsurenji Temple. They tell Hiroshi the truth about their Astronomy Club and encourage him to become a member. A few days later, they find out about a ghost sighting in Yokohama and head to Yokohama Castle Ruins.<br/><br/><strong>CHAPTER 3:  Ghost of Kawasaki</strong><br/><br/>In the summer of Showa 4 (1929), Hiroshi comes back from an exorcism at Kawasaki Castle Ruins and meets Kiyoshi at the temple. Kiyoshi reveals to Hiroshi what destiny awaits him. After learning of his destiny for the first time, Hiroshi is determined to fulfill his life's mission.<br/><br/><strong>CHAPTER 4:  Ghost of Shinagawa</strong><br/><br/>On New Year's Eve of Showa 4 (1929), the party heads to Shinagawa Castle Ruins. Not being able to capture the ghost of Shiyun, Hiroshi pins his hope on Leo to find and exorcise Shiyun. Then, Kiyoshi appears out of the blue and tells Hiroshi what he must do to save Shiyun.<br/><br/><strong>EPILOGUE:  The Gojo Association</strong><br/><br/>In Showa 14 (1939), about 10 years after the formation of the Gojo Association, Kiyoshi visits Hana and Kuyoin at Seiraikan Inn. Kiyoshi says that he has something very important to tell them. At first, Hana and Kuyoin think Kiyoshi has bad news, but instead he reveals the future of the Gojo Association. <br/><br/><strong>FEATURES:</strong><br/><br/>- 2D Visual Novel / Adventure<br/>- Dialogue-Heavy<br/>- One Ending<br/>- Several Puzzles to Solve per Chapter<br/>- Soundtrack and SFX<br/>- Auto-Save at Checkpoints<br/>- Completely Free! No Registration!<br/><br/><strong>HOW TO PLAY:</strong><br/><br/>You can walk, run, pick up &amp; use inventory items by left mouse button clicks.<br/><br/><strong>STORY, GRAPHICS &amp; PROGRAMMING</strong><br/><br/>FIFTHD<br/><br/><strong>SPECIAL THANKS</strong><br/><br/>​Andrew Warrick​", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-06-24T04:05:32", "background_image": "https://media.rawg.io/media/screenshots/ded/ded5e40ef2b77374f3f29631ec4d947c.jpg", "website": "https://fifthd.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 459, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FIFTHD"], "genres": ["Adventure"], "publishers": ["FIFTHD"], "esrb_rating": null}