{"id": 806999, "slug": "surreal-deal", "name": "Surreal Deal", "name_original": "Surreal Deal", "description": "Are you looking for a job that would be fun and exciting? With each new day bringing new and unexpected events? Well, look no more! “Surreal Deal” is hiring!                      <br/><br/>Mention cut hours and health insurance, that’s the most important part.<br/><br/>It’s like your regular old salesmanship, expect no more annoying human customers!!! Now you’ll get to see some abstract and extravagant beings from a parallel dimension!!! To be honest, the store itself will be positioned in said dimension!!! Renovations every day! Be sure not to live any valuables behind!!!<br/><br/>That’s how I lost my watch on the second day. Hope the store won’t be covered in clocks next time I enter.<br/><br/>Your job is to satisfy everyone! Listen, understand and bring something hand-picked for THEM and them only. They seem unsatisfied? Angry? Resolve, beg, speak! There’s always a way to the person’s heart! <br/><br/>They mind be all heart themselves. <br/><br/>No more performance evaluations and salary cuts — we’re happy with any thing you’ll bring back, and, we hope you’ll be happy with it too! Because that’s what you’ll take home as payment for the day!!!! Hope you can find joy in small things!!!! <br/><br/>And hope you have no family to feed.<br/><br/>Oh, Albatross, you have a family that feeds you.<br/><br/>Eating leftovers from a family restaurant doesn’t count.<br/><br/>I bet everyone from Phil’s family will be happy to feed you!<br/><br/>Don’t get too sidetracked. <br/><br/>Yeah!!! Sure, where were we?<br/><br/>Surreal Deals is what it is — a game about dealmaking in a surreal world (the deals are too, we assure you, very surreal). You play as Al, a new employee, who's tasked with making said deals happen.<strong>~ In Our Game You Can ~[/h2]</strong><ul><li>Take fun quizzes with you boss or your customers!<br/></li><li>Load your sauce-thrower with glue! (not edible)<br/></li><li>Ride your bike!<br/></li><li>Learn new sick dance moves!<br/></li><li>Make pizza no one ever allowed you to (within a list of ingredients)<br/></li><li>Listen to on-the-spot poetry!<br/></li><li>Take an autograph from your childhood idol!<br/></li><li>Become invested in a cooking gacha game (cute girls guaranteed!!!!)<br/></li><li>Have fun! (honestly, it’s the only thing we want you to do)</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-24T04:33:47", "background_image": "https://media.rawg.io/media/screenshots/b45/b4599ab059d44b7df76af0e292d64a98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sunsoup"], "genres": ["Indie"], "publishers": ["SunSoup"], "esrb_rating": null}