{"id": 806992, "slug": "paranormal-organization-magic-academy", "name": "Paranormal Organization: Magic Academy", "name_original": "Paranormal Organization: Magic Academy", "description": "Combat, free to match skills, with ease<br/>An easy and casual combat development game, a fun pinball play calls up different talented pretty girls to become your students.<br/><br/>First of all, thank you for taking time out of your busy schedule to become the dean of the School of Magic.You will recruit 40 students here and form a class.Your main task is to make your students stronger, each student advanced you can get higher scores, and compete with the players in the universe for the rankings.<br/>● Strange Admissions System<br/>The college has a special enrollment device, every time you use the magic crystal, you need a small game to choose a talent with magic talent, but enrollment is a two-way choice, if the qualification does not meet your requirements can give up, after all, only 40 places<br/><br/>● Learns Magic<br/>You don't have to worry about you can't magic and teach students, there is a magic classroom in the college, which has recorded a lot of magic, you send qualified students to study the principle of magic, can let the students to learn.<br/><br/>● Monster Invasion<br/>As the college becomes strong, the college will be invaded by many creatures. Students guard the college together, and if your students are strong enough, those creatures are just ingredients.<br/><br/>● Super Many Courses<br/>The college has prepared a lot of courses for students, each time after the course can make students a little stronger, step by step accumulation is the ladder to become the supreme god of magic.<br/><br/>● Is Easy To Relax<br/>College buildings can be upgraded over time, students can accelerate the upgrade efficiency, college energy can generate magic equipment, but also can further upgrade the building when you are tired to have a rest, the college will accumulate energy, wait for your arrival again<br/><br/>● Challenge Leaderboard<br/>You will compete with your peers.Challenge higher points which will be displayed on the Steam leaderboard.<br/>Features:  <br/>· Lots of magic skills to match at will  <br/>· Automatic combat, relaxed and leisure  <br/>· Difficult Boss creatures  <br/>· Unique 3D art style  <br/>· Too many levels  <br/>· Special way to extract characters  <br/>Operation method:  <br/><br/>Move the screen with the mouse or WASDQE  or ↑↓←→ <br/>", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-06-24T04:26:40", "background_image": "https://media.rawg.io/media/screenshots/c16/c16e0cbd8517fcd3e130c29dd94f7316.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ChenZePeng"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["ChenZePeng"], "esrb_rating": null}