{"id": 806943, "slug": "moonrise-itch-rhides", "name": "MOONRISE (itch) (rhides)", "name_original": "MOONRISE (itch) (rhides)", "description": "<p>This is a submission for Minijam 103: Darkness, a recreational 72 hour game jam.</p>\n<p>The limitation/themes of this contest are: \"Darkness\" + \"You are your own enemy\"</p>\n<p>The goal of the game is to survive three nights. You play as a werewolf living in a wooded cabin who is trying to survive attacking villagers. During the day, you will play in human form, you can barricade the cabin and restore health, but are otherwise defenseless. At night, you will transform into the werewolf, who only has the ability to attack, both enemies and your own barricades. <strong>NOTE</strong>: in this prototype, the player character can essentially only explore around the house. You can jump at the staircase basepoints to go up and down the stairs, and that's about it.</p>\n<p>Sadly, our development was unable to implement too many of the features within the given timeframe, so we are left with a walk-around-a-house-simulator/prototype for now. We've assembled some appropriate visual mocks to represent the desired gameplay, and as a courtesy, have included both the 'game over' and win screen, as neither result is currently achievable. Hopefully, we will update soon.</p><p>Coding by https://itch.io/profile/vardaanop1313<br/></p>\n<p>Art/Design by me (https://rhides.itch.io/)</p><p>There seems to be little hope for the original dev to implement the gameplay features. If you feel like this project could have some potential and would like to take a crack at the code, or are a developer who is looking for a gameplay/art/narrative designer,  please send me a DM and let me know.<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-21T02:14:42", "background_image": "https://media.rawg.io/media/screenshots/199/19983ccb6d6c36ad1a443b045ec6ff5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["rhides"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}