{"id": 807023, "slug": "havsala-into-the-soul-palace", "name": "Havsala: Into the Soul Palace", "name_original": "Havsala: Into the Soul Palace", "description": "Can you escape the Soul Palace?<br/>...or should you?<strong>Havsala features:</strong><br/>- Beautiful hand-drawn artwork<br/>- Unique and challenging puzzles<br/>- Rich story with historical references and mysticism<br/>- A note taking system to help you unravel the mysteries<br/>- Original soundtrack and voice acting<h3>Investigate the room</h3><br/>Find hidden objects, read the books of your ancient fellows, take notes on your special notebook, figure out how to use them and connect all these dots to solve the puzzles. You can even manipulate time in this room!<h3>Solve unique puzzles</h3><br/>Havsala is a mystery puzzle solving game where you interact with different parts of the room using your mouse, read the diaries and books you found along the way. You can use the note taking system in the game (or bribe the crow to help you along) to note the interesting and intriguing things you see or learn to use later to solve the challenging puzzles.<br/><br/><br/><br/><br/>Phryne was a woman in love with herself and with life. She didn’t want to perish. So she decided to build a nest in her soul. Thereby, even after the death of her beautiful body, her soul would be still there, remembered, in all the following bodies.<br/><br/>Explore the Soul Palace she built, find hidden messages and objects, examine the works of her reincarnations. Discover where and when each soul has lived to unravel their secrets; read the books they left in the Soul Palace's library and take notes. Walk out to the balcony for some thinking and star-gazing. Will you be able to overcome the challenges of the Soul Palace?<br/><br/>Havsala: Into The Soul Palace is coming out on Summer Solistice of 2022, 21st of June. Available on Windows.", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2024-03-27T20:21:35", "background_image": "https://media.rawg.io/media/screenshots/64a/64a3129de798e027969d05a208bcd300.jpg", "website": "https://stratera.co/havsala", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 15, "ratings_count": 1, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Stratera Games"], "genres": ["Indie"], "publishers": ["Stratera Games"], "esrb_rating": null}