{"id": 807085, "slug": "japanese-rail-sim-journey-to-kyoto", "name": "Japanese Rail Sim: Journey to Kyoto", "name_original": "Japanese Rail Sim: Journey to Kyoto", "description": "\"Japanese Rail Sim\" is a live-action video and a realistically reproduced driver's seat.<br/>It is a railway simulation game where you can experience full-scale railway driving.<br/>Easy operation just by operating the mascon and the brake,<br/>Anyone can feel free to feel like a driver.<br/>Let's enjoy the scenic Japanese scenery with [real] images!<h3>Experience the Eizan train with full HD live-action video!</h3>The stage of this work is the local line \"Eizan Electric Railway\" in Kyoto, which is very popular as a tourist destination.<br/>Nature is abundant, including the \"Maple Tunnel,\" which is famous for its autumn colors.<br/>Run in a quaint landscape from the city to the mountains.<br/><br/>High-definition, high-definition full HD live-action video shot locally<br/>You can even feel the air.<br/><br/>Smooth video playback and realistically reproduced driver's seat<h3>You can feel the immersive feeling to the maximum.</h3>Full volume! Eizan Electric Railway All lines / up and down lines can be enjoyed many times!<br/>Includes two lines, the Eizan Main Line and the Kurama Line.<br/>Even on the same route, the slopes are different on the up and down, so you can enjoy it repeatedly.<br/><br/>In addition, you can experience the scenery of early summer and autumn in Kyoto by recording images of the fresh green season.<h3>Enjoy the difference in driving with two vehicles!</h3>A vehicle that represents the Eizan Electric Railway,<br/>It is possible to operate two vehicles, \"Observation Train Kirara\" and \"Sightseeing Train Hiei\".<br/>Let's drive while enjoying the difference.<h3>From home to Kyoto anytime</h3>There are many sightseeing spots along the Eizan Electric Railway, such as historical temples and shrines.<br/>Also includes a \"guidebook\" that introduces the highlights along the railway line!<br/><br/>Don't miss the \"Tetsutabi Material Collection\" that includes information on successive vehicles.<br/>Please enjoy the travel along the railway line as well as driving.<h3>Optimized for PC</h3>Supports all keyboard operations and mouse menu operations.<br/>Of course, it also fully supports controller operation!<br/>You can enjoy it with your favorite operation.<br/><br/>Scheduled to be Compatible with 3 screen sizes and trading cards!", "metacritic": null, "released": "2022-06-22", "tba": false, "updated": "2022-06-24T06:24:10", "background_image": "https://media.rawg.io/media/screenshots/642/64217e56842fc307ed39a22256137fe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "playing": 1}, "playtime": 6, "achievements_count": 34, "ratings_count": 0, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sonic Powered Co.,Ltd."], "genres": ["Simulation"], "publishers": ["Sonic Powered Co.,Ltd."], "esrb_rating": null}