{"id": 807035, "slug": "airport-service-simulator", "name": "Airport Service Simulator", "name_original": "Airport Service Simulator", "description": "Welcome to the Airport Service Simulator, where your skills will be put to the test on the airport apron!<br/><br/>Aircrafts are waiting to be refuelled and loaded with luggage, the condition of the runways has to be checked and passengers want to be transported from the terminal to the plane as well. Can you manage to keep the flight operations running at a true-to-theoriginal airport?<br/><br/>Get to know the daily routine of an apron worker and operate various vehicles, from pick-up transporters to baggage trucks, in order to fulfil your tasks. But beware - it‘s not so easy to keep your orientation on a busy apron with AI vehicles and large, moving<br/>aircrafts!<br/><br/>Thus, better stick to the traffic rules for ground vehicles at an airport and always be aware of other road users.<br/><br/>Carry out your various tasks carefully and within a given time frame, depending on the difficulty level, in order to successfully complete your missions and take on further tasks. Thanks to realistic replicas in the game world, the Airport Service Simulator offers you the opportunity to experience the digital professional world on an airport apron in a realistic way.<br/><br/><ul><li>Various vehicles:<br/>- Pick-up transporter<br/>- Baggage truck<br/>- Trolley<br/>- Apron emergency vehicle<br/><br/></li><li>Complete various predefined tasks<br/></li><li>Complete your missions carefully and within a certain time frame<br/>[*Realistic realisation of the game world<br/></li><li>Various levels of difficulty<br/></li><li>AI vehicles on the apron</li></ul>", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T05:19:36", "background_image": "https://media.rawg.io/media/screenshots/79b/79b1135d2a0b9c41e2b35f26a3cf6f8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PadLabs"], "genres": ["Simulation", "Casual"], "publishers": ["PAD-Labs"], "esrb_rating": null}