{"id": 807050, "slug": "aerofly-fs-4-flight-simulator", "name": "Aerofly FS 4 Flight Simulator", "name_original": "Aerofly FS 4 Flight Simulator", "description": "<p>Aerofly FS 4 is a highly realistic Flight Simulator for beginner, intermediate and professional flight sim pilots. Explore the world of flying with a large fleet of highly detailed aircraft with fully animated and interactive 3D cockpits and custom coded systems. Fly with complex airliners, helicopters, business jets, fighter jets and warbirds, general aviation aircraft, aerobatic stuntplanes and gliders across the photorealistic landscape.<br />\nAerofly FS 4 is a true next generation flight simulator with an easy to use and intuitive user interface as well as custom graphics and physics engines using state of the art technology such as 64bit support, multi-core processing, native Vulkan and Virtual Reality (VR) support, a real time full multibody simulation and complex aerodynamics simulation. World wide coverage of elevation data and base aerial images are included with Aerofly FS 4.<br />\nStep into the flight deck of your favorite airliner or enjoy a relaxing cross country flight in a warbird. Discover new places by flying one of the many custom missions or become a virtual airline pilot and choose from tens of thousands of real world airline flights. Track your career progress with the new flight-log feature or try to obtain all achievements in all aircraft categories.Aerofly FS 4 Features<br />\nRealistic flight and ground physics<br />\nIntuitive user interface with location map and graphical route editor<br />\nStart the flight instantly in a cruise, takeoff or landing configuration;<br />\nor on the ground ready for taxi or cold and dark<br />\nHighly detailed and interactive 3D cockpits<br />\nTime-Skip feature to jump ahead in the flight<br />\nInstant replay<br />\nOptional simulated copilot that can fly the aircraft autonomously<br />\nOptional flight assistance features like automatic nav-tuning, automatic lights, caution/warning muting and other quality of life features<br />\nFlight logs, statistics and achievements<br />\nFlight mission presets and custom missions<br />\nGlobal Air Traffic based on 10,000+ real world flights<br />\n1200+ custom modeled airports<br />\nHigh resolution aerial images<br />\nScenery cultivation: 3D buildings, powerlines, wind-turbines, trees, etc.<br />\nCustom modeled famous landmarks and bridges<br />\nWorld wide elevation, aerial images and navigation data coverage<br />\nSloped and curved runways<br />\nAdjustable time of day, visibility, wind, clouds, thermal activity and turbulence<br />\nReal time ground illuminating from aircraft lights and apron flood lights<br />\nMost common joysticks assigned out of the box and ready for your first flight<br />\nSupport for multiple joysticks, throttle units, rudder pedals and more<br />\nFull Oculus Rift VR support and full Oculus Touch controller support<br />\nHTC Vive VR support and full Vive Controller support<br />\nTrackIR support<br />\nSupport for Saitek Multi Panel, Radio Panel, Switch Panel and Saitek TPMAircraft Features<br />\nFully interactive 3D cockpits, fully VR hands compatible!<br />\nHighly realistic physics simulation with full multibody simulation<br />\nState of the art real-time flight physics with dynamic computations for airfoil lift, drag and moment based on flap, slat and spoiler positions, propeller wash, ground effect and wing downwash<br />\nNatively simulated wing bending - no animation<br />\nRealistic ground physics with full landing gear compression<br />\nCustom engine simulation based on thermodynamic cycle<br />\nCold and Dark startups<br />\nAdjustable cockpit lighting and display brightness<br />\nAuthentic EFIS displays including electronic checklists in the most modern airliners<br />\nVery high level of system depth and thousands of custom coded aircraft systems<br />\nCaution and warning systems<br />\nRealistic GPWS callouts<br />\nRealistic Autopilot that operate just like the real thing, with full LNAV/VNAV or<br />\nmanaged/selected features, auto-land and mode reversions<br />\nCustom fly-by-wire systems with realistic handling qualities and protections<br />\nFMS programming using MCDU and CDU devices, including IFR procedures like<br />\ndepartures, arrivals and approaches (SIDs, STARs, APPRs)Aircraft ListA320-200<br />\nB737-500<br />\nB777-300ER<br />\nKing Air C90Gtx<br />\nLearjet 45<br />\nBombardier Dash8-Q400<br />\nEurocopter EC135 helicopter<br />\nRobinson R22 helicopter<br />\nCessna 172<br />\nBaron 58<br />\nF-15E<br />\nMB339<br />\nBücker Jungmeister<br />\nP38 Lightning<br />\nF4U Corsair<br />\nSopwith Camel<br />\nPitts S-2B<br />\nASG-29 glider<br />\nSwift S1 gliderAdditional Content<br />\nTo reduce the download size of the base package of Aerofly FS 4 Flight Simulator not all areas of the world share the same ground aerial image resolution. Additional free downloadable content packages (DLCs) are available in the Store to download higher resolution images and more custom modeled airports.<br />\nThe Aircraft Add-On DLC includes new aircraft such as the A380, 787 Dreamliner, 747 and CRJ-900 airliners.</p>", "metacritic": null, "released": "2022-07-04", "tba": false, "updated": "2022-07-11T11:03:42", "background_image": "https://media.rawg.io/media/screenshots/47d/47d14dd5e916f742107b6d323a7ce932.jpg", "website": "https://www.aerofly.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["IPACS"], "genres": ["Action", "Simulation", "Racing", "Indie"], "publishers": ["IPACS"], "esrb_rating": null}