{"id": 807034, "slug": "hunyadi-strategy", "name": "Hunyadi Strategy", "name_original": "Hunyadi Strategy", "description": "Hunyadi is a hexagonal strategy game based on a historical character John Hunyadi from the 15th Century. He was one of the greatest military mind of his age. His father was  a simple soldier and he rose to become governor of Hungary.  He lead military campaigns mostly against the rising Ottoman empire. But also fought battles in various countries from Italy to Bohemia. He mostly used devastating heavy cavalry with mobile light cavalry and also incorporated Hussite war wagons into his army in large numbers. <br/><br/>The game will be released in Early Access. So please expect bugs.<h3>What is the latest in Development?</h3><br/>We are able to Fortify units. Moral and damage system were rebalanced. Battle events got introduced So units can get effects (panicked, fortified, encouraged)  in certain turns or depending on large loss or loss of a VIP unit. AI also capable give commands for groups of units (hold, attack)<br/><br/>The Game had a complete graphical reskin in the latest Alpha version, with a new beautiful GUI. Also add a lot more information on the units and lands available with the new Unit Info or the Battle State Bar, Command Bar, Turn Controller, or Popup Menus.<br/><br/>We add fully animated new 3D unites to make the battle a lot more fun. The units have idle, move, run attack, taking damage and dying animations.<h3>Battles so far in the game</h3><br/><ul><li>Battle of Szegszárd - 1440<br/></li><li>Battle of Marosszentimre. - 1442<br/></li><li>Battle of Szeben - 1442<br/></li><li>Battle of Iron Gate (Vaskapu) - 1442<br/></li><li>Battle of Nis - 1443</li></ul>", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T05:17:28", "background_image": "https://media.rawg.io/media/screenshots/dd5/dd54ec5f47e36be28612c0e74ee36206.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["8 Continents"], "genres": ["Strategy"], "publishers": ["8 Continents"], "esrb_rating": null}