{"id": 807052, "slug": "bolu-2", "name": "Bolu", "name_original": "Bolu", "description": "Set in Abant Lake, one of the most beautiful regions of Turkey, this game offers you a colorful experience and a different game. In the Bolu game, you are actually in a dream and trying to survive. At the beginning of the game, you are a newly recruited worker in an unknown land far from the city. You are stationed there and you steal a weapon that a friend of yours cares about without knowing it. The worker, who is unaware of what will happen because he has stolen a gun on his head, has a dream and disappears with his colleagues after a fire occurs in the radio tower in the place where he works in that dream. After this event, in other words, in the dream of the character you are playing, you suddenly find yourself in Bolu Abant Lake and the adventure begins. Bolu Abant Lake, which takes place in the main place of the game, is an island because it is unrealistic. Different animals will be waiting for you there. You will have to survive and build your home and explore the surroundings. And you will even have to make a deal with someone underground and get rid of it, your dream. There will be a few things you need to find there, like finding the password for a locked room in an abandoned hotel. You are not alone in Abant. A different game from what you know, Bolu is a mixed non-large story-based game that includes both story and simulation, mission and survival. Bolu, which is a survival game, is a difficult game. Real or unreal things greet you on the island where you are lost. You can set up a bench, crush the mines you have contracted, turn them into dust and take another step to get rid of it. When you're hungry, you can cook and eat meat over a hot campfire. The main goal of the game is to get rid of that island. Someone has to take you from that island or you will die in reality as you died in your dream. There are various mines in the game. You can combine them and use them to make bullets and fight against aggressive animals.<h3>SETUP A WORKBENCH</h3><br/><br/>There is a unique machine system in Bolu game that is different from other systems. On this bench; You can crush neon, coal, etc. and grind them into powder.<h3>FISHING</h3><br/><br/>Fishing in your dream is easier than you think... Produce simple fishing nets, install them and hunt the fish.<h3>BUILD</h3><br/><br/>Build a shelter to protect yourself from aggressive animals at night.<h3>COOK</h3><br/><br/>Feed your stomach by cooking things such as meat, fish, etc.<h3>EXAMINE</h3><br/><br/>You can examine almost all of the items in the game. Some items also have special animations.", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T05:44:53", "background_image": "https://media.rawg.io/media/screenshots/851/851df86a2c5b687e58521af0500c3538.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 378, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lophius Games"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["Lophius Games"], "esrb_rating": null}