{"id": 807092, "slug": "everything-is-for-humanity", "name": "Everything Is For Humanity", "name_original": "Everything Is For Humanity", "description": "<strong>Warning:</strong> This game may potentially trigger seizures in people with photosensitive epilepsy. Player discretion is advised.<br/><br/>Everything Is For Humanity is an exploration and escape-themed psychological horror &amp; horror game. The game focuses on the storyline and player encounters challenging tasks in the linear flow of the game.<br/><br/><strong>Place: </strong><br/>The game takes place in the 2020s in a huge scientific facility. The part of the facility above the ground is just the tip of the iceberg. Players will explore the huge underground part called Ground.  Besides, players will wander through non-Euclidean spaces and witness supernatural events. Most importantly, players will never be alone while doing all this.<br/><br/><br/><br/><strong>The storyline of the game: </strong><br/>Some scientific research is carried out in the scientific facility founded under the leadership of Dr. Jeffery Phill. As a result of these studies, the organization succeeded in producing “Synthetic brain” and “Human bodies” and now started to develop an artificial intelligence called SynOS to support these structures. The project received support from many well-known businessmen and the state in a short time. In the game, you will be the leader of a software development team. You will discover a synthetic create that has fallen into the wrong hands and is wants to create a superior human race, and you will learn some blood-curdling truths. Will you escape? Or, try to stop it? <br/><br/><br/><br/><strong>Difficulty:</strong><br/>This game includes artificial intelligence that disrupts your linear flow. You can defend. You have no choice but to escape and use your intelligence. So, Everything Is For Humanity is a difficult game. <br/><br/><strong>Adult Content Warning:</strong><br/>This game contains violence and horror elements. It focuses on the creation and metaphysical creatures. Player discretion is advised.", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-24T06:33:09", "background_image": "https://media.rawg.io/media/screenshots/955/9551ea239b32fab9a54f584df47512a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vanquisher Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Vanquisher Games"], "esrb_rating": null}