{"id": 807154, "slug": "slash-roll-multiplayer-rpg", "name": "Slash & Roll: Multiplayer RPG", "name_original": "Slash & Roll: Multiplayer RPG", "description": "Join an online multiplayer RPG and roll dice to face off against your enemies! Strike other nations in coop online battles. Fight in multiplayer PvP team clashes against other guilds to dominate the ranking!<br/><br/>- Band together in the exciting co-op fighting!<br/>- Create or join a guild to compete in guild wars - bribe the enemies to join your side!<br/>- Strategize together! Chat with your guildmates to time your attacks and talk tactics<br/>- Brawl in epic real time multiplayer game of 20v20 in dice battles<br/>- Join the skirmish mode to face your enemies<br/>- Level up your hero to contribute to the power of your guild<br/>- Take advantage of character customization with unique weapons and cosmetics, or get a mount to tower over the battlefield and boost your attack!<br/>- Roll dice, attack, and crit! Collect shields to enhance your defence<br/>- Send gifts to your guildmates and allies to boost their progress or help them to take the victory!<br/>- Become the champion or shield destroyer!<br/><br/>Like in most online RPG co op games you are a true warrior born to fight for your allies. Battle friends and foes, defend your tower, help your allies to defeat opponents and win skirmishes together!<br/><br/>Slash &amp; Roll gives you an amazing opportunity to level up very fast and become the key member of your team. Compete with other players for outstanding weapons and seasonal gear to stand out from the crowd. It’s a dream come true for every fan of online PvP games who looks for customization features.<br/><br/>Take part in real time multiplayer games. Unite with powerful warriors in one of the most co-op online RPGs!<br/><br/>Cooperate, compete, turn failures into victories, and fight together! Are you ready to roll?<br/><br/><br/>Please note that although Slash &amp; Roll is free to play, our users are able to purchase virtual items with real money. If you don’t want to use this feature, please disable in-app purchases.<br/><br/>Privacy Policy:<br/>https://gamesture.com/gamesture-privacy-policy.html<br/><br/>Terms of Service:<br/>https://gamesture.com/gamesture-terms-of-service.pdf", "metacritic": null, "released": "2021-11-15", "tba": false, "updated": "2022-06-24T07:48:59", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba6da408883a723dcdfd12efc711366c_dNNVD96.jpg", "website": "https://www.facebook.com/SlashandRoll/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gamesture"], "genres": ["Action", "RPG"], "publishers": ["Gamesture"], "esrb_rating": "Everyone 10+"}