{"id": 80711, "slug": "pyramid-solitaire-4", "name": "Pyramid Solitaire ●", "name_original": "Pyramid Solitaire ●", "description": "Pyramid Solitaire Rules<br/><br/>Objective:<br/>The objective in Pyramid Solitaire is to get rid of all the cards in the Pyramid. You get rid of cards by matching two cards whose ranks equal 13 together. Possible matches would be a 3 and a 10, 5 and an 8 etc. An ace ranks as 1, a Jack is 11, Queen is 12 and King is 13.<br/><br/>Gameplay:<br/>The game board in Pyramid solitaire is made up of four things:<br/>\t•\tThe Pyramid: The pyramid is made up of 28 cards, in 7 rows. Each card is partially covered by two cards from the next row.<br/>\t•\tThe Stock: The facedown pile on the bottom left. It is used to draw cards from and put on the Waste.<br/>\t•\tThe Waste: The faceup pile next to the Stock. Cards on the Waste can be matched to cards in the Pyramid to get rid of the Pyramid cards. E.g. you can tap a 4 from the Waste and open 9 on the Pyramid, and then both those cards will be moved to the Foundation, and are out of the game.<br/>\t•\tThe Foundation: The place where cards that have been removed from the Pyramid are put.<br/>The purpose of the game is to match cards together so their ranks equal 13. The cards that are available are any card on the Pyramid that have no other cards covering them, and the top card on the Waste pile. In the beginning of the game all the cards in the bottom row of the Pyramid are available, then slowly the cards in the upper rows become available as you remove more of the cards in the lower rows.<br/><br/>Allowed Moves:<br/>\t•\tFlip cards from the Stock onto the Waste. You move cards from the Stock onto the Waste by tapping on the top card of the Stock.<br/>\t•\tMove the top card of the Waste onto an open Pyramid card. You can first tap the Waste card and then tap the Pyramid card. The Pyramid card must be available for this to work, it can't be covered by any Pyramid card from a lower row.<br/>\t•\tMove a Pyramid card onto another Pyramid card. Both the Pyramid cards must be available, not covered by any other card for this to work. First tap on one and then tap on the other.<br/>\t•\tReset the Stock once it's empty. Once you've flipped all the cards from the Stock onto the Waste you can tap on the RESET button where the Stock was, and it will put all the cards from the Waste back into the Stock. In this version you are allowed to reset the Stock as many times as you want.<br/>\t•\tMove a King to the Foundation. The purpose is to move cards whose combined ranks equal 13 to the foundation. A King ranks as 13 by itself, so it can't be matched with any other card. To get rid of a King you can simply tap the card once.<br/>\t•\tYou can Undo as many times as you like. The game offers unlimited undos. Each Undo counts as a new move though, so if you're trying to win the game in as few moves as possible you should be careful about how many undos you use.<br/><br/>Winning:<br/>A game is considered won if all the cards from the Pyramid are removed. Not all games are winnable. The game will notify you if there's no chance of winning the game anymore.<br/><br/>Time and Moves:<br/>The game counts the moves you make, and measures the time it takes to finish the game, so you can compete against your previous best games. The best possible game would be if you never used the stock and always removed two cards at a time from the Pyramid (no kings), in that case your move count would be 14.<br/><br/>Variations:<br/>There are many variations of Pyramid Solitaire possible. In some you have more Waste piles, in others you never reset the Stock, some have the Stock face-up, and there are plenty of others as well. I've chosen this variation, please don't email me telling me it's \"wrong\" or leave bad rate, there are many possibilities, this is just the one I like the best :)", "metacritic": null, "released": "2017-03-11", "tba": false, "updated": "2019-07-30T08:06:49", "background_image": "https://media.rawg.io/media/screenshots/28e/28eb652dffd57d1c4e293ae96e81dca5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jose Varela"], "genres": ["Board Games", "Card"], "publishers": ["Jose Varela"], "esrb_rating": null}