{"id": 807108, "slug": "spy-rumble", "name": "Spy Rumble", "name_original": "Spy Rumble", "description": "<strong>Agents.<br/>Operation C has been issued.<br/>Please transfer coins containing classified information from Area 10.<br/>Please be aware of the presence of enemy spies.<br/>I wish you all the best.<br/>\t\t\t\t\t-Master Command</strong><br/><br/><br/><br/>An enemy spy is mixed in with the agents called for by Operation C. The purpose of the spy is to sabotage the activities of the agents.<br/>The purpose of the spy is to disrupt the activities of the agents and eliminate them all.<br/>Agents report suspicious persons to each other in meetings and sometimes vote to expel them.<br/>The agents win if they dispose of all the spies or complete Operation C.<br/>However, if all the agents are killed before completing Operation C, the spies win.<br/><br/>The game is an identity concealment game in which players are divided into two camps, the agent camp and the spy camp, and must take action to achieve their respective victory conditions.<br/>Multiple players can play online/voice chat function is available (voice chat function is recommended for this game).<br/><br/><h3>-Agents-.</h3><br/>Agents must transfer the coins they have collected, fill up their helicopter with fuel and escape, or find and dispose of or expel a spy who has slipped through the cracks.<h3>-Spies-</h3><br/>The objective of the spy is to get rid of all the agents. To do so, you must charge and use items and weapons available in the spy store and spy gadgets that you bring with you, while pretending to be an agent at times.<br/><br/>Spy gadgets are secret spy weapons that can be selected and brought in before the game starts. You can use them as many times as you like by recharging them at the store.<br/><br/><br/><strong><h3>If you spot someone suspicious, call a meeting!</h3></strong><br/><br/>In the store you can purchase conference items that call players together for a discussion.<br/>At the meeting, each player can vote for someone, and the player with the majority of votes can be expelled.", "metacritic": null, "released": "2022-06-23", "tba": false, "updated": "2023-10-10T19:21:28", "background_image": "https://media.rawg.io/media/screenshots/9b7/9b74afa801e4d28858283bbf86848c10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 58}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["nekogameteacher"], "genres": ["Action", "Indie"], "publishers": ["nekogameteacher"], "esrb_rating": null}