{"id": 807199, "slug": "legionlands-auto-battler-game", "name": "Legionlands: auto battler game", "name_original": "Legionlands: auto battler game", "description": "Legionlands is a free, classic autobattler which combines turn-based strategy features and card battles. Choose the characters to fight for you on the magic arena: Minotaurs or archers, crossbowmen or bogatyrs. Create an invincible army in the epic universe of LegionLands!<br/><br/>STRATEGY! IS IT YOUR THING?<br/><br/>Spectacular game battles await your Legion. It's a thrilling experience to watch and take part in. Highly-detailed units will make autobattles more dynamic. It's time to cast  the spells and earn the golden coins in our magic world of LegionLands! <br/><br/>START THE BATTLE GAMES ONLINE<br/> <br/>You are the king on this battlefield, where over 30 unique units are waiting for your tactical skills. Spread your warriors all around the battle arena or get your army together to attack and threaten your enemies. It's up to you whether your army wins or leaves the battlefield empty-handed.<br/><br/>THE ARENA IS WAITING FOR YOU, MY LORD KING!<br/> <br/>The war of Clans opens once a week. You can join an existing clan or create your own one to take part in Clan Battles. You have to  pass 100 waves to open the tactical puzzles, where some new units and schemes of enemy formations will be given to you. Your task is to place the units on the Arena in such a way that your Legion wins. But can you use your skills in the right way when you have all the cards in front of you?<br/><br/>PVP ARENA BATTLES<br/> <br/>Each unit has a set of unique skills. Combine your units to make your army stronger and more powerful. In LegionLands you can:<br/> <br/>- Upgrade units and squad levels;<br/>- Get magic artifacts to increase your combat power;<br/>- Fight against the most dangerous and violent enemies of this epic universe;<br/>- Play both: online and full-featured offline gameplay without the Internet;<br/>- Get over 30 strong kingdom heroes;<br/>- Fight in daily boss battles;<br/>- Take part in PvP battles (PvP).<br/><br/>While taking a break from the battles, complete quests and earn coins and mine for gold, or even go hiking for new resources. This is your royal battle! You will never get bored!<br/><br/>YOU'RE IN FOR A BIG FIGHT!<br/> <br/>Do you think this is a simple auto battler? No way! Make sure it's not an easy thing by entering the magical world of LegionLands! Start the battle after having your army position checked. Only the strongest players will stay alive. Let the battle of wits begin!<br/><br/>Do you like LegionLands? We are looking forward to seeing your review!<br/>Any questions? Write here:<br/>- support@blackbears.mobi<br/>- facebook.com/blackbearsgames<br/><br/>Video bloggers and review authors! We are glad to see your content about LegionLands on your channels. We provide help and support to creative authors. If you like online games, we will be glad to receive your reviews on other Black Bears mobile games. Relax and do it!<br/><br/>Auto-Renewal Subscription. Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable. Terms of Use &amp; Privacy Policy: https://blackbears.mobi/legal/us/terms https://blackbears.mobi/legal/us/privacyGot a question? Email: support@blackbears.mobi", "metacritic": null, "released": "2022-02-03", "tba": false, "updated": "2022-06-24T08:32:37", "background_image": "https://media.rawg.io/media/screenshots/1bf/1bf0de9d8c24e9ca8dfd25c7718356d3.jpg", "website": "https://blackbears.mobi/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CHERNYE MEDVEDI, OOO"], "genres": ["Strategy", "Casual"], "publishers": ["CHERNYE MEDVEDI, OOO"], "esrb_rating": "Everyone 10+"}