{"id": 807171, "slug": "dont-steal-my-chicken", "name": "Don't Steal My Chicken", "name_original": "Don't Steal My Chicken", "description": "Don't Steal My Chicken is an arcade survival game where you are the farmer who owns the chicken farm and your main goal is to protect your chicken, chicks &amp; eggs, and to fight and battle with enemies. Kill the boss enemy to save the big farm - Enjoy an amazing chicken farm adventure! <br/><br/>Protect your chicken and eggs from their fierce enemies in this arcade survival game - Foxes, monkeys, zombies, and many others!<br/><br/>- Bob<br/>- Steve<br/>- Dania<br/>- Laura<br/><br/>Choose the character that will inspire you to make a strong defense plan for your chickens despite all the dangers of the outside world. <br/><br/>Kill the boss enemy - After you finish the battle with the attackers at night levels, you have to kill the enemy boss to advance to the next level. It gets more and more challenging with each level, and your farmer character will have to fight with a spider, zombie boss, and many others!<br/><br/>Main features in this chicken farm adventure game:<br/>- Arcade Survival - Casual-survival gameplay that will keep you engaged with challenging levels.<br/>- Battle With Enemies - You are on the line with various enemies, such as foxes, monkeys, and zombies. Make sure that your chickens &amp; chicks are safe from them! <br/>- Collecting Eggs - You have to collect eggs to make sure earn money and complete the current level.<br/>- Special Powers - When you collect enough eggs in your basket, you will be able to exchange them for special powers: Special attack, Ice attack, Tower, Damage booster, Health booster, Speed booster, Dog property, Crow property, and Boom property. It will help your farmer character to easer fight and battle with the enemy.<br/>- Challenging Day &amp; Night Levels - On your way, you have to complete day and night levels. At night levels, you have to fight and kill the enemy boss in order to complete the level. A farm adventure that you should not miss! <br/>- Golden Chicken - This chicken is especially important for you, because it will give you golden eggs. Why is that important? It is opening you a possibility to win multiple eggs or other rewards!<br/>- Store - When you earn enough money, you will be able to upgrade your abilities.<br/><br/>Download this engaging arcade survival game and get involved in an amazing and unforgettable chicken farm adventure - Protect your chickens &amp; chicks and save your big farm! Beat all enemies and kill the boss!", "metacritic": null, "released": "2022-05-17", "tba": false, "updated": "2022-06-24T08:06:30", "background_image": "https://media.rawg.io/media/screenshots/3c4/3c4458abc4dcf075b134ec756f03b790_du73SUm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BOOM FOR PRODUCTION AND DUBBING"], "genres": ["Adventure", "Casual"], "publishers": ["BOOM FOR PRODUCTION AND DUBBING"], "esrb_rating": "Teen"}