{"id": 807156, "slug": "lord-of-seas", "name": "Lord of Seas", "name_original": "Lord of Seas", "description": "Join millions of players worldwide to be the lord who survives on lost islands, explore the sea, build kingdoms, defeat pirates, and compete in epic wars! <br/><br/>Live your legend in Lord of Seas, an MMO, real-time strategy game set in uncharted seas, filled with battles, lost shipwrecks, and treasures. Recruit heroes, build ships, explore lost treasures, compete in bounty missions, defeat wanted pirates, expand your kingdom and be the king in this magical world. <br/><br/><br/><br/>**Features**<br/>Real-Time Battles<br/>Battles with millions of players from all over the world. Anyone can join or leave a battle at any time, allowing true RTS gameplay. Fight and conquer to build your empire.<br/><br/>Explore Seas<br/>The world of Lord of Seas is covered in thick fog. Dispatch eagles to explore the uncharted seas and uncover the hidden treasure within. Investigate mysterious structures, gather intelligence on your enemies, save sailors and prepare yourself for the ultimate clash!<br/><br/>Panoramic Map<br/>All in-game action takes place on a single, enormous map inhabited by players and NPC characters. Infinite Zoom feature allows you to transition freely between the world view and individual islands<br/><br/>Epic Pirate Ships<br/>Call upon dozens of epic ships which will serve as your trump card on the battlefield, from La Niña and Rock Jaw to The Guardian and the Vikings Nordic Long Ship.<br/><br/>Powerful Heroes<br/>Recruit various heroes who will serve as your commanders. Level up your commanders by defeating pirate ships and your enemies in battles. Let them lead your kingdom to glory Atlantis!<br/><br/>Conquer the Sea<br/>Fight alongside your alliance to take control of the uncharted Seas. Clash with other players and use superior tactics to emerge victorious in an MMO strategy battle!", "metacritic": null, "released": "2022-02-21", "tba": false, "updated": "2022-06-24T07:51:32", "background_image": "https://media.rawg.io/media/screenshots/e52/e52d8951dd82760149c8c72c749e72cf_On500Xo.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 223, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SPARKLER GAMES HONG KONG"], "genres": ["RPG", "Strategy"], "publishers": ["SPARKLER GAMES HONG KONG"], "esrb_rating": "Everyone 10+"}