{"id": 807138, "slug": "slave-zero-x", "name": "Slave Zero X", "name_original": "Slave Zero X", "description": "<p>From the top of Megacity S1-9, the Sovereign Khan rules with fists of iron and flesh. Beneath the city’s rotting foundations, a vengeful warrior embarks on a journey to murder him. 4 years prior to the events of Slave Zero, Slave Zero X brings new life to a world where horrific, living machines known as Slaves are primed to become the latest tools of war in humanity’s long and bloody history. A secret band of warriors known as The Guardians hope to stop these biomecha from being unleashed upon the world, but one swordsman among their ranks has a different idea: use the enemy’s own weapon against them. By merging with a stolen Slave Unit Prototype, Shou will become a furious Devil in pursuit of killing a false God.</p>\n<ul>\n<li>KILLER COMBOS: Use swift swordplay, explosive ordnance, and stylish combos against an army of meat and metal.  </li>\n<li>DEATH FROM ABOVE: Air juggling, dashes, and frequent target switching allow for you to take down foes of any size while wall-jumping and platforming can help you outmaneuver your enemies.  </li>\n<li>FIGHT FOR YOUR LIFE: Conquer mini-bosses, set pieces, and climactic 1-on-1 encounters that offer intense challenges against unforgettable villains.  </li>\n<li>STRENGTH IS NOTHING WITHOUT CONTROL: Use the Training Room to hone precise and powerful moves to string together devastating attack sequences.  </li>\n<li>BATTLE TO THE BEAT: A 90s-inspired soundtrack features heavy Drum’n’Bass and funky industrial music that adds to the thrill of combat.  </li>\n<li>FEAST YOUR EYES: A unique visual aesthetic combines nostalgic 2D sprites with an advanced lighting system and stylized 3D environments.  </li>\n</ul>\n<p>Contains animated depictions of violent and gory content that may not be appropriate for all audiences.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2024-02-23T09:04:43", "background_image": "https://media.rawg.io/media/screenshots/7a0/7a0fd45a148e69e2bd7dbcc90631a73f.jpg", "website": "https://ziggurat.games/game/slave-zero-x", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 528, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": ["Poppy Works"], "genres": ["Action", "Arcade"], "publishers": ["Ziggurat", "Ziggurat Interactive"], "esrb_rating": null}