{"id": 807102, "slug": "autobahn-police-simulator-3", "name": "Autobahn Police Simulator 3", "name_original": "Autobahn Police Simulator 3", "description": "You are a rookie police officer and it’s your first day back at the station after a car accident involving an illegal car race left you out of commission for quite some time. <br/>But now you are back in uniform and ready for duty, so there is no time to waste while sitting behind a desk. You and your partner get right behind the steering wheel of the police car to get you back up on the basics of police work, eager to prove yourself to the police station and to your experienced partner. <br/><br/><br/><br/>Keep moving up the ranks and you will unlock even more demanding missions, new skills to further your growth as a good police officer as well as new equipment and vehicles such as the civil car for undercover missions.<br/><br/><ul><li> Features different types of police cars for a variety of operations<br/></li><li> Various mission types offering more diverse gameplay experiences <br/></li><li> Freely explorable map including bigger and smaller citiscapes, industrial sites, highways as well as country roads <br/></li><li> Improved progression system and tech tree<br/></li><li> Dynamic traffic system<br/></li><li> Authentic driving experience of german autobahns</li></ul><br/><br/><br/>Take on a variety of operations and unique missions to establish security on the streets.<br/><br/><ul><li> Accidents<br/></li><li> Traffic checks<br/></li><li> Car chases <br/></li><li> Street-Cleaning<br/></li><li> Police blockade</li></ul><br/><br/><br/>Whether you are patrolling the autobahn or while taking in the sights of cities, industrial sites, mountains and sea, there is always a need for an officer. <br/><br/>Autobahn Police Simulator 3 includes a diversity of open world features and places to explore offering a long-term varied gameplay experience that goes beyond a mere simulation. <br/><br/>Are you up for the task and responsibility? <br/>Keep the autobahn safe and become a capable police officer.<br/><br/>", "metacritic": null, "released": "2022-06-22", "tba": false, "updated": "2022-06-24T06:46:46", "background_image": "https://media.rawg.io/media/screenshots/67c/67ce49fc584f7c2a4162dc2493f4f87a.jpg", "website": "http://www.autobahn-police.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "toplay": 2}, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Z-Software"], "genres": ["Action", "Simulation", "Casual"], "publishers": ["Aerosoft"], "esrb_rating": null}