{"id": 807177, "slug": "cooking-master-adventure", "name": "Cooking Master Adventure", "name_original": "Cooking Master Adventure", "description": "Are you good at time management? Can you beat the clock and become a top master chef? Build the cooking city from start-up restaurants, cook and serve delicious foods from all over the world in this fast-paced addictive cooking game. Cooking Master Adventure will definitely bring you enjoyable cooking game experiences like never before.<br/>Dive yourself into a real cooking craze, play as a chef like you have a cooking fever. find the secret cooking diary and unlock all the culinary skills. Very simple to play, and with well organized kitchen layouts, you can make any food in a dash without remembering the recipes. <br/><br/>Features:<br/>• COOK hundreds of delicious recipes from around the world!<br/>• OPEN dozens of restaurants and cafés in the cooking city and decorate them to your taste!<br/>• COMPLETE the daily quests with lots of rewards!<br/>• WIN the weekly challenges with rich prizes!<br/>• INTERACT with the customers in the restaurant and immerse yourself in an exciting story!<br/>• PLAY on multiple devices freely once logged in with Apple ID or Facebook.<br/><br/>More levels are coming, and more exciting features are being added to the game. Please stay tuned to us.<br/>Facebook: https://www.facebook.com/cooking.master.adventure<br/>Email: cookingmasteradventure@gmail.com", "metacritic": null, "released": "2022-06-22", "tba": false, "updated": "2022-06-24T08:13:15", "background_image": "https://media.rawg.io/media/screenshots/358/358a7b13224e0442c24b154e533fbfb8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZHANG HUIMEI"], "genres": ["RPG", "Simulation"], "publishers": ["ZHANG HUIMEI"], "esrb_rating": "Everyone 10+"}