{"id": 80733, "slug": "tripeaks-solitaire", "name": "TriPeaks Solitaire ●", "name_original": "TriPeaks Solitaire ●", "description": "TriPeaks Solitaire Rules<br/><br/>Setup<br/><br/>The game board in Tri Peaks Solitaire is made up of:<br/>•\tThree Peaks: There are three peaks (pyramids), each one is 4 cards high. The peaks share the lowest level. The cards at the bottom are face up, the higher ones are face down.<br/>•\tThe Stock: The facedown pile on the bottom left. It is used to draw cards from and put on the Waste.<br/>•\tThe Waste: The faceup pile next to the Stock. It's empty in the beginning.<br/><br/>Gameplay<br/><br/>The objective of the game is is to move all cards from the three Peaks onto the Waste. You can only move open cards to the Waste, a card is considered open if there are no other cards covering it. At the beginning the whole bottom row is open. Once you move cards from the Peaks you open up other cards that you can then flip over and are then open to move to the Waste as well.<br/><br/>You can move a card onto the Waste if it ranks one higher, or one lower than the topmost card on the waste. E.g. if there's a 6 on the Waste you can move a 5 or a 7 there. Initially the Waste is empty and you can move any card there. You are allowed to \"turn the corner\", i.e. go K A 2 A K, you can put an Ace on a 2 or a King.<br/><br/>If you have no cards in the Peaks that can be moved to the Waste then you can get a card from the Stock and turn it over to the Waste. You can only go one time through the Stock, there are no resets allowed, so don't use the Stock unless you definitely can't move any cards from the Peaks.<br/><br/>Winning<br/><br/>You win the game by moving all cards from all three Peaks to the Waste. The cards left in the Stock when you finish does not matter.<br/><br/>Losing<br/><br/>When you can't move any cards from the Peaks and you have no more cards left in the Stock then you have lost the game. The game will notify you about this, but you are free to use the Undo button to try to figure out some other solution.<br/><br/>Scoring<br/><br/>The score is based on the number of cards left at the end. You win by having no cards left. The game also counts the moves you make to win, so a win with fewer moves is considered better. The game tracks the best results for each of the 50.000 numbered games, and you will be notified if you are the first to win a game, if you break a record, or if you have the best result for a particular game, even if you don't finish it.<br/><br/>Winnable %<br/><br/>According to Wikipedia the game was invented by Robert Hogue in 1989. He performed computer statistical analysis on the original game, which showed that over 90% of all dealt games are solvable.", "metacritic": null, "released": "2017-03-18", "tba": false, "updated": "2019-07-30T08:07:46", "background_image": "https://media.rawg.io/media/screenshots/bb6/bb6144665bfb15614364e82d02e7b2cf_9o45np7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jose Varela"], "genres": ["Board Games", "Card"], "publishers": ["Jose Varela"], "esrb_rating": null}