{"id": 807318, "slug": "joint-fantasies-and-digital-intimacy", "name": "joint fantasies and digital intimacy", "name_original": "joint fantasies and digital intimacy", "description": "Must be played on Chrome or Firefox.<p><strong><em>Joint Fantasy.</em></strong>\n</p>\n<p>Being that I’m very far away from you, we can be here together instead. Here, we’ll make a story together, I’ll create associated memories and we can piece together our deeper emotional fantasies.\r\n</p>\n<p>It’s true that everything we do here is symbolic, our behaviours are fixed according to a predefined set of rules and animations. However, despite our expressions being more confined, they still function as extensions of ourselves within this world. There’s a lot of opportunities for rich expression within these rules1.\r\n</p>\n<p> \r\n</p>\n<p>Here, you can hold my hand if you like?\r\n</p>\n<p>I promise, these actions are no less real, they signify an intent and a willingness. Is it not true that as you hold your hand over mine, although we are not touching and the same feeling is not present, the action still comes in response to communication, and is communicating something? This action is by no means meaningless, by virtue of this fact.  My want to create these means of communication are even more significant than a simple handshake or a physical playdate2. \r\n</p>\n<p>Would you say you’d rather be shown as something other than us? Would you be interested in occupying a different role? \r\n</p>\n<p>What would you rather be? A spaceman or a martian?\r\n</p>\n<p>These avatars aren’t a good representation of ourselves, and maybe if they were it would feel like our relationship was more robust. But even though these characters are different from ourselves, they function instead as symbols of us within this relationship and have become embodiments of our connection within this world. This space offers us a platform to express ourselves within this relationship in any way we see fit3. I could be a lady, or a cat, and you could like it when I’m a cat.\r\n</p>\n<p>Do you want to come to my house? Look, I’ll show you where I live, so you can imagine it as though you’re there in the real world. If you ever come here in the real world, it’ll be just like the game.\r\n</p>\n<p>Imagine if we lived here together, maybe we’d have a cat. I like to fantasise with you, and it’s all we can do here. Here I’ll show you the garden, and we can explore together.\r\n</p>\n<p><strong><em>Digital Intimacy.</em></strong>\n</p>\n<p>Mole’s behaviour within this virtual world takes form in his various avatars, predicated on various aspects of his personality, and interacting with joint fantasies that he has with others. In his mind, there are as many genders as individuals. There are not one or two sexes, but many4. He has a few different avatars which he can play around with.\r\n</p>\n<p>A lot of his friends around here talk about these personalities as \"creations\", but to Mole, that seems wrong because it implies that it’s something like an invention. He hasn’t made this mask to hide his identity, but instead to pick and choose which parts to explore and accentuate5.\r\n</p>\n<p>When Mole first decided to invest some time into this virtual world, he changed his appearance almost every time he logged in. He enjoyed choosing different hairstyles, and matching his clothes with the colour of his hair. He found a more permanent form when he met his virtual partner as he was passing the time in a beach community he spent time with often.\r\n</p>\n<p>On that day, Mole had chosen the form of a woman, and realised after a while that his avatar had the hots for an animal avatar. It wasn’t him, but he was playing the part, and this fitted6.\r\n</p>\n<p>He discovered quickly that they got on very well. This rat was the perfect match for Mole, personality wise, and it was so romantic having long conversations about who they were and how they fitted into the world. Once, they met IRL too, and after discovering that they were not attracted to each other, decided to carry on with the relationship anyhow and not meet in the real world7.\r\n</p>\n<p>Now, Mole had virtual sexual relations before; he would often log in on two separate avatars and fiddle around with them for a while. But it was so far removed from touch and the warmth of body and breath that, to him, it didn’t do much. It was only when Mole and his new partner, Ratty, had sex that he felt such a shock and thrill that transcended his previously lacklustre experience. As he chose different buttons on the animation ball, he felt as though his avatar and my real self had become one, and it gave rise to something so real8. Of course, it was these emotions that coloured the experience and shaped its meaning, creating something just as important as the physical.\r\n</p>\n<p>Something about this experience was liminal to Mole, and in reaction he settled down in the form of a rodent. He was put off by the dispositions others seemed to have towards traditional gender archetypes and wanted to separate himself from it all. His partner began to talk about their experiences with playing an animal avatar, and he decided to create one of his own and has stuck to this ever since. Mole started with hybrid animals, but eventually settled down as a rodent. Probably for a number of reasons, but mainly because Ratty and his friends knew him as such.\r\n</p>\n<p>The initial thrill and spontaneity of virtual sex was quickly overshadowed by the purely symbolic and animated nature of the act9. Mole began to explore all the various facets of this virtual world he was part of. BDSM rooms and strip clubs were amongst his favourite haunts, which was strange in a way, as he would never choose to do these things in the real world. He’s quite shy, you see, and not really that interested anyway. Mole even found a place in the community giving advice to newcomers. He’s very friendly and encouraging when he takes the forms of his many avatars.\r\n</p>\n<p>Of course, he has a number of identities for all of these various pastimes, etiquette demands he keeps things separate. These identities are constantly changing. Mole doesn’t view these as symbolic representations of a fixed role, but instead as different facets of himself, which are undergoing constant and fluid change in response to all the various interactions he has in his virtual home. It has become an outlet for a truer self, with equally valid identities, that in certain situations seem even more authentic than Mole’s real world counterpart.\r\n</p>\n<p><strong><em>Pop quiz.</em></strong>\n</p>\n<p>Want to know where you fit in? Take this quiz to find out! Enter \"Yes\" to begin.\r\n</p>\n<p>You are suited to occupy a quite haven, for your nature is a modest, shy and dreamy one.\r\n</p>\n<p>You have found comfort in digital realities since you were young, and you enjoy playing a role different to yourself.\r\n</p>\n<p>You often play with your gender representation but you buy cheap makeup which runs often.\r\n</p>\n<p>You meet someone in The Republic of Jadida Mandrago. So beautiful; a faery, their hair was long and they were small.\r\n</p>\n<p>Voice messages from the person are asking what you are, you don't have an answer.\r\n</p>\n<p>You begin to explore the forests around the area with your new companion. You are thinking of them and feel joy and you want to hug them.\r\n</p>\n<p>Because you are a virtual representation of yourself, you feel more attached to this avatar. You are untethered from your traditional bonds and feel you can act more truly on your thoughts and feelings. \r\n</p>\n<p>Your companion explains that they have an animation ball, and that they would enjoy an embrace.\r\n</p>\n\n<p>1. Jacques Lacan divided the psyche into three major structures that control our motivations: </p>\n<p>1. The Real,</p>\n<p> 2. The Imaginary, </p>\n<p>3. The Symbolic. </p>\n<p>Lacan uses these concepts to theorise on psycho-sexual development, but modern theorists such as Wardle have very loosely used these structures to define how operators relate to their virtual avatars (Lacan, J. 1977).\r\nWardle’s version of the symbolic, referenced here, is defined as this:\r\nSymbolic avatars are defined as behaving in accordance with a pre-defined role, and as a part of a fixed imposed narrative, e.g., pre-defined gaming avatar or class, or avatar designed to perform a specific task. The avatar is often viewed by the operator as a proxy or extension of the operator to allow access to the virtual environment. (Wardle, 2018, page 2.) </p>\n\n<p>2. Wardle is disparaging of the symbolic in his wording, infering it to be the most common and shallow of the three. Being that Wardle is writing only about stranger encounters, he fails to take into account how these symbolic actions can be quite poignant. A scripted action can be meaningful in that, although it is symbolic, it has effort and emotional intention behind it, emotions which can mould a digital experience into something very real.\r\nWardle does touch on this slightly when describing the transition between the imaginary and the real, the two other categorisations of the virtual psyche, but describes it as such a momentous and dramatic happening and only in relation to virtual sex. It doesn't describe the significance of smaller symbolic actions, such as digitally holding another's hand. </p>\n\n<p>3.  In his paper “Virtual Parent-Child Relationships”, Downing describes how he often discourages his son to create fantastical avatars. Downing wants the avatars to represent themselves as much as possible, so as to make their feeling of connection more robust.\r\nBut virtual avatars, especially in role-playing spaces such as Second Life, can quickly become and embodiment of something just as significant as reality. Specific aspects of the operators real self can be extenuated and explored, and because of this, in virtual relationships the avatar becomes an embodiment of this person specifically within this relationship; the self they wish to put forward to the other is no less real, and sometimes can be a truer representation of the self than real life. (Wardle, 2018). </p>\n\n<p>4. In Monique Wittig's essay, \"Paradigm\", she states that \"For us there are, it seems, not one nor two sexes but many, as many sexes as there are individuals.\" (Wittig, 1979). This is referenced when discussing virtual worlds to describe the empowerment to completely reconstruct oneself and ones sexuality when playing through an avatar. </p>\n\n<p>5. Terms along the lines of \"constructions\" or \"creations\" are often used when referring to how these personae come to be. This language infers that these avatars are complete fabrications, inventions not rooted in the reality of the operator. This is not the case, as demonstrated by interviews with regular operators in role-playing games such as second life. Wardle described one interviewee as such:\r\nSecond Life was an outlet for her true expression of self, an expression not of her actual world self but of a different, yet equally valid identity, that she believed to be more authentic. (Wardle, 2018, page 10.)</p>\n\n<p> 6. Second Life players often choose to play roles which are very different from their reality. For instance, a player might choose to play a lesbian female, despite identifying as a cis-gendered, heterosexual, male in reality, and having no interest in diverging from this. The players often talk about playing a part, doing what they think their characters would do. \r\nBoellstorff  gives various examples of Second Life residents functioning this way, and describes one man who chooses to play as a female saying, \"I realised my avatar had the hots for a lesbian girl’s avatar. I mean it, it wasn’t me, I just realised it fitted the part\" (Boellstorff, 2008). </p>\n\n<p>7. Torley Torgeson is a well known Second Life resident who was interviewed about their relationship with another female avatar. They describe a situation very similar to this, in which both avatars meet in real life but after finding out that they're both men, decide to proceed with the online relationship but not meet in real life (Tim Guest, 2008).\r\nThis, and Boellstorff's interviews, demonstrate further the apparent dichotomy between the unrelated nature of avatar and operator identities, and the idea of the avatar as an extension of the operators personality (Wardle, 2018).\r\nIt's reasonable here to admit that there are many ways in which an avatar relates to it's operator, and that whilst some might enjoy playing out a part which is very different from their reality, others might see their avatar not so much as a character, but instead as a conduit for their own identity. This would therefore solve this conundrum.\r\nIt could also be assumed that when Torley Torgeson plays as a gay, female avatar, they are not playing a character but instead is acting on their own desires as a person and thereby not playing a part. However, this would require more research to conclude, and is not how Torley Torgeson himself describes their feelings on the matter. </p>\n\n<p>8. Wardle again makes reference to the Lacanian categorisations of the psyche when he describes virtual sex, and how it can illicit a spontaneous switch between the imaginary avatar and something which becomes \"the real\".\r\nThe real is described as such:\r\nReal avatars demonstrate a complex mutually interactive relationship between operator and avatar, based neither on function nor on an aspect of operators identity, leading to the emergence of an autonomous symbiotic unit which inhabits-informs-compensates- transcends both. Their interactions with other avatars exhibit the potential for spontaneous independent expression of self within the confines of the virtual environment. (Wardle, 2018: Avatar Sex, page 2).\r\nEven though virtual sexual relations do not have the typical sensory stimulus, Wardle theorises that this transition is what thrills and compels operators to a degree which is enjoyable. </p>\n\n<p>9. Wardle's interviewees described that upon trying to recreate a sexual experience, it felt as though it was a bad copy of what came before, with none of the thrill that accompanied the initial experience. This further supports the argument that the thrill stems from a transition into the real, when the imaginary avatar makes way for spontaneous expression of self (Wardle, 2018).<br/></p>", "metacritic": null, "released": "2022-06-23", "tba": false, "updated": "2022-06-24T09:24:59", "background_image": "https://media.rawg.io/media/screenshots/b8c/b8caa5e39574cc5b8dd1d7d44dc5d51a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Wilhelm Dies"], "genres": [], "publishers": [], "esrb_rating": null}