{"id": 80739, "slug": "pool-break-lite-3d-billiards-8-ball-snooker-carrom", "name": "Pool Break Lite 3D Billiards 8 Ball Snooker Carrom", "name_original": "Pool Break Lite 3D Billiards 8 Ball Snooker Carrom", "description": "Pool Break Lite is a free suite of games featuring several variations of 3D Pool, Billiards, Snooker, and the popular Crokinole and Carrom board games. The 3D graphics are spectacular and the physics are realistic and accurate. Whether you play against the computer or against other players online, the action is smooth and fast paced!<br/><br/>Ready for some realistic pool experience? With a ton of games and lots of fast paced action, Pool Break will keep the most seasoned pro playing well into the night. Its crisp 3D graphics, accurate physics and linear shot guides help you line up your shot, modify the shooting angle, and see where your shot is going to land, making it easy to position yourself up for your next move.<br/><br/>Pool Break Lite Features Include:<br/>• Almost two dozen games packed into one app<br/>• Universal iPhone, iPod Touch and iPad app <br/>• Multiple Languages Supported<br/>• English, French, German, Italian, Russian, Dutch, Polish, Spanish<br/>• Portuguese (Brazil), Japanese, Korean (South), Chinese (Simplified)<br/>• Supports Online Cross-Platform Multiplayer Gaming<br/>• Supports online chat<br/>• Play against the computer with four difficulty levels<br/>• Pass-n-Play mode<br/>• Very Realistic Pool Physics<br/>• Pan and Zoom and Slow Motion modes<br/>• Swipe-to-Shoot mode<br/>• Free View and First Person View<br/>• Regular, Circular or Hexagonal billiard tables<br/>• Allows Curve and Masse shots and full English<br/>• Intuitive User Interface<br/>• Many different sceneries<br/>• Multiple fancy ball and cue stick designs (textures)<br/>• Portrait and Landscape modes<br/>• Built-in Help Manuals explain how to play<br/>• Recent Games option for single-click start<br/>• Hours of fun<br/><br/>If you've ever thought about playing pool on a real table, Pool Break is the perfect way to try a variety of games and pick your favorite. Use Pool Break as a recreational game, or use its dead-on, real life rendering and geometry to help improve your skills for league night. With place-and-shoot and pool drill games, this is the perfect app for tweaking your game, and practicing those tricky shots that require nerves of steel. <br/><br/>So what do you get with this app? Over a dozen Pool, Billiard and Snooker games, as well as two popular board games Carrom and Crokinole that are played with discs. In other words - enough cue-games to keep you busy for a long time.<br/><br/>Pool Break Lite Games Include:<br/>• US 8-Ball Pool<br/>• UK 8-Ball Pool<br/>• 9-Ball Pool<br/>• 10-Ball Pool<br/>• 6-Ball Pool<br/>• 3-Ball Billiard<br/>• 7-Ball Pool<br/>• Rotation Pool<br/>• 4-Ball Billiards<br/>• One Pocket Pool<br/>• Straight or 14.1 Continuous Pool<br/>• 3-cushion Billiards<br/>• 1-cushion Billiards<br/>• Karambol<br/>• Pool Drills<br/>• Place-n-Shoot Pool and Snooker<br/>• Snooker (15, 6 or 10 Reds)<br/>• Carrom (three board styles)<br/>• Crokinole board game<br/><br/>Feeling competitive? Choose head to head action with the pass-n-play feature, even more intense competition against the computer, or go online for some cross-platform action with other players. With 4 different difficulty levels to choose from, you'll go from a novice to a seasoned professional in no time. Don't get Snookered! Download Pool Break Lite now rack up some serious fun! It's your break!", "metacritic": null, "released": "2011-03-09", "tba": false, "updated": "2019-10-22T14:23:09", "background_image": "https://media.rawg.io/media/screenshots/971/9715882418d4a2430b42cb5d37035d66.jpg", "website": "http://kineticbytes.com/main/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kinetic Bytes"], "genres": ["Simulation", "Sports"], "publishers": ["Udayan Kale"], "esrb_rating": null}