{"id": 807434, "slug": "super-shooter-itch-bydan", "name": "Super Shooter (itch) (byDan)", "name_original": "Super Shooter (itch) (byDan)", "description": "<p>Super Shooter is an all-new FPS game where players use an experimental tool to activate unique stage elements, solve puzzles, and propel themselves through the air (\"rocket jumping\"). In other words, it's a game where you solve all your problems by shooting at them!</p>\n<p><strong>Beware, this games require precise aiming and fast reflexes!</strong><br/></p>\n\n<p>In her first day as a low level technician Employee 004 meets “N.Gineer”, a shady disembodied voice that sends her to fix a problem with one of the main reactors of the station.<br/><br/>The day quickly goes south when Employee 004 causes an explosion that endangers the world, her life and her new job.<br/>Now it’s up to employee 004 to get to the center of the station to fix the problem that herself caused, for that task, N.Gineer, leads Employee 004 to the “Power Arm”<br/><br/>With the PowerArm you can activate electric panels that power all the elements in the station, allowing you to open doors, turn off security measures, or use the station elements to your advantage.</p>\n<p>The main advantage of the power arm is that shooting it will literally launch you back with the gun recoil, this can be used to jump really high, allowing you to reach high places and far corners.<br/></p>\n<p>Could Employee 004 reach the center of the station on time?.</p>", "metacritic": null, "released": "2022-06-18", "tba": false, "updated": "2022-06-24T10:17:03", "background_image": "https://media.rawg.io/media/screenshots/b50/b5078c5daacfe4b6767275b423e65102.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["byDan"], "genres": ["Shooter", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}