{"id": 807424, "slug": "rich-mindset", "name": "Rich Mindset", "name_original": "Rich Mindset", "description": "<p>\"Wealth is a measure of a person's ability to survive so many days forward\" - R. Buckminster Fuller<br/></p>\n\n<p>Rich thinking demands your attention! Are you ready to fight the ignorance that limits our lives?</p>\n<p>Do you like text-based retro games? Are you ready to embark on an Mindset adventure?  Then say no more, hit that download button and try your luck!<br/></p>\n\n<p><strong>FEATURES</strong></p>\n<p>- TURN-BASED PLAYSTYLE  with a first given job and life condition. You have to explore the posibilities of escaping the poor mindset to move forward faster and find the points of interest for yourself. Try to make it in as little turns as possible.</p>\n<p>- FINANCIAL STATEMENT as an indicator of how are You doing. Displayed all the time along the way to show all You need. It is the piece of paper that shows how good You are doing with managing Your finances</p>\n<p>- STOCKS, REAL-ESTATE as a trade opertunities lets You move forward in Your journey faster!</p>\n<p>- PAYMENTS, the spontneous ones, we all make them. As a way to make the game more various on expenses.</p>\n<p>- ... AND MORE COMMING!</p>\n\n<p>Are you ready to learn more about finance and live like a wealthy?<br/>Or will you let it stay in perish forever?<br/></p>\n<p>\"It's unbealivible how much you don't know about the game you've been playing all your life\" - Mickey Mantle</p>\n\n<p><strong>SYSTEM REQUIREMENTS</strong></p>\n<p>The game is compatible with MacOS and Windows.<br/>I haven't tested Windows versions but they should run the game as well.<br/>The game needs no extra setups, you can run it directly by opening the .app/.exe file.<br/></p>", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-06-24T10:12:56", "background_image": "https://media.rawg.io/media/screenshots/241/2417c6635b16fe591ccf74a4692e8a42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Jacob"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}