{"id": 807455, "slug": "gaikokujin-no-sensei-foreigner-teacher-visual-no-2", "name": "Gaikokujin No Sensei (Foreigner Teacher) Visual Novel (Coffee Bunny Games)", "name_original": "Gaikokujin No Sensei (Foreigner Teacher) Visual Novel (Coffee Bunny Games)", "description": "<p>The Main character is a man in his mid-30's. Got fired recently, has  no money, no girlfriend, no prospects. That is until he comes across a  woman looking for people to work abroad in Japan. The only problem? He  doesn't know a single thing about Japan, whether it be the culture or  the language.\r\n </p>\n<p>Still, with all other options gone, he finds himself taking the job  and ends up on the other side of the world with no idea what he's doing.  To make matters worse, Shortly after arriving, he comes across two  eccentric spirits with which he's now stuck for the next year. \r\n </p>\n<p>There's one thing he can say for certain, this year certainly isn't going to be boring. <br/></p>\n<p>This is a fully voice acted (except for MC) romance visual novel with multiple routes/endings.<br/></p>\n<p>Game is Rated M for Mature.</p>\n<p>Has an option for 18+ . This unlocks topless fanservice CG's. (All women aged 25+ years) There is no sexual content in this game but there is innuendo. <br/></p>\n<p>- 200k+ words \r\n </p>\n<p>- 40+ beautiful CG's\r\n </p>\n<p>- 4+ romance routes each with their own ending\r\n </p>\n<p>- FULLY VOICE ACTED. No stretch goals, no \"partial\" voice acting,  this game is fully voiced from the word \"Go\" (The only exception being  the protagonist who is silent for that immersive feel)\r\n </p>\n<p>- Original soundtrack\r\n </p>\n<p>- Nameable Protagonist\r\n</p>", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-06-24T10:28:00", "background_image": "https://media.rawg.io/media/screenshots/cc8/cc8dbdc0e0e8ca30d3425907de2a9478.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Coffee Bunny Games"], "genres": [], "publishers": [], "esrb_rating": null}