{"id": 807426, "slug": "reverie-of-strange-blood", "name": "Reverie of Strange Blood", "name_original": "Reverie of Strange Blood", "description": "<p>Version: 1.5beta<br/></p>\n\n<p><strong>Reverie of Strange Blood</strong> is a story-based, slow-paced, dialogue-driven metroidvania platformer. It was born out of a single question: Can you have a metroidvania game where the \"locks\" and \"keys\" aren't physical locks in the game world, like a blocked door or impassable terrain, but instead <em>information</em> locks? This game blurs the line between traditional RPG and metroidvanias, featuring the heavy emphasis on exploration and self-discovery native to the latter while retaining the mostly-linear (but still flexible) story aspects of RPGs. And did I mention that it should be fully playable on a Game Boy Advance or an Analogue Pocket?</p>\n<p><strong>In this beta version of the game (1.5b), only the first two chapters are playable. </strong>This is 1/3 the size of the planned game in terms of content, but in terms of worldspace it's much more than that--around 2/3 of the game's individual zones have been completed, meaning there's a lot to explore and uncover.</p>\n<p>You are <strong>Rash'esh</strong>, a member of the bastesh: a race of cat-like hominids who inhabit a land that resembles both Ancient Egypt as well as any number of alien worlds. It is Tawj, the Land of the Eternal Sunset, and you have come to the port city of Taremu to find your missing sister. Explore the city to learn more about the land, the history, the people, and the culture. Along the way you will meet characters from two other races, the airborne Herash and the underground Khepresh.</p>\n<p>This game is somewhat of a spiritual successor to my first serious game jam submission: Pixel Mural RPG 2b2t, as both are GameBoy games made with GB Studio, feature music from Taylor Kirkwood (link below!), and feature an Ancienct Egyptian aesthetic. Though I should say that they are not actually related in any way--the worlds they take place in are completely different, with absolutely no overlap.</p>\n<p>This game was made in 1 month for the Metroidvania Month 16 game jam with help from two amazing musicians:</p>\n<ul><li>Lilia Burtonpatel</li><li>Taylor Kirkwood</li></ul>\n<p>All art, level design, programming, and writing by me, Cormorant42.</p>\n<p><strong>Work on this game is continuing, and will most likely eventually result in a commercial release (depending, of course, on game jam feedback).</strong></p>\n<p><strong>CONTROLS:</strong><br/></p>\n<ul><li>Arrow keys - move (use UP to interact with the world when prompted)</li><li>Z - Jump/Interact with NPCs/Confirm in message boxes</li><li>X - Cancel</li><li>Shift - \"Select\" button (not used)</li><li>Enter - \"Start\" button (not used)</li></ul>\n<p><strong>Potential Future Features:</strong></p>\n<ul><li>Full world map, all chapters accessible</li><li>Sprite redesign for less screen tearing</li><li>Custom sprites and faces for unique characters</li><li>Message box with name for easier recognizability</li><li>SFX</li></ul>\n<p><strong>Known Bugs:</strong>\n</p>\n<ul><li>Going into the casino a second time may crash your game.</li><li>Some of the columns in Victory Park load in the wrong positions. That's the best I can do at this point, sorry.</li><li>Button mashing while on stairs can result in permanent stairface.</li><li>There's a bug of unknown origin where you can enter, but not exit, the red light district</li></ul>", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-06-24T10:14:00", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b28d21923cdab21a18060b1510f09de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cormorant42"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}