{"id": 80745, "slug": "fortress-under-siege", "name": "Fortress Under Siege", "name_original": "Fortress Under Siege", "description": "A conspiracy throws our kingdom into the most dangerous moment, which needs you and your army to shoulder the responsibility of safeguarding the kingdom. The powerful enemy already launches the attack, which leaves you no choice as you are the last hope of the kingdom. <br/>The particular fortress construction mode allows you to build the unique fortress of your own, which will bring you a strong sense of proud especially when seeing tens of thousands of enemies fall in front of your elaborate fortress. Feel free to build walls and fortresses, set up gatehouses, pits, barriers and towers and paint pitch on the ground to launch fire attack against your enemy. You can also build all kinds of buildings to boost your soldier's battle efficiency. The establishment of magic towers enables you to use magic. Arrow towers and round towers of different scale help you to form solid defensive line. <br/>You can also have your archers shoot enemies on the wall… <br/>With 22 types of military units and numerous styles of bosses, the game will impress you with rich and skillful playing methods, for example, upgrading your soldiers' level or building function all make your defensive line more strong. Weather your fortress can survive the surrounded enemies? <br/>With the vast battlefield and splendid background music, you are sure to throw yourself into this war in the Middle Ages. <br/><br/>Story Mode: <br/>10 epic campaigns with 50 levels <br/>Glory Mode: <br/>Hold fast to your fortress and stand firm against your enemy for 20 days. <br/><br/>Features: <br/>- 22 types of units <br/>- Various Bosses <br/>- 47 map types <br/>- Superior AI <br/>- Unit upgrade mode <br/>- Building upgrade mode <br/>- Magnificent background music <br/>- Auto save <br/>... <br/><br/>Thanks for your support. EASYTECH 2011 <br/>www.ieasytech.com", "metacritic": null, "released": "2011-10-13", "tba": false, "updated": "2019-07-30T08:49:55", "background_image": "https://media.rawg.io/media/screenshots/cd0/cd0f82b0f9ef2436b174a36f6281d2c8.jpg", "website": "http://www.ieasytech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 372, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android", "iOS"], "developers": ["EasyTech", "EASY"], "genres": ["Strategy", "Simulation"], "publishers": ["zhang yue"], "esrb_rating": null}