{"id": 807575, "slug": "battle-frag-arena", "name": "Battle Frag Arena", "name_original": "Battle Frag Arena", "description": "<p>This is a 6-month (on and off - a couple hours a week) prototype  meant to re-learn Unreal Engine (UE5) Game development. It is a fast  paced First Person Shooter with some nods and details from FPSs i played  through my life.\r\n</p>\n<p>It has bugs but it should provide a fun time to play with friends. It uses Steam Sessions for Multiplayer   so you will need to be logged on to Steam for it to connect to servers.  The game will show on your friends list as Spacewar since that is the  default testing app number the plugin provides.\r\n</p>\n<p>You can  leverage a directional dodge by pressing shift+direction keys and a  grappling hook (on specific objects) to escape tough situations (use Q key).\r\n <br/></p>\n<p>There are 6 weapons: <br/></p>\n<p>Assault Rifle - AR Model from UE Sci-Fi Weapons Dark. Standard projectile based AR.\r\nPlasma  Gun - Will update model origin when i find it. <br/></p>\n<p>Plasma Gun based off Q3.  Main fire fires standard plasma projectiles. Alt fire launches bouncing  balls of energy. <br/></p>\n<p>Grenade Launcher  - GL Model from UE Sci-Fi Weapons Dark. Main fire fires a timed grenade. Alt fire fires a on-hit grenade. <br/></p>\n<p>Flak Cannon - Model by Byron Nava (https://sketchfab.com/3d-models/flak-cannon-22e90512353049509523531913cc1e20).  Main fire fires hot-metal shards on a spreadshot pattern. Alt fire  launches a projectile that when blown up scatters shards. Based off the  UT99's Flak Cannon. <br/></p>\n<p>Rocket Launcher - Model by re1monsen (https://sketchfab.com/3d-models/rocket-launcher-dusk-2b108c10da2d4fa2a2854993d76..). Main fire launches a 110-damage rocket with a small blast radius. Alt fire launches a 70-damage rocket with a larger radius. <br/></p>\n<p>Rail Rifle - Sniper Model from UE Sci-Fi Weapons Dark. Fires a hyper speed projectile that deals 90-damage. <br/></p>\n<p>Some FX are from the Sci-Fi Weapons Dark pack and some are created by me using Niagara.<br/>There are 2 maps:\r\nKillbox - Fully textured - Small, quick to the point.\r\nIndustrial - Not textured - Large, good for longer battles.\r\nI  do not know if I will improve the project later on. Hopefully I will  still texture the Industrial map and put per-weapon animations. <br/></p>\n<p>Other  than that, it will depend.\r\nHope you like it! <br/></p>\n<p>Enjoy</p>", "metacritic": null, "released": "2022-06-23", "tba": false, "updated": "2022-06-24T11:22:42", "background_image": "https://media.rawg.io/media/screenshots/0d3/0d3d6969af3836da00618e22662952ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hellgardia"], "genres": ["Action"], "publishers": [], "esrb_rating": null}