{"id": 807530, "slug": "yet-another-space-invaders-clone-yasic-vic20-16k", "name": "Yet Another Space Invaders Clone (Y.A.S.I.C.) - Vic20 +16k", "name_original": "Yet Another Space Invaders Clone (Y.A.S.I.C.) - Vic20 +16k", "description": "<p>Title: Yet Another Space Invaders Clone (YASIC)<br/>Platform: 16k Expanded Commodore VIC-20<br/>Video: PAL/NTSC<br/>Interface: Joystick only<br/>Game type: Arcade<br/>Written by: W E de Villiers<br/></p>\n<p>We're not being invaded, we're the invaders! Yep its come to that. In the far distant future humankind finally discovers that we are not the only sentient beings in this vast universe. Because we are self-absorbed and paranoid about this sort of thing we decide to neutralize our galactic neighbours before they can get any funny ideas. There are eight inhabited moons and planets within the Alien solar system, and we have to conquer them all. That's where you come in: The best and the brightest sent to defeat our self-imposed enemy. All hail the Terran Galactic Empire and the Terran Expeditionary Force!</p>\n<p>Tip: Keep your finger on the trigger, it's autofire.</p>\n<p>Extra ships: There are none. If you can't complete the task at hand with the equipment at your disposal, maybe you would be more suited to a communications relay post on the far flung planetoid Pluto. I understand its quite balmy there (minus 200 Kelvin on a summers day) and the work is as exciting as watching mould grow.</p>\n<p>Greetings</p>\n<p>Huffelduff (User handle on the VIC-20 Denial forum)</p>", "metacritic": null, "released": "2022-06-23", "tba": false, "updated": "2022-06-24T11:03:47", "background_image": "https://media.rawg.io/media/screenshots/1d2/1d24688c88742e8ece8e758523f27018.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["huffelduff"], "genres": ["Action"], "publishers": [], "esrb_rating": null}