{"id": 807714, "slug": "suzerain-itch", "name": "Suzerain (itch)", "name_original": "Suzerain (itch)", "description": "<p>An open world role playing game with turn-based tactical combat.</p>\n<p><strong>Combat</strong><br/>Combat is the heart of Suzerain. You'll face enemies ranging from lightly armed brigands to huge wild creatures. Your four characters will need to choose their weapons carefully and master powerful spells.</p>\n<p><strong>Spells<br/></strong>There are over 150 unique spells to learn. The power of these spells (duration, targets, damage, etc.) can be increased by up to seven times by using additional spell points. Characters will naturally become more proficient with particular spells the more they cast them.</p>\n<p><strong>Exploration<br/></strong>The game world is vast and largely unexplored. There are numerous colonies, native tribes, caves, and ancient mysteries to discover.</p>\n<p><strong>Multi-Platform<br/></strong>Suzerain can be run on either Windows or Android - it supports both mouse/keyboard and touch-screen interfaces. A single purchase of Suzerain will let you download any version.</p>\n\n<p>Supplementary Documents:<br/>Golde's Bestiary; or, A Guide to Antipodal Fauna - <em>A description of the creatures commonly found in Antipode.</em><br/>The Three Disciplines of Spells and Magic - <em>A list of the spells that can be learned by characters in Suzerain.</em><br/>Suzerain Manual - <em>A detailed explanation of the mechanics of Suzerain.</em><br/></p>\n\n<p>Try out the demo!</p>", "metacritic": null, "released": "2022-06-17", "tba": false, "updated": "2022-06-24T12:24:51", "background_image": "https://media.rawg.io/media/screenshots/032/0322f996af222ce275c3213dd7f29da8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["Samuel J. Wood"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}