{"id": 807746, "slug": "tales-of-adora-the-wizard", "name": "Tales of Adora - The Wizard", "name_original": "Tales of Adora - The Wizard", "description": "Short about the game:\r\nTales of Adora is a short, simple, fun, fantasy first person indie game that offers 2 different endings to the story. \r\nA deep story told short, with lots of room for lore speculation…\r\nUnleash your inner wizard in the magical land of Adora as the wizard named Vector.<br/><br/>It is possible to finish the game within an hour.<br/>The game is designed to have no save function.\r\n\r\nGame Controls\r\n<em>Movement: W-A-S-D\r\n </em>\n<em>Sprint: Shift</em>\n<em>Lantern: Q </em>\n<em>Light Attack: Left Click  </em>\n<em>Strong Attack: Right Click</em>\n\n<strong><em>Game Lore<br/>A few of the locations<br/></em></strong>\n\n<p>Frostspring Valley is located at the foot of Blizrock Mountains. It is a small village, and is the main provider of resources to Adora Castle. In Frostspring Valley wizards, dwarfs and Deepwalkers live side by side as friends and equals rather than in ranks. It is a popular village for travelers to stay on their way to Adora Castle, and even while staying in Adora Castle, because of friendly inhabitants and their mild weather. Frostspring Valley is a highly magical place, as the magical practises of Adora Castle has fundamentally changed the village ground, and turned magical energy into a core part of the soil, making all trees glow with magical energy, making the soil easy to change and warp for crops to grow faster. It has always been the main source of the plant containing the crystal flower for wizard’s staffs, and therefor always an important part of Adora. After the magic has taken over the land of Adora, the frosty village (then known as Frost Valley) has been warped into the warm, yet still snowy place it is today, which then was renamed Frostspring Valley.</p>\n\n<p>Blizrock Mountains -Tall, icy cold mountains connecting  many different places, most famously it connects Adora Castle with  Frostspring Valley. There are many tunnels inside the mountains leading  from the castle to numerous different locations.\r\n Blizrock Mountains is the largest mountain range in all of Adora.\r\n</p>\n\n<p>Adora Castle is a castle so huge, not  even the wizards living there knows how many rooms are inside. It is  located so high up the mountains it reaches over the clouds.\r\n The castle is the residence of the Master  Wizard (Who functions as the leader of the country), and it is the most  important political location in the land.\r\n Before the witches ascended to what they  are today, the castle was divided in two – one wing for the male spell  casters, and one wing for the female.\r\n The biggest and most famous library in Adora is located in Adora Castle.\r\n</p>\n\n<p>It always rains in Everrain Pass, hence the name.\r\n No one wants to be in Everrain Pass,  except for the excentric wizard Vectus, who – to everyone’s surprise –  volunteered to stay there to keep watch over the graveyard and the  magically enforced gate, shielding off the hidden, forbidden knowledge,  which rests inside the big mountain of Everrain.\r\n No one can breach the barrier to the knowledge hidden inside, which has been hidden for over a thousand years.\r\n The graveyard is no longer in use, and no  one really remembers who lies in the graves. In the middle of the  graveyard is a big grave with a staff on top. No one remembers who lies  inside, but it is well known that whoever it was, was very important. <br/></p>\n\n\n<p>Whispering Hills lies on the border of the land of elves, and it is a very important place to Adora, with only the high ranking wizard being allowed to go in and out. It is so important because it is a place very rich on the crystals used in the staffs of the highest ranking wizards. Many treasures and riches is kept safe here, and the only people besides the wizards who are allowed to be here is the Deepwalkers who have been placed here to mine the crystals and to keep guard over the treasures, as Deepwalkers are incapable of caring about things such as money and shiny jewels, and is therefor the most reliable source of protection.</p>\n\n\n<p>As the name indicates, Deepland is a  land located deeply underground, far deeper down than even the deep  caves, inhabited by the Deepwalker tribes.\r\n Evil creatures and beings who have seeped  into the world inhabits this place. The witches (with the exception of  the few good witches) all live here, from where they corrupt and plot.\r\n In Deepland the concept of time is irellivant, and the fabrics of time seems distorted and slowed.\r\n </p>\n\n<strong>Races and Creatures</strong>\n\n<strong>Dwarfs (</strong>Additional <strong>lore)</strong>\n<p>As the consumption of alcohol has been a  profound part of dwarf culture throughout the ages, it was the natural  thing for most dwarfs to resolve to, when their purpose was taken from  them.\r\n Some dwarfs live in a state of denial, not  willing to accept that their skills are not useful in the land of Adora  no more, some accept and thrive in their new life purpose of  relaxation, and others find new purposes in life, as many dwarfs are now  working as innkeepers, serving their dwarf comrades their drinks, and  others still perfect the art of smithing in order to smith weapons and  armor to sell to nostalgic dwarfs.\r\n </p>\n<p> \r\n </p>\n<strong>Wizards </strong><strong>(</strong>Additional <strong>lore)</strong>\n<p>There are only male wizards, as the  female magic users of Adora all ascended into the witches/realmwalkers.  Witches surpasses wizards in every way, but as a cost most of them have  lost their physical form and lost their way into evil.\r\n For this reason the use of Dark Magic has  been even more forbidden than it was before – to the point where even  reading about it can result in prison.\r\n A wizard will change the color of his eyes  if he mains a new type of magic. This is because wizards absorb magic  rather than wield it, and he almost becomes the magic he uses.\r\n Their staff is not used to cast magic, but  only used to channel it through their body, so they can shield  themselves from being drained of energy, when using much magic.  Otherwise the staff is only used to show off a wizards rank to the world  around them.\r\n It is most common to have a crystal ball  in the staff. The crystal ball grows on a plant, and is technically a  flower, even though it is hard as stone. The flower is blue in color and  grows only in the north, around Blizrock Mountains.\r\n Only very high ranking wizards are allowed  to enforce their staff with a crystal, and this is the most prestige  sign of authority in the land.\r\n In the wizard society, the use of magic  and the use of the authority wizards have in the land is highly debated,  with many wizards disagreeing on what is the best and most moral way to  rule the land.\r\n </p>\n<p> \r\n </p>\n<strong>Deepwalkers (Additional lore)</strong>\n<p>Deepwalkers are a reptilian race who are made entirely out of stone – both their exterior and interior.\r\n Deepwalker societies are found in caves  deep underground, where they use most of their time mining stones to use  as food. Many Deepwalkers have however come to the surface over the  centuries to live among the surface races, where they are usually used  for hard labor as they are the toughest race in Adora, the best miners  and the most obedient and loyal race in the land.\r\n Throughout history people have scolded the  use of Deepwalkers for labor as slavery, as the Deepwalkers are not  payed much for their work and that their loyalty is misused, but  arguments against that is that the Deepwalkers like to work and the  payment of stones is much more valuable for them than riches, as they do  not care for such things.\r\n If you ask a Deepwalker what he thinks of the matter, he will usually say: “I don’t care either way.”\r\n Deepwalkers often have very strange pets, they have taken with them from their homes underground.\r\n</p>", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-06-24T12:38:04", "background_image": "https://media.rawg.io/media/screenshots/921/921bf3657e065e7f3ffea17bf1d0770e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Adora Studio"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}