{"id": 808187, "slug": "dawntide", "name": "Dawntide", "name_original": "Dawntide", "description": "<p><strong>This is the first chapter of the visual novel \"Dawntide\". It features the start of four routes, which will continue to be updated via this page. For more progress information, follow the project at @DawntideVN on twitter.</strong></p>\n<p>---</p>\n<p><em>Riley's spent his whole life in Porthwarren. He flows with a steady pace, drifting from one part-time-job to the next. As certain as the tide rolls in and out, Riley's resigned to the ebb and flow of this routine. <br/></em></p>\n<p><em>\n</em></p>\n<p><em>He's grown up with a good group of friends, but time and circumstance has brought distance between them. Ranzo works abroad on cargo ships, Billy studies north of the County, Sal has made herself busy with freelance work and Joe's settled into his cloistered museum job. Like the old boats that sway in the harbour, memories of the group's better times are moored loosely, and risk drifting off for good.</em></p>\n<p><em>\n</em></p>\n<p><em>Walking familiar paths around the town, Riley is reminded of somebody he clung to like a rock in stormy waters. Someone outside the group. Someone he'd loved. Though after ten years apart, memories of him are painted in fading watercolour.</em></p>\n<p><em>As cool Spring air breathes life onto the land, the town prepares for it's yearly folk festival. With Billy on break from university and Ranzo catching a ship to port, it's the perfect time for a reunion. However, with this year's festival marking a special occasion, it may draw in more visitors than anticipated.</em></p>\n<p>---</p>\n<p><strong>Donations are apprecciated and will assist in the continued development of the project, but are not required to play.</strong></p>\n<p><strong>This release features no explicit content, but the full project is intended for 18+ audiences.</strong></p>", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T15:55:53", "background_image": "https://media.rawg.io/media/screenshots/592/5924658fe6a634d2b32ca305361f672c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Choob"], "genres": [], "publishers": [], "esrb_rating": null}