{"id": 808277, "slug": "scapetown-vr-escaperoom-oculus-quest-2", "name": "ScapeTown VR EscapeRoom (Oculus Quest 2)", "name_original": "ScapeTown VR EscapeRoom (Oculus Quest 2)", "description": "<p>Intro:</p>\n<p>This game is part of an assignment from second semester at Fontys High school University of Applied Science. It is designed for groups of 2-5. It was created to combine Virtual Reality and physical world in one escape room. The end of this prototype may be pretty anti-climactic, because it ended with players opening in-real-world locked chest. I can't provide it here unfortunately. </p>\n<p>Game is designed for Oculus Quest 2 and is in Dutch, although  language shouldn't be much of a problem as we took some measures to make  it easier for international players.\r\n</p>\n\n<p>Setup:</p>\n<p>One player will be using headset, while the rest will be busy with navigating him through the scape town. <br/></p>\n<ul><li>For that it is also advised to stream what the VR player is seeing to the real world players via the Oculus mobile app. </li><li>Additionally it is advised to print out the images and letter that can be found in the zip download for this project. </li><li>App itself has to be side-loaded to the Oculus using Side Quest.</li></ul>\n\n<p>Walk-through/Guide:<br/></p>\n<ol><li>When VR-player starts the game, he'll be greeted with a room where he can get the feeling of controls. In a nutshell, the index finger teleports player when he points at the ground, or picks up an item when he points at something that can be picked up. Additionally, player can move using analog sticks. When player is done with trying out controls, he can click \"Start Game\" on the information board.<br/>In the meantime real-world-players can start checking out intro letter, images of where they need to get the VR player and the map.</li><li>VR-player is guided through town to find handsaw, hammer and workshop station. In that station there is also a plank. </li><li>Firstly player has to transport that plank to sawing table, and use a handsaw to cut it in half.</li><li>Then he needs to take the one half of the plank to the hammering table and put nails into it and hammer them, until they are in.</li><li>After nails are in, the combination to open the chest can be found on the other side of the plank. </li></ol>\n\n<p>Authors:</p>\n<ul><li>Jacques Haan \r\n</li><li>Judah Lit \r\n</li><li>Tirstan Oostdijk \r\n</li><li>Krystian Maraszek \r\n</li><li>Máté Major \r\n</li><li>Joey van de Looverbosch \r\n</li><li>Junjie Cen\r\n</li></ul>", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T16:32:44", "background_image": "https://media.rawg.io/media/screenshots/53a/53ad9cf7384b509f83a1aef3d9a7e179.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Gryfin123"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}