{"id": 808286, "slug": "asset-flip-fps", "name": "Asset Flip FPS", "name_original": "Asset Flip FPS", "description": "<p>I'm amazed at how much you can get done in a week by just throwing together a few Unity Store assets. This started as an experiment I did a few years ago, mixing up Boldinoboy's excellent Tropical Forest Pack with Aura2 and CTS [https://www.youtube.com/watch?v=RxEWKZrR3Oo]. Then I picked up a few assets in the recent sales and thought I'd put them to good use by resurrecting 'that old jungle project'. </p>\n<p>This was a bit of a fun learning project while I had some downtime at work, my own personal game jam. I'm employed as a VR developer, which is hugely demanding in terms of having to constantly take care of performance optimisation. Switching to a pancake game allowed me to let my hair down a little and not worry too much about dropped frames. Most of the environmental design is from the original asset demos, although the maps have been tweaked in parts to fix bugs or issues. If you do go on to buy any of these assets, please feel free to reach out and I'll be glad to explain some of the fixes I had to apply. Most of the work involved getting the various systems talking to each other. I also learned a bit about using Material Property Blocks to animate the NPC's material emission based on distance to player (to make them stand out in the distance). I then wasted a few days trying out various AI assets like Enemy AI and Blaze AI, but ultimately just went back to one I've used in the past [http://baroquedub.co.uk/vrfps/]</p>\n<p>There's not much of a game here, just waves of NPCs coming at you. Think of it as a walking simulator for people who like first person shooters and you'll get the idea. It's a freebie, what more do you expect? I've tried my best to make this a decent showcase for the assets I've used. My thanks to the artists and developers who made this so much fun to put together. I'll list the assets used in a devlog: https://baroquedub.itch.io/asset-flip-fps/devlog/395499/assets-used</p>", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T16:36:51", "background_image": "https://media.rawg.io/media/screenshots/029/029f59fbee55efd3b0d2be5ec701dad3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["baroquedub"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}