{"id": 808314, "slug": "the-pellaropen-alpha", "name": "The Pellar[Open Alpha]", "name_original": "The Pellar[Open Alpha]", "description": "<p>[ENG]\r\n</p>\n<p>The game is currently in open alpha. This is not the final version of the game and may not be free of bugs, errors in texts and dialogues, and may not be overwhelming with the amount of content. If you find a bug, we would be grateful if you report it to us in the comments.\r\n</p>\n<p>At the moment, the game has implemented a prologue, an incomplete first chapter and a separate tutorial segment. We plan to prepare updates every two weeks.\r\n</p>\n<p>---------------------------------------------------------------------------------------------------\r\n</p>\n<p>Description:</p>\n<p>The Pellar is a game in which you play as a quack hermit. Your task is to make medicines, potions and dressings that will then be used to help those in need. You will struggle with the treatment of various diseases for which you need to use appropriate methods of treatment. If you fail to save at least one person, an angry crowd of villagers with pitchforks and torches will gather in front of your house. In addition, you are under the Curse of the Midnight, which means that you must always return to the hut before the middle of the night.</p>\n\n<p>The game will offer:</p>\n\n<p>-A vast world inspired by Slavic mythology with metroidvania mechanics\r\n</p>\n<p>-Crafting system</p>\n<p>-Resource and time management\r\n</p>\n<p>-Numerous NPCs\r\n</p>\n<p>-20 different diseases\r\n</p>\n<p>-Day and night system and changing weather</p>\n<p>-Interesting storyline\r\n</p>\n<p>===========================================================</p>\n<p>[Pl]\r\n</p>\n<p>Gra jest obecnie w stanie otwartej alphy. To nie jest ostateczna wersja gry i może nie być wolna od bugów, błędów w tekstach i dialogach oraz może nie powalać ilością contentu. Jeśli znajdziesz jakiś błąd będziemy wdzięczni za zgłoszenie nam tego w komentarzach.</p>\n<p>Na ten moment gra ma zaimplementowany prolog, nie dokończony pierwszy rozdział oraz osobny segment samouczkowy. Planujemy szykować aktualizacje raz na dwa tygodnie.</p>\n<p>---------------------------------------------------------------------------------------------------</p>\n<p>Opis:</p>\n<p>The Pellar jest grą w której wcielasz się w pustelnika znachora. Twoim zadaniem jest wytwarzanie lekarstw, mikstur oraz opatrunków które następnie będą użyte do pomocy potrzebującym. Będziesz się zmagał z leczeniem rozmaitych chorób do których trzeba stosować odpowiednie metody kuracji. Jeśli nie uda ci się uratować choć jednej osoby to pod twoim domem zbierze się wściekły tłum wieśniaków z widłami i pochodniami. Na dodatek ciąży na tobie Klątwa północy przez którą musisz zawsze wrócić do chaty przed środkiem nocy.\r\n</p>\n<p>Gra będzie oferować:\r\n</p>\n<p>-Rozległy świat inspirowany mitologią słowiańską z mechanikami metroidvanii\r\n</p>\n<p>-System craftingu\r\n</p>\n<p>-Zarządzanie zasobami i czasem\r\n</p>\n<p>-Liczne postaci niezależne\r\n</p>\n<p>-20 różnorodnych schorzeń\r\n</p>\n<p>-System dnia i nocy oraz zmieniającą się pogodę\r\n</p>\n<p>-Interesującą fabułe</p>", "metacritic": null, "released": "2022-06-21", "tba": false, "updated": "2022-06-24T16:49:58", "background_image": "https://media.rawg.io/media/screenshots/1ec/1ecb468325ddba69f18d4cc24e419c41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Charon99"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}