{"id": 80842, "slug": "the-myth-of-heroes-legend-lite", "name": "The Myth Of Heroes Legend Lite", "name_original": "The Myth Of Heroes Legend Lite", "description": "The Legend of Deification is compiled according to the Deification of Historical Novel, which is the 1st Magic Novel of the Oriental. The story background was in the last year of Kind Zhou of Shang Dynasty, being in the 1000 B.C of the Ancient China, which has around 3000 years’ history from today. At that time, the King Zhou specially trusted Da Ji, which has resulted in the decadent government and the people being living in misery. The Western Zhou Dynasty being in tune with the times, it is the Son Tooth who led the brave heros to crusade against the King Zhou. And you can enjoy the history in our game. <br/><br/>The type of the game is SLG Strategy. The player can enjoy bright color and exquisite screen and figures, in which aesthetic map, vivid figures and specially gorgeous background music will bring players with different experience. The game have adopted large amount of the hit effect, fire, freeze and witchcraft effect together with gorgeous background music, which makes the game being easy to play.    <br/><br/>This game has been made the modification, being most suitable for the iphone platform, which ease the player to operate. While moving the figure, slippaging the screen is ok; Stay the mouse on the figure for half-an-second, you can see the property of the figure. At the same time, the automatic fighting system becomes easier and more convenient to operate. <br/><br/>The full version game includes 6 Chapters, in which there are 40 kinds of soldiers, such as soldier, wizard, archer and different monsters and spirits, 12 bosses and 7 heros. Various roles and soldier type have been carefully designed, and the layout of the game roles, game formation and role growth will finally influence on the final game score. <br/><br/>While passing the game, the system will give out an assessment, which will help the player to pursue higher score.<br/><br/>《封神英雄傳奇》故事背景是由號稱東方第一部魔幻小說《封神演義》改編而成。故事發生在西元前一千多年前的中國古代商紂末年，距離現在約3000年左右。紂王寵信妲己，導致朝廷腐朽，生靈塗炭，西周順應天時，由姜子牙率眾英傑發兵討伐商紂，本作再現了這段歷史的全過程。 <br/><br/>遊戲的類型屬於戰略SLG. , 整個遊戲色彩明快，無論從介面到人物或者地圖都做的十分精緻，其中地圖的唯美，人物的生動富有特色，特效的華麗和雄壯的背景音樂相信會給用戶帶來不一樣的感受。在遊戲中使用了大量打擊特效，火焰 ，冰凍，巫術等效果，物理戰鬥法術攻擊，弓弩射擊全都配置華麗音效，加上雄壯的背景音樂使得整個遊戲可玩性很高。<br/><br/>本作做了適合於iphone平台最貼切的修改，使得用戶操作十分舒適。<br/>移動人物時只需要滑動屏幕，想看人物屬性時只需點中人物持續半秒。<br/>而自動戰鬥系統也使操作更加簡單，更加便捷。<br/><br/>完整版包含6個章節的故事，其中包含40多個兵種（包含戰士，法師，弓箭手，各種神怪等），12個BOSS ，7位英雄，其中各個角色和兵種的數值都是經過精心設計的，遊戲角色的位置，陣型的佈置，角色成長都會影響到最終的結果， 其中消滅敵人賺取黃金，然後可以任意攢錢購買對方士兵， 使得遊戲性更加多變，在遊戲中你可以通過努力組建一支屬於自己獨有的軍隊，最多可以控制50個單位。<br/><br/>在遊戲通關的同時還會給出一個評價體系，使得即使是通關的玩家還能繼續追求更高的分值而努力。<br/><br/>Available Language：<br/>  English 繁體中文 简体中文 日本語", "metacritic": null, "released": "2009-09-16", "tba": false, "updated": "2019-07-30T08:51:09", "background_image": "https://media.rawg.io/media/screenshots/599/599aa5f1e3ccbd79723605d43cf92eb3.jpg", "website": "http://www.ieasytech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EASY"], "genres": ["RPG", "Strategy"], "publishers": ["zhang yue"], "esrb_rating": "Mature"}