{"id": 808429, "slug": "the-gearsistance", "name": "The Gearsistance", "name_original": "The Gearsistance", "description": "<p><strong>Information</strong>\n</p>\n<p>A strategy game developed by Midnight Magic as part of the Game Design course in the Game Production and Management course at the Neu-Ulm University of Applied Sciences in the summer semester of 2022.</p>\n<p>\n<strong>The Gearsistance<br/>\n</strong>\n</p>\n<p>Sanctuary. A place made by and for pioneers. Life thrives in the streets. Even though they live under the surface, a robot couldn't be happier to have the chance to live in Sanctuary. Every resource important to robo-kind is within reach. Modern facilities ensure prosperity but at the cost of others… <br/></p>\n<p>Poverty, lack of fuel and rust everywhere. People from Scraptown suffer immensely from the smog produced by the Undercity called the sanctuary. \r\nAcid rain and clocked filters makes life unbearable. Day by day the circumstances are getting worse. Getting spare parts is nearly impossible if you’re not part of the wealthy robots.\r\n</p>\n<p>Smog from facilities gets pumped with exhaust pipes straight to the Upper City. One has to suffer, so that the others can live in fortune.  It is not possible for the robots from the upper city to descend into the undercity. They are bound by their origin.</p>\n<p>So it was destined to happen that the robots from the Upper City started to riot out of desperation. \r\n</p>\n<p>We’re here right now.\r\n</p>\n<p>We have to go there and destroy their Factory.\r\n</p>\n<p>But we can’t do this alone\r\n</p>", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-06-24T17:35:27", "background_image": "https://media.rawg.io/media/screenshots/1c8/1c88e5add9e47ff92f222a89d504dfeb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Midnight Magic"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}