{"id": 808503, "slug": "the-barbarian-path", "name": "The Barbarian Path", "name_original": "The Barbarian Path", "description": "<p>\"The Barbarian Path\" is a colony simulator set in 14 B.C. ancient Germania, were Roman Empire made first attempt to conquer it. You start as a small community of one of 5 major tribes and while game progresses your community grows bigger. Your actions will have an impact on a conflict which would be a reflection of global relations between clans.</p>\n<p>To survive, you will need to constantly look after your colony, by scheduling their daily routines or by just getting the full RPG style control on individual characters. Providing food, clothing or tools would be essential, but also keeping them in good spirit by frequent interaction, prayer or music. Except for basic daily life items, producing weapons to defend your land will be crucial, as well as vehicles like wagons or carts which will help transport bigger items, or just travel to other parts of Germania.</p>\n\n<p>Your colony will be frequently visited by other groups, but sometimes their intensions might not be friendly. Bandits will try to rob or kill you, so to learn how to deal with them would be a crucial skill. Later during the game your lands will be attacked by Romans. As you progress with your skills, you will manage to fight them by organizing ambushes and battles. Actions like this would help you to gain respect and reputation, which could promote you to become a noble or even king.</p>\n\n<p><em>Game features:</em></p>\n<p><em>*A big world map to explore with 5 Germanic tribes to choose from: Bructeri, Sicambri, Marsi, Chatti, Cherusci.</em></p>\n<p><em>*A full RPG style control on individual characters and daily task scheduling.</em></p>\n<p><em>*Characters are described by health statistics, skills and attributes.</em></p>\n<p><em>*Sectors which allow you to gather necessary resources to build structures and produce daily life equipment to survive.</em></p>\n<p><em>*The social ascpect like conversation, prayer and music which is necessary to keep your characters in good mental state.</em></p>\n<p><em>*Building cottages or fences, and crafting such as tailoring, woodworking, blacksmithing, animal breading, wainwrighting etc.</em></p>\n<p><em>*A real time combat including ambushes, big battles and pillages.</em></p>\n<p><em>*The reputation system which allows your characters become nobels or even kings.</em></p>\n<p>Trailer:</p>\n<p>Discord:https://discord.gg/xvPp7sjN<br/></p>", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-06-24T18:09:13", "background_image": "https://media.rawg.io/media/screenshots/58e/58e6faa4ade93b5666fd2a82b5bae575.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bad Blood Games"], "genres": ["Action", "RPG", "Simulation"], "publishers": [], "esrb_rating": null}