{"id": 808839, "slug": "chicken-empire-weasel-in-shadows", "name": "Chicken Empire: Weasel in Shadows", "name_original": "Chicken Empire: Weasel in Shadows", "description": "Chicken Empire: Weasel in Shadows is turn-based stealth strategy game, where you try to infiltrate the Chicken Empire bases looking for clues that will help find your friend, the Frog who has been missing since the last chicken raid. Throughout your journey, you will uncover many secrets, conspiracies, and maybe even more than you wanted to know!<br/><br/>The Chicken Empire is spreading its wings and new and new territories are plunging into their shadow. The Weasel wakes up after a raid by chickens on his home village to find that the feathered creatures have taken not only his money, herbs and his shoes, but also his friend the Frog. During his adventurous journey, he will have to sneak through the outposts and gather information to help him rescue her. Will you find out how far the claws of the Chicken Empire reach?<br/><br/><br/><br/>Shadows and your special abilities will be your best friend as you infiltrate the bases. Using the right combination of these you will sneak through levels full of chicken recruits. Humour and hyperbole await you in a lovely hand-drawn world.<br/><br/>Game key features:<br/><ul><li>Lovely hand-drawn graphics<br/></li><li>Humorous animations of cute animals<br/></li><li>Six carefully designed parts of the world with different difficulty levels<br/></li><li>Strategic challenge against the Chicken Empire<br/></li><li>A story of friendship, trust, the mysterious Chicken Empire and its intrigues</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-06-27T04:06:55", "background_image": "https://media.rawg.io/media/screenshots/4fd/4fd034206206f9d508177290bcd5c61d.jpg", "website": "http://fairysnail.cz/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 194, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fairy Snail Games"], "genres": ["Adventure", "Strategy", "Indie"], "publishers": ["Fairy Snail Games"], "esrb_rating": null}