{"id": 808848, "slug": "corleone-online", "name": "Corleone Online", "name_original": "Corleone Online", "description": "Corleone Online is a cross platform MMORPG set in an open modern day organized crime world.<br/><br/><strong>» WRITE YOUR STORY «</strong><br/>Are you ready to explore the world and embark on a risky journey in conquering the gang filled streets of Corleone as your own! Or seeking notoriety and fame in a more competitive environment? Whether you’re keen on controlling the streets as your own or basking in the spotlight of infamy, the world is yours to conquer and you have a story to write!<br/><br/><strong>» CROSS-PLATFORM «</strong><br/>Corleone Online is a fully cross-platform MMORPG experience. Whether you prefer PC or Mobile, one account is shared across all.<br/><br/><strong>» FULL PLAYER CUSTOMIZATION «</strong><br/>• Featuring the ability to upload and use your own personal created graphics in-game<br/>• Head , Hat and Body Uploads:<br/>Following our character templates, you are able to create and fully customize your own player as you wish and have the option to upload the finished masterpiece to the server to use and show off!<br/><br/><strong>» GUNS … GUNS and EVEN MORE GUNS «</strong><br/>Dozens of different weapons at your disposal to chose from, you’ll need a few to protect yourself and your turf.<br/><br/><strong>» COMMUNITY RAN ECONOMY «</strong><br/>• From basic currency to actual weapons and item’s. Nearly every item in-game is obtainable from other online players.<br/>• Buy, Sell and Trade and the click of a button! and be sure not to miss out on Staff hosted Auctions! You ALWAYS will want to be there.<br/><br/><strong>» INTENSE COMBAT «</strong><br/>• Test yourself against other players in various, rewarding solo to small or large scale PVP battles! <br/>• Unique tactics and strategies will be needed to ultimately put your skills to the test, will you be dominant in your efforts?<br/><br/>This game requires an internet connection.", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T04:24:51", "background_image": "https://media.rawg.io/media/screenshots/aee/aeeba31a418397a29275b0bfc50341d5.jpg", "website": "https://corleoneonline.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["IAPPSBEATS"], "genres": ["Action", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["IAPPSBEATS"], "esrb_rating": null}