{"id": 808814, "slug": "the-invisible-mans-stealth-ntr-convincing-and-inse", "name": "The Invisible Man's Stealth NTR: Convincing and Inseminating the New Announcer with an Invisible Boner", "name_original": "The Invisible Man's Stealth NTR: Convincing and Inseminating the New Announcer with an Invisible Boner", "description": "<p>This is a Low-priced practical erotic game.《Contents》CG : 15<br />\nIntimate scene : 15<br />\nVoice : Heroine Full Voice.《Features》You can have the same experience as the protagonist.Three endingsCG Gallery ModeScene Replay Mode《Story》<br />\nUnpopular with women and stuck working a crappy job, Takumi Tsuge sees no point in living.<br />\nThe one who saves his life is the new announcer Yuki Konoe.<br />\nShe publicly declares that she&#39;s single, and she&#39;s unapologetically self-assured in her handling of men and the barrage of dirty comments she receives.<br />\nUpon seeing her live her life as a virgin who&#39;s passionate about her job, Takumi feels like he can accept his own way of living.<br />\nIt&#39;s because of her hard work that he&#39;s able to go on.<br />\nThat is how dependent Takumi was on Yuki.<br />\nHowever, one day, he finds out the truth.<br />\nFar from Yuki being a virgin, she has quite an active sex life.<br />\nUpon learning the truth, Takumi is inconsolable, and he even finds himself starting to consider ending it all<br />\nwhen a door-to-door saleswoman turns up at his home.<br />\n&quot;Hey, Tsuge. Want all your desires as a man to be granted?<br />\nThe moment I saw you, I knew you&#39;d be a great candidate… for this invisibility serum…&quot;<br />\nTakumi gives the sketchy saleswoman everything he has in exchange for a drug that promises to turn him invisible.<br />\nHaving already given up on life, he plunges the needle into his arm without much thought.<br />\n(It&#39;s not like it&#39;ll work anyway. There&#39;s no such thing as an invisibility serum.)<br />\nOr so he thought…《Character》<br />\nYuki Konoe (VA: Hina Shinomiya)<br />\nAn intensely popular new announcer.<br />\nBeloved by men and women alike for her refusal to flirt with men and her unapologetically single lifestyle, she makes frequent appearances on variety shows as well.<br />\nHowever, in truth, her persona of a woman totally uninterested in love is merely an invention of her agency.<br />\nShe has a high libido and loves sex, frequently having it with her childhood friend Towa Kijiyama.<br />\n&quot;I&#39;m not interested in sex. Or rather, I hate it. It disgusts me.&quot;<br />\n<em>Before purchasing this product, we highly recommend that you play the demo[Japanese only] to check if the game works properly on your computer in your region.<br />\n</em>Appetite is the licensor of this game. For inquiries about the product, please contact Tensei Games.</p>", "metacritic": null, "released": "2022-06-23", "tba": false, "updated": "2022-06-27T12:40:10", "background_image": "https://media.rawg.io/media/games/fae/fae75a70d7b8a4833a23a6022aaa6487.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 399, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appetite"], "genres": ["Simulation"], "publishers": ["Tensei Games"], "esrb_rating": null}