{"id": 808842, "slug": "henshinko", "name": "Henshinko!", "name_original": "Henshinko!", "description": "[18+] <strong>Henshinko!</strong> is a short transformation themed, pachinko/pinball-style arcade experience.<br/><br/>---<br/><br/>Your name is Tayler.<br/><br/>You are twenty-two years old living with your old high school sweetheart turned fiancé Emmy. She is out of town on a family vacation somewhere on the other side of the planet with only the spottiest of cell phone signal but will return in seven days, just in time for her twenty-first birthday.<br/><br/>Unfortunately, unknown to your beloved, you are flat out broke after losing a few desperate bets. Worse, you still have to make rent and pay some bills first and you are an unemployed college dropout who makes ends meet through occasional gig jobs, the last one of which you got stiffed. Here you are finishing off the last of your drink at your favorite bar with no idea what to do.<br/><br/>Just as you're about to leave, you spot a strange video arcade machine in the back of the building promising the opportunity to make real money in a game of luck and skill. You're a pretty decent gamer--maybe this will be your lucky break! Even better, the machine tells you it costs nothing to play a game once per day--aside from sacrificing a little bit of your... REALITY?<br/><br/>---<br/><br/>Features:<br/>- Custom artwork from transformation artist Mizuho<br/>- 7 levels of chaotic pinball-style arcade action<br/>- 6 different game endings and multiple story variations<br/><br/><strong>NOTE</strong>: This game is based on male to female gender-bending. All artwork is clothed but not safe for work (SFW). The writing contains some vulgarity and non-explicitly mentions sexual acts.", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T04:11:24", "background_image": "https://media.rawg.io/media/screenshots/f95/f95ddf66a909d20490d0280a4bbef16a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blue Fairy Media"], "genres": ["Sports"], "publishers": ["Blue Fairy Media"], "esrb_rating": null}