{"id": 808813, "slug": "dont-stop-the-camera-hidden-desires-of-a-young-wif", "name": "Don't Stop the Camera! ~Hidden Desires of a Young Wife~", "name_original": "Don't Stop the Camera! ~Hidden Desires of a Young Wife~", "description": "<p>This is a Low-priced practical erotic game.《Contents》CG : 15<br />\nIntimate scene : 15<br />\nVoice : Heroine Full Voice.《Features》You can have the same experience as the protagonist.Two endingsCG Gallery ModeScene Replay Mode《Story》<br />\nEven though she knows it&#39;s wrong… her hands won&#39;t stop…<br />\n&quot;Ah… You&#39;re filming me… You&#39;re filming me acting so naughty with your phone…&quot;<br />\nEven she can&#39;t believe that she&#39;s gotten this aroused just from being filmed.<br />\nToday as usual, she relieved the sadness of her husband not being there by herself…<br />\nUntil one day…<br />\nThe caretaker of her apartment complex, Kaho Uehara, came to return her phone, which she had dropped.<br />\n&quot;Your phone was unlocked when I picked it up. I didn&#39;t mean to look through it, but…&quot;<br />\n&quot;Um, well… if possible, I&#39;d prefer that other people didn&#39;t…&quot;<br />\n&quot;I&#39;m not shocked by this. If anything… I&#39;m glad.&quot;<br />\nGlad…? Why? About what?<br />\nShe smiles, seemingly pleased.<br />\n&quot;Wouldn&#39;t you like to… join the alternative residents&#39; council? You could just join as a trial at first. What do you think?&quot;<br />\nShe just left her that note and left, but… what should she do?<br />\nIt&#39;s obviously a sketchy organization, so there&#39;s no way she should go… but.《Character》<br />\nSetsuka Ikuta (VA: Shiina Asahi)<br />\nA young married woman who lives in an apartment complex.<br />\nHer husband is too busy to have sex, so she often pleasures herself.<br />\nShe films herself masturbating with her phone to help herself get off, but she hasn&#39;t told anyone that.<br />\n<em>Before purchasing this product, we highly recommend that you play the demo[Japanese only] to check if the game works properly on your computer in your region.<br />\n</em>Appetite is the licensor of this game. For inquiries about the product, please contact Tensei Games.</p>", "metacritic": null, "released": "2022-06-23", "tba": false, "updated": "2022-06-27T12:41:03", "background_image": "https://media.rawg.io/media/games/da9/da9e7c60d17980027dd7d428a311cef4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appetite"], "genres": ["Simulation"], "publishers": ["Tensei Games"], "esrb_rating": null}