{"id": 8089, "slug": "total-drive", "name": "Total Drive", "name_original": "Total Drive", "description": "NOTE: Total Drive is not compatible with iPad1, iPhone 4s, iPod Touch 4th gen and older devices.<br/><br/>Unique racing arcade abounding in an enormous amount of mind-blowing tracks on which the racer has the opportunity to enjoy the breakneck pace and deadly twists. The vast number of unique pipes, and the dizzying loops will impress anyone who loves to put pressure on the accelerator. The project promises to be unique in the genre of arcade racing.<br/><br/>Total Drive is a 3d racing arcade with multiple racing tracks. Get the perfect time and be on the top of the list. <br/><br/>The basic idea of Total Drive is unique tracks. The main part of the track has constant difference in height, angle and direction. During the game, you need to control the car and try to find the perfect place for entering the turn. <br/><br/>The player has the opportunity to get more upgraded version of the car called as &amp;quot;TotalDrive car mode&amp;quot;.<br/><br/><br/>Key Features:<br/><br/>TIME SHIFTED MULTIPLAYER<br/>Competitions with players from around the world<br/><br/>MULTIPLE TRACKS<br/>There are thirty six tracks in game on this moment.<br/><br/>NON-STANDARD ELEMENTS FOR STUNT RACING<br/>There are many elements for stunt racing - they open gradually along the passage.<br/><br/>THE OPPORTUNITY TO OPEN TOTAL DRIVE CAR MODE<br/>It gives you a more powerful car, now you can pass difficult racing tracks so much easier, like never before.<br/><br/>TWO TYPES OF CAR CONTROLS<br/>Сhoose between simple and more advanced control.", "metacritic": null, "released": "2015-12-15", "tba": false, "updated": "2019-10-22T14:29:43", "background_image": "https://media.rawg.io/media/screenshots/7b7/7b707a96063b72b70e165fdfa6ea356a.jpeg", "website": "https://www.facebook.com/GameTotalDrive/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hleb Siutsou"], "genres": ["Racing", "Arcade"], "publishers": ["Hleb Siutsou"], "esrb_rating": "Everyone 10+"}