{"id": 80903, "slug": "flower-board-hd-a-relaxing-puzzle-game", "name": "Flower Board HD - A relaxing puzzle game", "name_original": "Flower Board HD - A relaxing puzzle game", "description": "• Flower Board have crossed 1 million downloads mark. Thank you for your support!<br/><br/>User reviews:<br/><br/>• \"My husband and I can't get enough of it.\" - iCatriona<br/>• \"This game is way too fun. I keep draining my battery playing it\" - Ash mil<br/>• \"The game starts out easy, but gets very, very challenging.\" - Li3303<br/>• \"Had this game few years now and still love it! Simple, addictive and just fun to play\" - Nicnok76<br/>• \"Once you figure out how to play it's very hard to put it down.. \" - Believe in Yourself<br/>• \"You can play for 5 minutes or an hour. It's the perfect pick up and put down game.\" - Leggyj74<br/><br/>--------------------------------<br/><br/>• App Advice review: A challenging game that will definitely make you think twice about how easy it is to move a simple marker - 5/5<br/><br/>• From user Li3303:<br/><br/>--------------------------------<br/><br/>Normally I find this type of \"line\" game too frustrating, but this game has some awesome features:<br/><br/>1- being able to see what pieces will come up next- and where (I call them buds)<br/>2- an undo button that you can use 50 times per game<br/>3- a wild card flower<br/>4- a flower that when matched with five flowers of the same color will clear the board of that color<br/>5- being able to drastically reduce the number of flowers on the board three times<br/>6- the hexagon board grid<br/><br/>The game starts out easy, but gets very, very challenging. Games can take a long time (around 1-3 hrs), but it's easy to put down and just pick up where you left off. Personally, I get more satisfaction from doing well on a longer more involved game than something that takes a few minutes. It's almost perfect the way it is, but I would love to have a counter to keep track of how many undos I've used during the game. Highly recommended for puzzle fans!<br/><br/>--------------------------------<br/><br/>• Description:<br/>Flower Board is a highly addictive game. Group six or more balls together to dismiss them and to increase your score. New balls are added after each move and you will need to keep the board from filling up. There are also special balls to help you clear the board. The goal is to score as high as possible. The game is simple to learn, yet hard to master. You will have hours of fun playing it!<br/><br/>Features:<br/>* Game Center support with 6 leaderboards.<br/>* Optimized for retina display.<br/>* On board preview of next balls.<br/>* Powerful rainbow and lighting balls.<br/>* Undo button to avoid mistake.<br/>* Multiple themes to choose from.", "metacritic": null, "released": "2011-07-29", "tba": false, "updated": "2019-07-30T08:52:51", "background_image": "https://media.rawg.io/media/screenshots/90f/90f89137c598e416d679b8eec796d97d.jpg", "website": "http://www.phoenixmobileonline.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tue Nguyen Minh"], "genres": ["Board Games", "Puzzle"], "publishers": ["Tue Nguyen Minh"], "esrb_rating": null}