{"id": 8091, "slug": "robbery-bob", "name": "Robbery Bob", "name_original": "Robbery Bob", "description": "Introducing the Man of Steal…<br/><br/>Play as Bob, the hapless burglar intent on changing his ways. Unfortunately for Bob, however, he&amp;#39;s going to be forced into a few final jobs before he&amp;#39;s allowed out of the criminal life.<br/><br/>This app offers in-app purchases.  You may restrict in-app purchasing using your device settings.<br/><br/>&amp;quot;This game is genuinely a joy to play and an interesting take on the robbing genre.&amp;quot; — App-Score<br/><br/>&amp;quot;If the Grand Theft Auto phenomenon has taught us anything, it&amp;#39;s that we as a people love theft. Robbery Bob is just one of the many games that fill that demand.&amp;quot; — Polygon<br/><br/>Sneak past security guards, residents and sleeping bulldogs as you recover the loot in each stage. Use your ninja-like skills, abilities, utilities, and costumes to hide in some tight squeezes and avoid detection. <br/><br/>Your sticky-fingered missions will take you through a local neighbourhood, Downtown, and even through some secret labs. Can you get a perfect on every one?<br/><br/>Robbery Bob features:<br/><br/>• Avoid being detected as you break into houses, shops, and more in over 100 challenging levels<br/>• Use your skills to dodge traps in your way and find all the available loot<br/>• Pinch everything from secret documents to old pairs of clothes – don’t forget to grab those hard to find TV remotes!<br/>• An engrossing comical storyline complete with hilarious animations and a genuinely twisting narrative<br/>• Customise Bob with cool items and outfits", "metacritic": null, "released": "2012-05-03", "tba": false, "updated": "2023-08-14T13:47:53", "background_image": "https://media.rawg.io/media/screenshots/be8/be8b2f6462157c34a62f0dfbd111bbed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Level Eight"], "genres": ["Action", "Adventure"], "publishers": ["Level Eight"], "esrb_rating": null}