{"id": 809585, "slug": "lowercase-mine", "name": "lowercase mine", "name_original": "lowercase mine", "description": "Rules\r\n<p>In Mine, the goal is to get all diamonds to the foundation. The deck is 3/4ths clubs (rocks), and 1/4th diamonds.</p>\n<p>Rocks can be moved, as long as they're in sequence, to empty lanes or onto rocks where they continue the sequence. They cannot be placed on top of diamonds, as you wouldn't want to lose track of them by covering them up.</p>\n<p>Diamonds, since they're valuable and might be stolen, cannot be moved around the mine proper. They can only be moved to a mine carts, which can each hold one of any card, or the foundation (store). The foundation must be built up in sequence, but can start from any rank.</p>\n<p>Don't bother cleaning up the rocks after you're done. You've gotten all you need out of the mine.</p>\r\nTips\r\n<ul><li>Since diamonds can block each other, not all ranks are suitable to start.</li><li>Since diamonds cannot be moved from a mine cart except to the store, try to avoid holding diamonds for too long.</li><li>Think before moving rocks around. Try to reveal essential cards instead of moving them thoughtlessly. Since only one card can be in a cart at once, it may be beneficial to hold off on making moves.</li><li>If you see that a deal has more than two mine carts, it's because, looking at the diamonds alone, it cannot be beaten with two. Don't worry, though, these deals tend to be easier.</li><li>Not all games are winnable (but the vast majority are). If you can see that it's unwinnable and pick new deal before making any moves, it won't count as a loss.<br/>\n</li></ul>\r\nBackground\r\n<p>This version of Solitaire is directly inspired by the Diamond Mine type of of Solitaire that I first saw in Aisleriot. The concept of digging through stacks for the diamonds is a compelling one, and its large amount of card stacks made it stand out.\r\n</p>\n<p>The details of that mode, however, I found lacking. It's impossible &gt; 60% of the time, and because all of the cards are hidden, it's hard to stumble upon the correct card to start it with. This is my attempt to make a version of it that I find enjoyable. It deviates quite a bit from its roots, but I think it's a fun, breezy game of Solitaire.</p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T09:44:12", "background_image": "https://media.rawg.io/media/screenshots/a70/a7041942ca7f9c17edafd575415327af.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Kevin Hutchins"], "genres": [], "publishers": [], "esrb_rating": null}