{"id": 809579, "slug": "tale-of-vassya", "name": "Tale of Vassya", "name_original": "Tale of Vassya", "description": "<p><strong>Synopsis</strong></p>\n<p>The game is an Adventure RPG, and utilizes a simple side view battle system with entirely animated cast and enemies. The game has two separate stories, each with their own story, cast, enemies and path through the world of Vassya. <br/>Each of the two stories include around 15 hours of story and gameplay and at least another 5+ hours of optional content if you choose to continue on. There is a ton of content to find in each story line, and much of it works to expand on the story and the world. The story is heavy, so admittedly, there is a lot of reading, but I believe it is worth it. Every inch of Vassya is created with a purpose, and hides interesting treasures and bits of lore.<br/>Thanks for checking out my game, and I hope you all enjoy!</p>\n<p><strong>Summary of Features</strong><br/>- Two separate storylines, each with ~15+ hours of story and gameplay.<br/>- On-screen enemies. (No random battles).<br/>- Lots of exploration and world lore to learn.<br/>- Over 950 maps created.<br/>- Hunts System<br/>- More than 10 unique weapon types.</p>\n<p><strong>Story</strong></p>\n<p>The world of Vassya has been at peace for over a century. There are many different lineages of people spread throughout all the major cities in the world. One fateful night, King Orick Maxwell II, the king of Capitol City, was found murdered in cold blood. The culprit, a man named Dmitry Juleon, is still at large. After the first royal murder in over 100 years, the world of Vassya is very much unsettled, and tensions are beginning to rise between the cities. It is up to our two main characters to figure out how to restore Vassya to its peaceful time, and find themselves a long the way.</p>\n<p><strong>More Information</strong></p>\n<p><strong>More info about the game can be found in these forums:</strong></p>\n<p>RPGMakerWeb</p>\n<p>Youtube<br/></p>\n<p><strong>Screenshots</strong></p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T09:42:20", "background_image": "https://media.rawg.io/media/screenshots/a9b/a9b4a2adac4c58094571e44d444ed845.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Kelarly"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}