{"id": 809544, "slug": "quivering", "name": "Quivering", "name_original": "Quivering", "description": "<p>This game was made for Ludum Dare Game Jam #47</p>\n\n<p><strong>Quivering<br/></strong>Quivering is a puzzle platformer where you jump around shooting arrows to hit hard-to-reach targets! The screen wrapping effect serves as a unique mechanic that enables a lot of interesting puzzle oportunities.</p>\n<p>I hope you'll enjoy all the eleven unique levels!<br/></p>\n<p><strong>Controls<br/></strong>Use the mouse to aim your bow, and hold left mouse button to charge. Release to shoot an arrow!</p>\n<p>use <strong>WASD </strong>to move around, and <strong>SPACE </strong>to jump.</p>\n<p><strong>Theme<br/></strong>Stuck in a loop.</p>\n<p>Once you shoot an arrow, it will bounce between walls indefinately, wraping the screen until it hits either you, a crate or spikes. The entire game is designed to make you feel like you are in a loop without resorting to time travel. Thanks to the screen wrap effect on all entities in the game, in my eyes the theme is very loopy.</p>\n<p><strong>Graphics<br/></strong>The look and feel of the game was very much inspired by Bubble Bobble on the NES, which also featured a screen wrap effect to instead enable interesting combat oportinities. In Quivering, after finishing a level you'll be transported in a bubble, through a scrolling transition to the next level, much like in Bubble Bobble. I think this effect added something extra to make this game feel fresh.</p>\n<p><strong>Audio<br/></strong>All the sound effects were made during the jam, with a Zoom microphone. The weird string of notes serving as music in the background is my first song I've ever composed, done during the jam! (+ / - to change volume)</p>\n<p><strong>Humour<br/></strong>Humor was not in the forefront of my thoughts when designing this game, however I think this game posesses some charm that might bring a smile to your face.</p>\n<p><strong>Mood<br/></strong>As with many of my jam games, this game is on the surface a hybrid between more modern 2d platforming games, and old NES games. I humbly believe the art direction feels pretty concise.</p>\n<p><strong>Change Log</strong></p>\n<ul><li>Added a new level</li><li>Updated two levels to make sure they use the screen-wrap effect</li><li>Increased respawn and level change speed</li><li>Increased jump height</li><li>Changed window sprites to indicate they are background entities</li><li>Added Horizontal spikes</li></ul>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T09:28:20", "background_image": "https://media.rawg.io/media/screenshots/91f/91f7c1f703d03bc9cf06560c71a34acc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Saandy"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}