{"id": 809669, "slug": "anyone-online", "name": "Any.One Online", "name_original": "Any.One Online", "description": "-- Is Anyone Online? --\r\n<p><em>When you were still in high school, the only social MMO you ever consistently played was Any.One Online. With new virtual reality tech and user-created worlds, you and your friends used to spend hours exploring, dressing up your avatars, and meeting new people in the strange digital environment. But that was years ago: even though the servers are still running, Any.One Online is practically a virtual ghost town. For nostalgia's sake, however, you decide to log back in.</em><em> What you find is a surreal landscape only barely related to what you remember, a decade’s worth of unsupported code, scattered costumes, and the looming feeling that something's not right…</em><br/></p>\n<p>Made for the sixth Dream Diary Jam using RPG Maker 2003, Pixaki, and the YNFG template provided by the incredibly talented Clockwork Prince. Music by the equally talented Enonigmus, with a bonus track by voxelectrica. More detailed credits can be found in both the game proper and the readme.txt file.</p>\n<p><strong>-- WARNING: Game contains flashing lights and rapidly changing colors. Viewer discretion is advised. --</strong></p>\n\n\r\n-- Featuring --\r\n<ul><li>Nine unique areas to explore in the glitchy, abandoned virtual world of Any.One Online</li><li>Five different costumes to find that change your appearance, as well as seven collectible scattered tokens</li><li>Roughly thirty minutes of classic Yume Nikki gameplay, but where every effect is a speed effect</li><li>An original soundtrack to vibe with as you play and uncover some hidden secrets and silly references</li></ul>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T10:20:00", "background_image": "https://media.rawg.io/media/screenshots/c74/c74eb1a38203681ae4814370af56ef77.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Strung Up Starlight"], "genres": [], "publishers": [], "esrb_rating": null}