{"id": 809659, "slug": "knife-trip-throwing-knives", "name": "Knife Trip & Throwing Knives", "name_original": "Knife Trip & Throwing Knives", "description": "<p><strong>Knife Trip</strong> - is a simple, fun game with throwing knives at a target that will take you to the boss factory. Each opponent has unique mechanics and behavior, so to win you need accuracy in throwing knives and attentiveness with good reflexes to find your approach to each boss and win! Playing or winning, we will collect coins to buy new knives that serve not only for throwing, but also unlock new opponents. Each boss can be encountered in two knife throwing competitions. <br/></p>\n<p>The first one is <strong>«Knife Master»</strong>. All bosses are open at once, and they need to be defeated one by one, passing all levels while spending the minimum number of attempts and setting new records.\r\n  \r\nThe second is a <strong>«Knife vs Knife»</strong>. With all the bosses unlocked, you can have a short fight that serves as training for the main <strong>«Knife Master»</strong> path, and you can also get some coins and earn crowns that show your knife throwing prowess versus that opponent.  <br/></p>\n<p><strong>Knife Trip Game Features:<br/></strong><br/></p>\n<p><strong>• Knife Trip Game - is an easy-to-learn knife throwing game! </strong><br/></p>\n<p>• Knife Trip Game - these are unique bosses, battles with each of which take place in 10 stages, with their own mechanics for competition and setting records in throwing knives! <br/></p>\n<p><strong>• Knife Trip Game - is a nice graphics with the ability to customize to optimize the game process to make throwing knives more comfortable on your device!\r\nKnife Trip - Bosses: </strong><br/></p>\n<p>• Knife Hit Boss “Saw” - is a starting boss with saw tooth obstacles. It won't cause much trouble if you throw knives accurately. <br/>\n</p>\n<p><strong>• Knife Hit Boss \"Witch\" - an unpleasant person, to defeat which some accurate knife throws are not enough, you still need to collect the necessary ingredients for the potion.  </strong><br/></p>\n<p>• Knife Hit Boss \"Indian\" - a hippie, a man of peace and love, the main enemy here is not him, but a rainbow, throw knives more carefully! <br/>\n</p>\n<p><strong>• Knife Hit Boss \"Samurai\" - a cunning boss, when throwing a knife, you need to watch out for enemy knifes that may be hiding. </strong><br/>\n</p>\n<p>• Knife Hit Boss “Cyborg” - is a dangerous electric boss. When throwing knives, avoid hitting the electric spheres, which generate discharges and greatly complicate the battle. <br/>\n</p>\n<p><strong>• Knife Hit Boss “Cook” - is a strong boss and to win we throw knives accurately while collecting the right amount of milk, this is his weakness! </strong><br/>\n</p>\n<p>• Knife Hit Boss \"Mushroom\" - a bit crazy boss, defeating him will interfere with mushroom smoke, you need to be careful with where you throw knives. <br/>\n</p>\n<p><strong>• Knife Hit Boss \"Pirate\" - when fighting with him, try not to throw knives at the torches, or victory may elude you! </strong><br/>\n</p>\n<p>• Knife Hit Boss \"Clown\" - an evil clown with his tricks. Do not rush to throw knives, otherwise everything will quickly go wrong! <br/>\n</p>\n<p><strong>• Knife Hit Boss \"Sunny\" - \"Sweet\" sun is always very hot. When throwing knives at a target, watch carefully for its scions! </strong><br/>\n</p>\n<p>• Knife Hit Boss \"Biker\" - the main obstacle, in the form of a chain, can cause a lot of trouble, but throwing knives accurately, you can find a weak link in her! <br/>\n</p>\n<p><strong>• Knife Hit Boss \"Jedi\" - his strength in the ability to swap objects. Throw knives only when you are sure that the obstacle is safe!</strong></p>\n\n<p><strong>WARNING!!!</strong> Bosses can cause a lot of problems during the passage, and not everyone will be able to defeat them on the first, second, tenth attempt! ... in general, not immediately! The main thing is not to be nervous, not to freak out, but simply to stubbornly pump your knife throwing skill to go to victory, which after many attempts will definitely bring a lot of pleasure from realizing your superiority and skill! Forward to victories and new records!\r\n  <br/></p>\n\n<p><strong>Have Fun and Good Game!</strong><br/></p>\n\n<p>If you liked (or disliked for some reason) Knife Trip Game, please rate and leave a review to let me know. I will be happy to receive feedback to improve the content and play!\r\n  \r\n</p>\n\n<p><strong>Social Networks - Welcome!<br/></strong></p>\n\n<p>\r\nhttps://www.instagram.com/madpoint.games/ <br/></p>\n<p>https://www.instagram.com/madpoint.art/</p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T10:14:11", "background_image": "https://media.rawg.io/media/screenshots/78b/78bb3dd2784d950bd1b7a474c21c161d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MADPOINT"], "genres": ["Action"], "publishers": [], "esrb_rating": null}