{"id": 809666, "slug": "byte-the-bullet-itch", "name": "Byte the Bullet (itch)", "name_original": "Byte the Bullet (itch)", "description": "<p>Byte the Bullet is a lane-based bullet hell where you and your foes are equipped with Armor Creatures, virtual programs that can defend their user from real damages along with granting passive effects. In this game you play as a cheap robot sent by a company to an abandoned mine covered in railways to remove mysterious cyborg monsters from the tracks for further extraction of resources. There is no option but to complete your goal, if not for your survival then to stop the company of sending more of your kind into this deadly place.</p>\n<p>Try to keep in mind the speed of your bullets along with where the enemy is moving towards. Finishing up weaker enemies first will usually make stronger ones more manageable, although if you can hit a foe consistently then hit-stun can effectively nullify them.<br/></p>\n<p>On top of moving and shooting you are able to summon a shield that blocks all damage by spending a short time in a single rail then jumping to another rail, and you are also able to run by either pressing shift, insert, or enabling autorun in the settings. Learning how to work with these tools is crucial for properly dodging attacks. If you collect more than three armor creatures you can draw one from storage using right click when the storage meter is full.</p>\n<p>Please check the in-game manual for more detailed instructions on how to play along with other information like lore and a list of the effects of armor creatures. I also recommend taking a look at the settings, especially if you find the moving background and default brightness hard on the eyes.</p>\n<p>Don't be ashamed of respawning in the same wave or turning on half damage in settings if you find the game difficult, or alternatively turn on \"1-hit mode\" if you're looking for a challenge. </p>\n<p> In case you still crave more after you're done with the demo trying to speedrun the game might lead to the discovery of new strategies, so feel free to post your times in the comments, ideally with a screenshot of the victory screen (the one with the little message). Note that runs with respawns will have an asterisk next to the timer. \"1-hit mode\" runs should probably be judged separately due to the fact it increases armor creature drop rates.<br/></p>\n<p>Lastly, this is my first game, or at least the first one I actually uploaded, so please give feedback!</p>\n\n<p>Game along with code, game design, art and sound effects (except the accordion) were made by me!</p>\n<p>Music made by Bruhmoment8941 <br/></p>\n<p>Cover art made by Kvasir501</p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T10:18:44", "background_image": "https://media.rawg.io/media/screenshots/3db/3db3080fe7e7b171c565d1f44e67a80c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jao/Jesp"], "genres": ["Action"], "publishers": [], "esrb_rating": null}