{"id": 80965, "slug": "shanghai-mahjong-lite", "name": "Shanghai Mahjong Lite", "name_original": "Shanghai Mahjong Lite", "description": "★ WINNER \"BEST GAME\" 2009<br/>★ 3rd PLACE WINNER \"BEST APP EVER\" 2010<br/>\"Quite honestly, if you enjoy the game of Mahjong even a little bit, you’d be nuts not to buy this game. It’s the best mahjong available for the iPad or the iPhone\" — 148Apps<br/><br/>\"Shanghai Mahjong app is the best Mahjong app available on iTunes\" — slapapp.com<br/><br/>\"This is arguably the best digital version of the game I’ve ever played\" — macgamer.com<br/><br/>\"absolutely gorgeous!\" — gear diary<br/><br/>\"If you've been stuck trying to decide which mahjong solitaire game in the App Store will get you the most bang for your buck, it’s time to stop wracking your brain and give Shanghai a try.  It’s a gorgeous and über customizable version of the game you know and love\" — appadvice.com<br/><br/>\"With solid controls, a variety of game modes, and nearly endless customization via direct downloads, Shanghai Mahjong came away the winner in our Games category. — iLounge.com<br/><br/>\"13th Top iOS App of all time\" -  148Apps<br/><br/>\"You’d be seriously hard-pressed to find a nicer looking mahjong app than Shanghai\" — appsafari<br/><br/>Shanghai Mahjong, one of the most popular games of all time, returns in this definitive edition. Whether you play it on an iPad, iPhone or iPod Touch Shanghai looks stunning. Shanghai also fully supports the iPhone 4 Retina display<br/><br/>Pair tiles to dismantle intricate structures or try to predict the ever-changing matches in the unique Windstorm mode. <br/><br/>Shanghai's compelling animation, sound and one-tap access to an extensive online collection of high resolution artwork ensures the game will always stay fresh.", "metacritic": null, "released": "2008-08-28", "tba": false, "updated": "2019-08-02T03:52:26", "background_image": "https://media.rawg.io/media/screenshots/d00/d007e4f2ef86cf3ffff2f6b25e3b9738.jpg", "website": "http://www.mobileage.com/shanghai", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MobileAge"], "genres": ["Board Games", "Puzzle"], "publishers": ["MobileAge"], "esrb_rating": null}