{"id": 809794, "slug": "donkey-kong-jr-2", "name": "Donkey Kong JR", "name_original": "Donkey Kong JR", "description": "<p>Donkey Kong JR es un juego muy adictivo y entretenido.</p>\n<p> Salta a los cocodrilos, esquiva a los pájaros  y coge la llave para liberar al padre de Donkey Kong JR.</p>\n<p> Instrucciones del juego:</p>\n<p>- Toca los botones, para mover a Donkey Kong JR.\r\n  </p>\n<p>. Súbete a las lianas para esquivar a los cocodrilos, pero ten cuidado con los pájaros.\r\n  </p>\n<p>- Salta a los cocodrilos y baja de las lianas para que no te quiten una vida.\r\n  </p>\n<p>- Tienes que liberar a Donkey Kong Padre, para ello tienes que esquivar a los cocodrilos y a los pájaros bien subiendo a las lianas, saltando.\r\n  </p>\n<p>- Tienes una fruta que puedes lanzar, saltando y conseguir más puntuación y eliminar a los cocodrilos y Pájaros.\r\n  </p>\n<p>- Para liberar a Donkey Kong padre, tendrás que coger la llave y así sucesivamente cuatro veces, para ello tendrás que saltar a por la llave, pero no saltes a lo loco, porque te puedes caer.\r\n  </p>\n<p>- Una vez consigas una llave, la parte liberada de la jaula empezara a parpadear y así cuatro veces, cuando consigas liberar al padre de Donkey Kong JR, todo volverá a empezar.\r\n  </p>\n<p>- Para saltar a por la llave deberás tocar los botones (salto y la botón izquierdo, en Windows  y MacOS (Barra de espacio y tecla de dirección izquierda).\r\n  </p>\n<p>MODO A:\r\n  </p>\n<p>Lento y fácil.   </p>\n<p>MODO B:\r\n  </p>\n<p>Rápido y Difícil. </p>\n<p>Características del juego:\r\n  </p>\n<p>- Dos modos de juego.\r\n  </p>\n<p>- En los sistemas operativos Windows &amp; MacOS, puedes utilizar las teclas de dirección y para saltar la barra de espacio.\r\n  </p>\n<p>- Tres vidas.\r\n  </p>\n<p>- Reiniciar el juego.\r\n  </p>\n<p>- Puntuación alta guardada en ambos modos.\r\n  </p>\n<p>- Botón de salida.\r\n  </p>\n<p>- Juego de acción con emocionantes sonidos y animaciones.\r\n</p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T11:10:42", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b8605e7a9db6222565b3ba13836bb02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Neda Games"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}