{"id": 80984, "slug": "glory-of-generals-pacific-war", "name": "Glory of Generals: Pacific War", "name_original": "Glory of Generals: Pacific War", "description": "Commander！<br/> Over 64 campaigns in 4 battlefields are waiting for your challenge.<br/> 105 world famous generals will participate in this war with you.<br/> Over 300 real and rich terrains will influence your strategies.<br/><br/> Player needs to make adequate use of battlefield terrains and defense facilities as well as expertise of each unit to win advantage. <br/> Cutting retreat route or encircling enemy will bring great change to battlefield situation. <br/> How to smartly deploy land, naval and air force to seize opponent's key strongholds is a question lingering in player's mind.<br/><br/> Accumulation of Medals achieved through battles guides your way from soldier to marshal.<br/> Upgrade of military facilities in the headquarters will offer essential supply in the war.<br/> Recruit other officers to strengthen force. It's important to take advantage of each officer's expertise.<br/> Armoured troop commanded by General Rommel or naval troop by Nimitz will have maximum performance.<br/><br/> Player can instruct any officer and his troop in battlefield to battle freely.<br/><br/> Support online multiplayer mode. Player can compete with real friends through Wifi and Bluetooth or global players through Game Center. <br/> Adoption of Auto-matching tech will greatly improve chances of finding the opponent.<br/><br/> 3 levels of tutorial can ensure your quick learning of game basics.<br/><br/><br/>##Feature##<br/><br/> -Campaign Mode-<br/> Pacific War<br/> Axis Powers（1941.7 - 1945.1）<br/> Allied Forces（1942.5 - 1945.10）<br/><br/> Far Eastern War<br/> Axis Powers（1937.7 - 1941.12）<br/> Allied Forces（1937.8- 1945.8）<br/><br/> Korean War<br/> WTO（1950.1 - 1953.1）<br/> NATO（1950.1 - 1953.4）<br/><br/> Middle East War<br/> WTO（1955.7 - ???）<br/> NATO（1955.9 - ???）<br/><br/> -35 Legion Mode campaigns<br/> -105 world class generals participated<br/> -146 military units available<br/> -37 countries involved in the war<br/> -36 tactical instructions<br/> -Support Game Center and Wi-Fi link battle<br/> -16 military ranks, 4 general assistants.<br/> -Over 300 real terrains.<br/> -Upgrade 6 military facilities in the headquarters<br/> -Map Zoom In/Out<br/> -Auto save function<br/> ...<br/><br/>If you found your game's language is wrong, please set your device to English, and set it back to your language.", "metacritic": null, "released": "2013-09-14", "tba": false, "updated": "2019-07-30T08:44:39", "background_image": "https://media.rawg.io/media/screenshots/eea/eea918a6b6ba94dfb3da9514a7cd280d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EASY"], "genres": ["Strategy", "Simulation"], "publishers": ["zhang yue"], "esrb_rating": "Everyone 10+"}