{"id": 809827, "slug": "nvrwlk", "name": "NVRWLK", "name_original": "NVRWLK", "description": "<p><em>Are you ready to swing?</em></p>\n<p>Swing on the ropes and see how far can you go.<br/>There is no explicit goal in the game. Try going as far as you can or as fast as you can or learn to make precise jumps!</p>\n<p>If you fall down or get stuck, restart from the main menu.</p>\n<p>Notes:<br/>Do not use the hook button (LMB) while you are on a regular rope. It will make you drop down. It is a bug and will be fixed. Only use the hook button in mid-air when in proximity of a hook point.<br/>There are a few nasty bugs with how hooks behave. They will be fixed in a post-jam update when uploads are unlocked. Among other things, a hook point will falslely visually signify a possible connection if you approach it from above. In actuality, you can only connect to it if you are lower than it is!</p>\n<p>Controls:<br/></p>\n<p>WASD - Swing, steer<br/>Mouse - Look around<br/>Space - Jump (double jump in mid-air)<br/>LMB - Hook (for big carabiners with orange circles appearing around them. Hold to connect, release to let go)</p>\n<p>Gamepad input works too! For XBOX controllers:<br/>Left Thumbstick - Swing, steer<br/>Right Thumbstick - Look around<br/>A - Jump<br/>Right trigger - Hook<br/></p>\n<p>Soundtrack on Bandcamp: https://lqfp.bandcamp.com/track/swang-song-nwrwlk-official-ost</p>\n<p>Team: <br/>Dito Seregin: https://twitter.com/terzalo<br/>Nick Shikhachevskiy: https://www.instagram.com/lqfp_post/<br/></p>\n<p>Third-party attributions are listed on game's credits page.</p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T11:24:23", "background_image": "https://media.rawg.io/media/screenshots/b62/b62d967fcaefdaf6134358fd71f32427.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dito Seregin"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}