{"id": 809823, "slug": "as-night-falls", "name": "As Night Falls", "name_original": "As Night Falls", "description": "<p>A Game made by Brad Padgett, Kirby Key, Macey McCuller, Sarah Marek, and Vy Pham.</p><p><strong>How did you use Houdini to make your game?</strong> </p>\n<p>We created a hexagonal level generator tool that allows the user to paint in biomes and elevation, and used that to spawn in geometry and unreal blueprint instances in our project. The landscape was all done in Houdini. In addition, the trees and rocks were done in Houdini, and we also used Houdini to quickly UV unwrap some of our other assets.</p>\n\n<p><strong>List everything that was made before the jam. Pre-built, assets, textures, etc.</strong></p>\n<p>The only thing we didn't make were some of the sound effects used in the game. We found them on freesound.org. Everything else (including the music, art, assets, textures, and gameplay) was created during the jam</p>\n<p><strong>Which game engine or platform did you use to make your game?</strong>\r\nUnreal Engine 5</p>\n<p><strong>Besides Houdini, what other tools did you use to make your game?</strong> Autodesk Maya for the buildings and creatures, Substance Painter and Designer for the textures, Beepbox for the music, Photoshop for the UI and Concept Art.</p>\n<p><strong>List instructions and tips for playing your game here.</strong> </p>\n<p>Your objective: survive the night. Throughout the day you can gather resources and build helpful and defensive buildings to prepare for night. As night falls, hungry monsters start looking for a snack. Can you survive the night and make it to a new dawn?<br/>-Move with WASD<br/>-Build with Shift and Scroll Wheel<br/>-F Zooms in and Out <br/>-Use Space to Pick Up Resources from your buildings and any resources you may find on the ground</p>", "metacritic": null, "released": "2022-06-25", "tba": false, "updated": "2022-06-27T11:22:36", "background_image": "https://media.rawg.io/media/screenshots/4e0/4e0cc766ad60cb02a74bf50afdcd04dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MacMcColor"], "genres": [], "publishers": [], "esrb_rating": null}