{"id": 809947, "slug": "clube-das-senhorinhas-en", "name": "Clube das Senhorinhas [EN]", "name_original": "Clube das Senhorinhas [EN]", "description": "<p><strong>STORY</strong><br/></p>\n<p><em>Clube das Senhorinhas </em>(Little Ladies' Club) is a nice rest house placed in Brazil, aimed for old people to relax and have a good time.  They got everything you need - from lodging to medical support to a great variety of classes and games to choose from.</p>\n<p>You are Susan, a 60 year old lady that was invited by your  friend Eunice to play domino at this same rest house. You may think that passing the time with strangers may not help you with the struggles of daily life, but maybe those small talks can be more meaningful than you realize.</p>\n<p>Follow Susan into a journey of rediscovering her own worth, guided by wisdom, tears and cuteness! <br/></p>\n\n<p><strong>FEATURES</strong></p>\n<p>- Main character and love interests all 60+ years old!</p>\n<p>-<em> Replay Factor</em>: each time you play the game, it'll have<strong> new</strong> options of dialogue to choose from! So you can play the same route, <em>twice</em>, and still get new lines of dialogue to read! <em>(also, there's a bingo game where you can WIN or LOSE!!! depending on LUCK!!!!!!)</em><br/></p>\n<p>- Two platonic love interests (Sidney and Bernadette) and one FRIENDSHIP route (Eunice)!</p>\n<p>- 3 good endings and one bad ending!<em> (that is basically the same option every route so don't worry about getting a \"bad ending\" for choosing the \"wrong dialogue options\". there's not such a thing here. choose whatever you want, EXPLORE THE POSSIBILITIES!!!)</em></p>\n<p>- Playtime around 1-2 hours per route!</p>\n<p>- 2 CGs per route! <em>(yeah, even the friendship one! BECAUSE FRIENDSHIP IS COOL AND IMPORTANT!!!!!!!!!!!! HECK YEAH!!!!!!!!)</em></p>\n\n\n<p><strong>WARNINGS</strong></p>\n<p>- Mention of death, curse words, family arguing, mention of religion.</p>\n<p>- Bernadette's route is a bit longer than the other ones. She is LOUD, I just can't control it.<br/></p>\n\n<p><strong>CREDITS</strong></p>\n<p>- Art, story, programming, GUI: Helen (@lenlen403)</p>\n<p>- Music: Pixabay Music Library (Music_For_Videos, AudioCoffe, chillmore, ZakharValaha, Lesfm, Coma-Media, MarumachiMusic, MadIRFAN)<br/></p>\n<p>- Rain sound effect: envatoelements<br/></p>\n\n<p>Made for Otome Jam 2022!!<br/></p>\n<p>## I may translate this game to Brazilian Portuguese after the jam. MAS NÃO PROMETO NADA<br/><br/></p>", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T12:12:15", "background_image": "https://media.rawg.io/media/screenshots/101/10155def422cc4ee05c4b7323d06ea17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Helen"], "genres": [], "publishers": [], "esrb_rating": null}