{"id": 80999, "slug": "european-war-lite-for-ipad", "name": "European War Lite for iPad", "name_original": "European War Lite for iPad", "description": "European War for iPad(musket &amp; artillery) is a new style strategy game for iPad. It takes you to battleground Europe during the eighteenth century and nineteenth century. In this game many tactics been used in order to defeat the other forces. You can select six empires: British, French, Ottoman, Russia, Germany and Austro-Hungary in this age. If your army conquest enemy’s territory your total tax revenue will be improved. You would get all of the empire’s Territories and improve yourself total tax revenue after your army conquered enemy’s Capital. Tax can be used to purchase cards (Draft Card, General Card, Marshal Card, Ship Card, Fortress Card, Cannon Fire Card.) <br/><br/>FEATURES: <br/>-Include five difficulty levels. -Include 6 common cards and 6 empire‘s special cards. <br/>-Include two mode: CONQUEST MODE and BATTLE MODE. <br/>-CONQUEST MODE: select one of the six empires to defeat other empires. <br/>-BATTLE MODE: select six campaigns (Battle of Toulon (1793), Battle of Marengo (1800), Battle of Austerlitz (1805), Battle of Tannenberg (1914), Battle of Galicia (1914), Battle of Gallipoli (1914)) . <br/>-72 Territories (include sea and capital) every territory has its taxation. <br/>-Extend risk style battle mode (easy, various and interesting). <br/><br/>Comfortable operation makes you play this game easier and have more fun. We will update it by adding many campaigns in the latest version as soon as possible.", "metacritic": null, "released": "2010-11-12", "tba": false, "updated": "2019-07-30T08:47:56", "background_image": "https://media.rawg.io/media/screenshots/90c/90cf19498d01248fd8a3934c7f329190.jpg", "website": "http://www.ieasytech.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["EASY"], "genres": ["Strategy", "Board Games"], "publishers": ["zhang yue"], "esrb_rating": "Everyone 10+"}