{"id": 809971, "slug": "zentsu-cambio-de-mundos", "name": "Zentsu: Cambio de mundos", "name_original": "Zentsu: Cambio de mundos", "description": "<p><strong>Integrante:</strong> Jesús Tume</p>\n\n<ul><li><strong>Historia:  </strong></li></ul>\n<p>En el año 113 inicia una guerra entre los Ángeles y Demonios, a causa de que Marek, el Rey de los demonios, quería obtener el Zent, un objeto creado por el Dios Supremo, el cual daba energía a los seres vivos del planeta tierra.\r\n \r\nAsí que para impedir que Marek obtenga los poderes del Zent, el Dios Supremo divide el objeto en 10 fragmentos y los envía a distintos lugares de la Tierra. </p>\n\n<p>Seguido de eso, sella los poderes de Marek y lo encadena en lo más profundo del infierno, dando fin a la guerra, 10 años después de ese suceso un grupo de amigos encuentra un fragmento del Zent obteniendo así poderes elementales. </p>\n\n<p>Año 166, transcurren 53 años… Y en un pequeño pueblo, alejado de la ciudad, tenemos al pequeño de 10 años Hikari Tanaka dirigiéndose a sus clases de Kendo, pero al perder el duelo con su profesor, se va a una montaña alejada del pueblo a entrenar, hasta que se hace de noche y es hora de regresar al pueblo, pero al llegar… se da con la sorpresa de encontrar el pueblo destruido y los habitantes asesinados.</p>\n\n<p>Así que se adentra en el pueblo y encuentra a su maestro de Kendo agonizando, este le dice que el responsable de esto fue un monstruo y que aún estaba en el pueblo.\r\n \r\nEs ahí cuando el “monstruo” aparece en la escena y golpea fuertemente a Hikari, haciéndolo caer en una casa en llamas, pero la sorpresa de todos fue que, a pesar de estar en el fuego, Hikari no se veía afectado y mostraba signos de dolor, por lo que el “monstruo” se preocupó y fue corriendo hacia donde estaba el para dar fin a su vida. </p>\n\n<p>Pero en ese momento una persona misteriosa aparece y asesina al “monstruo” salvando a Hikari, esta persona se presenta como Koichi Chikara, un gran maestro especializado en todo tipo de combate, explicándole que quien casi lo asesina no era un monstruo sino un demonio, y lo que buscaba era lo que se encontraba dentro de él, dejando confundido al niño.</p>\n\n<ul><li><strong>Concepto: </strong></li></ul>\n<p>Juego de plataforma, donde cambias continuamente de mundo.</p>\n\n<ul><li><strong>Sustentación de motor: </strong> </li></ul>\n<p>Elegimos RPG MAKER , el editor puede ser instalable en Windows, Linux y en MAC, los juegos completos ya se pueden jugar en MAC, dispositivos móviles, vía web, Nintendo Switch y PlayStation. Así mismo en la versión más recién la cual tiene por nombre RPG MAKER MZ, cuenta con una función de auto guardado y también incluye el sistema Effekseer.</p>\n\n<ul><li><strong>Mecánicas y Controles:</strong></li></ul>\n<p>Te podrás mover utilizando la combinación de teclas “A, S, D, W”, podrá abrir un inventario utilizando la letra “E”, así mismo podrás utilizar habilidades características de cada personaje con las teclas “F, G, H” y un ataque definitivo con “X”</p>\n<p> \r\n  </p>\n<p>Utiliza tus habilidades de elementos para combatir y derrotar a tus enemigos. Tu victoria dependerá de la diferencia de nivel entre tu personaje y el contrario, un ejemplo, si tu estas en nivel 10 y el enemigo esta en nivel 25 será muy fácil para el acabar contigo si es que no utilizas una buena estrategia.\r\n</p>\n\n<ul><li><strong>Publico dirigido:</strong></li></ul>\n<p> \r\n  Zentsu está dirigido para el publico juvenil ya que no es un juego donde se llegue a expresar abiertamente la violencia o la sangre, es un videojuego cuyas mecánicas no son tan complicadas de comprender y donde ofrecemos una interfaz agradable al espectador, así mismo no existe la competitividad.</p>", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T12:23:07", "background_image": "https://media.rawg.io/media/screenshots/055/05521d2c8e82beeaafb8afae7a717bfa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JeXuXz"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}