{"id": 809912, "slug": "samurai-riot-definitive-edition", "name": "Samurai Riot Definitive Edition", "name_original": "Samurai Riot Definitive Edition", "description": "<p>Samurai Riot is a 2D co-op Beat ‘Em Up game with a twist! Play as Sukane or Tsuruamaru, two charismatic warriors torn between their duty and their beliefs, and follow your own path of Honor to one of 8 unique endings.</p>\n<p>A Unique Cooperative System<br />\nThe co-op system evaluates and rewards you based on how well you are working together.<br />\nCoordinate your attacks with your partner and fill up the central gauge to unleash the most powerful attack in Samurai Riot: The Co-op Special Move!<br />\n8 different endings<br />\nDifficult moral choices: would you rather burn an entire village to the ground or maintain your conscience at risk of losing the war? Any decision you make will greatly impact your story.<br />\nFollow the same path as a team or disagree and battle it out in a PvP fight!<br />\nStrong replay value<br />\nBranching Storyline: explore multiple playthroughs to unlock the whole story of Samurai Riot!<br />\nFighting Schools: the more you play, the more fighting schools you can unlock. Each new school unlocks new gameplay options and greater specialisation.<br />\nFight with style<br />\nCharacters: discover two strong and highly skilled heroes that offer unique gameplay and deadly attacks, plus a bunch of vicious enemies to fight against.<br />\nControls: staying true to arcade games history, we created very intuitive controls, enjoyable with any controller or joystick. We want the gameplay to be completely flexible, suitable for any player.<br />\nSpeed-running Friendly<br />\nOn Your Marks, Get Set, Go! Find all the tools you need for a perfect speed-run, including time ranking and score ranking.</p>", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2022-06-27T12:00:59", "background_image": "https://media.rawg.io/media/screenshots/08f/08f774503c473648566bb900f6569b6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wako Factory"], "genres": ["Action"], "publishers": ["Hound Picked Games"], "esrb_rating": null}