{"id": 810017, "slug": "six-legends", "name": "Six Legends", "name_original": "Six Legends", "description": "<strong>Six Legends</strong>\r\nis a character-driven story, about six young dragons discovering the world around them, and themselves.\r\n\r\nIn Short\r\n<p>Alternate between explorative <strong>point-&amp;-click</strong> gameplay,<strong> Visual Novel</strong> inspired dialogs and choice system, and varied <strong>minigames</strong>, as you control each of the six protagonists, as they live through a life changing story!</p>\n<p>Growing up can already be a tough burden, but for these dragons, they have it much worse. Famine and the threat of extinction loom over their heads, but this won't stop them from being the best dragons they can be as they take this challenge head on! The fate of their elders rests on their shoulders, but that heavy weight won't stop them from learning and growing as people.</p>\n<ul><li>Compelling and loveable characters</li><li>Explore a light fantasy world and its civilizations</li><li>Hours of cute and unique story</li><li>Meet and play as six dragons</li><li>Friendship, Love, War and Hate</li></ul>\n<p>Developed by one person, with the help of an artist character designer, Six Legends is an independant passion project. </p>\n<p>Follow us on Twitter : @SixLegendsGame</p>\r\nAlpha Demo\r\n<p><em>This version is a demo of the alpha version. We believe the game has matured enough to hear what the players can have to say about the game before its release. As such, some bugs are expected, and some content is missing.</em></p>\n<p><em>However, we want to make extra sure <strong>Your save file will be compatible with future versions.</strong></em></p>\n<p><em>Six Legends has been in development for quite some time and is still in semi-active development ; I work on it in my free time, but I intend to get it to see completion.</em><br/></p>\n<p>With<strong> a prologue and 2 chapters</strong> <strong>available </strong>in this demo, and 14 chapters currently developed, the game aims at a cozy 17-18 chapters.</p>", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T12:39:47", "background_image": "https://media.rawg.io/media/screenshots/14f/14fe35cbe4ea11c2e298caa3c36f8ae8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Vincent Paquin"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}