{"id": 810086, "slug": "mirror-mine", "name": "mirror mine", "name_original": "mirror mine", "description": "<p>Ten years ago you went missing.</p>\n<p>It was a normal day. You woke up, had breakfast with your roommate and left shortly after for a full day of college classes and errands, only to never return home that afternoon.</p>\n<p>Ten years ago you fell through a blip in time. Today you show up on your mother's doorstep, unaged and unaware of the time you lost</p>\n<p><em><strong>Mirror Mine </strong></em>is a sci-fi work-in-progress interactive fiction with certain elements of horror. It is rated 18+ for graphic content.</p><p><strong>FAQ</strong><br/></p>\n\n<ul><li>Fully customisable MC\r\n</li><li>Three possible romanceable characters\r\n</li><li>Solve the mystery of what happened to you\r\n</li><li>Make crucial decisions that will affect the story\r\n</li><li>Learn the ins and outs of time travel\r\n</li><li>Take back the life that was stolen from you\r\n</li></ul>\n\n<ol><li><strong>Grayson Donohue - 32, M, RO</strong>. Your childhood best friend and college roommate. Now a detective. Passionate, intelligent and determined; he's dedicated the past ten years of his life to finding you. He dropped out of college and quit his pursuit of a business degree, joining the police force instead. Despite having not seen him in a decade, the only difference you notice about him is that he's older. He's still the same man you always knew and he loves you more than ever.\r\n</li><li><strong>Kennedy Rose - 34, F, RO.</strong> Your tutor turned professor. Your relationship was somewhat complicated; neither of you liked the other and yet you were forced to spend time together. However, two years spent in each other's company had you two becoming somewhat fond of each other. Something someone might call friends. After your disappearance, she was distraught, soon coming to regret ever growing close to you. She closed herself off, becoming cold, hard and aloof. It's going to take a lot to gain her trust back, and even more for her friendship.\r\n</li><li><strong>Alex Colwell - 32  F/M, RO</strong>. An old friend of yours. You were close friends in middle school and you dated on and off throughout high school. You thought they were it. The one. Until they moved away after graduation and you decided to break up.  Now they're back, spurred into action by the news of your disappearance. Will you rekindle and rebuild the love you two once had or will you distance yourself from them further?\r\n</li><li><strong>Kelsey Montgomery - 39, F</strong>. Grayson's work partner. You don't know much about her and you're not sure you want to. She has her suspicions about you. She doesn't believe your story. Decide if she can be trusted to help you or if she deserves to be left in the dark. \r\n</li><li><strong>Nora &amp; Callie - 54 &amp; 26, F &amp; NB</strong>. Your mother and sibling. They were both devastated by your disappearance but they never gave up hope of your return. While still curious about what happened to you, they mostly just care that you're safe and back home where you belong. Although... <em>are you really all that safe</em>?\r\n</li><li><strong>Demetri Renfield - 58, M</strong>. Your estranged father. He left when you were twelve and you hadn't seen or heard from him since. Now he shows up a day after your return and you have your own suspicions about him. Certain elements of his story aren't adding up and his timing is a little more than coincidental. Can you really trust him?</li></ol>\n<p>Twine UI template by cerberus</p>", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T13:10:52", "background_image": "https://media.rawg.io/media/screenshots/a38/a38c2adf22c34597de66dc4d5b8b472d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["alli"], "genres": [], "publishers": [], "esrb_rating": null}