{"id": 810018, "slug": "planet-finder-gaetan-piou", "name": "Planet Finder (Gaëtan Piou)", "name_original": "Planet Finder (Gaëtan Piou)", "description": "English\r\n<p>THIS PROJECT IS ONLY IN FRENCH</p>\n<p>This project was made for a Game Design exam in LUDUS Académie. We had to develop a prototype for a serious game to popularize one or many concepts around astronomy or astrophysics. I personally chose to work on Exobiology and the conditions of life on a planet.</p>\n<p>In this game, you have to explore the galaxy in order to find a new planet for the humanity after the Earth has become uninhabitable. Travel through different stellar systems, send probes on a planet to check if the conditions for life to flourish are met and choose a destination for humanity.<br/></p>\r\nHow to play<p>Use the arrow keys or the arrows on the screen to maneuver your ship and touch/click on the buttons on the upper right side of the screen to choose a tool to use.<br/>When approaching a planet, use the \"Explorer\" button to send a probe which will come back after a certain amount of time with some informations about the planet it visited. You can also use the \"S'installer\" button to land on the planet and let the humans settle on it and end the game.</p>\r\nFrançais\r\n<p>Ce projet a été réalisé dans le cadre d'un examen de Game Design au sein de LUDUS Académie. Nous devions réaliser un prototype de serious game dans le but de vulgariser un ou plusieurs concepts autour de l'astronomie ou de l'astrophysique. Pour ma part, j'ai décidé de partir sur l'Exobiologie et les conditions à l'apparition de la vie.</p>\n<p>Dans ce jeu, vous devez explorer la galaxie afin de trouver une nouuvelle planète pour abriter l'humanité après que la Terre soit devenue inhabitable. Traversez plusieurs systèmes stellaires, envoyez des sondes sur une planète afin de vérifier si les conditions pour que la vie puisse s'y épanouir sont remplies et choisissez une destination pour l'humanité.</p>Comment jouer\r\n<p>Contrôlez votre vaisseau à l'aide des touches directionnelles du clavier ou des flèches à l'écran. Appuyez sur les boutons en haut à droite de l'écran afin d'utiliser les différents outils du vaisseau.<br/>Lorsque vous êtes proche de la planète autour de laquelle vous orbitez, appuyez sur le bouton \"Explorer\" afin d'envoyer une sur la planète qui reviendra quelque temps plus tard avec des informations sur la planète visitée. Vous pouvez également appuyer sur le bouton \"S'installer\" afin d'attérir sur la planète et de laisser l'humanité s'y installer et ainsi terminer votre partie.<br/></p>\n\r\nCredits\r\n<ul><li>Game Design and Programming : Gaëtan PIOU</li><li>Musics by Philippe-Albert LEBLANC</li></ul>", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2022-06-27T12:40:08", "background_image": "https://media.rawg.io/media/screenshots/a99/a999a798623d4c3730b565763848624c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gaëtan Piou"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}