{"id": 810282, "slug": "tongari-boushi-to-oshare-na-mahou-tsukai", "name": "Tongari Boushi to Oshare na Mahou Tsukai", "name_original": "Tongari Boushi to Oshare na Mahou Tsukai", "description": "<h2>*Tongari Boushi to Oshare na Mahou Tsukai (とんがりボウシとおしゃれな魔法使い lit. &quot;Pointy hats and the Stylish Wizard&quot;) is a fantasy-adventure and life-simulation game developed and published by Konami and released for the Nintendo DS on December 10th, 2011 in Japan only. It is the third entry of the Magician&#39;s Quest series.</h2>\n<p>&#39;Tongari Boushi to Oshare na Mahou Tsukai&#39; has elements that focuses on fashion, as well as idol work. Players can enjoy a fascinating mixture of fashion, magic and school while spending countless hours in the enchanted world. Encounter and socialize with 140 students, as well as a multitude of tutors and shopkeepers, to help set the stage and make it your very own.</p>\n<p>On top of that, most content that was added in the previous two entries have now made their way onto the latest installment, including many more gimmicks to compare and play with! Complete your personal collections, organize the neighbourhood, and cast spells to either cause mischief or develop your homely surroundings.</p>\n<p>(*Source of Description - &#39;Magician&#39;s Quest Fandom Wiki&#39;; &#39;Tongari Boushi to Oshare na Mahou Tsukai&#39;)</p>", "metacritic": null, "released": "2010-12-10", "tba": false, "updated": "2022-06-28T01:47:40", "background_image": "https://media.rawg.io/media/screenshots/1cf/1cfc78d7fffd92a34e190c2415b77158.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 3, "reviews_count": 0, "platforms": ["Nintendo DS"], "developers": ["Konami Digital Entertainment"], "genres": ["Adventure", "Simulation"], "publishers": ["Konami"], "esrb_rating": null}