{"id": 81025, "slug": "bridge-constructor-free", "name": "Bridge Constructor FREE", "name_original": "Bridge Constructor FREE", "description": "+++ Now over 30 million players worldwide +++  <br/>+++ Latest update with help function and refined grid system +++ <br/>+++ Number 1 in the games charts for iPad &amp; iPhone in 33 countries +++               <br/><br/>In Bridge Constructor you have to prove yourself as an accomplished master bridge builder. Play 40 different levels, and build bridges over deep valleys, canals, and rivers. Stress tests reveal whether the bridge you build can withstand the daily stress of continual use from cars, trucks and, more recently, super-heavy tank trucks. <br/><br/>You can choose between a range of materials for each individual bridge, such as wood, steel, cables, or concrete pillars. Use the appropriate materials and stay within budget to build the perfect bridge. The choice of different materials means that there are numerous solutions and approaches and you can build each bridge in any number of ways – your budget is the only limit. The refined grid system allows you to realize your idea of the perfect bridge with even more precision. Let your imagination and creativity run free! And if you happen to run into a dead end, you can pick up valuable tips from the brand new help system! <br/><br/><br/>FEATURES: <br/>• 40 Levels on the island nation of Camatuga (Full Version)<br/>• Free build mode and help system <br/>• 5 Settings: city, canyon, beach, mountains, hills <br/>• Improved grid system <br/>• Map with unlocked worlds/levels <br/>• 4 different building materials: wood, steel, cables, concrete pillars <br/>• Color coded load indicator for different building materials <br/>• Three different load bearing levels: car, truck and tank truck <br/>• High score per level <br/>• Facebook connection (upload screenshots and bridge scores)", "metacritic": null, "released": "2012-05-23", "tba": false, "updated": "2019-07-30T07:22:29", "background_image": "https://media.rawg.io/media/screenshots/538/538218109451c23a004ca1ce5f7adeba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "iOS", "Android"], "developers": ["Headup Games", "ClockStone STUDIO"], "genres": ["Simulation", "Puzzle"], "publishers": ["Headup Games"], "esrb_rating": "Everyone 10+"}