{"id": 810288, "slug": "harvestella", "name": "Harvestella", "name_original": "Harvestella", "description": "<p>In a vibrant and colourful world, players will tend their crops, befriend the townsfolk, overcome threats, discover the origins of the world and the truth behind the calamity along the way.</p>\n<p>The story begins when the player wakes up in the middle of &quot;Quietus,&quot; a calamity that comes with each change of season and threatens all life.</p>\n<p>&quot;Quietus&quot;<br />\nA season of death that comes at the turn of each season. Crops wither and the dust of death prevents people from even walking outside. It is said that the duration of Quietus is getting longer each year.</p>\n<p>&quot;World&quot;<br />\nPlayers will be able to explore the various cities and dungeons of the world: &quot;Nemea Town,&quot; where cherry blossoms bloom all year round, &quot;Seaside Town Shatolla,&quot; with a lively bar scene, &quot;Lethe Village,&quot; with its beautiful colors of the four seasons, and the snow-covered &quot;Holy Capital Argene.&quot; In order for players to reach the &quot;Seaslight,&quot; the four giant crystals that govern the seasons, they must cross a beautiful yet rugged path.</p>\n<p>&quot;Daily Life&quot;<br />\nVegetables, grains, and fruits can be grown on fields and shipped for money or used as crafting materials. They can also be used for cooking, where recipes can have the effect of recovering HP or temporarily increasing stats, which will be useful while on adventures. At home, players take care of their animals: the round bird &quot;Cluffowl,&quot; the dignified goat &quot;Woolum,&quot; and their pet &quot;Totokaku,&quot; which may lead to nice rewards.</p>\n<p>&quot;Comrades&quot;<br />\nPlayers will encounter new friends, such as &quot;Shrika,&quot; a missionary in search of a new faith, &quot;Heine,&quot; a flirtatious and handsome mechanic, &quot;Asyl,&quot; a descendant of the Wind Readers, and &quot;Aria,&quot; a mysterious girl who says she has come from the future. By facing their problems and their different ways of life, you will gain a better understanding of your allies.</p>\n<p>&quot;Combat&quot;<br />\nDuring battle, switch instantly between a wide variety of jobs, like the &quot;Fighter,&quot; who unleashes quick sword techniques, the &quot;Shadow Walker,&quot; who deals lethal blows with twin swords, or the &quot;Mage,&quot; who specializes in magic attacks, to be victorious. Take on strong enemies by targeting their weak points and then eliminate them with a powerful Double Break attack.</p>", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2023-10-31T13:24:23", "background_image": "https://media.rawg.io/media/games/17e/17e053e6451dd18c3e69d4531f989156.jpg", "website": "", "rating": 3.67, "rating_top": 4, "added_by_status": {"yet": 14, "owned": 27, "beaten": 4, "toplay": 39, "dropped": 5, "playing": 2}, "playtime": 5, "achievements_count": 37, "ratings_count": 5, "suggestions_count": 351, "game_series_count": 0, "reviews_count": 6, "platforms": ["PC", "Nintendo Switch"], "developers": ["Square Enix"], "genres": ["Action", "RPG", "Simulation"], "publishers": ["Square Enix"], "esrb_rating": null}