{"id": 8102, "slug": "pocket-farm", "name": "Pocket Farm", "name_original": "Pocket Farm", "description": "Pocket Farm is the farming game you have all been waiting for on the iPhone! Unlike other farming games this one doesn&amp;#39;t require you to buy additional points or virtual items after you&amp;#39;ve already paid for the game!  Pocket Farm is not a clone, it&amp;#39;s a unique experience you won&amp;#39;t find in other farming games.<br/><br/>You&amp;#39;ve probably heard about the farming phenomenon on Facebook and wished you could play it anywhere.  Now you can build your farms wherever you go!  Pocket Farm is a casual sandbox game that lets you build farms at your own pace and sell your harvest in a fun mini-game.<br/><br/>With only a shovel and a handful of seeds, build your farm from the ground up into a money making business.   Buy fields, fences, a barn, tractor, pond, and a variety of animals.   Place them where you want to design your farm the way you like it.  Water the crops from your pond, or use a tractor to  plow all the fields at once.<br/><br/>When you&amp;#39;ve harvested enough vegetables that are in demand, head to the market where you&amp;#39;ll have to pack customer&amp;#39;s baskets with vegetables without letting them fall off the conveyor belt.  Fill adjacent baskets to chain them together and collect bonus multipliers to earn the most cash!<br/><br/>This extremely addicting combination of harvesting and selling will keep your fingers moving and brain entertained!<br/>It&amp;#39;s two games in one!<br/><br/>Best of all it&amp;#39;s under 10 megs so you can download it directly to your phone without a computer!  So what are you waiting for?  Get farming TODAY!<br/><br/>FEATURES<br/>- Addictive gameplay for all ages!<br/>- Built in help and gameplay tips<br/>- Zoom in and out of your farm<br/>- Cute and zany graphics<br/>- 40 Levels<br/>- 8 musical tracks<br/><br/>TRAILER<br/>Please watch the trailer at http://tinyurl.com/PocketFarm (YouTube video)<br/><br/><br/>NEWS<br/>A lite version is now available.  Search for &amp;quot;Pocket Farm Lite&amp;quot;.<br/><br/>REVIEWS<br/>iphoneapps-review.com<br/>&amp;quot;I really enjoyed this game, its simplistic nature is very soothing. I don&amp;#39;t know what it is but this game really appeals to me. I&amp;#39;ve never wanted to be a farmer or anything, so it&amp;#39;s kind of strange that I enjoy a virtual farming game so much. For only $0.99, it&amp;#39;s hard to go wrong here.<br/><br/>This game surprised the hell outta me! I figure for the cost and the amount of peace the game seems to bring me, it&amp;#39;s totally worth the buck I paid for it. 5/5&amp;quot;<br/><br/>AppModo.com:<br/>&amp;quot;Pocket Farm is extremely addictive. I simply couldn’t stop playing this game.  I would definitely recommend this game to all kids, both young and old.&amp;quot;<br/><br/>DEVELOPER NOTES<br/>For all the people giving low reviews because they didn&amp;#39;t read the instructions...   READ THIS:  The crops in demand are highlighted with a yellow box at the top of the screen.  Don&amp;#39;t grow crops for the market if they aren&amp;#39;t in demand or no baskets will appear and you will waste them.  <br/><br/>JOIN THE FAN COMMUNITY<br/>-On Facebook at www.facebook.com/RockingPocketGames<br/>-On Twitter at twitter.com/RockingPocket<br/><br/>MORE GAMES<br/>\u2028Doodle Fishing, Doodle Chopper, Puppet Jump, Puppet Sprint, Puppet Labyrinth, Super Soccer Kick 3D, Super Football Kick 3D, Pocket Farm, iFishing, iFishing Saltwater, Dark Raider, Dark Raider S, Blue Skies 3GS, Blue Skies, The Guy Game, The Girl Game", "metacritic": null, "released": "2009-10-01", "tba": false, "updated": "2019-07-30T02:24:53", "background_image": "https://media.rawg.io/media/screenshots/bea/bea9159f456b3ab3bbeb3be08c74045e_YSOrmyL.jpg", "website": "http://www.RockingPocketGames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Rocking Pocket Games", "Chris Egerter", "Mason Macbeth"], "genres": ["Adventure", "Strategy", "Casual", "Family"], "publishers": ["Chris Egerter", "Mason Macbeth"], "esrb_rating": "Everyone 10+"}