{"id": 810290, "slug": "twin-mind-ghost-hunter-collectors-edition", "name": "Twin Mind: Ghost Hunter Collector's Edition", "name_original": "Twin Mind: Ghost Hunter Collector's Edition", "description": "<p>A mysterious murderer leaves his victim’s bodies bloodless. Who is this cold-blooded person, and is they a person at all? Twin detectives, named Eleanor and Randall have a case to solve! A murder has been committed in a movie theater and the victim lost all the blood, the murderer was even nicknamed Dracula. There is an assumption, that the murder was committed by the victim&#39;s friend, when the twins get to the bottom of what happened, the case takes an unexpected turn! The real criminal was always beside them. And the twins are dealing with dark magic... again. Solve many puzzles and beat exciting challenges in this Hidden-Object Puzzle Adventure game to get to the truth and save innocent people!</p>\n<p>This Collector&#39;s Edition includes:</p>\n<p>Find out the terrible truth about the fatal love triangle as Eleanor in the Bonus Chapter!<br />\nPlay and re-play your favorite puzzles and mini-games to earn a variety of achievements!<br />\nEnjoy bonus materials that include concept art, wallpapers, music, and more!<br />\nGather collectibles and look for morphing objects!</p>", "metacritic": null, "released": "2022-03-29", "tba": false, "updated": "2023-11-04T06:51:18", "background_image": "https://media.rawg.io/media/screenshots/8fc/8fc28b1291ed0949874ded01901127df.jpg", "website": "https://store.steampowered.com/app/1917610/Twin_Mind_Cazador_de_Fantasmas_Edicin_Coleccionista/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Domini Games", "DominiGames"], "genres": ["Adventure", "Casual", "Puzzle"], "publishers": ["DominiGames", "DominGames"], "esrb_rating": null}