{"id": 81021, "slug": "empires-world-conquest", "name": "Empires: World Conquest", "name_original": "Empires: World Conquest", "description": "WITH EMPIRES, REDISCOVER THE GAME OF CONQUEST. Develop war strategies of unprecedented complexity with numerous game options. Dominate the world by facing up to five powers, managed by IA or other players during LAN parties. Available for iPhone, iPod and iPad, Empires offers you a whole new strategic experience! <br/><br/>BATTLE YOUR OPPONENTS DURING BREATHTAKING PARTIES WITH UNLIMITED GAME POSSIBILITIES. Thanks to its five levels of IA, Empires allows beginners to familiarize themselves with the game of conquest in a rewarding way, and  strategists to show the extent of their talent. A large-scale map, with 130 countries divided into 7 regions, as well as varying playing styles depending on the empires, allows every situation to be reversed. With power struggles between countries, and different terrains and strengths or weaknesses of each nation during battles, Empires lets players develop increasingly complex strategies.                                                                                                <br/><br/>TAKE ADVANTAGE OF THE NUMEROUS GAME OPTIONS TO TEST NEW TACTICS. Your budget, growing with your conquests, can be used to buy armies and ships, but also to spy on enemy territories, try to corrupt a nation, or fortify lands. It is even possible, with donations of money, to encourage some countries to defend themselves more effectively against other players. <br/><br/>DISCOVER THE FUN OF A SMOOTH-FLOWING GAME. No need to wait after each battle: despite its large-scale map, Empires instantly updates each new configuration of the world at the end of fighting. Victories and defeats follow each other at a breathtaking pace, and you immediately see your progress with detailed battle reports and clear display.  <br/><br/>BATTLE YOUR FRIENDS DURING INCREASINGLY STRATEGIC LAN PARTIES! Play solo against other participants, or create alliances with your friends to conquer an even more powerful IA during multiplayer parties. Donate money to your allies in trouble to optimize your chances of victory, or fight against them to become master of the world. Empires offers the possibility of creating multiplayer parties in Bluetooth or Wi-Fi for up to 6 participants. <br/><br/>WITH EMPIRES, AWAKEN YOUR STRATEGIC INSTINCT!", "metacritic": null, "released": "2011-08-16", "tba": false, "updated": "2019-08-02T03:44:29", "background_image": "https://media.rawg.io/media/screenshots/f50/f50e1a08fc5951ad3b1728710c7283a9.jpg", "website": "http://www.empires-game.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fabrice Noui"], "genres": ["Strategy", "Board Games"], "publishers": ["fabrice noui"], "esrb_rating": null}