{"id": 810234, "slug": "holocure", "name": "HoloCure", "name_original": "HoloCure", "description": "<p><strong>Welcome to HOLOCURE!</strong></p>\n<p>This is a completely free, unofficial fangame featuring the vtuber talents of Hololive, with gameplay that is heavily inspired by Vampire Survivors and Magic Survival. Collect powerful weapons and items and experiment with all kinds of builds to create the ultimate character! Will you be able to defeat the endless waves of enemies, and reach the top rankings?<br/></p>\n<p>Download now below!</p>\n\n\n\n<p><strong>Features:</strong></p>\n<ul><li>Unlock and play with 11 Hololive characters through Gacha (in-game currency only). <ul><li>This demo includes the 11 \"HoloEN\" members of Hololive. In future updates, members of \"HoloJP\" and \"HoloID\" will be added as well.</li></ul></li><li>Unique skills and special attacks for every character<br/>\n</li><li>Unlock dozens of different weapons and passive items</li><li>Hololive song remixes created for this game by Eufrik</li><li>Hidden mechanics</li><li>Survive against classic Hololive characters and mascots</li><li><em>(Controller support will be added in a future update)</em></li></ul>\n\n\n\n\n<p><strong>AVAILABLE LANGUAGE OPTIONS</strong>:            </p>\n<p>-English</p>\n<p>-日本語</p>\n\n<p><strong>Video/Stream Content</strong>: Please feel free to record or stream this game however you'd like as an independent creator! </p>\n<p>However, you may not use this game for any direct business purposes for profit or purposes that conflict with Cover Corps' Derivative Works guidelines. </p>\n\n<p><strong>Disclaimers</strong>: We are not affiliated with Hololive or Cover Corp. in any way. This project was made while following all guidelines under the Hololive Derivative Works guidelines (https://en.hololive.tv/terms). There is no monetization in this game. All visual and music assets used in this game are originally made for this game specifically. All sound assets are bought and paid for with the license to use commercially and non-commercially. </p>\n<p>UPDATING YOUR GAME:</p><p>When updating your game, you can simply replace the old files in the game directory folder with the new files from the zip. Your save will still work as is, so you don't need to do anything about that. Your save file is located in a different location on your computer, so replacing your files in the game directory will not affect your save.</p><p><strong>TROUBLESHOOTING</strong></p>\n<p>If you have a problem with your save file or settings, you can navigate to:</p>\n<p>Users\\[your username]\\AppData\\Local\\HoloCure<br/></p>\n<p>and delete \"<em>save.dat</em>\" or \"<em>settings.json</em>\" to reset your game. <br/><strong>NOTE:  If you delete \"<em>save.dat</em>\", you will lose ALL progress in your game and start as a fresh new game.</strong></p>\n<p>Deleting \"<em>settings.json</em>\" will only reset your game settings, and you will <strong>not </strong>lose any progress.</p>\n\n<p>For any questions, please email <strong>holocure@gmail.com</strong>!<br/></p>", "metacritic": null, "released": "2022-06-24", "tba": false, "updated": "2024-03-26T13:15:27", "background_image": "https://media.rawg.io/media/screenshots/4a2/4a2976cb41da7786103c369e9db6a22b.jpg", "website": "", "rating": 4.3, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 2, "beaten": 5, "toplay": 2, "dropped": 4, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 10, "platforms": ["PC"], "developers": ["Kay Yu"], "genres": ["Action"], "publishers": [], "esrb_rating": null}