{"id": 81038, "slug": "sudoku-22", "name": ") Sudoku", "name_original": ") Sudoku", "description": "With daily games at 17 difficulty levels, novices and expert players alike will appreciate :) Sudoku. Our tutorial, extensive feature set, and advanced hint system offer something for every player. The more you play, the more you will enjoy it!<br/><br/>For unlimited puzzles, check out our other Sudoku products: :) Sudoku + (paid) and Sudoku Joy (free).<br/><br/>Our multi-stage hint system starts with a gentle reminder to get you back on track and works up to an illustration of the exact technique to use and how it applies to the current board. Use our hints to ease those frustrating moments and to learn how to be a better player.<br/><br/>Features include:<br/><br/>- 17 difficulty levels, something for everyone<br/>- Tutorial teaches you new techniques<br/>- Large, high contrast digits are easier to read<br/>- Advanced techniques at the higher levels, including X-Wings, sashimi fish, and coloring<br/>- User interface optimized for fewer touches<br/>- Choice of six color schemes<br/>- Never covers up the board while you are playing<br/>- Infinite undo/redo<br/>- Undo to the last solvable position<br/>- Board solvable indicator<br/>- Automatic or manual pencil marks<br/>- Save your game while you try alternatives<br/>- Automatically saves your game when you get a phone call, switch applications, or lock the phone<br/>- Highlighting helps you discover patterns<br/>- Game clock; compares your time to other players<br/>- Avoids graphic frills that distract from play<br/>- Choice of digit styles, including Kanji and Hanzi<br/><br/>All games are true Sudoku, with symmetry and a single solution that can be discovered by logic alone. If you doubt that a puzzle can be solved by logic, simply have the hint system explain it to you step by step.<br/><br/>If you enjoy Sudoku daily, this is the app for you!", "metacritic": null, "released": "2008-08-03", "tba": false, "updated": "2019-07-30T09:11:11", "background_image": "https://media.rawg.io/media/screenshots/d61/d611405abd71db124c9f857c799b0ef9_1hNLoF0.jpg", "website": "http://www.enjoysudoku.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jason Linhart"], "genres": ["Board Games", "Puzzle"], "publishers": ["Jason Linhart"], "esrb_rating": null}