{"id": 810408, "slug": "cost-of-living", "name": "Cost of Living", "name_original": "Cost of Living", "description": "Cost of Living\r\nIf easy payment plans were to be really efficient, patrons' lifetimes had to be extended!\r\n<p><strong>Stateless Writing by Robert Sheckley<br/>Stateful Writing by Dorian Passer<br/>Artistic Engineering by Dorian Passer</strong></p>\n<p><em>This stateless story was first published on December 1952.<br/>This stateful story was first published on June 2022.</em></p>\r\nDeveloper Notes\r\n<p>The first time I tried to adapt Robert Sheckley's <em>Cost of Living </em>to interactive fiction was about two years ago. I'd just completed a second game with — yet another — innovative but custom-made system. The next horizon for me was to adapt a literary short story. My excitement was at an all-time high.</p>\n<p>What I <em>did</em> manage to finish was <em>terrible</em>. It stunk! I felt frustrated and disappointed with myself. If you've ever tried to adapt a short story to interactive fiction, then this admission might not surprise you.</p>\n<p>This is my second attempt. But this time?</p>\n<p>This time I demolished everything I knew about interactive storytelling, cleared the rubble, and reconstructed on top of everything I learned about literature in the past two years.</p>\n<p>This is just a glimpse of what I built. I hope you like it.</p>\r\nContent Notice\r\n<p>Please be advised this short story contains mature themes and discussions about living and dying. Audience discretion is advised.<br/></p>\r\nRequirements\r\n<ul><li>Desktop, Laptop, Mobile, or Tablet</li><li>Chrome, Brave, Edge, Firefox, or Safari<br/>\n</li><li>Keyboard, Mouse, or Controller</li></ul>\r\nLocal Reading \r\n<ul><li>Download <em>cost_of_living.</em><em><em>zip</em></em></li><li>Open <em>index.html</em> </li></ul>\r\nOnline Reading\r\n<ul><li>https://pc22-cost-of-living.surge.sh</li><li>Enter password <em>PC22</em></li></ul>\r\nLegal Notice\r\n<p>The Cost of Living by Robert Sheckley is in the public domain in the United States of America.</p>\n<p>All other material is under copyright of Dorian Passer.</p>", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T04:25:59", "background_image": "https://media.rawg.io/media/screenshots/454/45451debd016b08e251ba1ecd6f647a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dorian Passer"], "genres": [], "publishers": [], "esrb_rating": null}