{"id": 810447, "slug": "forget-the-golden-witch-version-francaise", "name": "Forget the Golden Witch (version française)", "name_original": "Forget the Golden Witch (version française)", "description": "<p>Bonjour. Ça fait un moment que vous dormez à présent.<br/></p>\n<p>Vous avez l'air perdu. Cela devait arriver. Ce n'est pas votre lit. Il est certain que cette maison n'est pas faite pour accueillir un domestique. Ou vous n'êtes pas digne d'être servi. Je ne sais plus.</p>\n<p>Vous êtes là cependant. De votre propre volonté. Êtes-vous certain de vouloir entreprendre cette offre ? Pensez-y bien. Ce n'est pas encore trop tard. Vous pouvez à nouveau sombrer dans les bras de morphée et oublier tout cela.</p>\n<p>La difficulté, je vous préviens, est intense et brutale. Seuls les plus dévoués parviendront à traverser cette toile de violet.</p>\n<p>---</p>\n\n<p><strong>Il s'agit d'un fangame du jeu Umineko no Naku Koro Ni, réalisé à partir des ressources du jeu PS3 et de la bande-son originale d'Umineko. Il est supposé que le lecteur a lu intégralement les huit épisodes d'Umineko. </strong></p>\n<p>Se déroulant sur une version très différente de Rokkenjima, le lecteur doit résoudre une série de meurtres horribles et de plus en plus déroutants. Les règles du jeu sont simples : tout au long de l'histoire, certaines déclarations faites par les personnages seront présentées dans un texte de couleur violette. Lorsque la déclaration est faite par un personnage innocent, la déclaration violette est une vérité absolue.</p>\n<p>En revanche, lorsqu'elle est prononcée par le coupable, elle ne l'est pas forcément.</p>\n<p>Un lecteur expérimenté d'Umineko peut s'inquiéter de l'existence de cette soi-disant \"magie\". Il n'y a pas lieu de s'inquiéter. Il n'y a pas de magie ici. Pas un seul papillon doré en vue.</p>\n<p>Vous n'avez pas besoin de chercher une sorcière. Car il n'y a pas de sorcière à trouver.</p>\n<p>Oubliez-la.</p>\n<p>Oubliez tout ça.</p>\n<p>Il n'y a que des humains. Et des monstres à visage humain qui se cachent parmi eux.</p><p>---</p><p>Traduction française du jeu \"Forget the Golden Witch\" de DWaM (https://dwam.itch.io/forget-the-golden-witch)\r\n</p>\n<p>Pour jouer en français, allez dans \"preferences\" et choisissez \"french\"</p><p>(La traduction est basée sur la version 1.1 du jeu)</p>", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T04:41:42", "background_image": "https://media.rawg.io/media/screenshots/70c/70cd96da4c08f88519f2379d40bb1188.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["DragonSlayer4012"], "genres": [], "publishers": [], "esrb_rating": null}