{"id": 810429, "slug": "omnitesauro", "name": "Omnitesauro", "name_original": "Omnitesauro", "description": "<p><strong>Controles:</strong></p>\n<p><strong>PT-BR</strong></p>\n<p>WASD - Movimentação</p>\n<p>Barra de Espaço - Deixar mensagem (precisa estar em um tile vazio)</p>\n<p>E - Ler mensagem deixada (precisa estar em cima de um tile com mensagem, representado pelas esferas amarelas)</p>\n<p><strong>EN</strong></p>\n<p>WASD - Movement</p>\n<p>Barra de Espaço - Leave message (Must be in an empty tile)</p>\n<p>E - Read left message (Must be above a tile with a message left, represented by the yellow spheres)</p>\n\n<p>Descrição:</p>\n<p><strong>PT-BR</strong></p>\n<p>Protótipo desenvolvido como Trabalho de Iniciação Científica do curso de Design de Jogos e Entretenimento Digital na UNIVALI.</p>\n<p>O protótipo consiste em uma prova de conceito de uma implementação da biblioteca Gun na engine Godot. Futuramente, pretendo transformar essa implementação em um Plugin para que outros desenvolvedores consigam utilizar as funcionalidades da Gun na Godot.</p>\n<p>Gun é um banco de dados distribuído que  salva as informações no armazenamento local do cliente que a utiliza, podendo funcionar até de forma desconectada da rede. A biblioteca forma um grafo abrangendo os dados salvos por todos os clientes conectados, buscando nele as informações requisitadas e qual cliente pode fornecê-las, com sua sincronização feita através de Websockets.<br/></p>\n<p>O código desse protótipo e da implementação podem ser encontrados, respectivamente, nos seguintes repositórios:</p>\n<p>https://gitlab.com/Kronos328/tic-ian-aguiar</p>\n<p>https://gitlab.com/Kronos328/gun-godot</p>\n<p>Caso tenha interesse em conhecer mais sobre o Gun, o video a seguir (em inglês) dá um excelente resumo: </p>\n\n<p><strong>EN</strong></p>\n<p>Prototype developed as the Scientific Initiation Project of the Game Design course at UNIVALI.<br/></p>\n<p>The prototype is a proof of concept of an implementation of the Gun library in  the Godot engine. In the future, I intend to transform this implementation into a fully-fledged Plugin so that other developers can use Gun's features on Godot.</p>\n<p>Gun is a distributed database that saves data on the local storage of the client, being able to work even when offline. The library then forms a graph that encompasses all data saved by all connected clients in a peer-to-peer network, searching this graph for queried data and figuring out which client can provide it through Websockets.</p>\n<p>The code of this prototype and of the Gun implementation is available on the following repositories:</p>\n<p>https://gitlab.com/Kronos328/tic-ian-aguiar\r\n</p>\n<p>https://gitlab.com/Kronos328/gun-godot\r\n</p>\n<p>If you'd like to know more about Gun , the following  video is an excellent TLDR</p>", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T04:33:53", "background_image": "https://media.rawg.io/media/screenshots/a82/a82b5d9b4e0f3ceaf4f224f9e69c367c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kronos328"], "genres": [], "publishers": [], "esrb_rating": null}