{"id": 810504, "slug": "an-everyday-high-school-romance", "name": "An Everyday High School Romance", "name_original": "An Everyday High School Romance", "description": "<p>Play as simple teenage girl Mari (the name is interchangeable) in this text-based game where all choices matter, but not in a bad-end or good-end way.</p>\n<p>In this game, you will be able to make many choices that affect the kind of dynamics you'll have with your three love interests. Will you have a sarcastic or teasing relationship? Playful and flirty? Or down-to-earth and chill? You decide. </p>\n<p>As mentioned previously, nothing you will choose will give you a bad ending. So there is no need to feel like you have to make a choice purely to be in the good graces of the love interest of your choosing, like many other romance games.</p>\n<p>There will be four routes in total – one for each love interest and the last being a polyamorous route. In this game, you can romance two males and one female.</p>\n<p><strong>Developer:</strong> Reader Gamer</p>\n<p><strong>Price:</strong> Free-to-play with the option of donations &amp; with future NSFW DLC (which will cost $3.99) where the time will set a year after the characters graduate high school</p>\n<p><strong>Release Frame:</strong> When the timing is right</p>\n<p><strong>Rating:</strong> Teen (Base Game), Mature (DLC)</p>\n<p><strong>Platforms:</strong> Windows and Android</p>\r\nGAME INFO/FEATURES:\r\n<ul><li>The game will take place over an in-game month.\r\n</li></ul>\n<ul><li>The branching paths will be selected when choosing a partner for a school project.\r\n</li></ul>\n<ul><li>On the weekends, you can choose to go on dates with varying options/locations filled with fun and sweet moments. Plus opportunities to learn more background information about the love interest(s).\r\n</li></ul>\n<ul><li>Limited graphics; There are only four drawings shown in the game, which are to, momentarily, illustrate the PC and the LIs. As said, this is a text-based game, so if some aren't fond of reading an equivalent of a book – this game isn't for you.</li></ul>", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T05:04:25", "background_image": "https://media.rawg.io/media/screenshots/b57/b57470cc7394302d2ad156453e5a0da8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Reader Gamer"], "genres": [], "publishers": [], "esrb_rating": null}