{"id": 810576, "slug": "project-island-adome", "name": "Project Island (Adome)", "name_original": "Project Island (Adome)", "description": "<p>In year 2023, A country has changed The World Order, other countries in search of a new formula to rise their nation again. Many countries have tried different methods and attempts but among them there is one country that came very close. That country sent a bounty hunter to island but after that man mysteriously disappeared. A famous military journalist sent on a secret mission by his country embarks on adventures to find a mysterious raw material that will play a key role in the new world order.</p>\n\n<p>Will Hamilton arrives to the island with his car. He tries to reach his destination but unfortunately his tyres  are dead. He is far away from his destination. He needs to find his path, there is a long way awaits him. He needs to get off from the car and he has to continue his adventure on foot. He is very unpleasant about this situation because he had to ancient task given to him. He needs to find mysterious raw material that will play a key role in the new world order. He has to take action before it’s too late.</p>\n<p>Aim: Reaching the target by using the platforms. Looting needed materials to improve character experience. <br/></p>\n<p>-Credits-</p>\n<p>Adem Akdoğan</p>\n<p>Onur Söylemez</p>\n<p>Mert Özenir</p>\n<p>Efe Örs</p>\n<p>*This game is created for educational purposes.</p>", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T05:32:37", "background_image": "https://media.rawg.io/media/screenshots/a84/a84013ce7facafb81a6c660228a6f752.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Adome"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}