{"id": 810503, "slug": "obsidia", "name": "Obsidia", "name_original": "Obsidia", "description": "<p>Galena and their pet companion, Agate, must fight their way through several ruins in order to cleanse the magical crystals from the dark nature that corrupted them and unravel the mysteries about the events that have transpired.</p>\n<ul><li>The game has a total of 6 islands with different objectives, mobs and puzzles. To navigate through them the player must use the portals.\r\n</li><li>If the portal is blocked, the player must finish all the tasks in the current island.\r\n</li><li>Throughout the game, the player will get different elements that unlock new abilities that can be used to defeat the different opponents, including bosses.\r\n</li><li>Magical abilities selected on the wheel consume mana crystals.\r\n</li><li>In the islands, there are health potions and mana crystals available that can be used by the player to recover lost resources, health and mana.\r\n</li><li>The player loses the game when Galena loses all her health.\r\n</li><li>The player can save its current state in a checkpoint and will be able to return to its location after death.\r\n</li><li>To win the game, the player must unlock all the portals and visit all the islands in order to defeat the final boss. \r\n</li></ul>\n<br/>\r\nWASDMovementQUse consumable<br/>EGrab Item/Save CheckpointEnterSkip DialogTabHold to select ability from ability wheelMouse1Melee attackMouse2 -&gt; Mouse1Aim and shootIInventoryEscPause\r\n<br/>\n<p><strong>Developers:</strong><br/></p>\r\nBeatriz MendesGustavo Tavares<br/>Diogo Samuel Fernandes<br/>Pedro AzevedoHugo GuimarãesPedro Pinto<br/>\n<p><strong>Sound Designers:</strong></p>\r\nSérgio CoutimIan Knudsen\r\n<p><strong>3D Modellers</strong>:<br/></p>\r\nJúlia ValentePedro Costa", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T05:04:04", "background_image": "https://media.rawg.io/media/screenshots/3f2/3f28cb0baea342fdcb664d4f8d2b5e6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["samuuuh"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}