{"id": 81069, "slug": "noodles", "name": "Noodles!", "name_original": "Noodles!", "description": "Over 1.5 million downloads!!<br/><br/>\"Noodles is a game you need to have in your life.\" - Gamezebo<br/><br/>Chosen as an App Store Free App of the Week, and a Starbucks Pick of the Week.<br/><br/>Looking for a relaxing, strategic and addictive puzzle?  Find your Zen and become one with Noodles!  Tap to spin and connect all the noodle pieces – once you solve a puzzle, figure out the strategy and beat your own score to get FIVE STARS!   <br/><br/>Sound easy?  It might be in the first few levels, but as you progress try connecting a giant hexagon Noodle ... puzzles get more complex as more sides are added.  What are you going to do then? <br/><br/>*** Find out why Noodles! has 4.5 stars in every country!***<br/><br/>And now, some words from some happy Noodlers: <br/>“Damn this game for being awesome and super addictive”<br/> – User Review by Miayadu<br/><br/>“Pretty graphics, Zen-like sounds, you will get hooked and you won't mind!” <br/>– User Review by WalnutCake<br/><br/>Key Features:<br/>•\tThousands of addicting puzzles, all available immediately.  No unlocks, annoying tricks or bags of diamonds to buy<br/>•\tFacebook and Twitter enabled to share your Noodles success<br/>•\tGame progress status tells you how far you have to go<br/>•\tIncreasing difficulty makes you feel smarter when you are done<br/><br/>Noodles comes to you from the bumbling genius of Lummox Labs<br/><br/>Happy Noodle-ing!", "metacritic": null, "released": "2015-04-23", "tba": false, "updated": "2019-07-30T09:17:13", "background_image": "https://media.rawg.io/media/screenshots/a40/a40a8b152e1af97ffad21925add026be.jpg", "website": "http://www.lummoxlabs.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Michael Busheikin"], "genres": ["Board Games", "Puzzle"], "publishers": ["Michael Busheikin"], "esrb_rating": null}