{"id": 810751, "slug": "shards-of-the-future", "name": "Shards of the Future", "name_original": "Shards of the Future", "description": "After taking part in a 'killing game', and defying the game by bringing everyone out of that game alive, is returning back to work the correct idea? To the Bartender, Velour, he at first believes it so -- but very quickly, when actually considers it...<br/><br/>No, there was something he needed to do, first. And so, begins a much smaller, much less deadly journey back to a place he once called home...and the surrounding places he goes before and after that.\r\n<p><em>Shards of the Future</em> is a not-so-goofy (but rest assured, <em>there will be memery</em>) sequel to my first Renpy game, <em>Fragments of the Past.</em> It is recommended to play the first one in order to get what's going on in this second installment! This game includes the following hit new content:</p>\n<ul><li>More text (like, double the amount of text). This means you're going to have to deal with MORE of my typos</li><li>At least two instances of Velour being a complete dumbass (if not more)<br/>\n</li><li>Some of these images have drawings of Velour! Wow! The quality for these are wild, but i had a lot of fun with them.</li><li>You might find a surprise at the end if you're one of the players who was in this campaign :)</li></ul>\n<p>Of course,  the content warnings exist and they mostly hit the same as the last one: there's a lot of talk about characters who had died (family members specifically, but also about dying in a time loop), a bit of trying to process thoughts (mainly about being in a killing game), and the general concept of recognizing hurt and being hurt. No graphical warnings (the closest 'violent' image is Velour with a small bruise on his face.) </p>", "metacritic": null, "released": "2022-06-30", "tba": false, "updated": "2022-07-01T06:43:00", "background_image": "https://media.rawg.io/media/screenshots/365/36557f4b8f0da91195df5e893aba1e8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Rubin"], "genres": [], "publishers": [], "esrb_rating": null}