{"id": 810922, "slug": "metris-jc-sirron", "name": "Metris (JC Sirron)", "name_original": "Metris (JC Sirron)", "description": "<p>NOTE: This was my entry for Ludum Dare 35.  I am re-uploading it here for visibility, since the Ludum Dare website was archived.<br/></p>\n<p>INTRODUCTION:<br/>You are a semi­-autonomous metallic construct, being created in a laboratory. As part of the fabrication process, you need to learn how to create various shapes using your constituent elements. You will start with relatively simple shapes, then move through more complicated shapes and elements, until you are certified as fully self­-modifying. <br/></p>\n<p>GAMEPLAY:<br/>We start with the basics of a famous Russian block game. You can move left and right with the left and right arrow keys. You can also lower the complex when it is above the location you want, with the down arrow. <br/></p>\n<p>If the current complex is not going to work, you must shift its shape. You do this by pressing the up arrow: this will exchange the current complex with another of equal size but different conformation. <br/></p>\n<p>Full lines represent metallic structures that have condensed into a solid state: they disappear into your basic infrastructure, and are not helpful in building the specialized structures that are your goal. <br/></p>\n<p>From the semi­-permanent structure remaining, you must fill out a specific shape. Excess matter is allowed, but remember that a full line will disappear and can’t be used to master this elemental level. <br/><br/>CONTROLS: <br/>W/UP - Change Shape <br/>A/LEFT - Move Block Left <br/>D/RIGHT - Move Block Right <br/>S/DOWN - Place Current Block</p>", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2022-07-01T07:58:40", "background_image": "https://media.rawg.io/media/screenshots/13d/13d0348f07607e48614944aa66669a61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JC Sirron"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}