{"id": 810969, "slug": "autobahn-police-simulator-2-re-created-version", "name": "Autobahn Police Simulator 2 (re-created version)", "name_original": "Autobahn Police Simulator 2 (re-created version)", "description": "<p><strong>DISCLAIMER</strong>: I AM NOT THE OWNER OF THE GAME \"Autobahn Police Simulator 2\". I JUST REMAKE IT, THIS IS NOT THE REAL VERSION. IF YOU WANT TO PLAY THE ORIGINAL THEN GOTO THIS LINK: https://store.steampowered.com/app/483770/Autobahn_Police_Simulator_2/<br/></p>\n<p>Start your even more exciting career as law enforcer on Europe’s fastest road now with the successor to the popular Autobahn Police Simulator. Your adventure begins right in the police station where colleagues are present, too. Over the course of the game you can further develop the station and gain access to new opportunities and missions this way. Step by step, you can unlock new upgrades for the station, vehicles, equipment, and your skills via the tech tree. As a highlight waiting at the end of the tree there is a police helicopter which from there on supports you during missions (passively) and while chasing offenders. With its numerous Open World features, Autobahn Police Simulator 2 offers a long-term varied gameplay that goes beyond a mere simulation.</p>\n<p>Take on varied, randomly selected missions, e.g. car chases at high speeds, careful escorts or accident securing and traffic checks. By successfully completing these operations you move up in rank. Besides the free game, Autobahn Police Simulator 2 now also tells an elaborate, spectacular story in 20 missions that are broken up by cut scenes. All missions, either in the free game or in the story, are extensively voiced to convey a realistic and thrilling experience. To take on all these operations, your fleet consists of a radio patrol car and a civil car as well as, for the first time, a police van. They all feature an LED matrix and realistic siren signals that change based on the type of mission.\r\n</p>\n<p>For the first time in Autobahn Police Simulator 2 you can use the Character Creator to customize your own in-game character’s head, body and even clothing to your liking. An all-new next generation graphics and lighting engine brings to life the world of Fallout like never before. From the blasted forests of the Commonwealth to the ruins of Boston, every location is packed with dynamic detail. Intense first or third person combat can also be slowed down with the new dynamic Vault-Tec Assisted Targeting System (V.A.T.S) that lets you choose your attacks and enjoy cinematic carnage.\r\n</p>\n<p>---------------------------------------------------------------------------------------------------</p>\r\nSYSTEM REQUIREMENTS\r\n<ul><li>Requires a 64-bit processor and operating system\r\n</li><li><strong>OS</strong>: 8 / 10\r\n</li><li><strong>Processor</strong>: Quad Core with 3 GHz (64bit)\r\n</li><li><strong>Memory</strong>: 4 GB RAM\r\n</li><li><strong>Graphics</strong>: GPU with 1 GB VRAM, e.g. Nvidia GeForce GTX 760 or similar (Onboard chips are not officially supported)\r\n</li><li><strong>DirectX</strong>: Version 11\r\n</li><li><strong>Storage</strong>: 20 GB available space\r\n</li></ul>\n<p>---------------------------------------------------------------------------------------------------<br/></p>\n<p>If you have any problems running the game, installing the game, errors, etc... don't hesitate to get on touch with me at:\r\n</p>\n<p>Discord: pofe3t81t821r2t8r1#2483\r\n</p>\n<p>MEGA: Click here\r\n</p>\n<p>---------------------------------------------------------------------------------------------------\r\n</p>\n<p>NOTE: I'LL LET THIS GAME FREE FOR A PERIOD OF TIME BEFORE I PUT IT ON SALE SO BE QUICK AND ACT NOW!</p>", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2022-07-01T08:17:06", "background_image": "https://media.rawg.io/media/screenshots/b7c/b7c5614c239d30545e7632a91f2d1a85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheRe-CreateGuy"], "genres": ["Action", "Shooter", "Simulation", "Platformer"], "publishers": [], "esrb_rating": null}