{"id": 811120, "slug": "six-hours-at-diddles-reawakened", "name": "Six Hours at Diddle's: Reawakened", "name_original": "Six Hours at Diddle's: Reawakened", "description": "<p><strong><em>Brandon Miller </em>)</strong><br/><em>Art, music, and models are all owned/created by me, Brandon Miller (IronProject).</em></p>\n<br/>\n<p>You are Mr. Willer in 1984, who has applied for a job at Diddle's Funhouse, six days a week, six hours per day, starting at $22 an hour.<br/>The restaurant stars several characters from the nursery rhyme \"Hey, Diddle Diddle,\" the Cat Fiddler, Little Dog, Dish, and Spoon.<br/>But you aren't meeting them on stage, they're coming to visit you.</p>\r\nWhat happened to the game?\r\n<p>Over two years ago, I decided I wanted to make my own full fan game, so I thought of the song \"Hey, Diddle Diddle\" and tried to imagine who 'Diddle' was and why (<em>and how</em>) he would create robots that could sing and dance. I don't want to spoil the character here (<em>which I'm still actively writing</em>), but know that he loves control, leading to him enslaving those he loved so that they wouldn't tell him what to do and so that they would love him back, no matter what.\r\n</p>\n<p>But young me wasn't very bright with game development and made the most spaghetti code that's ever been spaghetti. I struggled to fix many of the bugs I found throughout the game's code and I'm just lucky it works.\r\n</p>\n<p>Will I ever try remaking the game? Probably not, but I would love to if I had the time.\r\n</p>\n\n<p>This page is just an archive and memory of a game I failed to make.\r\nThe current version of the game is canceled, I am no longer actively developing it, and it is very unfinished.\r\nThere were over 1,000 lines of code just for the main script (<em>if you are a programmer, you should know that's a lot</em>), and I do not have the time, nor the commitment, to complete this game I canceled over a year ago.\r\n</p>\n\n<p>\n</p>\n<p>(<em>this is content that I never finished during the time I had previously worked on it and cannot finish due to erasing necessary models and specific character stories</em>)</p>\n<ul><li>All of the nightly tasks (<em>the tasks are shown at the end of each night but aren't playable</em>)\r\n</li><li>Multiple endings with player choices (<em>including night six's \"true ending\"</em>)\r\n</li><li>Complete character dialogue (<em>the first three tapes were finished</em>)\r\n</li><li>Actual Spoon model (<em>meet cardboard spoon instead</em>)\r\n</li><li>More props and finished areas\r\n</li><li>Two unfinished enemies</li></ul>\n<p>I also originally wanted to make a whole series out of this. I had written down ideas for two potential sequels, sad we'll never get to see them.</p>", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2022-07-01T09:17:00", "background_image": "https://media.rawg.io/media/screenshots/59c/59c612093ec55ac7236a391ba29f997b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["IronProject"], "genres": [], "publishers": [], "esrb_rating": null}