{"id": 811110, "slug": "grove-dome", "name": "Grove Dome", "name_original": "Grove Dome", "description": "<p>\n</p>\n<p>The theme from the jam by voting result was \"Death is a new beginning\".\r\n</p>\n<p>Our vision for theme implementation in this game project manifests in the story and a plant's growth cycle mechanism: Plants are actually dying after each day end in this game's mangrove forest location, and every morning there is the plain dome to new plants' germination and growth from seeds and even dropped fruits mixed in the soil ground.\r\n</p>\n\n<p><strong>How to play:</strong>\n</p>\n<p>1. <strong>Drag and drop seeds</strong> at the bottom of the screen (the rounded object) to place more plants to grow: Make money by your grown fruits for the daily demand before working time run out.</p>\n<p>2. <strong>Avoid to drop fruits, because you will lose health!</strong></p>\n<p>3. <strong>Try to beat level 5 at least. </strong>Thanks for trying out the game we created within limited working time<strong>!</strong></p>\n<p>-------------------</p>\n\n<p>Game play guide:</p>\n<p>(Version 1.9.1)</p>\n<p>Tap the fruits to pick them up. Only the ripe fruits are valuable to collect.</p>\n<p>Matured fruits will drop from the plant. Dropping fruits spreads the growth but also grows harmful mold. </p>\n<p>Plants will exhaust each night, but some underground seeds will stay. </p>\n<p>Use fingers to scale view of you planting environment. </p>\n<p>Avoid dropping fruits, because these will spread mold.</p>\n<p> * Pick up plants till it is night: To reach your objective, you have to reach the demanded amount of cash on each day cycle to reach the next stage.</p>\n<p>Avoid to touch any harmful objects, like flying insects or spiky fruits Guide Summary:<br/></p>\n<p> **Avoid to get ill from harmful objects. Harmful objects either moves or look dangerous. </p>\n<p>*** You can purchase items later in the game with the extra fruits you have collected in the leve</p>\n\n<p>-------------------<br/></p>\n<p><strong>Story:</strong><br/></p>\r\n\r\nYou have 1 incoming message:\r\nMessage sent: Your unidentified lead partner of your fruit planting area environment:\r\n\r\n\r\n\"Welcome to your farm plot, player-picker! In this Mangrove zone you will learn to earn money with tropical fruits. We are about to start  collaborating today, and we'll be awaiting your fruit delivery for each day. If you will success for  the few first days, we can start making services and collaboration with you as a partner! You will be working to earn your living in this country: Every day, from the morning to the night,  we assume you as a newbie fruit farmer to collect a minimum amount of valuable fruits for the  global markets.  You'll be working on your own dome. If you will not work for the demands, we've might  unfortunately undone contraction between us and we would you leave you by your own, and since  we both know you cannot survive in this territory by your own so in that case you will left your  dome and workpalce for to others. Our delivery partner arrives on each evening. If you need any gear or items, place an order at the  end of the day, so you will get the items for the extra fruit you deliver to us on each morning. Within this environtment and situation you should understand we would not accept money for  puchases, but only fruits you have collected to us.  We are only waiting receiving a valuable fruits from you to us, which is the way we truly can follow our contraction to forward.\"\r\n\r\n<p>-------------------</p>\n<p><strong>Contact us:</strong><br/></p>\n<p>If you feel like you would like to contact for us about this game title, please drop message to the title's creator itch-io profiles, thanks!</p>", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2022-07-01T09:12:19", "background_image": "https://media.rawg.io/media/screenshots/9ec/9ecf4944b7cbc1752fdfaac32bfd1de4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android"], "developers": ["emoxic", "Hiisileiri"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}