{"id": 811418, "slug": "love-me-yaoi-gay-romance-visual-novel", "name": "Love Me (Yaoi / Gay Romance Visual Novel)", "name_original": "Love Me (Yaoi / Gay Romance Visual Novel)", "description": "<p>\"Love Me\" is a VERY SHORT, sweet visual novel about a medical student and a lawyer from Seoul, who fall in love with each other at first sight.</p>\n<p>Seongmin, an introverted young man with anxiety issues, starts his internship at the hospital. One of his patients is Jiseon: a charming, handsome man in eccentric clothes. His eyebrow is bleeding.  What happened to him? Once Seongmin learns the truth, he decides to share with him his greatest secret. As the two meet again, Seongmin realizes he’s falling in love; but does he stand a chance with Jiseon?<br/></p>\n<p><strong>Player's Age: 18+</strong> (no NSFW content per se, but with adult language, and based on a short story solely  for adult audiences)\r\n</p>\n\n<ul><li>4000+ words of professionally written and edited text (the game covers the whole \"Love Me\" short story by Tina Isabel Leung, so no annoying cliffhanger)</li><li>An adorable happy ending with love confessions, kisses, etc.</li><li>A linear storyline / no choices (sorry... we believe in determinism when it comes to love!)\r\n</li><li>2 main characters: Seongmin (medicine student) and Jiseon (lawyer). This game has no character sprites, just character portraits.</li><li>6 different locations: hospital, college, street, restaurant, cafe and home apartment.</li><li>A beautiful, sad, piano soundtrack with atmospheric sound effects (hospital machines, rain, etc.)</li><li>A game interface stylized as a medical student's notebook</li><li>WILL get extras such as Eunni's email, Jamboree Tea Recipe and an extract from  Seongmin's Medical Book IF you leave 5 comments under the game.</li><li>WILL get a sequel of 5500+ words (\"Love Me. Once More\") IF you leave 10 comments under this game.</li></ul>\n\n<p><strong>Seongmin </strong>is a medicine student from Andong, who lives in Incheon, but studies in Seoul. He's stressed out, anxious, and perfectionistic, with an OCD about cleanliness. Despite his desire to come out of the closet, he's scared to do it, for fear of being ridiculed and rejected.</p>\n<p><strong>Jiseon </strong>is an attractive, self-confident lawyer from Ulsan, who works in Seoul. After being outed by his ex-wife, he doesn't hide his orientation anymore. He catches feelings for Seongmin very fast, but doesn't know what his crush is looking for; and he's dreaming about a long-term boyfriend.</p>\n\n\n\n\n\n<p>\n</p>\n<p>\n</p>\n<p><strong><strong>The game is controlled by mouse and keyboard. Beyond you can find information about keyboard shortcuts:<br/></strong></strong></p>\n<ul><li><strong>S</strong> - Save Game</li><li><strong>L</strong> - Load Game</li><li><strong>Space </strong>- Progress Game</li><li><strong>Esc </strong>- Return to Title Screen</li><li><strong>B </strong>- Display Backlog</li><li><strong>M </strong>- Menu Screen</li><li><strong>A </strong>- Auto Mode</li></ul>\n\n<p>Hasalynx Games is an indie game studio that doesn't have any funding, and mostly relies on unpaid human effort and free resources to keep producing its games. If our games spark your curiosity, please buy them (they're so cheap!), comment, and spread positive word. Also, don't forget to add this game to your collections and follow Hasalynx Games on itch.io, so as to receive updates when a new game is up!</p>", "metacritic": null, "released": "2022-06-28", "tba": false, "updated": "2022-07-01T11:11:09", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1cb966835913c355917531338f2f511.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hasalynx Games"], "genres": [], "publishers": [], "esrb_rating": null}