{"id": 811518, "slug": "diary-of-a-wimpy-kid-rodrick-rulez-romance-demo", "name": "Diary of a Wimpy Kid: Rodrick Rulez' Romance (DEMO)", "name_original": "Diary of a Wimpy Kid: Rodrick Rulez' Romance (DEMO)", "description": "<p>You've played other dating sims before right? Y'know how it is! With the corny dialogue and slightly concerning content material?</p>\n<p><strong> NOT TODAY. </strong><br/></p>\n<p><strong><em> You've come to the wrong clown car buckaroo. </em><br/></strong><br/>Welcome to <strong>Diary of a Wimpy Kid: Rodrick Rulez' Romance! </strong>A visual novel that takes place in a parodied/ spoofed version of the world from the hit children book series that's published by Jeff Kinney. You control Rodrick Heffley, leading him forward in his admittedly <strong><em>WRETCHED </em></strong>quest to prove that he can, in fact, get a date! Spoiler alert, everything will go wrong!</p>\n<p>Now, you might be thinking: \"<em>Why does this even exist?\" </em>well...I say, <strong>Hold the phone buddy, who are YOU to tell me what I can and cannot make? I hold the power over you right know, I wrote the <em>PUTRID</em> words you're reading RIGHT NOW.  If I want to make Manny Heffley a gang leader, I CAN make Manny Heffley a gang leader. Go ahead, run<em> coward</em>,<em> go and play the demo, DO IT.</em></strong></p>\n<p>Some stuff you can expect in this game will be: </p>\n<ul><li>Multiple different \"\"datables\"\" to romance! From disgruntled parents, overworked life guards or the oldest seniors known to man!  <strong><em>2 routes are currently available in the demo version! <br/></em></strong></li><li><strong><em>Multiple Endings!</em></strong></li><li><em>WaaaaAaAAAAcky </em>dialogue and nose-exhaling worthy jokes! </li><li>Enemy encounters built upon a <strong>QTE</strong> system!</li><li>A very \"\"\"unique\"\"\" <strong>art style! </strong></li><li><strong>Honestly, a pretty good<em> original composed soundtrack. </em></strong>Yeah, I have no idea how that happened either. </li><li><strong>l</strong>ike a really epic duck, look at that guy in the screenshots and tell me they aren't worth at least 2 minutes of your time, </li></ul>\n<p><strong>So come on in! Let's look for some ROMANCE!</strong></p>\n<p>...eh, that sounded weird. Sorry.<br/></p>\n<p><em>(This game is a nonprofit parody. Diary of  A Wimpy Kid is the sole ownership of Jeff Kinney, Wimpy Kid Inc, and other associated owners. Additionally, this game is designed for those the ages of 13+ and up, and contains usage of strong language, depictions of violence and will probably cause brain deterioration.)</em><br/></p>", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2022-07-01T11:51:13", "background_image": "https://media.rawg.io/media/screenshots/086/0866d47c9842d9f5f05c2947a473ffe5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["ptewie"], "genres": [], "publishers": [], "esrb_rating": null}