{"id": 811517, "slug": "ballrogue", "name": "Ballrogue", "name_original": "Ballrogue", "description": "<p><strong>Ballrogue V0.1</strong><br/>Ballrogue is a 2D roguelike game. The player controls a pinball which goes into an arena that constantly changes. The areas of the arena are infested with monsters that start eating the bouncers, which is your main source of experience points.  As the player gains points he’ll level up by which he’ll gain a jump charge. At every level, he can choose to permanently sacrifice some jump charges to gain stronger power-ups.</p>\n<p>The ultimate goal is to get as many experience points as possible, while the enemy will try to prevent you from doing so. The player’s score will be listed on the online daily leaderboard, by which the player can see how well he did, compared to other players and his friends.</p>\n<p>Gamejam submission date: 6/29/2022 at 6pm PST</p>\n<p><strong>Credits</strong><br/></p>\n<p>Gamedesign &amp; Programming: <strong>Sarevok Anchev</strong> (my first gamejam)<br/>Music: <strong>Anchorlight</strong> </p>\n\n\n<p>AND </p>\n\n<p>Pirate Software for hosting this gamejam (ref. https://develop.games/gamejam/)</p>\n<p><strong>Feedback<br/></strong>All feedback / bug reports / ideas are welcome in the comments below<br/></p>\n<p><strong>Gamejam themes:</strong></p>\n<p><em>Sacrifice Is Strength</em></p>\n<p>A good game to check out for sacrifice is strength ideas is Inscryption. This is a card game where you sacrifice cards for greater power. Also the cards are alive and you're terrible for doing that to them.</p>\n<p>ART RESTRICTION</p>\n<p><em>2 Bit Colors</em></p>\n<p>For 2 bit colors you'll need to use black, white, and one other color. You can also just make the game fully black and white if you'd like to. You can do shading in this style using Dithering so make sure to read up on that. You can also use color variants such as gray, dark gray, and solid black. The idea is to restrict your pallete and try new things with that restriction. A good example of this is Downwell. This color doesn't need to remain the same throughout the game. Go wild and have fun with this!</p>\n\n<p><strong>OSTs:</strong></p>\n\r\nanchorlight · Ballrogue - Final Tilt\r\n\r\nanchorlight · Ballrogue", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2022-07-01T11:50:23", "background_image": "https://media.rawg.io/media/screenshots/bd2/bd20e88ced95af66e96798a02f22ced2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ASarevok"], "genres": ["Action"], "publishers": [], "esrb_rating": null}