{"id": 811557, "slug": "shape-of-dreams", "name": "Shape of Dreams", "name_original": "Shape of Dreams", "description": "<p>Sail a Barque in the unknown ocean of the mind, exploring : emotions and memories, thoughts and ideas, fears and traumas and the depths of one self. \r\nA beautiful Psychonautic experience full of colour. A conquest of understanding the inner world and it's mysteries. Marvel at the vastness of this new world and construct your own mind palace.</p>\n<p>Shape of Dreams est un jeu d’aventure à la troisième personne où l'on incarne Arthur HUXLEY, un peintre bloqué dans son cerveau, qui doit réactiver son esprit pour se réveiller de son coma. Il va devoir traverser, à bord de sa barque, une mer où se trouve des temples parsemés d’énigmes qui lui permettront de retrouver ses capacités. Shape of Dreams repose sur le principe que le joueur se trouve dans la conscience du personnage actuellement endormi. <br/><br/>On y joue donc une projection de forme humaine qui doit réactiver différentes parties de son esprit pour pouvoir se réveiller. Le jeu se base sur la résolution d’énigmes à l'intérieur de 2 temples qui exposent différentes mécaniques. Le déplacement entre les temples sera fait dans une barque sur la mer. <br/>Chaque temple représente une caractéristique du cerveau , le Contrôle du corps et les Émotions<br/></p>", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2022-07-01T12:08:22", "background_image": "https://media.rawg.io/media/screenshots/441/441f52993ee9a4b6713353ae94be2e48.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nagaoo0"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}