{"id": 811643, "slug": "mutation-madness", "name": "Mutation Madness", "name_original": "Mutation Madness", "description": "<strong>Enter the World of Mutation Madness!</strong><br/>Equip yourself with a powerful disinfectant gun and stand against hordes of mutant viruses to rescue Cell City from a devastating outbreak. Upgrade your weapon, unveil hidden secrets, and immerse yourself in non-stop action. Prepare for an epic battle of intensity and strategy!<br/><br/><strong>Thrilling Gameplay: </strong> As a skilled scientist armed with a disinfectant gun, navigate diverse levels and maps to eliminate waves of mutant viruses in exhilarating combos.<br/><br/><strong>Powerful Items:</strong> Use tactical in-game items like vaccines and antivirals to strategically enhance your gameplay and combat abilities.<br/><br/><strong>Weapon Upgrades:</strong> Enhance your arsenal by unlocking powerful upgrades for your disinfectant gun, allowing you to tackle tougher challenges with greater firepower.<br/><br/><strong>Mascot Companions: </strong> Team up with cute and fearless mascots to fight the virus and restore safety to the city!<br/><br/><strong>Special Modes:</strong> Engage in special game modes, including the thrilling Infinite Mode, where you'll face endless hordes of viruses, testing your skills and endurance to the limit.<br/><br/><strong>Virus Information:</strong> Unveil hidden secrets and gather crucial information about the virus outbreak as you progress, piecing together the mysteries behind the Madvirus.<br/><br/><strong>Hard Mode:</strong> Take on the outbreak's deadliest waves in Hard Difficulty mode. Prove your expertise as you battle mutating viruses on a whole new level.<br/><br/><strong>Achievements:</strong> Conquer levels, defeat foes, and accomplish special feats to earn a range of achievements. Demonstrate your mastery of the outbreak and earn well-deserved recognition.", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2023-12-08T06:45:50", "background_image": "https://media.rawg.io/media/screenshots/a3e/a3e48388209c575589bbf09447635018.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Frederico Proença", "Ana Rita Passos"], "genres": ["Action", "Shooter", "Casual", "Educational", "Indie"], "publishers": ["PLAYMUTATION"], "esrb_rating": null}