{"id": 811697, "slug": "treasure-in-the-depth", "name": "Treasure in the Depth", "name_original": "Treasure in the Depth", "description": "<p><strong>Story</strong></p>\n<p>Our main character, Joseph Blackbeard, who is the captain of the ship at the beginning of the game, tells the crew \"We are under attack!\" He wakes up with his cries. When Joseph Blackbeard comes out of his room and looks around, he sees the enemy ship's artillery hitting the ship. To defend the ship, he orders his crew to attack the ship, but the ship is already about to sink. And suddenly he faints with the pieces falling from the mast of his ship. A spirit found from the depths of the sea hears the captain cry and heals the captain to help and grants him magical abilities. When the captain wakes up, he is on a board and is pushing the sea captain towards an island. He wakes up with the burning sun. When he looks out to sea, he sees the wreckage of the ship and the pieces floating ashore with the waves. He thinks that he should take a sword before proceeding to the island and finds it from the pieces dragged with him. He begins to walk deeper into the island. He finds a man-made path in these depths and starts walking from that path. The trail leads Joseph Blackbeard to a small enemy camp. He neutralizes the enemies and looks at the island map that they are examining. He learns how to progress on this map. He takes weapons from the enemies he killed and continues on his way.</p>\n<p>The spirit, united with the captain, begins to communicate with him. He talks about his new abilities. While on this road, the captain encounters enemies again. He arrives at the enemy's camp and clears it. At the end of the path, he finds the ships of the enemies and leaves this island.</p>\n<p><strong>Player Control</strong></p>\n<p>\"WASD\" keys to walk.<br/>\"Mouse\" movement to look around.<br/>\"SHIFT\" key to run.<br/>\"F\" key to interact items and save point.<br/>\"Scroll Button\" to lock enemies.<br/>\"Scroll Wheel\" to change locked enemies.<br/>\"Mouse Left Click\" to attack.<br/>\"Mouse Right Click\" to block.<br/>\"1\" button to change primary weapon.<br/>\"2\" button to change secondary weapon.<br/>\"4\" button health potion.<br/>\"P\" button to skill tree.<br/>\"Q\" button to use skill.<br/>\"ESC\" button to menu.</p>\n<p><strong>Group Members</strong></p>\n<p>Erdem Demir<br/>Tayyib Bayram<br/>Yusuf Uslu</p>", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2022-07-01T13:14:23", "background_image": "https://media.rawg.io/media/screenshots/acc/acceab979b336d23a00f0f972aaac91e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ErdemDemir"], "genres": ["Action"], "publishers": [], "esrb_rating": null}