{"id": 811809, "slug": "maze-of-misfortune", "name": "Maze of Misfortune", "name_original": "Maze of Misfortune", "description": "<p>Play as Sammy the salmon, Tilly the turtle, and Nora the narwhal. Help these ocean travellers navigate the ‘<strong>Maze of Misfortune</strong>’ and reach their breeding grounds in this maze chase-‘em-up inspired by the retro classic Pac-Man. Answer questions to open blocked paths and learn about the dangers these amazing creatures face everyday. Escape enemies that represent real world hazards; from invasive species, to discarded plastic, to ship collisions. Survive through random events such as storms and heat waves. Eat as much food as you can to get a high score and compete in the leaderboard. Maze of Misfortune is a fun maze game with an educational twist. Learn about these creatures as you play, their lifecycles and habitat needs, the dangers they face, and the damage that humans are causing to the world around them.</p>\n\n<p><strong>Features:</strong>\n</p>\n<ul><li>Play as 3 different animals - Sammy the salmon, Tilly the turtle, and Nora the narwhal!\r\n  </li><li>3 levels, each with unique graphics.\r\n  </li><li>Eat as much food as possible to get a high score and compete in the leaderboard.\r\n  </li><li>Answer multiple choice questions to open blocked paths.\r\n  </li><li>Learn about these creatures as you play, their lifecycles and habitat needs, the dangers they face, and the damage that humans are causing to the world around them.\r\n  </li><li>Full controller support for PC version with control images for PS5/4, Xbox &amp; Nintendo Switch controllers.</li><li>Simple controls - simply press (or swipe on Android) up, down, left, or right to set your character their next direction!\r\n  </li><li>Fun and educational 60 question quiz to unlock!</li><li>10 medals to unlock by completing fun challenges.\r\n  </li><li>Original music.</li></ul>\n<p> </p>\n<p><strong>More Information:</strong>\n</p>\n<p>Maze of Misfortune was developed by Bare Knuckle Development and the University of Essex for the 2022 Royal Society Summer Exhibition, where academics at the University of Essex were leading an exhibit called Ocean Travellers. The goals of the exhibit were to emphasize the importance of movement in the ocean and the impacts that humans are having on their ability to move, survive and reproduce. The exhibit contained three ‘worlds’ - micro, meso and macro - and this game was showcased in the latter, to emphasize the importance of long-distance movements and the vulnerability of these migratory species to global change.</p>\n\n<p>With the exception of Nora the Narwhal, the heroes of the game are not specified to species level, as we wanted to emphasize the variety of stressors that different salmon and turtle species encounter. Similarly, many of the questions in the third level focus on general whale ecology given how important they are at a  global level. We also wanted to cover a range of habitats and latitudes, covering temperate systems and river spawning grounds for salmon, tropical systems and beach nesting habitats for sea turtles, and polar systems and pelagic breeding grounds for the narwhal. </p>\n\n<p>The Narwhal was chosen for the final level as it is the totem animal of a European scientific network that co-sponsored the game - SEA-UNICORN (Unifying approaches to Marine Connectivity for Improved Resource Management for the Seas; COST Action CA19107). This network brings together scientists and stakeholders to advance knowledge on marine functional connectivity (the exchange of individuals among habitats) and to contribute to the conservation and sustainable management of the seas. \r\n</p>", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2022-07-01T14:01:59", "background_image": "https://media.rawg.io/media/screenshots/389/389e34aed2f7aab4ec33af92d822b39f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "PC"], "developers": ["BareKnuckleDev"], "genres": ["Action", "Educational"], "publishers": [], "esrb_rating": null}