{"id": 8118, "slug": "32-secs", "name": "32 secs", "name_original": "32 secs", "description": "Get on your motorcycle and race through the traffic in the sci-fi metropolis with high-speed! Overcome all of your opponents, reach the maximum speed, collect coins, upgrade your bike’s abilities to be the King of the highway!<br/><br/>32 Secs: Traffic Rider is guarantee a fantastic race in a not-so-far-future where the bikes rush with incredible speed and break up the asphalt! This Traffic Rider game is quite different than any other bike games! If you want to get a sneak-peek to the future, if you like to race without limits, if you enjoy the challenges the 32 Secs: Traffic Rider will be your favourite motorcycle racing game!<br/><br/>32 sec is a motorcycle race game with amazing sci-fi looking environment. Ride on futuristic high-speed bikes and test your racer skills in heavy traffic on the crowded highways! Rush and take your best to overcome your opponents but be careful and don’t crash your bike! In this awesome motorcycle race you can drive as fast as possible by using nitro and turbo zones! In 32 secs: Traffic Rider the highway where you can race is grip like Asphalt!<br/><br/>Try different futuristic bikes on sci-fi looking highways, upgrade your vehicle and be the fastest traffic rider in this rapid rush! Improve your racer skills and reflexes in heavy traffic, avoid enemy’s bikes, beat other racers but take care of your bike! Try to become a master in this hard race! Upgrade your bike to get higher speed and exact handling, use boosts to be the most skillful Traffic Rider on the city highways and win the race! Compete against time and other riders. Discover the glowing, futuristic highway, find every boost and collect as many coins as you can to upgrade your motorcycle and reach unthinkable high speed! Unlock new garages, customize your bike, make it faster, harder, upgrade all abilities to the max level and you will be able to overtake everybody!<br/><br/>Let’s take a deep breath, get on your bike and be ready to rush! Ride as fast as you can, dominate the highway, enjoy the high-speed race in heavy traffic, watch out for the civilians in the rush, but don’t get easy with the opponent racers! Play every day and get your daily reward!<br/><br/>In 32 Secs: Traffic Rider’s world the race with time is everyday struggle!<br/>Are you ready to put on your racing suit, smash your rivals, master the traffic rush, collect your earnings and make your way to the last zone of the monumental metropolis?<br/>NOW you can be free in the traffic, it’s allowed to do anything what you want to, no rules, no speed limits, just go ahead full throttle and enjoy the speed!<br/>Let’s ride on your bike and start the race!<br/><br/>PRO TIPS<br/>* Keep going through the turbo zones for maxiumum velocity<br/>* Hit the opposition, but be careful with your bikes health<br/>* Burn your nitro often and mix it up with the turbo zones<br/>* Upgrade all abilities of your motorcycle to the max!<br/>* Use the bike brake in unexpected situations!<br/><br/>KEY FEATURES<br/>* Masterful audiovisuals<br/>* Superb pace and gameplay<br/>* Unique futuristic motorcycles<br/>* Intuitive upgrade system<br/>* Full retina display support<br/>* Leaderboards &amp; achievements<br/><br/>Please rate 32 Secs: Traffic Rider and leave us a comment, to help to improve your bike racing experience!<br/><br/>Don’t forget: In real life DO NOT race in traffic, don’t cross the speed limits! Please take care of each others and your bike too. :)<br/><br/>Twitter: https://twitter.com/istomgames<br/>Facebook: http://www.facebook.com/IstomGames<br/><br/>Created By isTom Games, creator of Nyan Cat: Lost in Space, Mad Bullets, Blocky Castle, Relic Looter: Mask of Tomb, and Swiper Cyber.", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2019-10-22T14:01:22", "background_image": "https://media.rawg.io/media/screenshots/8e0/8e0caa3fd58e682613f83e6dd82aa8a7.jpeg", "website": "http://www.istomgames.com/32secs/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Istom Games Kft."], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["Istom Games Kft."], "esrb_rating": "Everyone 10+"}