{"id": 812159, "slug": "otometeki-koi-kakumei-love-revolution", "name": "Otometeki Koi Kakumei: Love Revolution!!", "name_original": "Otometeki Koi Kakumei: Love Revolution!!", "description": "<h2>&#39;Otometeki Koi Kakumei: Love Revo!!&#39; (otherwise known as 乙女的恋革命ラブレボ!!) is a Japanese otome visual novel developed by HuneX. Starting out on the PlayStation 2 and later receiving ports, it was initially released on January 26th, 2006. It has received unofficial English translation patches.</h2>\n<p>The story begins with the main character, Hitomi Sakuragawa, who was once known for her attractive looks and esteemed background. Winning beauty pageants and receiving sugary treats left-and-right, her future was looking promising... until she checked in at 100kg on her second year of high school. Determined to change her life around for the better, a girl&#39;s journey of her well-being and love life begins to blossom!</p>\n<p>Live through the eyes of Sakuragawa, as she marches towards many short-term goals; which you, the player, affirms decisions on what she does on a day-to-day basis. Investing in certain action points will change the outcome! Meet with over eight love interests, complete with full voice acting and illustrated scenes, who all strive to support Sakuragawa as she overcomes the hurdles that life presents her.</p>", "metacritic": null, "released": "2006-01-26", "tba": false, "updated": "2022-07-02T21:28:42", "background_image": "https://media.rawg.io/media/screenshots/39f/39fbf09a6bb95633f2829cbd6a72ce69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PSP", "PC", "PlayStation 2", "Nintendo DS"], "developers": ["HuneX"], "genres": ["Action", "Casual"], "publishers": ["Idea Factory", "Interchannel", "Otomate", "GungHo"], "esrb_rating": null}