{"id": 81211, "slug": "darklings-season-2", "name": "Darklings Season 2", "name_original": "Darklings Season 2", "description": "An Editor’s Choice game from an award winning franchise with beautiful visuals and addictive tap and swipe action now free to play! <br/><br/>When darkness spreads to the far reaches of the universe, only you can lead our hero, the mighty yet totally adorable defender of light, to fight evil and save the world! <br/><br/>Draw cool shapes, make epic combo moves, and master your powers as you explore a mysterious universe of danger and adventure. As you continue your quest, you will gain trophies, unlock hilarious hero costumes, and level-up your attacks to obliterate thousands of minions and extra-nasty bosses. And, you’re not in this alone, use the power of social to join up with your friends and battle across the world! <br/><br/>DRAW cool shapes by tracing stunning light designs across the screen <br/>UNLOCK over 50 amazing hero costumes including samurais, superheroes, and holiday mascots <br/>CLASH with more than 80 Darkling enemies and 6 bosses, each with a different shape to learn <br/>EXPLORE 6 beautifully rendered worlds as you travel across the map <br/>COMPETE with your friends on leaderboards and in massive group battles <br/>DISCOVER the mysteries and secrets of the Darklings as you level-up your hero, add sidekicks, and learn spells <br/>MASTER all the shapes and combinations to save the universe and maximize your score", "metacritic": null, "released": "2015-02-12", "tba": false, "updated": "2019-10-22T14:22:22", "background_image": "https://media.rawg.io/media/screenshots/655/655524b45df89d2f07d0a707b547ecad.jpg", "website": "http://mildmania.com/season2", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MildMania"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["MILDMANIA OYUN BILISIM LTD STI"], "esrb_rating": null}