{"id": 812189, "slug": "rfvr", "name": "RFVR", "name_original": "RFVR", "description": "<strong>Welcome to RFVR</strong><br/><br/> a massive open world VR RPG set in a magical fantasy medieval world on a remote and dangerous island. Here there are thousands of acres of wilderness to explore including large complex cave systems, ancient ruins, and sparse human settlements throughout one persistent world with no loading screens or instances. <br/><br/><strong>Intense Combat</strong><br/><br/>Combat is fast paced and physics based, allowing for any combination of melee, magic spells, ranged weapons, or summoning. <br/><br/><strong>Deep Player Progression</strong><br/><br/>Level up through experience gained from combat and find quests for various professions such as cooking, farming, blacksmithing, hunting, and mining.  Leveling up these professions will have a profound impact on the effectiveness of each. Profession levels are increased by performing specific tasks related to the profession, such as harvesting the meat from a deer, crafting a campfire, cooking food, mining crystal ore, blacksmithing a weapon, or even planting a seed.<br/><br/><strong>Expand your influence</strong><br/><br/>Assist the colonies with expansion by building new structures, equipping the town guard with more powerful weapons and armor, and providing other goods and services to the townsfolk. <br/><br/><strong>Online CO/OP</strong><br/><br/>Best of all, you can do all of this with friends online. RFVR is still in active development and has plenty of room to grow with realistic goals, and a dedicated, highly motivated solo developer.", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-04T04:29:50", "background_image": "https://media.rawg.io/media/screenshots/b3c/b3ccb7fcc2256abc57b83d5d09413289.jpg", "website": "https://rfvr.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 475, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OMFGames"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Indie"], "publishers": ["OMFGames"], "esrb_rating": null}