{"id": 812234, "slug": "orbital-approach", "name": "Orbital Approach", "name_original": "Orbital Approach", "description": "Orbital Approach is a game about launching a spaceship from a starting point into a goal while avoiding obstacles along the way, all while trying to achieve the highest possible score. The ship is controlled through an initial burst of speed that you give it in a specified direction, and then is manipulated and bent by the gravity of nearby planets and other objects that it passes by on the way. Avoiding crashing into these objects while also using their pull to bend your path towards the goal is the challenge of the game, and the challenge level ranges from trivial to highly complex and precise. The score is calculated through the distance achieved by a successful path to the goal, plus bonus point pickups scattered in the levels<br/>\n<br/>\r\nThe look of the game is a pixel art style, with some animations and minor particle effects. The feeling the game is designed to evoke is relaxation and satisfaction, gained from thinking outside the box to beat the game's challenges.<br/>\n<br/>\r\nThe various mechanics in the game are as follows:<br/>\n<br/>\r\nBonus points - bonus points increase your final score by a fixed amount for each one that you pass through on your way to the goal<br/>\n<br/>\r\nPlanets - planets have various physical sizes in addition to various ranges and strengths for their gravitational fields<br/>\n<br/>\r\nAsteroids - asteroids have no gravitational fields, but instantly cause level failure if you touch one<br/>\n<br/>\r\nBlack Holes - black holes are identical to planets except for the fact that they have normalized gravity, where the strength of the pull of their gravity isn't affected by distance and so traveling past one of these has strange effects. These also do not appear until later in the levels, and so players do not encounter them for a while<br/>\n<br/>\r\nWhite Holes - white holes are also identical to planets except the fact that they push the spaceship away rather than pull them in\u2028\u2028Toggle Triggers - toggle triggers cause one or more objects to \"switch\" on or off. One of these can make an entire portion of a level disappear and an entirely new section pop up somewhere else, or they can simply switch a single object on or off. They are triggered by passing through them, and these also do not appear until later in the game.<br/>\n<br/>\r\nWormholes - wormholes instantly teleport the player from point A to point B while conserving their current speed and direction. Wormholes can simply be a one-way teleportation to a specific location or they can be linked to another wormhole to allow for two-way travel between both wormholes.", "metacritic": null, "released": "2022-07-31", "tba": false, "updated": "2022-07-04T05:49:46", "background_image": "https://media.rawg.io/media/screenshots/514/514b0b9d070347faad363f6d2eab86c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mashup Studios"], "genres": ["Casual"], "publishers": ["Mashup Studios"], "esrb_rating": null}