{"id": 812529, "slug": "stacked-idle", "name": "Stacked Idle", "name_original": "Stacked Idle", "description": "<p>How fast can you go? Get ready for this quick paced clicker game - “Idle Stacked!” - where speed and accuracy are your only allies! Rush to destroy the dropping bricks before they are burnt up in a fast-paced new take on the classic Brick Breaker!</p>\n<p>In this modern twist on classics like Brick Breaker, you rush to break bricks before they are destroyed by the flame spouts that run along the bottom of each level. Just when you think you have got it down, new challenges and feats are introduced to keep you on your toes in this whirlwind adventure!<br/><br/>Earn coins by breaking bricks and completing challenges to unlock new perks and multipliers! Our advanced game system also allows you to track your progress, game stats, and stream to your loyal fans on discord and patreon. Our game also includes an incredible soundtrack that will keep you mesmerized for hours as you play!<br/><br/><strong>Features:</strong><br/><br/>- Earn money as you break bricks and progress through levels<br/>- Purchase new modifiers and multipliers to earn additional coins for every brick you break!<br/>- An outstanding design and background to keep you entertained as you race to beat new levels!<br/>- A fantastic soundtrack that keeps you going as you smash through bricks and earn your spot as the top champion!<br/>- We track your stats for you so you can go back and check how much damage you have done!<br/>- Stream directly from our game to patreon or discord to share your triumphs with your loyal fans!<br/>- New challenges, features and updates on a regular basis.</p>", "metacritic": null, "released": "2022-07-03", "tba": false, "updated": "2022-07-04T11:32:58", "background_image": "https://media.rawg.io/media/screenshots/ba6/ba626124b7c85e03cdbcdda9fb036509.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ian Lomas"], "genres": [], "publishers": [], "esrb_rating": null}