{"id": 812524, "slug": "kelpie", "name": "Kelpie", "name_original": "Kelpie", "description": "Kelpie is an exploration puzzle game about a mythical horse, redemption, and helping lost souls find peace. Discover an endless Otherworld inspired by Scottish folklore.\r\n\n\n\r\nBe a horse\r\n<br/>Collect 🖤s<br/>Help spirits\r\n\n\r\n- Open world exploration in a procedurally generated world\r\n- Inverse minesweeper but without the stress of exploding\r\n- Knock down walls and build houses to fast travel between\r\n- Solve the questions of life in death\r\n\n\n\r\nInverse minesweeper?\r\n- In Kelpie you <em>want </em>to find the \"mines\". Instead of clicking on a tile, you move Kelpie about the world with WASD/arrow keys\r\n- Travelling on land is difficult for a loch spirit - collect 🖤s to top up your stamina - higher hills cost more to explore but yeild more 🖤s\r\n- 🖤s can also be used to help the lost souls &amp; purchase special items to aid in your exploration\r\n\n\n\n<br/>Kelpie is currently in development by Rianna Suen (@vividfax) and Dan Emmerson (@DoodleDemmy) of Cake Thursday. We were inspired to make Kelpie after a camper van trip around the highlands in April 2022.\r\nRianna is a Fine Art graduate, knitwear designer, and self-taught programmer at Hollow Ponds.\r\nDan is a 3D artist, technical artist and Unity programmer with 7 years in the games industry.\r\n\r\nTo keep up to date with our progress, follow us on twitter @itsCakeThursday, or drop us a line at cakethursdaygames@gmail.com", "metacritic": null, "released": "2022-07-03", "tba": false, "updated": "2022-07-04T11:31:16", "background_image": "https://media.rawg.io/media/screenshots/040/040c8ce6b7c763e185e6c4e222e981de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cake Thursday"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}