{"id": 81275, "slug": "briscola-10-in-1", "name": "Briscola 10 in 1", "name_original": "Briscola 10 in 1", "description": "With \"Briscola 10 in 1\" you can play \"Briscola\" in 10 different mode.<br/>Only one App to play the most popular card game in Italy.<br/>- Classic Briscola (2 players)<br/>- Classic Briscola (4 players)<br/>- Briscola with dead (4p)<br/>- Bricola Killer (2p), win with 31 Pti<br/>- Briscola Online (2p classic)<br/>- Briscola to Loose (2p) win player with fewer points <br/>- Briscola to Loose (4p) win team with most points <br/>- Briscola Mandatory (2p)<br/>- Briscola Mandatory (4p)<br/><br/>Set your preferences: <br/>- 12 different types of cards <br/>- 6 different types of gaming table <br/><br/># # # # # # # # # # # # # # # # # # # # #<br/><br/>Con la nuova \"Briscola 10 in 1\" puoi giocare a briscola in dieci modi differenti!!! <br/>Una unica App con 10 varianti del gioco più diffuso in Italia. <br/>- Briscola Classica in 2 giocatori. <br/>- Briscola Classica in 4 giocatori. <br/>- Briscola con il Morto, in 4 giocatori, le carte del tuo compagno sono scoperte e tu decidi anche la sua giocata. <br/>- Briscola Scoperta in 4 giocatori, tutte le carte in mano ai 4 giocatori sono scoperte. <br/>- Briscola Killer in 2 giocatori, vince chi realizza per primo 31 punti. <br/>- Briscola Online a 2 giocatori. <br/>- Briscola a Perdere in 2 giocatori, vince chi fa meno punti. <br/>- Briscola a Perdere in 4 giocatori, vince la squadra che fa meno punti. <br/>- Briscola al Palo (o Obbligata) in 2 giocatori, se possibile è obbligatorio rispondere alla prima carta giocata nella mano (palo). <br/>- Briscola al Palo (o Obbligata) in 4 giocatori, se possibile è obbligatorio rispondere alla prima carta giocata nella mano (palo). <br/><br/>Il divertimento va oltre alla classica briscola tra amici!! <br/><br/>------------------------------------------------------------ <br/>E' inoltre possibile scegliere tra: <br/>- 12 mazzi di carte <br/>- 6 tavoli su cui giocare <br/>- 5 tipologie di carte (retro) <br/><br/>------------------------------------------------------------ <br/>FAQ: Non possiamo rispondere direttamente alle recensioni, <br/>potete trovare tutte le risposte su www.essekappa.it?p=faq <br/>------------------------------------------------------------ <br/>NOTA IMPORTANTE !! <br/>------------------------------------------------------------ <br/>1) La logica di gioco (Intelligenza Artificiale) del vostro compagno è la stessa utilizzata dai due avversari (senza nessuna variazione). <br/>2) La logica di gioco (I.A.) utilizza ESCLUSIVAMENTE informazioni ricavate dall'andamento della mano. <br/>3) Le carte vengono SEMPRE distribuite in modo totalmente casuale ad inizio mano senza alcuna manipolazione o controlli storici sulle carte uscite nelle mani precedenti.", "metacritic": null, "released": "2014-09-03", "tba": false, "updated": "2019-10-22T14:22:23", "background_image": "https://media.rawg.io/media/screenshots/caa/caa49641efd9cb7a829af04ee7c321ed.jpg", "website": "http://www.skgame.it", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Marco Gentili"], "genres": ["Card"], "publishers": ["Marco Gentili"], "esrb_rating": "Everyone 10+"}