{"id": 813081, "slug": "touhou-bustling-rainbow-marketeer", "name": "Touhou: Bustling Rainbow Marketeer", "name_original": "Touhou: Bustling Rainbow Marketeer", "description": "<p>Touhou: Bustling Rainbow Marketeer is a bullet hell shoot-em-up made for the fourth annual Touhou Pride Game Jam. It is inspired by, and contains characters from the 18th entry of the series, Unconnected Marketeers.<br/></p>\n<p><em>Months have passed since the end of the Ability Card incident.</em><br/></p>\n<p><em>The tengu, market god, sly fox and the centipede miner have all left for their own paths, no longer seeing a reason to cooperate. The rainbow gems have returned to their rightful place, being watchfully guarded by the magatama master.</em><br/></p>\n<p><em>And yet today, Gensokyo has been overrun by a nationwide “Rainbow Market of Love”. (No one really knows what it is officially called.). The moment one walks into the bustling marketplace, they will be overflown with a desire to connect and love. Thus, the “incident” begins: Fairies fighting over fruit soon found themselves hand in hand singing together as if nothing had ever happened, humans and youkai were gathering together for elegant tea parties, and “enemies” and “rivals” were turning into “friends”... perhaps something more intimate, too?</em><br/></p>\n<p><em>“Even if this ‘love’ is beautiful, it is one that is artificial. Yes, this marketplace in itself shall not reach enlightenment.”\r\n</em><br/></p>\n<p><em>“What an interesting incident-causer, trying to create peace instead of destroy it? Now this is something worth investigating.”\r\n</em></p>\n<p><em>---<br/></em></p>\n<p><strong>As this game was made for a game jam, time constraints forced me to cut back on a lot of content that was meant for it. This jam version contains:</strong><br/></p>\n<p>+ A function that lets you set your starting lives! Five is traditional and the default... but how does up to <strong>999 </strong>lives sound to you? (You can also set it to 0,  but why though?)<br/>+ Two difficulties. Would you like a relaxing journey or a fierce challenge?<br/>+ Two player duos: two charming religious ladies and two handsome men(!?) who have decided to dabble in incident-solving, all with their unique shot-types and spellcards.<br/>+ Danmaku patterns with <strong>LGBTQ+-themed color palettes.</strong><br/>+ An intense 5-stage boss fight!<br/>+ A very short stage section meant to prep you up for the above! (No music for this one, unfortunately.)<br/>+ A simple scoring system. Speedkill and pointblank enemies for the fabled BIG NUMBER!<br/>+ An intense and exciting boss theme arranged from Unconnected Marketeers.<br/>+ Replay functionality (for real this time)!<br/></p>\n<p><strong>Future post-jam updates will add the following new content to enjoy:</strong></p>\n<p>+ More tracks (stage theme and title theme), as well as revisions to the boss theme!<br/>+ A longer stage and boss fight! <br/>+ Addition of missing assets and polishing of finished ones.<br/>+ Overall more lore and story.<br/>+ And perhaps other secrets!?</p>\n<p><strong>KNOWN ISSUES AND BUGS WITH THE JAM VERSION:</strong><br/><br/>+ <strong>Game-crashing:</strong> Attempting to restart the game via the \"Re-enter the Parade\" option (after clearing or getting a game over) will crash the game. Please exit to title manually (via the second option) and replay from there.<br/>+ Missing art assets.<br/>+ Visual bugs when the background opacity is below 100%.<br/>+ High scores (the Millionaire text on the HUD) are not saved.</p>\n<p>The Boss Theme is now available on SoundCloud! <br/></p>", "metacritic": null, "released": "2022-07-02", "tba": false, "updated": "2022-07-04T15:03:03", "background_image": "https://media.rawg.io/media/screenshots/b6c/b6c3e78e9b7e2cac2cae24c7de99d256.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kevin Mink"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}