{"id": 813064, "slug": "planetary-defense-an-orbital-turret-defense-system", "name": "Planetary Defense: An Orbital Turret Defense System", "name_original": "Planetary Defense: An Orbital Turret Defense System", "description": "2D Space shooter meets Tower Defense! Defend your planet from asteroids and aliens with classic top down shooter gameplay and build orbiting turrets to shoot down the invaders!<h3>Player Facilities:</h3><strong>Surface Cannon </strong>: point and click to aim and fire the Surface Cannon, upgrade it to improve its range, accuracy, and even add barrels for more fire power.<br/><br/><strong>Satellite Factory</strong> : build custom Sat-Turrets to deploy into orbit for automated defense. Equip them with 2, 3, or 4 guns and tune the targeting and firing mechanism for the optimal offense and shields and armor for definitive defense. More than 200 combinations!<br/><br/><strong>Munitions Plant</strong> : What’s a turret and cannon without its munitions? Build custom missiles with different warheads, fuel systems, and thrusters to create the ultimate peace making device to load into your cannon and Sat-Turrets<br/><br/><strong>Shield Generator </strong>: The Planet is a fragile thing, only one hit can end it all! Keep the shields up and upgrade them to take more hits, regenerate faster, and deflect damage<h3>Hazards:</h3>\tAsteroids: classic hazard, they move in a linear fashion and create smaller asteroids when destroyed<br/>\tUFOs: There are 4 UFOs each with a different attack pattern, The Red Roamers, Orange Orbiter, Green Getters and Blue Bombers<br/>\t??????: What is this new devilry?<br/><br/><br/>Your support will go a long way in helping the development of the game. Below is a roadmap for the planned updates however fixes and balances will be made when necessary.<h3>Future Development Roadmap</h3>October - Frigate Reinforcements: This update will introduce a new enemy type and new or updated sprite artwork<br/>December - Story and ScoreBoard : This update will contain new story elements to help set the stage and add flavor to the in game moments. The Scoreboard will also be updated to feature more information on the play session such as; how many Sat-Turrets and Missiles were created, how many and what type of enemy was defeated. Also a new global scoreboard will be introduced so everyone can share and fight for the glory<br/>January - Lunar Defense : In time for the new Lunar Year, this update will feature a new game mode!<br/><br/><br/>This game was created entirely by one person. All (non UI) sprites were made by me, all code was created by me, the music I acquired from Karl Casey at White Bat Audio. Check out his BandCamp and Youtube page for more epic synth music! The ambient track in the background was created by my Audio Engineer friend Samwise.<br/><br/>This game is a passion project and your support will go a long way in not only helping the game but helping the 2 amazing music artists who lent their talent for this project. <br/>This project has been about a year in the making, I started designing the game back in 2021 but didn’t start coding or building until the Summer of 2022 where I gave myself 10 weeks to create a finished project.", "metacritic": null, "released": "2022-07-02", "tba": false, "updated": "2022-08-12T06:27:05", "background_image": "https://media.rawg.io/media/screenshots/f81/f81a3add031e06307b40905182af11d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Natedog769", "SODEC Games"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["SODEC Games"], "esrb_rating": null}