{"id": 813152, "slug": "indiepocalypse-30", "name": "Indiepocalypse #30", "name_original": "Indiepocalypse #30", "description": "ISSUE #30\r\nCover - Michelle T\r\n\n<p>Hello and welcome to Indiepocalypse!</p>\n<p>Indiepocalypse is a curated monthly collection looking to highlight the very best of the indie game scene. </p>\n<p>Each month features games by 10 different developers, including a newly commissioned game exclusive to the bundle-zine. The games cover a wide variety of styles, genres, and themes as they fight against any definition of \"indie game\" as a genre.</p>\n<p>Also, and this part is very important to me and should truly be taken as given, each contributor is paid and developers are paid royalties on all future sales.</p>\r\nThis Month's Games\r\n<br/>Underliner (WIN/MAC/Linux) by Jungwoo Yom\r\n\n<p>The unusual combination of lollipops and bullets invites you to a world full of puzzles and surprises. In puzzles, each rule combines with other rules, challenging players to think in clever and novel ways.</p>\n<p>In Underliner, the bullet changes its direction constantly, bouncing between colorful lollipops. Wide variety of lollipops and other objects will influence the bullet’s trajectory in unexpected ways.</p>\n\n\r\n12 Labors (WIN/MAC) by Brendan McLeod &amp; Garrett Steele\r\n\n<p>A short narrative game about getting over your mistakes, generational trauma, and the recuperative power of yardwork.</p>\n\n\r\nEvelyn's Farm (WIN/MAC) by James Senter\r\n\n<p>To save money for college, you and your friends Ivan and Lucy have agreed to help an old lady, Evelyn, with the harvest. What could possibly go wrong? As you pick pumpkins and apples, you notice a barn full of incomprehensible machines and a forest full of unfriendly creatures. Clearly, there's more to Evelyn than meets the eye...</p>\n<p>Features: *NOT a cozy farming sim. *A nonlinear story with many possible endings.</p>\n<p>*Idle gameplay: manage resources and make progress even while you're away.</p>\n<p>*Gradually explore a vast, unexpected world. *Partly inspired by a recent show set in Indiana...</p>\n\n\n\r\nPhantom's Revenge (WIN) by Ben Saint\r\n\n\n<p>Take on the role of Phantom Horn, a katana-wielding slime-infused socialist pony gangster with a bone to pick. Battle your way through mad science pony and war criminal Night Star's secret lab using the power of SLIME! (The many uses of which are so obvious I won't insult your intelligence by enumerating them here.)</p>\n<p>Play fetch with your radioactive pet horse, trade stocks and crypto on your gellphone, marry your sword, and dab on the corpses of more than 50 unique enemies as you carve a bloody path toward vengeance. You'll need to manage your resources carefully to survive the gauntlet. A single slip up could cost Phantom his life, or worse. How much are you willing to sacrifice for the sake of... REVENGE?</p>\n\r\nGUACUCO (WIN/MAC) by Sol Martínez Solé / avyary / Jeremy Diamond\r\n\n<p>GUACUCO is an experimental interactive diorama about confronting traumatic memories and letting them go.  You're stuck in your nightmares, and the only way out is to face your pain, gather all your memories, and return them to the flow of time.</p>\n\r\nGet to Hangar 18! (Physical) by Jonathan Dersch\r\n\n<p>For decades the Earthling’s have kept you hidden away in their secret bunker. But today you’re busting out! Your spaceship awaits. Hop in a car and get to Hangar 18!</p>\n<p>Get to Hangar 18 is a one-shot tabletop role-playing game. Players are psychic aliens, trying to repair their spaceship. Uses a standard playing card deck instead of dice. Features lots of tables for GMs to create random events, people, and vehicles.</p>\n\n\n\r\nWhat da Fairy doin? | Bad Bad Brew | Deadlight (Physical) by Cabbagehead\r\n\n<p>Cabbagehead brings three TTRPGs to this issue of Indiepocalypse. New to the scene, Cabbage started creating tabletop role-playing games this year. Their games focus on being funny, personal and physical. Mix potions in Bad Bad Brew, cause magical chaos in What da Fairy Doin? and survive against the dark in Deadlight.<br/></p>\n\n\r\n\r\nMaking Friends (WIN/MAC/Linux/Android) by Autumn Greenley, Elita, Ace Luke\r\n\n<p>A lonely witch finally completes her prized creation after years of mischievous preparation... and it's cuter than she ever imagined! Follow her, her homunculus, and a forgotten friend in this informative course about emotions and magic 🔮</p>\n<p>Created with the intention of being a short, sweet, experience! Find a single ending within half an hour, or find all the hidden possibilities within an hour...!</p>\n\r\n\r\nIn the Shade of Lilies (WIN) by Team Insania (MadnessWay Games, John Krzywicki, lewis mcdonald, Winter Iris)\r\n\n<p>From the moment we are born, we are instilled with certain ideas regarding the limits of realism and fantasy. But what is the exact difference between this? Is there even one? And more importantly, do you still think you can tell the real from the unreal?</p>\n<p>Discover the possibilities of this concept in this short visual novel following the story of Silvia and her cat, Simone.</p>\n\n\r\n\r\n*NEWLY COMMISSIONED FOR INDIEPOCALYPSE*\r\nDistant Memories (WIN) by Mer Grazzini\r\n\n<p>Each Autumn equinox people send their thoughts to the sky in bright round lanterns. You, as the Coping Dragon, can catch them and get an insight on thousands of small stories. Will you gather your sibilings and be ready to explore feelings, on this brand new Procedural-poem-catch ‘em up™?</p>\n\n\n\n<p> </p>\n<p><strong>*BONUS*Electric Zine Maker </strong>(WIN/MAC) by alienmelon</p>\n\r\nLauncher Courtesy of MM Bundle Launcher\r\n\r\nIndiepocalypse zine contents\r\n<p><strong>COMICS<br/></strong><em>The Next Day </em>by Sam Pender</p>\n<p><strong>FEATURES</strong><br/><em>Cassidy's Bad Game Good Game Ideas Corner </em>by Cassidy<br/>Parts 64-66 of <em>69 Games About Romance</em> by Andrew<br/></p>\n<p>Interested in the Indiepocalypse being delivered straight to you every month? Sign up for the <strong>PATREON</strong>.</p>\n<p>If you are interested in contributing to Indiepocalypse check out the submission page:</p>\n<p><strong>SUBMIT YOUR GAME TO THE INDIEPOCALYPSE</strong></p>\n<p><strong>TUNE INTO INDIEPOCALYPSE RADIO, SATURDAYS 2pm EST</strong></p>\n<p><strong>FOLLOW INDIEPOCALYPSE ON TWITTER</strong><br/></p>\n<p><strong>COMIC ARTISTS AND OTHER ZINE CONTRIBUTORS APPLY HERE</strong></p>\n<p><strong>SIGN UP FOR THE NEWSLETTER </strong>(and get free copies of the PDFs!)</p>\n<p><strong>THE FULL INDIEPOCALYPSE CATALOG</strong></p>\n<p><strong>DISCORD</strong></p>\n<p><strong>ADVERTISE WITH US</strong></p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T15:30:01", "background_image": "https://media.rawg.io/media/screenshots/749/74991c92a3db56d3010df68082ddd4b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PIZZAPRANKS"], "genres": [], "publishers": [], "esrb_rating": null}