{"id": 813133, "slug": "buff-butt-squat-off", "name": "Buff Butt Squat-off!", "name_original": "Buff Butt Squat-off!", "description": "<p>It's time to work on those GLUTES!</p>\n<p>\n</p>\n<p><em>Buff Butt Squat-off</em> is an online multiplayer <strong>pissing contest</strong> where you have to squat more than everybody else in the Gym. It is my birthday gift for a VTuber I really enjoy watching and who talks a lot about her butt, BuffPup!</p>\n\r\nHow to play\r\n<p>Just move your mouse up and down to squat. Squat more than everybody else and you will get a nice trophy!<br/></p>\n<p>If you want to close the app, just click it and hit Escape. Bear in mind that quitting does not save your progress, so you might want to open the menu first.</p>\n<p>Also there's achievements, how cool is that?<br/></p>\r\nInstall instructions\r\n<p>You can download the INSTALLER version, which will guide you through the process and will even let you launch the app automatically when your PC is turned on. To uninstall, you must then run the installer again and uninstall the app.</p>\n<p>You can also download the ZIP version, which just needs to be extracted! Once you've extracted the whole folder somewhere, run the .exe located inside and you're playing! To uninstall this version, simply delete the folder! Note that the ZIP version does not let you auto-launch the app when booting your computer.<br/></p>\r\nTroubleshooting &amp; help\r\n<p><em>My name has been taken, who the fuck did that?</em><br/>I cannot tell you who did it, but I can manually free the name so you can take it. Please hit me up on Twitter to do so.</p>\n<p><em>A name is offensive!</em><br/>Please report offensive names immediately to me on Twitter. I will remove them and permanently ban whoever was offensive.</p>\r\nCredits\r\n<p>Development by MonAmiral<br/>Art by rosedoodle<br/>Huge thanks to Goujer for testing and helping so much!<br/></p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T15:22:39", "background_image": "https://media.rawg.io/media/screenshots/7a0/7a07bad63e1123c84d5ff8c607dcb533.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mon amiral"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}