{"id": 813147, "slug": "hole-the-food", "name": "Hole The Food", "name_original": "Hole The Food", "description": "<p><strong>NOTE: THIS IS AN EARLY RELEASE FOR FEEDBACK TESTING<br/></strong></p>\n<p>This is a game set to release on Android/IOS. This version is playable on PC, a quit button is also added to the main menu. The game screen maybe very small when you launch it but feel free to resize to an optimal resolution (ideally 16:9 aspect ratio). This is an early build, you may come across bugs.<br/></p>\n<p><strong>NOTE: IF YOU PLAY ON WEBGL, DATA IS NOT SAVED. If you would like to have the game save and be able to access a level after completing it, you will need the downloaded version.</strong><br/></p>\n\n<p>If you come across any bugs please report it in the feedback form.<br/></p>\n<p><strong>Feedback form</strong>: https://docs.google.com/forms/d/e/1FAIpQLSdgCx16-4JPFN6WmFxpB9PS0PEnt7aRcvdQb5FpZe4RwqH5iQ/viewform<br/></p>\n<p>The objective of Hole The Food is to get the food to fall in the correct hole (purple holes). You must tilt the map to move the foods around the map, different colored floors and different types of foods will react differently to the map. The game uses Unity's physics engine to 'accurately' move objects accordingly through realistic expectations, although some foods being far more bouncy than reality.<br/><br/></p>\n<p><strong>PC CONTROLS:</strong></p>\n<p>W - Up</p>\n<p>S  - Down</p>\n<p>A - Left</p>\n<p>D - Right<br/></p>\n<p>Alternatively use the virtual gamepad at the bottom left in the game.</p>\n\n<p><strong>ANDROID CONTROLS:<br/></strong></p>\n<p>Virtual gamepad, touch screen.</p>\n\n<p>This version contains 20 levels, and may contain bugs.  The full version will contain more levels and will be further polished.<br/><br/></p>\n<p>The game is set to release soon on IOS and Android (no set release date yet). An Itch.io release is being considered.<br/></p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T15:27:51", "background_image": "https://media.rawg.io/media/screenshots/40b/40b58913af08005fd7d280c8b9be894b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "PC"], "developers": ["Digital Corgi Productions"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}