{"id": 813281, "slug": "sleight-of-hand-leo-schmidt", "name": "Sleight of Hand (Leo Schmidt)", "name_original": "Sleight of Hand (Leo Schmidt)", "description": "\n<p>\"<strong>Sleight of Hand</strong>\" is a fantasy interactive story about the struggles of a young writer, who will face obstacles on the way to get their unstable world-changing ability under control, and find that there is much more to them than they have previously thought.</p>\n<p><em>Wonderful template I used in the game is a Twine/Sugarcube 2 Template created by a.w. morgan! </em></p>\n<p>Now, onto the <strong>features</strong>:</p>\n<ul><li>Customize your \"little Raven\";</li><li>Find out the secrets the Ravenstorm family kept from you, do your research or pretend nothing strange had happened;</li><li>Be the master matchmaker your older brother deserves (<em><strong>only</strong></em> if Victor is not your RO).</li></ul>\n<p><em>What to expect from Chapter Two:</em></p>\n<ul><li>Deciding on University program and hobbies;</li><li>Nearly dying to a Nightmare on the campus grounds;</li><li>Getting closer to one (or two...) of the RO's at the chill birthday party;</li><li>Sorting out the mess between Rachael and Sebastian.</li></ul>\n<p>There are four main love interests who are more than ready to welcome you into their lives! Currently, I don't have plans to make a poly-route, though there is going to be a love triangle, because I love torturing myself, obviously!</p>\n<ul><li><strong>Victor Major </strong>or <strong>Van-O</strong> </li></ul>\r\n25 in human years, real age is yet unknown. Van-O is Sebastian's best friend. Raven remembers him as a total punk, but he grew up to be quite a gentleman. Bad boy turned soft boy, in other words. <em>(He/him, </em><em>gay</em><em>)</em>\n<ul><li><strong>Noah Larson</strong> or <strong>Nova</strong></li></ul>\r\n21 years old. Noah is one of Raven's childhood friends, and he knows too much about them. It is believed that he can see things others can't. Noah was mischievous as a child, though now he is much more considerate and gentle. His boisterous laugh and a whole lot of inappropriate jokes still can fool almost anyone into believing that he's doing fine, though those rapidly multiplying white hairs tell another story. <em>(He/him, pansexual</em><em>)</em>\n<ul><li><strong>Olivia Larson</strong> or <strong>Liv</strong></li></ul>\n<em>21 years old</em><em>.</em> Olivia is another childhood friend of Raven's, and even though she joined the Larson family much later than Noah did, she considers Noah and Raven her siblings. She'd never say that aloud, though. At first she might seem rude and antisocial, and, there's no denying it, she really is. She doesn't have friends besides those two, and she doesn't really care; being around human beings hurts her in ways Raven is yet to learn. <em>(She/them, panromantic/asexual</em><em>)</em>\n<ul><li><strong>Phil Moore</strong></li></ul>\r\n29 in human years, real age is yet unknown. They are Raven's new History professor, fair and mysterious, also kind of an arse to those poor souls who miss their classes on regular basis. Cold and strict, Phil is the most proper and upright person Raven will ever meet. They do, however, have a scary side to them, but we don't have to be worried about that just yet... <em>(Gender-selectable, demisexual</em><em>)</em>\n<ul><li><strong>Sebastian Ravenstorm</strong> (26)</li></ul>\r\nIs the closest of Raven's relatives and the best brother they could ever wish for. A bit annoying at times, but who isn't? Raven is his favourite little sibling in the whole world, and he needs them to know that every second they spend with him. He had been worried about Raven after they had moved out of the family house, and for a good reason.\r\n<ul><li><strong>Howard Ravenstorm</strong> (52)</li></ul>\r\nRaven's father was upset that they moved, but never voiced his concerns. He lets Raven do anything they wanted with their life, but he'd be more than happy to have them back home, as with just him and Bash the house often gets lonely. Raven is someone Howard desperately wants to keep safe, however, he is afraid of hurting them with the family secrets like he had hurt their mother many years ago.\r\n<ul><li><strong>Rachael </strong><strong>Delacroix</strong> (47)</li></ul>\r\nA successful actress, \"<em>Rae</em>\" of sunshine, and Raven's mother. Even though she is far away, she makes sure her youngest child is happy, as they are the only one in contact with her from Ravenstorm family. Unconditional support, expensive gifts and hilariously questionable inspirational quotes, those are just a few things she can provide to Raven should they mention it. Despite her tight schedule, Rae can always spare some time for a chat with her favourite kid.\r\n\n<p><strong>P. S.</strong>: Also, there are probably going to be grammatical errors and typos, as English is not my first language, and, frankly, I have an attention span of a toddler. If you find those, or any questionable word choices, let me know!</p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T16:20:45", "background_image": "https://media.rawg.io/media/screenshots/afd/afddfd8adbf1a0fffd79a3ce9dcd177e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Leo Schmidt"], "genres": [], "publishers": [], "esrb_rating": null}