{"id": 813208, "slug": "dancing-pandas", "name": "Dancing Pandas", "name_original": "Dancing Pandas", "description": "PLEASE NOTE : We are a small indie studio releasing this game as an Early Access for now. This means you will be facing some undiscovered bugs and there is a possibility that you will lose your saved game progress when the actual game is launched - BUT at the same time you are benefiting from an early adapter  discount AND are able to influence us - the developer team - on what features you'd like us to focus more on throughout the coming updates. <br/><br/><strong>DANCING PANDAS : Not a Dancing game! </strong><br/><br/>A relaxing, beautiful indie adventure game about discovering natural scenery, rescuing nature, villagers and animals from the looming jeopardy. We want this game to be the one to jump into when you just want to calm down, rewind and feel good. <br/><br/>You play as Mico, a panda who arrives to the beautiful summer island to see Granma but a mysterious catastrophic state has started to take over the other islands. Granma's special bird will keep Mico safe and help on the way finding out the mystery. <br/>In the game you are able to roam around different islands, help the troubled islands and their inhabitants in various ways, collect resources to upgrade your tools by trading with NPCs so that you can keep the islands from falling into the different mysterious catastrophic states. <br/><br/>Helping others can mean anything from rescuing hedgehogs in distress, move fishes back to water or bringing lost ducklings to their mother. The mysterious catastrophes hit the islands hard and by rescuing other panda characters and animals will help the island's vitality to gain their health back again.<br/>There are four different tools in the game : a shovel, an axe, a bowl and a pickaxe. Each tool has its own special use. For example with an axe you can chop wood and throw the resulting logs into fire to help warm the nearby NPC's and animals. <br/>The tools also upgrade into different states by trading with other pandas. Different upgrades mean the tool is usable with even more objects in the game.<br/><br/>The game doesn't contain any violence, so it is great for all ages. The time is not ticking, you are not in a hurry.<br/><br/>The game works well with keyboard + mouse combo or with an Xbox Controller.<br/><br/>If you are into games such as The Breath of the Wild or Animal Crossing, you might enjoy the ambience of Dancing Pandas!", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-12-26T03:53:39", "background_image": "https://media.rawg.io/media/screenshots/006/0060ad6cade054a347b4e2b50cf718d1.jpg", "website": "https://dancingpandas.game/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dancing Pandas", "Panda Games", "Nopia"], "genres": ["Adventure", "Indie"], "publishers": ["Panda Games"], "esrb_rating": null}