{"id": 813282, "slug": "the-gray-ascendancy", "name": "The Gray Ascendancy", "name_original": "The Gray Ascendancy", "description": "<p><strong>The Gray Ascendancy is a dark fantasy interactive fiction game set in the world of magic that is as capricious as its very first wielders. It tells a story of revenge, court intrigue, age-old ache, self-determination and agency, with the player straight at the core of it all.</strong></p>\r\nSummary\r\n<p><em>Magic bends to the will of the Six Sisters, what they share with humans is but a fraction of their power, an echo from the past when they lived and created history. A split between them formed the world you are in now, the world where magic is a powerful—and feared—tool, where mages were chased off into a small city of Riante after their recent attempt to seize control over the continent by taking over the Sunken Court.</em>\n</p>\n<p><em>But the mages shall prevail. Such is the resolve of the Gray Regent</em>.</p>\n<p>And then there is you.\r\n</p>\n<p>Serving the fabled Gray Regent feels right. Your body remembers how to use magic, and this is how you get by. This is how you are useful to them. Their goals find response in you, some part of you finds them as good as your own. You are their will executed in the field.\r\n</p>\n<p>It helps that you have no memories of how you became this way.\r\n</p>\n<p>No matter. The preparations are well underway, and you are to thank for many of the successes, except for <em>one </em>terrible failure. Fixing this mess has you tossed right into the enemy backline, trying to lie your way into the graces of a prince whose reputation, deservedly or not, is almost as bad as yours. Your door into the Sunken Court.\r\n</p>\n<p>You will ensure the ascension of the Gray Regency.</p>\r\nFeatures\r\n<ul><li>customize your protagonist (gender, name, pronouns, weapon and their allegiances);\r\n</li><li>build relationships with six potential ROs and people that you meet along the way;\r\n</li><li>make meaningful choices that will shape the future of the continent;\r\n</li><li>rediscover what you once were, if you wish, or build upon the blank slate that you have become;\r\n</li><li>embrace your magic to the full extent you have yet to discover or reject it, for you are not a plaything for the Sisters long dead;\r\n</li><li>lean into the allure of being seen as a villain or work on your image in the eyes of the unforgiving public;\r\n</li><li>your past holds secrets, obviously; try to remember the most important one;\r\n</li><li>chose your side: old masters or new friends? Who exactly are you lying to when you promise them your help?\r\n</li></ul>\r\nCharacters\r\nGale (m)\r\n<p>King Karon's oldest child and the one held in most contempt at the Sunken Court. Born of a forced alliance, along with his mother's infamy, he has inherited the touch of the Fourth Sister: depraved magic that steals and grants life essence. That what makes him a vulturous healer has also earned him distasteful reputation. For whatever reason he is well-mannered, patient, few would even call him kind. Gale often says very little—a habit of watching his every word at court and yet never being heard.\r\n</p>\r\nArthur van der Garde (m)\r\n<p>The margrave to the dukedom of Noyer, he is Gale's closest friend, and the only thing that has stopped it from turning him into a social pariah is his easy charm and, upon strict insistence of his father, rigorous mage hunter training. It is hardly possible to find a person willing to trust you less.\r\n</p>\r\nDarla Belrose (f)\r\n<p>A spirited and ambitious knight: no one else could be appointed to guard the scorned prince, let alone volunteer for such an assignment. As the oldest child, she is eager to restore the position of her house, so perhaps she sees the prince’s journeys as the means to that end. Her cautious curiosity towards magic could be another reason...\r\n</p>\r\nYvette (f) / Yves (m) le Tellier\r\n<p>The current Gray Regent and the youngest child of Gideon le Tellier, whose earlier conquest on the city of Rimehall has earned him the title of Usurper. Now sitting at the top of the tower in Riante, they claim the high goal of mage restoration, but you cannot help but notice the way their jaw clenches whenever King Karon’s name is brought up. That, and how often you seem to catch their gaze.\r\n</p>\r\nJax (nb)\r\n<p>Your handler and council. Although a mage themselves, their preferred trade is information and planning. Jax is seen by others as closed off and meticulous, though, you hear, they are the best one at the Gray Regent's disposal and easily have their ear. How you got the cream of the crop to assist you is anyone's guess, Jax certainly isn't willing to have such a conversation.\r\n</p>\r\nIanthe (f)\r\n<p>Not every mage is bound to the tower of Riante and some choose the remote corners of the continent to further their pursuits. Ianthe is one of such mages, and rather than appearing on your target list, she seeks you out herself. She claims to have interest in your magic and offers to solve the mystery that envelops it, but to do that she would need your cooperation and, going by the company you keep, secrecy, either of which you may not be as eager to provide. <br/></p>\r\nExtra content\r\n<p>Development blog<br/></p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T16:21:05", "background_image": "https://media.rawg.io/media/screenshots/8a7/8a7a4e517e8d2e66cbabd5018bf85732.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["grayascendancy"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}