{"id": 813394, "slug": "red-planet-cpc-102", "name": "Red Planet CPC 1.02", "name_original": "Red Planet CPC 1.02", "description": "<p>1.02</p><p>- Hemos añadido el juego en formato<strong> .dsk </strong>de forma temporal, hasta que pongamos el nuestro. Este lo han posteado en https://cpcrulez.fr/GamesTest/red_planet_1.htm#DL .We added a .dsk that posted https://cpcrulez.fr/GamesTest/red_planet_1.htm#DL while we update with our.  </p>\n<p><strong>RED PLANET ESPAÑOL</strong></p>\n<p>==========</p>\n<p>Versión Amstrad CPC - © PLAY ON RETRO 2022</p>\n<p>Conduce a nuestro héroe al subsuelo de la antigua estación espacial para volar todo el complejo y acabar con sus malignos habitantes.</p>\n<p>Pero cuidado, el entorno es peligroso. </p>\n<p>Evita entrar en contacto con los enemigos, y caer en los pozos de lava o de residuos radiactivos.</p>\n<p>Para acabar con éxito la misión debes obtener los 10 explosivos que hay repartidos por la estación, y situarlos en el depósito de explosivos, en lo más profundo de la base marciana.</p>\n<p>Una vez depositados, tienes que regresar al centro de control y activar el detonador.</p>\n<p>En ocasiones tendrás que acceder a zonas cerradas con tarjeta de acceso, por lo que previamente deberás localizar estas tarjetas para continuar tu misión.</p>\n<p>Tienes la posibilidad de disparar balas de plasma contra tus enemigos, pero cuidado, no malgastes munición, ya que ésta es escasa.</p>\n<p>Hay recargas repartidas por todo el complejo. Reserva algo de munición para la vuelta.</p>\n<p>El oxígeno disponible es muy escaso. </p>\n<p>Vigila el estado de tus botellas de oxígeno y busca otras nuevas antes de que se agoten o morirás en el acto.</p>\n<p>Reserva algo de oxígeno para la vuelta.</p>\n<p>ENEMIGOS</p>\n<p>========</p>\n<p>INFECTADO: Anteriores compañeros que intentaron realizar la misión y no lo consiguieron.</p>\n<p>La picadura de los aracnovirus les mantiene en un estado de NO muertos.</p>\n<p>Se mueven de manera lineal y pueden ser muy rápidos, elimínalos antes de que te contagien.</p>\n<p>ARACNOVIRUS: De movimientos erráticos y rápidos.</p>\n<p>Suelen moverse por el aire. Son los alienígenas más numerosos que han colonizado la base.</p>\n<p>PELUSOIDE: Son muy inteligentes. Pueden permanecer agazapados esperando tu llegada.</p>\n<p>Si te ven o te oyen, se abalanzarán sobre ti. </p>\n<p>En ese caso acaba con ellos cuanto antes. </p>\n<p>Lo mejor es mantenerse a distancia.</p>\n<p>CONTROL DE JUEGO</p>\n<p>================</p>\n<p>1:      Teclado.</p>\n<p>2:      Joystick.</p>\n<p>Q:      Saltar.</p>\n<p>A:      Acción. (Depositar explosivos, pulsar detonador)</p>\n<p>O:      Izquierda.</p>\n<p>P:      Derecha.</p>\n<p>SPACE:  Disparo.</p>\n<p>M:      Música Sí/No.</p>\n<p>ENTER:  Pausa.</p>\n<p>ESC:    Cancelar partida.</p>\n<p>RED PLANET - Amstrad CPC</p>\n<p>========================</p>\n<p>salvaKantero:   Programa / Gráficos</p>\n<p>tacha:          Música / Efectos de sonido</p>\n<p>masterklown:    Ilustración de portada</p>\n<p>blackmores:     Betatesting</p>\n<p>Un agradecimiento muy especial a los \"Mojon Twins\" por perfeccionar y compartir su motor de juegos MK1 para CPC.</p>\n<p>==================================</p>\n<p><strong>RED PLANET ENGLISH VERSION</strong></p>\n<p>==========</p>\n<p>Amstrad CPC version - © PLAY ON RETRO 2022</p>\n<p>Lead our hero into the underground of the old space station to blow up the whole complex and wipe out its evil inhabitants.</p>\n<p>But beware, the environment is dangerous. </p>\n<p>Avoid coming into contact with the enemies, and avoid falling into the lava or radioactive waste pits.</p>\n<p>To successfully complete the mission you must obtain the 10 explosives that are scattered around the station, and place them in the explosives depot, deep inside the Martian base.</p>\n<p>Once deposited, you must return to the control centre and activate the detonator.</p>\n<p>Occasionally you will have to access locked areas with access cards, so you must first locate these cards to continue your mission.</p>\n<p>You have the option of firing plasma bullets at your enemies, but be careful not to waste ammunition, which is in short supply.</p>\n<p>There are reloads scattered throughout the complex. Save some ammunition for the way back.</p>\n<p>Oxygen is in very short supply. </p>\n<p>Keep an eye on your oxygen tanks and find new ones before they run out or you will die instantly.</p>\n<p>Reserve some oxygen for the return trip.</p>\n<p>ENEMIES</p>\n<p>========</p>\n<p>INFECTED: Previous companions who attempted the mission and failed.</p>\n<p>The bite of the arachnoviruses keeps them in an undead state.</p>\n<p>They move in a linear fashion and can be very fast, eliminate them before they infect you.</p>\n<p>ARACNOVIRUS: Erratic and fast moving.</p>\n<p>They usually move through the air. They are the most numerous aliens that have colonised the base.</p>\n<p>PELUSOID: They are very intelligent. They can lie low and wait for your arrival.</p>\n<p>If they see or hear you, they will pounce on you. </p>\n<p>In that case, finish them off as quickly as possible. </p>\n<p>It is best to keep your distance.</p>\n<p>GAME CONTROL</p>\n<p>================</p>\n<p>1: Keyboard.</p>\n<p>2: Joystick.</p>\n<p>Q: Jump.</p>\n<p>A: Action (Deposit explosives, press detonator).</p>\n<p>O: Left.</p>\n<p>P: Right.</p>\n<p>SPACE: Shoot.</p>\n<p>M: Music Yes/No.</p>\n<p>ENTER: Pause.</p>\n<p>ESC: Cancel game.</p>\n<p>RED PLANET - Amstrad CPC</p>\n<p>========================</p>\n<p>salvaKantero: Program / Graphics</p>\n<p>tacha: Music / Sound effects</p>\n<p>masterklown: Cover Illustration</p>\n<p>blackmores: Betatesting</p>\n<p>A very special thanks to the \"Mojon Twins\" for perfecting and sharing their MK1 game engine for CPC.</p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T17:08:00", "background_image": "https://media.rawg.io/media/screenshots/bdc/bdc9266474fd9c64534594fc7d755c9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["Playonretro"], "genres": ["Action", "Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}