{"id": 813351, "slug": "pang-earth", "name": "Pang-Earth", "name_original": "Pang-Earth", "description": "<p><strong>Pang-Earth :</strong> El título elegido proviene de dos palabras:</p>\n<p><em>-Pang</em>: Juego arcade cuya finalidad es destruir burbujas entre 1 o dos jugadores.</p>\n<p><em>-Earth</em>: Tierra/Planeta en el que vivimos y será el “sentimiento visual” del juego. En vez de burbujas serán animales burbuja.\r\n</p>\n\n<p>Juego arcade basado en plataformas por las que el/los jugador/es tendrán que destruir burbujas en forma de animales. Su trayectoria los va a llevar a los planes maléficos del “Doctor Científico y Político Sabelotodo”, quien crea estas burbujas con el fin de realizar su plan maléfico.\r\n</p>\n\n<p><strong>Género</strong>: Plataformas arcade con un toque de base de rol y estrategia.\r\n  </p>\n<p><strong>Tema</strong>: El bien contra el mal\r\n  </p>\n<p><strong>Protagonistas</strong>: (por definir)\r\n  </p>\n<p><strong>Meta</strong>: Avanzar por plataformas y destruir burbujas con el fin de parar el plan maléfico.\r\n  </p>\n<p><strong>Conflicto</strong>: Naturaleza, social y cultural\r\n  </p>\n<p><strong>Espacio</strong>: Entorno 2D por “niveles, terrenos y climas”.\r\n  </p>\n<p><strong>Plataforma</strong>: Web (no se descartan otras en un futuro)\r\n  </p>\n<p><strong>Público</strong>: Jugadores casuales y en su definición cualquier jugador. Personas jóvenes de entre 12-45 años. Tanto hombres, mujeres, niños y niñas.\r\n</p>\n\n<p>Este juego de plataformas tiene como base el juego pang (vídeo de ejemplo) =&gt; https://www.youtube.com/watch?v=V-8Y3bQkz2M. A diferencia del planteamiento inicial que tiene, recibe modificaciones que divido en los siguientes puntos/ideas:\r\n  </p>\n<p><em>-Single Player / Multiplayer</em>\n</p>\n<p>-Las burbujas <em>se asemejan a animales</em> existentes/no?\r\n  </p>\n<p>-Los personajes tendrán <em>estadísticas basados en juego de rol</em> estos son:\r\n  </p>\n<ul><li>Velocidad de movimiento\r\n  </li><li>Tipo de ataque (puede ser mono o semiautomático)\r\n  </li><li>Vidas basado en corazones</li></ul>\n<p>El desarrollo de este prototipo está hecho por mí: Lorenzo García-Arévalo Acosta, alias Winkiripinki. Soy de Las Palmas de Gran Canaria. He realizado cursos y certificados de programación web, guion de cine y tv, desarrollo de productos multimedia así que ya venia con algo de base de programación. Y por supuesto, soy amante de los videojuegos.</p>\n<p>La idea de desarrollo de este proyecto me vino cuando recordé un juego que me encantaba cuando tenía cerca de 8años, \"Pang\". Me hubiera gustado añadirle ese 2players al juego pero no he podido, pero lo haré.</p>\n<p>Por el trayecto del aventurero habrán carteles con intención de guiar al jugador y sumergirlo en algo más que un juego plano.</p>\n<p>A diferencia del Pang, que aún así tiene semejanzas, me centré en hacerlo plataformas, con algunas fases y algo de trasfondo narrativo.</p>\n\n<p>Elementos mecánicos del Pang siguen aquí: </p>\n<p>disparar hacia arriba, saltar, \"plataformitas\", bolas. En esta versión las bolas son animales, cada una con su personalidad: agresiva, dinámica.</p>\n<p>                                  </p>\n<p>Si alguna vez lo pruebas, comprobarás que estas bolas no se dividen al fallecer... pero si otras bolas denominadas Animales Mutantes creadas por un Doctor Científico y Político Sabelotodo pero bueno eso es otra historia.<br/></p>\n<p>                       <br/></p>\n<p>Y bueno por no decir que he integrado algo novedoso y que me hace mucha ilusión mostrar... una tienda a cambio de puntos, arma de doble filo para la gente que quiere jugar hardcore y quiere conseguir un récord en puntos o simplemente usando la tienda y gastando estos.</p>\n\n\n<p>Por ahora el juego cuenta con dos fases testeadas intensamente por mí y dos grandes retos que solo unos pocos podrán superar(todo puede cambiar). Y por supuesto que algún bug habrá y se puede mejorar, pero eso no impide que me haga tan feliz haber desarrollado este prototipo.</p>\n<p>El juego cuenta con accesos implementados como Menú, tienda, pausa, play, logout entre otros. ¿Intrigante no? Pruébalo y dime tu opinión!! =)<br/></p>\n<p>Tengo canal de youtube: https://www.youtube.com/channel/UCLK2mF-oJlWuu1zKuq0-cvA</p>\n<p>Mi twitter: @WSocotroco</p>\n<p>Twitch: Winkiripinki</p>\n<p>Este es mi primer prototipo/juego que desarrollo en Unity C#, agradecer a los 2 \"profesores\" que me enseñaron el camino estos 3 meses (Aitor Lozano y Luis Antón).</p>", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-04T16:48:03", "background_image": "https://media.rawg.io/media/screenshots/aca/aca017a3fc87ced22d6aa84e28062dd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["winkiripinki"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}