{"id": 813613, "slug": "tomb-defender-2", "name": "Tomb Defender", "name_original": "Tomb Defender", "description": "In tomb defender, you control an ancient tomb in threat from tomb raiders. You have full control over the tomb, you can adjust the layout and built traps to stop the raiders.<h3>Build Up</h3>Tomb defender gives you full control over the level. You can change the default tomb layout from scratch with simple controls. Each individual tile adjusts its appearance depending on its position. Quickly building a nice-looking tomb is a breeze with these smart tiles.<br/>Raise walls or make floors, make it as hard and long as possible to get to the treasure and back again. Have plenty of corridors to break up the raiders into smaller groups or make it through a deadly tough round trip.<h3>Set Traps</h3>Spears, poisoned darts or burning brimstone, trap your tomb with a variety of traps to stop the looters. Traps can be placed in any wall or ground, giving you no limitations in your strategic planning. Make your enemies bleed, burn, poison and curse by placing your traps cleverly and letting the attackers run past as many as possible.<h3>GO</h3>Let the raiders come, every enemy defeated and every round beaten gives you more resources. Adjust your layout and trap placement against more raiders, just make sure they don't make it to your treasure and back with them. To challenge your skills, you can choose set missions with increasing difficulty or choose a sandbox mode.", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-08T05:27:39", "background_image": "https://media.rawg.io/media/screenshots/37f/37fb0fff3bbdc531fb6dcb5074040b4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paul Frost"], "genres": ["Strategy", "Casual"], "publishers": ["Paul Frost"], "esrb_rating": null}