{"id": 813712, "slug": "necrocrisis", "name": "Necrocrisis", "name_original": "Necrocrisis", "description": "<p><strong> </strong></p>\n<p><strong>NECROCRISIS </strong>is an on-rails fight for your life through a graveyard full of unimaginable horrors. Crank up your state-of-the-art gatling gun and blast through undead hordes to save the world from zombification.</p>\n<br/>\n<br/>\n<p>Not long ago, in a town not so far from yours, <strong>the dead rose to devour the flesh of the living</strong>. Compelled by an ancient curse, the vile undead have loosed a tide of terror that threatens to drown the world in blood. In a time of unthinkable wickedness, an ex-mil family man by the name of <strong>Gordon Atling</strong> will take up arms and brave certain death to save his country. But he won’t be doing it alone; armed with his trust M268 twenty-barrel rotary machine gun and more ammo than you can shake a severed arm at, <strong>he’s ready to give the devil his due.</strong><br/></p>\n\n\n<p>A frantic battle for supremacy between the living and the dead! Crank the crank to <strong>rev up your colossal minigun and destroy</strong> the undead menace! Keep your health and ammunition bars in mind at all times, and manage what few resources you have in your final stand against the horde! <strong>Harness the power of humanity</strong> in our darkest hour, and crank for your life to save your home from certain death!</p>\n\n\n<p><strong>NECROCRISIS features hand drawn art</strong> to set the scene for an apocalypse unlike any other. Feel the heat of your M268 as it spits 2,500 rounds per minute as you wade through the warm pools of zombie gore you create in your wake. The signature Strangest.io style will have you looking over your shoulder for shambling undead long after you've powered down your Playdate.</p>\n\n<p><strong>Strangest.io’s prime directive is to empower outsider artists to tell interactive, subversive and powerful stories. </strong>We partner with independent artists on all of our projects. We believe that the best stories and ideas come from the fringes of our society. We are not here to make things that have been done before. We are here to break the mold, leave a mark, and feel good about the work we do.</p>\n<p>Any support you can provide would be greatly appreciated.</p>\n<p>Submit feedback for Strangest.io games here.</p>\r\nTwitter   Discord   Patreon   Our Site\r\n\r\nWho we partnered with on this Project: Luce\r\n<p><strong>What they did:</strong> Audio + SFX</p>\n<p><strong>Why they are so cool: </strong>Because they make super sick beats at the drop of a dime, excellent audio work everytime!</p>\n<p><strong>Here are Luce's links, please check them out:</strong></p>\n<ul><li>https://lucehouse.bandcamp.com/</li><li>https://soundcloud.com/lucehouse</li><li>https://twitter.com/luctech_in</li></ul>", "metacritic": null, "released": "2022-07-07", "tba": false, "updated": "2022-07-08T06:42:22", "background_image": "https://media.rawg.io/media/screenshots/dbc/dbc28a444ffab7cd08f133f6bbc2732a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Strangest.io"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}