{"id": 813859, "slug": "mirror-drama-demo", "name": "Mirror Drama (Demo)", "name_original": "Mirror Drama (Demo)", "description": "Mirror Drama Demo\r\n\n<p>Mirror Drama is a game where you're choices truly matter. As a blank-slate protagonist, the choices you make and the people you surround yourself with will change your personality and your relationships with said people. There is only one ending, but your journey towards that ending will be different every time. Find your identity, escape loneliness, and be yourself.</p>\n\n<strong>Story</strong>\n<p>You are Shunta Shiiro. You spend most of your days trapped in your room. You think you enjoy it, but you can't really tell. Your heart is numb and you can't remember the last time you've felt happy.</p>\n<p>That is, however, until one day when you decided to escape your prison and re-enter back into society. You find yourself mixed in with a colorful cast of characters, all part of a group called the \"Drama Club\".</p>\n<p>Could this be the social interaction you've longed for all this time? Or will you end up retreating back into your cell? Who's to say? Let's just hope your lack of a personality won't get in the way this time. . .</p>\n\n<strong>Characters</strong>\n\n<p><strong>Shunta Shiiro</strong><br/></p>\n<p>The main character. He's spent about a  year simply collecting dust in his room, afraid to go outside. He doesn't quite remember why, but what he does know is that bad things will happen to him if he returns to his former way of life. </p>\n\n\n<p><strong>Danika Aoki</strong></p>\n<p>The leader of the Drama club. She's the sweetest and kindest girl in the whole school. She's a bit of a perfectionist, but that won't stop her from seeing the good in everyone and finding their strengths. </p>\n<p>She started the Drama club out of her passion for the arts and she's super excited for her first performance.</p>\n\n\n<p><strong>Baki Pikabo</strong>\n</p>\n<p>A cheerful and energetic girl. Not only is she an ace when it comes to spirit, but she's an expert basketball player, possibly the best in the country! She may be a little dull and easily distracted, but her enthusiasm will carry any team she's on. \r\n</p>\n<p>Since she's so good at her sport, she decided to join the Drama club so she could have something to do in the afternoons.\r\n</p>\n\n\n<p><strong>Kumi Murasaki</strong></p>\n<p>She's a bit of a rebel. Though she may seem reclusive, she's got the sharpest of tounges and even sharper piercings. She doesn't conform to society, society conforms to her.</p>\n<p>She joined the Drama club because she felt like it. That's all.</p>\n\n\n<p><strong>Tsuneko Izumidori</strong></p>\n<p>The local perfect girl. Everything she does is done with grace and style. No one can top this A+ student, and she's very willing to point that out. </p>\n<p>Much like Danika, she too has a passion for theatre and thus she became the vice president.</p>\n\r\nDemo Features\r\n<ul><li>40 to 60 minutes of gameplay</li></ul>\n\r\nSystem Requirements\r\n<ul><li>Windows 7, macOS</li><li>4 GB of RAM\r\n</li><li>1.15 GB available disk space\r\n</li></ul>\n\r\nTeam\r\n<p>Creator/Writer - Metta Seven</p>\n<p>Artwork, Background, Animation - Metta Seven</p>\n<p>GUI - Metta Seven</p>\n<p>Music, SFX - Metta Seven</p>\n<p>Play Testers - Evelyn (@karisutegia), Tea (tea#8069)</p>\n<p>Aditional help - Izu, Waifu Theory (@WaifuTheoryYT)</p>\n\n<p>OST<br/></p>\n<p>Get the full OST here for free: </p>\n<p>https://mettaseven.bandcamp.com/album/mirror-drama-ost</p>\n<p>Or check out the OST on Youtube:</p>\r\nhttps://www.youtube.com/playlist?list=PLjsFgfa_SjdmrVAn1JhSkvfnctHjo3NZ9", "metacritic": null, "released": "2022-07-07", "tba": false, "updated": "2022-07-08T07:39:41", "background_image": "https://media.rawg.io/media/screenshots/4c6/4c658bd83ef0eed92f5f159f7927b292.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["ᴍ ᴇ ᴛ ᴛ ᴀㅤꜱ ᴇ ᴠ ᴇ ɴ"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}