{"id": 813962, "slug": "unyha", "name": "UNYHA", "name_original": "UNYHA", "description": "<strong>I N T R O D U C I N G  T H E  A U T O C H R O N I C L E  G E N R E</strong>\n<p>Unyha  is the first-ever autochronicle MMO, where your adventures, victories,  and defeats become real stories that influence the game for all, and  forever. \r\n</p>\n<p>History &amp; content is generated by Unyha's unique  Autochronicle AI, making it truly aware of its inhabitants activity—and  naturally responds to it.\r\n</p>\n<p>Everyone you meet, each place traveled, every trinket discovered—they all have real histories.\r\nYou  hear the tavern maid tells tales of recent gossip; trade deals of  mighty weapons between merchants, a rowdy bar fight, or a mysterious  newcomer’s arrival. \r\nA dusty scroll from a library cellar contains the records of an ancient treasure lost in darkness.\r\n</p>\n<p>As  seasons come and go and decades become centuries, your stories only  grow stronger, forming myths and legends. It will be up to the next  generations to rediscover the truth of these stories—and take the  consequences. <br/></p>\n\r\nL I N E A G E  A N D  S E A S O N S\r\n<p><strong>All great stories must come to an end.</strong> Unyha features seasons lasting between 2-4 months real world time where your character ages from young to death.\r\n</p>\n<p>Each  new season, you build lineage with a new character, a descendant, a  freeborn bred in darkness, blood, and one of few surviving childhood in  the <em>dark, unforgiving lands </em>of Unyha.\r\n</p>\n<p><strong>Legacy saves you. </strong>Your name and reputation shield you from <em>desperates</em> and family heirlooms equip you with tools to defend yourself with both wit and strength.\r\n<strong>Protect your family name.</strong> Fight the wilderness and <em>pursue fame</em> to honor your ancestors while exploring the vast world of Unyha or <em>crawl deep</em> into her dungeons to lure out beasts of darkness. <em>Reap great rewards</em> by supporting <em>The Circle</em> in their mission to chronicle Unyha’s history, but make sure they write the same story that you want your lineage known for...</p>\n\r\nT R E A S U R E  H U N T S  &amp;  P L A Y E R  Q U E S T S\r\n<p>Every piece of equipment  is crafted by players, with it's own unique history. Your very first  sword can become a loyal companion, recording all the epic battles and  vicious monsters you slay and make an important family heirloom across  several seasons. \r\n</p>\n<p>Build on other players' history as you find or  trade their previous equipment. Discover clues and research mysterious  events in the libraries. Interrogate monsters and increase your  storyweaving skill to hunt down ancient treasure hidden all over the  world.\r\n</p>\n<p>In Unyha, you tell <em>your </em>stories and <em>truly shape the history</em>  of the world. Visit the closest tavern to tell a story about your  recent adventure and have the townsfolk help you spread the word about  your deeds.\r\n</p>\n<p>Climb the ladder of fame, make your name known and enter an ever-changing world that never stops growing.\r\n</p>", "metacritic": null, "released": "2022-07-07", "tba": false, "updated": "2022-07-08T08:23:26", "background_image": "https://media.rawg.io/media/screenshots/9b9/9b95310df600eced88053bd0563987ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["realspawn"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}