{"id": 814001, "slug": "boisterous", "name": "Boisterous", "name_original": "Boisterous", "description": "<p><strong>Migrate: Boisterous</strong><br/></p>\n<p>In extreme circumstances, we don't always make the best decisions. In the world of birds, the fallout of the Grandnest civil war seems to have dissipated at last. Yet there are many isolated actors still picking up the pieces. Join the aspiring \"god of chaos\" Lo in a quest to reconnect with old acquaintances, both friend and foe. Forgive, and be forgiven.<br/></p>\n<p><strong>Boisterous </strong>is a non-linear, genre-fusing 2d RPG. Obliterate cartoons in a psychotic rampage.<br/></p>\n<p><strong>PROTOTYPE<br/></strong></p>\n<p><strong>Current scope</strong>: The prototype is for the purpose of gaining feedback on the various core gameplay systems. There may be bugs and glitches. This version of the game is not to be considered representative of the final product. There are no story elements, saving, or quests at present.<br/></p>\n<p><strong>Installing</strong>: The game is currently only being released in .zip formats through this page. Unzip the folder contents to any other folder, and launch \"boisterous.exe\". <em>PLEASE do not download the game from ANY SOURCE other than this page. </em>The game may be flagged by SmartScreen, this is a false positive that I can't do anything about. As long as you are downloading from this page, the program is safe and you can select more options to make an exception.. <br/></p>\n<p><strong>Updates</strong>: Updates to any version of the game will be posted here. Following this account will notify you of any updates.<br/></p>\n<p><strong>Known issues</strong>: If the game crashes, please copy and paste the error message to send to me. If combat hangs indefinitely, please press numpad9. There is technically gamepad support, but it is not a focus at this stage of release - please play with keyboard and mouse at least once.<br/></p>\n<p><strong>Feedback contact</strong>: discord Anapse#1281, Anapse-entertainment@anapse.net, or the topic on the discussion board below.<br/></p>\n<p><strong>FEATURES<br/></strong></p>\n<ul><li>Weave through enemies, dangers, and bullets, both in-turn based and platforming environments.</li><li>Manage a complex tetris-like inventory to cram as much loot as you can.</li><li>Look out for your friends. Your allies in battle are persistent actors who can be permanently affected by your leadership.</li><li>Master the world. A robust Leagues system creates alternate routes and rules that will test your attention, adaptability, and strategic analysis skills.</li></ul>", "metacritic": null, "released": "2022-07-07", "tba": false, "updated": "2022-07-08T08:39:40", "background_image": "https://media.rawg.io/media/screenshots/b0e/b0ea8dd9dbca9814664c39bd08383f79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anapsys"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}