{"id": 814356, "slug": "all-the-worlds-a-stage", "name": "All The World’s A Stage", "name_original": "All The World’s A Stage", "description": "<p>All the World's a Stage is a SKAM France Theatre AU as a Visual Novel.   If you like the game please go check out xJane's other work including the same story from Eliott's perspective:  And All the Men and Women Merely Players</p>\n<p>Credits for music are all included in the about section of the game and in the description in the youtube video.  Special thanks to Polaris.Artworks.<br/></p>\n<p>Here is the full summary of the story and link from AO3:<br/></p>\n<p><strong>All the World's a Stage</strong> (16034 words) by <strong>xJane</strong></p>\n<p>Chapters: 3/3<br/>Fandom: SKAM (France)<br/>Rating: General Audiences<br/>Warnings: No Archive Warnings Apply<br/>Relationships: Eliott Demaury/Lucas Lallemant<br/>Characters: Eliott Demaury, Lucas Lallemant, Manon Demissy, Imane Bakhellal, Yann Cazas, Basile (SKAM France), Arthur (SKAM France), Alexia Martineau, Emma Borgès, Lucille (SKAM France), Daphné Lecomte<br/>Additional Tags: Alternate Universe, Theatre AU, actor!Eliott, stage manager!Lucas, Meet-Cute, First Kiss, Fluff and Angst, Angst with a Happy Ending<br/>Series: Part 1 of All the World's a Stage<br/>Summary: <br/></p>\n<p>Lucas hasn’t ever worked with Demaury before, but he has heard of him, of course. He saw Demaury first in a small role in a modernized staging of Medea. As a professional in the theatre world, he appreciates Demaury’s talent. Eliott Demaury brings emotions to life effortlessly, and has a real connection to the audience. On a less professional note, as a… well, hot-blooded gay man, Lucas appreciates Eliott’s attractive features, slender waist, strong arms, crooked smirk and striking eyes probably even more than his talent.</p>\n<p>When Daphné calls for “Eliott Demaury”, Lucas sits up a bit straighter. He is prepared to be blinded by the trademark megawatt smile of his crush. Lucas expects a confident, self-assured man, ready to claim his stake. Instead, in walks a boyish figure, almost hunched, in jeans and sneakers, with messy hair and what looks like paint stains on his hands.</p>\n<p>It is hopelessly cute, to be honest.</p>\n<p>***</p>\n<p>Or, stage manager Lucas, competent, caffeine-addicted, and continually looking sexy in his stage black, starts working with actor Eliott, talented, timid, and trying to get Lucas out of his stage black.</p>", "metacritic": null, "released": "2022-07-06", "tba": false, "updated": "2022-07-08T11:04:18", "background_image": "https://media.rawg.io/media/screenshots/32b/32bd02a247c627a74582578390fc9faf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 186, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["beanawake"], "genres": [], "publishers": [], "esrb_rating": null}