{"id": 814309, "slug": "a-horrifyingly-peaceful-stroll-in-the-park", "name": "A Horrifyingly Peaceful Stroll in the Park", "name_original": "A Horrifyingly Peaceful Stroll in the Park", "description": "<p><strong>A Horrifyingly Peaceful Stroll in the Park </strong><em>by Caleb Noller</em></p>\n<p>Fiero was going for an idyllic stroll in the park one day, when he saw some strange shapes in the distance...\r\n  </p>\n<p> </p>\n<p><strong>Description</strong><br/></p>\n<p>You have found unexplored territory that is quite peaceful.</p>\n<p>There are rocks to explore,</p>\n<p>                       forests to venture inside,</p>\n<p>                       and beautiful lakes to look at.</p>\n<p>But all is not as it seems. Menacing, yellow creatures lurk in the shadows of the trees. They will eat you if they can get to you! Be careful, you don't know when they will appear.</p>\n<p>You also have to make sure you aren't hungry. This is measured by your SATIATION meter. When it reaches 0, you die of starvation! You can keep you spirits up by eating red fruit. Simply walk up to a tree that has fruit a press F to eat it.</p>\n<p>If you feel a bit sleepy (your ENERGY is getting low), you can sleep by pressing Q. When your energy hits 0, you can't move until you sleep. Sleeping also slows down how hungry you get.</p>\n<p>All is not lost in the world though.</p>\n<p>Along your travels somewhere you found out how to CONTROL WATER. Simply press the spacebar to enter your watery state (a light blue square), and move around in the water to make it flow in different directions!</p>\n<p>You will need your wits, and clever use of your water skill, to survive this - really quite peaceful! - stroll in the park.</p>\n\n\n<p><strong>Controls</strong><br/></p>\n<ul><li>Use the arrow keys or WASD to move around.</li><li>Press F to eat fruit</li><li>Press Q to sleep</li><li>Press Spacebar to switch to water state and back</li></ul>\n\n<p><em>References:</em></p>\n<p>Chopin Nocturne in E-flat Major (Op 9, No 2) performed by Peter Bradley-Fulgoni (from IMSLP)</p>\n\n<p><em>See also:\r\n  </em></p>\n<ul> <li><em>Hello World! The Secret Lives of Shapes by Caleb Noller - Say \"hi\" in three different      ways in this charming and delightful tiny game\r\n  </em></li><li><em>Blind Dungeon by Caleb Noller - Navigate through a completely dark dungeon using your sense of touch\r\n  </em></li><li><em>Silver Sky by Caleb Noller - Make the sky rain cubes in three dimensions</em>\n</li></ul>", "metacritic": null, "released": "2022-07-06", "tba": false, "updated": "2022-07-08T10:42:52", "background_image": "https://media.rawg.io/media/screenshots/03d/03d712f9eb5064a1575ec8dcef1a6f04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Caleb Noller"], "genres": [], "publishers": [], "esrb_rating": null}