{"id": 814441, "slug": "folumis", "name": "Folumis", "name_original": "Folumis", "description": "<p>This is a simple little interactive fiction game that I created for a specific purpose on a game website that I play (Dappervolk.com), but am posting it publicly as that's the easiest way to have it available on-site, and also because it stands on it's own enough that it should still be perfectly playable even for those unfamiliar with Dappervolk<strong>**</strong>~!</p>\n<p><em> (<strong>** !!!!!! </strong>THOUGH if you<strong> aren't </strong>familiar with the site, you should <strong>definitely</strong> read this ENTIRE  page (<strong>at least</strong> the 'CHARACTER' and 'WORLD INFO' sections), in order to get quick context for the small handful of terms/ideas presented in the game which<strong> won't </strong>make sense otherwise lol!! )</em></p>\n\n\n<p>A group of travelers (who run their operations out of an abandoned Library) have invited you along on a research expedition to explore ancient ruins in the heart of a mysterious forest.  They theorize that your unique form of magic may prove useful during the trip. You've only been traveling with them for a few days, so you're still mostly strangers, but are at least familiar enough to know each other's names.  </p>\n<p>Initially, you just agreed to go with them for the hell of it/out of sheer curiosity, and it seems like there's no point to you even traveling there other than being dragged along for your magic, however.. it slowly becomes evident that perhaps your presence in the forest is far more significant than originally thought... </p>\n\n\n<ul><li>a goofy little cast of 5 characters (your traveling companions)</li><li><li>50,000 words of writing, dialogue, etc.  (should take anywhere from 35 minutes to 2+hrs to play through, depending on what options you choose and how quickly you read) </li><li><li>while I had to <em>really</em> limit complexity due to time constraints/the fact that 80% of this was done in a single <strong>month</strong> basically <em>(LOL ToT;)</em>, there<em>  are</em>  multiple minor branching paths (who you explore ruins with, etc.) and a lot of conversation options to get to know the characters!</li><li><li>There's also 22 achievements you can get in the game, if you're into that sort of thing (collecting markers of your progress, etc.)</li><li><li>If you're on Dappervolk, you can get a free copy of a pet for playing this game (the entire reason I made this).. online little creachures.. (for those unfamiliar, think maybe similar to Neopets lol)</li></li></li></li></li></ul>\n\n\n<p><em><strong>(more detailed character sheets HERE)</strong></em></p>\n\n<p> <em><strong>\"</strong>The world of Dappervolk used to be a peaceful, non-magical land in the middle of a pleasant bronze age. However, people like you (the player) have mysteriously begun to appear, causing magical phenomena left and right; some of the magical effects have been simply mysterious, others downright unnatural. ...  </em><em>Travelers like you seem to be responsible for the enchantment of inanimate objects into living creatures, causing an unprecedented spread of new flora and fauna. New technologies have been discovered through the study of these magical creatures, plunging the world of Dappervolk into an era of rapid magical advancement.<strong>\"</strong></em> <em><strong>-- From </strong>the DV wiki</em></p>\n\n<p>The \"Travelers\" mentioned above are often referred to as <strong>\"Worldhoppers\"..</strong> In the game Folumis, you play as one of them.  They have no recollection of their past lives  prior to arriving in the Dappervolk world, and their origins are mysterious to everyone. The main magic of the Worldhoppers that's heavily focused on is their ability to animate objects into living creatures <em>(this is what all the collectible pets on the website are, etc.)</em>. This is a unique ability that others in the world do not have.</p>\n<p>......... And that's pretty much all you should need to know for the game lol, not that much context required! </p>\n<p>-</p>\n<p>-</p>\n<p>(Credit to the broader world concepts (worldhoppers, etc.) and overall universe goes to the creators of Dappervolk.com.  All other details (characters, design, specific individual setting, creatures, etc.) are original by me. The story/setting stuff is made up and<em> probably</em> not lore friendly but I TRIED to research DV lore and hopefully nothing is too outrageous/it all seems like concepts that could plausibly exist on-site lol. Thank you to everyone on the forums who voted for character designs, names, etc. &amp; helped choose aspects of the game in polls! )<br/></p>\n\n<p>Also, please excuse the 'Hastily Done' nature of some things lol, this is just a casual side-project that I did for fun to post for free on the Dappervolk forums, so I REALLY tried to reign in the 'Add Way Too Much Detail To Everything' portion of my brain and just be like \"you know what? I did this background art in 5 minutes, and that's fine\" but of course I still feel weird about it.. </p>\n<p>I'm also listing the game as 'prototype' for this reason - though I don't plan on making other games with this same set of characters/in this setting, maybe it can serve as a preview version of the sort of thing I'd like to make in the future. I have a larger/more detailed game of a similar style I've been working on for a while, so in hindsight, this is probably actually good experience to do a shorter/simpler/low effort one beforehand. This is actually the first time I've EVER fully completed and posted a game publicly, or even ever posted my writing publicly in my<em> <strong>entire</strong></em><strong> </strong>life, so I guess it's good for my Main  project to not be The Very First lol!! </p>\n<p>On that note, If you enjoy this game enough that you want to see future things I've put more significant effort into - I am always in the process of making similar games, stories, art, and other projects that are set in my OWN fantasy world - which you can find more information about all that stuff at -- </p>\n<p> worldofnanyevimi.tumblr.com/projects   AND   lucalicatteart.tumblr.com</p>\n<p>Anyway, thank you SO much for playing!!! I really appreciate it! </p>\n\n\n<p>This game is in <strong>NO</strong> way affiliated with Dappervolk.com, Snail Games, etc., h<strong>as NO official endorsement from them</strong>, and is <strong>NOT claiming any ownership</strong> over their existing creative material. This is merely a fan creation<strong> SET </strong>in the Dappervolk universe, for personal on-site purposes (but since it's posted publicly, I thought maybe I'd need to specify!)</p>", "metacritic": null, "released": "2022-07-05", "tba": false, "updated": "2022-07-08T11:34:29", "background_image": "https://media.rawg.io/media/screenshots/592/5923410454a26a149f7727e9819530d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["lucalicatte"], "genres": [], "publishers": [], "esrb_rating": null}