{"id": 81447, "slug": "double-draw-video-poker-triple-play", "name": "Double Draw Video Poker Triple Play", "name_original": "Double Draw Video Poker Triple Play", "description": "This Video Poker game has a big twist. It allows you to draw a second time!   Play Video Poker – three hands at a time!  Place your wager, 1 to 5 credits for each hand, then tap \"Deal\". Select the cards you want to keep and tap \"Draw\" and as expected, you'll draw new cards for each hand.  Now, here's the twist. If you want, you can draw the cards again! That's right, draw a second time!  You'll have to pay the same amount as your original wager and you'll have to give up whatever winnings you won on the first draw. But, any winnings from the second draw you keep! So, if you have 4 cards to a Royal Flush, you can draw again to try to get it! How fun is that?!? <br/><br/>Another unique feature are the \"Gold Cards\". You collect Gold Cards by playing the game or purchasing them. After you have drawn your cards (possibly twice), you can use a Gold Card to replace a single card with ANY card you want! <br/><br/>Double Draw Video Poker Triple Play contains these Video Poker favorites: <br/>• Jacks or Better <br/>• Bonus Poker <br/>• Double Bonus Poker <br/>• Double Double Bonus Poker <br/>• Triple Double Bonus Poker <br/>• Deuces Wild <br/><br/>Double Draw Video Poker Triple Play doesn't ask you to purchase more credits from the app store. Frankly, we think that's rude and NOT fun. So, Double Draw Video Poker Triple Play allows you to add credits, in $100 incements, as often as you like. So, if you're a Video Poker purest, you can disable the Double Draw and Gold Card features and use this app as a standard Video Poker game - without having to purchase more credits. <br/><br/>Double Draw Video Poker Triple Play is compatibable with iOS version 5.0 or later, and will run on an iPhone, iPod and iPad.", "metacritic": null, "released": "2013-02-01", "tba": false, "updated": "2019-10-22T14:22:26", "background_image": "https://media.rawg.io/media/screenshots/0e1/0e1fc6917348e56ae87204d99b482432.jpg", "website": "http://www.clearvisionapps.com/tripleplay/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ClearVision Apps"], "genres": ["Card"], "publishers": ["ClearVision Technologies"], "esrb_rating": "Teen"}