{"id": 814882, "slug": "fruit-slash", "name": "Fruit Slash", "name_original": "Fruit Slash", "description": "In order to prevent the maids from escaping, the devil divided their souls into countless fragments, and then imprisoned these fragments in different places. Now, the handmaids desperately need your help to fight the demons and reclaim their lost soul fragments so they can be freed and restored.<br/>\n<br/>\r\nThis is an addictive fruit cutting game. There is a ready-to-go weapon at the bottom of the game interface, and a pile of irregularly rotating fruits above. Players need to click on the game interface to let the weapon quickly rotate upwards and fly. Each weapon fired must cut at least one fruit, otherwise the game ends and the player loses.<br/>\n<br/>\r\nIn the game, if you cut the fruit, you will get game gold coins, and these gold coins can be used to continue the game. Each time you continue the game, you need to spend 50 game gold coins. In addition, each level also has a chance to use three weapons at the same time, allowing players to have more opportunities to cut fruit and improve their score.<br/>\n<br/>\r\nPlayers can challenge different levels in the game. As the level is gradually upgraded, the rotation speed and number of fruits will also increase, making the game more challenging and fun.<br/>\n<br/>\r\nIn addition to cutting fruit to get game gold coins, players can also accumulate enough gold coins to participate in lottery activities. Every draw has a chance to get new weapons or CG fragments. After collecting a certain number of CG fragments, players can get a perfect CG picture, which increases the collection elements and sense of accomplishment of the game.<br/>\n<br/>\r\nThis game adopts a simple and easy-to-use operation method, with exciting gameplay and rich reward mechanisms, allowing players to experience the perfect combination of fun and challenges in leisure and entertainment.", "metacritic": null, "released": "2022-07-04", "tba": false, "updated": "2023-08-18T03:46:36", "background_image": "https://media.rawg.io/media/screenshots/d13/d137642057704e843e4af3e928d16c32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["Gigabyte Games", "FS games"], "genres": ["Casual", "Indie"], "publishers": ["FS games"], "esrb_rating": null}