{"id": 815128, "slug": "the-fate-of-mirador-chapter-one", "name": "THE FATE OF MIRADOR CHAPTER ONE", "name_original": "THE FATE OF MIRADOR CHAPTER ONE", "description": "<p>STORY:<br />\nYou are a prince of (Mirador) in a medieval-era fictional world that is full of danger, dangerous, and even magical creatures. Orcs, elves, and fairies, just to name a few. Yet many other to-be-discovered species and creatures exist outside of your realm. Currently, the world as you know it is at peace. But some things are just not meant to last...<br />\nGAMEPLAY: You are the prince, and as such you do whatever your royal hiney desires. However, nearly everything you do as a royal will be watched, judged, and in many cases even remembered forever.<br />\nThe world itself will change based on your choices. IE: You do good in the world. The world will start to notice you, senpai. The same could be said if you happen to be the undecisive type of person who can&#39;t make up his mind about staying Good, Neutral, or even possibly more... The game, based on your choices, will take one of the three preset paths for an ending that will not only be suitable to the character you have built, but the entire story itself will change (drastically) based on the path. In short, no rewriting the same lines for another path. Each path will see different characters, and even the same ones who are considered the main cast(many of them will be a part of your team/harem/dungeon...), act accordingly. Based on your player build/choices you make, shape you as a leader.​<br />\nWORTH POINTING OUT:<br />\n- You can name your own character.<br />\n- You can name all the main cast characters.<br />\n- Your choices shape the world and story you want.<br />\n- You can replay the game and choose different choices to not miss out on any of the content.<br />\nFOM will be delivered to you chapter by chapter.  Chapter two is currently being worked on, and is coming soon.</p>", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2024-02-01T07:58:05", "background_image": "https://media.rawg.io/media/screenshots/250/250e561ef2d4cded8720b4271501e392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 4, "ratings_count": 1, "suggestions_count": 486, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["OneManVN"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["OMVN Publishing"], "esrb_rating": null}