{"id": 815184, "slug": "wavecade", "name": "WAVECADE", "name_original": "WAVECADE", "description": "<strong>WAVECADE</strong> is a sci-fi arcade shoot-em-up where <strong>YOU</strong> control the speed of the game.<br/><br/>Inspired by classic arcade shooters such as 'Space Invaders' and 'Galaga', <strong>Wavecade</strong> brings back the original nostalgia feeling to players from arcades, using sleek retro 80's and sci-fi aesthetic.<h3>TIME MANIPULATION:</h3>Bend time at your will by moving up and down the screen. After each wave, the game speeds up a small amount. making the game more challenging on each new wave.<h3>POWERUPS:</h3>You can accumulate multiple powerups at the same time. Collecting the same powerup upgrades it and increases your time with them active.<h3>ABILITIES:</h3>Activate your ability when you are facing near certain destruction to turn the tables of the game. It might be the one thing that saves you from a GAME OVER.<h3>BLOCKS:</h3>Blocks spawn at the top of the playfield and move down the screen. Line up your shots and shoot them for points. <br/>They can come in a variety of types:<br/>- Blocks can have armor<br/>- Blocks can change lanes<br/>- Blocks can change their type<br/>- Blocks can spawn randomly, in rows, in a single stream, or in a pattern spanning the playfield.<h3>HAZARDS:</h3>Hazards can appear at any time and can lose you a life if you happen to hit any of them. They can help destroy blocks if you're agile enough, could be a blessing in disguise.<h3>MULTIPLAYER:</h3>Invite or join a friend on Steam and destroy waves of blocks. <br/>Your scores are saved to the leader boards with your names. How long can you stay #1?<h3>VARIETY OF GAME MODES:</h3>Start a game with standard arcade rules, or customize your own.<h3>CUSTOMIZATION:</h3>Personalize your player ship and choose from a selection of colours as well as your propulsion effect.<h3>FOR SPEEDRUNNERS:</h3>Set a custom game mode and get the fastest time or highest score for that mode.", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2023-08-28T04:33:44", "background_image": "https://media.rawg.io/media/screenshots/993/9939f498761cdcdae8fa6b017ae59a86.jpg", "website": "http://wavecade.ml", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "iOS"], "developers": ["Lewis Spalato", "Andrew Spalato"], "genres": ["Action", "Strategy", "Casual"], "publishers": ["Andrew Spalato", "Spalato Bros"], "esrb_rating": "Everyone 10+"}