{"id": 815146, "slug": "alumni-escape-room-adventure", "name": "ALUMNI - Escape Room Adventure", "name_original": "ALUMNI - Escape Room Adventure", "description": "Alumni is a first person 3d escape room puzzle adventure, similar to games you may have played in the ’90’s or similar to a virtual escape rooms you may have played. An indoor immersive world that you explore and an inventory where you can collect and use items you find along the way to solve puzzles and escape the rooms.<br/><br/>Play as a scientist transported back in time to memories of college fighting to escape the nightmare reality. Explore areas and take in your surroundings. Use all of your puzzle solving skills to make your way through the college and return back to the present.<br/><br/>How you tackle the puzzles is down to you. Each puzzle has a logical solution, so take your time, there is no rush and enjoy the process of understanding what you have to do.<br/><br/><br/><br/><strong>FEATURES</strong><br/>• Explore an immersive 3D environment, solving puzzles and collecting items<br/>• Use the inventory to collect and use objects<br/>• Beautiful all original adventure 3D graphics, environments and atmosphere to explore<br/>• Immersive backing soundtrack and effects to pull you into the adventure<br/>• Full save system with load slots, manage all controls and sound levels to your preference.<br/><br/><strong>CONTROLS:</strong><br/>Movement: WASD + Mouse<br/>Inventory: I<br/>Menu: ESC<br/><br/><strong>HINTS &amp; TIPS</strong><br/>If you need a hint or clue while playing Alumni then please reach out over email or social media (contact links can be found on my website) and I will be more than happy to help you.<br/><br/><br/><br/><strong>SMALL PRINT</strong><br/>Alumni was created from the imagination of a solo indie developer. <br/><br/>“I am always excited to hear people playing my games and their experience along the way. Adventure gaming is my passion and your feedback helps my games get better.“<br/><br/>Alumni is compatible with most modern PC's and has been designed to be as resource efficient as possible to allow play on many different devices. With that said, if you do run into any difficulties please email so I can provide updates that help everyone enjoy the adventure.", "metacritic": null, "released": "2022-07-08", "tba": false, "updated": "2023-02-17T10:04:05", "background_image": "https://media.rawg.io/media/screenshots/4cd/4cdd0ac2cdb915f064c78fefe3b3596b.jpg", "website": "https://www.m9games.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 310, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS", "macOS", "PC"], "developers": ["M9 GAMES", "M9 Creative"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["M9 Games", "M9 Creative"], "esrb_rating": "Teen"}