{"id": 815165, "slug": "aturd-abuser-escape", "name": "ATurd - Abuser Escape", "name_original": "ATurd - Abuser Escape", "description": "<h3>ATURD ! The Game </h3><br/> <br/><br/><strong>*STORY*</strong><br/>Johnny had to come back and find evidences against his abuser but...<strong> She was already there... </strong><br/>Ransack your house to find evidences against... \"<strong>The Turd\"</strong> and avoid her at any cost! <br/>Her dog just <strong>stepped on a Bee</strong> and she is now furious for no reasons.<br/>If she gets to you, she will hit you and make you make you loose your mind.. ! <br/><br/><br/>* You play \"Jojo\" in the Third person view and you need to search evidences in your house by hitting the furniture's. <br/>* You will be able to loot evidences, make sure your Ex-wife doesn't touch them or she will destroy them.<br/>* Only the furniture's that are not \"black &amp; white\" can be destroyed with Left/Right Mouse Click to make punches.<br/><br/><br/>* Your Ex-wife, aka \"ATurd\" is there, wanting to start an argument with you. Her rage increases when you hit furniture's and find evidences.  <br/>* The more rage she has, the more argument she will have with you. You need to correctly type the text displayed on screen to block her attack.<br/>* If you get hit you'll loose life and die. You will also loose Sanity, causing a confusion effect on your camera. <br/>* Hide in the bathroom to get some peace and sanity back !<br/><br/><br/>* Drink wine to heal, because isn't it happy hour anytime ? But not too much... or you'll fall when you try to sprint ! <br/><br/><br/><br/>* Once you found all the evidences, you will have to find some specific objects in your house. <br/>* Lastly escape the map by going to your car ! <br/><br/><strong>Will you find all the evidences and leave the house before loosing your mind... or worst... that she kills you?</strong><br/><br/><br/><br/>* Your agent is coming soon to sign your new movie contract ! But your Ex-Wife decided to make a mess <br/>* Run after her and clean the army of turd that come out from her body  (how does she do that?!)<br/><br/><br/>* You can make her busy by calling her at some specific location, giving you time to find &amp; clean the turds<br/>* You have one mop for the floor and another tool for the walls (Left click / Right Click)<br/><br/>", "metacritic": null, "released": "2022-07-08", "tba": false, "updated": "2022-07-11T03:47:14", "background_image": "https://media.rawg.io/media/screenshots/7fd/7fdf2ef6b088709184ef93cdc52958b0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VR-EXODUS"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["VR-EXODUS"], "esrb_rating": null}