{"id": 815145, "slug": "yurukill-the-calumniation-games", "name": "Yurukill: The Calumniation Games", "name_original": "Yurukill: The Calumniation Games", "description": "*Players wishing to use a Nintendo Switch Pro Controller must follow the below guidance:<br/>Access the Steam Controller Settings menu and enable \"Switch Pro Configuration Support\", then disable \"Use Nintendo Button Layout\".<br/>Furthermore, if a Nintendo Switch Pro Controller is connected via cable while \"Disable Steam Input\" is active in the game's controller settings, the controller will not function properly. <br/><br/>Pardon or kill. Let the madness begin.<br/>At the edge of despair, lurks the unsettling past, and an unspeakable truth!<br/><br/>What secrets are hidden in the twisted attractions of the secluded amusement park, Yurukill Land?<br/>Who will emerge victorious from its cruel, fiendish games?<br/><br/><br/><strong>Story overview</strong><br/><br/>Convicted Prisoners face a series of attractions to clear their names in Yurukill Land. If they and their Executioner partners overcome the Yurukill Games, they will be absolved of their alleged crimes.<br/><br/><strong>Escape adventure: exploring the attractions</strong><br/><br/>Prisoners must attempt to solve puzzles and uncover hints about the crimes they stand accused of, and risk their very lives in Maji-Kill Time—life or death cross-examinations. One wrong answer, and they stand to lose it all. As players progress, the grim complexities of each incident will come to light.<br/><br/><br/><br/><strong>Pure shoot ‘em up action courtesy of veteran developers, G.rev</strong><br/><br/>Prisoners pilot Yurukill Fighters through a series of virtual reality challenges. In High-speed Quizzes, they must put their understanding of each case to the test and choose the correct lane in order to gain extra lives. In the Prejudice Synapse, Prisoners present the evidence they acquire during their investigations to try and destroy the prejudices lurking in their Executioners' heads. Each top-down shoot ‘em up section ends with a nail-biting showdown with your Executioner. Plus, with a choice of Easy, Normal, and Hell difficulties, beginners and experts alike will have something to test their mettle with.<br/><br/><br/><br/><strong>Score Attack mode</strong><br/><br/>In Score Attack mode, players face the shoot ‘em up sections from the main game in their choice of craft, and at their chosen difficulty. Additionally, each stage features global online rankings.<br/><br/>Original story/ scenario: Homura Kawamoto/ Hikaru Muno<br/>Producer/ Director: Shinsuke Umeda<br/>Character design: Hiro Kiyohara<br/>Soundtrack: Yuko Komiyama<br/>Shoot ‘em up part development: G.rev<br/><br/><br/>*Players wishing to use a Nintendo Switch Pro Controller must follow the below guidance:<br/>Access the Steam Controller Settings menu and enable \"Switch Pro Configuration Support\", then disable \"Use Nintendo Button Layout\".<br/>Furthermore, if a Nintendo Switch Pro Controller is connected via cable while \"Disable Steam Input\" is active in the game's controller settings, the controller will not function properly. <br/>*An internet connection is required in order to use the game’s online ranking functionality.<br/>・Nintendo Switch is a trademark of Nintendo.", "metacritic": null, "released": "2022-07-08", "tba": false, "updated": "2022-07-11T03:24:32", "background_image": "https://media.rawg.io/media/screenshots/b43/b43765f6780b4231c3f83d7532813e15.jpg", "website": "https://yurukill.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 9, "toplay": 4, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ESQUADRA,inc.", "IzanagiGames", "G.rev"], "genres": ["Action", "Adventure"], "publishers": ["IzanagiGames"], "esrb_rating": null}