{"id": 815288, "slug": "the-balance", "name": "The Balance", "name_original": "The Balance", "description": "<p>Try to maintain the balance of different worlds by deciding where to send the essences of once living people. To Hell, to Heaven or ressurect them back on Earth. Your decisions will impact the outcome of your duty. </p><p>Will you manage to keep the realms balanced?</p><p>NOTE: The game is heavily based on reading and understanding.</p><p><strong>Explanation of the game</strong></p><p>Game idea:  </p><p>You are someone from heaven that studied the whole life to try and make life better. To get into the place called void where nothing exists. It is made purely for the most important task of all three realms. To balance people by deciding where to put them. In Hell, Heaven or back on Earth. Player starts by sending the \"correct\" essences into their corresponding realms. Like good people belong to be in Heaven. But slowly player understands that it is an impossible task. That there is no Good without the Evil and he has to throw bad people to Heaven. To balance it out. He questions himself if he has to be fair and do what is right. Good people go to Heaven, bad people to Hell. Then he askes himself if what he is doing makes any sence. If it matters. Why should there be a Balancer? Why should there be Hell or Heaven? At the end player loses all his hope and surrenders, throwing himself into the judgment of the Gods.</p><p><em>Theme \"Sacrifice\":</em><br/></p><p>You sacrifice people by sending them into the not corresponding realm. To balance realms. Like good people usually go to heaven, but since Hell has too many bad people and needs to get some good people to not explode you sacrifice good people and throw them into the depths of hell. And vice versa.</p><p><em>Limitation \"Failure is inevitable\":</em></p><p>Player has a task in mind. To make life better by sending \"right\" people into their \"right\" realms. But as he works his last days in the void, he understands that there is no Good without the Evil and players idea is impossible. He is doomed to fail if he sends people correclty.</p><p><em>Developers Feedback:</em></p><p>It is my first gamejam and my actually first game that I finished and showed to the public. I think I did a really good job and I am super proud of myself. The gamjam lasted for 3 days and I wanted to make the game as I had it in mind, ofcourse some things didnt end up in the release, but the game is still pretty decent, even though the repetitive ambient sound had to be better, better animations and art and ofcourse the core of the game, writing and characters had to be much better to keep the player engaged.</p><p>After 30 hours of nonstop developing, I can finally go out and touch some grass.</p><p>Leave a comment on what you think of the game!</p><p>Controlls: hope you can read what the game will tell you to do</p><p>Warnings:  for some people, some texts in game might be disturbing (texts contain things about death and murder). If you are in headphones you might not want to play on full volume.</p><p>Credits: in game</p><p><em>MiniNotes</em>: you might see some mistakes in texts, since english is not my native language. As well as bugs, since C++ is also not my native language.<br/></p>", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2022-07-11T05:09:48", "background_image": "https://media.rawg.io/media/screenshots/e7d/e7d26eed40da39dd95f69fd22c88106c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BigManRosss"], "genres": [], "publishers": [], "esrb_rating": null}