{"id": 815322, "slug": "a-rag-tag-team-of-survivors", "name": "A rag tag team of survivors", "name_original": "A rag tag team of survivors", "description": "<p>Made for Mini Jam 110: Sacrifice.</p>\n<p>You control 4 survivors, each with their own weaknesses and strengths. You must try to survive an endless horde of undead. Each night more dangerous than the first, but if one were to sacrifice themselves, surely the horde would calm?</p>\n<p>Features:</p>\n<p>- Control 4 different characters. While you are controlling one of survivor, the others will shoot zombies or follow you. You can freely swap between the survivors whenever.</p>\n<p>- Food and Ammo are precious resources. You only have a limited stash, search the map for more! If you run out, there will be hell to pay.</p>\n<p>- Score points by killing zombies! Easy as that!</p>\n<p>- During daytime there are fewer zombies. While at night faster and more zombies will appear! Each night the number of zombies increases and nights are getting longer but your score multiplier will increase as well!</p>\n<p>- When a survivor perishes they will lead the horde away, sacrificing themselves. This will reset the difficulty of nights but beware the score multiplier will also reset. Either choose who to sacrifice or let the horde choose for you!</p>\n<p>This game was made for Mini Jam 110: Sacrifice.</p>\n\n<p>Game by Gustav Larsson (Nitrp)</p>\n<p>Sound and music by: Markuss Sprogis and Nils Söderkvist</p>\n<p>Animations from Mixamo.com</p>", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2022-07-11T05:23:14", "background_image": "https://media.rawg.io/media/screenshots/656/6567d72c0fdc6e10032405f6edd12056.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nitrp"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}