{"id": 815477, "slug": "balance-itch-colodoo", "name": "Balance (itch) (colodoo)", "name_original": "Balance (itch) (colodoo)", "description": "<p>【theme】</p>\n<p>Sacrifice Failure is inevitable</p>\n<p>【Interpretation】</p>\n<p>- sacrifice</p>\n<p>It means that someone on your team may not be able to play, or may be sacrificed and cannot be resurrected next time.</p>\n<p>Resurrection means less</p>\n<p>failure is inevitable</p>\n<p>It means that there cannot be a 100% successful solution in the game, there must be one person who fails, and there must be losses in every game in the design</p>\n<p>- Failure is inevitable</p>\n<p>We set a success value and a failure value, and neither of them can pass the test, indicating that we can tolerate failure, and failure itself is inevitable.</p>\n<p>【sacrifice】</p>\n<p>You can get a character after the end of each level, but in the end you can only choose two characters, one of the characters must be sacrificed (also called sacrifice), and you can pass the sacrifice to the next level</p>\n<p>And each level of each character sacrificed is one-way,</p>\n<p>【Blood bar design】</p>\n<p>There will be a left and right bar, the left is failure, red, the right is success, orange, and only the middle three bars are green.</p>\n<p>If the red is overdrawn, it will fail. If it is successfully overdrawn, it will also fail directly. Only in the process, the sacrifice can choose to obtain or reduce the success value.</p>\n<p>【Customs clearance conditions】</p>\n<p>However, the condition for clearing the level must be that before the level is over, your value is just within the green range, then clear the level.</p>\n<p>But when you can't get the value back to the green area by clearing the customs and offering sacrifices in this level, the game is over.</p>\n<p>【Game Mode】</p>\n<p>(1) Dialogue task class X</p>\n<p>(2) Horizontal board action √</p>", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2022-07-11T06:23:47", "background_image": "https://media.rawg.io/media/screenshots/8f4/8f47679f06cba7b9012c0aef6ca5ece0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["colodoo"], "genres": ["Action"], "publishers": [], "esrb_rating": null}