{"id": 815459, "slug": "a-night-at-stitchcats", "name": "A Night at Stitchcat's", "name_original": "A Night at Stitchcat's", "description": "<p>Barely working, FNAF inspired horror game, that currently has only 2 enemies, but more coming in the future hopefully. I made it on scratch in like a day, and most of the time was trying to fix bugs, but it kinda works at the moment. I am posting this to let people see the game and maybe give feedback and tell me about bugs. Please tell me about all the bugs you find, I definitely need to fix a few things.</p>\n<p>HOW TO PLAY:</p>\n<p>BASICS: Move between rooms using the arrows on either side of your screen. In most rooms there is at least one object you can interact with. Click on objects to interact with them. Most objects help you, but don't mess with what shouldn't be messed with, or you'll face the consequences.</p>\n<p>STITCHCAT: Stitchcat will stay in the library, the room you start in, and will not leave. Make sure there is always food in Stitchcat's food bowl, or he will start to get hungry and alert you of this with a meow. If you don't feed him now within the next 2 seconds, he'll pounce. If you are not in the room while Stitchcat tries to pounce, he will wait for you to come back into the room. Once you do come back, you have a HALF A SECOND window to refill his food bowl. Don't forget, Stitchcat doesn't like to be pet.</p>\n<p>PRICKLY PLANT: Prickly Plant is in it's own room most of the time, since, you know, it's a plant. It will attack when clicked on as well, but if you look away for too long, the plant will strike. Since there are only a few things to do, Prickly Plant ends the game after a bit.</p>", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2022-07-11T06:15:59", "background_image": "https://media.rawg.io/media/screenshots/9d4/9d4e7c0e1418892291a3063b2299cd40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["8-BitAxolotl"], "genres": [], "publishers": [], "esrb_rating": null}