{"id": 815760, "slug": "enlace-tv", "name": "Enlace TV", "name_original": "Enlace TV", "description": "Micro game made in 2 weeks for the spanish Game Jam Devs Al Asador 2022\r\nSpanish:\r\nTema de la jam, cadena. Limitante, solo teclado.\r\n<p>Quizás pienses, ¿dónde está la cadena?, ¿la excusa es que ha encadenado la televisión?<br/></p>\n<p>Sería gracioso, pero no. Cuando estaba pensando en la idea para el juego, lo primero que hice fue buscar \"cadena\" en la RAE para encontrar inspiración.</p>\n<p>Entre las definiciones, podemos encontrar <em>\"Canal de televisión\",</em> pero realmente esa no es la que inspiró este juego, en realidad fue la siguiente:</p>\n<p><em>\"Conjunto de emisoras de radio o de televisión que emiten programas simultáneamente.\"</em></p>\n<p>Y así surgió la idea de hacer una <em>\"cadena de televisión\"</em>, también conocida como <em>\"red de televisión\"</em>.</p>\n<p><strong>Nota:</strong> La dificultad del juego va en función de tu habilidad para usar el teclado, si sueles jugar en PC quizás te parezca demasiado fácil, pero si eres mi madre este juego es imposible. No hay forma humana de equilibrar eso, así que he subido un gameplay a youtube enseñando el juego para la gente que tenga problemas en pasárselo. Link abajo.<br/></p>\r\nEnglish:\r\nJam theme, chain. Limitation, only keyboard.\r\n<p>Where is the chain, do you ask?</p>\n<p>Well, the theme isn't <em>\"chain\"</em> actually, the theme is <em>\"cadena\"</em>. And because it's a spanish game jam I used a spanish definition of <em>\"cadena\".</em></p>\n<p>The idea behind this game was <em>\"cadena de televisión\"</em>, which means \"tv network\".</p>\n<p><strong>Note:</strong> Game difficulty is relative to your keyboard skills, if you usually play on PC you may find it easy, but if you are my mom then this game is impossible. There's no way I can balance that, so I have uploaded a gameplay to youtube for people with difficulties. Link below.</p>\n\n\r\nChangelog 1.0.1\r\n<p>- Added K and L as an alternative to arrows</p>\n<p>- Now you can use ESC to exit anywhere<br/></p>", "metacritic": null, "released": "2022-07-09", "tba": false, "updated": "2022-07-11T08:15:07", "background_image": "https://media.rawg.io/media/screenshots/9e6/9e679db0bf2675cce79f5ebd979fb8be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Ethical Disorder"], "genres": ["Action"], "publishers": [], "esrb_rating": null}