{"id": 815895, "slug": "fire-line", "name": "Fire Line", "name_original": "Fire Line", "description": "<p>Fire Line is an interactive narrative style game where the player is left to observe the game environment before being able to interact with it by carrying out a single key gameplay decision. The prototype was developed over a period of about six months as a personal project (entering full development phase in late January/early February 2012). The prototype was developed using Unity 3D Pro.<br/><br/>I started developing Fire Line as a prototype after my initial concept idea was turned down by my university for funding. I then decided to drastically change the overall design of the game and instead focus on making Fire Line an interactive narrative style game, with a strong focus on researching and developing group and agent AI simulation techniques.</p>\n<p>Fire Line is set in an alternative present where the player takes control of a character belonging to the mysterious \"Chaos\" resistance movement. The players character is tasked with infiltrating the flooded dystopian city of Zone 8 and destabilizing the brutal regime of Father X. The players character hopes to accomplish this by planting and detonating a bomb in their backpack, in the main government administrative district of Zone 8.<br/><br/>Fire Line takes inspiration from literary works such as 1984 by George Orwell, the punk attitude of Ryu Murakami's Coin Locker Babies and the state-control overtones of  Alan Moore's V for Vendetta, as well as subconscious inspiration drawn from the audio visual elements of Pink Floyd's The Wall.</p>\n<p>Controls:<br/>WASD - Move Around<br/>Mouse  - Look Around<br/>Spacebar - Detonate Bomb<br/>1-0 - Change scenes <br/><br/>Windows users may need to install a QuickTime video codec to run the game properly. </p>", "metacritic": null, "released": "2022-07-09", "tba": false, "updated": "2022-07-11T09:11:02", "background_image": "https://media.rawg.io/media/screenshots/588/588e80574e9022ba2abf9ed5cad9e3fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["vladstoj"], "genres": [], "publishers": [], "esrb_rating": null}