{"id": 815963, "slug": "jammin-gems", "name": "Jammin' Gems", "name_original": "Jammin' Gems", "description": "<p>Like falling blocks?</p>\n<p>Like matching things?</p>\n<p>Ever wanted to do both at the same time?</p>\n<p>Jam along as you place blocks of colorful gems and swap them around to create matches of 3 or more in a row!</p>\n<p>The more you match at once, the more points your score. Exponentially!</p>\n<p><strong>This game can only be played with a mouse and keyboard.<br/></strong></p>\n<p><strong>How to play:<br/></strong>Use <strong>WASD</strong> or the <strong>Arrow keys</strong> on your keyboard to control the placement of the falling block of gems.</p>\n<p>Press <strong>A/D</strong> or<strong> Left/Right arrows</strong> to move left and right laterally.</p>\n<p>Hold <strong>S </strong>or <strong>Down arrow</strong> to descend faster.</p>\n<p>Press <strong>W </strong>or <strong>Up arrow</strong> to immediately drop the current block.<br/></p>\n<p>Press the <strong>Spacebar</strong> to rotate the current block 90 degrees clockwise.</p>\n<p>You can also press the <strong>Left Shift key</strong> to rotate 90 degrees counter-clockwise.</p>\n\n<p>Use the <strong>Mouse</strong> to swap already placed gems.</p>\n<p><strong>Left click </strong>an already placed gem to select it.</p>\n<p>Then<strong> Left click</strong> a directly adjacent gem to swap the two.</p>\n<p><strong>However, </strong>you can only swap two gems if it will create a match of at least 3 of the same gem in a row, vertically or horizontally.</p>\n\n<p>To help you in your matching jam session, you have <strong>two Special Abilities</strong> at your disposal; <strong>Superswap</strong> and <strong>Timestop</strong>.</p>\n<p>Activate <strong>Superswap</strong> by pressing the <strong>E</strong> key. Then, for a limited time, you can swap any adjacent gems, regardless of whether it will create a match or not.</p>\n<p>Activate <strong>Timestop</strong> by pressing the <strong>Q</strong> key. Then, for a limited time, time itself will come to a halt, giving you a chance to make a bunch of matches and watch them all pop in unison, gaining tons of points in the process.</p>\n<p>The <strong>Superswap</strong> and <strong>Timestop</strong> Abilities are ready to use when their respective icons near the bottom of the screen are <strong>white</strong>, they're active when they're <strong>blue</strong>, and they are unavailable and on cooldown when they are <strong>greyed out</strong>.</p>\n<p>On harder difficulties they won't last as long, and they take longer to come off of cooldown. Effective use of them will be key in your goal of earning a high score.<br/></p>", "metacritic": null, "released": "2022-07-09", "tba": false, "updated": "2022-07-11T09:38:00", "background_image": "https://media.rawg.io/media/screenshots/a01/a011f7b783bab308fd022e6a77404501.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["willcgames"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}