{"id": 8160, "slug": "optia", "name": "Optia", "name_original": "Optia", "description": "NOTE: Optia syncs progress across devices! Please see below for directions.<br/><br/>Optia is a beautiful, immersive physics game about reflected light. You must activate all targets in each level with a laser beam, powering the transition to the next.<br/><br/>Fortunately, your puzzle-solving instincts come in handy here! Using a clever assortment of mirrors, you can reflect a beam in any direction, split it into two separate beams (or four, or eight, or sixteen...), and if you must, sacrifice your own laser to clear a path to that last target.<br/><br/>And Optia doesn't end there! After cutting your teeth on the main campaign, you can create your own levels and upload them for others to play.<br/><br/>With 100 main levels, more than one thousand user-created levels, and a polished ecosystem for creating, playing, and rating new levels, you never really need to stop playing Optia. And you can decide if that's a good thing.<br/><br/>- Featured in Apple's New &amp; Noteworthy<br/>- Winner of Applied Arts Magazine Award for Game Design<br/><br/>----------------<br/><br/>TIPS &amp; TRICKS<br/><br/>- To sync levels across devices, unlock the level editor by completing 30 levels. Then, in the Editor level menu (the wrench icon), create an alias and a password. Finally, load Optia on your second device, go to the Editor menu, and log in.<br/><br/>- Load a previously solved level with its solution by tapping the level's colored dot in the level menu.<br/><br/>- When scrolling through the level menu, tap the Optia logo to jump back to the level you're currently playing.", "metacritic": null, "released": "2009-12-29", "tba": false, "updated": "2021-01-25T06:36:32", "background_image": "https://media.rawg.io/media/screenshots/ce4/ce41b3bb9351cc8acc79c014be083c8e.jpeg", "website": "http://bederstudios.com/optia", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Beder Studios"], "genres": ["Strategy", "Puzzle"], "publishers": ["Jesse Beder"], "esrb_rating": null}