{"id": 81601, "slug": "impossible-hex", "name": "Impossible Hex", "name_original": "Impossible Hex", "description": "Impossible Hex - Still The Original, Still The Best Capture Game on iOS. Imitated but Never Equaled.<br/><br/>Inspired by classic hex map board games, Impossible Hex is a reboot of the original 2009 iPhone capture game Bag Bigfoot. Your goal is simple. Capture the Moving Hex by placing Blocking Hexes onto the map.<br/><br/>• Cool interface makes it simple to select a game piece without errors.<br/>• Every level has a solution. No 'unsolvable' games.<br/>• Larger playing field offers more strategic possibilities.<br/>• Smart gameplay knows when you have circled the Moving Hex. No need for 'busy' work.<br/><br/>It so saddened us to learn that our game had been cloned so poorly, with games that had unsolvable levels and unplayable interfaces, that we HAD to do something to help the unfairly frustrated players. So we present to you ... IMPOSSIBLE HEX!<br/><br/>In 'easier' levels you'll find that some Blocking Hexes have already been placed on the map for you. As you progress, you'll find that higher levels have less and less Blocking Hexes.<br/><br/>To place a Blocking Hex, simply tap a unoccupied hex on the map. When you tap, IMPOSSIBLE HEX will highlight the hex you have tapped. If it's NOT the Hex you wanted to select, simply tap somewhere else on the map. This makes it simple to select the Hex you really wanted to pick.<br/><br/>You win a level when you have encircled the moving hex. IMPOSSIBLE HEX knows when you have encircled the Moving Hex. No need to fill in all the hexes. When the Moving Hex is trapped, you've won the level.<br/><br/>Impossible as it seems, every level has a solution. You just have to be clever enough to find a way of beating the Moving Hex.", "metacritic": null, "released": "2014-11-18", "tba": false, "updated": "2019-10-22T13:54:14", "background_image": "https://media.rawg.io/media/screenshots/57a/57a4854759e9ad6dc468bd5650e3d9cd.jpg", "website": "http://facebook.com/playscreen", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayScreen"], "genres": ["Arcade", "Puzzle"], "publishers": ["PlayScreen"], "esrb_rating": "Everyone 10+"}