{"id": 816054, "slug": "timewalker", "name": "TimeWalker", "name_original": "TimeWalker", "description": "<p>        </p>\n<p>        有这样一个种族，他们有着无穷无尽的生命，他们的乐趣就是在各个平行时空中穿行，体验不一样的人生，他们被称之为“时行者”，而这次，他们来到了一个可以学习战技和魔法的时空</p>\n<p>        玩家将带领着4名时行者进入地牢迷宫，通过战斗来学会这个世界中的各种技能，感悟之后转职为各种不同的职业.</p>\n<p>        游戏为Roguelike策略类型，每一次进入副本中都可以重新选择不一样的技能和职业，副本中的怪物和奖励也都是随机生成，我们的目标是收集副本中的资源开启更多的能力，职业以及更多的副本，在过程中玩家不再需要通过繁琐的操作去进行战斗，一切战斗流程都将由AI自动完成，玩家只需要对战斗结束后的收益分派进行决策。</p>\n<p>        欢迎加入qq群512376080讨论<br/><br/></p><p>        There is such a race, they have endless lives, their fun is to travel through parallel time and space, experience different lives, they are called \"time walkers\", and this time, they came to a place where they can learn to fight. Time and space of skill and magic</p><p>        Players will lead 4 timewalkers into the dungeon maze, learn various skills in this world through battles, and switch to various occupations after the realization.</p><p>        The game is a Roguelike strategy type. Every time you enter the dungeon, you can re-select different skills and occupations. The monsters and rewards in the dungeon are also randomly generated. Our goal is to collect resources in the dungeon to unlock more abilities and occupations. And more dungeons, in the process, players no longer need to go through cumbersome operations to fight, all combat processes will be completed automatically by AI, and players only need to make decisions on the distribution of income after the battle is over.</p>", "metacritic": null, "released": "2022-07-05", "tba": false, "updated": "2022-07-11T10:16:14", "background_image": "https://media.rawg.io/media/screenshots/cf2/cf29669a58ace3ec74d9892292dbde5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Heartfun"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}