{"id": 816137, "slug": "dyson-dilemma-simulation", "name": "Dyson Dilemma Simulation", "name_original": "Dyson Dilemma Simulation", "description": "<p>As a side project I created a GPU particle simulation in an attempt to recreate the formation and evolution of a spiral galaxy.</p><p>Then, pondering the idea of civilizations colonizing their galaxies slowly, not merely at less than the speed of light but at a tiny fraction of it (a process that has since been nicknamed \"crawlonizing\"), I added the ability to mark a star as a \"civilization\" and then, as it passed near other stars, the ability for it to \"colonize\" them, over time converting the entire galaxy into colonies.</p><p>This addresses the \"Dyson Dilemma,\" a question raised in Fermi Paradox conversations about whether expanding civilizations would enclose every star they occupied in a Dyson sphere that collects the majority of its visible light output, leaving only infrared waste heat. The experiment includes a visual toggle to highlight colonized stars in green or try to portray a more realistic view; in the latter, stars with Dyson spheres appear a faint red, and over time the whole galaxy starts to redden and dim.</p><p>Astronomers could consider ideas such as this when examining distant galaxies and speculating about whether they might be occupied.</p><p>Directions:<br/>All control is via the UI buttons at top left.<br/>Toggle \"Highlight civilizations\" to visualize civilizations in bright green or in a realistic view.<br/>A civilization can be spawned with the \"Spawn\" button but will not be clearly visible for some time unless highlighting is active.<br/>Press \"Start Over\" to erase all colonies and generate a new galaxy.<br/></p>", "metacritic": null, "released": "2022-07-08", "tba": false, "updated": "2022-07-11T10:47:03", "background_image": "https://media.rawg.io/media/screenshots/ff2/ff20c74e3c9cc34f0fcdc45009c1b73f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["problemecium"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}