{"id": 816189, "slug": "den-of-thieves-michel-momeyer", "name": "Den of Thieves (Michel Momeyer)", "name_original": "Den of Thieves (Michel Momeyer)", "description": "<p>A meditation on Matthew 21:13 exploring how a house of prayer can become a den of thieves. A little dose of \"unless the Lord builds the house, the workmen labor in vain\" from Psalm 127:1 is also thrown in there.<br/><br/>You are shepherding a small church: watching it grow in numbers, in knowledge of the word, and in power/reputation in the surrounding area. But watch out, be wary, pride and deceit and corruption are always at the door, looking to tear down all your hard work.<br/><br/><strong>Instructions:</strong><br/><br/>Goal: place as many tiles as you can in the 5 x 5 grid obtaining less than 20 points of corruption before the space is filled.<br/><br/>Every round you will get an opportunity to pick one of two church improvement cards. These will give you a handful of good tiles to place:<br/></p>\n<ul><li>Piety: study of the word, good teaching, humility, compassion and love. Represented by a bible icon.</li><li>People: how large your congregation is growing. Represented by an icon with a person on it.</li><li>Wealth/Art: how influential and affluential your church is in the surrounding area. Represented by an icon with a cathedral on it.</li></ul>\n<p>Following your church improvement card selection, you will be doled out a corruption tile. This can represent a heresy or an uncouth individual that is trying to take hold in your little congregation. You don't get a choice here and must work to minimize it's impact.<br/></p>\n<p>Corruption tiles may have some base corruption associated with them, but predominantly become more powerful based on the good tiles you've placed. They come in two main varieties: those that only impact adjacent spots and those which impact across the entire board. A gossip may be able to wrack up a good bit of corruption but only from people tiles nearby, whereas a spirit of pride might be able to feed on piety tiles anywhere on the board.<br/></p>\n<p>After picking your church improvement card and accepting your corruption tile, you will need to place those tiles on the board. Tiles can only be placed next to adjacent tiles, but be careful where you put them since many corruption tiles care about what their neighboring tiles, both when they were originally placed AND afterwards.<br/><br/>The goal of the game is to fill out the 5x5 board without garnering more than 20 points of corruption.<br/><br/>Hope you have fun and thanks for playing!</p>\n\n<p><strong>Credits / Assets Used:</strong><br/></p>\n<p>Used the Unity Engine.</p>\n<p>All the icons are from https://freeicons.io/ by the following talented artists:<br/>Icon by Fasil on freeicons.io<br/>Icon by Raj Dev on freeicons.io<br/>Icon by shivani on freeicons.io<br/>Icon by WANICON on freeicons.io <br/>Icon by Sorasak Pinwiset on freeicons.io<br/>Icon by itim2101 on freeicons.io</p>", "metacritic": null, "released": "2022-07-08", "tba": false, "updated": "2022-07-11T11:08:55", "background_image": "https://media.rawg.io/media/screenshots/802/8022ca62176260bc8564028d2bdb6536.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Michel Momeyer"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}