{"id": 81620, "slug": "tank-ace-1944-hd-lite", "name": "Tank Ace 1944 HD Lite", "name_original": "Tank Ace 1944 HD Lite", "description": "Do you like to drive tanks over rugged terrain, lob artillery shells into the far hills, and blow up lethal opponents lurking around every bend? If so, then Tank Ace 1944 could be the game for you.<br/><br/>In Tank Ace 1944 you command a World War II tank charging to occupy the enemy capitol. Allied and Soviet Tank Aces advance on Berlin; German Aces advance on London and Moscow. At least that's what the orders from HQ say. But since you face overwhelming odds and are forced to scavenge supplies as you go, you might just find yourself retreating instead.<br/><br/>The goal of each round of play is to clear the enemy from a map sector and drive them off the far bank of a river so that your side can cross and advance. Skills you will need to accomplish this are a working trigger finger, the ability to navigate West or East (left and right on the overhead map), and driving ability sufficient to crash into other vehicles.<br/><br/>A status panel shows the number of enemies left, rounds remaining, fuel, and armor strength. The last three can be replenished by ramming (not shooting) an enemy truck. If you run out of fuel or armor, or for some reason drive your tank into the water, in addition to an untimely death you will be forced to retreat one sector. If you wipe out the enemies you will advance one sector, retaining any excess supplies you have scavenged. The game ends when you take the enemy capitol, or they overrun yours. Either way the brass will want to have a talk with you.<br/><br/>Features:<br/><br/>- Play one of three aces: Allied, German, or Soviet.<br/>- Three tanks: Sherman, Tiger, or T34, each with movable turret and cannon.<br/>- Destroyable 3D landscape.<br/>- Perspective or overhead view.<br/>- Three difficulty settings.<br/>- Enemy trucks carrying rounds, fuel, and armor.<br/>- Save / Resume game.<br/><br/>This is the free Lite version with ads and limited supplies.  Please buy the full version 'Tank Ace 1944 HD' for truck resupply during the game.<br/><br/>Note: RESETgame does not condone invasion of other countries and cannot accept liability for such an event.", "metacritic": null, "released": "2010-04-08", "tba": false, "updated": "2019-07-30T06:41:15", "background_image": "https://media.rawg.io/media/screenshots/939/939c1483a7614cc58f3f1d26fa1b2a2b_Au4ruGG.jpg", "website": "http://www.resetgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RESETgame"], "genres": ["Action", "Strategy"], "publishers": ["RESETgame"], "esrb_rating": "Teen"}