{"id": 816359, "slug": "serious-fun-football", "name": "Serious Fun Football", "name_original": "Serious Fun Football", "description": "Are you ready to experience something fresh in the football video games genre? Don't let the game's cartoonish graphics deceive you! Let us surprise you with realistic characters' movement, kicking and real ball physics. <br/><br/>Creating this game, we wanted to move to the screen all these emotions that accompany playing with your friends on a small field in real life - the freedom of movement, constant looking out for a free position, dynamic gameplay. <br/><br/>Play friendly matches online or local in front of one screen with your friends. <br/>Play against AI in the league and gather the in-game coins. Use them to buy new team members in the Team Mode or boost up your own, designed by yourself, footballer in Solo Mode. You can also buy new outfits, unlock stadiums, and customize the appearance of your character!<br/><br/><h3>OTHER GAME FEATURES:</h3><ul><li> ⚽️ 3 vs 3 gameplay plus robot goalkeepers. </li></ul><ul><li> ⚽️ Football pitch surrounded by the fence, no throw-ins, corners or offsides. </li></ul><ul><li> ⚽️ In Solo Mode you control just one footballer. In Team Mode you control whole team by switching between footballers. </li></ul><br/><br/><br/>This Steam Early Access game is currently not a finished game and may or may not change significantly over the course of development. To learn more about Steam Early Access, please visit http://store.steampowered.com/earlyaccessfaq/<br/><br/>", "metacritic": null, "released": "2022-07-14", "tba": false, "updated": "2022-07-15T03:38:49", "background_image": "https://media.rawg.io/media/screenshots/c57/c5717aa53cb21fc9b436deb1a5418c36.jpg", "website": "https://seriousfunfootball.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 264, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KW-SFF"], "genres": ["Simulation", "Sports", "Indie"], "publishers": ["KW-SFF"], "esrb_rating": null}