{"id": 816328, "slug": "beyond-sunset", "name": "Beyond Sunset", "name_original": "Beyond Sunset", "description": "<p>Welcome to a high-octane cyberpunk first-person shooter with RPG elements. You are Lucy, an enhanced street samurai searching for lost memories. Fight yakuza, zombies &amp; robots in large, open, interactive levels. Inspired by Doom Eternal &amp; Deus Ex, made using a modernized Doom II engine!</p>\n<hr />\n<h1>:\\&gt;SUNSET CITY_CALIFORNIA_20XX</h1>\n<p>You awake from cryostasis with memories lost in the confusing fog of hypersleep. Immediately you begin to manifest powerful abilities. Lightning-fast reactions. Innate combat skills. Near-supernatural agility.</p>\n<p>Your talents are quickly recognized. A mysterious woman named Yuri offers you a deal. In exchange for getting your memories back, you need to utilise your powers to become a street samurai in the crime-ridden, plague-stricken Sunset City.</p>\n<h1>:\\&gt;GUN_JUTSU</h1>\n<p>Master the combat system based on fast reflexes and vertical awareness. Learn how to deflect bullets using your katana. Outrun your foes using dash/slide. Unlock and apply special abilities in surprising combat scenarios.</p>\n<h1>:\\&gt;LOCK_AND_LOAD</h1>\n<p>Identify threats and choose the best tools to eliminate them. From your trusty katana to a handy energy pistol, shotguns, rifles, and combat augments. All weapons offer an alt-fire mode that adds new tactical options.</p>\n<h1>:\\&gt;ROLE_PLAYING_SHOOTER</h1>\n<p>Upgrade and develop Lucy to grow more resilient and powerful. Explore large, open, interactive levels full of NPCs you can talk with. Discover the lore organically through dialogue, notes, and computer terminals. Learn who you really are, and uncover Yuri’s real agenda.</p>\n<h1>:\\&gt;MODDABLE_100%</h1>\n<p>Utilize the expansive mod support and make the game your own, for free! Create new levels, design weapons and special attacks, and spice up your gameplay.</p>\n<h1>:\\&gt;FEATURE_LIST</h1>\n<ul>\n<li><strong>Fluid movement:</strong> High-octane first-person action with advanced movements for dashing, sliding and other acrobatics.  </li>\n<li><strong>RPG Elements:</strong> Interact with NPCs, learn the lore of Sunset City, take side missions and upgrade your abilities.  </li>\n<li><strong>Lo-Fi aesthetic:</strong> inspired by classic first-person shooters, from Doom to Duke Nukem 3D to Blood.<br />\n<strong>Synthwave vibe:</strong> Hear an original vaporwave soundtrack composed by synthwave legend Karl Vincent.  </li>\n<li><strong>Mod support:</strong> Create and share your own levels, weapons and more with richly-featured free and open-source tools.</li>\n</ul>", "metacritic": null, "released": "2023-07-31", "tba": false, "updated": "2023-11-17T10:49:19", "background_image": "https://media.rawg.io/media/screenshots/e13/e13f972305d7d3498825c0680522a391.jpg", "website": "https://metacorp.itch.io/beyond-sunset", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "toplay": 11, "dropped": 1, "playing": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 4, "suggestions_count": 483, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "macOS"], "developers": ["Metacorp", "Vaporware"], "genres": ["Action", "Shooter", "Adventure", "RPG", "Indie"], "publishers": ["Movie Games"], "esrb_rating": null}