{"id": 816368, "slug": "sabotris", "name": "Sabotris", "name_original": "Sabotris", "description": "Sabotris is a strategic, competitive, 3D block stacking game, but with a twist: you can sabotage your opponents, but be careful; you can also end up sabotaging yourself! Choose to play either by yourself to beat your own high score, against your friends or other players, or even against computer AI!<br/><br/><br/>Competitive? Yes. Casual? Also yes. You choose the level of difficulty that suits your play style. Have a relaxing game against your own score, or group up with your friends or strangers and see who can get the highest score! Though warning in advance, only play against the computer AI on the highest difficulty at your own risk...<br/><br/><br/><br/><br/>It's not just about being the fastest at the game, power ups allow you to sabotage or assist your opponents. This takes the competitive edge to the next level, where you can intentionally sabotage a single player every time, or if you find Sabotris too easy, sabotage yourself!<br/><br/><br/><br/><br/>Spectating other people can be boring, so Sabotris doesn't make you do that when you lose. Instead, you get to roam the world as a miniature cube with your other friends that also lost. You can even pretend you're in another mini-game avoiding shapes being dropped by the ones that are still playing!<br/><br/><br/><br/><br/>Whether you're a fiend of playing with others or just want to relax with your friends, multiplayer lobbies are a must. Sabotris makes lobbying with friends or strangers seamlessly simple. Just host a game, and watch people join!", "metacritic": null, "released": "2022-07-10", "tba": false, "updated": "2022-07-15T03:52:59", "background_image": "https://media.rawg.io/media/screenshots/f6c/f6c630e9d0764e9be3511d3624b828ed.jpg", "website": "https://sabotris.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 1, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Phlarfl"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Phlarfl"], "esrb_rating": null}