{"id": 8164, "slug": "aliens-versus-humans-missions", "name": "Aliens versus Humans: Missions", "name_original": "Aliens versus Humans: Missions", "description": "** All In App Purchases are now free. **<br/>** This App will be FREE from December 25th 2016 to January 1st 2017 inclusive **<br/>** Check out Aliens versus Humans: The Onslaught for base management, the Geoscape and free-form missions. **<br/><br/>Aliens versus Humans: Missions introduces multiplayer PvP with three PvP modes.  Challenge your friends or random people via Game Center.  If you were awesome at the original X-Com, this is your chance to own the leader boards.  What are you waiting for?<br/><br/>In addition, you can play the single player mode where you play through 25 missions that follow a storyline about why the aliens are back on Earth, how they got here and it is up to you to figure out how to remove the alien threat.<br/><br/>If you’re looking for the Geoscape, Bases, Research and Manufacturing, then check out our other app Aliens versus Humans.  Relive turn-based strategy of your youth.<br/><br/>PvP Feature list: <br/>* Three PvP modes:<br/>* Classic PvP: Start a mission grouped up.  Defeat your opponent before they defeat you.<br/>* Capture the Flag: Change up your tactics.  Get to your opponent’s flag before they get to yours.<br/>* Scramble PvP: Start with your soldiers scattered across the battlefield.  Hide, group up, dominate.<br/>* All PvP modes allow you to design your own mission to challenge others.  Choose terrain, day or night mission, weapons and armor.  Equip your soldiers and go.<br/>* Integrated with Game Center Leader Boards.<br/><br/>Story Mode:<br/>* Play 25 missions that proceed along a storyline, including night time missions.<br/>* 11 weapons and 3 armor types that unlock based on game progression. <br/>* 3 star rating system for missions. <br/>* Your soldiers&amp;#39; stats improve based on their experience during missions. <br/>* Randomly generated maps = ultimate replayability. <br/>* Destructible terrain. <br/>* On-the-fly Line of sight. <br/>* Ability to customize your squad for each mission. <br/>* 4 zoom levels that allow you to see more of the battle map or get up close and personal. <br/>* 20 achievements that will challenge you beyond the game via Game Center.<br/><br/>Practice Mode:<br/>* Design and play your own missions. Choose terrain, soldiers, weapons and armor. Set alien intelligence from easy to truly evil.<br/><br/>What are you waiting for?  Give Aliens versus Humans: Missions a try today.<br/><br/>Twitter: @aliensvshumans<br/>Facebook: http://www.facebook.com/pages/Aliens-versus-Humans/323015897724713<br/>YouTube: http://youtu.be/j3M8LwLqB3g", "metacritic": null, "released": "2012-12-10", "tba": false, "updated": "2019-10-22T14:29:50", "background_image": "https://media.rawg.io/media/screenshots/295/295f4a590e00a3cc9e4b0c71cc9d7031.jpeg", "website": "http://www.aliensvshumansapp.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Leisurerules"], "genres": ["Adventure", "Strategy"], "publishers": ["Leisurerules"], "esrb_rating": "Everyone 10+"}