{"id": 816482, "slug": "first-sexy-night", "name": "First Sexy Night", "name_original": "First Sexy Night", "description": "First Sexy Night is a short, but sweet visual novel about losing your virginity. It's a story about taking that first step with someone you care about and making the night memorable. The game is designed for players who are 18 years or older. The game contains lots of nudity and explicit sexual scenes where you get to explore every possible way to spend a first night with a sexy girl.<br/><br/><br/><br/><strong>Features:</strong><br/><br/>- A branching storyline with choices that matter<br/>- Original artwork and relaxing music<br/>- <strong>Sexy explicit </strong>scenes to enjoy<br/>- Even more sexier <strong>implicit </strong>scenes to enjoy<br/>- Many ways to fail<br/>- Emotional investment<br/>- <strong>Short</strong> and sweet experience<br/><br/><strong>Story:</strong><br/><br/>First Sexy Night is a visual novel about spending the first night with Ginny. You've known each other for a while and she seems to really like you, but the only problem is ... you are both still a virgin. You've been waiting for the right moment to make your move, but now that the moment is finally here, you're not sure what to do.<br/><br/>Ginny is a great girl and you really want to make this night special for her. You'll need to explore every possible way to make her happy and satisfy her needs. From romantic gestures to naughty bedroom talks, you'll have to do whatever it takes to make her feel comfortable and satisfied.<br/><br/>This is your chance to finally cross that line and lose your virginity. Will you be able to make the night unforgettable?", "metacritic": null, "released": "2022-07-14", "tba": false, "updated": "2022-07-15T06:21:08", "background_image": "https://media.rawg.io/media/screenshots/1f2/1f2787054a5767e1606b963840fcfc5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cute Pen Games"], "genres": ["Casual"], "publishers": ["Cute Pen Games"], "esrb_rating": null}