{"id": 816441, "slug": "urbek-city-builder", "name": "Urbek City Builder", "name_original": "Urbek City Builder", "description": "https://store.steampowered.com/app/1903510/Technicity_Prologue/<br />\nhttps://store.steampowered.com/app/1876930/Saloon_Simulator<br />\nIn Urbek, you will be able to build a city of your own design! Manage its natural resources, improve the quality of life of the population, and build its neighbourhoods in your own way.NeighbourhoodsBreathe life into your city by building different neighbourhoods. Do you want a bohemian neighbourhood? Build bars, parks and libraries, but keep a low population density nearby. Do you want a bourgeois neighbourhood? You need parks and luxury shops.<br />\nManageThere is no money in Urbek. Instead, you will have to build everything with your own resources, such as food, coal, or skilled work. There are more than 30 different resources to manage! Manage your natural resources well, so that they do not run out before they can be replaced. How will you choose to produce the energy for your inhabitants and industries?<br />\nEducateEducation is fundamental! By producing enough qualified work and scientific work, you will be able to build more advanced buildings.<br />\nObserveMove around at street level in order to get a more intimate sense of the city you are creating. See and feel the differences between neighborhoods the way your city’s residents do!<br />\nOrganic growthThe growth of your city will be organic. Some constructions will appear according to the surrounding conditions. For example, buildings with more than two floors will appear in densely populated areas and with basic services.<br />\nYou can place other buildings by yourself, but they need some conditions. For instance, the local market needs to be close to the farms. The university should have some high schools nearby, which, in turn, require nearby schools.<br />\nWhen it comes to designing your city, you have a variety of viable options. There are no buildings that are superior to others. Every decision will have its pros and cons. Bourgeois houses consume more food and need resources that cost more to produce, but will improve the quality of life of the residents there. On the other hand, improving the productivity of industries will produce more resources, but will diminish the quality of life for residents living in the area.</p>", "metacritic": null, "released": "2022-07-12", "tba": false, "updated": "2023-11-03T10:18:43", "background_image": "https://media.rawg.io/media/screenshots/090/0906a57175bc79688ec1d7b881f66612.jpg", "website": "https://urbek.tumblr.com/", "rating": 3.12, "rating_top": 3, "added_by_status": {"yet": 5, "owned": 67, "beaten": 1, "toplay": 4, "dropped": 4}, "playtime": 3, "achievements_count": 99, "ratings_count": 8, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 8, "platforms": ["PC", "Nintendo Switch"], "developers": ["Estudios Kremlinois"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["RockGame"], "esrb_rating": null}