{"id": 816479, "slug": "the-quest-for-excalibur-puy-du-fou", "name": "The Quest For Excalibur - Puy Du Fou", "name_original": "The Quest For Excalibur - Puy Du Fou", "description": "Everyone is familiar with legendary King Arthur and his bitter rival Lancelot.<br/><br/>Consumed with envy, the latter challenges the king to a duel. Arthur’s faithful sword Excalibur splinters and breaks until only the cross-guard and handle remain. <br/><br/>Arthur enters into a pact with Morgan the Fairy and throws what’s left of his sword in troubled waters. He is then betrayed and ends up a prisoner in the afterlife Kingdom of Avalon. <br/><br/>By order of his beloved king, the wizard Merlin sets out on a quest to find Arthur’s heir, gather Excalibur’s 15 fragments and bring Arthur back from the dead.<br/><br/><ul><li>A game map modelled after the world-renowned French theme park.<br/></li><li>Leave your mark on the Arthurian legends and embark on an adventure of a lifetime to set the king free and find all 15 Excalibur fragments.<br/></li><li>Travel through time and face a horde of vicious enemies: resist the assault of the dreaded Viking warriors, enter the Roman arena and fight for your life, live the Knight life and win brutal jousting tournaments.<br/></li><li>Visit a carbon copy of the Puy du Fou domain to find cues and see your mission through, or stroll around the map to complete history-themed secondary quests.<br/></li><li>Create your own avatar and build a customized Puy du Fou experience  as though you were there.<br/></li><li>Over 15 challenges and a treasure trove of items to discover in a unique whirlwind through Antiquity and the Middle Ages.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-15T06:18:08", "background_image": "https://media.rawg.io/media/screenshots/e6f/e6f04947ae2c61cc98ada65735e6829f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 279, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Balio Studios"], "genres": ["Action", "Adventure"], "publishers": ["Microids"], "esrb_rating": null}