{"id": 816420, "slug": "monument-valley-2-panoramic-edition", "name": "Monument Valley 2: Panoramic Edition", "name_original": "Monument Valley 2: Panoramic Edition", "description": "<strong>Perception meets  reality in Monument Valley 2, the atmospheric return of the acclaimed smash hit Monument Valley. Explore, Grow and Guide Ro and her Child through a magical and moving world. </strong><br/><br/>Discover illusionary pathways and delightful puzzles as you learn the secrets of The Sacred Geometry. <br/><br/>In this meditative and calming puzzle game, follow the heart warming story of Ro in her journey through motherhood. Rediscover independence through manipulating monuments and evolving paths to explore new, surreal, and mysterious worlds.<br/><br/><h3>The Award Winning Series Returns</h3><ul><li>Welcome back to the world of magical and mysterious monuments  in Monument Valley 2, the award-winning sequel to the critically acclaimed Monument Valley. <br/></li><li>Featuring brand-new environments and puzzles to explore, Monument Valley 2 is a surreal and beautiful experience, with an mistakably unique art style inspired by optical illusions that will keep players feeling in awe.  <br/></li><li>As you make your way through Ro and her child’s adventure, there will always be exciting and mysterious mechanics to unlock, and new friends to meet along the way.</li></ul><br/><h3>Beautifully Unique</h3><ul><li>A critically acclaimed sequel to Monument Valley, Monument Valley 2 returns you to the world of magical and mysterious architecture in a completely stand-alone adventure. You don’t need to have played the original Monument Valley to be able to enjoy this experience. The game features brand new worlds and unique puzzles to explore.</li></ul><h3>Simple For All</h3><ul><li>Click and drag to reshape the world and help Ro and her Child explore breathtaking yet impossible areas. Designed to be easy for everyone to pick up, enjoy and complete. Monument Valley 2: Panoramic Edition is the biggest and best way to play Monument Valley 2 yet.  </li></ul><h3>A New Way to Play</h3><ul><li>With an entirely new control scheme reimagined for PC, you can interact with the universe of Monument Valley in a unique and tactile way. Combined with an all-new panoramic way to play the game designed for Full HD and ultrawide displays, Monument Valley 2 is more awe-inspiring and beautiful than ever before. </li></ul><h3>Every Puzzle Included</h3><ul><li>Monument Valley 2: Panoramic Edition is the total collection of all Monument Valley 2 content - with every chapter added to make this the ultimate game to add to your collection. Taking influence from minimalist 3D design, optical illusions and  ancient architecture from around the world, every monument is a unique, hand-crafted world to explore.  </li></ul><h3>Two Is Better Than One </h3><ul><li>Monument Valley: Panoramic Edition and Monument Valley 2: Panoramic Edition are both available at an exclusive bundle price when purchased together on Steam. The Panoramic Collection  is the best way to play the Monument Valley series.</li></ul><br/><br/><br/><br/><br/><br/><strong>ustwo games are proud independent developers, best known for the award-winning Monument Valley series, Land’s End, Assemble with Care and Alba: A Wildlife Adventure.</strong>", "metacritic": null, "released": "2022-07-12", "tba": false, "updated": "2024-04-11T21:44:10", "background_image": "https://media.rawg.io/media/screenshots/13b/13b8fc69fe2eb1808dae6ed4044c872e.jpg", "website": "https://www.monumentvalleygame.com/mv2", "rating": 4.15, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 144, "beaten": 13, "toplay": 10, "dropped": 1, "playing": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 12, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 13, "platforms": ["PC"], "developers": ["ustwo games"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["ustwo games"], "esrb_rating": null}