{"id": 816456, "slug": "isolania", "name": "Isolania", "name_original": "Isolania", "description": "Inspired by Robert Brock's Presentable Liberty and Hugh Howey's Wool, <strong>Isolania </strong>is a game that takes place in a solitary cell. You read letters, go to work, eat, shower, and watch entertainment on a telescreen called the Life Station. You're told the world beyond your four walls is crumbling. Carefully manage your time and resources to prevent the onset of insanity and investigate clues to discover what is really happening to you and everyone else.<br/><br/><br/>- Manage your energy, hunger, hygiene, bladder and sanity.<br/>- Dynamic day/night cycle.<br/>- Go to work and earn a paycheck.<br/>- Take that paycheck and manage it carefully, or gamble it all away.<br/>- If you do gamble it away, you can take out a loan, and hopefully learn your lesson. Or not.<br/>- Reach out and connect with pen pals who can write to you and help pass the time.<br/>- Do pushups in the morning to keep you fit.<br/>- Listen to the radio.<br/>- Receive packages from CentEx couriers.<br/>- Play action-packed arcade games.<br/>- Shop at the mega popular online store.<br/>- Try your luck in the Mega Millions lottery.<br/><br/><br/>Congratulations on being chosen for Isolania, the last governing body of civilization. Here, you are sheltered from the outside, protected from the scourge that has decimitated the planet. I assume you understand the responsibility you are now charged with. Namely, to obey all the rules and regulations dictated within our city.<br/><br/><br/>As The Sadness spreads, Podders are reminded that the only cure against this scourge is to embrace Isolation. To combat feelings of loneliness, use your Life Station; it could save your life and those of your loved ones.<br/><br/><br/>Although we are blessed to live within the walls of Isolania, the world abroad hasn't been afforded the same grace. Globally, the plague has claimed an estimated six million lives. The Ministry of World Affairs has released a new report, citing that as many as 10,000 human lives are claimed every month. The population is dangerously low already...soon, there will only be us. Isolanians.<br/><br/><br/>Isolania  should be viewed as a three-dimensional visual novel. The story progresses through reading, and takes place (mostly) in a single room and can elicit feelings of intense isolation (unironically). Playtime is expected to be between 3-5 hours.", "metacritic": null, "released": "2022-07-13", "tba": false, "updated": "2022-07-15T05:48:37", "background_image": "https://media.rawg.io/media/screenshots/dce/dceed4edaccce60b12e80498112e487b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sunamii"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Sunamii"], "esrb_rating": null}