{"id": 816642, "slug": "pareidolia-going-home", "name": "Pareidolia: Going Home", "name_original": "Pareidolia: Going Home", "description": "<p><em>//transcription in progress:</em></p>\n<p><em>&gt;You might have been separated, but you are not alone...</em></p>\n<p><em>//end of transcription.</em></p>\r\nWhat is Pareidolia: Going Home?\r\n<p>Pareidolia: Going Home <em>(or just Pareidolia for short)</em> is a puzzle platformer where you are being hunted. Take on the role of an excavation robot lost in the uncharted caves deep in the earth. Being separated from your team after falling through a schism, you must venture into the darkness alone with nothing but your battery powered work light to illuminate the way.</p>\n<p>Clear a path by pushing large mounds of rubble to reach ledges and powering various blast doors to reveal passageways. Overcome hazards that hinder your progress, some that might need special attention to overcome and others that must be avoided to ensure your survival.</p>\n<p>Collect various log tapes that can be transcribed to give context to the world and the dangerous phenomena that plague the caves below. Team up with unlikely friends to reach your goal and to discover hidden secrets in the underground world.</p>\n<p>==========================================</p>\r\nFeatures\r\n<ul><li>Handcrafted levels with detailed environments</li><li>Charming characters and dialogue set in an story unfolded by the player</li><li>A visual style utilizing pixel graphics and digital paintings</li><li>Eerie soundscapes of a world hidden below</li><li>Fully customizable controls with general XInput compatibility</li></ul>\n<p>==========================================</p>\r\nCurrent State of the Game\r\n<p><strong><em>Pareidolia: Going Home is currently in early stages of development.</em> </strong>I am looking to promote the game and to collect as much feedback as possible to ensure the game's success. The demo is a free download and I am treating the development of Pareidolia like a full-time job. Additional funding might be necessary in the future to see the project through but for now I hope you find something that resonates with you in this short, proof-of-concept demo!</p>\n<p>You can submit a crash/bug report or feedback following the google forms link here. I am solo developing Pareidolia and I appreciate any and all feedback retaining to the game.</p>\n<p>Be sure to follow <strong>@pareidoliagame</strong> on Twitter and Instagram for updates and additional information down the road!</p>", "metacritic": null, "released": "2022-07-14", "tba": false, "updated": "2022-07-15T07:29:14", "background_image": "https://media.rawg.io/media/screenshots/a16/a160f660a3040f1ef232ee8ca617a7ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["James Harper"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}