{"id": 8166, "slug": "elenints", "name": "Elenints", "name_original": "Elenints", "description": "Visible only through a scanning electron microscope, tiny nanorobots called Elenints (or Nints, for short) are built in a Molecular Nanobot Factory in the space between sheets of carbon molecules. They can&amp;#39;t move on their own, but when they detect enough identical Elenints nearby they fuse into more complex forms - releasing a special substance called Protomatter. If you plan your Nint placement carefully, placing a single Nint can initiate a cascade of combinatorial self-assembly, creating vast amounts of Protomatter and a rare, high level Nint.<br/><br/>You&amp;#39;ll need this Protomatter to keep the experiment clear of other, more radical Elenints like Creepers and Bombs, which can invade and pollute the experiment. Protomatter can be used in the Elenint Fabricator to build special Nints, such as Shields or the Binder, which can compel nearby Nints to self assemble.<br/><br/>Easy to learn and maddeningly addictive, Elenints is a game you can play anytime, whether you have a few minutes to spare or a few hours. <br/><br/>Elenints is free to play and comes with eight different challenges in normal or hard difficulty modes which you can play as many times as you like, trying to beat your high score. <br/><br/>Elenints can be played in English, French, Italian, German, and Spanish!<br/><br/>The full, unlocked game adds more than a dozen new challenges, including the &amp;quot;Endless Challenge&amp;quot; where you can attempt to build the highest Elenint possible, the elusive Rank Seven Nint.", "metacritic": null, "released": "2012-05-22", "tba": false, "updated": "2019-10-22T14:29:50", "background_image": "https://media.rawg.io/media/screenshots/498/4980f0b421aa0a9caf1a3316ebd03634.jpeg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Red Fly Studio"], "genres": ["Family", "Puzzle"], "publishers": ["Red Fly Studio"], "esrb_rating": "Everyone 10+"}