{"id": 81677, "slug": "pokertini-video-poker-with-a-twist", "name": "Pokertini: Video Poker With A Twist!", "name_original": "Pokertini: Video Poker With A Twist!", "description": "\"Pokertini puts an exciting spin on video poker\" - AppAdvice<br/><br/>\"The twist menu adds all sorts of crazy strategy to how you go about playing each hand, and is a really fun way to mix up the tried and true video poker gameplay.\" - TouchArcade<br/><br/>*** Featured in App Advice Daily’s \"Macworld 2012 Best Mobile Apps Roundup\" ***<br/><br/>Pokertini: Video Poker With A Twist brings the classic casino favorite to a whole new level with a detailed and exciting strategic overlay. <br/><br/>In Pokertini: Video Poker With A Twist, players simultaneously play three independent video poker hands, and arrange their simulated bets to maximize payoffs on favored hands.  In addition, they use strategic twists to manipulate their cards to improve their hands and odds of winning.  Along the way, they earn badges and unlock new twists, keeping the game challenging and exciting.<br/><br/>With over a dozen twists to unlock along with badges and Game Center achievements to earn, players will find that Pokertini: Video Poker With A Twist  makes for hours of challenging, enjoyable gaming.  <br/><br/>Features <br/><br/>- Strategically arrange your bet across three independent video poker hands<br/>- Dynamic simulated betting system – bet anywhere from 3 coins to 15,000 coins on one hand!<br/>- Adrenaline pumping bonus rounds<br/>- Many Twists or to unlock and Badges to earn<br/>- Mind blowing lounge music and sharp, eye-popping graphics<br/>- GameCenter enabled with many achievements and leader boards", "metacritic": null, "released": "2012-02-21", "tba": false, "updated": "2019-10-22T14:22:28", "background_image": "https://media.rawg.io/media/screenshots/64f/64f751d407296c3a4ec39b88980f423a.jpg", "website": "http://www.smappsoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Smappsoft"], "genres": ["Card"], "publishers": ["Smappsoft"], "esrb_rating": "Teen"}