{"id": 816904, "slug": "nitro-back", "name": "Nitro Back", "name_original": "Nitro Back", "description": "<strong>Live NOW on KICKSTARTER!✨<br/></strong>\n<p><strong>This is a demo of the current alpha version of the game so you will encounter bugs, crashes and other technical errors. Feel free to comment your opinions in order to improve Nitro Back!</strong><br/></p>\n\n<p>Nitro Back is a racing game that embraces a retro graphic style using current technologies, with the use of 3D low poly models and pixel art textures, combined with global illumination.</p>\n<p>Race a variety of classic cars and compete on a set of circuits against the AI in an arcade gameplay with drifting and nitro mechanics.</p>\n<p>Prove that you are the best on the track by dominating the other competitors. Choose different game modes and have a great time!</p>\r\nTHE CARS\r\n<p>Nitro Back will feature a variety of classic cars inspired by the 80s and 90s, in a highly polished pixel art style. As you progress through the game, you will unlock them with different color variants. Here is a preview of the currently available cars, more will be added in the final version :)</p>\n\r\nGAME MODES\r\nNitro Cup Mode\r\n<ul><li><strong>Nitro Cup</strong><br/>\r\nPlay in a set of cups of several circuits each, and compete with the AI and win points for each victory.</li></ul>\r\nEnldess Run mode\r\n<ul><li><strong>Endless Run</strong><br/>Drive on infinite tracks procedurally generated with different themes in retrowave style, listening to music from the game or your own. </li><li><strong>Custom</strong><br/>Customize the race attributes to your liking and compete.</li><li><strong>Time Trial</strong><br/>Compete with yourself to see if you have improved your driving skills.</li></ul>", "metacritic": null, "released": "2022-07-13", "tba": false, "updated": "2022-07-15T09:26:48", "background_image": "https://media.rawg.io/media/screenshots/aff/aff9f2a3708cb4ed8a12dbecf3b8a08e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Palium"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}