{"id": 816925, "slug": "sparrow-solitaire-playdate-early-access", "name": "Sparrow Solitaire (Playdate Early Access)", "name_original": "Sparrow Solitaire (Playdate Early Access)", "description": "<p><em>Sparrow Solitaire</em> is a tile-matching mahjong solitaire game in the style of classic Macintosh game <em>Shanghai</em>. The game is <strong>still in active development</strong>, but we are opening up pre-orders at a 20% discount so we can share our preview build.  </p>\n<p>Purchasing now <strong>gets you the final game when it releases</strong> in the next couple of months <em>and</em> <strong>early access to a high-quality build</strong> that you can play today! Or if you'd rather wait for the full release, we will have a stripped-down free demo available so you can try before you buy. </p>\n<p>  <br/></p>\n\n<p>The goal of the game is to <strong>clear the layout by matching pairs of free tiles together</strong>. Free tiles are those which don't have any tile on top of them and whose left and right sides are unblocked (in other words, they can be \"slid out\" to the left or right without interruption). In a traditional 144 tile layout, there are 42 different tile faces: 34 normal tiles with four copies each, 4 unique “season” tiles that match with each other, and 4 unique “flower” tiles that match with each other. An example of all the suits and their variations for the traditional Chinese tileset can be found here. In this game, the seasons and flowers are the only tiles that match with each other but don't look identical, so we added black and white dots to help identify these matching sets.</p>\n\n<p>The game ends in two ways:\r\n</p>\n<ul><li><strong>All tiles are removed</strong> <em>(your best time is recorded)</em>\n</li><li>There are <strong>no possible matches remaining</strong> <em>(your lowest number of tiles remaining so far is recorded)</em></li></ul>\n\n<p>We hope to create the definitive version of mahjong solitaire, exceeding the best computer and console ports. The demo has all the gameplay functionality you would expect: use the <strong>A button to select and match tiles</strong>, use the <strong>B button to deselect</strong> the currently selected tile, and<strong> hold B to open a sub-menu with hint, undo, redo</strong>,<strong> and restart options</strong>. If you get stuck, <strong>shake the Playdate to reshuffle the tiles </strong>(only once per game!). While the demo only contains the classic tile-matching mode, the full game will have an alternative mode based on <em>Shisen-Sho</em>, as well as 2–player multiplayer.</p>\n\n\n<p>Our tilesets were drawn from the ground up with the Playdate’s screen in mind and they look beautiful on the device. In addition, the crank can be used to snap the cursor to the nearest free tile in the left/right directions or cycle through the available matches if using a hint. Although mahjong games often rely on mouse or touch input, we spent a lot of time on our D-pad controls so that the <strong>cursor snapping feels intuitive, fast, and smooth</strong>.</p>\n\n<p>Currently, the game includes <strong>8 tilesets, 12 backgrounds, 5 layouts, and several gameplay options</strong> to customize your experience. The final game will have even more: multiple background music tracks, dozens of layouts ranging in both difficulty and size, and <strong>an advanced built-in editor for creating and sharing layouts with the community</strong>.\r\n</p>\n\n\n<p>The demo uses the pause screen to track your playtime, score, and win rate both overall and per-layout. Your best score (tiles remaining) is recorded before beating a layout, and your best time is recorded after beating a layout. The full release will have even more detailed stats, and a full history log of all your games! <em>We cannot guarantee save data compatibility between the demo and full release.</em><br/></p>\n\n\n<p>Immense care has gone into everything from cursor movement to on-device performance and loading times. The demo includes thoughtful animations and transitions for nearly everything, and has been thoroughly play-tested. In the full game, you can look forward to an even larger variety of deal animations and transitions, in addition to <strong>a custom algorithm that guarantees every tile deal is solvable.</strong></p>\n\n<p><strong>CONTROLS</strong></p>\n<p><strong>D-pad</strong> — move cursor between tiles</p>\n<p><strong>A button</strong> — select or deselect current tile</p>\n<p><strong>B button</strong> — deselect tiles regardless of where cursor is</p>\n<p><strong>B button (hold) + D-pad</strong> — open context menu for Undo/Redo/Hint/Restart</p>\n<p><strong>Crank (during gameplay)</strong> — snap cursor to closest free tile</p>\n<p><strong>Crank (during hint)</strong> — cycle through possible matches</p>\n<p><strong>Shake</strong> — reshuffle tiles to get out of a tricky or impossible situation (once per game)</p>\n<p><strong>Menu</strong> — view stats, switch layout, or open options</p>\n<p><strong>OPTIONS</strong></p>\n<p><strong>Cursor mode </strong></p>\n<p><strong>        Free tiles</strong> — snap between free tiles only</p>\n<p><strong>        All tiles </strong>— snap between all tiles</p>\n<p><strong>        Grid</strong> — unlocked cursor that can move freely off the layout</p>\n<p><strong>Cursor wrap</strong> — sets if the cursor wraps to the opposite side of the screen in free or all tiles snap modes</p>\n<p><strong>Show blocked tiles</strong> — indicate tiles that are non-free and can't be selected</p>\n<p><strong>Show tile count</strong> — show/hide the tile counter in top right</p>\n<p><strong>Auto deselect</strong> — if on, both tiles are deselected after an invalid match instead of just the most recent one</p>\n<p><strong>Deal Style</strong> — to reduce peeking, tiles can be dealt face down and then turned face-up when the animation is complete</p>\n\n<p><strong>Mac Vogelsang</strong> (@vogelscript): programming, design, sound\r\n</p>\n<p><strong>Matt Sephton</strong> (@gingerbeardman): art, design, sound, fonts, prototype\r\n</p>\n<p><strong>YuyakeMonster </strong>夕焼けモンスター (@yuyake_monster)<strong>:</strong> music<br/></p>", "metacritic": null, "released": "2022-07-13", "tba": false, "updated": "2022-07-15T09:35:41", "background_image": "https://media.rawg.io/media/screenshots/425/425b4733b17043360e44bd2004de986a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gingerbeardman", "Vogelscript"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}