{"id": 817072, "slug": "alien-knightmare-pgc-jam-4", "name": "Alien Knightmare (PGC Jam 4)", "name_original": "Alien Knightmare (PGC Jam 4)", "description": "<p>Crush aliens with boxes to win - but beware, objects in the same dimensional rift (i.e. objects with the same color) can't interact! Defend the castle, and the world, from the interdimensional threat.<br/></p>\r\nControls\r\n<ul><li>[WASD] or Arrow Keys to Move</li><li>[Z] to Undo</li><li>[R] to Reset</li><li>[M] to toggle Music</li><li>[C] to toggle colorblind friendly colors (on by default)<br/>\n</li><li>Move towards a blocked cell to skip turn (there's no dedicated key for this)</li></ul>\r\nInfo\r\n<p>This was made in a little over a week for Pygame Community Summer Jam 2022, where the theme was \"Dimensions\". I wanted to give the brand new pygame-wasm tech a try - that's how this is able to run in the browser (yes, it's really python and pygame running here)!</p>\n<p>Another cool thing is that the sounds, music, and story text were generated using automated tools, not made by hand. In particular, the story was made by feeding numerous prompts into OpenAI's text playground and snipping out pieces of its output. (So if it seems a little incoherent... that's why).</p>\n<p>I tried to make the colors colorblind-friendly (using a special palette). Please let me know if you have issues though.<br/></p>\r\nCredits\r\n<ul><li>Made by Ghast</li><li>Sounds generated using sfxr</li><li>Song generated by cgMusc (site)</li><li>Story text generated using OpenAI (by feeding it many prompts and selecting, arranging, and editing the outputs)</li><li>Font is \"Alagard\" by Hewett Tsoi</li><li>Made with pygame and pygame-wasm (for the web export)</li></ul>\r\nSource\r\n<p>Source code can be found here.<br/></p>", "metacritic": null, "released": "2022-07-13", "tba": false, "updated": "2022-07-15T10:33:46", "background_image": "https://media.rawg.io/media/screenshots/87f/87f32ad55679dbe09e45b5443df37367.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Ghast"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}