{"id": 81729, "slug": "iscopa", "name": "iScopa", "name_original": "iScopa", "description": "\"Scopa\" is one of the most famous traditional Italian card games. It has been played for centuries, and there must be a reason for that! ;)<br/>Try it. You'll easily learn how to play and you will not stop anymore.<br/><br/>\"...iScopa : the HighTech meets the tradition of the Italian playing card games...\"<br/><br/><br/>FEATURES:<br/> - play with other players over the Internet<br/> - play against your Device<br/> - play with a friend on your Device<br/> - play with a friend over bluetooth<br/> - play with a friend over a local wireless network<br/><br/> - full custom and optional rules covering almost all the scopa variations: scope, cards, golden cards, sette-bello, re-bello, prime, napula, berola, maratona, napoleone, asso piglia tutto, scopa d'assi, sbarazzino, declarations (cucite/accuse)<br/> - score: 11, 21, 31, 41, 51, and loosing mode (loose to win!)<br/><br/> - 15 high definition italian regional traditional card sets MODIANO s.r.l. (including poker decks)<br/> - Portrait and Landscape screen mode (incl. auto-rotation)<br/> - interchangeable backgrounds<br/> - play cards by tapping or drag&amp;drop<br/> - show last played cards for both players<br/><br/> - statistics (integrated with GameCenter)<br/> - achievements (integrated with GameCenter)<br/> - game save/restore<br/><br/> - original music by Italian artist Luca Francioso (www.lucafrancioso.com)<br/><br/>***<br/><br/>Contact:<br/>info@doclouisjones.com", "metacritic": null, "released": "2008-12-03", "tba": false, "updated": "2019-07-30T07:34:36", "background_image": "https://media.rawg.io/media/screenshots/d5b/d5b64772ad42b5160abc99412c2f23d5_SyHcvPz.jpg", "website": "https://www.doclouisjones.com/website/index.php?#iScopa", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["doclouisjones.com"], "genres": ["Board Games", "Card"], "publishers": ["Luigi Castiglione"], "esrb_rating": null}