{"id": 817344, "slug": "triple-cards", "name": "Triple Cards", "name_original": "Triple Cards", "description": "<p>Triple Card is a 3 player card game relying mainly on the concept of coalition.<br/>For now it is only a prototype for testing, playable as 3 in the same desktop. <br/><br/>The rules:<br/>-The game is played in two rounds.<br/>-A rounds finishes when one of the three players get killed.<br/>-You have to play one card at each round, no more no less.<br/>-You can play any card on anyone (including you).<br/>-The cards are self explanatory (in the description) But it is important to point out that when you play an Attack card, you gain another one with the value of damage you dealt. (if for example a player has 2 pv and your attack card deals 5, by killing it you regain an attack card of 2).<br/>-You throw two card in the beginning of each round. <br/>-You regain all your cards in the beginning of the second round but you keep your attack card (for example if you farmed it to 6, you will begin the second round with an attack card of 6).<br/>-To win you have two options:<br/>          -Be the one who's killed in the two rounds.<br/>          -Survive the two rounds but the first rule have priority. <br/>for example if your are player A playing vs B and C, you can win in all this scenarios:<br/>-A dies first round, A dies second round.<br/>-B dies first round, C dies second round.<br/>-C dies first round, B dies second round.<br/><br/><br/></p>", "metacritic": null, "released": "2022-07-12", "tba": false, "updated": "2022-07-15T12:26:56", "background_image": "https://media.rawg.io/media/screenshots/893/8939a685040f05ba69d440780c1c11cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tony Patrakolos"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}