{"id": 817442, "slug": "hands-of-necromancy-itch", "name": "Hands of Necromancy (itch)", "name_original": "Hands of Necromancy (itch)", "description": "<p>Free Demo: https://frechou-games.itch.io/hands-of-necromancy-demo</p>\n<p>You are a Necromancer: a lone sorcerer who seeks to grow ever more powerful and learn new forms of dark magic. You search for challengers to fight, so you can hone your wicked craft. You destroy many monsters and wild creatures, yet none of them seem truly worth the fight...</p>\n<p>However, one day, suddenly more creatures entering your world. You know something bad is happening, but maybe this is an opportunity to prove your might and show the world that you are the truly fearsome mage you always knew yourself to be.</p>\n<p>Explore many beautiful environments - a country side, a forest, a cemetery, a castle, an ice cave, a volcano, and more - all teeming with danger to prove yourself against, as their denizens try to destroy you.</p>\n<p>Get weapons, use magic spells, and learn transformations to fight your enemies, using their own abilities against them and bending nature to your own will.</p>\n<p>Use the Tornado Spell to toss your enemies away with wind, or the Ring of Ice to freeze them solid, or even an Unholy Hand Grenade to blow them to smithereens!</p>\n<p>Gain transformations as you grow in power - become the Swamp Serpent who can slither into tight spaces while breathing underwater, or the Stone Breaker Golem that smashes walls into tiny bits, the Hell Burner Demon that safely walks on lava, or even a flying Wyvern!</p>\n<p>All of them are your key to defeating the many creatures in this metroidvania, as you explore the 21 maps in 3 giant and exciting hubs!</p>", "metacritic": null, "released": "2022-06-22", "tba": false, "updated": "2022-07-15T13:13:37", "background_image": "https://media.rawg.io/media/screenshots/846/8466f2f263bd2a9a275d560fc83ca26d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["frechou_games"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}