{"id": 817431, "slug": "red-crusade", "name": "Red Crusade", "name_original": "Red Crusade", "description": "<p>[FR]<br/></p>\n<p>  La Genesis Core est la ressource qui fait fonctionner l'univers.  Elle fourni une énergie considérable malgré la dangerosité de son utilisation. <br/></p>\n<p>  Une planète dont le cœur est composé en grande partie de Genesis Core a été réduite en morceaux, soufflée par son étoile qui a explosé. La ressource soudainement exposée aux convoitises attire toute sorte de personnes avides de richesses, et vous en faites parti ! <br/></p>\n<p>  A bord de votre vaisseau, vous devrez progresser jusqu'à trouver le cœur de cette planète et tenter de survivre aux très nombreux dangers. <br/></p>\n<p>  Jouable à l'aide de votre seule souris, laissez vous porter par ce petit rogue-like riche en ambitions ! Récupérez des améliorations pour votre vaisseau, équipez vous de meilleures armes, affrontez vos ennemis et frayez vous un chemin dans les astéroïdes...</p>\n\n<p>Actuellement disponible : </p>\n<p>- des ressources à récupérer (de la Genesis Core et du Métal, une matière qui permet de réparer son vaisseau)<br/></p>\n<p>- Possibilité de choisir son arme en début de partie parmi les 3 disponibles<br/></p>\n<p>- Des power ups communs et d'autres spécifiques à chaque arme <br/></p>\n<p>- 3 ennemis réguliers + un Vaisseau Minier qui peut devenir hostile dans certaines conditions<br/></p>\n<p>- Une station qui arrive régulièrement et permet de réparer son vaisseau (et d'acheter une mini map !)</p>\n<p>- Un score calculé en fonction de nos actions et de notre niveau<br/></p>\n<p>/////////////////////</p>\n<p>Beaucoup de choses à venir ! (soutenez sur Patreon pour plus d'informations)</p><p>https://www.patreon.com/keyworlds<br/></p><p>Et aussi, le lien du Discord : <br/></p><p>https://discord.gg/D2qAmxTKve<br/></p>\n<p>/////////////////////</p>\n\n<p>Il manque le SoundDesign, l'histoire, il y a quelques bugs... Bref, le jeu est en cours de développement ! <br/></p>\n\n<p>[ENG soon]<br/></p>", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-07-15T13:08:22", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a0a347f2192994f9edb112285c02fa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thibaud.Matras"], "genres": ["Action"], "publishers": [], "esrb_rating": null}