{"id": 81758, "slug": "twist-tac-toads-lite", "name": "Twist Tac Toads Lite", "name_original": "Twist Tac Toads Lite", "description": "You'll need all of your wits to win this clever twist on Tic Tac Toe.  Hopping toads make this simple game a super fun challenge for young and old alike.  Easy to learn and very difficult to master, this is Tic Tac Toe with a few new rules:<br/><br/>* You have to get three in a row 11 times to win<br/>* You place toads, instead of X's or O's<br/>* You can put a toad on top of any other toad<br/>* When a toad is landed on, it hops the direction it's facing<br/><br/>It may sound easy enough, but one toad hopping can start a chain reaction that changes the whole board.  You'll have to think ahead to keep your toads on the board and in line, and get your opponent's toads hopping off into the swamp.<br/><br/>FEATURES:<br/>* FUN!<br/>* Play against a friend or the phone <br/>* 3 difficulty levels: learn how to play before upgrading to the full version of Twist Tac Toads!<br/>* Two different game modes: <br/>    -simple <br/>    -advanced mode where you can rotate your toad before adding it to the board <br/>* Statistics track your win/loss record and progress<br/>* Fun 3D art the whole family will adore<br/>* Realistic sounds of the swamp<br/>* Ad Supported Free Version<br/><br/>Do you enjoy playing Twist Tac Toads Lite for Free?  Please support Three Jacks by reviewing Twist Tac Toads Lite (the more stars the better!).  With your support we can continue to bring top notch titles to the iPhone platform!<br/><br/>And if you really enjoy the Lite version, try upgrading to the full version for hours of Ad Free Fun!", "metacritic": null, "released": "2010-02-10", "tba": false, "updated": "2019-10-22T14:22:29", "background_image": "https://media.rawg.io/media/screenshots/298/29852a698a82a43119e1317240b22aff.jpg", "website": "http://www.threejacks.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Silver Pine Software"], "genres": ["Family"], "publishers": ["Silver Pine Software"], "esrb_rating": "Everyone 10+"}