{"id": 8176, "slug": "planet-wars", "name": "Planet Wars", "name_original": "Planet Wars", "description": "Planet Wars is a top-down alien shooter with unique hand-drawn graphics, exciting action &amp;amp; strategy gameplay and completely customisable weapons!<br/><br/>Simple customisable controls make the game easy to pick up and play.<br/><br/>Play through the 10 mission campaign, with beautifully illustrated graphic novel style story panels. Missions range from offence to defence missions- upon which you can build a base to stop the alien horde.<br/><br/>There is also a survival mode with 6 maps, where you destroy wave after wave of incoming aliens. Compete with local and global (gamecenter) high scores.<br/><br/>Earn in-game money with every battle you fight, or even achievement you earn. You can spend on upgrading your weapons by buying different components. There are 7 different upgradable parts, this means you can completely customise your gun and armour to suit your style of play.<br/><br/>There are over 70 different items and components in the game with which to do this; including 17 core weapons which range from standard rifles to flame-throwers and rocket launchers: Make a fast firing sniper rifle with exploding rounds, or a deadly powerful shotgun with a bayonet for close encounters!<br/><br/>Features:<br/><br/>-Main 10 mission story-driven campaign, narrated by graphic novel style illustrations.<br/><br/>-Over 70 items/components with which to customise your armoury.<br/><br/>-6 Different survival maps with GameCenter high scores.<br/><br/>-27 GameCenter achievements which earn you in-game money.<br/><br/>-A mixture of action and tower defence style gameplay.<br/><br/>View a trailer here: http://vimeo.com/31478498", "metacritic": null, "released": "2011-11-02", "tba": false, "updated": "2019-08-12T05:12:11", "background_image": "https://media.rawg.io/media/screenshots/415/41509cccdec2f83c144eda8f9562a850.jpg", "website": "http://colepowered.com/?page_id=9", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 346, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["ColePowered Games", "Benjamin Car Mat"], "genres": ["Action", "Strategy", "Puzzle"], "publishers": ["ColePowered Games", "Benjamin Car Mat"], "esrb_rating": null}