{"id": 817936, "slug": "dont-make-deals-with-the-devil", "name": "Don't make deals with the Devil.", "name_original": "Don't make deals with the Devil.", "description": "<p>Description:</p>\n<p>This game is a bullet-hell survival game all about sacrifice. Use your health wisely to purchase upgrades while conserving your most important stats. Most importantly, reach the goal to escape the demon.</p>\n<p>Note: Using the exit button on WebGL closes the application, but since it is an html, it will simply look like it is frozen.</p>\n<p>Detailed Instructions:</p>\n<p>Note: There is an in-game tutorial on each first run, which will teach you the basics, this is for people who are still confused after going through the tutorial.</p>\n<p>Controls:</p>\n<p><strong>WASD to move, Mouse button to Select</strong> Upgrades/Click buttons by hovering over the icon which displays the upgrade;/button and clicking. Every weapon in this game is automatically aimed without influence from the mouse.</p>\n<p><strong>Escape</strong> to open/ the pause menu or close another open menu.</p>\n<p>Note: Escape does not work when you are in fullscreen in the WebGL version since itch.io simply makes escape unfullscreen the application. </p>\n<p>Objective:</p>\n<p>Survive as long as possible. There is a goal displayed, but this game has no end since the goal gets exponentially larger whenever you approach it.</p>\n<p>Gameplay:</p>\n<p>You control a person who is stuck in hell after making a deal with a devil. The devil instructs him to survive until his time reaches the number on the goal timer, which always increases out of reach, meaning <strong>there is no end in this game</strong>, you will always fail since you cannot win.</p>\n<p>Over time, waves of enemies will spawn, ever increasing in difficulty. All enemies have health and damage, which they deal when coming in contact with the player, as well as speed. All enemies <strong>move directly to the player</strong>'s current position and will push each other depending on their weight.</p>\n<p>In this game, you have to <strong>survive</strong> the onslaught of enemies buy gaining upgrades whenever you level up. However, <strong>each upgrade costs your character's maximum health</strong> as displayed by the red number next to the heart icon. The more powerful the attack, the more it will cost. If you run out of maximum health you cannot purchase upgrades. However, <strong>you can always access the store to gain more maximum hp by sacrificing other stats.</strong></p>\n<p>The Store:</p>\n<p>In the store, you can <strong>trade damage, speed, and exp gain for maximum health</strong> or vice versa. The value shown is the percentage compared to the default value. The buy and sell value of each stat, compared to health, is also shown. To adjust a value, simply change the indicated value first by either using the plus or minus button or by simply clicking the value and typing in the intended amount. Then<strong> click purchase </strong>to buy the indicated stats, paying/getting a max health difference in accordance. </p>\n<p>Note: Buying back your stats is always more expensive than selling the same amount.</p>\n<p>Note: The store is <strong>always available</strong> while inside the game(except for parts of the tutorial), this means that you can trade stats only just before you purchase an upgrade while the upgrade menu is open.</p>\n<p>Exp:</p>\n<p>Every level, the required exp to level up again increases. To get exp, simply <strong>defeat enemies</strong>, which have a chance to drop an exp amount which corresponds to each enemy based on its difficulty. Whenever you level up, you will be brought into the upgrade menu.</p>\n<p>Upgrade Menu:</p>\n<p>The upgrade menu consists of three options of upgrades to choose from. Each upgrade displays(from top to bottom), its name, an image, the health cost, and lastly a brief description. To choose an upgrade, simply click on on any of the upgrade elements. If you can afford it, the game will continue with the upgrade, if you cannot afford it, the game will show a text reading \"Cannot sacrifice\" and the option will be locked. Under the upgrade menu are three buttons; the center button is a skip button, which fully skips the upgrade. This can, for example, be used when you do not believe that sacrificing stats is worth another upgrade. On the left is a reroll button, for 3 maximum health, you can reroll the shown upgrades. This can be repeated infinitely until you run out of maximum health. On the right is a donate button, which for 2 maximum health, you can get a random stat boost(damage, speed, exp gain), which can then be sold in the shop if one wills so. This button can also be used infinite times or at least until one runs out of maximum health.</p>\n<p>Upgrades:</p>\n<p>Each upgrade has, as stated above, a health cost as well as a certain effect stated in the description. Some upgrades buff previous iterations and some add more weapons. There is also a devil's deal upgrade, which will instantly kill all on screen enemies, but it cost exponentially more health to use, and has further stages. Other upgrades, upon unlocking them, unlock a further upgrade within the upgrade path. Each path is 5 upgrades long with the last upgrade being an ultimate upgrade which is much more expensive than the other upgrades, but also much stronger.<br/></p>\n<p>Options menu:</p>\n<p>To open the options menu, click the button labeled options in either the main menu or the pause menu.. Within the options menu, you can adjust the global volume, music volume, and SFX(sound effect) volume as well as toggle fullscreen(<strong>does not work on WebGL</strong>, please use the external button), and resolution. Please note that the resolution does not affect the User Interface(menu's, exp bar, etc), which should move according to the screen itself. </p>\n<p>Note: <strong>T</strong><strong>o exit most menus</strong>, simply use the escape key, or click the button which opened it to close it again, or click outside of the menu(doesn't work for certain menus).</p>\n<p><strong>Credits:<br/></strong></p>\n<p>-Henry_Hamster(Li-huan[Henry] Shen) Programming the game using the Unity Engine, SFX, Dialogue</p>\n<p>-Matth_ew12zz(Sau Chi[Matthew]Wong) Art and all sprites within the game, thumbnail</p>\n<p>-Music soundtrack from Bensound.com.</p>", "metacritic": null, "released": "2022-07-11", "tba": false, "updated": "2022-07-15T17:03:25", "background_image": "https://media.rawg.io/media/screenshots/21b/21b0f5f22574c1010a22ddbd86b0e907.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Henry_Hamster", "Matth_ew12zz"], "genres": ["Shooter", "Strategy"], "publishers": [], "esrb_rating": null}