{"id": 817971, "slug": "blender-software", "name": "Blender (Software)", "name_original": "Blender (Software)", "description": "<p>&#39;Blender&#39; is a free 3D modelling and animation software available for PC on Steam and the official website. It began its development during 1994, although didn&#39;t see open doors until October 13th, 2012. The program was developed and published by Blender Foundation, which encouraged the use of its program&#39;s tools for depicting illustrations, 3D models, conceptual art, animation, and much more.</p>\n<h2>Official Description</h2>\n<p>Blender is a free and open source 3D creation suite. It supports the entirety of the 3D pipeline—modeling, rigging, animation, simulation, rendering, compositing and motion tracking, and video editing. Advanced users employ Blender’s API for Python scripting to customize the application and write specialized tools; often these are included in Blender’s future releases. Blender is well suited to individuals and small studios who benefit from its unified pipeline and responsive development process. Examples from many Blender-based projects are available in the showcase.</p>\n<p>Blender is cross-platform and runs equally well on Linux, Windows and Macintosh computers. Its interface uses OpenGL to provide a consistent experience. To confirm specific compatibility, the list of supported platforms indicates those regularly tested by the development team.</p>\n<p>As a community-driven project under the GNU General Public License (GPL), the public is empowered to make small and large changes to the code base, which leads to new features, responsive bug fixes, and better usability. Blender has no price tag, but you can invest, participate, and help to advance a powerful collaborative tool: Blender is your own 3D software.</p>", "metacritic": null, "released": "2012-10-13", "tba": false, "updated": "2022-07-15T20:31:47", "background_image": "https://media.rawg.io/media/screenshots/0ab/0ab4aad601875dcc68855bfc00f266c0.jpg", "website": "https://www.blender.org", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 298, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blender Foundation"], "genres": ["Casual"], "publishers": ["Blender Foundation"], "esrb_rating": "Everyone"}