{"id": 817941, "slug": "ball-tag", "name": "Ball Tag", "name_original": "Ball Tag", "description": "<p>Score goals and don't get tagged out!</p>\r\nHow to play / Cách chơi\r\n<p>You swap turns playing offense and defense. Whoever has the most goals out of 5 rounds wins. If the goals are the same you'll have to play a maze penalty match.<br/>Bạn hoán đổi lượt chơi tấn công và phòng thủ. Ai ghi được nhiều bàn thắng nhất trong 5 hiệp sẽ thắng. Nếu các mục tiêu giống nhau, bạn sẽ phải chơi một trận đấu hình phạt trong mê cung.</p>\r\nOffense\r\n<p>The objective is to put the ball into the defending team's goal.<br/>Mục tiêu là đưa banh vào khung thành của đội phòng thủ.</p>\n<p>Click on a spot on your field to spawn a player. If your team is not in possession of the ball then player will go after and pick up the ball.<br/>ẤN vào một điểm trên sân của bạn để tạo ra một cầu thủ. Nếu đội của bạn chưa có banh thì người chơi sẽ đi lấy banh.</p>\n<p>Once you have possession the attacking player will head straight towards the goal.<br/>Khi đội bạn đã có banh thì cầu thủ tấn công sẽ tiến thẳng về phía khung thành.</p>\n<p>If the player gets tagged out then he will pass the ball to the nearest team member who will then start attacking.<br/>Nếu cầu thủ bị bắt dính thì anh ta sẽ chuyền banh cho thành viên gần nhất, người đó sẽ bắt đầu tấn công.</p>\n<p>If there are no team member's left then you will lose the round.<br/>Nếu không còn thành viên nào trong nhóm thì bạn sẽ bị thua vòng.</p>\n<p>If you manage to put the ball into the goal then you will win the round.<br/>Nếu bạn quản lý để đưa banh vào mục tiêu thì bạn sẽ giành chiến thắng trong vòng.</p>\r\nDefense\r\n<p>The objective is to prevent the opponent from getting a ball into your goal.<br/>Mục tiêu là ngăn cản đối phương đưa banh vào khung thành của bạn.</p>\n<p>Click on a spot on your field to spawn a player. The player will immediately start defending and scanning for nearby attacking opponent players.<br/>Bấm vào một điểm trên sân của bạn để tạo ra một thằng phòng thủ. Người ấy sẽ ngay lập tức bắt đầu phòng thủ và tìm kiếm những kẻ tấn đối thủ đang tấn công gần đó.</p>\n<p>If an attacker is detected the defender will run towards the attacker and tag him out. Once he is tagged out he will return to his original spawn point and  be deactivated for a short period. <br/>Nếu một kẻ tấn công bị phát hiện, người phòng thủ sẽ chạy về phía kẻ tấn công và tag hắn ra. Sau khi được gắn thẻ, anh ta sẽ trở lại điểm xuất hiện ban đầu và bị vô hiệu hóa trong một thời gian ngắn.</p>\n<p>Once the period is over he will start defending and scanning again.<br/>Sau khi hết thời gian, anh ta sẽ bắt đầu phòng thủ và quét lại.</p>\r\nDraw\r\n<p>If the time runs out before a goal is scored then it will be a draw.<br/>Nếu hết thời gian trước khi bàn thắng được ghi thì đó sẽ là một trận hòa.</p>\r\nPenalty Round\r\n<p>If both opponents score the same amount of wins then you'll have to play a penalty round. In the penalty round, a maze will be generated on the field. The ball will be released at a random place on the map. A single team member shall be spawned near your goal. If that team member can make his way to the ball and to the opponent's goal in time then you will win the match, otherwise you'll lose the match.<br/>Nếu cả hai đối thủ ghi được số trận thắng bằng nhau thì bạn sẽ phải thi đấu vòng luân lưu. Trong vòng phạt đền, một mê cung sẽ được tạo ra trên sân. Trái banh sẽ được thả ở một vị trí ngẫu nhiên trên bản đồ. Một thành viên trong nhóm sẽ được tạo ra gần mục tiêu của bạn. Nếu thành viên của đội đó có thể tìm đường đến banh và đến khung thành đối phương kịp thời thì bạn sẽ thắng trận đấu, ngược lại bạn sẽ thua trận đấu.</p>\n<p>Thanks for playing and post your score down below.<br/>Cảm ơn bạn đã chơi và comment điểm của bạn xuống bên dưới nhé :)</p>\n<p>Cháu xin nhé XD</p>\n<p>Music from Zapslat.com</p>", "metacritic": null, "released": "2022-07-11", "tba": false, "updated": "2022-07-15T17:05:00", "background_image": "https://media.rawg.io/media/screenshots/619/61996758d827820e8cdb9e61122c92ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RLst"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}