{"id": 818069, "slug": "knight-princess-eris", "name": "Knight Princess Eris", "name_original": "Knight Princess Eris", "description": "<p>“Knight Princess Eris&quot; is an action game with over 800 pieces of pixel art, a classic retro and smooth pixel art animation.WorldThe kingdom &quot;Gilthania&quot; was destroyed by the invasion of the demon tribe.<br />\nMen were killed and women were made to be comforted...<br />\nThe pursuers are closing in on the exiled princess knight &quot;Eris,&quot; who has escaped alone.<br />\nNow, Eris&#39;s journey of revenge begins...Game Features・Easy to operate!<br />\n・Armor gets destroyed as you take damage!<br />\n・The voiced and smooth pixel art animation adult scenes are of high quality!<br />\n(All voices are Japanese)Game System・Eris has 3 points of HP, and each time her HP decreases, her armor is destroyed: armor, half-naked, and fully naked.<br />\nIf you die, you can recover immediately on the spot.<br />\n(You can also recover at the place where you moved to.)<br />\n・Attacks are powered up with items available during the stage.<br />\nNo detailed manipulation is required. When the attack button is pressed, the item is activated at the same time as the attack.<br />\n(The item is activated only when the attack button is pressed with no directional key input.)<br />\n(&quot;Fireball&quot; and &quot;Bom&quot; are also activated by crouching attacks.)<br />\n・Stepping on the &quot;H button&quot; during a stage will &quot;disable&quot; all female mob enemies.<br />\n(Does not work on mid-boss enemies and non-female enemies)<br />\n・As you clear the stages, adult scenes will open up.<br />\nYou can enjoy various adult scenes, including maniac scenes.<br />\nAdult scenes are fully voiced and fully animated.<br />\n・There are several unique monsters in the game.<br />\nYou can choose to &quot;continue&quot; indefinitely, so the game is not difficult.</p>", "metacritic": null, "released": "2022-07-15", "tba": false, "updated": "2023-12-08T21:34:40", "background_image": "https://media.rawg.io/media/games/af8/af8af8cd2c90f91257f3788625c64a7f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["WILD FLOWER"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["WILD FLOWER"], "esrb_rating": null}