{"id": 818067, "slug": "dial-in", "name": "Dial-In", "name_original": "Dial-In", "description": "<h3>Help Bud-D escape from their confusing circumstances</h3>Trapped in your TV, Bud-D is only looking for a way out! However, they don’t seem to be the only resident of this old device. Help them out by guiding them through a maze of corrupting static, decimating lasers, and coincidental crushing!<br/><br/>Dial-In is a modern take on the classic 2D platformer formula, blending well known mechanics like decaying platforms, pushable blocks, and moving platforms with a unique channel switching mechanic that’s easy to learn but difficult to master.<h3>Game Features</h3><ul><li>Classic platformer mechanics, updated for a modern experience.<br/></li><li>Total control over movement. You chose which way you go and how fast.<br/></li><li>Unique core gameplay mechanic. Put all you know about platformers to the test when integrating it with the channel swapping mechanic.<br/></li><li>Over 100 unique stages to experience.<br/></li><li>Special Encore stages that multiply the difficulty of earlier stages.<br/></li><li>3 different worlds with unique music and color schemes.<br/></li><li>Complete Dial-In to unlock the Challenge Run, which pits you through the game once more tracking time, jumps, channel swaps, and deaths in a single uninterrupted run.<br/></li><li>Fully customizable settings, including control rebinding, audio adjustments, and more.<br/></li><li>Accessibility settings for anyone with visual sensitivity including Color blind options and a reduced static setting.<br/></li><li>A set of upbeat tracks with layered compositions.</li></ul><h3>A handcrafted Experience</h3>Each level in Dial-In has undergone heavy play testing and experimenting to find both the most approachable and rewarding combination of mechanics and experiences for each level of play.<br/><br/>Engage your platforming experience by learning the fastest routes and the most consistent options to blitz through the levels at both a relaxed and challenging pace.", "metacritic": null, "released": "2022-07-15", "tba": false, "updated": "2022-07-18T06:10:07", "background_image": "https://media.rawg.io/media/screenshots/ee0/ee089442f04913da012f469e678c9e9b.jpg", "website": "https://www.opalescentgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Opalescent Games"], "genres": ["Casual", "Indie"], "publishers": ["Opalescent Games"], "esrb_rating": null}