{"id": 818076, "slug": "expresslane", "name": "ExpressLane", "name_original": "ExpressLane", "description": "Experience the wondrous world of Expresslane, an expansive 32 player 1st person shooter, in which you and your friends are able to become the ultimate dream team. Work with your allies in order to destroy enemy spawn points while defending yours to the last man. Travel around a massive map filled with randomly selected floating islands, each with their own exclusive biodomes as you island hop your way to victory through the ExpressLanes that connect each island. <br/><br/><strong> Test your skill with up to 32 players! </strong><br/>Enter the arena that is known as The Mystic Islands alone, or with your squad to test your skill. Each match has a procedurally built map, so you'll never know what layout you will get!<br/><br/><br/><br/><strong> Teamwork is Dreamwork </strong><br/>Just because the game is in Alpha phase does not mean you still cannot have the time of your life. Utilize our solo mode in order to check out all our features, or just come to admire the Legendary ExpressDons. Although Expresslane can be played in solo mode, we encourage you to join up with some friends or make new ones. Communicate with your fellow teammates to come up with some exciting battle plans and sneak attacks!<br/><br/><br/><br/><strong> A Day In ExpressLane </strong><br/><br/>Start off your journey as you emerge from your incubators and coordinate with your allies on the center island as you prepare for the fun ahead. When you hear the Horn of T’Cavin in the distance, the adventure begins!  Quickly make your way to the various expresslanes and choose the island you will call home for the rest of the match. Claim the island by dropping your incubator, but make sure its hidden well so your respawn point doesn't get destroyed. Once you're set up, get out there and explore the other islands. Find and defeat other players to get their fagoozle keys so you destroy their incubator. Once an enemy team's incubator is destroyed, you can eliminate them for good.  Keep in mind you must be quick about it, as the ExpressDons value their time! The Mystic Islands explode towards the end of the game, destroying all incubators. At that point, respawning is disabled and the last man standing wins!<br/><br/>", "metacritic": null, "released": "2022-07-16", "tba": false, "updated": "2022-07-18T06:24:30", "background_image": "https://media.rawg.io/media/screenshots/1f2/1f29f92bad504a836fd75e0d348cdb2d.jpg", "website": "https://playexpresslane.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 397, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Twaphouse"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Twaphouse"], "esrb_rating": null}