{"id": 818031, "slug": "punjivr", "name": "PunjiVR", "name_original": "PunjiVR", "description": "<h3>PunjiVR, a hardcore tactical shooter set during the Vietnam War</h3><br/><strong>In PunjiVR, you will assume the role of different soldiers from all sides of the conflict throughout the game's many missions. </strong>Whether you're clearing out a Viet Cong tunnel, sabotaging US fortifications, setting up an ambush, or just taking part in a large battle, there is no shortage of excitement to be had. <br/><br/>Vietnam is a diverse land, with the mountainous Central Highlands, sprawling urban cities, and muggy swamps of the Mekong Delta just to name a few. PunjiVR strives to cover all of these environments and more, offering unique and unforgettable experiences for each.<strong> Experience the Vietnam War like never before.</strong><br/><br/><h3>Gameplay</h3> <br/>PunjiVR aims to create a <strong>challenging and realistic experience</strong>. With death being only a bullet or two away, realistic bullet ballistics and penetration, lifelike AI that fight smart and are deadly, and the occasional trap, a tactical mindset is a must. <br/><br/><ul><li>Nearly everything is physics based, including the full player body, hands, interactables, AI, and more!<br/></li><li>The wide array of firearms were designed to behave realistically while still allowing players unfamiliar with in-depth weapon mechanics to successfully operate them.<br/></li><li>Adjustable difficulty settings, like player health and enemy presence, lets the player match their skill and/or comfort level to gameplay.</li></ul><h3>Tons of Toys, Tools, &amp; Traps!</h3>Sneak in with an smg, lay an ambush with traps and a belt-fed machine gun, or pick them off from a distance with a sniper rifle! <br/><br/><br/><br/><h3>Bullet Ballistics</h3><br/>Just because there's something between you and the muzzle of your opponent's rifle doesn't mean you're safe! <strong>Bullets can penetrate objects and are dependent on the diameter, weight, and speed of the bullet as well as the angle on impact and material of the object.</strong> Not only do<strong> bullets pierce materials, they can also ricochet, drop over time and distance, and spread after impact</strong>.  Just because the small handgun caliber was stopped by your cover doesn't mean the next rifle round will be! <br/><br/><br/><br/><strong><h3>Join the Community!</h3></strong><br/><br/>https://twitter.com/PunjiVr<br/><br/>https://discord.gg/U4W5Wm529S<br/><br/>https://www.reddit.com/r/PunjiVR/<br/><br/>---<h3>There is no teleportation as a comfort option due to the way each level and gameplay as a whole was designed.</h3>", "metacritic": null, "released": "2022-07-15", "tba": false, "updated": "2022-07-18T05:24:03", "background_image": "https://media.rawg.io/media/screenshots/690/690774329d5b4a91e2da281ea0e902e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Camden Cleveland"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Camden Cleveland"], "esrb_rating": null}