{"id": 818084, "slug": "warlordocracy", "name": "Warlordocracy", "name_original": "Warlordocracy", "description": "Why Get Early Access:<br/>\n<br/>\r\n-Complete Chapter 1<br/>\r\n-Ability to import your entire party, inventory, and reputations into Chapter 2 once it's finished (so keep your save file)<br/>\r\n-Fully-functional world editor, so you can modify the story, or design your own complete stories or challenge maps right now.<br/>\r\n-Half price ($4.99), which will double to $9.99 when the final version of Chapter 1 is released<br/>\n<br/>\n<br/>\r\nWarlordocracy Features:<br/>\n<br/>\r\nChoose from 6 starting classes, including the Sellsword, the Ruffian, the Ranger, the Thief, the Merchant, and the Scholar. Upgrade your 5 stats to unlock a variety of abilities, including combat moves, crafting, social skills, and eventually magic. Brew poisons, fire bombs, set traps, and command your party to victory.<br/>\n<br/>\r\nThere are seven major warlords vying for control of the former Viridi Republic. It is your prerogative to choose which one to support. Gain reputations and respect from the various factions, and attack or rob anyone you want at any time. Total freedom of action.<br/>\n<br/>\r\nThere is also a fully-functional world editor and scripting language (WSL, Warlord Scripting Language), so you can make your own stories. You can even allow the player to import his entire party, inventory, and reputations from another story. Play in full real-time, or use the space bar to pause and play with a more strategic style.", "metacritic": null, "released": "2022-07-16", "tba": false, "updated": "2022-07-18T06:36:15", "background_image": "https://media.rawg.io/media/screenshots/dd4/dd450ba86f6016e043fc0f9f4f67bc39.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Laughing Coyote Software", "Brian Lancaster"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Brian Lancaster", "Laughing Coyote Software"], "esrb_rating": null}