{"id": 818083, "slug": "tribble-troubles", "name": "Tribble Troubles", "name_original": "Tribble Troubles", "description": "<h3>A Tribble in Trouble</h3>It's tough being a Tribble! You get caught on a ship doing what a Tribble does… eating all of their Quadrotriticale. And the Captain, in a fit of rage, beams you into the center of a nearby planet whose molten lava core is rising! It’s up to you to jump, climb and squish your way to safety as you face off against countless obstacles and treacherous enemies.<h3>The Underground</h3>Watch out for streams and pools of red hot lava! But also keep your eye out for Glommers that are ready to pounce on you whenever you get near.<br/><h3>The Canyon</h3>Climb your way out of the underground and you reach the canyon. Now you'll go up against ferocious sandworms with spikes! The only time you can attack them is when they're turning. But be quick!<br/><h3>The Jungle</h3>Next, you'll reach the jungle. Things get tougher as you'll have to watch out for poisonous vines, sharp toothed plant traps and alien apes that love nothing more than chasing and squishing Tribbles! The only way to stop an ape is to land on him when he's briefly trapped in the toothy plant trap!<br/><h3>The Spaceship</h3>Clear the jungle and you'll be accidentally beamed back up to the ship that you started on. There you'll find a crew that's completely ready to greet you... with deadly phaser blasts!<br/><h3>Gameplay Modes</h3><ul><li>Casual mode - For people that might be Tribble fans but aren't hardcore gamers. Or just casual gamers in general, this mode is for you.</li></ul><ul><li>Arcade mode - Fewer resources and harder challenges mean that you'll be put to the test as you guide your Tribble trough this mode.</li></ul><ul><li>Speedrun mode - A mode for the ultimate gamer! Here, you can prove that you are truly the best of the best. A fixed level selection ensures that all gamers will play on a level playing field. Perfect for game streamers and speed runners alike. </li></ul><h3>Gameplay Features</h3><ul><li>Collect cans of Quadrotriticale to replenish your health. </li></ul><ul><li>Collect gems which you can use to stock up on powerups</li></ul><ul><li>Shield power ups - Briefly protect you from traps and enemies.</li></ul><ul><li>Sonic attacks - Knock out pesky enemies with this weapon.</li></ul><ul><li>Sixteen levels - Battle through all sixteen levels across all four environments.</li></ul><h3>Gameplay Development</h3>\"Tribble Troubles\" was developed with creative collaboration from:<br/><ul><li>David Gerrold (\"The Trouble with Tribbles,\" \"More Tribbles, More Troubles\")</li></ul><ul><li>Doug Drexler (\"Star Trek: Deep Space Nine,\" \"Star Trek: Generations,\" \"Star Trek: First Contact,\" \"Star Trek: Insurrection,\" \"Star Trek: Enterprise\")</li></ul><h3>Comments from Nightdive Studio's Independent Game Expose with Sir Larr</h3><ul><li>\"my dream\"<br/><ul><li>\"hahahaha. this is so stupidly cool\"<br/><ul><li>\"quick where's the preorder link\"<br/><ul><li>\"Very Cute!\"<br/><ul><li>\"VIDEO GAMES ARE CANCELLED AFTER TRIBBLE TROUBLES LAUNCH.\"<br/><ul><li>\"that is amazing\"<br/><ul><li>\"Easy wishlist this is adorable\"<br/><ul><li>\"This tribble game is incredibly well done, that's a sentence I never thought I'd say. Gonna check this out with my kids\"</li></ul></li></ul></li></ul></li></ul></li></ul></li></ul></li></ul></li></ul>", "metacritic": null, "released": "2022-07-16", "tba": false, "updated": "2022-07-18T06:34:29", "background_image": "https://media.rawg.io/media/screenshots/308/30821340ad52d02f92908c124e2b7177.jpg", "website": "http://www.tribbletroubles.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Scary Robot Productions", "Tribble Toys"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Tribble Games"], "esrb_rating": null}