{"id": 81816, "slug": "fuchstreff-doppelkopf", "name": "Fuchstreff Doppelkopf", "name_original": "Fuchstreff Doppelkopf", "description": "Endlich gibt es das beliebte Kartenspiel Doppelkopf auch für das iPhone. Mit Fuchstreff online und offline Doppelkopf spielen und die gemütliche Community Fuchstreff immer in der Hosentasche tragen!<br/><br/>Mit Fuchstreff auf dem iPhone kannst Du auch unterwegs Deiner Doko-Leidenschaft nachgehen, denn Fuchstreff bietet Dir:<br/><br/>- Online-Spiel mit 80.000 Mitspielern aus Deutschland und der ganzen Welt. Spielend neue Freunde finden!<br/>- Trainingsmodus mit starkem Computerspieler. Auch offline das eigene Spiel verbessern!<br/><br/>Und dabei ist alles so einfach wie am echten Tisch: Nach der Spielauswahl die Karten anwählen und mit dem Finger in die Mitte des Tisches geschoben. An- und Absagen werden übersichtlich auf dem Tisch dargestellt und die Abrechnung kommt natürlich automatisch. Da man nach jedem Spiel vom Tisch aufstehen kann, ist es bestens geeignet auch für zwischendurch!<br/><br/>Jeder kann spielen wie er es gewohnt ist. Entweder streng nach DDV-Regeln oder mit den Varianten Schweinchen, Armut, Zweite Dulle sticht und ohne Neunen. Um beim Online Spielen einen Tisch mit eigenen Regeln aufmachen zu können, braucht man die Fördermitgliedschaft, im Training oder als Mitspieler kann jeder mit den zusätzlichen Regeln spielen. <br/><br/>Wir wünschen Gut Blatt mit der Fuchstreff-Doppelkopf-App. Viel Spielspaß auf dem iPad gibt es außerdem mit Fuchstreff Doppelkopf HD (jetzt auch in Retina Auflösung)!<br/><br/>Bei Fragen/Problemen und Anregungen gerne an hilfe@fuchstreff.de schreiben oder auch mal bei http://www.fuchstreff.de/hilfe vorbeischauen!", "metacritic": null, "released": "2010-12-22", "tba": false, "updated": "2020-02-10T02:02:20", "background_image": "https://media.rawg.io/media/screenshots/f68/f68cc97c451da05a234679243fb42ae4.jpg", "website": "https://www.fuchstreff.de/doppelkopf-app", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fuchstreff"], "genres": ["Card"], "publishers": ["Fuchstreff"], "esrb_rating": null}