{"id": 81813, "slug": "the-twelve-match-3d-free", "name": "The Twelve - Match 3D FREE!", "name_original": "The Twelve - Match 3D FREE!", "description": "Inspired by the new novel \"The Twelve\", The Twelve - Match 3D FREE! provides a challenge to the puzzle playing explorer with a Mayan theme. The Twelve - Match features unlimited levels with eight different game variations in the full version. Move 512 stones to find matches and unlock special power-ups. Authentic music and imagery will put you into a world of mystery and adventure. <br/><br/>Will you meet the challenge of The Twelve? <br/><br/>In The Twelve - Match 3D FREE! matches of three or more of the same patterned stones can occur in three dimensions as well. Special cubes enhance play with wild-card instant-matches, stone-blasting explosions, locked blocks and clear crystals. <br/><br/>If you get stuck, DON'T PANIC! You can earn bonuses that provide special moves enabling you to advance to expert levels; destroy a stone, change a stone, highlight all matches, swap stones, change any stone to a random normal stone, randomly change the location of every stone in the game, even destroy all stones of a single type. <br/><br/>The Twelve - Match 3D FREE! provides four levels of Timed Classic Stone Matching play.  Stones removed are replaced with new stones. You progress from level to level by scoring a specific number of matches within a given time. <br/><br/>FULL GAME FEATURES:<br/><br/>The full version of The Twelve - Match 3D offers many addictive play options -- from casual to intense. <br/><br/>• Classic: Stones removed are replaced with new stones. You progress from level to level by scoring a specific number of matches. <br/><br/>• Survival: Stones removed are not replaced. You progress from level by level by removing ALL possible matches on the board. <br/><br/>• Un-Timed vs Timed: Create a casual game experience or an incredibly intense one that tests your speed. It's your choice. <br/><br/>• Locked vs Unlocked stones: A challenge for the true pro puzzle player - locked stones appear at higher levels and cannot be moved. <br/><br/>Survival-Timed may just be the most challenging game you have ever played, just getting to the 2nd level will drive you crazy. <br/><br/>The Twelve - Match 3D saves multiple games in progress automatically, records your high score and features three different music selections. It even will allow you to play music from your iPod instead of the game's music. <br/><br/>Be Inspired, Play The Twelve - Match 3D FREE! today.<br/><br/>PlayScreen is committed to your satisfaction.  If you have any  <br/>suggestions or problems, please contact us at help@playscreen.com<br/><br/>We take your comments seriously so don't hesitate to let us know about  your experiences with our games.", "metacritic": null, "released": "2009-09-18", "tba": false, "updated": "2019-10-22T14:22:30", "background_image": "https://media.rawg.io/media/screenshots/72f/72f700c93319cc40366a79288ccee515.jpg", "website": "http://playscreen.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlayScreen"], "genres": ["Family", "Puzzle"], "publishers": ["PlayScreen"], "esrb_rating": "Everyone 10+"}