{"id": 818349, "slug": "kittea-party-2", "name": "Kittea Party 2", "name_original": "Kittea Party 2", "description": "<p>Welcome to <strong>Kittea</strong><strong> Party 2</strong>. A sequel to Kittea Party, a game developed for a previous game jam.<br/></p>\n<p>The goal of this short game is to take care of cats! You are a cat lady who has plenty of very demanding kittens: Look at their stats and see what they need to thrive. Make sure that the litter box is clean, the water and food bowls are always full, and that there's plenty of entertainment for the cats.</p>\n<p><strong>How to play:</strong></p>\n<p>WASD - Move</p>\n<p>Space - Interact with objects (follow the cues on screen to understand what to do)</p>\n<p>(Note: Every midnight, a random gift (or a cat) will appear on top of the kitchen table)</p>\n\n<p>This game was developed for <strong>Game Maker's Toolkit game jam 2022 </strong>with the theme \"Roll of the dice\".</p>\n<p>Unfortunately, we didn't have enough time to finish the entry as we wanted to. The original goal for the theme was that depending on how well you take care of your cats, you would be given randomly selected presents depending on how well you took care of your cats that day, such as new/diverse toys, better quality food, etc. Sadly we couldn't implement this feature, but still had a ton of fun!</p>\n\n<p><strong>Screenshots:</strong></p>\n\n<p><strong>Credits:</strong>\n</p>\n<p>JPiolho - Programming and concept</p>\n<p>SaraFilipa - Art and concept</p>\n<p>Gustavo - Main theme</p>\n<p>A24S.com - Main menu theme</p>\n\n<p>Thanks for playing! We hope you enjoy our small entry!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T09:30:23", "background_image": "https://media.rawg.io/media/screenshots/0a0/0a03b9346e2162ec25a99bb2f8c7b210.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jpiolho"], "genres": [], "publishers": [], "esrb_rating": null}