{"id": 81837, "slug": "shinmatgo-gostop", "name": "ShinMatgo (GoStop)", "name_original": "ShinMatgo (GoStop)", "description": "What is GoStop?<br/>GoStop is like Poker! Played with combination of skills and strategy, and don’t forget, you could always use a little luck on your side. <br/>It is a traditional Korean card game enjoyed by millions and millions of Koreans with their friends or family or simply by yourself online. Currently, it happens to be the most played on-line game in Korea.<br/>It’s a game played with 48 cards called “HWATOO” which has floral prints hence commonly known as the “flower cards”. Similar to poker cards, HWATOO has 12 cards for each of the months out of a year grouped into 4 similar flower cards. <br/>The point is to strategically acquire as many cards as possible from the flop to gain the first 7 points by adding values of your cards which gives you the lead position to “GO” and try to win more or “STOP” to win what’s at stake now.<br/>But why “STOP” at GoStop? The genius developers at JoyMoa decided to get creative and gave the “GOGOGO” to create “ShinMatGo” for the iPhones….<br/><br/>***************************<br/>On one quiet morning, the world found itself robbed of its money! Caesar, the underworld devil himself couldn’t handle his shopaholic wife Cleo’s spending habits, so he stole all the money in the world and disappeared without a trace into the underworld.  The banks, the companies, and the people quickly collapsed and everybody was without money and soon had to hit the streets.<br/><br/>But rest a sure there were people with the kindness of their heart to bring justice to this chaos.  But it was too late. By the time the gang had found Cleo, Caesar was nowhere to be found and she had already spent the world’s money on more shopping. So the gang was left with no choice and had start playing the most popular game in the underworld, “MATGO” and serve the world justice by winning all the money back….<br/><br/>Features:<br/>1. Multiple background theme ? 9 different types<br/>2. Multiple skills and items ? acquire 9 different skills from opponents and obtain items through item-game<br/>3. Multiple game modes ? Wolnam Ppong, Doubling Game, Slot Machine and various mini-games<br/>4. Story mode and Unlimited mode ? win all 13 characters in Story mode and play the Unlimited mode <br/>5. Multiple missions ? Bingo (max. x256), Point (max. x10),  Normal (max. x128) <br/>6. Exciting graphics ? exciting and fun graphics", "metacritic": null, "released": "2009-09-24", "tba": false, "updated": "2019-10-22T14:22:30", "background_image": "https://media.rawg.io/media/screenshots/07a/07ae5c1867f41f606de8dcdb74629b77.jpg", "website": "http://www.joymoa.co.kr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Selvas"], "genres": ["Card"], "publishers": ["Selvas"], "esrb_rating": "Teen"}