{"id": 818408, "slug": "super-dice-turtle-breeding", "name": "Super Dice Turtle Breeding", "name_original": "Super Dice Turtle Breeding", "description": "<p>The newly discovered species of dice turtles are the hottest way of making easy cash! Place cashmaker machines under the turtles to extract cash from their bodies. The turtles also excrete cash every time they breed! Try to make as much money as possible in 3 minutes before the turtles get annoyed with you and leave. <br/></p>\n<p>The dice turtles constantly roll the number on their back and produce more cash with higher numbers. They also only breed with turtles with the same number. Drag the turtles closer to each other to encourage breeding. Dice turtles can only produce a few offspring before dying but we can increase their offspring capacity with upgrades that we can purchase with cash. We can also use cash to buy more dice turtles to introduce to the area and upgrade the turtles to encourage even more mating!</p>\n<p>=========</p>\n<p>Made in pygame. We didn't really have time to make an executable so it's only available for download and to be run in Python 3. The <strong>pygame</strong>, <strong>numpy</strong>, and <strong>names</strong> packages are required for the game to run as well.<br/></p>\n<p>=========</p>\n<p>SFX from https://www.myinstants.com/ and https://freesound.org<br/>Background Music by 5qwerty</p>\n<p>Background tiles from Clear Code's Zelda Tutorial: https://github.com/clear-code-projects/Zelda<br/>All other sprites by 5qwerty<br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T10:07:54", "background_image": "https://media.rawg.io/media/screenshots/537/53753f23314077cbc75cbad372c2afa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["5qwerty", "seanlazaro"], "genres": [], "publishers": [], "esrb_rating": null}