{"id": 818524, "slug": "dice-arena-lucky-roll", "name": "Dice Arena: Lucky Roll", "name_original": "Dice Arena: Lucky Roll", "description": "<p>You are a knight in shining armor whose fate is decided by a rolling die.</p>\n<p>You fight monsters and creatures in a battle arena type game. Fight your way through thousands if not hundreds of rounds murdering innocent dark fiends.</p>\n<p>After a succesful day on the battle field, you will return to the shop for your reward - a rolling die. You will unlock weapons and upgrades to take with you into the next round.</p>\n<p>Will you survive and save the princess?</p>\n<p><strong>How to play:</strong></p>\n<p>The first scene you encounter is the shop. Here you can roll for an item, equip it and advance to the arena where you will fight for survival. You equip a weapon by placing it in your hand. You cannot advance with no weapons.</p>\n<p>In the arena, the only input you have is moving your character with WASD. The knight will shoot automatically based on the equipped weapons.</p>\n<p>When you have succesfully survived an arena, you return to the shop. You can now roll the die once more. If you roll a new weapon it gets placed in your inventory. If you roll the same weapon it will upgrade. However! If you choose to not roll the die and go straight to the arena, the die will be upgraded once you clear the arena and return to the shop. A higher die level means better rewards. You can keep upgrading the die to a total of 4 times if you dare!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T11:01:20", "background_image": "https://media.rawg.io/media/screenshots/894/894a8b4da93bc6943933144a76987c02.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xbobsix1"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}