{"id": 818734, "slug": "roll-with-the-punches", "name": "Roll With The Punches!", "name_original": "Roll With The Punches!", "description": "<p>Not your grandma's card game. Using your trusty dices, the ultimate fighter to knock-out your opponent! </p>\n<p>Roll With The Punches is a 2D card game where you  face a randomly generated AI with a randomly generated Deck. To win you need to be better then your opponent in at least two stats between Strength   , Agility    or Charisma  . <br/></p>\n<p>At each turn, you can craft a card by rolling three dices for the three stats to which it adds the card body's bonus. At this point you can either put it in your board to increase your score, or sacrifice it to kill an opponent's card (to kill another card, your sacrificed card needs to be better than the other one on at least two stats).<br/>It is also possible to merge the card to one of the cards in your board (but there was a small bug that made us remove this possibility just before submitting, we will update this page with the working version after the ranking phase).</p>\n\n<p>Finally there is some special cards that are generated randomly with special effects:<br/></p>\n<p>-  : Unlucky, grants an unlucky state for your opponent(your opponent will be half as lucky). [can't be merged]<br/></p>\n<p>- : Lucky, grants you a lucky state (you'll be twice as lucky!). [can't be merged]<br/></p>\n<p>- : Untargetable, your card will be untargetable by the other cards. <br/></p>\n<p>- :  Draw, make you draw a card.<br/>Good luck in the ring!<br/></p>\n\n<p>Music Credits: \"Ready Aim Fire\" Kevin MacLeod (incompetech.com) Licensed under Creative Commons: By Attribution 4.0 License<br/></p>\n<p>PS: The windows version is more beautiful and more stable!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T12:36:45", "background_image": "https://media.rawg.io/media/screenshots/b3a/b3aac446be0d7e85775f18b7bcc3488c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tony Patrakolos", "immad", "spencerchamp"], "genres": [], "publishers": [], "esrb_rating": null}