{"id": 818740, "slug": "dnducks-gmtk-2022", "name": "DnDucks - GMTK 2022", "name_original": "DnDucks - GMTK 2022", "description": "Make your way through this quirky dungeon, slay your enemies and come out victorious!\r\n<p>A game made for the GMTK 2022 Game Jam!</p>\n\r\nControls:\r\nWASD - to move\r\nSPACE - to roll your dice\r\nLeft Mouse Button - to select\r\nQ - to quack\r\n(If you end up stuck after combat, press R to continue - it's a bug that we didn't have time to solve sadly)\r\n\r\nHow To Play:\r\n<p>This little project is a wave based survival game. Upgrade your stats and fight your enemies before they outnumber and defeat you! </p>\n<p>For all your basic actions you have specific dice. There are 4 in total, being:</p>\n<p>SPEED / ATTACK / DEFENSE / HEALING</p>\n<p>At the start of each round you roll your \"SPEED die\", which determines the amount of tiles you can move. You can run around the dungeon and collect items to temporarily boost your stats. </p>\n<p>If you and an enemy collide, you have to fight them! The attacker rolls for the damage with their \"ATTACK die\", while the defender rolls for their shield with their \"DEFENSE die\". The damage is then subtracted from the shield and the remaining amount will then be dealt as final damage. Afterwards you and your enemy will take turns and fight do the death, until one of you finally dies. (rip)</p>\n<p>After a certain amount of rounds, a new wave will come, spawning both: new items and enemies. With each new wave, you will also level up! Now you can choose which of your stats you want to upgrade permanently!</p>\n<p>We didn't manage to implement and balance everything as planned, BUT we will continue to edit and improve this game in the future!</p>\r\nPLEASE NOTE:\r\nwe reccommend playing on map 2 since you have quite a bunch more health!\r\n<p>sadly we did not get to fix all bugs before the deadline. You might end up stuck after combat for example (in that case press R to continue). Also enemies might have bugged behavior, or the dice upgrade UI/mechanic will not function as intended. Also the mentioned items do not spawn for now. We hope that you have a few minutes of fun anyways! </p>\n\n\r\nCredits:\r\nJustin \"Kabura\" Neumann - Game Design / Game Art\r\nMarc Wandrei - Game Design / Game Programming\r\n\r\nSoundtrack: Funny Bit - by David Renda\r\n2D Navmesh provided by - h8man", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T12:39:04", "background_image": "https://media.rawg.io/media/screenshots/38c/38cfb686c847c6e77af186b96b388469.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Kabura", "Morc"], "genres": [], "publishers": [], "esrb_rating": null}