{"id": 818821, "slug": "dice-defense", "name": "Dice Defense", "name_original": "Dice Defense", "description": "<p>Hi. You target in this game is to survive as long as possible. Initally you have 3 lives. Every time enemy enters square with player, you lose one life. Board is a 15x15 table. You are located in the center.\r\n </p>\n<p>\n</p>\n<p>You are a dice with six faces. Every face has a number from 1 to 6 on it. You can see it’s sides in the lower part of right menu.\r\n </p>\n<p>\n</p>\n<p>Every turn consists of 6 stages:\r\n </p>\n<p>\n</p>\n<p>1. Up to 3 new enemies spawn on random squares of first or last row or column. Every names has it’s type, a number from 1 to 6.\r\n </p>\n<p>\n</p>\n<p>2. It’s your move. First you can buy any defense structures(their description will be in game). If you press TAB you will see cells where you can place them colored in yellow.  Let number on the upper face of you dice be TYPE. Then, you can roll your dice one time in one of four directions. Use WASD.</p>\n<p>\n</p>\n<p>3. Every enemy of the type TYPE moves one cell in the same direction as was your dice roll.\r\n </p>\n<p>\n</p>\n<p>4. All your turrets shoot. If any enemy moves into turret it get’s destoyed.\r\n </p>\n<p>\n</p>\n<p>5. Let number on the upper face of you dice be NEWTYPE. Also let RANDTYPE be random type not equal to NEWTYPE. All enemies of type NEWTYPE and RANDTYPE move one cell closer to center. You can see it for every cell by pressing TAB.\r\n </p>\n<p>\n</p>\n<p>6. End of turn. You receive +1 to your score and money.\r\n </p>\n<p>\n</p>\n<p>When enemy moves into another enemy or outside of board it gets destroyed.\r\n </p>\n<p>\n</p>\n<p>You can press ESC to pause.</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T13:20:14", "background_image": "https://media.rawg.io/media/screenshots/cc9/cc9be7541cab6605c2156657d9ce1695.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["timreizin", "alpha_kotenok"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}