{"id": 818858, "slug": "dice-mice-markw250", "name": "Dice Mice (MarkW250)", "name_original": "Dice Mice (MarkW250)", "description": "Welcome to Dice Mice!\r\n<p>Try your luck by rolling dice at the unfriendly mice. Maybe you will damage them? Maybe you will heal them? Who knows...</p>\n<p>This game was a submission for the GMTK 2022 Game Jam with the theme \"Roll of the Dice\"</p>\r\nHow To Play\r\nAttacking\r\n<p>Click to throw a dice. If the dice hits an enemy, the effect on that enemy depends on the face of the dice that hits him. </p>\r\nDice on the Floor\r\n<p>After hitting an enemy (and if it hits no enemy) the dice will land on the floor and become available for you or an enemy to trigger it again. The effect of this dice depends on the face of the dice facing up.</p>\n<p>If you walk over the dice, the effect happens to you. Be careful! This effect can hurt you so pay attention to the picture on the dice!</p>\n<p>If enemies walk over the dice, the effect happens to them. Lure the enemies onto the dice that will damage them, but not the ones that will heal them!</p>\r\nDice Effects\r\n<p> Deals damage to a single enemy on hit. Deals damage on pickup.<br/></p>\n<p> Deals medium damage to a single enemy on hit. Deals medium damage on pickup.<br/></p>\r\n Deals high damage to a single enemy on hit. Deals high damage on pickup.<br/>\n<p> Heals a single enemy on hit. Heals on pickup.</p>\n<p> Deals high damage to all enemys in an area. Deals high damage to all enemys in an area on pickup.</p>\n<p> Deals lethal damage to a single enemy on hit. Deals lethal damage on pickup.</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T13:37:19", "background_image": "https://media.rawg.io/media/screenshots/2b8/2b863c477a80aa4924ce0a7f11816e91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["MarkW250"], "genres": [], "publishers": [], "esrb_rating": null}