{"id": 818961, "slug": "the-second-time-aliens-invaded-cairo", "name": "The Second Time Aliens Invaded Cairo", "name_original": "The Second Time Aliens Invaded Cairo", "description": "<p>Reda is just your everyday hard working witty good hearted alien fighting driver who found himself alone tasked with the difficult challenge of saving Cairo from the invading evil eye aliens.  Using his modified flying vehicles and incredible driving skills,  with help from his extraordinary luck, he must fend off the aliens who came back to reclaim the civilization they claim to have built thousands of years ago. To do so, the alien leader uses his people's special magic die that allow him to alter reality with each roll.  But Reda also has a trick up his sleeve; he has his own magic die which he found when he was buying parts for his flying motorcycle. Now he must go head to head in a dice rolling armed battle against the aliens to destroy as many of them as he can before they destroy Cairo and possibly the world.</p>\n\n<p>The Second Time Aliens Invaded Cairo is a shoot 'em up style game with a twist. In addition to the hectic gameplay of traditional shoot 'em up games, this game makes use of strategic luck mechanics. The player can change between three different vehicles can face three different types of enemies. To switch them, they must first acquire dice by defeating enemies and then rolling the dice. Being a game of luck, switching does not necessarily mean that the outcome will be favorable to the player. However, the better a player's performance is, the better his chances are. Meanwhile, the computer opponent also rolls their dice at random times to change things up and keep the game interesting.</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T14:22:29", "background_image": "https://media.rawg.io/media/screenshots/e30/e30f4ead6c4737e3ada206b149595662.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OmarElSayed997", "stevensaad", "ShaderSnake", "G1234567899"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}