{"id": 819045, "slug": "disaster-dice", "name": "Disaster & Dice", "name_original": "Disaster & Dice", "description": "<p>Description: <br/>In Disaster &amp; Dice you play as a Dice mage; a strong magic user that can unleash deadly elemental spells. However their spells must be channeled using magical dice as a catalyst, and the forces of luck may not always roll the way you wish. Explore the endless depths of an enchanted manor and use your dice magic to vanquish the escaped monsters that wander the halls. <br/><br/>Gameplay Overview: <br/>The player is given two types of spells, projectile and AOE. To cast a spell you must first collect two types of dice from the environment, elemental dice and power dice and add them to your dice bag. <br/>Once you have collected your dice you can roll one elemental dice to determine the element of your spell; and up to three power dice to determine the strength of your spell.<br/> <br/>There are four spell elements, each applies a different status effect to enemies when hit: <br/>Ground: Slows enemies <br/>Water: Stuns enemies <br/>Fire: Burns enemies over time <br/>Air: Pushes enemies away<br/> <br/>If an enemy is the same element of your spell (shown by enemy colour), the status effect will not be applied.<br/> <br/>The total sum of your three power dice determines your spell strength, the higher the total power, the stronger the spell. However if your spell power goes over 20 the spell will become unstable and will cause damage to yourself when fired. <br/><br/>Controls: <br/>WASD- Move <br/>Space- Jump <br/>Mouse- Camera <br/>Left Mouse Button (Hold and release)- Fire Projectile Spell <br/>Right Mouse Button- Fire AOE Spell <br/>Q- Roll elemental Dice <br/>E- Roll Power Dice</p>\n<p>Known bugs: <br/>Enemies may not move on first room, but will afterwards.<br/>UI elements might not scale well to aspect ratios other than 16:9<br/></p>\n<p>Alex - Animator/Technical Animator - Rigged and animated the main character, Flying Slime, and Bite Bat.<br/>Eevee - Designer/Technical Designer - So much.<br/>Kaylee - 3D Artist/ Level Designer - Made the environment art and Bite Bat high poly, and Flying Slime. Mapped four levels.<br/>Leah - Character Artist - Made the main character and Bite Bat low poly.<br/>Lottie - Music Composer - Composed the music.<br/>Paul - Designer/Technical Designer - So much.<br/>Sam - Concept/2D Artist - Made the concept art and UI art.</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T14:59:33", "background_image": "https://media.rawg.io/media/screenshots/caf/caf5ad90b7c80389469f1596e33769d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Buttercream Dream"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}