{"id": 819084, "slug": "diced-2", "name": "Dice'd", "name_original": "Dice'd", "description": "<p><strong>[ABOUT]</strong></p><p>Roguelike game about a <strong>dice </strong>that woke up in an unknown dungeon. Fortunately, you are able to bend laws of space by <strong>altering the probability </strong>of events. However be careful when you change everything to your advantage, the debt will pile up and you will be judged for imbalance. What you <strong>take</strong>, you need to give <strong>back</strong>.<br/></p><p><strong>[CONTROLS]</strong></p>\n<p><em>F11 for fullscreen</em></p><p><em>Mouse for control</em></p><p><em>Just click on any button that moves when you hover over it</em></p><p><strong>[TUTORIAL]</strong></p><p><em>Everything in this game is decided by your luck. At the top of the screen you will have a bar with <strong>6 dice rolls</strong> you can choose from. By merging <strong>3 dices </strong>in the bar below you will define your final roll, which will then decide how many options you will have available. The first slot is your base chance.</em></p><p><em>The minimum you can roll will be the base and maximum will be the double of it (ex: base 6: min 6 - max 12). The next slots are modifiers with which you can increase your maximum roll (not the minimum), they add or subtract the double of the number that will be in the slot. However the alteration you make will ultimately create a debt.</em></p><p><em>You need to mind the debt. You can balance your debt by making your chances lower that they need to be. The more you alter your chances to your advantage, the higher chance is that you will get strike. 4 strikes you will die not matter how many lives you have. The goal of this game is to amass gold and levels. All game rooms are randomly chosen from pre-created set.</em></p>\n<p><em><strong>Game developed by Dominik Kaspar. Thank you for your time.</strong></em></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T15:14:45", "background_image": "https://media.rawg.io/media/screenshots/799/79941c759cb8bc07c9fec042d96d0392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["IDEDARY"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}