{"id": 819061, "slug": "dice-game-gmtk2022", "name": "Dice Game (GMTK2022)", "name_original": "Dice Game (GMTK2022)", "description": "<p>Use a colorful assortment of dice to defeat classic board game pieces in a roguelike fashion with upgrades and build paths.<br/></p>\n<p><strong>Instructions:</strong></p>\n<p>use up to 3 dice per turn by dragging them on enemies. Each dice has a specific effect. <strong>Choose wisely! </strong>When dragging dice on an enemy, <strong>all</strong> dice with a lower value will be discarded for this turn.<br/></p>\n<p><strong>Dice effects:</strong></p>\n<ul><li><strong>White</strong>: will attack an enemy x amount of times</li><li><strong>Blue</strong>: will add armor to the player x times armor stat. (use the dice on enemies even though the effect is applied on the player)</li><li><strong>Orange</strong>: will add crit stacks to an enemy, subsequent attack will deal double damage</li><li><strong>Green</strong>: will add life steal stacks to an enemy, subsequent attacks will heal the player</li><li><strong>Yellow</strong>: will add weakness stacks to an enemy, enemy's next attacks will deal half damage</li><li><strong>Purple</strong>: will add poison stacks to an enemy, dealing damage equal to the number of stacks</li></ul>\n<p><strong>Known bugs<br/></strong></p>\n<ul><li>poison stacks don't work</li><li>missing sprites for some enemy upgrades</li></ul>\n<p><strong>Insights from development<br/></strong></p>\n<p>The game is an amalgamation of some common mechanics found in plenty of rogue likes like Slay the spire and Backpack hero mixed with the dice mechanic from the board game [That's pretty clever!]<br/></p>\n<p>Overall developmentwent surprisingly smoothly considering one of us got serious covid during development. The scope of the project was a bit too large to get a completely finished product but all in all it's not so bad. Some of the mechanics were insanely fun and satisfying to implement. This was some of the most fun i've ever had in a gamejam.</p>\n<p>In the beginning we decided to work on different parts of the game to get going faster and it definitely paid off. By the end of the first day we had the dice controls pretty much done and ennemies could be killed by clicking on them to deal damage.</p>\n<p>On the second day we started working on the upgrade screen and the combat action system that handle enemy attacks and status effects. The combat action system took a long time to build but it was incredibly interesting to create. We ended the second day by putting everything together and we had a complete game loop with turn orders for the player/enemies and an upgrade screen in between fights.</p>\n<p>On the third day, time was spent on making a background for the game and adding the completed health bar with status effects and armor indicators. This is also when we implemented all the dice colors (there was only white up to this point). This went pretty smooth as the combat action system and status effects were already implemented.</p>\n<p>What's missing: </p>\n<ul><li>Sound is the biggest one. This is completely due to the scope being too large. We were moving really fast during developmentand things seemed to be going very smoothly but since we had so much stuff to implement to deliver a complete experience we put the sound aside.</li><li>Dice forge: We wanted to allow for certain upgrade to remove specific faces from your dice and stitch them on other dice <em>a la</em> Inscryption. This we just didn't even get to.</li><li>Tutorial: The main mechanic of the game is not immediately intuitive. It would have been nice to have a mini tutorial explaining the basic concepts while in game. It was one of the next items on the list but we didn't get there.</li> </ul>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T15:05:52", "background_image": "https://media.rawg.io/media/screenshots/ecc/ecc612262344a99006f0ccc467134b60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["My_man_Spood"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}