{"id": 819123, "slug": "tauri-latgale-lost-in-the-woods", "name": "Tauri Latgale: Lost In The Woods", "name_original": "Tauri Latgale: Lost In The Woods", "description": "Once upon a time, there was a young red hooded girl called Tauri Latgale.\r\n<p>One day, she was wandering around the woods collecting berries and other sort of remedies, but fate has another plan for her. She was ambushed by multiple fierce creatures trying to devour her, thankfully she brought her bow and arrow with her, allowing her to defeat the creatures in those woods. </p>\r\nWill she be able to make it out alive? Or will she be devoured by the creatures in the night? \r\n<p>Tauri Latgale: Lost In The Woods is an endless RNG turn-based game where you control a dice in order to defeat your enemies. You will play as Tauri Latgale as you try to defeat the countless waves of enemy in your path. Will you depend on your luck or will you try to use your reflex to stop the dice as you see fit? See how long you can survive in this endless turn-based game!</p>\r\n\r\nHOW TO PLAY:\r\nStop the Dice  : Space bar or click the dice<br/>Click &amp; Hover : Mouse\r\nCREDITS\r\n<p>Christopher Fendika Lee - Game Designer and Programmer\r\n</p>\n<p>Ferry - Game 2D Artist\r\n</p>\n<p>Dheanandri - Game 2D Artist<br/></p>\n<p>Lauretta Gail Rosalind Wijaya - Game Sound Artist and UI Designer<br/></p>\n<p>Arkannabil Pratama - Game Sound Artist and Game Designer\r\n</p>\n<p>Christopher Vincent W. - Music Composer and Game Sound Artist  <br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T15:31:16", "background_image": "https://media.rawg.io/media/screenshots/b1a/b1a4f25d63747078402a395fdad67e09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Binus Game Development Club"], "genres": ["Action"], "publishers": [], "esrb_rating": null}