{"id": 819180, "slug": "otherdicely", "name": "Otherdicely", "name_original": "Otherdicely", "description": "<p>After a long day of never-ending work at her home, Celestine finally gets to rest. <em>Ohhohoho, rest? That's not in our vocabulary, young lady</em></p>\n<p>You have been taken to this dreamy realm, and your need to protect this realm by defeating the angelic impostor on this realm.  Fight them with strategy, and buy all u need to survive for the next day. This unknown creature its just way smarter then u think so be careful</p>\n<p>Remember,  they attack harshly so prepare urself on the shop and took enough rest to maintain you health.</p>\n<p><strong>Shop</strong></p>\n<em>Health Potion </em><em>Your generic red-colored potion that tastes like syrup. It just feels weird because you didn't see anything red on the way here. Consuming this item restores a portion of lost health.</em><em>Tool kit</em><em>I</em>\n<em>t's not like I'm a tool <em>baka</em>, but they do sell some at the shop. Increases the maximum gainable shield during combat.</em><em>Shield </em><em>Combat needs defense, especially when you have no idea where you are. However, this heavy-looking shield seems too heavy to carry with one hand. Boosts damage absorption capabilities.</em><em>Special e dice </em><em>A glowing die that looks like a perfectly-crafted diamond you saw in a jewelry store. Your dice seem to always react whenever you come close to it. adds one dice slot.</em><em>Gauntlet </em><em>A thin glove with steel attached to the outer finger. The merchant demonstrates its durability using a knife, and it doesn't seem to rip.\r\nEnables critical hits.</em><em>Clover </em><em>A four-leaf clover. Merchant's favorite and their keepsake.\r\nIncreases the chance for getting higher dice numbers.</em>\n\n<p><strong>Credits</strong><br/>Roger Gilbert Fernandi - Game Designer<br/>Angeline Cecilia - 2D Artist<br/>Kensi Chandrawan - Game Designer &amp; Programmer<br/>Wilson Nathaniel - Game Programmer<br/>Winson Allan Wijaya - Sound Engineer</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T15:57:57", "background_image": "https://media.rawg.io/media/screenshots/7d6/7d6905d5c73287d168234c70c62559eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Binus Game Development Club"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}