{"id": 819171, "slug": "elemental-dice-itch", "name": "Elemental Dice (itch)", "name_original": "Elemental Dice (itch)", "description": "This is a third-person action shooter with elemental magic\r\n\r\nEach round, you have a set of 2 dice\r\n<p> Each dice can be either Fire, Ice, Electric, or Explosion. You could get 2 of the same type. The Explosion type is rarer than the other 2.</p>\r\nYou can shoot the projectiles\r\n<p>You can shoot a ball or a ring of the types that you rolled. If you can chain them correctly, they do more damage.</p>\r\nYou will fight a number of enemies in the level\r\n<p>Each enemy has a different type of magic. They are resistant to the same magic type.</p>\n\r\nGame Design Principles\r\n<p>The idea of having 2 dice rolled before you see the enemy types makes it so that you don't know whether your rolls were good or bad. You must wait until you fight all or most of the enemies to know.</p>\n<p>Essentially, the usefulness of the output randomness when you roll the dice is only determined by the input randomness of the enemies on the map. For example, if you rolled 2 fire types, and most of the enemies are not fire, you actually got lucky with the rolls.</p>\n<p>If you rolled an ice ball and a fire ring, you can't chain your shots very well. Then, if most of the enemies have weaknesses against these types, your roll was still good. You could get lucky with 2 of the same type that chain to create a super boost. Then, your enemies could all be the same type which would mean your roll wasn't that good at all.</p>\n\r\nKnown Bugs\r\n<ol><li>After you click 'Play' from the game and see the 'Welcome' screen, the options button there will break the game. To be clear, the options button should work everywhere else.</li></ol>\n\r\nGeneral Notes\r\n<p>This game was developed by a solo developer during GMTK's 2022 Game Jam. Hope you enjoy it!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T15:53:58", "background_image": "https://media.rawg.io/media/screenshots/13e/13e91849702bdf06c662a231e2003fb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kandax Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}