{"id": 81917, "slug": "erics-freecell-solitaire-pack-hd", "name": "Eric's FreeCell Solitaire Pack HD", "name_original": "Eric's FreeCell Solitaire Pack HD", "description": "If you love solitaire and have an iPad you'll love Eric Snider's FreeCell HD with a fantastic user interface, beautiful graphics and subtle sound effects. Comes with two bonus solitaire games: \"Towers\" and \"Eight Off.\" <br/><br/>Drag, tap, or for the most fun, give cards a shove to send them on their way! <br/><br/>DESCRIPTION <br/><br/>Written by the same Eric that developed the Eric's Solitaire Sample that came on every Mac in the U.S. and Eric's Ultimate Solitaire for Mac OS. You can drag and drop or tap cards to move them. You can even throw the cards with a shove! Supports portrait and landscape orientations and has a fun user interface. <br/><br/>FreeCell is one of the most popular variations of solitaire. It offers lots of room for skill so players don't have to rely on luck as much as in other solitaire variations. This version is strictly for iPad. <br/><br/>Your game is saved when you quit or get a call and is quickly restored when you return. <br/><br/>FEATURES <br/><br/>- Beautiful art, cool particle effects and a fun user-interface <br/>- Even nicer high resolution retina graphics for iPad 3<br/>- Subtle sound effects so you can enjoy your music <br/>- Drag and drop cards or throw them! <br/>- Playable cards wiggle or glow -- turn off for a bigger challenge. The more the cards wiggle the better the move. <br/>- Unlimited Undo <br/>- Portrait and Landscape support <br/>- Game state saved when interrupted <br/>- Detailed Statistics <br/><br/>Follow us on Twitter: http://twitter.com/sniderware", "metacritic": null, "released": "2010-12-10", "tba": false, "updated": "2019-07-30T07:09:52", "background_image": "https://media.rawg.io/media/screenshots/099/099b3b45a164e6d92a60e4751b8fbb1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Eric Snider"], "genres": ["Strategy", "Card"], "publishers": ["Eric Snider"], "esrb_rating": null}