{"id": 819279, "slug": "lord-of-the-dice", "name": "Lord of the Dice", "name_original": "Lord of the Dice", "description": "<p>Team Nunchuck Scorpions </p><p><strong>Lord of the Dice</strong></p><p>Traverse the game board with dice rolls and defeat the bosses to win</p><p>Unique spaces cause you to enter combat, loose HP, gain HP, warp to another tile, upgrade dice (they roll their max value), or have a randomized effect.</p><p>Combat involves pulling dice from your bag and rolling them to deal damage. Eventually you are able to select multiple dice to attack with after defeating enemies. </p>\n<p>This is our interpretation of the \"Roll of the Dice\" theme for the 2022 GMTK Game Jam. A board game where the dice are everything. They are used for movement on the board, and then in combat rounds they are used like a hand of cards. Collect all the dice and use them to move and attack. Make your way through the board, defeating enemies and the bosses so you can face the final boss and win the day.</p>\n<p><strong>State of the game:\r\n </strong></p>\n<p>There are many incomplete aspects. A number of graphics we didn't get finished. And a few features we would've liked to add but were not able to. But the basic gameplay is there, all it needs is some polish, some sound, and maybe some music, and it might be a full game. There also needs to be quite a bit more explanation about what is happening.</p>\n<p><strong>Future Ideas:\r\n </strong></p>\n<p>We'd like to make this multiplayer so people could compete on the board to finish, and also have things like animations to make everything pretty. Different boards and themes would be nice as well. A map screen showing the flow of the board might help as well. \r\n </p>\n<p>Hope you enjoy trying it out. And be sure to tell us how bad it is!\r\n</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T16:40:07", "background_image": "https://media.rawg.io/media/screenshots/07c/07ce15515e588804b62e3fab018ac923.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alexw128"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}