{"id": 819375, "slug": "battle-roll-ale", "name": "Battle Roll-ale", "name_original": "Battle Roll-ale", "description": "<p>Fight your friends in this dice-themed action/puzzle game!<br/></p>\n<p>There are three different game modes you can choose from:\r\n</p>\n<ul><li><strong>Battle</strong>: Roll around the arena, collect power-ups and attack your enemies. Last die standing wins!\r\n</li><li><strong>Race to ten</strong>: Roll around the arena and collect power-ups as fast as possible. First die to collect ten power-ups wins! (Tip: you can use your power-ups to stun the other player!). \r\n</li><li><strong>Collect them all</strong>: Roll around the arena and collect all the power-ups on the map. The die who collects more power-ups wins!\r\n</li></ul>\n<p>Note: we highly recommend playing against another human if you can, but if you can't you can also play against our AI (be warned, the Hard / Brutal difficulties are very hard!). If you don't have anyone nearby to play with, software such as Parsec can be used to play online.</p>\r\nControls / Instructions\r\n<p><em>Player 1</em>: Use W/A/S/D to roll up/left/down/right. Press E to attack when a powered face is facing up!\r\n</p>\n<p><em>Player 2</em>: Use the arrow keys to roll up/left/down/right. Press the right shift button to attack when a powered face is facing up!</p>\n<p>See the below image for instructions (<em>Note</em>: you can only attack in the Battle and Race modes!).</p>\n\r\nTroubleshooting\r\n<p>We recommend running the HTML5 version in full screen (this fixes some minor graphical issues).</p>\n<p>If you are running the Windows version, please run \"Battle Rollale.exe\" (the other executable is an old version that was mistakenly included).</p>\r\nCredits\r\n<p>Created in Unity by Colin Lu, Jon Schneider, and Anderson Wang\r\n</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T17:19:50", "background_image": "https://media.rawg.io/media/screenshots/8de/8de713d8fa859b43472efe1d65d1b0a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["emanon"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}