{"id": 819352, "slug": "luck-of-the-draw-no-context-needed", "name": "Luck of the Draw (no context needed)", "name_original": "Luck of the Draw (no context needed)", "description": "<p><strong>Disclamer: </strong>this game is very unfinished. My original scope of this project was much to big to be finished in 48 hours, and I had less time to work on it then I had originally hoped. I plan to finish this game at some point (once judging is over, of course) and complete everything I had originally wanted to.</p>\n\n\n<p>Welcome to Luck of the Draw, a simple yet creative card game with a blend of luck and strategy!</p>\r\nRules\r\n<p>The game is simple: Build a deck and battle with it!</p>\n<p>A deck consists of 6 cards. The six ones you start with are your starters, and you won't be able to lose them in battle.</p>\n<p>During a match, a die will randomly select one of your cards and one of your opponents. The left number on a card is it's attack power, and the right number is it's health. The two cards will attack each other, dealing damage equal to their attack power. If your card survives, you can choose to either keep it in play or swap it out for a random card in your deck.</p>\n<p>If the die rolls on a card that's knocked out, you lose the match.</p>\n\r\nCredits\r\n<p>All art, code, and concepts are made by me, while the music is by Kevid Macleod (an amazing audio artist that you should definitely check out!)</p>\n\n\n<p>While it's completely optional, I would really appreciate it if you rated this game. Even if it's not positive, I'd like to know what I can do better in the future :P</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T17:11:56", "background_image": "https://media.rawg.io/media/screenshots/682/6829bf6091ed288b7a5a1b34b62cac7a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["no context needed"], "genres": [], "publishers": [], "esrb_rating": null}