{"id": 819334, "slug": "just-die-already-itch-fuzioncraft", "name": "Just Die Already (itch) (fuzioncraft)", "name_original": "Just Die Already (itch) (fuzioncraft)", "description": "<p>“Just Die Already” is a top down, high score based dungeon crawler about taking chances and knowing when to cut your losses.    </p>\n<p>You gain “chance points”  during your run, and then between floors you can spend these points to tweak the chances of events occurring.\r\n  </p>\n<p>Chests – object in game visible as a golden cube, collected by walking into them. When collected it will give you a random score between 30 and 300.\r\n  </p>\n<p>Health (from chests) – if you are below full health you have a chance of regaining health.  The chance can be manipulated by the between-level chance system.\r\n  </p>\n<p>Chance-Orbs – collected by walking into them.  Gives the player more chance points to manipulate.\r\n  </p>\n<p>Escape Portal – allows the player to exit the whole game with a final score, but imposes a penalty. Depending on both chance and the penalty it may, or may not, be advantageous for the player to use the escape portal to exit at that point, or to wait for a better portal.\r\n  </p>\n<p>Staircase – represented by a black box on the floor.  Allows player to exit the level and go to the next one, via the between level chance system\r\n  </p>\n<p>Golden Staircase – represented by a golden box on the floor.  A rare version of the staircase that takes the player to a bonus room containing multiple chests and chance orbs.\r\n  </p>\n<p>Enemies – the hostile of the game. Will roam freely around the level unless the player gets within a certain radius (ring on the floor) at which point they will chase and attack.\r\n</p>\n\n<p>Controls:</p>\n<p>WASD to move</p>\n<p>SPACE BAR or Left click to attack (uses stamina which is indicated by the blue bar)</p>\n<p>move the mouse to rotate the camera</p>\n<p>Shift to sprint (also uses stamina)</p>\n<p>(stamina regenerates passively health does not)</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T17:04:31", "background_image": "https://media.rawg.io/media/screenshots/eb2/eb2885112b80e8780f0a60a4be2b5f8f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fuzioncraft"], "genres": [], "publishers": [], "esrb_rating": null}