{"id": 819363, "slug": "devils-dice-lazy-input-friends", "name": "Devil's Dice (lazy input friends)", "name_original": "Devil's Dice (lazy input friends)", "description": "<p>A strategy game where your extra abilities are rerolled every turn. Make the best die beforehand and use your skills carefully to win!<br/></p>\n<p><strong>THINGS TO LOOK OUT FOR</strong></p>\n<ul><li>To do any action first pick the ability on top left of the screen, then your own unit to apply it to. The rest depends on what you're doing:<ul><li>If you're just moving, you can click on the highlighted area and the unit will move there. If you're using the Move ability (the fast-forward icon), you have a bonus to the radius you can move in.</li><li>If you're next to an enemy you can attack them by clicking on the enemy. If you're using the Attack ability (the sword icon), you have a bonus to your attack value (normally always 1).</li><li>If you're using the Damage (the bomb icon) or the Heal (the heart icon) abilities, you don't need to do anything else - the action will happen automatically.</li><li>If you're using the Swap icon (the... magnets?), click on the enemy you want to swap with, and you'll be swapped places with that enemy.</li></ul>If you're just looking to move, you can click on your own unit without clicking on the interface icons - that'll work too.</li><li>Sometimes the enemy will move in unexpected ways, often ending up on your own unit - sorry! Pathfinding is hard.</li><li>The game throws you back to the main menu after a win or loss and it doesn't say which one. If you're thrown back to the menu after striking a last unit it's likely that, not a crash!</li></ul>\n<p><strong>EXTRA CREDITS<br/></strong></p>\n<p>Font is Alagard by Hewett Tsoi\r\n(dafont.com/alagard.font)</p>\n<p>All graphics &amp; audio made during the jam</p>\n<p>LIF is a team of 3 - check the author page for credits</p>\n\n<p>By the way, don't use the EXE version - somehow the HTML version doesn't really crash at all, when we've had some problems with the executable.<br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T17:15:51", "background_image": "https://media.rawg.io/media/screenshots/a36/a36f0071ff6c0063ba8181513e628392.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["lazy input friends"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}