{"id": 819415, "slug": "path-of-dice", "name": "Path of Dice", "name_original": "Path of Dice", "description": "<p>In this board-exploration-Mario-Party-like adventure game, the evil ogre king has kidnapped the princess of your kingdom! You are a young hero and need to save her! But you don't have much time and only so much luck. If you are too slow the ogre king will marry (or eat) her and become the king of everything! <br/></p>\n\n<p>Gameplay:<br/></p>\n<p>You roll a dice to move across fields on the map. You can roll the dice by clicking it in the bottom right (first click shows the dices function, second click rolls it). You can hide the dice menu by clicking the arrow at the bottom. After rolling, you move field-by-field by clicking on one of the highlighted fields around you. You have as many movement points as you've rolled. But beware: Some fields (e.g. sand) take more points to traverse. Press the question mark button to show how many movement points each type of field takes. On some fields you can find items and new dice which help you move quicker or test your luck even more with riskier dice rolls. And on some fields, enemies block your path. If you want to go there, you have to fight them first, for which you use your movement points too. Press the question mark button to show the enemies' HP. The game is over once your time (dice rolls in the top left) is out or you've found and defeated the ogre king and stepped onto the princess field! What path will you take? Will you try to find the easiest, but perhaps longest path? Will you test your luck by looking for the shortest path or by fighting your way through the enemies? Or will you look for items and new dice first to help you out later? Of course, you'll learn a lot as you play and we encourage you to play more than once. Click to close this. Have fun!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T17:36:28", "background_image": "https://media.rawg.io/media/screenshots/5c9/5c99ac1856b9c645726d89b2ec8c4b1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PenguinArmy"], "genres": ["Adventure", "Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}