{"id": 819495, "slug": "six-itch-lepotassio", "name": "SIX (itch) (LePotassio)", "name_original": "SIX (itch) (LePotassio)", "description": "<p>**** <strong>TRIGGER WARNING</strong>: This game includes depictions of <strong>gambling addiction, anxiety, and mental illness</strong>. Please consider not playing if these may upset you. I've also removed explicit references to alcohol as per my interpretation of the rules page,  but its presence is still heavily implied. There are also <strong>mild horror elements</strong>.***</p>\n<p><strong>If you are struggling with gambling addiction, know there are resources available to help such as https://www.ncpgambling.org/help-treatment/national-helpline-1-800-522-4700/. </strong><br/></p>\n<p><strong>It would also mean a lot to me if you read some of my thoughts towards the bottom.</strong><br/></p>\n<p><strong>The normal download is cinematic but slow, the express version allows users to speed through text</strong></p>\n<p><strong>DESCRIPTION:</strong><br/></p>\n<p>You play as a person hooked on a simple chance dice game at a local casino. A demon haunts your dreams while you socialize with patrons of a nearby bar in the afternoon. Choose to try to help each other, be sympathetic towards them, or just ignore them to go back and roll dice at the Casino. The gameplay is in the form of a visual novel.</p>\n\n<p><strong>CONTROLS:</strong></p>\n<p>Escape: Exit Game</p>\n<p>X: Stats and Controls</p>\n<p>Return: Select option/advance text</p>\n<p>Up and Down Arrows: Navigate up and down</p>\n<p>No menu or anything! Sorry! No saving either. To restart close and rerun the game.</p>\n<p>You have until 6/1 in the game to explore</p>\n\n<p><strong>I'd also like to really emphasize some thoughts about my game.</strong></p>\n<p>This was my first game jam and I really chose the wrong type of game to make, to be honest. Beyond just the differences in a story-based narrative, I think the rush made it very difficult to tackle an extremely sensitive topic in the best possible way.</p>\n<p>It should go without saying that while I tried to make the characters relatable and complex, they are <strong>merely caricatures of the real-life hardships of addiction.</strong></p>\n<p>I do hope my rushed writing isn't too terrible, and at the very least doesn't get me canceled :p.  <strong>In the words of Mark Brown: I might be \"running the risk of representing mental illness in too simple terms, with stereotypes and simple terms\"</strong>. (Video: What made Psychonauts Special)</p>\n<p>I tried to make the characters people and not just stereotypical addicts. Addiction affects people in different ways after all.</p>\n<p>TBH most likely it's just too cheesy. The endings are super rushed in particular.</p>\n<p>Of course, the usual applies: game-breaking bugs are likely, and I didn't get to include half of the stuff I planned.</p>\n<p>I do just hope a message of positivity and empathy is what is expressed by my game.</p>\n<p>Thank you for listening to my soapboxing.</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T18:11:19", "background_image": "https://media.rawg.io/media/screenshots/e4f/e4fcfd505b55eb0a738b8fa908c02fc3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LePotassio"], "genres": [], "publishers": [], "esrb_rating": null}