{"id": 81943, "slug": "ieurobuddy", "name": "iEuroBuddy", "name_original": "iEuroBuddy", "description": "iEuroBuddy is the ultimate and sophisticated iPhone/iPod App which will help you to manage the EuroMillions lottery.<br/> It does not matter if you play a single, tens or hundreds tickets by only <br/> yourself or as part a pool of your buddies. This App will help you tremendously with generating and verifying large volume of numbers and easily sharing chosen numbers with your buddies via built-in email. Please note there is no monthly/yearly subscribtion fee to cover twice a week to update EuroMillions winning draws. <br/><br/>iEuroBuddy App is implemented in four tabs with these functionalities:<br/>1. Euro Mill tab: <br/>Allows you to generate random numbers or select numbers in the picker manually. <br/>Then you can save those numbers into History database. Inside the History<br/>database you can delete any number set as you wish.<br/><br/>2. Buddies tab:<br/>You can create iEuroBuddy buddies list - the people involved in the EuroMillions <br/>plays. This list is created from the standard Contact App and each buddy must <br/>have an email filled.<br/><br/>3. Mail tab:<br/>You can send all your generated/selected numbers from the History database to <br/>all your Buddies with a single push of a button.  If your buddy has the <br/>iEuroBuddy App as well, he/she can import those numbers from received email <br/>into his/hers History database and can check numbers independently. <br/><br/>4. Winners tab:<br/>Allows you to download last 52 winning draws (covering limit of 180 days to be able claim a winning ticket). <br/>App now automatically compares the last 52 winning draws with all App numbers in the History database and only winning draws are presented.<br/>Winning numbers are marked as green and non-winning as red - so you will have good view of overall results.  This is especially useful with large volume of numbers.<br/><br/>Disclaimer:<br/>This iEuroBuddy App is not officially associated with EuroMillions Lottery.", "metacritic": null, "released": "2016-02-18", "tba": false, "updated": "2019-10-22T14:22:32", "background_image": "https://media.rawg.io/media/screenshots/ee9/ee994095da771bfe6f1259cc1220a7eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Avruk"], "genres": ["Strategy"], "publishers": ["Avruk"], "esrb_rating": "Mature"}