{"id": 819669, "slug": "rigged-roll", "name": "Rigged Roll", "name_original": "Rigged Roll", "description": "<p>Rigged Roll is a top-down shooter where you play as a space cowboy, who makes his money gambling! He is the best dice cheat in the whole galaxy. No one manipulates dice like him.</p>\n<p>He has special dice that when they land on his enemies, give him special abilities temporarily, and he can even manipulate the dice to change the odds in his favor.</p>\n<p>In fact, he uses his dice so much, that it could be considered abuse, to the point The Tesseracts, the ultimate cubes, jump in from another dimension to get revenge for their brethren.</p>\n<p>Now it's time to show them that you are the greatest gunslinger and you can survive their hoards!</p>\n<p>HOW TO PLAY</p>\n<p>To play, use WASD to move, your mouse to aim, and the left mouse button to fire.<br/></p>\n<p>You are able to shoot your dice, and when they hit enemies, depending on the side they roll, you will get a buff for your next bullet fired. There are 6 buffs:</p>\n<ol><li>Increased move speed for a short while</li><li>Decrease fire cooldown</li><li>Increase bullet damage</li><li>Shoot 2 extra bullets</li><li>Increase bullet knockback</li><li>Make bullet piercing</li></ol>\n<p>Enemies drop experience points, filling up the blue bar. For each level-up you earn, a level-up screen will pop up where you need to choose from one of 3 random sides of the dice to increase or decrease its chance of rolling. But the sum of the odds of the dice is always 100%, so by changing one, you will affect the others. Optimize to your liking or try to keep it balanced!</p>\n<p>After every 5 waves that are completed, a skill tree will open where you can spend points on permanent abilities. Try to make it as far as you can!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T19:26:03", "background_image": "https://media.rawg.io/media/screenshots/eec/eec169c2a8ec4c3de8991f67d6ee15a2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Game Dev Técnico", "Catralitos", "TGN-27", "Space_Shoe", "Kob", "GunoTheNuno", "Diogo Mendonça"], "genres": ["Action", "Shooter", "RPG"], "publishers": [], "esrb_rating": null}