{"id": 819654, "slug": "roll-racer", "name": "Roll Racer", "name_original": "Roll Racer", "description": "ROLL RACER!\r\n<p>\"In Roll Racer the dice determine your powerup strength. You can stack the values of the same powerup until level 7, but be careful, if you roll a higher total and go bust, you'll be hit yourself. Inspired by classic board games, like Monopoly, you can also purchase Real Estate (TM) which will help you or hinder your enemies.\"</p>\n<p>Jumping and Sliding is trickier but recommended.</p>\r\nControls:\r\n<ul><li><strong>WASD / Arrow Keys</strong>  -  Drive + Steer</li><li><strong>SPACE  </strong>-  Jump</li><li><strong>SPACE + A / D / Arrow Left / Arrow Right </strong> -  Slide</li><li><strong>Left Mouse Button / E</strong>  -  Fire Power</li><li><strong>Right Mouse Button / Q </strong> -  Look Behind</li></ul>\r\nPower Ups:\r\n<p>There are three types of<strong> Power Up</strong> to pickup on the track:</p>\n<ul><li><strong>Boost  </strong>-  Gives you an initial burst plus temporary speed boost</li><li><strong>Missile  </strong>-  Fires a missile in front of you, targeting an enemy if in sight</li><li><strong>Mine  </strong>-  <strong>Hold fire</strong> to bring it out, release to let go. Releases a few mines that explode on contact</li></ul>\n<p>Picking up a <strong>Power Up</strong> will <strong>roll one six-sided dice,</strong> granting power based on the dice roll. Picking up the <strong>same type</strong> of Power Up again will stack the dice roll up to <strong>7, 7 having extraordinary power. Be careful though, going over 7 will cause you to shut down for a short period.</strong></p>\r\nProperty:\r\n<p>Driving through the <strong>Purchase Property</strong> will <strong>roll three six-sided dice</strong>, resulting in a price that you need to pay to purchase the property. If you have enough coins, the property will become yours and<strong> turn green</strong>. <strong>Watch out for red properties! </strong>Anyone can purchase a property, even if it's already owned.</p>\n<p>There are four types of Property to purchase:</p>\n<ul><li><strong>Boost  </strong>-  Raises three boost ramps, but only when you're near it!</li><li><strong>Pickups  </strong>-  Spawns coins and pickups, but only when you're near it!</li><li><strong>Blockade  </strong>-  Raises blockades that will bounce enemies off if they hit them. Will lower itself when you're near it.</li><li><strong>Missile Turrets</strong>  -  Causes two missile turrets to shoot low power missiles at nearby enemies. Be careful not to get caught in the crossfire!</li></ul>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T19:20:20", "background_image": "https://media.rawg.io/media/screenshots/606/6069e03ed0be40900cf0e1ce03e06e6e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zugai89", "Maytch", "davekingcool"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}