{"id": 819706, "slug": "dicey-situation-pirates-dice", "name": "Dicey Situation: Pirate's Dice", "name_original": "Dicey Situation: Pirate's Dice", "description": "<p>Please play this game in <strong>Full Screen</strong></p>\n<p>Update 2: I figured it out. I messed up the coding on the rudder/turnning. Will be disabling the ability to turn right until I fix it :X prob after the Jam/event.</p>\n<p>Update 1: Game is buggy, careful when <strong>moving/turning at the same time</strong></p>\n<p>**How to play: **</p>\n\n<p>Drag dice onto the White Squares onto the Ship.</p>\n<p>Not all Squares need to be filled.</p>\n<p>Once you're satisfied, you can press GO on the cup on the left.</p>\n<p>It'l do each action one at a time and then pass turn to the Enemy AI.</p>\n<p>Goal of the game is to see how many levels can you pass while managing enemies and your Dice economy.<br/></p>\n\n\n<p>Thank you for visiting my Game Jam Game. This game was made for GMTK 2022 Game Jam.</p>\n<p>The theme of this jam is: Roll of the Dice.</p>\n\n<p><strong>Dicey Situations: Pirate's Dice</strong> is a Strategy Dice Management Game. You manage your ship with Dices as well as handling various stats that need to be looked after.</p>\n\n<p>There are 3 different types of dices: Regular, Red, Purple. Red controls the ships moral, Purple controls curses. If you don't use those dices you take damage based on the number its rolled on.</p>\n<p>There's no penalty in using any dices.</p>\n\n<p>Using the Trash/Heal option (Top Square) will get rid of dices as well as heal the ship depending on Type.</p>\n<p>Regular - Hives Health</p>\n<p>Red - Increase Moral</p>\n<p>Purple - Lowers Curses</p>\n\n<p>Each time you Destroy an enemy ship, you progress through the level.</p>\n<p>Each level will increase the number of enemies.</p>\n<p>More enemies, more dices, more challenging.</p>\n\n<p>This is a game where you not only manage what's on the board but as well as  what is in front of you when you roll your dices. Good luck and have fun!</p>\n\n<p>Disclaimer: This is a Game Jam game, there will be bugs/unpolishedness/etc. Enjoy the game for what it is and don't take it too seriously. Have fun and thanks for swinging by!</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T19:42:09", "background_image": "https://media.rawg.io/media/screenshots/b42/b42cab7d683f53fd82897095203f50ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nguyenk3687"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}