{"id": 819897, "slug": "diceforce", "name": "Diceforce", "name_original": "Diceforce", "description": "<p>\r\nWelcome to Diceforce, Dicerollers. In this mission, you will be assigned to defend our mothership from angry robots with emotion monitor on top of them. Your goal is simple, SURVIVE!\r\n</p>\n<p>Roll the dice and place them on the field to build a powerful defense. Don't forget that each number has a different ability. You could buy more dice with gears dropped from the enemy to give you more options on the tower you want to build or upgrade the existing one!\r\n</p>\n<p>GOOD LUCK! <br/></p>\n<p><strong>Requirements:<br/></strong>- Windows<br/>Installator should install all required libraries itself. If you still got problems with running the game, try to install .NET Core 3.1 Runtime by yourself<br/></p>\n<p><strong>How to Play:<br/></strong></p>\n<p>1. Select number of dices to roll using arrows, and press on the dice to buy them.  <br/></p>\n<p>2. You must have enough gears to buy the draw<br/><br/></p>\n<p>3. A table of bones will appear - select only one and drag it to the map. On this stage, the number of the dice doesn't matter. <br/><br/></p>\n<p>4. A tower will appear that rotates and shoots every 45 degrees<br/><br/></p>\n<p>5. Use START WAVE button to start next wave<br/><br/></p>\n<p>6. You can upgrade a tower by moving a cube one more than the level of the tower on the tower. Upgraded towers shoot faster and in more directions at once. Level of the tower is represented by white dots visible on the tower. Max level is 6<br/> &gt;&gt;&gt;&gt;&gt;&gt;<br/></p>\n<p>7. Survive as many waves as you can! Good luck!<br/><br/></p>\n<p><strong>Credits<br/></strong>Game created by <strong>Tomasz 'veme' Babiak</strong><br/>Art by <strong>Faiz 'pillowbyte'</strong><br/>Music by <strong>Ore</strong><br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T21:07:08", "background_image": "https://media.rawg.io/media/screenshots/626/626ded39dfed6485ca82a0c59ba37e6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["pillowrd", "veme"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}