{"id": 819847, "slug": "dice-hunt-hopelite-thatabyssegg-shypsheesh", "name": "Dice Hunt (hopelite, ThatAbyssEgg, Shypsheesh)", "name_original": "Dice Hunt (hopelite, ThatAbyssEgg, Shypsheesh)", "description": "<strong>This game was created for 48 hours for GMTK GameJam 2022 by those wonderful people: </strong>\n<p><strong>- Y R  (code)                                 - Hopelite  (code)      <br/></strong></p>\n<p><strong>- That Abyss Egg (code)            - Shypsheesh  (art)      </strong>             <br/></p>\n<p>\n</p>\n<p>Controls: WASD to move, R to roll the dice, RMB while holding the dice to change the effect, LMB to select an enemy or to investigate your surroundings.</p>\n<p>During battle, place one dice at the effect (red) column and then place other dice to the appropriate modifier (blue) rows. You can heal yourself by placing the apple dice (one right click while holding the dice), or damage by placing the arrow dice to the appropriate effect slot.</p>\n<p>By placing the dice to the modifiers row you have a chance to increase appropriate the effect placed in the effect column, but only if this dice rolls the same side as the effect. <strong>You always have one successful role, which is set by the effect row.</strong><br/></p>\n<p><strong>Place your dice in the pink table to select effect, place your dice in the blue line to multiply the effect. The game has bugs, to avoid those:</strong></p>\n<ol><li> Please don’t place one die over another die<br/></li><li>Please don’t place dice in the blue line if there’s no die in the effects (red) column </li><li>Please don't place dice outside the dice slots, effects column or modifiers (blue) rows.</li></ol>\n<p>All of these bugs lead to dice being lost :c</p>\n<p><strong>Also, currently, only one fight at a time is supported (you have to reload the game to reach another fight).</strong><br/></p>\n<p> \"A Very Brady Special\" Kevin MacLeod (incompetech.com)</p>\n<p>\"Late Night Radio\" Kevin MacLeod (incompetech.com) </p>\n<p> Licensed under Creative Commons: By Attribution 4.0 License<br/> http://creativecommons.org/licenses/by/4.0/</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T20:43:46", "background_image": "https://media.rawg.io/media/screenshots/ad4/ad480ef2c24f2c44fea1ed3f74bcd092.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hopelite", "ThatAbyssEgg", "Shypsheesh"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}