{"id": 819954, "slug": "block-paper-scissors", "name": "Block-Paper-Scissors", "name_original": "Block-Paper-Scissors", "description": "<p>In Block Paper Scissors you lead a ragtag group of stalwart dice as they face off against dangerous opponents in a game of chance and skill.</p>\n\n<p>Made for the GMTK 2022 Game Jam in 49 hours.</p>\r\nHow to play\r\n<ul><li>The goal is to defeat all enemy dice.</li><li>Move each of your dice into position, and then the enemies will move.</li><li>Each die <strong>must move its full amount</strong>.</li><li>Dice roll as they move, so plan which face lands up.</li><li>If an enemy is adjacent to your die, a winner will be determined and the losing die removed.</li><li>The enemies show where they plan to move, so you can move beside their path to defeat them when they move.</li><li>And very importantly, if you have a <strong>KING</strong> and it dies, <strong>YOU LOSE</strong></li></ul>\n\n<p>Take a look at this chart to see what beats what:</p>\n\r\nControls\r\n<p>Left-Click: Select a die to move, or select an enemy to see where they will move</p>\n<p>Right-Click: Move your selected die</p>\n<p>Hold Space: Show all enemy movements</p>\r\nTips\r\n<ul><li>The ghosts show the orientation that a die will be in after moving.</li><li>Changing the order of your moves affects which face will be up. Left and up does not have the same result as up and left.</li><li>You can grab and drag the selected dice in the sidebar to inspect the arrangement of faces more closely.</li><li>If you get stuck use the menu to restart the board or use reroll to change the orientation of each die.<br/>\n</li></ul>\r\nCredits\r\n<p>Alex Sampley</p>\n<p>Daniel Adames</p>\n<p>Special thanks to Harry, Nat, and Wyatt.<br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T21:30:29", "background_image": "https://media.rawg.io/media/screenshots/468/468aa6a5c9f8f34977a53c9234ee08e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Svorkar"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}