{"id": 819903, "slug": "untitled-dungeon-dice-monsters-game", "name": "Untitled \"Dungeon Dice Monsters\" Game", "name_original": "Untitled \"Dungeon Dice Monsters\" Game", "description": "<p>NOTE: Just realized I may not have even submitted it to the jam properly lol oh well.</p><p>My incomplete submission to the GMTK \"Roll of the Dice\" Game Jam 2022.<br/></p>\n<p>In this version, all you can do is move the primary Ferbawl character around the red and blue tiles using the arrow keys. Invisible walls will prevent you from moving off of the tiles, but you walk over enemies and the hearts.</p>\n<p>And that's it.</p>\n<p>The ultimate vision of the game was to recreate Dungeon Dice Monsters. DDM is a spin-off game of the Yu-Gi-Oh! card game which was featured in the Yu-GiOh! manga/anime. It was made into a Game Boy Advance game and there is also a discontinued physical board game. I intend to change the core mechanics where I feel the original game needed balance and fine tuning as well as introducing new features and ideas.<br/></p>\n<p>I am essentially a complete beginner. The majority of the code implemented in this version of the game I learned in the 48 hours allotted for the GMTK 2022 Game Jam. I wasn't even able to include the dice mechanic itself.</p>\n<p>WHAT SHOULD HAVE HAPPENED:</p>\n<p>You roll three dice with different symbols called \"crests\" representing different functions such as summoning a monster, movement and attack. i.e. If you roll 3 movement crests, those would be stored into your crest pool. In order to move one space on the grid, you must spend one of your stored movement crests.</p>\n<p>Similar functionality would have been implemented for other actions, all determined by which crests you had stored in your pool to use for later. You would then attempt to attack your opponent's health (3 times in the original DDM game) on the other side of the board, destroying any opposing monsters in your way.</p>\n<p>The original game is also meant to start with an empty board. You place your tiles by summoning a monster, the shape of the tiles are known as polyhedral nets in geometry, which a cube has 11. You would be able to flip and rotate the nets in any orientation to snap them to the grid, eventually connecting with the opponent's tiles to reach their health. You cannot move tiles once placed nor place them on top of another, whether they are your own or your opponent's.<br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T21:09:31", "background_image": "https://media.rawg.io/media/screenshots/372/372cb6081b5c12b548a8f236ee079901.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ferbawlz"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}