{"id": 820, "slug": "heroes-of-loot-2", "name": "Heroes of Loot 2", "name_original": "Heroes of Loot 2", "description": "After their job, of keeping the dungeons in balance, was done, our heroes needed a new job. Roaming the lands they found a call for heroes, a castle in need, possible even a damsel in distress?<br/><br/>Pick two heroes to take into the adventure, controlling both heroes and using their special skills to navigate the dangerous castle hallways, rooms and floors. Switching between the two characters to solve quests, puzzles, and of course clear the dungeons of all evil.<br/><br/><strong>Quests</strong> - The dungeon is full of problems, let's call them quests. These problems range from simple \"find a key\" to \"use magic powers to light all magic candles and open the magical gate\". Different types of quests require different solutions. Use the skills of the characters in your party to complete these quests.<br/><br/><strong>Weapons</strong> - Your characters are your main weapons. The Elf shoots his arrows through multiple monsters, the Wizard has unlimited magic, the Warrior has a powerful melee attack with his hammer, and the Valkyrie besides having a quick spinning-melee attack can also detect secrets and important loot. The characters can level up to increase their firepower, or find rare loot which enhances your character for short periods of time. This includes magic spells!<br/><br/><strong>Secrets</strong> - Find secret rooms, level-skipping teleports, secret items, and more!<br/><br/><strong>Perma-items</strong> - You will be able to unlock magic spells by collecting 4 shards of various magic books. Once all shards are collected the magic is unlocked. It's also possible to increase the strength of this magic by collecting the magic shards multiple times. All unlocked spells will stay unlocked even after you die, making you more powerful on your future attempts to reach the final boss.", "metacritic": null, "released": "2016-06-07", "tba": false, "updated": "2019-10-22T14:27:34", "background_image": "https://media.rawg.io/media/screenshots/b9b/b9b3594c025efb0cb9caf8aec15ab488.jpeg", "website": "http://www.orangepixel.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 44, "beaten": 1}, "playtime": 4, "achievements_count": 31, "ratings_count": 1, "suggestions_count": 367, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Linux", "iOS", "Android", "macOS"], "developers": ["Orangepixel", "Pascal Bestebroer"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["Pascal Bestebroer", "Orangepixel"], "esrb_rating": "Everyone 10+"}