{"id": 820160, "slug": "live-or-dice", "name": "Live or Dice", "name_original": "Live or Dice", "description": "Live or Di(c)e: Story\r\n<p>This game is about little mad alchemist who likes to experience with potions. He decides to create a powerful potion, which would make him invisible. As a player you are trying to stop him and reduce his potion progress to zero. However, there are a lot of ways to fail this task. The player needs to pay attention to potion's toxicity, radiation and stability.</p>\n\r\nGameplay\r\n<p>Alchemist's movement is controlled by the computer's dice rolls. He moves on board tiles that are placed within his laboratory. Most tile purposes are to help the alchemist with his work. Which means that your job is to make his life more annoying. You have cards that can be placed on the board and when alchemist steps on them something happen. Alchemist rolls with 1 dice and then make his movement based on the dice roll. Then it is your turn to do your actions. You can either draw a card from the deck, place a card from your hand, take a card from the board or see the result of the next computer's dice roll. These actions cost action points. Action points are refilled at the beginning of your turn. Your cards should help you find a balance between potion's toxicity and to reduce alchemist's progression with his potion.</p>\n\r\nOur social media\r\n<p><strong>Facebook:</strong> https://www.facebook.com/sagittaras <br/></p>\n<p><strong>Twitter: </strong>https://twitter.com/sagittaras </p>\n<p><strong>Instagram:</strong> https://www.instagram.com/sagittaras</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T22:59:51", "background_image": "https://media.rawg.io/media/screenshots/2f3/2f303c8d995402b7dd0c8089a2a89374.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["tetracup", "VKChiuselli", "Zechy", "Morvis", "absinth.queen", "Petr Knedlik", "DonSpaghettiArt", "NewMichalius"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}