{"id": 82025, "slug": "logging-truck-simulator-2", "name": "Logging Truck Simulator 2", "name_original": "Logging Truck Simulator 2", "description": "Meet the sequel of Logging Truck Simulator 2! All your favorite features plus a lot of new.<br/><br/>Get ready for challenging delivery missions. Explore the locations and enjoy the logging truck simulator atmosphere. Try to transport timber cargo to sawmills and other points, race your truck but be accurate! Complete interesting missions in the simulator and enjoy the offroad atmosphere. It is a great cargo truck simulator for real men!<br/><br/><br/>Features of Logging Truck Simulator 2:<br/><br/>- Day and night change<br/>- Many NPCs with unique missions<br/>- Mud physics<br/>- Weather effects<br/>- Career mode<br/>- Fuel consumption and filling<br/>- Breakdowns and ability to fix them<br/>- Heavy vehicles can feel trees<br/>- Open World mode<br/>- Navigation map<br/>- New types of powerful trucks<br/>- Truck upgrades<br/>- Easy driving controls<br/>- Offroad terrain simulator<br/>- Great 3D graphics<br/>- Real trucks sounds<br/><br/>Test all kind of trucks we added for you:<br/><br/>- Logging truck<br/>- Harvester truck<br/>- Kirovets truck<br/>- UAZ truck<br/>- KrAZ truck<br/>- Ural truck<br/>- Oil truck<br/><br/>Meet a lot of workers who are ready to give you important tasks! Drive your timber cargo and be fast, other  men are waiting for logging truck. Drive to destination point, then upgrade to drive cargo faster. Drive like a professional timber truck driver with our simulator!<br/><br/>Prepare to drive all trucks in career mode! And don't forget about fuel. If you are out of petrol -  you can't drive further. So, spend money on refill. Also, keep your truck in good condition - fix breakdowns when they appear.<br/><br/>Do you like cargo games and driving? Get a logging truck or harvester and become a professional driver! Even if you can't drive in real life, you can drive a timber truck in the Logging Truck Simulator 2. Learn how to drive a logging truck and carry your timber cargo in any weather conditions. <br/><br/>Feel like a real driver! Fight with offroad terrain in the simulator. Earn money and upgrade your timber truck. Test your logging truck driving skills. Drive and deliver your timber cargo carefully and don't lose logs. Finish all logging cargo missions and earn money for upgrades. <br/><br/>Enjoy our new game!<br/>Try Logging Truck Simulator 2 and rate us.", "metacritic": null, "released": "2016-11-04", "tba": false, "updated": "2019-10-22T14:31:10", "background_image": "https://media.rawg.io/media/screenshots/786/786c0924f98190fa3671820d8dbf8d30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}