{"id": 820209, "slug": "dungeon-dice-crawler", "name": "Dungeon Dice Crawler", "name_original": "Dungeon Dice Crawler", "description": "<p>How To Play</p>\n<p>You are an adventurer, trying to survive the dungeon. Venture through the labyrinth, trying to find a way out through the Portal.<br/></p>\n<p>Your weapons are dice. Your health is dice. Run out of dice? You run out of health and perish. <br/></p>\n<p>Each die has a different color or strength.</p>\n<p><strong>Grey </strong>dice are <strong>Weak</strong>, and when you roll them, they only do damage equal to the roll to a single enemy die.</p>\n<p><strong>White </strong>dice are <strong>Physical</strong>, and because of this, any damage they do above the health of the enemy carries over to the next enemy.</p>\n<p><strong>Elemental  (Green, Blue, Yellow, and Orange) </strong>dice are powerful against enemies of the same type. They act as normal dice against any other enemy, but against enemies of the same type, <strong>they do double damage</strong>.</p>\n<p>Be careful as you explore the dungeon, as random monsters attack all the time. Your goal is to find the exit before you run out of dice.</p>\n<p>You can move with <strong>WASD </strong>or <strong>Arrows Keys</strong>, and you roll dice by clicking on them with your left mouse button in the battle screen. The red bouncing arrows shows you which dice you are currently attacking. Choose what dice you use carefully, as they serve as your health as well. Run out of dice, and you perish.</p>\n<p>You can view your <strong>Inventory </strong>with the<strong> I</strong> key.<br/></p>\n<p><strong>Escape </strong>will return to the Menu, and in the menu, will close the game.<br/></p>\n<p><strong>Credits</strong></p>\n<ul><li><strong>Kenney </strong>for Graphics https://www.kenney.nl/assets</li><li><strong>Dice Sound </strong>https:1//freesound.org/people/Flem0527/sounds/629982/</li><li><strong>BeepBox </strong>for helping to create music https://www.beepbox.co/</li><li><strong>GameMaker </strong>https://gamemaker.io/en</li><li><strong>YouNow </strong>for Streaming https://younow.com/jasonml<br/></li></ul>\n<p>\n</p>\n<p>I also want to thank everyone that hung out with me while I streamed this over two days.  Especially to Aures who spent a substantial amount of time with me, offering advice and suggestions, and basically, just not having a life.</p>\n<p><strong>Notes </strong></p>\n<p>I'm a solo dev, no artist and no musical skill. But I loved working on this, and I love the mechanics used in the game. I think the combat system is interesting. I realize that there is probably a lot left to balance in terms of loot drops vs difficulty. Finally, if you've read this far, if you follow the plants (green means go) then you'll find the way out.<br/><br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-18T23:22:34", "background_image": "https://media.rawg.io/media/screenshots/a9e/a9e05044130b2040cfeb09410cf13c67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["damnscout"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}