{"id": 82054, "slug": "space-shuttle-pilot-simulator-3d", "name": "Space Shuttle Pilot Simulator 3D", "name_original": "Space Shuttle Pilot Simulator 3D", "description": "Try how to be a space pilot! <br/><br/>Have you ever dreamed to launch a Space Shuttle? Now you can do it. Complete space pilot missions: deliver cargo, fix objects, launch spaceships. The game simulates various spaceships with accurate economics. You have a chance to become a shuttle astronaut right now. Feel like a real NASA pilot and explore the world with this space flight simulator!<br/><br/>Features of Space Shuttle Pilot Simulator:<br/><br/>- Various spaceships<br/>- Real space objects<br/>- Speed, fuel and capacity metrics<br/>- Economic simulator<br/>- Space Shuttle upgrades<br/>- Different pilot's tasks: delivery, fixing, launching<br/>- Realistic launching: 3 steps from Earth to space<br/><br/>This simulator shows you all necessary metrics to drive a spaceship as a pilot. You can even see your trajectory and fix it if you get off course. Try the space simulator and have fun! It simulates the Space Shuttle launching and driving in details. Follow the shuttle tutorial to understand the hard science of space ship operating. Don't forget to upgrade the spaceship or you can't do astronaut's missions and fall.<br/><br/>Enjoy the space exploration in shuttle!<br/>If you aren't astronaut or pilot, you can be him in our simulator. Try the flying in deep space and enjoy challenging missions. Launch the spaceships wisely, don't lose the control of your spaceship. Feel like a pilot with our space shuttle simulator! Fly, upgrade and complete space orders. Train yourself how to do it professionally. Try the power of all spaceships, they are ready to meet with their captain! Think about economy, tasks can be really hard. Use a navigation system and shuttle controllers to find the right course. Find how to complete missions and get your reward!<br/><br/>Space is full of challenging tasks for pilot! We made this shuttle simulator for real astronauts. The safety of your spaceship depends on you. Is not easy to fly in the simulator. But you can do it with our tutorial and smooth controls. Don't forget that you have a lot of shuttle upgrades and space ships. Earn money and buy them all, it is real exciting!<br/><br/>Let yourself to be an astronaut in our shuttle simulator, captain!<br/>Try Space Shuttle Pilot Simulator right now!", "metacritic": null, "released": "2016-12-03", "tba": false, "updated": "2019-10-22T14:31:11", "background_image": "https://media.rawg.io/media/screenshots/f3a/f3a7c35bf9ddba6bdafd08a87f34135b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}