{"id": 820521, "slug": "dicey-situation-jekirutur-games", "name": "Dicey situation (Jekirutu® games)", "name_original": "Dicey situation (Jekirutu® games)", "description": "<p>Dicey situation is a game for the GMTK 2022 game jam. The theme of the jam was: Roll of the dice!<br/></p>\n<p>In this game, a roll of the dice can limit your movement, it can change the environment and   it can determine your fate! You will have to combine luck and strategy to beat all the levels!</p>\n<p>Enjoy!</p>\n<p> </p>\r\nRules:\r\n<p>There is a board separated by tiles. The bottom row has numbers 1 – 6, each in one tile. There are five dice: the one (1) move dice, the three (3) tile dice and one (1) lucky dice.\r\n  </p>\n<p>Every round:\r\n  </p>\n<ul><li>The move dice and all the tile dice are rolled.\r\n  </li><li>The player moves to the tile with the number that corresponds to the one on the move dice.\r\n  </li><li>If there are multiple tiles that have the corresponding number, the player chooses which one to move to. If there are no tiles with the corresponding number, it’s game over! When the player steps on the tile, the number from it is removed.\r\n  </li><li>After the player has moved, the values of the three (3) tile dice are applied to the tiles in the row “above” the player, and from left to right (the tile directly “above” the player is the middle).\r\n  </li><li>If the player has stepped on a red tile (a.k.a. “death tile”), it’s game over! If the player has stepped on a yellow tile (a.k.a. “lucky tile”), the lucky dice is rolled (If the value is one (1) or two (2), it’s game over! If the value is three (3) or four (4), nothing happens… If the value is five (5) or six (6), the player gets a shield that will protect them from dying when they step on the next red tile). If the player has stepped on a green tile (a.k.a. “victory tile”), the player has won the game.</li></ul>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T01:44:56", "background_image": "https://media.rawg.io/media/screenshots/7f6/7f642e214f4a1999b5c0f8643dfe10cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS"], "developers": ["Jekirutu® games"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}