{"id": 82056, "slug": "minesweeper-fun", "name": "Minesweeper Fun", "name_original": "Minesweeper Fun", "description": "The object of the game is to clear the board without detonating hidden mines. Minesweeper Fun takes the classic puzzle game into the 21st century. Includes modern themes, multi-touch controls, and animations that make this game highly addictive.<br/><br/>How to Play:<br/><br/>Select a tile on the minefield to remove it from the board.  If it's a bomb then the game is over.  If not then you get another turn.  Numbers will display when there are mines found in the eight surrounding cells.  Use this information along with strategy and logic to determine where mines are located on the board.<br/><br/>Pro Tips:<br/><br/>Once you discover a mine drag a flag over the tile to mark it as suspect.  You can also long press on the tile to quickly drop a flag.  Flagging prevents accidental touches from triggering a tile you know has a bomb under it.  When all flags have been placed on the board a green check button appears. Tap the checkmark to watch all non-flag tiles blast away and see if you've won the battle.  Another benefit to using this approach is you won't be charged extra moves which means you'll get a higher score.  You don't have to use flags though and can just uncover all tiles without mines to win the game.  <br/><br/>Scoring:<br/><br/>You can get huge score bonuses to boost your score to the top of the Leaderboard. You will receive an initial score based on number of moves and the time it took to win.  Each day you play, your score is multiplied by the number of days up to a maximum of 5. Each consecutive game you win, your score is multiplied by the number of wins up to a maximum of 5. That means when combined you can make your final score up to 10 times bigger!<br/><br/>Features:<br/><br/>- Three difficulty levels: Classic (8x8), Professional (16x16), Expert (16x30)<br/>- Multiple color themes: Dark, Bright, Classic<br/>- Awards and Statistics for tracking progress<br/>- Game Center leaderboards and achievements<br/>- Universal app with full retina display support<br/>- Free!", "metacritic": null, "released": "2014-03-07", "tba": false, "updated": "2019-07-30T09:26:32", "background_image": "https://media.rawg.io/media/screenshots/a22/a225aaddc65c7d38352f09f1be957e31.jpg", "website": "http://www.tmsoft.com/minesweeper/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "Android", "iOS"], "developers": ["TMSOFT"], "genres": ["Board Games", "Puzzle"], "publishers": ["TMSOFT"], "esrb_rating": "Everyone 10+"}