{"id": 82067, "slug": "golf-card-game-hd", "name": "Golf Card Game HD", "name_original": "Golf Card Game HD", "description": "Golf Card Game<br/><br/>** I have been waiting for someone to make this game for the iPad and iPhone. Great game everyone should download it.<br/><br/>** Great app.  This golf game has just the right amount of strategy and luck to keep me interested. A full game takes about 10 minutes so it's a great way to pass the time. You will like this one!<br/><br/>** This games really fun!!!<br/><br/>** This is pretty fun to play!<br/><br/>** Fun game! I have zero issues and very happy with my purchase!<br/><br/>** An excellent, fun and original game.<br/><br/>A card game for all ages.  Whether you're a 4 year old girl or a 80 year old man, this game is easy to learn.  Yet it involves some decisions to challenge the most competitive of players.  You can play against the computer or up to 3 other friends over wifi or bluetooth.<br/><br/>The game of golf is a simple but fun 4 card game where the lowest score wins the hole.<br/><br/>Score as few points as possible on each hole.  The lowest score of each hole wins the hole and gets a point.  The player with the most points after 9 holes wins the game.<br/><br/>* View scorecard with both Match play and Stroke play totals <br/>* Share the scorecard with your friends and family.<br/>* Tap hole flag to view scorecard at any time <br/>* \"Play again\" option after round is over<br/><br/>Please send feedback or requests to golfcardgame@spiralinnovations.com.<br/><br/>Enjoy!", "metacritic": null, "released": "2012-09-25", "tba": false, "updated": "2019-07-30T07:59:30", "background_image": "https://media.rawg.io/media/screenshots/16f/16fe90dc8df6e0a8435ad3503e652b98_kieO5R8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["David Olea"], "genres": ["Card"], "publishers": ["David Olea"], "esrb_rating": null}