{"id": 820865, "slug": "wisps-cfhm", "name": "Wisps (CFHM)", "name_original": "Wisps (CFHM)", "description": "<p>Entry for GMTK2022</p>\n<p>How To Play</p>\n<p>\n</p>\n<ol><li>Click the roll button to roll all dice. The game automatically rolls your first dice when you begin. </li><li>Assign each die to any of the 6 action spots.</li><li>Repeat!</li></ol>\n<p>Game End</p>\n<p>Every time you roll the dice, the skull value increases and darkness approaches. When your rolled sum is less than the value on the skull, you lose    Celestial Wisps equal to the difference. If this brings you below zero, the game is over. Your score is how many rounds you lasted, or the value on the skull.</p>\r\nHow It Works\r\nResources\r\n<p>Earn  Sunbeams,  Moondrops, and  Stardust by assigning dice to the top three slots. Earn  Celestial Wisps by rolling higher than the Wisp Trackers on the main gauge.  <strong>When paying costs using basic resources,   Celestial Wisps will be used if you don't have enough, so spend wisely!</strong></p>\r\nLeveling Up\r\n<p>Use   Sunbeams,  Moondrops, and   Stardust to level up your dice's max values and  Celestial Wisps to level up the minimum value. <strong>A die must have at least two sides - you can never have a die with a same minimum and maximum value</strong>. </p>\r\nWisp Trackers \r\n<p>You can spend 1 each of  Sunbeams,  Moondrops, and  Stardust to lower a Wisp Tracker by 1, making it easier to roll. Each time you level this, the cost increases by 1. <strong>Wisp Tracker locations are based on the distance from the max sum of your dice and will automatically increase as your maximum dice value increases. </strong></p>\n\n<p>Credits</p>\n<p>Design, Programming, Art, Font, SFX - CFHM<br/>Music - John Praw<br/>Background - Digital Moons</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T04:18:48", "background_image": "https://media.rawg.io/media/screenshots/71f/71ff6b437e7277f46d895e6a6a5dda4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CFHM"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}