{"id": 820875, "slug": "dice-towers-itch", "name": "Dice Towers (itch)", "name_original": "Dice Towers (itch)", "description": "<p>A tower defense game - with a twist! Rather than buying towers, each wave, you must roll dice to see what towers you get. The dice rolling works like yacht dice  - you can choose to lock in dice you are happy with and re-roll the remaining dice, or you can  sacrifice dice to upgrade towers for future waves.  <br/><br/>Towers get deleted after each wave, so you must constantly stay on your toes! Good luck and may the odds be ever in your favor.<br/><br/> <strong>Tower Types</strong></p>\n<ol><li><strong>Snowflake:</strong> Slows enemies in a short range. Leveling increases the slow amount. </li><li><strong>Vine:</strong> Does more damage the further it is from the target. Leveling increases damage dealt. </li><li><strong>Lightning:</strong> Attacks in random intervals, and on random enemies. Leveling makes it attack faster. </li><li><strong>Arrow:</strong> Fires arrows in all four cardinal directions. Leveling makes it attack faster.</li><li><strong> Meteor: </strong>Stores meteors slowly over time. Rapidly fires meteors that deal high damage. Leveling increases max meteors stored, storage rate, and increases damage.</li><li><strong>Crystal:</strong> Attacks rapidly in a long range, but for low damage. Leveling increases damage and range.</li></ol>\n\n<p>Thanks for Humble Fonts for Equipment Pro pixel art font https://somepx.itch.io/humble-fonts-free</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T04:23:14", "background_image": "https://media.rawg.io/media/screenshots/d67/d674773dea365771938dc3a210ebc6c4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["littlehawk93"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}