{"id": 82092, "slug": "russian-checkers", "name": "Russian Checkers", "name_original": "Russian Checkers", "description": "Russian checkers follows the russian rules (link to the rules inside the game).<br/><br/>If you look for UK/US rules checkers, please download \"Checkers\".<br/><br/>Russian checkers extends the traditional US playing rules by mainly :<br/>1) Allowing backward jumps (but still allowing forward moves only)<br/>2) Giving King the power to move and jump several cases in all directions ... (Like a Queen on a chessboard).<br/><br/>With this software, you will be able to play locally, against someone or against the computer. You will also be able to play against anyone in the world through Game Center.<br/><br/>Key features (Free version):<br/>- Games against computer (4 levels, color option)<br/>- Online games with Game Center, random player or with a friend, text messaging and voice chat<br/>- 2 players game with time limit<br/>- Draw recognition and automatic draw propositions for single player games<br/>- \"Suicide mode\" option against the computer: Lose all your checkers before the computer!<br/>- iPod compliant: Listen to your own music while playing <br/>- Elo score<br/>- Nice look and feel<br/><br/>Key features (Premium version):<br/>- No ads<br/>- AI difficulty level 4 and 5<br/>- Automatic record of all the games, and easy replay of any of them<br/>- Possibility to unlock the pawns and move them anywhere off/on the board<br/>- Show board numbers option<br/>- Delete button to come back to a previous board combination (2 players and single players game)<br/>- Automatic reorganization of the checkers<br/>- More points gained per game center game<br/>- Option to see the last move", "metacritic": null, "released": "2012-07-02", "tba": false, "updated": "2019-10-22T14:22:34", "background_image": "https://media.rawg.io/media/screenshots/126/1264043296df876b66bfdcb55c71a88d_N0ICOAv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Itchigoo"], "genres": ["Board Games", "Family"], "publishers": ["Harold CHATENET"], "esrb_rating": "Everyone 10+"}