{"id": 821006, "slug": "swindlys-gamble", "name": "Swindly's Gamble", "name_original": "Swindly's Gamble", "description": "<p><strong>RULES:</strong></p>\n<p>The goal of the game is to be the first to reach 100 points through rolling dice, and modifying your rolls with cards.</p>\n<p>Each turn is divided into four phases: Draw, Main, Roll, and Respond.</p>\n<p>After all of these phases are complete the turn ends, passing control to the opponent.</p>\n<p>There are 3 types of cards: Immediate (brown), Response (blue), and Counter (purple).</p>\n<p><strong>Immediate Cards</strong> <strong>(brown): </strong>Can only be played during the main phase.</p>\n<p><strong>Response Cards</strong> <strong>(blue): </strong>Can only be played during the response phase as a response to the opponent's die roll.</p>\n<p><strong>Counter Cards</strong> <strong>(purple): </strong>Can be played in main or response phase, but only as a counter to a card placed in the stack.</p>\n<p>The game starts with both players drawing 4 cards. You go first.</p>\n<p><strong>Draw Phase: </strong>The player whose turn it is draws until they have reached their \"max cards\". Your \"max cards\" starts at 4, but that can be modified through card effects. The \"Main Phase\" is immediately entered.</p>\n<p><strong>Main Phase: </strong>During this phase, you can choose to play \"Immediate Cards\" (brown) from your hand. These can affect things such as your number of dice, roll modifiers, and max cards. When a card is played it enters \"The Stack\", allowing the opponent the opportunity to play a \"Counter Card\" (purple) to negate or modify the last played card. You can, in response, play a counter to negate or modify their counter. This can continue until a player declines a counter.</p>\n<p><strong>Roll Phase: </strong>After you are done your main phase, you can click the \"ROLL\" button to roll your dice. The \"Response Phase\" is immediately entered.</p>\n<p><strong>Response Phase: </strong>After a roll is made, the opposing player has a chance to respond to it by playing \"Response Cards\" (blue). These can alter the opponent's previous roll. But these cards, just like \"Immediate Cards\", go into \"The Stack\". Therefore the opponent can still play \"Counter Cards\" (purple) to negate or alter your \"Response Cards\". If you decline a response then the opponent's turn will end.</p>\n<p><strong>End Turn: </strong>If there is nothing left you can do in the \"Response Phase\", click the \"END TURN\" button to end your turn. Your points earned from rolls that turn will be tallied into your overall score. If one player has over 100 points at the end of the turn, then that player is declared the victor.</p>\n<p><strong>The Stack: </strong>When a card is played, it's effect does not activate immediately. Instead, it goes into a \"stack\" of cards, ready to be played. The first card in a stack will always be an \"Immediate\" or a \"Response\" card. But after that, players can only add \"Counter Cards\" (purple) to the stack. When the opponent places a card in the stack, you will be prompted to counter. When a player declines a counter, the stack resolves, activating the effects of all the cards in the stack, starting with the card on top, and proceeding downwards until the stack is empty.</p>\n<p>Sometimes Mr. Swindly might cheat a little sometimes maybe.</p>\n<p>Made in 2 days for the GMTK 2022 game jam with the theme of \"Roll of the Dice\".</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T05:24:37", "background_image": "https://media.rawg.io/media/screenshots/752/752514aebcfa279abba0161c63bb4ff2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["ClarkHate"], "genres": [], "publishers": [], "esrb_rating": null}