{"id": 821000, "slug": "medieval-itch", "name": "MeDIEval (itch)", "name_original": "MeDIEval (itch)", "description": "<p>Welcome to the Kingdom of MeDIEval!<br/><br/>Here you, the brave knight, you must fight to defend the castle from powerful monsters and beasts. Your chances are slim if it wasn't for your secret weapon...<br/><br/><strong>The  'Shapeshifting' dice!</strong> Each attack you throw has a percentage chance to hit. But after attacking your dice shapeshifts into another dice. The dice changes from a regular six sided dice (D6), to a D4, D8, D10, D12 &amp; D20. Use the right dice in the right situation to make sure you land crits when it matters, and do not miss any moves that are vital to your survival.<br/><br/><strong>Upgrade your dice!</strong> After each round of combat you get the opportunity to add more dices into the rotation or remove dices from the rotation. Manipulate your dice so it will give you the best results for your strategy!<br/><br/><strong>Hit those Crits!</strong> Critical hits are the most powerful way to take out your opponents or dodge their attacks. On any dice rolling the highest that the dice can roll is considered a Critical Hit. Rolling a 1 is a critical Failure.  In this Kingdom you have to be lucky or be defeated!<br/><br/><strong>Defend the kingdom!</strong> Beat waves of monsters, to finally face the final boss. Your ultimate opponent will challenge your wits, strategy and most importantly... luck! Can you slay the beast?<br/><br/>As part of the GMTK Game Jam 2022 under the theme of 'Roll of the Dice'.<br/><br/><br/>Controls:<br/>Use your mouse to click on the action you wish to do!<br/><br/><br/><br/>Credits:</p>\n<p>Tudor Boneanu</p>\n<p>Sem Lefering</p>\n<p>Tim van Poppel</p>\n<p>Jelle Steinmann</p>\n<p>David van der Waals</p>\n\n<p>Medieval vector art assets created by macrovector on www.freepik.com<br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T05:22:31", "background_image": "https://media.rawg.io/media/screenshots/8f7/8f73de05263cb61029e7a2e897d429f9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SuperNutSquad", "Jelle.Steinmann", "SyonHTrick", "SemLefering"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}