{"id": 821292, "slug": "dice-duel-dinodyr", "name": "Dice Duel (Dinodyr)", "name_original": "Dice Duel (Dinodyr)", "description": "<p><strong>Just you, your enemy, and a board to grow stronger.</strong><br/><br/>My game submission for GMTK's Game Jam 2022!<br/><br/>This is a 1v1 board game. The goal is to reduce your oponent's health bar to 0, by dealing damage to them. To deal damage, walk through the board all the way to them, and a battle will start. Both of you will roll dices, one for Attack and the other one for Defense. If Attack is greater than Defense, the defender takes the difference in damage.<br/><br/>The board is made by tiles, which have their own action when you land on them.<br/>Your character has stats, which are: Attack, Defense, Speed.<br/>- Attack determines how many damage can you deal;<br/>- Defense is about how many damage you block; and<br/>- Speed sets how many tiles your character can walk.<br/><br/></p>\n<p>You start by rolling dice to see how many tiles you can walk this turn, from 1 to your speed value. If you land on a colored tile, an action starts. <br/>- Power Tiles gives you a roll with another dice to get a chance for increasing any of your stats (Attack, Defense, Speed).<br/>- Exclamation Mark Tiles teleport you to another Exclamation Mark.<br/>- U-Turn Tiles makes you roll another dice to walk backwards.<br/>- Bidirectional Tiles doesn't do anything when you land on them, but you can choose the direction to go next.<br/><br/><strong>Controls:</strong><br/><br/><strong>Pause:</strong> ESC</p>\n<p><strong>Player 1: </strong><br/>    <strong>Interact:</strong> W<br/>    <strong>Choose next tile (for Bidirectional Tiles):</strong> A, D<br/>    <strong>Open map:</strong> S<br/><br/></p>\n<p><strong>Player 2: </strong><br/>    <strong>Interact: </strong>Up Arrow<br/>   <strong> Choose next tile (for Bidirectional Tiles):</strong> Left and Right Arrows<br/>    <strong>Open map: </strong>Down Arrow</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T07:30:42", "background_image": "https://media.rawg.io/media/screenshots/cc6/cc69fb832cbd2d434408d3a9e5cf410c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Dinodyr"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}