{"id": 821214, "slug": "role-your-dice-a-tale-of-money-and-politics", "name": "Role your Dice: A Tale of Money and Politics", "name_original": "Role your Dice: A Tale of Money and Politics", "description": "<p><strong>Govern as the \"D20\"</strong></p>\n<p>One unfortunate facet of living in a world of dice is that dice, like most inanimate objects, lack initiative.  One might think that these dice stand apart given their unique traits of having eyes and legs. The reality is that dice are elitist leaches in constant need of micromanagement.  Being the D20 of a town does have some serious perks. The one I personally enjoy most is the lack of oversight of tax funds. However maintaining this position does require that you keep your subject docile as they will vote you out of office if they feel slighted.<br/><br/>To do this I recommend keeping the housing supply well in excess of demand. This will keep the rent low and allow you to invest the dice's money (from their own pockets can you believe they fall for this) to increase their role in society. Each dice is marked with a specific number of pips. These pips determine what roles they can take on. Some will only allow those with more or less pips as many 5 pips wouldn't be caught dead on a factory line.<br/><br/>I wish you good fortune (which will come soon enough if you head my advice regarding tax funds)<br/><br/><strong>How To Play</strong></p>\n<p>All interactions in this game are done with the mouse. Most interactions will be with the die under your care. Click on a dice and drag it to whatever building you want it to interact with. Make sure to check the requirements as a dice will not enter a slot it doesn't meet the requirements for. <br/><br/>As dice work you gain coins you can spend on upgrading the town to keep up with the expanding population. Choose from the 6 available options to build more housing, job sites, cloning machinery, education, and essence extraction. Eventually it will all come tumbling down but until then rake in the coin.<br/><br/>At the end of each year an election is held. If you can gain more than 50% of the votes you can continue on another year in the D20 seat.</p>\n\n<p><strong>Additional Information</strong></p>\n<p>This game is an entry for the GMTK game jam. I'm not accomplished artistically even under the best of circumstances. This project was assembled in less than 24 hours. I like to make post jam builds so any crashes or bugs (of which I'm sure are many) please inform me so I can put them on my list. I appreciate the time you took to play this janky little experiment.</p>\n\n<p>The Theme - Roll of the Dice</p>\n<p>My Take: The primary thing I did was have fun with a play on words. Shifting roll to role. In this game you manipulate the socio-economic roles of each dice as you try to keep the inevitable disaster from collapsing everything. In addition to the wordplay I did introduce some RNG systems. I would have liked to push these further but time is not on my side. At the end of each week a random event will pop up. These can have positive or devastating effects. All based on what roll occurs.<br/><br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T06:55:24", "background_image": "https://media.rawg.io/media/screenshots/844/844dd417d4a985099da1c50152f7391d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VideoGamester"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}