{"id": 82135, "slug": "offroad-cargo-truck-simulator-3d", "name": "Offroad Cargo Truck Simulator 3D", "name_original": "Offroad Cargo Truck Simulator 3D", "description": "Drive a real long-distance truck in Offroad Cargo Truck Simulator!<br/><br/>Become a cargo truck driver. Choose different cargo and drive it along the road. Transport cargo to  warehouses. Upgrade your truck for better driving. Fix and refuel a cargo truck at service stations on the road. Follow economy rules for the transport and spend money wisely. <br/><br/>Features of Offroad Cargo Truck Simulator:<br/><br/>- Real cargo trucks<br/>- Economy simulator<br/>- Cargo truck competitors<br/>- Truck service stations<br/>- Gas stations <br/>- Main and optional transport missions<br/>- Different cargo<br/>- Cargo truck upgrades<br/><br/>Offroad Cargo Truck Simulator is for road fans. Transport cargo to visit different places, enjoy the long road driving. Good transport controls help your driving in the simulator. Continue cargo driving even when the road is hard. Choose missions for your big cargo truck. Spend your evening on the road!<br/><br/>Use a simulator's map and a driving arrow to check the road. Pay attention to simulator's economy - spend money on upgrades to improve transport cargo driving. Explore offroad in the simulator, earn money for cargo truck driving. Be a truck driver with the simulator - try long-distance road driving, transport cargo, fix and refuel the transport on the road.<br/><br/>Try accurate driving of cargo truck. Keep your transport in good condition. Feel what is real adventures in Offroad Cargo Truck Simulator. Upgrade the transport, prepare it for road, the simulator is challenging.<br/><br/>Feel like a real truck driver with our road simulator. Transport cargo along the road to different warehouses. Choose missions and start driving. Repair the truck at service stations if necessary. Transport all cargo and earn money for driving. Upgrade to transport faster and enjoy the road driving simulator. Try easy truck controls we made in the simulator.<br/><br/>Transport cargo in truck simulator to many places. Road is long, but challenging. Try truck driving and write us. Earn money for cargo delivery. Follow road driving regulations, transport accurately. Buy a new truck if you don't like your transport in the simulator.<br/><br/>Try all transport missions in Offroad Cargo Truck Simulator and enjoy the long road!", "metacritic": null, "released": "2016-12-03", "tba": false, "updated": "2019-10-22T14:33:12", "background_image": "https://media.rawg.io/media/screenshots/3c7/3c7686b105e6553f0fd9dde1d007295c_epTPUu8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Sports"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}