{"id": 821436, "slug": "elven-temple-prototype", "name": "Elven Temple (Prototype)", "name_original": "Elven Temple (Prototype)", "description": "<p>Game design: Lolsebca</p>\n<p>Font: dotty by Kevin Richey on 1001fonts.com (https://www.1001fonts.com/dotty-font.html)</p>\n<p>Character: Simple Top Down Character by ImmunityS on Itch.io (https://immunitys.itch.io/pixel-top-down-character)</p>\n<p>Level: Pixel Art Top Down - Basic by Cainos on Itch.io (https://cainos.itch.io/pixel-art-top-down-basic)</p>\n<p>NPCs: Mini Characters by Atelier Pixerelia on Itch.io (https://pixerelia.itch.io/vas-mini-characters)</p>\n<p>ELVEN TEMPLE (PROTOTYPE) was created by Lolsebca — not endorsed by any of the other people credited! — during the GMTK Jam 2022, though the entry doesn't validate the criteria to qualify, so it evolved as its own thing.</p>\n<p>It's more about getting to learn core elements of the Godot engine's work flow, than completing a game on a given theme.</p>\n<p>It was also a valuable experience in terms of level design, since I learnt to use tilesets, how a dialogue system could work, and a bit more.</p>\n<p>It might progress in the future or remain the same forever.</p>\n<p>As for how it could fit the \"roll of the dice\" theme of the GMTK Jam 2022, I believe that it should do so in a manner like 100% Orange Juice.</p>\n<p>The character has a bow and arrows (in the files), so perhaps that there are 6 numbers of arrows shot that vary each time.</p>\n<p>You could randomize walking speed, damages dealt, the spawn of arrows and monsters, and add a multiplier for collectibles within the chests for instance.</p>\n<p>For now it's a walking simulator, I guess.</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T08:38:43", "background_image": "https://media.rawg.io/media/screenshots/976/976977a63dad425048e25f85f7704be7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Lolsebca"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}