{"id": 821519, "slug": "chad-geiger-in-a-waist-of-time", "name": "Chad Geiger in: A Waist of Time", "name_original": "Chad Geiger in: A Waist of Time", "description": "<p>Your name is Chad Geiger, Giga-Chad, Pilot extraordinaire and Hero of the Free World. <br/></p><p>You were sent on a mission to raid the Unassailable II, a zeppelin research facility belonging to \"THE\" Empire (they’ve had copyright issues with other “Empires”).<br/>Upon arrival, an inter-dimensional experiment has gone awry, and now the crew of the Unassailable II are all mind-controlled zombies serving some kind of unimaginable <br/>(also, undrawable) monster (pictured off-screen, we couldn't draw it in time, but your imagination is scarier, if you could imagine it).<br/></p><p>Heroically crashing your plane into the zeppelin, you armed yourself with an array of strange experimental devices such as the Space-Time Paraclock Belt<br/>that allows you to reverse time on death, as well as the Dice-On-Sphere D.O.S; a device that harnesses randomised energies that allow you to shoot warp bombs,<br/> move slightly quicker and best of all, punch things!<br/></p>\n<p>Thankfully these heinous fiends are held at bay by the power of the Paraclock! Consider your next move carefully, it may be your last!</p>\n<p>Game Design/Paper Prototyping/Narrative Design: Alex Dullow<br/>Music &amp; Sound Design: Nic Dullow<br/>Art &amp; Animation: Lachlan Pini<br/>Programming and Project Management: Andrew Banagala</p>\n\n<p>CONTROLS:<br/>Select Card/Tile/Button: Left Click<br/>Deselect Card: Right Click<br/>Move Up: W<br/>Move Left: A<br/>Move Down: S<br/>Move Right: D<br/></p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T09:16:24", "background_image": "https://media.rawg.io/media/screenshots/d70/d70847ee7ab60b46641e8665f2ec44cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GooNineTea"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}