{"id": 82155, "slug": "bridge-construction-simulator-2", "name": "Bridge Construction Simulator 2", "name_original": "Bridge Construction Simulator 2", "description": "Meet our sequel of Bridge Construction Crane Simulator!<br/><br/>Bridge construction is in progress again! Many new interesting tasks are waiting for you in the construction simulator. Open new tower crane simulator levels and get new construction tasks. Build accurately, get all construction things and set them to the right place. Operate trucks, excavator, pile diver, tower crane, concrete mixer and pump, to build a bridge and don't hurry, you have no time limit for the bridge construction in Bridge Construction Crane Simulator 2. Do you build every day? Write us about our new bridge construction simulator. Do all simulator's missions and give feedback.<br/><br/>Features of Bridge Construction Crane Simulator 2:<br/><br/>- New bridges<br/>- New construction vehicles<br/>- New interesting missions<br/>- Realistic controls<br/>- Many types of tasks<br/>- Different cargo<br/>- 3D graphics<br/><br/>What to do today? Build the bridge! You can build all construction parts with eyes closed in our simulator. Help workers to build a beautiful bridge. The bridge construction is very important and they have many parts to build. Train your construction skills, you can do it with our tower crane simulator!<br/><br/>Vehicles of Bridge Construction Crane Simulator 2:<br/><br/>- Truck<br/>- Excavator<br/>- Pile Diver<br/>- Tower Crane<br/>- Concrete Mixer<br/>- Concrete Pump<br/><br/>Take part in a big bridge construction with tower crane and other vehicles, deliver cargo and build all important objects in our simulator. If your dream is to build a bridge, we made this construction simulator for you. Working with a tower crane, excavator and others is funny and challenging. Become the best bridge builder in the city. Even you can't drive or build a bridge in real life, you can build in the construction simulator. <br/><br/>Start building today, or the bridge construction in the simulator will never be finished. Workers want to build the bridge in time, that is why they need you. Special man will give you all the instructions about vehicles, your task in the construction simulator is just to operate them and build the bridge. In our simulator we have concrete, piers, decks and all kinds of construction things.<br/><br/>Play Bridge Construction Crane Simulator 2, help citizens finish the construction!", "metacritic": null, "released": "2016-12-04", "tba": false, "updated": "2019-10-22T14:31:10", "background_image": "https://media.rawg.io/media/screenshots/d13/d13d826cbb6f52204e477d488247a617.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}