{"id": 8217, "slug": "guardian-codex", "name": "Guardian Codex", "name_original": "Guardian Codex", "description": "A brand-new title from the creators of Guardian Cross, the hit series with over 8 million downloads! Up to 4-player multiplayer mode.<br/><br/>&amp;#39;- Beginner&amp;#39;s Campaign<br/>Start playing now to receive a 4-star Banshee Guardian and one of each magic stone (III) for a total of 5 stones!<br/><br/>&amp;#39;-Story-<br/><br/>In the year 2030, the world is split between the Empire and the Resistance. As one of the Resistance&amp;#39;s agents, you are sent into the virtual reality Codex with a vital mission: find the extinct legendary “Guardians.”<br/><br/>The Resistance’s goal is to transfer the virtual Guardians into the real world and use them to defeat the Empire. Immerse yourself in the Codex to better understand the Guardians and save the world!<br/><br/>&amp;#39;-Easy Battle Commands-<br/>Battle enemy Guardians with easy commands in the style of classic games like Dragon Quest. Over 100 different attacks, status effects, and other abilities for you to choose from and strategize your troops.<br/><br/>&amp;#39;-4-Person Multiplayer Mode-<br/>Defeat bosses using one Guardian from each teammate. Use the chat function to coordinate your team&amp;#39;s strategy and clear sites. You can even get rare items as rewards during multiplayer.<br/><br/>&amp;#39;-High-Quality Guardian Graphics-<br/>Over 100 different 3D Guardians to capture.<br/><br/>&amp;#39;-Quests-<br/>Help the people of the Codex and other agents search through caves, hunt down Guardians, and more. Travel around the map to complete the main quest and other sub quests at your leisure.<br/><br/>&amp;#39;-Leveling Up-<br/>Power up your Guardians in various ways: raise their levels, evolve, rebirth, and equip gear. You can even learn player skills to help you in the game.<br/><br/>&amp;#39;-Applicable Devices-<br/>iPhone 5S and newer<br/>iPad Air and newer<br/>iPad Mini 2 and newer<br/>iPod Touch 6th gen and newer<br/><br/>-Applicable OS-<br/>iOS 8.0 and higher", "metacritic": null, "released": "2016-11-03", "tba": false, "updated": "2019-10-22T14:29:52", "background_image": "https://media.rawg.io/media/screenshots/d33/d3351adb7eaea1b185324d9e95727122.jpeg", "website": "http://www.jp.square-enix.com/guardian-codex/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Square Enix"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": "Teen"}