{"id": 82173, "slug": "winter-logging-truck-simulator-3d", "name": "Winter Logging Truck Simulator 3D", "name_original": "Winter Logging Truck Simulator 3D", "description": "Get a logging truck and become a professional driver in winter!<br/><br/>Feel like a real worker! Load and drive your timber cargo and be fast, other timber workers are waiting for logging truck. Drive across winter roads in the simulator. Earn money and upgrade your timber truck. Test your logging truck driving skills in winter with the simulator. Use a timber crane to load and unload logs to your logging truck. Drive carefully and don't lose your cargo in the big winter forest. Deliver your timber cargo. Fight with offroad terrain in the simulator. Test the power of logging truck. It is great logging truck simulator! Drive and don't lose your timber cargo.<br/><br/>Features of Winter Logging Truck Simulator:<br/><br/>- Powerful timber truck<br/>- Winter terrain simulator<br/>- Cargo missions and freeride<br/>- Easy drive controls<br/>- Forest locations simulator<br/>- 3D graphics<br/>- Real timber truck sounds<br/><br/>Get ready for challenging winter missions. Even if you can't drive in real life, you can drive a timber truck in the Winter Logging Truck Simulator. Explore winter forest and enjoy the logging truck simulator atmosphere. It is not easy simulator. Learn how to drive a logging truck and carry your timber cargo in winter. Do you like cargo games and driving? So, it is time to drive in Winter Logging Truck Simulator. Drive to feel the power of timber truck. Drive in winter without roads, it is a great cargo truck simulator for real men!<br/><br/>Complete logging deliveries. Try to transport timber cargo in winter, race your timber truck and be accurate! Logging guys don't like waiting for cargo. Drive to destination point. Drive like a timber truck driver with our simulator. Finish all logging cargo missions.<br/><br/>Today is the best day to drive a cargo truck with our logging truck simulator. Load and unload your timber truck with cargo. Then drive your logging cargo in winter. Complete missions in the simulator and enjoy the winter offroad. Drive your cargo in timber truck and earn money. Then upgrade to drive cargo faster.<br/><br/>Test the power of big timber truck with Winter Logging Truck Simulator!", "metacritic": null, "released": "2016-07-14", "tba": false, "updated": "2019-10-22T13:56:59", "background_image": "https://media.rawg.io/media/screenshots/7a2/7a2806c13518852b1230e43a889c5b5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": "Teen"}