{"id": 82184, "slug": "tow-truck-driving-simulator-3d", "name": "Tow Truck Driving Simulator 3D", "name_original": "Tow Truck Driving Simulator 3D", "description": "Drive your tow truck and transport cars that are illegally parked in the simulator. Use a tow mechanism to hook them. Transport vehicles to the parking place and earn money. Upgrade your tow truck to drive more accurate and tow all the cars in time.<br/><br/>Look for bad car drivers who parked their transport wrongly. There are a lot of them in the simulator! Your mission is to drive and transport to keep the law. At the beginning of the simulator your tow truck is slow and heavy. Upgrade your truck to drive faster and transport all cars in time.<br/><br/>Features of Tow Truck Driving Simulator 3D:<br/><br/>- Challenging missions<br/>- Tow mechanism simulator<br/>- Easy tow truck controls<br/>- Tow truck upgrade<br/>- Different locations<br/>- Many cars to transport<br/><br/>If you don't know what to do today - drive a tow truck! Transport as a policeman. Test your skills, drive a truck in the simulator. Upgrade your transport and open new levels. Drive through simulator's locations and find all cars to transport them. Don't hit other transport.<br/><br/>Drive, park and transport! It is not an easy simulator, but funny and challenging. Drive and follow arrows to find cars, park near them, hook by the tow mechanism and transport. Become the best tow truck driver. Even you can't drive in real life, you can drive a tow truck in the transport simulator. Drive all cars in time.<br/><br/>It is not easy to drive in the transport simulator! But there are simulator's arrows, pedals, tow mechanism and a lot of vehicles to drive. Each truck is unique, find your strategy to drive the car. You need to transport the vehicles in the simulator by your tow truck quickly.<br/><br/>Kick away from the simulator's city all illegally parked transport! You are a policeman. Train yourself, learn how to drive a tow truck and transport all vehicles in the simulator. There are a few cameras in the Tow Truck Driving Simulator to help you drive.<br/>If you like vehicles, we made this tow truck simulator for you!<br/><br/>Try Tow Truck Driving Simulator, help the police to keep the order.", "metacritic": null, "released": "2016-07-24", "tba": false, "updated": "2019-10-22T14:31:09", "background_image": "https://media.rawg.io/media/screenshots/720/720961deb0f2c58a5b262d4c2153e00f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}