{"id": 821850, "slug": "dance-to-the-dice", "name": "Dance To The Dice", "name_original": "Dance To The Dice", "description": "<p><strong>PRESS SPACE BAR TO BEGIN PLAYING</strong></p>\n<p>This game was made by George Cheal using GDevelop5 for the GMTK 2022 game jam (theme: \"Roll of the Dice\").</p>\n<p>DANCE TO THE DICE is played entirely with the space bar. Every four beats, a random number between 1 and 4 will appear on the Disco Die. You must press <em>and then release</em> the space bar in time with the beats to make your Beat Count increase. Make your Beat Count match the Disco Die number and wait for the Rhythm Count in the top left to reach its fourth beat and a new number will be generated on the Disco Die.</p>\n<p>IMPORTANT:</p>\n<p>This game is <em>very</em> rhythmically demanding and will get faster as you play, so keep to the rhythm and don't get distracted! To make sure you don't miss your cue, be ready with the space bar <em>as soon</em> as the Disco Die is about to prepare a new number! Release the space bar too early, too late, too many times or not enough times and you lose a Chance (tallied in the top right of the screen). When you run out of chances, the game resets and you'll have to try for a new score.</p>\n<p>FUN FACT:</p>\n<p>This was my first game I ever made using GDevelop5 as a branching off point from Unreal Engine, go me! (Didn't quite have time or knowhow for a permanent save high score system tho lol)</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T11:43:44", "background_image": "https://media.rawg.io/media/screenshots/b1b/b1b637c36d5edf307db4f877f3680909.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["The Bonsai Treehouse"], "genres": [], "publishers": [], "esrb_rating": null}