{"id": 821860, "slug": "dicesurviver", "name": "DiceSurviver", "name_original": "DiceSurviver", "description": "<p>Roll Your Dice And Try To Survive 50 Rounds!</p>\n<p>Wish you GOOD luck in this game<br/></p>\n<p>some tips:</p><p>Use WSAD for moving, it will attack when there is an enemy in the moving position, or open the treasure chest when there is a treasure chest in the moving position. Moving needs to consume the action points corresponding to the target location (this value is displayed on the target grid), and attacking and opening the treasure chest need to consume 2 action points.</p>\n<p>At the beginning of each round, all action dice will be rolled to determine how many action points there are in this round. </p><p>When attacking, all attack dice will be rolled to determine the damage caused by this attack. </p><p>After opening the treasure chest, you can choose a position to put the new dice in, or give up the dice to restore the life value of the dice. The life value is the red bar displayed in the lower left corner, and the game ends when the life value returns to zero</p>\n<p>来点中文说明：</p><p>WSAD移动，当移动位置上有敌人时会进行攻击，当移动目标位置上有宝箱时会打开宝箱。移动需要消耗目标位置对应的行动点（这个数值显示在目标地格上），攻击和开宝箱需要固定消耗两点行动点。空格直接跳过当前回合</p><p>每回合开始时会投掷所有的行动骰子来确定这回合有多少行动点，攻击时会投掷所有的攻击骰子来确定这次攻击造成的伤害。打开宝箱后可以选择一个位置把新骰子放进去，或者放弃该骰子恢复该骰子面数的生命值，生命值是显示在左下角的红色条，生命值归零则游戏结束</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T11:49:09", "background_image": "https://media.rawg.io/media/screenshots/d11/d11b9af450026111472be1e6fc320ee7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Duby_Kun"], "genres": [], "publishers": [], "esrb_rating": null}