{"id": 82190, "slug": "comic-boy", "name": "COMIC BOY", "name_original": "COMIC BOY", "description": "Dash. Jump. Flip. Play The Best Action Platformer Game With Comic Book Art Style<br/><br/>PLAY THE BEST PLATFORMER GAME WITH COMIC BOOK ART STYLE ON MOBILE<br/><br/>You are trapped inside the inkful pages of a comic book. Find your way out of the pages and escape the comic book! But beware for the many different traps, challenges and environment which can end your quest too soon. Are you ready to help Comic Boy escape?<br/><br/>Jump and dodge your way through danger in this rhythm-based action jumper! <br/>DASH as fast as you can!<br/>JUMP over snakes, zombies and sharks.<br/>DODGE the oncoming Vultures, Ghosts &amp; Hurricanes!<br/>COLLECT all the different coins<br/><br/>ONE FINGER TAP AND SWIPE CONTROL!<br/>You do not need complicated controls to play Comic Boy. Tap to make your character jump. Swipe to perform a special action such as power stomps, saltos, backflips and even flying kicks. Simple control makes Comic Boy to be easily picked up by anyone.<br/><br/>GENEROUS NUMBER OF LEVELS TO PLAY!<br/>Starting out in a jungle, your dash adventure to find your way out continues onto the BEACH, DESERT, GOLD MINE and more! Each environment has their own set of enemies and traps. They will become progressively more and more difficult as you venture deep into the comic book. All levels are autogenerated every time for optimised replay value.<br/><br/>COMPETE WITH YOUR FRIENDS!<br/>Completing each level may be easy enough. But can you be the quickest and score the most points at the same time? Compare your total score with your opponents and other Comic Boy players globally! Compete for that bragging rights.<br/><br/>UNLOCK THE CHARACTERS!<br/>Comic Boy is not the only person trapped in the comic book. Help ParkourGirl, Foxy and Ninjoe dash and escape the page as well. Each character has their own distinct special move and trait. Give them a try and you will find out that each chararacter gives you a unique experience for every level.<br/><br/>ROCKIN' MUSIC BY REAL ROCK MUSICIAN!<br/>Awesome rockin' music goes along with your adventure. A real rocker musician helps us to come up with the catchy music for our game.  <br/><br/>WANT MORE?<br/>Dash and complete Comic Boy and find out more!<br/>Comic Boy is loosely influenced by the retro game by Sega, Comix Zone. If you are a fan of Comix Zone, Comic Boy might be one for you to download and try.<br/><br/>Official Page: http://playplayfun.com/comic-boy-game-official-page/<br/>Like: https://www.facebook.com/comicboy/<br/>Follow: https://twitter.com/ComicBoyGame<br/><br/>Comic Boy is completely free to play. You will be able to complete the game without any purchases. However, there are optional in-app purchases available in case you need it.", "metacritic": null, "released": "2018-05-01", "tba": false, "updated": "2019-07-30T07:52:53", "background_image": "https://media.rawg.io/media/screenshots/d45/d4597bdd63cc1b3895843cb79e631b1d.jpg", "website": "http://playplayfun.com/comic-boy-game-official-page/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FredBear Games"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["FredBear Games"], "esrb_rating": null}