{"id": 822326, "slug": "dice-rush", "name": "Dice Rush", "name_original": "Dice Rush", "description": "<p>Made for the GMTK Game Jam 2022.<br/></p>\n<p>You are a dice and must get to the end of the level. However, in most levels, your movements are completely random. However, to counteract this, you can use a safe move so your next move is guaranteed to be what you select, but you only have a limited quantity of them. Can you get to the end?</p>\n<p>Controls:</p>\n<ul><li>Use the arrow keys to move.</li><li>Press space to use a safe move.</li></ul>\n<p>Mechanics:</p>\n<ul><li>Every level changes what numbers you can roll, look at the top left to see what numbers you can roll. For example, if it says 1-3, you can roll a 1, 2, or 3.</li><li>You get safe rolls throughout the game. If you use a safe roll with the number 1, you are  guaranteed to move 1 space on your next move. You sometimes start with safe moves, and other times you have to collect them.</li><li>If you move off the ground you lose immediately.</li><li>At some point you will encounter spikes. Passing through them is fine, but if you land on one, it's over.</li><li>You will eventually encounter speed goo. If you land on it, you will move double the normal amount on your next move.</li></ul>\n<p>Credits:</p>\n<ul><li>A.J.: Code, Art.</li><li>Shawn: Music.</li><li>The name was generated by Game Name Generator.</li><li>The font is Raleway Medium and made by The League of Moveable Type.</li></ul>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T15:20:26", "background_image": "https://media.rawg.io/media/screenshots/93d/93d5bcbd95cd0bddb6eb895d763c142d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Shawn and A.J."], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}