{"id": 82235, "slug": "take-it-easy", "name": "Take It Easy", "name_original": "Take It Easy", "description": "It’s a puzzle, it’s a brain teaser and it’s a game! It’s all three and much more! It is bingo with strategy! Place your pieces one at a time on the board. To score points, try to form continuous rows of the same color from edge to edge. But one wrong tile and the whole row is worthless. It gets harder as the number of empty spaces on your board, and your possible choices, diminish. Because once a tile is placed, it can’t be moved!<br/><br/>Take It Easy is a simple, yet surprisingly addictive and thought-provoking game that will give you endless hours of fun.<br/><br/>Features:<br/><br/>• Three entertaining and visually beautiful game modes:<br/> <br/>- Classic Mode: introduces you to the game that started it all.<br/> <br/>- Puzzle Mode: test your puzzle solving skills with 140 fun and well-designed puzzles. This exciting new twist to the game will have you swapping pieces in your sleep.<br/><br/>- Progressive Mode: Offers 30 stages of different challenges. Conquer all stages before time runs out!<br/><br/>• Local &amp; online multiplayer: Play head-to-head against a friend. Or up to four players on a single iPad! Or play online with friends around the world.<br/><br/>• Game Center integration lets you compare high scores with your friends and players around the world. Will you be Number 1 on the leaderboard?<br/><br/>• Over 40 different achievements: Earn points to get that #1 rank!<br/><br/>• Stunning high-resolution graphics!<br/><br/>• Already over two million fans are enjoying the award winning board game!<br/><br/><br/>148apps.com<br/>4/5 – „Addictive puzzle mechanics and infectiously fun challenges make Take It Easy an unexpected runaway success.”<br/><br/>Appadvice.com<br/>„If you are looking for a great puzzle game to pick up this week, then I highly recommend giving Take It Easy a try. You won’t be disappointed.”<br/><br/>Boardgamegeek.com<br/>4/5 – „A fun puzzle game”<br/><br/>Touchgen.net<br/>4/5 – „Take It Easy is a fun board puzzle game with a lot of content, and great", "metacritic": null, "released": "2012-10-18", "tba": false, "updated": "2019-07-30T06:48:31", "background_image": "https://media.rawg.io/media/screenshots/fea/feab8470078d3e40087d823ab21c1e33.jpg", "website": "https://www.ravensburger.de/start/ravensburger-apps/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Ravensburger Digital", "Ravensburger"], "genres": ["Board Games", "Puzzle"], "publishers": ["Ravensburger Digital"], "esrb_rating": "Everyone 10+"}