{"id": 82234, "slug": "omar-sharif-bridge", "name": "Omar Sharif Bridge", "name_original": "Omar Sharif Bridge", "description": "Welcome to the 2019 edition of Omar Sharif Bridge.<br/>Featuring a faster and smoother user interface along with a stronger state of the art artificial intelligence engine, the 2019 edition celebrates over 36 years of us bringing you the best in Bridge card games.<br/><br/>Omar Sharif Bridge supports 2 variants of the game of Bridge: Rubber and Chicago Bridge.<br/><br/>Bridge is played by four players who form two partnerships. Players within a partnership face each other across the bridge table. Traditionally, the players are referred to by the points of the compass - North, East, South and West. The two partnerships are North/South and East/West. <br/><br/>In Rubber Bridge a rubber is played as the best of three games. A game is won by the first partnership to score 100 or more points in successful contracts.<br/><br/>In Chicago Bridge you play four hands of Bridge. The winner is the partnership that scores the most points in those hands.<br/><br/>A huge thanks to all those who have taken the time to contact us with suggestions, comments and criticisms!, please keep them coming. <br/><br/>Omar Sharif Bridge features:<br/>• Supports 5 card majors, strong 2 clubs, weak 1NT, Jacoby Transfers, weak 2-Bids and 2NT 11-12 points bidding conventions.<br/>• Plays Chicago (four-deal) and Rubber Bridge.<br/>• Extensive score card information.<br/>• Ability to locate deals matching many bidding criteria.<br/>• Auto bidding.<br/>• Bid analysis to explain the bids made.<br/>• Auto card play.<br/>• Full undo and redo of bids and cards played.<br/>• Extensive display and card play options", "metacritic": null, "released": "2009-02-17", "tba": false, "updated": "2019-07-30T08:31:25", "background_image": "https://media.rawg.io/media/screenshots/c9d/c9d62f99d2416a955f0b90931385d48b.jpg", "website": "http://www.zingmagic.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ZingMagic"], "genres": ["Strategy", "Card"], "publishers": ["ZingMagic"], "esrb_rating": null}