{"id": 82243, "slug": "blackjack-101-basic-strategy-trainer", "name": "BlackJack 101- Basic Strategy Trainer", "name_original": "BlackJack 101- Basic Strategy Trainer", "description": "BlackJack 101 is a basic strategy trainer for the game of Blackjack. <br/><br/>Reviewers on the App store call this the best Blackjack trainer app out there.<br/><br/>WARNING: This is *not* a Blackjack game, it its a practice aid for learning basic strategy in Blackjack. It deals hands and lets you practice choosing the best strategy. It has 3 modes and 4 skill levels to let you focus on different types of hands. <br/><br/>With version 3.2 we are introducing, in-app purchase of an upgrade which removes banner ads and enables a new feature: Custom Hands training mode. in this mode you can choose any combination of player hands and dealer up-cards to practice. Only want to practice soft hands against a dealer's 6? No problem. Or practice soft 14s-16s vs. any dealer card? Easy. Or get fancy and practice a hard 15 or 16, soft 13 or a pair of 4's vs. any dealer card over 5. Any combo you can imagine. <br/><br/><br/>Features: <br/><br/>- Four learning modes: random hands, soft hands, pairs, and a new Custom mode: choose any combination of hands to practice (paid upgrade).<br/><br/>- Customize the house rules: number of decks in the shoe, hit vs. stand on soft 17, doubling rules and surrender<br/><br/>- Skill levels: Higher levels concentrate your training on the harder-to-memorize hands <br/><br/>- Strategy guide shows all the best moves and highlights the strategy for the current hand and dealer card<br/><br/>- Left-handed and right-handed playing layouts <br/><br/>- Many different rule configurations (1-4 decks, dealer hits/stays on soft 17, double after split, early/late surrender) <br/><br/>- Keeps track of your stats: hands played, choices made, and percent of correct guesses", "metacritic": null, "released": "2009-12-29", "tba": false, "updated": "2019-10-22T14:22:37", "background_image": "https://media.rawg.io/media/screenshots/89c/89c23837b92c04a8497b4ec5f7c7151f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["David Richmond"], "genres": ["Card"], "publishers": ["David Richmond"], "esrb_rating": "Teen"}