{"id": 822457, "slug": "dice-of-fate-philip-and-marta", "name": "Dice of Fate (Philip and Marta)", "name_original": "Dice of Fate (Philip and Marta)", "description": "<p><em>Join the story as our intrepid Hero continues his harrowing quest for the Dice of Fate!\r\nAfter braving the infernal fields of Dagol, the poisonous swamps of Mortlug and the treacherous \r\n</em></p>\n<p><em>fields of Lavandia, our hero’s quest continues.\r\nLegends state that thunder is made when the Gods slam their hands on their heavenly table while they play with the dice of fate! Our hero is here to separate dice from fiction! But this time there is no nocturnal dungeon to clear, no cursed mountain to summit and no one big bad enemy to slay. Our hero must provoke the Gods into their games, so he can see the dice and their mighty thunder by doing the only thing he does well: ridding the land of monsters!\r\nWe join our Hero on the road fraught with peril… one thing is certain.  \r\n</em></p>\n<p><em>It's a good day to dice.</em></p>\n\n\n<p><strong>Controls:</strong><br/>SPACEBAR - to smash the table and start a new turn<br/>RMB - to pick dice and deal damage</p>\n<p>Every time you roll your dice <em>(of Fate)</em> new enemies spawn on the board. Number on each die represents the damage you can deal this turn. RMB on the die of choice and then on the enemy to attack! :) <br/><em>Get the enemies before they get you or you are going to get sliced and diced!</em></p>\n\n\n<p><strong>Lean Mean Game-Making Machine<br/></strong>Filip - Jammin'<br/>Nikola - Programmin'<br/>Vaso - Supporitn'<br/>Arsen - Statistin'<br/>Marta - Artin'<br/>Damjan - Writin' and Partyin'<br/><br/>Sound assets downloaded from freesound.org. Special thanks to original creators: MaxDemianAGL, passAirmangrace, ralexpdx and quadraslayer<br/><br/>Background music \"Peaceful Tavern\" from ablum Venture Forth by Ivan Duch</p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T16:16:10", "background_image": "https://media.rawg.io/media/screenshots/f14/f1410a749ed4b3d6b186b2fe6af4a03e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Philip and Marta"], "genres": [], "publishers": [], "esrb_rating": null}