{"id": 822544, "slug": "combat-roll", "name": "Combat Roll", "name_original": "Combat Roll", "description": "<p>Take turns against a PC opponent to pick up (LMB hold) and roll (LMB release) dice. Your dice are red, the enemies are blue. </p>\n<p>When you roll a die towards enemy dice, it will do damage to them equal to the roll. The HP of both you and your opponents dice is shown as the value on the die.<br/></p>\n<p>Once the die has finished rolling, it will then use an ability. At the start of each game you are given 3 die with different abilities. These abilities are shown by a letter above the die and the details can be seen while holding each die.</p>\n<p>The winner is the player who destroys their opponents die first. </p>\n<p>Note: There are currently no menus, sound effects or music. There is only one map. At the end of a game, it immediately resets to another one. These are all things I had hoped to sort out before the end of the jam, but didn't have time :P</p>\n<p>List of abilities:</p>\r\nNameDescriptionSnipeDeal 2 damage to a random enemy die in line of sight.BashDeal an extra 1 damage to nearby enemy dice.Heal<br/>Heals a random friendly die in line of sight for 3.<br/>FearDice hurt by this die cannot use their Basic Attack on their next turn.ProtectNearby allies take 50% damage from all sources until their next turn, rounded down.\r\n<p>If you encounter a bug, please tell me so I can get it ironed out as quickly as possible :D</p>\n<p>The tileset and dice sprites are from Kenney asset packs: https://kenney.nl/assets/ </p>", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-19T16:53:03", "background_image": "https://media.rawg.io/media/screenshots/306/306170f24b4137b228052a3cbfd83795.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Josh Kitchen - Games Programmer"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}