{"id": 82266, "slug": "network6", "name": "Network6", "name_original": "Network6", "description": "Network6 is a board game played with Black and White pieces, you may <br/>- single play against the computer<br/>- double play with another player on the same screen <br/>- play against another player on the WIFI network<br/>- play against another player on Game Center over the Internet<br/><br/>Each player has 10 pieces of its own color (Black or White) to put on the 8x8 board. Black has the top row, bottom row goal areas; and White has the left column and right column goal areas.   The first player who can establish a network linking its two goal areas wins the game.  A network is a series of six of more pieces that starts from one goal areas and ends in the other.  Each consecutive pair of pieces in the series are joined to each other along either horizontal, vertical or diagonal straight paths.  <br/>An opponent's piece placed in any cell on the path between the two pieces breaks the path.  Although more than one piece may be placed in a goal area, a network can only be made with a starting piece in one goal area and an ending piece in the other goal area.  A network cannot utilize pieces from the same goal area.   A network cannot go through a piece more than once. <br/><br/>A network cannot go through a piece without turning. Paths that has no change in direction cannot be part of the network .<br/>The players alternate taking turns, with White moving first.  Rules of legal play are:<br/>- The four corners are not played<br/>- Cannot place a piece into a cell that is already taken<br/>- The opponent's goal areas are off-limits<br/>- Cannot place a piece into a cell that would result in three or more of its own color pieces form adjacent cluster.   A group of three pieces form a cluster if one of them is adjacent (horizontally, vertically or diagonally) to the other two.<br/>Each player takes turns to place the pieces on the board.  If neither player has won when all 20 pieces are on the board, each play takes turn to move a piece to another cell, subject to the same restrictions.   A player must make a move to a different cell.  Lifting a piece may unblock a connection between opponent pieces.  If after the piece is placed at the new location, it breaks the network at some other point, the opponent does not win.  However, if the move completes a network for the opponent, the player making the move loses, even if that move causes both players to complete the network.<br/><br/>Click on the 'Info' button in the game will display the above documentation. <br/><br/>There is also a demo mode that demonstrates the game play.<br/><br/>The practice mode, available for single and double player games, is another good way to learn the game.  In that mode, clicking on the 'Idea' button will make a move for you.", "metacritic": null, "released": "2012-06-10", "tba": false, "updated": "2019-07-30T08:42:58", "background_image": "https://media.rawg.io/media/screenshots/31b/31bb794c97923fd1f6d523f08cf61d72_qF1LG3R.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["POK"], "genres": ["Strategy", "Board Games"], "publishers": ["Pok Wong"], "esrb_rating": null}