{"id": 822623, "slug": "big-break-moving-out-sim", "name": "Big Break [Moving Out Sim]", "name_original": "Big Break [Moving Out Sim]", "description": "It's time to move out of your family home and take the risky move to setup shop in the big city.\r\n<p>Leaving home can be a daunting and risky venture.  During <strong>Big Break</strong>  you take this challenge to leave home and leave your fate up to the<strong> roll of the dice.</strong>..\r\n</p>\r\nGoal\r\n<p>The game has two key phases. The first,  <strong>the preparation phase</strong>, is where you choose the valuables you're going to fill your car up with. You can only take so much so choose wisely between: food, money, medication, and home comforts.\r\n</p>\n<p>The<strong> second phase</strong>, making your mark, sees you complete several challenges (with over 25 possibilities) that will consume your valuables depending on how you answer.</p>\r\nDifficulty\r\n<p>Big Break can be quite hard. At a high level when looking to complete this game it's best to think of it as a resource manager - what resources will you need to get to the end? While the questions may change each run the way that they effect your inventory do not, so keeping a score and log may be helpful.</p>\r\nControls\r\n\r\n<p>Control the main menu with left mouse button to start the game or to mute the volume.</p>\n\n<p>Control the preparation phase with left mouse button to select valuables to add to your car, to randomise those valuables with the roll the dice icon and to continue on your journey with the 'pack up and go' option. Also use right mouse button to remove valuables from your car.\r\n</p>\n\n<p>Control the other menus by using the left mouse button to select an option you want. The 'Roll The Dice' option randomises your decision.</p>\r\n\r\nCredits\r\n<p>Thanks for checking out this game. I made this alone in approximately 28 hours for the GMTK 2022 Game Jam, where the theme was 'Roll of the Dice'. As I worked on this alone I have several assets in this game that are not my own, a special thanks goes to the below people and resources:</p>\n<ul><li>https://janbarboza.itch.io/foods-potions-and-coins</li><li>https://reakain.itch.io/kitchen-assets</li><li>https://brokenvector.itch.io/low-poly-brick-houses</li><li>https://github.com/Gonkee/Gonkees-Shaders/blob/master/fog.shader</li><li>https://humblepixel.itch.io/super-asset-bundle-4-books-ui</li><li>https://mounirtohami.itch.io/dice-pack</li><li>https://l4m0s.itch.io/low-poly-city-pack</li><li>https://gamedeveloperstudio.itch.io/cardboard-box-backdrop</li></ul>", "metacritic": null, "released": "2022-07-16", "tba": false, "updated": "2022-07-19T17:27:00", "background_image": "https://media.rawg.io/media/screenshots/82e/82e2c6316230fb0b0ccb66dac7163d90.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Beam Logs"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}