{"id": 8227, "slug": "knights-of-puzzelot", "name": "Knights of Puzzelot", "name_original": "Knights of Puzzelot", "description": "Go on an epic fantasy adventure – one puzzle at a time! Play a puzzle to battle monsters, find treasure, and collect items for your hero. Help rebuild the Kingdom of Puzzelot, and defend it from dragons and other legendary beasts!<br/><br/>QUICK AND SIMPLE TO PLAY! Swipe to match 3 swords to battle monsters or match 3 shields to defend your hero.<br/><br/>CREATE YOUR OWN HERO! Find and collect hundreds of unique items to customize and improve your hero.<br/><br/>BEGIN YOUR ADVENTURE! Brave 50+ levels filled with dangerous monsters and rare treasures.<br/><br/><br/>·     Knights of Puzzelot combines a match-3 puzzle with a colorful fantasy RPG that’s free to play.<br/>·     Exciting turn-based puzzle play that’s easy to learn, challenging to master.<br/>·     Defeat monsters in puzzle-combat: magic weapons, whirlwinds, and fireballs change the puzzle as you play.<br/>·     Hundreds of unique items: find or craft matching sets for powerful bonuses, and make the ultimate knight!<br/>·     50+ levels of puzzle adventure with unique monsters and treasures. Find new treasures in old levels to collect even more!<br/>·     Build and upgrade the town with blacksmiths, training dojo, merchant and more to aid in your quest.<br/><br/><br/>facebook.com/Puzzelot<br/>facebook.com/GluMobile<br/>Twitter @GluMobile<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com/privacy<br/>- If you have a problem with this game, please use the game’s “Help” feature.", "metacritic": null, "released": "2014-05-07", "tba": false, "updated": "2019-10-22T14:29:52", "background_image": "https://media.rawg.io/media/screenshots/2b8/2b870516d25578737e014f2816068eea.jpeg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Glu Games"], "genres": ["RPG", "Puzzle"], "publishers": ["Glu Games"], "esrb_rating": "Teen"}