{"id": 82287, "slug": "word-search-soccer-lite", "name": "Word Search Soccer Lite", "name_original": "Word Search Soccer Lite", "description": "+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br/>THE ONLY SOCCER THEMED WORD SEARCH PUZZLE ON THE APP STORE!<br/>SLICK AND EXCITING! From the makers of the super blockbuster game - Slot Machine!<br/>Try this 'Lite' version NOW! Lots more unique puzzles and categories, multiple difficulty modes and more.....<br/>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++<br/><br/>Word Search Soccer is the latest and the most exciting word search game to hit the App Store! Play unlimited, super exciting word search puzzles built around the upcoming FIFA World Cup of Soccer (Football). Slick user interface, cool soccer field theme, online leaderboards and well crafted soccer word lists to challenge you to beat the clock! Come and test your soccer skills!!<br/><br/>** Top Features of the 'Full' Version **<br/>- 7 handcrafted crafted large word lists built around the upcoming Soccer World cup. There is sure to be fresh content everyday!<br/>- Slick word selection using finger slide OR end letter tap-tap.<br/>- Local scoreboard/Statistics to keep track of your progress<br/>- Two difficulty levels with differential scoring to keep the leader boards buzzing!<br/>- Real time hints just in case you get stuck on a word. But BEWARE! using hints will disqualify you from getting the time bonus!<br/>- Online global/regional leader board to compete with other iPhone/iTouch/Android users.<br/>- Share your achievement and personal best times with friends on Twitter and Facebook<br/>- Cool graphics and sounds to keep you engaged.<br/><br/>** Word Lists (Paid App Only) **<br/>- Soccer Clubs<br/>- Celebrities &amp; Legends<br/>- Players and Coaches<br/>- Fifa Nations<br/>- Sponsors &amp; Owners<br/>- Potpourri<br/>- Soccer Buzz<br/><br/>++++ UPGRADE NOW AND EXPERIENCE FIFA WORLD CUP FEVER !! ++++", "metacritic": null, "released": "2010-06-23", "tba": false, "updated": "2019-10-22T14:22:38", "background_image": "https://media.rawg.io/media/screenshots/206/206d082550a4f6d8d55541ed4005f6a8.jpg", "website": "http://apostek.com/apps/iphone", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Apostek Software"], "genres": ["Sports"], "publishers": ["Apostek Software"], "esrb_rating": "Everyone 10+"}