{"id": 822812, "slug": "black-hole-escape-idunno-dev", "name": "Black Hole Escape (idunno dev)", "name_original": "Black Hole Escape (idunno dev)", "description": "<p>Black Hole Escape started as a uni team project for this past semester, once the year was over, I decided to rewrite and change a bunch of the game into version 0.2.0 so that I could use it for my portfolio.\r\n  </p>\n<p>The concept was originally to reimagine the game joust, which over a lot of thinking we created a space game, I kept the core idea in that its somewhat of a precision-based arcade game. Attacks from above will kill the enemies (like in joust).\r\n  </p>\n<p>I redesigned the UI, cleaned up and rewrote the code and added a bunch more gameplay features, the main being the 3 ability cores:\r\n  </p>\n<ul> <li>The      Magnet core allows the player to pull and push objects around them, you      can pull enemies into your kill zone, or push mines into groups of enemies      to destroy them all.\r\n  </li><li>The Hunter      core allows the player to cycle through targets and charge towards them,      whilst charging the player is invulnerable allowing you to both escape and      rush towards dangers to kill enemies.\r\n  </li><li>The      Drop core allows the player to initiate an instant drop killing anything      directly below until the power ends, they can also do a power assisted      jump which will throw the player directly above killing any enemies in the      way.\r\n </li></ul>\n<p>A score was added, which i would like to do more with in the future, I have to work on other projects for the moment but things i am planning on working on in future are:\r\n  </p>\n<ul> <li>An      Offline and Online High score system.\r\n  </li><li>Another      2 ability cores i already have planned out.\r\n  </li><li>A      handful of challenge modes I’ve been thinking of\r\n </li></ul>\n<p>If you hit any bugs, I’d be interested in hearing about them!\r\n</p>", "metacritic": null, "released": "2022-07-16", "tba": false, "updated": "2022-07-19T18:46:09", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fb7864034cfcfbc454822b174116daa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["idunno dev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}