{"id": 82294, "slug": "mr-lumas-juice-bar-free", "name": "Mr. Luma's Juice Bar (Free)", "name_original": "Mr. Luma's Juice Bar (Free)", "description": "Mr. Luma’s Juice Bar just opened at Sunny Beach! <br/><br/>The sun is shining and your furry friends are waiting to be served a delicious Juice on this beautiful summer day. Let your imagination run wild in your fully equipped Juice Bar and discover the many ways to decorate your juice, the choices are endless.<br/><br/>Explore your own garden, filled with all kinds of fruits and healthy vegetables ready to be mixed, blend and served for your friends!<br/><br/>KEY FEATURES<br/>* Grow your own fruit and vegetables!<br/>* Create a wide variety of different delicious Juices!<br/>* Prepare and serve drinks for all your furry animal friends!<br/>* Decorate and make your Juice beautiful!<br/>* Earn rewards and discover a big collection of decorations!<br/>* No in-app purchases !<br/><br/>For more updates follow us on Twitter: twitter.com/mrluma or like us on Facebook: Facebook.com/mrluma.<br/><br/>Privacy policy<br/>Privacy is an issue that we take very seriously. To learn more about how we work with these matters, please read our privacy policy: http://www.mrluma.com/<br/><br/>If you’d like to know more about us please visit our website www.mrluma.com If you have any questions feel free to send us an email at support@mrluma.com or contact us on Facebook (www.facebook.com/mrluma)", "metacritic": null, "released": "2017-03-14", "tba": false, "updated": "2019-10-22T14:22:38", "background_image": "https://media.rawg.io/media/screenshots/a08/a08a535b94d7fc03113074ef7a0d3b9e_ZLv23Kl.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Qilin Cheng"], "genres": ["Family"], "publishers": ["Qilin Cheng"], "esrb_rating": "Everyone 10+"}