{"id": 823189, "slug": "kids-show-maintenance", "name": "Kids Show Maintenance", "name_original": "Kids Show Maintenance", "description": "<p><strong>ORIGINAL FROM GAMEJOLT</strong><br/></p><p>kids show maintenance is my attempt at a horror game based on old 70's-90's live action kid shows inspired by a line from Nostalgia Critic. and me trying to attempt horror games from 2010 to 2014, feel free to give some constructive criticism, thank you.\r\n</p>\n<p>DISCLAIMER: despite the title this game should not be played by those under the age of 15, this game may be found as disturbing for some.\r\n</p>\n<p>game over music by kevin macleod\r\n</p>\n<p>STORY:\r\n</p>\n<p>in this game you play as a unnamed intern who was slacking off during work. and the boss was so sick of the slacking that he was thinking of letting him go. but after begging, the intern is allowed one last chance, at the strike of midnight he will come to work and complete 9 tasks for a couple of kids shows they need to get done for tomorrow then he can go home, shouldn't be too hard right?....right? <br/></p><p>it is rough around the edges things are not the highest quality, but i had a good time with it, its simple and sometimes thats the best thing a game could be-th3badd3st</p><p>Hey hey there! I had amazing experience with this game, except in basement with doll/demon, he is kinda creepy. Jokes aside, game is noice, scary and it has creepy ambience without any music but just sound effects.-StexyTo</p><p>You really have the potential to make something big, and the effort you've put in making this game is already something to be proud of. I believe in you, we all do. Don't stop being awesome and have a great day!-Withertrav394<br/><br/></p>", "metacritic": null, "released": "2022-07-15", "tba": false, "updated": "2022-07-19T21:24:25", "background_image": "https://media.rawg.io/media/screenshots/8a1/8a1f17845004b9a2d9dab222e540fbbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TTS"], "genres": [], "publishers": [], "esrb_rating": null}