{"id": 823180, "slug": "dicey-towers-gmtk2022", "name": "Dicey Towers (GMTK2022)", "name_original": "Dicey Towers (GMTK2022)", "description": "<p><strong>CONTROLS:</strong><br/><strong>WASD/Arrows t</strong>o move camera (<strong>hold shift</strong> for faster camera movement)<br/><strong>Left click </strong>on dice and drag to aim. Release to roll dice<br/><strong>Left Click and Drag  </strong>to select multiple dice to attack with<br/><strong>Right Click</strong> a die to hold it in your bank for future use<br/><strong>Right Click and Drag  </strong>to reposition dice. You can drop them into your dice bank at the bottom or drop into a dice tower to purchase upgrades<br/><strong>Middle Click </strong>or <strong>Space </strong>to select all dice to attack with<br/><strong>R </strong>to reroll dice on the field<br/><strong>F</strong>  to pickup all dice to be held</p>\n\n<p><strong>H</strong><strong>ow to Pla</strong><strong>y:<br/></strong>The evil cards are invading and the only way to stop them is with the power of dice of course!  Roll dice towards the enemy to attack. The higher the number on the die, the stronger the next attack will be.  Use the dice towers to your advantage by rolling the required dice indicated and dropping them into the top of the tower (by dragging/dropping dice with Right Mouse button). Doing so will earn you one of the upgrades listed below. Defeat each wave of cards before they reach the crystal and shatter it!</p>\n<p><strong>Upgrades:</strong></p>\n<ul><li>Drop a number of 1 dice into the extra die tower  to earn additional dice.<br/></li><li>Drop a 6 into a PIERCE tower to upgrade to the pierce powerup.  This will attack through the number of enemies as the die currently shows. Hitting an enemy will expend the PIERCE powerup so feel free to reroll before attacking to strengthen the die.</li><li>Drop three 6's into the SLOW tower to temporarily slow  the enemy's advance for a minute.</li></ul>\n<p>Use a combination of all the controls and powerups available to stop all 5 waves! Or try endless mode [not tested :)] </p>\n<p><strong><br/>Now go defend the sacred crystal die and stop the evil  invading cards!</strong></p>\n\n<p><strong><br/>Created by SzechuanSteve </strong><br/><strong>Music by Timothy Przybylinski<br/>--------------------------------------<br/>This was a submission for the 2022 GMTK game jam. All art, sounds, music, and code were  designed and created within a 48 hour period. </strong></p>", "metacritic": null, "released": "2022-07-15", "tba": false, "updated": "2022-07-19T21:20:51", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2d44c6747cb95bcb728aa87ce8668b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["SzechuanSteve"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}