{"id": 823292, "slug": "the-bread-game", "name": "The Bread Game", "name_original": "The Bread Game", "description": "<p>We are NOW releasing The Bread Game to Mac and Windows!</p>\n<p>This is not your usual cutesy adventure game...</p>\n<p>This is secretly a SUPER complicated Adventure game!</p>\n\n<p>Can YOU SAVE THE BAKER?</p>\n<p>In The Bread Game, you must venture across the land, finding secrets, beating up the culinary objects that keep The Baker captive with your psychokinetic Crouton Cannon, and all in all, having a really fun time trying to saving your friend/creator!</p>\n\n\n<p>WE HAVE:</p>\n<p>A unique Rocket Jumping mechanic you must use to run, jump, and evade through obstacles!</p>\n\n<p>4 unique enemy types:  Forks, Knives, Toasters, and Birds!</p>\n\n<p>3 areas to explore, each one introducing a special environmental secret to discover, and a special boss to slay.</p>\n<p>1 interesting regeneration system, where you only get ONE (full) HEAL to carry around on your adventures.  (You can replace it though.  We don't just give you one heal in the entire game. :}  )</p>\n<p>Self Imposed New Game +!</p>\n<p>You're given challenges you can try to undertake to make the game more interesting with extra run-throughs, or you can just ignore them, and play the game with no extra challenges!</p>\n<p>and, last but not least, a Chiptune soundtrack playing throughout the entire adventure!</p>\n<p>Postscript Message:</p>\n<p>In case you're worrying about brutal difficulty, you don't need to!</p>\n<p>Death is not the end in the Bread Game!  If you fail, you're given a choice to respawn at your last checkpoint, or you can leave the game, and try again later!</p>", "metacritic": null, "released": "2022-07-15", "tba": false, "updated": "2022-07-19T22:07:40", "background_image": "https://media.rawg.io/media/screenshots/84e/84e859e95616927e062e8daa6193c555.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Fancy Fairy Co."], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}