{"id": 823468, "slug": "uta-noprince-sama-all-star-after-secret", "name": "Uta no☆Prince-sama♪ All Star After Secret", "name_original": "Uta no☆Prince-sama♪ All Star After Secret", "description": "<p>&#39;Uta no☆Prince-sama♪ All Star After Secret&#39; (stylization of うたの☆プリンスさまっ♪All Star After Secret) is a rhythmic otome video game made for the PlayStation Portable on March 12th, 2015. Whilst being the ninth entry to be made for the main series, it is also the direct sequel of &#39;Uta no☆Prince-sama♪ All Star&#39;. Unlike before, the game does not have a primary focus on either band, which encourages the player to select the latest routes they would prefer to take; having a more mature theme in mind. It received a special edition from the bundle called &#39;Sweet &amp; Bitter Box&#39;, as well as a remaster for the Nintendo Switch.</p>\n<h2>Description Translation:</h2>\n<p>This game will focus on the 4 senior idols. Combining those 4 with the 7 junior idols from the original series, there will be a total 11 idols with routes! The game is split into two main grand routes; the &quot;Quartet Route&quot;, featuring the 4 seniors, and the &quot;Rainbow Route&quot;, featuring the 7 juniors. Both grand routes are then further divided into the individual idols&#39; routes.</p>\n<h2>~ Quartet Route ~</h2>\n<p>The story of the Quartet Route takes place after the events of Uta no☆Prince-sama♪ All Star. It begins with Nanami Haruka and her chosen partner already as lovers. What is in the future that awaits Haruka and her beloved?</p>\n<h2>~ Rainbow Route ~</h2>\n<p>This will be a story about the 7 juniors, who are now all fully-fledged idols. Like the Quartet Route, the story begins with Haruka and her chosen partner already as lovers. Here, you&#39;ll be able to read stories about her sparkling, happy days spent with her boyfriend, who&#39;s now shining as an idol.</p>", "metacritic": null, "released": "2015-03-12", "tba": false, "updated": "2022-07-19T23:22:04", "background_image": "https://media.rawg.io/media/screenshots/1c0/1c0592337810a33bb459161515887f5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 11, "reviews_count": 0, "platforms": ["Nintendo Switch", "PSP"], "developers": [], "genres": ["Action", "Casual"], "publishers": ["Broccoli"], "esrb_rating": null}