{"id": 823575, "slug": "escape-from-mandrillia-2", "name": "Escape From Mandrillia", "name_original": "Escape From Mandrillia", "description": "Escape from Mandrillia is a <strong>local asymmetric VR vs PC horror</strong> game. A single player using the VR headset takes the role of a robot escaping an underground facility. Up to 2 players at the computer (using either mouse+keyboard or controllers) control the Mandrillians, giant alien monkeys trying to hunt down the VR player.<h3>VR vs PC LOCAL ASYMMETRIC HORROR</h3><strong>VR GAMEPLAY</strong><br/>On the VR side, the gameplay is a survival horror/stealth shooter.<br/><ul><li>Evade the Mandrillians, or face them -just remember the odds are against you!<br/></li><li>Use your battery-powered Multitool to cloak, detect nearby enemies, or stun them if things get hairy.<br/></li><li>Search for any weapon you can get your hands on -there's over 20 unique weapons, from conventional firearms to flamethrowers, crossbows, chainsaws and more!<br/></li><li>Progress by locating keycards and solving minigames to open new sections until you can finally escape</li></ul><br/><strong>PC GAMEPLAY</strong><br/>The PC players control the Mandrillians in third person.<br/><ul><li>Use your monkey senses to track down the VR player<br/></li><li>Quickly move around the map using the air vents<br/></li><li>Psychologically torture the VR player like a true apex predator</li></ul><h3>CUSTOMIZE YOUR EXPERIENCE</h3><br/>Match modifiers let you tweak every single parameter in the game: HP values, the way the PC players respawn, loot styles/progression, monster weakpoint calculations...<br/><br/>The included <strong>Match Presets</strong> are pre-curated clusters of match modifiers you can instantly apply. Think the PC players need a bit of an advantage? Use Mandrillian Bias. Or if you feel too overwhelmed, go for Robot Bias. Maybe you want a full survival horror experience where you start with no weapons and the monsters are almost indestructible? Horror Mode is for you. Or maybe you just want to unwind and let endless hordes of Mandrillians come at you and mow them down with heavy weaponry: Super Soldier got you covered.<br/><br/>You can mix and match all these settings and presets with no restrictions -sky's the limit!<h3>PLAY WITH YOUR ONLINE FRIENDS USING STEAM REMOTE PLAY</h3><br/>Don't want anybody getting their filthy hands on your expensive computer? Not a problem! With Steam Remote Play, you are one invite away from playing with any of your Steam friends!", "metacritic": null, "released": "2022-07-18", "tba": false, "updated": "2022-07-22T04:37:32", "background_image": "https://media.rawg.io/media/screenshots/761/761649f9882fc38bc42c8b23f165b2a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6}, "playtime": 4, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["German Bandera"], "genres": ["Action", "Indie"], "publishers": ["German Bandera"], "esrb_rating": null}