{"id": 823599, "slug": "demons-and-altar", "name": "Demons And Altar", "name_original": "Demons And Altar", "description": "Magic has brought convenience and quickness to human beings and created demons at the same time. All regions of the world have been invaded by demons. To this end, players need to rely on God's blessing, use various magic, and recruit heroes while acquiring resources during the journey, so as to form a unique and powerful team to defeat all kinds of enemies on the way. At the end of the journey, defeat the great demon king and return the world to beauty and stability.<h3> endless journey </h3><br/>Each adventure is very different from the previous ones. Players can choose various blessings and customize the inscriptions of various units. In the battle, choose your own way, spend each unique day and night, meet different enemies and events, choose to fight with different bosses at the end of the journey, and write your own story.<h3> strategies for fighting </h3><br/>Players need to spend several days and nights. In the face of an endless stream of enemies, players should give full consideration to arranging their own resources so that tired heroes can rest and fledgling units can grow. Reasonably allocate units and resources, so that the whole journey can proceed step by step according to your own ideas.<h3> hero team from scratch </h3><br/>During the journey, you can build your own team from scratch, recruit humans, orcs, elves, skeletons, demons and animals to fight for you, give units different abilities, combat AI and equipment, and let the units cooperate with each other to achieve a combat effectiveness of one plus one greater than two. During the journey, you can obtain many different items and resources, which can be used on Heroic units to further enhance the units, Through the effective combination of units to the entire team's combat effectiveness.<h3> save the world </h3><br/>Players should form their own hero team under the oppression of various demons to help them develop and enhance the overall combat ability of the team. At the same time, we should defeat evil leaders and make the whole world calm again.", "metacritic": null, "released": "2022-07-18", "tba": false, "updated": "2022-07-22T05:09:16", "background_image": "https://media.rawg.io/media/screenshots/889/889568ee162cb50269d6b5139068ed7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NoSalt"], "genres": ["Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["NoSalt"], "esrb_rating": null}