{"id": 823590, "slug": "we-are-eva", "name": "We are Eva", "name_original": "We are Eva", "description": "Hi! My name is <strong>Eva</strong>, and I'm the main protagonist of the game you're looking at. This little platformer game is about <strong>me</strong>, yes. About me AND dimensional travel! But since you're reading this, you want to know more, huh?<br/><br/>Okay, well... It might sound weird, but I need your help, and this is why I am here, talking to you. You see, I am a peaceful creature... mostly... that lives in-between of dimensions. Usually, sleep is all I do (don't judge, you'd do the same), but not now, no. Because something is destroying those dimensions, and I want it to stop.<br/>That's where I need you, human-player-thing, for your ability to see in 2D.<br/>Yes, I am serious. I can travel between different dimensions whenever I want, but I can't see multiple of them simultaneously - however <strong>YOU</strong> can, with the help of your monitor.<br/><br/>Oh, I know, I know, another game needs its hero. I won't lie - it is what it is. But wouldn't you want to see what's out there? To help some fellow pixel-lady get some well-deserved sleep? We'll have fun, I promise... well, maybe not, maybe we'll both suffer horribly... but you'll never know if you don't try, right? I'll meet you there.<br/><br/><ul><li> Play the game in multiple dimensions at the same time.<br/></li><li> Amazing controls!<br/></li><li> Freedom of movement.<br/></li><li> Each dimension has its own rules.<br/></li><li> Levels that change themselves.<br/></li><li> And (of course) me, Eva.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-22T04:56:29", "background_image": "https://media.rawg.io/media/screenshots/4e5/4e55aab2752cbf34e9edff255773c387.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 34, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Totally Normal Creature"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Totally Normal Creature"], "esrb_rating": null}