{"id": 823629, "slug": "paranecro", "name": "PARANECRO", "name_original": "PARANECRO", "description": "PARANECRO: It is a movie-like horror game with an immersive story in single-player Fps style. The meaning of his name is the words \"PARANORMAL\" and \"NECROPHILIA\" comes from the combination. You will taste many horror feelings in this game. Get ready to feel the fear deep down!!<br/><br/><br/><br/><strong>STORY</strong><br/>Our character is a detective with a busy business life. But he has a bad past.<br/>He lost his wife and 1-month-old child in a car accident in his stomach.<br/>So he's a bit of a psychiatrist. After losing his wife, he experienced strange events.<br/>Worst of all, he lived in a deserted town where he went on a mission. His psychology was always turned upside down when he went to the city.<br/>He has embarked on a path from which he can never return. He has become unable to distinguish between right and wrong.<br/><br/><strong>SUMMARY</strong><br/>Otis, who has a very busy business life, completely changes his life after the trauma and cannot recover for a long time.<br/>Later, his boss from work gives him a new task and after that job he goes to, he starts to experience bad things again. The town he went to<br/>His curse is now on Otis. He begins to be unable to distinguish between reality and fantasy. You have to help Otis get over this trauma.<br/><br/><strong>FEATURES(FOR FULL GAME)</strong><br/><ul><li>İTEM CREATİON<br/><br/> </li><li>SAVE SYSTEM<br/><br/> </li><li>PUZZLE SYSTEM<br/><br/> </li><li>GUN SYSTEM<br/><br/> </li><li>BACKPACK SYSTEM<br/> </li></ul>", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-07-22T05:48:21", "background_image": "https://media.rawg.io/media/screenshots/4cb/4cb3466f763fd35cf7e81b3a531e4fb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GenemesicX"], "genres": ["Action", "Indie"], "publishers": ["GenemesicX"], "esrb_rating": null}