{"id": 823621, "slug": "iku-iku-succubus", "name": "Iku Iku Succubus", "name_original": "Iku Iku Succubus", "description": "Tanehisa Busujima is a middle-aged university professor well known for his lack of restraint and speaking his mind (for better or worse). His compulsions have put his job in jeopardy. The university's president provides him with a lifeline, though: Serve as an instructor for study abroad students from the Succubus Kingdom!<br/><br/>Not present anywhere in the Human Realm, the Succubus Kingdom is located in an entirely different world known as the Dream Realm. This begs the question: why are there study abroad students from another world attending a university in Japan? Well, the Japanese government made a trade agreement with the Succubus Kingdom: the Succubus Kingdom is to assist in resolving the declining birthrate in Japan, and in exchange, the Japanese government will provide the Succubus Kingdom with male energy. And wouldn't you know it? Busujima, is a perfect candidate for supplying said energy.<br/><br/>His responsibility as an instructor is to teach the foreigners about the Human Realm... On paper, at least. However, according to the program's director, Lima, his true objective is to rehabilitate failed succubi, and the two delinquents he’s in charge of will surely be a handful. Class is now in session!<h3>Features</h3><ul><li>A monster girl succubus fantasy set in modern Japan, full of magic, demons, and witches!<br/></li><li><strong>Over 10 hours of the classic visual novel experience.</strong><br/></li><li><strong>Choose between 3 unique heroines.</strong> The haughty, hard-working Lima Grimalkin, the feline-esque succubi in charge of the Succubus Kingdom's study abroad program. Ico Bicorn, crass and rebellious, with horns as sharp as her tongue. And true to her looks, Ruk Orcus's appetite could best be described as boar-ish, but she's a sheltered airhead who comes from royalty.<br/></li><li><strong>Fully voice acted.</strong> Featuring performances by: Takanashi Hanami, Akashi Yuki, and Misonoh Mei.<br/></li><li><strong>Multiple endings.</strong><h3>Characters</h3><br/><br/><br/>Lima belongs to the Grimalkin clan, a type of feline succubi with a declining social status within the Succubus Kingdom. She's well known for her belittling and teasing nature, but don’t let her babyface and short stature deceive you. She's been gifted with both impressive intelligence and potent magic capabilities. While her background was anything but privileged, it still wasn't enough to stop her from ascending to the Succubus Kingdom's post of Study Abroad Program Director. And her ambitions aim to take her even higher through the ranks of the Succubus Kingdom. On one hand, she's considered to be the most successful member of her clan. But on the other hand, many clans in the Succubus Kingdom hold her in disdain, and believe she merely lucked into her position.<br/><br/><br/><br/>Ruk belongs to the Orcus clan, a type of swine succubi who are by far the most esteemed throughout the Succubus Kingdom. She's relatively carefree, a bit of an airhead, and is very curious about the kinds of food the Human Realm has to offer. She has a habit of frequently sharing pictures of whatever she's eating on the Succubus Kingdom's one social media network, Incugram. Ruk is generally friendly and kindhearted, but naively believes Lima is not deserving of the position she's in, and though not out of spite, she will speak ill of Lima at times. She also considers humans to be inferior beings to succubi, but that belief as well, is not one of malice. Her body is pleasantly plump, and her features are gentle--if not maternal. She speaks in a refined manner befitting of someone with such a dignified--albeit sheltered--background, but much of what she says is either foolish or downright silly.<br/><br/><br/><br/>Ico belongs to the Bicorn clan, a type of horned-beast succubi known for their radical militancy. She's something of a delinquent and considers all things men to be a complete waste of time. She was raised being told things like \"a modest succubus is no succubus,\" or \"marriage is not in a succubus' vocabulary,\" etc. However, this ideology so thoroughly drilled into her only spurred her rebellious spirit, and she wants nothing more than to remain a faithful woman to whoever she ends up with. But the Succubus Kingdom is anything but faithful. In fact, the very concept of devotion is something of a taboo. Her golden-skinned burly body, menacing looks, vulgar and hostile manner of speaking, and abnormally large, spear-like horns make her stand out among other succubi.</li></ul>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2023-06-26T03:42:39", "background_image": "https://media.rawg.io/media/screenshots/c19/c19ddf283fbb78a35e7d181e005377b1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Orcsoft", "FAKKU"], "genres": ["Adventure"], "publishers": ["FAKKU"], "esrb_rating": null}