{"id": 823696, "slug": "mr-bullet-3d-shooting-game", "name": "Mr Bullet 3D - Shooting Game", "name_original": "Mr Bullet 3D - Shooting Game", "description": "Mr Bullet is back; in bigger and badder action. Mr. Bullet 3D has upped the ante. Revamped with better graphics and gameplay - your next adventure will be unforgettable! Don't pass up the chance to become a super-agent and a legend! <br/><br/>Are you a big fan of strategic games, puzzles, and fights? With Mr Bullet 3D, you'll have the possibility of becoming a spy, hunting for clumsy assassins and criminals, and shooting them down to save hostages and re-establish justice. Relive the phenomenon of solving puzzles by shooting down the enemies.<br/><br/>Features: <br/>•\tSave the World!<br/>MR Bullet always has a secret mission. Each time he should aim a bad guy trying to take over the world. Only a Super Bullet can stop them and save the world from zombies, assassins, vampires, ninjas, etc. <br/><br/>•\tUnlock Heroic Missions<br/>So many hostages are waiting for your help. Unlock each level with a unique approach, solve puzzling challenges and shoot bullets in a straight line, in bounce, or with a ricochet. Make some objects fall, explode, and shoot the enemy in auto-fire. Make a chain reaction, make fast decisions, and reach your target. <br/><br/>•\tEngaging Puzzler<br/>This is not just a simple shooting game but a strategic puzzler. Besides being smart, you need to be quick to solve the puzzle and reach your target. Try your brain, speed, and accuracy abilities and become a professional shooter. <br/>•\tSpy vs. Spy<br/><br/>In advanced PVP multiplayer scenarios, be smart enough to control your Mr Bullet and fight against different spies. <br/><br/>•\tSeasons<br/>The more stages you pass, the more bad guys you take down and save hostages, the more levels will be unlocked, and you will go to new seasons and try new stories with epic enemies like stone-age man, vampires, zombies, pirates, and more. <br/><br/>•\tNews<br/>MR Bullet 3D is updated continuously, and you can try additional skins, levels, and weapons each month. So, don't miss your chance. <br/><br/><br/>MR Bullet 3D is an excellent opportunity to feel like a super-agent and try the action. Whether you are a fighter or a puzzler, don't miss your chance to become a legend and complete secret missions. It is your time to clear the world from notorious villains and make it a better place for others. Try yourself in accuracy, speed, and patience! <br/><br/>Every Bullet Counts. <br/>So, Bullseye!<br/><br/>Visit https://lionstudios.cc/contact-us/ if have any feedback, need help on beating a level or have any awesome ideas you would like to see in the game!<br/><br/>From the Studio that brought you Mr Bullet, The Superhero league and Army Commander!<br/><br/>Follow us to get news and updates on our other Award Winning titles;<br/>https://lionstudios.cc/<br/>Facebook.com/LionStudios.cc<br/>Instagram.com/LionStudioscc<br/>Twitter.com/LionStudiosCC<br/>Youtube.com/c/LionStudiosCC", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-07-22T07:17:49", "background_image": "https://media.rawg.io/media/screenshots/00e/00e9886939c2d070ceee893858e748ee_XdtaEkN.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["1Button"], "genres": ["Action", "Puzzle"], "publishers": ["1Button"], "esrb_rating": "Teen"}