{"id": 823694, "slug": "warhammer-40000-dawn-of-war-master-collection", "name": "Warhammer 40,000: Dawn of War - Master Collection", "name_original": "Warhammer 40,000: Dawn of War - Master Collection", "description": "\nDiscover the grim dark universes of Warhammer where there is only war. From Warhammer 40,000 to Warhammer Fantasy and more - discover it all on GOG Warhammer Franchise page.\n<br/>\n\n<br/>\n<h3>Warhammer 40,000: Dawn of War - Master Collection includes:</h3>\n<ul>\n<li>Warhammer 40,000: Dawn of War - Game of the Year Edition</li>\n<li>Warhammer 40,000: Dawn of War - Winter Assault</li>\n<li>Warhammer 40,000: Dawn of War - Dark Crusade</li>\n<li>Warhammer 40,000: Dawn of War - Soulstorm</li>\n</ul>\n\nWarhammer 40,000: Dawn of War - Game of the Year Edition\n<br/>\nPrepare yourself for the grim, dark future of the 41st millennium, where alien races battle mankind for galactic domination in a universe of unending war.\n<br/>\nPersonalize your armies with a revolutionary unit customization tool that gives you the ability to choose your armies insignias, banners, squad colors and names.\n\n\n<br/>\n<ul><li>Engaging story driven single player campaign.\n<br/>\nCommand the elite chapter of the Blood Ravens in an original epic tale of treason and conspiracy as you serve the Emperor and protect humanity from the scourges of Warhammer 40,000 universe.\n<br/>\n</li><li>Master four unique races.\n<br/>\nCommand your Space Marines, Orks, Chaos and Eldar in epic battles and master their distinct abilities, weapons, and tech trees to eradicate the enemy and rule the known universe.\n<br/>\n</li><li>Unprecedented realism.\n<br/>\nAppropriately scaled terrain, vehicle physics and dynamic lightning contribute to a level of realism never before displayed in a real-time strategy game.\n<br/>\n</li><li>Visceral cinematic melee and ranged combat.\n<br/>\nRealistic unit animations immerse you in intense brutal combat .\n<br/>\n</li><li>Pioneering tactical gameplay.\n<br/>\nInnovations such as cover, squad-based combat, and morale add new strategic depth to real-time warfare.\n<br/>\n</li><li>Dynamic multiplayer.\n<br/>\nTest your true combat abilities in two-to-eight player battles providing endless re-playability</li></ul>\n<br/>\n\nWarhammer 40,000: Dawn of War - Winter Assault\n<br/>\nThis expansion adds all-new units and strategies to the exciting gameplay offered by Dawn of War. The Imperial Guard brings new weaponry, including heavy armor, new troop units as well as defensive and ranged tactics overwhelming numbers. Coupled with new abilities, this fighting force is as lethal as they come.\n<ul>\n<li>Single-Player Campaign<br/>\nWinter Assault offers two choices: the Order Campaign and the Disorder Campaign. The Order Campaign puts you in control of the Eldar and the Imperial Guard in their epic struggle to protect the Imperium of Man. In the Disorder Campaign, play as the Orks and Chaos Space Marines in their efforts to crush any resistance to their chaotic way.<br/>\n</li>\n<li>Revel in new and improved gameplay features<br/>\nA new tech tree, 100’s of new animations and endless new strategies will greatly intensify your Dawn of War experience.<br/>\n</li>\n<li>Direct your troops in all out war<br/>\nCommand them across harsh new winter battlegrounds with enhanced urban terrain and additional interactive object and structures.<br/>\n</li>\n<li>Improved multiplayer<br/>\n20 new maps and advanced online features including observer mode, arranged team play and improved auto match push Dawn of War multiplayer to the next level.<br/>\n</li>\n<li>Hone your multiplayer skills<br/>\nThe new skirmish option allows you to practice combat techniques against computer-controlled opponents on a multiplayer map.<br/>\n</li>\n<li>Imperial Guard<br/>\nSince the beginning of the Imperium of Man, the Imperial Guard has stood as its pillars of protection. With billions of men from more than a million different worlds, they are the largest and most diverse fighting force in the galaxy.</li>\n</ul>\n<br/>\n\nWarhammer 40,000: Dawn of War - Dark Crusade\n<br/>\nDeep under the central desert of Kronus, a vast honeycomb of skull-lined tunnels and funeral chambers house the awakening Necron menace. Eons ago, these were the boulevards and squares of a great necropolis built to house the bones of the races who had fallen to the Necrons, and ultimately were where the Necrons themselves retire to spend eternity. Over millions of years, sand and rock had covered it all until ill-fated excavations awoke the deathless.<br/>\nPlay any of seven races, striving for control over Kronus. Take other races' strongholds by winning challenging battles on various maps individually associated with the respective strongholds.\n<ul>\n<li>New Races<br/>\nTake command of two new playable races: Tau and Necron to unleash massive carnage across the frontlines of battle.<br/>\n</li>\n<li>Expanded multiplayer<br/>\nDominate opponents online across 12 new multiplayer maps - with up to 8 players battling it out for supremacy.<br/>\n</li>\n<li>Deep single player campaign<br/>\nConquer the planet of Kronus any way you choose - leading any one of seven races on an epic crusade through an all-new, non-linear single player campaign where you can experience unique storylines from each race's perspective.<br/>\n</li>\n<li>Customization<br/>\nCustomize your hero's weapons, items and abilities as he grows in power and influence. Personalize your army with a variety of insignias, squad colors, banners and names.</li>\n</ul>\n<br/>\n\nWarhammer 40,000: Dawn of War - Soulstorm\n<br/>\nThe third and final expansion to the genre-defining and critically-acclaimed RTS, Dawn of War. In Soulstorm, two new armies are introduced – Sisters of Battle and Dark Eldar - raising the total number of playable armies to nine. The revolutionary meta-game that was first introduced in Dark Crusade is further expanded to an interplanetary scale, allowing players to battle across the star system.\n<ul>\n<li>Sisters of Battle<br/>\nThe Chamber Militant of the Emperor’s Holy Inquisition. Limited in numbers but incredibly powerful, the Sisters of Battle are second only to the Space Marines in terms of sheer fighting prowess. Ranging from the Sisters Repentia with their devastating ceremonial eviscerators to the awe-inspiring Penitent Engine, the Sisters of Battle are truly a force to be feared.<br/>\n</li>\n<li>Dark Eldar<br/>\nTwisted and corrupt cousins of the Eldar, these terrifying raiders from the furthest reaches of the Webway are feared and hated by all. Their incredible speed, reliance on close quarter combat and stunning and poisoning abilities allows them to quickly strike an enemy and be gone before reinforcements can arrive.<br/>\n</li>\n<li>Devastating air attacks<br/>\nStrategic warfare in the 41st Millennium reaches new heights as each army gains air units to rain death from the skies.<br/>\n</li>\n<li>Brutal domination<br/>\nWage war across the entire solar system as the metagame map introduced in Dark Crusade is expanded to an interplanetary scale. Liberate, enslave, or destroy entire worlds as you unleash your armies’ fury across the galaxy. Players must now strive to conquer an entire solar system with multiple planets and moons to be conquered. In total 34 maps are available to the player.<br/>\n</li>\n<li>Enhanced customization<br/>\nCustomize your hero’s weapons, items and abilities as he grows in power and personalize your army’s insignias, colors, banners and names. Earn and unlock achievements and medals to showcase your superiority online.</li>\n</ul>\n<br/>\n<p>\nPlease note: cross platform multiplayer is not supported and is only available with other GOG users.\n</p>", "metacritic": null, "released": "2005-12-31", "tba": false, "updated": "2023-05-01T04:33:55", "background_image": "https://media.rawg.io/media/screenshots/76a/76aa12f269650b4b0b3e10fdceb0b722.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 638, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Relic Entertainment"], "genres": [], "publishers": ["SEGA"], "esrb_rating": null}