{"id": 823691, "slug": "the-monster-mole", "name": "The Monster Mole", "name_original": "The Monster Mole", "description": "<strong>The Monster Mole</strong> is an <strong>asymmetrical first-person PvP horror survival</strong> game where you either try to survive and escape a vicious beast with your teammates, or hunt your prey as the <strong>nearly-blind</strong> monster that inhabits the surroundings of the fictional town of Dry Lake.<br/><br/><br/>As a survivor, coordinating with your teammates and finding the right balance between being quick and being quiet is key to escaping with your life.<br/><ul><li>Find spare parts and repair your car;<br/></li><li> Alternatively, find and fuel the generator and escape on foot;<br/></li><li> Understand the balance between being loud but quick and quiet but slow;<br/></li><li> Slow down and confound the beast - turn on radios, set down bear traps, collect and throw stones to draw it away from you;<br/></li><li> Know when to speak - communication is important, but the monster is always listening!<br/></li><li> Learn to navigate the dark, foggy maps avoiding their many traps.</li></ul><br/><br/>As the Mole, mastering your understanding of the environmental clues and sounds made by the survivors will more than make up for your limited sight.<br/><ul><li> Make up for your near-sightedness by listening attentively for sounds;<br/></li><li> Leave behind gooey traps that reveal and slow down survivors;<br/></li><li> Destroy tools that would otherwise be helpful to the thrill-seekers and knock down doors to houses where they might have barricaded themselves within;<br/></li><li> Keep the pressure on! The survivors have a limited time to escape, force them into making mistakes by always being on the move.</li></ul>", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-22T07:08:54", "background_image": "https://media.rawg.io/media/screenshots/140/140defa5204c8096c0eb80d0f20ef12f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DILUI"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["DILUI"], "esrb_rating": null}