{"id": 823776, "slug": "raft-survival-desert-nomad", "name": "Raft Survival: Desert Nomad", "name_original": "Raft Survival: Desert Nomad", "description": "Raft Survival: Desert Nomad – start your incredible journey through the desert on the raft in the air!<br/><br/>Left alive in the middle of the vast expanses of the desert, you have to make every possible effort not to die from hunger, thirst and heat. Armed with makeshift weapons, your only one way to survive surrounded by unknown monsters is to escape on a floating raft.<br/><br/>Dive into in a post-apocalyptic open world full of amazing locations, quests, incredible monsters, various crafting and raft building and strengthening! Collect and produce useful resources, upgrade buildings and make durable armor and weapons. Try to go on an expedition through the desert and find other survivors.<br/><br/>\"Raft Survival: Desert Nomad\" features:<br/><br/>• World map for traveling through desert locations;<br/>• Fascinating storyline, player's base and strong enemies;<br/>• Collection and production of resources;<br/>• A variety of crafting and raft building;<br/>• Battles with dangerous monsters.<br/><br/>~~~ Explore new territories ~~~<br/>Travel and explore new interesting locations using a huge world map. Don't miss a single detail! Look for unique resources for the development of the raft, meet different enemies of the desert lands. Complete themed tasks and get valuable rewards.<br/><br/>~~~ Interesting storyline ~~~<br/>Go through an exciting plot of the Raft Survival: Desert Nomad world. Find the player's mysterious base in the desert and try to restore and develop it. Complete adventure quests and get nice bonuses to speed up the development of your raft and combat equipment.<br/><br/>~~~ Collection and production of resources ~~~<br/>Raft Survival: Desert Nomad is perfect for anyone who has ever wanted or wants to learn how to survive in the desert! For the successful raft development, you need to stock up on useful resources. To stay alive, you can build stations to extract the necessary supplies, as well as devices for crafting clothes and materials to improve the raft.<br/><br/>~~~ Hot air balloon travel ~~~<br/>Try out a special flight mode that will let you travel through the sky across an open world. Create your own upgraded air play raft: build the first floor, install the necessary stations and equipment and secure the raft with fences and metal walls.<br/><br/>Embark on a journey full of interesting adventures! Exciting locations, stories and quests are already waiting for you. Immerse yourself in the mystical atmosphere of air raft survival in Raft Survival: Desert Nomad. Your fate is in your hands!<br/><br/>SUBSCRIPTION<br/>Enjoy the game and get bonuses:<br/>1. 6 simultaneous production processes.<br/>2. Raft flight speed increased by 10%.<br/>3. Engine fuel and energy consumption reduced by 20%.<br/>4. No ads (only bonuses for the video).<br/>5. 20 coins every day as a bonus.<br/>6. Noise level reduced by 40%.<br/>7. Maximum number of inventory slots and an additional 5 slots in the Warehouse.<br/><br/>Make your life easier with premium access:<br/>- Check it's advantages, by getting a free three-day trial. After 3 days, the trial will automatically turn to the week paid subscription.<br/>- A week paid subscription costs $9.99.<br/>- Payment will be charged to your iTunes Account at confirmation of purchase.<br/>- You can cancel the subscription or a free trial at any time, but at least 24-hours before the end of the current period. OTHERWISE, it will be automatically renewed.<br/>- The account will be charged for renewal within 24-hours prior to the end of the current period.<br/>- You can manage the subscription and turn off the auto-renewal in your Account Settings after purchase.<br/>- Any unused portion of a free trial will be forfeited when you purchase the subscription.<br/>- Read our privacy policy http://treastone.com/privacy.html<br/>And EULA http://treastone.com/eula.html<br/><br/>Our company Treastone LTD has full rights to use the RAFT trademark in the USA (The Mark Consists of Standard Characters without claim to any particular font style, size or color - Ser. No. 87-605,582 FILED 09-12-2017)", "metacritic": null, "released": "2022-07-05", "tba": false, "updated": "2022-07-22T08:35:34", "background_image": "https://media.rawg.io/media/screenshots/460/460089e0531220ddafdadd953f6bd491_Vor8Gvs.jpg", "website": "http://treastone.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Treastone"], "genres": ["Adventure", "Simulation"], "publishers": ["TREASTONE"], "esrb_rating": "Everyone 10+"}