{"id": 823705, "slug": "super-flying-hero-crime-city", "name": "Super flying hero: Crime city", "name_original": "Super flying hero: Crime city", "description": "\"Super flying hero: Crime cityis an epic open world game! This is third person super hero gangster fighting game with everything you want &amp; all features you can ask for.<br/><br/>Get ready to have unlimited fun by playing an amazing flying Rope hero simulator game. Let’s be a powerful Rope hero in the thrilling gangster crime city environment. Download the action-packed Ropesuperhero game and enter into gangster city to control the crime. It’s time to show your strength by becoming the ultimate rope hero by enjoying this new Ropesuperhero simulator. Let’s have a thrilling experience of a gangster crime city battle game and show the criminal your real strength. Get into the adventure of flying Rope hero crime city fighting games where you are playing as an amazing Ropehero to fight against all gangster mafia in the gangster city crime simulator games. This Ropesuperhero game gives you a chance to fight like a brave and fearless Rope hero with your amazing superhero powers. In this gangster crime city battle game, you have several skins for flying rope man to enjoy the Rope hero fighting hero simulator. Choose your favorite character in the Rope hero gangster crime simulator for completing the different interesting city rescue missions.<br/>This amazing flying Rope hero has amazing strength, ability to fly and climb walls to save the world from the criminal of the Rope superhero game. In this flying rope hero fighting game, let’s try to knock down the criminals by using several superpowers like flying, fighting with punches, fits, and kicks. So get ready to enter into the Rope hero simulator and fight with bravery in extreme gangster crime city battle. Let’s prepare yourself to accomplish the challenging &amp; thrilling missions and prove yourself a daring Rope hero man.<br/>This Ropewali game is made for all th Ropeand super hero fans. Do unpredictable Ropeattacks fly around the city stick to the walls attack enemies attack dragons kill all the enemies using super human super powers.<br/>Live the character of most amazing and powerful superhero by playing this Rope hero man game because in this Super flying hero: Crime cityaction packed fighting game, your character poses many great super powers like superhuman strength and ability to sticking to and climbing walls and buildings. Shoot web-shooters to fire and swing from sticky webs, special hero-sense of this rope hero man warns of incoming danger instantly. Rope hero has amazing super rope which is a important weapon of this rope super hero character. This Rope hero man has capability to move around the city With the help of this amazing rope the hero jump or move quickly over the buildings and perform different dare devil stunts in Flying RopeHero: Crime City. Complete All the missions of Ropegame wali game super hero crime fighting game and collect rewards to unlock all characters and enjoy their powers.<br/>Unlock all monster trucks in the game enjoy the best driving simulation and racing game experience in this Ropewali game.<br/><br/>Super flying hero: Crime cityFeatures:<br/><br/>Best Rope climbing/swinging experience you can get.<br/>Amazing super hero action experience<br/>Rope hero games with a lot of superpowers<br/>Open World with different dangers<br/>Incredible skills of flying Ropesuperhero game<br/>Real gangster city crime battle surroundings<br/>Rope, punch, flying, kick and fight to eliminate the criminals<br/>Realistic sound and smooth controls<br/><br/>Flying Rope heroes are fighting in your support, you are everyone's hope and they are calling you my amazing rope hero, show some super villain stealthy action for the survival of your futuristic grand city and make it secure.\"", "metacritic": null, "released": "2022-07-06", "tba": false, "updated": "2022-07-22T07:25:48", "background_image": "https://media.rawg.io/media/screenshots/88c/88ca30cd2671041318eeb6f1b1ad0f96_9EoAV4u.jpg", "website": "https://appvolu.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DINH THIHONGNGAN"], "genres": ["Adventure", "Simulation"], "publishers": ["DINH THIHONGNGAN"], "esrb_rating": "Teen"}