{"id": 823723, "slug": "match-poker-online", "name": "Match Poker Online", "name_original": "Match Poker Online", "description": "It’s not poker as you’ve ever played it before – it’s a Battle Royale, where you compete against opponents playing the same hand as you. The luck element of poker has been removed, leaving players to be scored only on their skill!<br/><br/>When playing Match Poker, you are not competing with the other players at your table, but against hundreds of players seated in the same seat as you at other tables. They get <br/>the same hole cards as you and see the same flop, turn and river.<br/> <br/>Your play is then judged not on how much you won or lost on a hand, but by comparing your result with that of every other competitor who played those same cards.<br/><br/>By removing luck, Match Poker has not only produced the ultimate game of skill but has re-invented poker as a “sport”.<br/><br/>As a result, Match Poker has been provisionally accepted by the governing body of world sport, the Global Association of International Sports Federations, as a mind sport, alongside games like Chess and Bridge.<br/><br/><br/>BATTLE ROYALE POKER <br/><br/>In MPO’s Battle Royale, 6 tables of 6 players play the same hand at the same time  . Players with the fewest chips in each seat are regularly eliminated, until the last 2 battle it out to determine the winner. Will you survive elimination for all 32 hands?<br/><br/>Your best 20 Battle Royale results qualify you for a place in the premiership season and the potential to represent your country in international championships.<br/><br/><br/>A WORLD RATING<br/><br/>The app uses a unique statistical algorithm to accurately rank the true skill of players, delivering, for the first time in the history of poker, an official World Rating based on skill. No other poker experience gives players this.<br/><br/>The app analyses thousands of results for every hand to give instant feedback and unique insights into how you can become a better poker player and rank as highly as possible on our unique leaderboards.<br/><br/><br/>THE OFFICIAL SPORT OF POKER<br/><br/>For ten years, there has been a global movement aimed at turning poker into a sport – removing the luck integrated in poker and focusing on the game as a game of skill, a sport, accessible to all ages.<br/><br/>International championships have been held every year since 2011 and an ever-growing base of more than 60 national federations have recognised ‘Match Poker’ as the only way to play poker as a sport. It has been provisionally accepted by the GAISF as a world mind sport – like Chess and Bridge – sports which, combined, represent more than a billion players.<br/><br/>Now, Match Poker is available to everyone on their mobile device!<br/><br/>For the first time ever, players will receive officially sanctioned rating points that reflect their true skill in poker. Players who rank the highest will be invited to represent their county in international competitions.<br/><br/><br/>BY PLAYING MATCH POKER ONLINE, YOU WILL:<br/><br/>- Be able to measure yourself against your peers, your friends and even against famous and/or professional players.<br/>- Play tournaments that will qualify you to compete at major championship events.<br/>- Improve your game by comparing your play to the very best players in the world.<br/>- Have a lot of fun!<br/><br/>Best of all, Match Poker provides the opportunity to represent your country, state, region, gender or age-group in major national and international events!", "metacritic": null, "released": "2022-02-14", "tba": false, "updated": "2022-07-22T07:43:14", "background_image": "https://media.rawg.io/media/screenshots/88c/88c38e178e1d3d3a49041d94ce1c48ff.jpg", "website": "https://matchpoker.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MatchPokerLtd"], "genres": ["Card"], "publishers": ["Match Poker Online"], "esrb_rating": "Teen"}