{"id": 823749, "slug": "kinder-world-houseplant-game", "name": "Kinder World: Houseplant game", "name_original": "Kinder World: Houseplant game", "description": "Kinder World is a comforting mobile game of houseplants, healing and practicing kindness.<br/><br/>With a cozy atmosphere, Kinder World helps players find emotional rest, by combining relaxing wellbeing activities with nurturing gameplay. In a relaxing and lush safe space of their own design, playing Kinder World gently improves the way players treat themselves. <br/><br/>To take care of your plants in-game, you’ll complete small, gentle activities like gratitude, emotional naming, and decorating your ideal relaxing room. Every plant is completely unique, with different species to collect, rare leaves to discover, and cute characters to connect with.<br/><br/>Our player community can share supportive messages and practice kindness to help nourish and develop our in-game world, and each other.<br/><br/><br/>Kinder World features:<br/><br/>- Every plant grows with procedural generation over time, so every one is unique! <br/><br/>- Rare variegations to discover and new plant varieties to unlock.<br/><br/>- Kindness activities to show care to yourself through small daily moments.<br/><br/>- Customize and create the ultimate green relaxation space with pots, decorations and more.<br/><br/>- A game world that grows with you, including sweet characters to connect with and write letters to.<br/><br/>- Relaxing lo-fi music and a soothing art style.<br/><br/><br/>Join the Kinder World player community: https://discord.gg/4naDaP7RbE", "metacritic": null, "released": "2022-06-19", "tba": false, "updated": "2022-07-22T08:10:12", "background_image": "https://media.rawg.io/media/screenshots/73c/73ccb4ab51ba551dea5e4d89441c1401.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lumi Publications"], "genres": ["Simulation"], "publishers": ["Lumi Publications"], "esrb_rating": "Everyone 10+"}