{"id": 823733, "slug": "food-match-3d-tile-puzzle", "name": "Food Match 3D: Tile Puzzle", "name_original": "Food Match 3D: Tile Puzzle", "description": "Match 3D games meet cooking&amp;serving games in this newest and unique matching game!<br/><br/>Proudly introduce you to Food Match 3D. Find the foods in the mess, match them all and serve. Unlock new foods and use great boosters to complete the challenging levels on time. Just match and enjoy!<br/><br/>In this addictive time-management game, match diverse interesting foods, beverages and sweets from different cuisines of all the world!<br/><br/>It is a wonderful combination of a time management food serving game with 3D matching puzzle games.<br/><br/>Use super boosters, serve as fast as you can and get the highest point. Become an expert level by level. Enjoy matching lovely tasty foods.<br/><br/>Food Match 3D is an easy game to learn but be careful it will become highly challenging as you level up. It is a well-designed 3D game addressing all age groups, especially kids.<br/><br/>Play this fun game, show your capability, patience and speed. Sit back and relax in this free to play and incredibly fun game! Food Match 3D is a legendary game with wonderful 3D graphics.<br/><br/>This game has been created to entertain you, it will help you to relax and improve your memory capacity. Show your one finger tapping and swiping ability, and have a great time!<br/><br/>Enjoy Food Match 3D committed to fun!", "metacritic": null, "released": "2021-11-24", "tba": false, "updated": "2022-07-22T07:55:39", "background_image": "https://media.rawg.io/media/screenshots/a30/a30ede446f20c98751233c0cdc01e52c_ngTuTwg.jpg", "website": "https://matchingham.gs", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MATCHINGHAM GAMES"], "genres": ["Casual", "Puzzle"], "publishers": ["MATCHINGHAM GAMES"], "esrb_rating": "Everyone 10+"}