{"id": 823781, "slug": "heat-gear-race-drift-world", "name": "Heat Gear - Race & Drift World", "name_original": "Heat Gear - Race & Drift World", "description": "In Heat Gear - Race &amp; Drift World evade a relentless police force while you clash with street racers. Race and chase hot cars many more in the open world the biggest night city. Feel the intensity of no-brakes-allowed street racing with realistic full-car for the on mobile. <br/><br/>Go from zero to most wanted!<br/>• Modificate your car <br/>- Body color<br/>- Body skin<br/>- Rim model<br/>- Spoiler model<br/>- Under neon light<br/>- Plate customization<br/>- Upgrade car<br/><br/>• Race the 9 different game modes. <br/>- Split mode<br/>- Circuit mode<br/>- Drift mode<br/>- Escape police mode<br/>- Time mode<br/>- Speed mode<br/>- Near miss mode<br/>- Free drift mode<br/>- Max speed mode<br/><br/>• Drive and customize over 10 of the world’s most exciting cars<br/>• Race the way you want in open world the biggest map!<br/>• Use Mods to enhance your car and get ahead of the pack in style<br/>• Experience the action with mind-blowing graphics and intense<br/>• Earn money to unlock new cars<br/><br/>Choose your car, customize it and start racing. If you like 3d open world night city racing games, car driving games and simulation games, download Heat Gear - Race &amp; Drift World now, pick one of the exciting racing modes and escape from police!<br/><br/>NOTE: Heat Gear - Race &amp; Drift World doesn't need an internet connection after installation! Long live offline open world racing game!<br/><br/>WARNING: Heat Gear - Race &amp; Drift World does not have a cloud save feature now. All game progress and in-app purchases may be lost upon deletion of this  open world racing game.", "metacritic": null, "released": "2022-02-19", "tba": false, "updated": "2022-07-22T08:41:46", "background_image": "https://media.rawg.io/media/screenshots/e27/e27414f70ed102d3cad89f9db09dd4af_Ua95GEx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hasan Seker"], "genres": ["Simulation", "Racing"], "publishers": ["Hasan Seker"], "esrb_rating": "Everyone 10+"}