{"id": 823775, "slug": "bowling-unleashed", "name": "Bowling Unleashed", "name_original": "Bowling Unleashed", "description": "Most bowling games of the past have an unrealistic, arcade-style look and feel that quickly leaves real bowlers feeling unsatisfied and unimpressed. But Bowling Unleashed aims to change that. It provides an accurate and realistic bowling game experience that serious bowling fans will instantly appreciate and enjoy!<br/><br/>- Powered by Blueprint, the world's most accurate and complete 3D bowling simulation physics engine. Blueprint is a professional-grade, bowling-specific rigid-body dynamics simulator that provides unparalleled accuracy to Bowling Unleashed’s ball motion and pinfall physics. While most bowling games have physics implementations that look like they were thrown together almost as an afterthought, Bowling Unleashed looks and feels like real-world bowling, right down to the smallest, most seemingly insignificant detail. 10+ years of research, development, real-world testing, and on-lane validation have gone into the Blueprint ball motion and pinfall simulation engine, and Bowling Unleashed is the world's first and only bowling game to use it. We hope you enjoy it!<br/><br/>- Physically-accurate bowling environment. The lane, the pins, the balls, the gutters, and the oil patterns feature 100% accurate physical geometries and properties to provide an ultra-realistic bowling experience that is indistinguishable from the real thing.<br/><br/>- An intuitive control scheme that mimics real bowling by placing an emphasis on accuracy, timing, and power control. Swipe-based controls are often frustrating in bowling games, and we think you'll agree that our simple pullback-based ball launching system provides a pleasant and fun user experience that will allow you to improve and progress your skill level over time.<br/><br/>- Adjust your delivery to create the perfect hook for any lane condition. Precisely control your target, launch angle, ball speed, rev rate, axis rotation, axis tilt, and loft distance to create the best ball motion and the most strikes.<br/><br/>- A collection of bowling balls that is modeled after the types of balls found in the real world. From polyester to urethane to reactive resin, choose the right ball for your style to conquer any lane condition. And from accurate coverstock friction models to real-world mass properties, our bowling balls look and behave just like the real thing!<br/><br/>- A variety of oil patterns that are modeled after real-world conditions. See where the oil is located on the lane with our transparent oil pattern overlay feature.<br/><br/>- State-of-the-art 3D graphics that push the limits of photorealism for a 3D bowling game. Our high-quality textures, real-time reflections, dynamic shadows and lighting, and smooth frame rate add to the game's immersion level and give you a detailed and accurate view of all the action!<br/><br/>- Play in practice mode, bowl a single game for score, or bowl a full three-game series. Additional game modes are in the works and will be coming soon!<br/><br/>Bowling Unleashed is unlike any bowling game you've played before. Download it today to experience all the joys—and frustrations—of real bowling, right from the comforts of your smartphone!<br/><br/>Please note that a network connection is required to play this bowling game.<br/><br/>By downloading this game, you are agreeing to the terms of our privacy policy and end-user license agreement (EULA):<br/><br/>Privacy policy: https://www.bowlingunleashed.com/privacy-policy/<br/>EULA: https://www.bowlingunleashed.com/eula/", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-07-22T08:34:33", "background_image": "https://media.rawg.io/media/screenshots/059/059aa79f4491f570067651b4de635524.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["3DB Gaming"], "genres": ["Simulation", "Sports"], "publishers": ["3DB Gaming"], "esrb_rating": "Everyone 10+"}