{"id": 823756, "slug": "masterchef-cook-match", "name": "MasterChef: Cook & Match", "name_original": "MasterChef: Cook & Match", "description": "The prestigious cooking competition has a new destination. Your phone and tablet!<br/><br/>Travel across the globe and participate in all-new seasons of MasterChef such as the US the UK and beyond!<br/><br/>Apply to the show, stand out in a competitive qualification round and progress through the challenges until you become the next MasterChef champion!<br/><br/>There's new faces waiting to meet you in each location, including judges with rich history and experience in cooking and fine dining, as well as fellow contestants from all walks of life.<br/><br/>You'll make new friends, find allies, and form rivalries, as every season pits you against 19 aspiring chefs, who all want to succeed and make their dreams come true.<br/><br/>The diverse cast brings an exciting dynamic to your MasterChef journey. You need to succeed at every turn by cooking interesting and delicious recipes to withstand the scrutiny of the judges.<br/><br/>It might not always turn out the way you think and you could end up in an elimination round! But with dedication and ingenuity, you can overcome any challenge.<br/><br/>Learn new dishes based on real-life MasterChef recipes, lifted from the show!<br/><br/>Visit the iconic MasterChef pantry and play unique minigames to collect all the ingredients you need...<br/><br/>And finally, work meticulously to prepare the most fascinating dishes step by step!<br/><br/>Progress by completing the cerebral Match-3 puzzles and impress the judges with your skill and precision in crafting the finest meals and desserts.<br/><br/>Climb all the way to the top and earn the title of Master Chef around the world!<br/><br/>- Submit your application<br/>- Pass the Qualification<br/>- Impress the judges<br/>- Meet fellow contestants<br/>- Discover new dishes<br/>- Explore the pantry<br/>- Cook on the MC workbench <br/>- Complete different challenges<br/>- Visit unique locations<br/>- Win MasterChef!<br/><br/>MasterChef: Solve and Compete are free to play, with optional in-app purchases available.<br/><br/>You can connect the game with your social media profiles to share your progress and achievements with all your friends!", "metacritic": null, "released": "2022-06-29", "tba": false, "updated": "2022-07-22T08:17:04", "background_image": "https://media.rawg.io/media/screenshots/8b3/8b336af0a2461cee7d84235613edb0f9_6YskATj.jpg", "website": "https://www.qiiwi.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Qiiwi Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Qiiwi Games"], "esrb_rating": "Teen"}