{"id": 823807, "slug": "mini-skull", "name": "Mini Skull", "name_original": "Mini Skull", "description": "Morning is here. Sunshine beams down. A lonely mini skull lays peacefully in his bed.To get up or to sleep for another while?<br/>\r\nMini skull falls into a dilemma…<br/>\n<br/>\r\nMidnight comes. Darkness falls upon him. A dreadful earthly python slithers his way.To fight or to flee?<br/>\r\nMini skull falls into another dilemma…<br/>\n<br/>\r\nYou’ve got endless decisions to make during your journey. Each of your choices will bring out completely different stories and endings. Are you ready for it?<br/>\n<br/>\r\nWhat’s the game?<br/>\r\nAn adventure game with an interactive storyline.<br/>\r\nA casual RPG with an exciting pixel art adventure.<br/>\n<br/>\r\nWhat’s the story?<br/>\r\nYou are a mini skull yearning to become a hero. One usual morning, you finally made up your mind to take your first step on an unknown journey. For what?TO BECOME A HERO!<br/>\r\nReality is always crueler than expected. Fearsome danger and endless challenges always block your way. All you can do is to confront it and fight! But of course, you will also encounter many beautiful objects and people that will comfort your lonely heart.<br/>\n<br/>\r\nWhat makes the game special?<br/>\r\nEndings are various and uncertain. Each of your decision will write you a unique story.Unparalleled adventure experience &amp; diverse adventure scenarios.Exciting battles and an unlimited upgrading experience.Puzzle, PVE, Guessing……Endless unexpected events and little games will never let you become bored!<br/>\n<br/>\r\nWhat challenging sufferings might you meet and what great achievements may youachieve?<br/>\r\nStart your adventure journey now and check your unique ending!", "metacritic": null, "released": "2022-06-22", "tba": false, "updated": "2022-09-30T05:48:29", "background_image": "https://media.rawg.io/media/screenshots/042/04294d376da6b0466563d6cb367ad485.jpg", "website": "https://www.iclockwork.sg", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "iOS"], "developers": ["Morefun Technology", "Suzhou Ailuoke Information Technology"], "genres": ["RPG", "Casual"], "publishers": ["MoreFun Technology", "Suzhou Ailuoke Information Technology"], "esrb_rating": "Teen"}