{"id": 823845, "slug": "virago-naked-reality", "name": "Virago: Naked Reality", "name_original": "Virago: Naked Reality", "description": "Virago is about a young girl called Willow, after an incident with her stalker she begins to suffer from hallucinations. While moving around her city one day, she begins to lose sight of what’s real and fake, this begins to affect her emotionally and psychologically.<br/><br/>Your goal as willow is to explore this deep dark town, finding your way through the vile citizen to make it out in one piece.The way forward is not always clear, and deadly creatures will hunt you relentlessly and effortlessly, but as you keep going, finding new paths, and finding powerful new weapons and abilities, you will begin to uncover some deep dark secrets of the town.<br/><br/>The world Virago will be brought to life in vivid, moody detail, its bizarre and terrifying creatures each animated by hand in a traditional 2D style. The look of Virago is reminiscent of a lovingly crafted 2D animated movie. Vibrant characters and creatures and detailed environments will draw you deep into the world.<br/><br/>FEATURES<br/>*Challenging gameplay that can be difficult but always fair.<br/>*Fluid and responsive action.<br/>*Explore a vast, connected town.<br/>*A beautiful vintage graphics<br/>*Traditional 2D animation brings creatures and characters to life<br/>*Speak with and assist a cast of bizarre characters.<br/>*Find powerful new abilities.", "metacritic": null, "released": "2022-05-26", "tba": false, "updated": "2022-07-22T09:47:41", "background_image": "https://media.rawg.io/media/screenshots/e60/e60f395a66e58b58c09910adab9091f1_IokOaUj.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sunday Akor"], "genres": ["Action", "Adventure"], "publishers": ["Sunday Akor"], "esrb_rating": "Everyone 10+"}