{"id": 823859, "slug": "ace-attorney-trilogy", "name": "Ace Attorney Trilogy", "name_original": "Ace Attorney Trilogy", "description": "■■ Caution ■■<br/>Please check the \"Regarding Purchases\" and \"Supported Devices\" notices below before purchasing or using the app.<br/><br/>--- Game Introduction ---<br/><br/>Become a lawyer and take the stand to prove your client’s innocence in a court of law!<br/><br/>Enjoy rookie attorney Phoenix Wright's first three games in the popular series, all in one package!<br/>All 14 thrilling episodes of Phoenix Wright: Ace Attorney, Phoenix Wright: Ace Attorney – Justice for All, and Phoenix Wright: Ace Attorney – Trials and Tribulations are included!F6<br/><br/>With high-resolution graphics, courtroom battles never looked this beautiful!<br/><br/>On top of Japanese and English, you can experience the world of Ace Attorney in French, German, Chinese (simplified and traditional), and Korean as well! Just swap to your preferred language in the Options menu!<br/><br/>The number of save slots has increased to ten! There are now ten save slots per language available across all three games!<br/><br/>【Game Overview】<br/>There's been a murder! Uncover the truth to save your innocent client!<br/><br/>- Investigation<br/>Gather information and evidence related to the case!<br/><br/>- Courtroom<br/>Outwit cunning prosecutors and call out witnesses to discover what really happened by finding inconsistencies in their statements!<br/><br/>Solve the intriguing mysteries behind each case and witness the final truth for yourself!<br/><br/>Note: During normal conversation, you can fast-forward the dialogue by holding the text skip button.<br/>Note: This collection is the same as the one previously released on home gaming platforms.<br/><br/>【Regarding Purchases】<br/>Regardless of the reason, we cannot offer refunds (or an exchange for another product or service) once the app is purchased.<br/><br/>【Supported Devices】<br/>Please check the following URL for a list of operating environments (devices/OSs) supported by this app.<br/>https://www.capcom-games.com/product/en-us/aceattorney-trilogy-app/?t=openv<br/><br/>Note: Although you can purchase this app using devices and OSs not listed as supported, the app may not function properly.<br/>Please be aware that we can neither guarantee the app's performance nor offer refunds if you use a device or OS not supported by the app.<br/><br/>【Enjoy More Capcom Titles!】<br/>Search for \"Capcom\" in the App Store, or the name of one of our apps, for more fun games to play!", "metacritic": null, "released": "2022-06-09", "tba": false, "updated": "2022-07-22T10:03:03", "background_image": "https://media.rawg.io/media/screenshots/05c/05c26277f81ace52299b717c285e7e64_Nbw9pVV.jpg", "website": "https://www.capcom-games.com/product/en-us/aceattorney-trilogy-app/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Capcom"], "genres": ["Adventure", "Simulation"], "publishers": ["Capcom"], "esrb_rating": "Teen"}