{"id": 823817, "slug": "ensemble-stars-music-2", "name": "Ensemble Stars Music", "name_original": "Ensemble Stars Music", "description": "Ensemble Stars!! Music, the all-direction immersive mobile rhythm game, the essential sequel of Ensemble Stars! Basic, will be released soon! Idols from Yumenosaki Academy start their brand-new journey. You will surely find your ideal type among all 49 stylish, shining stars!<br/><br/>Elaborated 3D live scenes, engaging stories by famous playwrights, and a luxurious voice cast—enjoy everything about your idols here! Immerse yourself in a new experience!<br/><br/>The pre-registration starts now! Complete pre-registration on iOS to claim the exclusive rewards (Diamond×200) on the day of release! Explore more activities and bonuses on the official website!<br/><br/>[Super Real 3D LIVE, Closer to the Stage]<br/>Switch on the 3D LIVE mode, enjoy the melodious music, and see the stylish MV performances unfold before your eyes. Four difficulty levels from Easy to Expert for Live Stages are available. The Live experience remains the same on all difficulty levels, so please enjoy the fabulous beats on whatever level you like!<br/>You are free to set any idol as a Center for performance and change outfits for your idols. Center idols give mesmerizing Special Performances (SPP)!<br/><br/>[Heart-Warming Bonds, Bitter-Sweet Story] <br/>Ensemble Stars!! Music is mainly written by AKIRA, the renowned Japanese light novelist, and it continues the story of Ensemble Stars! Basic. Young idols set out on their journey into the world and begin to explore the entertainment industry. Excitement, hesitation, joy, and tears await on their way toward a bright future. Every day, something new in Ensemble Square pulls at your heartstrings.<br/><br/>[Top Voice Cast, A Feast for the Ears]<br/>Hikaru Midorikawa, Yuki Kaji, Tetsuya Kakihara, Showtaro Morikubo, Tomoaki Maeno… 40+ First-class voice actors are featured. This is an immersive feast for the ears you should never miss!<br/><br/>[Exclusive Office, Design Your Own Idol Zone]<br/>Pick your favorite furniture, ornaments, and themed suites to create your own dreamy little idol zone. Find your idols’ adorable reactions to special furniture! They may enjoy shaved ice on the beach, or sleep soundly with fluffy sleep masks on… discover more delicate, lovely reactions by yourself!<br/><br/>[Multilingual Stories, Brand New Experience]<br/>Multilingual stories are available in the official English version of Ensemble Stars!! Music for a richer game experience. You can choose to read the stories in English, Simplified Chinese, Traditional Chinese, or Korean.", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-07-22T09:17:54", "background_image": "https://media.rawg.io/media/screenshots/e30/e30548aa50663de685110677a10837ed_Of9x7km.jpg", "website": "https://ensemblestars.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Happy Elements S.a.r.l."], "genres": ["Casual"], "publishers": ["Happy Elements"], "esrb_rating": "Teen"}