{"id": 823870, "slug": "lifeline-beside-you-in-time", "name": "Lifeline: Beside You in Time", "name_original": "Lifeline: Beside You in Time", "description": "After a lengthy radio silence, Taylor returns at last! This brand new adventure finds the hapless astronaut on the other side of a black hole, relying on you alone to help make life-or-death decisions in a playable, branching story of survival in the depths of unknown space.<br/> <br/>But this time, there’s a twist: Players can also choose to communicate with T2, Taylor’s time-warped, alien-infected “evil twin,” helping or hindering as they see fit. Throughout the story, seemingly simple decisions can have profound effects. Make choices using your iPhone, iPad, or Apple Watch, and face the consequences alongside the desperate astronauts.<br/> <br/>Writer Dave Justus (Fables: The Wolf Among Us) returns to pen this fourth Taylor adventure -- the seventh overall in the acclaimed, multi-million-selling Green Series. Whether this is your first interaction with Taylor, or you’ve been a diehard fan from the beginning, you’ll discover a deep, immersive story of survival and perseverance, with many possible outcomes.<br/> <br/>The original Lifeline took the App Store by storm -- reaching #1 Top Paid Game on iPhone and Apple Watch in 29 countries -- while pioneering a new narrative experience enabled by modern devices. This story plays out in real time as the astronauts work to stay alive, with notifications delivering new messages throughout your day. Keep up as they come in, or catch up later when you’re free. You can even respond to Taylor or T2 directly from your Apple Watch or your iPhone lock screen, without launching into the app.<br/> <br/>Or, dive in and jump back to earlier points in the story, and discover what happens when you make a different choice. Complete any single path to restart the story and unlock this mode.<br/> <br/>The story contains no in-app purchases and no ads. An internet connection is not required. <br/> <br/>Praise for the original Lifeline:<br/><br/>“I’ve played many games that I find engrossing, but Lifeline may be one of the first that changed the way I thought about my daily routine, which leapt off the screen and became a part of my lived experience.” - Eli Cymet, Gamezebo<br/><br/>“I felt an immediate attachment to a fictional character pinging me from a strange galaxy to my wearable.” - Luke Hopewell, Gizmodo Australia<br/><br/>“For a few brief hours I cared – really cared – about the fate of a completely fictional character. I don’t think any other game I’ve played has made me feel that way before.” - Matt Thrower, PocketGamer<br/><br/>Lifeline: Beside You in Time was created by:<br/>Dave Justus<br/>Mars Jokela<br/>Colin Liotta<br/>Crystal Silva<br/>Matt Burchstead<br/><br/>Music by Rose Azerty<br/><br/>In loving memory of William Justus, my lifelong lifeline. Hope you dig this one, dad.", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-07-22T10:14:36", "background_image": "https://media.rawg.io/media/screenshots/ead/eada9a35a88af6462486efe3b9894531_AA1blQG.jpg", "website": "https://3minute.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["3 Minute Games"], "genres": ["Adventure", "RPG"], "publishers": ["3 Minute Games"], "esrb_rating": "Everyone 10+"}