{"id": 823854, "slug": "endless-national", "name": "Endless National", "name_original": "Endless National", "description": "What kind of story will be written when thousands of players do battle, form alliances, and expand their territory on a realistic battlefield? What sort of conflicts will be sparked when historical legends join your ranks? How would you use the countless strategies available to you in a realistic war between kingdoms?<br/> <br/>[Unique Points]<br/><br/>- Realistic Battlefield<br/>Immerse yourself in a realistic simulation of the real world! Take in the sights of famous geographical wonders all over the world, including the Great Rift Valley, the Suez Canal, and the Alps! Traverse the sprawling map and take over countless historical cities and buildings as you make use of the geographical conditions to strategize and do battle. Set up your fortifications and conquer your enemies!<br/><br/>- Clash Between Civilizations<br/>Civilizations that are too powerful may face a united resistance from those that feel threatened. Keep that in mind as you do battle against civilizations such as the Persians, Egyptians, and Japanese on your path to creating an everlasting one of your own.<br/><br/>- Fair Competition<br/>Everyone starts off on an equal footing, without VIP options, methods to purchase resources, or resource speed ups! Claim resource points on the map as you develop your city from scratch. Unlock more features over time with proper planning and storage of resources. Strategize to gain an edge over others!<br/><br/>- Strategic Diplomacy<br/>Your interactions with the various civilizations will change as you progress in the game. Join a guild and use the unique diplomatic features to quash enemies and build your own empire! Embark on grand expeditions and experience realistic shifts in advantage as you defend yourself against possible spies among your allies!<br/><br/>- Real-Time Strategy<br/>All battles on the map are in real-time, and there's more to battles than just simply deploying your troops. Attack your enemies' weakest troops! Intercept their reinforcements! Team up with your allies to surround them! Let your strategic prowess shine as you employ various tactics to achieve victory! <br/><br/>- Numerous Heroes<br/>Recruit from over 100 different legendary Heroes to help you command your troops and manage your city! Get famous names in history, such as Julius Caesar, Alexander the Great, and Joan of Arc to help you establish your indomitable empire!<br/><br/>- Pairing Skills<br/>Make your troops even stronger by pairing a large variety of skills with your Heroes! Train an invincible army and crush all who stand in your way!", "metacritic": null, "released": "2022-04-06", "tba": false, "updated": "2022-07-22T09:57:49", "background_image": "https://media.rawg.io/media/screenshots/9b2/9b2d66d65793680d62d8d5ba1fca7d66_fxdH7hY.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Patrick Er"], "genres": ["Strategy"], "publishers": ["Patrick Er"], "esrb_rating": "Teen"}