{"id": 823814, "slug": "truck-simulator-car-games-2022", "name": "Truck Simulator Car Games 2022", "name_original": "Truck Simulator Car Games 2022", "description": "Experience legendary American trucks by becoming a truck driver in Truck Simulator USA ! Become a trucker and challenge yourself by putting your patience, endurance, skill and performance up to the test!<br/>Lots of cargoes to choose from: from food to machinery to petrol cisterns. Choose a job and go! Transport cargo from city to city, while exploring the beautiful landscapes of the USA!<br/>All the trucks are fully upgradeable, both visually and performance wise. Change the look of your truck at anytime, and do not forget to also re-fill your gas tank at the fuel stations across the country!<br/>Do not get in trouble with the law by avoiding the speed limits and street signs!<br/><br/>KEY FEATURES OF THE GAME:<br/>- Cargo transport missions<br/>- A large list of cargoes<br/>- Legendary American trucks<br/>- A realistic American economy<br/>- Dynamic weather system including day and night<br/>- Truck service stations for upgrading your truck<br/>- Fuel stations all across the country<br/>- Huge open world map with beautiful landscapes<br/>- Realistic truck physics and sound design<br/>- Impressive graphics and visuals<br/>- Immersive gameplay<br/><br/>Explore a huge open world map set in the country of the USA. Start your career as a truck driver and get to the top slowly, by completing challenges and doing missions!<br/>Explore pleasing landscapes ranging from desert regions to farmland to beautiful forests, all with an impressive level of detail! Choose from the many jobs available and complete them for amazing rewards!<br/>Get to transport cargo across the country during the day or during the night!<br/><br/>If you have what it takes to become a truck driver, this game is just for you! Join the tens of thousands of people who play this game everyday by downloading it for free right now!<br/><br/>Privacy Policy: https://sentida.xyz/privacy.html<br/>Terms Of Use: https://sentida.xyz/terms.html", "metacritic": null, "released": "2022-07-01", "tba": false, "updated": "2022-07-22T09:15:19", "background_image": "https://media.rawg.io/media/screenshots/fe8/fe8a52c610cedb5e43844fcf9f014aa2.jpg", "website": "https://f21e9d59e.app-ads-txt.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Radu Luchian"], "genres": ["Simulation", "Racing"], "publishers": ["Radu Luchian"], "esrb_rating": "Everyone 10+"}