{"id": 8239, "slug": "cookie-clickers-2", "name": "Cookie Clickers 2", "name_original": "Cookie Clickers 2", "description": "Be prepared for endless hours of fun and entertainment! Download now for free!<br/><br/>Baking cookies is very simple:<br/>- Bake as many cookies as you can by tapping on a giant cookie. The faster you tap, the more you bake!<br/>- As soon as you have enough cookies, head over to the Cookie Shop and use your cookies to buy upgrades and PowerUps so you can bake cookies even faster!<br/>- Keep an eye out for the Golden Cookie Rain and flavored milk waves. They'll help boost your production!<br/>- You have 2 new powerful boosts at your fingertips: The Lucky Spin with a free daily spin, and the Time Machine which speeds up time AND your cookie production!<br/>- Brand new CookieLand Map, where you can level-up, track your progress, and see what level your friends are on! Be the fastest to complete the achievements to get ahead of everyone!<br/><br/>Cookie Clickers 2's endless gameplay will allow you to play for an indefinite amount of time-- or at least until you bake such an extraordinary amount of cookies that your device will not be able to count them anymore!<br/><br/>Become a Cookie Clickers God by baking 1 QUADRILLION cookies!<br/><br/>Log in to Facebook to play with your friends and compare your Cookie score in the global leaderboards!<br/><br/>Baking has never been so fun. Start now! Invite your friends to bake too and have fun competing with each other for the title of fastest cookie baker! <br/><br/>Are you already a fan of Cookie Clickers Saga? If so, like us on Facebook, follow us on Twitter and Instagram and visit our website for the latest news:<br/><br/>facebook.com/redbitgames <br/>twitter.com/redbitgames<br/>instagram.com/redbitgames<br/>www.redbitgames.it<br/><br/>Last but not least, a big THANK YOU to all for playing Cookie Clickers 2! Have fun!", "metacritic": null, "released": "2016-10-12", "tba": false, "updated": "2019-07-29T22:25:13", "background_image": "https://media.rawg.io/media/screenshots/92d/92d48e9f8237f8b6606616a0d21df260.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["redBit games"], "genres": ["Strategy", "Arcade", "Casual"], "publishers": ["redBit games"], "esrb_rating": null}