{"id": 82396, "slug": "penguin-brawl-points-sheet", "name": "Penguin Brawl Points Sheet", "name_original": "Penguin Brawl Points Sheet", "description": "Penguin Brawl: Heroes of Pentarctica is a fast-paced action card game about penguins, deception and the thrill of glorious battle! The game itself is deceptively simple. Learn what each card type does, get to know the basics, and away you go; the rest is down to how you play.<br/><br/>This companion app has been designed to make keeping score of your player points easy-peasy! From the menu screen choose Points Sheet then add players by typing in their names (the most fun will come from giving them crazy nicknames!). This automatically gives the added player their starting 5 points. Add as many players as there are joining in (if there's more than 8 players get the app installed on a second device). Names can be 'locked' (to avoid accidentally clicking on them while playing) using the lock icon in the top left of the screen.<br/><br/>Once the game starts you can add or deduct points using the appropriate buttons next to each player's name. If a player's points are ever reduced to 0 they become a Rogue Penguin and their name will turn red.<br/><br/>At the end of a game, if you're playing again, simply edit if necessary (editing a name will automatically reset it to 5 points) and restore any remaining player's points back to 5 manually.<br/><br/>If you ever need to remove or reset any or all of the names and scores, return to the Main Menu screen (press the X button in the top right) and click on Clear All.<br/><br/>That's about it. Have fun!", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2019-10-22T14:08:13", "background_image": "https://media.rawg.io/media/screenshots/85f/85fe5caf3f87bb16dbc9ffee86120129.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mark Stoneham"], "genres": ["Board Games", "Card"], "publishers": ["Mark Stoneham"], "esrb_rating": "Everyone 10+"}