{"id": 824087, "slug": "edd", "name": "E.D.D", "name_original": "E.D.D", "description": "<p><strong>E.D.D, an android with a powerful A.I has been built for military application and is being tested in a facility by a group of  scientists. <br/>However a mysterious entity awakens and begins to affect the development of the android.</strong></p>\n<p>E.D.D is <strong>3D platformer</strong> and a <strong>visual-novel</strong> with a story happening in only one location getting corrupted over time.<br/>You play E.D.D K54.232. nicknamed \"Edd\", a new iteration of an Android  with a powerful A.I developed by TETRA, a shady corporation. Edd must be \"mentally\" trained and tested to ensure the body is functioning. </p>\n<p>The game has <strong>two gameplay phases</strong>, a 3D platformer where you have to realise test and a visual-novel with dialogue changing according to your <strong>choices</strong> in the story.</p>\n<ul><li>A fusion between the themes and universes of Asimov and Lovecraft</li><li>A heavy atmosphere for the protagonist and the player</li><li>Unique character to discover</li><li>The level is filled with elements to discover. Will you disobey and explore the test area to see them ?</li></ul>\n<p>This is the second year project of students at e-artsup Bordeaux, in France. The game was made in 3 months based on the concept of mixing themes and universes from both Asimov and Lovecraft.</p>\n<p>E.D.D was designed with 3 days in mind, only one came to be. In future days you would have access to different platformer and visual-novel phases according to your allegiance (rebel, neutral or loyal) defined by an invisible mechanic. The ending would have also changed with 6 of them being thought.</p>", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-22T11:53:07", "background_image": "https://media.rawg.io/media/screenshots/8f6/8f693de93539c0f3023c4a1e40342271.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eden", "Kiluns", "Thibault Pannier"], "genres": [], "publishers": [], "esrb_rating": null}