{"id": 824170, "slug": "lucky-lottery-ticket-gay-romance-visual-novel", "name": "Lucky Lottery Ticket (Gay Romance Visual Novel)", "name_original": "Lucky Lottery Ticket (Gay Romance Visual Novel)", "description": "<p>“The Lucky Lottery Ticket” is a short gay romance visual novel about a fashion designer and an actor, who spend one day together at the seaside, and fall madly in love with each other.\r\n  </p>\n<p>*</p>\n<p>When Luke decides to make a donation to the Dolphin Rescue and Research Center in Maui, New Zealand, little does he know that it’ll change his life.\r\n  </p>\n<p>His donation ticket is chosen as the winning one, and he gets the opportunity to meet Gary, an attractive tv series actor. Luke, who designs clothes, sees it mostly as a business opportunity, however, he can’t deny having incredible chemistry with Gary.</p>\n<p>Unfortunately, time flows fast, and soon, the day is going to end, which means that the two will have to part their ways and return to their separate lives. Luke is ready to let this sudden crush go, but Gary struggles with it.</p>\n<p>Will they see each other again?\r\n  </p>\n<p>Will destiny bring them together against all odds?</p>\n<p><strong>Player's Age: 18+</strong> (mentions some adult topics, and was based on a short story originally <em>only</em> for adult audiences)\r\n</p>\n\n<ul><li>7000+ words of professionally written and edited text, with guaranteed happy ending.</li><li>A linear storyline / no choices (sorry... we believe in determinism when it comes to love!).</li><li>Important themes, such as being environmentally conscious, following one's dreams despite all odds, seeing life as a journey, and tuning into one's soul   through spiritual practice. </li><li>2 main characters: Luke (fashion designer) and Gary (famous actor). This game has no character sprites, just character portraits.</li><li>Game interface stylized as the main character's desk, with various story-related  ephemera such as posters, leaflets, stickers, maps, fabric samples, and others (static, non clickable/interactive, but nevertheless fun!).</li><li>Gameplay uncommon for the visual novel genre: rather than follow the main characters across different locations, you experience the story by reading the main character's notes  (displayed on the text interface) and looking at the photos and souvenirs scattered on their desk. </li><li>A soundtrack consisting of chill, instrumental ballads, plus additional sound effects to create a tropical vibe.</li></ul>\n\n<p><strong>Luke</strong> is an Australian fashion designer with bad temper, who's been single for a while. When his friend Melinda jokingly tells him, Gary might be the one, Luke just brushes her off. He's rather down to earth, although he dreams about creating the new mainstream.</p>\n<p><strong>Gary </strong>is an actor, most famous for playing Demarcus in the vampire tv drama named Crimson Redemption. He's a quiet, kind and tactful person, who however has a certain determination. He used to sleep on trains, and eat ready-to-go sandwiches, to get his big chance.</p>\n<p>Luke and Gary bond over their desire to make a change in the world, both as artists and private people.</p>\n\n\n\n\n\n\n<p><strong>The game is controlled by mouse and keyboard. Beyond you can find information about keyboard shortcuts:</strong>\n</p>\n<ul><li><strong>S</strong> - Save Game\r\n</li><li><strong>L</strong> - Load Game\r\n</li><li><strong>Space </strong>- Progress Game\r\n</li><li><strong>Esc </strong>- Return to Title Screen\r\n</li><li><strong>B </strong>- Display Backlog\r\n</li><li><strong>M </strong>- Menu Screen\r\n</li><li><strong>A </strong>- Auto Mode\r\n</li></ul>\n\n<p>Hasalynx Games is an indie game gig that doesn't have any external funding, and mostly relies on unpaid human effort to keep producing its games. We use mostly free resources and create scenarios from ready short stories and novels published by our people. If these games spark your curiosity, please buy them (they're so cheap!), comment, and spread positive word. Also, don't forget to add this game to your collections and follow Hasalynx Games on itch.io, so as to receive updates when a new game is up!</p>", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-22T12:30:08", "background_image": "https://media.rawg.io/media/screenshots/aa2/aa2ed156c0726706b8c9b9ca1e8da16b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hasalynx Games"], "genres": [], "publishers": [], "esrb_rating": null}