{"id": 824124, "slug": "disgard-battlemage", "name": "DISGARD: BATTLEMAGE", "name_original": "DISGARD: BATTLEMAGE", "description": "<p>                                                                   <br/></p>\n<p>THIS IS AN TOP DOWN OPEN WORLD RPG WITH NO LEVEL CAP.</p>\n<p>YOU ARE A BATTLEMAGE. YOU ARE ON AN ISLAND IN SEARCH OF A ROGUE MAGE. SEARCH FOR HIM AND DEFEAT HIM WHILE EXPLORING THIS DANGEROUS ISLAND! USE A MAGIC SWORD AND A VARIETY OF SKILLS TO DEFEAT OPPONENTS AND DODGE-ROLL OUT OF HARMS WAY!<br/></p>\n<p><strong>ABILITIES<br/></strong></p>\n<p>MAGIC BOLT - SHOOTS AN BOLT OF MAGIC! (LOW ENERGY COST, LOW DAMAGE)<br/></p>\n<p>FIREBOLT - SHOOTS AN BOLT OF FIRE AND BURNS THE AREA! (MEDIUM ENERGY COST, MEDIUM DAMAGE)</p>\n<p>ICE BOLT - SHOOTS AN ICE BOLT THAT SLOWS AND DAMAGES ENEMIES (MEDIUM ENERGY COST, MEDIUM DAMAGE)<br/></p>\n<br/>\n<p>POISON BOLT - SHOOTS AN BOLT OF POISON AND POISONS ENEMIES! (HIGH ENERGY COST, HIGH DAMAGE)</p>\n\n<p>FORCE BLAST - A BLAST OF FORCE TO KNOCK ENEMIES BACK! (LOW ENERGY COST, LOW DAMAGE) (LOOKS BETTER IN-GAME WITH EFFECTS)<br/></p>\n\n<p>GOLEM - SUMMON A GOLEM TO DESTROY YOUR FOES! (VERY HIGH ENERGY COST, DOES HIGH DAMAGE)</p>\n<p>              </p>\n<p>  <br/></p>\n<p>HEAL - USE ENERGY TO RESTORE HP! (COSTS 1 ENERGY FOR 1 HEALTH POINT)</p>\n<br/>\n\n<p>MAGIC SWORD - USE A MAGICAL SWORD TO SLICE THROUGH YOUR ENEMIES! (HIGH DAMAGE, HIGH STAMINA AND ENERGY COST)</p>\n\n\n<p>HOPE YOU GUYS ENJOY IT!<br/></p>", "metacritic": null, "released": "2022-07-08", "tba": false, "updated": "2022-07-22T12:09:10", "background_image": "https://media.rawg.io/media/screenshots/8b5/8b5f820607cbc74f9cf67a38d7e633e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DEANER"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}