{"id": 824193, "slug": "survive-the-robodome", "name": "Survive the Robodome", "name_original": "Survive the Robodome", "description": "<p>Ah, a fresh clone has arrived from central. Are you ready to engage in gladiatorial marksmanship, to display the heroism of your extinct species for the edification of the Autonomous Diaspora of Synthetics? No? Unfortunately we don't have the infrastructure in place to support that answer, your only way out is to endure the trials ahead.</p>\n<p><em>Survive the Robodome </em>is a PVE wave-based first person shooter, currently featuring three distinct enemy types with unique AI/attack patterns. The increasingly large hordes demand thoughtful movement and targeting in order to stand any chance.<br/></p>\r\nDevelopment State/Disclaimers\r\n<ul><li><em>Survive the Robodome </em>is my first PC game, so it is currently missing some niceties and polish, like an in-game settings menu.  Also, it's built on Unreal Engine 5 and has a silly number of enemies, so be weary if you have a low-spec PC. ESC to pause the game and/or quit if things get too wild.</li><li>If you'd like to see me implement more polish, optimization, enemies, etc, consider purchasing the game so I can justify spending more time on it, and/or provide any (constructive ♡) feedback on my discord. My only current \"set in stone\" plan is to record a video for this page, everything else depends on interest.</li><li>If you're curious, my personal best time as of writing is 9:35. Waves are coded in up to ~30 minutes.</li><li>Lastly, general epilepsy warning. There's no intentional strobing, but there are explosions and a lot of moving emissive lights.</li></ul>", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-22T12:43:18", "background_image": "https://media.rawg.io/media/screenshots/002/002b270a5a34521d0b3b65ce2d6def2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Symphoneers"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}