{"id": 824145, "slug": "galactic-tomb-amstrad-cpc", "name": "Galactic Tomb (Amstrad CPC)", "name_original": "Galactic Tomb (Amstrad CPC)", "description": "<p><strong>DEVELOPMENT TEAM</strong></p>\n<p>PROGRAM: Artaburu<br/>GRAPHICS: Sad1942<br/>MUSIC &amp; FX: McKlain<br/>STORY, CONCEPT AND IDEA: Litos<br/>COVER ILLUSTRATION: Lorena Azpiri</p>\n\n<p>Información adicional en la ficha de Amstrad ESP<br/></p>\n<p><em>Additional information on the </em><em>Amstrad ESP data sheet</em></p>\n<p>En la era del primer milenio tres reyes gobernaban en la galaxia de Ururben. Tres reyes para tres reinos que no basaban su civilización en la tecnología sino en la magia. Cada uno de ellos contaba con una fracción de poder suficiente para revivir a otro rey, por lo cual, el triunvirato galáctico, basado en la paz y el respeto, parecía ser infinito. Infinito hasta la llegada de Shakar que, a través de oscuras artes, consiguió derrocar y aniquilar a los tres reyes. Posteriormente impondría la tecnología como estandarte de su imperio y ocultaría los místicos cuerpos reales en tres tumbas ocultas en alguna parte de la galaxia con el fin de,si fuera necesario, utilizar sus incipientes poderes para ayudarle a mantener su artificial imperio.<br/></p>\n<p>Tercera era del imperio Siemb. Los últimos días del emperador están llegando. Después de alargar artificialmente su vida hasta límites insospechados, su equipo médico no encuentra forma de prolongar más su reinado. Shakar ha sido el emperador más longevo de la historia conocida<br/>y no está dispuesto a ver el fin de sus días. Lo que la medicina no puede solucionar lo harán las leyendas, mitos y magia que envuelven la más antigua de las leyendas imperiales: <strong><em>Las tres tumbas de Siemb.</em></strong></p>\n<p><em>In the era of the first millennium three kings ruled in the galaxy of Ururben. Three kings for three kingdoms that did not base their civilization on technology but on magic. Each of them had a fraction of power enough to revive another king, so the galactic triumvirate, based on peace and respect, seemed to be infinite. Infinite until the arrival of Shakar who, through dark arts, managed to overthrow and annihilate the three kings. He would later impose technology as the standard of his empire and hide the mystical royal bodies in three hidden tombs somewhere in the galaxy in order to, if necessary, use his incipient powers to help him maintain his artificial empire.</em></p>\n<p><em>Third era of the Siemb empire. The last days of the emperor are coming. After artificially extending his life to unsuspected limits, his medical team cannot find a way to prolong his reign any longer. Shakar has been the longest-lived emperor in known history and is not willing to see the end of his reign.</em></p>\n<p><em>and he is not willing to see the end of his days. What medicine cannot solve will be solved by the legends, myths and magic that surround the oldest of the imperial legends: </em><strong><em>The three tombs of Siemb.</em></strong></p>\n<p><strong>EL JUEGO</strong><br/></p>\n<p>Tú, como comandante más destacado de la élite del ejército imperial, eres designado para llevar a cabo la misión. A través de tres mundos diferentes tendrás que buscar las místicas tumbas para así conseguir los objetos mágicos que permitirán prolongar aún más la vida del emperador.</p>\n<p>La misión no es simple. Antes tendrás que encontrar la forma de acceder a las tumbas que, además, se encuentran custodiadas por tres singulares guardianes de diferentes épocas del pasado, presente y futuro. Cada uno de los mundos pertenecen a un imperio enemigo del sistema Siemb y, por supuesto, se mostrarán hostiles al pasar por su territorio.</p>\n<p><em><strong>THE GAME<br/></strong>You, as the most prominent commander of the elite of the imperial army, are appointed to carry out the mission. Throughout three different worlds you will have to search for the mystical tombs in order to get the magic objects that will allow you to prolong the emperor's life even more.</em></p>\n<p><em>The mission is not simple. First you will have to find the way to access the tombs, which are also guarded by three unique guardians from different periods of the past, present and future. Each of the worlds belongs to an enemy empire of the Siemb system and, of course, they will be hostile when you pass through their territory.</em></p>\n<p><strong>MUNDO PHERENOS<br/></strong>En tu primera misión, la nave de infiltración te deposita en una zona de alto riesgo por las frecuentes lluvias de meteoritos que sufre el sector. Vas armado con un rifle de rayos termoatmosféricos y equipado con una coraza de aleación de technita.</p>\n<p>Pherenos es un planeta con zonas volcánicas, ríos de lava y otros peligros. Esta civilización, es mucho menos avanzada que el imperio Siemb. Aún así son temibles enemigos y grandes estrategas que cuentan con el terreno como su aliado.</p>\n<p>La zona en la que te internarás está poblada por los A'rnhs, peligrosos seres reptilianos armados con rifles de proyectiles. Sabemos que los A'rnhs han creado un complejo sistema de campos de fuerza que pueden ser anulados destruyendo los primitivos generadores que los mantienen.</p>\n<p>Tu primer objetivo en esta misión es encontrar la llave, oculta en algún lugar del templo A'rnhs, que te permitirá acceder a la primera de las tumbas místicas, custodiada por el centinela alado Ona'rk.</p>\n<p><strong>MUNDO ROBOTA<br/></strong>El teletransportador de tu nave de infiltración te ha permitido hackear la red de transporte rápido de Robota, materializándote en la base TKG45, una planta de procesamiento de residuos ácidos, en la que se encuentra el objetivo de tu segunda misión.</p>\n<p>En esta ocasión, junto a tu equipo estándar, cuentas con una mochilajet con un autogenerador de energía. La mochila precisará de cortos espacios de tiempo para cargar el autogenerador tras un uso prolongado.</p>\n<p>El sistema de mundo Robota debió ser hace siglos hogar de sabios humanos, sin embargo, ahora sus únicos dominantes son las máquinas. Oculta bajo una trampilla se encuentra la antigua tumba de Siemb.</p>\n<p>Consigue las tarjetas de memoria de los cuatro ordenadores principales de la base. Las cuatro tarjetas, ensambladas e introducidas en un lector que deberás localizar, te permitirá acceder en la estancia secreta que oculta la tumba de Siemb,  protegida por un cybertech de seguridad P310T0.</p>\n<p>La base TKG45 está protegida por la más alta tecnología creada en Robota y sus ordenadores principales están protegidos por campos de energía que tendrás que anular destruyendo sus correspondientes generadores diseminados por la base. Cuidado con los drones centinela, los droids de reconocimiento, los pajarobots y demás tecnología de seguridad diseminada por la instalación.</p>\n<p><strong>MUNDO MICROBIA<br/></strong>En esta ocasión te encuentras a los mando de un mini-sub A21 de segunda generación. Tu mini-sub está armado con dos láseres de corto alcance que te permitirá deshacerte de tus enemigos, así como un energizador del casco, que te permitirá electrificar la cubierta y deshacerte de enemigos adheridos a la nave.</p>\n<p>Mundo Microbia está habitado por diferentes seres evolucionados de pequeños microorganismos que te dejan petrificado ante su sola presencia. Sólo tienen un objetivo: COMERTE.</p>\n<p>Busca la llave de plata y la llave de oro para abrir la cerradura de la puerta que oculta la última tumba. Solo queda vencer al último y más peligroso de los guardianes de las tres tumbas y tu misión habrá llegado a su fin.</p>\n<p><em><strong>PHERENOS WORLD</strong><br/>On your first mission, the infiltration ship deposits you in a high-risk zone due to the frequent meteor showers that the sector is suffering from. You are armed with a thermoatmospheric ray rifle and equipped with a technite alloy armor.</em></p>\n<p><em>Pherenos is a planet with volcanic zones, lava rivers and other dangers. This civilization is much less advanced than the Siemb empire. Even so, they are fearsome enemies and great strategists who count on the terrain as their ally.</em></p>\n<p><em>The area you will enter is populated by the A'rnhs, dangerous reptilian beings armed with projectile rifles. We know that the A'rnhs have created a complex system of force fields that can be overridden by destroying the primitive generators that maintain them.</em></p>\n<p><em>Your first objective in this mission is to find the key, hidden somewhere in the A'rnhs temple, which will allow you to access the first of the mystical tombs, guarded by the winged sentinel Ona'rk.</em></p>\n<p><em><strong>ROBOT WORLD</strong><br/>Your infiltration ship's teleporter has allowed you to hack into Robota's rapid transport network, materializing you at the TKG45 base, an acidic waste processing plant, where the objective of your second mission is located.</em></p>\n<p><em>This time, along with your standard equipment, you have a backpack with an energy auto-generator. The backpack will require short periods of time to charge the autogenerator after prolonged use.</em></p>\n<p><em>The Robota world system must have been home to human sages centuries ago, however, now its only dominants are machines. Hidden under a trapdoor is the ancient tomb of Siemb.</em></p>\n<p><em>Get the memory cards from the four main computers in the base. The four cards, assembled and inserted into a reader that you will have to locate, will allow you to access the secret room that hides Siemb's tomb, protected by a P310T0 security cybertech.</em></p>\n<p><em>The TKG45 base is protected by the highest technology created in Robota and its main computers are protected by energy fields that you will have to override by destroying their corresponding generators scattered around the base. Watch out for sentry drones, reconnaissance droids, birdbots and other security technology scattered around the facility.</em></p>\n<p><em><strong>MICROBIA WORLD</strong><br/>This time you are in command of a second generation A21 mini-sub. Your mini-sub is armed with two short-range lasers that will allow you to get rid of your enemies, as well as a hull energizer, which will allow you to electrify the deck and get rid of enemies attached to the ship.</em></p>\n<p><em>Mundo Microbia is inhabited by different beings evolved from small microorganisms that leave you petrified by their mere presence. They have only one goal: to EAT YOU.</em></p>\n<p><em>Find the silver key and the gold key to open the lock of the door that hides the last tomb. All that remains is to defeat the last and most dangerous of the guardians of the three tombs and your mission will be over.</em></p>\n<p><strong>CONTROLES<br/></strong>Puedes utilizar joystick o teclado. Las teclas son redefinibles.</p>\n<p>El comandante puede ir a derecha e izquierda, agacharse, saltar y realizar vuelos cortos cuando cuentes con la mochila-jet, así como disparar.</p>\n<p>Cuando controles el mini-sub podrás ir en las cuatro direcciones , disparar y utilizar la opción de “energizar” el casco de la nave.</p>\n<p><em><strong>CONTROLS</strong><br/></em><em>You can use joystick or keyboard. The keys can be redefined.</em></p>\n<p><em>The commander can go left and right, crouch, jump and make short flights when you have the jetpack, as well as shoot.</em></p>\n<p><em>When controlling the mini-sub you can go in all four directions, shoot and use the option to \"energize\" the hull of the ship.</em></p>", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-22T12:19:06", "background_image": "https://media.rawg.io/media/screenshots/8b6/8b6ed4e833f9dcb08a6b592e9147d8df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amstrad ESP"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}