{"id": 82423, "slug": "fighting-fantasy-starship-traveller", "name": "Fighting Fantasy: Starship Traveller", "name_original": "Fighting Fantasy: Starship Traveller", "description": "Steve Jackson and Tin Man Games present Starship Traveller - an adventure of the far future in which YOU are the hero!<br/><br/>Sucked through the appalling nightmare of the Seltsian Void, the starship Traveller emerges at the other side of the black hole into an unknown universe. YOU are the captain of the Traveller, and her fate lies in your hands. Will you be able to discover the way back to Earth from the alien peoples and planets you encounter, or will you and your crew be doomed to roam uncharted space forever?<br/><br/>** REVIEWS **<br/><br/>\"The original gamebook has been beautifully revived, and now stands shoulder-to-shoulder with its sci-fi peers across all entertainment media.\" - POCKET GAMER - 9 out of 10 - Gold Award!<br/><br/>\"It's interesting because in the increasingly large mobile gamebook scene, I find Starship Traveller stands out for exactly the same reasons it did 30 (oh my, is it really 30?) years ago. We've got lots of fantasy books, some horror books, a few modern books, but this energetic take on classic sci-fi is a breath of fresh air...\" - TOUCH ARCADE - 4.5 out of 5!<br/><br/>\"...it’s a no brainer of a purchase – especially for Sci-Fi fans.\" - 148 APPS - 4 out of 5!<br/><br/>** FEATURES **<br/><br/>• Fully customize your entire crew, from their names, their stats - and even rename your starship!<br/>• Three styles of combat: melee, phaser and even starship battles!<br/>• Switch around your crew before each battle round for added strategy during combat!<br/>• Beam down to strange alien planets, selecting your finest crew for the job!<br/>• Auto-mapping charts your travels through the cosmos! New planets and stars appear as you discover them!<br/>• All-new full colour illustrations by Simon Lissaman, with a space-age cover by Dan Maxwell.<br/>• Achievements to find throughout the gamebook.<br/><br/>Starship Traveller has been created using Tin Man Games’ critically acclaimed Gamebook Adventures Engine featuring:<br/><br/>• Read the book horizontally or vertically on your tablet.<br/>• An automated Adventure Sheet to keep track of stats and inventory.<br/>• Realistic physics based dice rolling. Shake your device!<br/>• Artwork gallery. Find an illustration in the gamebook and be able to access it full-screen forever.<br/>• Bookmarking system which saves your position in the gamebook, much like putting your fingers between the pages to remember your previous page when reading the paperback!<br/>• Specially composed soundtrack and sound effects.<br/><br/>Tin Man Games have signed a licensing deal to release the Fighting Fantasy series on iOS, so expect to see more of your favourite adventure gamebooks appearing soon!<br/><br/>Also available: The Forest of Doom, Island of the Lizard King, House of Hell, Starship Traveller, Blood of the Zombies and Bloodbones!<br/>Coming Soon: The Warlock of Firetop Mountain!", "metacritic": null, "released": "2014-04-10", "tba": false, "updated": "2019-10-22T14:08:13", "background_image": "https://media.rawg.io/media/screenshots/2eb/2ebe75e53f2fb48737277c8b34befd73.jpg", "website": "http://www.gamebookadventures.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tin Man Games"], "genres": ["RPG"], "publishers": ["Tin Man Games"], "esrb_rating": null}