{"id": 824459, "slug": "bezier-defense", "name": "Bezier Defense", "name_original": "Bezier Defense", "description": "<p> <strong>Bézier Defense </strong> is a 3D video game developed with the Unity graphics engine.</p>\n<p>It is a classic Tower Defense : the player's objective is to defend the castle from incoming waves of enemies! The unique feature of Bézier Defense is that the paths taken by the enemy waves and the defense systems are placed along Bézier curves.</p>\n\n<p>Between one wave and the next, the player can change the paths so that the monsters are forced to take a more circuitous and better-defended route.<br/></p>\n<p>It is important to adopt a defense strategy to stop the enemies' advance, even according to their unique characteristics:</p>\n<p>     - <strong>Warrior Wolves</strong> are small and fast, but very weak;</p>\n<p>      - <strong>Golems</strong> are very strong, but slow;</p>\n<p>      - <strong>Infernal Boars</strong> have balanced characteristics.</p>\n\n\r\nComands\r\n\r\n\r\n\r\n\r\n\r\n\r\nKeyboard\r\n\r\n\r\nMouse\r\n\r\n\r\n\r\n\r\nA: move the camera to the left.\r\n<br/>\r\nD: move the camera to the right.<br/>\r\nW: move the camera up.<br/>\r\nS: move the camera down.<br/><br/>\r\nQ: move the camera closer.<br/>\r\nE: moves the camera away.<br/><br/>\r\nESC: alternative key to the right click of the mouse.\r\n\r\n\r\nLeft click:\r\nselects a curve to enter edit mode.<br/><br/>\r\nRight click:\r\ndeselects a curve;\r\nallows you to exit creation mode;\r\n\r\n\r\n\r\nBézier curve\r\n<p><strong>Paths</strong> and <strong>defense</strong> systems are associated with Bézier curves, which define their <strong>shape</strong>. <br/>You can edit the curve through the associated <strong>control points</strong> once you enter edit mode (see bottom of page). To change position of control points, simply drag them following a mouse click ( drag &amp; drop ) . </p>\n<p>Paths can <strong>only</strong> be changed between waves. Defenses can be built and modified at any time.</p>\n<p>Paths as well as each type of defense have specific <strong>constraints</strong> on the associated curve control points, highlighted in <strong>red</strong> if they are in an invalid position, and in green if they are not.<br/></p>\r\nMobile defense systems\r\n\r\n\r\n\r\nShuriken<br/><br/>\r\n\r\n\r\nMobile ballista<br/><br/>\r\n\r\n\r\nFixed ballista<br/><br/>\r\n\r\n\r\nFire-breathing lions<br/><br/>\r\n\r\n\r\n\r\n\r\nPerforms continuous movement along the curve, damaging and slowing down affected enemies.\r\nYou can place the associated curve astride paths.\r\n<br/><br/>\r\nPOWER-UP: Slows down hit enemies more.\r\n\r\n\r\nShoots ahead by continuously moving along the associated curve. Causes severe damage to affected enemies.\r\n<br/><br/>\r\nPOWER-UP: Increased volume of fire.\r\n\r\n\r\nIt positions itself at a specific point on the associated curve and fires ahead. It has less damage than the moving ballista, but it is easier to direct it as needed.\r\n<br/><br/>\r\nPOWER-UP: Up to 3 ballistae per defense of this type.\r\n\r\n\r\nPassive defenses within the castle walls. It is not possible to build new ones or upgrade them. \r\nThey cause continuous damage to monsters in contact with flames.\r\n\r\n\r\n\r\nGUI\r\n\r\n\r\n\r\nResources and status of the castle<br/><br/>\r\n\r\n\r\nConstruction menu<br/><br/>\r\n\r\n\r\nHow to build<br/><br/>\r\n\r\n\r\nHow to modify a defense<br/><br/>\r\n\r\n\r\n\r\n\r\nBuilding and upgrading defense systems comes at a cost. You will gain resources by looting the bodies of fallen enemies.\r\n<br/>\r\nThe castle has limited resistance. If an enemy manages to penetrate the walls, it will begin to attack the internal structures, causing permanent damage.\r\n\r\n\r\nAllows you to build new defense systems within the battlefield as well as upgrade or remove existing ones. Construction and upgrades have a respective cost of 20 and 15 resources. \r\nDemolishing a defense earns a gain equal to half the expense used to build and upgrade it.\r\n\r\n\r\nClicking on one of the buttons dedicated to creating defenses will enter creation mode. The cursor will turn green in valid positions to place a control point, red in invalid positions. \r\nOnce the 3 control points are placed, the defense is created according to the curve associated with the placed control points.\r\nYou can cancel the creation of a defense by pressing the right mouse button or the ESC key on the keyboard. \r\n\r\n\r\nTo enhance and remove defenses, it is necessary to enter edit mode. Clicking on the 3D object associated with a curve when the cursor is yellow will select that curve for editing. The control points will then be visible for movement. The enhance (up arrow) and demolition (cross) buttons are enabled. By clicking on the respective button, the defense is either upgraded by one level or demolished, leading to a reduction or increase in available resources.\r\n\r\n\r\n\r\n\n<p>The project is for teaching purposes only: it was created for the computational geometry course at the University of Milan.<br/></p>\n<p>Course of UNIMI<br/></p>", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-07-22T14:38:51", "background_image": "https://media.rawg.io/media/screenshots/a5e/a5e9b0168f9b0a6efd1eabf0d44a8ff7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DavideDeodati"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}