{"id": 82445, "slug": "european-cargo-truck-simulator-3d", "name": "European Cargo Truck Simulator 3D", "name_original": "European Cargo Truck Simulator 3D", "description": "Drive a real truck in European Cargo Truck Simulator!<br/><br/>Become a European truck driver. Visit Germany, France, Switzerland, Austria and Italy! Choose cargo and drive it. Transport cargo to city warehouses. Upgrade your truck for better driving. Fix and refuel a European truck at service stations, driver. Avoid driving cargo above speed limit, follow driving rules for the transport. Spend money wisely. Enjoy day and night driving simulator.<br/><br/>Features of European Cargo Truck Simulator:<br/><br/>- Transport missions<br/>- Many European cities: in Germany, France, Switzerland, Austria and Italy<br/>- Different cargo<br/>- Real European trucks<br/>- Game economy simulator<br/>- Day and night transport driving<br/>- Truck service stations<br/>- Gas stations on the road<br/><br/>European Cargo Truck Simulator is for real drivers. Transport cargo to visit different European cities, enjoy the long driving. Good transport controls help your be a driver in the simulator. Continue cargo driving even at night. Choose missions for your big European truck. Spend your evening on the road, driver!<br/><br/>Be accurate European truck driver. Keep your transport in good condition. Feel what is European road in European Cargo Truck driver Simulator. Upgrade the transport, prepare it for road, the simulator is challenging.<br/><br/>Use a simulator's map and a driving arrow to check the road. Pay driver's attention to simulator's economy - spend money on upgrades to improve transport cargo driving. Explore European road in the simulator, earn money for cargo truck driving. Be a truck driver with the simulator - try long-distance driving, transport cargo, visit European cities, refuel the transport on the road.<br/><br/>Feel like a European truck driver with our driver simulator. Transport cargo to different cities. Choose driver missions. Repair the truck if necessary. Transport all cargo and earn money for driving. Upgrade to transport faster and enjoy the driver simulator. Visit real European cities. Try easy truck controls we made in the simulator.<br/><br/>Road is challenging, driver! Transport cargo in truck simulator to many European cities. Try truck driving and write us. Earn money for cargo delivery. Follow driver regulations, transport accurately. Buy a new European truck if you don't like your transport in the driver simulator.<br/><br/>Try all transport missions in European Cargo Truck Simulator and enjoy being a driver!", "metacritic": null, "released": "2016-06-18", "tba": false, "updated": "2019-10-22T14:22:40", "background_image": "https://media.rawg.io/media/screenshots/e66/e66f1a4ee08ff973626b21d74785970a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Maveriks"], "genres": ["Simulation", "Racing"], "publishers": ["Game Maveriks OOO"], "esrb_rating": null}