{"id": 824486, "slug": "la-guerra-de-gamber-amstrad-cpc", "name": "La Guerra de Gamber (Amstrad CPC)", "name_original": "La Guerra de Gamber (Amstrad CPC)", "description": "<p><strong>Team</strong></p>\n<p>CONCEPT, IDEA AND PROGRAM: gg<br/>GRAPHICS: gg and Litos<br/>LOADING SCREEN: 6128<br/>SOUND &amp; FX: McKlain<br/>TESTING AND IDEAS: gg, 6128, Litos, MiguelSky, McKlain<br/>COVER ILLUSTRATION: 6128</p>\n<p>J. T. Gamber es un ex-soldado. Fue miembro de las fuerzas especiales, pero no es un héroe de guerra, no tiene condecoraciones y su nombre nunca figuró en lista alguna de candidatos a tener en cuenta para ocupar un lugar destacado en misiones secretas de ningún tipo. Sin embargo, es un hombre curtido en la batalla y sus cicatrices así lo atestiguan. Podría decirse que fue un buen soldado que nunca estuvo destinado a la gloria, solo a servir, pero hasta eso puede cambiar.<br/><br/>La crisis económica ha hundido a la sociedad en una miseria de la que ha emergido un nuevo poder legitimado por el terror y el dinero. Por fuera las cosas apenas han cambiado, pero nada se mueve sin que los nuevos amos den su visto bueno. ¿Quiénes son? No hay una respuesta, solo una infinita serie de bandas aliadas y rivales que tratan de controlarlo todo en el territorio que consideran suyo.<br/><br/>Los ciudadanos viven atemorizados, pero J. T. Gamber ya está harto de las bandas criminales y ha decidido tomarse la justicia por su mano. Para cambiar las cosas solo hace falta dar el primer paso, aunque ello implique comenzar una guerra.</p>\n<p><em>J. T. Gamber is a former soldier. He was a member of the special forces, but he is not a war hero, he has no decorations and his name was never on any list of candidates to be considered for a prominent place in secret missions of any kind. However, he is a battle-hardened man and his scars attest to that. It could be said that he was a good soldier who was never destined for glory, only to serve, but even that can change.</em></p>\n<p><em>The economic crisis has plunged society into misery from which has emerged a new power legitimized by terror and money. On the outside things have hardly changed, but nothing moves without the new masters giving their approval. Who are they? There is no answer, only an infinite series of allied and rival gangs trying to control everything in the territory they consider their own.</em></p>\n<p><em>The citizens live in fear, but J. T. Gamber has had enough of the criminal gangs and has decided to take the law into his own hands. To change things he only needs to take the first step, even if it means starting a war.</em></p>\n<p><strong>El Juego</strong></p>\n<p>En esta aventura controlas al ex-soldado J. T. Gamber y tu misión, sencilla sobre el papel, será acabar con los tres líderes de las bandas que controlan el distrito en el que vives. Para ello, cuentas con una pistola, seis vidas, tu habilidad y tus reflejos.</p>\n<p>La ciudad a esas horas está tomada por delincuentes y, de hecho, solo con ellos te cruzarás durante el juego. Estos van siempre armados con cuchillos o con pistolas. Cuídate especialmente de estos últimos, ya que son los más letales.</p>\n<p>Al final de cada nivel aparecerá un jefe. Estos son especialmente difíciles de matar, ya que están bien protegidos contra las armas de fuego y solo sus cabezas son vulnerables. Así que ya sabes, ¡duro y a la cabeza!</p>\n<p>Por si esto fuera poco, otros peligros te acechan en las calles: las hogueras y los contaminados ríos. Evítalos</p>\n<p>Cada vez que entres en contacto con alguno de estos elementos, perderás una vida. Sin embargo, esto no detendrá la acción del juego.</p>\n<p>Tras perder una vida gozarás de unos segundos de inmunidad. Aprovéchalos para resolver la situación. Aunque tu munición es casi siempre ilimitada, durante el juego encontrarás balas. Recógelas y durante el resto del nivel tus ráfagas de fuego serán más largas. Cada vez que completes un nivel tendrás la oportunidad de conseguir una vida extra sin arriesgar ninguna de las que ya tienes. Para lograrlo tendrás que matar a tantos delincuentes como se te indiquen en una de las dos fases bonus que podrás jugar a lo largo de esta aventura. En estas fases tu presencia en la escena se reduce al punto de mira de tu arma. La de los pandilleros, en cambio, es más que evidente, ya que no paran de correr de un lado a otro o de asomarse desde distintos escondites para disparar tras una cuenta atrás que aparece en pantalla. Si se te escaparan más de tres, o si alguno llegara a abrir fuego, habrás fallado. Además, en estas fases, tu munición no es ilimitada si bien recuperaras todas las balas cada vez que abatas a un francotirador.</p>\n<p><strong>El sistema de puntuación</strong></p>\n<p>El juego premia tu buena puntería con diez puntos por cada blanco sobre un enemigo, con independencia de que le cause o no la muerte, pero sin contar los blancos obtenidos durantes las fases bonus. Estos no puntúan.</p>\n<p><strong>Controles</strong></p>\n<p>Puedes usar tanto el joystick como el teclado. Este último es totalmente redefinible.</p>\n<p><em><strong>The Game</strong></em></p>\n<p><em>In this adventure you control the ex-soldier J. T. Gamber and your mission, simple on paper, will be to finish with the three leaders of the gangs that control the district in which you live. To do this, you have a gun, six lives, your skill and your reflexes.</em></p>\n<p><em>The city at that time is taken over by criminals and, in fact, you will only come across them during the game. They are always armed with knives or guns. Be especially careful of the latter, as they are the most lethal.</em></p>\n<p><em>At the end of each level a boss will appear. These are especially difficult to kill, as they are well protected against firearms and only their heads are vulnerable. So you know, hard and to the head!</em></p>\n<p><em>As if this were not enough, other dangers lurk in the streets: bonfires and polluted rivers. Avoid them</em></p>\n<p><em>Every time you come into contact with any of these elements, you will lose a life. However, this won't stop the game action.</em></p>\n<p><em>After losing a life you will enjoy a few seconds of immunity. Take advantage of them to resolve the situation. Although your ammunition is almost always unlimited, during the game you will find bullets. Collect them and during the rest of the level your bursts of fire will be longer. Every time you complete a level you will have the chance to get an extra life without risking any of the ones you already have. To achieve this you will have to kill as many criminals as indicated in one of the two bonus stages that you will be able to play throughout this adventure. In these phases your presence in the scene is reduced to the aiming point of your weapon. The gangsters, on the other hand, are more than evident, since they don't stop running from one side to another or peeking out from different hiding places to shoot after a countdown that appears on the screen. If you miss more than three of them, or if any of them open fire, you will have failed. Also, in these phases, your ammunition is not unlimited, although you will recover all the bullets every time you shoot a sniper.</em></p>\n<p><em><strong>The scoring system</strong></em></p>\n<p><em>The game rewards your good aim with ten points for each target on an enemy, regardless of whether or not it causes death, but without counting the targets obtained during the bonus phases. These do not score points.</em></p>\n<p><em><strong>Controls</strong></em></p>\n<p><em>You can use either the joystick or the keyboard. The latter is fully redefineable.</em></p>", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-07-22T14:53:03", "background_image": "https://media.rawg.io/media/screenshots/c75/c75fe722911a937c1ec3e9622a329036.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amstrad ESP"], "genres": ["Action"], "publishers": [], "esrb_rating": null}