{"id": 824428, "slug": "black-road-sky", "name": "Black Road Sky", "name_original": "Black Road Sky", "description": "<p>Black Road Sky is a sci-fi spaceflight simulator featuring realistic orbital mechanics in a full scale solar system.</p>\n<p>The game is very early in development, with lots of planned features not yet implemented, but like, it's free, so cool it, bud.<br/></p>\n<p>A comprehensive video tutorial series is coming soon(ish?). In the meantime, here's a rundown of how to play:<br/></p>\n<p><strong>GETTING STARTED<br/></strong></p>\n<p>The first thing you'll need to do is buy the ship. Visit the banking terminal on Gagarin Station to take out a loan for at least 35,000 credits. While you're there, visit the contracts terminal and pick up a job for any delivery from Gagarin Station to Laika Orbital.</p>\n<p>Return to the ship hangar and use the ship's onboard terminal to purchase it.</p>\n<p><strong>UNDOCKING<br/></strong></p>\n<p>Close the door by pressing the red button next to it, then enter the pilot's seat by clicking on it. You can leave the pilot seat at any time by pressing the 'F' key. Press the 'HAIL' button on the console in front of you to request departure clearance. Once the docking platform is raised, press the 'MAGS' button to release your docking magnets, then press the 'GEAR' button to raise your landing gear. Once your landing gear is fully stowed, you can press the 'MAN' button to shift your engines from docking mode to maneuvering mode. You are now free to navigate.</p>\n<p><strong>FLIGHT CONTROLS</strong></p>\n<p>Attitude thrusters:<br/></p>\n<ul><li>Pitch: W/S</li><li>Yaw: A/D</li><li>Roll: Q/E</li><li>Stabilizers: Tab (hold)</li></ul>\n<p>Translation thrusters:</p>\n<ul><li>Forward / Backward (Z axis): I/K</li><li>Left / Right (X axis): J/L</li><li>Down / Up (Y axis): U/ O</li></ul>\n<p>Main boosters:</p>\n<ul><li>Throttle up: Left Shift</li><li>Throttle down: Left control</li><li>Thrust deflectors: Z (press to toggle)</li></ul>\n<p><strong>FIRST DELIVERY<br/></strong></p>\n<p>Press the 'SENS' button to bring up your navigation sensors. Find Laika Orbital, click its icon, and press the 'Lock Target' button to receive navigation data, then use the above flight controls to rendezvous with the station (easier said than done!).<br/></p>\n<p>On arrival, shift back to docking mode and lower your landing gear. Your relative X and Z velocities should be exactly 0.00 m/s as you make you contact with the platform in order for your docking magnets to work effectively. You'll need to land within 10m of the center of the platform to be granted clearance for access. With these requirements met, engage docking magnets and hail the station, then visit the contracts terminal to turn in the job and pick up another one.</p>\n<p>If you're unsuccessful, don't worry! It's meant to be a challenge. That said, the Gagarin / Laika run is the simplest trip in the game so there's plenty left to learn once you've mastered it.</p>\n<p>Fly safe!<br/></p>", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-07-22T14:23:54", "background_image": "https://media.rawg.io/media/screenshots/8a6/8a6ce520923517f4d339a279592b1848.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["potatoclockgames"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}