{"id": 824587, "slug": "ruby5", "name": "Ruby5", "name_original": "Ruby5", "description": "<p>Make your own Visual novel!</p>\n<p>103 high quality character image files with transparency for use in visual novel creation.\r\n  </p>\n<p>I made this character for my upcoming visual novel \"Computer Girls\" (Scheduled for release in October, 2022) but decided not to use her.\r\n  </p>\n<p>These character images were made by me and I am giving them to visual novel creators for free. These character image files are free and free to use without restriction or royalties.\r\n  </p>\n<p>I love visual novels and I wanted to make my own. I knew how to write but I needed character images to make my visual novel and I had no money at the time to buy them from character creators. I eventually had to learn how to make them myself.\r\n  </p>\n<p>It is my hope that I can save you that time by giving you character Images that I made for my own visual novels that I do not intend to use. I don’t want to see them go to waste.\r\n  </p>\n<p>These character images are free and are free to use without restriction. No royalties or anything like that.\r\n  </p>\n<p>Just to be clear: These are high quality .png character images with transparency, that I have created, that I am giving away for free to help other people in the visual novel community.\r\n  </p>\n<p>It is my hope that these character image sets will help people that want to write visual novels but can’t find character images that they need and don’t have the money to buy them. That was the same situation I was in many years ago.\r\n  </p>\n<p>Please donate if you can. I hope you find these images useful and instructive.\r\n  </p>\n<p>https://www.paypal.com/paypalme/QuarkYifu\r\n  </p>\n<p>See my other Itch.io stuff including more free character sets here...\r\n  </p>\n<p>https://quarkyifu.itch.io/\r\n  You can Support me on Patreon at Patreon.com/QuarkYifu</p><p>---------</p><p>制作自己的视觉小说！ 103个具有透明度的高质量人物图像文件，用于视觉小说创作。 我为我即将出版的视觉小说制作了这个角色，但决定不使用她。 这些人物形象是我制作的，我免费把它们送给视觉小说创作者。这些角色图像文件是免费的，免费使用，没有限制或版税。 我喜欢视觉小说，我想自己做。我知道怎么写，但我需要人物形象来制作我的视觉小说，当时我没有钱从角色创作者那里购买它们。我最终不得不学习如何自己制作它们。 这些角色图像是免费的，可以不受限制地免费使用。 如果可以的话，请捐款。我希望你觉得这些图像有用和有启发性。 https://www.paypal.com/paypalme/QuarkYifu 在这里查看我的其他 Itch.io 的东西，包括更多免费字符集... https://quarkyifu.itch.io/ 你可以在Patreon上支持我 Patreon.com/QuarkYifu</p><p>-------</p><p>製作自己的視覺小說！ 103個具有透明度的高品質人物圖像檔，用於視覺小說創作。 我為我即將出版的視覺小說製作了這個角色，但決定不使用她。 這些人物形象是我製作的，我免費把它們送給視覺小說創作者。這些角色圖像檔是免費的，免費使用，沒有限制或版稅。 我喜歡視覺小說，我想自己做。我知道怎麼寫，但我需要人物形象來製作我的視覺小說，當時我沒有錢從角色創作者那裡購買它們。我最終不得不學習如何自己製作它們。 這些角色圖像是免費的，可以不受限制地免費使用。 如果可以的話，請捐款。我希望你覺得這些圖像有用和有啟發性。 https://www.paypal.com/paypalme/QuarkYifu 在這裡查看我的其他 Itch.io 的東西，包括更多免費字元集... https://quarkyifu.itch.io/ 你可以在Patreon上支援我 Patreon.com/QuarkYifu</p><p>------------</p><p>Gumawa ng iyong sariling Visual nobela! 103 mataas na kalidad ng mga imahe ng character na may transparency para gamitin sa visual na paglikha. Ginawa ko ang pagkataong ito para sa darating kong visual nobela pero nagpasiya akong huwag siyang gamitin. Ang mga larawang ito ay ginawa sa akin at binibigyan ko sila ng mga visual na nobelang tagalikha nang libre. Ang mga character image file na ito ay libre at libreng gamitin nang walang paghihigpit o royalties. Gustung-gusto ko ang mga visual nobela at gusto kong gumawa ng sarili kong mga nobela. Alam ko kung paano sumulat ngunit kailangan ko ng mga larawan para mabili ang aking visual nobela at wala akong pera para bilhin sila mula sa mga lumilikha ng pagkatao. Kalaunan kinailangan kong matutuhan kung paano gawin ang mga ito. Ang mga imaheng ito ay libre at malayang gamitin nang walang paghihigpit. Mangyaring magbigay ng donasyon kung kaya mo. Sana'y mahanap ninyo ang mga larawang ito na kapaki-pakinabang at nagtuturo. https://www.paypal.com/paypalme/QuarkYifu Tingnan ang iba Itch.io mga bagay-bagay kabilang ang mas libreng character set dito... https://quarkyifu.itch.io/ Maaari mo akong Suportahan sa Patreon sa Patreon.com/QuarkYifu</p><p>---------</p><p>¡Haz tu propia novela visual! 103 archivos de imagen de personajes de alta calidad con transparencia para su uso en la creación de novelas visuales. Hice este personaje para mi próxima novela visual, pero decidí no usarla. Estas imágenes de personajes fueron hechas por mí y se las estoy dando a los creadores de novelas visuales de forma gratuita. Estos archivos de imagen de carácter son gratuitos y de uso gratuito sin restricciones ni regalías. Me encantan las novelas visuales y quería hacer las mías. Sabía escribir, pero necesitaba imágenes de personajes para hacer mi novela visual y no tenía dinero en ese momento para comprarlas a los creadores de personajes. Eventualmente tuve que aprender a hacerlos yo mismo. Estas imágenes de personajes son gratuitas y de uso gratuito sin restricciones. Por favor, done si puede. Espero que estas imágenes te resulten útiles e instructivas. https://www.paypal.com/paypalme/QuarkYifu Vea mis otras cosas Itch.io, incluidos más juegos de personajes gratuitos aquí... https://quarkyifu.itch.io/</p><p>Puedes apoyarme en Patreon en Patreon.com/QuarkYifu</p><p>-----------</p><p>製作自己的視覺小說！ 103個具有透明度的高品質人物圖像檔，用於視覺小說創作。 我為我即將出版的視覺小說製作了這個角色，但決定不使用她。 這些人物形象是我製作的，我免費把它們送給視覺小說創作者。這些角色圖像檔是免費的，免費使用，沒有限制或版稅。 我喜歡視覺小說，我想自己做。我知道怎麼寫，但我需要人物形象來製作我的視覺小說，當時我沒有錢從角色創作者那裡購買它們。我最終不得不學習如何自己製作它們。 這些角色圖像是免費的，可以不受限制地免費使用。 如果可以的話，請捐款。我希望你覺得這些圖像有用和有啟發性。 https://www.paypal.com/paypalme/QuarkYifu 在這裡查看我的其他 Itch.io 的東西，包括更多免費字元集... https://quarkyifu.itch.io/ 你可以在Patreon上支援我 Patreon.com/QuarkYifu</p><p>------------</p><p>Создайте свой собственный визуальный роман! 103 высококачественных файла изображений символов с прозрачностью для использования в создании визуальных новелл. Я сделал этого персонажа для моего предстоящего визуального романа, но решил не использовать его. Эти образы персонажей были сделаны мной, и я даю их создателям визуальных романов бесплатно. Эти файлы изображений персонажей бесплатны и бесплатны для использования без ограничений или роялти. Я люблю визуальные романы и хотел сделать свои собственные. Я знал, как писать, но мне нужны были образы персонажей, чтобы сделать мой визуальный роман, и в то время у меня не было денег, чтобы купить их у создателей персонажей. В конце концов мне пришлось научиться делать их самому. Эти изображения персонажей бесплатны и могут быть использованы без ограничений. Пожалуйста, сделайте пожертвование, если можете. Я надеюсь, что вы найдете эти изображения полезными и поучительными. https://www.paypal.com/paypalme/QuarkYifu Посмотрите мои другие Itch.io вещи, включая более бесплатные наборы символов здесь... https://quarkyifu.itch.io/ Вы можете поддержать меня на Patreon в Patreon.com/QuarkYifu<br/></p>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-07-22T15:39:52", "background_image": "https://media.rawg.io/media/screenshots/1f0/1f08218c0d9f3f4feb89c8370879b2f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["quarkyifu"], "genres": [], "publishers": [], "esrb_rating": null}