{"id": 824549, "slug": "tiny-armored", "name": "Tiny Armored", "name_original": "Tiny Armored", "description": "<p><strong>FR :</strong><br/></p>\n<p>Progressez à travers différents terrains et battez tous les ennemis qui se trouvent sur votre chemin. Collectez des ressources, améliorez et personnalisez votre véhicule comme vous le souhaitez.\r\n</p>\n<p>Ce que vous pouvez faire actuellement :\r\n</p>\n<p>- Personnaliser : Choisissez entre 4 véhicules, 4 armes, 2 couleurs différentes de votre choix et 4 textures.<br/>- Mise à niveau : améliorez les performances de votre véhicule en effectuant des recherches.<br/>- Jouez ! : Amusez-vous à parcourir un terrain infini, rencontrez de puissants ennemis et accomplir divers événements.</p>\n<p>Il s'agit d'une version de développement, vous risquez de rencontrer de nombreux problèmes !\r\n</p>\n<p>À sa sortie, le jeu sera en vente. Le prix n'est pas encore défini.\r\n</p>\n<p><strong>EN :</strong>\n</p>\n<p>Progress through various land and defeat all enemies that are in your way. Collect resource, upgrade and customize your vehicle like you want.\r\n</p>\n<p>Wat you can do actualy:\r\n</p>\n<p>- Customize: Chose between 4 vehicle , 4 weapon , 2 different color of your choise and 4 texture.<br/>- Upgrade: Upgrade your vehicle performance by doing research.<br/>- Play!: Have fun parcouring an infinite terrain, encouter powerful enemies andaconplish various evenement.</p>\n<p>This is a developement version, you may encounter alot of isue !\r\n</p>\n<p>On release, the game are going to be sale. Price is not defined yet.<br/>\n</p>\n\n<p><strong>Problème connu :</strong></p>\n<p>- Parfois les montagnes couvre tout le terrain, il est alors impossible de progresser plus\r\n</p>", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-07-22T15:22:06", "background_image": "https://media.rawg.io/media/screenshots/8ed/8edc1b263b380c4dec3cce65dee57ed3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Etowaru"], "genres": ["Action"], "publishers": [], "esrb_rating": null}