{"id": 824559, "slug": "crucesignatus-penance", "name": "CRUCESIGNATUS - PENANCE", "name_original": "CRUCESIGNATUS - PENANCE", "description": "\n\n<p>The NEW CHURCH OF CONTRITION reigns sovereign, keeping all under His vigilant eye. No transgression is hidden for long and those branded as sinners face retribution without fail.<br/></p>\n<p>Due to unfortunate circunstances of fate, you were left with no choice but to take the OATH OF ABJURATION in complete servitude to the Church, or to undergo The Purgation for your sins - a fate a thousandfold worse than death itself.</p>\n<p>Now with all traces of your previous identity erased, you are a <strong>CRUCESIGNATUS</strong> - <em>Signed by the Cross</em> - sent on a holy campaign to purge the endless Profaners of Gehenna and redeem your lost soul.</p>\n<p>The horde is vicious and evergrowing, and with no hope of escaping or ending them you can only pray to be granted absolution from your sins when you meet your demise...</p>\n\n<p>This is a neon action survival shoot em' up roguelike game where each run is unique as you evolve from the random choice of upgrades given to you by collecting dropped Essence orbs and leveling up.</p>\n\n<p>As you progress, so does the Profaners horde grows stronger in number and power  - how long can you survive against their vicious swarm?</p>\n\n<p>\n</p>\n<br/>\n<p>As this game is in active development, you can expect new features and updates to come in the future.</p>\n<p>Any feedback is greatly appreciated, I hope you enjoy the game!</p>\n<p><em>- Saw Mankler</em></p>\n<p>\n</p>", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-07-22T15:26:46", "background_image": "https://media.rawg.io/media/screenshots/1d4/1d4f7becd80b50616c9ebf3fe8d69ab6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Saw Mankler"], "genres": ["Action"], "publishers": [], "esrb_rating": null}