{"id": 82468, "slug": "golden-seahorse-progressive-slotmachine-deep-ocean", "name": "Golden seahorse progressive slotmachine: deep ocean adventure with plenty of treasure!", "name_original": "Golden seahorse progressive slotmachine: deep ocean adventure with plenty of treasure!", "description": "**Download Golden seahorse slots and play an awesome slots adventure game today!**\u2028<br/><br/>Travel around the world discovering fantastic slot machines and hidden treasures. Explore mysterious underwater levels, celeb level, and a special zodiac sign level.all with beautiful HD graphics just like the video slots in Vegas casinos! Play today and enjoy unlimited hours of free entertainment! \u2028\u2028<br/><br/><br/>Features: \u2028<br/>• Premium HD graphics and sounds<br/>\u2028• Incredible jackpots! Bet big and win huge jackpots!<br/>\u2028• Tonnes of new slot machines to discover and play! <br/>\u2028• Practice playing slots just like you're in a Las Vegas casino! \u2028\u2028<br/><br/>golden seahorse slots is EASY to play and easy to WIN BIG! If you enjoy slots games, then you'll have tons of fun exploring all the hidden secrets of Lost Treasures! Read what others are saying about the game: \u2028<br/><br/><br/>• \"Lots of fun! I have tried a lot of the free slot games and this is by far the best Ive seen so far”<br/><br/>• “I just cant stop playing amazon slots, every new stage brings on a new adventure”<br/>Try it today, its free to play. with 12 magical levels!", "metacritic": null, "released": "2014-10-31", "tba": false, "updated": "2019-10-22T14:22:40", "background_image": "https://media.rawg.io/media/screenshots/922/92259c23fbedd37ebc14ca634a983e96.jpg", "website": "http://www.plentouzapps.biz", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Plentouz Apps Development"], "genres": [], "publishers": ["Plentouz Apps Development"], "esrb_rating": null}