{"id": 824638, "slug": "laser-lightshow", "name": "Laser Lightshow", "name_original": "Laser Lightshow", "description": "<p><em>Laser Lightshow</em> is a complex puzzle game, complete with a fully integrated level editor!  With the goal of hitting the targets, fire lasers from shooters and enjoy them bouncing off mirrors, pushing blocks, splitting through prisms, hurtling through teleporters, activating sonic cannons...  The possibilities are almost limitless!</p>\n\n<p>It currently is in active development, with new elements, bugfixes, features, and refining...  The custom level server is in active development too!  The final goal there is to be able to create, share, and play countless levels, while being cross-platform compatible for PC, Mac, iPhones, and Android.  It is currently on track for Early Access by December 2022.  Shoutout to <em>Vibe Avenue- </em>they have been onboarded for fantastic musical arrangements!  (The game currently uses a song I wrote instead.)</p>\n\n<p>I invite all those interested to join the Discord here, as that is the place for talking about game dev, bug reporting, level design, level submissions (for the master built-in level list), and more.  Not all menu options are complete, so my suggestion for best experience, keep choosing the far left option to get into the game.</p>\n\n<p>Level Editor:</p>\n<p>For the level designer in all of us!  Levels can only be exported to the main list once you have completed it in test mode.  The heatmap also becomes available after running each test.</p>\n\n\n\n<p>Useful hotkeys:</p>\n<p>'M' mutes</p>\n<p>'Space' restarts the current level</p>\n<p>'Escape' backs out to the main menu or quits, as one might expect.</p>\n<p>'f3' skips a level</p>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-07-22T16:05:30", "background_image": "https://media.rawg.io/media/screenshots/973/9735c981a8ffa6166ae4cea408f1b97b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thundermagnet"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}