{"id": 824762, "slug": "hora-bruja-amstrad-cpc", "name": "Hora Bruja (Amstrad CPC)", "name_original": "Hora Bruja (Amstrad CPC)", "description": "<p><strong>C</strong><strong>reation Team</strong></p>\n<p>CONCEPT, IDEA AND PROGRAM: gg<br/>GRAPHICS, SOUND &amp; SFX: gg<br/>DRAWING AND IDEAS: gg, 6128, Anjuel, Litos, MiguelSky<br/>COVER ILLUSTRATION: 6128</p>\n<p>Sostenías un reinado de terror, hasta que el hada Emy ayudó al reino de Galbar a desposeerte de tu libro mágico y a encerrarte en tu propio castillo. Ahora, 137 años después, el hada ha muerto y una nueva bruja tiene el libro, momento que podrás aprovechar para escapar. Pero… ¿sigues siendo la misma? Tus actos responderán a esa pregunta.</p>\n<p><strong>Historia</strong></p>\n<p>Nadie recuerda ya el momento en que tú, la bruja Hara, se hizo con el poder en Galbar. Sin embargo, todo el mundo conoce los horrores a los que sometiste al pueblo y recuerda con alegría la fecha en que el legítimo linaje real, con la ayuda del hada Emy, logró desposeerte de tu libro mágico y confinarte en tu propio castillo. Han pasado 137 años.</p>\n<p>El hada ha muerto y una nueva bruja ha arribado a Galbar con la intención de aprovechar la ausencia del poder protector de Emy para someter de nuevo al pueblo. Su primer paso ha sido robar el libro mágico que en su día te arrancaron de las manos, esperando absorber sus conocimientos y la magia que esconde. No obstante, al tomarlo se ha llevado una desagradable sorpresa: el libro está incompleto. Nadie sabe que en su día y por seguridad tú escondiste fragmentos esenciales en el castillo que habitas. Y allí permanecen protegidos por un encantamiento que los hace visibles sólo a tus ojos. Por este motivo el rey sigue vivo y es sometido a tormentos y hechizos para tratar de arrancarle el paradero de la parte que falta. Cosa totalmente inútil. Como último recurso la bruja ha absorbido el poder de la parte del libro que posee y lo ha destruido en un ritual. Así preparada ha aguardado a la noche perfecta, aquella en que la conjunción de los planetas le permitirá invocar el poder suficiente para hacerse con el resto del libro. Por desgracia para ella los movimientos en el mundo mágico no son imperceptibles y tú, desde tu encierro, has detectado las señales que anuncian lo que va a acontecer. Ahora mismo la vigilancia de tu castillo es mínima. Apenas unos cuantos soldados y algunas almas atormentadas y demonios lo moran. Por lo que no debería ser muy difícil escapar de allí y frustrar sus planes.</p>\n<p><em>You held a reign of terror, until the fairy Emy helped the kingdom of Galbar to take your magic book and lock you in your own castle. Now, 137 years later, the fairy is dead and a new witch has the book, a moment you can take advantage of to escape. But... are you still the same? Your actions will answer that question.</em></p>\n<p><em><strong>Story</strong></em></p>\n<p><em>Nobody remembers anymore the moment when you, the witch Hara, took power in Galbar. However, everyone knows the horrors to which you subjected the people and remembers with joy the date when the rightful royal lineage, with the help of the fairy Emy, succeeded in dispossessing you of your magic book and confining you in your own castle. 137 years have passed.</em></p>\n<p><em>The fairy has died and a new witch has arrived in Galbar with the intention of taking advantage of the absence of Emy's protective power to subjugate the people again. Her first step has been to steal the magic book that was once torn from your hands, hoping to absorb its knowledge and the magic it hides. However, when you take it, you have an unpleasant surprise: the book is incomplete. No one knows that you once hid essential fragments of it in the castle you live in for safety. And there they remain protected by an enchantment that makes them visible only to your eyes. For this reason the king is still alive and is subjected to torments and spells to try to wrest from him the whereabouts of the missing part. A totally useless thing. As a last resort the witch has absorbed the power of the part of the book she possesses and destroyed it in a ritual. Thus prepared she has waited for the perfect night, the one in which the conjunction of the planets will allow her to invoke enough power to get the rest of the book. Unfortunately for her, the movements in the magical world are not imperceptible and you, from your confinement, have detected the signs that announce what is about to happen. Right now the surveillance of your castle is minimal. Just a few soldiers and some tormented souls and demons dwell there. So it should not be too difficult to escape from there and thwart their plans.</em></p>\n<p><strong>El juego</strong><br/>El objetivo del juego es escapar de tu encierro y recuperar tus poderes para ponerte al servicio del rey o someter de nuevo al pueblo. Sólo a ti te corresponderá la elección. Sin embargo antes deberás salir de tu castillo y prepararte para el enfrentamiento con la nueva bruja. Tarea nada sencilla. Por suerte cuentas con una ventaja y es que sabes que ésta será vulnerable mientras realiza su terrible invocación, tarea que le llevará toda la noche. Ese será tu momento y nuestro punto de partida. El juego se desarrolla en parte del reino de Galbar, donde deberás completar varias tareas para alcanzar el éxito justo la noche de la terrible invocación. </p>\n<p><strong>TAREAS</strong><br/>1. Has de recoger las hojas del libro que están esparcidas por el castillo y dirigirte con ellas al caldero mágico, lugar donde reposan los restos de tu pasado poder. Este te revelará una lista de ingredientes y útiles que podrás encontrar fuera del castillo. La lista sólo se te dará una vez (apúntala, es un consejo).</p>\n<p>2. Has de salir del castillo y recoger los elementos indicados por el caldero en el orden en que se te dieron. Cuando los tengas todos deberás volver al caldero y preparar una pócima para llamar a tus poderes. Hecho esto podrás salir del castillo por la puerta principal para ir en busca de la bruja.</p>\n<p>3. Deberás encontrar a la bruja, tocarla para recuperar tus poderes y, finalmente, buscar al rey. Podrás entonces decidir tu futuro.</p>\n<p><em><strong>The game</strong></em></p>\n<p><em>The objective of the game is to escape from your imprisonment and regain your powers to put you at the service of the king or to subjugate the people again. The choice is yours alone. However, first you must leave your castle and prepare for the confrontation with the new witch. Not an easy task. Luckily you have an advantage and you know that she will be vulnerable while she performs her terrible summoning, a task that will take all night. That will be your moment and our starting point. The game takes place in part of the kingdom of Galbar, where you will have to complete several tasks to achieve success just the night of the terrible summoning. </em></p>\n<p><em><strong>TASKS<br/></strong></em><em>1. You have to collect the leaves of the book that are scattered around the castle and go with them to the magic cauldron, the place where the remains of your past power lie. This will reveal a list of ingredients and tools that you can find outside the castle. The list will only be given to you once (write it down, it's a tip).</em></p>\n<p><em>2. You must leave the castle and collect the items indicated by the cauldron in the order they were given to you. When you have them all you must return to the cauldron and prepare a potion to call your powers. Once you have done this you can leave the castle through the main door to go in search of the witch.</em></p>\n<p><em>3. You will have to find the witch, touch her to recover your powers and, finally, look for the king. You will then be able to decide your future.</em></p>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-07-22T16:57:29", "background_image": "https://media.rawg.io/media/screenshots/524/52484d44011a3ef73239049e933166b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amstrad ESP"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}