{"id": 824707, "slug": "come-nasce-un-eroe-rpg", "name": "Come nasce un eroe RPG", "name_original": "Come nasce un eroe RPG", "description": "<p>In questo prologo ti calerai nei panni dei cinque protagonisti, scoprirai la loro personalità e vivrai l'inizio dell'avventura di:<br/></p>\n<p>Aria: L'aspirante paladina del dio della luce.</p>\n<p>Gillian: L'halfling con la passione per l'alchimia.</p>\n<p>William: Che sta imparando il mestiere di cacciatore dal padre.</p>\n<p>Fara: L'orfana che sopravvive alla giornata.</p>\n<p>Hermann: Il mago apprendista con manie di grandezza.<br/></p>\n\n<p>\"Come nasce un eroe\" è un JRPG realizzato con RPG Maker MV.</p>\n<p>Di seguito troverete il videogioco in lingua originale, italiano, e nella sua versione inglese, essendo il nostro primo lavoro apprezzeremmo molto se, dopo aver finito/provato la demo, potreste rispondere al breve questionario allegato, inoltre se volete supportarci e avere aggiornamenti costanti sullo sviluppo e altri vantaggi vi consigliamo di passare al nostro Patreon: <br/></p>\n<p>Questionario: https://docs.google.com/forms/d/1Fl37-kHkYnTgl1tkB_bVWBqJt-C_3akhi6RWWICq70A/vie...<br/></p>\n\n<p>In this prologue you will step into the shoes of the five protagonists, you will discover their personality and you will live the beginning of the journey of: <br/></p>\n<p>Aria: An aspiring paladin of the god of light. <br/></p>\n<p>Gillian: An halfling passionate about alchemy and drinks. <br/></p>\n<p>William: A young hunter learning the job from his father. <br/></p>\n<p>Fara: An urchin living day to day.</p>\n\n<p>Hermann: An apprentice mage with delusions of grandeur.</p>\n<p>\"Heroes' Birth\" is a JRPG made with RPG Maker MV.</p>\n<p>Below you will find the game in the Italian and English languages. Since it's our first work we will greatly appreciate if, after playing the prologue, you'd like to answer the brief attached survey, furthermore, if you'd like to support us and have constant development updates and other benefits we invite you to visit our Patreon page:</p><p>Survey: https://docs.google.com/forms/d/1TcA2LlChBslemMUwJg6zXh1MzS-McSqYBxtslsstbCc/vie...<br/></p>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-07-22T16:32:21", "background_image": "https://media.rawg.io/media/screenshots/e92/e928b18e1fcae976492088149525793c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Geracchio"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}