{"id": 82470, "slug": "pixeljima-1942-pacific-force", "name": "Pixeljima 1942: Pacific Force", "name_original": "Pixeljima 1942: Pacific Force", "description": "Pixeljima™ is a vertical scrolling shoot-em-up that features retro-style 8-bit like graphics.  It's quite difficult!<br/><br/>The game is set in the Pacific theater of World War II in 1942.  Famous battles in that theater include the \"Attack on Pearl Harbor\", the \"Battle of Coral Sea\", the \"Battle of Midway\", through to the \"Battle of Iwo Jima\" near the end of wwii where the game gets its name.<br/><br/>Progression is a big feature of the game, where you collect stars to buy new aircraft, and aircraft upgrades.  Stars collected also count towards your air force rank, and you can earn medals.  As you get stronger, you will able to force deeper into the levels.<br/><br/>You fly an American Lockheed P-38 Lightning airplane against all kinds of Japanese airplanes including Mitsubishi A6M's and Aichi D3A's.  The opposition gets stronger as you progress through the levels.  You fight mini-bosses through levels, end-of-level bosses, and new types of aircraft like helicopters appear.  Watch out for ground targets too, and sneaky planes attacking from the side!<br/><br/>You can control your war bird with the touchscreen (each aircraft has different speeds, levels of speed upgrades, and they slow down when damaged).  The plane shoots automatically.  Upgrade your hawk to carry bombs under the wings for extra wwii shmup goodness!<br/><br/>Features:<br/>- Retro-style pixel art graphics for 80s arcade nostalgia!<br/>- 5 levels of in-game weapon upgrades on your plane<br/>- Progressively more difficult enemies<br/>- Full support for phones and tablets<br/>- 13 different player planes to spread your wings with<br/>- Multiple weapon, armor, engine and utility upgrades for each plane<br/>- Leader board and achievements<br/>- Earn stars to buy upgrades and rank up<br/>- Earn medals (with hawk or falcon emblems and up to medal of honor)<br/><br/>Pixeljima is a trademark of Owairakasoft Limited.<br/>If you have any suggestions to make \"Pixel jima 1942\" even better please tell us!<br/>info@owairakasoft.com", "metacritic": null, "released": "2018-06-01", "tba": false, "updated": "2019-10-22T14:22:40", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2eed3e3668f32b3aa1277c1528b78a6_ENb0Ltu.jpg", "website": "http://www.redfoxgamestudio.com/pixeljima1942/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Owairakasoft"], "genres": ["Action", "Arcade"], "publishers": ["Owairakasoft"], "esrb_rating": "Everyone 10+"}