{"id": 824855, "slug": "coatiba-anga-a-alma-da-floresta", "name": "Coatiba Anga: A Alma da Floresta", "name_original": "Coatiba Anga: A Alma da Floresta", "description": "<p><em>Coatiba Anga</em>: A Alma da Floresta é um jogo 3D de fantasia e plataforma, com foco em quebra-cabeças. Ele procura, através de uma historinha simples e divertida, com desafios na forma de quebra-cabeças, cativar e incentivar maior interesse das pessoas pelo folclore e a fauna brasileira, bem como conscientizar sobre os diversos problemas que afligem a floresta amazônica.<br/></p>\n<p>O jogo será estruturado em três leveis tutoriais iniciais para introduzir os personagens e suas mecânicas específicas. Após estes leveis iniciais, o jogo terá uma totalidade de sete leveis, cada um com uma temática focada em apresentar um dos principais tipos de crimes que ocorrem na floresta amazônica. Sendo estes:\r\n </p>\n<ul> <li>Garimpo Ilegal\r\n </li><li>Madeireiros Ilegais\r\n </li><li>Pesca e Caça Ilegal\r\n </li><li>Roubo de Água Doce;\r\n </li><li>Tráfico de Animais Silvestres;\r\n </li><li>Tráfico de Pessoas;\r\n </li><li>Guerra de Facções (Traficantes, Grileiros e Indígenas)\r\n </li></ul>\n<p>Por fim, ele será lançado em 2023 primeiramente para <em>Windows</em> e, após a devida avaliação, para os consoles <em>Play Station</em> (4 e 5), <em>Nintendo Switch</em> e <em>Xbox One</em>. Sua aquisição ocorrerá através de lojas online (<em>Steam</em>) e lojas oficiais das plataformas (<em>Play Station Store</em>).\r\n </p>\n<p><strong>História:</strong>\n</p>\n<p>Depois de anos da fauna e da flora brasileira sendo explorada de maneira irresponsável e criminosa, <em>Anhangá</em>, protetor da floresta, concede a um Tatu-bola, um Mico-leão-dourado e a uma jovem Sucuri a bênção necessária para protegerem seus amigos e a natureza em geral. Agora, o trio atua como justiceiros que lutam contra humanos maléficos que não tem a mínima noção de como seus atos têm efeitos catastróficos. Indo contra sua própria natureza reservada e dócil, eles precisam superar seus medos e limitações para salvar a fauna e a flora do Brasil.</p>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-07-22T17:41:12", "background_image": "https://media.rawg.io/media/screenshots/c1c/c1ceac1bb56fd60ae081a330ca6a1b20.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Insane Minds"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}