{"id": 824844, "slug": "garden-bots-mangoworks", "name": "Garden Bots (MangoWorks)", "name_original": "Garden Bots (MangoWorks)", "description": "Welcome To Camp Garden Bots!\r\nIn this summer camp you will have to guide robot to collecting resources and using cards to survive!  \r\n\r\nHow to play:\r\n1. Click on robots to open up there panel Then click on the resource you want them to collect!\r\n2. Right click on the robot if you want to feed it 1 of every resource.\r\n3. At the end of the day you will get 2 cards but you can only pick 1 of the cards.\r\n4. make sure your robots don't die they lose hp every turn feed them to keep hem alive\r\n5. If you have 3 robots alive or less then you lose!\r\n6.Use arrow keys/WASD to move the camera so you can look for stuff\r\n\r\nCards:\r\nDice Card - Right click it to destroy it and it adds random number 1 - 12 to each resource.\r\nDevils Deal - If you lose the devil will give you a second chance but he will destroy all you cards.\r\nGods Goods - On the start of a new day God will give you a free random card but take away 5 wood from you\r\nClassroom - When you get this card your robots will move 50% faster but the timer will go down by 5s\r\nFactory - Adds 1 robot each day for 5 wood\r\nLumber Yield - Each robot make 1 wood at the end of the day  \r\nBomb - Blows up robots and gets 1 of everything for each robot it destroys \r\nLeg of Luck - If food is your most grabbed thing you get to respin if you don't like your options and then destroys itself\r\nRate the game here:\r\nhttps://itch.io/jam/gmtk-jam-2022/rate/1623886\r\n\r\n\n\r\nJam Version:\r\nhttps://mangoworks.itch.io/garden-bots\r\n<p>\n</p>", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-07-22T17:36:24", "background_image": "https://media.rawg.io/media/screenshots/b9d/b9d18448eb2d336da0f28aef32e5d402.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MangoWorks"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}