{"id": 82502, "slug": "solitaire-classic-noads", "name": "Solitaire Classic NoAds", "name_original": "Solitaire Classic NoAds", "description": "Solitaire by REDFOX is one of the few Solitaire apps with Daily Challenges. We’re ALWAYS updating our Solitaire to include fun new features! If you like Windows Solitaire, you're going to LOVE this app!! The familiar Windows Solitaire game you used to play on your computer is now available on the go!<br/><br/>Our Daily Challenge feature is awesome! Each day you’ll receive a unique Daily Challenge. Solve the Daily Challenge and receive a crown for that day. Earn trophies each month by winning enough crowns! Your Daily Challenges, crowns, and current trophy status are available to view any time. Play the current day’s deal and replay it as many times as you’d like on that day. <br/><br/>Haven't won in a while? The Winning Deals feature creates a game that deals hands guaranteed to have at least one winning solution. Use \"Hint\" to help walk you through the moves if you still need a hand.<br/><br/>The addicting game you’ve been playing on your computer for years now goes wherever you do. Solitaire is a universal app, playable in the best resolution available for each Apple device. Download Solitaire today!<br/><br/>FEATURES:<br/>-Add-Free gameplay<br/>-Daily Challenges<br/>-Winning Deals<br/>-Hints<br/>-Draw 1 card<br/>-Draw 3 cards<br/>-Portrait<br/>-Landscape<br/>-Modern Card Fonts<br/>-Custom card backs<br/>-Game state saved when interrupted<br/>-Unlimited undo<br/>-Auto complete to finish game<br/>-Standard scoring<br/>-Vegas scoring<br/>-Statistics<br/><br/>For answers to frequently asked questions, head over to<br/>http://www.redfoxgamestudio.com/solitaireclassic<br/><br/>LIKE US on Facebook<br/>http://www.facebook.com/RedfoxNewZealand<br/><br/>FOLLOW US on Twitter<br/>@redfox_nz<br/>#redfoxsolitaire<br/><br/>For the latest info and what we are up to, check out<br/>http://www.RedfoxGameStudio.com/<br/><br/>Created and supported by REDFOX Game Studio Limited", "metacritic": null, "released": "2018-03-07", "tba": false, "updated": "2019-10-22T14:22:41", "background_image": "https://media.rawg.io/media/screenshots/432/432b90859008dbf8ef97f50e46a40c4b.jpg", "website": "https://www.facebook.com/RedfoxNewZealand", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Owairakasoft"], "genres": ["Card"], "publishers": ["Owairakasoft"], "esrb_rating": "Everyone 10+"}