{"id": 8251, "slug": "perloo", "name": "Perloo", "name_original": "Perloo", "description": "Perloo is a geometric fairy tale. Abandon your assumptions, solve a series of mind-bending challenges and find your way to the true world.<br/><br/>Perloo is a compact one-of-a-kind puzzle adventure that challenges you to think outside of your comfort zone. See how the real world influences the virtual one – and vice versa. Perloo plays with physics, quantum mechanics, philosophy, optics and perception to create a world with rules of its own.<br/><br/>Perloo is a ludic experiment, perhaps even a philosophical proposition. But most of all, Perloo is an excruciatingly hard puzzle game. You might cry.<br/><br/>‣  Nine mind-bending puzzles that will leave you pulling your hair out<br/>‣  Never know what’s next with challenges that force you to think outside the black (or white, or champagne) box<br/>‣  Automatically saves your game for the illusion of progress<br/>‣  Original soundtrack by Ella Empress and the Layers of Reality<br/>‣  Supported by philosophers<br/><br/><br/>■ Quotes ■<br/>“If Hegel had developed an iPhone app, we think it would have been a lot like this”<br/>Joe White, AppAdvice<br/><br/>“What the hell… I feel like I‘m being pranked here!“<br/>Eli Hodapp, TouchArcade<br/><br/>“A strange and ethereal kind of beast”<br/>Joe Jasko, Gamezebo<br/><br/><br/>■ Praise ■<br/>Dutch Design Awards 2014: Finalist<br/>A Maze 2014: Shortlisted<br/>EGX Rezzed 2014 Leftfield Collection: Selected<br/><br/><br/>■ Requirements ■<br/>Perloo requires an iPhone 4 or newer.<br/>The game is not supported on either iPod Touch or iPad!<br/><br/><br/>■ Questions? ■<br/>Contact us via support@perceptor.nl<br/>Follow @perceptornl on Twitter<br/>Like PerceptorNL on Facebook<br/><br/><br/>■ About Perceptor ■<br/>Perceptor is a design studio with a broad outlook. We are interested in how people interact with technology and how this influences our perception. While we are not strictly a game studio, playfulness and gameful design are important themes in our practice.<br/>http://perceptor.nl<br/><br/><br/>The creation of Perloo was supported by Creative Industries Fund NL", "metacritic": null, "released": "2014-02-20", "tba": false, "updated": "2019-10-22T14:29:44", "background_image": "https://media.rawg.io/media/screenshots/4ad/4ad1d2cdfa1318da2deba503d83fce1e.jpeg", "website": "http://perloogame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Perceptor"], "genres": ["Adventure", "Puzzle"], "publishers": ["Perceptor"], "esrb_rating": "Everyone 10+"}