{"id": 825253, "slug": "rabdonut", "name": "RABDONUT", "name_original": "RABDONUT", "description": "<p><strong>--RABDONUT</strong></p>\n<p>※This game was made to learn Unity.<br/>There may be unexpected bugs... Please understand.<br/>Machine translating Japanese, so the sentences may be wrong.</p>\n<p>The specifications may differ slightly between <br/>the browser version and the win version.<br/>---</p>\n<p>◇Rules.<br/>Turn a block into a colored donut and erase it.<br/>Blocks are colored when you step on them.<br/>You can push the block with X.<br/>Use Z to erase a block. (up to three times).<br/>It is not afraid of hitting falling blocks.<br/>If you pile up five blocks, the game is over.<br/>Try to erase 50 donuts.</p>\n<p>◆controls<br/>Move: Direction keys<br/>Clear block: Z (up to 3 times)<br/>Push blocks: X + directional key</p>\n<p>◆Specifications and advice<br/>Blocks cannot be climbed more than two steps.<br/>The theory is to step on the blocks while stacking them flat.</p>\n<p>You can push a block by moving while holding down the X key.<br/>You can drop it on a step, but you cannot lift it.</p>\n<p>You can erase blocks in Z key.<br/>(Note that the direction of the character does not always correspond to the direction of movement due to specifications.)<br/>It can be used up to three times.<br/>You can recover one doughnut for every doughnut you erase.<br/>Use it when when you can't move, or when blocks seem to be piled up too high.</p>\n<p>The slow rotation of the camera is a specification.</p>\n<p>If you are unlucky, the blocks will pile up unevenly.<br/>If you follow the theory and do your best, you can get by.</p>", "metacritic": null, "released": "2022-07-18", "tba": false, "updated": "2022-07-22T20:36:27", "background_image": "https://media.rawg.io/media/screenshots/3c7/3c7f23d41fa65e2f9b81bcc35780b1db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["nizakashii"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}