{"id": 825342, "slug": "car-quest-deluxe", "name": "Car Quest Deluxe", "name_original": "Car Quest Deluxe", "description": "Hit the road to epic adventure in Car Quest Deluxe: drive, collect, explore, solve, discover.<br/><br/><br/><br/>Buckle-up for an epic road trip through a colorful world of puzzles and adventure. Use driving skills and puzzle solving abilities to find missing artifacts and piece together the broken world of Blocktaria.<br/><br/><br/><br/>DRIVE everywhere: it's like your favorite kart racing and platforming puzzle adventure game all wrapped up into one.<br/><br/><br/><br/>COLLECT batteries to unlock portals.<br/><br/><br/><br/>FIND 100+ artifacts to unlock new realms and paths on the road to discovery.<br/><br/><br/><br/>EXPLORE more than 15 unique visually striking realms.<br/><br/><br/><br/>SOLVE physical puzzles, push obstructions, jump off ramps, or skillfully navigate challenging mazes.<br/><br/><br/><br/>DISCOVER the secrets of Blocktaria and recover the lost memories of your helpful but very forgetful guide, Lord Blockstar. What is his story? What secrets will be revealed?<br/><br/><br/><br/>DELUXE version comes with eight new cars to unlock, each with their own unique ability: x2 Battery, Super Boost, Froggy, Higher Torque, Battery Rocket, Nitro, Spider and Unlimited Rocket. Which will be your favourite?<br/><br/>Featuring:<br/><br/>- Put your driving skills and puzzle solving abilities to the test<br/>- No damage, no time limits<br/>- Intriguing story to discover<br/>- Soothing visuals and soundtrack<br/><br/>The Steam version of Car Quest has been brought to you by the awesome Car Quest player community! Special thanks to @SolarPellets for all the hard work on the PC port and also playtesters @CtrlXthroat, @BaronBishop, @HotCocoa.", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-25T03:42:19", "background_image": "https://media.rawg.io/media/screenshots/c2a/c2a9fec5d33889a6b50afcff22438e4d.jpg", "website": "https://carquest.ezone.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ezone"], "genres": ["Adventure", "Strategy", "Racing", "Casual", "Indie"], "publishers": ["Ezone"], "esrb_rating": null}