{"id": 825338, "slug": "keep-it-cool-man", "name": "Keep it Cool, Man", "name_original": "Keep it Cool, Man", "description": "<h3>Hey there, have you ever been frightened by the end of the world or an approaching asteroid? When watching or reading the news, have you felt anxious when seeing certain events happening to the world?</h3><br/><br/>Well, <strong>Keep it Cool, Man</strong>has letters approaching the planet like an asteroid that you have to shoot with power created by dancing people.<br/><br/><br/><h3>It's a true laugh with fear scenario, ideal for the entire family!</h3><h3>Features:</h3><ul><li> Original typing game mechanic, which focuses not only what you type but <strong>when you type</strong>.<br/></li><li> 5 chapters of full-fledged story inspired by stereotypical American movies (like Independence Day) featuring 3 multi-layered characters and the president of United Stat... <h3>The story, all names, characters, and incidents portrayed in this production are fictitious. No identification with actual persons (living or deceased), places, buildings, and products is intended or should be inferred.</h3></li><li> Random, but not-so-random linear level design, changing a bit with each play.<br/></li><li> Sleek user interface which bounces a lot, inspired by the style of funk.<br/></li><li> Rank and combo system (you can scream on the streets that you have got S from level 9 in Keep it Cool, Man, isn't that beautiful?)</li></ul><br/><h3>https://discord.gg/GMcZ6pwSdq</h3>", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-25T03:36:24", "background_image": "https://media.rawg.io/media/screenshots/cd3/cd3ca01661e11ab7b4640dd73ddb7b3e.jpg", "website": "https://cyberevolver_studios.indie.af/kicm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheMatiaz0", "Biegus"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Cubepotato Games"], "esrb_rating": null}