{"id": 825334, "slug": "scp-daybreak", "name": "SCP: Daybreak", "name_original": "SCP: Daybreak", "description": "<strong>--.--What is it?--.--</strong><br/><br/>\"An open-ended, SCP-based, atmospheric, exploration-focused, survival-horror game with puzzle elements and replayability.\" <br/><br/>You play as a scientist trying to get out of An SCP Facility, in the midst of a Solar Event Codenamed \"Daybreak\", in this event, The Sun melts any living thing touching it. however, those exposed are still alive, and will try to drag out you into the sunlight, whatever means possible.<br/><br/>The main goal of the game is to escape. you can find papers that tell you more about the lore, you can complete simple puzzles, varying from finding door codes, to doing tasks for other survivors.<br/><br/>You can explore the Detailed enviroments of Site-52. find clues on what happened to everyone there, and find out what happened to the world these last few hours.<br/><br/>You can meet other survivors trying to find their way out too. but be warned, they will do anything to get out. <br/>there are multiple endings that you can get, and the world is very non linear, almost all the rooms are explorable, you can find secrets and referances to other games too!<br/><br/>your decisions impact your future, <strong>What role do you play in this event?</strong><br/>those that are \"Affected\" by the sun come in many different forms, as they are trying to retain their shape they had before they turned.<br/>however, you cannot fight them, its impossible, you can only avoid them for now. hide in darkness, <strong>fear the light.</strong><br/><br/><br/> <strong>--.--Inspiration--.--</strong><br/><br/>When Day Breaks by <strong>Shaggydredlocks</strong> (main base, required reading)<br/>Amnesia (series)<br/>Penumbra (series)<br/>Outlast (series)<br/>SOMA<br/><br/><br/><strong>--.--WE NEED HELP! Here are the Skills Required,--.--</strong><br/><br/>Audio engineering for spooky ambience<br/>Blueprint/code scripting for puzzle elements<br/>Creature design (goopy monsters are hard)<br/>AI design for pursuing monsters<br/>Character design for any human characters<br/>VFX design for goopy slime effects<br/>Voice-actors for narration and characters<br/>Level design<br/>Prop and asset creation<br/>Story director to control pace and flow of the game<br/>Technical director for optimisation and packaging<br/><br/><br/><strong>--.--Current List of Developers/Helpers--.--</strong><br/><br/>Enard - Voice Actor, Modeler<br/><strong>Shaggydreadlocks</strong> - Voice Actor, Story Designer<br/>Bev / Johh Beven - Voice Actor, Lead Developer, Modeler<br/>Squiffyplays - Lead Developer, Modeler, Designer, Story Director, Audio Engineer<br/>Riseo - Voice Actor (Guest)<br/>Tornadoman4 - Advertising Expert, Voice Actor<br/>Brandon Cadenero - Developer, Modeler<br/><br/><br/><br/><br/>--.--Please note, the second cinematic trailer was made in 2018, and the project has been delayed until now--.--", "metacritic": null, "released": "2022-07-23", "tba": false, "updated": "2022-07-25T03:30:55", "background_image": "https://media.rawg.io/media/screenshots/de8/de85dbdd7bd517fbbe6ea508b686c6ac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Underscore Games", "Daybreak Studios"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["Daybreak Publishing"], "esrb_rating": null}