{"id": 82532, "slug": "the-wicked-wizard-of-oz-gamebook-companion", "name": "The Wicked Wizard of Oz Gamebook Companion", "name_original": "The Wicked Wizard of Oz Gamebook Companion", "description": "With the Wicked Wizard of Oz Gamebook Companion you can play Jonathan Green's fantastic Choose Your Path Adventure Gamebook on the go. Store your stats and equipment in the easy to use and convenient layout. We've even included dice and a handy Combat screen. Navigation is easy using left and right swipes on each screen.<br/><br/>__________<br/><br/>Character Setup Screen<br/><br/>Decided which of the four character you want to play as and choose it from this screen. You can also play as certain other special character, as long as you know the necessary codes to enter at the bottom of the screen!<br/><br/>__________<br/><br/>Adventure Sheet<br/><br/>You have three attributes you will need to keep track of during the course of the adventure, using the Adventure Sheet. Some of these will change frequently, others less so, but it is important that you keep an accurate record of the current level for all of them.<br/><br/>Agility - This is a measure of how athletic and agile you are. If you need to leap across a chasm or dodge a deadly projectile, this is the attribute that will be employed.<br/><br/>Combat - This is a measure of how skilful you are at fighting, whether it be in hand-to-hand combat, or wielding a keen-edged<br/>blade in battle.<br/><br/>Endurance - This is a measure of how physically tough you are and how much strength you have left. This attribute will vary more than any other during the course of your adventure.<br/><br/>In addition to your three basic attributes, you also have certain 'Special Abilities' that you can employ at critical moments during your journey through Oz. These vary depending on which character you decided to play as from the Character Selection screen. It is also, possible during your adventure that you may gain additional abilities, which can also be tracked here.<br/><br/>In addition to the test buttons, on some occasions during your adventure you may be asked to roll one or two dice. Swiping up on the Adventure Sheet screen will do just that. Take the die on the left for a single die roll, or the ones on the right for two dice.<br/><br/>Navigation<br/>Swipe left to return to the Main Menu. Swipe right to go to the Equipment Screen.<br/><br/>__________<br/><br/><br/>Equipment Screen<br/><br/>On this screen you can store a list of all the items you pick up during your adventure. In the boxes provided you can record up to 20 items, store notes and your current paragraph number when you have to take a break from the adventure.<br/><br/>Navigation<br/>Swipe left to return to the Main Menu. Swipe right to go to the Adventure Sheet.<br/><br/>__________<br/><br/><br/>Combat Screen<br/><br/>On this screen you can enter the stats for up to three monsters to battle against. Clicking on the battle button will make combat rolls for any active monsters (ie. those with an Endurance score higher than 0). As the battle progresses you can adjust the Monster's Endurance as required by the battle rules, along with your own. Don't forget to manually add the additional Combat point for any initiative gained during battles.<br/><br/>Navigation<br/>Swipe left to return to the Main Menu. Swipe right to go to the Adventure Sheet.", "metacritic": null, "released": "2017-06-02", "tba": false, "updated": "2019-10-22T14:22:41", "background_image": "https://media.rawg.io/media/screenshots/c67/c671e04f17e90384f7d5c3d66a6c864d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mark Stoneham"], "genres": ["RPG"], "publishers": ["Mark Stoneham"], "esrb_rating": "Everyone 10+"}