{"id": 825371, "slug": "yoko-redux-dreams-of-a-blue-planet", "name": "Yoko Redux: Dreams of a Blue Planet", "name_original": "Yoko Redux: Dreams of a Blue Planet", "description": "Jump into a noir mystery about three beings on their journey to discover the truth about their very existence.  <strong>Yoko Redux: Dreams of a Blue Planet</strong> is a new adventure from veteran indie developer Missing Sentinel Software.  While you're discovering this cyberpunk masterpiece, enjoy a smooth jazz sound track by local artists from the Live Music Capital of the World, Austin, Texas.<br/><br/><br/><br/><br/><strong>Yoko Redux: Dreams of a Blue Planet</strong> is driven by a rich, often cryptic, story as you control one of three main characters over the course of seven immersive chapters.  The story takes you down the paths of Locke, Jeanne and Primus in a world just waiting to be discovered and cracked open.  <br/><br/>As you immerse yourself in this unexpected playground, you will challenge your mind and enjoy a few pop culture references along the way.  Interacting with the world via point and click, you will make connections with a cast of questionable contacts to find clues, solve riddles and locate the special items necessary to open your way forward.  <br/><br/><br/><br/><br/>Experience a cyberpunk world where human consciousness comes in a hard physical shell.  Discover the beauty in a shifting five color palette that gives players a vibe of cool logic and mechanical precision.  At least at first...<br/><br/><br/><br/>Interact via stylized menus and clean dialogs. Immerse yourself in this digital world, right down to the menus and settings. <br/><br/><br/><br/>Follow along on a progression through the psychedelic in multiple color palettes.  Try to hold on to your sanity through mind bending visuals, cinematic camera angles and logic twisting story and you may discover...who is Yoko? <br/><br/><br/><br/><br/>Solve puzzles by clicking through the world and talking to your fellow inhabitants of Novo Redentor, Brazil.  You will need all of your wits to follow the clues and move forward through the story.  If you need a brief rest and some time to think, play a game of cards with one of your contacts.  No one ever turns down a good game of Narspel Jacks.", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-25T04:15:26", "background_image": "https://media.rawg.io/media/screenshots/d25/d25b6b19ee46bc0d7e766383cc419763.jpg", "website": "https://www.yokoredux.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Missing Sentinel Software"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["RedTigerPro"], "esrb_rating": null}