{"id": 825419, "slug": "vlinder-avatar-maker-anime", "name": "Vlinder avatar maker: Anime", "name_original": "Vlinder avatar maker: Anime", "description": "Create, dress up and customize your own cool anime avatars, use them on Weibo, Twitter, Instagram, Douyin and many more, show everyone that you are an amazing anime creator, and make awesome avatars with your hands Bar! <br/><br/>According to your own facial features, you can also make it according to your favorite characters, etc.<br/>You can also design cute cartoon and anime avatars according to your own wishes. <br/>There are many ways for you to choose!<br/><br/>There are plenty of eyes, hairstyles, eyebrows, mouths, cool clothes and background accessories to choose from, pick the coolest clothes and coolest hairstyles, and design your anime-style avatar! Add a variety of different expressions and perfect gestures to express yourself, shy, sunny or adventurous and other styles can be realized.<br/><br/>【Game Features】<br/>Enjoy the fun of making avatars!<br/>Creativity is unlimited, so that your avatar is no longer monotonous!<br/>Super anime style for SNS avatars.<br/><br/>Share your favorite works with your friends!<br/>Handsome, college style and other anime and cartoon styles are mixed and matched!<br/>Create your own profile, idol, and favorite character!<br/><br/>We will continue to add more style elements in the future.<br/>If there is anything you want to add, please let us know by comment or email.<br/>If you have difficulty choosing an avatar, come and play!<br/><br/>If you like this APP, please share more!<br/>Share with friends via Line!<br/>Create an avatar for Weibo, Twitter, Instagram, Douyin, and facebook LINE!<br/>Super recommended avatar maker for all occasions!<br/><br/>【Contact Us】<br/>– FB: https://www.facebook.com/groups/668368200546796<br/>– Email: support@31gamestudio.com<br/>– Instagram: Vlinder__life<br/>– TikTok: Vlindergames_TikTok<br/>– Youtube：https://www.youtube.com/channel/UCJSrxqzjN0KjfPN_MHsFFtw/?guided_help_flow=5CJSrxqzjN0KjfPN_MHsFFtw/?guided_help_flow=5", "metacritic": null, "released": "2022-06-27", "tba": false, "updated": "2022-07-25T05:16:24", "background_image": "https://media.rawg.io/media/screenshots/c0d/c0d920f59ca474f8d293fc9ebac16966_hvH3QKt.jpg", "website": "http://www.31gamestudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["DAN SU"], "genres": ["Simulation", "Casual"], "publishers": ["DAN SU"], "esrb_rating": "Everyone 10+"}