{"id": 825400, "slug": "cart-crash", "name": "Cart Crash", "name_original": "Cart Crash", "description": "Ever thought of riding a lot of carts through loopy tracks? Zig zag road, spiral madness, up up and then down, swirling and what not? Who does not want a roller coaster feel? Well, here is your chance! Enjoy the arcade game Cart Crash where you ride and grab carts through the ever satisfying tracks and form a train of carts. Lot of carts means lots of coins and other rewards. Do not get crushed into obstacles!<br/>Become a master racer through this arcade journey and unlock carts, skins, themes. Appropriate for all ages. Beautiful casual graphics.<br/><br/>What you can do -<br/>◉ Intuitive gameplay. Tap and hold and just watch out for the obstacles. Very fun difficulty progression and you will love it.<br/>◉ Join the carts and cheer with avatars! Form a huge cart train and get a huge amount of bonus coins. Unlock carts and skins with coins! Get free coins! Can you obtain the treasure box?<br/>◉ A surreal feeling of riding on twisted, loopy, swirling tracks and roads from your dream!<br/>◉ Do not forget to grab the keys. They will surprise you with new funny skins and carts you will absolutely love. How many skins and carts can you unlock?<br/>◉ Complete levels and unlock skins and carts as you play.<br/>◉ Want to feel the power of motion? Get the speed boosters!<br/>◉ Smoothing casual look and feel. Charming cool graphics.<br/><br/>A world full of thrilling motion, cute characters, funny carts and exciting obstacles to watch out for. You will feel accomplished as an arcade race master.<br/>Can you finish all the levels? Enjoy the fun!", "metacritic": null, "released": "2022-01-12", "tba": false, "updated": "2022-07-25T04:56:44", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e0010ac2c7c81b21db68e0d245f5234.jpg", "website": "http://tastypill.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["tastypill"], "genres": ["Adventure", "Racing"], "publishers": ["Tastypill"], "esrb_rating": "Everyone 10+"}