{"id": 825591, "slug": "covor-veil", "name": "Covor Veil", "name_original": "Covor Veil", "description": "<p><strong>WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES</strong><br/></p><p>Forbidden colors and monsters have started appearing from the island town's lighthouse, and seeing them drives people mad!</p>\n<p>Play as Clover, the town's only blind (?) creature, who is tasked with clearing the lighthouse.</p>\n<p>Follow him as he scales the lighthouse with 'Covorveil', banishing monsters back to where they belong. That might include himself, too.</p>\n<p><em>For Mini Jam 111!</em><br/></p>\n<p><em>Mini Jam section:</em></p>\n<p><em>I decided to just join on impulse. This is my second game jam, first one done alone (I did as friends but they couldn't join waaaa) but this one being bi-weekly made it feel more relaxed for me - at least I wouldn't need to wait a year if I horribly screwed up or anything alike.</em></p>\n<p><em>Since the submission form asked me about it, here's a brief summary of how I got to the concept:</em></p>\n<p><em>First, I wanted to do something with camouflage - enemies wouldn't be able to spot you if you were the same color as what was below you. Although neat, as an idea, it felt pretty surface-level so I wanted to dig a little deeper when the limitation was announced.</em></p>\n<p><em>I came up with three rough ideas. The first was probably inspired by the Shadow Clones in Super Mario Galaxy - the player would collect fragments of color, spawning a hostile, following clone. This still felt pretty surface level, and is probably too much for my skill level.</em></p>\n<p><em>The second idea revolved around the forbidden colors and the blind dragon you play as. You'd attack using the spinning color wheel. The idea of merging wasn't yet there, though, and this idea lacked the limitation.</em></p>\n<p><em>The last idea was more basic (paint warrior boomerang thrower in paint land with evil monsters!!!), but had one key mechanic which I implemented - entities would take damage if their color matched that of the floor.</em></p>\n<p><em>In combination with the color wheel attack, I got a decent idea for the limitation - your attacks change the colors of your enemies, which, in turn, change the color with which your enemies are going to attack - you are your own enemy!</em></p>\n<p><em>Combining the second idea with this game mechanic, I created Color Veil. I hope you like(d) it!</em></p>\n<p>PS: the browser version is a bit laggy at times, and the Windows version has some messy UI. Pick your poison!</p>", "metacritic": null, "released": "2022-07-24", "tba": false, "updated": "2022-07-25T06:35:29", "background_image": "https://media.rawg.io/media/screenshots/4dd/4dd6179aecbf2df2726b4b8abfb94f57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Axi"], "genres": ["Shooter", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}