{"id": 8255, "slug": "atomic-ball-hd", "name": "Atomic Ball HD", "name_original": "Atomic Ball HD", "description": "Join 1000’s of Atomic Ball HD players every day! +1,000,000 downloads up-to-date and still counting!<br/><br/>Atomic Ball HD brick breaker, discover the reincarnation of one of the best arcade game in history featuring +90 handcrafted levels with full iPad 3 Retina graphic themes.<br/><br/>Enjoy a true classic of gaming history and breakout genre games, join 1000’s of players every day! <br/><br/><br/>WHAT PEOPLE SAY ABOUT ATOMIC BALL<br/><br/>&amp;quot;If you like Brick Breakers but want something more modern and challenging take a look at Atomic Ball HD. With its HD graphics, great physics engine and challenging game features like 32 ball multi-ball play, Atomic Ball HD is sure to keep you entertained for hours.&amp;quot; - PadGadget.com<br/><br/>&amp;quot;Atomic Ball HD takes a tried and true formula of brick breaking, adds on some fun little twists.&amp;quot; - ThePortableGamer.com<br/><br/>&amp;quot;If you are a fan of brick breaking games, you are really going to love this one. The combination of spectacularly drawn graphics and unique look and feel of the atomic targets makes this an outstanding game.&amp;quot; - iPhoneLife.com<br/><br/>&amp;quot;I definitely recommend this game, true brick breaker fans shouldn&amp;#39;t even hesitate to give this one a go. Addiction is high. Overall 9/10!&amp;quot; - TouchArcade.com <br/><br/>&amp;quot;A New Brick Breaker game-style fun and well done!&amp;quot; - iSpazio.net <br/><br/>&amp;quot;A super hyped-up version of Pong with all kinds of insane mixed in.&amp;quot; - AppVader.com <br/><br/><br/>MAIN FEATURES<br/>* Multiple gameplay modes; standard, hard and two-player deathmatch<br/>* Game Center Leaderboards &amp;amp; Achievements<br/>* iPad 3 Retina Graphics<br/>* With 30 powerups to be unlocked including multiball powerup<br/>* Featuring most interactive and advanced physics in it&amp;#39;s genre <br/>* More then +90 handcrafted levels<br/>* East to pick and play, fast paced addictive gameplay<br/>* Multitasking and Accelerometer support<br/>* Device rotation enabled <br/>* Premium narrator voice<br/>* Touch and Tilt controls<br/><br/><br/>WE VALUE YOUR FEEDBACK AND WE APPRECIATE YOUR CRITICISM <br/><br/>We always welcome your feedback, comments, suggestions and especially your constructive criticism – they all help us to improve Atomic Ball HD app. <br/>Contact us at support@meritumsoft.hr and make sure you come and visit us at https://www.facebook.com/meritumsoft", "metacritic": null, "released": "2010-10-21", "tba": false, "updated": "2019-10-22T14:29:45", "background_image": "https://media.rawg.io/media/screenshots/0e3/0e3a3321dfddc8efa7fac3b6efde357e.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meritum Soft"], "genres": ["Action", "Arcade"], "publishers": ["Meritum Soft"], "esrb_rating": "Everyone 10+"}