{"id": 825538, "slug": "bees-vs-cloud", "name": "Bees Vs Cloud", "name_original": "Bees Vs Cloud", "description": "Setting\r\n<p>As the bee crisis continues to inch closer and closer, humanity makes one last desperate attempt to save the bees. This results in the bees being able to directly consume the suns energy  which in turn leads to a massive bump in the Bee population. However, the bees are still hungry! They are now headed direcly for the sun, and will not stop until all of it is gone. This is where you, the player come in. You are  a lone cloud that decided it will have none of this and thus it begins to battle the bees attempts at consuming the sun, by spraying them with water and rainbows.<br/></p>\r\nGame mechanics\r\n<p>your goal is to shoot projectiles (rain/rainbows) upon incoming bees.</p>\n<p>Optionally, each projectile can be charged, in order to span a greater area and potentially kill more bees (this is done by holding down the shoot button).</p>\n<p>However, each shot causes the cloud to lose a bit of its stored water, so shooting too many projectiles in too small a time frame, will cause the cloud to evaporate, which leads to a game over.</p>\n<p>If to many bees get past the cloud, a game over will also occur, as the sun is consumed, and all humans collectively   die a grusome death.</p>\r\nControls\r\nLeft + RightCloud MovementSpaceShoot Button\r\nDisclaimer\r\n<p>This small game has primarily served as a test for my own  game engine (Asciir), in order to evaluate which features  it is missing   + potential improvements on the workflow. funnily enough i have already discovered that some times <strong>the engine crashes</strong> on scene changes, however this has only happened 2 times whilst developing the game, so <strong>a simple restart, if this happens, should allow one to play the game</strong>.</p>\n<p>This is also the first time i have made a \"proper\" game, so please do not expect too much from it.</p>\n<p>Finally, no web version will be avaliable, as my game engine specializes in creating games that run purely in the terminal, which means the game must be run locally, as there is not a way to easily emulate console applications in the browser. (at least not that i know of)</p>\n<p>I hope you will enjoy the game :)</p>", "metacritic": null, "released": "2022-07-25", "tba": false, "updated": "2022-07-25T06:13:22", "background_image": "https://media.rawg.io/media/screenshots/8fe/8fe393748eed7b2d4f2ac236251e433c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["karstensen"], "genres": [], "publishers": [], "esrb_rating": null}