{"id": 825594, "slug": "p-type-prototype", "name": "P-Type (Prototype)", "name_original": "P-Type (Prototype)", "description": "Story\r\n<p>All started when I was in CEGEP (a sort of pre-university in Quebec, to explain it simply). For one of my course, I had to do a game with an home made C++ game engine. I started with the idea of making a puzzle game like Columns (Genesis/Megadrive) with Rayman 1 ressources. The name back then : Rayman Standing Lines (Because standing lines are Columns... You see the joke?).</p>\n<p>Mid-term of the course, I realised that the game engine was not really build for doing a game like Columns. So I decided to create another puzzle game. A concept that I imagined and I never seen anywhere. So I did this concept, recycling my ressources from Rayman Standing Lines (And from others projects from previous courses for making something logic). The name : Rayman Puzzle.</p>\n<p>So, here we are today, 6 years later, launching a prototype of P-Type, an upgrade of Rayman Puzzle coded in Godot.</p>\r\nToo many cross-overs! \r\n<p>You control the R-90 Ragnarok from R-Type III and you must shoot and match pieces from Rayman 1, while grooving on a track from Sonic Adventure 2. The more nerds will also recognise the font from Rayman 2</p>\n<p>The P in P-Type stands for \"Puzzle\"</p>\r\nKeep in mind that it is a prototype\r\n<p>The game may seem a little bit empty, but I wanted to share a prototype before working on a more complete version, for seeing if people think that the base idea is good. If you love the project, then I'll work on a more complete version that I'll put in early access (I have tons of ideas, some are new, some were already in Rayman Puzzle). With an early access, I could deploy updates for the game occasionally, so it's better to see the game evolve sometimes than to wait for one complete version, according to me.<br/>Anyways, if you want to share you comments/feedback, you can do it at the bottom of the page or you can select \"Give Feedback\" in the game menu.</p>\r\nHow to play \r\n<p>You'll find a tutorial in the game menu (\"How to Play\") which explain the controls and the basic gameplay. You can play with the keyboard or with a controller (Any controller will work. For your information, I tested the game with an Xbox 360 and a PS2 Controller). </p>\n<p>If your controller have any issue with the game (like my SNES Hyperkin controller), my pro tip would be to set it up in X360ce.<br/></p>", "metacritic": null, "released": "2022-07-24", "tba": false, "updated": "2022-07-25T06:36:51", "background_image": "https://media.rawg.io/media/screenshots/d6f/d6f8a18794f1b9a16c4e740623729dd4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["L_BlueYoshiFan97"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}