{"id": 8258, "slug": "daggervale", "name": "Daggervale", "name_original": "Daggervale", "description": "Note: Daggervale is only available in English!<br/><br/>BONUS: For a limited-time only, owners of the full version will receive an exclusive in-game item! The &amp;#39;Pirate Hat of Pillaging&amp;#39;! which provides a 10+ bonus to luck!<br/><br/>IMPORTANT:<br/>Daggervale is targeted towards mid to high end devices, we HIGHLY recommend you play the free version to ensure the game will run properly on your device! Furthermore, save games from the free version will NOT port over to the full version of the game!<br/><br/>* Story *<br/>The town of Oakvale is a small and peaceful town in the Old Forest, its inhabitants work hard tending the fields and the town is bursting with commerce and trade. And as far as man can remember, the dungeon gate has stood at the head of town, filled with powerful beasts and glorious loot! Many adventurers before you have embarked on the grand journey of harvesting the dungeons wealth, yet none have lived to tell the tale. Might you be first the defeat the dungeon lord that lurks beneath? And collect the bounty that all others dream of? Step forth adventurer! Will you be triumphant?<br/><br/>* About *<br/>Daggervale is a 3D hack &amp;amp; slash dungeon crawler that features randomly generated levels, items, monsters, quests and a ton more of content that is sure to bring hours of enjoyment to the player!", "metacritic": null, "released": "2015-01-16", "tba": false, "updated": "2019-10-22T14:29:45", "background_image": "https://media.rawg.io/media/screenshots/a8c/a8c0b0f5ef3853361cae09138f13fad6.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Concept Softworks"], "genres": ["Adventure", "RPG"], "publishers": ["Concept Softworks"], "esrb_rating": "Everyone 10+"}