{"id": 825954, "slug": "together-bot", "name": "to.get.her bot", "name_original": "to.get.her bot", "description": "<p>Thank you for purchasing the to.get.her bot, from NASA.<br/></p>\n<p>to.get.her will help you practice for your date.</p>\n<p>Panel testing has revealed that the average human has 7 opportunities to make their mark on a date.</p>\n<p>So prepare your moves and remember that you can only use each move once through the course of the date.</p>\n<p>Our science backs the theory that the key to understanding other people is to see things from their point of view.</p>\n<p>Your interactions are perceived by your date through the lens of their mood and the to.get.her bot displays their mood to help you with get accustomed to this.</p>\n<p>In practice, the impact of the CARDS you play are modified by the MOOD*, before being applied to the Spark-O-Meter™.</p>\n<p>In 2022, our researchers made a giant breakthrough: First impressions matter throughout the duration of a date!</p>\n<p>Our newest to.get.her bot teaches the importance of a first impression by repeating the first MOOD as the final MOOD. Train yourself to close your date with a strong final move that calls back to the first mood your date felt.</p>\n<p>You can't read a book by its cover. That's why our researchers have programmed all types of personalities into to.get.her bot.</p>\n<p>Every time you have a good or perfect date, a new date will be prepared for you to practice with.</p>\n<p>Good luck making yourself attractive to everyone!</p>\n<p>As you complete practice dates, you will learn more about yourself.</p>\n<p>Feel free to change your game by replacing one of your interactions with another in between dates. Or, stay true to yourself by making the best use of your limited moves.</p>\n<p>Installation\r\n</p>\n<ul><li>Extract zip file.\r\n</li><li>Run: togetherbot.exe.\r\n</li><li>If Windows says it's an unknown file and a risk, just say it's ok and proceed. The game will run.\r\n</li></ul>\n<p>Controls\r\n</p>\n<ul><li>Left-Click to play a card</li><li>Play them all to complete the date</li></ul>\n<p>*Some cards ignore moods and directly affect the spark between you and your date.</p>", "metacritic": null, "released": "2022-07-24", "tba": false, "updated": "2022-07-25T09:08:15", "background_image": "https://media.rawg.io/media/screenshots/643/643e56b017e9841cfeebcea860a63510.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["olivieryc", "puggsoy", "SlimTimSnail"], "genres": [], "publishers": [], "esrb_rating": null}