{"id": 826037, "slug": "color-calamity", "name": "Color Calamity", "name_original": "Color Calamity", "description": "<p>Made for Mini-Jam 111: Colors².</p>\n<p>You are a color factory engineer, newly hired to help develop color factories. Draw lines of pipes between nodes and factories of the same color to connect them. However, lines of different colors can't be crossed. The last person who had your job quit and told you it was impossible to do. But you have a bit of magic up your sleeve...</p>\n\n<p>CONTROLS: explained in-game</p>\n<p>MINI-JAM:</p>\n<ul><li>Theme: Colors²<ul><li>This jam fits the theme of Colors² because you must connect nodes and factories with pipes, all of which must have the same color. Additionally, you may have to mix some colors together to achieve the final color. Overall, this game relies heavily on how you connect the colors together.</li></ul></li><li>Limitation: You Are Your Own Enemy<ul><li>This jam fits within the limitation of You Are Your Own Enemy because you have to be careful about where you place your pipes. Since pipes of different colors can't overlap, and you can't create pipes between factories, you need to strategize on how you will solve each factory. If you don't use the space correctly in the beginning, it will create a lot of trouble for you in the end, and you may have to restart the whole level. Therefore, if you don't optimize the space you use, you will become your own enemy in terms of completing the level.</li></ul></li></ul><p>This game was inspired by: shapez.io, the Three Utilities Problem, and a game I used to play with my grandmother.</p>", "metacritic": null, "released": "2022-07-23", "tba": false, "updated": "2022-07-25T09:41:54", "background_image": "https://media.rawg.io/media/screenshots/101/1010acf31f2a0b34a9dcde7c3678175e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["wolr210"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}