{"id": 826165, "slug": "cyberattack-a-h-r999", "name": "CyberAttack (A-H-R999)", "name_original": "CyberAttack (A-H-R999)", "description": "<p>Note: This Early Access game is not complete and may or may not change further. If you are not excited to play this game in its current \"\"BROKEN\"\" state, then you should wait to see if the game progresses further in development.</p>\n\n<p>How to Play:\r\n</p>\n<p>WASD - Movement\r\n</p>\n<p>Mouse - Looking around\r\n</p>\n<p>Shift - Run</p>\n\n<p>Game Objective:\r\n</p>\n<p>Collect the vaccines to survive the broken world.\r\n</p>\n<p>Be careful, weird enemies will be after you.\r\n</p>\n\n<p>The story below:<br/></p>\n<p>It’s the year 2055. COVID-19, a virus that plagued the world in 2019, started to cause abnormal mutations in all infected life forms. Humans and animals began to grow multiple heads, and have elevated levels of aggressive behaviors among other abnormalities.</p>\n<p>To fight the plague, Countries started working on a vaccine hoping that it would cure the world from this plague. However, scientists didn’t expect the virus to viciously infect the entire world in a short time and had to resort to drastic measures to fight it. They began transforming the infected into cyborgs in an attempt to stop the virus from spreading and cure them from it.</p>\n<p>As time went by, more people, including scientists, got infected and the vaccines became extremely rare. Because of that, the infected cyborgs broke loose. Countries started closing their borders and communications between them were broken. Cities were ravaged by the infected. The life we have known before 2019 was long forgotten. You are playing as a survivor who heard a rumor about an abandoned and destroyed city that has some vaccine left around before the city was destroyed. Hoping you would find 5 vaccines for your friends, you went to the destroyed city to search for the vaccine believing that it was safe and abandoned.</p>\n<p>Or so you thought? Enjoy :))</p>", "metacritic": null, "released": "2022-07-23", "tba": false, "updated": "2022-07-25T10:36:39", "background_image": "https://media.rawg.io/media/screenshots/aaa/aaa93097cfeae7399888daf06a8638c5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["A-H-R999"], "genres": ["Action"], "publishers": [], "esrb_rating": null}