{"id": 826360, "slug": "we-dont-die-here-demo", "name": "We don't die here (DEMO)", "name_original": "We don't die here (DEMO)", "description": "<p><strong>STORY:</strong><br/></p>\n<p>An entirely unknown threat has descended on your people, diminished your population to nearly nothing in 4 short weeks, and driven you from your home world; this is your extinction event.</p>\n<p>You, Empress Asa, refuse to accept this.</p>\n<p>But, you're about to be overrun...</p>\n\n<p><strong>GAMEPLAY:</strong></p>\n<p>-Turn based, attack telegraph combat. Enemy attacks will be telegraphed before the attack connects next turn. You must either dodge heavy attacks, or block light attacks, to avoid 100% of the damage. Failing to read a telegraph correctly and using the incorrect defense method results in you taking heavy damage.</p>\n<p>-Puzzles. Although not present in the demo, the final version will sport puzzles in between combat.</p>\n<p>-2 (sort of) endings. (\"But wait-\" I hear you ask. \"This is just the start of the story. How are there 2 endings already?\" You'll see what I mean when you play it.)<br/>-1 hidden, collectable doll.<br/></p>\n\n<p><strong>DEMO and Kickstarter:<br/></strong></p>\n<p>This is a demo. I plan to kickstart the final version. Follow me on YouTube and/or my Discord server if you would like to be informed when the kickstarter for this game begins!</p>\n<p>YouTube channel<br/>Discord Server<br/><br/></p>\n<p>This game shares the same universe as <strong>Ara and the Empty Universe</strong> and <strong>Our way down.</strong></p>\n<p><strong>UPDATE 1.1: </strong>July 23, 2022.<br/>-Fixed sequence break that occurs if you go to the town's East hub before clearing out the center.<br/>-Day 1 update, yaaaaaaaay.<br/></p>", "metacritic": null, "released": "2022-07-23", "tba": false, "updated": "2022-07-25T12:01:11", "background_image": "https://media.rawg.io/media/screenshots/99f/99f35d90820b99f4d744b210421309ce.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Basim Aziz"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}