{"id": 82639, "slug": "mirror-dash-free-mesmerizing-mirrored-odyssey", "name": "Mirror Dash FREE - Mesmerizing Mirrored Odyssey", "name_original": "Mirror Dash FREE - Mesmerizing Mirrored Odyssey", "description": "Have you ever looked in the mirror and discovered a world full of wonders? Just like Alice in Wonderland, go ahead and jump through the Mirror Dash mirror and see the world in a way you’ve never experienced before!<br/><br/>\"Mirror Dash is a very fun, challenging  but also addictive 2D platformer that is definitely worth trying out\"<br/>-PocketFullOfApps<br/><br/>\"The visual style of this game is quite unique in a way; it’s both minimalistic, yet very detailed\"<br/>- Pookybox<br/><br/>Mirror Dash is a minimalist fast paced 2D action game where you find yourself at the dawn between two opposed worlds. These magnificent worlds are separated by a Mirror, an incredible Mirror through which you can jump!<br/><br/>See how much you can resist on one Mirror side but if the obstacles become impossible then jump to the other side! <br/><br/>Have fun in this ridiculously fun game and jump up, jump down, jump in and jump around!<br/><br/>Explore some of the most beautiful places! Each has an opposed Mirror image, from the wild Egyptian deserts and blossomed Japanese gardens to the charming and glamorous cities of France, Italy and Britain. <br/><br/>Features:<br/><br/>◉ Mesmerising minimalist visual design;<br/><br/>◉ Multiple funny characters;<br/><br/>◉ Simple to play, difficult to master;<br/><br/>◉ Progress-based achievements;<br/><br/>◉ Catch collectibles to unlock levels;<br/><br/>◉ Beautiful themed music;<br/><br/>◉ NO In-App purchases and NO ads;<br/><br/>Mirror Dash is filled with challenges that will keep you immersed!  Have a look at the screenshots and see for yourself. You will not be disappointed, so don't wait and PLAY IT NOW!", "metacritic": null, "released": "2016-06-23", "tba": false, "updated": "2019-10-22T14:22:44", "background_image": "https://media.rawg.io/media/screenshots/6d3/6d3d34f7c78a7b77a9f4d536fe1a995f.jpg", "website": "http://novogames.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Novo Games"], "genres": ["Arcade"], "publishers": ["NOVO GAMES"], "esrb_rating": "Everyone 10+"}