{"id": 826646, "slug": "depth-treader-prototype-a2", "name": "Depth Treader: Prototype A2", "name_original": "Depth Treader: Prototype A2", "description": "<p>Created by Skull Jockey and H. Stott (https://stotty.itch.io/)--a first game jam entry by both developers, as it may be apparent once you play it.</p>\n<p>This game does feature some imagery and designs that players not 18+ might find unsettling.</p>\n<p>There are no sound, no FOV, no keybinding,  and no graphics settings. There is, however, a mouse sensitivity slider which you may enjoy.</p>\n<p>The year is 1989:</p>\n<p>You are a pilot who has likely had his eardrums ruptured (ran out of time to implement any sounds before the deadline of MechJam III). Your objective: find a black box on the dark depths of the sea floor. Your means: a prototype of a new class of submersible: a Depth Treader. </p>\n<p>Built to withstand the sudden and deadly currents in the anomalous zone, you are one of many pilots who have been sent down to map out and explore this elusive new terrestrial plane shrouded in darkness and danger.</p>\n<p>The game features unlockables and lore, though the former may be inaccessible in the current version of the game. Hey, hey, but all is not sour grapes! There is a special cutscene if one does beat the single level in this game--some might call it even \"soulful\", as in deep-fried soulful.</p>\n<p>This game will be difficult for those who are new to it, but will (perhaps unfortunately) be somewhat easy for those who know how to beat its single level.</p>\n<p>Also, the developers do not recommend melee'ing unless the player wants one hell of a challenge. As we put down our tools as time ran out, one of the remaining issues we wished we could finish addressing was the combat balancing.</p>\n<p>It's recommended you keep moving and dodge and bring either a lot of airtime with you or enough railrods if you think you're a good shot. This game could technically be snuck in to a 90's arcade or Windows XP title at an early 2000's office supply store and pass as another 3D shooter that's simple yet (needlessly, some might say) difficult.</p>\n<p>That all being said, we do plan on continuing this project in the coming weeks and months. It was a fun and fantastic learning experience to develop a game within the span of two weeks. We found our strengths when pressed to our limits in how much we could do compared to what we wanted to do in the time we were given. We discovered new ways of carrying out an effective workflow (even if said effectuality came in at the proverbial eleventh hour). And like a theme park ride that ends too early, we'll go on it again and continue development in the Unreal Engine.</p>", "metacritic": null, "released": "2022-07-22", "tba": false, "updated": "2022-07-25T14:07:39", "background_image": "https://media.rawg.io/media/screenshots/d6b/d6b400d9cdf753f0b06009e79c33410f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SkullJockey", "Stotty"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}