{"id": 826638, "slug": "torreoscura-amstrad-cpc-englishspanish", "name": "Torreoscura (Amstrad CPC) (English/Spanish)", "name_original": "Torreoscura (Amstrad CPC) (English/Spanish)", "description": "<p>Production Team<br/></p>\n<p>Story and Adventure in The Quill: Bieno<br/>Amstrad CPC adaptation: MiguelSky<br/>Loading screen: R. International (Sputnik World)<br/>Graphics of The Illustrator: Bieno<br/>Amstrad CPC graphics adaptation: Rockersuke<br/>Loading melody: Baron Ashler (Kabuto Factory)<br/>Cover and diptych illustrations: Igor Errazkin<br/>Cover layout: Josepzin and Litos</p>\n\n<p>Nos situamos en una sociedad actual, donde nuestro protagonista, una persona de mediana edad y desbordada de trabajo, necesita urgentemente un descanso. Impulsivo y de no pensarse demasiado las cosas, al llegarle por azares del destino una carta de un antiguo amigo donde le invita a pasar unos días a un pueblo, lejano y del todo desconocido, decide ponerse en marcha. La historia nos deja en el momento en el que llega a Torreoscura en taxi al hostal. Allí deberá averiguar qué sucede y encontrar a su amigo</p>\n<p><em>We are set in a modern society, where our protagonist, a middle-aged and overworked person, urgently needs a break. Impulsive and not thinking too much about things, when he receives a letter from an old friend inviting him to spend a few days in a distant and totally unknown town, he decides to set off. The story leaves us at the moment when he arrives in Torreoscura by cab to the hostel. There he must find out what happens and find his friend.</em></p>\n\n<p><strong>Instrucciones<br/></strong>Recordemos que estamos en una aventura hecha con el The Quill, con lo que nuestras órdenes se componen de 2 palabras, normalmente VERBO + OBJETO y como en las aventuras anteriores, el funcionamiento es muy simple</p>\n<p>Para moverse: N, S, E y O como puntos cardinales para desplazarse<br/>Para moverse: IR + Nombre de la localización. Por ejemplo: IR IGLESIA<br/>EXAMINAR se usa para ver algo o a alguien en concreto<br/>MIRAR se usar para tener una vista general de la localización<br/>ESPERAR te hace saltar 1 turno<br/>AYUDA nos muestra unas instrucciones parecidas a estas<br/>INFO nos muestra lo créditos del juego</p>\n<p>Las acciones mas usuales son: COGER, DEJAR, USAR, EXAMINAR, DAR, CAVAR, SUBIR, BAJAR, EMPUJAR, TIRAR, CORTAR…</p>\n<p>…y recordad haceros un mapa !!!</p>\n<p><strong>Instructions<br/></strong>Remember that we are in an adventure made with The Quill, so our orders are composed of 2 words, usually VERB + OBJECT and as in previous adventures, the operation is very simple</p>\n<p>To move: N, S, E and W as cardinal points to move.<br/>To move: GO + Name of the location. For example: GO CHURCH<br/>EXAMINE is used to look at something or someone in particular.<br/>LOOK is used to get an overview of the location.<br/>WAIT makes you skip 1 turn<br/>HELP shows us instructions similar to this one<br/>INFO shows the game credits</p>\n<p>The most common actions are: TAKE, DROP, USE, EXAMINE, EXAMINE, GIVE, DIG, CLIMB, CLIMB DOWN, PUSH, PULL, CUT....</p>\n<p>...and remember to make a map !!!!</p>", "metacritic": null, "released": "2022-07-22", "tba": false, "updated": "2022-07-25T14:04:06", "background_image": "https://media.rawg.io/media/screenshots/57d/57d1fbc07c05c308618ee388b0c9bd5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amstrad ESP"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}