{"id": 826624, "slug": "siemb-chronicles-arkos-the-traitor-amstrad-cpc", "name": "Siemb Chronicles: Arkos the traitor (Amstrad CPC)", "name_original": "Siemb Chronicles: Arkos the traitor (Amstrad CPC)", "description": "<p><strong>DEVELOPMENT TEAM</strong></p>\n<p>PROGRAM: Artaburu<br/>GRAPHICS: Sad1942<br/>MUSIC MENU and GAME: McKlain<br/>STORY, SCRIPT and editing: Litos<br/>COVER ILLUSTRATION: Jesús Martínez del Vas (JMV)<br/>HAND ILLUSTRATIONS: Sad1942<br/>IDEAS: MiguelSky<br/>TESTING: JGonza, Chemamstrad, and BlackMores</p><p>Additional material and information in the Amstrad ESP data sheet<br/></p>\n\n<p>Caberhi Tram, comandante de élite de las fuerzas militares del emperador Shakar, es leyenda en la galaxia de Ururben. Aun estando al servicio del malvado dirigente intergaláctico sus aventuras a través de innumerables mundos le han convertido en héroe de oprimidos. <br/></p>\n<p>Tras su legendaria empresa en la búsqueda de las tres tumbas galácticas que, finalmente, constituyeron el final del imperio, sus aventuras se cuentan entre susurros y cuentos, en palacios, cantinas, mercados y hogares de toda la galaxia. Una serie de aventuras que se recogen en las “Crónicas de Siemb”.\r\n</p>\n<p><strong>ARGUMENTO<br/></strong>Una de estas aventuras llevó a nuestro héroe a los dominios de una de las gobernadoras del imperio, más allá de Alfa Centauri, donde Gremla gobernaba con mano de hierro sobre cinco confederaciones de planetas, en el imperio galáctico de Siemb. Su lugarteniente Arkos se había vuelto contra la gobernadora y, por lo tanto, contra el imperio. Caberhi Tram voló hacia el planeta Hypsis, también conocido como el planeta cárcel, en busca de Arkos.</p>\n<p>Arkos, después de destruir el palacio de Gremla y debilitar su gobierno en el planeta Sckunn, conocido por todos como Planeta-Palacio Imperial, regresó al planeta Hypsis, centro de producción de materias primas del imperio y emplazamiento de ultramodernas instalaciones defensivas que Arkos conocía perfectamente. Arkos había reprogramado todos los robots de trabajo y terminators de seguridad para su propia protección y, además, contaba con las criaturas autóctonas del planeta para defenderle.\r\n</p>\n<p>Nuestro héroe tenía que conseguir llegar a las instalaciones, encontrar a Arkos y acabar con él, pero antes debería atravesar el perímetro y eso no sería fácil.\r\n</p>\n<p><em>Caberhi Tram, elite commander of Emperor Shakar's military forces, is a legend in the Ururben galaxy. Although in the service of the evil intergalactic ruler, his adventures across countless worlds have made him a hero of the downtrodden. </em></p>\n<p><em>After his legendary enterprise in the search for the three galactic tombs that, finally, constituted the end of the empire, his adventures are told between whispers and tales, in palaces, canteens, markets and homes throughout the galaxy. A series of adventures that are collected in the \"Chronicles of Siemb\".</em></p>\n<p><em><strong>ARGUMENT<br/></strong></em><em>One of these adventures took our hero to the domain of one of the empire's governors, beyond Alpha Centauri, where Gremla ruled with an iron fist over five confederations of planets, in the galactic empire of Siemb. Her lieutenant Arkos had turned against the governor and thus against the empire. Caberhi Tram flew to the planet Hypsis, also known as the prison planet, in search of Arkos.</em></p>\n<p><em>Arkos, after destroying Gremla's palace and weakening his government on the planet Sckunn, known to all as the Imperial Palace-Planet, returned to the planet Hypsis, the raw material production center of the empire and the site of ultra-modern defensive installations that Arkos knew perfectly well. Arkos had reprogrammed all the work robots and security terminators for his own protection and, in addition, he counted on the planet's indigenous creatures to defend him.</em></p>\n<p><em>Our hero had to get to the facility, find Arkos and finish him off, but first he had to get through the perimeter and that would not be easy.</em></p>", "metacritic": null, "released": "2022-07-22", "tba": false, "updated": "2022-07-25T13:57:14", "background_image": "https://media.rawg.io/media/screenshots/a03/a034d4ad533a89f7a1d8f8eb32fa7907.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amstrad ESP"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}