{"id": 826690, "slug": "ghostwarden", "name": "Ghostwarden", "name_original": "Ghostwarden", "description": "Ghostwarden<p>Enter the flying crypt to capture wayward spirits, build your deck, and defeat the boss! Explore a top down map, collect cards or remove them from your arsenal deckbuilder-style, use your blood &amp; stealth to defeat enemies.</p>\n<ul><li>Choose whether to make noise or act stealthily when fighting - some cards may enhance your ability to sneak, while others might enhance your ability to go all out!</li><li>Balance your health - spells require blood, which may result in hard hitting combos or an untimely demise when your stealth runs out.</li><li>Play to your relics and control the cards in your deck to catch ghosts before they know what hit them, but beware the final battle!</li></ul>\n<p>How To Play:</p>\n<p>Navigate on the map defeating enemies, collecting relics, and visiting blood shrines to remove cards from your deck that don't follow your strategy.<br/></p>\n<p>Start each battle with 5 stealth, 3 Energy and and 30 health. Energy is replenished every turn and is required to play cards.  Health is replenished at the end of every battle. As long as you have 1 or more Stealth, enemies will not attack- but some cards make noise, reducing your Stealth, and Stealth dwindles by 1 every round.</p>\n<p>Battle your way through the Crypt collecting cards and defeat the boss!</p>\n<p>Controls:</p>\n<ul><li>WASD to move on the map.</li><li>Click and drag cards into play to play them when in battle.</li><li>When choosing a card to discard, click on cards to discard them. You can click them again to return them to your hand. Press \"Discard\" when you have decided.</li></ul>\n<p>Team:</p>\n<p>Coding, Design - Arthur Littlefield<br/>Character Art, Environment Art, UI - Jay Holtman<br/>Design, AI Card Art - Will Lewis<br/>Music, SFX, AI Title Art - Frank Littlefield\r\n</p>\n<p>Made for the Portland Indie Game Squad's Summer Slow Jams 2022 event, with \"Stealth\" and \"Critters\" as the themes. Play from all of the jam games here!</p>\n<p>Have fun!</p>", "metacritic": null, "released": "2022-07-22", "tba": false, "updated": "2022-07-25T14:26:55", "background_image": "https://media.rawg.io/media/screenshots/3cb/3cb521debb34f95e2df43a7b3092413e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 136, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gamewill", "primitiveType"], "genres": [], "publishers": [], "esrb_rating": null}