{"id": 826626, "slug": "red-sunset-amstrad-cpc", "name": "Red Sunset (Amstrad CPC)", "name_original": "Red Sunset (Amstrad CPC)", "description": "<p><strong>Development Team</strong></p>\n<p>Programming: Raúl Simarro.<br/>Graphics: Sad1942.<br/>Music and special effects: McKlain.<br/>Cover illustration: Ricardo Machuca.<br/>Story and Editing: Litos.<br/>Proofreaders: Blackmores and JGonza.<br/>Extra contributions by MiguelSky and 6128.</p>\n\n<p><strong>Año 2125. New Kioto</strong></p>\n<p>Como cada tarde, Takeshi, después de salir del colegio, se dirige a casa para ayudar a su hermana Sakura a cuidar el jardín del abuelo, pero esta vez será muy distinto. Al aproximarse al jardín del abuelo, Takeshi encuentra una nota, clavada con un cuchillo, en el árbol:</p>\n<p>\"Sakura está en nuestro poder. Si quieres ver a tu hermana, sana y salva, ven a la base de La Mano Roja antes de que se oculte el sol.\"</p>\n<p>Apretando el puño, Takeshi lanza una maldición y se dirige al hangar del abuelo.</p>\n<p>Akiyama Azuma, el abuelo de Takeshi, es un reputado ingeniero aeroespacial. Hasta su jubilación ha participado en los más avanzados proyectos relacionados con aerotransportadores y cruceros espaciales. En su hangar personal atesora dos naves terrestres diseñadas y construidas por él mismo.</p>\n<p><em><strong>Year 2125. New Kyoto</strong></em></p>\n<p><em>Like every afternoon, Takeshi, after leaving school, goes home to help his sister Sakura to take care of his grandfather's garden, but this time it will be very different. As he approaches Grandpa's garden, Takeshi finds a note, stuck with a knife, on the tree:</em></p>\n<p><em>\"Sakura is in our possession. If you want to see your sister, safe and sound, come to the base of The Red Hand before the sun goes down.\"</em></p>\n<p><em>Clenching his fist, Takeshi hurls a curse and heads for Grandfather's hangar.</em></p>\n<p><em>Akiyama Azuma, Takeshi's grandfather, is a reputable aerospace engineer. Until his retirement he has been involved in the most advanced projects related to air transporters and space cruisers. In his personal hangar he treasures two ground ships designed and built by himself.</em></p>\n<p><strong>La misión<br/></strong>Para llegar a la base de La Mano Roja, Takeshi tendrá que atravesar el sector de Shirakawa, en el barrio de Gion, penetrar en las cavernas bajo Shijo Dori y, finalmente, adentrarse en la peligrosa zona de Hashimoto, dominio de La Mano Roja. </p>\n<p>Desgraciadamente la misión no será tan sencilla. Cada uno de los sectores está protegido por un Jōshi  y tendrás que batirte en duelo para conseguir atravesar su dominio. </p>\n<p>Procura llegar al enfrentamiento con energía y recursos suficientes para poder vencerle. </p>\n<p>Algunos de estos Jōshi tendrán, a su vez, un peligroso subalterno que intentará aniquilarte antes de llegar al final del sector.</p>\n<p><strong>El Juego<br/></strong>Desde el menú de opciones del juego puedes seleccionar varias opciones iniciales antes de embarcarte en la aventura.  Puedes moverte por el menú usando las teclas del cursor y ESPACIO.</p>\n<p>Las teclas de juego por defecto, si no has redefinido antes, son : </p>\n<p>DIRECCIÓN: Flechas del cursor;  DISPARO: Z;  BOMBAS: X</p>\n<p>Elección de nave (SHIP): Selecciona la nave más adecuada a tu estilo de juego.</p>\n<p>Selección de fase (STAGE): En caso de que hayas conseguido superar alguna fase, desde aquí podrás seleccionar en qué punto quieres empezar.</p>\n<p><em><strong>The mission<br/></strong>To reach the Red Hand's base, Takeshi will have to cross the Shirakawa sector in the Gion district, enter the caverns under Shijo Dori and finally enter the dangerous area of Hashimoto, the Red Hand's domain. </em></p>\n<p><em>Unfortunately, the mission will not be so simple. Each of the sectors is protected by a Jōshi and you will have to fight a duel to get through their domain. </em></p>\n<p><em>Try to arrive at the confrontation with enough energy and resources to be able to defeat him. </em></p>\n<p><em>Some of these Jōshi will have, in turn, a dangerous minion that will try to annihilate you before reaching the end of the sector.</em></p>\n<p><em><strong>The Game<br/></strong>From the game's options menu you can select several initial options before embarking on the adventure.  You can move through the menu using the cursor keys and SPACE.</em></p>\n<p><em>The default game keys, if you have not redefined them before, are : </em></p>\n<p><em>DIRECTION: Cursor arrows; FIRING: Z; BOMBING: X</em></p>\n<p><em>Ship selection (SHIP): Select the ship best suited to your play style.</em></p>\n<p><em>Stage selection (STAGE): In case you have managed to pass a stage, from here you will be able to select at which point you want to start.</em></p>\n\n<p><strong>Cinta virtual con BSO Incluida<br/></strong>¡El disco de Red Sunset incluye una cassette virtual con la increíble B.S.O. del juego, creada por McKlain!</p>\n<p>Teclea RUN”bso y pulsa ENTER. El Walkman reproducirá las canciones de todos los niveles que hayas desbloqueado hasta ese momento.</p>\n<p><strong>Estadísticas de juego<br/></strong>¡Conoce el historial de las estadísticas del juego siempre que quieras!</p>\n<p>Red Sunset guarda tus estadísticas de juego después de cada partida.  Conoce tus puntuaciones, records, veces que has jugado y más, ejecutando el visualizador de estadísticas que se incluye en el disco con RUN”stats</p>\n<p><em><strong>Virtual Tape with BSO Included<br/></strong>The Red Sunset disc includes a virtual cassette with the incredible B.S.O. of the game, created by McKlain!</em></p>\n<p><em>Type RUN \"bso and press ENTER. The Walkman will play the songs from all the levels you have unlocked up to that point.</em></p>\n<p><em><strong>Game statistics<br/></strong>See your game statistics history whenever you want!</em></p>\n<p><em>Red Sunset saves your game statistics after each game.  Know your scores, records, times you've played and more, by running the included stats viewer on the disc with RUN \"stats.</em></p>\n<p>Descarga el manual de instrucciones para más información</p>\n<p><em>Download the user manual for more information</em></p>", "metacritic": null, "released": "2022-07-22", "tba": false, "updated": "2022-07-25T13:58:13", "background_image": "https://media.rawg.io/media/screenshots/d15/d15025f1587ddc8d9eea49722034a0cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Amstrad ESP"], "genres": ["Action"], "publishers": [], "esrb_rating": null}