{"id": 826798, "slug": "ww2-rebuilder-germany-prologue", "name": "WW2 Rebuilder: Germany Prologue", "name_original": "WW2 Rebuilder: Germany Prologue", "description": "The <strong>WW2 Rebuilder Germany Prologue</strong> will take you to the destroyed <strong>Hamburg</strong>. It's a <strong>FREE map</strong> where our task will be to clean and rebuild the area around the St. Nicholas church. Visit destroyed city after global allies offensive and enter a story of woman looking for her lost husband who fought in Hamburg defending uboat factories.<br/><br/>In Full Game as a hero you leave your family house after WWII. In English Campaign you will travel to London and Gimbert train station to <strong>renovate</strong> it and start becoming <strong>builder</strong> of the new world. Through the journey you will <strong>collect</strong> resources and <strong>craft</strong> materials to flip houses, repair industrial buildings, roads and squares so the tenants could live in their homes happily again. Afterward become a house <strong>builder</strong> for people who are awaiting for the roof over their heads. This builder simulator game also allow you to become a mechanic and operator of various machines like crane, bulldozer, jeep cars which will help you demolish and clean ruined houses, streets and factories. <br/><br/>A truce does not mean an immediate return to normal life. The Second World War left its mark on the cities of Europe, and the new kind heroes had to lift them from the ruins - the ordinary citizens joined their efforts to rebuild demolished houses, streets and factories, ensuring a better future for their nations.<br/><br/><br/><strong> CHECK OUT OUR OTHER GAMES </strong><br/>https://store.steampowered.com/app/1570220/Mythos_Slavic_Builder/<br/>https://store.steampowered.com/app/1732910/Photography_Simulator/", "metacritic": null, "released": "2022-07-26", "tba": false, "updated": "2023-01-30T11:15:54", "background_image": "https://media.rawg.io/media/screenshots/363/363286a30ccf415314dbe357c403ae6e.jpg", "website": "https://www.madnetic-games.com/ww2-rebuilder.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "beaten": 2}, "playtime": 0, "achievements_count": 16, "ratings_count": 2, "suggestions_count": 471, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Madnetic Games"], "genres": ["Adventure", "Simulation"], "publishers": ["Madnetic Games"], "esrb_rating": null}