{"id": 826724, "slug": "clash-quest-publick-beta-test", "name": "Clash Quest (Publick Beta Test)", "name_original": "Clash Quest (Publick Beta Test)", "description": "<p>Enter Clash Quest, an adventure and puzzle game made by the creators of Clash of Clans and Clash Royale!</p>\n<p>Battle bosses in unique puzzles as you progress across a chain of undiscovered islands with our shipwrecked heroes. Collect, group, and match your troops on the battlefield to smash defenses and defeat newly discovered bosses from the Clash universe. Unleash iconic spells like the Log and Fireball! Collect rare magical runes to unlock super-sized abilities. Upgrade your team with epic gear to take on bigger challenges!</p>\n<p>Strategy is key in beating bosses big and small. Can you defeat the likes of bosses like Papa Dragon along the way? Join forces with other captains and progress together as you crush your enemies. Win with your clan and earn more rewards!</p>\n<p>In Clash Quest, you&#39;re the captain! Choose your targets, make strategic decisions, and match troop combinations to demolish the enemy. Avoid fire from Cannons, X-Bow, and Inferno Towers. Light it up with Wizards, charge with Baby Dragons, and blitz with Barbarians.</p>\n<p>Can you captain your crew to gold and adventure?</p>\n<p>Features:</p>\n<p>Strategy and Puzzle Solving</p>\n<p>• Unleash powerful attacks when you match more troops, but be careful you don’t run out!</p>\n<p>• Turn based gameplay lets you strategize and plan ahead to outsmart your enemy</p>\n<p>• Use spells like Fireball, Swap, Charge, and Log to tilt the odds of victory in your favor</p>\n<p>Equip and Upgrade</p>\n<p>• Discover magical runes to boost your troops attacks</p>\n<p>• Equip powerful items you find along your journey</p>\n<p>• Collect and upgrade your favorite troops and spells</p>\n<p>Team Up for Battle</p>\n<p>• Join a clan, draw your strengths together in every fight</p>\n<p>• Plan ahead and chat with other crew mates to take on bosses</p>\n<p>• Coordinate, earn loot and progress through the islands together</p>\n<p>Battle for Glory</p>\n<p>• Compete in the Leagues to and to earn more loot!</p>\n<p>• Clash your way to the very top of a worldwide leaderboard</p>\n<p>• Show off your skills and see if you have what it takes</p>\n<p>Familiar Faces, New Clash Tactics</p>\n<p>• Deploy troops, tactics, and spells to attack!</p>\n<p>• Encounter classic Clash defenses such as Mortar, Inferno Tower, and X-Bow</p>\n<p>• Battle newly discovered bosses like the Goblin King, Papa Dragon, Lava Golem, and more!</p>\n<p>Privacy Policy:</p>\n<p>http://supercell.com/en/privacy-policy/</p>\n<p>Terms of Service:</p>\n<p>http://supercell.com/en/terms-of-service/</p>\n<p>Parent’s Guide:</p>\n<p>http://supercell.com/en/parents/</p>", "metacritic": null, "released": "2021-04-06", "tba": false, "updated": "2022-07-27T16:31:01", "background_image": "https://media.rawg.io/media/screenshots/553/553770be16b5900e4b75b2c27afa482a.jpg", "website": "https://clash.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 118, "game_series_count": 5, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Supercell"], "genres": ["Adventure", "Puzzle"], "publishers": ["Supercell Oy"], "esrb_rating": "Everyone 10+"}