{"id": 826887, "slug": "flashout-3-demo", "name": "Flashout 3 Demo", "name_original": "Flashout 3 Demo", "description": "Full version of Flashout 3 is coming soon! You can wishlist it here\n<br/><br/>\n\nFLASHOUT IS BACK!\n\n<br/>\n<br/>\n<br/>\nWhere high speed meets high stakes. Where unforgiving combat, loud electronic music and addictive boosts of adrenaline mix up to separate winners from losers. Where gravitation is nothing more than an empty word. This is where the world of FLASHOUT 3 will take you and your ride to the absolute limits!\n<br/>\n<br/>\n<br/>\n<br/>\nFLASHOUT 3 offers you ultra-fast ships, loops, jumps and sudden razor-sharp turns! Test your skills on the most impressive sci-fi racing tracks and try not to fall behind! But if it happens, don't sweat! Unleash the power of rockets, guns, bombs and mines to help you level down your competition!\n<br/>\n<br/>\nTake part in an exciting, head-to-head fight to the finish! Witness spectacular crashes, the agony of defeat, and the sweet taste of victory! But don't blink! It can all end in a flash!\n<br/>\n<br/>\n\n  Features:\n\n<br/>\n<ul><li>High-speed, unforgettable racing experience.\n<br/>\n</li><li>A powerful arsenal of weapons, boosts and upgrades at your disposal.\n<br/>\n</li><li>A large collection of destroyable race ships to choose from.\n<br/>\n</li><li>A variety of different race tracks and layouts.\n<br/>\n</li><li>Various game modes, including Career, Versus and more!\n<br/>\n</li><li>Stunning 3D Graphics.\n<br/>\n</li><li>High-beat electronic music.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-29T06:50:01", "background_image": "https://media.rawg.io/media/screenshots/901/901cc48a6a522c45c99afdeb1d24d0e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 19}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Jujubee"], "genres": [], "publishers": ["Jujubee"], "esrb_rating": null}