{"id": 826898, "slug": "ved-demo", "name": "VED Demo", "name_original": "VED Demo", "description": "Full version of VED is coming soon! You can wishlist it here\n<br/><br/>\n<br/>\n<br/>\nVED is a story-driven RPG with a unique turn-based combat system and roguelite elements. Embark on a magical adventure set in a vivid world in stunning, hand-painted graphics. Explore mysterious islands, defeat monsters, master the magic of the Veds!\n<br/>\n<br/>\n\n  StoryKir comes to the city of Micropole in search of a new life, where he suddenly discovers the ability to teleport between two worlds. Another reality is completely different from the usual world: mysterious flying islands, strange creatures, dangerous monsters. And there is definitely something linking these two worlds.\n<br/>\n<br/>\n<br/>\nDiscover the truth and decide the fate of two worlds. Your power is magic of the Veds! Learn the ancient sorcery of the Veds to gain superiority over the enemy, and win! Explore mysterious islands where you will find blessings or curses that will stay with you until the end of the game.\n<br/>\n<br/>\n\n  Key features:<ul><li>A non-linear story where every decision can lead to irreversible consequences and endings.\n<br/>\n</li><li>Several game factions that have different views on the events taking place. A dynamic system of relationships will allow you to influence the decisions of the key characters.\n<br/>\n</li><li>Innovative turn-based battle system. Use the advantage depending on your position.\n<br/>\n</li><li>Build a shelter for yourself and your allies to unlock new skills and abilities.\n<br/>\n</li><li>A system of unique interactive events that impose curses or blessings on the hero, which last until the end of the game.\n<br/>\n</li><li>The game features a fully orchestrated original soundtrack that will accompany you on your adventure.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-29T07:05:40", "background_image": "https://media.rawg.io/media/screenshots/3a0/3a098f571df99cc798d2d158036bfb1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 566, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Karaclan"], "genres": [], "publishers": ["Fulqrum Publishing"], "esrb_rating": null}