{"id": 826886, "slug": "the-house-of-da-vinci-3", "name": "The House of Da Vinci 3", "name_original": "The House of Da Vinci 3", "description": "The grand finale to The House of Da Vinci trilogy is here! Solve numerous new puzzles and mind benders and explore new mystifying locations of ravishing beauty. Use your wits and observational skills to escape rooms and solve the mysterious story behind one of the world’s most prolific inventors in history.<br/><br/>With sharp wits and an open mind, you will prevail.<h3>THE STORY</h3><br/>The time has finally come: become Giacomo one last time and join Leonardo da Vinci, the master of both art and science, as his friend and apprentice. Explore more of the Renaissance world full of puzzles, discover secret messages, and reveal mechanical wonders. Unravel conspiracies involving the most powerful people in Italy – and travel not only through space but time as well. Meet friends and rivals both old and new. Become the focus of a plan that might change history forever.<h3>KEY FEATURES</h3><br/><strong>NEW ADVENTURE, NEW PUZZLES</strong><br/>Enjoy original new puzzles, and examine concealed objects and mechanisms to find out what makes them tick.<br/><br/><strong>USE THE PAST TO YOUR ADVANTAGE</strong><br/>Use the mysterious Oculus Perpetua to change the past, influencing your surroundings in the present and allowing you to solve the otherwise unsolvable.<br/><br/><strong>NEW AND IMPROVED INTERACTIONS</strong><br/>Find new ways to interact with the beautiful, handcrafted world around you. Control Giacomo's actions even more intuitively than ever before.<br/><br/><strong>VARIED LOCATIONS</strong><br/>Explore breathtaking new locations in Italy and beyond. Search them for clues and travel both in time and space.<br/><br/><strong>EPIC FINALE</strong><br/>Listen to fully voiced historical figures, watch epic cut scenes, and discover how the story of Giacomo concludes its final stage.", "metacritic": null, "released": "2022-07-28", "tba": false, "updated": "2023-08-24T08:50:28", "background_image": "https://media.rawg.io/media/screenshots/5f4/5f4cf56f2dd6b66d67595bab0d35135a.jpg", "website": "https://bluebraingames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "beaten": 4, "toplay": 4, "playing": 1}, "playtime": 9, "achievements_count": 30, "ratings_count": 4, "suggestions_count": 559, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC", "iOS", "macOS"], "developers": ["Blue Brain Games"], "genres": ["Adventure", "Indie", "Puzzle"], "publishers": ["Blue Brain Games"], "esrb_rating": "Everyone 10+"}