{"id": 826858, "slug": "sprocket-wings", "name": "Sprocket Wings", "name_original": "Sprocket Wings", "description": "<h3>Enter a kaleidoscope of color...</h3><br/>...where you’ll collide with your opponents in a mad dash to the finish line. Fueled by dopamine — the scarcest resource in the state of Catatonia — you’ll face topsy-turvy turbulence and titillating twists at every turn, but let’s keep one thing straight: This race is anything but mindless.<br/><br/>Don’t be fooled by all the glitz. All that glitters is... not going to save you. Not when you’re deep in the eye of the brain storm with a dopameter that’s dwindling fast. Will you emerge on the other side? <br/><br/><h3>The Gist</h3><strong>Brains… and Beauty, Too</strong><br/><ul><li>Customize your aesthetic with a fully functional, detailed character creator.</li></ul><br/><strong>4 Modes of Mind Games</strong><br/><ul><li>Grand Prix: This one’s a no-brainer. It’s a basic tournament with 4 races. <br/></li><li>Free Tour: Explore each course with an open mind… and zero stakes. <br/></li><li>Time Trials: Fly solo! Your only opponents? Your own racing thoughts! <br/></li><li>Battle Mode: Go head to head with your opponents in a battle that’s all brawn. </li></ul><br/><strong>No One-Track Minds Here</strong><br/><ul><li>16 dazzling race tunnels </li></ul><br/><strong>Sharpen Your Wit</strong><br/><ul><li>8 unique weapons and abilities</li></ul><h3>A Note From the Mastermind Himself</h3><br/>Psssst. You over there! It isn’t too late to turn back. To just flutter away unscathed, like a dainty butterfly narrowly evading a cobweb. More like a... <strong>macabre</strong> web! Get it? <br/><br/>But we’re already past that, aren’t we? <br/><br/>You — a lowly gnomeling — are just too curious for your own good. <br/><br/>YOU want to know how it feels to race... through MY mind. To blast off... your rocker. To fly like a fairy... with no strings attached. You really think you can comb through MY catacombs and come out on top, don’t you? How cute. Or are you one of those kamikazes? Let’s just say you’ll be a coma-kaze after I’m done with you!<br/><br/>Because we only sell one-way tickets to the state of Catatonia. No, in the Nation of Imagi, there are no flyover states. You will stop. You will stay a while. Maybe even forever. But don’t you worry your pretty little head! It won’t be intac— errr, it’s going to have so much fun, it’ll be insane! Hysterical, really. <br/><br/>Feeling disoriented yet? Just wait ‘til you’re whizzing through the Nooks of Crania. Soaring through the Serotunnel. Racing your own intrusive thoughts. Zooming over highways, byways, and freeways. But wait a sec. Are you really on a freeway if you’re captiv… ated? Ha, ha, ha! <br/><br/>Anyway, if you’re brazen enough to make it this far, you’re a lost cause. Go on, dauntlessly don those wings. The first set’s on me! Customize your look if you want, but what’s the point? There’s no room for vanity in insanity! And everyone knows all gnomelings look alike when they’re turned inside out. Figuratively, of course. Well, maybe... dis-figuratively. Because when you don’t mind your own business, I might get busy bending your mind. And it may not ever bend back. <br/><br/>Soon, you’ll know exactly... what... I... mean.<br/> <br/>Enjoy the curs— errr, course!<br/><br/>Forever yours, <br/>Malchrim Ick", "metacritic": null, "released": "2022-07-28", "tba": false, "updated": "2022-07-29T06:06:22", "background_image": "https://media.rawg.io/media/screenshots/eca/eca0684d985ec2284c28749a584b9e49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Octopus Cuddles"], "genres": ["Racing"], "publishers": ["Octopus Cuddles"], "esrb_rating": null}