{"id": 826841, "slug": "the-starfighter", "name": "The Starfighter", "name_original": "The Starfighter", "description": "The Starfighter is a spaceship combat flight simulator. You are Paladin, a starfighter pilot who pilots the Griffin Starfighter. You are from the planet called The Hive. The evil King Nimrod and his forces from an exoplanet somewhere in the universe are conquering the universe. The leader of The Hive, Queen Crusher, opposes King Nimrod. You and your Radar-Intercept Officer named Wizard now have to fly in the Griffin Starfighter and vanquish King Nimrod and his forces wherever they may be. The Griffin Starfighter is equipped with High Energy Lasers and Missiles. It also has Regenerating Shields and Turbo Speed. There are 6 missions for you to fly. At the end of each mission, you are required to fly through a Portal. You will be teleported to another location in the universe when you enter one of these Portals. You can change camera views in this game. You can look backwards and have a Zoom-In camera view. You are given a score point for each enemy target that you destroy. You will have to fly defensively to avoid enemy laser fire and missile attacks. You also have to destroy King Nimrod's runways, hangars, satellite dishes, water reservoirs, spacecraft, walls, armored buggies, unmanned combat aerial systems, taxibots, aviation containers and buildings. If you are able to vanquish King Nimrod and his forces, you will be rewarded by Queen Crusher. King Nimrod's forces and assets are found on Earth, on The Hive and at different planets in the Solar System. King Nimrod and his forces are mechanical beings while you (Paladin), Wizard and Queen Crusher are insectlike lifeforms.", "metacritic": null, "released": "2022-07-27", "tba": false, "updated": "2022-07-29T05:41:56", "background_image": "https://media.rawg.io/media/screenshots/d64/d648a313c0d17c74aad7ea1959a4a85f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rusmin Sofiz Mohd Yusof"], "genres": ["Simulation"], "publishers": ["Rusmin Sofiz Mohd Yusof"], "esrb_rating": null}