{"id": 826856, "slug": "autonauts-vs-piratebots", "name": "Autonauts vs Piratebots", "name_original": "Autonauts vs Piratebots", "description": "Grave news! Piratebots are kidnapping Autonauts and taking over our automated settlements! Only you can remove the invaders, recover your resources and resume control!  <br/><br/>You are Captain of the Autonauts Defence Force. You receive a distress signal from a nearby planet: a Piratebot invasion! You arrive to find that Piratebots have obliterated the base camp and taken control of the working outposts and industries. <br/><br/>To win, you must destroy the Space Pirate Boss - “The Dread Pirate Robot” - whose heavily-defended stronghold lies on the other side of the world. Standing between you and the ultimate showdown are hundreds of scurvy Piratebots commanded by The Dread Pirate Robot’s trusted Boss Mates. <br/><br/>Rescue the innocent. Rebuild the settlement. Reclaim the world. <br/><br/><strong>FEATURES:</strong><h3>Autonauts... Automate!</h3><br/>Automate a farming business to earn gold and fund your defence campaign. Use industrious Workerbots, your ingenuity and all the natural resources you can harness to craft the tools and machinery needed to run a bustling settlement while commanding a successful defence campaign to conquer the invading Piratebots. <br/><br/><h3>Code, Command &amp; Conquer!</h3>Build squads of special Defencebots including Warriors, Archers and Knights, then use tactical combat programming to take on swathes of swarthy Piratebots and their Bosses. <br/><br/>Prepare to repel boarders! <br/><br/>Create and command your Defencebot squads to engage in intense Boss battles with the crazy Long Bot Silver, the diabolical Botbeard and the brutal Botbarossa, culminating in a fullscale assault on the Dread Pirate Robot's formidable fortress <br/><br/><h3>Pillaging Piratebot</h3><br/>Merciless Piratebots raiders regularly storm your growing base to vandalise and pillage. Set up vigilant guard patrols, erect mighty defensive walls and deploy armed towers to stop marauding Piratebots in their tracks. <br/><br/><br/><br/>Collect new technology from the black-hearted Piratebots to drive them from the land and free your fellow Autonauts! <br/><br/>You may have played Autonauts before, but never like this. It’s a whole new game of automation and strategy for novices and veterans alike!<br/><br/>Automate to defend! Defend to automate!", "metacritic": null, "released": "2022-07-28", "tba": false, "updated": "2022-07-29T06:04:04", "background_image": "https://media.rawg.io/media/screenshots/e8d/e8d58ee0feea7d7ed38c963065edc87e.jpg", "website": "https://curvegames.com/news/autonauts-vs-piratebots-announcement/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 12, "owned": 111, "toplay": 2}, "playtime": 5, "achievements_count": 29, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Denki"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Curve Games"], "esrb_rating": null}