{"id": 826877, "slug": "sweet-transit", "name": "Sweet Transit", "name_original": "Sweet Transit", "description": "Sweet Transit is a unique city builder where the railway is king and trains are the sole means of expansion and transportation. Create intricate production lines and grow humble villages into thriving metropolises while moving through prime eras such as the introduction of steam power and the invention of the combustion engine. Become a pioneer of industry and work to keep your citizens happy through the interconnected world of the railway.<br/><br/><h3>Expansive Train-Led City Builder</h3>From a single warehouse, build a thriving interconnected world of villages and cities as you expand your rail network and evolve your society.<h3>Vastly Customisable Railway Networking</h3>Connect your settlements to ensure a painless transit for workers and civilians using platforms, stations and intricate routes to expand and link together your network.<h3>Evolve Your Industry - From Steam to Diesel</h3>Plan your settlements to fit both the landscape and needs of your citizens. Create basic and advanced production lines to ensure the most economical movement of resources. Take advantage of the mighty railway to automate production and meet ever-growing needs of your settlements.<h3>Be a Person of the People</h3>Your citizens have needs and get tired as they work. It's important that you maintain their happiness and requirements by ensuring they have accommodation, water, food and more as you scale up your cities. Unhappy or tired workers are less productive and will be detrimental to your production lines.<h3>Day One Mod Support</h3>Sweet Transit features full mod support from day one, allowing you to create custom content for the game as you please. Steam Workshop support is fully integrated with the title allowing for ease of access to the modding community.<br/><br/>", "metacritic": null, "released": "2022-07-28", "tba": false, "updated": "2024-04-23T18:17:08", "background_image": "https://media.rawg.io/media/screenshots/96b/96b1a0493c8acff875af544db11b0f4b.jpg", "website": "https://www.sweettransitgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 43, "toplay": 4, "dropped": 2}, "playtime": 2, "achievements_count": 33, "ratings_count": 4, "suggestions_count": 568, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Ernestas Norvaišas"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["Team17 Digital"], "esrb_rating": null}