{"id": 826897, "slug": "loretta-demo", "name": "Loretta Demo", "name_original": "Loretta Demo", "description": "Loretta is a psychological thriller that would make the player an accessory to the heroine’s crimes and would lead her through a self-crafted nightmare. This story is about a woman, dealing with betrayal, her husband’s infidelity, relationship problems and the difficult social situation of the 1940s.\n<br/>\n<br/>\nConceptually and aesthetically, the game is inspired by the American art of the twentieth century, the works of Andrew Wyeth and Edward Hopper, film noir of the 40s-50s, thrillers by Alfred Hitchcock, the Philip Ridley movie \"The Reflecting Skin\", the books \"1922\" by Stephen King and \"Lolita\" by Vladimir Nabokov.\n<br/>\n<br/>\n<br/>\n<br/>\nStory\n<br/>\n<br/>\nThe year is 1947. Lora and Walter Harris move to a farm, which used to belong to his parents. Walter is a writer and Lora is a housewife. Both are quite unsuccessful.\n<br/>\n<br/>\nThe family is going through financial difficulties. The situation is also complicated by the fact that Walter owes money to people from New York. And although the husband keeps it a secret from his wife, Lora has a suspicion. Moreover, she suspects him of cheating.\n<br/>\n<br/>\nLora understands that she gave up her job, her dreams and other opportunities for her failure of a husband she doesn’t even love. Now she is stuck in a cold empty house barely making ends meet.\n<br/>\n<br/>\nAs she struggles to make loan payments, she finds out that Walter’s publishing house has insured his life. In the event of his death, the insurance sum would be 30.000$. A plan is born in Lora’s mind.\n<br/>\n<br/>\nLoretta is a story-driven adventure game in which gameplay focuses on choosing phrases in dialogue, interacting with objects, and making decisions: planning the murder and getting rid of the evidence. Killing a husband, trying to cover a crime, Loretta makes a player an accomplice. \n<br/>\n<br/>\n<br/>\n<br/>\nFeatures:\n<br/>\n<br/>\n- The plot can either turn into a web of dodgy lies, or into a crescendo of bloody murders.\n<br/>\n<br/>\n- Player is free to decide the fate of the character.\n<br/>\n<br/>\n- Freedom of choice​.\n<br/>\n<br/>\n- Many endings.", "metacritic": null, "released": null, "tba": false, "updated": "2022-07-29T07:04:16", "background_image": "https://media.rawg.io/media/screenshots/bb2/bb2887dd2046ccbabd421844020b213a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 280, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yakov Butuzoff"], "genres": [], "publishers": ["DANGEN Entertainment"], "esrb_rating": null}