{"id": 826846, "slug": "koumajou-remilia-scarlet-symphony", "name": "Koumajou Remilia: Scarlet Symphony", "name_original": "Koumajou Remilia: Scarlet Symphony", "description": "Koumajou Remilia: Scarlet Symphony has been loved by many gamers since its initial release, highly praised for its quality gameplay and soundtrack as well as Banpai Akira's sharp and gothic reinterpretation of Touhou characters.<br/><br/>This title is the enhanced version of the original game that supports HD remastered graphics and a variety of bonus features. In hopes that more gamers would enjoy Reimu's adventure, the game now supports 6 languages including English. Fans of the original game and the Touhou Project can't also miss the full Japanese voice acting, which is the exclusive feature for the enhanced version.<h3>＜ List of Japanese Voice Actors ＞</h3>• REIMU HAKUREI ( Voiced by: Rina Sato )<br/><br/>• MARISA KIRISAME ( Voiced by: Ryoko Shintani )<br/>• REMILIA SCARLET ( Voiced by: Eri Kitamura )<br/>• SAKUYA IZAYOI ( Voiced by: Miyuki Sawashiro )<br/>• CIRNO ( Voiced by: Aoi Yuki )<br/>• HONG MEILING ( Voiced by: Satomi Sato )<br/>• PATCHOULI KNOWLEDGE ( Voiced by: Noriko Rikimaru )<br/>• ALICE MARGATROID ( Voiced by: Haruka Tomatsu )<br/>• SUIKA IBUKI ( Voiced by: Miho Okasaki )<h3>Story</h3>Gensokyo faces sudden disturbance as 「Scarlet Mist」 spreads once again.<br/>To Reimu Hakurei, this peculiar phenomenon resembled something familiar. <br/><br/>'Is this that vampire's doing?', she thought to herself.<br/><br/>There was only one choice: head to the Scarlet Devil Mansion,<br/>and find out the true cause of the disturbance.<br/><br/>......but this time, the way to the mansion was a little different from usual.<h3>Features</h3><strong>Colorful dialogues between Touhou characters</strong><br/>The player becomes Reimu Hakurei and sets out to find the true cause of the Scarlet Mist. On the way to the Scarlet Devil Mansion, they will interact with various Touhou characters in a number of intense danmaku(bullet hell) battles.<br/><br/><br/><br/><br/><strong>Reimu's Weapons</strong><br/>The player will fight their way to the cause of the disturbance using the right weapons in the right situations. Reimu has \"Purification Wand\" for close combat, and \"Ofuda\" for attacking flying enemies. She herself can fly, too.<br/><br/><br/><br/><br/><br/><br/><strong>Marisa and Cirno join the party!</strong><br/>Marisa Kirisame and Cirno join Reimu in her adventure, supporting her with their own partner attacks. The player can summon them at the cost of Souls. To lead the battle to victory, they need to decide carefully when to call for the partner's help.<br/><br/><br/><br/><br/><br/><br/><strong>Survive the Touhou-style bullet hell!</strong><br/>Playing as Reimu Hakurei, the player will encounter and fight Touhou characters such as Hong Meiling, Sakuya Izayoi, and Alice Margatroid. The residents of the Scarlet Devil Mansion will corner the player with fierce patterns.<br/><br/>And behind all of them stands the vampire Reimu is looking for……!<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><strong>Here comes Suika Ibuki as the new partner!</strong><br/>Suika Ibuki, the \"oni\" that loves party and drinking, waits for Reimu in the Scarlet Devil Castle. In this version, she joins Reimu as her third partner! Use her unique partner skill to attack enemies at the cost of Souls.<br/><br/><strong>Extra easy mode</strong><br/>\"Extra easy mode\" is available for gamers who are not familiar with the action and shooting games. This mode can be selected at the options.<br/><br/>Compared to the original version, Koumajou Remilia: Scarlet Symphony is full of bonus elements including in-game challenges, BGM collections, and galleries that will satisfy beginners and challenge lovers alike. <br/><br/><br/><strong>※ Screenshots may not represent full product. </strong>", "metacritic": null, "released": "2022-07-27", "tba": false, "updated": "2024-03-15T15:49:35", "background_image": "https://media.rawg.io/media/screenshots/5e7/5e7cb3df9fa5361c52d13a96c43cdcee.jpg", "website": "https://www.cfk.kr/koumajou/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 15, "beaten": 1, "toplay": 4, "dropped": 2}, "playtime": 2, "achievements_count": 40, "ratings_count": 3, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["CFK CO", "Frontier Aja"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["CFK Co"], "esrb_rating": null}