{"id": 826801, "slug": "vulgaria", "name": "Vulgaria", "name_original": "Vulgaria", "description": "RPG, third person/top down, rouge ‘like, action, puzzle platform, with randomly generated dungeons, treasure pick ups, and enemies, making a unique play through each play.\r\n\r\nControls: you can jump and run in any direction, but can only shoot up down left and right, with the heroes’ momentum the shot can slightly tilt in the current direction (leaning the shot). The Hero also has an action button when in front of specific targets can perform different task; open treasures, locked doors, push/pull objects, interact with puzzle\r\n\r\nGameplay: \r\nThe hero starts out with standard rpg stats (health, strength, shot speed, fire rate, and knockback) there are standard pick ups (heath, armour, bombs, keys, and coins) to collect when defeating enemies or completing rooms, as you play through the first level you come across a Treasure room, Shop room, or Mini boss. \r\nTreasure room: Every level has a Treasure room, in each Treasure room has a hero pick up that adds to you base stats \r\n\r\nShop Room: Every level but the last will have a Shop room. Shop Rooms contains hero pick up items for sale, in Shop only items like, maps, compass, and one-time use hero items, as well some standard pick ups at a cheap price. \r\n\r\nMini Boss Room: The Mini Boss room will contain boosted normal enemies with a different colour pallet, and small asset changes added. Drops for Mini bosses will be greater than standard enemies, with a small chance to drop a Treasure room item. Treasure, and Shop rooms require keys to enter Mini Boss rooms do not. \r\nBoss Room: Towards the end of the First level you will find the Boss room. Boss rooms have the entrance to the next level as well as the enemy boss. There are 3 different type of bosses for the first level, Warlock, Giant Blob, and Queen worm. Only 1 of the 3 will spawn, moving the other 2 for the next levels two and three. Once the Boss is defeated the entrance opens, and a Treasure room item spawns.\r\n\r\nEach level is basically the same structure, but with a different visual (cave, sewer, palace, hell) different puzzle themes (block, lemmings/pipes, teleport, wired colours) harder enemies.\r\n\r\nIn short ever time you play you have the probability of a different game, with player choices determining some of the treasure pick ups, outcome of what bosses you fight, and levels you travel to. This creates exponential replay value as playing once will only show a small portion of the whole game.", "metacritic": null, "released": "2022-07-26", "tba": false, "updated": "2022-07-29T04:47:19", "background_image": "https://media.rawg.io/media/screenshots/4fa/4fa1cf0ee091739962baf86eed0418c0.jpg", "website": "https://richardjestadt5.wixsite.com/vulgaria", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 512, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Statson"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Statson"], "esrb_rating": null}