{"id": 826812, "slug": "taisho-x-alice-heads-tails", "name": "TAISHO x ALICE: HEADS & TAILS", "name_original": "TAISHO x ALICE: HEADS & TAILS", "description": "<p>There are two sides to every fairytale...<br />\nLike a coin, TAISHO x ALICE has two sides: the real world and the Looking-Glass World.<br />\nHEADS: Enjoy the happily ever afterstories with Cinderella and the gang in the topsy-turvy Looking-Glass World!<br />\nTAILS: Join Woolfe and Ryoushi to explore the greater mystery of the events that took place in the real world!<br />\nWithout darkness, there can be no light... It&#39;s time to take a peek behind the curtain in TAISHO x ALICE: HEADS &amp; TAILS!<br />\nThis is a visual novel. As you progress through the story, you will be asked to make choices at key points that will lead you to different endings.<br />\nThe heroine&#39;s first name (Yurika) can be changed.<br />\nSome choices will have lasting repercussions, so choose wisely to reach a happy ending!<br />\n<em>During the game, the protagonist&#39;s face will be displayed to the left of the text box. (You can disable this in the OPTIONS menu.)<br />\n</em>&quot;TAISHO x ALICE: HEADS &amp; TAILS&quot; can be played as a standalone game.<br />\n*It is recommended to play &quot;TAISHO x ALICE episode 1,2,3 and epilogue&quot; before playing this game.<br />\n[Content Warning]<br />\nPlease be advised that this game deals with mature themes including mental illness, violence, depictions of blood, and mild sexual language.<br />\nHEADS &amp; TAILS contains routes for fan favorite side characters Woolfe and Ryoushi, as well as sugary-sweet afterstories with each of the 7 original love interests. But wait, there&#39;s more! In Arisu Academy, you&#39;ll experience a TAISHO x ALICE school AU story with the entire cast! 10 stories total for fans to enjoy, playable in any order.<br />\nIt all started when he enrolled at a college in the town where his grandma lived. His motive: to search for an old friend who cut contact after a fight. But even after he found him, it still wasn&#39;t really HIM... This is the story of Woolfe&#39;s life in the friendzone, doing his best for his bestie!<br />\nHailing from a long line of doctors, Ryoushi Arisu lost his place in the family the moment his younger sister was born. Years later, at a med school far, far away, as he contemplates his career path... he meets the strange little boy who will change his life forever.<br />\nSeven tales that take place after the happy endings in each of the seven Looking-Glass Worlds. Now that Yurika and her beloved are finally together, what mischief will they get into next? Let&#39;s take a peek!<br />\n[LOVE INTERESTS]<br />\nCinderella<br />\nRed Riding Hood<br />\nKaguya<br />\nGretel<br />\nSnow White<br />\nWizard<br />\nAlice<br />\nMy name is Yurika Arisu, and I&#39;ve just transferred to the esteemed Mirrorfield Academy in the middle of the school year. Here, I&#39;ll meet:<br />\n-My homeroom teacher, Mr. Cinderella, the down-to-earth art instructor!<br />\n-Mr. Riding Hood, the dutiful yet shy biology teacher!<br />\n-Mr. Kaguya, the classical literature teacher with a charming, cheeky grin!<br />\n-Gretel, a first-year with a love of sweets!<br />\n-Snow White, the quiet and mysterious bookworm!<br />\n-Wizard, the dependable student council president!<br />\n-And lastly... the boy of my dreams, Alice!<br />\nThey&#39;re all handsome and special in their own ways. So who should I spend my school days chasing? It&#39;s gonna be so much fun... I can&#39;t wait!</p>", "metacritic": null, "released": "2017-04-21", "tba": false, "updated": "2022-08-06T03:05:44", "background_image": "https://media.rawg.io/media/screenshots/d7f/d7fdbe096c824eced43c3a9d41c6a94a.jpg", "website": "http://www.primula.jpn.com/taishoalice/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 1}, "playtime": 17, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 509, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC", "PS Vita", "Nintendo Switch"], "developers": ["Primula"], "genres": ["Adventure"], "publishers": ["pencil"], "esrb_rating": "Teen"}