{"id": 82695, "slug": "baby-boomz", "name": "Baby Boomz", "name_original": "Baby Boomz", "description": "Switch and match those super-cute baby items - work your way through over a hundred fun levels in this addictive puzzle game. Match 3, 4 or 5 in a row for a special bomb - or try a 2x2 match for a sweet little Fairy helper!<br/><br/>Full of exciting special items and obstacles, it's an easy to play but challenging ride through the seven worlds. Combine bombs where possible for even more destruction! Super sweet!<br/><br/>Get the highest score you can and aim for 3 stars on every level!<br/><br/>Features:<br/><br/>- Over 100 varied and interesting levels - more sweet levels coming soon!<br/>- 7 gameplay types!<br/> - Beat the score<br/> - Beat the timer<br/> - Destroy the jelly blocks<br/> - Fill the level with jam<br/> - Destroy the building blocks<br/> - Collect the items<br/> - Drop the ball<br/>- Super cute graphics and amazing effects<br/>- Share your progress to Facebook, Twitter and Instagram!<br/> - Connect to Facebook to sync your progress across devices!<br/>- 7 different level themes<br/>- Daily rewards on the Wheel of Fortune - can you win the Jackpot??<br/>- \"How to Play\" instructions (for people who have never played a Match-3 game? No cookie, candy or sweets here, but it plays the same!)<br/>- Cool bombs and sweet special helpers<br/>- Soothing and relaxing in-game music<br/>- Look out for the stinky diapers though!<br/><br/>Baby Boomz is completely free to play, but some of the optional in-game helpers and items may require in-app purchases.", "metacritic": null, "released": "2016-07-11", "tba": false, "updated": "2019-07-30T09:21:33", "background_image": "https://media.rawg.io/media/screenshots/330/330d4e57a8986daee5708d31f2f6a85b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SyGem Software"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["SyGem"], "esrb_rating": null}