{"id": 827007, "slug": "warband", "name": "Warband", "name_original": "Warband", "description": "What is this?\r\n<p>Warband is a tool designed for running combat in GMless, narrative story-games games without dice or any random input. It would work well with a No Dice, No Masters game. \r\n</p>\n<p>This version of Warband is designed with a traditional western fantasy setting in mind.\r\n</p>\n<p>Warband assumes that two groups are competing. Each player has one Unit and each Unit has a set amount of cards to play. Any number of players can be on either side.<br/></p>\r\nHow to play\r\nThe Board\r\n<p>The left side of the board is the AGGRESSOR. <br/></p><p>The right side of the board is the DEFENDER. <br/></p><p>The top half of the board is the FAST lane. <br/></p><p>The bottom half of the board is the SLOW lane. <br/></p><p>Place your units in the CLOSE, NEAR or FAR zone and decide whether they will move FAST or SLOW. <br/></p><p>A unit in the CLOSE zone is considered to be within melee range.  An archer would typically hang back in NEAR range for a close-quarters battle, but may be in the FAR range alongside artillery and siege units in a grander battle. <br/></p><p>Units in the same distance zone can typically attack each other, but some abilities may allow a unit to strike at other zones. <br/></p>\r\nThe Cards\r\n<p>A Warband unit may have one card of each type. <br/></p><p>A Unit may have two HAND and RING cards, plus three BAG cards.</p><p> A Unit with a HAND card cannot have a TWO-HANDED card and vice versa. <br/></p><p>Each card has a POWER and an ARMOUR attribute. <br/></p><p>The Unit's total number of POWER and ARMOUR are the total amounts summed from the cards in their hand. <br/></p>\r\nPower\r\n<p>Tally the total number of POWER points gained from the cards in your hand. Stack Tokens to keep track of your POWER. A Token can be anything close to hand, but should be the same type of item. <br/></p><p>When your POWER reaches 0, your unit is incapacitated. <br/></p><p>When you attack an enemy you use your POWER. <br/></p><p>You may choose whether to strike at a Unit's POWER or ARMOUR. <br/></p><p>If you go for a direct hit against a Unit's POWER you must subtract the amount of ARMOUR they have from the amount of damage dealt. <br/></p><p>Make a direct attack on a Unit's ARMOUR to weaken it, though be aware that an ARMOUR STRIKE will not reduce a Unit's POWER. <br/></p>\r\nArmour\r\n<p>Tally the total number of ARMOUR points from all of the cards in your hand and stack that many Tokens. A Token may be anything close to hand but must be the same type of item. <br/></p><p>If an enemy Unit strikes directly at your POWER you can subtract your total ARMOUR from the amount of damage dealt. If the total number of damage is reduced to zero, you receive no damage. <br/></p>\r\nFury\r\n<p>Add a FURY token to your stack of tokens whenever you incapacitate an enemy Unit. <br/></p><p>Spend a FURY token to add one extra POWER to an attack. <br/></p><p>You may accumulate a maximum of three FURY tokens. <br/></p>\r\nTurn Structure\r\n1. Aggressor - FAST\r\n<p>The Aggressor moves all of their units in the FAST lane.\r\n</p>\n<p>Units can move in any order, regardless of whether they are CLOSE, NEAR or FAR. \r\n</p>\n<p>Units in the      lane have one action. They may either MOVE or play a card.\r\n</p>\r\n2. Defender - FAST\r\n<p>The Defender moves all of their units in the FAST lane.<br/></p>\n<p>Units can move in any order, regardless of whether they are CLOSE, NEAR or FAR.       </p>\n<p>Units in the      lane have one action. They may either MOVE or play a card.</p>\n<p>\n</p>\r\n3. Aggressor - SLOW\r\n<p>The Aggressor moves all of their units in the SLOW lane.<br/></p>\n<p>Units can move in any order, regardless of whether they are CLOSE, NEAR or FAR.       </p>\n<p>Units in the      lane have two actions. They may MOVE and/or play cards.  \r\n</p>\r\n4. Defender - SLOW\r\n<p>The Defender moves all of their units in the SLOW lane.\r\n</p>\n<p>Units can move in any order, regardless of whether they are CLOSE, NEAR or FAR.         </p>\n<p>Units in the      lane have two actions. They may MOVE and/or play cards.<br/></p>\r\nAttribution\r\n<p>Errant by Ava Islam is the original source of the FAST/SLOW mechanic, with units moving fast taking one action and units moving slowly taking two actions. You could probably use Warband well with the combat in Errant.</p>\n<p>The concept of an abstract CLOSE/NEAR/FAR was introduced to me through the Index Card RPG by Runehammer Games.<br/></p>\n<p>The combat system including how Power and Armour work originally appeared in The Banner Saga. I have replaced Willpower with Fury.</p>\r\nFeedback &amp; Development\r\n<p>Warband is in development and will need lots of playtesting, balancing and content creation. This is likely something I will complete over a long period of time, slowly chipping away rather than hacking it all down in one go. If you'd like to talk about Warband, you can join us on the Randomless Renaissance discord.<br/></p>", "metacritic": null, "released": "2022-07-28", "tba": false, "updated": "2022-07-29T07:47:31", "background_image": "https://media.rawg.io/media/screenshots/b5a/b5aac1f1ef336c9f613e12b14b96bc60.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gwyllgi"], "genres": [], "publishers": [], "esrb_rating": null}