{"id": 82716, "slug": "alluring-juicy-fruity-splash-blitz-game-free", "name": "Alluring Juicy Fruity Splash Blitz Game FREE", "name_original": "Alluring Juicy Fruity Splash Blitz Game FREE", "description": "Aahh.. the Hawaiian lei..... tropical sunset and a pristine beach. what more can you ask for?<br/>Enjoy, relax this summer with a easy to play matching puzzle game suitable for all. Pick your favourite sunny locale and enjoy! <br/><br/>啊哈..夏威夷花环.....热带日落和质朴的海滩。你还能要求什么呢？ <br/>享受，放松在今年夏天与可玩性很高匹配益智游戏适合所有。挑选您最喜爱阳光明媚的语言环境和享受！<br/><br/>Aahh .. los leus hawaianos ..... puesta de sol tropical y una playa prístina. ¿qué más se puede pedir? <br/>Disfrutar, relajarse este verano con un fácil de jugar juego de puzzle juego adecuado para todos. Elige tu locale soleado favorito y disfrutar!<br/><br/>Aahh .. les Hawaiian lei ..... coucher de soleil tropical et une plage immaculée. que pouvez-vous demander de plus? <br/>Profitez, vous détendre cet été avec un facile à jouer le jeu d'association de puzzle adapté à tous. Choisissez votre région ensoleillée préféré et profitez-en!<br/><br/>Aahh .. Гавайские леев ..... тропический закат и древний пляж. что еще можно желать? <br/>Наслаждайтесь, расслабиться этим летом с легко играть соответствия игра-головоломка, подходящий для всех. Выберите свой любимый солнечный языковой и наслаждайтесь!<br/><br/>Aahh..ハワイのレイ.....熱帯夕日や自然のままのビーチがあります。あなたがより多くのものを求めることができますか？ <br/>すべてに適切なマッチングパズルゲームをプレイするのは簡単で、この夏、リラックス、お楽しみください。お気に入りの晴れたロケールを選んで、お楽しみください！", "metacritic": null, "released": "2014-06-29", "tba": false, "updated": "2019-10-22T14:22:45", "background_image": "https://media.rawg.io/media/screenshots/800/800b29be7ba441d72691ed3c838fe026.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Plentouz Apps Development"], "genres": ["Family", "Puzzle"], "publishers": ["Plentouz Apps Development"], "esrb_rating": "Everyone 10+"}