{"id": 82726, "slug": "ultimate-dinosaur-simulator", "name": "Ultimate Dinosaur Simulator", "name_original": "Ultimate Dinosaur Simulator", "description": "Discover a long lost prehistoric world and rule over it as an all mighty Dinosaur! Travel back to a time when monstrous carnivores roamed the Earth and exotic plant life filled dangerous jungles! For the first time ever, choose from TEN PLAYABLE DINOSAURS! Hunt down food, raise a family of dinos, and battle for your life against fierce bosses like the Spinosaurus!<br/><br/>Download the Ultimate Dinosaur Simulator today while it's 50% OFF for a very limited time!<br/><br/>Brand New Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy while ruling over your dinosaur’s ancient territory!<br/><br/>TEN PLAYABLE DINOSAURS<br/>For the first time ever, you can choose from multiple animals in a single game! Become any of ten famous dinosaurs and mammals like the Tyrannosaurus Rex, Velociraptor, Sabertooth Tiger, or even choose a flying dinosaur like the Pterodactyl or a swimming dinosaur like Mosasaurus! Each species has their own families, experience, and levels!<br/><br/>DEADLY BOSS BATTLES<br/>Test your skills against SIX thrilling boss battles! A massive spined creature lurks in the murky water of the swamp! Engage in battle with the legendary Plesiosaur to claim dominance over it’s waters!<br/><br/>BUILD YOUR PACK<br/>Dominate other dinosaurs and recruit them to your pack! Customize and play as any Dinosaur in your pack and create a powerful family of predators!<br/><br/>HATCH DINO EGGS<br/>Breed baby dinos that will grow into powerful members of your pack! Care for you eggs while they are hatching and then play as your new baby dinosaur!<br/><br/>CUSTOMIZE YOUR DINOSAURS<br/>Choose your dino's name, appearance, skills, and attributes to complement your pack members and become a more powerful group!<br/><br/>LEVEL UP YOUR DINOSAURS<br/>Gain experience by defeating dangerous enemies, caring for your family, and completing missions! Level up your dinosaurs to increase their health and attack damage, earn points to upgrade your dinosaur’s stats, and increase the size of your pack!<br/><br/>EARN STAT POINTS<br/>Stat Points can be used to provide bonus’s to traits like Health, Critical Attack Chance, Run Speed, and much more! <br/><br/>UPGRADEABLE BUFFS<br/>Buff Points can be used to upgrade your Roar and Snarl Buffs, which create temporary Stat Boosting auras around your dinosaur when active! <br/><br/>RAGDOLL PHYSICS<br/>Your prey now realistically dangles from your claws as you carry them!<br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>Procedural weather system with unique storms, clouds, sunrise, sunset and the return of the cataclysmic Extinction Meteor Shower!<br/><br/>MASSIVE REALISTIC 3D ENVIRONMENT<br/>Rule over a world so big we created FIVE unique lairs for your dinosaurs to live in! Explore snow covered mountains, dense jungles, murky swamplands, beaches, and even hunt underwater!<br/><br/>PREHISTORIC ENEMIES<br/>Hunt down jurassic animals like the T. Rex, Raptor, Brachiosaurus, Pterodactyl, Triceratops, Stegosaurus, Ankylosaurus, Dilophosaurus, Allosaurus, Sabertooth Tiger, Mastodon, Plesiosaur, Spinosaurus, Mosasaurus, Gastornis, Parasaurolophus, Compsagnathus, and more!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the BRAND NEW blood effects for added combat ferocity!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Ultimate Dinosaur Simulator to transport yourself to the Jurassic era and survive in a world of gigantic predators as an all mighty Dinosaur!<br/><br/>If you liked living as a Dinosaur then you'll love our other animal simulators! Download our Ultimate Wolf Simulator and live a wild life in the forest, or turn the Ultimate Dragon Simulator and burn kingdoms to the ground and steal their treasure!<br/><br/>Give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2016-01-22", "tba": false, "updated": "2019-08-02T05:57:04", "background_image": "https://media.rawg.io/media/screenshots/5fc/5fce0f45e4f2a6d7f33f6daf3f917f05.jpg", "website": "http://www.glutenfreegaming.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": null}