{"id": 82743, "slug": "gamebook-adventures-9-sultans-of-rema", "name": "Gamebook Adventures 9: Sultans of Rema", "name_original": "Gamebook Adventures 9: Sultans of Rema", "description": "The official sequel to Slaves of Rema is HERE.<br/><br/>** YOU DO NOT NEED TO HAVE PLAYED ANY OF THE PREVIOUS GAMEBOOK ADVENTURES IN ORDER TO PLAY SULTANS OF REMA **<br/><br/>Your return to Rema takes you further to the east, to the City-State of Callae, renowned throughout the world as a city of great learning. Your final destination is the Emirates of Akbir, ruled by a sick Emir who has remained neutral to Orlandes’ political leanings over the years. His successor threatens to send that relationship into turmoil. You must secretly enter a harsh desert world of political power struggles and strange magics to ensure a stable future for both Rema and Orlandes!<br/><br/>** REVIEWS **<br/><br/>\"Overall, if you like a bit of sand in your sword and sorcery adventures and enjoy novels that make you choose the path of the hero then you’re in for a treat.\" - STARBURST - 9/10<br/><br/>\"Sultans of Rema is a solid, entertaining romp, with the odd dice roll and deadly choice thrown in for good measure. If you like your fantasy of the swash-buckling variety, and your games of the pen-and-paper ilk, then you're probably going to get along very well with Tin Man's latest.\" - POCKET GAMER - 8/10 Silver Award<br/><br/>\"Gamebook Adventures 9: Sultans of Rema proves to be a simple recommendation to make to those who enjoy well-written interactive fiction.\" - 148 APPS - 4/5<br/><br/>Written by Gaetano Abbondanza and designed by Brewin', Sultans of Rema sees you returning back to the large, hot continent of Rema. Josh Wright, who previously illustrated Temple of the Spider God and Curse of the Assassin, once again returns to bring the Arabian setting of Akbir to life in full colour!<br/><br/>** FEATURES **<br/><br/>•Includes all the interactive reading and gameplay features found in the previous Gamebook Adventures titles.<br/>•Read the story and dictate the direction of the story! Options based on who you have met, where you have visited and what you have found.<br/>•Lots of achievements to collect and artwork to find throughout the book. These are placed on your achievement wall.<br/>•Three difficulty levels. Read the book casually by being able to move around freely or crank up the difficulty and be the ultimate gamebook player.<br/>•Awesome artwork by Josh Wright (including a new cover by Dan Maxwell!) and music to accompany the interactive story.<br/><br/>Sultans of Rema has been created using Tin Man Games’ critically acclaimed Gamebook Adventures Engine featuring:<br/><br/>•Read the book horizontally or vertically on your tablet.<br/>•An automated Adventure Sheet to keep track of stats and inventory.<br/>•Realistic physics based dice rolling. Shake your device!<br/>•Artwork gallery. Find an illustration in the gamebook and be able to access it full-screen forever.<br/>•Bookmarking system which saves your position in the gamebook, much like putting your fingers between the pages to remember your previous page when reading the paperback!<br/>•Specially composed soundtrack and sound effects.<br/><br/>Join Tin Man Games at www.gamebookadventures.com for lots more exciting digital gamebooks including the Fighting Fantasy series and Judge Dredd!", "metacritic": null, "released": "2014-01-29", "tba": false, "updated": "2019-10-22T13:56:44", "background_image": "https://media.rawg.io/media/screenshots/b4e/b4e4bcbce9f2036558c9f4c9f59169d5_JIGgziq.jpg", "website": "http://gamebookadventures.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tin Man Games"], "genres": ["RPG"], "publishers": ["Tin Man Games"], "esrb_rating": null}