{"id": 827581, "slug": "pokemon-blooming-beast-v010", "name": "Pokémon Blooming Beast v0.1.0", "name_original": "Pokémon Blooming Beast v0.1.0", "description": "<p>One year ago, your gym leader title was revoked and you were forced into an early retirement. But now, an old friend from the Hallio region has reached out to you about an opportunity to become a gym leader again in his region. Discover what secrets await you in the Hallio region!</p>\n<p>~~ ❀ ~~ ❀ ~~ ❀ ~~<br/></p>\n<p>Pokémon Blooming Beast is a fan game made for experienced fans, featuring:<br/></p>\n<ul><li>An original region to explore (note: only part of the region is currently available)\r\n</li><li>A protagonist that isn't made out of cardboard\r\n</li><li>More challenging than official games without being Kaizo levels of punishing\r\n</li><li>A diverse regional dex with at least one new Pokémon on every route\r\n</li><li>Modified pseudo-legendary starters (yes, including Togepi)\r\n</li><li>New regional variants\r\n</li><li>No catching tutorial, and other veteran-friendly features\r\n</li><li>HMs usable from the PC, and other quality of life features\r\n</li><li>Witty and charming writing alongside an engaging plotline\r\n</li><li>And more!</li></ul>\n<p>~~ ❀ ~~ ❀ ~~ ❀ ~~<br/></p>\n<p><strong>Version 0.1.0 is a playtester demo that goes up to the first gym.</strong> It has an estimated playtime of one hour. Included in the game is a link to a playtester survey. This survey is optional, but recommended. It is the best way to support the game.</p>\n<p>Not tested on Mac or Linux, but it should work on those OSes. Please report any glitches in the playtester survey.<br/></p>", "metacritic": null, "released": "2022-07-27", "tba": false, "updated": "2023-04-27T08:28:56", "background_image": "https://media.rawg.io/media/screenshots/236/236d378bd74592f712dd84e9152b3ccb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["KRLW890"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}