{"id": 827699, "slug": "adventure-field-trilogy", "name": "Adventure Field Trilogy", "name_original": "Adventure Field Trilogy", "description": "Adventure Field™\r\n \r\n<p>The original Adventure Field™ from 2008 with grammar corrections and new scripts!<br/></p>\n<ul><li>A new battle script as been integrated to the game ( Zoom in battle, 3D arrow, Icons )...\r\n</li><li>There 2 new quality of life option to the game : Fast Battle &amp; Random Encounter Off...\r\n</li><li>You can now play with a controller just like AF3, customization are  in the options!\r\n</li><li>I ported some of AF3 scripts into it to improve the overall experience...\r\n</li><li>Major balance edit to the game and heal crystal in dungeons...\r\n</li><li>Sara stays with you for all of the game like in the 3D Remaster version...\r\n</li><li>Surely some other stuff i forgot to mention...</li></ul>\r\nAdventure Field™ 2\r\n \r\n<p>The Adventure Field™ 2 from 2012 with grammar corrections and new scripts!<br/></p>\n<ul><li>A new battle script as been integrated to the game ( Zoom in battle, 3D arrow, Icons )...\r\n</li><li>One new quality of life option to the game : Fast Battle...\r\n</li><li>You can now play with a controller just like AF3, customization are  in the options!\r\n</li><li>I ported some of AF3 scripts into it to improve the overall experience...\r\n</li><li>Major balance edit to the game and heal crystal in dungeons...\r\n</li><li>Surely some other stuff i forgot to mention...</li></ul>\r\nAdventure Field™ 3 Definitive Edition\r\n \r\n<p>It is 2017, you are Atoa, a young student living in the country of  Sarook. Day after day living the perfect young student life, you begin  to feel something is not right. In a dream you see a sword, a sword with  a powerful aura. The very next day, the said sword is sent to the  future from the past for you to find it. You then get teleported to a  kingdom long forgotten. Not so forgotten because it is the same place  but 1100 b.c. You have to fight your way home with no real promises of  success...\r\nThis game is a  25 hours side view battle JRPG  in the taste of all the classic rpg game from the beloved super Nintendo  era...\r\n </p>\n<p>This game took over 3 years to make and was made with some ripped  assets and music from other popular game, mostly music. It is an old  game that i refreshed and published on itch.io for you to enjoy for  free, that is why the game is free (F2P) and will remain free forever.  Hope you will enjoy the game for what it is and not for what assets it  use!\r\n </p>\n<p>\r\nEnglish is not my first language and back then i decided to make  the game in English even if i was not good so that more people would  understand it and play it around the world... Please don't be mean, it  is a free game... As of version 3.0.0.0 the game text as been changed a  little to help the player understand the story and the lore a little  more...\r\n </p>\n<p><strong>In this big update to the game some changes as been made like :</strong> <br/></p>\n<p>Common changes List\r\n </p>\n<ul><li>Text correction\r\n</li><li>New texts\r\n</li><li>Tweaked cut scenes\r\n</li><li>Quality of life changes\r\n</li><li>New maps\r\n</li><li>New items\r\n</li><li>A lot of bug fixed\r\n</li><li>Major game balance and enhancements\r\n</li></ul>\n<p>New items\r\n </p>\n<ul><li>Exit Rope\r\n</li><li>Stats Diary\r\n</li><li>Sarook Bestiary\r\n</li><li>Puzzle Bell\r\n</li><li>Pegasus Ring\r\n</li></ul>\n<p>New mechanics &amp; Improvements\r\n </p>\n<ul><li>Incubator Stable ( Pet dropping items )\r\n</li><li>Sarook Bestiary ( Including the shiny version of the monsters )\r\n</li><li>Puzzle Bell ( Reset the room if you fail or get stuck in a puzzle )\r\n</li><li>Pegasus Ring ( Battles go a lot faster at the cost of 15% of your exp &amp; golds )\r\n</li><li>Cutting woods now take way less times\r\n</li><li>More minor changes\r\n</li></ul>\n<p>To use controller connected by USB go to your Windows Game Controller  Setting and choose advanced... Choose your controller as the preferred  default controller in the drop down menu..\r\n </p>\n<p>We really hope you will all enjoy this epic 3 chapter adventure!<br/></p>", "metacritic": null, "released": "2022-07-26", "tba": false, "updated": "2022-07-29T13:04:20", "background_image": "https://media.rawg.io/media/screenshots/509/50939325ecc1565a3d7729d627e61a30.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wathitdew Record™"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}