{"id": 827656, "slug": "trade-up", "name": "Trade Up!", "name_original": "Trade Up!", "description": "<p><em>Do you have what it takes to get lucky?</em></p>\r\nBased on a True Story\r\n<p>You are broke. Well, almost. After college, you decided to put your business major to good use and moved into your parents' basement. Your plan was to earn loads of cashmonies without spending any, so <strong>you stole your mom's credit card</strong> and invested her funds in a bunch of those apps that advertise REAL MONEY earnings. Somehow you ended up only <em>losing</em> money, though. By the time your mom discovered what was happening, it was too late... there wasn't enough money left to pay the mortgage, and <strong>the bank took your house</strong>. Your mom lost her job as a financial advisor and it is all your dad can do to maintain his lemonade stand business (which has been having a tough winter lately even before running out of cash for lemon juice). <strong>Out on the street with only your gaming PC and the $600</strong> you have to your name (most of which your family gave you for graduation), you realize what you must do to save yourself and your family from ruin — become a millionaire, and quick! And there's only one genius way you can think of to do that — <strong>invest all of your cashmonies in the game CS:GO</strong> (Cashgrab Simulator: Global Obsession) to open cases and obtain the most valuable skin, then sell it and PROFIT! The legends say that <strong>trading up five knives grants a glove</strong> that cannot be obtained from cases and is worth <em>at least</em> $1,000,000. This glove is your Holy Grail. <strong>Find it, and save everything</strong>.</p>\r\nHow to Play CS:GO\r\n<p>Just do it. There's no time to waste.</p>\n<p>Well, if you insist...</p>\n<p>Move your counter-terrorist character side-to-side with A and D, jump with W, shoot with S or the left mouse button, and rain knives upon your foes with Space. Collect bullets, health packs, and extra knives to stay alive as long as you possibly can. And, of course, look out for cases, which you'll be able to open for $2.50 to unlock a gun or knife skin. Once you have five skins of the same rarity, you can trade them up for one skin of the next rarity.</p>", "metacritic": null, "released": "2022-07-27", "tba": false, "updated": "2022-07-29T12:42:10", "background_image": "https://media.rawg.io/media/screenshots/11a/11a96b9421465cee1a453723d6fa5449.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anjosustrakr"], "genres": ["Action", "Shooter", "Platformer"], "publishers": [], "esrb_rating": null}