{"id": 82762, "slug": "gamebook-companion", "name": "Gamebook Companion", "name_original": "Gamebook Companion", "description": "With the Gamebook Companion you can play all your favourite old school (and new edition) gamebooks on the go with this handy app. Store your SKILL, STAMINA, LUCK and equipment, battle monsters and roll dice in the easy to use and convenient layout.<br/><br/>Swipe left and right to navigate between the following screens:<br/><br/>__________<br/><br/>Character Sheet<br/><br/>On this screen you can set your scores for SKILL, STAMINA, LUCK and another seven user defined stats. Click on the icons to change them to one of 18 different choices.<br/><br/>The top five stats can all be 'locked' to an initial value by clicking the lock icon.<br/><br/>'Test your luck' by clicking on the shamrock icon.<br/><br/>Swipe up to roll dice.<br/><br/>Click the options button, top right, to access a 'Clear all' button to reset for a new game.<br/><br/><br/>__________<br/><br/>Equipment / Notes Screen<br/><br/>On this screen you can store a list of all the items / notes you pick up during your adventure. Each item / note has a title and description area.<br/><br/><br/>_________<br/><br/>Combat Screen<br/><br/>Your standard stats will automatically carry across to this screen. To battle a monster, enter its SKILL and STAMINA values in one of the monster boxes. When ready click 'Battle!'. If the 'Auto-Battle' toggle is on (top-right) then the dice will roll and 2 points of STAMINA will be deducted from the losing combatant, otherwise you can amend the relevant STAMINA value yourself.", "metacritic": null, "released": "2012-09-18", "tba": false, "updated": "2021-09-06T20:40:27", "background_image": "https://media.rawg.io/media/screenshots/42d/42d442007e6105645e8748dc0f6afe24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mark Stoneham"], "genres": ["RPG"], "publishers": ["Mark Stoneham"], "esrb_rating": null}