{"id": 827719, "slug": "life-eternal", "name": "Life Eternal", "name_original": "Life Eternal", "description": "A necromancer awakens in a dilapidated tower he once knew as a pristine stronghold for his lord and sorcerer that he was apprenticed under. Somehow, the necromancer slept through it all in a sleep so sound, not even his lord's death woke him up. But that's all right; his lord had foreseen this coming and made sure the necromancer had the knowledge and training so he could raise his dead lord all on his own. <br/><br/>                                                                <br/><br/>Now, it is up to you to help the necromancer collect the spell and tools necessary to bring his lord back to life so that he may take revenge on those who sought him harm. Although, perhaps, his lord's death could signify another kind of rebirth.<br/><br/>Life Eternal is a story-driven adventure game with a focus on exploration and no battles, from the developer behind the cult classic Star Stealing Prince. Uncover the secrets left behind by your lord's death and piece together the necromancer's own fragmented memories to find your answers.<br/><br/>There are two endings facilitated by a choice at the end.<br/><br/>                                       <br/><br/>KEYBOARD<br/>Arrow Keys - Movement (hold SHIFT to dash!)<br/>Z - Confirm &amp; Interact with objects<br/>X - Cancel &amp; Open your main menu<br/>S - Displays guide arrows<br/>Q &amp; W - Scroll Up and Scroll Down in menus<br/><br/>XBOX CONTROLLER<br/>D-Pad - Movement (hold X to dash!)<br/>A - Confirm &amp; Interact with objects<br/>B - Cancel<br/>Y - Open your main menu<br/>LB &amp; RB - Scroll Up and Scroll Down in menus<br/><br/>MOUSE<br/>Left-Click - Confirm, Move to clicked area &amp; interact with objects<br/>Right-Click - Cancel &amp; Open your main menu<br/>Scroll Wheel - Scroll Up and Down in menus", "metacritic": null, "released": "2022-07-26", "tba": false, "updated": "2023-12-29T07:06:33", "background_image": "https://media.rawg.io/media/screenshots/835/8357661e59b5788e8552814f808f06f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 6, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ronove", "Star*Cadets"], "genres": ["Adventure"], "publishers": ["Project Ensō"], "esrb_rating": null}