{"id": 82770, "slug": "restaurant-blast-chef-match-3", "name": "Restaurant Blast! Chef Match-3", "name_original": "Restaurant Blast! Chef Match-3", "description": "Welcome to Restaurant Blast! Do you love food &amp; challenges? Over 1000 puzzles of pizza, pop, sweets, and more for a delicious adventure in this fun match-3 game!<br/><br/>Get ready for a food-swapping puzzle thrill. Unique board designs and an ever-changing array of strategic objectives, Restaurant Blast puts a tasty creative spin on classic match-three gameplay. It’s a perfect way to casually spend a spare few minutes, dedicated players will find themselves strategically swapping and mapping out moves as they strive for high score domination. Unique live events all week long keep this one fresh, delicious, and fun!<br/><br/>Unlock hidden areas! Incredible boosters &amp; power-up combos! Are you ready to navigate this challenging match-3 puzzle?<br/><br/>Download Restaurant Blast for free NOW. It's insanely addicting!<br/><br/>Restaurant Blast is a wonderful new swapping and matching puzzle game from 12 Point Apps. Super jelly, wild matching combinations, and challenging game modes exploding with animations of delicious food and tasty treats! Take on this match 3 puzzle journey alone or play with friends to see who can get the highest score!<br/><br/>Restaurant Blast Features:<br/>● Stunning graphics and unique gameplay<br/>● Over 1000 unique levels with exciting puzzles<br/>● Special unique LIVE events to challenge your friends and unlock rewards<br/>● Fun weekend challenges to earn rewards<br/>● Numerous boosters along the way to help you succeed<br/>● Easy and fun to play, yet challenging to fully master<br/>● Leaderboards to compete with your friends and competitors!<br/>● New levels and maps added every 2 weeks!<br/><br/>Restaurant Blast will instantly satisfy your appetite for fun. Join everyone now and start switching and matching your way through new dimensions of yummy gameplay! <br/><br/>Visit https://www.facebook.com/Restaurant-Blast-617809621886158/ if you need help!<br/><br/>Restaurant Blast is FREE TO PLAY, with optional in-game items for purchase. You can turn off the payment feature by disabling in-app purchases in your device’s settings.", "metacritic": null, "released": "2014-01-12", "tba": false, "updated": "2019-08-16T05:39:38", "background_image": "https://media.rawg.io/media/screenshots/0d8/0d885df562d87e37bc72dfeb8825d55b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["12 POINT APPS"], "genres": ["Board Games", "Puzzle"], "publishers": ["12 POINT APPS"], "esrb_rating": null}