{"id": 827924, "slug": "race-against-time-bulletchain", "name": "Race Against Time (BulletChain)", "name_original": "Race Against Time (BulletChain)", "description": "Race Against Time\r\n\r\n\r\nGame background:\r\n<p>In 2025, a war broke out between bondman's bandit family and Jackson's aristocracy. Finally, Jackson lost to the bodyguard and was killed. Jackson V was transmitted to 1986 through the early portal prototype of the halo Institute.</p>\n<p>At this time, the members of the bondman family were in adolescence. Jackson V contacted Jackson IV and explained the story. So they decided to start first, arrest all members, and turn their skin color into light red through transformation. And torture them in various ways.</p>\n<p>Finally, they were placed in a closed room, where a faint red light flickered. Jackson set an electric cuff and initial time for everyone. If the time is 0, the person will face electric shock. And the time will gradually decrease, but they can get each other's time by killing each other.</p>\n<p>Of course, no one survived</p>\n<p>However, Jackson was addicted to the game. He sent people to distribute leaflets everywhere. In the name of experiment, he actually gathered people together and watched them kill each other. And the number of local missing persons has also exploded</p>\r\n\r\nGame play:\r\n\n<p>Six players are assigned to a room, and each player has an initial time: 30 seconds. If 30 seconds returns to 0, the player will be eliminated. Players can get each other's time by killing other players, so as to live to the end</p>\r\nNow：\r\n<p>At present, the game is in the development stage, but there is a beta version for downloading and playing. If you are looking forward to this game, please collect it.</p>", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-07-29T14:45:54", "background_image": "https://media.rawg.io/media/screenshots/492/492d702f310c9859d78e6081379d9a24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BulletChain"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}