{"id": 828282, "slug": "jelly-star-jelly-slide-puzzle", "name": "Jelly Star-Jelly Slide Puzzle", "name_original": "Jelly Star-Jelly Slide Puzzle", "description": "<p>Be the Jelly star. Get your Jelly cubes out of the room in this Jelly Adventure game. It’s an Awesome Jelly Game that is unique, fun and totally amazing.<br/>Jelly Slide Out Adventure Fun is a unique game where you need to get your jelly cube out of a room. You need to get the jelly cube out of the room. Taking the cube to the finish line is Jelly Art. Be the Jelly star artist. Be careful! The room can also have some green cubes. If you touch them, the jelly will burst.<br/>Control the jelly cube and take it to the finish line. The green cubes would try to catch your jelly cube. Avoid them and escape to the finish. The jelly slides to help you to get past all the obstacles in the room. A unique jelly game that would always keep you engaged. The game is the best jelly adventure with a new escape room factor. You need to escape the room to reach the next level safely. A really great jelly run game for everyone.<br/>Take this jelly dye game challenge and get ready for an awesome jelly game adventure. There are tons of different colored jelly cubes. It’s an amazing jelly game that tests your brain, reflexes and problem solving skills. Play the jelly honey or solve the best jelly puzzle levels. Get your jelly jump right to defeat the jelly monster. You need to beat the jelly queen in some levels.<br/>It’s kind of like the adventure jelly puzzle games but even better. The green jellies are the jelly crush candy jelly monsters that want to stop you from escaping the room. Be the super jelly jump and get out of the room. Go for the jelly hop to escape the room.<br/>This game is a jelly run 3d adventure for everyone. The Smooth jelly 3d game controls help you to turn the cube anywhere you want. It’s a jelly shift game. Slide your jelly to wherever you want and reach your destination.<br/>Each level comes with a different challenge. Jelly Slide Out Adventure Fun is an addictive jelly puzzle game. Get into the jelly store and have some real fun. There are tons of different jelly cubes to choose from. Keep spreading jelly and having fun. Enjoy the jelly shift as it goes from one room to the other. It’s a jelly stacking game designed for awesome fun.<br/>This is the most unique jelly slide game. You need to control the jelly cube the best way you can. Find a way out of the room by dodging the green cubes. Play this uniquely awesome jelly jelly shift game to have an awesome time. One of the best jelly adventure puzzle games you’ll ever play. Jelly Slide Out Adventure Fun jelly puzzle really takes you to an amazing jelly run game adventure.<br/>Important Features-<br/>- Tons of challenging levels<br/>- Choose different jelly cubes<br/>- Amazing controls<br/>- Feels like a sliding puzzle game<br/>- Addictive gameplay<br/>- Cool graphics and smooth gameplay</p>", "metacritic": null, "released": "2022-07-25", "tba": false, "updated": "2022-07-29T17:42:29", "background_image": "https://media.rawg.io/media/screenshots/609/6091b27f83f50cfa7b37a52eb1fad188.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["GAME STUDIO"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}