{"id": 828225, "slug": "horse-o-chess", "name": "Horse-o-chess", "name_original": "Horse-o-chess", "description": "Welcome to Horse-o-chess!\r\n<p>Each round you'll get some coins to spend in the unit shop. Try to put together the best team you can! Drag units to your board, press \"Start Round\", and watch them fight! You can put 3 copies of the same unit on your bench to combine them into a more powerful one. And be sure to place different units from the same alliance onto the board for powerful bonuses.<br/><br/>Do your best, have fun, and save those animals!</p>\n<p>If the game is too large for your screen, you can press F to play in full-screen or you can play on this page where I made the screen a bit smaller:<br/>https://pajamabeevegan.itch.io/horse-o-chess-small-screen<br/><br/>Oh, and if you want to follow the game's progress you can check me out at:<br/>https://twitter.com/PajamaBee_Vegan<br/></p>\n<p>Horse-o-chess is a free game! And it always will be. I want people to be able to play games (especially Horse games) no matter what their means are. That being said, I do still need money to eat and pay rent though. <br/>I'll keep updating Horse-o-chess as much as I can, but if we're able to hit the goals above I'll be able to put all of my energy behind it and make Horse-o-chess the best it can be.</p>\n<p>Any money sent through Itch goes towards the goal.</p>\n<p><strong>Buying the game on Itch gives you access to:</strong> <br/></p>\n<ul><li>Stand-alone executables of the game</li><li>An archive of older versions as updates come in</li><li>Bonus micro-game \"Cucumber or Zucchini\"</li><li>A picture of a dog</li></ul>\n<p>You can also donate on ko-fi, and there's some small bonus gifts if you sign up to be a monthly donator. <br/>https://ko-fi.com/pajamabeevegan<br/>Any donations from anywhere will get added to the tracker above. (I'm updating it manually so it won't update right away though).</p>\n<p>Here's an outline of some ideas I have planned for future updates.<br/></p>\r\nBig Update #1 Plan\r\nA New Mission\r\n<p>Survive through another set of 20+ rounds with new enemies and a new board layout</p>\r\n25+ New Items\r\n<p>Deck out your animals with cool new clothes and gadgets</p>\r\nMusic and SFX\r\n<p>A battle theme, chill intermission music, rainy ambiance, and cool sound effects for each animal<br/></p>\r\nCommanders\r\n<p>Selectable characters that modify the game with new challenging and fun ways to play<br/></p>\r\nBig Update #2 Plan\r\nA New Double Mission\r\n<p>Balance your resources building two teams at once on side-by-side boards, each with their own differences</p>\r\nScience!\r\n<p>Power up your Science Machine and earn global upgrades that apply to your whole team</p>\r\nThe Bonus Zone\r\n<p>Read bios for each animal, feed them treats, and play little minigames</p>\r\nFuture Plans\r\n<p>Once I've got about 5 missions made for the first set of animals, I hope to make a new set with ~50 new animals filled with new ideas and mechanics. Haven't decided on the theme yet but I'm thinking of maybe focusing on underwater animals or bugs :)<br/></p>", "metacritic": null, "released": "2022-07-18", "tba": false, "updated": "2022-07-29T17:10:45", "background_image": "https://media.rawg.io/media/screenshots/77b/77bd832417d0006c3fb184deb158288e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["pajamabeevegan"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}