{"id": 82845, "slug": "an-ice-cream-soda-pop-floats-maker-free", "name": "An Ice Cream Soda Pop Floats Maker! FREE", "name_original": "An Ice Cream Soda Pop Floats Maker! FREE", "description": "Now you can make your own delicious Ice Cream Floats on your iPhone or iPod.<br/><br/>Zero Calories and all that yummy sugary goodness!<br/><br/>Pick your favorite ice cream scoops and combine it with flavored syrups, sauces, fizzy soda and all the toppings you love for a sweet treat!<br/><br/>Let your imagination run wild as you create your own virtual ice cream float. This is one frothy treat you’re going to love sipping up!<br/><br/>The age old question...Ice Cream first vs Soda first.<br/><br/>Ice Cream first:<br/>Drop scoops of your favorite ice cream into a tall frosty glass (or mug). Pour your choice of soda over the top igniting an explosion of tasty bubbles. Watch as your rich and delicious drink starts foaming up, sometimes spilling over, as the bubbles in the soda make the ice cream scoops float to the top through the foamy frothy head.<br/><br/>Soda first:<br/>Fill your large frosty mug (or glass) with your favorite carbonated soda or soda water and watch your drink bubble and fizz. Then, gently drop in scoops of creamy ice cream and watch them bob down through the soda before floating to the top.<br/><br/>Add some flavored syrups and sauces,…Top it off with a mound of vanilla or chocolate whipped cream,… Then sprinkle on some sugary candy toppings.<br/><br/>Add a straw and sip up all that sweet, creamy deliciousness!<br/><br/>And eat your frothy ice cream and toppings!<br/><br/>- 36 of your all-time favorite Ice Cream Flavors.<br/>- 9 fizzy, foamy, bubbly Soda Flavors<br/>- 21 Syrup and Sauce Flavors<br/>- 40 Delicious \"Specials\", Whipped Cream and Candy Toppings<br/>- 117 frosty tall Glasses to choose from. (9 styles of glasses… Each in 13 different colors).<br/>- Pick from 12 colorful Backgrounds.<br/>- All ice cream and soda combined mixed flavors reflect the real life color of what that combination would be...Realistically programmed to give you a true virtual Ice Cream Float!<br/><br/>Experiment with different sodas and ice creams!<br/><br/>You have endless ice cream float combinations waiting to be discovered.<br/><br/>Unleash your inner artist and create your Signature Float!<br/><br/>Share it with a friend or save it to your photo library.", "metacritic": null, "released": "2013-12-20", "tba": false, "updated": "2019-10-22T14:00:18", "background_image": "https://media.rawg.io/media/screenshots/b16/b166242159deb528b3613842c2c7e75e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Devorah Hoffman"], "genres": ["Family"], "publishers": ["devorah hoffman"], "esrb_rating": "Everyone 10+"}