{"id": 828403, "slug": "the-devil-on-my-shoulder", "name": "The Devil On My Shoulder", "name_original": "The Devil On My Shoulder", "description": "<p>On one shoulder, I have an angel enthusiastically encouraging me to participate in my very first game jam.</p>\n<p>...but on the <strong>other</strong> shoulder...</p>\n<p>The Devil On My Shoulder places you in the shoes of... well... me!  Join me on my quest to design a game (specifically, <strong>this</strong> game - things get meta <strong>real </strong>quick) over the course of a weekend for my very first game jam, notwithstanding my non-qualifications and the nebulous nudging of a nefarious nay-saying  ne'er-do-well nestled naughtily next to my neck!</p>\n<p>Part 2D platformer and part interactive narrative, The Devil On My Shoulder sees you (me) struggling to make a game jam game before the weekend is up.  At a loss for ideas, and plagued by your (my) incessant insecurities, you (I) decide to make a game about making the game, while those insecurities try to sabotage you (me) at every turn.  Your choices shape the outcome of the game*, but be mindful of the time you have left when deciding whether to add a new feature; an unfinished game can't be submitted to the game jam, and scope creep is the devil's only friend!<br/></p>\n<p>*They shape the outcome, but like, in a fairly superficial way.  (This is a game jam game, after all, and my very first one at that.)</p>\n<p>-----<br/></p>\n<p>This game was made for Mini Jam 111, the theme of which was \"you are your own worst enemy.\"  Since that theme describes every moment of my life anyway, I figured this was the perfect excuse to wrangle my self doubt into submission, get some good practice in a new game engine, and live out a life-long dream of publishing a video game.  Hope you enjoy it!</p>", "metacritic": null, "released": "2022-07-25", "tba": false, "updated": "2022-07-29T18:37:19", "background_image": "https://media.rawg.io/media/screenshots/985/9854460a38b814110416c93530067e2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MyCousinJimmy"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}