{"id": 828485, "slug": "beat-refle", "name": "beat refle", "name_original": "beat refle", "description": "A rhythm game where you massage cuties?!<br/>Play the rhythm game to work out the kinks in these beauties' bodies!<br/><br/>This new take on rhythm games has you massage beautiful women in time to the music.<br/>The patrons of your massage parlor have not only sore bodies, but unique worries weighing on their hearts as well.<br/>Use your secret massage technique to clear all the stress out of their minds and bodies!<h3>STORY</h3>Atsushi Yubihara meets the talking cat Momiji while cleaning the massage parlor formerly run by his late grandfather.<br/><br/>Moments after he attempts to uncover her true identity in spite of his confusion, a loan collector appears to reclaim what his grandfather owes. Fed unreasonable repayment terms, he starts to shrink into himself until Momiji shares with him a most mysterious power...<br/><br/>He has but a single month to make enough money to return what was loaned, marking the start of his troubled everyday life as a masseuse!<br/><br/>There's no time to question his power, or why there's a talking cat, or anything else!<br/><br/>Atsushi must focus on his somewhat to very quirky customers and relieving the stress that ails them, all in time for the impending loan repayment!<h3>SYSTEM</h3>■Massage the girls in time to the rhythm!<br/>The skills that have been passed down from the previous generations will help you heal people, body and soul!<br/><br/>Momiji imbues upon you the secret technique of being able to sense the music that people subliminally want to hear, and sending it as sound waves through your gloves into their bodies. <br/>This unique massage technique allows you to heal them both inside and out.<br/>Press the button shown in time with the song and play it throughout your customers' bodies!<br/>The rhythm game features a total of 50 songs!", "metacritic": null, "released": "2022-07-30", "tba": false, "updated": "2023-01-27T05:11:47", "background_image": "https://media.rawg.io/media/screenshots/132/1329124ce32f76342b49932b66502b56.jpg", "website": "https://qureate.co.jp/beatrefle/en/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 11, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["qureate", "Orgesta"], "genres": ["Casual"], "publishers": ["qureate"], "esrb_rating": null}