{"id": 828489, "slug": "fertile-heroine-seaworthy", "name": "Fertile Heroine Seaworthy", "name_original": "Fertile Heroine Seaworthy", "description": "<p>Gameplay OverviewYou play as Seaworthy--Oceanus&#39;s last defender against a mysterious alien invasion. You will move through semi-randomly generated maps and encounter monsters along the way which you must fight via the game&#39;s combat system.<br />\nAfter each battle you may use the experience points to upgrade yourself, improving and significantly changing your fighting capabilities in modern rogue-like fashion. Other events such as loot and merchant can also improve your power in unique ways.<br />\nDue to the corruptive origin of your monstrous enemies, they may attack you in sexual as well as physical ways, and may inject you with their various genetic materials. These materials will hamper your combat abilities, but can also be traded for various rewards. You can even use them to give birth to minions, who will assist you in battle.Combat systemThe combat system is completely unlike typical menu-based RPGs:<br />\nYour various abilities are in the form of tokens--physical objects that are shaken around in a tray from which 3 or more are selected each turn. You can then chose to use these tokens and their associated abilities, or reroll your tray to select new tokens. Various game mechanics adds layers of complexity to this underlying system, making it more engaging then traditional RPGs.<br />\nAs a modern rogue-like, the combat as well as progression throughout each play session incorporates many tested-and-true features, such as forecasted enemy-intent, limited RNG usage, and non-linear growth.Sexual contentThis game contains a large amount of explicit sexual images intended for an adult audience.<br />\nBesides miscellaneous explicit graphics in UIs and cutscenes, each enemy in this game has 2 unique, hand-drawn images showing its...interaction with the heroine. (In early access many of these are placeholder but will be replaced by polish art as the game finishes)<br />\nAs the game develops through Early Access, new features such as NPC interactions will add new ways for the player to admire mature works of art.DedicationThis game is made for the lovely Seaworthy.<br />\nWithout her funding and support throughout development, the game would not be possible.</p>", "metacritic": null, "released": "2022-07-30", "tba": false, "updated": "2022-08-01T11:45:44", "background_image": "https://media.rawg.io/media/games/55b/55bec8861b739e197cf41ccab7f86697.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GrayEye100"], "genres": ["RPG"], "publishers": ["GrayEye100"], "esrb_rating": null}