{"id": 828479, "slug": "kyoukai-no-shirayuki", "name": "Kyoukai no Shirayuki", "name_original": "Kyoukai no Shirayuki", "description": "<p>It began with the pomegranate tree.</p>\n<p>It was during the summer of my second year of university.<br />\nI was on my way to visit &quot;The Mirror of the World&quot; Exhibition.<br />\nCoincidentally, that day in the past, I was involved in a falling accident.<br />\nHowever, now that&#39;s just a childhood memory.</p>\n<p>At the exhibition, I met 8 guys.<br />\nOn that night... Tempted by the sweet aroma of the pomegranate which I so love, I ate it.<br />\nI was then suddenly struck by great sleepiness.<br />\nUnable to fight it off, I went to bed. It was then when I heard a sweet voice that made me shudder in disgust.</p>\n<p>&quot;Welcome home. Finally, I&#39;m able to be in the same place as you.&quot;</p>\n<p>When I shot up awake in the morning, I was holding a hand-mirror that I&#39;ve never seen before.<br />\nA voice from the hand-mirror- calling itself the mirror&#39;s spirit- in a whisper, tells me to &quot;save the fated one&quot;.<br />\nAnd then, I met the guys I first saw at the exhibition again.</p>\n<p>When I drew closer to them, they invited me into the unreal and mad world; the &quot;Mirror World&quot;.<br />\nThe guys in the Mirror World will only call me &quot;Snow White&quot;, and had crazed expressions unlike when they were in the real world.<br />\nI learned of the &quot;Queen&quot; as I became closer to them.</p>\n<p>&quot;Capture Snow White.&quot;</p>\n<p>The Queen is trying to capture me- Snow White.<br />\nThe guys&#39; madness. The Queen drawing closer. I wonder why I&#39;m called &quot;Snow White&quot;, and why I’m being targeted...</p>\n<p>&quot;Now it is your turn to have taste of loneliness. Go on, try and escape. I&#39;ll chase you to the ends of the world. I&#39;ll definitely capture you.&quot;</p>\n<p>[Translation of the official website story summary.]</p>", "metacritic": null, "released": "2016-05-26", "tba": false, "updated": "2022-07-31T20:42:40", "background_image": "https://media.rawg.io/media/screenshots/ab5/ab5073eaa295a9bf12a017474a736b18.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 301, "game_series_count": 0, "reviews_count": 0, "platforms": ["PS Vita"], "developers": ["Otomate"], "genres": ["Adventure", "Casual"], "publishers": ["Idea Factory"], "esrb_rating": "Teen"}