{"id": 828446, "slug": "splt", "name": "SPLT", "name_original": "SPLT", "description": "<p>**Please play in fullscreen!**<br/><br/>SPLT is a 2D dimension hopping bullet hell survival game. Destroy and endless swarm of drones by dodging between shots and shifting dimensions. <br/><br/><strong>Mechanics:<br/></strong>Dimensions: You can only affect and be affected by enemies in the same dimension as you currently (Matching Colors!) You can swap between at the expense of alerting enemies.<br/>HP - You only can be hit 5 times before its a game over!<br/>Ammo - 6 Shots before you have to reload! go for dash K.Os to avoid running out at a bad time!<br/>Alert (You are your own enemy) - As you stay in one dimension enemies will gradually become more aware of your presence increasing spawn rates, but swapping between will immediately add a level of alert to the dimension you just left before it gradually decays over time. Try to balance it so you always have an escape route in case of emergencies!<br/><br/><strong>Movement Controls:<br/></strong>A &amp; D - move left/right<br/>SPACE - jump<br/>R - reload<br/>Q - red/blue shift<br/>MOUSE - aiming</p>\n<p><strong>Grounded Controls</strong><strong>:</strong><br/>LEFT CLICK - melee attack damaging enemies in front of you, can be done while reloading.<br/>RIGHT CLICK - Aim your gun, left click to fire.</p>\n<p><strong>Aerial Controls:</strong><br/>LSHIFT - Dash in aimed direction, after a short delay damage enemies in your path and become immune to damage for the duration. Automatically reloads gun in this attack finishes an enemy.<br/></p>", "metacritic": null, "released": "2022-07-25", "tba": false, "updated": "2022-07-29T18:57:34", "background_image": "https://media.rawg.io/media/screenshots/93b/93b39b85c0bac171cb744da90742217f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Szyntax"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}