{"id": 828431, "slug": "doppelganger-jaco-van-hemert", "name": "Doppelganger (Jaco van Hemert)", "name_original": "Doppelganger (Jaco van Hemert)", "description": "<p>A short turn-based stealth game made for the MiniJam 111, with the limitation \"You are Your Own Enemy\". <br/></p>\n<p>In Doppelganger, you are fighting other versions of yourself. As you equip new abilities, they also gain similar bonuses.</p>\n<p>In the game, your goal is to sneak past guards to get to the doppelganger, who is disguised as them (but you can see who it is if you look for differences between the normal guards and them), and kill him.</p>\n<p>--</p>\n<p>Controls:</p>\n<p>WASD or arrows to move</p>\n<p>[U] to activate sword, and then left or right to attack (press U again to cancel)</p>\n<p>[J], [K], [L] to activate the corresponding ability. Passive abilities are on by default, but can be toggled with these buttons. (My current build does not include active abilities, but they work the same as the sword.)<br/></p>\n<p>[Space] to wait, skipping your turn.<br/></p>\n<p>--<br/></p>\n<p>Everything made by me, Jaco van Hemert.</p>\n<p>I used Unity, Piskel, Audacity, and Beepbox.</p>\n<p>--</p>\n<p>Known bugs:</p>\n<p>- I ran out of time, so many of the animations are a bit iffy. Ergo, there's a good chance you'll encounter some visual bugs. <br/></p>\n<p>- In at least one of the levels, the lose conditions (a guard seeing you before you engage the doppelganger) don't seem to trigger, and I didn't have time to fix that before the submission time.<br/></p>", "metacritic": null, "released": "2022-07-25", "tba": false, "updated": "2022-07-29T18:51:53", "background_image": "https://media.rawg.io/media/screenshots/be6/be6b4cba8e89aa79c47c35a92ad52212.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Jaco van Hemert"], "genres": [], "publishers": [], "esrb_rating": null}