{"id": 828729, "slug": "sacristrike-pt", "name": "Sacristrike-PT", "name_original": "Sacristrike-PT", "description": "<p>Sacristrike is a game where the main mechanic involves having the user (android) give up their energy (health) in order to use their offensive abilities.</p>\n<p>Most controls are explained in game, but I'll list all functions just to be safe (spoilers beware?):<br/></p>\n<ul><li>Arrow Keys to move. Pressing down lets you drop through platforms.</li><li>Space makes you jump/wall-jump/double-jump.</li><li>Z to interact or slap some lads up.<br/>\n</li><li>X to charge a lobbed explosive, Release to shoot the explosive.\r\n</li><li>You can slap airborne projectiles to reflect them back at the enemy.\r\n</li><li>Shooting lobs at the weird glass orbs will charge them, allowing you to progress.\r\n</li><li>You can also destroy some crumbly blocks with your lobbed shots.</li><li>ESCAPE to exit at any time in the downloadable version.</li><li>There's no pausing for this one.</li></ul>\n<p>_____________________________________________________________________________________________<br/></p>\n<p>This is more-so a prototype rather than a full game. I was using it as a learning opportunity beyond my first game, Asteroidsds. It was started in less than a month after that project, though honestly the work done here probably would add up to under three months. That being said, I enjoyed some of the characters that I made, and am very interested in expanding on the idea in the future; perhaps towards something more action based.</p>\n<p>P.S. This is my first foray into audio besides a drum beat for a game jam entry I made, and I'm still unsure if it's any good. My highest hope is that you don't end up having to mute the game lmao (but tell me if you did, I'll work on that)<br/></p>", "metacritic": null, "released": "2022-07-31", "tba": false, "updated": "2022-08-01T05:12:29", "background_image": "https://media.rawg.io/media/screenshots/708/708bf70a5e874b4825242a0eac6fa9db.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Shoelariat"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}