{"id": 828713, "slug": "sling-ball-2", "name": "Sling-Ball", "name_original": "Sling-Ball", "description": "<p>English version below!<br/><br/><em>Achtung! Du benötigst einen Controller um dieses Spiel zu spielen!</em></p>\n<p><strong>Bei Sling-Ball handelt es sich um ein actionreiches Arcade-Spiel für eine Person. Übernimm die Kontrolle über zwei Hälften eines Balles, lasse sie fusionieren und zerschieße damit gefährliche Objekte. Achte genau auf deine Umgebung und das Spielfeld, um Bewegungsmuster und Alarmsignale zu erkennen. Das Spiel steuerst du mithilfe deines Controllers. Spanne die gewünschte Hälfte auf, ziele und lass sie mit der anderen Hälfte fusionieren, um deinen Ball durch die Spielwelt zu schießen. Als blitzschneller Ball hast du die Möglichkeit, allerlei Objekte in deinem Umfeld zu zerstören und dabei den Highscore zu knacken. Doch gib acht, wenn ein Objekt deinen Ball berührt, während die zwei Hälften getrennt sind, erleidest du Schaden und verlierst das Spiel! Hast du das Zeug, den Highscore deiner Freunde zu schlagen?</strong><br/><br/><br/>Steuerung:<br/>L1 = fixieren weißer Seite <br/>L2 = fixieren schwarzer Seite<br/>Linker Joystick = Bewegt weiße Seite<br/>Rechter Joystick = Bewegt schwarze Seite<br/>Joysticks während dem Flug nach außen ziehen = Trennen der Seiten</p>\n<p>______________________________________________________________<br/><br/><em>Attention! You need a controller to play this game!</em><strong><br/><br/>Sling-Ball is an action-packed arcade game for one person. Take control of two halves of a ball, fuse them together and use them to destroy dangerous objects. Pay close attention to your surroundings and the map to detect movement patterns and alarm signals. You play the game with your controller. Pull away the desired half to create tension, aim and let it merge with the other half to shoot your ball through the game world. As a lightning-fast ball, you'll be able to destroy all sorts of objects around you and break the high score in the process. But be careful, if an object touches you while the two halves are separated, you will take damage and lose the game! Do you have what it takes to beat your friends' high score?</strong><br/><br/>Controll:<br/>L1 = fix white side <br/>L2 = fix black side<br/>Left joystick = move white side<br/>Right joystick = move black side<br/>Pull joysticks outward during flight = separating the sides<br/></p>", "metacritic": null, "released": "2022-07-31", "tba": false, "updated": "2022-08-01T05:05:42", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a512470f28a09f9ef10f26e42c2477b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Callitza"], "genres": ["Action"], "publishers": [], "esrb_rating": null}