{"id": 8288, "slug": "chess-cards-game-pro-edition", "name": "Chess Cards Game Pro Edition", "name_original": "Chess Cards Game Pro Edition", "description": "Chess Cards Game is a strategy game with full information (meaning you know the cards of your opponent), played with a set of just 20 cards and simple rules. <br/>But don&amp;#39;t be misled! <br/>Despite simple rules the game is challenging and requires smart thinking and forseeing the moves of the other player. What&amp;#39;s more, it is a game where the winning depends on your skills and not your luck!<br/><br/>Each match consists of two rounds and the players exchange the cards after the first round. In this way the match result doesn&amp;#39;t depend on the luck of the initial draw, but on the strategic skills of the players.<br/><br/>The app contains short tutorial which will help you learn the rules in no time (you may also check the game webpage). The game is based on the Mate game created in 1915 by G.Capellen.<br/><br/>You may choose between two beautiful sets of cards, with chess and classic theme, displayed in native resolution on devices ranging from iPhone 4S to iPad Pro. Gentle sound effects will also enhance your game experience.<br/><br/>There are several modes of play: <br/>- Solo game - you may exercise your skills during the game with Albert AI (on three levels of difficulty),<br/>- Dual player game - play with your family member or a friend on one device,<br/>- Local network game - you may play on two devices via WiFi or Bluetooth,<br/>- Game Center game -  last but not least, you may play with your friends or other players around the world via Game Center. In this mode your highest ranking (difference between your points and opponent points in the current match) is stored on the ranking leaderboard in Game Center.<br/><br/>In addition you may set advanced rules for dual player game in app settings before you start the match. Advanced rules allow you to sacrifice single or multiple cards before each player&amp;#39;s turn. <br/>Sacrificed cards are not used during current round and playing with sacrifices may dramatically change the outcome of the game making it even more challenging and interesting.<br/><br/>So, test your strategic skills and play Chess Cards Game! <br/><br/>If you like the game, please take a moment to leave a positive review or rating in the App Store - it really helps, thank you!", "metacritic": null, "released": "2015-09-13", "tba": false, "updated": "2019-10-22T14:29:46", "background_image": "https://media.rawg.io/media/screenshots/c05/c05916761b2721fbccd27a75f4d6985b.jpeg", "website": "https://www.facebook.com/ChessCardsGame", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pawel Klarkowski"], "genres": ["Strategy", "Card"], "publishers": ["Pawel Klarkowski"], "esrb_rating": "Everyone 10+"}