{"id": 828939, "slug": "jusquau-bout-du-monde", "name": "Jusqu'au bout du monde", "name_original": "Jusqu'au bout du monde", "description": "<p>This is just a demo, but it will be made in a full game.</p>\n<p>It's made for the Potatos Game Jam 10 on the theme \"couple\" but a few event slowed me too much to finish it.</p>\n<p>It use the bump system of the firsts Ys and you play two characters: a red hair fighter girl who can fight, and a sick blue haired girl who can do magic, on their way to the end of the world, except not really because it's unfinished, so you just flee slavery.</p>\n<p>You can press W or Z to ask your ally to stay there or follow you.</p>\n<p>X to play the other character.</p>\n<p>C to interact while playing red hair and to use a spell while playing blue hair</p>\n<p>and V to change speed while playing red hair and change the spell you use with blue hair.</p>\n<p>It's very short and kinda empty now, I know, but I hope you'll like it anyway, and I'm gonna make it better with time.</p>\n<p>--------------------------------------------------------------------------------------</p>\n<p>Ce n'est qu'une démo, mais elle sera faite en jeu complet.</p>\n<p>Elle à était faite pour la Potatos Jam 10 sur le theme \"couple\", mais certains evenements m'ont ralenti trop pour le finir.</p>\n<p>Elle utilise le systeme bump des premiers Ys et on y joue deux personnages: une combatante rousse et une malade au cheveux bleus qui peux lancer des sorts. Les deux veulent aller à la fin du monde, mais pas vraiment parce que le jeu n'est pas fini, donc elles se contente de fuir leur état d'esclave pour l'instant.</p>\n<p>Appuyer sur W ou Z demande à notre allié d'attendre ou de nous rejoindre.</p>\n<p>X nous fait changer de personnage controllé.</p>\n<p>C nous permet d'interagir si on joue la rousse et de lancer un sort si on joue cheveux bleus</p>\n<p>Et V permet de changer de vitesse en jouant la rousse et de changer de sort à utiliser en jouant cheveux bleus.</p>\n<p>C'est très court et un peu vide, je sais, mais j'espere que vous aimerais quand même, et je l'améliorerais avec le temps.</p>", "metacritic": null, "released": "2022-07-31", "tba": false, "updated": "2022-08-01T06:43:12", "background_image": "https://media.rawg.io/media/screenshots/0d3/0d32892d33514e1f9e1d573d00e60897.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MarionLAsticot"], "genres": [], "publishers": [], "esrb_rating": null}