{"id": 82939, "slug": "french-fries", "name": "French Fries", "name_original": "French Fries", "description": "From the developers of the mega hit \" Ice Cream! \" and the best iPhone and iPod touch games, we bring you our newest food app, French Fries! <br/><br/>French Fries were born to be our favorite fast food. Now you can make your own delicious fries anytime on your iPhone or iPod touch. Satisfy your appetite while mastering the art of the perfect french fry. <br/><br/>Choose a background and a plate, basket, fries cup or holder. <br/>Select from an array of spuds. You can slice your own whole potatoes or choose a bag of pre-cut fries. <br/>Whole potatoes with skin, peeled potatoes, and sweet potatoes. <br/>Bags of pre-cut fries include crinkle, waffle, and ridge cut. <br/><br/>Fill the large vat with oil. Slide your fries in and watch as the hot oil sizzles, bubbles and deep fries them to a golden brown. Scoop them out with a sieve and drop them onto your chosen plate, basket or into the fries cup or holder. <br/><br/>Add Toppings or Dipping Sauces: <br/><br/>Salt, Ketchup, Melted Cheese, Chili, Guacamole, Sour Cream, Malt Vinegar, Country Gravy, Mayonnaise, Dijon Mustard, Piccalilli, and Satay Peanut Sauce. <br/><br/>Then eat your scrumptious virtual French Fries! <br/><br/>Pick a Dipping Sauce, and realistically dip and coat your fries before eating them. Refill your dipping sauce at any time, for a variety of Yummy flavors. <br/><br/>Want to play with your food? French Fries! provides an unlimited \"UNDO\" feature. <br/><br/>Don't have time to cook your fries? Then touch the \"Eat Fries\" button... Just Serve and Eat your favorite French Fries. <br/><br/><br/>- Save to your photo library. <br/>- Email them to your friends. <br/><br/>And as always, smooth animation, realistic graphics and high quality...just the thing you’ve come to expect from our apps. <br/><br/>Watch for our frequent updates, which are always free and chalk full of good stuff!", "metacritic": null, "released": "2012-12-16", "tba": false, "updated": "2019-10-22T14:04:59", "background_image": "https://media.rawg.io/media/screenshots/e2e/e2e80e4f382de92e6bcf23126279ce8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Devorah Hoffman"], "genres": ["Family"], "publishers": ["devorah hoffman"], "esrb_rating": "Everyone 10+"}