{"id": 829655, "slug": "ball-dude-adventures-too", "name": "BalL DuDe AdVENtures TOo", "name_original": "BalL DuDe AdVENtures TOo", "description": "<p>Welcome to the exciting sequel to the hit game Ball Dude Adventures - Ball Dude Adventures Too! In this new and improved edition, you'll have plenty of fun as you help our lovable character navigate his way through a series of challenging levels. Enjoy hours of gameplay while developing your skills in physics-based puzzles, platforming challenges, and more. With great graphics and an engaging storyline, this is one adventure that you won't want to miss!</p>\n<p>As one of the most popular mobile games of all time, Ball Dude Adventures Too has already captured the hearts of many mobile gamers all over the world. It follows the same formula as its predecessor - you guide the titular ball dude through obstacles and landscapes, and use your platforming skills to collect as many points and coins as possible. However, what makes this game so ingenious is its sequel-esque updates, which allow you to design your own levels and share them with other players. Whether you're looking for a new challenge or a fresh take on the classic platforming genre, Ball Dude Adventures Too is a must-have for your mobile app library.</p>\n<p>The game is straightforward to play - you simply touch and drag the ball dude around the screen, avoiding obstacles and collecting coins and points. While the levels are fairly short, they're challenging, and the game rewards players for attempting multiple levels in a row. Plus, if you're looking for a bit more of a challenge, you can unlock tougher levels by reaching a set number of points or coins. The controls are easy to learn, and the game is paced perfectly, so you won't get lost or frustrated.</p>\n<p>Ultimately, the purpose of Ball Dude Adventures Too is to have fun. Whether you're a longtime fan of the original game or you've just discovered it, there's no denying that this game is immensely entertaining and addictive. Whether you're playing alone or with friends, there's no stopping you from reaching the top of the leaderboard. So what are you waiting for? Start playing Ball Dude Adventures Too today!</p>\n<p>Ball Dude Adventures Too is a great game that is perfect for any mobile gamer. It is simple to play, but very challenging, and the updates allow you to create your own levels and share them with other players. If you're looking for a fun, addictive game that is perfect for a quick break, Ball Dude Adventures Too is the perfect choice.</p>\n<p><strong>If you are a massive weiner, press ctrl + L to skip a level</strong></p><p>Also this game is open source for some reason here have a look: https://github.com/Eatkin/gbkt8</p>", "metacritic": null, "released": "2022-07-29", "tba": false, "updated": "2022-08-01T11:33:20", "background_image": "https://media.rawg.io/media/screenshots/fb1/fb1c07f4e25222afac37b7407cc38cb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Edward Atkin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}