{"id": 829677, "slug": "bullet-hell-rpg-1-cosmic-corruption", "name": "Bullet-Hell RPG 1 - Cosmic Corruption", "name_original": "Bullet-Hell RPG 1 - Cosmic Corruption", "description": "<p>READ BEFORE PLAYING</p>\r\nGameplay Summary:\r\n<p>WASD To move, click to shoot/select. E to use purchased abilities, Space to slow your speed to make dodging some attacks easier. Hold F when buying upgrades to use 10 coins at a time instead of 1. Progress through all 5 areas to win, and fight enemies along the way! In order to finish an area you must defeat all of the enemies and the boss. If you lose to the boss, don't worry! You won't need to get past all of the enemies again, and instead can retry the boss immediately. Once you clear the area, this checkpoint will be removed. You can choose between 3 classes that each have unique perks that scale with your level, and provide scaling boosts to their respective stats. At a high enough level, these classes get 'Pure' forms that boost their perks, but reduce specific stats. You can also choose between 4 weapons: Blaster(Average Damage, basic and reliable), Charger(High Damage, requires precise timing and accuracy), Spreader(Shoots several pellets in a wide angle, rewards risky playing), and Laser(Low Damage, constantly hit multiple targets with ease). You can buy upgrades, spend coins, save/load your game, and change your class/weapon after completing an area, or if you lose. If you die, you will lose 50% of the coins you gained in the area you lost in.</p>\n<p>More details on the game mechanics<br/></p>\r\nStory/Lore:\r\n<p>This universe is controlled by Singularity, a cosmic being with nigh unlimited power. Singularity's first action within this universe was forging a creature from fire; Pyrorb. Singularity infused within Pyrorb the ability to create, and instructed Pyrorb to utilize its unique ability in order to create more inhabitants of Singularity's universe. The most notable creations of Pyrorb were the two guardians, Beta Basher and Valkyrie. Beta Basher acted as an overseer much like Singularity, while Valkyrie was tasked with enacting swift justice against any threats. The two guardians ensured that the many creations of Pyrorb would be safe if anything were to go wrong. There were, however, two other creatures that stood out to Singularity. This was due to their unique properties that none of the other creatures held; An artificial being with incredible combat prowess, and a being controlled by some unseen force. With a hint of mischievousness, Singularity granted both of these beings a great portion of its power, corrupting them in the process. \"Perhaps it may be interesting to test this universe I have been given, and see if it can remain intact\"...</p>\n\r\nAdvanced Mode\r\n<p>WARNING: Advanced Mode is a much harder difficulty of the main game, with altered enemy attack patterns. The only changes in this mode are attack patterns and music. If you don't know which mode to choose, Normal Mode is recommended as the base game provides a decent challenge for most.</p>", "metacritic": null, "released": "2022-07-29", "tba": false, "updated": "2022-08-01T11:41:35", "background_image": "https://media.rawg.io/media/screenshots/349/34931da6e30169e6e12d7566254ba154.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JagaroGon"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}