{"id": 82961, "slug": "pfrpg-rd", "name": "PFRPG rd", "name_original": "PFRPG rd", "description": "All pf rulebooks at the cost of a beer. NO IN APP PURCHASE FOR NEW RULEBOOKS!!!!<br/>Always updated!!<br/><br/>NOTE: This app is just in ENGLISH.<br/><br/>PFRPG rd is the ultimate reference document for d20 3.75 system RPG. The application will give you ALL rulebooks released under OGL and will do it without inApp purchase. (Third party matherial COULD BE NOT OGL, so we can't provide it).<br/><br/>When a new content will be released as OGC the app will be updated to include this content, after a reasonable time for developing the support to it; I assure you that there will never be a inAPP purchase system.<br/>PFRPG is always up to date, and gives you the best searching system ever proposed for an application of this type. Fast, easy to use the searching system is a realtime search. The result will be instantaneous.<br/>You can also save your own bookmarks, organize them in folders, and it is iPhone and iPad native.<br/><br/>Save your time for searching on real rulebooks. This application will give you all you need.<br/><br/>APP Contents:<br/>- Player handbook<br/>- Advanced Player Guide<br/>- Advanced Class Guide<br/>- Advanced Race Guide<br/>- Game Mastery Guide<br/>- Ultimate Magic<br/>- Ultimate Combat<br/>- Ultimate Equipment<br/>- Ultimate Campaign<br/>- Bestiary (Reprint)<br/>- Bestiary 2<br/>- Bestiary 3<br/>- Bestiary 4<br/>- Bestiary 5<br/>- Pathfinder Unchained<br/>- Occult Adventures<br/>- Monster Codex<br/>- Technology Guide<br/>- NPC Codex<br/>- Mythic Adventures<br/>- Indices<br/><br/>Follow me on twitter: GringoireDM", "metacritic": null, "released": "2011-12-15", "tba": false, "updated": "2019-10-22T14:22:47", "background_image": "https://media.rawg.io/media/screenshots/aaf/aaf4faab35b1e5f5951bc19c04b6bc5a.jpg", "website": "http://pfrpg.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lanza Giuseppe"], "genres": ["RPG"], "publishers": ["Giuseppe Lanza"], "esrb_rating": "Everyone 10+"}