{"id": 8296, "slug": "dolphin-ride", "name": "Dolphin Ride", "name_original": "Dolphin Ride", "description": "*** Help the little dolphin to take his friends safely home. Avoid obstacles and swim as far as you can.<br/><br/>Dolphin Ride is a fun, happy and addicting game with beautiful graphics, cute characters, and catchy music and sound effects.<br/>Easy one button control and fluid ride through a magical underwater world.<br/><br/>***** Featured at appadvice.com: http://appadvice.com/appnn/2011/11/quickadvice-dolphinride *******<br/><br/>The Story:<br/>Once upon a time, a little dolphin got stuck in an oil spill far away in the sea.<br/>He was very scared because he couldn&amp;#39;t move in the thick sticky oil.<br/>But he was very lucky because his friends (the crab, the octopus and the starfish) suddenly appeared from below.<br/>It took them a lot of time to save him from the evil black oil monster. But finally they managed to pull him out of the oil and take him to a safe and clean place to recover.<br/>The little dolphin got well soon and he was very grateful that they saved his life. As a thank you he promised to give them a ride to their home any time they want.<br/>They lived happily ever after.<br/><br/>Dolphin Ride Objectives:<br/><br/>- Swim as far as you can<br/>- Pick up your friends  (the crab, the octopus and the starfish) and take them home<br/>- Avoid obstacles<br/>- Collect 5 stars to get extra life<br/>- Get all the 9 achievements<br/>- and most importantly have fun and enjoy the ride.<br/><br/>YouTube search: &amp;quot;Dolphin Ride game&amp;quot;", "metacritic": null, "released": "2011-11-05", "tba": false, "updated": "2019-10-22T14:29:46", "background_image": "https://media.rawg.io/media/screenshots/210/21014dd29458d4566020b58909c28cd7.jpeg", "website": "http://www.youtube.com/watch?v=mgVRvNZu_R0", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andy Reeves"], "genres": ["Adventure", "Arcade"], "publishers": ["Andy Reeves"], "esrb_rating": "Everyone 10+"}