{"id": 8298, "slug": "rise-of-darkness", "name": "Rise of Darkness", "name_original": "Rise of Darkness", "description": "Rise of Darkness is the newest action MMORPG.Powered by Unity 3D engine, players can transform into 5 different Fiends, battle bosses and minions in Story Mode, occupy stages for desirable loots in Inferno Mode, fight against players from around the world in Arena and Soul Reap, or team up with partners in Multiplayer instances. <br/><br/>The world is in chaos since the invasion of Underworld Demons. And the only hope to restore peace and order lies in a blood crystal that seals ancient Fiends’ power. Take over the blood crystal, unseal the power within, and dominate demons, for justice or for evil.Warriors, gear up and go feed your darkness side!<br/><br/>Features:<br/>●Fiend transformation<br/>Transform into Fiends, deal massive damages and save your life<br/>●Demon Wing<br/>Upgrade your Wings for a dazzling appearance and strengthened power<br/>●Skills and Runes<br/>Enhance your skills with Runes to unleash powerful skill combos<br/>●Trial Mode<br/>Challenge yourself and collect mountains of loot<br/>●Inferno Mode<br/>Battle both players and monsters, capture dungeons and get rewards for your dominance<br/>●Demonic Tower<br/>Defeat bosses and minions, obtain rare items, and beat your friends to the highest level<br/>●Arena<br/>Fight 1on1, climb up the leaderboard and receive top rewards<br/>●Multiplayer Dungeons<br/>Team up with your friends and share the luxurious rewards<br/>●Guild System<br/>Join in a guild for dungeon crawl and boss fights. Eliminate enemies in guild wars with those who share your love and hate<br/>●Title System<br/>Unlock achievements and earn glory titles<br/><br/>Connect with Rise of Darkness!<br/>Facebook: https://www.facebook.com/riseofdarknessgame?fref=ts <br/>E-mail:cmgeservice@gmail.com", "metacritic": null, "released": "2015-05-24", "tba": false, "updated": "2019-10-22T14:29:46", "background_image": "https://media.rawg.io/media/screenshots/9ff/9ff17b1183f21e7a3bb80e32ed47b4d4.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 265, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ruilin QIN"], "genres": ["Action", "RPG"], "publishers": ["Ruilin QIN"], "esrb_rating": "Teen"}