{"id": 8299, "slug": "elevator-run", "name": "Elevator Run", "name_original": "Elevator Run", "description": "Elevator Run now for free !!!<br/><br/>Game Introduction：<br/>****This is a casual game mainly about operating the elevator to pick up guests from different floors and send them to the exit floor. A variety of people will randomly appear at different floors, and they all aim at going to the exit floor. However, the elevator space is limited. Therefore, there are a limited number of guests for each delivery. How to pick up and send the guests is a skill to learn, because the guests take the elevator very fast but get out of the elevator relatively slow. It will take much time to send the guests. Guests who are waiting for the elevator will crowd the floors when you are sending the slow-paced guests. It really sucks! BANG!! Game over!! <br/><br/>****In order to avoid the said situation, you must note that some guests resemble each other in looks. Yes, they resemble each other in looks. You’re reading this correctly! Why they look alike has nothing to do with us, what we need to study is that how to pick up the same guests, because picking up guests in similar looks will speed up sending the guests. Right, you have found that. That’s unreasonable, but this is the game. Stop asking so many questions, just have fun. If you are skilled, you will find that it’s a piece of cake to send the guests in rocket speed. “Sending the guests in rocket speed” is our common goal. <br/><br/>****Gamers can freely choose the different difficulty levels. You may like the easier one or more difficult one or you may like the challenging level. You will always find the ideal difficulty level in this game. <br/><br/>****Hope you love this game. Thank you!", "metacritic": null, "released": "2013-04-25", "tba": false, "updated": "2019-10-22T14:29:47", "background_image": "https://media.rawg.io/media/screenshots/94a/94a8b7fef7f9dc69a767a4406946aa7f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fuzhou Cangshan Lustone Software Co"], "genres": ["Action", "Strategy"], "publishers": ["Fuzhou Cangshan Lustone Software Co"], "esrb_rating": "Everyone 10+"}