{"id": 82995, "slug": "speed-racing-ultimate", "name": "Speed Racing Ultimate", "name_original": "Speed Racing Ultimate", "description": "\"Speed Racing Ultimate\" is the only game that offers Incredible speed and steering sensations!<br/>Pilot 8 different Prestigious cars on not less than 10 tracks around the world!<br/><br/>Challenge the best drivers and try to win to increase your money!<br/>A \"Shop\" is available on the main menu.<br/>If you have enough money, you could get more powerful Car!<br/><br/>Fasten your seatbelt and take the control of your eXtremely Powerful Car!<br/>You have mastered acceleration, braking and steering!<br/>Don't forget that the Drift is your friend!<br/><br/>Attention! The speed will be your ally, only if you master!<br/><br/>The tracks are more and more  technical and require an optimal concentration!<br/>I suggest you to start with the initiation track to learn to control your Powerful Car.<br/>It's available on the main menu by clicking on the \"Help\" button.<br/><br/>After that, try to get the Gold Cup of the ULTIMATE track!<br/><br/>You can select the level of difficulty: Beginner, Expert or Pilot.<br/>Your choice is very important:<br/>If you choose \"Pilot\", all races will be more difficult but you will win more money!<br/>If your are in the top 3, you will win a special Bonus!<br/><br/>You also can choose the \"Fight\" Level and Try to be the Best!<br/>In this level, there is no Limit.<br/>Only one rule: IT MUST REMAIN ONE!<br/><br/>Are you ready to challenge the best drivers of Real Racing Game?<br/><br/>The time of each race is recorded.<br/>Share your score online and try to stay in the world ranking!<br/>So you can compete with players around the World!<br/><br/>Incredible speed and steering sensations await you!<br/><br/>Have Fun!<br/><br/>••• Game Features •••<br/><br/>• Drive 8 different Prestigious cars!<br/>• Total Control of your Racing Car<br/>• Full 3D Real Time rendering<br/>• 10 different tracks<br/>• Incredible arcade physics<br/>• Spectacular SFX<br/>• Save as much money and Power go up<br/>• Customize your Racing Car<br/>• Training mode<br/>• Realistic sound environment<br/>• Music by \"REVENGE\"<br/>• Boost Bonus<br/>• Select the difficulty level<br/>• Select the accelerometer sensibility<br/>• Select the Camera: Inside or Outside<br/>• Upload your Score and enter in the World Ranking", "metacritic": null, "released": "2013-10-20", "tba": false, "updated": "2019-08-30T02:45:01", "background_image": "https://media.rawg.io/media/screenshots/d3b/d3b4b235f0739b02522603d260068a68.jpg", "website": "http://www.dream-up.eu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dream-Up"], "genres": ["Sports", "Racing"], "publishers": ["Dream-Up"], "esrb_rating": "Everyone 10+"}