{"id": 830084, "slug": "tvo", "name": "Tvö", "name_original": "Tvö", "description": "<h3>Decipher the puzzles of an ancient maze to save your soul.</h3><br/>You and your partner awake on separate sides of a mysterious maze. Surrounded by shadows, spectral whispers, and magical orbs that help you communicate with each other, the two of you must traverse the winding corridors and find a way out. The only question that remains… will your soul be saved?<br/><br/><br/><br/>Tvö is a cooperative puzzle game. Two players find themselves trapped on opposite sides of an elaborate maze. Together, they must solve puzzles hidden in its depths in order to discover a way out. Both sides of the maze have their own secrets that the players can find.<h3>Communicate</h3>Only your words and wits can save you now.<br/><br/><br/><br/>Through floating orbs, the mysterious maze lets you talk to your partner on the other side. Use your communication skills to solve the puzzles you will face.<h3>Solve</h3>The way to salvation is teeming with trials.<br/><br/><br/><br/>Work together with your partner to unravel the puzzles laid throughout the maze. What your partner experiences will be crucial to your success.<h3>Atmosphere</h3>You and your partner are not alone…<br/><br/><br/><br/>Explore the corridors of the maze to find those that came before, and those that still remain. Immerse yourself in the dark ambience of the maze.", "metacritic": null, "released": "2022-07-31", "tba": false, "updated": "2022-08-05T04:26:55", "background_image": "https://media.rawg.io/media/screenshots/034/034969cbaa2a24f61964509cb47d43c3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 344, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Artless Gallery"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Umbra Evolution"], "esrb_rating": null}