{"id": 830032, "slug": "nekketsu-inou-bukatsu-tan-trigger-kiss", "name": "Nekketsu Inou Bukatsu-tan Trigger Kiss", "name_original": "Nekketsu Inou Bukatsu-tan Trigger Kiss", "description": "<p>2083 AD.<br />\nAkizuki High’s Superpower Club accomplishes their first victory and dominated the nationwide competition. However, the joy was only momentary. Due to a violent incident involving members of the Superpower Club right after the tournament, they were punished by getting their win revoked and banned from conducting club abilities for two years.</p>\n<p>…From then on, two years pass.<br />\nUpon receiving the previously sealed-away key to the Superpower Club’s room, the club’s captain, Kanzaki Azuma, is given a heartless ultimatum by the school’s principal.</p>\n<p>“If the Superpower Club does not dominate all competition in the coming tournament, I’ll have it abolished.”</p>\n<p>That was the secret agreement made in the past between Azuma and the principal.</p>\n<p>However, the only ones left in the Superpower Club were two members- Azuma himself and the Vice Captain Subaru Yamato. They had no time to worry about completely dominating the competition, as the real issue is the fact that they didn’t even have the minimum amount of required members. Even so, Azuma replied seemingly confident.</p>\n<p>“I’ll get it done.”</p>\n<p>At the same time, a transfer student arrives. The second-year girl’s name was Sendou Futaba. Unexpectedly, Futaba’s mother is a member of the U.N.-supervised “R8″; a group whose members are composed of the strongest superpowered people. Azuma, seeing her as the last resort for the club’s continuation, headed towards her classroom…</p>\n<p>…Without knowing how much she really hates superpower clubs.</p>\n<p>[Translation of the official website&#39;s story summary.]</p>", "metacritic": null, "released": "2014-10-02", "tba": false, "updated": "2022-08-01T20:04:44", "background_image": "https://media.rawg.io/media/screenshots/9cc/9ccab1f6ebb9f6aba376afc956a13735.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 327, "game_series_count": 0, "reviews_count": 0, "platforms": ["PS Vita"], "developers": ["Design Factory", "Otomate"], "genres": ["Adventure", "Casual"], "publishers": ["Idea Factory"], "esrb_rating": "Teen"}