{"id": 830034, "slug": "reviced", "name": "RE:VICE[D]", "name_original": "RE:VICE[D]", "description": "<p>Year 20xx, Kanagawa Prefecture, Atsugi.</p>\n<p>Midnight, as the clock ticks away to reveal a new day.</p>\n<p>In the jet black darkness, the shadows of four people gathered around the light of a candle. A female high school student, a man with a good physique, a young man with long hair and a boy who still had some childishness left in him. Having confirmed the attendance of the members, all of whom varied in age and gender, one of them speaks:</p>\n<p>“Have you found the next devil king?”</p>\n<p>With those words, the four’s appearance had completely changed.<br />\nJet black wings, sharp horns, deep crimson eyes and a sinister carved seal- their appearance could no longer be called human.</p>\n<p>Yes… They are not human.<br />\nThey’re the Four Heavenly Kings, hailing from the netherworld in a different dimension. They have come under the guidance of a book detailing the selection of a devil king, in order to search for a successor. The last devil king had fell in battle against their enemies called the “Light Tribe”.</p>\n<p>Even though its name is known in the netherworld, knowledge of this human world is nonexistent. Each of them concealed themselves in order to gather intelligence, however, results didn’t come to them as easy as they had hoped. The protagonist and one of the Four Heavenly Kings, Aika, started to feel impatient with the lack of progress.</p>\n<p>One day, the Four Heavenly Kings were each able to locate “a human with the qualities to become the devil king”.</p>\n<p>However, at present, there is no way to tell which of the four “candidates” is the real devil king. Aika and the rest of the Four Heavenly Kings, obeying the writings of the devil king selection book, decide to explore the qualities of the devil kng candidates.</p>\n<p>[Translation of the official website&#39;s plot summary.]</p>", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2022-08-01T21:44:43", "background_image": "https://media.rawg.io/media/screenshots/d11/d11dcb936df056840948701df49461d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 0, "platforms": ["PS Vita"], "developers": ["Design Factory", "Otomate"], "genres": ["Adventure", "Casual"], "publishers": ["Idea Factory"], "esrb_rating": "Teen"}