{"id": 83005, "slug": "sabertooth-tiger-simulator", "name": "Sabertooth Tiger Simulator", "name_original": "Sabertooth Tiger Simulator", "description": "Travel back in time to a lost world of dinosaurs and live life as a Sabertooth Tiger! Survive in a prehistoric environment filled with massive carnivores and dangerous barbarians! Raise your family, stalk your prey, and battle for your life against ancient predators like the Tyrannosaurus Rex, Mastodon, and the Spinosaurus!<br/><br/>Download the Sabertooth Tiger Simulator today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy if you're going to survive in the prehistoric land of giant carnivores!<br/><br/>EPIC BATTLES<br/>Use your razor sharp claws and massive teeth to hunt down and fight deadly prehistoric dinosaurs! Deliver the killing blow by leaping through the air and pouncing on your enemy!<br/><br/>START YOUR FAMILY<br/>Find another sabertooth to bond with and raise your very own family! Breed sabertooth cubs and watch them grow in size and strength while they help you survive in the wilderness!<br/><br/>LEVEL UP YOUR TIGERS<br/>Gain experience by defeating dangerous predators, eating small dinosaurs, and completing missions. Level up your tigers to increase their health and attack damage, unlock new fur colors, and gain new powers like Stealth Mode!<br/><br/>MISSIONS AND ACHIEVEMENTS<br/>Introducing unlimited missions and over two dozen achievements to give you a boost of experience! With the level cap increased to 200, you’ll need all the help you can get!<br/><br/>FOUR BOSS BATTLES<br/>Ready to put your sabertooth to the test? Enter into combat with 4 deadly bosses that will push you to your limits! Succeed in slaying them and your rewards will be plentiful!<br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>Introducing a brand new procedural weather system with unique storms, clouds, and celestial movement. Realistic storms will bring a downpour of rain, flashes of lightning, booms of thunder, blankets of snow and more! Run for your life when the all new Meteor Shower event rains flaming rocks down from the sky! <br/><br/>HUGE 3D ENVIRONMENT<br/>Your sabertooth is free to roam a massive open-world environment that is more than triple the size of the previous simulators! Discover lava filled volcanos, frosty mountaintops, and dense forests!<br/><br/>NEW TOUCH-BASED CONTROLS<br/>Brand new intuitive controls let you navigate your animal like never before! Pinch to zoom and play from your sabertooth's perspective or get a bird's eye view of the action!<br/><br/>20 UNIQUE PREHISTORIC SPECIES<br/>Cower in fear of a massive all-new collection of extinct animals! Hunt down velociraptors, tyrannosaurus rex, stegosaurus, triceratops, mastodons, woolly rhinos, ceratosaurus, brontosaurus, pterodactyl, spinosaurus, allosaurus, cavemen, smilodon and many more!<br/><br/>JURASSIC SURVIVAL GUIDE<br/>Look to your handy survival guide for information on enemy dinosaurs, a map of the world, sabertooth customizations, achievement progress, and much more!<br/><br/>HD GRAPHICS<br/>Stunning High Definition graphics will transport you millions of years back in time to the land of dinosaurs! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>Looking for more realistic action? If you are of age or have your parents permission, turn on the blood effects for some added combat ferocity!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Sabertooth Tiger Simulator to experience the thrilling life of the most deadly feline predator planet Earth has ever seen, the Sabertooth Tiger!<br/><br/>If you liked living as a Sabertooth Tiger then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies, check out the Snow Leopard Simulator and pounce on your prey from high mountaintops, or slither around a tropical rainforest with the Snake Simulator!<br/><br/>Follow us on Facebook for more awesome animal games and simulators!<br/>facebook.com/glutenfreegames", "metacritic": null, "released": "2015-01-06", "tba": false, "updated": "2019-08-02T06:20:39", "background_image": "https://media.rawg.io/media/screenshots/369/36900d0766cf689b59d1bf956715cac4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": null}