{"id": 830108, "slug": "rooftop-garden-simulator", "name": "Rooftop Garden Simulator", "name_original": "Rooftop Garden Simulator", "description": "Who said the city can’t be its own escape? In Rooftop Garden Simulator, you can transform your urban corner into a warm and relaxing agricultural space. Build, explore, and connect with the sprawling, citified landscape in a stylized simulation that’s designed to be fun for gamers of all ages.<br/> <br/>The top of the concrete jungle offers plenty of opportunities for those who seek both a chill space to kick back and a flourishing business to support the local community. Through robust building mechanics, you can convert your urban rooftop into a vibrantly serene space that would make even the most elaborate suburban backyards blush. Place garden beds, manage the position of your crops, decorate your rooftop your way, and make it the tranquil escape you’ve always wanted.<br/> <br/>Converting your urban rooftop into a garden doesn’t have to mean you can’t turn a profit. Your local city community can always use a taste of fresh produce. Rooftop Garden Simulator’s seed and crop system gives you all the tools you need to become a modern-day farmer. Explore the nooks and crannies of the city and its parks to find locals and put your finger on the pulse of what’s in demand.<br/> <br/>Take back the city in new and unexpected ways by developing your very own rooftop garden and discover the urban farmer within you.<br/> <br/><br/><br/>Features<br/>● Build a lush rooftop garden - Choose from a wide range of garden beds and furniture that fit your style and arrange them into your ideal urban hangout.<br/>● Grow and farm fresh produce - Use the game’s robust seed growing system to cultivate fruits and vegetables that are in demand in your community or simply grow whatever feeds your soul.<br/>● Explore a live and vibrant city - Take a stroll through the streets and parks of an urban landscape to meet new faces and uncover potential rooftop plots to expand your city garden business.<br/>● Serve your local community - Accept quests from the people around you to help them out and make a name for yourself with your rooftop gardening skills.<br/>● Develop an urban farming business - Plant, grow and sell products that are in demand to develop your garden into a robust business that expands into its own little urban empire.<br/><br/><br/><br/>", "metacritic": null, "released": "2022-08-01", "tba": false, "updated": "2022-08-05T04:51:43", "background_image": "https://media.rawg.io/media/screenshots/a16/a16776d790f56621a7ba0ecabc7e2925.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 273, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SoftStoneGames"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["SoftStoneGames"], "esrb_rating": null}