{"id": 830182, "slug": "the-mortuary-assistant", "name": "The Mortuary Assistant", "name_original": "The Mortuary Assistant", "description": "Having completed your degree in mortuary sciences, you have taken on an apprenticeship at River Fields Mortuary. Over the past several months you have logged many hours aiding the Mortician in daily tasks along with learning the ins and outs of the embalming process as well as how to properly handle and care for the deceased.<br/><br/>Late one night, you are called into work to handle some embalmings. Death doesn’t keep day time hours. But there is something different about these bodies because there is something different about you. The phone rings with the Mortician on the other end. The rumors are true, and you can not leave.<br/><br/><br/><br/><ul><li>Perform embalming tasks while keeping demonic forces at bay<br/></li><li>Practice occult rituals to identify demonic entities<br/></li><li>Piece together clues to banish the demon and save your soul<br/></li><li>Uncover the gripping history of Rebeccca Owens, the haunting past of River Fields, and a sinister secret that lies just beneath the surface…<br/></li><li>Ground breaking system makes every playthrough unique, guaranteeing you will never feel completely safe.<br/></li><li>A story that unfolds through multiple playthroughs. Each demon you banish is just a piece of the puzzle<br/></li><li>10+ hours of content with more to find for inquisitive eyes</li></ul><br/><br/>Perform embalmings, handle the various jobs around the mortuary, and exorcise demonic forces. All in a day’s work.", "metacritic": null, "released": "2022-08-02", "tba": false, "updated": "2024-03-30T01:27:46", "background_image": "https://media.rawg.io/media/screenshots/412/412927cbf20b9e72371dd8e5a1c1bf31.jpg", "website": "", "rating": 3.91, "rating_top": 4, "added_by_status": {"yet": 17, "owned": 107, "beaten": 32, "toplay": 24, "dropped": 6, "playing": 1}, "playtime": 4, "achievements_count": 13, "ratings_count": 29, "suggestions_count": 590, "game_series_count": 0, "reviews_count": 32, "platforms": ["Android", "PC"], "developers": ["DreadXP", "DarkStone Digital"], "genres": ["Adventure", "Simulation", "Indie", "Puzzle"], "publishers": ["DreadXP", "DarkStone Digital"], "esrb_rating": null}