{"id": 830186, "slug": "koncolos", "name": "Koncolos", "name_original": "Koncolos", "description": "At the place where Aras works, a woman makes a scene every night. Aras feels an oddness in what little information he has managed to find out and realizes that every clue points to a single fact. Monsters are real, and they live among us. Aras learns that in all those spooky stories that he has been listening to since his childhood, these creatures who have troubled people continue in their way.<br/><br/><br/><br/>Text-based story rich gaming experience<br/>Dialogues with multiple choices<br/>Interaction with hand drawn comic book assets<br/>Anime style characters<br/>Original ambient soundtrack<br/><br/><br/><br/>Aras held most characteristic of the capital in which he lived with 5 millions other inhabitants in the center of Anatolia. Neither of them had any particular features one could think of right away. Everyone knew their names but nobody really cared about them. They both had a vision of sorts at one time, but they seemed to abandon it. Even the unfavorable aspects of cities, and of humans, can express a great deal, however this was not one of those cases. Being exposed to their bleak aura wasn't like choking in a depressive spiritual trench, but evoked the feeling of drowning in a muddy puddle along the sidewalk. They were not tedious, but also not lively.  If you'd ask them how they'd have been, they would answer with \"living somehow\".", "metacritic": null, "released": "2022-08-02", "tba": false, "updated": "2022-08-05T06:22:32", "background_image": "https://media.rawg.io/media/screenshots/213/213e8a43ff886d956a3947c76759027c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deniz Kayacan"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Deniz Kayacan"], "esrb_rating": null}