{"id": 830125, "slug": "obama-maze", "name": "Obama Maze", "name_original": "Obama Maze", "description": "<h3>Overview</h3>Welcome to Obama's collection of horror mazes! (for legal reasons this game is not tied to the former president at all.) You (The Obama Hunter) Must navigate through the former president's mazes in order to collect all of his \"Obama Prisms.\" These mystical rocks go by many names, \"Obamiums\", \"Obama Prisms\", and or \"Obama Pyramids\".  However, the name of them doesn't matter when you are being chased in hot pursuit by the former president.<br/><br/>This game is a joke horror-comedy game. While its main idea was originally a joke, it's an amazing one and I have turned it into a game. You the player are a first-person character who seeks to collect 7 of said above \"Obamiums\" you face 3 Mazes in this Early Access.<h3>The 3 maps</h3><ul><li> <h3>Normal Maze.</h3> Welcome to Obama Maze. This will most likely be your first real course in the game. You will start in a randomly generated brick maze. You must navigate the never seen before generated maze and collect all 7 Obamiums but watch out! You will be chased by none other than former United States President Barack Obama. This maze will not only generate Obamiums but you also will find traps! Traps can be used to slow down Obama so he cannot catch you. Once you collect all of the Obamiums you will hear the maze door opening and it is your job to locate the door and escape the maze.<br/></li><li><h3>Endless Maze.</h3> This maze is similar to the first Normal Maze level however instead of collecting 7 Obamiums there isn't a score limit. 6 Obamiums will be spawned at once so if you cannot find one you surely will find another one.<br/></li><li><h3>Forest Maze.</h3> This maze is unique like the last. Instead of a standard brick maze, you will be navigating a forest. This forest is wide open and dark, you'll easily lose your sense of direction here. Be sure once you collect all 7 Obamiums you head back to the truck which you spawned at.</li></ul><br/>Once you complete all 3 Mazes you're awarded with self esteem of beating a video game... for now.", "metacritic": null, "released": "2022-08-01", "tba": false, "updated": "2022-08-05T05:12:21", "background_image": "https://media.rawg.io/media/screenshots/59c/59c3a266a0406458855164a4ecd0628f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 5, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anthony Stainton"], "genres": ["Casual", "Indie"], "publishers": ["Anthony Stainton"], "esrb_rating": null}