{"id": 830131, "slug": "the-good-people-na-daoine-maithe-2", "name": "The Good People (Na Daoine Maithe)", "name_original": "The Good People (Na Daoine Maithe)", "description": "<h3>INTRODUCTION</h3><br/><br/><br/><br/>The Good People (Na Daoine Maithe) is a lore-rich and choice-driven romantic visual novel inspired by Irish mythology. Play as an Irish tenant farmer from the mid-19th century, whose path becomes inexplicably entwined with fairy affairs after getting robbed by the roadside and lured into the mythic and war-torn world of Tír na nÓg: A once unified land, now divided into the Seelie and Unseelie Courts. Will you escape with your stolen belongings? Or does fate have something else in mind?<h3>MEET THE LOVE INTERESTS</h3><br/><br/><br/><br/>While trapped in this strange and storied world, you meet six members of the Tuatha Dé Danann (\"People of the Goddess Danu\"), all of whom are split evenly between the rivalling Seelie and Unseelie Courts...<br/><br/><ul><li><strong>SHAE FÉARGLAS</strong>... an honourable Seelie soldier questing to find a lost princess.</li></ul><ul><li><strong>KEAGAN MÁISTIRÚIN</strong>... the Seelie Court spymaster with a plethora of enemies.</li></ul><ul><li><strong>AÍFE EALABHÀN</strong>... Queen of the Seelie, a rumoured usurper falsely ordained by the gods.</li></ul><ul><li><strong>MAEVE TROIDUAIR</strong>... an Unseelie folk hero endowed with the power of the Morrígan.</li></ul><ul><li><strong>FLANNÁN MAC LUGH</strong>... the newly crowned Unseelie King, and son of the Unseelie’s infamous rebel leader, Lugaid.</li></ul><ul><li><strong>ROBIN GOODFELLOW</strong>... a shapeshifting trickster of unknowable origins, whose primary goal is making mischief for the Unseelie.</li></ul><br/>Choose who you trust wisely. Fairies are known to be a capricious sort, after all.<h3>ADDITIONAL INFORMATION</h3><br/><br/><ul><li>The main character's name and pronouns (she/her, he/him, or they/them) are determined by the player. <strong>NOTE: Due to a case of mistaken identity, the player's pronouns will be referred to as \"they/them\" by several characters in the DEMO.</strong></li></ul><ul><li>All six love interests are viable romance options, regardless of the main character's gender.</li></ul><ul><li>Shae and Robin are non-binary characters, and respectively use they/them and any/all pronouns. Shae is also asexual.</li></ul><ul><li><strong>This free demo consists of the introductory \"preface\" of The Good People (Na Daoine Maithe). It is 2.5 to 3 hours of total gameplay, and ends at the point in which the player would select a route.</strong></li></ul><ul><li>Prepare yourself for horse related shenanigans.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-05T05:19:17", "background_image": "https://media.rawg.io/media/screenshots/788/7880e3dd37d83c5e28624dadbdc83ff8.jpg", "website": "https://moiraimyths.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Moirai Myths"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Moirai Myths"], "esrb_rating": null}