{"id": 830224, "slug": "aznak", "name": "Aznak", "name_original": "Aznak", "description": "Aznak is a game created by a fan of RPG games.\r\nUtilizing the RPG Maker system they were able to create their own tale and allow others to play through this great adventure.\r\n\r\nStory\r\n\r\nThe world was created by Aznak an ancient being, who created guardians to watch over the planet in its absence. The guardians would be worshiped by mortals gathering spiritual energy into an artifact at the highest point on the planet every 100 years, a portal would open to Aznak. The artifacts gathered energy would be offered up to Aznak. Golgrim ( Aznak's Son) grew jealous and persuaded mortals to betray the other guardians and tradition allowing it to take on all of the spiritual energy gathered. After a great war broke out, Golgrim absorbed the energy wounding all the other guardians, and began battling against Aznak. In this great battle, Aznak sacrificed itself to defeat Golgrim and hold off the greater threat. Aznak and Golgrims essence poured into the world's atmosphere creating demi-humans and beastmen and the artifacts were broken into fragments scattered across the world. With the absence of Aznak, the threat still lurks in the distance approaching sooner than we would expect.\r\n\r\nJoin Ivan Abel, a young village boy whose mother was abducted by a mad king and his knights. He must venture around the globe in order to regain what was stolen from him and bring peace back to the world. Gathering companions at different locations to create our cast of party members he is able to experience all different types of regions and cultures. \r\n\r\nGameplay Features\r\n・Abilities\r\nLearn new abilities by leveling up your characters, who all have different classes and different roles to play in battle.\r\n\r\n・Limit\r\nFill your TP gauge and use your Limit breaks to unleash devastating attacks or change the tide of battle.\r\n\r\nAdditional Features\r\n・Autosave", "metacritic": null, "released": "2022-08-03", "tba": false, "updated": "2022-08-05T07:08:07", "background_image": "https://media.rawg.io/media/screenshots/2a4/2a4446cd87607120e1e12ac63baef199.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel McDonald"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Casual", "Indie"], "publishers": ["Daniel McDonald"], "esrb_rating": null}