{"id": 830214, "slug": "cardow-battle-of-decks", "name": "Cardow! - Battle of Decks", "name_original": "Cardow! - Battle of Decks", "description": "<strong>Cardow!</strong> is a mixture of chess, card and turn-based strategy game. Use your cards wisely and use the board to your advantage. Build your way to your opponent or cut him off.<br/>Create a deck of cards that fit your play style or choose a hero with an ability that changes the way you play.<br/><br/><br/><br/><br/><br/><ul><li> Create your own deck from a variety of cards, which are constantly being expanded.<br/></li><li> Jump into the single player and compete against the computer.<br/></li><li> Compete with your friends in an online battle with up to 4 players.<br/></li><li> Create your own playfields and ensure variety.<br/></li><li> Create your own campaigns and szenarios to your desire and share them with other players.</li></ul><br/><br/><br/><br/>Each turn you'll receive new cards in your hand, which you can either play or save for the right moment. Plan your move in advance and build your paths carefully, because your opponent can also use them.<br/>The goal is to eliminate the enemy hero without losing your own.<br/><br/>You can summon monsters from your hand by either dragging them on a spawn platform or clicking the card an then the platform.<br/><br/><br/>In the Attack Phase, you can attack enemy monsters within range. If the opponent's monster is also in range, it attacks you back with 25% of the attack.<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-05T06:56:47", "background_image": "https://media.rawg.io/media/screenshots/4ad/4ad2d59e63bedf665e1e15e7e022a3bc.jpg", "website": "https://devforce.de/cardgame", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DevForce"], "genres": ["Strategy"], "publishers": ["DevForce"], "esrb_rating": null}