{"id": 830265, "slug": "deadwater-saloon-prologue", "name": "Deadwater Saloon Prologue", "name_original": "Deadwater Saloon Prologue", "description": "<strong>This is a free introductory version of the full-game Deadwater Saloon</strong>. Play the first month-and-a-half of the in-game time, build your saloon, and watch and interact with the town as it starts to grow.<h3>Create Your Character</h3>Playing as a rich and dynamic character in the old west, you will be able to fully customize your attributes to fit your playstyle, such as Mixology, Seduction, and Sneakiness. You will manage your life as well as your saloon, such as maintaining your reputation and getting married. You will struggle with the effects of disease, aging, sanity, and addictions.<h3>Form Relationships</h3>Provide travellers with a distinct drink parlour, gaining legendary stories to regale and build your legend. Interact with townspeople as they populate the town, forging friendships with blacksmiths, sheriffs, and preachers, romance prospective partners, or blackmail, abduct, and murder those who threaten you.<h3>Build</h3>Build your saloon from the ground up. Expand the walls, build bordellos, opium dens, high stakes gambling rooms, and railed porches. Buy and place spittoons, tables, chairs, handcrafted bars, pianos, chandeliers, and diamond dust mirrors.<h3>Manage</h3>Thrive within a complex economy system, stockpiling booze, food, guns, and opium. Research a diverse array of drinks and foods to serve customers. Hire and manage staff from within the town populace, including barkeeps, cooks, servers, prostitutes, croupiers, pianists and bouncers. Help them reach their full potential, or fire and replace them with those more skilled.<h3>Exist Within A Town</h3>Start with a strip of land and watch as a western town builds up around you, bringing in a myriad of citizens and businesses.<h3>Hundreds of Events</h3>Face the forces of nature, meddlesome customers, firebrand Preachers, rival outlaw gangs, and much more. At some point, you will be tested by stronger and more formidable nemesis in longer event chains. Whatever you choose, you will face the consequences of your choices. The frontier is an unforgiving place.<br/><br/>", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T07:59:33", "background_image": "https://media.rawg.io/media/screenshots/e7a/e7acd350528c8a80935c64b23a10db0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 64, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creative Storm Entertainment", "Tanglefoot Games"], "genres": ["Simulation"], "publishers": ["PlayWay", "CreativeForge Games"], "esrb_rating": null}