{"id": 830239, "slug": "jiang-hu-qun-xiong-chuan", "name": "江湖群雄传", "name_original": "江湖群雄传", "description": "The legend of heroes in the Jianghu is a martial arts open world role-playing game.<br/><br/>Sirius is now in turmoil in the Jianghu. Only by collecting the legendary [fourteen heavenly books] can we resolve this Wulin catastrophe. You will play an unparalleled hero in the game, meet all the heroes of the Wulin, practice martial arts and magic skills of all schools, travel in the Jianghu with magic soldiers, fight against demons and Demons everywhere, and save the world from water and fire.<br/><br/><br/><br/>Game features:<br/><br/><br/><br/>(1) Open plot system: players can use different means to gain a foothold in the Jianghu, or join a famous sect to kill evil, or be willing to be a reckless hero, what's more, live in seclusion in the mountains and forests to practice divine skills, and when out of the Jianghu, there will be an immediate Bloodbath<br/><br/><br/><br/>(2) All the famous heroes in the Jianghu are recorded: the heroes and martial arts masters in TV dramas and movies are impressive. Here you will go deep into the Wulin, form your own strongest lineup, fight with all kinds of famous swordsmen, set off a bloody storm in the Jianghu, and establish your own position in the Jianghu.<br/><br/><br/><br/>(3) Martial arts secrets are all in hand: many martial arts fans are full of curiosity about the weird acupoint pointing magic skill, the lightness skill of stepping on the snow without trace, the unpredictable poisoning, and the magical array in the novel. The most important thing in the game is the martial arts script. If you want to obtain peerless martial arts, you have to look for opportunities. Here you can learn up to 182 unique martial arts secrets and create your own move system.<br/><br/><br/><br/>(4) Rich life cultivation system: in the game, players can develop their own sidelines through various interesting games, such as mining, medicine mining, fishing, hunting, etc.", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T07:25:40", "background_image": "https://media.rawg.io/media/screenshots/6e5/6e5e321faf000457840d8802d7251c49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 323, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["黑白牛游戏"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["黑白牛游戏"], "esrb_rating": null}