{"id": 830266, "slug": "a-mage-reborn", "name": "A Mage Reborn", "name_original": "A Mage Reborn", "description": "Walk the path of a legendary mage, and uncover the dark secrets of your heritage! Will you seek revenge, or pursue a path to reconciliation?<br/><br/>A Mage Reborn is a thrilling 155,000-word interactive fantasy novel written by Adam Alamsyah. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination.<br/><br/>You've spent many years on the run from your turbulent past, outmaneuvering your darkest demons for as long as you can remember. After a short stint of hard-earned peace in a village where no one knows your secrets, you are once again thrown headfirst into danger and excitement. An expansive web of royal politics and magical intrigue threatens to swallow the continent whole, and you find yourself right in the thick of the action.<br/><br/>The world churns with danger and arcane secrets at every turn, and the task of navigating it has fallen to you. Will your fearsome powers see you safely to the other side? What kind of legacy will you leave behind?<br/><br/><ul><li> Play as a man, woman, or non-binary.<br/></li><li> Walk the path of a legendary mage, combining four different schools of magic to devastating effects.<br/></li><li> Find love with a warrior king or an aspiring saintess, weaving the start of a romance that transcends lifetimes.<br/></li><li> Sift through the memories of your past, and decide how they will determine your future.<br/></li><li> Uncover the secrets of your dark heritage, and harness the tremendous powers that course through your bloodline.<br/></li><li> Strike a bargain with arcane deities beyond your ken, and invoke their powers on the field of battle—at a steep price.<br/></li><li> Rise to lofty heights as the right hand of royalty, and navigate a fall from grace that results in your execution.<br/></li><li> Prime yourself for revenge or reconciliation, while the truths of the world slowly unfold around you.</li></ul>", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T08:00:32", "background_image": "https://media.rawg.io/media/screenshots/47b/47b27ef3b25c08647e0c2858efb6a794.jpg", "website": "https://www.choiceofgames.com/user-contributed/mage-reborn", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 57, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Hosted Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": null}