{"id": 830271, "slug": "sherlock-holmes-the-awakened-2", "name": "Sherlock Holmes The Awakened", "name_original": "Sherlock Holmes The Awakened", "description": "<p>Experience a nerve-racking Lovecraftian adventure, rebuilt from the ground up with modern graphics and gameplay. Become Sherlock Holmes, and find yourself at the heart of the terrifying Cthulhu Mythos as you investigate a series of mysterious disappearances in Europe and the US.<br />\nA Lovecraft meets Sherlock Holmes crossover, The Awakened puts you up against the legendary Cthulhu Mythos. Investigate a series of mysterious disappearances, apparently linked to a dark cult that worships an Ancient God. Whatever their plan is, you must put a stop to it… or face unspeakable consequences.<br />\nFor the first time in his life, Sherlock is truly afraid. A man of rationale and reason, he faces an otherworldly entity that defies all logic, and this discovery is as enlightening as it is shattering. The pursuit of the truth pushes Sherlock to the verge of madness, and it’s the only story that Watson will never publish.<br />\nTaking place in 1884, The Awakened lifts the curtain on how Sherlock and John, mere roommates at the time, became the world-famous crime-solving duo.<br />\nKey pillars<br />\nInvestigate the Cthulhu Mythos as imagined by H.P. Lovecraft and face Eldritch horrors beyond human comprehension<br />\nFight encroaching insanity as you pursue answers to questions that have no rational explanation whatsoever<br />\nFind clues that will lead you through the famous Baker Street in London, a haunting psych ward in Switzerland, the perilous Louisiana wetlands and more<br />\nA reimagining of the 2008 title: Rebuilt from the ground up in Unreal Engine, The Awakened boasts modern graphics and animations, an expanded storyline, numerous side quests and new mechanics including unique insanity gameplay.</p>", "metacritic": null, "released": "2023-04-11", "tba": false, "updated": "2024-02-17T16:59:29", "background_image": "https://media.rawg.io/media/games/ced/cede44bc5df6d77540f585f24bc4ecda.jpg", "website": "", "rating": 3.4, "rating_top": 4, "added_by_status": {"yet": 19, "owned": 26, "beaten": 24, "toplay": 66, "dropped": 6, "playing": 1}, "playtime": 14, "achievements_count": 56, "ratings_count": 20, "suggestions_count": 529, "game_series_count": 1, "reviews_count": 20, "platforms": ["PlayStation 4", "PlayStation 5", "Xbox Series S/X", "PC", "Nintendo Switch", "Xbox One"], "developers": ["Frogwares"], "genres": ["Adventure"], "publishers": ["Frogwares"], "esrb_rating": null}