{"id": 83032, "slug": "wildlife-simulator-shark", "name": "Wildlife Simulator: Shark", "name_original": "Wildlife Simulator: Shark", "description": "Explore the depths of the ocean and live life as a Great White Shark! Survive in a massive underwater world filled with dangerous predators and tasty fish. Terrorize the beaches, raise a family, hunt your prey through tropical coral reefs, and battle for your life against fierce carnivores like orca whales, dolphins, and octopuses!<br/><br/>+++ #1 Role Playing Game (RPG) on iPad in the US and 32 other countries! +++<br/><br/>Game Features<br/>+ REALISTIC SIMULATOR - You'll need to maintain your health, hunger, oxygen, and energy if you're going to stay at the top of the food chain!<br/>+ EPIC BATTLES - Use your powerful jaws and swift speed to catch tasty fish and fight dangerous animals!<br/>+ START A SCHOOL OF SHARKS - Find a mate to bond with and raise your very own family of sharks to help you hunt! Watch your babies grow in size and assist you in combat!<br/>+ LEVEL UP YOUR SHARKS - Gain experience by defeating other animals and level up your sharks to increase their health, attack damage, and even unlock new shark skins!<br/>+ SHARK SURVIVAL GUIDE - Look to your handy survival guide for information on enemy wildlife, a map of the ocean, family status, and much more!<br/>+ HUGE 3D ENVIRONMENT - Your shark is free to explore a gigantic open world ocean filled with dangerous carnivores, coral reefs, and a tropical island!<br/>+ NEW TOUCH-BASED CONTROLS - Brand new intuitive controls let you navigate your animal like never before! Pinch to zoom and play from your shark's perspective or get a bird's eye view of the action!<br/>+ HD GRAPHICS - Stunning High Definition graphics will transport you to underwater world filled with seaweed forests and vibrant coral kingdoms!<br/>+ GLUTEN-FREE PROMISE - With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Wildlife Simulator: Shark and swim to the top of the food chain as a ferocious Great White Shark!<br/><br/>If you liked living as a shark then you'll love our other animal simulators! Download Jurassic World: Tyrannosaurus Rex Simulator to travel to a lost land of dinosaurs or check out the Safari Simulator: Lion and rule over the animal kingdom!<br/><br/>Follow us on Facebook for more awesome animal games and simulators!<br/>facebook.com/glutenfreegames <br/><br/>Follow us on Twitter too! We love hearing feedback and suggestions!<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2014-08-10", "tba": false, "updated": "2019-07-30T01:56:19", "background_image": "https://media.rawg.io/media/screenshots/775/775c1f877110ec444a6a0ff3dea1fbe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": "Everyone 10+"}