{"id": 830523, "slug": "great-escapes-itch", "name": "Great Escapes (itch)", "name_original": "Great Escapes (itch)", "description": "<p><strong>G</strong><strong>reat Escapes is a game for all room escape and adventure fans!</strong></p>\n<p>Built around the idea of quality over quantity, you won't find filler hidden object scenes or overly obtuse puzzles designed to get you paying for hints.</p>\n<p>All the hints are free, so what would be the point!?!</p>\n<p>Rather than 50 rooms and countless adverts, Great Escapes uses packs of well-designed and thought out rooms so that you can choose what sort of game you'd like to play today!</p>\n<p>Great Escapes is always growing, we'll keep adding new packs in the future so make sure you stick around!</p>\n<p>Key Features:</p>\n<ul><li>A first person point and click adventure game.</li><li>Trademark Glitch humour and puzzles that will leave you screaming at us.</li><li>The Glitch Camera to help you solve puzzles and keep track of clues.</li><li>Lots of clues to find and puzzles to solve.</li><li>Multiple packs with a variety of rooms to escape!</li><li>In game camera so you can take photos of all the clues and rooms you find.</li><li>Plenty of items to collect and fiendishly clever puzzles to solve!</li><li>Loads of items to find and use!</li><li>Clues to find and puzzles to solve!</li><li>A full hint guide that keeps track of your accomplishments to make sure you never get stuck.</li><li>Auto-save feature, never lose your progress again!</li></ul>\n<p>Download now to begin your great escapes!</p>\n<p>–</p>\n<p>Glitch Games is a tiny independent ‘studio’ from the UK.</p>\n<p>Find out more at glitch.games</p>\n<p>Chat with us on Discord - discord.gg/glitchgames</p>\n<p>Follow us @GlitchGames</p>\n<p>Find us on Facebook</p>", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T09:50:51", "background_image": "https://media.rawg.io/media/screenshots/6c0/6c09a62fb58ae5b9b80468fd0fc63f14.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Glitch Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}