{"id": 830552, "slug": "photon-multiplayer-and-chat-firebase", "name": "Photon Multiplayer and Chat Firebase", "name_original": "Photon Multiplayer and Chat Firebase", "description": "<p><strong>Description</strong>\n</p>\n<p>The assets contains one scenes landscape and necessary scripts to implement in your project and easy way to make multiplayer game work with Unity. This is allows you to see how multiplayer and chat module works. The photon multiplayer contains two sprites the player can choose what sprites he wants, the room are random, to control the player need to be build for PC only, number of player in room is possible to change for playing little football and chat together or save score team in Firebase System. To use toggle (remember me) need to open game on two different device. If you are save score next time when login the text last score will be displayed on top. The scene are temporary can modify as you wish.<br/></p>\n<p>Please note: You need to have Photon (PUN 2) already installed on Unity to use this assets, download and install from assets store PUN 2 to work properly.<br/></p>\n<p>Please note: You need to have Firebase already installed on Unity to use this package Firebase Auth, Firebase Database to work properly.<br/></p>\n<p>Authentication</p>\n<p>Benefits: With Firebase Auth, we make it easier for you to sign in your users or to create a custom username and password system.</p>\n<p>- Email Login</p>\n<p>- Register</p>\n<p>- Change Password</p>\n<p>- Delete account<br/></p>\n<p>Realtime Database</p>\n<p>Benefits: This is a database where your app's data magically syncs across all devices, usually within a few milliseconds. It's great for syncing your user's saved game across devices.</p>\n<p>It Includes:</p>\n<p>- Add Data</p>\n<p>- Read Data<br/></p>\n<p>If any issue please contact me. I will reply as soon as possible.      </p>\n<p>Email: watermelongo20@gmail.com     \r\n</p>", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T10:02:38", "background_image": "https://media.rawg.io/media/screenshots/770/770a93233cc7e92ad641f4cacdc41ba6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameDeveloper20"], "genres": [], "publishers": [], "esrb_rating": null}