{"id": 830526, "slug": "eight-deadly-rooms", "name": "Eight Deadly Rooms", "name_original": "Eight Deadly Rooms", "description": "<p>Eight Deadly Rooms</p>\n<p>-------------------------------------------------------------------------</p>\n<p>How to move to different rooms:</p>\n<p>Press W, A, S, D, up-arrow key, left-arrow key, down-arrow key, or right-arrow key to move to a different room.</p>\n<p>-------------------------------------------------------------------------</p>\n<p> Threats Hindrance<br/></p>\n<p>-------------------------------------------------------------------------</p>\n<p>Redly:</p>\n<p>Redly will be in a hole in room 1, you will always start in room 1, press W to go to room 1, every 5 seconds parts of Redly face will begin to appear, press his face to make him go back, once he has come out of the hole, you will only have 2.5 seconds to press on him to make him go back before he kills you.</p>\n<p>Head:</p>\n<p>Head will be in room 2, press A to go to room 2, every 30 to 60 seconds, Head will be ready to kill you, in 15 seconds you will have to be pressing and holding on Head to make Head not kill you, if you fail to do this, Head will kill you.</p>\n<p>Ghostshade:</p>\n<p>Ghostshade will be in room 3, press S to go to room 3, every second Ghostshade will become 1% more visible, Ghostshade will start off completely invisible, pressing and holding on Ghostshade will make 1% less visible, once Ghostshade is completely visible he will kill you.</p>\n<p>Eyely:</p>\n<p>Eyely will be in room 4, press D to go to room 4, in room 4 Eyely will be sleeping, every 60 to 120 seconds Eyely will wake up, when Eyely wakes up you will have 10 seconds to hold down the space bar to make her go back to sleep, Eyely will not kill you if you fail to do this, but she will subtract your time by 25 and go back to sleep.</p>\n<p>???:</p>\n<p>??? will be in room 5, press the up-arrow key to go to room 5, every 15 to 30 seconds you will have to be in room 5 or else ??? will kill you, if you are in room 5 within the 15 to 30 second timeframe ??? will ask you what his name is, if you guess ??? name right ??? will double your time, if you guess his name wrong your time will stay the same. (Hint: his name is not ???)</p>\n<p>Bi7-SSCB:</p>\n<p>Bi7-SSCB will be in room 6, press the left-arrow key to go to room 6, every 180 to 300 you will have to be in room 6, if you are not in room 6 within the timeframe, Bi7-SSCB will take you to room 6 for a certain amount of time, the first time it will be 5 seconds, the second time it will be 10 seconds, the third time it will be 15 seconds, and the fourth time you will die.</p>\n<p>Clobric:</p>\n<p>Clobric will be in room 7, press the down-arrow key to go to room 7, every 120 to 240 seconds, Clobric will check if he is wearing what he wants to be wearing, if he is not, he will kill you, if he is after 45 seconds he will change what he wants to wearing and it repeats, you will know what he wants to wear because of the number on his left, press the numbers on your keybroad to change the clothes he is wearing.</p>\n<p>Tempcoho:</p>\n<p>Tempcoho will be in room 8, press the right-arrow key to go to room 8, a fan will be in room 8 and will be off, if you press \"O\" the fan will turn on, if you press \"F\" the fan will turn off, you can only turn the fan on and off in room 8, if the fan is on room 8 will cool down, if the fan is off room 8 will warm up, if the temperature gets below -35 or gets above 35, you will die, you can only see what the temperature is in room 8.</p>", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T09:52:15", "background_image": "https://media.rawg.io/media/screenshots/09f/09f9d1c4c81c899d36a30eb874126361.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedDre"], "genres": [], "publishers": [], "esrb_rating": null}