{"id": 830679, "slug": "dont-freeze-subzero-studios-ruth182128", "name": "Don't Freeze (Subzero Studios, ruth182128)", "name_original": "Don't Freeze (Subzero Studios, ruth182128)", "description": "<p>* English translation follows * </p><p>Don't Freeze est un jeu d'action-survie se déroulant dans un monde apocalyptique gelé et aride. Menacé par une tempête mordante et des ennemis de tout côté, vous devez survivre et progresser à travers chaque niveau en se défendant contre des ennemis et en trouvant de l'équipement pour améliorer vos chances de survie. Chaque action a un impact sur votre survie : collectionner des fourrures pour vous garder au chaud, trouver des soins bonus pour ne pas mourir et atteindre l'abris avant qu'il ne soit trop tard! Chaque niveau se termine lorsque vous atteingniez un refuge où vous pouvez vous réchauffer, vous soigner et fabriquer en toute sécurité pour le prochain défi. En allant de plus en plus loin dans l'univers, vous pourrez entrevoir le sombre secret qui a gelé le monde entier et trouver les forces nécessaires pour reprendre ce qui vous appartient. </p><p>Don't Freeze is an action-survival game that takes place in a frozen and snowy apocalyptic world. Threatened by the freezing cold and enemies on all sides, you must find a way to endure and progress through each level by defending against enemies and finding equipment to improve your chances of survival. Each action has an impact on your journey : collect fur to keep warm, discover bonus health, and reach the next safehouse before it's too late! Regain your strength, health and safely craft items in the safehouses at the end of each level. As you embark on your quest, discover the dark story behind how the world froze over and find the forces needed to take back what's yours.</p>", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-05T10:54:59", "background_image": "https://media.rawg.io/media/screenshots/da8/da817958f4770cc12ea8c8c79d0ec9fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ruth182128", "Subzero Studios"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}