{"id": 830978, "slug": "super-wild-war-22", "name": "Super Wild War '22", "name_original": "Super Wild War '22", "description": "<p><strong>Super Wild War '22</strong> is a turn-based strategy game for the classic Sega Master System console (or Genesis/Megadrive in compatibility mode). The game can be played on other devices by using an emulator (not included!).<br/></p>\n<p><strong>Choose from three different campaigns. </strong>You can play as Goat Governorate, Frog Fellowship, or Cat Commonwealth. Each faction has unique units and a special ability.</p>\n<ul><li>the goat power raises defense</li><li>the frog power raises agility</li><li>the cat power increases money earned when destroying enemy units</li></ul>\n\n<p>In some scenarios you'll need to stall for time just to survive, while in others a quick advance will be rewarded with more money and experience points.</p>\n<p>Units have long-range weapons with which they can attack from a fixed position, or they can move around the map, with non-flying units picking up different bonuses and/or penalties according to the type of terrain they land on. Close-range attacks can optionally be used after moving. Attackers have two chances to inflict damage, while defenders can make one counterattack.<br/></p>\n<p>After clearing each area, units can be upgraded in the <strong>Mech Workshop</strong>.</p>\n\n<p>The game includes a <strong>password system</strong> allowing the player to resume the game at a stage which they had reached previously, and preserving a portion of their experience points and money.</p>\n\n<p>note 1: 128KB ROM image, works with typical mappers such as 315-5208.<br/></p>\n<p>note 2: uses PSG sound only.</p><p>note 3: the SMS2 version uses an expanded 256x224 screen mode (does not work on original SMS or Genesis/Megadrive)<br/></p>", "metacritic": null, "released": "2022-08-03", "tba": false, "updated": "2022-08-05T13:03:20", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf000ee3c9ab99bf7f098cbc735ae9d0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["90soft90"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}