{"id": 830911, "slug": "sea-cutter-alphademo-build", "name": "Sea Cutter - Alpha/Demo Build", "name_original": "Sea Cutter - Alpha/Demo Build", "description": "<p><strong>Credits</strong></p>\n<p>Most assets in-game are made by myself. With most audio sans the background music included in-game being outsourced from Freesounds.org, under the Creative Commons 0 License. The \"main stage\" music meanwhile, was made using LMMS.</p>\n<p><strong>Description</strong>\n</p>\n<p>A further polished prototype, of the previous boat game. Now with some more playable gameplay loop including upgrades and restocking, alongside basic background music, alongside randomized enemy spawning!</p>\n<p>A polishing sprint that I initially made in hopes of including a handful more features, if not for \"taking too long\" with a four month (instead of three) development cycle. In spite of the lengthy development, I feel it's a bit more there, if needing more polish.</p>\n<p>If nothing else; it's an upgrade-themed arcade experience, if only as a proof of concept. Further development if any, would aim to include more stage variations, possible new enemy types and an actual boss. Alongside gameplay tweaks to make the gameplay more engaging and 'fun'.</p>\n<p><strong>Controls\r\n</strong>A/D or Left/Right Arrows to Steer Ship\r\nW/S or Up/Down Arrows to control acceleration (shown by player Sails)\r\nSpacebar Key, or Left Mouse button to fire standard cannonball\r\nX Key, or Right Mouse button to fire (special) cannonball spread\r\n</p>\n<p><strong>Gameplay Objective</strong>\n</p>\n<ul><li>Kill all enemy ships within the map, within a limited amount of time. Without being sunk.\r\n</li><li>If you kill all enemy ships on map? Then you move on to the next day (stage);<ul><li>With any time remaining being added to the time limit on the next day (stage).\r\n</li></ul>\n</li><li>If you get sunk or time runs out, then it's game over. And you'll have to start again at day 1.\r\n</li></ul>\n<p>Whilst in the Tavern; use the 'gold' earnt by killing enemies to upgrade your ships ability to barrage your adversaries, alongside restocking on torpedo ammunition and supplies needed to fuel your time limit whilst at the sea.</p>\n<p><strong>Inspirations\r\n</strong>Outside the obligatory \"Sid Meier's Pirates!\" I'd also cite in terms of 'feel', Ace Combat. Especially if I expand to include many features. Least of which different types of enemies, <em>BOSSES</em>. And alternative Special attacks, with limited ammo!\r\n</p>", "metacritic": null, "released": "2022-08-03", "tba": false, "updated": "2022-08-05T12:32:01", "background_image": "https://media.rawg.io/media/screenshots/5dd/5dd7381223468a4214e36811c5f6153f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Andrew Letailleur"], "genres": ["Action"], "publishers": [], "esrb_rating": null}