{"id": 831194, "slug": "devils-rhapsody", "name": "Devil's Rhapsody", "name_original": "Devil's Rhapsody", "description": "Fall to Hell\r\nCan you get your life back?\r\n<p><strong>In comes the Devil with an offer: find six ghosts, capture their spirits, and then she'll give you back your life.</strong></p>\n<p><em>Devil's Rhapsody</em> is a puzzle adventure game with an intricate story, some rhythm game piano sections and a cool final boss fight.</p>\n<p>Explore the town in search of the lost ghosts. Relive the hours before their deaths. Figure out how all their stories connect.</p>\n<p>Each ghost has their own theme for you to play on piano before they'll move on. And once you've got all six spirits, the Devil will be waiting...</p>\n\n\r\nThe Hill, the Mines, the Orphanage, the Tunnels, the Theatre and the Manor House...\r\n\n<p>This is an old game I made for my EPQ in sixth form, but I originally didn't release it due to some parts being buggy or broken. However, I returned to it recently and I've done some more work on it, mainly fixing bugs and adding sound effects and the like, and it's exciting to feel like it's finally finished.<br/></p>\n<p>The music was all made in Sibelius on the school computers and so it has some charm to it, I suppose. The plot is often dramatic and there are some secrets in there too. And I'm not the best artist in the world, but I tried my best.<br/></p>\n<ul><li>4 playable characters</li><li>20+ music tracks</li><li>Interconnected storylines</li><li>Puzzles and secrets</li><li>Rhythm game piano fights</li><li>An overarching mystery\r\n</li></ul>\n<p><em>Warning: contains suggestions of suicide.</em><br/><br/><br/><br/></p>", "metacritic": null, "released": "2022-08-02", "tba": false, "updated": "2022-08-05T14:40:49", "background_image": "https://media.rawg.io/media/screenshots/884/88490f353a69304ba436287f5dfc26ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["William Rous"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}