{"id": 8311, "slug": "re-volt-2-multiplayer", "name": "RE-VOLT 2: MULTIPLAYER", "name_original": "RE-VOLT 2: MULTIPLAYER", "description": "**THE ULTIMATE MULTIPLAYER RC CAR RACING GAME!** <br/>The globally-acclaimed RC car racing game has evolved into a mobile multiplayer hit!<br/>Numerous stages and modes! Real-time competitions and global Grand Prix!<br/>Try the multiplayer games of the ultimate RC car racing game, Re-Volt 2!<br/><br/>- This game is free to play, but you can choose to pay real money for extra items. <br/><br/>▶ COMPETE WITH PLAYERS FROM ALL OVER THE GLOBE! <br/>Aim for the world record in a globally-accessed Grand Prix!<br/>Real-time multiplayer mode for up to 4 players!<br/><br/>▶ DRIVE YOUR DREAM RC CAR! <br/>Formula racers, sports cars, even monster trucks! True RC racing at its best! <br/>Countless skins, performance upgrades, item enhancement, special tunings and more! <br/><br/>▶ ENDLESS REWARDS AWAIT YOU! <br/>Grand Prix records! Coins, cash items and more are for the taking!<br/>Try the Bingo and daily missions! Liven up your Grand Prix and multiplayer challenges!<br/><br/>▶ RC CAR COLLECTIONS, VARIOUS TRACKS AND GAME MODES! ENJOY THEM ALL! <br/>264 stages and 4 game modes! Aim for the perfect clear record! <br/>Compare and compete with your Facebook and Twitter friends! <br/><br/>Official Facebook Page: https://www.facebook.com/RevoltOfficialPage <br/>Developer Contact: re-volt@wegoi.com", "metacritic": null, "released": "2014-07-24", "tba": false, "updated": "2019-10-22T14:29:47", "background_image": "https://media.rawg.io/media/screenshots/724/7249cd523bcf7b2dd0cb3d765f73784a.jpeg", "website": "http://www.facebook.com/RevoltOfficialPage", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["WeGo Interactive Co"], "genres": ["Racing", "Arcade"], "publishers": ["WeGo Interactive Co"], "esrb_rating": "Everyone 10+"}