{"id": 83147, "slug": "ultimate-cat-simulator", "name": "Ultimate Cat Simulator", "name_original": "Ultimate Cat Simulator", "description": "Pounce into a brand new adventure as a graceful Cat! Hunt down food and find your place in a massive realistic world! Survive on the streets of a busy city, get adopted and be a house cat, and raise your family as you experience the thrilling life of a cat!<br/><br/>Download the Ultimate Cat Simulator today while it's 50% OFF for a very limited time!<br/><br/>Brand New Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy while exploring city streets and vast forests!<br/><br/>DANGEROUS BOSS BATTLES<br/>Test your skills against SIX thrilling boss battles! A rabid neighborhood foe patrols the streets looking for a fight! A oversized rodent lurks around every corner in the sewers ready to defend his territory!<br/><br/>BUILD YOUR PACK<br/>Dominate other cats or bring them a treat to recruit them to your family! Customize and play as any cat in your pack and create a powerful family!<br/><br/>RAISE YOUR KITTENS<br/>Raise babies that will grow into powerful members of your family! Care for you kittens while they are are young, finding food for them and carrying them in your mouth!<br/><br/>CUSTOMIZE YOUR CATS<br/>Choose your animal’s name, appearance, skills, and attributes to complement your pack members and become a more powerful group!<br/><br/>LEVEL UP YOUR KITTY<br/>Gain experience by catching and eating your prey, caring for your family, and completing missions! Level up your kitty to increase their health and attack damage, earn points to upgrade your stats, and increase the size of your pack!<br/><br/>EARN STAT POINTS<br/>Stat Points can be used to provide bonus’s to traits like Health, Critical Attack Chance, Run Speed, and much more! <br/><br/>UPGRADEABLE BUFFS<br/>Buff Points can be used to upgrade your Meow and Hiss Buffs, which create temporary Stat Boosting auras around your cat when active! <br/><br/>RAGDOLL PHYSICS<br/>Your prey now realistically dangles from your jaws as you carry them!<br/><br/>DYNAMIC WEATHER, SEASONS AND DAY/NIGHT CYCLE<br/>Procedural weather system with unique storms, clouds, sun, stars and changing seasons!<br/><br/>MASSIVE REALISTIC 3D ENVIRONMENT<br/>Explore a massive world with a wild forest, a rocky mountainous island, dark and dirty sewers, peaceful neighborhoods and a busting city!<br/><br/>DOZENS OF ENEMIES<br/>Hunt down animals like squirrels, rabbits, mice, deer, birds, crab, fish, raccoon, fox, cats, dogs, rats, lizards and many more! Become a house cat and get fed by your owner!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>If you are of age or have your parents permission, turn on the BRAND NEW blood effects for added combat ferocity!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Ultimate Cat Simulator and live the thrilling life of an adorable and graceful kitty!<br/><br/>If you liked living as a Cat then you'll love our other animal simulators! Download our Ultimate Bird Simulator and live wild and free in the sky, or try the Ultimate Fox Simulator and raid the farm for a tasty chicken!<br/><br/>Give us a shout and let us know what you want to play next!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2017-02-07", "tba": false, "updated": "2019-08-02T05:18:36", "background_image": "https://media.rawg.io/media/screenshots/1e0/1e064809e052d6b33198f837ae39264b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": null}