{"id": 831473, "slug": "alone-among-the-stars-game-boy-port", "name": "Alone Among The Stars (Game Boy port)", "name_original": "Alone Among The Stars (Game Boy port)", "description": "<p>GAME CONTROLS:</p>\n<p>Z/J: ACTION</p>\n<p>ARROW KEYS: SELECT FROM MENU</p>\n<p>IF CONTROLS ARE UNRESPONSIVE, CLICK ON THE GAME WINDOW.</p>\n<p>Alone Among The Stars is tabletop roleplaying game by Takuma Okada about exploring space and experiencing wondrous sights. <br/></p>\n<p>The original pen-and-paper game uses a dice and a deck of cards to present the player with prompts for solo RPG journaling. This port replaces the dice, cards, and written rules with a Nintendo Game Boy or your web browser, but you'll need to bring your own pen and paper. </p>\n<p>If you've never played a solo RPG before, it can seem awkward at first, but go with it; it can be really rewarding. For more info on solo RPGs and how to play them, Dicebreaker made a great guide, here.<br/></p>\n<p>If you wish to support this game, please consider donating to the original project.</p>\n<p>If you prefer your RPGs entirely console-based, please check out my Game Boy RPG, There's Nothing To Do In This Town.</p>\n<p>Massive thanks to: Takuma Okada, for letting me butcher her amazing minimalist game. Camellina for the beautiful Rainy Hearts font used in the game. Chris and everyone involved in GB Studio;  you've totally revitalised the old handheld.</p>\n<p>**A TECHNICAL NOTE ABOUT PSEUDO-RANDOMISATION** The Game Boy isn't really capable of true random number generation. Different solutions were considered, and this game uses the Game Boy's frame buffer to spit out functionally random results. This works differently, however, to shuffling a deck of cards, in that the same results can occasionally be repeated one after another. When my results feel less-than-random I like to mash the d-pad around on the Game Boy. It doesn't do anything, but it sure feels good. </p>\n<p>VERSIONS: </p>\n<p>1st August 22 - v1.1 - Minor changes. Slowed down introduction for better readability/accessibility. </p>\n<p>24th July 22- v1.0 - All functions of original game implemented. Some questions around pseudo-randomisation, and some additional UX ideas could be developed. I feel this is ready enough to share with the community, though. </p>", "metacritic": null, "released": "2022-08-01", "tba": false, "updated": "2022-08-05T16:51:49", "background_image": "https://media.rawg.io/media/screenshots/e6c/e6ce6ad76661fd9e6f782503cf593395.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "macOS", "PC"], "developers": ["donotrunwithpixels"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}