{"id": 831509, "slug": "pocket-farm-pre-alpha", "name": "Pocket Farm (Pre-Alpha)", "name_original": "Pocket Farm (Pre-Alpha)", "description": "<p>Hi Everyone,</p>\n<p>I just wanted to share my pre-alpha build of a game I'm working on - Pocket Farm. It's a laid back and relaxing farming sim that focuses heavily on what a plant actually needs to grow. Plants won't just grow by being shoved with a bunch of water, each plant has its' own unique soil type that it requires, plants can be overwatered as well as underwatered, there are bug infestations that you need to be careful of and you can breed your plants together. How much can you farm before the time runs out?<br/></p>\n<p>Because of all the changes to a traditional farming sim I highly recommend quickly reading through the tutorial section of the game at your own pace.</p>\n\n<p>\n</p>\n<p><strong>Controls:</strong><br/>Q - Open/Close inventory<br/>Left Click - Most actions (i.e. left click a rock with a pickaxe)<br/>Right Click - Only with watering can, lowers water level of tile to adjust for over-watering.<br/>Scroll Wheel - Change active hotbar slot.</p>\n\n<p>Discord to follow the development and have some input in the game is:<br/>https://discord.gg/7X5gCnZHFF</p>\n\n<p>\n</p>\n<p><strong>Known Bugs</strong><br/>#1 - When moving items around your inventory sometimes the item quantity freezes and doesn't move with the item, the inventory is still correct, this is just a visual bug being figured out.</p>\n<p>#2 - Sometimes when harvesting a plant or removing it, the indicators that show whether it can grow or is finished growing persist still, they go away when you update the tile with a new crop so this is just a visual bug being figured out.</p>", "metacritic": null, "released": "2022-08-01", "tba": false, "updated": "2022-08-05T17:07:03", "background_image": "https://media.rawg.io/media/screenshots/619/61930ee5a773495f9bcbbd71edff5feb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SturdyGhost"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}