{"id": 831612, "slug": "galaxy-pilot", "name": "Galaxy Pilot", "name_original": "Galaxy Pilot", "description": "<strong>&gt;&gt; INTRODUCTION</strong>\n\n<p>Galaxy Pilot is a shoot-em-up based on various arcade games from the 1980s, its really my personal homage to the arcade game \"StarForce\" from 1984.<br/><br/>The game has 25 main levels within 8 galaxies with 5 challenging stages and 3 modes of difficulty, The player has multiple weapons to pick up and hidden bonuses to collect using a top-down viewpoint or an isometric viewpoint.<br/><br/>Your aim is to blast your way to the last level ( and beyond ) to get the highest score, scores over 3 million points can be submitted to the on-line leader-board and if a score is high enough it will be seen in the <strong><em>HALL OF FAME</em></strong><br/></p>\n<strong>&gt;&gt; STORY</strong>\n\n<p>\"<em>An aggressive machine-race of beings are building mining-stations atop asteroids in our system to extract power for their mother-mech, pilots must bring this activity to a close, in the name of peace.\"</em></p>\n\n<strong>&gt;&gt; STARTING A NEW GAME</strong>\n\n<p>Launch the game and you will be presented with the configuration screen where you can change the resolution via the graphics-tab and also change the controls via the <em>input</em>-tab, <strong>most joysticks &amp; joypads</strong> will work with Galaxy Pilot, hit the '<strong>Launch</strong>' button and the game will begin to load.</p>\n<p><em>** Galaxy Pilot will run on most <strong>low end</strong> machines depending on the resolution you set and the processer-speed of your computer, for PC's a low spec Intel i3 is sufficient.</em><br/></p>\n<p>Once loaded you will be presented with the <strong>MAIN-MENU</strong>, press <strong>FIRE</strong> to begin a new game, choose a difficulty and a level by moving the joystick or keys<strong> up &amp; down and left &amp; right</strong> then press <strong>FIRE</strong> to start a new game.<br/></p>\n<p>Press <strong>FIRE-2</strong> during the main-menu screen attract mode to view the <strong>OPTIONS</strong> screen which will allow you to choose various game options which will be saved and also loaded upon start up next time.</p>\n\n<strong>&gt;&gt; MAIN MENU</strong>\n\n<p>When a new game loads or ends your presented with the \"<strong>Main Menu</strong>\" which will allow you to start a new game and select a mode of difficulty and your level, once you finish a level you will be able to select that level as a starting point for a new game.</p>\n<p>Press <strong>FIRE-2</strong> for the <strong>OPTIONS</strong> screen where you can add \"<strong>scan-lines</strong>\" or a \"<strong>16-bit style</strong>\" filter or play the game with a \"<strong>Space Invaders</strong>\" wave if you wished just for fun.</p>\n<p><em>** While the scanlines option is active press the FIRE-2 button to switch between scan-line sizes.</em> <br/></p>\n<p>Also you have a \"<strong>mouse control</strong>\" selection and a \"<strong>reset screen</strong>\" switch plus a \"<strong>music on/off</strong>\" toggle switch, you can also enable the \"<strong>ENDLESS</strong>\" game mode, after the last level ( \"<em>ALPHON</em>\" ) is completed your transported to the next GALAXY starting again at stage ALPHA but with increased difficulty and with a different coloured background for each galaxy.</p>\n<p>\"Galaxies\" range from  ( 0 to 7 ) with 25 levels in each, let's say you get to level BETA on GALAXY 3 then your HIGH SCORE will show \"<strong>BETA.G3</strong>\" etc.<br/></p>\n<p>Options are saved and will be loaded <strong>automatically</strong> upon the start of a new game launch, the main menu will run through various screens showing the high-scores both locally and on-line and will show other game information, you can select these screens using the <strong>joystick</strong>.</p>\n\n<strong>&gt;&gt; PLAYING A GAME</strong>\n\n<p>Use your joystick to control your ship, you begin at the <strong>ALPHA</strong> stage for a brand new game and your scores if high enough will be saved.</p>\n<p>If you score over <strong>3 million points</strong> you can submit your score to the Galaxy Pilot World Score Database ( <strong>Leader-board</strong> ) - World scores are also shown in-game if you have an internet connection.</p>\n<p>Shoot using the <strong>FIRE</strong> button and avoid enemy-alien ships and their bullets &amp; guns, shoot all the bonuses for a perfect bonus score, destroy every enemy-alien ship in a wave to spawn a <strong>POWER-UP</strong> pod which you can pick-up for get various enhancements for your ship.</p>\n<p><strong>Example power pods are: </strong><br/></p>\n<ul><li>Weapon Upgrade ( <strong>PURPLE - see table below</strong> ) <br/>Repair Damage to your ship ( <strong>RED 10% power up</strong> ) <br/>Score Bonus ( <strong>YELLOW </strong>up to <strong>50,000</strong> points ) Missiles<strong> </strong><strong>( BLUE </strong><strong>3 x MISSILES )</strong><br/>Bomb<strong> ( GREEN 1 x </strong><strong>SMART bomb )</strong></li></ul>\n<p><em> ** A smart-bomb will destroy everything on screen and is activated using the <strong>FIRE-3</strong> button.</em></p>\n<p>Pressing the <strong>FIRE-4</strong> button or <strong>SPACE-BAR </strong>will change the <strong>viewpoint</strong> and will aid the player in seeing what is ahead in the level.</p>\n<p>The various weapons start off with a default weapon called the <strong>GUN</strong>, then with every <strong>PURPLE power-up</strong> you can upgrade, like so:<br/></p>\n<ul><li> <strong>YOTTSU</strong> weapon ( <strong>4 x guns</strong> ),<br/><strong> IONBOLT</strong> red plasma laser,<br/> <strong>GEKITAI</strong> gun ( <strong>repulse weapon</strong> ),<br/> <strong>NENTEN</strong> blaster ( <strong>twisting-bolt weapon</strong> ),<br/> <strong>IZUMI</strong> weapon (<strong> '<em>fountain</em>' weapon so called</strong> ) .</li></ul>\n<p><em>** Any more green power ups after the <strong>IZUMI weapon</strong> will award the player with a new smart bomb.</em><br/><br/><strong>WHITE power ups </strong>will give the player a <strong>KOMAYAKA</strong> ( <strong>Friendly</strong> ) power pod which will fire at the enemy and help to destroy the end level bosses <em>but are ineffective against asteroids</em> and ground targets.</p>\n<p>A player can have <strong>2 x KOMAYAKA</strong> pods and every white power up after this will just increase the rate of fire for each <strong>KOMAYAKA</strong> pod.<br/><br/>There is also a <strong>RAPID FIRE</strong> power up which will save your fingers from constantly tapping the fire button, simply hold down the fire button.</p>\n<p>Each level generates enemy wave patterns, some random, some predictable, each patrol their space platforms which are in fact energy-collection-units for their mother ship ( \"ALPHON\" )</p>\n<p>Each platform has various things to shoot on them including bonus icons ( <strong>RED 'B' and BLUE 'B'</strong> ) which if you shoot them all you can get bigger rewards at the end of each level, Every level has an asteroid belt before the boss in which you can either dodge or destroy asteroids ( <em>and <strong>occasionally a COMET</strong> - shoot it / ram it for <strong>100K</strong></em> ) <br/></p>\n<p>You have a <strong>1-in-10</strong> chance of shooting an asteroid which contains a <strong>NEW LIFE</strong> this is the only way to get a new life during a game apart from the <strong>chance SPINNER.</strong> <br/></p>\n<p>At the end of each level and at the end of the asteroid-belt you will see the <strong>level-end BOSS </strong>which is to be destroyed as <strong>quickly as possible</strong> to then progress onward to the award screen.<br/><br/><em>** If a player destroys all 'shootable' objects on an alien-platform then a player will receive a 50K bonus.</em></p>\n<p><strong>BONUS LEVELS</strong> or <em>challenging stages</em> will appear after some levels in which you simply have to destroy all the alien ships in formation, 100,000 bonus points for destroying all of them.<br/><br/><strong>SECRET</strong> bonuses can be gained during a game, there are <em><strong>3 secret bonuses</strong></em> to be found in game. At the end of every level you will see how many bonus B's you missed or not and so rewarded accordingly then you will be able to play the level-end chance <strong>SPINNER</strong> which will spin various symbols randomly and if three of them align this will award you with various bonus items. <strong>CHANCE-spinner </strong>wins are :</p>\n<p><strong>3 x Hearts = Damage to 0%</strong><br/><strong>3 x Player-Ships = Extra Life</strong><br/><strong>3 x BLUE-BBB = 25K BONUS</strong><br/><strong>3 x RED-BBB = 50K BONUS</strong><br/><strong>3 x POW = 3 Missiles plus 1 SMART Bomb</strong><br/><strong>3 x 7 = JACKPOT - ONE MILLION POINTS</strong></p>\n<p><em>** You can get more credits for the chance-spinner by shooting more ( <strong>? - Question Mark</strong> ) symbols found on the alien space-platforms.</em><br/><br/>Once all credits are spent you will then go on to the next level, complete levels to advance the level-selector during the main menu selection screen.</p>\n<p>During a game a player can press the <strong>ESCAPE</strong> key which will pause the game and present the player with some options, resume game, restart game or return to the main menu or quit the entire game.<br/><br/><em>** You can also quit the game via the main menu by pressing he <strong>ESCAPE</strong> key.</em></p>\n<p>A players weapons can <strong>overheat</strong> if the <strong>RAPID fire</strong> power up is active, if you select the <strong>EASY</strong> setting on the main menu your weapon will not be prone to overheating so much unlike the <strong>HARD</strong> option which will overheat very fast if the rapid fire power is active.<br/><br/>The level of difficulty chosen on the main menu will affect the enemy wave speeds and player ships resistance to enemy bullets also the movement speed of the player ship during a game.<br/><br/>If a players damage reaches <strong>99%+</strong> the player ship will <strong>explode</strong> and they will lose a life, a <strong>RED power up</strong> pod will repair damage by 10%, a red power up collected with no damage has no effect, players can have a maximum of <strong>EIGHT lives</strong>.<br/><br/><em>** The next life up award will be a bonus of 10,000 points instead.</em></p>\n\n<strong>&gt;&gt; GAME OVER</strong>\n\n<p>A players game is over when all lives are lost, If a player loses a life they have a one in three chance of getting a <strong>POWER-UP-SAVER</strong> which will restore all the players previous power-ups.<br/><br/>If a player achieves a <strong>high score</strong> they can enter their initials which will be saved along with their score also their level reached to the players hard drive and loaded automatically on every new game launch.<br/><br/>If a player achieves a score of over <strong>3 million points</strong> then they can submit their score to the on-line <strong>leader-board of scores</strong>. <br/><br/><em>** You must have an active network connection to read &amp; submit scores on-line.</em></p>\n\n<strong>&gt;&gt; SUPPORT &amp; INFORMATION</strong>\n\n<p><em>** Linux version does not have joystick support</em><strong>.</strong><br/></p>\n<p><strong>Galaxy Pilot</strong> was programmed &amp; designed in the <strong>UK</strong> on the Unity system by T<strong>ony Smith</strong> with music from <strong>Juhani Junkala</strong>.</p>", "metacritic": null, "released": "2022-08-01", "tba": false, "updated": "2022-08-05T17:53:47", "background_image": "https://media.rawg.io/media/screenshots/748/748b78fd9ac44900ca0f86a5077c0408.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["BeDazzled"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}