{"id": 8316, "slug": "legendary-warriors", "name": "Legendary Warriors", "name_original": "Legendary Warriors", "description": "Nominated for Best Visual Design at Bitsummit Kyoto Indie Game Festival 2015!<br/><br/>Set out on an epic adventure with strong and unique warriors to return precious fire to the world!<br/><br/>・Free to play<br/>・A land of sword and spell awaits you with action-packed, thrilling battles!<br/>・A unique and mysterious atmosphere with distinctive characters<br/>・High-quality design and music, made with care<br/>・Dreamlike gameplay that you can take at your own relaxed pace<br/><br/>--One fated night, 100 piercing eyes descended upon all the towns, taking away the light of their flame--<br/>This is the story of how fire was won back. Gathering new companions, you must set out on a journey to find the lost flame. Making teams of up to three characters, you will fight against the mysterious &amp;quot;Argus&amp;quot; who possess a plethora of peculiar traits. While your warriors will fight automatically according to an algorithm, you can control the tide of battle by choosing how to raise your warriors, and where and when to use special abilities.<br/>As you fight onward, your warriors will lose their HP, and they cannot dress their wounds until arriving at the next town. You must make good use of your small band of fighters, pushing forward to bring light to the towns which lie enclosed in endless night.<br/>While the controls are minimal, the gameplay and strategy is very deep and enjoyable. Like reading an adventure novel, you will certainly be enchanted by the wondrous world that awaits.<br/><br/>*&amp;quot;Legendary Warriors&amp;quot; can be played all the way to the end for free, but some items in the game are also available for purchase.<br/><br/>Gameplay:<br/>・Choose three warriors from your companions to take to battle<br/>・Once in battle, tap warriors to deploy them at a strategic moment<br/>・Deployment order and timing is important! Keep your warriors&amp;#39; abilities and characteristics in mind while devising a strategy<br/>・When the skill gauge is full, you can use various special abilities<br/>・Use the spoils of war that you gain to improve your companions", "metacritic": null, "released": "2015-09-03", "tba": false, "updated": "2019-10-22T14:29:47", "background_image": "https://media.rawg.io/media/screenshots/fd9/fd9d4fc7bf140110006ca98cdfbf6faa.jpeg", "website": "https://oinkgms.com/lws/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oink Games"], "genres": ["Adventure", "RPG"], "publishers": ["Oink Games"], "esrb_rating": "Everyone 10+"}