{"id": 831874, "slug": "nyaruru-fishy-fight", "name": "Nyaruru Fishy Fight", "name_original": "Nyaruru Fishy Fight", "description": "This game is a Metroidvania game with intense battles. Nyaruru is living in a small town. One day a strange thing happened. Everyone magically grew cat ears and tails which looked just like Nyaruru, so Nyaruru started her adventure of  investigation and uncovering the truth.<br/><br/><br/><br/><br/><br/>Triple attack: Swing the fish sword back and forth quickly, deal a lot of damage in a second.<br/><br/><br/><br/>Upward attack: Slash up and knock the enemy into the air.<br/><br/><br/><br/>Downward attack: Slash down and bounce after hit, reset double jump and dash.<br/><br/><br/><br/>Dash:  Dash forward with no foreswing and backswing.<br/><br/><br/><br/>Speed up and jump: Jump into the air and keep high speed moving before land to the ground.<br/><br/><br/><br/>Sneak: Step on a skateboard, reduce Nyaruru's hitbox height.<br/><br/><br/><br/><br/>You will control Nyaruru to fight against various enemies and collect Catcoins in the complex game world.Catcoins can be used to buy many power-up items in the store, which can help Nyaruru to better deal with BOSS fights and map mechanics.<br/>Since the collection of abilities and power-up items is not mandatory, there are three difficulty levels in this game which can be flexbelly changed. You can still pass the game and achieve the end without many items or abilities.<br/><br/>The game difficulty can be change by this NPC:<br/><br/><br/><br/><h3>The purpose of collecting Catcoins, abilities and accessories is to complete the higher difficulty levels.</h3>As the game difficulty gets up, the BOSS will have more complicated power attacks and shorter attack foreswing. In this case, choosing the appropriate abilities&amp;accessories and using skills properly will be the key to defeat the BOSS.<br/>For example:<br/><br/><br/>Dive and thrust downward quickly. Generate an energy wave and cause damage to the enemies around Nyaruru, or even behind her! You will like this if you have to turn your back to your enemy.<br/><br/>Keep flipping over in the air and attacking everything near Nyaruru, bounce after hit and reset the double jump and dash. You will like this if your enemy can fly into the air and you have a hard time reaching them.<h3>In addition of that, there are also some interesting items such as:</h3>It will shine when Nyaruru gets close to the Catcoin, and make Nyaruru easier to find the hidden treasure!<br/>With this weight gear, Nyaruru can squash the enemy by stomping on their head.", "metacritic": null, "released": "2022-08-05", "tba": false, "updated": "2022-08-08T05:52:50", "background_image": "https://media.rawg.io/media/screenshots/c17/c1773f93e45aca8409e6d3a9339a16b7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1}, "playtime": 30, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["赤瞳大白猫", "猫尾巴制作组"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["赤瞳大白猫"], "esrb_rating": null}