{"id": 831891, "slug": "miko-no-kanata-curious-tales-from-oguni-shrine-cyc", "name": "Miko no Kanata: Curious Tales from Oguni Shrine -Cycles", "name_original": "Miko no Kanata: Curious Tales from Oguni Shrine -Cycles", "description": "~A totally traditional Japanese-style romance adventure game for all the miko lovers out there~<br/><br/>Miko no Kanata is a totally traditional Japanese-style romance adventure game that is a culmination of everything that developer Fan-na has put forth since they got started in 2004.<br/><br/>\"Cycles\" is the first part in this series and focuses on the first time the protagonist and the heroine first meet and the romance that awakens between them.<br/><br/>All the heroines are miko!<br/>Fighting miko! Working miko! Moe miko!<h3>STORY</h3><br/>In the classroom on his first day of school, protagonist, Kiryu Yuuya, meets Mikanagi Akiha, a girl with a mysterious aura about her.<br/><br/>Akiha was the spitting image of a miko who repeatedly appears in Yuuya's dreams and kills him.<br/><br/>However, Yuuya felt a strong sense of fate in their meeting each other.<br/>\"It's feels like we finally meet... Yuuya-san.\"<br/>Akiha said those words, filled with a strong fascination in Yuuya.<br/>They were soon drawn to each other...<br/><br/>However, Akiha's older sister, the miko, Koharu, let Yuuya in on a startling revelation.<br/>\"Akiha-chan... is not someone from this era.\"<br/><br/>A young woman's love that pierces through the vastness of a thousand years.<br/>The tragic fate imposed upon these fighting shrine maidens.<br/>And the followers of darkness who seek to rampage through the world of night...<br/><br/>With those strong feelings alone, will Yuuya and Akiha be together?!<h3>FEATURES</h3><ul><li>Artwork by Konsu Konsuke<br/></li><li>Japanese voice acting (except main character)<br/></li><li>English and Japanese language support<br/></li><li>CG/Scene Mode</li></ul>", "metacritic": null, "released": "2022-08-05", "tba": false, "updated": "2022-08-08T06:26:41", "background_image": "https://media.rawg.io/media/screenshots/dcf/dcf1152c371510b7cb4980c9f42e5961.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 376, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fan-na"], "genres": ["Adventure", "Indie"], "publishers": ["Sekai Project"], "esrb_rating": null}