{"id": 831844, "slug": "mello-haunted-house", "name": "Mello Haunted House", "name_original": "Mello Haunted House", "description": "Mello Haunted House is a 2D Survival horror game based on the story of an old haunted house located in Indiana which is said to be haunted by an angry old man's spirit.<br/><br/><br/><br/>The house was first built during the 1960s by Daniel Mello in Indiana. He was a wicked and an angry old man who used to pick fights and argue with the neighbours over little things. Nobody in that neighbourhood liked him because of his rude behavior. It was said that he was going through an acute depression and it was worsening day by day. One day, he jumped off the third floor of the building and died in the process. <br/><br/>Since he used to live alone in the house and had no legal heirs of the property, it was left vacant for years after his death. It was said that people passing by the property could sometimes hear weird laughing noises and many spotted the old man spirits with glowing red eyes in one of the windows of the third floor. The story was broadcasted in one of the news channels which picked the interest of many paranormal enthusiasts. <br/><br/>One of them was curious to find out if the property was really haunted and decided to visit the property during the night of the new moon. <br/><br/>You play as a paranormal enthusiast. Will you accept the challenge to enter the haunted house at night and face the old man's spirit?<br/><br/><h3>Key Features:</h3><ul><li>Explore the entire haunted house!</li></ul><ul><li>Come face to face with the Evil spirits!</li></ul><ul><li>Explore the dark basement area and the parallel world! </li></ul><ul><li>Collect items like keys, bolt cutter etc.</li></ul><ul><li>Nearly half an hour of paranormal investigation.</li></ul><br/><br/><strong>Note: I am a solo indie game developer and I have done all of the graphics, animation, programming, except for the music. I hope you will enjoy the game.</strong><br/><br/>", "metacritic": null, "released": "2022-08-05", "tba": false, "updated": "2022-08-08T04:42:00", "background_image": "https://media.rawg.io/media/screenshots/54e/54e3f3a45493719c739d749ca0d5cbfc.jpg", "website": "http://www.amaxang-games.com/2022/05/mello-haunted-house-2d-survival-horror.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Anamik Majumdar"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Anamik Majumdar"], "esrb_rating": null}