{"id": 831858, "slug": "morodashi-sumo", "name": "MORODASHI SUMO", "name_original": "MORODASHI SUMO", "description": "■ Single story<br/>This is the story of the earth that exists in the multiverse.<br/><br/>You are a sumo wrestler, a traditional national sport that Japan is proud of.<br/>I dreamed of becoming the highest-ranked \"Yokozuna\", the greatest medal for sumo wrestlers, and worked hard day and night to practice.<br/><br/>One day, you heard a rumor that all-purpose power was sealed in the winning trophy \"Chan-Kona\" of Morodashi Sumo.<br/>I decided to take on the challenge of \"Morodashi Sumo Battle Tournament\" as a test of strength.<br/><br/>Use all the wrestlers of \"grab\", \"push\", and \"fly\" to prove your existence to the yokozuna \"Sumo King\" who is waiting on the throne!<br/><br/>■ Local 2P match<br/>Select a sumo wrestler from [8 default characters,  up to 8 edit characters]<br/>Let's enjoy sumo wrestling with friends who are close to us!<br/><br/>■ Online 2P match<br/>Choose a sumo wrestler from [8 default characters, up to 8 edit characters] and jump into battle with the whole world.<br/>It is also good to participate in the war with an edit character and show off your proud coordination! Show off your battle sense and visual sense!<br/><br/>■ Avatar creation<br/>Customize [name, body, hairstyle, face type, face details, facial expressions, colors, accessories] to create your own alter ego!<br/>* We have introduced a novel accessory system, so please feel free to touch it.<br/><br/>■ Avatar Shop<br/>By using the prize money obtained from MORODASHI SUMO, you will randomly acquire accessories that can be used with avatars.<br/>Accessories that you don't know how to use at first glance may be coolly equipped depending on your ideas !", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-08T05:25:04", "background_image": "https://media.rawg.io/media/screenshots/8c0/8c0cda87ec528edc08b34c9fcedf11a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Bakumatsu Games"], "genres": ["Action", "Sports", "Casual", "Indie"], "publishers": ["Bakumatsu Games"], "esrb_rating": null}