{"id": 831864, "slug": "project-rbg", "name": "Project RBG", "name_original": "Project RBG", "description": "A fast paced first person shooter where each round has a minigame and map. After enough points have been collected, you go to The Shop to buy upgrades for The Final Round. Last one standing takes the cake!<br/><br/>There are currently 2 maps and 7 minigames.<br/><br/><strong>Minigames:</strong><br/>• Low Health Hunger (LHH) - Each time you eliminate someone, you gain health.<br/>• Sneaky Sacrifice (SS) - With one shot before each reload, each bullet is powerful enough to eliminate anyone at any range.<br/>• Hacking Haywire (HH) - Also confused with Haywire Hacking, someone seems to have messed with the guns. The stats have been improved but they can just barely do 99 damage per clip.<br/>• Recoil Rage (RR) - Guns are quite heavy sometimes, and you don't seem to have arms. Each time you shoot, the recoil is hard to deal with.<br/>• Shotgun Rangers (SR) - You now have a 10 bullet shotgun which fires 5 of it's pellets per shot.<br/>• Burst Rifle Mayhem (BRM) - Let's have some fun, burst rifles can be quite fun to shoot, so why not have one?<br/>• Bullets on Bullets (BOB) - Once you shoot, you can't stop. You have 99 bullets in each clip, and once you start shooting, every single bullet will be shot.<br/><br/>After enough minigames have been played so players have a lot of points, The Countdown Round will begin. The Countdown Round is a final round before The Shop to gain as many points as possible. After that round has finished, everyone goes to The Shop. In The Shop, players use both the points that they have collected, as well as any Cake Bonus points that they have earned as well. After leaving the shop, everyone takes what they purchase and has one last battle.", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-08T05:34:33", "background_image": "https://media.rawg.io/media/screenshots/fdf/fdfdd0de464c6215ed5c6f1ba2af39cc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RBAGD"], "genres": ["Action", "Casual", "Indie"], "publishers": ["GamEsnitzhel"], "esrb_rating": null}