{"id": 831863, "slug": "getting-it-up", "name": "Getting It Up", "name_original": "Getting It Up", "description": "<strong>Annihilate</strong> <strong>everything</strong> in your path using a variety of melee attacks and energy blasts. Upgrade your armor and acquire new abilities and power ups to decimate enemies as you fight to save your friend Alfred, the last of the powerful race know as 'Quantum ducks' from the clutches of Dr Bratwurst and his clumsy, 'screw-up-everything' minions. All the while you begin to realize the real villain is not who you first though and is <strong>FAR more powerful </strong>then you ever imagined..<br/><br/>Explore a wide variety of beautiful full 3D landscapes that give an immersive sense of depth to a side-on world.<br/><br/><br/><br/>A blend of 3D and 2D environments  <br/><br/><br/><strong>Destroy enemies with a variety of attacks and combos</strong><br/><br/><br/><strong>A variety of cool vehicles to unlock and upgrade. Then enter your car into tons of different racing modes like destruction derby death race, bomb tag, bolder canyon, air time and more..</strong><br/><br/><br/><strong>Use 'finisher combos' to obliterate enemies💪😈</strong><br/><br/><br/><strong>Upgrade your suit with powerful and new abilities like quantum kick, Shock-wave and energy blast.</strong><br/><br/><strong>A large cast of voice acted characters</strong><br/><br/><br/><br/><br/>Slash, dash and blast your way through a variety of enemies and bosses.<br/>Classic side-scrolling action, with a modern graphics upgrade.<br/><br/><strong>A 45° player rotatable camera gives a unique sense of depth to a side-scrolling world.</strong><br/><br/><br/><strong>3D open world areas to explore and enter races 🏎🏎.</strong><br/><br/><br/><br/>A wide variety of enemies and epic bosses like Octo-samurai, Hammer-hulk, Cyborg-cyclops, Sniper-bots, vampires,  ferocious beasts, <br/>ancient knights, Katana-Kazi's and Flaming-cyborg-ninja-zombies🔥🤖🐱‍👤🧟‍♂️  with nuclear powered lava spewing chainsaws ☢️🌋💀🗡️<br/><br/><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-08T05:33:12", "background_image": "https://media.rawg.io/media/screenshots/b43/b43d4a301d918be83e16009c20cb12ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 494, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jump Up Games"], "genres": ["Action", "Adventure", "RPG", "Racing", "Indie"], "publishers": ["Jump Up Games"], "esrb_rating": null}