{"id": 831856, "slug": "animalistic", "name": "Animalistic", "name_original": "Animalistic", "description": "<strong>\"An interesting game with solid mechanics, especially if you want to violently decimate anthropomorphic animals.\"</strong>-PC Invasion<br/><strong>\"Buttery smooth gun-play!\"</strong>-Big Banji<br/><br/><br/><strong>Animalistic</strong> is a fast-paced and ultraviolent shooter that fuses together the feel of both classic and modern FPS games. <br/>As the last human on earth, it is your duty to ferociously wipe out the remaining animals that are hunting you down.<br/><br/><br/>Pick from an arsenal of different <strong>weapons</strong> and your <strong>fists</strong> to brutally clear room after room of difficult yet fun-to-fight enemies. <br/>Animalistic's fluid gameplay allows for ultra-fast <strong>movement </strong> and <strong>combat</strong>.<br/><br/><br/>Animalistic will launch with 13 handcrafted levels with <strong>free content</strong> coming soon after launch! The levels are small but very detailed, stylish, and challenging. <br/>Upgrade your <strong>stats and high scores</strong> for each level and unlock fun and unique <strong>achievments</strong>.<br/><br/><br/>Play alongside a <strong>custom </strong> soundtrack created specifically for this game!<br/><br/>-------------------------------<br/><br/>WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES - READ THIS NOTICE BEFORE PLAYING<br/><br/>A very small percentage of people may experience epileptic seizures or blackouts when exposed to certain kinds of flashing lights or light patterns. These persons, or even people who have no history of seizures or epilepsy, may experience epileptic symptoms or seizures while playing video games. If you or any of your relatives has an epileptic condition or has had seizures of any kind, consult your physician before playing any video game.<br/><br/>IMMEDIATELY DISCONTINUE use and consult a physician if you or your child experience any of the following symptoms: dizziness, altered vision, eye or muscle twitching, involuntary movements, loss of awareness, disorientation, or convulsions. Parents should watch for or ask their children about the above symptoms.<br/><br/>You may reduce the risk of photosensitive epileptic seizures by taking the following precautions: sit farther from the screen, use a smaller screen, play in a well-lit room, and do not play when you are drowsy or fatigued.", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-08T05:17:45", "background_image": "https://media.rawg.io/media/screenshots/59b/59b9bffd09eaa1fe431d96af0564bce5.jpg", "website": "https://www.keatonapplebaum.com/game", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Keaton Applebaum"], "genres": ["Action", "Indie"], "publishers": ["Applebomb Games"], "esrb_rating": null}