{"id": 831988, "slug": "they-will-die-for-you", "name": "They Will Die for You", "name_original": "They Will Die for You", "description": "Welcome to Nebula LabsBackground\r\n<p>The Nebula Labs. is a laboratory that specialized in the creation of clones with the only purpose of serving the human race. These clones are so good in fact, that they will even die for their bosses... Like, literally, they end themselves to make the tasks. So, help Nebula Labs to guide the clones to better understand what it means to \"die for your work\".<br/></p>\r\nGameplay\r\n<p>In the game, you control a clone in a platform environment where the objective is to activate pressure plates using the body of the \"sleeping\" clones. \r\n</p>\n<p>The clones can only kill themselves using guns, so be sure to take one from the corpses, or the ones that the staff leave in the area.\r\n</p>\n<p>When all the pressure plates are active, the door will open and you can go to the next room.\r\n</p>\n<p>Have luck! Kill a lot of clones!\r\n</p>\n<p>\n</p>\n<p>The controls are <strong>WASD </strong>to move, <strong>space </strong>to jump, and <strong>F</strong> to suicide.\r\n<br/></p>GameJam State\r\n<p>In the GameJam state, we only have four levels pretty basic and not hard at all. I've run out of time so had to improvise the levels. My original idea was to have at least 10 levels, and many other mechanisms and traps to activate or go through, like normal buttons, spikes, pits, bridges, and also different types of guns, like freezing rays, flamethrowers, and so on.</p>\n<p>The game also doesn't have any sounds or options for the resolution.</p>\n<p>Aaaaand, there is a bug. I have mistaken the indexes and the game blocks after the last stage.</p><p>Feel free to leave any suggestions and reviews. Even if it is unfinished and I didn't add a bunch of features, I liked the end product. Had a lot of fun while doing it, so I'll probably work some more on this sometime.</p><p> Thanks, and I hope you like it!</p>", "metacritic": null, "released": "2022-08-07", "tba": false, "updated": "2022-08-08T07:15:28", "background_image": "https://media.rawg.io/media/screenshots/15f/15fb93691b535684b56a2c8a54427f6d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Thiago L."], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}