{"id": 831996, "slug": "isletopia", "name": "Isletopia", "name_original": "Isletopia", "description": "<p>Isletopia is a relaxing strategy game of greenifying barren islands. Use plants as your building blocks and optimize their placement in different biomes to make them teeming with life once again!</p>\n<hr />\n<p>Get away from everything, if even for a while, and land on the islands of Isletopia. Your journey of greenifying starts with islands in varying desolated biomes. It is up to you to find the best ways to recover the islands in lush green once again.</p>\n<p>Enjoy the relaxing atmosphere of Isletopia and marvel at your beautiful creations, as you explore an infinite amount of procedurally generated islands!</p>\n<p>Features:<br />\n- intuitive city building, but with plants as your building blocks<br />\n- a relaxing and vibrant island atmosphere<br />\n- infinite amount of procedurally generated islands<br />\n- perfect for short play sessions, and coming back to explore new islands and beat your high score</p>\n<p>What does the gameplay look like?<br />\nEach playthrough begins with a new barren island to greenify. You begin with a set of different plants to start greenifying the island. This gives you points based on how well you place them, as they are affected by terrain and other objects around them. Gain enough points to receive more plants to place, and unlock new types of not just plants, but also the ability to transform terrain and add beneficial structures.</p>\n<p>Greenify enough of an island to unlock the option to begin biome restoration of a new procedurally generated island. The game ends once your inventory is emptied. Marvel at your beautiful creation and be compelled to start a new round and attempt to beat your high score. Each playthrough is unique – so how many islands can you restore in one?</p>\n<p>Note from the developers:<br />\nIsletopia is a game created by a small, but passionate team. Our goal was to make a relaxing game that lets you express your creativity in very satisfying shorter game playthroughs.While the game doesn&#39;t have 10s of hours of hand-crafted content, the procedurally generated islands and varied biomes offer plenty of replayability.</p>\n<p>Simple to pick up for a quick play session, while also allowing you to challenge yourself and beat your previous high score – or just build more beautiful islands!</p>\n<p>We want your experience of Isletopia to be as enchanting as possible, so please don&#39;t hesitate to contact us for feedback, questions, issues,...Our team will do our best to get back to you as soon as possible.</p>\n<p>Isletopia was inspired by these amazing games which helped us shape a combination of very rewarding mechanics:<br />\n- Terra Nil<br />\n- Islanders<br />\n- Dorfromantik</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-08-08T07:27:17", "background_image": "https://media.rawg.io/media/screenshots/564/56441a708bf880fcbd71ce6341a15fab.jpg", "website": "https://store.steampowered.com/app/1861260/Isletopia/", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": [], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": [], "esrb_rating": null}