{"id": 83197, "slug": "dungeonroller-random-stats", "name": "DungeonRoller - Random Stats", "name_original": "DungeonRoller - Random Stats", "description": "Dungeon Roller is a random generator for Game Masters, DM's, and RPG players of all types, specializing in automatically creating worlds, settings, and story elements from a huge database.<br/><br/>Use our powerful generator to create literally quadrillions of characters, creatures, encounters and locations! With generator topics from sci-fi to fantasy to westerns, we've got you covered no matter what campaign you’re running. A simple tap of the button will re-generate a new result, so you'll never be out of ideas again!<br/><br/>Dungeon Roller Features:<br/><br/>Create Your Own World<br/>- No one does world building bigger or faster than Dungeon Roller. With the power of random generation, you can make anything from the biggest galaxy down to the smallest halflings, complete with stats and skills, ready to be played.<br/><br/>Develop Your Creations with Multiple Characteristics<br/>- Each monster, planet, unit, culture, etc. that you create comes pre-equipped with specific information such as name, life type, orbit for solar systems, deployment type for army units, and much more. Anything you need to build your campaign is pre-included, and changes with each tap of the finger.<br/><br/>Unlock Even More Options<br/>- Dungeon Roller lets you create your very own planets and solar systems by default. Use our bundles to unlock even more creative potential, from supervillains to elves, dwarves, orcs and more!<br/><br/>Save and Share Your Creations<br/>- Once you’ve created something in the maker, it’s easy to save your work for later reference or share it with friends – totally free!<br/><br/>Perfect for RPG Developers and Dungeon Masters<br/>- Whether you’re looking to bring life to your next tabletop session, write up a compelling new tale or create your own game, Genesis has the powerful tools to make it happen.<br/><br/>With Dungeon Roller, characters, worlds and entire galaxies spring to life with just the tap of a button. Try it FREE today and create your story!<br/><br/>And be sure to check out Characterize, the character generator, available now on the App Store!", "metacritic": null, "released": "2016-06-29", "tba": false, "updated": "2019-10-22T14:05:30", "background_image": "https://media.rawg.io/media/screenshots/4ab/4abbcd5ab48124d9116619aab4ddfe5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexander Winn"], "genres": ["Adventure", "RPG"], "publishers": ["Alexander Winn"], "esrb_rating": null}