{"id": 832136, "slug": "shoveling", "name": "Shoveling", "name_original": "Shoveling", "description": "<p>You play a shovel with Physics mechanics and also control your knight. You act like a boomerang and hit the enemies. Move on and reveal the story. <br/></p>\n<p>I tried to make an authentic gameplay style. It has a small story, and an arcade mode. </p>\n<p><strong>How to Play and Controls:</strong></p><ul><li>Use <strong>WASD</strong> to move. Space to toggle between knight and shovel. You can think it like throwing your shovel, being able to control it and take it back to knight. <ul><li><strong>S</strong> button also makes you dive faster meaning more damage.</li></ul></li><li>Use <strong>K</strong> and <strong>L</strong> keys to scale shovel. Kill enemies with gaining momentum and hitting your shovel. <ul><li>Damage increases by heavier and faster shovel. Smaller shovel means being fast, but lowers damage. Heavier means you hardly move shovel, but you can deal great damage in situations like diving from above. </li></ul></li><li>Beware that your shovel can be stolen when health reaches 0! You have to restart that level when this happens. </li><li>Use <strong>ESC</strong> go back to menu. </li><li>Use <strong>R</strong> button If you die, or a bug happens, or simply want to restart. </li></ul><p>You have to eliminate all the enemies in order to go to next level. Enemy number will grow with time if you can’t kill them all. But it will stop when it reaches a number. </p><p>Door will be opened when enemy count is 0.</p><p>I tried to teach the player step by step, using only shovel first, then adding knight.</p><p><em>Tip: You can create  </em><em>oscillation by simply moving back and forth, you can cause more damage like this.</em></p>\n<p>—-</p><p>I had a little problem with uploading the game. Because of timezone difference i nearly missed deadline. It has one more folder than it should have. Please contact me if you know how to play this zip version of the game :( I am sorry if you have problems launching the game! (I think it works on browser right now!!! Problem Solved!?)</p>\n<p>https://liluo.io/midekoruyucu/shoveling</p>\n<p>This is liluo.io link just in case.<br/></p>\n<p>I didn't have much time for this project. I completed it in 4 days, and uploaded in last 5 minutes. I hope you enjoy. This is my first gamejam and game!</p>", "metacritic": null, "released": "2022-08-07", "tba": false, "updated": "2022-08-08T08:23:18", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MideKoruyucu"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}