{"id": 832106, "slug": "thirty-six", "name": "Thirty-Six", "name_original": "Thirty-Six", "description": "<p>You've finally tracked down a copy of <em>Thirty-Six</em>, a long-forgotten board game from the '70s. It's rare enough that its existence was considered apocryphal, but you were confident that there was something to the rumors on forums and old usenet threads.</p>\n<p>It took more than a few train rides and back alley meetings, but you've found it: the strange novelty board game enchanted so that it could only be played once. Eager to document your experience, you sit down at the nearest table, bright sunlight illuminating the game in front of you. Your friend has volunteered to play the role of the game master, forfeiting any chance they have of getting their own turn.</p>\r\nWhat is it\r\n<p><em>Thirty-Six </em>is a 64x64 trial and error game in which you have to solve puzzles with no undo. Levels can have different rules, and it's up to you to figure them out without losing. Made for LOWREZJAM 2022, it was inspired by 4x4 from LOWREZJAM 2020.</p>\n<p>This is a one and done game. Your progress will be saved, and you cannot replay the game.</p>\r\nHow to Play\r\n<p>Arrow keys/WASD/D-pad – Move.</p>\n<p>Figure it out as you go.</p>\n<p>C – Toggle colorblind mode.</p>\n<p>M – Toggle audio.</p>\n<p>-/+ – change game scale.</p>\r\nTips\r\n<ul><li>Consider your options before moving. Sometimes you will start one move away from defeat.\r\n</li><li>All levels are possible.\r\n</li><li>Failure is inevitable.</li></ul>\r\nColorblind Mode Cheatsheet\r\n<p>Since space is at a premium, each color is identified by one character,  which can lead to some ambiguity. Here's what color each character corresponds to.</p>\r\nB is blueR is redG is greenY is yellowX is dark grayx is grayP is purple= is brownW is whiteb is sky blueT is teal\r\nCredits\r\n<p>Game by Kevin Hutchins</p>\n<p>Inspired by 4x4 by Val Hutchins</p>\n<p>Logo font uses a modified Alagard by Hewett Tsoi</p>\r\nLooking for More?\r\n<ul><li>The inspiration: 4x4</li><li>A great version of FreeCell: lowercase freecell</li><li>My last LRGJ game, a series of microgames: What a Card!</li><li>A not fun game where you wander aimlessly in a pitch-black tomb: The Insatiable Tomb of Ratakanen</li><li>A game that took me 8 years to make: ProtoBound</li></ul>", "metacritic": null, "released": "2022-08-07", "tba": false, "updated": "2022-08-08T08:10:57", "background_image": "https://media.rawg.io/media/screenshots/de1/de1f3905af691a81b2caf5dc293e2d95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kevin Hutchins"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}