{"id": 832363, "slug": "spaced-bwi-bwi", "name": "Spaced Bwi Bwi", "name_original": "Spaced Bwi Bwi", "description": "<p>It's sunday night, and Space Bwi Bwi is the only open place (where you won't get assaulted by non-Federation space pirates) in the vicinity.</p>\n<p>Join our 2-person team, our cook (and former aforementioned assaulter) Cassandra, and Rufus, our overeager waiter, in a cosmic ballet to serve awesome dishes to a variety of hungry (and somewhat demanding) customers !</p>\n<p>You still have a few minutes left before the diner closes. Try to make the most of it.</p>\n<p>Embrace a gameplay centered on imperfect communication: Rufus will have to describe delicious (ie French) meals to Cassandra with unnerving fuzzy keywords, and she'll have to try to understand what is required.</p>\n<p>Will the patrons be satisfied ?</p>\n<p>Will the tips be sufficient to keep Space Bwi-Bwi open in the future ?</p>\n<p>You tell us!</p>\n<p>Disclaimers :</p>\n<p>Space Bwi Bwi does NOT care about your allergies. Don''t kick the jukebox.<br/></p>\n<p><strong>How to play</strong></p>\n<p>You'll have 5 minutes to serve as many patrons as you can. The more satisfied they are, the more tips you'll earn.</p>\n<p>Try to maximize your score !</p>\n<p>This a 2player networked game, you'll need to understand IP addresses. If you don't have UPNP, you'll need to grok NAT and firewalls too.</p>\n<p>The server uses the UDP port 22017.</p>\n\n<p>Now, here's how the game goes:</p>\n<p><strong>The dining room</strong></p>\n<p>Patrons will enter Space Bwi Bwi and will choose a table.</p>\n<p>You'll move Rufus, with the keyboard arrows. Go near a patron and click him, you'll see the meal he wants to order.</p>\n<p>Try to describe it with the keywords, and send the order to Cassandra !</p>\n<p>She will hopefully make a matching plate (or bowl). Go near the tray, take it and deliver it to the patron.</p>\n<p>He will tell you how satisfied he is. Try to improve your communication with Cassandra for the next one and cash in!</p>\n<p><strong>The kitchen</strong></p>\n<p>Rufus will send you notes with a few keywords.</p>\n<p>With the mouse, select a bowl or a plate, and try to compose a matching meal with all the ingredients on the right side.</p>\n<p>If you're not satisfied, there's always a garbage pail!</p>\n<p>At some point you'll want to send it back to Rufus so that he can deliver it, and you'll get feedback.</p>\n<p>Rufus is doing his best, so hopefully the next meal will be easier to compose!</p>\n<p><strong>Legalese, licence, and credits<br/></strong></p>\n<p>This game was made with Godot Engine for fun, and is globally a balecware. We'll define it when and if needed in the trial that will ensue when you'll steal our beautiful assets for your MMORPG.<br/></p>\n<p>Everything but the music was made with love, Lucas's kitchen utensils (and a bit of panic, TBH) by Aurore, Bertrand, Florent and Lucas</p>\n<p>The music tracks are Space Jazz and Derp Nugget by Kevin McLeod<br/></p>\n<p>https://www.youtube.com/channel/UCSZXFhRIx6b0dFX3xS8L1yQ</p>", "metacritic": null, "released": "2022-08-07", "tba": false, "updated": "2022-08-08T10:05:26", "background_image": "https://media.rawg.io/media/screenshots/402/402c1a237000cbf8cb5ba1e59ec00b7e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Rormattio", "fmdkdd", "fromagechaud", "Tramboi"], "genres": [], "publishers": [], "esrb_rating": null}