{"id": 832482, "slug": "poly-mission", "name": "Poly Mission", "name_original": "Poly Mission", "description": "<p>Welcome to Poly Mission - the two-player game of polygonal coordination!</p>\r\nHow To Play\r\n<p><strong>As Plane:<br/></strong></p>\n<p>Provide air support for your teammate on the ground. Use WASD to steer the aircraft. Hold SPACE to drop bombs, and press 1 to drop a health package. Follow blue arrows to reach restock points when you run out, and keep an eye on your teammate. Try not to bomb your teammate's tank - it will look the same as an enemy's on your radar!<br/></p>\n<p><strong>As Tank\r\n</strong>\n</p>\n<p>Survive. Use arrow keys to move the tank. Use the left mouse to aim and shoot. Right click to use an ability (only available once unlocked), and press the middle mouse button to send a signal flare for your teammate. The aircraft has limited supply before it needs to refill, so work with your teammate to make the most of them!</p>\r\nSound Credits:\r\n<p>\n</p>\n<p>Flare sizzle\r\n  </p>\n<p>https://soundbible.com/1902-Fire-Burning.html\r\n  </p>\n<p>Flare pop\r\n  </p>\n<p>https://soundbible.com/1271-Harpoon.html\r\n    </p>\n<p>Explosion\r\n  </p>\n<p>https://soundbible.com/538-Blast.html\r\n    </p>\n<p>Player shot\r\n  </p>\n<p>https://soundbible.com/1371-Uzi-Shooting.html\r\n    </p>\n<p>Enemy shot\r\n  </p>\n<p>https://soundbible.com/1452-Shooting-An-MP5.html\r\n    </p>\n<p>Shotgun\r\n  </p>\n<p>https://soundbible.com/1706-Shot-Gun.html<br/></p>\n<p>\r\nHitmarker</p>\n<p>\r\nhttps://quicksounds.com/sound/14/hitmarker</p>\r\nNotes:\r\n<p>- this game was made for the Multiplayer Game Jam in 9 days (although in practice it was more like 7 days because of other stuff getting in the way)</p>\n<p>- all enemies will finish spawning after 8 minutes, making each play session about 10 minutes long (unless you decide to go to freeplay mode,  in which anything goes)</p>\n<p>- there are some issues with enemies spawning inside walls that I could not fix thanks to time constraints; the victory message will not trigger until all enemies are dead, so if you think you should have won already, check the map to make sure there are no enemies inside walls (bomb them accordingly if you find them)<br/></p>\n<p>- on a similar note, there is theoretically a very small chance for the player to spawn inside a locked room (this has personally never happened to me, but the world generation can be unpredictable); if this happens, restarting the game should fix the problem<br/></p>\n<p>There were a few features that didn't make it in and a few bugs that I couldn't fix because of the time constraints, but overall, this is still something that I'm proud of. Enjoy!<br/></p>", "metacritic": null, "released": "2022-08-07", "tba": false, "updated": "2022-08-08T11:03:58", "background_image": "https://media.rawg.io/media/screenshots/6b3/6b342cb5e0e47b6bc8da853fc7c5499e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Incognito_User"], "genres": ["Action"], "publishers": [], "esrb_rating": null}