{"id": 83252, "slug": "jurassic-rampage-smash-the-city", "name": "Jurassic Rampage: Smash the City!", "name_original": "Jurassic Rampage: Smash the City!", "description": "Let loose a frenzy of prehistoric destruction and fight off an entire army with Jurassic Rampage! Stomp, smash, and bite a fully destructible town to pieces! Unleash a ferocious roar to send your enemies flying, use your powerful jaws to crumble entire buildings, and stomp soldiers into the ground with your massive Tyrannosaurus Rex!<br/><br/>Download Jurassic Rampage today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>+ T. REX RAMPAGE - Use your entire arsenal of weapons to smash the city to bits and earn points!<br/>+ BATTLE AN ARMY - Fight off soldiers, tanks, and attack helicopters that will come to the rescue of their beloved city!<br/>+ LEVEL-UP AND GROW - Grow into a massive monster, destroy towering sky scrapers, and squish dozens of civilians and soldiers with a single step!<br/>+ TWO GAME MODES - Smash for as long as you can in Survival Mode or challenge yourself with an invincible free-for-all in a 2-minute Time Attack!<br/>+ FULLY DESTRUCTIBLE 3D TOWN - Your T. Rex is free to unleash it's rage on every last brick of this unsuspecting town!<br/>+ HD GRAPHICS - Stunning High Definition graphics will have you cowering in fear of your own T. Rex!<br/>+ GLUTEN-FREE PROMISE - With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download Jurassic Rampage and unleash your very own Tyrannosaurus Rex on an epic frenzy of carnage!<br/><br/>Be sure to check out our awesome Virtual Pets! Howl at the moon with the Virtual Pet Wolf or burn villages to the ground with the Virtual Pet Dragon!<br/><br/>Like us on Facebook!<br/>facebook.com/glutenfreegames <br/><br/>Follow us on Twitter!<br/>twitter.com/glutenfreegames<br/><br/>Big thanks to Kevin MacLeod for providing great music Royalty Free:<br/>Hitman by Kevin MacLeod (Incompetech.com)", "metacritic": null, "released": "2014-07-10", "tba": false, "updated": "2019-10-22T14:22:00", "background_image": "https://media.rawg.io/media/screenshots/a8d/a8db1529a675993f0f97a9dc901132f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gluten Free Games"], "genres": ["Action", "Arcade"], "publishers": ["Gluten Free Games"], "esrb_rating": "Everyone 10+"}