{"id": 832987, "slug": "indiepocalypse-31", "name": "Indiepocalypse #31", "name_original": "Indiepocalypse #31", "description": "ISSUE #31\r\nCover - Sloane Leong\r\n\n\n<p>Hello and welcome to Indiepocalypse!</p>\n<p>Indiepocalypse is a curated monthly collection looking to highlight the very best of the indie game scene. </p>\n<p>Each month features games by 10 different developers, including a newly commissioned game exclusive to the bundle-zine. The games cover a wide variety of styles, genres, and themes as they fight against any definition of \"indie game\" as a genre.</p>\n<p>Also, and this part is very important to me and should truly be taken as given, each contributor is paid and developers are paid royalties on all future sales.</p>\r\nThis Month's Games\r\n<br/>a catfiend's impending relapse (WIN/MAC/Linux) by beetlestench\r\n\n<p>You are GIL KUR, an aging academic investigating bacterial phenomena deep within the vacuum caverns surrounding your home. While seeking the source of a temporal maelstrom, you must stay focused and keep your head above water—a catfiend left alone with their thoughts is a most unsavory thing.</p>\n\n\r\nYOU DID A BAD THING NYK! (WIN/MAC/Linux) by nykTV\r\n\n<p>2D retro-throwback platformer with 9 \"NES-HARD\" levels of HELL where you play as a Queer Dog Girl!</p>\n\n\r\nPARTICLE MACE (WIN) by Andy Wallace\r\n\n<p>PARTICLE MACE is a game by Andy Wallace about defending yourself in a hostile universe by swinging particles into enemies.</p>\n<p>PARTICLE MACE is a game about capturing the thrill of classic arcade games with a new, physics based mechanic.</p>\n<p>PARTICLE MACE is a game about trying not to die, but that's impossible.</p>\n\n\n\n\r\nFear the Void: Prologue (WIN) by ExtraCosmic Studios\r\n\n\n<p>Something goes wrong during your commute home, leaving you in quiet darkness. Can you find your way out? And are you sure you're alone?</p>\n<p>An atmospheric horror game, that will get you consumed…</p>\n\n\r\nlast november (WIN/MAC/Linux/Web) by d.h. croasdill\r\n\n<p>\"last november\" is an interactive, erasable poetry zine made in Twine by d.h. croasdill (https://hyperlibrary.itch.io). Readers can toggle any word on any page on or off to create their own erasure poems.</p>\n\r\nPotato Quest (Physical) by Kaden Ramstack\r\n\n<p>Potato Quest is a beginner-level \"adventure module\" perfect for any kitchen!  Includes party comp, equipment, and boss strategies! 🥔</p>\n\n\r\nThe Empty City (Web) by Lolon\r\n\n<p>Inspired by the visuals and sound of the Playstation 1, The Empty City is a story-focused adventure game where you explore sunken buildings, overrun underpasses, flooded streets and a hill overlooking a city with a story to tell.<br/></p>\n\n\r\n\r\nSomething Is Wrong With The Chickens (Physical) by Elliot Davis\r\n\n<p>Something Is Wrong With The Chickens is a one-page, rules-lite TTRPG of Chickens, Eldritch Horror, and Revenge for 2+ players, including 1 Chicken Master (CM). Featuring an original, easy-to-learn 3d6 system, 6 unique Chicken Types and Eldritch Traits, and random tables of stakes and settings, no two games will be the same.</p>\n\r\n\r\n3 Hours Of Style (WIN/MAC/Linux/pico8) by Wistpotion\r\n\n<p>A rookie and their models take the stage. Unprepared but fierce, they snatch clothes as they go, all to beat their competitors. They surely have potential.</p>\n<p>Maybe Grandmother becomes impressed.</p>\n\r\n*NEWLY COMMISSIONED FOR INDIEPOCALYPSE*\r\nXxxatharxyx [It's Going To Be Alright] (WIN) by L.O.V.E. Games\r\n\n<p>Xxxatharxyx (sounds like \"Catharsis\") is an extremely queer top-down action-RPG.  Rescue the demons and their power is yours, for a price: they will use your body to reproduce! <strong><em>NOT FOR KIDS</em></strong></p>\n\n\n\n<p> </p>\n<p><strong>*BONUS*Electric Zine Maker </strong>(WIN/MAC) by alienmelon</p>\n\r\nLauncher Courtesy of MM Bundle Launcher\r\n\r\nIndiepocalypse zine contents\r\n<p><strong>COMICS<br/></strong><em>el gato by cryocannon<br/>Tuesday Lunch </em>by Sam Pender</p>\n<p>Interested in the Indiepocalypse being delivered straight to you every month? Sign up for the <strong>PATREON</strong>.</p>\n<p>If you are interested in contributing to Indiepocalypse check out the submission page:</p>\n<p><strong>SUBMIT YOUR GAME TO THE INDIEPOCALYPSE</strong></p>\n<p><strong>TUNE INTO INDIEPOCALYPSE RADIO, SATURDAYS 2pm EST</strong></p>\n<p><strong>FOLLOW INDIEPOCALYPSE ON TWITTER</strong><br/></p>\n<p><strong>COMIC ARTISTS AND OTHER ZINE CONTRIBUTORS APPLY HERE</strong></p>\n<p><strong>SIGN UP FOR THE NEWSLETTER </strong>(and get free copies of the PDFs!)</p>\n<p><strong>THE FULL INDIEPOCALYPSE CATALOG</strong></p>\n<p><strong>DISCORD</strong></p>\n<p><strong>ADVERTISE WITH US</strong></p>", "metacritic": null, "released": "2022-08-05", "tba": false, "updated": "2022-08-08T14:50:20", "background_image": "https://media.rawg.io/media/screenshots/b64/b64e7af6e7584957c09be2efaa6b7554.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["PIZZAPRANKS"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}