{"id": 832921, "slug": "play-me-re-demo", "name": "Play Me RE (DEMO)", "name_original": "Play Me RE (DEMO)", "description": "!Disclaimers!\r\n<p>\n</p>\n<p><strong>This game contains contains things that may disturb some audiences, viewer discretion is advised for the following:</strong></p>\n<p>Depiction of torture</p>\n<p>Alluding to kidnapping / being held against will</p>\n<p>Cannibalism</p>\n<p>Blood,<em> I mean that's expected</em></p>\n<p><strong>This game is a DEMO and only has a snippet of what the final product will have, so this list may be longer in the future.</strong></p>\r\n!Another Disclaimer!\r\n<p>I made this game by myself, I made the art, music, writing </p>\n<p>(sound effects and coding aren't mine, I used rpg maker mv for that)</p>\r\nTHAT BEING SAID\r\n<p> I am one person, I play tested this game as much as I could, so it will not be perfect! If there is a bug, typo, or general problem with the game, please point it out so I can fix it!</p>\n<p>This is my first game</p>\n\r\nDescription\r\n\n<p><strong>You play as RE, RE has to do weekly tasks. They follow a schedule of:</strong></p>\n<p> collecting their essentials, those including food and their climbing knife.</p>\n<p>Playing with their friends and helping them in any way.</p>\n<p>And checking up and feeding<strong> them.</strong></p>\n<p><strong>Nothing too hard to do, then just go back to your room and sleep things off!</strong><br/></p>\n<p><strong>This is over the course of 4 weeks</strong></p>\r\nCharacters\r\n\n<ul><li><strong>RE (They/Them) : </strong>The player character, RE is rather quiet for the most part. They like to stick to a schedule and not stray from their set path. Yet even though they can be strict and quiet, RE has a soft spot for their friends, happy to help them out when time comes. Truly, they care deep down.</li></ul>\n\n<ul><li><strong>Scrimly (He/Him):</strong> A mouse like creature, Scrimly is very bubbly and loud, mostly speaking in a loud tone (he does not have an inside voice). While he may be a little air headed, Scrimly enjoys any sort of company and is friendly to almost anyone! He loves to entertain and dance around, if you're ever bored, Scrimly will keep you company!</li></ul>\n\n<ul><li><strong>Rolfus (They/Them): </strong>Rolfus is a gentle giant in a sense, being the biggest of the group, Rolfus almost looks like a spider horse. Despite their size, Rolfus is truly a loving person! Being almost like a motherly figure, Rolfus is nurturing and caring for their friends. They enjoy to read and make picnic's, really the little things in life make them all the more happy.</li></ul>\n\n<ul><li><strong>Jellie (She/her):</strong> Jellie's name is almost explanatory, looking almost jellyfish like, she can slightly hover off the ground. She isn't the friendliest girl you'd meet, being rather rude at times, but don't doubt her completely. Once you wear her down, she actually ends up being quite nice and talkative. A rather inquisitive girl, Jellie likes to question things even if she doesn't like the answer. She has a hard shell, but a warm heart.</li></ul>\r\nQuestions and Concerns\r\n\r\nI just want to clarify a few things by answering some questions that may be asked!\r\n<ul><li><strong>How much will the full game be?</strong><ul><li> This is my first game, so I personally want it to be free. When I make the full release, it will be completely free, so please enjoy it to your hearts content!</li></ul></li><li><strong>When will this game come out?</strong>\n<ul><li>Well, the simple answer is: I'm not sure. This project is sorta a hobby for me that I've worked on and off on.  Again, I don't want any money from this game, so I kinda put my life first, then game. Yet I'll still work on it! I'm almost finished with week 2, so slowly, but surely, this game will come out!<br/>\n</li></ul></li><li><strong>How many endings will there be in the full game?</strong>\n<ul><li>In the final game, I plan to have 5 base endings. This'll be based on bonds and <em>other factors.</em> Absolutely <strong>no secret endings, </strong>definitely none, don't worry.</li></ul></li><li><strong>Are there any secrets in the demo?</strong><ul><li><em>for legal reasons, I am unable to disclose this information.</em></li></ul></li><li><strong>Will there be a Scrimly petting feature?</strong><ul><li>Possibly.</li></ul></li></ul>\n<p>________________________________________________</p>\r\nPlease enjoy the game DEMO\r\n<p><strong>If you would like, you can follow me on my instagram</strong></p>\r\n@Your_God_Off_Brand\r\n<p>I post art and stuff </p>\n<p><em>(mostly unrelated to my game, but its cool)</em></p>", "metacritic": null, "released": "2022-08-06", "tba": false, "updated": "2022-08-08T14:22:56", "background_image": "https://media.rawg.io/media/screenshots/76e/76e3678d9bdf0b49a57f3e4c998616d7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["OffBranded"], "genres": [], "publishers": [], "esrb_rating": null}