{"id": 833061, "slug": "the-last-lightbearer", "name": "The Last Lightbearer", "name_original": "The Last Lightbearer", "description": "<p><strong>Story</strong><br/>The Last Lightbearer tells the story of a world at it's end, prophesied to have been saved nearly three centuries ago by it's savior, the Lightbearer, who never appeared, allowing demons from an unknown world run rampant, leaving a path of destruction in their wake as corruption, an incurable plague, spreads across the earth.<br/> In mankind's final bastion, Aegis, resides Stella, a strong willed fighter who sees herself as the one meant to be the world's savior, as, in her eyes, the destined Lightbearer was simply a coward who allowed the world to come to it's end, seeing them as just as responsible as the demons for the state the world is in.<br/> But as Stella becomes infected with the corruption, and in her final moments before it fully consumes her, she comes across a mysterious young girl who miraculously pushes back the corruption in her body and nurses her back to health. But before she can return the girl to Aegis, Stella finds her new companion has disappeared, and so she begins her quest to recover this girl and bring her to safety, seeing her as the key to mankind's survival, not realizing just who this girl is...</p>\n<p><strong>Synopsis</strong><br/>Unlike many turn based RPGs, The Last Lightbearer does not have random encounters, levels, or gear.<br/>Instead, you, the player, must learn enemy patterns and tells to succeed. Each fight is carefully crafted with a specific mechanic in mind to test the player's ability to pay attention, and think ahead, as simply attempting to force one's way through would result in a quick demise.<br/>By watching for these enemy tells, learning patterns, keeping track of statuses, and watching counters above the enemy (and likely a few retries as well), long, hard fought battles will become progressively easier, until victory is achieved.<br/> But keep in mind that each fight is there to help prepare you for what is to come!<br/> Combat in the early stages of the game are simple in order to introduce unique core mechanics to the game that the player will need to be aware of. But as the game progresses, combat will become more challenging, punishing, and certain patterns must be handled in specific ways in order to succeed.<br/> Revival is not an option! If one character dies, it's game over. Use every skill wisely to assure no one falls!<br/> Losing a fight does not mean going through menus and walking all the way back to the fight. It will quickly restart after each character falls, and there is even a retry item, should you feel the need to use it.<br/><br/><strong>Current Plans</strong><br/>Final encounter and chapter. Possibly an epilogue as well.<br/> More flavor text! NPCs, interactives, lore books, etc.<br/> Custom art?<br/> More side quests?<br/> Change overall status visibility?<br/> Plenty of other fixes, for sure.<br/><br/></p>\n<p><strong>Conclusion</strong><br/>This game is a big learning project for me, as I wanted to make something on my own. The entire story, and all of the mechanics, were essentially learned and placed on the go. I wanted to challenge myself to see what I could do, while learning what I could at the same time, and this was the result.<br/> I don't like using assets made by others, excluding ones I either make myself or purchase, so I only used what I had from base assets and dlc, some with a few minor modifications. Purchased Yanfly plugins were also used.<br/> My intent is to just get started in projects such as this, and keep moving up and forward, but I need to build up my personal skills first.<br/> While it is not completed, though it is fairly close to being so, I wanted to begin putting it out there for people to try, and hopefully give some feedback on.<br/><br/> As of now, there is roughly 6 hours of (mostly) linear gameplay.<br/> <br/>Thank you for your time, and I hope you enjoy!</p>", "metacritic": null, "released": "2022-08-05", "tba": false, "updated": "2022-08-08T15:24:59", "background_image": "https://media.rawg.io/media/screenshots/4e3/4e3eee4834fc7ea891fccc71cb181161.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Serenity"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}