{"id": 8331, "slug": "bricasso", "name": "Bricasso", "name_original": "Bricasso", "description": "\"How good would it be if you could play with Lego wherever you are, without having to carry around the little bricks? That dream is now a reality thanks to the new iPhone app Bricasso.\" - Gizmodo, December 2010<br/><br/>\"I had strong doubts about how well this could actually work, but I couldn't have been more wrong. The interface and controls are simply flawless. If the idea of having the chance to play with lego-like building blocks on your iDevice holds any appeal at all, don't hesitate for a second to pick this up.\" - Gabrien, TouchArcade<br/><br/>Featuring a beautifully intuitive interface that really captures the feel of building with toy bricks, you'll be letting your imagination run wild in seconds.  There's no complicated controls or cameras to get the hang of, just a simple drag and drop interface that perfectly recreates the feeling of building the real thing.<br/><br/>If you like the sound of a portable box of bricks that you can build with anywhere, anytime, then what are you waiting for - get Bricasso!<br/><br/>Features:<br/>One of the most intuitive interfaces ever seen for building with virtual bricks.<br/>Nine colourful background scenes to inspire you.<br/>Dozens of authentic colours to choose from.<br/>Dozens of brick types to play with; bricks, plates, wheels, cylinders, slopes and tiles are all here!<br/>In game tutorial explaining everything you need to know about Bricasso in a few simple lines.<br/>Share your creations with others using the easy-to-use screenshot option.", "metacritic": null, "released": "2010-11-30", "tba": false, "updated": "2019-10-22T14:29:47", "background_image": "https://media.rawg.io/media/screenshots/fbb/fbb927d553fdd4e9fdb52e2a8acee8fb.jpeg", "website": "http://www.lemursoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lemur Software"], "genres": ["Educational"], "publishers": ["Wade Perry"], "esrb_rating": null}