{"id": 83329, "slug": "top-gear-stunt-school-hd", "name": "Top Gear: Stunt School HD", "name_original": "Top Gear: Stunt School HD", "description": "If you strapped a jet engine to a racing car would you be able to make it jump 100ft into the air?  Possibly... and in Top Gear Stunt School you can try this plus loads more ridiculous stunts.  There are over two billion different combinations of upgrades and add-ons that you can use to modify your car to try to beat the challenges!<br/>• 60 unique physics-based stunt challenges to complete, with 20 additional “sandbox” challenges.<br/>• Unparalleled level of car customization!  Fully customize 9 iconic car types with unlockable upgrades that change how a car drives, like jet engines, monster truck tires, armour plating or cargo wagons – over 2 billion different combinations!<br/>• Have the Stig test any car you customize on the official Top Gear Test track, then race to beat his time.<br/>• Challenge your friends directly to beat your stunt scores and race times with any car you create.<br/>• A wide variety of Game Center and OpenFeint achievements that reward experimentation and driving skill.<br/><br/>****************************<br/>Brand new content packs: 'Up, Up and Away' and 'Supercharged Powerrr' <br/><br/>Unlock 'Up, Up and Away' now - this pack includes three brilliant new challenges and the brand new Sports Coupe vehicle and Helicopter Blades attachment.<br/><br/>Unlock 'Supercharged Powerrr'. This monster power pack gives all your customiseable parts unlimited fuel. Enjoy! **Once purchased you can find the new part in your Engines menu**<br/>****************************<br/>Also available: 'Defying Gravity'<br/>This content pack includes 3 new challenges and a turbo-charged off-road vehicle: The Mud-Plugger.<br/><br/>Other Top Gear Apps include the Cool Wall app, the Who is the Stig app and Where’s Stig. We’ve also just launched the Cool Wall app for the iPad.<br/><br/>Stay up to date on Top Gear news:<br/><br/>Website: www.topgear.com<br/><br/>Like us: www.facebook.com/topgear<br/><br/>Follow us: www.twitter.com/BBC_TopGear<br/><br/>Sign up for the Top Gear newsletter:  http://on.fb.me/arpMAP<br/><br/>Technical Support: games.support@bbc.com", "metacritic": null, "released": "2010-12-21", "tba": false, "updated": "2019-10-22T14:22:01", "background_image": "https://media.rawg.io/media/screenshots/c0d/c0d3a82a2ce8fb464d4bf596b1e4e3d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BBC Worldwide"], "genres": ["Sports", "Racing"], "publishers": ["BBC Worldwide"], "esrb_rating": null}