{"id": 833476, "slug": "koa-the-forgotten-gods", "name": "Koa: The Forgotten Gods", "name_original": "Koa: The Forgotten Gods", "description": "<strong>Koa the Forgotten Gods is a 2022 graduation game developed by a team of 7 students from ISART Digital Montreal.</strong><br/><br/>The goal of the experience is to provide a feeling of overpower to the player through a combat system based on the flow of movement. With abilities granted by the gods emphasizing the fluidity of movement, we invite the player to explore the world and history of a rich culture.<br/><br/><strong>Narration</strong><br/>A story of passion inspired by the Hawaiian legend of Ohia Lehua. Play as Kalena, the cursed warrior, who lost her village and her lover to the explosive jealousy of Tūtū Pele, the forgotten goddess of volcanoes.<br/><br/><br/><strong>Combat</strong><br/>Possessed by the curse of Tutu Pele that Kalena manifests into wings, engage in fluid and fast-paced combat as you ravage the defenders of the Jungle.<br/>Prove yourself to the forgotten gods through their challenges and obtain their blessing to propel you forward with greater speed and power.<br/><br/><br/><strong>Environment</strong><br/>Explore the dense jungles, lush moutain peaks and rich caverns this Hawaiian tropical island has to offer with life and vibrant colors. Found on the island are multiple mythological areas describing the power of each gods you will encounter in a beautiful and serene display of divinity.<br/>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T04:53:02", "background_image": "https://media.rawg.io/media/screenshots/a25/a2591007dc2a6b1d95f0e5b843379a2b.jpg", "website": "https://isart-digital.itch.io/koa", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 504, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Omnia Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Omnia Games"], "esrb_rating": null}