{"id": 833491, "slug": "monkey-milk", "name": "Monkey Milk", "name_original": "Monkey Milk", "description": "Come to the Fields and learn how to be a coconut harvester! Starting from Coconut Grunt, collect tropical fruit to process into delicious beverages, while avoiding the not-so-friendly creatures that live alongside the lush groves of coconuts, bananas, and cacao. As you travel through all 12 fields, the tasks get harder, but your monkey has the chance to level-up and gain new inventory that will help conquer the crops. <br/><br/><br/>First, your Monkey must find fruit trees and shake them to drop their luscious fruit. A simple click adds them to your inventory. Look around for a sack to carry more fruit!  Once you have collected the fruit, make your way to the Hopper and dump the fruit in so it can process into cartons of coconut-milk based beverages!<br/><br/><br/>After completing a Field's harvest under the time allotted, you will unlock the next Field on the Field Trail.  Feel like you could have done better time-wise on any field? Just go back and replay the Field and earn a quicker time, or find the hidden Swag item you missed!<br/><br/><br/>Oh yes, I did say Swag item! Each field has a special piece of Swag your Monkey can collect and, in the \"Options\" menu, don on their furry little heads! Also, there are helpful power ups in each Field, as well as special inventory items you get from moving up in rank.<br/><br/><br/>One more thing, there are a few native creatures in the Fields .. and they are not all friendly! Best to avoid them, or you might find yourself stuck, bitten, or thrown when you least expect it!<br/><br/><br/><strong>So, ask yourself, are you monkey enough to take on the fields and become a Coconut King?</strong>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T05:09:33", "background_image": "https://media.rawg.io/media/screenshots/fbd/fbd104a5c20c17260ed61090742235ce.jpg", "website": "https://poalaproductions.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Poala Productions"], "genres": ["Casual", "Indie"], "publishers": ["Poala Productions"], "esrb_rating": null}