{"id": 833478, "slug": "alaris", "name": "Alaris", "name_original": "Alaris", "description": "\"Not all mysteries can be explained by the logic of man. Some mysteries, beyond man, have no logic, have no fate.<br/><br/>In the face of such, keep your wits close, but do not trust them. Trust not yourself, nor your senses. Your time, nor your wit.<br/><br/>For where time has stopped, but its flow has no end. For when passion calls, but hate runs deep.<br/><br/>Heed this warning, and do not wait. For laws of nature and laws of man. Have no logic, and have no weight.\"<br/><br/><br/><br/>In a game inspired by the lore of Dragon and Fae, Alaris is a fantasy-romance visual novel that lets you customize your character for a dynamic and immersive experience steeped in magic. With choices that can shape your story, relationships, and even personality, will you choose to be brave, kind, wise, or charismatic? Only you know the answer to your fate.<br/><br/>_______________________________________<h3>- Characters -</h3><br/><br/><br/>From Left to Right: Kuna'a, Fenir, Kayn, Druk, Etza, Aisa<h3>- Features -</h3><br/><ul><li>A Customizable Protagonist: Choose your name, pronouns, and personality<br/></li><li>Personality: Shape your personality with a combination of four traits: Bravery, Kindness, Wisdom, and Charisma. At times, you may make choices that shape your personality. You may also find yourself, or others, reacting according to your personality. Live your life multiple ways, and find out what happens.<br/></li><li>Free Time: 18 total Free Time dates. Choose from four locations and go on a date of your choosing with any of our love interests.<br/></li><li>Codex: Understand the world of Alaris more with a codex that updates as you learn more information.<br/></li><li>Dragon Energy Vision: Tap into one of the MC's special abilities to see the dragon energy auras of the cast.<br/></li><li>Character Profiles: Revisit dates that you've been on with any of our love interests. Hear a small sample of voiced lines from each of them. And rewatch CGs you've unlocked for them.</li></ul><br/>These are just a few of the features included in the current demo of Alaris. The game includes 60,000+ words of content, 150+ choices, 9 unlockable CGs, and 6 character \"endings.\"<br/><br/>_______________________________________<h3>- Story -</h3><br/>Enter a world of magic – of Fae and Dragon. Long ago, dragons sacrificed their kind to protect life on this planet. Thanks to their noble deed, life has continued in the world of Alaris. In fact, it has prospered. Humans, beings once unable to use magic, have now dethroned dragons as the strongest in the world. With dragon energy at their fingertips, humans live in a utopia ruled by peace. <br/><br/>However, not all is as it seems… What forces are lurking under the surface, threatening to expose truths that have been long forgotten and disrupt this utopia? <br/><br/>Play as a renowned healer, as you uncover the history that’s never been told but is ever important to the problems faced today. Explore a world that’s always existed, just on the outskirts of your awareness. Discover your true self and purpose, and see if there’s someone willing to accept and love you for whatever that may be.<br/><br/>_______________________________________<h3>- Team -</h3><ul><li>Crescence Studios: Producer/Director, Programmer, Writer, Artist<br/></li><li>Anita \"Elm\" Mensah: Writer/Editor<br/></li><li>Re.Alice: Game Logo<br/></li><li>oastlv: Key Visual Illustration<br/></li><li>Nimphradora: Personality Assets<br/></li><li>WOW Sound: BGM, SFX<br/></li><li>Sidearm Studios: SFX<br/></li><li>Scarlet Moon &amp; Peter Jones: Trailer Soundtrack</li></ul>_______________________________________<h3>- Voice Artists -</h3><ul><li>Ryan Hoyle: Kayn<br/></li><li>Ken Langner: Druk<br/></li><li>John Patneaude: Fenir<br/></li><li>Joy Ofodu: Etza<br/></li><li>Luca Xavier: Kuna'a<br/></li><li>Sarah Ruth Thomas: Aisa</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-12T04:55:13", "background_image": "https://media.rawg.io/media/screenshots/3bc/3bcdf1ad7693c8ae21d7631193b22497.jpg", "website": "https://crescencestudio.tumblr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 360, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Crescence Studio"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Crescence Studio"], "esrb_rating": null}