{"id": 833538, "slug": "ragdolls-playground-the-sandbox", "name": "Ragdolls Playground: The Sandbox", "name_original": "Ragdolls Playground: The Sandbox", "description": "Ragdolls Playground is a physics sandbox. There aren't any predefined aims or goals. We give you the ragdoll, tools, and leave you to play. This game is for people who enjoy Building, throwing around ragdolls but want it to be more detailed, satisfying, and feel more free while doing so.<br/><br/><h3>There's more than enough to play with.</h3><br/><br/>Every object has a set of properties that describe how it interacts with anything in the world and there are Hundreds of Inventory Items already and more new content is being added and optimizations being made regularly. Please watch the latest Ragdolls Playground trailers and Our Discord server to see the game’s latest state.<h3>There's more than enough to test with.</h3><h3>Some stuff is SHARP, Some stuff SHOOTS, Some stuff EXPLODES.</h3><br/><br/>The game contains a varied collection of projectile based weapons, Jump pads, and Obstacles for you to play with. There are different explosives that vary in destructive power as well as the manner in which they release their energy.<h3>There's more than enough Ragdolls to play with.</h3><br/><br/>There are more types of ragdolls and each ragdoll will have their own set of properties that describe how it interacts with anything in the world. You can make the Ragdoll Follow, Attack each other, simulate battles, or use them to test, usually on death machines that you crafted, to play around with.<br/><h3>FEATURES</h3><ul><li>Sandbox mode<br/></li><li>Simulation mode<br/></li><li>Build anything (Usually death machines)<br/></li><li>Massive playground<br/></li><li>Drivable Vehicles<br/></li><li>Destructible Items<br/></li><li>More inventory items<br/></li><li>More unique Ragdolls<br/></li><li>More Obstacles<br/></li><li>Level Creator<br/></li><li>Customization: Customize most of the object's Properties, Functions, colors and re-size them to fit your need.</li></ul>", "metacritic": null, "released": "2022-08-10", "tba": false, "updated": "2022-08-12T06:05:57", "background_image": "https://media.rawg.io/media/screenshots/7c6/7c67297e5cfae608ea4b312ac8188b17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Janner"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["JannerBros"], "esrb_rating": null}