{"id": 833634, "slug": "pong-kombat-sms-demake", "name": "Pong Kombat SMS Demake", "name_original": "Pong Kombat SMS Demake", "description": "<p>MS-DOS \"Pong Kombat\" demade for the Sega Master System.</p>\n<p><strong>This is a work-in-progress</strong></p>\r\nThe Story\r\n<p>Way way back in time, PONG was invented.  And it was Good(tm).  The only real player in the game, white paddle, enjoyed playing it, and played it well.\r\n </p>\n<p>Then, with the advent of color gaming systems, other paddles emerged.  White, being the pompous holier-than-thou jerk he is, got all uptight about this and left.\r\n </p>\n<p>He joined the Pong Lao cult, a group of paddle warriors which held bi-annual tournaments and swap meets.  He eventually toppled the Pong Lao leader, taking his throne (a mighty chair of porcelain).  With the aid of his new friend, buddy, and bodyguard Monolith, he rules over this years' tournament with an iron... umm... well, paddles lack appendages, so just an iron.\r\n </p>\n<p>However, with new rainbow-colored paddles from all walks of life and a few old rivals seeking some revenge entering the tournament, he may have his hands full.  Hopefully he can turn a few tricks and save his hide.  Odds are certainly in his favor, but the forces of Good(tm) have you now.\r\n </p>\n<p>So don't screw up.\r\n</p>\r\nInstructions\r\n<p>This game is made for the Sega Master System, so you will need an emulator to play the ROM; it can probably run on real hardware, too.<br/></p>", "metacritic": null, "released": "2022-08-11", "tba": false, "updated": "2022-08-12T07:12:46", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1d03ef3b5cabe9ad57892649c0cf126.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["haroldo-ok"], "genres": ["Action"], "publishers": [], "esrb_rating": null}