{"id": 833665, "slug": "underground-tomorrow", "name": "Underground Tomorrow", "name_original": "Underground Tomorrow", "description": "<p>It has been many decades since the world ended. Most survivors live underground in large self-sufficient bunkers built in secret in the 1970s. Your task, as administrator of one such bunker, is to ensure the continued survival of the inhabitants of your bunker by managing its day-to-day needs via your personal bunker administration terminal.</p>\n<p>Underground Tomorrow is a text-based persistent browser-based game made for PBBG Jam 2022.<br/></p>\n<p>Features:</p>\n<ul><li>Status<ul><li>Reactor – your bunker's power source. Must be refueled and maintained. When fuel is low, other systems are affected.</li><li>Water treatment – ensures the availability of clean water. Must be maintained to prevent inhabitants from getting sick.</li><li>Air recycling – clean air.</li><li>Horticulture – provides food for your bunker.</li><li>Infirmary – provides treatment for inhabitants that are sick or injured. Must be restocked with medicine to provide adequate treatment.</li><li>Workshop – crafting.</li><li>Cafeteria – cooks and serves food.</li></ul></li><li>People – list of all inhabitants in your bunker showing their current status or assignment. This is also where you can reassign inhabitants to different jobs or assign them to an away team for missions. Each inhabitant has his/her own set of skills that can be leveled.</li><li>Items – list of all items currently available in your bunker.</li><li>Map – a map of the world<ul><li>Missions – you can send one or more of your inhabitants on a mission to either explore a sector of the map to discover new locations or to search an already discovered location for useful items. Don't forget to equip your mission team with weapons, as the farther they travel, the more likely they are to run into marauders. Also be aware that the air on the surface is poisonous and increases the chance of becoming sick.</li></ul></li><li>Radio – instant communication with other bunkers.</li><li>Messages – important system notifications and mission reports.</li></ul>\n<p>Game modes:</p>\n<ul><li>Real time – an hour of in-game time equals an hour of real time.</li><li>Accelerated – the game runs at 60x normal speed, so an hour of in-game time equals a minute of real time.</li></ul>\n<p>Tips:</p>\n<ul><li>Reactor fuel – fuel rods can be found in nuclear power plants or abandoned bunkers. Alternatively, they can be crafted from nuclear material (found in hospitals) and depleted fuel rods.</li><li>Medicine – found in hospitals and pharmacies, but also houses and apartment buildings.</li><li>The UI also comes in green, try clicking the \"Mode\" button in the bottom right corner of the screen.</li></ul>\n<p><strong>N.B.</strong> The game is still very much a prototype and still needs a lot of work.<br/></p>", "metacritic": null, "released": "2022-08-11", "tba": false, "updated": "2022-08-12T07:24:21", "background_image": "https://media.rawg.io/media/screenshots/d98/d985ec0f77cd0b57939978701a6448ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["nielssp"], "genres": [], "publishers": [], "esrb_rating": null}