{"id": 833699, "slug": "mihaels-dinasty", "name": "Mihael's Dinasty", "name_original": "Mihael's Dinasty", "description": "Know your rivals like your keyboard!\r\n ¡Conoce a tus rivales como a tu teclado!\r\n\n\n\n<p> <strong>Mihael's dynasty is the last hope to win the Jousting tournament</strong>. For generations, they have battled and tried to win the tournament against tough opponents. <strong>Will the next son of the dynasty be able to achieve it?</strong><br/></p>\n<p>During the race towards the rival, <strong>you must put all your speed, concentration and precision</strong> so that, at the moment of impact, you have a greater chance of achieving victory.<br/></p>\n<p> <strong>La dinastía Mihael es la última esperanza para ganar el torneo de Justa</strong><strong>s</strong>. Durante generaciones, han combatido e intentado ganar el torneo contra duros rivales. <strong>¿Será capaz de conseguirlo el próximo hijo de la dinastía?</strong></p>\n<p>Durante la carrera hacia el rival, <strong>debes poner toda tu velocidad, concentración y precisión</strong> para que, en el momento del impacto, tengas mayor probabilidad de salir airoso y conseguir la victoria.</p>\n\n<p> At the main menu, press the space bar to start. <strong>During the race towards the rival, press the letters that appear.</strong> Be quick because you have a limited time to key down! <strong>The more letters you get right, the more chances you have</strong> to stay on your feet after the collision with the rival knight.</p>\n<p><strong>Don't worry if you are defeated, the next Mihael of the dynasty will take his place</strong>, stronger due to his predecessor's experience. Victory will be closer!</p>\n<p>Press ESC to restart the game.</p>\n<p> En el menú principal, pulsa la barra espaciadora para comenzar. <strong>Durante la carrera hacia el rival, pulsa las letras que vayan apareciendo</strong>. ¡Sé rápido porque tienes un tiempo limitado para pulsar! <strong>Cuantas más letras aciertes, más opciones tendrás</strong> de quedar en pie tras la colisión contra el jinete rival.</p>\n<p><strong>No te preocupes si caes derrotado, el próximo Mihael de la dinastía ocupará su lugar</strong>, más fuerte debido a la experiencia de su antecesor. ¡La victoria estará más cerca!<br/></p>\n<p>Siempre que quieras puedes pulsar la letra ESC para reiniciar el juego.</p>\n\n<p> <strong>Is this game hard for you?</strong> This game has an educational component and <strong>maybe you have to learn how to use the keyboard correctly, starting with the positioning of your hands.</strong> This link may help you to improve your typing speed and accuracy.<br/></p>\n<p> <strong>¿Te resulta muy difícil el juego?</strong> El juego tiene una componente educativa ya que, si te resulta muy difícil, <strong>quizás tengas que aprender a usar correctamente el teclado, empezando por el posicionamiento de manos.</strong> Este enlace puede servirte de ayuda y así mejorar tu velocidad y precisión de escritura.</p>\n\n<p> <strong>Special thanks to:</strong> Marpersar, Berni.</p>\r\n <strong>Agradecimientos a:</strong> Marpersar, Berni.<br/>\n\n<p><strong> ¡Share your highscore in the comments! </strong></p>\n<p><strong> ¡Comparte tu resultado en los comentarios! </strong><br/></p>", "metacritic": null, "released": "2022-08-11", "tba": false, "updated": "2022-08-12T07:37:30", "background_image": "https://media.rawg.io/media/screenshots/f29/f29ebbbec400eb51781f8d58d73c90c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kolvag"], "genres": [], "publishers": [], "esrb_rating": null}