{"id": 8338, "slug": "glass-tower-2-hd", "name": "Glass Tower 2 HD", "name_original": "Glass Tower 2 HD", "description": "Break the tower of glass!<br/>150 LEVELS + LEVEL EDITOR!<br/>No in-app purchases! All features are free.<br/><br/>Glass Tower 2 HD is a game with physical collisions and gravity simulation.<br/>Gameplay seems to be easy at first. <br/>The tower is constructed of blocks which are different in size, shape and color. <br/>Your aim is to break all blue blocks and to save as many red blocks as possible.<br/>Blue blocks add a score. Its amount depends on the size of the block. Red blocks subtract your score the same way.<br/>Also every broken red block subtract one \"life\". You have 20 lives at the beginning.<br/>Black blocks are indestructible and unmovable.<br/><br/>Due to physical-based engine every level may be passed in different ways. <br/><br/>Some blocks contain bonuses. When you break such block - the bonus takes off and rises on screen edge.<br/>You should have time to \"catch\" it, by taping on it by finger. Action of each bonus is explained during gameplay.<br/><br/>Your game progress is always saved, so you can continue playing last level you reached any time. There's also five save-slots available.<br/><br/>Game features highlights:<br/><br/>- 150 levels!<br/>- Level editor<br/>- real-like physical simulation<br/>- fast and powerful game engine with a lot of realtime visual effects<br/>- bright and clear graphics<br/>- very cool sounds of shattering glass<br/>- different backgrounds to choose<br/>- cool bonuses<br/>- Game Center", "metacritic": null, "released": "2012-05-04", "tba": false, "updated": "2019-10-22T14:29:48", "background_image": "https://media.rawg.io/media/screenshots/49d/49d016b44203fdd8ad31e26a3cce4c45.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gadgetcrafts"], "genres": ["Arcade", "Puzzle"], "publishers": ["Andrey Yakovlev"], "esrb_rating": null}