{"id": 834084, "slug": "wolf-in-sheeps-clothing-geos_games", "name": "Wolf In Sheep's Clothing (Geo's_Games)", "name_original": "Wolf In Sheep's Clothing (Geo's_Games)", "description": "<p>A 4 player pass-and-play game of social deduction inspired by One Night Ultimate Werewolf.</p>\n<p>The aim of the game is for all 3 sheep to get from the field on the left side of the board to the sheep pen on the right.  The wolf needs to stop them from getting there. You will need to work out who is on your team and trust that they will help you win. Gameplay will be controlled by using the mouse or pointing on a touch screen. </p>\n<p>At the beginning of the game each player will be secretly  told whether they are:</p>\n<p>1 of the 3 sheep     or the wolf  </p>\n\n<p>There will be 10 rounds, each round has 5 phases; some phases each player plays secretly before passing to the next player, </p>\n<p><strong>Phase 1)  Receive jobs - </strong>there are 4 jobs, which the game will randomly assign across the players. You will only know your own job ready for the Enactment phase.</p>\n<strong>Seer</strong> - can see the tiles available within their movement range, they will need to remember this for Movement phase so they can avoid hazards or aim for rewards.<strong>Troublemaker</strong> - this player can choose another player to swap places with.<strong>Picker</strong> - can choose any tile for the game to replace with a random tile.<strong>Blocker</strong> - places a wall on another player to block their passage.\r\n<p><strong>Phase 2) Roll the dice </strong>- the game will roll the dice for all players, this will appear by your player token and is visible to everyone. This is how far you'll be able to move in the Movement phase.</p>\n<p><strong>Phase 3) Enact Jobs </strong>- each player takes turns to use the ability their job gives them. This is where you can start  to help or hinder other players.</p>\n<p><strong>Phase 4) Movement- </strong> each player chooses a tile to move to using up to the number rolled on their dice. Movement doesn't have to be in a straight line, if you  have received a plus movement tile in the previous round it will automatically be added to your dice roll.<br/></p>\n<p><strong>Phase 5) Reveal and Resolve</strong> - the tiles under each player reveal themselves.</p>\n<strong>Plus 1 move </strong>- this adds 1 extra move in phase 4 on the next round.<strong>Plus 2 moves</strong> - this adds 2 extra moves in phase 4 on the next round.<strong>Bomb</strong> - returns the player back to the field.<strong>Wall</strong> - this blocks the player from moving in this direction.\r\n\r\n<p><strong>Winning the Game</strong><br/></p>\n<p>The sheep win when all three sheep are in the pen (you won't initially know who the other sheep are). </p>\n<p>The wolf wins if not all sheep are in the pen by the end of round 10.</p>", "metacritic": null, "released": "2022-08-06", "tba": false, "updated": "2022-08-12T10:18:20", "background_image": "https://media.rawg.io/media/screenshots/c41/c41bd68cd415e1c781d5fb498615992c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Geo's_Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}