{"id": 834074, "slug": "sixir", "name": "Sixir", "name_original": "Sixir", "description": "<p>Sixir is a maths game in a North-African setting, wherein the player uses the card game Turup to expand their skills to join the illustrious mage guild. </p>\r\nTurup mechanics\r\n<p>Turup is a Somali Card game where the aim is to have the most cards in their ‘bank’ as possible. At the start of the game each player receives four cards from the deck and four cards are placed on the table (known colloquially as ‘The Sea’), from there each player will take turns attempting to match one of their cards to a card on the table. This can be done directly, by having a card with the same numerical value as one on the table (for example a five with a five) and then both cards are added to the players ‘Bank’, or indirectly. </p>\n\n<p>To make an indirect match, the player must have the total value of all the cards collected. For example, if the player has a ten in their hand and there are a six and a four on the table, all three cards are added to the player's bank. There is no upper limit to how many cards can be in an indirect match so long as the total value of the cards from the table are equal to the card in the player’s hand.\r\n </p>\n<p>If no matches can be made, the player must sacrifice a card to The Sea and when all players run out of cards, another round begins, and each player receives four new cards.\r\n </p>\n<p>At the end of the game, all the cards in each player’s bank are totalled together and whoever has the most wins.</p>\r\nControls:\r\n<p>Movement: A/D keys | arrow keys</p>\n<p>Interact/Speak: Spacebar</p>\n<p>Pause: Esc | Select button</p>\n<p>Select answer/option: mouse</p>", "metacritic": null, "released": "2022-08-10", "tba": false, "updated": "2022-08-12T10:14:34", "background_image": "https://media.rawg.io/media/screenshots/793/793d34f635c0fdd6a26330f0f635669b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LaetusNoxx"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}