{"id": 834100, "slug": "kalyzmyr-itch-psychoseel", "name": "Kalyzmyr (itch) (PsychoSeel)", "name_original": "Kalyzmyr (itch) (PsychoSeel)", "description": "Buy On Steam\r\n<p> Kalyzmyr is a short game about a legendary warrior, Smyrna, escaping from a dungeon called Kalyzmyr, featuring beautiful hand drawn pixel art, it’s a side-scroller action game. A simplistic mix of popular gameplay elements like tower defense, dungeon crawler and hack’n slash with lots of button mashing and random generated interactions and loot.\r\n</p>\n<p><strong> Once the legendary warrior Smyrna, now long forgotten in the depths of Kalyzmyr. Break your chains and earn your freedom! Use your mighty axe and devastate your foes that keep you locked in Kalyzmyr!</strong>\n</p>\n<p><strong> </strong>Fight and defend through hordes of demons in this old-school fast-paced action game. \r\n</p>\n<p> Each floor starts with a defense phase where you defend yourself from hordes of creatures by buying and upgrading defensive equipment. Kill monsters to earn money. Loot chests to level up your equipment. \r\n</p>\n<p><strong> Anything Can Happen</strong>\n</p>\n<p><strong> Interactable objects are randomly generated, each can ease your burden or punish you. Pray for luck, you’ll need it.</strong>\n</p>\n<p>\n</p>\n<p><strong>Only Way Is Not Forward</strong>\n</p>\n<p> Feeling weak? Or did you get unlucky? Break the door to turn back to the previous floor anytime. Farm lower levels and be prepared to face stronger opponents.</p>\n\n<p><strong>14 Different Enemies And 3 Unique Bosses</strong>\n</p>\n<p> Each level features one unique boss and different creatures, as well as stronger item drops and new settings.\r\n</p>\n<p><strong>Unleash Your True Power</strong>\n</p>\n<p> Unleash Smyrna’s true potential by activating ‘Berserk’ mode which allows you to attack faster than anything.\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-08-10", "tba": false, "updated": "2022-08-12T10:25:31", "background_image": "https://media.rawg.io/media/screenshots/5f9/5f97a4a325f4a3d17472834adc5ef2e3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 299, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["PsychoSeel"], "genres": ["Action"], "publishers": [], "esrb_rating": null}