{"id": 83449, "slug": "stray-dog-simulator", "name": "Stray Dog Simulator", "name_original": "Stray Dog Simulator", "description": "Pick your favorite breed and live the life of a Stray Dog! Survive in a massive city filled with dangerous dogs and feisty cats! Build your dog pack, dig up buried bones, and battle for your life against German Shepherds, Huskies, and Labradors!<br/><br/>Download the Stray Dog Simulator today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy if you're going to survive the harsh life of a wild dog on the street!<br/><br/>EPIC BATTLES<br/>Use your powerful bite to defend your territory and fight your enemies! Cause too much trouble and the city will call the dog catcher to steal a dog from your pack!<br/><br/>BUILD YOUR PACK<br/>Dominate other dogs and recruit them to your pack! With up to 5 additional dogs, 9 breeds, and 3 alternate colors, every pack will be unique!<br/><br/>PLAY ANY BREED<br/>For the first time you can choose the breed of your starting dog. Even better you can switch and play as any dog in your pack and level them up individually!<br/><br/>LEVEL UP YOUR DOGS<br/>Gain experience by defeating dangerous enemies, eating food from the trash, and completing missions. Level up your dogs to increase their health and attack damage, and increase the size of your pack!<br/><br/>MISSIONS AND ACHIEVEMENTS<br/>Introducing two new mission types, \"Mark your Territory\" and \"Can You Dig It?”, to the unlimited missions and over two dozen achievements to give you a boost of experience! With the level cap increased to 200, you’ll need all the help you can get!<br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>Introducing a brand new procedural weather system with unique storms, clouds, and celestial movement. Realistic storms will bring a downpour of rain, flashes of lightning and booms of thunder!<br/><br/>HUGE 3D CITY ENVIRONMENT<br/>Your dog is free to roam a massive open-world environment that is more than triple the size of the previous simulators! Busy city streets, wide-open parks, white-fenced neighborhoods, and beachfront fairgrounds!<br/><br/>NEW TOUCH-BASED CONTROLS<br/>Brand new intuitive controls let you navigate your animal like never before! Pinch to zoom and play from your dog's perspective or get a bird's eye view of the action!<br/><br/>9 UNIQUE DOG BREEDS<br/>Pick your favorite breed! Customize your dog pack with any dogs you’d like from the vast selection: Bulldog, Dalmatian, Doberman, German Shepherd, Jack Russell Terrier, Labrador, Greyhound, Dachshund and Husky!<br/><br/>STRAY SURVIVAL GUIDE<br/>Look to your handy survival guide for information on breeds, a map of the world, achievement progress, and much more!<br/><br/>HD GRAPHICS<br/>Stunning High Definition graphics bring a bustling city to life! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Stray Dog Simulator to experience the exciting life of a stray dog surviving on the streets!<br/><br/>If you liked living as a Stray Dog then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies, check out the Snow Leopard Simulator and pounce on your prey from high mountaintops, or slither around a tropical rainforest with the Snake Simulator!<br/><br/>Follow us on Facebook for more awesome animal games and simulators!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2015-02-11", "tba": false, "updated": "2019-08-02T06:11:08", "background_image": "https://media.rawg.io/media/screenshots/aca/aca86dc60482af556d71dda4e3408079.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": null}