{"id": 834487, "slug": "bulanci-2", "name": "Bulanci", "name_original": "Bulanci", "description": "<p>Bulanci is an action multiplayer and easy-to-play party game where you take pillow fights with your frenemies to the next level. Make your sleepless nights memorable by being fluffy and deadly!</p>\n<p>Control the characters of fighting pillows called Bulanci. They are cute, chubby, seemingly clumsy things, but they behave and look like tough warriors, and when combined with weapons, they deliberately take the term &quot;pillow fight&quot; to a comical extreme.<br />\nPillow fights are in again</p>\n<p>Fight as individuals or in teams and try to collect as many points as possible for eliminating opponents<br />\nEach level offers different mechanics requiring you to adapt your combat tactics<br />\nWreak havoc upon the battlefield with seven deadly weapons in four different modes: Deathmatch, Conquest, Capture the Flag, and Campaign (coming with the full release)<br />\nHave a pillow talk with up to 8 players on a single device (up to 4 players on a single keyboard), with more players joining over the network or with computer-controlled opponents<br />\nCause severe concushion to other pillows in a special Battle Royale mode with up to 32 players<br />\nShoot other pillows under the cover of darkness, on a hot summer day or while your feathers are soaked in rain<br />\nBulanci are more than fea(the)rless shooting</p>\n<p>Customize your character – choose color, appearance, pattern, and small accessories such as helmet, sunglasses, or headphones<br />\nPlay soccer and other minigames during ceasefire<br />\nGet comfortable with a cup of your favorite drink and read pillow’s poetry<br />\nReveal more about the soft Bulanci nation in the history book<br />\nBased on the original game Bulánci (Combat Pillows), released in 2001, which has gained a strong community of players in some countries</p>\n<p>We will win, we’ll get the award,<br />\nLet’s have a drink, enjoy the ride.<br />\nPeacock feathers as a reward<br />\nIf you’re fighting on our side!<br />\nLock &amp; Loaded</p>\n<p>Deathmatch - players can either play on their own or split into two teams. The eliminated pillow soldier does not stop playing, the player who got hit simply respawns on the battlefield in a short while. The game can be limited by time or the number of lives each player has. At the end of the game, statistics are evaluated – who was the best in the fight, how many points each player scored and some exceptional moments of the fight are shown.</p>\n<p>Conquest - purely a team game mode. Teams of players try to eliminate their opponents from the game within a specified time. The eliminated pillow becomes a captive of the opposing team. Their teammates can free them during the game. The winning team is the one that captures all the opponents or enters the enemy base.</p>\n<p>Capture the Flag - players on both teams try to capture the opponent&#39;s flag and bring it back to their base. The first team to succeed wins.</p>\n<p>Campaign (not included in Early Access) - story mode will take players through some memorable moments of Bulanci’s history. Each mission has different specifics, different goals, and unique feeling, different from the classic gameplay.<br />\nAs soon as you close your eyes</p>\n<p>It&#39;s time to sleep when darkness falls,<br />\nEnjoy your dreams during the night.<br />\nYet you want more, the game still calls,<br />\nBut that is simply not right.</p>\n<p>Your bedroom drowns in complete silence,<br />\nThe calm being deceptively nice.<br />\nYou hear the screams, you feel the violence,<br />\nAs soon as you close your eyes.</p>\n<p>If you get up, there is no end,<br />\nno reward, either, no glory.<br />\nBetter stay off, don’t fight, my friend,<br />\nWait for another story.</p>\n<p>Life is not easy, life is no fun,<br />\nBulánci will tuck you in bed.<br />\nBut before that, they’ll grab a gun<br />\nAnd make sure that you&#39;re dead.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-07-27T07:31:47", "background_image": "https://media.rawg.io/media/screenshots/036/0362abbce04c5d635b03b21d35aaeb7a.jpg", "website": "https://www.bulancigame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 31}, "playtime": 0, "achievements_count": 98, "ratings_count": 1, "suggestions_count": 215, "game_series_count": 1, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["SleepTeam"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["SleepTeam"], "esrb_rating": null}