{"id": 834474, "slug": "runic-growth", "name": "Runic Growth", "name_original": "Runic Growth", "description": "<p>first build is <strong>Finally </strong>live! <br/></p>\n<p>To start I can't stress how much of an Alpha build this is as seen with a few known bugs.</p>\r\nKnown Errors/bugs\r\n<ol><li> there is an error with the player holding things floating out of their hand I don't know why this is happening but I feel when I work the models over this problem will go away. </li><li>Seeds &amp; watering can don't deplete there is a problem that came up with how the extra areas of effect on tools function and I have to fix that I'm planning to overhaul how the soil in this game works to not only help with speeding up the game but also better handling how tools work.</li><li>music isn't seamless until I develop my own music thats just going to be how it is sorry...</li><li>starting the game may result in it not responding. optimizing the game will be how to fix it but I don't want to keep dreading over this game not getting set up right.</li><li>tool animation doesn't work, the way the layering system in unity works goes against how I animated the character so it will have to be absent for the time being.</li><li>camera clipping is just going to have to be a thing I am planning to over haul how the camera works later sorry.</li><li>sprite doesn't change when character state changes. this is resolved when you talk to them without giving them stuff but for now again sorry.</li><li>when talking the game will tell you that space [-] or the south face button is to continue but thats false it's [x] or the  east face button. (this has been fixed)</li><li>Seasons don't cause environmental changes (I'm only human)</li></ol>\r\nFuture planed features\r\n<ol><li>character homes</li><li>more fleshed out schedules (I have to make a better schedule creation system that will allow me to have the NPC have more to do faster and easier.</li><li>weight base dialogue ( there is dialogue when they are full but I want to add more to that later on.</li><li>a real options menu with audio mixing.</li><li>more fully rendered weight stages for sprites and all of them having different emotions.</li><li>event cutscenes (this one is going to be a challenge for a while...</li><li>lighting and environments that fit the characters (this will either be next or <strong>Way </strong><strong>Later.</strong></li><li>Holidays and character birthdays</li><li>character customization, (name, birthdate, equipment visuals).</li><li>Recipes and crafting .  (I already made the function I just need to set up how to get recipes)</li><li>more character animation this will also be (<strong>Way Later</strong>).</li><li>Food Items giving buffs as well as adventure zones to go to. This will be both hard and easy to make.</li><li>Livestock (</li><li>Town building and (think animal crossing villagers moving in but you can evict them if you desire) </li><ol><li>That being said there will be set NPC's in the town but I will make it that you can choose where to put them.</li></ol><li>changing environment look.</li><li>Crop model Overhaul, for better optimization and general look of the game. </li></ol>\r\nCurrent build\r\n<p>as of right now there are 4 characters including the player character that you can watch grow. you can give them food as much as you want in this build no matter how full they get but this could be featured to change later.</p>\n<p>all crops are available to buy and grow. there is also the favorite foods to give to the characters available in the shop. To buy and feed.</p>\n<p>characters have changing dialogue for what state they are in, this dialogue is bound to change for when I have a better concept for how I want these characters to be.</p>\n<p>Saving is in but, let me know if it doesn't work I hear some functions get lost between downloads sometimes.</p>\n<p>Character sprites have 5 weight levels as well as a stuffed version (40 drawings in total) :^| </p>\n<p>Let me know if window size is too big I will change it later on. for monitors that cant handle 720P.<br/><br/></p>\r\nSupport\r\n<p>this game is a solo development, as of right now I managed to get a build done but soon I might have to shelf this as of right now my funding has dried up. <br/></p>\n<p>if you would like for me to continue steadily working on this game any support would be welcome either on my Patreon. </p>\n<p>You can commission me on my Kofi.</p>\n<p>If I can receive a steady Income of at most 1000 a month I can start doing this at full steam.</p>\n\n<p>With all that said I look forward to feed back both positive and negative to help me make a better game. hope you can find something to enjoy in this build and will ad more to it later on.<br/><br/></p>\n<p>-JM</p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T12:58:14", "background_image": "https://media.rawg.io/media/screenshots/3b0/3b09c00b538a93a840990d792b9c93ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["jerecomerash"], "genres": [], "publishers": [], "esrb_rating": null}