{"id": 834517, "slug": "wabi-sabi", "name": "Wabi-Sabi", "name_original": "Wabi-Sabi", "description": "<p>Wabi-Sabi is a VR Meditation game base around the Buddhist sand painting techniques. Wabi-Sabi was created with the intent by use for incarcerated youth.  The goal of the experience is to give users a calm and relaxing environment to escape the stressful world. <br/></p>\n<p><strong>How to play -</strong> In Wabi-Sabi you will be greeted with a sand mandala. Grab the funnels from the outer tables to select your desired color. Bring the funnel back to the table and use the scraper tool to release the sand. If you grab the bell on the back table it will clear your design and give you a new mandala. There are other activities to explore in Wabi-Sabi as well. Trying giving the Large bell (or <em>Bonshō<em>) </em></em>a ring. These is also a sand raking garden and rock stacking. Or if you don't feel like participating you can just enjoy the scenery.</p>\n\n\n<p><strong>Coming soon -</strong> Reward system including items that teach you about the Buddhist culture. </p>\n<p><em>Game is still in beta the full release will be 9/1/22 or earlier.</em></p>\n<p><strong>Current release platform -  PCVR (HTV Vive, Oculus rift, Quest 2 with link cable)</strong></p>\n<p><em>This game was made in partnership with my wife. If you are interested in checking out her work -</em> https://isabellanconnor.wixsite.com/my-site</p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T13:14:55", "background_image": "https://media.rawg.io/media/screenshots/c80/c800aa0e394977db611e50af91d683b6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mconnorconcepts"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}