{"id": 834574, "slug": "tanky-hollowzim", "name": "Tanky (Hollowzim)", "name_original": "Tanky (Hollowzim)", "description": "<p>ZQSD : Déplacements</p>\n<p>Clic droit : Tirer (Maintenir enfoncé pour tir chargé)<br/></p>\r\nArchitecture du projet :\r\n\n<p>Les scripts <strong>Tank </strong>et <strong>Turret </strong>sont tous les deux en '<strong>abstract</strong>' . <br/></p>\n<p>Les scripts <strong>PlayerTank </strong>ou <strong>EnemyTank </strong>vont gérer le déplacement du tank. Pour le joueur <strong>Z</strong> et <strong>S</strong> permettent d'avancer<strong> </strong>ou de reculer tandis que <strong>Q</strong> et <strong>D</strong> permettent d'effectuer une rotation du tank, le tank avancera toujours par rapport à son axe forward. Le tank ennemi à une <strong>IA basique</strong> qui va lui donner une <strong>position aléatoire</strong> à atteindre, le script prend bien évidemment en compte les obstacles et la taille du tank. Pour cela on utilise un <strong>raycast</strong> pour vérifier qu'aucun obstacle se trouve dans la direction de la position à atteindre puis également un <strong>Physics.OverlapSphere</strong> avec '1' de rayon pour vérifier qu'aucun mur ne se trouve trop proche de la cible.<br/></p>\n<p>Les scripts PlayerTurret ou EnemyTurret vont quant à eux gérer l'orientation de la tourelle et les tirs de celle-ci. EnemyTurret est également utilisable sur la tourelle fixe, les scripts de 'Tank' et 'Turret' sont tous indépendants. Les tourelles ennemies tireront <strong>seulement si le joueur est visible</strong>.<br/></p>\r\nGestion de la caméra : \r\n<p>Utilisation d'une virtual camera de <strong>Cinemachine</strong> avec son body en 'Framing transposer' . Ajout également d'un '<strong>Noise</strong>' avec le '6D Shake' en profil, cela permet à partir de la méthode <strong>ShakeCamera</strong><strong>() </strong>du script <strong>CameraShaker </strong>de modifier l'amplitude pour pouvoir <strong>appliquer un tremblement à la caméra</strong>.<br/></p>\r\nTir :\r\n<p>À partir du script PlayerTurret nous effectuons une rotation de la tourelle en direction de la position de la souris. D'un clic droit nous tirons par rapport au forward de la tourelle, il y à un délai d'une seconde entre chaque tir. Possibilité d'effectuer un tir chargé de 2sec en restant appuyé sur clic droit, avec un Mathf.Lerp j'ai interpolé la vitesse de base de la balle (20) et la vitesse max d'un tir chargé (40) en fonction du temps resté appuyer. Pendant le chargement du tir une flèche apparait et s'étire pendant tout le chargement. J'ai utilisé pour cela une animation de 2sec, je viens désactiver l'objet à chaque tir et le réactiver à chaque début de tir chargé ce qui vient relancer l'animation de 0.</p>\r\nPortes : \r\n<p>Une porte à trois points de vie, à chaque tir reçu la porte vient rapidement flasher en blanc. À sa destruction une explosion est jouée.</p>\r\nGestion de la vie :\r\n<p>Avec le script VehicleLifeManager nous gérons donc les points de vie des véhicules (Tank, tourelle) mais également leur affichage par UI. Les dommages sont affichés de manière différée en utilisant de nouveau un Mathf.Lerp pour interpoler le pourcentage de vie actuel affiché dans l'UI et le pourcentage de vie courant par rapport à un délai de 2sec mis en pourcentage.</p>\r\nFondu écran noir : \r\n<p>J'ai créé deux animations sur une image noire qui recouvre l'écran, ces deux animations sont lançables à partir de la classe <strong>GameManager </strong>avec les méthodes <strong>StartGame</strong>() et <strong>EndGame</strong>(). La classe <strong>GameManager </strong>est d'ailleurs un <strong>singleton</strong>.<br/></p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T13:38:41", "background_image": "https://media.rawg.io/media/screenshots/62d/62d39dc8bab2ba072ba5b0af90a3a16d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Hollowzim"], "genres": ["Action"], "publishers": [], "esrb_rating": null}