{"id": 834637, "slug": "wish-itch-nookon", "name": "WISH (itch) (NOOKON)", "name_original": "WISH (itch) (NOOKON)", "description": "<p><strong>Contributors</strong></p>\n<p>Zhao Weipeng (Screenwriter, background illustration, character illustration, photography, game production)</p>\n\n<p><strong>Roles</strong></p>\n<p>Player (Joined)</p>\n<p>Daruma (Joined)\"The God in charge of realizing wishes\"</p>\n<p>Number 6 (Joined)\"The former gods were assigned to the border world because he recorded wishes illegally\"</p>\n<p>Sho &amp; Shi (Joined)\"The monster in the shrine\"</p>\n<p>Fish (Only pictures)</p>\n<p>Unborn baby (Only pictures)</p>\n<p>Artificial intelligence Hokyo (Only pictures)</p>\n\n<p>link to game online</p>\n<p>https://play.unity.com/mg/other/wish-v1-0-2</p>\n<p>link to game video</p>\n\n\n<p><strong>Inspirations</strong></p>\n<p>My inspiration comes from a souvenir which I like very much, a Dharma tumbler. I got it from my teacher when I went to study in Japan last year. Dharma has the meaning of praying for the realization of wish. People will draw one eye for Dharma when making a wish and another eye after the wish is realized. The image of the tumbler also represents people's hope that everything will go well and everything will come true. I think this is a very interesting and unique theme. So I designed a game about desire.</p>\n\n<p><strong>Intent and goals in producing game</strong></p>\n<p>I designed a character named Daruma (Japanese name). His duty is to listen to people's wishes and decide whether they can be realized. As a new staff, player was assigned to work to collect wishes not send in the shrine, record them and report them to Daruma. This game is divided into five chapters: border world, abandoned shrine, sea, uterus and computer room. Players will meet many unexpected people, listen to their stories, record their wishes, and choose whether to record them or in what way to write. In the course of the game, players will learn the secrets about this work.</p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T14:03:54", "background_image": "https://media.rawg.io/media/screenshots/d8b/d8b2a74733325cff5a2c71d3591f5a06.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NOOKON"], "genres": [], "publishers": [], "esrb_rating": null}