{"id": 834707, "slug": "abyssal-fortress", "name": "Abyssal Fortress", "name_original": "Abyssal Fortress", "description": "<p>Abyssal Fortress: Escape from the Necromancer's Hold is a prototype of a game I designed for a university course. Other parts of the course involved designing a full game, and making a trailer for the prototype.</p>\n<p>In the game, you play as an archer, stationed in a fortress that was taken over by an evil necromancer. The fortress was uprooted and taken into an abyssal plane created by the necromancer, and the player character is the only inhabitant who did not get turned undead in the process. Your mission is to get through the skeletal hordes, and defeat the necromancer, to return to your home.</p>\n<p>The game should run well on even integrated graphics cards, but requires relatively new drivers, and may not run well on <em>very</em> old hardware. It uses the modern Vulkan 1.2 API for the graphics, but does not require much computing power, so low-end but relatively recent systems should work, but low-end and old systems may not. Try updating your drivers and operating system if you run into an error.<br/></p>\r\nNotes about the development\r\n<p>My main goal with this game was simply to make a 3D game with as many bells and whistles I could make within a month, given that I wrote the engine from scratch in Rust. I had written the renderer during the year before the course, but otherwise, all the code, maps, textures, models and animations were made during the course. I also fixed many bugs, improved compatibility, and added features to the renderer during the course, so it was a good way to dogfood it more than I had previously done.</p>\n<p>I used Trenchbroom as a level editor (it produces .map files, and making colliders and meshes out of them took a good chunk of development time), Blender for models, animations and UI layout, Bitwig Studio for cutting up sound effects, and Krita for the textures.<br/></p>\r\nControls\r\n<ul><li>WASD to move, hold Left Shift to run.</li><li>Space bar to jump.</li><li>Move the mouse to look around.</li><li>Hold left-click to draw the bow, release to let the arrow loose.</li><li>Number keys 1 and 2 to switch between the arrows (if you've found them in the game).</li><li>Escape to open the menu.</li><li>Left Alt to release the mouse from the window, click the window again to re-capture.</li></ul>\r\nSource\r\n<p>All the source code and assets for the game can be found in the game's Git repository.</p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T14:37:32", "background_image": "https://media.rawg.io/media/screenshots/d20/d20594309e14562779b3e40777227b8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Neon"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}