{"id": 834716, "slug": "chico-and-the-magic-orchards-itch", "name": "Chico and the Magic Orchards (itch)", "name_original": "Chico and the Magic Orchards (itch)", "description": "<p><strong>Chico’s Journey Home</strong></p>\n<p>When Chico the chipmunk stumbles into a portal in the forest, he’s transported to a magical world! Here he finds giant walnuts galore, but getting them home won’t be easy! Solve puzzles and challenges across a variety of unique levels, gather a horde of giant walnuts, and help Chico get back to his forest!</p>\n<p><strong>Use your nut!</strong><br/></p>\n<p>With unique dual-mode gameplay, you’ll have to really use your nut to crack these worlds. When Chico is alone he can jump over obstacles and push wall switches. If he has a walnut, he can roll it over spikes, bounce it off of walls and bumpers, and more. Find a way to get the walnut through to the end of the level with you! Each world introduces unique new mechanics that will test your brain and your skills.<br/></p>\n\n<p><strong>A Retro Romp</strong></p>\n<p>Chico and the Magic Orchards is designed like your favorite 8-bit handheld games. Catchy chiptune music, simple controls, and 4-color graphics evoke the feeling of playing a “lost classic”! Want to mix it up? The “Super Palette” graphics mode uses a special color palette for each area, giving them a unique feeling. Or find the hidden seeds in every stage, then visit the shop to spend them on new color palettes and cassette tapes to play in the sound-test room.</p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T14:41:39", "background_image": "https://media.rawg.io/media/screenshots/43d/43d75be6801aa24b687998185648605e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Nick Ver Voort"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}