{"id": 83494, "slug": "the-wheels-on-the-bus-sing-along-nursery-rhyme", "name": "The Wheels On The Bus - Sing Along Nursery Rhyme", "name_original": "The Wheels On The Bus - Sing Along Nursery Rhyme", "description": "**************FREE FOR LIMITED TIME ONLY*******************( REGULAR PRICE 2.99$)! <br/>**************FREE FOR LIMITED TIME ONLY******************* ( REGULAR PRICE 2.99$)! <br/>-&gt; 4 fabulous games including the full interactive sing along \"The wheels on the bus\" <br/>-&gt; Adorable HD graphics and sounds<br/>-&gt; Top selling education app worldwide<br/><br/>The perfect game for little kids that love to sing! Wheels on the bus is a beautiful and fun, sing along and interactive counting game bundle based on the popular rhyme we all know and love. <br/>Toddlers, preschool and kindergarten kids will love this app- All in one bundle fun for 2-6 year old kids. Come and enjoy the classic song with your little ones<br/>A highly engaging and beautiful graphic games pack that will keep your kids entertained for hours. It is the perfect game for little kids that love to sing!<br/>This so cute, HD graphics, activity center pack includes 4 different fun learning activities to play with:<br/><br/>** SING ALONG with wheels on the bus – The classic song comes alive with beautiful animation and funny interactions. Tap on different items and interact with the song <br/>** JOIN THE DOTS with wheels on the bus – Join dots, explore and learn to count with amazing illustrations to color later on  <br/>** JIGSAW PUZZLES with wheels on the bus - High quality, colorful and fabulous jigsaw puzzles to help practice fine motor skills and shape recognition. <br/>** MEMORY MATCHING GAME wheels on the bus -Match the pairs to improve visual memory. Complete all pairs to move to the next level.<br/><br/>Wheels on the bus activity bundle for toddlers, preschool and kindergarten kids is a colorful, fun educational experience. Easy for little fingers to play.  <br/><br/>**************************************** <br/><br/>Privacy disclosure: <br/><br/>• Does not collect or share any location and/or personal data <br/>• Does not contain any ads <br/>• Does not contain In-App Purchases <br/>• Does not contain Social Network Integration <br/>• Does not contain web browser links <br/>• The app contains “more apps” external links on a separate page accessible through a \"press and hold\" button. <br/><br/><br/>********** <br/>## Contact us! ## <br/><br/>NOTE: Please don't include bug reports in your app reviews. We can't respond to you directly, so it can be difficult for us to offer help or properly debug the situation. <br/>Have questions, suggestions, or concerns? Please email us at planetreefamily@gmail.com and we’ll be happy to help!", "metacritic": null, "released": "2015-08-08", "tba": false, "updated": "2019-10-22T14:22:03", "background_image": "https://media.rawg.io/media/screenshots/e7b/e7bb6f7e8a49fe0c07650af0adf768b4.jpg", "website": "https://www.smore.com/xxb6a", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PlaneTree Family Productions"], "genres": [], "publishers": ["Shoham Drori"], "esrb_rating": "Everyone 10+"}