{"id": 834930, "slug": "knight-time-deepocean-fumo-rob_64", "name": "Knight Time (DeepOcean, fumo, Rob_64)", "name_original": "Knight Time (DeepOcean, fumo, Rob_64)", "description": "<p><strong>Submitted for the Mini Jam 112: Chrono!<br/></strong></p>\n<p><strong>Controls:<br/></strong></p>\n<p>This game was designed for 3 inputs. Only 2 are working. Each of them have multiple mappings.</p>\n<p>Physical keys refer to key placement on a WASD layout. If you use a different layout, your key will be in the same physical position.<br/></p>\n<p>Next: Right arrow, down arrow, physical D, or physical S</p>\n<p>Select: Space or enter</p>\n<p>Back / Pause (not implemented): Q or Esc</p>\n\n<p><strong>How To Play<br/></strong></p>\n<p><em>Gotta go fast!<br/></em></p>\n<p>At the end of turn 10, the boss will deal 1000 damage, instantly killing you! You must defeat him before he reaches his final power. Every 2 turns, his damage increases by 2, so watch out!<br/></p>\n<p><em>Spells</em></p>\n<p>Your spells are your most special abilities! You must use them if you want to win.</p>\n<p>Rage: On the turn selected when casting, and for every turn after, you deal +1 damage. Can be played multiple times to stack with itself.</p>\n<p>Burst: On the turn selected when casting, your damage is multiplied by 1.5x.</p>\n<p>Sturdy: This spell sucks. It wasn't supposed to suck, but it does. Don't use it, defending is better. All it does is set damage done to you to 0 on one turn but defending is always better. Sorry.<br/></p>\n\n<p><strong>Our Thoughts:<br/></strong></p>\n<p>The Chrono theme is used in 2 mechanics. Firstly, you must kill the boss within 10 turns, acting as a time limit. Secondarily, and more interestingly, you are able to cast spells on yourself by traveling through time to help your past self!</p>\n<p>For the limitation, we decided to control our entire game via menus using the controls listed above. This lent itself well to the RPG combat style we implemented.</p>\n<p>This was a first jam for some of us and also the first time working in a team to this level of intensity and we had a blast! The game could use some polish in a lot of areas but overall I am very proud of the work my teammates did and I hope you will enjoy what we've created together.</p>\n\n<p><strong>Credits:<br/></strong></p>\n<p>Art &amp; Animation by ouriel</p>\n<p>Music &amp; SFX by Rob 64</p>\n<p>Code &amp; Design by Deep Ocean (that's me!)</p>\n<p><strong>How to Win (SPOILERS!):<br/></strong></p>\n<p>Yes, it is possible to win. You should try to figure out how for yourself! But, if you are stuck, it's not your fault. We could have balanced it better. One way to win is to use these turns in this sequence (strikethrough used to obscure from accidental glances) :</p>\n<p>Attack x2, Cast Rage on turn 1 (x2), Defend x2, Attack x3!<br/></p>", "metacritic": null, "released": "2022-08-08", "tba": false, "updated": "2022-08-12T16:17:51", "background_image": "https://media.rawg.io/media/screenshots/d62/d62fb2898ec693785da90849cf7b1fcb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["DeepOcean", "fumo", "Rob_64"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}