{"id": 83499, "slug": "minidrivers-the-game-of-mini-racing-cars", "name": "MiniDrivers - The game of mini racing cars", "name_original": "MiniDrivers - The game of mini racing cars", "description": "MiniDrivers is the craziest race to reach your hands! The animated series that has captivated millions of people around the world has a new star: You! Create your own stories or change the racing rules and become a World Champion.<br/><br/>IS TIME TO RACE!<br/>If anything characterizes MiniDrivers is their way to see the sport. Who said races are boring? it is the unique competition style. Who said races are boring? Surprises await you at every turn with power-ups based on the popular animated series. Freeze your rivals with the Freeze-o-Kimi, throw a boomerang as the Australian drivers or smash your rivals as the most “shocking” driver does in real life.<br/><br/>Enjoy three completely different game modes with Tournament Mode, in which the challenges make you prove yourself as a rider. The seasonal mode allows you to race the entire 2016 MiniDrivers World Championship and become the World Champion. The online tournament will let you prove you're the best driver of all in the weekly challenges against your friends around the world. In addition you can enjoy your favorite show and see all the chapters from the application itself.<br/><br/>A SEASON TO REMEMBER<br/>Race on the 35 most famous series tracks full of details and surprises that will leave you agape for the entire 2016 MiniDrivers season. Will you be able to beat Minicedes with your favorite driver? Now you can do it! Change the story, and most of all...change the rules!<br/><br/>MINIDRIVERS LIKE YOU’VE NEVER SEEN IT BEFORE <br/>Realistic graphics adapted to the retina display of your Mac's. Also you will be able to change the amount of detail. You will see everything!<br/><br/>BECOME AN ENGINEER <br/>Realistic physics for the most demanding drivers with arcade driving adapted for children. Everyone belongs in the MiniDrivers game! But don’t forget to improve your car if you want to stay on top and defeat your opponents.<br/><br/>COMPLETELY FREE<br/>To make the most of your game we are offering it completely free with fully optional inApp purchases. Put on your helmet and step on the gas because the championship is starting now!", "metacritic": null, "released": "2015-03-12", "tba": false, "updated": "2019-07-30T10:47:57", "background_image": "https://media.rawg.io/media/screenshots/ff7/ff724197f7dea1f6e19e7a39b6325b7c.jpg", "website": "http://www.ivanovichgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ivanovich Games"], "genres": ["Sports", "Racing"], "publishers": ["Ivanovich Games"], "esrb_rating": null}