{"id": 835088, "slug": "revenge-of-the-orcs-flag-of-conquest", "name": "Revenge of the Orcs: Flag of Conquest", "name_original": "Revenge of the Orcs: Flag of Conquest", "description": "A fantasy visual novel about the end of an era when humans and orcs are at war.<h3>FEATURES</h3><ul><li>5+ hours of gameplay<br/></li><li>Three endings<br/></li><li>Japanese voice acting</li></ul><h3>SUMMARY</h3>An orc returns to his village to find it on fire.<br/>A princess knight, an elf, a warrior... the humans tearing through his brethren strike terror into his green heart.<br/>When everything is reduced to ashes, only the orc remains, but a strange merchant addresses him...<br/><br/>\"Do you want revenge?\"<br/><br/>The orc accepts the insidious invitation.<br/><br/>\"I want to see them destroyed.\"<br/><br/>Even if it takes the help of one of the hated humans to do it.<br/><br/>Driven by a burning desire for revenge, the orc hoists a flag of rebellion. Soon, it will become a flag of conquest!<h3>CHARACTERS</h3><strong>Org the Orc</strong><br/>“I’m gonna get stronger!”<br/><br/>An orc bent on vengeance after his village is massacred by Lina and friends.<br/>As much as he blames humans for the tragedy, he remains powerless alone,<br/>and so strikes up a deal with a trader in exchange for sweet revenge.<br/>A bit of a coward, but has vowed to amass enough power to conquer all of babekind.<br/><br/><br/><strong>Princess Knight Lina</strong><br/>Voice: Rio Kisaka<br/>“I fight for the peace of my people!”<br/><br/>A princess knight hailing from the Kingdom of Estye.<br/>Traveling far and wide, she rids the realm of human-hating monsters.<br/>Feisty on the battlefield, she is in fact gentle-natured and despises conflict.<br/>Trusts friends and allies dearly as irreplaceable “sisters-in-arms.”<br/><br/><br/><strong>Priestess Artie</strong><br/>Voice: Yuri Ayase<br/>“No longer am I the grief-stricken young elfling I once was...”<br/><br/>A young elven priestess who fights using holy and healing magic.<br/>Held in noble regard even among elves, but can be overly idealistic at times.<br/>Haunted at being powerless to saved her village,<br/>she fights alongside Lina to vanquish their world of all monsters.<br/><br/><br/><strong>Half-Oni Warrioress Belka</strong><br/>Voice: Megumu Morino<br/>“Hmph... You’re not going anywhere near Lina.”<br/><br/>A tanned half-oni with an amazonian build and a single, large horn.<br/>Swings her great sword with ogrelike strength, toppling even larger monsters.<br/>Relied on as the group’s negotiator and a “man repellent” of sorts.<br/>Taciturn but caring, she often follows up on the more easily riled Lina.<br/>Humans treat oni as a race unto themselves as with dwarves and elves.", "metacritic": null, "released": "2022-08-11", "tba": false, "updated": "2022-08-15T04:20:44", "background_image": "https://media.rawg.io/media/screenshots/5a6/5a66bfe5082397f2dfa19aee0d09ea0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 219, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dieselmine"], "genres": ["Adventure", "Strategy"], "publishers": ["Shiravune"], "esrb_rating": null}