{"id": 835057, "slug": "saila-venture-through-the-clouds", "name": "Saila - Venture Through The Clouds", "name_original": "Saila - Venture Through The Clouds", "description": "<p>A une époque où les dieux marchaient parmi les Hommes, un cataclysme recouvrit la Terre d'une épaisse couche de nuages toxiques forçant l'humanité à fuir vers les hauteurs. La tribu des Hodeiak fut l'une des rares à avoir survécu et prospérée grâce aux techniques de navigation sur la mer des nuages que les Protecteurs ont hérité des Dieux. Les Hodeiak se sont rapidement développés mais les ressources limitées de leur île entrainèrent une famine terrible qui plongea la tribu dans la tourmente. Saila, initiée parmi les Protecteurs, décide de s'aventurer au cœur du domaine interdit des Dieux pour pouvoir sauver son clan de la faim.<br/></p>\n<p>Lors de son périple sur cette île mystérieuse, Saila devra explorer et percer les secrets de celle-ci. Le jeu se déroule dans une structure ancienne réduite à l'état de ruines par le passage du temps. Saila pourra utiliser ses pouvoirs de déplacements aériens pour franchir de nombreux obstacles, pouvoirs qui se renforceront à chaque étape de son voyage, lui permettant d'aller toujours plus loin et mettant en lumière des informations inattendues révélant l'histoire des lieux.<br/><br/>L'œuvre s'inscrit dans un contexte d'aventure postapocalyptique fantaisiste en piochant dans de nombreuses inspirations. Tout d'abord et sans surprise, l’incontestable \"Zelda : Breath of the Wild\", ou encore \"Kena : Bridge of Spirits\", mais aussi dans des œuvres cinématographiques comme le \"Château dans le ciel\" ou \"Les Enfants de la Baleine\". Ces œuvres ont pour dénominateur commun d'intégrer les personnages dans des décors gigantesques, des forêts luxuriantes et de les impliquer dans la découverte de lieux anciens et mystérieux.<br/></p>\n<p>En effet, c'est le sentiment principal que l'équipe essaye de transmettre aux joueurs : le gigantisme et la découverte constante de lieux remplis d'histoire.</p>", "metacritic": null, "released": "2022-07-25", "tba": false, "updated": "2022-08-12T17:11:21", "background_image": "https://media.rawg.io/media/screenshots/962/96276a23f3ac367ebd018a779ff7d2a8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 338, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HealingStorm", "Martin Andries", "Bodinio", "Tristan Labourse", "NathanTandille", "Baptiste V", "Dinolapin"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}