{"id": 83501, "slug": "cupcakes-holiday-edition", "name": "Cupcakes! Holiday Edition", "name_original": "Cupcakes! Holiday Edition", "description": "No matter what holiday you are celebrating, from Mother's/Father's Day to Christmas or Halloween, or even birthdays &amp; baby showers, this special holiday edition of the mega-hit Cupcakes! app has you covered.  Special themed frostings, cupcake liners, candy, and decorations are here to let you bake, decorate, share, and eat cupcakes on your iPod Touch or iPhone.<br/><br/>Holidays include: Earth Day, Mother's Day, Father's Day, Easter, St. Patrick's Day, Baby Showers, Valentines Day, Birthdays, Christmas, New Year's, Hanukkah, Thanksgiving, and Halloween. <br/><br/>How does it work? Cupcakes! Holiday Edition makes it easy to bake a batch of the perfect cupcakes for the season.  Pick your cupcake liners, fill the pan with cake batter, pop it in the oven, and before you know it your cupcakes will come out piping hot.  Shake your phone to get the cupcakes out of the pan and then choose from all kinds of specially designed frostings &amp; toppings.<br/><br/>Once you've baked &amp; decorated your cupcakes, you can email them to your friends or post them to Facebook.<br/><br/>And of course you can eat them!  Peel off the wrapper and touch to take bites of your cupcake.  Or even lick the frosting off the top!<br/><br/>Cupcakes! Holiday Edition includes:<br/>- 109 different holiday cupcake liners<br/>- 15 different cake batters, with seasonal favorites like pumpkin, apple spice, fruitcake, cranberry, Christmas pudding, and birthday cake<br/>- The ability to set your baking time, from lightly baked to crispy burnt cupcakes<br/>- 71 types of frosting, both decorative (like jack-o-lanterns, Christmas bells, chocolate santas) and holiday tastes (peppermint, pumpkin pie, orange, cranberry)<br/>- 123 toppings, from candy Easter Eggs &amp; chocolate bunnies to candy ghosts &amp; gummy spiders, seasonally colored sprinkles, and candy favorites<br/>- 25 flavors of official Jelly Belly gourmet jelly beans to add as toppings<br/>- 38 kinds of plates and 39 tablecloths, with fun seasonal themes<br/>- 7 fillings (pumpkin, peppermint, orange, and more) to add to your cupcakes<br/>- Holiday candles you blow out by blowing on your phone! (shake your iPod for older iPods)<br/>- Ability to submit your cupcake to the \"Cupcake of the Week\" and Hall of Fame contests.", "metacritic": null, "released": "2010-10-08", "tba": false, "updated": "2019-10-22T14:22:03", "background_image": "https://media.rawg.io/media/screenshots/4c3/4c3177ab12fa4f4367ee039369f386b2.jpg", "website": "http://www.mavericksw.com/Cupcakes%21Holiday.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Maverick Software"], "genres": ["Family"], "publishers": ["Maverick Software"], "esrb_rating": "Everyone 10+"}