{"id": 835105, "slug": "moondrop-2", "name": "Moondrop", "name_original": "Moondrop", "description": "It's tough farming on an ever-changing mountain - when the mists roll in, everything disappears! Still, the mountainside has good soil and its twisty trails hold treasure and secrets. Use your skill at farming, crafting, and alchemy to hold back the vanishing mists. When they inevitably arrive, return to the abandoned village of Oncewas with your goods. As you rebuild it, the returning villagers will unlock new upgrades and powers for future farms.<h3>Skill-based Farming</h3><br/>The peculiar crops that grow on Moondrop are particular plants. They must be matched up with their neighbors in order to flower and flourish. Exotic plants will warp across the farm, clone themselves, or eat neighboring crops. A farmer who can wrangle these weird and wily crops will make a substantial profit. The famously finicky mistberry is difficult to grow, but it will hold off the vanishing mists and keep the farm in place for a few more days.<h3>Explore a Shifting Landscape.</h3><br/>Every hike up the misty mountain offers a new trail to explore. Discover new seeds, perks, and blueprints hidden away along the procedurally-generated trails. Each discovery will unlock new possibilities on the next farm. Solve puzzles to learn the secrets of the mountain, or just spend the day fishing.<h3>Rebuild the Village of Oncewas</h3><br/>Like the ocean tides, the vanishing mists cannot be held at bay forever. When they arrive, return to the ruins of a once-thriving village. Use the resources you've collected to rebuild the town from the ground up. The people who move back in, be they blacksmith or fortune teller, will help you on your next farm. Restore Oncewas to its former glory and unlock upgrades.<h3>Return to the mountain smarter, faster, stronger </h3>Like the winter frost, the vanishing mists eventually recede. Return to the mountainside and begin anew. Use the knowledge you've learned and the seeds that you've earned to build a better farm. With persistence and the support of the villagers of Oncewas, you will one day reach the top of the mountain.", "metacritic": null, "released": "2022-08-12", "tba": false, "updated": "2022-08-15T04:42:34", "background_image": "https://media.rawg.io/media/screenshots/5ae/5ae2e54d1eb088d16558bc669589495a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Moonroof Studios"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["Moonroof Studios"], "esrb_rating": null}