{"id": 835144, "slug": "flowers-bundle", "name": "Flowers Bundle", "name_original": "Flowers Bundle", "description": "A collection of four Flowersgames in one package.<br/>\n<br/>\nFlowers: Le Volume sur Printemps<br/>\n<br/>\nSuou: “Is it wrong if I fall in love with a girl?”<br/>\n<br/>\nSurrounded by immense walls in the middle of a forest, lies the prestigious all-girls school, Saint Angraecum Academy. It’s a school that prides itself on growing bright and cultured young women.<br/>\n<br/>\nThe school’s Amitié program is designed to help foster new friendships that will last a lifetime. This is why Suoh Shirahane, a painfully shy girl with a mysterious past, has enrolled. As her first year of high school begins, she is filled with hopes of a new life.<br/>\n<br/>\nFollow her as she navigates her new friendships and attempts to unravel the many mysteries at the academy, including occult rituals and the mysterious disappearance of fellow students, all while trying to pass her classes.<br/>\n<br/>\nAs spring warms into summer, so does Suoh’s friendships until they too blossom into a love that is something more. More importantly, who will she choose?<br/>\n<br/>\nFlowers: Le Volume sur Ete<br/>\n<br/>\nErika/Chidori: “Have you ever thought of wanting to do something for the one you love?”<br/>\n<br/>\nThis is the all-age sequel to FLOWERS -Le volume sur printemps-. In the season of first meetings, a girl with a wounded heart, Suou, found a friend and lover who would accept her. However, this friend and lover left the school without telling her the reason at the end of spring. Suou was in denial about her loss, and fellow bookworm Erika was gravely worried and looked for a way to heal Suou’s, broken heart.<br/>\n<br/>\nWith the early arrival of summer, a girl named Chidori transferred into the school. She met Erika by accident when Erika was coming back to the dorm and told Erika that she was a coward for stalking her. It was the worst first meeting for the two who would end up becoming each other’s “Amitié.”<br/>\n<br/>\nFlowers: Le Volume sur Automne<br/>\n<br/>\nYuzuriha/Nerine: “Can you live with unrequited love?”<br/>\n<br/>\nShirahane Suou, resolved in her search for Mayuri — who went missing in spring — has gotten much closer to solving the mystery of her disappearance.<br/>\n<br/>\n“I shall give you the key you seek, should you choose to succeed me as the president of the Council of Nicaea,”<br/>\n<br/>\nDeclared Yatsushiro Yuzuriha to her junior pursuing the shadow of her lost lover. Yuzuriha, knowing the mysteries of the academy, tried to thrust a burdensome demand to make her give up on that idea, despite knowing her true intentions; however, Yatsushiro Yuzuriha, gazing at her junior who seeks the truth, has also been holding on to a secret that should never see the light of day…<br/>\n<br/>\nSeveral bizarre events arise in Saint Angraecum Academy during autumn.<br/>\n<br/>\nUnreciprocated feelings of childhood friends, awakenings of affections, and many threads of emotions are interwoven together.<br/>\n<br/>\nA tale of love and truth entangled in complexity begins to unfold…<br/>\n<br/>\nFlowers: Le Volume sur Hiver<br/>\n<br/>\nSuou/Mayuri: “Is there someone in your life whom you want to be with, forevermore?”<br/>\n<br/>\n“Tell me the key necessary to arrive at the Goddess of Truth,”<br/>\n<br/>\nchallenged Suou after becoming the president of Council of Nicaea and overcoming the trials from Yatsushiro Yuzuriha. As promised, the name given was “The Seven Wonders of the Beginning of the End,” directly linking Kousaka Mayuri, her amity who disappeared in Spring.<br/>\n<br/>\nSeveral even more bizarre events arise in Saint Angraecum Academy during Winter.<br/>\n<br/>\nWith the help of her friends, Shirahane Suou will stand up against many obstacles, but… the words she prayed to God, “Please forget about me,” still overwhelms her.<br/>\n<br/>\nThe reemergence of her Stepmom’s shadow, passing thoughts, unexpected continuations… Just what will it all bring about to Suou?<br/>\n<br/>\nThe final wintry season will melt everything away…", "metacritic": null, "released": "2022-08-11", "tba": false, "updated": "2022-08-15T05:39:42", "background_image": "https://media.rawg.io/media/screenshots/695/695a2e230073b24997276e21b5efb27a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 385, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Innocent Grey"], "genres": [], "publishers": ["JAST USA"], "esrb_rating": null}