{"id": 835125, "slug": "what-if-george-washington-was-a-girl", "name": "What if George Washington was a Girl?", "name_original": "What if George Washington was a Girl?", "description": "A historical visual novel about history's greatest heroes and villains and their trials and tribulations.<br/><br/>It is important to note that a lot of time and research was put into the writing of this game's story and themes, all historical people and events were heavily studied to make sure everything is accurate. This was taken <strong>extremely</strong> seriously and any naysay will not be tolerated.<br/><br/>So anyways, the story starts with the Dark Musician (Mozart) plotting to destroy Antarctica. Georgia Washington (George Washington) and Teddy Rosebelt (Theodore Roosevelt), knights of the United Nations were sent to stop the mad musical genius before the icy continent is lost forever.<br/><br/>BUT THEN, more stuff happens and there's intrigue and suspense and penguins? Find out more and meet other historical figures in this first chapter of an exciting new saga, Alter Historia.<br/><br/>Yeah that's right it's only the first chapter, hopefully this doesn't get popular because there will be more if it does.<h3>Game Features</h3><ul><li>Meet several historic figures like Georgia Washington, Bonny (Napoleon Bonaparte), The Night Gale (Florence Nightingale) and more.<br/></li><li>Has an in-game wiki that unlocks exciting info about the actual historic figures as you progress through the game.<br/></li><li>Features a custom made visual novel engine. It currently has camera effects, map scenes, particle effects and more, with lots of other features being planned.<br/></li><li>Has an actual plotline. (It's sort of similar to Shonen stuff like One Piece.)<br/></li><li>Bonny is the best character.</li></ul><br/>Parental Guidance Suggested, this uses some brief strong language like \"Heck\".", "metacritic": null, "released": "2022-08-12", "tba": false, "updated": "2022-08-15T05:12:21", "background_image": "https://media.rawg.io/media/screenshots/bb5/bb59c4961a256e3a28921c571d471a65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Echomune"], "genres": ["Casual", "Indie"], "publishers": ["echomune"], "esrb_rating": null}