{"id": 835127, "slug": "yandere-goddess-a-snatch-made-in-heaven", "name": "Yandere Goddess: A Snatch Made in Heaven", "name_original": "Yandere Goddess: A Snatch Made in Heaven", "description": "<p>Desperate to lose his virginity, Shinya resorts to the occult to summon a demon, a succubus …anything with a pussy to finally pop his cherry! The results were unexpected because the ritual he looked up online actually worked and not only did he summon Alsiel, a high-ranking demon, but Neito, the Goddess of Love, popped out right behind her!<br />\nThis is destiny at work, right? Shinya and Neito are reunited and they&#39;ll be so madly in love, have babies, get married, AND NO OTHER WOMAN WILL EVER TOUCH HIM WITH THEIR FILTHY HANDS AGAIN!!!<br />\nForget about a demon&#39;s promise when you have a devoted goddess straight out of hentai heaven! Honestly, why settle for anything less than a “Snatch made in Heaven!”<br />\n-Translated version of the original Japanese Visual Novel<br />\n-Neito and Alsiel are fully voiced with original Japanese dialogue<br />\n-Original artwork HD upscaled with 16:9 and 4:3 variants<br />\n-Hours of story content<br />\n-Audio including music and special effects<br />\n-Enhanced with character sprite animations<br />\n-Gallery and Scene selections<br />\n-Scene Studio with a customizable prompt to create a custom scene with in-game assets<br />\n-14 scenes utterly devoting yourself to a beautiful goddess!<br />\nYandere Goddess: A Snatch Made in Heaven Is the English localization of a Visual Novel originally created by prolific Japanese developer Norn. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong> PLEASE NOTE </strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2022-08-12", "tba": false, "updated": "2022-08-15T10:58:49", "background_image": "https://media.rawg.io/media/games/21c/21ca384aaf4d7d07e718f64020f9e763.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 499, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Norn"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}