{"id": 83526, "slug": "polar-bear-simulator", "name": "Polar Bear Simulator", "name_original": "Polar Bear Simulator", "description": "Brave the arctic wilderness and live the life of a Polar Bear! Survive in a frigid environment filled with dangerous carnivores and tasty critters! Raise your family, pounce on prey, and battle for your life against predators like foxes, wolves, and killer whales!<br/><br/>Download the Polar Bear Simulator today while it's 50% OFF for a very limited time!<br/><br/>Game Features<br/>REALISTIC SIMULATOR<br/>You'll need to maintain your health, hunger, thirst, and energy if you're going to survive in the harsh wilderness of the frozen arctic!<br/><br/>EPIC BATTLES<br/>Use your powerful claws and jaws to hunt down and fight your prey! Deliver the killing blow by leaping through the air and pouncing on your enemy!<br/><br/>START YOUR FAMILY<br/>Find another polar bear to bond with and raise your very own family! Breed up to four polar bear cubs and watch them grow in size and strength while they help you survive in the wilderness!<br/><br/>LEVEL UP YOUR BEARS<br/>Gain experience by defeating dangerous predators, eating small animals, and completing missions. Level up your bears to increase their health and attack damage, unlock new fur colors, and gain new powers like Stealth Mode!<br/><br/>MISSIONS AND ACHIEVEMENTS<br/>Introducing unlimited missions and over two dozen achievements to give you a boost of experience! With the level cap increased to 200, you’ll need all the help you can get!<br/><br/>DYNAMIC WEATHER AND DAY/NIGHT CYCLE<br/>Introducing a brand new procedural weather system with unique storms, clouds, and celestial movement. Realistic storms will bring a downpour of rain, flashes of lightning, booms of thunder, blankets of snow and more!<br/><br/>HUGE 3D ENVIRONMENT<br/>Your polar bear is free to roam a massive open-world environment that is more than triple the size of the previous simulators! Discover snow covered mountaintops, frozen lakes, and massive ice caves! Dive underwater and explore the world from below with ocean predators and tasty fish!<br/><br/>NEW TOUCH-BASED CONTROLS<br/>Brand new intuitive controls let you navigate your animal like never before! Pinch to zoom and play from your polar bear's perspective or get a bird's eye view of the action!<br/><br/>25 UNIQUE ARCTIC SPECIES<br/>Discover a massive all-new collection of arctic animals! Hunt down penguins, leopard seals, moose, arctic hare, falcons, wolves, foxes, lemmings, orca, dolphins, sharks, squids, fish, sea turtles and many more!<br/><br/>ARCTIC SURVIVAL GUIDE<br/>Look to your handy survival guide for information on local wildlife, a map of the world, bear customizations, achievement progress, and much more!<br/><br/>HD GRAPHICS<br/>Stunning High Definition graphics will transport you to the remote wilderness of the Arctic Circle! New Graphics Quality options allow you to customize the game to look amazing and perform great on any device!<br/><br/>OPTIONAL BLOOD EFFECTS<br/>Looking for more realistic action? If you are of age or have your parents permission, turn on the blood effects for some added combat ferocity!<br/><br/>GLUTEN-FREE PROMISE<br/>With all of our games you will always get the full game with no ads or additional purchases!<br/><br/>Download the Polar Bear Simulator to experience the exciting life of one the most intelligent and powerful predators planet on Earth, the Polar Bear!<br/><br/>If you liked living as a Polar Bear then you'll love our other animal simulators! Download our Eagle Simulator and soar through the skies, check out the Snow Leopard Simulator and pounce on your prey from high mountaintops, or slither around a tropical rainforest with the Snake Simulator!<br/><br/>Follow us on Facebook for more awesome animal games and simulators!<br/>facebook.com/glutenfreegames<br/>twitter.com/glutenfreegames", "metacritic": null, "released": "2015-01-16", "tba": false, "updated": "2019-07-30T01:55:54", "background_image": "https://media.rawg.io/media/screenshots/bda/bdad209440ec14fbd54a9eae085c5664.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Gluten Free Games"], "genres": ["RPG", "Simulation"], "publishers": ["Gluten Free Games"], "esrb_rating": "Everyone 10+"}