{"id": 83527, "slug": "fix-my-bike-3d-mechanic-lite", "name": "Fix My Bike: 3D Mechanic LITE", "name_original": "Fix My Bike: 3D Mechanic LITE", "description": "Extreme motorcycle mechanic WANTED! Dare to dream it all in a race to build, repair, detail, customize, and mod a furious and awesome sport bike. This 3D mechanic simulator has all the custom mods, fast parts and best tools you could ever need!<br/><br/>In the trendiest racing hangout in the city, a trashed and dirty motorbike awaits aftermarket parts and upgrades... all this for the biggest race of your life. But don't worry, you're a world-class mechanic and your friend will help you start fixing, repairing, detailing and upgrading your bike better than it ever was before! Work together in this top HD moto simulation game of 2015, you'll find adventure, hidden objects (HOG), the highest quality tweaks and parts like no other motorcycle game out there! You'll be building it with style for optimized performance.<br/><br/>Fun and free, we've taken the time to drive beyond a typical mobile mechanic simulator to offer you a custom story, detailed sportbike mods and something NEW (not a car or truck) where FireRabbit takes you out of the garage and the mechanic shop, straight into the streets and alleyways of a cool city environments! Pimp, upgrade, and fix your moto x sportsbike engine.<br/><br/>Despite your bike being destroyed, your incredible mechanic skills will have to transform this bike covered in dirt into a rocket with a slick paint job and custom mods! Be the champion! <br/><br/>FEATURES:<br/><br/>+ 90+ objectives and upgrades to do (FULL version only)!<br/>+ Dozens of tools and cool after-market parts to find and install! <br/>+ Perform dozens of jobs ranging from basic routine maintenance to outrageous performance mods! <br/>+ Explore cool environments like your own private bar, urban alleyway, exclusive rooftop, and more! <br/>+ Built-in hint system so you never get stuck (FULL version only)! <br/>+ No in-app purchases - you get everything upfront!<br/><br/>SAMPLE OBJECTIVES:<br/><br/>+ Upgrade engine.<br/>+ Grind down the excess metal from exhaust pipe.<br/>+ Sand exterior fairing parts.<br/>+ Add brake lever &amp; clutch lever.<br/>+ Mount old exhaust pipe.<br/>+ Apply paint and decals.<br/><br/>DETAILS:<br/><br/>See this game and more at: http://firerabbit.com/<br/><br/>Come talk with us on our page at: https://www.facebook.com/firerabbit.canada<br/><br/>Hit us up on Twitter at: https://twitter.com/firerabbit_inc", "metacritic": null, "released": "2015-09-20", "tba": false, "updated": "2019-07-08T02:40:34", "background_image": "https://media.rawg.io/media/screenshots/611/6119c8a37bee23885c61fb6aaf6e7f3a.jpg", "website": "http://www.firerabbit.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FireRabbit"], "genres": ["Adventure", "Racing"], "publishers": ["FireRabbit", "alex gosselin"], "esrb_rating": null}