{"id": 835412, "slug": "fire-brine", "name": "Fire & Brine", "name_original": "Fire & Brine", "description": "Setting the Scene\r\n<p>The Atlantic: cold, storm-wracked, unforgiving, where men and metal alike die screaming in fire and brine. The Nazis have enjoyed massive success today; your convoy has already encountered multiple U-boat wolfpacks on your crossing back to Britain. All the other escorts have been sunk by German torpedoes; only your battered and lonely corvette remains to give the unarmed merchant ships hope of returning home safely. Now another wolfpack circles around the edges of the convoy, waiting for night to fall...</p>\r\nThe Situation\r\n<p>Intel report is that tonight's wolfpack only has three u-boats, but they will likely come from wildly different directions - meaning you will be very busy tracking and sinking them, Lieutenant. With the Nazis now aware of our RADAR advantage, their u-boats are no longer using surface tactics, so you're going to be relying on your ASDIC and depth charges to get the job done. Fortunately, this is expected to be the last wolfpack your convoy encounters before reaching port, so get rid of these three without losing all your merchant ships and we'll consider that a job well done. Oh, and keep yourself alive, too. No heroics this time around; you can't protect the convoy if you've been sunk by a Nazi torpedo. </p>\n<p>A few reminders about your ship and the information at your disposal:</p>\n<ul><li>You're equipped with both <strong>ASDIC </strong>(active sonar) and <strong>hydrophones </strong>(passive).</li><li>You may manually <strong>engage the ASDIC</strong> so you can decide for yourself how long to  wait between pings. The longer you wait before your next ping, the farther away you'll be able to hear your targets.</li><li>U-boats in silent running mode are so quiet that you'll never hear them on the  hydrophones at long range and you probably won't hear them at short range,  either, unless they try to run to escape your depth charges.</li><li>Going slowly <strong>improves </strong>the performance of your ASDIC and hydrophones, going  fast <strong>degrades </strong>it. This is especially true of the hydrophones.</li><li>Your <strong>throttle setting</strong> is shown in the bottom left of your tactical plotter.</li><li><strong>Three(3) depth charges</strong> may be loaded at once and once expended, your crew will  reload the launchers<strong>; the number loaded is shown at the bottom right of your</strong><strong>  tactical plotter.</strong></li><li>A depth charge takes several seconds to fall to its detonation depth and  explode; <strong>you will need to time your drops to land on the enemy u-boats!</strong></li><li>Depth charges do more damage to submarines than to surface ships, but they  can still hit you; <strong>don't be caught in the blast zone or you may sink yourself!</strong></li><li><strong>Depth charges also degrade ASDIC performance,</strong> so don't expect much of the  device if you use it immediately after your charges go off.</li><li>Be careful when you're in the vicinity of a u-boat. They'll try to sneak away  from you and if they manage it, <strong>they might just send a torpedo at you!</strong></li><li>A vessel that has taken enough damage will lose maneuverability and may not be  able to use its engines at all!</li><li>Your depth charge crews will not reload as effectively if your ship is damaged - an indicator will appear on your tactical plotter if so.</li></ul>\r\nKeyboard controls\r\n<ul><li>Left/right arrows: steer left or right 45 degrees</li><li>Up/down arrows: increase/decrease throttle</li><li>S: sends out one ASDIC/SONAR pulse</li><li>D: drops one depth charge</li><li>P: pauses the gameplay</li><li>ESC: skips cinematics</li><li>ENTER: toggles fullscreen</li></ul>\r\nCredits\r\n<p>Programming, pixel art, sound effects by Ryan Alban. Special thanks to Myles Wirth for editing and Michael Medley, Angel Tsang, and Alex de Bruyn who listened to my rambling design ideas and made suggestions of their own. </p>", "metacritic": null, "released": "2022-08-14", "tba": false, "updated": "2022-08-15T07:37:27", "background_image": "https://media.rawg.io/media/screenshots/c69/c69a433229c702220b8085bb3be16f5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dreamofpsy"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}