{"id": 835413, "slug": "wrestlebashfest", "name": "WrestleBashFest", "name_original": "WrestleBashFest", "description": "<p>Professional wrestlers: heroic and villainous, noble and devious. Some fight for glory, prestige and championships, and some are in it for the thrill of putting their opponent down on the canvas for the three count. Either way, they are here to put in one heck of a show in WrestleBashFest! Pick your sports entertainer, beat another guy, that's the gist. Use the mixture of various techniques: brutal strikes, vicious grapples, careful pokes, defensive maneuvers and taunts to get your opponent to zero health and win the match! Mind your stamina, and don't forget your unique moves!\r\n</p>\n<p>The game is my first larger-scale one, made in Phaser - a very underappreciated engine in my book. Refer to in-game tutorial for a tutorial on how to play the game. Priorities will mostly be put into bug-fixing and rebalancing, as well as making more visual adjustments to shoddy art (special indicators for every character are also planned), mostly cut due to time constraints, bugs and general laziness. At least two more characters are planned for the final release if there'll be enough interest for that kind of stuff.\r\n</p>\n<p><strong>Features:</strong>\n</p>\n<ul><li>Knock your opponents out in the simultaneous turn-based fighting extravaganza;\r\n</li><li>11 distinct characters, inspired by professional wrestling and its fandom, each with their own special abilities and gimmicks;\r\n</li><li>(Newgrounds version only) Lobby and Room Multiplayer modes, as well as an offline mode with different character logic and 7 difficulties, ranging from rubberbanding, to a cheating one, all the way down to omnipresence;\r\n</li><li>Challenges: unlock 'em all!\r\n</li></ul>\n<p><strong>Known issues:</strong>\n</p>\n<ul><li>Music doesn't loop correctly. In general, It's kinda hard to do in a satisfactory manner. This will hopefully be fixed in later releases;\r\n</li><li>Seldomly, character select screens (especially during online play) may bug out. I'm yet to reproduce the bug in a consistent manner. Restart the game if it happens;\r\n</li><li>There are some small animation errors here and there that are somewhat tiresome to fix. They will hopefully be patched out in later releases;\r\n</li><li>Saves are currently tied to your local storage, not your medals. Sorry! This will be fixed in later releases.\r\n</li><li>There might be bugs associated with incorrect handling of specials moves, please report them!\r\n</li><li><strong>Please visit the Newgrounds version of the project for online mode! </strong></li></ul>\n<p><strong>Version history:</strong>\n</p>\n<ul><li>0.88 - fixed performance issues. (Hopefully) Fixed the bug associated with character select screens bugging out.\r\n</li><li>0.85 - initial release.\r\n</li></ul>", "metacritic": null, "released": "2022-08-14", "tba": false, "updated": "2022-08-15T07:37:47", "background_image": "https://media.rawg.io/media/screenshots/ee9/ee923117aa4517bbe8fc1fa9599ca9d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MattBWasTaken"], "genres": ["Sports", "Fighting"], "publishers": [], "esrb_rating": null}