{"id": 83569, "slug": "wordly", "name": "Wordly!", "name_original": "Wordly!", "description": "Wordly brings the classic word scramble game to iPhone. It is a simple, fun and addictive puzzle game, in which the objective is to find and trace as many words as possible on a randomly generated board before the clock runs out. <br/><br/>Form valid words by tracing letters on the board with your finger. Words can only be formed by connecting neighbouring letters, and the minimum word length is 3 letters. When you think you have found a word, release your finger from the board, and if valid, you score a point in the game.<br/><br/>Features:<br/><br/>- All possible words shown at the end of a game<br/>- Board quality checker, to ensure there’s plenty of words to find<br/>- Features an untimed mode<br/>- Choose your own game time limit<br/>- Intuitive user interface<br/><br/><br/>28/06/2010: Wordly has been reviewed by WMExperts!<br/>“This is a highly addictive, enjoyable and often humbling game. I didn’t experience any bugs, hang-ups or problems running Wordly. <br/><br/>——————————————————————————————————–<br/><br/>Reviews:<br/>\"Wordly is great. Once you get used to the idea that there are dozens of obscure words you’ve never heard of, this game is just great. My kids play it, my wife plays it – it is so addictive. The best £1.19 I ever spent on anything!!\"<br/>Mark | 18/04/2010 05:48<br/><br/>\"simple but addictive. this game is gonna get me sacked! fully addicted…\"<br/>Anonymous | 25/02/2010 22:58<br/><br/><br/>\"really amazing app I find it HIGHLY ADDICTIVE and have recommended it to many family &amp; friends. Find words you never knew existed!\"<br/>Ryan | 20/04/2010 23:18", "metacritic": null, "released": "2011-12-10", "tba": false, "updated": "2019-07-19T03:14:57", "background_image": "https://media.rawg.io/media/screenshots/0b3/0b3c2689e41ae887ea19b3b01cfde4bb.jpg", "website": "http://www.bluebear.ie", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bluebear Technologies"], "genres": ["Puzzle"], "publishers": ["Bluebear Technologies"], "esrb_rating": "Everyone 10+"}