{"id": 835682, "slug": "grimside", "name": "GRIMSIDE", "name_original": "GRIMSIDE", "description": "<p>The game \"GRIMSIDE\" - Open World, Story driven psychological horror from the Third Person Perspective. The soundtrack immerses you in the madness that the main character could experience<br/></p>\n<p><strong><em>WARNING: </em></strong>Epileptic seizures associated with increased sensitivity to light are Possible. Some people may experience seizures when exposed to flashes of light and flashing images that appear in a video game. People who have not previously experienced such attacks may not be aware of their illness. A reasonable restriction of the game audience is recommended.\r\n</p>\n<em>Environment.</em>\n<p>The main character suffers from post-traumatic stress disorder caused Because of the Death of her Mum and Dad Who Died in a car Accident Days Before the events of the game.  As a child, due to the abuse of her mother, the main character developed some phobias, which she learned to cope with. But a combination of circumstances forces the character into a spiral of murder and revenge on those who dared cross her\r\n</p>\n<em>What awaits you:</em>\n<p>- Genre: Open world - Immerse yourself in the the world sights and sound of GRIMSIDE - Explore the island and take revenge on those who killed your home town - Memories of his childhood are narrated by a change of location; - Explore locations and find hidden secrets\r\n</p>\n<p>GRIMSIDE is a third Person Action Adventure game as well as a psychological horror game. You have a skillset that consists of flying, shooting 3 types of elements consisting of Fire, ice and lightning; you also have the power to teleport. The Game has a 8-9 hour long campaign as well as a free roam mode In the campaign you play as sky who has just lost her mother in this campaign the the military finds out that people with superhuman powers exist. and goes to masacre and kills a lot of people including the main character sky, but sky is rebirthed into a alternate reality where everything seems normal and where she believes she is still alive she get transported between this world and a much darker world both telling their own story but this world slowly falls apart as you progress through the campaign because the two worlds will start to combine and become one. And the story's start to get blurry with a super climactic ending. This game depends mostly on in-depth development of realistic characters dealing with emotional themes. Dramatic themes such as alcoholism, drug addiction, moral dilemmas, sexuality, poverty, class divisions, and putting the characters in conflict with themselves and others and society. This usually appeals to both the young mature and older audience, of both genders, but this is intended for people over 15.\r\n</p>\n<p>\n</p>\r\nCONTROLS \r\n<strong>[</strong>WASD]Walk<strong>[Shift]</strong>\n<strong>Sprint</strong>\n<strong>[Esc]</strong>\n<strong>Pause</strong>\n<strong>[Space]</strong>\n<strong>Jump</strong>\n<strong>[TAB] </strong>\n<strong>Check Controls</strong>\n<strong> [F] </strong>\n<strong>Fly</strong>\n<strong>[Q</strong>]Magic Activate<strong>[T]</strong>\n<strong>Teleport</strong>\n<strong>3</strong>\n<strong>Long Jump</strong>\n<strong>G</strong>\n<strong>Lock-on</strong>\n<strong>[scroll]</strong>\n<strong>Change power</strong>\n<strong>[mouse button]</strong>\r\nShoot\r\n\r\nFeatures\r\n<p>The key features in terms of design when it comes to GRIMSIDE is the smooth movement, making traversing the map fun and enjoyable. Along with the gloomy aesthetic. The mechanics of GRIMSIDE are the movements including flying, running, jumping and teleporting. These mechanics make the game enjoyable to move around in the map. Along with the combat this combat consists of up-close attacks such as kicks, along with long range attacks such as shooting fire ice or lighting all of them having different effects on the enemies\r\n</p>\r\nTheme\r\n<p>The look and feel of GRIMSIDE is a realistic game but has a gloomy aesthetic but the world is seen as foggy and a little empty creating a feel of artificial loneliness where there are few people to interact with although not completely empty. GRIMSIDE</p>", "metacritic": null, "released": "2022-08-14", "tba": false, "updated": "2022-08-15T09:28:57", "background_image": "https://media.rawg.io/media/screenshots/be7/be705250f6caa0b7f088240b29b17523.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 317, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MoonlightDevelopment"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}