{"id": 8357, "slug": "zombie-anarchy-survival-strategy-game", "name": "Zombie Anarchy: Survival Strategy Game", "name_original": "Zombie Anarchy: Survival Strategy Game", "description": "Do you have what it takes to survive hell on Earth?<br/><br/>Begin a desperate struggle to survive an apocalyptic world full of danger and opportunity. Gather skilled survivors to your side and unite against relentless attackers – both living and dead. Scavenge in the city, wage war on infected zombie camps and take what you can from other survivors. When humanity falls and the dead rise, you must do whatever it takes to survive in this apocalyptic combat-strategy game.<br/><br/>Features in ZOMBIE ANARCHY™:<br/><br/>COLLECT SURVIVORS<br/>Each survivor has a unique ability and backstory to discover. From the enigmatic Kane to the bow-wielding Rosie, not everyone is what they seem.<br/><br/>DEFEND THE CAMP<br/>Resources are hard to come by in the apocalypse. Keep your food and gas safe with Watchtowers, Flamethrowers, Tesla towers and more!<br/><br/>DEFEAT ENEMY PLAYERS<br/>Form devastating scavenging teams and raid rival players from around the world to steal their precious materials, amass victories and climb your way up the leaderboard.<br/><br/>WIPE OUT THE DEAD<br/>Exterminate zombie-infested camps in tactical missions and shoot the dead in the Zombie Hunt mini-game to unlock rare items and special weapons.<br/><br/>UNLEASH YOUR WEAPONS<br/>Launch Devices from your Van to anywhere on the battlefield. Revive fallen Survivors, summon B-strain Zombies to fight for you, or just plain blow stuff up!<br/><br/>OVERCOME THE APOCALYPSE<br/>Master a new layer of strategy as you control your survivors’ moves during raids and make tactical use of their abilities to keep them alive.<br/><br/>LIVE IN-GAME EVENTS<br/>Play the daily bounty quests to obtain valuable resources. You can also win BIG by completing the weekly Infestation Seasons and other unique limited-time seasonal events.<br/><br/>BECOME A LEGEND<br/>Scavenge resources and rare items to upgrade your buildings and survivors. Create the ultimate camp and become the envy of the waste!<br/><br/>ZOMBIE ANARCHY™ is free to download and play. However, some game items can also be purchased for real money. If you don't want to use this feature, please disable in-app purchases in your device's settings.<br/><br/>IMPORTANT NOTES:<br/>-  This app requires an iPad 2 (or newer), iPhone 4s (or newer), or iPod touch (5th Generation).<br/>-  A network connection is required to play.<br/><br/>_____________________________________________<br/><br/>Visit our official site at http://www.gameloft.com<br/>Follow us on Twitter at http://glft.co/GameloftonTwitter or like us on Facebook at http://facebook.com/Gameloft to get more info about all our upcoming titles.<br/>Check out our videos and game trailers on http://www.youtube.com/Gameloft<br/>Discover our blog at http://glft.co/Gameloft_Official_Blog for the inside scoop on everything Gameloft.<br/><br/>Privacy Policy: http://www.gameloft.co.uk/privacy-notice/<br/>Terms of Use: http://www.gameloft.co.uk/conditions/<br/>End-User License Agreement: http://www.gameloft.com/eula/?lang=en", "metacritic": null, "released": "2016-10-26", "tba": false, "updated": "2019-10-22T14:19:23", "background_image": "https://media.rawg.io/media/screenshots/7b0/7b0feda9a9d257a112c8c9d343a88e9a.jpg", "website": "http://www.gameloft.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Gameloft"], "genres": ["Action", "Strategy"], "publishers": ["Gameloft"], "esrb_rating": null}