{"id": 835904, "slug": "dont-get-caught-demo", "name": "Don't Get Caught Demo", "name_original": "Don't Get Caught Demo", "description": "Version 0.6, what's new?\r\n<p>-New way to defend yourself from the owner<br/>-Bug fixes<br/>-New difficulty<br/>-New preset</p>\r\nPlot\r\n<p>You're an infamous thief who gas to get out of town, and for that reason, you decided to steal money from this rich old man. That won't be easy, however, you have 7 days to get to his safe and run away with the money, never to be seen again. Be careful not to be noticed, the more noise you make the more aware the man will become of your presence. You can leave the house if you believe he's suspecting too much of you, however you must get the money before the deadline.</p>\r\nControls\r\n<p>WASD - Move<br/>Q - Open doors/unlock<br/>Left Click - Pick up items/use an item<br/>C - Crouch<br/>E - Hide<br/>Space - Drop item<br/></p>\r\nInstructions\r\nRemove every lock or barricade in the safe room door and run away with the money, <strong>all you need is in the house</strong>. Whenever you drop an item, the owner will hear and come check it out, increasing his <strong>awareness</strong> - dropping items on carpets doesn't make noise. He'll start roaming close to areas you make a lot of noise in when his awareness is high. You can leave the house without the money if you believe his awareness is too high, it's also the only way to get it down when he's at max awareness. When he's sure of your presence, he will call the police - if that happens then you have to <strong>leave the house before they arrive</strong>. Watch out for <strong>creaking floors</strong>, you can avoid those by crouching. You can interact with items by clicking on them, however, they have to be within your reach - <strong>crouching increases your reach</strong>. You can open doors, safes, boards, drawers and unlock objects by pressing Q. Once you open the safe and get the money, <strong>run away from the house as fast as you can</strong>.\r\n<br/>\r\nThanks for playing Don't Get Caught\r\n<p>The game is currently a demo, it'll be getting updates frequently, though. You can support the game by sharing it!</p>", "metacritic": null, "released": "2022-08-13", "tba": false, "updated": "2022-08-15T10:56:06", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d16dfb99de8ba387c118abc99843b83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lifetime Disaster"], "genres": ["Action"], "publishers": [], "esrb_rating": null}