{"id": 836218, "slug": "summer-the-game", "name": "Summer: THE GAME", "name_original": "Summer: THE GAME", "description": "SUMMER:<br/>THE GAME\r\nSuper Cool Downloaded Version\r\n\n\n<p>A game about enjoying some summer activities. Why don't you have fun with our collection of normal summer activities, such as smore roasting, swimming,  or stacking ice cream (yes that's all I had time to make sorry). Have fun, relax, and gain tokens to redeem for decorations, achievements, and bragging rights. </p>\n\r\nHow Do I Play?\r\n<p>Download by scrolling down. I guess. No web version..</p>\n\r\nWhere Content?\r\n<p>Content? Oh yeah there is content in the SUPER COOL DOWNLOADED VERSION but you know I'm not advertising it. In the SUPER COOL DOWNLOADED VERSION you can get cool secrets like a challenge thing and other stuff. This game will get you 30 minutes (most likely) to 3 hours of fun times. This game was made using my own sweat and tears. Also, I decided to not make a WEB version because I'm running out of sanity.</p>\n\n<p>Game made in about a bit shy of 35 hours considering vacations, family stuff, and classes.  Worked one hour a day (on days i could work on it). So, uh, yeah. See ya.</p>\r\nCREDITS\r\nMusic\r\n<li>\n<p>Menu: </p>\r\nCurious Critters\r\n\r\n\r\n<p>Minigames: </p>\r\nVIP Treatment Day 9\r\n</li>\r\nArt\r\n<li>\n<p>Human Character: </p>\r\nModular Characters\r\n\r\n</li>\r\nAssets\r\n<p>Tell me if any don't meet requirements</p>\n<li>\n<p>Achievement System: </p>\r\nAchievement System\r\n\r\n\r\n<p>Font: </p>\r\n'Fatality' FPS Gaming Font\r\n\r\n\r\n<p>Bitstrap: </p>\r\nBitstrap\r\n\r\n<p> (NOTE: NOT PRESENT IN GAME, USED TO HELP MAKE UNITY EDITOR EASIER TO USE. PLEASE CHECK IT OUT.) </p>\n</li>\n<p> If you like this game, you can rate it 5 stars (or 4 idk). If you dislike it, rate it 1 star. Seeya later. Oh, and if you feel like it, you can just leave.</p><p>\n</p><p>FUN FACT:</p>\n<p>I had to republish this game because I published the wrong build</p>", "metacritic": null, "released": "2022-08-12", "tba": false, "updated": "2022-08-15T13:08:37", "background_image": "https://media.rawg.io/media/screenshots/b7d/b7dd44068c15d0ac6519dbd56bbc709d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["CaptainRad!"], "genres": [], "publishers": [], "esrb_rating": null}