{"id": 836219, "slug": "a-memorable-odyssey", "name": "A Memorable Odyssey", "name_original": "A Memorable Odyssey", "description": "- About - \r\n<p>After taking psilocybin magic mushrooms, David challenges himself to engage with past memories in hopes of regaining a more positive outlook on life. However, David begins to realise that objects around his house can trigger both positive and negative memories, influencing the trips visuals and strength. David intends to end the trip on a positive note, though he realises that negative memories can also effect the trips ending. </p>\r\n- Controls -\r\n<p>WASD - Movement</p>\n<p>Mouse1 - Interact</p>\n<p>F - Focus</p>\r\n- Warning - \r\n<p>This game revolves around drugs and drug use. The game portrays a replicated simulation of psilocybin magic mushrooms. Taking illicit substances isn't encouraged nor intended to be encouraged by the game. Please DO NOT play this game if drug use affects you. The game discusses topics on death, mental health and drug use which some may find confronting or upsetting. Please do not play this game if psychedelic drugs, mental health or death affect you. This game also features hallucination effects, bright lights and colours which may effect some individuals. This game features coarse language and adult themes that may not be appropriate for some ages. </p>\r\n- Credits -\r\n<p>Leo Laughlin - Level Sequences, Level Design, Narrative, Audio</p>\n<p>Lachlan Phillips - Level Design, UI, QA</p>\n<p>Devan Laczko-Twomey - Lead Programmer, Audio</p>\n<p>Ghina Andriana - 3D Models (tofuprisoner@gmail.com)</p>\n<p>Jordan Spencer - 3D Models, Animation</p>\n\r\nPlay the first test build now!\r\nFeedback Form: https://forms.gle/FLeeZxNhq4wWtzQH6\r\n- BETA Notice -\r\n<p>This current build of the game is a BETA and is subject to change. Certain animations, audio assets, level dressing models, VFX,  and endings are not complete. These will be released in the final build after this playtest.</p>\n<p>Currently, if you reach either level 5 trip state for positive or negative OR interact with all 10 memories, the game will either prompt you to return to main menu or allow you to continue exploring the level. This will be fixed in an update. </p>", "metacritic": null, "released": "2022-08-12", "tba": false, "updated": "2022-08-15T13:09:24", "background_image": "https://media.rawg.io/media/screenshots/c8f/c8f3c5cbcb1c7d91d3c80e5baf811638.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DevN Games", "TheF1ip", "raidrDevs"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}