{"id": 836476, "slug": "caerulean-beneath-and-beyond", "name": "Caerulean: Beneath and Beyond", "name_original": "Caerulean: Beneath and Beyond", "description": "As a low ranked officer of the Maritime Protection Initiative (M.P.A.), Laura Deckard is assigned to the GAIA oceanic station, established at 150 m (600 feet) underwater, which serves as a long-term research outpost since 2035. Follow her journey of exploration and preservation of the marine ecosystems, in a world constantly affected by the consequences of climate change. <br/><br/><br/><br/>This game is essentially a passion project, worked on by a single developer for the moment, where the aim is to allow the players to explore and help protect underwater ecosystems and their wildlife, all the while interacting with a possible future segment of mankind. <br/><br/>The game design and story draws inspiration from movies (ex: The Big Blue, The Life Aquatic with Steve Zissou, The Abyss, Underwater, The Cave), books and graphic novels (ex: 20 000 Leagues under the Sea, The World Is Blue: How Our Fate and the Ocean's Are One, The Underwater Welder, Dept. H) and documentaries (ex: Revolution, Sharkwater, The Cove, Blackfish). <br/><br/><br/><br/>The game intends to be somewhat futuristic while still tackling present issues which all global beings have to deal with.<h3>Features being worked on:</h3><ul><li> Help clean the oceans, conserve and protect ecosystems and their species. <br/></li><li> Explore the GAIA station and its underwater surroundings such as cave systems and derelict buildings. <br/></li><li> Interact through dialogue with diverse crew members of GAIA and learn about them. <br/></li><li> Complete objectives (missions) for the GAIA crew and other higher-ups of the MPI organization.<br/></li><li> Vehicles/transport systems for the player to use in order to explore the underwater environments and areas. <br/></li><li> Light RPG elements.<br/>- inventory management      <br/>- Unlock higher ranks in the MPI with more responsibilities and higher pay<br/></li><li> More features will be added</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-19T04:33:50", "background_image": "https://media.rawg.io/media/screenshots/e34/e344a2e8e305c3b3c606ef0aea8ab63b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spotless Mind Studios"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Spotless Mind Studios"], "esrb_rating": null}