{"id": 836410, "slug": "shadowstalker", "name": "ShadowStalker", "name_original": "ShadowStalker", "description": "Story\r\n<p>Most of the world is faded into darkness long years ago when an unkown cataclysm corrupted most of the Earth, leaving only some safe enclaves surrounded by the dangerous and almost unhabitable wasteland.</p>\n<p>Only some people, called the ShadowStalkers are trained and equipped to roam the dead cities and schorched landscapes. You are one of them and your quest is to find a sample of a long lost experiment that aimed at making plants, especially fruits and vegetables to be able to adapt to the harsh environment and making it possible to give more food to the surviving people.</p>\r\nGameplay\r\n<p>You are equiped with the standard weapons for the ShadowStalkers, a special crossbow that can shoot and utilize various types of ammo and your specially durable gasmask with a built in smart visor.</p>\n<p>You can scan your environments to get clues about what happened and information about items, doors and utilize your crossbow to take out any \"ghosts\" from a safe distance or from up close.</p>\n<p>Through your journey you will acquire some extra abilities and special ammo types that are needed to navigate through the remains of a once great civilization.</p>\r\nControls\r\n\r\nKeyActionW, A, S, DmoveSpacejump and \"Ok\" on start menu and full-text screensESCMain Menu: EXIT, Game: to main menu, Reading: escape from reading screenQchange ammoFinteracthold Cscanning<br/>F11toggle fullscreenleft clickslow attack, longer rangeright clicksmall colddown, smaller range\r\nCredits\r\n<p>This is a one man project. Graphics, models, programming, design and music is made by me, Kádár Jeremi Emánuel.</p>\n<p>Individual sound effects, like the sound of the crossbow are from https://freesound.org/</p>", "metacritic": null, "released": "2022-08-01", "tba": false, "updated": "2022-08-15T14:30:31", "background_image": "https://media.rawg.io/media/screenshots/39c/39c6383edfff2cd9fe383afd455a752e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atanii"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}