{"id": 836452, "slug": "pussies-wrestling-dicks", "name": "Pussies Wrestling Dicks", "name_original": "Pussies Wrestling Dicks", "description": "<p>Welcome to the world of Pussies Wrestling Dicks!<br />\nA unique and challenging puzzle game where you must use your drawing skills to get a fist to a target. Each level has its own difficulty, and every two levels you unlock a reward render that can be viewed in the gallery. There are 48 levels in total of varying difficulty.<br />\nThe theme of this game is wrestling, so expect some sexy renders of muscular pair grappling with each other as you progress through the levels. The gameplay is simple but addictive - draw shapes onscreen to create paths for your fist, then watch it fly across the screen towards its targets. There&#39;s something immensely satisfying about watching your creation come alive and take down its opponent, especially when it&#39;s done in spectacular fashion. So put on your thinking cap and prepare yourself for some intense puzzling action!<br />\nFeatures:<br />\n48 levels<br />\nPhysics based puzzles based on drawing<br />\nDifferent mechanics (simple lines, solid shapes, ropes, removing of a drawing)<br />\nVisual novel elements of conversations between two couples - Carmel &amp; Mahir and Milo &amp; Harper<br />\nSexy renders with a gallery<br />\nThe levels are all very open to your own creativity and there are usually multiple ways to solve it<br />\nGameplay: Every level has a fist and a target<br />\nYou must get the fist to the target and not drop out of screen<br />\nYou can do it in whatever way you want<br />\nYou can draw lines and shapes which are physically simulated - they fall down, they can push the fist, etc..<br />\nThe wrestlers are sweaty and muscular. This makes for an incredibly sexy experience as you try to guide your fists towards their targets!</p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2022-08-19T17:23:45", "background_image": "https://media.rawg.io/media/games/7bf/7bf81a6fc4a2237e93df6380d493b45e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cute Pen Games"], "genres": ["Casual"], "publishers": ["Cute Pen Games"], "esrb_rating": null}