{"id": 836455, "slug": "ikonei-island-an-earthlock-adventure", "name": "Ikonei Island: An Earthlock Adventure", "name_original": "Ikonei Island: An Earthlock Adventure", "description": "<strong>Explore. Gather resources. Craft tools and gear, build your base, and farm the land. Thwart pirates, fight monsters, and befriend magical creatures.<br/>Embark on this wholesome adventure: Ikonei is yours to discover!</strong><br/><br/><br/>Ikonei Island will be multiplayer! <strong>More coming soon!</strong><br/><br/><br/><br/>Harvest materials using tools and creature abilities, and build workshops that can create and assemble resources. All of these materials will come in handy to truly customize the island to your liking, and uncover its mysteries. Your hamlet, starting from dilapidated ruins, will grow to become your base of operations on the island.<br/><br/><br/><br/>After waking up on a bizarre island, you will meet mysterious statues and curious creatures. Bond with these creatures, and harness their unique and interesting abilities to explore deeper into Ikonei Island.<br/><br/><br/><br/>Create and nurture your farm from scratch, using various tools and systems for increased efficiency and rewards. <br/><br/><br/><br/>Keep the monsters at bay, and create powerful weapons to help you navigate Ikonei island!<br/><br/><br/><br/>Surely there are others who must know about Ikonei Island, each with their own story to tell, and knowledge to impart. <br/><br/><br/><br/>A band of pirates have discovered the island, and have their own plans on how to make money off of it. Make sure they do not get their way!<br/><br/>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2024-01-20T08:24:49", "background_image": "https://media.rawg.io/media/screenshots/c90/c90998a67013e14cfcb0ddbeee1f969e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 31, "toplay": 9, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Snowcastle Games"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Snowcastle Games"], "esrb_rating": null}