{"id": 836489, "slug": "dads-coming-2", "name": "Dad's Coming", "name_original": "Dad's Coming", "description": "After a whole afternoon at home with your sibling, the kitchen’s a mess, your room’s in disarray, you haven't hung the laundry: a normal day. <strong>SUDDENLY...</strong> you see on that phone notification that your dad will be coming home early - you hear the garage screeching and opening and... <strong>RUN!! DAD'S COMING!!</strong><br/><br/>Meet <strong>Bob</strong>, the goofy brother who’s scared and clumsy because he can't contain the anxiety of thinking about the horrible consequences of his actions - not playing video games for the rest of the night. It's chilling!<br/><br/><strong>Kate</strong>, on the other hand, was born for this. It's been years of intensive training of putting everything away and pretending she's asleep while her mother's on the way from the hallway to her bedroom, never once being discovered! And this time’s not going to be different.<br/><br/>To be able to clean up this mess and pretend that nothing happened you will need to:<br/><ul><li> <strong>Cooperate </strong>by throwing items between rooms until you place them in their respective places<br/></li><li> <strong>Be careful</strong> not to break windows or fragile items like grandma's urn - your mom won't be too happy if your grandma breaks twice!<br/></li><li> Keep an eye on <strong>Jack, the siblings’ cat</strong>! He is always messing around and knocking things over.<br/></li><li> Use the means in each house to be even quicker, such as service <strong>elevators</strong>!<br/></li><li> Watch out for <strong>blackouts </strong>when it's raining! Sometimes you will have to reactivate the circuit breaker!<br/></li><li> And much more!</li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-19T04:49:07", "background_image": "https://media.rawg.io/media/screenshots/98e/98e04880faecc607abeec972512dfb19.jpg", "website": "https://twitter.com/ColdLahmen", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cold Lahmen"], "genres": ["Action", "Casual", "Indie"], "publishers": ["Cold Lahmen"], "esrb_rating": null}