{"id": 836457, "slug": "nomori-prologue", "name": "Nomori: Prologue", "name_original": "Nomori: Prologue", "description": "<h3>Rethink reality</h3>Journey through twisted levels where the path ahead is not straight forward. Your only assistance is Usa, a spirit companion whose powers let you bend space and time. Rotate your perspective to walk on walls, travel through portals to take shortcuts, control the timeflow of objects and use telekinesis to build bridges.<br/><br/><br/><br/><strong>Control Timeflow</strong><h3>Master mind-bending powers</h3>The game offers a set of unique powers that you need to master in order to progress the game. Each level challenges your understanding of Nomori’s reality. Experiment, explore and be rewarded for thinking outside the box.<br/><br/><br/><br/><strong>Rotate Perspectives</strong><h3>Lost in a magical world</h3>Follow Kiko as she accidentally wanders into the shattered spirit world of Nomori. She is not quite sure how to get out, but with the help of spirit Usa she is confident to find a way. If Kiko ever needs time to rest her thoughts, she is sure to sit back and watch the clouds drift by.<br/><br/><br/><br/><strong>Manipulate Reality</strong><h3>Key features, currently</h3><ul><li>Puzzle and platform your way through 4 twisted levels.<br/></li><li>Open portals to create shortcuts.<br/></li><li>Rotate portals to change your direction of gravity.<br/></li><li>Use telekinesis to grab and toss cubes to reach higher places.<br/></li><li>Freeze or move objects through time to create platforms at your will.</li></ul>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T04:11:46", "background_image": "https://media.rawg.io/media/screenshots/774/77415fd120cf4dbf6c36918bf299c7ae.jpg", "website": "https://www.enchantedworks.nl/nomori/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Enchanted Works"], "genres": ["Adventure", "Indie"], "publishers": ["Enchanted Works"], "esrb_rating": null}