{"id": 836419, "slug": "exacto", "name": "EXACTO", "name_original": "EXACTO", "description": "<p>EXACTO\r\n</p>\n<p>When the blades are shocking and the horn screams on the battlefield, it's not easy for the wizards of the Seventh Academy to make the crucial decision: who will sacrifice themselves to light the Arcanic tower. The only fair way is to let the dice decide in an Exacto game !\r\n</p>\n<p>What are EXACTO’s rules:\r\n</p>\n<p>EXACTO is played with 6 mages.\r\n</p>\n<p>Each mage starts with a runic cup and five dices.\r\n</p>\n<p>To begin, each mage simultaneously shakes their cup and then upends it onto the table using it to conceal their dice from other mages.\r\n</p>\n<p>Having looked at their dice, the first mage makes a call based on how many dice of a certain number there may be under all the cups. They have to bear in mind two factors:\r\n</p>\n<p>1. The total quantity of dice on the table. For example, if there are six mages (total of 30 dice), the law of averages suggests there should be at least (for example) five of any face. \r\n</p>\n<p>2. All ‘ones’ are jokers, so they can be used as any number. This means that when the dice are being counted at the end of a round, ‘ones’ contribute to the number of whatever call is in question.\r\n</p>\n<p>3. Once the call (let’s say five twos) is made, the next mage can do one of three things. \r\n</p>\n<p>They can either accept the bid or call ‘LIAR’ (by clicking on the dagger). If they accept the bid (i.e. deem it plausible), they must raise the call by either calling the same quantity of a higher number, say five threes, or a greater quantity of the same number or higher, say six fours. \r\n</p>\n<p>They can call ‘LIAR’, then the round stops and the mages lift their cups and the dice are counted, including the ‘ones’. If the total adds up to or exceeds the bid doubted, the challenger loses a die. If the count is less than the bid, then the bidder loses a die.\r\n</p>\n<p>They can call ‘EXACTO’, then the round stops and the mages also lift their cups and reveal the dice. If the values are exactly what the bid was before the mage called EXACTO, he wins a dice back and the previous mage loses a dice. If not, he loses a dice.\r\n</p>\n<p>You win and lose dice until there is only one person remaining with any dice, and they are the winner of that hand.\r\n</p>\n<p>Credits:\r\n</p>\n<p>Game Design: peruvians\r\n</p>\n<p>Development: Harneaux, KushalaDaora, and GregTheWard\r\n</p>\n<p>Sound and music design: JB, Katrijn, and Shunra\r\n</p>\n<p>Art: Altadir\r\n</p>\n<p>Thank you for playing our game, made in 50h hours a week after the GMTK GJ 2022, since we were not able to participate the right week</p>", "metacritic": null, "released": "2022-07-24", "tba": false, "updated": "2022-08-15T14:33:39", "background_image": "https://media.rawg.io/media/screenshots/3cb/3cbe0407d47abaf6f450525cdeb0e93c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["Kushala", "Altadir", "Harneaux"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}