{"id": 836480, "slug": "backpack-hero-2", "name": "Backpack Hero", "name_original": "Backpack Hero", "description": "https://store.steampowered.com/app/1970580/<br/>Storm the Dungeon! Backpack Hero is the inventory management roguelike! Collect rare items, organize your bag, and vanquish your foes!<br/><br/>Backpack Hero is a twist on your standard deck-building roguelike! It isn't just about what you carry, but how you organize items within your bag! Their placement has huge effects on their power! You can move items to increase their power!<br/><br/><br/><ul><li><strong>Collect hundreds of rare items</strong>. Each item has unique effects and can be good in the right arrangement!<br/></li><li><strong>Battle with over 40+ enemies.</strong> Enemies have varied attacks. Learn their attack patterns and vanquish your foes!<br/></li><li><strong>Endless dungeons to explore!</strong> Randomly generated levels have unique layouts, interesting events, and unpredictable challenges.</li></ul><br/>There's more to Backpack Hero than just organizing your backpack. You explore ancient dungeons, caves, swamps, and more! Don't get lost!<br/><br/><br/>Many animals live in the dark dungeons beneath the world. You will encounter colorful friends and deadly foes! <br/><br/><br/>When you aren't putting your life in danger, you will use the resources you have gathered to upgrade your town! By organizing the perfect town, you will restore the world of Orderia and rescue the animals who live there! Your progress in the overworld unlocks new content but it won't give you any unfair advantages on a trip into the dungeons.<br/><br/><br/>Please join our community! Our developers visit every day and will take your feedback seriously!", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2024-02-16T16:04:11", "background_image": "https://media.rawg.io/media/screenshots/11e/11e4cfebb24aa7707a734021f8dbfa49.jpg", "website": "", "rating": 3.62, "rating_top": 4, "added_by_status": {"yet": 3, "owned": 75, "beaten": 6, "toplay": 9, "dropped": 11, "playing": 2}, "playtime": 3, "achievements_count": 0, "ratings_count": 13, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 13, "platforms": ["macOS", "PC", "Linux"], "developers": ["Jaspel"], "genres": [], "publishers": ["IndieArk", "Different Tales", "Jaspel"], "esrb_rating": null}