{"id": 836501, "slug": "prime-directive", "name": "Prime Directive", "name_original": "Prime Directive", "description": "Marty has crash landed on an alien world. He must escape, but can he survive? Guide him through interconnected environments and fight off hordes of alien creatures while you discover what happened to the abandoned human colony. <br/><br/><br/><br/>-Discover secrets and power up Marty to explore deeper into the planet Xenix in this metroidvania style first person adventure game inspired by Metroid Prime. <br/>-Collect dozens of power-ups to got from fragile to super charge over the course of the adventure.<br/>-Explore a mysterious alien world with 4 different environments to discover.<br/>-Recover logs and piece together the fate of the missing colonists.<br/>-Fight off dozens of alien life forms including titanic battles with MegaFauna.<br/>-Solve complex puzzles using unique power ups including self duplication.<br/>-The game can be played with guidance for a more streamlines experience, or guidance can remain off for the hard core explorer.<br/><br/><br/><br/>-Fight 1v1 for points by accomplishing pre-selected objectives.<br/>-1v1 escalates to 5v5... 12v12... 50v50 and so on... as each life is recorded and added to the battle turning you into a literal one man army!<br/>-Multiplayer can be enjoyed in local split screen.<br/>-Online multiplayer is in production to be released at a later date.", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T05:06:06", "background_image": "https://media.rawg.io/media/screenshots/057/057030ed731fc345d37f66f101dc8941.jpg", "website": "https://1jstoffer.wixsite.com/my-site", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 391, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kitty Soft Studios"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Kitty Soft Studios"], "esrb_rating": null}