{"id": 836574, "slug": "soulforged-2", "name": "Soulforged", "name_original": "Soulforged", "description": "Soulforged is a passion project of one developer aiming to create a game where players become a part of a living and breathing fantasy world. What makes Soulforged different is how your character is part of its persistent world at all times. As you go about your day, your character earns action points that you can then spend when it's convenient for you on a variety of tasks like travelling, gathering, crafting or fighting. The game focuses on the important moments and does away with needing the players to spend hours upon hours every day to progress your character, like almost all other MMORPG games do.<h3>Pricing</h3>The entire game is completely free to play. On top of that I am committed to having no other monetization tied to the game. There will be <strong>no</strong> upfront cost, <strong>no</strong> micro-transactions, <strong>no</strong> macro-transactions, <strong>no</strong> in-game purchases, <strong>no</strong> purchasable cosmetic items, <strong>no</strong> loot boxes, <strong>no</strong> expansions nor \"DLC\". You simply get access to the entire game for free and whatever you attain in the game - that'll be all through in-game means.<h3>Feature list</h3>While the game is currently under development there's already a number of features included in the game. The list below is not meant to be exhaustive, but more to outline the current state of the game.<br/><ul><li>A starting location which includes some guidance<br/></li><li>Multiple large and distinct areas<br/></li><li>Resources, items and monster names all dynamically named by the players<br/></li><li>Hunting, fishing, mining and other gathering professions<br/></li><li>Robust research &amp; discovery system<br/></li><li>Crafting &amp; equipment management<br/></li><li>Building construction, including player housing and housing decorations<br/></li><li>Player-made towns, roads, bridges and other infrastructure<br/></li><li>Meaningful character skills and statistics<br/></li><li>Complex and involved wound and healing system<br/></li><li>Farming - grow and harvest plants on your own farm<br/></li><li>Hostile creatures and combat system</li></ul>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2022-08-19T06:34:18", "background_image": "https://media.rawg.io/media/screenshots/155/155c8a7e9a5b037ee0a752677be29ec8.jpg", "website": "https://soulforged.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arkadiusz Bisaga"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Arkadiusz Bisaga"], "esrb_rating": null}