{"id": 836596, "slug": "fall-of-porcupine", "name": "Fall of Porcupine", "name_original": "Fall of Porcupine", "description": "Step into the town of Porcupine and take to the well-loved scrubs of Finley, the newest fledgling doctor to join the ranks of St. Ursula's hospital. As the seasons in the small-town change and life starts to stir, you'll soon realize that things aren't always what they seem: Not everyone is honest with themselves and others, the healthcare industry is not as illustrious as it seemed in medical school, and the work/life balance Finley strives toward might be impossible to achieve.<h3>Check out the \"Save the World\" Edition</h3><h3>Explore A Beautiful, Diverse World</h3>Not only is there a lot to discover in the old hospital, but also in the small town of Porcupine itself. Take the time to meet the villagers and have a beer with them in the local pub, take a trip to the nearby forest, or spend quality time with your friends.<br/><h3>Hardened Professionals, Sweet Friends</h3>The blunt head doctor, the selfless nurse, Finley's smart friends, and many other residents populate the small town of Porcupine. Engage in funny, profound, and sometimes serious dialogues, in which you'll be able to choose your answers and influence your relationships.<h3>Demonstrate Your Skills and Empathy</h3>You don't even have time to look at the clock because your patients are waiting! Investigate what's wrong with them through your conversations and treat them in different minigames that challenge you in logic, speed, and skill.<h3>Expose Social Injustice And Structural Problems</h3><br/>At first glance, the small town is a warm, friendly place where everyone knows and greets each other. But if you live there for any length of time, you'll suspect that not everyone is as honest as they pretend to be – especially in an unhealthy healthcare-system. <br/><br/>https://store.steampowered.com/app/1710540/Fall_of_Porcupine/", "metacritic": null, "released": "2023-06-15", "tba": false, "updated": "2024-03-31T13:05:55", "background_image": "https://media.rawg.io/media/screenshots/953/95319df3c6cf3fad83ee2a13d3eea947.jpg", "website": "https://www.porcupine.game/", "rating": 0.0, "rating_top": 4, "added_by_status": {"yet": 7, "owned": 18, "beaten": 3, "toplay": 10, "playing": 3}, "playtime": 1, "achievements_count": 19, "ratings_count": 5, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["BUNTSPECHT.GAMES", "Critical Rabbit"], "genres": ["Adventure", "Indie"], "publishers": ["Assemble Entertainment", "TBA"], "esrb_rating": null}