{"id": 836551, "slug": "neodash", "name": "Neodash", "name_original": "Neodash", "description": "Define your own path and survive until you reach the end that lies ahead of you by swerving, drifting and flying across traps and obstacles while avoiding the abyss. But there's a catch: the world is disintegrating at your heels; better go fast, or you might not make it.<br/><br/>Neodash plunges you in a unique sci-fi atmosphere that is brought to life by music: the environment reacts to the beat in different ways, creating a thrilling and immersive audio-visual experience. <br/><br/><h3>KEY FEATURES </h3><br/><br/><strong>A large collection of high-energy electronic songs, including Monstercat releases</strong><br/><br/>Playlist of over 25 songs from a wide range of electronic genres such as synthwave, drum &amp; bass, EDM. <br/><br/><strong>Challenging campaign that takes you in for an immersive, thrilling ride</strong><br/><br/>Over 45 levels, progressively introducing new mechanics. Find the hidden red gates to unlock hardcore difficulty levels. <br/><br/><strong>Unlock car models, wheels and other cosmetics</strong> <br/><br/>Beat levels to earn points, and unlock many different items to customize your car. The higher difficulty levels you beat, the more points you get! <br/><br/><strong>Powerful and intuitive in-game level creator</strong><br/><br/>Let your creativity run wild in the level editor with a multitude of customizable roads, obstacles, effects and environments. Publish your creations online for others to enjoy.<br/><br/><strong>Compete for faster runs against other players' ghosts</strong><br/><br/>Each level has an online leaderboard where you can compete worldwide for the fastest runs. Race against player ghosts and attempt to reach the top of the leaderboards!<br/><br/><strong>Play and rate user-created levels</strong><br/><br/>The online level browser allows you to easily access and download any user-created level. Filter levels by difficulty, ratings, downloads and immediately jump into action.<br/><br/>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-09-23T19:22:33", "background_image": "https://media.rawg.io/media/screenshots/32a/32a599678d51660453f633e6a6b1151a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 20, "toplay": 2, "dropped": 2}, "playtime": 1, "achievements_count": 14, "ratings_count": 1, "suggestions_count": 259, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "PC"], "developers": ["Axan Gray"], "genres": ["Action", "Racing", "Indie"], "publishers": ["Axan Gray"], "esrb_rating": null}