{"id": 836535, "slug": "fortune-famine", "name": "Fortune & Famine", "name_original": "Fortune & Famine", "description": "In this tabletop strategy game you play as the ruler of a fantasy kingdom on the brink of a long winter.  You compete against neighboring rulers to gather the best workers and stockpile the most resources in the land.<br/>\n<br/>\r\nThe digital version plays like the tabletop version of Fortune &amp; Famine, but with digital cards and tokens.  You begin by selecting a First Player, then choosing from 1 of 6 Rulers, each with a unique ability.<br/>\n<br/>\r\nGameplay is broken down into phases:  In the Hire phase, players bid on workers to fill out their kingdom.  In the Attack phase, players use their attacking workers to steal resources from other players.  In the Payment phase, players spend resources on their workers which will pay off in the Rewards phase, where players collect rewards from their workers.  And finally in the Decision phase, players can pull resources OR pay to store their grain where it cannot be stolen.<br/>\n<br/>\r\nWorker cards include tradesmen like Farmers, Merchants and Jesters, who generate resources.  There are also supporting workers like Traders, who allow you to quickly convert currencies; Philosophers, who double the payout from other workers; and Seers, who protect your from attacks.  And finally Wizards, light wizards who give you resources, and dark wizards who allow you to steal from your neighbors.<br/>\n<br/>\r\nThe game lasts for 4 seasons of play across 3 worker decks.  Whichever player has safeguarded the most resources at the end of 12th round wins.<br/>\n<br/>\r\nThe digital version allows players the chance to play with others remotely via Steam Remote Play, or locally by taking turns.", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-19T05:48:21", "background_image": "https://media.rawg.io/media/screenshots/f45/f4542e0f56209fef55e33ae5c10245ad.jpg", "website": "http://fortuneandfamin.simeousbusiness.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Simeous Business", "Mid Level Meeple"], "genres": ["Strategy", "Indie"], "publishers": ["Simeous Business"], "esrb_rating": null}