{"id": 836678, "slug": "idle-mortician", "name": "Idle Mortician", "name_original": "Idle Mortician", "description": "Welcome to Idle Mortician - a brand new idle clicker game. In this idle simulation game, you start running a small cemetery and working hard to manage, expand your team and upgrade  buildings to earn more money.<br/>Features:<br/>*Run your own funeral home like a Business Tycoon<br/>Idle click and Tap through your way from a small funeral home to a grand funeral empire, create and build everything from scratch, make smart and strategic business decisions, hire smart employees, expand the funeral home, run daily operations, take good care of customers and keep them happy.<br/><br/>*Expand the funeral Business<br/>Expand your funeral home from LV1 to LV100! You can make the cemetery bigger and better as you expand and grow your business. Use Tap tap or idle clicker method and create a Cremation for customers to final disposition of a dead body through burning. Create a café bar that let customers waiting for time to dispose of dead bodies<br/><br/>*Hire Employees<br/>To become a funeral tycoon, you need to hire great employees. As the business grows bigger, Manage your staff efficiently you will need to hire multiple employees ranging from a receptionist to a flower sales for sale flower to customers, from a mortician to embalming waiter, from priest to pianist to help customers to soothe the brokenhearted Customers and so on. The employees will help grow your clicker empire!", "metacritic": null, "released": "2022-02-28", "tba": false, "updated": "2022-08-19T08:28:44", "background_image": "https://media.rawg.io/media/screenshots/035/0358c832ff4ea4c4d57e0da507b68bbd.jpg", "website": "https://www.sedagames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 133, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["建涛 钟"], "genres": ["Simulation", "Casual"], "publishers": ["建涛 钟"], "esrb_rating": "Everyone 10+"}