{"id": 836621, "slug": "zompiercer-last-day-on-train", "name": "Zompiercer - Last day on train", "name_original": "Zompiercer - Last day on train", "description": "Your Home is the Train! Move around the world on rails, explore New Locations, defend your Home from zombies, crush them at full speed!<br/>Stop only to get resources and create items for survival, but remember this is a risk to your Life! Along the way, you are sure to face many dangers. We promise you it will be fun!<br/><br/>GAME FEATURES<br/>- Build and upgrade your Train and crafting stations<br/>- Hunting for wild animals and zombies<br/>- Crafting resources to survive<br/>- Search for items needed to survive in abandoned cities<br/>- Survival fight with zombie bosses<br/>- Defend your home from waves of zombies<br/>- A fascinating storyline, hardcore and the struggle for life!<br/><br/>You have to get to a safe place and figure out what is the reason for the sudden appearance of a crowd of the dead.<br/><br/>TRAIN CONSTRUCTION<br/>The train is your only home. You can't stop and leave the train for a long time. Upgrade and strengthen your shelter.<br/>You must always be ready to fight for your Life and the lives of your Friends!<br/><br/>CRAFT WEAPONS AND DEFENSIVE GEAR<br/>Craft stations to process resources, craft workbenches to produce materials. Get rare materials in abandoned cities. Build a reliable Survival Home!<br/><br/>EXPLORATION AND SURVIVAL<br/>This game has a lot of abandoned cities, dense and scary forests, dangerous mountains, explore them to stay alive. But remember, they are all inhabited by deadly enemies - zombies!<br/><br/>ZOMBIES, MUTANTS, DEAD, MONSTERS, UNDEAD!<br/>Only you, your Friends and millions of monsters are left everywhere in the World. Zombies are waiting for you in the most unpredictable places. Be ready to attack or defend at any moment! Develop your hunting skills to destroy all enemies on your way!<br/><br/>What are you waiting for? Welcome to the Zombie Apocalypse World!<br/><br/>Game premium access gives valuable game bonuses:<br/>- free unique survival mode<br/>- 50 coins every day<br/>- inventory expanded with 5 free slots<br/>- hunger and thirst speed decreased by 50%<br/>- 2 unique weeapons every day<br/><br/>You can take advantage of the 3 day free trial period to evaluate premium access.<br/>The cost of a weekly subscription is $7.99. Premium Access will be charged to iTunes Account at confirmation of purchase.<br/>Subscription automatically renews unless auto-renew is turned off 24 hours before the end of the current subscription. Subscription renewal fees are charged to the account 24 hours prior to the expiration of the current subscription.<br/>Subscriptions can be managed and auto-renewal turned off by going to your Account Settings after purchase. You cannot cancel the current subscription after the start of its validity period. If you purchase a subscription, the unused portion of the free trial period will be forfeited.<br/>Please read our:<br/>- Privacy Policy https://privacy.playdarium.com/<br/>- ELUA https://docs.google.com/document/d/1caVlzPz3GMWkG__JKLnnw2JX9xueUZ6zPuYw1KlALZ8/edit?usp=sharing<br/>Customer Service https://playdarium.com/", "metacritic": null, "released": "2022-07-02", "tba": false, "updated": "2022-08-19T07:34:15", "background_image": "https://media.rawg.io/media/screenshots/1e4/1e4cb50cd4dedf22d141d241588451ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mark Iakobson"], "genres": ["Adventure", "Simulation"], "publishers": ["Mark Iakobson"], "esrb_rating": "Everyone 10+"}