{"id": 836610, "slug": "gangster-simulator-vegas-crime", "name": "Gangster Simulator Vegas Crime", "name_original": "Gangster Simulator Vegas Crime", "description": "If you like gangster simulator gaming - try to play our best action game: Gangster Simulator Vegas Crime. The criminal world will always exist on the streets in the town. In this free game, you have to try to go adventure crime saga to the pinnacle of mafia city. The price of success in this gang world is very high, few can reach the top. <br/>Try your skills in an exciting 3D third-person shooter with RPG elements and plunge into the atmosphere of street gang wars in an open 3D world. You are waiting for adventure missions throughout the big city. A dangerous and fascinating world in which harsh laws apply will appear before you in all its glory. If you are ready to test yourself - then go ahead, show everyone who is a real gangster in the town, eliminate all fake competitors and call a big underground empire yourself.<br/><br/> Huge modern city<br/> The plot of the game takes place in a large modern city surrounded by ghetto streets. Tall skyscrapers and luxurious life make this city an oasis in the desert. This sinful town never sleeps and attracts with its lights all who dare to challenge the stone jungle. Try your hand at this exciting crime adventure to success and glory.<br/><br/> Exciting quests<br/> Exciting adventure missions are waiting for you to get the necessary game resources that will be useful to you for more serious tasks. You will encounter a harsh street life where everyone is for himself. The streets of the world constantly require concentration, as crazy bullets can fly here or gangs wage war with large-scale shootings. Passing interesting adventure missions you better know who and how rules this vice city.<br/><br/> Bunch of weapons<br/> At your disposal will be a rich arsenal with which you will not get bored. It helps combat gangsters. Cool and pumped guns will help you through the game. Improve your skills in agility, stamina, control equipment, and weapons. In the weapons store, you will find a wide selection. There are things for every taste. Starting from the smallest knife to a powerful machine gun with which you need to be able to handle. You can arm yourself to the maximum, no one will stop you.<br/><br/> Vehicles<br/> The game has a large number of different vehicles. Ordinary city cars, sports cars. In the store you will find powerful motorcycles, they will allow you to easily get away from the pursuit. A powerful and heavily armed tank is waiting for you, the tank is the most effective tool in the game, no one mafia guy will stop you with it.<br/><br/> Gangster Simulator Vegas Crime is cool open world game with many attractive features:<br/><br/>  - Multiple camera views<br/>  - Challenging and thrilling missions<br/>  - Try cool stunts on a helicopter<br/>  - Multiple challenging tasks with cool rewards.<br/>  - Best mafia real gangster vegas simulator games<br/>  - An open world with racing challenge<br/>  - Great choice of weapons to arm<br/>  - Explore the crime city in criminal world<br/>  - Track important tasks through map<br/><br/> If you are ready to test yourself - then go ahead, show everyone who is a real crime gangster simulator in the gangster vegas town then eliminate all fake competitors in this gangster games.", "metacritic": null, "released": "2022-07-17", "tba": false, "updated": "2022-08-19T07:22:37", "background_image": "https://media.rawg.io/media/screenshots/7d7/7d7cfaa7d89b3e54b3e71bfe75232294_kLAhLsC.jpg", "website": "https://appvolu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bui Quy Lan"], "genres": ["Adventure", "Simulation"], "publishers": ["Bui Quy Lan"], "esrb_rating": "Teen"}