{"id": 836683, "slug": "guitar-band-solo-hero", "name": "Guitar Band - Solo Hero", "name_original": "Guitar Band - Solo Hero", "description": "Guitar Band Solo is a music game that offers a unique combination of rhythm, band and guitar. Play the best pop, rock and heavy metal rhythms, from classics to current beats. Upgrade your guitars and be the hero of millions of fans in the biggest music and rhythm game in the Guitar Band franchise!<br/><br/>PLAY THE BEST OF THE MUSIC<br/>• Tap, drag, and hold the beat to get more fans.<br/>• Perform famous rhythms and tap like a rock star hero.<br/>• Master each song and climb the leaderboard.<br/><br/>UPGRADE EACH GUITAR<br/>• Collect dozens of 3D high-definition guitars.<br/>• Upgrade and customize each guitar to be a pop, rock and heavy metal hero.<br/>• Each guitar is made to tap a rhythm and song style, be sure to make good choices.<br/><br/>CREATE YOUR OWN BAND<br/>• Start your band in the garage and evolve by playing gigs and unlocking songs and guitars.<br/>• Tap the perfect rhythm to be a rock n roll hero and rank in every song.<br/><br/>MUSIC AND RHYTHM IN AN ORIGINAL GAME<br/>• Music adapted for short games: your gameplay will be dynamic and fun.<br/>• Guitar Band Solo presents a different, fluid model for you to have fun while learning songs, rhythms, guitars, and becoming a beat hero!<br/><br/>Please note: Guitar Band Solo is completely free to play, however some game items can be purchased for real money. It is possible to play offline.", "metacritic": null, "released": "2022-07-12", "tba": false, "updated": "2022-08-19T08:33:35", "background_image": "https://media.rawg.io/media/screenshots/8e2/8e2fb343583806abff088a9364c0c716_CzJi01l.jpg", "website": "http://zeeppo.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zeeppo Games Ltda"], "genres": ["RPG"], "publishers": ["Zeeppo Games Ltda"], "esrb_rating": "Everyone 10+"}