{"id": 836638, "slug": "pathi-physics-logic-puzzles", "name": "Pathi - Physics Logic Puzzles", "name_original": "Pathi - Physics Logic Puzzles", "description": "PATHI – ABSTRACT &amp; MINIMALIST LOGIC PHYSICS BALL DROP PUZZLE<br/>Do you love the challenges of the brain physics puzzles in which you need to guide balls from one spot to another?<br/><br/>Tired of complex 3D puzzles, and want a minimal abstract puzzle in 2D that you can also play offline?<br/><br/>Meet Pathi – the new physics line path puzzle in which you need to guide the ball by placing, dragging, and rotating shapes. Play this relaxing puzzle game offline for free and test your physics drop puzzle logic skills in 80 levels. <br/><br/>How long can you go? Can you pass all levels in this mind-teaser ball path logic puzzle?<br/><br/>Play this minimalist 2D physics based puzzle NOW FOR FREE and with NO WIFI!<br/><br/>◆ BRAIN TRAINING MADE FUN &amp; RELAXING<br/>Drag, rotate, and place blocks to find the right path to the goal. Drop the ball and use many different level components to fill the path and achieve your goal: modify gravity, use portals, avoid obstacles and play with physics in abstract minimalist graphic levels! Watch out, there are blocks with thorns that can destroy the ball. <br/><br/>◆ WIDE CHOICE OF PHYSICS PUZZLE BLOCK TYPES<br/>Use many different block types to draw the path you try to complete and send the ball to the goal. In this gravity draw physics line game there are different ways to complete the level. Experiment using your logic to find the best ball path!<br/><br/>Use these block types to complete the physics logic puzzles:<br/><br/>- Rect: use it to complete a route or avoid obstacles<br/>- Spring: launch the ball in the direction you want!<br/>- Launchers: rotates by some degrees and then launches the ball. There are 3 different types of launchers with different angles!<br/>- Moving Platform: moves around allowing you to cover greater distances<br/>- Gravity modifier: changes gravity in any direction you want! Play upside down or sideways to complete the brain puzzle<br/>- Breakable rect: a rect that explodes after being hit!<br/>- Moving rect: well it's just a moving rect that goes upside down...use your imagination to decide how to take advantage of this!<br/><br/>◆ 80+ COGNITIVE PHYSICS PUZZLE LEVELS<br/>Our ball puzzles currently feature 80+ line physics puzzle levels. Test your physics logic solving skills and relax with the 2D physics puzzle gameplay and graphics. <br/><br/>Cool fact: All the physics puzzle levels will be always available offline and for free, so you will never have to pay anything!<br/>◆ FEATURES OF PATHI – DROP BALL PHYSICS LOGIC PUZZLE<br/>● Play in 80 different levels! And many more will arrive in the future!<br/>● Play always for free and offline! Excellent choice if you are in search for no wifi puzzle games to play offline.<br/>● Abstract and minimalist graphics with pastel colors<br/>● Drag, drop, and rotate the different types of blocks<br/>● Modify gravity, teleport using portals, avoid obstacles, and much more!<br/>● Experiment using physics to complete the levels<br/>● Complete the puzzle game in different ways drawing different paths<br/>● Train your brain using logic and physics-based puzzles<br/>Now it’s time to challenge your brain with a new physics cognitive game. Train focus, sharpness, problem-solving daily while having fun in your leisure time.<br/>► Download Pathi and show that you are the physics puzzle guru with high intelligence. <br/>---<br/>PERFECT FOR:<br/>- kids and adults that love minimal puzzle logic games<br/>- anyone looking for relaxing brain training<br/>- anyone looking for fun offline logic puzzles <br/><br/>CONTACT<br/>If you have any queries regarding our ball path physics puzzle please send them to seriouspeoplegames@gmail.com. Till then relax and enjoy playing this brain-teasing puzzle quest.", "metacritic": null, "released": "2022-01-12", "tba": false, "updated": "2022-08-19T07:49:28", "background_image": "https://media.rawg.io/media/screenshots/00b/00be0c671066e538823f3b06f40eb879_qTD2G2k.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zigrid Shehu"], "genres": ["Puzzle"], "publishers": ["Zigrid Shehu"], "esrb_rating": "Everyone 10+"}