{"id": 836711, "slug": "american-ambulance-driving", "name": "American Ambulance Driving", "name_original": "American Ambulance Driving", "description": "Do your duty as 911 Emergency Service! Help the people. Get ready to experience a realistic ambulance game.<br/><br/>Game Features:<br/>• 6 Ambulances<br/>• Ultra HD graphics<br/>• Game without internet (no wifi)<br/>• Realistic ambulance cars<br/>• 5 sirens<br/>• Different weather conditions<br/>• Inside driving<br/>• +200 Missions<br/>• Completly free<br/><br/>Our game specially prepared for those who love ambulance games is on the air! Choose your ambulance vehicle and help people. Arrive on time for missions in the huge city, heavy traffic. Earn money and modify your vehicle. Get ready to play the totally realistic car simulation game. Activate your sirens and take a tour of the big city. Thanks to our open world game, you can get on and off your vehicle whenever you want.<br/><br/>When you receive an announcement, reach the scene as soon as possible. Take the patient in your ambulance car and take him to the hospital. Thanks to the offline game feature, you can play our game by turning off your internet.<br/><br/>Our car game, which is shown among the best simulation games, was published in 2022. You can download our ambulance game, which is in the leading category of the car games category, for free.<br/><br/>• If you like this ambulance game, don't forget to comment. Have fun.", "metacritic": null, "released": "2022-07-27", "tba": false, "updated": "2022-08-19T09:01:20", "background_image": "https://media.rawg.io/media/screenshots/d81/d81a9a7c9dbfeb4c945cdca0ee38f371.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CLAP GAMES OYUN TEKNOLOJILERI SANAYI VE TICARET"], "genres": ["Simulation", "Racing"], "publishers": ["CLAP GAMES OYUN TEKNOLOJILERI SANAYI VE TICARET ANONIM SIRKETI"], "esrb_rating": "Everyone 10+"}