{"id": 836770, "slug": "eternal-ember-2", "name": "Eternal Ember", "name_original": "Eternal Ember", "description": "Background Story<br/><br/>God left us.<br/><br/>The devils from the hell have reached their claws into our world, and the enemy in the void is also staring at us with hostility. In this vital time, we need to save the world more than any time, but God is still silent. So, we can only pick up our weapons and fight for your own survival. Adventurers, except for you, who else can stand up, fight with us against the devils?<br/>Eternal Ember is a Dark Fantasy style Online Idle RPG. You need to build an adventure team to explore the vast continent, engage in exciting battles and get the loots.<br/><br/><br/>Game Features<br/><br/>Category of Monsters<br/><br/>From the basic goblins, skeletons, to the giant golems, hell devils, a wide variety of monsters are waiting for your challenges.<br/>The various categories of monsters’ skills require you to constantly adjust your strategy in the battle. In addition, there are 9 main storyline bosses and more elites, and you must be more careful when fighting with them.<br/><br/>Various Classes<br/><br/>There are heroes of various classes in the game.<br/>Currently, there are 8 classes available: Crusader, Ranger, Priest, Warrior, Hunter, Shaman, Sorcerer and Necro Knight. Each hero can also unlock exclusive ultimate skills, talent trees etc., completely change hero function and strategy, and create more genre of tactical play.<br/><br/>Idle Strategy for Your Squad<br/><br/>In most cases, you need to send four heroes to fight at the same time, so you not only need to consider the hero classes, the potions you carry, but also how to arrange the positioning of heroes in the map, to lead the battle toward the direction of your planning.<br/>After doing a good pre-plan, you just need to relax, watch the heroes to automatically fight with monsters in different maps. Yes, this game doesn't need you to do too much operation during the battle, give everything to the heroes!<br/><br/>Customized Build<br/><br/>If you like to grind, the game is full of loots. Over 100 kinds of weapons and gears are waiting for you.<br/>Gears are the important part of the game. The loots in the game is also mainly based on the gears. After all, nobody can resist the joyful sound when looting the legendary gear after killing the monster.<br/>The game provides great freedom to those who like to pursue the ultimate gear sets. In the blacksmith, you can create your own exclusive gears, from multiple dimensions to improve the properties of gears, make it better to fit your game style.<br/><br/>Vast Continent<br/><br/>The continents in the game are divided into 9 major plates.<br/>Each plate has completely different terrain and various fierce monsters. And there are multiple special map nodes in the game, whether you want to test your own limit or with NPC to resist fierce enemies, you can get a completely different combat experience. The whole world is waiting for you to challenge.<br/><br/>Explore the Rift<br/><br/>There is a very mysterious field in the game – the Shadow Realm. Among them, there are very powerful and unique shadow monsters. Can you overcome them, get cherished treasures?<br/><br/><br/>Epilog<br/><br/>Eternal Ember is a free world and hope you can like it as much as we do. <br/>Good luck and loot well.", "metacritic": null, "released": "2022-06-16", "tba": false, "updated": "2022-08-19T09:55:20", "background_image": "https://media.rawg.io/media/screenshots/97c/97c390a5fae8995cbe812f84666de5ca_Pmpegg2.jpg", "website": "http://www.zencat.info/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Zencat Gaming"], "genres": ["RPG", "Strategy"], "publishers": ["Neuronads Technology Co.,Limited"], "esrb_rating": "Teen"}