{"id": 836771, "slug": "super-citycon-city-builder", "name": "Super Citycon - City Builder", "name_original": "Super Citycon - City Builder", "description": "Huge and unlimited maps, short construction times and a simulation style economy!\u2028<br/>From Gamers for Gamers: A city building game you will enjoy!\u2028<br/><br/>Build your very own City on beautiful and huge maps. Unlock over 150 Buildings of multiple categories, some of them with multiple variations. <br/><br/>Start with a farm, build your residential neighborhoods, commercial and industrial areas, care about water, food, energy, and waste management. <br/>Take care of your resident's security with police and fire stations, be sure they stay healthy with medical center’s and hospitals.<br/>Make your City a great place to live with parks, sports, and recreation areas! \u2028<br/><br/>SUPER CITYCON is a homage to the classic city-building genre combined with modern gaming mechanics in 3D.<br/>It’s a mix of tycoon, combined with classical simulation elements. <br/><br/>Earn more, build more! \u2028The more you progress, SUPER CITYCON opens up to be a huge city-building sandbox playground with unlimited opportunities.<br/><br/>What makes SUPER CITYCON different?<br/><br/>* Our Maps are huge, damn huge, over 15,000 tiles per map! Over 1000 Buildings fit on each!<br/>* Our Maps are empty, with no prebuilt elements. Place things where YOU like them!<br/>* Get full maps! No partial unlocking! Plan your future Metropolis from the beginning.<br/>* Low building times! No paid option to finish them faster! (sorry)<br/>* No matter how long your playing sessions are, there is always something to do!<br/><br/>Made with love and passion:<br/>\u2028SUPER CITYCON is brought to you by Ben &amp; Juan - Ben Willes Games, an independent two-man crew.<br/>Within the past 4 years, we gave our very best to create the most enjoyable city building game for mobile.<br/><br/>This is just the beginning! \u2028With your support, we will continue our Vision to make SUPER CITYCON a one of a kind city building experience.", "metacritic": null, "released": "2022-05-11", "tba": false, "updated": "2022-08-19T09:56:27", "background_image": "https://media.rawg.io/media/screenshots/3c7/3c7a9233af21b5024c8b4ec4e94f2a53_fQpUW6b.jpg", "website": "https://benwilles.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 309, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ben Willes Games"], "genres": ["Strategy", "Simulation"], "publishers": ["BEN WILLES GAMES, SOCIEDAD LIMITADA"], "esrb_rating": "Teen"}