{"id": 836716, "slug": "color-now-color-by-number", "name": "Color Now - Color by Number", "name_original": "Color Now - Color by Number", "description": "Have fun and be relax anytime, anywhere with Color Now.<br/><br/>Color Now is a coloring puzzle game for adults with painting by numbers. There are more than 10,000+ fascinating coloring pages in this coloring book. It is so relax to finish an artwork and bring pictures to life by coloring by numbers.<br/><br/>In our coloring game we have so many hot categories for choosing, such as<br/>- Fantasy: exquisite 3D elfs and fairies are ready for coloring<br/>- Character: dress, relationship, black and Indigenous Aboriginal with gradient color<br/>- Place: countrylife, nature, building and interiors you want to color <br/>- Animal: cute dogs &amp; cats, butterfly and wild animals <br/>- Mandala: classic mandala coloring pages<br/>- Quote: loving messages for you to color and share<br/><br/>It is so convenient to paint without pencil. All of the pictures are free and new artworks for painting by numbers will be updated every day!<br/><br/>Now open the game, just pick one image you like, tap following the numbers of the palette and you will feel relax so much. Share masterpieces with friends and families, enjoy coloring by numbers and beautiful artworks together!<br/><br/>--------------------<br/>Subscription pricing and terms：<br/>In Color Now we offer you the following three subscription options:<br/>1. A weekly subscription costing $4.89 (or equivalent in your currency) per week.<br/>2. A monthly subscription costing $9.99 (or equivalent in your currency) per month.<br/>3. A monthly subscription costing $69.99 (or equivalent in your currency) per year after a 3-day free trial period.<br/>After buying the subscriptions, you will remove the non-optional banner and interstitial adverts from the game. <br/>In addition, you'll get unlimited hints and unlimited buckets, and remove watermarks from all completed pictures.<br/><br/>We are working hard to bring you happy coloring experience. Just enjoy coloring by number.<br/><br/>Terms of Service and Privacy Policy please go to the following link:<br/>Terms of Use:<br/>http://terms.colornow.top/termsofservice.html<br/>Privacy Policy:<br/>http://terms.colornow.top/privacy.html", "metacritic": null, "released": "2022-07-29", "tba": false, "updated": "2022-08-19T09:06:57", "background_image": "https://media.rawg.io/media/screenshots/088/088f7b1b0b64db65d9e3b1b6dffced23.jpg", "website": "http://colornow.top", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["镇毫 陈"], "genres": ["Board Games", "Casual"], "publishers": ["镇毫 陈"], "esrb_rating": "Everyone 10+"}