{"id": 836725, "slug": "doomsday-last-survivors", "name": "Doomsday: Last Survivors", "name_original": "Doomsday: Last Survivors", "description": "Doomsday: Last Survivors is a zombie survival game with multiplayer online competition and real-time strategy elements. Set in a near future where zombies have taken over the world, survivors must fight for their lives and humanity's future. As the Commander, you must lead fellow survivors to build their Shelter, explore fog-filled areas, and fight the zombies and rival factions! Are you tired of the usual strategy games and love zombie games? Check out Doomsday: Last Survivors to experience the exciting survival game!<br/><br/>[Game Highlights]<br/><br/>New Tower Defense Gameplay<br/>Find new ways to beat your enemies in one of the coolest strategy games! Skilled survivors will join you to explore this fallen world oozing with the infected. Stay sharp, set up ideal Hero formations, and construct fortifications to survive the zombie invasion!<br/><br/>Survival of the Fittest<br/>Lead troops and civilians in your Shelter! Exterminate zombies to survive the apocalypse, or raid other Shelters to sustain your own. You can also form an alliance and fight enemies with your allies in one of the best survival games!<br/><br/>A Realistic Doomsday Experience<br/>The crisis continues to loom over us in a cruel world where it's kill or be killed. Want to experience one of the best immersive survival experiences in zombie games? Look no further! Check out the realistic spherical terrain system with convenient zoom controls that enable close-up Shelter views to satellite views. Download Doomsday: Last Survivors today!<br/><br/>Strategic Battles<br/>Become the best at survival games by utilizing everything you can find. Train multiple troop types and execute diverse battle strategies with Hero skills and attacks to outlast the zombie hordes.<br/><br/>Unique Heroes<br/>Realistic and exciting Hero designs portray survivors from different walks of life. Recruit talented Heroes to help lead your troops, defend your Shelter, and beat one of the best strategy games!<br/><br/>Commander, are you ready to survive the apocalypse?<br/>Become the best at zombie games with your strength and wits!", "metacritic": null, "released": "2021-09-15", "tba": false, "updated": "2023-06-30T02:42:15", "background_image": "https://media.rawg.io/media/screenshots/42c/42c0859371f0ead20cb84cb88c404e04_ZSvQcuZ.jpg", "website": "http://www.igg.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 41}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Android", "iOS"], "developers": ["IGG.COM", "IGG SINGAPORE PTE", "SkyRise Digital"], "genres": ["RPG", "Strategy", "Massively Multiplayer"], "publishers": ["IGG SINGAPORE PTE", "SkyRise Digital"], "esrb_rating": null}