{"id": 836765, "slug": "city-of-crime-gang-wars", "name": "City of Crime: Gang Wars", "name_original": "City of Crime: Gang Wars", "description": "An innovative gangster strategy mobile game! <br/>Call up your brothers and experience the thrill of fighting players from all over the world!<br/><br/>Fight in real time and utilize strategies to get the upper-hand!<br/>Clash with enemies for their turf and settle feuds between rivals!<br/>One server for the entire world. Be the best, be the king of the world!<br/><br/>[Game Features]:<br/><br/>■Dope cars, sweet babes, and enough guns to make an army blush■<br/>Experience a realistic underworld life that'll have you clubbing with babes, capturing rival turfs, brawling alongside your brothers, and zooming through the city in a sports car!<br/><br/><br/>■ Build up a high-definition city without restrictions ■<br/>Construct your city however you like! From grand architectures to stunning characters, your city can be the ultimate visual treat in 4K graphics!<br/><br/><br/>■ Real-time battles with emphasis on strategies ■<br/>Engage in real-time street battles as a gangster would! Utilize your Enforcers, Gunners, and Bikers to wipe the floor with your enemies.<br/><br/><br/>■ One world, one server. Who will be the boss of the world? ■<br/>Communicate with players across the world, regardless of ethnicity or language! The most common language in the world is power, and only a powerful person can become the Boss!<br/><br/><br/>■ Real-time AI calculations that simulates a real world ■<br/>Fight for turfs during the day, party at bars and clubs during the night! How you spend your time during each day and night cycle is up to you!<br/><br/><br/>==City of Crime Studio==<br/>[Official Facebook Customer Service]: https://bit.ly/3sc8KWv<br/>[Official Discord Server]: https://discord.com/invite/psWU9baA42<br/><br/>==Terms of Use &amp; Privacy Policy==<br/>[Apple Terms of Use (EULA)]: https://www.apple.com/legal/internet-services/itunes/dev/stdeula/<br/>[Game]: https://coc.fingerfun.com/t2/395/6218.html", "metacritic": null, "released": "2022-04-07", "tba": false, "updated": "2022-08-19T09:51:04", "background_image": "https://media.rawg.io/media/screenshots/20c/20cd696f55cae258fa7d730d5e3e92a6_ms79G10.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FingerTips"], "genres": ["Strategy", "Simulation"], "publishers": ["FingerFun"], "esrb_rating": "Mature"}