{"id": 836721, "slug": "misty-continent", "name": "Misty Continent", "name_original": "Misty Continent", "description": "According to old legends, there are seven secret treasures of the sea gods left in the world. They can either unleash terror or bring infinite power. Any one of these treasures can turn a human into greatness, and the one who collects all seven treasures will rule the seas!<br/><br/>Game Features<br/>◆Explore the Cursed Island! When you are fighting against ghosts and sea monsters for the buried treasures, vicious pirates will watch your every move and strike when you least expect it, so beware!<br/>◆Build up your Stronghold! Gear yourself up for dangerous quests in the mist. During the downtime between exploring and treasure-hunting, join your buddies over for dinner and endless beer and drink merrily until the sun rises!<br/>◆Craft unique Artifacts! Clear all your obstacles by having more treasures and powerful abilities that will aid your treasure hunts<br/>◆Make Friends Around the World! Gather your army and fight alongside your buddies! Be it on land or at sea, no matter how powerful your enemies might be, your friends will be there for you to battle with until the very end.<br/>◆A Wealth of Strategies! A resourceful king knows how to calculate, maneuver, and manipulate in order to stay on top.<br/><br/>SUPPORT<br/><br/>Are you having problems? contact_mc@funplus.com<br/>Privacy Policy: https://mc-private.thecsgame.com/mcgame-privacy-policy.html<br/>Terms of Service: https://mc-private.thecsgame.com/mcgame-terms-of-service.html<br/>Subscription Terms: https://mc-private.thecsgame.com/mc-subscription-term.html<br/><br/>The price of the monthly subscription is $19.99, and lasts for 30 days. After purchasing, players will get exclusive privileges in game.<br/><br/>Please note:<br/><br/>1. Payment will be charged to your iTunes Account at confirmation of purchase<br/><br/>2. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/><br/>3. Your account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/><br/>4. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the your Account Settings after purchase", "metacritic": null, "released": "2022-08-02", "tba": false, "updated": "2022-08-19T09:11:21", "background_image": "https://media.rawg.io/media/screenshots/c66/c66c4060ba84cdcd2307f3547e836ceb_0bESe3B.jpg", "website": "http://mc.kingsgroupgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FunPlus International"], "genres": ["RPG", "Strategy"], "publishers": ["FunPlus International"], "esrb_rating": "Teen"}