{"id": 8367, "slug": "save-the-pencil-hd-join-the-dots-solve-the-puzzle-", "name": "Save The Pencil HD - Join The Dots, Solve The Puzzle, Beat The Game!", "name_original": "Save The Pencil HD - Join The Dots, Solve The Puzzle, Beat The Game!", "description": "A number 1 app in the US, UK, Canada, Australia, Italy and more! Over 7 million happy players and 2.5 billion levels played.<br/><br/>• iMore App of the Week - \"Save the Pencil is adorable and fun. A fantastic puzzle game.\" <br/>• What's On iPhone - \"With its intense but brain-teasing style of gameplay, this game deserves its place as an iPhone classic.\" <br/>• App Gamer - \"A game that will test your brain and dexterity. Its uncluttered graphics and cheery nature help to make this a puzzle you'll be coming back to.\" <br/>• App Addict - \"Cute &amp; Fun.\" <br/>• iPhones.ru - \"The conclusion is simple - if you like puzzles Save the pencil is must buy.\" <br/>• App Advice - \"A good fit for puzzle fans.\" <br/>• Best 10 Apps - \"If you are a puzzle fan, Save The Pencil is your best choice.\"<br/><br/>The world could be about to change. The future of the pencil is in doubt. Your quest, to Save the Pencil, begins here! <br/><br/>\"It's Join The Dots - But Not As You Know It!\" <br/><br/>You are HB; young, sharp and full of lead. A pencil on a mission to join the dots but there’s a rebellion in the stationery cupboard! The paper clips, rulers, erasers and their friends are angry, and they’ll do anything to stop you. Guide HB to safety and collect the bonus stars to unlock more challenging levels! <br/><br/>Each of the 120 levels across 8 different chapters requires skill, logic and speed. Only the most precise tappers will be able to collect three stars on every level! <br/><br/>Can you unlock all of the Game Center achievements? <br/><br/>Save The Pencil Highlights: <br/>• Fun, addictive gameplay with plenty of variety. Tap the dots to move HB safely through each level. <br/>• 120 challenging puzzles across 8 chapters will keep you tapping away. <br/>• 50 additional bonus levels can be unlocked within the game.<br/>• Unlock new characters to play as.<br/>• Collect three stars on every level. Some may be simple, but others are perplexing! <br/>• End of chapter bosses offer a unique challenge. <br/>• Different enemies interact with gameplay in different ways. Dodge paperclips, avoid spinning rulers, race erasers, take cover from firing staplers, escape the scissors and more! <br/>• All your favorite stationery characters in one game!", "metacritic": null, "released": "2012-01-06", "tba": false, "updated": "2019-10-22T14:29:50", "background_image": "https://media.rawg.io/media/screenshots/615/615018465384b45ad033d7a40379caa2.jpeg", "website": "http://www.perfectdimension.com/apps/savethepencil", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Perfect Dimension"], "genres": ["Arcade", "Puzzle"], "publishers": ["Paul Davis"], "esrb_rating": null}