{"id": 83680, "slug": "mechanic-max", "name": "Mechanic Max", "name_original": "Mechanic Max", "description": "Visit the best car service in town - mechanic Max is waiting for you in his new repair shop!<br/><br/>He will help you with repair and car makeover. Your crashed and dirty car will be spick and span again. With plentiful supply, you can change your car into a racing car, taxi, fire engine, ambulance, vintage car, speedy car, family car and worker’s pickup truck. <br/><br/>Park the car in the garage and roll up your shirtsleeves. There's a lot of work to do.<br/><br/>CAR WASH:<br/>You have to clean your dirty car with soap and sponge first. Then you rinse it with a car washer and dry it with a cloth in the end.<br/><br/>WORKSHOP:<br/>Weld sheet metal and fix all scratches, lacerations and dents. Your car has a problem with flat tires, too. Pump them full of air and then also fill up the empty tank with gas like you do at the gas station. Lift the hood and add some motor oil so that the engine will run smoothly while driving. Like a real master, use pneumatic/air bolt removal tool, welder, air compressor and hammer.<br/><br/>TUNE-UP, BODY SHOP:<br/>Give your car a tune-up. Change the wheels, with tires and rims. You can choose tires with usual, old-fashioned or low tread grooves as well as snow or summer pneumatic tires. To get funky hotrod, you can add shiny bumpers, headlights with colorful light bulbs, neon lights under the car, police lights and sirens.<br/> <br/>PAINT SHOP:<br/>Spray or paint different parts of the car. You can use tinted windshields for your car to look even more stylish. In addition, you can add stickers like fire, stripes, numbers, chessboard, bubadu police, or ambulance. For the final touch, polish your car to get a shiny look.<br/><br/>With Max's help, you will pimp your car and drive a safe and good-looking vehicle again.<br/><br/>Features:<br/>• educational game for everyone who loves cars<br/>• 4 workshops with different tools <br/>• a lot of cars, stickers and colors to combine <br/>• have fun painting the car with color sprays<br/>• superb high quality HD graphics<br/>• special sound effects<br/>• simple controls and easy gameplay<br/><br/>FOR PARENTS<br/>This game is free to play but certain in-game items may require payment via in-app purchase. Please check your device settings for more detailed parental options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our sites, apps or third-party sites.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": "2014-12-10", "tba": false, "updated": "2019-10-22T14:22:04", "background_image": "https://media.rawg.io/media/screenshots/135/1358eb9671e2b40bea44010eb397a758_RuQ5psv.jpg", "website": "http://www.bubadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pilcom"], "genres": ["RPG", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": "Everyone 10+"}