{"id": 836998, "slug": "least-toxic-relationship", "name": "Least Toxic Relationship", "name_original": "Least Toxic Relationship", "description": "<p>Rocco blows up his house and needs a new house! He has no money though what will he do!?  Follow Rocco, an evil scientist who's a brony, as he moves into some guy's house, he kills, they date, they're normal together.  Valentino, Rocco's roommate, is just an unsuspecting strawberry farmer who happens to be blinded by hotness and lets Rocco stay in his condo for free; what could come of it?</p>\n\n\n<p>-----------------------</p>\n<p>This game is meant to be a very silly gay visual novel! It doesn't include any heavy topics or tries to send a message. Things are not overly sappy or romantic either as it's meant to more be a comedy that could also be considered a dating sim!</p>\n<p>It has 4 endings. It was made in a little over a month and my very first attempt at making a game :3.</p>\n<p>Content warning for guns and there's a homophobic character that's written over the top  (most of the homophobia's in Italian anyway). There is also some sexual content that isn't overly explicit (only a couple of written lines and some jokes here and there). An obvious warning for death and killing but the topics treated non seriously and theres no intense body horror/gore (most it shows is detached arms)</p><p>Short art book coming soon!</p>\n<p>Made by Mr.Strawb and Gloopburger</p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2022-08-19T11:44:47", "background_image": "https://media.rawg.io/media/screenshots/8ba/8ba03c7578efc3ee0890ac0dec86c75a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Mr.Strawb"], "genres": [], "publishers": [], "esrb_rating": null}