{"id": 836955, "slug": "submerged-soundscape", "name": "Submerged Soundscape", "name_original": "Submerged Soundscape", "description": "<p><strong>DESCRIPTION</strong><br/></p>\n<p>Submerged Soundscape is a virtual reality experience focused on auditory and visual stimulation. It is similar to the Travis Scott concert in Fortnite, Trolls World Tour, and Windows Media Player. Music signals will be processed and converted into visuals such as dancing seaweed and jumping jellyfish. Explore the Submerged Soundscape and enjoy an underwater concert that will entertain with feelings of excitement, relaxation, and synesthesia.</p>\n<p>This prototype only contains 5 songs, though it is capable of playing back any audio file through its visuals.</p>\n<p>Available on PC and VR!<br/>NOTE: VR version only tested on Oculus Rift. Other VR devices may have some compatibility issues.</p>\n<p><strong>CONTROLS<br/></strong><strong>PC<br/></strong>On the title screen, use the mouse to select one of the 5 music genres and click \"Start\" to enter the Submerged Soundscape. Once inside, use the following controls:<br/>Swim Forwards - W<br/>Swim Backwards - S<br/>Swim Left - A<br/>Swim Right - D<br/>Swim Up - Space Bar<br/>Look Around - Mouse<br/>Exit To Menu - ESC</p>\n<p><strong>VR<br/></strong>On the title screen, use either trigger to select one of the 5 music genres and select \"Start\" to enter the Submerged Soundscape. Once inside, use the following controls:</p>\n<p>Movement - Aim your controller in the opposite direction you want to move and press the trigger. Bubbles will boost you in the opposite direction, similar to Iron Man.<br/>Look Around - Use the right thumbstick to move the camera left and right. Otherwise, just move your head.<br/>Exit To Menu - Menu Button (on Oculus Rift). </p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2022-08-19T11:27:14", "background_image": "https://media.rawg.io/media/screenshots/7ef/7ef08cd56890b05463deabb1cf4c4549.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["busHotdog"], "genres": [], "publishers": [], "esrb_rating": null}