{"id": 837040, "slug": "shadow-of-sanara", "name": "Shadow of Sanara", "name_original": "Shadow of Sanara", "description": "<p>In a land far, far away, several generations ago – an ancient now almost forgotten people retreated underground when the sun they worshipped mysteriously went dark. The now sunless world caused big, lurky evil shadow creatures to appear and infest the earth. To free her people, Sanara, the chosen savior of her people must bring the sun fragment that is enclosed within her to the legendary ancient temple on top of the highest mountain to break the endless solar eclipse. </p>\n<p>Play as Sanara, a strong warrior. Armed with her now self-manifested sun shard powers. To her arsenal, she has a flame dash and short bursts of pure unbridled light that shoot from her hands. In the game, solve what is her inner conflict and what is driving her to save her people. What will she do when she reaches the temple? </p>\n<p>Use the power of the light to battle shadow creatures and save your people from an endless darkness in this new action-adventure game focused on timing and intelligent positioning in arenas brimming with exciting strategic combat. </p>\n<p>Explore a desert world that stands between light and shadow and is on the brink of destruction to save your people in... </p>\n<p>SHADOW OF SANARA.</p>\n\n\n<p><strong>The team:</strong><br/>Xylene Alzona Acupan<br/>Tobias Andersson<br/>Joshua Ásberg<br/>Tove Backenroth<br/>William Dandenell Gibello<br/>Mathias Hjelmqvist<br/>Carl Höjdén<br/>Johanna Johansson<br/>Devon Jokic<br/>Nergal Lahdo<br/>Hugo Lindström<br/>Ossian Olausson<br/>Tomas Savela<br/>Salam Shaker</p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2022-08-19T12:02:19", "background_image": "https://media.rawg.io/media/screenshots/b5b/b5b61dd4a6911b15b0fcf927c3862c01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Joshua Ásberg", "Futuregames", "jj0hanna", "backen'", "xerene", "DenGba"], "genres": ["Action"], "publishers": [], "esrb_rating": null}