{"id": 837265, "slug": "pirates-treasure", "name": "Pirate's Treasure", "name_original": "Pirate's Treasure", "description": "<p><em>Pirate's Treasure</em> is a game divided into three levels:</p>\n<p><strong>1. Battle:</strong> Use the arrows to move the pirate and the space bar to see his battle animation. Dodge the cannon bullets for 12 seconds to complete the level.</p>\n<p><strong>2. Minigames:</strong> this level is subdivided into three minigames.</p>\n<p>In the first one, we guide the pirate by using the mouse cursor through the laberynth until you reach the chest. If you touch the walls of the maze, you will be eliminated from the game.</p>\n<p>Collect coins driving the chest to the left and right. When you think you have enough coins, press the \"Finish\" button.</p>\n<p>By answering three pirate riddles you will be part of the guild.</p>\n<p><strong>3. Labyrinth:</strong> run through the maze until you reach the gem to complete the level.</p>\n\r\nThis project was exhibited at the game event <em>Bemyhuman</em>   in Madrid in September 2018. It has been developed by students through  a  subject about game dev, design and robotics. This activity took them   three months; the ages of the students were between 8-12 years old. We   have 15 games of different topics: from pirate riddles to adventures   under the sea, going through fast-paced mazes, and flying pigs.   \r\nWe hope you enjoy our games as much as their creators loved designing them! \r\n \r\n\n<p><em>Pirate's Treasure es un juego dividido en tres niveles:\r\n</em><br/></p>\n<p><em>1. Battle: Usa las flechas para mover al pirata y la barra espaciadora para ver su animación de ataque. Evita los cañonazos durante 12s para completar el nivel.\r\n</em><br/></p>\n<p><em>2. Minigames: este nivel está dividido en tres minijuegos.\r\n</em><br/></p>\n<p><em>- En el primero guiaremos al pirata con el cursor del ratón a través del laberinto hasta llegar al cofre. Si tocas las paredes del laberinto serás eliminado.\r\n</em><br/></p>\n<p><em>- Recoge monedas moviendo el cofre hacia la izquierda y derecha con las flechas. Cuando creas que tienes suficientes monedas pulsa el botón 'Finish'.</em><br/></p>\n<p><em>- Responde a tres acertijos pirata para formar parte del gremio.\r\n</em><br/></p>\n<p><em>3. Labyrinth: Avanza a través del laberinto hasta llegar a la gema y así completar el nivel.\r\n</em></p>\n<p>\n</p>\n<em>Este proyecto fue expuesto en el evento de videojuegos Bemyhuman,  en septiembre de 2018 en Madrid. Ha sido realizado por alumnos de un  colegio, a través de la asignatura de desarrollo de videojuegos, diseño y  robótica. La duración del mismo fue de tres meses y en él participaron  alumnos de 3º a 6º de Educación Primaria. Contamos con 15 juegos de  diversa índole: desde acertijos pirata hasta aventuras bajo el mar,  pasando por trepidantes laberintos y cerdos voladores.</em>\n<em>¡Espero que disfrutéis de nuestros juegos tanto como sus creadores disfrutaron creándolos!</em>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T13:42:24", "background_image": "https://media.rawg.io/media/screenshots/8d6/8d6801298422af469dcd46749926ab83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Isi Cano"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}