{"id": 837270, "slug": "rabbits-vs-pigs", "name": "Rabbits vs Pigs", "name_original": "Rabbits vs Pigs", "description": "<p>Drive the pig to the south by using the arrows and without being touched by the rabbit. If you get it, you will be able to control the previous enemy; this time, the pig will chase you. Press the correct direction key to make the rabbit moves and dodges.<br/></p>\r\nThis project was exhibited at the game event <em>Bemyhuman</em>   in Madrid in September 2018. It has been developed by students through  a  subject about game dev, design and robotics. This activity took them   three months; the ages of the students were between 8-12 years old. We   have 15 games of different topics: from pirate riddles to adventures   under the sea, going through fast-paced mazes, and flying pigs.   \r\nWe hope you enjoy our games as much as their creators loved designing them! \r\n \r\n\n\n<p>Lleva al cerdo hasta el sur ayudándote con las flechas y sin que te toque el conejo. Si lo consigues, te tocará manejar al enemigo anterior y esta vez será el cerdo quien te persiga. Tendrás que pulsar la dirección adecuada para que el conejo se mueva y esquive.<br/> <br/></p>\n<em>Este proyecto fue expuesto en el evento de videojuegos Bemyhuman,  en septiembre de 2018 en Madrid. Ha sido realizado por alumnos de un  colegio, a través de la asignatura de desarrollo de videojuegos, diseño y  robótica. La duración del mismo fue de tres meses y en él participaron  alumnos de 3º a 6º de Educación Primaria. Contamos con 15 juegos de  diversa índole: desde acertijos pirata hasta aventuras bajo el mar,  pasando por trepidantes laberintos y cerdos voladores.</em>\n<em>¡Espero que disfrutéis de nuestros juegos tanto como sus creadores disfrutaron creándolos!</em>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T13:44:58", "background_image": "https://media.rawg.io/media/screenshots/ed3/ed3a9b70de0c750a5f2e179f469431c2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Isi Cano"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}