{"id": 837280, "slug": "the-alien-isi-cano", "name": "The Alien (Isi Cano)", "name_original": "The Alien (Isi Cano)", "description": "<p><em>The Alien</em> is a single player game divided into a tutorial and two levels:\r\n</p>\n<p><strong>Tutorial</strong>: our character follows the mouse pointer and shall collect 10 coins and touch the flag.\r\n</p>\n<p><strong>Level 1: </strong>our character follows the mouse pointer and shall pick up 7 coins and touch the flag.\r\n</p>\n<p><strong>Level 2:</strong> our character follows the mouse pointer and shall collect 4 coins and touch the flag. Dodge the enemy robot's fireball. <br/></p>\r\nThis project was exhibited at the game event <em>Bemyhuman</em>  in Madrid in September 2018. It has been developed by students through a  subject about game dev, design and robotics. This activity took them  three months; the ages of the students were between 8-12 years old. We  have 15 games of different topics: from pirate riddles to adventures  under the sea, going through fast-paced mazes, and flying pigs.\r\n  \r\nWe hope you enjoy our games as much as their creators loved designing them!\r\n\r\n\r\n\r\n<p><em>El Alien es un juego para un jugador y está dividido en un tutorial y dos niveles:\r\n</em><br/></p>\n<p><em>Tutorial: Nuestro personaje sigue el puntero del ratón y deberá recoger 10 monedas y tocar la bandera.\r\n</em><br/></p>\n<p><em>Nivel 1: Nuestro personaje sigue el puntero del ratón y deberá recoger 7 monedas y tocar la bandera. Evita que el pez te toque o perderás.\r\n</em><br/></p>\n<p><em>Nivel 2: Nuestro personaje sigue el puntero del ratón y deberá recoger 4 monedas y tocar la bandera. Evita la bola de fuego que lanza el robot enemigo.\r\n<br/></em></p>\n<em>Este proyecto fue expuesto en el evento de videojuegos Bemyhuman, en septiembre de 2018 en Madrid. Ha sido realizado por alumnos de un colegio, a través de la asignatura de desarrollo de videojuegos, diseño y robótica. La duración del mismo fue de tres meses y en él participaron alumnos de 3º a 6º de Educación Primaria. Contamos con 15 juegos de diversa índole: desde acertijos pirata hasta aventuras bajo el mar, pasando por trepidantes laberintos y cerdos voladores.</em><em>\r\n¡Espero que disfrutéis de nuestros juegos tanto como sus creadores disfrutaron creándolos!\r\n</em>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T13:50:07", "background_image": "https://media.rawg.io/media/screenshots/70b/70b9ec4642578dcbf7fa5dc8c0fd3bc4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Isi Cano"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}