{"id": 837398, "slug": "lost-memories-itch-theyellowpopcorn", "name": "Lost Memories (itch) (TheYellowPoPCorn)", "name_original": "Lost Memories (itch) (TheYellowPoPCorn)", "description": "<p><strong>GAME SYNOPSIS</strong></p>\n<p>(EN)<br/></p>\n<p>One day, a prince and a princess lived as usual. With its prosperous and peaceful people. And once at night. The prince woke up and saw the princess who had disappeared somewhere. After a few days the news of the princess's disappearance was announced, suddenly there was a mysterious man who was dressed in a closed suit and confronted the prince. And told the prince that the princess had been kidnapped by the Azure Order. The mysterious person helped open the portal to the Azure Realm. Can the prince save the princess?</p>\n<p>(ID)<br/></p>\n<p>Pada suatu hari, seorang pangeran dan seorang putri hidup seperti biasanya. Dengan rakyat nya yang makmur dan sentosa. Dan suatu ketika pada malam hari. Sang pangeran terbangun dan melihat sang putri yang sudah hilang entah kemana. Setelah, beberapa hari diumumkan kabar hilangnya sang putri, tiba-tiba ada seorang misterius yang berpakaian tertutup dan berhadapan dengan sang pangeran. Dan memberitahu sang pangeran bahwa sang putri telah diculik oleh Azure Order. Seorang misterius itu membantu membukakan portal menuju Azure Realm. Bisakah sang pangeran menyelamatkan sang putri?</p>\n<p>(Note: The story language is in Indonesian, but the game language is in English for some reason.)<br/></p><p>(Note 2: Loading taaakeesss too long, about 5+ mins. You can wait or just download the game.)</p>\n<p>Download the game via | Google Drive |</p>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T14:40:16", "background_image": "https://media.rawg.io/media/screenshots/9cc/9cc7abf34d7e4602efcf190b792a60be.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TheYellowPoPCorn"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}