{"id": 83734, "slug": "pets-birthday-party", "name": "Pet's Birthday Party", "name_original": "Pet's Birthday Party", "description": "Your pet celebrates its birthday party! You have a duty to plan puppy's, kitty's or bunny's unforgettable surprise show from the beginning to the end. Bake a delicious birthday cake, decorate a room, take care of your pet, dress it and organize a celebration. This is the coolest way to plan a birthday party.<br/><br/>First, make a yummy cake for the birthday pet and its hairy friends! <br/>Choose a cake shape with a tasteful dough. Pour sweet dressings with different flavors over the cake and add some colorful decorations and candles. Mmm, this will be a really savory bite.<br/><br/>Birthday decorations can make parties even more festive!<br/>You can draw or write something on a poster for your pet and also decorate a room with hanging garlands. Prepare a snack, drinks and sweet cupcakes to make pet's birthday really special.<br/><br/>Pets want to look fabulous on this special day!<br/>Tap all colorful fleas in a mini game, then brush pet's fur and dye some of the hair. You can choose between 5 vivid colors. For the final touch, perfume the little pet with its favorite fragrance.<br/><br/>Design an outstanding outfit for the party time!<br/>Choose from a selection of fun and colorful headgears, birthday hats, glasses, collars and other accessories to dress up the birthday pet.<br/><br/>Now, it's time to party!<br/>Your pet should make a wish before you blow out all the birthday candles. Every kid, adult, or even pet loves to receive a birthday present. Open a gift box and catch as many items as possible: balls of wool, bones or carrots. For more fun, pull strings of helium balloons and pop all the balloons. Take a group photo and sing the Happy Birthday song with your pet and lovely friends. <br/><br/>This will be a birthday party to remember!<br/><br/>Features:<br/>• 6 cute pets (cats, dogs and rabbits)<br/>• attractive colors and superb HD illustrations<br/>• play different mini games<br/>• tons of birthday accessories<br/>• a lot of cake shapes, dressings, decorations and candles to combine<br/>• birthday party planning ideas<br/>• smooth gameplay", "metacritic": null, "released": "2015-02-14", "tba": false, "updated": "2019-10-22T14:08:06", "background_image": "https://media.rawg.io/media/screenshots/221/221a960ba572b680fa3eaa6f194ed51d_KmrQUep.jpg", "website": "http://www.bubadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pilcom"], "genres": ["Simulation", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": "Everyone 10+"}