{"id": 837377, "slug": "abratabia", "name": "AbraTabia", "name_original": "AbraTabia", "description": "<p>AbraTabia is a 2-4 player turn based game, inspired by chess with similar but different movement rules. The addition of spells allows each player to cast 1 spell per turn, as well as move one piece. Each of your 16 pieces have health, damage and other statistics that modify how they fight against other pieces.</p>\n<p>It’s Not Chess … It’s AbraTabia! A chess player will feel familiar with the game at the start but it is not the same game. Really, not at all. You win the game by defeating the enemy king(s), move chess pieces around a chess board turn by turn, but after that you are in a very different world.\r\n</p>\n<p>Combat is much different than chess as each piece has health, and can survive multiple attacks before you lose that piece. Whenever a piece is attacked, it will Counter Attack the enemy piece that attacked it. Multiple piece attacks are also possible. Should you run? Should you make one last stand? There are many short term decisions while still playing a long term strategy.\r\n</p>\n<p>Spells create unique game play allowing for special abilities to affect game play significantly. Timing when to use each spell is the biggest part of game play strategy. Spells include various Healing and Damage spells, Sacrifice, Teleport, Swap Positions, Stealth and spells to allow extra movement. Spells can be changed or modified by talent points.\r\n</p>\n<p>AbraTabia is free to play so give it a try today. Most players understand the game within a couple of matches. As you level up you will see more and more different options and strategies to win. Do you have what it takes to become an AbraTabia Grand Master?\r\n</p>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T14:30:39", "background_image": "https://media.rawg.io/media/screenshots/f0d/f0dbfeadccbe00db529aab030caf06b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AbraTabia"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}