{"id": 837382, "slug": "the-beginning-of-rocky-and-icy-days", "name": "The Beginning of Rocky and Icy Days", "name_original": "The Beginning of Rocky and Icy Days", "description": "<p><strong>Overview: </strong></p>\n<p>The Beginning of Rocky and Icy Days (Project TBORAID) follows the story of Eryx. He’s been enjoying his peaceful days until a stranger appears. Eryx needs to step forward to protect his home island from this invasion. Will he be able to take back his home island or lose it forever? Your action will answer this question. </p>\n<p>The game brings you a relaxing RPG experience with simple strategic gameplay. It features:</p>\n<ul><li><strong>Fantasy world of rock and ice:</strong> Everything in this game is made of either rock or ice or both. Character abilities also require these resources to perform. The game time is represented in terms of day with simple day/night cycle to enhance the world liveliness.\r\n</li></ul>\n\n\n<ul><li><strong>Original pixel art:</strong> The game art is originally designed and beautifully rendered by Unity Universal Rendering Pipeline. \r\n</li></ul>\n\n<ul><li><strong>High quality music and sound effects:</strong> Music and sound effects are carefully chosen to fit the game theme. \r\n</li><li><strong>Intuitive RPG’s UI design with easy-to-follow game guides:</strong> UI is designed around the main components of the game, and provides you with enough game information in order to progress. Game guides are displayed and/or hinted as the game progresses to show you helpful messages at different points in the game.\r\n</li></ul>\n\n<ul><li><strong>Innovative take on familiar RPG mechanics: </strong>Some common RPG systems are redesigned to fit the game theme and scope such as turn-based battle system and character progression. \r\n</li></ul>\n\n\n<p><strong> </strong><strong><strong>Q&amp;A with the developer, HaN: </strong></strong></p>\n<p><strong>1. Q: What’s the purpose of this section?</strong></p>\n<p>A: This section presents some information about my game development process. It serves as a way for me to document my process as well as communicating with players about the game. </p>\n\n<p><strong>2. Q: How long does it take to develop this game?</strong></p>\n<p>A: It takes me about 2 weeks to develop this game independently, which includes designing the game, making art assets and coding. </p>\n<p><strong>3. </strong><strong>Q: How did this project start?</strong></p>\n<p>A: This project started as a way for me to test my skills and to prepare for a bigger project. </p>\n<p><strong>4. </strong><strong>Q: What does this game mean to you?</strong></p>\n<p>A: Comparing to other RPGs, this is not a big game. It has only one main quest. The total gameplay time can be about 30 minutes or less. However, to develop this within 2 weeks, it takes me years of experience and hard work. This project is special comparing to my other projects, because this time, I want to do it the right way from a single line of code to a game system, and I really enjoy the process. </p>\n<p><strong>5. Q: Is there anything you want to tell players before playing this game?</strong></p>\n<p>A: Relax and enjoy the game. I playtested the game as I developed it, so everything should work as expected if you don’t intentionally break the game haha.</p>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T14:33:18", "background_image": "https://media.rawg.io/media/screenshots/6a5/6a505e0cca22e2d9a3550f44c96108a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Over-Dramatics"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}