{"id": 837484, "slug": "winters-ankh", "name": "Winter's Ankh", "name_original": "Winter's Ankh", "description": "An rpg from Marix about humanity's struggles on the continent against previously unseen influences. Aliens and demons are seen about the continent for<br/>the first time. Inter-dimensional factions make influence plays on the continent,  you lived in your small town that is distant from efects fo any of the endless<br/>conflicts of the multiverse. What secret does your bloodline magics hold ? Collect the fragments of a once powerful book and find out.<br/><br/><br/><br/><br/><br/> It includes:<br/><br/>  * Numerous storylines besides the main story.<br/><br/>  * Extensive Kingdom building and faction management,  upgrade your stronghold<br/><br/>  * Recruitable npcs, party members<br/><br/>  * Romance and many quests<br/><br/>  * Interactive dynamic events, crafting &amp; alchemy<br/><br/>  * a Classic Rpg experience, heavy on the story and text<br/><br/> *  uses rpg maker interface and engine, however maps are boosted with parallax mapping<br/><br/><br/><br/>- version 1.1  is relatively bug free. If you find any major bugs, send me the (save file). Only windows version is tested and bugs ironed out, others aren't,  i've no idea if the game will even start at a Mac (or a chromium browser) or if it works perfect.<br/><br/>-<br/><br/>Not really any mature elements, however it has descriptions of  violence and coarse language as well as emotional contexts  so don't let your kid play this game unsupervised.<br/><br/>An expansion and sequels are on the works.  (if there's any interest)", "metacritic": null, "released": "2022-08-10", "tba": false, "updated": "2022-09-09T06:17:43", "background_image": "https://media.rawg.io/media/screenshots/b07/b07518a0f83e6cd84caca1acbb951092.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC", "Android"], "developers": ["mMarix", "Marix"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Simulation", "Indie"], "publishers": ["Marix"], "esrb_rating": null}