{"id": 83741, "slug": "flight-theory", "name": "Flight Theory", "name_original": "Flight Theory", "description": "Fly over mountains, valleys, waterfalls, canyons, and caverns. Land your plane on aircraft carriers, airfields, and airports. Soar over the ranges, or dodge trees on the deck. Unlock new airfields, aircraft, missions and challenges!<br/><br/>Flight Theory is a flight simulator that focuses on realism and fun. Tilt your device to control the airplane. Drag your finger across the screen to look around and take in the sights.<br/><br/>Perform a perfect landing and top the leader board or just fly around for fun!<br/><br/>Features:<br/><br/>- Virtual 3D cockpits.<br/>- Dynamic skies. Choose your favorite time to fly - early morning, evening, or night? Choose a random time and watch the sun and moon cross the sky as you fly.<br/>- Land on aircraft carriers and airfields. <br/>- Detailed 3D terrain. Soar over mountains, valleys, trees, and rivers.<br/>- Unlockable airfields and missions. Completing one mission unlocks the next in the series. Each mission can be replayed with random start and end locations. <br/>- Online leaderboards and achievements. Each landing is scored by a number of factors. Line up perfectly, land gently, and you'll be rewarded with a great score!<br/>- Focus on realism and fun. Flight Theory simulates stalls, lift, drag, flaps, and more. <br/>- Free Flight mode. <br/>- World War 1 / World War 2 era aircraft and more.<br/><br/>Flight Theory is a simulator in continuous development. Please send any suggestions for improvements, new planes, or features you’d like to see in future updates.<br/><br/>Fasten your seat belt and put tray tables in their upright position. Flight Theory is quite a ride. Take off today!", "metacritic": null, "released": "2013-07-12", "tba": false, "updated": "2019-10-22T14:22:04", "background_image": "https://media.rawg.io/media/screenshots/99e/99ed79b8302b369141f63fe8a80b29ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jason Allen"], "genres": ["Simulation", "Family"], "publishers": ["Jason Allen"], "esrb_rating": "Everyone 10+"}