{"id": 837419, "slug": "call-of-urashima-taro", "name": "Call of Urashima Taro", "name_original": "Call of Urashima Taro", "description": "<p><strong>[PT-BR]<br/></strong></p>\n\n<p><strong>História</strong>\n</p>\n<p>Um dia, o pescador Urashima Taro encontra uma tartaruga capturada por algumas crianças malcriadas. Por pena, ele compra e envia de volta ao mar. Três dias depois, a tartaruga o revisita e o convida para o Palácio do Dragão no fundo do mar, pois a tartaruga não é outra senão Otohime, a Princesa do Mar. \r\n</p>\n<p>Ela se revela uma donzela linda e, naturalmente, Urashima se apaixona por ela. Eles logo se casam e vivem felizes no palácio por algum tempo, até Urashima se lembrar da vida no chão e decide visitar sua casa para contar aos outros sobre seu paradeiro. \r\n</p>\n<p>Sabendo que ela não pode detê-lo, a princesa suspira, mas não diz nada. Em vez disso, ela entrega a Urashima uma caixa de jóias, proibindo-o de abri-la. Urashima acha a vila totalmente irreconhecível - acontece que ele se foi há centenas de anos, e seu nome é apenas uma lenda local. Chocado, ele distraidamente abre a caixa. À medida que uma fina faixa de fumaça sobe lentamente, Urashima envelhece e cai em pó. \r\n</p>\n<p>Porém sua alma fica presa no mundo. Tornando um Onryo (fantasma vingativo). Buscando eternamente uma forma de retornar. Se apossando de uma casca (ocupando o corpo de um ser humano). Porém até agora nenhuma casca aguentou ser o recipiente do mesmo, até agora.\r\n</p>\n<p><strong>Jogabilidade</strong>\n</p>\n<p>Jogo de terror com narrativa e puzzles:\r\n</p>\n<ul><li>Colete itens para conseguir sobreviver;\r\n</li><li>Derrote inimigos;\r\n</li><li>Descubra a história por trás do mistério;\r\n</li><li>Singleplayer.</li></ul>\n<p><strong>[EN-US]</strong>\n</p>\n\n<p><strong>Story</strong>\n</p>\n<p>One day, fisherman Urashima Taro finds a turtle captured by some naughty children. Out of pity, he buys it and sends it back to sea. Three days later, the turtle revisits him and invites him to the Dragon Palace at the bottom of the sea, as the turtle is none other than Otohime, the Princess of the Sea.\r\n</p>\n<p>She turns out to be a beautiful maiden and, naturally, Urashima falls in love with her. They soon marry and live happily in the palace for some time, until Urashima remembers life on the ground and decides to visit his home to tell others about his whereabouts.\r\n</p>\n<p>Knowing she can't stop him, the princess sighs but says nothing. Instead, she hands Urashima a jewelry box, forbidding him to open it. Urashima finds the village utterly unrecognizable—it turns out he's been gone for hundreds of years, and his name is just a local legend. Shocked, he absently opens the box. As a thin band of smoke slowly rises, Urashima ages and falls to dust.\r\n</p>\n<p>But his soul is trapped in the world. Becoming an Onryo (a vengeful ghost). Eternally looking for a way to return. Taking possession of a shell (occupying the body of a human being). But so far, no bark has been able to be its recipient, until now.\r\n</p>\n<p><strong>Gameplay</strong>\n</p>\n<p>Horror game with narrative and puzzles:\r\n</p>\n<ul><li>Collect items to survive;\r\n</li><li>Defeat enemies;\r\n</li><li>Discover the story behind the mystery;\r\n</li><li>Singleplayer.</li></ul>\n<p><strong>Controls</strong></p>\n\n<p><strong>Team</strong>\n</p>\n<ul><li>Jhonatas Paolozza - Coordinator;\r\n</li><li>Herbert Heinz - 2D Artist, Game Design, Screenplay and History.;\r\n</li><li>Kaito Hayashi - 2D Artist and Programmer;\r\n</li><li>Bernardo T. - 2D Artist;<br/>\n</li><li>Julia Frare - 2D Artist;<br/>\n</li><li>Thales Novelli - Sounds and effects;\r\n</li><li>Alexandre Martins - Programmer;\r\n</li><li>Tyago Yuji Teoi - Programmer;</li><li>Paolo Victor - Programmer and Game Design;<br/>\n</li><li>Rodrigo Lima - Programmer.</li></ul>\n<p><strong>Assets Fonts </strong>\n</p>\n<ul><li>Font Kenney Mini - Kenney.</li><li>Font Who Asks Satan - Dafont.</li></ul>\n<p><strong>Installation instructions</strong>\n</p>\n<ol><li>Download the game;\r\n</li><li>Extract the folder from the downloaded file;\r\n</li><li>Open the extracted folder and click on the executable \"Urashima Taro.exe\" and play.</li></ol>\r\n\r\nThales Novelli · Call of Urashima Taro OST", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-08-19T14:50:40", "background_image": "https://media.rawg.io/media/screenshots/f91/f915ee2eb9d20cd6275c8361787cd290.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["PaoloHitoshi", "Fellowship of the Game", "Jhonatas Paolozza", "RodrigoFLima", "ochafore", "Bernardo_T", "juliafrare", "Novelli", "Alexandre", "Herbert Heinz"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}