{"id": 837698, "slug": "real-taxi-driver", "name": "REAL TAXI DRIVER", "name_original": "REAL TAXI DRIVER", "description": "<p>Have you ever dreamt of being a real taxi driver? Now you have a chance to start the Real Taxi Driver - Car Racing game and control a taxi car. If you like railroad, train simulator, bus simulator, car driving school or parking games where you have to transport passengers, you will enjoy this game.</p>\n\n<p><strong>NOW TAXI CAR RACING GAME WILL LET YOU</strong></p>\n<p>* become car racer and highway driver and make a great career;</p>\n<p>* choose one drag racing car and go to the ride;</p>\n<p>* Discover the city, transport passengers, this is a real highway driving simulator;</p>\n<p>* learn how to drive a taxi car in real driving school game.</p>\n<p>No doubt that it is one of the most amazing drag racing, driving simulator and parking games with an opportunity to choose a taxi car and feel like a real racer. This one of the real car racing games is a perfect opportunity to explore the city. Play one of the greatest car racing apps.</p>\n<p><strong>ONE OF DRIVING SCHOOL APPS WITH TAXI CAR DRIVER CAREER</strong></p>\n<p>In this driving simulator you can upgrade your car driver. Become the greatest passenger taxi car racer in this drag racing game Real Taxi Driver - Car Racing.</p>\n<p><strong>HOW TO OPERATE IN THIS TAXI CAR RACING GAME</strong></p>\n<p>* Choose a taxi car in drift racing;</p>\n<p>* Start the drag race;</p>\n<p>* You can speed up/slow down in this driving school simulator;</p>\n<p>* Track the number of passengers: deliver as many as you can;</p>\n<p>* Track your speed - become a real taxi driver;</p>\n<p>* Be careful and try to avoid accidents;</p>\n<p>* Drive a real taxi car in city driving school and parking game.</p>\n<p>Follow a map and transport passengers with Real Taxi Driver - Car Racing.</p>\n<p>In this one of the realistic car driving simulator you have to be very careful to avoid car accidents. Drive and watch the speed limit and city map with this drift racing game.</p>\n<p>Real Taxi Driver - Car Racing key features:</p>\n<p>1) Breathtaking car racing game new for exploring city;</p>\n<p>2) Passenger transporting simulator with a chance to be a real highway driver;</p>\n<p>3) City map and lots routes to explore with drift racing game;</p>\n<p>4) Greatest of driving school games;</p>\n<p>5) Opportunity to control a high-speed taxi car.</p>\n<p>6) Start the race.</p>\n<p>7) One of the best car driving simulator.</p>\n<p>For all lovers of bus simulators or train driver games! You can learn to drive a real taxi car in driving school. Enjoy the renovated, reinvented Real Taxi Driver - Car Racing with its new driving cars, city map with routes and possibilities - one of the best driving simulator and parking game! Start the race right now!</p>", "metacritic": null, "released": "2022-08-16", "tba": false, "updated": "2022-08-19T16:42:08", "background_image": "https://media.rawg.io/media/screenshots/296/296b87246d0fe12cd074ca80d1c69cf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["YELENA STARILOVA"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}