{"id": 837829, "slug": "the-guardian-of-knowledge-el-protector-del-conoc-2", "name": "The Guardian of Knowledge // El Protector del Conocimiento (Desktop version)", "name_original": "The Guardian of Knowledge // El Protector del Conocimiento (Desktop version)", "description": "<p><strong><em>[This is the Trial Version. If the game shows an error in this format, please go to \"Download only\" one]</em></strong></p>\n\n<p>The Omyouyu Library of Mystic Arts is in danger! Only you, its beloved and loyal Guardian, can prevent it. Protect it from the dangers that lurk there by rescuing the books that are in danger of extinction...Although doing so will have its \"peculiar\" consequence... why? Well, let's just say that this will not sit well with the fearsome invader and its power will increase every time you regain consciousness in front of its jaws...</p>\n<p>You are the protector of a millenary library whose valuable knowledge is about to be extinguished forever because of a terrible evil, the Dark Mist, which is corrupting it. As Guardian, your duty is to safeguard the knowledge, absorbing the books/tokens throughout the stage while the Dark Mist relentlessly tries to destroy you.</p>\n<p>                                                                                ------------</p>\n<p>¡La Biblioteca de las artes místicas Omyouyu está en peligro! Sólo tú, su querido y leal Guardián, lo podrá evitar. Protégela de los peligros que la acechan rescatando los libros que están en peligro de extinción…Aunque hacerlo tendrá su “peculiar” consecuencia… ¿por qué? Bueno digamos que esto no sentará del todo bien al temible invasor y su poder aumentará cada que vez que recuperes el conocimiento ante sus fauces…</p>\n<p>Eres el protector de una milenaria biblioteca cuyo valioso conocimiento está a punto de extinguirse para siempre por culpa de un terrible mal, la Bruma Oscura, que la está corrompiendo. Como Guardián, tu deber es salvaguardar los conocimientos, absorbiendo los libros/tomos que hay a lo largo del escenario mientras que la Bruma Oscura intenta destruirte sin descanso.</p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T17:37:02", "background_image": "https://media.rawg.io/media/screenshots/dad/daded0cf702ccd90b44430a41899aa7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AlexM1313"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}