{"id": 83809, "slug": "pizza-maker-deluxe", "name": "Pizza Maker Deluxe", "name_original": "Pizza Maker Deluxe", "description": "Make a delicious pizza, bake it in the oven and have a lot of FUN slicing it!<br/><br/>Create your own delicious pizza and make this a mouth-watering experience. Unleash your creativity - choose from a huge selection of ingredients and create the kind of pizza you like. <br/><br/>When the pizza looks just the way you want, it’s time to bake it. Put it in the oven and watch it as the crust becomes brown, see how the cheese melts and all other ingredients cook to perfection. When the pizza is done, serve it on a plate and eat it. Delicious! <br/><br/>You can also enjoy playing with toys, or take up the challenge of a pizza ninja slice, or play a slide puzzle mini-game.<br/><br/>Features:<br/>• beautiful high quality HD graphics<br/>• intuitive, easy to use interface <br/>• infinite gameplay with unlimited combinations<br/>• animated scenes for making, baking and eating pizza<br/>• different pizza shapes, sauces and cheese types<br/>• huge selection of ingredients such as meat, seafood, vegetables, herbs and spices, fruits, ketchup, candies and even toys<br/>• slide puzzle minigame<br/>• pizza ninja slice minigame<br/><br/>FOR PARENTS<br/>This game is free to play but certain in-game items may require payment via in-app purchase. Please check your device settings for more detailed parental options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our sites, apps or third-party sites.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": "2013-02-08", "tba": false, "updated": "2019-10-22T14:09:26", "background_image": "https://media.rawg.io/media/screenshots/9a9/9a93135548b2f76c2fb81a74db2cf49e.jpg", "website": "http://www.bubadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pilcom"], "genres": ["Simulation", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": "Everyone 10+"}