{"id": 838099, "slug": "rosa-of-the-dead", "name": "Rosa of the Dead", "name_original": "Rosa of the Dead", "description": "ROSA OF THE DEAD\r\n<p>  <em><strong>Rosa of the Dead </strong></em>is an intense player-defense action-survival game where your hand crafted machines are the only thing standing between you and certain death. </p>\n\n<p>  Made in less than 72 hours for the Wowie Jam 4.0, themed <strong>Collaborate with AI</strong>, <em>Rosa of the Dead </em>puts players in the shoes of <strong>Rosa Sky</strong>, a lonesome mechanic tasked with defending the Earth against undead hordes from the underground in this wacky \"<em>20 Minutes Till Dawn</em> meets <em>Pikmin</em>\" adventure.</p>\n\r\nCREATE.\r\n\n<p>   Build your own army of mechanical soldiers to aid you in your quest for survival and cut through the undead masses with dozens of possible Robot combinations, from fast-firing stationary machine guns to mobile grenade launcher turrets.</p>\n<p>  Every robot can be fully customized with up to three different (or repeating) Turret Types, multiple movement options and tons of distinct behaviours. Want a full unit of agressive, fast-moving heavy cannons? Sure. A stationary, lone sniper robot that always targets the furthest enemy away? Go right ahead. A three-storey high bot with multiple different turrets, each one of them aiming at a different type of enemy? We've got your back.</p>\n<p>  With this much variety, <em>Rosa of the Dead</em> allows you to experiment, strategize and play it your way with hundreds of possible viable builds - and even some game-breaking ones.<br/><br/></p>\r\nADAPT.\r\n\n<p>  Customize Turret Targeting and Robot Behavior on the fly, improvising and adapting to the situation at hand. With multiple options to choose from at all times, making a sudden change of plans at a whim has never been so easy.</p>\n<p>  Simply right-clicking any Robot will allow you to alter the way they work from any distance, even while you're still moving. If you don't like how you set it up, change it up!<br/><br/></p>\r\nSURVIVE.\r\n\n<p>  Strategy takes you nowhere if you're not fast enough to make it happen: once the dead start coming, they don't stop coming - and if you're not prepared to quickly clear the screen once things get hectic, you'll soon be overwhelmed.</p>\n<p>  Every few seconds, a new wave of enemies invades your homeland. Increasingly stronger, increasingly faster, in increasingly higher numbers. Strategy is imperative, but speed is key. Your reflexes will be tested at all times: quickly choose the parts and build the robots, run and swerve to avoid direct contact with the creatures, and make lightning-fast decisions at every second.</p>\n<p>  Do you have what it takes to survive the full 10 minutes until dusk, or shall the night sky find you six feet under?</p>\n\n<em>\"Ok let's go for something simple this time\"<br/>- everyone, before doing the exact opposite<br/></em>\n<em>\"Oh wow, it actually looks like a real game!\"</em><br/><em>- us</em>\n<em>\"I'm really proud of the explosion animation\"<br/>- guy who spent an unreasonable amount of time doing the explosion animation</em>\n\n\n\n\r\nScreen Tears Team\r\n\r\nJustTheDani\r\nArt / Music / Sound Effects / Game Design\r\n<p>LinkTree: linktr.ee/justthedani\r\n<br/>\r\nitch.io: justthedanii.itch.io\r\n<br/>\r\nSpotify: sptfy.com/KL5N</p>\n\r\nLuca Boechat Marcílio\r\nArt / Visual Effects / Game Design / Level Design\r\n<p>LinkTree: linktr.ee/lucaboechat\r\n<br/>\r\nitch.io: boecharts.itch.io\r\n<br/>\r\nTwitter: twitter.com/LucaBoechat</p>\n\r\nMason Smart\r\nCode / Game Design\r\n<p>LinkTree: linktr.ee/everyth1ngninja\r\n<br/>\r\nitch.io: everyth1ngninja.itch.io\r\n</p>\n\n\n\n<p>Full soundtrack coming to Spotify soon!<br/></p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T19:19:00", "background_image": "https://media.rawg.io/media/screenshots/f87/f873cf0875c5aa106091184423e216e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boecharts", "just the dani", "Everyth1ngNinja"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}