{"id": 838094, "slug": "impulse-itch-vikkever", "name": "Impulse (itch) (VikKever)", "name_original": "Impulse (itch) (VikKever)", "description": "<p>Game made for Wowie Game Jam 4.0, with the theme 'Collaborating with AI'.</p>\n<p>This is <strong>Impulse</strong>, a game where you work together with a stubborn robot. Unfortunately there are some problems with our robotic friend. He runs out of power rather fast and can't think on its own. So it's your job to give him instructions and collect power. As mentioned before, he is stubborn, so you can expect some impatient and unexpected behaviour.</p>\n<p><strong>How to play:</strong> <br/>After you pressed play (and heard the tutorial), you can type commands to the robot in the screen on top. The commands you can use are:<br/><br/>- forward (move a step forward) <br/>- left (turn left)<br/> - right (turn right)<br/><br/>If you want to execute the same command multiple times add a space and the number of times you want to execute that command after the instruction itself (for example 'forward 3' to move forward 3 steps). When you take more steps than necessary to reach your goal, you will aggravate the robot. This will result in him taking steps on its own that you don't want him to do. He will also say increasingly mean things to you. <br/>In the top left, you can see the power meter which slowly decreases over time (depending on your difficulty). When this meter gets empty you lose the game. If you run over a power symbol, you pick it up and the meter increases again. Your job is to collect as many power symbols as you can before the meter runs out.</p>\n<p><strong>The team:</strong> <br/>Programming: Viktor Cloes <br/>Art: Louis Van Looy, Thibeau De Ryck &amp; Lien Janssens <br/>Sounds &amp; voicelines: Thibeau De Ryck</p>\n<p>We are four people from 16 to 18 years old who live in Belgium. This was the first game jam we ever participated in, and for most of us even the first game we ever worked on.</p>\n<p>\"I didn't know anything about pixel art before this. I still don't, but it was a special experience nontheless\" - Louis</p>\n<p>Thank you for playing our game :)</p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T19:17:16", "background_image": "https://media.rawg.io/media/screenshots/bf7/bf7ec5047f5635a7207ee8f5355e237e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["VikKever"], "genres": [], "publishers": [], "esrb_rating": null}