{"id": 838127, "slug": "boo-by-traps", "name": "BOO-by Traps", "name_original": "BOO-by Traps", "description": "<p>BOO!</p>\n<p>You're a ghost tasked with rescuing an AI controlled human from falling to various traps. Spook him away from the traps to reroute his pathfinding in order to escape alive. Solve the 12 levels in this light puzzle game, and try to collect the sweet placed within each level.</p>\n<p>I'd recommend playing this game with a controller, you can play it fine with a mouse and keyboard, but it just feels better with a controller.</p>\n\n<p>This was a game made for the WOWIE 4 Game Jam by just me. The theme was \"Collaborating with an AI\", which I initially thought would be quite difficult, because no matter what you pretty much have to program an AI. However, that's before I'd used the Unity Navmesh system, honestly, it was probably the quickest part of this game jam.</p>\n<p>I wish I could say the same about the sound and art... I really struggled with a few of the  models redoing them like 3 or 4 times from scratch. But the real kicker was the sound and music, I kept trying to do it and failing before just postponing it. It was pretty much the last thing I did in the end which is why there is no music and all of the sounds are just me panicking while talking into my mic.</p>\n<p>Nonetheless, I'm quite happy with this game, since it's quite different from what I usually make, so I learnt absolutely TONS.</p>\n<p>Please leave me any feedback you have, or what your thoughts are on the game, I really enjoyed making it and I'd like to do a similar thing in one of my next game jams.</p>\n<p>Thank you for playing!</p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T19:27:51", "background_image": "https://media.rawg.io/media/screenshots/2c1/2c12affebf9c0118d5f2b3cd2e702b0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Anogrm"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}