{"id": 838214, "slug": "semi-automated-shipping-company", "name": "Semi-Automated Shipping Company", "name_original": "Semi-Automated Shipping Company", "description": "<p><strong>(Note: Web version seems to have a much higher sensitivity than the downloadable builds. Be sure to adjust the sensitivity with the up/down arrow keys until it feels comfortable to play.)</strong><br/></p>\n<p>Welcome to your first day on the job here at Semi-Automated Shipping Co.! We ship all manner of crates and cargoes to and from every corner of the globe, and it's all thanks to our proprietary Robot Buddy Companion™s who do all the heavy lifting!</p>\n<p>But as an employee at S.A. Shipping Co., you will need to know how to program these robot buddies for any task. That's why we're putting you through this mandatory Robot Buddy Training Course™ - if you don't fall in the lava or get trapped behind a door, you'll come out of it as a fully-functional Semi-Automatic employee!</p>\n<p><strong>Controls:</strong><br/>WASD - Move<br/>R - Restart Level<br/>Left click on robot to open code editor<br/>Up/down arrows - adjust sensitivity</p>\n<p>Made for Wowie Jam 4.0<br/></p>\n<p>Music generated by soundraw.io</p><p>Sound effects from Sony sound effects library (2004)<br/></p>\n<p>Project source: https://github.com/kypello/RobotCoding<br/></p>\n<p><strong>Known glitches:<br/></strong>-Break and continue statements don't work correctly when placed inside if/else statements, which makes them effectively useless<br/>-The letter R cannot be typed into comments because it causes the level to reset<br/>-The robot can push you through a wall which makes you fall into the void<br/></p>\n<p>Please let me know if you find any glitches not listed here!<br/></p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T19:57:18", "background_image": "https://media.rawg.io/media/screenshots/a07/a077a4580bddc51c2dafcf9df7413dfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["kypello"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}