{"id": 838216, "slug": "beta-altale-i-mystery-of-the-kalmahalla-temple", "name": "[Beta] Altale I: Mystery of The Kalmahalla Temple", "name_original": "[Beta] Altale I: Mystery of The Kalmahalla Temple", "description": "<p><em>The game is in beta. It's playable from start to finish, but sometimes there are bugs and things that doesn't look as good as they should've looked ;)</em></p>\n<p><strong>What's currently done:</strong></p>\n<ul><li>The entire gameplay system: magic, exploring, talking, and more!</li><li>Level design! Secrets you can explore, items you can snatch, and lore you can learn about! :D</li><li>Tutorials! It tells allllll you need to know about the game, and it's accessible from menu!</li><li>All the secret bosses! Loot, lore pieces, mechanics ;)</li><li>The story! Last chapter is in beta, but it's playable from start to finish.<br/>\n</li><li>The ending! It's kinda rough currently, but if you're interested, do check it out! It lacks a couple of CGs for stronger punch though (: <em>(But if you want to see it in the intended way,  don't go past when Narrator adds a button to the main screen in the 3rd chapter!)</em></li></ul>\n<p><strong>What isn't done:</strong></p>\n<ul><li>Bug fixes, polish. Some QoL, such as better tutorial pics or more settings.</li><li>Some things don't look as nice as they should've looked (placeholder art). I'm working on it!</li><li>Several CGs where they should be (or where they should've been nicer)</li><li>Epilogue and credits! It's short, but... wait for it :)</li><li>Translations! The game's fully in English, but if you want to play it in another language, you'll have to wait!</li><li>This page :D It's supposed to look nicer on the release!</li></ul>\n<p><strong>Known issues:</strong></p>\n<ul><li><strong>Don't exit the game until all current dialogue is over! And don't start options menu tutorials while in dialogue!</strong> (Automatic tutorials as the story progresses &amp; calling tutorials on field are working fine) There's a couple of places where it may make you skip a few scenes or ruin the save. I'm working on it :)</li><li>Sometimes, when starting the Rei dialogue in library in the 3rd chapter, a book blocks the dialogue. <strong>Press Q to close the book!</strong></li><li>Game can perform poorly or not launch at all if your only videocard is an integrated Intel GPU older than 2014, such as Intel HD 2000-6000 GPU series. You can try, but success is not guaranteed :) Check if your GPU can run OpenGL 4.6, if not, you can try with OpenGL 4.0+, but earlier such as OpenGL 2.1-3.1 may not launch. I'm working on a fix though! You can check the page or ping me and ask on the progress :)</li><li>Some people experience somewhat long first launch time. Wait a few secs :D</li></ul>\n<p>Follow me on Twitter: AMasumary</p>\r\nCredits:\r\n<p>All art, music, sound and code (if not mentioned otherwise) is by me, amasuri<em> (it's been quite a journey last five years ;) )</em>. So, roughly by 98% it's a solo project! However, my friend YoukaiDrawing helped me with some of the main character art and dungeon entrance CG, and my other friend sat9 helped me with a couple of sounds, so big thanks to them! Testing's also on them :)</p>\n<p>A couple of sounds I took under Creative Commons:</p>\n<ul><li><em>pageFlip </em>by carlerichudon10</li><li><em>bookOpen </em>by envirOmaniac2 </li><li><em>fountain </em>by roman_cgr </li><li><em>tram_old </em>by Heigh-hoo </li><li><em>hooves </em>by skitchscharff</li></ul>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T19:58:19", "background_image": "https://media.rawg.io/media/screenshots/859/8596eba39e25cba157105985f838c193.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["amasuri"], "genres": ["Adventure", "RPG", "Platformer"], "publishers": [], "esrb_rating": null}