{"id": 838374, "slug": "pink-robot-co", "name": "Pink Robot Co", "name_original": "Pink Robot Co", "description": "<p>Pink Robot Co is a puzzle game where users help guide the Pink Robot to its destination through user set logic.</p>\n<p>Includes 10 puzzles. <br/></p><p>This game was made as my submission to my first game jam ever, Wowie Jam 4.0<br/></p>\r\nControls\r\n<p>This game only uses the Directional Keys and Spacebar,</p>\n<p>Use the directional keys to highlight an option. Use the spacebar to select an option.</p>\r\nHow To Play\r\n<p>The point of the game is to setup what movement the Robot will do when it steps on a certain colored square. The actions it will do are setup before testing them with the robot. Throughout the testing phase you can abort if your robot gets stuck or is unable to complete the puzzle.</p>\n<p>There are three possible actions the robot can do: Turn right, turn left, and turn around. The direction the robot turns towards depends on the direction it is going. So for example, if the robot is going DOWN and lands on a block with the action to Turn Right it will go towards the LEFT.</p>\r\nScore\r\n<p>At the end of the game you will receive your \"payout\" or score. Every time you have to reset your robot the Version counter will go up. The lower the Version number, the higher your payout. A version count of 1 results in the maximum possible score.</p>\r\nSpecial Note:\r\n<p>I might be willing to make an \"Extended Edition\" for free on itch.io with more features, levels, and polish.<br/></p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T20:52:17", "background_image": "https://media.rawg.io/media/screenshots/0c1/0c1a4a4c658c15c22d5499dd814ce900.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Triberium"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}