{"id": 83836, "slug": "fix-my-car-luxury-sports-build-and-race-lite", "name": "Fix My Car: Luxury Sports Build and Race LITE", "name_original": "Fix My Car: Luxury Sports Build and Race LITE", "description": "Build your luxury sports car like a mechanic and race it in style like a speed racer! Order and install custom parts (rims, speakers,...), choose your paint colors and challenge your race car at the end. YES YOU CAN RACE IT!<br/><br/>Have you ever wanted to construct an automotive dream from the ground up (a kitcar) like mechanics do in their spare time? For the glory, power and fun? For the EPICNESS? Of course you do!<br/><br/>In this incredible automotive, sport car building simulator you will do it all. We will even teach you the required mechanical skills, so don't you worry.<br/><br/>This free version offers you a healthy taste of a few options and some help along the way. The best custom parts are in the paid version but you will still get to race the car at the end.<br/><br/>During play the stock parts show up while you get to order what you want for upgrades and mods. You start off by welding the frame, assembling the panels, choosing your engine, tuning it for performance, and go all the way to adding luxury touches including custom leather upholstery, turbo nitrous kit, amps, wheels, rims, trim and everything that makes the best car.<br/><br/>Just remember you are in full control of the options and mods you want - choosing parts from a catalogue and a parts store! You're rich and work out of your mansion with an unlimited budget; the world is your oyster!<br/><br/>This game is available in many languages including the language you are reading this description in. The language will load automatically based on the language of your device. As for your game progress, the game will auto-save your every move so you can always undo a step or take a break.<br/><br/>Please do not spoil the fun for others by posting solutions in the comments. Instead, come and find us on Facebook (FireRabbit), Twitter (@FireRabbit_Inc) or visit the game's landing page:<br/><br/>http://firerabbit.com/fixmycar_luxurysports/game/en/<br/><br/>Here are is a sample of the in-game tasks:<br/><br/>*** Get an Awesome Engine!!! - Order your custom-made engine from the catalogue.<br/><br/>*** Create Custom Wheels - No car can race without optimal wheels (rims and tires).<br/><br/>*** Weld the Roll Cage - Find the tubular steel and make a roll cage.<br/><br/>*** Brake Fluids Top-up - The brakes need hydraulic fluids to operate.<br/><br/>*** Mount the Transmission - Get the transmission and secure it on using pins.<br/><br/>*** Weld the Dual Exhaust - Find all the exhaust parts and weld them together in the assembly area.<br/><br/>*** Assemble the Suspension System - Find all the parts and assemble the front and rear suspensions.<br/><br/>*** Paint the Body - It's finally time to paint the body of the car. <br/><br/>*** Custom Spoiler - Order a spoiler from the catalogue.<br/><br/>*** Install Racing Seats - Order and install luxury-racing seats.<br/><br/>*** Add Engine Oil - The car needs oil. Find and add the oil.<br/><br/>*** Add Stereo System - Add the luxury stereo system at center dash.<br/><br/>*** Mount Speakers - Find four similar speakers and add them in the car.<br/><br/>*** Add Racing Pedals - For an extra edge during races, you'll need lightweight pedals.<br/><br/>*** Mount Instrument Panel - To read how fast you're going, you'll need this installed.<br/><br/>*** Add Carbon Side Rails - The body won't be complete without some carbon side rails. <br/><br/>*** Find Core Toolset - Get a hammer, impact wrench, cordless drill and pliers.", "metacritic": null, "released": "2014-10-14", "tba": false, "updated": "2019-07-30T11:51:40", "background_image": "https://media.rawg.io/media/screenshots/110/110716991736b68c2328033ebd115bde.jpg", "website": "http://firerabbit.com/fixmycar_luxurysports/game/en/itunes/lite/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["FireRabbit"], "genres": ["Simulation", "Racing"], "publishers": ["FireRabbit", "alex gosselin"], "esrb_rating": "Everyone 10+"}