{"id": 838486, "slug": "sonrise", "name": "Sonrise", "name_original": "Sonrise", "description": "<p><strong>Sonrise </strong>is a short <em>juicy platformer </em>in which you help out a little robot trying to find its <em>son</em>.  Parts of it can be quite hard to complete, but I believe and so does the little robot!</p>\r\nFor my German pals:\r\n<p>Ich hab das Unity Lokalisierungs System etwas missbraucht und deshalb werden auf der normalen Version<strong> keine/falsche Übersetzungen </strong>angezeigt. Falls Ihr die normale Version spielt solltet Ihr <strong>vorher die Steuerung hier unten durchlesen</strong>, ansonsten koennt Ihr auch die Version mit Übersetzung spielen, die ich nachträglich hinzugefuegt hab und duerft auch ruhig etwas schlechter bewerten:<strong> Sonrise mit Deutscher Übersetzung (Google Drive)</strong> <br/></p>\r\nControls\r\n<p><strong>SPACE </strong>to <strong>JUMP [When enabled, see UI at bottom of screen]<br/></strong></p>\n<p><strong>A</strong> and<strong> D</strong> to <strong>TURN  [When enabled,  see UI at bottom of screen]]<br/></strong></p>\n<p><strong>LMB</strong> to place Objects<br/></p>\n<p>I put great focus on <em>atmosphere </em>and making the game chill. Some parts can be a bit tricky, but <strong>here's some tips: aim in front of the robot!</strong><br/></p>\n<p>Respawn Times are instant though, no need to worry about Loading Screens!<br/></p>\n<p>The amount of control over the AI changes every other level, which is indicated in the UI and makes each level play a bit different than the previous one.</p>\n<p><em>Made in Unity</em><strong>.<br/></strong></p>\n<p>Any critique is welcome, this is only my 2nd game and first Game Jam entry, I want to know what I could've done better and did well!</p>\n<p><strong>Enjoy! <br/></strong></p><p>For anyone getting stuck on Level 3, since this seems to be a thing, and wants some help, I've made a video of myself playing it as reference for you! </p><br/><br/>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T21:34:57", "background_image": "https://media.rawg.io/media/screenshots/d7c/d7c6d60433b809ce5afdff10499c159b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["trader_j0e"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}