{"id": 838411, "slug": "brainless-office", "name": "BrAInless Office", "name_original": "BrAInless Office", "description": "<p>You recently got a new job at a fancy start-up that uses a new concept to make their employees work more efficiently.<br/></p>\n<p>So, when is a worker unproductive the most? Exactly, when he is not working!</p>\n<p>For this reason, the company has hired robots to do the tedious daily tasks of an employee like taking a break, getting a coffee or retrieving the printed notice out of the printer. All to maximise profits!</p>\n<p>Unfortunately, a start-up has to look at how it distributes its money, which is why the robots are not top nodge and only capable of simple tasks such as delivering objects.</p>\n<p>However the brainless robots don't understand which employee wants which item.</p>\n<p>This is where you come into play! You were hired specifically because of your brain. Nothing else. You will only have to tell the robot which items to bring where. That's it!</p>\n<p>But don't be too hard on the little guy if he does something wrong.</p>\n<p>After all, he's brainless, not heartless!</p>\n\n<p><strong>How to Play:</strong></p>\n<p>Wait for the workers to request an item. As soon as they do, <strong>left click</strong> the robot, search and left click the item and click on the respective employee to deliver the item to. In case you misclicked you can unselect all with <strong>right click</strong>.</p>\n\n<p><strong>Roadmap:</strong></p>\n<ul><li>More Levels</li><li>More Items</li><li>More Robots</li><li>Random Events</li></ul>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T21:07:09", "background_image": "https://media.rawg.io/media/screenshots/525/5250f4574e730c515067884df6b69747.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Merphin"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}