{"id": 838529, "slug": "worldbuilder-dungeons-dummies", "name": "Worldbuilder - Dungeons & Dummies", "name_original": "Worldbuilder - Dungeons & Dummies", "description": "<p>-Try to make the perfect world for your adventure party!</p>\n<p>-Build the world by placing cards drawn from your deck (at the bottom of the screen) onto empty tiles. Your party and each tile has a Lvl. </p>\n<p>-Try to match the level of the tiles with the level of your party.</p>\n<p>-You can check the stats of a tile by clicking the right mouse button on a tile. </p>\n<p>-Your party will seek for a point of interest on the map as its quest goal and will move towards it. After visiting a POI it goes on a cooldown. </p>\n<p>-When moving random encounters can happen that will give XP that will eventually level up your party. </p>\n<p>-You can also place points of interest and modifications on tiles. </p>\n<p>-When placing a tile onto the same type, the tile upgrades, which increases its level. </p>\n<p>-When moving across an empty tile, or when you dont have an active POI, your party loses drastically drive.</p>\n<p>- If your health or your drive reaches 0, you lose.</p>\n<p>-Gain as much fame as possible by completing quests and dont forget to buy new cards in the shop.</p>\n\n\n<p>Controlls:</p>\n<p>-interaction with mouse</p>\n<p>-move camera with W,A,S,D</p>\n\n<p>Credits:</p>\n<p>Grraphics and Sound Effects: Kenney</p>\n<p>Music: Matthew Pablo: Epic News Theme (Beyond The Clouds v2)</p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T21:51:44", "background_image": "https://media.rawg.io/media/screenshots/a82/a825d1be775a579c7e5efbc1ea2650fb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameDevploration"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}