{"id": 83860, "slug": "kids-cake-battle", "name": "Kids Cake Battle", "name_original": "Kids Cake Battle", "description": "Shooters are one of the most popular forms of entertainment for boys and girls. A lot of parents wonder: where can they find good shooter for their kids? But this shooter should be without even a hint on violence or war. You could ask, how can shooters meet such requirements? But they can! Our funny Hippo presents you an interesting new game, which will occupy the top place in your game collection and other popular children's games turn out to be boring in comparison with it! So, ladies and gentlemen, shooter for kids \"Battle of cakes!\"<br/><br/>Every child knows Сakes` Day. People from Hippo town also celebrate this holiday. All children hang out and gather cakes during this day. But what to do when you are filled up with cakes? What if you have them too many? Hippo town knows the solution to this serious problem. Citizens like to have fun. Once children came up with an amazing game, which have become the town tradition. All the cakes gathered during the day, children bring to the central square. It is here where the traditional Сakes` Battle begins, children and even adult take part in it! Who will be the champion of Cake`s Battle this time?<br/><br/>Grab cakes and let`s go in a new adventure with our Hippy. Try our new kids shooter! Become a champion of the Cakes` Battle! This our new product, as well as other our games for boys and girls, is absolutely for free! Stay with us, stay tuned and give hours of happiness your child, playing with them our educational games.", "metacritic": null, "released": "2016-09-15", "tba": false, "updated": "2019-10-22T14:22:05", "background_image": "https://media.rawg.io/media/screenshots/e76/e7630863f15a6b4cc1e8aebd2b479fc5_yvoCWh4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Oculist"], "genres": ["Adventure", "Family"], "publishers": ["CLEAR INVEST"], "esrb_rating": "Everyone 10+"}