{"id": 838683, "slug": "outpost-roast", "name": "Outpost Roast", "name_original": "Outpost Roast", "description": "<p><strong>This game has been made in 2 weeks for the LOWREZ Jam 2022 and implements the optional theme \"Kill it with fire\".</strong><br/></p>\n\n<p>In <strong>Outpost Roast</strong> you play as an astronaut who is left back by his comrades and needs to find his own way of escaping the planet. Your only option is to retrieve 3 common AAA batteries,... ehm, I mean 3 high-tech power supplies, in order to make your emergency pod operational again. Equipped with your trusty flamethrower, you are going to explore 3 different biomes in your search for the power supplies.</p>\n\r\nFeatures\r\n<ul><li>3 biomes - each with a unique boss battle</li><li>unlockable moves</li><li>scattered and hidden Power-Ups to make your character stronger</li></ul>\n\r\nControls (Keyboard &amp; Mouse)\r\n<strong>Key/Input</strong><strong>Action</strong>A / DMove left or rightSpaceJump (hold down for higher jump)MouseAim where your flamethrower is pointingLeft mouse buttonShoot your flamethrowerHold down Space and release again while being airborne and against a wallPerform a wall jump (Note: Not available from the beginning, needs to be unlocked first)ShiftPerform a powerful dash which can break through loose walls. (Note: Not available from the beginning, needs to be unlocked first)\r\n\r\nControls (Gamepad - x-Box Layout)\r\n<strong>Key/Input</strong>\n<strong>Action</strong>\r\nLeft Analog StickMove left or right\r\nA / LB / LTJump (hold down for higher jump)\r\nRight Analog StickAim and shoot with your flamethrowerHold down A / LB / LT and release again while being airborne and against a wall\r\nPerform a wall jump (Note: Not available from the beginning, needs to be unlocked first)\r\nB / RB / RTPerform a powerful dash which can break through loose walls. (Note: Not available from the beginning, needs to be unlocked first)\r\n\r\nGameplay\r\n<p>Your life points are shown in the UI in the lower left corner. You lose life points when being hit by enemies. On reaching 0, you lose and respawn at the last visited checkpoint.</p>\n<p>When shooting with your flamethrower, heat will start building up, indicated by the gauge in the lower right corner. Once this gauge is filled up completely, your flamethrower will be jammed for a few seconds before you can attack once more.</p>\n\r\nAdditional notes\r\n<ul><li>This game has been developed in Godot 3.4.5.</li><li>All resources have been generated by ourselves.</li></ul>\n\r\nChangelog (Post Jam)\r\n<ul><li>August 17th, 2022<ul><li>Overall balance changes (mainly nerfing enemies HP a bit)</li><li>Better visual indicator for Power-Ups effect in UI</li><li>Made 3rd boss a bit more challenging</li></ul></li><li>August 18th, 2022<ul><li>Fixed flickering mouse cursor</li><li>More balance changes</li></ul></li></ul>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T22:50:52", "background_image": "https://media.rawg.io/media/screenshots/8cb/8cb9efbcc96ef0bd25253b04f29b5bb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Andreas Roschal", "BananaBobBert", "matthiase"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}