{"id": 8386, "slug": "bit-journey", "name": "Bit Journey", "name_original": "Bit Journey", "description": "** Bit Journey: Definitive Edition is now available! **<br/><br/>Explore a gigantic, limitless and rich world. It's a brand new open-world experience. The world has gone mad, time travel vortexes are appearing everywhere and spawning incredible enemies that are trying to dominate the whole world while our seven heroes are trying to survive!<br/><br/>Destroy everything in the world, collect items and defeat amazing enemies. Score by doing anything in the world, improve your character skills and prepare to survive. You can even conquer secret bases, defeat super bosses and compete with your friends in the leaderboards!<br/><br/>You can also use your Watch to take care of pets and use them as sidekicks in the game! You can feed them, play with them, train them and your workout activities impact in their performances during gameplay! To fight side-by-side with Chip, Catty and Fairy, just raise your wrist while playing and have fun! This game uses data from the Health app.<br/><br/>Be a mysterious ninja, an army soldier, a baseball player, a famous artist, or even a medieval warrior. Survive the journey and reach the higher glory. There's a little bit of everything in Bit Journey.<br/><br/>** Through the years, we were featured on the App Store's: **<br/><br/>Best New Games<br/>Best Pixel Art Games<br/>Games with Great Protagonists<br/>Apps Made in Brazil<br/>Games made in Latin America<br/>Celebrating National Talents<br/>Brazilian Games<br/>Great Brazilian Games<br/>Best Retro-Modern Games<br/>Cute Heroes<br/>Cult Classics<br/>20 under 20<br/>Our Favorites for Apple Watch<br/><br/>** We trended on: **<br/><br/>#1 in 2 Countries on the Games Category, Action and Adventure Subcategories<br/>#5 in 30 Countries on the Games Category, Action and Adventure Subcategories<br/>#25 in 15 Countries on the Games Category, Action and Adventure Subcategories<br/>Top 100 in 100+ Countries on the Games Category, Action and Adventure Subcategories", "metacritic": null, "released": "2015-04-16", "tba": false, "updated": "2021-11-12T05:05:38", "background_image": "https://media.rawg.io/media/screenshots/864/8646b90dd304f9d2b745bd020bf938c1.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 371, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Marcos Morais"], "genres": ["Action", "Adventure"], "publishers": ["Marcos Morais"], "esrb_rating": null}