{"id": 838755, "slug": "dungeon-factory-prototype", "name": "Dungeon Factory Prototype", "name_original": "Dungeon Factory Prototype", "description": "<p><strong>Controls below, apologies for no in-game, ran out of time</strong>.<br/>Unfortunately got a bit over ambitious in concept from the 9 day jam duration and didn't really finish a complete game. I figured I might as well upload what I've got since it implements the core tech end-to-end despite having not really been made into a game.  Machines produce monsters where are output to defend the dungeon from invaders.<br/>Created for Wanna x Yam Game Jam 2022</p>\n<p>Although I didn't really finish game elements (machine costs, income, good enemy spawning logic, winning/losing) if you have feedback on the systems present here, I'd really appreciate it. I plan to flesh out this game after the game jam is over. <br/><br/><strong>Controls</strong><br/>WASD : Move Camera <br/>V  : Toggle Battlefield view <br/>1-5 : Place Basic Machines<br/>Shift 1-4 : Place Advanced Machines <br/>Click: Place machine, select port to run path, place path<br/>Right Click: Back out, click and hold to remove machine or path <br/>Esc: Back out </p>\n<p><strong>Machines <br/></strong>1 - Attack Essence Input <br/>2 - Speed Essence Input <br/>3 - Defense Essence Input <br/>4 - Combiner, merge two inputs into a monster <br/>5 - Teleporter, send a monster to the battlefield <br/>Shift 1 - Refiner, upgrade an essence to level 2 <br/>Shift 2 - Level 2 Combiner, make stronger monsters out of level 2 essences <br/>Shift 3 - Greater Refiner, upgrade a level 2 essence to level 3 <br/>Shift 4 - Level 3 Combiner, make the strongest monsters out of level 3 essences <br/><br/><br/><strong>Art Credits <br/></strong>Pipes, which were also used to build machine sprites - Plums by surt<br/>UI Sprites - Board Game Icons, Pixel UI pack, and Game Icons by Kenney<br/>Some Units and Dungeon Tileset - Dungeon Tileset 2 by 0x72<br/>Other Units - Enchanted Forest Characters by Superdark<br/></p>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-19T23:18:09", "background_image": "https://media.rawg.io/media/screenshots/881/881f1c60991d34cd365aa37ae24d89dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["QuietBenchZen"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}