{"id": 838718, "slug": "hans", "name": "Hans", "name_original": "Hans", "description": "Hans is a visual novel baking simulator in which you play as an alien dropped off on Earth during World War 1, who bakes magical pastries to help the people in your small town. You can also choose not to make what they ask for, because sometimes their requests are not as thought out as they may think. Just be prepared, because your actions have eight endings worth of consequences!<br/><br/><br/><br/><br/><br/><br/><strong>Bake magical foods for the local townsfolk</strong><br/>In this moody handdrawn game, you have the power to help the townsfolk by baking magical pastries! Will you accept their requests?<br/><br/><br/><br/><br/><strong>Summon aliens to obtain magical ingredients</strong><br/>Enter the mysterious cat shrine and tap into your magical powers as an alien to obtain a special ingredient to use in your baking. <br/><br/><br/><br/><br/><strong>Help two friends fall in love</strong><br/>Addler is interested in their friend, Karl! Will you bake them some magical muffins to give them a boost of confidence and ask Karl out?<br/><br/><br/><br/><br/>Hans is a passion project made in a few months by a handful of college students. Art is pencil on watercolor paper, colored and edited in Photoshop.<br/><br/>Designed together by Clei Barnhart and Elaine Toh. Produced by Clei Barnhart and David Contarino. Coding by Elaine Toh. Art and narrative by Clei Barnhart. Music by Fay Xu and Jacob Naumoski. Sound design and audio implementation by David Contarino. UI by Elaine Toh. Special thanks to Nicholas Linares and Marianne Zhou!<br/><br/>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2023-12-08T11:14:35", "background_image": "https://media.rawg.io/media/screenshots/f02/f025f5b148dfa94d8bb3a9d2093a639a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC", "Web"], "developers": ["MiyukiNinja", "David Contarino", "at0m", "Clei Barnhart", "Elaine Toh"], "genres": ["Adventure", "RPG", "Simulation", "Casual", "Indie", "Platformer"], "publishers": ["USC Games", "at0m"], "esrb_rating": null}