{"id": 839036, "slug": "dewdrop-daycare", "name": "Dewdrop Daycare", "name_original": "Dewdrop Daycare", "description": "<p>You have just moved to a new area of the woods and have opened up your plant daycare! Hang out and take care of plants dropped off by the local forest spirits. <br/></p>\r\nGameplay Instructions\r\n<p>Forest spirits will come by either to drop off or pick up their corresponding plant. When they arrive, they will ding the bell outside the daycare. The plant that is in the daycare when you spawn is your personal plant. It was created differently in the way that it grows is procedural, although still based on the same stats described below.</p>\n<p>Plants each have <em>three</em> stats which are displayed visually:</p>\n<ol><li>Water<ol><li>Use the watering can to give your plants more water, they will gradually lose water over time.<br/>\n</li><li>When the plant has enough water <em><strong>the plant itself</strong></em> will appear brighter, if it gets too little or too much water it will darken and turn red/brown. It's up to you to pay attention and know if a plant has too little or too much water.</li></ol></li><li>Sunlight<ol><li>The sun moves from right to left across the daycare and plants can receive sunlight by being placed beneath a window in which the sun is shining through. If a plant is not beneath a window, its sunlight level will <em>decrease </em>over time.<br/>\n</li><li>When the plant has enough sunlight its <em><strong>pot</strong></em> will appear brighter, if it gets too little or too much sun it will darken and turn black. Once again, it's up to you to pay attention and know if a plant has too little or too much sunlight.<br/>\n</li></ol></li><li>Happiness<ol><li>When a plants water and sunlight are close to ideal, the plant will become happier. </li><li>When a plant is happy, particles will show up around the plant, when it is sad, the particles will go away.</li><li>If a plant stays happy long enough, it will grow</li></ol></li></ol>\r\nControls\r\n\n<br/>", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-20T01:07:50", "background_image": "https://media.rawg.io/media/screenshots/87c/87cea7a2924c0654a51f8c19f5abbb3b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cryingames"], "genres": [], "publishers": [], "esrb_rating": null}