{"id": 839104, "slug": "the-unsettled", "name": "The Unsettled", "name_original": "The Unsettled", "description": "The Unsettled is a first-person psychological horror game. Explore a mysterious School with horrifyingly realistic environments, and enjoy a genuinely terrifying experience.<br/><br/><h3>Storyline</h3>You are an investigative journalist willing to take risks and dig deep to uncover the stories no one else will dare touch.<br/>On a trail to find the truth, You plan to visit a Boarding School in the Indian Himalayan Region after receiving a Message from your old co-worker friend who told you about a case of a missing girl. <br/>Your task is to Investigate the school campus, follow the instructions from your Friend while you explore, Collect the hints, Connect the dots and try to find the missing girl, and.. try not to die.<br/><br/><h3>Environment</h3>The game is set inside a huge school in which terrible things have happened.<br/>You’ll wander through various places, such as scary classrooms, unsettling houses, movie halls, hostels, labs, auditoriums, dispensaries, etc.<br/>Explore every location and find your way to the missing girl.<h3>Gameplay</h3>In this game, you have to search for some stuff in order to search for the missing person. You’ll be able to pick up items, interact with the environment, and search for things that may help you search for the artefact coins and solve the mystery.<br/><br/><br/><br/><br/>Get lost in this immersive and terrifying experience thanks to high-quality visuals and 3D sounds with ever-changing weather and realistic environments.<br/><br/><br/><br/><strong>WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES</strong>", "metacritic": null, "released": "2022-08-19", "tba": false, "updated": "2022-08-22T03:37:56", "background_image": "https://media.rawg.io/media/screenshots/870/8700ba801267f1426d9bde4e55e3f67f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 288, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MobiusGames"], "genres": ["Adventure", "RPG", "Simulation", "Indie"], "publishers": ["MobiusGames"], "esrb_rating": null}