{"id": 839101, "slug": "star-vortex-2", "name": "Star Vortex", "name_original": "Star Vortex", "description": "Star Vortex is top-down supace shooter ARPG that follows the formula of classic ARPGs like Diablo. Earn experience, level up your ship and collect equipment that synergizes with your upgrade build and playstyle. Explore randomly generated sectors fighting elite enemies and bosses then work your way up through difficulties.<br/><br/><h3>DESIGN</h3>Along with designing a perfect build to match your play style and searching for the best equipment you can visit the shipyard to design your perfect ship.<br/><br/>Unlock parts as you progress and make a ship that looks exactly how you want. With import/export options you can even share your design with friends.<br/><br/><h3>EXPLORE</h3>Randomly generated sectors make every game different but your navigation system will take some of the guesswork out. Plot a course through to bosses while looking for specific equipment on the way.<br/><br/><br/><h3>DESTROY</h3>Put your equipment, upgrades, and skills to use destroying enemies in a variety of stars. Escort VIPs, defeat waves of enemies or come face to face with elite enemies and bosses.<br/><br/><br/><h3>Feature List</h3><ul><li>A versatile ship designer allows you to construct your ship from a vast array of parts, choosing colors and slot placements as you wish.<br/></li><li>Constant progression, unlock bigger ships and more slots as you level up your pilot.<br/></li><li>Upgrade trees with countless builds and play styles.<br/></li><li>Deep and complex item system, with many possible builds and synergies to discover.<br/></li><li>A huge array of weapons such as lasers, homing missiles, energy pulses, time dilation, drones, cloaking fields, grapple guns, tesla coils, etc.<br/></li><li>Procedurally generated sectors to explore, making every game different.<br/></li><li>Choose your level of loss, from hardcore (perma-death) down to more casual options.<br/></li><li>Play how you want to play with a huge array of settings, controls are fully customizable allowing keyboard only, keyboard and mouse, controller or touch controls on any platform.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-22T03:34:00", "background_image": "https://media.rawg.io/media/screenshots/b85/b85471ce476504e3cbd61c3881d65577.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ZORG"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Hunted Cow Studios"], "esrb_rating": null}