{"id": 839183, "slug": "puzzle-breakers-rpg-online", "name": "Puzzle Breakers: RPG Online", "name_original": "Puzzle Breakers: RPG Online", "description": "In Puzzle Breakers you're about to join legendary PvP battles with real players, go on raids to fight incredible creatures and take part in clan wars. Fight against other players or monsters, summon epic heroes to participate in massive PvP battles.<br/><br/>This gem of a game has it all: use bold strategy to beat levels, level up your skills with magic, slay dragons, and defeat evil lords in legendary combat! Bring everything you’ve got to come out on top! <br/><br/>Game features:<br/><br/>• Heroes<br/>Summon legendary and epic heroes and create the strongest squad there is to crush the enemies.<br/><br/>• PvP online<br/>Fight other players from all over the world in real-time.<br/><br/>• Clans<br/>Play with friends, take part in clan wars and defeat enemies.<br/><br/>• Raids<br/>Joint clan raids on bosses and monsters. You will meet many creatures - dragons, scary trolls, and goblins. Who knows who else is waiting for you in the fantasy world of Puzzle Breakers.<br/><br/>• Match-3 puzzles<br/>Challenging puzzle quests. Match-3 RPG games combine everything that modern players are looking for.<br/><br/>• Campaign<br/>Hundreds of levels will challenge you in the fields of dangerous battles. Exciting adventures await!<br/><br/>• Stunning 3D graphics<br/>The design of the characters will steal a way to your heart.<br/><br/>It's time to protect your kingdom. Summon legendary heroes into the best squad in the world. Win clan wars and fight against real players in pvp duels.<br/><br/>Would you like to share your playing experience, find new friends or try your luck in weekly contests? Then join our Discord community! - https://discord.com/invite/HjWjEa8saM<br/>Encountered an error? Please contact our support team! - https://support.puzzle-breakers.com/hc/requests/new", "metacritic": null, "released": "2022-06-20", "tba": false, "updated": "2022-11-03T18:39:44", "background_image": "https://media.rawg.io/media/screenshots/d03/d0304677dcab2a3903bf1b0e4fcc897c.jpg", "website": "https://rj-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["RJ Games"], "genres": ["RPG", "Puzzle"], "publishers": ["RJ GAMES"], "esrb_rating": "Teen"}