{"id": 839154, "slug": "galaxy-life", "name": "Galaxy Life", "name_original": "Galaxy Life", "description": "Impressive planets, strange creatures, and dangers can be found in Galaxy Life! In this online game you steer your colony to victory! Your little friends may be cute and sweet, but space is full of all sorts of threats.<br/>\n<br/>\r\nExplore the world of Galaxy Life, build a space colony, attack enemies, grab items and rule the universe. Galaxy Life is full of interesting planets and characters. You'd be surprised how big Galaxy Life is! In this free to play MMO strategy game that mixes traditional easy-to-play casual gameplay mechanics with touches of more traditional genres and features like tower defense, RTS, or several competitive PvP features in a persistent on-line Galaxy. You play together with others or your friends and take on evil, so gather your friends to fight evil in this Galaxy Life social game!<br/>\n<br/>\r\nFeatures:<br/>\n<br/>\r\n+ Persistent Galaxy on war with players from all over the world!<br/>\r\n+ Challenge friends or foes in battles for loot and control over the Galaxy!<br/>\r\n+ Strategically Secure your colonies from the attacks of rivals and even friends with your defense towers, mines, bunkers full of units, walls, energy shields, traps and more!<br/>\r\n+ Conquer intriguing and wonderfully weird new worlds to expand your empire!<br/>\r\n+ Form a galactic Alliance with other players and wage epic Alliance Wars together against the other ones!<br/>\r\n+ Bet against other people by fighting them in Rival Battles!<br/>\r\n+ Climb the weekly, monthly or all time player leader boards to show your friends and the entire world what your Starlings are made of!<br/>\r\n+ Seasonal events like the Halloween or Doomsday!<br/>\r\n+ Periodical game updates with new features, content and fixes!<br/>\r\n+ Train and upgrade new troops or resource buildings!<br/>\r\n+ Craft powerful Special Attacks or units with unique collectables!<br/>\r\n+ Multiple ways to cooperate with friends helping them!<br/>\r\n+ Save your Starlings from the grip of the evil Firebit!", "metacritic": null, "released": "2022-08-19", "tba": false, "updated": "2023-08-06T20:09:34", "background_image": "https://media.rawg.io/media/screenshots/d4e/d4e474fdd9b9e7f3713a1ef9d9206a02.jpg", "website": "https://galaxylifegame.net", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 90, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 7, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 400, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Phoenix Network"], "genres": ["Strategy"], "publishers": ["Phoenix Network"], "esrb_rating": null}