{"id": 839173, "slug": "piano-tiles-music-tiles-game", "name": "Piano Tiles - Music Tiles Game", "name_original": "Piano Tiles - Music Tiles Game", "description": "Play the best piano Tiles Game on your mobile for free! Enjoy the best music tile games of 2022 and enjoy the amazing music. Have you ever dreamed to become a professional piano master? Or you have ever dreamed of playing songs like on a piano? If yes than this piano tile music tile game will be the best game for you where you can play piano tiles and make music and songs.<br/><br/>Now its time to make your dreams come true with the new piano tiles game. This Piano Tiles music game is the latest hit piano game which is available for iPhone on IOS store. With this piano tile matching game you can play songs like a real piano master. This Piano Tiles master game is easy to learn and really a big fun to play in your spare time!. With this piano music tile game your phone becomes a piano, by tapping on the piano Tiles game, and you can play your favorite songs in your phone just like best pianists!<br/>Piano Tiles Magic Tiles games is best piano tiles songs making game. This music tiles game has easy and smooth gameplay: you need to listen the music and tap on the piano tiles. This music tile game will provides you different kinds of music and relaxing gaming experience.<br/><br/><br/>&gt; Piano Tiles Music Tile Gameplay.<br/>&gt; Tap on Piano Tiles to make Magic.<br/>&gt; Listen to the music and tap on tiles.<br/>&gt; Do not tap the wrong piano tiles.<br/>&gt; Headphones are recommended.<br/><br/><br/>&gt; FEATURES OF PIANO TILES – MUSIC TILES GAMES:<br/>&gt; Easy to learn but hard to master<br/>&gt; 300+ hot songs from all around the world!<br/>&gt; You can battle with other players!<br/>&gt; You can DIY the game skin!<br/><br/>So why you are waiting go and download our Piano Tiles Master Music Tiles game for free and if you like our game give us your feedback into the review section Thanks.", "metacritic": null, "released": "2022-07-21", "tba": false, "updated": "2022-08-22T05:11:49", "background_image": "https://media.rawg.io/media/screenshots/ffc/ffc2b6a87411dec50ff2c6a8bff2dacf_suzU0f2.jpg", "website": "https://www.stapletechinc.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Staple Technologies"], "genres": ["RPG"], "publishers": ["Staple Technologies"], "esrb_rating": "Everyone 10+"}