{"id": 839123, "slug": "crustacean-nations", "name": "Crustacean Nations", "name_original": "Crustacean Nations", "description": "🦀Crustacean Nations🦀 is a simple RTS about crabs waging perpetual war. Collect resources, build sand castles, amass troops, and summon titans in a charming beach environment. Easy to pick up yet hard to master, players of any age group can have fun building the ultimate Crustacean Nation.<h3>Build!</h3>Build sand castles, set up protective walls, and place crab-spawning barracks to secure victory. Send out crabs to collect resources and guard the base. Building your castle can be quite relaxing... if it doesn't get flattened by enemy crustaceans.<br/><br/><br/><h3>Amass!</h3>Recruit any of the current unit types, each with their own strengths and weaknesses!<br/><br/><strong>🦀Common Crab:</strong> The bread and butter base unit to fill your army.<br/><strong>🦀Ghost Crab:</strong> Fast and weak, great for collecting resources.<br/><strong>🦀Stone Crab:</strong> Slow and strong, stone crabs make great castle guards.<br/><strong>🦀Hermit Crab:</strong> Tanky hermit crabs draw the attention of all nearby enemies.<br/><strong>🦀Coconut Crab:</strong> Huge, slow coconut crabs hurl coconuts at enemies from a range.<h3>Summon!</h3>Players compete to summon the legendary 🦀Spider Crab🦀. Sacrifice units in the central boss pit to win the Spider Crab's favor and send it stomping towards the enemy base.<br/><br/><br/><h3>Fight!</h3>Strategically command your troops to win fights against the enemy. Orchestrate raids and secure territory to make sure the enemy does not get ahead. Fight against the artificial intelligence on three different maps, with games ranging from 1v1 battles to four-way free-for-all combat.<h3>The crabs have HATS!</h3>", "metacritic": null, "released": "2022-08-19", "tba": false, "updated": "2022-08-22T04:05:47", "background_image": "https://media.rawg.io/media/screenshots/692/6925f0b73c4a7d8f1e98041430e5608e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Beans"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Team Beans"], "esrb_rating": null}