{"id": 839190, "slug": "criminal-stories-csi-episode", "name": "Criminal Stories: CSI Episode", "name_original": "Criminal Stories: CSI Episode", "description": "Ready to face the criminal world head-on? In Criminal Stories, every episode is an opportunity to get inside the mind of a killer. Your city is increasingly the scene of criminal activities that threaten law and order. An elusive evil genius has drawn you into criminal games that even the FBI agents are powerless to stop: it all falls to you!<br/><br/>But you have an ace up your sleeve – not only are you a great detective, you have a unique supernatural gift. Use it to uncover the culprit! <br/><br/>Use detective and forensic techniques:<br/>– crime scene investigation. Arm yourself with patience and a magnifying glass in CSI games! Gather clues at the crime scene and draw conclusions; <br/>– interrogate suspects. What secrets are the suspects hiding? Expose their lies;<br/>– evidence analysis. A criminal always leaves something behind. Don't forget to bring your fingerprinting kit! Forensic games will help you in your quest for clues; <br/>– ciphers and puzzles. Impress the criminals with your brilliance. Crack ciphers to solve the murder!<br/><br/>You'll never have to work alone. Your partners will come to your aid: <br/>– Eric Moreira, an expert at the dangerous game of solving crimes; <br/>– Eva Mayer, a psychotherapist who knows just how to lure a criminal into an elegant mind trap;<br/>– Tony Chase, a specialist who can bypass any security system. He's also a big fan of detective games and movies;<br/>– Richard Hudson, a mysterious billionaire who'll give you access to high-tech gadgets... and his bank account. <br/><br/>Your partners aren't just participants in the crime games you play. They can be so much more! All your partners have their own skeletons in the closet. Follow the exciting storyline to find out more about them. They'll need your help when their past catches up with them!<br/><br/>Love NCIS or CSI? Criminal Stories brings your favorite crime dramas to your phone. Make the most of the game's interactive features to take center stage in an astonishing investigation. <br/><br/>Take your pick:<br/>– your playing style. What's your story adventure game personality? Are you an empath, a trickster, or a pragmatist? Unlock new episodes to track your choice statistics;<br/>– outfits for you and your partners. Your wardrobe has dozens of options for every occasion. Who said that crime games can't be played in style? <br/>– a partner you want to have an intimate relationship with. Spend more time with them and treat yourself to a nice date; <br/>– design your dream office. Your partners trust your taste: furnish every room in the office to your liking. Get the decor just right!<br/><br/>Solve the mystery of your supernatural gift in a story mode game. Where did you get the power to see into other people's minds? Are there other people like you in the world? Play and find out!<br/><br/>In Criminal Stories, you'll also have the chance to:<br/>– earn special Visionary status by watching every single vision;<br/>– face serial killers, crooks, and devious, money-grabbing criminals;<br/>– get an adorable pet and take it to a murder scene;<br/>– help people with their problems and gain distinguished Philanthropist status;<br/>– beat the police and FBI at their own game;<br/>– learn about forensics using tools you'll know from CSI: Hidden Crimes;<br/>– investigate multiple cases as yet unsolved: one crime always leads to another;<br/>– follow an intriguing storyline and play mind games with an enemy who's hiding in the shadows;<br/>– impress your partners with your undercover skills!<br/><br/>Enjoy all of this and more in Criminal Stories, a story-based game where each tap brings you closer to solving another mystery. You'll find yourself in a place where the law doesn't always win out and justice is hard to find. Will you be guided by gut feeling, or meticulously follow the rules of law? It's up to you to decide!<br/><br/>Like most F2P games, Criminal Stories has a store where you can buy items. Use in-game currency to customize a character's office or wardrobe or to unlock new features in one of the most interesting investigation games out there.", "metacritic": null, "released": "2022-06-15", "tba": false, "updated": "2022-08-22T05:34:15", "background_image": "https://media.rawg.io/media/screenshots/3e0/3e0a8cd59b5f7a6587c04e367b9a2835_f3YTjVy.jpg", "website": "http://game-garden.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Garden"], "genres": ["RPG", "Simulation"], "publishers": ["Game Garden"], "esrb_rating": "Mature"}