{"id": 839194, "slug": "ship-simulator-online", "name": "Ship Simulator Online", "name_original": "Ship Simulator Online", "description": "You will like our ship simulation game that we have developed specially for ship games enthusiasts!<br/><br/>Establish your shipping company, start trading worldwide, earn money and expand your fleet of ships.<br/><br/>Realistic ports and cities of 25 different countries designed on the world map are waiting for you to have fun and adventurous minutes by organizing cruises in HD quality accompanied by ocean and sea physics.<br/><br/><br/>In our game, there are more than 20 types of ship models in 5 different categories: Tanker ships, oil ships, passenger ships, dry cargo ships and cargo ships.<br/>Thanks to the multiplayer feature, you will be able to use ships online simultaneously with other players.<br/><br/>Thanks to the ship rental system, you will be able to earn automatic in-game income in the background by renting new ships with the money you earn from the game.<br/><br/><br/>General features<br/><br/>-25 different ship models. (Tanker, Oil, Passenger, Cargo, Dry cargo ships)<br/>-Flags of 60 different countries that you can wear on the ship.<br/>- Kinds of ship led lamps<br/>-Live radar navigation system<br/>-Rainy weather and snowy weather options<br/>-Sky cold, Hot, Sunset options<br/>-Realistic ship interior driving details<br/>- Realistic ship physics and controls<br/>-2 Different sea water physics. (The ocean is wavy and stormy- Calm sea)<br/>-Real oil platforms in the oceans<br/>-Excellent quality air horns<br/><br/>- 5 different tourist islands for cruise ships<br/><br/><br/><br/>“Ship Simulator Online“ subscription “Multiplayer”.<br/>“Ship Simulator Online plans:<br/>\t•\tMonthly: $1<br/><br/>Payments and Renewal:<br/>\t•\tPayment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period.<br/>\t•\tAccount will be charged for renewal within 24-hours prior to the end of the current period.<br/>\t•\tYou can manage or turn off auto-renew in your Account settings at any time after purchase<br/>\t•\tNo cancellation of the current subscription is allowed during the active period.<br/>Terms of use: https://docs.google.com/document/d/1Vfeu4nbXYoxoFPRqIxqVjNIl8JqmroiWP2EUmGrjt9g/edit?usp=sharing\u2028Privacy policy: https://docs.google.com/document/d/1_GPaT7eoWzpM8xCf-bBH7zWEBJpIV-5qUnZK5XZTRi8/edit?usp=sharing", "metacritic": null, "released": "2022-04-19", "tba": false, "updated": "2022-08-22T05:38:07", "background_image": "https://media.rawg.io/media/screenshots/e9b/e9b82d835abe6ea1c2e0193083b86b2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ALSA GAMES YAZILIM SANAYI TICARET LIMITED SIRKETI"], "genres": ["Adventure", "Simulation"], "publishers": ["ALSA GAMES YAZILIM SANAYI TICARET LIMITED SIRKETI"], "esrb_rating": "Everyone 10+"}