{"id": 839204, "slug": "heli-monsters-giant-hunter", "name": "Heli Monsters - Giant Hunter", "name_original": "Heli Monsters - Giant Hunter", "description": "► KEEP THE BLADES WHIRLING AND THE BULLETS FLYING<br/><br/>Blast away at a terrifying array of monsters and keep on helping the damsel in distress escape like a true action hero.<br/><br/>► RAIN DOWN FIRE FROM THE SKIES<br/><br/>◾Dive straight into the real action: There’s a boss at every level in this crazy shooter! Survival won’t be easy, but thrills and spills are guaranteed from the very beginning.<br/><br/>◾The right tool for the job: You start the game with just a pistol, and there aren’t many giant monsters you can destroy shooting one of those. Earn cash in levels to upgrade your gun to something more appropriate to the monster task in hand, then switch between the weapons in your armory to find the right gun for each level.<br/><br/>◾Nice threads: It’s not just guns you get to collect, there’s a whole range of outfits to win too. Use shields and body armor for protection, or just get clothing and accessories<br/><br/>◾Use the terrain: Theoretically, you can take out every monster just by shooting, but when there’s a crowd of zombies encroaching on the hostage or an incredibly resilient boss draining your life, it’s worth looking round to see what else you can use – like explosive barrels or a crane in the face, for example.<br/><br/>◾Rooftop rampage: Take down boss monsters before they wreck the city or keep shooting to hold off the mutant hordes and give the hostage time to escape to freedom in helicopter.<br/><br/>◾These monsters have friends: As if giant freak wasn’t enough, most of these boss monsters have minions accompanying them, so keep an eye open for who’s sharing your skies and keep shooting fast to ensure your survival.<br/><br/>► DO YOU KNOW THE PLURAL OF APOCALYPSE?<br/><br/>If you don’t, it’s time to find out, because this game offers an endless stream of giant monsters hell-bent on bringing the world to an end. You’re the only one who can destroy them, so download this insanely entertaining shooter now and start saving the world again and again.", "metacritic": null, "released": "2022-08-15", "tba": false, "updated": "2022-08-22T05:47:37", "background_image": "https://media.rawg.io/media/screenshots/1a0/1a0408e9d3969f50c657bc249202fe4b_JYXvf9T.jpg", "website": "https://app-ads-txt.me/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andrey Panasiuk"], "genres": ["Action", "Simulation"], "publishers": ["Andrey Panasiuk"], "esrb_rating": "Everyone 10+"}