{"id": 839212, "slug": "game-of-kingsthe-blood-throne", "name": "Game of Kings:The Blood Throne", "name_original": "Game of Kings:The Blood Throne", "description": "Be on the lookout, king warriors! <br/>The weave of magic is on turmoil. Soon the ancient Rune Continent will open for a short period of time and allow you all to enter it and face challenges like you never had, fight like you never had, rally with your alliance like you never had, get rewards like you never dreamed of. <br/>The Rune Continent event will open after 00:00 on Dec. 14th (UTC) until Jan. 3rd (UTC).<br/>The Rune Continent is not for the faint of heart. It will challenge your spirit, your willpower and your resilience. Your alliance brothers will be the beacon of light in that mayhem, hold tight to them, fight with them, shoulder to shoulder, back to back and conquer the Rune Wonder together.<br/><br/>Game of Kings: The Blood Throne is completely FREE to play and it features: <br/>- Players vs. Players Epic Wars.<br/>- Explore the world map, seek and attack different Monsters and get precious prizes.<br/>- Gather 6 different kinds of resources (food, iron, stone, wood, silver and gold) to use to build and upgrade buildings, train armies and research new technologies. <br/>- Gather hundreds of thousands of soldiers among Swordsman, Archers, Knights and Siege Machines, in 4 increasingly powerful tiers! Attack other players and defend your Empire!<br/>- Create or join alliances and wage wars with other coalitions. Win them all and dominate the Kingdom! Make friends with other players, develop together and fight your common enemies like brothers!<br/>- Forge Epic and Legendary weapons to become immensely powerful!<br/>- Power up your Hero with 2 different skill trees system. <br/>- Develop 142 different technologies and unlock new buildings and armies.<br/>- No language barriers! Talk to anyone freely with our real-time in chat translation in 34 different languages.<br/>- Frequent events with FREE gifts and engaging activities. <br/><br/>What our players say of GOK:<br/>5/5 - \"I love the graphics. I love the fast pace of growth and I also love how I can grow and be effective without breaking the bank. Great job developers!!! This game is better and better. It's my main game now. I left GOW!! Two thumbs up!!!\". <br/>5/5 - \"I have played GOW for years and I find this game to be much smoother and the graphics are much better\".<br/>5/5 - \"Great game, it's like an old-time Game of War were you actually have to use your head and not your wallet lol\".<br/>5/5 - \"Better than mobile strike\".<br/>5/5 - \"Good game. Beats Game of War hands down\".<br/><br/>Game of Kings: The Blood Throne is completely free to play, however, some items still can be purchased with real money. If you don’t want to use this feature, please disable this function on your device or the setting of the store. <br/>For any questions or comments, please contact us via Email: gameofkingsservice@gmail.com<br/><br/>Gold Club:<br/>Weekly Gold Club Member<br/>- Period: 1 week<br/>- Price: 9.99$<br/>Monthly Gold Club Member<br/>- Period: 1 month<br/>- Price: 29.99$<br/>Quarterly Gold Club Member<br/>- Period: 3 months<br/>- Price: 79.99$<br/>• Payment will be charged to iTunes Account at confirmation of purchase<br/>• Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period<br/>• Accounts will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal<br/>• Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase<br/>Terms Of Use: http://gameofkings-app.com/TermsOfUse.html<br/>Privacy Policy: http://gameofkings-app.com/privacypolicy.html", "metacritic": null, "released": "2017-01-13", "tba": false, "updated": "2023-05-02T15:39:45", "background_image": "https://media.rawg.io/media/screenshots/08b/08bc61ac774249edfd19b5b5f4fc04ca_Ok8XAsX.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Lightning Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["Jia Wang"], "esrb_rating": "Everyone 10+"}