{"id": 839399, "slug": "devoca", "name": "DevOca", "name_original": "DevOca", "description": "<p>DevOca es una adaptación del juego de la Oca con temática GameDev. Ha sido creado para el quinto #RetoGameDev de @CosmicWork.</p>\n<p>Como contexto para disfrutar al máximo de la partida, podemos imaginar 4 desarrolladores indies que intentan publicar antes que el resto un videojuego en Steam. Para ello, deberán ir avanzando por un tablero que representa las diferentes fases de un proyecto de creación de un videojuego. En dicho proceso, hay etapas buenas -representadas en el juego como casillas especiales que te ayudan a avanzar- y etapas no tan buenas -representadas en el juego con casillas que te retrasan o impiden avanzar en tu proyecto.</p>\n<p>DevOca tiene dos modos de juego:</p>\n<p>- Modo Twitch, donde un streamer lanza la partida con el comando !Jugar y esperará a que entren tres viwers con el comando !entrar.</p>\n<p>- Modo Individual, donde el jugador estará acompañado de tres bots.</p>\n<p>El objetivo del juego es llegar el primero a la casilla final de \"publicación del juego en Steam\".</p>\n<p>Espero y deseo que disfruten del juego tanto como yo he disfrutado creándolo.</p>\n<p>Gracias por jugar a DevOca.</p>\n<p>Nota: En este juego se han usado los siguientes asset:</p>\n<p>- Música sin copyright para el tema principal del juego. Canción \"Midnight Obsession\" de Alexandr Ossipov production music.  </p>\n<p>- Free Little Games Asset Pack -&gt; Para el dado y su receptáculo.</p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T07:16:20", "background_image": "https://media.rawg.io/media/screenshots/7fb/7fb1e507d2611cb131594393d1eb3a95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Torleone"], "genres": [], "publishers": [], "esrb_rating": null}