{"id": 839390, "slug": "journey-to-entorus", "name": "Journey to Entorus", "name_original": "Journey to Entorus", "description": "<p><em>Prepare to die! You must make your way to Entorus, and maybe even make it back.</em></p>\n<p>This is a bullet-hell with a short story, made for the second WASM-4 gamejam.</p>\n<p>With default controls, you use <strong>arrow keys to move around</strong>, and <strong>Z and X to control your ship</strong>.</p>\n<p>The game is a bit difficult at times, so if you are getting frustrated, you can turn on <strong>Practice Mode</strong> in Options to just enjoy the ride.</p>\n<p>Note that the <strong>Extra Story</strong> is an optional challenge created for those that are looking for something more difficult.</p>\n<p>\n</p>\r\nTech stuff\r\n<p>WASM-4 is a fantasy-console that limits you to: Only 4 colors on the screen at any given time, 160x160 resolution, 64kb of RAM, and more.</p>\n\n<p>This is my first proper game written in Zig (self-hosted)! The WASM-4 gamejam is a perfect opportunity to try things out, I think.</p>\n<p>I learned a bunch in this jam, and there's a lot I would do differently (technically) in the next game I make. Both the biggest feat and the biggest issue was the meta-scripting language I wrote all the fights and dialogue in. Each enemy on screen carries their own script context, with it's own stack and everything.</p>\n<p>It was impossible to add all the features I  wanted, and it isn't nearly as polished in some places as I'd like it to be... but overall, I am very happy with what I made during these 10 days. </p>\n<p>All art, music, and gameplay was created during the jam.</p>\r\nNotable tools used:\r\n<ul><li>Aseprite</li><li>FL Studio (for composition)</li><li>w4on for getting music in the game</li></ul>\n\n<p>The game is released as CC BY-NC-SA 4.0.</p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T07:12:01", "background_image": "https://media.rawg.io/media/screenshots/a6f/a6f636c59e7a67d930bc1aecd7fab73f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JerwuQu"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}