{"id": 839434, "slug": "cherry-bomb-krystman", "name": "Cherry Bomb (Krystman)", "name_original": "Cherry Bomb (Krystman)", "description": "How to Play\r\n<p>Cherry Bomb is a basic arcade Shoot 'em up  game (Shmup) reminiscent of Space Invaders or Galaga. Pilot your red spaceship to blast your way through 9 waves of attacking aliens. Use the following controls:</p>\n<ul><li>Arrow keys - Move the ship</li><li>X or M or V - Shoot</li><li>Z or N or C - Bomb (Depletes your 🍒. See below)</li><li>You can also use a controller</li></ul>\n<p>Shoot the enemies to destroy them. Enemies will attack you. Destroy or avoid all enemies in a wave to proceed to the next wave. There are 9 waves in the game. If you get hit you will lose a ❤️. If you lose all ❤️ you lose the game.</p>\n\r\nPickups\r\n<p>Occasionally, defeated enemies will drop a 🍒 pickup. Collect them to increase the strength of your Bomb. Triggering the Bomb will deplete your 🍒. You cannot use the Bomb if you have no 🍒. </p>\n<p>If you collect 10 🍒 you will restore a ❤️. If you already have 4❤️ you will get points instead. After collecting 10 🍒 your stock will always reset.</p>\n\r\nScoring\r\n<p>Here are ways to score in the game:</p>\n<ul><li>Shooting down enemies will give you points. More dangerous enemies will give more points</li><li>Shooting down an attacking enemy will double the points you get</li><li>Collecting 10🍒 with 4❤️ will give you points</li><li>Destroying enemy bullets with the Bomb will give you points</li></ul>\n<p>The game will keep your highest score even if you close the browser. Post your best results in the comments below!</p>\n\r\nLearn How to Make This Game!\r\n<p>Cherry Bomb was created as part of a tutorial series about how to make your own game from scratch. If you also want to make a game like this check out the Lazy Devs Academy YouTube Channel!</p>\n\n\r\nCredits\r\n<p>This game was written and designed by Krystian Majewski, an Independent Developer and the host of the Lazy Devs Academy video channel.</p>\n<p>The music was composed by Sebastian Haßler, a music composer for film, TV and videogames.</p>\n<p>Cherry Bomb game was written entirely in Pico-8.</p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T07:28:36", "background_image": "https://media.rawg.io/media/screenshots/9bd/9bd2b2e46d5167fd5734e8f0b182d72e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Krystman"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}