{"id": 839628, "slug": "atlantis-moonlight-defense", "name": "Atlantis: Moonlight Defense", "name_original": "Atlantis: Moonlight Defense", "description": "<p>Build by day. Defend by night. Save Atlantis.</p>\n<p>(Play in fullscreen for the best experience)<br/></p>\r\nDescription\r\n<ul><li>Gather resources, build, and fortify to defend against the enemies which arrive every night. Enemies grow stronger each night.</li><li>Win by surviving five nights of attacks.</li><li>Lose if all your Town Centers are destroyed.</li><li>Gather resources using workers.</li><li>Town Centers are used to create workers and deposit resources.</li><li>To increase the population limit, build Huts and Town Centers.</li><li>Barracks produces hand-to-hand combat units: Swordsman, Magic Swordsman, Magic Chariot</li><li>Archery Range produces ranged combat units: Archer, Catapult, Magic Catapult.</li><li>Food, Wood, Stone and Gold need to be gathered by workers from mines.</li><li>Temple provides \"magic\" resource at a specific rate. Magic is also dropped by enemies when they die.</li><li>Towers fire at enemies.</li></ul>\n\r\nControls\r\n<ul><li>Use WASD or Arrow Keys to scroll the map.</li><li>Click to select a unit. Then click on a map location to move the unit, click on a mine to gather (Worker), or click on an enemy to attack.</li><li>Click on a build option and click on the map to start building.</li><li>You can then assign more workers to the same building to speed up.</li><li>I: Jump to next idle Worker.</li><li>C: Cancel selection</li><li>B: Ring Town bell. All workers assemble near the center of the map. Press B again to resume duties.</li><li>Space: Pause/Unpause game</li><li>Hold down Shift to select multiple units</li><li>Drag a rectangle on screen to select units</li></ul>\n\r\nCredits\r\n<ul><li>Art: Soulcole</li><li>Audio: Egorkin</li><li>Programming: Raghu</li></ul>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T08:52:45", "background_image": "https://media.rawg.io/media/screenshots/836/836ed5285e907fc316b277d87d67cb05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["raghunandan", "IDM", "Egorkin531"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}