{"id": 839636, "slug": "youll-never-walk-alone", "name": "Youll never walk alone", "name_original": "Youll never walk alone", "description": "<p><strong>STORY OF MADAME C. PEREZ</strong></p>\n<p>Madame C. Pérez, a 27-year-old woman, with dreams and goals since her childhood (one of her greatest desires was to work in a well-known company), which led her to follow paths of study at school, college , university, just to achieve one of his childhood dreams.</p>\n<p>When she turned 17, she entered the career that she longed for, but she led a life with many sacrifices, study and work, all in order to fulfill her most cherished dreams. Throughout her life as a student and worker, she carried a motto which allowed her to have more strength to achieve each and every one of her goals.</p>\n<p><strong>When you believe that the rules of society are wrong, the challenge is even greater.</strong></p>\n<p>Once she managed to get into work, Madame expected a different treatment than she was given, one of the internal rules that they put on her was that she would always have to wear a decent uniform as a woman, another rule was that she was not allowed to have different opinions to that of others, whether it be your boss, one of the oldest workers, etc.</p>\n<p>Days, months, years passed, and Madame C. Pérez decided to break the rules that were imposed on her throughout the work process, which she did not break before because she did not lose the opportunity to work in the company. Once she broke the erroneous rules imposed on her during her work, Madame C. Pérez managed to realize her dreams through her own company.</p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T08:55:32", "background_image": "https://media.rawg.io/media/screenshots/1fb/1fb17fe655efc05a8aaa06cff6843629.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NOEMI CARATA", "Jairo Puente"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}