{"id": 839748, "slug": "nursery-school-diaries", "name": "Nursery School Diaries", "name_original": "Nursery School Diaries", "description": "<p>Life as a nursery school teacher can be tough, but it's a rewarding job. What kind of little shenanigans will you be facing? Interact with the kids, and you might just become closer to their respective guardians.</p>\n\n\n<p>Cadell doesn't know how to stand up for himself. Everyone pushes him around, even his own son! His ex-wife, friends, and parents all think that he's not assertive enough. This is a huge win for Jack because he can make his dad buy him everything he wants.</p>\n\n<p>With a large age gap between them, older brother Aeron doesn't know how to interact with his little sister. Even though Linette wants to play with her brother, Aeron thinks toys are way too childish for him to be touching.</p>\n\n<p>Due to certain circumstances, Barry adopted Charlie. He may be a young single parent, but that won't stop him from trying his best to raise Charlie. Even though Barry is energetic, and his son is reserved, the two get along well. They bonded over their mutual love for superheroes.</p>\n\n<p>Gareth is a magician who is taking care of his niece, Nia. He often acts crazy and pulls childish pranks on people. Nia,  on the other hand, sees her uncle's magic tricks way too often that she thinks it's unimpressive. Sometimes she has to remind her uncle to stop being so weird.</p>\n\n<p>Wynn is a fellow teacher who'll be there to aid you in class! He's patient, and he knows how to handle kids well. Maybe... just maybe... you can be more than colleagues with him.</p>\n\n<p>-18 CGs</p>\n<p>-26K Words</p>\n<p>-Cute letters from the children and love interests</p>\n\n<p>Check out my upcoming comedy BL about farmers!  <strong>Odd Guy Meets Odd Farmers</strong> link: bit.ly/3PWMVor \r\n</p>\n<p>Or my upcoming medieval BL Dating Sim called <strong>Be My Loyal Subject</strong> link: https://bit.ly/3AacP1E</p>\n\n<p>Twitter: https://twitter.com/ChaniMK_VN\r\n</p>\n<p>Instagram: https://www.instagram.com/chanimk_vn/\r\n</p>\n<p>Support me on Kofi: https://ko-fi.com/chanimk or Patreon:  https://www.patreon.com/chanimk\r\n</p>\n<p>My website: https://chanimk19.wixsite.com/chanimk\r\n</p>\n\n<p>Editor: Taylor Morphis<br/></p>\n<p>Credits to Dova Syndrome(https://dova-s.jp/) for Music and Zapsplat(https://www.zapsplat.com/) for Sound Effects.<br/></p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T09:40:39", "background_image": "https://media.rawg.io/media/screenshots/f52/f52057d2fac6a545cb0464fd30abe7ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["ChaniMK"], "genres": [], "publishers": [], "esrb_rating": null}