{"id": 839903, "slug": "assignment-2-kit208", "name": "Assignment-2 KIT208", "name_original": "Assignment-2 KIT208", "description": "<p><strong>INTRODUCTION</strong>\n</p>\n<p>This application is an educational type of AR application that explains mathematical, that aims for the better understanding and helps to make a boring subject more interesting for new generation and decrease the mental pressure on students. i have also added a 3d object of pen to look the application attractive. There is movement in pen's position when we press the virtual button. I have attached two target images above.</p>\n<p> \r\n  </p>\n<p><strong>DESCRIPTION OF APPLICATION</strong>\n</p>\n<p>This application is about mathematical equations, and it can be used in math's classes where students find boring or difficult to learn the formula. By having a look on concept, the virtual expression.  In this application, student who is having difficulty in learning or understanding the x+y different formulas, can just study in interesting way by the representation target image as the expression and getting answer as the text image of the formula. Moreover, I have added a virtual button for teachers to use if they want to hide or show the formula to the students. This application gives a visual learning for mathematics, giving 3D and 2D view of mathematical equations and graphs.   </p>\n<p>This application uses visual c code for the virtual button interaction that will help tutors or teachers hide and display the formula. In this, application I have used Unity engine, Vuforia platform (it is a cross-platform Augmented Reality(AR)and Mixed Reality Application development having various feature for designing different AR applications), and c code. The phone will display the target image as shown in the recording and we will get the answers of equations and answers of graphs I forms of equations. I have used Target images, virtual buttons and I have also made the button moveable can be moved with movement of finger, making it slightly flexible for tutors in teaching. i have also used a 3d model of pen to make the application look more attractive for students and pen shows movement when we press the button.</p>\n<p> \r\n  </p>\n<p><strong>SIGNIFICANCE OF AR TECHNOLOGY IN APPLICATION</strong>\n</p>\n<p>With the help of use of AR interface, student will be more attracted to learn mathematical forms and moreover they will also get familiar with the graphical representation of different expression making it easier for teachers and moreover decreasing the pressure from students to learn different formulas.   Moreover, new generation and kids get bored after study mathematics and different formulas, but with the help of AR visual display they will be keen to learn new formula and will give them better understanding of mathematics. In many institutes, it may be easier for the teaching team as the harder part making students understand the formulas will be done by this application.\r\n  </p>\n<p> \r\n  </p>\n<p><strong>REFERENCES</strong>\n</p>\n<p>Here are the references to c code used for virtual button:   </p>\n<p>https://mylo.utas.edu.au/d2l/common/dialogs/quickLink/quickLink.d2l?ou=526208&amp;type=content&amp;rcode=UTAS-2871458\r\n  </p>\n<p> https://www.turbosquid.com/AssetManager/Index.cfm?stgAction=getFiles&amp;subAction=D...\r\n  </p>\n<p>https://mylo.utas.edu.au/d2l/common/dialogs/quickLink/quickLink.d2l?ou=526208&amp;type=content&amp;rcode=UTAS-3023907\r\n</p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-22T10:44:16", "background_image": "https://media.rawg.io/media/screenshots/3c9/3c9bf409aef63fd27963f9e7bc1b9e75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Utas_Manjot"], "genres": [], "publishers": [], "esrb_rating": null}