{"id": 8399, "slug": "might-and-mayhem-battle-arena", "name": "Might and Mayhem: Battle Arena", "name_original": "Might and Mayhem: Battle Arena", "description": "Bring the Mayhem. Fight for Might!<br/><br/>King Dragon's flames burned away the old realm, and his monsters rule the ashes. But an ember of hope still flickers, waiting for the right hero to rekindle it: You!<br/><br/>Get ready for Might &amp; Mayhem, an arcade-style battle strategy game with live PvP battles and epic single-player quests. Assemble your team of knights, bandits, wizards, goblins, robots and monsters, and strike out for adventure. Create new strategies with different fighter combinations and customize your troops with battle-changing items to destroy the competition and loot them for treasure.<br/><br/>Conquer the Lost Kingdom and defeat King Dragon to save the realm, and become a Legendary Hero. Glory is YOURS for the taking!<br/><br/>PLEASE NOTE! Might &amp; Mayhem is completely free to download and play. Some game items, however, can be purchased for real money. If you don’t want to use this feature, please disable in-app purchases in your device’s settings.<br/><br/>Features:<br/><br/>◘ BATTLE your friends and foes in live PvP battles <br/>◘ QUEST for glory with single-player missions and epic boss fights <br/>◘ LOOT enemies for gold and lost treasure <br/>◘ CREATE an army of heroes from across the realm <br/>◘ EXPLORE the Lost Kingdom in stunning 3D environments <br/>◘ EVOLVE your troops from scrappy fighters to elite warriors <br/>◘ CUSTOMIZE fighters by equipping battle-changing items <br/>◘ DISCOVER new strategies with different fighter combinations", "metacritic": null, "released": "2014-10-14", "tba": false, "updated": "2019-10-22T14:29:53", "background_image": "https://media.rawg.io/media/screenshots/5d5/5d5d1de44ada38a2920e565f37972251_gz3oL9R.jpg", "website": "http://www.mightandmayhem.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiz Studios"], "genres": ["RPG", "Strategy"], "publishers": ["Kiz Toys"], "esrb_rating": "Everyone 10+"}