{"id": 840227, "slug": "baskerville", "name": "Baskerville (itch)", "name_original": "Baskerville (itch)", "description": "<p>Sherr-Lok Holmes is not intrigued by a centuries-old legend in which every male of the wealthy Baskerville family that has committed a crime is found dead soon after. Nevertheless, he sends Jonn Watt-Sun to the estate to investigate, Peter Baskerville is grateful for his help but with loud howls, threatening notes and suspicious people all surrounding him, Baskerville wonders if he really is the last of the cursed family.</p>\n<p>A traditional Sherlock Holmes novel gets a scientific facelift for fans of detective dramas. The experience is the first of its kind to adapt and re-imagine the Arthur Conan Doyle story The Hound of the Baskervilles (1902) for PC. The experience is not all about the detective as interaction with many interesting characters takes place with decisions and hidden secrets to be discovered.</p>\n<p> Comprising a 30-page script, it takes around 2 hours for an average reader to complete the storyline with variations depending on reading skill. Every so often, a decision needs to be made which can affect the story, the wrong choice can lead to consequences. </p>\n<p>Created as part of a master's degree at USW  in game design</p>\n<p>This project is in early access with template characters generously borrowed from the visual novel InfiniteStars and a range of royalty-free music until I can continue development post-degree.</p>", "metacritic": null, "released": "2022-08-20", "tba": false, "updated": "2022-08-22T13:11:34", "background_image": "https://media.rawg.io/media/screenshots/89f/89fc26b98cff8b98bf6e6e6b4b6f964c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["cameronkeywood"], "genres": [], "publishers": [], "esrb_rating": null}