{"id": 84024, "slug": "eye-makeup-salon", "name": "Eye Makeup Salon", "name_original": "Eye Makeup Salon", "description": "In this salon game, you will get trendy makeup ideas to make your eyes really sparkling! Practise in a real eye makeup salon and become a top makeup artist. Help your models achieve a fabulous look: natural, smoky, pastel or glamorous, depending on the occasion.<br/><br/>Firstly, choose from 4 different models, brunette, blonde, red or black-haired woman. Start applying makeup, first one eyelid then the other. Fix the messy eyebrows with pink tweezers and color them with a pencil. Fulfill your dream of naturally long and curved eyelashes using special mascaras. Every kind of eyelashes can be combined with more than 10 different colors. Apply the best eye shadow on your girl's eyes and add colorful stickers and glitters. Shiny lenses will be a perfect final touch. You can use an eye makeup remover at any time.<br/><br/>Use your magic fingers and do the best eye makeover.<br/><br/>Features:<br/>• interesting game appropriate for girls and women of all ages<br/>• simple gameplay with beautiful HD graphics<br/>• 4 different girl models<br/>• various professional makeup and cosmetics tools<br/>• a lot of stickers and glitters to combine<br/>• trendy makeup ideas for various occasions (wedding, prom, birthday party, cinema night)<br/>• free your creativity", "metacritic": null, "released": "2015-04-13", "tba": false, "updated": "2019-10-22T13:56:43", "background_image": "https://media.rawg.io/media/screenshots/fab/fabad6e986e9998567ad48c1e3913e7b.jpg", "website": "http://www.bubadu.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pilcom"], "genres": ["Simulation", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": "Everyone 10+"}