{"id": 840287, "slug": "urban-mist", "name": "Urban Mist", "name_original": "Urban Mist", "description": "<p><em>In the lands of Roran</em><em> different races lived freely until the arrival of </em><em>the Fall</em><em>, which brought dangerous and illintendet entities into the world to wreak havoc. These otherworldly entities were named </em><em>Means</em><em> and included fiends from sentient monsters to eldritch flowers. </em><em>The Fall’s</em><em> one quite notable oddity is its ability to manifest cursed mist that can envelop entire countries and regions under its darkness. The cursed mist homes the greatest of dangers and welcomes those who enter it with a quick end. </em><em>Veil</em><em> is one of many names the mist has, and its might has stranded people into countless colonies throughout the land. There are organizations that seek to reconquer the lost land and fight back, while some individuals have a mysterious attunement to the </em><em>Veil</em><em>.</em><br/></p>\n<p><em>The people and countries of </em><em>Roran</em> <em>have achieved great milestones in the ways of science, getting to enjoy the miracles of electricity, automobiles, modern medicine and radio communication. Alloys, plastics and man-made fibers make up the used weapons and equipment as material. These advancements are widely welcomed for their benefits, but some people still resent them and long for </em><em>the Old ways</em><em>.</em>\n</p>\n\n<p>Urban Mist is a Roguelike RPG, where you can fight your way through creatures of Means, gather up weapons and equipments, explore the urban fantasy world of Roran and seek out the one behind it all.</p>\n<p>This is a Demo version made during a university course on game design basics in Unreal Engine.</p>\n<p>We hope you enjoy our little game. The Fall awaits...</p>", "metacritic": null, "released": "2022-08-20", "tba": false, "updated": "2022-08-22T13:38:13", "background_image": "https://media.rawg.io/media/screenshots/99c/99c60a340407bd7fe8a7b7b7c397eeae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mythninja"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}