{"id": 840261, "slug": "hakkenkast-zx-spectrum", "name": "Hakkenkast (ZX Spectrum)", "name_original": "Hakkenkast (ZX Spectrum)", "description": "<p>Hakkenkast is a top-down dungeon crawler for the Sinclair ZX Spectrum.</p>\n<p>It’s designed as an arcade adventure and can be played with 4 directional keys and a single fire key - so it works great with Kempston &amp; Sinclair joysticks.  </p>\n<p>Keys are fully redefinable from the main menu.</p>\n<p>To get started, use Q &amp; A (Up and down) and Space (fire) on the main menu to select your preferences.</p>\n<p>There are four dungeons to explore, each one is a full game in its own right. At the end of a dungeon you will be given an access code that you can use on the next one to carry player attributes across.  You should play the dungeons in order.   Have fun! Now, go kill some monsters!!!</p>\r\nThe Story\r\n<p>You are Hakkenkast, a mighty warrior renowned for your skills with the Sword, but you seek more.</p>\n<p>Having visited the Elders of Eldritch, the legnedary magical Knights, you are taught your first spell, a Magic Missile that you can conjure.</p>\n<p>You are told of the legendary lost spells of Eldritch that are enshrined in spellbooks stolemn by the Sorcerers of Hussey. The Spellbooks have been hidden deep within four dungeons in the Land of Mercya.</p>\n<p>The Elders, wanting to preserve their order set you on a quest to recover the Spellbooks, as you find them, your magical powers will improve.</p>\n<p>You are sent to the Dungeon of the Undead to recover the first Spellbook, find it, escape and learn its magic...</p>\r\nControls\r\n<p>KEYS (Redefinable):</p>\n<p>Up - Q</p>\n<p>Down - A</p>\n<p>Left - O</p>\n<p>Right - P</p>\n<p>Swing Sword - Space (tap)</p>\n<p>Cast Spell - Space (hold)</p>\n<p>Additional features:</p>\n<p>Pause - H</p>\n\r\nCredits\r\n\n<p>Game design, programming &amp; graphics: Bruce Groves</p>\n<p>MPAGD: Jonathan Cauldwell</p>\n<p>MPAGD Musicizer: Davud Saphier</p>\n<p>Music: Yerzmyey</p>\n<p>Loading Screens: Kevin McGrorty</p>\n<p>Testing: Andre Leao</p>\n<p>Additional Thanks: Quantum Sheep, Davey Sloan, Kees van Oss</p>\n<p>Website: minilopretro.com</p>\n<p>More Games: minilop.itch.io</p>\n\r\nDEMO VERSION\r\n<p>You can try the demo version for free, but it only contains 1 dungeon, purchase the full version to get all 4 dungeons and complete your quest!</p>", "metacritic": null, "released": "2022-08-20", "tba": false, "updated": "2022-08-22T13:27:33", "background_image": "https://media.rawg.io/media/screenshots/0ab/0ab28bd333b15ca3f10ea3f4793586e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Minilop"], "genres": ["Action"], "publishers": [], "esrb_rating": null}