{"id": 84036, "slug": "pets-hair-salon-2", "name": "Pet's Hair Salon", "name_original": "Pet's Hair Salon", "description": "Lovely pets are sitting in front of a mirror and waiting for new, funky haircuts. Bears, cats, dogs and rabbits want to be real movie stars at least for one day. Design creative hairstyles for your customers before the curtains close.<br/><br/>Start with washing pet's hair, use shampoo and shower and then dry it with towel and hairdryer. Comb the messy hair and cut it with scissors and shaver, like a barber. You will have fun making pet's hair stand on end. If you want curly or straight hair, use professional tools such as curling iron, hair straightener, hair curler and hair restorer, like magic wand. Color the hair in a variety of 12 cool sprays, from basic to the fashionable rainbow palette.<br/><br/>After taking a haircut you can beautify your customers with accessories for all occasions: bows, hairpins, tiaras, hats, glasses. And don't miss to add the final touch with clothes. Also, don’t forget to decorate the showroom before the photo shooting. <br/><br/>Now, your pet is ready for the dreamlike snapshot. Everyone will love this pets hair makeover game.<br/><br/>Features:<br/>• beautiful HD illustrations<br/>• bright and vivid colors<br/>• funny sound effects<br/>• cute characters with different face expressions<br/>• 12 different color sprays, 24 accessories and 18 clothes to combine<br/>• professional tools<br/><br/>FOR PARENTS<br/>This game is free to play but certain in-game items may require payment via in-app purchase. Please check your device settings for more detailed parental options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our sites, apps or third-party sites.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": "2015-01-06", "tba": false, "updated": "2019-10-22T14:22:07", "background_image": "https://media.rawg.io/media/screenshots/4ae/4ae582582b852367082690de23c4721e.jpg", "website": "http://www.bubadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pilcom"], "genres": ["Simulation", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": "Everyone 10+"}