{"id": 84046, "slug": "the-ten-commandments-of-god", "name": "THE TEN COMMANDMENTS OF GOD.", "name_original": "THE TEN COMMANDMENTS OF GOD.", "description": "From the very NEW, Mobile Entertainment Products startup<br/>JOHNAVATAR.com™ ...comes...<br/><br/>THE TEN COMMANDMENTS OF GOD<br/>(Interactive Image and Audio) - Hear the words spoken by GOD himself and see an accurate image of the two Stone Tablets, with those words were etched onto them These words are recognized as a moral foundation in Judaism, Christianity, and their substance also figures in Islam. <br/><br/>This APP is universal and works on iPad, iPhone and iPod Touch. <br/><br/>This App contains a very accurate representation of the Stone Tablets, Moses brought down from the mountain.<br/><br/>This App contains spoken words, of the highest quality audio, in stereo, complete with angels. Perfect for presenting to anyone, a television audience, or over a large Church, or theatre sound system and will absolutely catch the attention of everyone. <br/><br/>On the iPad, this App will definitely get their attention (if only Moses had an iPad)! <br/><br/>(This app is the same as and has replaced \"X COMMAND\".  DO NOT DOWNLOAD THIS IF YOU ALREADY HAVE \"X COMMAND\", UNLESS YOU WANT THIS SLIGHTLY DIFFERENT VERSION?!)<br/><br/><br/>Exclusively from John Avatar™. <br/><br/>JOHNAVATAR.com™ <br/>Silicon Beach, California 90402<br/>USA<br/><br/>Website:  http://www.johnavatar.com<br/><br/><br/>The Ten Commandments <br/>(Exodus 20:2-17)<br/><br/>1)  “I am the Lord your God, who brought you out of the land of Egypt, out of the house of bondage. You shall have no other gods before Me.”<br/><br/>2)  “You shall not make for yourself a carved image, or any likeness of anything that is in heaven above, or that is in the earth beneath, or that is in the water under the earth; you shall not bow down to them nor serve them. For I, the Lord your God, am a jealous God, visiting the iniquity of the fathers on the children to the third and fourth generations of those who hate Me, but showing mercy to thousands, to those who love Me and keep My Commandments.”<br/><br/>3)  “You shall not take the name of the Lord your God in vain, for the Lord will not hold him guiltless who takes His name in vain.”<br/><br/>4)  “Remember the Sabbath day, to keep it holy. Six days you shall labor and do all your work, but the seventh day is the Sabbath of the Lord your God. In it you shall do no work: you, nor your son, nor your daughter, nor your male servant, nor your female servant, nor your cattle, nor your stranger who is within your gates. For in six days the Lord made the heavens and the earth, the sea, and all that is in them, and rested the seventh day. Therefore the Lord blessed the Sabbath day and hallowed it.”<br/><br/>5)  “Honor your father and your mother, that your days may be long upon the land which the Lord your God is giving you.”<br/><br/>6)  “You shall not Kill.”<br/><br/>7)  “You shall not commit adultery.”<br/><br/>8)  “You shall not steal.”<br/><br/>9)  “You shall not bear false witness against your neighbor.”<br/><br/>10)  “You shall not covet your neighbor's house; you shall not covet your neighbor's wife, nor his male servant, nor his female servant, nor his ox, nor his ass, nor anything that is your neighbor's.”", "metacritic": null, "released": "2010-09-02", "tba": false, "updated": "2019-10-22T14:22:06", "background_image": "https://media.rawg.io/media/screenshots/fdd/fdd4d113c1148e82f80b84d22b651b3f.jpg", "website": "http://www.johnavatar.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["John Avatar"], "genres": ["Adventure", "Family"], "publishers": ["John Avatar"], "esrb_rating": "Everyone 10+"}