{"id": 840412, "slug": "kit724-assignment-2-vr", "name": "KIT724 Assignment 2 - VR", "name_original": "KIT724 Assignment 2 - VR", "description": "<p><strong>Introduction </strong><br/></p>\n\n<p>My application is an experience game that simulates extreme fear of abandoned scenes, to treat players' fear of abandoned scenes. The scene I designed was an abandoned private hospital. In this hospital, there are some different rooms such as toilet, bathroom, operating room and living room. Players can grab some items in the game, such as cups and wheelchairs, and put them in another place. Players can also turn on and off the lights on the walls of each room.</p>\n<p><strong>Description of the application</strong></p>\n<p>The application software I designed focuses on the player experience. I designed an abandoned scene in the app with some elements that interact with the VR device. The benefit of the abandoned scene experience is that it puts the player in a scary scene and slowly overcomes that fear. But in real life, players are in a situation they are not afraid of, such as at home. In ordinary computer games, the abandoned scene is just a screen, and players cannot feel the terrifying scene, but with the technical support of VR, the player not only faces the screen but is in the middle of the scene displayed on the screen.\r\n</p>\n<p>First, I've chosen a Fear scene where people with extreme or irrational fears of defunct scenes may find themselves unable to function properly. If ordinary technology is used, such as an abandoned scene in a computer game, the scene will only be displayed on the screen, and players cannot really experience the fear of being in an abandoned scene. But VR equipment can let players experience the state of being in an abandoned scene. Second, I define a player as someone who has an extreme or irrational fear of defunct scenarios. Players must walk around in the old scene and pick up objects in the scene to move to other locations or switch the lights on and off in the scene, to overcome the fear. This is the use of low-level exposure therapy, exposing the patient to a background of fear without causing any danger.\r\n</p>\n<p> The interface scheme of my application calls for creating a unique player experience scene where the player can walk around, and where the player can see his hands and perform some actions with them. For this, the appropriate interface technology I have chosen is VR technology. This technology allows players to have an immersive experience and simulates the player's hands-on operation through the VR handle to enhance the player's experience of visual and physical interaction.</p>\n<p><strong>Interaction Design</strong></p>\n<p>First, I created a storyboard for my design. In the scene of an abandoned private hospital, players will first appear in a room when they enter the game.\r\n</p>\n<p>1. Remove the obstacle wheelchair in the scene\r\n</p>\n<p>2. Turn on the lights on the wall\r\n</p>\n<p>3. Go and see what's in each room\r\n</p>\n<p>4. Pick up the cup on the cabinet in the room\r\n</p>\n<p>In the above scenario, removing the wheelchair requires the player to use the VR handle (hands in the game) to operate. The player presses the button on the side of the handle to grab the wheelchair and releases the button when the wheelchair moves to the desired position. The player puts the hand in the game on the switch on the wall, presses the button on the side of the handle, the light will change colour, and when the button is pressed again, the light will return to the initial set colour. When the player sees the cup, he or she can also grab and move the cup in the same way as grabbing the wheelchair.</p>\n<p>In addition, the use of VR technology can reduce the cost of realistically constructing abandoned scenes. When players feel scared, they can immediately remove the VR device and exit the game screen without adverse consequences or any danger to the player.\r\n</p>\n<p><strong>Technical Development</strong></p>\n<p>This program requires the use of a specific interface technology Oculus to operate. Through the Oculus controller, players can grab objects and move them to other positions, and players can also change the colour of room lights by controlling switches on the wall using the right hand controller.</p>\n<p><strong>Descriptions of 3D Models </strong>   </p>\n<p>This program requires the use of a specific interface technology Oculus to operate. Through the Oculus controller, players can grab objects and move them to other positions, and players can also change the colour of room lights by controlling switches on the wall using the right hand controller.\r\n</p>\n<p>All the models in my program are from Abandoned Asylum's assets, which are used in various rooms in the abandoned hospital, such as operating rooms with operating lights and desks,  and cups.\r\n</p>\n\n<p><strong>References</strong></p>\n<p>All the models are from Abandoned Asylum(https://assetstore.unity.com/packages/3d/environments/urban/abandoned-asylum-49137).\r\n</p>\n<p>All interactions use Oculus integrated features.</p>", "metacritic": null, "released": "2022-08-20", "tba": false, "updated": "2022-08-22T14:30:47", "background_image": "https://media.rawg.io/media/screenshots/258/25899f8081e48d212af249605937fc4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["xzheng13"], "genres": [], "publishers": [], "esrb_rating": null}