{"id": 840414, "slug": "towers-and-powers", "name": "Towers and Powers", "name_original": "Towers and Powers", "description": "It isn’t easy being a god, even during peacetime. You have to lead and support your people, help them with the harvest, and encourage their growth… all without them noticing you. But what if your lands are on the edge of a cliff? What if your people approach a whirlpool while being attacked by a horrible, mysterious monster? Well, when that happens, it’s time for you to display all your power and intelligence!<br/><br/><br/><br/>When you play Towers &amp; Powers you’ll find yourself in an ancient land surrounded by the beautiful landscape, elegant buildings, mythical creatures and… chaos! These gorgeous places are under attack! As one of the gods, you’ll have to save your residents and keep their islands from sinking. But the rules forbid you from intervening directly… So what can you do? Only one thing is left: take your powers in your hands!<br/><br/><br/><br/>In Towers &amp; Powers, you’ll create your own teams of peasants, priests, warriors and magicians, decide which buildings they need, use your powers to defend allies and trap foes. Awaiting you on your island you’ll find economic and military tasks to accomplish, exciting battles and travels to undertake, and loyal worshippers, cruel enemies and monsters to encounter. Are you ready to start your divine journey? Play Towers &amp; Powers right this minute!<br/><br/><br/><br/><ul><li>Tower defense in VR! <br/></li><li>Play standing or sitting, alone or with your cat next to you!<br/></li><li>Inspect the battlefield from every perspective!<br/></li><li>Build towers that combine different types of units!<br/></li><li>Use your units not only in towers but also on battlefields!<br/></li><li>Accumulate mana and cast spells with your very own hands!<br/></li><li>Build barricades to hold back enemies!<br/></li><li>Become a real powerful god!</li></ul>", "metacritic": null, "released": "2022-08-20", "tba": false, "updated": "2023-12-18T06:11:18", "background_image": "https://media.rawg.io/media/screenshots/d1d/d1d8831766e7ec1945ff69fd643a6c80.jpg", "website": "https://www.jetdogs.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jetdogs Studios", "Tasty Ink Games"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["VRkiwi"], "esrb_rating": null}