{"id": 840527, "slug": "necropolis-itch-littlebeardman", "name": "Necropolis (itch) (LittleBeardMan)", "name_original": "Necropolis (itch) (LittleBeardMan)", "description": "<p><strong>Necropolis </strong>is a turn-based rogue-like where you must plan your turns and manage resources as you journey deeper and deeper into the <strong>Necropolis</strong>. Find the heart of the endless maze and kill the Lich that resides there.</p>\n\n<p>Controls:</p>\n<p><strong>Arrow keys:</strong> Move your character. Moving into an enemy attacks it, and moving over an item automatically picks it up (If you are able to).</p>\n<p><strong>Space bar:</strong> Select menu options.<br/></p>\n<p><strong>Escape key:</strong> Pause the game or cancel a selection.<br/></p>\n<p><strong>Z key: </strong>Pass your turn. Enemies only move when you move, so use this to your advantage.<br/></p>\n<p><strong>Number keys (1-4): </strong>Use the glyph in your corresponding inventory slot.<br/></p>\n<p><strong>Shift key:</strong> View enemies' health and power<br/></p>\n\n<p>Various weapons can be found inside the Necropolis. Use them to cut down the undead horde. Weapons have limited uses and will be destroyed when their durability reaches zero. </p>\n<p><strong>Swords:</strong> Higher base durability than other weapons<br/></p>\n<p><strong>Daggers:</strong> Daggers have double damage while you are not spotted by any enemies<br/></p>\n<p><strong>Rapiers: </strong>Walking towards an enemy while there is one space between you and them will cause you to <strong>lunge</strong> towards them. This will perform a free attack that does not use durability.<br/></p>\n<p><strong>Hammers:</strong> Striking an enemy with a hammer will knock them back one space. If there is something blocking them from being knocked back the hammer will deal double damage.<br/></p>\n\n<p>Glyphs can be found throughout the Necropolis. They have single-use effects which are randomized each run. Possible glyph effects are:</p>\n<p><strong>Glyph of Plenty:</strong> Restores 2 health and spawns up to 6 pieces of bread throughout the current floor. Bread restores 1 health when picked up.<br/></p>\n<p><strong>Glyph of Strength: </strong>Permanently increases your base power by 1.<br/></p>\n<p><strong>Glyph of Weapon:</strong> Fully repairs your equipped weapon. If you do not have a weapon equipped, you will equip an Iron Sword instead.<br/></p>\n<p><strong>Glyph of Lightning:</strong> Strikes all enemies with lightning and deals 2 damage to them.<br/></p>\n<p><strong>Glyph of Explosion:</strong> Sends out an explosion in all four cardinal directions, which deals 5 damage to any enemies caught in it. The explosion will stop when it collides with a wall<br/></p>\n\n<p>External Resources Used:</p>\n<ul><li><strong>VHS and CRT monitor effect</strong> by pend00 (godotshaders.com)</li><li><strong>Chiptone</strong> for sfx by SFBGames (Itch.io</li></ul>", "metacritic": null, "released": "2022-08-19", "tba": false, "updated": "2022-08-22T15:21:14", "background_image": "https://media.rawg.io/media/screenshots/0d2/0d2dac53ecb5ff61efcc4b6670e75f94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LittleBeardMan"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}