{"id": 84052, "slug": "builder-games", "name": "Builder Games", "name_original": "Builder Games", "description": "It's your turn to run the coolest handyman’s workshop. Enjoy this building experience and prove yourself to be an excellent construction worker.<br/> <br/>Customers are standing in a queue to get your best products and services. You can do activities like digging the soil, building or demolishing houses and towers, constructing wood products, cutting wood, welding and other fun things. Make what customers ordered using different building materials, tools and machines to achieve greatest results. A good name is better than riches!<br/> <br/>• Woodworking: Cut the wood accurately with different saws. Construct a chair, bench, fence, birdhouse or doghouse with a hammer or screwdrivers. Put the finishing touch to the new wood product by polishing and painting it.<br/>• Build the tower: Build an apartment or business tower with the help of a crane which can lift heavy loads. If some parts are not appropriate for the kind of tower you are building, put them on the assembly line and pick the right building part.<br/>• Build the house: Pick builders tools and avoid toys and candies in the fun Catcher mini-game. Then build a house by adding windows, walls, a door, a balcony, stairs and a roof to make it a dream house.<br/>• Demolish the tower: Sometimes an old building needs to be pulled down to make way for a new one. Use a hammer, pneumatic hammer, TNT box and wrecking ball. You will enjoy demolishing buildings in the middle of the city.<br/>• Welding: Damages and holes have to be fixed. When you finish brushing the iron construction or leaky pipes in a customer’s house, don’t forget to use a welding mask before welding!<br/>• Warehouse: You are getting so many orders! Pick up the phone! Customers want to order building material. Follow the shopping list, use a fork-lift and load a truck with boxes.<br/>• Timber cutting: To get wood for your constructions, first chop timber with a chainsaw or a hatchet in the Timberman mini-game. Then move all the logs with a crane and cut them with the circular saw.<br/>• Construction site: Be the head of the building site and roll up your sleeves. To fill the holes with soil, dig up the material with a digger, take a truck to transport it and use a road roller to flatten it.<br/>• Tile art: Remove all the cracked tiles using different hammers, pour enough adhesive over the floor to lay new tiles and solve an animal puzzle in the meantime.<br/> <br/>Complete all fun challenges and be the boss builder in your town!<br/> <br/>Features:<br/>• easy-to-use game with a friendly interface<br/>• many mini-games and creative possibilities<br/>• over 50 different tools and building materials<br/>• play and learn how things are made<br/>• beautiful graphics and special sound effects<br/>• earn coins to use entertaining tools<br/><br/>FOR PARENTS<br/>This game is free to play but certain in-game items may require payment via in-app purchase. Please check your device settings for more detailed parental options regarding in-app purchases.<br/>The game contains advertising for Bubadu’s products or some third parties which will redirect users to our sites, apps or third-party sites.<br/><br/>Privacy policy: https://bubadu.com/privacy-policy.shtml<br/>Terms of service: https://bubadu.com/tos.shtml", "metacritic": null, "released": "2016-07-11", "tba": false, "updated": "2019-10-22T14:22:07", "background_image": "https://media.rawg.io/media/screenshots/282/282ce8688bba2e1540c3c49ed3d25201_NFkiAGo.jpg", "website": "http://www.bubadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pilcom"], "genres": ["RPG", "Educational", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": "Everyone 10+"}