{"id": 840634, "slug": "humankind-itch", "name": "HumanKind (itch)", "name_original": "HumanKind (itch)", "description": "<p><strong>Pequeña Sinopsis:</strong><br/></p>\n<p>2201 fue cuando todo lo que conocemos como sociedad humana se vino abajo, todo el ecosistema colapsó, el calentamiento global consumió el planeta, la capa de ozono está en su límite, los polos se derriten, con el tiempo se ven cada vez menos árboles y la fauna prácticamente extinta.</p>\n<p>Todo comenzó cuando el mundo se vio afectado por una guerra entre las grandes potencias, el día a día se fue asociando a que siempre hubiera guerra, esto dando paso a un consumo excesivo de recursos por parte de la población, por lo que las compañías se apropiaron de muchos recursos naturales y en la guerra también se destruyeron muchos, ya que pasaban por cualquier lugar sin importar que hubiera.</p>\n<p>La guerra perduró por muchos años, así mismo la fabricación de productos por exigencia. Pero el hecho más importante que marcó el fin de una tierra habitable fue cuando se iniciaron los ataques nucleares y biológicos, destruyendo ciudades en un instante e infectando poblaciones como si nada. Esto dando paso a radiaciones en humanos y seres vivos, lo que conllevo a mutaciones extrañas alrededor de todo el mundo. La sociedad empezó a caer dando paso a problemas y guerras civiles, en la lucha por la subsistencia individual. </p>\n<p>Ahí es donde aparecí yo… WRA-3.600 y ¡aquí es donde comienza mi historia!</p>\n<p><strong>Algunas mecánicas base: </strong></p>\n<p>-Movimiento (Caminar)</p>\n<p>-Disparar </p>\n<p>-Locke and Key</p>\n<p><strong>Core Game Loop:</strong></p>\n<p>El juego consiste en ir explorando el mapa en busca de llaves para poder abrir puertas, que nos llevan a los siguientes niveles. De igual manera hay que ir derrotando enemigos en el trayecto.</p>\n<p><strong>Equipo de trabajo:</strong></p>\n<p>-Kenneth</p>\n<p>-Gabriel</p>\n<p>-Julian</p>\n<p>-Justin</p>", "metacritic": null, "released": "2022-08-19", "tba": false, "updated": "2022-08-22T16:07:27", "background_image": "https://media.rawg.io/media/screenshots/ba4/ba4671e7e28dc5b10a8824d805aa6ebb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["TheChosenGB"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}