{"id": 840660, "slug": "lights-out-itch-jt-jg-games", "name": "Lights Out (itch) (JT JG Games)", "name_original": "Lights Out (itch) (JT JG Games)", "description": "LIGHTS OUT - THE GAME\r\n<p>Escape from the shadow that is coming for you as soon as the lights go out...</p>\n<strong>STORY:</strong>\n<p>For months, your new boss has been annoying his staff, including you with a new system to save some energy, therefore making the company more \"green\": Limited power during night shifts. That way, the employees are forced to save energy and turn the lights off when they leave a room if they don't want to end up with no power for the whole night. The thing is, nobody has seen the warehouse covered in darkness before and that was probably a good thing because only now does the staff notice a black figure that seemingly only exists in the dark. And it's getting closer. Nobody has risked to let it touch them yet and that's probably for the better. Now it's your first night shift under these circumstances. That's when the creature starts to play games with you. Good Luck.</p>\n<strong>GAMEPLAY:</strong>\n<p>Your main objective is to collect 10 keys to unlock the exit. Once you enter a dark room, the monster will appear and start to chase you, so you have a limited time to find the lightswitch. Some rooms feature flickering lights that will turn on and off every few seconds. Some rooms require you to analyze the monsters behaviour to act. With the right strategy, you can finish the game fairly easily.  </p>\n<p>Tip: Examine every room very precisely, so you don't miss any keys, going back could be deadly!</p>\n<p>Tip 2: Keep an eye on the power bar, turn off lights you don't need anymore, once the power is used up, you're as good as dead!</p>\n<strong>CREDITS:</strong>\n<p><strong>Game (Game Design, Programming, 3d Art, Sound Design, Music): </strong>BowserJ</p>\n<p><strong>Textures: </strong>CC0 Textures<br/></p>\n<p><strong>Key Sprite: </strong>TheUnique1<br/></p>\n<p><strong>Special Thanks: </strong>Zomlord, Master Nando<br/></p>\n<p><strong>Made in 3 weeks for a Game Dev Challenge between Zomlord and BowserJ</strong><br/></p>\n<p><strong>GAME PUBLISHED BY JT JG GAMES</strong><br/></p>", "metacritic": null, "released": "2022-08-19", "tba": false, "updated": "2022-08-22T16:23:09", "background_image": "https://media.rawg.io/media/screenshots/6c4/6c49e0281d6b1d75a28b687854fc7de7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["JT JG Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}