{"id": 840784, "slug": "killer-klowns-from-outer-space-the-game", "name": "Killer Klowns from Outer Space: The Game", "name_original": "Killer Klowns from Outer Space: The Game", "description": "<p>Killer Klowns from Outer Space: The Game is an asymmetrical multiplayer horror based on the iconic ‘80s film. In the battle between Killer Klowns and citizens of Crescent Cove, team up and use your wits to harvest humans or save them from the alien invasion!</p>\n<p>Take on a role of the iconic Killer Klowns – cooperate in a team of three, utilize outlandish abilities, hunt humans with zany weapons, and plan your own alien invasion to successfully harvest the population of Crescent Cove.</p>\n<p>Fight back as a team of seven brave citizens of Crescent Cove – pick your class, explore the city for valuable loot and weapons, avoid getting captured by Klowns, and try to survive – or sabotage – the alien invasion.</p>\n<p>Crescent Cove is a sprawling arena for unique 3v7 fights between Klowns and humans – boasting various locations, randomly generated map layout and a multitude of tactical opportunities for both teams.</p>\n<p>Unique approach to hide-and-seek gameplay, customization &amp; respawn systems, PvPvE, dynamic objectives leading to multiple match results – Killer Klowns evolves the online horror formula in new ways.</p>\n<p>COMING SOON<br />\nMore challenges, more maps, more characters, more ways to play - we have some very exciting things planned for post-launch, so stay tuned!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-06-09T07:05:05", "background_image": "https://media.rawg.io/media/screenshots/12b/12b5a025c74daf6778b9cb07557b0a4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 5, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 295, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Teravision Games"], "genres": ["Action"], "publishers": ["Good Shepherd Entertainment"], "esrb_rating": null}