{"id": 840772, "slug": "mischief-war", "name": "Mischief War", "name_original": "Mischief War", "description": "<p>◇Synopsis◇</p>\n<p>The main character&#39;s family moved to a small remote island due to her husband&#39;s work.<br />\nThe main character (wife), who was also a teacher on the main island, decided to become a teacher at the only school on this remote island.<br />\nBut! There was a student who was an outrageous mischievous boy!!<br />\nFurthermore! On this island where there are few young people and few women,<br />\nThe main character, a beautiful teacher, was the object of curiosity even among the adults on the island!</p>\n<p>Will the main character&#39;s family be able to live happily on a remote island full of hazards...!?</p>\n<p>A lewd comedy from yesteryear!<br />\nA long time ago... No, a good old lewd gag manga from about two years ago.<br />\nThe story progresses with an homage taste.<br />\nStudents&#39; erotic pranks. The adults around them react to it.<br />\nThe mischief escalates more and more, and eventually all the people on the island<br />\nI&#39;m going to set up a ridiculous prank.<br />\nThe basics are cuckolding, but you can play casually and happily without feeling tragic.<br />\nPlease enjoy it without thinking too much about it.</p>\n<p>◆ Cuckold!<br />\nRather than a specific person, all the residents of the island are poisoned by mischief,<br />\nThe hero falls into pleasure.</p>\n<p>◆Zapping system!<br />\nSometimes from the husband&#39;s point of view, sometimes from the son&#39;s point of view, the scene where the main character (wife) cannot be seen will be advanced.<br />\nWhat was going on behind the scenes...<br />\nI&#39;m sure my wife knows that....</p>\n<p>◆There are no battle elements or mystery-solving elements in this work!<br />\nYou can enjoy the adult scene without any hassle.</p>\n<p>◆ Proportion of adult scenes!<br />\nThere are more scenes with adults on the island than event scenes with students.<br />\nThere are more scenes after being cuckold than before.<br />\nPlease think that it is a real work after being taken down.</p>", "metacritic": null, "released": "2017-02-05", "tba": false, "updated": "2022-08-23T15:50:09", "background_image": "https://media.rawg.io/media/screenshots/5f5/5f5fdc772c1a369bf216f1cd3627befb.jpg", "website": "https://www.dlsite.com/maniax/work/=/product_id/RJ189682.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["RPG", "Casual"], "publishers": [], "esrb_rating": null}