{"id": 840788, "slug": "the-finals", "name": "The Finals", "name_original": "The Finals", "description": "<p>GOT WHAT IT TAKES?<br />\nViewers at home, here&#39;s the news you&#39;ve been waiting to hear: THE FINALS is accepting new contestants, and that means YOU! That&#39;s right, soon the world could be watching YOU tear apart our newest dynamic arenas and seize everlasting fame!</p>\n<p>As you know, THE FINALS is the world&#39;s greatest free-to-play combat game show! Our contestants plug in to our virtual world and join teams in escalating tournaments. They fight it out in our beautifully-rendered arenas based on real-world locations that they can alter, exploit, and even destroy.</p>\n<p>Sure, you can aim and shoot, but contestants that add our carefully curated virtual environments to their arsenal are more likely to advance, so do anything you can imagine in the name of victory! Burn arenas to the ground! Send wrecking balls crashing into your opponents! Don&#39;t just pull triggers - pull down buildings!</p>\n<p>THE WORLD IS WATCHING<br />\nTHE FINALS thrives on spectacle, so drive your fans wild with thrilling combat and your own personal flair as you compete for worldwide fame and the support of our discerning and stylish sponsors.</p>\n<p>Play Your Way - Whether it’s sneaking up on enemy squads with a katana in hand or ripping an entire building out from under their feet with explosives, THE FINALS lets YOU make the call! With different skills across body builds and a wide array of weapons and gadgets, you&#39;ll have all the tools to make your playstyle your own!</p>\n<p>The World Is Your Weapon (And Enemy) - A skilled contender might go in guns blazing, but with environmental destruction in your arsenal, that’s just the start of what you can wield against your foes! All of our arenas can be altered, used, or reduced to rubble - and not just by you.</p>\n<p>Your Rising Star - Ready for your close-up? Standing out in THE FINALS means the eyes of the world will be upon you, so you’d better look your best! Gather fans and fame as you craft a unique avatar with the help of our generous sponsors and dazzling customization options!</p>\n<p>GET FAMOUS<br />\nThis is the opportunity of a lifetime. Arenas based on iconic places, unparalleled destruction, and endless tactical possibilities await - make them your own, and the floodgates of fame will open. Your competition will have the same opportunities, so it’ll be up to you to be more clever and attention-grabbing. Are you up to the challenge? Are you the world’s next all-star?</p>", "metacritic": null, "released": "2023-12-07", "tba": false, "updated": "2024-04-22T22:35:50", "background_image": "https://media.rawg.io/media/games/fa2/fa28280bb6f7bec50b94bc821d412795.jpg", "website": "https://www.reachthefinals.com/", "rating": 3.9, "rating_top": 4, "added_by_status": {"yet": 24, "owned": 545, "beaten": 33, "toplay": 36, "dropped": 96, "playing": 58}, "playtime": 2, "achievements_count": 44, "ratings_count": 113, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 116, "platforms": ["PC", "PlayStation 5", "Xbox Series S/X"], "developers": ["Embark Studios"], "genres": ["Action", "Shooter"], "publishers": ["Nexon", "Embark Studios"], "esrb_rating": null}