{"id": 840804, "slug": "triple-fantasy-2", "name": "​Triple Fantasy", "name_original": "​Triple Fantasy", "description": "Three Cards, Triple Fun!<br/>Enjoy the tactical card game RPG!<br/><br/>■ Unique tactical TCG, CCG among card games<br/>- Triple your damage by combining three cards! Make the best deck with the best strategy!<br/>- If you like RPG games, you will definitely love Triple Fantasy!<br/><br/>■ Cute pixel heroes but deep tactics! Tactical Card RPG with unexpected amusement<br/>- Cute designs but strong stats - The collaboration of pixel graphic and deep strategy RPG!<br/>- Tactics and combinations are more important than card tiers! Triple the damage with various card combinations!<br/>- Gacha? Cash products? Payment? Triple Fantasy only battles with turn-based strategy, not like other gacha games!<br/>- Card battle with the fierce competition of tactics! A unique TCG<br/>- Different from other card games/strategy games/RPG games! Endless tactics with Fire/Water/Earth elements and various classes/jobs!<br/><br/>■ A card collecting game with unique dot characters<br/>- Sun Wukong, Thor, Odin, and characters from 'Romance of the three kingdoms?!' Meet familiar legends in the adventure!<br/>- Collect over 300 pixel art heroes! One of the best card collecting RPG games!<br/>- From normal heroes to legends! Collect cards in various tiers and become stronger!<br/><br/>■ Various contents that will never go boring<br/>- The basis of strategy games! Expand the world with your one and only deck! [Outpost]<br/>- Attack monsters with different elements! Rewards depending on the strategy! [Goblin Mine]<br/>- A true strategy card game enjoyed by random cards! Thrilling turn-based PVP! [Arena]<br/>- Collect unique dot heroes hidden somewhere in the map! [Monster Dungeon]<br/>- Defeat various monsters with powerful card combinations! The real tactical RPG game! [Lab]<br/>- Use tactics in the PVP as well! Fun triples in Card battle games when enjoyed together! [Devil's Ruins]<br/>- NO Grinding! The real-time battle only with card strategy skills! [Unknown Portal]<br/><br/>Enjoy strategy games with cute 2D dot heroes! One of the best card battle RPG games! Install now!", "metacritic": null, "released": "2022-08-22", "tba": false, "updated": "2023-01-15T17:50:25", "background_image": "https://media.rawg.io/media/screenshots/128/1281d6a7be1ea780b43781bf4c122aa8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 94}, "playtime": 15, "achievements_count": 85, "ratings_count": 1, "suggestions_count": 251, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Gameplete"], "genres": ["RPG", "Strategy", "Casual"], "publishers": ["NEOWIZ"], "esrb_rating": null}