{"id": 840835, "slug": "long-live-the-king-3", "name": "Long Live the King!", "name_original": "Long Live the King!", "description": "Long Live the King is a story-driven RPG, where the player's actions and choices will impact the story in major ways. Players take on the role of Carter, a young Knight in the Kingdom of Morida. As Carter, they must make decisions, pay close attention to character dialogue and actions, and decide who they can trust, in order to develop Carter into a capable leader and fighter. Will you stand with your friends or your brother? Your countrymen or your kin? The decision is yours.<h3>Features</h3><ul><li>Choose your own story adventure<br/></li><li>Turn-based Combat System<br/></li><li>Frequent Boss Fights <br/></li><li>Multiple endings <br/></li><li>Dozens of different enemies to battle<br/></li><li>Statesmanship - Control your own nation<br/></li><li>Party Building - Pick from a variety of allies to build your perfect party for battle</li></ul><h3>Story</h3><br/>Players take on the role of Carter, a low-level Knight in the Kingdom of Morida, but whose unlimited potential is noticed by even the King. When Carter's estranged brother, George, summons an army of monsters to take over the Kingdom, Carter is summoned to defend it. Along the way, Carter must employ the help of new allies and friends to eventually confront his brother. But when push comes to shove, George makes Carter an offer that the player may not be able to refuse. <br/><br/>The unrest in Morida leads to a series of deadly wars with neighboring realms, where Carter must use his skills and limited resources to keep Morida afloat. If the plater is able to find victory as Carter, the glory, and spoils, will be plenty. Riches, new allies, and even a realm of his own to rule may be at stake for carter as he fights for his home.", "metacritic": null, "released": "2022-08-22", "tba": false, "updated": "2022-08-26T04:23:34", "background_image": "https://media.rawg.io/media/screenshots/43c/43c41c1b9aac155910a4bbea6c3093c9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Americode"], "genres": ["Adventure", "RPG"], "publishers": ["Americode"], "esrb_rating": null}