{"id": 840800, "slug": "the-bridge-curse-road-to-salvation", "name": "The Bridge Curse Road to Salvation", "name_original": "The Bridge Curse Road to Salvation", "description": "<h3>The Bridge Curse Road to Salvation </h3>is a first-person atmospheric horror game with stealth-based gameplay. Out of 10 college horror tales from Taiwan, The Bridge Curse is one of the well-known supernatural incidents based in Tunghu University. Players will immersively wander on campus and experience the terrifying campus horror.<h3>Backstory:</h3> Taboo from bygone days that alive for many years in Tunghu University. A lingering female ghost has been long-lived on the campus bridge for several decades. Six college kids challenged the urban legend and accidentally came across the terrifying curse. Who will survive and how the curse is fixed yet remains unknown.<h3>Gameplay:</h3> Observe your surrounding environment and figure out the best route for evacuating. Complete the exploration before the female ghost murder you. Mastering your stealth skill is the only way to survive in the dark. Believe in yourself and try to piece all the information together to break the curse and find the true backstory.<br/><br/><br/><br/><br/><strong>Key Feature </strong><br/><br/><br/><strong>Escape from Ghost</strong><br/>Master your stealth skills to avoid the female ghost’s trailing.<br/><br/><br/><strong>Mystery Puzzles</strong><br/>Break the curse by puzzling gatherable items and information.<br/><br/><br/><strong>Campus Exploration</strong><br/>Discover the terrifying backstory by collecting key items and area investigation.", "metacritic": null, "released": "2022-08-24", "tba": false, "updated": "2024-01-04T23:58:47", "background_image": "https://media.rawg.io/media/screenshots/a2a/a2a0b17f65ae7cd54b124f2101342371.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 9, "beaten": 2, "toplay": 3, "dropped": 2, "playing": 1}, "playtime": 7, "achievements_count": 22, "ratings_count": 1, "suggestions_count": 319, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["SOFTSTAR ENTERTAINMENT"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["SOFTSTAR Entertainment"], "esrb_rating": null}