{"id": 840836, "slug": "prime-of-flames", "name": "Prime of Flames", "name_original": "Prime of Flames", "description": "<h3>INTRODUCTION</h3>Prime of Flames is a special strategy game that combines Wargame and Roguelike. You will lead the warriors of different clans to find the truth of history. Each clan has its own unique playstyle and so does each class. You can recruit a beast army to help you, or build a huge Bronion Works, or even construct a magic field to defeat powerful enemies. Each fight plays out differently, so let your creativity run wild.<h3>WORLD OUTLOOK</h3>The ancestors once built a great and prosperous country in the Wilderness, and each clan lived and multiplied with the help of the ancestors. Until the day disaster came, the meteorite destroyed the world of the ancestors, while the demons, ghosts and orcs ravaged this land, and even the witches who sheltered Human broke their covenant and disappeared. As the guider of the former ancestors, you revived and arrived. In the name of Star Envoy, you leave for the Human camp, and lead the warriors of different clans with talents and abilities to find the truth of history and disaster...<h3>FEATURES</h3><ul><li>Plenty of unique encounters with varying terrain, enemies and challenges to overcome.<br/></li><li>Over a hundred of characters from different clans, each with their own unique twist on their class playstyle.<br/></li><li>Turn based combat with no movement order. Such system is easy to pick up, allowing for anyone to enjoy some fun strategizing.<br/></li><li>Experience the story in stage mode, or face various challenges in endless mode.</li></ul>", "metacritic": null, "released": "2022-08-22", "tba": false, "updated": "2023-01-04T15:23:09", "background_image": "https://media.rawg.io/media/screenshots/257/257ae3ed1a6c18902893c4e38cbe498b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8, "beaten": 1, "toplay": 4}, "playtime": 3, "achievements_count": 69, "ratings_count": 1, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["RAYKA STUDIO"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["RAYKA STUDIO"], "esrb_rating": null}