{"id": 840881, "slug": "land-of-zympaia-the-new-light", "name": "Land of Zympaia The New Light", "name_original": "Land of Zympaia The New Light", "description": "In the landscape of Land of Zympaia The New Light you'll be dropped directly into the world, without having anything in your hand or in your pocket. You decide how situations will turn out for you. Different professions can change your life, so you should take everything into account.<br/><br/>The game is a role-survival game with already a fantastic landscape. Likewise, there are many options, such as crafting, fishing, inventory, quest and professions. The game is currently in alpha and quite a bit more content is still being planned.<br/><br/>Darkness descended upon us. Sinister creatures set fire to entire cities until nothing is left but ashes. Time passed, but the darkness endured and there are few survivors left. Now you are the one who must do something about it, for otherwise we are all lost.<br/><br/><ul><li><strong>Campaign:</strong></li></ul> Your only goal is to rebuild your late father's old farm and on top of that, survive as long as you can.<br/><br/><ul><li><strong>Your adventure:</strong></li></ul> As a farmer you won't get much recognition, try everything possible to achieve your goal. Make friends with the townspeople, work hard to achieve your dream. Fight the darkness to live a peaceful life again.<br/><br/><ul><li><strong>Housing:</strong></li></ul> At the beginning of your adventure, your sister bought you a small house from the mayor that once belonged to your father. Now you can settle down there. Make your own new furniture to make your home more beautiful.<br/><br/><ul><li><strong>Customization:</strong></li></ul> In the game you can choose your gender to make your character look good, you have the possibility to change the hair color and the clothes color. Now all that's missing is the character name and you're ready to go.", "metacritic": null, "released": "2022-08-24", "tba": false, "updated": "2022-08-26T05:20:22", "background_image": "https://media.rawg.io/media/screenshots/548/5481cece5eb017779c538ee95f289bd7.jpg", "website": "https://injectware.wixsite.com/land-of-zympaia?lang=de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["InjectWare Studio"], "genres": ["RPG", "Simulation", "Indie"], "publishers": ["InjectWare Studio"], "esrb_rating": null}