{"id": 840813, "slug": "holiday-jigsaw-halloween-4", "name": "Holiday Jigsaw Halloween 4", "name_original": "Holiday Jigsaw Halloween 4", "description": "Holiday Jigsaw. Halloween 4 is an exciting jigsaw game for all the family! Put together 500 jigsaw puzzles made from high-quality photos. Enjoy the exciting atmosphere of this happy holiday as you solve puzzles! Exciting puzzles and funny tricks – all this awaits you in the new epic Holiday Jigsaw. Halloween 4.<br/>\n<br/>\r\nFor more enjoyable gameplay, we’ve allowed for a whole range of possibilities. Set a difficulty to suit you for each puzzle! Save your progress at any time! Convenient controls and a multitude of hints and tools make the game more comfortable to play.<br/>\n<br/>\r\nHoliday Jigsaw. Halloween 4 brings you 500 of the best ideas for how to celebrate Halloween in the most fun and original way possible! Here you’ll find 5 themed collections of images: ideas for holiday decor, artistic autumn views, heartwarming family photos, varied treats and of course, a bunch of costumes for the party!<br/>\n<br/>\r\n- 500 high quality unique images<br/>\r\n- well designed game-play: useful hints, sort tool and magnifying glass.<br/>\r\n- optional game difficulty control makes your gameplay infinite<br/>\r\n- custom styles of pieces with rotation<br/>\r\n- save game progress and continue to collect the puzzle at any time<br/>\r\n- pleasant and relaxing music<br/>\r\n- a happy holiday atmosphere<br/>\r\n- get 500 puzzles for one purchase. It is beneficial!", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-26T03:55:10", "background_image": "https://media.rawg.io/media/screenshots/35c/35c2899c87199b7212103d657f1cae0f.jpg", "website": "https://www.facebook.com/8FloorGames/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Creobit"], "genres": ["Adventure", "Casual"], "publishers": ["8Floor"], "esrb_rating": null}