{"id": 840866, "slug": "ava-global", "name": "A.V.A Global", "name_original": "A.V.A Global", "description": "<strong>To All A.V.A fans! We are aiming to open A.V.A on the Planned Release Date!</strong><br/><br/><strong>We are launching Ava on Steam at the request of many global fans! <br/>Enjoy the classic FPS game once again with redesigned features!</strong><h3>Class system</h3>Each class has unique advantages and disadvantages against other classes. <br/>Players are able to acquire skills to enhance the unique characteristics of the classes they choose.<br/><br/><br/><br/><strong>Pointman</strong><br/>Specialized in close-range combat, Pointman is a fast and agile member of a team. <br/>Pointman's main roles are reconnaissance and attacking enemies from their backs. <br/>The Pointman is equipped with customizable Submachine Guns (SMG), Shotguns (SG), and unique gear. <br/>When your enemy needs a \"nice\" surprise, Pointman is there to deliver them a lethal present.<br/><br/><strong>Rifleman</strong><br/>Equipped with Assault Rifles (AR), bullet stopping armor, and throwable items, rifleman brings destruction to the enemy.<br/>Riflemans can respond to any types of situations on the battlefield by engaging and neutralizing the enemy. <br/>Your enemy team can run, but they can't hide from the Rifleman.<br/><br/><strong>Sniper</strong><br/>Equipped with a Sniper Rifle (SR), the Sniper is specialized in long distance combat. <br/>Snipers provide effective attack and defense of certain areas by taking down enemies and protecting teammates. <br/>Before being destroyed, your enemy team won't even know they are being watched.<h3>Modes/Maps</h3>With various types of modes and more than 14 maps, players can play their own unique mission on various battlefields with friends.<br/><br/><br/><strong>Modes</strong><br/><strong>Annihilation</strong> - Based on the death match rule, players on two opposing teams need to reach a score within a limited time.<br/><strong>Demolition</strong> - The NRF forces must survive and eliminate all EU forces or defuse the bomb. EU forces must successfully plant and detonate the bomb, or eliminate the enemy team to win a round.<br/><strong>Breach</strong> - The NRF forces must damage the tank that is being escorted by firing RPGs. The EU forces must escort the tank to the goal. When the tank is damaged, it must be repaired to move on.<h3>Weapon Attachments</h3>The weapon attachment system allows you to modify your own weapons. You can use the various weapons in different styles to suit your shooting needs. attachments parts include dot sight, scope, barrel, grip, ammo, grenade launcher, silencer, laser pointer etc.", "metacritic": null, "released": "2022-08-23", "tba": false, "updated": "2023-05-01T13:43:06", "background_image": "https://media.rawg.io/media/screenshots/a86/a8600d984dce45bde4403a133c9be7c8.jpg", "website": "", "rating": 0.0, "rating_top": 5, "added_by_status": {"yet": 4, "owned": 212, "beaten": 1, "toplay": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["NEOWIZ"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["NEOWIZ"], "esrb_rating": null}