{"id": 840827, "slug": "outbreak-island-pendulum", "name": "Outbreak Island: Pendulum", "name_original": "Outbreak Island: Pendulum", "description": "Welcome to Outbreak Island: Pendulum, a free version of the open-world survival simulator Outbreak Island.<br/><br/><br/><br/>After a mysterious experiment, the entire population of Erlsen Island goes crazy and declares a hunt for the survivors. The authorities isolated the region from the outside world and classified the \"incident\". Now a Center for Advanced Studies in a former nature reserve is becoming a dangerous place, where ominous green radiation shines in the sky at nights.<br/><br/>Face-to-face with the horrifying consequences of Project Pendulum, start your survival journey as experienced detective Howard Chapman, who secretly arrived on the island to investigate the causes of the disaster.<br/><br/><br/><br/><h3>Survive</h3><br/>With nowhere to retreat, there is a whole island ahead, full of secrets and dangers. Survive by fortifying and equipping your base to ward off the attacks of the Transformed.<br/>Collect resources and craft useful tools, equipment, weapons - they will grant you a chance to hold out more than one night. And when the next day comes, it's time to think of a survival strategy - attack enemies or use stealth to avoid them, stock up on food or even grow your own!<h3>Explore a living open world</h3><br/>The outside world is full of threats and obstacles to overcome. Survival in conditions of limited resources can be a real challenge even for a veteran detective.<br/>Even nature is challenging you with thick fog, heavy rains and aggressive wild animals. And the distraught inhabitants of the island are preying on you at night!<h3>Do your own investigation</h3><br/>By being in the right place at the right time, you will be able to discover secrets of the island that are hidden for most explorers. Use your camera to collect clues and secret files that will shed light on what is happening, and put the disaster puzzle together. <br/>Find the underground research facility and get ready to discover the biggest secret of the island!<br/><br/><br/><br/>📒<strong>Twitter:</strong> https://twitter.com/OutbreakIsland<br/>☎️<strong>Discord:</strong> discord.gg/DPC98xU", "metacritic": null, "released": "2022-08-22", "tba": false, "updated": "2022-10-05T09:37:18", "background_image": "https://media.rawg.io/media/screenshots/965/96589bbcf528011488e935e8c9aa5ba3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 148, "toplay": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tiny Magicians"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["HypeTrain Digital"], "esrb_rating": null}