{"id": 840946, "slug": "prison-tycoon-under-new-management-bundle-1", "name": "Prison Tycoon: Under New Management - Bundle 1", "name_original": "Prison Tycoon: Under New Management - Bundle 1", "description": "​​Grab your clipboards! Prison Tycoon™: Under New Management is bundled and ready to go!<br/>\n<br/>\nDeveloped by Abylight Studios and published by Ziggurat Interactive, Prison Tycoon: Under New Management is a reimagining of the original resource management sim. Instead of focusing on punishment, Under New Management is all about rehabilitation. Coach your inmates through therapies of all kinds - TV therapy, Dance Therapy, Virtual Reality therapy - to reintegrate them back into society as happy and healthy individuals.<br/>\n<br/>\nCheck out this sometimes silly, always entertainment resource management sim - Prison Tycoon: Under New Management<br/>\n<br/>\n<br/>\nPRISON TYCOON: UNDER NEW MANAGEMENT<br/>\n<br/>\nBuild a huge prison, crafting every building, every room, and every path and furnish them as you like!. Be sure the layout you design makes efficient use of the power grid and water systems.<br/>\nRehabilitate the prisoners, that's what it's all about! Send them to all sorts of therapies, from the zero gravity room to a hologram room to dance therapy (pole dance anyone?). Help inmates address their issues and return to society.<br/>\nHire expert staff to fill all kinds of roles in your prison. Assign them to work, promote the best and fire the rest.<br/>\nDesign and maintain the security systems of your prison and be ready for night escapes. Decide on the placement of cameras, watchtowers, and guards to make sure your prison is a safe place.<br/>\n<br/>\n<br/>\nMAXIMUM SECURITY DLC<br/>\n<br/>\nExpand your prison even further with the new Maximum Security DLC. Featuring higher risk prisoners, new therapies, more security measures, and best of all…K9 UNITS!<br/>\n<br/>\nWhen the bus rolls in select from a roster of inmates with new security levels, disorders, and personalities. Expand your prison with new Maximum Security buildings and tighten surveillance with player-defined guard patrols for extra eyes on those easy-to-escape corners of the map. Lend support to security staff with K9 units, robot watch guards, cameras, high-tech monitoring gear, and upgraded watchtowers. The higher the security level of each building, the more well-behaved your inmates will be. However, if that level drops and your high-risk prisoners get the upper hand, expect breakouts, fights, and more.", "metacritic": null, "released": "2022-08-04", "tba": false, "updated": "2022-08-26T06:43:56", "background_image": "https://media.rawg.io/media/screenshots/8bb/8bbea929b4702031035aad521e071a9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Abylight Studios"], "genres": [], "publishers": ["Ziggurat Interactive"], "esrb_rating": null}