{"id": 840947, "slug": "mira-and-the-legend-of-the-djinns-demo", "name": "Mira and the Legend of the Djinns Demo", "name_original": "Mira and the Legend of the Djinns Demo", "description": "The full version of Mira and the Legend of the Djinns is coming soon to GOG.COM. You can wishlist here<br/><br/>\n<br/>\n<br/>\nⵡⴰ ⴷ ⵜⴰⴱⵔⴰⵜ ⵏ ⵜⴰⵢⵔⵉ ⵉ ⵎⵉⵜⵔⵓⵡⵉⴷ-ⵠⴰⵏⵢⴰ, ⵙⵙⵎⵏⵉⴷ ⵉⵊⵊⵏ ⴰⵎⴰⴹⴰⵍ ⵢⴻⵜⵜⵡⴰⴳⵎ ⴷ ⵙⴳ ⵏ ⵜⴰⴷⵍⵙⴰ\n<br/>\n<br/>\nMira and the Legend of the Djinns is an epic Metroidvania, inspired by classic genre staples. The story follows the adventures of Yuba, a treasure hunter and explorer who travels the kingdom of Fallen Amazgesh, and Mira, a mysterious Djinn who has lost her memories.\n<br/>\n<br/>\nⵡⴰ ⴷ ⵜⴰⴱⵔⴰⵜ ⵏ ⵜⴰⵢⵔⵉ ⵉ ⵎⵉⵜⵔⵓⵡⵉⴷ-ⵠⴰⵏⵢⴰ, ⵙⵙⵎⵏⵉⴷ ⵉⵊⵊⵏ ⴰⵎⴰⴹⴰⵍ ⵢⴻⵜⵜⵡⴰⴳⵎ ⴷ ⵙⴳ ⵏ ⵜⴰⴷⵍⵙⴰ\n<br/>\n<br/>\nDuring a routine job, Yuba discovers an ancient Necropolis. Deep within, he encounters Mira, the first Djinn anyone’s seen in generations. To regain her lost memories, Yuba agrees to form a spiritual Bond with her. Together they embark on an epic quest to uncover the secret history of Fallen Amazgesh, a world of ruins and devastation and the only home Yuba has ever known.\n<br/>\n<br/>\nAlong the way, the pair will discover new friends and deadly enemies, track down ancient weapons and priceless artifacts and dangerous ruins, battle against mutated creatures and corrupted spirits, and come face to face with the very cause of the cataclysm that ended Mira’s world and created Yuba’s.\n<br/>\n<br/>\nⵡⴰ ⴷ ⵜⴰⴱⵔⴰⵜ ⵏ ⵜⴰⵢⵔⵉ ⵉ ⵎⵉⵜⵔⵓⵡⵉⴷ-ⵠⴰⵏⵢⴰ, ⵙⵙⵎⵏⵉⴷ ⵉⵊⵊⵏ ⴰⵎⴰⴹⴰⵍ ⵢⴻⵜⵜⵡⴰⴳⵎ ⴷ ⵙⴳ ⵏ ⵜⴰⴷⵍⵙⴰ\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>Mira and the Legend of the Djinns is a classic 2D side-scrolling Metroidvania, allowing the player to explore a mystic world full of dangers and discover new weapons, tools, items, and abilities while progressing the game.\n<br/>\n<br/>\n</li></ul>\n<br/>\n<ul><li>Weapons/Artifacts : Players will be able to use four different weapons, each one related to one of the four Primal Elements that represent the powers and nature of Djinns: Solar, Celestial, Infernal, and Lunar. The combat system emphasizes fluidity and experimentation and is best represented in the ability of the player to switch between weapons, and elemental modes, on the fly -- even in the midst of combat! Weapons can further be upgraded multiple times to increase their damage and unlock powerful new combos by collecting special items. \n<br/>\n<br/>\n</li></ul>\n<br/>\n<ul><li>Skill Tree : The game is all about defeating enemies in style, so unlocking all the skills, abilities, and moves is going to be a top priority. There are dozens of moves and combos to buy and more are unlocked as the player progresses through the story.\n<br/>\n<br/>\n</li></ul>\n<br/>\n<ul><li>Spells/Abilities : Mira and the Legend of the Djinns will feature some unique Spells and Abilities, we always wanted to see in a Metroidvania. A lot of magical abilities and spells have uses outside of combat, encouraging players to experiment.\n<br/>\n<br/>\n</li></ul>\n<br/>\n<ul><li>Tools &amp; Items : Seven tools can be aquired throughout the game. The player can use these tools to overcome obstacles, while exploring, solving puzzles and during combat. Various items will also be available to the player (including classics like health potions and bombs). Certain items are more rare and can be acquired by doing side quests, defeating certain enemies, and occasionally in shops.</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-26T06:45:33", "background_image": "https://media.rawg.io/media/screenshots/af0/af0644c4a943fd3c8162e5e8e0e1ea5d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 20}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 447, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["littleknightgames"], "genres": [], "publishers": ["Assemble Entertainment"], "esrb_rating": null}