{"id": 840935, "slug": "turbomania-fog-racers", "name": "TurboMania Fog Racers", "name_original": "TurboMania Fog Racers", "description": "<h3>BEAT YOUR OPPONENTS IN ARCADE STYLE        </h3><br/>In these dynamic races you have to ram your opponents, avoid obstacles, drift and plan when to use your secret weapon - TURBO. See if you have good reflexes to win in a race in which 1 second decides whether you win or lose!<br/><br/>Avoid real-time simulated obstacles (as falling rocks, flying saucers, bulldozers etc.) calculated thanks to the advanced NVidia PhysX engine, no race will be the same!<br/><br/>The best turbocharged cars and the craziest opponents are waiting to see if you can beat them. Cautious drivers should not report.<br/><br/>Furious and surprising power-ups - put your pedal to the metal as you race through stylized, varied levels. Collect POTATOES (the main in-game currency) to upgrade your vehicle or buy a better car ( feature available soon). Race in single player mode or in the local split screen ( split screen mode available soon).<br/><br/>There are as many as 10 cars with a unique driving style waiting for you. Try them in single race mode (1 map) or in free ride mode.<br/><br/>Ram your opponents' cars and watch them take to the skies - it's your job to win to become the Grand Master of TurboMania!<br/><br/>TurboMania Fog Racers combines arcade, skill basen, old-school inspired gameplay (inspired by games like Igniton and MicroMachines) with 3D graphics.<h3>Features</h3><br/><ul><li> 1 single player free ride map - with ramps, bends, race track, gigantic loop and skid plate. Test your skills with 10 available cars to choose from <br/></li><li> 1 single player race map with 2 available cars to choose from ( more racing maps coming soon! )<br/></li><li> fast paced, addicting gameplay!<br/></li><li> REAL TIME PhysX simulated obstacles<br/></li><li> violence free gameplay<br/></li><li> cool cars with unique looks, turbo sounds and unique driving model</li></ul>", "metacritic": null, "released": "2022-08-25", "tba": false, "updated": "2022-08-26T06:29:40", "background_image": "https://media.rawg.io/media/screenshots/aa2/aa23212511d7d465ba8451e334842c78.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Carrramba Games"], "genres": ["Action", "Simulation", "Racing"], "publishers": ["Carrramba Games"], "esrb_rating": null}