{"id": 840950, "slug": "verne-the-shape-of-fantasy", "name": "Verne: The Shape of Fantasy", "name_original": "Verne: The Shape of Fantasy", "description": "<strong>A THRILLING STORY</strong><br/>The year is 1888, the war against the ruthless \"Nation\" is coming to a head and threatens to completely destroy the alternate land of Hemera. As a last resort to save their world, Jules Verne and Captain Nemo embark on a search for the source of the power of Atlantis aboard the infamous submarine Nautilus.<br/><br/>If the legends are to be believed, an ancient artefact lies buried there that has the power to change the course of history: the Flame of Hephaestus! An artefact whose mighty power was once responsible for both the rise and fall of legendary Atlantis.<br/><br/>On his journey, Jules Verne will not only discover unimaginable wonders and mysteries - he must also confront a dark and seemingly overpowering entity whose sole ambition is to eradicate the power of imagination from the minds of all the people of Hemera ... including his!<br/><br/><br/><br/><strong>GAMEPLAY</strong><br/><ul><li><strong>Unleash your imagination:</strong> Use the power of the IMAG, an ancient device from Atlantis, to rewrite history and change Verne's fate at certain moments.<br/></li><li><strong>Non-linear dialogues:</strong> A varied gameplay experience that reflects the human ability to imagine and tell the most fantastic stories.<br/></li><li><strong>An Atlantis-tic scavenger hunt:</strong> In gameplay inspired by classic adventure games, solving puzzles and exploring every inch of your surroundings is always the key to success.<br/></li><li><strong>No Ruin Left Unturned:</strong> The atmospheric and detailed pixel art steampunk world invites you to explore: from the dark corridors of the Nautilus to the Atlantean Ruins.<br/></li><li><strong>With attention to detail:</strong> Become part of a fascinating story about the life and works of Jules Verne.</li></ul><br/>https://store.steampowered.com/app/1424600/Verne_The_Shape_of_Fantasy", "metacritic": null, "released": "2023-08-14", "tba": false, "updated": "2023-10-02T14:46:40", "background_image": "https://media.rawg.io/media/screenshots/8fe/8fe8ca906ab24b71808c077df5b4da5a.jpg", "website": "http://www.julesvernegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 12, "toplay": 4, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 417, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["Gametopia"], "genres": ["Adventure", "Indie"], "publishers": ["Assemble Entertainment", "WhisperGames"], "esrb_rating": null}