{"id": 841056, "slug": "toilets-spooky-nights", "name": "Toilet's Spooky Nights", "name_original": "Toilet's Spooky Nights", "description": "<p><strong>GAMEJOLT PAGE: Toilet's Spooky Nights (Official) by AriasDeveloper - Game Jolt</strong></p>\n\n<p><strong>STORY:</strong></p>\n<p>After finishing your night in the dungeon of the triangle you return home where a relative of the triangle awaits you, a few hours later you wake up unconscious in an abandoned house where some enemies in a peculiar way challenge you to a game of life and death...\r\n</p>\n<p>In this game you are a prisoner of the macabre toilet games, your goal is to win each of the games and prevent the enemies from killing you using the weaknesses of each one, but nothing will be easy as before... you have 4 days, good luck.\r\n</p>\n<p><strong>GAMEPLAY:</strong></p>\n\n<p>There are a lot of new mechanics in this game, you can record the toilets, activate an anti-asshole alarm, use the legendary card to reverse any attack, prevent the old woman from reaching your office by pressing her on the cameras and more!\r\n</p>\n<p>WARNING: THIS GAME IS A FUN-PROJECT/JOKE GAME, IF ANY KIND OF BLACK HUMOR OFFENDS YOU THEN I'LL RECOMMEND YOU TO NOT PLAY THE GAME!\r\n</p>\n<p><strong>THIS GAME IS NOT WHAT IT SEEMS!</strong></p>\n<p>Based on the shitty FNaF Fangames, bad made stories, lazy-character design and of course the classic FNaF Fangames theme, This game is basically a mix from a bunch of Fangames in a single one, i do not own all the images on this game but of course... they were <strong>free to use</strong>-</p>\n<p><strong>CREDITS:</strong></p>\n<p>Edits, Programming, Sounds and Ideas - AriasDEV</p>\n<p>Stock Images/Scenarios - Google Images\r\n</p>\n<p>Toilet Images - My House Toilets/Friends Toilet's\r\n</p>\n<p>Sounds Effects - Audacity/FreeSound.org\r\n</p>\n<p>FNaF by... You already know who-</p>", "metacritic": null, "released": "2022-08-25", "tba": false, "updated": "2022-08-26T07:39:12", "background_image": "https://media.rawg.io/media/screenshots/b0a/b0ad7bea20f4e278cc6a20c7bbd38eb0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 117, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AriasDEV"], "genres": [], "publishers": [], "esrb_rating": null}