{"id": 841161, "slug": "cheers-bigrockschool", "name": "Cheers (BigRockSchool)", "name_original": "Cheers (BigRockSchool)", "description": "<p>Una bizzarra coppia di scienziati lavora incessantemente nei laboratori del più grande centro di ricerca mondiale ad una formula che potrebbe cambiare le sorti dell'intero pianeta. Ad un passo dalla soluzione però un rocambolesco incidente distrugge l'intero universo, lasciando i due scienziati in un limbo, con solo una manciata di elementi. Riusciranno a ricreare l'universo per come lo conosciamo? </p>\n<p>Cheers è un party-game puzzle cooperativo per due giocatori che dovranno coordinarsi e lavorare insieme per combinare coppie di elementi e crearne di nuovi. Il gioco presenta due modalità:</p>\n<p> - la modalità Sandbox, in cui i giocatori posso sperimentare con le combinazioni al fine di completare l'intero catalogo di elementi; </p>\n<p>- la modalità Challenge, in cui lo scopo è ricreare l'elemento richiesto in una frenetica sfida a tempo. </p>\n<p>Con 20 skin customizzabili e 14 differenti mappe, ciascuna con le sue difficoltà e sfide uniche, Cheers è un gioco colorato ed avvincente che vi terrà incollati allo schermo.</p>\n<p>*****</p>\n<p>A couple of quirky scientists work tirelessly in the laboratories of the world's largest research center on a formula that could change the fate of the entire planet. However, one step away from a solution, a freak accident destroys the entire universe, leaving the two scientists in limbo, with only a handful of elements. Will they be able to restore the universe as we know it? </p>\n<p>Cheers is a cooperative puzzle party-game for two players who will have to coordinate and work together to combine pairs of elements and create new ones. The game features two modes: </p>\n<p>- the Sandbox mode, in which players can experiment with combinations in order to complete the entire catalog of elements; </p>\n<p>- the Challenge mode, in which the goal is to recreate the requested element in a frantic timed challenge. </p>\n<p>With 20 customizable skins and 14 different maps, each with its own unique difficulties and challenges, Cheers is a colorful and exciting game that will keep you glued to the screen.</p>", "metacritic": null, "released": "2022-08-25", "tba": false, "updated": "2022-08-26T08:23:37", "background_image": "https://media.rawg.io/media/screenshots/f83/f83c98d2ebdaf1b1953a9cbb9b4fdf35.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BigRockSchool"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}