{"id": 841107, "slug": "debris-2", "name": "Débris", "name_original": "Débris", "description": "<p>Traduction officielle de <em><strong>Scraps</strong></em><br/>Un jeu de Cezar Capacle🇬🇧 Find the english version here<em><br/>============================</em><br/><br/><em>  Après la rupture, le monde fut silencieux pendant des centaines d'années. Les magnifiques structures que nos ancêtres ont construites ont été reprises par la nature.</em><br/><em>À un moment donné, longtemps après, nos arrière-grands-parents se sont réveillés de leur sommeil. En remontant à la surface, ils ont lentement mais sûrement découvert d'immenses ruines envahies par des créatures et des plantes inimaginables.</em><br/></p>\n<p><em>Sans souvenirs de ce qui s'est passé avant leur époque, ils ont commencé un nouveau monde. Un lieu d'espoir, de paix, de synergie et de beauté.</em>\n<br/></p>\n<p><em>Bienvenue à </em><strong><em>Ayera.</em></strong>\n</p>\n<p><em>============================</em><br/></p>\r\nGagnant du meilleur jeu solarpunk à la Applied Hope: The Solarpunk &amp; Utopias Jam*\r\n\r\n\n<p><em>*L'espoir en action: la jam du solarpunk et des utopies</em></p>\r\nLe jeu :\r\n<p><strong>Ayera </strong>est un monde plein d'espoir construit parmi les ruines d'une ancienne civilisation disparue depuis longtemps. C'est un lieu d'harmonie et de symbiose, dans lequel une flore et une faune inimaginables peuvent être trouvées par quiconque quitte les villages et parcourt des chemins inexplorés.\r\n</p>\n<p>Vous êtes une <strong>Débrisière</strong>, une aventurière qui consacre sa vie à explorer la terre, à trouver des ingrédients spéciaux, à les rapporter dans ses ateliers et à fabriquer ses merveilleux projets personnels et communautaires.\r\n</p>\n<p><strong>Débris </strong>est un jeu feel-good sur le partage, l'harmonie avec la nature, la découverte et la curiosité.<br/></p>\n\n<p>Une partie des mécaniques est inspirée d'<em>Ironsworn, </em>et les règles d'artisanat utilisent des polyminos.  On y retrouve aussi quelques éléments de <em>Tetris</em> et de la <em>Bataille navale</em>.<br/></p>\n\n<p>Voilà votre feuille de personnage:</p>\n\n<p>============================</p>\r\nPrincipes fondateurs :\r\n<ul><li>Le jeu est strictement non-violent. Il y a des périls, mais on ne les surmonte jamais en tuant ou en blessant quelqu'un.\r\n</li>\n<li>Les projets que vous imaginez n'ont pas pour but l'expansion ou la domination de la nature. Il n'y a pas de place pour la colonisation ou l'impérialisme dans ce jeu. C'est avant tout un monde de symbiose.\r\n</li>\n<li>Le jeu fonctionne par phases. Vous générez un projet sur lequel travailler, vous planifiez votre expédition, vous explorez la nature à la recherche d'ingrédients, vous les ramenez chez vous et vous fabriquez vos merveilleuses inventions. C'est une boucle.<br/>\n</li>\n<li>Vous ne planifiez pas de sessions ou d'intrigues. Les objectifs, le terrain et les obstacles sont générés au fur et à mesure.  \r\n</li>\n<li>Le jeu s'appuie sur des tables pour la génération aléatoire. Vous lancez de 1d6 à 4d6 pour obtenir un résultat aléatoire.\r\n</li>\n<li>Le jeu s'appuie sur des actions (les noms des actions sont toujours soulignés) pour déterminer ce qui se passe lorsque votre personnage fait quelque chose. La plupart des actions sont obligatoires (\"Vous devez\") mais certaines sont facultatives  (\"Vous pouvez\").\r\n</li>\n<li>Si votre personnage fait quelque chose qui n'est pas couvert par une action, il n'y a pas de dés à lancer.\r\n</li></ul>\r\nContient :\r\n<ul><li>Une version livret du jeu, prete à être imprimée en A5</li><li>Une feuille de personage et une feuille pour vos projets</li><li>Une carte d'hexagones vierge pour explorer le monde</li></ul>\n<ul><li>Une aide de jeu qui regroupe les tables, les générateurs et les actions</li><li>La même aide de jeu en printer friendly</li></ul>\n<ul><li>Les coupons qui vous donneront accès à la version imprimée à prix coûtant (actuellement disponible en anglais seulement)</li></ul>", "metacritic": null, "released": "2022-08-25", "tba": false, "updated": "2022-08-26T07:59:59", "background_image": "https://media.rawg.io/media/screenshots/bc0/bc08c05631db46098cdf246bd9322bde.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nadg"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}