{"id": 84146, "slug": "new-star-soccer-g-story", "name": "New Star Soccer G-Story", "name_original": "New Star Soccer G-Story", "description": "<p><strong><em>Please note this is an interactive Story Book which contains gameplay snippets from New Star Soccer. It is not a sequel or update to New Star Soccer</em></strong><br />\nWelcome to “New Star Soccer G-Story”, the world&#39;s best fusion of mobile game and book!</p>\n<p>PERSONALISE YOUR STORY! You are the hero of the story as you go from kicking a ball in the park to playing for your favourite team in the cup final!</p>\n<p>PLAY THE GAME! The story twists and turns develops depending  on how well you perform in the addictive gameplay from the BAFTA-winning “New Star Soccer”, &quot;The best football game on mobile&quot; (Eurogamer)</p>\n<p>SHOOTING! PASSING! DRIBBLING! TACKLING! HEADERS! PENALTIES! Actually play the key match chances in each chapter and change the course of your story!</p>\n<p>YOUR CAREER, YOUR CHOICES! Choose an agent, which skills to train and even which sponsorship deals to take!</p>\n<p>EVERY DECISION CHOICE MATTERS! Each one you make affects the story. With multiple storylines and multiple endings, which of the thrilling finales will you get?</p>\n<p>INCREDIBLE MIX OF STORY AND GAME! The gameplay makes the story better and the story makes the gameplay better. This is the ultimate football immersion experience: the perfect fusion of story and game!</p>\n<p>KEY FEATURES</p>\n<p>The most exciting book you&#39;ll ever play.</p>\n<p>BAFTA-winning gameplay from the best football game on mobile.</p>\n<p>A brilliant story that twists and turns all the way to the last kick of the final match.</p>\n<p>Multiple storylines, edge-of-your-seat chances and several possible endings: a real rollercoaster ride from start to finish.</p>\n<p>Read the book, convert your chances, dictate your destiny!</p>", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2022-09-09T21:29:22", "background_image": "https://media.rawg.io/media/screenshots/47c/47cb6f4a5957dbc962e6ddf94973fb1d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Five Aces Publishing"], "genres": ["Sports"], "publishers": ["Five Aces Publishing"], "esrb_rating": "Everyone 10+"}