{"id": 84155, "slug": "bubbu-restaurant", "name": "Bubbu Restaurant", "name_original": "Bubbu Restaurant", "description": "Bubbu has decided to open his very own restaurant, but he needs some help to successfully run it. Join him now, hungry guests are already on the way!<br/><br/>GOOD FOOD &amp; HAPPY CUSTOMERS<br/>Bubbu’s philosophy is to serve good &amp; healthy food and to keep customers always happy. Use your cooking and management skills to show your best on time. While having fun, learn some basic cooking techniques to prepare juice, tea, coffee, burgers, tacos, spaghetti, barbecue, French fries, ice cream, cupcake, pizza and sushi. Cook the best food with the best ingredients!<br/><br/>RESTAURANT FUN<br/>You’re in charge of managing the restaurant, cooking worldwide popular dishes and expanding restaurant business. Take orders, cook all the dishes as fast as possible, enjoy decorating them with sweet or salty garnishes, then serve the prepared food and drinks to customers in exchange for money. While playing the game, you will be able to upgrade, customize and decorate Bubbu Restaurant. So roll up your sleeves and make this restaurant a better place!<br/><br/>Your cooking fun can start! Become a world class chef in Bubbu Restaurant. <br/><br/>FEATURES<br/>• starring Bubbu and his animal friends<br/>• enjoyable cooking adventure<br/>• fun time management game<br/>• many challenging levels to play<br/>• a lot of different drinks and food for every taste<br/>• Mexican, American, Japanese, Italian and many more cuisines", "metacritic": null, "released": "2018-07-24", "tba": false, "updated": "2019-10-22T14:22:09", "background_image": "https://media.rawg.io/media/screenshots/1c4/1c4e33c5265bab8374daeca5e8233873.jpg", "website": "http://www.bubadu.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Pilcom", "Bubadu"], "genres": ["RPG", "Casual", "Family"], "publishers": ["PILCOM, podjetje za informacijske tehnologije"], "esrb_rating": null}