{"id": 841831, "slug": "that-summers-day-memories-of-marin", "name": "That Summer's Day - Memories of Marin", "name_original": "That Summer's Day - Memories of Marin", "description": "<p><em>That Summer’s Day — Memories of Marin </em>is a side story / demo for an upcoming project, <em>That Summer’s Day. </em></p>\n<p>Marin Collins is Sean Tovin’s distant cousin and childhood friend. Ever since the first day she met Sean, she’s had a crush on him. Even though Sean is a kind and caring person, he can be quite out of touch with his emotions and appear apathetic and detached. \r\n</p>\n<p><em>Memories of Marin</em> is a tribute to Marin’s feelings for Sean, and her memories of him. \r\n</p>\n<p>Will you accept Marin’s love or will you become a bittersweet memory for Marin, of a childhood unrequited love? </p>\n<p>For more information about <em>That Summer’s Day</em>, please visit the project page on our website:\r\n<em>https://mariemariewriting.wordpress.com/thatsummersday/</em>. </p>\n\n<p>...cameo from a few other characters to be featured in the main story!</p>\n\n\n<p>Even though this is a demo and a very short story, we want to include as many features in our game as possible so that you will know what to expect (at the very least) from our upcoming project!</p>\n<ul>\n<li>Customisable protagonist name</li>\n<li>Progress page</li>\n<li>CG — 1 in the demo</li>\n<li>Two distinctly different endings with minor differences within each one depending on previous choices</li>\n<li>A pretty game interface and beautiful music to set the mood!</li>\n<li>The game also includes accessibility features offered by the Ren’py engine, such as self-voicing and text scaling (accessible by pressing “Shift + A” on the keyboard).</li>\n</ul>\n\n\n<p><em>Memories of Marin</em> is a pilot project for <em>That Summer’s Day</em>, which was originally built on a web-based engine. Due to some issues with that platform, we had to re-assemble our work on Ren’py instead. We coped with this change by creating <em>Memories of Marin</em>, to familiarise ourselves with using Ren’py. For this pilot project, we made use of readily available assets generously made available by the artists below: </p>\n<p>\n<em>Many thanks to</em>\n<br/><br/>\n<strong>RAIKO</strong>\n<br/>\r\nfor character sprites \r\n<br/><br/>\n<strong>Gabber</strong>\n<br/>\r\nfor background art\r\n<br/><br/>\n</p>\n<p>The design and art of the character sprites and background belong to the artists above.</p>\n<p>A different design will be used for the characters and the background in the main visual novel, <em>That Summer’s Day</em>. (But Marin will still be as lovable!)</p>\n<p>A full list of credits and acknowledgement can be found inside the game.</p>\n\n\n<p>Thank you for being here!</p>\n<p>\r\nDid you enjoy the story? Please let us know!! \r\n</p>\n<p>\r\nOr leave us a tip / buy us a coffee!\r\n</p>\n<p>\n<br/>\n<br/></p>\n<p>\r\nYour contribution will greatly support us and give us encouragement as we work on building the main game! \r\n</p>\n<p>\r\nIf you enjoyed the story and are interested in collaborating, please contact us! \r\n</p>", "metacritic": null, "released": "2022-08-23", "tba": false, "updated": "2022-08-26T13:02:35", "background_image": "https://media.rawg.io/media/screenshots/5d9/5d97be0f1cb16b2ca466fc4ac44e6c96.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Marie Marie Studio"], "genres": [], "publishers": [], "esrb_rating": null}