{"id": 841862, "slug": "tricosmos-cardinals-legacy", "name": "TRICOSMOS: Cardinals Legacy", "name_original": "TRICOSMOS: Cardinals Legacy", "description": "<p><strong>ADVENTURE TRIAD + EXTRA</strong></p>\n<p>Experience three complete campaigns in the region of Gadrios where the conflict between humans and Cardinals have shaped history into different parallel universes. Join forces with a cast of 10 characters as they travel the region to solve crysis related to the anomalies created within the various worlds. Experience their journeys through short cutscenes played before main battles or at the entrance of each of the 5 towns you will explore in each chapter. Conclude your main campaigns with an additional mode that will wrap up all the stories together and give you an insight on the forces acting behind the scenes.\r\n</p>\n<p><strong>ENCOUNTER BATTLE DIVERSITY</strong>\n</p>\n<p>Each chapter is characterized by a different combat system while maintaining the same structure in regards to town exploration and stage selection. Take advantage of your opponents resistance weaknesses and use elemental status to gain the upper hand in Sizzling Hatred; combine your power with elemental gems to break the enemies shields and deal massive damage in Wilting Genesis; use terrains to your advantage while carefully selecting the type of spell to boost your party in Flourishing Reunion; increase your stat ranks and manage your skills cooldown and usage in Shivering Balance.\r\n</p>\n<p><strong>UNLIMITED BOOST COMBINATIONS</strong>\n</p>\n<p>While raising your party rank at the end of each battle, multiple ways to expand your characters potential will be available depending on the chapter: unlock new spell skills, change resistances values, raise the level of your weapon skills, alter your elemental gem attributes, activate nodes in your skill tree or modify the parameters of your enchanting device.\r\n</p>\n<p><strong>ENHANCED EXPERIENCE AFTER COMPLETION</strong>\n</p>\n<p>Complete the main battles in every campaign in order to unlock EX mode where you can replay the adventures with all the characters, each added with unique movesets and abilities that allow you to try new party combinations when changing your formation at the Tavern. New special conversations between party members can be unlocked as well, giving you the chance to know more about your characters. The Gallery will also be available, adding depth to units, locations, enemies and other assets present in the various campaigns. \r\n</p>", "metacritic": null, "released": "2022-08-23", "tba": false, "updated": "2022-08-26T13:18:19", "background_image": "https://media.rawg.io/media/screenshots/302/302bd8d047bcbd08f7b73b332023e0e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 206, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LittleMugGames"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}