{"id": 841938, "slug": "metroville-the-super-powered-role-playing-game", "name": "Metroville: The Super Powered Role-playing Game", "name_original": "Metroville: The Super Powered Role-playing Game", "description": "<p>Metroville is a super powered role playing game system where superpowers are wielded by the righteous, the flawed and the down-right evil.  Metroville is a narrative-focused role playing game with creativity, and collaboration at the heart of its design.  \r\n </p>\n<p>\n</p>\n<p>Metroville incorporates a d6 (six sided dice) die pool, where you add a Core Attribute with the modifier of any relevant skills or powers.  Every die that rolls above a 3 counts as a success against a target number decided by the Narrator (GM) based on the action.\r\n </p>\n<p>In Metroville there are more than 30 powers that you can choose from, mixing and matching them to create your Character. The coolest part is that there are no set moves or spells for each power, so creativity can be a huge advantage for Players and Narrators.  This means that there are many dynamic ways to solve problems in Metroville.  \r\n </p>\n<p>Origins take the place of traditional classes in Metroville.  Origins define how your Character got their powers, not how they can use them.  Characters in Metroville could have gained their powers from the result of their alien species, their enhanced genetics, an experiment or accident, and more.  \r\n </p>\n<p>\n</p>\n<p>Character creation in Metroville is fast, simple and creates unique Characters every time.  While you can whip up a Character in just a few minutes, you can also spend a little more time to make a truly unique Character.  Characters can be customized using Traits and Talents.  The best heroes aren’t perfect, which is why the Metroville Trait system relies on characters having a balance between positive and negative traits. Not only does this make your character more well-rounded, but the combination of positive and negative traits will make them more unique. Further customization is possible through the use of Talents. General talents are useful skills that anyone in the world could have, like driving a car. Unique talents are niche skills that set your character apart, like knowing a pop artist’s whole discography.  While your character might not use them often, it’s a lot of fun when you get the opportunity to apply your highly specialized knowledge. No character on your team (or even in your world) will have the same combination of Origin, Powers, Traits and Talents so you can feel as unique as your favourite comic book character. \r\n </p>\n<p>\n</p>\n<p>Metroville is setting agnostic This means that the game you play at your table will probably look nothing like anyone else’s game of Metroville.  The rule book comes with a set of suggested Talents and Traits written to fit in a modern or near future setting. However, these are flexible and can easily be changed to suit your setting.  For example, in a play test, we played in the Dark Ages and took out the Piloting Talent and replaced it with a Literacy Talent, and when we played in a futuristic setting, we chose to add the Space Flight Talent and Navigation Talent.\r\n </p>\n<p>\n</p>\n<p>The Core Rulebook for Metroville contains everything the Players and the Narrators need to get started and play a game.  \r\n </p>\n<p>The 118 page Core Rulebook includes:\r\n </p>\n<ul><li> <p>More than 30 unique powers.\r\n \r\n</p></li></ul>\n<ul><li> <p>More than 50 Traits to help you make a completely unique Character.\r\n \r\n</p></li></ul>\n<ul><li> <p>Tips for Narrators.\r\n \r\n</p></li></ul>\n<ul><li> <p>7 Character Origins which help to give each Character a unique starting point.\r\n \r\n</p></li></ul>\n<ul><li> <p>Example prologues to help get you started with Metroville story.\r\n \r\n</p></li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-08-26T13:54:24", "background_image": "https://media.rawg.io/media/screenshots/786/786def33073c37fe3105a7107ce03e7c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tattoopotato"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}