{"id": 84200, "slug": "trainz-trouble-lite", "name": "Trainz Trouble Lite", "name_original": "Trainz Trouble Lite", "description": "69 levels of train crashing action! <br/><br/>Keep the wheels in motion as trains speed to their various destinations. Plan the route, change the junctions, time the stops, and avoid the trouble...it all sounds so simple! <br/><br/>*** CAUTION: Infuriatingly Addictive Gameplay Ahead! *** <br/><br/>Rock-piles, level crossings and runaway trains are just a few of the obstacles in your way. Use your sharp mind to figure out the right path, and your fast fingers to tap in the right place at the right time. <br/><br/>And if at first you don't succeed...try, try and try again! <br/><br/>Loads of puzzles to solve, suitable for all ages. New levels provide new challenges and new gameplay features. We even supply some solutions and speed controls to make things easier if you need a helping hand. <br/><br/>Features: <br/>- quality puzzles for beginners to experts <br/>- awesome train crashes <br/>- gentle learning curve <br/>- spectacular train smashes <br/>- increasing difficulty as you solve each level <br/>- explosive train pile-ups <br/>- advanced 3D graphics <br/>- speeding runaway trains <br/>- in-game store to help you solve puzzles more easily <br/>- trains crashing into cars <br/>- more levels available for a small price <br/>- trains crashing into trains (and maybe cows and deer and kangaroos) <br/>- more levels to follow", "metacritic": null, "released": "2013-08-22", "tba": false, "updated": "2019-07-30T11:03:14", "background_image": "https://media.rawg.io/media/screenshots/ecf/ecfbb36e5482ad48f6c5793d2406c72a.jpg", "website": "http://trainztrouble.com/home/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["N3V Games"], "genres": ["Simulation", "Puzzle"], "publishers": ["N3V Games"], "esrb_rating": null}