{"id": 84215, "slug": "bang-bang-tennis", "name": "Bang Bang Tennis", "name_original": "Bang Bang Tennis", "description": "Get ready for... Bang Bang Tennis! A fun and crazy fast paced tennis game<br/><br/>Take on the world’s best and become the Bang Bang Grand Champion in this fast paced Bash and Smash Tennis game.<br/><br/>Bang Bang tennis, a new kind of tennis, with barriers to stop the ball from going out, the goal is simple, smash the ball past your opponent.<br/><br/>4 game modes include single player, multi-player, Tournament - the Bang Bang grand slam and Arcade mode. With over 30 characters to unlock including special boss characters. Go on to win the Bang Bang Grand slam! Or move to arcade mode to challenge the boss in the final level.<br/><br/>Challenge friends in 2 player mode on a single device for hours of tennis smashing fun.<br/><br/>Simple controls make this tennis game fun and exciting while testing your reflexes to the max! <br/>its a mix of ping pong, air hockey and of course tennis in one of the fastest paced tennis games you will ever play!<br/><br/>Major Features:<br/>- Over 30 Characters to unlock<br/>- Over 10 Different Tennis courts to play on<br/>- 4 Game modes to keep you entertained for hours<br/>- Single Player Game<br/>- Multiplayer – Challenge a friend in two player mode<br/>- Tournament – Can you win the Bang Bang Grand slam?<br/>- Arcade mode – Beat each level with power-ups to unlock the boss in the final level<br/>- Simple controls<br/>- Game Centre Leaderboards - Be the best in the world and top the table<br/>- Localized in 12 languages including (English, German, French, Spanish, Russian, Dutch, Italian, Portuguese, Japanese, Simplified Chinese, Traditional Chinese &amp; Indonesian)", "metacritic": null, "released": "2017-01-11", "tba": false, "updated": "2019-07-30T10:38:47", "background_image": "https://media.rawg.io/media/screenshots/850/8500dfd532f80ea171a8a684abb07bb0.jpg", "website": "http://www.razgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Raz Games"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Raz Games"], "esrb_rating": null}