{"id": 842258, "slug": "escape-the-hospital-keightyrose", "name": "Escape The Hospital (keightyrose)", "name_original": "Escape The Hospital (keightyrose)", "description": "Survive and get out of the hospital in Escape The Hospital - The Prototype\r\n<p>This prototype was developed as part of our group work projects for the semester. We are a group of third year game design students who are learning to rapidly prototype more and cry less. Worked on by the three musketeers - Sam, Matthias and Kate (keightyrose).</p>\n<p>The project will be uploaded most likely by each of us so roles and contributions will be included, but we'll each go into more detail about our roles on our individual pages. In short, here's what each of us worked on:</p>\r\nKateLevel design, asset implementation and, UI.  SamCharacter controllers, quick time events, lighting, and audio.MatthiasSanity system, audio and animation. \r\n<p>In more detail, I worked on building the map and environment. Implementing and building with the assets such as the grids the map was built with, the tile maps used, how the map was created.  I also worked on the UI side of the project alongside Sam's and Matthias's scripts. I visualised the quick time events and sanity drop and worked on the menu and game over scenes.</p>\n<p>We would really love for you to engage with this prototype and let us know what you liked, what we could have better, what you maybe felt it lacked or even what you would have liked to see/get from it! </p>", "metacritic": null, "released": "2022-08-22", "tba": false, "updated": "2022-08-26T16:10:17", "background_image": "https://media.rawg.io/media/screenshots/0d2/0d2680aca768d2452e64301b8b8ff651.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["keightyrose"], "genres": [], "publishers": [], "esrb_rating": null}