{"id": 842358, "slug": "crazy-factory-itch", "name": "Crazy Factory (itch)", "name_original": "Crazy Factory (itch)", "description": "Wasm4 Game Jam #2\r\n\r\nGameplay\r\n<p>\r\nThe game is simple. You are a boss of a factory where you produce products. With each item you produce, you must pay cost and when you sell it, you'll get money. You have to balance the product prices and production speed as the customers has to be happy with the products you produce. \r\n</p>\n<p>\r\nIf you set the prices too high, customers will complain and thus, the customer satisfaction will go down. This will happen, again, if you produce too much products as there will be excess products around, and don't make research on Science Machine. If customers are unhappy, then you'll start to lose money on each product you sell.\r\n</p>\n<p>\r\nBut don't forget, there's always a magical solution for everything. In the shop, you can fill up the customer satisfaction or remove costs of the products with a potion.\r\n</p>\n<p>\r\nAlso, there are skins in which you can customize the behaviors of machines.\r\n</p>\n<p>\r\nDon't forget to upgrade machines so that you can set higher prices for the products. You can find price configuration under science machine.\r\n</p>\r\nControls\r\n<ul>\n<li><strong>X</strong>: This one will make the main actions such as purchasing or turning on and off.</li>\n<li><strong>Z</strong>: This one will make the secondary actions such as going back or toggling menus.</li>\n<li><strong>Arrows</strong>: These will let you select the items on the view.</li>\n</ul>\n<p>\r\nThe complete source code can be found on Github repository.\r\n</p>\n<p>\r\nAlso the cartridge and the source code is available to download here.\r\n</p>", "metacritic": null, "released": "2022-08-21", "tba": false, "updated": "2022-08-26T16:52:48", "background_image": "https://media.rawg.io/media/screenshots/e96/e964a6db0425143d7e8a9b858bf74db8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Can Durmus"], "genres": ["RPG", "Simulation"], "publishers": [], "esrb_rating": null}