{"id": 842347, "slug": "as-time-goes-by-aiub-dicieleferraz-amanaz-jay-luiz", "name": "As Time Goes By (aiub, dicieleferraz, amanaz, Jay, Luiza Santin, apolinice, JullySaw)", "name_original": "As Time Goes By (aiub, dicieleferraz, amanaz, Jay, Luiza Santin, apolinice, JullySaw)", "description": "<p>As Time Goes By - By Your Side é um dating sim focado em quebrar estereótipos que são vistos dentro do gênero.  Le personagem principal é alguém em uma jornada de autocuidado e autoconhecimento, querendo o melhor pra si.  Em seus quase 40 anos, sua busca por sucesso e estabilidade vem antes da busca por amor, como deseja Dolores, sua melhor amiga, que casará em breve. <br/></p>\n<p>Como o mundo gira e o vacilão roda, logo o player conhece os interesses românticos de nosse personagem principal (Rita, Oliver e Virgil) e elu percebe que é possível ter equilíbrio entre o amor e o sucesso. </p>\n<p>As Time Goes By - By Your Side is a dating sim that focus on breaking stereotypes that are seen in the genre. The main character is someone on a journey of self care and self discovery, wanting only the best for themselves. In their late 30s, their search for success and stability comes before the search for love, as preaches their best fried, Dolores, who is going to be married soon. <br/></p>\n<p>As time goes by, soon the player meets the love interests of our main character (Rita, Oliver and Virgil) and they soon find out that it is possible to have a balance between love and success. </p>\n\n\n<p>A gameplay é igual a maioria dos dating sims da indústria,  jogador clica para passar para a próxima fala e, em pontos importantes, há escolhas que mudam como os NPCs veem le personagem principal. </p>\n<p>The gameplay is identical to most dating sims, the player clicks so they can get to the next line and, in key points in the story, there are choices that change how the NPCs see the main character.</p>\n\n\n\n<p><strong>      Amana Zanella                                                                  Diciele Ferraz <br/></strong>     Game Designer                                                                   Programming <br/>  Narrative Designer<br/>             Writer</p>\n<p><strong>      Fernanda Aiub                                                                    Jay Feydit<br/></strong>    Game Production                                                           Game Designer<br/>   Narrative Designer                                                    Narrative Designer<br/>                                                                                                        Sound Designer</p>\n<p><strong>      Jully Trugano                                                                     </strong><strong>Luiza Santin<br/></strong>         <strong> </strong>2D Artist                                                                              3D Artist</p>\n<p><strong>    Mariana Franco <br/></strong>    UI/UX Designer</p>", "metacritic": null, "released": "2022-08-22", "tba": false, "updated": "2022-08-26T16:48:07", "background_image": "https://media.rawg.io/media/screenshots/59c/59c6afed57854368b60019446600d4b3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Jay", "aiub", "JullySaw", "dicieleferraz", "amanaz", "Luiza Santin", "apolinice"], "genres": [], "publishers": [], "esrb_rating": null}