{"id": 842482, "slug": "meng-you-xian-jing-romanesuku-chronicles-of-refugi", "name": "夢游仙境ロマネスク: Chronicles of Refugia", "name_original": "夢游仙境ロマネスク: Chronicles of Refugia", "description": "<strong>SYNOPSYS</strong><br/><br/>In the year 23XX, the world as we know it has come to an end.<br/><br/>Global warming has caused the sea levels to rise, submerging coastal cities in every nation――a mass extinction event that forever changed life on what remains of the surface.<br/><br/>This extreme climate change sparked violent conflicts in which android soldiers and drone strikes destroyed even more of the land. Now that the last dregs of humanity live within the confines of designated Shelters, for the first time, they are forced to accept outsiders in order to secure their own safety.<br/><br/>You see, not everyone who looks normal on the outside is human on the inside. And while the rest of the world sleeps, these non-humans are slowly taking over...<br/><br/><br/><br/><strong>On the cusp of extinction awaits a Wonderland of human evolution.</strong><br/><br/>Our story is set in Asia, in the aftermath of catastrophic global warming. Thanks to human greed, rising sea levels have submerged cities worldwide, destroying the environment and driving many animal species to extinction. In their place, however, some new neighbors have moved in... and these neighbors aren't quite human.<br/><br/>This story features three \"Alices\": a werewolf, a human, and a mysterious third individual. Each has their own ambitions, and each is faced with the extinction of their kind.<br/><br/><br/><br/><strong>Game Features</strong><br/><br/>Chronicles of Refugia will be released in an episodic, omnibus-style format with unique branching paths. Some stories will only have one ending, some have several, and some will even let you shape the personality of the player character! It all hinges on crucial choices made by the player at key points.<br/><br/><br/><br/><strong>CONTENTS</strong><br/><br/><ul><li>Main Story: Alice the Red<br/></li><li>Another Story: Noah -A Bird Stretches Its Wings-<br/></li><li>Extra Story: Hourei Island Excursion!</li></ul>", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2022-08-29T04:55:30", "background_image": "https://media.rawg.io/media/screenshots/9d2/9d221e330e9baebc060fa0e740d9a78b.jpg", "website": "https://romanesque.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 513, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Medium"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["YOX-Project"], "esrb_rating": null}