{"id": 842489, "slug": "yue-yuan-zhi-bao-castle-of-full-moon", "name": "月圆之堡 Castle of Full Moon", "name_original": "月圆之堡 Castle of Full Moon", "description": "<h3>Introduction</h3><br/>A beautiful elf girl will become the bride of the castle.<br/>But the master is a monster.<br/>The castle is full of mysteries,<br/>There are switches and puzzles,<br/>The castle not only has scary clowns chasing you,<br/>There are also various ghosts and monsters.<br/>You can choose to escape the castle alone,<br/>Or choose a companion,<br/>Or escape with all your companions,<br/>Or live to be the bride of the castle, or even the master.<br/>Nine endings, eight ways to escape,<br/>And eight touching side stories.<br/>The truth of the castle is waiting for you to unravel.<h3>Main features </h3><br/>Weird game atmosphere<br/>heart-pounding fright element<br/>A variety of decryption arrangements<br/>Nightmare chase battle<br/>Nine endings of free choice<br/>touching story<h3>Character introduction</h3><br/>You<br/>Elf beautiful girl with different eyes<br/>A 170-year-old elf with different pupils (equivalent to a human age of 17), gentle and kind. She was considered an ominous person by her clan, and as a sacrificed bride married the cannibal lord of the Full Moon Castle. You must use your own abilities or work with your friends to escape from the Full Moon Castle and discover the truth about the Full Moon Castle and yourself in the process.<br/><br/><br/>Lane<br/>Fallen Vampire Noble Butler<br/>Male, obsessed with age, looks like an elegant butler of the vampire clan in his 20s. A self-proclaimed master of the second generation of the castle, he believes that the heroine can help him restore the glory of the vampire clan. Although he can no longer suck blood because of the demon contract, he can usually cook top-notch delicacies, and he will not easily let go of the dust in every corner of the castle. He is a good steward with due diligence. Usually accompanied by a bat spirit, once the contract is released, it can be transformed into a bat spirit.<br/><br/><br/> Antony ＆ Luna <br/>The wise human handsome boy and his familiar cat<br/>Male, 18-year-old beautiful human with high intelligence quotient. He was rescued by the heroine when he was a child. Because he could understand the master's words, he avoided death and signed a demon contract to become a secretary. He doesn't like to talk, and is accompanied by a familiar cat named Luna. Because in addition to reading books, he secretly practices swordsmanship, and hopes to use human power to kill his master himself and avenge his family. Hope to build a big cat house for Luna after escaping.<br/><br/><br/> Isabelle<br/>Elf's little dancer sister<br/>Female, 180 years old, an elf beauty who is proficient in divination, dance and music theory. The elder sister of the same family who grew up with the heroine also has abilities that are regarded as unknown by the same family, but she chooses to hide it. It seems that she did nothing to make the heroine become a bride, but in fact, she had premeditated. She is old friends with Mr. Mouse from the Castle of the Full Moon, and hopes to find a treasure called the Butterfly Ring in the Castle of the Full Moon and escape from this world with the heroine.<br/><br/><br/>Ellisa<br/>The flower fairy imprisoned in the castle<br/>Female, age unknown. This is a high-level precious flower fairy with super magic power, which can transform into the appearance of a human. She was only deceived by the big-eyed baron's rhetoric, and was imprisoned in the Castle of the Full Moon in the form of a piranha. She needs someone to take her out of the nightmare and re-face her heart and her relationship with the Baron with Big Eyes.<br/><br/><br/>Cavill<br/>The current owner of the Castle of the Full Moon, Baron Big-Eyed<br/>The man, the descendant of the giant-eyed clan, is said to take the appearance of a handsome human baron and sell the devil's contract to the world. On the night of the full moon, he became a prototype due to weakness. It is rumored that the true body of the giant-eyed clan is a huge and strong monster. He also seems to have an unknown side.<br/><br/><br/> Mr. Mouse<br/>This mouse has lived for hundreds of years for some reason. It has witnessed the changes of the Full Moon Castle for hundreds of years, so it is always a picture of an old man. Afraid of Lane, afraid of Luna, like to communicate with girls, and Isabella are old acquaintances.<br/><br/><br/>Ghosts<br/>The ghosts wandering in the Castle of the Full Moon will often scare you, and you can't be sure whether they are friends or enemies. They seem to have their own stories and wishes. Will you help them?<br/><br/><br/>Lucas ＆ Sherry<br/>It is said to be the first generation owner of the Full Moon Castle, the legendary wealthy businessman and his wife.<h3>Author's Words</h3><br/>This game is a Japanese horror puzzle computer game.<br/>As my first official Steam game work,<br/>Looking forward to your sharing, live broadcast, forwarding and valuable suggestions to the official feedback!<br/>Unfortunately, due to my limited English ability, the English version is not yet available, please look forward to it!", "metacritic": null, "released": "2022-08-27", "tba": false, "updated": "2022-08-29T05:04:36", "background_image": "https://media.rawg.io/media/screenshots/1d7/1d7f862d04e60a566420171eb4a46b5b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["starknow", "辛小啊"], "genres": ["RPG", "Indie"], "publishers": ["starknow"], "esrb_rating": null}