{"id": 842485, "slug": "takoyaki-party-survival", "name": "Takoyaki Party Survival", "name_original": "Takoyaki Party Survival", "description": "<strong>The ninth of low-price series of Kimidorisoft! \"Takoyaki Party Survival\" appeared!</strong><br/><br/><strong>For video creators and streamers</strong><br/>KIMIDORI SOFT permits monetization through partner programs using KIMIDORI SOFT games.<br/><br/>Everyone loves takoyaki parties, popularly known as \"Takopa\" in Japan. How many days can a person survive on takoyaki only? What were the ingredients in this takoyaki, and who cooked this takoyaki? Should the sauce be put on it, or should the ingredients have been added in the first place? Collapsing trust, doubt and suspicion. The friendship that grows beyond that.<br/><br/>That is Takoyaki Party Survival...<br/><br/><strong>Game overview:</strong><br/>You should consume a good balance of protein, carbohydrates, and fats to survive. The nutritional balance changes depending on the ingredients you put in your takoyaki. If you are overloaded with calories, you will be too full to eat, so please consume calories by squatting.<br/><br/><strong>Feature:</strong><br/>Online multiplayer: Up to 4 players can play together. There are Quick Match and Friend Match, both of which you are free to enter and leave at any time. In Quick Match, survivors from all over the world are surviving at their own pace. In Friend Match, you can easily play with a specific friend with a single keyword. Of course, you can also play alone.<br/><br/>Cooperation or Interference: In online multiplayer, you can cook takoyaki for other players or, conversely, take their takoyaki away from them.<br/><br/>Skills: Learn and strengthen the skills necessary for survival, such as increasing basal metabolism and squatting efficiency.<br/><br/>Fever Event: Zero calories no matter how much you eat during the event! This is your chance to balance your nutritional needs all at once.<br/><br/>Ingredient Collection: There are more than 20 different ingredients. The longer it survives, the more new ingredients are unlocked.", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2022-08-29T04:59:24", "background_image": "https://media.rawg.io/media/screenshots/567/567d2fe4178a2cc9d5fde2a737dce52f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KIMIDORI SOFT"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["KIMIDORI SOFT"], "esrb_rating": null}