{"id": 84275, "slug": "ice-melt", "name": "Ice Melt", "name_original": "Ice Melt", "description": "-ICE MELT- <br/><br/><br/>★★★★★ www.AppleClan.com<br/><br/>\"Polo’s icy world is a great looking place. The graphics in Ice Melt are, in a word, incredible. From the start up screen onwards they are impressive and as you progress through the levels they only seem to get better. Visually Ice Melt reminds me of a console platform game rather than an iPhone game, the graphics are really that good.\" AppleClan.com<br/><br/>★★★★ www.AppAdvice.com<br/><br/>\"Ice Melt (Free) by Aeralas is an arcade game with a small penguin that loves to melt ice and bounce around. You’ll be moving downward at break neck speeds among a plethora of obstacles while trying to collect as many points as possible.\"<br/><br/><br/>-FALL DOWN MEETS SUPER SPEED!!- <br/><br/>Fly or waddle through this pinball puzzle that is Ice Melt! <br/><br/>Polo is one Angry Penguin!<br/><br/>His ICE is melting! We find our furry penguin friend Polo on the edge of destruction. His land is melting, and he wants out. Buzz through the ten colorful strategy levels and find there are many surprises around every turn. Collect Diamonds in each level and race against the Clock! <br/><br/><br/><br/>FEATURES:<br/><br/>&gt; High Resolution Retina Display Graphics!<br/>&gt; Addictive and ORIGINAL gameplay!<br/>&gt; Game Center Support!<br/>&gt; Ten Fully Engaging Levels! <br/>&gt; Addictive Replayability!<br/>&gt; The Simplest Game on the App Store!<br/>&gt; Strategy, Puzzle, Action, and SPEED!<br/><br/>Race for Time-Attack, High Score, or Exploration! <br/><br/>IMMERSIBLE RE-PLAYABLE LEVELS THAT WILL HAVE YOU EXPLORING FOR WEEKS!<br/><br/>NEW LEVELS PER MONTH!<br/><br/>FULL GAME SUPPORT - TEN EXPANSIVE PUZZLE LEVELS! <br/><br/>Cavern, Capped, Icicles, 'Drix, Vexxed, Valley, Zeust, Stars, Galactic, Finale! <br/><br/>ENJOY ICE MELT! <br/><br/><br/>Aeralas - <br/><br/>Penguins are the real angry birds! There world is really melting!<br/><br/>Global Warming is a serious international issue with profound global effects. It is the effect of Climate Change and the overuse of burning fossil fuels. Global Warming is the average rising temperature of the Earth's atmosphere. Unfortunately, this process has accelerated over the last three decades. There is no doubt to some detrimental effect caused by human beings. All of us, every nation, must contribute to reversing this devastating process to our only world. Economic problems will seem miniscule in comparison. <br/><br/>Download this app in support of Global Warming reform!<br/><br/><br/> <br/>www.Aeralas.com<br/><br/>Try our other apps! <br/><br/>Fruit Loko <br/>Fruit Loko Lite <br/>Phantom Rings <br/>Phantom Rings IPAD <br/>IMadeMoney <br/>ILiteMoney <br/>IMADEMONEYLITE <br/>IMADEMONEYFULL <br/>Webbed <br/>Webbed Lite <br/>Ice Melt Lite <br/>Ice Melt <br/>Ice Melt Delux<br/><br/>Excellent Apps for Christmas gifts! Black Friday all of our apps will be on sale for free! Make sure you stock up then! Enjoy the Holidays!<br/><br/><br/><br/><br/>ADVERTISING OPPORTUNITY - If you would like to advertise in any Aeralas game contact aeralas.fruit@gmail.com for enticing offers.", "metacritic": null, "released": "2011-11-20", "tba": false, "updated": "2019-10-22T14:22:10", "background_image": "https://media.rawg.io/media/screenshots/f14/f1403a0ddeec66a0106c915d5ebfdf51.jpg", "website": "http://www.facebook.com/#!/pages/Ice-Melt/279537272066152", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aeralas"], "genres": ["Action", "Arcade"], "publishers": ["Daniel Iannicelli"], "esrb_rating": "Everyone 10+"}