{"id": 842741, "slug": "bogie-ride", "name": "Bogie-Ride!", "name_original": "Bogie-Ride!", "description": "TriJam#183\r\n<p>\"Unconventional mode of transport\" - I hope, trying to escape with your loot from a bank robbery on a bogie is <em>unconventional enough</em> :-), especially when the Sheriff's in your neck... and he's getting closer!</p>\n<p>Take the challenge for the highest top speed!<br/><strong>Audio: </strong>I really like the audio in this one! If your browser doesn't start the music automatically, activate it by clicking the music button in the top right corner twice. Leave the audio and sound effects on - I love them and they <em>are </em>motivating!</p>\n<p>Use A and D to accelerate your bogie and flee from the Sheriff!<br/>HINT: Use both hands, one for A, and one for D... <br/></p>\n<p>This submission was super funny to write and I caught myself playing for over an hour to get 60+ speed, so there's a challenging highscore for #TriJam #rocknightstudios to beat during the live stream!</p>\n<p>What shall I say... I failed :-)<br/>I uploaded this game with my top 3 scores to beat.</p>\n<p>Post screenshots of the highscores if you beat me!</p>\n<p>Have fun with this one - Cheers, Gris.</p>\n<p>PS: As always, this game has been written with GameMaker Studio and my own gml-raptor platform!</p>\n<p>Development time: 3 hours.</p>\n<p><strong>Credits:</strong></p>\n<p>All audio and pre-built assets are either self-made or CC0 public domain.<br/>Credits to @JujuAdams &amp; Contributors for the scribble &amp; snap libraries.</p>", "metacritic": null, "released": "2022-08-28", "tba": false, "updated": "2022-08-29T07:07:07", "background_image": "https://media.rawg.io/media/screenshots/328/3280f1894395db4a4ca6e79cf5043573.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Grisgram"], "genres": ["Action", "Racing"], "publishers": [], "esrb_rating": null}