{"id": 84281, "slug": "eion-free-beats", "name": "EioN Free-Beats", "name_original": "EioN Free-Beats", "description": "FREE RINGTONES (in iTunes File Sharing - all LOOPS) &amp; COMPLETE FACELIFT!<br/>MUSIC PERFORMANCE - Pro APP you can play Live Gigs with! OR if you need emergency Beats when your rig crashes.. or need sound FX.. AND SOME FREE AWESOME RINGTONES!  (INCLUDED in iTunes File Sharing).<br/><br/>Contains 50 loops, 10 Beat, 10 DubStep, 10 Fun, 10 Sound FX, 10 NEW BEATS, plus Social Media links to explore and listen to full compositions of EioN.<br/><br/>For iPad, iPhone and iPod Touch.<br/><br/>From the Mobile Entertainment Products startup JOHNAVATAR.com™<br/><br/>Design &amp; Code by JOHNAVATAR.com™<br/>Loops &amp; Graphics by EioN™<br/><br/>Get the NEW EioN EP (lots of incredible music!);<br/>http://www.beatport.com/release/square-waves-and-space-rays/938975<br/><br/>INTRO<br/><br/>Enjoy FREE DnB / DubStep and good Fun 8 bit + more loops, plug into GIANT speakers &amp; jump around to the beat, use ‘em to cut between tracks in your DJ set, maybe lay a rap track over the Dub or 8 bit tracks. . . and don’t forget about those great sound effects, engineered by yours truly using Logics built in Synths.<br/><br/>Look for my sounds on SoundCloud &amp; YouTube where there are also Logic tutorials (I take requests).<br/><br/>To contract my services; Composing, Mixing, DJ Live Events (WorldWide), Film and TV and Commercial Soundtracks, International Music Logos…. etc AND for any questions contact me at the following;<br/><br/>Email:  Eyoaha@Gmail.com<br/>WebSite:  http://www.eionmusic.com<br/>FaceBook:  www.facebook.com/EioN.Music<br/><br/>HOW TO USE THIS APP<br/><br/>LOOP PAGE - SINGLE LOOP PAGE OF 50 LOOPS<br/><br/>To use the \"EION Free-Beats™\" APP, simply touch any FACE BUTTON (it changes, they all change, they're funny, UNHAPPY TO FUNNY!:^) on the LOOP PAGE to hear any LOOP, or SOUND.  That LOOP will LOOP indefinitely.  Touch the next one to hear another sound immediately played (no gaps between LOOPS).  Touch any combination of buttons, on any LOOP Page and Play a live gig!<br/><br/>There are 5 sets of LOOPS of a different LOOP STYLE (DRUM and BASS, DUBSTEP, FUN, SOUND FX and NEW).  Each LOOP STYLE has a set of same TEMPO LOOPS, except the SOUND FX, they're just great SOUND FX.  This way, on any LOOP STYLE, you can play a same TEMPO LIVE GIG!  Or mix it up, with different TEMPOS, when you go between LOOP STYLES.<br/>WHATEVER YOU CHOOSE, YOU ARE THE STAR!=)<br/><br/>The last button on the far right of any LOOP PAGE, is a button that takes you to my EION INFO page.<br/><br/><br/>INFO PAGE - EION™ INFO PAGE (RED button, white INFO letters on LOOP PAGE)<br/><br/>Click on any mobile button (Deep Links to Apples Safari App to JUMP TO WEBSITES…)…. (I got rid of the custom web browser, now we use Safari).<br/><br/>Visit my EION SoundCloud page to hear all my newest, long, complete Music Creations.<br/><br/>Visit my EION YouTube Channel, where I am building a complete set of TUTORIALS on using Apple LOGIC PRO, and hear my music and other projects.<br/><br/>Visit my EION Facebook and get in touch with me, chat and etc….. BOOK A GIG!!!!  (MUSIC, OR FILMMAKING!)<br/><br/>The far right button is the DEVICE LOOPS button, that takes you back to the first LOOP PAGE.<br/><br/><br/>THE END<br/><br/>That's about it!  If you have any questions at all about these loops and this APP, any suggestions and etc., feel free to contact US.<br/><br/><br/>ENJOY<br/>EioN &amp; John Avatar", "metacritic": null, "released": "2012-01-24", "tba": false, "updated": "2019-10-22T14:22:10", "background_image": "https://media.rawg.io/media/screenshots/01a/01a0085adebe46132ebfbe0ba50d930c.jpg", "website": "https://www.facebook.com/EioN.Music", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["John Avatar"], "genres": ["Action"], "publishers": ["John Avatar"], "esrb_rating": "Everyone 10+"}