{"id": 843093, "slug": "mingling-necromancer", "name": "Mingling Necromancer", "name_original": "Mingling Necromancer", "description": "<p>Note: We had some major gamebreaking bugs when playtesting in Firefox. Play in Edge browser to make sure you get the intended experience.</p>\n<p>Note #2: The game is very random in its current state. Sometimes you are able to one-hit everything with your spell after just half a minute of game play and sometimes the game feels very hard to beat. If you felt overwhelmed on your first try, don't hesitate to try again because maybe you just had bad luck with the allies that spawned.<br/></p>\n\r\nYou are a powerful necromancer. <br/>Resurrect defeated enemies as allies and make them work together to create mighty spells.\r\n\n\r\nHow it works:\r\n<p>Use you standard attack with left click. When an opponent is slain, an icon above its corpse shows how it can affect your spell if you resurrect it by holding down space + pressing right click. Also, you will have one ally from the start of the game. However, it won´t do anything by itself. To create a spell, you need to connect the allies that you want to use in a row that starts with the player by holding down space and drag n' dropping with the right mouse button. Remove a connection from an ally by drag n' dropping anywhere on the screen. Cast your spell with right click. Note that your spell and your attack both have a cool-down.<br/></p>\n<p>There are 3 main types of allies (detailed description in the table below, feel free to pause the game anytime to look up any unclear abilities):\r\n </p>\n<ul><li>Red allies (”Casters”) cast active abilities that can do damage to enemies or heal allies.\r\n</li><li>Yellow allies (”Modifiers”) modify properties (e.g. damage) of the Caster that comes next in the row. Every Modifier works with every Caster. You can put as many modifiers of every kind in front of a Caster as you want.</li><li>Blue allies (”Specials”) cannot be modified and grant passive buffs after casting.\r\n</li></ul>\n<p>There are different enemy types as well but they should be pretty self-explanatory.</p>\n<p>You win when the timer reaches zero and all left enemies are defeated.<br/></p>\n\n\n\n<p>\n</p>\r\nControls Overview:\r\n\r\nWASD<br/>move<br/>\r\nMOUSE<br/>aim<br/>LEFT MOUSE BUTTON<br/>normal attack<br/>\r\nRIGHT MOUSE BUTTON<br/>cast spell<br/>\r\nHOLD SHIFT/SPACE<br/>\"edit mode\" (slows down time)<br/>\r\nSHIFT/SPACE + LMBclick on ally to kill<br/>\r\nSHIFT/SPACE + RMBclick on corpse to resurrect<br/>drag n' drop to make connection<br/>\r\nRrestart game<br/>\n\n\r\nAlly abilities Overview:\r\n\r\n<br/>Shoots a bullet in the direction of your cursor.<br/>Affects the first character it hits.<br/>\n<br/>Throws a bomb to the cursors location that affects everything in its radius. <br/>\r\nShoots a laser that pierces through everything.<br/>It deactivates in the frame after its first hit, so make sure you aim before you shoot. :D<br/>\r\nIncreases the next Casters amount of damage and changes it from damage to healing. <br/>You can only heal allies and yourself.<br/><br/>Comes in 3 different tiers.<br/>\r\nIncreases the next Casters amount of damage. <br/>If placed after healing Modifier, it switches from healing to damage.<br/><br/>Comes in 3 different tiers.<br/>\r\nIncreases the strength of the next Caster, which has different effects depending on the Caster you connect it to:<br/>Shooting Caster: projectile speed<br/>Bomb Caster: explosion radius<br/>Laser Caster: Laser diameter<br/>Comes in 3 different tiers.<br/>\r\nIncreases the quantity of the next Casters ability.<br/><br/>Comes in 3 different tiers.<br/>\r\nReduces the length of the pause that occurs after a Caster has used his ability.<br/><br/>Comes in 3 different tiers.<br/>\r\nReduces the cool-down of your spell after using it.<br/>\r\nAfter using your spell, the ally next in the row can suffer one hit without taking damage.<br/>\r\nAfter using your spell, the next left-click attack deals more damage.<br/><br/>Comes in 3 different tiers.<br/>\r\n\r\nFeel free to ask questions and give feedback in the comments :)", "metacritic": null, "released": "2022-08-28", "tba": false, "updated": "2022-08-29T09:45:00", "background_image": "https://media.rawg.io/media/screenshots/c96/c9651afecfa5ec1522c6c63015a80d95.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Zerschnetzloar", "SinusMs"], "genres": ["Shooter", "Puzzle"], "publishers": [], "esrb_rating": null}