{"id": 843081, "slug": "lost-in-the-crowd", "name": "Lost In The Crowd", "name_original": "Lost In The Crowd", "description": "<p>Test your perception under pressure as you play as a secret agent trying to find his contact in a crowd of identical people. Hurry up as with every second hidden assasins are creeping closer.</p><p>WASD - move<br/>look around with mouse<br/>Space - pause/unpause</p>\n<p>Made in a week by a solo developer as an entry for Brackeys Game Jam 2022.2, theme: \"You are not alone\".<br/></p>\n<p>DETAILED HOW TO PLAY:<br/>There is a short explanation on how to play found in the menu but since some things may be a bit unintuitive here's a more detailed one. I recommend trying the game first and reading it if you are confused.<br/>- All characters are doing a random action every few seconds. The exception is the field agant(s) who will do their unique book reading action ~60% of the time and assasins who will sometimes give themselves away...<br/>- The field agent will tell you what animations your contacts are doing. Note that these are randomized on every restart and that the contacts behave like everone else before you first talk to a field agent.<br/>- There can be 1, 2 or 3 actions chosen. If it's 1 action, then the contact will be doing it ~50% of the time but noone else will. If it's 2 or 3, the contact will be doing only these actions, but others can do them too.<br/>- In some levels one of the actions will be unknown represented by a question mark.<br/>- When the time runs out you don't immediately lose but the assasins start chasing you more rapidly. You can still survive for a long time afterwards.</p>\n<p>Known bugs:</p>\n<p>- In some levels the contacts UI (hats in upper right corner) displays wrong number at the start (eg. 0/2 when it should be 0/1) Once you find one contact it corrects itself.</p>\n<p>- Rarely the contact talking (and assasin attacking) animation gets interrupted so contact does not put on the hat :c</p>", "metacritic": null, "released": "2022-08-28", "tba": false, "updated": "2022-08-29T09:40:24", "background_image": "https://media.rawg.io/media/screenshots/066/0664940ac29f1e6448773ff48f0ec6ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Filtrax"], "genres": [], "publishers": [], "esrb_rating": null}