{"id": 84304, "slug": "my-virtual-pet-pig-oinky", "name": "My Virtual Pet Pig Oinky", "name_original": "My Virtual Pet Pig Oinky", "description": "Dare to deal with a goofy pig? With this piggy, talking will make more noise. PLAY will DO miracles! Download Talking Pig Oinky and take the challenge!<br/><br/>Talking Pig Oinky belongs to pig games for kids and toddlers. Its great features make this game one of the best games for girls and boys bringing joy and laughter every step of the way. What is more, with Oinky, pig sounds are not just noises, which makes this game a fun game for little kids, too. <br/><br/>Not only will you get to talk to Oinky, but also you can play mini games with him.<br/><br/>FLAPPY PIGGY<br/><br/>Set your pig running and get as much food as you can while trying to stay alive for as long as you can. Fly your piggy as a bird and make sure he gets around all the obstacles. <br/><br/><br/>FOOD DROP<br/><br/>Move your piglet around to get as much good food as possible. Make sure he eats only what is edible because a rotten one means game over. <br/><br/>PIGGY vs. MONKEY<br/><br/>Piggy has challenged the talking monkey to a duel. Tap the screen so that the larger one jumps over the smaller one. If they crash, you lose!<br/><br/><br/>TILT JUMPER<br/><br/>Move your device left and right to move the piggy. If you step on a spring, it will toss you higher. But, watch out for the bombs. They mean game over!<br/><br/>Bad and disobedient piggies can be real pests, but talking piggy Oinky will become your favorite pet pig in a blink of an eye. He is funny and goofy, but he makes talking games for kids and toddlers a real joy! Download Talking Pig Oinky and join pig world to write your own little pig story!<br/><br/>Check out the game's great FEATURES: <br/><br/>▶ Talk to Oinky and he will repeat what you say in a funny voice<br/>▶ Watch the piglet dance<br/>▶ Play mini games with the piggy! Choose your favorite: Flappy Piggy, Food Drop, Piggy Hop, Piggy vs. Monkey, Spider Pig, or Tilt Jumper<br/>▶ Make sure to feed the piggy so he doesn't stay hungry<br/>▶ Play with the piggy in his playroom<br/>▶ Put piggy to bed and lull him to sleep<br/>▶ Play dress up games with the piglet. Choose your favorite outfit and show off your pet pig!<br/>▶ Pet, poke, slap and tease piggy to see what else he can do<br/><br/>Growing up with pets helps children learn how to take care of themselves and others. If you haven't tried animal games till now, this is the right time to do it. Talking Pig Oinky will show you that playing with animals, even the virtual ones is a pure joy! Download the game and enjoy!<br/><br/><br/>Like this game. Check out what Oinky and his friends are up to on Facebook:<br/>https://www.facebook.com/pages/Talking-Games/285061004993400<br/><br/>You can also look up Peaksel's website for more games: http://peaksel.com/<br/><br/>This free game is an intellectual property of Peaksel – copyright 2018.", "metacritic": null, "released": "2014-10-22", "tba": false, "updated": "2019-10-22T14:22:10", "background_image": "https://media.rawg.io/media/screenshots/af7/af7c4072cf8d32f9ee8d4a3dddfb0d57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["RPG", "Family"], "publishers": ["PEAKSEL doo"], "esrb_rating": "Everyone 10+"}