{"id": 84308, "slug": "my-talking-elephant-elly", "name": "My Talking Elephant Elly", "name_original": "My Talking Elephant Elly", "description": "She is CUTE! She's FLUFFY and FLAPPY and comes straight from the JUNGLE! Download My Talking Elephant Elly, your new super sweet virtual pet! <br/><br/>Want an exotic pet? How about a baby elephant? Download My Talking Elephant Elly and play dress up games, mini games, feed, bathe and take care of your own virtual pet elephant!<br/><br/>▶ TAKE CARE OF YOUR VIRTUAL PET ◀ <br/><br/>If you're not familiar with elephant games, here is a chance to change that! Elly is a cute baby elephant who is always eager to play. Not only will you be able to play with her, but also bathe her, make sure she gets sleep and eats well so that she can grow up into being a wonderful adult elephant. Talking games and virtual pets bring lots of laughter, so do not hesitate to download this game for kids as soon as possible!<br/><br/>▶ BE CREATIVE ◀ <br/><br/>Apart from being entertaining, this game for kids encourages creativity with its dress up games and shows. Dressing up talking animals like talking dog or talking cat is fun, but baby elephants are much more fun to play with! <br/><br/>▶ GAME FEATURES: ◀ <br/><br/>► TALK to Elly and she will repeat everything you say in a funny voice<br/>► PLAY dress up games with baby Elly and choose your favorite combination for him to wear<br/>► MOVE up the levels and see Elly grow from baby elephant to an adult elephant<br/>► Elly doesn't eat much so don't forget to feed him<br/>► PLAY mini games with baby elephant. Choose your favorite: Flappy Elly, Jumping Elly, Food Drop, Elly vs. Spikes, Elly vs. Mice, Mastermind, Tic Tac Toe, Bubble Shooter, and Jelly Smash<br/>► MAKE SURE Elly gets enough sleep so that she can play during the day<br/><br/>NOTE: You can play the game and collect points in order to move up the levels. Once you've moved several levels up, you will get fun gifts to help you in the game. Finally, all the rooms have energy levels that need to be charged after some time by playing with the cute baby elephant and taking care of her. <br/><br/>Animal games are great games for kids, especially if your virtual pets are talking animals. Playing with a talking cat or talking dog is usual, but taking care of a baby elephant is totally different. My Talking Elephant Elly enables children to enjoy taking care of a different virtual pet and playing fun elephant games.<br/><br/>▶ MY TALKING ELEPHANT ELLY MINI GAMES ◀ <br/><br/>FLAPPY ELLY<br/><br/>Make your elephant run and get as much food as you can while trying to stay alive for as long as you can. Fly your baby elephant as a bird and make sure she gets around all the obstacles. <br/><br/>FOOD DROP<br/><br/>Move Elly around to get as much good food as possible. Make sure she eats only what is edible because a rotten one means game over. <br/><br/>ELLY VS. MICE!<br/><br/>Tap the screen so that the larger one jumps over the smaller one. If they crash, you lose!<br/><br/>JUMPING ELLY<br/><br/>Make this cute baby elephant go as high in the sky as possible.<br/><br/>MASTERMIND<br/><br/>Guess the code and recreate the hidden row by guessing the correct color of the pins.<br/><br/>TIC TAC TOE<br/><br/>Play the game of X's and O's and make sure you get three of the same sign first or you will lose. <br/><br/>Elephant games for kids can be lots of fun, especially when you play with a baby elephant. Elly is one happy elephant ready to play whenever you are. Talking animals and virtual pets help children learn how to take care of a living being and they are very entertaining at the same time. Download ! My Talking Elephant Elly - Virtual Pet and enjoy playing games for boys and girls all day long!<br/><br/>This free game is an intellectual property of Peaksel – copyright 2018<br/><br/>If you liked this game, check out all the updates on Talking Games Facebook Page: https://www.facebook.com/pages/Talking-Games/285061004993400?fref=ts<br/><br/>Or, if you want to check out some of our other games, visit out website: http://peaksel.com/", "metacritic": null, "released": "2015-08-03", "tba": false, "updated": "2019-10-22T14:22:10", "background_image": "https://media.rawg.io/media/screenshots/3f5/3f5d4523992c286bffff5c64ae70fd49_okuaCwQ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["RPG", "Family"], "publishers": ["PEAKSEL doo"], "esrb_rating": "Everyone 10+"}