{"id": 84314, "slug": "talking-oscar-the-cat", "name": "Talking Oscar the Cat", "name_original": "Talking Oscar the Cat", "description": "A new trouble-maker has come to town! He’s Talking Oscar the Cat and he really is quite something! If you want to adopt a virtual pet, now’s the right time to do it: talking cat Oscar has got both the looks and the wits! There is quite a number of talking animals, but this one seems to be a little bit naughtier than the rest. Surprisingly or not, that’s what makes him charming! Spend some time with this talking pet, and he will goof off and be cheeky just to entertain you and make you smile!<br/><br/>Download Talking Oscar the Cat and enjoy a number of interesting things it has to offer! Oscar, the cat that talks likes to collect stickers, has a bunch of lovely cat coloring pages ready to be transformed into masterpieces, and adores playing mini games – which is why this unique virtual cat game has a plenty of those! Join talking cat Oscar on his journey and discover all his secret games and gadgets that he uses!<br/><br/>TALKING CAT OSCAR FEATURES<br/><br/>◆ AWESOME GRAPHICS with super cute animations<br/>◆ FUNNY POTIONS - buy your virtual pet a potion and see what he'll do (Spoiler alert: it will be hilarious!)<br/>◆ COLLECT STICKERS, put them in a sticker album AND<br/>◆ WIN AWARDS for every completed page in the album or a rare sticker of a talking pet you collected<br/>◆ CAT COLORING PAGES – adorable cat coloring book for kids with lots of cute drawings<br/>◆ DRESS UP – buy home decorations and clothes for your virtual pet<br/>◆ DAILY BONUS – come back every day to play with your talking cat and receive daily bonuses<br/>◆ DAILY MISSIONS – complete daily missions with your virtual pet and win lots of coins and diamonds<br/>◆ SPIN THE WHEEL and try your luck: you can win some pretty cool gifts such as rare stickers, lots of coins or cool outfits for you talking animal<br/>◆ MINI GAMES – earn coins while you play with your talking cat<br/>◆ OSCAR ON FACEBOOK – Log in with your Facebook account to see your friends' virtual pets<br/><br/>LEAGUE OF EXTRAORDINARY PETS<br/><br/>If there was such a league of talking animals, Talking Oscar the Cat would definitely be one of the lead members. Next to already famous talking animals such as Emma the cat and talking dog Charlie, talking cat Oscar would lead the way into the new victories. There hardly is a person who could resist the cuteness of those virtual pets and talking animals. Just look at those goofy eyes! Download Talking Oscar the Cat and have fun with your new favorite virtual cat that talks!<br/><br/>LEGAL INFO<br/><br/>Talking Oscar the Cat, a talking cat app, is an intellectual property of Peaksel.", "metacritic": null, "released": "2017-06-26", "tba": false, "updated": "2019-10-22T14:22:10", "background_image": "https://media.rawg.io/media/screenshots/c82/c82222d0f5baa4296ce8ad3d1a2de984.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["RPG", "Family"], "publishers": ["PEAKSEL doo"], "esrb_rating": "Everyone 10+"}