{"id": 84328, "slug": "my-talking-pinocchio", "name": "My Talking Pinocchio", "name_original": "My Talking Pinocchio", "description": "If you liked virtual pets, you will LOVE virtual toys! Join the adventures of Pinocchio and board an EXCITING JOURNEY of dress up, mini games and much more!<br/><br/>“My little girl loves talking games. So far, Pinocchio is her favorite. She just can't stop giggling,” Jessica Walters (30)<br/><br/>“My girl enjoys all the dress up combinations, but I like the variety of mini games; great pastime fun for both of us!” Josh Smith (32) <br/><br/>Talking Pinocchio is your new virtual friend to talk to, play dress up games and eat with. Toy games are some of the best games for girls and boys and this talking game offers a friend you can take to all your trips and adventures. Talking to virtual pets is amusing, but talking to a virtual doll is so much better!<br/><br/>With its awesome features, Talking Pinocchio brings kids games to another level. You can talk to him and play mini games with him. Yet, even though you are talking friends, Pinocchio is your virtual pet as well so, just like talking cat, talking dog and other talking animals, you will have to feed him, bathe him and tuck him into bed so that he is nice and fresh to play again.<br/><br/>◆ My Talking Pinocchio Features: ◆ <br/><br/>▸ Talk to Pinocchio and he will repeat everything you say in a funny voice<br/>▸ Play dress up games with this talking doll and make him look fashionable<br/>▸ Listen to Pinocchio playing the piano<br/>▸ Don't forget to feed Pinocchio so that he has energy to play<br/>▸ After a long day, Pinocchio needs to sleep and rest<br/>▸ Play mini games with the talking toy: Flappy Pinocchio, Food Drop, Pinocchio vs. Kitty, Pinocchio vs. Spikes, Pinocchio Jump, Mastermind, Tic Tac Toe, Egg Hunt, Jelly Monster Smash, or Bubble Shooter<br/>▸ Advance through levels and get fun gifts<br/>▸ Tickle or tease the talking puppet to see what else he's got up his sleeve<br/><br/>NOTE: You can play the game and collect points in order to move up the levels. Once you've moved several levels up, you will get fun gifts to help you in the game. Finally, all the rooms have energy levels that need to be charged after some time by playing Pinocchio games and taking care of him. <br/><br/>Virtual pets like talking dog or talking cat will make you laugh, but talking Pinocchio will make sure you never feel lonely. With this talking puppet, games for girls and boys have just become more interesting!<br/><br/>◆ My Talking Pinocchio Mini Games ◆ <br/><br/>FLAPPY PINOCCHIO<br/><br/>Make your Pinocchio run and get as much food as you can while trying to stay alive for as long as you can. Fly your Pinocchio puppet as a bird and make sure he gets around all the obstacles.  <br/><br/>PINOCCHIO VS. KITTY!<br/><br/>Tap the screen so that the larger one jumps over the smaller one. If they crash, you lose!<br/><br/>PINOCCHIO VS. SPIKES<br/><br/>Keep Pinocchio moving on the screen, but make sure he does not touch the spikes. If he does, or falls too low, the game ends.<br/><br/>MASTERMIND<br/><br/>Guess the code and recreate the hidden row by guessing the correct color of the pins.<br/><br/>TIC TAC TOE<br/><br/>Play the game of X's and O's and make sure you get three of the same sign first or you will lose. <br/><br/><br/>All these Pinocchio games sound fun? The virtual world of talking pets and toys offers lots of laughter and joy. Talking Pinocchio is a mix of best kids games and dress up games, which makes this talking puppet an awesome virtual friend to talk to. With talking animals you learn how to take care of a pet, but with talking toys, kids can learn how to treat other people as well. Download the game and join us on the adventures of Pinocchio right now!<br/><br/>This free game is an intellectual property of Peaksel – copyright 2016.<br/><br/>If you liked this game, visit our Facebook page to see what's new: https://www.facebook.com/pages/Talking-Games/285061004993400?fref=ts<br/><br/>If you want to try out another pet or a different game, check out our website: http://peaksel.com/", "metacritic": null, "released": "2015-08-03", "tba": false, "updated": "2019-10-22T14:22:11", "background_image": "https://media.rawg.io/media/screenshots/5cf/5cf53d3cc20bebc2dfd01b09c3029416.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["RPG", "Family"], "publishers": ["PEAKSEL doo"], "esrb_rating": "Everyone 10+"}