{"id": 84327, "slug": "red-hands-fun-2-player-games", "name": "Red Hands - Fun 2 Player Games", "name_original": "Red Hands - Fun 2 Player Games", "description": "HOT HANDS have become even hotter and waaaay cooler! Get Red Rands – 2-Player Games and see it for yourself!<br/><br/>How fast can you move? What about your reflexes? Challenge your friends to this fun 2-player game and check who's the first one to get hot hands! Ready? Get set! Gooo!!! <br/><br/>Red Hands – 2-Player Games is based on a game for kids known as “hot hands”, “slaps” or even in some countries “slap jack”. It belongs to games for girls and boys, but anyone who's competitive can play this reaction game.  If you like to play two player games, this is a perfect choice for you!<br/><br/>◆ HOW TO PLAY THE GAME: ◆ <br/><br/>▸ A player stands on each side of the device<br/>▸ Once the game starts, one player is the attacker and the other is the defender<br/>▸ The attacker slaps by tapping once and the defender retreats by tapping at the right time<br/>▸ If the defender chickens out three times, there will be a free hit granted<br/>▸ The first player to reach 10 points wins the game<br/><br/>Make your hot hands look even cooler by choosing some of the AWESOME hand types the game offers. Feel what an animal slaps like, or a skeleton. Choose the mighty Hulk's hand or a tattooed one and play two player games till your red hands start burning high!<br/><br/>◆ TESTS YOUR SPEED AND REFLEXES ◆ <br/><br/>But guess what? The best part about this game is that no matter how hard your opponent's slaps are, you won't feel any pain! Isn't it cool?! Yet, you gotta be careful because the game is designed to test your reflexes and speed so if you don't pay attention, before you know it you'll get hot hands!<br/><br/>You still in doubt? Don't be! With Red Hands – 2-Player Games, you and your friends are bound to have fun. All you need to do is download the game and get ready for some hot hands slaps!<br/><br/>This free game is an intellectual property of Peaksel – copyright 2019. <br/><br/>▸ ▸ ▸ If you like this game, you can check out our website for more fun games. Visit http://peaksel.com/ for more info.<br/><br/>▸ ▸ ▸ Or you can follow us on Facebook and get updated about our newest releases: https://www.facebook.com/Peaksel", "metacritic": null, "released": "2015-02-20", "tba": false, "updated": "2021-01-29T04:46:06", "background_image": "https://media.rawg.io/media/screenshots/874/8747a331529adf06c83f5a71c35d6664.jpg", "website": "http://peaksel.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["PEAKSEL doo"], "esrb_rating": null}