{"id": 843388, "slug": "minishopkeep", "name": "MiniShopKeep", "name_original": "MiniShopKeep", "description": "<p>This game has been developped in participation of the Brackey's 2022.2 game jam, with the Theme : <strong>You are not alone</strong>.</p><p>PS: There seems to be mysteriously ~40px missing on the left of the screen on windowed mode, for a better experience, full screen seems to do the job.<br/></p>\r\nDescription:\r\n<p> </p>\n<p>You are a shopkeeper. Your role is to provide your shop with different resources. </p>\n<p>In order to get resources, you'll have to complete mini-games : </p>\n<p><strong>Forestry</strong>: You have to click or press space whenever the arrow is within the gold box range. Each successful hit will give you wood logs. After three misses, you'll be sent to the main menu. </p>\n<p><strong>Miner</strong>: Some circles will appear. When the outer circle is close to the inner circle : press the key indicated. If there is no letter shown in the inner circle, you will have to click on it at the right moment. Each success will grant you one ingot. If you fail once, you will be sent to the main menu. </p>\n<p><strong>Fishing</strong>: Move the fishing hook up or down by pressing up and down arrow, or the \"W\" or \"S\" key (or \"Z\" and \"S\" if \"AZERTY\" keyboards) to catch fishes. Avoid Jellyfishes at all cost or you will be sent to the main menu. </p>\n<p><strong>Gardening</strong>: Plant a seed into an available slot. It will take some time to grow, but you can do other things (like another mini-game or watch your shop) while it grows. </p>\n<p>Don't forget : <strong>YOU ARE NOT ALONE!!</strong> Hire employees in order to help you serving customers! The shop will be running even if you are not watching it  In the upgrade menu, you can hire more employees to work in your shop or to help you out gathering resources!<br/></p>\n<p>Most importantly: <strong>The first shop worker is free to start making gold.<br/></strong></p>\r\nCredits:\r\n<p>This game was made by:</p>\n<ul><li><strong>BaDiHoP</strong> (Game Developer)</li><li><strong>Oolaballuh</strong> (Game Composer) </li><li><strong>Raynorhs</strong> (Game Designer)</li></ul>\r\nSoftwares:\r\n<ul><li><strong>Aseprite</strong> (Image editor for pixel art and animations)</li><li><strong>FL Studio</strong> (Computer-Assisted Music software)</li><li><strong>Unity </strong>(2D and 3D Game Engine)</li></ul>\r\nWork In Progress:\r\n<ul><li>Add achievements.</li><li>Add crafts recipes.</li><li>Add a dungeon mini-game (to gather resources from monsters and add a lot of recipes / content).</li><li>Add Personnal Records for mini-games.</li><li>Add Sound Effects.</li><li>Add an option menu (for audio managment for example).</li><li>Update UI.</li><li>Update pixel art quality / Add more details.</li></ul>", "metacritic": null, "released": "2022-08-28", "tba": false, "updated": "2022-08-29T12:00:09", "background_image": "https://media.rawg.io/media/screenshots/233/233a2c98bee123cffc9c027ef14f020b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BaDiHoP", "Raynorhs"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}