{"id": 84351, "slug": "santa-claus-christmas-game", "name": "Santa Claus - Christmas Game", "name_original": "Santa Claus - Christmas Game", "description": "Get ready for an AMAZING Christmas and FUN TIMES with Santa Claus!! Download Santa Claus and listen to Christmas carols, talk to Santa, play mini games and much more!<br/><br/>This Christmas, enjoy Xmas games in a totally different way because Santa Claus is one of those talking games that will keep you busy for hours! The game is simple which sorts it among fun Christmas games for girls and boys. Yet, some of the features make this game a cool game for teenagers and even adults. It belongs to those addicting games people really love playing. <br/><br/>◆ Game Features ◆ <br/><br/>▸ Talk to Santa and he will repeat everything you say in a funny voice<br/>▸ Write a Christmas card for friends or family<br/>▸ Swipe the screen left or right to see Santa Claus dancing<br/>▸ Touch Santa's hand and he will start ringing Christmas bells<br/>▸ If you behave, Santa will give you a Christmas gift<br/>▸ Swipe the screen up and down to see Santa jumping around<br/>▸ Touch the screen to see what else Santa can do<br/>▸ Watch out for those snowballs because Santa Claus is not afraid of throwing them at you<br/>▸ Play mini games with Santa Claus. Choose your favorite: Flappy Santa, Food Drop, Santa Jump, Spikes, Santa vs. Snowman<br/><br/>◆ COOL MINI GAMES ◆ <br/><br/>FLAPPY SANTA<br/><br/>Set Santa running and get as much sweets as you can while trying to stay alive for as long as you can. Fly your Santa Claus as a bird and make sure he gets around all the obstacles. <br/><br/>FOOD DROP<br/><br/>Move Santa around to get as much good food as possible. Make sure he eats only what is edible because a rotten one or items that are not food mean game over. <br/><br/>SANTA JUMP<br/><br/>Set Santa Claus jumping higher and higher. Make sure he does not fall through though!<br/><br/>SPIKES<br/><br/>Flow your Santa in between the spikes, but make sure he doesn't touch any because if he does or falls too low, the game is over.<br/><br/>SANTA vs. SNOWMAN<br/><br/>Santa has challenged the snowman to a duel. Tap the screen so that the larger one jumps over the smaller one. If they crash, you lose!<br/><br/>◆ FUNNY CHRISTMAS JOKES ◆ <br/><br/>Press the smiley face button on your screen to listen to cute jokes about Christmas that will make you laugh over and over again.<br/><br/>◆ AWESOME CHRISTMAS SONGS ◆ <br/><br/>Press the music button on your screen to listen to all the well-known Xmas melodies, such as: Jingle Bells, We Wish You a Merry Christmas, Deck the Halls, Up on the Housetop, Oh, Christmas Tree<br/><br/>Santa games for kids have never been more fun, especially around the jolly time of Christmas holidays. While you are waiting for your letter from Santa Claus, you can talk to Santa or play mini games with him. If you're more of a music lover, play Christmas carols and watch Santa Claus dancing around. Xmas games bring much joy to everyone. So, what are you waiting for? Download Santa Claus and start your own Christmas story!<br/><br/>▸ ▸ ▸  This free game is an intellectual property of Peaksel – copyright 2017. ◂ ◂ ◂ <br/><br/><br/>If you liked the game and are looking for similar ones, check out our Facebook page:<br/>https://www.facebook.com/pages/Talking-Games/285061004993400<br/><br/>You can visit our website for more fun games to play:<br/>http://peaksel.com/", "metacritic": null, "released": "2014-12-30", "tba": false, "updated": "2019-10-22T14:22:11", "background_image": "https://media.rawg.io/media/screenshots/c5b/c5bb961b2515847262acdc566db996ce_SdY4F3X.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["Family", "Puzzle"], "publishers": ["PEAKSEL doo"], "esrb_rating": "Everyone 10+"}