{"id": 844124, "slug": "grow-itch-hitbox-games", "name": "Grow (itch) (Hitbox Games)", "name_original": "Grow (itch) (Hitbox Games)", "description": "<p>The king of the dolphins has to protect and grow with them. Be aware of unfriendly stuff and try to beat the global leaderboard for all 5 levels.</p>\n<p>If it is too slow or buggy in your browser, please download the Windows Version. All levels and the global leaderboard work fine and it is more fancy on PC. <br/></p>\n<p>Controls:</p>\n<p>Xbox, PS Controller or Gamepad is supported. </p>\n<p>WASD or Array Keys to turn the dolphin king.</p>\n<p>Space /  Button (A) or (X) or Mouse Left Button: Swim fast</p>\n<p>Keyboard E  / Button  (B) or (Circle) or Mouse Right Button: Switch to another group member</p>\n<p>Escape / Options / Backspace: Pause menu</p>\n\n\n<p>This game is done in one week for Brackeys Gamejam 2022.2. It is a demo only. If you like it: Please share feedback. All is motivation to do a proper game after the gamejam voting. <br/></p>\n<p>What was the plan?</p>\n<p>More enemies, more skills, better flocking, better collisions, more animations, higher quality stylez artwork, more fx, more levels, and some surprises. <br/><br/></p>\n\n<p>Tech Info:</p>\n<p>Done in unity3d with some modified art assets from the assetstore. Code base was a self written flock script from a unity tutorial and some UI scripts and the leaderboard base from the previous 2021 gamejam. <br/></p>\n<p>All Levels are generated procedural, so you never play again the same setting again. <br/></p>\n<p>Music and FX done by my alter ego Richard Steinschlag.</p>\n<p>Have fun with this fishy adventure!</p>\n<br/><br/>", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2022-08-29T17:48:39", "background_image": "https://media.rawg.io/media/screenshots/8c5/8c588536d49f2dff88d0c82926f46d3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["HITBOX GAMES"], "genres": [], "publishers": [], "esrb_rating": null}