{"id": 844197, "slug": "market-sergentben", "name": "Market (Sergentben)", "name_original": "Market (Sergentben)", "description": "<p>\"Market\" is a game where you control an enterprise that must survive. Each turn, your enterprise consumes energy and if this energy falls to zero, you lose. To survive, your only solution is to rely on the economy and more precisely on a market allowing you to buy or sell energy at a price depending on supply and demand.\r\n</p>\r\nThe companies\r\n\r\n<p>As an enterprise, you can own up to 4 types of resources. Cash, energy, mines and generators.\r\n</p>\n<p>You play in a world where several enterprises are present. On average, each round, one enterprise appears. The other enterprises work with a neural network that evolves by natural selection. Therefore, they can adapt to your strategies.\r\n</p>\n<p>However, this adaptation will require future updates to be fully functional.\r\n</p>\r\nThe market\r\n\r\n<p>\tThe market is the place where money and energy are exchanged. Its price is set by supply and demand and changes with each round. You can see the market price on the left graph of your interface. The grey bar shows the 1 (1 of cash = 1 of energy) and the red bar the last price. However, you cannot know the next price that the market will adopt.\r\n</p>\r\nThe plants\r\n\r\n<p>\tAnother way to exchange cash and energy are plants. There are two types: mines and generators. Once built, factories will have a passive role. Each turn they will give you a certain amount of resources. However, each turn they will also deteriorate which will reduce their number. \r\n</p>\n<p>\tMines are built with cash and consume energy each time they are turned. They produce cash. At the end of its life, a mine that cost 1 cash will have consumed 1 energy and produced 2 cash.\r\n</p>\n<p>\tThe generators are built with cash and consume nothing. They produce energy. At the end of its life, a generator that cost 1 cash will have produced 1 energy.\r\n</p>\r\nMaking a profit\r\n\r\n<p>\tIn order to continue to exist, you need to make more profit than you consume in energy. You currently have four ways to make a profit:\r\n</p>\n<ul><li>You can bet on an increase in the price of energy. In this case, you have to buy energy with your cash on the market and then wait for the price to rise. Once the prices are high enough, sell your energy.\r\n</li><li>You can bet on a decrease in the price of energy. In this case, you sell your energy and wait for the price to go down. Once prices are low, you buy back energy.\r\n</li><li>You can bet on prices smaller than 1 cash for 1 energy. In this case, you build mines and sell your cash on the market to get the energy back for its production.\r\n</li><li>You can bet on prices higher than 1 cash for 1 energy. In this case you build generators and sell your energy on the market to get cash.\r\n</li></ul>\r\nThe controls\r\n\r\n<p>\tYour interface has 4 parts. At the top, you can find your amount of agent and energy.\r\n</p>\n<p>\tUnderneath you will find sliders that allow you to use your cash or energy. A fully expanded slider means that 100% of your cash or energy will go to this task.\r\n</p>\n<p>\tFurther down, you will find two graphs. The first one shows you the latest market prices and has already been described above. The second one shows the resources you have. In blue you have the energy, in green the cash, in red the generators and in yellow the mines.\r\n</p>\n<p>\tAt the bottom you have a button that allows you to advance one turn. Next to it is a button that activates an automatic lap scroll as well as a slot to set the speed. 1 equals 1 turn per second, 2 equals 2 turns per second and so on. You can set 0 to go at the highest possible speed.\r\n</p>\n<p>On downloadable version, atl+f4 to quit.</p>\r\nFuture updates\r\n\r\n<p>\tThe game is still at an early stage of development and many new features are to be added. Among them you will find:\r\n</p>\n<ul><li>A redesign of the code structure to allow the creation of mods. A tool to create mods integrated in the game. A small set of mods, allowing to test other things, available in a start screen.\r\n</li><li>The possibility of having several game modes such as a survival version without creating a new enterprise but with a certain number already created at the start.\r\n</li><li>The ability to create your own artificial intelligence in the game. This option will allow you to play games over thousands of rounds and see other companies adapt to your strategy.\r\n</li><li>The possibility to save your game to resume it whenever you want.\r\n</li></ul>", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2022-08-29T18:21:25", "background_image": "https://media.rawg.io/media/screenshots/3cb/3cb7cc087e2b2872f9f9c44527f0a21c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Sergentben"], "genres": [], "publishers": [], "esrb_rating": null}