{"id": 844238, "slug": "hoverboard-simulator-itch", "name": "HoverBoard Simulator (itch)", "name_original": "HoverBoard Simulator (itch)", "description": "<p>A skateboarding type game using a hoverboard.<br/></p>\n<p>This is different from a regular skateboard game since the board is hovering and therefore has no traction. A skateboard's wheels all roll concurrently in one direction and prevent the board from sliding around from side to side or spinning/pivoting in any way. The hoverboard does not have this feature. You have to manually keep it in a forward trajectory by steering then accelerating to straighten out or you will be thrown off the board. You can also be thrown off by crashing into the walls and other objects too hard (however the inner walls of the ramps don't cause crashes no matter how hard you hit them just to make it a bit easier for the player to use them). You can turn off crashing and enter safe mode by pressing '2' and change back to regular mode with crashing by pressing '1'. If you reset the level (by pressing 'T') you will need to set it to safe mode again. \r\n</p>\n<p>How to play:\r\n</p>\n<p>Press 'W' to accelerate forward. Press 'S' to accelerate backwards. Press 'Space Bar' to jump. Hold left click on the game screen to turn. The further left or right you click the harder you turn in the given direction. You can add power/acceleration to your turn by pressing 'A' if turning left and 'D' if turning right while you still have the left mouse button held down. Hold right click to brake/stop. \r\n</p>\n<p>Tips:\r\n</p>\n<p>You need to accelerate out of your turns to straighten out. The crash sensitivity when you hit walls is very high so even if you are going quite slow you can still crash so be mindful of that. Use left mouse click turning while airborne to straighten out your landing if you can see that you will otherwise land sloppily. Don't try to jump off ramps or funboxes if you are going too fast just let your momentum launch you or else you will go too high and far and likely crash. If you are riding in one of the bowls you usually need to steer with the direction you're moving going up to the lip then steer against it when coming back down again or you will be thrown off the board. Do not go too fast in the bowls or try to get massively vertically airborne like in a skateboarding game or you will just be thrown out by your momentum after you cross the lip. Try practicing riding in the bowls in safe mode at first if you are finding it too difficult.\r\n</p>\n<p>Note:\r\n</p>\n<p>The hoverboard does shift it's center of mass when steering, reversing, and accelerating but it also uses a lot of code to control it besides simple leaning like on a real life skateboard. I believe any hypothetical hoverboard that you would imagine could be produced in the current or future world would work similarly using digital sensors and computer/mechanically assisted means to move around so I don't think it's overly abstracted in that way at least. It doesn't actually hover in any sense though. When grounded it just slides around on an invisible controller along the various surfaces with no friction to create the appearance of the board hovering above the surface.\r\n</p>", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2022-08-29T18:41:25", "background_image": "https://media.rawg.io/media/screenshots/c90/c9061365a39af4ef288864fa0da23ad0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mop_bucket"], "genres": ["Simulation", "Sports"], "publishers": [], "esrb_rating": null}