{"id": 844204, "slug": "aags-down-to-fun", "name": "AAGS: Down To Fun", "name_original": "AAGS: Down To Fun", "description": "<p>AAGS: Down To Fun (ADTF) is a fictional, contemporary, slice-of-life series of stories set in the YAGS universe, following a gay man's journey of finding love and coming to terms with his asexuality. No prior knowledge of YAGS is necessary to enjoy the series, although it does contain spoilers for works in the YAGS series of games and writing.\r\n</p>\n<p>(If you're familiar with YAGS, then ADTF is the story of Jake post-graduation, in the \"route\" where he and Nate broke up shortly before their 5-month anniversary.)\r\n</p>\n<p>ADTF was created for YaoiJam 2022 and is a collaboration with Deevilj, with sensitivity reading by TangledVirus.</p>\n<p><strong>Note: This is a Kinetic Novel.</strong> That means that this game has no player choices, and instead is more like a book with art. It also features a few CGs and unlockable character profiles.</p>\n\n<p>ADTF is a Kinetic Novel and does not feature player choices.</p>\n<p>The game features:</p>\n<ul><li>54.7k words across 11 chapters</li><li>6 CGs, plus 8 viewable background renders</li><li>Unlockable character profiles</li></ul>\n<p>You can also obtain some ADTF stickers! (Or see the full set of available YAGS-verse swag.)</p>\n<p>ADTF features explicit language, discussions of sex and sexuality, discussions of romantic and sexual relationships between two men, and censored visual male nudity. As such, the game is not for minors.</p>\n<p>ADTF does not feature explicit sex or explicit nudity in its sprites or CGs. Unlike other YAGS-verse games, the game cannot be uncensored.</p>\n\n<p>YAGS, or Yearning: A Gay Story, is a traditional visual novel with dating sim elements following a (different) gay man's journey of coming out and navigating college life. Its sequel ZAGS, or Zen: A Gay Sequel, is a stat-based dating sim also set in college.\r\n</p>\n<p>Playing YAGS or ZAGS is not necessary to enjoy ADTF, as the game includes a prologue chapter summarizing all character and plot information necessary for the series. It also includes in-game unlockable character profiles that can serve as a further reminder as you read.\r\n</p>\n<p>However, <strong>ADTF will heavily spoil major plot points in both games and the YAGS universe as a whole</strong>, so it is recommended that you enjoy the games first before consuming ADTF .\r\n</p>\n<p>If you're looking for games or visual novels with player choice, you will instead want to check out other works in the YAGS universe.\r\n</p>", "metacritic": null, "released": "2022-08-26", "tba": false, "updated": "2022-08-29T18:25:10", "background_image": "https://media.rawg.io/media/screenshots/445/4451e1a5219c19a75a14615a35df1bb4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["bobcgames", "Deevil"], "genres": [], "publishers": [], "esrb_rating": null}