{"id": 844386, "slug": "facettes", "name": "Facettes", "name_original": "Facettes", "description": "<h3>The game</h3>Sitting at her messy desk. The objects that dress it evoke chimeras, stories and fantasy characters for our protagonist, the Author. Dreamy and immersed in her imagination, she brings this decor to life.<br/><br/><br/><br/>Through this introspective adventure, explore the identity questions of the Author, this faceless protagonist. Let yourself be guided by this inner journey to the rhythm of her personal wanderings.<br/>The Author is the character that you will play and follow through her inner journey.<h3>The gameplay</h3>Dice in hand and perched on this desk, the Author of Facettes invites you on a journey of identity initiation. At your fingertips is a dreamlike world, populated by heroines, Potentials and life paths to discover.<br/><br/><br/><br/>The Author keeps creating more Potentials using tabletop RPG mechanics: roll a dice and assign values to various characteristics in the process of character creation.<br/>There is a set of Potentials to collect, alongside the objects which inspired them and the voice recordings of the Author’s thoughts.<h3>The Potentials</h3>Her experiences give life to fantastic creatures and worlds yet imbued with reality that nourish the personal construction of this mysterious Author.<br/><br/><br/><br/>These creatures are the \"Potentials\", enigmatic women whose stories represent many possible lives for this mysterious protagonist. They each have a past, a purpose, and ties with other Potentials in this introspective journey.<h3>The world</h3>The stories of these chimerical women gradually come to life through the dreams of the Author in the phantasmagorical world they inhabit.<br/><br/>Mirror Island is the main place of this fantasy universe. There is where most of the Potentials live, but some of them are not terrestrial beings.<br/>The island is torn apart by a conflict involving many of the Potentials rivaling to rule this land.<h3>Features</h3><ul><li>An inclusive and LGBTQIA2+ game celebrating the queer identity, which is also an accessible and nice-looking game introducing an issue by experiencing it<br/></li><li>A metaphorical and poetic experience sharing the process of self-discovery and accepting one’s identity<br/></li><li>A relatable story that contributes to build empathy with the Author, the characters and LGBTQIA2+ community, providing more content to understanding the issue and self-questioning</li></ul><h3>Nuances</h3>Facettes is the third game from the Nuances series which holds a strong message about feminism, LGBT+ themes or inclusiveness.<br/><br/><br/><br/>It follows Sweet Love, a game about moral harassment within a couple, marital rape and femicides and A Comfortable Burden, a game tackling mental load with an otter couple.", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-02T03:35:05", "background_image": "https://media.rawg.io/media/screenshots/6c3/6c3b830d934dc66ea77ec666d19bf49e.jpg", "website": "https://otterways.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["OtterWays"], "genres": ["Indie"], "publishers": ["OtterWays"], "esrb_rating": null}