{"id": 844371, "slug": "stick-it-to-the-stickman", "name": "Stick It to the Stickman", "name_original": "Stick It to the Stickman", "description": "<p>Welcome aboard,[Name]! You are one of the most proficient and resourceful candidates we have hired so far. We hope you like the amenities here, and make sure your talents are utilized!</p>\n<p>Stick it to the Stickman is a practical guide for anybody seeking to climb the corporate ladder in the fastest way possible. A groin-kicking, staple-gunning, chainsaw-wielding roguelike brawler loaded with high-impact, physics-based combat, copious amounts of coffee, and weaponized farts!</p>\n<p>Batter your way through coworkers, middle-management, and bosses, learning more powerful “business techniques” on your way to becoming CEO of the worst company in America.</p>\n<p>Fight Hired With Fired<br />\nAttack is the best form of defense in business, and it’s kill or be killed. Pick up powerful upgrades and HR-approved weaponry to ensure your Stickman is more than just a yes-man.</p>\n<p>Go The Extra Mile<br />\nYour career trajectory isn’t just vertical! Incorporate new subsidiary companies to squeeze out the competition, with each acquisition offering new gameplay, new enemies, new bosses, new weapons, and more! Build a conglomerate that rules the marketplace and dominates our hearts!</p>\n<p>Grab The Low-Hanging Fruit<br />\nStick it to the Stickman’s corporate dystopian setting, with clever yet harrowing gags about the future under capitalism, is sure to raise a smile at next year’s company retreat!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-11-04T20:13:41", "background_image": "https://media.rawg.io/media/screenshots/48b/48b041e9b16fd9fb2c3340bbcefa820e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Free Lives"], "genres": ["Action"], "publishers": ["Devolver Digital"], "esrb_rating": null}