{"id": 844437, "slug": "ceaseless-2", "name": "Ceaseless", "name_original": "Ceaseless", "description": "<h3>Are You Ready To Brave The Tower?</h3><br/>In 'Ceaseless', your protagonist has been locked away in the deepest level of the underground tower. After finally being freed from their shackles, it is time to risk everything to reach the top, and finally smell the fresh air again. Will you guide your hero to freedom?<br/><br/>'Ceaseless' is a top-down action game designed with minimalist pixel graphics, where one slip up will find you back at the first level of the tower. Each level of the tower is complete with unrelenting enemies, enticing potential items, and a uniquely crafted score, so every level should bring something new to the player.<h3>Game Features</h3><br/><ul><li>Top down action gameplay without the interruptions of text or pop-ups. Just combat from start to finish.<br/><br/></li><li>Charming minimalist pixel graphics.<br/><br/></li><li>100 monsters spanning 10 different areas, with each area having uniquely themed bosses.<br/><br/></li><li>Randomly generated items and stat increases, so no two runs should be the same.<br/><br/></li><li>Tiny Knight earns distinctive techniques and abilities.<br/><br/></li><li>A quirky musical composition that ensures that no two areas will have the same background music.</li></ul><h3>Ceaseless Action Awaits</h3><br/>If you enjoy a 2D pixel environment, with a ton of interesting monsters, items, and abilities, then the tower is waiting for you! The only remaining question is whether or not you can defeat what lies in store for you inside.", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-02T04:36:33", "background_image": "https://media.rawg.io/media/screenshots/f99/f9919a9ad959faa731084aa061a4cf1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nightly Knights Interactive"], "genres": ["Action"], "publishers": ["Nightly Knights Interactive"], "esrb_rating": null}