{"id": 844401, "slug": "gerda-a-flame-in-winter", "name": "Gerda: A Flame in Winter", "name_original": "Gerda: A Flame in Winter", "description": "When the snow stops falling, the small Danish village of Tinglev will no longer be the same. Walk the path of Gerda as her quiet life is turned upside down during the World War 2 occupation of her home. Choose where to go, how to act, and who to trust in this intimate narrative RPG-lite experience inspired by real life events. How far would you go to protect your loved ones?<br />\nIn this poignant story-driven game, you play as Gerda, a nurse whose life is turned upside down overnight. A tale told not on the front line, but in the intimate setting of the small Danish village she has lived her whole life. Armed only with her wits and knowledge of her people, Gerda must try to save her loved ones while staying true to herself.<br />\nEvery dilemma is challenging and every decision critical in times of turmoil such as war. Make your choices through a mix of exploration, dialog, and resource and relationship management. Your personality traits are your skills in this unique narrative RPG-lite experience and your connection with others also determines how the story unfolds.<br />\nGerda: A Flame in Winter is a tale of compassion, community, and courage, inspired by real life experiences and events. Unearth a hidden side of history and tell your own story.<br />\n- Explore multiple branches and endings<br />\n- Develop your personality using your diary<br />\n- Collect items and relations points that will impact your choices<br />\n- Enjoy a distinctive art style influenced by Nordic Impressionist paintings<br />\n- Immerse yourself in a story inspired by a real member of the Danish Resistance during WW2</p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2024-02-21T11:38:07", "background_image": "https://media.rawg.io/media/games/130/1308897516050baac11b44a919caab16.jpg", "website": "", "rating": 3.18, "rating_top": 4, "added_by_status": {"yet": 5, "owned": 21, "beaten": 4, "toplay": 13, "dropped": 3}, "playtime": 5, "achievements_count": 3, "ratings_count": 10, "suggestions_count": 526, "game_series_count": 0, "reviews_count": 11, "platforms": ["PC", "Nintendo Switch"], "developers": ["PortaPlay"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["DONTNOD Entertainment"], "esrb_rating": "Teen"}