{"id": 844439, "slug": "fold-stories-2", "name": "Fold Stories", "name_original": "Fold Stories", "description": "Play as a paper sheet lost in a dreamlike origami world to explore. Unfold the story to understand who you are and what happened.<br/><br/><br/><br/>Step into this chimerical origami universe. As you start as a simple sheet of paper, you will learn how to fold into different shapes to progress level after level. Meet the rare animals that inhabit this world and collect the many pieces of the story scattered in this world.<br/><br/><br/><br/>Who are you? What are you? What is this place? Why are you here? Try to find the answer of your presence in this mysterious world.<br/><br/><h3>The game</h3><br/>Explore this combat-free and safe environment, filled with beautiful landscapes in which you can serenely discover the reasons for your journey. Evolve with the paper sheet to grow and change your perspective on this world as you change shapes to move forward.<br/><br/><br/><br/>Acquire new capabilities and features as you fold into different animals, rabbit, frog, bat, crane and even more shapes to progress in this place and solve the puzzles that block your way out. The world’s scenery changes as you start to unravel the story.<br/><br/>This introspective journey might as well be an eye-opening experience and change your perspective, too.<h3>The shapes</h3><br/>Fold into a rabbit to jump, dig and run faster!<br/><br/><br/><br/>Fly away as a bat to see in the darkness and explore out of reach areas.<br/><br/><br/><br/>Dive as a frog to swim in depths, jump and soak paper.<br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-02T04:38:54", "background_image": "https://media.rawg.io/media/screenshots/edf/edf122d34903a4b8023860f27fe661cf.jpg", "website": "https://otterways.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["OtterWays"], "genres": ["Adventure", "Indie"], "publishers": ["OtterWays"], "esrb_rating": null}