{"id": 844425, "slug": "third-power", "name": "Third Power", "name_original": "Third Power", "description": "Third Power is a twist on the traditional puzzler, where players must balance alternating between two distinct forms and use the unique abilities of each in order to advance through a mysterious and dangerous cave system. You’ll have to dodge traps and monsters, deflect projectiles, and decipher clues as you puzzle your way through the numerous stone chambers, each of which boasts unique challenges to overcome in order to progress.<br/><br/><br/><br/><br/><br/><strong>Creative Puzzles</strong><br/>Each area presents new and exciting elements to discover. You’ll have to rely on the powers associated with each of your forms to figure out how to get through to the next room. From hidden panels to mysterious switches to manipulating projectiles to traversing mazes, there is no shortage of exciting brain teasers and satisfying solutions laid out before you.<br/><br/><br/><br/><strong>Dangerous Foes</strong><br/>Keep your eyes up - or you might get encased by jelly! You may have to dodge a wolf that can manipulate your very form, too. Keep your wits about you and make the best use of your powers to avoid the creatures that defend these enchanted halls.<br/><br/><br/><br/><strong>Mysterious Lore</strong><br/>As you make your way through the perilous chambers ahead, you’ll uncover hints of a curse laid over the area, threatening anyone who dares move through the caves to satisfy their desire for fame or treasure. Will you be the first to achieve your goals without succumbing to the curse? Uncover the secrets of the tomb, before it’s too late...<br/><br/>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T04:20:57", "background_image": "https://media.rawg.io/media/screenshots/a3c/a3c67ffcde9aaac15cd614f31cd97b2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Plot Armor Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Plot Armor Studios"], "esrb_rating": null}