{"id": 844402, "slug": "the-dragoness-command-of-the-flame", "name": "The Dragoness: Command of the Flame", "name_original": "The Dragoness: Command of the Flame", "description": " <br/><br/>A HOMM-inspired adventure with a roguelite twist. Embarking on an epic quest across the Drairthir Peninsula – a land ravaged by warring factions of Dragons – you take the role of a Commander, recruited by The Dragoness, in her bid to conquer and bring peace to the world. <br/><br/>Finding yourself in the ruined capital of Níwenborh, it’s down to you to rebuild this once-great city. Only by recruiting a powerful beast army and managing your resources will you be able to prepare yourself for the dangers that lie ahead - where only keen strategic thinking and tactical skill will see you emerge victorious. <br/><br/><br/> <br/> <br/><br/>In a classic combat system, great strength counts for nothing without solid tactics. Enter challenging, turn-based, HOMM inspired battles. As you lead your allied creatures to victory, use what you’ve learned about your enemies’ attacks to do your best to minimize your losses. As your beast army grows in numbers, experiment with unit types and skill synergies to find a playstyle that suits your strategic thinking – and forges the best path to success.<br/><br/> <br/> <br/><br/>Your defeats will only serve to fuel your determination. Embark on roguelite adventures during which you will explore the ever-changing Drairthir Peninsula in search of vital resources, powerful creatures to add to your army, ancient artefacts to enhance your power, and enemies to crush. Each journey will unlock new beasts, skills and base upgrades. Don’t despair over your downfalls, as each time you will rise up stronger, blazing your own path through the hero progression system.<br/><br/> <br/> <br/><br/>Your battle prowess alone might not be enough to save the world from succumbing to darkness. Prove your worth as The Dragoness’ Commander, by restoring Níwenborh and reinforcing its army. Gather resources, care for your beasts, manage the development of the capital and decide on the direction of your progress. In this world, your choices are everything: pick which paths to explore and beasts to collect; choose which fights are worth the effort and which should be avoided for now. <br/><br/> <br/> <br/><br/><ul><li>Immerse yourself in HOMM-like exploration and combat.<br/></li><li>Embark on roguelite adventures, growing stronger with each defeat.<br/></li><li>Take on the role of the Commander and develop her powers and skills.<br/></li><li>Recruit a formidable army of beasts to do your bidding on the battlefield.<br/></li><li>Fight battles that will challenge your strategic thinking.<br/></li><li>Choose from a huge range of abilities and artefacts - experimenting with powerful skill synergies.<br/></li><li>Gather resources to manage and develop the Capital City of Níwenborh.<br/></li><li>At The Dragoness’ behest – put down a rebellion and regain control of the kingdom against a demonic dragon adversary.</li></ul>", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2024-01-24T12:27:05", "background_image": "https://media.rawg.io/media/screenshots/87d/87d63a60089c8d6c1e519fa6f1b8c3ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 11, "beaten": 2, "toplay": 3, "dropped": 1}, "playtime": 5, "achievements_count": 37, "ratings_count": 2, "suggestions_count": 530, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Crazy Goat Games"], "genres": ["RPG", "Strategy"], "publishers": ["PQube"], "esrb_rating": null}