{"id": 8445, "slug": "skylanders-lost-islands", "name": "Skylanders Lost Islands", "name_original": "Skylanders Lost Islands", "description": "***More than 4 million downloads!*** <br/><br/>Capture Evil. Unleash Good. <br/><br/>Find new Trap Masters, other new Skylanders and Trappable Villains now in Skylanders Lost Islands™! <br/><br/>Play for FREE as you explore the Skylands, build your own kingdom and embark on incredible quests with your Skylanders in this amazing new adventure.  <br/><br/>More than a simple “builder” game, Skylanders Lost Islands™ is all about collecting and evolving your collection of Skylanders. As you progress, build up your islands  to unlock Skylanders and then send them on exciting quests and adventures to increase their rank. What’s more, bring your physical Skylanders figures into the game! Unlock them and add them to your in-game collection for even more adventuring fun!<br/><br/>Skylanders Lost Islands™ is easy to pick up and play, even if you haven’t played Skylanders Spyro’s Adventure®, Skylanders Giants™, Skylanders SWAP Force™, or Skylanders Trap Team™ . <br/><br/>KEY FEATURES: <br/>o Build, evolve and customize Skylands islands of your own design<br/>o Unlock over 160 unique Skylanders and rank them up to help you in your goals including the brand new Skylanders Trap Team™ !  <br/>o Welcome new Companions to your islands and Trap Villains  to unlock their unique gameplay perks. <br/>o Help characters on your islands and earn rewards along the way as you send Skylanders on amazing adventures and feats! <br/>o Explore many islands full of surprise and mystery<br/>o Level up through the game to unlock new items and customize your islands<br/>o Supports your physical Skylanders Spyro’s Adventure®, Skylanders Giants™ Skylanders SWAP Force™, and Skylanders Trap Team™ toy collection — import them into the game to bring them to life in Skylanders Lost Islands™ <br/>o Amazing art and HD graphics optimized for the Retina display<br/>o  Play with your friends via Facebook and Game Center to get exclusive rewards*<br/>o Play in English, French, German, Italian and Spanish languages<br/>o More features added all the time!<br/>o Play for FREE!<br/><br/>*Due to privacy concerns, some features are not available to all users.<br/><br/>Skylanders Lost Islands™ is completely free-to-play, but some in-game items can be purchased using real money. If you don’t want to use this feature, please disable in-app purchases.<br/><br/>Visit the Official Skylanders Lost Islands™ forums at: http://community.activision.com/community/activision/skylanders_lost_islands<br/><br/>Note: Version 2.0.0 and beyond not supported on iPhone 3GS, iPod Touch 3, iPod Touch 4, iPad 1,  or older devices. <br/><br/>Be sure to also check out Skylanders Trap Team™, Skylanders Collection Vault™, Skylanders Cloud Patrol™, and Skylanders Battlegrounds™!  <br/><br/>", "metacritic": null, "released": "2012-11-08", "tba": false, "updated": "2019-10-22T14:29:54", "background_image": "https://media.rawg.io/media/screenshots/32c/32c82b1b5f825f23f100b7760e57a3f2.jpeg", "website": "http://www.skylanders.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 164, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Activision"], "genres": ["Simulation", "Family"], "publishers": ["Activision Blizzard"], "esrb_rating": "Everyone 10+"}