{"id": 844688, "slug": "joshua-beck-portfolio", "name": "Joshua Beck Portfolio", "name_original": "Joshua Beck Portfolio", "description": "<p>A BITE IN THE NITE (team project)</p>\n\n<p>A hungry killer is on the loose and it's your job to hunt him down; but this mystery has a furry twist. Wolf down your meals and don't get caught!</p>\n<p>Download from the game's main page: HERE</p>\n\n<p>THE LONG NIGHT (team project)</p>\n\n<p>Journey through the mind to explore the mental stresses and anxieties placed on us during the height of the pandemic. Along the way, learn how to overcome and thrive when all else feels bleak.</p>\n<p>Download from the game's main page: HERE</p>\n\n<p>UNREAL PROTOTYPE (solo project)</p>\n\n<p>A small shooter prototype made with Unreal Engine 4 featuring roaming enemies with the goal to find the forest's treasure.</p>\n<p>Download below!</p>\n\n<p>ZOMBOPOLIS (solo project)</p>\n\n<p>A zombie apocalypse has broken out and you must try to survive! Gather the keys hidden around the city so you can escape in the helicopter. Then fight several waves of zombies with limited health and ammo.</p>\n<p>Download below!</p>\n\n<p>HOSPITAL SIMULATOR (solo project)</p>\n\n<p>A dark horror game. Trapped in a dilapidated hospital, pursued by a mysterious entity, and searching for your toys, you must find a way to escape and discover the truth about your reality.</p>\n<p>Download below!<br/></p>\n\n<p>REVERSE GALAGA (team project)</p>\n\n<p>A simple twist on Galaga-style games in which you play as an alien destroying endless armadas of space ships. Requires an Xbox One controller to play.</p>\n<p>Controls: D-Pad Left/Right for Movement. 'A' button to fire.</p>\n<p>Download below!<br/></p>\n\n<p>KNIGHT RUNNER (solo project)</p>\n\n<p>A 2D game in which you defend yourself against an endless stream of charging enemies. As you beat enemies you earn gold which can be used to heal or auto-kill an enemy. Last as long as you can!</p>\n<p>Download below!<br/></p>\n\n<p>DOUBLE TAP - A LEFT 4 DEAD 2 MOD (Team project)</p>\n\n<p>An interesting twist on L4D2 featuring a new health system. As your health gradually declines over time, your only source of health comes from pill bottles dropped on a zombies death, but even then the pills only provide a temporary boost! Will you escape the new prison map or become part of the horde?</p>\n<p>Download from the mod's main page: HERE</p>\n<p>Project IKEA (Team project)</p><p>A team project meant as a prototype of a crafting system. Platform your way around the IKEA warehouse and gather the pieces of furniture. Then, return to your workbench and put it all together! The True Ikea Experience!</p><p>Play in your browser: HERE</p>\n<p>______________________________________________________________________________________</p>\n<p>My primary roles in all these projects was on the coding/scripting and level design ends. I personally made none of the art/sounds/3D models as they were either made by my team members or downloaded from third-party sources. One slight exception is on Hospital Simulator in which the voice lines were recorded by myself and a friend and processed by myself. In team projects, I served as the lead or sole programmer for the group. My work included the systems design, UI, AI, player functionality, etc. </p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T08:06:35", "background_image": "https://media.rawg.io/media/screenshots/f9c/f9c8cf8852018cd17dfcbf7472dd5ecc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["jbeck98"], "genres": [], "publishers": [], "esrb_rating": null}