{"id": 844750, "slug": "eclipse-war-fetters-of-the-world-soul", "name": "Eclipse War: Fetters of the World Soul", "name_original": "Eclipse War: Fetters of the World Soul", "description": "<p>Eclipse War is a srpg taking inspiration from the Fire Emblem series. I've been working on it for a little over a year now.<br/></p>\n<p>This demo consists of a tutorial and two levels, where you command a group of mercenaries to slay brigands and monsters alike, with classic top down grid-based srpg combat.  As you play, you'll learn more about the characters, and the history and politics of the continent of Aeaea where the game takes place.</p>\n<p>The demo should take approximately an hour to complete if you don't Game Over.<br/></p>\n<p><strong>Note:</strong> some additional controls that didn't end up in the tutorial but are important and not necessarily intuitive:</p>\n<ul><li>Right Click can be used to back out of most menus</li><li>Space bar is used to advance dialogue</li><li>Middle Mouse Click can be used while hovering over a unit to view their stats and inventory</li><li>Middle Mouse click can also be used when hovering over a stat to view all the buffs and debuffs to that stat, or to show an item's properties when hovering over an item</li></ul>\n<p><strong>Known Bugs:<br/></strong></p>\n<ul><li>It is possible for the enemy AI to get stuck, though it is very uncommon and I don't know what causes it yet.</li><li>Sometimes dialogue entries get double counted in the log. This has no gameplay effect and I'm not sure what causes it yet.</li></ul>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T08:53:56", "background_image": "https://media.rawg.io/media/screenshots/e46/e4693d233b9321d8897e28785a2da5a7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kurikaeshi"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}