{"id": 844811, "slug": "flow-below-playtesting-demo", "name": "Flow Below (Playtesting Demo)", "name_original": "Flow Below (Playtesting Demo)", "description": "<p>Flow Below is a 2D Platformer which tells the story of a young spirit, who dwells underground to help their village by turning on water valves which transported the village's water supply, as they have been mysteriously turned on...</p>\n<p><strong>Note! This game is in VERY EARLY development, meaning that you WILL encounter bugs, but nothing major hopefully. If you do find a bug, please comment about it!</strong></p>\n<p>As you enter the entrance of the caves, you trip. Leading yourself to a very painful fall, which leaves you with no memory, and no reason as to why you are underground. <br/></p>\n<p>While playing the game, you will encounter many unique characters, albeit with very subjective humour, as you discover new unfamiliar locations, which tell a story as to how you're village is where it is today, all the while picking up the pieces of your memory.</p>\n<p>The game is divided into 4 primary areas, each having a unique theme and idea. with each area being split into 2 sub-areas.  Which introduce a new mechanic as you progress through the caves back up to where you came from!</p>\n<p>The demo currently, only has 1 sub-area done with 7 more to be included with the final game, alongside many new modes, features and stories.</p>\n<p>Since this is a demo with the purpose of playtesting, your opinion is more than appriciated, so any ideas, questions, criticisms or thoughts are welcome!<br/></p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T09:34:19", "background_image": "https://media.rawg.io/media/screenshots/dfb/dfbb7b5e8ea2d7784a6540e1f5d28658.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KyzanDev"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}