{"id": 844943, "slug": "furnicity", "name": "FurniCity", "name_original": "FurniCity", "description": "FURNICITY\r\nAbout the Game\r\n\r\n<p>Awaken into the furnace of this city, and puzzle at the clutter of furniture that litters the streets; empty of life. Curse and swear under your breath as the only means of escape lies above; amongst the dizzying heights of the concrete jungle high-rise. Find brief solace in your newfound ability to telepathically manipulate the furniture around you. Frown at the agonizing neon blue glow that now shrouds furniture you once sat on; languishing and wasting your days away behind a desk with no possible future or hope of a better life. Caffeine addled and overworked, you once achieved a window office at the top of the tallest building in the city, and yet never had time to enjoy the view; was this the city you knew? Perhaps the answers lie above, and yet you are now below. Will you rise to the top once again?</p>\r\nGameplay\r\n<p>Furnicity is a third-person 3D platformer that challenges the player to scale a city environment by manipulating furniture that is littered around the level. A tutorial in the beginning introduces the player to the controls and invites them to stack furniture to enable their character to jump over ledges. How high can you make it? Most importantly, can you escape?</p>\n<p>Additional collectibles can be found throughout the level. These collectibles, dyed in neon green, unlock achievements and give you a sense of purpose? Perhaps a sense of having accomplished some esoteric task? What could it possibly mean - that's for you to decide my dead dear player. </p>\r\nFor Epic MegaJam 2022 \r\n<p>https://itch.io/jam/2022-epic-megajam</p>\n<p><strong>Theme: As Above, So Below</strong></p>\n<p>Developed with Unreal Engine 5.0.3</p>\n<p><strong>Modifier Categories attempted:</strong></p>\n<p>Audio Experience - Dynamedion </p>\n<p>Use it or Lost It - Gametextures</p>\n<p>Fully Kitted - AWS Gamekit</p>\n<p>The KitBasher - KitBash3D</p>\n\n\n<p>More Details incoming</p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T10:41:12", "background_image": "https://media.rawg.io/media/screenshots/c72/c7282450de688dabbaae85d2ec2f36c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Htech-SG"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}