{"id": 84507, "slug": "plankd-lite", "name": "PLANK'D Lite", "name_original": "PLANK'D Lite", "description": "It's the craze taking the world by storm: Planking. Do you have the skills to take it to the next level, extreme style?<br/><br/>Take it to the streets and show the world what you've got by finding the best plank spots and comboing into other planks, and then combo again for massive respect! Hone your planking skills with PLANK’D Lite then take it to the bigger levels with PLANK’D where you can Plank cars, trains, streakers, whales, the moon, dragons, dancing bears, even the God-damned Sun! Plank every damn thing you can see. Tumble through the air, score big and plank your way into the history books (or at least into our online leaderboard). <br/><br/>Are you ready to step up and lie down with the best of them?<br/><br/>GET PLANK'D!<br/><br/><br/>FEATURES<br/><br/>- All the fun of planking with none of the social or legal persecution.<br/>- Intuitive Plank-o-matic control scheme.<br/>- Riveting officially endorsed extreme planking scoring and combo system.<br/>- One expert planker to choose from.<br/>- Basketball Court, complete with crazy quirky and hard to reach plank locations.<br/>- Incredible pixel art objects and a thumping soundtrack come together to create the perfect planking heaven.<br/>- All new mind-blowing characters, crazy planking opportunities and awesome locations with the full version. You can plank the Grannies, Cows, Streakers, Dancing Bears, Trainz, Whales .... even the God-damned Sun! Check out PLANK’D for more info!<br/><br/>Check it out at: http://www.plankdgame.com <br/>LIKE US at: https://www.facebook.com/plankdgame", "metacritic": null, "released": "2011-06-24", "tba": false, "updated": "2019-07-30T11:03:09", "background_image": "https://media.rawg.io/media/screenshots/76d/76d6f2eadaaab58f6376a1d75ba8e7c6_lrmL4Xk.jpg", "website": "http://www.plankdgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 209, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["N3V Games"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["N3V Games"], "esrb_rating": null}