{"id": 845130, "slug": "search-in-time", "name": "Search In Time", "name_original": "Search In Time", "description": "<p><strong><em>Installation Instructions:  </em></strong></p>\n<p><em><strong>Enable Developer Options if needed.  Allow install from Unknown Apps (sources).  Unzip .APK on your android phone and install.</strong></em></p>\n\n<p>Freely move about in a variety of fully realized open world 3D hidden object searches; with levels ranging from gorgeous alien worlds to the most fantastical abodes scattered throughout the multiverse!<br/></p>\n<p>A new approach for search and find and hidden object games!<br/><br/>You are an unnamed lost traveler... Explore different dimensions as you seek door keys which are hidden in every day objects strewn throughout the world.<br/>As you find keys you will open portals to further your journey to new and unknown destinations.<br/><strong><br/>FEATURES:<br/></strong><br/>⭐Open 3D levels with wonderfully detailed environments!<br/>⭐Freely move about how you wish while searching.<br/>⭐The level timer is affected by your object choices.<br/>⭐You EARN T-coins by the speed in which you find your objects.<br/>⭐You can FREEZE the timer for a short duration by using collected T-coins!<br/>⭐You can SCAN for objects in a set radius by using collected T-coins!<br/>⭐Explore the environments as you see fit upon level completion!<br/>⭐New items added weekly!<br/>⭐New Levels added monthly!<br/>⭐Unlockable Story Content coming soon.<br/>⭐Customizable drone skins coming soon.<br/>➔Customizable DRONE skins and items will be coming soon! You can then use your collected coins to purchase these assets for your DRONE.<br/><br/><strong>How To Play:</strong><br/><br/>You will emerge from your portal and begin looking throughout the area for 5 hidden objects; these objects are randomly selected and will be revealed to you at the onset of the level timer. The level timer will continuously count down to 0, once the timer reaches 0 you have failed your search. Selecting a correct object will add several seconds to the timer; however, selecting an incorrect object will remove several seconds from the timer. You also have access to special abilities. One such ability is the option to FREEZE the level timer for a short duration to allow you the extra seconds you may need to locate your hidden objects. A secondary ability you have is the option to SCAN the environment for hidden objects that are within a set radius; this radar only lasts for a short duration. These abilities use T-coins; these T-coins can be earned by you if the level is completed within varying allotted times. The number of T-coins accrued is dependent upon how much time is remaining on the level timer. Once you have collected all 5 of the hidden objects a portal to end the level will open somewhere around you; at which point you can either enter the portal and end the level or if you wish you can explore the environment further.</p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T12:10:52", "background_image": "https://media.rawg.io/media/screenshots/388/3885731901099087b7aede857070cc66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["3GuysGaming"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}