{"id": 84512, "slug": "my-santa-claus-games", "name": "My Santa Claus Games", "name_original": "My Santa Claus Games", "description": "Ho, ho, ho! Merry Christmas! Come and play with My Santa Claus - Christmas Games for Kids, your new virtual talking friend! Talking to Santa Claus is now even more fun and easier than ever! <br/><br/>There are hundreds of Santa Claus games out there to choose from, but your virtual talking friend Santa Claus has it all – Christmas dress up games, Christmas coloring pages, Xmas carols and music, 10+ mini games with Flying Santa and more. This fun Christmas game for kids also lets you talk to Santa and create your gift list, teaches you how to take care of your teeth and reminds you to take baths regularly. Take care of your little Santa, help him grow up and talking games for kids will have a cute, chubby talking friend with a white beard and a red suit. Enjoy your holidays and have fun talking to Santa Claus!<br/><br/>FEATURES OF MY SANTA CLAUS – VIRTUAL TALKING FRIEND:<br/><br/>- ADOPT BABY SANTA CLAUS and watch him grow into a boy, a man and finally, a grandpa Santa with the white beard and the big belly <br/>- SANTA DRESS UP GAMES – use your coins to dress up your Santa just the way you like! There are many costumes and accessories to choose from. Enjoy!<br/>- CHRISTMAS TREE ROOM – decorate your own Christmas tree with the most beautiful decorations you can get<br/>- CHRISTMAS SONGS MUSIC PLAYER – listen to your favorite Xmas carols, take a photo of Santa singing and send it as a Christmas card to your family and friends<br/>- PLAY MINI GAMES to earn coins. Coins will help you buy all the new clothes, beards and decorations for your talking friend Santa and keep him happy! <br/>- SANTA CLAUS COLORING PAGES – a mini Santa Claus coloring book with 20 coloring pages featuring your favorite Christmas themes.<br/>- TEETH BRUSHING TIME – Santa Claus eats lots of cookies and drinks lots of milk, so you need to brush his teeth and keep them healthy<br/>- BATHROOM TIME – Santa tends to get dirty from sliding down and climbing up all those chimneys. Keep him clean and tidy. <br/>- TALKING TO SANTA can earn you a present. Or not! Answer to Santa's questions and depending on your answers, he will decide whether you've been good or naughty. If you were good - don't you fear, you get some gifts here! But if naughty you were, no gifts for you there. <br/>- WRITE A CHRISTMAS GIFT LIST and send it to Santa<br/><br/>TALK TO MY SANTA CLAUS, YOUR NEW VIRTUAL TALKING FRIEND <br/><br/>Remember all those fun virtual pet games – my talking dog and my talking cat? Aren't they the best you can get? Well, it's that time of the year they get a talking friend for Christmas and My Santa Claus is the perfect Christmas game for your winter holidays! Talking to Santa Claus might get you just the Christmas gift you wanted, provided you've been good all year, of course.<br/><br/>Embrace the Christmas spirit, play your fun Christmas games and enjoy the happiness winter holidays provide! Download your virtual talking friend Santa Claus now! We wish you a Merry Christmas and a Happy New Year! <br/><br/>My Santa Claus – Christmas game for kids is an intellectual property of Peaksel.", "metacritic": null, "released": "2016-12-21", "tba": false, "updated": "2019-10-22T14:22:14", "background_image": "https://media.rawg.io/media/screenshots/d24/d2497d083393960a0d0e759c750f1fc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peaksel"], "genres": ["Adventure", "Family"], "publishers": ["PEAKSEL doo"], "esrb_rating": "Everyone 10+"}