{"id": 845101, "slug": "trails-and-towers", "name": "Trails and Towers", "name_original": "Trails and Towers", "description": "<p>Trails and Towers (or simply Trails) is a mathematical game for two players. The player's objective is to take as many towers as possible by making trails on a square field with certain rules.</p>\n<p>This is the first cross-platfrom implementation of that game. You can explore source code of the game on GitHub.</p>\n<p>Notice that since the project is open-source, it has been remain minimalistic as possible. The purpose of this is to make source code easily readable and modifiable. Thus, it may not provide some advanced features as key mapping or multiplayer. But you can code any of that features <em>by your own</em>!</p>\r\nControls\r\n<p>Use arrow or WASD keys to choose move direction, or click on the target cell with mouse (click on a general move direction will also work). Possible cells to move to will be shown as a green ones. Use Escape to quit the game and R to restart the game.<br/></p>\r\nRules\r\n<p>Classic version of Trails and Towers has three towers on diagonal distance of one and 11x11 field. As being said, player's objective is to take as many towers as possible. Therefore, first player which takes more than a half of towers, wins. Player loses if none move can be done in player's turn.\r\n</p>\n<p>Each player have colored base in opposite corners of the field. Usually, base color is blue for player one and red for player two and blue base is located in upper left corner when red base is located in bottom right corner. Towers are placed from field center at specified distance and on the diagonal which connects <em>free</em> cells in corners of the field. Cell where the tower is placed does not count as free.\r\n</p>\n<p>From the bases players making moves (player one goes first) in one of possible directions: up, down, left or right. If cell in chosen direction is free, player can <em>occupy</em> it. Cell which is already occupied by current player or by opponent cannot be occupied again.\r\n</p>\n<p>By moving at the same direction as last turn player will accumulate <em>boost</em>, which means that every turn player will move further by one cell. When player changes moving direction, boost is gone. With boost player can <em>jump over</em> occupied cells, if <em>target</em> cell is free or a tower is in there. When player jumps over, every free cell between last occupied cell and target cell becomes occupied.\r\n</p>\n<p>If player has boost and target cell is \"over\" the bound, player occupies every free cell in chosen direction up to bound, but only if cell next to the bound is free too. Lastly, player can take (occupy) tower only with boost and only when tower cell is target.</p>", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-02T11:59:07", "background_image": "https://media.rawg.io/media/screenshots/efa/efa7ca95858f1d228b0ef3282eeead6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["So. Game Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}