{"id": 845303, "slug": "dawns-gate", "name": "Dawns Gate", "name_original": "Dawns Gate", "description": "<strong>Short lore</strong>\n<p>      It is at dawn’s gates that since the beginning of time and for eternity, an umpteenth battle of heavy consequences and anticipation is being prepared. This very battle between day and night, which results alone, might present another glorious sunrise to humanity.\r\n</p>\n<p>      Within an unfathomable world far from humanity’s grasp, Solaris' and Lunaris' armies have been trying for immemorial times to enslave each other. These repeated battles have established a fragile balance that we, human beings, naively call \"day-night cycle\". Only when Solaris' army loses ground does Lunaris' army advance, leading to nightfall.\r\n</p>\n<p>      We, human beings, wouldn't possibly know that a single defeat from Solaris against his antonym could plunge humanity into the most eternal of nights.</p>\n<strong>Gameplay</strong>\n<p>You are playing Solaris, your goal is to kill Lunaris. You will have to slay Lunaris' army throughout your journey to his crypt, gearing up wisely and making the best possible choices between battles until the very end.</p>\n<p>Dawns Gate is a dark fantasy roguelite made in 3 months as a Masters project submission. This game is a prototype. You may encounter a few bugs during your playthrough.</p>\n<strong>Controls &amp; support</strong>\n<p>Dawns Gate can be played with either a controller or a mouse and keyboard. You'll be able to learn the controls thanks to the tutorial sign at the lobby.</p>\n\n<strong>Team</strong>\n<p><strong>Mathieu Schmerber: </strong>Programming, 2D Art, VFX, Sound design<br/></p>\n<p><strong>Philémon Caron: </strong>Lighting, 3D Art, Tech art</p>\n<p><strong>Quentin Le Van (Twitter): </strong>Musics</p>", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2022-09-02T13:31:43", "background_image": "https://media.rawg.io/media/screenshots/14a/14af73badefdfe7aab7f2a00b45fc067.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nawlian", "Philémon"], "genres": ["Action"], "publishers": [], "esrb_rating": null}