{"id": 845315, "slug": "asakami-a-souls-journey", "name": "Asakami: a soul´s journey", "name_original": "Asakami: a soul´s journey", "description": "<p><em>Demo / WIP</em></p>\n\n<p><strong>    Asa </strong>finds herself immersed in a <strong>dream world</strong> covered in water, along with elements affected by <strong>a strange corrosion that invades everything</strong>, and she does <strong>not remember how she got there or why</strong>.<br/>    The only thing that comes to mind about her is her brother <strong>Kiyoshi</strong>, who was very sick and for whom she went to seek help, and a <strong>strange connection with a small paper boat</strong>.<br/><strong>    This world will turn out to be a nightmare </strong>and she will desperately seek a way out of it. Pieces of her past will come to her as she progresses and, little by little, she will discover the truth and the presence of <strong>Kasumi</strong>.</p>\n\n<ul><li>Genre: First Person, Psychological Horror, Walking Simulator, Single Player</li><li>Demo Duration: 40 minutes approx.</li><li>Art Style: 3D, Magical Realism, Symbolism</li><li>Engine: Unreal Engine 4</li><li>A downloadable for PC</li><li>Release date: End 2022</li></ul>\n\n\n<p><em>    </em>It is committed to simple mechanics in favor of history, art and music, seeking the sensory and emotional immersion of the player in a dream world, full of fantasy that versions the reality of the protagonist. A story, a tale, an adventure that will live together with Asa, where dreams, nightmares and reality will merge in a unique atmosphere.<br/></p>\n<p>    The game is initially in Spanish, since the original texts of the narrative were made in that language and it has been wanted to preserve its original essence. In the future it will be available in English.</p>\n\n\n<p>    A game developed by Isabel Roux<br/><em>I am a 2D and 3D artist and I have had my own narrative projects for a long time.<br/></em><em>For the first time in my career, I developed level design, mechanics and narrative design, apart from graphic design, layout and motion graphics, with which I already had experience.<br/></em><em>In February 2022, I decided to teach myself Unreal and programming with Blueprints, through tutorials and internet forums. I checked, and I'm still at it, everything that goes into making a solo video game. An artist learning programming to bring to life the world she had imagined.</em></p>\n<p>    Technical assistance/  Fernando García <br/>    Music/ Isabel Royán<br/>    Voice over/ Carmen Ferrer</p>\n<br/>\n\n\n\n<p>    If you want to know more about Asakami's history, its development and its influences, you can take a look at this dossier in which everything is broken down. </p>\n<p>    Also, you can see more details about props, 3D sculpture, illustrations, unreal engine blueprints and my workflow here.</p>", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2022-09-02T13:36:39", "background_image": "https://media.rawg.io/media/screenshots/c27/c275deb51cc2450d5ddf47f180a70b23.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Iroux Works"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}