{"id": 845446, "slug": "my-ex-boyfriend-turned-into-a-vampire", "name": "My Ex-Boyfriend Turned Into A Vampire?!", "name_original": "My Ex-Boyfriend Turned Into A Vampire?!", "description": "YAOI JAM 2022 :D: My Ex-Boyfriend Turned Into A Vampire?!\r\n<p>\n<strong>SUMMARY:</strong>   Eli’s broken up with his long-time boyfriend and is finally set on  moving on. But what happens when said ex shows up on his doorstep with  red eyes and fangs — and is covered in blood?      </p>\n<p>Despite their rocky breakup, Yarrow has come to Eli for help with  this perplexing transformation. He’s turned into a vampire and needs his  ex’s help to adjust to a lifestyle he knows nothing about.      </p>\n<p>“My Ex-Boyfriend Turned Into A Vampire!” is exactly what its title  entails: a light-hearted visual novel with a simple premise, focused on  the relationship between a jilted protagonist and his naïve but earnest  ex-lover, peppered with philosophical debates about humanity’s darkness  and Vampire Knight bashing.       </p>\n<p>Will Eli refuse to help his first love, or will that love be rekindled — and with it, a new bloodlust?      </p>\n<strong><em>Demo written for Yaoijam 2022!    </em></strong><strong>The VN itself is NOT NSFW and most of the blood cgs are censored, but it has gorey/mature elements and innuendos, so recommended for 16+ only. </strong>\n<p><strong>TRIGGER WARNINGS:</strong> blood, depictions of gore, mentions of parent death, implied NSFW jokes\r\n<em>not included in demo but later on:</em> murder, yandereism, and unhealthy relationships in some routes  <br/></p>\n<p>Though this VN is about vampires, it mostly focuses on slice of life and the relationship between two exes. Vampires are just the accompaniment!<br/></p>\n\n<p><em>Demo is not reflective of final product.\r\n</em></p>\n<strong>Demo includes:</strong><strong>Final Product will include:</strong><strong> </strong>\r\n-Cute sprites by Fiftyway<br/>-Music  \r\n<br/>-Part of common route and 1 bad end<strong> </strong>-Cute BLINKING sprites and a way to differentiate between talking sprites \r\n<br/>-Better coding (hopefully)  and accessibility<br/>\r\n-Common route, true route, predicted 8-9 endings in total  \r\n-Music  \r\n<br/>-CGs  \r\n<br/>-Extras  <br/>\r\n-Gallery\r\n\r\nCredits!\r\n<p>Writing, Coding, Backgrounds and UI: Avirati<br/>Artist and best friend: Fiftyway<br/>Title Menu image: hardshelltaico<br/>Logo: Hauntship<br/>Music: DOVA-SYNDROME JP<br/>(proper credits in devlog later)<br/></p>\n\n<p>\n</p>", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2022-09-02T14:35:20", "background_image": "https://media.rawg.io/media/screenshots/9a7/9a75208b4b09c5609b82392a7a01b425.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fiftyavipro"], "genres": [], "publishers": [], "esrb_rating": null}