{"id": 845603, "slug": "tuning-samurai", "name": "Tuning Samurai", "name_original": "Tuning Samurai", "description": "<p><strong>Game concept and Overview:</strong><br/></p>\n<ul><li>We have made a Game on the theme - “It does sound like me”\r\n</li><li>Many would interpret the “sound” part in layman’s language\r\n</li><li>But we have taken the concept of Sound in scientific - Physics sense\r\n</li><li>There is a concept called Resonant Frequency, a frequency at which a particular object’s molecules vibrate at highest amplitude that it shatters\r\n</li><li>This is commonly shown in scenes like a singer hitting a high note and breaking a piece of glass\r\n</li><li>Each Object has its own unique Resonant Frequency\r\n</li><li>When the singer’s voice’s Frequency matches the Resonant Frequency of the Glass, it shatters\r\n</li><li>Thus the incoming Sound wave must have the same Frequency to as the Resonant Frequency of the object to shatter it\r\n</li><li>Thus only damage when <strong>it does sound like me</strong>!\r\n</li><li>We have used this concept, our Player character Samurai is equipped with a Tuning Fork Sword - which like real life tuning forks produces Sound Frequency to attack Enemies and Obstacles\r\n</li><li>For this the Player Samurai has to match the Frequency of his Tuning Fork Sword with the Resonant Frequency of Enemies’ heartbeat and Obstacles\r\n</li><li>Thus he can only damage them when they <strong>do sound like him</strong>!</li></ul>\n<p><strong>Story:</strong>\n</p>\n<p>You are a Samurai apprentice in training.\r\n</p>\n<p>Your Master has instructed you to train while wearing blinders,\r\n</p>\n<p>and instead of the renowned weapons used by samurais, such as the Katana, \r\n</p>\n<p>he has given you a lousy weapon — a tuning fork sword,\r\n</p>\n<p>before saying \"attack them only when <strong>they sound like you</strong>\".\r\n</p>\n<p>You have no idea what he meant when he said that, \r\n</p>\n<p>or why he gave you this hideous-looking weapon.\r\n</p>\n<p>But there is more to it.\r\n</p>\n<p>What he meant was match the Sound i.e. the Frequency of your Tuning Fork Weapon \r\n</p>\n<p>with the Sound i.e. Resonant Frequency of your Enemy’s Heartbeat or Obstacles to shatter them.\r\n</p>\n<p>But beware! If you don't match the frequency, \r\n</p>\n<p>then you will suffer!\r\n</p><p><strong>Core Loop:</strong></p>\n<p><strong>How to play:</strong></p>\n<ul><li>You control a white colored blinded Samurai\r\n<ul><li>Use WASD keys to move\r\n</li><li>Use J key to Attack\r\n</li></ul></li><li><strong>Objective </strong>- To complete a level, you have to defeat all Enemies in that level and proceed to the next level (since you are an apprentice and your training is to defeat all opposing Samurais)\r\n</li><li>Attacking functionality:\r\n<ul><li>Go near an Enemy or an Obstacle (the red rock)\r\n<ul><li>(Enemies will come in an “alert position” when you approach them)\r\n</li></ul></li><li>Now you’re supposed to attack when your weapon’s Frequency (shown in top right in the HUD) matches the Enemy’s (shown above his head) or the Obstacles’ (also shown above the red rock)\r\n</li></ul></li><li>2 Weapon Skins:\r\n<ul><li>Main weapon - Red Tuning Fork Sword\r\n<ul><li>Fixed Freq\r\n</li><li>Will be with Player in the start of any Level, any random allotted Freq value\r\n</li><li>Can Damage both types of Enemy by matching Enemy’s Frequency\r\n</li><li>Can Damage Obstacle only if both have it and Obstacles have same Frequency\r\n<ul><li>In case both don’t have same Frequency, then Player will have to get Golden sword\r\n</li></ul></li></ul></li><li>Secondary weapon - Golden coloured skin \r\n<ul><li>Variable Frequency\r\n</li><li>Get by defeating Golden Enemies\r\n</li><li>Destroy Obstacles (red rocks) by matching Frequency of it with Obstacle’s\r\n<ul><li>If Frequency does not match, then Sword reverts back to original Red skin\r\n</li></ul></li><li>Can damage Golden Enemy with no Frequency match needed - thus a Power Up\r\n</li><li>Can’t damage Red Enemy with this - thus also a debuff\r\n<ul><li>So to damage Red Enemies <strong>you must get your weapon’s Red skin back</strong>\n<ul><li>To do this, you have go near the Obstacle and match wrong frequency intentionally to change the Sword back to Red as mentioned above\r\n</li></ul></li></ul></li></ul></li></ul></li><li>Obstacle Interaction:\r\n<ul><li>Obstacles simply have a Freq Bar above them\r\n<ul><li>They will have fixed Frequency\r\n</li><li>But each such Obstacle will have a different Resonant Frequency\r\n</li><li>If the Freq is not Matching, Player has to make his weapon Golden i.e. get Variable Frequency by defeating a Golden Enemy \r\n<ul><li>Then Player has to match his Golden Weapon’s Frequency with the Obstacle’s to destroy it\r\n<ul><li>If Player had matched Golden weapon’s variable Frequency correctly with the Obstacle, the Obstacle gets destroyed\r\n</li><li>If Player had not matched Golden weapon’s Frequency correctly with the Obstacle’s, the weapon reverts back to original Red skin and then Player has to defeat another Golden Enemy to make the weapon Golden again\r\n<ul><li>However this situation can be useful when the Player has to defeat Red Enemy, he can intentionally mismatch the Frequency and get his weapon reverted to original red colour, as only red weapon can damage the Red Enemy and the Golden one can’t do so\r\n</li></ul></li></ul></li></ul></li></ul></li></ul></li><li>Enemy interaction:\r\n<ul><li>Both Enemies (Red and Golden) will have variable Frequency\r\n</li><li>Red Enemy:\r\n<ul><li>Can only be damaged by Player’s Red Weapon\r\n</li><li>Player needs to match his Red Weapon’s fixed Frequency with this Enemy’s Variable Frequency to damage him\r\n<ul><li>If mismatch, then he will damage the Player\r\n</li></ul></li></ul></li><li>Golden Enemy:\r\n<ul><li>Can be damaged by Player’s both Red and Golden Weapon\r\n<ul><li>However attacking by Golden Weapon will give Player an advantage - can defeat Enemy regardless of the Frequency match mechanism\r\n</li></ul></li><li>In case attacked with Player’s Red Weapon, then like Red Enemy, \r\n<ul><li>Player needs to match his Golden Weapon’s fixed Frequency with this Enemy’s Variable Frequency to damage him\r\n</li><li>If there is mismatch, then he will damage the Player\r\n</li></ul></li></ul></li></ul></li></ul>\n<p>If you want to play new version here it is </p>\n<p>it is uploaded after some time later when game jam was over (notice :Game jam version also fine but it got more polishing)</p>\n<p>https://drive.google.com/drive/u/0/folders/1jhfWCyU-zM9FsNGsiPBCsqWv2ilDVHTt</p>", "metacritic": null, "released": "2022-08-28", "tba": false, "updated": "2022-09-02T15:47:26", "background_image": "https://media.rawg.io/media/screenshots/895/8950139a3e558bd73eb01d6aacd076b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RageDude", "vineetm1471013", "SudeepG"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}