{"id": 84570, "slug": "halloween-supermarket-store", "name": "Halloween Supermarket Store", "name_original": "Halloween Supermarket Store", "description": "Hey Kids! Are you crazy about Costume Parties, haunted house, trick-or-treat, or some other celebrating ways? If your answer is Yes, and you have such a deep feeling about these celebrations on that day. So HERE COMES THE TREAT OR TRICK TIME AGAIN! There’s a big Halloween party coming up and it’s time to get ready for the big night! But are you ready to look like a spooky monster, ghost, walking skeleton, fairy or witch? If your answer is no, you don’t have to worry because you’ll absolutely cheer for Halloween Supermarket Store. Halloween Supermarket Store is a time management game, customers at store are in queue, waiting to pay money and get their Halloween grocery items packed. An experienced supermarket store cashier in shopping mall knows how to operate the cash register machine serving the customers on time, so they don’t get angry on any kinds of delays to get their Halloween grocery items.<br/><br/>Halloween Supermarket Store starts with a manual machine you have to enter the price of each grocery item and get the total of all. Tap on the customer to receive money. Cash drawer will open and you can put the received money and return the balance amount to the customer. You can upgrade your manual point of sale, with the automated one so you can scan each Halloween grocery item the customer brings to the counter, and ring up the price! Then accept payment via cash, credit card or through mobile NFC, and enter the total amount, followed by scanning the credit card or mobile!<br/><br/>In this mile-a-minute fun filled cash register game you can also improve your store management skills. Customers are in queue, waiting to pay cash and get their halloween grocery items packed. A fast-paced store management game to test your speed and accuracy. Halloween Supermarket Grocery Store is an educational and fun game where children learn to handle money at supermarket shopping mall. It can help improve their math and calculation skills.<br/><br/>Features:<br/>* Fast paced supermarket Time Management Cash Register Simulation<br/>* Serve customers &amp; make them happy to get rewards<br/>* Modern payment methods; Credit Card Machine and NFC Mobile payments<br/>* Unlock Point Of Sale Machine to scan grocery items<br/>* A fun filled supermarket management game<br/>* Use Auto Complete Robot to get task done automatically<br/>* Use Cool Candies to increase patience of customers<br/>* All sorts of strange dresses, unique make-up, colorful masks, spooky monster, ghosts, walking skeletons outfits.", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-10-22T14:22:14", "background_image": "https://media.rawg.io/media/screenshots/9b2/9b2bf02e3a80fd64793000e5adcb9717_Gw1GL3n.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["RPG", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Everyone 10+"}