{"id": 845839, "slug": "hero-of-legend", "name": "Hero of Legend", "name_original": "Hero of Legend", "description": "IMPORTANT, READ BELOW!\r\nThis game requires joining a Discord Server and interacting with the server's bot. You can join the server via this link: \r\nhttps://discord.gg/9eV5WS5X\r\nWhen you join the server, the bot will send you a DM with further instructions. Send the provided code to the bot to begin playing. You can use the server to chat with other players, share hints about puzzles and report bugs to the developers.\r\nInteractions with the bot have an effect on the game itself, from the simple cosmetic changes down to the core mechanics of the game. \r\nUsing you phone for Discord is highly recommended, although the game is perfectly playable on a single screen PC!\r\nUncover the mysteries of a ruined kingdom with your own virtual gaming buddy, Gordy!\r\n<strong>Features: </strong>\r\n- Gordy is a Discord bot like no other! With the ability to perform the abilities such as time rewind and cloning directly in game, he makes up for a great companion!\r\n- An interesting word made just for you to explore, both in top down and side scrolling perspective!\r\n- Fun and inventive mechanics!\r\n- Secrets!\r\n- A flexible pause system, leave and come back at any time!\r\n- Cats!\r\nAnd many more!\r\n<p>This game was made for MajorJam 105: Legends, where the limitation was <strong><em>The gameplay must reach beyond the gamespace!</em></strong><br/></p>", "metacritic": null, "released": "2022-08-30", "tba": false, "updated": "2022-09-02T17:30:50", "background_image": "https://media.rawg.io/media/screenshots/96f/96f8cebf63ddcf66d3b006138bda8aea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 62, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TrAceX", "Sodoj"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}