{"id": 845865, "slug": "baabosaangjaar-public-demo-a", "name": "BÅÅBÖSÅÅNGJÅÅR: PUBLIC DEMO A", "name_original": "BÅÅBÖSÅÅNGJÅÅR: PUBLIC DEMO A", "description": "<p><strong><em>This game is not for everyone. In particular, this game contains Adult themes such as Body Horror, mentions of cigarettes, loud burst of noises and strobing lights and disturbing visuals, et al.<br/>Now that's out of the way -- Sit back and enjoy the ride, this work is yet to be done!        The game is still in the demo phase, and about half of the game is what I consider 'done'<br/>... So please stay tuned, will you.</em></strong></p>\n\n\n<em>There would be a family gathering, they said.<br/>There surely would be your family residing in this exact position presented in the letter, they said.<br/>Follow the direction and you shall meet your family after a god-knows-how long has it been since you last met them, they said.<br/></em>\n<em>They said so.</em>\n<p>You, as a very man, are in a severed quest of locating your home for annual Christmas Family Gathering (CFG).<br/>But upon successfully injecting yourself into the so-called your family house, it was revealed that the house was in fact, nothing but deception -- Lies. Obsoletion. Left-to-rot-away.</p>\n\n<p>\n</p>\n<strong><em>Yet never give your hopes up!</em></strong>\n<p>Even though there is no visible human race, let alone your familys' trace was left, this still remains a fact: It was the very place where your family had been living on for a long time. It's just that they have since moved unto another position a long, long time ago.</p>\n<p>Your only hope to find your family's current location, is now nothing but a remains of what used to be a successful addition to you and your family's house; A mysterious videotape playing device, and an one (1) videotape.</p>\n<p>Are you ready to reunite with your family yet again?</p>\n\n<p>A standalone tester type beat of the game, BÅÅBÖSÅÅNGJÅÅR.<br/></p>\n<p>'BÅÅBÖSÅÅNGJÅÅR' is a videotape in a videogame form -- You will watch yourself belonging to unconventional places, meet inexplicable people and situations: All thanks  to the old videotapes your former self have recorded using a Hi-tech, bleeding-edge, state-of-art videotape system. Available for you to utilize it to find the clues behind your mysterious past, and to extent, your family.</p>\n<p>To word it differently, it is a 3-D, semi-horror adventure game / interactible diorama of sorts: Taking heavy inspirations from theatre of absurd, surrealism, many works of the internet user 'PilotRedSun', and most  importantly, 200X-era internet humours such as 'Youtube Poop' and amateur motion films made with 'Garry's mod' and 'Source Filmmaker'.</p>\n<p>Sit back, and enjoy as the visages of your forgotten past enfloods your oculus -- Even the blink of an eye could lead you to somewhere else.<br/></p>\n\n<p>Controls:</p>\n<ul><li>WASD / L stick to move</li><li>Mouse / R stick to pan the camera</li><li>Mouse wheel / D-pad up/down to zoom in/out</li><li>Shift / Left Bumper to sprint (if you can)</li><li>ESC to pause the gam</li></ul>\n<p>As the work is unfinished, there are many nooks and crannies that needs to be ironed out; Afterall, the reason I'm putting this demo out is to aid the development from the potential feedbacks and bug reports I could get.<br/>Therefore any bug reports and constructive criticism are always more than welcome.<br/>And while that's cooking, you can check out the game's micro-progresses on my Twitter page: (@ZIKBAKGURI)<br/><br/>Oh. And check out the official soundtrack volume #1 for the game:<br/><br/>I hope to see you soon again in the near future. Take care.<br/><br/><br/>============<br/><br/>A videogame by ZIK<br/>Original soundtrack composed by Gribblesnap (https://gribblesnap.bandcamp.com/)<br/>Special thanks to Polyducks for a roach model (https://twitter.com/Polyducks)<br/>Huge props to TheSnidr (https://twitter.com/TheSnidr) for providing the ColMesh library</p>\n<p>Sounds from mostly Freesound, and wicked, mangled, royalty free sounds in Audacity.</p>\n<p>Sending love to the Youtube Poop and indie game dev community.<br/></p>", "metacritic": null, "released": "2022-08-30", "tba": false, "updated": "2022-09-02T17:40:56", "background_image": "https://media.rawg.io/media/screenshots/0f9/0f98b2d344707535b7c97685e3e15e05.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zik"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}