{"id": 845961, "slug": "the-dragons-curse", "name": "The Dragon's Curse", "name_original": "The Dragon's Curse", "description": "<p>The Dragon's Curse is a fantasy interactive fiction based on asian mythology mostly, but mixing others. Can you find out what are the others?</p>\n\n<strong>The Story<br/></strong>\r\nThere is a belief that there are always second chances.    \r\n<br/>That there is always a path of virtue for those who seek it.\r\n\n<p>You are the General, the hero of Yamato, one of the largest countries in Astrõs, until you are cursed. <br/></p>\n<p>For a thousand souls your sword has snatched, a thousand scales will be awarded to you. <br/></p>\n<p>For each new soul in scarlet scale will become. Be careful, because if the last one does not hold; death is what awaits you.<br/></p>\n\n\n<strong>Romances<br/></strong>\r\nFhlan [She]\r\n<p>The bright and mature of the twins. She is the calmer of the two twins, but don't be confused. She can be just as energetic; however the mature side of her keeps her at bay.</p>\n<p>You can rely on her survival instincts as well as her strong personality against the odds.</p>\n\r\nFhlaon [He]\r\n<p>Mature from outside, child from inside. <br/></p>\n<p>He likes to go to his own free will, and has his ways with daggers and people.  Don't like to much been pushed around.<br/></p>\n<p>Just like his sister, he loves his people.</p>\n\r\nAyu [He/They/She]\r\n<p>A mysterious beauty that you meet along the way.<br/></p>\n<p>As beautiful as kind, seems to share a bond with you. They don't seem to have evil intentions, but sometimes they seem scared to break you?</p>\n\r\nHsajan [They]\r\n\r\nSometimes I prefer silence in suffering.\r\n\n<strong>Credits</strong>\n<p>Itch.io page template by Vahnya.</p>", "metacritic": null, "released": "2022-08-29", "tba": false, "updated": "2022-09-02T18:23:50", "background_image": "https://media.rawg.io/media/screenshots/634/634346df0b636dd6b6048bb9ac62b6a9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["XNueX"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}