{"id": 845923, "slug": "knock-out-arcade-demo-v010", "name": "KNOCK-OUT ARCADE (Demo v0.1.0)", "name_original": "KNOCK-OUT ARCADE (Demo v0.1.0)", "description": "<p>Welcome to KNOCK-OUT ARCADE!</p>\n<p>This is a 2D retro-inspired fighting game with easy-to-pick-up controls and stylish combos. The game takes place at a famous arcade, owned by a mysterious businessman. </p>\n<p>Each character has their own playstyle and combos, making for a diverse roster and allowing players to express themselves.</p>\n<p>The game has a simple 3-button attack layout: light, medium, and heavy. There's also a dedicated Grab button.</p>\n<p>(Special moves not yet implemented.)</p>\n<p>Fight to become the best in this 1V1 pixel-art fighting game for beginners and veterans alike!</p>\n\n<p>--- CONTROLS --- </p>\n<p>NOTE: You must exit out of steam in order for controllers to work with this game. Steam will overwrite the gamepad controls for the game with their weird keyboard/mouse controls.</p>\n<p>NOTE:  Gamepad controls are done using the Xbox 1 controller as the standard. Your controller might not have the same button layout. The ability to change your controls will come at a later update.</p>\n\n<p>-KEYBOARD (Player 1)-</p>\n<p>Movement (walking, crouching, jumping) - W A S D keys</p>\n<p>Light attack - J</p>\n<p>Medium attack - K</p>\n<p>Heavy attack - L</p>\n<p>Grab - Space</p>\n<p>Menu Confirm - J (Light attack)</p>\n<p>Menu Cancel - K (Medium attack)</p>\n<p>Start - any button</p>\n\n<p>-KEYBOARD (Player 2)- remember to disable Numlock!</p>\n<p>Movement (walking, crouching, jumping) - Arrow keys\r\n</p>\n<p>Light attack - numpad 1</p>\n<p>Medium attack - numpad 2</p>\n<p>Heavy attack - numpad 3</p>\n<p>Grab - numpad 0</p>\n<p>Menu Confirm - numpad 1 (Light attack)\r\n</p>\n<p>Menu Cancel - numpad 2 (Medium attack)</p>\n\n<p>-CONTROLLER (assume Xbox controller)-</p>\n<p>Movement (walking, crouching, jumping) - Left analogue stick</p>\n<p>Light attack - X\r\n</p>\n<p>Medium attack - Y\r\n</p>\n<p>Heavy attack - B\r\n</p>\n<p>Grab - RB (right bumper)</p>\n<p>Menu Confirm - X (Light attack)\r\n</p>\n<p>Menu Cancel - Y (Medium attack)\r\n</p>\n\n<p>---BASIC MECHANICS---</p>\n<p>You can move left, right, crouch, and jump using the movement controls listed above.</p>\n<p>There's no dashing or super-jumping, but I plan to add running and back-dashing in a later update.</p>\n<p>You can cancel light attacks into medium attacks, and medium attacks into heavy attacks by pressing the corresponding button when you hit an opponent. ( L &gt; M &gt; H )</p>\n<p>Each attack has variants for standing, crouching, and jumping.</p>\n<p>You can combine crouching and standing attacks in any order. (Ex, numpad notation: 2L &gt; 5M &gt; 2H) (2 means down, 5 means standing)</p>\n<p>You can grab the opponent by pressing the grab button. You will automatically throw them forward, however back-throws are planned to be added later. Grabs beat blocking.</p>\n<p>You can block by holding back, away from the opponent. You can block while crouching to block lows by holding down and back. To block jumping attacks, you must not crouch block.</p>\n<p>Your character will automatically get up after being knocked down.</p>\n\n<p>---ABOUT---</p>\n<p>KNOCK-OUT ARCADE is an indie fighting game being developed entirely by 1 person.</p>\n<p>The game is in very early stages at the moment, but the first character (Russel) is planned to be complete around January of 2023.</p>\n<p>More characters, moves, mechanics, and storylines are coming in monthly updates! You can visit the devlogs in the YouTube video at the top of this page.</p>\n<p>Post a comment in the discussion board if you have any bugs to report or suggestions to add.</p>\n\n<p>---DEBUG MODE---</p>\n<p>To enter debug mode, press ENTER on the keyboard.</p>\n<p>-LEGEND-</p>\n<p>Hurtboxes - the blue boxes surrounding the characters</p>\n<p>Hitboxes - the red boxes created when the player attacks</p>\n<p>Debug info (in order, top left and right) - </p>\n<ul><li>State</li><li>Hitstun Timer</li><li>Horizontal Movement Speed</li><li>Animation Timer</li><li>Palette ID</li></ul>\n<p>Frame Data - Floating number below player 1's health. Denotes how advantageous a move is on hit or block. Positive means the attacking player can act first, negative means defending player can act first.</p>\n<p>Frame-by-frame - Press TAB to enter frame-by-frame mode. To advance a frame, press the \"O\" key. (NOT THE ZERO KEY.) Press TAB again to exit.</p>\n<p>Auto-block - Press Ctrl to toggle auto block. This makes it so that both players will automatically block attacks just by standing (crouching does not automatically block lows.)</p>\n\n<p>---VERSION HISTORY---</p>\n<p>August 29, 2022 - Released version 0.1.0</p>", "metacritic": null, "released": "2022-08-29", "tba": false, "updated": "2022-09-02T18:07:19", "background_image": "https://media.rawg.io/media/screenshots/cc1/cc1dcde87a330825f46da1f24292a277.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jazz Boy"], "genres": ["Fighting"], "publishers": [], "esrb_rating": null}