{"id": 8461, "slug": "wings-remastered", "name": "Wings Remastered", "name_original": "Wings Remastered", "description": "„Wings! Remastered“ brings you back to an experience full of blasting action, drama and emotions. Get your Sopwith Camel started and dive deep into this amazing story of a WWI combat pilot's life experience. Fight your foes in one-on-one air combat, bomb enemy installations and strafe enemy supply lines!<br/><br/><br/>≈≈≈≈≈≈≈<br/>Features<br/>≈≈≈≈≈≈≈<br/><br/>-\tExperience a dramatic World War I storyline from the perspective of a combat pilot<br/>-\tRe-live the horrors and glories of the 56th Squadron<br/>-\tDogfight, bomb &amp; strafe enemies in a variety of dramatic missions<br/>-\tPlay through over 230 diverse missions<br/>-\tEnjoy a completely re-scored orchestral soundtrack by Sound of Games<br/><br/>Jump into the cockpit and enjoy this remastered classic game experience!<br/><br/><br/>≈≈≈≈≈≈≈≈≈≈<br/>What the Media says<br/>≈≈≈≈≈≈≈≈≈≈<br/><br/>This is no mere port of the original; the game's graphics, sound effects and music have all been updated, with superb results. You feel like you're playing a classic, but without the distraction (and, let's face it, detriment) of 16-bit graphics. (...)It's a little disheartening that it's been 25 years since I first encountered the game, but the passage of time hasn't diminished my appreciation for it in the slightest.<br/><br/>Rick Broida, CNET<br/><br/><br/>≈≈≈≈≈≈≈≈≈≈<br/>User Ratings<br/>≈≈≈≈≈≈≈≈≈≈<br/><br/>5/5 - A classic game, updated and improved without losing any of the magic that make the original so special, one of the best games on the Amiga, highly recommended purchase<br/><br/>5/5 - The game works perfect on 5s. Wings is one of my all time favorite games and this one seems perfect! Love it!! Bravo! ! Good job!!<br/><br/>5/5 - WOW .... OLD SCHOOL LOVE IT ......", "metacritic": null, "released": "2015-05-02", "tba": false, "updated": "2019-10-22T14:29:55", "background_image": "https://media.rawg.io/media/screenshots/30c/30ce48ff63f6ff063eea0f0d29f8b114.jpg", "website": "http://kasedogames.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kalypso Media"], "genres": ["Action", "Simulation"], "publishers": ["Kalypso Media"], "esrb_rating": null}