{"id": 846352, "slug": "nightmare-rooms-vr", "name": "Nightmare Rooms VR", "name_original": "Nightmare Rooms VR", "description": "Warning: This game is designed to make you feel uncomfortable, scare you, question your wits, and test your emotional courage.  It is not for the faint of heart! <br/>\n<br/>\r\nHow did you end up here exactly? There's something familiar about this whole place, as if you've been here in your dreams... or nightmares! <br/>\n<br/>\r\nEscaping won't be so easy.  Beyond the 2million square feet of unique labyrinth, you'll still find yourself wondering on forever boundlessly.  Don't lose your sanity though when you stumble into an infinitely looping space or you may need to skip the morning coffee in anticipation for some abrupt surprises.<br/>\n<br/>\r\nThere are so many empty rooms... You must be the only one down here, right?<br/>\n<br/>\r\nNightmare Rooms VR is primarily an infinite horror labyrinth, where you will be navigating a maze while evading perils &amp; scares. A stamina system will limit your rate of teleportation to emulate fatigue while you find consumables &amp; other items to help you along the way.  Which way exactly? That's part of the puzzle.<br/>\n<br/>\r\nCompletion of the game unlocks additional game modes &amp; secrets to find to add to re-playability.  Functional features include auto saving of progress with cloud backup, as well as an innovative new mechanic to prevent you from teleporting through walls.<br/>\n<br/>\r\nYou will spend the majority of time exploring this nightmare (teleporting), so completion requires tremendous patience &amp; courage!<br/>\n<br/>\r\nDo you have what it takes?", "metacritic": null, "released": "2022-09-02", "tba": false, "updated": "2022-09-09T04:54:01", "background_image": "https://media.rawg.io/media/screenshots/7dc/7dc653a655dbdbeb387a6df97153f483.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Isaac Stearns"], "genres": ["Adventure", "Simulation", "Indie"], "publishers": ["Isaac Stearns"], "esrb_rating": null}