{"id": 846304, "slug": "yu-gi-oh-cross-duel", "name": "Yu-Gi-Oh! Cross Duel", "name_original": "Yu-Gi-Oh! Cross Duel", "description": "<p>Overlapping battles make for an ever-changing match! Duelists will have to pay close attention if they want to come out on top!</p>\n<p>[Game Introduction]</p>\n<p>▼ What Is Yu-Gi-Oh! CROSS DUEL?<br />\nIf you want to duke it out in real-time with Duelists worldwide in a brand-new style of card game, then look no further!</p>\n<p>▼ Three Modes to Enjoy!<br />\nIn addition to 4 Player Match Mode, you can play together with characters from the Yu-Gi-Oh! series in Single Player Mode, or head to 4 Player Co-op Mode and team up with other Duelists to overcome a fearsome Raid Boss!<br />\nAim to become the best Duelist in whichever mode suits you!</p>\n<p>▼ Characters<br />\nCharacters from 7 different animated Yu-Gi-Oh! series will make an appearance, partnering with Duelists in battle!<br />\nStrengthen your bonds with your Partners to take down even the toughest enemies!<br />\nWith the original cast doing the voice acting, Duels feel even more dramatic!</p>\n<p>▼ Monsters<br />\nAll monsters have been rendered with 3D graphics, including awe-inspiring Summoning scenes!<br />\nMonsters can be enhanced with a wide range of powerful Skills, allowing Duelists to customize their builds.<br />\nSetting different Skills to the same monster results in wildly different battle styles!<br />\nUse your favorite monsters and Ace Monsters to create your own unique Deck!</p>\n<p>▼ Key Points for Beginners<br />\nBuilding off of previous entries in the Yu-Gi-Oh! series, the new-and-improved Duel system is completely intuitive!<br />\nWith simple controls and rules, even people who have never played a Yu-Gi-Oh! game will be Dueling in no time!<br />\nDeck building just got easier! With the Auto-Create feature, the game will fill in the gaps between your favorite monsters!<br />\nIn 4 Player Matches, you&#39;ll be paired with players of a similar level, so new Duelists can breathe easy!</p>\n<p>▼ Key Points for Yu-Gi-Oh! Fans<br />\nCharacters from the anime series act as your Partners, offering advice and even stepping in to help you in battle!<br />\nDuel together with your favorite characters in a whole new experience!<br />\nWith four players in action at once, there are new possibilities for chaotic yet tactical Dueling, either in a free-for-all or while working in tandem.<br />\nSet Skills to your monsters for limitless strategies! Choose your favorites and build a Deck that capitalizes on Ace Monsters&#39; strengths!</p>", "metacritic": null, "released": "2022-09-05", "tba": false, "updated": "2022-09-19T07:29:59", "background_image": "https://media.rawg.io/media/screenshots/107/1070faaced5054e55dc6f796c0083f1c.jpg", "website": "https://www.konami.com/yugioh/crossduel/en/index.php", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android"], "developers": ["Konami Digital Entertainment"], "genres": ["Strategy", "Board Games", "Card"], "publishers": ["Konami"], "esrb_rating": "Everyone 10+"}