{"id": 846342, "slug": "falling-to-heaven", "name": "Falling to Heaven", "name_original": "Falling to Heaven", "description": "\"War makes sin, and sin makes hell.\" <br/><br/>FALLING TO HEAVEN is a rogue-like, action, twin-stick shooter. <br/><br/>One day, a mercenary, who had just finished his task and returned home to rest, woke up and found himself in a hell with a smell of sulfur and an unquenchable flame. At the same time, he also heard a \"mysterious voice\", which constantly guided him and led him out of hell.<br/><br/><strong>Maps of different styles</strong><br/>Players' journey to hell will be divided into four areas with different styles on the map. <br/><br/><strong>Distinctive partners and become stronger</strong><br/>During the escape, players will get the help of NPCs in the safe area all the time. Weapons, intelligence, transformation, health treatment... These \"help\" will determine the way our mercenaries escape from hell.<br/><br/><strong>Long-term growth in Strength</strong><br/>At the same time, if you returns to the starting point unfortunately, it does not mean that previous trials are meaningless. You will be stronger in the beginning of next trial. The continuous growth in your power will help you reaching the end.<br/><br/>Although the game flow with roguelite as the main playing method is formulated, we don't want to limit the work to the conventional content. We don't want the map to be just a scene, a stage. We set it up as a real \"hell\", a world worth exploring.<br/><br/>A room, a strange object, a strange enemy, behind them, is the exploration part we have carefully prepared. The results of these explorations will deeply affect the game process of players.", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-09T04:41:24", "background_image": "https://media.rawg.io/media/screenshots/3a3/3a30e3beb8ab0914c9f10875c62b39d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Phoenix Studio"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Phoenix Studio"], "esrb_rating": null}