{"id": 846331, "slug": "jurassic-clans", "name": "Jurassic Clans", "name_original": "Jurassic Clans", "description": "<h3>Intro</h3><br/>A group of primitive humans finally left the cave and gathered enough courage to face the brutal Jurassic world. It's time for the hunter to become the hunted. Teeth will be met with a club, and skin will be slashed with stone and pierced with arrows. Men's clash with dinosaurs for the land's supremacy is inevitable.<h3>Description</h3><br/>Jurassic Clans sets in a world where dinosaurs co-exist with primitive humans. The goal is to ensure your people thrive in this dangerous world. Survive and evolve your tribe to a modern civilization by gathering resources essential to your village's expansion, research primitive technologies to improve your people's abilities, and unlock more and better tools to make sure you defend your village from animals and wicked humans to endure the upcoming end of times.<br/><br/>● Explore different locations to gather resources and to find the right place to settle your village.<br/>● Equip the natives with the best-hunting weapons available and look for food, gather fruits from bushes and trees, and fish from the rivers. <br/>● Build and evolve your village, from a cave to primitive tents, mud houses, and stone houses. Expand your village to increase your population.<br/>● Assign different weapons according to your needs. An Axe is better suited to chop down a tree than a knife. A spear will benefit more while hunting than a pickaxe.<br/>● Research different technologies to improve your village and your people's skills. <br/>● Technologies allows the creation of new tools and weapons to be used in the right actions.<br/>● Encounter different predators. Some are carnivorous and will attack without hesitation; others are more peaceful and most likely a target for hunting. But beware, some dinosaurs are natural-born killers and will stalk, hide and wait for the right opportunity to tear off your flesh.<br/>● Domestic wild dinosaurs to suit your needs.<br/>● As your village evolves, other villages will evolve too, and war is inevitable.", "metacritic": null, "released": "2022-09-02", "tba": false, "updated": "2022-09-09T04:29:22", "background_image": "https://media.rawg.io/media/screenshots/4ab/4abf9a6f2f221e5412ceece892e7e726.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GoldenGod Games"], "genres": ["Strategy", "Simulation"], "publishers": ["GoldenGod Games"], "esrb_rating": null}