{"id": 846499, "slug": "shatterline", "name": "Shatterline", "name_original": "Shatterline", "description": "Shatterline is a free-to-play arena FPS with a roguelike co-op mode (Expedition) as well as several traditional PvP modes such as TDM, Conquest, Plant-the-Bomb, and Escort. Players can choose from 8 unique Operatives and an armory of 25 weapons that can be customized via attachments.<br />\nBuilding Shatterline has been our shared passion for five years and building the Frag Lab Studio for even longer than that. Several months ago we lost our publisher, but we continued to work on Shatterline. We finished key game systems, fixed hundreds of bugs, polished the gunplay, and figured out how to publish our game to Steam. Now we come back to you, the community of players, to help us shape the future of Shatterline.<br />\nOur approach to developing Shatterline brings you, the player, into our development process. We believe this community-partnered approach to development will result in a lasting game that shooter players love.</p>\n<p>Our team is very active in Discord with the community and we play together daily. Each week we gather up Discord feedback and in-game telemetry data, then we debate about what we believe will improve the game. We put the stuff that survives the crucible of debate and community scrutiny into our future development roadmap. We keep the game fresh with monthly releases of new content and features.<br />\nWe ask you to give Shatterline a try. We believe you will be impressed.<br />\nShatterline is beta/pre-release software. Some features may not work correctly, and this version of the game may be unstable at times.</p>", "metacritic": null, "released": "2022-09-08", "tba": false, "updated": "2024-01-07T12:11:32", "background_image": "https://media.rawg.io/media/games/def/def62dcd2d1751dc4dd38d662919a6f9.jpg", "website": "https://www.shatterline.gg/", "rating": 3.5, "rating_top": 4, "added_by_status": {"yet": 11, "owned": 735, "beaten": 1, "toplay": 4, "dropped": 32, "playing": 6}, "playtime": 2, "achievements_count": 1, "ratings_count": 28, "suggestions_count": 516, "game_series_count": 0, "reviews_count": 28, "platforms": ["PC"], "developers": ["Frag Lab"], "genres": ["Action", "Massively Multiplayer"], "publishers": ["Frag Lab"], "esrb_rating": null}