{"id": 846477, "slug": "nin-online-2", "name": "Nin Online", "name_original": "Nin Online", "description": "<h3>Ninja MMORPG with hardcore, old-school MMORPG inspirations and Open World PvP.</h3>Free-to-play with zero Pay-to-win mechanics.<br/><br/><br/><br/><br/><ul><li><strong>Choose from 3 Villages or become a Rogue Ninja</strong><br/>Start off as in one of three factions, grow up in the safety of the gates of each village. But once you're strong enough, you can choose to abandon your home and become a hermit... or even go rogue.<br/><br/><br/><br/></li><li><strong>Open World PvP &amp; Hardcore Game Design</strong><br/>This may be a turn off for some, but Nin Online is a very hardcore game. So take this as a word of warning... Absolute freedom when it comes to PvP also means a bad time for some with a low tolerance for being killed for no reason. But for others, it's just another reason to get stronger in this harsh Ninjaverse.<br/><br/><br/><br/></li><li><strong>Deep Character Customization in the right places</strong><br/>Choose to be part of a clan, join an organization or sign a contract with an animal familiar. Combined with thousands of equip-able items, no two ninja will ever look or be the same. Nin Online is a game where you are encouraged to express yourself. Looking good doesn't cost you to lose fights.<br/><br/><br/><br/></li><li><strong>Friendly and active community &amp; developers</strong><br/>The greatest feature of Nin Online is it's tight knit community. The developers are active in our chat channels and have been constantly listening to feedback improving it since it's release. The game is still in active development with updates being made on a weekly and sometimes daily basis.<br/><br/></li></ul>", "metacritic": null, "released": "2022-09-07", "tba": false, "updated": "2022-09-09T07:33:27", "background_image": "https://media.rawg.io/media/screenshots/da0/da04650808788060bcfcd0dabc37d384.jpg", "website": "https://ninonline.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 234, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hitspark"], "genres": ["Action", "RPG", "Massively Multiplayer", "Indie"], "publishers": ["Hitspark"], "esrb_rating": null}