{"id": 846518, "slug": "in-stars-and-time", "name": "In Stars and Time", "name_original": "In Stars and Time", "description": "<strong>What would you do if you were forced to relive your failures over and over again?</strong><br/><br/><br/><br/><strong>In Stars and Time</strong> tells the story of Siffrin and their adventurer friends—a found family bound together by fate in order to end the tyrannical reign of an evil king. But as victory is just within the party’s grasp, a tragedy occurs, the clock resets, and <strong>they have to do it all again</strong>. <br/><br/>As Siffrin’s the only one who notices this loop, each new start wears away at his cheerful veneer, yet he keeps going in hopes he can end this temporal tragedy once and for all.<br/><br/><strong>In Stars and Time</strong> is a <strong>time-looping RPG adventure</strong>. With each loop, Siffrin gains a new perspective on the world around them, opening up new solutions to puzzles and allowing them to make better choices in conversation. Equip memories as armor, pray to the Change God to improve your team’s capabilities each loop, and challenge deadly foes to Rock, Paper, Scissors as Siffrin seeks the truth.<br/><br/><h3>✦ Our Adventurers</h3><ul><li><strong>Siffrin (he/they):</strong> Stressed, depressed, and under duress. (Don’t worry about it. They’re doing fine.) The punmaster protagonist of our neverending tale.<br/></li><li><strong>Mirabelle (she/her):</strong> A caring and nervous housemaiden mysteriously blessed by the god she so ardently follows.<br/></li><li><strong>Isabeau (he/him):</strong> Defender with a heart of gold. Cares dearly for his people and his friends.<br/></li><li><strong>Odile (she/her):</strong> The mature and nonsensical researcher studying…something. (No, she will not tell you what it is.)<br/></li><li><strong>Bonnie (they/them):</strong> Wait a minute, who brought this kid along???</li></ul><h3>✦ Features</h3><ul><li>Save the world through the power of Rock, Paper, Scissors in <strong>strategic turn-based RPG</strong> combat encounters.<br/></li><li>Ignore the limits of time and space to <strong>fix your past mistakes</strong> by repeating the same two days over and over again.<br/></li><li>Equip the <strong>memories you have of your friends</strong> to make your party stronger in combat. <br/></li><li><strong>Watch the fate of this world unfold</strong> as you escape the twists and turns of this endless(???) loop.<br/></li><li>Eat <strong>samossas</strong> with your friends!<br/></li><li>Get heckled by a <strong>cheeky ethereal being of infinite starlight</strong>.<br/></li><li>Pray to a god for good luck in your travels. <strong>You’re gonna need it.</strong></li></ul><br/><br/><br/>If any of this interests you, you might also want to play the game’s initial prototype, START AGAIN START AGAIN START AGAIN: A Prologue. While you don’t need to play it to understand In Stars and Time, it’s fun to see the game’s roots.", "metacritic": null, "released": "2023-11-20", "tba": false, "updated": "2024-03-11T03:30:05", "background_image": "https://media.rawg.io/media/screenshots/156/1566c79072b65597ead7bfd5ea0bcb96.jpg", "website": "https://www.instarsandtime.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 6, "toplay": 5, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["insertdisc5"], "genres": ["RPG"], "publishers": ["Armor Games Studios"], "esrb_rating": null}