{"id": 846544, "slug": "the-jovian-crisis", "name": "The Jovian Crisis", "name_original": "The Jovian Crisis", "description": "<p>After three centuries of exploration, exploitation, and colonization, the Sol system has slowly degenerated into petty warfare, corruption, and tyranny. As the imperialist Federated Nations of Earth bickered over meaningless squabbles and insignificant titles, the starving and oppressed workers of the Jovian Union (a semi-independent vassal of Earth) rebelled on Jupiter's largest moon: Ganymede. </p>\n<p>Having suffered through years of strife and civil unrest, a band of extremists on Ganymede stole grav-warp technology from Union leaders in a bid to turn the tides of an upcoming rebellion to their favor. However, in their impatience and lust for power, the extremists mishandled the dangerous technology, causing a chain reaction which eventually destroyed the core of the moon and shattered its upper levels into pieces, annihilating the population and a large portion of Unionist garrisons stationed on the body. </p>\n<p>With the anger and despair of witnessing such a tragedy combined with the decisive damage Ganymede's explosion enacted on Unionist forces, it is all but inevitable that the remaining repressed populations in the Jovian system rebel against their oppressors. Into this chaos rises the Hunter, a figure of relative mystery to the denizens of Sol's largest planet, but a famous war hero to the people of Mars, and an infamous nemesis to the inept nobles of Earth. Now decaying away in the dreadful cells of the Red Spot prison, the Hunter has set His eyes upon the Dictator of the Jovian Union, a former friend turned traitor who was rewarded with command over Jupiter for his treachery.</p>\n<p>The Jovian Crisis has begun. Your time is now, Hunter. </p>\n\n<p>Want to join our Discord? Click here! https://discord.gg/jc3Cf65cZN</p>", "metacritic": null, "released": "2022-09-05", "tba": false, "updated": "2022-09-09T08:39:55", "background_image": "https://media.rawg.io/media/screenshots/f6d/f6d34ae1a4eabfca790f6bb0fdec0c43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jovian Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}