{"id": 846622, "slug": "moldy-apartment", "name": "Moldy Apartment", "name_original": "Moldy Apartment", "description": "<p><strong>Description</strong></p>\n<p>Simple game about cleaning mold from the walls of your apartment while being affected by the weather of a very humid city. This game is an entry to the One Lone Coder CodeJam 2022 and it's somewhat inspired by Fall Of The Cog (an excellent and addicting entry to the 2021 CodeJam) and my personal suffering with high humidity. It was implemented using Love, a 2D game framework made to create games using Lua.<br/></p>\n\n<p><strong>Mechanics</strong></p>\n<p>You have a squeegee and a bucket of water to clean the walls of your apartment. The mold continues to multiply while you clean it and the progression ratio is affected by the weather outside, so it's also important to keep control of the windows to defend yourself and also benefit from the weather outside. The mold progression is very \"snowbally\", so once it's goes out of control, it's very difficult to stop.<br/></p>\n<p>If you are able to clean all the mold, you are victorious. If you're not, it's game over.</p>\n\n<p><strong>Controls<br/></strong></p>\n<p>WASD: controls the movement of the player</p>\n<p>Escape: pauses/unpauses the game</p>\n<p>RMB: allows you to aim with the squeegee</p>\n<p>LMB: while aiming with the squeegee, it's used to clean a wall or \"recharge\" the squeegee by pointing to the bucket</p>\n<p>1: alternates to the squeegee</p>\n<p>2: alternates to the water bucket (or nothing in case the bucket is on the floor)</p>\n<p>F: grabs/drops the water bucket</p>\n<p>E: used to open/close windows and to fill the water bucket with water from the sin</p>\n<p><strong>Tips</strong></p>\n<p>- The mold starts to affect other blocks when it reaches \"stage 10\" (final)</p>\n<p>- Leave the windows open only during sunny weather (which happens only during the day)<br/></p>\n<p>- Be fast!</p>\n\n<p><strong>Observations</strong></p>\n<p>I'm aware the game isn't well balanced and lacks enough mechanics to make it interesting, but it wasn't possible to fix those things in time, especially due to the giant and disgusting spaghetti code that I created. It was a mistake to try to do a lot of things on my own, which hindered my progress.<br/></p>\n\n<p><strong>Credits / Acknowledgements</strong></p>\n<p>- Background music by Eugenio Mininni (found through Mixkit)<br/></p>\n<p>- Boipushy (a library to control certain inputs) by a327ex<br/></p>\n<p>- Classic (a library for OOP purposes with Lua) by rxi<br/></p>", "metacritic": null, "released": "2022-09-04", "tba": false, "updated": "2022-09-09T09:13:24", "background_image": "https://media.rawg.io/media/screenshots/d2e/d2ecc882e0b039a29d2bf18907917e8d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Millais"], "genres": [], "publishers": [], "esrb_rating": null}