{"id": 84673, "slug": "jesustellsme", "name": "JesusTellsMe", "name_original": "JesusTellsMe", "description": "From the very NEW, Mobile Entertainment Products startup<br/>JOHNAVATAR.com™ - comes...<br/>                                          http://www.johnavatar.com <br/>                                          (Download our other APP's.)<br/><br/>\"JesusTellsMe\" - spoken words and image of Jesus Christ!<br/><br/>Hear the words and see a beautiful image of  Jesus Christ.<br/><br/>This is a Universal APP and will work with iPad, iPhone and iPod Touch......<br/><br/>Second GODAPP in a series from John Avatar™...<br/><br/>The Voice, Angels and FX are highest quality, stereo.  Play through your church, or any sized, in door, or out door theatre, or any venue sound system, for high impact on large crowds.  Perfect for use in church, church events and to anyone, anywhere in the world.<br/><br/>Bring \"Tech\" to your next gathering, or in church, temple... show them your iPad, or iPhone, or iPod Touch, with this app.... they'll love it, and will be affected.....<br/><br/>Exclusively from JOHNAVATAR.com™. <br/><br/>JOHNAVATAR.com™ <br/>Santa Monica, CA 90402 (Silicon Beach) <br/>USA <br/><br/>Website:  http://www.johnavatar.com<br/><br/><br/>Mark 12:31 – “Love your neighbor as yourself.”<br/><br/>Mark 12:30 – “Love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.”<br/><br/>John 3:16 – “For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.”<br/><br/>John 15:5 – “I am the vine; you are the branches. If a man remains in me and I in him, he will bear much fruit; apart from me you can do nothing.”<br/><br/>John 20:29 - “Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.”<br/><br/>John 3:3 - “I tell you the truth, no one can see the kingdom of God unless he is born again.”", "metacritic": null, "released": "2010-07-02", "tba": false, "updated": "2019-10-22T14:22:16", "background_image": "https://media.rawg.io/media/screenshots/94a/94afc622d7cbda13871b0fec2c955a5c.jpg", "website": "http://www.johnavatar.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["John Avatar"], "genres": ["Family"], "publishers": ["John Avatar"], "esrb_rating": "Everyone 10+"}