{"id": 846781, "slug": "beach-weather", "name": "Beach Weather", "name_original": "Beach Weather", "description": "<p>Just your normal day at the beach. Build a sand fort, get as high as you can, watch out for the weather.<br/></p>\n<p>Made over nine days for One Lone Coder Codejam 2022, first-time use of C++ and the Pixel Game Engine.</p>\n<p><strong>Instructions</strong></p>\n<p>Arrow keys to move. You can only move up or down when near a standing ladder.</p>\n<p>WASD for filling/using your bucket: <strong>w</strong>ood, w<strong>a</strong>ter, <strong>s</strong>and, and <strong>d</strong>ump contents.</p>\n<p>Water and sand together in your bucket make damp sand, for building up your fort. Yes, it makes blocks that are taller than your head. It's a large bucket. Complete blocks of damp sand have crenellations, and can be stood on top of.</p>\n<p>Sand by itself is dry, and will fall and be blown about by the wind.</p>\n<p>Water by itself is only good for wetting sand being dried out by the sun.</p>\n<p>Wood is used to set up ladders against a complete block of dry or damp sand, to climb higher up. They can also be dumped on the floor, and will float on the tide.</p>\n<p>Sand can be picked up anywhere; water can be picked up if you're close enough to the water line; wood can be picked up from the pile on the left, or wherever there's a ladder lying on the ground.</p>\n<p>The keys in the bottom left will light up when their action is available, in the colour for the content they'll leave in your bucket.</p>\n<p>Make it to near the top of the screen to win. If you get completely submerged in the sea, you're done for.</p>", "metacritic": null, "released": "2022-09-04", "tba": false, "updated": "2022-09-09T10:16:56", "background_image": "https://media.rawg.io/media/screenshots/904/904d616f90abf39a17e17cf854e0dfc1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Charnel Mouse"], "genres": ["Action"], "publishers": [], "esrb_rating": null}