{"id": 846751, "slug": "inas-exhausting-quest", "name": "Ina's Exhausting Quest", "name_original": "Ina's Exhausting Quest", "description": "<p>Famed Vtuber Ninomae Ina'nis has just found out her chat has disappeared and someone going by the name \"Mr. Trenchcoat\" has claimed responsibility. Now Ina must defeat evil clones of her Vtuber friends in hopes of finding out what happened and how someone even could kidnap thousands of viewers at once.</p>\n<p>IEQ is a comedic 2d souls-like about traversing a jank metroidvania. Features include:</p><ul><li>Bosses that can be defeated in any order (though not all of them).</li><li>Puzzles that are genuinely puzzling. Also some that are less puzzling, and some that will leave you puzzled as to why they'd even be there.</li><li>Abilities to collect that will let you go from normal \"human\" to practically Icarus.</li><li>Combos and athletic feats only limited by your stamina meter.</li><li>\"Hard but Fair\" gameplay applied to both the player and the enemies.</li><li>Collectibles! And they'll also turn the player character into a god by the end.</li></ul><p>IEQ is an unofficial Hololive fangame following the guidelines as best can be discerned. It uses mainly the Holomyth branch, though with mention of the other Hololive EN members as well. In addition various fan mascots and representations are used.</p><p>This game uses a custom engine built on SDL2, but leaves lua scripts open source as well as not obfuscating any assets. All code and assets are free to use in other projects, as long as any that use Hololive characters or recognizable lore (like the KFP branding) also follows Hololive's fanwork guidelines, listed here. </p>", "metacritic": null, "released": "2022-09-04", "tba": false, "updated": "2022-09-09T10:05:35", "background_image": "https://media.rawg.io/media/screenshots/563/563c0845d88276307afd9485b16a5942.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Colin EUMP"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}