{"id": 846977, "slug": "no-way-railways", "name": "No Way, Railways!", "name_original": "No Way, Railways!", "description": "<p>Meet Miguel, the miner cat. Today he was just going to another day at work on the caves. He picked up his trusty mining tool (a revolver) and jumped on a minecart before venturing deep down those holes. However, his sleepy nature didn't allow him to realize he picked up the broken cart at the mine's garage. For some obscure reason this specific cart's wheels only spins clockwise! Will Miguel be able to survive the dangers of his daily routine while handicapped like that?? Well, that will only depend on how well you do while playing!</p>\n<p>This game was made for whisker jam 2022, and the version  that's out right now was rushed for the deadline unfortunatelly, but after the end of the jam I'll be updating the game to add everything I initially planned to add at first.</p>\n<p>----------------------------------------------------------------------------------------------------------</p>\n<p><strong><em>CONTROLS:</em></strong><br/></p>\n<p>WASD to move around and mouse to aim and shoot. </p>\n<p>(sorry AZERTY keyboarders, I'll add an option to make the game more playable for you when I release the definitive version)</p>\n<p>You can only walk on railways obviously, but you also can only walk forward, holding down whatever key would be \"backwards\" for you will only result in a brake.</p>\n<p>To make turns on bifurcations you need to release whatever key is forward and hold to the direction you wanna go.</p>\n<p>If you feel you're fast enought you can run over enemies btw, that's another basic mining technique Miguel is used to doing.</p>\n<p>----------------------------------------------------------------------------------------------------------</p>\n<p><strong><em>CREDITS:</em></strong><br/>Basically everything made by the one and only Lord Pillows, except the stuff that wasn't.</p>\n<p>Worm enemy sprite by Dogtopius! (and I guess he made the music too, but that's more of a minor contribution)</p>", "metacritic": null, "released": "2022-09-04", "tba": false, "updated": "2022-09-09T11:34:54", "background_image": "https://media.rawg.io/media/screenshots/ccf/ccf214b6b2ae77900714743c8169f13d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lord Pillows"], "genres": ["Action"], "publishers": [], "esrb_rating": null}