{"id": 846928, "slug": "the-devils-pass", "name": "The Devil's Pass", "name_original": "The Devil's Pass", "description": "The Devil's Pass\r\n \r\n<p>\"Very bad men in very deep trouble\"\r\n </p>\n<p>Travel back in time to 1452, to find a gang of hardened mercenaries  gone very, very bad. They have taken up residence in a hidden valley in  the Franconian forest, where their sins have caught up with them at  last. But their innocent neighbors are suffering too. War has broken out  and blocked your route, putting this tortured valley in your path. Can  you penetrate the deadly mystery, and liberate the people of The Devil’s  Pass? <br/></p>\n<p>\n</p>\n<p>Codex Adventum: The Devil’s Pass is a short historical 'Low Magic' adventure with strong horror elements. It is designed for 3-4 players of levels 4-6. This mini-module is based in the same world as The Road To Monsterberg series, in a slightly different region (600 km away) in Franconia, Germany. But it's basically the same Late Medieval Holy Roman Emprie. This module is designed for you to hit the ground running, with less preparation and more convenience. It comes with five pre-gen characters and several NPCs (a few of which can also be used as player characters) although you can generate your own using the Player's Guide or any other method you prefer. It's also adaptable to other systems such as WHFRP, Mythras, Gurps Low Tech etc.</p>\n<p>This module takes place where the mini-encounter \"Robbery at the Zur Höll\" leaves off, and that entire micro-encounter is also included in this book for conveniencce. The Devil's Pass puts your players into a contained environment, a seven kilometer long valley, where a small town is besieged by the depraved remnants of a mercenary company gone bad. There are other (supernatural) things afoot in the valley to further complicate the situation, and your PCs will have to be on their toes to survive. They will have an opportunity to engage in several combat encounters and (if you want) to unravel a variety of mysteries.</p>\n<p>\n</p>\n<p>This mini-module is set up as a semi-sandbox, with a default plot you can use, but which you can easily deviate from if you prefer. The module also comes with a new weapon (Spiked Gauntlets), a new Martial Feat (the Vicious Bite), three new spells (Lubricum Digitalis, Lubricum Pedides, and Armor of the Archangels). The module is designed to be playable in two to four sessions, requiring a minimal familiarity with the Codex Martialis system and the use of Core Rules and the Player's Guide. Codex Superno will also be helpful but isn't necessary. Adaption to other systems would take some time but should be fairly straitforward.</p>", "metacritic": null, "released": "2022-09-03", "tba": false, "updated": "2022-09-09T11:16:47", "background_image": "https://media.rawg.io/media/screenshots/1e7/1e797dfa9ac99a4a25051cc03527deec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Codex Integrum"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}