{"id": 846921, "slug": "the-secret-diary-of-acrians-locket-revised-edition", "name": "The Secret Diary of Acrians Locket (Revised Edition)", "name_original": "The Secret Diary of Acrians Locket (Revised Edition)", "description": "<p>Acrians Locket is a 25 year old author from the south. He started his journey into the occult around age 16 but previously from 12-14 had a very witching and magickally enhanced life until then. His magick has encapsulated everything from self admited \"wanabe pop culture spheres\" to time travel, to Voodou- the crossroads, plasmas of as this book suggests demons, the end times and the occult.\r\n</p>\n<p>The Secret Diary of Acrians Locket Revised Edition ACT 1 is a raw magickal journal that details one author: Acrians Locket, during his start as an occultist until the end of the first volume. It takes the form of a journal over the course of many years, with odd formating on occasion and loads of grammatical functions that many may deem unprofessional. Acrians in the journal states that he is adamant that it remained unaltered from his original writing as much as possible, but did go back to edit a few things here and there given this is revised. It holds the key entries from his blog/journal, which is up to the 400's as of publication. The diary is public domain and talks about God, Christianity, Left Handed Path Occultism, different deities gods and goddesses and even has splashes of traditional art and painting here and there.\r\n</p>\n<p>This book I wouldn't consider an easy one to digest purely because Acrians does not shy away from the dark and dirty of his practice in the occult. Even if there are Christ like themes here and there, and while a Chrisitan could learn a thing or two from this \"black magick\" it is a book drenched in taboo and the occult, twisted morality and poltics, as well the insane. It is Acrians's journey into madness, mayhem, chaos and his art. <br/></p>\n\n<p>The download contains a: PDF, an Word Doc, and an Epub. Most epubs can be downloaded and transfered to any ereader, and else the book is available in print HERE<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-09T11:13:40", "background_image": "https://media.rawg.io/media/screenshots/7a1/7a1dece801e6bdbd79e6d357610cbec5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MagickisforEvery1"], "genres": [], "publishers": [], "esrb_rating": null}