{"id": 847123, "slug": "psion-protocol", "name": "Psion Protocol", "name_original": "Psion Protocol", "description": "<p><strong>Developer Pledge:<br/><br/></strong>Psion Protocol is currently in development, but I am trying to make a fun game that is enjoyable and rewarding, if you'd like to participate in the journey of making this game, don't doubt leaving us a comment!<br/><br/>(By pre-ordering now, you get the latest stable build of the game to try!)</p>\n<p><strong><br/>Gameplay:</strong><br/><br/>endless waves of enemies in Survival Mode, earn as much experience as possible and survive for as long as possible! Pick a Psion with a unique passive skill and starting power, unlock Powers and Gear by completing Achievements! Control the movement of the Psion and it will unleash the powers you choose for them in each build, mix different Psions with different Powers and Gear each time you play!<br/><br/><strong>Story:</strong><br/><br/>Join the Psion Rangers in the defense of Earth from the endless waves of Nightmares!<br/><br/>In the future, humanity has harnessed the power of the mind and with the use of the technology known as Psi-Tech, they have unlocked unprecedented ways to manipulate reality. But the prolonged use of this technology has weakened the Psi-Field stability, \"Nightmares\" creatures born of negative human emotions pour into Earth's surface, it falls to the Psionic Heroes to be humanity's shield, elite combatants with oustanding potential, aided by the power of the Psion Protocol Masks.<br/><br/><br/><strong>Join us on discord! https://discord.gg/mX2Y382F</strong></p>", "metacritic": null, "released": "2022-09-03", "tba": false, "updated": "2022-09-09T12:37:09", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WindingPathhwayGames"], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}