{"id": 847328, "slug": "megaman-battle-network-fan-gacha-simulator", "name": "MegaMan Battle Network Fan Gacha Simulator", "name_original": "MegaMan Battle Network Fan Gacha Simulator", "description": "<p>Rumor has it there is or was going to be a mobile gacha game for the MegaMan Battle Network series. Whether or not anything official comes of that rumor still remains to be seen...</p>\n<p>So in the meantime, I made this fan gacha game/simulator! The simulator presented here is based off of my earlier Gacha Game Simulator. This features characters from the MegaMan Battle Network series by Capcom (plus a few fan ideas of my own). This is purely a <em>fan game</em>, no profits are being made off of this. It is to be enjoyed freely by anyone who want to play it! The art isn't spectacular, but at least I tried.</p><p>Also note that the character descriptions are a mix of canon and fanon/headcanons/random ideas I had that seemed neat. Also also some of the names are a mix of the original Japanese names and the English localized games, especially in cases where the character had a last name in Japanese but not in English. Just thought I should leave a note about that!<br/></p>\n<p>Anyways, like the original Gacha Game Simulator, this simulator  was made with HTML, Javascript, and a bit of CSS. It's very basic and bare bones: you go to the Zenny Generator page to get Zenny which can then be used to make pulls on the other  pages. As a result, this is purely the actual <em>gacha part </em>of a gacha game. So unfortunately there's nothing to actually do with the characters you  get. But hey, you can get them without spending real world money!\r\n    <br/></p>\n<p>There's also a gallery so you can view the characters without needing to go through the gacha pulls! This also includes the special costume gallery for the character costumes. </p>\n<p>You can also turn on True Gacha Mode to play the simulator with pull  rates that are closer to real gacha games. Or at the least, they're definitely a lot harsher than the basic rates. Meaning that you'll be a lot  less lucky in getting the rarer characters!</p>\n<p>Note: The source files for this simulator are hosted on GitHub, if anyone in interested in modifying this further. Also, I would recommend not clicking any buttons in the simulator too quickly, due to potential loading issues. If the slowdown/loading gets particularly bad, I would recommend downloading the zip file of the game from GitHub! On the linked page, click on the green Code button, then select \"Download ZIP\". Once you have it, open the zip and then open the index.html page to start playing the simulator.</p>\n<p>But besides that, hope you all have fun with this!<br/></p>", "metacritic": null, "released": "2022-09-02", "tba": false, "updated": "2022-09-09T14:08:16", "background_image": "https://media.rawg.io/media/screenshots/25b/25bffc2c08ecbbb66c377079bbefa6ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 18, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["DragonMarquise"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}