{"id": 847397, "slug": "darkest-depths-itch-dolphcode", "name": "Darkest Depths (itch) (Dolphcode)", "name_original": "Darkest Depths (itch) (Dolphcode)", "description": "<p><strong>IMPORTANT</strong> </p>\n<ul><li>The hard mode ending contains a jumpscare, you have been warned</li><li>When playing in the browser, I'd recommend playing in full screen since part of the game gets cut out if you aren't in full screen</li></ul>\n\n<p><strong>The Ceaseless Well</strong></p>\n<p>Scientists have discovered an anomalous trench just a few kilometers off the coast of a remote island. The inhabitants of the island refer to this as \"The Ceaseless Well.\" Further investigation reveals certain anomalous properties regarding the trench, including strange noises and high amounts of radioactive particles. It's up to you to explore the well and uncover its dark secrets</p>\n<p><strong>Gameplay</strong><br/></p>\n<p>This game is a short experience in which you control a submarine and have to navigate your way through 6 challenging levels featuring tight spaces and moving objects. The game gives you the choice of playing on easy mode or hard mode, with each mode also featuring a different ending.</p>\n\n<p>This project was made with the help of a course offered by Gamedev.TV which I would highly recommend for aspiring, beginner game developers. Below is a link to the course .</p>\n<p>https://www.udemy.com/course/unitycourse2/<br/></p>\n<p>(Don't mind the price, it goes on sale by a lot fairly often)<br/></p>\n\n<p>In spite of the length of the experience this is one of my first, more complete projects so any and all feedback is greatly appreciated</p>\n<p>Other than that I hope you enjoy my game!<br/></p>", "metacritic": null, "released": "2022-09-02", "tba": false, "updated": "2022-09-09T14:39:18", "background_image": "https://media.rawg.io/media/screenshots/f48/f4883846ebf5c2a6298c29045376a416.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Dolphcode"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}