{"id": 847529, "slug": "project-inertia-david-schutte-agltaria-jokermain-i", "name": "Project Inertia (David Schutte, AGLtaria, JokerMain, ItsRaijin)", "name_original": "Project Inertia (David Schutte, AGLtaria, JokerMain, ItsRaijin)", "description": "<p>SPRINT 2 FEEDBACK: https://forms.gle/9rxb3sdKH1XUwCDq6</p>\n<p>Project Inertia is a stage-clear 3D action platformer with a focus on speed, style, and flow. The main objective sees players clearing stages in the fastest time possible whilst doing so in the most stylish way possible through tricks, taking shortcuts, and more.</p>\n<p>Players can swap between two different control schemes during gameplay – one that derives from platformers such as Super Mario Odyssey and Sonic Adventure (Adventuring Style) and one that controls like similar to that of Tony Hawk’s Pro Skater (Surfing Style). Adventuring Mode offers more precise control with more movement options at the cost of speed, whereas Surfing mode gives the player speedier, looser controls with the ability to perform tricks.  \r\n  </p>\n<p>Replay-ability comes in the form of learning how to use the two styles of controls together to discover hidden paths, unlock “Set Pieces” and chain “Action Combos”. Players who have fully mastered the use of both styles and can use them unconventionally to their advantage should also be rewarded for skillful play in the form of time bonuses. \r\n</p>\n\n<p>A Game by Imperfect Chaos</p>\n<p>David Schutte</p>\n<p>Christa Zhang</p>\n<p>Bennett Chung</p>\n<p>Habibullah Saleem</p>\n<p>Declan Carveth</p>\n<p>Francisco Castro</p>", "metacritic": null, "released": "2022-09-02", "tba": false, "updated": "2022-09-09T15:42:35", "background_image": "https://media.rawg.io/media/screenshots/027/027b757664e9ccb40bff5535b13b1bda.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ItsRaijin", "David Schutte", "JokerMain", "AGLtaria"], "genres": ["Action"], "publishers": [], "esrb_rating": null}