{"id": 847819, "slug": "sivan", "name": "SIVAN", "name_original": "SIVAN", "description": "<p><strong><em>IMPORTANT NOTE:</em></strong></p>\n<p><strong> I couldn't fix the resolution in time for the </strong><strong>submission, so it might be too big on this site. Playing full screen fixes it but leaves a blue rectangle on the side. Sadly, this is the best solution for now for people who don't want to download the game.<br/></strong></p>\n<p><strong>(If you have a Mac, you can download for the perfect resolution (1166X986))</strong></p><p>(Also added the project files for non-Mac users so you could run it on your own machine - although its NOT an exe).</p>\n<p><strong>---------------------------------------------------------------------------</strong></p>\n<p><strong><em>SIVAN:</em></strong></p>\n<p>Choosing a character doesn't change the game at all. But it does change the player.</p>\n<p>You can choose out of 5 characters - which all behave the same and play the same level.</p>\n<p>The only thing that changes is the player who controls the character. (And that might change the gameplay and the difficulty of the same level).</p>\n<p>The upper screen is the play former, while the lower screen shows the player playing, and what he experiences within the gaming time limit.</p>\n<p>Each of them plays on their own, but finish the level with all five characters to see how they're all connected and explore each own's story.<br/></p>\n\n<p><strong>---------------------------------------------------------------------------</strong>\n</p>\n<p><strong><em>A few more things:</em></strong></p>\n<p>*amount of time pressing jump will change the velocity of the jump.</p>\n<p>*The last level CAN BE COMPLETED. Pay attention to the dialog and be creative.</p>\n<p>Hope you enjoyed the game! If you've reached so far, I would love you to leave a feedback as I made this game completely on my own and all kind of feedback is appreciated!</p>", "metacritic": null, "released": "2022-08-28", "tba": false, "updated": "2022-09-09T17:50:56", "background_image": "https://media.rawg.io/media/screenshots/597/597d34df41e9466c289752b4373de5e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "macOS", "PC"], "developers": ["Guy Girmonsky"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}