{"id": 84784, "slug": "fantasy-jigsaw-puzzles-free", "name": "Fantasy Jigsaw Puzzles Free", "name_original": "Fantasy Jigsaw Puzzles Free", "description": "Are you a true admirer of jigsaw puzzles but tired of constantly missing pieces? We have a way out! Jigsaw puzzles fantasy is the best choice for you! <br/><br/>A wide selection of high quality pictures will bring many hours of fun to the whole family while playing fantasy jigsaw puzzles.<br/><br/>The game is so easy to play. Parts which are placed correctly will stick together. Assemble pieces into groups, then move and connect the groups. With 5 difficulty levels both children and adults will enjoy these fairy tale puzzles.<br/><br/>Fairies jigsaw puzzles are also designed for the development of fine motor skills, logical thinking, concentration, attention visual and spatial thinking. <br/><br/>What makes free dragon jigsaw puzzles special?<br/><br/>-\tRich collection of jigsaw puzzles hd will challenge your brain;<br/>-\t5 difficulty modes suit for all ages starting from easy levels for kids to really challenging modes for experts;<br/>-\tCollect free unicorn jigsaw puzzles of different sizes: 6, 24, 54, 96, 150 pieces;<br/>-\tPleasant background music contributes to the relaxing atmosphere;<br/>-\tPlay without connection to the Internet;<br/>-\tIntuitive interface and touch controls are designed to be played easy fairy jigsaw puzzles even by toddlers and preschool children;<br/>-\tThese jigsaw puzzles dragons work perfectly well both on smartphones and tablets;<br/><br/>Want more jigsaw puzzles? Check out more free themes!", "metacritic": null, "released": "2016-04-27", "tba": false, "updated": "2019-08-16T06:01:57", "background_image": "https://media.rawg.io/media/screenshots/122/122b390c858ce65456fb1da564564dd2.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gadget Software Development and Research"], "genres": ["Board Games", "Puzzle"], "publishers": ["Gadget Software Development and Research"], "esrb_rating": "Everyone 10+"}