{"id": 84783, "slug": "new-star-manager", "name": "New Star Manager", "name_original": "New Star Manager", "description": "<p>Welcome to New Star Manager: The immersive all-new game from Simon Read, creator of the BAFTA Award-winning New Star Soccer series.<br />\nTake control of New Star FC – a beleaguered soccer club which needs your management skills and instincts to unlock the team’s potential and make it to the top of the game.<br />\nThis is soccer management like you’ve never experienced it - Be more than just a player, be the head, the heart, and backbone of New Star FC. Be the Manager.<br />\nTOTAL CLUB CONTROL<br />\nTake ownership of every aspect of New Star FC, from constructing vital club facilities and managing the players’ training regimes to choosing the perfect sponsor and hiring or firing the backroom staff!<br />\nFULL SQUAD GAMEPLAY<br />\nUse every member of your team to set up and score pivotal goals with on-pitch gameplay, using innovative mouse based controls.<br />\nREAL SOCCER TACTICS<br />\nBuild your dream squad, choose your winning formation, make tactical substitutions, and even step into the locker room for some half-time motivation!<br />\nOFF-PITCH DRAMA<br />\nHandle volatile players and get their mind back in the game by monitoring their concerns, outbursts, and quirks. Keep the board off your back, navigate the hostile waters of the sporting press, and make sure the fans keep believing... while keeping a careful eye on the club’s finances!<br />\nGLOBAL FOOTBALL<br />\nDive into realistic simulations of the world’s biggest leagues and cup competitions!<br />\nTHE NEW STAR SOCCER EVOLUTION<br />\nExperience the newest instalment of the New Star series, whose pick-up-and-play sports titles have already been enjoyed by over 30 million players!</p>", "metacritic": null, "released": "2018-08-07", "tba": false, "updated": "2022-12-13T03:29:09", "background_image": "https://media.rawg.io/media/screenshots/0a5/0a55cb44c52fd38ea6b22acc56828083_BfjeW0B.jpg", "website": "http://www.newstargames.com", "rating": 0.0, "rating_top": 5, "added_by_status": {"owned": 23, "beaten": 1, "toplay": 1, "dropped": 1, "playing": 1}, "playtime": 5, "achievements_count": 151, "ratings_count": 5, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC", "iOS", "Android", "Nintendo Switch", "PlayStation 4"], "developers": ["New Star Games", "Five Aces Publishing"], "genres": ["Simulation", "Sports"], "publishers": ["Five Aces Publishing", "FiveAcesPublishing"], "esrb_rating": "Teen"}