{"id": 847953, "slug": "the-error-lactose-intolerant", "name": "The Error (Lactose intolerant)", "name_original": "The Error (Lactose intolerant)", "description": "<p>The Error is about a retired villain that wants nothing more than to live a semi-normal life, but when a bunch of new villains threaten the MC’s city, MC is dragged kicking and screaming to help save the day by the city’s hero team. Will MC be a hero for the first time? Or will MC go back to their villainous ways? Will MC be able to have a decent sleep schedule? Unfortunately for MC, that’s for you to decide! \r\n</p>\n<p>This game will feature:\r\n</p>\n<ul><li>A customizable MC from gender (whether Cis, Trans, or one that believes gender is a social construct) to if MC thinks pineapple belongs on pizza\r\n</li><li>Choices that will have consequences for every action and affect your relationships with others (sorry people pleasers, you will not be pleased)\r\n</li><li>✨Superpowers✨\r\n</li><li>The ability to influence your very own sidekick and influence your team dynamic\r\n</li><li>Romance options that include 7 main options and possibly secret options   \r\n</li></ul>\n\n<ul><li> Sawyer (he/him); Sawyer is a the previous police chief of the NYPD and has arrested MC plenty of times. He now is the commissioner of the NY Hero Team and is absolutely desperate to take down the newest villains, so he recruits (read as kidnaps) a retired villain in hopes of finally being able to take down the new villains. Will MC be able to change his mind about them? Can there be love or friendship between these two enemies?\r\n</li><li>Jordan (gender selectable); Jordan is apart of the NY Hero Team and is known as the Pied Piper for their ability of being able to convince people to do as they say. They are known to be easy going and aloof. But hearing that an ex-villain will be joining the team, now that has their attention. How will MC react to their attention? Is this just another fling for Jordan or will MC be able to retain Jordan’s attention?\r\n</li><li>Rory (they/them); Rory is apart of the NY Hero Team and is known as Guard for their force fields. They are known for being a ray of sunshine to everyone and everyone loves them! Hearing that a villain is joining the team, Rory has set out to change MC’s ways to the more heroic sort. With so much competition for Rory’s heart, will MC be able to win? Will Rory let go of trying to change MC and love them for them?\r\n</li><li>Quinn (gender selectable); Quinn is apart of the NY Hero Team and is known as Obscure for their power of manipulating shadows. They know about the MC being a villain, but they don’t really care or do they? It’s just so hard to tell with Quinn being so shy. Will MC be able to convince Quinn to lower their guard? Will Quinn ever be able to express themselves? \r\n</li><li>Hayden (she/her); Hayden is apart of the NY Hero Team and is known as Cicatrize for her powers of healing.As the resident healer for the team, Hayden knows to treat everyone the same and tend to their injuries with care, but knowing that the MC is a villain leaves Hayden feeling uneasy. Will Hayden get over MC’s past? Will MC be able to gain Hayden’s trust and potentially her love?\r\n</li><li>Rowan (he/him); Rowan is apart of the NY Hero Team and is known as Glitch for his teleportation power. Being team leader is hard enough but having to babysit a new teammate that happens to be a villain is impossible. Rowan wants nothing more than MC to stay quiet and on the sidelines. Will MC be able to prove their self to him? Will he get it through his thick head that MC could be into him?\r\n</li><li>Kai (gender selectable); Kai is the MC’s childhood lover/friend/enemy (depending on your choice) and is a part of the new villain league. They are known as Drifter because of their power of super speed. Kai and MC have not spoken since MC quit being a villain. But that doesn’t mean they haven’t been keeping tabs on MC. Will MC and Kai ever rekindle what they once had or will they start something new?\r\n</li></ul>", "metacritic": null, "released": "2022-09-08", "tba": false, "updated": "2022-09-09T18:43:06", "background_image": "https://media.rawg.io/media/screenshots/d08/d0857e714258ba7241ca5d80bce670a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lactose intolerant"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}