{"id": 84801, "slug": "talking-yoohoo", "name": "Talking YooHoo", "name_original": "Talking YooHoo", "description": "Meet YooHoo, a brave and adorable bushbaby that will trap you with his tenderness from the very first moment!<br/><br/>YooHoo loves to play and he is waiting for you to be his opponent. Join in the fun!<br/><br/>★ ★ ★ TALKING YOOHOO is not just a normal talking, he has so much more for you to discover! He repeats your voice, plays the xylophone in his own cute little way and if you dare to take on this little guy, he will challenge you to games of cards or puzzles. Also, meet his cool friends and see their adventures or send personalized messages to your own friends!★ ★ ★<br/><br/>★ ★ ★ EXPLORE EVERYTHING TALKING YOOHOO CAN DO ★ ★ ★<br/>*He will repeat everything you say with his sweet voice.<br/>*Tickle him until he can’t stop laughing.<br/>*Make him jump off the trunk by touching his feet. <br/>*Bug him by poking him in the eyes. <br/>*Play his awesome minigames and put your memory to the test!<br/>*Learn to play his colorful xylophone.<br/>*Share videos and pictures with your friends!<br/><br/>AND MORE...<br/><br/>TALKING YOOHOO HAS TWO MINIGAMES SO YOU CAN HAVE DOUBLE THE FUN!<br/><br/>Interact with this entertaining animal:<br/><br/>*Talk and he will repeat whatever you say. Try and to sing to him and see if he can impress you back. <br/>*Tickle him to enjoy his funny reactions and sounds. You will enjoy it as much as him!<br/>*When you poke his feet he will jump around. <br/>*Check out how he moves his tail when he spins.<br/><br/>YooHoo plays his colorful xylophone as well:<br/><br/>*Play a high quality and nice instrument as the xylophone.<br/>*You can learn how to play with him and play your own songs or let him play his music and then you can repeat it!  <br/><br/>Have loads of fun with his two minigames:<br/><br/>*With his memory game you will be challenged for hours! Will you be able to remember the pairs? Try it yourself!<br/>*Try to complete his fascinating jigsaw and find out what it turns out to be! <br/><br/>Share what you do in TALKING YOOHOO with your friends:<br/><br/>*Send a message to your friends and let them meet this charming animal. Introduce them also to his adventurous friends with the different images that you have to choose with your personal message! They make the perfect crew!<br/>*Record a video of what you’re doing and share it with your friends or upload it directly to the internet!<br/><br/>★ ★ ★ IMPORTANT NOTE FOR USERS ★ ★ ★<br/>Your iPod Touch, iPhone or iPad must have a microphone or headphones (with an attached microphone). Otherwise, the voice-recording features will not work.", "metacritic": null, "released": "2012-06-10", "tba": false, "updated": "2019-07-15T03:15:01", "background_image": "https://media.rawg.io/media/screenshots/8fc/8fc2ebfd7243731efb14331575d2b6ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Talking Toys"], "genres": ["Family"], "publishers": ["Talking Toys"], "esrb_rating": null}