{"id": 84810, "slug": "talking-arnold-the-elf", "name": "Talking Arnold the Elf", "name_original": "Talking Arnold the Elf", "description": "A new friend has just arrived to Talking Toys…Talking Arnold! Arnold is a naughty little Elf who wants to make you laugh this Christmas.<br/><br/>Arnold lives in the forests of the North Pole and helps Santa Claus make toys. This jolly-faced Elf loves playing with children; he’ll even let you pull his ears and cheeks! He also loves to be tickled ... but be careful because snot shoots out of his nose if he laughs too hard! And don’t miss the curious Christmas carol Arnold sings if you poke him all over!<br/><br/>DISCOVER ALL THE SURPRISES THAT ARE WAITING FOR YOU!<br/>Surprise your friends by sending a fun holiday greeting video! It’s easy and you can add a photo of your face or theirs from the photos in your library or directly from the ones you’ve uploaded to Facebook. You can also add your own personal message!<br/><br/>WHAT YOU CAN DO WITH TALKING ARNOLD THE ELF<br/>- He repeats what you say!<br/>- Add a photo of your friend’s face and send a personalized Christmas video.<br/>- Discover Talking Arnold’s funniest animations!<br/>- Poke him and listen to his surprising carol!<br/>- Meet Arnold’s good friend the Gingerbread Man.<br/>- Send personalized  messages to your friends!<br/><br/>IMPORTANT NOTE FOR USERS<br/>Your iPod Touch, iPhone, or iPad must have a microphone or headset. If not, Arnold won’t be able to repeat what you say.", "metacritic": null, "released": "2012-11-29", "tba": false, "updated": "2019-07-15T03:16:03", "background_image": "https://media.rawg.io/media/screenshots/ad1/ad1acd83f192b483f128efe8e4410b17.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Talking Toys"], "genres": ["Family"], "publishers": ["Talking Toys"], "esrb_rating": null}