{"id": 848281, "slug": "imperial-war", "name": "Imperial War", "name_original": "Imperial War", "description": "<p>Imperial War:\r\n  </p>\n<p>DE 4 A 6 JUGADORES\r\n  </p>\n<p>REGLAS:\r\n  </p>\n<p>Cada jugador tira un dado, el de mayor número es el primero en comenzar su turno, al finalizar la ronda, el primero en comenzar la siguiente, será el jugador a la izquierda del mismo.\r\n  </p>\n<p>Cada jugador decide en que continente del mapa quiere empezar y se le otorga un total de 15 fichas para poner en cada territorio del mismo. (Mínimo de 5 fichas).\r\n  </p>\n<p> Al final de cada ronda se les otorgara a los jugadores una cierta cantidad de fichas dependiendo de cuantos territorios tenga en el momento hasta un máximo de 25 fichas.   </p>\n<p>REGLAS DE COMBATE:\r\n  </p>\n<p>Para poder realizar un ataque el jugador debe estar pegado o debe tener un camino hacia el territorio enemigo.\r\n  </p>\n<p>Para poder atacar un continente enemigo se debe tener 2 o más fichas en el territorio actual que posee ya que una deberán permanecer en el sitio.   </p>\n<p>Los ataques se decidirán con un dado. El que haya obtenido menor número perderá una ficha;  si el atacante deja al contrincante sin ficha en ese territorio, el mismo lo ganara y ocupara el territorio.   </p>\n<p>En caso de empate se vuelve a lanzar los dados.   </p>\n<p>Al finalizar todos sus ataques puede reagrupar sus fichas como encuentre más oportuno.\r\n  </p>\n<p>Al finalizar la ronda, es decir, todos los turnos de los jugadores mismos, deberán tirar un dado, y al de menor número, le tocara levantar una carta del mago.\r\n  </p>\n<p>¿Que se necesita para jugar?\r\n  </p>\n<ul><li>Botones, ya sean de costura o los que más le guste, pero de distintos colores.\r\n  </li></ul>\n<p> \r\n  </p>\n<p>CARTAS DEL MAGO:\r\n  </p>\n<ul><li>El mago ha propagado una plaga en vuestra población y usted tiene que tomar medidas para curarla. El jugador que lea esto perderá este turno.\r\n  </li><li>El mago le ha ofrecido a usted un trato, en el cual señala que si le otorga 5 fichas del territorio que más le plazca a su favor, nublara el juicio del jugador a la izquierda suya, y perderá el turno. Puede aceptarlo o rechazar esta propuesta.\r\n  </li><li>El mago le ha hecho caer enfermo y le obliga a usted a que renuncie a uno de sus territorios al jugador que se encuentra a la derecha, siendo el más cercano al continente del mismo. Se le regala una ficha para poner en el mismo.\r\n  </li><li>El mago está agradecido con vuestra bondad y gratitud, le recompensa sus buenos actos, otorgándole 3 fichas de ejército.\r\n  </li><li>El jugador que haya agarrado esta carta tiene la elección del mago, debe elegir un número y junto con el resto de jugadores, tirar el dado para ver si sale dicho. El que consiga obtener ese número se salvara de perder 4 fichas.\r\n</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-09T20:53:06", "background_image": "https://media.rawg.io/media/screenshots/25e/25efb2068bfa5dac162d78c990ff44b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rex160"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}