{"id": 848291, "slug": "fate-of-an-empire-age-of-war-premium", "name": "Fate of an Empire - Age of War (Premium)", "name_original": "Fate of an Empire - Age of War (Premium)", "description": "<p><strong>Fate of an Empire - Age of war</strong> is a deep and compelling turn based 4x strategy game with a map editor, detailed empire management, custom troop designs, advanced combat between massive armies and a well-developed technology tree. You have unlimited possibilities to create the empire of your dreams!</p>\n<p>\n</p>\n<p><em>Build your own fantasy world and create your own fortune in this 4x fantasy strategy game!</em></p>\r\nAre you prepared to take control of your own fate?\r\n<p>The world of <strong>Fate of an Empire - Age of War</strong> consists of two unique levels: the <strong>Surface</strong> and the <strong>Netherworld</strong>. You are invited to roam the wild forests as the secretive <strong><em>Elves</em></strong> or dominate the green plains as the unpredictable <strong><em>Humans</em></strong>. Inhabit the huge underworld caves of the Netherworld and take control of the rampaging <strong><em>Greenskins</em></strong>, the swarming <strong><em>Krant</em></strong> or the feared and hated unliving <strong><em>Ende</em></strong>. If you can't choose, play as the rich <strong><em>Dwarves</em></strong> which fear neither the open sky nor the darkness below.</p>\r\nSelect your strategy\r\n<p>\n</p>\n<p><strong>Fate of an Empire - Age of War</strong> allows you to create and manage your own empire. Decide which race to play and what beliefs to follow and create your own story. What strategy to pursue, what your civilization will look like, what kind of troops will defend your borders - all this and more is up to you to decide. Unless your neighbours make the decision for you...</p>\n<p>\n</p>\n<p><em>The story that started in Fate of an Empire - 4x strategy continues in Fate of an Empire - Age of War!</em></p>\r\nMain features in Fate of an Empire - Age of War:\r\n<ul><li>Six unique races with different playing styles and challenges.</li><li>Hundreds of technologies to research.</li><li>A world with two unique levels, connected by cave openings. Play on random maps, or make your own maps in the map editor.</li><li>Design your own troop types in the Barracks.</li><li>You decide if a city is a garrison or a trade city, or why not aim for a megapolis?</li><li>All data lists can be modded for you to create your own unique experience.</li></ul>\r\nSupports both portrait and landscape mode\r\n<p>Portrait mode works best on phones while landscape mode are optimised for tablets.</p>\r\nFate of an Empire - Age of war community\r\n<p>•  Please join the friendly community at Discord and chat with other fans of Fate of an Empire: https://discord.gg/PuezA4V4PN</p>", "metacritic": null, "released": "2022-08-25", "tba": false, "updated": "2022-09-09T20:59:46", "background_image": "https://media.rawg.io/media/screenshots/685/685b5e1f4003b9ba160edde6351606e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Rising Empires"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}