{"id": 8484, "slug": "space-simulator", "name": "Space Simulator", "name_original": "Space Simulator", "description": "Space Simulator is a realistic space flight simulator game featuring high-quality models, hi-res textures, IBL shaders, and a full-scale Solar System running on a purpose-built (doublefloat precision) physics library to create a better, faster and more realistic space flight simulator.<br/><br/>Thanks to the dynamic loading textures and multi-threaded physics running on GPU cores, the game reaches at 50-60 fps on most PCs with modest RAM requirements.<br/><br/>We are also implementing VR support for a fully immersive flight experience as well as support for all major joysticks and flight controllers.<br/><br/>We intend to release the game for an introductory price a limited time while on early access.<br/><br/><br/>CONTENT<br/><br/>Space Simulator features a mix of hi-quality Steam specific missions ,while also having a legacy mode with all the missions ,models, etc of the mobile version , for the convenience of our  current mobile version users.<br/><br/><strong>Steam Specific Missions</strong>:  (Early Access ) : Chapter 1: The Apollo Days . Featuring a growing number incredible detailed and realistic Apollo Program's missions , starting -at launch date - with Apollo 8  Lunar orbit missions.  On successive months ,we will finish including all relevant missions in the Apollo Program.<br/><br/><br/><br/><br/>Besides, we include all the content , missions ,etc.. of the tablet' version, such as <br/><br/>• Project Apollo<br/><br/>Space Simulator features the complete Apollo 11 program missions. Players can choose to play particular missions or the entire Apollo 11 program from beginning to end: launch the Saturn V from Cape Kennedy; perform Trans-Lunar Injection, transposition rotation and docking; land on the Moon; power through the lunar ascent and rendezvous; and finally return back to Earth with reentry and splashdown.<br/><br/>• Space Transportation System<br/><br/>Space Shuttle fans can also enjoy a wide selection of Space Shuttle missions: launch from Cape Kennedy; rendezvous and dock with the International Space Station; return to Earth with reentry and play the final landing in day and night scenarios.<br/><br/>• Space Launch System<br/><br/>Space Simulator also includes a number of contemporary Spacecrafts, such as the SLS ( Orion ) .We also plan to include SpaceX's vehicles in the near future.<br/><br/>• Custom Free Roam Missions<br/>Space Simulator is a realistic simulator of the entire Solar System with all its planets and major moons. Players can also choose to play custom free roam scenarios with general purpose spaceships.<br/><br/>• Full sized Solar System<br/><br/>• n-body physics solver with numeric trajectory predictor allowing the user to perform complex orbital maneuvers, eg, orbital slingshots, etc.<br/><br/><br/>GAMEPLAY<br/><br/>All spacecraft cockpits will come with interactive multi-functional displays that provide information on every aspect of your flight data. We have orbit, surface, transfer, docking, flight, HSI and other display panels.<br/><br/>For Apollo enthusiasts, we have fully emulated the Apollo Guidance Computer and DSKY running actual code from the 60’s. You can run and control the Apollo spacecrafts exactly as how the astronauts did during their flight.<br/><br/><br/>Ultimately, our aim is to create a realistic space simulator that is comprehensive yet easy to use and accessible to players at all levels with the most advanced graphics and rendering techniques. The game also features interactive in-game tutorials which guide you step-by-step through each mission right down to selecting the right buttons and switches in a 3D interactive virtual cockpit.<br/><br/><br/>REALISM<br/><br/>The simulation uses a proprietary double precision physics library, running on GPU cores allowing the game to compute all the gravitational forces, including moons and distant celestial bodies, generate orbit instabilities, resonances, etc. with the utmost accuracy. The physics solver computes and predicts real n-body trajectories that vary in real time, no longer relying on patched conics or other simplifications. This allows -for the first time- the player to design and fine-tune very complicated orbital maneuvers.<br/><br/><br/>All planets in the game are modeled with hi-res NASA imagery. Selected planets such as the Earth, Moon and Mars have 3D surfaces modeled from NASA altitude data. We try to use original audio as much as possible for Apollo and Space Shuttle missions.<br/><br/><br/>SUMMARY<br/><br/>Lift-off from the Kennedy Space Center; land on the Moon; enjoy the magnificent views of Earth from orbit; plan a trip to a faraway planet; practise your favorite orbital maneuvers ­doing gravitational slingshots, Hohmann transfer orbits; rendezvous and dock with the ISS; perfect your Space Shuttle landings or go to the edge of space and back with the hypersonic X-­15 space plane. The possibilities are endless and as unbounded as your wildest astronautic dreams!", "metacritic": null, "released": "2015-03-04", "tba": false, "updated": "2022-07-24T12:36:02", "background_image": "https://media.rawg.io/media/screenshots/ced/ced68c175cfc2f9b385ff12b307db51a.jpeg", "website": "http://www.space-simulator.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "Android", "iOS"], "developers": ["Stuka Games", "Brixton Dynamics"], "genres": ["Simulation", "Educational"], "publishers": ["Brixton Dynamics"], "esrb_rating": null}