{"id": 848536, "slug": "juggler-denoide", "name": "Juggler (denoide)", "name_original": "Juggler (denoide)", "description": "<p>Test yourself in this game of skill based on real jugglers and pong!<br/><br/>Compete with your friends and yourself for the highest score in multiple stages in which you have to always catch the ball before it goes out of the ring!<br/><br/>ORIGINAL CONCEPT!<br/><br/>Juggler put you in charge of 4 bar controlled by the sliding of your thumb, based on the direction you slide your thumb, all 4 bar rotate in a specific direction, you have to catch all the ball(s) using only these bars and figuring out the peculiarity of each stage!<br/><br/>MULTIPLE GAME TYPES<br/><br/>Test yourself in 3 (for the moment) stages that require you to catch the ball(s) with different obstacles and concepts to handle during the gameplay!<br/><br/>INFINITE RUN<br/><br/>Each stage is randomly selected at the end of each stage, for a high score, you need to master each level and be prepared for every successions of stage ! Are you prepared for that?<br/><br/>8 BIT LIKE GRAPHICS<br/><br/>Designed to be a tribute to classic Games like Pong, Breakout and other 70s/80s classic games, all the graphics was designed by hand to be an expressive tribute to the classic as well as functional!<br/><br/>ORIGINAL SOUNDTRACK COMPOSED FOR THE GAME!<br/><br/>Each sound featured in the game has been created only for this one to be a tribute to old arcade games! Square Wave Synth with modern sound here we go!<br/><br/>CHECK YOUR HIGH SCORE AND CHALLENGE YOUR FRIENDS!<br/><br/>At the end of each game, the score totalized is saved and you can see that on the dedicated page, the last 4 score are also saved in order to let you understand if there are some improvements!</p>", "metacritic": null, "released": "2022-09-06", "tba": false, "updated": "2022-09-09T22:36:40", "background_image": "https://media.rawg.io/media/screenshots/1c0/1c02004f78cef31df6cbb427cddbd6f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["denoide"], "genres": [], "publishers": [], "esrb_rating": null}