{"id": 848535, "slug": "tower-defender-vr-hero-wars", "name": "Tower Defender VR: Hero Wars", "name_original": "Tower Defender VR: Hero Wars", "description": "Join our discord to win Free Game :D\r\n👉 Discord Giveaway\r\n<p>Fight and defend your tower as the head of an army!</p>\n<p>Join this battle of wit! Enemy troops have arrived at the gate of your hold that might fall into pieces at any moment. You can smell fear on the ramparts. One wrong move and defeat is nigh. Block and occupy enemy towers while strengthening your own, then you shall have an epic victory. Look, your flags are flying in every corner. Congratulations! You are an excellent strategist.\r\n</p>\r\nKEY FEATURES\r\n<p>⚔️ The battlefield is within your grasp. Think strategically to attack and expand your territory!\r\n</p>\n<p>⚔️ Two gameplay modes: Roguelike and Endless Levels\r\n</p>\n<p>⚔️ Experience the changing scenes: Forest, Snowland, Desert, and Cemetry\r\n</p>\n<p>⚔️ 5-level Boss mechanism: Every time you complete 4 levels, you get a Boss level. Defeat him and carry on your journey!\r\n</p>\n<p>⚔️ Battle Experience: Your soldiers and towers will gradually become more powerful as you defeat more enemies and complete more levels\r\n</p>\n<p>⚔️ Scenes change following time in the real world\r\n</p>\n<p>⚔️ Our adorable animals will cheer you up in various cute ways\r\n</p>\n<p>Good Luck!\r\n</p>", "metacritic": null, "released": "2022-08-18", "tba": false, "updated": "2022-09-09T22:36:24", "background_image": "https://media.rawg.io/media/screenshots/292/2924c8dc7e432529050dfc48d60606e1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Suplife Games"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}