{"id": 848784, "slug": "borg-ball", "name": "Borg Ball", "name_original": "Borg Ball", "description": "<p>In this space sport game you pilot your Borg cube and must capture the asteroid using your powerful tractor-beam then launch it at the opposing teams planet which has totally been evacuated before the game.<br/></p>\n<p>There are two teams Blue which is played by cube ships and Red which is played by sphere ships.<br/>Joining players are automatically added evenly to each team. The goals/planets are color coded so you just need to launch it at the opposing color.<br/>Your team color can also be determined from the look of the game, it changes between the team colors.<br/>Players can attract the ball when within about 100m using the LMB and Left Shift to boost the attraction power, this also breaks the lock other players in range have on the ball.</p>\n<p>The game was made in two days by me and some friends using Unity 2021 and Photon Fusion for networking. It supports up to 6 players per match.</p>\n<p>Platform: Windows 8/10/11 64bit</p>\n<p>Unsure about minimum performance requirements, but it should run on almost anything since 2012.</p>\n<p>Keys and Controls<br/></p>\n<p>All keys are also visible in the in-game UI.</p>\n<p>Alt+Return/Enter to enter exit fullscreen window mode.<br/>Enter a session name and hit the \"Host or Join button\" to start the game.<br/>Other players entering the same name will join the same game.</p>\n<p>W = Forward Thrust<br/>S = Backward Thrust<br/>A/D = Roll<br/>Mouse movement = Pitch/Yaw<br/>Space = Forward Thrust Boost<br/>LMB = Pull the ball when within 100m<br/>RMB = Shoot the ball<br/>Left Shift = Ball Pull Power boost</p>", "metacritic": null, "released": "2022-09-06", "tba": false, "updated": "2022-09-10T00:18:32", "background_image": "https://media.rawg.io/media/screenshots/484/484d29ff150a826372d65e4457a3ae03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mikkel A"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}