{"id": 848975, "slug": "cinis", "name": "CINIS", "name_original": "CINIS", "description": "<p>Story and Gameplay:<br/></p>\n<p><strong>The universe is broken. You are trying to fix it...</strong>\n</p>\n<p><strong>CINIS </strong>is an in-development Rogue-lite First Person Shooter where the player teleports between randomly selected levels to gain weapons and survive.</p>\n<br/>\r\nWeapons and Enemies:\r\n<p>The weapon arsenal is wide and varied, ranging from small-caliber pistols to large Double-Barreled Rocket Launchers and Quad-Barreled Nail guns.</p>\n\n<p>Enemies range from the fast and sturdy Knight, to the weak but unkillable Zombies. Use the varied arsenal to gain an advantage over the enemies for a chance to survive and get to the next Rift.</p>\n<p>Explosive weapons can even be used to gain an advantage in movement...</p>\n\n<p>Whether you decide to play the game or not, I appreciate you checking out the page. Thanks!</p>\r\nMinimum specs*\r\n<strong>Graphics card:</strong>AMD RX480 8gb** / Nvidia GTX 970<strong>CPU:</strong>Intel core i5 6600 3.30GHz, or equivalent<strong>Memory:</strong>8gb DDR4<strong>Storage:</strong>~1gb required. (SSD storage preferred for speed)\r\n<p>*The minimum specs represent the lowest hardware tested, and may not be 100% representative of actual min. specs.<br/></p>\n<p>**The game does work on this card, however with lowered graphics settings. Crashing has been found to happen with this card, in specific cases, and may be too slow to be fully recommended.</p>", "metacritic": null, "released": "2022-09-05", "tba": false, "updated": "2022-09-10T01:38:10", "background_image": "https://media.rawg.io/media/screenshots/0fc/0fc4ab70759eabcc5a943243b3f72257.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alexander Lind"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}