{"id": 84909, "slug": "unicorn-candy-maker", "name": "Unicorn Candy Maker", "name_original": "Unicorn Candy Maker", "description": "Hey Kids are you starving? How about eating some thing yummy &amp; trendy baked in kitchen? If you want to eat trendy Unicorn food than wait no more, since fast food fever is back especially for the home crazy cooking chef because we bring a world of flavor into your life with Unicorn Candy Maker Game. Make your own dream unicorn food in kitchen and make this a mouth-watering experience with Unicorn Candy Maker Game. Unleash your creativity, choose from a huge selection of ingredients and make the kind of delicious food you like in the kitchen. The Unicorn Candy Maker Kitchen is full of surprises! Grab a snack or dessert, and cook up your favorite food in the kitchen! So Wear apron and get ready to cook some awesome foods in this candy maker cooking game. Experience the true maker &amp; baker environment with real chef.<br/><br/>Unicorn Candy Maker cooking mania games for girls gives chance to become a professional chef and create a perfect, yummy &amp; tasty rainbow colored unicorn-themed food each and every time. Start your day in the kitchen where all food ingredients are placed on the shelf for crazy cooking mania &amp; baking. Experience the true Unicorn Candy Maker environment with real chef. Candy apple, also known as toffee apple is whole apple covered in a hard toffee or sugar coating, with a stick inserted as a handle. Select your favourite apple candy recipe. Add sugar, water, milk and other ingredients to make a mixture. Now crisp the candy over an apple. Dip the selected fruit into the candy mixture. When you have done with your unique dessert, decorate it with chocolate and colorful toppings. Candy apple and caramel apple may seem similar. Make a yummy apple candy and decorate it with a large collection of decorative items. Be sure to let the apple dry. And when you’re ready, take a big bite of your own creation &amp; do remember to share sweet in your Unicorn Candy Maker Game.<br/><br/>Features:<br/>- A super fun food-making game.<br/>- No wifi Required to play this maker game.<br/>- Learn how to bake the most delicious unicorn themed food ever!<br/>- Pour, stir, blend, freeze, and eat your sweets.<br/>- Simple step-by-step instructions to be the best candy maker in the cooking world.<br/>- Tons of mouth-watering unicorn food recipes.<br/>- Combine food coloring, ingredients, sprinkles and decorations for endless customization possibilities.<br/>- Make Caramel, Chocolate, Candy Apple Red, or Candy Apple Green with different exciting recipes.", "metacritic": null, "released": "2018-07-27", "tba": false, "updated": "2019-10-22T14:22:18", "background_image": "https://media.rawg.io/media/screenshots/d06/d0677e52340d7a1fd0186500253cb757_8GL6DRR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Simulation", "Family"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Everyone 10+"}