{"id": 849190, "slug": "rider-of-the-crimson-dragon", "name": "Rider of the Crimson Dragon", "name_original": "Rider of the Crimson Dragon", "description": "Description\r\n<p>The story is not based on drama and conflict, but loaded with a deep understanding of the human and beyond and hints at transformative choices in life.</p>\n<p>This second book in the series brings more pieces to the puzzle, to  connect already-placed pieces scattered on the table-top we call ‘the  human experience’.  </p>\n<p>When the Christ Consciousness was prepared around 630BC, a celestial  order of teachers and supporters named The Crimson Council was formed.  In parallel, a human group got together on Earth and the colour crimson  was used to identify individuals in the Crimson Circle. Over the years,  the collective consciousness of this group has become an entity of its  own and may be perceived as a crimson dragon named Shaumbra!  </p>\n<p>Luzi works with two students to discover true historical events and  meet this crimson dragon. It turns out that Shaumbra has quite a  personality and, together with the white dragon, Loong, the Elven woman,  Josela, Quan Yen, Gaya, Merlin, Nikola Tesla, Saint Germain and others,  they gain information from the past and future. What they find is not  commonly accepted, but it fits with hidden and not-so-hidden knowledge  dismissed by established society. Luzi’s unborn daughter brings light  into everyone’s hearts and plays a major role in balancing a broken  family. All end up having a different view on life.</p>\n\n<p>There are five novels in the series. The first novel is \"Name your own price\", and acts as a demo:<br/></p>\n\r\nInfo\r\n<p>\r\nThe novel has 156 graphical elements and contains over 56,000 words. 22 illustrated beings. Default to 1920x1080.<br/></p>\n\r\nReviews\r\n<p><strong>Master story teller</strong></p>\n<p>I just finished reading the Kindle version of The Adventures of Luzi Cane, Book 2. The author is indeed a master story teller! While including delightful experiences and awareness of elves and dragons, she weaves in incredible wisdom, clarity, and light about our journey to remember who we are and why we’re here.\r\n  </p>\n<p>I absolutely love the development of the characters in the story. Luzi and her daughter Julia (even before her birth) are so real and vibrant and full of wonderful wisdom and love!\r\n  </p>\n<p>I am an avid reader, and when I wake up the day after finishing a book, wondering what the characters are up to today, I know the book is an extraordinary creation!\r\n  </p>\n<p>If you ever find yourself wondering about the “big” questions about how to realize who you are and how to experience your life to the fullest, I heartedly recommend reading The Adventures of Luzi Cane!\r\n  </p>\n<p><em> - Patricia M. Severance<br/><br/></em></p>\n<p><strong>A book filled with wisdom about many existential questions</strong>\n</p>\n<p>Luzi interacts in several dimensions. She is brilliant in balancing a life with a quite ordinary family with its challenges AND a spiritual path. She talks with fairies, ascended masters, Tesla and a dragon among others. Luzi is an inspiration for others in an awakening/ realization proses AND a regular human life. Thrilling and exiting.\r\n  </p>\n<p> - <em>Kristin</em>, July 2, 2019, Amazon - Kindle Edition.\r\n  </p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-10T03:03:37", "background_image": "https://media.rawg.io/media/screenshots/33d/33d1c95e320569f545f6dfe114578f8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Eriqa-Queen"], "genres": [], "publishers": [], "esrb_rating": null}