{"id": 849361, "slug": "flower-banquet-the-demo", "name": "Flower Banquet: The Demo", "name_original": "Flower Banquet: The Demo", "description": "<p>Grace Is a young girl with memory loss due to trauma she had experienced in her life. Grace has always wanted one thing in her life and that is be accepted and loved by those around her. After some time her mother gives her up to a local church where she meets a nun named Primrose.  A nun too happy under these circumstances. <br/><br/></p>\n<p>Grace discovers the mysterious around a well where a Student went missing. After trying to investigate it she falls and discovers that hell has always been a few steps away. <br/></p>\n<p>Join Grace in the story of discovering herself and her attempts to accept this hellish world she ended up in. </p>\n\n<p>Attention game is currently available to explore(beta). The future there will be a more updated and “game” style version. Please stay alert for this. This piece had several major scenes cut out. Flower Banquet was first created back in 2019 but the original files and coding was lost in a accident. Flower Banquet was done around February of this year but the demo wasn't published until May. <br/><br/></p>\n<p>Flower Banquet represents finding your true self and picking what brings you happiness even if it means going against all odds. Flower Banquet <strong>is written and directed by one person. </strong> Apologizes in advance for grammar errors. English isn’t my native language but I wanted to present a game in that language and show my skills around English. </p>\n<p>Please keep in mind this is a very small demo. A full version will be released shortly. <br/></p>\n<p><strong>How to download/play</strong>\n</p>\n<p><strong>You need the kocho application to access the game. Kocho is a free visual novel application that allows you to create visual novels for newbies. Once you download the file (you can play mobile) you go to library , click the plus, upload the file. </strong>\n</p>", "metacritic": null, "released": "2022-08-23", "tba": false, "updated": "2022-09-10T04:05:06", "background_image": "https://media.rawg.io/media/screenshots/718/718cf5e95faf981a78420d36c31caa4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sakana"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}