{"id": 849345, "slug": "wahid-tish", "name": "Wahid Tish", "name_original": "Wahid Tish", "description": "<p>“It’s not the team with the best players that wins. It’s the players with the best team that wins!”</p>\n<p>Sports have been engraved for centuries in human history. The idea of gathering large audiences rooting for the challenge and reaching goals is part of sports. Only that, but such gatherings enhance the essence of togetherness within communities and allow the introduction to one another’s culture. Believe it or not that lively excitement you felt as a child playing hide and seek is part of what sports can be. <br/></p>\n<p>Imagine that game set in a different era like the 80s in an old Saudi neighborhood, not only that, but you have a paintball in your hand to find the invisible hiders. That is what our game is all about. It’s suitable for all ages 7+, low complexity game, and the colors are appealing and stress-free. Part of our violence-free brand it’s a multiplayer, local game meaning you wouldn't worry about the children diving into the dangers of online 3rd party interference. Also, the whole cultural aesthetic would appeal to the local community and allow the older audience to initiate convos with the younger audience about reminiscing about what they lived. <br/></p>\n<p>To start playing, press play then press a button on a controller to spawn a character.</p>\n<p>Made with love by:<br/></p>\n<p>Bayt Setto Team\r\n<br/>Gameathon - Gaming in Sports Track #10 <br/></p>\n<p>Team members:<br/>Ahmed Jamalallail<br/>Anas Bakhsh<br/>Atheer Alayzari<br/>Haifa Bishr<br/>Maha Alsharif\r\n<br/>Maryam Alnahdi\r\n<br/>Munirah Almujale\r\n<br/>Norah Alshukr\r\n<br/>Nujoud Alshammari<br/>Raghad Zarei\r\n</p>", "metacritic": null, "released": "2022-08-24", "tba": false, "updated": "2022-09-10T03:58:54", "background_image": "https://media.rawg.io/media/screenshots/421/421a0d04c21191d33d4cd14bbd9bef73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Djinn247"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}