{"id": 849461, "slug": "the-original-island", "name": "The Original Island", "name_original": "The Original Island", "description": "<strong>1, About the game </strong>[/]<br/><br/>The Original Island is an open-world Island survival role-playing game about an adventure on an Island in The ocean. You will play as a survivor who has been taken to this isolated island for unknown reasons but has lost some of his memories. Explore the lush jungle-covered island in search of secrets hidden deep in the forest. It's trying to survive, making tools, hunting, fighting, whatever it takes to get out of here. Or through the jungle, searching for the truth, collecting legends, and finding out why and why you came to this island. Whether it's conquering nature, or forcing oneself to adapt to the natural environment, everything will follow the choice of the survivor.<strong>2, Exploring jungle and Ancient ruins </strong>[/]<br/><br/>This densely jungle-covered island is littered with ancient ruins, and no one knows when, who or why they were built. Ancient buildings, mysterious altars, strange stone statues, extraordinary phenomena, waiting to be revealed by the survivors.<br/><strong>3, Making weapons and survival tools </strong>[/]<br/><br/>To survive on this isolated island, the survivors must learn to make enough supplies. Weapons for hunting, medicines for unusual conditions, tools to store water, backpacks for lifting heavy loads, fishing and trapping traps, etc., can greatly improve the chances of survival. Of course, only a small part of how items and weapons are made will be mastered from the beginning. Most of the items require the player to try them out, or explore the island in search of drawings left behind by past survivors.<strong>4, You can't live without fighting </strong>[/]<br/><br/>Whether it's hunting for food, or dealing with a terrifying figure walking through the jungle, you have to take up arms to deal with the situation. If you want to survive, you must have the will to take up arms and destroy the enemy. Even though it may be a monster that you don't even know exists......<strong>5, Shoot beautiful scenery </strong>[/]<br/><br/>Despite the fact that survivors are plagued by problems every day, hunger, exhaustion, and even assault. But when survivors go where they've never gone before, and reach the top of a mountain high enough to look out over the jungle, they see something different. You can use your own mobile phone camera function to leave the most beautiful scenery in your heart. This is the prize of a survivor's conquest of nature.<strong>6, Changeable island weather </strong>[/]<br/><br/><br/><br/>The island seemed so unusual that it was difficult for survivors to identify their position by the climate and the stars. Sometimes it is a scorching sunny day, sometimes it is a raging tropical storm, and sometimes it is a cold, flying snow covering the island. Even the island seemed to fall silent under a thick fog.<strong>7, Collection of literature on scattered islands </strong>[/]<br/><br/><br/><br/>You're not the first person to set foot in this isolated place. It seems there are many like you who have been called to these waters by something. To understand their story, we must collect their journals, which are scattered all over the island, and through the writings they left behind, we can reveal some of the hidden secrets of the island. By retracing their steps to their final destination.", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-12T04:15:08", "background_image": "https://media.rawg.io/media/screenshots/c79/c79770f45466587f22ee8342144aaa29.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["泉州市兰梦网络科技中心（有限合伙）"], "genres": ["Action", "Adventure", "RPG"], "publishers": ["泉州市兰梦网络科技中心（有限合伙）"], "esrb_rating": null}