{"id": 849464, "slug": "betrayal-at-club-low", "name": "Betrayal At Club Low", "name_original": "Betrayal At Club Low", "description": "Tonight you’re on a surprise mission at the inimitable Club Low.  This former coffin factory-turned-nightclub has, for years, been a beacon of nocturnal energy, a haven for wild-limbed dancing, mind-altering music and shady characters aplenty.  It's also a place to prove your skills as an undercover agent.  An old colleague is trapped in the club, caught up in an intel-gathering mission with a notorious business captain.  Your mission is to sneak into the club incognito and get him out before he blows his cover.  Can you do it?<br/><br/><strong>Betrayal At Club Low</strong> offers up a surreal setting rooted in Cosmo D's previous games, tactile dice-driven gameplay, and tense decisions at every turn.  There are multiple ways to approach your mission, and <strong>eleven possible endings</strong> based on the choices you make along the way.<br/><br/><h3>• A Bespoke tabletop Session Come to Life</h3>Inspired by short, punchy, independent zine RPGs, this game evokes the feel of a one-off tabletop session, with Cosmo D as your guide.<h3>• Character Skills As Customizable Dice You Physically Roll</h3>You show up to the club with seven skills: <strong>Athletics, Cooking, Deception, Music, Observation, Wisdom and Wit.</strong>  These skills manifest as dice you'll be rolling throughout your mission.  In Club Low, you upgrade your skills by upgrading individual faces of your dice, then roll 'em live with real-time dice physics.<h3>• A Reactive Narrative</h3>Club Low is a deceptively dangerous place that rewards the curious, the bold and the whimsical.  You can approach your mission in a myriad of ways, and depending on the choices you make, the outcomes of your mission are numerous.  Care to discover all eleven endings?<br/><h3>• A Scoped Experience</h3>Sure, <strong>Betrayal At Club Low</strong>'s mission can be played in an evening, but it can also be replayed with new challenges and difficulty modes to uncover new layers of risk and reward.  <br/><h3>• Pizza... As Dice</h3>It wouldn't be a Cosmo D game without pizza, and in <strong>Betrayal At Club Low</strong>, pizzas take the form of dice, too!  Roll your Pizza Dice to get paid, get healed, and gain an edge in the club.<br/><h3>• The Off-Peak Saga Continues</h3>The story of Club Low folds into the wider narrative tapestry of Off-Peak City.<br/>", "metacritic": null, "released": "2022-09-09", "tba": false, "updated": "2023-10-29T16:14:40", "background_image": "https://media.rawg.io/media/screenshots/d1d/d1dfe19c47ee23da3bed19e8f1b57648.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 41, "beaten": 5, "toplay": 5}, "playtime": 3, "achievements_count": 24, "ratings_count": 4, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 4, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cosmo D Studios"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["Cosmo D Studios"], "esrb_rating": null}