{"id": 849416, "slug": "sniperverse", "name": "SniperVerse", "name_original": "SniperVerse", "description": "Test you might!\r\n<p>This is a demo version where you get to show off your speed and adaptability.</p>\n<p>Wind, gravity, and bullet velocity are all things you will need to adjust to. </p>\n<p>The level contains a completely customizable environment and presets for Earth-like and Mars-like shooting and is made for realistic sniping. </p>\n<p>Not feeling for speedrun no problem take your time hitting the harder targets and tell me what you think, any feedback will be greatly appreciated.</p>\n<p>Beat my time for in-game awards, challenge me: </p>\n<p>Discord for more information: https://discord.gg/9WUQhP5AVm</p>\r\nStory\r\n\n<p>A kid in a room \r\n</p>\n\n<p>Completing challenge after challenge, Dimension after dimension, enemy after enemy, new environments to adapt to.\r\n</p>\n<p>He has seeing all that the world has become after him, a very evil man.\r\n</p>\n<p>The kid is left with an empty feeling after the purple color has taken over the world.</p>\n<p> From his room, he travels to extinguish the curuption that the man has created</p>\n<p>However, the evil man is not alone, Here are the Commanders:</p>\n\n<p>To achieve his goal he upgrades his room, acquires pets to help him fight, and builds up an arsenal of rifles to choose from with all rifles being completely customizable from the material to stickers and extra detail. All this will be fully animated, squirting on a silencer to placing stickers on the rifle for an immersive feeling.</p>\n<p>\"From the fire within my heart, I will defeat you\", The Kid.<br/></p>\n<p>Audio and visual story:</p>\n<p>More from me, subscribe to youtube: Needyboxman</p>\r\nWisdom\r\n<p>\"heavy inhale\" --- silence---\r\n</p>\n<p>scattered force is only for intimidation, a massive amount of power on a specific point. Now that's scary. Now if you only look for obstacles that's all you see however if all you look for is \"where is the path\" then all you see is the path, see through the obstacle and the wind will guide your bullet.\r\n</p>\n<p>Good luck beating my time, space cowboy</p>", "metacritic": null, "released": "2022-08-20", "tba": false, "updated": "2022-09-10T04:31:49", "background_image": "https://media.rawg.io/media/screenshots/660/66071ea5c74e6811fd2a416eb39f8410.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Needyboxman"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}