{"id": 849501, "slug": "system-zero", "name": "System Zero", "name_original": "System Zero", "description": "<strong>WELCOME TO THE SYSTEM</strong><br/>In this game you will be a cyber security who wants to take revenge first but after who will make a revolution. Your company will betray you and your journey to the being a black hat hacker will start.<br/><strong>Game Content</strong><br/><ul><li>-MORE THAN 200 SIDE MISSION<br/></li><li>-CLAN WARS<br/></li><li>-DARK WEB<br/></li><li>-HACKING<br/></li><li>-MAIN STORY LINE<br/></li><li>-UPGRADE AND LEVEL SYSTEM<br/></li><li>-PLENTY OF FEATURE YOU SHOULD DISCOVER IN GAME<br/></li><li>-HEISTS (WILL BE ADDED)<br/></li><li>-MULTIPLAYER PVP (WILL BE ADDED)</li></ul><br/><br/><br/><strong>DARK WEB</strong><br/>Nowadays lots of people know what dark web is. You must get into dark web and find new codes to get deeper. You will find important tools and lots of information. You must use hacking tools wisely and hack the computers you want. There is no person in the world who reached to the final layer of dark web. YET. Maybe you will be the one who reached to final layer of dark web or maybe you will get caught by FCI or get murdered by hitmans.<br/><br/><strong>SIDE MISSIONS</strong><br/>If you need some money and if you want to give some break for main story line, you can check your mailbox. There will be clients who want their dirty business done by a hacker. There are more than 200 side missions and doing every one of them will take more than 8 hours. There is no so much difference between side missions but we will make them unique after few updates.<br/><br/><strong>CLAN WARS</strong><br/>This feature will be added to multiplayer as well. You can make peace and ally treaties or decleare war to other clans. Every clan will have their own areas and you can attack to other clan's area to capture them. You will start as newbie but eventually you will be the leader after you 1v1 with the current leader. There are 6 game mode in clan wars:<br/>-CAPTURE THE DATA<br/>-TEAM CRASH<br/>-FAST HANDS<br/>-HOLD THE SIGNAL<br/>-DESTROY THE MAINFRAME<br/>-WHO IS WHO<br/><br/><br/><br/><strong>HACKING</strong><br/>You will have plenty of hacking tools which are included in owl os operating system:<br/>-HACKING TOOL FOR PORTS<br/>-IP FINDER FOR SEARCHING TARGETS<br/>-HACKING TOOL FOR OPENING BACKDOOR<br/>-TROJANHORSE<br/>-SYSTEM DESTROYER<br/>-BRUTE FORCE FOR CRACKING PASSWORDS<br/>-DEFENCE DEMOLISHER<br/>-WIFI CRACKER<br/>-OWL DEFENDER<br/><br/><br/><br/>There are also night owl operating system for advanced hacking.<br/>-INFO STEALER<br/>-MAIL GATHER<br/>-EXTERMINATE<br/>-SCREEN VIEWER<br/>-MONEY RIPPER<br/>-MEDIA THIEF<br/>Also you must delete the logs to prevent tracking.<br/><br/><br/><br/><strong>MAIN STORY LINE</strong><br/>You will be a cyber security who wants to take revenge first but after who will make a revolution. Your company will betray you and your journey to the being a black hat hacker will start but after your journey to becoming a black hat starts you will realize it is much more complicated than everyone can imagine. FCI's breath will be on your back everytime. After your main target company, you will realize there is much more to do. You will bring justice and equality. You will be the judge so let the judging begin. We don't want to spoil anything so it would be better if you play and see.<br/><br/><br/><br/><strong>UPGRADE AND LEVEL SYSTEM</strong><br/>In game you must upgrade your computer to use your computer faster. There is also level system and fan base. After you complete your missions you will gain some fans which will increase your reputation BUT there are some positive and negative effects of gaining reputation. YOU WILL BECOME THE TARGET OF FCI.<br/><br/><br/>PLENTY OF FEATURES<br/>There is features you must discover yourself like data mining or buying new estates.", "metacritic": null, "released": "2022-09-09", "tba": false, "updated": "2022-09-12T05:04:56", "background_image": "https://media.rawg.io/media/screenshots/c3f/c3fc474370d013f86b3f469cd79e9e9b.jpg", "website": "https://nexcorestudios.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["NexcoreStudios"], "genres": ["RPG", "Simulation", "Casual", "Indie"], "publishers": ["NexcoreStudios"], "esrb_rating": null}