{"id": 849507, "slug": "ming-hua-zhan-art-rebornpainting-connoisseur", "name": "名画展 - Art Reborn（Painting Connoisseur）", "name_original": "名画展 - Art Reborn（Painting Connoisseur）", "description": "Connoisseurs, welcome to this year's Connoisseur Competition! In a world full of famous paintings and artworks, you will take on the role of a connoisseur, using the charm of painting art to convince one audience after another and enchant them with the charm of painting art! During your journey, you will be able to take in the world's most familiar paintings and fill your pavilion with them!<br/><br/>● Enjoy the pleasures of painting with a large collection of world class paintings.<br/>● A detailed collection of scientific information, with the best possible documentation, covering painting genres, painters and a large number of explanations, for a 360° view of art.<br/>●Simple and casual elimination gameplay, the charm of art bursts out between clicks, use this to convince your audience.<br/>● Cute and light-hearted drawing style builds a colourful world with a twisted and bizarre story that tugs at the heartstrings.<br/><br/>● Standard 3 elimination! Hundreds of famous paintings for you to choose from, click to eliminate them and inspire their special powers to convince the audience!<br/>● Glamour explosion! Step beyond the 3-cancel limit with the connoisseur's killer app!<br/>● Genre skills! With super powers dedicated to 11 different painting schools, tremble in front of the art!<br/><br/>For the sake of the family's honour and commitment, you must travel to the various regional art galleries to try and challenge yourself and win the highest award in the art appreciation world - the Golden Beard Award. Otherwise, you will lose your chance to inherit the family's centuries-old art gallery forever. At the same time, you will also uncover one mystery after another that is close to your heart during your crisis-ridden adventure ......", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-12T05:12:24", "background_image": "https://media.rawg.io/media/screenshots/90d/90daba1f4bde23bdb9c6d6d5de2ff13b.jpg", "website": "http://www.muccylogic.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MuccyGames"], "genres": ["Casual"], "publishers": ["MuccyGames"], "esrb_rating": null}