{"id": 849660, "slug": "deep-in-the-void", "name": "Deep in the Void", "name_original": "Deep in the Void", "description": "<p>The Game is still in early development. Many of the planed features are yet to be implemented. Expect Bugs.</p>Alpha TrailerStory\r\n<p>Deep in the Void plays in a Sci-fi Universe where you, the Player, were part of a Space Expedition with others from your home World. On your way from Platina X-27 to Frek Z-Y your expedition fleet was mysteriously pulled out of your Warp drive, destroying most of the fleet and heavily damaging your ship.<br/></p>\n<p>Fortunately for you, during the incident you were doing  an Inspection on a mining Vessel. After a couple of hours, you wake up and start to realize your situation. The mining ship's Artificial Intelligence “Cora” has started an emergency procedure and activated an emergency Station.\r\n</p>\n<p>The Ai gives you control over the mining vessel and gives you first Instructions. She tries to scan the surroundings and tells you to start mining the asteroids close to the Station.\r\n</p>\n<p>The goal of the Player is to construct infrastructure to help save survivors that are still alive and lost in the void. Defend yourself and your colony from enemies. The end goal of the Game is to construct a Warp Drive Device to rescue you and your people.</p>\r\n Beginning\r\n<p>The ship of the Player is broken, because of this his ability to move is restricted. The ship also shows vital damage to its hull. The Player is greeted by the Artificial Intelligence.  She tells you about the Incident and gives you your first tasks.</p>\n\r\nGather Resources\r\n<p>He gets the task to start gathering resources, so that he can repair his mining vessel. When the player shoots his Laser at an Asteroid, he will get Ore from “Ore Asteroids” which look darker and Ice from “Ice Asteroids” which look blueish, white.</p>\n\r\nEmergency Station\r\n<p>The Emergency Station provides a cargo to store all Resources. It is also the Science lab, with which the Player can repair his ship, and start to gather knowledge about different Buildings.</p>\n\r\nBuilding Interface\r\n<p>When the Player traverses through the Science tree and researches the “captain's interface”, he will be able to access the “Build UI”</p>\n\r\nFactories &amp; Furnaces\r\n<p>Factories &amp; Furnaces are the Core elements in “Deep in the Void”.</p>\n<p>With these Buildings, it is possible to automate the construction processes and later get more Technologies and Defensive Weaponry.</p>\n\r\nBuild a Space Colony\r\n<p>The Goal of the Game is to expand your Colony and ready your defenses against hordes of Aliens.</p>\n\r\nRadio wave Pollution\r\n<p>Another Core Mechanic is the Radio wave Pollution. Aliens are attracted to the radio wave pollution. Their goal is to destroy you and your Colony, because they hate everything that emits those waves. Radio wave pollution is being emitted when constructing and maintaining buildings</p>\n\r\nDefending your Colony\r\n<p>Once the Radio wave Pollution gets high enough, nearby aliens will form an organized attack against you. The Player needs to make sure that Turrets have been researched and are ready to fend off the Threat. The Mining laser of the Player's Vessel is enough against the earliest waves, but too weak once the attacks get larger.\r\n</p>\n\n\r\nPlaned Features\r\n<p>The Game is still in early development and many of the planed features are yet to be implemented.</p>\n<p>- More complex and challenging logistics, beyond cargo drones simply delivering everything where it needs to be automatically.</p>\n<p>- Different enemy types and enemy bases which need to be destroyed to make room for expansion. Alien technology can be salvaged from enemy bases.<br/></p>\n<p>- Many more buildings and technologies.</p>\n<p>- Population and Crew mechanics. Most buildings will require a crew and they need water to be sustained. You can find survivor pods in space to increase your population.</p>\n<p>- The ability to manufacture and command AI controlled space ships.</p>\n<p>- Energy system. Solar Power, Nuclear Energy and more exotic technologies.<br/> <br/></p>", "metacritic": null, "released": "2022-09-11", "tba": false, "updated": "2022-09-12T06:22:12", "background_image": "https://media.rawg.io/media/screenshots/537/537a5bab892bad026e94e16b503fa868.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whackland Studios"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}