{"id": 84975, "slug": "papas-taco-mia-to-go", "name": "Papa's Taco Mia To Go!", "name_original": "Papa's Taco Mia To Go!", "description": "It's a flavor fiesta in this new version of Papa's Taco Mia, with gameplay and controls reimagined for iPhone and iPod Touch!<br/><br/>You'll need to multitask between four areas of the taco shop, with new controls designed to work just right in the palm of your hand.  Head to the Order Station to take orders from your zany customers in the lobby.  Switch to the Grill Station to cook, flip and cut meats before pouring them into taco shells.  Move to the Build Station to add a variety of toppings to your tasty tacos.  Jump to the Chip Station to fill a basket with chips, and choose a delicious salsa or dip to complete the meal.  Each station is a hands-on experience, where you'll need to drag, swipe, and tap your way through the taco-crafting process.<br/><br/>Keep your customers happy to earn more points and level up.  As your level rises, you'll unlock new toppings for the shop, and new customers will start visiting the taqueria!  Well-crafted tacos will also earn you tips to spend in the Shop, and Mini-Game Tickets to use in the daily Mini-Game!<br/><br/>**NEW FOR PAPA'S TACO MIA TO GO**<br/><br/>SERVE SPECIAL RECIPES - Earn Special Recipes from your customers, and serve them as the Daily Special in the taco shop!  Each Special has a bonus you can earn for serving a prime example of that recipe.  Master each recipe to earn a special prize!<br/><br/>NOW WITH HOLIDAYS - You'll now serve seasonal tacos throughout the year in Papa's Taco Mia To Go!  As you reach new ranks, the seasons and holidays in the game will change, unlocking holiday-themed shells, meats, and toppings for your tacos.<br/><br/>SERVE CHIPS AND DIP - Each customer will also choose chips and dip to complete their meal!  Unlock multiple types of chips, dips, and salsas as you go, and time the pouring just right to earn some bonus money.<br/><br/>NEW INGREDIENTS - The taqueria gets a ton of new ingredients for the holidays, including some new holiday ingredients that haven't been available in other versions!<br/><br/>CONTROL WITH YOUR THUMBS - You'll switch stations using buttons in the corners of the screen, perfect for your thumbs.  You can also use buttons in the top corners to quickly switch Order Tickets, and you can view all of your Order Tickets in a zoomed-in mode for easy reading.<br/><br/>COMPLETE YOUR COOKBOOK - All of your Special Recipes will be collected in the Cookbook, which has been redesigned for smaller screens.  Browse through each of your recipes, choose your daily special, and switch tabs in the cookbook to view a list of the ingredients you've unlocked so far!<br/><br/>PLAY MINI-GAMES - Foodini's mini-games have returned for Papa's Taco Mia!  Earn Mini-Game tickets as you serve customers, and spend those tickets in the daily Mini-Game available after each workday.  Earn prizes in each Mini-Game which you can use to decorate your lobby, and keep playing Mini-Games to unlock Rare Prizes!<br/><br/>**GAME FEATURES**<br/><br/>- Hands-on taco shop in the Papa Louie universe<br/>- All new controls and gameplay designed for smaller screens<br/>- Multi-task between cooking, building, and serving chips and dip<br/>- Earn and master 40 unique Special Recipes<br/>- 12 separate holidays to unlock, each with their own ingredients<br/>- Buy upgrades, furniture, and posters using your in-game tips<br/>- Play 7 different Mini-Games using your earned tickets to win prizes<br/>- Decorate your shop in the Lobby Editor<br/>- 108 customers to unlock with unique orders<br/>- 90 in-game achievements<br/><br/>** NOTE FOR iPAD USERS**<br/><br/>Papa's Taco Mia To Go is designed especially for smaller screens.", "metacritic": null, "released": "2017-03-21", "tba": false, "updated": "2019-08-02T05:16:47", "background_image": "https://media.rawg.io/media/screenshots/2ef/2ef62a5daef5d98d538ee60aa60790b4.jpg", "website": "http://www.flipline.com/apps/papastacomiatogo/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Flipline Studios"], "genres": ["Strategy", "Simulation"], "publishers": ["Flipline IDS"], "esrb_rating": null}