{"id": 849784, "slug": "gogmagog", "name": "GogMagog", "name_original": "GogMagog", "description": "Play as the cyber Messiah as you bring judgment upon legions of heretics at the Armageddon. Build a deck of powerful abilities, scale up your gameplay with Artifacts and create powerful synergies to smite the sinners!<h3>Build your deck</h3>GogMagog brings a unique blend between the Twin stick shooter and Deckbuilding genres. While progressing in your run you will find additional cards that will create powerful combos with existing cards and overall snowballing your character to greatness, as well as card upgrades and artifacts that will synergize your deck.<br/><h3>Plan your hand</h3>You only have 2 cards at your disposal in a given time, and each card brings a different type of action into the game whether it’s damage or utility you must plan accordingly. Using the wrong card at the wrong time might be the end of the run!<br/><h3>Roguelike</h3>By combining cards with artifacts you’ll create a unique play-style, from melee to summoner builds or be a tank of holy retribution. When you die you’ll come back to a new set of challenges and a new build to smite the heretics with.<h3>Bring judgment</h3>In GogMagog there is no moment of rest for the savior, as the cyber Messiah you will be bombarded with massive waves of non-stopping heretics &amp; demons that evolve with time and as the apocalypse becomes closer, so does the difficulty of saving the world.", "metacritic": null, "released": "2022-09-11", "tba": false, "updated": "2023-02-03T03:10:32", "background_image": "https://media.rawg.io/media/screenshots/6e5/6e5e5a66bb9a1a0da68fa3454067eaaf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TheAsh", "orenkoren", "Single A Games"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Single A Games"], "esrb_rating": null}