{"id": 84980, "slug": "candy-salon-makeover-games-for-girls", "name": "Candy Salon: Makeover Games for Girls", "name_original": "Candy Salon: Makeover Games for Girls", "description": "It’s time for a sweet makeover! Run your Candy Beauty Salon - choose one of these candy models and turn them into the sweetest celebrities ASAP! Don’t miss your chance to be a fashion producer in the Candy World. Show your sparkling talent and taste of yummy fashion!<br/><br/>Candy hair salon games free for girls:<br/>This girl needs a candy hairstyle! Welcome to beauty hair salon fashion spa treatments! Wash hair with a shampoo, dry, comb tangled hair using different professional candy styling tools and yummy cosmetics. Now choose an appropriate haircut. At your disposal is a wide selection of hair styles: long cotton hair, short cuts, curly or straight hair. Dye your model’s hair in hairstyle games for girls. Go wild with yummy colors - it's candy makeover games! How about rainbow hair? Create a tasty style with awesome hair accessories for various occasions. Select from a huge collection of candy cane tiaras for a photo shoot, cute hair bands and ice cream hair clips for a romantic date or glamorous hats for a high fashion show. Wow! She looks delicious!<br/><br/>Makeup artist games:<br/>Your model needs a shiny makeup to complete the look. Choose from tons of colorful eye shadows, mascara, juicy lipsticks and more! And don’t forget that yummy accessories is a must have of this season! Shiny sugar jewelry and animated tattoos will turn your model into a stylish celebrity!<br/><br/>Fashion photoshoot games for girls<br/>Find the juiciest looks to help your candy model get ready for a magazine cover photoshoot. But you should select necessary accessorizes as fast as possible – the more photos your model takes the more chances for her to get on the cover of a fashionable magazine.<br/><br/>Beauty Contest and red carpet fashion games (makeup games for kids)<br/>OMG! Your model looks so sweet that everybody will have a crush on her! Compete against other models to win likes in social media. Vote for your beautiful model. Stay in the competition as long as possible. <br/><br/>Shop in spa and salon games:<br/>Use likes earned in the competition to buy exclusive accessories and cosmetics for your model in doll makeover salon. Buy looks and royal makeup sets to be the hottest girl!<br/><br/>What can you do in these model makeover games for girls?<br/>-\tChoose from 3 pretty top models who are dying to start working with you;<br/>-\tPlay 4 mini games with cute animations and tons of fun surprises;<br/>-\tStyle hair with various professional tools;<br/>-\tUse huge collections of hair accessories and jewelry;<br/>-\tApply makeup with yummy facials in the Makeup Salon. There you’ll find dozens of eye shadows, lipsticks, rouge and many more!<br/>-\tGo in style with beautiful animated tattoos;<br/>-\tProve that you’re the best! Take part in Beauty Contests and win likes for your protégé.", "metacritic": null, "released": "2017-05-04", "tba": false, "updated": "2019-08-16T05:58:57", "background_image": "https://media.rawg.io/media/screenshots/137/137d58fafc4781136c3d201a1cccaaeb.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gadget Software Development and Research"], "genres": ["RPG", "Simulation"], "publishers": ["Gadget Software Development and Research"], "esrb_rating": "Everyone 10+"}