{"id": 850079, "slug": "making-a-statement-game-jam", "name": "Making a Statement (Game Jam)", "name_original": "Making a Statement (Game Jam)", "description": "<p><strong>Welcome to..... Making a Statement!</strong></p>\n<p>Making a Statement is a prototype for a word-based game show format, not unlike Wheel of Fortune. Unlike Wheel of Fortune however, there's a lot more strategy and you'll have to play your cards right to solve the puzzle before your friends!</p>\n<p>This prototype was made in a single week for the #DevIdeaWeek jam. It isn't very pretty, and doesn't have a lot of polish. The main goal was to get the game concept working and playable so that future improvements to the format and balance could be discovered and hashed out. If people really like it, it could even turn into a full release some day!</p>\n<p><strong>HOW TO PLAY!</strong><br/></p>\n<p>First off, you will use the mouse and keyboard to interact with this prototype. Click on cards and buttons, type in letters for guessing/answering.</p>\n<p>The goal of <strong>Making a Statement</strong> is to fill in the blanks of the word or phrase shown, in order to solve the puzzle. Each player starts with a hand of 3 cards which will allow you to perform various actions. Cards have an Energy Cost (the green diamond symbols). Every player starts every turn with 4 energy. Depending on how you play your cards, you may be able to take multiple actions in a single turn, or just one.</p>\n<p><strong>Here is the flow of a turn:</strong></p>\n<ol><li>Stop a roulette wheel to see your bonus. You may either draw an extra card (in addition to the 1 that you will always draw at the start of your turn), get an extra energy (so you will start your turn with 5 energy rather than 4), or get no bonus.</li><li>Choose an action to take. You can either play one of your available cards, attempt to solve the puzzle, or pass your turn to the next player.</li><li>If you choose a card, you will perform the action on the card. This may be guessing a consonant, or a vowel, in which case you will type the letter you want to guess with your keyboard. Otherwise the card's effects may be automatic (such as revealing the first letter of each word)</li><li>When you do not have any energy left, your turn is over and it will automatically pass to the next player.</li></ol>\n<p><strong>Lucky/Risky Cards</strong></p>\n<p>If a card says \"Lucky\" on it, you will regain one energy if the letter you guess appears in the puzzle! If a card says \"Risky\" on it, you will lose an additional energy if the letter you guess does not appear in the puzzle! Be careful.</p>\n<p><strong>Making Money</strong><br/></p>\n<p>Every time a consonant is guessed, $100 dollars will be awarded for every blank in which it appears in the puzzle. No money is awarded for vowel guesses.</p>\n<p>When choosing to solve the puzzle, if the solution is correct, $200 are awarded for every letter that was previously un-guessed upon the time of solving the puzzle.</p>\n<p>This means that, unlike Wheel of Fortune, solving the puzzle as early as possible is the best strategy! As soon as you think you know it, hit that solve button. Be careful though, if you are not correct, your turn will be over even if you have remaining energy.</p>\n<p><strong>Game Over</strong><br/></p>\n<p>A game consists of 4 puzzles. Once you have finished all 4 puzzles, the player with the most money wins and the game is over. You can start a new game by pressing the button.</p>\n<p><strong>Caveats!</strong><br/></p>\n<p>This prototype was made in 6 days total. It has not been extensively tested. It might be broken in numerous exciting ways, and I don't plan on fixing bugs in the near-future either so it is what it is!</p>\n<p>You can play with Bot players. The Bots are not very smart, and barely try to apply any strategy. They will make really stupid guesses and play cards unstrategically. It would be better to play with a human friend or three!</p>\n<p>Some of the puzzles in the data-set are not great. I sourced some of the puzzle data from lists on the internet, and attempted to do some curation of it, but there still might be weird answers that make you say \"huh???\"</p>\n<p>I hope you enjoy playing Making a Statement, I would love to hear your feedback on how this could be expanded and improved upon if I ever decided to make a full release!</p>", "metacritic": null, "released": "2022-09-10", "tba": false, "updated": "2022-09-12T09:16:18", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b60639c38b340fccbdbdbdf180b3fcb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nick Ver Voort"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}