{"id": 850211, "slug": "pilot-training-next-next", "name": "Pilot Training Next Next", "name_original": "Pilot Training Next Next", "description": "<p>Our team is improving on the existing Pilot Training Next simulators by integrating all  4 simulators in  a multiplayer game. The Unity real-time 3D engine is being used for the demonstration. In additional to traditional out-the-window views, we are experimenting with electromagnetic warfare concepts by visualizing EW signals and modeling effects of EW on communications and aircraft flight controls.</p><p>Future iterations of this game may be connected to metaverse tools for large-scale world visualization with many synthetic entities.</p><p><strong>Challenge Statement 1 - Simulation to the Metaverse</strong></p><p>SUMMARY<br/>Move an existing DoD simulation to the metaverse (Omniverse, Hadean, or StellarX). The problem is to take an existing simulation and move it into a metaverse platform and  demonstrate its functionality. Each month gaming capabilities are being revectored to the new platforms. The DoD must start moving in that direction to realize its promised advantages in training  all services. </p>\n<p>REQUIRED TECH<br/>Required to demonstrate the functionality based on chosen simulation and platform. A Pilot Training Next (PTN) Air Force flight simulator is available in Tech Grove to use for this challenge if desired.  Air Force SMEs will be available during the weekend to assist if a team is interested in using the PTN.</p>\n<p>USE-CASES<br/>Move an existing flight simulator on to a metaverse and demonstrate its functionality</p>\n<p>WHY IT IS IMPORTANT<br/>All roads seem to lead to the metaverse.</p><p><strong>Challenge Statement 2 - Pursue Total Force Spectrum Readiness</strong><br/></p><p>SUMMARY<br/>1. DoD is seeking a mechanism to certify, database, and track Electromagnetic Spectrum Enterprise (EMSE) expertise. (Resource Management)</p>\n<p>2. DoD is seeking to test the warfighter's ability to characterize an environment, assign and coordinate resources, and manage those resources in light of an evolving environment. (Test and train)</p>\n<p>3. DoD is seeking to integrate joint force exercises, rehearsals, and war games under simulated realistic operational conditions (live, virtual and constructive models) that incorporate all EMS capabilities and challenges. (Wargaming)</p>\n<p>USE-CASES<br/>A game where users can manage spectrum resources and characterize a realistic environment</p>\n<p>WHY IT IS IMPORTANT<br/>The DoD must ensure all personnel are indoctrinated and trained at the appropriate level on spectrum core concepts. They should understand the spectrum impacts on their capabilities, operations, and plans. Training will be tailored to meet the needs of personnel at each level of DoD structure – from technicians, to requirements personnel, to operators, and to top-level commanders. The DoD will ensure all identified members of the spectrum workforce are appropriately trained and retain relevant EMS skills and expertise. </p>", "metacritic": null, "released": "2022-09-10", "tba": false, "updated": "2022-09-12T10:08:15", "background_image": "https://media.rawg.io/media/screenshots/a74/a746bf73c4b0555c4d65141433d3fb76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SimBlocks"], "genres": [], "publishers": [], "esrb_rating": null}