{"id": 850393, "slug": "interference-dead-air-demo", "name": "Interference: Dead Air (Demo)", "name_original": "Interference: Dead Air (Demo)", "description": "<p><em>All hell is breaking loose in a mysterious research facility, and the only person who can save the day is the night shift security guard in the booth outside. Remotely control systems, guide scientists to safety or just... goof off? You’re not in danger. Yet.</em></p>\n\n<br/>\n<p>It looks like another quiet night in your isolated desert outpost, monitoring the mysterious happenings of the top-secret research facility you're paid minimum wage to protect. However, the night quickly turns deadly when a security breach throws the facility into chaos, trapping your best friend inside—the same best friend with whom you've spent the last few hours arguing, of course! Armed with only a shortwave radio and the items scattered around your booth, will you put aside your differences and help your friend survive? Or will you go radio-silent? It's up to you.</p>\n<ul><li><strong>ACTIONS MATTER</strong>: Every decision the player makes (or doesn't make) is valid. Wanna be an asshole? Sure. A pushover? Go for it!</li><li><strong>MULTITASK</strong>: Monitor your radio, computer, and map to lead your friend to safety. You'd just better hope the power doesn't go out.\r\n</li><li><strong>TUNE OUT</strong>: Your booth is outfitted with all sorts of distractions. Shoot a few hoops or unwind with a relaxing word search puzzle. We know you have a lot on your plate managing a massive security breach and keeping your best friend alive, but you do you.\r\n</li><li><strong>ATMOSPHERIC SETTING</strong>: The desert is spooky, mysterious, and kinda lonely... the perfect place to contemplate your worldly insignificance!\r\n</li><li><strong>ORIGINAL SOUNDTRACK</strong>: The 80s called, they want their synthesizers back.\r\n</li><li><strong>REPLAYABILITY</strong>: A branching narrative adventure that plays out in real-time, with no two playthroughs exactly alike.\r\n</li></ul>\n<p>Featuring a fully voice-acted branching narrative, an original 80s-inspired soundtrack, and tons of secrets, <strong>Interference: Dead Air</strong> is a frequency you won't want to miss tuning in to!<br/></p>\n<em>NOTE:</em><strong> </strong><strong>This is the demo version of the full game, coming soon! If you'd prefer to download the same demo through Steam, use the link below.</strong>\n<p>---------------------------------------</p>\r\nDiggin' it?\r\n<p>The full version of <strong>Interference: Dead Air</strong> is coming soon! Wishlist now on Steam:</p>", "metacritic": null, "released": "2022-09-09", "tba": false, "updated": "2022-09-12T11:19:52", "background_image": "https://media.rawg.io/media/screenshots/fff/fff41b105109ec54c2bad84ced1382f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fear of Corn"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}