{"id": 850431, "slug": "wave-function-collapse-in-godot", "name": "Wave Function Collapse in Godot", "name_original": "Wave Function Collapse in Godot", "description": "Wave Function Collapse\r\n<p>This little demo project is a loose Godot implementation of Wave Function Collapse algorithm. Wave Function Collapse is an algorithm for procedural generation of images (or levels / meshes / geometry / poetry, etc.) that are locally similar to the input. This implementation uses the tiled model of the algorithm and builds tiles connections automatically by analyzing border pixels colors.</p>\r\nControls\r\n<ul><li>Select width and height of the simulation by using sliders on top-left.</li><li>Select tiles from the list of tiles to activate them. Active tiles (and their rotations) are used in the simulation. At least two compatible tiles are required for this to work.</li><li>You can zoom with mouse wheel and pan with middle mouse button.</li><li>If you ever lose the view you can use Reset View button to get back to the default camera settings.</li><li>Run/Stop button runs the simulation. There must be at least two compatible tiles selected in order for this to work.</li><li>Reset button clears the simulation.</li></ul>\r\nExperimental Features\r\n<p>Using \"Danger Zone\" checkbox you can access some experimental features, like unlocking the grid size limits or providing your own tile images for the simulation.</p>\n<p>Note that none of these features were tested and they most likely to cause bugs, crashes, or freeze the application.</p>\n<p>If you increased the size of the grid beyond limitations and can't see the simulation, try zooming out until you see it.</p>\n<p>If you intend to use custom tile images be aware of the following limitations:</p>\n<ul><li>File loading is supported only in Windows builds. Web version has no access to your hard drive.</li><li>Supported file format is PNG</li><li>Images must be square</li><li>Images must have the same size. Size of the default tiles is 9x9 px</li><li>Adjacency rules are formed based on the color of border pixels</li></ul>\n<p>Ignoring any of these will most probably drive the application into non-recoverable state. Just reload it.</p>", "metacritic": null, "released": "2022-09-09", "tba": false, "updated": "2022-09-12T11:37:35", "background_image": "https://media.rawg.io/media/screenshots/eb3/eb3ad4f22c9bbcb1d6a14313c5306e50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["The Game Is Simple"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}