{"id": 85052, "slug": "grocery-store-cash-register", "name": "Grocery Store Cash Register", "name_original": "Grocery Store Cash Register", "description": "Hey Kids! Have you ever been to the supermarket with your mom or Dad? Do you love to do shopping at the supermarket? But don’t you want to jump the other side &amp; play as a cashier in your very own supermarket &amp; learn how to operate the cashier machine at supermarket. Grocery Store Cash Register is an educational game for young boys &amp; girls. In Grocery Store Cash Register kids can learn how to handle money as cashier at supermarket. Kids can improve their basic math learning skills like addition &amp; subtraction.<br/><br/>Supermarket Grocery Store Cash Register starts with a manual machine you have to enter the price of each item and get the total of all. Tap on the customer to receive money. Cash drawer will open and you can put the received money and return the balance amount to the customer. You can upgrade your manual point of sale, with the automated one so you can scan each grocery item the customer brings to the counter, and ring up the price! Then accept payment via cash, credit card or through mobile NFC, and enter the total amount, followed by scanning the credit card or mobile!<br/><br/>Grocery Store Cash Register is a time management game, customers are in queue, waiting to pay money and get their grocery items packed. An experienced supermarket shopping mall cashier knows how to operate the cashier machine serving the customers in time, so they don’t get angry on any kinds of delays.<br/>In this mile-a-minute time management game you can also improve your time management skills. Customers are in queue, waiting to pay cash and get their grocery items packed. A fast-paced time management game to test your speed and accuracy. Grocery Store Cash Register is an educational and fun game where children learn to handle money at supermarket shopping mall. It can help improve their math and calculation skills.<br/><br/>Features:<br/>* Fast paced Time Management Cash Register Simulation<br/>* Serve customers &amp; make them happy to get rewards<br/>* Modern payment methods; Credit Card Machine and NFC Mobile payments<br/>* Unlock Point Of Sale Machine to scan items<br/>* A fun filled time management game<br/>* Use Auto Complete Robot to get task done automatically<br/>* Use Cool Candies to increase patience of customers", "metacritic": null, "released": "2016-10-06", "tba": false, "updated": "2019-10-22T14:22:19", "background_image": "https://media.rawg.io/media/screenshots/288/288c9086f7de927811460244e5f4a202_HgYIEbw.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["RPG", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Everyone 10+"}