{"id": 850686, "slug": "front-mission-2-remake", "name": "Front Mission 2nd Remake", "name_original": "Front Mission 2nd Remake", "description": "<p>FRONT MISSION 2 blends intense strategy with a deep and involved storyline.</p>\n<p>12 years have passed since the second Huffman conflict. The impoverished People&#39;s Republic of Alordesh has been suffering a severe economic decline ever since the war ended. In June 2102, soldiers of the Alordesh Army rise up and, led by Ven Mackarge, declare independence from the O.C.U. (Oceania Cooperative Union).</p>\n<p>Ash, an O.C.U. soldier, manages to survive the ensuing battle, but Alordesh is completely overrun by the Revolutionary Army. Ash and his surviving teammates infiltrate Alordesh&#39;s chaotic underground in an attempt to escape the country. However, they soon discover that there is a huge conspiracy behind the coup.</p>\n<p>In FRONT MISSION 2, the perspective switches between three characters: Ash, Lisa, and Thomas, creating a worldview that goes beyond a simple dichotomy between good and evil.</p>\n<p>FRONT MISSION 2: Remake preserves the mature story, strategic turn-based combat, and Wanzer customization options of the original. Enjoy the revitalized classic with updated visuals and new features and enhancements!<br />\n- Support for many new languages<br />\n- New &#39;free camera&#39; option to zoom in during gameplay and check out Wanzers in detail<br />\n- New coloring and camouflage options<br />\n- Modern in-game effects<br />\n- Renewed soundtrack</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-02-07T12:36:38", "background_image": "https://media.rawg.io/media/games/176/176bfc28c45c571c1d4f7ddf61cdb979.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 5}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch"], "developers": ["Forever Entertainment"], "genres": ["Strategy"], "publishers": ["Forever Entertainment"], "esrb_rating": null}