{"id": 850687, "slug": "story-of-seasons-a-wonderful-life", "name": "Story Of Seasons: A Wonderful Life", "name_original": "Story Of Seasons: A Wonderful Life", "description": "<p>An unforgettable tale of friendship, family and farming blooms back to life on Nintendo Switch™.</p>\n<p>Your new life begins in Forgotten Valley, a tranquil community where your father and his friend Takakura once dreamed of running a farm. As you befriend the valley’s residents and fulfill your father’s legacy, you’ll live a carefree life on the farm growing crops and raising animals. As the seasons go by, you’ll find your lifelong partner, raise a child together, and watch them grow up before your very eyes.</p>\n<p>After each day’s work on the farm is done, you can go fishing, hunt for ancient treasures at the local dig site, or chat with your friends in town to build precious memories. And when the years have passed, your child will be old enough to choose a career for themselves... Will they inherit the farm? Or will they find their calling somewhere else? Only time will tell.</p>\n<p>This remake of a beloved classic features plenty of new events, enhanced festivals, more recipes to cook, and a cornucopia of never-before-seen crops. Looking for more to do around the farm? Take pictures of your family with the new camera feature, dress up in your favorite outfits, or help your fellow residents with their requests. Whether this is your first STORY OF SEASONS adventure or you’re returning to Forgotten Valley, a wonderful life awaits you.</p>", "metacritic": null, "released": "2023-06-27", "tba": false, "updated": "2023-06-30T13:45:23", "background_image": "https://media.rawg.io/media/screenshots/09f/09ff3775a4e369a75cc44eaaa02b3936.jpg", "website": "https://www.storyofseasons.com/awl/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 6, "toplay": 13, "dropped": 3, "playing": 1}, "playtime": 9, "achievements_count": 34, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Nintendo Switch"], "developers": ["Marvelous"], "genres": ["Adventure", "RPG", "Simulation", "Casual"], "publishers": ["XSEED Games", "Marvelous", "XSEED", "Marvelous Europe"], "esrb_rating": null}