{"id": 850708, "slug": "rise-of-the-ronin", "name": "Rise of the Ronin", "name_original": "Rise of the Ronin", "description": "<p>Japan, 1863.<br />\nAfter three centuries of the Tokugawa Shogunate’s oppressive rule, the Black Ships of the West descend upon the nation’s borders and the country falls into a state of turmoil. Amidst the chaos of war, disease and political unrest, a nameless warrior forges their own path, holding the very fate of Japan in their hands.</p>\n<p>Shape a dynamic story<br />\nAs a masterless warrior – a Ronin, your destiny is your own. See the story unfold in different ways depending on the choices you make and the characters you ally with along the way. Face critical mission decisions – like whether to assassinate or protect key figures, and shape the course of history through a rich multi-choice system.</p>\n<p>Engage in deep accessible combat<br />\nFrom the veteran developers of Nioh and Ninja Gaiden – Rise of the Ronin offers deeply engaging yet accessible combat, with layers of complexity suitable for any playstyle. Face your foes with a selection of close-quarters weaponry or engage from afar with authentic period firearms.</p>\n<p>Explore a historically-inspired world<br />\nThe “Bakumatsu” period heralds the end of the Shogunate as a new era begins and East and West collide. Experience this cultural revolution across an open world where you’ll meet the key figures who’ll shape the course of history, and the ordinary citizens seeking a guiding light in the darkness.</p>", "metacritic": null, "released": "2024-03-22", "tba": false, "updated": "2024-04-20T13:17:59", "background_image": "https://media.rawg.io/media/games/cc9/cc9f5f8f72f386c193dad449f40257c2.jpg", "website": "", "rating": 2.0, "rating_top": 3, "added_by_status": {"yet": 20, "owned": 39, "beaten": 2, "toplay": 105, "dropped": 3, "playing": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 6, "platforms": ["PlayStation 5"], "developers": ["Team NINJA"], "genres": ["Action"], "publishers": ["Koei Tecmo"], "esrb_rating": null}