{"id": 850787, "slug": "fear-them", "name": "FEAR THEM", "name_original": "FEAR THEM", "description": "<strong>FEAR THEM</strong> is an immersive online co-op psychological thriller game in which players visit abandoned places to investigate and fight <strong>paranormal phenomena</strong>. Face dangerous entities, survive their wrath and help them into the light.<br/><br/>Explore a wide variety of locations, unearth the horrific backstory and expose yourself to the sheer terror that the unknown entities have in store for you. Gather evidence, search for clues and find out more about the paranormal entity before it devours the whole team.<br/><br/><br/><ul><li><strong>Gigantic maps:</strong> Discover abandoned apartments, the vacant farm including its surroundings or even venture into the sprawling abandoned hotel. </li></ul><ul><li><strong>Varied gameplay:</strong> Countless circumstances and properties are randomly generated in each round. No round is like the last. </li></ul><ul><li><strong>Co-op Multiplayer:</strong> Plunge into investigations with your friends or venture on this journey with other Hunters. Solo hunters can also embark on the dangerous quest. </li></ul><ul><li><strong>In-game voice recognition:</strong> Use the built-in voice recognition to talk directly or over the radio. Watch out, though: Not only your teammates can hear you.... </li></ul><ul><li><strong>long-lasting gameplay:</strong> Earn new equipment, new vehicles and more dangerous locations through experience. </li></ul><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-16T07:58:09", "background_image": "https://media.rawg.io/media/screenshots/c28/c289138859c22d54b6cea7da54dfa05e.jpg", "website": "https://fearthem.de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Burnout Industries UG"], "genres": ["Action", "Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Burnout Industries UG"], "esrb_rating": null}