{"id": 850856, "slug": "anachroma", "name": "Anachroma", "name_original": "Anachroma", "description": "<h3>⬡ A fun and relaxing adventure game with little puzzles to solve ⬡</h3><br/>Anachroma is a first-person adventure and puzzle game with a simple game mechanic : black-and-white elements are frozen in time, while colored ones can move and interact. Using a ball that brings color back to the world, the player must restore color to the black-and-white world around him to reactivate it and find his way through the levels.<h3>⬡ Explore a black-and-white world ⬡</h3><br/>After stealing a mysterious artefact and fleeing her home, Ana finds the world outside devoid of colors, frozen and silent. By switching between both color and black-and-white, she must take advantage of every situation to solve the mysteries surrounding the royal family. What caused the world to be stripped of its colors?<br/><br/><h3>⬡ Master the power of the Eye of Re, a powerful artefact ⬡</h3><br/>The Eye of Re, stolen by Ana, is a stange ball that can be thrown to restore color around it. But that's not its only power - it houses the spirit of an ancient inhabitant of the kingdom, who will help Ana through her travels.<br/><br/><h3>⬡ Unscramble the functioning of ancient mechanisms ⬡</h3><br/>The deserted isles of Mag Mell were once occupied by Men, who left behind numerous relics of their presence. The young heroin will have to experiment and understand their logic to make her path through the world.<br/><br/><h3>⬡ Discover the world through the eyes of a young girl ⬡</h3><br/>Between her father, King of a fallen kingdom, and her mother who went missing, Ana had a solitary and stifling childhood. Running away from the castle is her opportunity to shake the shackles of her overprotective father, gain her independance, grow up and lift the veil of King Re's secrets.<br/><br/><h3>⬡ Uncover the mysteries of the world of Mag Mell ⬡</h3><br/>The absence of inhabitants or animals leaves Ana wanders alone through the relics of a world she knows nothing of. Through ancient murals fresco of stone, infused with the memories of a forgotten society, she must learn the events that plunged the world into its current state.<br/><br/><h3>⬡ Solve puzzles to restore color ⬡</h3><br/>Restore the Eye of Re's fragments to these strange altars brings color and life back to its surroundings. But finding them is only half the battle - to reach them, Ana will have to listen to her artefact's advice and borrow its powers.<br/><br/><h3>⬡ Development ⬡</h3><br/>Anachroma's development process is open to public. If you're interested in viewing the behind-the-scene process of video game creation, you can join our Twitch channel (where we stream our work several times a week), or check the team's Trello to follow our progress.<br/><br/>https://store.steampowered.com/app/1832850/Anachroma/", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-16T09:31:42", "background_image": "https://media.rawg.io/media/screenshots/efb/efb738db65ec8576f9b68d25b39b3b3f.jpg", "website": "https://www.gravityboxgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 408, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gravity Box Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Gravity Box Games"], "esrb_rating": null}