{"id": 850814, "slug": "shape-of-the-toilet-rim", "name": "Shape Of The Toilet Rim", "name_original": "Shape Of The Toilet Rim", "description": "In this game, using the WASD keys, you can control a cube and make it slide around in all directions. You can press the spacebar to jump. The gameplay in this game features the riveting experience of jumping on top of moving toilet car enemies over and over again until you inevitably get hit by one of the enemies and die. You can then retry and try to beat your high score.<br/>\n<br/>\r\nA single cube fights for his life. He is stuck in an endless looping purgatory, fighting every second of every day in vain to attempt to vanquish the Shape Of The Toilet Rim. How far can you get him before your will, too, gives out?<br/>\n<br/>\r\nThis game features:<br/>\r\n- Decently Responsive Controls<br/>\r\n- Easy to learn mechanics such as jumping on toilet cars to make them explode.<br/>\r\n- Decent Graphics<br/>\r\n- Questionable Music and SFX<br/>\r\n- A relatively easy to understand menu and UI<br/>\r\n- The game is endless! You can keep retrying to raise your score!<br/>\r\n- A story (sort of) that is completely disregardable and is not directly mentioned in the game itself<br/>\r\n- Challenge yourself to get a score above 100!<br/>\r\n- Don't worry, if you die you can always press enter to block AleeXhey and try again!<br/>\n<br/>\r\nNot only is this game a work in progress, but it was also  mostly made as a joke and isn't meant to be taken too seriously. Thanks for playing though!", "metacritic": null, "released": "2022-09-15", "tba": false, "updated": "2022-09-16T08:33:50", "background_image": "https://media.rawg.io/media/screenshots/f76/f768c37d1cf31016f09a3273a60ee94c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RedWire"], "genres": ["Action", "Casual"], "publishers": ["Darth Mogus Enterprises"], "esrb_rating": null}