{"id": 850802, "slug": "recnaviclub", "name": "RecNaviClub", "name_original": "RecNaviClub", "description": "<strong>9 kinds of games are included in the package.</strong><br/>In Japan, health and longevity are of particular interest, with efforts centered on halting the effects of aging also attracting attention. What was developed in response to today's needs is the tool for prevention and recreation. <br/>Each app is more than just for fun;<br/>they also contain elements of brain-training, learning, physical training, and testing.<br/>So, there are a variety of places where it can play a helpful role, for example, facilities for the elderly, hotels, community centers, hospitals, and so on.<h3>Feature</h3><ul><li>Easy to operate!<br/></li><li>There is a variety of games lined up for brain training, physical exercise, learning, and cognitive function testing.<br/></li><li>Each app is entertaining, and is useful as a tool for communication or recreation.<br/></li><li>Multiple player accounts can be registered.<br/></li><li>History data can be saved.</li></ul><h3>How to Play</h3><br/><strong>Battle royal of Reversi</strong><br/>Not only can you enjoy a Reversi match with 2 people but with 3 or 4 as well.<br/>Let's try it!<br/><br/><br/><strong>Exciting curling</strong><br/>Let's enjoy curling! You can play with up to 4 players.<br/>It's important to carefully imagine the trajectory of the stone that you're about to throw.<br/>You'll also need to precisely throw, curve, or stop the stone by using your fingers.<br/><br/><br/><strong>Genki! ha.tsu.ra.tsu Challenge</strong><br/>How healthy are you? <br/>Take a simple quiz and aim for a gold medal!<br/>It's Mental State Examination tool. *Require operator.<br/><br/><br/><br/><strong>Bozu - mekuri</strong><br/>Simple and easy, but yet so exciting!<br/>Bozu-Mekuri is one of the most popular games in Japan.<br/>Try, and enjoy the feeling of Japan.<br/><br/><br/><strong>Mahjong castle</strong><br/>Please remove all Mahjong tiles piled up on the screen.<br/>You need to carefully find 2 Mahjong tiles of the same kind that can be removed.<br/><br/><br/><strong>Which has changed?</strong><br/>Let's memorize the details of some cards shown beforehand, and then find the changed one. <br/>You'll need to find it as quickly as possible to get a high score.<br/><br/><br/><strong>Looking for mistakes</strong><br/>Let's compare 2 pictures carefully to find some differences.<br/>Be careful, pictures which you tried in the past don't always have the same differences.<br/><br/><br/><strong>King of maths</strong><br/>Please answer correctly and quickly against the formulas.<br/>Complexity of formulas and time limit change depending on the difficulty level.<br/><br/><br/><strong>Touch the Lamps</strong><br/>Just tap the glowing lamps as quickly as possible. <br/>Let's try!<br/><br/>--", "metacritic": null, "released": "2022-09-14", "tba": false, "updated": "2022-09-16T08:19:05", "background_image": "https://media.rawg.io/media/screenshots/6cf/6cfbdcf9391bfa0129be88e394eb0417.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TOYOMARU INDUSTRY CO"], "genres": ["Strategy", "Sports", "Casual"], "publishers": ["TOYOMARU INDUSTRY CO"], "esrb_rating": null}