{"id": 85091, "slug": "country-side-village-farm", "name": "Country Side Village Farm", "name_original": "Country Side Village Farm", "description": "Enjoy the world of cultivation, farming and cattle raising, in Harvest Country Side Village Farm - Farmer Game. It is an Offline game where you have to work as farmer in village game who work on little farm &amp; farmland. Do everything from harvest, farming in your lush big farmland family farm, cultivate and harvest the fresh crops like wheat, corn, coffee, tomato, kiwi &amp; strawberry in village. Raise cute frenzy animals like chickens, goats and cows, do farming, harvest diverse fresh crops in village big farm game to make your Harvest Country Side Village Farm game a success!  Harvest Country Side Village Farm game is a virtual farming simulator game, in which you will be experienced from a farmer, a chef moreover a businessman. Take care of your little big farmland, do farming, harvest crops in happy farmer game to produce the healthiest &amp; fresh food ingredients decorate your own farmland in Harvest Country Side Village Farm game. Raise cute adorable frenzy animals like goats, chickens and cows in happy village &amp; farm games. Sell your produce via delivery truck, fulfill orders and expand your farming land in this farming game. <br/><br/>Enjoy country life, become a happy farmer, work day &amp; night to harvest, cultivate &amp; do farming in your little farm games. Raise frenzy adorable animals like chickens, goats and cows. Pick your favorite fruits and vegetables from the list, plant &amp; harvest their seeds in farmland, care for them with water, fertilizer, reap your harvest &amp; manage dairy farms. You can use your crops harvest in barn by farmer to make butter, bake a fresh cake, and learn all kinds of other recipes. Share the fresh food with your customers and they will give you money and stars. Earn enough money and you'll be able to build processing plants that can turn your raw goods into exciting new products. As you proceed through different levels in this free farm game you can upgrade various parts of your big farm, from the warehouse where you can store goods, to the processing plants that produce the goods in free farm games. Soon you’ll be producing vast quantities of products and turning over a huge profit from processing plants. There is also your delivery system, a transport truck which will help you sell your fresh produce from farming and village game land to the customers in big city and also to neighboring towns and other village. Not to mention that there are hundreds of shiny new items to decorate your farming game. If you’re tired of other top farm games that require being online to play, we are the perfect option for you since it is an offline game! Play offline farm game without internet connection! Never lose your farmer game progress opportunities because of not having Wi-Fi nearby!<br/><br/>Features:<br/>- Offline Farm Game.<br/>- Enjoy garden Farm life, grow your big farm and harvest your produce in farmer game.<br/>- Take care of your garden farm to produce the most healthy food ingredients.<br/>- Upgrade the warehouse, processing plants, farmland etc.<br/>- Raise adorable animals and manage dairy farms or animal farm village in offline game.<br/>- Buy the decorative objects in the store to make your farmland beautiful &amp; attractive.", "metacritic": null, "released": "2018-08-03", "tba": false, "updated": "2019-10-22T14:22:20", "background_image": "https://media.rawg.io/media/screenshots/a09/a096b6fadd85949c097b557da705927c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Everyone 10+"}