{"id": 851099, "slug": "iron-of-the-eternals", "name": "Iron of the Eternals", "name_original": "Iron of the Eternals", "description": "<p><strong>Missing features and information:</strong></p>\n<ul><li>The game is done after you build the Gust upgrade. If you go to the right place, you can fall off the edge of the world, since that part isn't done yet.</li><li>I didn't manage to add an exit button in time, so just do the classic Alt-F4 if you want to close it.</li><li>There's no volume control unfortunately, but I tried to keep the base volume pretty low, so hopefully it's fine?</li><li>The game saves automatically when you exit from a workbench menu.</li><li>The game loads the save automatically when you start the game.</li></ul>\n\n<p><strong>Instructions:\r\n</strong>\n</p>\n<p>The tutorial is a bit barebones, so here's some extra information. <br/></p>\n<ul><li>Your weight class determines how fast you move and how high you can jump. If you can't make a jump, try dropping wrecks or shedding some armour (from the menu, under Haul Load).</li><li>The blue-ish wrecks can't be dismantled, and can instead be taken to a workbench, where you can build an upgrade if you have all the required things. These particular wrecks can also be left on the ground and their positions will be saved, so you can leave them somewhere if you need to get lighter.</li></ul>\n\n<p><strong>Known bugs:</strong></p>\n<ul><li>If you drop through a platform with down+jump and there's another object on the platform with you, it will also fall through.</li><li>If you drop a wreck while standing at a workbench, you might have some difficulty picking it up again. </li><li>Landing on a moving platform that's moving down will create a weird jitter, but it's essentially just a visual glitch.</li></ul>\n<p>If you run into any gamebreaking bugs, close the game and start it again; it'll load from the last workbench you interacted with.</p>\n\n<p><strong>Key bindings:<br/></strong></p>\n<p>This game can be played with a keyboard or a controller, but it was made with a controller in mind, so <strong>using a controller is recommended</strong>.<br/></p>\n<strong>ACTION</strong><strong>CONTROLLER</strong><strong>KEYBOARD</strong>JumpAZ  /  SpaceAttack<br/>XX  /  K<br/>InteractYEOpen menuStartBackspaceConfirm (in menus)<br/>AZ  /  Space<br/>Cancel/back (in menus)<br/>BLeft shift / Escape<br/>\n<p>\n</p>\n<p><strong>Credits:</strong></p>\n<p><strong>Jaco van Hemert: </strong>Coding, Graphics, SFX, Design<br/><strong>Carel van Hemert:</strong> Music<br/>VTSs from Spitfire Audio<br/></p>\n<p>Made with Unity, LibreSprite, Audacity, and FL Studio<br/></p>", "metacritic": null, "released": "2022-09-15", "tba": false, "updated": "2022-09-16T11:18:33", "background_image": "https://media.rawg.io/media/screenshots/062/0626d243350ff205c0a7073e2fea1f3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jaco van Hemert"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}