{"id": 851126, "slug": "zombis-atack", "name": "Zombis Atack", "name_original": "Zombis Atack", "description": "<p>Zombis Atack es un juego muy adictivo y entretenido.</p>\n<p> Evita que los Zombis te coman el cerebro.</p>\n<p> <strong>Sinopsis:</strong></p>\n<p>Año 2022, ha habido una explosión nuclear y el 95% de la población se ha convertido en zombis y has entrado en un agujero negro, transportándote a la edad media y eres el único caballero que puede leer el poco cerebro que tienen los zombis, porque ellos solo piensan en comer cerebros, buena suerte y protege el 5% de la población que queda en Fuenlabrada.\r\n  </p>\n<p> <strong>Instrucciones del juego:</strong></p>\n<p>- Hay cuatro modos de juego (fácil, medio, difícil &amp; aleatorio.\r\n  </p>\n<p>- Fácil, aparecerá el pensamiento del zombi, con cuatro cerebros.\r\n  </p>\n<p>- Medio, aparecerá el pensamiento del zombi, con cinco cerebros.\r\n  </p>\n<p>- difícil, aparecerá el pensamiento del zombi, con 6 cerebros.\r\n  </p>\n<p>- aleatorio, aparecerá el pensamiento del zombi, con 4,5 o 6 cerebros.\r\n  </p>\n<p>- Cuando el zombi aparezca, saldrá un bocadillo con cerebros y de diferentes colores, debes ir pulsando la secuencia de colores que aparece, cuando pulses el color del primer cerebro, ese cerebro se apagara y debes seguir con el siguiente, así es como acabaras con los zombis.\r\n  </p>\n<p>- Si te equivocas en la secuencia de cerebros, te contara un fallo, cuando te equivoques tres veces, perderás y el juego acaba.\r\n  </p>\n<p>- Evita que el zombi te toque, porque perderás y te comerá el cerebro.\r\n  </p>\n<p>- Eres el único que puede ver la secuencia de los cerebros de colores, evita que se coman los cerebros del 5% de la población.\r\n  </p>\n<p>- cuando hagas la secuencia de colores correcta, acabaras con el zombi y así sucesivamente, te aparecerá un cerebro de los zombis que vayas eliminando y aparte el número de los que llevas.\r\n  </p>\n<p>- Pasaras al siguiente nivel, cuando pases diez pantallas o hayas hecho la secuencia de colores 10 veces.\r\n  </p>\n<p>- los niveles (Medio, Difícil &amp; Aleatorio), están bloqueados, tienes que desbloquearlos, pasando niveles, cuando pases el nivel 10 del modo fácil, desbloquearas el modo medio y así sucesivamente.\r\n  </p>\n<p>- Cuando pases un nivel se pondrán a cero los fallos cometidos, recuerda que solo puedes cometer tres fallos.\r\n  </p>\n<p>- Tienes los botones en la parte inferior de la pantalla, para realizar la secuencia, dependiendo el sistema operativo puedes jugar tocando los botones o presionando las teclas correspondientes.\r\n  </p>\n<p>- Estate atento, por que los botones cambian de posición.\r\n  </p>\n<p>- Los zombis van aprendiendo y cada vez irán mas rápido.\r\n  </p>\n<p>*** En los sistemas operáticos (Windows, MacOS, Linux &amp; HTML5) podrás jugar con el ratón o con el teclado, saldrán las letras correspondientes a los colores. ***\r\n  </p>\n<p>*** En Android indudablemente, las teclas no saldrán. ***\r\n  </p>\n<p><strong> </strong><strong>Características del juego:</strong></p>\n<p>- Niveles ilimitados.\r\n  </p>\n<p>- Guardó la puntuación más alta (Fácil, Medio, Difícil &amp; Aleatorio).\r\n  </p>\n<p>- Juego totalmente gratis &amp; sin anuncios.\r\n  </p>\n<p>- Botón de pausa.\r\n  </p>\n<p>- Seis zombis diferentes.\r\n  </p>\n<p>- Juego de acción con emocionantes sonidos, música y animaciones.\r\n</p>", "metacritic": null, "released": "2022-09-15", "tba": false, "updated": "2022-09-16T11:30:30", "background_image": "https://media.rawg.io/media/screenshots/365/3658c14fdd40a18077ae25e976c4e5fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["Neda Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}