{"id": 85135, "slug": "talking-zoo", "name": "Talking ZOO", "name_original": "Talking ZOO", "description": "Three adorable animals are waiting to play with you at the ZOO!<br/><br/>One fine day three little animals arrived at the ZOO and quickly became great friends. The bravest is Tommy the Tiger who loves to laugh, jump, and spin, but be careful not to touch his belly because it will make him angry. Zack the Zebra is the dancer, whenever he hears music he starts to move his legs and shake his hips! Finally we have Edward the Elephants, a shy little guy who flies when you touch his big ears and is VERY afraid of little mice. Be careful when you touch his trunk, it’s very sensitive!<br/><br/>As a new friend of the ZOO you should help keep everything clean and tidy. So when you see leaves on the ground pick them up! Your new friends will be very grateful. <br/><br/>DISCOVER ALL THE SURPRISES WE HAVE FOR YOU!<br/>Use your fingers to touch the legs, head, and belly of each animal and watch their funny reactions and animations. You can also learn to play the piano with your new friends and have fun playing mini-games where you have to collect all the stars and jump over obstacles.<br/><br/>WHAT YOU CAN DO WITH TALKING ZOO<br/>- They repeat what you say!<br/>- Touch the animals and watch their funny reactions!<br/>- You can learn to play the piano!<br/>- Send personalized messages to your friends!<br/>- Discover all the fun mini-games!<br/><br/>IMPORTANT FOR USERS<br/>Your iPod touch, iPhone, or iPad must have a microphone or headphones with a microphone attached, otherwise the voice recording features will not work.", "metacritic": null, "released": "2012-11-08", "tba": false, "updated": "2019-07-15T03:15:57", "background_image": "https://media.rawg.io/media/screenshots/6e5/6e51339c850b6d673a4a70771ce81a4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Talking Toys"], "genres": ["Family"], "publishers": ["Talking Toys"], "esrb_rating": null}