{"id": 851334, "slug": "vr-internacional-rinconesarte-salas-vip", "name": "VR Internacional Rinconesarte Salas VIP", "name_original": "VR Internacional Rinconesarte Salas VIP", "description": "<p>The Rinconesarte Foundation International Virtual Museum launches its virtual exhibition in its new headquarters located in the VR Cambass Virtual Cultural District of New York.\r\n</p>\n<p>VR Cambass Virtual Cultural District of New York is the 6th Cultural District of New York City and the only virtual district of the Big Apple. It is a virtual tour under the technological platform of VR Cambass, where art, 3D animation engines and digital architecture come together to generate a new strategy that focuses on cultural promotion, dissemination and education.\r\n</p>\n<p>We invite you to take the tour in this wonderful virtual world of art.\r\n</p>\n<p>El Museo Virtual Internacional Fundación Rinconesarte estrena su exposición virtual en su nueva sede ubicada en el Distrito Cultural Virtual VR Cambass de Nueva York.\r\n</p>\n<p>VR Cambass Virtual Cultural District of New York es el sexto distrito cultural de la ciudad de Nueva York y el único distrito virtual de la Gran Manzana. Se trata de un recorrido virtual bajo la plataforma tecnológica de VR Cambass, donde el arte, los motores de animación 3D y la arquitectura digital se unen para generar una nueva estrategia que se enfoca en la promoción, difusión y educación cultural.\r\n</p>\n<p>Te invitamos a realizar el recorrido en este maravilloso mundo virtual del arte.\r\n</p>", "metacritic": null, "released": "2022-09-14", "tba": false, "updated": "2022-09-16T12:59:59", "background_image": "https://media.rawg.io/media/screenshots/69c/69c01f3b6840f5596372d23453344362.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Artnewyork2022"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}