{"id": 851671, "slug": "steam-and-iron-battle-of-port-arthur", "name": "Steam and Iron. Battle of Port-Arthur.", "name_original": "Steam and Iron. Battle of Port-Arthur.", "description": "The game about ironclads.\r\n<p><strong>Steam and Iron. Battle of Port-Arthur</strong> is a navy simulator. Actions take place during Russo-Japanese war near Port-Arthur. The game is about commanding single ship of that era: torpedoboat, destroyer, gunboat, cruiser of even battleship. Player is a commander of ship and manages it by giving orders to his crew and also by using direct control. The major attention in the game is given to navy actions supplemented by route planning and crew management routine operations. In the beginning of XX century artillery fire was the main method of destroying enemy ships so game focuses on it. Player is able to aim guns manually by adjusting aiming horizontally and vertically to achieve the best results. At the same time, there is the possibility to order artillery officer to fire guns while player can manage other important things. For example, repair damages or guide torpedo launchers. The battle damages system includes wide variety of ship parts. Like hull, engine, boiler and rudder compartments, forward and rear bridges, smokestacks and armory. Ship can be affected by flooding and fires. Crew members can be killed or wounded.</p>\n<p>At this time game is under development. We encourage you to try the latest available version by yourself. We are waiting for any of your thoughts and feedbacks in our official group on Facebook.</p>\n<p><strong>The current version is free but we would appreciate any donations. This will help us to understand that our work has value. And also it will allow us to buy some pizzas :) </strong></p>\n<p> https://www.facebook.com/steamandirongame</p>\n<p>https://www.steamandirongame.com/<br/></p>\r\n\r\n\r\nInstall instructions:\r\n<p>Download <em>sailauncher.zip</em> file, unzip it to a folder you want for the game and run <em>sailauncher.exe</em>. It will start downloading the main game which has approximately 1.9GB.\r\n</p>\n<p><strong>In case you see Windows SmartScreen warning screen that prevented this file from running, you can click on \"More Info\" and then on \"Execute Anyway\".</strong>\n</p>", "metacritic": null, "released": "2022-09-13", "tba": false, "updated": "2022-09-16T15:18:38", "background_image": "https://media.rawg.io/media/screenshots/7b9/7b97c2ac0791eee941de7f6ffe3d136b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["arraenster"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}