{"id": 851768, "slug": "la-estrella-de-poder-version-demo", "name": "La estrella de poder - versión demo", "name_original": "La estrella de poder - versión demo", "description": "<p>¿Te gustan los juegos de aventura?\r\n</p>\n<p>Esta es la historia que te invitamos a vivir:</p>\n<p>La destrucción de la Estrella de Poder ha abierto múltiples portales dimensionales que son atravesados por seres demoniacos y un gas que afecta al estado mental de la población. Muchas personas parecen poseídas, se vuelven agresivas y atacan a sus conciudadanos.</p>\n<p>Los maestres de Ciudad Anémona solicitan la ayuda de los Pequeños Héroes de nuestro tiempo para reunir materia de energía con la que formar una nueva Estrella de Poder y cerrar esos portales.</p>\n<p>Comienza la aventura encarnando a un guerrero santo, un arquero,  un mago o un espadachín y reúne a tus aliados. <br/>Entrena a tus héroes para que mejoren su nivel.</p>\n<p>Visita las tiendas de objetos, armas y armaduras y equípate para continuar tu aventura.</p>\n<p>Encuentra los pedazos de materia de energía repartidos por todo el mapa del continente.</p>\n<p>Lucha contra los poseídos que atemorizan a la población.</p>\n<p>Derrota a los monstruos que invaden el territorio.</p>\n<p>[Versión demo del juego] <br/></p>\n<p>La versión completa es de pago. La tienes a tu disposición en el enlace siguiente: </p>\n<p>https://masamsa.itch.io/la-estrella-de-poder-full<br/></p>\n<p>Nuestro agradecimiento a Yanfly por su \"Battle Engine Core\" y su \"Visual HP Gauges\".</p>", "metacritic": null, "released": "2022-09-13", "tba": false, "updated": "2022-09-16T15:58:45", "background_image": "https://media.rawg.io/media/screenshots/0e2/0e2b417fe4b4bd448e43b53ddc847c85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Masamsa Studios"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}