{"id": 851720, "slug": "coletanea-virtual-board-games", "name": "Coletânea Virtual - Board Games!", "name_original": "Coletânea Virtual - Board Games!", "description": "O que é a coletânea virtual?\r\n<p>           A coletânea virtual se trata de uma coleção de trabalhos de jogos de mesa efetuados por alunos em desenvolvimento no curso de Design de Games da unidade Microcamp de Florianópolis, aqui você poderá encontrar vários protótipos de jogos de mesa construídos pelos mesmos para você poder experimentar e ver o quão criativo estes trabalhos podem ser.</p>\r\nComo jogar?\r\n<p>          A coletânea virtual de jogos de mesa usa como ferramenta de emulação para seus jogos a plataforma PlayingCards.io, uma plataforma online que permite você gratuitamente criar uma sala de jogo de mesa multiplataforma para você jogar variados jogos com seus amigos, até podendo em si criar o seu jogo.</p>\n<p>Siga os passos descritos abaixo para iniciar a emulação dos jogos de mesa:</p>\n<ol><li>Abra o site clicando aqui;</li><li>Clique no botão localizado na região superior direita do site com o símbolo de \" + \" para criar uma nova sala;</li><li>Selecione a opção \"Start Blank Room\";</li><li>Aguarde o carregamento da criação de sua sala de jogo, assim que habilitado, clique no botão \"Enter\";</li><li>Dentro da sala, acione o botão com um ícone de maleta localizado na região superior esquerda de sua tela com o nome de \"Edit Table\";</li><li>Com o painel de edição aberto, clique em \"Room Options\";</li><li>Dentro das opções exibidas, clique no botão \"Import from File\";</li><li>Selecione um dos arquivos .pcio presentes dentro do kit da coletânea;</li><li>Aguarde o carregamento e você já pode experimentar o jogo!</li></ol>", "metacritic": null, "released": "2022-09-13", "tba": false, "updated": "2022-09-16T15:38:05", "background_image": "https://media.rawg.io/media/screenshots/182/182b1dddf4a93a078a41a8e169f61df5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Escola Microcamp Florianópolis"], "genres": [], "publishers": [], "esrb_rating": null}