{"id": 851914, "slug": "eras-time-delivery-service-prototype", "name": "Era's Time Delivery Service (prototype)", "name_original": "Era's Time Delivery Service (prototype)", "description": "<p>Era's Time Delivery Service is a turn-based battle game made for Magical Girl Game Jam 6 on the theme \"Service\".\r\n</p>\n<p>Era is a time magical girl who works in a delivery service, boasting she can bring any package to its destination in due time. Today, she must deliver comic pages to a publisher before the deadline, but it is pretty far. Will she be able to make it in time?\r\n</p>\r\nBeat the clock!\r\n<p>In this game, you go through a series of classic-JRPG-style turn-based battles with a party of up to 3 members. Era plays the role of pivot as she can use time skills to advance, delay or swap fighters' turns. She can even rewind a character's state to several turns in the past!\r\n</p>\r\nDevelopment status\r\n<p>The game is still in a sandbox state with a series of battles where you can test various skills with the test character (Era). Heroes have very broad archetypes but only a few skills, and enemies are all alike (except visually). You can always Flee to proceed to the next fight. There are 3 fights that take place on 2 environments, where you progressively unlock more heroes.\r\n</p>\n<p>There are no dialogues / narration between battles either, so I will let you imagine the story!\r\n</p>\r\nHow to play\r\n<p>Download and run the executable for your platform.\r\n</p>\n<ul><li>For the updates done after the submission deadline, during the voting phase, download the zip suffixed with \"jam-voting-phase\" (recommended)\r\n</li><li>For the original jam version submitted right before the deadline, download the zip suffixed with \"jam-release\" (pretty rough, but kept for historical reasons)\r\n</li></ul>\r\nMain menu\r\n<p>You can navigate with the mouse, keyboard or gamepad.\r\n</p>\n<p>Known issue: in order to use the keyboard or gamepad, you may need to hover some button with the mouse at first (you'll see the text color change). After this, your device should be recognized.\r\n</p>\n<p>Known issue: Toggle fullscreen shortcut (see Controls below) doesn't work in the Main menu\r\n</p>\r\nBattle\r\n<p>Battle is done with a traditional command box interface, that you can navigate with the keyboard, gamepad or mouse. To select targets for an action, you can also use the mouse (click once to select target, click a second time on selected target to confirm it).\r\n</p>\n<p>Once you defeat an enemy squad, the next one will arrive and you start the next fight fully restored.\r\n</p>\r\nControls\r\nKeyboardGamepadMouseActionDirectional arrows or WASD/ZQSD\r\nD-pad or left stick\r\nHover in menus, click once on target\r\nNavigate in menus, select target\r\nSpace / Enter\r\nSouth button\r\nClick in menus, click on selected target\r\nConfirm\r\nEscape\r\nEast button\r\n\r\nCancel selection / Back\r\nAlt + Enter / F11 / Ctrl + Meta + F\r\n\r\n\r\nToggle fullscreen\r\n\r\nTools\r\n<ul><li>Engine: Unity 2022 + custom RPG Framework by komehara\r\n</li><li>Audio: Cubase, Serum\r\n</li><li>Art: Adobe Photoshop, Krita, Affinity Designer, Inkscape\r\n</li><li>Code: Jetbrains Rider\r\n</li></ul>\r\nResources\r\nFonts\r\n<p>Fonts downloaded on Google Fonts:\r\n</p>\n<ul><li>Title text: Dancing Script by Pablo Impallari\r\n</li><li>Common text: Manrope by Mikhail Sharanda\r\n</li></ul>\r\nSprites\r\n<ul><li>Additional enemies: Ækashics Librarium Bundle by Ækashics\r\n</li></ul>\r\nCredits\r\n<ul><li>komehara: Game design, Writing, Programming, Character art (Hero), Graphic design\r\n</li><li>Cicero: Game design, Writing\r\n</li><li>Milchtüte: Character art (Hero)\r\n</li><li>An Angelineer: Character art (Enemy)\r\n</li><li>SquaredUnicycle: Environment art\r\n</li><li>Everett Fischer: Music, Sound design\r\n</li><li>highintheautumnsky: Music\r\n</li></ul>", "metacritic": null, "released": "2022-09-12", "tba": false, "updated": "2022-09-16T16:58:15", "background_image": "https://media.rawg.io/media/screenshots/285/285a292e62cf4041709b9b8524141e12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["komehara", "highintheautumnsky", "NiclasArenz", "Supremechykkaslayer"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}