{"id": 85197, "slug": "candys-potion-halloween-games-for-kids-free", "name": "Candy's Potion! Halloween Games for Kids Free!", "name_original": "Candy's Potion! Halloween Games for Kids Free!", "description": "It’s trick or treat time - the most bewitching time of the year! <br/><br/>This night Candy witch decided to put aside her witchy business for a while and cook something special for the upcoming Halloween party – the main holiday of witches, wizards, enchanters, magicians, sorcerers and all fantastic creatures of all kind. But it turned out that Candy didn’t have necessary ingredients! So, she searched through her spell books and found a very powerful charm which turns creepy magic objects into delicious sweets!<br/><br/>Help this little witch make Halloween candies or she’ll be late for the party of the year! <br/><br/>Here’s what you need to do, apprentice. Brew magic potions, mix various ingredients and cast spells to create yummy treats for this exciting Halloween adventure! Pumpkins, spiders, and bats have never been so sweet! Check every possible combination. Get all candies! Mmmm… Yummy! <br/><br/>Features of this spookctacular kid Halloween witch games free:<br/>-\tTwo sweet characters: witch Candy and her adorable Halloween Cat;<br/>-\tCombine spooky ingredients: spiders, elixirs, Halloween pumpkins, scary cupcakes, poisoned apple, mushroom, zombie, skulls, bats, eyes, trap, clover, ghosts;<br/>-\tMake candies in this marvelously tasty magical adventure which every sweet tooth will appreciate;<br/>-\tEerily fun games for Halloween for toddlers and kids;<br/>-\tStunning art, animation and sounds will surely contribute to the scary atmosphere; <br/>-\tInteractive sweet treats cooking games encourage child’s development of attention, logic thinking, memory, cognitive skills, fine motor skills, etc.; <br/>-\tInterface and touch controls are specially designed for toddlers and preschool children 2 – 4 years old;<br/>-\tThese Halloween games free for girls work perfectly on smartphones and tablets;<br/>-\tOne can’t lose in this easy toddler Halloween cooking games so your little one won’t get upset that something’s going wrong. They’ll want to replay this mini game again and again!<br/><br/>Candy’s Magic Potion games is games of Halloween app in educational series that is good for both phones and tablets so that your little ones could practice their skills everywhere and whenever they want!<br/><br/>Grab potions and let’s play magic spell casting games!", "metacritic": null, "released": "2016-10-07", "tba": false, "updated": "2019-08-16T06:02:59", "background_image": "https://media.rawg.io/media/screenshots/58f/58f152eb78bf0192bb2845475cf21b7d.jpg", "website": "http://smartkids-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gadget Software Development and Research"], "genres": ["Adventure"], "publishers": ["Gadget Software Development and Research"], "esrb_rating": "Everyone 10+"}