{"id": 851928, "slug": "gods-of-defense", "name": "Gods of Defense (itch)", "name_original": "Gods of Defense (itch)", "description": "<p><strong>Gods of Defense</strong> is a Roguelike Tower Defense game set on a procedurally generated map.<br/></p>\n<p>Hotkeys:\r\n</p>\n<ul><li>WASD - Pan camera\r\n</li><li>QE - Rotate camera\r\n</li><li>Tab - Cycle through time fast forward\r\n</li><li>Space or P - Pause/Resume game\r\n</li></ul>\n<p>The God of your choosing stands atop a temple at the center of the map. The corrupted enemies are trying to destroy the temple in waves. After every wave you get to banish the enemy gates further from the temple, thus revealing more of the map. You have to banish these gates all the way to the Cave of their origin. The victory is achieved when you have destroyed all the Caves.<br/></p>\n<p>After successfully defending against number of waves you are awarded Boons that give you more options - new Towers, bulk upgrades, temporary advantages. The choices you make lead to a unique defense strategy.</p>\n<p>In addition to <strong>Gold</strong> you also earn <strong>Faith</strong> when you kill enemies. Faith is a permanent currency that you can use to unlock several improvements.</p>\n<p>The enemy offensive is not just limited to attack on the Temple. Some enemies corrupt the towers as they pass by them. When <strong>C</strong><strong>orruption</strong> exceeds certain limit, you have to absolve it by accepting one of the presented C<strong>urses</strong>.</p>\n<p>In addition to standard weapon towers, you can also kill enemy with more style by summoning <strong>Tornadoes</strong>. You will also face natural calamities like <strong>Rain, Snowstorm, Earthquakes, Thunderstorms</strong>. Some of them will help you, while others will make your job difficult. But all will be enjoyable.</p>\n<p>Overall <strong>GoD</strong> offers you multitudes of recipes to build a delicious strategy.</p>\n<p>[The game is still in early stage of development. Your feedback is welcome.]</p>", "metacritic": null, "released": "2022-09-12", "tba": false, "updated": "2022-09-16T17:05:29", "background_image": "https://media.rawg.io/media/screenshots/d87/d87635bb7b243562ed29fcee4a19bec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["bluemath"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}