{"id": 852244, "slug": "aerons-descent", "name": "Aeron's Descent", "name_original": "Aeron's Descent", "description": "<p><strong>Aeron's Descent </strong>is the first chapter of<strong> Vaults Of Vvorr - </strong>a gravity-defying dungeon crawler adventure without the crawling but lots of frantic jumping, dashing, sliding and running on walls and ceilings! Explore gloomy caves, drop down huge mine shafts, enter the many vaults to collect treasures, battle undead creatures and recover the Seals of Vvorr!<br/></p>\n\n<p>The seals are needed to defeat the evil Vvorrlock, a mean mage who has unleashed an army of undead creatures upon the once peaceful landscapes of Plantylon. Our hooded hero Aeron is determined to put an end to the Vvorrlock's reign of terror and will dispose of his many minions with well-aimed kicks in their heads and his throwing knives.<br/></p>\n<p><strong>Features</strong></p>\n<ul><li>gravity-defying retro arcade platformer action that allows to run on walls and even ceilings</li><li>one big overworld that can be traversed without loading times, interconnecting many caves, mine shafts and vaults to explore</li><li>XP system: Level up to unlock and improve skills like knife throwing, double jumping, air dashing and smashing</li><li>challenges like speedrun areas and bug racing</li><li>unlockable awardments (in-game achievements)</li><li>support for keyboard and gamepad controls (gamepad recommended, optimized for Xbox controller)</li><li>original SID chiptune soundtrack and pixel art graphics</li></ul>", "metacritic": null, "released": "2022-08-17", "tba": false, "updated": "2022-09-16T19:08:58", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dc7741084a7db2f5c0a74ec746a572f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["oddworm"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}