{"id": 852438, "slug": "deadhappy", "name": "DeadHAPPY", "name_original": "DeadHAPPY", "description": "<p>Welcome to the World of Survival Horror!<br/><br/>DeadHAPPY is a Co-op/PVP, Single Player/Multi Player, Survival and Crafting game in a Persistent Open World with a Unique and Colourful Stylized look.<br/><br/>Survive Alone or with Friends. Gather Food, Water and Weapons, Fight against the Zombie horde or Other Players! Craft Gear, Harvest Resources from Nature or Loot your Fellow man!<br/><br/>The World Has Ended. The Zombie Hordes await you, and you know they're 'DeadHAPPY' About it!</p>\n<p><strong><em><br/>(Please Be aware I am a 1 Person Development Studio and that This is an Early Access Pre Alpha, Parts of the Map my be unfinished and there may be unforseen bugs/issues that will only come to light during large scale testing.)<br/></em></strong></p>\n\n<p><strong>LOOT: </strong>Pillage Houses, Stores, Police Stations, Trailer Parks, Tents, Cars and More! Rummage through Recycling bins, Trash Cans. Rifle through a Corpse's Pockets and more!<br/><br/><strong>SUPPLIES:</strong> Hunger, Thirst and Stamina System Based on a Heavily Modified version of SGKV2. Gather Tinned Food, Water, Soda, Fresh Fruit and more, Hunt and Kill animals to cook for food. Locate Essential Medical Supplies such as Bandages, Pain Pills, Med Kits and more!<br/><br/><strong>WEAPONS: </strong>Multiple Melee Weapons, Included but not limited to: Axes, Katanas, Meat Cleavers, Golf Clubs, Baseball bats and the always faithfull spiked plank! In addition to melee weapons are multiple Ranged Weapons with Several Ammo types, Magazines and attachments like Red Dot Sights and Supressors!<br/><br/><strong>CRAFTING:</strong> Locate a Workbench in the world and you can Craft all kinds of useful gear including other Workbenches. Alternatively you can make basic Weapons like the Axe (used for Cutting Down Trees and the Pickaxe for Mining stone and Ores! If thats not enough, why not take that old Baseball Bat and some scrap Tin Cans and craft yourself a Spiked bat! You Can craft Campfires, basic Cardboard clothing, cloth, bandages, Improvised Grenades, Bowls, Saw Blades and more to come soon!<br/><br/><strong>INTERACTION: </strong>Obviously the Post Apocalyptic world isnt exactly 100% functional but a lot of useful stuff is still lying around, Found a BBQ? Throw some wood in and cook up some Dinner! Found a Gas Grill? Well throw in some Iron Ore and smelt up some bars! Same thing goes for any Camp Fires, Fire Pits, WorkBenches etc!<br/><br/><strong>COOKING: </strong>As mentioned, there is a cooking component and most food stuffs can be cooked that make sense to cook! Meat, Apples etc, Find an abandoned grill, of craft a camp fire or fire pit and get cooking! Some Cooking appliances use different fuels for example a Gas Grill Requires Propane. Smelt Down the Ores you mine and Tin Cans you collect into Iron Bars and Aluminium for Crafting.<br/><br/><strong>DRAG AND DROP INVENTORY:</strong> Elegant drag and drop style inventory to make item management smooth and enjoyable! It's also incorporated into the Crafting System so if you want to place that Campfire you have in your inventory down on the floor, just drag it out of your inventory and drop it on the floor!<br/><br/><strong>OPEN WORLD</strong>: Explore a hand crafted 3kmx4km world (I am a one man development team and creating the world is very time consuming) but I am Aiming for 10kmx10km eventually!<br/><br/><strong>RESOURCES: </strong>Harvest Plants to Craft Rudimentary Cloth and Cardboard, Berries from Bushes, Pick Mushrooms, Carrots, Potatoes, Use Picks to Mine stone and Iron Ore, Fuel Gas Grills with Propane and Craft Impromptu Weapons from Wood and Scrap Cans! Smelt Scrap Cans back down into Aluminium and More.<br/><br/><strong>PEER TO PEER MULTIPLAYER:</strong> Take your Singleplayer Adventure Online by Hosting a Server! (Requires Steam to Be Installed and for you to be Signed into it, Same for Joining Players as DeadHAPPY uses Advanced Steam Sessions as the Multiplayer Backend). Or join your friends game (Joining Players characters are server specific, so when joining a new server you also create a new character) using the Built in Server Browser.<br/></p>\n<p><em>Multiplayer is currently beta so please be patient and expect some issues as it hasnt undergone large scale multiplayer testing as of the current build.</em><br/></p>\n<p><strong>CHARACTER CUSTOMIZATION:</strong> Over 65 Unique Character skins to Choose from, from FBI and County Sheriffs, to Farmers and Urbanites! In addition, find, loot and craft additional accessories such as Football helmets, Sheriffs hats, Hockey masks etc with more being added every day!<br/></p>\n<p><strong>RECOMMENDED SYSTEM SPECS:</strong><br/><br/>AMD Athlon(tm) X4 950 Quad Core Processor         3.50 GHz or Equivalent/Better<br/>16GB RAM or Better<br/>Nvidia GeForce 1050ti 4Gb Equivalent or Better<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-16T20:29:56", "background_image": "https://media.rawg.io/media/screenshots/aef/aefd0d119a95b7f28cb2a62c6f938eb6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 394, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GrumpyMunkyIndy"], "genres": [], "publishers": [], "esrb_rating": null}