{"id": 85249, "slug": "lasertron-laser-harp-synth", "name": "Lasertron Laser Harp Synth", "name_original": "Lasertron Laser Harp Synth", "description": "Your very own laser harp at you fingertips! Now with added Midi output to control notes, and expression control with any compatible  MIDI device<br/> Lasertron -the realistic simulation of a laser harp as used by Jean Michel Jarre. Featuring a choice of sounds, laser colours and note scales. Choose from traditional sounds like koto, dulcimer and strings and also the actual sound to play Second Rendez-Vous Part III.  Select note scales like chromatic and diatonic but also the actual notes for Second Rendez-Vous Part III<br/>Comments so far:<br/>\"Impressive\", <br/>\"Why has this not been done before !\",<br/>\"A must for JM Jarre fans\",<br/>\"Amusant\"-5 Stars<br/><br/>* 3 laser colours<br/>* 5 note scales including the correct notes for Second Rendez-Vous Part III, diatomic, chromatic etc<br/>* 16 different sounds including awesome synth and pads all in stereo<br/>* Realistic laser simulation<br/>* Adjustable angle and spacing of lasers - handy for iPhone smaller screen space: Scroll left and right lasers to adjust angles.<br/>* Ambient fog<br/>* Out of focus cityscape backdrop that puts you in the shoes of Jean Michel Jarre<br/>* Low memory so you can download now!<br/>* Available on iPhone, iPad and iPod touch<br/>* MIDI output: While connected to compatible to MIDI device you can control notes as well as (via position of laser), pressure, velocity, modulation or  custom CC control change code such as  or specific  message for your synthesizer. <br/>#Check out the video demo on  the \"BeatsnBobs Web Site\" link<br/>Be the envy of your friends when they see you play with the Laserton!<br/><br/>If you have any issues or suggestions please email us at info@beatsnbobs.com<br/>Please try this before leaving a negative review so we can fix it as soon as possible. Thank you.<br/><br/>If you like this then you may like our other apps", "metacritic": null, "released": "2012-08-31", "tba": false, "updated": "2019-07-30T09:46:34", "background_image": "https://media.rawg.io/media/screenshots/cae/cae0b3dea50e5ed17880beb6c1512d4a.jpg", "website": "http://www.youtube.com/watch?v=hWUbh1zwSds", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rob Wilmot"], "genres": ["Simulation"], "publishers": ["Rob Wilmot"], "esrb_rating": null}