{"id": 8525, "slug": "dangerous-hd-null-space", "name": "Dangerous HD (Null Space)", "name_original": "Dangerous HD (Null Space)", "description": "&amp;quot;Dangerous is a Console-Quality iOS Game&amp;quot; -148apps.com<br/><br/>&amp;quot;2011 Achievement for Outstanding Original Soundtrack&amp;quot; -iFanzine.com<br/><br/>&amp;quot;Dangerous is a space simulation that has incredible depth.&amp;quot; -iReviewT.com (scored A-)<br/><br/>&amp;quot;Dangerous is without a doubt (no, seriously) the most robust space adventure available on iOS&amp;quot; -148apps.com<br/><br/>&amp;quot;Dangerous is well worth the money...&amp;quot; -spacesimcentral.com (5 stars)<br/><br/>&amp;quot;For people who want a really engaging, in-depth experience... Very cool and very fun...&amp;quot; -TheDaily.com<br/><br/>&amp;quot;Another interesting feature was the &amp;quot;Romance&amp;quot; option&amp;quot; -unboundgamer.com<br/><br/>&amp;quot;An astounding level of depth takes Dangerous where few space sims have gone before ... offering factional allegiance and NPC partner systems that are sure to whet the genre fan’s appetite.&amp;quot; -iFanzine.com<br/><br/>&amp;quot;The only &amp;quot;true&amp;quot; 4X on [mobile]?&amp;quot; -myandrogames.com<br/><br/>&amp;quot;This game is basically an Eve Online clone ... Galaxy on Fire 2 while a fun game is child&amp;#39;s play compared to [Dangerous]&amp;quot; - va2k0r on TouchArcade forums<br/><br/>Dangerous is an epic 3D sandbox space combat RPG set in an open and living universe with an immersive and riveting story. You have been freed from cryo prison a century later, and must discover the truth. Are you the feared war criminal who will destroy all life or the savior of the universe? Gather your wingmen and travel the galaxy in search of answers. Along the way, you&amp;#39;ll encounter a Universal AI, a shadow group pulling history&amp;#39;s strings, a princess, a schizophrenic robot, a beautiful lieutenant of the Royal Navy, a fearsome mercenary, a suicidal slave, and a playboy fighter ace.  <br/><br/>Dangerous is a game that is 3 years in the making! It features:<br/><br/>- 3D real-time sandbox game built with Unity game engine<br/>- metallic shader, lighting, particle effects, lens flare, explosions, fx<br/>- space combat RPG with extensive skill tree<br/>- open and living universe where 600+ ships fly around autonomously<br/>- epic story with dialogue system that allows real choices<br/>- recruit 6 wingmen and 2 can fly with you at a time<br/>- even discover romance with another wing pilot<br/>- recruit 5 corporate pilots who can fly trade routes on your behalf<br/>- trade, fight, mine, pirate, scan for derelict ships and wormholes<br/>- many mission types: epic, freelance, dynamic, wingman acquisition, faction loyalty<br/>- deep combat mechanics, AI, and faction standings<br/>- 20+ ships, 180+ modules, 33 solar systems with a unique follow-through-warp mechanic<br/>- 15+ factions to vie favor or destroy<br/>- cinematic camera shows you the action when it happens<br/>- fly manually with or without Newtonian physics or use autopilots exclusively<br/>- 22 track theatrical-quality award-winning soundtrack by renown composer, Sean Beeson", "metacritic": null, "released": "2012-08-16", "tba": false, "updated": "2019-10-22T14:29:57", "background_image": "https://media.rawg.io/media/screenshots/493/4936e16dc20fd00793db0ba6c9cf1524_GE4MiB4.jpeg", "website": "http://binaryhelix.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["XP"], "genres": ["Simulation", "Arcade"], "publishers": ["XP.COM"], "esrb_rating": "Teen"}