{"id": 852585, "slug": "hells-gate-chapter-1", "name": "Hell's Gate: Chapter 1", "name_original": "Hell's Gate: Chapter 1", "description": "<p><em>A young man walks out of an elevator and into hell. With puzzles and danger lurking around each corner, can you find your way back to reality or die in agony?</em></p>\n<p>♦<br/></p>\n\n<br/>\n\n<p>♦<br/></p>\n<p><strong>Note: this demo contains the entirety of chapter 1 of Hell's Gate. As it is a demo the game is subject to change upon full release. See any content warnings at the bottom of the page.</strong><br/></p>\n<p><strong>This game is intended for an audience of 16 or older.</strong></p>\n<p>♦</p>\n<p>Hell's Gate is a horror puzzle adventure game made in RPG Maker inspired by classics like The Witch's House and Misao.</p>\n\n<p><strong>Features:</strong><br/></p>\n<ul><li>Be it the environment or disgusting monsters, there's many ways to face your dark end. Each death sports a unique animation with graphic depictions of gore in a pixel art style.</li><li>Navigate your ways through puzzles as you explore unique areas.</li><li>With a focus on creepy atmosphere over spine chilling terror, a sense of tongue in cheek dark humor is present throughout the game.</li><li>A custom made soundtrack.</li></ul>\n<p>(More features will be added in the full version.)</p>\n\n<p><strong>Average play time:</strong> 1 h, 30 min</p>\n<p><strong>Controls: </strong>arrow keys to walk, Z to interact, X for inventory, C to attack, ESC for menu<br/></p>\n<p>♦<br/></p>\n<p><strong>Note regarding the full release: </strong>this is a hobby project done during my free time after work, thus it may take a long while before the full version is released. The full version will be free.</p>\n<p>♦<br/></p>\n<p>CW (contains light spoilers, click to expand):</p>\r\nDeath<br/>Blood and gore<br/>Parental neglect<br/>Minor swearing\r\n<p>Credits:<br/></p>\n<p>Scripts:<br/>Remember event position - Shaz<br/>Gameover images - HimeWorks<br/>Symbol dial system - HimeWorks<br/>Overlay maps - HimeWorks<br/>Camera target - HimeWorks<br/>Preserve data - HimeWorks<br/>Tile swap - HimeWorks, Rycochet<br/>Disable dash - Ixfuru<br/>Fix picture to map - modern algebra<br/>Pathfinding - Jet<br/>Basic message SE - Vlue<br/>Ace message system - Yanfly<br/>Galv's message busts - Galv<br/>Basic module - Victor Sant<br/>Step sound - Victor Sant<br/>Enhanced save - Levi Stepp<br/>V's Custom Animated<br/>Title Scene - Vindaca<br/>Keyboard Manager - Zalerinian<br/><br/>Sound effects provided by:<br/>Zapsplat<br/><br/>Additional sound effects+everything else:<br/>Eko-Dev</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-16T21:28:57", "background_image": "https://media.rawg.io/media/screenshots/f98/f98d3b28f1c1c3dabe19e7f68444193e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Eko Dev"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}