{"id": 85257, "slug": "infinite-flight", "name": "Infinite Flight", "name_original": "Infinite Flight", "description": "Infinite Flight offers the most comprehensive flight simulation experience on mobile devices, whether you are a curious novice or a decorated pilot. Explore high definition scenery in regions from around the world with our diverse inventory of detailed aircraft, tailoring each flight by choosing your time of day, weather conditions, and aircraft weight configuration. <br/><br/>Features:<br/><br/>• Dozens of aircraft in a diverse fleet of airliners, general aviation and military aircraft (subscribe to Infinite Flight Pro to unlock all aircraft)<br/>• Multiple regions featuring high definition satellite imagery, accurate topography and all major airports with precise runway and taxiway layouts<br/>• Customizable time of day and weather conditions (real time or custom)<br/>• Realistic atmospherics with the sun, moon, stars, and low-level fog.<br/>• Autopilot (supports control of all flight parameters, NAV mode to follow your flight plan, and auto land on select aircraft)<br/>• Easy-to-use flight planning system with accurate fixes and Navigational Aids<br/>• Engine startup and shutdown<br/>• Instrument Landing System (ILS)<br/>• Advanced replay system<br/>• Weight and balance configuration<br/>• Aircraft cockpit and door animations, suspension animations, and wing flex, on select aircraft.<br/><br/>Subscribe to Infinite Flight Pro for an all-access experience which allows you to fly anywhere in the world with live weather and our entire fleet of aircraft. Join thousands of other pilots and air traffic controllers for the most engaging online flight simulator experience available today! <br/><br/>Infinite Flight Pro subscription benefits:<br/>• Join thousands of other pilots for a global multiplayer experience<br/>• Fly the world with millions of square miles of high definition scenery with access to over 25,000 airports (no region lock-in)<br/>• Enjoy all available aircraft <br/>• Act as an Air Traffic Controller (minimum experience grade required)<br/>• Fly through live weather and winds aloft <br/>• Subscription Options: 1 Month, 6 Months, and 12 Months<br/>• Payment will be charged to iTunes Account at confirmation of purchase<br/>• Subscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end<br/>of the current period<br/>• Account will be charged for renewal within 24-hours prior to the end of the current period, and<br/>identify the cost of the renewal<br/>• Subscriptions may be managed by you and auto-renewal may be turned off by going to your user Account Settings after purchase<br/><br/>Note: <br/>Internet connection (WiFi or Cellular) is required to use Infinite Flight.<br/><br/>Privacy Policy and Terms of Service:<br/>https://goo.gl/zBteBg", "metacritic": null, "released": "2012-03-19", "tba": false, "updated": "2023-02-05T14:11:56", "background_image": "https://media.rawg.io/media/screenshots/38b/38b6637e26a47c7f2bed247b501ae91d.jpg", "website": "https://www.infinite-flight.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 2, "platforms": ["iOS"], "developers": ["Flying Development Studio", "Infinite Flight"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Flying Development Studio", "Infinite Flight"], "esrb_rating": null}