{"id": 852662, "slug": "setting-sun-bigshu", "name": "Setting Sun (BIGSHU)", "name_original": "Setting Sun (BIGSHU)", "description": "<p>   -You are an ordinary college student at the police academy, and a sudden recognition of your parents has left you almost without everything. What secrets are hidden in the badge and flash drive left behind by your biological parents, why is your kind and nagging adoptive father silent about your origins, is the nice gentleman who helped you in times of trouble really harmless, what are you hiding from the uncle you met on the road and the brother next door you grew up with? The seemingly peaceful city of S is in fact a treacherous place, and what choice will you make in the end when you have that mysterious USB stick?</p>\n<p>   -You are an ordinary college student in a police academy, and unfortunately you have just been expelled from school. You are an ordinary college student in the police academy, and unfortunately you have just been discharged from school. The underground gangs on the forums, the promising young bosses in the business world, all these seemingly unrelated characters, are entangled with you because of the flash drive from your dead biological parents, as well as your childhood friends and your adoptive father who seems to have a hidden agenda, who will be the one who will finally be by your side.</p>\n<p>   -The Sunset Project is a visual novel about a suspenseful romantic drama in a seemingly peaceful but dangerous city, where you play a college student who leaves school and becomes involved with four characters around a USB stick, a relic of his biological parents.</p>\n<p>   -You grew up with an adoptive father, but the sudden death of your biological parents disrupts your peaceful life. The flash drive, which is watched by many forces, may attract not only the fearful danger, but also the people who try to step into your life ......</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-16T22:00:00", "background_image": "https://media.rawg.io/media/screenshots/cde/cdee5634f1ed7a0c35d88d071b5e1870.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BIGSHU"], "genres": [], "publishers": [], "esrb_rating": null}