{"id": 852635, "slug": "astro-jhones-a-retro-space-adventure", "name": "Astro Jhones: A RETRO space Adventure", "name_original": "Astro Jhones: A RETRO space Adventure", "description": "<p>You are a legendary space ranger : ASTRO JHONES ... You, a brilliant astronuat was sent on a mission to find the planet AJUTA and explore. You were able to arrive successfully but your ship crashed into the surface it did no harm but damaged your engine. ARE YOU STRANDED???... OR....ARE YOU going to collect the needed resources from this planet and make your own engine and get back home SAFELY??? Collect enough RUMENIUM (coin like things) to make your fuel. BEWARE of the blobs, robots and the fire (JUMP ON THEM *ps ; not the fire)The blue power up gives you a life the red one (comes in level 2) gives you another life and you can attack with X when you get it or the green power up... to get them you need to have 2 lives</p>\n<p>This game was created by Swarna Rawana Dias (SRD) &amp; Prawara Bhashana Dias the programming language    Scratch 3.0. Based on the game engine ; \"Tile Scrolling  Platformer\" by the scratcher @griffpatch,  Astro Jhones : A RETRO Space Adventure contains artwork  based on the engine`s original artwork and original artwork  created by Swarna Rawana Dias. The code is also the same.  While the music does not belong to anyone hence it is  copyright free the original artwork and code created by  Swarna Rawana Dias belongs to him and the code or artwork, if included from the engine belongs to the original creators of the original artwork or code.<br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-16T21:47:33", "background_image": "https://media.rawg.io/media/screenshots/bea/bea1d63c54b27ba944552dee5368949f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 49, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["SRD"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}