{"id": 85268, "slug": "jingle-bells-free-a-christmas-carol-for-kids", "name": "Jingle Bells Free: A Christmas Carol for Kids", "name_original": "Jingle Bells Free: A Christmas Carol for Kids", "description": "Dashing through the snow, in a one horsed open sleigh? Jingle Bells is a musical app for kids and toddlers. Join Santa, Rudolph and Frosty sing christmas carols across the north pole. Jingle Bells will get your little ones smiling and singing for Christmas!<br/><br/>“Jingle Bells is a fantastic christmas app, the music is lovely and the snowman building game is fabulous”<br/>-Kindergarten Teacher<br/><br/>• Musical Sing alongs<br/>Jingle Bells Xmas is about the music! Sing christmas carols across the north pole. Featuring the entire songs of \"Jingle Bells\" and \"We Wish You A Merry Christmas.\" Every scene has a unique set of lyrics, play and learn as the song goes from lyric to lyric, it is so much fun for learning and playing!<br/><br/>• Build a snowman!<br/>Help frosty get ready for the coldest days of winter, dress him up in thousands of variations. There is everything from noses, hats, scarfs, arms and buttons! If you build him correctly you can even give your snowman special super powers, can you turn him into a super snowman!<br/><br/>• Professionally Recorded Music<br/>Our music is all professionally recorded. You can count on easy listening christmas music that is calming and enjoyable, even when the sound is all the way up!<br/><br/>Do you like trivia? Believe it or not, Jingle Bells was originally written for Thanksgiving!!!  Jump into the holiday season with Jingle Bells, Merry Christmas!", "metacritic": null, "released": "2011-11-03", "tba": false, "updated": "2019-07-30T10:16:30", "background_image": "https://media.rawg.io/media/screenshots/d14/d14dfe69d92cb027101bb4aea9ae8797.jpg", "website": "http://www.tigerstripesllc.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tiger Stripes"], "genres": [], "publishers": ["Tiger Stripes"], "esrb_rating": null}