{"id": 852725, "slug": "rukimins-disappointing-adventure-shobomi-and-the-p", "name": "RUKIMIN's Disappointing Adventure! ~SHOBOMI AND THE PHANTOM RUINS~", "name_original": "RUKIMIN's Disappointing Adventure! ~SHOBOMI AND THE PHANTOM RUINS~", "description": "Action game suitable for live game play and streaming, which looks cute but full of unreasonable traps!<br/>「RUKIMIN's Disappointing Adventure!」<br/><br/>\"RUKIMIN's Disappointing Adventure!\" series is a 2D side-scrolling action game in which you control Shobomi, a cute cat character, and aim for the goal!<br/>The second in the series!<br/>Join the \"Shobomi Expedition\" and explore the phantom ruins full of traps!<br/><br/><br/><br/>Unpredictable traps everywhere! A lot of unpredictable traps that will make you shout, \"How is this possible!!?\" were prepared.<br/>For example, when you try to pick up a coin, you are trapped in iron bars, and when you are stuck, spikes fall on you, or when you pick up a key, you are crushed because you cannot bear the weight of the key. The game is full of traps that you cannot even imagine.<br/><br/><br/>We assume that the main target players are live game players and streamers.<br/>As a secondary target, we are targeting players who like to play 2D platformers with high difficulty level.<br/><br/><br/>We want the game to be delivered and played live, and for the audience to get excited by enjoying the reactions of the distributors.<br/><br/>In addition, we hope that the distributors and the audience will cooperate with each other to find solutions by communicating and thinking of ways to avoid the traps together.", "metacritic": null, "released": "2022-09-17", "tba": false, "updated": "2022-09-19T03:43:57", "background_image": "https://media.rawg.io/media/screenshots/5e1/5e131595da995b198cb1359dc487546c.jpg", "website": "http://rukimi.happy888.net/syoboruki/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RUKIMIN."], "genres": ["Action", "Casual", "Indie"], "publishers": ["RUKIMIN."], "esrb_rating": null}