{"id": 85272, "slug": "stylo-101-stylophonesh-101", "name": "Stylo-101 (Stylophone+SH-101)", "name_original": "Stylo-101 (Stylophone+SH-101)", "description": "What do  you get if you cross a Stylophone with the famous Roland SH-101? <br/><br/>Well We have circuit-bent a virtual Stylophone and added Roland SH-101 modifications. You can create wacky and eerie sounds to meaty bass lines. As well as the Stylophone sound, you now have an extra oscillator driving a sawtooth wave with filter and resonance from the SH-101. You can adjust the mixer for each oscillator and the LFO can control oscillators and amp. We have increased the LFO speed and depth of the pitch modulation. We have also added an SH-101 style sequencer for creating bass lines or arpeggios. It is still monophonic but the notes will continue to decay if you release your finger before playing another key. You can also play over the top of the sequence while its playing. Video demo now on Youtube.<br/><br/>2 oscillator monophonic synth<br/>oscillator 1: saw, tri, square<br/>oscillator 2: SH-101 Saw with SH-101 filter, SH-101 resonance (4 preset levels) and detune<br/>LFO-pitch<br/>LFO-AMP<br/>Master Transpose<br/>Mixer for osc1 and osc2<br/>Arp/sequencer with tempo<br/>Release controls notes played and sequencer<br/>Attack controls notes only<br/>2 oscillator monophonic synth<br/>oscillator 1: saw, tri, square<br/>oscillator 2: SH-101 Saw with SH-101 filter, SH-101 resonance (4 preset levels) and detune<br/>LFO-pitch<br/>LFO-AMP<br/>Master Transpose<br/>Mixer for osc1 and osc2<br/>Arp/sequencer with tempo<br/>Release controls notes played and sequencer<br/>Attack controls notes only<br/><br/><br/><br/>We our passionate about creating ways to make music and sounds. If you have any issues, bugs or suggestions please email us at info@beatsnbobs.com so we can fix or improve things. Please try this first before leaving negative feedback. We want you to be happy about our products.<br/>If you like this app then check out our site for similar apps.<br/>www.beatsnbobs.com", "metacritic": null, "released": "2012-11-28", "tba": false, "updated": "2019-07-30T09:46:06", "background_image": "https://media.rawg.io/media/screenshots/08d/08d9b7e20920931278b05255bddee5f5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rob Wilmot"], "genres": ["Simulation"], "publishers": ["Rob Wilmot"], "esrb_rating": null}