{"id": 852797, "slug": "fionas-farm", "name": "Fiona’s Farm", "name_original": "Fiona’s Farm", "description": "Solve puzzles to unlock adventures &amp; turn the farm into a paradise!<br/><br/>Welcome to Fiona’s Farm! The most exciting farm adventure full of mysteries and love triangles. Solve colorful blast puzzles to earn energy and coins. Then, use them to help Fiona renovate the damaged buildings and hearten the farm. A breathtaking journey awaits!<br/><br/>Let us quickly introduce our lovely Fiona and her story;<br/>Right after leaving her fiance at the altar, Fiona moves to the countryside to help her Grandma. Fully dedicated to repairing the farm after the horrifying hurricane, Fiona finds peace in nature. But then, her father’s past starts to haunt her. Along the way, of course, a new love story also begins!<br/><br/>!!!The only game in the market to combine farm &amp; adventure &amp; puzzle genres. Be among the first ones to discover!!! <br/><br/>Do you know the best part??? It is completely free with NO ADS and NO Wi-Fi.<br/><br/>EXCITED? Here are the main features;<br/><br/>RELAX: Escape from the chaos of the city and find peace at your spacious farm. Sit back &amp; enjoy!<br/><br/>UNIQUE PUZZLE LEVELS: Your daily dose of brain teasers to keep a healthy mind! Blast through levels with challenging obstacles by using amazing power-ups and boosters. Continue to earn great prizes level after level!<br/><br/>ASTONISHING ADVENTURES: Complete challenging quests to unlock and discover numerous dazzling areas with Fiona, accompany her throughout the journey and help her to solve the mystery about her father! <br/><br/>Meet new CHARACTERS: Encounter interesting characters and catch up with their compelling stories. Witness the start of a new relationship between Fiona and Jake!<br/><br/>FARM: Farming has never been this entertaining. Grow crops such as corn and wheat, feed the cute animals to produce milk, eggs and so many more. Upgrade and increase productivity to fulfill the daily orders and earn cool rewards.<br/><br/>RENOVATE &amp; DECORATE: Select the items that suit your taste and design the farm as you wish!<br/><br/>Although Fiona’s memorable journey has just begun, there are numerous updates on the way to further expand the story with brand new puzzle levels. <br/><br/>Download now and start building your journey with Fiona!<br/><br/>Additional Information:<br/>Would you like to know more about the game and follow the updates? Check us out on;<br/>Instagram: instagram.com/fionasfarmgame <br/>Facebook: facebook.com/fionasfarm.game<br/>TikTok: tiktok.com/@fionasfarmgame<br/><br/>Need a hand? Reach out to our support team at support@ace.games<br/><br/>Terms of Service &amp; Privacy Policy: https://ace.games/privacy", "metacritic": null, "released": "2022-08-31", "tba": false, "updated": "2022-09-19T05:10:34", "background_image": "https://media.rawg.io/media/screenshots/7bb/7bbad17072717d81f26c6d89aa34d8ef_kiyAX4P.jpg", "website": "https://ace.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ace Academy Teknoloji A.Ş."], "genres": ["Adventure", "Puzzle"], "publishers": ["ACE ACADEMY TEKNOLOJI ANONIM SIRKETI"], "esrb_rating": "Everyone 10+"}