{"id": 852768, "slug": "forever-alone-2", "name": "Forever Alone", "name_original": "Forever Alone", "description": "In <strong>Forever Alone</strong> you play as a lost kitten who, after finding their mother dead, goes in search of somewhere safe to stay but along the way, they encounter a strange spark of light. With this new found curiosity, they choose to follow it in hopes of finding something to help ease their pain.<br/><br/>During the course of this adventure, you will be platforming through various different obstacles that are blocking your path by using your ability to peer into a different reality. While this other reality may be similar to your current one, it hides the key to getting past the challenges that block your way! However, it may also reveal different problems meaning you will need to be able to change between realities on the go or you may suffer a not so favourable fate!<br/><br/><br/><br/><strong>This game contains:</strong><br/><ul><li> A heartfelt story!<br/></li><li> Fun platforming gameplay!<br/></li><li> Handcrafted levels with a beautiful art style!<br/></li><li> A unique gameplay twist!<br/></li><li> A fantastic soundtrack!<br/></li><li> A lot of charm!</li></ul><br/><br/><br/>Please know that this game was made by one developer and a composer for the soundtrack meaning that this is a small game which hopefully you'll find contains lots of charm and a fun little experience.<br/><br/>I hope that you enjoy this fun, little game that has had a lot of love poured into it!", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T04:37:04", "background_image": "https://media.rawg.io/media/screenshots/09d/09dc532a05c9d3f9f40c448b99f2cbc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Young Cat Games"], "genres": ["Adventure", "Indie"], "publishers": ["Young Cat Games"], "esrb_rating": null}