{"id": 852745, "slug": "ninja-soul", "name": "Ninja Soul", "name_original": "Ninja Soul", "description": "<h3>Features</h3><strong><ul><li>Roguelite ACT</li></ul></strong>Challenge again and again in the never repeated level. In each life, you will encounter different enemies and treasures<br/><br/><strong><ul><li>Powerful Treasure System</li></ul></strong>ninjasoul has rich treasure skills and powerful property system. Each skill can be matched with other skills, and entry can even directly change the scope and form of skills! You can experience the charm of ARPG games in this roguelite act game<br/><br/><strong><ul><li>A Combat System Then Suitable For Everyone</li></ul></strong>in the game, players can choose to focus on the speed duel between the blades, or focus on building their own BD (treasure matching) and use Katana skill and Ninjutsu to kill the enemy<br/><br/><strong><ul><li>Explore a World Full of Unknowns</li></ul></strong>hidden treasure boxes are set in different corners of each level. Exploring levels in battle may get unknown gains!<br/><br/><strong><ul><li>Unique Customs Clearance Reward</li></ul></strong>After a game of customs clearance, players can choose one of equip for permanent fusion! Players can get the ability to this equip and use it in the next game!<br/>Of course, after each customs clearance, the enemy will become more cruel. If you want to get more fusion opportunities, you must face these enemies who become more cruel<br/><br/><strong><ul><li>Shuriken and IISEN</li></ul></strong>at the moment when the enemy makes an attack, the Ninja can throw Kunai to seal the enemy's action and use \"Iisen\" to pursue<br/><br/><br/><strong><ul><li>Katana Skill and Ninjutsu</li></ul></strong>In the game, Katana and scroll have active skills<br/><br/>Players can use these powerful active skills to destroy all enemies in one fell swoop <br/>", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T04:07:14", "background_image": "https://media.rawg.io/media/screenshots/baf/bafcbda63df1b3268a39649cea716c8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 2}, "playtime": 1, "achievements_count": 39, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ash Game Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Electronic Sheep Games"], "esrb_rating": null}