{"id": 852762, "slug": "yarg-2", "name": "YARG", "name_original": "YARG", "description": "<strong>YARG</strong> is a platformer where a kind and friendly AI cheers you on through extremely difficult tests designed to test the limits of human determination and patience. It believes in you! Don't fail it!<br/><br/><br/><br/>Jump, die, die, die and die to (eventually) be able to overcome devilishly difficult challenges. Avoid spikes, lasers, drones, sawblades and ██████ so you can escape*. This test will give us me so much good data! Thanks again!<br/><br/><br/><br/><ul><li><strong>30 one-screen levels</strong> that allow you to plan the perfect path through them as soon as you see them.<br/></li><li>A <strong>difficulty curve</strong> that's tough, but not unfair.<br/></li><li>A <strong>story</strong> that's unlocked through optional collectibles. Oh that's weird, how did that get there?<br/></li><li><strong>Rage Mode</strong>, unlocked after your first playthrough, in which you must beat the entire game with only 6 lives and no saving at all. A real test of skill, but I know you can do it!<br/></li><li>Make your own levels with the included <strong>level editor</strong>!<br/></li><li>Designed for keyboards, but <strong>playable with controllers</strong>.<br/></li><li><strong>Highly moddable</strong>. Want to add new levels? You can. What about new music, or a new story, or new cutscenes? Go ahead! All of the game's files are out in the open for you to tinker with if you're interested!</li></ul><br/><br/><br/>You don't remember how you got here, but you suddenly woke up inside some kind of underground facility of sorts. While finding your way out, you spot a giant screen, which suddenly comes to life and displays... a face? \"Oh, hello!\", it says. \"Welcome to the testing track!\"<br/><br/>Eventually, you re█lize th█t t██ pu██o██ of ███ ████ [FILE ACCESS DENIED]<br/><br/>Don't worry about all that! We I am just testing something about... perseverance! Yeah, that's it! And we'll even pay you a whole two thousand Ausvaros for participating!<br/>...Did I say \"we\"? I meant \"I\".<br/><br/><br/><br/>* Escaping not guaranteed.", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T04:27:12", "background_image": "https://media.rawg.io/media/screenshots/441/4417477617516b5d3e1a5b6081d23bc7.jpg", "website": "http://www.santumerino.com/games/YARG/YARG.htm", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Santum"], "genres": ["Action", "Indie"], "publishers": ["Santum"], "esrb_rating": null}