{"id": 852772, "slug": "bloody-efforts", "name": "Bloody Efforts", "name_original": "Bloody Efforts", "description": "<strong>Imagine your own mighty Heroes and make them REAL in Bloody Efforts.</strong><br/><br/><br/>There were two Ancient Gods - Known and his older brother Unknown. The elder God created a whole world with mighty Elements and the younger one gave this world a life with all forms we know. Unfortunately, there was a conflict between the brothers, which turned into the battle. Clash of the Gods disturbed the world balance and brought many cataclysms upon all the races. The Elements began to fight each other and what is worse, a new ominous being appeared – the Hollow.<br/>Until then, only a fraction of humanity managed to survive. Probably everyone would have been dead a long time ago, but something unexpected happened to the races. A new kind of people appeared, called Apostles. They are significantly different – stronger, faster, but the most remarkable is their ability to subdue power of the Elements. Some of the Apostles fight to restore order and peace once again. Others cooperate in achieving common goals. There are individuals who want to find remnants of the Gods or even get along with the Hollow, devoting their souls in exchange for new horrific powers. And who will you choose to be?<br/><br/><br/><ul> <li> Multiplayer Online Fighting Arena<br/> </li><li> <strong>Limitless creation of your own Heroes</strong><br/> </li><li> Various community-made Characters, ready to play<br/> </li><li> Band of 4 Heroes, which you can switch during the match<br/> </li><li> UNIQUE 3-Phased Mode including multiple Objectives<br/> </li><li> Ranking System with Leaderboards<br/> </li><li> Huge Maps!<br/> </li><li> Create and Customize private Games with your Friends with multiple Modes and settings<br/> </li><li> Various additional Modes (either competitive or chill&amp;fun)<br/> </li><li> Seasonal Rewards and Special Events<br/> </li><li> <strong>NEW Characters, Abilities, Cards coming each Week!</strong></li></ul><br/><br/><br/><strong>Limitless Customization and Challenges</strong><br/>Comprehensive Fighter Builder allows to create awesome unique Heroes (both appearance and playstyle) or imitate already existing pop-culture characters and play them in Bloody Efforts. Playing another match may bring a completely fresh playstyle and tactics from new opponents.<br/><br/><strong>Switch Fighters during the Game</strong><br/>Player needs to strategically choose their Band of 4 Apostles before the Match. Apostles are not equally matched and fit various roles (Warriors, Shooters, Tanks, Mages, Supporters, Assassins etc.). They get serious advantages or suffer disadvantages in different battle scenarios.<br/><br/><strong>Killing is not everything (MOBA-like)</strong><br/>3-phased Modes with various Objectives make an opportunity to think tactically about the next move. Defending the base, setting the trap or outsmarting in Apostle choices can be the key to victory.", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T04:42:19", "background_image": "https://media.rawg.io/media/screenshots/9cb/9cb65cc07e3b9f90e958b5e1acafb5ab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 14, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Flatmates"], "genres": ["Action", "Indie"], "publishers": ["Flatmates"], "esrb_rating": null}