{"id": 852836, "slug": "bubble-pop-mania-ball-blast", "name": "Bubble Pop Mania - Ball Blast", "name_original": "Bubble Pop Mania - Ball Blast", "description": "Bubble Pop Mania, a free shoot bubble game, based on the traditional bubble shooter.<br/>Discover a new relaxation tool! Dive into this wonderful adventure. Solve puzzles and complete challenges with colorful bubbles!<br/>Start this great bubble shooting journey now and get ready for the collision with the bubbles.<br/><br/>Never experienced such an addictive bubble shooter! Carefully formulate your strategy, deftly avoid all kinds of traps, and practice your matching skills.<br/>This bubble shooter is appealing not only for its clean and comfortable art style, but also because it's a perfect time killer.<br/><br/>If you are looking for a game that can release stress and calm your mind, you can try bubble pop and join the bubble shooter battle.<br/>Drag to aim, release to shoot, hit the target, blast and clear all colored balls to clear the board. <br/>You'll shoot bubbles to your heart's content and train your brain in this addictive bubble puzzle game.<br/><br/>Reasons to download Bubble Pop Mania：<br/>- No life limit, play as long as you want.<br/>- Concise interface layout, colorful bubbles, comfortable visual experience.<br/>- No WiFi required, enjoy this shooting puzzle game anytime, anywhere.<br/>- Crisp and bright sound effects, immersive experience of bubble shooting.<br/>- Once You Shoot, You Can't Stop! Shoot Bubble is simple yet addictive!<br/>- Thousands of well-designed levels! A variety of gameplay! Advanced gameplay with brain training levels!<br/>- It's a FREE game! Free to download, free to play and to access tons of fun!<br/> <br/>Skills you need to know：<br/>- Look for the same color, then aim and shoot.<br/>- Swipe the screen to find the precise shooting angle.<br/>- Show off your shooting skills and pop as many bubbles as possible.<br/>- Relying on powerful bombs and flame balls can help you complete the challenges more effectively.<br/> <br/>The rules of Bubble Pop Mania are simple and easy to understand, but there are also many challenges.<br/>The levels with increasing difficulty will make your adventure journey full of fun.<br/>If you like bubble games, welcome to join us, we will continue to add levels and update new content to keep your fun uninterrupted.", "metacritic": null, "released": "2022-09-07", "tba": false, "updated": "2022-09-19T05:49:19", "background_image": "https://media.rawg.io/media/screenshots/4cb/4cbd28bba316f0a25f56a051203f7e3c_CdHjIye.jpg", "website": "http://www.cctgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IvyMobile"], "genres": ["Casual", "Puzzle"], "publishers": ["IVYMOBI"], "esrb_rating": "Everyone 10+"}