{"id": 85287, "slug": "animated-jigsaw-arty-elements", "name": "Animated Jigsaw Arty Elements", "name_original": "Animated Jigsaw Arty Elements", "description": "Jigsaw puzzles with a unique and magical twist! <br/>When you complete a puzzle, they animate to come alive!<br/><br/>6 Animated jigsaw puzzles of natural elements.<br/>Originally created pieces of art in various expressionist styles.<br/>Themes of fire, water, thunder, forest, sun and space.<br/><br/>Once completed these puzzles will come alive and animate with moving images and effects representing the elements. Also accompanied by original themed looping musical patterns. You can turn the sound off if you don't like it though. <br/><br/>Designed for all the family and for people of all ages. This is one of our series of animated jigsaw puzzle games. <br/><br/>Drag to zoom between the \"box\" and the \"lid\". The \"box\" is where you place the correct puzzle pieces and the \"lid\" is where you choose from the scattered pieces. Once you have chosen your piece, you can rotate it if need be to make it fit. Just like you would on a real jigsaw puzzle<br/><br/>Want to have a break while playing? Well, you can. You can leave the puzzles and continue with them later or work on multiple puzzles at the same time. <br/> <br/>A completely new and original type of jigsaw puzzle game for iPhone, iPod and iPad. <br/><br/>This app is free from any ads, requiring in-app purchases, add-ons or ask for any personal information.", "metacritic": null, "released": "2014-03-08", "tba": false, "updated": "2019-07-30T09:52:17", "background_image": "https://media.rawg.io/media/screenshots/f75/f75a913e049fa4d32863f5e70d448411.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rob Wilmot"], "genres": ["Board Games", "Puzzle"], "publishers": ["Rob Wilmot"], "esrb_rating": null}