{"id": 85285, "slug": "note-rush-music-reading-game", "name": "Note Rush: Music Reading Game", "name_original": "Note Rush: Music Reading Game", "description": "Note reading made fun! Note Rush is a game for practising note reading on the music staff to help you learn to play the piano, keyboard, flute, saxophone, violin... you name it! Note Rush shows you one note at a time in random order then uses the microphone to listen as you play through them like you would with note reading flash cards, only these flash cards check that you're playing the right note! <br/><br/>Play with a bunch of fun themes and race to earn stars and beat your best time! Note Rush is great for teaching keyboard geography by making sure each note is played in the correct octave. An indispensable music theory must-have for learning sight reading at all levels of music education.<br/><br/>\"Great app for learning notes!\" - App Store Review.<br/><br/>\"So much better than flash cards! My son loves using this app and his note reading has improved tremendously since starting. I'm thankful he can do this on his own and it keeps track of his high scores which is highly motivating for him.\" - App Store Review.<br/><br/>\"A blockbuster hit with teachers and students... I especially like using it at group lessons.\" - Leila Viss, 88pianokeys.me <br/><br/>\"Note Rush has quickly become my favorite app for piano teaching.\" - Joy Morin, colorinmypiano.com<br/><br/>\"Note Rush is a motivating app that engages students to improve quickly with their note reading skills. It is definitely one of my top favorites and will be used often!\" - Jennifer Foxx, musiceducatorresources.com<br/><br/>\"Note Rush is a great way to review notes for the One Minute Club.\" - Susan Paradis, susanparadis.com<br/><br/>*** Having trouble? See noterushapp.com/troubleshooting for help. ***<br/><br/>Listens to Your Instrument<br/>------------------------------<br/>Note Rush helps students learn a strong association between notes on the page and keys on your instrument by using your device's microphone to detect when you play each note. Works with pianos, keyboards, flutes, violins, you name it! (See Q&amp;A below for more about supported instruments.)<br/><br/>Student-paced<br/>------------------<br/>Note Rush goes as fast or as slow as the student with no time limits, so is suitable for complete beginners right through to being a fun challenge even for teachers!<br/><br/>Grand Staff Context<br/>-----------------------<br/>The whole grand staff is always visible, showing each note in full context and helping students learn how notes are spaced out across the two staves.<br/><br/>Octave-Sensitive Keyboard Geography<br/>---------------------------------------------<br/>It's a \"B\", but which \"B\"?? Note Rush teaches keyboard geography by making sure you're getting the note in the right octave every time.<br/><br/>Great for Home Practise<br/>-------------------------<br/>Students will rush to their instrument at home every day with NoteRush, chasing stars and high scores! Unlike flash cards, children can drill note identification at home with no music-reading parent required to check if they're getting them correct - Note Rush checks for you! Play every day and you'll be great at reading piano music in no time.<br/><br/>Levels<br/>-------<br/>Note Rush has fifteen built-in Levels, from Middle C-Position right through to the full grand staff with 2 ledger lines above and below. There are Levels for Treble Clef, Bass Clef or full Grand Staff! Or make your own levels to practise reading specific notes, with sharps and flats for an added challenge!<br/><br/>Better Than Flash Cards!<br/>-------------------------<br/>Use Note Rush instead of printed flash cards! Note Rush was designed to replace the cards used in One Minute Club - a challenge you can run in your studio where students have to complete a given level in under a minute. Give it a try!<br/><br/>--<br/>Note Rush is made by Thomas Grayston, a software developer, pianist, and husband to a piano teacher.", "metacritic": null, "released": "2016-06-17", "tba": false, "updated": "2019-10-22T14:21:22", "background_image": "https://media.rawg.io/media/screenshots/9d1/9d1bb1b5d9f5d4ee8456f320364c9254.jpg", "website": "http://www.noterushapp.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Thomas Grayston"], "genres": ["Family"], "publishers": ["Thomas Grayston"], "esrb_rating": "Everyone 10+"}