{"id": 852823, "slug": "find-tap-hidden-objects", "name": "Find & Tap: Hidden Objects", "name_original": "Find & Tap: Hidden Objects", "description": "Find &amp; Tap is a new, free hidden objects game. You have to find objects in hand-drawn pictures. During the game you will play in different locations: from the beach to the dog show. Dozens of unique locations and hundreds of hidden objects to find are waiting for you. Levels of various tasks are a real challenge for fans of the hidden object genre! It's worth working hard to find everything we've hidden.<br/><br/>How to play?<br/>- examine pictures carefully and look for objects with a simple tap of your finger on the screen<br/>- collect stars and unlock more difficult levels<br/>- look for objects by silhouette, for a while, by name, on a moving picture<br/>zoom in to find more hidden objects<br/>- if some level seems difficult, you can speed up the passage by using the hint<br/><br/>What's interesting about Find &amp; Tap?<br/>- We offer you several game modes:<br/>- Classic. Go through the levels to the stars and open the bonus, for which you will receive a reward.<br/>- Big pictures. We have hidden a lot more items in these pictures. Find them all and get an extra reward!<br/>- Moving picture. Hurry up to find the necessary item before the picture stops!<br/><br/>Who is the game for?<br/>Suitable for the whole family. It requires concentration and a desire to train your mindfulness.<br/><br/>No internet<br/>The game is free and available without an internet connection.<br/><br/>If you have any questions about the game, or ideas for improving it, write to us at info@urmobi.games. We will help you in solving the arisen problems.", "metacritic": null, "released": "2021-02-11", "tba": false, "updated": "2022-09-19T05:37:15", "background_image": "https://media.rawg.io/media/screenshots/3b2/3b264b4dff284301052f59e0f54f2524.jpg", "website": "https://lionstudios.cc/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["URMOBI"], "genres": ["Casual", "Puzzle"], "publishers": ["URMOBI"], "esrb_rating": "Everyone 10+"}