{"id": 852827, "slug": "rock-art-3d-adult-coloring", "name": "Rock Art - 3D Adult Coloring", "name_original": "Rock Art - 3D Adult Coloring", "description": "From Dramaton, the mobile game studio that brought you famous DIY art and 3D coloring games such as Super Slime SImulator, Squishy Magic and GO! Dolliz, enjoyed by millions of users daily for relaxation and creativity, comes a new groundbreaking 3D coloring game for adults: Rock Art!<br/><br/>Discover the hottest new trend in 3D adult coloring and DIY anti-stress painting: the art of rock coloring. Enjoy hours of fun and anti-anxiety relaxation coloring stones in your personal style and design and create your unique gallery of painted stone masterpieces. <br/><br/>Choose from a large variety of 3D illustrations in this adult coloring book – animals, mandalas, patterns, flowers and more – and paint them with your favorite colors to create your one of a kind art collection of 3D painted stone DIY artworks.  Color and recolor your artworks to reach artistic perfection - just like a real stone painting artist!<br/><br/>Relax your mind, relieve your stress and anxiety, express your inner artist and unleash your creativity and imagination by engaging in this new form of anti-stress meditative DIY art therapy and stress relief coloring on your mobile device. Feel your anxiety disappear with every color you add, with every new illustration you paint and every new rock painting artwork you add to your painted rock collection.  Experience the ASMR sensations of different textures, different drawings, different colors and showcase your artistic talent and creativity by sharing your painted stone artworks with your friends and loved ones.", "metacritic": null, "released": "2022-08-25", "tba": false, "updated": "2022-09-19T05:41:09", "background_image": "https://media.rawg.io/media/screenshots/49c/49c5190f8e5081c9e5687db52165d7f7_vhs8rfZ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dramaton"], "genres": ["Board Games"], "publishers": ["Dramaton"], "esrb_rating": "Everyone 10+"}