{"id": 852819, "slug": "solitaire-spider-2022", "name": "Solitaire Spider 2022", "name_original": "Solitaire Spider 2022", "description": "Spider Solitaire is one of the most popular solitaire games in the world! If you are a big fan of Spider Solitaire, Spiderette, classic Klondike solitaire, FreeCell Solitaire games, Pyramid Solitaire, Casino card games or any other casual card games, you will love this spectacular game!<br/><br/>The BEST Spider Solitaire card game is FREE now! Spider Solitaire has outstanding gameplay and awesome graphical design which will give you better experience than ever before! DOWNLOAD NOW and enjoy the solitaire fun!<br/><br/>Build stacks of cards of the same suit from King to Ace as you experience a new puzzle with each hand. Start with 1-suit and then try your luck with 2-suit, 4-suit, and even single deck (Spiderette) formats for a greater challenge as your skills improve.<br/><br/>Unlike some solitaire games that lack polish, we have revamped our spider solitaire game with the perfect blend of popular classic spider solitaire gameplay and awesome graphical design. We believe that our game will give you just the right amount of options for all your solitaire needs!<br/><br/>Features:<br/>- 1-Suit games (Easy)<br/>- 2-Suit games (Medium)<br/>- 4-Suit games (Hard)<br/><br/>- Portrait or landscape orientation<br/>- Crisp, beautiful, easy to read cards<br/>- Simple, intuitive game interface<br/>- Single tap to place a card or drag and drop<br/>- Classic Spider Solitaire rules and scoring<br/>- Right or left handed orientation options<br/>- Auto-save and resume features<br/>- Smart hints show potentially useful moves<br/><br/>- Timer, moves, and statistics<br/>- Unlimited undos<br/>- Auto complete option to finish a solved game<br/>- Universal app for Phone and Tablet<br/><br/>Game Highlight:<br/>- Classic gameplay of Spider Solitaire<br/>- Smooth and fast experience<br/>- Available Anytime: works without network<br/>- Daily challenge to keep you going<br/>- Custom cards and boards<br/>- Different levels of difficulty: 1/2/4 suits<br/><br/>Spider Solitaire has a fantastic user interface, beautiful graphics and subtle sound effects. Drag, tap, or for the most fun, give cards a shove to send them on their way!", "metacritic": null, "released": "2021-08-06", "tba": false, "updated": "2022-09-19T05:33:32", "background_image": "https://media.rawg.io/media/screenshots/355/355ee32a2c4c9f4af576f71aa48b1128_maJAKe7.jpg", "website": "https://www.oneup.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 107, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["One Up Games Studio"], "genres": ["Board Games", "Card"], "publishers": ["1UP GAMES STUDIO"], "esrb_rating": "Everyone 10+"}