{"id": 852816, "slug": "solitairebrain-card-game", "name": "Solitaire：Brain card Game+", "name_original": "Solitaire：Brain card Game+", "description": "General rules for free solitaire games:<br/>How to Play Solitaire Free Solitaire: Check out Solitaire. If there are any aces, place them on top of the seven piles. If there are no ace's, rearrange your cards to move only the face-up cards. When you put a card on it, it must be a different color than the card you put on it and worth one less. So if you have a 6 of hearts, you can put a 5 of spades or a 5 of clubs on top. Keep stacking solitaires together until you can't move.<br/><br/>Keep the top card visible. The cards at the top of each of the seven piles should be face up. If you move a card, remember to turn over the card below it.<br/><br/>Use the ace as a base to build your pile. If you have an ace above your card, you can move the cards of that suit to the top of the pile in ascending order.<br/>If you run out of moves, use a spare deck. Flip the top three cards over and see if the top one can fit anywhere. If you put down the top card, see if you can put down the next one. If you put down the second card, see if you can put down the last card. Then, if you lay down the last card, you lay down three more cards from the stock deck. If you can't move with any of these cards, put them in a separate wastepaper pile.<br/><br/>If you have hidden cards, you can move the cards around until you find something you can hold and grab the card you want, and finally put it in the slot you want.<br/>If you have used all the cards in one of the seven piles, you can place a king in the blank.", "metacritic": null, "released": "2022-05-01", "tba": false, "updated": "2022-09-19T05:31:04", "background_image": "https://media.rawg.io/media/screenshots/3b2/3b2441f29e411d05206ef5e650cab8dc.jpg", "website": "https://ps.panjichang.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wei Hu"], "genres": ["Casual", "Card"], "publishers": ["Wei Hu"], "esrb_rating": "Everyone 10+"}