{"id": 852901, "slug": "the-walking-dead-all-stars", "name": "The Walking Dead: All-Stars", "name_original": "The Walking Dead: All-Stars", "description": "Based on The Walking Dead Comics Series.<br/>Introducing The Walking Dead: All-Stars!<br/>\"Respond if you are still out there!\"<br/> <br/>Battle for survival.<br/>The Walking Dead: All-Stars invites all survivors to its post-apocalyptic world.<br/><br/>▶Game Introduction◀<br/><br/>『World』<br/>Famous for its post-apocalyptic world, The Walking Dead features no shortage of horror.<br/>Be on the lookout for walkers as well as other groups of survivors!<br/>The battle for survival begins now.<br/><br/>『Characters』<br/>Experience the original comic book series right in the palm of your hand!<br/>Stunning visuals and artwork bring the world of The Walking Dead: All-Stars to life!<br/>Meet characters from The Walking Dead universe as well as those unique to the game!<br/>Enjoy high-quality character artwork rarely seen in idle games.<br/><br/>『Content』<br/>Idle gameplay allows you to grow and progress with minimal effort!<br/>Collect a diverse cast of characters!<br/>Defend the settlement of Asyl against enemies in Camp Defense.<br/>Obtain supplies from Supply Run and Dispatch!<br/>Compete against other survivors in the Borderlands!<br/>Join a Community and take part in Joint Battle!<br/>Dive into other game modes that fully embody the world of The Walking Dead!<br/><br/>The fight for survival never ends.<br/>\"An idle RPG game that continues without you ever having to log in!\"<br/><br/>Team up with survivors from The Walking Dead.<br/>\"A collection RPG that encapsulates the spirit of The Walking Dead comics!\"<br/><br/>Log in now and fight for your survival.<br/>And remember, you're not alone.<br/><br/>* The game is available in 한국어, English, 日本語, 中文简体, 中文繁體, Deutsch, Français, Español, русский, ไทย.<br/><br/>** The Walking Dead: All-Stars is free to play, but offers in-app purchases. You can disable in-app purchases through your device's settings<br/>** Minimum Requirements: iPhone 6S Plus (iOS 11.0) / 2GB RAM<br/><br/>***<br/>Smartphone App Access Permissions<br/><br/>▶ Permission Guidelines<br/>App will request permissions in order to provide certain services:<br/><br/>[Required Permissions]<br/>-None<br/><br/>[Optional Permissions]<br/>- Camera: Permission to access the Camera to take pictures that can be set as your Hive profile image.<br/>- Photo: Permission to access the Photo Album to upload pictures from your photo album to set as your Hive profile image.<br/>- Push Notifications: Permission to send you Push Notifications in-game.<br/>- Identifier for Advertisers (IDFA): Permission to use Identifier for Advertisers (IDFA) for targeted advertising and tracking analysis. <br/><br/>※ Optional permissions are not required to play. However, disabling them will restrict access to related features.<br/><br/>▶Revoking Permissions<br/>You can reset or revoke permissions using the following steps:<br/>- Settings &gt; Privacy &gt; Select App &gt; Grant/Revoke Permissions<br/><br/>* The Walking Dead: All-Stars Official Forum: twdallstars-community.com2us.com<br/>* The Walking Dead: All-Stars Official Discord: discord.gg/twdallstars<br/>* The Walking Dead: All-Stars Official Brand Page: https://thewalkingdeadallstars.com/en<br/>* Com2uS Holdings Official Website: https://www.withhive.com<br/>* For any questions, please contact us at: https://m.withhive.com/customer/inquire", "metacritic": null, "released": "2022-08-30", "tba": false, "updated": "2022-09-19T06:51:31", "background_image": "https://media.rawg.io/media/screenshots/c6e/c6e09163e763e25fd21700cdfc05c92d_vshId3i.jpg", "website": "https://www.withhive.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Com2uS Holdings"], "genres": ["RPG", "Strategy"], "publishers": ["Com2uS Holdings"], "esrb_rating": "Mature"}