{"id": 852982, "slug": "dexter-stardust", "name": "Dexter Stardust", "name_original": "Dexter Stardust", "description": "Space! Dexter Stardust barely escaped when the Vreesians, inhabitants of the menacing Planet X, sent a fleet of robots to destroy all life on Earth. Now, twenty years later, a mechanical man from the 10th planet seeks to communicate with Dexter a very important message - he is the key to saving both humans and Vreesians! Play the taco-loving Dexter Stardust as he, and his good friend Aurora, go on the greatest adventure of their lives and discover the mystery of the Robot from the Planet X!<br/><br/>Dexter Stardust was illustrated, animated, written, scored, SFX'd, and programmed by one person, Jeremy Fryc. Even so, the characters are voiced by his friends, Munk Alejandro, Lola Mendez, and Alec Corday - who helped create the characters way back in 2012 on a warm afternoon in the Dominican Republic. 10 years later, we finally have... Dexter Stardust: Adventures in Outer Space!<br/><br/>• 5 Episodes all in one game!<br/>• Fully voice acted.<br/>• A true classic graphic adventure game with traditional point and click mechanics. This is a 100% pure graphic adventure!<br/>• All traditional - frame by frame - animation. No rigged characters!<br/>• Artwork created in 4K.<br/>• Visit 5 planets with well over 100 playable scenes.<br/>• Lots of puzzles. Learn to play the ukulele.<br/>• Tacos!<br/>• Exclamation points!", "metacritic": null, "released": "2022-08-11", "tba": false, "updated": "2022-09-19T08:08:27", "background_image": "https://media.rawg.io/media/screenshots/cf4/cf48695850a5ab8f7e8d14125bcabca6_Z8JvvOi.jpg", "website": "https://snapbreak.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Snapbreak Games"], "genres": ["Adventure", "Puzzle"], "publishers": ["Snapbreak Games"], "esrb_rating": "Everyone 10+"}