{"id": 852909, "slug": "monster-park", "name": "Monster Park!", "name_original": "Monster Park!", "description": "Are you brave enough to raise your own Monster?<br/>Explore the park to find new monster.<br/>Digging up eggs and find them. Build home and feed them.<br/>Make the island better to increase more visitors, earn money, and become the best park tycoon in the world!<br/>--------------------------------<br/>Subscription Terms - Monster Park!<br/><br/>Here are the subscription periods available in our game:<br/>‍<br/>- Weekly subscription for $5.99 after a 3-day free trial<br/><br/>Many offers unlock the following features:<br/>- No Pop ADs.<br/>- Flying Monster Unlocked.<br/>- Gold Monster Statue<br/>- Many New Features!<br/><br/>End of trial and subscription renewal:The payment is charged to your account after a confirmation of purchase.The subscription is renewed automatically unless you turn it off 24 hours before the end of the current period.The subscription automatically renews for the same duration as the original offer the users subscribed to (weekly).Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal.Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase.Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.No cancellation of the current subscription is allowed during the active subscription period.<br/><br/>Cancelling a trial or a subscription:If you want to cancel a subscription during its free trial, you have to cancel it through your account in the Store. This must be done at least 24 hours before the end of the free trial period to avoid being charged.<br/><br/>We're looking forward to your game feedback to improve our game! Contact us at feedback@universalmobilegames.com<br/>Privacy policy : http://www.universalmobilegames.com/privacy<br/>Terms of use : http://www.universalmobilegames.com/term", "metacritic": null, "released": "2022-08-30", "tba": false, "updated": "2022-09-19T06:59:57", "background_image": "https://media.rawg.io/media/screenshots/128/12894bc5c030502aed587f22a4f6937f_OC6S6ZO.jpg", "website": "http://www.universalmobilegames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["UNIVERSAL MOBILE GAMES TECHNOLOGY CO"], "genres": ["Adventure", "Simulation"], "publishers": ["UNIVERSAL MOBILE GAMES TECHNOLOGY CO"], "esrb_rating": "Everyone 10+"}