{"id": 852907, "slug": "basketball-legacy-manager-23", "name": "Basketball Legacy Manager 23", "name_original": "Basketball Legacy Manager 23", "description": "Basketball Legacy Manager 23 (BBLM23) is the ultimate mobile basketball manager experience. Manage all aspects of your basketball team to create the ultimate legacy. Coaches, scouts, drafting, trading, contract negotiations, player development, all this will help you dominate the league for decades.<br/><br/>BBLM23 is an offline basketball manager. You can play whenever you want, wherever you want. No internet connection is required!<br/><br/>Each career has its own storyline, as you follow the evolution of the entire league from declining contenders to rising superstars. You can keep track of the whole league record for all positions and teams, of every single draft class, of every player transaction and much more.<br/><br/>Basketball Legacy Manager 23 is fully customizable from players and teams to coaches and leagues!<br/><br/>You can even start your career as far as 1951! You have full control over the league future with the help of expansion drafts!<br/><br/>Basketball Legacy Manager 23 brings many new features to help you manage your basketball team to a deeper level such as:<br/><br/>CUSTOM LEAGUES<br/>Create and play with fully customisable leagues<br/><br/>PRESEASON<br/>Observe your prospects and manage your lineup cuts before the start of the season<br/><br/>TRADE DEADLINE EVENT<br/>Feel the pressure of other teams and the approching deadline<br/><br/>STAFF &amp; SPECIALTIES<br/>Assistant GM, head of player development, head scout, medical staff and staff specialties<br/><br/>AWARDS SHOW<br/>Trophy history, finalists and suspenseful reveal<br/><br/>CONDITIONAL PICKS<br/>Add conditional picks to your trades for a deeper negotiation<br/><br/>You also have the loved feature of previous iterations such as:<br/><br/>HISTORY MODE<br/>Start a career in 1951, 1970, 1990 or 2010!<br/><br/>BATTLE ROYALE<br/>Each seasons the 5 worsts teams are eliminated. Will you be the last team standing?<br/><br/>LEAGUE EXPANSION<br/>Full control over the league expansions. From 6 teams to 64, custom playoffs, lottery and draft rules.<br/><br/>With Basketball Legacy Manager PRO you can play for decades and even centuries!", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T06:57:21", "background_image": "https://media.rawg.io/media/screenshots/397/3972e4349b42a476a7a7219bad449c02_g24aTsf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Elie Lamoureux"], "genres": ["Simulation", "Sports"], "publishers": ["Elie Lamoureux"], "esrb_rating": "Everyone 10+"}