{"id": 852965, "slug": "sushi-surf-endless-run-fun", "name": "Sushi Surf - Endless Run Fun", "name_original": "Sushi Surf - Endless Run Fun", "description": "Surf, fish and make sushi! New awesome endless-runner fun. Help Kirashi and Miyu surf amazing sea and under-water landscapes. While you surf, catch unusual fish and complete missions for Grandma Hinata to prepare the most delicious sushi. Collect coins on sunken pirate ships and under-water volcanoes. Watch out for dangerous fish and the rocky sea!<br/><br/><br/><br/><br/>- CARVE the perfect wave with simple one-touch control <br/>- CATCH the freshest ingredients for delicious sushi<br/>- COMPLETE missions to increase your score multiplier and receive other exciting rewards<br/>- BRAVE the choppy sea with the coolest boards <br/>- DODGE rocks and evil fish <br/>- COLLECT and earn coins with crazy stunts <br/>- UNLOCK some outstanding gear and insane outfits <br/>- REACH a top spot on the Sushi Surf leaderboard of champions <br/>- USE fish magnets or exciting boosters to improve your run <br/>- ENJOY amazing graphics in wonderful organic environments<br/><br/><br/><br/><br/>No one makes sushi like Grandma. She needs your help. Only the best surfers can ride dangerous waves AND catch the freshest fish for her sushi. As a reward you’ll earn coins, new gear and boosters for even more exciting rides. <br/><br/><br/><br/><br/>Join the best surf fun and DOWNLOAD the game now!<br/><br/><br/><br/><br/>Questions about the game? Ask our support team: support@awfullynicestudios.com", "metacritic": null, "released": "2022-07-12", "tba": false, "updated": "2022-09-19T07:51:32", "background_image": "https://media.rawg.io/media/screenshots/dee/dee83000eb4ec4b6e654fb1788ffe41b_70BcCk7.jpg", "website": "https://www.awfullynicestudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Awfully Nice Studios"], "genres": ["Action", "Casual"], "publishers": ["Awfully Nice Studios"], "esrb_rating": "Everyone 10+"}