{"id": 852910, "slug": "truck-simulator-cars-usa-drive", "name": "Truck Simulator Cars USA Drive", "name_original": "Truck Simulator Cars USA Drive", "description": "Are your ready to drive realistic trucks through United States of America in your mobile? Truck Simulator Cars USA DRIVING 2 the best heavy vehicle simulator ever made! After years improving the scenario and the trucks, we create the best experience of simulation for you. With more then 100 jobs to complete, choose between 15 heavy vehicles to transport a huge set of cargo across the major cities of United States of America.<br/><br/>Challenge other players online through Truck Simulator road experience dashboard! <br/><br/>Make America Truck again!<br/><br/>MAIN FEATURES<br/>- 13 trucks, and 20 different cargo to transport.<br/>- 133 missions and jobs to play! (and this number will increase with our updates!).<br/>- U.S.A map including all the major cities.<br/>- Very realistic vehicle physics.<br/>- A Artificial Intelligence for the cars on the roads.<br/>- Detailed road signs, real speed limits.<br/>- 15 trucks with different driving modes that you can own, customize and upgrade<br/>- Variety of cargos to transport across huge map covering half of USA's highways<br/>- Over 30 different types of shipments/cargos to deliver<br/>- Realistic fuel consumption and fatigue system<br/>- Expanded customization<br/>- Detailed interior view of each truck<br/>- Breathtaking open world to explore<br/>- 10 big cities to visit<br/>- Hundreds of realistic quest<br/><br/>Terms Of Use : https://sourate.xyz/terms_of_use.html<br/>Privacy Policy: https://sourate.xyz/privacy.html", "metacritic": null, "released": "2022-09-06", "tba": false, "updated": "2022-09-19T07:00:46", "background_image": "https://media.rawg.io/media/screenshots/6b6/6b6d4e4b1fa973111196e4da5a2bb0bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["CALIN IULIU"], "genres": ["Simulation", "Racing"], "publishers": ["CALIN IULIU"], "esrb_rating": "Everyone 10+"}