{"id": 853079, "slug": "welcome-to-spiral-island", "name": "Welcome to Spiral Island", "name_original": "Welcome to Spiral Island", "description": "<p>¿Qué harías si de una caída llegas a otro mundo? </p>\n<p>A uno en que tu idioma no sirva para comunicarte...</p>\n<p>En dónde eres capaz de volverte un animal...  </p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>Un mundo donde el tiempo cobrará tus recuerdos...</p>\n\n\n\n\n<strong>Bienvenidos a la isla Espiral. </strong>\n<p>Acompaña a <em>Lillian </em>y a <em>Miles </em>a recorrer y explorar una isla habitada por animales \"parlantes\" y con consciencia de su existencia… Pero que no han abandonado lo más básico de su instinto natural.<br/></p>\n<p>Un lugar en el que tendrás que enfrentar a los feroces <em>Jellycats </em>que protegen su territorio y ayudar a los variados isleños. Un territorio con su propia historia que podrás conocer.<br/></p>\n<p>Pero tu meta es clara: conseguir cuatro orbes de cristal que permitirán a <em>Lillian </em>volver a su hogar, pero el modo no será agradable, y las posibles consecuencias tampoco.</p>\n\n\n<ul><li>Todo el apartado gráfico del juego hecho con pixel art.</li><li>Crea un vínculo con tu compañero a través del sistema de puntos de Confianzas que podrás incrementar con tus respuestas o invitándolo a comer. </li><li>Conocerás los diferentes pueblos animales. Hazle favores a los isleños y gana su cariño a través de los Puntos de Karma.</li><li>Saca tus garras y prepárate para los combates RPG. Equípate bien si no quieres salir malherido.</li><li>Utiliza tus habilidades de humano o de gato para realizar diferentes puzzles.</li><li>Cocina tu comida y prepárate para explorar.</li><li>Cuida tus actos y relaciones para desbloquear diferentes finales.</li></ul>", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-09-19T09:05:08", "background_image": "https://media.rawg.io/media/screenshots/52f/52f7f3d51b6665da9df1ba9623b00d08.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rana"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}