{"id": 85318, "slug": "voices-2-fun-voice-changing", "name": "Voices 2 ~ fun voice changing!", "name_original": "Voices 2 ~ fun voice changing!", "description": "Ever wish you could change your voice to something more fun? Well, now you can with Voices!<br/><br/>Just say something silly into your iPhone or capture a friend saying something particularly embarrassing. Then make it sound even MORE ridiculous with your choice of over a dozen different voices.<br/><br/>You’ll sound hilarious as a squeaky CHIPMUNK, a futuristic CYBORG, and a super-slow TURTLE with Voices.<br/><br/>Ever wondered what you’d sound like through a retro synthesizer VOCODER? Through a MEGAPHONE? On HELIUM? Voices can do it all without you actually having to get any of those things.<br/><br/>Oh, and did we mention that the coolest thing about the app is that you can turn your voice into a sweet GUITAR… *wah-chicka-wah-wah*<br/><br/>◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇<br/>What people are saying about Voices…<br/><br/>   “We used this to record our parents and<br/>    inlaws arguing, then played it back,<br/>    I laughed so hard I almost passed out.<br/>    Best app I’ve purchased thus far!”<br/><br/>   “This has given us hours of endless laughs!”<br/><br/>   “Lots of fun and has already proved its<br/>    worth by allowing me make an angry<br/>    girlfriend laugh, who can stay mad at<br/>    someone who apologises in the voice of<br/>    a chipmunk?”<br/>◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇<br/><br/>FEATURES<br/>√ have fun changing your voice dozens of different ways<br/>√ slick, stylish user interface<br/>√ save your favorite recordings<br/>√ share your recordings with friends via email, Facebook, and Twitter<br/>√ a guarantee to put a smile on your face!<br/><br/>WHAT’S NEW IN VOICES 2<br/>√ 9 awesome new voices!<br/>√ “echo” feature that enables you to test out each voice before recording<br/>√ MUCH faster voice processing… practically instant<br/>√ you can now send your recordings via text message<br/>√ you can change your recordings to different voices<br/>√ added ability to switch between your AirPlay speakers (iOS 4.2 and later)<br/><br/>Once you try Voices, you’ll be surprised at how boring your regular old voice really is!<br/><br/>And most importantly… have fun!", "metacritic": null, "released": "2009-11-19", "tba": false, "updated": "2019-10-22T14:34:45", "background_image": "https://media.rawg.io/media/screenshots/6e9/6e96dbccda354a4f680ec5bea0eff905.jpg", "website": "http://www.taptaptap.com/voices", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LateNite Apps"], "genres": ["Simulation", "Family"], "publishers": ["LateNite Apps"], "esrb_rating": null}