{"id": 853183, "slug": "wonderful-life", "name": "Wonderful Life", "name_original": "Wonderful Life", "description": "<p><strong><em>Wonderful Life:</em></strong></p>\n<p>Relive your life as they flash before your eyes, by traversing along your memories.</p>\n<p>The game takes place when you're on the verge between life and death. Re-live your life, starting as an infant and growing gradually as you complete each level.</p>\n<p>Can you survive through all the memories, and stay alive on the surgery table? If not, how old can you get?</p>\n<p>The game is made out of 10 memories, which are basically mini-games, each representing a different age and it's suitable activity in your life.</p>\n<p>If you lose the mini-game in the memory - you die on the surgeon table. In order to survive, successfully complete the memories!</p>\n<p>Completing memories will advance the story and let you grow older, and playing each memory in a higher difficulty will also reward you with growing slightly older than normal (for each memory you can choose 1 out of 3 levels).</p>\n<p><strong>-------------</strong></p>\n<p><strong><em>Modes:</em></strong></p>\n<p><em>Directors Cut</em> - play the game the way the director (yours truly) meant it to be played. No second chances. If you die in a memory - you die on the surgeon table. When you start, only the first level is unlocked for each memory. As you complete a memory - it's next level will be unlocked for the next playthrough (thus having an older age achievable!).</p>\n<p><em>Easy Mode</em> - You can't die on the surgeon table - losing in a memory will restart it. Also, all 3 levels for each memory are unlocked from the start. Play this mode if you want to slowly, peacefully cruise between the different memories in different difficulties without having to fear losing your progress.</p>\n<p><strong>-------------</strong></p>\n<p><strong><em>Controls:</em></strong></p>\n<p>Press I for info at all stages of the game.</p>\n<p>Press M to go back to the Menu at most stages of the game.</p>\n<p>Press Space to advance dialogues and start each level.</p>\n<p>The game is made out of 10 mini-games, and in each the controls are specified at it's start screen, but generally -</p>\n<p>Arrow keys are mostly used for movement and space for the unique activity in each mini game.</p>\n<p><strong>-------------</strong></p><p><strong><em>Credits</em></strong><strong>:</strong></p>\n<p>Thank you for playing my game! Almost everything here was made by me - art, code, design, music - all besides the fonts and some sound effects I took from YouTube (for free commercial use).</p><p>Fonts from DaFont.</p><p>Some SFX was taken from the following youtube channels: Waveform sound effects, Sounds &amp; Designs, Sound Effect Database, Sound effect, AudioEffects, Free Gaming Sound Effects, ActionEffectsPro.</p>\n<p>I would love any feedback you have, as I try and improve from game jam to game jam, both game dev wise and game design wise.</p>\n<p><strong>If at any point you're stuck and not sure what to do - press i !</strong></p>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T09:43:23", "background_image": "https://media.rawg.io/media/screenshots/903/90302f8bfca2fcab202ec58db80bd358.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Guy Girmonsky"], "genres": ["Adventure", "Simulation"], "publishers": [], "esrb_rating": null}