{"id": 853213, "slug": "geiger-crawler", "name": "Geiger Crawler", "name_original": "Geiger Crawler", "description": "<ol><li>İnşaasına devam edilirken büyük bir saldırıya uğrayan, sonrasında havaya uçurulmak için bomba kurulmuş olan \"Pcdure Ana Merkezi\"ne büyük bir felaketin önüne geçmek için bir ajan intikal eder. Ancak bu ajan orada yalnız değildir. Bu ajanın başdüşmanı ve aynı zamanda oyunun ana karakteri olan J, bombanın imha edilmesini engellemek ve başdüşmanıyla yüzleşmek için havalandırma deliklerinde dolaşarak elindeki \"Sıfır Alan Manipülatör\" cihazı ile nesneleri hareket ettirebilmektedir.    Emeği Geçenler  Hasan Berkay \"heissenbergei\" Bülbül     Oyun Yönetmeni, Sanat Yönetmeni, Yazar Enes Mustafa \"ema\" Altındal             Teknik Yönetmen, Geliştirici Yavuzhan \"mruyyiC\" Yıldız        Sanat Yönetmeni, 3D Tasarımcı, Yazar Levent \"Giruvegan\" Coşkun        Besteci, Ses Yönetmeni   Kullandığımız Programlar  Blender, Unity, Fusion 360, FL Studio    Bu oyunun yapımında bazı ses efektleri dışında hiçbir hazır asset kullanılmamıştır.    Özel Teşekkürler:  Bize yurt odalarında çalışma imkanı sağlayan Çağan Yıldırım, İlbay Traş, Murat Pircanoğlu, Talip Kılıç'a ve bilgisayarını kullanmamıza izin verdiği için İhsan \"osmansg\" Gündoğdu'na teşekkür ediyoruz.\r\n</li></ol>\n\n<p>Walkthrough</p>\n<p>1. Bölüm: Kontrolleri öğrenmek gerektiğinden zile basılır ve adamın dikkati dağıtılır 2. Bölüm: Fişe basarak bilgisayarlardan çıkan sesle adamın dikkati dağıtılır ve çekmecelerdeki kağıtlar alınıp adam bakmezken kağıtlar imha edilir 3. Bölüm: Adam bir koridorda koşmaktadır. Doğru anda EMP'ye basılarak patlatılmaktadır. 4. Bölüm: Penseyle köprünün kilidi kesilir ve adam otomatik olarak köprüden geçer bölüm tamamlanırç 5. Bölüm: Yanıp sönen ışıklar arasında pense ve kilit bulunur. Penseyle tel kapı kesilir. Kesilen tel kapını ardındaki düğmeye basılır ve level biter.</p>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T09:54:32", "background_image": "https://media.rawg.io/media/screenshots/fed/fedaa345f06b1b1ec3eb25fe02d1bbbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mryildiz06"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}