{"id": 85322, "slug": "beat-pangpang-for-kakao", "name": "Beat PangPang for Kakao", "name_original": "Beat PangPang for Kakao", "description": "▶▶ Affirm emphatically, ‘Beat PangPang’ is the best rhythm action game. ◀◀<br/><br/>The best realtime rhythm action game with your favorite musics!<br/>Various user-friendly customization options that ou have never seen before is supported!<br/><br/>Here is just the world of rhythm games that you have never imagined. <br/><br/>Do you play in the frame that someone else has created and tasted? <br/>Now you just enjoy the rhythm game with your musics!<br/><br/>◆◇◆ Play with your favorite musics. ◆◇◆<br/>How long do you play in the frame that someone else has created and tasted? Is it frustrating?<br/>Enjoy the your own rhythm game with your favorite musics.<br/>(This app includes the 14 exciting and entertaining rhythmic musics. )<br/><br/>◆◇◆ Play the rhythm game and grow up your own characters. ◆◇◆<br/>You can choose your favorite characters and grow up your characters in your imagine.<br/>There are 10-more characters (beautiful, cute, sexy, handsome)<br/>Identify the characteristics of the character and strategic game to challenge your high score.<br/><br/>◆◇◆ Includes all existing difficulties, and more ◆◇◆<br/>Do you know why the other rhythm games limit up to 6 line?  Are you enough?<br/>'Beat PangPang' supports up to 8 lines.<br/>Please try to test the limitation of your ability to fall asleep using other options.<br/>- 6 kinds of line mode : 3 lines ~ 8 lines. <br/>- 9 steps of note speed<br/>- 4 levels of difficulty : Easy/Normal/Hard/Crazy. <br/>- 5 steps of touch ranges<br/>- Long note/Slide note/Double note options.<br/><br/>◆◇◆ Various visuality for personality. ◆◇◆<br/>Are you enough to enjoy only with various sounds?<br/>Various visuality is enough to enjoy the game.<br/>You can choose various backgrounds, notes, spectrums, effects for your personality.<br/><br/>◆◇◆ This is not the end of the competition with your KakaoTalk friends. ◆◇◆<br/>Also 'Beat PangPang' provides the world ranking.<br/>You can compete in the rankings with many friends in the the world.<br/>In the results of the game, You can check your world ranking right away.<br/><br/><br/>◆◇◆ Open EVENT ◆◇◆<br/>1. Event of friend invitation<br/>- You can get 1 disk per friend who invited.<br/>- 10 Invitations = 10,000 M-Coins<br/>- 20 Invitations = 25,000 M-Coins<br/>- 30 Invitations = 30 Sound Ball<br/>- 40 Invitations = ‘A’grade Character coupon<br/><br/>2. Event of double-reward (until  last day of June)<br/>- During the event, You can get double M-Coins as reward. <br/>- Begin you first before friends, and try to level up fast.<br/><br/>3. Gather Gather Event<br/>- Collect all the letters in game.<br/>- You can get a lot of gifts if you collect 'Beat PangPang!!'.", "metacritic": null, "released": "2014-05-15", "tba": false, "updated": "2019-10-22T14:21:22", "background_image": "https://media.rawg.io/media/screenshots/31f/31f44383eda70860040d6e7001c39bf6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SmartPlayland"], "genres": ["Action"], "publishers": ["JoyLoL CO.,LTD."], "esrb_rating": "Everyone 10+"}