{"id": 853532, "slug": "charcoal-patrol", "name": "Charcoal Patrol", "name_original": "Charcoal Patrol", "description": "<p>A game made during 10 days for VimJam 3</p><p>(note: Godot 3 has known issues with sound for html exports, the Windows executable does not share such issues. It's still perfectly playable in HTML but just be aware if in particular the Game Start jingle sounds off)</p><p>\n</p>Controls:\r\n<p><strong>Movement: </strong><br/>WASD /Arrow Keys/ D-Pad</p>\n<p><strong>Ax (hold to charge!)/ Menu Confirm:</strong><br/>Spacebar /'Z' key/ Gamepad Button 0 ('A' on xbox controller, 'X' on playstation's)<br/></p>\n<p><strong>Interact (repair building, deposit firewood, fire up charcoal):</strong><br/>'E' key /'X' key/ Gamepad Button 1 ('B' on xbox, 'O' on playstation)</p>\r\nOverview:\r\n<p>A single-screen arcade action game where you play Layne, a lumberjack who's helping their community survive harsh and haunted winters. You must deliver firewood to heat the homes up while fending off the ice-possessing spirits of those who've succumbed to winters past (colloquially known as Frosbiters). </p>\n<p>You ax is both used as a weapon to ward off the monsters, and the tool of your trade. However, your main key to survival is the varied use of wood!</p>\n<p>Fallen trees can pin the monsters, greatly injuring them and leaving them unable to respawn until freed. </p>\n<p>You can hop onto fallen logs to roll your way through the snowy fields at an accelerated pace, pinning monsters in your way and clearing the snow for easier traversal.</p>\n<p>You can chop the logs into raw lumber, which can then be: <br/>- used to repair broken buildings(which lose heat at a greater rate!)<br/>- delivered at a home as firewood<br/>- fired up in the kiln to make charcoal, which is far more effective as firewood!</p>\n<p>There are 5 levels, each a year of your character's service. Aim for as high a score as you can before you retire, good luck!</p>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T12:00:00", "background_image": "https://media.rawg.io/media/screenshots/afb/afb8ba969cbf8f5c13b93e3bda209a22.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["J Loy"], "genres": ["Action"], "publishers": [], "esrb_rating": null}