{"id": 853598, "slug": "sky-high-chronos-endless", "name": "Sky High Chronos Endless", "name_original": "Sky High Chronos Endless", "description": "<p>This is an English fan translation of the game \"Sky High Chronos Endless\" by Mosu in collaboration with the Kawasaki Club.</p>\n<p>Sky High Chronos Endless is a flying adventure game. The game follows four characters who, for reasons unknown, live on a floating island within a seemingly endless sky. In order to gain a better understanding of their surroundings, they explore the skies around them with their airship, the Chronos. </p>\n<p>This is one of the first games in a series by the same creator, and it recently celebrated it's 10th birthday. Though it's an older series, it has a lot of mysterious elements to it that I've seen discussions of even to this day.</p>\n<p> <strong>Game engine</strong>:   RPG Maker XP                                                                                                     <strong>Playtime</strong>:  ~10 hours                                                                                                                           <strong>Content warning</strong>:  Depictions of death, language</p>\n<p>Original website (Japanese): http://kawasakibu.web.fc2.com/sce/index.html</p>\n<p>Developer's website (Japanese): https://mos.fanbox.cc/</p>\n<p>Developer's Twitter (Japanese): https://twitter.com/sce2_dev?lang=en</p>\n<p><strong>&lt;Features&gt;</strong></p>\n<ul><li>Five endings plus a secret ending </li><li>Original music and artwork </li></ul>\n<p><strong>&lt;Characters&gt;</strong></p>\n<p><strong>Zelkova</strong> (\"Keyaki\" in the Japanese version)</p>\n\n<p>The central figure of the group. The Chronos (their airship) doesn't take off without him. He acts like a typical leader, but nobody seems to mind. That's because he's the leader. He doesn't seem to be too capable in terms of the game's mechanics, but everyone seems to have faith in him regardless. Is that really the case though? <br/></p>\n<p><strong>Camellia </strong>(\"Sazanka\" in the Japanese version)<br/></p>\n\n<p>The copilot. A bit silly and outspoken.  When partnered with Zelkova, she'll demonstrate various useful in-flight skills including meter tuning, weight control, and overall flight optimization. Zelkova has faith in her for this reason, just as she has faith in him.<br/></p>\n<p><strong>Azalea</strong><br/></p>\n\n<p>The mechanic. Doesn't like venturing out too much as he's more of an indoor person. For this reason, many of his skills are only effective while he's left at the base. His very desire to stay indoors itself has given him unique indoor abilities, giving him a good excuse to not leave. However, he might be forced to in order for him to level up. Reality is cruel like that.<br/></p>\n<p><strong>Apricot</strong><br/></p>\n\n<p>Management. An irrational sleepyhead who won't wake up even when jolted, hit, pushed, or pulled. Her sleep that distances her from the waking world is caused by nothing more than her own free will. Perhaps she sleeps a little too much. It's hard to understand what she's saying sometimes, but her extensive management capabilities are highly valued.</p>\n\n<p><strong>&lt;Instructions&gt;</strong></p>\n<p>Simply run \"Launcher.exe\".</p>\n<p><strong>&lt;How to play&gt;</strong></p>\n<ul><li>Menu navigation and general movement: [Arrow Keys]</li><li>Confirm/continue text: [C Key] by default.</li><li>Cancel/Back: [X Key] by default.</li><li>Config menu: [F1]</li><li>Reset: [F12]</li><li>Text can be skipped by holding the [X Key] or [CTRL].</li></ul>\n<p>Special thanks to: </p>\n<ul><li>Dreamsavior, whose translation software (Translator++) made this project possible. </li><li>enigmaopoeia from Memories of Fear, whose generous assistance and mentoring also made this project possible.</li><li>Katrina who generously offered her assistance in editing.</li></ul>\n\n<p>Please help me out by reporting any typos, bugs, or any other errors down below!</p>\n<p>Thank you for playing!</p>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T12:28:16", "background_image": "https://media.rawg.io/media/screenshots/548/5485503ee15a8e903d85e4b94dc22e5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["not_worldTL"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}