{"id": 853761, "slug": "vr-museum-itch-braydenr-frost", "name": "VR Museum (itch) (BraydenR-Frost)", "name_original": "VR Museum (itch) (BraydenR-Frost)", "description": "<p>Introduction/Overview\r\n</p>\n<p>Screen Capture\r\n</p>\n<p>This application is a fun and interactive walk-through experience of a museum and art gallery that is different to similar experiences available online. This application is designed to show off art and artefacts of various cultures and time periods and allows the user to interact with these objects, giving the user a personal experience with these cultural works, whilst still feeling like a real museum.\r\n</p>\n<p>Description of Application\r\n</p>\n<p>This application allows the user to virtually view and experience cultural works. Often it is difficult to travel to the locations where these works are housed and displayed. Because of this, a way in which people who are unable to travel has been created to allow these people to still experience these pieces in a more real and immersive fashion than just a picture or a photo. Virtual reality museum tours are nothing new. It is possible to explore some of the largest museum collections in the world, online, through the use of virtual reality (16). Unfortunately, many of these tours still use photos of the exhibits, not 3d models. Because of this, virtual reality was chosen as the interface technology for this application as it would be able to immerse the user far more effectively than altered reality. This app not only allows the user to view these works in 3D, creating this more immersive experience, but it also allows the user to interact with some of these items, which could never happen in the real world.\r\n</p>\n<p>Interaction Design\r\n</p>\n<p>Movement and handling of certain objects in the application have been made possible so that the user can get up close to the objects being displayed. Any 3D objects small enough to be handled by a person in real life are able to be handled by the user in the application so they can turn them over in their hands and see the details of these works. Art such as paintings and pictures have not been made intractable in this version of the application, however, it is not something that has been completely dismissed as a possibility as of yet. Instead, what was decided upon was the user is able to press a button at the beginning of the walk-through, which allows for darker lighting, with each art piece lit by a single spotlight creating a more atmospheric experience. The reasoning for this interaction is that it gives the user the choice between how they view the scenes. The first option allows for viewing each item on display with minimal shadowing and a bright environment which is best for detailed viewing of the object (15). The second creates a darker and more moody scene, highlighting the works through the use of directional lighting, which is better for a viewing experience (15). These different viewing experiences are what galleries such as MONA and The Tasmanian Museum and Art Gallery do, to draw attention to specific displays.\r\n</p>\n<p>Proposed Interactions\r\n</p>\n<ul><li>Lighting - The lighting interaction allows the user to click a button at the beginning of the application, just as the user begins the tour. This button changes the overall lighting in the scene so that it is darker. It also turns on lights for each of the displays that are being shined upon, making each display more eye-catching.\r\n</li><li>Display Piece Interaction - The display piece interaction allows the user to handle some of the displayed objects. The only display piece interaction that was implemented was the Vase on the pedestal at the end of the walk-through. Other display piece interactions that could have been implemented were some of the smaller pictures on the walls i.e. the Mona Lisa.\r\n</li><li>Alarm - The Alarm would sound when the display piece was interacted with. When the display piece was removed from the pedestal the collision boxes of the vase, and the pedestal would no longer collide, signalling the alarm to sound. when the vase was placed back on the pedestal or a button on the back of the pedestal was pressed, the alarm would stop. This interaction was not implemented as it was too buggy, and there was not enough time to fix it.\r\n</li></ul>\n<p>Storyboard\r\n</p>\n<p>\n</p>\n<p>Technical Development\r\n</p>\n<p>Interface Technology\r\n</p>\n<p>The interface technology used is the Oculus series of VR headsets. The Oculus Rift was used to test, but the final build was built with the Oculus Quest series in mind as the target interface technology.\r\n</p>\n<p>Interaction Engagement Descriptions\r\n</p>\n<ul><li>Lighting - To change the lighting press the red button on the left wall of the hallway just as the user spawns in. Each press will swap the lighting settings between the two options.\r\n</li><li>Display Interaction - in the final room there is a Vase on a pedestal. The vase can be taken off the pedestal by moving close to it and interacting with it by using one of the controllers and reaching out to it. Once the hand is on the Vase, hold the grip button on the controller handle and it will snap to the player's hand. From here, as long as the grip button is held down the vase will stay in the player's hand and can have its position and rotation manipulated by the plate. let go of the grip button to drop the vase.\r\n</li></ul>\n<p>Descriptions of 3D models\r\n</p>\n<ul><li>Low Poly Vase\r\n</li></ul>\n<p>Used for Display Piece Interaction.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Mona Lisa Picture\r\n</li></ul>\n<p>Used in the art gallery section of the scene as decor.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Wall Painting 1 (coloured squares)\r\n</li></ul>\n<p>Used in the art gallery section of the scene as decor.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Wall Painting 2 (mountains)\r\n</li></ul>\n<p>Used in the art gallery section of the scene as decor.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Wall Painting 3 (coloured triangles)\r\n</li></ul>\n<p>Used in the art gallery section of the scene as decor.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Angel Statue\r\n</li></ul>\n<p>Used to show scale in the first room of the scene.\r\n</p>\n<p>\n</p>\n<ul><li>Art Gallery\r\n</li></ul>\n<p>Used as the floor layout for the museum in the scene.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Pedestal\r\n</li></ul>\n<p>Used to hold the Vase in the last room of the scene.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Bench\r\n</li></ul>\n<p>Used cosmetically to make the experience feel more realistic.\r\n</p>\n<p>\n</p>\n<ul><li>Low Poly Door\r\n</li></ul>\n<p>Used cosmetically to make the experience feel more realistic.\r\n</p>\n<p>\n</p>\n<p>References\r\n</p>\n<ol><li>Amphora by Bruno Oliveira [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/7Q8MkXjALbL)\r\n</li><li>Wall painting by jeremy [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/62zn39CRkbG)\r\n</li><li>Wall painting by Poly by Google [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/3dycV-ViQH-)\r\n</li><li>Picture frame by Gabriel Valdivia [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/6FS0HuI4XXz)\r\n</li><li>Wall Art 06 by Jarlan Perez [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/1U5roiXQZAM)\r\n</li><li>AngelStatue by Zsky [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/6v4CL0nKfT)\r\n</li><li>Art Gallery by Wyatt Roy [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/9jW6ZCUbH89)\r\n</li><li>Simple Pillar by Troct Developer (Troctzul) [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/8AJVYPEBVqt)\r\n</li><li>Modern Bench by Jarlan Perez [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/3rcNKBeKqdt) \r\n</li><li>Nice Door by Wesley Thompson [CC-BY] (https://creativecommons.org/licenses/by/3.0/) via Poly Pizza (https://poly.pizza/m/00xFHE4LR_6)\r\n</li><li>Do Not Touch Sign (https://cdn.shopify.com/s/files/1/0480/8291/1400/products/SIGN-0175-A2_900x.jpg?v=1602825900)\r\n</li><li>Bell Alarm Sound (https://www.youtube.com/watch?v=rNqsEu5o3q0&amp;ab_channel=AudioSounds)\r\n</li><li>Click Sound (https://www.youtube.com/watch?v=S_lXHisgYls&amp;ab_channel=GamingSoundFX)\r\n</li><li>Button Control Tutorial (https://www.youtube.com/watch?v=ZBHrYXeSKa4&amp;ab_channel=Mr.PineappleStudio)\r\n</li><li>Designing with Light (https://www.erco.com/en/designing-with-light/culture/culture-6493/?gclid=Cj0KCQjwvZCZBhCiARIsAPXbajvFUiDUfwglyvzq7rxKasJgpG15MPAkFCO_pavf3zbtavClZ-7GmRYaAlNtEALw_wcB) \r\n</li><li>Non Exhaustive List of Virtual Museum Tours (https://www.virtualiteach.com/post/2017/08/20/10-amazing-virtual-museum-tours)  </li></ol>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T13:35:17", "background_image": "https://media.rawg.io/media/screenshots/405/405ccbe18bd529d2a13a789f92d0ed2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["BraydenR-Frost"], "genres": [], "publishers": [], "esrb_rating": null}