{"id": 853713, "slug": "get-it-together-2", "name": "Get It Together!", "name_original": "Get It Together!", "description": "<p>Walkthroughs of this Demo can be found here:\r\n</p>\n<p>https://youtu.be/6JIbHebzjCc playthrough with commentary\r\n</p>\n<p>https://youtu.be/kTw1xBbO3lI playthrough with no commentary\r\n</p>\n<p>STORY:\r\n</p>\n<p>While working on a formula that would grant immortality, Supermodel/ chemist “CHAD GRANITE” was attacked, splashing his serum all over and exploding him to bits.<br/>With the power of his life-giving serum, you must guide him through 16 explosive levels by reviving yourself and heading to the exit.\r\n</p>\n<p>Gather your wits along with your bodyparts to confront the mad bomber and win, FOR SCIENCE!\r\n</p>\n<p>DESCRIPTION:\r\n</p>\n<p>This is a puzzle platformer where the player need to figure out how to collect all their bodyparts to complete each level.<br/>Each bodypart moves in a different way. For example, legs can jump, but a head can only roll, The butt can propel itself in the air, and the torso can punch through certain objects<br/>all combinations of these parts move differently, so the picking the right combination of parts is sometimes crucial. you may sometimes want to discard a picked up part to get through certain paths.\r\n</p>\n<p>There are security doors in some levels that require the player to touch a scanner to open. A retinal scanner must be activated by the head bodypart, the hand scanner must be activated with the torso bodypart.<br/>the final scanner that opens the exit to the level must be activated after collecting all your parts.\r\n</p>\n<p>Controls:\r\n</p>\n<p>UP: enter doorway/ move ghost up<br/>DOWN: Pick up a bodypart / move ghost down<br/>LEFT: Move left<br/>RIGHT: Move right<br/>A:Jump<br/>B:Punch<br/>SELECT: Drop bodypart<br/>START: Pause / Unpause\r\n</p>\n<p>Made for Byte-Off III 2022<br/></p>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T13:16:45", "background_image": "https://media.rawg.io/media/screenshots/55d/55d4f0d6c7468526695d5807ab97d74d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SciNEStist"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}