{"id": 853702, "slug": "vr-museum-2", "name": "VR muséum", "name_original": "VR muséum", "description": "<p>INTRODUCTION</p>\n<p>In today’s era, historical subjects and reading are found very boring by the high school students and taking me as an example, I never studied with interest, the historical subjects. In my home country, many high school take students on a short school trip on the historical monuments and suites, which just seems to be a wastage of time and money. I went to many historical trips and learnt nothing on them, just the day out with friends. Therefore, I kept myself on the same position and I made a Virtual reality application that not only creates such historical studies interesting but also will save time and money.</p>\n<p>APPLICATION DESCRIPTION  AND ADVANTAGES </p>\n<p>This application uses human interaction in the virtual world to teach the student in an interesting way. In this application, an individual can go inside the museum  and experience a real short trip without spending money and saving a lot of travelling time. This application is designed to give a view of the world back 500years ago. This application has a proper view of a room of kings or queen with many ornaments ,objects in it and all the necessary things in a room of king. Moreover, i didn’t restrict this application to just a museum or a historical room, but I also created an environment that expresses the lifestyle of people living 500years ago without any modern facilities. The major advantage of using is that high school student, whenever they visit to museum, they have a wish to touch Entique objects but they are not allowed to, so I made all the object in kings room with the rigid body, so that they can interest and make things interesting.</p>\n<p>INTERACTION DESIGN</p>\n<p>In this application, to make it different from the real world experience I had put multiple interactions. There are many small objects in the room such table, books, bookshelves, ornaments, fire flames etc. which students can interact and have fun. It will also be a better way of learning instead of going on trips to historical monuments by wasting money and alot of time. The application consist of many short small objects and it also has a corridor and it has two sides. One side represents the kings castle and on the other side it shows the market, and ordinary peoples houses. Students can also change the color by tap on it.</p>\n<p>TECHNICAL DEVELOPMENT </p>\n<p>This application was developed in Unity 3D and used the Oculus Integration package available on the Unity asset store. The Oculus Integration allows development support for Oculus VR and some other supported devices. All the the small small ornaments and objects are taken from the unity store.<br/></p>\n<p>OBJECT INFORMATION</p>\n<p>In this application, I have used various commodities of kings castle. That are castle, wall, floor, table chair, bed, treasure, box’s, bookshelves, books, kings flag, fire place for a room, and so on the building. This application is the magnificent example of  ancient times. All the models are used the website provided below.</p>\n<p>https://assetstore.unity.com/?gclid=EAIaIQobChMIhdOrr8Wd-gIVAiQrCh0rzwK7EAAYASAA...<br/></p>\n<p>https://assetstore.unity.com/?gclid=EAIaIQobChMIhdOrr8Wd-gIVAiQrCh0rzwK7EAAYASAA...</p>\n<p>https://assetstore.unity.com/?gclid=EAIaIQobChMIhdOrr8Wd-gIVAiQrCh0rzwK7EAAYASAA...</p>\n<p>https://assetstore.unity.com/packages/3d/environments/historic/voxel-castle-pack...<br/></p>", "metacritic": null, "released": "2022-09-18", "tba": false, "updated": "2022-09-19T13:11:55", "background_image": "https://media.rawg.io/media/screenshots/56d/56d5075b0ad5d78982ce4eb6ddea8c73.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 15, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Utas_Manjot"], "genres": [], "publishers": [], "esrb_rating": null}