{"id": 853805, "slug": "trade-and-magic", "name": "Trade And Magic", "name_original": "Trade And Magic", "description": "<p>Trade and Magic is set in a toon fantasy world where you have to manage your shop and village.</p>\n<p>You are a wizard who chooses to invest in their alchemical shop. Who provided you of the building is the most famous guild in the kingdom and it will ask you to pay your fees weekly.</p>\n<p>Your shop isn't just a shop. Those are for villagers, but you're not. You're a wizard, maybe the strongest in the whole kingdom, so what you've got is a dungeon! Well, your dungeon will surely be... how to put it... cozy at first... but then, you will make it grow into a huge maze where people will beg for your help at the feet of your throne!</p>\n<p>What services will you offer? Why not all of these?</p>\n\r\nimplemented\r\n<p><strong>- Alchemical laboratory:</strong> mix up your ingredients in the melting pot to create potions. You are free to create Elixirs to help nice people or Badelixirs to damn them;</p>\n<p><strong>- Shop Upgrades And Merchant: </strong>Use your coins to the merchant to upgrade your shop and adding features.</p>\r\nNot Implemented Yet\r\n\n<p><strong>- Enhancing stone:</strong> a workstation with a special stone which can enhance armours or weapons with the elements of this world, like fire, ice, wind or the magic ones like light and darkness;</p>\n<p><strong>- Magic research library:</strong> a huge library with countless tomes and books about magic. This is where you will look up your next spells, improve the ones you've already learned, and get ready to spend a whole lot of your money.</p>\n<p><strong>- The Primal Trees: </strong>The ancient primal trees collide in a fight for the egemony of the isle, will you join with the tree of life and the druids or you will fight all that is sacred with the tree of Death joining the Cult?</p>\n<p>You can find ingredients on the ground, as well as underwater. You are no amphibious, so try to collect them without facing some big fish's fangs or death itself. Probably spells will help you gather everything quickly or make you win some gadgets...!</p>\n<p>Let me point out that this game is still in development and I'm working on this by myself. As a one-man-army, every donation I receive will be very appreciated and invested into this project. Unluckily I cannot work only on this one for now, since this isn't a stable income source yet (and I gotta eat something every once in a while, so I got another job), but I'll try my best to bring out noteworthy updates.</p>\n\n<p><em>Every donor will have their nickname or real name (up to you, let me know) on some NPCs or clients, and the first three of you will name the game's shopkeepers! That's a little gift for the first ones of you who will trust in me and my project.</em></p>\n<p>Thank you everyone! I'll keep adding stuff to this game and drop a link below once it will be ready to play. =)</p>\n<p>- Lykan Iluvatar -</p>", "metacritic": null, "released": "2022-09-17", "tba": false, "updated": "2022-09-19T13:52:18", "background_image": "https://media.rawg.io/media/screenshots/8c1/8c16b72977a4c66df89016a37e166b2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lykan"], "genres": ["Action", "Adventure", "RPG", "Simulation"], "publishers": [], "esrb_rating": null}