{"id": 85404, "slug": "duelbeats", "name": "DuelBeats", "name_original": "DuelBeats", "description": "**On sale for a limited time.<br/>Grab your copy NOW!**<br/><br/>Designed to get the pulse racing, DuelBeats is a competitive VS beat rhythm battle game. Take down your friends in adrenaline fueled musical battles where each tap and swipe inflicts major damage.<br/><br/>Perfect your tap timing to amp up the volume of damage. Win tap sync battles by breaking your opponent's defenses and depleting their health bar. Earn coins to summon new powerful heroes each with mesmerising special abilities.<br/><br/>SIMPLE intuitive controls keep the endorphins flowing and your foot tapping<br/> <br/>POWER up unique hero abilities and unleash their combos to crush your opponent<br/><br/>DEFEAT your opponents in intensive single player and real-time multiplayer fights both Online and on the same device<br/><br/>SUMMON up to 18 unique Heroes with special abilities from the summoning portal. Discover enhanced rare, epic, legendary and special skins to boost damage potential<br/><br/>UNLOCK 18 original music tracks with 3 levels of difficulty produced by talented artists across a range of pulsating genres such as EDM, hip-hop and rock. The overall experience is best enjoyed with headphones.<br/><br/>RELAX with easy on the eye graphics and lose yourself in the rhythm, or chose to whip your levels of coordination into a frenzy. How you play the game is your choice<br/><br/>AVATARS contribute towards your overall coin haul depending on their rarity <br/><br/>Beat 'em up to the beat!<br/><br/>If you enjoy DuelBeats make sure to give us a shout out in the reviews - 5 STAR reviews are welcome!<br/><br/>Got an issue? Contact the developer - <br/>gamesupport@kizstudios.com<br/><br/>For more information please visit -<br/><br/>http://www.duelbeatsgame.com<br/><br/>(c) 2017 Kiz Studios, Inc", "metacritic": null, "released": "2017-07-07", "tba": false, "updated": "2019-07-30T10:26:10", "background_image": "https://media.rawg.io/media/screenshots/478/4781dc6c7ebe8f441d5083a6c232d2cd.jpg", "website": "http://www.kizstudios.com/duelbeats", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiz Studios", "Sunrise Games"], "genres": ["Action"], "publishers": ["Kiz Toys", "Sunrise Games"], "esrb_rating": null}