{"id": 854071, "slug": "phantoms-in-the-camp", "name": "Phantoms in the Camp", "name_original": "Phantoms in the Camp", "description": "In 1982, unspeakable and horrible events took place in a summer camp. Except for a single camper, everyone was murdered by an unknown individual. <br/>The police spent days picking up the bloody body pieces left by the killer. <br/>The only survivor: a terrified girl who lost some of her memories because of the trauma. <br/>It's been 2 years since the massacre, and Sandy, the girl who survived that day, has decided to return to the camp in order to overcome her trauma and her fears, and recover some of her missing memories... \r\nThere are phantoms in her heart...but some of them will never go away...\r\n\n<p><em>Phantoms in the Camp</em> is a retro pixel art game inspired by the horror movies from the 80's. You control Sandy, the only survivor of a summer camp  massacre that took place two years ago. She recently started college and became friends with Chris, a brave young man who is determined to help Sandy overcome her fears by going with her to the ruins of the camp.<br/>Created with Rpg Maker MZ</p>\n<p>Made for the 13th RPG Maker Horror Game Jam<br/></p>\n<p>Features:</p>\r\n\r\n2 endings based on your actions\r\n\r\nIntriguing puzzles\r\n\r\nRandomly generated enemies that are able to enter into other rooms\r\n\r\nOriginal unique soundtrack by Axel Vejar Dossow\r\n\r\nJumpscares\r\n\r\nOppresive ambience and setting", "metacritic": null, "released": "2022-09-17", "tba": false, "updated": "2022-09-19T15:45:38", "background_image": "https://media.rawg.io/media/screenshots/523/5235ccbcfe072bbea4e1de679322a86c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Axel Vejar Dossow"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}