{"id": 854283, "slug": "kutsongo-kutsongo", "name": "Kutsongo Kutsongo", "name_original": "Kutsongo Kutsongo", "description": "Crea un cambio. Poco a poco logra mejorar la vida de la gente y el planeta.\r\n\r\n\n\r\nCONTEXTO\r\n<p>¿Qué relación existe entre el cambio climático y las dinámicas de género? ¿Has pensado alguna vez en qué problemas enfrentan las personas y los ecosistemas en los países empobrecidos, y en cómo poder actuar frente a ellos?<br/></p>\n<p>Lo descubrirás en cuanto “pongas pie” en una aldea rural de un pueblo del Sur afectada por el cambio climático. </p>\n<p>Acompañarás a nuestra protagonista desde bien temprano en la mañana, en su recorrido para conseguir una comunidad más sostenible e igualitaria, ayudándola a detectar cuales son las causas, y cooperando con ella para implantar soluciones que quizás nunca te habías planteado.</p>\n<p>Kutsongo kutsongo, significa “poco a poco” en Changana, uno de los idiomas locales de Mozambique. Y es que es “poco a poco” como, desde nuestro punto de vista, mejor se hacen las cosas, sobre todo cuando se pretende conseguir un cambio real y duradero. </p>\n\r\nCONTROLES TOUCH AND DRAW.\r\n<p>Moverte: pulsar la pantalla donde quieras ir.</p>\n<p>Interaccionar entorno: pulsar la pantalla en aquello que tenga un contorno amarillo o pulsar la mano que aparece en la esquina inferior izquierda.</p>\n<p>Controles minijuegos: Realizar los gesto que indica la mano que aparece como pista.</p>\n\r\nCRÉDITOS\r\n<p><strong>Andrea Marco Caballero</strong> - 3D &amp; 2D Artist, Game Designer.</p>\n<p><strong>Lucas Matías González Calderón</strong> - Programmer, Game Designer.</p>\n<p>Bosque y Comunidad es una ONGD española cuyo objetivo es mejorar las condiciones de vida de las comunidades rurales, principalmente en países del Sur, a través del desarrollo de medios de vida y de la gestión de los recursos naturales, desde una perspectiva sostenible, participativa y con enfoque de género, y de adaptación y de mitigación al cambio climático.\r\n</p>\n<p>Kutsongo kutsongo es un juego gratuito, cuya realización ha sido financiada por la Agencia Andaluza de Cooperación al Desarrollo en el marco del proyecto “Fortalecimiento de las capacidades de la cooperación andaluza en la vinculación e integración de las prioridades horizontales de sostenibilidad ambiental y equidad de género” (0F004/2019) y ha sido producido por Adarsi, una entidad dedicada a la transformación social a través del arte y la gamificación,  que actúa como instrumento para que las organizaciones dedicadas al tercer sector puedan implementar sus propuestas desde los valores de la EpD de una forma innovadora y revolucionaria.\r\n</p>\n<p>¿Te ha gustado este juego?\r\n</p>\n<p>Conócenos en: www.bosqueycomunidad.org y www.adarsi.org\r\n</p>\n<p>¿Alguna pregunta? Contacta con info@bosqueycomunidad.org\r\n</p>", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T17:17:33", "background_image": "https://media.rawg.io/media/screenshots/c39/c39719776547826720559944eb2d3f27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["Lucas Matías González Calderón", "Andrea Marco"], "genres": ["Educational", "Puzzle"], "publishers": [], "esrb_rating": null}