{"id": 854250, "slug": "kre-chan-the-mole", "name": "Kre-chan the Mole", "name_original": "Kre-chan the Mole", "description": "You can get stuck in few places, sorry. \r\n<p>If it happens, You can respawn by killing yourself with F11. Yes, it does work though it gets weird, for example chrome will force you out of the fullscreen:/ You can do it another way - F4 to quit fullscreen, F11 to die, F4 to go back fullscreen. Yeah I know its crap. Sorry.<br/></p>\n<p>For example: You can get stuck after the mole village. To not get stuck get a powerup, just look for a hidden corridor on your right. behind a huge pillar in the first room after the village. Take the power up and you won't get stuck. But F11 should also work anyway.</p>\r\nMade for Metroidvania Month 17 game jam.\r\n<p>Game does not feature saves, but it should be completable in first playthrough in about 20-30 minutes.  I hope. You can see a brief walkthrough at the bottom. Fullscreen/mouse capture may glitch a bit in browser, but click a few times and it should be grabbed by game. Be prepared for few bugs eh. You can skip many things by design, probably too many - but in the end You have to get all powerups and do one quest.</p>\n<p>I am also quite ashamed, but the game is very unoptimized, sorry. It featured lights at some point, but I decided to turn them off. The game will probably run better in smaller resolution (like in window).</p>\r\nControls:\r\nWASD/left analog - move<br/>\r\nmouse/right analog- look around<br/>\r\nSPACE/A button - jump<br/>\r\nLeft mouse buttom/X button - action (interact, talk, fight, etc.)<br/>\r\nESC/ENTER/Start - pause\r\n<p>4 gears collected will give You another life bar.</p>\n<p>Made in godot. Almost all made by me using blender/krita/inkscape/many sheets of paper.  Sounds from https://opengameart.org/</p>\n<p>There are few issues with animations still, and You can probably fell outside of map in few places. You can press F11 if You get stuck to die and respawn.</p>\n<p>Turns out making a 3d game by hand takes an awful lot of time and I had to scrap a lot of things. And not working for the first two weekends due to other plans is... very unfortunate. But its more or less complete so hey, its something.</p>\n<p>If You get lost, feel free to ask in comments.</p>\r\nBrief walkthrough:\r\nMines -&gt; Get Gloves -&gt; Construction site -&gt; Get double jump -&gt; Extinguish fire in greenish map -&gt; Get rope -&gt; Mines, check lava waterfall, actually the place where you get the first power up (see screenshots, there's a ring there) -&gt; Construction site -&gt; Surface", "metacritic": null, "released": "2022-09-16", "tba": false, "updated": "2022-09-19T17:04:58", "background_image": "https://media.rawg.io/media/screenshots/48f/48f1524518ed84adc9a8f119860aea38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["hatmajster"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}