{"id": 854367, "slug": "blood-scheme", "name": "Blood Scheme", "name_original": "Blood Scheme", "description": "Blood Scheme is a game of base on real crime cases from the scam of the century. Play as the journalist to complete your article to stop the company listed before you are the only one who knows this is a scam.<br/><br/>Every round, you will pull the new clue card on the board, and you roll and dice to fulfil the clue condition to gain the resource. Otherwise, the company will raise more funding when those clues fail to resolve.<br/><br/><br/>You are wrong if you think the company is your only enemy! The board of the company is the real enemy behind everything. Face the problem come from every board member, like the media proprietor, former admiral, former senator, former secretary of state, millionaire and so on.<br/><br/>Your article is like a mission impossible, but you know you are the only one who can stop it.<br/><br/><ul><li> Every new game is a random combination of target company skill and board member, chosen by you to start the game. <br/><br/><br/></li><li> Roll dice, use dice to fulfil clue condition. if you fail to complete the clue, your enemy will move 1 more step for public listing.<br/><br/><br/></li><li> Use rolled dice to prevent triggering enemy skill. Every round enemy will roll company dice to trigger the skill, and you need to do risk management for it. Put dice to those skills you want to prevent, it will make you reduce useable dice, but this is your choice.<br/><br/></li><li> New board member will keep joining when the company raise the funding until the target amount. At that time, you can't do anything and just can looking the company getting stronger. Make sure to build up your advantages before too late. <br/><br/><br/></li><li> When you gain enough resources, you need to take risks to open an unknown evidence card.  If you have enough clue resources, you can exchange them to be your victory point! Otherwise, the evidence card will trigger events, and the results can either be good or bad. <br/><br/><br/></li><li> Careful for your stress level, it will break you when it reaches 10!<br/></li></ul>", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-09-23T04:00:54", "background_image": "https://media.rawg.io/media/screenshots/952/9529618290a4be6c2dd989930b97f26e.jpg", "website": "http://www.blackphoenixgamestudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Black Phoenix Studio"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Black Phoenix Studio"], "esrb_rating": null}