{"id": 854375, "slug": "mimetic-love", "name": "Mimetic Love", "name_original": "Mimetic Love", "description": "Three men and one destiny. What will happen? Difficulties and overcoming. Get ready to live this adventure. Nothing will be as it once was. Everything has its time... And here will not be the exception... Love, jealousy, resentment, forgiveness... What would you do in the midst of love and envy? Would you forgive and stay? Or maybe you would forgive and leave? Live the experience, don't let it go.<br/>\n<br/>\r\nGAMEPLAY<br/>\n<br/>\r\n- Immerse yourself in a game where a man with a dark past finds someone who understands and complements him.<br/>\r\n- Immerse yourself in this unique story of love and jealousy, with a soundtrack and effects that will make you get involved in the story and with the possibility of choosing options in the dialogue with full control with the gamepad and keyboard<br/>\r\n- Choose dialogues and walk through different totally different locations while enjoying the plot of love and hate.<br/>\r\n- Explore locations set in Asian streets and locations with soundtrack<br/>\r\n- Choose dialogues during the plot to change the thoughts of the characters and their responses<br/>\r\n- Enjoy and interact in a great plot with 5 different characters<br/>\r\n- Read their answers and interact as you like in the dialogue<br/>\r\n- More than 10 different places to interact and explore<br/>\n<br/>\r\nThis game was made to support the creation of video games and the youtube channel.<br/>\r\nhttps://www.youtube.com/channel/UC0TrwpVAW7G5PEXVZfgOoxg<br/>\n<br/>\r\nP.S: In the next few days, I'm going to upload a new update with all the improvements or bugs and suggestions that buyers give me and I'll be making free DLCs for everyone who buys the game :)", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-09-23T04:10:01", "background_image": "https://media.rawg.io/media/screenshots/f35/f3557202ca521a008af4c171d534cdaf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Daniel Pintado Game Development", "Resistire33"], "genres": ["Casual"], "publishers": ["Resistire33"], "esrb_rating": null}