{"id": 854403, "slug": "desert-revenant", "name": "Desert Revenant", "name_original": "Desert Revenant", "description": "Beautiful, engaging, in-depth &amp; addictive; Desert Revenant is a roguelike deck-building RPG that emphasises game knowledge and skill over grind. Taking place in an interesting and storyful world, where the sand hides secrets, and revolt is in play, there are many interesting and dangerous enemies and bosses that you will run into as you forge your path through Elmyr. Think about your every move and make careful decisions in hand-crafted encounters as you cut deals with Jinn and humans alike in your adventures amongst the dunes.<br/><br/><strong>Features:</strong><br/><ul><li> Featuring multiple playable characters with a multitude of unique cards and tons of upgrades.<br/></li><li> A unique focus on minions and summonable allies.<br/></li><li> Multiple stories to explore where your decisions affect the world.<br/></li><li> Visuals crafted by the Gods themselves.<br/></li><li> Two maps at launch with dozens of hand-crafted encounters each and multiple difficulty levels. <br/></li><li> Experience a vibrant Arabian world, filled to the brim with story arcs and subplots.<br/></li><li> Upgrade cards and carve out your own playstyle!<br/><br/>As Desert Revenant goes into Early Access, it may not have the full roster of all the enemies and all of the playable characters, but the core experience will still be there, and any feedback about the game will be greatly appreciated, as we build and improve on the game as a community.<br/><br/><br/><br/><strong>The sun burns your eyes, mirage hovers and shakes over the sands of Elmyr, you know that your journey will lead you to adventure and danger, the likes of which you can’t conceive.</strong><br/><br/>The city of Soom has burned and now the Sultanate is waging war against the Jinn Kings, you get to choose from an array of characters to take on this journey, like the Leper and the Seer, and you must put together a deck capable of getting you through this harsh desert unscathed. The decisions you make dramatically change the storyline of the game, and the very fate of Elmyr itself. Explore a huge map and collect a massive variety of cards to do battle with as you face off against a mysterious roster of enemies and villains. Experience a game within a game, with enthralling mini puzzles to solve.<br/><br/><br/><br/>The sands of Elmyr await, do you have the brains and the brawn to survive? Or will the past repeat itself once again, and you fall into perdition.</li></ul>", "metacritic": null, "released": "2022-09-22", "tba": false, "updated": "2022-09-23T04:45:25", "background_image": "https://media.rawg.io/media/screenshots/770/7705ec0d6002cf4790fbfdcf0f000201.jpg", "website": "https://kreationware.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kreationware"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Kreationware"], "esrb_rating": null}