{"id": 854481, "slug": "winged-raider", "name": "Winged Raider", "name_original": "Winged Raider", "description": "Winged Raider is a 2D Shooter roguelike game where you navigate a castle that is crawling with goofy enemies and evil bosses. When you die you have to start back at the beginning, but the further you progress, the more story you unlock. <br/><br/>Do you have what it takes to be the Winged Raider?<br/><br/><br/><br/>Character Customization!<br/>-28 hats (some have multiple colors)<br/>-30 hairstyles in 8 colors<br/>-29 facial hairstyles in 8 colors<br/>-7 skin colors<br/>-12 body colors<br/><br/>Guns and Wings!<br/>-9 guns (5 primary guns, 4 secondary guns) (You can carry one primary and one secondary gun)<br/>-6 wing abilities (different colored wings grant different abilities)<br/><br/>Evil Enemies!<br/>-16 Different enemies<br/>-6 Bosses<br/><br/>All enemy, gun, and wing stats are available to read about in the main menu! Check under the more button for item info (guns and wings) and enemy info. Info on bosses is unlocked under enemy info when they are defeated.<br/><br/><br/><br/>The Kingdom of Daanco was saved thousands of years ago by a great hero. However, the Winged God stands to destroy everything. Turkzu has begun the attack of the Winged God and seeks to rule the Kingdom of Daanco under the Winged God. Save the Kingdom of Daanco from the curse of Turkzu! <br/>Your mission: <br/>-Infiltrate the Winged Castle<br/>-Defeat any who dare stand in your way<br/>-Eliminate Turkzu<br/>-Daanco is saved<br/><br/>But one question still remains. . .<br/><br/>Who is Turkzu?", "metacritic": null, "released": "2022-09-22", "tba": false, "updated": "2022-09-23T06:22:42", "background_image": "https://media.rawg.io/media/screenshots/2e8/2e89ce1ddfb7531a8a911ca5245eca4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["SauceyPlayz", "Trippycat"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["SauceyPlayz"], "esrb_rating": null}