{"id": 854410, "slug": "holiday-with-gwen", "name": "Holiday with Gwen", "name_original": "Holiday with Gwen", "description": "Step into the shoes of detective Hank and his sidekick Gwen from the Snares of Ruin universe. This time they have a top secret mission in an exotic Mediterranean-like country to uncover an illegal drug trade, but also to use this opportunity to enjoy themselves and perhaps even to savour romantic moments.<br/><br/>A work assignment that's also a holiday. How can you say no to a relaxing time at the beach or by the pool or exploring the city streets and cafes? Moreover, you have Gwen accompanying you everywhere, your cute, sweet and positive-minded co-worker, friend and perhaps even lover with whom many romantic moments can be had. But don't forget the mission. We need to know our targets better, as well as their involvement. A millionaire tycoon who is developing revolutionary technology, his helpful yet mysterious assistant, a flirty girl at the beach that won't leave you alone, a peculiar guy taking photos of you while you're walking the streets... We have detective work to do and bad guys to catch and we only have a few days to do it. <br/><br/><br/>General Features:<br/><ul><li> A casual visual novel with a detective plot<br/></li><li> Plenty of romance-building with the leading female character, Gwen<br/></li><li> What kind of relationship we develop with Gwen depends on our dialogue choices and actions<br/></li><li> Mostly a linear story with some branching narrative<br/></li><li> Beautiful and breathtaking scenery and places to see</li></ul>", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2024-02-01T07:58:59", "background_image": "https://media.rawg.io/media/screenshots/95f/95f4a0fbf32e6651ce30099c5fee7cc0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 407, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Astronomic Games"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Astronomic Games"], "esrb_rating": null}