{"id": 854427, "slug": "manservant-gay-visual-novel", "name": "ManServant: Gay Visual Novel", "name_original": "ManServant: Gay Visual Novel", "description": "In Ancient Rome, demons rule and mortals are slaves. Follow the ambitious comfort slave Silvan as he schemes his way into the emperor&#39;s court to accomplish his mission of becoming a demon. He&#39;ll do whatever it takes to reach his goal--no matter the cost.<br />\nBoth handsome and cunning, Silvan believes he can charm anyone, but the royal demons are not the same as his country masters. He commits an offense from the beginning that almost costs his life. The only way he&#39;ll be spared is to accept the role of comfort slave. Silvan has no choice.<br />\nA Manga/Visual Novel Hybrid!<br />\nFeaturing 20 Full Color CGs and over 100 Black and White Manga Panels<br />\nA Darker, Kinkier, and More Extreme Y Press Offering<br />\nThree Love Interests and Four Possible Routes<br />\nIncludes a Polyamorous Route<br />\nA Haunting Original Soundtrack of 12 Songs<br />\nOver 150,000 Words of Story<br />\n14 Possible Game Endings<br />\nPress &#39;v&#39; to Have Dialogue Read Out Loud<br />\nSilvan​He&#39;s been a slave to ugly and ignorant rural demons all his life. He knows he&#39;s handsome and thinks he deserves better. Not knowing his place in the demonic empire is a sin that will haunt him.<br />\nEmperor TitanThe god Pluto made Titan the emperor of Rome due to his wisdom and strength, and he&#39;s sat upon his throne for hundreds of years. His tacit gaze sees through any scheme Silvan might try with him.<br />\nMinister of War MariusMarius&#39; dark and violent side is easily unleashed upon slaves who don&#39;t know their place--or those foolish enough to try to manipulate him. He specializes in something called the &#39;Ecstasy of Agony.&#39;<br />\nCounselor ClaudiusThe once mortal counselor helps to balance out Marius&#39; cruelty with mercy in the royal court. He&#39;s earned his place at the emperor&#39;s side with his intelligence and reason. Though fearsome in looks, he seems compassionate.<br />\nTitan and Marius BothThere is more than a working relationship between the emperor and his minister of war.  Could an adept slave manage to lower the boundaries between them, while winning both their hearts at the same time? Throuples are not unheard of in the empire.<br />\nJulianJulian has been a comfort slave for the royal court for several years. He has the same ambition as Silvan: to gain his freedom by turning into a demon. He doesn&#39;t appreciate that he now has a rival.<br />\nAquilaThough not a comfort slave, Aquila is afforded special privileges since she sometimes finds herself in a demon&#39;s bed. She has no ambitions, and may warm up to Silvan in time.<br />\nManServant is a visual novel and manga-style comic book hybrid.  There are both CGs (full color images) and manga panels to illustrate the story.<br />\nPlayers can pursue Titan, Marius, Claudius, or both Titan and Marius--four full romantic routes!  Over 100,000 words and loaded with multi-panel manga pages as well as full-color images.</p>", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-09-23T14:02:59", "background_image": "https://media.rawg.io/media/games/6c5/6c52b5122abaa05180dd2dbc55508ef2.jpg", "website": "https://ypressgames.com/manservant-2/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Y Press Games"], "genres": ["Simulation", "Casual"], "publishers": ["Y Press Games"], "esrb_rating": null}