{"id": 854402, "slug": "capoeirogue-dandara-cordao-de-ouro-2", "name": "CapoeiRogue: Dandara Cordão de Ouro", "name_original": "CapoeiRogue: Dandara Cordão de Ouro", "description": "<strong>Capoeirogue: Dandara Cordão de Ouro</strong><br/>is a Roguelike about capoeira that mixes afro-descendant culture in Brazil and fantasy, through the game mechanics you will experience elements that were of great importance to our history. Capoeirogue is inspired by acclaimed games of the genre like Bastion, Hades, Zombies ate my neighbors and other giants of the genre; <br/><br/><strong>Features</strong><br/><br/><ul><li>Fight over a procedural generated map in this topdown action roguelike;<br/></li><li>Rescue prissioners to increase your power;<br/></li><li>Get Random Blessing Capoeira moves and Make your own build;<br/></li><li>Survive to enemies waves.</li></ul><br/><strong>Fight for freedom</strong><br/> The protagonist Dandara is based on the real Brazilian heroine who fought against slavery until the end of her life, was considered queen of Quilombo dos Palmares, the largest quilombo that existed in Latin America; In addition to being a great leader, hunter, mother, Dandara was also an excellent capoeirista.<br/><br/><strong>Orixás </strong><br/>Exú, Ogun, Omulu, Xapanã or Abaluaiê, Xangô, Yasan, Oxossi, Nanan, Yemanjá, Oxum, Oxunmarê, Ossain and Oxalá. The orixás here will give aid and axé to Dandara, taking into account its unique characteristics. There are thousands of viable Character Builds to discover as you progress.<br/><br/><br/><strong>Capoeira </strong><br/>Capoeira is a cultural representation that mixes sport, fight, dance, popular culture, music and games. It is characterized by agile and complex movements, where feet, hands and gymnastic-acrobatic elements are used. A skill tree based on real capoeira movements is the main differential of the game, here you can try different combinations of blows that will make each run unique. <br/><br/><strong>Environment </strong><br/>The game takes place in Brazil in the 1600s, bringing several elements of our culture that were directly influenced by the African culture in our country.", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-09-23T04:43:44", "background_image": "https://media.rawg.io/media/screenshots/09c/09c044a4df7932b4701f71fd09f5f21d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Okaeridev"], "genres": ["Action", "Indie"], "publishers": ["OkaeriDev"], "esrb_rating": null}