{"id": 854401, "slug": "mo-ta-san-guo-zhi-ni-luan-shi-kong", "name": "魔塔三国之逆乱时空", "name_original": "魔塔三国之逆乱时空", "description": "This game is an open RPG game with the background of the Three Kingdoms. Players start by creating a custom character, advance the era of the game by completing the main task, gather teammates, fight monsters and upgrade, forge equipment, learn skills, and then attack cities and seize land when the team is strong enough to unify the world. And then challenge the ultimate immortal boss to save Jinchuan who is lost in the turbulent flow of time and space.<br/>\r\nIn addition to the main line playing method of completing the main line task, this game also provides multiple copy playing methods: Fairy Island playing gods and beasts get enchantment pills, fairy cave playing gods and famous generals get high basic value equipment, and the two are combined to obtain excellent equipment. The dust of dragon balls can be obtained by occupying various cities in each era. After breaking through 49 cities in one era, dragon balls can be synthesized. After occupying all cities in all eight eras, making a wish to the Shenlong in the main base after collecting all the dragon balls can realize a variety of Role Promotion and challenge the ultimate immortal boss.<br/>\r\nWith multi-line career settings, you can advance your career in the game to gain more powerful passive skills and unlock more professional skills.<br/>\r\nThe auxiliary function can now capture a variety of different professional roles in the game. Compared with the previous generation, it has more humanized adjustments and upgrades.<br/>\r\nIf you have ever played the FC version of devouring heaven and earth series, or are particularly fond of the Three Kingdoms background game, this game will certainly give you a different experience.", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-09-23T04:42:27", "background_image": "https://media.rawg.io/media/screenshots/10c/10c4d6cb67082401e459f4774033058f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["赚大钱工作室"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["赚大钱工作室"], "esrb_rating": null}