{"id": 854435, "slug": "squad-51-vs-the-flying-saucers", "name": "Squad 51 vs. the Flying Saucers", "name_original": "Squad 51 vs. the Flying Saucers", "description": "Warning! Extraterrestrials from outer space arrived in our planet bringing promises of a bright new future for the earthlings. However, this intergalactic partnership soon reveals its darker side as the VEGA CORPORATION, the alien enterprise led by the hideous DIRECTOR ZAROG, is imposing its predatory politics on the human kind. In the midst of this oppression, the rebel group Squadron 51 rises as a response against the violent acts spread by these inhuman beings. Will the brave pilots of Squadron 51 and their aircrafts stand a chance against the Zarog's diabolic fleet of flying saucers?<br/><br/>Join the rebel cause as LIEUTENANT KAYA, facing flying saucers, alien fighters and monsters in the skies of the 1950’s! Remember: the future of the Earth is in your hands!<h3>Features</h3><br/><br/><br/><strong>Classic gameplay</strong><br/>Squad 51 vs. the Flying Saucers is a SHOOT 'EM UP! game with four different aircrafts to play and set up with special weapons.<br/><br/><br/><br/><strong>Cinematic experience</strong><br/>Glorious black-and-white aesthetics, live-action FMV sequences and dubbed voices will tell the story of the battle between the Squadron 51 and Director Zarog’s alien supremacy.<br/><br/><br/><br/><strong>11 levels</strong><br/>Fight against enemy ships and bosses in many different environments - snowy mountains, forests, cityscapes and many others.<br/><br/><br/><br/><strong>Dynamic difficulty</strong><br/>No matter you are a rookie or a veteran shooting star, the game supports dynamic difficulty which allows every pilot to enjoy.<br/><br/><br/><br/><strong>Multiplayer</strong><br/>Feeling lonely against Aliens? Invite a friend! A second player can enter a level any time. Earn points with your friend and unlock together new special weapons and upgrades.<br/><br/>", "metacritic": null, "released": "2022-09-21", "tba": false, "updated": "2023-05-14T13:26:21", "background_image": "https://media.rawg.io/media/screenshots/28a/28aa3878010d18e76f6a844e7b2590de.jpg", "website": "https://www.squadron51.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 16, "beaten": 1, "toplay": 2}, "playtime": 2, "achievements_count": 14, "ratings_count": 2, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Loomiarts", "Fehorama Filmes"], "genres": ["Action", "Adventure", "Racing", "Indie"], "publishers": ["Assemble Entertainment", "WhisperGames"], "esrb_rating": null}