{"id": 854489, "slug": "requisition-vr", "name": "REQUISITION VR", "name_original": "REQUISITION VR", "description": "Welcome to Nevermont, a small state on the East coast surrounded by mountains and the coastal strip. And there’s Autumn, the capital of the state, the town with a rich history. A great place to spend your vacation! Oh, wait… Forget about it and prepare yourself for the freaking end of the world! <br/><br/>When something terrible happens that causes the sky to turn yellow, when streets are covered in mystical fog and people suddenly turn into monsters, you have two choices: give up or fight for your life. <br/><br/>Now it’s your turn to show that creativity it’s not just something that is useful in an art class only. <br/><br/>Duct tape is your new friend. Books are no longer a source of education and flour isn’t something to cook with. Search various locations for items and craft unique weapons, traps, and bombs to stop hordes of mutants or your teammates. <br/><br/>What happened to Autumn? You are the first one to learn the truth.<h3>Key Features:</h3> <br/><strong>Crafting system</strong><br/><br/>Over 300 different items are scattered around the location and waiting for being crafted into the weapons, bombs, and traps <br/><br/><strong>Melee combat</strong><br/><br/>Now it’s time to forget about stealth and smash enemies’ heads using any object you can find<br/><br/><strong>Locations</strong><br/><br/>Get ready to visit different locations from the trailer park to the farm. <br/>Remember there are no more safe places! <br/><br/><strong>EA Game modes</strong><br/>Sandbox - get used to environment, know your weapon and spawn zombies whenever you want!  <br/>Story Mode - find out what happened to Autumn! <br/>PVP - fight your teammates cause they are no longer your friends! <br/><br/><strong>The various playable characters</strong><br/>Choose and customize your best fighter", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-09-23T06:34:37", "background_image": "https://media.rawg.io/media/screenshots/35c/35cce3877d008cd2dc937f0f9ac9945a.jpg", "website": "https://arcadia-vr.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 12}, "playtime": 4, "achievements_count": 7, "ratings_count": 0, "suggestions_count": 534, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arcadia"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["Spheroom"], "esrb_rating": null}