{"id": 854487, "slug": "smooth-operators-2-2", "name": "Smooth Operators 2", "name_original": "Smooth Operators 2", "description": "<strong><h3>Welcome back to Smooth Operators 2!</h3><br/>Smooth Operators is a classic Tycoon/Simulator where you build your own customer service company and lead it to financial success!<br/>Be the architect of your building, hire employees to fulfill your contracts, develop your business, and keep your employees happy! <br/>Watch your company come alive and grow while your building reach the sky.</strong><br/><br/><br/><br/><strong>Smooth Operators 2 offers a deeper simulation</strong>, where focus is put not only on balancing operational workloads, but all aspects of running a functional outsourced Customer Experience operation. The building mechanic is reimagined to allow the player to create a very dynamic, organic and unique office building. All characters classes - not only Agents - have a clear objective in the game, and the player needs to balance and satisfy more workloads each day, as well as developing the business in a controlled fashion. The game also includes a new Research system that the player can prioritize how the player sees fit.<br/><br/><br/><br/><strong>But managing your Customer Experience company won’t be an easy task!</strong><br/>Employees will get upset if you don’t consider their well-being. You need to balance your staffing to handle all types of workloads that comes with building a company.<br/><br/>Smooth Operators 2 also offers a unique interface - an intelligent NLP/AI driven chat functionality with Jill the receptionist, who serves as your guide through the game.<br/><br/><br/><br/><strong>What type of CEO will you be?</strong>", "metacritic": null, "released": "2022-09-22", "tba": false, "updated": "2022-09-23T06:31:05", "background_image": "https://media.rawg.io/media/screenshots/ef5/ef5336500e1df66ed211928e9a61e9fe.jpg", "website": "https://www.heydeck.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 61, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Heydeck Games"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Heydeck Games"], "esrb_rating": null}