{"id": 854516, "slug": "merge-family-house-design", "name": "Merge Family – House Design", "name_original": "Merge Family – House Design", "description": "The story of Katy from Merge Family is a mysterious one. Katy, her husband Oscar, and their 6-months old son Oliver were enjoying family life, until something weird happened. The couple received a letter with no return address, which was followed by Oscar’s disappearance.<br/><br/>Now, Katy and her son are all alone in her villa. To find clues about her husband’s disappearance, she has to carry out home restoration and fix everything that’s broken. They just moved in recently, so there is a lot to repair! <br/><br/>In an effort to help Katy find her husband, you have to clean up the building, reorganize it, and fix broken things, from faucets and electricity to furniture. Throughout the game, you will meet Katy’s parents, bankers, and detectives. New evidence regarding Oscar’s disappearance will unravel as the game progresses. Restore the house and find new evidence to help Katy reconnect with her husband.<br/><br/>Merge Family is a great new addition to merge games! Explore Katy’s property while finding her husband and playing home design games.<br/><br/>Features:<br/><br/>UNCOVER – Find shocking revelations about Oscar’s disappearance and mysterious objects in the house. There is always new evidence to discover and more rooms to organize. Use magic of merge and participate in games to help Katy flip her frown upside down!<br/><br/>DRAG &amp; MERGE – Objects that seem useless now may come in handy later. Collect objects and turn them into useful tools by merging them. Use these objects to repair the house.<br/><br/>MANSION AND GARDEN REDECOR – Oscar and Katy just bought their dream home in their town. It’s a perfect match for them! Well, almost. With Oscar gone, the cleaning and decorating falls on Katy. Show off your exquisite taste and help the heroine decorate her new house. Make sure the furniture is matching, or go crazy and combine different styles. Give the mansion a complete makeover in our home renovation game and discover Katy’s sweet garden!<br/><br/>KICK BACK AND PLAY – Enjoy the game and all the entertainment it comes with, but prepare for some twists and turns ahead in Merge Family!<br/><br/>LEARN HOW TO PLAY IN MINUTES – You don’t need a manual; just download the app and get to playing! The gameplay is straight-forward and self-explanatory, you have our word.<br/><br/>PLAY FOR AS LONG AS YOU WANT – Take a break from school or work and to relax and play Merge Family for 5 minutes. If you have a free afternoon, enjoy hours of gameplay with no breaks! It is up to you how much time you can dedicate.<br/><br/>Katy is just embarking on her journey of home renovation when tragedy strikes and she has to find her missing husband. Help Katy on her quest and enjoy hours of decorating games in the redecor game Merge Family. It will never cease to surprise you!<br/><br/>Renovate Katy's mansion so that one day she could say \"My home is amazing!\"<br/><br/>Make all your interior design dreams come true with Merge Family’ renovation games. Decorate Katy’s home, give it a makeover, help her fix broken objects with the magic of merge and find Oscar!", "metacritic": null, "released": "2022-09-01", "tba": false, "updated": "2022-09-23T07:06:16", "background_image": "https://media.rawg.io/media/screenshots/eb3/eb371acb6d680ba2c05a7e417d97a5e5_cPfZahB.jpg", "website": "https://pixel.green", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["greenpixel"], "genres": ["Casual", "Puzzle"], "publishers": ["GreenPixel"], "esrb_rating": "Everyone 10+"}