{"id": 854526, "slug": "couple-up-love-show-story", "name": "Couple Up! Love Show Story", "name_original": "Couple Up! Love Show Story", "description": "Go through a breathtaking adventure and find your perfect partner!<br/><br/>Couple Up! The Love Show - is an interactive story game that will make you a contestant on a fictional love &amp; dating reality show \"Couple Up!\" <br/><br/>You, together with 9 other Love Seekers, are going to the Mansion of Love, where you will live for 14 days! Your goal is to couple up with a partner who is perfect for you, and make your dreams come true! Will you be able to find that person? Will you do what it takes, so that they love you back? Will you develop a strong and trusting relationship? Play the game and find out!<br/><br/>Choose wisely!<br/>‘Couple Up! A Love Show’ is a game of choices. We’ve made sure that every decision you take has a powerful impact on this interactive story. One choice can change everything! Throughout 42 episodes of the first season, there will be hundreds of choices for you to make. Make your decisions, write your own romance!<br/><br/>Create your style!<br/>Name and customize your character, choose from dozens of lovely outfits! Will you play the game as a humble girl? Or will you show up in a new gorgeous dress every day? Start with your unique style!<br/><br/><br/><br/><br/><br/>Make friends and enemies!<br/>There is always a lot of drama at the Mansion! Help other Love Seekers or make their life unbearable. Choose your story! Play as a femme fatale, or a sassy girl, or a desperate romantic. Build a strategy for every episode or just follow your heart. In this immersive game everything is up to you!<br/><br/>Take part in amusing games and challenges!<br/>Life is never boring in the Mansion of Love! Play games, such as \"Truth or Dare\" or \"Trust Cars\", take part in dirty dances, go on steamy dates, find out that the Floor is Lava and even have an unforgettable Jungle Trip! Every chapter of this interactive story is full of juicy adventures!<br/><br/>Have deep and entertaining conversations!<br/>Each and every Love Seeker has much interesting stuff to tell you! One boy won't shut up about the scheme of the Universe, while the other is a chronic joker. And, of course, in each episode you will have conversations about feelings, and love, and relationship! What about your opinion on each topic? You get to choose it!<br/><br/>Meet characters that you will really care about!<br/>Every character on the love show has their needs and wants. Depending on your choices and decisions, some Love Seekers will end up being happy and some will be left with a broken heart. Help your fellow contestants to build their relationship and form couples. Shape their love stories, as well as you shape yours!<br/><br/>Take sides in conflicts!<br/>Will you help your girl-friend get the boy she desires, or will you compete with her over him? Intrigues or loyalty? Deceit or honesty? What path will you choose? Remember, every day a new drama emerges on the show! <br/><br/>Find your perfect match!<br/>What is your perfect romance? Who is the partner of your dreams? Will it be a confident businessman? Or a cheerful musician? Or a sportsman with a good body? Or maybe you would like to try it with a girl? Discover what you truly desire and go for it! Couple up and win the game!<br/><br/>The episodes of \"Couple Up!\" are full of drama and romance, tragedy and comedy, hate and love! This is an adventure you are going to remember!", "metacritic": null, "released": "2021-05-27", "tba": false, "updated": "2022-09-23T07:18:13", "background_image": "https://media.rawg.io/media/screenshots/57e/57edc9817a0742f18fe39e4a15e0364a.jpg", "website": "https://nativegames.me/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Native Games Studio"], "genres": ["RPG", "Simulation"], "publishers": ["Oleksandr Chezghanov"], "esrb_rating": "Teen"}