{"id": 854533, "slug": "designcar", "name": "DesignCar", "name_original": "DesignCar", "description": "Design and collect virtual dream cars by entering daily Design Challenges that stretch your creativity with each vehicle. Improve your design score by getting the most votes on your submissions across challenges. Earn tickets to enter more challenges by voting on others’ submissions from the community.<br/><br/>Enter Design Challenges <br/>Complete design challenges by configuring photo-realistic 3D vehicles and accessories to showcase your unique design. Fulfill challenge requirements to earn in-game currency to have the freedom to design on your own terms. <br/><br/>Vote with the Community <br/>Vote on your favorite vehicles from the community and have a say in the outcomes of their submissions. See how others have ranked immediately after voting on a submission. Earn extra tickets through voting to enter more challenges and improve your overall design score. Showcase your design by becoming a featured designer and have the opportunity to have it seen by millions of players. <br/><br/>DesignCar may retire online features after 30 days’ notice posted on https://designcar.io/<br/><br/>Important Consumer Information. This app:<br/>- Requires a network connection to play. (network fees may apply).<br/>- Requires acceptance of DesignCar’s Privacy Policy and Terms &amp; Conditions.<br/>- Contains direct links to the Internet and social networking sites intended for an audience over 13<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings. This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game. This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- For information about how Porsche Digital collects and uses your data, please read our privacy policy at: https://designcar.io/privacy<br/><br/>IMPORTANT DISCLOSURES AND CONSENT<br/>By selecting install, you consent to the installation of any updates or upgrades that are released through the platform.<br/>Apple is not involved in any way with any contests or sweepstakes within the app. <br/>Please note, some of these updates and upgrades may (i) change the way we record usage data and metrics (but always as set out in DesignCar’s Privacy Policy), and (ii) affect app-related preferences or data stored on your device. You can withdraw your consent at any time by removing or disabling this app, or by contacting us at https://designcar.io/ via Contact. <br/><br/>Terms &amp; Conditions: https://designcar.io/tos<br/>Privacy Policy: https://designcar.io/privacy<br/>Do Not Sell My Personal Information: https://www.porsche.com/usa/privacy-policy/contact/", "metacritic": null, "released": "2021-04-20", "tba": false, "updated": "2022-09-23T07:24:26", "background_image": "https://media.rawg.io/media/screenshots/1cb/1cb2a5f235c23ca31855b968902a1d1b.jpg", "website": "https://designcar.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Porsche Digital"], "genres": ["Simulation", "Casual"], "publishers": ["Porsche Digital"], "esrb_rating": "Everyone 10+"}