{"id": 854515, "slug": "la-guatoca", "name": "La Guatoca", "name_original": "La Guatoca", "description": "La Guatoca es la versión épica que necesitas de la clásica Oca. Disfrútala GRATIS y SIN PUBLICIDAD.<br/><br/>¿Tú también quieres tu propio tablero para jugar con amigos? Nosotros te ahorramos la faena. La Guatoca llega a tus dispositivos para pasarlo bien en grupo en todas partes sin tener que preocuparte de que se te moje o se rompa el tablero. ¡No hay límite de jugadores!<br/><br/>No solo te proporcionamos un juego de mesa único. La Guatoca trae varios tableros para adaptarse a todo tipo de grupos. Incluso un tablero HOT con frases picantes y extremas para que calientes el ambiente con tu pareja o amigos.<br/><br/>Cada tablero tiene diferentes tipos de casillas (Castigo, ¿Quién?, Verdad, Reto, Evento y Hot) en distintas proporciones y niveles. Pero no es solo eso. Los demás juegos de mesa de este estilo traen siempre la misma frase en cada casilla. ¡La Guatoca hace que cada partida sea única proporcionando una pregunta distinta cada vez que caes en una casilla! Juega tantas veces como quieras y no te canses nunca.<br/><br/>Gran variedad de preguntas de cada tipo elaboradas con muchos años de formación en la materia. De jóvenes para jóvenes.<br/><br/>Disfruta del bonito arte que te ofrece la Guatoca y no te dejes los ojos jugando a otros juegos. Velamos por tu salud ocular.<br/><br/>¿A qué esperas? Descarga ya La Guatoca y prepárate para un rato único e inolvidable. ¿Conseguirás llegar a la meta?<br/><br/><br/>Para más información sobre cómo se juega encuéntranos en @guatoca_game. Si tienes problemas o sugerencias, contáctanos a través de icagamesv@gmail.com<br/><br/>No estás obligado a hacer ningún tipo de reto ni responder a ninguna pregunta de las que te propone el juego. Ica Games no se hace responsable del uso que se le pueda dar a esta aplicación.<br/><br/>Ica Games", "metacritic": null, "released": "2021-10-07", "tba": false, "updated": "2022-09-23T07:05:14", "background_image": "https://media.rawg.io/media/screenshots/32f/32f7aa8a9f9a76b0e0da9bb10c043344.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yaiza Castillo Aguilar"], "genres": ["Board Games"], "publishers": ["Yaiza Castillo Aguilar"], "esrb_rating": "Teen"}