{"id": 854565, "slug": "the-quest-curse-of-linmore", "name": "The Quest - Curse of Linmore", "name_original": "The Quest - Curse of Linmore", "description": "An expansion by Zarista Games.<br/><br/>The Quest - Curse of Linmore is an expansion to The Quest, a beautifully hand-drawn open world role playing game with old school grid-based movement and turn based combat.<br/><br/>After enabling the expansion, you can explore new areas and adventures. However, if you don't have The Quest, you can also play the expansion as a standalone game.<br/><br/>You are summoned by the Tiarnaigh of Linmore to lift the curse that ravages their land. Many suffer from the Failing Sickness, brought on by an unusually wet and cold summer. Loch Linmore is swollen to twice its size. Some monks at Bidewell Abbey in the north suffer collective possession and are confined, raving, to their cells. The path to Bidewell is filled with mist. Village children have disappeared. Some, like his Court Astrologer, blame the Abbess of Bidewell Abbey. They claim she is a witch. Some say it's the devilish Olc Mhor's work. You have come with great recommendations and are tasked to remove the curse so his people can be free.<br/><br/>To access the new areas (not applicable if you are playing the expansion standalone), go to Mithria harbor and talk to captain Hanty, then select \"Curse of Linmore\" as your travel destination. It's recommended you reach at least level 80 before taking on the challenges posed by this expansion.", "metacritic": null, "released": "2022-03-10", "tba": false, "updated": "2022-09-23T07:55:31", "background_image": "https://media.rawg.io/media/screenshots/c93/c93715485f4405591f72c43cc40f19ca_ysxZwVI.jpg", "website": "http://www.redshift.hu", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Redshift"], "genres": ["Adventure", "RPG"], "publishers": ["Vilya, BT."], "esrb_rating": "Teen"}