{"id": 854547, "slug": "turboprop-flight-simulator", "name": "Turboprop Flight Simulator", "name_original": "Turboprop Flight Simulator", "description": "FLY MILITARY AIRCRAFT AND PASSENGER AIRLINERS:<br/><br/>\"Turboprop Flight Simulator\" is a brand new 3D airplane simulator game, which puts you in the pilot seats of planes derived from the Airbus A400M Atlas tactical air-lifter, the ATR 42 / ATR 72 regional airliners, and concept VTOL aircraft XV-40 and PV-40.<br/><br/><br/>HAVE FUN:<br/><br/>* Pilot three versions of the military aircraft: tactical cargo, coastguard, and special operations.<br/>* Pilot the two regional airliners, plus an airborne early warning military variant.<br/>* Pilot the Tilt-Wing VTOL aircraft (both in plane mode and in vertical, helicopter-like mode).<br/>* Learn to fly with training missions (teaching the basics of flying, taxiing, takeoff and landing).<br/>* Complete various missions.<br/>* Explore the plane's interior in first-person (in most levels, and free-flight).<br/>* Interact with various items (doors, cargo ramp, strobes, main lights).<br/>* Drive ground vehicles.<br/>* Load, unload, and airdrop supplies and vehicles with the cargo planes.<br/>* Takeoff and land on improvised runways (and airports, for sure).<br/>* Fly without restrictions in free-flight mode, or create flight routes on the map.<br/>* Perform refueling on ground and mid-air refueling.<br/>* Fly in varied time-of-day, fog and wind conditions.<br/><br/><br/>OTHER FEATURES:<br/><br/>* NEW &amp; FREE airplane simulator game updated in 2022!<br/>* NO MANDATORY ADS! Only optional, rewarded ones in-between flights.<br/>* Great 3D graphics (with detailed cockpits for all the airplanes).<br/>* Realistic physics for flight simulation.<br/>* Complete pilot controls (including rudder, flaps, spoilers, thrust reversers, auto-brakes, and landing gear).<br/>* Multiple control options (including mixed tilt sensor &amp; stick / yoke).<br/>* Multiple cameras (including cockpit cameras with captain and copilot positions).<br/>* Close to realistic engines' sounds (turbines and propellers noises recorded from real airplanes).<br/>* Partial and total aircraft destruction (clipping wing tips, full wings separation, tail separation, and main fuselage breakage).<br/>* Several islands with many airports.<br/>* Selection of measurement units for air speed, flying altitude, and distance (metric, aviation standard, and imperial).", "metacritic": null, "released": "2018-03-14", "tba": false, "updated": "2022-09-23T07:38:19", "background_image": "https://media.rawg.io/media/screenshots/525/525eec57f6d34172d4fce443061738e9_ITEByUV.jpg", "website": "http://www.facebook.com/TurbopropFS", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alexandru Petre"], "genres": ["Action", "Simulation"], "publishers": ["Alexandru Petre"], "esrb_rating": "Everyone 10+"}