{"id": 854508, "slug": "l8pw-loaded8s-poker-wars", "name": "L8PW - Loaded8s Poker Wars", "name_original": "L8PW - Loaded8s Poker Wars", "description": "Join the best free poker game with 5 X faster poker action, high stakes tables, challenges, exciting tournaments, and a range of players to compete against from all over the globe! <br/><br/>L8PW POKER FEATURES<br/><br/>Fast 5 hand poker action, high stakes tables, NLA poker league, tournaments, free chips, hand advisor, special chip packages and more! <br/><br/>The stakes are higher, bigger payouts – Higher stakes mean you can win even more virtual chips every time you play.<br/><br/>Play seamless poker against players from around the world.  Wipe out your opponent and win BIG!<br/><br/>Play the high stakes tables and win even more!<br/><br/>Join the NLA poker league and battle for the L8PW title<br/><br/>Live tournaments with huge gifts and prizes!<br/><br/>Download for free today and get your welcome bonus so you can hit the tables and test your poker skills<br/><br/>Invite your friends to play, practice your poker skills, meet new friends online and become an L8PW legend!<br/><br/>You love poker so don't miss out on the Poker Revolution,  Play Loaded8s Poker Wars<br/><br/>We appreciate our players' input.   Follow us on Social Media. Live chat and up to date info is available at:<br/><br/>Instagram: https://www.instagram.com/loaded8spokerwar/<br/><br/>Facebook: https://www.facebook.com/profile.php?id=100083650115905<br/><br/>Telegram: https://t.me/loaded_8s_poker_wars<br/><br/>Twitter: https://twitter.com/loaded8spoker<br/><br/>TikTok: https://www.tiktok.com/@loaded8s_poker_wa<br/><br/><br/>Additional Information:<br/><br/>L8PW is intended for an adult audience and does not offer real money gambling or an opportunity to win real money or prizes. Practice or success at social gaming does not imply future success at real money gambling.<br/>L8PW is free to play; however, in-app purchases are available for additional content and in-game currency.<br/>Use of this application is governed by L8PW's Terms of Service, found at www.loaded8s.com<br/>For information about how L8PW uses personal data, please read our privacy policy at www.loaded8s.com", "metacritic": null, "released": "2020-01-07", "tba": false, "updated": "2022-09-23T06:58:30", "background_image": "https://media.rawg.io/media/screenshots/34c/34cf8f0da249ed03b63afa58491512d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yakim Interactive"], "genres": ["Card"], "publishers": ["Yakim Interactive"], "esrb_rating": "Mature"}