{"id": 854616, "slug": "mayor-garlics-autumn-festival", "name": "Mayor Garlic's Autumn Festival", "name_original": "Mayor Garlic's Autumn Festival", "description": "<p><strong>Controls:</strong></p>\n<p>Point &amp; Click Mouse for most buttons and movement</p>\n<p>Press \"I\" for Inventory</p>\n<p>----------</p>\n<p>Mayor Garlic has requested that all the local farms deliver their finest produce for the Autumn Festival this year! Unfortunately, you've been slacking off all summer, and all you've got in your pockets this year is a handful of seeds! Do your part by collecting, planting, growing, and harvesting all 12 types of produce and delivering them on time!</p>\n<p>Till the land, plant your seeds, then water them on the daily so that they grow properly. You'll need to remove any weeds that spawn on tiles so that the plants can grow properly.</p>\n<p>During the day, you can spend your activity points to travel to the Shop or the Festival, or play slider puzzles! Completing slider puzzles awards you gold to spend on new items, and completing new difficulties of slider puzzles unlocks more items in the shop, including those seeds you'll need to complete your collection!</p>\n<p>Once you've got produce to turn in, stop on by the Festival and hand off a piece of each produce to Mayor Garlic so she can put it in the show.</p>\n<p>Good luck, and have a wonderful time at the festival!</p>\n<p>-------------</p>\n<p><strong>Farm </strong>- Use the hoe to til the garden plot, then select the seed you'd like to plant and click the tilled soil. Use the watering can to water the plant each day. Weeds might appear overnight, so use the gloves to pull them out. You can also use the gloves to harvest a plant once it is full grown.</p>\n<p><strong>Shop </strong>- You can sell extra items at the shop for money. You can also buy new items at the shop, or replenish your supply. The shop has multiple tiers of items to be unlocked, all depending on how difficult of a slider puzzle you've managed to complete.</p>\n<p><strong>Festival </strong>- The mayor will accept 1 of each produce for your festival collection. There are 12 produce types you'll need to grow.<br/></p>\n<p><strong>Day Cycle</strong>- Saves occur periodically throughout the day. The farm garden plots grown every morning and every night. You get 2 activity points per day to spend travelling or puzzling.</p>\n\n<p>-----</p>\n<p>Credit to xPoltergeistCatx for the shelf asset used at the festival</p>", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2022-09-23T08:19:23", "background_image": "https://media.rawg.io/media/screenshots/e69/e69094cedaa0ed9869820cbe85c36782.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Lightmoon", "brahmsongs"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}