{"id": 85480, "slug": "gc-wasteland", "name": "GC Wasteland", "name_original": "GC Wasteland", "description": "After the Great Ecological catastrophe the ultra rich move to Tesla City on Mars. The rest of us died. Now, citizens of Mars take flights to Earth and play golf in the ruins of civilization. However, one of the Mars mission pilots cannot fit in the new Martian society. The homesick pilot uses his connections at Golf Club: Wasteland for one last solo trip to Earth.<br/><br/>ORIGINAL SOUNDTRACK: Radio Nostalgia from Mars. Citizens of Mars, now nostalgic for Earth, listen to music from the 2020s and share memories from their past life on Earth. 7 original songs and 5 personal stories from citizens of Mars. Now available on Apple Music!<br/><br/>Kick back, relax and reminisce with Golf Club: Wasteland. This award-winning game is a slow-paced atmospheric visual narrative with walking, jet-pack flying, and golfing in post-apocalyptic landscapes.<br/><br/>————<br/><br/>“Mixed with an eerie atmosphere and some of the best tunes we’ve heard in iOS gaming, this makes for a beautiful experience of loneliness.” - Apple<br/><br/>“Beautiful and elegiac are not normally adjectives you’d use to describe a golf simulation, but that’s what this is, and a highly unusual and peaceful experience.” 8/10 - Metro<br/><br/>“Rare is the game that gets you thinking about modern society, while being angry that you missed the shot to get past a giant, irradiated giraffe.” 9/10 - Touch Arcade<br/><br/>“Can this be the start of a new genre, please?” - Yahoo Finance<br/><br/>————<br/><br/>BEAUTIFUL<br/>A visually and sonically rich, calm and funny experience. Each level contains post-apocalyptic environments with destroyed brutalist monuments, neons referring to current social events and Silicon Valley, graffiti, alternative pathways, and one unexpected character.<br/><br/>MUSIC<br/>While revisiting Earth, the Pilot listens to Radio Nostalgia from Mars, a unique concept album.<br/><br/>STORY<br/>Three storytelling perspectives: text between levels, the Pilot’s diary that you can unlock, and personal stories in the radio program.<br/><br/>SATIRE<br/>References are planted throughout the game world. If you’re passionate about current affairs, appreciate great design and have a healthy skepticism toward our collective future - this game is made for you.", "metacritic": null, "released": "2018-06-26", "tba": false, "updated": "2020-09-14T01:58:56", "background_image": "https://media.rawg.io/media/screenshots/570/5707d140ac0137bf14be49edd3b53450.jpg", "website": "http://golfclubwasteland.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Demagog Studio"], "genres": ["Adventure"], "publishers": ["Demagog Studio doo"], "esrb_rating": null}