{"id": 85486, "slug": "minesweeper-x-lite", "name": "Minesweeper X Lite", "name_original": "Minesweeper X Lite", "description": "*******************************************************************<br/>Now play the classic Minesweeper game like you have never played it before. The best Minesweeper classic game to hit the App Store. <br/>*******************************************************************<br/><br/>Minesweeper X brings the classic and popular game Minesweeper to the App Store with a new and fun twist. It brings the same fun and addictive game play as the original plus more. Unlike other Minesweeper games you have played in the App store, Minesweeper X gives you different difficulty levels of game play without increasing the size of the board size. It gives the user 3 difficulty levels in the same 9 x 9 board with more intelligent game design. No more over sized and difficult to navigate zooming game boards. No more old windows styled minesweeper graphics, Minesweeper comes with more polished and professional graphics and smooth and accurate game play.  <br/><br/>It also gives the player the option to replay the same game if they didn’t win it. You can use this feature improve you game play and Minesweeper skills. <br/><br/>Minesweeper X brings you different game themes and game colors. You have the option to change the theme of the game into for example the flower garden theme. If pink is your color, you can always switch to pink theme from the default blue theme. And there are more colors to choose to match your taste and mood. We will also be introducing more themes in the future versions based on the user feedback. <br/><br/>Full Version Features: <br/><br/>- Different difficulty levels (Easy, Medium, Hard) <br/>- Multiple game themes (Nuclear, Land Mines, Flower Garden) <br/>- Multiple color themes <br/>- Support OpenFeint 2.4 (Leaderboards, Achievements, Chat and more)<br/>- Ability to replay the same game if the player didn’t win the game <br/>- Ability to finish the game without flagging the cells <br/>- Flag and question marks (?)<br/>- Listen to the game soundtrack or disable it and use your own iPod music", "metacritic": null, "released": "2010-06-03", "tba": false, "updated": "2019-10-22T14:21:24", "background_image": "https://media.rawg.io/media/screenshots/7b5/7b5d2d33182755f12326692fa9adfe98.jpg", "website": "http://www.ikreeda.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iKreeda Games"], "genres": ["Strategy", "Board Games"], "publishers": ["NGS Technologies"], "esrb_rating": "Everyone 10+"}