{"id": 854961, "slug": "meet-me-at-noon-free-web-demo", "name": "Meet me at NooN - free Web Demo", "name_original": "Meet me at NooN - free Web Demo", "description": "/!\\ This is a free demo /!\\<br/>Full game is available on Itch.io or Steam\r\n\r\n\n\r\nWhat if you could go backwards in time? \r\n\n<p><strong>Meet me at NooN</strong> is a time manipulation turn-based puzzle-platformer with Tenet inspired mechanics. </p>\n<p>Control two characters, create perfect time loops and solve brain melting time puzzles.</p>\n\n<em>\"The starting idea was: what would be the movie Tenet if it was a puzzle game\"<br/>\n</em>- Alex from Pandaroo Interactive\r\n\r\n<br/><br/><br/>\n\n\r\nTurn &amp; Grid based platformer \r\n\n<p>A timeline is showing how much turns you have to solve a level. <br/>You can do one action by turn.</p>\n<p>You have four actions:   You can move horizontally with left or right input, jump with up and wait a turn with down. </p>\n\n\r\nObjective\r\n\n<p>There are two symbols disposed in the level: a sun and a moon. </p>\n<p>To solve the levels you simply need to have the two characters on their corresponding symbol at the same time.</p>\n\n\n\r\nDay &amp; Night, the twins spirits \n<p>\n</p>\n\n<p><em>You control two characters: one during the day, one during the night. <br/></em></p>\n<p><em>They sure look like twins but they have unique behaviors. It's up to you to discover how to use their distinctiveness at your advantage.</em></p>\n\n\n<em><em><em>Time loop and playback</em></em></em>\n<p><em><em>Each move you do with a character are recorded and will be played back while you're controlling the other character. It's like creating small time loops for each character.</em></em><br/></p>\n\n<p><em><em><em>Beware, the playback is not the same for our two spirits: The day-one will rewind its actions and the night-one will replay its own actions.</em></em></em></p>\n\n\n<em><em><em>No pressure</em></em></em>\n\n<p><em><em><em>You can't lose and there is no time constraint in the game. If you make a mistake, navigate the timeline and go back in time !<br/></em></em></em></p>\n\n\n<em><em><em>Complex interactions</em></em></em>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<em><em><em>\n<p>The characters can interact with each other and these interactions will be recorded too creating complex playback pattern.</p>\n<p>Intertwine their timelines to solve brain-melting puzzles.</p>\n</em>\n<p>---</p>\n</em>\n</em>", "metacritic": null, "released": "2022-09-22", "tba": false, "updated": "2022-09-23T10:43:49", "background_image": "https://media.rawg.io/media/screenshots/5d2/5d2d81ff6a30c10f2a12fdcc9ba1759a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Pandaroo"], "genres": ["Strategy", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}