{"id": 855064, "slug": "svens-quest", "name": "Sven's Quest", "name_original": "Sven's Quest", "description": "<p>This game is made for The OFFICIAL Smile Game Builder Summer 2022 Game Jam.</p>\n<p><em>Your little brother, Mats, has gone missing. Could it be that he's a victim of the witch living in the woods outside town? Solve the mystery by talking to the locals and exploring the area.</em><br/></p>\n<p>You should be able to beat this game in 20 minutes. </p>\n<p><strong>Behind the scenes<br/></strong></p>\n<p>This is my first attempt at making a 3D adventure game set in a fantasy world as opposed to the adventure game/visual novels with a more cartoony look and feel I've made for previous jams (although I will make more of them in the future). The action mechanics could use some tweaking, but other than that you should be able to finish the game without too many hiccups. </p>\n<p>My main goals this time around was to give the player more freedom to walk around the environments. I hope you enjoy playing this game as much as I enjoyed making it. :D</p>\n<p>Thanks to this game jam I’ve learned how to make seamless textures and the basics of using Blender.</p>\n<p><strong>Credits</strong>\n</p>\n<ul><li>Astrud font (used for the logo) by Peter Wiegel</li><li>Illustrations,  story, \"music\", additional 3D models and textures by me. </li><li>Special thanks to AmalgamAsh for hosting this jam and to the symmetry tool in Procreate for helping me make symmetrical character portraits. </li></ul>\n<p><strong>Disclaimer</strong> <br/></p>\n<p><em>Any resemblance to real persons or other real-life entities is purely coincidental. All characters and other entities appearing in this work are fictitious. Any resemblance to real persons, dead or alive, or other real-life entities, past or present, is purely coincidental.</em></p>\n<p><strong>Tips</strong></p>\n<ul><li>Explore the room on your left when you're down the well. If you don't, talk to Kjeld later for a way to defend yourself from the trolls.</li><li>You can't heal in the Sleeping Forest, but you don't have to fight the trolls so play it safe.</li></ul>\n<p><strong>Walkthrough</strong><br/></p>\n<p>Talk to Knud and Kobbi a couple of times, then head over to Kjeld. Now, go down the well. Head over to the Sleeping Forest on the outer left side of town. Take the lower right exit four times.</p>", "metacritic": null, "released": "2022-09-22", "tba": false, "updated": "2022-09-23T11:25:13", "background_image": "https://media.rawg.io/media/screenshots/f35/f35262c0394a664d788cc1e2bab5d94d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tymmo"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}