{"id": 855081, "slug": "michaels-first-blood-a-top-down-shooter", "name": "Michael's First Blood: a Top-Down Shooter", "name_original": "Michael's First Blood: a Top-Down Shooter", "description": "<p><strong>Michael's First Blood</strong> is a top-down shooter made in Gamemaker 8.1. You blow things up, and talk to people sometimes.<br/></p>\n\n<p><em><strong>\"The story follows a young Swedish man named Michael as he joins the army and embarks on a mission to end the made-up conflict between Sweden and Russia. He's part of a top-secret special operations force which consists of him and his general. The general isn't good for much other than talking, so all the action is up to you.</strong></em><br/></p>\n<p><em><strong>Your only weapon is a grenade-launcher. True to it's name it fires grenades that bounce off walls and explode on impact with enemies, or when detonated manually. With it's capability of destroying walls you can pretty much forge your own path through the levels. You'll encounter Russian soldiers with automatic rifles, and two different bosses. \"<br/></strong></em></p>\n\n\n<p>I originally made this in 2016 for a school-contest. It took around 3 months to complete and was initially in Swedish only, but I've now translated it and polished it somewhat. I also added some much needed features such as 1080p support and volume control as to not blow your eardrums out when you play it. <br/></p>\n<p>The game borrows some sound files from Stalker: Shadow of Chernobyl, and music from Duke Nukem 3D + Rise of the Triad. I also used a car sprite from opengameart.org in 2016, but the owner of the sprite has since deleted it from the site so I can't give them the credit they deserve. If you're the creator of said sprite then please e-mail me so I can credit you (or replace it if you so wish).</p>\n\n\n\n<p>If you do download this, I hope you'll have fun playing it! If you run into any issues, please comment below or e-mail me and I'll try to fix it.<br/></p>", "metacritic": null, "released": "2022-09-21", "tba": false, "updated": "2022-09-23T11:31:58", "background_image": "https://media.rawg.io/media/screenshots/67f/67fbd81686bea0731e3eebe8f7ab7af5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Lord Cabal"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}