{"id": 85510, "slug": "halos-react-and-match-arcade-game", "name": "HALOS: React and Match Arcade Game", "name_original": "HALOS: React and Match Arcade Game", "description": "HALOS: React and Match Game<br/><br/>The mesmerizing react-and-match game that lets you jump in &amp; zone out.<br/> <br/>What’s all the fuss about?<br/> <br/>Halos is an addictively simple and fast-paced matching game. If you love Match-3 games but are looking for something a little more zen, yet still challenging, this is the game for you.  <br/> <br/>Your challenge is to slide each falling Halo toward its matching ring before it shatters. Pay close attention to your Halos, as similar colors will fool you and the ever-changing speed will be tricky to master.<br/><br/>Highlights:<br/><br/>• FREE to play!<br/>\u2028• PLAY– Swipe to match colors and enter a perfect state of reaction ‘zen’.\u2028<br/>• FAST – Jump in and play INSTANTLY. A game with NO learning curve. <br/>• FUN – Earn points to score big and dominate the global leaderboard.\u2028<br/>• CHALLENGE – Enjoy a mesmerizing variety of levels with more challenges on their way.\u2028<br/>• FRIENDS – Show off your awesome skills and compete with friends.\u2028<br/>• SOCIAL– Share and compete with Facebook friends.<br/>• ZEN  - Enjoy energetic music with gorgeous + minimalistic visuals. <br/><br/>Join thousands of fellow gamers and get your ‘zen’ on – download for free now!<br/><br/>For truly dedicated players, this game also offers a fantastic array of levels with new and more difficult challenges! We have also implemented a new way to slow things down for 30 seconds of peaceful ‘slow n’ easy’ matching fun.  Available at the start of each round.<br/><br/><br/>Color blind? No problem. We have a solution that allows you to eliminate difficult color combinations for a wide variety of common color pairings.<br/><br/><br/><br/>We appreciate all of your incredible feedback and support – our team loves receiving your gameplay and feature suggestions so please keep them coming! <br/><br/>\u2028<br/>PLEASE NOTE: Halos is a completely free to play reaction matching game. Having technical questions or suggestions? Our game team would LOVE to hear from you! You can reach us at gamesupport@kizstudios.com.                     <br/><br/>\u2028\u2028Become a fan of Kiz Studios and follow us for all the latest news :\u2028\u2028<br/><br/>www.KizStudios.com<br/>\u2028\u2028Follow us on: twitter.com/KizStudios\u2028\u2028<br/>Like us on: facebook.com/KizStudios\u2028\u2028<br/>Watch us at: youtube.com/KizStudios\u2028\u2028<br/><br/>Important Message for Parents\u2028\u2028This game may include:\u2028\u2028<br/><br/>- Live links to social networking websites that are intended for an audience over the age of 13.\u2028\u2028<br/><br/>- Live links to the internet that can take players away from the game with the potential to browse any web page.\u2028\u2028<br/><br/>- Advertising of Kiz Studios products as well as products from select partners.", "metacritic": null, "released": "2015-08-13", "tba": false, "updated": "2019-07-30T10:26:37", "background_image": "https://media.rawg.io/media/screenshots/510/510a63f25bcfee2ac7416957f393a674.jpg", "website": "http://kizstudios.com/halos", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiz Studios", "Sunrise Games"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["Kiz Toys", "Sunrise Games"], "esrb_rating": null}