{"id": 855490, "slug": "toytles-leaf-raking", "name": "Toytles: Leaf Raking", "name_original": "Toytles: Leaf Raking", "description": "<p><strong>The leaf-raking business simulation game that teaches  responsibility and strategic thinking</strong><br/><br/>You want The Ultimate Item (tm), but it's expensive, and your parents won't buy it for you.    So, with a rake and some yard bags, you start your leaf-raking business in the hope of earning the money to buy The Ultimate Item (tm) yourself.     <br/><br/><strong>RUN YOUR OWN LEAF-RAKING BUSINESS</strong><br/><br/>    During the 90 days before winter, you'll:  </p>\n<ul><li>Seek out neighbors who need your services and turn them into paying clients.</li></ul>\n<ul><li>Make key purchasing decisions, such as which types of rakes to buy and how many yard bags to keep in your inventory.</li></ul>\n<ul><li>Balance your energy and your time as you seek to keep your clients happy without overextending yourself.</li></ul>\n<ul><li>Visit the kitchen to ask your parents for their advice and wisdom.</li></ul>\n<ul><li>Learn about personal responsibility and the importance of keeping your promises.</li></ul>\n<p><strong>MAKE PLANS AND USE STRATEGY TO EARN ENOUGH MONEY TO WIN </strong><br/><br/> You'll need to make sure you get enough sleep to recover your energy, but you'll also want to finish raking yards early and often to get the most income. </p>\n\n<p>Do you go to bed early so that you're ready to take on the next day, or stay up late to get those last few leaves knowing you'll be a little tired in the morning? You decide. <br/></p>\n<p>If you neglect your responsibilities, you'll find your clients will leave you when their yards overfill with leaves, so keep an eye on the weather forecast! <br/></p>\n<p>Fair days give you a nice break to catch up on your chores, but if too many leaves fall, you'll have a difficult time taking care of your clients. <br/></p>\n<p>Also, you can't rake leaves when it is raining, so either wait it out or spend your time visiting the store to stock up on supplies.     After all, you don't want a broken rake or a lack of yard bags to stop you from getting your work done! <br/></p>\n<p>While your basic rake is sturdy, there are other rakes you can purchase which can allow you to finish yards in less time or require less energy. Which rakes will you purchase? Can you afford all of them? </p>\n<p><strong>NO ADS, NO IN-APP PURCHASES, AND NO VIOLENCE        </strong><br/><br/>Have peace of mind with an ad-free, safe game.        <br/><br/><strong>THE GBGAMES VISION        </strong><br/><br/>A world in which curiosity is encouraged, creativity is supported, and continuous learning is promoted.        <br/><br/>I see a world in which children are allowed to explore their world at their own pace.        <br/><br/>Where questions are encouraged and interests are fostered. <br/><br/>       Where creation is seen as more enjoyable than destruction or passivity. <br/><br/>     Where interests in learning and self-improvement thrive.</p>\n\n<p>Want to learn when Freshly Squeezed games I am creating are released   and get behind-the-scenes information about their development?      </p>\n<p>Sign up for the GBGames Curiosities newsletter, and get the 24-page, full color PDF of the Toytles: Leaf Raking Player’s Guide for free!</p>", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-09-23T14:21:57", "background_image": "https://media.rawg.io/media/screenshots/677/6778943a907ba9af8bb65e9a91e28793.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Gianfranco Berardi"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}