{"id": 855573, "slug": "our-hero-last", "name": "Our Hero! Last", "name_original": "Our Hero! Last", "description": "<strong>Previous chapter:</strong> 🡨 Our Hero! Two<h3>Features</h3><ul><li> Real-Time Battle System<br/></li><li> Upgrade and transform your weapons to make them more powerful!<br/></li><li> Power-ups system: use the ESP to increment your max energy, the attack power, the defense, learn new skills and new powers to use during battles<br/></li><li> A lot of action: run, jump, fight, strengthen yourself, run on walls, kick, climb, dig, control enemies, shoot!<br/></li><li> 9 brand new acts: a large new world awaits to be explored by our heroes, full of new puzzles, side missions and epic boss fights!<br/></li><li> Perform special actions to unlock achievements in the Trophy Hall and collect cards in the Gallery<br/></li><li> The end of the trilogy: fight the final battle!</li></ul><h3>Characters</h3><br/>- <strong>Ourhero </strong>is able to fight against horde of enemies thanks to his King's Sword. You'll be able to upgrade his sword, transform it and learn new skills to use during a battle.<br/>Ourhero is now able to cross ravines running on some walls!<br/><br/><br/>- <strong>Fury</strong>, thanks to his metal armor, can deliver powerful kicks that can destroy some rocks and destroy weakened enemies.<br/>He can also climb up some walls and dig holes in the ground to discover precious hidden artifacts!<br/><br/><br/>- <strong>Tay </strong>has a powerful magic medallion that always keeps on his neck. When you use his medallion you can discover magic water puddles that allow you to reach places otherwise unreachable. His medallion is also capable of controlling some enemies from distance!<br/><br/><br/>- <strong>Grin </strong>is a new hero who joins the party: he will be very helpful to the heroes, bringing new combat tactics into battles!<h3>Story</h3>You are starting the final epic chapter of the Our Hero! saga.<br/>Ourhero has been appointed as the new ruler of the Kingdom.<br/>Everything looks nice and quiet, when all of a sudden... history repeats itself.<br/>The Crystal has been stolen from the Castle! Which crystal?! Wasn't the Teorhemas Crystal been destroyed?!<br/>Ourhero, Tay and Fury start a journey to find out explanations and it is so they find themselves thrown in a completely new world.<br/>A new danger threatens the happiness not just of the Kingdom, but of the whole world. The peace of the race of our heroes of the present, the past and the future!<br/>The sages call the heroes to action and a new hero join the party, ready to give its support for the cause.<br/>Let's start... Our Hero! Last!", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-10-17T05:24:33", "background_image": "https://media.rawg.io/media/screenshots/32e/32e10359f8745927328d8f2cc2c14cca.jpg", "website": "https://stesproject.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 419, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ste's Project"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Ste's Project"], "esrb_rating": null}