{"id": 855614, "slug": "multiplication-and-addition-game-math-tower-2", "name": "Multiplication and addition game Math Tower 2", "name_original": "Multiplication and addition game Math Tower 2", "description": "<p>Math Tower is a game of addition, subtraction, multiplication, and division for which you must run, jump and catch the correct answers in balls, bubbles, frogs and birds.</p>\n<p>Mathematical operations appear on the top board of the game and change each time the answer is correct.\r\n</p>\n<p> </p>\n<p>As you get it right, you will earn more points for each correct answer and the game will also become faster and more difficult.<br/>Have fun while you progress through the 20 levels in 2D format. As a result, Math Tower 2 helps you improve your ability to memorize, add, subtract, multiply and divide.\r\n</p>\n<p>Catch the 10 stars and have the highest number of hits, win medals and trophies to show your teacher, friends, and parents<br/>The first 10 levels correspond to the table of multiplication, addition, subtraction, and division from 1 to 10.<br/>After level 10, the questions are between 1 and 10 for you to practice the 10 tables.<br/>If you don’t remember the correct answer after a few seconds, our characters will give you the answer.\r\n</p>\n\n<p>Math Tower 2 allows you to play with 4 people, Zarita, Juan, Nicolas and Math.<br/>If you fall from the tower the parachute  limit the fall and quickly climb to the top of the tower using the steam jet from the small volcano.</p>\n<p>The game can be used with Touch controls from the screen or the keyboard.<br/></p>\n<p>Math Tower 2 is available for Android and Windows.<br/></p>", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-09-23T15:14:14", "background_image": "https://media.rawg.io/media/screenshots/b9a/b9a2252c248d4ecaf0f1540d418ff378.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TicosGames"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}