{"id": 855711, "slug": "crame-leon", "name": "Cramé, Léon", "name_original": "Cramé, Léon", "description": "Cameo Leon\r\n<p>It was a cold, rainy night… but not inside the nightclub, where folks were getting jiggy!</p>\n<p>Still, I was looking for Cameo Leon’s henchmen. These guys are not square, so it would be easy to spot them… or so I thought, but finding such chameleons on a disco dance floor in a dark shady club turned out to be a real pain!</p>\n<p>Should I make three mistakes, the bouncers get rid of me. I also had limited time to act. But… there seemed to be an endless stream of ever bigger nightclubs…</p>\n<p>[<em>Where’s Waldo?</em>, with a twist.]<br/></p>\n<p>Made with Love2D.<br/></p>\r\nControls\r\n<ul><li><strong>Just the mouse! Light up the scene and click on the right suspects</strong>.</li><li>Esc: quit</li><li>P: pause</li><li>Space: begin / try current level again</li></ul>\r\nKnown Bugs\r\n<ul><li>The ‘chameleons’ sometimes use the colour of another area; I could not pinpoint the origin of this bug, as things seem to go well with few chameleons, and this happens when there are more. Perhaps changing the colour mode too often (with setColor) does this, but this would be weird, since colour stays absolutely correct or the hats and glasses… Still, the game feels playable and hard enough even with this!</li><li>In the navigator version: the love.js fullscreen mode (using the lower-left button) seems not to have the keyboard respond (at least for me under Firefox), only the mouse; nevertheless, <strong>the itch.io fullscreen mode (using the lower-right button) works</strong>.</li></ul>\r\nCreation context\r\n<p> <em>Made for Mini Jam 115 with theme <strong>‘Noir’</strong> and limitation <strong>‘Everything is Temporary’</strong>. (Running time: from September 16th 2022 at 6:00 AM to September 19th 2022 at 6:00 AM.) \r\n</em>\n</p>\n<p>This time, only a smaller quicker contribution because I am dabbling in Game Boy development (first time! :)) for GBJam 10. Reusing the torch from <em>Enquiquineur</em> (a shader I had in fact written for another previous test game in Love2D). Made in just a little more than a day.<br/></p>\r\nCredits\r\nSounds\r\n<ul><li>\"Breaker-1.wav\" by Deathscyp at Freesound.org\r\n</li></ul>\r\nMusic\r\n<ul><li><em>Disco Medusae</em> Kevin MacLeod (incompetech.com)\r\n  Licensed under Creative Commons: By Attribution 4.0 License http://creativecommons.org/licenses/by/4.0/ \r\n</li></ul>", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-09-23T15:55:28", "background_image": "https://media.rawg.io/media/screenshots/f10/f10b59620d19ca975b386f9b317c6f94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Mossieur Patate"], "genres": ["Action"], "publishers": [], "esrb_rating": null}