{"id": 8558, "slug": "warlords-rts", "name": "Warlords RTS", "name_original": "Warlords RTS", "description": "Warlords RTS is a real-time strategy game set in the fantasy world Aldfarne. Upgrade your army, boost your Warlord with magic items and lead your troops to victory! Enjoy hours of gameplay and dare to play Hardcore difficulty mode!<br/><br/>On your journey to defeat fierce enemy bosses, you&amp;#39;ll face various challenges requiring your strategic and cunning tactics in order to triumph over the land. Choose your army carefully, as each unit has very different abilities and gameplay will vary dramatically upon these choices. <br/><br/>By using magical items and upgrading your camps, you can boost your Warlord and army to reach powerful new levels. Watch out for treasure chests on the battlefield and be sure to use your magic scrolls wisely!<br/><br/>The battle for Aldfarne will not be easy… so begin your defense preparations and start the conquest today!<br/><br/>&amp;quot;The game looks and sounds great!&amp;quot; www.gamezebo.com<br/><br/>&amp;quot;Rally the troops and get ready for a challenging RTS experience that&amp;#39;s also totally metal.&amp;quot; www.148apps.com <br/><br/>While Warlords RTS includes in-app purchases to enhance the adventure, these items are fully optional and aren&amp;#39;t necessary to complete the game in Normal difficulty mode.<br/><br/>Any problems or suggestions? We’d love to hear from you! You can reach our support team at warlordsrts@gmail.com<br/><br/>Find us on Facebook at http://www.facebook.com/WarlordsRTS", "metacritic": null, "released": "2013-12-03", "tba": false, "updated": "2019-10-22T14:29:58", "background_image": "https://media.rawg.io/media/screenshots/147/147ec91e5d37eb5a4c4a7a487a086d0f.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sasa Stublic"], "genres": ["RPG", "Strategy"], "publishers": ["Sasa Stublic"], "esrb_rating": "Teen"}