{"id": 855926, "slug": "social-justice-hacker", "name": "Social Justice Hacker", "name_original": "Social Justice Hacker", "description": "<p>Created for VimJam3 for the themes Multi-use and Turn up the heat.</p>\n<p><strong>Multi-use:</strong> Use your hacking tools to help many different people accomplish different things. Also, use boosts for multiple purposes, multiple times.<br/></p>\n<p><strong>Turn up the heat: </strong>Select the challenge mission on your mission screen to crank up the difficulty!</p>\n<p>You play as a hacker working for the organization Anonymoose. Every day, people from around the country ask for your help when they've been treated unfairly. It's your job to put your white hat hacking skills to the test and achieve a positive outcome for your clients.</p>\n<p>There are 15 standard missions, 5 challenge missions, and a final mission you can complete to test your hacking expertise.</p><p><strong>NOTE:</strong> This game is unabashedly political, if you couldn't tell from the title.</p>\n<p><strong>Music by:</strong> https://gooseninja.itch.io/space-music-pack</p>\n<p><strong>SFX by:</strong> https://obsydianx.itch.io/interface-sfx-pack-1</p>\n<p><strong>Art by</strong><strong>:</strong> me</p>\n<p><strong>Special Thanks: </strong>Thank you to Amanda and Ben for playtesting. So many QOL tweaks came out of that very valuable feedback.</p>\n<p>And thank you to Vimlark for hosting this jam and sharing so much about Construct. The engine has allowed me to complete more game jams and focus on the fun of making games rather than the tedium.</p>", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-09-23T17:30:42", "background_image": "https://media.rawg.io/media/screenshots/e42/e42db23f45d0b70ab541887396f23190.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 48, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CallumKeene"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}