{"id": 855940, "slug": "stick-it-to-heaven", "name": "Stick it to Heaven", "name_original": "Stick it to Heaven", "description": "<p>This game is a submission for VimJam3, Thank you for playing!<br/></p>\r\n*Warning* low poly gore. \r\nFor best gameplay and graphics play the native downloads\r\n<p>Godot had some performance issues in its web build so the web build does not have any particle effects and has a few odd visual glitches from switching out the rendering methods.</p>\r\nThe Game's Story\r\n<p>You died and were accidentally sent to hell. Opps! Luckily you found a stick on your way down to the depths. <br/></p>\n<p>You start the game at the gates of hell and are greeted by the demon guardian of the gate. He tells you: “Tough luck kid, I'm not the guy that makes the decisions, I'm just here to make sure you don't leave through the gate. Only way out of here is to defeat me and steal my gate key.”\r\n</p>\n<p>You travel around the Hellish landscape, fighting, foraging, and crafting to help you suit up enough to challenge the demon guardian. </p>\r\nControl and Instruction Guide\r\n<p>WASD - movement</p>\n<p>E to pick up sticks. You can carry up to 5 different sticks on your hotbar (accessed with number keys 1-6) (sorry ran out of time to add a visual for it) </p>\n<p>Q to upgrade stick with upgrade on ground</p>\n<p>Shift to block</p>\n<p>Left click to attack</p>\n<p>R to respawn</p>\n<p>T to reset level</p>\n<p>Esc to return to menu</p>\n<p>Your stick is your lifeline, the ultimate tool to battle the minions of hell. Upgrade it to give yourself different abilities and strengths while you fight and travel the hellish landscape.</p>\n<p>Different enemies and environment objects will drop different attachments to craft your battle sticks. If you ever need a new stick destroy a tree. To heal eat either the demon fruit or the demon flesh. </p>\r\nMeet the Creatures\r\nThe Gatekeeper\r\n<p>An ancient titan of hell. The defender of the gate. Has existed for eons for the soul purpose of keeping all in hell in hell. He serves a difficult challenge with his use of both ranged fireballs and hard hitting attacks. </p>\n\r\nImps\r\n<p>Small magical creatures that are adept to throw a fireball at you rather than engage in physical combat. They may be weak, but can pack a burning punch so make sure to dodge the fireballs.</p>\n\r\nHell Hounds\r\n<p>Fiendish creatures that hunger for the flesh of the damned. Once one of these beasts have caught your scent they are very difficult to shake. </p>\n\r\nDemon Warriors\r\n<p>Native denizens of hell. They wander the hellscape looking for battle with their blood lust</p>\n\r\nHell Rhinos\r\n<p>Feared gargantuan beasts covered in hellfire that viciously trample all who oppose it.  The power of its horn is legendary and is known to destroy its foes.. perhaps such power can be wielded. </p>\n\r\nThoughts on the Game\r\n<p>I saw someone do this on their game jam submission last game jam I was in and I thought it was a good idea to help document progress. </p>\n<p>I originally came into this game jam with the idea of trying to leverage AI as a tool to assist in design and the creation of assets. I made use of Stable Diffusion to generate concept art, textures, and menu images. It was a very powerful tool and using it to generate references for my 3d models really helped me to craft something unique that looks decent, especially considering my lack of experience in creating both 2d and 3d art.  I also leveraged GPT-3 to help brainstorm ideas and work out some of the lore. </p>\n<p>As with any game jam I have done so far, I really struggled with scope creep. There was so many features that I had originally planned for the game. The 10 day time limit deceived me a bit since I was used to doing 2 - 3 day jams. Sure I was able to make a lot more content, but it is still important to try to keep the scope as small and reasonable as possible. Hopefully I can learn this time and not keep repeating this mistake.</p>\n<p>I feel my position with the theme and focus of the jam were a bit lost due to some of the features that I didn't get around to implementing. I had wanted to make the environment a lot more dynamic and making managing overheating in hell a part of the survival component. At this point \"Turn up the Heat\" is more so thematic in that you are in the fiery depths of hell raging in epic battle with the denizens. The master tool aka your stick was intended to have a lot more functionality as well, such as being able to stab the food items, cook em over a fire or lava for additional bonuses. I also wanted to make different combinations of stick upgrades more dynamic, but after realizing my core code base would be difficult to force that to work I opted to work on polish instead since I already had something fun.  All in all this was definitely a weak point for me this jam. </p>\n<p>This was really my first project in Godot. Despite having to learn everything on the fly this game jam I really like the engine and definitely plan to use it for future games. </p>\n<p>I had originally planned to try to learn how to compose some music for the game, but I basically was in mad scramble mode to clean up the project as much as I could that I just opted to source out some free sounds. </p>\n<p>Overall I feel very happy with this project. Despite not getting it to the point I wanted to I had a lot of fun creating it, and playing it. It feels like it has a decent core and with more time could become something really enjoyable. I learned a lot and am pumped up for my next game! Thank you again for looking at my project. I greatly appreciate any feedback! </p>", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-09-23T17:37:15", "background_image": "https://media.rawg.io/media/screenshots/56a/56ad39f4662b25b0d3b4248c6c07dd09.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Cranberry Ninja"], "genres": ["Shooter", "Adventure"], "publishers": [], "esrb_rating": null}