{"id": 856169, "slug": "project-rascal", "name": "Project Rascal", "name_original": "Project Rascal", "description": "<p>Project Rascal is a fast-paced 3D action platformer inspired by the greatest hits of the mascot platformer genre. In it, you take control of Rascal, a nimble kid with a lot of attitude and a knack for adventure. Rascal is part of an ancient civilization long forgotten; One day the island they inhabit gets attacked by a mysterious individual looking to uncover the secrets of the Shards, and it&#39;s up to Rascal and his friends to foil their plans and restore peace to the island once again.</p>\n<p>Project Rascal has been in development for almost a year and it&#39;s the brain child of two Brazilians with a passion for game development. This is the very first release of the game and as such, things may seem a bit rough around the edges. All the feedback is appreciated. If you would like to contact us, or simply just find other people with a similar interest in the game please join our Official Discord Server: https://discord.com/invite/QHA4CMEVRw ;</p>\n<p>If you would like to help us develop the game, you can do so by supporting us on Patreon https://www.patreon.com/ProjectRascal or simply by following us on Twitter https://twitter.com/ProjectRascal and telling your friends about the project. We hope you have a great time with it!</p>\n<h1>platformer #action #adventure</h1>", "metacritic": null, "released": null, "tba": true, "updated": "2022-09-25T21:19:23", "background_image": "https://media.rawg.io/media/screenshots/190/190d6b694eaec298feb8487654bf003c.jpg", "website": "https://gamejolt.com/games/ProjectRascal/640802", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}