{"id": 856152, "slug": "hot-potato-itch-jtnoble", "name": "Hot Potato (itch) (jtnoble)", "name_original": "Hot Potato (itch) (jtnoble)", "description": "<p><em>This game is part of a submissions for the VimJam3 game jam!: https://itch.io/jam/vimjam3</em><br/></p>\n<p>------------------------------------------------------------------------</p>\n<p>Everyone always asks why did the chicken cross the road, but no one asks what came first, the chicken or the bomb?</p>\n<p>Hot potato is a game about a chicken that is attempting to climb out of a fiery hellscape full of lava, but little does he know that it is endless, and all he is doing is prolonging his inevitable demise. Climb this hellscape to score the highest points possible, but there is a catch. The chicken must carry a bomb with him, but this bomb explodes if held for too long. The chicken must juggle dropping and throwing the bomb while traversing the platforms, using the bomb to blow up walls blocking his path.</p>\n<p>As this game is part of a game jam, the game follows a theme: \"Turn Up The Heat\". Of course, this theme proudly represents the setting of our chicken, platforming above lava. Fun fact, did you know lava is about 2,200 degrees Fahrenheit?</p>\n<p>More importantly than the theme is the jam's focus: \"Multi-use\". The chicken himself only has one goal, to try and escape, and even though we know he can't, the chicken unfortunately may never find this out. The bomb however has multiple uses. The bomb can kill the chicken if held too long. The bomb can be used to break walls. The bomb must be juggled along with the chicken.</p>\n\n<p>This was my first game jam experience, and with working a full-time job on top of general family/friends activities, this was a little daunting to take part in. Hopefully you all enjoy my fun little game. While I didn't spend hours playtesting, I do have a high score of 1,414, so try and beat that!</p>\n\n\n<p><em>The following are credits to assets either not created by me and used with permission, and assets that I used external tools to create:</em></p>\n<p>Chicken Sounds - https://orangefreesounds.com/chickens-sound-effect/</p>\n<p>Rooster Call - https://orangefreesounds.com/rooster-morning-call/</p>\n<p>Music - Created by me using https://beepbox.co</p>\n<p>Explosion Sound - Created by me using https://sfxr.me/<br/></p>", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-09-23T19:03:19", "background_image": "https://media.rawg.io/media/screenshots/099/099d1afe3ee7841a0dcfe62879dc3c01.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["jtnoble"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}