{"id": 856210, "slug": "golfing-in-aether", "name": "Golfing In Aether", "name_original": "Golfing In Aether", "description": "<ul><li><strong>Unique overall course layout</strong> for each session. Golfing In Aether accomplishes this through having each of the holes being its own independent floating island. There are currently 32 holes excluding variations in the game. The game will choose these at random from a pool at the start of a session and procedurally create the overall course layout. <br/></li><li><strong>Get-together with friends</strong> in sessions supporting up to 16 players online and 4 players locally. You can take any additional local players into online sessions with you. Online sessions also support joining as a spectator.<br/></li><li><strong>Freedom to choose</strong> different modes such as playing together in real time (local players use split screen) or taking it in turns via hotseat. <br/></li><li><strong>Compete against ghosts</strong> in practice mode for the top spot in an individual level with both global and friends only leaderboards.<br/></li><li><strong>Replay</strong> your previous sessions via the session replays feature. This allows you to spectate previous sessions you've played with options such as being able to see from another players perspective, use free camera, and the ability manipulate playback rate. <br/></li><li><strong>Customize</strong> through a range of color-pickable designs for your golf ball. Five designs are available from the start with others being unlocked as you earn XP through playing and level up.<br/></li><li><strong>Accessible with full gamepad support</strong> through the inclusion of an on-screen keyboard and ability to create local player profiles for saving any customizations, player names or gamepad settings.</li></ul>", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2022-09-26T03:50:47", "background_image": "https://media.rawg.io/media/screenshots/e88/e88881d83c3f221b4b7dea5588cca4ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vetron"], "genres": ["Simulation", "Sports", "Racing", "Casual", "Indie"], "publishers": ["Vetron"], "esrb_rating": null}