{"id": 856218, "slug": "watamari-a-match-made-in-heaven-part1", "name": "Watamari - A Match Made in Heaven Part1", "name_original": "Watamari - A Match Made in Heaven Part1", "description": "A never before seen style of yuri storytelling featuring high quality, Live 2D character sprites.<br/>Volume 1 in the Watamari series!<br/><br/>Spies, a school for elite, young ladies, urban fantasy, science fiction.<br/><br/>From Kuro Irodoru Yomiji, the developers of Ne no Kami: The Two Princess Knights of Kyoto comes this new yuri title filled with intrigue and drama.<h3>STORY</h3><br/>Spring.<br/><br/>Hoshino Hikari is a new transfer student to the prestigious St. Leanne Girl's Academy. While her transferring in is quite extraordinary, everyone is more interested in the ritual that takes place before the opening ceremonies. <br/><br/>During this ritual, some students manifest signs of the zodiac, and then are given an angelic title and a blessing. These students are known as the Angels of the Zodiac, and are given the role of bringing fortune to the student body. Hikari, who is trying to not stand out in order to root out the school's secrets, is bestowed with the grace of Virgo during the ceremony and becomes known as \"Exousia\".<br/><br/>\"But... but... why me...?\"<br/><br/>What is her connection to the other Zodiac? And what are the secrets hidden within the school?<h3>FEATURES</h3><ul><li>Live2D animated character sprites that brings characters to life including each of their unique and cute mannerisms<br/></li><li>Yuri-focused UI that displays two character's feelings for each other as if reading a yuri manga<br/></li><li>Characters in this story are unleashed by the player! Even though each of the girls have their own lives, it isn't right that the player can only control the main heroine. A \"certain voice\" will help you guide these girls forward. The choice is in their hands.<br/></li><li>Featuring beautiful artwork by many notable yuri manga artists! Hakuishi Aoi, tokeshi, Ukani Uka<br/></li><li>Full Japanese voice acting<br/>Voice Cast<br/>Hoshino Hikari: Hanashiro Kazari<br/>Saginomiya Konoe: Iwamoto Sayori<br/>Saginomiya Homare: Kanoko<br/>Yata Hime: Kitaouji Yuki<br/>???: Kimura Chisa<br/>Ikaruga Gargouille Risette: Akiyama Haruru<br/></li><li>English, Simplified Chinese, Japanese language support<br/></li><li>Partial binaural audio support. Experience the game as if the girls are whispering into your ear.</li></ul><h3>CHARACTERS</h3><ul><li>Hoshino Hikari<br/>The main heroine of our story. A spy sent by the \"Agency\" to discover the secrets hidden within St. Leanne Girl's Academy.<br/><br/></li><li>Saginomiya Konoe<br/>The elder Saginomiya sister who became Student Council President during the Leonine Revolution.<br/><br/></li><li>Saginomiya Homare<br/>The younger Saginomiya sister who supports her older sister's efforts to claim victory in the Student Council Presidential Election.<br/><br/></li><li>Yata Hime<br/>A senior student who cares about Hikari and treats her well from time to time.<br/><br/></li><li>???<br/>A mysterious existence that uses \"something\" to guide the main heroine.<br/><br/></li><li>Ikaruga Gargouille Risette<br/>A rival of Konoe's who went toe to toe with her during the Leonine Revolution.</li></ul>", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2022-09-26T04:00:17", "background_image": "https://media.rawg.io/media/screenshots/5db/5db3a9bea45b9620f37c2ccea88c9139.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 5, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 497, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kuro Irodoru Yomiji"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Sekai Project"], "esrb_rating": null}