{"id": 856231, "slug": "the-white-raven", "name": "The White Raven", "name_original": "The White Raven", "description": "Awaken from your slumber young shaman, there is much work to be done.\n<br/>\n<br/>\nTake control of Jin, a young wayward spirit whisperer in this mystical open world Tactical RPG.\n<br/>\n<br/>\nBewilder your enemies in cerebral tactical combat, explore disenchanted hellscapes that blur the boundaries between the underworld and real life, and lead an unlikely team of bandits, partisans and outcasts as you uncover the harrowing truth of the Aurorean Steppes.\n<br/>\n<br/>\n<br/>\n<br/>\nWage Tactical War: Outsmart your enemies by taking advantage of every tactical opportunity afforded to you - whether it be setting the terrain on fire, shoving them onto an ally for a follow up attack or monopolizing the high ground,  give them no quarter, for none shall be shown to you as well.\n<br/>\n<br/>\n<br/>\n<br/>\nWeave Your Own Tale: You decide how your story plays out. Fancy being a smooth talking charlatan that exploits others’ weaknesses for your own ends? How about an unflinching truth seeker that protects the weak? Choose your own backstory, but know that the future is yet unwritten.\n<br/>\n<br/>\n<br/>\n<br/>\nConfront Spiritual Hellscapes: The dangerous world of Greater Balhaea is free for you to explore. Uncover ruins of a lost civilization - as well as its hidden treasures, descend into the underworld to solve otherworldly mysteries, or stumble upon seemingly idyllic locations housing dark secrets. Have your fill of misadventures in the open world design of The White Raven.\n<br/>\n<br/>\n<br/>\n<br/>\nBuild And Grow Your Tribe: All great tribes have humble beginnings. Gather resources from all corners of Greater Balhaea to build and upgrade your sanctuary. Invite and recruit highly skilled specialists to take advantage of those upgrades to increase your chances of survival.\n<br/>\n<br/>\n<br/>\n<br/>\nSpark Beautiful Love, Or Bitter Rivalries: Build relationships with your allies. Explore their complexities and struggles with character specific missions and determine their outcomes. Will you lead them on a path to destruction? Or will you help them to overcome their fears and weaknesses - and perhaps spark a little romance on the side?\n<br/>\n<br/>\n<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-26T04:17:02", "background_image": "https://media.rawg.io/media/screenshots/979/97988a051d41eedefeb949397dbb38c6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 418, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GatherRound Studios"], "genres": [], "publishers": ["GatherRound Studios"], "esrb_rating": null}