{"id": 856203, "slug": "convenient", "name": "Convenient", "name_original": "Convenient", "description": "You pull over to the nearest convenience store on your way home to get gas and quickly realize the rumors were true about this place. Survive and escape the Oldlake Stalker in this PS1 style survival horror game!<h3>Gameplay:</h3><br/><ul><li>Short horror game<br/></li><li>Low poly PS1 style<br/></li><li>No random jumpscares<br/></li><li>Multiple endings<br/></li><li>Several hidden secrets</li></ul><h3>Solve Puzzles</h3>In an <strong>escape room</strong> fashion, players will <strong>solve puzzles</strong> to escape the basement of the convenience store they’ve been locked in. While solving puzzles, make sure all items in the room are the way they were when you woke up or else the kidnapper will <strong>notice</strong> and attack. <br/><h3>Survive</h3>Players will also need to make decisions and survive being chased. There are several items to find around the game that will help you escape so make sure you <strong>look carefully</strong>, it may save your life. Multiple endings can be found so everyone will have a different experience and makes the game very replayable.<br/><br/><br/><strong><h3>Story:</h3></strong><br/>You’re <strong>traveling</strong> through Oldlake county. A place many people have told you to stay away from as there have been countless disappearances in the area. You pull over to the nearest convenience store on your way home to get gas and quickly realize the rumors were true about this place. <strong>Survive and escape</strong> the Oldlake Stalker in thie PS1 style horror game!<br/><br/><br/>The first horror game made by LunaApps which features an interactive environment and creepy characters while you survive an escape room puzzle and explore the convenience store.", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2024-01-07T13:58:53", "background_image": "https://media.rawg.io/media/screenshots/4c5/4c56acb6f02f192c06589b74a0835d49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Luna Apps"], "genres": ["Adventure"], "publishers": ["Luna Apps"], "esrb_rating": null}