{"id": 856211, "slug": "light-bringer-2", "name": "Light Bringer", "name_original": "Light Bringer", "description": "<h3>GAME</h3>Light Bringer is a 2D side scrolling fantasy strategy game with development RPG elements. Explore, gather, build and then when night falls, survive! You must make good use of the available resources, find the balance between defence/production and restore the light itself before the darkness of abyss consumes you. Plan and use your time during the day wisely because in the night the spawn of abyss will come. The choice is yours.<br/><br/><br/><h3>STORY</h3>In the beginning there was only light, the light of creation itself, the source of life, the essence of being. Just as there can be no life without death, so there can be no light without darkness. For endless years, Light Bringers have fought the spawn of the abyss. You are in the role of last Light Bringer. It is your task to rekindle the power of the obelisks around the world of Ifeon to restore the balance between light and darkness. You are the last hope of the Ifeon. You must bring the light, lest the world falls into abominable night!<br/><br/><br/><h3>FEATURES</h3><ul><li><strong>World of Ifeon</strong>: Explore the world of Ifeon, different areas with its unique landscape and atmosphere.<br/></li><li><strong>Building system</strong>: It has a minimalistic building system but at the same time strategic enough to find own style of play.<br/></li><li><strong>Captivating graphics</strong>: Each piece of graphics was hand painted with passion according to fantasy abstraction.<br/></li><li><strong>Ability increase</strong>: Upgrade your moonlight power, every game you can choose differently. Then you can better fight your enemies.<br/></li><li><strong>Passive perks</strong>: Improve your passive skills throughout the entire game progress.</li></ul><br/>", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2022-09-26T03:51:53", "background_image": "https://media.rawg.io/media/screenshots/6ab/6abb3968e85d07f136ff315c45c1420d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mobiga Entertainment"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Mobiga Entertainment"], "esrb_rating": null}