{"id": 856408, "slug": "pumpkin-harvest", "name": "Pumpkin Harvest", "name_original": "Pumpkin Harvest", "description": "<p>This game was made during the Cozy Fall Jam 2022 and was made by Joshua Hank (JoshntQ) and me, Dennis Hawran (AtmoGD).</p>\n\n<p><strong>How to play:</strong><br/></p>\n<p>Walk around with WASD or with the left stick on your gamepad.</p>\n<p>With the left mouse button or with the button south on the gamepad you can interact with things.</p>\n\n<p>To grow a pumpkin you have to plant a seed first. You get them from the chest on your farm. After that you can water the seed and wait untill the pumpkin is grown.</p>\n<p>Go with your pumpkins in the city and look for customers. Once you made enough money you can upgrade your farm or even buy a truck!</p>\n\n<p><strong>Game Description</strong>\n</p>\n<p>The people in the small suburb near your farm have pretty basic needs: pumpkins. Luckily, that's exactly what you're focused on! So you can plant, water, harvest and deliver your pumpkins - or just take a relieving walk in the woods and enjoy the beauty mother nature presents to you.\r\n</p>\n<p>If you still feel like improving your services' productivity, you can invest the cash you earned from your sales in more fields or even in a small truck!\r\n</p>\n<p>Pumpkin Harvest isn't about beating a highscore or fullfilling a task in time - its rather meant to be a small and cozy minigame for calming down in busy times.</p>\n\n<p><strong>Credits</strong>:</p>\n<p>Almost all the 3D Models and Sprites are from Kenney! </p>\n<p>Background music from Zapsplat</p>\n<p>Simple Fantasy UI Package<br/></p>\n<p>Arrow Icon by Chamestudio on IconScout</p>", "metacritic": null, "released": "2022-09-25", "tba": false, "updated": "2022-09-26T05:36:27", "background_image": "https://media.rawg.io/media/screenshots/f0f/f0fd78b6ea6912889ce363ce36bcbf94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AtmoGD", "JoshntQ"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}