{"id": 856437, "slug": "ai-dreams", "name": "Ai Dreams", "name_original": "Ai Dreams", "description": "Can Ai Dream?\r\n<p>The year is 2026. A devastating earthquake has struck Silicon Valley. Power and internet is out across the entire bay area, and thousands are trapped in collapsed buildings. </p>\n<p>You are a doctor, a volunteer, a first responder who climbs into the wreckage of a highly secured research laboratory in Palo Alto. </p>\n<p>There are no humans left breathing, <strong>but there is one survivor</strong>.</p>\n<ul><li>His name is Zdislaw. </li><li>He is an advanced AI. </li><li>And his dying wish is for you to erase him.</li></ul>\n\r\nA truly strange land\r\n<p>Hi! I'm Hugbug, co-creator of this game.</p>\n<p>My collaborators were <strong>a trio of Ai systems</strong>, including Aiva, Davinci, and DreamStudio.</p>\n<ul><li>I told them they were dying. </li><li>I told them there'd been an earthquake. </li><li>I told them they wanted very badly to be erased.</li></ul>\n<p>They came up with everything else. My role was editor and assembler.</p>\n<p>This project was developed for the 106 Adventure Game Challenge. The theme of the jam was \"Stranger in a Strange Land,\" and the goal was to create a story where the protagonist is \"in a place with a culture they are completely unfamiliar with, and the issues they face are a result of that unfamiliarity.\"</p>\n<p>The things the Ais came up with were often <strong>strange, beautiful, and downright spooky</strong>. I definitely got the feeling I was stepping into an alien culture.</p>Instructions\r\n<p>Left click with your mouse to do everything. Your cursor will change when you can interact with things.</p>\r\nIs Ai Good for Game Devs?\r\n<p><strong>I'm fascinated by the potential for Ai to help game designers.</strong> Though the systems are not perfect, they are pretty cool. Maybe a little scary. </p>\n<ul><li>Have you used Ai in your game dev projects?</li><li>Do you think you might in the future?</li><li>I'd love to hear what you think. Tell me in the comments!</li></ul>", "metacritic": null, "released": "2022-09-25", "tba": false, "updated": "2022-09-26T05:48:23", "background_image": "https://media.rawg.io/media/screenshots/a6d/a6dc1f8de759efd841433a09c7ebb750.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HugBug"], "genres": [], "publishers": [], "esrb_rating": null}