{"id": 856606, "slug": "midnight-ritual", "name": "Midnight Ritual", "name_original": "Midnight Ritual", "description": "Controls\r\n<p>Left and Right Arrows to move the character around.</p>\n<p>Z to shoot horizontally.</p>\n<p>X to shoot vertically.</p>\n<p>CTRL+R to reset the cart.</p>\r\nRules\r\n<p>You control a wizard who wants to perform a Magic Ritual.</p>\n<p>They must first gather the correct ingredients, then return to their home and ward off the evil spirits trying to stop them from getting their wish granted.</p>\n<p>There are two sections to the game:</p>\r\nGathering\r\n<p>The wizard is outside their home, and must get the 3 ingredients to perform the ritual.</p>\n<p>The player can move left and right as far as the screen will scroll, and will collect the ingredients just by touching them.</p>\n<p>After collecting all the ingredients you have to return home, and the game will progress.</p>\r\nMagic\r\n<p>Magic must be used in the search for the ingredients. It can be used to destroy enemies and obstacles that are blocking you.</p>\n<p>Before you can perform magic attacks, you must find the two magic elements.</p>\r\nWand\r\n<p>Lets you shoot forward in the direction the player is facing. Shoots with Z</p>\r\nStaff\r\n<p>Lets you shoot upward, to hit enemies and objects that were once unreachable. Shoots with X</p>\r\nIngredients\r\n<p>There are 3 ingredients necessary for the ritual:</p>\n<ul><li>a flower</li><li>a frog</li><li>a moth</li></ul>\n<p>Remember that the moth is flying high, and it must be hit with a Magic Beam before it will fly to the ground.</p>\r\nEnemies\r\n<p>Enemies will start appearing around the level after you've collected your wand. They will swoop down from the sky and try and touch you. If they touch you, you die.</p>\n<p>They can be dispatched with one Magic Beam.</p>\r\nDeath Counter\r\n<p>Every time you die, you will respawn soon after. Your Death Counter displayed at the end of the game will go up. Can you complete the game with the least deaths?</p>\n\r\nThe Ritual\r\n<p>After entering your home, the ritual must be performed.</p>\n<p>Step one is simple enough - shoot the center of the sygil to create it and let it expand.</p>\r\nThe Monster\r\n<p>Did something go wrong with the ritual? Is he part of it? Regardless, he wants to stop you from completing your work!</p>\n<p>The Monster's head is the weak spot: keep on hitting it.</p>\r\nSpit\r\n<p>The head of the Monster will spit downward at random - be careful not to be hit!</p>\r\nHands\r\n<p>They don't hurt you, but they close in on you and make it harder to move. Hit them with your magic to move them back and give yourself more space!</p>\r\nMonster's defeat\r\n<p>After the monster is defeated he'll retreat, and you'll be able to complete the ritual.</p>\n<p>I wonder what will happen to our friend wizard...</p>\n\r\nBehind the Scenes\r\n<p>What a great experience this game has been.</p>\n<p>A weekend of work, and for once I feel like I haven't wasted a single moment. I really did my best with this one!</p>\n<p>After the long, multi-level effort of \"Will of the Spider\" a short, two-level game is just what I needed.</p>\n<p>Plus, this meant that I could put in more detail around the place that I wouldn't have had the time to otherwise. Especially the music and little animated moments there are.</p>\n<p>Plus, Sin and Cos are very useful, did ya know???</p>\r\nCredits\r\n<p>Game made in Pico8\r\n</p>\n<p>Design and Programming by KaaSnake\r\n</p>\n<p>Music and SFX by KaaSnake\r\n</p>", "metacritic": null, "released": "2022-09-25", "tba": false, "updated": "2022-09-26T06:57:04", "background_image": "https://media.rawg.io/media/screenshots/d4f/d4f020f7425206ec6c4b021f42a644a6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KaaSnake"], "genres": ["Action", "Shooter", "Adventure"], "publishers": [], "esrb_rating": null}