{"id": 85686, "slug": "shen-xian-dao-gao-qing-zhong-zhi-ban", "name": "《神仙道》高清重制版", "name_original": "《神仙道》高清重制版", "description": "2016's most anticipated classic 3D turn-based hand tour, \"Immortal\" HD remake with you adjourned Xian Yuan!<br/>\"Immortal\" over a period of five years, operating a record number of brilliant achievements exceeded 300 million registered players! Most Online reached 500,000! ! \"Immortal\" Decent original cast, bringing you authentic Cultivation legend! ! !<br/>Fairy spectrum: Yang Jian, Fei Wei, Bai, Juling Shen, Princess Iron Fan play would send!<br/>Scripture library: Wu Sheng, Jian Ling, flight feathers career three-line switch freely!<br/>Gang warfare: to defend the collective honor for me.<br/>Sendo will: peak of the war, who will dominate the beings.<br/><br/>Chinese ink painting style, elegant and fresh scene, passers-by stop to watch the Cultivation do not have a landscape; awakened dynamic soul fighting effects, a strong sense of combat bring you a taste of a different turn hand tour.<br/>\"Immortal\" HD remake with you referendum Cultivation!<br/><br/>[Game Features]<br/>- The three protagonists occupation, the new 3D figures<br/>Wu Sheng: Katar broken mountains and rivers, the soul of Wu Feng heavy.<br/>Sword of Hope: Smart like light geese, Tayue as a meteor.<br/>Feathers: control string riding Herd, of birds break the sky.<br/><br/>- Classic play, strategy is king<br/>Formations, tactical deployment phase grams, policy-oriented.<br/><br/>- Buddy system, new games are played<br/>Partners recruit immediately reached protagonist level, eliminating the need to enhance the level, it is to force a wood there!<br/>Inheritance pit father no longer partners, you fly with a perfect heritage, small partners are shocked!<br/><br/>- Universal transfer, breaking the boundaries<br/>Good high crit flight feathers, the decision is up to you; Wu Sheng come protect our small partner; flash! flash! flash! Sword of the Spirit is not hit. Mom never worried me a copy make life difficult.<br/><br/>【contact us】<br/>If you like \"Immortal\" HD heavy plate, please pay attention to the game's official website, micro-channel public platform for the first time to focus on gaming activity, please feel free to leave a message, feedback problems.<br/><br/>Customer Service Email: tousu@xindong.com<br/>Players exchange group: 291 599 553", "metacritic": null, "released": "2016-03-30", "tba": false, "updated": "2019-07-30T02:31:33", "background_image": "https://media.rawg.io/media/screenshots/3dc/3dce5b1135bced0dfe65ca128a975707.jpg", "website": "http://sxd2016.xd.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 373, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["X.D. Network"], "genres": ["RPG", "Strategy"], "publishers": ["X.D. Network"], "esrb_rating": null}