{"id": 856851, "slug": "trilemma", "name": "Trilemma", "name_original": "Trilemma", "description": "Trilemma\r\n<p>A <strong>trilemma</strong> is a difficult choice from three options, each of which is (or appears) unacceptable or unfavorable.</p>\n<p>Created for the third microStudio Jam which theme was precisely <strong>3</strong></p>\r\nHow to play\r\n<p>Dragging the card on one of three direction, will show your choice for the active event. Drop the card on top-left, top-right or down to confirm your choice and accept the consequence. </p>\n<p>Top symbols vaguely represent three forces that move your medieval court: the people, the crown with its finance and the militia. None of this powers should go down to zero, or your kingdom will end soon.</p>\n<p>The controls are mobile friendly, but you can play with mouse too.</p>\r\nJAM Requirements and Optional\r\n<ul><li>Theme: 3 are the choices, 3 are the powers to balance, 3 is nice number</li><li>Poster/Cover: generated with one of those fancy AI image generators and then adjusted by hand</li><li>Self created assets: <ul><li>All gfx made by me with the help of Inkscape, first real experience with vector graphics, I have to say I feel more comfortable than pixel art.</li><li>All sounds made by me, I mean did you hear the the fire cracking in the fireplace in the intro.. well it's a piece of aluminium foil , really.</li><li>Music created with the help of my friend Robi using a guitar, a kalimba, a looper reverb and Audacity. There were also beers and some food, actually was a funny night, we had not the right equipment for record and maybe we should had play before opening the bottles.</li></ul></li><li>Color cycling animations: the fire and its particles use palette cycling<br/>\n</li><li>Palm trees and dog: play and you'll find them. The palm is not so obvious.</li><li>Couch multiplayer: if your friend is playing in a couch,even at his home, you can challenge him who has the highest score. The <strong>ranking is online and accessible from the crown symbol above the fireplace</strong>. Remember to change your name using the icon with the shape of pen and ink pot.</li></ul>\r\nSpecial Thanks\r\n<p>My wonderful wife for supporting me and allowing me a lot of extra time over and above my family duties. She payed attention to my ramblings on the game and suggested how to solve some aspects of the game.</p>\n<p>Robi for the help with the soundtrack</p>\n<p>Gilles to have made microStudio and keep it growing.</p>", "metacritic": null, "released": "2022-09-25", "tba": false, "updated": "2022-09-26T08:35:58", "background_image": "https://media.rawg.io/media/screenshots/fd0/fd0cce50e45cc4ee2299722674bab5a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["HomineLudens"], "genres": [], "publishers": [], "esrb_rating": null}