{"id": 856959, "slug": "d-fold", "name": "D-Fold", "name_original": "D-Fold", "description": "<p>#MadeWithDefold Jam 2022</p>\r\nControls:\r\n<p>WASD or arrow keys to move</p>\n<p>\"E\", Space or Right Click to use</p>\n<p>F10 to open the menu. You can restart a level from there if you get stuck</p>\r\nWhat's missing:\r\n<p>- The character sprite is just something I made to test a specific lighting shader. I'd like to redo it, add more animations, maybe even some actual graphics, though I have to say I've grown to like the gray blob...</p>\n<p>- More levels. There should be at least a couple for each tileset, and there should also be some flatland intermissions as the cube traveller visits different worlds on his search for a way back home.</p>\n<p>- Level transitions! I wanted to have two cubes collide whenever you reach an exit, allowing you to enter the new one. Also to have levels with camera inside of the cube. Should be a relatively easy change for a major change of perspective, while keeping the gameplay the same.<br/></p>\n<p>- More gameplay mechanics. Hazards, enemies, pushable crates (which may fall on your head if you flip gravity carelessly!). I didn't have time for anything beyond switches and doors, which severely limited my options while making levels.</p>\n<p>- Better and more graphics, animations to make the worlds come alive and implementing lightning within the cubes themselves. When I was making the levels, there just wasn't enough time to worry about lightning.</p>\n<p>- Fixing the physics. It was a quick job and it's relatively solid, but there's a bunch of quirks still. There's a couple of QoL improvements to make the platforming feel better too.</p><p>- Animated starry background for the cube levels. That would be nice.</p>\r\nCredits:\r\n<p>\"Future Gladiator\", \"Hiding Your Reality\", \"SCP-x2x (Unseen Presence)\", \"Tenebrous Brothers Carnival - Mermaid\", \"Voxel Revolution\", \"Wind of the Rainforest\"</p>\n<p>Kevin MacLeod (incompetech.com)</p>\n<p>Licensed under Creative Commons: By Attribution 3.0</p>\n<p>http://creativecommons.org/licenses/by/3.0/</p>\n<p>Sounds from zapsplat.com, mixkit.co and freesound.com.</p>\n<p>Made with Defold</p>\n<p>Desktop version uses DefOS by Subsoap</p>", "metacritic": null, "released": "2022-09-24", "tba": false, "updated": "2022-09-26T09:20:04", "background_image": "https://media.rawg.io/media/screenshots/bc3/bc3bdbe278b5cb433cef606c2302d205.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["KKlear"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}