{"id": 856990, "slug": "trappist-sirrah", "name": "Trappist (Sirrah)", "name_original": "Trappist (Sirrah)", "description": "<p><em>As soon as humanity had the means we sent out an interstellar colony ship. It's design was basic but elegant. And it made it all 40.7 light-years to <strong>Trappist-1</strong>.<br/><br/>— Ship data files</em></p>\n<p>On arrival at <strong>Trappist-1</strong> you control the Ark. A large spaceship/moveable colony and trading hub for your exploration of Trappist-1.</p>\n<p>Trappist is a story-driven colony builder with resource management in the Trappist-1 solar system.</p>\n<p>You'll create and grow multiple colonies in the Trappist-1 solar system. Meet new alien friends and gradually explore the mysteries of Trappist.</p>\n<p>Trappist offers colony building with a focus on care-free building and story. It's easy to play and respectful of your time.<br/></p>\n<p>Trappist is fully playable from beginning to end and is under active development. Leave a comment here or reach out to me on @SirrahGames.<br/></p>\r\nCurrent features\r\n<ul><li>Relaxing gameplay </li><li>Freely explore the Trappist-1 solar system</li><li>Meaningful progress even in short game sessions</li><li>Multiple storylets woven into the main story line about the nature of Trappist-1</li><li>8 hours or more to finish all current stories</li><li>5 distinct colony sites (including the Ark, a planet and two moons)</li><li>More than 40 different buildings</li><li>Over two dozen construction and consumption resources</li><li>Replace your workforce with robots</li><li>No money and no road placement, just base building without unnecessary distractions</li><li>Quick to start and no loading screens when switching between colonies</li><li>Cheat codes and console commands</li><li>(Skippable) tutorials to explain the controls and game play</li></ul>\r\nPlanned features and continued development\r\n<p>Trappist is under active development. But as solo developer I can't guarantee everything will be implemented, or will be implemented to an extent you might want or expect. I recommend you consider purchasing this game based on its current state alone.</p>\n<p>That being said, these are some of the features I hope to implement:<br/></p>\n<ul><li>Trade routes</li><li>Customizable starting conditions</li><li>More colonizable planets</li><li>More aliens</li><li>More research projects</li><li>Improved models and sound effects</li></ul>\r\nSystem requirements\r\n<ul><li>Windows, Mac OS and Linux are supported</li><li>400 MB HDD space</li><li>An Intel HD 620 integrated GPU or better</li><li>Any recent-ish GPU will be able to max out the game settings</li><li>The game should run fine on an average laptop</li></ul>\r\nControls\r\n<ul><li>Keyboard and mouse</li><li>Left-click to select, right-click to give orders</li><li>Move the camera with wasd or arrow keys, moving the mouse to the screen edges or click-and-drag</li><li>Touchscreen, including drag and pinch-to-zoom</li><li>Tutorial and documentation are available from within the game</li></ul>", "metacritic": null, "released": "2022-09-24", "tba": false, "updated": "2022-09-26T09:32:47", "background_image": "https://media.rawg.io/media/screenshots/f34/f34daf73d3d5e606f1c04c9fd844dfb5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Sirrah"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}