{"id": 856989, "slug": "atomix-itch-gamedevcodeur", "name": "Atomix (itch) (GameDevCodeur)", "name_original": "Atomix (itch) (GameDevCodeur)", "description": "<p>Atomix est un jeu vidéo de type puzzle transport/arrangement développé par Günter Krämer et édité par Thalion Software en 1990 pour Commodore Amiga et PC.</p>\n<p>Le principe du jeu est d'assembler des molécules en déplaçant les différents atomes qui les composent dans un environnement à deux dimensions.</p>\n<p>Vous trouverez les vidéos des étapes de conception, sur le lien     PlayListe Youtube</p>\n<p>Sélectionnez l'atome avec le bouton gauche de la souris puis déplacez la souris vers la gauche, la droite, le haut, le bas pour déplacer l'atome.</p>\n<p>touche f pour passer en plein écran <br/>touche esc pour faire une pause pendant le jeu. <br/>Touche q pour quitter le menu.</p>\n<p>--</p>\n<p>Atomix est un jeu vidéo de type puzzle de transport/jeu par arrangement, développé par Günter Krämer et édité par Thalion Software en 1990 sur Commodore Amiga et PC. </p>\n<p>Le principe du jeu est d’assembler des molécules en déplaçant les différents atomes les constituant dans un environnement en deux dimensions.</p>\n<p>Vous trouverez, les vidéos des étapes de conception, sur  le lien   PlayListe Youtube</p>\n<p>Selectionner l'atome avec le boutton gauche  de la souris puis déplacer la souris à gauche, droite, haut, bas pour déplacer l'atome.</p>\n<p>touche f pour passer en plein écran.<br/>touche esc pour pause pendant le jeu.<br/>touche q pour quiter pendant le menu.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-26T09:32:11", "background_image": "https://media.rawg.io/media/screenshots/ea2/ea2a330bf42cd2a3e8dcb8b2f201fa65.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameDevCodeur"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}