{"id": 85693, "slug": "inreverse-party-game-backwards-karaoke", "name": "inReverse Party Game - Backwards Karaoke", "name_original": "inReverse Party Game - Backwards Karaoke", "description": "THE FIRST TRULY UNIQUE PARTY GAME!<br/><br/>Bring your iPhone or iPad to the party or organize a party wherever you are in an instant. Play for a few minutes or for hours, it's up to you! The game is based on a popular Russian TV show. Watch our lame demo video at http://inreverse.me or read the reviews if you don't believe this can be funny! <br/><br/>HOW TO PLAY<br/><br/>1. Every game round involves two players, but if you have more people you can break into teams and change team every round.<br/><br/>2. The First Player secretly records a short fragment of a song a capella while the Second Player is not listening.<br/><br/>3. The Second Player listens to the recorded a cappella in reverse and tries to guess the song at once.<br/><br/>4. If the Second Player can’t guess it, then he tries to repeat the reversed version by recording it fragment by fragment.<br/><br/>5. When all fragments are recorded, Second Player listens to them all together reversed back and makes his final guess! If he has repeated fragment close enough he should hear the original song. Or something very similar!<br/><br/>Check out http://inreverse.me to watch a demo video and to leave your feedback. Share your tips and game rules variations with everyone!", "metacritic": null, "released": "2010-12-16", "tba": false, "updated": "2019-10-22T14:21:28", "background_image": "https://media.rawg.io/media/screenshots/88d/88d7d29c1cb57f4de8bee59d3d682ada.jpg", "website": "http://inreverse.me", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Silent Media"], "genres": ["Family"], "publishers": ["Vasiliy Popov"], "esrb_rating": "Everyone 10+"}