{"id": 857103, "slug": "cforever", "name": "C:\\FOR\\EVER", "name_original": "C:\\FOR\\EVER", "description": "<p><strong>Warning: While not aiming at horror, this game contains potentially disturbing themes and imagery regarding death, the Afterlife, self-worth and identity.<br/></strong></p>\n\n<p><strong>C:\\FOR\\EVER - First thesis: <em>Time is tar</em>.</strong></p>\n<p>Follow Stephen Williams as he dives deep in his twisted consciousness, meeting the uncanny thoughts that have waited for his return as the rightful ruler of his kingdom, the Isle. Among them, a single figure stands tall among the crowd, lovingly waiting for Stephen's return.</p>\n<p>The main themes tackled by the game are: the philosophical concept of time, the mind seen as a form of computer/software, identity and self-worth.<br/></p>\n<p>This game is inspired by poetry and philosophy, and, as such, its main goal is to deliver an intriguing story, as well as experimenting with the narrative potential given by the interactive nature of a videogame.</p>\n<p>This first chapter includes 1h - 1h and 30m of content, including (but not limited to): <br/></p>\n<ul><li>Two separate \"endings\".</li><li>8 unique enemies, of which 2 bosses.</li><li>Two characters with different abilities</li><li>Several puzzles </li><li>Voice acting and real-world footage</li><li>Fourth-wall-breaking gameplay</li><li>A dead fish that can predict the future</li></ul>\n\n\n\n<p><strong>Troubleshooting</strong></p>\n<p>-- Spoiler warning --<br/><br/><br/></p>\n\n<p>1. <br/></p>\n<p>At the beginning of the game is a puzzle I have seen some people struggle with. When you first boot into MindOs and open LOVE.png, please open RUN COMMAND and input <br/></p>\n<p>ssh 192.168.1.38</p>\n<p>Don't forget about the space between \"ssh\" and \"192...\"</p>\n<p>2. </p>\n<p>It is known that RPG Maker struggles to play large-sized videos without them freezing and thus softlocking the player. I may have found a workaround for it, however, if it <em>does not</em> fix the issue, please let me know so I can look deeper into fixing it. In any case, re-triggering the video a second time <em>should</em> solve the issue.<br/></p>", "metacritic": null, "released": "2022-09-24", "tba": false, "updated": "2022-09-26T10:17:30", "background_image": "https://media.rawg.io/media/screenshots/33a/33a41ec00b2bb402528c86179bf7e8d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Sugary Chamomile"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}