{"id": 85725, "slug": "jack-and-the-beanstalk-free", "name": "Jack and the Beanstalk Free", "name_original": "Jack and the Beanstalk Free", "description": "Discover the magic of Jack and the Beanstalk with the original story and animations! This interactive app presents the classic illustrations of a forgotten era with the magic of modern technology. <br/><br/>Features: <br/>~ Read to yourself or listen to the story by clicking the narration button on every page <br/>~ Touch the storybook images to watch them fall, bounce and collide <br/>~ Immerse yourself with the technology of today as the vintage animations come to life <br/><br/>All Ages <br/>~ Designed for ages three and up, but can be enjoyed by anyone young at heart <br/><br/>Universally Compatible <br/>~ Have an iPhone 5, iPhone 4, 3GS, iPad Mini and an iPad? No problem! The app is designed to be played on every unique iOS device. <br/><br/>Explore! <br/>~ Each and every page has immersive interactive content. We created a completely interactive experience with the drawings, bringing the original story to life. Try touching everything you see on the screen! Also, many of the scenes have hidden objects that roll and move as you move the device! <br/><br/>Gravity enabled images <br/>~ Move them, swing them, clink them! Many drawings in this app have layers, what moves? What requires you to make it move? Exploration is part of the fun in reading! <br/><br/>Vintage Animations <br/>~ At Fairytale Studios, we take original stories and remaster them in the spirit of how it was intended to be experienced years ago. The original animations from the 1800's have been redrawn and professionally enhanced for movement on the iPad and iPhones. Enjoy the hand drawn work and interact with it! It's a truly exciting experience. <br/><br/>New music composed for each scene! <br/>~ Every scene has a unique feel, music just makes it better <br/>~ Unique tunes specifically made for each page <br/><br/>Privacy Policy For Kids: <br/>~ We take online safety for children as a top priority and ensure that this app contains No social network integration, and No purchases required to continue playing. The app contains a \"More Apps\" section, with links to the App Store of our other titles. To make the app free for all users we have included ads by reputable agencies with no malicious content, we want the user to have the choice to have a free app with the option to remove all ads. We strongly encourage all users to take the option of ad removal so that the reading experience is as simple as reading a book off your very own bookshelf. We want to be very clear and have the option be in your hands!<br/><br/>~ Plant the beans and enjoy Jack and the Beanstalk for free!", "metacritic": null, "released": "2013-07-19", "tba": false, "updated": "2019-10-22T14:21:28", "background_image": "https://media.rawg.io/media/screenshots/bbd/bbd6f5724ecf4e16d5cc09cd3812b044.jpg", "website": "http://www.fairytale-studios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fairytale Studios"], "genres": ["Family"], "publishers": ["Fairytale Studios"], "esrb_rating": "Everyone 10+"}