{"id": 85730, "slug": "inklings-word-game", "name": "Inklings: Word Game", "name_original": "Inklings: Word Game", "description": "Inklings is Word Game Fun with Candy-Crazed Cuties!<br/><br/>Meet the Inklings! <br/><br/>These cute little friends love candy, and only YOU can satisfy their sweet tooth cravings. To win candy you simply spell words using letter-filled ink droplets. Each word you complete pulls the candy closer to your Inkling. Win the game and you'll reward your tiny friend with a deliciously sweet treat!<br/><br/>•  Easy-to-learn word game with simple drag-and-drop controls<br/>•  Grab falling letters to spell words in increasingly challenging levels<br/>•  Head-to-head multiplayer and single player offline mode <br/>•  Earn candy to feed your cute little Inklings<br/><br/>Get ready to perfect your skills as you progress through new, challenging puzzles, engaging your mind and your reflexes. Feed your Inkling enough candy and it will reward you with a Sugar Rush, indulging you with some unlimited playtime and a big, sugar-crazed smile!  <br/><br/>Ready to show off your wordsmithing prowess? Multiplayer mode lets you compete in real time with friends, foes, frenemies, and other players from around the globe. Use your fast fingers and quick wit to outscore your opponent, win the candy, and feed your Inkling first!<br/><br/>Important Message for Parents:<br/><br/>This game may include:<br/>• Live links to social websites intended for an audience over the age of 13.<br/>• Live links to the Internet that can take players away from the game.<br/>• Advertising of Kiz Studios products as well as products from select partners.<br/>• For optional in-game purchases, the bill payer should be consulted.", "metacritic": null, "released": "2017-07-26", "tba": false, "updated": "2019-10-22T14:21:28", "background_image": "https://media.rawg.io/media/screenshots/191/1910cefcc87e4c1105e999180885c816.jpg", "website": "http://www.kizstudios.com/inklings", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiz Studios"], "genres": [], "publishers": ["Kiz Toys"], "esrb_rating": "Everyone 10+"}