{"id": 857303, "slug": "stepz-2600", "name": "Stepz 2600", "name_original": "Stepz 2600", "description": "Background\r\n<p>The original concept for this game was created by Stepz with his entry into a Mega65 development competition. I thought it was a clever idea and perfect for the capabilities of the Atari 2600 when I got round to making games for it. </p>\n<p>To his design I have added procedurally generated levels, and the requirement to pick up a key before making your way to the goal, in this case the 'princess' at the top of the screen.</p>\n<p>This game was written over the course of 4/5 days as I continue to get to grips with the 2600 and gather ideas for a more substantial game.</p>\n<p>Code available here: https://github.com/1888games/Stepz-2600<br/></p>\n<p>----------------------------------------------------------------</p>\r\nHow To Play\r\n<ul><li>Move your player when the forcefield is off, aiming for safe spaces.</li><li>Collect the key to free the princess, then make your way to rescue her.</li></ul>\r\nTips\r\n<ul><li>You are only safe in the black areas of the screen.</li><li>Don't get caught in the middle of the forcefield when it regenerates!</li><li>Take your time, but not too much - the forcefield is steadily growing.</li><li>Hold fire to move at 2x speed, at the cost of one power charge.<br/>\n</li><li>You get two power charges per level, and also when a life is lost.</li><li>You have four lives to score as many points as possible.</li><li>Use 'Game Select' to enable movement while the forcefield is active (easy mode)</li></ul>\r\nScoring\r\n<ul><li>A bonus score is awarded depending on how quickly you reach the princess..</li><li>Un-used power charges will also give bonuses.</li></ul>\r\nImportant!\r\n<ul><li>If you are using a PC emulator, it is recommended to switch the fire button to map to something other than space, such as shift or Z, otherwise you will not be able to move diagonally up and left while holding fire.\r\n</li><li>A PAL version is provided for use on real hardware, but it is recommended to play the NTSC version on emulators.\r\n</li></ul>\n\n<p>----------------------------------------------------------------<br/></p>\r\nAurora Richmond\r\n<p>This game is dedicated to Aurora, the young daughter of a member of the retro development and musician community, who tragically passed away on 19th September 2022. Aurora was an exceptionally talented artist whose undoubtedly bright future has been cruelly taken away.<br/><br/>I worked with Mike on a VIC20 port of his C64/Spectrum/Amiga game Vegetables and as a father of two younger daughters this dreadful news really hit home.</p>\n<p>This game is as usual available for free, but any optional donations would be gratefully received and will go straight to Great Ormond Street children's hospital, or if you would prefer you can donate directly here:  <br/><br/>http://www.gosh.org</p>\n<p>----------------------------------------------------------------<br/></p>Tools &amp; Resources\r\n<ul><li>The fantastic online IDE/emulator/debugger at https://8bitworkshop.com\r\n</li><li>PlayerPal 2600 (sprite editor)\r\n</li><li>Atari Background Builder</li><li>Racing The Beam (Ian Bogost &amp; Nick Montfort)\r\n</li><li>Making Games For The Atari 2600 (Steven Hugg)\r\n</li><li>https://github.com/realdmx/retrore\r\n</li></ul><p>----------------------------------------------------------------<br/></p>\n<p><em>\n</em>\n</p>\r\nInstall instructions\r\n<p>You can play the .a26 file using the free emulator Stella, or the online emulator Javatari:  https://javatari.org </p>", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2022-09-26T11:39:34", "background_image": "https://media.rawg.io/media/screenshots/696/6967caf96a09cbc13cd6d9ad3fe75fe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Arlasoft"], "genres": ["Action"], "publishers": [], "esrb_rating": null}