{"id": 857364, "slug": "folds-of-a-separation", "name": "Folds of a Separation.", "name_original": "Folds of a Separation.", "description": "<em>. Folds of a Separation .</em>\n\n<p><em>There are no advertisements on the walls of a prison cell.\r\n</em></p>\n<p>No exhortations for a study-abroad course, or proclamations about the efficacy of detergent-powder; No screen printed fliers for a circus or a family-planning clinic. There are no bawdy film posters here or thrift store deals, no boarding house rates or quick-loan schemes, no handbills for chinese food and homoeopathy clinics, there are no bulletins and no political banners.\r\n</p>\n<p>The walls of a jail are not plastered with the promises of the living because there is no vantage to see them from. There is no landscape here that can place the clamour of existence into perspective and no distance from which you may squint towards a sign or a leaflet and declare yourself convinced by its proclamation. \r\n</p>\n<p>In jail you are equidistant from every other wall and every other body that is confined to the present. Confined without the dignity conferred to each of us by the landscapes we can traverse, and by the people who travel with us.\r\n</p>\n<p>Afterall to a state that has learnt to fear your actions, or your voice, or your name, or the accident of your birth, the colour of your faith or the lineage of your learning, you are but bodies that deserve their seclusion.  \r\n</p>\n<p>You are ideal citizens; Subject to just as much space as the state deems sufficient for your meagre survival. <br/>You are bodies reclaimed from the colourful theatre of the street, and from the public stage of the <em>maidan </em>where you once performed, in pagan fashion, your desperate marches and rigorous migrations in a proud defiance of the state. <br/></p>\n\n<p>But one cannot march in a prison cell, where every tread only mimes the liberation of walking without the transcendence of a landscape.</p>\n<p>Folds of a Separation is a short rumination on a state's control over bodies and the grief that stems from carceral violence.   <em>It has been translated to English and adapted from the third and fifth canto of an apocryphal protest song, often attributed to the Gujarati diarist and poet, Mir UmarHassan. </em></p>\n\n<p><em>Originally created for display at Fantasia Malware Presents,  at ACUD MACHT NEU Berlin. Also displayed at : Circades, curated by collectif Espace Fine 2022.  And at :  </em><em>Voluntary Attempts to Overcome Necessary Obstacles, curated by Nicholas O’Brien at EFA Project Space, New York. </em><br/><br/></p>", "metacritic": null, "released": "2022-09-23", "tba": false, "updated": "2022-09-26T12:07:09", "background_image": "https://media.rawg.io/media/screenshots/9a4/9a432856fbc09bd0767ea33fd1b9459d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Studio Oleomingus"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}