{"id": 85749, "slug": "invaders-from-the-dead", "name": "Invaders From The Dead!", "name_original": "Invaders From The Dead!", "description": "For all you retro fans out there!<br/>Nominated Game Of The Week by Touch Arcade!<br/>This is a brand new and original game influenced by some of our great 80's LCD and LED emulation games like Astro Wars, Invader from Space and Galaxy Invader. Designed in the style of these classic vintage handheld arcade games of the 80's. Includes retro lo-fi sound effects and simulated glowing LED display. Not just for Halloween but for anyone interested in scary games with zombies and creepy ghosts with a taste for retro and nostalgia.<br/><br/>You are the last hope for survival and last line of defence! Waves upon waves of zombies and ghosts are coming for your blood. They are getting hungrier and faster and the more you destroy, they just keep coming! Immortal bats fly out from the zombies so you must  dodge them. You must shoot at the zombies and ghosts before they get you. There is an evil spider controlling the invaders. If you manage to shoot the evil spider, you get more points and extra ammunition.<br/><br/>Features:<br/>• Accurate simulation of a classic handheld machine <br/>• Simple and addictive <br/>• Totally nostalgic <br/>• 3 Different waves of attack<br/>• Increasing amount of invaders<br/>• Retro lo-fi sound effects<br/>• iCade bluetooth arcade cabinet support<br/>• Game Center Hi-scores<br/>• Challenge friends on Facebook, Twitter and Sina Weibo<br/><br/>HOW TO PLAY <br/>1. Turn on by sliding power button to \"ON\" <br/>2. Using the left and right buttons aim the sniper target at the invaders or dodge the immortal bats or they will take a life. Press fire to shoot at invaders. You only get one shot at a time.<br/>3. Game ends when invaders reach you, taking over the last of the human race or you destroy all invaders by reaching 9999 points. Destroying the evil spider rewards you 50 points and an extra ammo pack. Your reloading speed increases every 1000 points. If ghosts appear at the same time as zombies you only need to destroy the ghosts.<br/>4. To start a new game simply switch slide to \"off\" and then to \"on\" again. <br/>5. If using with iCade or compatible controller, press the iCade button on bottom center and you can now use joystick and red fire(5) button. <br/>NOTE: pressing this without connection to a compatible Bluetooth controller will bring up the keyboard. If this happens just press the button again to turn it off.", "metacritic": null, "released": "2013-10-25", "tba": false, "updated": "2019-07-30T09:52:01", "background_image": "https://media.rawg.io/media/screenshots/fcc/fcc93baa034b90d89486451f99d91f1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Rob Wilmot"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Rob Wilmot"], "esrb_rating": null}