{"id": 85754, "slug": "blokzilla", "name": "Blokzilla", "name_original": "Blokzilla", "description": "BLOK MATCHING ACTION that will challenge your brain!<br/><br/>**★** We are going FREE with this app, with a simple hope...that if you like the music in the app, you will at least check out THE KILL SCREENS new album called \"Science Fiction Movie\" in iTunes and maybe buy a song?  Or tell your friends.  Seriously.  **★**<br/><br/>We would really be indebted to you.  We offer you this awesome free game as a sacrifice to your wisdom and your ability to know good music when you hear it...right!?<br/><br/>------<br/>\"The ticking clock, impatient multiplier and a delightfully loud visual and aural presentation combine to make the whole experience a startlingly intense good time.\" - McClatchy-Tribune<br/><br/>\"Love the retro feel of it!\" - Gamingbits.com<br/><br/>\"Tomato Interactive bursts onto the casual scene with an addictive game with a fantastic soundtrack\" - Chip Cella Executive Editor The B-Team Podcast<br/>-----<br/>Blokzilla™ is an absolute visual mind trip that features a killer sound track by the Indie Electronic Pop/Rock band, The Kill Screens!<br/><br/>Frantically try to find matching Bloks before the time runs up. However, it's not as easy as it sounds. The Bloks look very similar and you must study them all while the timer counts down to zero. Remove many Bloks in quick succession to increase your multiplier and earn more points. Reveal power-ups to call in a bombing raid or have the \"eye of truth\" guide your way. <br/>------<br/>FEATURES<br/><br/> - 4 game modes depending on how much time you have to play<br/>    =&gt; 1 Minute Madness<br/>    =&gt; 2 Minute Madness<br/>    =&gt; 5 Minute Madness<br/>    =&gt; Marathon (how high can you go?)<br/> - Awesome power-ups!<br/>    -- Bomber Plane destroys tiles for you, extends combos<br/>    -- The Elusive Triple-Bomber does massive damage!<br/>    -- The all-seeing-eye will show you the path, try to follow<br/>          along for huge combos!<br/> - Amazing music soundtrack by The Kill Screens!<br/>   (or listen to your own music while you play)<br/> - Local high scores<br/> - Online high scores<br/>     Game Center Leaderboards!<br/>     If your device is too old to support Game Center, OpenFeint will automatically be used instead.<br/><br/>TL;DR Great game is being made FREE in the hopes that you'll check out the music by THE KILL SCREENS in the iTunes Music Store.", "metacritic": null, "released": "2010-04-01", "tba": false, "updated": "2019-10-22T14:21:29", "background_image": "https://media.rawg.io/media/screenshots/306/30626b89ebd511b71cc49dd3fed2c267.jpg", "website": "http://www.tomatointeractive.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tomato Interactive"], "genres": ["Action", "Puzzle"], "publishers": ["Tomato Interactive"], "esrb_rating": "Everyone 10+"}