{"id": 85764, "slug": "the-long-journey-adventure", "name": "The Long Journey - Adventure", "name_original": "The Long Journey - Adventure", "description": "Travel to a faraway and distant land nestled in the mountains, where mankind is often unseen, and stories of the ages unfold. <br/><br/>You crash land in a very isolated, dense area in the forest. It appears to be another world - totally uncharted territory, where only outliers dwell.<br/><br/>With a backpack as your only supply, you start your journey through the vast woods, picking up clues on your expedition.<br/><br/>Along your way, you see visions of young children in the distance, waving you to keep moving along, as if there is a path and destiny to be reached.<br/><br/>Where did you come from? Who are these young children, and what are they leading you into?<br/><br/>The mystery of the Long Journey will unravel before your very eyes, and another improbable twist ending will unveil and leave you astounded, and wanting to discuss the turn of events that lead up to the epic finale...<br/><br/>Features Include:<br/><br/>Over 110 Gorgeous HDR Scenes from many places around the world, sewn together to bring you one stunning game.<br/><br/>Beautifully crafted music and sounds immerse you into a whole other world.<br/><br/>Captivating new storyline that builds up into an improbable twist ending!<br/><br/>Includes a Map System, Hints, Answers &amp; other tips and tricks to help you along the way!", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2019-08-02T03:42:25", "background_image": "https://media.rawg.io/media/screenshots/c04/c047bbc55f61b2ed8fed11c6a5546fa6_rUmhIJC.jpg", "website": "http://www.pointclickgamesllc.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Midnight Adventures"], "genres": ["Adventure", "Puzzle"], "publishers": ["Midnight Adventures"], "esrb_rating": "Everyone 10+"}