{"id": 857611, "slug": "afterimage-2", "name": "Afterimage", "name_original": "Afterimage", "description": "<p>Explore mystic Engardin<br />\nOne of the supreme deities created this vast world called Engardin, upon which natural wonders lie everywhere: gigantic volcanoes, steep canyons, deep seas and a tower that soars into the clouds…</p>\n<p>Encounter fantastic creatures during your journey: giant beasts wandering in fire, and spirits lurking in the depth of complicated labyrinths… Learn about your new friends, get to know their pasts and the agendas they hold.</p>\n<p>Engardin is alive with unknown secrets. Venture forth and feel free to explore wherever you like as a brave adventurer. Find out the stories that link each area, discover a concealed history and the truth of the world.</p>\n<p>Fight fierce enemies<br />\nEngardin is not only filled with sublime beauty but also plagued by crises. The corrupted are waiting for their prey and ancient deadly traps are ready to kill the careless. Grab your weapon and be prepared for battle!</p>\n<p>Each area features entirely different enemies and gameplay mechanics. Also, there are many unique bosses challenging your skills across the land. Opportunity lies in risks with hundreds of chests and numerous abilities ready to be unlocked to aid your adventure.</p>\n<p>Develop your very own combat style! A diverse selection of weapons with special attacks and various upgrade paths on the talent tree will help you improve yourself in this fast-paced ARPG. You will be the greatest warrior of the land!</p>\n<p>·Experience a gorgeous hand-drawn world<br />\nEvery backdrop of Afterimage is handcrafted by our passionate artists. A traditional metroidvania world offers you exquisite hand-drawn designs and amazing visual effects.</p>\n<p>Main features<br />\n·Traditional 2D side-scrolling ARPG metroidvania<br />\n·Intuitive controls<br />\n·Seamless semi-open world with over 15 different areas<br />\n·Over 10 character abilities<br />\n·Selections of unique weapon/magic builds<br />\n·Over 150 varieties of enemy<br />\n·Over 40 epic original soundtracks created by AurogonSoundTeam<br />\n·Estimated 25-30 hours gameplay on first run<br />\n·And… More surprises for you to discover!</p>", "metacritic": null, "released": "2023-04-25", "tba": false, "updated": "2024-03-09T02:06:15", "background_image": "https://media.rawg.io/media/screenshots/f18/f18cf0a917ba1c960348ed0548de1e56.jpg", "website": "", "rating": 4.45, "rating_top": 5, "added_by_status": {"yet": 13, "owned": 13, "beaten": 8, "toplay": 29, "dropped": 2, "playing": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 414, "game_series_count": 0, "reviews_count": 11, "platforms": ["Xbox Series S/X", "Nintendo Switch", "PC"], "developers": ["Aurogon Shanghai"], "genres": ["Platformer"], "publishers": ["Modus Games"], "esrb_rating": null}