{"id": 857612, "slug": "hotel-architect", "name": "Hotel Architect", "name_original": "Hotel Architect", "description": "<p>Welcome to Hotel Architect!</p>\n<p>Hotel Architect invites you to step into the shoes of a hotel entrepreneur! Embark on a comical journey that will take you to distinctively fascinating locations and challenge you to overcome unexpected obstacles.</p>\n<p>Unleash your entrepreneurial passion by creating exquisite multistorey hotels all over the world. You must stay on your toes and constantly adapt to new scenarios created by the increasingly crazy demands of your most extravagant guests.</p>\n<p>Transform empty property lots into bustling profitable hotels! With excellent architecture and management skills, the guests will soon start flooding into your hotels.</p>\n<p>Create your hotel from scratch! Design the layout and hire construction workers to lay the foundations and build different facilities over multiple floors. You can then choose freely which activities are to be conducted in which part of your establishment. Install amenities, place decorations, and choose between different wallpapers and flooring.</p>\n<p>Hotel Architect plays out in different locations all over the world, and each location has its own unique challenges with different types of guests. Knowing your customers better than they know themselves is the key to success here. By adjusting the type of services provided you can successfully integrate into any environment.</p>\n<p>Certain actions must go through one of your three advisors - Accountant, Manager, and Lawyer. Your advisors are your loyal servants, but they may become unavailable if their influence is too badly damaged from failing your risky requests. Asking for illegal actions can limit their ability to do their job and cost them their freedom.</p>\n<p>Accountant: The Accountant may apply for loans and advise you on how to increase your credit rating by making some magic with the financial reports. Used properly, her economic wizardry sways the banks in your favour.<br />\nManager: The Manager helps you adopt new policies which can improve the service offered by your hotel. He can also seek business partners, acquiring new sources of income.<br />\nLawyer: The Lawyer is covering your back and he will launch into a full-scale court battle at the faintest whiff of allegations against you. Your partners may lend him services, should they pursue a risky path. He is also an expert at negotiating subsidies with your local friendly politicians.</p>\n<p>Logistics is all about balance! Optimize the number of facilities, appliances, and staff needed to accommodate the stream of guests. Every action in the logistic chains plays out before your eyes. No clean plates and utensils in the kitchen? Then the waitress will have to wait for the plates to be cleaned in order to be able to serve the guests their food. Perhaps you need more personnel to handle the cleaning of the plates, or maybe add a dishwasher?</p>\n<p>The culinary and hospitality reviewers will look in every nook and cranny of your hotels. Maybe a chocolate on the bed and a whole lot of luck can save you? When getting higher critics and user reviews, you attract more guests that are willing to pay more for your services. Squeeze them for every penny, and you are on your way to creating a magnificent hotel empire!</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-10-21T06:21:55", "background_image": "https://media.rawg.io/media/screenshots/470/4703fafe35bfd9a1b50fd3bd4a42a0bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pathos Interactive"], "genres": ["Strategy"], "publishers": ["Wired Productions"], "esrb_rating": null}