{"id": 857753, "slug": "endless-nightmare-2", "name": "Endless Nightmare", "name_original": "Endless Nightmare", "description": "<h3>game Introduction</h3>\"Endless Nightmare\" is a 3D horror-based puzzle and stand-alone game. Test your logical reasoning skills by piecing together various clues found throughout the game. The connected story and horror setting will hopefully deliver an unusual game experience for players.<h3>gameplay</h3>This game is in first-person. You play as a police inspector James, your wife and daughter were murdered. In search of clues across various rooms of a mansion in order to find the murderer. The game has multiple endings, as you unlock them, the objective is to find the murderer who killed your wife and daughter. Don't be fooled by this plain-looking mansion, as dangers lurk in every corner, so be careful as you look for clues in the dark. Your goal, first and foremost, is to survive...<br/><br/>★ Investigate:  Explore each room, open locked doors, search for clues to figure out the truth<br/>★ Listen: Don't just rely on your eyes! Listen carefully to the sounds around you. Ghost will make noises when approaching.<br/>★ Escape: Hide and seek, even if you are discovered by the ghost, but don't be afraid, you still have a chance to outlast. Run immediately!<br/>★ Hide: You can find a hiding place, hide in closet or under table. Don't be seeked by her, or you will die, find a road to survival.<br/>★ Strategy: Attract her by breaking vases or cups, then take the chance to explore other areas. <br/>★ Attack: Don't want to hide anymore? Collect parts of the taser gun to assemble and let her disappear.<br/><h3>game features</h3>★ Attractive scary story, creepy case, horrific truth, experience the thrill of solving a case<br/>★ Multiple endings, unlock the different endings<br/>★ Multiple difficulty modes, improve your guts<br/>★ Avoid and eliminate the horrible ghost, exciting and fun<br/>★ 3D design and exquisite graphics, give you the most realistic visual horror experience<br/>★ Scary music, creepy sounds and atmosphere with jumpscares, please wear headphones for a better experience<h3>story Background</h3>The story takes place in a mansion located on the outskirts of Canada. James has locked himself in the house and vowed to hunt down the murderer who took the lives of his wife and daughter. After passing out from exhaustion, he awakes with a shock when an alarm goes off right at 10pm. When he revisits the crime scene, things get strange. The scattered documents on the floor, the locked door, the mysterious sob of despair, and a horrifying lady. An endless nightmare awaits...<br/>", "metacritic": null, "released": "2022-09-29", "tba": false, "updated": "2022-09-30T06:05:13", "background_image": "https://media.rawg.io/media/screenshots/1aa/1aaeb42a0dc199d9cfdb0a55b643a4de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CHENGDU JIAYIHUYU TECHNOLOGY CO.,LT"], "genres": ["Adventure", "Casual"], "publishers": ["CHENGDU JIAYIHUYU TECHNOLOGY CO.,LT"], "esrb_rating": null}