{"id": 857767, "slug": "elkabir", "name": "Elkabir", "name_original": "Elkabir", "description": "This game represents characters in real life from Egyptian actors to live the reality of the Egyptian characters in an Egyptian series, the shape of the characters has been developed with high quality and realistic proximity to the characters in the Egyptian series. Three stages have been developed, some of which contain reliance on intelligence, planning and speed of response to the surroundings that occur around you.<h3> first stage </h3> based on your rapid response to the sound so that you will not be disqualified if you violate it.<h3> the second stage </h3> <br/>is based on jumping on high-transparency glass in a vision It is almost non-existent, and the skill of vision and jumping must be available in abundance so as not to break the glass that you jumped on.<h3> the third stage </h3>  depends on intelligence, planning and speed of response to what surrounds you around you, this stage was made to jump on anything high so that you can escape from your opponent in the game Don't stay on the floor it will disqualify you from the game, you should rush to go for something else high so that you can win by the end of the given period.<h3>control method:</h3>To move, use the keyboard (WASD) and mouse to move the camera <br/>To sit use ( Ctrl Right &amp; Ctrl left )<br/>To jump use ( Space bar )<br/>To slow down the world use ( key R )<h3>Note 1</h3><br/>to show the control recognition menu, you must enter any stage you want and press the (Esc) button until the Interface appears, showing the required control to play.<h3>Note 2</h3>We will continue to update the game so that more players can enjoy it.", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2022-09-30T06:21:03", "background_image": "https://media.rawg.io/media/screenshots/828/828399e267385890e47d244f0c4b41cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["twins_creators_studio"], "genres": ["Action", "Adventure", "Simulation"], "publishers": ["twins_creators_studio"], "esrb_rating": null}