{"id": 857728, "slug": "noclipped-2", "name": "Noclipped", "name_original": "Noclipped", "description": "Current chapter: Chapter 1 \"The Main Nine\"<h3>Welcome to Noclipped!</h3>Noclipped is an open-world survival-horror adventure game, set in the <strong>Backrooms</strong>. In this game, you play the role of Fred - an average guy who accidentally No-clipped out of reality into the Backrooms. You must explore levels, gather resources, craft weapons, and gear, fight off or flee from dangerous entities, and much more! This game has no limitations on how far away you explore each level, providing multiple infinite worlds for you to explore. Be cautious, because if you hear something wandering nearby, I'm sure it has already heard you.<h3>Features:</h3><ul><li> Endless exploration - Wander through the millions of rooms and hallways.<br/></li><li> Infinite and unique levels - Experience infinity at its most, while exploring 9 unique levels and getting deeper and deeper with every step.<br/></li><li> Crafting and Survival mechanics - Monitor your hunger and thirst, as surviving inside the Backrooms is a hard challenge alone, especially when you're not alone.<br/></li><li> Liminal spaces - One of the most iconic liminal spaces, as well as new and fresh ones made just for you to explore.<br/></li><li> Story - Dive deep into the backstories of all of the people who No-clipped here just like you.<br/></li><li> Easter eggs - Find secrets hidden all around the endless halls of the Backrooms, some of which you may recognize yourself<br/></li><li> Sanity system - Being in the Backrooms is a stressful experience for many. Try to keep yourself sane and keep going.<br/></li><li> Backrooms Sense - The unique nature of the Backrooms gave you a sixth sense - use it to your advantage<br/></li><li> Much more</li></ul><br/><strong>Be warned:</strong> This game contains mild swearing that can be turned off in the settings menu.", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2022-09-30T05:33:17", "background_image": "https://media.rawg.io/media/screenshots/27f/27fe0816ba0d1226b4174431a1311d33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 17, "ratings_count": 0, "suggestions_count": 112, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MateussDev"], "genres": ["Adventure", "Indie"], "publishers": ["MateussDev"], "esrb_rating": null}