{"id": 857702, "slug": "xplorasi3d-20", "name": "XPLORASI3D 2.0", "name_original": "XPLORASI3D 2.0", "description": "XPLORASI3D 2.0 is a Digital Game-based Learning (DGBL) recommended for teachers and students to teach/learn about science. The player collects coins to get Score points and Blue Cube to earn Knowledge points and trigger Learning Information in the form of infographics and slide animations. At the end of the game (level), the player collects Red Cube and then triggers to Quiz Section. <br/><br/>Students can learn about:<br/>- Biodiversity <br/>- Ecosystem<br/>- Nutrition<br/>- Human Health<br/>- Water and solution<br/><br/>LESSON PLAN (SUGGESTION)<br/><br/>During Class Lesson<br/>The teacher can use the XPLORASI3D 2.0  in the class as an interactive activity with students. The students can use joystick during the lesson in the class. The teacher can prepare suitable activities together with students.<br/><br/>DETAILS<br/><br/>XPLORASI3D 2.0 consists of 5 Levels of the games, which can be selected from the Main Menu. When the player completes the level, the next level is unlocked. The player also can go to the quiz section using QUIZ MENU separately.<br/><br/><br/><br/>The player moves to collect Coins and Cubes. The player plays to collect Coins to get Score points.<br/><br/><br/><br/>Collect Blue Cube triggers to learning information (Knowledge).<br/><br/><br/><br/>At the end of the game, the player collects Red Cube to Unlocked Next Level and go to Quiz Section.<br/><br/><br/><br/>Quiz Section consists of questions related to the learning contents.<br/><br/><br/><br/>The overall scores and points will be displayed on the scoreboard once you have completed answering the quizzes. Hit Retry to repeat the questions.<br/><br/><br/><br/>Manual is provided for reference. (See: View the manual).", "metacritic": null, "released": "2022-09-27", "tba": false, "updated": "2022-09-30T04:58:57", "background_image": "https://media.rawg.io/media/screenshots/669/669efd095552bc930664090b2e266637.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SYAHIR BAHIRAN BIN HILMI"], "genres": ["Adventure"], "publishers": ["MULTIPDPKIT"], "esrb_rating": null}