{"id": 85781, "slug": "wonky-ship-msports-edition", "name": "Wonky Ship - msports Edition!", "name_original": "Wonky Ship - msports Edition!", "description": "Resisting the black hole is futile, but now you have choices beyond the worst ship ever.<br/><br/>[Surgeon General's Warning]<br/>This game is NOT recommended for the faint of heart. Playing may cause cold sweats, rage blisters, Crushphone Syndrome, screech-face, intense euphoria, and well, straight up wonkiness.<br/><br/>So whats this all about?<br/>You're a daring intergalactic pilot, desperately trying to outmaneuver the ravenous pull of a plasma-fueled black hole. You'll weave, dodge, cuss, flip out, and roll around like you've never done in a video game before. And then you'll die. Often.<br/><br/>Like all the time. <br/><br/>Hope you enjoy disintegration!<br/><br/>Please note: Kiz Studios will not compensate you for any phone or tablet crushed in a fit of rage while playing Wonky Ship. <br/><br/>We already broke all of ours. <br/> <br/>What our fans are saying:<br/>\"This is the final frontier. The most intense experience I've had standing up.\" —Capt. K<br/>\"Wonky Ship really blew my mind—and I've blown up fully armed and operational battle stations.\" —Luke S. <br/>\"Roarghejhwharrrrrr.\" —Chew B. <br/>\"And I thought dance-offs were the hardest challenge in space.\" —Star-Prince. Or was it Space Lord?<br/>\"I told our programmers, ‘Make a hard game.' Not like this. Not like this.\" —S. Johnson, Kiz Studios<br/><br/>From the deeply twisted minds who brought you Halos and Might &amp; Mayhem, prepare to experience one of the most intense, addictive, and challenging arcade games ever created. Invite your friends to play using Facebook Connect and engage in our Multiplayer Madness mode. Joust, ram, and outsmart your fellow pilots to see who gets vaporized first.<br/><br/>In space, no one can hear you throw your phone against a wall.<br/><br/>Highlights:<br/>• FREE to download!<br/><br/>• INSANE CHALLENGE – Outmaneuver a vicious, plasma-fueled black hole for as long as you can. Easy right?!<br/><br/>• HIGH VELOCITY FUN – Jump in and play instantly. A game with NO learning curve or respect for your safety.<br/><br/>• BEST YOUR FRIENDS – Earn points to score big and dominate the global leaderboard. Just stay alive!<br/><br/>• DEMOLISH YOUR FOES – Invite up to two additional friends in Multiplayer Mode. Who can you force into the black hole first? Welcome to the ultimate way to lose friends at the speed of light.<br/> <br/>PLEASE NOTE: Wonky Ship is a completely free-to-download arcade “survival” game. Have technical questions or suggestions? Whether you love it or hate it, our team would LOVE to hear from you! You can reach us at gamesupport@kizstudios.com.<br/><br/>Become a fan of Kiz Studios and follow us for all the latest news:<br/><br/>Visit us at: http://www.kizstudios.com<br/><br/>Follow us on: twitter.com/KizStudios<br/><br/>Like us on: facebook.com/KizStudios<br/><br/>Watch us at: youtube.com/KizStudios<br/><br/>Important Message for Parents<br/><br/>This game may include:<br/><br/>- Live links to social networking websites that are intended for an audience over the age of 13.<br/><br/>- Live links to the Internet that can take players away from the game with the potential to browse any web page.<br/><br/>- Advertising of Kiz Studios products as well as products from select partners.<br/><br/>- For optional in-game purchases, the bill payer should always be consulted beforehand.", "metacritic": null, "released": "2017-11-07", "tba": false, "updated": "2019-10-22T14:21:29", "background_image": "https://media.rawg.io/media/screenshots/b3a/b3a9e79df3f001741e1b032cacb1d710.jpg", "website": "http://wonkyship.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kiz Studios"], "genres": ["Action", "Arcade"], "publishers": ["Kiz Toys"], "esrb_rating": "Everyone 10+"}