{"id": 857900, "slug": "heliom", "name": "Heliom", "name_original": "Heliom", "description": "<p>As a good elvish subject, you must reclaim four tomes of black magic in a 20 level deep dungeon. Unfortunately, your liege used these tomes generously, leading to very foreseeable problems you will encounter.</p>\n<p>This turn-based game has 127 items, 50 types of enemies, and 48 abilities. You can play as a heavy armored warrior, an elegant crit-based glass canon, a magic user, an archer, a sneaker, an assassin or a mixture of those - there are no classes, only skill-values and abilities. Abilities comprise fear inducing arrows, bane of orcs, mind trick (\"you are not in combat anymore\") or zone-of-control-free-attacks amongst other things. Based on the position - no walls around to being in a corridor - weapons may grant bonuses or sneaking will be easier. Based on actions like moving or standing still, additional bonuses are granted making this a tactical rpg.<br/></p>\n<p>Playing time is around 5 hours for reaching the bottom level of the citadel, but learning the game will take some hours, too. This game is played on a central server so an <strong>internet connection is required.</strong> There is a Windows 10 and a Linux client available. This roguelike is inspired by Sil, Crawl, Brogue, and Tggw.</p>\n<p>Heliom is considered to be in beta-state and has undergone some months of spare-time play-testing so far. Multiplayer is definitely planned for in the future, and some magic spells will be reworked in the near future. The main character must be changed, too. The final game sequence isn't finished yet. <br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-09-30T07:34:14", "background_image": "https://media.rawg.io/media/screenshots/b21/b213310e3bc3e10973c0de2679b2177c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["dasmuli"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}