{"id": 858077, "slug": "enoch-children-of-fate-demo", "name": "Enoch: Children of Fate - Demo", "name_original": "Enoch: Children of Fate - Demo", "description": "<p>Enoch : Children of fate is a point&amp;click adventure game inspired by the genre classics.<br/></p>\r\nDiscover an engaging background\r\n<p>Enoch : Children of fate is a point&amp;click adventure game set in the year 2179. 100 years ago a catastrophic event forced the station managers to use the newly discovered FTL engine to flee from the solar system with the station Enoch and its inhabitants.<br/><br/>Since then they jump from one system to another, fleeing an unknown danger, living as parasites taking the ressource they need to survive in every system they visit.<br/></p>\r\nBe witness to a boiling social conflict between classes aboard the station\r\n<p>Aboard Enoch, the vast majority of the population lives in abject poverty in Cylinder B while a wealthy minority live in an agricultural paradise in cylinder A.<br/><br/><br/></p>\r\nGorgeous graphism\r\n<p>The world of Enoch is depicted in detail with beautiful pixel art.<br/><br/><br/></p>\r\nPlay multiple playable characters each with their own objectives.\r\n<p>In Enoch : Children of fate you take control of six differents characters.</p>\n<ul><li>Arten Long, a sarcastic criminal investigator struggling with her addictions and her traumatic past.<br/><br/>\n</li><li>John Nakanaga, A criminal investigator with the heart of a boy scout.<br/><br/>\n</li><li>Marcus Lavergne, The main murder suspect, head of the Lavergne familly. This wealthy man truly believe in a more equitable society for everyone in Enoch.<br/><br/>\n</li><li>Trent Lavergne, Marcus' brother and an officer in Cylinder A Milicia. He loves his brother but see him as weak.<br/><br/>\n</li><li>Alice Kardan, one of the missing teenagers. She tries to escape the strange environement where she woke up.<br/><br/>\n</li><li>Swan : Real n#^e : A*~@}&amp;&amp; ]&amp;@-|# A c#ld bl@&amp;d\"d K\\ll*r. [DATA UNAVAILABLE] [CORRUPTED FILE]\r\n</li></ul>\r\nLive interrelated and overlapping storylines\r\n<p>Enoch : Children of fate use nonlinear narative, the story is told in out of chronological order (Think Pulp Fiction)<br/><br/>Every chapters you learn more about the plot, the characters and their past.<br/><br/>As the characters struggles to unravel their own mysteries, greater events are set in motion on Enoch.<br/></p>\r\nFully voiced\r\n<p>The game is fully voiced by professional voice actors.</p>", "metacritic": null, "released": "2022-09-29", "tba": false, "updated": "2022-09-30T08:59:05", "background_image": "https://media.rawg.io/media/screenshots/efe/efe8f465d47494ce466a722af12f5b0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Enoch : Children of Fate"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}