{"id": 858019, "slug": "girlfriend-simulator", "name": "Girlfriend Simulator", "name_original": "Girlfriend Simulator", "description": "<p><strong>Content warning<br/></strong>This VN touches on subjects some readers might find upsetting, such as: depression, brief mentions of attempted suicide, asphyxiation, violence, and some bloody imagery. It also contains scenes with animated static and flickering lights. Reader discertion is advised. <br/><br/><strong>Story<br/></strong>You wake up with a pounding headache in a room that looks like your own, but doesn't feel quite right. By your bedside is a cute girl who introduces herself as Nagi, your adorable, doting girlfriend. Nagi informs you that you're very sick, but don't worry: she's going to do her very best to take care of you!<br/><br/>That would be all well and good, but...<br/><br/>If Nagi really<em> is</em> your girlfriend, why can't you remember her?<br/><br/><strong>Features<br/></strong>- 23k words of text (approx 40-90 mins of reading)<br/>- Multiple endings<br/>- An unease meter which impacts the story<br/>- A retro PC-98 aesthetic<br/>- English and German text supported<br/>- A very cute girlfriend who would absolutely never hurt you!!!*<br/><br/>* citation needed<br/><br/><strong>Credits</strong><br/>Writing and coding: ebi-hime<br/>Image editing, music, and additional coding: Sleepy Agents<br/>Character art: Kalopsia<br/>Border: Glub<br/>Backgrounds: Various creative commons resources found on Flickr<br/>Video: Dar Golan<br/>German translation: Saryana<br/><br/>Made for the 2022 Spooktober VN Jam<br/>Inspired by Yumemi Melancholy by CHARON<br/><br/>I also have a discord server dedicated to my VNs, so feel free to join if you want! <strong>♥</strong></p>", "metacritic": null, "released": "2022-09-29", "tba": false, "updated": "2022-09-30T08:26:14", "background_image": "https://media.rawg.io/media/screenshots/2b4/2b48da2f2d6eba448aa9bda2a08dba87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 172, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ebi-hime"], "genres": [], "publishers": [], "esrb_rating": null}