{"id": 858264, "slug": "virtuapets-cubie", "name": "VirtuaPets: Cubie", "name_original": "VirtuaPets: Cubie", "description": "<p>VirtuaPets™ are digital creatures you can install onto your desktop computer. They will watch you as you use your computer and you can level them up by keeping them happy!</p>\n<p>Cubie is our first VirtuaPet and we are very proud to bring him to you!</p>\n<p>Think of Cubie as a living breathing animal running entirely digital! You can interact with your Cubie by performing tasks that result in your Cubie leveling up. Each level unlocks a new Cubie body allowing you to customize your Cubie to your exact liking! </p>\r\nHow much does Cubie cost?\r\n<p>+ Cubie is entirely free and has absolutely no option of purchasing anything! We wanted to provide this digital friend to everyone to enjoy at no cost!</p>\r\nHow do I play Cubie?\r\n<p>+ All you need to do is install Cubie and he will be there! There is no configuration, once you have installed Cubie you will playing immediately!</p>\r\nWhat do I do if my Cubie is Angry or Sad?\r\n<p>+ All you need to do is Double-Click your Cubie! That simple act is all your Cubie needs</p>\r\nHow can I change my Cubie's body color?\r\n<p>+ Once you have unlocked other body skins you need to hold long press left click</p>\r\nHow can I check my Cubie's body skin count?\r\n<p>+ Hold right click to check your skin count</p>\r\nHow can I check my Cubie's level?\r\n<p>+ Just hold right-click on your cubie!</p>\r\nHow many levels does Cubie have?\r\n<p>+ Cubie has up to level 999</p>\r\nHow many background skins does Cubie have?\r\n<p>+ Cubie comes with 100 skins</p>\r\nDoes Cubie Have Cheat Codes?\r\n<p>+ Yes! For Cheat Codes join the community discord!</p>", "metacritic": null, "released": "2022-09-28", "tba": false, "updated": "2022-09-30T10:13:16", "background_image": "https://media.rawg.io/media/screenshots/545/54571ccc79dbf6690e94971f6db2d6e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Coleeto Games"], "genres": [], "publishers": [], "esrb_rating": null}