{"id": 858285, "slug": "bread-crumb-idle", "name": "Bread Crumb Idle", "name_original": "Bread Crumb Idle", "description": "Bread Crumb Idle\r\n<p><em>duck eat bread, duck make bread</em></p>\n<p>Background created by ansimuz. go check em out.<br/></p>\r\nHow To Play\r\n<p>Welcome to bread crumb idle! To get started, click on your only yellow duck several times. This will speed up the bread production for that duck. To check how much bread you have, click the first tab at the top (or space bar) to toggle the inventory. Once you have enough bread, head on over to the duck market! Click the third tab at the top and buy some new ducks. Continue to feed and level up all your ducks. You can speed up your ducks even more by selecting bread from your inventory and clicking on any duck. Each bread type gives different bonuses to ducks, from extra levels to cook time reductions. White bread gives cook time reduction, it's up to you to figure out the rest! Once your duck reaches max level it will get a lime green outline. Clicking a max level duck with an empty hand will tier it up once. Each tier of duck will produce bread respective to that tier. All duck tiers, except tier one, will consume bread of the previous tier. <strong>Every time a duck reaches a new tier, science bread is produced.</strong> Science bread can be used in research, the fourth tab, to change certain aspects of the game. Collect all the breads and achievements to become the ultimate duck master! Good luck!</p>\r\nScience Bread Tips\r\n<p>Science bread and research are a main part of the game. However, obtaining science bread can be quite slow early game. Here are some steps to getting science bread more reliably:<br/>\n</p>\n<ul>\n<li>Research: Reading The Manual</li>\n<li>Tier Up 25 ducks</li>\n<li>Research: Rare Bread</li>\n<li>Tier Up 60 ducks</li>\n<li>Research: Rare Science</li>\n</ul>\n<p>These steps are a good path to getting more science bread. You should have around 100 ducks after following these steps. Alternatively, science bread can be obtained through the Maximum Science research:</p>\n<ul>\n<li>Research: Reading The Manual</li>\n<li>Tier Up 25 ducks</li>\n<li>Research: Maximum Bread</li>\n<li>Tier Up 60 ducks</li>\n<li>Research: Maximum Science</li>\n</ul>\n<p>Both are reliable ways, but it's recommended that you start with the Rare Bread research. Rare bread helps early game. Ultimately, researching both trees will give you the best chance for science bread.</p>", "metacritic": null, "released": "2022-09-28", "tba": false, "updated": "2022-09-30T10:22:53", "background_image": "https://media.rawg.io/media/screenshots/0ff/0ffc2221772acbb3b57bddc873dbcbed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Wiji", "TysonCandles"], "genres": [], "publishers": [], "esrb_rating": null}