{"id": 858272, "slug": "spiritedaway-frogger", "name": "SpiritedAway Frogger", "name_original": "SpiritedAway Frogger", "description": "<p>Toujours dans les classiques des jeux d'arcade, le Frogger !</p>\n<p>Ce jeu est issu d'une formation de Game Developper.\r\n</p>\n<p>Le design ainsi que l'animation des sprites ont été réalisé  en pixel art par mes soins sur le logiciel en ligne Piskel.\r\n</p>\n<p>J'ai personnalisé le jeu d'un univers originel de grenouilles ? - en un petit rappel du Voyage de Chihiro, un classique dans le monde des Anime, réalisé par le Studio Ghibli !</p>\n<p>Si vous connaissez Spirited Away ( Le voyage de Chihiro), j'espère que vous reconnaitrez la scène de Lin qui acceptes de prendre Chihiro sous son aile ! Avec les irrésistibles petites noireaudes qui courent partout avec leur bonbon en mains dans la salle des machines.</p>\n<p> - vous avez surement déjà joué à un Frogger dans votre jeunesse, ici le but du jeu reste le même à la différence que vous n'êtes pas une grenouille sur le point d'être écrasée par une voiture. Traversez le chemin, rejoignez Lin,  en évitant, vous, d'écraser les pauvres petites noireaudes, </p>\n<p>- Comme toujours, les touches fléchées pour déplacer Chihiro. Attention, vous ne pouvez pas vous déplacer tant qu'elle n'a pas fini son déplacement précédent. Calculez bien votre coup si vous essayez de passer rapidement entre deux noireaudes !</p>\n<p> - Tout fonctionne comme si vous vous déplaciez dans des cases, donc n'avancez pas trop vites après le passage d'une noireaude, vous pourriez vous prendre le coin de son image.</p>\n<p>- Si vous écrasez une noireaude, vous verrez l'horreur devant vos yeux, c'est devenue de la purée. Le jeu se freeze, il n'y a pas d'écran de fin.</p>\n<p>- Si vous réussissez, les noireaudes continueront à marcher et une mouche/oiseau qui porte une souris apparaitront ( Ceux qui connaissent sauront qui ils sont) et défileront tel un ScreenSaver sur l'écran du jeu. Il n'y a pas d'écran de fin.</p>\n<p>Bon jeu !\r\n</p>", "metacritic": null, "released": "2022-09-28", "tba": false, "updated": "2022-09-30T10:17:17", "background_image": "https://media.rawg.io/media/screenshots/f9d/f9dd3a43f3ec521ff57ed2945afbef6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Tylia"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}