{"id": 858543, "slug": "asteroids-unity-retro-game-with-admob-ads", "name": "Asteroids - Unity Retro Game With AdMob ads", "name_original": "Asteroids - Unity Retro Game With AdMob ads", "description": "<p>This is a complete game template.</p>\n<p>Controls on PC and WebGL are W,A,D or arrow keys for thrust and rotation, space key for shooting.\r\n</p>\n<p>On Android and iOS spacecraft is controlled by on-screen controls.\r\n</p>\n<p>Test it here (WebGL)\r\n</p>\n<p>Or download the test apk file and test it on your android device.\r\n</p>\n<p>AdMob ads are implemented into this projects. To setup the ads follow these steps:\r\n</p>\n<ul><li>Go to Assets - &gt; Google Mobile Ads -&gt; Settings and put your app id (from your AdMob console) there.\r\n</li><li>Open the script \"Menus.cs\" and put your interstitial ad id on line 49 for android and on line 51 for iOS.\r\n</li></ul>\n<p>\n</p>\n<p>Main goal of the asteroids game is to destroy asteroids and saucers. The player is in command of a triangular spacecraft that may rotate left and right, shoot straight forward, and thrust forward. Once the ship starts traveling in one way, it will continue in that route indefinitely unless the player adds thrust in a different direction. When not thrusting, the ship finally comes to a halt.is to destroy asteroids and saucers. The player is in command of a triangular spacecraft that may rotate left and right, shoot straight forward, and shove forward. Once the ship starts traveling in one way, it will continue in that route indefinitely unless the player adds thrust in a different direction. When not thrusting, the ship finally comes to a halt.<br/>\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-09-28", "tba": false, "updated": "2022-09-30T12:13:53", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fa84c9890f893837187f4fcb4c882bf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NeonSpaceFighter"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}