{"id": 858535, "slug": "parfum-nostalgique-demo", "name": "Parfum Nostalgique DEMO", "name_original": "Parfum Nostalgique DEMO", "description": "<p><em>Parfum Nostalgique is a kinetic visual novel that details a small but eventful window of time in the life of 265 year old vampire. A therapist by day and a dom by night, Valdemar Andressen is a true eccentric, whose sustained sanity can be attributed to his comfortable city lifestyle and constant drunkenness on the feelings of humans around him. </em></p>\n<p><em>A story of friendship, tragedy, and unconditional love that explores the conflict between moral personhood and the human necessity of wearing different masks, Parfum Nostalgique is a coming of age for those who have already come of age, or what some would call a “midlife crisis,” told from the point of view of an immortal man who hasn’t stopped living like a single man in his 30s for over 2 centuries. </em></p>\n<p>Coming Winter-Spring 2023.</p>\n\n<p>___</p>\n<p>THIS IS A DEMO.<br/></p>\n<p>Though this is but one tiny petal of the gorgeous josei drama-filled rose that will be the final Parfum Nostalgique story, it is dense with all of my original art, music, and dialogue. Apart from a small advisory and editing team, Parfum Nostalgique is entirely developed by one person. Please consider supporting my work on Patreon if you like what you see, we have the coolest perks around.</p>\n<p>If you're reading this, thank you for being a part of my journey, especially if you are a Patreon patron, one of the voice actors that will be featured in the final game, or anyone who has thrown even a crumb of help or feedback my way. </p>\n<p>For more information and updates, be sure to follow PriRoPro on Twitter and check out the official site.</p>", "metacritic": null, "released": "2022-09-28", "tba": false, "updated": "2022-09-30T12:09:35", "background_image": "https://media.rawg.io/media/screenshots/d50/d5048e614b05bbbacd7276a1a866dd41.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["PriRo-Pro"], "genres": [], "publishers": [], "esrb_rating": null}