{"id": 858641, "slug": "petomec-g1-a-baby-in-a-huge-world", "name": "🥚 Petomec (G1) - A Baby in a Huge World!", "name_original": "🥚 Petomec (G1) - A Baby in a Huge World!", "description": "<p>Pet's Website: https://qkey-studio.ga/petomec </p>\n<p>Virtual Pet for Windows. Tamagotchi clone for PC. A new trend in the market. For all ages! Petomec (G1 Edition) is a Baby in a Huge World. A simulator of the life of the surrounding Pet world for a desktop PC. A pet is so small, so defenseless, who should get a chance at a good life... and you can give him that chance after all... everyone is responsible for all living things on Earth, including a tiny Pet. ;) Our whole life is a game, and we play it, who keep score of the game. The player's task in this Game is to observe and fully participate in his maintenance in life - to feed, cook at school, rejoice with him with new achievements in life. The player has the opportunity to choose the Type and Name of the Pet, which will eventually be born in the white world. It will be a boy or a Girl, what Pet preferences will be in life, what will be your favorite food or activity... no one knows, but you will know your Pet better than anyone. The content of the Pet's life goes as follows: The pet can earn Pets (Pitas), which are the game currency. For money, you can buy food in the store (if the refrigerator is empty), appliances and so on.</p>\n<p>Remember, at least the first 3 years of the Pet must be fed only with baby food - these are cereals, milk mixtures and so on. After the Pet turns 3 years old, he may prefer to eat junk food from children's food, but only if he is ready to give up his diet. In the current Version of the Game there are 3 stages of growing up of a Pet, namely: Child (0-12), Adult (12-45), Elderly (45-99), plans for the implementation of 6 months of growing up: Infant (0-3), Child (3-12), Teenager (12-20), Adult (20-45), Adult-Pre-adult (45-80), Elderly (80-99), wait for updates (Active work on the Game is carried out in the daily protocol). <br/></p>\n<p>In order to become a part of the Pet's World, a task is required to download the Program (To launch the Program, the installation of the Direct Play package can be assigned — Windows 10 requests an invitation automatically, after installation, the system can request a restart of the PC). After launching the Program, you will be offered a Trial Period of the Game. After the Trial Period of choosing a Pet Passport, in which you found the Product Code, this Code requires the presence and indication on the website to obtain the Activation Key of the game, simply or you can choose \"Get the Key\", after which it is enough to simply select the Key and pay for the purchase, after which you will immediately receive the activation key of the Pet.Please note that the key to the game \"Petomec (G1)\" has no time limit, all keys will be valid permanently (if the launch of the game is possible in the near future). The prefix \"G1\" in the name of the Pet's generation Product, the key is purchased exclusively for a Program marked \"Petomec (G1)\" downloaded from the Pet's official website. It is also important to know that the more expensive Pet keys (only 3 keys) from the discovery of all the advantages of key production, the more profitable it is to purchase a more expensive key at once, this key activates the Game, Full Setup and Editor at once. The purchased key cannot be returned by the game developer in order to refund funds, because the key is not tied to the activation time and occurs throughout the entire time, it remains with you and is not subject to refund. </p>\n\n<p>Before buying a Key, it is recommended to familiarize yourself with the Trial Version of the Game - 15 minutes for a Trial Game. Remember that the Key is available only according to the data received, the Product Code was obtained with the files (the Program was launched with the files). In case of technical problems, our Support Team is always happy to help solve problems. Minimum System Requirements for the Game: Screen Resolution: 800x600 and above Operating System: Windows Vista and RAM: 2GB and above CPU: Intel Core 2 Duo and higher Disk Space: 100Mb and above, there are several types of keys in the game: PLAYERS MODE / Key #1 Game with limited Customization.</p>\n<p>In real time, there are requirements: Do not change the color of the case, Do not change the color of objects, Do not change the appearance of buttons, Do not change the speed of the game, There is no game Editor. FREEDOM MODE / Key #2 / Game with full access to all settings. There are Minor limitations in Freedom Mode: There is no Game Editor. GOD MODE / Key #3 / Unlimited Game + Game Editor. There are no restrictions in God Mode - The full version of the Game! Pay attention! To work with the Game Editor , the installed Aseprite Program is required . The keys to the Game \"Petomec (G1 Edition)\" have no time limit and are tied strictly to the devices with which the Product Code was received!The trial period of the game is 15 minutes, without the ability to access the Settings Program and the Game Editor.</p>", "metacritic": null, "released": "2022-09-27", "tba": false, "updated": "2022-09-30T12:59:09", "background_image": "https://media.rawg.io/media/screenshots/7da/7da7ce8fdb887e2af2eba85be4accaf4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["QKey-Studio"], "genres": ["Simulation", "Puzzle"], "publishers": [], "esrb_rating": null}