{"id": 858980, "slug": "hamorigami-gb", "name": "Hamorigami GB", "name_original": "Hamorigami GB", "description": "<p>Take control of Kodama in this short but challenging game on the original gameboy. Your job is to make sure your bonsai tree grows to it's full potential! Keep it in a healthy balance of sun and rain by shooing off and welcoming in the local weather spirits.</p>\n<p>This game was made as a submission to GBJam 10, with the theme of plant! This game is all about finding balance between the elements to grow your little plant into a great bonsai!</p>\n<p><strong>Controls:</strong></p>\n<p>A button: Fly</p>\n<p>B button: Swing your broom</p>\n<p>Left/Right: move Kodama left and right<br/></p>\n<p>Some tips for new players:</p>\n<p>- Always keep an eye on your bonsai's status bubble! A flame means it's too dry, and a wave means it's too wet. A smiley face means just right!<br/></p>\n<p>- Sun sprites will help dry up your tree when it's wet, while rain sprites will water your tree if it's too dry. Always try and keep a good balance, and experiment with keeping some of the lil critters around.</p>\n<p>- Once Kodama starts flying, he can fly for a bit before running out of energy, but you can keep him up in the air for a while if you tap the fly button!<br/></p>\n<p>- If there's no weather spirits around, the tree will start to lose water.</p>\n<p>- A happy tree (smiley status bubble) can recover a bit of it's health! So always try and aim for that sweet spot to ensure your preciouis bonsai can go the distance!</p>\n<p>- Know your <em>ma!</em> Make sure to get familiar with Kodama's broom swing striaght away! The timings, hitboxes etc. Swings are precious, so perfect timing can be crucial!<br/></p>\n<p>- Kodama can swing his broom, but not very quickly. He's only little, so make sure you time your swings right!<br/></p>\n<p>Credits:</p>\n<p>Hamorigami GB is a Nintendo Gameboy port of a project called Hamorigami. This game wouldn't exist without everyone who made that :)</p>\n<p>This time around its:<br/></p>\n<p>audio by k0stnix\r\n</p>\n<p>coding, graphics and animations by punchcafe  \r\n<br/></p>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T15:30:25", "background_image": "https://media.rawg.io/media/screenshots/d5b/d5be5267bc472d4d2696d51a2652683b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["punchcafe"], "genres": ["Action"], "publishers": [], "esrb_rating": null}