{"id": 858946, "slug": "vrex-virtual-paleontology", "name": "VRex - Virtual Paleontology", "name_original": "VRex - Virtual Paleontology", "description": "<p><strong>[THIS PAGE IS STILL UNDER CONSTRUCTION]<br/></strong><strong>[VIDEOS AND SCREENSHOTS ARE COMING SOON]</strong></p>\n<p>Get to know the basics of working as a paleontologist ... at home in Virtual Reality!</p>\n<p>Travel to an excavation site in North America, choose the right tools and dig for T-Rex bones and other fossils. In the lab, prepare the bones in a variety of ways, and display them in your customizable museum.</p>\n<p>This project was created by team of 8 students as part of their 2nd project for their VR/AR university studies, with a given timespan of 3.5 months. With the final phase of these studies rapidly approaching, the time allocated for further development of this application is currently relatively low, however a continuation of this project post-finals is in planning.</p>\n<p><strong>Featuring:</strong></p>\n<ul><li>full process of recovering a T-Rex skeleton, from initial excavation all the way to final exhibition - with each step along the way modeled \"as realistic as playable\"</li><li>variety of tools to use - from a simple shovel to a pneumatic graver</li><li>a magnifying glass and booklet which record additional information about the findings and T-Rex in general</li><li>a virtual Museum with multiple Rooms<ul><li>Entrance Area including in-world control instructions, settings and navigation</li><li>Main Exhibit Room featuring the colossal T-Rex Rig und multiple other exhibit spots - customizable to your liking</li><li>Fully furnished Labatory to prepare the excavated bones</li></ul></li></ul>\n<p><strong>So, what to do?</strong></p>\n<ul><li>Spawn in, get used to your surroundings and the controls explained via the posters infront of you</li><li>When ready, access the excavation site by pushing the flag on the globe</li><li>Once arrived, you can get to work - time to dig out the marked fossils using the provided shovel (for soft soil and sandstone layers) and pickaxe (for the harder stuff) - try working within the marked 1x1m areas</li><li>T-Rex Bones are encased within large dark rocks - crack their upper layer using the chisel alongside the pickhammer. But be careful not to damage the bone!</li><li>When fully uncovered, you must encase the bone in a safety layer of plaster sheets - these can be grabbed from the plaster box and placed on the marked areas</li><li>A drone will collect the fully encased rock since noone is around to help you carry it onto the truck ;)</li><li>Smaller fossils can be placed in the containers next to the pickup to transport them to the Lab</li><li>When ready, you can return to the Museum via the teleport marker next to the pickup driver's door</li></ul>\n<p><strong>Back in the Lab...</strong></p>\n<ul><li>First up, select one of the excavated fossils from the list next to the conveyor belt (ONLY one, as there currently is a bug that lets you spawn multiple bones at the same time - will be fixed ASAP. If you accidentally spawn more than one, go to the excavation site and return to the museum, you will find the bones back in the list)</li><li>Now it's time to un-do your work from the excavation site - make a horizontal cut with the stone saw around the plaster shell as well as two vertical ones  along the marked  lines (make sure to make use of the rotation buttons on the roundtable - they'll make the work much easier)</li><li>Now that the bone is no longer stuck inside the rock, you can take it over to the preparation table for the finer work - make sure not to drop it, or you may damage it!</li><li>Fixed in place and ready for further work - time to spin up the pneumatic graver and clear the bone from the remaining stone residue. Once again, make sure to utilize the rotation buttons to make your life easier. The screen will show your progression in the current step.</li><li>Stone residue removed? Time to brush off the remaining dust and dirt, followed by the application of a protective layer to the bone surface.</li><li>Almost done! Either make use of the crane trolley to transport the bone over to the exhibition area, or carefully carry it there - either way, it's time to place it in on the skeletal rig!</li><li>Can't reach the marked spot on the rig? Try enabling the scaffoldings via the tablet next to the entrance to the lab. They, aswell as the small ladder, can be freely moved around to your heart's content.</li><li>During any of these stages, use a magnifying glass to get information about the bone and the dinosaur it belongs to, which you can then find in your pocket notebook. You'll need the information to answer the questions in the final quiz to fill out the information plaque for the skeleton.</li></ul>\n<p><strong>Known Issues<br/></strong></p>\n<ul><li>Progress is saved automatically, but quite limited at the moment.<ul><li>Bones sent to the museum are saved, along with their damage state, as well as smaller fossils you found (though only up to four will spawn in the lab). However, the preparation status of individual bones is currently not saved, even when they are placed in the skeletal rig. Only the completed skeleton is saved, so you'd have to prepare all seven bones in one session and place them in the rig. To see the (almost) completed skeleton, push the red button with the label \"DEV\" on the wall next to the scaffolding tablet. This way you can also play the quiz.</li></ul><ul><li>Museum customization (small fossils in display cases and T-Rex position) is not saved</li></ul><ul><li>Likewise, the settings are currently not saved correctly</li></ul></li><li>The physics of some objects are a bit wonky, especially the pneumatic graver</li><li>Bones can become damaged during transport to the museum</li></ul>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T15:13:54", "background_image": "https://media.rawg.io/media/screenshots/56d/56d0684493c9c002fc47326c1a2f9faa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pavoex", "Reitax", "FeuerTiger86", "Leon Mack", "DevranCan", "Pollyvison"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}