{"id": 859036, "slug": "hal", "name": "HAL", "name_original": "HAL", "description": "<p><strong>HAL</strong></p>\n<p><strong>Hal </strong>is a 2D <strong>survival </strong>video game that relies heavily on <strong>crafting</strong>, <strong>chemistry </strong>and <strong>combat</strong>, both <strong>melee </strong>and <strong>ranged</strong>. After waking up in an abandoned city without almost no memories, Hal must discover what is happening and why he is there. He must face giant radioactive spiders, weird thugs wearing masks, acid-spitting plants and many other creatures that lurk everywhere. During his quest to find the truth, he will learn how to craft increasingly complex weapons and tools in order to survive. His choices will define how the game will end, making every step of the path of pivotal role.<br/></p>\n<p>Use corrupted seeds to grow plants, combine items to obtain original weapons, explore hundreds of enterable buildings, increase your skills, acquire special powers, craft grenades and solve the mysteries of the City.</p>\n<p>TL;DR: Fallout meets Darkwood meets Lone Survivor.</p>\n<p><strong>PRESS KIT</strong></p>\n<p><strong>Contact </strong>halgamedevelopment@gmail.com; <strong>Studio</strong>\r\nBeargame Productions; <strong>Team size</strong>\r\n2; <strong>Genre</strong>\r\n2D Survival; <strong>Platforms</strong>\r\nPC, Mac OS, Switch, PS, XB; <strong>Release date</strong>\r\nNot yet available; <strong>Price</strong>\r\nNot yet available; <strong>Languages</strong>\r\nItalian, English; <strong>Game distribution</strong>\r\nDigital.</p>\n<p><strong>DEVELOPMENT</strong></p>\n<p>This game was presented at Milan Games Week 2018 in its previous form. We are currently working on a new demo with several gameplay and graphical changes. If you'd like to see the game finished, please consider supporting us with a small donation. <strong>You can download a small tech demo to get an idea of the final product</strong>. </p>\n<p>Thanks!</p>\n<p>Beware: The demo has the sole purpose of illustrating how the final product may end up being. Many graphical elements are placeholders and there may be some gameplay issues.<br/></p>\n<p>For example, here is the version of the protagonist we are currently working on:</p>\n\n<p><strong>Paranormal monster (Akumu):</strong></p><p><strong>THE TEAM</strong><br/></p>\n<p>We are an independent video game studio. We love video games and we've loved them since we were kids. Our team currently consists of a programmer, a graphic designer, and a musician. Our adventure began when Federico Bonetti and Andrea Mazzocchi, the two founders, met on a social network and joined forces to create the first draft of what would then become Hal. Andrea is in charge of the graphic design and Federico of the programming. The soundtrack is provided by Luca Marconcini, who joined the team at a later stage. <br/></p>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T15:57:23", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f88d194c3f44772a4489fc587e9c447.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["yourbedtimestory"], "genres": [], "publishers": [], "esrb_rating": null}