{"id": 859069, "slug": "the-mystic-world-of-ratarot", "name": "The mystic world of Ratarot", "name_original": "The mystic world of Ratarot", "description": "<p>Fellow humans be welcomed to <strong>Madam Claire Voyant's shop</strong>! Where things are not what they seem and at the same time they are. And where you can find out the ins and outs of the mystical world of Ratarot.</p>\n<p><strong>What does she do? </strong>Someone says that she just throws cards, others are afraid of her, because even though the future is said in an uncertain way, it is always right.</p>\n\n<p>Of course, she works in a special way... she connects with the universe using what she calls \"the mystical number\", which others call the magic number. And you will wonder what that number is... that special number is 100.</p>\n<p>It is a number composed of two zeros that symbolize the Universal energy, and a one that symbolizes the creation of reality, so you know it has doble univers energy.</p>\n<p>Do you dare to discover what your destiny will hold for you?</p>\n\n\n\n<p><strong>🔮HOW TO PLAY?🔮</strong></p>\n<p>This is a point-and-click game, so we are going to use the left button of the mouse to play.</p>\n<p>\n</p>\n<p>Each card has its own number, as you can see in the image below:</p>\n\n<p><strong>What do you have to do?</strong> Memorize and choose your cards to reach the mystical number (100) in case you want to know your destiny.<br/></p>\n\n<p>Madam Claire Voyant's  cards are unique as she is, because as the rest of the world thinks green is good and pink is bad, she sees it upside down. In other words,  cards with a positive fate and value are pink, because this colour simbolize hope and optimism ; the other ones, which are green and the image is upside down, simbolize stagnation and lack of strength.</p>\n\n<p>Finally, talk to Claire and she will help you discover your destiny.</p>\n\n\n<p>We recommend use the .exe version for a full experience<strong>🔮</strong></p>\n<p><strong>This project was created for the Indie Spain Jam<br/></strong></p>\n<p><strong>Credits:</strong></p>\n<ul><li>2D Artist: Dre</li><li>Game Designer:  Nemesis &amp; Eric</li><li>Music: Milo Giraldo\r\n</li><li>Programmer: Sebas\r\n</li></ul>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T16:13:18", "background_image": "https://media.rawg.io/media/screenshots/7f2/7f2cc4c7919c39576d538c846e03bac6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Blue Joe", "Milo Giraldo", "Dre Otero", "Nemesis De Nix", "Eric Tardà"], "genres": [], "publishers": [], "esrb_rating": null}