{"id": 859188, "slug": "animal-wars-animal-wars-team", "name": "Animal Wars (Animal Wars Team)", "name_original": "Animal Wars (Animal Wars Team)", "description": "<p>Animal Wars is a 2.5D arcade shooter video game for mobile devices that follows the adventures of Dog Smith, a humanoid dog that crosses the galaxy with his mates.<br/></p>\n<p>In a parallel universe to the current one, animals have evolved to the point of obtaining human form and far superior knowledge and technology. Intergalactic travel is a reality and any of these animals can have a spaceship and with it fly to different planets that make up their universe.</p>\n<p>To preserve this universe from any threat in Aria, the capital and center of this universe, an interstellar security council is created that is in charge of preserving the galaxy from any evil that may arise, this council tried to gather the best pilots on the planet.</p>\n<p>Four pilots excelled above the rest of the Army Dog Smith, Cat Stark, Rizo Nardi and Hawk Corbirock. As soon as they met, they became friends and a few years after joining the army, they left their ranks to form their own team.</p>\n<p>Dive in and enjoy the adventures of this fabulous team throughout the galaxy.</p>\n<p>Characteristics:</p>\n<p>- 3D graphics that unleash the full potential of your mobile phone, while maintaining the most classic arcade style.</p>\n<p>- Very simple and intuitive control.</p>\n<p>- Progress saving system throughout the video game. You can stop and resume the mission whenever you want.</p>\n<p>- Unlockable secrets as you progress through the video game.</p>\n<p>- Charismatic characters that make you feel part of their team. With this video game you will never be alone!</p>\n<p>- Video game fully translated in English and Spanish.</p>\n<p>Fan page: https://www.facebook.com/AnimalWarsSaga</p>\n<p>Help the Dog Smith team and their friends survive all the dangers of the galaxy and remember: Stay Alert Guys!</p>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T17:11:10", "background_image": "https://media.rawg.io/media/screenshots/12e/12e2504b3056ddddac38bc7834c0e241.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Animal Wars Team"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}