{"id": 859227, "slug": "transporte-sideral", "name": "Transporte Sideral", "name_original": "Transporte Sideral", "description": "<p>Haz un transporte sideral , recupera la distancia de 0 a 100, antes de que pasen 100 segundos.</p>\n<p><strong>Pausa: \"Esc\"</strong>   pulsa para salir del juego en la pantalla de título o para pausar la partida.</p>\n<p><strong>Cargar arma :      \"Z\"</strong> para disparar suelta  el botón una vez cargada el arma al 100  y antes de sobrecalentarla , si no perderás una vida.</p>\n<p><strong>Salto hyper-espacial :  \"X\" </strong> usa esta tecla cuando tengas lleno el depósito de materia oscura para avanzar a la velocidad de la luz siendo invencible.</p>\n<p><strong>Desplazamiento \"cursores\": </strong>da impulsos a la nave para navegar por el espacio a 100 Gm/h , ten en cuenta que cada vez que aceleras consumes energía, si la energía llega a 0 pierdes una vida, intercepta los orbes azules para llenar los depósitos de energía.</p>\n<p>También puedes usar un     <strong>\"Gamepad\" </strong>.<br/></p>\n<p>¡¡¡Aprovecha la inercia para ahorrar energía!!!</p>\n<p>Esta nave carguero tiene un arma simple, con el botón de disparo  recarga el arma , cuando la recarga llega a 100 debe soltar el botón para disparar, pero ve con cuidado, si mantienes pulsado con la recarga al 100 y se sobrecalienta el arma , la nave explota y pierdes una vida. </p>\n<p>También dispones de una tecnología alienígena de energía oscura, si capturas dos orbes podrás con la tecla \"X\" hacer un salto hiperespacial, donde avanzarás siendo invencible durante el salto.</p>\n<p>Puedes elegir tres tipos de carga , fácil, medio y difícil, con el fácil recibe menos puntos, con el medio recibe más puntos pero el tiempo de aceleración y la energía se ven perjudicados al 25%, y ya no hablemos del modo difícil, con mayor carga mas puntos recibe, pero solo si eres un experto piloto, ya que la penalizacion sube hasta el 50%.</p>\n<p>Una vez finalizado cada transporte con éxito, recibe una puntuación dependiendo de la carga transportada, los enemigos eliminados, las vidas que aún te quedan y los segundos que han sobrado.</p>\n<p>Con la puntuación recibida, puedes comprar mejoras para tu nave, así te es más fácil avanzar por los niveles, o bien no hagas mejorar y guardar los puntos para que al finalizar la partida se sume a la puntuación final, así podrás guardar tu puntuación máxima .</p>\n<p>Si decide mejorar la nave, dispone de varias mejoras con 100 niveles de cada mejora:</p>\n<p>-Aceleración: Mejora la aceleración de la nave y tardará menos en alcanzar la velocidad de 100Gm/h.</p>\n<p>-Consumo de energía: Mejora el consumo y podrás activar el motor durante más tiempo.</p>\n<p>-Tiempo de carga de disparo: Reduce el tiempo que tarda el arma en conseguir el 100% de carga.</p>\n<p>-Sobrecalentamiento: Aumenta el tiempo que el arma puede estar al 100% antes de que se sobrecalentarla.</p>\n<p>-Energía oscura: Compras un depósito de energía oscura para comenzar el transporte con una carga inicial.</p>\n<p>Cada transporte finalizado significa que subes de nivel, ya cada nivel las cosas se van poniendo más difíciles, más meteoritos, más naves enemigas y más veloces.</p>\n<p>Se guarda la mejor puntuación conseguida, tu decides la estrategia,  puedes invertir los puntos obtenidos y hacer mejoras para poder llegar a niveles altos donde se pueden conseguir muchos más puntos, o quedarte con los puntos e intentar subir de niveles sin hacer mejoras, tú decides.</p>\n<p>\"Ningún alienígena ha sufrido daños durante el desarrollo de este videojuego\"</p>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T17:30:16", "background_image": "https://media.rawg.io/media/screenshots/81c/81ccd8b53f304d140021812ae1f40a2e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["alonso240", "Asukar3D"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}