{"id": 859327, "slug": "runnerz-studio-twenty-two", "name": "Runnerz (Studio Twenty Two)", "name_original": "Runnerz (Studio Twenty Two)", "description": "<p><strong>Introduction  🏃‍♂️☕</strong>You play as a film crew studio runner from Zombiewood. A nuclear fallout has commenced, and you have to flee the approaching multidimensional fallout wave whilst dodging on set hazards and rift travellers (dimensional beings that appear as the nuclear blast has caused two dimensions to collide). Retro Endless Runner Side Scroller. </p>\n\n<p><strong>Design Pillars: 🧟</strong><br/>Fast / Action Packed / Endless Runner. </p>\n\n<p><strong>Genre/Story/Mechanics Summary📚</strong><br/>In Runner’z you the player will flee the oncoming nuclear smoke while evading film set obstacles or blasting your way through hordes of zombies….on an infinite level. <br/>“Keep on runnin”</p>\n<p><strong>Features: \r\n🎮</strong></p>\n<ol><li>Endless mode  - The game mode for Runnerz in which the level does not end.<br/>\n</li><li>Quick progressive difficulty - The further the player has gotten the harder the leve will become. <br/>\n</li><li>Random level generation - Procedural generated level which will increase replayability.<br/>\n</li><li>Protagonist - A lead character(s) of the narrative. <br/>\n</li><li>Score system - A score system to keep track the furthest distance the player has reached (high score).</li><li>Obstacle - Obstacles that are placed in the level in which the player must evade.<br/>\n</li><li>Supporting object ( weapon ) - A weapon in which the player can use to attaconcoming enemies . <br/></li><li>Simple controls - Two touch controls when the player is in gameplay (Jump &amp; Attack).<br/>\n</li><li>Power ups and specials - Power ups and specials that will aid the player to progress further within the level.<br/>\n</li><li>Currency - In-game currency in which the player can collect and then use for either cosmetics or to improve power ups. \r\n</li><li>Challenge ( in-game challenges / missions) - In-game missions to keep the player on their toes. Example “ Kill 20 zombies” If the player completes this during their playthrough of the level they will receive an award. <br/>\n</li><li>Character selection -A character or multiple characters in which the player can select to play as.<br/>\n</li><li>Mini tutorial - A tutorial which will show players how to play the game. The tutorial will begin for every fresh launch or download for a player.<br/>\n</li><li>Leaderboard - A leaderboard to show other users high-scores. </li><li>A store which will be used for players to buy cosmetics / improve power ups.<br/><br/>                                                 <br/><br/><br/><strong>How To Install 🖥</strong><br/>\n<strong>1)</strong> Download file\r\n<br/><strong>2)</strong> Unzip or Extract \r\n<br/><strong>3)</strong> Click on the Map Icon application within the folder to launch game  ( Do not worry about the \"Unknown File \" Prompt ).</li></ol>\n<p><strong><br/>Coming soon to Android &amp; IOS. <br/></strong><br/></p>", "metacritic": null, "released": "2022-09-26", "tba": false, "updated": "2022-09-30T18:15:52", "background_image": "https://media.rawg.io/media/screenshots/948/948cf02e6fe9f25b80b41e8c57ee9dba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Studio Twenty Two"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}