{"id": 859446, "slug": "girlandchainsaw", "name": "GirlAndChainsaw", "name_original": "GirlAndChainsaw", "description": "<h3>Gal x Chainsaw x Zombie</h3><h3>Overview</h3>A world after a zombie pandemic disaster.<br/>An exhilarating 3D action game set in a city that has been sealed off, where <strong>Gals use chainsaws to outmaneuver zombies! </strong><br/>A third-person 3D action game with an emphasis on control and exhilaration, this is a B-movie style game where you use a chainsaw to beat zombies and other creatures while splattering blood!<br/>Walk around and explore the school freely and try to escape the city, which is your goal.<br/><h3>STORY</h3>The setting is a post-zombie pandemic world! A girl holed up in a school is trying to escape!<br/>Mistilteinn city, where zombies suddenly appear and start attacking people.<br/>The city is immediately put on a strict blockade because of the virus.<br/>The city is in a state of lockdown, where not only the movement of traffic and supplies, but even communication is not allowed.<br/>The people left behind in the lawless city were either transformed into zombies by the minute, or died from the scramble for supplies.<br/>Or they will die in the struggle for supplies.<br/>At Shukugi Academy, located on the outskirts of the city, Hime Amano, the protagonist of the story, is holed up and living in seclusion.<br/>One day, while she was filming with the idea of making a profit by leaking the videos she had taken of the inside of the city blockade when she left the city, she heard a car crash from outside the school.<br/>When she went to the entrance to the elevator, she found that the barricade she had put up had been torn down and zombies had entered the school building.<br/>The school building is no longer safe from the creatures, and Hime runs around with a chainsaw in her hand.<br/><br/><br/><br/>Chainsaw-wielding, energetic gal!<br/>【Amano Hime】<br/>Amano Hime is a famous streamer who attends Mistilteinn-Gakuen in Mistilteinn-City.<br/>She enjoys real-time streaming and posts videos every day, but she is frustrated because she is unable to upload her videos due to the city's blockade of the Internet.<br/>After escaping from the city, she is accumulating videos, hoping to get rich by leaking information about the situation in the city.<br/><br/><br/>She is an honor student and a young lady who is symmetrical to the main character!<br/>【Sasakawa Iyo】<br/>Sasakawa Iyo is a female student at Mistilteinn-Gakuen in Mistilteinn-city, in the same grade as Amano Hime.<br/>After zombie pandemic disaster, She and classmates holed up in the school, but in an extreme situation, they had a disagreement with each other, and the classmates turned into zombies and were annihilated. She survived alone and continues to live holed up in a small room.<br/><br/><br/>Collaborator? A mysterious foreigner appears in a zombie-ravaged school!<br/>【Lunariya】<br/>A mysterious foreigner appears at the school where the Amano Hime is holed up. She knows how to get out of the town that has been sealed off due to the zombie pandemic.", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T04:27:25", "background_image": "https://media.rawg.io/media/screenshots/cf4/cf4e2fe0014cbdd3174c6c3b7c7e5fcf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Mistilteinn"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Mistilteinn"], "esrb_rating": null}