{"id": 859456, "slug": "eden-island", "name": "Eden Island", "name_original": "Eden Island", "description": "You will survive as a survivor on an  tropical island, a beautiful and mysterious tropical paradise with a rich ecological environment and a variety of magical animals.<br/>Cut down trees, collect resources, build your own home, hunt, grow crops, you can collect resources to trade with the aborigines, and you have to avoid ferocious beasts in the rainforest. In addition to tropical animals, you can also see animals from all over the world, because Ships carrying animals ran aground on this mysterious island, so you'll find animals from all over the world surviving and thriving on this island, you can even fight kangaroos and meet giant pandas in the bamboo forest.<br/>What magical animals and interesting things will you meet in this mysterious island of Eden? Come and explore!<h3>Game Features:</h3><ul><li>Multiplayer! Survive by yourself or with friends in online co-op!<br/></li><li>Building system: Freely build various walls and furniture to create a warm home, You can even build a city and mansion<br/></li><li>Farmingsystem: plant various crops<br/></li><li>Fishing: You can catch all kinds of beautiful sea fish in the sea<br/></li><li>Trade system: You can trade with the aborigines on the island, sell your prey and collected mineral resources, etc, and buy living materials from them<br/></li><li>Multiple Archive Management: Archives with different names can be saved, and archives can be loaded as needed.<br/></li><li>Day and night cycle weather system: real-time dynamic weather, realistic 3D volume cloud sky, wind system, thunderstorm, sunny, cloudy weather changes naturally, such as immersive.<br/></li><li>Characters: Human characters, a variety of land and sea animal AI, High quality and realistic models and animations<br/></li><li>Plants: High precision tropical plants, realistic natural wind simulation<br/></li><li>Ocean: Dynamic and realistic ocean water simulation, with a rich and beautiful underwater ecological environment, and a variety of peculiar marine animals. </li></ul>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T05:10:28", "background_image": "https://media.rawg.io/media/screenshots/229/229286192ae802739b8abb5dd4337173.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 437, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SnowBaby Games"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Casual", "Massively Multiplayer", "Indie"], "publishers": ["SnowBaby Games"], "esrb_rating": null}