{"id": 859535, "slug": "vallka-and-the-frayed-rope-prototype", "name": "Vallka and the Frayed Rope (prototype)", "name_original": "Vallka and the Frayed Rope (prototype)", "description": "<p>This is a small project that demonstrates several different things.  First, it serves as a demonstration of the use of AI generate art in the prototyping process.  AI art is not going to replace human created art, but it is a very useful tool.  Giving the designer the ability to generate their own concept art for scenes and characters in a matter of minutes can greatly improve the workflow of a project.</p>\n<p>Second is a demonstration of polish.  The Concept, Basic, and Simple Choice versions are effectively rough drafts.  They may contain spelling errors, typos, and other minor but noticeable flaws.  I didn't go out of my way to make errors, but I didn't go out of my to find and fix them either.  Roughly speaking, including time spent on AI generation, I'd say six hours is all I put into these versions.</p>\n<p>Third is a demonstration of refinement of gameplay.  The Basic version isn't even game, it's a kinetic visual novel.  Since the intent is to create an adventure game, that needs to change.  In the Basic version two simple gameplay choices are present: Do you climb down the cliff, and do you get the rock candy before talking with Mr. Bear?  It's not much, and how meaningful the choice is is up for debate, but there is technically gameplay now.</p>\n<p>A more complex version will uploaded in the future showing a more developed story and simple mechanics.</p>\n<p>Tools Used:</p>\n<ul><li>Unity</li><li>Fungus</li><li>Dall E 2</li><li>Simple Diffusion - AUTOMATIC1111's SD-WebUI</li><li>GIMP (for minor edits/touchups)</li></ul>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-03T05:46:14", "background_image": "https://media.rawg.io/media/screenshots/ba7/ba7b133ff2ac33bb71b943e7e6284b9d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Languard Gemstrike"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}