{"id": 859616, "slug": "axeboro", "name": "Axeboro", "name_original": "Axeboro", "description": "<p>This is an alpha version of Axeboro. Bugs and unintended behavior may occur. Some features may be missing or unclear. Your support and feedback will help the game.</p>\n<p><strong>Plenty of Items</strong> - The first version contains: 52 weapons (melee weapons, thrown weapons, and bows/crossbows). It will also contain 9 projectile types, including fire arrows. 34 Armors and 7 shields.</p>\n<p><strong>Easy to Mod</strong> - Add 15 lines of XML + an image and you've added a new item (country, weapon, troop type, etc.) C# mods coming soon.<br/></p>\n<p><strong>Customizable</strong> - You can customize everything about your play. You can even make your own scenarios. (coming soon)</p>\n<p><strong>Scenario Creator</strong> - With map builder, weather, troop placing, fire, etc., etc.<br/></p>\n<p><strong>Scenario Viewer </strong>- Play custom scenarios! <br/></p>\r\nQuickBattle customization screen<br/><br/>\n<p><strong>War Mode</strong> - A turn based strategy mode where you control troops and your army and try and conquer the world or revolt. You can choose to play out each battle or auto-battle.<br/></p>\n<p><strong>Multiplayer </strong>- You can host a game and join other people's games. First version will be quick battle multiplayer only.</p>\n<p><strong>AI Generals </strong>- Currently, enemies either do nothing or just move to the nearest person. However, soon enemies will be controlled by intelligent AI generals with unique personalities. For example, some generals may like to run away, some like to be cautious, some like to be aggressive, and some spread their troops out.<br/></p>\n<p><strong>Tutorial</strong> - Let's be real, this is an RTS game. You can't just look at it and understand it. The tutorial will come later in development. However, the game is somewhat easy to understand. It may be possible to learn it in ~1 hour.</p>\n<p><strong>Redo Terrain Textures </strong>- Let's keep it simple. They're ugly.<br/><br/><br/><strong>DEVELOPMENT STATUS:</strong><br/></p>\n<p>I do not have much interest in continual development of this game. If everyone seems to love it, I will return. I haven't spent too long making it so the loss isn't that great. Never dedicate a long time to something you aren't interested in. This project taught me a lot. It is still very buggy. I will open source it.<br/><br/>I should point out: I started this project shortly after I turned 14. So it has a lot of problems now. A lot of things I thought were good then are bad. Unsalvageablely, it seems.</p>\n<p>This game is more of a terrain generator it feels to me some times. I can barely bring myself to fix a lot of bugs. I learned a lot, though. A lot. A lot lot. A lot lot lot.</p>\n<p>If you have any questions or concerns, contact me.</p>\n<p>If for some reason you want to play it (very buggy, thats how bad I made it, but as I said, I learned a lot), you can download it and unzip it. When you unzip it, move the contents of the PERSISTENTDATA folder to LocalLowAppData\\PuffyPenguin\\Axeboro.  Then run the game. You might not even be able to get past the menu, sorry.</p>", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-03T06:17:33", "background_image": "https://media.rawg.io/media/screenshots/926/926b72bb7823fd612c8e9dffc0d1abe9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["sriracha6"], "genres": ["Action", "Strategy", "Simulation"], "publishers": [], "esrb_rating": null}