{"id": 859781, "slug": "extreme-chef", "name": "extreme chef", "name_original": "extreme chef", "description": "<p><strong>Sometimes it doesn't play audio, try refreshing and clicking furiously on the black page of the game before it loads!</strong></p>\n<p><strong>WARNING: EXTREME COOKING AHEAD!</strong></p>\n<p>The master of all cooks is in town! Everybody is lining up for what will be the most extreme experience they ever had! Cook them the meal of their life, but do it quickly! Throw together ingredients and send them straight in the mouth of the client!<br/></p>\n<p>Detailed instructions:</p>\n<ul><li>Drag and drop ingredients from the right to either the client or the pan</li><li>The ingredients then break up in the composing tastes: Sweet, Sour, Bitter, Savory, Cool, Spicy, Dry, Salty.</li><li>The sum of the tastes in the pan and in the stomach are your score. These values are displayed in the stomach and the pan on the right.</li><li>The client minimum score requirement it's displayed in the flag on the right.</li><li>The clients likes, dislikes and resistances are displayed at the left of the client. These modify your score: if the client doesn't like Sweet, all Sweet tastes count negatively, if he likes them they count double and if he's resistant they count nothing.</li><li>If you satisfy the client, the next client will require 10 more flavor, if you don't he'll require 10 less.</li></ul>\n<p>Thanks for reading and playing! This is a game made in 2 day for ludum dare 51: https://ldjam.com/events/ludum-dare/51/$299973/edit, the source is available on github: https://github.com/jacopograndi/ld51chef.</p>", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-03T07:37:35", "background_image": "https://media.rawg.io/media/screenshots/177/177ba7a30eb23d7352c52e5ec3a719e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["zjikra"], "genres": ["Action"], "publishers": [], "esrb_rating": null}