{"id": 85995, "slug": "taptube", "name": "TapTube", "name_original": "TapTube", "description": "▶▶ Let’s enjoy Rhythm game with all of the Youtube video ◀◀<br/><br/>Do you want to experience the differentiated rhythm game?<br/>Please forget about the uniformed games with limited source.<br/>Watch, listen, and feel the music and share it all around the world in TAPTUBE!<br/>In TAPTUBE, the music with pleasant memories and beautiful stories of users will be delivered to you.<br/>Just listen the music cannot satisfy your sensitivity. With movie-like music videos, upgrade your sensitivity more and more.<br/>TAPTUBE will produce your favorite youtube vids for you to enjoy more fun.<br/>We recommend this game to the one who quickly feel tired when they play in framework.<br/>Anyone can direct their own rhythmical, dynamic production in TAPTUBE.<br/>Share your idea and rhythmical sense to all around the world!<br/>You can be the best creator of TABTUBE.<br/>With TAPTUBE, the five senses and emotion will be fulfilled and improved.<br/>Brushing away your stress with TAPTUBE!<br/><br/><br/>■ Rhythm game with video ■<br/>Forget about the sound based rhythm games!<br/>TAPTUBE provides not only sound, but also youtube video with it.<br/>We bet you couldn’t feel bored while playing rhythm game, watching video, listening to the music concurrently.<br/><br/>■ Real-time streaming note ■<br/>Smart TAPTUBE can analyze any soundtrack.<br/>Can I play this old music? How about this one?<br/>Don’t worry!<br/>TAPTUBE can provide sensational note to you as long as the soundtrack exists.<br/><br/>■ Recommend, Favorite, Ranking ■<br/>When you cannot select which one to play, just loot at the recommendation list!<br/>Enjoy the new game from video list which updated everyday.<br/>Do you want to own the music and note? Add them to your favorite list!<br/>The favorite list will keep your vids and notes safely so you could play it anytime you want.<br/><br/>■ Let’s play it variously, with various configurations! ■<br/>It’s too hard! Too easy!!<br/>Wait a sec! Did you heard about the configurations? <br/>TAPTUBE provides configuration options to change game speed, number of line, long note on/off, slide note on/off, etc.<br/>The player can change the configurations to take their choice like order-made.<br/>TAPTUBE set itself to the player, not set the player to the game.<br/>Let’s set the personalized configurations and enjoy the TAPTUBE!<br/><br/>■ Your own notes! Custom note function ■<br/>The current one is too boring. Can’t I make my own notes?<br/>To the one who has such question, we recommend you to use the custom function of TAPTUBE!<br/>Feel free to make your own notes for the youtube video you want!<br/>The unique stage in the world is prepared for you!<br/>Custom and share the music which has your story and memory, all over the world!!<br/><br/>※ Notification about subscription of premium members<br/>- The price is $3.99 and the period of subscription is 1 month.<br/>- If period of subscription is expired, subscription will be automatically renewed.<br/>- If you don't turn-off the 'Automatical-renew' 24hours before the expiration, join will be automatically renewed.<br/>- You should recognize that you are not allowed to refund and cancel the subscription while the period of subscription.<br/>- Users are able to manage the situation of subscription and users are able to unjoin 'Automatical-renew' at the account setting after purchasing.<br/>- Setting(iPad, iPhone) -&gt; iTunes and App Store -&gt; Apple ID -&gt; Change at 'Management of subscription'<br/>- The personal information protection policy and Terms of service -<br/>https://www.smartplayland.com/taptube/service_term.php<br/><br/>※ This application can only play videos that are licensed by YouTube API.(only streaming) <br/>※ Available device :　After more than iPhone 4S, iPad2, iPad mini, iPod touch(5 generation or later)<br/>※ Available OS : After more than iOS7<br/>※ We recommend Wifi environment due to heavy traffic generation.<br/>  Commodity cancellation is not possible for the billing information generated by the user's choice.", "metacritic": null, "released": "2015-05-14", "tba": false, "updated": "2019-07-30T10:19:21", "background_image": "https://media.rawg.io/media/screenshots/981/981a6c7fe61ba19b6ac2edb0d471dd2a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SmartPlayland"], "genres": ["Action"], "publishers": ["JoyLoL CO.,LTD."], "esrb_rating": null}