{"id": 86007, "slug": "pixel-invaders-2-free", "name": "Pixel Invaders 2 - Free", "name_original": "Pixel Invaders 2 - Free", "description": "Pixel Invaders are back! Get ready for all new and improved Pixel Invaders 2. The highly addictive game with all new set of features that you wont find in any other flooding games. <br/><br/>Why just flood the screen, when you can do it in 4 different ways. <br/>1.\tPixel Invaders classic way<br/>2.\tPlay against the clock<br/>3.\tFlood from the middle of the screen <br/>4.\tThe Challenge<br/><br/>If you like Flood-It 2 and Infection type games, you will love Pixel Invaders. It has better graphics and accurate game play. It also offers more difficulty levels than most of the flood games you find in the app store.<br/><br/>The object of the game is to turn the entire game board to a single color. You can do this by selecting one of the colored buttons on the bottom of the screen to change the color of the top left square. The color of the neighbouring squares will change accordingly. Keep on changing colors till the entire game board changes to a single solid color within the allowed number of moves. The ultimate goal is to do this in fewest moves as possible.       <br/><br/> Features:<br/>-\tFour game modes: Classic, Timed, Ripple, Last Color<br/>-\tThree board sizes to chose from (Large, Medium, Small)<br/>-\t16 achievements to be achieved (830 OpenFeint points)<br/>-\tSupport OpenFeint 2.4 (Leaderboards, Achievements, Chat and more)<br/>-\tListen to the game soundtrack or disable it and use your own iPod music <br/><br/><br/>**********************************************************<br/>Check out Pixel Invaders introduction video on Youtube.<br/>http://www.youtube.com/watch?v=qGRN3ATS4o0<br/><br/>For more videos please visit our Youtube channel.<br/>http://www.youtube.com/lakmalfdo<br/>**********************************************************", "metacritic": null, "released": "2010-07-09", "tba": false, "updated": "2019-10-22T14:21:34", "background_image": "https://media.rawg.io/media/screenshots/383/3839aa90d8e41cfac88eff7a66af315f.jpg", "website": "http://www.ikreeda.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iKreeda Games"], "genres": ["Family", "Puzzle"], "publishers": ["NGS Technologies"], "esrb_rating": "Everyone 10+"}