{"id": 860064, "slug": "unlucky-town", "name": "Unlucky Town", "name_original": "Unlucky Town", "description": "Introduction\r\n<p>You are the major of a reall unlucky town. Every 10 seconds, a disaster hits your town!</p>\n<p>Disasters cause damage to the buildings in your town. You have to keep your town alive as long as possible. Add more buildings, upgrade the existing ones and do your best!</p>\r\nHow to play\r\n<p>The game is based on a four cards deck. Each turn your deck replenishes. The cards you do not play will still be in your deck the next turn.</p>\n<p>You can only play cards you have enough energy for. You can see your energy at the top left of the screen. Each turn your energy replenishes.</p>\n<p>Each turn lasts 10 seconds. At the end of the turn, your town gets hit by a disaster which causes damage to your buildings.</p>\n<p>You start with just one level 3 house.</p>\n<ul><li>Use the <strong>mouse</strong>. </li><li><strong>L</strong><strong>EFT BUTTON</strong>  plays the card you are hovering on.</li></ul>\r\nBuildings\r\n<p>There are different type of buildings. Some disasters only damage certain types of buildings.</p>\n<p>Each building has a level that goes from 1 to 3. The level determines how sturdy the building is.</p>\n<p>Playing an \"upgrade\" card will increase the level of your building and set its health to the maximum for that level.</p>\n<p>The different type of buildings are:</p>\n<ul><li> House</li><li>Commercial</li><li>Factory</li></ul>\r\nCards\r\n<p>There are different type of cards.</p>\n<p>Cards are used to place buildings in your town, to upgrade existing buildings and to temporarily increase your maximum energy.</p>\n<p>Each card has an energy cost. Some might have zero cost (i.e. increasing energy costs no energy itself).</p>\n<p>The different type of cards are:</p>\n<ul><li>Build House</li><li>Build Commercial</li><li>Build Factory</li><li>Upgrade a building</li><li>Increase energy</li></ul>", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-03T10:39:47", "background_image": "https://media.rawg.io/media/screenshots/15b/15b5437d6d1ba5887673111c24232980.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["Valerio Santinelli"], "genres": [], "publishers": [], "esrb_rating": null}