{"id": 860132, "slug": "maze-monsters", "name": "Maze Monsters", "name_original": "Maze Monsters", "description": "<p>\n</p><p>Paladins, men of God come to cleanse the monastery that has been corrupted by an evil blind wizard and his unholy creations.\r\n  </p>\n<p>The wizard sends his most fearsome monsters to kill the unaware heroes. He possesses the power to see through their eyes, but always only through one of them at a time.\r\n  </p>\n<p>The monsters have the best chance to get to the paladins while they are guided by the wizard. \r\n  </p>\n<p>And so, they compete – which of them will kill more heroes will surely become the favorite of its master.\r\n  </p>\n<p> \r\n  </p>\n<p>Mechanics:\r\n  </p>\n<ul><li>The core game concept is, that the monsters are trying to find the fastest way through the dark maze to get to their victim. Their source of light/sight is swapped between them every 10 seconds. \r\n  </li><li>Every time a monster kills it scores a point and a new paladin emerges to avenge the previous one.\r\n  </li><li>After 3 minutes the game ends. Whoever scored more points wins.\r\n  </li><li>Player one:  keyboard arrows\r\n  </li><li>Player two: WASD\r\n  </li><li>Player three: controller (right stick)\r\n  </li></ul>\n<p> \r\n  </p>\n<p>While hurrying through the corridors, they will find two kinds of powerups. One will increase their movement speed, the other one gives them the ability to jump over the walls of the maze. \r\n  </p>\n<p>Every level is auto - generated – this supports the re-playability of the game and ensures the consistency of the difficulty.\r\n  </p>\n<p> \r\n  </p>\n<p>Controls \r\n   </p>\n<ul><li>Player one:  Arrowkeys\r\n  </li><li>Player two: WSAD\r\n  </li><li>Player three: controller (right stick)\r\n  </li></ul>\n<p>\n</p>\n<p>Created by:\r\n  </p>\n<p>Kevin Andok, Vojtech Daubner, Marko Ondrušík, Tomáš Šlechta, Andrej Valacsay\r\n   \r\n   \r\n  </p>", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-03T11:42:20", "background_image": "https://media.rawg.io/media/screenshots/270/270309284a3a6957054168c763a1b8df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KevinA"], "genres": ["Action"], "publishers": [], "esrb_rating": null}