{"id": 860281, "slug": "agito-a-gaze-into-the-origins", "name": "AGITO - A Gaze Into The Origins", "name_original": "AGITO - A Gaze Into The Origins", "description": "IMPORTANT: Please Play On Fullscreen Mode!<p><em>(Click the blue icon in the bottom right corner of the viewport to switch to full screen.)</em></p>Description:-<p>We have developed a game using the Unity Game Engine that gives players, a first-hand experience of the James Webb Space Telescope's capabilities and its development history in a narratively structured experience. Players need to solve various puzzles and go through minigames that direct them toward space telescope challenges, astonishing results and findings, and ideas behind the making of such a galactic masterpiece. Additionally, our project provides access to NASA's space resources and blogs in an interactive manner that is broken into easily digestible chunks with a trivia section to make sure that the players retain what they have learned. This is important that we learn how and why mankind invests its efforts working on innovations like the James Webb Space Telescope as observations of humans in the vast universe might lead us to the origin of everything.\r\n</p>\r\nAGITO! What is it? How does it work?\r\n<p>Enlightenauts bring you a game that gives you an awe-inspiring and informative experience that takes you through James Webb Space Telescope's capabilities and development journey in a narratively full-filling sequence, directly inspired by NASA blogs and resources provided by other space agencies including ESA and CSA. It's exhilarating to learn about how mankind's astonishing creation turns into reality, how space is a real challenge, and how science becomes an obstacle and its resolution in this journey.\r\n</p>\r\nWhat benefits does it have?\r\n<p>The benefits of the application are that children learn about space exploration and the science behind it while having fun so that they are engaged without losing interest. The sole purpose of developing this game is to make them aware of how the space telescope world has been revolutionized after Hubble's milestone and how Hubble became the father of innovation of the Next Generation Space Telescope which we now know as the James Webb Space Telescope. The narrative direction of this game is very subtle, keeping in mind the actual sequence of events that took place. All the data used is straight from NASA's blogs and the resources listed along with our challenge.\r\n</p>\n<p>What do we hope to achieve?\r\n</p>\n<p>With the help of our game, we hope to achieve ignition of curiosity in the younger demographic that can grow into a passion for science and astronomy. This rather obscure part of human effort is glorified but often misrepresented in media these days, which has the effect of creating an initial hype in children which later dies off when they learn that the reality is quite different. So why not create that initial hype in a way that doesn't disappoint them later on?\r\n</p>\n<p>Space Agency Description\r\n</p>\n<p>We made extensive use of the NASA Webb Image library and CSA James Webb Space Telescope website, which provided many astonishing observations of JWST. These allowed us to develop accurate depictions based on physical observations, making our project relevant to real-world science.\r\n</p>\n<p>We also used a James Webb blogs by NASA, taken from editor's notes which helped us in developing the narrative direction for the game and keep it more accurate in terms of the history of JWST.</p>", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-03T14:42:20", "background_image": "https://media.rawg.io/media/screenshots/c83/c83c1dcc9731c8a3fb7587bd2e3b9fae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aryan Rai"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}