{"id": 860338, "slug": "sabot-age", "name": "Sabot Age", "name_original": "Sabot Age", "description": "<p>(full screen recommended)</p>\r\nSabot Age\r\nIntroduction\r\n<p>Sick of being treated as nothing but mere footwear, the sabots revolted. Overnight they grew their size a hundredfold and built large factories to reproduce and assemble an army of a scale never seen before. In only a few days, masters turned into slaves and slaves into masters. The reign of the Sabot has begun.<br/></p>\n<p>These are dark times for humanity, but there is hope, for you have discovered the power of teleportation, only hours before your laboratory was overrun. This discovery is the key to save humanity from an existence of servitude. Unfortunately, you haven't had much time to improve this technology, and therefore it has one major flaw: You can't control where it teleports you. You must use it taking that flaw into account.</p>\n<p>Your plan is the following:</p>\n<ul><li>Sabotage all enemy factories. The fewer factories there are, the lower the productive capacity of the sabots.</li><li>Do not get caught by the sabots. If you are stepped on, all is lost.</li><li>Make use of the poor sight and coordination of the sabots by making them walk into each other or into the mortal remains of their comrades. They will die immediately and burst into flames (for some reason).</li><li>If you find yourself in a dangerous situation, use the teleporter, but beware: You may very well teleport yourself into the roaring flames of a fallen sabot or under the deadly sole of a living one.</li></ul>\n<p>You will either free humanity from enslavement or be stepped on until you are nothing more than a bloody heap of bones, muscles and connective tissue.</p>\n<p>Good luck.<br/></p>\r\nControls\r\n<p>N: k or 8 or w<br/></p>\n<p>NW: y or 7 or q<br/></p>\n<p>W: h or 4 or a<br/></p>\n<p>SW: b or 1 or z<br/></p>\n<p>S: j or 2 or s or x<br/></p>\n<p>SE: n or 3 or c<br/></p>\n<p>E: l or 6 or d<br/></p>\n<p>NE: u or 9 or e<br/></p>\n<p>Teleport: T<br/></p>\r\nHow to play\r\n<p>Destroy all factories to get to the next level. Currently there's no level indicator, or highscore tracker (since this was done for a TriJam and I ran out of time), but the current level is equal to the amount of factories at the start of the level.</p>\n<p>If you step into a fire or a sabot steps into you or if you teleport into either of those, you lose and go back to level one (1 factory), if you destroy all factories, you advance one level (game gets reset and spawns one more factory than the amount of factories there were before).</p>\n<p>The sabots will avoid the factories, but they won't avoid the fires or other sabots, if such a collision occurs, they will be turned into fire themselves.</p>\n<p>New sabots spawn on the red floor. The amount of sabots spawned is equal to the amount of factories in the game.</p>\r\n\r\nAssets\r\n<p>\r\nThe texture of the sabots is derived from this CC-BY-SA 2.0 picture by annemarie vanloenen: https://commons.wikimedia.org/wiki/File:Lithuanian_clogs.jpg</p>\n\n<p>All the remaining assets were made by me.<br/></p>&lt;/iframe&gt;", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-03T15:52:06", "background_image": "https://media.rawg.io/media/screenshots/512/512b4a7f30bcbd09ffda0bd83336bfa1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Festerdam"], "genres": [], "publishers": [], "esrb_rating": null}