{"id": 860412, "slug": "castle-defenders-kaasnake", "name": "Castle Defenders (KaaSnake)", "name_original": "Castle Defenders (KaaSnake)", "description": "Controls\r\n<p>The arrow keys move each character up down, left and right.</p>\n<p>Z is used to switch between characters.</p>\n<p>X to shoot a magic beam.</p>\n<p>CTRL+R to reset the cartridge.</p>\r\nRules\r\n<p>You control three characters standing in front of the gate of the Castle.</p>\n<p>The enemy army marches toward the right - if a soldier reaches the steps, it's Game Over!</p>\r\nPlayer Characters\r\n<p>There are three characters on screen you control:</p>\n<ul><li>The Warrior, who shoots at a low distance;</li><li>The Wizard, who shoots at a medium distance;</li><li>The Archer, who shoots at a maximum distance.</li></ul>\n<p>Each character must hit their corresponding unit to eliminate them (except for the Red Goblin, which can be eliminated by any of them.)</p>\n<p>Walking into an enemy or letting an enemy walk into a character will eliminate them, but will incapacitate that character for a few seconds.</p>\r\nCharacter Switching\r\n<p>To control the next character, you press the Z button. The switching order is always the same - Warrior, Wizard, Archer. Try and remember it for the most ectic moments of the game!</p>\n<p>An arrow above the character will remind you which one you are currently controlling.</p>\r\nEnemies\r\n<p>Enemies will walk from the left to the right, advancing by following their step rhythm. </p>\r\nDestroying Enemies\r\n<p>Each eliminated enemy will advance their step pattern, increasing their walk and spawn speed. They will keep getting faster and faster with each elimination.</p>\r\nBarrier Magic\r\n<p>Behind the player characters a magic symbol will appear.</p>\n<p>Making a character step on it will activate a giant wave that will clear the screen of enemies. This will also slow down their total speed, giving you some more breathing room.</p>\n<p>Each time you use Barrier Magic, the symbol will take longer and longer to re-appear.</p>\r\nGame End\r\n<p>The game ends when an enemy manages to reach the steps of the Castle, and the castle is then invaded.</p>\n<p>Your score will be shown in the end screen!</p>\r\nBehind The Scenes\r\n<p>I feel like I'm really getting into the pacing with Pico8 games.</p>\n<p>And I hadn't worked on a tile-based game in a long while, so it really was a fun exercise to get back into this!</p>\r\nCredits\r\n<p>Game made in Pico8\r\n</p>\n<p>Design and Programming by KaaSnake\r\n</p>\n<p>Music and SFX by KaaSnake\r\n</p>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T16:31:04", "background_image": "https://media.rawg.io/media/screenshots/17e/17e1dfa406cab0d916cbdf8cf26841da.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KaaSnake"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}