{"id": 860419, "slug": "micro-gravity", "name": "Micro Gravity", "name_original": "Micro Gravity", "description": "Very Basic Newtonian Physics\r\n<p>This was made as a one off for a very specific purpose and not really meant to public consumption but itch.io makes a sort of \"unlisted\" project annoying to maintain so here it is 😂</p>\n<p>There's not much going on here, just a very basic and unapologetic Newtonian physics thing with a somewhat odd control scheme.</p>\n<p>Also, I wanted to test web exports again, but this time with plain old Unity and URP. </p>\r\nSome Quick Unity Thoughts\r\n<p>FYI you need to set the compression in the Publishing Settings of the Player Settings in Unity for it to run correctly on itch.io. Under the Resolution and Presentation tab (in Player Settings too) you'll probably want to set the template to Minimal to get rid of the bar and frame that Unity adds to its web exports by default.</p>\n<p>Oh yeah, new Input System. I really like the direction this thing is going, though I am a bit wary of using it on a production game. When it works, it's a <em>massive</em> improvement over the old Unity input system, and I'd say it falls somewhere in between Rewired and the old system in terms of robustness. It takes a lot of the ideas of Rewired (e.g. actions and maps) but puts them into a more Unity-native format.</p>\n<p>The biggest drawback with the New Input System though is that I think there's no good tutorials for it. Or at least, I haven't seen any. All of the docs and tutorials tell you how to use the components Unity provides and I think that's a <em>big</em> mistake, because the Inspector-side (and even script-side) connections it forces you to make are incredibly fragile and prone to breaking if you ever need to refactor something or rename anything.</p>\n<p>I have an example of how I would do input here, and it's what I always reference, but I think this example is a little over-complicated since that implementation was specific to Vector Fury. At some point I think I should make a new example. </p>\r\nControls\r\n<p>Requires a gamepad to fly the thing around.</p>\n<ul><li>Strafe Left/Right - Left thumbstick horizontal</li><li>Strafe Up/Down - Left thumbstick hertical</li><li>Forwards - Left thumbstick press, left bumper</li><li>Reverse - Right thumbstick press, right bumper</li><li>Roll Left/Right - Left/right triggers</li></ul>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T16:33:37", "background_image": "https://media.rawg.io/media/screenshots/4bc/4bc72dc5a6c79da0d9b4288d0dee4368.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Why485"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}