{"id": 86040, "slug": "castle-of-legends", "name": "Castle of Legends", "name_original": "Castle of Legends", "description": "Castle of Legends is a multi-player online fantasy MMO SLG where you must construct a castle, recruit legendary heroes from different times, and save a land ravaged by a cataclysmic disaster.<br/>In a dark and mysterious land of knights, castles, and legends, a failed experiment has triggered an unprecedented catastrophe, opening a time rift and causing fearsome monsters to appear and wreck your castle! As lord of the manor, you need to rebuild your castle, exploring the great changes in the world around you!<br/><br/>[FEATURES]<br/>● Build Floors with Unique Functions: Reconstruct the various layers of your castle and return the kingdom to its former glory in a castle building simulator like you’ve never seen! Run your castle the way YOU want! Train your heroes and put them to work, commanding them to craft new items and explore the world, while killing all kinds of evil monsters along the way!<br/>● Expand Your Army of Legendary Heroes: Gather together legendary heroes from across time and space. Recruit legends like Einstein and Nobel to help you rebuild the castle, while champions such as King Arthur and Zorro explore the world! Who’s your favorite hero? Collect them all!<br/>● Upgrade Heroes and Craft Epic Gear: Command your cool craftsmen to gather ore in the mine, form caravans, build equipment, and refine items! Level up your favorite heroes!<br/>● Battle Your Rivals in Frantic PVP: Capture resources by defeating players and occupying strategic points on the world map! The gold rush is on! Dash into the fray as you challenge other players in a range of awesome PVP modes, and crush them all in your quest to become king of the arena and a legend in your own right!<br/>● Embark on a Time-Traveling Adventure: Goblin forests, dwarf kingdoms, abandoned castles, frozen plains, and more! Explore magical lands from famous legends and clash with hundreds of scary monsters and evil kings along the way! There’s a mysterious world out there for you to explore, so gear up your heroes and get ready to roll! Uncover the secrets of time in a super fun RPG story that spans across time and space, and create a legend of your own in this amazing new game! <br/><br/>Note:  Castle of Legends requires an internet connection to play.<br/><br/>[SUPPORT]<br/>Are you having problems with the game?<br/>Contact us via Email: support@cyou.mail.helpshift.com<br/>…or visit our Facebook Fanpage: https://www.facebook.com/castleOLofficial/<br/>And Facebook Group: https://www.facebook.com/groups/1559208624378536/", "metacritic": null, "released": "2017-06-08", "tba": false, "updated": "2019-10-22T14:21:35", "background_image": "https://media.rawg.io/media/screenshots/9f0/9f02a0f5b846ae51386f99b37aeeaa7b_AkzjBOm.jpg", "website": "https://www.facebook.com/castleOLofficial/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 210, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Changyou.com HK"], "genres": ["RPG", "Strategy"], "publishers": ["Changyou.com HK"], "esrb_rating": "Everyone 10+"}