{"id": 860576, "slug": "en-una-noche-de-invierno-aparecio-el-trapero-canta", "name": "En una noche de invierno apareció el trapero cantando bajo tu ventana.", "name_original": "En una noche de invierno apareció el trapero cantando bajo tu ventana.", "description": "<p><strong><em><strong>Esto es una aventura conversacional</strong></em></strong> programada en Inform, asi que recordad que necesitais un intérprete para poder jugar a ella, aunque si quieres jugarla online sin descargar nada (cosa que recomiendo) podeis hacerlo a traves del siguiente enlace (gracias al CAAD por alojarla).</p>\r\nJUGAR ONLINE\r\n\n<p><strong><em>*******************************</em></strong></p>\n<p><strong><em>No pido ni oro, ni plata, ni riqueza terrenal. No deseo nada vano, ni nada que no me puedas dar. Solo pido algo de lo que un mortal se puede desprender. Dámelo y nuestro contrato será sellado, doblado y guardado en el cuarto cajón de la sala centésima en la torre más alta de mi castillo invertido. Niégamelo y me llevaré a tu hijo, tu marido sufrirá una muerte atroz, tus sirvientes te abandonarán vertiendo veneno sobre tu honra y el invierno anidará en tu hogar... Dame... dame el amor de una madre y todo estará saldado. Solo cinco latidos de tu corazón te concedo.</em></strong></p>\n<p>Esta es una aventura conversacional de terror que escribí hace muchos años para un concurso. En realidad es un puzzle de una sola orden, pero deberás de deducir lo que hay que hacer en menos de cinco latidos de corazón.</p>\n<p>Tened en cuenta que en las aventuras conversaciones hay que escribir vuestras ordenes y estas normalmente se componen de [verbo] + [objetivo]. Si teneis duda, escribid Ayuda en la linea de comandos.</p>\n<p>Una aventura conversacional es un juego en el que el ordenador te describe, mediante un texto, la situación, y tú mediante texto, le indicas a la historia la acción que quieres realizar, lo cual puede modificar el devenir de la trama.<br/></p>\n<p>Para examinar los objetos, la orden es EXAMINA [OBJETO]</p>\n<p>La aventura admite preposiciones y artículos, por ejemplo CANTA UNA SARDANA</p>\n<p>Puedes salvar tus progresos en el juego con el comando SAVE y recuperarlos otro día con LOAD aunque debido a la longitud de la aventura no te va a hacer falta.</p>\n<p>Para hablar, basta con HABLA CON PERSONAJE.</p>\n<p>La versión en ingles está aquí. Gracias a Ruber Eaglenest, por hacer posible la versión anglosajona.</p>\n<p>Si queréis leer un actualplay por parte de unos ingleses, lo tenéis aquí. Es interesante verlos pensar que soy un rapero italiano XD</p><p>Por cierto, el Trapero tambien aparece en el juego de la invitación.</p>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T17:32:07", "background_image": "https://media.rawg.io/media/screenshots/8ba/8ba4357da7856ba82b8a0651951f3c91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fran_Kane"], "genres": [], "publishers": [], "esrb_rating": null}