{"id": 860626, "slug": "nor-are-we-forgiven", "name": "Nor Are We Forgiven", "name_original": "Nor Are We Forgiven", "description": "<p><strong>INTRODUCTION;</strong><br/></p>\n<p>This life is not a life.\r\n</p>\n<p>This life may have never been a life. Like all other lives, this one was brought into the world just like all other births: time contracted, splintered, then fell free. It spins on, squeezing moments into the next before reaching the precipice of death; the meaning of existence divided in two.\r\n</p>\n<p>It starts like this: Unable to see, unable to hear, unable to piece bits and pieces together because at first our hands can only grasp onto nothing. Compressed is the tale of immeasurable weight, dreams and hopes and beliefs all placed upon soft flesh and weak muscle, the floating plates of a skull.\r\n</p>\n<p>It starts like this: we refused death and that being is now <em>this</em> being in <em>this</em> time and that child did not die and will not die, and that child opens its eyes to a strange new world and will keep hurtling forwards until it crosses the boundary.\r\n</p>\n<p>A thousand years ago, ten thousand years ago, one-hundred thousand years ago, life came to be because we did not die before we passed down the torch. We are not pioneers. We are not creatures of change. We do not become which that we are not. We were one thing and we are now another, and another thing is not what we asked to be, so we clawed our way out of the dirt and demanded to be heard.\r\n</p>\n<p>It starts like this: You were murdered. And then you came back.\r\n</p>\n<p><strong>STORY;</strong>\n</p>\n<p><strong><em>NOR ARE WE FORGIVEN</em></strong> is a horror interactive fiction made in twine. A slasher story with a twist – the first victim is given another chance at life. The only catch? Something very, <em>very</em> old and terrible has settled into your bones. Suddenly the murderer on the loose may be the least of your problems.\r\n</p>\n<p>NOR WE ARE FORGIVEN and the blog are strictly rated 18+ for depictions of blood &amp; gore, alcohol &amp; drug mentions and/or use, unreality, and sexual content.\r\n</p>\n<p><strong>FEATURES;</strong>\n</p>\n<ul><li><strong>CUSTOMIZABLE MAIN CHARACTER</strong>: gender, pronouns, personality, appearance &amp; more\r\n</li><li><strong>POTENTIAL RELATIONSHIPS:</strong> ranging from platonic to romantic, build a social life, make friends, and maybe even find a partner who doesn't mind the whole risen-again thing.\r\n</li><li><strong>DETERIORATING SANITY:</strong> are you dead? alive? have you been here before? you've been here before.\r\n</li><li><strong>CHOICE-DRIVEN STORY: </strong>with a variety of routes and choices, unravel the mystery and uncover the identity of your killer before you find yourself six feet under again.\r\n</li></ul>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T17:52:23", "background_image": "https://media.rawg.io/media/screenshots/102/1028fe10a58509b8abbb8a45bffa4308.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["icedorca"], "genres": [], "publishers": [], "esrb_rating": null}