{"id": 860671, "slug": "all-that-probably-glitters", "name": "All That (Probably) Glitters", "name_original": "All That (Probably) Glitters", "description": "After a \"Robin Hood\"  steals treasures from a lavish Halloween party, they find more than they bargained for.\r\n\n<strong>Features:</strong>\n<p><strong>* </strong>An incredible story and character-driven visual novel!<br/>* A fabulous pocket system!<br/>* Seasonal and spooky feelings: 🍂🎃<br/><strong>* ~ 30-minute-long</strong> gameplay packed with loads of interactions and visuals! You could think of it as a Halloween special :3<br/>* 3 endings kind of, but multiple, I mean MULTIPLE,  <strong>achievements</strong>!<br/>* Explicit bias (implicit would've been nice to include, but alas--)<br/>* <sprite variations=\"\"><br/>* Not the main PUQFFAL!!! cast! (Is that really a feature though...)<br/><strong>*</strong> Animal people who live in an animal world in the year XXXXXXX where humans went extinct for an unknown reason still and all mammals (and avians) evolved to have human-like features which was explained in the other games! (You don't need this information at all to enjoy the story, but congrats on reading that.)<br/><strong>* </strong>Interesting and (literally) colorful cast of characters you may have (not) seen before!<br/><strong>* </strong>And last, but not least... You know the drill ;D<br/></sprite></p>\n\n<strong>Warnings:<br/></strong>\n<p>*<strong> Screen shakes</strong> and sudden movements. (You can disable some movement in the options menu if you'd need.)<br/>* UNintended jumpscare-y things. They were never truly intended.<br/>* The yummy <strong>sound of bones breaking.</strong><br/>       * <strong>Death</strong>. (But nothing too graphic or descriptive)<br/>* Strong language<strong>.</strong></p>\r\n\r\n    A warning that might be a SPOILER (press me to read):\r\n    <ul>\n<p><strong>* Mentions of disownment<em>. <br/></em></strong></p>\n</ul>\n<p>As with all games, be mindful if you interpret its warnings as features, or you might be disappointed.</p>\n\n<p>Thank you for checking out my page! Please let me know what you think by leaving feedback or a rating with a comment. They are all super-duper appreciated :D<br/></p>\r\n\r\nCredits (as requested by the Spooktober VN Jam):\r\n<p><strong>Sole Developer </strong>- MintGlow<br/></p>\n<p>Multiple super awesome and cool third-party resources were also used! A detailed list of credits can be found in the \"About\" section of the game.<br/></p>\r\n\r\n    What does working on an entire game in <strong><em>under a month </em></strong>mean? That's why I present the \"Total-Time-Worked-On-Game-For-Fun-Because-Why-Not\".<br/>(Press me to read if you'd like!):\r\n    <ul>(The app I use tells me how long I drew each thing.)\n\n<p>*Concepting Designs ONLY DURING Jam Period, meaning I should've done this before the jam started = 3 hours (outfits and a hairstyle)<br/>*Backgrounds = 2.5 hours (.5 hours finding images, 2 hours editing)<br/>*Sprites = 45+ hours (............................ Includes sketching, lining, coloring, shading, and their emotes. EMOTES. Don't get me started on implementing them--)<br/>*Sprite and Character Implementation = 24 hours (this is how long it took to test and write the code ONLY to change their expressions in nearly every single line of dialogue, animations, and whatnot.)<br/>*Visual Effects = 3 hours (Leaves, fireflies, fog, and dust)<br/>*User Interface = 10 hours (3 hours textbox-work, 2 hours jam room-work, 3 hours pocket-work, 2 hours for menu-work)<br/>*Writing = More than two hours every day... So at least 40+ hours (this includes how many times I sat down and ran through the game, cutting double the dialogue you will see in this version.)<br/>*Testing = 20+ hours... I ran through the game from start to finish at least 50 times. I am now unable to tell if my sense of humor is funny.<br/>*Music Composing = 4 hours (for 2 original pieces, hehe)<br/>*Drooling Over Characters = Too much time</p>\n<p><strong>Grand Total: </strong>Way too much time (full-time 140+ hours)</p><p>This does not include making this itch.io game page, editing the game trailer, and promoting/marketing the game. I don't remember how long I spent on those x.x<br/></p>\n</ul>\n<p>For more updates-but-not-really, check my Twitter!<br/>More games: https://mintglow.itch.io/<br/><br/></p>\r\n\r\nHow to play: \r\n<p>1. Download the game with your operating system<br/></p>\n<p>If on PC (Windows): <br/>2. Extract the contents of the .zip file where you'd like <br/>3. Open extracted folder <br/>4. Run the .exe file and enjoy! <br/></p>\n<p>If on Android (yes, you can download and play straight from your mobile device!): <br/>2. Go to your downloaded files and run the .apk <br/>3. Open the app and enjoy!</p>\n<p>If on Mac or Linux:<br/>2. You're on your own. <br/>3. Run the game and enjoy!<br/></p>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T18:12:00", "background_image": "https://media.rawg.io/media/screenshots/aed/aed49e3a3d2f917df2a376bc626f1bd5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["MintGlow"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}