{"id": 860663, "slug": "the-mayfield-plague", "name": "The Mayfield Plague", "name_original": "The Mayfield Plague", "description": "<p>Insert link</p>\n<br/><br/>\n<p><em>Death was slow, feeding into the body until nothing was left</em>\n</p>\n<p><em>Those who showed no sign were suddenly seized with fevers</em>\n</p>\n<p><em>They coughed and shivered, screaming in the darkness like banshees</em>\n</p>\n<p><em>It was terrible to watch as they died soon after, succumbing to the pandemic was terrible.</em>\n</p>\n<p><em>When it spread all over the town, no one stood a chance.</em>\n</p>\n<p><em>No one. Not Mother or Father or Daughter or Son. Not a dog or cat or rooster or cattle. Nothing.</em></p>\n<p>It was the year 1790 in the large, bustling city of Mayfield when the epidemic struck. First, the sailors who docked their ships carried it into the markets where food was bought. Then, the shop owners shook hands with everyone for a good deal. It was only a matter of time before people learned of the terrible disease. \r\n</p>\n<p>The Whispering Paranoia, also known as the Grave Eyes.\r\n</p>\n<p>When the Whispering Paranoia enters Mayfield through the port, no one knows what to make of it until one by one people begin dropping dead. With no idea how it spreads and why it makes its victim grow maniacal and paranoid, the city starts crumbling. The religious cry that it is the end, the rich pack up their bags and leave and the poor are left with no defence. Doctors are left scrambling to each house only to tell those who are afflicted they are doomed.\r\n</p>\n<p>Twenty-one Magdalena Yates is a polished young woman who plans on becoming a teacher in New York. Unfortunately, as the epidemic strikes Poxfield, she is forced to stay inside with her family and take care of Nonie. Her life soon becomes a living nightmare as the disease steals those she cherishes and transforms them into screaming banshees in their beds. But Magdalena doesn’t have much time to mourn, because she is the only one who can take care of her little sister. With the death count rising and no cure in sight, Magdalena’s struggle to teach the masses is soon shattered by her mission to stay alive.</p>\n<p>Authentic 1700s outfits and history!\r\n</p>\n<p>Beautiful character designs and backgrounds!\r\n</p>\n<p>Over 10,000+ words!\r\n</p>\n<p>A linear (with endings) story detailing a girl's survival when she is relied on!\r\n</p>\n<p>Strong female protagonist!\r\n</p>\n<p>No time for love when there’s a fear of contracting an illness!\r\n</p>\n<p>Grotesque details of the Whispering Paranoia!\r\n</p>\n<p>Gross (or beautiful) CG’s!\r\n</p>\n<p>Magdalena Yates</p>\n<p>Magdalena Yates is an outspoken, polished young lady who after her mother's teachings always remains upright and perfect to those around her. She aims to please everyone and ends up being very popular in the city of Poxfield. Struggling with her parent's expectations for her to stay home and take care of Nonie. She is also strongly encouraged to marry the next door's handsome son just because their parents know each other. Despite her polished attitude, she occasionally acts unfeminine by speaking her mind and soiling her outfit if its called for. In the end, she has two personalities that clash constantly. The epidemic brings out the unladylike side of her, especially when Nonie comes first.</p>\n<p>Nonie Yates</p>\n<p>Nonie Yates is an outspoken tomboy with a passion to be whoever she wants to be at the very moment. She refuses to marry anyone and runs around drawing attention and dirty looks. Because of this, she is rarely allowed to leave the house besides attending church. She often is the gossip of everyone in Poxfield who constantly compares her to Magdalena. But Magdalena always makes sure to protect Nonie and be a good older sister. They have a strong sisterly bond that can’t be broken, even by disease.</p>\n<p>Selah Yates </p>\n<p>Selah Yates is the mother who has had a stern tongue ever since her father, Magdalena's grandfather, died in a tragic accident. She criticises Magdalena constantly and always makes sure she is working. To Nonie, she is even harsher, though this is because she is clouded by grief. Despite all of this, she cares deeply for them and will always do so. There are some moments of clarity where Selah will let Magdalena off the hook.\r\n</p>\n<p>Wiley Walters\r\n</p>\n<p>Wiley Walters is the next-door family's handsome son who has a crush on Magdalena. He is sort of intimidated by her strong exterior but loves her dearly from a distance. Magdalena is unsure how Wiley feels about her, and is confused often by his constant flustered expression when she’s around. He’s playful and a good friend to Nonie. \r\n</p>\n<p>Minerva Mayfield\r\n</p>\n<p>Minerva Mayfield is a freed slave who is Magdalena's best friend. She helps those who are sick and has a caring, motherly attitude towards Magdalena and especially Nonie. Despite it all, she keeps her confidence up and is always there to cheer you up. \r\n</p>\n\n\n<p><strong>Creative Director: Oishii\r\n</strong></p>\n<p><strong>Writers: Lila, Quick, anigvit\r\n</strong></p>\n<p><strong>Editors: Ra-Chan\r\n</strong></p>\n<p><strong>Sprite Artist: Fungii Draws</strong></p>\n<p><strong>CG Artist: Mekhfamph \r\n</strong></p>\n<p><strong>Background Artist: William Leighton</strong></p>\n<p><strong>U.I Artist: Verndusk</strong></p>\n<p><strong>Programmers: Donn, PJ Pollina (aeugchad), Tsunami Sushi\r\n</strong></p>\n<p><strong>Composer: PuppetPasta\r\n</strong></p>\n<p><strong>SFX: zapsplat - https://www.zapsplat.com/ , Eric Matyas - www.soundimage.org, mixit - </strong><strong>https://mixkit.co/free-sound-effects</strong><br/></p>\n<p><strong>Voice Actors:\r\n</strong></p>\n<p><strong>Magdalena Yates - Jenna Rose</strong></p>\n<p><strong>Nonie Yates - Meg TheLovableDork</strong></p>\n<p><strong> Selah Yates - Rachel Schumacher</strong></p>\n<p><strong>Tabetha McNeal - Minerva Mayfield\r\n</strong></p>\n<p><strong>Wiley Walters - Jerron Bacat</strong></p>\n<p>NOTE: The file may say \"Don't run,\" just hit more and \"Run anyway\" to play! This game is definitely not a virus. :)</p>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T18:08:15", "background_image": "https://media.rawg.io/media/screenshots/a33/a338592941acba1c8678ebe50aabe575.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oishii"], "genres": [], "publishers": [], "esrb_rating": null}