{"id": 860722, "slug": "the-endless-together", "name": "The Endless Together", "name_original": "The Endless Together", "description": "<p>A short horror visual novel developed for Spooktober Jam 2022! NOTE: Mac version hasn't been playtested as we don't got a Mac to test it with<br/></p>\n<p>In a secluded mansion in the woods, a tired, overworked young maid named Bonnie finds herself alone with Cassiopeia, the daughter of the Lord of the mansion. Having spent her short life mindlessly working herself to the bone, Bonnie is suddenly thrust into Cassiopeia's schemes, and as things at the mansion take a turn of the worse, can she find happiness with the girl of her dreams?</p>\n<p><strong>Content warning: Blood, death, bad drawing skills, some swearing, psychological</strong><br/></p>\n<p>Game Credits:</p>\n<p>Music: bug</p>\n<p>Programming/Scene Direction/BGs: Cammy</p>\n<p>Writer/Character/Sprites: Hag<br/></p>\n<p>Dev Notes: The Endless Together Prototype is a game I made with my friends, mainly inspired by the When They Cry series by R07. There's several things that are not intended to be final because I'd like to expand on this in future and polish it, but I think it's adequate for the game jam. </p>\n<p>- I'm not happy with Bonnie's sprite which I drew myself, especially her eyes. I'd like to redo her design in future.</p>\n<p>-Might redo the visibility of the text in future but unsure how to best proceed just yet<br/></p>\n<p>- The script is pretty truncated, I initially wrote scenes at 2-3 times larger but wasn't happy with the flow and I felt like I shouldn't need so much text for just two characters in the smaller version of this story. I think the end result is a bit uneven and some parts may lack full context but my focus was on emotion and communicating impact and shock rather than a more complex narrative.</p>\n<p>- I haven't written a game like this in a while and got really turned around during the writing process so I'm pretty sure there's spelling and grammar errors that have snuck in. I'll work on the script after release and clean it up and will update this in future. Thanks for understanding. <br/></p>\n\n<p>Length: roughly 9700 words<br/></p>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T18:32:29", "background_image": "https://media.rawg.io/media/screenshots/62d/62dbc1ca808916e8ecdbaea58ec96d3f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["punishedhag"], "genres": [], "publishers": [], "esrb_rating": null}