{"id": 860714, "slug": "offal", "name": "OFFAL", "name_original": "OFFAL", "description": "<strong>PREMISE:</strong>\n<p>The piles of old fallen leaves, pumpkins happily greeting friends, and scary costumes dancing around the city. Its Halloween! Time to party!</p>\n<p>Play as Moriah a tired, anxious, student with a passion for drumming in OFFAL a visual novel set on Halloween. Talk to friends, blow off some steam, and prepare for tonight's festivities. Get ready for a scary good time in OFFAL!<br/></p>\n\n\r\nFEATURES:\r\n<p>- Having fun with uni friends</p><p>- 3 different endings!!</p>\n<p>- Being in a BAND????</p>\n<p>- Confronting your inner demons</p>\n<p>- KETCHUP AND MAYO BEST COMBOOOOOOO</p>\r\nCHARACTERS:\r\n\n<p>A tired anxious business student working as a meat packer. Moriah spends their time drumming and gaming. Ask them about their cool game posters, or their new game they started entirely too late at night. Just don't ask them to sleep on time; it won't work. We tried.</p>\n\n<p>The coolest cat in art history. Kezia is strong willed with unshakeable morals. She also knows how to shred a bass guitar. Just be sure to keep some extra strings when she starts to play. Maybe some safety glasses too.</p>\n\n<p>A happy go lucky soon to be surgeon. Orel tries his best to help everyone around him. He doesn't always succeed but he tries and that's what counts! Just don’t ask him to cook for you; Trust me.</p>\n\n<p>The group mom. Eden plans to start a bakery, she just needs to figure out how to get to the bank website. Till then she always has the oven running in part for the fantastic cookies she bakes and to warm her always cold hands. </p>\n\n<p>Shy and quiet, but watch out she is quick with quips. Irene plans to be a baker at Eden’s bakery. But for now works at the liquor store. It's not much but she gets some great stories out of it. Keep an eye on your toasters though. <br/></p>\r\nCONTENT WARNINGS:\r\n<p>We have both a spoiler and a spoiler free version!!<br/></p>\n<p><strong>SPOILER FREE :</strong></p>\n<p>https://docs.google.com/document/d/1njfsssX1sJt2To35oAVl3E8meLgsMxOspzz-mx8Yq5E/...</p>\n<p><strong>SPOILER:</strong></p>\n<p>https://docs.google.com/document/d/1FW0lJMLQkaA5Dw4RSjpcEe4cNoulQbVRwOENvjtuL8I/...</p>\r\nCREDITS:\r\n<p>DIRECTOR/PROGRAMING/ART: Tan</p>\n<p>WRITING: Tan and RatSalad</p>\n<p>OST: Sher</p>\n<p>A special thanks to our friends and supporters, we could not have done it without you! Y'all make life a little less OFFAL ;]]</p>\n<p>Full SFX Credit:</p>\n<p>https://docs.google.com/document/d/1AAC5NVmGOc56c7AS9GVilhYMahKNIci55h1tGvQ_8zQ/edit?usp=sharing<br/></p>\n<p><strong>SOCIAL MEDIA:</strong><br/></p>\n<p>OFFAL TWITTER<br/></p>\n<p>If you liked this game, check out our other project Epic Fruit Game!<br/><br/></p>", "metacritic": null, "released": "2022-10-01", "tba": false, "updated": "2022-10-03T18:29:23", "background_image": "https://media.rawg.io/media/screenshots/baa/baa4a4d253984218b4da85761a7499f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tan", "Void_Gardner", "moonspeck", "RatSalad71"], "genres": [], "publishers": [], "esrb_rating": null}