{"id": 8609, "slug": "lords-at-war-mmo", "name": "Lords At War MMO", "name_original": "Lords At War MMO", "description": "Lords At War MMO  is #1 strategy game for iOS. <br/><br/>Lords At War strategy MMO presents a unique and innovate style to play various types of war, including a Faction War between Alliance and Fury, guild wars, and wars between kingdoms. <br/><br/>The game takes place in the mythical “World Of Midgard” which is based on Norse mythology. It is a game based on conquest, expansion, and warfare.<br/><br/>In this game you can establish a city, develop various technologies, and build supporting structures to massively generate armies and resources. These things can later be used to attack players and other in-game opponents.<br/><br/>You can build your army, forge your weapons, armor and siege engines, conquer new lands, form guilds, fight epic battles and become the most powerful lord/lady in all the land!<br/><br/>Lords At War is also about making friends, and becoming a part of a guild. Together with other players you will have the chance to make a much stronger defense. In a group it will also be easier crash your enemies.<br/><br/>If you enjoy Norse mythology combined with RTS, empire-building, and MMO gameplay elements then you definitely will enjoy Lords At War MMO.<br/><br/>Lords At War MMO is also available on Facebook.  iOS version of the game allows player to play together with Facebook players or on mobile only servers.<br/><br/>Players who play Lords At War MMO on Facebook can connect to their Facebook kingdom from the iOS version of the game to continue playing while there are away from their computers.<br/><br/>Watch Lords At War MMO &amp;quot;iPad in-hand&amp;quot; preview on Youtube.<br/>http://www.youtube.com/watch?v=Lr7W_koNpZo", "metacritic": null, "released": "2011-12-16", "tba": false, "updated": "2019-10-22T14:30:00", "background_image": "https://media.rawg.io/media/screenshots/a2c/a2c4adf36280942246f52f3d73d2aa6e.jpeg", "website": "http://www.lordsatwar.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Veraxon Entertainment"], "genres": ["Strategy", "Simulation"], "publishers": ["PaidPost"], "esrb_rating": "Teen"}