{"id": 8610, "slug": "dark-lands", "name": "Dark Lands", "name_original": "Dark Lands", "description": "<p>&quot;Dark Lands comes with a bold, moody, silhouetted visual aesthetic&quot;. 4/5 148Apps<br />\n&quot;The inclusion of combat into a side scroller/runner style game serves to add a depth to the game&quot;. 8,5/10 Capsule Computers<br />\nRun through enemies and dangerous traps! Dark Lands is an epic battle runner action game. Develop your hero to survive this infinity battle and run as long as possible!</p>\n<p>Dark Lands is an addictive mix of an infinity runner fantasy horror game with a dynamic combat system. Take your hero on an epic journey of defeating evil forces who corrupted the land.<br />\nBeat enemies like goblins, orcs, skeletons and monstrous trolls and ogres! Fight unique bosses like the fierce Currusor or the deadly Minotaurus!<br />\nAvoid dangerous traps and treacherous corrupted terrain!<br />\nShow other players that you are the best warrior of them all!<br />\nFEATURES</p>\n<ul>\n<li>Overcome the 40 missions of the adventure mode and survive the endless mode.  </li>\n<li>Run and Fight through easy to use controls with sharp reactions!  </li>\n<li>Develop your hero! Improve stats and buy mighty weapons and armour!  </li>\n<li>Fight hordes of fantasy enemies! - Get into epic fights with mighty bosses such as the minotaur or the giant scorpio!  </li>\n<li>Learn to avoid deadly traps and use them in your favour to lure enemies into them!  </li>\n<li>Enjoy beautiful, original, atmospheric music and great sound effects!  </li>\n<li>Artistic silhouette graphics with a changing environment!  </li>\n<li>Unlock more than 50 achievements and write your name in the hall of fame pantheon of Dark Lands.<br />\nFollow us:<br />\nhttps://www.facebook.com/minglegames<br />\nhttps://twitter.com/MingleGames</li>\n</ul>", "metacritic": null, "released": "2014-05-08", "tba": false, "updated": "2019-10-22T14:30:00", "background_image": "https://media.rawg.io/media/screenshots/b10/b108b60df2424a8807dd2a487993efd8.jpg", "website": "http://mingle-games.com/games/dark-lands/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "dropped": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Mingle Games"], "genres": ["Action", "Arcade"], "publishers": ["Mingle Games"], "esrb_rating": null}