{"id": 861009, "slug": "clarity-of-the-crystal-dragon", "name": "Clarity of the Crystal Dragon", "name_original": "Clarity of the Crystal Dragon", "description": "Info\r\n<p>\r\nI have decided, during development, to put up the novel as a DEMO each time I add another chapter, until it is ready to publish. Don't expect the chapter(s) to be polished. The version number tells the latest chapter: 0.1.234, The first 0 tells the novel is not released, 1 shows the number of work-throughs, 234 shows the last chapter in the demo is 23, sub-chapter 4.<br/></p>\r\n\"Back cover\" text\r\n<p>The story is not based on drama and conflict, but loaded with a deep understanding of the human and beyond, and hints at transformative choices in life.\r\n  </p>\n<p>Luzi gets intimate with her crystal dragon as it clears every room in the house of her soul. Only her truth is spared. The ego builds on belief systems that are not truths, but the humanity of it joins in the Unity of all she is. At their first meeting, Luzi crouches under the clarity of the dragon while it declares, \"I Am your BEST FRIEND, well, your ONLY FRIEND, because here is truly only you and I and nowhere to hide! The rest is insignificant, a smear of beingness … Well, mostly. I’m your I Am, or you are my expression as Luzi Cane.\"\r\n  </p>\n<p>A dear friend needs Luzi’s help, family moves from Hong Kong to Ireland, and they make preparations for the son, Li, to enter this world.\r\n  </p>\n<p>Luzi connects to a future self, a conscious Built, not a Grown nor a Mech, who tells about an almost unbelievable future.\r\n  </p>\n<p>Julia turns two years old and touches everyone and everything around her, and the family pets continue to play their role in the local community.\r\n  </p>\n<p>When Li appears in the world, everyone around him must admit, at least to themselves, that their view of life and the world must be totally rewritten.\r\n  </p>\n<p>Even though the book is part of a series, this is a complete story in its own right.<br/>\n</p>\n\n<p>There are five novels in the series. The first novel is \"Name your own price\", and acts as a demo:<br/></p>", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2022-10-03T20:33:36", "background_image": "https://media.rawg.io/media/screenshots/9e5/9e52066b46df474e178381da79284869.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Eriqa-Queen"], "genres": [], "publishers": [], "esrb_rating": null}