{"id": 86101, "slug": "luckys-escape", "name": "Lucky's Escape", "name_original": "Lucky's Escape", "description": "Help Lucky the rabbit solve puzzles in concocted lab experiments to keep his unwitting captors happy while he secretly plots his escape.<br/><br/>Lucky:<br/>Focus Lucky’s newly acquired telekinetic abilities to activate numerous gadgets and navigate through obstacle courses scientists have set up to test his skills.  Manipulate his world by having him blasted out of cannons, blown by fans, attracted to magnets, swung from rubbery toy sticky hands, and launched from sling shots all controlled by his mind… with the help of a secret formula and an experimental brainwave helmet. The scientists reward Lucky with carrot cake when makes it to the end of the experiments without running into mines, fire, buzz saws, spikes and other crazy obstacles. If Lucky runs into these obstacles, he reacts with hilarious animations and then bounces back to try again with a quip like “Practice makes perfect. That one was practice and this one’s going to be perfect!”  Nothing can defeat Lucky. He survives every mishap and is always happy to give it another try until he gets it right.  There are often many ways Lucky can solve the different puzzles.<br/><br/>Rockets:<br/>The dim witted mad scientists are so focused on how Lucky does in their tests that they have no idea that he is building a rocket to escape.  By collecting blueprints that have been left around the lab, Lucky is building a rocket to bust out.  Throughout the game he is continuously upgrading his rocket and preparing to take his next flight. Can you collect all three blueprints in each puzzle to try and build the ultimate escape rocket?<br/><br/>Costumes:<br/>Collect coins along the way to customize Lucky’s appearance. Dress him up in silly hats, glasses, wigs, shoes, backpacks and more, sometimes just to hear what he has to say about them.  He can be a scuba diver, astronaut, clown, explorer… there are hundreds of crazy get-ups and combinations.<br/><br/>Lucky’s Escape:<br/>Through it all, Lucky’s got his eyes on the prize – Freedom! Help Lucky bust out of the lab and away from the absent-minded scientists in this light hearted, fun, tricky and mind-bending physics puzzler!", "metacritic": null, "released": "2012-11-08", "tba": false, "updated": "2019-10-22T14:21:36", "background_image": "https://media.rawg.io/media/screenshots/0fd/0fdb39da3fa62baca1fc62a82db3121b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lemon Games"], "genres": ["Action", "Puzzle"], "publishers": ["Lemon Games"], "esrb_rating": "Everyone 10+"}