{"id": 86102, "slug": "my-outer-space-puzzle-explorer-puzzles-for-kids-an", "name": "My Outer Space Puzzle - Explorer Puzzles for kids and toddlers", "name_original": "My Outer Space Puzzle - Explorer Puzzles for kids and toddlers", "description": "Go with us on a discovery journey an explore the fantastic world of stars and planets!<br/><br/>Let your kids and toddlers discover the amazing world of stars and planets with this cute app - Try it now for FREE!<br/>The perfect children's puzzle with beautifully illustrated outer space graphics and animations. The cute outer space puzzle promotes hand-eye coordination, logical thinking and your child's memory skills.<br/><br/>„Does the rocket match this shape?“ - Let your kid discover it!<br/><br/>CONTENT:<br/>- Universal App for iPhones, iPads and iPods!<br/>- Children Safe – WITHOUT DISTURBING ADVERTISING!<br/>- SAFE PLAY – The parents area can only be activated by entering a number. Thus, parents have more security and control!<br/>- Different REWARDS!<br/>- You can unlock a BONUS-PUZZLE by rating the app!<br/><br/>Do you and your child like the puzzle? With only one InApp purchase you can unlock the full version with a lot more content (all puzzles and more reward effects)!<br/><br/>Our promise to you: All our apps are developed with certified educators and renowned illustrators in cooperation with young parents and children!<br/><br/>If you have questions or are interested how we develop our apps with children and young parents, send an email to: info@mcpeppergames.com", "metacritic": null, "released": "2013-11-12", "tba": false, "updated": "2019-10-22T14:21:36", "background_image": "https://media.rawg.io/media/screenshots/896/896887532de99185828a0c98f5b9b029.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["McPeppergames UG (haftungsbeschraenkt) & Co. KG"], "genres": ["Puzzle"], "publishers": ["McPeppergames UG (haftungsbeschraenkt) & Co. KG"], "esrb_rating": null}