{"id": 861011, "slug": "lainoba", "name": "Laïnoba", "name_original": "Laïnoba", "description": "<p><strong>Laïnoba </strong>est un projet étudiant. C'est un prototype réalisé en trois jours et retravaillé par la suite visant à créer une atmosphère et une ambiance propre à un univers créé en une semaine. Le prototype ne représente qu'une petite partie du scénario jouable, se situant dans le premier tiers du jeu.</p>\n<p><em>Lancez le jeu en mode plein écran sur navigateur, ou téléchargez la version exe pour la meilleure expérience.</em></p>\n<p><em>Des bugs subsistent dans ce prototype, la réparation du Yak est pour l'instant impossible, aussi faut-il demander de l'aide lorsque le choix vous est proposé.</em><br/></p>\n<p>This is a student project, it's a prototype version showing the atmospheric ambience, and only a small part of the full story.<br/></p>\n<p><strong>Text is in french only.</strong></p>\n\n\n<p>Hichame Oukdim - Animation, Code, Game Design, World Building</p>\n<p>Léo Mirland - Art, Musique, Écriture, UI/UX design, Narrative Design, World Building</p>\n<p>Pierre Billaud - Code, World Building</p>\n\n\n<p>Terre, 10.000 ans après notre ère, région d’Aïch. <br/></p>\n<p>L’Usine tourne, comme elle a toujours tourné et comme Jeraï l’a toujours connue. L’Usine alimente en énergie la ville de Laïnoba, située à une dizaine de kilomètres de là, et produit la nourriture de synthèse - la nutra - et les dermas, combinaisons nécessaires à la survie dans le monde extérieur. L’atmosphère est devenue toxique et irrespirable pour les humains au fil des millénaires, en plus d’être d’une composition empêchant toute communication par ondes radio. Toute la végétation de la région a disparu, à l’exception d’un seul endroit : Jah’Nah. Il s’agit, avec l’intérieur des appartements de Laïnoba, du seul endroit où l’air est encore respirable.</p>\n<p> Les personnes âgées ayant consacré la majeure partie de leur vie au travail attendent un moment plus que tout : le Pèlerinage, où un membre de l’Association viendra les chercher pour les accompagner vers Jah’Nah, alors ils pourront profiter d’une vie meilleure. Il s’agit d’un réel honneur que beaucoup de gens contemplent avec envie. Jeraï est un membre dévoué de l’Association, et se prépare à effectuer un Pèlerinage avec Ben, un ancien ayant gagné accès à Jah’Nah.</p>\n<p>Pendant le voyage, le duo va rencontrer Noah, une Sak’Lraum qui sèmera le doute sur les convictions de Jeraï. Ses révélations sur Jah’Nah, le fonctionnement réel de l’Usine et le vrai but des Pèlerinages sont-elles vraies ou de terribles affabulations ?</p>", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2022-10-03T20:34:25", "background_image": "https://media.rawg.io/media/screenshots/391/391511a89ab30526301c949b17ff256e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["NotFrogga", "Léo Mirland", "LeBioman"], "genres": [], "publishers": [], "esrb_rating": null}