{"id": 861244, "slug": "ramira", "name": "Ramira", "name_original": "Ramira", "description": "<p><strong>En el tutorial se ven unos cuadrados blancos. <br/>Esto es que hice unos cambios en el sprite de Ramira y se me olvidó cambiarlos ahí. Así que donde hay cuadrados blancos, imaginaos a Ramira.<br/><br/></strong></p>\n<p><strong>También se me olvidaron las etiquetas en el panel de ajustes. <br/>El primer slider es para la música y el segundo para los efectos.</strong><br/></p>\r\nEl juego\r\n<p>Ramira es una anciana que vive en medio de un bosque mágico alejado de todo.<br/>Ya no tiene familia y se siente sola y triste.\r\n</p>\n<p>Pero su presencia en ese lugar no es bien recibida:<br/>¡Las criaturas mitológicas del bosque están tratando de destruir su casa!<br/>Solo podrá podrá detenerlas si les da lo que necesitan.</p>\n<p>Y tal vez, ellas le den a cambio el amor y compañía que tanto echa en falta.</p>\n<p>Ayuda a esta entrañable ancianita a proteger su casa y hacerse amiga de las criaturas.</p>\r\nIdiomas\r\n<p>El juego está traducido al Español y al Gallego. Elige el que quieras desde el menú de ajustes.</p>\r\nEl Lore\r\n<p>Las criaturas presentadas en este juego pertenecen a la mitología gallega.</p>\r\nLamiahttps://gl.wikipedia.org/wiki/LamiaUrcohttps://gl.wikipedia.org/wiki/UrcoGatipedrohttps://gl.wikipedia.org/wiki/GatipedroTardohttps://gl.wikipedia.org/wiki/Tardo\r\n\r\nEl tema\r\n<p>\"De 0 a 100\" es la cantidad de amor que debes obtener para ganar.<br/></p>\r\nEl desarrollo\r\n<p>Durante la semana de la jam solo he podido dedicar las tardes.<br/>El sábado me di cuenta de que no iba a poder buscar ni hacer música y efectos asi que todo este apartado se lo debemos a Pedro, que me ayudó y se \"carrileó\" el crear y buscar todo lo necesario en, prácticamente, un día.<br/></p>\n<p>Programación, arte y diseño: Enmanuel Valencia (@nenreiDev)</p>\n<p>Música y sonido: Pedro Astasio (@Pedro_Astasio)</p>\r\nDisclaimer\r\n<p>En el juego se presenta regalar gatos como una forma de llevarte bien con alguien.</p>\n<p>Quiero dejar claro que en ninguna circunstancia creo que un gato sea ni pueda ser usado de tal forma en la vida real.</p>\n<p>Es solo que la idea de \"darle\" un amiguito a alguien para que sea feliz me pareció graciosa.</p>\n<p><strong>Fuente:</strong> https://www.dafont.com/faraco-hand.font</p>", "metacritic": null, "released": "2022-09-20", "tba": false, "updated": "2022-10-03T22:04:31", "background_image": "https://media.rawg.io/media/screenshots/531/531c75699d604b1cd84e082e669f94b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Circulito", "Nenrei"], "genres": [], "publishers": [], "esrb_rating": null}