{"id": 8612, "slug": "stay-mum", "name": "Stay, Mum", "name_original": "Stay, Mum", "description": "* NOTE: Download size is ~80 MB *<br/><br/>---<br/><br/>&amp;quot;As a fan of puzzle games, I’m loving Stay, Mum...&amp;quot; - 4.5/5 AppAdvice<br/><br/>&amp;quot;Stay, Mum gets big points for its heartfelt presentation...&amp;quot; - 148Apps<br/><br/>&amp;quot;Stay, Mum is a tear-jerker...&amp;quot; - Kill Screen Daily<br/><br/>&amp;quot;...one of the best Best Mobile Games of 2015&amp;quot; - TechRadar<br/><br/>&amp;quot;...beautifully designed heartbreaking puzzle.&amp;quot; - iPlayApps.de<br/><br/>---<br/><br/>Stay, Mum is an ordinary story about John, a young boy with an extraordinary imagination and his mother, who is busy trying to make a living for the two of them.<br/><br/>Stay, Mum will let you manipulate different blocks to form surreal shapes out of John’s wild imagination and explore the bittersweet relationship of John and his mother.<br/><br/>John means the world to his mother. But to meet their needs, his mother has to work very hard. So hard that she never finds time for him.<br/>John’s loneliness is only cured by different blocks given to him by his mother. Why does the mother give him building blocks and what purpose do they hold?<br/><br/><br/>ELEGANT<br/>Minimalist and gorgeous visuals accompanied by smooth ambient sounds to lure you in. <br/><br/><br/>EASY TO PLAY<br/>Tap and move the blocks around to form shapes based on the outline shown before each level. When satisfied, tap a button to make them fall on the platform. <br/>But - make sure they stay in shape when they hit the floor!<br/><br/><br/>IMAGINATION IS THE LIMIT<br/>Meet John’s friends as he imagines all sort of different beings in his 7 blocks, each with their own visuals and behaviour.<br/>Use them at your aid to achieve complex shapes in more than 70 levels!<br/><br/><br/>LEARN THE TRUTH<br/>John’s mother leaves him different mysterious blocks to play with, to distract him from the fact that she has no time for him. <br/>Learn the truth about why his mother has no time for her only son and how are the blocks going to help him.<br/><br/><br/>iCloud<br/>Play on one iOS device and synchronize your progress across all your iOS devices automatically.", "metacritic": null, "released": "2015-10-28", "tba": false, "updated": "2019-10-22T14:30:00", "background_image": "https://media.rawg.io/media/screenshots/e75/e751c9369236553aa7ea25eeff7f30eb.jpeg", "website": "http://www.lucidlabs.in/press/sheet.php?p=Stay,%20Mum", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Lucid Labs"], "genres": ["Adventure", "Puzzle"], "publishers": ["Lucid Labs Private"], "esrb_rating": "Everyone 10+"}