{"id": 861358, "slug": "dread-2", "name": "Dread", "name_original": "Dread", "description": "Dread is first-person 4 player online co-op survival horror game. Explore haunted environments ranging from abandoned manors, the underground catacombs below Paris, abandoned schools and more in realistic detail. Investigate, find evidence and get out to get paid.. Or stay and figure out how to cleanse the location of the spirit. No two games are ever the same as each spirit has it's own unique abilities. The locations change becoming more dangerously terrifying the longer you stay but the payouts are also greater.<br/><br/>Some locations allow you to roam outside of the haunted environments in safety and play a supportive role. Sometimes the safest play isn't actually safe at all..<br/><br/><strong>Realistic Terror</strong>: Dread was built from the ground up around realistic graphics and minimal user interface for full immersion. This will feel too real.<br/><strong>Interactive</strong>: Most things in the world of Dread are interact-able. Open everything in the search for clues. Leave no stone un-turned.<br/><strong>Cross platform</strong>: Dread allows VR and flat screen players to enjoy the game together.<br/><strong>Never the Same Game Twice</strong>: Locations change in different ways as the investigation intensifies. While poltergeists will throw things around more and more the angrier they get. A demon may reveal the grisly details of the location's past.<br/><strong>Trust No One</strong>: Sometimes death isn't the end. A spirit may decide to possess a victim instead of adding their soul to the location's list of victims. A possession victim must eliminate the remaining investigators before they can escape.", "metacritic": null, "released": "2022-10-04", "tba": false, "updated": "2022-10-07T05:01:38", "background_image": "https://media.rawg.io/media/screenshots/1f0/1f037945203bb17cc1734c6a9b8485ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pale Horse Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Pale Horse Studio"], "esrb_rating": null}