{"id": 861308, "slug": "sagger", "name": "Sagger", "name_original": "Sagger", "description": "Sagger is a historical strategy simulator where you stand in the position of the commander-in-chief during the Yom Kippur War.<br/>\r\nYour decisions will lead you to victory and glory of Israel or significant loss and nuclear catastrophe!!<br/>\n<br/>\r\nIn Sagger, you can decide and play the \"WHAT IF..\" game<br/>\r\nNo more guessing is needed!<br/>\n<br/>\r\nSagger is first a kind base on historical facts decision-making simulator,<br/>\r\nWhich allows you to check how a single decision would impact war results.<br/>\n<br/>\r\nYou will struggle with time, incomplete information from the battlefield, and a tremendous sense of responsibility for the country's future.<br/>\n<br/>\r\nWill you prove to be a great leader like Golda Meir? Now it's your turn!!<br/>\r\nWill you be able to make good decisions with the knowledge you got?<br/>\n<br/>\r\nPROVE YOURSELF!!<br/>\r\nTake the lead and command the Israeli army through the actual historical events of the Yom Kippur War in our interactive strategy simulator system.<br/>\n<br/>\r\nSagger allows you to walk trough historical path of Yom Kippur War, same as all putative ones.<br/>\n<br/>\r\nIt starts September 13th and goes trough all battle decisions made during Yom Kippur War, and all \"WHAT IF...\" scenarios.<br/>\r\nThis simulator will show you how your single decision would impact war result.<br/>\n<br/>\n<br/>\r\nThe exploration of Sagger's HUGE historical database will show you all the events from Yom Kippur War.<br/>\n<br/>\n<br/>\r\nThis knowledge database got 5 categories that you can explore:<br/>\r\n*People<br/>\r\n*Military<br/>\r\n*History<br/>\r\n*Tactics<br/>\r\n*Geopolitics<br/>\n<br/>\n<br/>\r\nReport Database<br/>\n<br/>\r\nWhile things change on the battlefield, you will receive reports from generals on all fronts.<br/>\n<br/>\r\nYou will be able to learn to use the acquired information and make good decisions based on it.<br/>\n<br/>\r\nDue to Sagger's historical accuracy and its entertaining form, this is the best way to learn about the history of the Yom Kippur War.<br/>\n<br/>\r\nYou can check your progress with a detailed map of the Israeli military movements during the Yom Kippur War, based on actual staff maps!<br/>\n<br/>\r\n• Unites movement are based on your decision<br/>\r\nAfter making a decisions, the units follow your orders.<br/>\r\nYou will see the consequences of your leadership in real time.<br/>\n<br/>\r\nMake Your own decision and lead israeli army to victory or defeat in the Yom Kippur War.<br/>\n<br/>\r\nOur focus is on fun to play but also on historical accuracy. We strive for this game to faithfully present and follow the actual events, battles, politics and real historical characters. The game will let you make decisions the way actual Israeli high command had to make them.", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-07T04:02:27", "background_image": "https://media.rawg.io/media/screenshots/0e7/0e7b83c4a27d4cb1ae9cc12638f0140f.jpg", "website": "https://sagger.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 308, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Media Alliance Gaming Studio"], "genres": ["Strategy", "Simulation"], "publishers": ["Media Alliance Gaming Studio"], "esrb_rating": null}