{"id": 861395, "slug": "light-kin", "name": "Light Kin", "name_original": "Light Kin", "description": "<ul><li><strong>Dance among embers</strong> - fly, dodge and pickup embers of varying colors as you fly up though the smoke of a blazing bonfire!<br/></li><li><strong>Never the same</strong> - the game is ever changing as everything gets generated on the beat. Behold the mesmerizing patterns they create!<br/></li><li><strong>Discover the embers</strong> - some embers are dying to meet you as they try to take your light for themselves.</li></ul><br/><ul><li><strong>Bursting</strong> - burst to release the stored embers in an explosion of colorful fireworks to rack up your score. Repel the embers around you and give yourself some time to breathe!<br/></li><li><strong>Multiply at own risk</strong> - burn brighter by keeping the kin within to grow your power but with great power comes great responsibility!</li></ul><br/><ul><li><strong>Everburning embers</strong> - gain a random powerup as you can shield yourself from harm or burst infinite to bring your score to new heights!<br/></li><li><strong>Leaderboards</strong> - burn your mark to secure your spot on the leaderboard, beware as the whole world will try to come for your crown!</li></ul><br/><ul><li><strong>Adaptive music</strong> - listen closely as the music adapts to what is happening on screen. If the drums kick in, you know you're in for the real deal!<br/></li><li><strong>Color blind support</strong> - see the game through a different lens as there are several overlay settings for different types of colorblindness making the game more accessible.</li></ul><br/><br/><br/>", "metacritic": null, "released": "2022-10-05", "tba": false, "updated": "2022-10-07T05:47:16", "background_image": "https://media.rawg.io/media/screenshots/f99/f995418c60476052c1e5a47ffd34e61c.jpg", "website": "https://www.boxsun.eu/lightkin", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 252, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Boxsun"], "genres": ["Action", "Indie"], "publishers": ["Boxsun"], "esrb_rating": null}