{"id": 861370, "slug": "1428-shadows-over-silesia", "name": "1428: Shadows over Silesia", "name_original": "1428: Shadows over Silesia", "description": "Shadows over Silesia is a dark action adventure game with fantasy elements set in real medieval Europe. With true historical events in the background, you'll be facing intricate puzzles, challenging battles and cunning stealth. You will come across possessed devil worshipers, sexual demons, and beasts from hell, as well as creatures well-known from European mythology.<br/><br/><h3>Dark fantasy story</h3>Europe is in the middle of religious upheaval and many preachers predict that the end of the world is near. The year is 1428 and the Hussites have just set out on their Silesian campaign. These heretics appear to be the biggest threat in the kingless country. But true evil of a completely different kind is lurking nearby and it does not intend to engage in religious disputes.<br/><br/><br/>You will experience everything from the point of view of the two main characters. Hynek, a grumpy Hussite hetman who doesn't hesitate to swear or mess around with anything, and Lothar, a Hospitaller knight, a man of good education and manners who stands alongside his brethren in the front line of the Silesian defense. Each has their own motivations and views of the world around them, and different equipment and abilities. Their fates will soon become intertwined. Will they face one another, weapon in hand, or forge a fragile alliance to stand shoulder to shoulder against a far worse enemy?<br/><br/><h3>Challenging puzzles</h3>The original puzzles you will come across on your dangerous journey will most definitely be tough. Classic adventure games of the 1990s were a big inspiration. You will have to take advantage of your surroundings, look for objects, obtain information, and solve puzzles or encoded messages. Some problems can be solved in multiple ways, or they can be cleverly worked around.<br/><br/><br/><h3>Sneaking in the shadows</h3>Sometimes you'll have to blend into the shadows and sneak past enemies to avoid being detected. Following their patrol routes and habits will help you find the best path.<br/><br/><br/><h3>Tough combat</h3>The combat system is easy to understand but it takes practice to fully master it. Remember one thing: being outnumbered is a problem! If three or more opponents attack you at the same time, you will die! The key is to take advantage of their mistakes, wait for the right moment, and then attack. You will face not just knights, villagers, and robbers, but also various supernatural beings who are not to be underestimated.<br/><br/><br/><br/><br/><strong>THE GAME IS FULLY BLIND ACCESSIBLE. More information on the game's website - https://blind.shadows1428.com.</strong>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2024-02-27T10:25:39", "background_image": "https://media.rawg.io/media/screenshots/b24/b241ceb7941671692a2c458e01d8f91f.jpg", "website": "https://shadows1428.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 7, "dropped": 1}, "playtime": 18, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 426, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["KUBI Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["KUBI Games"], "esrb_rating": null}