{"id": 861389, "slug": "deck-adventurers-ii", "name": "Deck Adventurers II", "name_original": "Deck Adventurers II", "description": "Deck Adventurers II blends deck building with tactical combat for a fantasy JRPG experience. Your adventure starts in a world full of dangers and mystique as you craft your deck, upgrade your cards, and assemble your party of heroes for any challenges ahead! <br/><br/>Recruit New Heroes and Helpers: recruit new heroes and helpers in your adventure and combine their cards/skills to create different groups of strategies. <br/><br/>Unlocking New Cards and Effects: enhance your decks by defeating enemies and unlock new cards &amp; effects as rewards.  <br/><br/>Characters Level Up: The heroes gain experience with each fight and level up to increase characteristics. The new levels give heroes an additional \"upgrade\" to apply to their cards.<br/><br/>Turn-Based Tactical: based on a squared grid that each turn the characters perform a movement and then up to two actions. The possible actions for the player are based on a card system similar to Slay the Spire where you have a rotating deck. The strategy is based on:<br/><br/>-      Choose the two heroes that you think are most suitable for the combat <br/>-      Optimize their decks and adapt to specific abilities of enemies.<br/>-      Use grid positioning to your advantage.<br/>-      Play the cards of your actions in the most efficient way.<br/><br/>Traditional JRPG Gameplay: move freely and being able to talk to characters and discover new missions in this fantasy JRPG world. Engage in combat with various creatures and move your adventure forward!", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-07T05:40:14", "background_image": "https://media.rawg.io/media/screenshots/652/6528ae1a580f6e4294bdbbecce42a4b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Junjo"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Surefire.Games"], "esrb_rating": null}