{"id": 861388, "slug": "rivalia-dungeon-raiders", "name": "Rivalia: Dungeon Raiders", "name_original": "Rivalia: Dungeon Raiders", "description": "Have you ever imagined waking up and discovering that you were trapped in a space-time loop with 3 complete strangers? I'm sure you have. Well sharpen your sword, refill your quiver, drink a mana potion and get ready, because you'll need it if you want to defeat the \"not at all evil jester\" and his entourage of horrifying monsters that have taken control of Rivalia Castle.<h3>4 MAIN CHARACTERS, 1 VILLAIN</h3>In this comical Roguelite adventure and single-player ARPG, you will control 4 main characters in their quest to end the curse of Rivalia and return the kingdom to normal. You will take control of one of them, being able to switch characters at any time. But you won't fight alone, your allies will fight side by side with you in epic real-time battles!<br/><br/><br/><strong>Ashelin</strong><br/>Are you one of those who prefer to lash out? Ashelin won't disappoint you. Unleash your inner demon and sow chaos among your enemies with powerful slashes and demonic powers that will allow you to absorb their souls.<br/><br/><br/><strong>Halmor</strong><br/>Looking for speed and dexterity? Don't hesitate to call Halmor. Combine the best of agile melee combat with the safety of ranged combat and defeat enemies in the rear with your great speed.<br/><br/><br/><strong>Yhorm</strong><br/>Want to see yourself surrounded by enemies and laugh at them for not even being able to move you? Yhorm is the right choice. Take advantage of this giant's tougthness and taunt the enemies around you to protect your allies.<br/><br/><br/><strong>Evanya</strong><br/>Would you rather play it cool and let your allies do the dirty work? Evanya is your choice. Thanks to the power of the elements, your goal will be to help your allies with healing, shields and causing altered states to your enemies.<br/><br/><br/><strong>Ciceron</strong><br/>So what would a great story be, without a crazy villain to set it off? To Evanya, he's nothing more than a jester. To Ashelin, a demon to hunt down. But for everyone, he has become the main target to bring Rivalia back to normal.<br/><h3>FIGHT TO SAVE THE KINGDOM</h3><br/><strong>Chaos in the procedural dungeons</strong><br/>Rivalia's castle has become the playground of a demonic jester, and it can only mean one thing.... Get ready to get involved in a complete chaos in which you will go through huge procedural dungeons full of traps and challenges, among which you can explore a colossal and imposing castle, gloomy graveyards full of majestic mausoleums and dark caverns of fire and lava... Sounds like fun, doesn't it?<br/><br/><br/><strong>Take down the enemies of the kingdom</strong><br/>And what would an RPG be without a bunch of enemies to beat up? Warriors made of calcium, mischievous little devils, giant boxing turtles.... All sorts of unimaginable enemies will serve the jester and defend their territory, even dinosaurs have been spotted in the stables! Epic battles are guaranteed!<br/><br/><br/><strong>Defeat the guardians</strong><br/>The entourage under Ciceron's command is not composed solely of weak minions. His guardians, creatures of great power with unique combat mechanics, will protect each of the dungeons and offer a great final challenge. Will you be up to the task?<br/><br/><strong>Loot, forge and strengthen yourself</strong><br/>Defeat enemies to create equipment using their own materials. You can also combine this equipment to obtain a variety of powers and use them against your foes. How cruel... Are you sure the jester is the bad guy in this story?", "metacritic": null, "released": "2022-10-05", "tba": false, "updated": "2022-10-07T05:38:49", "background_image": "https://media.rawg.io/media/screenshots/849/8492c3be657ab6f2b19ddf2c91867a96.jpg", "website": "https://fsixgames.wordpress.com/2021/01/22/rivalia/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fsix Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Fsix Games"], "esrb_rating": null}