{"id": 861328, "slug": "monster-outbreak", "name": "Monster Outbreak", "name_original": "Monster Outbreak", "description": "The Dimensional Orb was a promise of wealth and knowledge beyond humanity's wildest dreams, hidden away from all until it was discovered and brought to the king. Being human, the king was easily tempted, and for a time the promise held true. Riches, knowledge, and incredible stories flowed into the Kingdom thanks to the Orb… but then came the monsters.<br/>Lots and lots of monsters.<br/><br/>Monster Outbreak is a pixel top-down survival game. Take control of Yulia, the last surviving member of the Royal Guard, and confront the endless monster hordes spawned by the out-of-control Dimensional Orb. Gear up, prepare defenses, lay down traps, cook a possible last meal, and try to stay alive.<br/><br/>Go at it alone - or enlist fellow survivors, using classic local split screen or online multiplayer.<br/><br/><br/><br/>The last stand of the Royal Guard isn't over - until it's over.<br/><br/><ul><li>Yulia has access to a broad range of weapons to be enchanted, from simple swords and axes to sophisticated bows providing elemental attacks, dealing additional damage and opening new ways of containing the endless waves of enemies.<br/></li><li>Build up those defenses! Choose from dozens of turrets, including the bomb-javelin launcher, crossbow turret, and bomb slingshot to set up lethal defensive zones.<br/></li><li>Keep hordes of dimensional horrors at bay with a selection of traps to deploy including spike strips, tripwire bombs, and elemental traps.</li></ul><br/><br/><br/>If the fort holds (big “if”), send Yulia into the fray beyond its protective shell and clash with the monster hordes.<br/><br/><ul><li>Each wave, eventually, peters out. Use the lull in combat to fix up the base - or venture out, explore, fix bridges, and scavenge the derelict Kingdom.<br/></li><li>Hunt down monsters for essential components to craft weapons and items to increase the chances of survival - but watch out for brutal bosses that can decide to crash your party at the worst possible moment.</li></ul>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-14T13:37:24", "background_image": "https://media.rawg.io/media/screenshots/e5c/e5c9a46323309e0c18661c348af23ebd.jpg", "website": "https://gamemunchers.com/monster-outbreak/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 166, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GameMunchers"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["Freedom Games"], "esrb_rating": null}