{"id": 861437, "slug": "healtreach-fan-game-1-heal-tries-vr", "name": "Healtreach Fan-Game 1: Heal Tries VR", "name_original": "Healtreach Fan-Game 1: Heal Tries VR", "description": "Healtreach Fan Game 1: Heal Tries VR (Not a VR Game)<br/><br/>The plot of the story is about Healtreach trying VR for the first time. He will be playing a horror game in which he needs to save a town from an Evil Lord, but things take an unexpected turn.<br/>Somehow Healtreach has gotten a Reality Jumping VR-Headset, and has now been transported into the game world. What once was entertainment turns reality and now Healtreach needs to save the town, not just for the people, but so that he can return home.<br/>In the eyes of the now real danger Healtreach will need to go and gather four pieces of an artifact in order to fight the Evil Lord.<br/>Fortunately Healtreach won't be alone. He will have the help of three new friends, and a mysterious lady, to win his upcoming battle<br/><br/>This is the story of how Healtreach saved the town with the help of his new friends and the mystery of how he got this weird Realty Jumping VR-Headset<br/><br/>I hope to give you a small distraction from life<br/><br/>------------------------------------------------------<br/><br/>Healtreach Fan Game 1 is my first game ever. This is a game made for my friend, and Twitch Streamer, Healtreach.<br/>It is made using the program RPG Maker MV.<br/>It is a simple Pixel top down game with a linear storyline<br/>Offers around 2-4 hours of gameplay<br/><br/>-------------------------------------------------------<br/><br/>I am a single game maker and if you wish to know more about me you can check out my website where you are also able to learn more lore and catch up on my current and future projects and read my blog", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T06:38:49", "background_image": "https://media.rawg.io/media/screenshots/9ac/9ac989de2a9980d98bc4250d01a76da4.jpg", "website": "https://www.slightlycrazystudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Slightly Crazy Studio"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["Slightly Crazy Studio"], "esrb_rating": null}