{"id": 861444, "slug": "federation77", "name": "Federation77", "name_original": "Federation77", "description": "<strong>Federation77</strong> is a brutal and dynamic VR shooter in various arenas in a post-Soviet cyberpunk setting that brings the concept of violence and drugs to the forefront. <br/><br/>2077, the city of M, the territory of the Federation. The country is still reeling from a war it started. You are a cyberpsycho, whose program has crashed due to a  \"Taras-Kulish\" fatal error that encourages you to kill. It's time to clear the streets of dirt.<br/><br/><br/><br/><strong>Main features:</strong><br/><br/><ul><li>Ultra violence is the goal<br/>Violence is a core game concept in which killing enemies and dismembering them is the only way to the top of the leaderboard.<br/><br/></li><li>Doping = life<br/>Use various stimulants to survive in this world of anarchy and make your life sparkling with new colors.<br/><br/></li><li>High dynamic combat<br/>Adrenaline-fueled firefights will not let you get bored. For a successful game session you constantly have to move, kill enemies and dodge bullets.<br/><br/></li><li>Set of game modes<br/>There are several different game modes in the game, which give your unique experience and are woven into the narrative of the game.<br/><br/></li><li>Variety of the game content<br/>A diverse arsenal with the different types of weapon behavior, different enemy factions with their own features, the set of game maps.</li></ul><br/>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T06:47:05", "background_image": "https://media.rawg.io/media/screenshots/214/214d248c292a6d13f767d0c141779a9b.jpg", "website": "http://mirowin.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 549, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MIROWIN"], "genres": ["Action", "Adventure", "Sports", "Indie"], "publishers": ["MIROWIN"], "esrb_rating": null}