{"id": 861401, "slug": "chuhou-joutai-3-three-nights-of-scarlet-abscess", "name": "Chuhou Joutai 3: Three Nights of Scarlet Abscess", "name_original": "Chuhou Joutai 3: Three Nights of Scarlet Abscess", "description": "<strong>Pandemonium will break loose if you don't unleash your rage.</strong><br/><br/>Time will refuse to forget the horrifying, bloody destiny the Kozanese Royal Family has gone through. And the civil war in Kozan is being prolonged by SPASDOT's efforts to eliminate the monarchy. Their leader, Fred Fawkes, has gone into hiding and never to be seen by anyone who isn't affiliated with SPASDOT. Hearthcliffe has brought in his distant cousin, the vampiress Violetta Scarlet, alongside three others with one simple goal in mind: eliminate Susumu Takajima. But he will never allow that to happen! To confront this dangerous organization, he is in need of additional help.<br/><br/>As the battle unfolds, four individuals are now in the Unforgettable. Only half of them are experienced but are bold. The leader, Susumu Takajima, is a fighter-in-training who has defeated SPASDOT twice. Another, Ryuta Shigematsu, appears to be an archer practicing kyudo who is now going to use his skills against SPASDOT. Two girls that stand by their side are Kagami Ochiai and Kumiko Uchida - both of whom are apprentice magicians trained by the Kozanese Royal Family. The new recruits have been foretold some time ago. Whether you're alone or with a friend, you must swim through the sea and forests, evade more danmaku, and defeat Violetta Scarlet!<br/><br/>This is the world's most powerful danmaku game.<h3>Features</h3><ul><li>Retro-inspired graphics influenced by the golden era of arcade games<br/></li><li>Four playable characters with a co-op mode<br/></li><li>Simplified gameplay for newcomers, as well as easy to learn and intuitive controls<br/></li><li>Hilarious dialogue with a brand new anime-inspired art direction</li></ul>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T05:54:06", "background_image": "https://media.rawg.io/media/screenshots/50f/50f880bc3e87516144a67c62ff976453.jpg", "website": "https://drillimation.com/chuhou-joutai-3-three-nights-of-scarlet-abscess", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Drillimation Systems"], "genres": ["Action", "Indie"], "publishers": ["Drillimation Systems"], "esrb_rating": null}