{"id": 861546, "slug": "aprendendo-libras", "name": "Aprendendo Libras", "name_original": "Aprendendo Libras", "description": "<p>O jogo começar com a apresentação da tela de menu e apresentará terá três botões no qual o jogador optará em pressionar: O botão de start com o símbolo de play, o botão de sair com o símbolo de X e o botão de troféus que estará localizado no canto superior direito da tela. Apertando o botão de play disponibilizara opção de escolher os minijogos: O Primero de matemática no qual o jogador responderá uma sequência de questões de adição e subtração onde terá três variações de dificuldade para escolher e ganhado troféus baseados em quantas fez. O Segundo de Ligar objeto com sinal em libra em que o jogador terá que analisar e arrastar o quadro com palavra em libra para o quadro correspondente ao objeto. Nesse jogo será disponibilizado três variantes com palavra em libra e objetos diferentes para serem ligados. Ganhará troféus baseados na quantidade de variantes desse jogo completas. O Terceiro de Soletrar trabalhará com elementos do alfabeto libra onde o jogador terá através dos quadros disponíveis soletrar do inicio ao fim a palavra que será pedida no topo da tela. Selecionado todas as letras na ordem correta o jogador será premiado com um troféu, seguindo a lógica dos minijogos anteriores haverá 3 variantes desse jogo que completadas irão premiar baseado na quantidade de variantes completas. Nesse jogo não terá uma ordem para completar os minijogos dando a liberdade para o jogador escolher onde começar ou terminar com também de repetir certo minijogo. Nos jogos de soletrar e matemática também será disponível uma opção de ajuda mostrando dicas sobre os números e o alfabeto em libra. Como descrito antes cada jogo terá 3 variações do mesmo com três prêmios para quantidade delas resolvida: Completando uma das sequencias de matemática ganhará o Troféu de bronze, completando duas ganhará o de Prata e completando três ganhará a de ouro. Ganhando todos os troféus de cada minijogo será disponibilizado na aba de troféu a visualização dos mesmos e a opção de conclusão de jogo (essa opção será liberada quando todos os troféus serem liberados), no qual aparecerá os créditos do o jogo.  <br/></p>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T07:36:26", "background_image": "https://media.rawg.io/media/screenshots/7a4/7a4e13dcefeea11440e6484a84e4f5ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jogos_digitais_lf"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}