{"id": 861586, "slug": "mixed-music", "name": "Mixed Music", "name_original": "Mixed Music", "description": "How to Play\r\n<p>(Note: Some Chrome-based browsers distort lower-pitched notes; the game is still playable, but Firefox may be preferable.)<br/></p>\n<p>The song list contains short excerpts from various Hololive talents which is divided into 4-12 measures.  When a puzzle is generated, the measures of the song will be randomly mixed up and changed (based on the difficulty level).  To solve the puzzle, correct the music to restore the original song.  <br/></p>\n<p>Click the <strong>Play</strong> button (or type <strong>p</strong>) to hear the song correctly. Click the <strong>Check</strong> button (or type <strong>c</strong>) to hear the current arrangement of measures. When it matches the original, the puzzle is solved and the song selection menu will be displayed. \r\n</p>\n<p>To restore the song, click on any measure to select it. Clicking on it again will play that measure in isolation. While selected, you can make changes to correct the music: <br/>\n</p>\n<ul><li>Click on a different measure to swap their positions.</li>\n<li>Click on the <strong>Order</strong> button (or type <strong>o</strong>), to change the order of the notes.\r\n</li>\n<li>Click on the <strong>Pitch</strong> button (or type <strong>i</strong>), to change the pitch of the notes.\r\n</li>\n<li>Click on the <strong>Length</strong> button (or type <strong>l</strong>), to change the duration of the notes\r\n</li>\n<li>Click on the <strong>Key</strong> button (or type <strong>k</strong>), to change the key between major and minor.</li></ul>\n<p>(Only the options used in creation of the puzzle will be available.) </p>\n\n<p>When you select a puzzle, song's difficulty level will set the possible puzzle elements automatically. These can be changed to make the puzzle easier or harder. Puzzle elements can be <strong>Always</strong> applied, <strong>Never</strong> applied, or applied at <strong>Random</strong>. (<strong>Count</strong> of the <strong>Random</strong> elements will be chosen for the puzzle.) For an additional challenge, <strong>Blind</strong> mode will hide the notes of each measure and <strong>Deaf</strong> mode will not allow listening to individual measures, only the complete piece. \r\n</p>\r\nAcknowledgements\r\n<p>\r\nThe original music is from COVER Corp. and associated talents; available under a permissive policy for fan works. To listen to the official version of the song, the red button in the title of the puzzle links to its release on youtube.\r\n</p>\n<p>\r\nMany scores used in the puzzle are largely simplified from excerpts of sheets or performances (or corrected using their work as a reference) by: Raygin, Kurolaff, Jayson Isik Kadusale, Captain Meow, Molybdaen42, m4554sd, DrewyJin, みねたけ, chronondecay.\r\n</p>\n<p>\r\nThe concept is derived from a puzzle in The Lost Mind of Dr. Brain by Sierra On-Line. \r\n</p>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T07:51:20", "background_image": "https://media.rawg.io/media/screenshots/bd6/bd6b092a0a3b17f1fa7d5915f920ded9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["mifinti"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}