{"id": 861548, "slug": "color-theft", "name": "Color Theft", "name_original": "Color Theft", "description": "<p>Há quatro cidades nesse jogo, Acrom, Protan, Deute e Tritan, os nomes dessas cidades são ligados às vertentes do daltonismo, respectivamente, Acromático, Protanopia, Deuteranopia e Tritanopia. Sobre os personagens, totalizam-se 11: O Max, que é o personagem principal e é o personagem que o usuário joga, os demais são NPC’s, que são o pai dele que também é representante da primeira cidade, Acrom, o mercante, os dois soldados, o general, a representante da cidade de Tritan, um menino pequeno, um vendedor de balão, uma artista e uma bibliotecária. Nesse game, as cores foram roubadas e o personagem principal terá que recuperá-las. No primeiro capítulo que acontecerá em Acrom, o Max conversa com o seu pai, visualiza as pessoas tristes na cidade e decide que vai recuperar as pedras roubadas. Depois disso o usuário sairá da cidade e encontrará um menino que pedirá ajuda para ao Max a passar em uma fase no seu jogo, passando dessa fase, ele recupera a primeira pedra roubada. Depois disso, Max irá voltar ao seu caminho para a segunda cidade, Protan, na qual a sua pedra vermelha foi roubada. Lá ele encontrará um mercante que o tratará com arrogância, depois desse encontro ele seguirá o seu caminho e no caminho encontrará um vendedor de balão que será o segundo mini-game. Passando dele, o usuário ganhará a segunda pedra roubada. No capítulo três ocorrerá na cidade de Deute, chegando na terceira cidade o nosso grande aventureiro se depara com um enorme portão, dois soldados com armaduras bem trajadas e uma postura digna, bem diferente de Protan. Então, Max admira o pouco que enxerga da cidade e sente algo estranho na sua mente, como flashs, e ao mesmo tempo uma calmaria. Após se acalmar, ele anda um pouco mais próximo do portão para interagir com os dois soldados que resguardavam a entrada da cidade. Após conversar com os soldados Max volta para a sua jornada e o jogador conseguirá utilizar a plataforma até o próximo desafio e conseguir a próxima pedra referente a cidade Deute, que é a cor verde. Max então chegou na última cidade, Tritan, a cidade que possui duas pedras de cor, e são as últimas que faltam para serem recuperadas. Então quando Max chega na cidade, percebe que a cidade é muito linda e a maior de todas. Ao chegar na cidade percebe que ela está vazia e com os portões principais escancarados. Enquanto caminhava pela cidade várias portas e janelas se fechavam quando ele passava por perto, ficando então chateado por achar que até os Tritanianos os culpam por esse roubo. Ao andar um pouco mais conversa com uma senhora que logo descobre ser a representante desta cidade que o conforta e o faz ficar mais tranquilo depois de passar por tantas coisas. Max então seguiu o seu caminho para o último mini game e por fim conseguiu recuperar todas as pedras. Depois de recuperar todas as cores Max se ver numa situação de desespero consigo mesmo, e relembra sobre o que fez e percebe que o seu objetivo em querer um lugar com mais igualdade para viver, terá de ser feito de outra forma que não seja tão trágico para as outras pessoas. Max devolve todas as cores e o mundo retorna ao que era antes.<br/></p>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T07:37:04", "background_image": "https://media.rawg.io/media/screenshots/743/743838e2dde928d46cfdf58eb6e9f280.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["jogos_digitais_lf"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}