{"id": 86159, "slug": "spawn-illuminati-hd-art-fireworks-and-light-show", "name": "Spawn Illuminati HD (Art, Fireworks and Light-Show)", "name_original": "Spawn Illuminati HD (Art, Fireworks and Light-Show)", "description": "[NEWS]<br/>Watch Spawn on the big screen! Spawn HD now supports TV Out for iPod 4G, iPhone 4 and iPad. For best results use the VGA connector (720p). Component and Composite cables work as well (480p).<br/><br/>Spawn HD is the best Wallpaper app period! A swarm of colored lights dance across the screen that you can completely control with your fingers. Create the most amazing masterpieces with a touch of your imagination. It's that easy. With this version, you can control the size, shape, color and number of Spawn particles … even enable the microphone to further make the light show pulsate in rythm! This latest version also includes the wildly popular Symmetry and Glow app, at no extra charge! With Symmetry, you'll easily turn your design into a true masterpiece.<br/><br/>[INSIDER TRICKS]<br/>- Three fingers on the screens bring up the menu wheel<br/> -&gt; Select a play or pinch/spread mode<br/> -&gt; Select ok (middle of the menu)<br/> -&gt; Once the menu is gone pinch or spread your fingers on the screen and see how it affects the show.<br/>- When mic input is enabled, particles fly slower (and screen pulses). To turn off the pulsing and make the particles fast again enable mic zoom speed and pinch until particles are faster again. Particles will still react to sound.<br/>- To reset all settings tap on the circle with the x inside and hit ok.<br/>- To take a screenshot press the home button and the lock button at the same time. <br/>- When you double tap the particles instantly, they explode creating a firework in your hand.<br/>- Go to facebook.com/spawnapp and upload your own Spawn HD creation to our image gallery. If you get selected, and with your permission, we will use YOUR image as demo screen in the iTunes store!<br/><br/>[OTHER APPS]<br/>Our new spawn-based game, Genesis, which adds puzzle solving to your experience, is now available in the app store. Think you got what it takes to navigate through all the levels?  Good luck! ;)<br/><br/>[STAY IN TOUCH]<br/>Follow us on http://twitter.com/eodsoft<br/>Become a fan on facebook and upload your creations here: http://www.facebook.com/SpawnApp<br/>Post your screens to http://flickr.com/groups/spawn/ or go there to see what others have submitted.<br/><br/>[ABOUT]<br/>With nearly 20 years of computer graphics engineering under the belt and a passion for artistic expression, EODSoft, has launched an amazing series of interactive light show and game revolution for the device. Check them all out in the app store!", "metacritic": null, "released": "2008-11-12", "tba": false, "updated": "2019-10-22T14:21:37", "background_image": "https://media.rawg.io/media/screenshots/a34/a3409f226743f8810867331802ca01d8.jpg", "website": "http://www.eodsoft.com/spawn.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Elements of Design"], "genres": [], "publishers": ["Elements of Design"], "esrb_rating": "Everyone 10+"}