{"id": 8615, "slug": "galaxy-dash-race-to-the-outer-run", "name": "Galaxy Dash: Race to the Outer Run", "name_original": "Galaxy Dash: Race to the Outer Run", "description": "Become the most infamous galactic smuggler in Galaxy Dash!<br/><br/>Galaxy Dash combines the exciting gameplay of an endless runner with the thrill of space combat!  Use lasers to blast your way through obstacles, engage in ship to ship combat, and collect valuable loot!<br/><br/>FEATURES:<br/>- Dodge space obstacles or blast your way through!  <br/>- Destroy enemy smugglers and steal their cargo!<br/>- Level up your Crew to enable special powerups!<br/>- Unlock and upgrade an arsenal of powerful ships!  <br/>- Complete missions to increase your rewards!<br/>- Colorful and vibrant HD graphics! <br/>- Challenge your friends for the high score! <br/><br/>TouchTapPlay: &amp;quot;The game&amp;#39;s graphics are so colorful and well done that it&amp;#39;s really impossible to not get charmed by them.&amp;quot;<br/><br/>Pocket Gamer Bronze Award winner: &amp;quot;A gorgeous, varied endless runner that makes a good fist of refreshing a well worn genre.&amp;quot;<br/><br/>148Apps: &amp;quot;With its robust amount of opportunities for fun player interactions it might just exceed your expectations.&amp;quot;<br/><br/>Download for FREE today!<br/><br/>Presented by SuperMoon Games, LLC as a Universal App with hd graphics optimized for retina display. <br/><br/>For the best experience, we recommend playing Galaxy Dash on an iPhone 5/5s/5c, and iPads with retina display.  Galaxy Dash is not compatible with the iPhone 4.<br/><br/>PLEASE NOTE: Galaxy Dash: Race to the Outer Run is entirely free to play.  However, some in-game items are available for purchase with real-world currency.  If you&amp;#39;d like, you can disable this in-app purchase feature in your device&amp;#39;s settings.<br/><br/>For the latest updates: <br/><br/>Become a fan of SuperMoon Games on Facebook: <br/>http://www.facebook.com/supermoongames <br/><br/>Follow SuperMoon Games on Twitter: <br/>http://www.twitter.com/supermoongames", "metacritic": null, "released": "2014-09-17", "tba": false, "updated": "2019-10-22T14:30:00", "background_image": "https://media.rawg.io/media/screenshots/542/5426d59d959409778364fde409f2610d.jpeg", "website": "http://www.supermoongames.com/press", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SuperMoon Games"], "genres": ["Action", "Arcade"], "publishers": ["SuperMoon Games"], "esrb_rating": "Teen"}