{"id": 861535, "slug": "shipbreakervr", "name": "ShipbreakerVR", "name_original": "ShipbreakerVR", "description": "ShipbreakerVr\r\n<p>ShipbreakerVr is a basic VR mod for Hardspace: Shipbreaker.</p>\n<p>\n</p>\n\n<br/>\r\nFeatures\r\n<p>This is a simple mod that enables a VR camera via a key binding. The UI and aiming direction are detatched from the camera for a more comfortable experience. There are no motion controls. You will need to take your headset off at times and toggle VR on and off to be able to get through some parts of the game. Some other parts might not work even when you toggle VR off. Some people have played larged portions of the game like this, but some features are still a bit broken.</p>\r\nHow to Install\r\n<p>Get ShipbreakerVR on itch.io. I recommend using the <strong>itch.io app</strong> to install the mod. This way you can get automatic updates.</p>\n<p>Run RaiManager.exe (or click Open in the itch.io app) and follow the instructions in the installer.</p>\r\nHow to play\r\n<ul>\n<li>Start the game as usual.</li>\n<li>Wait until you're fully in game, floating in space.</li>\n<li><strong>Press F3 to turn on VR</strong>. If you get to a part of the game where VR isn't working (like if you need to interact with the UI), press F3 again to disable VR, and play that part with mouse &amp; keyboard.</li>\n</ul>\r\nPerformance\r\n<p>There are two extra key bindings for lowering quality to get better performance:</p>\n<ul>\n<li><strong>Press F5 to enable ultra low quality mode</strong>. This is lower than what the game normally allows you to pick.</li>\n<li><strong>Press F6 to disable all lights</strong> in the current scene. Looks sad but can give you a performance boost.</li>\n</ul>\r\nSource Code\r\n<p>Source code available on GitHub</p>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T07:32:12", "background_image": "https://media.rawg.io/media/screenshots/2b1/2b1accf955626594b7e1b8c4e8640342.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Raicuparta"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}