{"id": 861778, "slug": "neon-speed-gauntlet", "name": "Neon Speed Gauntlet", "name_original": "Neon Speed Gauntlet", "description": "<p><strong>NEON SPEED GAUNTLET</strong> is a fast-paced platformer where  you only have 10 seconds to beat each level.  Roll and bounce around to  get to the goal as fast as possible. <br/></p>\n<p>This game was made in 72 hours for Ludum Dare.<br/></p>\n<p><strong>CONTROLS AND TUTORIAL</strong> - Unfortunately, there is no in-game tutorial due to time constraints.  I strongly suggest reading at least the controls here!\r\n</p>\n<p>Arrow Keys - Move.\r\n</p>\n<p>Z - Jump.\r\n</p>\n<p>X - Dash.  You can dash in 8 directions by holding the Arrow Keys!\r\n</p>\n<p>You can only Dash once in the air… Usually (more on this later).\r\n</p>\n<p>If you Dash into a wall or floor, you will automatically Dash-Roll along the wall/floor.\r\n</p>\n<p>You can press Z (or X) to jump out of a Dash-Roll.\r\n</p>\n<p>Important! - Wall Jumping out of a Dash Roll resets your ability to Dash in the air!\r\n</p>\n<p>Try this: Dash into a Wall -&gt; Roll Dash -&gt; Wall Jump -&gt; Repeat!\r\n</p>\n<p><strong>RULES</strong>\n</p>\n<p>You have 10 seconds to get to the portal at the end of each stage.\r\n</p>\n<p>If you run out of time, you’ll lose a life, but must <em>still</em> reach the portal.\r\n</p>\n<p>If you run out of lives, you’ll return to the level select map.\r\n</p>\n<p>Each area on the level select map consists of four stages back-to-back.\r\n</p>\n<p>Once you complete an area, you’ll get an area score.\r\n</p>\n<p>You get 100 points per second remaining, and 250 points for each gem obtained.\r\n</p>\n<p>Go  for a high score!  Feel free to share high scores for each stage in the  comments.  Unfortunately, scores do not currently save when the game is  closed.\r\n</p>", "metacritic": null, "released": "2022-10-06", "tba": false, "updated": "2022-10-07T09:09:09", "background_image": "https://media.rawg.io/media/screenshots/97a/97a7c306f270c80819453331d8ece28b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aster Smith"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}