{"id": 861887, "slug": "the-gourd-the-bad-and-the-ugly", "name": "The Gourd, The Bad, and The Ugly", "name_original": "The Gourd, The Bad, and The Ugly", "description": "<p>This game is a submission for One Minute Game jam #8, Thank you for playing!<br/></p>\r\n*Warning* For best gameplay and graphics play the native downloads\r\n<p>Godot had some performance issues in its web build so the web build is missing certain textures(including the skybox), the particle effects arent working, and things keep popping in and out. Wish I had tested the web build sooner, but its still playable.</p>\r\nThe Game's Story\r\n<p>You are just hanging out making some Jack-o-lanterns for Halloween. Make as many as you can in under a minute. I had plans for a scoring system, but it didn't get implemented as I was fighting trying to get the mesh re-topology to work right. As such at this point it is just a chill sim with no scoring system</p>\r\nControl and Instruction Guide\r\n<p>WASD - moves camera</p>\n<p>scroll wheel - zoom camera </p>\n<p>Left click and hold to start cutting pumpkin. Cut will only activate after you release </p>\r\nThoughts on the Game\r\n<p>I am aware that this is a very simple game, however I wanted to challenge myself with doing some low level graphics manipulation by dynamically modifying meshes from user input and then gamifing it. I think I got a bit over my head because I ended up reading 8 different research papers to help come up with the methods I used for working on the mesh. Sadly I was not able to resolve all of the edge cases in the time game jam time frame and as a result the cutting methods are unreliable, but I made decent progress and kinda have a gameplan for finishing it. <br/></p>\n<p>Originally I wanted to have a scoring system where the game would provide requested faces to cut out of the pumpkin and then measure how accurate the user was in matching the face, however since I spent most of my time working on getting the cutting algorithms to work I never got to implement that feature. As a result I had to pivot last minute and just make it work. </p>\n<p>In this game jam I also had switched to using the Godot 4 beta out of curiosity. It was interesting to contrast it to Godot 3 and see what features they had changed. This did blindside me a bit as I was relearning a lot of features and ran into a whole new batch of issues with exporting to web. Additionally while Godot 4 may have more features at this point in time it isn't documented as well and the current Godot 3 documentation might just not work for some of the changed features. It may have been a bit premature to try using it for a Game Jam, then again this is only my second project with Godot as a whole. Regardless I learned a lot and am excited for the future of Godot. </p>\n<p>This was my first music composition as well. Its a bit rough, but I feel it does a good job of giving the game some spooky vibes. Already gotten a lot of feedback of where I can improve in this space.  </p>\n<p>I also didn't realize how much fun I would have modelling props for the game. I felt like the game was kinda empty with just the pumpkin so I spent some time to add some extra environmental pieces and I think it came out really well</p>\n<p>Overall I feel very happy with this project. Despite not getting it to the point I wanted to I had a lot of fun creating it, and playing it. I am frustrated that I wasn't able to finish the mesh manipulation, but I did learn a lot and am pumped up for my next game! Thank you again for looking at my project. I greatly appreciate any feedback! \r\n</p>", "metacritic": null, "released": "2022-10-05", "tba": false, "updated": "2022-10-07T09:54:44", "background_image": "https://media.rawg.io/media/screenshots/04c/04c6f94f18efd99f1f7166ba3daa6dc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Cranberry Ninja"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}