{"id": 86202, "slug": "cougar-family-sim-wild-forest", "name": "Cougar Family Sim Wild Forest", "name_original": "Cougar Family Sim Wild Forest", "description": "Play as the cougar! Create family! Breed Cubs! Upgrade home! Hunt in different biomes!<br/><br/>Dive into the life of the wild cougar as you hunt with your mate, create a family, breed cute cubs and upgrade your home in Cougar Family Sim!<br/><br/>Explore a huge 3D world full of dangerous locations in this wild animal RPG. Raise your own Mountain Lion Family and have fun with your Cubs who need a lot of attention! Feed and play with your cubs and live with your family in your beautiful home with no disturbances. Upgrade your home with more than 40 awesome features including shelter, ........ and much more!<br/><br/>Hunt lots of enemies including Deer, Bear, Stag, Fox, Lynx, Buffalo, Dromader, Elephant, Fish, Flamingo, Gazelle, Giraffe, Goat, Gorilla, Hippo, Hyena, Leopard, Lion, Lioness, Rabbit, Raccoon, Rhino, Tiger, Wolf and Zebra much more will come with new locations soon! This is the best and most fun cougar simulator out there!<br/><br/><br/><br/>MAIN FEATURES OF FAMILY SIMULATOR:<br/><br/>RAISE A PANTHER FAMILY WITH YOUR MATE<br/>- Find your soulmate and start your family. <br/>- Take care of your cubs by hunting for them, going on adventures and teaching them how to fight!<br/>- Play with your cubs before they grow up and go into the wild on their own<br/>- Customize family members to change their fur colors<br/>- Hunt with your mate so your cubs are never hungry! Play with them so they grow faster! <br/>- Heal cubs when they get sick! And much more is coming to this mountain lion simulator!<br/>- When children become grown up let them go into the wild on their own<br/><br/><br/>AWESOME HOME<br/>- The home is the central part of life for the cougar family.<br/>- Live in an awesome home that is safe for your family with no disturbances.<br/>- Upgrade your home with over 40 unique items including heaven bridge, the statue of master Chee and much more.<br/><br/>STUNNING 3D WORLD WITH MULTIPLE LOCATIONS<br/>The massive stunning 3D world is waiting to be explored! Your cougar mate and Cougar family will help you discover all kinds of surprises that are waiting for you in forest, island and desert locations! More awesome locations like wild winter forest and jungles are coming in next updates soon! You can't get bored in this family sim! <br/><br/><br/>WILD ANIMAL RPG GAMEPLAY<br/> - Special slow-motion slash attack!<br/> - Different numbers of attacks and special skills: fear attack, stealth attack, pounce on prey<br/> - Grab victim in mouth, eat with family<br/> - Adventures and challenging quests: complete quests to earn experience and money to develop your character and home<br/> - Unlock achievements by completing different tasks<br/> - In this family simulator, you can hunt with the family into different biomes: forest, jungle, desert and much more are coming soon!!<br/> - Unlock special abilities of your character like swimming, pouncing, slash attack, sniper attack, and super slow-motion attack<br/><br/><br/>DAY-NIGHT CYCLE<br/> - Real day and night cycle with unexpected weather is waiting! Be careful while hunting at night. Some monsters may become stronger, others faster! Night vision is coming soon!<br/> - If you lost at night you always can find way back home by constellation on the night sky<br/><br/>LEADERBOARDS<br/>- Leaderboards rank the best players by level, experience and gold are here!<br/><br/><br/>So you don't miss updates and our new games follow us!<br/><br/>https://www.facebook.com/Area730Official<br/><br/>https://vk.com/area730<br/><br/>https://twitter.com/area_730<br/><br/><br/><br/>If you have any suggestions on how to make this family simulator better - let us know! Just write us in any social network or drop a letter on email!", "metacritic": null, "released": "2017-08-16", "tba": false, "updated": "2019-07-30T13:26:37", "background_image": "https://media.rawg.io/media/screenshots/197/197407f4ad7fb7a566946f5b63cabf61.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vladyslav Melnychenko"], "genres": ["RPG", "Simulation"], "publishers": ["Vladyslav Melnychenko"], "esrb_rating": null}