{"id": 862034, "slug": "time-cardmancer", "name": "Time: Cardmancer", "name_original": "Time: Cardmancer", "description": "<p>Team members:  BW、Gloridifice、AkaCMD<br/></p>\n<p>Ten seconds → one round, using cards to manipulate time and character attacks.Both the player and the enemy switch their actions(attack\\defense) according to the timeline, however, please note that your next action is not directly determined by you, but is manipulated by a random timeline.<br/>Fortunately, you can change your fate by playing cards that change the order of the timeline and the length of the stage! O brave man, use your wisdom and courage to keep moving forward in one ten-second after another! (Drag and drop cards onto the character)</p><p>There are now a total of 8 types of cards.\r\n</p>\n<ol><li>Fast: designate a character to speed up their current status behavior (monster or player)\r\n</li><li>Slow: designate a character to slow down their current status behavior (monster or player)\r\n</li><li>Expand: Extends the player’s current status behavior to the next status\r\n</li><li>Reverse-Expand: make the player’s next status behavior reverse and extend to the current status\r\n</li><li>Steal: Swap the current status behavior of both the enemy and the player.\r\n</li><li>Cut: Make a player’s future status overwrite the current status and cancel the behavior of that future status\r\n</li><li>Copy: Make a player’s future status overwrite the current status, but keep the behavior of that future status\r\n</li><li>Exchange: makes a future status of the player exchange with the current status</li></ol>", "metacritic": null, "released": "2022-10-05", "tba": false, "updated": "2022-10-07T10:56:26", "background_image": "https://media.rawg.io/media/screenshots/982/9821f3cceeac57ba4c26c051c998a35e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["AkaCMD"], "genres": [], "publishers": [], "esrb_rating": null}