{"id": 86233, "slug": "shoot-zombies-3d-game", "name": "Shoot Zombies 3D Game", "name_original": "Shoot Zombies 3D Game", "description": "https://www.youtube.com/watch?v=4dvrKX0cV8M&amp;feature=youtu.be<br/>One day all zombies return from darkness, zombies are over all the world, zombies damage everything around, and zombies eat all people brain, is apocalypse day?? NOPE!!! You, only you can save the world by shoot to kill zombies all, clear them all from my world.<br/>     You hate zombies, you want shoot to kill zombies all and save the world turning back to piece. Arm yourself with the best guns and shoot to kill zombies right now, shoot zombies all to die and bring piece for the world. Save the world is your mission, only you can save the world from death by shoot to kill zombies all.<br/>     This game is very good shoot to kill zombies, first person shoot 3D style game ever. You like action 3D first person shoot games, you like shoot zombies games, you like shoot 3D games, you like you like shoot zombies in the dark. You like shoot to kill zombies all. You like action shoot game. Download and play this free shoot to kill zombies, first person shoot game right now.<br/><br/>HOW TO PLAY<br/> - There a help on this shoot to kill zombies, first person shoot 3D game so you can see it for detail<br/> - Joystick for moving your player hero avoiding zombies and shoot zombies all<br/> - Fire button for shoot your gun to kill zombies<br/> - Throw grenades killing many zombies<br/> - Switching your weapons, you can use pistol, rifle or AK47 to shoot zombies die, more nice weapon and guns will update for you to shoot zombies<br/><br/>FEATURE<br/> - Dark ruined city caused of zombies damaged<br/> - zombies and zombies bosses for you to shoot<br/> - This shoot zombies 3D first person shoot game is now only single play mode, but multiplayer and more exciting features will come soon", "metacritic": null, "released": "2016-09-11", "tba": false, "updated": "2019-07-05T03:18:39", "background_image": "https://media.rawg.io/media/screenshots/200/200fe577d2b1f05f8bf84d0820ebc0b4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["thien tran vu"], "genres": ["Action", "RPG"], "publishers": ["thien tran vu"], "esrb_rating": null}