{"id": 8624, "slug": "frontline-commando", "name": "Frontline Commando", "name_original": "Frontline Commando", "description": "Optimized for the iPhone 5!<br/><br/>NOW WITH FACEBOOK SUPPORT!  CHALLENGE YOUR FACEBOOK FRIENDS TO BEAT YOUR ONE MAN ARMY SCORE.<br/><br/>ONE MAN. ONE WAR. YOU ARE THE FRONTLINE COMMANDO.<br/><br/>As the sole surviving Commando of a renegade attack against a ruthless dictator, you are stranded on the frontline and hell-bent on payback. You must use all of your specialized skills to survive the onslaught of the enemy forces and avenge your fallen soldiers.    <br/><br/>SEE AND FEEL THE ACTION <br/>The ultimate 3rd person shooter with stunning console quality visuals, precise controls, advanced physics and destructibles. Jump in the heat of battle and push your iOS device to the limit!<br/><br/>COMPLETE DEADLY MISSIONS<br/>Emerge from destructible cover points to take down helicopters, jeeps and heavily defended enemy bases. Fight off increasingly difficult waves of enemies over a variety of combat mission types.<br/><br/>COMMAND AN ARSENAL OF DEADLY WEAPONS<br/>Take to the frontline with an artillery of assault rifles, sniper rifles, shotguns, rocket launchers, med kits, armor and more!<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com/privacy<br/>- If you have a problem with this game, please use the game’s “Help” feature.", "metacritic": null, "released": "2011-12-14", "tba": false, "updated": "2019-07-29T07:57:48", "background_image": "https://media.rawg.io/media/screenshots/f7f/f7f44464169aac45868b2a08683395bc.jpg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 2, "suggestions_count": 465, "game_series_count": 0, "reviews_count": 2, "platforms": ["Android", "iOS"], "developers": ["Glu", "Glu Games"], "genres": ["Action", "Adventure"], "publishers": ["Glu Games"], "esrb_rating": null}