{"id": 862479, "slug": "ldjam-51-murder-on-the-horizon", "name": "LDJam 51 - Murder on the Horizon", "name_original": "LDJam 51 - Murder on the Horizon", "description": "<p>This game is made by @ayxs (Jasper Strijp) did the programming, story and audio &amp; @Bredera (Jasper Slobbe) did the level design, story, sprite art and dialogue. The game was made for the Ludum Dare 51 with the theme 10 seconds. This was a really ambitious game for us to make within three days and we are quite proud of the end result. We hope you detectives have fun trying to solve the mystery!</p>\n<p><strong>Story</strong>\n</p>\n<p>Detectives,\r\n</p>\n<p>Staff from restaurant the Horizon have called and reported a death on the premises under mysterious circumstances. If it was murder it only happened a couple of hours ago detectives, go there quickly and investigate the body and surroundings. let’s hope that if it was murder the killer left some evidence behind for you to find.\r\n</p>\n<p>On the premises you can find some staff members that told us they wanted to testify, they noticed some strange things during the evening. Furthermore the four board members that attended the board meeting at the restaurant have been called back to the location and are roaming around. Maybe it is a good idea to talk with them and get their opinions on the matter.\r\n</p>\n<p>But be aware if one of the board members killed the victim he can also try and hinder your investigation. Go there detectives and find out why this victim has died.\r\n</p>\n<p><strong>Objective</strong>\n</p>\n<p>Find the killer\r\n</p>\n<p><strong>How To Play:</strong>\n</p>\n<p>The game is a point and click game so almost all the interactions can be done by using the mouse. below you can find all the important info regarding gameplay:\r\n</p>\n<ul><li><strong>Tab:</strong> Opens and closes a map which can be used to travel around the environment within the map you can click the locations name to travel there.\r\n</li><li><strong>Mouse:</strong> The mouse cursor is used to look around and interact with objects of interest. When you are hovering over an object of interest it will be outlined.\r\n</li><li><strong>Characters</strong> There are quite some characters roaming around the map try to look for them and click on them to start a dialogue where you can ask them questions.\r\n</li><li><strong>Board Members</strong> Every 10 seconds the board members walk around the map, this gives you a bit more of a challenge because you need to actively find them to talk to them.\r\n</li><li><strong>The Killer</strong> As stated before the killer is also among the board members, and the killer also walks around every 10 seconds. however after a while the killer also has a chance to get rid of some evidence that lies around in the map to try and hinder your investigation.\r\n</li><li><strong>Interactable Items</strong> click left mouse button to interactwith an object that is highlighted it will be pulled in closer and you can inspect it by moving your mouse around, Press right mouse button to put it back. <em>Note: Most interactable items unlock dialogue with each board member. So it is important to check back with them once in a while.</em>\n</li></ul>\n<p>We really hope that you enjoy this experience.\r\n</p><p>The Ludum Dare page<br/></p>\n<p>Ayxs &amp; Bredera\r\n</p>", "metacritic": null, "released": "2022-10-04", "tba": false, "updated": "2022-10-07T14:23:34", "background_image": "https://media.rawg.io/media/screenshots/dbe/dbe0f7e0ce6abb6f3494229758453c83.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["ayxs"], "genres": [], "publishers": [], "esrb_rating": null}