{"id": 86240, "slug": "supper-ludo-fun-2017", "name": "Supper Ludo Fun 2017", "name_original": "Supper Ludo Fun 2017", "description": "Play with friend 2 player, 3 players and 4 players. Play with system is very interesting and challenging game. Great fun and unique animated characters game eliminate opponent piece with punch animation and move your piece with walking animation. Every person Want to play Supper Ludo Fun 2017, so we presented the new star 3D ludo game for user free new simulation game 2017.<br/><br/>Supper Ludo Fun 2017 is challenging game which has different modes and every mode has different environment. This Supper Ludo Fun 2017 also goes by many different names in the world,but most popular name is ludo in the Asia.<br/><br/>Supper Ludo Fun 2017 game is very simple &amp; easy to play, because this game has same rules everywhere. If you are getting bored&amp; you want to spend your time than Supper Ludo Fun 2017 game is best way to enjoy and spend your time. Tab on the device for role on your turn and play the 4 player game. New star ludo game is developed according to the classic rules of ludo as we play in our childhood. Play your turn wisely because this game is very technical and require skills. <br/><br/>Supper Ludo Fun 2017 is a huge animated game in many countries.You Can Play the loopy star game alone and if you do not have partner play real 3D ludo game so you can play with Auto Partners. Auto partner will be opponent player for the user.<br/>You need to beat the A.P to win battle. New star classic ludo bring an opportunity is that you can play blue star of queen game with Friends or family on single device.<br/><br/>Stars blue game play with 4,3 and 2 player. Every player decides the color and every player has a 4 piece in the home same color. The rows are arranged in a cross pattern. The first player throws the dice, so start the new Supper Ludo Fun 2017 game.<br/>Every player throws the dice in an own turn. When show the six bringing the piece in the game and go step by step.<br/><br/>If your piece reach at same area and there is already piece of other player, this piece is out of circle and You reached the all piece at the home but other player piece in the circle. You won the match.", "metacritic": null, "released": "2017-09-03", "tba": false, "updated": "2019-08-12T04:50:40", "background_image": "https://media.rawg.io/media/screenshots/598/59831c97a314a0204bdc506a6d040e1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Arcade", "Casual"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Everyone 10+"}