{"id": 862595, "slug": "peter-os-ludum-dare-51", "name": "Peter OS - Ludum Dare 51", "name_original": "Peter OS - Ludum Dare 51", "description": "<p># Description</p>\n<p>In Peter OS you'll get to play as Peter as he is spending some time on his phone. Peter has many interests among which the curation of meats, clicking of eggs and much more. He also has an active social social life so you'll get to meet many of his friends. Sadly, he has a slightly outdated phone (don't we all...). So along the years he has accumulated many applications and even some malware along they way. So much so that many of his apps crash regularly and that using his phone is a constant RAM usage optimization game.</p>\n<p>As soon as Peter gets too many notifications his phone crashes and with all those apps he seems to be getting them about every ten seconds. Of course he has installed some widgets to manage his RAM and keep track of the time, but he still tends to be overwhelmed from time to time. Can you get to know all of Peter's friends? Can you unlock all of his phone's secrets? Can you even keep the phone going for long enough?<br/></p>\n<p>## Goal and Theme of the game <br/>The goal of the game is to explore Peter's social life whilst keeping his phone alive. Just about every ten seconds you'll get notifications of apps installed on his phone of from his friends. Just chatting or making plans. We've taken some clear inspiration from games such as Emily is away, idle games and of course our smartphones nowadays. <br/></p>\n<p>## Bonus for the avid readers :) </p>\n<p>We decided to challenge ourselves with a more story-driven game this time, however as is tradition: making all mechanics and such took up most of the time. Therefore we feel that some of the stories are a little less fleshed out than we hoped, but nevertheless you'll find there is plenty to learn! Pro tip: If you play your cards right you can get recruited by the FBI! ;)<br/></p>\n<p># About us</p>\n<p>We are a team of three friends from the Netherlands who love making games and programming. We wanted to make as much of the game on our own as we could. Just how much we did you can see below. We hope you all enjoy our little game, and maybe, just maybe, if you enjoy our game leave a like/comment. We also love to hear feedback! :) </p>\n<p># About our game</p>\n<p>* Built with Unity</p>\n<p>* All textures are fully custom made!</p>\n<p>* All sounds, tracks and other audio effects are taken from other sources. We do not own the rights to the songs we play and we do not intend to use any of this in any commercial form and ask our players to do the same. By playing and downloading our game you agree to these terms :)</p>\n<p>## Controls</p>\n<p>You're phone is old and on the verge of crashing. Every 10 seconds you get a notification. Each notification might have side-effects if not handled well. </p>\n<p>Don't get more than 10 notifications to keep your phone running! To get rid of them, click on them or their app and have some interactions where possible. Similar to your own phone the notifications should mostly disappear when you handle them logically :)</p>\n<p>If you encounter any bugs feel free to let us know!</p>\n<p># Thanks for playing!</p>\n<p>Check out our ludum dare page as well</p>\n<p># Changelog &amp; Bugfixes</p>\n<p>See the ludum dare page for bugfixes</p>\n<p>https://ldjam.com/events/ludum-dare/51/peter-os<br/></p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T15:16:32", "background_image": "https://media.rawg.io/media/screenshots/624/624d0dbca3d861b18d0b4abf62962de4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["The_Human_Person"], "genres": [], "publishers": [], "esrb_rating": null}