{"id": 86261, "slug": "army-secret-shooting-mission", "name": "Army Secret Shooting Mission", "name_original": "Army Secret Shooting Mission", "description": "Experience the best animated  commando game with fps smooth gun control. It gives you a complete sniper shooting and commando shooting experience. Ready and play real commando (FPS) first person shooting game. <br/><br/>Army Secret Shooting Mission is strategy and Elite sniper game has most thrilling and adventures story-line. Conquer the building area and attack in enemies behind from containers and buildings. Use  gun to kill enemies from a distance, because they will be alert when you will fire first bullet and they start firing back. Might be possible they will kill your player and your mission is failed. Attack on terrorist likes a brave army commando. Show your convalescence to eliminate all enemies.<br/><br/>You are provided advanced and deadly weapons like assault rifle, advanced sniper gun and many more like pistol and ak47. Terrorists are more in numbers compare to your giving player power and increase in every mission. They comes in different waves and attack on your troops again and again. <br/><br/>This is the time to prove that you are the best commando. You are very famous in army as encounter specialist. Pick up your gun and strike on terrorists. Teach them a great lesson. Eliminate surrounding terrorist, aim and shot accurately on target. Hunt them down like a professional hunter and clear all missions. Prove that you are the great assassin against the terrorism. <br/><br/>How to play:<br/><br/>Start the game with first level when you complete first one next level will be unlocked automatically. On every successful mission you will be awarded with gold coins. Use your gold coin to purchase more weapons. Shot on right target gives you extra coins which help to improve your score. Use your combat skills and shoot fire on target to save the bullets. Time is limited complete your mission before the given time. <br/><br/>Features:<br/><br/>Ultra-realistic 3D graphics, <br/>Cool animations and Energizing game sounds<br/>Addictive game-play<br/>Feel the battle sound <br/>Challenging stealth missions<br/>Variety of deadly weapons<br/>Smooth fps controls <br/>Realistic environment<br/>Play any time any where<br/>No internet access required", "metacritic": null, "released": "2017-10-20", "tba": false, "updated": "2019-08-12T04:55:05", "background_image": "https://media.rawg.io/media/screenshots/407/4075b45cb3c682668492a691f0177e5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Mature"}