{"id": 862605, "slug": "clockwork-owl", "name": "Clockwork Owl", "name_original": "Clockwork Owl", "description": "Clockwork Owl is a Coin Pusher Roguelite. Use turn-based classic arcade coin-pushing physics mechanics as a means to battle forest critters, while making your way up a tree. Collect a deck of new cogs from random encounters and upgrade your owl at shops to survive this permadeath journey.<br/><br/>Experience the nostalgic bliss of an arcade coin tower game with a twist (and a hoot ^-^). <br/><br/><h3>INVENTORY QUEUE</h3><br/>Build your deck of cogs wisely, they are the only defense against the hoards of encroaching forest critters. Visit shops to buy some wares:<br/><ul><li> <strong>Bomb:</strong> An explosive that will blast cogs off the edge with ease<br/></li><li> <strong>Health Cog:</strong> When knocked off edge, it heals the player<br/></li><li> <strong>Ninja Star:</strong> A sharp, quick, high damage weapon<br/></li><li> <strong>Big Cog:</strong> A colossal cog which can clear space, when knocked from the board will hit all enemies</li></ul><h3>SPECIAL COGS</h3>Knocking off these special cogs from the clocktowers trough will reset the cogs, do critical double damage, and give you extra coins.<br/><br/><ul><li> <strong>Reset Cog:</strong> When knocked off edge, the trough is reset after a 3 second delay with a brand new set of cogs<br/></li><li> <strong>Critical Cog:</strong> When knocked off edge, all cogs knocked off the edge for the next 3 seconds do DOUBLE Damage. This stacks for multiple crit cogs.<br/></li><li> <strong>Gem Cog:</strong> When knocked off edge, each gem cog reward respective coins: Emerald - 25, Ruby - 50, Diamond - 100</li></ul><h3>STORY</h3>Time is under attack, and Owls are the sworn protectors of Time itself. The forest critters have laid siege against the timeteller's clocktowers, in hopes to cease time from flowing and disrupt the natural order of change. You, as the chosen guardian, must gather up your cogs and travel through time itself to protect the timeteller's clocktowers of new and old, ensuring the continuity of time's flow.<br/><br/><br/><br/>If you have feedback or come across bugs, please post here: <br/>Steam Forums: https://steamcommunity.com/app/2192460<br/>Or Discord: https://discord.gg/AbUjb5ZWbU", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2023-08-04T06:18:56", "background_image": "https://media.rawg.io/media/screenshots/392/39275bc52533d09d9793f13d7a95118b.jpg", "website": "https://spacefudge.itch.io/clockwork-owl", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Spacefudge"], "genres": ["Strategy", "Casual", "Fighting", "Indie"], "publishers": ["Spacefudge"], "esrb_rating": null}