{"id": 862613, "slug": "ldjam-51-sinister-urbanism", "name": "LDJAM-51 Sinister Urbanism", "name_original": "LDJAM-51 Sinister Urbanism", "description": "<p><strong>After 6 apocalypses we, the myriad people, crawl from our pocket dimeonsional tomb-bunkers, survey the wreckage of a world that once was, and ready ourselves to build new city-shield-bodies to protect us from against what terrors lurk out in vast.</strong><br/></p><p>A rapid  city building game set in a scarred and strange world. Join the growing  coucil of eccentric agents as a pair of dancing skeletons trapped in a  CRT monitor. <br/></p><p> <br/></p><p>You are dealt a hand of buildings, you select a plot, select a building,  and wait. Every 10 seconds your foothold grows. As does that of your  fellow councillors and as do their ambitions. \r\n</p>\n<p><strong>Grow the city sufficiently to sustain its health and protect its citizens from the unmoored-terrors beyond.</strong>\n</p>\n<p><em>Content  warnings for mentions of or references to; Blood, Drugs, Alcohol,  Cigarettes, Smoking, Hell, Insects, The Apocalypse, Snakes, Violence,  Light Body Horror, </em>\n</p>\n<p>Made in Godot\r\n</p>\n<p>Programming by Lizzie Davison &amp; Robin Neal (twitter.com/_sudocat)\r\n</p>\n<p>3D Models assembled by Lizzie Davison using Asset Forge AssetForge.io\r\n</p>\n<p>Music and Sound by Robert Nuttall (instagram.com/ganymedespage)\r\n</p>\n<p>Art and Writing by Christopher Neal-Knight (twitter.com/cdpnhyphenk)\r\n</p>\n<p>Additional assets from kenney.nl ♥\r\n</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T15:26:09", "background_image": "https://media.rawg.io/media/screenshots/357/3578f684d6b2d74d615eda438602a9ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 4, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SudoCat"], "genres": [], "publishers": [], "esrb_rating": null}