{"id": 86279, "slug": "fastlane-street-racing-lite-driving-with-full-thro", "name": "Fastlane Street Racing Lite - Driving With Full Throttle and Speed", "name_original": "Fastlane Street Racing Lite - Driving With Full Throttle and Speed", "description": "⋆⋆⋆⋆⋆⋆⋆Fastlane Street Racing is back – with 3D HD Graphics!⋆⋆⋆⋆⋆⋆⋆⋆<br/> <br/>Rev your engine…the best 3d car racing game is back! If racing cars is your dream, this game is a MUST HAVE. <br/> <br/>Drive your sports car fast on freeways and city streets!  Step on the gas pedal, push your car’s engine to the limit and let the speed madness take over! <br/> <br/>With amazing graphics and realistic 3d racing, you’ll feel like you’re really on the freeway with Fastlane Street Racing Lite. In this free game, you’ll become the street racer you’ve always wanted to be. With 6 racers to pick from, you can go turbo by picking the sports car or muscle car of your dreams! <br/> <br/>If you’ve gotta go fast, this is the game for you! <br/>Instead of being stuck on the freeway, you’ll be drifting past sports cars as an ultra-fast street racer. Our game has killer 3D tracks and multiple cars to select from! If drifting is your thing, put the pedal to the metal in our free 3D car racing game! <br/> <br/>Feel the speed in our free, HD graphics, 3d racing game! You’ll be racing cars you never dreamed you could drive! If you’re a speed racer at heart, this game will make your engine go into overdrive. <br/> <br/>This 3D game will make you feel like you’re in a real race! We’ve got the best car racing game with 3D graphics and this version is free! Don't just dream of racing, become a racer in the fast lane with exotic cars and our arcade-style 3D racing game. We’ve got the best free racing game out there!<br/> <br/>With only 45MB you can even use your cellular data if you are looking for some exotic car racing on the go. Weave through traffic in winding city routes and improve your driving on high-speed race circuits. Incredible sense of speed and beautifully rendered surroundings makes Fastlane Street Racing one of the most polished racing titles available on the iPhone.<br/> <br/>⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆Reasons Fastlane will dazzle you⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆<br/> <br/>‐ EXOTIC CARS: Choose from 6 highly detailed original exotic turbo &amp; gt cars (4 more to unlock in the full version of Fastlane Street Racer) each with different characteristics.<br/>‐ HIGH DETAILED GRAPHICS: Combined with advanced lighting​ and effects you will enjoy cruising down the highway behind the wheel of your favorite car.<br/>‐ SAVE YOUR REPLAY: You can save and relive the most thrilling moments of a race.<br/>‐ AWESOME TRACKS: Choose from 9 diverse and gradually increased difficulty tracks from the Seaside Beach to the Downtown of the City with crowded traffic.<br/> <br/>Why we're the best car racing game in the app store:<br/> <br/>\" Fastlane Street Racing is the best iPhone racer in terms of graphics, racing challenge, and overall gameplay… the best looking iPhone racer, hands down.\" <br/>- toucharcade.com<br/> <br/>Must Have Award <br/>\"Exceptional race realism for the iPhone; sound effects and graphics are top notch\"<br/>-       Slide To Play<br/> <br/>“Best Racer On iPhone… PERIOD!!!”<br/>-       K.D., 5* iTunes reviewer<br/> <br/>“Fast Pace Heart Racing”<br/>-       MPDDawes, 5* iTunes reviewer<br/> <br/>We welcome all of your comments and suggestions at support@fastlanestreetracing.com<br/> <br/>http://fastlanestreetracing.com<br/> <br/>⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆If you love us, rate our app! ⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆⋆", "metacritic": null, "released": "2009-02-03", "tba": false, "updated": "2019-10-22T14:21:40", "background_image": "https://media.rawg.io/media/screenshots/b01/b01b63ee0239ed73bb2a32c643aa0536.jpg", "website": "http://www.fastlanestreetracing.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 115, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Atod"], "genres": ["Racing", "Arcade"], "publishers": ["Atod"], "esrb_rating": "Everyone 10+"}