{"id": 862897, "slug": "ludum-dare-51-power-up", "name": "Ludum Dare 51 - Power Up", "name_original": "Ludum Dare 51 - Power Up", "description": "<p>Our game <em>Power Up!</em> is all about head-to-head projectile-slinging mayhem. Grab your nearest friend (or enemy) and engage in an an ever-escalating bullet hell battle! </p>\n<p>There aren't many ways to threaten your opponent at first, but your stock of power-ups refill every ten seconds. Use powers to construct turrets that entrap your foe or arm yourself to lead the charge directly. Bring all of your strategy, foresight, and reflexes to bear and steal victory from the jaws of defeat!</p>\n\n<p><strong>How to Play:</strong> Move to avoid your opponent's projectiles - they're the only thing that can hurt you.</p>\n<p>Spend your power-ups on <strong>turrets</strong> (stationary projectile-firing objects) or to <strong>upgrade yourself</strong> (the same projectiles are fired periodically from you)</p>\n<p>\n</p>\n<p><strong>Remember:</strong> You may look boxy and bulky, but the only real vulnerable spot is the heart at your center. Hide it away you'll be safe, but know that you'll have to put yourself out there someday (probably).</p>\n<p><strong>Controller Support:</strong></p>\n<p> - Movement: D-pad</p>\n<p> - Place turret (requires power-up): \"square\" (PS) / \"x\" (Xbox)</p>\n<p> - Upgrade self (requires power-up): \"x\" (PS) / \"a\" (Xbox)</p>\n<p><strong>Keyboard Controls (2-Player play supported):</strong></p>\n<p><strong>Player 1:</strong></p>\n<p> - Movement: WASD</p>\n<p> - Place turret (requires power-up): \"c\"</p>\n<p> - Upgrade self (requires power-up): \"v\"</p>\n<p><strong>Player 2:</strong></p>\n<p> - Movement: Arrow Keys</p>\n<p> - Place turret (requires power-up): \",\" / Numpad 1</p>\n<p> - Upgrade self (requires power-up): \".\" / Numpad 2</p>\n<p><strong>Gameplay Tips:</strong></p>\n<p> - Your stocked power-ups are displayed at the top-center of the screen, innermost ones are used first.</p>\n<p> - Any unused powers are lost when the 10-second timer expires. Use it or lose it!</p>\n<p> - Not all power-ups and positions are equally strong - in particular, a stack of turrets in one spot is often less useful than a multi-sided offense.</p>\n<p><strong>Power-up Types:</strong></p>\n<p> - \"plus\" - fires a burst of three shots in cardinal directions every <strong>5</strong> seconds</p>\n<p> - \"scatter\" - fires 5 fast-moving projectiles in random directions every <strong>1</strong> second</p>\n<p> - \"targeted\" - fires 1 projectile at the opponent's current position every <strong>1</strong> second</p>\n<p><strong>Credits:</strong> <em>Power Up!</em> was created with the Godot engine in 72 hours with original code, sound, and \"art\". The team was made up of two people. The font was created by Christian Robertson and imported from Google Fonts. https://fonts.google.com/specimen/Roboto<br/></p>\n<p><strong>Feedback Wanted:</strong> This Ludum Dare entry has original art, music, and gameplay, and we are welcome to all kinds of feedback! Especially related to how fun <em>Power Up!</em> is to play. </p>\n<p>You can also check out [the open-source code on GitHub](https://github.com/SamBumgardner/power-up-ld-51) (gaze upon my spaghetti, ye Mighty, and despair!)</p>\n<p><strong>Zeus's Bonus Challenge:</strong> If you don't have a friend nearby, you can always challenge yourself to keep both players alive while using every power-up possible. If you make a high score (solo or cooperatively) in a particularly spectacular fashion, please post a screenshot down below!</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T17:29:25", "background_image": "https://media.rawg.io/media/screenshots/95e/95ef06c788e7d7f18d518904a784db0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["NBumgardner"], "genres": ["Action"], "publishers": [], "esrb_rating": null}