{"id": 86281, "slug": "the-hunt-for-the-lost-treasure", "name": "The Hunt for the Lost Treasure", "name_original": "The Hunt for the Lost Treasure", "description": "Continue the adventure of the The Lost Ship in this longer quest as you hunt for the pirate’s lost treasure in this beautifully designed classic point and click adventure puzzle game. <br/>\n<br/>\r\nUncle Henry has been hunting lost treasures for as long as you can remember. His legendary stories of adventure excited your imagination as you were a child growing up. Now with your newly acquired archeology skills, he has been reaching out from time to time for your help in tracking down some of these difficult to find treasures.<br/>\n<br/>\r\nIn his latest quest, he has used the map you discovered in the lost ship and tracked down the location of the pirate’s cove. You must explore the island, find clues, and solve puzzles left behind by the pirates to discover the location of the lost treasure!<br/>\n<br/>\r\nThis captivating adventure game has:<br/>\r\n- Custom designed beautiful HD graphics!<br/>\r\n- Custom composed soundtrack and sound effects!<br/>\r\n- A dynamic map to show the screens you have visited and current location<br/>\r\n- A camera that takes photos of clues and symbols as you discover them<br/>\r\n- Dozens of puzzles, clues, and items<br/>\r\n- Auto saves your progress<br/>\r\n- Available for phones and tablets!<br/>\r\n- Instantly move around the map reducing travel time with Fast-travel<br/>\r\n- Get helpful text hints that nudge you in the right direction and complete walkthrough videos for each hint and puzzle<br/>\n<br/>\r\nVisit our website to sign up for our newsletter and learn about upcoming games!", "metacritic": null, "released": "2015-09-13", "tba": false, "updated": "2024-02-19T06:34:48", "background_image": "https://media.rawg.io/media/screenshots/f13/f1368fe6f6bd75e46f517881383465d1.jpg", "website": "http://syntaxity.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "iOS", "Android"], "developers": ["Syntaxity"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Syntaxity"], "esrb_rating": null}