{"id": 862925, "slug": "the-tenth-second-son", "name": "The Tenth Second Son", "name_original": "The Tenth Second Son", "description": "<p>The Tenth Second son is a creative interpretation of the Ludum Dare 51 theme \"every 10 seconds.\" Instead of interpreting the theme  as something that affects gameplay, we chose a different direction and based the story around the theme (there is also gameplay based on the theme). <br/></p>\n<br/>\n<p>Every 10 second-sons are selected for the great coronation. Once 10 second-sons have been born the old feud sparks. A great weight is placed on each of the families to be the first to have a second son early. Every son needs training and experience if they hope to withstand a battle to the death for control over the lands that stretch as far as the eye can see. But you are the last to be born. The tenth second son. The day that you turn 17 is the day of the battle. A great tide has been sweeping the feud as the Raginmars have dominated the last 2 competitions. Their second son, Robell, is 34, with 20 years of combat experience and a medal of honor he is favored to carry the Raginmars to a 3rd victory.\r\n</p>\n<p>\tYour family was the last to win. 3 generations ago you won a battle. Not through combat but subterfuge. Due to a technicality in the original agreement, if a second son were to leave the arena for ten seconds they immediately forfeit. The families still contest the win, but once taking the position of power the rule was finalized. Now a timer is placed on everyone and  if they leave the arena for ten seconds they lose. The Raginmars have won by strength but you might be able to win with technicalities. Can you dethrone Robell and reclaim the crown?\r\n</p>\n\n<p>Controls:</p>\n<p>wasd: Basic movement</p>\n<p>e: Interact and talk to NPC's to gather information and win your fights.</p>\n<p>Left click: This is your parry,  It's your first method of defeating enemies and a great way to avoid getting hit.</p>\n<p>Space: This is your dash, use it to avoid enemy attack's and look cool doing it.</p>\n\n<p>Note: if all else fails remember to talk to people, subterfuge is your best friend. </p>\n\n<p>Screenshots:<br/></p>\n\n<p>Dialogue interaction ^</p>\n\n<p>Parry in action ^</p>\n\n<p>Dash doing its job ^</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T17:41:05", "background_image": "https://media.rawg.io/media/screenshots/9d9/9d9bc1e9a31f3412b86e1ff7e13b9e85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Or-Bit Studios"], "genres": [], "publishers": [], "esrb_rating": null}