{"id": 863019, "slug": "stuck-gun", "name": "Stuck Gun", "name_original": "Stuck Gun", "description": "<p><strong>Game description: </strong></p>\n<p>Stuck gun is a 2D action shooter where you, as a soldier, are doomed to fight against a bunch of monsters on alien planets with a powerful laser weapon that is unfortunately stuck. But you're not completely defenseless, beacuse the weapon fires uncontrollably every 10 seconds. Your goal is to find the necessary items, take them to the ship and, if possible, not die. </p>\n<p><strong>How to play: </strong></p>\n<p>- Aim with the mouse </p>\n<p>- use the arrows or WASD to move </p>\n<p>- the weapon fires itself every ten seconds </p>\n<p><strong>Tips: </strong></p>\n<p>- weapon fire is so powerful that even an experienced soldier like you may have trouble controlling it properly. </p>\n<p>- At the same time, the shot can also be used as a movement booster </p>\n<p>- Watch out for narrow corridors! </p>\n<p><strong>LUDUM DARE 51 backstory: </strong></p>\n<p>Our seventh LDJ in a row. It was the first time we went there with a larger team full of newcomers. The code of the game was mainly taken care of by @mira and @vrerabek sometimes helped remotely. This year, we were helped by a team of graphic designers led by @skel3ton, who was ably assisted by the girls @Nymerit and @mirovamanzelka. The level design was done by @jagman, who also contributed to the sound effects. And finally @vivat-vector joined us and composed the music for the game. </p>\n<p>Although this was the first experience for most of the team, we are thrilled with the result. We hope you will like it too.</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T18:19:06", "background_image": "https://media.rawg.io/media/screenshots/b0d/b0d8635afe217794f08effcad9b22380.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["quietmuffin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}