{"id": 863016, "slug": "lofi-witch-magical-bombs-to-relaxdefuse-to", "name": "Lofi witch: Magical bombs to relax/defuse to", "name_original": "Lofi witch: Magical bombs to relax/defuse to", "description": "<p>Every 10 seconds, a new bomb to defuse! In this (Not so) chill game, you play as witch girl, who has to defuse magical bombs that are relentlessly sent to her! Good thing she was studying, her notes on magic bomb defusal are available to consult on her computer!</p>\n<p>The game was made in 72 hours, for the Ludum Dare 51, with the theme : Every 10 seconds!</p>\n\n<p><strong>Controls:</strong></p>\n<p>Left click: Browse computer file or hold objects(Hold)</p>\n<p>Right click (When holding the magic wand): Cast a Hocus</p>\n\n<p><strong>How to play (For the sake of the game's experience, only read this after giving understanding the game a good try):</strong><br/></p>\n<p>Each bomb consists of a main core (Corresponding to the bomb's type), surrounded by up to 6 modules, which you have to disarm in order to fully defuse the bomb. These modules are randomly picked between three types:</p>\n<p>- Elemental modules: To disarm them, you have to drag the corresponding potion to the module. The effect that each potion has on each module is determined by the bomb's type, make sure to check the right file on your computer.</p>\n<p>- Symbolic modules: To disarm them, you have to press the small rune at the bottom of the module until it displays the correct one, then press on the confirm button. The solution to this module is shared by the different bomb types</p>\n<p>- Alchemic modules: These modules have the particularity to look similar to the bomb's core, which makes them easy to overlook or mistake for the actual bomb type. To disarm them, you have to grab the magic wand that is on your table and cast the corresponding number of hocuses (Right click) on the module.</p>\n\n<p><strong>Credits:</strong></p>\n<p>Game programming: Sébastien GUAROBER (@Sethios)</p>\n<p>Game design and art: Soulaymane GUIGON (@WhiteNoize)</p>\n<p>Additional assets:</p>\n<p>- Cartoon FX Remaster by Jean Moreno</p>\n<p>- Font: Milky coffee</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T18:18:02", "background_image": "https://media.rawg.io/media/screenshots/ffb/ffba4f8652effb149e4082fddfd68685.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Sethios", "WhiteNoize"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}