{"id": 86303, "slug": "motor-racing-high", "name": "Motor Racing High", "name_original": "Motor Racing High", "description": "https://www.youtube.com/watch?v=q_XkufzBOoY&amp;feature=youtu.be<br/>This 3D game is all free, just download and playing this 3D nice fanstatic motor bike racing ride game.<br/>     You like sports, and your passion is high speed on highway with super motor bike, just play this game. This is very basic of racing, ride sports super motor bike game.<br/>     Racing, ride your sports monster motor bike with high speed, around highland and nice fantastic environment, doing some more thrilling and relaxing with some more drifting your super monster sports motor bike on racing highway is much funny and exciting. Just take your dream sports monster super motor bike and start your racing.<br/><br/><br/>How to play<br/>    This game is very easy to play, with some simple buttons. Just press gas button and speed up your dreams sports motor bike on highway. You're motor racing highway start.<br/><br/>Features: <br/>- Amazing graphics of super sports monster motor super bike racing ride game with highland fantastic environment<br/>- Simple controls buttons with gas, break ones to do your racing, ride dream super sports monster motor bike on highland fantastic environment<br/>- Swing your device to control your super sports monster motor super bike steer on your racing speed road <br/>- Automatic controlling gear of your racing, ride sports monster motor super bike<br/>- Camera button to change your vision of racing , ride super sports monster motor super bike", "metacritic": null, "released": "2015-10-19", "tba": false, "updated": "2019-07-05T03:27:01", "background_image": "https://media.rawg.io/media/screenshots/43c/43c8fb3e3db9731e89640d0d73717c84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["thien tran vu"], "genres": ["Sports", "Racing"], "publishers": ["thien tran vu"], "esrb_rating": null}