{"id": 863125, "slug": "lucky-lefty-lost-in-a-labyrinth", "name": "Lucky Lefty Lost In A Labyrinth", "name_original": "Lucky Lefty Lost In A Labyrinth", "description": "<p>Lucky Lefty is lost in a labyrinth! Will you be the light that helps lead Lucky in looking to leave the labyrinth?\r\n</p>\n<p>To progress to the next level of the labyrinth, Lucky needs to touch all the solid tiles to unlock the exit. The exit will be trapped if you don't touch all the needed tiles. Thankfully you have hints on how many safe tiles are in each row and column. Incorrect paths are traps, so choose wisely. A solid tile you touch will still fall every 10 seconds, so don't dally too long. Can you make it out of the Labyrinth with the least number of retries?</p>\n<p>*Controls*</p>\n<ul><li>Left click on adjacent tiles to move to them</li><li>Right-click on any tile to add an X or checkmark to help keep notes on which tiles are safe</li></ul>\n<p>*Options*</p>\n<ul><li>You can turn off the breaking tiles for a more relaxed play</li><li>You can turn off auto updating hint numbers if you find it confusing</li><li>You can turn on hard mode that means if you fall you go back to the previous level</li></ul>\n<p>*Scoring*</p>\n<p>Each level is rated with stars. The fewer retries on the level gives you more stars. No retries gets you 3 stars.</p>\n<p>*Known bugs*</p>\n<ul><li>Turning off breaking tiles in the middle of a stage can result in looping breaking tiles that never break</li><li>Stage score at end of stage will always show best score for that stage (really just a missing feature of showing current score and best score)</li><li>Mobile can be scaled down which makes the game/text look grungy </li></ul>\n<p>TheBookSnail - Code/SFX/Music</p>\n<p>ElysiaGriffin - Art</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T19:03:05", "background_image": "https://media.rawg.io/media/screenshots/d64/d644ab1d3865136b50341e8ec22f9f49.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["thebooksnail"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}