{"id": 863253, "slug": "exp10sion", "name": "Exp10sion", "name_original": "Exp10sion", "description": "Every 10 seconds, a bomb explodes. <br/>Each explosion marks the start of a new round. <br/>In each round, traces of the previous bomb remain. <br/>In every level, there are Exp10sions!!!<h3>Exp10sion, a puzzle platformer:</h3>You will play as a bomb that <strong>explodes within 10 seconds</strong>, managing to reach the Target Door before explosion. <br/><br/>Each explosion respawns the bomb, starts a new round, and generates a \"<strong>Time Shadow</strong>\" representing your trail of previous round. <br/><br/>Skillfully use your shadow and level's mechanisms to overcome numerous obstacles and unravel puzzles, in the cycle of explosions and rebirth!<h3>Key Features:</h3>🕒 Tick-Tock Tensions: In \"Exp10sion\", time takes center stage. As the clock steadily ticks away, your adorable bomb character faces an explosive fate. Can you unravel time's mysteries at a leisurely pace?<br/><br/>🌟 Pixel Art: Immerse yourself in the enchanting pixelated scenes of \"Exp10sion\".  Explore meticulously crafted levels inspired by retro aesthetics, each offering a cozy atmosphere and a touch of nostalgia.<br/><br/>🧩 Whimsical Puzzles: \"Exp10sion\" challenges your intellect with a wide array of time-centric puzzles in over 70 levels. Magnets, lasers or even something that can stop the ticking timer.<h3>Ludum Dare:</h3>The prototype of this game is made during Ludum Dare 51, under the theme of \"Every 10 seconds\".", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2023-12-11T03:13:50", "background_image": "https://media.rawg.io/media/screenshots/b49/b49b1eeeb3ed5e077cb3ae031f2cf960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["projectcolorball", "xiu0922koway", "cortexA233", "Psa1ms77", "lynnezzzy", "Exp10sion Studio"], "genres": ["Adventure", "Casual", "Indie", "Platformer"], "publishers": ["Exp10sion Studio"], "esrb_rating": null}