{"id": 86338, "slug": "the-mystery-of-blackthorn-castle", "name": "The Mystery of Blackthorn Castle", "name_original": "The Mystery of Blackthorn Castle", "description": "Once again your Uncle Henry has asked for your help in the search for a mysterious artifact. Embark on your own quest in this beautifully designed classic point and click adventure puzzle game. <br/>\n<br/>\r\nUncle Henry has been hunting lost treasures for as long as you can remember. His legendary stories of adventure excited your imagination as you were a child growing up. Now with your newly acquired archeology skills, he has been reaching out from time to time for your help in tracking down some of these difficult to find treasures.<br/>\n<br/>\r\nIn his latest quest, he has been hunting for a mysterious artifact last known to be at Castle Blackthorn in England. As the tale goes, centuries ago a wizard once lived in this castle and stole a valuable artifact from a local watch maker and hid it away somewhere in the depths of the castle.<br/>\n<br/>\r\nYou must hurry and help him on this amazing adventure before anyone else finds the mysterious artifact!<br/>\n<br/>\r\nThis captivating adventure game has:<br/>\r\n- Custom designed beautiful HD graphics!<br/>\r\n- Custom composed soundtrack and sound effects!<br/>\r\n- A dynamic map to show the screens you have visited and current location<br/>\r\n- A camera that takes photos of clues and symbols as you discover them<br/>\r\n- Dozens of puzzles, clues, and items<br/>\r\n- Auto saves your progress<br/>\r\n- Available for phones and tablets!<br/>\r\n- Instantly move around the map reducing travel time with Fast-travel<br/>\r\n- Get helpful text hints that nudge you in the right direction and complete walkthrough videos for each hint and puzzle<br/>\n<br/>\r\nVisit our website to sign up for our newsletter and learn about upcoming games!", "metacritic": null, "released": "2015-02-25", "tba": false, "updated": "2024-02-19T06:37:41", "background_image": "https://media.rawg.io/media/screenshots/a01/a016e09c467aff9714563fe45d719663.jpg", "website": "http://syntaxity.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 343, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "iOS", "Android"], "developers": ["Syntaxity"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["Syntaxity"], "esrb_rating": "Everyone"}