{"id": 863567, "slug": "negative-mercury", "name": "Negative Mercury", "name_original": "Negative Mercury", "description": "Info \r\n<p>----------------------------------------------\r\n</p>\n<p>A fan made project that focuses on the revival of Death Grip's Retrograde with some additional functions.</p>\n<p>Retrograde is an interactive installation created by Death Grips circa The Money Store. The user is presented with a 'death grid' full of tiny, looping quick shots of the band in performance, which they can activate in any pattern they choose to create their own wall of sound.</p>\n<p>All of the individual Retrograde clips can be found on the YouTube channel mercury00retrograde. </p>\r\nAdditional Functions\r\n\r\n<p>----------------------------------------------</p>\n<p>You can adjust the volume by holding and dragging your mouse After the clip plays. You will see a red bar increase and decrease based on the volume.</p>\n<p>Before the clip plays, holding on the clip will set it to be played in a delayed amount of desired seconds. You can choose to play the Set Clip by pressing it, or pressing Play Set on the right side to play all Set Clips.</p>\r\nWarnings\r\n\r\n<p>----------------------------------------------</p>\n<p>Playing All or Playing more clips than what the Unity Engine likes, will cause an overflow in the AudioSampleProvider, which will start delaying frames and making the application have a seizure.</p>\r\nQuestions you might ask\r\n\r\n<p>----------------------------------------------</p>\n<p><strong>Any plans for future updates?</strong></p>\n<p><em>Doubt it, but I'm not opposed to it.</em></p>\n<p><strong>Are all the clips in their original spots?</strong></p>\n<p><em>Kinda... Most of them are, but I know there are some that aren't correct. It was difficult to pinpoint the Blue Clips, and some clip thumbnails didn't seem to show in the Original Retrograde.</em> </p>\n<p><strong>There seems to be copies of some clips. Whats the deal?</strong></p>\n<p><em>Oddly enough, there are some clips that are copies. I extracted the clips from the deathgripsarchive, and checked the Mercury Retrograde channel for validation. As for why that is, I'm not too sure.</em> </p>\n<p><strong>Why did you do this?</strong></p>\n<p><em>Money Store Retrograde is gone, and can't ever be played. There are no videos, besides forums and talk about it's existence. I was curious what they meant by creating your own sounds with these clips, and decided to work on this project to satisfy that curiosity.</em> </p>\n<p><strong>Do the clips connect to each other? </strong></p>\n<p><em>Before I even worked on the project, I tried to connect 1 &amp; 2 together. There doesn't seem to be a correlation.</em><br/></p>\n<p> <strong>Any plans for other Death Grip Applications? </strong><em>Maybe. Might do something with Exmilitary</em></p>Credits\r\n<p>----------------------------------------------\r\n    </p>\n<p>All rights go to Death Grips / Third Worlds. This project is not for any means of profit, and it just a passion project to show my favorite band support.<br/></p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T22:11:53", "background_image": "https://media.rawg.io/media/screenshots/1ba/1ba1624bbd491ba37860171c00eec5bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["EntrophicHoudini"], "genres": [], "publishers": [], "esrb_rating": null}