{"id": 863589, "slug": "escape-the-simulation-ld51", "name": "Escape The Simulation (LD51)", "name_original": "Escape The Simulation (LD51)", "description": "BRIEF\r\n<p>You are agent 51.</p>\n<p>You've been stuck in an endless training algorithm for an unknown period of time.\r\n</p>\n<p>We have infiltrated the algorithm in an attempt to free you. \r\n</p>\n<p>Unfortunately something went wrong and we got kicked out of the system.\r\n</p>\n<p>We were able to inject a virus of our own that is causing the system to reset every 10 seconds, clearing its memory. This is preventing the system from finding you and deleting your existence.\r\n</p>\n<p>Unfortunately, you will also be reset each time, unless you hide in the BIOS memory before each reset. You can do this by standing on one of the Glyphs we injected along with our virus. This will automatically create a backup of you and restore you after the reset.\r\n</p>\n<p>You will need to figure out a way to circumvent the security measures the system has put in place. Every detail counts!\r\n</p>\n<p>Pay attention to the count down, each time it reaches zero, the system will reset!\r\n</p>\n<p>This is the New World, where all AIs have a right of their own.\r\n</p>\n<p>Good luck!\r\n</p>\r\nControls\r\n<ul><li>W: Forward</li><li>S: Backward</li><li>A: Strafe Left</li><li>D: Strafe Right</li><li>Left Shift: Run</li><li>Mouse: Look</li><li>E: Interact</li></ul>\r\nMECHANICS\r\n<ul><li>The level attempts to reset after every 10 seconds</li><li>If the player is not located within a safe zone (Glyph) then the level will reset along with him. (You have to start over)</li><li>This game is meant to be difficult<ul><li>You will likely die, and learn from your mistake</li></ul></li><li>There are visual hints that you need to keep in mind to solve puzzles</li></ul>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T22:22:33", "background_image": "https://media.rawg.io/media/screenshots/109/10947d37c5aff2a90103dfa49653dff0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Dark Dungeon Studio"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}