{"id": 863609, "slug": "relative-hell", "name": "Relative Hell", "name_original": "Relative Hell", "description": "<p><strong>What is Relative Hell?</strong></p>\n<p>Relative Hell is a collection of two games, taking place in the de Sitter (dS) and anti-de Sitter (AdS) spacetime, with 2 space dimensions. These can be seen as the relativistic counterparts of spherical and hyperbolic geometry. In our real-world, you cannot tell how fast you are moving (for example, we do not perceive the spinning of Earth and its movement around Sun); however, the physics in most non-Euclidean games do not have this property: the curvature of the space would make movement relative to the space obvious for any wide object (this is why in HyperRogue all the large enemies are narrow; see also here or here for some visualizations of this effect). <br/></p>\n<p>The Anti-de Sitter game is a multidirectional shooter -- a bit like Asteroids, but completely different. The space is not wrapped, but things appear to go in circles due to AdS properties. Shoot asteroids for points and to restore your resources. The game uses a similar model as HyperRogue: the more score you have, the harder the game gets.</p>\n<p>The de Sitter game is more in the \"bullet hell\" style. Avoid white energy balls flying around you. In de Sitter space, freely moving objects diverge exponentially from each other.  You must be careful to keep close to the main star -- if you lose it, you will never catch it again!</p>\n<p><strong>What do resources do?</strong></p>\n<p>Cyan hearts is hull health, it is used up when you are hit. Red rockets are ammo, it is used up when you shoot.  Green octagons are fuel, they are used up when you accelerate. Blue tanks are oxygen, they are used up proportionally to your proper time. In AdS, there are also golden stars, which you should collect for score.</p>\n<p>\n</p>\n<p><strong>How is the screen displayed?</strong></p>\n<p>The set of spacetime points at time = 0 is a sphere in dS, and a hyperbolic plane in AdS. This set is displayed  on the screen in the azimuthal conformal projection (i.e. Poincaré model in AdS, stereographic in dS) by default (Relativity Hell uses the RogueViz engine, so all its projections are also available; Beltrami-Klein makes the AdS tessellation look like the Poincaré model of the hyperbolic plane). The frame of reference changes because of the passage of time, acceleration, or moving the camera in the pause mode.</p>\n<p>\n</p>\n<p><strong>Why are the objects stretched so weirdly?</strong></p>\n<p>This is Lorentz length contraction.\r\n</p>\n<p><strong>Is it really what we would see?</strong></p>\n<p>No -- we would of course only see things as they were when the light left them. While in the real world we could  not see what is currently going on elsewhere because information cannot travel faster than c. this is not a problem in Relative Hell because the simulation is deterministic except the player movement. In the pause mode, when you advance/revert the time, you can see a dark circle -- this represents your \"future\", that is, the area reached by the light you emit currently (you can theoretically affect this future), or \"past\", the area you would have seen by now. There are also other visual effects which are not represented (see Slower Speed of Light). </p>\n<p>\n</p>\n<p><strong>Could the missiles move faster?</strong></p>\n<p>They move (by default) at about 0.995c. So they could, but not by much.  The reason why nothing can move faster than light is that there would be a frame of reference in which it would move to the past. You can experiments with this as follows: 'p' to pause the time, 't' to display the proper time for every object, 'wasd' to change the frame of reference.</p>\n<p>\n</p>\n<p><strong>What about Minkowski spacetime for comparison?</strong></p>\n<p>There is no Minkowski (nor Galilean) spacetime currently, but in AdS you can reduce the scale of the game, which  reduces the effects of curvature. You can also play Velocity Raptor of course.</p>\n<p><strong>Why is everything spinning in the AdS game?</strong></p>\n<p>While in standard hyperbolic geometry only the space is stretched, in AdS both space and time are stretched.  Suppose we play the game without moving (only the time passes). Imagine an object behaving in such a way that it is displayed at a fixed point of space. Its time would run slower (the further from the origin, the slower). All objects in Relativity Hell, except the player, move through the spacetime along time-like geodesics;  our imagined object would not, time-like geodesics are \"attracted\" towards the center. Due to the dilation of time, spinning makes everything synchronized and stable.</p>\n<p>\n</p>\n<p><strong>Can I turn the spinning off in the AdS game?</strong></p>\n<p>Yes, there is such an option, but it is less intuitive then.\r\n</p>\n<p><strong>What's going on with the weird blue-and-orange cells in AdS?</strong></p>\n<p>These are gates. They damage you when they are closed. Every point of the gate is opened/closed simultaneously,  according to the gate's proper time. (So from the player's point of view, the whole gate does not appear to be opened/closed at a fixed time.)</p>\n<p>\n</p>\n<p><strong>What's going on with the Earth texture in dS?</strong></p>\n<p>This is a visualization of how the space expands in dS. Every point of Earth moves along a time-like geodesic.  All objects in Relativity Hell, except the player, move through the spacetime along time-like geodesics*.</p>\n<p>* However, the specific points of game objects in dS do not, as otherwise they would have to expand.</p>\n<p>\n</p>\n<p><strong>Why do the visuals glitch after I lose track of the main star in dS?</strong></p>\n<p>Numerical errors are much more serious in hyperbolic/dS/AdS spaces because of the exponential expansion.  The current implementation of the dS game avoids precision issues when the player keeps close to the main star, but not otherwise. (RogueViz knows how to deal with numerical issues in hyperbolic space, and this carries over to AdS, so this problem should not happen there.)</p>\n<p>\n</p>\n<p><strong>Where can I learn about how these spaces work mathematically?</strong></p>\n<p>Maybe we will make a video, write a paper or something... for now you can read Wikipedia or the expository articles linked there.</p>\n<p>\n</p>\n<p><strong>What about multiplayer?</strong></p>\n<p>Interestingly, a real-time relativistic multi-player game does not seem possible -- the dilation of time would make the in-game time run differently for both players, which is hard to simulate in real world.</p>\n<p>\n</p>\n<p><strong>Could the world of the AdS game be wrapped like in Asteroids?</strong></p>\n<p>If the space is closed, the time is closed too... a game like this could not work with closed time-like loops :)\r\n</p>\n<p><strong>What about 3D?</strong></p>\n<p>AdS and dS are defined in any dimension, although we believe two dimensions are better to showcase ideas like this.  Also the spinning trick used to keep the AdS stable works only in even-dimensional spaces AFAIK.</p>\n<p><strong>This AdS looks similar to the \"universal cover of SL(2,R)\" Thurston geometry.</strong></p>\n<p>Indeed, they are quite related -- in that Thurston geometry, the time dimension is changed into a space dimension, losing a bit of symmetry in the process. The implementation of AdS is based on the implementation of twisted H2xR geometries in RogueViz.</p>\n<p>\n</p>\n<p><strong>The framerate is low on my computer.</strong></p>\n<p>Yeah, not everything is optimized yet. In the AdS game, try to reduce the \"tiles to generate per frame\" and/or\r\n\"tiles to draw per frame\" in the game parameters. In the dS game, try reducing the quality of the Earth texture, or disable it by setting the intensity to 0 (particle/texture settings).</p>\n<p>\n</p>\n<p><strong>Is the source code available?</strong></p>\n<p>Yes. (See the top comment in ads-game.cpp to learn how to build.) Have fun!</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-07T22:29:45", "background_image": "https://media.rawg.io/media/screenshots/f52/f52bff118f94c2f7d6f86e7673f5af4a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zeno Rogue"], "genres": ["Shooter", "Educational"], "publishers": [], "esrb_rating": null}