{"id": 863754, "slug": "one-last-try", "name": "One Last Try", "name_original": "One Last Try", "description": "One Last Try is an online platform game of up to 4 players, where your objective is to survive as long as possible, being it alone or with friends.<br/><br/>5 years after the outbreak, you are one of the few humans left. You are running out of resources, and hiding is not an option anymore. Tomorrow you will fight them. Using the remaining communication you have with other survivors, you all agreed to fight one last stand. One last try in getting their numbers down... the hard way.<br/><br/>Equip and upgrade weapons, stock healing items for yourself and your allies, build defensive or offensive structures to aid you, level up the 6 different classes, each one with their own Skill Tree, and buy a jetpack... just in case.<h3>Key features</h3><ul><li> <strong>Online Co-Op</strong> - Up to 4 players. No IP addresses needed, just invite and play together<br/></li><li> <strong>31 Weapons</strong> - If you count your fists, 32<br/></li><li> <strong>Upgrade your weapons</strong> - Use gears to level up your weapons's stats, up to the Legendary level<br/></li><li> <strong>Structures</strong> - Build structures to hold the infected off<br/></li><li> <strong>Survival or Chaos</strong> - Play a wave defense mode or start with a lot of resources to build an only defense, to last as long as you can.<br/></li><li> <strong>11 unique enemies</strong> - \"Stalkers are coming!\"<br/></li><li> <strong>4 Maps</strong> - Choose the place for your last stand<br/></li><li> <strong>Consumables</strong> - You can use a First Aid Kit to heal your friends, or take some vitamins to boost your damage<br/></li><li> <strong>6 Classes</strong> - Each class has its own strengths<br/></li><li> <strong>Skill Trees</strong> - Each class has its own skill tree with 18 skills<br/></li><li> <strong>Airdrops</strong> - Airdrops will eventually drop to aid you<br/></li><li> <strong>Special Weapons</strong> - Rocket Launcher, Flamethrower, and a Minigun. Because why not?<br/></li><li> <strong>Day and night cycles</strong> - The world can't stop spinning, right?<br/></li><li> <strong>50 Achievements</strong> - 17 Bronze, 20 Silver, and 13 Gold Achievements</li></ul>", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-10T03:56:05", "background_image": "https://media.rawg.io/media/screenshots/433/4339a7e3f2ff404ca4eb012e0a43d2cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nícolas Krüger"], "genres": ["Action", "Strategy", "Casual", "Indie"], "publishers": ["Nícolas Krüger"], "esrb_rating": null}