{"id": 863717, "slug": "maudits-fantomes", "name": "Maudits Fantômes", "name_original": "Maudits Fantômes", "description": "Cursed Ghosts\r\n<p>Made for Ludum Dare 51. Theme: ‘Every 10 seconds’</p>\n<p>A twist on a famous arcade classic. Pills, here!!</p>\n<p><strong>(06/10/2022) IMPORTANT:</strong> during Ludum Dare 51’s voting period, I will let the navigator version as 1.0.1, since the site does not allow you to put two Web players simultaneously; nevertheless, be aware that later versions (such as 1.0.2 now) will be available for download (including the navigator instance) if you want to try them out. In particular, 1.0.2 does a better job at displaying a suitable difficulty and is so close to the original that it is worth a look to get a better idea of how the game plays out.<br/></p>\r\nTechnical note\r\n<p>The game runs in fullscreen mode, which causes trouble for the navigator version (which I had hidden from displaying). Desktop versions should work.</p>\n<p>In the navigator version (which has thus smaller resolution): the love.js fullscreen mode (using the lower-left button) seems not to have the keyboard respond (at least for me under Firefox), only the mouse; nevertheless, <strong>the itch.io fullscreen mode (using the lower-right button) works, although it only extends the Web player’s background</strong>. I recommend using a desktop version if you can for better comfort, even though the navigator version seems playable.<br/></p>\n<p>(<strong>DISCLAIMER:</strong> still at least one bug — ghosts do not disappear once sacrificed —, but I am trying to solve this as quickly as possible. <strong>Update:</strong> fixed! Silly variable misnaming!!)</p>\n<p><strong>DISCLAIMER:</strong> a technical navigator-related bug causes the game to crash when you press Return to reload a level (this is related to sound). Hiding the navigator version temporarily to fix this. <strong>EDIT:</strong> apparently solved!<br/></p>", "metacritic": null, "released": "2022-10-02", "tba": false, "updated": "2022-10-07T23:18:12", "background_image": "https://media.rawg.io/media/screenshots/4d6/4d685a71faa0e3e7137b5b8486f9773a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 84, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Mossieur Patate"], "genres": ["Action"], "publishers": [], "esrb_rating": null}