{"id": 863772, "slug": "the-nameless-2", "name": "The Nameless", "name_original": "The Nameless", "description": "The Nameless is a classic survival horror game in a first person perspective set on an abandoned research vessel.<br/><br/>Shortly after the end of WWII, a former American soldier, struggling to readapt to everyday life, chooses to pursue the quiet career of a lighthouse keeper on a remote island off the coast of Maine. However, after a seemingly abandoned ship floats by, and the subsequent decision to investigate said ship, turns the job into anything but quiet.<h3>EXPLORE</h3>Assume the role of this unnamed protagonist and take on the task of uncovering the mystery behind this \"ghost ship\" and it's former (and current) inhabitants.<h3>FIGHT OR FLIGHT?</h3>When encountering these \"inhabitants\", you must make your choice on how to deal with them. Each scenario will be different, so take care in choosing whether to run and hide or stand and fight.<h3>RESOURCE MANAGEMENT</h3>Although the weapons you will find may not be the most ideal in self-defense situations, it would be in your best interest to make sure you have enough resources before engaging with an enemy.<h3>PUZZLES</h3>It's a good idea to have your best wits about you, as you may run into some strange contraptions that you may need to solve before continuing your investigation.<h3>FEATURES</h3><ul><li>First-person perspective<br/></li><li>Retro inspired graphics<br/></li><li>De-emphasized combat<br/></li><li>Lovecraftian enemies<br/></li><li>Violence and gore<br/></li><li>Fully explorable environment</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-10T04:20:41", "background_image": "https://media.rawg.io/media/screenshots/d5f/d5f324356e2a3ccd8698ba214aa1a3de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 214, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sacrosanct Studios"], "genres": ["Indie"], "publishers": ["Sacrosanct Studios"], "esrb_rating": null}