{"id": 863735, "slug": "cave-guessers", "name": "Cave Guessers", "name_original": "Cave Guessers", "description": "<strong>Cave Guessers is a casual game with 4 different game modes for 2 to 16 players. Pick a prompt and then either describe it using concepts, words, music, or lights and shadows! Combine any game modes into a personal tournament for an epic battle for most points!</strong><br/><br/>Game modes:<br/><br/><strong>Watch your words:</strong> Here it’s all about words! Describe away but make sure not to use any of the prohibited terms in your text. Did you start typing an illegal term? Just delete it, right? Well… anything typed is set in stone, — you have been caught! That’s one less point for you, but don’t worry. Just try to make it up before your time has run out!<br/><br/><strong>Break it down:</strong> Explain your prompt using concepts only! So what’s a book? A rectangular object of small to medium size, made of organic material and found in urban locations. Hm.. that could also be a wooden board! But no sweat! To narrow it down, guessing players receive some clues.<br/><br/><strong>What’s that tune?</strong> Pick from a list of popular songs and tickle your melodic brain! Try to re-compose the song using the instruments provided! Don’t worry, it’s enough to know a few seconds of the song, and you don’t *have* to hit the right pitch. At the end listen to all compositions and try to guess the underlying songs!<br/><br/><strong>Shadow on the Wall:</strong> Combine several shapes to cast shadows or coloured lights onto the cave wall. Can your friends recognize the item shown? Or is that snake shadow you have created just a bit too similar to a river?<br/><br/>You’re done with the default word lists? Create your own via the in-game editor and publish it to the Steam Workshop. Or browse the Workshop for items already published!<br/><br/>With Twitch integration! Stream and play with your chat!", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-10T03:29:38", "background_image": "https://media.rawg.io/media/screenshots/0a4/0a446054b0d87fe5de2851227a73521f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Acureus"], "genres": ["Casual", "Indie"], "publishers": ["Acureus"], "esrb_rating": null}