{"id": 86402, "slug": "shooting-kill-zombies", "name": "Shooting Kill Zombies", "name_original": "Shooting Kill Zombies", "description": "https://www.youtube.com/watch?v=whWAiNrOStQ&amp;feature=youtu.be<br/>One day all zombies return from darkness, zombies are over all the world, zombies damage everything around, and zombies eat all people brain, is apocalypse day?? NOPE!!! You, only you can save the world by shooting to kill zombies all, clear them all from my world.<br/>     You hate zombies, you want shooting to kill zombies all and save the world for turning back to piece.  Arm yourself with the best guns and shooting to kill zombies right now, shooting zombies all to die and bring piece for the world. Save the world is your mission, only you can save the world from death by shooting to kill zombies all.<br/>     This game is good shooting to kill zombies style game ever. You like action games, you like shooting zombies in the dark. You like to kill zombies all. You like action shooting game. Download and play this free shooting to kill zombies game right now.<br/><br/>HOW TO PLAY<br/> - There a help on this shooting to kill zombies game so you can see it for detail<br/> - Joystick for moving your player hero avoiding zombies and shooting zombies all<br/> - Fire button for shooting your gun to kill zombies<br/> - Throw grenades killing many zombies<br/> - Switching your weapons, you can use pistol, rifle or AK47 to shoot zombies die, more nice weapon and guns will update for you to shoot zombies<br/><br/>FEATURE<br/> - Dark ruined city caused of zombies damaged<br/> - zombies and zombies bosses for you to shoot<br/> - This shooting zombies game is now only single play mode, but multiplayer and more exciting features will come soon", "metacritic": null, "released": "2016-09-07", "tba": false, "updated": "2019-07-05T03:23:53", "background_image": "https://media.rawg.io/media/screenshots/a15/a1563071d2f84f8bc9d5d8be46defdd0_8gDMfh3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["thien tran vu"], "genres": ["Action", "RPG"], "publishers": ["thien tran vu"], "esrb_rating": null}