{"id": 864139, "slug": "gun-in-60-seconds-remix", "name": "Gun in 60 Seconds Remix", "name_original": "Gun in 60 Seconds Remix", "description": "<p>Gun in 60 Seconds Remix (G.I.S.S.R.) puts you in the boots of Billy Bang Bang, a gunslinger out to prove that he's the best shot out there. Equipped with a .44 Magnum and a Boom Stick, you have 60 seconds to help Billy shoot the different objects launched by the machines from both sides.</p>\n<p><strong>CONTROLS</strong>\n</p>\n<p><strong>For Mobile:</strong>\n</p>\n<p>Tap on screen to shoot in that direction.<br/>Press Handgun or Shotgun button to switch weapons.<br/>Double-Tap Handgun or Shotgun button to reload.</p>\n<p><strong>For Desktop:</strong>\n</p>\n<p>Left/A - Left<br/>Right/D - Right<br/>Q/RMouse Click - Switch Weapon<br/>R/MMouse Click - Reload<br/>1 - Handgun<br/>2 - Shotgun<br/>LMouse Click - Shoot<br/>Esc - Pause/Unpause</p>\n\n<p><strong>TIPS AND TRICKS</strong>\n</p>\n<ul><li>Use the shotgun for bunched up targets. The shot spread is good for hitting multiple close targets.</li><li> Juggle the tin can for points. Use the Magnum Pistol to get more hits off it.</li><li>Shoot the bomb when there are many targets within its explosion range.</li><li>Collect coins for extra points. Coins will also trigger the hourglass target.</li><li>You can shoot to collect coins while they are airborne.</li><li>Prioritize the hourglass over other targets, it will give you a time extension.</li><li>Ricocheting bullets will score you more points.</li><li>Shooting multiple targets with one bullet will score you more points.</li><li>Bullets pass through bottles and ricochet off the cans.</li><li>Move around and avoid getting hit by the bird's poop. It will drag your score back down to zero!</li><li>You don't get points for shooting and killing the red bird, but doing so will guarantee the bird won't poop.</li></ul>", "metacritic": null, "released": "2022-10-09", "tba": false, "updated": "2022-10-10T06:53:57", "background_image": "https://media.rawg.io/media/screenshots/984/984953d6384761dd9821288074490960.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["plazatin"], "genres": ["Action"], "publishers": [], "esrb_rating": null}