{"id": 86411, "slug": "ski-jumping-pro", "name": "Ski Jumping Pro", "name_original": "Ski Jumping Pro", "description": "Ski Jumping Pro delivers the sheer thrills of hurtling down a snow-packed ski ramp like no other game. Brand new ultra-realistic 3D graphics, a full single-player career mode and global  leaderboards make Ski Jumping Pro THE ultimate winter sports simulation.<br/><br/><br/>STUNNING NEW 3D GRAPHICS <br/>Ski Jumping Pro’s graphics have been completely reworked to levels of realism so good you’ll think that you’re on the ramp! <br/><br/>MULTIPLE GAME MODES<br/>Live the life of a professional ski jumper in Career mode or jump straight into the action with Quick Jump mode, both with Casual and Pro difficulty levels.<br/><br/>HUGE VARIETY OF EVENTS AND COURSES<br/>Take part in 62 events across 32 unique venues from around the world.<br/><br/>DEEP CHARACTER CUSTOMIZATION<br/>Choose from over 50 clothing and board accessories including gloves, skis, helmets, boots and suit items.<br/><br/>MULTIPLE CONTROL METHODS<br/>One-tap or innovative gyroscope controls cater for both new and veteran Ski Jumping Pro players alike.<br/><br/>HUGE REPLAYABILITY<br/>Unlock new levels, contests and venues as well as super challenging ‘+’ mode once you’ve mastered Pro mode.<br/><br/><br/>NOTE<br/>• For the best possible experience, we recommend a Wi-Fi connection.<br/>• Parts of this game require an active Internet connection.<br/>• Watching adverts will increase your data consumption.<br/>• Depending on the network used, performance can vary.<br/><br/><br/>SUPPORT<br/>Problems &amp; Questions:<br/>Visit www.kalypsomediamobile.com or write us an e-mail at supportmobile@kalypsomedia.com<br/><br/>Privacy Policy:<br/>https://www.kalypsomedia.com/eu/privacy-policy", "metacritic": null, "released": "2013-01-31", "tba": false, "updated": "2019-10-22T14:21:44", "background_image": "https://media.rawg.io/media/screenshots/bad/badc3a4c397c20abe2062648233b9693.jpg", "website": "http://www.kalypsomedia.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 390, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Kalypso Media", "Kalypso Media Mobile"], "genres": ["Simulation", "Sports"], "publishers": ["Kalypso Media"], "esrb_rating": "Everyone 10+"}