{"id": 864133, "slug": "connect-4-itch-rabbit10", "name": "Connect 4 (itch) (RabBit1.0)", "name_original": "Connect 4 (itch) (RabBit1.0)", "description": "<p>This is a computer version of the popular game Connect 4: you need to have four tokens of your own color inline (horizontal,  vertical or diagonal).</p>\n<p>The game is easy to play:\r\n  </p>\n<p> Firstly you need to choose which version of game you want to play: player vs player (on one computer) or player vs computer (the machine maybe is not the most clever, but won’t let you win easily).</p>\n<p>Secondly, you need to choose your color.\r\n  </p>\n<p> If you play with the computer you can choose a color that you like and the computer choose another one. \r\n  </p>\n<p>But if you play with another human, there are some simple rules for choosing the colors of tokens:\r\n  </p>\n<p> If one player chooses e.g. red color, the second one can not do this. This color is invisible to this player.\r\n  </p>\n<p>Choice can be changed by clicking on a blurred color.</p>\n<p>When you decide that this color is yours, you can start a game. A screen with colors assigned to players will be shown.</p>\n<p>Now you can play. Your color in front of the player icon means that now is your turn to drop the token into the column – the column will be highlighted when you hover a mouse over it. And you can try to achieve the main purpose of the game. During the whole competition, you can exit from the game, go back to the menu or retry the game. All of these buttons are visible after clicking on the menu button that is placed in the bottom right corner. </p>\n<p>When one of the players drops four tokens of their own color to the horizontal, vertical or diagonal line, the game will be ended and information about the winner will be displayed on a screen.\r\n</p>", "metacritic": null, "released": "2022-10-09", "tba": false, "updated": "2022-10-10T06:51:29", "background_image": "https://media.rawg.io/media/screenshots/819/8195d4265c27826eb65ca01df884c55a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RabBit1.0"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}