{"id": 86421, "slug": "crazy-maze-traffic-puzzle", "name": "Crazy Maze - Traffic Puzzle", "name_original": "Crazy Maze - Traffic Puzzle", "description": "Jimmy the Taxi Driver has to make his customers happy! That’s why he needs you! Beat the rush hour! Help this friendly monkey find the best way through traffic. Everything seems easy in the beginning, but as you progress, the crazy mazes of traffic jams become more difficult to solve. At first, all you need is a quick finger to drive the taxi through the streets to its destination. But new challenges are added during every new ride! <br/><br/>FEATURES OF CRAZY MAZE TRAFFIC PUZZLE<br/>- intuitive touch controls (but still exciting for adults)<br/>- 11 worlds, 99 clever puzzles <br/>- multiplayer mode against Facebook friends and other players<br/>- taxi driving fun; beat traffic, find your way!<br/>- slowly increasing difficulty level<br/>- regular updates<br/><br/>WHAT PLAYERS ARE SAYING<br/>“It’s fun, entertaining and looks great!”<br/>“Really tricky and easy to handle”<br/>“Cool real-time puzzle game”<br/>“Excellent puzzle game. Challenging puzzles are a lot of fun”<br/><br/>HOW TO PLAY<br/>Traffic jam, rush hour or free travel: every level is a new puzzle. Using your finger, drive the path that you want the taxi to take through traffic. Collect bonus items, get the best passenger ratings.<br/><br/>CONTACTING THE DEVELOPER<br/>Problems, praise, criticism: <br/>Visit www.kalypsomediamobile.com or contact us directly at supportmobile@kalypsomedia.com<br/><br/>Data privacy policy: <br/>http://kalypsomediamobile.com/impressum/<br/><br/>NOTE<br/>Internet: portions of this game require an active internet connection. Depending on the Wi-Fi and network status, connection times may differ. We recommend a wireless connection for the optimal gaming experience.<br/>In app purchases: Playing Crazy Maze - Traffic Puzzle is completely free, but some game extras can be purchased with real money.<br/>Watching reward videos will increase your data consumption.", "metacritic": null, "released": "2016-03-30", "tba": false, "updated": "2019-10-22T14:21:44", "background_image": "https://media.rawg.io/media/screenshots/3c1/3c1c950ebeb8dcb38cedafff51be385b.jpg", "website": "http://www.kalypsomediamobile.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Kalypso Media", "Kalypso Media Mobile"], "genres": ["Arcade", "Puzzle"], "publishers": ["Kalypso Media"], "esrb_rating": null}