{"id": 864277, "slug": "ult", "name": "ULT", "name_original": "ULT", "description": "<p>ULT is a 2D horde-style action game with a focus on fast-paced combat and is intended for anyone looking for a challenge.</p>\n<p>This is obviously a very early demo, more  a proof of concept than anything.  Any and all feedback is welcome, don't worry about offending me, this project won't work without your help. I believe if we combine my brain power with yours we could create something amazing.<br/></p>\n<p>The full version will have all the things fans of the horde genre expect: upgrades for weapons/abilities, in-level item drops and environmental assists, local/online co-op, etc. </p>\n<p>What the full version WON'T have is a nerfed base loadout. I want you to feel powerful from the start and just keep getting stronger. The movement should feel intuitive and the weapons punchy, I don't want you to start out moving at a crawl with underpowered weapons. There's also an enemy counter and FPS counter in the bottom right corner, that won't be in the final version.</p>\n<p>Controls:</p>\n<p>lmb = bolt shot</p>\n<p>rmb = shotgun</p>\n<p>L-shift = rocket</p>\n<p>spacebar = dash</p>\n<p>R key = pause</p>\n<p>Gameplay tips:</p>\n<p>-Your shots do not disappear when they hit enemies, they are based on a timer. This allows you to handle large crowds and hit enemies that are farther away.</p>\n<p>-Melee enemies constantly seek out the player, ranged enemies move randomly.</p>\n<p>-Melee enemies have 3 hp and ranged enemies have 10 hp.</p>\n<p>Thanks for checking it out, please let me know what you think.</p>\n<p>Music by Trevor Lentz: https://opengameart.org/users/trevor-lentz</p>\n<p>Background images by Screaming Brain Studios: https://opengameart.org/content/noise-texture-pack</p>\n<p>Here's a discord server to discuss the project:</p>\n<p>https://discord.com/channels/1028418159805480961/1028418160283631709<br/></p>", "metacritic": null, "released": "2022-10-08", "tba": false, "updated": "2022-10-10T07:45:22", "background_image": "https://media.rawg.io/media/screenshots/0fa/0fac760fde1bb55014704b4fc1f5d275.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Built In A Day"], "genres": ["Action"], "publishers": [], "esrb_rating": null}