{"id": 864483, "slug": "mischief-a-low-table", "name": "Mischief (A Low Table)", "name_original": "Mischief (A Low Table)", "description": "<p>You are a rat named Smalls. In your lifelong quest to collect as many shiny things that you can get your grubby little mitts on, your travels have led you to a location of fabled wonder, something your rat brethren refer to as a ‘house’. You have with you your rat friend Biggie, for rats always travel in packs. Upon entering the house, you are greeted with contraptions and machinations you’ve never seen before. Huge arches, monolith sized obelisks, rotating blades? It’s enough to send any cowardly rat running to the hills. But you aren’t that kind of rat, and you also know there is no risk without reward. Using you and your friends' unique moveset to maneuver through the foreign landscape, you’re fully intent on claiming your prize, however enigmatic it might be. It’s time to cause some mischief. </p>\n<p>Controls:<br/>Arrow Keys: movement<br/>Z: Jump<br/>X: Action<br/>C: Switch Rats<br/>R: Reset Level<br/></p>\n<p>This project was created for a Game Design class in May 2020, using the Gosu development library for Ruby. It was then re-created using Godot in December 2020, and it was our first project using Godot. We aren't planning to update the game further, but the Godot version and the original Ruby version have been uploaded here as a piece of history.<br/></p>\n<p>Each rat has different abilities. Smalls jumps higher and can climb certain walls. Biggie can perform an airdash through sheer will that can break some blocks and push others, and he has padded feet that allow him to stand on dull light-grey spikes.</p>\n<p>Credits:<br/>Duncan Glynn -- Programming, Level Design, Art<br/>Jenny Stokoszynski -- Design, Playtesting<br/>Daequan Peele -- Design, Music<br/></p>", "metacritic": null, "released": "2022-10-08", "tba": false, "updated": "2022-10-10T09:16:34", "background_image": "https://media.rawg.io/media/screenshots/e28/e2831623367fa502c2cdb89314ec6fb3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["A Low Table"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}