{"id": 864425, "slug": "naikos-room-demo", "name": "Naiko's Room (DEMO)", "name_original": "Naiko's Room (DEMO)", "description": "<p><strong>\"Wake up, water the plant, stare into the clock, read a book, go to sleep, repeat.\"</strong></p>\n\r\n-----\r\n<p>Naiko's Room is a RPG Maker pshychological horror game mainly focused on telling a story of isolation, weird books, nightmares, shaky friendships, pills and memories torn apart.</p>\n<p>Follow a young, pathetic girl inside a cold and unfamiliar room, as she does her daily routine. That's it, nothing more, nothing less, make a relaxing living with the few things that you can do, and everything will be okay... Let's just hope she can remember her.</p>\r\n-----\r\n<p><strong>Currently this game is a work-in-progress, and only the DEMO is availble. Some things may change in the full release.</strong></p>\n<p>The DEMO is 20-30 minutes long and has only 1 ending.</p>\n<p>The content warnings are in the game. Please read them, and don't play this game if you find such subjects disturbing or if you're in a bad place mentally. Keep in mind that this is a psychological horror game, and it might go over some serious subjects.</p>\n<p>This is my first game made in RPG Maker ;; I am still experimenting with the program and with game making in general. This whole game is kind of a learning experience for me. Hopefully the Full Version will be more polished.</p>\n\n<p>Hope you're not enjoying your stay inside Naiko's Room!</p>", "metacritic": null, "released": "2022-10-08", "tba": false, "updated": "2022-10-10T08:44:51", "background_image": "https://media.rawg.io/media/screenshots/278/278b219f34d46838c857396c2907f6ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alxe"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}