{"id": 864481, "slug": "tiny-game-1-simple-puzzle", "name": "Tiny Game #1: Simple Puzzle", "name_original": "Tiny Game #1: Simple Puzzle", "description": "<p><strong>Summary: </strong><br/>This is the first tiny game that I successfully completed via an Unreal Engine 5 tutorial.  I am building a total of 8 or 9 games purely from UE5 tutorials, in order to learn the basics of the engine. This particular game which I call 'Valley Puzzle' is a very simple game that shows off some basic UE5 features.  The tutorial I followed is Your First Game In Unreal Engine 5 in Epic's Dev Community site, and you can build the same game by following the tutorial too! </p>\n<p><strong>Installing and Running:<br/></strong>Download the zipped file, then unzip the file. Run the TinyGame1.exe executable file, and the game should begin! <br/></p>\n<p><strong>Gameplay Directions:<br/></strong>You're an ant-bot, in a valley with another ant-bot friend. You need to escape through the doors on the far end of the valley, however they're shut. A pressure plate opens up some of the doors. You need to figure out how to open the doors, then escape through one. Luckily, you can drop orbs, which the other ant-bot will then try to pick up. </p>\n<p>Controls:</p>\n<ol><li>To move, point your mouse and hold left click. </li><li>To drop an orb, press and release spacebar. </li></ol>\n<p>This is an extremely simple implementation that I built using a tutorial, and there's no \"Quit\" feature. To end the executable, simply alt-tab back into windows and close the application.  </p>", "metacritic": null, "released": "2022-10-08", "tba": false, "updated": "2022-10-10T09:15:39", "background_image": "https://media.rawg.io/media/screenshots/f4a/f4a75a979c0226c38897ca6aacd8c83e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Simple Shorts"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}