{"id": 864422, "slug": "gods-of-savvarah", "name": "Gods of Savvarah", "name_original": "Gods of Savvarah", "description": "<p><strong>\"Gods of Savvarah\"</strong> is an interactive story (visual novel) in the fantasy genre, inspired by classic RPGs.</p>\n<p>Savvarah is an evergreen paradise hidden from the eyes of strangers.</p>\n<p>The godlike and all-powerful tyrant Ackotal has sealed himself off from the world and created his own state in the middle of the forest with a rigid hierarchy, at the very bottom of which are lizard-slaves. Hasvah was one of them. </p>\n<p>One day, however, the slave receives the chance not only to break out of his imprisonment, but also to change the destinies of other characters and entire nations. </p>\n<p>In this great adventure, the protagonist visits different countries, encountering their inhabitants, both ordinary people and gods. </p>\n<p>The world of Savvarah is ruthless, so the protagonist has to either fight for his life or die along the way. </p><p><strong>Our main features are:</strong></p>\n<p>- An original fantasy world, in which Hasvah will visit around five major locations;</p>\n<p>- Choices can lead you to seven endings. Besides, there are even more ways to achieve these endings;</p>\n<p>- Dozens of characters, each with their own story and appearance;</p>\n<p>- Intense battles in every chapter;</p>\n<p>- An elaborate visual style and an original and diverse soundtrack;</p>\n<p>- Nine chapters planned. Meanwhile, you can't see all the chapters in a single playthrough, and a full picture of the world and an understanding of a character's motives and actions can only emerge in subsequent playthroughs.</p>\n\n<p>https://www.patreon.com/Sinovar/posts<br/></p>\n<p>https://discord.gg/meMGzrVsm5</p>", "metacritic": null, "released": "2022-10-08", "tba": false, "updated": "2022-10-10T08:43:09", "background_image": "https://media.rawg.io/media/screenshots/532/5327795b3ea36c23ca82b9351906455c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 337, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ST Sinovar"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}