{"id": 864549, "slug": "rude-bear-rising", "name": "Rude Bear Rising", "name_original": "Rude Bear Rising", "description": "<p>NOTE: You know when you have hit an enemy, because their health bar goes down and it plays a sound. You have to be close, because you have small arms. You can get the harpoon to get range. </p>\n<p>The heart-warming prequel to everyone's favourite bear game is here. In Rude Bear Rising you take control of a confused bear, swimming around an underwater labyrinth to defeat an evil wizard and save the world. <br/></p>\n<p>Although the wizard can potentially be fought by Rude Bear immediately, it's possible to search for items to make the battle more survivable. The items are found in chests, which are guarded by fierce enemies. <br/></p>\n<p>It started out Limbo inspired and turned into a free roam Mega Man homage. <br/>Controls: <br/>A &amp; D - Move left and right. <br/>Space - swim <br/>Left click - Attack (And aim with mouse with harpoon gun) <br/>E to enter boss worlds. <br/>There's also a glitch where you get stuck in like.. infinite gameover. If you game over you'll have to restart, I'm afraid. <br/></p>\n<p>Labyrinth monsters: <br/>Spitter - Hops and spits. <br/>Cornelius - A giant eye. <br/>Immortal Crab - Generally pretty happy about the whole situation. (Not quite as immortal as the name might suggest). <br/>Stalac-might - A stalactite with a vengeance. <br/>Swarnile - Part sword, part shark, part rhino, part crocodile. All horrifying. <br/></p>\n<p>Boss monsters: <br/>Discover them for yourself! Their names are: <br/></p>\n<p>Smashy, Skate, RadFish, Cunning and The Wizard. <br/></p>\n<p>Unlockable powerups: <br/>Snorkel, Harpoon, Flippers, Armour, Torpedo <br/></p>\n<p>Code, vector art and music by Alex Rose. <br/>Pixel art by Antony Dewar. <br/></p>\n<p>Concept and sound effects by both of us. <br/></p>\n<p> <br/>Would've liked to have added 3 more forms to the final boss, but alas, there was a lot I couldn't put in. <br/>Edit: If I'd realised it ended 2 hours after I though it did, I could've added a proper game over/credits etc. <br/>But oh well.</p>", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-10T09:42:49", "background_image": "https://media.rawg.io/media/screenshots/8b9/8b96fb5cb4fac4f11f166283093208ef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alex Rose"], "genres": [], "publishers": [], "esrb_rating": null}