{"id": 864591, "slug": "revelation-216-nes", "name": "Revelation 21:6 NES", "name_original": "Revelation 21:6 NES", "description": "<p>NES example that shows the text of Revelation 21:6 made famous by the game Fallout 3. This was made by modifying the code found here  https://github.com/christislord12/John-3-16-NES</p>\n<p>The License say's it can be Modified and Redistributed in any form so here it is.</p>\n<p>I updated the original version to match as close as I could to the King James Version of the Bible, rather than the original being more close to the Text found in Fallout 3, but I left the original Rom Untouched. <br/></p>\n<p> Only the NES ROM Is available so no source code and I don't yet know how to set it up for HTML.<br/><br/>I modified someone else's code,  and converted it to NROM that is Mapper 0. Then I made a second Revelation 21:6  NES Example that uses a TextBox. This time it is in a Zip Archive that has the new NES Rom and a Table file that you can use with a Hex Editor like Translhextion  to modify the TextBox Rom That I used for the second version. I had to change up the wording a bit to fit the Text in so it's not a Perfect Example but it works. <br/></p>\n<p> For the original version you are free to modify the files yourself and use them where ever or however you like.  For the TextBox or Second Version you should give a link back to here if you use it other than that you can freely do whatever you want with it.</p>\n<p>Soon maybe I'll get on github and put the TextBox version on there with more of it's source, sorry there is no Devlog, I don't yet understand how that works,. <br/></p>", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-10T10:00:15", "background_image": "https://media.rawg.io/media/screenshots/dd5/dd5d242f35b9a68ed351963069e58b0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Debiru"], "genres": [], "publishers": [], "esrb_rating": null}