{"id": 86454, "slug": "golf-perfect-shot-experts", "name": "Golf Perfect Shot Experts", "name_original": "Golf Perfect Shot Experts", "description": "Golf perfect shot experts is equipped with responsive controls to give you a perfect golf shot and ultimate golfing sports game experience. Be the real golf pro star and play ball to the hole. Feel the real excitement while playing golf world tour 3d game. Easy to play but hard to master golf real game. Show your best skills to become the mast of royal game by scoring impossible hole. You can play hole in different courses with real rules in golf master real sports game.<br/><br/>In this Golf Tournament, enjoy the top free golf game with lots of challenging levels. A must have play game with addictive levels and interesting gameplay. Score a hole in single shot to get more cash, use cash to buy more sticks and kits in this game. Join the extreme tournament of talents and win the real golf championship to top the leaderboard. You can hit with three types of golf sticks: long distance, medium distance and short distance sticks to make a perfect hole in real king golf tournament game. You will enjoy the most authentic gameplay in golf perfect shot experts game.<br/><br/>Features of Golf Perfect Shot Experts:<br/>•\tDifferent game environments: Golf Ground, Green Meadows, city Parks and Island<br/>•\tComplete real looking 3D golf course ground<br/>•\tCharacters to Choose: Male and Female<br/>•\tDifferent Weather Conditions: Rainy, Cloudy and sunny<br/>•\t3 type of sticks or putters: Long range, Medium Range, Short Range<br/>•\tHurdles or obstacles to increase Difficulty<br/>•\tWind Effect or Resistance for Expert Players<br/>•\tRealistic 3D shots and realistic power controls<br/>•\tHigh score board for each mode<br/>•\tStunning comic inspired game presentation<br/>•\tUser friendly navigation<br/>•\tExcellent Sounds<br/>If you like Golf Perfect Shot Experts then try our other sports games by clicking on more from developer or by visiting publisher account. <br/>Don’t forget to rate and review.", "metacritic": null, "released": "2018-05-24", "tba": false, "updated": "2019-09-06T03:18:16", "background_image": "https://media.rawg.io/media/screenshots/01c/01ca195eeeb13d03a51f3415bcda9103.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Simulation", "Sports"], "publishers": ["Mindsol Studio"], "esrb_rating": "Everyone 10+"}