{"id": 864606, "slug": "war-in-the-world", "name": "WAR IN THE WORLD", "name_original": "WAR IN THE WORLD", "description": "<p>War In the World est un jeu de tir FPS multijoueur à la première personne. Ce jeu d'action génial a un monde ouvert et permet aux joueurs de plonger dans un système de villages, des champs de bataille... Et d'essayer d'accumuler des victimes et de progresser dans les niveaux.</p>\n<p>Vous pouvez choisir les graphismes adaptés à votre système via les paramètres.</p>\n<p>Les concepteurs de WAR IN THE WORLD ont créé un excellent gameplay.</p>\n<p>This video game offers intense first-person shooter gameplay. You must have skill and good reflexes. Players must move quickly and use their weapons effectively to get as many kills as possible.</p>\n<p>There are different game modes \"capture the flag\", \"team deathmatch\", \"point capture\", \"free for all\" and \"gun race\", with basic weapons. Your team must try to capture the flag in the subway and try to bring it back to your own base, capture points and win tickets, kill everyone or in the mode \"gun race\", it changes weapon by killed. The winner is the team or player with the highest score after the time is up.</p>\n<p>It is possible to play with your friends and play as a team to try to win the game. Otherwise, you can just try to score as many points as possible to create fun games. When choosing a character, be sure to choose, earn or buy great weapons to kill more.</p>\n<p>During the game, players can complete side missions and use a myriad of awesome weapons. Pick up the weapons and control weapons such as a machine gun, pistol and even deadly rocket launchers. In total, War In the World features 37 weapons. As you play, you will master many different weapons - you will become an elite assassin in the game.</p>\n<p>What makes this game even more interesting is how easy it is to get to grips with the controls. The game uses standard WASD fps controls even though it's customizable like all the settings in this game, which allows experienced players to get the hang of it instantly. In addition, the controls and keyboard shortcuts are easy to remember. If you like FPS games, you will find the controls and gameplay superb in WAR IN THE WORLD.</p>\n<p>Thanks to DJMAESEN for 13 3D weapon models available in WAR IN THE WORLD.</p>\n<p>Discord:</p>\n<p>https://discord.gg/fR2g75WxSR<br/></p>", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-10T10:05:44", "background_image": "https://media.rawg.io/media/screenshots/a54/a549c2c33f9eda544b11bd0db341b769.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ShootGunGame"], "genres": ["Action", "Shooter", "Fighting"], "publishers": [], "esrb_rating": null}