{"id": 864826, "slug": "faesun", "name": "Faesun", "name_original": "Faesun", "description": "The Story Thus Far...\r\n<p>Faesun is a 3D Musou brawler with parkour elements. It focuses on a group of 6 friends, lovers, ex-lovers and kin navigating reconstruction after a God-King Patriarch, Fahweh Khaos, is banished from the universe.</p>\n<p>What happens to the people left in the wake of a mad god's plan to destroy the universe? How will players navigate the social schisms in society brought on by a calamity? How will they handle his potential return?</p>\n<p>in a universe where starlight is power, is truth,</p>\n<p>a deity returns to collect what is his: a sun, Faesun,</p>\n<p>from his beloved creations: living beings, Ponta people. </p>\n<p>who will survive his scourge?<br/><br/></p>\r\nControls\r\n<p><strong>Please note this game is controller only at the moment.</strong> You can use most types of controllers!<br/>If your controller is not read by the game, try unplugging it and plugging it back in!<br/></p>\n<p>For the time being, controls will be listed in their PlayStation format: </p>\n<ul><li>Left Thumbstick - Move</li><li>Right Thumbstick - Look Around</li><li>X - Jump</li><li>Square - Melee Attack Combo </li><li>Triangle - Ranged Attack</li><li>R1 + X,Square, Triangle, or Circle - Special Attack (WIP)</li><li>R2 - Sprint</li><li>L1 - Block</li><li>L1 + Left Thumbstick - Dodge in direction (Can dodge through enemy attacks and witch time!)</li><li>L2 - Wall Run</li></ul>\r\nThe Demo\r\n<p>This demo is a sandbox environment exploring some of the core verbs of Faesun, dodging, slashing, aerial, combat, and parkour. This is an alpha WIP!</p>\r\nGameplay \r\n<p>Melee Combat is a careful dance of ranged attacks, close physical melee attacks.<br/></p>", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-10T11:36:14", "background_image": "https://media.rawg.io/media/screenshots/da4/da4c30009a334a4f5df131572efd0e04.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["XaiaDreamcaster"], "genres": ["Action"], "publishers": [], "esrb_rating": null}