{"id": 864980, "slug": "path-to-purge", "name": "Path to purge", "name_original": "Path to purge", "description": "When the demon is a lovely little girl, will you still give her a wide berth? <br/>\r\nIn the face of increasingly hard fighting, Play the Demon to purge the Human beings that corrupted by the Holy Spirit. Dealing with the angel's difficulties, let's see how far you can go<br/>\n<br/>\r\n*background story<br/>\r\n      In modern society, human beings gradually put entertainment first, indulging in the happiness brought by material things, and gradually human beings lost the purpose of chasing the truth of the world. Such degenerate human beings are extremely dissatisfied with the Holy Spirit, because the reason why human beings have become like this is all the hands of the devil. Therefore, the Holy Spirit decided to punish the fallen human world, degrading all human beings into obsessive members who lost their feelings, and maybe even seduce the demon gods hiding in the dark by the way and destroy them together.<br/>\n<br/>\r\n      The devil has been absorbing the depraved beliefs of human beings for a living, but if human beings are directly degraded into extreme attachments without emotion, it will also affect the intention of the devil. To break such a curse and situation, it is even necessary to destroy the Holy Spirit behind the actual combat curse to save mankind.<br/>\n<br/>\n<br/>\r\n*operate:<br/>\r\n- Mobile: WSAD<br/>\r\n- Shooting: Release the move button<br/>\r\n- Reload: Automatically reload while moving<br/>\r\n- Interaction: Spacebar<br/>\r\n- View status: Tab<br/>\n<br/>\r\n*Summon the Demon God:<br/>\r\n      During the battle, by constantly purifying \"human beings\", the demon energy can be accumulated. When full of demon energy, pressing the F key can make the demon deity appear in the world and turn the battle situation in one fell swoop.<br/>\n<br/>\n<br/>\r\n*words from the developer<br/>\r\n      Thanks for attention! We are ESheep, a small team the size of a slap. Path of Purification is the first game we made, and it adds a lot of personal favorite styles, I hope you will like it. If you like, you can join our QQ group: 590165236<br/>\r\nI hope you will give more opinions. Our next work is to improve the development system of this game, and we will also optimize the game experience according to your opinions.<br/>\r\nThank you in advance for your attention and download~", "metacritic": null, "released": "2022-10-11", "tba": false, "updated": "2022-10-14T04:50:53", "background_image": "https://media.rawg.io/media/screenshots/2d0/2d061ce4fd2aa4b6a6b0671ecbb10e24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["e-sheep"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["e-sheep"], "esrb_rating": null}