{"id": 864970, "slug": "lunars", "name": "Lunars", "name_original": "Lunars", "description": "Lunars are zodiac animal plushies animated by celestial power. They love to explore the world and have a blast when humans aren’t looking. Join other Lunars online as your favourite Zodiac and get into all kinds of mischief in an <strong>intensely fun 8-player experience</strong> spanning <strong>wildly unique game boards</strong> and <strong>challenging mini-games</strong>. Add to your <strong>Wishlist </strong>for the latest updates and release info.<br/><br/><br/>Unique play-styles with flexible options to play the game:<br/>    • <strong>Blitz Mode</strong>: Board becomes a live playfield where everyone rolls simultaneously and uses items at will. No wait time for others to play their turn.<br/>    • <strong>Conventional Mode:</strong> Take turns to roll in traditional party board game style and compete in mini-games when a turn is over.<br/>    • <strong>Mini-Games Mode:</strong> non-stop action in back-to-back mini-games.<br/><br/><br/><strong>Blitz mode eliminates</strong> the deliberate pace of <strong>waiting your turn</strong> in traditional party board games allowing for a <strong>fast-paced multiplayer</strong> experience. Traditional turn-based mode is still here for old-school paced fun while the new blitz mode allows quick play matches.<br/><br/><strong>Diverse fun mini-games</strong> in everyday settings where Lunars party when no one is looking. Master <strong>unique free-for-all and team-based mini-games</strong> as you compete for the top Lunar.<br/><br/>From Anubis' desert sandbox inhabited by a cursed mummy to a cardboard kingdom with unruly knights and a sleeping dragon. Explore <strong>wildly varied board locations</strong> with <strong>different challenges, casts and gameplay styles</strong>.<br/><br/>Enjoy <strong>multiplayer mayhem</strong> with up to <strong>8 players online</strong>. Play with friends or join other like-minded Lunars in online matchmaking for fun fast-paced rounds.<br/><br/>Express your vibe with an expanding <strong>library of accessories, outfits, pets &amp; styles</strong> to show off your favourite <strong>Lunar fashion</strong>.<br/><br/><strong>Lunars </strong>have their own <strong>unique personalities</strong> based on their Zodiac animal. Play with your favourite Zodiac and claim the number one spot.", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-14T04:39:28", "background_image": "https://media.rawg.io/media/screenshots/842/842dd3759631ad1b8a51fbe43ecb93b6.jpg", "website": "https://www.lunars.online", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 364, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anubis Arts"], "genres": ["Action", "Casual"], "publishers": ["Anubis Arts"], "esrb_rating": null}