{"id": 86496, "slug": "car-parking-expert-drivers-game", "name": "Car Parking: Expert Drivers Game", "name_original": "Car Parking: Expert Drivers Game", "description": "Fasten your seat belt and start your super best legendary car and drive to park on your place. Main object of the game is to drive your car on wooden made track and park properly in parking place. Many difficult sharp turns and hurdles in your way you have to be careful while moving your smart car left or right turn. You have to avoid from crash, barriers and sides of road. If you crash these obstacles then you will fail to complete mission. This game contain fifteen challenging and interesting levels. When you complete start level then you enter into the next amazing and interesting levels and you will get some extra coins, these collected coins will help you to purchase new powerful car, so carefully park your speed legendary car to unlock the next mission successfully. Clear all missions to become the master in this adventurous game.<br/><br/>In this top designed game you will enjoy the 3D graphics, nice and heart touching effects of sounds. Realistic environment of game will force you to play this challenging game again and again. Immediately install it and enjoy the real fun of life. <br/>HOW TO PLAY:<br/>- Tap the pedal button to accelerate the car<br/>- Tap the break button to stop or slow down the car <br/>- Tap the left arrow button to left side turn\t<br/>- Tap the right arrow button to right side turn<br/><br/>FEATURES:<br/>- Simple and easy to play<br/> - Nice effects of sounds<br/>-  Realistic HD graphics<br/>-  Stunning environments<br/>-  Multiple challenging Missions<br/>-  No specified time limit to clear mission", "metacritic": null, "released": "2017-09-13", "tba": false, "updated": "2019-09-06T03:19:09", "background_image": "https://media.rawg.io/media/screenshots/b04/b04a5b46d8f429db12cab5f4ac3059d3_JqFcEK4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Simulation", "Racing"], "publishers": ["Mindsol Studio"], "esrb_rating": "Everyone 10+"}