{"id": 864917, "slug": "acretia-guardians-of-lian", "name": "Acretia - Guardians of Lian", "name_original": "Acretia - Guardians of Lian", "description": "<h3>《synopsis》</h3>After two worlds merged, conflicts that lasted for hundreds of years. Eventually, the flame of destruction slowly ignites in the crack.<br/>Lead your legion on the epic journey to break the chains of hatred to save the world from the primordial darkness.<h3>《features》</h3><h3>■ Authentic turn-based strategic RPG based on the epic story.</h3>As you clear the stage of the world, you will play a role as the protagonist of the epic story.<h3>■ Deeper Strategy With Various Variables</h3>It is turn-based. Random weather changes, the day and night, terrain kind and combination between the hero and the soldier affect outcome of each battle. <br/>Field of view at night will be limited. So, be careful.<br/><h3>■ Attractive Hero Characters</h3>Playable heroes will meet as you progress through the game and join when the time comes.<br/>Use each hero's unique skills to win battles.<br/>Not only most of the illustrations of heroes have their own animation, but also, attractive SD. And as you progress through the story, you can get exclusive equipment.<br/>The dialogue varies depending on the level of favorability, so give gifts obtained at the ‘Summoning Station’ to increase likeability of each hero.<br/><h3>■ Job-changeable Soldiers</h3>Soldiers who have achieved the level requirement can change their job by consuming resources.<br/>After changing job, soldier’s stats will be enhanced, and the appearance will be changed. (Appearance changes will be updated soon)<h3>■ Easy Crafting and Smelting</h3>You can craft and smelt equipment by consuming materials. The success rate is 100%.<br/>Sell equipment to get gold, disassemble it to get materials.<br/>Equipment can be mounted on Heroes.<h3>■ the Airship!</h3>As the story progresses, you can board the Airship.<br/>The airship function as a stronghold and, heroes move around on its deck.<br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-14T03:45:07", "background_image": "https://media.rawg.io/media/screenshots/f45/f4527fee798bca3c9fe6906d19970633.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 421, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ozaak"], "genres": ["RPG", "Strategy", "Indie"], "publishers": ["Ozaak"], "esrb_rating": null}