{"id": 865003, "slug": "kamiwaza-way-of-the-thief", "name": "Kamiwaza: Way of the Thief", "name_original": "Kamiwaza: Way of the Thief", "description": "On the streets of Mikado, only the tough survive. For one man, a heist gone wrong would change his life forever.<br/><br/>Set during the Edo period of Japan, Kamiwaza stars amateur thief Ebizo, who aspires to steal from the rich and give to the poor. During his first stint, however, he and his mentor, Ainosuke, witness their own men take the lives of innocent civilians. Disillusioned by the horrific display of violence, Ainosuke advises Ebizo to escape with the only survivor—a lone girl. <br/><br/>A decade later, Ebizo has held fast to his morals, living an honest and fulfilling life with Suzuna, the young girl he took in as his own daughter. But the illusion of security is shattered once Suzuna falls ill. In order to buy the medicine she desperately needs, Ebizo is faced with a heavy financial burden. Conflicted, Ebizo is forced to return to the underbelly of Mikado, but vows only to steal for the sake of those less fortunate.<br/><br/>Will you walk the path of honor, even as a thief? The choice is yours to make.<br/><br/><br/><strong>Family First: </strong>What lengths would you go to for those you hold dear? Familial bonds will be put to the test in this uniquely heartwarming tale.<br/><br/><strong>History in the Making: </strong>Your decisions as a thief will determine your future with multiple branching storylines. <br/><br/><br/><strong>Fancy Footwork: </strong>Avoid enemy detection with stealthy action gameplay and build your reputation as a thief!<br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2022-10-11", "tba": false, "updated": "2023-01-28T03:12:12", "background_image": "https://media.rawg.io/media/screenshots/8fa/8fa9778ef0f9396b6e11351c1d92b702.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 2, "beaten": 1, "toplay": 1, "dropped": 1}, "playtime": 5, "achievements_count": 36, "ratings_count": 2, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Acquire"], "genres": ["Action"], "publishers": ["NIS America"], "esrb_rating": null}