{"id": 865044, "slug": "idle-cyber-dungeon", "name": "Idle Cyber Dungeon", "name_original": "Idle Cyber Dungeon", "description": "This is a Cyberpunk style role-playing game. Players don't need a lot of operations, they just need to think about some strategies to complete the victory.<br/>\n<br/>\n<br/>\r\nThere are 6 classes for players to choose from.<br/>\r\nThey are Blade, Magic Power, Doctor, Chaser, Poison Master, and Paladin.<br/>\r\nEach profession has different characteristics.<br/>\r\nBlade: Good at melee and group attack.<br/>\r\nMagic power: Long range, explosive group attack class.<br/>\r\nDoctor: With strong recovery ability, we can play an excellent role in teamwork.<br/>\r\nChasing: High explosive long-range attack class.<br/>\r\nPoison Master: A powerful group attack class.<br/>\r\nPaladin: Powerful recovery ability, suitable for team fighting.<br/>\n<br/>\n<br/>\r\nThere are three different tasks in the game.<br/>\r\nEach task can be of different difficulty.<br/>\r\nYou can get different rewards after completing each task successfully.<br/>\n<br/>\n<br/>\r\nBuild the system.<br/>\r\nThe props obtained in the mission can be used to cast different equipment.<br/>\r\nYou have a chance to obtain legendary equipment.<br/>\n<br/>\n<br/>\r\nGame features:<br/>\r\nEach profession has 8 skills. However, players can only select 4 skills to use. This requires players to match different skills according to the needs of the fight.<br/>\r\nEach profession has a transformation skill, which can make itself stronger.", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2022-10-14T05:59:18", "background_image": "https://media.rawg.io/media/screenshots/418/41888023029e468addc05c7aa7b773b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["okyakusama"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["okyakusama"], "esrb_rating": null}