{"id": 86504, "slug": "towermadness", "name": "TowerMadness", "name_original": "TowerMadness", "description": "Evil aliens are coming to turn your beloved sheep into intergalactic scarves!  Protect the flock using only quick thinking and the arsenal of upgradeable weaponry at your disposal.  <br/><br/>\"Addictive, time-sucking fun. There are plenty of tower defense strategy games out there, but TowerMadness brings the genre to a new level.\"<br/>- Brian X Chen, Wired<br/><br/>\"If you’re a fan of Tower Defense games, do yourself a huge favor and check out TowerMadness.\"<br/>- Jon Phillips, MacLife<br/><br/>\"It would be madness to miss this game...it comes highly recommended.\"<br/>- Spanner Spencer, PocketGamer<br/><br/>• WINNER, Best App Ever Awards, Best Strategy Game<br/>• FINALIST, Pocket Gamer Awards, Best Strategy/Simulation Game<br/>• A Wired Favorite iPhone App<br/>• A MacLife App of the Year <br/><br/>A UNIQUE 3D TOWER DEFENSE EXPERIENCE<br/>Play from an aerial view or zoom down to first person and get close to the action.<br/><br/>LOTS OF LEVELS<br/>Over 100 maps in diverse environments (35 available as expansion map packs).  <br/><br/>ALIENS!<br/>Think fast to defeat the 17 different types of alien enemies intent on stealing your sheep.<br/><br/>GUNS, LOTS OF GUNS<br/>Over 60 diverse weapons and upgrades.<br/><br/>ENDLESS FUN<br/>Endless mode lets you see how many waves you can withstand.<br/><br/>COMPETITION<br/>Global leaderboards, Game Center achievements, and Friend Scores so you can compare scores with your friends and the millions of players worldwide.<br/><br/>LET’S SEE THAT AGAIN!<br/>Replays let you learn new strategies or share your games with the world through Twitter, Facebook, or email.<br/><br/>iPad owners, check out \"TowerMadness HD\" for the Pocket Gamer Readers' Choice iPad Game of the Year Award winning version of this game.<br/><br/>Search for our other award-winning games: Zombie Gunship and Nuts!", "metacritic": null, "released": "2009-05-24", "tba": false, "updated": "2019-07-30T13:22:23", "background_image": "https://media.rawg.io/media/screenshots/44f/44f8bcc3dd526503ede71faed29f406c.jpg", "website": "http://www.towermadness.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Limbic Software"], "genres": ["Strategy", "Puzzle"], "publishers": ["Limbic Software"], "esrb_rating": null}