{"id": 865047, "slug": "middle-east-empire-2027", "name": "Middle East Empire 2027", "name_original": "Middle East Empire 2027", "description": "Become the greatest leader of the Middle East!<br/>\r\nSelect your country you wish to lead (Egypt, Palestinian Authority, Iran, Lebanon, Syria, Turkey, Jordan, Iraq, Kuwait, Saudi Arabia, United Arab Emirates, Yemen, Oman, Qatar, Bahrain, Cyprus and Israel) and play against the smart Artificial Intelligence enemies. <br/>\r\nWith excellent leadership skills, strategy and tactics, you could lead your country to the win.<br/>\n<br/>\r\nDo you have what it takes?<br/>\n<br/>\r\nIt is the year 2027 and a big uprising took the existing government. <br/>\r\nAs the new leader, your goal is to ultimately become the supreme leader.<br/>\r\nUsing everything from diplomacy to war, you must strive to build an empire, both economically and militarily superior to all others.<br/>\n<br/>\r\nAt the beginning of the game, you select the country you wish to lead and start the game.<br/>\r\nThe game contains: weapons suppliers from around the world, a spy center, a war room, diplomat's, an economy, a research center, world news and a very advanced artificial intelligence. <br/>\n<br/>\r\nYour army consists of: soldiers, armoured personnel carriers (APC's), tanks, artillery, anti-air missiles, helicopters, fighter jets, ships, submarines, fighting robots, unmanned aerial vehicles (UAV's) and aircraft carriers as well as ballistic missiles and anti-ballistic missiles.<br/>\n<br/>\r\nMultiplayer<br/>\r\nThe game support also hotseat multiplayer option up to 8 players from the same device.<br/>\r\nEach player plays in his turn, manage his country and can send external messages to other players in the game.<br/>\n<br/>\r\nThe system is designed to think of thousands of potential scenarios and to pick the best outcome in order to win.<br/>\r\nAt the end of every game, the system will show you your score and what the artificial intelligence thought of your leadership skills.<br/>\r\nThe game uses real data from the internet.<br/>\n<br/>\r\nGood luck new born leader :)", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2022-10-14T06:01:30", "background_image": "https://media.rawg.io/media/screenshots/87c/87c3622a991355ab65df00c19ff58050.jpg", "website": "https://www.igindis.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 255, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["iGindisGames"], "genres": ["Strategy", "Simulation"], "publishers": ["iGindisGames"], "esrb_rating": null}