{"id": 865078, "slug": "left-to-rot", "name": "Left to Rot", "name_original": "Left to Rot", "description": "<strong>Left to Rot</strong> is a first-person psychological horror game.<br/><br/>Explore an atmospheric world, that combines surreal events and realistic environments, and enjoy a truly terrifying and spine-chilling experience.<br/><br/><strong><h3>Storyline &amp; Environments</h3></strong><br/>Imagine rushing to arrive at work, and instead of getting there safer, you produce a fatal car crash that completely changes your life. After a few years of psychological recovery, you decide it's better to move out into a new city and into a new house. This house is stained with a terrible past!<br/><br/><br/><br/><strong><h3>Characters</h3></strong><br/>Every character in Left to Rot has its own story that blends with the main narrative.<br/><br/><br/><br/><strong><h3>Enemies</h3></strong><br/>Watch every step you make and be careful, you do not want to attract any unwanted attention. You're not alone in there.<br/><br/><br/><br/><strong><h3>Gameplay</h3></strong><br/>Use your phone's flashlight, to navigate in the dark.<br/><br/><br/><br/>Find video tapes and unravel the mysteries.<br/><br/><br/><br/><br/>Explore and find items that could help you throughout the journey.<br/><br/><br/><br/>Use the inventory to store, combine, bind and arrange items.<br/><br/><br/><br/><strong><h3>Game Features:</h3></strong><br/><strong>• Psychedelic horror – A sense of insanity means each turn of the camera may completely change the look of your surroundings.<br/>• Immersive sound design - Each sound was carefully crafted to keep you immersed in the environment.<br/>• Exploration based gameplay  - Explore surreal zones and find out key items to complete objectives and find more dark story.</strong>", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-14T06:29:01", "background_image": "https://media.rawg.io/media/screenshots/31e/31ef10a446918cc8744f9a043c5b9ce7.jpg", "website": "http://galactic-crows.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tarba Paul Cornel"], "genres": ["Action", "Indie"], "publishers": ["Galactic Crows"], "esrb_rating": "Adults Only"}