{"id": 865089, "slug": "relayer-advanced", "name": "Relayer Advanced", "name_original": "Relayer Advanced", "description": "■Outline<br/>\r\n\"Relayer Advanced\" is a completely new simulation RPG by \"GODWARS TEAM\" with the theme of \"stars, robots, and Greek mythology\". This title depicts an epic battle between \"Starchildren,\" who have awakened to the will of the stars, and \"Relayer,\" a mysterious intelligent life form that plans to invade the earth. Players will command the \"Stellar Gear\" unit that the Starchildren board and battle against the \"Relayer\" forces. On stage, players will lead their troops to victory by making full use of such strategic systems as \"Hate,\" which quantifies how easily enemies target you, \"Skills\" specific to jobs and characters, \"Backstab,\" which launches pincer attacks, and \"Big Bang,\" a special move.<br/>\n<br/>\r\n■Overview of \"Relayer Advanced\"<br/>\r\n\"Relayer Advanced\" is a powered-up version of \"Relayer,\" which was released in March 2022, with an evolved UI, new features, and enhanced end content. Both \"Relayer Advanced\" and \"Relayer\" will be available for players who have already played \"Relayer\" and for those who are new to the game.<br/>\n<br/>\r\n＜Evolution of the UI, Luminous Line＞<br/>\r\nThe UI of the battle map has been significantly redesigned. In addition to smaller character icons, the representation of movement and attack ranges has been changed from grid squares to luminous lines for improved visibility!<br/>\r\nThe grid squares and luminous lines can be optionally switched.<br/>\n<br/>\r\n&lt;Implementation of the recollection function＞<br/>\r\nA function to view the adventure part played during the game has been implemented; events at the time of acquiring the Stellar Gear NEXT can also be viewed, which is useful in case you accidentally skipped an event.<br/>\n<br/>\r\n&lt;Enhanced end content＞<br/>\r\nA high level mission called \"Wormhole Mission\" consisting of a total of 5 stages has been included. This mission is released after clearing the main game, and is even more difficult than the \"Asterism Voyage,\" which is also end content, but the balance has been adjusted so that it can be cleared easily in easy mode.<br/>\n<br/>\n<br/>\r\n■Story<br/>\r\nWe, the human race, were not alone.<br/>\r\nThe year is 2049.<br/>\r\nHumanity finally encounters the mysterious \"Relayer,\" an extraterrestrial life form.<br/>\r\nAt the same time, the discovery of an ancient galactic civilization sets in motion the destiny of \" Starchildren,\" a human being who has awakened to special abilities.<br/>\r\nThe year is 2051.<br/>\r\nThe story of Starchildren and Relayer's destiny begins with the encounter of two women on the lunar colony \"Artemis,\" built on the moon, a satellite of the earth.<br/>\r\nWelcome to the world of this epic space adventure, where mankind, personified by the stars and Greek gods, and the ancient galactic race interweave!<br/>\n<br/>\r\n※In addition to the standard version, there is a \"Relayer Advanced EXTRA PACK\" which includes the main game and the \" Stellar Gear NEXT Pack\". Please be careful not to purchase more than one copy of the game.", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2024-04-21T10:58:58", "background_image": "https://media.rawg.io/media/screenshots/4b5/4b5eb5dca380ab6ba743fb606b1e154b.jpg", "website": "https://www.relayer.jp/english/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 6, "toplay": 1, "dropped": 1}, "playtime": 1, "achievements_count": 32, "ratings_count": 1, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Dragami Games"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["Dragami Games"], "esrb_rating": null}