{"id": 865022, "slug": "egression", "name": "Egression", "name_original": "Egression", "description": "Welcome to Egression, Inc., home of the world’s most deluxe escape room experiences. Grab your favorite VR headset, and get locked inside innovative spaces designed specifically for puzzlers like you. Explore your surroundings. Solve puzzles. Find the key to your escape.<br/><br/><br/><strong>Explore engaging environments:</strong> Walk freely through the escape room establishment, complete your escape artist training, and traverse through two unique escape rooms devised from the ground up just for you.<br/><br/><br/><strong>Inspect intriguing objects:</strong> Analyze everything around you. Leave no stone unturned. Piece together the clues until the path forward becomes clear.<br/><br/><br/><strong>Solve puzzles:</strong> Challenge your mind with realistic escape room style puzzles made for VR. Solve your way from one \"Aha!\" moment to the next.<br/><br/><br/><strong>Escape:</strong> Accomplish what you set out to do: escape rooms. Puzzle your way through the Game Room. And then, if you’re itching for more, challenge yourself to the Deep Sea Lab.<br/><br/><br/><strong>Break stuff:</strong> And of course, every VR gamer’s dream - throw things on the floor to see if they break. (Some do!)<h3>Features</h3><ul><li>Explore <strong>immersive</strong> environments<br/></li><li><strong>Interact</strong> with all objects you can see<br/></li><li>Solve <strong>unique handcrafted puzzles</strong><br/></li><li><strong>Escape</strong> two rooms<br/></li><li>Play through <strong>2-4 hours</strong> of content (depending on the level of your puzzle-solving skills)</li></ul>", "metacritic": null, "released": "2022-10-12", "tba": false, "updated": "2022-10-14T05:37:53", "background_image": "https://media.rawg.io/media/screenshots/131/1319cc3a8023bc2c5c3ac8f920e67b53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 1, "achievements_count": 22, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hyperquad Studio"], "genres": ["Adventure"], "publishers": ["Hyperquad Studio"], "esrb_rating": null}