{"id": 86530, "slug": "zombie-battle-3d", "name": "Zombie Battle 3D", "name_original": "Zombie Battle 3D", "description": "Command spooky battles between hundreds of soldiers and zombies.<br/>Plot the best strategy to prevent your soldiers being eaten by waves of hungry zombies.<br/><br/>The enemy army has the power of not to be attacked by the zombies, and also command zombies to attack your soldiers.<br/><br/>When a soldier dies, from whatever side, he becomes a zombie, you have to kill the zombie to eliminate it permanently.<br/>When one of your soldiers falls dead, be careful, because in a few seconds he will resurrect turned to a dangerous zombie in the midst of your troops. Finish with him quickly when he resurrects.<br/>Zombies are faster and more resistant than soldiers, but they need physical contact to do damage, so do not let them approach your soldiers!<br/><br/>You can manage your units from above, as in traditional strategy games, or enter into the unit you want and manage it individually, changing mode at any time.<br/><br/>Go to the zombie side! You can handle waves of zombies to destroy enemy lines.<br/>When you handle a zombie in first person, come close to the enemy soldier, then this one will be caught and quickly die bitten, and in a few seconds will become a new zombie that you can handle.<br/><br/>In some missions you will also have to handle jeep, tanks, airplanes, helicopters, antiaircraft, to destroy the waves of zombies or enemy vehicles that will attack at the same time.<br/>If all your soldiers are devoured, you will have lost the mission, even if you have vehicles remaining.<br/><br/>Place your tanks in a way that protects your soldiers, or in an ambush to force the zombies to pass through a narrow space and be killed by your soldiers.<br/>You can also use this tactic with the city buildings.<br/><br/>In other missions there are factories, distributed by the map, that you will have to conquer to avoid that they continue making enemy soldiers.<br/>Be careful because you can lose your factories even if they are far from the battle front, for example if their defending soldiers are bombed by an enemy helicopter, when they die, they become zombies, and could conquer that factory.<br/>So it is good to have groups of soldiers or tanks nearby to regain it as soon as possible.<br/><br/>Great variety of missions: under the apocalyptic reddish sky, in the mist, in the first mists of the morning, in the countryside, in the mountains, in the city, with soldiers, with zombies, with tanks, with airplanes or helicopters, with factories, with few units, with hundreds of units ...<br/><br/>And if it was not enough, there is a complete missions editor to design your own battles by selecting the number of units:<br/>You can put up to 300 soldiers against 300 zombies, land and air units, creating battles that will take your breath away!<br/><br/>Enjoy Zombie Battles!", "metacritic": null, "released": "2016-12-19", "tba": false, "updated": "2019-07-30T14:27:40", "background_image": "https://media.rawg.io/media/screenshots/f7a/f7a737fd8000e7e615748c567651f7f9_eM7y8Vh.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Luis Evaristo Rodriguez Campos"], "genres": ["Action", "Strategy"], "publishers": ["Luis Evaristo Rodriguez Campos"], "esrb_rating": null}