{"id": 865421, "slug": "lucero", "name": "Lucero", "name_original": "Lucero", "description": "<p>Lucero, heredero del clan de los senderistas de la luz, se adentrará en el averno de Nugurus para instaurar el orden antes de que la oscuridad y caos consuma el mundo, deberá lograr un equilibrio de las fuerzas para ello y sobrevivir a sus embestidas.</p>\n<p>Se presentan 3 niveles de plataformas completos con progresion de dificultad.</p>\n\n<p>Colabora con el Playtesting y completa el formulario luego de jugar:</p>\n<p>https://forms.gle/B6D7xt2WYpMuhQWU8<br/></p>\n<p>\n</p>\n\r\nNiveles\r\n<em>Nivel 1 – Entrada al averno</em>\r\nDescripción\r\n<ul><li>Se presenta un nivel con una jugabilidad introductoria a las mecánicas de juego, con desafíos sencillos y enemigos con poca agresividad. Se le dan al jugador distintos consejos en su avance, mostrando los controles y comportamientos básicos.</li></ul>\n<em>Nivel 5 – El corazón del averno</em>\r\nDescripción\r\n<ul><li>Se presenta un nivel con enemigos con comportamiento agresivo, con escasez de cristales y diferencia de poderes que utilizar con cada enemigo, sera necesaria la gestión de recursos correcta. La idea de este nivel es mejorar las habilidades del jugador, que logre comprender los comportamientos de todas las criaturas y administrar mejor los cristales y disparos para poder lidiar con la cantidad de enemigos.</li></ul>\n<em>El fin de la oscuridad</em>\r\nDescripción\r\n<ul><li>Se presenta un nivel con un jefe final, con accesos a las plataformas más complicados, que requerirán que el jugador sepa usar sus habilidades. El enemigo parece sencillo, pero traerá refuerzos que complicaran la tarea de resolución ordenada del jugador.  Deberá tomar decisiones rápidamente y conseguir finalizar el nivel obteniendo uno de los 3 finales posibles. Da el cierre de la narrativa planteada al finalizar el nivel.\r\n</li></ul>", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2022-10-14T08:52:29", "background_image": "https://media.rawg.io/media/screenshots/331/331915f3df430ff769926c4d9e181132.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Maximiliano Glomba"], "genres": ["Adventure", "Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}