{"id": 865473, "slug": "silence-2", "name": "silence.", "name_original": "silence.", "description": "<p>silence. is a <strong>prototype</strong> I made for a game development course I'm taking.\r\n</p>\n<p>It is a <em>text-based, atmospheric horror</em> game that is intended to make you feel <em>uncomfortable, uneasy, or even anxious</em> as you play, instead of just scaring you. For this reason, <strong>if you are prone to anxiety</strong>, or are feeling a lot of stress lately, I suggest you look for help and <strong>don't play this game</strong>.\r\n</p>\n<p>There are <strong>NO jumpscares</strong> in this game, and there will never be.\r\n</p>\n\n\n<p>You need to <strong>type </strong>in commands, and <strong>then press enter</strong> to execute them.</p>\n<p>The <strong>main menu</strong> is a command box too! <strong>Type play and press enter</strong> to start the game!</p>\n<p>I recommend <strong>typing around</strong>, or just a to see what interactable objects are around you.</p>\n<p><strong>Don't forget to always look [a]round!</strong> There are important pieces of info and objects in every location.</p>\n<p>I also suggest reading, <strong>looking at</strong> or interacting with all objects in every location. They're there for a reason.</p>\n<p>Whenever you don't know what to do, <strong>type help</strong> or just h.</p>\n<p>You can type the commands or initials in <strong>any combination of uppercase and lowercase</strong>.</p>\n<p><strong>Commands </strong>that have a second word such as look at X, or go to Y <strong>can be executed without typing the second word</strong>, for example, just look X or go Y.</p>\n\n<ul><li><strong>Moving</strong> to different locations via de go to &lt;place&gt;/go &lt;place&gt; command</li><li><strong>Repeating </strong>the <strong>text </strong>you read when you first arrive to a location using the where command</li><li><strong>Listing</strong> the interactable <strong>objects </strong>near you with around command</li><li><strong>Looking at objects</strong> or <strong>reading </strong>objects that have text on them with the look command</li><li><strong>Saying anything</strong> you want (or passwords for opening locked magical doors) using the say &lt;something&gt; command</li><li>Getting the list of commands along with an explanation of what they do via the <strong>help command</strong></li><li><em>And more...</em></li></ul>\n\n<p>The game is <strong><em>VERY</em></strong> incomplete. The title is just a <strong>placeholder</strong>. Currently there are only three full locations. <strong>Do not</strong> try to go anywhere other than north in the first location, it won't work.</p>\n\n<p><strong>Spoiler alert!</strong></p>\n<p>You can also unlock the cursed door in the cave from any location if you know the magic password, which is a bug, not a feature.</p>\n<p>I am currently aware of multiple other bugs. They will all be fixed and new content will be added as soon as we advance some more in the game development course.</p>\n<p>Don't worry, the writing will get better too. It is also just a placeholder until every mechanic works.</p>\n\n<p><strong><em>More coming soon!</em></strong></p>", "metacritic": null, "released": "2022-10-12", "tba": false, "updated": "2022-10-14T09:11:37", "background_image": "https://media.rawg.io/media/screenshots/021/021f9d51e9d215d1e35d5bee9276c9cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NorielSylvire"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}