{"id": 865539, "slug": "rick-survival", "name": "Rick Survival", "name_original": "Rick Survival", "description": "<em>Action RPG • Free Game</em><p>Explore Official Website »</p>\r\nSurvive and destroy thousands of monsters\r\n<p>This is an Action-Rogulike survival game with RPG elements. The game is set in different dimensions, where you have to survive against ever-growing hordes of monsters.</p>\n<p>Trailer · Gameplay Video · Download<br/></p>\r\nSlay monsters wherever you are\r\n<p>There is no place to hide, all you can do is try to survive all the waves of monsters and collect as much gold as possible for your next survival before death inevitably puts an end to your struggle.</p>\r\n11 exciting dimensions with various enemies\r\n<p>Rick's Land, Plumbubo, Dirty Earth, Dupido, Permafrost, September 3 Again, Planet Nibiru, Desert, Blue Planet, Ashes and Swamp</p>\r\n46 different Ricks and more than 30 unique weapons\r\n<p>Pickle Rick, Commander Rick, Bald Rick, Baloney Rick, Robot Rick, Tiny Rick, Battler Rick, Ninja Rick. Weapons: Pistol, Rifle, Gauss Cannon, Blaster, Revolver, Plasmogun, Machine Gun, Machine Gun, Shuriken, and Rocket Launcher.</p>\r\nUpgrade your Rick with 7 characteristics\r\n<p>Health regeneration, maximum health, body damage, bullet speed, weapon damage, reload and movement speed</p>\r\nIt's time to fight new monsters\r\n<p>Strange creatures await in Rick Survival. Be wary of what lurks in these dimensions. Work your way through competitions, complete tasks, improve your skills and destroy other monsters.</p>\r\nImmerse yourself in a crazy adventure\r\n<p>Rick is once again besieged by hordes of monsters, and he can't survive without your help. Download the game for <strong>FREE</strong>!</p>", "metacritic": null, "released": "2022-10-12", "tba": false, "updated": "2022-10-14T09:33:54", "background_image": "https://media.rawg.io/media/screenshots/25c/25c22f7f8c18cb53668b01f62165499c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yudin Nikita"], "genres": ["Action", "Adventure", "RPG"], "publishers": [], "esrb_rating": null}