{"id": 865794, "slug": "fraczeks-mystery", "name": "Fraczek's Mystery", "name_original": "Fraczek's Mystery", "description": "<p>NOTE: This IS NOT a game for children, the game is full of disturbing sounds and pictures, a lot of flashing images that your child/student would not want to see. The game may cause: anxiety attacks and nightmares. YOU ARE PLAYING AT YOUR OWN RESPONSIBILITY.<br/></p>Gameplay:\r\n<p>Fraczek's Mystery is a game of solving puzzles such as finding differences, listening with understanding, writing, and much more! The game also has exercises such as: visual-motor exercises, ɥᴉpᴉuƃ qopᴉǝs ɐup ɔoɯɯᴉʇʇᴉuƃ snᴉɔᴉpǝ.\r\n</p>\n<p>*the game is not a virus, the game can change your wallpaper. All changes made by the game will be undone when you restart your computer.\r\n</p>\r\nSTORY:\r\n\r\n<p>Once upon a time, Fraczek had a secret, but through a series of unfortunate events, he forgot what his \"secret\" was (it was a very important secret). Together with Fraczek, travel through deserts, forests and lakes to discover what Fraczek's secret really was. Along your journey you will meet many charming characters, such as Kurka Barbórka, Tadek, Robert, Radek, Pax and others.\r\n</p>\r\nOverview of all mini-games:\r\n\r\n<p><strong>Tadek:</strong> You are about to hear 8 sounds. Your task is to name the sound you just heard. If you give the wrong answer, you will have to start over. Good luck!\r\n</p>\n<p><strong>Kurka Barbórka:</strong> You will see two images where you need to point out where the difference is. Caution as time goes by the differences become more difficult! Good luck!\r\n</p>\n<p><strong>Fishing:</strong> My father is a fishing fanatic.... Who doesn't love fishing? If you want to catch some fish, press the \"Drop\" button, to move press the \"A\" and \"D\" buttons. Remember that fish move very fast, so you need to show your ability to predict their movements. Good luck!\r\n</p>\n<p><strong>Robert:</strong> All you have to do in writing with Robert is rewrite words from the box, simple isn't it? Good luck and have fun! </p>\n<p>https://r4lph.000webhostapp.com/ (music Creator Site)<br/></p>", "metacritic": null, "released": "2022-10-11", "tba": false, "updated": "2022-10-14T11:07:49", "background_image": "https://media.rawg.io/media/screenshots/2ee/2ee33836b5b70ff65626c1ae9be7e5f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["fraczekentertainment"], "genres": [], "publishers": [], "esrb_rating": null}