{"id": 86589, "slug": "desert-race-championship-2017", "name": "Desert Race Championship 2017", "name_original": "Desert Race Championship 2017", "description": "lots  and the full safari desert to drive multiple sports fast speed 4x4 prado to become the king of Rohi desert. <br/>Experience the thrilling, adventure, mad and crazy drive in the desert sand of SAHARA Cholistan that is world’s most beautiful desert tracks. Try your driving skills and become the stunt legend of powerful turbo 4x4 prado on the monster sand mountains among the rivals the stunning Arabic guys riding crazy through the off road tracks chase them and enter your name in Victorians list.<br/>Select your asphalt luxurious hybrid prado from the vehicles list of various monsters, Land cruiser, Prado, and all other racing monster car's and drift around the dynamic arenas. Fly dirt in the air and become blind of your opponents and win air-born desert championship. Enjoy the ups and downs of the lovely Cholistan desert in the heart of PK and also the most interesting event for Dubai, Russia and USA racers. <br/>So be ready for drive your auto 4x4 monster prado make crazy drift in action.<br/>PK  RALLY CHOLISTAN is most addictive and challenging game for simulation users. Cholistan safari  rally allow you to constantly discover fresh and loop driving challenging experiences on desert tracks. Play like as asphalt off-road extreme racer. On this airborne desert 4x4 prado game you have lots of mission, checkpoints, desert racing ramps and nitro for super power. <br/>Ride, drift,climb and perform on the new modern 3D dirt environments. This game has very addictive environment, multiple target rings, parking tracks and thrilling  sounds.<br/>You may have played different off road prado rivals driving games but play this new free prado simulator with amazing sandstorm. This mad prado  fun game has real Desert Race Championship 2017 rally rules and regulation, knockout tracks, checkpoint, flying on dune, stuck in sand, turbo prado engine, vehicle crash so drive as skilled driver. Desert Race Championship 2017 provides you with addictive music which boost up experience of Cholistan rally racing game on off road ramps. Enjoy Cholistan Desert Safari on desert circle. Think fast and don’t be a dumb driver.<br/><br/>How to Play:<br/><br/> Left and right tap to turn prado.<br/> Press accelerator button to move forward<br/> Press brake button to stop prado and drift<br/> Keep pressing brake button to reverse prado<br/><br/>Pk Desert Race Championship 2017 Features:<br/><br/> Beautiful natural Cholistan desert environment<br/> Drive freely and make your best score to complete the mission<br/> Smooth and responsive prado control <br/> Accurate driving prado physics with different desert tracks (Simulation, Drift, stunt, Race, Fun)<br/> Optimized quality and 3D different animations Crowed, Banners, Tomb, Fire, Run and many more.<br/> Follow the arrow and get every get point to earn more point<br/> Different powerful desert racing vehicle to unlock on different laps<br/> Upgrade your prado engine to run fast<br/> VR and multiplayer version will be available soon", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-08-12T04:56:26", "background_image": "https://media.rawg.io/media/screenshots/9a7/9a731078e3057aab9b463e88abb65dc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Adventure", "Sports", "Racing"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Everyone 10+"}