{"id": 865871, "slug": "myo-az-quiz", "name": "M.Y.O. AZ Quiz", "name_original": "M.Y.O. AZ Quiz", "description": "<p><strong>Instructions:</strong><br/>Alt+F - opens the config screen, here you can enter the letters for each piece (one per line) and the timer length in seconds<br/>Alt+Enter - switches to/from full-screen (Windows only, on Itch use the button in the bottom right corner)<br/>While your pointer is over a game piece press:<br/>r - to assign it to Team Red<br/>b - to assign it to Team Blue<br/>g - to mark it as lost (grey)<br/>w - to reset it to the original (white) state<br/></p>\n<p><strong>(Simplified) Rules</strong>:<br/>Prepare a set of 28 questions, the answers should be just a couple of words (e.g. names work really well), and at least 9 (the more the better) spare yes/no questions. Enter the first letters of each word into the software and set the timer length (the original has 8s for two players). After that show the game-board to your friends/classroom/etc. and let them choose what space they want. After they choose read them your question and let them answer using the letters as a hint. If they answer correctly the corresponding space is theirs. If they lose, ask the other team if they want to answer. If they want to it counts as their turn, no matter if they answer correctly or not. If both teams lose or don't know turn the space grey by pressing 'g'. If a team wants to have another try at the lost space, give them one of the yes/no questions. If they get it right it's theirs, if they don't it's the other team's and yes, it counts as their turn. The goal of the game is to connect all three sides of the triangle using one continuous space. If this becomes impossible or the time runs out, the team that acquired more spaces wins.</p><p>Have fun ;)<br/></p>\n<p><strong>Credits:<br/></strong>AZ Quiz by Czech Television<br/>Assets by Kenney<br/></p>", "metacritic": null, "released": "2022-10-11", "tba": false, "updated": "2022-10-14T11:34:27", "background_image": "https://media.rawg.io/media/screenshots/530/5304b353d1afc2d3e02e61224c8844fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["F_TEK"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}