{"id": 865847, "slug": "kitty-crash-cat-simulator-game", "name": "Kitty Crash: Cat Simulator Game", "name_original": "Kitty Crash: Cat Simulator Game", "description": "<p>Are you ready to start an adventure with your own cute little cat and explore the house together? With Cat Simulator game, everything is possible. Cat Simulator game is a perfect way to experience how it feels to have a cat. This cat can do everything you imagine, move around the house, break objects, sleep and eat. It is even possible to change her appearance and beautify her. Where else can you get all that?</p>\n<p>Discover everything this cat simulator game has hidden. Unlock all the rooms in the house and play amazing mini games. Finish all the tasks and win coins. The coins you get can be used to buy your cat food, accessories, furniture and everything else your sweet kitty needs. One thing is sure, the fun never ends with Cat Simulator Game.</p>\n<p>Features of Cat Simulator Game</p>\n<p>EXPLORE AND DISCOVER - Go around the huge house and see all the rooms there are. Visit every room in the house from living room, to kitchen and garden, complete all the tasks so that you can unlock all the rooms in the house. Each room is unique and the furniture in them can be changed to suit your taste and liking.</p>\n<p>BEAUTIFY THE CAT - In this Cat Simulator Game, you can change the way your cat looks. Change the color of the fur of your cute little kitty cat, choose a collar for her and make her even prettier than she already is. Put some lotion on her face and brush her fur. This cute cat loves looking perfect.</p>\n<p>TAKE CARE OF YOUR CAT - Care for your cat, make sure she rests when she gets tired after all the games and fun that you have together. After hours of playing, everyone needs a rest. Feed this sweet kitty with delicious food and snacks you can find in this Cat Simulator Game. After the rest and snacks, you are ready to continue playing again with your pet cat.</p>\n<p>DIFFERENT LOCATIONS- As soon as you start exploring and completing the tasks you will notice that the house your cat is in is full of different rooms to explore, such as living room, bedroom, bathroom, kitchen, garden, library, wardrobe, painting studio and pet room. Unlock all of them and decorate them as you like. Feel like you are at your own dream house in this cat simulator game.</p>\n<p>MINI GAMES - Play exciting and super fun mini games such as Snake and Ladders, Mouse Trap, Lucky Toss, Cat Fishing, Tap Tap Dash, Cat Skate, Happy Courier and many others. Apart from being addictive, they are easy to play and while playing you earn coins to spend on your cat.</p>\n<p>INTERACTIONS - Play as your cat and see what the cute kitty cat can do in the house. Crash the objects that are in the rooms and move around from one room to the other.</p>\n<p>SIMPLE AND ENJOYABLE GAMEPLAY - This Cat Simulator game is extremely easy to play. You just move the joystick to control where the cat goes and tap the screen while playing mini games. This makes the Cat Simulator Game suited for both the kids and adults. Everyone can enjoy playing this awesome Cat Simulator Game.</p>\n<p>This amusing Cat Simulator Game is a great way to pass the time and enjoy yourself. Download and play Cat Simulator Game now and begin the great adventure with a lovely cat that likes to break things and play games. Explore and play with your cute cat today, make your day better!</p>\n<p>Download link Android: https://play.google.com/store/apps/details?id=com.catsimulatorGravitycode</p>", "metacritic": null, "released": "2022-10-11", "tba": false, "updated": "2022-10-14T11:26:14", "background_image": "https://media.rawg.io/media/screenshots/e01/e012f16013bf663fa740d84fc6860d63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lisaweby"], "genres": [], "publishers": [], "esrb_rating": null}