{"id": 866, "slug": "dodonpachi-resurrection", "name": "Dodonpachi Resurrection", "name_original": "Dodonpachi Resurrection", "description": "<p>The legendary bullet-hell shoot-’em-up series hits Steam in the form of DoDonPachi Resurrection, the sequel to Blissful Death, packed with enough modes to satisfy the beginner all the way up to the hard core shooting fan and a fantastic musical score to boot.<br />\nThe past is being altered. An android, known as Next EXY, has traveled one thousand years back in time. Your task is to stop NEXY and the other Elemental Daughters who were built in the image of the Elemental Dolls who once protected humanity. What is NEXY’s intent? Should you attack what you shouldn’t understand? Orders are orders, and Col. Godwin Longhener is not to be ignored.<br />\nFeatures:Choose between three ships and three Styles<br />\nCancel bullets and increase your score with the Hyper Counter system<br />\nTurn the tides and clash lasers with the Counter Laser system<br />\nExplore the complete DDPR experience with 8 different modes<br />\n1. Normal 1.5<br />\nThe original, refined game.<br />\n2. Normal 1.51<br />\nA different scoring system and controls in this Cave Matsuri special version.<br />\n3. Arrange B<br />\nPlay single stages in this highly customisable mode.<br />\n4. Arrange A (ver L)<br />\nA newly arranged mode with mechanics and a ship borrowed from DDP Blissful Death.<br />\n5. Novice<br />\nA crash course in bullet hell for newcomers!<br />\n6. Black Label<br />\nA new method of attack and a new final boss await!<br />\n7. Black Label Novice<br />\nExperience Black Label without the difficulty!<br />\n8. Black Label Arrange<br />\nControl the Tiger Schwert from KETSUI in the first international release for this mode!Bring in devastating backup with two-player local cooperative play<br />\nMaster the intricate scoring systems for which CAVE has become famous<br />\nSteam Trading Cards, Cloud Saves, and Leaderboard support</p>", "metacritic": null, "released": "2010-08-26", "tba": false, "updated": "2023-03-09T07:48:20", "background_image": "https://media.rawg.io/media/screenshots/666/666e332ff0cdc772ae2773d54f9d5baa.jpeg", "website": "http://www.caveshmups.com/dodonpachi", "rating": 4.11, "rating_top": 5, "added_by_status": {"yet": 8, "owned": 73, "beaten": 7, "toplay": 2}, "playtime": 2, "achievements_count": 100, "ratings_count": 9, "suggestions_count": 419, "game_series_count": 5, "reviews_count": 9, "platforms": ["PC", "iOS", "Android", "Xbox 360", "Nintendo Switch"], "developers": ["CAVE Interactive CO.,LTD.", "CAVE CO.,LTD."], "genres": ["Action", "Shooter", "Arcade"], "publishers": ["Degica", "CAVE Co"], "esrb_rating": "Everyone 10+"}