{"id": 866442, "slug": "spellbearers-2", "name": "Spellbearers", "name_original": "Spellbearers", "description": "Spellbearers is a top-down, 2D, twin-stick shooter mechanically inspired by the classic SNES game, “Super Smash TV.” Geared towards those looking for a game wrapped in nostalgia, it has a modern look and retro atmosphere, not unlike older “Legend of Zelda,” “Gauntlet,” and “Castlevania” games. <br/><br/><br/>Casting powerful spells, battle against hordes of magical enemies to liberate the rulers of three kingdoms that have been overtaken by dark forces. With staff in hand, do you have what it takes to uphold the title of The Spellbearer?<h3>STORY</h3><br/>Darkness sweeps over the mythical world of Spellbourne, out of which emerge beasts and monsters that were said to have long been banished. An evil force has brought them back and must be stopped. This darkness has invaded the three ruling kingdoms of Spellbourne, their rulers overtaken and transformed into hideous and destructive monsters. If there is to be any hope in defeating this evil, all three kingdoms must be saved by restoring the rulers back to their original forms. <br/><br/><br/>Amid the ensuing chaos, Four legendary heroes arise to take up the call. Destined to forever shoulder the burdens of magic, they are known only as the Spellbearers.<br/> Select your Spellbearer and fight against the hordes.You can join the cause alone or with a friend. Choose the Spellbearer that best represents your own soul.  <br/><br/><br/><br/>Torch your enemies and stop them from progressing against you and those you protect. You wouldn't want to know the chaos that will commence if failure occurs. Precision and speed are key to success, but the freezing cold may determine the result. The icy terrain will be used against you by the enemy, therefore, you must find your own advantage points to proceed through the frozen dungeons. <br/><br/><br/>Bring down the epitome of evil with your cunning and wits. Mistakes are unacceptable, and the enemy is pristine. <br/><br/><br/><br/>The enemy is strong, but each has its weaknesses. Abnormities and demonic abilities are against you. Can you survive long enough to expose it?<h3>Grab a Friend</h3><br/>Take a friend on the adventure and work together to prevail against the dark creatures. But remember that your enemies will do whatever it takes to fulfill their objectives.<h3>FEATURES</h3><br/><ul><li><strong>1-2 Multiplayer:</strong> Grab a friend on this adventure and set off as the pair of Spellbearers that the world needs to save itself.<br/></li><li><strong>Numerous unique power-ups:</strong> Power up with energy grenades that bounce off walls, lightning blasts that unleash devastating chain damage, protective swords made of destructive light, and more.<br/></li><li><strong>Explosive visual effects and soundtrack:</strong> Enjoy the atmosphere created by power-ups that you select to use throughout your journey, as well as the full original Spellbearers soundtrack.<br/></li><li><strong>Action-oriented:</strong> The halls of the invaded kingdoms are packed with monsters that appear one after the other. </li></ul><br/><h3>Join our Discord!</h3><br/> Click here to Join our Discord!", "metacritic": null, "released": "2022-10-14", "tba": false, "updated": "2022-10-17T04:51:03", "background_image": "https://media.rawg.io/media/screenshots/9fc/9fcd8e25bf67a0a4629f41b6d46fea60.jpg", "website": "https://www.whimindie.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 352, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Whim Independent Studios"], "genres": ["Action", "Adventure", "RPG", "Strategy"], "publishers": ["Whim Independent Studios"], "esrb_rating": null}