{"id": 866453, "slug": "quriocity", "name": "Quriocity", "name_original": "Quriocity", "description": "Humanity has developed faster-than-light travel technology and is now ready to create a multi-planet civilization.<br/>You are the leader of the Quriocity 1 mission, which is directed on an alien planet very similar to Earth to create the very first alien colony.<br/><br/><h3>Clusters, buildings and upgrades</h3>Most of your units depend on a specific cluster-head building, which can serve as a storage or as a control hub. Keep this in mind when you add new structures, and put them in a smart way to optimize the available space.<br/>You can upgrade all your units to improve their efficiency, but only after upgrading the Principal Rover, which is the core of your colony.<h3>Sectors and regions</h3>Explore the surrounding area to unlock new regions and expand your colony even more. Each region is divided into sectors, and each sector will provide different resources. Or maybe it will be a clean sector, useful to build schools, entertainment units and other structures required for the wellness of your colonists.<br/><br/><h3>A steady flow of colonists</h3>Everyone is eager to join your colony, so be ready to welcome a steady flow of new people. Your mission is to ensure that they have a long, happy and productive life, so be sure to provide all they need: apartments, food, education, jobs, and much more.<br/>Accept the challenge and you will be rewarded with an ever-growing colony with thousands of people.<h3>Incidents happen</h3>Even the best strategy must bend to unpredictable events, but don’t worry; you have all the tools you need to face the adversities of this bare planet. Build the required units and you’ll be ready to face fire, infections, thieves, and more.<br/>The easy-to-understand UI will promptly tell you if something is wrong, so you will immediately be able to take action.<br/><br/><h3>Researches and automation</h3>Research the technologies that best suit your strategy, and find the best way to make your colony ever more efficient. As you progress, you will unlock more and more researches, and you’ll be able to automate a lot of tasks in order to focus on the most important ones, such as finding the perfect balance and expanding in new regions.<h3>Your colony, your style</h3>Choose among a wide variety of customizable decorations, define your style and build a colony that is not only efficient, but also beautiful and unique.<br/>You can also start a Colony tour to fly around your colony and share your progress with the community.<br/><br/>", "metacritic": null, "released": "2022-10-14", "tba": false, "updated": "2022-10-17T05:05:24", "background_image": "https://media.rawg.io/media/screenshots/95b/95b46e0ab1f265979920e8cde5b162b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 542, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Oxeliz Pvt"], "genres": ["Strategy", "Simulation"], "publishers": ["Oxeliz Pvt"], "esrb_rating": null}