{"id": 866421, "slug": "anima-arpg-action-rpg", "name": "AnimA ARPG (Action RPG)", "name_original": "AnimA ARPG (Action RPG)", "description": "<p>The RPG you&#39;ve always been waiting for has finally arrived on Android devices!</p>\n<p>Anima is an action RPG (hack&#39;n slash) videogame inspired by the greatest old school games and made with passion by RPG lovers for RPG lovers, and released in 2019.</p>\n<p>Anima, compared to other mobile ARPG, is highly dynamic and leaves the player the chance to fully customize its character, based on their play style, preserving the charming style of the old classics.</p>\n<p>ACTION RPG OPTIMIZED FOR MOBILE GAME<br />\nFight against evil forces wherever you want and conquer the single player offline campaign with potentially infinite game difficulties.<br />\nFollow the storyline or simply go on, slash enemies, loot items and improve your character!</p>\n<p>THE BEST MOBILE HACK&#39;N&#39;SLASH OF 2020<br />\nFast-paced combat, amazing special effect and dark fantasy atmosphere will accompany you through this fantastic adventure.<br />\nGo down and explore the abyss, Kills Demons, Beast, Dark knights and other demonic creatures that populate over 40 levels and then challenge your skills with engaging boss fight! Explore different dark scenarios, reveal hidden secrets and Explore unique locations!</p>\n<ul>\n<li>High Quality mobile graphic  </li>\n<li>Suggestive Dark fantasy environment  </li>\n<li>Fast-paced Action  </li>\n<li>40+ different playable levels  </li>\n<li>10 games difficulty to test your power  </li>\n<li>10+ secret unique levels  </li>\n<li>Exciting Boss fights  </li>\n<li>Stunning soundtrack  </li>\n</ul>\n<p>CUSTOMIZE YOUR CHARACTER AND TEST YOUR SKILLS<br />\nChoose your specialization between Skirmish, Archery and Sorcery and try unique combo with the improved multiclass system. Level Up your character and learn new strong abilities through three different skill trees:</p>\n<ul>\n<li>Level up your character and assign attributes and skills point  </li>\n<li>Unlock more than 45 unique skills  </li>\n<li>Choose from three different specializations  </li>\n<li>Create unique combo with the Multi-class system  </li>\n</ul>\n<p>LOOT POWERFUL LEGENDARY EQUIPMENT<br />\nSlash horde of monsters or bet your gold on the gambler to find ever powerful items and empower your equipment with the upgrade and the infuse systems. Adorn your equipment pieces with more than 8 different upgradable Gems.</p>\n<ul>\n<li>Find more than 200 items of different rarity (normal, magic, rare and legendary)  </li>\n<li>Equip powerful legendary items with unique power  </li>\n<li>Upgrade system to increase your item power  </li>\n<li>Infuse two leggendary items to create a powerful new one  </li>\n<li>8 different kind of precious gem with 10 level of rarity  </li>\n</ul>\n<p>TOTALLY FREE-TO-PLAY<br />\nThe game can be played totally for free, with the exception of some in-app purchase for the ones who want to unlock extra features amd that want to support the developement of this new Action RPG for Android!</p>\n<hr />\n<p>We are planning to make of AnimA one of the best Action Rpg on the store so we are constantly working on the game and we will release new updates and fresh content periodically. And remember, we made it because we love it.</p>\n<p>To stay in touch with us and to receive the latest updates on Anima follow us on:</p>\n<p>https://www.instagram.com/anima_rpg_mobile/</p>\n<p>https://www.facebook.com/thegameanima</p>", "metacritic": null, "released": "2019-11-01", "tba": false, "updated": "2023-02-21T00:36:11", "background_image": "https://media.rawg.io/media/screenshots/2a2/2a25d447fb13322a88312745638ae900.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 277, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": [], "genres": ["Action", "RPG"], "publishers": [], "esrb_rating": null}