{"id": 866497, "slug": "yu-wo-qian-ding-qi-yue-cheng-wei-jiu-shi-yong-zhe-", "name": "与我签订契约，成为救世勇者吧！", "name_original": "与我签订契约，成为救世勇者吧！", "description": "Battle Presentation<br/><br/>Our Goal and Road Map of Updates: (AD2022.10.6)<h3> Four Classes </h3><ul> <li> Axeman (Design Progress: 70%)<br/>Primary class, which guides players through basic mechanics and concepts that includes:<br/>Basic attack: Different from casting card spells.<br/>Summon elements: Different from minions in MTG and Hearthstone, elements in our game die after attacking once.<br/>Weapon: Triggers special effects when launching basic attacks.<br/>Shield: Triggers special effects when Hero’s armor is attacked.<br/>Besides, details of the design progress of Axeman: Elemental Troop (90%), Elemental Combo (90%), Pure Attacker (60%)<br/></li><li> Archer (Design Progress: 40%)<br/>Equipped with an op “Artifact”, the Quiver, at the beginning of the game, which reduces the cost of cards in your hand every turn. Therefore, for Archer, the cost of cards equals their CD.<br/>This design will change the gaming experience players will have when playing as the Archer.<br/>Besides, details of the design progress of Archer: Combo Main (40%), Cards Accumulating (40%)<br/></li><li> Wizard (Primary Design Phase)<br/>The energy system of Wizard is different from that of the other classes—Wizard needs to obtain mana of three colors by using “Mana Cards” first and then he can use cards of the corresponding color.<br/></li><li> Swordsman (Primary Design Phase)<br/>Swordsman is an excellent commander and can enroll NPCs that are willing to follow him.</li></ul><h3> General System </h3>The core system of the game is basically finished. There are other systems that have been listed:<br/><ul> <li> Difficulty<br/>Higher Difficulty levels will be unlocked after playthroughs under lower ones. Besides, the current Difficulty level is a bit too low so we'll adjust it.<br/></li><li> Blessings<br/>A growth system that improves characters outside of battles. </li></ul><h3> Others </h3>More enemies, artifacts, equipment, and items.<h3> Planning But No Guarantee </h3><ul> <li> Branch Areas.<br/>For example, after clearing this first large area, you can choose to enter a different second large area.<br/>Different areas have different enemies, events, etc. We’re trying to make the game “thicker” and design more types of enemies and events.<br/></li><li> 2. The Fifth Class: Werewolf.<br/>Transformation will be the key concept. But currently, this is just a rough idea. We might start working on it after the formal version is released. </li></ul>", "metacritic": null, "released": "2022-10-14", "tba": false, "updated": "2022-10-17T06:07:54", "background_image": "https://media.rawg.io/media/screenshots/9c5/9c521ef4620affa854987d06560d8345.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NightLightGameStudio"], "genres": ["Adventure", "RPG", "Strategy", "Indie"], "publishers": ["NightLightGameStudio"], "esrb_rating": null}