{"id": 866514, "slug": "perish-2", "name": "PERISH", "name_original": "PERISH", "description": "<strong>PERISH is a stylish 1-4 player FPS with a cross to bear. Slay hordes of creatures on the scorched sands of Purgatory and sell their gold-stained corpses to craven priests. Kill magnificent bosses and use the proceeds to gain entrance to Elysium, a place of cosmic revelations.<br/><br/>You are amyetri, a corporeal spirit condemned to live a shadow life in the halfway realm of Purgatory. Bring an end to your suffering by initiating the Rites of Orpheus and defeat the chthonic deities that dominate your fractious path to Elysium.</strong><h3>THE DEPRIVED INITIATE</h3>Begin your journey with nothing but a broken sword. Only danake, the blood-soaked currency of the underworld, will afford you equipment better suited to tackling the Dismal Lords that stand between you and Elysium.<br/><br/><h3>RISK VERSUS REWARD</h3>The revenant creatures of Purgatory are consumed by the same hunger for gold danake that motivates your own quest. Falling to your enemies will cause you to lose your acquired wealth. Deposit your danake in the Pantheon before you die, or continue your run to Elysium and risk losing it all.<br/><br/><h3>STRENGTH IN ASSEMBLY</h3>The underworld is a lonely place. Muster up to three friends and carve a gold-soaked path to Elysium together. Deploy co-op specific gear and gadgetry to support, defend and revive each other on the perilous path towards eternal oblivion.<br/><br/><h3>A HERCULEAN JOURNEY</h3>Survive the harsh environs of the scorched cliffs of Theseus, the dilapidated temples of Orpheus, and the volcanic foundries of Hephaestus. Navigate crumbling labyrinths, molten lakes of pure gold, and shattered mountains caught in the swallow of Charybdian whirlpools.<br/><br/><h3>THE ARMOURY OF ARES</h3>The priestesses hold a formidable stockpile of weapons. Use your danake to gear up on powerful crowns and rings that grant the wearer significant advantages on the battlefield. Choose from a plethora of both ranged and melee weapons, then imbue your chosen armament with a host of exciting augmentations.<br/><br/><h3>FEATURES</h3><br/><ul><li>1-4 player online co-op campaign sprawling across dilapidated temples, volcanic foundries, and ancient shipwrecks<br/></li><li>A series of magnificent boss-fights against rare and unexplored colossal deities from ancient Greek mythology<br/></li><li>More than 10 handcrafted and ornate javelins, swords, bows, and guns each with its own unique and upgradeable offensive capabilities<br/></li><li>Gratuitous, brutal, blood-soaked ranged and melee combat against enemies with distinctive battle behaviors<br/></li><li>Morbid gladiators: enemies in PERISH are unforgiving, and as you travel further through Purgatory you will meet a slew of enemies inspired by Ancient Greek, Roman, and Christian mythologies<br/></li><li>Post-launch support: free updates to the PERISH universe, with strange new enemies and even crazier weapons to play with </li></ul><br/>", "metacritic": null, "released": "2023-02-02", "tba": false, "updated": "2023-07-28T19:09:36", "background_image": "https://media.rawg.io/media/screenshots/195/19529c114a35e60bc883f6dbc345de88.jpg", "website": "https://www.perishgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 11, "beaten": 2, "toplay": 9, "dropped": 1, "playing": 1}, "playtime": 3, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 335, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["ITEM42"], "genres": ["Action", "Indie"], "publishers": ["HandyGames"], "esrb_rating": null}