{"id": 866557, "slug": "cube-blast-jungle-puzzle-game", "name": "Cube Blast Jungle: Puzzle Game", "name_original": "Cube Blast Jungle: Puzzle Game", "description": "WELCOME TO CUBE BLAST - JUNGLE &amp; PUZZLE: THE FUNNIEST CARTOON PUZZLE POP ADVENTURE!<br/><br/>Cube Blast - Jungle &amp; Puzzle is an OFFLINE fascinating pop matching puzzle game with thousands of fun &amp; challenging levels! <br/>Just tap the same colors and jump into these amazing episodes! Play now! You'll love Cube Blast - Jungle &amp; Puzzle matching games!<br/><br/>Match the cubes of the same color and combine boosters for huge explosions to solve puzzles, earn coins, clear the board!<br/> Once you've blasted all elements, you can move up to the next level and win more gifts and rewards! Challenge your mind and solve the puzzles in-matching-game!.<br/> Magic popping effects! Match 2 cubes, tap to blast! Release your stress with the delightful cubes toy crush sounds and colorful graphics! Make amazing combos to get high scores and earn extra rewards. Use powerful boosters to help you solve challenging puzzles and pass levels in the greatest toy cube blast adventures game!<br/> There are countless possibilities, and your talent in solving puzzles will be key in mastering toy &amp; cube blast matching games.<br/>Experience the greatest adventures through infinite episodes in the most colorful lands of Cube Blast - Jungle &amp; Puzzle. Play a matching game with endless adventure and fun! Toon characters and toys! The Magic Cube Blast Adventure game with Lovely Bear!<br/><br/> FEATURES<br/> Addictive match gaming experience that can relax your brain<br/> Colorful painted cubes, golden piggy bank, and shining in game provide a better game experience!<br/> Brand new play game with a pretty screen, sweet graphic and visual effects<br/> Deliciously sweet supply of candy crushing power - ups and combos<br/> Complete tons of challenging levels and unlock new episodes!<br/> Tons of rewards and boosters are waiting for you<br/> Easy and fun to play yet challenging to master! Free and fun puzzle games for all ages to play both online and offline!<br/> Game OFFLINE &amp; FREE whenever and wherever possible!<br/> The addictive gaming experience that can share with friends<br/> Relaxing and satisfying gameplay.<br/><br/> HOW TO PLAY<br/> Play by matching to blast 2 or more cubes of the same color.<br/> Tap on the boosters to trigger the cool explosion effects!<br/> Swap 5 or more cubes will to make a special toy combos<br/> Smash the boosters and CRUSH ALL THE CUBES!<br/> Plan your targets wisely before you run out of moves<br/> Use powerful bombs can help you pass the level easily.<br/> Spin the wheel to earn daily rewards!<br/> Before you tap, match cubes first. Match more cubes then tap them all together to blast for a higher score!<br/><br/>TIPs for this Tap 2 puzzle game - free jewel games offline:<br/> Match as many cubes as possible, the more crazy cartoon cubes you pop, the higher score you will win!<br/> Make full use of boosters to enjoy the magic cubes toy BLAST!<br/> Relax and train your brain by playing with speed—the faster the better!<br/> Are you ready for the fun pop blast puzzle adventure? POP!<br/> Cube Blast - offline game is free to play and with endless fun! Let's POP!<br/> Download Free &amp; Play Now! Cube Blast - Color Cubes Pop Matching Puzzle Offline Game<br/><br/> MATCH COLORS, BLAST CUBES, COLLECT COINS AND DECORATE YOUR ADVENTURE!<br/><br/> We want to hear from you!<br/>Any idea for Cube Blast - Jungle &amp; Puzzle, please contact us through SUPPORT in the game settings or write us at: TinyDreamStudio@game7.cc<br/> THANK YOU FOR YOUR SUPPORT TO CUBE BLAST - free color matching pop blast puzzle offline game", "metacritic": null, "released": "2022-05-04", "tba": false, "updated": "2022-10-17T07:19:34", "background_image": "https://media.rawg.io/media/screenshots/303/303c610be76bd6d4418f55b8cb39aa3b_JDpgiQM.jpg", "website": "http://rgp6ek59.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Peiyi Xu"], "genres": ["Casual", "Puzzle"], "publishers": ["Peiyi Xu"], "esrb_rating": "Everyone 10+"}