{"id": 866581, "slug": "game-of-west-legendsroses", "name": "Game of West: Legends&Roses", "name_original": "Game of West: Legends&Roses", "description": "The Ultra Wild West Simulation RPG. <br/>In this Simulation RPG, you need to hang on tight for a Wild Wild West ride! Become the legend of the West, run a thriving town, date glamorous lovers and form an awesome fighting force to expand your territory while protecting your people from enemies!<br/><br/>Features:<br/>◆ Wild Wild West Adventure<br/>◎ Gunfight, duels, trading, building army, massive battles, finding love… Anything and everything you would want in exploring the frontiers!<br/>◎ Lead everyone on the frontier to fight against enemies!<br/>◎ Win every duel and outmaneuver the outlaws! Be the Boss of Legends!<br/><br/>◆Run Your Town<br/>◎ Run the most fabulous town in the West!<br/>◎ Manage all the crucial venues, the Mine, Farm, Barrack, Prison… Earn gold to finance your fighting force!<br/><br/>◆Recruit Heroes of the West<br/>◎ Billy the Kid, Jesse James, Butch Cassidy, Wyatt Earp...All the heroes will help you defeat the enemies and become a frontier legend.<br/>◎ Command real historical figures, use their capabilities wisely to get an edge!<br/>◎ Train your heroes, procure the best arms, and build a legendary fighting force to win your glory!<br/><br/>◆Romancing the West<br/>◎ Go on a thrilling adventure of the heart as well as land!<br/>◎ Find the love of your life from the mysterious beauties of the west.<br/>◎ Raise a family together! Your offspring will be the key to building a thriving West.", "metacritic": null, "released": "2022-03-10", "tba": false, "updated": "2022-10-17T07:41:40", "background_image": "https://media.rawg.io/media/screenshots/4da/4da43b2e4c62b8199a0ca705cd9ba5de_fAWEJVO.jpg", "website": "https://minerva-games.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["MINE RVA GAMES HK"], "genres": ["RPG", "Simulation"], "publishers": ["MINE RVA GAMES HK"], "esrb_rating": "Mature"}