{"id": 866505, "slug": "marko-beyond-brave", "name": "Marko: Beyond Brave", "name_original": "Marko: Beyond Brave", "description": "<h3>JOIN THE RANKS OF THE BRAVE</h3><br/>Beneath the peaks of snowy mountains sleeps an ancient kingdom. Many have been drawn to its gates by tales of riches and wonders beyond imagination, but only a few have returned. Play as Marko, a hero in the making that needs to prove his worth and conquer the evil that threatens to engulf the land. <br/><br/><h3>GAME FEATURES:</h3> <ul><li>Traditional 2D art: The land of Zagora is brought to life in great detail, drawn and animated entirely by hand.<br/></li><li> Challenging, but fair gameplay: Tight, responsive controls. Jump, fight and dash your way across challenges. Battle mighty foes and slay ancient evils.<br/></li><li> Explore the vast land of Zagora: a huge non-linear map with hundreds of rooms. Solve puzzles and find hidden treasures, all within the Slavic-inspired fairytale setting.<br/></li><li> Encounter mysterious characters: A cast of cute and creepy friends and foes, all brought to life with traditional 2D frame-by-frame animation.<br/></li><li> Master New Abilities: Discover new skills, allowing you to go toe to toe with the most brutal of enemies.<br/></li><li> Discover all secrets: Delve deep into the world and discover hidden areas and unspeakable treasures. Collect all the pieces and puzzle together an ancient mystery.</li></ul><br/><br/><br/><br/><br/>", "metacritic": null, "released": null, "tba": false, "updated": "2022-10-17T06:16:55", "background_image": "https://media.rawg.io/media/screenshots/c5f/c5f9669fd9c9cffbff5616ee4d126e4e.jpg", "website": "https://markobeyondbrave.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 226, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Mechka"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Studio Mechka"], "esrb_rating": null}