{"id": 866595, "slug": "teebox-golf", "name": "TeeBox Golf", "name_original": "TeeBox Golf", "description": "TeeBox provides golfers a unique opportunity to find or create skill-based games and connect with golfers of similar play styles, handicaps, ages, and much more. We pride ourselves on keeping the joys and rituals of the game sacred while providing an epic on-course experience for our community.<br/><br/>Our goal is to connect like-minded golfers, and we strive to bring every golfer an endless amount of playing partners and memorable on-course experiences. When nearly everything can be done with the click of a button - why shouldn’t planning your weekend golf round be? Whether you’re traveling and want a playing partner, or you’re looking to play a new course nearby, TeeBox can help you up your game. Though we can’t promise low scores, we can help you setup a great time.<br/><br/>Let's get to the TeeBox!<br/><br/>FREE FEATURES: We love the game of Golf and think everyone deserves that opportunity as well - so enjoy all the amazing benefits of the app for free, no questions asked. <br/><br/>-USER MATCHMAKING: Connect with golfers alike in your area based on numerous criteria options - but leave the hard work of finding a great partner up to us. <br/>-GOLF GAMES FEED: Never play alone again - our games feed shows you golf matches going on in your area that you can request to play in  <br/>-GAMES CREATION: Not looking to join a game? Head over to create a game to challenge your friends or take on the TeeBox community through the public games feed. <br/>-LIVE SCORING &amp; LEADERBOARD: Enjoy live hole-by-hole scoring throughout your round and a leaderboard to show off how much those lessons have really been paying off. <br/>-ROUND HISTORY: Can't remember how you lost that last round? Don't worry, we track those scores for you.    <br/>-PROFILE CUSTOMIZATION: Deck out that profile of yours - let the TeeBox community know a little about yourself and what you're doing after a great day of 18. <br/>-REWARDS POINTS: Earn those points - enjoy free access at earning points by participating in activities in the TeeBox App! <br/><br/>PREMIUM FEATURES: Looking for a little bang on your buck? TeeBox offers 2 different levels of paid subscriptions, our birdie and eagle's club. Join the exclusive programs today for access to the following features:<br/><br/>- TEEBOX GIVEAWAYS: Enter in for a chance at winning our exclusive monthly giveaways! With three different tiers of giveaways - featuring products or experiences from our partners and your favorite golf brands, it's something you won't want to miss. <br/>- TEEBOX REWARDS: Enjoy access to our monthly rewards offers, including numerous offers or products from our amazing loyalty program partners. <br/>- POINTS ACCELERATORS: Juice up the points! Earn higher accelerators on those points your earning throughout your time on the app. <br/>- EXCLUSIVE OFFERS: Enjoy access to exclusive TeeBox events and merchandise. <br/><br/>Looking for access to all of the features above? Join the Eagle's club to enjoy the most exclusive experience on the TeeBox App. Providing you access to all tiers in both the rewards and giveaways section, along with the highest point earn - get rewarded for golfing, the TeeBox way. <br/><br/>-----------------------------------------------------------------------------------------------------------------------------<br/><br/>If you choose to purchase a Birdie or Eagle subscription, payment will be charged to your Apple account, and your account will be charged for a renewal within 24-hours prior to the end of the current period. Auto-renewal may be turned off at any time by going to your settings in the App Store after purchase. No cancellation of the current subscription is allowed during the active subscription period. If you don't choose to purchase a Birdie or Eagle subscription, you can simply continue to use TeeBox for free. <br/><br/>All photos are models and used for illustrative purposes only. <br/><br/>Privacy: https://www.teeboxgolf.us/privacy-policy<br/>Terms: https://www.teeboxgolf.us/terms-and-conditions", "metacritic": null, "released": "2022-10-05", "tba": false, "updated": "2022-10-17T07:54:15", "background_image": "https://media.rawg.io/media/screenshots/e58/e58c6e9f78ffec61a57c7dfaf07a39bd.jpg", "website": "https://www.teeboxgolf.us/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TeeBox Golf"], "genres": ["Sports"], "publishers": ["TeeBox Golf"], "esrb_rating": "Everyone 10+"}