{"id": 866518, "slug": "oxenfree-netflix-edition", "name": "OXENFREE: Netflix Edition", "name_original": "OXENFREE: Netflix Edition", "description": "Available exclusively for Netflix members.<br/><br/>A fun night partying takes a supernatural turn for the teens of Camena High. Unlock the mysteries of a ghostly rift in this choice-driven thriller.<br/><br/>Alex is a bright, rebellious teenager who brings her new stepbrother, Jonas, to an overnight party on an old military island. The senior-year tradition takes a terrifying turn when she stumbles upon the island’s cryptic past in this World War II-inspired narrative that GamesBeat calls \"a big next step for adventure games.\"<br/><br/>Play as Alex: <br/><br/>• Explore a haunted island: Hike and talk across lush woods, abandoned military forts and more. What's simmering just beneath the hauntingly beautiful veneer of Edwards Island will forever change your perception of reality. <br/><br/>• Contact the supernatural: Rumor has it if you stand in just the right spot, you can use a radio to tune in a station that doesn't exist on Edwards Island. Turn the radio dial, activating ways to save your friends and communicate with ghosts. <br/><br/>• Forge or destroy bonds. Your choices matter: Will you encourage your best friend to ask out his crush? Can you close the distance between yourself and your new stepbrother? Be mindful — your choices will impact your relationships and inform how you tackle otherworldly threats.", "metacritic": null, "released": "2022-09-24", "tba": false, "updated": "2022-10-17T06:36:58", "background_image": "https://media.rawg.io/media/screenshots/cef/cef0b39eedad605268fdb89f916ca448_UiHFYol.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Netflix"], "genres": ["Adventure", "RPG"], "publishers": ["Netflix"], "esrb_rating": "Teen"}