{"id": 866503, "slug": "strip-n-play-with-valerie", "name": "Strip n Play with Valerie", "name_original": "Strip n Play with Valerie", "description": "<p>Valerie appears to you in a dream. She asks you if you want to play some games to get her naked and fuck. You think, sure, I can dream about old 90&#39;s sex strip games, but this dream is nothing like that. The sex goes on and on, and you cum more than ever before.<br />\nThen things start to change. You don&#39;t know how long you&#39;ve been dreaming, you don&#39;t even remember who you were before you fell asleep, or if you&#39;re dreaming at all. The only way to find out is to keep going deeper in to this sexed crazed, cumtastic, waking life and fuck your way out of it!<br />\nThere are two game modes available: Game mode and story mode.<br />\nWith story mode, you will be able to see and read the whole of the story containing hundreds of erotic images over 100 sexy animations! Get ready to jump right into the fun with story mode, but you will miss the ability to replay all the sexy scenes in the gallery.<br />\nIn game mode, accessing the content is a bit more challenging but a LOT more interactive and rewarding! You will have choices that affect the story where a &quot;game over&quot; is possible at a moments notice. Along with a VN style choice system you will have to play and win multiple mini-games with increasing difficulty. There are four mini-games to choose from: Puzzle, Memoria, Sudoku, and Brick. Each one challenges you in a different way and you will have to choose which game will take you to the final scene!<br />\nSpeaking of the final scene... This is where the bulk of the story lives and is a reward for your effort. Find out the reason you are dreaming of beautiful women, and have the world of Ace X Game Studio opened up to you.<br />\nThis is the first game in series of erotic tales, hope you enjoy and get pulled into this crazy, sexy world.<br />\nIf you get stuck, you can download a full walkthrough of the game mode at the bottom of this page: https://www.acexgamestudio.com/strip-n-play-with-valerie</p>", "metacritic": null, "released": "2022-10-15", "tba": false, "updated": "2022-10-17T11:55:36", "background_image": "https://media.rawg.io/media/games/832/832bd868df4fab5b395d5f01a987857f.jpg", "website": "https://www.acexgamestudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ace X"], "genres": ["Simulation", "Casual"], "publishers": ["Ace X Game Studio"], "esrb_rating": null}