{"id": 866534, "slug": "dice-farmer", "name": "Dice Farmer", "name_original": "Dice Farmer", "description": "Welcome to the Kingdom of Dice Farmer Board Games!<br/><br/>In the world of Dice Farmer: Board Games, you become a farmer and roll dice to earn coins, steal coins, and build your own farm kingdom! In Dice Farmer: Board Games, you can play online with your friends and enemies simultaneously, who can be the first to level up to become a more affluent farmer, come and try!<br/><br/>Expand your farm<br/>Roll more dice to get coins and keep expanding your farm board, upgrade to unlock more dice farms of different styles!<br/><br/>Hostile or Friendly<br/>In Dice Farmer: Board Games, your friends or strangers will raid your farm and steal agricultural products such as bread, eggs, wheat, etc., causing you to suffer huge losses! Of course, you can also sneak up on the farms of friends or strangers to get new produce! You can also help your pals increase the ripening speed of produce, depending on your mood!<br/><br/>Dice Activity<br/>Dice Farmer: Board Games has vibrant game activities, such as daily lottery activities, raid activities, collection activities, etc. You can receive a lot of gold coins from the gold coin master. If you want to become a board game master or a farm master, you can be here!<br/><br/>Dice with buddies<br/>“Dice Farmer: Board Games\" is a super fun free board game, come and roll the dice with your buddies!<br/><br/>Tips:<br/>- Keep rolling the dice to earn more gold coins and unexpected prizes<br/>- The number of dice and additional rewards will be restored regularly, please claim them in time<br/>- When stealing farm produce from friends, it can also help friends to speed up<br/>- Move your finger, the game board can zoom in and out of the rotation angle!<br/><br/>Privacy Policy:https://www.noxjoy.com/privacy.html<br/>Follow Island King on Facebook to win exclusive rewards and benefits.<br/>https://www.facebook.com/dicefarmernox/about<br/>If you have any problems or feedback, please get in touch with noxjoy@noxgroup.com.", "metacritic": null, "released": "2022-07-19", "tba": false, "updated": "2022-10-17T06:54:46", "background_image": "https://media.rawg.io/media/screenshots/0cf/0cfb91b70387bb1fe0fabbffff6e810b.jpg", "website": "http://www.noxjoy.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nox(HongKong)"], "genres": ["Board Games", "Casual"], "publishers": ["Nox"], "esrb_rating": "Everyone 10+"}