{"id": 866560, "slug": "doge-rescue-draw-to-save", "name": "Doge Rescue: Draw To Save", "name_original": "Doge Rescue: Draw To Save", "description": "Have you ever wanted a game to challenge your brain and your talent for drawing?<br/><br/>Doge Rescue: Draw To Save is a doge games. You draw one line with your fingers to create walls that protect the doge from attacks by bees in the hive. You need draw to save the doge with the painted wall for 10 seconds during the attack of the bees, hold on and you will win the game.Use your brain to save the dog.<br/><br/><br/>GAME FEATURES<br/>1. Simple, addictive draw to save game, IQ brain<br/>2. The difficulty increases.<br/>3. Both challenging and satisfying.<br/>4. 2D graphic visual great sound and effects.<br/><br/>HOW TO PLAY<br/>- Draw only one line to save the dog finish the level.<br/>Ensure that you can solve the puzzle in one continuous line. Press to draw out your line, and lift your finger once you complete your drawing.<br/>- Make sure your line will not hurt the Doge you need to protect.<br/>Remember not to draw the line crossing the Doge you need to protect. Try to draw in the blank space.<br/>- One level can have more than one answer.<br/>Draw with your wild imagination! This is not only a test for your IQ, but also for your creativity as each puzzle has far more than one answer.<br/><br/>Find out different surprising, interesting, unexpected, and even hilarious drawing solutions to save the dog!<br/>Welcome to try our doge games, if you have any comments on the game, you can give feedback in the game, thank you for your participation.<br/>Immerse yourself in the interesting world of draw puzzle!", "metacritic": null, "released": "2022-09-13", "tba": false, "updated": "2022-10-17T07:22:32", "background_image": "https://media.rawg.io/media/screenshots/44a/44a14ca6e5ea18243cc9247e23fee7cc.jpg", "website": "http://classicgame.mygamesonline.org/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Doan Thanh"], "genres": ["Casual", "Puzzle"], "publishers": ["Doan Thanh"], "esrb_rating": "Everyone 10+"}