{"id": 866563, "slug": "unhappy-raccoon", "name": "Unhappy Raccoon", "name_original": "Unhappy Raccoon", "description": "Explore the universe, collect companions and build your spaceship on one mysterious planet after another. Don't worry about the danger. After all, this is a mere game for the \"Raccoon God\".<br/><br/><br/><br/>Unhappy Raccoon is a Roguelike action combat game developed by XD Network. In this universe created by the Raccoon God, build, practice, and no enemies can last more than 3 seconds in front of you and your raccoon team!!!<br/><br/><br/><br/>[Roguelike]<br/>That's right, that is Roguelike that everyone is familiar with! Our feature is that we can use the \"Virus\" of this universe, little raccoons, to our heart's content. Raccoons with different abilities colliding with Roguelike, what sparks will result from it?<br/><br/><br/><br/>[Hero]<br/>Furry companions with their own unique characteristics-_-! Ugh! Yay! Furry! Exploring this mysterious universe with you<br/><br/><br/><br/>[World]<br/>This is a universe created by the \"Raccoon God\". \"Explorers\" are trapped in this universe by an unforeseeable \"event\".<br/>If you want to leave this place, you must follow the rule of the \"Raccoon God\", which will create obstacles for you and help you. Find it and beat the crap out of it!<br/>In this universe, you will encounter all kinds of companions and the most annoying \"virus\" in this universe - little raccoons. Are they really not in league with the \"Raccoon God\"?@!<br/>Then, explore to your heart's content, for the sake of saving yourself and this vast and mysterious river of stars!<br/><br/><br/>&amp; No raccoons were hurt in the making of this game", "metacritic": null, "released": "2022-10-08", "tba": false, "updated": "2022-10-17T07:25:24", "background_image": "https://media.rawg.io/media/screenshots/2a5/2a5f0017df2116dbb756b553b7ea0943_fnGr1PU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 282, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["XD Entertainment"], "genres": ["Action", "RPG"], "publishers": ["XD Entertainment"], "esrb_rating": "Everyone 10+"}