{"id": 866520, "slug": "counter-terrorist-strike-cs", "name": "Counter Terrorist Strike: CS", "name_original": "Counter Terrorist Strike: CS", "description": "Are you still playing SFG2?<br/><br/>Have you spent a lot of good time in Crossfire?<br/><br/>Are you a fan of the good old Counter Strikes battles? <br/><br/><br/>Here is a good new: There is the best 3D First Person Competitive Multiplayer Shooting Game for you.<br/><br/>Cross fire at the battlefield of Counter Strike!<br/><br/>Play both online and offline, you will love the shooting experience on your mobile device! It is easy to play !<br/><br/><br/>=== FEATURES ===<br/> More than 20 skinned modern guns like Desert eagle,AK47,M4A1,AWP,GATLIN and so on.<br/> Realistic 3D graphics and cool animations<br/> Many maps with different tactics<br/> Easy play and smooth control<br/> Completely offline that you can play everywhere and any time<br/> Perfect optimization even for weak devices!<br/><br/>=== MODES ===<br/> Team Deathmatch  Team vs Team battle (Counter Strike VS terrorist team)<br/> Easy for all  It's kill or be killed. Kill the other players as many times as you can.<br/> Defuse the Bomb  Terrorist team plant the bomb. Counter team defuse the bomb.<br/> Private room  Call your friends to play together in same room.<br/> Custom Match  Create your own games (create any game maps/rules)<br/><br/>=== MORE ===<br/> More than 30 modern guns. Choose your own online shooting tactics for battle: sniper, shotgun, machine gun or assault rifles<br/> Up to 10 players in pvp action games<br/> Join team battles against other players from all over the world to play gun games<br/> Create your own clan and enjoy team game in various locations playing in squad<br/> Use Killstreaks such as drone strike, sentry gun and even rocket launcher to make your strategy unique one<br/> Compete in ranked seasons and get promoted to higher leagues among other players<br/> Call for your friends and interact with other players, complete contracts and quest missions<br/> Intuitive control and easy interface - swipe, aim and shoot<br/> Perfect optimization<br/> Regular updates and cool game elements<br/><br/><br/>=== SUPPORT ===<br/>You can download and play this game by easy.<br/>Please be informed that it also allows you to purchase virtual items within app and may contain third-party advertisements that may redirect you to a third-party website.<br/><br/><br/>This game is competitive FPS shooters with easy and intuitive controls, vivid 3D graphics and exciting gameplay.<br/>Accomplish your duty and play as counter-terrorists or become brutal and choose bandits. Show your fire and combat skills in our multiplayer first person shooter.<br/><br/><br/>This year’s best graphics 3D First Person Shooter experience will make you spend your time playing Counter Strike!<br/>If you are dead don’t forget where you get hit for counter attack get your revenge!<br/>Join the competitive combat in the most skill-based portable FPS!<br/>If you always wanted to play a great multiplayer shooter on your mobile device, your dreams are now true!<br/>You can enjoy the improved graphics and enticing sound effects of this online games!<br/>Are you ready to strike counter enemies?<br/>Awesome Multiplayer FPS CS game GO!<br/>First person shooter and multiplayer shooting game made with Unity to optimize online FPS gun experience.<br/>Regular game updates and elements are waiting for you!<br/>Download now and join the Counter Strike community!", "metacritic": null, "released": "2021-07-08", "tba": false, "updated": "2022-10-17T06:38:55", "background_image": "https://media.rawg.io/media/screenshots/b77/b7705cb6a4620a6503ced83b1e66cbfb_hXdWi9F.jpg", "website": "https://gunfire.mobi/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["GUNFIRE GAME"], "genres": ["Adventure", "Casual"], "publishers": ["GUNFIRE GAME"], "esrb_rating": "Mature"}