{"id": 866606, "slug": "town-mess-building-adventure", "name": "Town Mess - Building Adventure", "name_original": "Town Mess - Building Adventure", "description": "► ANOTHER FINE MESS… <br/><br/>Dive straight into the action in this fun casual mining and farm game with a whole city to be built at a breakneck speed and only one jack-of-all-trades up to the job – you. Start small with a handful of modest houses and keep building  until there’s a vast, sprawling metropolis and your own industrial empire in this relentlessly fast-moving adventure game that’s enormously addictive and easy to play. Download Town Mess now for non-stop entrepreneurial action in this crazy construction simulator that won’t give you a moment of peace.<br/><br/>► THE PACE OF PROGRESS<br/><br/>• From the sticks: Start out on a farm in the wood building log cabins, and in no time you’ll find yourself in the heart of a thriving modern city that you’ve constructed all by yourself. Well, almost…<br/><br/>• All this mines: Mine resources, build houses and collect rents. Then choose whether to invest your income in new facilities or upgrades (such as ones increasing your capacity) or to hire assistants to help with rapidly increasing workload.<br/><br/>• All the ages of man: From wood to steel, logs to cement and on into the future, Town Mess is a building simulator that takes you racing through human progress without pausing for breath. As you advance technologically, the pace of the game gets even more frantic. Build the future with your own two hands.<br/><br/>• Time for time management? To avoid logjams and keep the building logistics chain flowing, you’ll have to keep moving, with little time to stop and think. You’ll also have to strategize and use your time wisely to excel at the game, especially as the level gets higher and you’re required to keep an eye on numerous facilities and an increasing staff of assistants.<br/><br/>• Give people what they want: Helpful thought bubbles will show you exactly what your customers want, so hurry up and get building before they despair of ever getting a haircut, watching the latest movie or enjoying a juicy hamburger.<br/><br/>• More haste less speed: The game’s simple and intuitive controls mean you can dive straight into the action, but try to stay calm and coordinated – you don’t want to find yourself stuck behind a streetlamp or constantly bumping into your delivery truck.<br/><br/>► SEEK YOUR FORTUNE AT A TOP SPEED<br/><br/>If you love the idea of mining and farm games but find the pace of the most to be a little slow, then get ready for a whirlwind adventure built of wood, brick, steel and raw energy. Develop yourself from a humble woodsman into an industrial tycoon in the blink of an eye in this fun, cartoon-like city-building simulator that’s guaranteed to be a blast. Download Town Mess, roll up your sleeves and get to work right now!", "metacritic": null, "released": "2022-10-07", "tba": false, "updated": "2022-10-17T08:06:23", "background_image": "https://media.rawg.io/media/screenshots/dd6/dd613d27c43a4d2347ab823b0ef7d092_EDJKjJT.jpg", "website": "https://app-ads-txt.me/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vladislavs Sirjevs"], "genres": ["RPG"], "publishers": ["Vladislavs Sirjevs"], "esrb_rating": "Everyone 10+"}