{"id": 866658, "slug": "tales-of-monkey-island-ep-2", "name": "Tales of Monkey Island Ep 2", "name_original": "Tales of Monkey Island Ep 2", "description": "Start your adventure!<br/><br/>EPISODE 2: THE SIEGE OF SPINNER CAY<br/>Guybrush's adventures continue on the high seas as pox-plagued pirates lay siege to the innocent Mer-People. In between defending and dodging the persistent pirate hunter hot on his trail, Guybrush manages to catch up to his beloved wife and despised arch-nemesis -- but their reunion is short-lived. Now Guybrush must focus on eradicating the Pox of LeChuck before more harm can be done. And as the Mighty Pirate draws closer to a cure, the waters will only grow murkier in this thrilling chapter of the epic saga.<br/><br/>* The second part of a five-episode saga with an intriguing storyline that becomes deeper and more entangled as it unfolds <br/>* Series favorites Guybrush, LeChuck, Elaine, Stan, and the Voodoo Lady are joined by a new cast of characters <br/>* Streamlined adventure gameplay with all the humor, romance, and swashbuckling excitement that made the franchise famous <br/><br/>\"Rich in humor, character, puzzles, and reverence to its forerunners, this is the ultimate adventure game for Monkey Island fans.\" -TouchArcade <br/>\"Confident continuation of the franchise...\" -PocketGamer <br/>\"Looks great and sounds even better; good puzzle variety; witty dialogue…\" -SlideToPlay <br/><br/>Useful control tips: <br/>* Two-finger touch to view selectable items on screen <br/>* Double-tap to skip dialog <br/><br/>NOTE: This app is compatible with an iPhone 3GS or third generation equivalent iPod or later.<br/>_____________________________________________ <br/><br/><br/>MORE GREAT ADVENTURES BY TELLTALE GAMES: <br/>Batman: The Telltale Series<br/>Batman: The Enemy Within<br/>The Wolf Among us<br/>Puzzle Agent <br/><br/><br/>Gift this App: Click the arrow next to “Buy App” on the iTunes® App Store. <br/><br/>Never miss out on great deals, news and updates. Visit us at… <br/>TelltaleGames.com <br/>facebook.com/TelltaleGames <br/>twitter.com/TelltaleGames <br/>youtube.com/TelltaleGames", "metacritic": null, "released": "2011-12-15", "tba": false, "updated": "2022-10-17T09:01:03", "background_image": "https://media.rawg.io/media/screenshots/09c/09cc1353cc15e333fe02efbcc896a72b_XeJ3qEx.jpg", "website": "https://www.telltale.com/tales-of-monkey-island", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["LCG Entertainment"], "genres": ["Adventure", "Puzzle"], "publishers": ["LCG Entertainment"], "esrb_rating": "Teen"}