{"id": 866636, "slug": "gangster-crime-mafia-city", "name": "Gangster Crime, Mafia City", "name_original": "Gangster Crime, Mafia City", "description": "Are you ready to become the most legendary Mafia Boss?<br/><br/>Since the death of our Old Godfather, the Family has been missing a strong leader that can unite all the mafia gangs. You must find and recruit talented individuals from all corners of the underworld society, ranging from thieves and mercenaries to athletes and businessmen, to strengthen your crew. Fight, dominate and become the criminal mastermind who can take over the whole underworld!<br/><br/>Welcome to Real Gangster Crime, Mafia City the best open-world grand gangster crime simulator action shooting game, Mafia City is under attack by American gangsters and grand theft gangsters only the real gangster can fight against them. Disguise as an American gangster and visit Gangsters Vegas city. Real Gangster Crime, Mafia City is ruling over the city and you are part of this real gangster crime gun war that is going on! Get your action-packed grand gangster revenge in great gangster gun shooting games and action games. Play real gangster crime games and bring peace to the city by fighting against American gangsters. Experience the city gangsters in Vegas fight in grand gangster crime gun shooting games. Theft auto the grand gangster games offer you incredible guns similar to multi-world gun shooting games.<br/><br/>Real Gangster Crime, Mafia City is a role-playing game to become the leader of a gang in Las Vegas, while playing along with gangsters and mafia cartels, in a free open game world with gang wars.<br/><br/>Explore this open city with different missions, box the mafia cartel, fight for the final prize and play in different adventure crime clans vs. the gang world of the city of Las Vegas.<br/>This is an adventure saga of mafia and waging gang wars. Extra missions are added with each update and season, plus limited-time events to play.<br/>Street fights and mafia deals are part of this gangster world-of-crime game, with six-gun action missions. Fight-night boxing, street fights anytime and anywhere, and different kinds of city driving with multiple vehicles and roaming around this open world.<br/><br/>So what do you need in our crime simulator?<br/>- Baseball. For a good start.<br/>- Machine guns. When it gets bad.<br/>- Grenades. For bigger fishes.<br/>- Rocket launcher. For total destruction.<br/>- Jetpack. When the grand Miami city goes mad.<br/>- Godmode. For the immortal grand godfather.<br/><br/>And a lot more. Do not wait to try our crime simulator! <br/>Theft and drive auto like an absolute mad man, control mafia, earn money and rule the grand gangster city.<br/>It's time for a crime simulator!", "metacritic": null, "released": "2022-09-10", "tba": false, "updated": "2022-10-17T09:09:16", "background_image": "https://media.rawg.io/media/screenshots/5c0/5c093e10e85afe051f92e753bc0e1cee_C1Kab0p.jpg", "website": "http://lotustudio.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Zego Global Publishing", "Nam Dao Hai"], "genres": ["Action", "Simulation"], "publishers": ["Nam Dao Hai"], "esrb_rating": null}