{"id": 866674, "slug": "dawncaster-deckbuilding-rpg-2", "name": "Dawncaster: Deckbuilding RPG", "name_original": "Dawncaster: Deckbuilding RPG", "description": "DEATH OF DIVINITY is now live!<br/><br/>Dive into the dark fantasy world of the Shattered Realms and join the battle against evil. Build your deck as a cunning rogue, a brutal warrior, or a mysterious Seeker wielding arcane magic. Or create your own class and play as who- or whatever you want to be! Start playing today, collect cards and create a unique deck with access to over 300 cards and see how far your deck will take you into the corrupted lands of Umbris.<br/><br/>⚔️  STRATEGICALLY CHALLENGING <br/>With a number of puzzle-like card battles, every step of your heroic adventure offers new tactical choices to improve your deck-building strategy. Collect cards that match your playstyle, avoid disastrous events and build your strategy before the forces of evil overwhelm you.<br/><br/>🛡  RPG TAKE ON CARD GAMES<br/>Dawncaster offers unique card battle mechanics to even the most veteran of deck-building card game players. Though most of the gameplay should feel familiar, the ability to combine RPG class mechanics into deck building, weapons, enchantments, and its unique energy system are exciting additions to the card game genre!<br/><br/>☠️  VENTURE INTO DARKNESS <br/>Discover the mystery of the missing ‘Dawncaster’, a hero of legend who has been lost in the corrupted realm of Umbris. Use your deck-building skills to slay monsters and explore the darkest depths of a desperate world through handcrafted illustrations, and dialogue, and shape its future through your choices.<br/><br/>⭐️  ACCESS TO ALL CARDS &amp; CONTENT<br/>Dawncaster is offered as a complete card game. You get access to all cards, classes, and content with your purchase. There is no need to buy packs or tokens or waste time on timers or ads. Future content will be offered through expansions at the same, single price per adventure kind of deal.<br/><br/>🎮   ROGUELITE GAMEPLAY<br/>With randomized encounters, unique classes, and choices to explore, playtime could easily reach the tens of hours for those that enjoy a roguelike card battle challenge! Additional difficulty options are available for those that seek to push the limits of their strategic insight (and/or luck).<br/><br/>JOIN OUR COMMUNITY<br/>As a (very) small indie development studio we’d love to hear from you on our discord server. Drop in, give us your feedback and/or support, and get involved in the next step for Dawncaster.<br/><br/>Support: hello@wanderlost.games<br/>Discord: https://discord.com/invite/pfeMG9c<br/>Website: https://dawncaster.wanderlost.games", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-23T20:15:57", "background_image": "https://media.rawg.io/media/screenshots/7ac/7ac869809c9e5e51291c98fa166e7c98.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Wanderlost Interactive"], "genres": ["Card"], "publishers": [], "esrb_rating": "Teen"}