{"id": 86675, "slug": "tank-island-3d-strategy-game", "name": "Tank Island 3D - Strategy game", "name_original": "Tank Island 3D - Strategy game", "description": "Tank Island is the definitive war game.<br/>Handle many type of vehicles in a total war against the enemy army.<br/><br/>Soldiers, tanks, jeeps, fighters, helicopters and anti-aircraft batteries,<br/>choose the most suitable unit at each moment to handle it by yourself,<br/>or place your army in the most appropriate place to wait for the enemy.<br/><br/>Handle units individually or jointly from above.<br/>Handling from above you can give orders to a large number of units, designing the strategy of the battle.<br/>Handling individually is most appropriate when you have few units and you handle them better than<br/>the artificial intelligence of your side.<br/><br/>Various weapons: smart missiles, missiles straight advance and machine-gun fire.<br/><br/>Go through many levels of increasing difficulty where you'll learn to handle each vehicle<br/>and the best places on the island where initiate battle.<br/><br/>There are also numerous missions with factories of tanks, planes and helicopters,<br/>you must conquer and defend to get numerical superiority.<br/><br/>Complete level editor where you can design your own battles, selecting the number of soldiers, tanks, helicopters,<br/>airplanes, factories, and much more.<br/><br/>On the island there is no escape, victory or death!", "metacritic": null, "released": "2013-12-18", "tba": false, "updated": "2019-07-30T14:30:43", "background_image": "https://media.rawg.io/media/screenshots/951/9513a889308c6c87767c18b1efa440ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Luis Evaristo Rodriguez Campos"], "genres": ["Strategy", "Simulation"], "publishers": ["Luis Evaristo Rodriguez Campos"], "esrb_rating": null}