{"id": 866995, "slug": "zumbi-blocks-revamped", "name": "Zumbi Blocks: Revamped", "name_original": "Zumbi Blocks: Revamped", "description": "<p><strong>Join our Discord community: https://discord.gg/e3uUny9dee</strong><br/><br/>Released in 2014, <strong>Zumbi Blocks</strong>, with all it's flaws, has captivated thousands of fans worldwide due to it's simple yet effective design, gameplay and promising development start. Unfortunately, the game was discontinued by it's creator during it's peak of popularity, leading to the rise of new fan made versions, many of which failed to translate the aspects that made this game so beloved while simultaneously exacerbating it's worse flaws.<br/><br/><strong>Zumbi Blocks: Revamped</strong> has the goal of bringing back the qualities of this popular game and trimming down it's main issues. The game has been made by only 2 people who were fans of the original game and dreamed of creating a new version of it that could continue on the main creative ideas of the original while adding our own ideas, as long as they follow the spirit of the game. The game was also made completely <strong>open source</strong> so you can take your own look at the inside workings of it and use it to make your own version if you desire! Check the game's source code here: https://github.com/Minhoquinha/zumbi-blocks-revamped<br/><br/>While we are definitely excited to show this game to you, we have been a little bit late as the creator of the original game, Adrian, has came back to create <strong>Zumbi Blocks 2</strong>! The game is still on the alpha stage and, just like it's prequel, has a very promising development start. To our luck, Adrian has chosen to diverge significantly from the path he planned for the first game, creating a new experience that is very different from the one we made for <strong>Zumbi Blocks: Revamped</strong>. We have no ties to the development of that game, but we are none the less happy to see him coming back and wish him the best of luck. Check out <strong>Zumbi Blocks 2</strong> here on <strong>Itch.io</strong>: https://adrianks47.itch.io/zumbi-blocks-2<br/><br/><strong>How to play the game:</strong><br/><br/>Simple First-Person-Shooter game for PC, the controls are industry-norm but can be changed in the settings menu:<br/>- WASD for moving around;<br/>- SPACE to jump;<br/>- SHIFT to sprint;<br/>- Right CTRL to crouch;<br/>- E to pick up items;<br/>- Move mouse to look around;<br/>- Left mouse click to use your weapon/item (shooting, swinging a melee weapon, applying a MED, etc);<br/>- Right mouse click for secondary use of your weapon/item, like aiming with a gun;<br/>- 1, 2, 3, 4, 5, 6, 7, 8, 9 for it's respective inventory slots (1 for primary weapon, 2 for secondary, 3 for melee weapon and the others for anything);<br/>- F to inspect your weapon;<br/>- M to play/mute the music (tracks from original Zumbi Blocks' development videos);<br/>- K to change the track that plays.<br/><strong>Current state of the project:<br/><br/></strong>The game is on the Alpha stage still. Depending on feedback, we will update it to at least Beta stage.<br/><br/><strong>Planned (not currently added) features:</strong><br/><br/>- Multiplayer;<br/>- New zombie types (zombie dogs, bears and bats, as well as a couple other humanoid ones);<br/>- Complete the arsenal from the original Zumbi Blocks in version 0.8.0;<br/>- New weapons (katana, revolvers, etc);<br/>- New gadgets (grenades, automatic turrets, etc);<br/>- Progressive difficulty (waves get harder as time goes on);<br/>- Character customization (including female character);<br/>- New map(s?);<br/>- New sound effects, instead of the same ones used in original Zumbi Blocks;<br/>- Radios and loadouts (choose your inventory before starting the game, as well as preemptively choose the items received in radio calls);<br/>- And more.<br/><br/><strong>Current version of the game: Alpha  1.0</strong></p>", "metacritic": null, "released": "2022-10-16", "tba": false, "updated": "2022-10-17T11:22:28", "background_image": "https://media.rawg.io/media/screenshots/a7e/a7ea32f8481bbddba8ee9645fced96c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["WormPrimeMinister", "RealSpringy"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}