{"id": 86706, "slug": "3d-fantasy-tunnel", "name": "3D Fantasy Tunnel", "name_original": "3D Fantasy Tunnel", "description": "The 3D Fantasy Tunnel is a fast and exiting action game Which requires good reflexes. The aim of the game is to get into the checkpoints and then to the finish through the choosen tunnel by emerging the different obstacles.<br/>The game utilizes the opportunities in iPhone and the 3D characteristic of iPod Touch. (Apart from 3GS<br/><br/>- 6 different, long and exciting scene with various enemies and obstacles<br/>- dinamic music which can be choosen by the player or we can listen to our own music with imusical<br/>- unique game experience<br/>- gyroscopic control<br/>- stereophic sound effects<br/><br/>Youtube video:<br/>http://www.youtube.com/watch?v=Xj2Mm5UqMo4&amp;feature=player_embedded<br/><br/>*****************************************<br/>iPhonefootprint review:<br/><br/>3D Fantasy Tunnel is just what the App Store ordered for some fantastic 3D action. There is something about 3D that gets you right into the game, and this application has used that element pretty well.<br/><br/>There are six different and uniquely designed tunnels to get through in the best possible time that we can manage. We simply have to tilt the device to move through the tunnel. But it not a smooth ride, for there are enemies that block our way, and we have to dodge them to get to the finish line.<br/>There are checkpoints along the tunnels, and the mission at hand is to pass through them as fast as we can, while at the same time avoiding the obstacles.<br/><br/>3D Fantasy Tunnel gives a choice between two types of music while playing the game – Fantastic and Trancer. If we do not like them, we can always choose to listen to music from our own playlist. A feature that I liked about the controls was that we can we can use them in normal and inverted modes. The latter mode is fun, because it’s sort of like playing from a different perspective.<br/><br/>The first three tunnels are ready for play when we open up the application, but we have to complete them successfully to play the other three. The tunnels are named according to the way they are designed – Aqua, Artery, Dreamland, Garbage, Mine and Volcano. We can play them at three difficulty levels.<br/><br/>The best thing about this application has got to be the 3D animation itself. Top that off with appealing visuals and an exciting game play, and 3D Fantasy Tunnel is a great deal for only $0.99. Once we get playing, it’s a non-stop ride as we slide through the tunnel.<br/><br/>link:<br/>http://www.iphonefootprint.com/2009/11/get-into-the-3d-fantasy-tunnel-on-the-iphone/", "metacritic": null, "released": "2009-11-03", "tba": false, "updated": "2019-10-22T14:21:51", "background_image": "https://media.rawg.io/media/screenshots/50b/50b263573ee3a59180919f8484e696bb.jpg", "website": "http://www.dimensiontechnics.com", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dimension Technics"], "genres": ["Racing", "Arcade"], "publishers": ["Dimension Technics Kft."], "esrb_rating": "Everyone 10+"}