{"id": 86703, "slug": "ultimate-football-super-league-game", "name": "Ultimate FootBall Super League: Game", "name_original": "Ultimate FootBall Super League: Game", "description": "Ultimate FootBall Super League:Game is the clash league of football dream superstar soccer players. If you ready to enter in the field, play epic flick soccer games and win the cup, than don't wait just go to the app store and download most challenging 20 teams football match.<br/><br/>Only the top soccer stars hero in world football league history can enter in this ultimate soccer tournament. Select your dream and favorite team to beat the opponent team al world level. Print your name in the list of world top football players.Take realist player control of every action, Pass, headshot, kick, running and defense on the full crowded ground in a realistic way that only provided by <br/>Ultimate FootBall Super League:Game<br/><br/>Football is the world number one sport game. Soccer fans won't miss any football<br/>championship to see those outstanding soccer playerstars in action playing, strategy classic or practice matches. Amazing 3d game graphics &amp; Player animation: we use the best soccer players in history in <br/>Ultimate FootBall Super League:Game, quick movement of players with very high quality level.<br/><br/>How to play:<br/><br/>\tControl your player with joystick<br/>\tPress pass button to kick and give pass other player<br/>\tShoot button for power shoot for goal<br/>\tPause button for stop the game<br/>\tGoals are shown on bottom center screen of iPhone<br/><br/>Ultimate FootBall Super League:Game Features:<br/><br/>\tMore than 20 teams with original kit<br/>\tRealistic player pass and power shoot animation<br/>\tPlayer &amp; goal keeper defense animation<br/>\tSmooth gameplay and optimized graphics<br/>\tAppreciation after goal<br/>\tStadium with full crowd<br/>\tChallenge your friends and beat them<br/>\tUltimate responsive player control", "metacritic": null, "released": "2017-07-28", "tba": false, "updated": "2019-08-12T04:45:12", "background_image": "https://media.rawg.io/media/screenshots/d5e/d5e0d0f43bab6b76b8ce128514f71a40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["RPG", "Arcade", "Casual"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Everyone 10+"}