{"id": 86713, "slug": "passenger-coach-bus-driving", "name": "Passenger Coach Bus Driving", "name_original": "Passenger Coach Bus Driving", "description": "If you have not bus driving experience in your real life than our brand new Airport Staff Bus Simulation 2017 game will make you the real-life coach driving experience in city roads, pick and drop out the airport staff passengers and following the traffic rule and regulation while driving bus on the city highway road, if you break any traffic rule traffic warden or police man will fine you and you can go to jail. City passenger bus driver game will travel through city, highway, hills, and riversbridge and green lands.<br/>As a skilled bus driver, many tourists and staff and airplane passengers are waiting for you at city bus stations and you have to pick them and drop on their destinations within limited time limit. they can buy the tickets of any other transport service like train, taxi, rickshaw or van but they know you are best bus parking and driving experience driver. City coach bus driver 2017 has 3D designed city environment, variety of passenger buses, engine start, door open and close animation, different racing track, navigation and mini city map view. This 3D designed duty buses and city different maps will feels reality this is something you can feel after setting on the driver's seat of your auto bus.<br/>Eye-catching and incredible environment will make you feel like real coach driver. Extreme city tourist bus 3D game has neat and clean Europe city environment Animal Zoo, buss mechanic shops, clubs, beauty parlor and many more. in some mission you to perform you duty as a experience school bus driver of city children school. This game will be make enjoy and fun for every age users adult girls, boys, seniors, teen agers, because Airport Staff Bus Simulator is a complete story type game. Play Bus game, perform your duty and collect fear money from passengers and experience more different tourist passenger buses.<br/>Airport Staff Bus Simulator Features:<br/> Huge European advance open city environment<br/> River Bridge, Fly over, underpass and street roads<br/> Real city traffic movement, traffic signals<br/> Realistic airport , flying airplane, parking slots and emergency team <br/> 5 Different 3D elevated and school buses with different camera angles top view, dashboard interior camera, side and back camera <br/> Drive safely in big busy city and avoid from accident<br/> Auto gear box, window and door open and close button<br/> Follow the screen map to reached on destination<br/> No animals on the road but civilians are walking on the road side<br/> Various realistic pick and drop story missions<br/> Huge buildings, park, magic view, entertainment, heavy traffics and many awesome view scene<br/> Realistic and smooth bus steering and button control and dynamic gameplay", "metacritic": null, "released": "2017-05-14", "tba": false, "updated": "2019-08-12T04:54:53", "background_image": "https://media.rawg.io/media/screenshots/bad/bad4c0f9e51f854847a035580cbf20ff.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Simulation", "Sports"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Everyone 10+"}