{"id": 86729, "slug": "flight-unlimited-2k17", "name": "Flight Unlimited 2K17", "name_original": "Flight Unlimited 2K17", "description": "New Release Sale - 50% Off<br/><br/>Soar across the beautiful skies of the San Francisco bay area, Las Vegas, and Switzerland, in Flight Unlimited 2K16.   <br/><br/>The HD scenery covers an area over 10x larger than its predecessor.  The scenery is so detailed you can even find your house. <br/><br/>The campaign tasks with you missions such as rescuing a prisoner from Alcatraz, B2 Bomber surveillance over the Swiss Alps, landing your Cessna on the Golden Gate Bridge, and more!  <br/><br/>Over two years in the making, Flight Unlimited has been redesigned from the ground up.  The flight model was developed by an aviation expert.<br/><br/>Buzz the Golden Gate Bridge, take a fly-by of Alcatraz, scream past Levi Field, and even take a look at the future home of the world champion Golden State Warriors.  <br/><br/>Features:<br/>- Ultra HD Satellite Imagery covering over 500 SQ Miles.  <br/>- 4K HD Cockpits for each aircraft modeled from the ground up<br/>- Campaign mode with GTA style missions<br/>- The only mobile Flight Sim with Volumetric Clouds<br/>- 24 Hour Day/Night Cycle<br/>- Weather effects<br/>- Trigger failures such as engine trouble and detached wings<br/>- Landmarks such as Alcatraz, the Golden Gate Bridge, AT&amp;T Park, Oracle Arena, and more<br/>- 13 aircraft each modeled with accurate flight physics. New aircraft released weekly.", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-07-30T11:28:52", "background_image": "https://media.rawg.io/media/screenshots/7b0/7b0086de4d2645a3dac2426aed9e9bc9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Flight Systems"], "genres": ["Simulation", "Racing"], "publishers": ["Flight Systems"], "esrb_rating": null}