{"id": 86730, "slug": "bumper-cars-unlimited-race", "name": "Bumper Cars Unlimited Race", "name_original": "Bumper Cars Unlimited Race", "description": "Bumper Car Unlimited race has brought some of the most thrilling simulation, racing, and strategy game for those who love whirlpool bumper car driving simulator games. Enjoy intuitive drift bumper-car controls, amazing dodgem cars models, and amazing gameplay to touch the finish line and win the supercar championship. A bumper Car Unlimited race is an amazing car drifting simulator game, just like ordinary blocky bumper cars destroying games, but with new and unique Motorcar driving school features in 3D race tracks. The new-bumper car drifting simulation has also introduced a ballast system which makes this kid driving game more astounding. This bumper car racing game is top drift supercar driving simulator among all new stunt-car drifting adventure games of 2018 only because of real dodging car games adventure embedded in this dodging supercar race adventure. <br/><br/>In this Real Bumper Car Racer game, you’ll enjoy the ultimate drifts and stunts at every step of this drift bumpers car race game conquest. So what are you waiting for just pick the device hit the download button and enjoy new car bumper game to defeat opponents by being the first dodgem-car driver to dash through the finish line? Brace yourself for the unlimited fun drifting and enjoy the most advanced, adrenaline-filled action-packed stunt kids driving game. This 3D drift bumper-car drive adventure is a unique addition to supercar-bumper race games in 2018 along with awesome trick moves, stunts, and drift mania. This real car-bumper crash race game will provide you extreme fun, adventure, and thrill.<br/><br/>HOW TO PLAY:<br/><br/>•    Tilt your device to control the movement of your mini vehicle.<br/>•    Press the accelerator button to start a race.<br/>•    Use brake to slow down and handbrake to drift.<br/><br/>Real Bumper Car Racer Features:<br/><br/>•    Realistic 3D environment.<br/>•    Adorable Bumper-Treat for kids bumper-car lover.<br/>•    Special bumper-car for kids for upcoming vacation.<br/>•    Best bumper-drift cars game to polish driving skills.<br/>•    The unlimited Fun game is a unique kind of bumper driving school game.<br/>•    Smooth and easy controls.<br/>•    Lots of stunt, drifts, and dodging fun.<br/>•    Adrenaline rush guaranteed.<br/>•    Realistic sound effects.<br/>•    Addictive racing gameplay.<br/>•    Compatible with all android devices.<br/>•    No internet connection required.<br/>•    Totally free fun to play.<br/><br/>If you like this Bumper Car Unlimited race game, please try our other bumper games by clicking “More from Developer” or by visiting our publisher account. And don’t forget to rate and review.", "metacritic": null, "released": "2018-02-06", "tba": false, "updated": "2019-09-06T03:17:48", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbf56b544825a7742a63bdc4e5875956.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Adventure", "Sports", "Racing"], "publishers": ["Mindsol Studio"], "esrb_rating": "Everyone 10+"}