{"id": 86748, "slug": "build-farm-house-simulator", "name": "Build Farm House Simulator", "name_original": "Build Farm House Simulator", "description": "Let’s build your own farm house, cultivate and harvest crops and sell them in the market and earn money to purchase Dairy animals and birds.Build Farm House Simulator is a farmer duty game, in which you have tasks of farmers who work on a big village farm. In this Build Farm House Simulator, Player farmers can do everything in the farm feeding animals, planting, water supply in crops until harvest, hand-picking sell in the market receive cash reward and buy dairy animals cow, buffalo and hens for grow farm and care animals feed them on time, hens will be lay eggs and collect in the store and also cow milk.<br/>How you can make your products with eggs and milk? Let’s make all products with the different factories where we can make a cake, meat, bread, hens feed and etc. Click on cargo truck and sell these products in commercial market with friendly staff.<br/>In Farmer Town: Offline Farm game all activities will bring the extremely interesting and realistic farming experiences. All farmer actions you have to perform in this farming game. Sometime a bear will attack on the animals and he will be killing your animals. So when he will be appear continuously click on the bear and he will be locked in the cage.<br/>Cultivate more crops for your processing of different agricultural products into food for pets and animals in the farm. Use your cargo truck to transport agricultural and factory products cake, meat and milk everywhere.<br/>Build Farm House Simulator Features:<br/>-\t50 Different farming levels<br/>-\tVibrant graphics and interesting sound<br/>-\tAll things are used which a farming game should have<br/>-\tCharming and unique game story<br/>-\tTime to time update<br/>-\tMultiple dairy farming animals and birds<br/>-\tVery soon you will be able to play with your friend and break all records by harvesting crops and purchase animals", "metacritic": null, "released": "2017-06-09", "tba": false, "updated": "2019-10-22T14:21:52", "background_image": "https://media.rawg.io/media/screenshots/42a/42a7bbebb6a0aa96e8a1ce1ebce0a2ec_s2qDLWJ.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 74, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Simulation", "Arcade"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Everyone 10+"}