{"id": 86766, "slug": "water-slide-uphill-rush-race", "name": "Water Slide Uphill Rush Race", "name_original": "Water Slide Uphill Rush Race", "description": "Take the control of the fast ride on hilarious water slider. Ride on the water in high speed but be careful on sharp turns while sliding on a water slide. Make crazy loops and make whizz at ultra-fast speed. But watch out do not fall off from the high edge. Keep your mind sharp for the surprise turns. Enjoy the extreme action on the water slide. Best water simulator where you can enjoy incredible speeds, dozens of loops and exhilarating drops. Survive as far as you can while doing some mad tricks. Blast your way through everything and feel the real thrill. Make loops and twists in our way on the hilarious water slider.<br/><br/>Your main objective in this simulation is you have to slide on water fast, avoid obstacles, and collect coins as far as you can. Show your survival skills and go as far as you can. Be brave, slide on the tricky slide while doing incredible stunts. It will become more fun while doing insane stunts in a beautiful beach environment. Have you got what it takes to reach the end of the water slide? Test your survival experience and become the daredevil. Avoid obstacles while riding on the water go as fast as you can to earn cash. If you fall off from the water slide or you crash with obstacle your mission will over and you have to start it again.<br/><br/>Features:<br/>•\tCoolest &amp; tallest slide simulator<br/>•\tExtreme water park thrills with 3D water slider<br/>•\tBeautiful water slide with awesome animations<br/>•\tDifferent colorful slides in 3D<br/>•\tChallenging tasks", "metacritic": null, "released": "2017-09-18", "tba": false, "updated": "2019-07-12T02:47:08", "background_image": "https://media.rawg.io/media/screenshots/526/5265a5fcea0be27da9b15233931cc533.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Action", "Adventure", "Racing"], "publishers": ["Mindsol Studio"], "esrb_rating": null}