{"id": 86765, "slug": "flying-car-shooting-chase-air-stunt-simulator", "name": "Flying Car Shooting Chase: Air Stunt Simulator", "name_original": "Flying Car Shooting Chase: Air Stunt Simulator", "description": "Experience the most thrilling and action packed game. You have to shoot down the car enemies and become the king of the air fight. To become the best fighter, use your fighting combat skills. Experience the realistic battle with multiple classic flying cars equipped with latest weapons and releases your city from gang. Shoot your enemies down in the furious car crash. You can enjoy the multiple experiences like driving, flying and shooting at same time.<br/><br/>You have to fly like craft in air space also you have to fight the legendary battle against your opponent’s high speed combat cars. Destroy the enemy air check posts or rival headquarters. Equip your car with the latest military grade weapons. Play the game and complete multiple missions. Be the sharp shooter and shoot the enemy before it destroyed you. It is kill or be killed situation, do not miss a single fire. This is the war and you are alone in it. Win the warfare of flying cars and become the champion of this adventure.<br/><br/>This game focused on HD quality graphics, 3d Environment and challenging missions. Enjoy the game with easy and smooth controls, amazing sounds and cool animations.<br/><br/>How to play:<br/>• Tilt device to turn left and right to move flying fighter car.<br/>• Tap on bullets icon to fire bullets present right bottom of your phone screen.<br/>• Tap on guided missile to fire a guided missile on enemy fighter cars.<br/>• Tap on missile icon to fire missiles button is provided just above fire button.<br/>Features:<br/>• Excellent physics implemented.<br/>• Realistic 3d graphics with dynamic lighting and amazing destruction effects.<br/>• Multiple advanced fighter cars. <br/>• Brutal Action now on your mobiles.<br/>• User-friendly GUI and controls.<br/>• Good quality sound effects.<br/>• Efficient weapon controls &amp; movement.", "metacritic": null, "released": "2017-09-09", "tba": false, "updated": "2019-09-06T03:18:49", "background_image": "https://media.rawg.io/media/screenshots/800/800414081800f2fdd6556c8fa43d5168.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Action", "Adventure"], "publishers": ["Mindsol Studio"], "esrb_rating": "Everyone 10+"}