{"id": 867829, "slug": "tsj-spawner-destroyer-y2-block-a", "name": "TSJ - Spawner Destroyer | Y2 Block A", "name_original": "TSJ - Spawner Destroyer | Y2 Block A", "description": "<p>BUas System Design Y2 block A Project</p>\n<p>Get rid of all the spawners from your room to continue to the next level. </p>\n<p>Enjoy crazy shooting with TOTAL MAYHEM mode and make use of your accuracy skills when your weapon is in normal mode.</p>\n\n<p><strong>How to play without controller?</strong></p>\n<p>Playing without a controller is possible, however, it is not quite the intended experience to have so the game will feel very differently. Movement is <strong>WASD</strong> <strong>aim</strong> with <strong>the mouse cursor</strong>, <strong>shoot</strong> and <strong>dash </strong>are on <strong>LMB </strong>and <strong>RMB </strong>respectively. Finally, <strong>total mayhem</strong> is activated by pressing <strong>space</strong>. When <strong>holding space</strong> for maximum of 1/3 of the total mayhem timer you get invisibility and a 100% speed boost.</p>\n<p><strong>Known Issues:</strong></p>\n<p>The game sometimes crashes when there are too many enemies on screen, depending on how powerful your machine is.</p>\n<p>If you kill the enemies close to the border, they sometimes get out of the screen</p>\n<p>When a player dies when Total Mayhem animation is playing, on restart of the game player has one of the animation circles visible around them.</p>\n<p>The save score button currently does nothing.</p>\n<p><strong>Disclaimers:</strong> </p>\n<p>This whole game was not created by me, it's a university project, for which we had to create a game mode, enemy and weapon.\r\n</p>\n<p>There are some debug features in the build, so if you play on the controller and press the top face button weapon will switch. If you want to experience the intended game, don't use this debug feature.\r\n</p>", "metacritic": null, "released": "2022-10-14", "tba": false, "updated": "2022-10-17T17:23:44", "background_image": "https://media.rawg.io/media/screenshots/682/682af4bbca95d3330c05ee1461e631e9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jiří Vojtěch"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}