{"id": 86789, "slug": "multi-track-car-parking-simulator", "name": "Multi Track Car Parking Simulator", "name_original": "Multi Track Car Parking Simulator", "description": "We have launched for you Multi Track Car Parking game. There are 50 different and challenging levels in this interesting parking simulation game.You have played many multi story shooting, action, sniper, zombies, and off road driving games, Asphalt parking mania will get you the extreme entertainment of hours of turbo racing cars drive by playing traffic car parking simulation game Mania on your iOS device. <br/>In this multi gps tracks car parking game you will be provided with variety of luxury, racing, police car, taxi parking. Your task in Real Avenger Car Parking is to drive your vehicles provided by super parking girl mania simulator to park at parking lot in a right way and prove your American driving school 2017 skills and license by traffic police. After completing all stunts and challenging missions of this free or pro game you will be realize that car driving on highway roads is easy but skills in parking cars is real challenging.<br/>Levels will get you enjoy a lot of fun while playing this 3rd person game. You need to park your luxurious cars be careful when you park in traffic area. Drive careful not to hit your expensive car in barriers.<br/>Ultimate Car Parking Simulation is an awesome super parking simulator game that demands highest precision driving skills! Show your parking skills in different driving physics controls like steering, tilt, acceleration, pressure break and over obstacle avoidance to clash those vehicles that already parked in parking places. As the real parking lot driver, you will drive the classic and smart cars around corners, hurdles, obstacles, cons and parking lot places like real driver with speed and accuracy.<br/>Drive variety of new cars each vehicle with an unique behavior, power, luxurious, different new design models and master over 50 thrilling missions in detailed and completely physical parking simulated real 3D environments and parking tracks.<br/><br/>Features:<br/><br/>• Multiple camera angles driving view<br/>• 50 different story parking lots and challenging drive<br/>• Upgrade your car engine, break, speed <br/>• Customized feature allow you to upgrade your cars side mirror, 4 wheel rings, vehicle color, and spoiler, all these <br/>things will be purchased with coins.<br/>• Get reward of coins on parking exact place", "metacritic": null, "released": "2017-06-02", "tba": false, "updated": "2019-08-12T04:47:51", "background_image": "https://media.rawg.io/media/screenshots/108/108ed259eaa059621c0c25c5946ee7f7_BTRJNZ3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": "Everyone 10+"}