{"id": 867866, "slug": "verdant-vault", "name": "Verdant Vault", "name_original": "Verdant Vault", "description": "<p>Verdant Vault</p>\n<p><em>Verdant Vault found its roots through inspiration from the classic Legend of Zelda games, Final Fantasy Tactics, Nuclear Throne, and Into The Breach. </em></p>\n<p><em>Set in a solarpunk world, where a climate catastrophe has been avoided, we opt for a breath of fresh air and explore what it means to have hope while also experiencing eco-grief.</em>\n</p>\n<p><em>Our ambition with Verdant Vault was to create the first game to deeply explore living with hope as well as eco-grief and to demonstrate the collective agency humanity needs to avoid the worst-case climate catastrophe. By combining roguelike turn-based tactics with base building, the core gameplay </em><em>constantly presents risk/reward trade-offs that draw you into a mindset of stewardship. Nothing can end your expedition faster than recklessness and greed.</em></p>\n<em><strong>Project Status:</strong></em>\n<p>This is a prototype demonstrating the core dungeon crawling gameplay loop. \r\n</p>\n<p>Base building has not been implemented. Level cap for heroes is level 9.</p>\n<em><strong>Build &amp; Gameplay Notes:</strong></em>\n<ul><li>Windows build only. \r\n</li><li>Keyboard support only. Use arrow keys and ENTER to for basic navigation. \r\n</li><li>The user manual can be accessed in-game via the Start and Esc menus. Press Esc during gameplay to bring up the Esc menu. \r\n</li><li>A copy of the manual is also available for download.  </li></ul>\n<em><strong>The Story: </strong></em>\n<p><em>200 years ago, the Seed War scarred the world. Seeds of many rare plants were stolen and stockpiled in seed vaults deep underground. Almost all vaults were lost to war, sabotage, or shoddy construction, but theories about a few lost, ancient hoards spark many curious and acquisitive imaginations.  </em>\n</p>\n<p><em>You control an expedition sent to build a research station near a newly rediscovered vault and explore it. Initial readings show that it extends far deeper than most wartime vaults. This expedition could rewrite history and revive species lost two centuries ago.</em>\n</p>\n<p><em>Your goal is to recover the rare seeds surely in cold storage at the bottom of the vault. Until then, salvaging supplies and seeds of common crops will sustain your expedition–if you spend them carefully.</em>\n</p>\n<p><em>But when you enter the seed vault, its 190-year-old defense system attacks. Somehow activated and out of control, the system forces your heroes to overcome aggressive robots as well as  environmental hazards. Still, this all but proves that this vault protects irreplaceable seeds thought to have vanished.     </em>\n</p>\n<p><em>With the stakes so high, you must constantly choose whether to take risks to strengthen your expedition or play it safe to ensure survival as you delve deeper into the vault.</em></p>\n<em><strong>The World:</strong></em>\n<p><em>Verdant Vault is set in a science fantasy solarpunk world where some plant species reached sentience and created civilizations long before humans. Humankind advanced rapidly but recklessly, creating a climate crisis. Only changing course averted catastrophe–and led to a shared society of humans and sentient plants that has now stood for millennia.</em>\n</p>\n<p><em>The technologies and cultures of humans and sentient plants have largely fused, and their relations are generally harmonious. With robotics and other aids, some species of sentient plants move and communicate much like humans.</em>\n</p>\n<p><em>The expedition’s research station is mostly operated and upgraded by robot-assisted sentient plants, who tend to gain experience in mechatronics and related fields early in life. Humans usually explore the seed vault.<br/><br/><br/></em>\n</p>\n\n\n<em><strong>Development Credits:</strong></em>\n<ul><li>Sephone Stecyk - production, narrative design, game design\r\n</li><li>Val Sellers - art direction, concept art, 3D modeling  \r\n</li><li>Miles Gordon - programming, asset implementation\r\n</li><li>Thomas Bexton (hob_lantern) - game design, production assistance</li><li>Alex Damas - VFX creation\r\n</li><li>Cecilie Sørensen - Itch build production assistance, 3D modeling and texturing \r\n</li><li>Sheena Truong - SFX creation\r\n</li></ul>\n<p><em>*All team members participated in playtesting.</em></p>\n<p><em>*“Production” here includes project management.</em></p>", "metacritic": null, "released": "2022-10-14", "tba": false, "updated": "2022-10-17T17:38:53", "background_image": "https://media.rawg.io/media/screenshots/cf6/cf68bd692a0f5758d4aba6f68d717396.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paper Cutter Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}