{"id": 86791, "slug": "roman-warriors-battle-guide-simulator", "name": "Roman warriors battle guide simulator", "name_original": "Roman warriors battle guide simulator", "description": "You are elected as the leader of a army wing near Rome, you have capture and take control of a small city 'Rome' and there you will establish a commission and roman city republic. In real life that is just the beginning of your warrior fairytale. In this combat roman war game you have to lead the people of your area, city and govt commission to conquest against the enemy’s warriors of the Republic of Rome. At the start of game you will fight with swords against enemy Capua, Pompeii city, and Veii states. Later you need fight with a tribe and stop the invasion of Gaul Tribes. Take part in the establishment of the Republic.<br/><br/>After this section you should fight against a middle italic country 'Samnites' and conquest with heavy number of army soldiers in this roman action war. Attack, kill and defeat The Samnite Republic, and get control of central Italy. Its great news the Roman Empire republic did not control only on central Italy. You will battle against region and the kingdom of Epirus. The king of Epirus circa (Pyrrhus) will arrive at middle italic to stop the progress of Roman state Republic upon the call of rival city states.<br/><br/>You will fight very heavily costly 2 action and adventure wars against King Pyrrhus. In these 2 battles huge number of soldiers killed, blood will flow on the roman earth. These wars will know as Pyrrhic wars. Stand against the Kingdom of Epirus with huge army and weapons and capture the south Italy, Gaul tribes has started assault again from the northern area.<br/><br/>There you will go; the war will be start again! You will attack and conquer on northern Italy with 3rd rivals war. Its real time medieval and strategy war game where you will attack on enemy castle and destroy before they destroy your castle.<br/><br/>Roman warriors battle guide simulator<br/><br/>\tEstablish a range of warrior skills to seal your big victory<br/>\tMultiple and very challenging sword war levels<br/>\tWarrior with sword, shield, archer, horse sword warrior, old tanks<br/>\tRealistic soldiers animation like a real warrior soldier<br/>\tReal roman war feelings blood, murder, fight for victory<br/>\tAttack with heavy army forces to destroy enemy king tomb<br/>\tPlay offline and online on wifi and mobile network<br/>\tAvailable on the app store<br/>\tGreat and stunning HD graphics and 3D environments", "metacritic": null, "released": "2017-07-21", "tba": false, "updated": "2019-08-12T04:59:35", "background_image": "https://media.rawg.io/media/screenshots/111/11198facad980725c0fbf94e123a295f_S3S6mTm.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Arif Jamil"], "genres": ["Action", "Adventure"], "publishers": ["Muhammad Arif Jamil"], "esrb_rating": null}