{"id": 867937, "slug": "wish-you-were-here-a-fresh-start", "name": "Wish You Were Here!: A Fresh Start", "name_original": "Wish You Were Here!: A Fresh Start", "description": "<p>Afterlife comes at you fast!<br/></p>\n<p>A group of friends find their friendships put to the test as life comes at them a bit too quickly to process. Riley, who has recently moved, navigates relationships with their friends while making sure they don't push themself too far in the process. The gang promised to always be together... but now, things are changing.<br/></p>\n<p><em><strong>Wish You Were Here!: A Fresh Start</strong> </em>was produced for the Hand Eye Society's Super FESTival 2022! This game features:</p>\n<ul><li>10 chapters of quirky fun! Everything is all good, all the time and your friendships are <strong>definitely OK in these strange times</strong>! <em>Wish You Were Here </em>aims to be a relaxing, cozy experience. Though the story is primarily linear, the choices you make impact the way all of conversations play out! 💖 👻</li><li>Build your own character! The main character's appearance is customizable--yes, even in the jam version of this game. There are<strong> over 90</strong><strong> customization options</strong> to apply to your own funky li'l zombie! 🧟 👚</li><li>Play at your own pace!<em> </em>Progress is saved at the end of the day, so you can return at any time you want! With 10 chapters to go through (and more on the way), there is <strong>no pressure to burn through it</strong> all in one sitting. There's even a summary at the start of each day to remind you of previous events! 💻 🌅</li></ul>\r\n\r\nPlayable in-browser or on Windows platforms only (download below)!\r\n\r\n<p>Developed by:</p>\n<ul><li>Seamus Ly // Programming, Writing, UI</li><li>caiabresebun // Character Art &amp; Illustrations, Writing</li></ul>\n\n<p>With assets by:</p>\n<ul><li>Cyberleaf Studio // Modern UI SFX</li><li>lolurio // Melodrama Anime Music Pack I, Slice of Life Anime Music Pack I</li></ul>\r\n\r\n\r\ngame information\r\nhow to play\r\n<p>To play, press SPACE or use your LEFT MOUSE BUTTON to advance the dialogue. You can press and hold TAB to fast-forward through a conversation (this may not properly print the dialogue to the chat however!).</p>\n<p>When you are presented with a choice, you will be able to toggle between choices by using the arrows below the speech bubble. To confirm a choice, click on the bubble itself.</p><p>If you want to view the chat log during a conversation, press the  button. To exit the chat log, simply press it again.</p>\r\nsocial battery\r\n<p>You have a 'Social Battery' that gets used up with each conversation you engage in. You are able to continue chatting past your limit, but it will not recharge to full when starting a new chapter if you do. Some dialogue will change depending on how much energy you have, so be sure not to wear yourself too thin!</p>\r\ncome back at any time\r\n<p>Whenever you log on, a recap of what happened the last time you chatted will be available to you so you can pick back up from where you left off. This is our way of telling you that you can take this game at your own pace!</p>\n<p>Not everyone can sit down and sift through lots of text in one go, so be sure to prioritize yourself first. Your save data will remain until you decide to clear it from the Main Menu.</p>", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2022-10-17T18:08:19", "background_image": "https://media.rawg.io/media/screenshots/5d1/5d1dbdcc714e553e56d1bab5bacdb7cd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Seamus Ly ✨", "caiabresebun"], "genres": [], "publishers": [], "esrb_rating": null}