{"id": 868094, "slug": "soranatoyang-nogong-fang", "name": "ソラナと陽の工房", "name_original": "ソラナと陽の工房", "description": "\"Sorana to Sunny no Atelier\" is a somewhat nostalgic JRPG that focuses on item synthesis.<br/>Although it is in the RPG genre, there is no grand theme of adventure, battles against powerful demon kings or arch-enemies, or saving the country or the world.<br/>There is no grand theme of saving the country or the world.<br/>You are a novice alchemist named \"Solana\" and spend your days synthesizing items in order to become a full-fledged alchemist.<br/><br/><strong>*Attention!<br/>This product will be released in Japanese,<br/>and English support will be provided in an update.<br/>Until an announcement is made that English support is complete, <br/>we ask that English-speaking users please be careful when purchasing this product.</strong><br/><br/>Game Flow<br/>A simple cycle of \"Request,\" \"Collect,\" and\" Synthesize.<br/>First, accept \"requests\" at the bar.<br/>Once the request is made, go to the field and \"gather\" materials.<br/>Then, you \"mix\" the materials at the workshop and deliver the finished product to the client.<br/>This cycle is repeated to earn money.<br/><br/>The \"Solana\" system is not just a matter of making things, but also of mixing and blending.<br/>Solana\" is a novice alchemist, so she is not able to create many items at first.<br/>As the story progresses, she acquires various recipes and learns multiple methods of blending.<br/>For example, by changing the combination of ingredients, a new recipe can be created.<br/>The value or performance of an item can be changed by changing the amount of ingredients.<br/>By making full use of this type of blending, the player will be able to deliver items of higher value or items that meet the customer's needs, build a reputation, and become a full-fledged alchemist.", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-10-21T03:49:55", "background_image": "https://media.rawg.io/media/screenshots/893/8937a31dc51b0bd4c68d277ec31b6da3.jpg", "website": "https://monakagames1.wixsite.com/solana", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 191, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["monaka games"], "genres": ["RPG"], "publishers": ["monaka games"], "esrb_rating": null}