{"id": 868097, "slug": "blaze-in-space-beat-a-maze", "name": "Blaze in Space: Beat a-Maze", "name_original": "Blaze in Space: Beat a-Maze", "description": "<p>Beat a-Maze combines arcade challenges with mazes, adding an electro beat to the mix. Each level is a handcrafted puzzle that you need to solve by finding an optimal route. The spaceship turns only when it’s about to hit a wall, so you need to plan and remember the path you want to take.<br />\nBlaze through a-mazeOnce in motion, you need to think fast - with each second, the spaceship gets faster and slows down only when you hit a wall. Keep moving, making split-second choices - every mistake costs time which is crucial ranking-wise!<br />\nBeat other challengersBe it a local leaderboard for friends or a global one - try your strength in getting the first spot, proving your superior reflexes and sharp thinking. Simple controls and intuitive mechanics make it extremely easy to start the game, but increasing speed ensures a challenge to those wishing to master it.<br />\nGet a-mazed by the vivid art styleUnleash the colorful chaos as you speed through each level. The faster you go, the brighter colors become, and the wilder music gets.<br />\nMain featuresEasy to learn, hard to master gameplay<br />\nFast-paced mazes that respond to speed and music<br />\n150+ fast-paced levels to beat<br />\nOver 420 challenges to complete<br />\nMore than 30 original soundtracks</p>", "metacritic": null, "released": "2022-10-18", "tba": false, "updated": "2023-10-07T21:31:48", "background_image": "https://media.rawg.io/media/games/af7/af717c30b9284461855cdc63c0860640.jpg", "website": "https://blazeinspace.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Manufractal Studio", "Viabo Games"], "genres": ["Action", "Racing", "Casual", "Indie"], "publishers": ["Viabo Games"], "esrb_rating": null}