{"id": 868084, "slug": "ragnarok-begins", "name": "Ragnarok Begins", "name_original": "Ragnarok Begins", "description": "<p>The popular MMORPG that influenced generations, Ragnarok Online, presents a new adventure in the series, Ragnarok Begins!<br />\nBecome the hero of an epic adventure set in the fantastical world of Midgard!<br />\nFeaturing a vast fantasy world full of mysterious monsters and epic characters with the classic Ragnarok art style, reborn as a side-scrolling arcade-style MMORPG.<br />\nExplore unique landscapes from the depths of the sea to the deserts of Morroc with legendary kingdoms and mythical dungeons!</p>\n<p>◈Deep Fantasy Adventure◈<br />\n- A deep adventure with a colossal story as you unravel mysteries and conflicts<br />\n- Challenge yourself in the Endless Tower, either solo or with friends<br />\n- Test your might through group PVP and ranked battles in the Arena of Valhalla</p>\n<p>◈Cross Platform◈<br />\n- Use one account across PC and mobile devices, allowing you to progress and adventure on the go<br />\n- Never stop advancing your journey with autoplay functions and smooth playability on both PC and mobile<br />\n- Side-scrolling arcade-style combat allows easy accessibility</p>\n<p>◈ Dynamic Action◈<br />\n- Action-packed combat with non-targeting, allowing precise control of area-of-effect abilities<br />\n- Gain movement abilities to dodge enemy attacks and out-maneuver opponents<br />\n- Use a variety of potions and items to gain buffs and heal your character</p>\n<p>◈ Endless Build Customization◈<br />\n- Customize and upgrade your weapons, armor and accessories with multiple progression systems<br />\n- Build out unique skill trees for each job, as well as an adventure skill tree available to all jobs<br />\n- Choose from 4 base jobs, each with 2 advanced jobs to progress into for endgame content</p>\n<p>◈ Community Social System – Let’s play together! ◈<br />\n- Create or join a guild with many guild activities and progression systems, including guild benefits and shared guild halls<br />\n- Design and grow your own player house with in-game progression systems - invite your friends too<br />\n- Join groups of adventurers to battle server-wide world bosses</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-10-19T16:52:53", "background_image": "https://media.rawg.io/media/screenshots/e76/e762f5143ad5f523aa048dac0f547e0d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 509, "game_series_count": 11, "reviews_count": 0, "platforms": ["PC"], "developers": ["GRAVITY"], "genres": ["RPG", "Massively Multiplayer"], "publishers": ["Gravity Interactive"], "esrb_rating": null}