{"id": 868025, "slug": "advanced-zabic-smoka", "name": "Advanced Zabić smoka", "name_original": "Advanced Zabić smoka", "description": "Niebezpieczne przygody w fantastycznym świecie\r\n<p>Grupa poszukiwaczy przygód zapuszcza się w głąb starożytnych, pełnych magii ruin. Artefakt, który mają nadzieję tam znaleźć, to jedyny sposób, by uratować królestwo. Na drodze do niego czyhają krwiożercze potwory, niebezpieczne pułapki oraz zachłanność drzemiąca w sercach bohaterów. Czy ich misja się powiedzie? To zależy wyłącznie od wcielających się w nich graczy! </p>\n<p>Jeżeli zawsze marzyłeś o tym, aby wraz z przyjaciółmi przeżyć niezapomniane chwile w fantastycznym świecie, to <em>Advanced Zabić smoka</em>, jest grą dla ciebie! Nie czekaj ani chwili dłużej, chwyć za kości i wyrusz w poszukiwaniu chwały do świata mrocznych lochów oraz niebezpiecznych przygód. Kto wie, może uda ci się nawet zabić smoka?</p>\r\nKlasyczne fantasy\r\n<p>Atmosfera towarzysząca rozgrywce w <em>Advanced Zabić smoka</em> zabierze cię z powrotem do ekscytujących lat, kiedy gry fabularne dopiero raczkowały. Gracze wcielą się w awanturników, którzy w poszukiwaniu chwały oraz bogactw gotowi są podjąć się najtrudniejszych zadań oraz wyruszyć w najniebezpieczniejsze zakątki świata. Wielu z nich nie przeżyje, jednak ci, którym się to uda, zdobędą potęgę, która pozwoli im zmienić losy świata!</p>\n<p>Inspiracją do stworzenia tej gry było wszystko to, co rozpalało wyobraźnię pionierów grających w pierwsze edycje najpopularniejszej gry fabularnej świata. Sesje, które rozegrasz za jej pomocą, będą pełne zarówno śmiertelnie niebezpiecznych sytuacji, jak i okazji do tego, aby odcisnąć swoje piętno na świecie. To, jaką formę przybiorą te sytuacje w świecie gry, zależy tylko od wyobraźni mistrza gry! Orki o fioletowej skórze? Elfy walczące z robotami z kosmosu? Stwory rodem z opowiadań Lovecrafta strzegące skarbów dawno zapomnianej cywilizacji? W <em>Advanced Zabić smoka</em> wszystko jest możliwe i nic nie jest zakazane! </p>\r\nNowoczesne zasady, staroszkolny klimat\r\n<p>Mechanika <em>Advanced Zabić smoka</em> czerpie inspiracje z zasad, które składały się na klimat wczesnych RPG, jednak aby gra była szybka i intuicyjna, nadaje im nowocześniejszą formę.</p>\r\nLos w rękach graczy\r\n<p>Niewiele rzeczy rozczarowuje tak bardzo, jak niepowodzenie spowodowane jednym fartownym rzutem mistrza gry. Z tego powodu w <em>Advanced Zabić smoka</em> niemalże wszystkie rzuty decydujące o powodzeniach w walce, eksploracji czy interakcji wykonywane są przez graczy. Dla mistrzów gry mamy natomiast zestaw tabel, które pomogą urozmaicić rozgrywkę i dodać do niej element nieprzewidywalności. </p>\r\nWygodny i intuicyjny system ekwipunku\r\n<p>W <em>Advanced Zabić smoka</em> gracze wcielają się w bohaterów, dla których eksploracja podziemi to chleb powszechni, tak więc nie muszą się martwić o tym, że czegoś zapomnieli. System ekwipunku oparty na metawalutach sprawi, że rozgrywka skupi się na szukaniu kreatywnych rozwiązań, a nie na księgowości. Gra wykorzystuje również klasyczny plecak ze slotami, aby podczas sesji nie kłopotać się niepotrzebnym liczeniem obciążenia.</p>\r\nProceduralna eksploracja lochów\r\n<p>System eksploracji lochów dzielący ją na rundy, w trakcie których postacie mogą wykonywać specjalne akcje, sprawia, że każda decyzja ma znaczenie. Pochodnie i przeszukiwanie korytarzy mają tak samo duży wpływ na to, jak zakończy się przygoda, jak punkty życia i dobrze wymierzone ataki.</p>\r\nSzybka i niebezpieczna walka\r\n<p>W <em>Advanced Zabić smoka</em> walka jest szybka, brutalna i śmiercionośna. Aby odnieść zwycięstwo, osoby biorące udział w przygodzie będą musiały być przebiegłe, bezwzględne i grać nieczysto. Na szczęście do ich dyspozycji jest szereg broni, z których każda oferuje inne możliwości na polu bitwy.</p>\r\nWszechstronna magia\r\n\n<p>Magia stanowi potężne narzędzie, niezbędne do przetrwania w niebezpiecznym fachu poszukiwacza przygód. Do dyspozycji graczy oddane jest 20 czarów, każdy z trzema poziomami o różnych efektach. Im wyższy poziom, tym potężniejszy efekt, a co za tym idzie, mniejsza szansa na pomyślne rzucenie zaklęcia. <br/>Ci z bohaterów, którzy nie zostaną obdarzeni przez kościanych bogów magicznymi talentami, będą mogli korzystać z warzonych przez siebie eliksirów, aby zwiększyć swoje szanse podczas niebezpiecznych eskapad.</p>\n\r\nPrzygoda nigdy się nie kończy!\r\n<p>Ten projekt jest owocem pracy małej grupki ludzi, którzy włożyli w niego wiele pasji oraz wysiłku. Zabawa nie kończy się jednak na samym podręczniku podstawowym! Mamy przygotowaną linię wydawniczą z dodatkami, które nie tylko ułatwią  i uprzyjemnią wam grę, lecz także pozwolą na łatwe tworzenie własnych materiałów. Koniecznie śledźcie nasz devlog, aby nie przegapić nowych lochów, przeciwników, pułapek i innych dodatków!</p>\n<p>Nic nie da nam większej radości niż to, że podzielicie się waszą twórczością oraz wrażeniami z gry w Advanced Zabić smoka na naszych social mediach lub komentując i wystawiając oceny produktu na tej stronie.</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-17T18:39:42", "background_image": "https://media.rawg.io/media/screenshots/7e9/7e9603ed70f1a5692b74b344a8036f85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wojtek Rosiński"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}