{"id": 868011, "slug": "nuclear-descent", "name": "Nuclear Descent", "name_original": "Nuclear Descent", "description": "Nuclear Descent\r\n<p>\n</p>\n<p>You are a diver and you've been sent on a mission to disable a nuclear reactor in a sunken facility. Due to time constraints, the only solution leadership could come up with is to blow it up with a carefully placed bomb.</p>\n<p>The reactor is malfunctioning and sends out bursts of radiation that heat the water every 10 seconds. This means you only have a few minutes each day to enter the facility before you are forced to leave due to the heat.</p>\n<p>In the facility you will find rocks that emit radiation particles. Your suit can collect these to turn them into energy which can then be used to upgrade your suit and finally, to build the bomb.</p>\n<p>Once you build the bomb, you must deliver it INTO the reactor. </p>\r\nControls:\r\n<ul><li> Move : WASD or Left Stick</li><li>Move Camera : Mouse or Right Stick</li><li>Drop / Walk Mode : F key or B Button (Xbox)</li><li>Swim Mode : Space key or A Button (Xbox)</li><li>Run Underwater : LeftShift or X button (Xbox)</li><li>Collect Energy : Left Click or Y Button (Xbox)</li></ul>\r\n\r\n\r\nImportant Gameplay info\r\n\n<ol><li>If you are inside the building when the heat bar fills, it's game over so leave through the windows before it fills up</li><li>Swim into the submarine to end the current day</li><li>Stand in the center of the energy rocks to maximize the number of particles you collect</li><li>UPGRADE ENERGY SOAK! It significantly increase the amount of energy you get from rocks, and its cheap</li><li>You need to find a way to the reactor to deliver the bomb, so try to find it before you buy the bomb. You might die exploring if you don't have enough heat resistance or know how to get back to windows.</li><li>There's a pretty obvious shortcut to the reactor that I left in just in case</li></ol>\n\n\r\nDevelopment notes\r\n<p>My original idea was a sort of Resident Evil underwater, where you would have to explore the facility by finding keys, opening doors, and solving simple puzzles. I got really close to implementing this, and I even had the level designed with all the routes the player could take, but I got stuck towards the end after making some stupid decisions and mistakes which cost me a lot of time. I had to scrap the whole idea and quickly slap something together. That's where the energy collection mechanic came in. <br/>The original upload had a lot of bugs because of a sleep deprived mistake that completely broke the physics (I was using LateUpdate instead of fixedUpdate...). I also forgot to disable \"Auto Generate\" when baking the lights which almost made me miss the submission deadline. </p>\n<p>Another mistake was getting overconfident halfway through development and thinking I had time to spare. I spent hours planning and creating a scene in Blender that I wanted to include as an in-game cutscene. The noisy intro to the youtube video is part of it, and it was rendered during the jam. </p>\n<p>As for things that went smoothly, I was able to design and develop the entire map in a very short amount of time thanks to level buddy (https://matt-lucas.itch.io/level-buddy). I'm also happy with how the character animations came out after getting significantly better at rigging. </p>\n<p>I really liked my original idea so I might develop this into a full game in the future</p>", "metacritic": null, "released": "2022-10-03", "tba": false, "updated": "2022-10-17T18:34:40", "background_image": "https://media.rawg.io/media/screenshots/683/683c713bf0b17b6512a9adab6748acaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 143, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Skleembof"], "genres": [], "publishers": [], "esrb_rating": null}