{"id": 86815, "slug": "clan-of-tigers", "name": "Clan of Tigers", "name_original": "Clan of Tigers", "description": "A young Tiger awakens in the wilderness - the last remaining member of the legendary Inyati Family. It is your role to seek out new members and rebuild this legendary Clan of Tigers.  Since the great defeat of the Inyati Clan, other competing families have taken over the Safari landscape. The goal of the game is to regain control and rule the territory again.  <br/><br/>You must help this huge cat navigate the wild safari landscape as he explores crocodile infested rivers, fights against cheetahs, hyenas, Elephants, Lions, Leopards, snakes and other dangerous animals.   This high action animal simulator will keep you on the edge of your seat.   However, this is not an ordinary animal simulator . . . <br/><br/>In Clan of Tigers, you enter into a world of both magic and epic adventure.  Your tiger will unlock special magical spells as you locate various magic books. These special abilities include i, invincibility, fireball, healing and lighting bolt.   The magic elements make this game very unique and we believe, best in class for animal simulator games.  <br/><br/>The game is part animal simulation, part adventure game, and part role playing game. It will take you on an ultimate epic journey as you build your great warrior clan, use your magic skills, build your new  home, survive against enemies that attack, and ultimately defeat all 6 Super Bosses. Performance Note : This game will work better on powerful devices.  The 3D graphics are quite processor intensive. <br/><br/><br/>Top Game Features:<br/>-- Build your own Clan of Tigers<br/>-- Leopard , Lion, Crocodile, Hyena, Cheetah, Elephant, and Snake enemies await<br/>-- Part Animal Survival and part RPG<br/>-- Dynamic weather including thunderstorms storms <br/>-- Realistic Safari 3D Landscape<br/>-- 4 Enemy Clans to defeat<br/>-- 6 Super Giant Ultra Bosses<br/>-- 4 Magic Spells to unlock - Fireball, Invincibility, Lightning Bolt, and Healing<br/>-- Dynamic Time of Day - Sunrise to Sunset<br/><br/><br/>Helpful Tips:  Use the Mini Map in the top right corner of the screen to help you find things on the map.  It shows the locations of clan members, bosses, magic books, and other enemies.  Use the mini map to find the members - \"M\", Bosses \"B\" and Books \"b\". You may also seek advice from your spirit guide - a ghostlike figure found near your home.   As you defeat the bosses, more bosses will appear.  All the enemies are not shown on the map in the beginning of the game.  The more you play, the more enemies will appear.<br/><br/>Find all the magic books to unlock the magical skills including: Healing Potion, Fireball, Lightning Bolt, and Invincibility.  Earn adventure points by hunting and completing tasks.  Use the points to upgrade your strength, stamina, and magic.  <br/><br/>Use the Call button to call the family members when you need help against the enemies as you race across the huge WIld Safari open 3D world. Bosses include Snakes, Lion, Crocodile, Hyena, Cheetah, and Hippo. Upgrade your powers to become more powerful, have stronger defense, and have stronger magical ability. This is ultimate animal simulation like you have never seen it.  <br/><br/>If you enjoy this game, please be sure and check out our other 3D animal simulators. We understand that the game is not perfect and we welcome your constructive criticism, just email your suggestions. or post them to our Facebook page.  Help us get better!<br/><br/>Evolved is a series of games from Wild Foot. It would be really great to hear from you.  So far the response has been good, so we will continue making apps of this style.  Please stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates. Believe in yourself, and believe in your Clan of Tigers!", "metacritic": null, "released": "2016-01-04", "tba": false, "updated": "2019-10-22T14:21:55", "background_image": "https://media.rawg.io/media/screenshots/8f2/8f207e373bda7b8e52b5c8a979134e7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 86, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["RPG", "Racing"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Teen"}