{"id": 868125, "slug": "13-steps", "name": "13 Steps", "name_original": "13 Steps", "description": "Find a way out in this horror/time loop Game. Hide, run, and uncover the mysteries of the \"EOS Complex\" as you are pursued by the automated security bots gone rogue. They only move when you do, and you have limited steps before the loop restarts.<br/>So tread carefully, every step could be your last.<h3>Make Every Step Count</h3>Every step you make counts down to 0, solving the mystery of the facility before you run out is essential to your survival. If you do run out, you will be forced back to where you began, you'll keep any items and knowledge, but the world resets.<h3>Tread Softly, Tread Tactically</h3><br/>You are being hunted The security of EOS can only move when you do, use this knowledge to tactically evade, hide and strategize your way out of certain death. You can peak around corners, hide in lockers and sneak out of line of sight, as you gain more tools and knowledge of their behavior you'll become more and more adept at avoiding their pursuit.<h3>Shadow Step</h3>The Shadow step technology allows you to instantaneously move from one point to another, allowing you to move safety from cover to cover, or to location you would otherwise not be able to reach. Use it wisely though, your uses are limited each loop and you wouldn't want to be cornered without it.<h3>Messages from the past</h3><br/>The halls of EOS tell a story, if you listen closely you can uncover the true intentions of the facility and what's really transpired. Escaping is one thing, but how you escape will determine the fate of the facility and people you leave behind. <br/><br/>Make every step count, you never know when it will be your last.", "metacritic": null, "released": "2022-10-18", "tba": false, "updated": "2022-10-21T04:28:51", "background_image": "https://media.rawg.io/media/screenshots/aff/aff8e62aa11179bd6138f04f5a4c8455.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 199, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Embernight Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Embernight Games"], "esrb_rating": null}