{"id": 868135, "slug": "incubus-a-ghost-hunters-tale", "name": "Incubus - A ghost-hunters tale", "name_original": "Incubus - A ghost-hunters tale", "description": "<strong>Are ghosts real?</strong> <br/><br/>You are on your first solo ghost hunting case, under the watchful instructions of Bear and Jen from the O.P.G paranormal team. Use real gadgets in a real location, a house investigated by the game developers several times, on the request of three different owners. It is a case worthy of a video game, so welcome to Incubus.<br/><br/>Uncover the reason as to why this house is always empty. Is it cursed? Many have come and gone from the house, citing malevolent forces play within the empty rooms, a sinister hunched figure has been seen in the corner of the eye and the place is a hotspot for paranormal activity. Will you survive the night?<br/><br/>What makes a haunted house? It's no Dracula's Castle to look at, but neither is the house made famous by the Enfield Poltergeist or the scary monk that haunts the seemingly innocent looking 30 East Drive. Keep an open mind, investigate the house, and see and hear what ghosts may linger at 6 Dread Pit Road, in London's 'East End'. <br/><br/><br/><br/><strong>To solve the mystery of 'House 6' </strong>you must keep your eyes and ears open, and learn how to use ghost-hunting gadgets to pinpoint activity. There have been many tenants who have lived in 'House 6', none stayed very long and few have anything good to say. Quite the opposite, for over the years 'House 6' has accumulated a lot of eye witness statements and terrified testimonials. Here are a few:<br/><br/>\"Coming home, I could hear someone upstairs, an obvious intruder! I snuck next door and phoned the police, who arrived within the hour. By now lights had come on upstairs, as the burglars searched the place. The police had a look around, but found no-one. How's that possible?!!\" K. Taylor, 2020<br/><br/>\"I awoke in the night, unable to move. Someone was pinning me to the bed. It was dark, but there was a figure, on top of me, like a nightmare. I tried to scream, but nothing came out, just weird! It lasted for about 5 minutes!! I felt the weight on my chest. Then nothing. It was morning, but I know it wasn't a dream.\" E.Horton, 2007<br/><br/><br/><br/>\"Yeah, that house!! I was supposed to decorate the place. Good money, should have been easy. But power issues, accidents, and Kenny falling off the ladder, none of that can be explained. It just isn't worth it. It's got something wrong with it. Bad energies.\" Chris, 2004<br/><br/>\"No, it hasn't sold, but we are keen to make a sale soon. We've heard all the stories, urban legends, and the spooky stuff. It's all nonsense, and here at Hoxton's we don't hire ghost-hunters to help sell a house, and if we did, we certainly wouldn't talk about it.\" Hoxton's Real Estate Agent 2022<br/><br/><br/><br/>\"It needs pulling down. There's something evil inside that house.\" Barry, 2022<br/><br/>\"I saw it! The figure at the window. It was ages ago, but I definitely saw it. Nasty eyes, they seem to catch the light, piercing horrible eyes, staring back at me. Some of us locals say it's the Devil. I've never passed that  house since that day. People should stay away.\" Gary, 1998<br/><br/><br/><br/>\"We all witnessed the 'thing'. Hunched, hairy, snarling. It wasn't a person, no way, it moved too quick, and it stank, like wet dog. A dead wet dog! No, there was nothing human about it. We all saw it, and then it disappeared. We didn't wait to see if it came back.\" Sarah, 1987<br/><br/><br/><br/><strong>Features:</strong><br/><ul><li>A real haunted house, captured in detailed 360 views.<br/></li><li>Full 360 exploration and soundtrack recorded on location.<br/></li><li>Interact with ghost-hunting gadgets to investigate.<br/></li><li>Encounter real-world paranormal activity based on witness statements.<br/></li><li>Puzzles and ghost identification.<br/></li><li>Experience a haunting based on eye witness accounts.<br/></li><li>Completely AI driven phenomena, the ghosts are aware!<br/></li><li>A complete story, with a satisfying conclusion.</li></ul><br/>", "metacritic": null, "released": "2023-09-08", "tba": false, "updated": "2023-09-15T06:03:15", "background_image": "https://media.rawg.io/media/screenshots/b21/b2112662eb2eab3ca3c04e522942bf22.jpg", "website": "http://www.darklingroom.co.uk/incubus/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 339, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Darkling Room"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Darkling Room"], "esrb_rating": null}