{"id": 868127, "slug": "backrooms-escape-together", "name": "Backrooms: Escape Together", "name_original": "Backrooms: Escape Together", "description": "As a team of researchers, you are sent into the Backrooms to gather more info on the liminal labyrinth. However, after completing your research duties, an elevator malfunction sends you plummeting into the heart of the most dangerous levels, leaving you with the only objective of escape and survival. <br/><br/><strong>Currently, Level 0 is the only playable level.</strong> Being an introduction, your team is tasked with various research objectives. These can include recording entities and landmarks, gathering data on the backrooms, and collecting VHS tapes for evidence.<br/><br/>Built in Unreal Engine 5, Backrooms: Escape Together will be the first to truly capture the essence of the Backrooms. Levels will be procedurally generated, dynamically lit with stunning quality, and packed with detail. Levels will be added constantly through early access as we grow the game into the <strong>true </strong>Backrooms experience.<h3>Horrifying Imersion</h3>Next-gen graphics, procedurally generated levels, handcrafted sound, and gameplay built to immerse the player will make you feel as if you are really a lost wander, stuck in the Backrooms.<h3>Multiplayer</h3><ul><li>Enter the Backrooms alone or team up with 3 others for a total of 4 player co-op.<br/></li><li>Players can join and host lobbies.<br/></li><li>Each player must find an escape or die trying.<br/></li><li>A unique 1v4 mode will also be added <strong>after launch</strong> (Not currently in the game) allowing players to hunt their friends as the Bacteria.</li></ul><h3>Procedual Generation</h3>Using advanced algorithms, every level is procedurally generated and completely random. Each level will also harbor multiple unique random events that will add caveats to each play-through. Every experience will be different offering endless replayability.", "metacritic": null, "released": "2022-10-18", "tba": false, "updated": "2023-10-01T20:02:13", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbf5925db0efab579bd2952bbec5ff46.jpg", "website": "", "rating": 0.0, "rating_top": 3, "added_by_status": {"owned": 22, "beaten": 3, "toplay": 1, "dropped": 3}, "playtime": 1, "achievements_count": 2, "ratings_count": 5, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 5, "platforms": ["PC"], "developers": ["Triiodide Studios"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Triiodide Studios"], "esrb_rating": null}