{"id": 86814, "slug": "t-rex-survival-simulator", "name": "T-Rex Survival Simulator", "name_original": "T-Rex Survival Simulator", "description": "The Tyrannosaurus Rex is known as one of the most powerful and frightening dinosaurs.  A favorite among dino lovers both young and old, this fearsome creature needs your help in surviving the elements of the Jurassic environment.  This 3D dinosaur simulator allows you to take control of this ferocious T-Rex as he roams near and far to face his enemies. Find your dinosaur mate and start your family. The 3D map is massive so take your time to explore all the areas to find all the bosses. Dinosaur simulation at its best.<br/>The goal of the game is to defeat all 5 bosses. The 5 bosses includes Raptor, Triceratops, Spinosaurus, Pteranodon, and Dilophosaurus. The more you play, the more the Dino grows, and the stronger she gets. Loaded with super fun sounds for great gaming excitement.<br/>Game Features:<br/>-- Your T-Rex Strength, Stamina, and Speed increase with each level you advance<br/>---- Survival is the name of the game<br/>-- Defeat all 5 Dinosaur Giants<br/>-- Huge Open Jurassic World 3D Map<br/>-- The weather and time of day is dynamic. The longer you survive, the more changes you will experience.\u2028-- Fast paced and Continuous action game play\u2028-- Refill your energy by defeating the enemy dinos\u2028\u2028\u2028Come stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames \u2028\u2028Also be sure and check out our other 3D animal simulators. We understand that the app is not perfect, and we welcome your constructive criticism.   Please send your suggestions to wildfootgames@gmail.com. At Wild Foot we are looking for things we can do to improve the app. Now stop reading and go explore!", "metacritic": null, "released": "2015-10-17", "tba": false, "updated": "2019-10-22T14:21:56", "background_image": "https://media.rawg.io/media/screenshots/b61/b61a776192a87d558bc4dc5a1db56c75_YXMVplL.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}