{"id": 868230, "slug": "caterra-rpg-battle-royale", "name": "Caterra: RPG Battle Royale", "name_original": "Caterra: RPG Battle Royale", "description": "Caterra is here to turn your action gaming experience topsy-turvy!<br/> <br/>Get ready for the unique multiplayer battle action in one of the most diverse and anticipated online 3D shooters: choose whether you want to dive into the furious battle royale or hunt down mighty monsters to become the best hunter! So, if you are tired of all those same-looking battle royale games and survival simulators, world of Caterra is the perfect place to get an inimitable experience of ruthless fights and hunt madness!<br/> <br/>Exciting PvP and PvE game modes:<br/>·       Battle Royale<br/>·       Hunt Mode<br/>·       Zombie Mode<br/>·       Team Fight 3x3, 2x2<br/>·       Round Elimination<br/> <br/>Game features:<br/>·       Unique battle royale mechanics<br/>·       17 cat heroes to unlock<br/>·       Extensive upgrade system<br/>·       Awesome skins<br/>·       Seasonal Battle Pass<br/> <br/>Caterra provides you with a unique opportunity to explore the world of battle cats, who can't wait but to battle it meowt - either for fun, revenge or precious rewards. While other multiplayer action games focus on either PvP battles or PvE survival, Caterra is beyond these limits: you get a unique 3D action shooter with both PvP battle royale mechanics and PvE hunt survival that challenges your ability to track and hunt down mighty enemies. And what is the most important - whatever you pick it will be a ton of fun to play anyway!<br/> <br/>Multiple special feline characters are waiting for you to lead them into the brawl: win battles, progress the trophy road and open meowboxes to unlock even more of them! Each cat fighter has their unique ultimate abilities and sets of powers - level up your cat and make them even stronger with an extensive upgrade tree. Getting more power makes you winning more fights but what can be better than just winning? That’s right - winning in style: fun 3D designs and a rich collection of skins is here to help!<br/> <br/>Intuitive gameplay sets Caterra apart from the most multiplayer shooters - no need to learn, you start winning in this fun game right from the start! Variety of breathtaking PvP and PvE game modes and diverse 3D locations will always keep you entertained during your game session. It works especially well with friends, so team up and get into the brawl!<br/> <br/>Download Caterra and battle your way to the top!", "metacritic": null, "released": "2022-10-10", "tba": false, "updated": "2022-10-21T06:36:17", "background_image": "https://media.rawg.io/media/screenshots/6ac/6acea2811420c9952a37916cd543eec2_Qav06FC.jpg", "website": "https://caterragame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Meowpunk"], "genres": ["Action", "RPG"], "publishers": ["BRISHORE"], "esrb_rating": "Everyone 10+"}