{"id": 868208, "slug": "the-pegasus-expedition", "name": "The Pegasus Expedition", "name_original": "The Pegasus Expedition", "description": "<strong>The Pegasus Expedition </strong>is a story-driven sci-fi grand strategy game set in a key moment for humankind’s survival. Facing an overwhelming threat at home, humanity sends an expedition to the Pegasus Galaxy in a desperate attempt to find a refuge for the population of Earth, only to find themselves in the middle of an interstellar war they inadvertently started.<br/><br/>As you lead one of these fleets, your mission soon transitions from exploration to governance, conquest, and eventually a fight for survival. Players will experience a challenging story where nothing is self-evident and every decision will have its consequences.<br/><br/>Building on the legacy of the grand strategy genre, <strong>The Pegasus Expedition</strong> adds a strong narrative side to the classic 4X-gameplay which involves managing your diplomatic ties, armies, economy and scientific development.<h3>Key Features</h3><ul><li><strong>Immense handcrafted world</strong> – a replayable campaign set in a rich, vast world.<br/></li><li><strong>Conflict and tragedy</strong> – experience a deep storyline, where no-one is perfect and ends will often have to justify the means.<br/></li><li><strong>Choose to be the leader you wish to be</strong> – face difficult moral choices in difficult times, and suffer their consequences.<br/></li><li><strong>Rewarding gameplay experience</strong> – Versatile 4X gameplay with many different approaches to various challenges the campaign presents.<br/></li><li><strong>Meaningful diplomacy</strong> – a diverse and versatile system with over 30 independent factions in the galaxy.<br/></li><li><strong>Planning-based combat</strong> – manage your warfronts' bigger picture, and weigh which losses you’re willing to take for success.</li></ul><br/><h3>A story driven 4X-game</h3>The Pegasus Expedition is a story driven grand strategy game which focuses on combining an epic sci-fi narrative with a solid 4X foundation to create a very unique narrative strategy game experience. Your decisions and actions shape the galaxy around you, with every alliance and crisis you suffer or cause leaving their mark.<br/><br/><br/><h3>The Council</h3>As the Director of Zeus Link fleet, you control all aspects of the Zeus Link, making all of your critical decisions with your council; the group of your closest subordinates and advisors. They will inform you of the new developments in the galaxy, and do their part in solving the numerous crises and incidents you will have to resolve, one way or another.<br/><br/><br/><h3>Economy</h3> You will start out with only your seasoned but thin expeditionary fleet, and you will need to develop a functioning economy fast to keep the Expedition going. After all, you will be supplied from home for only so long.<br/><br/><br/><h3>Diplomacy in a Torn Galaxy</h3> The Pegasus Galaxy is full of independent factions, with their own grudges, rivalries and fragile alliances, so you’ll need to navigate this diplomatic landscape with care in order to succeed. That will involve both making dynamic deals and treaties in the diplomacy system, as well as making tough choices in dialogue. After all, you are a suspicious and despised newcomer in this galaxy, with limited time and huge expectations to accomplish.<br/><br/><br/><h3>Manage your Fleets and Officers</h3>To survive in this new and often hostile galaxy, it’s extremely important to keep your forces improving and your leaders trained. You will have to work with limited human resources, and choosing the right person for the right job can often make the difference. Assign admirals, governors and special forces operatives to help you to victory.<br/><br/><br/><h3>Stellar Warfare</h3>War never really changes, and the Pegasus galaxy has a lot of it to offer. Choose your strategies and plan your battles well, as in the Pegasus Expedition’s unique combat, careful planning is everything. Espionage and the well thought out movement of your forces will be crucial in war, in order to have your fleets at the right place at the right time.<br/><br/><br/><h3>Technology</h3>In the future, there’s an even shinier future ahead. There are great discoveries to be made, and many things, great and less great, that you can do using those discoveries. To have a chance against your foes, you'll need to be one step ahead of them in technology too, and not just in strategy.<br/><br/><br/><h3>Fight Against the Ever Worsening Odds</h3>Your starting situation is not an easy one... And it’s only going to get worse. The longer the expedition continues, the higher the stakes, with new threats, enemies, backstabbers and heroic resistance movements. Everything to keep the campaign dynamic, interesting, and challenging to the very end. With a plenty of characters, sidequests and twists and turns to the campaign, the dynamic Pegasus Galaxy will present new challenges to face that will keep you on your toes.<br/><br/><br/>", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2023-06-27T18:33:58", "background_image": "https://media.rawg.io/media/screenshots/1e6/1e6aa95f9749b8c9183a25e103dd8b09.jpg", "website": "https://www.thepegasusexpedition.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "dropped": 1}, "playtime": 1, "achievements_count": 25, "ratings_count": 1, "suggestions_count": 489, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Kalla Gameworks"], "genres": ["Strategy", "Indie"], "publishers": ["Fulqrum Publishing"], "esrb_rating": null}