{"id": 868241, "slug": "mementomori-afkrpg", "name": "MementoMori: AFKRPG", "name_original": "MementoMori: AFKRPG", "description": "“All roads lead to our ‘Goodbye.’” <br/><br/>Boasting an epic soundtrack that can turn the world of gaming on its head, and some of the most stunning designs ever seen in a game, Bank of Innovation’s newest title, MementoMori, is finally here! <br/><br/>Songs performed by many renowned artists enhance the rich world of MementoMori. <br/>*We recommend playing while wearing earphones or headphones. <br/><br/>◆ STORY: <br/>A tale of “justice” woven by girls whose fragile hearts verge on shattering... <br/><br/>There are girls who many call “witches.” <br/>Although they themselves are ordinary, they can wield slightly extraordinary powers. <br/>However, when calamity spreads throughout the land, witches begin to be feared and detested. <br/>Before long, the Church of Longinus commenced what would be known as “The Witch Hunt.” <br/><br/>“Witches are to blame for this calamity. If we kill them, then the calamity will vanish along with them!” <br/><br/>Witches are executed one by one. <br/>But one day, as madness seizes control of the world, it is suddenly overrun by “Curses.” <br/>A country incinerated by hellfire. A kingdom consumed by crystals. An empire purged by the Tree of Life. <br/>Such are the woeful desires of those who are called “Witches of Qlipha.” <br/>Without any means to defend themselves, nation after nation falls into ruin, until finally— <br/>The fractured land is sent adrift high into the sky. <br/><br/>Meanwhile, the people have yet to take notice. <br/>From within these girls cursed to be witches, there emanates glimmers of hope. <br/>In order to save their decimated world, these girls set forth liberating the land from darkness. <br/>For they believe that it is the right thing to do... <br/><br/>◆ GAME: <br/>・Play utilizing both easy-to-use full auto battles and high-level strategy! <br/>・Behold stunning action-packed battles animated using Live2D! <br/>・Harness the “Idle System” to gradually get stronger as the girls fight even while you’re away! <br/>・Unlock tons of content as you advance the story! <br/>・Discover infinite strategic possibilities by combining your wit with the girls’ magical powers! <br/>・Enhance gear to precisely influence how the girls grow stronger! <br/>・Communicate with your friends as you form the most powerful guild in the land! <br/><br/>◆ SOUND: <br/>The girls of MementoMori are burdened with cruel pasts and inevitable fates. <br/>・Cry to “Laments,” which sing each girl’s emotions to life. <br/>・Play accompanied with a high-quality soundtrack not bound to the limits of game music. <br/><br/>The diversity of high-quality musical compositions heavily intertwines with the perilous world of MementoMori, providing a new and exciting gaming experience. <br/><br/>◆ CV/SONG: <br/>Illya (CV: Kana Hanazawa) (SONG: Daoko) <br/>Iris (CV: Inori Minase) (SONG: Hakubi) <br/>Rosalie (CV: Sumire Uesaka) (SONG: Sayaka Yamamoto)<br/>Soltina (CV: Yoshino Nanjo) (SONG: Koresawa) <br/>Amleth (CV: Atsumi Tanezaki) (SONG: Atarayo) <br/>Fenrir (CV: Minami Takahashi) (SONG: Kano)  <br/>Freesia (CV: Yui Horie) (SONG: Sonoko Inoue) <br/>Belle (CV: Yuu Asakawa) (SONG: 96NEKO) <br/>Luke (CV: Ami Koshimizu) (SONG: Ayaka Hirahara) <br/>Carol (CV: Hina Tachibana) (SONG: kurokumo) <br/>...and many more! <br/><br/>*The above is the Japanese cast for the game. <br/>Voices can be changed from English to Japanese in the game’s settings. <br/><br/>◆ Official Website <br/>https://mememori-game.com/en/ <br/><br/>◆ Official Twitter Account (stay updated with the latest info) <br/>https://twitter.com/mementomori_EN <br/><br/>◆ Official Facebook Page (stay updated with the latest info) <br/>https://www.facebook.com/mementomoriEN <br/><br/>◆ Official YouTube Channel (watch special videos and Laments) <br/>https://www.youtube.com/c/MementoMori_global<br/><br/>------<br/>Powered by Live2D", "metacritic": null, "released": "2022-10-17", "tba": false, "updated": "2022-10-21T06:47:13", "background_image": "https://media.rawg.io/media/screenshots/b1c/b1cc6ff56996e5dcb060627c8302f775_ft8idwx.jpg", "website": "https://mememori-game.com/en/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 363, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bank of Innovation"], "genres": ["RPG"], "publishers": ["Bank of Innovation"], "esrb_rating": "Teen"}