{"id": 868236, "slug": "millistar-raiders", "name": "Millistar Raiders", "name_original": "Millistar Raiders", "description": "------------------------------------------------------------------------------------------<br/>“Drum roll. The Pig King's Fellas are coming..!”<br/><br/>In the year 2317 of the Millistar calendar, the seal of the Dark Lord is released  and the Pig Land is in danger.<br/>At the order of the Pig King, the low-ranking soldier, Kim Chun-mil, becomes an expedition warrior..!<br/>------------------------------------------------------------------------------------------ <br/><br/>An exciting fantasy adventure of the commonly acknowledged (?) Avengers! <br/>An Idle RPG of the captain (player) and heroes who go on an expedition to the Devildom! <br/><br/>- The Clown, Farmer, Butcher... These ordinary but also extraordinary people unite as warriors!<br/>- Storm the Devildom with the 13 Heroes! Clear endless stages and reach a new record!<br/>- Play freely in two modes, landscape and portrait!<br/><br/>■ Only 13 Warriors to raise! Be the Captain!<br/>- Farmer, Baker, Drunken... Raise 13 unique characters as Avengers!<br/>- Organize a party of 5 according to the situation and send an auto-battle expedition team to Devildom!<br/>- Even if you're resting, you get plenty of Offline Idle Rewards!<br/><br/>■ The stronger the captain, the stronger the heroes!<br/>- If the captain's stats increase due to enhancement, growth or awakening, the stats of all heroes also go UP! <br/>- Let's rob Kim Brocker's Treasure House and get about 20 captain skillbooks! <br/>- If you equip more than 70 kinds of captain's equipment, the effects will be applied to all heroes!!<br/> <br/>■ Pick up loot, find lost items and collect relics! <br/>- Pick up treasures left behind by monsters! A new treasure appears with each monster! <br/>- Find lost items dropped by 13 heroes during battle! <br/>- The stats of heroes with relics increases! <br/><br/>■ The adventures of the Pig King's (expedition group) are endless!!<br/>- [Castle Defense Battle] Stop special agent demons from infiltrating the Pig Castle <br/>- [Forgotten Alchemist's Cave] A cave guarded by skeleton wizards<br/>- [Millistar Ruins] Find the lost belongings of the 13 heroes<br/>- [Dragon Dungeon] Challenge the Red Dragon, the most unique being on the planet Millistar<br/>- [Awakening Challenge] The ultimate showdown in the desert<br/>- [Arena] Form your own Avengers team and fight against others! Global Avengers Match!<br/>- [Labyrinth] Mutant monsters and the first Dark Lord are waiting for you in this dungeon!<br/>- [Plundering Battle] Clear out the treasure house of Kim Brocker, the famous merchant in Devildom!", "metacritic": null, "released": "2022-10-17", "tba": false, "updated": "2022-10-21T06:42:05", "background_image": "https://media.rawg.io/media/screenshots/7d6/7d659c77059f426389db3c74d154b3ef_cnEsOV6.jpg", "website": "http://www.superplanet.net", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 262, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SuperPlanet"], "genres": ["RPG", "Simulation"], "publishers": ["SuperPlanet"], "esrb_rating": "Everyone 10+"}