{"id": 868238, "slug": "army-of-war", "name": "Army of War", "name_original": "Army of War", "description": "[Army of War] features a world where the monarchy has changed over the ages and is filled with wars and grand epics. Will you piece together its history and revive the legendary leaders who have faded with time? Or will you traverse spans of time to find like-minded allies to conquer the land? Enter the world of [Army of War] and discover what it has to offer, and more!<br/><br/>■ Free Unit Movement, Real-Time Global Battles<br/>Build up your forces and take part in real-time battles that feature global players!<br/>Choose to charge headfirst into hundred player clashes, pillage your enemies’ cities while they sleep, or perform a sneak attack to seize enemy armies and reap the spoils.<br/>Call upon friends to create your Guild:<br/>Strategize with allies to bait the enemy’s main force into an ambush or flank them with decisive maneuvers!<br/><br/>■ Clash of Civilizations &amp; Strategies<br/>Choose from different civilizations that span from east to west, and across all ages. Each civilization provides a different architectural style and development routes.<br/>From the city of the rising sun, to the pearl of the desert, all of the greatest civilizations in human history can be restored in the palm of your hand.<br/>Lead the civilization and its people to rise, conquer, and dominate!<br/>Experience the fiercest clash of minds between humans that has taken place in the last thousand years!<br/><br/>■ The King Returns, Legendary Heroes Gather<br/>Which Heroes will you align yourself with in this epic world? Will it be Catherine the Great, the one who claimed all of Europe? What about King Arthur, the once and future king? Or Napoleon, the greatest modern day general?<br/>Command your troops in a myriad of ways when you combine both Hero abilities and historical tactics.<br/>The glory achieved by kings and Heroes is now within your grasp!<br/><br/>■ Battle Use of the Map Terrain!<br/>The snow plains, rivers, and mountains on the map provide rich strategic options for battle.<br/>Use choke points to win against overwhelming odds or use a river as an obstacle to besiege your enemies from range. Those who can best make use of the elements will emerge victorious.<br/><br/>■ Immersive Battles with Next-Gen 3D Graphics<br/>Take in all of the battlefield's details and realistic weather effects add to the epic atmosphere of battles.<br/><br/>Join our communities:<br/>Discord: https://discord.gg/8H8vrQ68HH", "metacritic": null, "released": "2022-08-09", "tba": false, "updated": "2022-10-21T06:43:45", "background_image": "https://media.rawg.io/media/screenshots/000/00050f12a9c6d17bed6cc22381ad57b2_A2RyGbJ.jpg", "website": "http://thearmyofwar.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["佳 林"], "genres": ["RPG", "Strategy"], "publishers": ["佳 林"], "esrb_rating": "Teen"}