{"id": 868249, "slug": "transport-tycoon-empire-city", "name": "Transport Tycoon Empire: City", "name_original": "Transport Tycoon Empire: City", "description": "Collect vehicles, deliver cargo, finish contracts and even master city building to become ultimate transport tycoon! Find the best strategy and your cargo will flood every train station, airport and dock in every port city in the world. On land, sea and in the air, your transport empire will have no bounds. Collect trains, trucks, ships and planes to complete transport contracts on ever-changing map full of interesting people and places. Conquer every seaport with your cargo ships, satisfy your transport fever and make your pocket city flourish. It doesn't matter if you are helping with repairing bridges, protecting environment, supplying cool theme park or building amazing space center, you will succeed!  <br/><br/><br/><br/>BECOME THE ULTIMATE TRANSPORT TYCOON<br/>In our free Transport Tycoon Empire sim, you are not limited to trains. Transport tycoon masters all ways of delivery. You will use your dispatchers to manage train conductor or ship captain on their journeys and you will hire new dispatchers when your company is ready to expand. Good logistics is as important as having amazing trains and trucks and to stand at the top, you will become master logistics tycoon.<br/><br/>And after the job well done you will have opportunities to collect trains and trucks, buy new plane or boats and you will be ready for even greater challenges that your town and world presents!<br/><br/><br/><br/>BUILD THE CITY<br/>Transport goods, help different contractors,... isn't something missing in your tycoon experience? Foundation and legacy of your big business life? The game incorporates building city simulator sandbox! You will become mayor of the small city and you will expand it, buy new lands, build new buildings and roads for public transport, wherever you want. You will decorate your city, upgrade your company headquarters and give a little more depth to your basic railroad transport line simulator. You will expand your train station, build factories to process goods you acquired with your cargo fleet and dispatch trains, plains, trucks and ships to the whole world.<br/><br/>FEATURES<br/><br/>• Unique blend of goods transport: dispatch your vehicles from sea port, airport or train station to deliver goods<br/>• Build, decorate and customize your city to make permanent mark on the world<br/>• Create global railway empire with many amazing trains, be the ultimate train tycoon<br/>• Collect trucks and become truck tycoon too!<br/>• Own the skies and every airport city with your airplane fleet - after all, we live in the world of airports<br/>• Travel to different regions to build the epic empire - from the desert to city island and frozen north! <br/>• Collect rare vehicles and upgrade them to deliver more cargo - from steam trains to futuristic planes<br/>• Manage your dispatchers - use dependable transport manager to manage traffic and become true transit king and top tycoon<br/><br/><br/><br/>STRATEGY AND SIMULATION HEAVEN<br/>You can have the best of both worlds! This is not only perfect mix of ship tycoon, railroad tycoon and plane tycoon with highly detailed models of every vehicle, you will be city tycoon builder and explore map full of cool places. As the game is situated in unnamed country, you will enjoy everything you like about american and euro truck simulator games, it will be both amazing euro train simulator and airport city manager with various planes at your disposal. Your sea port city will be full of huge cargo ships hauling goods across vast seas and rivers and you will have to do your best to prevail as the best port city ship tycoon in the world. With our epic introduction scenes for all vehicles, you will know how truckers of europe, american train conductors or airplane captains feel when working for you.<br/><br/><br/><br/>Disclaimer: Transport Tycoon Empire is free-to-play game. It can be played completely for free but it also offers options to speed-up the progress by making a purchase.<br/><br/>Join our community of amazing railway tycoons on official Facebook page: https://www.facebook.com/TransportTycoonAndCityBuilder/", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2022-10-21T06:57:49", "background_image": "https://media.rawg.io/media/screenshots/417/417f3a0fee418cf73e7ba95c68e11514_LuHPBcd.jpg", "website": "https://aldagames.com/games/transport-tycoon-empire/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Alda Games"], "genres": ["Strategy", "Simulation"], "publishers": ["Alda Games"], "esrb_rating": "Everyone 10+"}