{"id": 868252, "slug": "brick-rush-block-puzzle-game", "name": "Brick Rush: Block Puzzle Game", "name_original": "Brick Rush: Block Puzzle Game", "description": "Brick Rush - the most exciting and challenging brick game in an immaculate classic look. It's fun, easy to grasp, relaxing block puzzle game you will get addicted to. In this classic block puzzle game, You have different types of shapes continuously fall from above. The goal is to make horizontal lines of tetris blocks with it and score as high as you can. You should place bricks in order to have complete lines with blocks.<br/><br/>When shapes start falling from above, aim and plan for it. You should focus to fit bricks of different shapes and sizes in a grid, clear lines, and crush your high score. You can rotate the falling bricks or move them, left and right.<br/><br/>For all tetris game lovers out there, this is definitely going to make you nostalgic about your childhood. Sit with your friends and family and enjoy this classic brick puzzle game. Interesting block game for all ages which is easy to play, but difficult to master. Try it out and you will love this free classic tetris game. <br/><br/>Features:<br/>- 3 seconds countdown to allow you to get ready for the gameplay<br/>- Personalize your interface by switching between light and dark mode<br/>- Toggle the sounds on or off. A little suggestion would be to keep the sounds on to experience the rush when bricks fall<br/>- Ability to rotate bricks while they are falling<br/>- Ability to see upcoming bricks<br/>- Restart the game when pile of bricks reaches the top<br/>- Indefinite game play<br/>- No annoying purchases<br/><br/>How to play:<br/>- Bricks start falling after the countdown ends<br/>- Fill the grid with bricks and once a line is completely filled, it gets cleared and wins you points<br/>- More the number of lines filled, the more points you score<br/>- Maximum points can be attained when 4 lines are filled at once - TETRIS, however, playing the game enough will hone your skills to score a TETRIS+<br/>- Fill 5 lines altogether to advance to the next level<br/>- Bricks fall with a higher speed as the number of filled lines increase<br/>- Keep a close watch on the upcoming bricks column and strategize your moves in this infinite puzzle of falling bricks<br/><br/>Scoring system:<br/>- 1 line - 5 points<br/>- 2 lines - 10 points<br/>- 3 lines - 15 points<br/>- 4 lines (TETRIS) - 20 points<br/>- 5 lines (TETRIS+) - 30 points<br/><br/>Download NOW to see if you can handle the rush and sustain in this classic puzzle game of falling bricks.", "metacritic": null, "released": "2022-08-12", "tba": false, "updated": "2022-10-21T07:00:42", "background_image": "https://media.rawg.io/media/screenshots/34c/34c3419f0f97960c2973807c2934c4e5_Drg5XGb.jpg", "website": "https://therealkasthetics.github.io/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kanwar Abhijit Singh"], "genres": ["Strategy", "Puzzle"], "publishers": ["Kanwar Abhijit Singh"], "esrb_rating": "Everyone 10+"}