{"id": 868220, "slug": "solitaire-collection-card-game", "name": "Solitaire Collection-Card Game", "name_original": "Solitaire Collection-Card Game", "description": "\"Aged Solitaire Collection, includes Classic Solitaire(also known as Klondike or Patience), Spider Solitaire, FreeCell Solitaire, Pyramid Solitiare, is a brand new collection of various solitaire card games. <br/>Our Solitaire Collection will bring fun and challenge to all card lovers with simple rules and various gameplay. It would be the best casual games for brain exercise.<br/>If you like playing classic crad games, please do not miss this solitaire collection!<br/><br/>Feature:<br/><br/>+The best of Solitaire games(includes Classic Solitaire, Spider, Freecell and Pyramid)<br/>+ Multiple language options<br/>+ Daily challenges of different difficulty<br/>+ Freely switch between portrait screen and landscape screen<br/>+ Choose left-handed or right-handed mode<br/>+ Various backgrounds and cards with different facial styles.<br/>+ Click &amp; Drag function, when you click on a card, it can automatically move to the correct position<br/>+ HINT can guide the next move<br/>+ Automatically save unfinished games<br/>+ Unlimited undo<br/>+ If you win the game, you can get corresponding points and experience points.<br/><br/>Games：<br/><br/>- Classic Solitaire( Klondike or Patience)<br/>Try to collect all the cards in 1 card or 3 card mode from Ace to King.<br/>Get a higher score with less time and fewer steps.<br/><br/>- Spider Solitaire<br/>Play with two decks of 52 cards each. Depending on difficulty, the deck consists of one, two or four different suits. <br/>Use the fewest steps to collect the cards on the table.<br/>Try to challenge yourself by playing two suits or four suits.<br/><br/>- Freecell Solitaire<br/>The most strategic of all Solitaire card games.<br/>Use the empty column to move all the cards of the same suit to the base in the order of A to K.<br/>The secret of winning is the extra four cells!<br/><br/>- Pyremid Solitaire<br/>Remove the two cards with a total of 13 from the board.<br/>Eliminate the card at the top of the pyramid and win!<br/><br/>Enjoy the most popular solitaire games in one single app? <br/>Train your brain as well as kill time ?<br/>If you've played solitaire(Klondike or Patience), Pyramid, FreeCell, Spider, or other card games, you are going to love this solitaire collection on the mobility devices.<br/>Download for free now and start playing!\"", "metacritic": null, "released": "2022-07-14", "tba": false, "updated": "2022-10-21T06:26:40", "background_image": "https://media.rawg.io/media/screenshots/713/7138a44e6ce80e5d28479280f3fa28f2_V4xtdU6.jpg", "website": "http://www.agedstudio.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Aged Studio"], "genres": ["Casual", "Card"], "publishers": ["Aged Studio"], "esrb_rating": "Everyone 10+"}