{"id": 86838, "slug": "duck-hunting-real-shooting-game", "name": "Duck Hunting Real Shooting Game", "name_original": "Duck Hunting Real Shooting Game", "description": "In this duck life vs bow hunter 2017 game you will enjoy ultra HD graphics, amazing favorite effects of sound will also have good impact on your mind and eye catching environment will compel you to play this game again and again. Mountainous, rainy, and blue water view will attract your attention on game side. Install this duck hunting archery shoot game in your mobile device from App store. You can play this game offline there is no internet connection is required. Play this game and enjoy the real fun of life.<br/>If you a real fan of shooting and hunting games then must play this new duck killing game. Ready to become a classic duck hunter try this new duck shooter action game. Test your hunting and shooting skills with this most modern hunt bird’s game. This extreme best and ultimate unique physics base action hunted birds game is specially designed to develop your box arrow hunting skills. Become a great bird’s shooter using this duck bird shooting mania. This game will increase your experience as a professional archer and will train you as a skilled flying bird’s shooter. You play many other different duck games but this hunting game is completely different from them. In this bird hunting adventurous game you can hunt multiple ducks with single arrow shoot. Pick your arrow box and bow and enjoy this outdoor duck shooting simulator game. Hunt the flying ducks with your pro hunting experience and prove that you are the best bird’s hunter of 2017.<br/>In this much addictive and interesting outdoor shooting game. Your main goal is to hunt ducks which are flying on different location randomly. Accurately target your point that your arrow will correctly hit the flying duck bird. You have limited time to perform your task. These collected points will help you to upgrade your archery and also helpful for opening next thrilling and interesting mission. Real duck hunting Shooter 2017 has several challenging and difficult missions. Starting missions are simple and easy but as you enter in further next level you will face more difficult and tough levels. All levels are very exciting and challenging. Complete all mission carefully and become the legend winner of this excellent shoot adventure.<br/><br/>Game Features<br/>- Rare first person bird hunting<br/>- Conventional bow and arrow shooting<br/>- Light Music duck shoot adventure<br/>- Easy bow arrow hunting<br/>- Lively, natural environments<br/>- Funny bird escapes show<br/>- Excellent shoot of zombie ducks<br/>- Six dynamic playing modes<br/>- 2D graphical archery hunting<br/>- Locked arrow bows<br/>- Slight danger of losing game<br/><br/>How to Play<br/>Although the Duck Hunting Game 2017 is hard to ignore but it has very simple steps to play.<br/>- After downloading it very first time put finger on start<br/>- Use your thumb of finger on bow and point the arrow on duck<br/>- Remove the finger to release it to kill duck<br/>- The duck will be dying with extreme protesting sound<br/>- You can share the app with other people<br/>- Game contains 6 different hunting levels which will be open after one another.", "metacritic": null, "released": "2017-08-16", "tba": false, "updated": "2019-10-22T14:21:54", "background_image": "https://media.rawg.io/media/screenshots/18a/18a9a42c30513b46ff5fe468e2c9e09a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Action", "RPG"], "publishers": ["Mindsol Studio"], "esrb_rating": "Everyone 10+"}