{"id": 86830, "slug": "dungeons-such", "name": "Dungeons & Such", "name_original": "Dungeons & Such", "description": "\"...if you're interested in an old-school RPG experience, it won't let you down.\" -TUAW.com,<br/><br/>- Description -<br/><br/>Lurk through the dungeon, raise your level, find treasures, recruit monsters, forge your equipment, build your house, hire other players, and defeat the boss...<br/>Simple and nostalgic dungeon RPG for iOS.<br/><br/>- Features -<br/><br/>- Super indie, 99.9% made by one guy since 2009 ;)<br/>- No in-app purchase<br/>- Good old simple choose-your-adventure style dungeon RPG<br/>- Create your own unique character by customizing your strength, stamina, intelligence, and agility<br/>- Multiplayer feature: Hire other players asynchronously to form a party to enter the dungeon<br/>- Invest in the town to improve the quality of life of people<br/>- Collect monsters to fight with you<br/>- Build your own house<br/>- Forge your weapons and armors to make it stronger<br/>- Supports Game Center leaderboards and achievements<br/>- Auto-save on each floor you go down, making it easy to play on the go<br/>- Save on free iCloud for backup data so you never lose your progress<br/>- Optimized user experience for one-handed use touch interface<br/>- Awesome reviews on replay-value<br/>- 100% support from the actual creator<br/>- Comes with iMessages stickers<br/><br/>- Story -<br/><br/>Small island called Eunaba floats in south of the Hornmare continent. On that island, a princess was kidnapped by an unknown evil. You as a player must become a mercenary and head to the dungeon to save the princess...<br/><br/>- Gameplay &amp; Opening Movie -<br/><br/>http://www.youtube.com/watch?v=s5HKjT_rafI<br/><br/>- Words from the author -<br/>I made this all by myself except for music. I'm still battling on how to make it better. I update the app based on feedbacks and support. Please enjoy!", "metacritic": null, "released": "2010-01-28", "tba": false, "updated": "2019-07-30T02:26:38", "background_image": "https://media.rawg.io/media/screenshots/67a/67a93b0d4d506489472b9d3880e26c5b_GUvTTQ8.jpg", "website": "http://www.summitisland.com/dungeon/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Genki Mine"], "genres": ["Adventure", "RPG"], "publishers": ["Genki Mine"], "esrb_rating": null}