{"id": 868422, "slug": "whatever-itch-napas", "name": "WHATEVER (itch) (Napas)", "name_original": "WHATEVER (itch) (Napas)", "description": "<p>WHATEVER is the <strong>top down isometric</strong> cargo ship <strong>drifting game</strong>. Inspired by true events, with a dash of comedy. Drifting the giant cargo ship through the tiny canal... How <strong>hard</strong> could it be?</p>\n\n<p>Do you remember that one ship? Ever wondered how did the captain screw it up so badly or how hard it is to actually pilot that thing through the canal? Well, me too!<br/><br/>WHATEVER is my attempt to answer these questions and satisfy my curiosity.<br/>You will shed tears and finally realize how amazing every cargo ship captain truly is.<br/>BECAUSE IT IS EXTREMELY HARD TO PILOT THAT !$@%!$# 200,000 TONNE CARGO SHIP WITH ITS EXTREME INERTIA THROUGH THE CANAL!</p>\n\n<p>Your mission is simple. Drift the ship through various canals and deliver all the precious cargo loads before the company goes bankrupt.<br/></p>\n\n<p>The more you progress, the more challenges will come. Violent winds, captivating whirlpools, kaiju, UFO... you name it. All of these are sure to make you yell \"WHATEVER!\" at one point, or another ;]</p>\n<p>*** The free version on itch is contain only 1 level, consider it as a demo. ***</p>\n<p>Full game features<br/>- Seasickness-inducing inertia<br/>- 200,000 tonnes of fun<br/>- 9 narrow canals with 2 boss encounters (Yes, this game has bosses)<br/>- Full controller support<br/><br/>Steam page: WHATEVER on Steam (steampowered.com)</p>", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-10-21T08:10:01", "background_image": "https://media.rawg.io/media/screenshots/e13/e13abdc7f0bd624d26bf2a0f5189cf12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Napas"], "genres": ["Action", "Adventure", "Simulation", "Racing", "Platformer"], "publishers": [], "esrb_rating": null}