{"id": 868592, "slug": "platformer-demo-evan-evers", "name": "Platformer Demo (Evan Evers)", "name_original": "Platformer Demo (Evan Evers)", "description": "<p>This is a small, unpolished platformer demo made in GameMaker Studio 2. In it, you play as a chicken looking for eggs. All assets of the demo (including code, physics simulation, sprites, and music) were created by me, with the exception of sound FX, which were sourced from freesound.org under free use. It's a project I made before I had any formal education in coding, and as such, it's a bit rough around the edges; however, its gameplay is fairly sound. A few notable gameplay features:</p>\n<p>-Core mechanics include jumping, walljumping, gliding, and changing the solidness of select platforms.</p>\n<p>-Player physics and collision were coded entirely from scratch, rather than using GameMaker's built-in physics engine.</p>\n<p>-Transitioning into a glide while in a long fall will convert some of the player's vertical momentum into horizontal momentum.</p>\n<p>-Dynamic respawn system built on triggers.</p>\n<p>-\"Coyote time\" is included to increase the input window for a running jump off of a ledge. It only takes effect for 6 frames after leaving solid ground, so the window may be a bit difficult to notice while playing, which is intended. After all, you don't want the player to feel like the game is bending the rules in the player's favor, even when it is.</p>\n<p>-An input buffer is included for jumping.</p>\n<p>-Walljumping can be performed even when the player isn't quite touching a wall, widening the input window for a walljump and making timing for tight walljumps easier.</p>\n<p>-The player is typically killed when they switch a platform from nonsolid to solid while standing inside of that platform. However, if the player is close to the edge of the platform, they will be pushed out of the platform instead of killed. The margin for this is very slim — only a few pixels, in fact. This mechanic was included to widen the margin of success and lessen frustration when performing tight platforming on platforms that must be quickly switched from nonsolid to solid.</p>", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-10-21T09:23:08", "background_image": "https://media.rawg.io/media/screenshots/bb8/bb8cc75da1279b44eb1448cfd81da3d6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Evan Evers"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}