{"id": 868726, "slug": "a-scientific-interpretation-of-daily-life-in-the-s", "name": "A Scientific Interpretation of Daily Life in the Space Towing Industry (Circa 3052 CE)", "name_original": "A Scientific Interpretation of Daily Life in the Space Towing Industry (Circa 3052 CE)", "description": "<p>(mobile users: the preview image thing is a gif, tap on it and it should play (if it's not already playing). no this game is not built for mobile, apologies)<br/></p><p>In this game, you join the ranks of the noble members of the Space Towing Industry, as you fly your spaceship into these SpaceCaves, grab the mythical Ball Of Being Towed In Space, and tow it back to where you came from.  Keep an eye on the gravity, and try not to crash into anything!</p>\n<p>This game uses mostly keyboard controls, but keep a mouse handy for some dialogs explaining instructions etc.<br/></p>\n<p>I initially created this game (along with <em><strong>CRAPPY </strong></em>(the <em><strong>C</strong>ool <strong>R</strong>ealism-<strong>A</strong>djacent <strong>P</strong>hysics <strong>P</strong>ackage, <strong>Y</strong>'know?</em>)) for my Physics-Based Games coursework, during my master's degree (with most of the work for this game being done between November 2021 and mid-January 2022). I wanted to polish it up a little bit before publishing it here, so now that I finally got around to doing that, I have finally released this game. It's basically just a clone of <em>Thrust</em> (Jeremy Smith, 1986) but in Java instead and using the highest-quality <em>CRAPPY</em>™️ physics.<br/></p>\r\nCREDITS\r\n<ul><li>Programming/art/audio/level design/etc: Me</li><li><em>CRAPPY</em>'s overall architecture was inspired by that of JBox2D</li><li><em>SpaceTow</em> was based on <em>Thrust</em> (Jeremy Smith, 1986)</li></ul>\n<p>https://github.com/11BelowStudio/ce812</p>", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-10-21T10:19:16", "background_image": "https://media.rawg.io/media/screenshots/0be/0bebf6cf6af6683d5b3bb9cdfa9ca6ec.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["11BelowStudio"], "genres": ["Action"], "publishers": [], "esrb_rating": null}