{"id": 868717, "slug": "tears-of-tianchao", "name": "Tears of Tianchao", "name_original": "Tears of Tianchao", "description": "<strong>DESCRIPTION</strong>\n<p>After ten years away from your home nation of Tianchao, you become the cunning commander in the army involved in the intranational civil war called “DaiZai-Yige.” You are sent by the Emperor of Zhongguog to a fellow emperor to restore an ancient power from the late god Heibao. Your mission: kill the Holder of the Mark of Heibao.</p>\n<p><em>My bare skin hisses against the icy waters splashed onto me. The curses and spit flare my cheeks with humiliation.</em>\n</p>\n<p>After being caught in the attempted assassination of the prince, you are thrown into a fight for life and death, traversing through the treacheries of civil war, betrayal, and honor. You must learn to navigate using wits and manipulating to escape suspicion and satisfy both sides of the war.\r\n</p>\n<p>As you uncover the secrets of those involved in the fight and waiting for your past to find you again, will you be able to survive the wrath of the holder of the Mark of Heibao till you earn his trust, or will you fall into the pits of death?\r\n</p>\n<strong>FEATURES</strong>\n<ul><li>Choose to be a female or male commander.\r\n</li><li>Have any sexuality: gay, lesbian, straight, or bi\r\n</li><li>Choose to romance the elites of the ones involved in the war, or share an unforgettable friendship.\r\n</li><li>Navigate between two sides of a civil war and use wits to satisfy both sides in favor of the one you choose: Empire and Rebel\r\n</li><li>Lead the rebel forces to glory or protect the honor of the current emperor.\r\n</li><li>Learn about the past of the Heibao prince and the Lotus Princess.\r\n</li><li>Subdue the suspicion of the prince or face the consequences.\r\n</li><li>Master martial arts and the skills of speech to influence major decisions.\r\n</li><li>Face your past or put it behind yourself.\r\n</li></ul>\n<strong>ROMANCES</strong>\n<p><strong>Ji Qiangxin (he/him)</strong>\n</p>\n<p>[only romanceable with an mmc + special route available if fmc (not romance)]\r\n</p>\n<p><strong>character profile</strong>\n</p>\n<p>Known as: <em>Heibao prince; exiled low-born; The Jian of XueHua</em>\n</p>\n<p><em>“This was not spoken by this prince as of yet, but before you leave, know this: betray me once, and not even Ji Yang-Guang can save your throat.”</em>\n</p>\n<p>As the current holder of the Mark of Heibao, Ji Qiangxin was the prince of Tianchao before his uncle took the throne. Fueled by his thirst for vengeance and the prosperity of his nation, the cold and intimidating prince believes that the imperial family of Tianchao must fall, and nothing will get in his way. He will use all means, even killing, if that is what it takes to restore peace, and that includes you—a commander sent as an assassin of Zhongguog. No one can temper the burning iron heart, and he never believes any can.\r\n</p>\n<p><strong>Ji Shenglian (she/her)</strong>\n</p>\n<p><strong>character profile</strong>\n</p>\n<p>[only romanceable with an fmc]\r\n</p>\n<p>Known as: <em>Lotus Princess; Grand Keeper of the South</em>\n</p>\n<p><em>“As the only princess of Tianchao, I have a duty, but sometimes, I do wonder if my birth was a mistake, just as Zhongguog and the current imperial family believe.”</em>\n</p>\n<p>Benevolent and strikingly beautiful, Ji Shenglian is the only living princess with the blood of the imperial family in both Zhongguog and Tianchao. As the head magician of the rebel forces, she plays an integral role in war in secrecy, and foes tremble under her powerful manipulation of soul energy. Under the guise of the lychee eyes and delicate smile, she holds a fervent spirit and utmost loyalty to her brother, unwilling to allow any form of betrayal towards her and those she loves.\r\n</p>\n<p><strong>Wu Shen (he/him)</strong>\n</p>\n<p><strong>character profile</strong>\n</p>\n<p>Known as: <em>Green snake; Peddler</em>\n</p>\n<p><em>“Yeah, I don’t give a shit as long as I’m payed. If that prince can pay, that’s all. Hmm? Don’t I feel guilty for ditching others? Hahaha! You sure are funny. So, you gonna pay for wasting my time?”</em>\n</p>\n<p>Snarky and charming with skills of disguise, Wu Shen uses his looks and slippery tricks to get what he wants. Being the main spy of the rebel forces, he knows all the right places and people, and every dirty secret never escapes his ears. With a great lust for money and luxuries, he will willingly betray others if the price is right, but when he truly opens his heart, not even the world is enough for him to sacrifice those that he loves.\r\n</p>\n<p><strong>Fu Xiuying</strong> <strong>(she/her)</strong>\n</p>\n<p><strong>character profile</strong>\n</p>\n<p>Known as: <em>Pinnacle lady; woman with the golden tongue</em>\n</p>\n<p><em>“Do I really look that sly? Hehe, you haven’t see the worst. Or…do you want to see it? I may be intelligent and elegant, but don’t let it fool you, little fox.”</em>\n</p>\n<p>Bold like a cat with a spiked tongue, Fu Xiuying is a woman of little words but many schemes. Born into a famed clan of scholars and poets, her skills in politics are unrivalled more so after serving as the handmaiden of the current empress. She keeps her friends close, and her enemies at her fingertips. As the main intelligence gatherer of the rebellion, she is fiercely loyal to her nation and wishes to see a better world. Outside, she appears to be as lovely as a flower, but under her elegant nature, a beast lies dormant.\r\n</p>\n<p><strong>Mo Ge (he/him)</strong>\n</p>\n<p><strong>character profile</strong>\n</p>\n<p><em>Known as: Scholar of a thousand years; Favored of Highest</em>\n</p>\n<p><em>“It’s been too long, old friend. You’ve grown, just as I did, and we’re no longer kids. I hope to form a diplomatic relationship, no matter what our past was.”</em>\n</p>\n<p>Upright and soft-hearted, Mo Ge is the tutor of the imperial prince of the current family. Well-spoken and skilled in all areas of philosophy, science, and arts, he is one of the most skilled man in the history of Tianchao, and the youngest to be an imperial tutor. People around him comment about the dried mandarin peels he carries in a small box. He is diplomatic and kind, and he is willing to sacrifice himself for the one he loves most.\r\n</p>\r\nOther Information\r\n<p>If you have any questions, please feel free to go to the game blog. Otherwise, a comment on this page will be appreciated as well.</p>", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-10-21T10:15:36", "background_image": "https://media.rawg.io/media/screenshots/aea/aea305b364ea8fb2b4bd500f2c7d3c9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ERA Games"], "genres": [], "publishers": [], "esrb_rating": null}