{"id": 86889, "slug": "raptor-world-multiplayer", "name": "Raptor World Multiplayer", "name_original": "Raptor World Multiplayer", "description": "*** Raptor World Multiplayer *** is an dinosaur simulator that allows you to play online against other players from around the world.   Thanks for all your feedback. We made this game with our super fans in mind.  We've included instant magic acquisition on this fun Jurassic landscape.  Challenge real players, in real time. Control your own customizable Raptor Dinosaur and take on any challengers. <br/><br/>Play the offline Jurassic map to build up your skill points and magic. Explore the Volcano, the caverns, the statues, and other mysteries.  Collect all the magic elements in the offline map in order to craft your special powers. Upgrade your speed, strength, and stamina. This is the place you build up your strength and skill level.  Super high quality 3D Jurassic World map to explore.<br/><br/>Your animal will get hungry and thirsty so don't forget to eat and drink!  Challenge other players in real time. Be the last Raptor to survive and score a victory point.<br/>You may also decide to team up and take down Giant bosses<br/>Hunt animals to keep your hunger levels up\u2028.  Drink water so you don't dehydrate.<br/><br/>\u2028Top Game Attributes:<br/>--- Multiplayer Dinosaur Simulator Game<br/>--Get the ? and receive a bonus prize<br/>---Beautifully designed 3D Jurassic World Map\u2028<br/>---Play head to head against real players around the world<br/>\u2028----Real-time action<br/>\u2028---Includes Off-line map to build experience and magic<br/>\u2028---Upgrade your abilities to have a better change at winning<br/><br/>Other dinosaurs include Spinosaurus, Pterodactly, Triceratops, T-rex, mososaurus, and Compagnathus.<br/><br/>Multiplayer is a new series of games we have created at Wild Foot. We listened to all your suggestions and tried to combine them into this game. 3D animal simulation at its best.<br/><br/>Thanks for all the feedback. Be sure and stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates. \u2028 We welcome your constructive criticism. Please email your suggestions. Our focus is making creative games with animals and magic. Animal simulators with a little something extra. Good luck and have a super Wildfoot day!", "metacritic": null, "released": "2017-01-15", "tba": false, "updated": "2019-10-22T14:31:15", "background_image": "https://media.rawg.io/media/screenshots/c37/c37a73afd58d843f36fb91383cbfb30f_gtM2MjR.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 158, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Teen"}