{"id": 86882, "slug": "tiger-multiplayer-siberia", "name": "Tiger Multiplayer - Siberia", "name_original": "Tiger Multiplayer - Siberia", "description": "Tiger Multiplayer - Siberia is an animal simulator that allows you to play head to head against other players from around the world. Go to battle on this huge arctic landscape. Look for the X on the Multiplayer map - there yellow X's are the other tigers. Face off against real players, in real time. Control your own customizable Tiger and take on any challengers.<br/><br/>Remember : Looks for the \"X\" on the multiplayer map. Those are the other players.<br/><br/><br/>Play the offline map to build up your skill points and magic. Collect all the magic elements in the offline map in order to craft your special powers. Upgrade your speed, strength, and stamina. This is the place you build up your strength and skill level. Super high quality 3D Arctic World map to explore.<br/>Your animal will get hungry and thirsty. Don't forget to eat and drink! You will need to get good at hunting down other animals. The easiest animals to hunt are the rabbits and deer.<br/>Challenge other players in real time. Be the last Tiger to survive and score a victory point.<br/>You may also decide to team up and take down Giant bosses<br/>Hunt animals to keep your hunger levels up\u2028Drink water so you don't dehydrate.<br/><br/>\u2028Top App Features:<br/><br/>--- Multiplayer Tiger Game<br/>---Beautifully designed 3D Arctic World Map\u2028<br/>---Play head-to-head against real players around the world\u2028<br/>---Real-time action\u2028---Includes Off-line map to build experience and magic\u2028<br/>---Upgrade your abilities to have a better change at winning<br/><br/>-- True Multiplayer<br/><br/>Other enemies include Bears, Cerberus, Epic Ice Giants, Deer, Dragons, Black Tigers, Dinosaurs, and Wolf<br/><br/>Multiplayer is a new series of games we have created at Wild Foot. We listened to all your suggestions and tried to combine them into this game. 3D animal simulation at its best.<br/><br/>We love to hear from our fans. Stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates. \u2028 We welcome your constructive criticism. Please email your suggestions. Our focus is making creative games with animals and magic. Animal simulators with something special added. Good luck and have a Wildfoot day!", "metacritic": null, "released": "2017-01-03", "tba": false, "updated": "2019-10-22T14:21:58", "background_image": "https://media.rawg.io/media/screenshots/3ab/3abca1439d895b3ba916e1fb231156c9_5FThuRa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["RPG", "Simulation"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Teen"}