{"id": 86887, "slug": "super-water-bike-rider-game-2017", "name": "Super Water Bike Rider Game 2017", "name_original": "Super Water Bike Rider Game 2017", "description": "Your main objective in this game is you have to ride your bike high speed and go through all the check points or collect all the rings on the astonishing beach and on the amazing ocean water within the time limit. Take the wheels of your powerful water surfer bike and drive it on the high speed to collect all the rings with in time. Your race is against time beat the time and you win. Drive your bike crazy on the beach and surf your bike like a Jet Ski or water boat on the water of the beautiful sea. Test your skills on the treacherous paths of the beach and on the water. Play the best developed and designed missions and gets the title of the driver. Forget those repetitive and boring game enjoys the most challenging levels. This game is fun for fun loving people also a challenge for those who love to face challenge. Complete all the given tasks get enough cash to unlock more exciting missions or to buy more powerful bikes. If you do not collect the rings in time or your given specified time is over then your mission is failed and you have to start it again.<br/><br/>How to Play:<br/><br/>•\tPress the acceleration button to speed up the bike. <br/>•\tPress the brake button to reduce the speed or to stop the bike. <br/>•\tTap the left arrow button to turn left. <br/>•\tTap the right button to turn right. <br/><br/>Features:<br/><br/>•\tAmazing floating &amp; surfing sports bike<br/>•\tConsole Quality HD Graphics<br/>•\tRealistic bike physics<br/>•\tEasy, smooth and intuitive controls<br/>•\tRealistic and effective sounds<br/>•\tAddictive game play<br/>•\tchallenging levels<br/>•\tmultiple motorbikes", "metacritic": null, "released": "2017-08-16", "tba": false, "updated": "2019-09-06T03:19:06", "background_image": "https://media.rawg.io/media/screenshots/738/73838b28be7ee3a392ca869562cb702e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mindsol Studio"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Mindsol Studio"], "esrb_rating": "Everyone 10+"}