{"id": 868892, "slug": "the-hunter-oklmi", "name": "The Hunter (OKΛMI)", "name_original": "The Hunter (OKΛMI)", "description": "<p>Recommended playing on fullscreen (screen size 1920/1080)</p>\r\n\r\nThe Hunter\r\n<p>The Hunter is a videogame which it's main goal is to help the character kill the ghost hidden in an object. Investigate, Understand the hints, solve the riddles and find where the ghost in hiding.</p>\n\r\nControls\r\n<p>WASD or Arrows - To move</p>\n<p>Aim with the shotgun - Mouse position</p>\n<p>Shot - Left click</p>\n\r\nRULES\r\n<p>There are 12 different objects that can be possessed, divided by 3 object types and 4 different topics. The 3 types of objects are: Pumpkins, Skulls and Paintings. And lastly, the 4 topics are: color Red, Blood, Candles and Spiders.</p>\r\n    -     -    \r\n<p>Those items will spawn randomly in the map and one of them will be possessed by the ghost! And you will only have 5 minutes to find it... or you will die.</p>\n<p>At first, you won't be able to move the character within the first 10 seconds but the lights will be on, so take advantage of those 10 seconds to memorize the map, because after that they will turn down!</p>\n<p>To find the object in the maze, you will have to use the 3 ritual objects that will guide you to it.</p>\r\n     <br/>\n<p> The phone is one of them and if you use it you could hear 2 thinks: an electric noise or voices. If you hear the electric noise, it means that the ghost is near and causes interferences to the phone, and if you hear voices, it means that the phone works properly so the ghost is far away.</p>\n<p>The altar is a ritual focused for the wiser. It will tell a riddle and it's answer will guide the player to know in which topic of object the ghost is hidden( Red, Blood, Spider, Candle).</p>\n<p>At last, we will be able to use the glass sphere. This sphere is hidden in the map and it will be only able to use once 2.5 minutes have passed. By that time, the possessed object will have flip and the lights will turn on for a few seconds so the sphere will be in charge to see the future and tell the player which object has been moving (Pumpkin, Skull, Painting).</p>\n<p>Even you may have all the information, you are not still able to kill the ghost... maybe you are missing a weapon? You will have to find the shotgun hidden in the map in order to shoot the ghostly object. But be careful!! It is a special shotgun to kill ghosts and instead of bullets... it will use your blood! You will be able the shot only 3 times before dying bled.</p>\n<p>  <br/></p>\n<p>Now your are prepared enough to kill the ghost, but... will you find it?</p>\n\r\n*Spoilers* GUIDE\r\n<p>At first is recommended to take advantage of the first 10 seconds when the lights are on to memorize the position of each of the possible possessed objects. They will always spawn randomly in the places where there is a white square:</p>\n\n<p>At the following step will be to find the shotgun. This one is hidden in a room on the bottom-rights site of the map.</p>\n\n<p>Once you have it, go directly to the phone and listen properly which sounds it makes. Knowing that you will reduce the possibilities by a 50%.</p>\n<p>After that, go straight to the altar and you will be given this different riddles:</p>\n<p>1- all I am young, short I am old. While with life I glow, wind is my foe. What am I? R: Candle</p>\n<p>2- Im red but Im not a strawberry I have different types but Im not an apple I can be pumped but Im not a bicycle tire I can be donated but Im not money I contain cells but Im not a jail Im in your body but Im not your heart. R: Blood</p>\n<p>3-  First think of the person who lives in disguise, Who deals in secrets and tells naught but lies. Next, tell me whats always the last thing to mend, The middle of middle and end of the end? And finally give me the sound often heard During the search for a hard-to-find word. Now string them together, and answer me this, Which creature would you be unwilling to kiss? R: Spider</p>\n<p>4- I love beauty and pain. You can see me in the strawberries, the roses and the cherries and still in blood and fire or in the killer's hands... I am... R: Red</p>\n<p>With all this information sometimes it can be enough to fin the object but sometimes not, and if that is the case, wait until 2.5 minutes have passed to ask the glass sphere which kind of object it is.</p>\n<p>Now shot and win!<br/></p>", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-10-21T11:29:43", "background_image": "https://media.rawg.io/media/screenshots/b21/b21a660625a6861a7d936e1cbbb6fc88.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OKΛMI"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}