{"id": 868830, "slug": "mercenary-miners", "name": "Mercenary Miners", "name_original": "Mercenary Miners", "description": "<p><strong>switch ships with [spacebar] , power laser with [return] and special weapon with [s]</strong><br/></p>\n<p>Who wants to get rich mining precious oretanium while shooting space bugs and pirates? YOU!</p>\n<p>Navigate your fighter and miner ships through dangerous sectors filled with nasty creatures and obstacles. Upgrade your ships with hard-earned space cash and get to know the dedicated crew of the Mercenary Miners' finest vessel: The MM Grandson!</p>\n<ul>\n<li> A new type of shoot'em up: Real-time switching between mining asteroids and fighting enemy ships and creatures.</li>\n<li> Great replay: Be challenged by a list of achievements! The patrolling mission brings a different challenge every run!</li>\n<li> Science fiction adventure: Get to know your crew, meet new races and ancient technology during several missions.</li>\n<li> Mix of multiple mechanics: Missions focus on shooting while dodging enemy projectiles and tricky obstacles.</li>\n<li> 3 difficulty modes: Casual, Hard and HERO offer different challenges for different gamers.</li>\n<li> Skippable story: No need to know what's going on? Just want to play? No problem! The story can be disabled with a single tap or click.</li>\n<li> Unique art style: Like you have never seen before ;-)</li>\n<li> Play for free without one ad. Ever. Why? Because I want you to have FUN!</li>\n</ul>", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-10-21T11:06:49", "background_image": "https://media.rawg.io/media/screenshots/fd4/fd453773447a0f79546b99d66b484e4e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 162, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CodedFun"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}