{"id": 868929, "slug": "cerulean-days", "name": "Cerulean Days", "name_original": "Cerulean Days", "description": "<strong><h3>Cerulean Days is the third original visual novel by developer LeafCascade. It had a successful campaign on Kickstarter and is now here on Steam!</h3></strong><br/><br/><br/><br/><br/><strong>2016.</strong><br/><strong>Inre Island. </strong><br/>A seemingly idyllic, modern island in the middle of the Atlantic Ocean. A constant tranquil breeze along a mild climate, and a well-off society embracing a harmonious way of life. Its citizens often refer to the island as their very own miracle, counting themselves lucky to have been born on it. Tourism is hampered despite Inre being a highly desired travel destination, and for good reason. Not only is it a trip only the rich can afford, a rigorous regime means a special visa is required for entry.<br/><br/><br/><br/><strong>2018. </strong><br/>Over the course of six months, a lethal biological attack claims a significant amount of lives. While tragedy occupies people's minds to the brim, a controlling governmental plan is constructed and put into motion. All to prevent such attacks from ever occurring again. In the following years, Inre Island's citizens face unexpected change from their usual ways. On a somber day—damp, dark, and horrifying—the internet is shut down, leaving the island disconnected from the world around it.<br/><br/><br/><br/><strong>2020 - present.</strong><br/>After a long internet-less spring tinged with uncertainty, a new system to replace it with is introduced. A new \"internet\" along digital setbacks result in major changes to everyday life. Unable to adapt, many find themselves spiritually stuck in a world that no longer exists.<br/>Suddenly, the island appears shrouded in mysteries. The closed hearts are many. A select few want a way out. But most want to reset and forget. <br/>People who never would've met, meet. <br/>People who never would've loved, love. <br/>An island that had never known sadness, knows it now.<br/>Cerulean Days is set in 2020 and follows two outliers of society—mellow Michael and competent Séverine—as they discover the true effects of 2018. Amidst tragedy of lost friends and family, bonds are grown, solace is found, feelings blossom, truth is discovered, and conspiracies are seemingly unraveled. <br/>Hearts in need of mending await you. Welcome to Inre Island.<br/><br/><br/><br/><br/><strong>Séverine</strong> - A creative and intelligent girl working as a professional pastry chef in a luxurious mall. Due to strict schooling and an arduous upbringing, she has a habit of setting a high bar for both herself and those around her. She has a bold side to her, but typically only lets it show around people she's comfortable with. Her past is filled with loneliness but found comfort in chatting with like-minded people online. Due to the changes to Inre Island, and their effects on the social landscape, she is put in a position she's unfamiliar with. And she does not like it. <br/><br/><br/><br/><strong>Grace </strong>- A kind-hearted and bubbly woman working at Inre City High School. For three years, she was Michael's homeroom teacher. After a tragic personal crisis of Michael's, Grace offers him all the support a grieving one could wish for. Since that day, they've lived in harmony under the same roof. Since that day, they've found solace in each other's company. Since that day, they've been an uncommon \"family\". <br/><br/><br/><br/><strong>Rose </strong>- A cheerful full-time streamer meets an internet-less society. Confusion about life ensues. Her online community – her everything – is forever gone. Rose is lost and knows not how to get out of the pit she has been put in. And her stubbornness makes everything all the more difficult! Will she adapt? Or will she remain stuck, holding onto fragments of her past?", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2023-09-15T03:53:36", "background_image": "https://media.rawg.io/media/screenshots/e0c/e0c4a378e443028884235878905554d9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 14, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web", "macOS"], "developers": ["Cascade of Leaves", "Xander Stewart"], "genres": ["Adventure", "Casual", "Platformer"], "publishers": ["NekoNyan"], "esrb_rating": null}