{"id": 86904, "slug": "clan-of-leopards", "name": "Clan Of Leopards", "name_original": "Clan Of Leopards", "description": "A young Leopard awakens in the wild - the last known member of the legendary Ingwe Clan. It is your role to rebuild this legendary Leopard clan and defeat all the enemy clans.  You must help him navigate the wild safari landscape as he crosses over crocodile infested rivers, fights against cheetahs, hyenas, Elephants, Leopards, and other dangerous animals.   This high action adventure simulator will keep you on the edge of your seat.   However, this is not an ordinary animal simulator . . . <br/><br/>In Clan of Leopards, you enter into a world of magic and adventure.  Your leopard will unlock special magical spells as you locate different magic books. These include special abilities such as invisibility, fireball, healing and lighting bolt.   The magic elements make this game very unique and we believe, best in class for animal simulator games.  <br/><br/>The game is part adventure, part animal simulation, and part role playing game. It will take you on an ultimate epic journey as you build your warrior clan, use your magic, build your home, survive against enemies that attack, and ultimately defeat all 6 Super Bosses.  App Performance Note : This game will perform best on powerful devices.  The 3D graphics are processor intensive. <br/><br/><br/>Top Game Features:<br/>-- Build your own Leopard Clan<br/>-- Crocodile, Leopard, Hyena, Cheetah, Elephant, and Snake enemies<br/>-- Massive 3D Open World Safari Map<br/>-- Part Animal Survival and part RPG<br/>-- Dynamic weather including thunderstorms storms and wind<br/>-- Realistic Safari Scenarios<br/>-- 4 Enemy Clans to defeat<br/>-- 6 Super Giant Ultra Bosses<br/>-- 4 Magic Spells to unlock - Fireball, Invincibility, Lightning Bolt, and Healing<br/><br/><br/>Helpful Tips:  Use the Mini Map in the top right corner of the screen to help you find things on the map.  It shows the locations of clan members, bosses, magic books, and other enemies.  Use the mini map to find the members - \"M\", Bosses \"B\" and Books \"b\". You may also seek advice from your spirit guide - a ghostlike figure found near your home.   As you defeat the bosses, more bosses will appear.  All the enemies are not shown on the map in the beginning of the game.  The more you play, the more enemies will appear.<br/><br/>Find all the magic books to unlock the magical skills including: Healing Potion, Fireball, Lightning Bolt, and Invincibility.  Earn adventure points by hunting and completing tasks.  Use the points to upgrade your strength, stamina, and magic.  <br/><br/>You may call the members when you need help against the enemies as you race across the huge WIld Safari open 3D world. Bosses include Snakes, Lion, Crocodile, Hyena, Cheetah. Upgrade your powers to become more powerful, have stronger defense, and have stronger magical ability. This is ultimate animal simulation like you have never seen it.  <br/><br/>If you enjoy this game, please be sure and check out our other 3D animal simulators. We understand that the game is not perfect and we welcome your constructive criticism, just email your suggestions. or post them to our Facebook page. <br/><br/>Evolved is a new series of games from Wild Foot.  We'd really like to hear from you.  So far the response has been good, so we will continue making apps of this style.  Please stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates. Believe in yourself, and believe in your Leopard Clan!", "metacritic": null, "released": "2016-03-04", "tba": false, "updated": "2019-10-22T14:21:58", "background_image": "https://media.rawg.io/media/screenshots/942/942520192e7f0a3a22ff953192b84f9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 93, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}