{"id": 869007, "slug": "stealth-itch-laretrocaverna", "name": "Stealth (itch) (LaRetroCaverna)", "name_original": "Stealth (itch) (LaRetroCaverna)", "description": "<p>\n</p>\n<p> The playable demo ends at the first underwater scene.\r\n </p>\n\n<p><strong>ON NEXT UPDATES</strong>\n</p>\n<p>- Complete game.</p>\n<p> - Adding music and sound effects.\r\n </p>\n<p> - More detailed backgrounds, sprites and cutscenes.\r\n </p>\n<p> - More cutscenes and actions, according to the original game.\r\n </p>\n<p> - More languages.\r\n </p>\n\n<p><strong>(MAYBE) ON FUTURE UPDATES</strong>\n</p>\n<p><strong>- </strong>Game intro.\r\n </p>\n<p> - Action scenes.\r\n </p>\n<p>- More than one slot for saving games.</p>\n\n<p><strong>TIPS</strong></p>\n<p>- Use button A to talk with every character and check every single scene element for finding objects and clues.</p>\n<p>- Use START button to save your game frequently. In this game, you can lose the game with the innapropiatte decissions or actions.</p>\n<p>- Some scenes prevent to use SELECT button to access the Inventory. This is not a bug. This is due to programming reasons and indirectly is a clue for recognize a critical situation or an imminent important event.</p>\n\n<p>Enjoy the demo and thanks for playing!</p>\n\n<p>---------------------</p>\n<p><strong><em>ESPAÑOL</em></strong></p>\n<p>---------------------\r\n</p>\n<p><strong>INFOMACIÓN GENERAL</strong></p>\n<p>“STEALTH” es un port/demake tributo a “Operation Stealth” (también conocido como “007 – The Stealth Affair”), originalmente diseñado por Delphine Software (Paul Cuisset, Jean Baudlot...) para IBM y compatibles (MS-DOS), Atari ST y Amiga en 1990.\r\n</p>\n<p>El juego original es una aventura gráfica \"point &amp; click\"; esta versión mantiene ese espíritu de aventura, pero adaptada a una jugabilidad más al estilo de Pokèmon, por motivos de limitaciones del sistema y pensando en una experiencia más sencilla y fluida, por el hecho de manejarse con el clásico control de una consola en lugar de un ratón tradicional.</p>\n<p>Este trabajo está dedicado a todo el equipo de Delphine Software y a toda persona entusiasta de las aventuras gráficas y de la Game Boy del planeta (y más allá).\r\n</p>\n\n<p><strong>INFORMACIÓN TÉCNICA</strong></p>\n<p>El juego está diseñado con GB Studio, un motor creado por Chris Maltby para desarrollar juegos para Game Boy y Game Boy Color.\r\n</p>\n<p>Este juego utiliza la resolución menor del sistema, 160x144 píxeles, 4 tonos de verde, sin sonido (de momento), compatible con sistemas y emuladores GB, GB Color y GB advance.\r\n</p>\n<p>Los sprites y los fondos están hechos con Microsoft Paint para Windows 7.\r\n</p>\n<p>Para correr este juego necesitarás un emulador de Game Boy con funciones de batería de guardado (la gran mayoría tienen esa función). Teóricamente, puedes jugarlo en una Game Boy real, estableciendo la rom en un cartucho o bien con un dispositivo \"everdrive\" (no comprobado).\r\n</p>\n\n<p><strong>ARGUMENTO</strong></p>\n<p>El argumento es el mismo que el original: Un prototipo secreto de avión F-19 ha sido robado y tú, John Glames, eres el agente especial asignado a la misión de recuperación. Tu agencia te manda a la república de Santa Paragua, una isla gobernada por el General Manigua, siendo su gobierno y ejército los principales sospechosos del caso.</p>\n<p>Llegas al aeropuerto de Santa Paragua y tus primeros pasos deberían ser encontrar a tu contacto en la ciudad para saber cómo llevar a cabo tu misión. Pero pasan cosas.</p>\n\n<p><strong>CONTROLES</strong>\n</p>\n<p>4 BOTONES DE MOVIMENTO</p>\n<p>- Mover a John por el escenario.\r\n</p>\n<p>- Seleccionar entre opciones en los menús.</p>\n<p>BOTÓN A\r\n</p>\n<p>- Interactuar con objetos, personajes y elementos del escenario.\r\n</p>\n<p>- Confirmar acciones en los menús.\r\n</p>\n<p>BOTÓN B</p>\n<p> - Sin uso.\r\n</p>\n<p>BOTÓN SELECT</p>\n<p>- Abre y cierra la pantalla del inventario.\r\n</p>\n<p>BOTÓN START</p>\n<p>- Comienza el juego en la pantalla de título.\r\n</p>\n<p>- Abre el menú de GUARDAR/CARGAR/REINICIAR la partida.\r\n</p>\n\n<p><strong>DIFERENCIAS CON EL JUEGO ORIGINAL</strong></p>\n<p>- Interacción directa con los elementos en lugar del tradicional menú de acciones gestionado con clicks de ratón.\r\n</p>\n<p>- No es posible volver a zonas anteriores si todos los objetivos ya han sido cumplidos, así como no lo es poder avanzar si dejamos algo por hacer. Los motivos son de estructuración y programación. En el juego original se permitía llegar a zonas muy avanzadas sin los objetos necesarios, haciendo imposible completar la aventura. He creído que evitar esto sería una buena idea.</p>\n<p>- Sin escenas subacuáticas. Estas escenas de acción no están presentes por dificultades de programación y memoria. Cabe la posibilidad de que sean añadidas en futuras actualizaciones.</p>\n<p>- Las escenas de laberinto han sido adaptadas (comportamiento de los enemigos, estructura de los laberintos, etc.).</p>\n<p>El juego, de momento, no tiene sonido. Será añadido en futuras revisiones.</p>\n\n<p><strong>ACERCA DE LA DEMO</strong></p>\n<p>La demo jugable llega hasta la primera escena bajo el agua.\r\n</p>\n\n<p><strong>EN PRÓXIMAS ACTUALIZACIONES</strong></p>\n<p>- El juego completo.\r\n</p>\n<p>- Se añadirán música y efectos de sonido.\r\n</p>\n<p>- Se mejorará el detalle de escenarios, personajes y escenas de tránsito.\r\n</p>\n<p>- Se añadirán más escenas de tránsito y acciones, para resultar más acorde al juego original.\r\n</p>\n<p>- Se añadirán idiomas.</p>\n\n<p><strong>(PUEDE QUE) EN FUTURAS ACTUALIZACIONES</strong></p>\n<p><strong>- </strong>Se añada la intro del juego.\r\n</p>\n<p>- Se añadan escenas de acción.\r\n</p>\n<p>- Se disponga de más de una ranura para guardar partidas.\r\n</p>\n\n<p><strong>CONSEJOS</strong></p>\n<p>- Usa el botón A para hablar con todos los personajes y para interactuar con cualquier elemento del escenario, para encontrar objetos y pistas.</p>\n<p>- Usa el botón START para guardar tu partida con frencuencia. En este juego puedes perder debido a decisiones y acciones inapropiadas.\r\n</p>\n<p>- Algunas escenas impiden el uso del botón SELECT para acceder al inventario. Esto no es un bug. Es por razones de programación y debería dar una pista de que nos encontramos ante un evento inminente importante.\r\n</p>\n<p>¡Disfruta la demo y gracias por jugar!</p>", "metacritic": null, "released": "2022-10-18", "tba": false, "updated": "2022-10-21T12:16:42", "background_image": "https://media.rawg.io/media/screenshots/e62/e6296c7d9b7633d02c8ed19c22ec0ff6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LaRetroCaverna"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}