{"id": 869405, "slug": "6-letters", "name": "6 Letters", "name_original": "6 Letters", "description": "<p>This is a game created for the Game Jam: A Game By It's Cover 22</p>\n<p>This game is based off ※※※※※※ (#113) designed by mituo.</p>\n<p>Can you get the password? 6 Letters, 6 clues, all you have to do is observe.</p><p>You can see the full game covers here: https://famicase.com/22/<br/><br/></p>\n<p>I have provided some hints for you here, but please try and solve as much as you can without!<br/></p>\r\n\r\nFirst Letter Hint A<br/>Have a closer look at the flashing cursor, can you spot a pattern?<br/>\r\n\r\nFirst Letter Hint B<br/>Looks like morse code!<br/>\r\n\r\nSecond Letter Hint AUse your cursor and see if you can find a hidden phrase.<br/>\r\n\r\nSecond Letter Hint BThe letters in the hidden phrase looks like they've been shifted across. Maybe look into Ceaser Cipher.<br/>\r\n\r\nThird Letter Hint AThere's something off about the version number.<br/>\r\n\r\nThird Letter Hint BWhat's the value at the end?<br/>\r\n\r\nFourth Letter Hint ASometimes getting the password wrong is useful! <br/>\r\n\r\nFourth Letter Hint BThe wrong password message has an error.<br/>\r\n\r\nFifth Letter Hint ATry typing a variety of letters, maybe one will stick out.<br/>\r\n\r\nFifth Letter Hint BTyping the right letter in the first four cells will flash on the fifth cell. Time for some brute forcing!<br/>\r\n\r\nSixth Letter Hint AThere's a glitch image appearing, maybe this is another type of cipher?<br/>\r\n\r\nSixth Letter Hint BMaybe look into the Pigpen Cipher!<br/>", "metacritic": null, "released": "2022-10-17", "tba": false, "updated": "2022-10-21T15:08:01", "background_image": "https://media.rawg.io/media/screenshots/18f/18f9c5df237b68e26c2afdc2607ab345.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Philip Newsham"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}