{"id": 869449, "slug": "bibli-o-mat", "name": "Bibli-o-mat", "name_original": "Bibli-o-mat", "description": "<p><strong>Bibli-o-mat Book Browser</strong></p>\n\n<p>Bibli-o-mat lets you pull any public domain book from Archive.org's Open Library and handle them in life-size 3-dimensional form.  You can read them surrounded by the Library of Congress Reading Room or other environments of you choose.  This is a work in progress.  Your support will allow us to add the many planned features that we have on our agenda.  Feature requests and bug reports welcome!</p>\n\n<p>Search for public domain books in by Subject, Title or Author and select which collections to search through. </p>\n<p>Read a 3D representation of the book produced to the scale you designate. </p>\n<p>Adjusting the anti-aliasing can compensate for artifacts caused by limited headset resolution.</p>\n\n<p>Books will be affected by gravity when near the table, but if carried away from the table will float in space. </p>\n<p>Grabbing a book with your right hand will make it the active book for page turning.</p>\n<p>In VR, the right thumb stick will turn the pages of the active book. </p>\n<p>The left thumb stick will move you about the room. </p>\n<p>The A button will toggle the visibility of the search panel. </p>\n\n<p>The right hand has a pointer for interacting with the search panel.</p>\n<p>Because of memory limitations, the books only retain the several pages before and after the one you are reading. </p>\n<p>Page turning may be slow if the next pages are still downloading. </p>\n<p>Opening too many books in one session can cause the app to crash. </p>\n<p>To prevent this, only fours books at a time is allowed - the first books you loaded will be destroyed if you load more.</p>\n<p>Use Settings to change environment and anti-alias level of book pages.  A higher level of anti-aliasing uses less memory but can look more blurry.</p>\n\n<p>This experience is designed for VR and the Meta Quest 2.</p>\n\n<p>KNOWN ISSUES:\r\n</p>\n<p>- Memory issues limits number of books open at once to one.</p>\n<p>- Scope of books limited by what is in the public domain.\r\n</p>\n<p>- Resolution of headset still limits ease of reading - books need to be held unnaturally close for legibility\r\n</p>\n<p>- Turning pages is slow due to internet speeds of loading on demand\r\n</p>", "metacritic": null, "released": "2022-10-15", "tba": false, "updated": "2022-10-21T15:26:49", "background_image": "https://media.rawg.io/media/screenshots/c40/c40e530765dd6da228fe4a388327512f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["artifactvideo"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}