{"id": 869640, "slug": "observo", "name": "Observo", "name_original": "Observo", "description": "<strong>OBSERVO</strong> is a love letter to classic survival horror games of the early 2000s, with a focus on atmospheric horror, puzzle solving, and light combat.<br/><br/>You play as Edgar, a man on a business trip to a small town who has to find a place to spend the night at the last minute. He comes across this one roadside inn that, while looking a little worse for wear, it has a friendly manager, clean sheets and warm water, so he doesn't think much of it. However, when strange things start happening around him and Edgar suddenly finds himself in real danger, his next objective then becomes escaping from that place while he still can…<br/><br/>But it won't be that easy.<br/><br/><br/><br/><strong>Explore </strong>the mysterious inn as you try to find a way out of there… but beware of what you might run into. If push comes to shove, you will need to fight your way to safety using makeshift weapons, or you could choose a run and dodge approach to deal with any hostile figures you may encounter.<br/><br/><br/><br/><strong>Obtain</strong> items, solve puzzles, and collect documents to progress through the story. Your inventory is limited, however, so manage carefully what you’re going to take with you and what you’re going to leave stored in the item box.<h3>KEY FEATURES </h3><br/><ul><li>Puzzles<br/></li><li>Fixed cameras<br/></li><li>Light combat<br/></li><li>Limited inventory<br/></li><li>Manual saving at save points<br/></li><li>Original soundtrack</li></ul>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T03:46:40", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fbf80465636af3f88e345183fe888f7.jpg", "website": "https://spacezeta.com.br/observo.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SpaceZeta Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["SpaceZeta Games"], "esrb_rating": null}