{"id": 869659, "slug": "omni-magic", "name": "Omni Magic!", "name_original": "Omni Magic!", "description": "All characters are above 18 years old.<br/><br/><br/>[Story]<br/><br/>The Kingdom of Elaire was blessed by the Goddess and protected from monsters.<br/>People of Elaire enjoyed peaceful lives and the memory of war was fading.<br/><br/>One day, \"Royal Treasure\" was stolen from the vault of the castle.<br/>Since the incident, monsters started spawning all around the Kingdom.<br/><br/>To solve the issue, the King gathered adventurers from all over the world, appointing them to be \"investigators\".<br/>Their mission was to research monsters and bring the treasure back.<br/>The King promised to grant one wish of an investigator who solved the issue......<br/><br/><br/>[Heroine]<br/><br/>Anemone Anemony<br/><br/>The naive and clumsy girl aspires to be an investigator.<br/>Her skill, \"Omni Magic\" used items to cast powerful magics.<br/>She always wanted to become the sidekick magician of a strong hero, but she is not so confident yet.<br/><br/>The people of the town seem to teach the innocent girl false information.<br/>Her adventure to bring back the Royal Treasure starts here.<br/><br/><br/><br/>[Game System]<br/><br/>As an investigator, search for clues to find the treasure by taking quests to defeat monsters!<br/><br/>1. Gather some information about monsters to use effective \"Omni Magic\".<br/><br/>2. Based on the information you gathered, collect the items which could be used for the magic.<br/>Items can be found by exploring the town or by offering something naughty to people. <br/><br/>3. When you are ready, let's head to the quest!<br/>In order to spot the monsters, you need to choose what to do based on the information you gathered.<br/><br/>4. When you encounter the monsters, defeat them with magic!<br/>A frail girl swinging her wand would not inflict any damage on the monsters...<br/>Find a weak spot of the monster, and choose items to cast an effective \"Omni Magic\"!<br/>If you lose, the monsters will have no mercy on Anemone.", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-10-24T04:09:55", "background_image": "https://media.rawg.io/media/screenshots/b75/b758cc3cfebe024f3caec78a278be654.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 502, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sharktales."], "genres": ["RPG", "Indie"], "publishers": ["WASABI entertainment"], "esrb_rating": null}