{"id": 86986, "slug": "giant-gorilla-city-attack", "name": "Giant Gorilla City Attack", "name_original": "Giant Gorilla City Attack", "description": "Giant Gorilla City Attack<br/>Play as angry gorilla and attack the evil city of killers to take revenge.<br/>In this game you will play as a gorilla that is gone mad due to anger. <br/>The story of this gorilla simulator game is:<br/>A city building agency has occupied a large land of the jungle nearby to expand their city territories. They have destroyed the houses of many peaceful and friendly animals that have been proved themselves to be good neighbors to the city for a large time span. Now, when their community is smashed, they are out for vengeance. They want to take revenge from the evil authorities who have invaded their lands and ruined their homes. You, a black giant ape are one of them. You will control the ape in this gorilla simulator game.<br/>This gorilla simulator game is divided in many levels. You will have to do some tasks to complete each level.  Each level is full of fun and crazy activities. You will have to reach a destination point. Pounce towards pedestrians on the way and watch them fleeing. Smash cars in the way. Trample down the city buildings. Bang the props of your choice. It is all about destruction. Discover the wild animal in you! You can express your wild feelings in this gorilla simulator game.<br/>In this gorilla simulator game, you can make the gorilla to perform different moves in it. It can simply walk. It can pounce. It can leap and jump. You shall enjoy when it will roar. Take your revenge. Turn this city in total chaos and show the anger in you by performing destruction actions relentlessly. Enjoy the gorilla simulator game. Humans have destroyed your home; it is time for them to payback – it is time for revenge!<br/><br/>Special Features <br/>Fun to play casual, arcade themed game<br/>Easy to learn user friendly controls<br/>Realistic gorilla animations<br/>Detailed 3d graphics<br/>Cool game environment<br/><br/>Facing problems? Got suggestions? We love to hear from you! And will try to fix it ASAP.", "metacritic": null, "released": "2016-09-03", "tba": false, "updated": "2019-10-22T14:21:59", "background_image": "https://media.rawg.io/media/screenshots/fff/fff5604bff1b8632b52a88ff45f788b8_kdlOaje.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 139, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Door to Apps"], "genres": ["Adventure"], "publishers": ["Door to Apps"], "esrb_rating": null}