{"id": 87003, "slug": "clan-of-wolf", "name": "Clan Of Wolf", "name_original": "Clan Of Wolf", "description": "Come and play the ultimate wolf adventure game. Navigate caves, rivers, and dangerous animals in this high action adventure simulator.  In Clan of Wolf, you enter into a world of adventure and magic as you build you Clan of Wolves defeat all the enemies.  Seek help and advice from your spirit guide. <br/><br/>Tips:  Use the mini map to help you in the game.  It shows the locations of clan members, bosses, magic books, and enemies.  As you defeat the bosses, more bosses will appear.<br/> <br/>Now with UNLOCKABLE MAGIC!!<br/>Adventure Points unlock and special magic abilities for your wolves.   Lighting Bolt, Fireball, Healing, and Invincibility. Find all the magic books to unlock the magical skills including: Healing Potion, Fireball, Lightning Bolt, and Invincibility. <br/><br/>The game is part adventure and part animal simulation. This adventure simulator will take you on an ultimate epic journey as you build your warrior clan, use your magic, construct your home, defend against enemies that attack, and ultimately defeat all the Super Bosses.  Please Note : This game will perform best on powerful devices.<br/><br/>Top Wolf Game Features:<br/><br/>-- Build your own Clan<br/>-- Massive 3D Open World Map<br/>-- 4 Magic Spells - Fireball, Invincibility, Lightning Bolt, and Healing<br/>-- Map includes Caves, Mountains, and Rivers<br/>-- Dynamic weather including snow and rain storms<br/>-- 6 Giant bosses <br/>-- 4 Enemy Clans to defeat<br/>-- Ultra Challenging Super Bosses<br/>--Crocodile, Wolf, Bear, Lion, Wolf, Snake, and Eagle enemies<br/><br/>Earn adventure points by hunting and completing tasks.  Use the points to upgrade your strength, stamina, and magic.  <br/><br/>As you race across the open world, you may call the members when you need help against the enemies. Bosses include Snakes, Lion, Bear, Crocodile, Goats, Horses, Attack eagles, and Foxes.  Upgrade your powers to become more powerful, have stronger defense, and have stronger magical ability. This is ultimate animal simulation like you have never seen it.  <br/><br/>Please check out our other 3D animal simulators. We understand that the game is by no means perfect and we welcome your constructive criticism.   Kindly email us your suggestions.  <br/><br/>Evolved is a new series of games we are creating at Wild Foot.  We would really like to hear from you.  Please stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates. Good luck!", "metacritic": null, "released": "2015-12-21", "tba": false, "updated": "2019-10-22T14:22:33", "background_image": "https://media.rawg.io/media/screenshots/5b2/5b2a5e266d66c50f98a43516b711f621.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Teen"}