{"id": 870032, "slug": "trinity-tactics", "name": "Trinity Tactics", "name_original": "Trinity Tactics", "description": "The Game \r\n<p>Trinity tactics is a multiplayer tactics experience where you have to defeat the enemy player with predictive tactics. Build and position your units each turn to get an advantage over the enemy player.</p>\r\nPredict the enemies moves\r\n<p>You want to defeat your opponent? Then you have to put yourself in his shoes and find out what he might be up to. Due to the simultaneous moves in trinity tactics, you have to figure out your opponent to defeat him.\r\n</p>\r\nChange your units \r\n<p>Counter your opponent by constantly changing your units. This gives you an advantage because you are not so predictable. If a strategy works, however, the opponent must first find an answer.\r\n</p>\r\nDefeat your enemy \r\n<p>Defeat your opponent by destroying all his units or by collecting the victory points.\r\n</p>\r\nProcedurally generated maps\r\n<p>Play on a different map each time. Or play your favourite map entering the seed when creating a room.</p>\r\nRules\r\n<p>You start with three base units. \r\n</p>\n<p>In the beginning, you can place them in different areas.</p>\n<p>You begin every turn with ability points that you can spend amongst your units. One unit has three abilities and three talents:</p>\r\nStrength\r\n<p>  influences the maximum health of the unit.</p>\n<p>influences the damage it does per hit.</p>\r\nAgility \r\n<p> influences the movement.</p>\n<p>influences how often the unit attacks.</p>\r\nFocus \r\n<p> influences the initiative which determines who attacks first.</p>\n<p> influences range which determines how far the unit can attack.</p>\r\nPiercing \r\n<p> influences the initiative of the unit.</p>\n<p>influences each hit does percentual damage.</p>\r\nToughness \r\n<p> influences the unit armour.</p>\n<p> influence its additional movement each turn.</p>\r\nControl\r\n<p> reduces the enemy movement and the range of the attacked unit.</p>\n<p>influences the healing of the unit.</p>\n<p>You can use the wheels to change the distribution of these abilities and talents. </p>\n<p>Next, you decide on the movement. You move a unit with the amount of movement you got in the agility ability and the toughness talent of that unit.</p>\n<p>When both players have decided on their changes and movement, the game executes the movement decisions of both players.</p>\n<p>After the movement is executed, the unit with the highest initiative that has enemies in their range attacks. If a unit has multiple enemy units in range, its attacks are distributed between the targets in order of proximity. Then the next unit attacks all units in range until all units have been taken into account. If two units have the same initiative they attack simultaneously.\r\n</p>\n<p>When all attacks are executed the next turn begins.\r\n</p>\r\nTroubleshooting\r\n<p>If you have problems connecting or running the game try another browser.</p>\r\nJoin our Discord Server\r\n<p>Your friends are not online and you want to play? Join our discord server to find other people to play against. </p>", "metacritic": null, "released": "2022-10-23", "tba": false, "updated": "2022-10-24T07:25:14", "background_image": "https://media.rawg.io/media/screenshots/28b/28be05ed718ec959c81a5e2c68993608.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 171, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Morris", "Kawanka"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}