{"id": 87019, "slug": "crazy-animal-rampage-simulator-wild-horse-fury-rid", "name": "Crazy Animal Rampage Simulator: Wild Horse Fury Ride", "name_original": "Crazy Animal Rampage Simulator: Wild Horse Fury Ride", "description": "Who doesn’t love horses, yes everyone love horses. We have developed Crazy Animal Rampage Simulator : Wild Horse Fury Ride  for all those who loves horses &amp; animals.<br/>Saddle up your friend horse by downloading Crazy Animal Rampage Simulator : Wild Horse Fury Ride &amp; start your adventure of Horse Riding, Horse Jumping and horse racing as it’s time for some grand show of horse jumping and horse riding challenge.<br/><br/>This is new game i.e. Crazy Animal Rampage Simulator : Wild Horse Fury Ride which is fully PACKED with fun &amp; pleasure as game provides you a number of challenging obstacles as well. Crazy Animal Rampage Simulator : Wild Horse Fury Ride is awesome horse simulation free game where your horse friend has to smash the hurdles on the way, You must survive against these wild animals like lion, wolf in this simulation cum small action game and there is another amazing feature in this game that small kids playing in the ground can have horse ride as well as our horse love kids like all of us so it allow kids to ride on it, so all those kids who love horses can enjoy a free horse ride and can enjoy horse jump, horse ride and even can enjoy horse racing as we used a crazy but friend horse for kids.<br/>This game provides a number of challenging obstacles to cross so you have to time your horse jump accordingly to cross those hurdles. We are not sure how good you are in reaching high score. Let’s see how well you can do, and reach the high score. It is a chance for you to ride a horse and boost your horse riding skills.<br/>The game is new Horse simulation game; developed to simulate the effects when not every one of us can own a horse at home or in a farm house. So do care for your Crazy Horse friend by feeding it. Find the eatables in the terrain environment &amp; virtual Horse racing environment which the Crazy but friend Horse will feed on to boost its energy. Keep an eye on the energy bar as it goes down &amp; down &amp; you have to feed your Crazy Horse friend in time for survival before the Horse collapse &amp; finally dies. Crush the various obstacles on the way to increase score and earn points to unlock new Crazy Horse haven world of horses with all features as there are several Crazy Horse for you to unlock, earn points to unlock your favorite one. <br/>So “Download” now &amp; let My Crazy Horse adventure begin!<br/>Features:-<br/>HD Graphics<br/>Rampage the obstacles.<br/>Multiple Horses<br/>Smooth controls<br/>Realistic animations of Crazy Horse<br/>Excellent sounds.<br/>Silly Horse thrashing challenges<br/>100% Free game with all features<br/>Compatible with all new smartphones.<br/><br/>How to play:-<br/><br/>Tap on screen to jump.<br/>Joystick to run and move left / right.", "metacritic": null, "released": "2016-09-03", "tba": false, "updated": "2019-10-22T14:34:38", "background_image": "https://media.rawg.io/media/screenshots/5b3/5b33f6fdbed62d38e1a68eb2422e31a5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tahir Mahmood"], "genres": ["Adventure", "Simulation"], "publishers": ["Tahir Mahmood"], "esrb_rating": "Everyone 10+"}