{"id": 87020, "slug": "cats-of-the-forest", "name": "Cats of the Forest", "name_original": "Cats of the Forest", "description": "****Cats of the Forest****<br/><br/>Its finally here!  One of the most requested apps of all time.  Raise your very own Cat.  Its not like any ordinary cat game.  You can customize all the members of your family. There is magic, epic enemies and even a final battle.  We've included cut scenes to help see how the story unfolds.  You will not be disappointed.  <br/><br/>The story begins with your kitten.  You must help her find her way in the world.  Find some family members, mark some territory, and avoid the enemies.  Your Cat will build her skill by completing various quests. Along the way, you will develop your hunting skills. You will need to drink water and stay hydrated. Be sure to hunt and eat when your hunger level gets low.<br/><br/>This a long form game, with customizable family members, kitten training, and magical elements. The story is told through some short animated sequences.  Collect Treasure Chest, Gems, and Keys. This game is the fourth in our Epic Quest series.<br/><br/>Huge 3D Forest World<br/>-- Explore caves, waterfalls, forest, and rivers.<br/><br/>Animal Enemies\u2028<br/>-- Enemies include Wolves, Bears, Deer, Puma, Giant Spiders, Scorpion Warriors, Fire Cats, Eagles, and many more.<br/><br/>Customization\u2028<br/>-- The app allows you to customize you Deer Color, Markings, and even Call Sound.<br/><br/>Craft your Magic<br/>\u2028-- Find the Wizards, Collect the Magic Books, Potions, and Magic Items to Craft your magic spells.<br/><br/>Family Members\u2028<br/>-- Locate your family members and use them to team up against your enemies.<br/><br/>Epic Cut Scenes\u2028<br/>-- Follow along with the story with added cut scenes.<br/><br/>Treasure Elements\u2028<br/>-- Collect the keys, the gather the treasure chests, and gems to unlock new app features.<br/><br/>Epic Final Battle\u2028<br/>-- The ultimate final battle is difficult to win. You will need to use your magic and clan to win the battle.<br/><br/>Epic Quest is a series of games we created at Wild Foot. We've taken all your suggestions and tried to combine them into this game. 3D animal simulation at its best.<br/><br/>We love to hear from you. We listen to your feedback and always try to improve the quality of our games.  Be sure and stop by our Facebook page:\u2028https://www.facebook.com/wildfootgames for updates. \u2028Please email your suggestions. Our focus is making creative games with animals and magic. Animal simulators with something special added. Good luck and have a Wildfoot day!", "metacritic": null, "released": "2016-10-05", "tba": false, "updated": "2019-10-22T14:15:16", "background_image": "https://media.rawg.io/media/screenshots/82e/82e03ea8a9bd0c6b47222ea0deceb061_5V7Z6Iv.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Boris Tsarkov"], "genres": ["Adventure", "RPG"], "publishers": ["Boris Tsarkov"], "esrb_rating": "Everyone 10+"}