{"id": 870364, "slug": "skulk", "name": "Skulk", "name_original": "Skulk", "description": "<p>Skulk is set in a post-apocalyptic world, where blind, photosensitive, subterranean creatures appeared and hunted humanity. Most of the human population has been decimated, cities and towns lay silent and abandoned. By day, the world is an eerie ghost town, but once the sun sets, it turns into the hunting grounds for these creatures as they rise from their layers and nests.</p>\n<p>You've managed to survive thus far by what seems to be pure luck, and from notes you've found, you've pieced together rumours of a final safe haven for humanity, nicknamed 'The Light', a large sports stadium, that had all it's grounds flood lights, and structures internal lights converted to UV bulbs, making it a veritable fortress against the creatures. Your goal is to get into this stadium, but the only path in is through the ruined cities sewer systems, where the creatures lie in wait for their next meal.</p>\n<p>Will you make it to the light at the end of the tunnel, or will you die alone in the dark?</p>\n\n<p>This game was created for Themed Horror Game Jam #9 - Halloween Edition. Unfortunately, the file was to big to upload as a browser game, so it's download only. Also unfortunately, I got unexpectedly busy during the last week of the jam, so I had to cut content I hoped to include, and I couldn't get the game nearly as polished or balanced as I would have liked, but I hope you enjoy it all the same.</p>", "metacritic": null, "released": "2022-10-23", "tba": false, "updated": "2022-10-24T09:33:58", "background_image": "https://media.rawg.io/media/screenshots/e02/e02f5e0813c870b81a9c74f9ec9e78de.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 82, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AKS Games"], "genres": [], "publishers": [], "esrb_rating": null}