{"id": 87030, "slug": "jurassic-dino-hunting-3d-dinosaur-shooting-game", "name": "Jurassic Dino Hunting 3D: Dinosaur Shooting game", "name_original": "Jurassic Dino Hunting 3D: Dinosaur Shooting game", "description": "Jurassic Dino Hunting takes you to the new horizons of hunting wild and deadly dinosaurs in a complete natural, grand and dense forest environment of jungle for those who are good in hunting deadly animals in addition of good shooter as your mission impossible is to stay alive and strike as much as possible to keep playing this 3D shooting game. In this Jurassic Dinosaur hunting game encounter you are equipped with modern sniper shooting guns arsenal. Fighting the wild &amp; deadly Dinosaurs in a dense Jungle environment is fun so all those who are top shooter is ready to find and kill Dinosaurs with best sniper guns in an encounter of Dinosaurs who are ready for rampage. It’s really adventure game for hunting lovers to have fun in Dinosaurs hunting, since you are equipped with a variety of sniper shooting guns the game becomes thrilling as well as a challenging to play. Hunt the wild dinosaur to complete the target in an adventure Jungle environment to avoid clash of civilization as Dinosaurs wants to get in to city for ultimate rampage &amp; destruction so you are being a Super HERO soldier to kill dinosaurs before they start their destruction mission in city. In this Dinosaurs Hunting game, once you will shoot your first fire, wild Dinosaurs will react with full anger, run and rush to hunter / player to take revenge and you might get killed. In this game of war Dinosaurs hunter has to defend himself wisely and finally shoot the Dinosaur &amp; escape from being killed.<br/><br/>Kill the variety of dinosaurs in lush and dangerous Jurassic environment. With your shooting and hidden capability and stay alive in this mission impossible against fierce, flying and deadly predators.<br/><br/>The challenge has to be completed within limited given time. This Dino Hunting game contains multiple levels with increasing difficulty levels. On successful completion of existing level, player will land on next level with enhanced complexity and will get a new unlocked sniper gun. Then you will become best animal hunter of 2016.", "metacritic": null, "released": "2016-09-30", "tba": false, "updated": "2019-10-22T13:52:50", "background_image": "https://media.rawg.io/media/screenshots/ca3/ca3e8b79a63ed7b339b18f9b04642dbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tahir Mahmood"], "genres": ["Action", "Adventure"], "publishers": ["Tahir Mahmood"], "esrb_rating": "Mature"}