{"id": 870305, "slug": "undpwr", "name": "UNDPWR", "name_original": "UNDPWR", "description": "<p><strong>Unity networked deterministic physics with rollback.</strong><br/></p>\n<p>Version 0.0.2 *windows only*<br/></p>\n<p>This is a technical demo for a netcode framework using unity native deterministic physics with rollback. This is also meant as a real world smoke and scale test, to find out how many concurrent users will be able to connect to a single game, and for how long before things explode. <br/></p>\n<p>Deterministic physics can be used in  games to save bandwidth. This is because if all events are determined by previous events, then the game only needs to send information about the present state of the system to a new player. The player then only needs remote input to  predict the future state of the system. This, coupled with rollback netcode can provide responsive, low bandwidth gameplay experiences with as many physics bodies as clients can handle. <br/></p>\n<p><strong>Main Menu<br/></strong></p>\n<ul><li>\"client connect\" to connect to a server. Thats all that should be needed to connected to the default server. But there are options to start your own server.</li><li>\"server host\" will start a dedicated server</li><li>\"client host\" will start a host and client in the same session</li></ul>\n<p><strong>Controls</strong><br/></p>\n<p>movement : W,A,S,D or left analog stick</p>\n<p>grab/release (also fire) : left mouse, \"left ctrl\" or \"A\" gamepad button</p>\n<p>jump: right mouse, \"space\", or \"B' gamepad button<br/></p>\n<p>camera control: \"Q\"/\"E\", or hold \"left alt\" and move mouse</p>\n<p><strong>The Game</strong></p>\n<p>When a round starts players are assigned a team color. Before the timer runs out, collect the balls of your team color and get them into the collector, stop the other team from collecting theirs, or put the wrong color balls in their collector. Also, there's a golden ball! Team with the most points wins.<br/></p>\n<p>*There is a dedicated server *should* be running, but availability will depend on how many bugs are found. Ill try to update the status here.</p>\n<p>*Requires a \"decent\" machine, any desktop with a gpu should work, a laptop might struggle.<br/></p>", "metacritic": null, "released": "2022-10-23", "tba": false, "updated": "2022-10-24T09:14:59", "background_image": "https://media.rawg.io/media/screenshots/2cc/2ccdad00768fd8abae7589b2ec54ba9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 19, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RemoteControlFungus"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}