{"id": 870382, "slug": "monsterhearts-2-skins-minotaur-daphnaie", "name": "Monsterhearts 2 Skins: Minotaur & Daphnaie", "name_original": "Monsterhearts 2 Skins: Minotaur & Daphnaie", "description": "<p>Fan Skins for Monsterhearts 2, by Avery Alder (buriedwithoutceremony). Made with love and with some modern twists of these favorite mythological stories! Specifically with a focus on Volatile heavy Skins.</p>\r\nThe Minotaur \r\n\n<p><em>Generally, no one knows how to approach the Minotaur, so they don’t really go out of their way to greet them. Suffice it to say, the Minotaur can either be socially awkward or immensely self-aware of how intimidating they are. They may be ill-tempered and ferocious… but they may just be looking for nourishment in a number of different ways. </em></p>\n<p><em>If you get close enough, maybe you’ll get hurt. But maybe, just maybe, you’ll get a key to their Labyrinth.</em></p>\n<p>Play a stone-cold loner or boastful athlete with a safe haven where you can finally be yourself. Play with the themes of suppression, repression, and isolation within a young adult's identity, while also having the ability to kick absolute ass.<br/></p>\n<ol><li><em>The Labyrinth</em> is a clear reference to the original Greek myth, where the Minotaur is imprisoned in a maze-like labyrinth by King Minos.\r\n</li><li><em>Bull’s Beauty</em> refers to King Minos’ mistake when he prayed to Poseidon to bring him a bull so worthy he could sacrifice it to the sea god. </li><li><em>The King’s Executioner</em> is inspired by King Minos sending regular sacrifices to the Minotaur in the maze as a form of appeasement. </li><li><em>Starved</em> comes from the Minotaur no longer being nursed by King Minos’ wife, Pasiphae, as they didn’t know what else to feed the Minotaur. </li><li><em>The Seventh Circle of Hell</em> refers to the circle of Violence from Dante’s <em>Inferno</em>, where the Minotaur is damned to remain. \r\n</li><li><em>Bellow</em> is simply because of how terrifying the Minotaur was seen to be in mythology, even in Chinese and Japanese depictions of bull-headed demons.</li><li><em>The</em> <em>False Cow</em> is to add a twist of sympathy for this poor creature of fate.</li></ol>\r\nThe Daphnaie\r\n\n<p><em>Notable themes of the Apollo and Daphne myth are male entitlement, the objectification of women, and the scapegoating of women. Nothing about this myth’s outcome feels good for Daphne. She doesn’t get to become anything greater than a tree with leaves that never decay. Apollo holds her tree form, takes her leaves for himself, and immortalizes her in a way she did not ask for and in fact, couldn’t. </em></p>\n<p><em>With way more control over your own narrative, it’s time to take some revenge on the Apollos of the world</em></p>\n<p>Play a rightful avenger or a party girl who can literally outrun any of her problems. Play with themes of bodily autonomy, objectification, and metamorphosis. </p>\n<ol><li><em>Hear My Prayer</em> relates to Daphne pleading with her father to help her. Roll Dark to find an escape route before you have to ask anybody to turn you into a tree.\r\n</li><li><em>Predator Turned Prey </em>is a direct commentary on Apollo’s predatory lust towards Daphne. This time, take something from someone when they take it from you.\r\n</li><li><em>One of Gold, One of Lead</em> is a similar concept to <em>Predator Turned Prey</em>, but with some more multi-functionality.</li><li><em>Thin Bark</em> refers to Daphne’s metamorphosis. This time, you can choose voluntarily when you do and don’t want to be seen for a variety of reasons.\r\n</li><li><em>Swift Flight</em> refers to Ovid’s many instances depicting how fast Daphne was due to her determination. If having a Volatile 3 appeals to you characteristically, this is your move.\r\n</li><li><em>Sacred Perpetuity</em> refers to Daphne’s legacy of laurel trees and bay leaves. At least get something out of your name if it’s involuntary.\r\n</li></ol>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T09:40:55", "background_image": "https://media.rawg.io/media/screenshots/8e4/8e4193b636a728560ed18cedc5646617.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Josephine Kim"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}