{"id": 870408, "slug": "jb-hunter-adventure-beach-girls-erotica-bikini-nud", "name": "JB Hunter: Adventure / Beach, Girls, Erotica, Bikini, Nude, Prank, Anime, Nature, Stylized, Casual", "name_original": "JB Hunter: Adventure / Beach, Girls, Erotica, Bikini, Nude, Prank, Anime, Nature, Stylized, Casual", "description": "<p><strong>This game will immerse you in a wonderful stylized beach somewhere in the outskirts of the hot countries of our Planet.</strong><br/></p>\n<p>A pleasant anime atmosphere, light drinks, beautiful girls and yellow sand - that's what awaits our character, changing day and night!</p>\n<p><em>During the day you are left to your own devices, on a crowded beach with gorgeous girls.</em></p>\n<p><em>Foam parties await you at night.</em></p>\n<p>Your phone has a social network in which you maintain your blog dedicated to your adventures among beautiful girls. Subscribers to your blog will send tasks, the completion of which will increase your blog. </p>\n<p>Take pictures of girls and surroundings with your phone - just shoot of whatever you want, or specific places, maybe pretty girls! </p>\n<p>Post pictures on your blog and get new likes them... More good pictures - more blog activity!</p>\n<p><strong>Communicate with girls </strong>- talk to the girls and try to win them over by resorting to deception or try to tell them the real story about yourself. </p>\n<p><strong>But be careful</strong> - because you as a guy, are not a welcome guest on this beach, which it's only for girls!</p>\n<p>As you stay on the beach, and as visitors become dissatisfied with your stay, you run the risk of finding yourself in a situation where everyone will try to kick you out of this place. </p>\n<p>Lifeguards will come to the aid of beach girls, who will throw you out of this place without any caresses.</p>\n<p>If you are tired of shooting photos and communication, there are always got a mini games at your disposal that, you can immerse yourself in on this beach ... play the piano, control cars (remote control), draw on the board and so...</p>\n<p><strong>Good luck and good weather!<br/></strong><br/><strong><em>The game is under development. We need your support! Add the game to your wishlists, make reviews!</em><br/></strong><br/>https://store.steampowered.com/app/2094570</p>", "metacritic": null, "released": "2022-10-22", "tba": false, "updated": "2022-10-24T09:49:45", "background_image": "https://media.rawg.io/media/screenshots/bb3/bb36d9fc721d248899e9694333ce1b24.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atrio GAMES"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}