{"id": 870478, "slug": "to-the-center-nwdm-1-h", "name": "To the Center (NWDM 1-H)", "name_original": "To the Center (NWDM 1-H)", "description": "<p>To the Center is a short, replayable brawler made in 5 days where you fight incoming waves of magical squid enemies! Using three different and unique attacks, you can whack enemies to either destroy them or send them off the platforms before they overwhelm you.<br/><br/>Play alone or together with a friend and help Blobby get to the center unscathed!</p>\n<p>The main character \"Blobby\" has found three curious platforms which rise up from Blobby's world, all the way to the center of the universe. On the way there, a storm of hostile magical squids rain down upon Blobby and the supporting platforms. Blobby wants to reach the center to find out more about where the magical squids came from in the first place!<br/><br/>Defeat the squids and ascend to your destiny!<br/><br/>CONTROLS:<br/><br/>[Keyboard]:<br/>Walk left: A<br/>Walk right: D<br/>Jab: Left Click<br/>Fierce: Right Click<br/>DP: E<br/>Jump: Space<br/>Dash: Shift<br/><br/>[Gamepad]:<br/>Walk: Left analog stick<br/>Jab: Left Face Button (Square on PS4)<br/>Fierce: Top Face Button (Triangle on PS4)<br/>DP: Right Face Button (Circle on PS4)<br/>Jump: Bottom Face Button (X on PS4)<br/>Dash: Left Trigger (L2 on PS4)<br/><br/></p>\n<p>GAME MODES:<br/>- Singleplayer<br/>- Splitscreen</p>\n<p>(An update may come where both players share a single camera... Didn't know how to make it work.)<br/><br/><br/><br/>DIFFICULTIES:<br/><br/>- Normal:<br/>The default difficulty.<br/><br/>- Hard:<br/>Enemies deal more damage, have more health and Filliares spawn a bit more often.<br/><br/>- Very Hard:<br/>Enemies hit way harder, have way more health and Filliares are not all that rare.<br/><br/>- Good Luck:<br/>Enemies have no chill and Filliares are common place.<br/>Maybe play this with a friend if you cannot beat it alone!<br/><br/><br/><br/><br/><br/>KNOWN BUGS:<br/></p>\n<p>- The win screen may display some values incorrectly.<br/><br/>- The main menu may not detect controller input, so to press the main menu buttons, use a mouse or a pad on the controller to start the game.</p>", "metacritic": null, "released": "2022-10-22", "tba": false, "updated": "2022-10-24T10:12:04", "background_image": "https://media.rawg.io/media/screenshots/803/803f0973e0d955038d012fa814e8371a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NWDM 1-H"], "genres": ["Action", "Fighting"], "publishers": [], "esrb_rating": null}