{"id": 870401, "slug": "murloc-stranglethorn-fever-original", "name": "Murloc Stranglethorn Fever (Original)", "name_original": "Murloc Stranglethorn Fever (Original)", "description": "<p>IMPORTANT:</p>\n<p>MAKE SURE TO RIGHT CLICK THE WINDOW OF THE GAME AND CHECK IF LOCAL STORAGE SAVING PERMISSIONS ARE SET TO \"ALLOW\", OTHERWISE YOUR SAVES WILL VANISH AFTER YOU CLOSE THE GAME!</p>\n<p>This is the 1.2 version of Murloc Stranglethorn Fever (or simply Murloc RPG), the most complete version of the game (and probably final). With the death of Adobe Flash a lot of flash games have slowly been restored via custom software that emulates the flash player, with some doing a better job than others. This is a rare case where someone (me) ended up with an extremely old offline executable of a flash game that still works.</p>\n<p>This was on, what essentially was, my first ever computer. An awful, damaged, painfully slow tiny notebook laptop that hasn't seen a glimpse of the internet in several years. Still running Windows 7, with a damaged hard drive that takes several minutes to complete the simplest tasks, it was the home of this weird version of the Murloc RPG that I had downloaded and was able to play offline around 2014. Found it in an obscure online flash game website that no longer exists (the game still opens up a browser window once closed that tries connecting to the website, Shmehao.com it was called. Obviously this doesn't work and you end up with a generic domain window).</p>\n<p>The only quirk of this version is not being able to resize its window, so if you have a 1080p monitor the window will be pretty small (although I'd argue it's the optimal way of experiencing its crusty graphics), let alone 1440p monitors and above.</p>\n<p>I'm not sure if this can run on Linux or MacOS. Give it a try.</p>\n<p>Enjoy!<br/></p>", "metacritic": null, "released": "2022-10-23", "tba": false, "updated": "2022-10-24T09:46:46", "background_image": "https://media.rawg.io/media/screenshots/39e/39e8090ea0341e4cbeff5377666c5a8e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anecro"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}