{"id": 870554, "slug": "speed-dreams-open-source-motorsport-simulator", "name": "Speed Dreams Open Source Motorsport Simulator", "name_original": "Speed Dreams Open Source Motorsport Simulator", "description": "<p>Speed Dreams is a Motorsport Simulator featuring high-quality 3D graphics and an accurate physics engine, all targeting maximum realism. Initially forked from TORCS, it has now reached a clearly higher realism level in visual and physics simulation, thanks to its active development team and growing community. It mainly aims to implement exciting new features, cars, tracks and AI opponents to make a more enjoyable game for the player, while constantly pushing forward visual and physics realism. It is also intended for any research, study or teaching activity, around physics and AI, thanks to its GPL V2+ license, and the clear and modular architecture of its C/C++ code base.</p>\r\nLastest version (2.2.3):\r\n<p>It's been more than 2 years and 9 months since the last official version of Speed Dreams (2.2.2), and after a beta and a release candidate, we are pleased to announce that finally the new version 2.2.3 is now available for everybody. During this time, besides fixing a lot of bugs and making multiple optimisations on code, we have added the following new features to this project:\r\n</p>\n<ul><li><em>Grand Prix track, Sao Paulo, based on the José Carlos Pace circuit, or more commonly known as \"Interlagos\".</em>\n</li><li><em>\"Monoposto 1\" (MP1) category and car collection based on the 2005 Formula 1 single-seaters.</em>\n</li><li><em>\"1967 Grand Prix\" (67GP) category and cars collection , based on the 1967 Formula 1.</em>\n</li><li><em>New models in the Supercars category, the Deckard Conejo RR (based on the 2010 Chevrolet Camaro SS) and the Kanagawa Z35 (based on the Nissan 350z).</em>\n</li><li><em>Added support for tyre wear and degradation, currently only avaliable on Monoposto 1.</em>\n</li><li><em>New \"shadow\" AI robots in multiple categories. They are faster and risk braking later than other robots.</em>\n</li><li><em>Updated the code of AI robots \"dandroid\" and \"USR\".</em>\n</li><li><em>Real time weather can be configured on the tracks based on the current weather in the different locations (e.g. if it is raining in Sao Paulo at the current time, the game will check the real weather in that area and apply it in the game).</em>\n</li><li><em>\"Setups\" section in the garage menus to configure the different possible options in the mechanics of the cars.</em>\n</li><li><em>Packages in Flatpak and AppImage formats, to ease the installation of binaries between different GNU-Linux distributions.</em>\n</li><li><em>Installation via PPA in Ubuntu derived GNU-Linux distributions  thanks to the inclusion of Speed Dreams in Xtradeb.net.</em>\n</li></ul>\n<p>We hope you like all these new features. We have worked hard to make them so. Now all that's left is for you to enjoy Speed Dreams.<br/></p>\n<p><strong>You can also test the first beta of our next version, 2.3.0. You have more information about the changes in this link:<br/>https://www.speed-dreams.net/en/new-2-3-0-beta-1-release/<br/><br/>We leave the 2.3.0 Beta1 links here too</strong></p>", "metacritic": null, "released": "2022-10-22", "tba": false, "updated": "2022-10-24T10:36:18", "background_image": "https://media.rawg.io/media/screenshots/065/065e1e35f13a40011fab7935584f6565.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Speed Dreams Motorsport Simulator"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}