{"id": 87053, "slug": "airtycoon-online-3", "name": "AirTycoon Online 3", "name_original": "AirTycoon Online 3", "description": "Air Tycoon Online 3 - The world best online airline management simulation game. <br/>Compete with world-wide players and be the top airliner in the world.<br/><br/><br/>[Game Introduction]<br/><br/>AirTycoon Online which was much loved by worldwide management simulation game players has been fully upgraded into ATO3 with  great quality 3D graphics and upgraded UI.<br/><br/><br/><br/>[Game Features]<br/><br/>-Turn-based online airline management simulation game<br/>-Gorgeous 3D graphics<br/>-Realistic game background based on Historical real time<br/>-About 170 real airplane models released as time goes by<br/>-Manage an airline in 500 airports all over the world<br/>-Take over other players' companies<br/>-Detailed management report and report history.<br/>-Accident events due to the increment weather and some engine failures.<br/>-Airliner Alliance and Code-shares<br/>-Communication with worldwide players<br/><br/><br/>[Major Differences from Previous Versions]<br/><br/>Introduced Hub Concept<br/>- Headquarters is located in the city you selected when you started the game<br/>- When starting the route, the departure airport must be the airport of the city where the head office or branch office is located.<br/><br/>Name value by city<br/>- Increase name value through advertising investment by city<br/>- Establishment of branches when the name value is 50 or more<br/><br/>Etc<br/>- 2D / 3D map select option<br/>- Increase the number of slots<br/>- Introduction of in-flight service set<br/>- Up to 25 slot request at a time<br/><br/>Additional aircraft<br/>- B747SP, B707-320B, A319neo, A320neo, A321neo, B787-10, B737-10, E175-E2, E190-E2, E195-E2, Caravelle1, Caravelle10B, Caravelle12, DC-8-61F, DC-8-62F , DC-8-72F<br/><br/>[Useful game tips]<br/><br/>-Open a new route between the cities with high business/tour level while being less(or no) competitive.<br/>-Make all of your flight schedules as the same as 'Available Schedule by Planes' <br/>-Raise the fare when the occupancy is 100%<br/>-Down the fare when the occupancy is lower than 70%<br/>-Close your existing route resolutely and open another new route if the route is so competitive and you do not get enough profits from.<br/>-Set up a fuel tank to save your fuel expenses.<br/>-Build a maintenance depot and a VIP lounge at your hub city to maximize your profits.<br/>-Manage all of your flight routes strategically by using your unmatched business skills.<br/>-Provide your passengers unrivaled comfortability by adjusting your plane seats better and supplying a high quality of cabin service.<br/>-Take advantage of a 'Code Share' function on competition routes. <br/>-Generate stable revenue by purchasing or building your own airports.<br/><br/>Feel free contact us when you have any question, opinion or any help about our games<br/><br/> -Report to admin in the game<br/> -Email : support@tradegamelab.com", "metacritic": null, "released": "2017-12-21", "tba": false, "updated": "2019-07-30T14:08:58", "background_image": "https://media.rawg.io/media/screenshots/6e1/6e18034a1082056010afd8e100a7dcbe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 163, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["TRADEGAME Lab"], "genres": ["Strategy", "Simulation"], "publishers": ["TRADEGAME Lab"], "esrb_rating": null}