{"id": 870624, "slug": "holoboss", "name": "HoloBoss", "name_original": "HoloBoss", "description": "<p><strong>Welcome to HOLOBOSS!</strong>\n</p>\n<p>This is a completely free, unofficial fangame featuring the vtuber talents of Hololive, with gameplay will MAINLY FOCUS on the Story and Fun element.  <br/>All the Talent have , some how, been erease memory and put in their unique realm.  Your task is to help Oozora Subaru, a talent who overslept and escape the incident, get her friends out of their realm.</p>\n<p>Will you be able to defeat all the talent and get them out of their realm ?<br/><strong>(Use the right talent against specific talent to avoid battle and get them out peacefully)</strong></p>\n<p>Download now below!\r\n</p>\n\n\n\n<p><strong>AVAILABLE LANGUAGE OPTIONS</strong>:            \r\n</p>\n<p>-English</p>\n<p><strong>Video/Stream Content</strong>: Please feel free to record or stream this game however you'd like as an independent creator! \r\n</p>\n<p>However, you may not use this game for any direct business purposes for profit or purposes that conflict with Cover Corps' Derivative Works guidelines. \r\n</p>\n<p><strong>Disclaimers</strong>: We are not affiliated with Hololive or Cover Corp. in any way. This project was made while following all guidelines under the Hololive Derivative Works guidelines (https://en.hololive.tv/terms). There is no monetization in this game. All visual and music assets used in this game are originally made for this game specifically. All sound assets are bought and paid for with the license to use commercially and non-commercially. \r\n</p>\n<p><strong>CREDITS:</strong></p>\n<p>Plugin use for game: http://www.yanfly.moe/wiki/Main_Page.<br/>Character sprite: ミスッター<br/>Character sprite: https://twitter.com/tengnose1988<br/><br/></p>\r\nInstall instructions\r\n<p>Simply download the zip, unpack all the files in zip to a folder, and launch Game!\r\n</p>\n<p><strong>ANDROID INSTALL</strong></p><p>- Download the HoloBoss.rar<br/>- Extract the file<br/>- Download Joiplay app on CHplay<br/>- Find the Holoboss file and choose the game.exe<br/>- Run and enjoy the game</p>\r\nHow to update\r\n<p>1. Download the lasted game <br/>2. Right click on the Winrar, chose extract file and extract where you place previous version<br/>3. Choose Replace All ( The previous version Data will not be lost)<br/>4. Lauch and enjoy the game</p>\n\n\n\r\nLET MAKE THE GAME TOGHETHER\r\n<p>This game will MAINLY FOCUS on the story and fun element.<br/>You can create your own story, you can help me create story for others talent, and you can send it to me:</p>\n<p> - Twitter: https://twitter.com/HSM_PixelArt\r\n</p>\n<p> - Itch.io: HSM_PixelArt\r\n </p>\n<p> - Facebook: https://www.facebook.com/profile.php?id=100086767279361</p>\n<p>If your story is good or really good. I will contact you.<br/>And together, we can make your story Playable.  <br/>All the credit about the story is your.<br/>(NO MATURE, 18+ story. But dark story is okay &lt;(\") )<br/>(The story gonna be Side story or Event Story)<br/>Let make this game a \"community's game\".</p>", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-10-24T11:01:24", "background_image": "https://media.rawg.io/media/screenshots/692/692a7115e85755742476a25eef71f9c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HSM_PixelArt"], "genres": ["Adventure", "Strategy"], "publishers": [], "esrb_rating": null}