{"id": 8707, "slug": "sand-slides-falling-sand-game-draw-doodles-to-beat", "name": "Sand Slides - Falling Sand Game. Draw Doodle's to Beat the Sandman in this Addicting Zen Sandbox Puzzle Game", "name_original": "Sand Slides - Falling Sand Game. Draw Doodle's to Beat the Sandman in this Addicting Zen Sandbox Puzzle Game", "description": "Free for a limited time<br/><br/>Rating 8/10 - &amp;quot;We all know sand can be quick, but your mind shall surely be quicker.&amp;quot; - theiphoneappreview.com<br/><br/>&amp;quot;Overall, the experience is thrilling, and the game is addictive.&amp;quot; - theapplegoogle.com<br/><br/>&amp;quot;The addictive nature and smooth play of this game are features even some of the best dressed apps forget about.&amp;quot; - JoeTech.com<br/><br/>&amp;quot;All in all this game offers great graphics, very nice controls and sweet gameplay!&amp;quot; - iViewApps.com<br/><br/>&amp;quot;Sand Slides is really a nice entertainer on my phone to play for a long time.&amp;quot; - WhatsMyApp.com<br/><br/>&amp;quot;You won’t want to stop playing and even while writing this review my iPhone is on the desk with Sand Slides open.&amp;quot; - iPhoneGlance.com<br/><br/>&amp;quot;Sand slides is much more addicting and fun to play than we can explain in a short review. This is an app which is made for any age group, kids will love it, youngsters will enjoy and parents love flicking out their iPhone to play this in their free time.&amp;quot; - iPhoneFootPrint.com<br/><br/>&amp;quot;Sand Slides can be played by anyone, at anytime!&amp;quot; - allofmybasearebelongtoyou<br/><br/>&amp;quot;A Hidden gem&amp;quot; - &amp;quot;This game is great, it&amp;#39;s good as a quick time killer when you have 5mins, graphics are good there are several levels to keep you challenged, if you are a quick thinker with a good thought process who likes a challenge then get this game.. Brilliant well done would love to see more games like this.&amp;quot; - Review by User &amp;quot;Glazgow&amp;quot;<br/><br/>* Over 4 million downloads!<br/>* No. 1 FREE game in Great Britain, France, Italy, Germany, Spain, Japan, Hong Kong and Canada<br/>* Top 50 FREE game in the USA<br/>* Also No.1 FREE game in Austria, Belgium, Croatia, Finland, Germany, Kuwait, Latvia, Macau, Malaysia, Poland, Poryugal, Saudi Arabia, Singapore, Switzerland, Taiwan, Thailand, Turkey, UAE<br/><br/>Guide the sand into the right coloured chutes, by drawing slide and buckets with your finger, but watch out!  You will need to pick up the pace in order to keep on top of the action.<br/><br/>With simple game play rules, Sand Slides is a very unique game that is simple to pick up but will take some time to master.<br/><br/>Featuring:<br/>76 Game Center Achievements<br/>Fantastic Music<br/>Great Visual Effects<br/>Infinite Particles!<br/>Unique Game Play<br/>Butterly Smooth Frame Rates<br/>HD iPad Graphics<br/><br/>Sand Slides brings a refreshing new game play experience that is like no other!<br/><br/>Visit the website for a youtube video showing the game in action!<br/><br/>http://www.sandslides.com<br/><br/>Or simply search for Sand Slides on YouTube for videos of the game.", "metacritic": null, "released": "2010-09-29", "tba": false, "updated": "2019-10-22T14:30:03", "background_image": "https://media.rawg.io/media/screenshots/d16/d16eb41089fa5148cf166bdd6d9e728e.jpeg", "website": "http://sandslides.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 119, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Logik State"], "genres": ["Arcade", "Puzzle"], "publishers": [], "esrb_rating": "Everyone 10+"}