{"id": 870761, "slug": "birthdaygame", "name": "BirthdayGame", "name_original": "BirthdayGame", "description": "<p> ! Please play  full screen!<br/>This game is a birthday gift that I've made for my friend. It contains different levels that in different style and belong to different genre. I hope you like it. I enjoyed every seconds in this development process, dont forget have some enjoy, too!<br/><br/>Here are my code</p>\n<p>and here is the answer to \" how to play?\"<br/>First of all, this game based on true stories. I mean, these things are realities of our own life :)<br/>Lvl1:You try to get your home by trying to avoid all of these manholes on the road. If you step on the manhole, your health decreases. Because we always have exposing to that things by motorcycle and we drop our part of body off there :)<br/>You should use A-D or left-right arrow on Keyboard<br/><br/>Lvl2:  Mert loves skateboarding and hates taxis. He also consumes plenty of youtube videos every single day. In this part of the game, you are skateboarding, try to not get caught by taxis and at the same time you collect youtube logos as much as you can! <br/>You should use A-D or left-right arrow to move; and space to jump and up arrow to switch the camera <br/><br/>Lvl3: This level aims at Mert, directly. Because we have to click on the food that he loves, and not click that he doesn't like. If we do that, we fail. We also fail if we can't click on loving foods, and we fail again if we let them drop out off the screen.<br/>You should use just mouse click for this.<br/><br/>Lvl4: We adore the cats!! We always try to feed  them and keep them safe. In this part, we try to feed the cats and if we feed 30 of them, we win!! <br/>You should use left click on mouse to drag the player, and right click to feed the cats.<br/>Tip: In this game, 30 is the holy score. You gotta get 30 points in every level<br/><br/>Lvl5: It's a classical merge but the amator version. You try to merge  all size of toilet papers with each other. And you get the golden toilet paper! In turkey, toilet paper is valuable more than any time. But, please try to keep those toilet papers closer as much as possible. Cause like I said, it's an amator version :)<br/>You should use mouse click to merge items.</p><p>Lvl6: There is a hidden gift box and you try to find it by walking around. This is a kinda fps game, so you should use your mouse to look around  and WASD or arrow keys to move.<br/></p><p>Good luck! <br/></p>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T11:44:12", "background_image": "https://media.rawg.io/media/screenshots/36c/36c4ba518de99f508ef690b6fd2e1f42.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["MeyraG"], "genres": [], "publishers": [], "esrb_rating": null}