{"id": 87080, "slug": "rescue-fire-truck-simulator-game-911-firefighter", "name": "Rescue Fire Truck Simulator Game: 911 Firefighter", "name_original": "Rescue Fire Truck Simulator Game: 911 Firefighter", "description": "Don’t miss your chance to become a legendary firefighter. It’s a duty call in emergency situation. Citizens are trapped inside buildings and situation is alarming. Here’s your chance to show bravery as a fire extinguisher &amp; ultimate rescuer. Play role of fire truck driver to put out bigger fire flames from emergency place. Become emergency rescue driver and work in fire brigade station to save innocent citizens. Race through the burning buildings, extinguish flames and use right tools to clear the way. Go on fire rescue missions of extreme emergency locations like multi storey parking plaza, kids school or city hospital. Get your fire truck refueled on your way from gas station. Reach car accident spots and save lives in critical situations. Turn on fire siren and drive your truck to become smoke extinguisher in one of the best firefighting simulator 2k16. Fireman job is dangerous because monster truck driving is not easy. Be careful &amp; don't get caught by burning fire flames. Grab fire hose and make your way to emergency in a fire engine! <br/><br/>Features:<br/>Thrilling fire rescue missions in emergency situations<br/>Firetruck with water hose to clear fire and smoke<br/>Subsist on multiple extreme scenarios: each with its 3D effects<br/>Modern firefighting equipment in realistic gameplay<br/>Smooth controls for seamless driving simulator<br/>Realistic smoke and fire-hose for water supply<br/>Amazing sound effects to enhance your gaming experience<br/><br/>Give us your feedback in the reviews section and help us improve our games in future releases.", "metacritic": null, "released": "2017-01-04", "tba": false, "updated": "2019-10-22T14:37:37", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee36317dbf750a2a577b651e27b821c0_bsCS6HC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Adventure", "Simulation"], "publishers": ["Techving"], "esrb_rating": "Everyone 10+"}