{"id": 870866, "slug": "noodle-box", "name": "Noodle Box!", "name_original": "Noodle Box!", "description": "I didn't have time to implement the crappy tutorial in-game, so here it is in Itch:\n<p>Note: This is my first time trying to make a PSP game, and I only had a PSPgo on hand. It works on that, but idk if it'll work on any other models.</p>\n\n<p>This is a Puzzle (almost-)game that plays like a mix between Snake and Tetris.</p>\n<p>Here's some back story that I didn't have time to put in the actual game:</p>\n<p>    THe manager of a large warehouse got yelled at by his boss because the business's</p>\n<p>    costs are too high, and he's been ordered to reduce costs or be fired!</p>\n<p>    </p>\n<p>    Desperate (and broke), he asks his chief engineer to come up with a creative solution.</p>\n<p>    To save money, the engineer gets the idea to leverage automation by building robots!</p>\n<p>    Since he couldn't afford to buy new electronics, he had to improvise by dismantling an</p>\n<p>    old game console he had lying around.</p>\n<p>    He managed to build a robot worm that can magically generate packing materials. This</p>\n<p>    saves time and money! Unfortunately, since it was based on an old game console, there</p>\n<p>    is a weird glitch where, if an entire row of material is lined up, it will mysteriously</p>\n<p>    vanish (like Tetris!)</p>\n<p>    This damages the goods, but it does allow more efficient packing and lower costs.</p>\n<p>    ...so maybe it's not a glitch after all, but a feature!?</p>\n<p>also, the worm accidentally Tetris'd everyone's eardrums, so there's no audio :(</p>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T12:18:12", "background_image": "https://media.rawg.io/media/screenshots/172/172fbea30718ce6b294566f838b7f4b9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alex"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}