{"id": 870951, "slug": "haunting-at-rosecliff", "name": "Haunting at Rosecliff", "name_original": "Haunting at Rosecliff", "description": "Haunting at Rosecliff\r\n<p>Move with arrow keys, WASD or d-pad. Attack with Space, Enter or A-Button. Chests and doors are opened by moving into them. <br/></p>\n<p>The Rosecliff Mansion has stood empty for years. You are a hero who decided to face  the monsters within and banish the demon. HaR is a top-down action dungeon crawler with grid-based movement.<br/></p>\n<p>This project was resurrected for the Revival Jam 2. <br/>The original game was a small \"test\"-style passtime where the grid based movement was done only implicitly and was therefore really subsceptible to have units get pushed off the grid, have multiple Units end up in the same space  etc. It was never intended to be much. I worked on it for a few evenings about half a year ago. <br/></p>\n<p>It had</p>\n<ul><li>tilemaps for walls, furniture, floor etc.</li><li>working doors </li><li>oszillating spikes </li><li>a sword to pick up and use</li><li> player and enemy hitboxes </li><li>a single level</li><li>There was one enemy, but they couldn't move. </li><li>an ugly HUD</li></ul>\n<p>I had to replace or completely rewrite basically everything. <br/>I added <br/></p>\n<ul><li>levels (in total 4 + boss room)</li><li> sound, animations, feedback, postprocessing etc</li><li>enemies, attacks, indicators</li><li>a small boss fight</li><li>the axe (in total 2 weapons)</li><li>menu stuff</li></ul>\n<p>When I started the original project the Demonic Dungeon Asset Pack didn't have animations yet. I decided to stick with the original for the jam. <br/>The grid is based on this GDQuest Tutorial  that I used a few weeks ago in a different small project. <br/>The name \"Rosecliff\" was just one of the first results when I googled for mansion names. I think it's a real one (and i guess there's a book). They are unrelated to the game.<br/><br/></p>\n<p>Thanks for checking out the game. I hope you enjoy it. Not sure about the future of this project. I like it and think it deserves a few extra levels, weapons, enemies etc.  If you like it let me know. I appreciate feedback and comments :)<br/></p>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T12:45:26", "background_image": "https://media.rawg.io/media/screenshots/8f4/8f4cdad361714fb997e4659631125da4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["nonsense90"], "genres": ["Action"], "publishers": [], "esrb_rating": null}