{"id": 870915, "slug": "ropin-thieves", "name": "Ropin' Thieves", "name_original": "Ropin' Thieves", "description": "English\r\n<p>This game was made during a game jam held at <strong>LUDUS Académie</strong> in the beginning of October 2022 to start the school year 2022-2023, with the theme \"Sur le fil\" (or \"On the string\"). The purpose of this jam was to teach new students the basics of game development and also get them to have a first game jam experience right at the start of the year.</p>\n<p><em>Ropin' Thieves</em> is a local multiplayer puzzle platformer game where you move from walls to walls on ropes launched with the help of grappling hooks. Each room is filled with puzzles and traps forcing you to cooperate in order to move forward. Moreover, each of you will get a special grappling hook with different properties while progressing through the castle.</p>\n\n<p>\n</p>\r\nFrançais\r\n\n<p>Ce jeu a été réalisé au cours de la jam de début d'année 2022/2023 à <strong>LUDUS Académie</strong>, qui avait à la fois pour but d'apprendre les bases du développement de jeu aux nouveaux étudiants de l'école ainsi que de leur permettre d'avoir une première expérience de jam dès le début de l'année.</p>\n<p>La jam avait pour thème \"Sur Le Fil\", thème que nous avons interprêté de manière littérale en créant ce jeu de puzzle multijoueur où les joueurs se déplacent sur des fils qu'ils lancent de murs en murs à l'aide de grappins. Chaque salle regorge d'énigmes et de pièges poussant les joueurs à coopérer s'ils veulent progresser. De plus, chaque joueur obtiendra au cours de sa progression un grappin spécial avec des propriétés différentes.</p>\n\n\n\r\nCredits\r\n<ul><li><strong>Game Design: </strong>William DURINGER, Gaetan PIOU, Hugo SIMON</li><li><strong>Programming: </strong>William DURINGER, Gaetan PIOU, Hugo SIMON</li><li><strong>Music: </strong>Gaetan PIOU (inspired by <em>Xion Leak </em>by MrBaba and Weact)</li><li><strong>Level Design:</strong> Gaetan PIOU</li><li><strong>Voice:</strong> Gaetan PIOU</li><li><strong>Art:</strong> Hugo SIMON<ul><li>Humble Fonts Free - sompx</li><li>Prototype Hero Demo - Sven</li><li>Kings and Pigs - Pixel Frog</li><li>Gold Coins - Yuval winter</li><li>Gamepad UI - greatdocbrown</li></ul></li></ul>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T12:32:53", "background_image": "https://media.rawg.io/media/screenshots/1f8/1f88b0f3b73e3dcc5387da4d0bc27839.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Gaëtan Piou", "Hugo.SIMON", "William Duringer"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}