{"id": 871009, "slug": "glitchy-psp", "name": "Glitchy PSP", "name_original": "Glitchy PSP", "description": "<p><strong>Description:</strong> this is a basic 2D platformer game made for the RE:Start! 2022 PSP Game Jam according to the theme \"It's not a glitch, it's a feature!\" and developed within 2 weeks (talking about the first public version).</p>\n<p>In this game the player needs to help a little guy called \"Glitchy\", who is stuck in an old unfinished project, to know who is it, why is in that project and how to get out of there. The story begins when the player founds the project in its computer, cause it got an early version a couple of years ago, but the player didn't remember even when was installed. Then Glitchy notice that its project were executed and tell its story to the player...</p>\n\n<p><strong>Features:</strong> the main character of the game its a little buggy, so he have like specials modes/powers that will be really useful to pass all over the levels of this unfinished project. It can activate a <strong>debug </strong>mode that makes the time slower and also can see a couple of blocks that are platforms or other stuff, by the way, exists the <strong>glitch</strong> mode, that allows Glitchy to pass over glitched blocks and even beat enemies by a different way like the usual.</p>\n<p>Also there are some items that aren't worked as intended.</p>\n<p><strong>(Please finish correctly the tutorial to learn all about the game's mechanics).</strong><br/></p>\n\n<p><strong>Controls:</strong> </p>\n<ul><li>D-Pad: movement.</li><li>X button: jump (confirm action).</li><li>Circle button: activates glitch mode (back action).</li><li>Triangle button: activates debug mode.</li></ul>\n\n<p><strong>Credits: </strong>in game.<br/></p><p><strong>Source code: </strong>https://github.com/luigi2498/Glitchy-PSP<br/></p>", "metacritic": null, "released": "2022-10-21", "tba": false, "updated": "2022-10-24T13:10:33", "background_image": "https://media.rawg.io/media/screenshots/07c/07c04c33462c491fac422f423521e755.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["luigi2498"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}