{"id": 871092, "slug": "dragons-lair-itch", "name": "Dragon's Lair (itch)", "name_original": "Dragon's Lair (itch)", "description": "<p><em>Dragon's Lair</em> is a cosy slice of life visual novel made in the Ren'Py engine surrounding a colourful cast of newfound friends as they attend university in Melbourne, play D&amp;D together at The Dragon's Lair cafe and go about their daily lives. Emphasis is placed on casual conversation, forming close bonds with others and the concept of finding joy in even the smallest of things.<br/></p>\n<p>I really wanted to make something slow-paced and calming, focussing on relationships and relationship-building and conveying the mundane yet soothing nature of everyday life. I also wanted the player and characters to be able feel a sense of belonging in a group of likeminded people and be able to grow and change as people throughout the narrative as they learn about themselves and overcome (or learn to accept) hurdles in their lives.</p>\n<p>This is currently a demo of what I imagine the full visual novel would be, which spans over one in-game week and allows the player to meet all of the main characters and get a feel for the vibe and tone of it. It was made as a solo project for my final uni assignment in 2022 (I did everything myself aside from the music) over four weeks instead of the full semester (thirteen weeks) due to unforeseen circumstances regarding my initial group and also my physical health. This means that, unfortunately, I was not able to get it done to the standard that I would usually do things at, however I was able to get a lot of the core elements done over these couple of weeks. I've really enjoyed learning how to use Ren'Py, as this is the first visual novel I've made.</p>\n<p>I'm also planning to work on the full version sometime in the future using this as a foundation, so look out for that!</p>\n<p>---</p>\n<p>Music asset credits can be found in the readme file.</p>", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-10-24T13:41:18", "background_image": "https://media.rawg.io/media/screenshots/031/031495221f4197614098f6ca13651a8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sadie"], "genres": [], "publishers": [], "esrb_rating": null}