{"id": 8711, "slug": "contract-killer-sniper", "name": "Contract Killer: Sniper", "name_original": "Contract Killer: Sniper", "description": "You are a master assassin, hired to infiltrate secure locations and eliminate high-profile targets. Perform lethal strikes and follow your only rule: Honor The Contract.<br/><br/>A new threat as appeared! Cyborgs and Mechanized Combat Units are invading cities around the world. Behind this nefarious act is a secret military organization which have been kidnapping scientists for use in developing their once-secret nanocrystal technology, which is at the heart of their cybernetic augmentation project. You have been hired to push back this invasion, at all costs!<br/><br/>Face enemies with new powers and deadly tactics in this exciting new campaign!<br/><br/>NOTE: The iPod Touch 4th Gen is not supported.<br/><br/>CHOOSE YOUR CONTRACTS<br/>Eliminate a mob of enemies, destroy entire bases or take out the single target that matters most. The next objective is up to you.<br/><br/>STAKE OUT &amp; TAKE DOWN<br/>Includes over 250 missions and campaigns for you to take on. Stake out targets from long-range, take them down with well-placed shots, assault enemy bases head on or infiltrate enemy lines without compromising your identity.<br/><br/>ADVANCED CUSTOMIZABLE WEAPONRY<br/>Upgrade your weapons and base defenses to protect your stash. Load up on sniper rifles, assault rifles, heavy guns, tesla guns, rocket launchers, throwing knives, med kits, armor, and more.<br/><br/>BATTLE FOR PvP SUPREMACY<br/>Assault other players’ bases, steal their resources, and become the undisputed champion of PvP.<br/><br/>MASTER YOUR ENVIRONMENT<br/>Choose your path through each mission and use cover to your advantage. Disable sentry guns, detonate explosive objects and avoid incoming fire.<br/><br/>TRAVEL THE WORLD<br/>Move unseen from one location to the next and take on the newest contracts.  It’s up to you to become the ultimate global assassin.<br/><br/>CONQUER THE ELITE CAMPAIGN<br/>Fight back the Cyborg Invasion! Destroy opposing Mechanized Combat Units and devastating bosses! Collect Nanomaterials to evolve your offensive and defensive game. Reign supreme using advanced abilities, devastating weaponry, powerful Mechanized Defensive Units, and more.<br/><br/>Auto-renewable subscription information:<br/>Contract Killer: Sniper now includes subscriptions. There are currently two types of subscriptions available, Platinum &amp; Gold. These are available in a variety of prices and durations:<br/>Gold: 1.99USD / week (or local equivalent) ; $4.99USD / month (or local equivalent) ; $13.49USD / 3 months (or local equivalent) ; $23.99USD / 6 months (or local equivalent)<br/>Platinum: 4.99USD / week (or local equivalent) ; 14.99USD / month (or local equivalent) ; 40.99USD / 3 months (or local equivalent) ; 69.99USD / 6 months (or local equivalent)<br/><br/>Subscriptions are available via in app purchase. Subscriptions will automatically renew at the end of the subscription period. Payment will be charged to your iTunes account within 24-hours prior to the end of the current period. You can turn off auto-renew at any time from your iTunes Account Settings. No cancellation of your subscription is allowed during the active applicable subscription period<br/><br/>Here are the links to our privacy policy and terms of use:<br/>Privacy Policy: http://www.glu.com/privacy<br/>Terms of use: http://www.glu.com/terms<br/><br/>PLEASE NOTE:<br/>- This game is free to play, but you can choose to pay real money for some extra items, which will charge your iTunes account. You can disable in-app purchasing by adjusting your device settings.<br/>- This game is not intended for children.<br/>- Please buy carefully.<br/>- Advertising appears in this game.<br/>- This game may permit users to interact with one another (e.g., chat rooms, player to player chat, messaging) depending on the availability of these features. Linking to social networking sites are not intended for persons in violation of the applicable rules of such social networking sites.<br/>- A network connection is required to play.<br/>- For information about how Glu collects and uses your data, please read our privacy policy at: www.Glu.com/privacy", "metacritic": null, "released": "2014-11-05", "tba": false, "updated": "2019-07-29T07:58:45", "background_image": "https://media.rawg.io/media/screenshots/965/9656475c67b674e792b224dea4e3e6ae.jpg", "website": "http://www.glu.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Glu", "Glu Games"], "genres": ["Action", "Adventure"], "publishers": ["Glu Games"], "esrb_rating": "Mature"}