{"id": 871192, "slug": "last-gang-standing", "name": "Last Gang Standing", "name_original": "Last Gang Standing", "description": "Last Gang Standing is an open ended team based shooter about building a massive base and demolishing all the other gangs that seek to do the same, before they get you first!<h3>Gang up</h3>Create a fully customizable gang with colors, shoulder patches and even a flag.  Recruit all your friends and mercenaries and get ready for some gang wars 2078 style!<h3>Build up</h3>Set down roots and create a heavily fortified base out of dozens of structure types.  Build walls, doors, foxholes, defensive turrets, gun factories, teleporters, radar towers, resource refiners, power generators, drone landing pads &amp; many more.  <br/>Design the impenetrable fortress of your dreams!<h3>Tear down</h3>You have a gang and a base, that means you now have something worth stealing!<br/><br/>Other gangs will be coming to take what's yours...unless you strike first!<br/><br/>Choose from a deep array of weapons, equipment and armor to build your perfect raiding strategy to take on the other gangs.  Leap over their walls with jump pads, drop teleport anchors inside their base to overwhelm them with numbers, drop a breaching charge and force them to come out and fight you to defuse it, sneakily cut through their walls with blowtorches or just use the tried-and-true method of blasting a giant hole through their base with missiles and grenades.  Your strategy is only limited by your imagination!", "metacritic": null, "released": "2022-10-24", "tba": false, "updated": "2022-10-28T03:22:37", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bf9d6228484a5c89e113d0e1dc6919c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tailfin Games"], "genres": ["Action", "Indie"], "publishers": ["Tailfin Games"], "esrb_rating": null}