{"id": 871164, "slug": "gold-of-lotusland", "name": "Gold Of Lotusland", "name_original": "Gold Of Lotusland", "description": "In the story interactive game Gold Of Lotusland you play as the protagonist Daniel Quinn - Lead Engineer for Anicorp Technologies as he uncovers the dark truth about the robots he designed known as \"Animatrons\". The story begins with Daniel and his co-engineer Phillip Shaw being given the news that a citizen worker of the utopian city of Altercrest has potentially been murdered by none other then one of robots that Daniel invented. With this being the first recorded death in Altercrest in over 35 years the corporate higher ups of Anicorp believe it could send the city on a downward spiral of chaos if it is known the Animatrons are capable of murdering citizens.  They give Daniel and Phillip the task of performing damage control for the company and to cover up any proof of the Animatrons wrong doing but what Daniel discovers along the way could change everything he knows about the world around him.<h3>key Features:</h3><br/><ul><li>Interactive Choice System </li></ul>The gameplay in Gold Of Lotusland is a decision driven selection mechanic which enforces a consistent cinematic experience and shapes the series of events throughout the story. You decide what the protagonist says and does as he makes his way through the captivating cinematically visual experience.  <br/><br/><ul><li>Timer Based Instances </li></ul>The timer function in Gold Of Lotusland helps the game retain a consistent viewing experience, if a decision is not made at any given point the game will refer to a default and the experience will continue with or without user interaction.<br/><br/><ul><li>Alternate Paths </li></ul>Throughout gameplay you will be given opportunities to change the given linear order of the series events that ensue throughout the story offering replay value to the player.", "metacritic": null, "released": "2022-10-25", "tba": false, "updated": "2022-10-28T02:47:19", "background_image": "https://media.rawg.io/media/screenshots/0b9/0b90682aeef37744d912ed5d1a1da61d.jpg", "website": "https://goldoflotusland.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 383, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["McCauley Christian", "Kyle Freels"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Sunken Eyes Games"], "esrb_rating": null}