{"id": 87112, "slug": "xtreme-demolition-derby-racing-car-crash-simulator", "name": "Xtreme Demolition Derby Racing Car Crash Simulator", "name_original": "Xtreme Demolition Derby Racing Car Crash Simulator", "description": "Buckle up for extreme mayhem and adrenaline-filled racing inside traditional demolition derby arenas. Roll into whirlpool demolition car culture and start xtreme racing. Leave gravity in dust and evade relentless force to crash &amp; smash opponent cars. Drive monster jack and crash enemy vehicles to be the last racer standing in car war zone.<br/><br/>Launch yourself between chaos among destruction rivals, hit the gas pedal to increase auto speed and hold on tight, you’re in for the ride of your life. Smell petrol fumes in survival arena and enjoy vehicular combat crash racing. Destroy opponents in demolition derbies and full track speedway racers that will offer you the thrill of a lifetime. Rules of demolition derby consists of muscle car drivers competing by deliberately ramming their monster vehicles into one another. Hit, thrash and knockout the rivalry to become last derby driver in epic multiplayer battle arena. Choose from range of derby cars or monster trucks and drive to smash and thrash in knockout racing war. Ride bumper cars on dirt tracks and win through strengthen your endurance race. Hit through crazy car wreckage mode to crash opponents and survive to be the last car standing after racing carnage. Choose among 3 thrilling death race modes along with real flying car combat. Ride on spectacular frozen tracks and sand arenas across the countryside for endless destruction driving mania.<br/><br/>Key Features:<br/>More than 20 intriguing missions in multiple battle arenas<br/>Unlock derby cars and monster trucks<br/>Racing modes: Sand Storm Arena, Frozen Peak Arena &amp; Survival Pit<br/>Detailed car models with real time physics<br/>Immersive sound effects and smooth controls<br/>High speed race &amp; realtime car death racing<br/><br/>Enjoy the unique gameplay and give your feedback to help us improve our games in future releases.", "metacritic": null, "released": "2017-03-22", "tba": false, "updated": "2019-10-22T14:08:34", "background_image": "https://media.rawg.io/media/screenshots/2d4/2d40f811682c8377789ecb1878e46dfe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 160, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Action", "Racing"], "publishers": ["Techving"], "esrb_rating": "Everyone 10+"}