{"id": 871231, "slug": "artifacts-of-eyru", "name": "Artifacts of Eyru", "name_original": "Artifacts of Eyru", "description": "<strong>Artifacts of Eyru</strong> is a sci-fi, dungeon diving, first person rogue-lite. Each run is unique, from the weapons and artifacts you find, to the bosses you face, to how you decide to level up. Each of the 4 classes have 3 talent trees that allow you to choose the way you play each run.<h3>Unravel the Mysteries of Eyru</h3>Battle through 6 distinct dungeons as you attempt to understand what the mysterious Cult of Nuada is up to. All upgrades and unlocks are shared between classes, so play them all to experience the full story!<h3>Claim Powerful Artifacts</h3>Mysterious Artifacts litter the dungeons of Eyru. Each floor has at least one to find that can drastically alter your gameplay. From simple damage upgrades, to double jumps, to making your gun into a bubble blaster, these artifacts will ensure that no two runs feel the same.<br/><br/><h3>Unlock Permanent Upgrades</h3>Take your place as a Mistwalker and build up your power between runs. With the help of the locals, you can unlock an array powerful permanent abilities and weapon upgrades.<h3>Ramp up the Difficulty</h3>Take on over 100 customizable Challenge Modes and unlock ways to customize the appearance of each class and their abilities.<h3>Experiment with Different Specializations</h3>Trying out different talents every run is encouraged! As the <strong>Warlock</strong>, you can summon an army of demons, command the souls of your defeated enemies, or unleash a torrent of eldritch tentacles. The <strong>Tinker</strong> can construct an arsenal of gadgets, perfect the art of assassination, or just keep chucking grenades. With the <strong>Wizard</strong>, you can conduct experiments in unstable plasma explosions, deadly gravitational forces, or turning enemies into quantum rats. If you like things more straightforward, the <strong>Pirate</strong> can smack things harder, redirect enemy attacks, or steal even more loot!<br/><br/>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T04:10:16", "background_image": "https://media.rawg.io/media/screenshots/aa0/aa0e8b844982cdd3a43cbc5bfae1a84e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 293, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Trapped Studios"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Trapped Studios"], "esrb_rating": null}