{"id": 871245, "slug": "sandwalkers-the-fourteenth-caravan", "name": "Sandwalkers: The Fourteenth Caravan", "name_original": "Sandwalkers: The Fourteenth Caravan", "description": "Introduction:<br />\nPlay as the Fourteenth Caravan and discover one of your ancestors&#39; secrets, which will rekindle the hope of ending the Phithi era someday.<br />\nEvery decade, the tree city of Lecwasi sends a caravan of merchants and diplomats into the Phithi, the meteorological chaos ravaging the world of Uwando.<br />\nConvoy goods to neighboring tribes, build relationships, survive the creatures that roam around the Phithi, and collect memories of your journey to send to your successors.<br />\nFeatures:<br />\nGuide a caravan of adventurers through ever-changing landscapes.<br />\nFight and survive in the face of acid rain, sandstorms and heat waves.<br />\nTame hostile creatures, rescue refugees, seek allies for mutual aid, or follow the blood path and loot everything you can.<br />\nSeek rich arable soil to plant a new tree city for your people.<br />\nProgress by passing on your knowledge to a new caravan.<br />\nRepair the broken climate, and put an end to centuries of wandering.Games/Series that inspired us:HeroQuest (Board Game), La Horde du Contrevent (Windwalkers, a french book), Kaamelott (the best French series), Monty Python (English series), Dune<br />\nVideo games: Curious Expedition, Renowned Explorers, Trials of Fire, Darkest Dungeon, Slay the Spire, Final Fantasy, Divinity, For the King, Chroma Squad, Battle Brothers, West of Loathing and so many more...</p>", "metacritic": null, "released": "2022-10-25", "tba": false, "updated": "2023-07-05T12:42:29", "background_image": "https://media.rawg.io/media/games/ee6/ee68eb3993bbb10dc2b99e5805bef3a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 159, "beaten": 2, "toplay": 5, "dropped": 2}, "playtime": 1, "achievements_count": 5, "ratings_count": 4, "suggestions_count": 300, "game_series_count": 0, "reviews_count": 4, "platforms": ["Linux", "macOS", "PC"], "developers": ["Goblinz Studio"], "genres": ["RPG", "Strategy"], "publishers": ["Goblinz Publishing"], "esrb_rating": null}