{"id": 871219, "slug": "claytown-horror", "name": "ClayTown Horror", "name_original": "ClayTown Horror", "description": "Enter into the twisted Dollhouse and experience the terrors within. ClayTown Horror is a Single-player horror game with a focus on story, puzzles, and a unique art-style.<br/><br/>Monsters and mayhem roam the halls of this home and, in this first half of ClayTown Horror, you will come face to face with many of them. Use all the tools at your disposal and fight back against the evils of this place. Oh, and if you can, try and find out for yourself the mystery of what has happened in this quiet hilltop house.<br/><br/>Want to know more, huh? Well in that case, I'll leave you with a dear resident of ClayTown; he knows the area quite well. Do enjoy your stay here, and we'll talk again soon.<h3>Welcome to ClayTown Friend</h3><br/>Not many people come here, so it's quite nice to see you.<br/>Though I must say...<br/>You sure are tempting fate coming here.<br/><br/>ClayTown isn't what it used to be. <br/>Friendly faces? Lovely Art? Life in the heart of nature?<br/>All dead ideas.<br/>But don't fret, there's still plenty to see.<br/><br/>I hear you're interested in ghost stories?<br/>Then why don't you go to that old estate.<br/>Mystery, Horror, Consequences,<br/>you'll find all of that and more up there.<h3>Be sure to look around when you get up there, who knows what you might find.</h3><br/><br/><br/><br/><br/>Huh? Is it safe to go up there?<br/>There's nothing to be afraid of friend;<br/>why, I've gone up there a few times as well.<br/><br/>a̷nd I'm perfectly fine<br/><br/>Doesn't matter if you think so or not,<br/>we both know you'll go up there.<h3>So be sure to knock when you go on in.</h3><br/><br/><br/><br/><br/>Oh, I do hope your wit is as big as your curiosity.<br/>That estate is a tricky thing to explore.<br/>Keys and Puzzles, Notes and Riddles<br/>Its residents are quite a secretive bunch.<h3>I'm sure there's a lot to uncover</h3><br/><br/><br/><br/><br/>Oh yes the residents, don't mind them.<br/>They're a little shy at first, but they'll warm up to you.<br/>So don't let their callousness offend you,<br/>I assure you they'd love to pick your brain.<h3>\"I'm sure they'll love you\"</h3><br/><br/><br/><br/><br/>Well friend, that's all from me.<br/>Stay safe up there,<br/>and don't get too overwhelmed<br/>I hope you enjoy your stay,<h3>and welcome to ClayTown</h3>", "metacritic": null, "released": "2022-10-25", "tba": false, "updated": "2022-10-28T03:55:39", "background_image": "https://media.rawg.io/media/screenshots/ddd/dddf0b9356136f5accbca184cdcaffe3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Nightmare Jar"], "genres": ["Adventure", "Indie"], "publishers": ["The Nightmare Jar"], "esrb_rating": null}