{"id": 87121, "slug": "moto-stunt-bike-simulator-3d-furious-high-speed-mo", "name": "Moto Stunt Bike Simulator 3D - Furious high speed motorbike racing and jumping game", "name_original": "Moto Stunt Bike Simulator 3D - Furious high speed motorbike racing and jumping game", "description": "Do you love Moto Stunt Bike Racing Games? Well, everybody loves thrill and performing stunts on stunt missions. Get ready!In thismoto racing game you will get to see unique challenges and tracks.You’re going into the hilly areas of the stunning 3D world. Burn the tracks with jumps and dodge obstacles. You’ll get to see dangerous tracks through the rocky hills.<br/><br/>This will be the most joyful ride of 2015 among the stunt bike simulator games. . Do countless tricks with your dirt bike. It's all about showing off your stunts. Ride your bike like a winner and show everyone what you got.<br/><br/>Yes, there will be plenty of accidents and even a few knock downs, but there’s also too much high speed precision driving on display, often on narrow roads or through tight tunnels. Have a crazy ride and dash over the barrel rolls in the fun fantasy hindrances! This game is all about riding on the outlandish paths. <br/><br/>There are massive jumps, mid-air ramps, outlandish tracks and crazy stunts. Its astonishingly difficult stunt that you’re going to perform while you jump off one ramp perform a complete 360-degree barrel roll in the midair as it crosses over and land on the other ramp. Dodge dangerous obstacles.  Enjoy the thrill of steering the bike through outlandish simulated environment.", "metacritic": null, "released": "2015-04-11", "tba": false, "updated": "2019-10-22T14:25:08", "background_image": "https://media.rawg.io/media/screenshots/13d/13d2a1d029b798405c872e45628ec519.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Adventure", "Simulation", "Sports"], "publishers": ["Techving"], "esrb_rating": "Everyone 10+"}