{"id": 871255, "slug": "grimstar-welcome-to-the-savage-planet", "name": "Grimstar: Welcome to the savage planet", "name_original": "Grimstar: Welcome to the savage planet", "description": "<strong>Grimstar: Welcome to the Savage Planet</strong> is a prologue for Grimstar: Crystals are the New Oil! - a Real-time Strategy game, with heavy emphasis on narrative and the story. It will introduce you to the savage world of alien planets and the brutal life of a corporate representative, as well as the basic mechanics and general concept of the game.<br/><br/>The earth’s resources are depleted, and the energy crisis is imminent. However, there is still hope, thanks to the discovery of a distant world rich with a new type of natural energy. It is called \"Grimstar\". It is there that your brother lost his life, and the law of the company he worked for requires you to take his place until his contract is fulfilled. In an effort to find out more about your brother's death, you set out to fulfill your service... This real-time strategy game is all about exploiting an alien planet to the fullest extent possible.<br/><br/><br/><br/><ul><li>Single-player campaign:<br/>Grimstar features an exciting single-player campaign that evolves around attempting to find out what led to your brother's death. There is strength in being resilient, courage in being brave, and unconditional love in being brothers. No matter the odds, whether it be savage aliens or cruel corporations, brother must stand for brother. The journey you will take on this trip will be one you will never forget.<br/></li><li>Level up system:<br/>Each mission you complete unlocks valuable upgrades, new units, buildings, and upgrades, helping you to better exploit the planet. No matter how you perform in the mission, the roguelike system will ensure your progress.<br/></li><li>Different planets:<br/>The game has three different planets to choose from, each of which unlocks as you progress. Each planet has its own vegetation and unique characteristics. In each planet's missions, a different victory condition must be met: either all crystals must be mined or alien artefacts must be collected. In addition to this, there are a variety of command missions that require special objectives to be achieved. <br/></li><li>Hero units: <br/>There are a variety of heroic units in the game. While they are not unstoppable \"super units\", they can provide an advantage in combat or open up new strategic options. They will surely help you succeed if you use them wisely.<br/>As soon as Hero units are summoned, they can be called in other missions without having to use resources. They level up after each mission, becoming stronger, along with your progress. New weapons become available, upon reaching a certain level.<br/></li><li>Explore and exploit: <br/>Take advantage of all the resources available on alien planets to make your company a success. Utilize the most effective available strategy for your armies and use as few resources as possible against the countless alien hordes on the enemy planet. The more resources you have left at the end of the mission, the higher your level will be.</li></ul>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T04:42:44", "background_image": "https://media.rawg.io/media/screenshots/892/892400d3d4ec9a39cf2344459e5e338a.jpg", "website": "https://valkyrieinitiative.pro/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 2, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SvenRahn Games"], "genres": ["Strategy"], "publishers": ["Valkyrie Initiative"], "esrb_rating": null}