{"id": 871538, "slug": "cube-runner-20-blizzard9748", "name": "Cube Runner 2.0 (Blizzard9748)", "name_original": "Cube Runner 2.0 (Blizzard9748)", "description": "<p><strong>Cube Runner 2.0</strong><br/></p>\n<p>Cube Runner 2.0 is the long-awaited sequel to the first cube runner game. This new and upgraded version of the original game. This version will bring all new features and challenges that add to the already loved mechanics of the first game. <br/></p>\n<p><strong>New Obstacles</strong></p>\n<p>In this new version of Cube Runner, there will be the introduction of new obstacle types. These obstacles will add more flavour and challenge to the levels. They will spice things up and add interest for veteran players of the original. Some of these obstacles will include moving blocks, speed boosts, speed brakes, and more!</p>\n<p><strong>More Levels<br/></strong></p>\n<p>Getting tired of the same old levels when playing the first Cube Runner? Well, fear no more! In Cube Runner 2.0 we will be introducing over 7 more levels to the game! With these additional levels, you will be able to rekindle that passion you had for the first game! All the additional levels bring Cube Runner 2.0's level count to a total of 11 levels! (All levels can be completed)<br/></p>\n<p><strong>More Challenge<br/></strong></p>\n<p>With the addition of new obstacles and levels, we at Goldman Inc. have been able to increase the difficulty of the game. These new levels will be harder than ever and will push your skills to the limit! This added challenge will truly bring Cube Runner 2.0 to its peak!</p>\n<p>Disclaimer: This is all for a university assignment.<br/></p>", "metacritic": null, "released": "2022-10-27", "tba": false, "updated": "2022-10-28T07:17:05", "background_image": "https://media.rawg.io/media/screenshots/cbf/cbf99268b4dcacaa87accbe5d46b6ec7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Blizzard9748"], "genres": [], "publishers": [], "esrb_rating": null}