{"id": 87169, "slug": "bumper-cars-demolition-derby-extreme-car-crash-3d", "name": "Bumper Cars Demolition Derby: Extreme Car Crash 3D", "name_original": "Bumper Cars Demolition Derby: Extreme Car Crash 3D", "description": "Embark on a journey to crash cars in furious driving style. Play extreme gameplay while smashing opponent vehicles inside whirlpool arena or underwater cage. Dodge cars in opposite directions and crash enemy vehicles to be the last racer standing in bumper car destruction zone.<br/><br/>Welcome to bumper crash course of cars, a multiplayer game where your goal is to smash opponent vehicles before getting destroyed. Bumper cars destruction is a game where you must eliminate rivals by striking them with your dodge car. Rules of whirlpool dodging cars consists of bumper racing drivers competing by deliberately ramming their vehicles into one another. Hit, thrash and knockout the rivalry to become last dodge car driver in epic multiplayer auto battle. Built in a breathtaking environment, the amazing sport auto tracks are laid down between tall buildings and over water. Overtake enemies while burning asphalt but don't crash your sports car. Leave gravity in air and evade relentless force to crash cars &amp; smash in xtreme motorsport game ever. Bang in opponent bumpy cars and full track speedway racers that will offer you the thrill of a lifetime.<br/><br/>Key Features:<br/>Thrilling bumper racing game with epic crash mania<br/>20 missions to complete in whirlpool arena &amp; underwater cage<br/>Crash racing modes upon tall buildings and over the water<br/>Detailed dodge car models with real time physics<br/>Immersive sounds and smooth controls<br/><br/>Enjoy the unique gameplay and give your feedback to help us improve our games in future releases", "metacritic": null, "released": "2017-06-10", "tba": false, "updated": "2019-10-22T14:37:38", "background_image": "https://media.rawg.io/media/screenshots/62d/62d9ea05091b957bad15be8e4c476b5b_Y6EnS4h.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Simulation", "Racing"], "publishers": ["Techving"], "esrb_rating": "Everyone 10+"}