{"id": 8716, "slug": "rpg-eve-of-the-genesis", "name": "RPG Eve of the Genesis", "name_original": "RPG Eve of the Genesis", "description": "'Eve of the Genesis'<br/><br/>Way, way back, the Empire of Gadalia, a mighty state, controlled the lands in which the game is set, and the islands around those lands.<br/>That empire was ruled by mechanical beings in the form of men, and the humans were under their control.<br/>It is unclear from what period humans fell under the control of the machines.<br/>There is the legend that robots came down from the heavens, but so long has passed now that to be certain of how things began is nigh on impossible.<br/><br/>'Why must humans be subject to those with no blood in their veins?'- Finally, this ill-feeling led to the humans raising the flag of revolt against the machines.<br/><br/>The clashes between humans and machines developed into a huge war that engulfed each and every land, with no victory in sight. Into this stalemate the machines introduced the strongest killing machine of all, designed to achieve ultimate victory: the Eve of Zero...<br/><br/>Now, 2000 years later…<br/><br/><br/>■ A simple and classic RPG<br/><br/>Easy and fun to play, for anyone from beginners to seasoned gamers.<br/><br/><br/>■ Beautiful, old-style graphics<br/><br/>The dungeons contain many traps, and are satisfyingly challenging. You will need to explore every inch of the dungeons, to open the doors to paths that will enable you to proceed.<br/>The characters are rendered in a classic, 'eight-bit' style, and appear completely old-style when they move, one next to the other, but they are beautifully detailed and a delight to watch.<br/>Don't miss the butterflies that flutter through the towns, the reflections of the characters in pools and rivers, and the many other wonderful details!<br/><br/><br/><br/>■ Flexible character development and easy battles<br/><br/>Battles are simple and straightforward to control. Direct control makes for a stress-free game.<br/>By using stronger skills, you can deal with a number of enemies in one fell swoop.<br/>Using gems, you can strengthen the skills you have acquired, changed their elements, and so on. Customize skills to suit your preferences, and develop your characters in just the ways you want to!<br/><br/><br/>■ Complete with a variety of record books<br/><br/>The skills and items you have gained, the monsters you have encountered, and so on, are all recorded in the record books.<br/>This convenient feature allows you to check a whole range of information, for example the items you gain when you defeat a certain monster.<br/>It could even be said that you have only really cleared the game when you have completed all the record books!<br/><br/>* From iOS 8 you will need to change the device language settings to English to have the gameplay in English. *<br/><br/>================= <br/>Supported models: <br/>This game operates on second generation and later iPhone3GS/iPod touch (later than iOS3.0). <br/>The game will not run correctly on the first generation iPhone 3G and iPod touch. <br/>================= <br/><br/>************************************<br/>[Facebook page(en)]<br/>\"\"Like\"\" our page to get the latest information!<br/>http://www.facebook.com/#!/kemco.global<br/>************************************", "metacritic": null, "released": "2011-02-18", "tba": false, "updated": "2019-08-02T03:28:00", "background_image": "https://media.rawg.io/media/screenshots/3f0/3f0aa79e7270feee1b87915840328d9d.jpeg", "website": "http://www.kemco.jp/applipage/10_game/eotg_a.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 290, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Kotobuki Solution Co"], "genres": ["Adventure", "RPG"], "publishers": ["Kotobuki Solution Co"], "esrb_rating": null}