{"id": 871715, "slug": "for-all-of-us", "name": "For All Of Us", "name_original": "For All Of Us", "description": "Controls\r\n<p>Arrow keys to move characters around the screen.</p>\n<p>Z/o to switch between characters.</p>\n<p>X/x to attack.</p>\r\nRules\r\n<p>You control two characters, a human and an insect. Together, they search for the old, forgotten religion that might save the two species from an eternal war.</p>\r\nSwitch Characters\r\n<p>You control one character at a time, moving them throught their part of the screen.\r\n</p>\n<p>Use Z/o to switch to the other character. An arrow above a character will tell you which one you are currently controlling.</p>\r\nCharacter Attacks\r\n<p>Use X to attack.\r\n</p>\n<p>Each character resorts to the obscure connection of the old religion to emit a wave of energy around them. Walk into enemies, or let enemies walk into you to defeat them and gain points!\r\n</p>\n<p>Careful - it takes a while to recharge after each attack. A skull will flash above your head to show you the next wave attack is ready.</p>\n\n<p>There are two types of levels: <strong>Ground </strong>Levels and <strong>Vertical </strong>Levels.</p>\r\nGround Level\r\n<p>The human occupies the bottom half of the screen, standing on the ground.</p>\n<p>The insect instead flies above, in the sky in the higher half of the screen.</p>\r\nDark Energy\r\n<p>Red Portals of dark energy will appear across the screen. Walk one of the characters over it, and they will collect that energy. </p>\r\nCompass and Completing the Level\r\n<p>The compass at the bottom of the screen will slowly charge up - once the hand of the compass has made a whole turn, the level is completed, and you gain the points you scored during the level.</p>\r\nVertical Level\r\n<p>This time, you only control the insect character, carrying his friend on his back.</p>\n<p>You still have the same attack with X, but you can't switch between characters.</p>\n<p>You complete vertical levels by dodging the enemies and waiting until you've traveled far enough.</p>\r\nNot-Destroyable Obstacle\r\n<p>Long spikes poking out of the walls will travel up or down the screen. These spikes will not be destroyed by your attack - don't come close!</p>\r\nEnemies\r\n<p>As you go through the levels, more and more enemies will appear. Hitting them will cost a heart. Losing a heart costs a life.</p>\r\nHuman Soldier\r\n<p>They walk across the screen, walking on the ground. The human must dodge them!</p>\r\nInsect Soldier\r\n<p>From the top down, they disappear at the bottom of the screen.</p>\r\nJellyfish\r\n<p>Travels across the screen, flying in the sky at insect-level. Now the insect also has something to worry about!</p>\r\nEvil Star\r\n<p>Appears from the corners of the screen, and speeds at one of the characters. Try and dodge and understand who it's pointing at, so you can predict its movement!</p>\r\nSpider\r\n<p>Can appear at any height, traveling horizontally thorugh the screen. Look out for those!</p>\r\nGiant Spider\r\n<p>This big enemy appears from the bottom of the screen, traveling quickly toward the top of the screen. Don't be caught off guard.</p>\r\nFireball\r\n<p>Shot by the angered gods, can be dispatched by a wave attack.</p>\r\nIntermissions\r\n<p>Between levels, you will get little intermissions to advance the story of the game.</p>\n<p>You can press X or Z to advance after you are done reading through.</p>\r\nFinding a Relic\r\n<p>The Compass, charged with dark energy, will point the two friends toward ancient relics of the ancient gods. They will dig it up, and find out what it is. Follow them toward the altar, to find out wether they succeed, or not...</p>\r\nGame Over\r\n<p>If you run out of lives, you will have two options:</p>\n<ul><li>Continue</li><li>Exit</li></ul>\n<p>Continue will let you start again from the same level, but you score will be back to zero.</p>\n<p>Exiting will bring you to the final score screen, where you can cash in the score you managed to get so far. Point to the ending and to a high score!</p>\r\nBehind The Scenes\r\n<p>Well, isn't this one of the biggest games I've done on Pico8!</p>\n<p>I still have to check wether or not \"Will of the Spiders\" is bigger, but this sure felt like it.</p>\n<p>A lot of gameplay changes and little things that keep switching around, which made it a bit more difficult to produce but also feels like a very, very complete product. I've also enjoyed making the music loops!</p>\n<p>First horror themed game I've made so far. I feel like I might enjoy the genre...</p>\r\nCredits\r\n<p>Game made in Pico8\r\n</p>\n<p>Design and Programming by KaaSnake\r\n</p>\n<p>Music and SFX by KaaSnake\r\n</p>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T08:25:10", "background_image": "https://media.rawg.io/media/screenshots/826/826db751b403c10e61e2df41e99b3d4d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 155, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["KaaSnake"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}