{"id": 871711, "slug": "hohfelds-dungeon-by-tyson-a-savoretti", "name": "Hohfeld's Dungeon - by Tyson A Savoretti", "name_original": "Hohfeld's Dungeon - by Tyson A Savoretti", "description": "<em>Welcome to Hohfeld's Dungeon<br/></em>\n<p>use ARROW KEYS to move </p>\n<ul><li>Game made using: Bitsy<ul><li>Bitsy engine is an open source software! Read more here (https://github.com/le-doux/bitsy/blob/main/LICENSE.md)</li></ul></li><li>Some sprites  and tiles included from various artists (creative commons license):<ul><li>Adam Ledoux (https://ledoux.itch.io/forest-zone-bitsy-tile-pack)</li><li>Enui (https://enui.itch.io/)</li><li>Tyson A Savoretti, with permission granted for open-source use (https://creativecommons.org/publicdomain/zero/1.0/)</li></ul></li><li>Music created by:<ul><li>Adam Ledoux</li><li>Tyson A Savoretti</li></ul></li><li>Dialog, story, game design by Tyson A Savoretti</li></ul>\r\nThank you for playing this game!\r\n<p>During the past few years I have been captivated by game makers, artists, and authors who use the limitations of very basic design engines to create wonderful games.  It really is an entire world out there of microgames that stretch the imagination.  I have included a few links at the bottom of this page of the types of pages that inspired me to find a project that would incorporate an engine like Bitsy.  This is, indeed, my very first experience in game design and game creation.  It should feel familiar, simply, but intentional.  This page serves as both a credit roll as well as an extended explanation of what exactly is happening in this \"game.\"</p>\n<p>I realize the idea of a game based upon a legal notion known only to the Ivy League (and those who have taken their classes) may seem a bit odd. I hope the oddness helps you to retain some of this information. <br/></p>\n<p>I am Tyson Savoretti, and as of writing this, I am a law student at Stetson University College of Law in the year 2022.  My professor is Marco Jimenez, and he is the one who introduced my part-time Contracts class to Hohfeld and this idea of defining rights in a more precise manner.   I created this game as a project and was inspired by the phrase \"...delve into contract law...\" from our syllabus.  It is a funny thing, to have someone pick apart the idea of \"rights.\" Don't we already know what rights are?  Haven't they been enumerated in our country's founding documents?  Do we not strive to \"fight for\" and \"stand up\" for our rights on a daily basis?  I write this preamble in the year 2022, where the cause du jour is that of a variety of civil rights; including transsexual, racial rights, and the idea of equality vs. equity. If you read this in the year 2072, perhaps the Western world has settled these matters (though I doubt this).</p>\n<p>Since I created this game as a fun way of exploring what Hohfeld was talking about, I want to keep this post-script conversational, as if you were sitting next to me, sipping a whiskey, and pontificating like those Western men whose debate built the foundations of the legal systems which we all enjoy (and suffer).<br/></p>\n<p>This post-script text here shall serve as a study guide to give a bit more clarity, and to point you toward other resources.</p>\n<p>What are rights? If you were to have this debate with friends, political adversaries, family, etc., you may imagine yourself having a challenging time even finding common footing on which to begin a conversation, let alone find the ground common enough to come to conclusion.</p>\n<p>What are human rights? What are gay rights? Do animals other than humans have rights? How do we know? Where do we \"get\" our rights? Is it from a old piece of parchment? Do we get them from stone tablets, golden plates, read off a laminated card prior to our arrest?  Are they enumerated because men decide on them? Do we \"derive them\" from our peers and decide democratically? Do they come from God?  If they do come from God, why all the confusion? If they come from men, which men are \"right\" about them?</p>\n<p>Now, hopefully, you see how much more enjoyable a conversation this could have been had we really been sitting on a porch with whiskey...but for Hohfeld...</p>\n<p>Hohfeld, I imagine, shone through the clouds and attempted to topple the tower of confusion when he laid out his ideas about the precise nature of talking about rights. He figured, that if we could be more exact about how we speak about rights, we would have better results discussing them.  He was especially interested in the interplay between individuals which corresponding, correlative rights, and those rights that were in opposition to one another.</p>\n<p>I have included some additional reading on the topic below, but allow me to give you a bit of an overview.</p>\n<p>Let us talk about the first set of correlative rights, the Right/Duty relationship. It is a bit reflexive to say it this way, so I attempt to clarify by saying Claim/Duty to lessen the potential confusion for anyone not suffering law school while reading this.  A claim/duty relationship is one in which there is an existing legal relationship. One party has a claim, the other a duty (all the Hohfeldian pairs are like this).  If I have a claim to a parcel of land, you have a duty.  You are bound (legally) to respect my claim and you cannot , without another Hohfeldian correlative, change this relationship.</p>\n<p>So if you have a duty, the opposite of your duty is a privilege. A privilege is one where you have a choice about how you act in respect to something.  If I have the privilege of walking on a public street, you have \"no-right\" to my privilege. The term \"no-right\" is imperfect, in my opinion, but no one yet knows my last name as well as Hohfeld so I consider myself to have \"no-right\" to complain about it. If you caught what just happened, you are either a genius or you to have taken a Contracts class from Professor Jimenez. You see, the no-right position is correlative to the privilege position.  If someone has a privilege, that must mean that someone else has a \"no-right\"</p>\n<p> Confused yet? Have a little more whiskey.</p>\n<p>The claim/duty and privilege/no-right relationships represent relationships that currently exist. What about when it comes to changing legal relationships?</p>\n<p> On the \"right\" side of the diagram, there exists another set of relationships.  They exist to describe the rights associated with the ability to change a legal relationship.</p>\n<p>The first is the Power/Liability relationship. In this relationship, the party with the power, exerts it over another, who has a liability with respect to that power. In other words, if I have the power to convert our relationship, you are liable to have that conversion take place.  If I make you an offer to sell you my car, you now have the power to accept, and change the relationship of my car as it pertains to me. If you accept my offer, your power converts my car to you (assuming you don't breach, etc.)  You now have a claim to that car, and I, have a duty to your claim.</p>\n<p>Like in our first set of examples, the liability right also has an opposite. The opposite of a liability is an immunity. An immunity simply means that you cannot have your legal relationship changed by another. If you are immune to prosecution due to your status, it simply cannot be changed by these same rules.</p>\n<p> Finally, when one has an immunity, another must have \"disability.\" This makes sense! If an immunity means that another cannot change your legal relationship, that other person holds a disability.  In other words, a disability, opposite to power, means you have no power to change a legal relationship.</p>\n<p>These rights may be best viewed as a set of two grids. The trick with understanding these relationships is to viewing these rights and the interplay between them.  If you notice the Right/Duty column, for instance, you can see that diagonal from each Right/Duty, are the \"jural opposites.\" Right is opposite from No-Right, and Privilege is opposite from Duty.</p>\n\n\r\n These tables are taken from class discussion and PowerPoint (Professor Marco Jimenez\r\n\n<p>Please feel free to explore the game some more, as well as a few of the articles that I've included at the bottom. <br/></p>\n<p>Thank you, again, for enjoying the game.  I had a fun time learning about the Bitsy game development engine, and hope to incorporate more legal ideas in the future using novel approaches.</p>\n<p><strong>References:</strong></p>\n<ul><li>Jimenez, Marco, Contract Law: A Case and Problem Based Approach (Aspen Casebook)\r\n  <ul><li>https://www.amazon.com/Contract-Law-Problem-Approach-Casebook/dp/1454863307 </li></ul></li></ul>\n<ul><li>Jimenez, Marco, Distributive Justice and Contract Law: A Hohfeldian Analysis (September 7, 2017). Florida State<ul><li>University Law Review, Vol. 43, No. 1265, 2016, Available at SSRN:  https://ssrn.com/abstract=3033817</li></ul></li></ul>\n<p><strong> </strong><strong>Other Reading:</strong></p>\n<ul><li> Alspaugh Thomas A., Hohfeld's Legal Relations<ul><li>https://www.ics.uci.edu/~alspaugh/cls/shr/hohfeld.html\r\n  </li></ul></li><li> J. M. Balkin, The Hohfeldian Approach to Law and Semiotics, 44 U. Miami L. Rev. 1119 (1990)<ul><li>https://repository.law.miami.edu/cgi/viewcontent.cgi?article=1983&amp;context=umlr\r\n</li></ul></li></ul>\n<p><strong>Inspirational Links:</strong></p>\n<ul><li>https://emreed.net/</li><li>https://sadgrl.online/</li><li>https://ducklingsmith.itch.io/bitsy-mystery-dungeon</li><li>https://cobradile.neocities.org/</li></ul>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T08:23:31", "background_image": "https://media.rawg.io/media/screenshots/606/606ffa6110522c8b54d33cf493a72e43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TysonSavoretti"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}