{"id": 8718, "slug": "gargoyle-ruins", "name": "Gargoyle Ruins", "name_original": "Gargoyle Ruins", "description": "Step into the boots of a true hero in Gargoyle Ruins, the prequel to Game Stew's first title and TouchArcade's Arcade 2012 Game Of The Year--Tower of Fortune! With your companion by your side it is your hero's duty to save a wealthy kingdom where girls are kidnapped by gargoyles once a year. Solve the mystery and defeat the evil forces in this retro VFD tabletop arcade game inspired by the early Game &amp; Watch games!<br/><br/>Features <br/>- Retro-style visuals with funny animation and detailed 8-bit art<br/>- 7 fun and challenging games to enjoy including Princess Rescue, Dead Man’s Gold, Queen’s Chamber, and more<br/>- Play Story Mode to unveil the mystery behind the troubled kingdom as you equip the hero and upgrade the game with over 50 pieces of content to take on the next rewarding challenge<br/>- Arcade mode lets you challenge other player's high scores and see your ranking in the world<br/>- From getting stabbed, drowned, or burned, prepare to die in more than 13 unique ways during your journey<br/>- 40 challenging achievements to conquer if you have what it takes to be a hero <br/><br/>-----------------------------------------------------------<br/>Facebook <br/>http://www.facebook.com/TowerofFortune<br/><br/>Gameplay Movie <br/>http://youtu.be/8cv-TIUTgyc", "metacritic": null, "released": "2013-04-18", "tba": false, "updated": "2019-10-22T14:30:03", "background_image": "https://media.rawg.io/media/screenshots/e74/e74f2c0d279e1e4a44bb511f2c9e12b8.jpeg", "website": "http://www.facebook.com/TowerofFortune", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 241, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Game Stew"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["GUAN LING WU"], "esrb_rating": "Everyone 10+"}