{"id": 871823, "slug": "a-last-ditch-effort", "name": "A Last Ditch Effort", "name_original": "A Last Ditch Effort", "description": "<p>A Last Ditch Effort is a short horror puzzle game that's inspired by outer wilds. <br/></p>\n<br/>I recommend that you download the game instead of playing on web because the web version has some problems like stutter when loading rooms, audio glitches and al around worse performance.\r\n\r\nDOWNLOAD BELOW\r\n|\r\nV\r\n\n\n<p>This is my first finished 3d project and an experiment on top of that, so the game will probably have some bugs and questionable design choices. Prepare yourself for that. </p>\n<p>Also feel free to ask questions, leave criticism or just tell me about your experience in the comments.<br/></p>\r\nControls: \r\n<ul><li>WASD: move</li><li>Space: jump / jet pack</li><li>Left Mouse: interact</li><li>F: fullscreen</li><li>R: release oxygen</li></ul>\r\nHints: \r\n<p>I already know that a lot of people will have trouble figuring out how to beat this game. That's why I'm going to give you a few hints in this section in case you get stuck but don't want to look up the solutions right away. (Solutions further down)</p>\n<p>What do I even need to do ?<br/></p>\n<ul><li>Listen to all the audio recordings of the robots. They basically provide the solutions to what the steps to win are. </li><li>You are trapped in a time loop. That means that events always play out the same way. And at the same TIME.</li><li>If you understand the premise of the game you might want to take a look at the map for a longer duration.</li></ul>\n<p>The generator keeps breaking down. How do I prevent that ?</p>\n<ul><li>What causes the generator to get destroyed ?</li><li>Also, is there maybe some device in the station that could help here ?</li><li>You may want to keep track of the time. </li></ul>\n<p>I have looked everywhere for the solution to the final puzzle but I have no idea.</p>\n<ul><li>The important part of the puzzle isn't what you do, but rather WHEN you do it.</li><li>There is a robot in the top right part of the map, in the room with the table and \"pillars\" that spells it out for you.</li><li>Keep in mind that the game is a time loop.</li></ul>\r\nSolutions (SPOILERS):\r\n<p>Here are the steps in order to beat the game:</p>\n<ol><li>  Get the flashlight.</li><li> Get the jet pack in the locker (2148)</li><li> Activate the generator in the middle left room by flicking all 3 switches.</li><li>Start charging the cannon in the middle room in the connecting corridor.</li><li>Wait in the shield room (middle right) and make sure the shield is active at 03:06:23.</li><li>Go back to the cannon and press fire exactly at 03:08:36</li></ol>\n<br/>Credits:\r\n<p>Shaders from Godot Shaders:</p>\n<ul><li>https://godotshaders.com/shader/2d-radial-distortion-fisheye-barrel/</li><li>https://godotshaders.com/shader/scifi-hologram/</li></ul>\n<p>Font:</p>\n<ul><li>https://www.dafont.com/spaceship2100.font?l[]=10&amp;l[]=1</li></ul>\n<p>Sound:</p>\n<ul><li>https://freesound.org/people/o_ciz/sounds/475427/</li></ul>\n<p>Programs used:</p>\n<ul><li>Godot 3.5</li><li>Blender 3.3.1</li><li>Ableton live 11 intro</li><li>Aseprite</li></ul>\n<p>Dialogic: Made by Emilio Coppola and Jowan-Spooner.</p>\n<ul><li>https://github.com/coppolaemilio/dialogic</li></ul>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T09:13:27", "background_image": "https://media.rawg.io/media/screenshots/047/0479c0e8f7a418d6acdaa430de48566a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Michael Grieshofer"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}