{"id": 87186, "slug": "police-cop-duty-training", "name": "Police Cop Duty Training", "name_original": "Police Cop Duty Training", "description": "The city has gone crazy with multiple crimes and criminal acts. A new concept for the lovers of police games is here. Who wants to play as a real cop? Have you ever thought what it takes to be a professional police officer? Time to join police training school and get yourself trained as the top police officer of the town. Once you join the police training academy you need to get trained on different levels of fitness, accuracy and other skills. Jumping, running, escaping, driving, shooting and other fitness training. You need to pass all the training challenges to call yourself as the best police officer of the town. First ever crime control training simulator to help you train as a pro cop to fight against criminals, robbers and thief. Clear the training levels and take charge as sheriff of the town and control the crimes taking place.<br/><br/>Police officers usually chase criminals on horses and cars. Police dogs are also their companions but they are also trained to be professionals. Things you need to perfect in are running, jumping, driving and shooting. This is the only way you learn how to hunt down criminals. Start thinking as a criminal so might get clever enough to catch them later in your professional police career. Escape the police training arena with your jumping and running skills. Find your way out safely. Shoot your targets and get perfection in putting bullets to the right spots. Clear each training level and get ready to join the police elite forces. Join hands with police officials in removal of crime from the city.<br/><br/>***** GAME FEATURES *****<br/><br/>• Police Cop Training <br/>• Running, Jumping, Driving &amp; Shooting<br/>• Train yourself to be a Pro Cop<br/>• A Unique Concept for Police Game Lovers<br/>• Amazing Training Academy Environment with HD Graphics<br/>• Play as a Real Trainee to Try Different Levels<br/><br/>**** JOIN US ****<br/>Like us on Facebook and Follow us on Twitter to stay updated.<br/><br/>https://www.facebook.com/TheGameStormStudios<br/>https://twitter.com/GameStormStudio", "metacritic": null, "released": "2015-08-27", "tba": false, "updated": "2019-10-22T14:16:22", "background_image": "https://media.rawg.io/media/screenshots/4bd/4bd877c6e03e916aeebc2ec35c9bebcc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Action", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": null}