{"id": 871846, "slug": "ataraxia-exion", "name": "Ataraxia (Exion)", "name_original": "Ataraxia (Exion)", "description": "<p><em>Disclaimer: This game was made for the Cosmic Horrors Jam as a solo dev. Game was a bit rushed around the end as I had no time to finish it.</em></p>\n\n<p>Play as an Eldritch God and conquer the city by using your powerful cards to warp those mortals' minds.</p>\r\nHow to Play?\r\n<ul><li>The game cycle through night and day:<ul><li>During the day, select your cards, then a target.</li></ul><ul><li>During the night, you get your first contact's cards, you can use one to shift the game in your favor.</li></ul><ul><li>At the end of the night, Suspicion is removed, a good rest makes your worries go away after all.</li></ul></li><li>Your goal is to <strong>corrupt </strong>all citizen in the city. To do so, you'll need to bring down their Mental Strength down to 0 or make them fully Insane.</li><li>Making someone Insane has a cost, though. After all, someone sane going crazy overnight is a bit weird. When someone goes Insane, all their friends will generate 3 suspicion points.</li><li>Beware, for the crusade is guarding this city. If your suspicion goes too high, a crusader might pop up there to find and kill the corrupted.</li></ul>\r\nGame is not finished\r\n<p>As I mentioned in the Disclaimer, this game hasn't been finished. I am a sole student and worked on the jam during my free time (when I had such).</p>\n<p>Lots of the graphics are just placeholder. As of now, only The Ruthless has a basic deck made.</p>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T09:22:20", "background_image": "https://media.rawg.io/media/screenshots/126/1263acabcdc67e3fd411617744ac9d45.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 44, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Exion"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}