{"id": 871914, "slug": "dimeland-basketball-three-point-contest", "name": "Dimeland: Basketball Three Point Contest", "name_original": "Dimeland: Basketball Three Point Contest", "description": "<p>Be ready for the next basketball video game experience: Dimeland!</p>\n\n<p>Dimeland ought to be a full-fledged 3v3 online multiplayer game with realistic and fluid gameplay, giving the player the ability to express himself like he would in a real court and be the true king of the streets. Team play will always prevail!</p>\n<p>This chapter is a simple classic three point contest: 60 seconds to shoot 5 racks of 5 balls each, with the last ball of each rack being a money ball (money ball = 2 points; regular ball = 1 point), totaling a maximum of 30 points.</p>\n<p>The one and only goal of this early release, as well as some other future releases, is to get some valuable feedback from you, the players, while the main game continues under development.</p>\n<p>Some feature updates are intended to this release in the near future, such as character animations (click here to find out more) a tournament mode to play with other players across the world and a global leaderboard (ordered by most points first then by quickest run then by most shots made and finally by most perfect shot releases), just to keep things competitive.</p>\n<p>Dimeland Three Point Contest has full gamepad support, even in the menus, but can also be played with a keyboard. The control mapping can be found in the controls menu.<br/></p>\n\n<p>Your feedback and ideas are an honor, so please share them with me!</p>\n<p>Have fun!</p>\n\n<p>Dimeland</p>\n<p><em>Be the next legend of basketball</em></p>\n\n<p>I am an indie game solo developer fully commited to this game. So if you really like the idea and my work, please consider donating. Your help will be 100% invested in this game.</p>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T09:52:12", "background_image": "https://media.rawg.io/media/screenshots/dd0/dd09249eefcb20749b7875df97fb9302.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DIMELAND"], "genres": ["Simulation", "Sports"], "publishers": [], "esrb_rating": null}