{"id": 871940, "slug": "flying-sus-definitive-deluxe-30-edition-diamond-qu", "name": "Flying Sus (Definitive DELUXE 3.0 Edition DIAMOND) | Quête 1", "name_original": "Flying Sus (Definitive DELUXE 3.0 Edition DIAMOND) | Quête 1", "description": "<p>FR</p>\n<p>Ok alors imaginez j'ai un projet de début d'année à faire en une semaine en LUA sur PICO-8, maintenant imaginez j'ai pété les plombs, je fais un DLC en + et je décide de le mettre sur ITCH.IO pour mon portfolio, c'est exactement ce qu'il y a ici.</p>\r\nMais... pourquoi ?\r\n<p><em>New York Times je crois</em></p>\n<p>Contrôles :</p>\n<p>Haut : Saut</p>\n<p>Histoire :</p>\n<p>Dans un univers parallèle DANS LE PASSE, un joueur d'among us DU FUTUR DANS LE PASSE, trouve un jeu moddé DANS LE PRESENT contenant une mention \"JETPACK NE PAS TOUCHER SVP\".</p>\n<p>IL L'A TOUCHE, téléporté dans le jeu among us il devra utiliser une feature DANS LA BETA le SUPER JETPACK 3000, et devra controller son alter ego JOHN 117 MACCRISH.</p>\n<p>Arrivera t-il à survivre et atteindre le fameux score de 420 POINTS MOM GET THE CAMERA?</p>\n<p>INCLU LE DLC ELU GOTY 2022 TELLEMENT IL ETAIT GOTY, FLAPPY CHOCO. (Approuvé par Charles je jure c'est vrai IL ME L'A DIT)</p>\n\n<p>EN</p>\n<p>Ok so imagine I have a school project to do in a week in LUA on PICO-8, now imagine I've freaked out, I'm doing a DLC with the other game, and I decide to put it on ITCH.IO for my portfolio, that's exactly what's here.</p>\r\nBut... why?\r\n<p><em>New York Times i guess</em></p>\n<p>Controls:</p>\n<p>Up: Jump</p>\n<p>Story :</p>\n<p>In a parallel universe IN THE PAST, a player from FUTURE IN THE PAST finds a modded game IN THE PRESENT with a post-it \"JETPACK PLEASE DO NOT TOUCH\" on it.</p>\n<p>HE HAS TOUCHED IT, teleported in the game among us he will have to use a feature IN BETA the SUPER JETPACK 3000, and will have to control his alter ego JOHN 117 MACCRISH.</p>\n<p>Will he manage to survive and reach the famous score of 420 POINTS MOM GET THE CAMERA?</p>\n<p>INCLUDES THE DLC, ELECTED GOTY 2022 SUCH IT WAS GOTY, FLAPPY CHOCO.</p>\n\n<p><strong><em>Setup available soon.</em></strong><br/></p>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T10:03:27", "background_image": "https://media.rawg.io/media/screenshots/002/00251c4eedaceb9e708a32c483fdae76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zakaria DUTERTRE"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}