{"id": 871910, "slug": "run-bill-run", "name": "Run Bill Run!", "name_original": "Run Bill Run!", "description": "<p>I decided to make a simple endless runner in UE5. I ended up making it more complicated (naturally) and decided I need feedback on it! The gameplay is simple - Get as far as you can. One hit means you start over. </p>\n<p>The brief backstory is that Bill has attempted a bank robbery. He fails and flees, only to find himself in a town covered with fog in the distance. There are many cars moving but with no drivers, so he runs as fast as he can in order to attempt to escape his surroundings.</p>\n<p>There are four powerups: </p>\n<p>-Magnet. This brings coins towards you from three lanes. </p>\n<p>-Double Speed (lightning bolt) . Lasts five seconds. </p>\n<p>-Double Jump (blue boot) . Lasts five seconds. Lets you jump twice.</p>\n<p>-Invincibility (floating orb) . This is an interactable powerup - You have to press the 1 key to use it. It lasts five seconds and is shown by the visual flickering of the character. You will survive anything.</p>\n<p>All powerups, including this one will stack, meaning if you are using invincibility and you hit another one, you have one to use right after. Double speed will reset your speed to double for five seconds, and so on. </p>\n<p>P and ESC bring up the pause menu. </p>\n<p>I will be coming back to this and updating so please feel free to leave feedback. I plan to release this on the Google Play store, I have my developers account on Google I just need to get set up and I am seeking feedback on this project before I do so. </p>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-10-28T09:50:20", "background_image": "https://media.rawg.io/media/screenshots/946/946047379aa152147c913b1b27f34c2c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jackm89"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}