{"id": 872170, "slug": "how-to-say-goodbye", "name": "How to Say Goodbye", "name_original": "How to Say Goodbye", "description": "<p>How to say Goodbye tells the story of someone who has recently been turned into a ghost, lost in an unfamiliar world populated by disoriented spirits.<br />\nIn this narrative puzzle game, move the decor to help the characters escape the liminal world in which they are lost. Help them on their quest to move on and escape from the grasp of a mysterious Wizard.</p>\n<p>A PUZZLE GAME BASED ON WORLD MANIPULATION</p>\n<p>Overcome tricky grid-based puzzles to lead the ghosts onward and travel through more than 15 chapters, from your kitchen to the moon.<br />\nSolve numerous conundrums in a universe inspired by illustration and great classics of children&#39;s literature (Tomi Ungerer, Tove Jansson, Antoine de Saint-Exupéry, Maurice Sendak...)</p>\n<p>A STRONG AND UNIQUE THEME</p>\n<p>A poignant puzzle game that deals with grief with kindness and subtlety<br />\nSave your friends before they disappear forever<br />\nGuide the ghosts out of the strange world in which they are trapped<br />\nMeet various characters, help them find peace and mourn their own death<br />\nUnveil the secret of the Wizard and the Spleens, the misguided spirits that haunt the other side</p>", "metacritic": null, "released": "2022-11-02", "tba": false, "updated": "2023-01-02T12:25:35", "background_image": "https://media.rawg.io/media/screenshots/2d1/2d18ca2342c04cb57c8eac0e94d79633.jpg", "website": "http://florian.games/theotherside/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 9, "toplay": 10, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC", "iOS", "Nintendo Switch"], "developers": ["ARTE Experience", "Arte France", "Florian Veltman", "Baptiste Portefaix"], "genres": ["Adventure", "Casual", "Indie", "Puzzle"], "publishers": ["ARTE France Apps", "ARTE France"], "esrb_rating": "Everyone 10+"}