{"id": 872317, "slug": "windshield-wars", "name": "Windshield Wars", "name_original": "Windshield Wars", "description": "<p>Windshield Wars: World Cup was uploaded to Gamejolt for the World Cup Jam</p>\n<p>Windshield Wars: World Cup by AdvGoLeft - Game Jolt</p><p>Discord server:</p><p>https://discord.gg/kwjxhjhps6<br/></p>\n<p>While Windshield Wars was designed as a sports-based game, mixing the likes of Demolition Derby with Rugby, the overall vision for Windshield Wars is a game of action, aggressive vehicle combat, and eventually multiplayer fun!</p>\n<p>Taking inspiration from classic titles like Twisted Metal, Rocket League, and Halo's Griffball, Windshield Wars aims to provide nonstop vehicular combat and high octane thrills!</p>\n<p>Available modes:</p>\n<p>-World Cup Mode: Battle your opponents in various arenas with uniquely challenging arena hazards until you win 4 out of 4 arenas. </p>\n<p>Upcoming modes:</p>\n<p>-Story mode: Choose a vehicle/driver and fight your way through various levels until you claim your ultimate prize of fame and wealth!</p>\n<p>-Last Man Standing: Choose your vehicle/driver and battle against your foes in one of 4 arenas until you are the last one alive and game points for completing arena objectives!<br/></p>\n<p>-Multiplayer: You and up to 3 friends battle it out in a series of unique arenas scoring objectives and destroying other drivers!</p>\n<p>Follow for game updates as the road to release looms ever closer day by day!</p>", "metacritic": null, "released": "2022-10-25", "tba": false, "updated": "2022-10-28T12:40:15", "background_image": "https://media.rawg.io/media/screenshots/33e/33e8dbc5a0c2b0fb612c21501c87d29e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 106, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AGLgames"], "genres": ["Action", "Shooter", "Sports", "Racing"], "publishers": [], "esrb_rating": null}