{"id": 872336, "slug": "ubermensch-3d", "name": "Ubermensch 3D", "name_original": "Ubermensch 3D", "description": "<p>Retro 2.5D first-person shooter inspired by Wolfenstein 3D with mechanics more like Return to Castle Wolfenstein.</p>\n\n<p>What that means is that for a start you can look up and down, you can lean around corners -- you currently can't shoot but also won't be seen. You can sneak up behind enemies and perform sneak attacks -- you must be crouched and using a knife or silenced weapon. \r\n</p>\n<p>My plan is to make it more of a stealth immersive sim. So far sound affects your ability to be detected, working on shadows -- you can actually shoot out most of the lights in the game. Still need to fix the AI so that it doesn't spot you as quick by sight.\r\n</p>\n<p>There are several enemies in the game, you also can make use of several weapons: knife, silenced pistol, pistol, submachine gun, silenced submachine gun -- these you must find. I plan to add more in the future.\r\n</p>\n<p>FYI there are several secret areas where you must interact with the wall to gain access -- this is a bit less trial and error as compared to Wolfenstein 3D; TIP there is one nearby where you start.\r\nWhen you reach the end elevator, you can consider the demo \"finished\".</p>\n\n<p>This is an old project I've worked on and off for a while, thought I'd push through some new stuff and finally make it public to see what people think. FYI it makes use of some placeholder assets.</p>", "metacritic": null, "released": "2022-10-25", "tba": false, "updated": "2022-10-28T12:50:54", "background_image": "https://media.rawg.io/media/screenshots/155/155964d95b53f0603ef42a854b80f959.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bjiCorp"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}