{"id": 872352, "slug": "iso-racer", "name": "Iso Racer", "name_original": "Iso Racer", "description": "In Iso Racer, players take control of a variety of racing cars and compete in a range of events across different tracks. The game features multiplayer mode, allowing players to compete against AI or other players online. The physics of the game are also realistic combined with drifting to make the game more interesting. Players have the ability to customize their vehicles and improve their performance.<h3>Drifting Style!</h3><br/>The beginning of the game is simple, it looks like a typical top-down racing game, but don't let that fool you! You need to properly cut your speed before the corners in order to pass them with a perfect drift!<h3>Car damage is only visual</h3><br/>Iso Racer is a racing game developed and published by Pogo Concepts. The game features top-down perspective and is heavily inspired by classic racing games, while still offering modern features such as online multiplayer.<br/><br/>We also care about interaction between players, which is why, among other things, we decided to have chat in the form of clouds above the vehicles, and we plan to add more types of competition in the future, beyond the standard races during the same game.<h3>Sprzedam opla- cena i przebieg do ustalenia</h3><br/><br/>Overall, Iso Racing offers a fun and challenging racing experience that is both nostalgic and modern. Its emphasis on strategy and customization sets it apart from other arcade-style racing games, and its online multiplayer mode offers endless replayability for those looking to compete against other players around the world.", "metacritic": null, "released": "2022-10-25", "tba": false, "updated": "2023-05-15T02:56:44", "background_image": "https://media.rawg.io/media/screenshots/f6d/f6decf6753af8621281cc2ae1fe16acb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["rethuna", "Pogo Concepts"], "genres": ["Action", "Sports", "Racing", "Casual"], "publishers": ["Pogo Concepts"], "esrb_rating": null}