{"id": 87242, "slug": "city-taxi-car-driver-simulator", "name": "City Taxi Car Driver Simulator", "name_original": "City Taxi Car Driver Simulator", "description": "We assume that you're crazy about extreme modern crazy car games as well. If so, this modern taxi crazy game is what you need! Try to become a crazy taxi challenging driver in one of the best taxi simulator. Race crazy classic cars through the big city traffic. Pick and drop passengers into crazy car taxi and accept the challenging levels. Show how fast you are. Life in bigcity is crazy, watch out for the people and the traffic.<br/>You can drive around the realistic designed big city environment, streets, construction sites, parks and even the highways. It's crazy how the city lives - people are walking, cars are crossing. Get in to your taxi, fasten your seat belts and become a city traffic rental racer. City taxishuttleauto driver super simulation 2018 pick &amp; drop game is for classicamazing taxi drivers.Improve your driving skills in urban environment.<br/><br/>This is the easy taxi cab driver 3d city speedy crazy rider game. You take charge of a taxi and your mission is to get your passengers to the destination in the fastest way possible. You will get a very realistic feel of the big city as the traffic that you would have to navigate through will be highly detailed in this real drift taxi. Download this endlesssuper cab racing game in the amazing city environment.<br/><br/>FEATURES:<br/>•\tRealistic City Environment<br/>•\tAmazing Cars.<br/>•\tRealistic Traffic<br/>•\tAwesome Graphics<br/>•\tFree To Play", "metacritic": null, "released": "2018-06-17", "tba": false, "updated": "2019-10-22T14:08:41", "background_image": "https://media.rawg.io/media/screenshots/7ec/7ecb8ec2a5f360ebef7c6ef6c8c8b659.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Richard Allen"], "genres": ["RPG", "Racing"], "publishers": ["Richard Allen"], "esrb_rating": "Everyone 10+"}