{"id": 872508, "slug": "angel-fall", "name": "Angel Fall", "name_original": "Angel Fall", "description": "<p>     The war for earth is lost...Hell has come for all and none remain to be save. You stand on the edge of the  abyss, having let so many go before you, while you held the great enemy at bay. Now, finally your time has come, to once again bask is the light of heaven.  Will you find the strength to make this last climb? So many wounds endured, so many allies lost. Yet you must try! Do not let despair take you, your fallen comrades will help lift you higher, do not let them have died in vain!</p>\n\n<p>Angel Fall is a solo project for the ScoreSpace #22 Jam Game with the theme of FALLING</p>\n<p>     Fly your way past devils and falling meteor to reach the heavens above. Along the way pick up your fallen comrades lost spirts to bluster your own. You will find brief respite atop the clouds, and little peace in these skies. But do not think your are without help. Seek the shining halos gifted from the ONE above. </p>\n\n<p>Controls:</p>\n<p>A and D to move Left and Right.</p>\n<p>Space bar to Fly higher - requires 1 Strength.</p>\n<p>Your remaining Strength is at the bottom on the screen. </p>\n<p>Fallen spirts will give you 1 Strength each.</p>\n<p>Devils spears with take away 1 Strength.</p>\n<p>Colliding with a meteor OR a devil will lose you all of your Strength.</p>\n<p>Clouds will let you regain 3 Strength, but they fade fast.</p>\n<p>Halo rings will quickly lift you up! </p>\n\n\n<p>Don't forget to leave a comment if you played! And feel free to check out my profile for my other games!</p>\n\n<p>I end up using some sounds effects from the </p>\n<p>Magic Spells Sound Effects Asset from Cafofo, I have used it several times and love it!</p>\n<p>Cafofo</p>\n<p>https://assetstore.unity.com/packages/audio/sound-fx/magic-spells-sound-effects-...</p>", "metacritic": null, "released": "2022-10-24", "tba": false, "updated": "2022-10-28T13:59:04", "background_image": "https://media.rawg.io/media/screenshots/f79/f796071cceee2962672b808bd24b3598.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["RoughGames"], "genres": [], "publishers": [], "esrb_rating": null}