{"id": 872573, "slug": "tv-show-finale", "name": "TV Show - Finale", "name_original": "TV Show - Finale", "description": "<p>This is a story about an alternative world featuring dragons, unicorns, canine-like creatures called kishunimaras, demons, and deities that is presented as the first draft of a screenplay by a struggling writer in a post-modern way. Here are my thoughts and intentions for various characters within the story.<br/></p>\n<p><strong>Telia - </strong>The final appearance of Telia features her attaining all of the success and power she ever wanted after the death of King Priapism, her former mentor. The cost of that power and success was that she can no longer communicate with anyone. I came up with the idea after watching a bunch of influencers and content creators on social media who can’t seem to go five minutes without pointing out how stupid they are, how powerless they are, and how depressed they are. The responses in the comment sections seem to vary from “OMG, that’s so relatable,” to long-winded essays that are supposed to be about how sympathetic the commenter is to the influencer they have a parasocial relationship with, but end up actually being a way for them to vent about their own frustrations with their life and gain validation from the community or the influencer.\r\n</p>\n<p>I was thinking about how influencers who don’t constantly tell the world how miserable they are and present themselves as being happy and fulfilled aren’t seen as relatable, and at worst are seen as being deceitful. As Ethan from H3H3 Productions said “Those kinds of lifestyles you see people presenting online don’t exist. No one is happy, everyone is miserable. If you say you’re happy, you’re lying.”\r\n</p>\n<p>That’s what Telia represents. When she was miserable she was relatable, when she gained power she became unrelatable and no one could understand what she was saying. Not only that, but they looked at her with suspicion, as though she must be doing something evil with her newfound power and that her happiness couldn’t be real, she must have some kind of evil plan.\r\n</p>\n<p><strong>King Priapism - </strong>Honestly, I had a wildly different plan for Priapism and this story in general. But, as I was writing this story I accidentally told my step-mom that I had attempted suicide almost five years ago. Her response was to call me crazy, to claim that I shouldn’t be blaming her for my attempted suicide (I wasn’t blaming her, I was blaming myself), and to send me mean TikTok videos of boomers complaining about “Soft-ass kids.”\r\n</p>\n<p>Honestly, the fact that Priapism is Greed’s dad made me rethink the story and how I wanted it to go because it was something that was always on my mind. Throughout my entire life people told me how my step-mom was evil, weird, and only cared about herself and the image she presented to the world, and she always secretly hated me because I was a threat to that perfect public image. Greed represents my sister who knew that all along, and Dusk represents a little girl who sees her teacher as a good person who learns through an act of callousness and cruelty how evil her mentor actually is, then, she becomes evil herself, which I feel is what happened to me. I feel sick, and I feel like there’s no path to becoming ‘normal’ now, so I might as well be evil and happy, like Dusk when she decides to use her incredible power to turn her own adopted mother into her love slave. I don’t think the interpretation should be that I want to make my stepmom into a love slave like Dusk did, it’s more that I wanted to write about a young girl seducing her mother because that fictional scenario arouses me. Like Dusk at the end of the story I was like “Yeah, I don’t care if you guys think this is bad. This is the story I want to write, and this is how I want to write it, and if you don’t like it I don’t care, I’m the one with the power here.”\r\n</p>\n<p><strong>Skycloud - </strong>If you’ve ever wondered why so many young white males are gravitating towards people like Andrew Tate and internet personalities like Doomcock when left-wing ideologies are so much smarter and more compassionate, you only need to sit through a Munecat video and a Doomcock video, then note the differences in how they treat their audience.\r\n</p>\n<p>Doomcock posts multiple videos and livestreams every week, while Munecat posts a single video every 3-4 months and, as far as I know, doesn’t livestream. Doomcock begins every one of his videos with a warm “Greetings, my friends,” while Munecat seems to dislike her audience to the point where she’s just as likely to insult them in her videos as she is her targets.\r\n</p>\n<p>What I’m saying is that I think that people on the left feel like they are morally and intellectually superior to their audiences and to people that disagree with them. More-or-less, they feel like because they read an essay about a specific topic that was written by a gay African woman, that means that their position is correct in every possible way because gay African woman are obviously the smartest people on every topic (gay African men as well, judging by the Alt-Right Playbook series), and if you don’t agree with them you’re an idiot that only disagrees with them because they’re too stupid to have the correct opinion, therefore all they need to do to make you agree with them is to educate you. Basically, they act unironically like the college girls in Fritz The Cat.\r\n</p>\n<p>The point I’m crawling towards is that validation is important and valuable. It doesn’t matter if your intentions are good or if you’re actually smarter and/or more moral, unless you provide validation when you’re trying to convince people that you are the voice of reason that deserves to be listened to. Essentially, if you’re the writer of She-Hulk and you insult Doomcock, as well as all of the online trolls, they’re going to take Doomcock’s side on the issue regardless of whether or not he’s right or wrong because he provided his audience with validation, and the She-Hulk writers made a clear statement that they refuse to provide their fans with validation because they don’t think that they deserve it.\r\n</p>\n<p>I think that the core difference between the left and right, the woke and unwoke, is how they distribute validation. For the left it feels like they treat validation as though it’s a treat that they give to people when they’ve been good, which is why left-wing creators generally publish videos relatively infrequently, whereas right-wing, or even centrist creators, treat validation as though it’s something that can, and should, be given out as frequently as possible.\r\n</p>\n<p>The problem is that denying validation is like denying people water and food unless they earn it. I personally believe that the reason why the left generally seem weirder than the right is because it’s easier to get validation if you lean right or are a centrist than it is to get validation on the left. So, if you choose to be on the left you’re either going to be starving for validation or drowning in validation to the point where you feel overwhelmed (which is what leads to Youtube burnout even if a creator posts infrequently), whereas if you’re on the right the consistent trickle of validation makes you not even consider the possibility of what it would feel like to have no validation at all. That’s why left-wing people seem to be either constantly seeking attention or retreating away from the possibility of gaining attention because they feel smothered by the attention they receive. It’s also why you hear right-wing people and centrists seem so apathetic towards validation, as though they take the validation they regularly receive for granted and legitimately don’t understand how important validation is, and how it contributes to their mental health.\r\n</p>\n<p>Skycloud starts off like a lot of people in Vancouver, on the streets, addicted to drugs, and feeling like he doesn’t have a place in the world. All it took to turn his life around was a friend named Greed that accepted him, involved him in his life, and provided him the validation he needed as well as a place in the world where he belonged.\r\n</p>\n<p>What I was trying to say with Skycloud is that, no, left-wing moralists, educating people about the homeless problem in Vancouver exists isn’t going to solve it, what will solve it is providing a pleasing alternative to being homeless. If given the option of living on the streets with access to drugs and a community that provides validation freely, or the cold one-room shelters run by left-wing people who treat you more like a pet than a person and don’t want to spend time with you unless they’re being paid, most people will choose to sleep on the street.\r\n</p>\n<p>I think that if you see a bunch of people joining a cause or group that you don’t agree with, or think is outright evil, because they offer free candy, if your first instinct to sway people away from that cause or group isn’t to offer them free candy but to explain why people shouldn’t want free candy, you might not be educating people, helping people, or saving the world. You might just be a person who doesn’t want to share their candy.\r\n</p>\n<p>Edit: My friend said this:\r\n</p>\n<p>I'm still reading it but your message within Skycloud... About how the Left wings are stupid, so is the right wings. Can't be smart without the head.\r\n</p>\n<p><strong>Sir Phobos and Sugar - </strong>Part of the reason why groomers and MAPS are so prevalent online is a belief that it’s possible for a 15-year-old girl to be just as mature as an 18-year-old girl, and to deny that incredibly mature 15-year-old girl the opportunity to have sex with a 30-year-old man, or more often, a 20-year-old man, is irrational. My point of view on that hypothetical situation is that if you honestly believe that a 15-year-old acting as mature as an 18-year-old is actually as mature as an 18-year-old, you must not know anything about teenagers, or kids, at all, because a big part of being a teenager is thinking, and acting, more superficially mature than you actually are.\r\n</p>\n<p>I suppose Sir Phobos and Sugar’s relationship was meant to depict a deliberately skewed view of a grooming situation where the young Disney princess spends her teenage years and early adult years grooming her father-figure until she finally makes him ready to cross some very taboo boundaries with her. I honestly don’t have too many strong feelings about their relationship because it wasn’t my idea, it was a friend of mine’s idea. She said that when she was a teenage girl she fantasized about a mature 40-year-old man thinking that she’s pretty enough, and mature enough, to marry, and then they would live happily ever after together.\r\n</p>\n<p>Typing this out now, I’m realizing that I don’t think I’ve ever known a teenage girl who actually wanted a relationship with the 20-year-olds and 30-year-olds they ended up in relationships with, they either wanted someone closer to their age or older, like the 40-year-old I mentioned earlier. I think they just settled for a younger 20-year-old because their dream man wasn’t interested in a teenage girl in the same way that I think that teenage girls don’t interest me at all because I see them as being childish in a way that I’m not. Like, I was listening to Clownfish Tv’s Pinky Boo talk about how Monster High is a show with universal appeal and I was rolling my eyes thinking “Wow, that’s exactly what I would have said back in the day about Skunk Fu. I wonder if she’ll listen to herself ten years from now and feel embarrassed about saying that?”\r\n</p>\n<p>In any case, I was trying to present a theoretical wholesome scenario of a much older man falling in love with a younger girl who loves him just as much as he loves her, and there not being much more to their story than that. To make it more interesting for me, I added in some backstory for Sir Phobos throughout the screenplays, as though he lived a full lifetime with relationships, intrigue, and accomplishments long before Sugar ever entered into his life. He is a character with vast cosmic importance, but that importance is mostly unknown to him, and someday he’ll die without ever fully understanding how important he is.\r\n</p>\n<p>Sugar is, honestly, a mess. She can’t function without Sir Phobos in her life, and she self-destructs almost immediately when he is comatose and nearly dies. Basically, she can claim to be as mature as she wants, but the reality is that she isn’t very mature at all. Just because she can beat up criminals and has the responsibilities of raising a child, as well as having a job, doesn’t mean that she’s mature enough to not throw her life away, including her child, when her loverboy ‘dies’.\r\n</p>\n<p><strong>Pekips - </strong>I don’t know what to say about Pekips other than I think that his storyline reminds me of something that George Lucas would write back in his weirder days. He died and his husband brought him back to life, but changed him to make him into his ideal lover. His husband dies and an imp offers him the chance to bring back his lover and change him into his ideal lover. It’s like poetry, it rhymes.\r\n</p>\n<p><strong>Saffire - </strong>This storyline is just really dark, disturbing, creepy, and gross. I think it’s the perfect storyline for the internet age because I could see it inspiring a lot of debate and video essays. It isn’t really ‘shocking’ in the way that a storyline like this would normally be presented, it’s just kinda sad, and the characters involved are unsure of how to react to it aside from Sugar, who’s absolutely furious but has mixed feelings about it. She lost her mother, but because of her suffering all of her dreams came true, is that a price that she’s comfortable to have paid?\r\n</p>\n<p><strong>Ekips and Manko - </strong>These two represent in-universe what I believe is the future of the workplace, at least in North America. The thing about work is that people need to be motivated to do work, that’s why people are paid to do work. But, as we move forward it seems as though companies are claiming that it isn’t their responsibility to motivate workers, it’s the responsibility of their workers to motivate themselves.\r\n</p>\n<p>What I think is going to happen eventually is that companies are going to motivate their workers not by offering money, but by offering them free sexual acts at work. Essentially, if you do all the work that is assigned to you during your workday, you can call up a sex worker to do something with you. My belief is that normal sex, like missionary position or blowjobs, will quickly become dull and that the workers will instead either indulge their stranger fetishes that they can’t indulge in elsewhere, like feet fetishists, or they’ll seek out more intimate sexual activities from their partners, like Ambrosia wanting Manko to act like a baby while she cradles her.\r\n</p>\n<p>Manko and Ekips mostly disappearing from the story is mostly a very subtle jab at the tendency of television shows to completely change their focus and forget about characters that originally seemed like they were going to be more important to the series in favor of more interesting, deep, and/or more gimmicky characters, or simple using the newfound freedom that diminishing interest in animation gives them to indulge their fetishes.\r\n</p>\n<p><strong>Candy - </strong>The thing about Candy is that I always hated her because a developer said that they would give me a shout-out if I included a bunny character, so I did but I never got the promised shout-out. I never really stopped associating the character with negativity after that.</p>\n<p>Anyways, my next project will be a manga-influenced comic. Email me at dragyndev@gmail.com and I can send you some panels of the comic, if you're interested.</p>", "metacritic": null, "released": "2022-10-24", "tba": false, "updated": "2022-10-28T14:26:25", "background_image": "https://media.rawg.io/media/screenshots/aa7/aa768e3a890f022245c8bca68b3d21c7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Weird420XL"], "genres": [], "publishers": [], "esrb_rating": null}