{"id": 8725, "slug": "dungeon-heroes-the-board-game", "name": "Dungeon Heroes: The Board Game", "name_original": "Dungeon Heroes: The Board Game", "description": "Praise for Dungeon Heroes the board game:<br/> “It is definitely a strategy game that is surprisingly thought provoking in the variable actions to be taken. It is harder than you’d expect and deliciously fun. “ – David Lowry<br/>“This is a game that really keeps on giving. It has a wealth of interesting strategic and tactical options for both sides.” – mechanicalgamer.com<br/>“There is a great ebb and flow to the game, where you think things are going very poorly for you, but then you discover a solution and see a way to seize victory.” – Blue Steel, BGG User Review<br/><br/>Description:<br/>Enjoy the captivating app experience of the popular, and award winning board game, Dungeon Heroes! Experience cunning head-to-head competition with a friend, local or online, in the Classic Game. Or, descend into deeper dungeons, honing your heroic skills, in the addictive Arcade Game! <br/><br/>Dungeon Heroes: Classic Game, is a roguelike strategy game of tile-laying, bluffing, and deduction. Two players compete head-to-head, one cleverly crafting a dungeon and the other courageously controlling a band of heroes who must explore it. The Dungeon Player skillfully chooses where to position monsters, set traps and hide treasures, while the Hero Player must unravel this scheme by tactically countering it with special abilities split across four dungeon hero archetypes.<br/><br/>Dungeon Heroes: Arcade Game, is an addicting solo play marathon. You control the band of heroes delving through randomly generated dungeons. Experience all the great content of the Classic Game while accruing points, mastering party synergy, and seeing just how far you can make it in the gauntlet! <br/><br/>Awards:<br/>Best 2 Player Game of 2013 – Club Fantasci Board Game Awards<br/><br/>Features:<br/>• Official Dungeon Heroes game with original artwork<br/>• Universal App – Buy once, play on iPad and iPhone<br/>• Two Player Pass ‘N Play<br/>• Game Center Multiplayer<br/>• Single Player Arcade Mode (Randomly Generated Dungeon)<br/>• Single Player High Score Tracking<br/>• Original Soundtrack<br/>• Voice Acting<br/>• Tutorials to guide players through their first game<br/>• Easy to read rulebook<br/>• Asynchronous Multiplayer<br/>• Retina display support", "metacritic": null, "released": "2014-06-22", "tba": false, "updated": "2019-10-22T14:30:04", "background_image": "https://media.rawg.io/media/screenshots/9a2/9a20f4e762eae843f87b4e8fdb095abd.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Gamelyn Games"], "genres": ["Adventure", "Board Games"], "publishers": ["Gamelyn Games"], "esrb_rating": "Teen"}