{"id": 872645, "slug": "project-sweet-serve", "name": "Project Sweet Serve", "name_original": "Project Sweet Serve", "description": "Game Info:\r\n<p>Project Sweet Serve is a active match 3 game with a unique twist from the restaurant simulator genre. Grab blocks of the matching color and combine them, later serve those blocks to the orders. This game is made in 3 days for the Touhou Fan Game Jam 9. The theme is \"Ghost and Goblins\". The game currently is still under work in progress, at this currently moment the game features an infinite highscore chasing arcade mode with 4 difficulty levels. In the future we are planning to add a story mode. So expect future content updates soon.</p>\r\n\r\nThe Story\r\n<p>Halloween is coming close, you know what that means? It's trick or treat time. Knowing this is coming Alice has prepared a spell that can mass produce a lot of sweets efficiently... to efficiently. Apparently there seems to be  a malfunction on the spell and now it can't stop generating candy. While this is happening there are a lot of visitors came to her house as well. Ghost and Goblins... not the patient type. With that Alice might as well kill  birds in one stone, by serving the never ending candy supplies to her visitors while making sure the candy does not pile up too much. As always it's Shanghai who is the one doing all of the dirty work. </p>\n\r\nControls:\r\n\r\n<ul><li>Z: grab item into your inventory\r\n</li><li>X: serve customers when applicable\r\n</li><li>A; switch target customer to serve when applicable\r\n</li><li>C: hold to trash your inventory\r\n</li><li>Space: force a row of blocks to drop\r\n</li><li>left/ right: move around, you'll loop around the boundary\r\n</li></ul>\n\r\nRules and Mechanics:\r\n<ul><li>Press Z to grab blocks from the bottom row of the board.</li><li>Blocks will be stored in your inventory, you only have limited amount of space so be mindful of what you grab.</li><li>3 of the same colored blocks will be combined to a tier 2 blocks, this can help reducing your block count.</li><li>If your inventory is full, you can simply recycle them by holding the C key, however it takes time and it puts all your blocks in your inventory back to the board as tier 1 blocks.</li><li>Orders are on the right, to serve them first you need to have the require blocks in your inventory, then press X to serve. you will serve your entire inventory.</li><li>If you have more than one orders you can serve (valid orders have a green check-mark to highlight it), you can press A to switch your target customer to serve. </li><li>Once an order is served, you will gain points and that order is refreshed. excess blocks served will be converted into bonus points.</li><li>When you completed an order, your combo goes up which multiplies your score. You can keep building up combos by completing orders in a quick succession. It lasts for 10 seconds until it resets back to 1.</li><li>Do not let the blocks filled up to the top of the board or expire an order by letting it's timer run out, you will lose the game in either of these ways.</li><li>There is no win condition and blocks spawn faster over time. Let's see how long you can last and earn a new highscore! (Story Mode with winning conditions coming soon)</li></ul>\n\r\nCredits:\r\n<p><strong>Dev Team:</strong></p>\n<ul><li>Iced_Lemon : Programming, Art</li><li>GhostlyFeline: Soundtrack, SFX</li><li>Zinchromium: Soundtrack</li><li>CYCzen: Background Art</li></ul>\n<p><strong>Playtesters:</strong></p>\n<ul><li>SpooKoArts</li><li>CrazySilver<br/>\n</li><li>MegaPig9001</li></ul>\n\r\nCurrently Known Issues:\r\n<ul><li>Visual glitches of blocks can be triggered by certain frame perfect actions, they are minor however, does not affect the gameplay functionality and easily reseted.</li><li>The game is known to consistently glitch out in a particular running environment, if this happens to you do report to the devs.</li><li>The Combo UI is glicthing out.</li><li>Rest of the builds coming soon</li></ul>\n\n<p>Disclaimer: Touhou Project original concept, characters, and other elements are the property of ZUN and Team Shanghai Alice. This game is a fan made work and is not affiliated with or endorsed by the original creators. Please support the official series. Wiki: https://en.touhouwiki.net/wiki/Touhou_Wiki<br/></p>", "metacritic": null, "released": "2022-10-24", "tba": false, "updated": "2022-10-28T14:58:57", "background_image": "https://media.rawg.io/media/screenshots/82a/82a11e2eac7f46c54e9218a76e83b16c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Iced_Lemon"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}