{"id": 872728, "slug": "mine-sweeper-ready-set-duck", "name": "Mine Sweeper Ready Set Duck", "name_original": "Mine Sweeper Ready Set Duck", "description": "Get Ready... Get Set... Duck!?\r\n<p>Enjoy classic minesweeper game play and lead your duck troops to victory by finding and flagging all the scary dogs on each of the 14 levels.<br/></p>\n<p>Collect power ups unique hazards as you race to complete each board as fast as possible.</p>\n<p>No ducks were harmed in the making of this game.</p>\r\nRULES\r\n<p>Winning a level is simple. Flag every grass tile with a hidden dog. How do you find hidden dogs? Every tile that's flipped over will have a number indicating the number of adjacent tiles that are hiding dogs (tile with 0 are drawn as blanks). Use the surrounding numbers to deduces where all the dogs are hidden. If you find them all, you win! But be careful, if you flip a tile with a hidden dog *BARK BARK!!* you'll be toast.</p>\r\nCONTROLS\r\nIn Game\r\n<p>Right Mouse Button/ Shift + Left Click - Place a flag</p>\n<p>Left Click - Flip a tile / Click a button</p>\n<p>Left Click + Right Click - Flip all adjacent, un-flagged tiles (only works when the correct number of adjacent tiles are flagged)</p>\n<p>Left Click + Drag - Pan the screen around</p>\n<p>W/A/D/S - pan the screen around extra quick</p>\r\nWorld Map\r\n<p>Left Click - Move to a level/Click a button</p>\r\nPOWER UPS\r\n  shuffle the dog to new tiles, dogs can only be moved to un-flipped tiles A hand full of tiles will become 'soaked'. Soaked tiles will  never hide dogsThe next dog you accidentally uncover will be distracted by your bone and your game won't end.When using this power up you'll be able to select a numbered tile.  If possible 1 mine will be removed on an adjacent tileWhen using this power up you'll be able to select an uncovered tile. The number on that tile will go up by 1 and an adjacent safe tile will have a dog added to it.When you blow this whistle dog's cant resist. Use it to reveal one hidden dog on the playing field.The only thing scarier then a dog is a grumpy cat. Use this power up to scare one of the dogs off the board.\r\n HAZARDS\r\n Play fast because your flags will only stick around for so long before they fade away. Fortunately, if you flip all the save tiles you'll win, even if all the flags are gone.Frozen tiles are stuck tight and can't be flipped. Flip adjacent tiles to help de-ice them.These tiles are locked up tight and can't be flipped. Flip tiles anywhere else on the board to help unlock them.<p>The code for this game is public. You can view it here https://github.com/bjatkin/minesweeper</p>", "metacritic": null, "released": "2022-10-24", "tba": false, "updated": "2022-10-28T15:33:52", "background_image": "https://media.rawg.io/media/screenshots/87b/87b07028c5ac22a32d2ca502dcc5220b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Aanval"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}