{"id": 872719, "slug": "aviary0", "name": "aviary[0]", "name_original": "aviary[0]", "description": "<p><em>aviary[0]</em> is The Aviary's first, untitled game project. It will eventually be assigned a title that is...you know, imaginative.</p>\n<p>The game is being released continually as development milestones are reached, so the community can provide guidance on its progression at every step.</p>\n<p>The game is -- will be -- a first-person narrative adventure. The current build provides an initial version of the play environment -- a stretch of forest inspired by the forests of the American Pacific Northwest.</p>\n<p>In the final game,  the player will embody a young adult searching for the whereabouts of their estranged father. To aid in this task, they will be equipped with a piece of experimental technology that allows them to explore their father's memories and uncover the answers to a variety of intertwined questions -- where is the father? Does he even want to be found? Why are they estranged? What is this memory-reading technology in the player's possession, and how did they come to have it?<br/></p>\r\nYour Thoughts/Input\r\n<p>Development is in early days, and all types of feedback are welcome. What areas are appealing? What areas are distracting or of low quality? One of the goals is for the forest to be a calm and welcoming space -- is that working? Are you encountering bugs? Is game performance poor (spoiler: probably yes? optimization has definitely not been addressed and is on the roadmap)?<br/></p>\n<p>Being a first project, this is as much a learning endeavor as it is a production endeavor -- all forms of guidance, reaction, and input are encouraged. Thanks in advance for taking the time, I truly appreciate it!<br/></p>\r\nControls\r\n<p><strong>WASD</strong> - Character movement</p>\n<p><strong>Mouse movement</strong> - Head control</p>\n<p><strong>Left Shift</strong> - Sprint</p>\n<p><strong>Space</strong> - Jump</p>\n<p><strong>Esc</strong> - Pause<br/></p>", "metacritic": null, "released": "2022-10-24", "tba": false, "updated": "2022-10-28T15:30:30", "background_image": "https://media.rawg.io/media/screenshots/b37/b37097effce13bb8cbc41045bfa41ade.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Aviary"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}