{"id": 872824, "slug": "my-house-is-haunted", "name": "My House Is Haunted", "name_original": "My House Is Haunted", "description": "“My House is Haunted” is a five player horror game in which one of the players will act as a ghost and the four players will investigate what type of ghost it will be and protect the whole family. A family of npc who is the owner of the house, asked a group of Exorcists to identify and eliminate the ghost. The ghost will have to kill all the npcs to win.<br/><br/>\"My House is Haunted” is created for a group of friends, streamers, or an individual who enjoys the thrill of identifying the ghost. As a creator I hope that Vtubers would collaborate and enjoy playing this game.<br/><br/><ul><li> <strong>Play as Exorcist: </strong> Select a class in which role you want to play. On Exorcist side you can play as Paladin, Priest, Cardinal, Bishop.<br/></li><li> <strong>Play as a Ghost: </strong> There are four type of ghost. You can select White Lady, Nanggal, Headless Priest, Oni.<br/></li><li> <strong>Multiplayer: </strong> Play alongside your friends with up to 5 players in this co-op/pvp horror where your role play a huge part of your victory.<br/></li><li> <strong>Investigate: </strong> If a family member dies, it will leave a clue on how to deal with the ghost and what type of ghost you will be fighting. (Future Update)<br/></li><li> <strong>Voice Chat: </strong> Use your Mic for Proximity voice chat, but be careful because the ghost could be listening too. (Future Update)<br/></li><li> <strong>Strategy: </strong> As a ghost, plan a different way to kill the individual member of the family or player.</li></ul>", "metacritic": null, "released": "2022-10-28", "tba": false, "updated": "2022-10-31T03:22:49", "background_image": "https://media.rawg.io/media/screenshots/f69/f6948d8964816a111ab0e45b4552c367.jpg", "website": "https://pogudesu.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pogu Desu"], "genres": ["Indie"], "publishers": ["Pogu Desu"], "esrb_rating": "Adults Only"}