{"id": 87293, "slug": "911-emergency-ambulance-driver-duty-fire-fighter-t", "name": "911 Emergency Ambulance Driver Duty: Fire-Fighter Truck Rescue", "name_original": "911 Emergency Ambulance Driver Duty: Fire-Fighter Truck Rescue", "description": "Join the 911 emergency department and work in hospital paramedic staff to serve injured in crisis situations. Play Ambulance Rescue Helicopter, newest 3D driving and Parking simulator game.<br/><br/><br/>Turn on rescue sirens of firefighter truck and rush to extinguish fire and save wounded patient. As emergency ambulance driver show your pro driving skills and drive vehicle to hospital. Drive as fast as possible through city traffic to reach the accident scene on time. Avoid car accidents while driving fast on slippery roads of huge 3D city. Fly ambulance helicopter over tallest buildings and rescue civilians. Accept courageous job of ambulance helicopter pilot and prepare to tackle any natural disaster. Enjoy playing the multiple roles of hospital paramedic staff as ambulance duty driver, real helicopter pilot and a fire-fighter truck.<br/><br/><br/><br/>Key Features of 911 Rescue Ambulance:<br/><br/>Ground breaking firefighter, ambulance rescue and helicopter flying missions<br/>Real world emergency situations in massive 3D city<br/>Realistic auto physics controls for smooth driving &amp; parking<br/>Fire truck siren sounds and lights with AI traffic<br/>Console quality 3D graphics for immersive touch", "metacritic": null, "released": "2016-09-09", "tba": false, "updated": "2019-10-22T14:31:37", "background_image": "https://media.rawg.io/media/screenshots/03a/03a10762ef9d32c106d7d4aab89c1cea_c4h3dYt.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Simulation", "Racing"], "publishers": ["Techving"], "esrb_rating": "Mature"}