{"id": 87305, "slug": "multi-level-sports-car-parking-simulator-2-auto-pa", "name": "Multi-Level Sports Car Parking Simulator 2: Auto Paint Garage & Real Driving Game", "name_original": "Multi-Level Sports Car Parking Simulator 2: Auto Paint Garage & Real Driving Game", "description": "This is a sequel to Multi Level Sports Car Parking Game. Play the most realistic auto parking game and customize cars with your favorite colors. Park cars at multi storey shopping mall. Steer racing cars on multiple floors like a pro driver at shopping plaza.<br/><br/>Enjoy multi-level parking game and improve your driving skills. Reverse parking require high precision and accuracy. Race cars on the ramp; Cross hurdles and avoid obstacles. For a perfectly parked car you should have a great control on accelerator and brake pedals. Search for the vacant parking space while steering luxury vehicles on multi storey shopping plaza. Enter the supermarket shopping plaza for car paint job. Maneuver wheels carefully and avoid crashing. After the paint job, drive out of the car garage; enjoyMulti Storey Car Parking 2016 game.<br/><br/>Newest Game Features:<br/>10 challenging car park missions<br/>Unique Shopping Mall Parking Areas<br/>Customize cars with favorite colors<br/>Multiple Furious Muscle Car Selection<br/>Auto &amp; Manual Gear modes<br/>Smooth controls &amp; realistic driving physics<br/><br/><br/>Kindly give us your feedback in the reviews section so that we may improve our game in future releases.", "metacritic": null, "released": "2016-07-15", "tba": false, "updated": "2019-10-22T14:20:41", "background_image": "https://media.rawg.io/media/screenshots/40f/40f343a264f465c533e4ea6d727c8fa3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Techving"], "genres": ["Simulation"], "publishers": ["Techving"], "esrb_rating": "Everyone 10+"}