{"id": 873330, "slug": "flambi", "name": "Flambi", "name_original": "Flambi", "description": "<p>Flambi es una pequeña llama cansada de vagar por el cementerio donde su alma está atrapada, está dispuesta a enfrentarse a los espíritus malignos que lo atan pero… ¿Por qué este tormento?. En ciertos países existe la creencia de que los fuegos fatuos aparecen por debido a que el espíritu tenía un pecado que le impedía avanzar al otro lado.</p>\n<p>¿Qué pecado ha podido cometer Flambi que le impida avanzar al otro lado? Para descubrirlo deberá encontrar su cuerpo y encontrar la redención.</p>\n\n<strong>Nick</strong><p> <strong>Nombre</strong>\n</p><p> <strong>Desempeño</strong>\n</p> <p> \t\t\tSora13KHa\r\n \t\t\r\n \t\t</p><p> \t\t\tFrancisco Javier Carrasco Gallego\r\n \t\t\r\n \t\t</p><p> \t\t\tArte y animaciones\r\n \t\t\r\n \t</p> <p> \t\t\tZeroToGame\r\n \t\t\r\n \t\t</p><p> \t\t\tVíctor Reverte Gómez\r\n \t\t\r\n \t\t</p><p> \t\t\tprogramacion\r\n \t\t\r\n \t</p>\n\r\nControles\r\n\r\nRecursos\r\n<p>\n</p>\n<p>1.  Sprite:</p>\n<p>- Los sprite se realizaron a mano por el miembro Sora13KHa, influenciado<br/>por el estilo de “Tim Burton” y “Neil Gaiman”<br/>2. Música:<br/>- Canción DRM FREE, adquirida en “FANATICAL”, libre de uso.<br/>3. SFX:<br/>- Archivos de audio adquiridos en “PIXABAY”, con licencia en la misma,<br/>pero libre de regalías para usar en contenido con fines comerciales o no<br/>comerciales.<br/>4. Tipografía:<br/>- Descargada de dafont, “Creepy Pumkin”<br/>- Enlace: Creepy Pumkin</p>\r\nLore, Historia y elementos\r\n\n\n<p>\r\nFlambi es una pequeña llama cansada de vagar por el cementerio donde su alma está\r\natrapada, está dispuesto a enfrentarse a los espíritus malignos que lo atan pero... ¿Por\r\nqué este tormento?. En cierto países existe la creencia que los fuegos fatuos aparecen\r\ndebido a que el espíritu tenía un pecado que le impedía avanzar al otro lado.\r\n¿Qué pecado ha podido cometer Flambi que le impida avanzar al otro lado? Para\r\ndescrubrilo debera encontrar su cuerpo y encontrar la redención.</p>\n\r\nJubalidad\r\n\n<p>\r\nFlambi consiste en aguantar el mayor tiempo posible evitando consumir la\r\nllama que te rodea.\r\nFlambi puede expulsar fuego para apartar las llamas corruptas que\r\nintentarán convertirlo y consumir su luz, la cual puede ser restaurada con\r\npequeños fragmentos de almas\r\n</p>\r\nFragmento de Alma\r\n\n<p>Pequeños fragmentos de almas errantes que fueron consumidas,\r\nEs una pena que ahora solo puedan usarse para alimentar la luz de otras\r\nalmas pero al menos permitirán que otras tengan una segunda oportunidad.\r\nAhora solo les queda un pequeño atisbo de luz que puede ayudar a otros a\r\navanzar y brillar por sí mismos.</p>\r\nFuego Fatuo\r\n\n<p>\n</p>\n<p>El poder principal de Flambi, capaz de lanzar un fuego fatuo y apartar a las\r\nalmas corruptas que lo acosan</p>\r\nAlmas corruptas\r\n\n<p>Almas que han perdida toda la humanidad, sucede al alimentarse demasiados\r\nfragmentos de almas y acosan a otras para seguir absorbiendo su luz</p>", "metacritic": null, "released": "2022-10-30", "tba": false, "updated": "2022-10-31T07:02:24", "background_image": "https://media.rawg.io/media/screenshots/fd1/fd111a9b33aed864d8e233b206510e0f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["zerotogame"], "genres": ["Action"], "publishers": [], "esrb_rating": null}