{"id": 873410, "slug": "ramiro-el-vampiro-iii", "name": "Ramiro el Vampiro III", "name_original": "Ramiro el Vampiro III", "description": "<strong>RAMIRO, EL VAMPIRO: EN EL BOSQUE DEL SUSPIRO</strong>\n<p><strong>CRÉDITOS / CREDITS</strong></p>\n<p>Juego / Game: The Mojon Twins<br/>Portada / Cover: na_th_an<br/>Música / Music: Davidian (Murciano)<br/>Gráficos / Graphics: na_th_an and anjuel<br/>Testers: Mojonia, Javier Quero, anakintf, runplot y Alfonsico Presley</p>\n<p>ZX SPECTRUM VERSION: Powered by MK1 by the Mojon Twins and splib2 by Alvin Albrecht</p>\n<p>AMSTRAD CPC VERSION: Powered by MK1 PSTCRA by the Mojon Twins, Cprslib by Artaburu and WyzPlayer by Wyz\r\n</p>\n<p><strong>Historia / Story</strong>\n</p>\n<p><strong>Ramiro</strong> está haciendo las paces con su <strong>Hija Canija</strong>. Para caerle mejor, le deja que invite a su amiga <strong>Dotty Caraortiga</strong> para una fiesta de pijamas. Las niñas se lo están pasando bomba haciendo playbacks de <strong>Rick Astley</strong> y colgándose de las lámparas, pero pronto les entra hambre y bien se sabe que lo mejor para las vampiras adolescentes es una buena ración de <strong>setas sangrientas</strong> del <strong>Bosque del Suspiro</strong> (provincia de Badajoz).\r\n</p>\n<p>En el <strong>Bosque del Suspiro</strong> hay un montón de setas, pero también vive la tribu de los animales forestales que se alimenta, precisamente, de <strong>setas sangrientas</strong>. Como los de la tribu son muy mortíferos y además salen denoche, lo único que puede hacer el pobre <strong>Ramiro</strong> es ir a buscarse las setas de día. Por suerte, aún le duran los efectos del hechizo postizo, por lo que podrá aguantar unos segundo a plena luz del sol sin cocerse como un congrio.\r\n</p>\n<p>Además, su amigo el <strong>Brujo Mariquita de la Varita</strong>, que es todo un sibarita, le ha hablado de que en las criptas del bosque crecen cuatro <strong>setas con tetas</strong>, una variedad rarísima y riquísima. Las criptas no tienen pérdida, porque están dentro de unas cuevas en el centro del bosque, donde viven <strong>Tamara la tía rara, Alberto el tuerto, Donoso el seboso y Camila la wila</strong>, así que <strong>Ramiro</strong> decide no volver a casa hasta que tenga <strong>10 setas sangrientas</strong> y las <strong>4 setas con tetas</strong>.\r\n</p>\n<p><em>Introducing the <strong>third, lost chapter of Ramire’s capers</strong>! Just like <strong>The Caped Crusader</strong>, which had two different games in the retail tape and a third one in a covertape!</em>\n</p>\n<p><em><strong>Ramire</strong> was making peace with her daugher. To get on well with her, <strong>Ramire</strong> allows his daughter to bring a friend to a slumber party. The girls are having a real good time doing <strong>Rick Astley</strong> playbacks and hanging from the lamps, but soon enough they feel really hungry. It is well know that the best food for adolescent vampires is a good dish of <strong>bloody mushrooms</strong> from the forest near <strong>Cheshire</strong> (province of Badajoz).</em>\n</p>\n<p><em>There are quite a lot of <strong>bloody mushrooms</strong> in the forest, but can be collected only during daylight. Luckily enough, the <strong>rearm charm</strong> is still working so <strong>Ramire</strong> is able to stay a while under the sun rays. But not for long, remember?</em>\n</p>\n<p><em>Besides, his friend the <strong>Wimpy Wizard</strong>, has told him about <strong>a special kind of mushrooms</strong>. There are four of them and grow in the crypts beneath the forest: the four <strong>mushrooms with tits</strong>. So <strong>Ramire</strong> decides not to get back home until he gets <strong>10 bloody mushrooms</strong> and <strong>4 mushrooms with tits</strong>.</em>\n</p>\n<p><strong>Controles / Controls:</strong></p>\n<p><strong>O, P:</strong> izquierda, derecha / <em>left, right</em><br/><strong>Q / SPACE:</strong> saltar / <em>jump</em><strong><br/>A:</strong> planear <em>/ glide</em></p>\n<p>También Joystick y Sinclair en ZX-Spectrum y Joystick en Amstrad CPC.</p>\n<p><em>Also Joystick and Sinclair on ZX-Spectrum and Joystick on Amstrad CPC.</em></p>\n<p><strong>Instrucciones de caraga / Loading instructions</strong>\n</p>\n<p>ZX Spectrum:</p>\n<p>En modelos de 48K, escribe LOAD”” y pulsa ENTER y Play en el casette. En modelos de 128K, pulsa ENTER. </p>\n<p><em>Type LOAD “” then press ENTER. In 128K press ENTER.</em></p>\n<p>Amstrad CPC:</p>\n<p>Pulsa las teclas Control y Enter simultaneamente y Play en el cassete, o bien teclea RUN””, pulsa Return y después Play. En disco, busca el archivo con CAT y cárgalo, que tú sabes.\r\n</p>\n<p><em>In Amstrad, press CTRL+ENTER simultaneously, then press PLAY, or type RUN», then RETURN, then PLAY. For the DSK version, just look for the executable using CAT, we are sure you know the drill.</em>\n</p>\n<p><strong>FX Aprende español con los Mojon Twins:</strong></p>\n<p>Para contrarrestar que haya juegos españoles en español que se llamen Comando Tracer</p>\n<p><em><strong>FX Learn Spanish with the Mojon Twins:</strong></em></p>\n<p><em>The title is in Spanish so your can improve yours for your next trip to Benicarlo!</em></p>", "metacritic": null, "released": "2022-10-30", "tba": false, "updated": "2022-10-31T07:35:26", "background_image": "https://media.rawg.io/media/screenshots/ee3/ee3a386052834047d14a485e5c390719.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["The Mojon Twins"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}