{"id": 873699, "slug": "interior-worlds", "name": "Interior Worlds", "name_original": "Interior Worlds", "description": "<p>Snap your own homemade liminal space photos using a mysterious SLR camera as you explore a variety of empty, strange, and familiar spaces.</p>\n<hr />\n<p><strong>Empty lots. Blackened buildings. Dimly lit hallways.<br />\nThey all live and breathe just as we do.</strong></p>\n<h1>liminality.</h1>\n<p>Welcome to <strong>Interior Worlds</strong>; an ambient first person exploration game where you&#39;ll dive into strange, yet familiar spaces. Temporary gaps and portals we cross at some point or another - now yearning for a closer look. A look that can only be seen properly through the lens of an SLR camera.</p>\n<h1>photography</h1>\n<ul>\n<li>Use your vintage and mysterious analog camera to capture stunning photographs of environmental anomalies throughout each environment. Keep a sharp eye out while traversing the more unsettling locations.  </li>\n<li>Track and share your own in-game catalog of photos, pre-filtered with subtle layers of peak liminal crust.  </li>\n</ul>\n<h1>explore.</h1>\n<ul>\n<li><strong>Ten unique thresholds to traverse.</strong> A roadside hotel, empty movie theater, dying mall, and many more. Every environment is hand-crafted in a loving throwback to late 90&#39;s and early 00&#39;s graphics.  </li>\n<li><strong>Unparalleled interactivity.</strong> Activate vending machines, phones, sinks, televisions, or simply turn the lights on or off for a different photo-moment vibe.  </li>\n<li><strong>Immersive and unsettling soundscape.</strong> Melt into an eerie mix of low, rumbling drones and soft, stretched pads during the journey.</li>\n</ul>", "metacritic": null, "released": null, "tba": true, "updated": "2024-01-30T12:58:15", "background_image": "https://media.rawg.io/media/screenshots/4fc/4fcf62ceae1cc56d80fd3ce1df64083f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "beaten": 2, "toplay": 4, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["sodaraptor"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["RaptorSoft", "Raptorsoft Games"], "esrb_rating": null}