{"id": 87377, "slug": "ouch", "name": "Ouch!", "name_original": "Ouch!", "description": "**** v1.5 has been submitted! featuring major bug fix updates and other general improvements! <br/><br/>we have also dropped the price down to $0.99!<br/><br/>** Thanks to everyone who has been uploading their custom scenes, there are over 7,500 scenes (!!) available for download right now!<br/><br/>Ouch! is an open-ended game about flinging a customizable \"rag doll\" character through a variety of scenes featuring a huge array of objects, with realistic physics and sounds.  For each scene, you are given a \"score\" based on how much damage the character has taken. The controls are simple: tilt the device to slightly alter gravity, guiding the character into objects -- swipe a finger on the screen to \"nudge\" the character -- or touch on-screen interactive props such as pinball flippers, cannons, rockets, cars, and more to cause even more damage!<br/><br/>** FULL LEVEL EDITOR INCLUDED **<br/><br/>Game Features:<br/><br/>* Amazing Ragdoll physics<br/><br/>* Over 45 pre-built scenes to play<br/><br/>* Over 65 props and objects to interact with (crash into, hit, drop, shoot, etc)<br/><br/>* Create your own characters with customizable outfits, hats and hairstyles, and faces<br/><br/>* Put your friends (or your enemies, or your own!) face on a character by importing pictures from your photo library, or by taking pictures directly with the iPhone camera - complete with multiple facial expressions!  Watch your brother/friend/enemy grimace in pain when he gets hit in the head with a falling anvil!  (when creating a custom face for a character, you will need 3 images-- one for each expression: normal, happy, and ouch!).  If you don't have 3 images, you can use the same image multiple times.<br/><br/>* Complete level editor included - design your own scenes from right within the game.  In fact, every scene included with the game was created with the same built-in editor!<br/><br/>* Resume Edit feature - if you get a phone call, or have to exit the app while editing a scene, you can resume from where you left off the next time you launch the game.<br/><br/>* Full replay system - watch playback in forward, reverse, slow motion, fast motion and any speed in-between with the intuitive \"playback spinner\"<br/><br/>* An iPhone / iPod Touch first! -- Use the innovative \"export to image\" feature to export your custom scenes and characters to a standard JPG file, which you can email to your friends -- they can import that image into their game, and play your custom scenes, or use your custom characters for themselves!  Sharing content is easy!<br/><br/>* High Score tracking - the top score for each scene is recorded and kept - even for all of your custom scenes that you create, or import.<br/><br/>* Future updates will add more of everything - scenes, outfits, props, hats, etc!", "metacritic": null, "released": "2009-03-27", "tba": false, "updated": "2019-10-22T14:20:41", "background_image": "https://media.rawg.io/media/screenshots/32f/32f5f040140d0abc3e57e41c8cde6f1a.jpg", "website": "http://hondune.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 99, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brandon Proulx"], "genres": ["Action", "Simulation"], "publishers": ["Brandon Proulx"], "esrb_rating": "Teen"}