{"id": 87374, "slug": "bike-mayhem-mountain-racing-free-by-best-free-game", "name": "Bike Mayhem Mountain Racing Free by Best Free Games", "name_original": "Bike Mayhem Mountain Racing Free by Best Free Games", "description": "Downhill mountain bike racing like never before. Race down beautiful trails, smashing over rocks and roots, boosting huge jumps, scoring insane trick combos, unlocking better bikes and gear for bragging rights as the King of the Mountain!<br/><br/>The best mobile bike game, Bike Mayhem Extreme Mountain Racing! <br/><br/>Compete in timed races or freestyle trick events on 19 different mountains and over 100 trails inspired by real world locations.<br/><br/>Unlock over 80 items of gear to add style your rider and tune your bike for speed, agility, strength, and energy for each trail.<br/><br/>Experience realistic physics and plush bike suspension as your bike eats up the rough stuff and softens the landings of big jumps and drops. <br/>High speeds and big jumps means huge crashes where your rider will ragdoll tumble down the trail. Use your finger to pick up you rider throw him even further.<br/><br/>Share your races with your friends. Challenge them to beat your times! <br/><br/>Brought to you by the makers of the epically popular Motocross racing game: Moto X Mayhem, which reached #1 Paid App worldwide and was a Top 5 Racing game for over a year! <br/><br/>FEATURES: <br/><br/>- 100+ Beautiful mountain trails for all styles of riding<br/>- 80+ Gear items for your rider and MTB bike <br/>- Frame and wheel upgrades that impact game play<br/>- Epic bike crashes, fun rag doll physics and active bike suspension<br/>- Tricks, bunny hops and flips! <br/>- Addictive gameplay <br/>- Powerful online leaderboards<br/><br/>TIPS: <br/><br/>- If you use check points, you will get a maximum of one star. Stay on your bike to achieve 3 stars! <br/>- Lean to add flips into your trick combo. <br/>- Wheelie into and out of a jump to add to your trick combo.<br/>- Hold down the pump/hop button when entering a downhill section to get a boost in speed.<br/>- Wheelies do not drain your energy<br/>- The timer doesn't start until you start to pedal the bike or brake! <br/>- Use your finger to grab the rider and toss him around the map when you're on or off the bike. <br/>- Make sure you pick the right frame and wheel combination to get the best score for each trail.<br/>-Use boosters to help you through a difficult trail or to get the top position on the leaderboard.<br/><br/><br/>See a video of this crazy action packed mountain bike game at: http://www.youtube.com/BestFreeGamesInc<br/><br/>Follow us @<br/>facebook.com/bikemayhem<br/>twitter.com/BestFreeGamesCo", "metacritic": null, "released": "2014-02-04", "tba": false, "updated": "2019-07-30T11:45:24", "background_image": "https://media.rawg.io/media/screenshots/bc5/bc52187f94c54d56035cfe13d3226091.jpg", "website": "http://bestfreegames.mobi", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Best Free Games"], "genres": ["Sports", "Racing"], "publishers": ["Best Free Games"], "esrb_rating": null}