{"id": 873762, "slug": "bright-as-light", "name": "Bright as Light", "name_original": "Bright as Light", "description": "<p>Our game made for MAGE 8 GameDev Competition. My team members are @anime_dtions &amp; @manathan313. Thanks to them, this game can be exist and makes it possible.</p>\n<p><strong>GAME SYNOPSIS (ID)</strong></p>\n<p>Hiduplah lima malaikat penjaga dunia yang hidup di atas langit alam semesta. Setiap malaikat mempunyai tiga Power Orb dengan elemen yang berbeda-beda sesuai dengan sifatnya. Terkecuali untuk salah satu Power Orb yang mempunyai elemen cahaya, yaitu Power Orb: Bright as Light (Terang seperti Cahaya). Power Orb: Bright as Light ini adalah Power Orb wajib yang harus dimiliki sebagai seorang malaikat. Tanpanya seorang tidak bisa menjadi seorang malaikat.</p>\n<p>Krystina adalah malaikat ke-5 dari lima malaikat penjaga dunia. Dia memiliki tiga Power Orb. Elemen Power Orb yang dimilikinya yaitu, Power Orb: Firm as Lightning (Tegas seperti Petir), Power Orb: Passionate like Fire (Penuh Semangat seperti Api), dan Power Orb: Bright as Light (Terang seperti Cahaya).</p>\n<p>Suatu saat, <strong>Krystina memulai pertengkaran dengan malaikat ke-4, Iliana karena suatu hal.</strong> Iliana mengadu kepada malaikat pertama, Alena selaku pemimpin dari para malaikat. Kemudian Alena menghukum Krystina dengan cara diturunkan ke sebuah planet bernama Planet Gerelara. Planet Gerelara adalah planet hampa dan tidak berpenghuni. Hanya berisi monster aneh dan menyeramkan.</p>\n<p>Alena berkata kepada Krystina bahwa jika dia bisa mengumpulkan ketiga Power Orb yang dimilikinya yang sudah tersebar di Planet Gerelara. Maka dia bisa kembali hidup di atas langit alam semesta bersama mereka lagi. Dan berjanji tidak akan memulai pertengkaran dengan malaikat-malaikat lagi.</p>\n<p>Krystina harus menerima akibatnya dan siap dihukum dengan cara diturunkan ke planet Planet Gerelara dan mencari Power Orb yang dimilikinya agar bisa kembali lagi ke atas langit alam semesta. Krystina sudah berada di Planet Gerelara. Kondisinya sangat tidak baik dan seperti tidak ada harapan. Kemudian datanglah seorang “monster” berinisial Nemesis yang memberinya sebuah kekuatan dan sebilah pedang tidak biasa untuk dia bertahan hidup.</p>\n<p><strong>GAME SYNOPSIS (EN)</strong></p>\n<p>There lived the five guardian angels of the world who lived above the heavens of the universe. Each angel has three Power Orbs with different elements according to their nature. Except for one Power Orb which has a light element, namely Power Orb: Bright as Light. Power Orb: Bright as Light is a mandatory Power Orb that must be possessed as an angel. Without it one cannot become an angel.</p>\n<p>Krystina is the 5th of the five guardian angels of the world. She has three Power Orbs. Her Power Orb elements are Power Orb: Firm as Lightning, Power Orb: Passionate like Fire, and Power Orb: Bright as Light.</p>\n<p>One time, Krystina started a fight with the 4th angel, Iliana for some reason. Iliana complained to the first angel, Alena as the leader of the angels. Then Alena punishes Krystina by being sent down to a planet called Planet Gerelara. Planet Gerelara is an empty and uninhabited planet. Contains only strange and creepy monsters.</p>\n<p>Alena said to Krystina that if she could collect the three Power Orbs she had which were already scattered on Planet Gerelara. Then she could come back to live in the sky of the universe with them again. And promised never to start a fight with the angels again.</p>\n<p>Krystina must accept the consequences and is ready to be punished by being sent down to Planet Gerelara and looking for the Power Orb she has so that she can return to the sky of the universe. Krystina was already on Planet Gerelara. Her condition is very bad and like there is no hope. Then came a \"monster\" with the initials Nemesis who gave her a strength and an unusual sword for her to survive.</p><p>Note: Yes, the game story is in Indonesian.</p>\n<p>Download the game via | Google Drive |</p>", "metacritic": null, "released": "2022-10-29", "tba": false, "updated": "2022-10-31T09:55:14", "background_image": "https://media.rawg.io/media/screenshots/af0/af0dd51b229bf8cadf6541168c3eb1f2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 272, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["TheYellowPoPCorn"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}