{"id": 87385, "slug": "countdown-downtozero-lite", "name": "Countdown: DownToZero Lite", "name_original": "Countdown: DownToZero Lite", "description": "*Countdown was previously known under the title \"DownToZero\"<br/><br/>** Now updated with 3 graphical skins to choose from!<br/><br/>** Countdown has been featured by IGN as one of \"8 Great Unsung iPhone Games\"!  Thank you IGN!!!  Here's what they have to say:<br/><br/>\"our puzzler of choice is the simple yet superbly implemented Countdown... It's unbelievably tense and hugely compulsive - with the game's 1-minute Time Attack mode being an absolute gem. Throw in responsive touch-screen controls, 3-minute Time Attack and Endless Modes, a Global online leader board and [...] we can't recommend it highly enough.\"<br/><br/>--<br/><br/>Countdown is a fast action puzzle game.  <br/><br/>[3] Drag your finger to connect blocks that<br/>      subtract down to zero.<br/>[2] Connected blocks will disappear after <br/>      2 seconds.<br/>[1] Connect more blocks before they disappear<br/>      to create chains!<br/><br/>[0] Good luck!<br/><br/>- - - - - - - - - -<br/>LITE VERSION FEATURES<br/>- - - - - - - - - - <br/>* 1 GAME MODE<br/>  - Time Attack: 3 Minute<br/><br/>* LOCAL HIGH SCORES<br/><br/>* FULL RESUME SYSTEM<br/>  - Don't worry if you get a call, text message, or just have to exit the game in the middle of the action.  The next time you start the game, your previous session is immediately restored!<br/><br/>* IDEAL FOR SHORT BURSTS OF PLAY<br/>  - Loads fast, menus navigate quickly.<br/><br/><br/>- - - - - - - - - -<br/>FULL VERSION FEATURES<br/>- - - - - - - - - -<br/>* 4 TOTAL GAME MODES:<br/>  - Endless Mode<br/>  - Time Attack 1 minute<br/>  - Time Attack 3 minutes<br/>  - \"Clear\"Mode<br/><br/>* GLOBAL LEADERBOARDS FOR ALL GAME MODES!<br/><br/>- - - - - - - - - -<br/>more acclaim for Countdown:<br/>- - - - - - - - - -<br/><br/>\"Countdown is a great casual game that gives your brain a much needed workout... It can get addictive.\"<br/>- Musttap.com<br/><br/>5.5 / 6 Stars<br/>- Appviewer.de<br/><br/><br/>- - - - - - - - - -<br/>Some comments from players on the toucharcade.com forums:<br/>- - - - - - - - - -<br/><br/>\"I love the retro graphics, the sounds are great, and the game play really is fantastic. It's one of those games you can just pick up and play to kill time whenever, and the re-playability is great.\"<br/><br/>\"This is a casual puzzle with a really well balanced production.\"<br/><br/>\"I keep returning to this game over alot of the other stuff I've bought recently. It's fantastic and I'm going to recommend it to whoever I can\"<br/><br/>\"Really like this puzzler and it will stay on my iDevice for some time.  Highly recommended.\"<br/><br/>\"Countdown combines elements of Drop7, Numba and Big Top 10, but what it adds is a bucketload of timing, strategy, pacing, and competition... I recommend it not only to fans of the aforementioned titles, but to anyone that likes puzzle games that challenge your mind and your dexterity.\"<br/><br/>--<br/>many people seem to mistakenly recall the name of the game as \"DropToZero\", so if you searched for that term, you're in the right place :)", "metacritic": null, "released": "2009-07-10", "tba": false, "updated": "2019-10-22T14:20:42", "background_image": "https://media.rawg.io/media/screenshots/1eb/1eb6d8e4323bfb07aeaf7673f3b175c7.jpg", "website": "http://hondune.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Brandon Proulx"], "genres": ["Arcade", "Puzzle"], "publishers": ["Brandon Proulx"], "esrb_rating": "Everyone 10+"}