{"id": 873967, "slug": "ordem-paranormal-rpg", "name": "Ordem Paranormal RPG", "name_original": "Ordem Paranormal RPG", "description": "⌚Average Gameplay Time\r\n 5 minutes.\r\n\r\n\n<p>O <strong>paranormal </strong>não vem para a nossa realidade de maneira fácil. Ou pelo menos, as coisas deveriam ser assim.\r\nO mundo tem uma base de <strong>sanidade </strong>sólida, por isso as manifestações paranormais do<strong> Outro Lado</strong> são apenas encontradas em locais específicos. </p>\n<p>A membrana que separa a nossa realidade do <strong>Outro Lado</strong> pode ser enfraquecida pelo <strong>Medo</strong>, e diversos grupos de ocultistas estão dispostos a fazer o que for preciso para enfraquecer essa <strong>Membrana </strong>e invocar as entidades do <strong>Outro Lado</strong>.\r\nPor causa disso, uma organização de detetives paranormais foi criada: a <strong>Ordo Realitas</strong>.</p>\n<p>Vivendo vidas duplas, os agentes da <strong>Ordem </strong>secretamente investigam e combatem o paranormal, protegendo a <strong>Realidade </strong>e lutando contra aqueles que estão apenas dispostos a mergulhar o mundo em caos. </p>\n<p><strong>Ordem Paranormal</strong> é um universo de investigação paranormal, criado por Rafael Lange (Cellbit).</p>\r\nCredits:\r\nMusics:\r\n<p>Every audio content made in this game were made by Luziiano, including the original sound track.</p>\r\nCodes:\r\n<p>The programmers responsible by the development of various systems of the game were Noblezito and euOVER. Two new developers on the #gamedev.</p>\r\nArts: \r\n<p>Cellbit made the character design and some others pixel arts, like the background!</p>\r\nWriters:\r\n<p>Joao Miranda and Cellbit writed the scenes and characters.</p>\n\n\n\n\n<p>Rate this game if possible, to increase the brazilian gamedev scene visibility</p>", "metacritic": null, "released": "2022-10-28", "tba": false, "updated": "2022-10-31T11:18:04", "background_image": "https://media.rawg.io/media/screenshots/166/166b69769b049663135837111f7bc93f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["noblezito"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}