{"id": 874144, "slug": "innocent-love-v010", "name": "Innocent Love v0.1.0", "name_original": "Innocent Love v0.1.0", "description": "<p>A game that is reminiscent of old classic JRPGs with an emphasis in growing bonds with your friends. Experience this reimagining of an old worn-out, cliche genre.</p>\n\r\n--STORY--\r\n<p>Thousands of years ago, the Demon Lord Aster ruled the world through sheer chaos and destruction.<br/></p>\n<p>People worshiped him over their Goddess who created their existence.<br/>The Goddess then sent her angelic warriors who defeated Aster and sealed him within the depths of the underworld.</p>\n<p>Now, in the present day, a dark force seeks to revive the demon lord by searching for his human incarnation.</p>\n<p>This story follows a young man named Elliot Winston, whose normal routine begins the journey to determine the fate of the world.</p>\n<em>This game is unfinished, but more will be released over time.</em>\n<p>As of right now, this build is simply a demo and a taste of the full game. As such, features that are present in the finished product are either missing or incomplete.<br/>The story is still in development, so the game will advance over time with future updates.<br/></p>\n<p><strong>Current Playtime: 15-30 minutes</strong></p>\n<p><strong>Classic Turn-Based Battle System~:</strong> Experience a turn-based battle system similar to classic RPG Games such as Final Fantasy X or the Legend of Heroes series!</p>\n<p><strong>ZERO Random Encounters~</strong>: All enemies are visible on screen and you can score predictable Encounter Advantages by sneaking up behind them!</p>\n<p><strong>Multiple Side Quests~:</strong> Experience the world with various side quests to take on with varying difficulties and objectives!</p>\n<p><strong>Entrancing Original Artwork~</strong>: Featuring original artwork for each main character, including full CG graphical images.<br/></p>\n\n<p>This is also my first ever game to be released. As of now, I only use some default assets, with some original artwork (as well as a few edited sprites), but I do plan on making more original assets later down the road, as well as original music.</p>\n\n<p>Thanks for playing my game, and I hope you all enjoy it! <br/></p>", "metacritic": null, "released": "2022-10-28", "tba": false, "updated": "2022-10-31T12:32:37", "background_image": "https://media.rawg.io/media/screenshots/91a/91ac4546fbc55a08d5de50aa33c28b5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["mrd256"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}