{"id": 874103, "slug": "the-last-of-the-hippotatos", "name": "The Last of the Hippotatos", "name_original": "The Last of the Hippotatos", "description": "<p>This game is a submission for AI and Games Jam 2022, Thank you for playing!<br/></p>\r\nThe Game's Story\r\n<p>You are the very last survivor on the desolated wasteland called Earth. Created as a robotic companion for the last human, you witnessed as they, too, passed away. And now you are all alone. Using your creator’s knowledge base as a guide, you decide to revive the spectacular creatures that once inhabited this Earth. Create new species from old knowledge and breed them to survive the test of time. From the depths of loneliness and isolation comes The Last of the Hippotatoes. May the battle of the fittest begin.\r\n</p>\r\nControl and Instruction Guide\r\n<p>WASD - move</p>\n<p>left click - attack</p>\n<p>right click - block</p>\n<p>space - jump</p>\n<p>e - interact</p>\r\nThoughts on the Game\r\n<p>Unfortunately our team did not have as much time available to us as we had originally planned and as such the game is in a relatively unfinished state. </p>\n<p>We had originally planned to allow the player to isolate creatures that they find in the arena and bring them back for breeding so that they can try to recreate the hippopotatos from the various featured animals. However due to time constraints and a surprising amount of issues in the hybrid animal building process (a good amount caused by trying to do cutout animations in 3d space, something we have never tried before and as such overestimated its ease). The animals were also intended to have varying AI behavior based on sequences from their genes. </p>\n<p>Lesson learned here is to not try to do too many new things at once in a game jam, between the cutout system and trying and failing to get a working computer screen in game I wasted a bunch of time that could have been spent making the actual core game loop. Second lesson learned was get the gameloop finished first before you try out new graphical approaches. </p>\n<p>Overall I am still happy with this project. Despite not getting it to the point we wanted to, we had a lot of fun learning and throwing around ideas.  Definitely considering spending some time post jam just to get this game into a working state. Thank you again for looking at out project. We greatly appreciate any feedback! \r\n</p>", "metacritic": null, "released": "2022-10-28", "tba": false, "updated": "2022-10-31T12:13:44", "background_image": "https://media.rawg.io/media/screenshots/56c/56c0e73841819472e2c3e90e77d19894.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Cranberry Ninja", "TehNinjaFlute"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}