{"id": 87432, "slug": "rome-total-war-gold-edition", "name": "Rome: Total War - Gold Edition", "name_original": "Rome: Total War - Gold Edition", "description": "Welcome to Rome – Welcome to War. Two world-dominating games in one!<br/><br/>Before you buy, expand this description to check the system requirements below.<br/><br/>See the mini-site at feralinteractive.com/rometw<br/><br/>Uniting multi-award winning Rome: Total War and its official expansion pack, Barbarian Invasion, you must guide history’s greatest armies to victory in a game of epic real-time warfare, empire building, politics and treachery.<br/><br/>Play as one of three great Roman families, whose thirst for power will stop at nothing. This is the world of Hannibal, Julius Caesar, Cleopatra and a thousand others. This is a world of soldiers, gladiators, tyrants, monsters and fools. It’s a rich, exciting world, awaiting a conqueror – you! You must use military genius to build an empire that stretches across Europe and Africa. Finally march on Rome to seize control of the greatest empire in the world. Then in Barbarian invasion either defend it or lead a Barbarian horde and bring the once mighty empire to its knees.<br/><br/>• Experience real-time battles – Use innovative battle tactics in battles with up to 10,000 soldiers on-screen at once. <br/><br/>• Command and build your campaigns – Balance economic, civil, religious and military power in the century-spanning campaign. <br/><br/>• Learn from the best – Fight alongside or against history’s greatest leaders such as Julius Caesar, Spartacus, and Hannibal to expand or destroy the Roman Empire. <br/><br/>• Lay siege with signature weapons and abilities – Turn the tables against the Romans as Attila the Hun, the fearsome Saxons, and other savage factions in the Barbarian Invasion expansion pack.<br/><br/>4.5/5 – “The truth is, Mac players rarely enjoy a strategy game as deep or as fun as Rome: Total War.” – Macworld<br/><br/>4.5/5 – “…Total War delivers a strategy experience that’s hard to pass up.” – Mac|Life<br/><br/>5/5 – “There’s a lot to like about RTW; a lot of little details that separate it from other real time strategy games.” – Appletell<br/><br/><br/>Important information regarding Rome: Total War - Gold Edition: <br/><br/>• If you require assistance, please contact our support team at support@feralinteractive.com<br/><br/>• Full system requirements are available on the Rome: Total War - Gold Edition mini-site at feralinteractive.com/rometw. <br/><br/>• Minimum System Requirements: Processor: 1.4 GHz, RAM: 512MB, Graphics: 128MB, Free Space: 5GB.<br/><br/>• This game is not currently supported on volumes formatted as Mac OS Extended (Case Sensitive).<br/><br/><br/>", "metacritic": null, "released": "2011-01-20", "tba": false, "updated": "2023-03-13T20:01:44", "background_image": "https://media.rawg.io/media/screenshots/c84/c84eeadcf68920619189128fc539be4a.jpg", "website": "http://www.feralinteractive.com/en/mac-games/rometw/?utm_source=mas&utm_medium=link&utm_campaign=mas_rometw_minisite", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 321, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Feral Interactive"], "genres": ["Strategy"], "publishers": ["Feral Interactive"], "esrb_rating": null}