{"id": 874438, "slug": "talon-city-death-from-above", "name": "Talon City: Death from Above", "name_original": "Talon City: Death from Above", "description": "You’re a clever but nearly friendless owl on the verge of losing everything you’ve struggled so hard to earn. With ruthless vulture creditors on your tail, you must track down a missing client whose case can save your career. But when your investigation takes a horrific turn, can you avoid becoming a deranged bird’s next victim? <br/><br/>Talon City: Death from Above is a 135,000-word interactive fantasy novel by Eric Moser. It’s entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination.<br/><br/>The Wards of Talon City, nine in all, sprawl as far as a bird can see. Thousands of trees house thousands of citizens, from the lowliest hummingbirds to the most magnificent eagles. Towering cottonwoods, oaks and spruces teem with life. And death.<br/><br/>Trapped in the middle of the city’s hierarchy, you face challenges at every turn. The eagles don’t respect you. The prey birds don’t trust you. You’re deep in debt, and now your most valuable client is nowhere to be found. Can even the cleverest owl prevail in such a desperate situation?<br/><br/><ul><li>Play as male, female, or non-binary.<br/></li><li>Approach challenges by relying on your Wings, Beak, Ears, Talons, or Heart.<br/></li><li>Face death on three different occasions!<br/></li><li>Is your relationship with your best friend platonic or is romance on the horizon?<br/></li><li>Will you befriend your assistant or treat her only as a lacky?<br/></li><li>Are you sincere or disingenuous? Disheveled or tidy? Build your character through the decisions you make.<br/></li><li>Will you be a merciful owl, or will you be driven by vengeance?<br/></li><li>Do you prefer a more relaxing playing experience? Play on “Easy” Mode.<br/></li><li>Do you prefer a stressful challenge? “Preposterous” Mode might be for you.<br/></li><li>20 Achievements to pursue!<br/></li></ul><br/>Can you survive the perils of Talon City?", "metacritic": null, "released": "2022-11-03", "tba": false, "updated": "2022-11-04T04:02:25", "background_image": "https://media.rawg.io/media/screenshots/d43/d43d5536abbe88a71e204acea56f7fd3.jpg", "website": "https://www.choiceofgames.com/user-contributed/talon-city", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Hosted Games"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Hosted Games"], "esrb_rating": null}