{"id": 874450, "slug": "heroes-city-superman-edition", "name": "Heroes City Superman Edition", "name_original": "Heroes City Superman Edition", "description": "<strong> Are you ready for a unique experience where you can choose your own hero and have an adventure on a large realistically prepared map?<br/>With heroes city, you can choose your hero and experience flight experience action.<br/>Moreover big update coming soon!<br/><br/>they will be added in the big update<br/>+Planes and helicopters will be added to the map<br/>+All air, sea and land vehicles in the game will be drivable.<br/>+Multiplayer feature <br/>+so much to the sky if you rise You will be able to access space. different planets and space stations can be visited in space (for now only mars and moon)<br/>+Multi-language support <br/>+New character animations <br/>+FPS feature<br/>+Missions will be added<br/>+Motorcycles and boats will be added to the map<br/>+New menu design and interfaces will be added<br/>+Character outfit customization (civilian clothes will be wearable)<br/>+Time stop feature will be added<br/>+Fly speed sensitivity can be adjusted<br/>+Morning evening cycle and different weather conditions will be added<br/>+Optimization will be better </strong><br/><br/><br/><br/><br/><br/><br/><br/><br/><strong> Realistic Graphics </strong><br/>The game was developed and continues to be developed with the unreal engine game engine.<br/>The graphic possibilities offered by unreal engine for games are quite high.<br/>Unreal engine was used for heroes city superman edition.<br/><br/><strong> Realistic Sound Effects </strong><br/>While making the necessary adjustments in the game, we paid attention to make the sound effects feel like a real flight. Our aim was to provide the closest feeling to real life.<br/>we worked especially hard on wind sounds<br/><br/><strong> Character Animations </strong><br/>You can switch to different flight animations when you press the 1 and 2 keys while flying in the game.<br/>We will improve these animations over time. More flight animations will be added to the game at a later time.<br/><br/>", "metacritic": null, "released": "2022-11-01", "tba": false, "updated": "2022-11-04T04:17:16", "background_image": "https://media.rawg.io/media/screenshots/95b/95bb936314e8f751ce8da50707849f82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hero Game Studios"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["Hero Game Studios"], "esrb_rating": null}