{"id": 874459, "slug": "future-mirror", "name": "Future Mirror", "name_original": "Future Mirror", "description": "<h3>STORY</h3><br/><br/>Itsuki and Akane, two high school sophomores pondering their future, decide to try performing a spell that is supposed to allow them to see their futures 10 years from now.<br/><br/>Itsuki is skeptical and doesn't believe it's possible, but egged on by Akane, she performs the spell anyway.<br/>That night as Itsuki falls asleep, she suddenly finds herself in a world 10 years in the future, in an unfamiliar place, handcuffed to a stranger, and surrounded by flames.<br/><br/>Itsuki wakes up from her dream and after meeting up at school the next day, is told a shocking truth by Akane:<br/>\"Ten years from now, I will be dead...\"<br/><br/>Is it really just a dream?<br/>Why is Akane dead?<br/>Determined to find answers, Itsuki travels back and forth to the future in her dreams searching for a happy ending for herself and Akane.<h3>GAMEPLAY</h3><br/><br/>The game combines traditional visual novel storytelling and player-controlled exploration.<br/>Depending on the player's actions, the story branches into four different endings.<br/>Escape the disastrous future you've learned about in your dreams and pursue a happy future.<h3>CHARACTERS</h3><br/><strong>Itsuki Hiiragi</strong><br/>The protagonist.<br/>She has a bright and refreshing personality.<br/>Her goal is to lead a stable, happy life.<br/><br/><br/><strong>Akane Ariake</strong><br/>Itsuki's best friend.<br/>She has a soft and gentle personality, speaking in a slow and stilted manner, and has a mysterious air about her.<br/><br/><br/><strong>Mutsumi Haitani</strong><br/>A young man who finds himself handcuffed to Itsuki in the future.<br/>Gentle and respectful to everyone, but the depths of his soul are a mystery.<br/><br/><br/><strong>Iori Kuto</strong><br/>A senior of Itsuki and Akane's high school club.<br/>He recently started dating Akane, and is admired by all of the club members.<br/><br/><br/><strong>Nao Hayashikawa</strong><br/>A friend of Itsuki and Akane and belongs to the same club.<br/>She has a strong, firm personality and is shy when it comes to matters about love.<br/><br/><br/><strong>Minako Sasahara</strong><br/>Iori's ex-girlfriend.<br/>She is a senior in the same club as Itsuki and Akane.<h3>GAME FEATURES</h3>Four unique endings (1 Happy, 3 Bad). <br/> <br/>Playtime: Around 2 hours.", "metacritic": null, "released": "2022-11-01", "tba": false, "updated": "2022-11-04T04:26:03", "background_image": "https://media.rawg.io/media/screenshots/f21/f2114db62c77c4e93aebf240715ffd40.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["皐月の夢"], "genres": ["Adventure"], "publishers": ["LocaGames"], "esrb_rating": null}