{"id": 874441, "slug": "where-is-earth", "name": "Where is Earth?", "name_original": "Where is Earth?", "description": "<strong>Where is Earth</strong> is a top-down vehicular combat game. Traverse planets, evading threats and obstacles, in search of your crew. Gather resources to assemble upgrades, landing vehicles, space craft, weaponry and support modules to aid you in your fight against an unknown enemy.<h3>PLOT</h3><br/>2050 AD<br/>Earth's natural resources are depleted and corporations are forced to expand their mining operations to neighbouring planets. <br/><br/>2051 AD<br/>A small transporter convoy on route to Mars, appears to be obliterated during an implosion, believed to be caused by the malfunction of a new experimental ship engine. The incident is reported as a freak accident.<br/><br/>Unknown to Earth's inhabitants, in reality the implosion is caused by a wormhole, which teleports the convoy to another galaxy, millions of light years away from their home planet. While some transport vessels are destroyed during the event, some emerge from the wormhole relatively unharmed and somewhat separated from each other.<br/><br/>Equipped with only the knowledge, crew and resources on-board, the captains now face a new struggle: Survival in an unknown star system and finding a means to return to Earth.<h3>FEATURES</h3><br/><strong>Take command</strong> of the Merida Space Mining Company transport vessel TV-201 and prepare to defend her against regular attack.<br/><br/><strong>Traverse planet surfaces with landing vehicles</strong>, evading threats and obstacles along the way, in search of your crew, or to gather resources.<br/><br/><strong>Find and rescue your crew</strong> scattered over the galaxy. Different specialists are required to unlock different research options.<br/><br/><strong>Gather resources</strong> in three different ways to assist with repairs and assembly.<br/><br/><strong>Customize the loadout</strong> of your transport vessel, landing vehicles and space craft, choosing from a variety of weaponry and support modules.<br/><br/><strong>Prioritize research</strong> based on your play style, available crew and current objective to gain access to better landing vehicles, space craft, weaponry and support modules. <br/><br/><strong>Sandbox on a track.</strong> Clear objectives must be completed to finish the game, but landing vehicles and space craft have different capabilities, which can be combined with different weaponry and support modules, allowing for a degree of creativity while completing objectives.<br/><br/><strong>Randomization</strong> of planets and crew dispersion ensure that each new game is slightly different.<br/><br/><strong>Three difficulty settings to choose from.</strong> Easy for the casual player and Normal, or Hard, if you wish to be challenged strategically.<br/><br/><strong>Get your ship and crew back to Earth.</strong> A captain’s log provides the narrative with details of what has happened and what needs to be done.<br/><br/><strong>A short tutorial is available</strong> to familiarize you with the game functions. It contains some of the plot and is therefore recommended, but optional.", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T04:06:00", "background_image": "https://media.rawg.io/media/screenshots/f3a/f3a23dac191a357407e7610c0960d853.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 175, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jovano Software"], "genres": ["Action", "Strategy", "Indie"], "publishers": ["Jovano Software"], "esrb_rating": null}