{"id": 874403, "slug": "space-cheetah-hyper-runner", "name": "Space Cheetah Hyper Runner", "name_original": "Space Cheetah Hyper Runner", "description": "Welcome to the <strong>Hyper Games</strong>! Plug into your space cheetah to:<br/><br/> - Surf falling solar panels, ride passing satellites, play low G space soccer, and gain enough speed to ramp across entire levels. All in glorious 3D through a first-person POV.<br/><br/> - Follow the route markers, or blaze your own trail! All the levels are sandboxes, you're never forced to follow a set route. So many shortcuts to discover, it's a speed runner's dream!<br/><br/> - Race against the clock to get YOUR callsign on the level leaderboard!<br/><br/> - Groove to an incredible soundtrack, including an uptempo racing mix and a downtempo Chill Cheetah mix.<br/><br/> - Oh? Not feeling the need for speed!? No worries! Story Mode lets you casually explore each level, hunting for Ghost Node anomalies. Each one unlocks a memory (or is it a precognition?) about the Traveler’s mysterious journey through the solar system.<br/><br/><br/><br/><strong>4 UNIQUE LOCATIONS</strong><br/><br/>Race through speed parks dotted across the solar system:<br/><br/> - Earth: Scale the AI submind pyramids floating above the cherry blossom haze of Neo Tokyo. Tear through the swiss-cheese glacial melt near the AL1 North Pole megastructure. Tackle the infamous Launchtube circuit suspended in Earth’s upper atmosphere.<br/><br/> - Mars: Show off your skills in the Mars Experimental Zone, in an abandoned gravworks facility, and at the peak of Olympus Mons.<br/><br/> - Space: Beat the SpaceY CEO’s best time in an infamous speedway built from space junk, careen down the solar panel circuit in far Jupiter orbit, or go satellite hopping from a mined out asteroid.<br/><br/> - Cyberspace: Levels only an AI could dream up…anti-grav donuts, repurposed spare parts, mini-planetoid spheres, and everyone’s favorite Joburg AI Supercity Circuit!<br/><br/>The levels never box you in - you're free to ignore the route markers and take as many shortcuts as you like. Anything goes in the quest to shave valuable seconds off your run time!<br/><br/><br/><br/><strong>MULTIPLE GAME MODES</strong><br/><br/>Choose from 4 unique game modes:<br/><br/> - Classic Solo (the official Hyper Games standard!): Reach your points target, then sprint to the finish line.<br/><br/> - Race to 100: Get 100 points however you want as fast as possible within the time limit.<br/><br/> - Time Trial: Race to the finish line as fast as you can! Can you beat the SpaceY CEO's best time? Good luck!<br/><br/> - Story Mode: Find your personal zen with the Chill Cheetah playlist while freely searching for hidden Ghost Nodes. Learn about humanity’s progress in these cyberbrain downloads: the first global AI system, teleporter colonies on Mars, and the hard problem of eternal life.<br/><br/>Enough said! Plug into your space cheetah right away :)<br/><br/>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T03:14:35", "background_image": "https://media.rawg.io/media/screenshots/60c/60c55a4203d606475e8bbd375a929ff2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Matthew Milne"], "genres": ["Racing"], "publishers": ["Matthew Milne"], "esrb_rating": null}