{"id": 874431, "slug": "meliora-2", "name": "Meliora", "name_original": "Meliora", "description": "Embark on a journey in a fantasy world, defining your fighting style based on the class you choose from up to 16 characters available, each with different active and passive skills,  be your teammates savior or your enemies doom, explore different gameplay modes each with different challenges, decide your path and join the dark side’s seven deadly sins or the light side’s seven heavenly virtues, make your own path and create a combined power never seen before, or even better, face everyone alone if that is the path you wish to take in this local multiplayer tactical rpg board game.<br/><br/>Online multiplayer game<br/>Using the steam remote play feature that steam offers, you are able to play this game online with your friend by inviting them from your steam friends list to remote play with you.<br/><br/><br/><br/>Local multiplayer game<br/>This game offers you the chance to play with up to 4 players, either in single player, co-op teams, or one vs one / all.<br/><br/>Characters<br/>There are up to 16 characters available, you start with 4 characters and as you play you can either buy the rest in the shop or try your luck at summoning in the altar. Each character has its own story that you can indulge in at any time.<br/><br/><br/><br/>Skills<br/>Each character has different active and passive skills that suits their style, some will work better combined with other characters, and some are the perfect weakness for others, choose your teammate well and know your opponents to make the best use of your skills. <br/><br/><br/><br/>Different gameplay modes <br/>There are multiple modes that you can experience, from adventure, survival, arcade, random, and teams, each mode offers a different gameplay style, some of them you will need to survive as you fight with other players, others are a race to the end, each mode have different slots, which makeup to more than 60 unique slots, each with different effect, some to help you, some against you, strategize and forge your way to the top.<br/><br/> <br/><br/>Gatsha system<br/>You are able to use your in-game coins to summon at the altar, the chances are based on the characters rank, from B to SS, you may receive either coins or characters fragments that you can use to create the character, or if you are lucky you may summon a full character, try your luck, and most of all have fun.<br/>you receive 1 free summoning ticket every hour as long as you are inside the game.<br/><br/>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T03:53:13", "background_image": "https://media.rawg.io/media/screenshots/7e5/7e58c706d82bbb20c2b20d72f766b21b.jpg", "website": "https://dracoguard.com/products/meliora.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 403, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Draco Guard"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["Draco Guard"], "esrb_rating": null}