{"id": 874501, "slug": "impasto", "name": "Impasto", "name_original": "Impasto", "description": "Impasto is a first-person horror adventure game inspired by the works and legacy of Francisco Goya, the revered yet tortured Spanish painter. Set within a world irreversibly altered by his fraying sanity, the player must use both stealth and wits to survive.<br/><br/>This is a student-made project created by undergraduate students at the University of Southern California in collaboration with students from Otis College of Art and Design, and California State University Fullerton, as well as volunteers from around the world. A full list of credits can be found in-game.<h3>THE STORY</h3>\"To my dear Mariano...\"<br/><br/>A mysterious letter of inheritance. A dark and foreboding manor. Grim and disturbing figures painted upon the very walls. A swirling canvas beckoning you to step closer, through the black ocean of paint into a world that's lost all reason.<br/><br/>Follow the path of Mariano Goya as he enters the dark and twisted Painted World of his grandfather, the famed and tortured artist Francisco Goya, in order to uncover his secret legacy. Plunge deep into the tragic fall of one of history's greatest artists and come face to face with his darkest creations brought to life.<br/><br/>Meet the distorted denizens who reside within the paint, navigate through the shadowed streets of a town brought to heel by the brutal inquisition, and explore the ancient ruins of a forgotten old god. You must evade the Painted World’s many dangers, solve its puzzles, and uncover its dark secrets, in a journey both to return home and to discover what could give birth to this land of nightmares.", "metacritic": null, "released": "2022-11-02", "tba": false, "updated": "2024-01-01T09:18:04", "background_image": "https://media.rawg.io/media/screenshots/b65/b652aaa4c7445f6d80fe332e5bbdefd2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 2, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Impasto Team"], "genres": ["Adventure", "Indie"], "publishers": ["USC Games", "Juggernaut Entertainment"], "esrb_rating": null}