{"id": 874509, "slug": "classical-music-minesweeper", "name": "Classical Music Minesweeper", "name_original": "Classical Music Minesweeper", "description": "Although it is a music game, it does not require complicated controls or memorization of musical scores.<br/>\r\nWhat is required is the ability to distinguish sounds.<br/>\n<br/>\r\nThe number of mines in a traditional minesweeper is represented by a number.<br/>\r\nIn this game, the number of mines is represented by the sound of a piano.<br/>\r\nIf there is one mine in the vicinity, one type of sound will be played.<br/>\r\nIf there are three mines, three different sounds will sound simultaneously.<br/>\n<br/>\r\nWhen you left-click, a sound is played if there are mines in the surrounding 8 squares.<br/>\r\nIn addition, if the center square is unopened, it will be disclosed.<br/>\r\nWith the right click, mines can be marked.<br/>\n<br/>\r\nAnd each mine has a different phrase.<br/>\r\nUnlike regular minesweepers, it is possible to identify not only the number of mines, but also the type of mine, so that<br/>\r\nthere are very few cases where you are dependent on luck.<br/>\n<br/>\r\nThere are also other elements that make the game more than just a minesweeper, such as squares where the sound cannot be confirmed after it has been disclosed.<br/>\n<br/>\r\n16 stages<br/>\r\n8 pieces of classical music<br/>\r\n4 arrangements of classical music<br/>\r\n(The reason why the total number of songs does not add up to 16 is that there are overlapping stages.)", "metacritic": null, "released": "2022-11-03", "tba": false, "updated": "2022-11-04T05:33:23", "background_image": "https://media.rawg.io/media/screenshots/61b/61ba81f5951894f8686ff23677fe3588.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kiki Castella"], "genres": ["Casual"], "publishers": ["Kiki Castella"], "esrb_rating": null}