{"id": 874630, "slug": "saving-the-world-from-slime", "name": "Saving the World from Slime", "name_original": "Saving the World from Slime", "description": "<p>A resource management idle game. Slimes have taken over the world. As one of the last remaining scientists, you decide to tackle the sticky situation with a fresh perspective.</p>\n<p>Features:</p>\n<ul><li>Idle Game (Not a clicker Game)</li><li>Idle multiplier that increases profits based on how long you've been idle</li><li>Punishes the player for clicking by decreasing the idle multiplier</li><li>Auto saves every 5 minutes and on exiting the game (you can end the game with task manager to bypass the save)</li><li>Prestige system</li><li>Autobuyers</li><li>Pixel Graphics (made by myself and a friend)</li><li>No annoying music (or any other music)</li></ul>\n<p>Just a heads up, silly me forgot to add one of the functionalities to Capacitive Slimes. I recommend buying only a few of them because in the next update each one will reduce the amount of Energy you produce by a little bit.</p>\n<p>I plan on releasing an update within 2 weeks of the previous update. I've got college and other responsibilities, so 2 weeks allow me time if my schedule becomes full. I will likely release updates more frequently than that.</p>\n<p>Planned Features:</p>\n<ul><li>Slime Guide that explains the game and acts as a companion</li><li>More upgrades, unique slimes, buildings, research, and currencies.</li><li>Battle system with enemies.</li><li>Levels for unique slimes that unlock special abilities.</li><li>Downloadable saves for exporting and importing between devices. This will also help with bug reports.</li><li>Options including FPS, font size, and some colors.</li><li>Better implementation of offline progress so that it doesn't almost break the game.</li></ul>\n<p>The game will resize text and clickable elements to fit your screen, but ultra-wide or ultra-tall screens may pose problems. This was meant to be played on a wider-than-tall screen. I do not plan on releasing a separate build for phones, but I will modify the game's styles to be better for phone screens. I will also eventually release an HTML version that can be played on supported browsers, including those on phones.</p>\n<p>If anything weird happens please let me know. I eliminated as many bugs as I could and added checks for parts of the game that could become problematic in extreme circumstances. There should be no bugs or glitches, but I expect that at least one got through. The best places to reach me are here and on my discord server dedicated to my indie games.<br/></p>\n<p>Controls</p>\n<p>This game is free to download and play.</p>\n<p>I hope you enjoy my game and thank you for playing!</p>", "metacritic": null, "released": "2022-11-03", "tba": false, "updated": "2022-11-04T06:48:33", "background_image": "https://media.rawg.io/media/screenshots/90e/90e607501cf85b2456bc405b400577dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 40, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fish767"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}