{"id": 87483, "slug": "cliff-diving-champ", "name": "Cliff Diving Champ", "name_original": "Cliff Diving Champ", "description": "The ultimate Cliff Diving Simulator!<br/>***** <br/>\" Easily the best cliff diving game out there! \"<br/>\" Well worth the money...\"<br/><br/>Take your diver from the junior 3m local rocky beach meet all the way up to international top events at the whopping, high adrenaline, life-threathening 26m platform. <br/><br/>The game is an evolution of DiveChamp, our other simulation of the more classic indoor acrobatic diving. It features just as realistic graphics captured from experienced divers, the signature ultra-smooth animation and responsive controls for optimal gameplay following closely the beautiful and dangerous sport of cliff diving!<br/><br/>Other features: <br/>- Wide range of heights: 3, 5, 10, 15, 18, 21 and ultimate 26m platforms<br/>- Forward, Back, Reverse, Inward and Armstands dives.<br/>- Pike, Tuck and Twists positions<br/>- Allows freestyle practice; enjoy ripping a simple reverse dive or a double back flip with quadruple twist!<br/>- RPG elements: customize and upgrade your diver thanks to the experience you accumulate by competing and practicing!<br/>- Offers 3 to 5 judges and a palette of qualifying standards just like in real life!<br/>- Follows most FINA and HDA codes, DD rules and judging regulations<br/>- Full Game centre support: achievements, leader boards and in-app store transactions.<br/>- supports all devices with iOS beyond 8.0 (including latest units like iPhone X, XS, Max)", "metacritic": null, "released": "2012-12-20", "tba": false, "updated": "2019-08-02T04:31:05", "background_image": "https://media.rawg.io/media/screenshots/207/20764c86a0623375a161843a56446570.jpg", "website": "http://www.popottesoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 152, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jean-Baptiste Bolcato"], "genres": ["Simulation", "Sports"], "publishers": ["Jean-Baptiste Bolcato"], "esrb_rating": null}