{"id": 874877, "slug": "peppys-adventure-itch", "name": "Peppy's Adventure (itch)", "name_original": "Peppy's Adventure (itch)", "description": "<p>Peppy’s Adventure is a 1-screen, top-down, action-puzzle game controlled with directional inputs only. You control Peppy, a bun-shaped bunny, on his journey to rescue the village younglings from the clutches of the Hooded Fox. As you pursue his airship, you will have to solve your way through short challenging levels as fast as possible facing an army of reckless foxes.</p>\n\n<p>Peppy’s Adventure is mixing retro gameplay and 16-bits inspired soundtrack with original sharp sprite-based graphics and a colorful palette. It features simple 2D animated elements and multi-themed tilesets reminiscent of retro console games.</p>\n\n<p><strong>Key features</strong></p>\n<ul><li>1-screen &amp; grid-based movement challenging action-puzzles<br/>\n</li><li>Different ways to solve puzzles depending on your skills, taking risks will be rewarding<br/>\n</li><li>Easy controls in 4 directions, you will be surprised at how much you can achieve without action buttons<br/>\n</li><li>Experiment on how to manipulate foxes at your advantage<br/>\n</li><li>Rewind time to undo previous actions up to 10s<br/>\n</li><li>126 unique levels across 6 worlds with specific characteristics and power-ups<br/>\n</li><li>Unlock special levels, bosses, rewards and secrets<br/>\n</li><li>Die-and-retry mechanics, allows to quick restart a level until you master it<br/>\n</li><li>Per-level replay feature to help you improve your records and share your gameplay videos with the community<br/>\n</li><li>Time Attack mode per World<br/>\n</li><li>Can you top the 4-stars staff records?\r\n</li></ul>\n\n<p>This release features 6 worlds and 126 levels. Development is ongoing and new worlds including new themes and new features will be added as free updates until completion of the storyline.</p>\n\n<p><strong>Trailer (2021)</strong></p>\n\n<br/>", "metacritic": null, "released": "2022-10-26", "tba": false, "updated": "2022-11-04T08:34:33", "background_image": "https://media.rawg.io/media/screenshots/381/3816169cfb2dc446c8598c782ecc0500.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 257, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["pepitestudios"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}