{"id": 875106, "slug": "kingdom-come-rush", "name": "Kingdom Come RUSH", "name_original": "Kingdom Come RUSH", "description": "Overview\r\n<p>Kingdom Come RUSH is an endless strategy game featuring characters from Kingdom Come Rising. Fight your way through an onslaught of blocky enemies, from monsters with visors to black and red voids. Once you die in a RUSH, you’ll be able to use rewards that you earn based on your performance to unlock more content such as characters and weapons. Pick a character and weapon combo that fits your playstyle! Can you unlock it all?\r\n</p>\n<p>With 15 total playable characters (8 of which are available from the start) and 14 weapons (6 of which are available from the start), you’ll have a lot of different combinations to choose from. Different characters have different abilities, and also use different amounts of SP (Special Power) for each special attack. And each weapon has a unique bonus. Part of your strategy is finding the right character and weapon combo for the job.\r\n</p>\n<p>Once you’ve chosen your character and weapon, and begun a RUSH, you’ll be thrown onto a map with three enemies. Walk up to an enemy, and a battle will begin. Winning the battle will award you with one level up, some score, and 1 SP. After you’ve fought some battles, you can walk over to a portal on the map, and you’ll be warped to another map, once again with three enemies. Try to survive as long as possible! The higher the score you get, and the higher the level you reach, the more rewards you’ll get!\r\n</p>\n<p>In the RUSH SHOP, you’ll be able to use rewards you earn from RUSHing to buy characters, weapons, XP, and headstarts. Some items here will have special requirements, such as reaching a certain Player Level first. Once you’ve met the special requirements, you’ll be able to purchase the item.\r\n</p>\r\nRequirements\r\n<ul><li>CPU: Any decent 64-bit processor\r\n</li><li>GPU: Integrated graphics work fine\r\n</li><li>RAM: 2GB or more, 4GB recommended\r\n</li><li>OS: Any 64-bit Linux distribution, 64-bit Windows (10 or newer is recommended), or 64-bit Android\r\n</li></ul>\r\nFAQ\r\n<p>Question: What platforms does Kingdom Come RUSH support?\r\n</p>\n<p>Answer: Linux, Windows, Raspberry Pi, and Android. You are also able to play on other platforms using the browser version.\r\n</p>\n<p>Question: How long does it take to clear the game?\r\n</p>\n<p>Answer: It will vary based on your performance in each RUSH, however it will take several hours at least, regardless of your performance.\r\n</p>\n<p>Question: Is there a Hard difficulty?\r\n</p>\n<p>Answer: Yes. You can access the “Hard RUSH” mode after obtaining all characters and weapons, reaching Player Level 50, and reaching Level 100 in a RUSH.\r\n</p>\n<p>Question: Does this game have a story?\r\n</p>\n<p>Answer: Yes. The basic storyline is explained in the manual. However, there aren’t any cutscenes in the game until you fight the final boss: Sakaro.\r\n</p>\n<p>Question: How do I unlock the final boss fight?\r\n</p>\n<p>Answer: You unlock the final boss in the same way you unlock Hard RUSH.\r\n</p>\n<p>Question: Where do I get the manual?\r\n</p>\n<p>Answer: All downloadable versions of the game contain the manual in their archive. If you want to exclusively play the browser version, you can download the manual by itself.\r\n</p>\n<p>Question: Are there online leaderboards?\r\n</p>\n<p>Answer: No. Kingdom Come RUSH currently does not have any online functionality.\r\n</p>\n<p>Question: What game engine was this made with?\r\n</p>\n<p>Answer: This game was created using microStudio. You can check it out here.\r\n</p>\r\nEarly Bird Bonus\r\n<p>Download the game before <strong>11/10/22</strong> to receive the Early Bird Bonus! This bonus includes:\r\n</p>\n<ul><li>1500 gold to use in-game.\r\n</li><li>An exclusive wallpaper. The PC versions feature a different wallpaper than the Android version.\r\n</li></ul>\n<p>How to receive the Early Bird Bonus:\r\n</p>\n<ul><li>You will receive the gold the first time you start up the game.\r\n</li><li>The wallpaper is included in the archive.\r\n</li></ul>\n<p>You cannot obtain the Early Bird Bonus in the browser version.\r\n</p>", "metacritic": null, "released": "2022-11-02", "tba": false, "updated": "2022-11-04T10:17:02", "background_image": "https://media.rawg.io/media/screenshots/238/2385bf46b7c5add324a975bce0149bc2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "PC"], "developers": ["Hadcl4 Studios"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}