{"id": 87526, "slug": "pure-rally-racing-drift", "name": "Pure Rally Racing Drift", "name_original": "Pure Rally Racing Drift", "description": "Challenge people in a real time multiplayer match, be the fastest racer and be the king of drift !! :D<br/>Pure Gymkhana Rally is a great rally simulator in which you can do awesome drift at high speed... but not only!<br/>Jump from a container... into a container, do donuts and burnout drifting around a box, make your way between shelves or on to the dirt. <br/>Just have fun, because Pure Gymkhana Rally is Pure Fun!<br/>Really powerful cars are waiting for you, ready to get in the dirt, burning tyres in horrific drift on the edge of an harbor, or in closed to traffic streets . Jump inside the car and go warm up your racing tyres. Try to emulate the best rally drivers in their tricks!<br/>Keep making burnouts , donuts, jumps or long drift in Freestyle mode, the only important thing here is how high will be your final score!<br/>Race the faster you can, go through every single checkpoint and beat all your rivals in the leaderboard in Hotlap mode!<br/><br/>Features:<br/>- Game Center realtime Multiplayer and Leaderboard<br/>- Customize cars with your name and your flag on the side windows;<br/>- 3 modes: Freestyle, Hotlap and Freerun;<br/>- New cars and new locations always coming;<br/>- Excellent and optimized graphics;<br/>- Extremely realistic racing car physics.<br/>- Race on asphalt, sand or dirt<br/>- Realtime damage<br/>- Orbit and zoom around the car in pause mode to take amazing screenshot and share them!", "metacritic": null, "released": "2016-05-27", "tba": false, "updated": "2019-10-22T14:20:45", "background_image": "https://media.rawg.io/media/screenshots/879/879829e2d21894e71cfbd46e45742003.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Vincenzo Cosentino"], "genres": ["Simulation", "Racing"], "publishers": ["Vincenzo Cosentino"], "esrb_rating": null}