{"id": 875330, "slug": "full-gear-demo", "name": "Full Gear (demo)", "name_original": "Full Gear (demo)", "description": "<p><em>Will you, too, be here?</em></p>\n<p><strong>Welcome to Full Gear!</strong> In short: A steampunk traditional roguelike with open-world elements, unlockable goals, gizmos, gears and gadgets! Shoot guns, fire flamethrowers, taser enemies, or just let them fight each other in a deathmatch between man (you) and machine (literally everything else). Don't worry about moral consequences! Nothing here is alive! Except for those fancy NPC's... maybe they'll have some stories.</p>\n\n<p>Fight your way through four randomly-generated areas and beat all three bosses to win this demo version (there's no cutscene or anything, though). Full version with 7 areas plus final boss will be released on Steam when it's ready. Which it will be eventually, I promise.</p>\n<p>Full version has, for example, the Wasteland! With freeze and ice and crabs. there's- there's crabs.</p>\n\n<p>This <strong>demo version</strong> is to generate some feedback I can use to balance the game and make the release better for everyone. Making a game is difficult, after all, and I can't do it without some testers. Do you fancy to take a minute out of your time to fight the Quadron, to activate the Bell Tower, or to find the \"Substantial\" (whetever that means)? Then get on in, play a little bit, die, play some more, die, okay seriously stop dying it's not that difficult, right?</p>\n\n<p>There's a lot of work to do, really.</p>\n<ul><li>No music, and incomplete sound effects</li><li>No sprite for the player in the menus</li><li>No Challenges and Bonuses</li><li>No [you can't do that, Devi. that's classified], even though it'd be really cool</li><li>And a few areas are missing, but we'll get to that.</li></ul>\n<p>So I hope some people will stick around!</p>\n<p><em>Will you, too, see gears?</em></p><p><strong>I'll be keeping this demo version - with restricted areas, of course - up to date and keep fixing bugs and balancing things when needed.</strong></p><p><em>2022/11/03</em></p>\n<ul><li>The format is now a directly executable zip file, being able to work on hopefully all platforms.</li><li>Changed: Bosses can now target drones and enemies</li><li>Changed: slightly improved the Mango texture</li><li>Changed: Disconnected enemies now target the player when they're too far away.</li><li>Fixed: crash when shift-clicking items in NPC slots</li><li>Fixed: rare crash regarding spawning enemies</li><li>Fixed: controls would still work when window wasn't focused</li><li>Fixed: enemies wouldn't always take the best route to the player</li><li>Fixed: \"turn(s)\" to either \"turn\" or \"turns\"</li><li>Fixed: player would appear in front of Units</li><li>Fixed: Mutant Wanderers/Mad Scientists throwing traps through walls</li><li>Slightly reduced lag after beating more areas.</li></ul>", "metacritic": null, "released": "2022-11-01", "tba": false, "updated": "2022-11-04T11:43:39", "background_image": "https://media.rawg.io/media/screenshots/9af/9af3128c97b7dc995f300baec943e93e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dieuwt"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}