{"id": 875479, "slug": "goatfish-2", "name": "Goatfish 2", "name_original": "Goatfish 2", "description": "<strong>HELLO, AND WELCOME TO GOATFISH 2!</strong>\n<p>Join Goatfish on a DEEP DIVE into 8-bit history, as she tries to discover the names of several classic computer games while EATING as much as she can!</p>\n<p><strong>GO GOATFISH!</strong><br/>\n<strong>GOAT HARDER!!!</strong></p>\n<p><strong>RUNNING THE GAME</strong></p>\n<p>To run Goatfish 2 from disk, insert the disk and type:<br/>\r\nRUN”GF2.BAS</p>\n<p>To run from tape, insert the tape and type:<br/>\r\nRUN”</p>\n<strong>PLAYING THE GAME</strong>\n<p>On the main menu, press I for instructions, C for credits, or any other key to play.</p>\n<p><strong>EAT TO SURVIVE<br/>\r\nJOYSTICK/ARROWS to SWIM<br/>\r\nFIRE/SPACE to DIVE<br/>\r\n(P) to PAUSE<br/>\r\n(ESC) to QUIT</strong></p>\n<p>In the game, Goatfish swims deeper and deeper into the ocean looking for delicious food to eat. However, every time she lands on a platform, she will bounce! Reach the yellow “brick” gate to complete a level!</p>\n<p>Goatfish’s energy is shown at the bottom of the screen, along with your score. Collect food to maintain Goatfish’s energy and increase your score, while avoiding the angry red faces and large urchins (which will deplete her energy).</p>\n<strong>TIPS</strong>\n<ul>\n<li>\n<p>Try to eat as much food as possible in each bounce, to help Goatfish keep moving fast!</p>\n</li>\n<li>\n<p>Sometimes low-value food (such as apples) isn't worth collecting, unless more than one can be eaten in one bounce.</p>\n</li>\n<li>\n<p>If Goatfish hits multiple angry faces or urchins at once, she will only be hurt by one of them.</p>\n</li>\n<li>\n<p>On level 2, Goatfish’s energy depletes slightly more quickly, and even more quickly on level 3!</p>\n</li>\n<li>\n<p>If a high-value food item is surrounded by urchins, it may still be worth collecting even if Goatfish hits an urchin – but of course avoiding the urchins is much more satisfying (and healthy)!</p>\n</li>\n<li>\n<p>DIVE (SPACE/FIRE)</p>\n<ul>\n<li>\n<p>Diving is optional but helps Goatfish move quickly through areas you are comfortable with.</p>\n</li>\n<li>\n<p>Maximum forward speed is doubled, but so is energy consumption.</p>\n</li>\n<li>\n<p>Useful for rushing past urchins but hitting one whilst diving causes double damage.</p>\n</li>\n<li>\n<p>Try not to dive when bouncing up, as the bounce must complete before the dive takes effect. Diving too early will just waste energy.</p>\n</li>\n<li>\n<p>Bouncing while diving causes larger jumps, depending on the speed Goatfish is travelling at. This can help with jumping over dangerous areas or reaching other platforms.</p>\n</li>\n<li>\n<p>If it isn’t necessary, try not to dive right before collecting food or hitting a platform.  Smaller bounces will help Goatfish move through the ocean more quickly.</p>\n</li>\n</ul>\n</li>\n</ul>\n<strong>LARCENAS LEGACY GESTURE</strong>\n<p>As Goatfish’s ocean world consists of platforms, I thought it would be ideal to include a tribute to Larcenas Legacy in the form of a platform tile, so I drew a sprite based on the yellow bricks thrown by Larcenas.</p>\n<p>The yellow brick tiles represent the end-of-level gate, and Goatfish must land on it in order to complete the current level. Beware of missing the gate, as danger lurks beneath!</p>\n<strong>DEVELOPMENT HISTORY</strong>\n<p>For many years I have been very interested in the sprite scaling effects used in the arcade games of the late 1980s and early 1990s, particularly those used in many of Sega’s classic games.</p>\n<p>I have wondered for a long time if it would be possible to create something similar on the humble Amstrad CPC464, which was the computer of my childhood all those years ago.</p>\n<p>Goatfish 2 features real-time sprite scaling for all objects in the game world, apart from Goatfish herself. The scaling technique is based on the method used by the Neo Geo console, though of course without that console’s hardware assistance.</p>\n<p>Goatfish 2 makes extensive use of compression (often in real-time during gameplay) in order to fit everything into memory. The game uses a double-buffered display, so efficient memory usage is very important. Only two copies of each food, platform and urchin sprite are stored in memory (one on a byte boundary, and one shifted). All the other sizes of each sprite are scaled in real-time from those base sprites.</p>\n<p>The code became very messy during a long and difficult optimisation phase, and as a result it is unfortunately quite hard to follow now. A game like this needs to be fast enough to be playable and responsive, so I spent a lot of time experimenting with ideas to make things go faster!</p>\n<p>The game design is heavily influenced by the classic game Bounder, by Gremlin Graphics. The gameplay is somewhat similar, though Goatfish 2 is presented from a 3D viewpoint.</p>\n<p>I tried to employ careful use of colour to make levels easier to \"read\" and understand visually, although it does get a little more visually confusing later, particularly on the last level.</p>\n<p>Regarding level design, I wanted to pay tribute to a number of classic 8-bit computer games (look carefully and you'll find clues throughout the game).</p>\n<strong>THANK YOU</strong>\n<p>Thanks to my beautiful wife and daughters, who were very patient during the long development of Goatfish 2.</p>\n<p>Thanks to Antonia for designing the Goatfish character, and for the delightful little tune that plays on the main menu – I think she has captured the spirit of the game very well, and I am very proud of her!</p>\n<p>Thanks to Zoe for designing the angry red faces and large urchins. She enjoys contributing to my games and I’m very happy that some of her creations are in the game!</p>\n<p>Thanks to Fran Gallego and the rest of the CPCTelera team. Without your incredible (and very generous) efforts, none of this would have been possible.</p>\n<p>Thank you for playing Goatfish 2, I hope you enjoy it.</p>\n<p>Ervin Pajor<br/>\r\n2022</p>\n<strong>AUTHORS</strong>\n<p>Written by Ervin Pajor in 2022<br/>\r\nGoatfish character devised by Antonia<br/>\r\nMusic by Antonia<br/>\r\nUrchins by Zoe</p>\n<strong>LICENSE</strong>\n<p>Goatfish 2 is licensed with the GNU GENERAL PUBLIC LICENSE Version 3 (https://www.gnu.org/licenses/gpl-3.0.en.html)</p>\n<strong>TOOLS</strong>\n<p>C / Z80 assembly</p>\n<p>CPCTelera 1.5<br/>\r\nhttps://github.com/lronaldo/cpctelera</p>\n<p>Sublime Text build 4126: code editor<br/>\r\nhttps://www.sublimetext.com/</p>\n<p>Photofiltre 7.2.1: graphics<br/>\r\nhttp://www.photofiltre.com/</p>\n<p>Arkos Tracker 1.0: music and sound effects<br/>\r\nhttp://www.julien-nevo.com/arkos/arkostracker1/</p>\n<p>RASM 1.8a: data file compilation<br/>\r\nhttps://github.com/EdouardBERGE/rasm</p>\n<p>BlitzMAX 1.51: to write tools to convert image files into data files<br/>\r\nhttps://nitrologic.itch.io/blitzmax</p>\n<p>Blitz3D 1108: to write the level editor<br/>\r\nhttps://nitrologic.itch.io/blitz3d</p>\n<p>WinAPE 2.0 Beta 2: for testing<br/>\r\nhttp://www.winape.net/</p>\n<p><strong>COMPILING THE SOURCE CODE</strong></p>\n<p>Create a new cpctelera project called \"gf2\".<br/>\n<br/>\r\nDownload \"source code.zip\" from this page, and extract the contents.<br/>\r\nCopy the extracted \"src\" folder into the \"gf2\" project folder.</p>\n<p>cfg\\build_config.mk must be modified to include the following lines:<br/>\r\nPROJNAME   := gf2<br/>\r\nZ80CODELOC := 0x2000</p>\n<p>To compile, navigate to the gf2 project folder and type:<br/>\r\nmake cleanall &amp;&amp; make</p>", "metacritic": null, "released": "2022-11-01", "tba": false, "updated": "2022-11-04T12:53:32", "background_image": "https://media.rawg.io/media/screenshots/c21/c21c883b995657ec71568b5de35086ea.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 41, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["poppichicken"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}