{"id": 875776, "slug": "the-castle-tongue", "name": "The Castle Tongue", "name_original": "The Castle Tongue", "description": "<p>    “Son,\r\n </p>\n<p>    I’m so sorry you had to go through this because of me. I wouldn’t send you to that evil place and put your life at risk for all the treasures in the world. But I know I can’t change your mind and I respect your decision. I’d love to help you more but all I can give you is information. Believe me, you will need all the information you can get.\r\n </p>\n<p>    The castle you are about to enter is magic. The legends say whoever reaches the lowest floor of this castle finds treasures beyond their dreams. Of course there is a catch: The castle is filled with death traps.   </p>\n<p>    There are many rumors to what these traps are, but nobody lived through them to tell the tale. After all, once you go in, there is no coming out until you succeed or die. But be brave, there is hope.   </p>\n<p>    Once you reach the castle door <strong>don’t enter right away</strong>. Look around you for a bit. <strong>You’ll find there are a few people who live along those streets. Talk to them.</strong> They know about this castle more than you’d think. Make no mistake, they won’t want to help you. These are not normal people. They are cursed with the castle’s influence. Don’t ask me how I know this, but they are the castle’s servants. They are the key to this secret. Do whatever you can to convince them to help you. This is the only way you can get out of that cursed castle alive.\r\n </p>\n<p>    Don’t forget this: <strong>Once you ask them for help about the castle’s secrets, there is no turning back. You can’t convince them afterwards. It’s essential to do whatever you can to convince them before asking for their help.</strong>\n</p>\n<p>   Ask them about each other. Observe them, observe your surroundings. Only then you will know what they want to hear.\r\n </p>\n<p>   So, heed your father’s words and came to us alive and well.\r\n </p>\n<p>                                                                                                          Your loving father.”\r\n <br/></p>\n\n<p>    Talk to the villagers. Try to get a read on their personality and use your skills to get them to help. To conquer the castle their help will be imperative.</p>\n<p>    Taking notes could be helpful since they'll share important information that you'll have to remember.</p>\n<p>    Have fun!</p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T15:04:25", "background_image": "https://media.rawg.io/media/screenshots/afb/afba7a7b1479f13ad79caf0881059f9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 185, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["civanT"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}