{"id": 875721, "slug": "neonnoir", "name": "NEONnoir", "name_original": "NEONnoir", "description": "The acid rain washed the city's neon blood into the Gutter; home for those who ran out of options.\r\n<br/><br/>The Gutter wasn't just a cliche metaphor, it was the city's most ruthless and dangerous district. Few chose to live there willingly; when your credits ran dry, there was nowhere else to go.<br/><br/>When Danni Ashton went missing, her worried father came to you for help. Can you find her before it's too late?\r\nDescription\r\n<p><strong>NEONnoir</strong> is a hybrid point-and-click adventure/visual novel game for the Amiga 1200.</p>\n<p>This game was created over 5 months for the Amiga Blitz Basic Game Jam whose purpose was to bring few faces into that community and help share knowledge of Blitz Basic programming.</p>\n<p>I'd never heard of Blitz Basic before, but the community was so supportive and uplifting that I could not help but participate. This is my flowery way of saying, <em>\"reader beware, my code is crap.\"</em> I would do things completely differently now that I've learned so much. <br/></p>\n<p>Five months sounds like a lot, but it's the longest I've ever worked on a game. This is the most complex story I've ever made and while it's silly and full of tropes, I'm pretty proud of it.</p>\r\nYour time is precious, here's a walkthrough!\r\nInstallation\r\n<p>In order to play the game you need an Amiga 1200 with a hard drive or an emulator, such as WinUAE. Unfortunately, in order to emulate an Amiga, you will need the system ROMs. Those can be purchased at https://www.amigaforever.com/</p>\n<p>Once you have a working environment, you need to download the NEONnoir.lha file and extract it on your hard drive. Find the NEONnoir executable and double-click it. You'll be solving mysteries in no time!</p>\r\nHow to play\r\n<p>The game is point-and-click and it has a very minimal inventory system. You won't need to try every object on every surface in order to advance. However, here's how you control the game.</p>\n<p>The game is entirely mouse driven. As such you will see 4 different types of mouse pointers:</p>\n<br/>The regular mouse pointer.<br/><br/>Will tell you something interesting when hovered over a part of the scene<br/><br/>Will use of otherwise engage what ever is under it<br/><br/>Leaves the current scene. A lot of times, the edges of the screen contain an exit<br/><br/>Please wait, the game is loading.<br/>\n<p>You can access the game's menu to look at your inventory, save the game, or quit the game by clicking on the PDA icon on the bottom right of the screen. It looks like this:</p>\n\r\nCode and License\r\n<p>To make the game, I've build a few tools for myself that run on Windows: palette editors, image converters, an assembly like language that runs user scripts inside the game, and of course a game editor. This code is also crap. I was throwing together things as quickly as possible. Good luck running the editor <strong><em>not</em></strong> attached to a debugger.</p>\n<p>Since this was meant to be an educational tool, the source code has a dual license:</p>\n<ul><li>All the Blitz Basic and C++ source code is licensed under the CC BY 4.0 license. That means that you can use, remix, change, and update the code as you see fit. You just need to give me attribution.</li><li>All other assets are licensed under CC BY-NC-ND 4.0. You can use them for educational purposes but you cannot make any derivative works from it. In other words, please don't use my assets for your games.</li></ul>\n<p>The source code in Amiga friendly format is found as one of the downloads, or for the development environment, you can see my Github: https://github.com/steamknight/NEONnoir<br/></p>\r\nCredits\r\n<p>Programming, Story, and some Art: me :)</p>\n<p>Additional art by SandySketches</p>\n<p>Music by Matías Sosa<br/></p>\n<p>Special thanks to all the new friends I made on the https://discord.gg/eu7vRzYPXd who have not only helped me learn this new language, supported me in my longest project to date!<br/></p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T14:39:13", "background_image": "https://media.rawg.io/media/screenshots/9fe/9feb0bc8e22e225500c62a5751e4c4e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 248, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["steamknight"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}