{"id": 875731, "slug": "the-dream-treyer", "name": "The Dream (Treyer)", "name_original": "The Dream (Treyer)", "description": "<p>Jogo completamente feito por mim, desde progamação, arte, musica etc..</p>\n<p>Jogo:</p>\n<p>Você é um garoto perdido em uma praia de uma ilha gigante a noite, existe uma entidade te perseguindo, seu objetivo é pegar todas as 10 folhas espalhadas pelo mapa sem morrer pela entidade</p>\n<p>Assim que você pegar as 10 folhas uma coisa surpreendente vai acontecer!</p>\n\n<p>Controles:</p>\n\n<p>Seta pra direita ou D: direita</p>\n<p>Seta pra esquerda ou A: esquerda</p>\n<p>Seta pra cima ou W: cima</p>\n<p>Seta pra baixo ou S: baixo</p>\n<p>E: Interação</p>\n<p>Enter: Pular</p>\n\n\n<p>Aviso:</p>\n<p>Esse jogo contém Jumpscares</p>\n<p>O jogo fecha toda vez que você morre por não ter tempo de fazer algo mais complexo como voltar ao menu ou algo do tipo, obs: o jogo é bem dificil e as mecanicas não foram feitas da melhor forma possivel então se algo bugar no jogo porfavor me avise, pretendo arrumar bugs e deixar o jogo bem mais polido do que agora.</p>\n<p>Outro Obs: o jogo é dificil então não estranhe se você não passar mesmo depois de umas 100 vezes :D</p>\n<p>Entrei na Game jam no segundo dia dela então peço desculpa por bugs ou algo do tipo, não tive tempo de polir e nem jogar muito meu jogo.</p>\n<p>Essa é minha segunda game jam e estou muito feliz por estar participando dela, espero que gostem do jogo, deu muito trabalho, principalmente por eu fazer tudo sozinho!</p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T14:43:53", "background_image": "https://media.rawg.io/media/screenshots/9dd/9dd4c2835a416c27464794a059c5b7e0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Treyer"], "genres": [], "publishers": [], "esrb_rating": null}