{"id": 87575, "slug": "multi-driving-story-2017-city-driving-school", "name": "Multi Driving Story 2017 - City Driving School", "name_original": "Multi Driving Story 2017 - City Driving School", "description": "Want to mark your name as best city driver in Multi Driving Story 2017? If yes, then get ready for challenging driving missions where you have multi vehicles at your disposal. Choose your favorite vehicle to drive on the vast roads of modern big city in this multi driving story.<br/><br/><br/>A good driver should have expertise in driving multi vehicles and should not rely on single vehicle. As traffic jams are increasing daily making extreme rush on the roads it is necessary to know how to drive multi vehicles like car, bus, taxi and bike to save your precious time and reach destination on time. Multi Driving Story 2017 brings you this amazing opportunity to handle and gain control of multi vehicles in vast city environment with realistic driving controls.<br/><br/><br/>Enjoy an amazing fast ride on bike, bus, car and Limo in the best driving simulator of 2017. Explore and move around the big modern city and reach your destination within the given time. Give ride to the passengers and drop them at their destination in this realistic driving simulation. You can choose different camera angle whichever you reckon is best. Avoid hitting civilians walking on the road side and standing on the stop.<br/>Prepare yourself for a crazy driving story in a beautiful big modern city where you have the opportunity to polish your driving skills on multi vehicles like car, bus, limo and bike. Follow the map while driving to avoid getting lost on the roads.<br/><br/><br/>Get your hands on driving the huge city bus, the luxurious limousine, taxi cab and heavy bikes on the carpeted city roads.  Feel the thrill and craziness of driving multi vehicles in a single driving story. Enjoy the multi driving experience and check your driving expertise. Pick and drop the passengers to different locations. Reach the end point following the best possible route to save your time and gain XP. Unlock different vehicles and enjoy driving multi vehicles in a single game.<br/><br/><br/>Features:<br/>•\tDifferent Camera Angles<br/>•\tRealistic Driving Simulation<br/>•\tAmazing 3D City Environment<br/>•\tGain XP and Unlock Vehicles<br/>•\tMulti Vehicles on Display", "metacritic": null, "released": "2017-03-22", "tba": false, "updated": "2019-10-22T14:20:46", "background_image": "https://media.rawg.io/media/screenshots/515/515f559bf9a20b5934bd3451c7d2ee76.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["RPG", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": null}