{"id": 876074, "slug": "a-good-day", "name": "A Good Day", "name_original": "A Good Day", "description": "<p>A Good Day is a collection of asymmetric action games bringing the best of this genre to online multiplayer. Play as a team to defeat a single powerful enemy or feel the thrill of defeating a whole team by yourself!<br/></p>\r\nAsymmetric multiplayer\r\n<p>As a Teen looking for adventure, team up with up to 3 like-minded youngsters to uncover the secrets of the village. As Mr or Mrs Crosby, you will be alone to defend your quiet way of life. Use your strength. Two very different gameplays await in each game mode.<br/></p>\r\nMultiplayer fun\r\n<p>Games are easy to grasp and only last a few minutes. Install the game of your smartphones and PC for easy to setup multiplayer. Play with anyone in the world with state-of-the-art netcode. Persevere against the current winner or switch teams before trying the other game modes, and then play « one final game » of your favorite!<br/></p>\r\nJewel Run (try it in the demo!)\r\n<p>The Teens try to collect as many magic fruits from the Crosbys’ loom as they can before getting hit on the head. The Crosbys, slow but powerful, will have to tactically use their dogs to corner and tackle the young rascals.<br/></p>\r\nWolf Chase\r\n<p>Is there really a werewolf near the village? The Teens’ favorite game is to pretend there is, when they play to hunt one of them, who wears a pretty realistic wolf mask found in the Crosbys’ attic. During the full moon, they may discover that the eery mask has strange powers… Between hide-and-seek and tag, Wolf Chase is an exhilarating game mode where the hunter and the hunted can quickly switch.<br/></p>\r\nHaunted House\r\n<p>The Teens want to find proof that the Crosbys are behind weird events in the village. They will have to evade traps laid out by the Crosby in this Scoobidoo-like horror game mode. Will they survive?</p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T17:26:34", "background_image": "https://media.rawg.io/media/screenshots/239/23908c1cbfd5e9d087c092bd11b1e532.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 268, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["CerbereGames"], "genres": [], "publishers": [], "esrb_rating": null}