{"id": 876037, "slug": "abyssal-cabbage_corp", "name": "ABYSSAL (cabbage_corp)", "name_original": "ABYSSAL (cabbage_corp)", "description": "DESCRIPTION\r\n<p>You are Johnny Deep, a well known treasure hunter, who one day received a strange letter from an unknown source. The letter contained a map with a coordinate in the middle of the Pacific Ocean and some notes where it stated that the biggest treasure known until now was in an abyssal trench, waiting until someone would find it.<br/></p>\n<p>With no hesitation, you bought a bathyscaphe and started the journey: that treasure must be yours! But what you didn’t know was that you weren’t the only one who received the letter. The treasure location was sent to the biggest treasure hunters of the entire globe, so you will have to ensure you’re the first one to find the treasure. In the gameplay, you will be able to encounter one of these treasure hunters, Larcenas, but he won’t be too well equipped for the adventure…</p>\n<p>As long as you go deeper in the trench, you will encounter abyssal monsters, who will try to kill you, as you entered their domains. You’ll have to survive waves of creatures in order to go deeper into the trench, but that will mean you will come across deadlier monsters (some of them will be mechanized too!).</p>\n<p>Will you be able to survive 90 waves of sea creatures? Will you have the guts to fight the 3 bosses that are looking forwards to making you pay for entering their domains? Will you reach the bottom of the abyssal trench and get the treasure? There’s only one way to know the answer for those questions, so we hope you brought your life jacket with yourself…</p>\n\r\nHOW TO PLAY\r\n<p>Your bathyscaphe is well equipped with a laser gun, that you will need to kill the sea creatures that you will encounter.</p>\n<p>The bathyscaphe works with energy, and when you receive damage, you will lose energy. But don’t worry, you can repair your bathyscaphe. The only problem is that, as you didn’t want to split the treasure with your crew, you are the only one in the bathyscaphe, so when you try to repair it, you cannot shoot, so if you want to recover energy, you will have to stop shooting.</p>\n<p>You will have a second ability as well, that will consist of an energy pulse that will destroy all the bullets, but you will have to use some energy to deploy the pulse, so think it twice before you use the pulse when you don’t really need it.</p>\n<p>When you clean a wave, or when the enemies of the wave despawn, the next wave will start, so you will have to decide if you want to go for the maximum number of points and kill everyone, or if you want to recover some energy to be more prepared for the next wave, so you will stop shooting and start avoiding bullets until the enemies despawn.</p>\n\r\nCONTROLS\r\n<p>You can either play with the keyboard or the joystick. If you chose to control the bathyscaphe with the joystick, you will be able to use the normal shot with the fire button, but for the pulse you will have to use the keyboard due to the limitations of the joystick.</p>\n<ul><li>Q: Up</li><li>A: Down</li><li>O: Left</li><li>P: Right</li><li>Space Bar: Shot</li><li>Shift: Energy Pulse</li></ul>\n<p>Stop shooting to recover your energy bar so you don't die!!!</p>\n\r\nAUTHORS AND LICENSES\r\n<p>Game developed by Cabbage Corp. Twitter</p>\n<ul><li><strong>Code</strong>: Alberto Rius Poveda, Alfonso Ruiz Martínez, Eliseo Fuentes Martínez\r\n  </li><li><strong>Game Engine Design</strong>: Alberto Rius Poveda\r\n  </li><li><strong>Music</strong>: Eliseo Fuentes Martínez Twitter</li><li><strong>Graphics</strong>: Alfonso Ruiz Martínez Twitter</li></ul>\n<p><strong>License</strong>: the source code of this game has a Creative Commons MIT license.\r\n</p>\n\r\nGESTURE\r\n<p>According to the CPC Retrodev 2022 rules, we had to include in our game a gesture to Larcenas Legacy. We decided to include Larcenas in our story as one of the treasure hunters, and he appears as one of the obstacles you must avoid in your journey to the depths of the ocean.</p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T17:05:15", "background_image": "https://media.rawg.io/media/screenshots/2cd/2cd90fdbe5d53ae10b100c34262c8777.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["cabbage_corp"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}