{"id": 876183, "slug": "fallen-stars-flystar", "name": "Fallen Stars (FlyStar)", "name_original": "Fallen Stars (FlyStar)", "description": "<p><strong>Description</strong></p>\n<p>The story started by the user, Thomas Jackson, an astronaut from the present, searching the net for an article about the astronauts during a space mission in January 1975. But some white light flashed through and Thomas fainted. He woke up to be an astronaut from the past, Thomas William. Rogan Richard, Bobby Miller and Thomas William took part in this astronaut training. The S.E.A.M 11 spacecraft was launched on 6 October 1975 and was preparing to dock to the I.C.E.S 1 (International Centre Energy Space Station). Upon entering the station, the crew performed several duties including fixing their own spaceship for several days. After that, three cosmonauts loaded scientific specimens, films, tapes, and other gear to their spacecraft and re-enter earth. During their return to earth, unexpected things happen to them.</p>\n<p>                                                                                                                                          </p>\n<p><strong>Gameplay </strong></p>\n<p>Player need to complete several operations in order to progress throughout the game. Several cutscenes are available between scenes.</p>\n<p>                                                                                                                                          </p>\n<p><strong>Features</strong></p>\n<ul><li>Zero Gravity Movement which provide a very unique way to move in VR</li><li>Immersive Space Station Environment in VR</li><li>Easy to understand puzzles for player to play</li><li>Tutorial option for those who want to experience Zero Gravity Movement before entering the main game</li><li>Storytelling Cutscenes</li><li>Voice acting between characters</li><li>Immersive In-Game Music</li></ul>\n<p>                                                                                                                                          </p>\n<p>Fallen Stars is a game developed by FlyStar. We are a team of university students participating a program called \"DICE\" which challenges teams to develop a full-functioning VR Application in 3 months period.  </p>\n<p>We do not have any background in game development and due to time constraints, several bugs are expected and the game is not fully optimized. However, we do appreciate all the supports! :)</p>\n<p>Main Menu (Fallen Star) Soundtrack made by Hunter Riordan</p>\n<p>                                                                                                                                          </p>\n<p><em>This game might cause VR motion sickness to some audiences. This has nothing to do with the gameplay itself and player should take this as consideration before playing the game.</em><br/></p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T18:12:26", "background_image": "https://media.rawg.io/media/screenshots/7cf/7cfa34509aadcfb0202f2a298f7e73f8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FlyStar"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}