{"id": 876162, "slug": "monster-truck-stunt-and-races", "name": "Monster Truck: stunt and races", "name_original": "Monster Truck: stunt and races", "description": "<p>Participate in the <strong>Monster truck tour</strong>. Before starting the rally race, perform your stunt tricks.<br/>Drive your monster truck in a circuit prepared for hot wheels.<br/><br/>Circuit to perform stunts:<br/>A circuit has been designed with ramps, giant wheels that the monster truck must go through, trucks that it must jump over and many obstacles that you have to overcome before starting each rally.<br/><br/>Rally racing circuit:<br/>Driving a monster truck will be a very exciting experience. Drive through exciting climbing tracks, bridges, water lakes, dangerous rocks, cars, trucks, ramps and overcome obstacles and difficult terrain.<br/><br/>• You have a time limit to overcome each rally circuit.<br/>• You can know at all times where you are on the circuit and how far you need to go to reach the finish line.<br/>• If the monster truck rolls over, you will have some extra time to get the car back to its correct state.<br/><br/>Control of the monster truck:<br/>Speed up: you have a marked area on the left of the screen to accelerate the car.<br/>Brake: you have a button to brake the car.<br/>Car Balance Controls: The car can be balanced on the front end up or down. You have two buttons on the right side of the screen.<br/><br/>Characteristics of monster trucks:<br/>You play with a standard monster truck. But each of the cars has special characteristics like accelerate faster, reach more speed, more or less weight.<br/><br/>This Monster race circuit combines spontaneous entertainment with the ultimate off-road, motorsport competition. An unforgettable experience for all motor enthusiasts who like impressive stunts on the part of these gigantic vehicles.<br/>Rev up your engine and smash your vehicle playing to drive like a real road monster.<br/><br/>Each level provides an exciting driving experience and if you combine it with each of the cars, the result will be more fun!</p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T18:03:41", "background_image": "https://media.rawg.io/media/screenshots/df4/df44502c9d822d61bc4ce8ce3be7be1c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MMeGAMES"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}