{"id": 87614, "slug": "drone-on-my-phone-fpv-racing-practice", "name": "Drone On My Phone: FPV Racing Practice", "name_original": "Drone On My Phone: FPV Racing Practice", "description": "Want to learn how to fly a drone or improve your FPV flying skills? Drone On My Phone has been designed by the makers of Electric RC Sim to help you learn and improve faster. It includes challenges for both FPV (First Person View) and LOS (Line Of Sight). Many challenges are free and there is no third-party advertising.<br/><br/>Drone On My Phone now includes Bluetooth multiplayer! Challenge a nearby friend with Drone On My Phone over bluetooth.<br/><br/>Drone On My Phone uses our realistic physics engine. Beginner challenges are performed with the full physics engine and additional stabilization to simplify flying while you are still learning. This is designed to allow you to learn the skills you need a bit at a time rather than being overwhelmed with too much to remember at once. Skills to practice include hovering, landing and flying through gates.<br/><br/>When you feel you are ready, there are more advanced challenges to try. High and low rates are also available. Start low while you are learning, then switch to high rates when you are ready to go faster.<br/><br/>Drone On My Phone also includes a Games map which consists of a number of obstacle courses to fly. These are fun and will help improve your hovering and maneuvering skills.<br/><br/>Additional maps with more challenges are available as a low cost In-App Purchase (IAP) to help you take your skills to the next level. An Advanced Controller is available as a low cost IAP that allows you extra control over things such as expo, rates, FPV camera tilt, and drone mode. The default drone mode is STAB (also called angle mode), which gives automatic stabilization and is great for learning. It's the mode that most store-bought drones use. ACRO drone mode (also called rates mode) is also available via the Advanced Controller for advanced flying such as loops, flips, barrel rolls and maximum speed flying.<br/><br/>To challenge a nearby player over Bluetooth, both players should first start Drone On My Phone and go to the \"Challenges\" page.<br/>One player can then press \"Host\", and the other player can press \"Join\". When they are connected, the player who is hosting can select challenges and both players can compete in real time. All the free challenges are available to choose from. Also, if the host has purchased additional challenges, then all those challenges will be available as well. Bluetooth has a range of around 20m (60 feet), so you'll want to be sitting near each other. Perfect for that long bus ride or car trip!<br/><br/>We hope you have as much fun playing Drone On My Phone as we had making it (and playing it!)<br/><br/>Here are some of the great App Store reviews we've been getting:<br/><br/>\"This is my favorite drone app by far!! Great for a beginner like me trying to learn the basics of flying a real drone.\"<br/><br/>\"... if you can fly successfully using this app, you'll be able to fly the drone of your choice in the real world. The physics are realistic, and the obstacle course style training – in my opinion – is a really great way to learn to control your quad.\"<br/><br/>\"I've been searching for far too long for a good FPV simulator to practice or just play around when I'm at school. This game's physics are some of the closest to life you will find at the time and the controls are spot on!\"", "metacritic": null, "released": "2016-12-20", "tba": false, "updated": "2019-10-22T14:20:47", "background_image": "https://media.rawg.io/media/screenshots/470/4700b36306336f3ce213e99a36b44fe4_qDyYGjx.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["jetstripes.com"], "genres": ["Simulation", "Sports", "Racing"], "publishers": ["Ben White"], "esrb_rating": null}