{"id": 876218, "slug": "flickering-light-husbandogoddess", "name": "Flickering Light (HusbandoGoddess)", "name_original": "Flickering Light (HusbandoGoddess)", "description": "<p>There exists a world outside of our own called the Spirit Realm. In the Spirit Realm, spirits live freely, just like how humans do. However, there are six key figures that maintain harmony and life across both the Human World and in the Spirit Realm: the Elemental Avatars. These Elemental Avatars are in charge of the  different elements that help keep life going—earth, fire, light, life, water, and wind.</p>\n<p>To show appreciation to the Elemental Avatars, a festival is held every year in both the Human World and in the Spirit Realm. Where in the Human World humans must show gratitude to the Avatars by giving them gifts and praying at their shrines, spirits and the Avatars enjoy a day of festivities.</p>\n<p>However, everything comes to a halt when the Light Avatar— Lumen—disappears. Due to her disappearance, light is also disappearing. If Lumen isn't found in time, sunlight will disappear, encasing the Human World and Spirit Realm in darkness. It's up to the other Avatars, her closest friends, to find her and help her. Will they be able to save their precious friend in time? </p>\n<br/>\n<ul><li>25k words (approximately two and a half hours of playtime)</li><li>Three endings (One good, two bad)</li><li>Accessibility Features<ul><li>Open Dyslexic Font</li><li>Atkinson Hyperlegible</li><li>Self-Voicing (Can be turned on by pressing V)</li></ul></li><li>An original soundtrack</li><li>An extras menu where you can view images from the game as well as sketches from the game's character artist!</li></ul>\n<p>Use the drop-down to get more details on any of the warnings below. Some of the details contain vague spoilers for the plot of <em>Flickering Light</em>. This game contains...</p>\n<strong>Depression</strong>\r\nThe game focuses on the mental health of one of the characters. It dives into their depression and their feeling of worthlessness and wanting to feel needed.\r\n\r\n\r\n    <strong>Death (No Blood)</strong>\r\nIn the worst ending, one of the characters dies in relation to their depression. In the game, it's written as they've \"disappeared\" from the Spirit Realm. There is nothing graphic about the death and no blood is involved.\r\n\r\n    <strong>Flashing Lights (visual effects only, brief)</strong>There are times where the screen will briefly flash white to cut to a flashback. After the flashback, the screen will flash white again to go back to the present. They don't happen all at once and occur in different scenes.\r\n<br/>\n<p><strong>Project Lead, Programmer: Writer</strong>: Kristi \"HusbandoGoddess\" Jimenez</p>\n<p><strong>Character Artist</strong>: hallie</p>\n<p><strong>Background, UI Artist</strong>: Hadara Madrak</p>\n<p><strong>Composer</strong>: JAE</p>\n<p><strong>Proofreader/Editor</strong>: Ares</p>\n<p><strong>SFX</strong>: Zapsplat, Pocketsound, Mixkit, Pixabay</p>\n<p><strong>Made for Phantasia Jam</strong></p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-04T18:28:50", "background_image": "https://media.rawg.io/media/screenshots/43e/43e4142d82583582673c768f8cda5d94.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 342, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["HusbandoGoddess"], "genres": [], "publishers": [], "esrb_rating": null}