{"id": 87630, "slug": "grid-2-reloaded-edition", "name": "GRID 2 Reloaded Edition", "name_original": "GRID 2 Reloaded Edition", "description": "<p>Be fast, be first, be frugal. GRID 2 Reloaded Edition is 70% off now!<br />\nBe fast. Be first. Be famous.<br />\nBefore you buy, expand this description to check the system requirements below.<br />\nNOTE: If you experience problems launching the game, check you are signed into Game Center, then try again.<br />\nSpeed your way to the front as the star driver of ‘World Series Racing’, a disruptive new championship with global ambitions. Hold your nerve and do whatever it takes to win in nerve-jangling duels on mountain roads, experience full-contact sprints through city streets, get sideways in high-stakes drift events and carve your way around famous circuits as you propel WSR to the top of international motorsport.<br />\nLearn to master over 70 high-performance rides including supercharged muscle cars, agile open-wheel racers and cutting-edge sports vehicles. Master each car’s unique balance of speed, torque, grip and acceleration and adapt your technique to match the machine for a heightened driving experience that hits the sweet spot between realism and arcade racing.<br />\nKey features:<br />\n• Like real life, only better! TrueFeel™ handling emphasizes each car’s unique features for edge-of-control driving that will have you on the edge of your seat.<br />\n• Tear up Californian coastal roads, Japanese mountain trails and European city streets in over 70 superb cars that represent the best in automotive engineering.<br />\n• Prove yourself in an extensive range of events including white-knuckle drift battles, frenzied elimination races and unpredictable LiveRoutes™ courses, where the track changes as you race.<br />\n• Immerse yourself in every race with incredible graphics, spectacular lighting, realistic sound design and advanced AI that takes risks, makes mistakes and is as committed to the win as you are.<br />\n• GRID 2 Reloaded Edition contains all the additional content previously released for GRID 2, including the Demolition Derby event, famous tracks such as Spa Francorchamps and over 20 premium cars by manufacturers such as McLaren and Aston Martin.<br />\n• Face off against a friend/rival in head-to-head split-screen racing.<br />\nImportant information regarding GRID 2 Reloaded Edition:<br />\n• If you require assistance, please contact our support team at support@feralinteractive.com<br />\n• Minimum System Requirements: Processor: 2.0GHz, RAM: 4GB, Graphics: 256MB, Free Space: 11GB.<br />\n• The following graphics cards are not supported: ATI X1xxx series, ATI HD2xxx series, Intel GMA Series, Intel HD3000, NVIDIA 7xxx series, NVIDIA 8xxx series, NVIDIA 9xxx series, NVIDIA 1xx series and NVIDIA 3xx series.<br />\n• This game is not currently supported on volumes formatted as Mac OS Extended (Case Sensitive).<br />\n• You can find out more about the game on the GRID 2 Reloaded Edition mini-site at feralinteractive.com/grid2reloaded<br />", "metacritic": null, "released": "2014-09-25", "tba": false, "updated": "2020-09-11T18:02:53", "background_image": "https://media.rawg.io/media/screenshots/2dd/2dd47bf17b48f3c69973dcde541abed8.jpg", "website": "http://www.feralinteractive.com/en/mac-games/grid2reloaded/?utm_source=mas&utm_medium=link&utm_campaign=mas_grid2reloaded_minisite", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 249, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Feral Interactive"], "genres": ["Racing", "Arcade"], "publishers": ["Feral Interactive"], "esrb_rating": "Everyone 10+"}