{"id": 876463, "slug": "espresso-tycoon-prologue-underwater", "name": "Espresso Tycoon Prologue: Underwater", "name_original": "Espresso Tycoon Prologue: Underwater", "description": "https://store.steampowered.com/app/1543280/Espresso_Tycoon/<br/><br/><br/>You are the owner of an underwater cafe in Sydney. You must keep your customers happy by serving them delicious coffee and snacks. The goal of the game is to keep the shop running smoothly and efficiently. What's more - since it’s an underwater café you can help raise awareness of the problems related to the sea animals, ocean pollution and producing too much trash. <br/><br/><br/><br/>There will be a variety of tasks for you to do, including brewing coffee, serving food and drinks, cleaning up the shop, and more. You will need to juggle all of these tasks while also dealing with uncooperative customers, an emotional rollercoaster, and you will need to be quick on your feet to keep the shop running smoothly.<br/><br/><br/><br/>Just imagine… you’re the boss here! Feel like the real <strong>cafe owner</strong>, an <strong>empire builder</strong>, and create the whole strategy, which includes:<br/><br/><ul><li>decorating<br/></li><li>hiring and managing employees<br/></li><li>taking care of the supply chain<br/></li><li>analyzing the budget<br/></li><li>advertising your coffee shop<br/></li><li>and, what’s most important, keeping your customers happy</li></ul><br/>You have your favorite coffee, right? So do your customers. Do market research to find out their preferences. Use a 3D coffee editor to make different recipes to delight them. You can combine multiple ingredients in a very creative way. Use different layers, and toppings, and create beautiful latte art!<br/><br/><br/><br/>Start, build and develop your <strong>coffee shop</strong>. Check your budget - do you have enough money to invest, or will you have to make some cuts? Decide where and when you want to start your new <strong>coffee business</strong>. Hire (or fire) a barista, do the marketing campaign, create a relaxing place, and collect the rating points. <strong>Complete all the missions!</strong><br/><br/><br/><br/>In the underwater coffee shop, you can explore the mysteries of the deep sea while enjoying a cup of coffee! Immerse yourself in the new coffee shop simulator, one of the best simulation games 2022! We may not be objective, but we really think so!<br/><br/>Are you a big fan of such games as Rollercoaster, pizza conection, planet coster? We are! Immerse yourself in the new coffee shop simulator. Build the best café in the city. Create, customize, sell snacks, cookie, and manage baristas– all of that in the new coffee shop simulation game. Become the coffee tycoon, don't feel stray, build the circle of trust with your customers, cross the frontier, and create the whole empire - the best on the planet!<br/><br/>You may think - 'let loose or work hard'? If you don't want to teardown your business - use your skills and try hard! You will see your prosperous coffee shop and you will say - 'What a satisfactory view!'.", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2022-11-09T17:31:34", "background_image": "https://media.rawg.io/media/screenshots/646/646ce80b85b488f7449a80cd3aee174c.jpg", "website": "https://dreamwaygames.com/espresso-tycoon/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "beaten": 1}, "playtime": 0, "achievements_count": 33, "ratings_count": 1, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["DreamWay Games"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["DreamWay Games"], "esrb_rating": null}