{"id": 876483, "slug": "neon-nights-2-2", "name": "Neon Nights 2", "name_original": "Neon Nights 2", "description": "Kate's in trouble with the law... And you get to see what will happen to her in this brand new story that links to the previous!<br/><br/>Does Kate have a plan to escape? Or is she willing to accept the consequences of her impure acts?<br/><br/>Hop in and find out!<h3>◆ Overview</h3><br/>Neon Nights 2 is the second game of a series of kinetic eroges with high-quality 3D art that will cater to your kinks.<br/><br/>If you're into Cum Inflation, Futanari Sex, Dickgirls, and Orgies, this is the perfect game for you! <br/><br/><br/><br/>One of the police officers in charge takes Kate in her custody. She has to investigate the events of the previous night, but Kate might prefer to show her instead...<br/><br/><br/><br/>Jessy's a laid-back girl who's always up for a good time. Usually in trouble with the law for this very reason, she likes to have fun no matter what.<br/><br/>Being arrested should not suppose a problem for someone like her!<br/><br/><br/><br/>Veronica's police companion, she interrogates Jessy while her partner takes care of Kate. If she's as thorough as Veronica, Jessy's up for an intense questioning session.<br/><br/><br/><br/>The protagonist of the story, Kate's been arrested for a series of lewd events that happened that very night. Under the jurisdiction of the law, Kate will have to endure an in-depth interrogation.<br/><br/>However, \"in-depth\" might adopt a different meaning...<h3>◆ Features</h3><br/>◇ An erotic story around 25k+ words long (from 2 to 3 hours of gameplay)<br/>◇ Many lewd scenes that will ignite your senses (and make you play with one hand)<br/>◇ Four steamy girls for you to deal with (and bang)<br/>◇ 4k high-quality graphics<br/>◇ Over 300+ unique CGs<br/>◇ Detailed 3D backgrounds<br/>◇ Image gallery, music room, and replay scene functionality<br/>◇ Achievements, Easter eggs, and more!", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2022-11-07T03:20:31", "background_image": "https://media.rawg.io/media/screenshots/c24/c24c2bc3c013a7ced42968451162f527.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 2}, "playtime": 6, "achievements_count": 11, "ratings_count": 0, "suggestions_count": 423, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CrazySky3D"], "genres": ["Adventure", "Simulation", "Casual"], "publishers": ["CrazySky3D"], "esrb_rating": null}