{"id": 876478, "slug": "book-travelers-a-victorian-story-collectors-editio", "name": "Book Travelers: A Victorian Story Collector's Edition", "name_original": "Book Travelers: A Victorian Story Collector's Edition", "description": "Elephant Games brings you a new breathtaking series in Book Travelers: A Victorian Story!<br/>\n<br/>\r\nReading has always been your passion, but even your wildest dreams couldn’t prepare you for when novelist Charlotte Brontë herself magically appears to ask for your help! Someone’s going into famous stories and changing them, threatening the worlds and characters inside! So, you’re off on a life-changing journey into history’s most celebrated novels to track down a dangerous vigilante and put an end to their plan! Can you work with your favorite characters to save the day before it’s too late? Find out in this exhilarating Hidden-Object Puzzle adventure!<br/>\n<br/>\r\nThis is a special Collector's Edition release full of exclusive extras you won’t find in the standard version!<br/>\n<br/>\r\nThe Collector’s Edition includes:<br/>\r\n•\tTravel through the worlds of well-known classic novels to find a powerful amulet!<br/>\r\n•\tReplay your favorite HOPs and mini-games, earn achievements, and unlock the Secret Room!<br/>\r\n•\tTons of collectibles and morphing book objects to find!<br/>\r\n•\tEnjoy exclusive wallpapers, screensavers, music, and more!<br/>\r\n•\tNever get lost with the strategy guide!", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2022-11-07T03:13:06", "background_image": "https://media.rawg.io/media/screenshots/f1c/f1cf9605b04bd452f640542d1c5dcd84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 537, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Elephant Ar"], "genres": ["Adventure", "Casual"], "publishers": ["Big Fish Games"], "esrb_rating": null}