{"id": 876461, "slug": "non-euclidean-2", "name": "Non-Euclidean", "name_original": "Non-Euclidean", "description": "Nothing ever truly resorts to such madness, but when something is brought to exist that fragments the true nature of what we believe to be possible, everything goes out the window and into the mits of madness. What shall the world bring of the unnatural, and what should you bring to fix it?<br/>\n<br/>\r\nThis game is a survival horror game about finding different collectable items to slowly progress through levels of the story. Levels will slowly get harder and harder with new types of objectives and new monsters and mechanics. Your time is running short, and sometimes your stamina may be aswell. A highly strategic game in a sense. Whether the monster be a deaf but fast monster with a bloodlust or a face in the shadows of another world, there will be one, lurking... waiting to strike. This is a VHS style game aswell. There are currently 2 playable levels to enjoy and they both have unique monsters to pose as threats. The game also offers graphics options and sensitivity changing in the options menu. The game can be loud, and can catch you off guard, so be ready for spooks! There are also some \"glitches in the world\" that can teleport you to different places, and a dimension you can use to hide, and avoid being seen!<br/>\n<br/>\r\nAnd don't worry, there is a tutorial for you to check out to get to learn some mechanics of the game, such as teleportation through wormholes!", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2022-11-07T02:52:00", "background_image": "https://media.rawg.io/media/screenshots/d09/d092a8f1accbf1d7c0f29ae9aa409c5a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["BeastTornado"], "genres": ["Adventure", "Indie"], "publishers": ["BeastTornado"], "esrb_rating": null}