{"id": 876496, "slug": "dao-mu-mi-tan", "name": "盗墓密探", "name_original": "盗墓密探", "description": "Tomb Raider is a role-playing game developed by one person. It is a round fight, a plot type game. The game plot is completely independent, with all the plots in different markets. The story takes place in a famished, impoverished mountain village. Two good jihadis have the idea of robbing tombs to make a living because they have enough to eat.<br/>\n<br/>\r\nZhou Dasheng and Liu Yaoqiang began to gain the first barrel of gold from the tomb. Liu Yaoqiang began to expand. He lost all the money he had earned so hard to bring Ah Sheng's insight to the Japanese casino. So far, in order to satisfy Brother Qiang's vanity and gambling habits, the two men have made several tombs. In the process, the Japanese buyer asked them to help an archaeological team dig the ancient tomb and bring some things back. By accident, they knew the Japanese purpose. In this regard, a series of anti tomb robbery stories are launched... The main line and branch lines of the game story are huge, with a broad world outlook and human values.<br/>\n<br/>\r\nIn the process of playing the game, players will operate one or more characters to fight against the enemy according to the plot trend, and the game uses random equipment system, achievement system, synthesis system, suit system, etc<br/>\n<br/>\r\nThe game is simple and easy to use. According to the player's operation, the character becomes stronger and stronger, and every boss enemy is defeated.", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2022-11-07T03:33:09", "background_image": "https://media.rawg.io/media/screenshots/899/8996fe365668b152a8dfd0d096e10027.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["佳哥RPG工作室"], "genres": ["Adventure", "RPG", "Indie"], "publishers": ["佳哥RPG工作室"], "esrb_rating": null}