{"id": 8765, "slug": "beyond-fighting-2", "name": "Beyond Fighting 2", "name_original": "Beyond Fighting 2", "description": "** To improve performance close other apps before playing Beyond Fighting 2 **<br/><br/>Beyond Fighting 2 is finally here and it&amp;#39;s better than ever! Packed with intense beat &amp;#39;em up action and massive new features! It&amp;#39;s just you and your opponent - until knock out! So get ready, FIGHT!<br/><br/><br/>16 UPGRADABLE CHARACTERS &amp;amp; MELEE WEAPONS<br/>• Upgrade your fighter&amp;#39;s skills: improve speed, boost attacks and extend combos<br/>• Equip weapons to improve strength and attack range<br/>• Fight with bare fists or choose between two unique melee weapons per fighter<br/><br/><br/>STORY MODE: COMPLETE TOURNAMENTS &amp;amp; FACE FINAL BOSSES<br/>• Fight through a variety of tournaments, including standard tournaments, weapon tournaments, survival tournaments and challenge tournaments<br/>• Beat a final boss at the end of each tournament series<br/><br/><br/>IMPROVED REAL-TIME INJURIES<br/>• Redesigned injuries system adds a lot more detail to the fighters&amp;#39; injuries<br/>• Dirt on the clothes, cuts and bruises on your fighter&amp;#39;s skin<br/>• All in real-time<br/><br/><br/>ADVANCED AI<br/>• Built in patterns for smarter decision taking<br/>• AI for higher difficulty levels analyses attack moves to find best moment to counter attack<br/><br/><br/>GAME CONTROLLER SUPPORT <br/>• Support for game controllers built for iOS 7 <br/>• Play on the big screen: connect your iPhone to your game controller and Apple TV and play Beyond Fighting 2 on any HD TV or projector <br/><br/><br/>PREMIUM VS FREEMIUM<br/>Whether you prefer premium games or free-to-play. We&amp;#39;ve got you covered! You choose: play Beyond Fighting 2 as free-to-play or upgrade to the Premium Version and unlock the full content right away. When upgraded to Premium, all remaining content can be unlocked during the game. Pay ONCE and get EVERYTHING!<br/><br/><br/><br/><br/>Stay in touch:<br/>Follow us on Facebook: facebook.com/pjs.coding<br/><br/><br/>Not supported:<br/>- iPhone 3GS and older<br/>- iPod touch 3rd Gen and older<br/>- iPad 1", "metacritic": null, "released": "2014-01-08", "tba": false, "updated": "2019-10-22T14:30:05", "background_image": "https://media.rawg.io/media/screenshots/10a/10a9b5036ecc0f679703804d3d1f9c63.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PJS-Coding"], "genres": ["Action", "Arcade"], "publishers": ["PJS-Coding"], "esrb_rating": "Teen"}