{"id": 87669, "slug": "clay-hunt-pro", "name": "Clay Hunt PRO", "name_original": "Clay Hunt PRO", "description": "Just shooting with a shotgun is a thrilling experience. Combine that with rapid clay targets or maybe high flying pheasants and it’s something special. Bust clays, hunt birds and compete globally in eight game modes! Over 20 000 shooters around the world have chosen Clay Hunt PRO!<br/><br/>Unique touch controls and authentic gameplay makes it easy for you to enjoy the thrill of shotgun shooting when not in the range. Clay Hunt PRO takes you to hunt birds and blast clays in varying disciplines.<br/><br/>There’s nothing fancy about this game. Just pure shotgun shooting fun! However, be prepared for sticking with Clay Hunt PRO for a while as once you get the hang of it, it’s hard to let it go. Shoot some pigeons while commuting or perfect your skeet round for the next live event, it’s going to become your daily habit.<br/> <br/>Features:<br/>• Get started with the tutorial and popup targets!<br/>• Olympic Skeet, Trap and Double Trap.<br/>• Sporting Clays - It’s like golf with a shotgun!<br/>• Go bird Hunting - Pigeons, Ducks and high driven pheasants!<br/>• Become a monthly cup champion by dominating the live events held every other day.<br/>• Choose your gun, rib, barrel length, chokes etc. to match your preference.<br/>• Unique first person shooting experience.<br/>• Realistic simulation of shot string physics and leads.<br/><br/>-----<br/><br/>For enjoyable experience, following or newer device is required: iPhone 5S or iPad 4th generation (2012 model).", "metacritic": null, "released": "2017-05-14", "tba": false, "updated": "2019-08-02T05:21:40", "background_image": "https://media.rawg.io/media/screenshots/d3f/d3f79a40e5dd046c942296d37186cf4c_hlbPTPi.jpg", "website": "http://www.clayhuntpro.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "Android"], "developers": ["Shotgun Gaming Oy"], "genres": ["Simulation", "Sports"], "publishers": ["Shotgun Gaming Oy"], "esrb_rating": "Everyone 10+"}