{"id": 876605, "slug": "rivertale-chapter-1", "name": "Rivertale: Chapter 1", "name_original": "Rivertale: Chapter 1", "description": "<p><em>(Original Description)</em></p>\n<p>This is an Undertale fan game based on an AU (Alternate Universe) created by myself. If you haven't played the last game (which was a prologue to this), I would recommend it, but it isn't necessary to play that first to understand this. You can play that game here:</p>\n<p>https://scratch.mit.edu/projects/671104042</p>\n<p>----------------------------------------------------------------------------</p>\n<p>Story:</p>\n<p>This takes place an unknown amount of time before the prologue. This project is the final fight between river sans and the human, before.... something happens? You'll have to figure that part out! It's not that I'm too lazy, I just want to leave it up to you. Comment your thoughts down below. But do that after you finish the game, you have to do that part first!</p>\n<p>----------------------------------------------------------------------------</p>\n<p>Controls and instructions:</p>\n<p>-Arrow keys: Move SOUL and navigate the menu</p>\n<p>-Z key: Select (Menus) and forward dialogue</p>\n<p>-X key: Go back (Starting menu)</p>\n<p>-Dodge white attacks and knives.</p>\n<p>-You have to move through orange attacks</p>\n<p>-Don't move through blue attacks</p>\n<p>-Red SOUL: Move all around</p>\n<p>-Blue SOUL: It turns into a platformer and you can jump all around</p>\n<p><em>(Credits)</em></p>\n<p>https://scratch.mit.edu/projects/338708827/#:~:text=by-,S00TF00T,-Remix - Again he made the letters I just re textured some of them for the menu. Also the engine for text is my own engine that is sort of based on https://scratch.mit.edu/users/loganvcairns - which is the engine I used last time.</p>\n<p>The knives came from the same place as last time, that guy with mad time trio idk what it's called and I don't have a link soo...  (<em>Itch.io edit: I am reffering to a Scratch projects, you can just ignore this)</em></p>\n<p>Starting music by Toby Fox. (Got it from this guy though so thanks to him https://scratch.mit.edu/users/crizmuz )</p>\n<p>Music in game by Toby fox (Forgot where I got it from though, it was a while ago)</p>\n<p>EDIT: em... thought there was music in the game for some reason... there was some during some beta versions and I guess I was just used to that sorry. Just a bit of history of this game for ya. Actually, it might still be in the demo I released idk.</p>\n<p>Game over theme by Toby Fox</p>\n<p><em>Notes for Itch.io:</em></p>\n<p>May need to click window where the game is being displayed to interact with it. It's not really my fault so I need to mention it.</p>\n<p>If you press a button in the menu and only part of the screen dissapears, press it again and it should work. It's another bug that I can't fix and need to mention.</p>", "metacritic": null, "released": "2022-11-06", "tba": false, "updated": "2022-11-07T04:50:53", "background_image": "https://media.rawg.io/media/screenshots/133/133d94131cfad1e63a102aaecd6d7e33.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["andyidk"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}