{"id": 87663, "slug": "dirt-racing-mobile", "name": "Dirt Racing Mobile", "name_original": "Dirt Racing Mobile", "description": "NEW RELEASE - Dirt Racing Mobile 3D<br/>Free Demo Available<br/><br/>Dirt Racing Mobile is a Universal app! Enjoy it on all of your IOS Devices.<br/>Try the FREE Dirt Racing Mobile Midgets Edition before you buy!<br/><br/>Finally a challenging Dirt Oval Racing game for mobile devices with physics! Race against AI controlled opponents or race against the clock. Hours of sliding and dirt slinging action at your fingertips.<br/><br/><br/>--------------------<br/>••••• FEATURES •••••<br/>--------------------<br/>• 4 Cars (Sprint Cars, Latemodels, Modifieds, and Street Stocks)<br/>• 12 Tracks<br/>• 4 Game Modes with Stars to be earned for each car and track.<br/>• No unlocks, play what you want when you want.<br/><br/>--------------------<br/>••••••• TIPS •••••••<br/>--------------------<br/>• Start slow! Start with the Street Stock at Track 1 in Practice Mode.<br/>• Use LIGHT TAPS on the turning buttons. <br/>• When the car starts rotating, the momentum may keep turning the car.<br/>• The buttons are MUCH larger than they appear. (so they do not take up too much screen)<br/>• Use the Turning Lines and countdown markers, they indicate when you are approaching a turn! <br/>• Letting off the throttle will allow the cars to rotate faster.<br/>• If you are pressing the turning buttons more than 1 second you are probably holding too long.<br/>• Make sure you can get at least 1-2 Stars in Qualifying before attempting Single Amatuer Race.<br/><br/><br/><br/>For any feedback or bug reporting please contact us.<br/>Twitter: @Windowed or Email: WindowedUniverse@gmail.com", "metacritic": null, "released": "2013-11-19", "tba": false, "updated": "2019-07-30T12:56:28", "background_image": "https://media.rawg.io/media/screenshots/480/480635eea150ecc9472dc43bdac3671c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Windowed Universe"], "genres": ["Sports", "Racing"], "publishers": ["Windowed Universe"], "esrb_rating": null}