{"id": 87695, "slug": "fire-truck-driving-simulator", "name": "Fire Truck Driving Simulator", "name_original": "Fire Truck Driving Simulator", "description": "It’s time to play the role of an firefighter hero 911 with the abilities of Fire Truck Driving Simulator &amp; courage to save the lives of innocents in this fire truck driving hero 2018 city rescue games. 911 Fire Truck Rescue Simulator 3D Driving School has to be alert and quick in 911 emergency services. You’ve had enough learning at the training school &amp; 911 driving school where firefighter hero has mastered the skills of firefighting and truck driving games. You will be playing multi roles like American firefighter hero, truck driving hero 2018 and hero 911 emergency ambulance driving games. Take the emergency victims to the hospital for emergency services treatment. Your rescue equipment gear should be kept ready so whenever there is fire truck 911 emergency call you should be quick to respond like a pro firefighter hero 911. American firefighter Truck are huge and difficult to drive, but the training school &amp; 911 driving school have trained you well for this emergency services city rescue simulator job. <br/><br/><br/><br/>Fire Truck Driving 911 City Rescue Simulator Innovative Features<br/>•\tChallenging American Firefighter Hero 911 missions with extreme time limit.<br/>•\tFire Truck Simulator with Realistic HD graphics and engaging sound effects.<br/>•\tSuperb 911 Driving School environment with most addictive gameplay in 911 Fire Truck Rescue Simulator 3D.<br/><br/>Enjoy the amazing gameplay and give your feedback to help us improve this game in future releases.", "metacritic": null, "released": "2018-05-26", "tba": false, "updated": "2019-10-22T14:20:50", "background_image": "https://media.rawg.io/media/screenshots/098/0987b3f8ed8a4a2be3d22c02c08e2e12.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 173, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Adventure", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Teen"}