{"id": 87693, "slug": "udder", "name": "Udder", "name_original": "Udder", "description": "\"Holy Cow! This game is UDDERLY ridiculous!\"<br/><br/>Yeehaw! Time for a Rodeo challenge like no other! How fast can you fill the bucket with milk? Wrangle those cow teats and milk them as fast as you can! <br/><br/>Try not to miss the bucket or you'll lose valuable time! Don't cry over spilled milk, just keep on tugging! Be careful though, milk too hard and you'll burn your cow! <br/><br/>Out of milk already? Quick grab a new cow! MOOve along Bessie! Let's see who's got the fastest teats on the ranch!<br/><br/>Gamecenter Added!<br/>Challenge your friends to Udder! Who has the fastest teats? Who can milk the most in the week? Can you wrangle in all of the achievements?<br/><br/>Will you be crowned the Milk King of milking? Play Udder today! What are MOO waiting for?<br/><br/><br/>___________________________<br/><br/>Udder is brought to you by Fluik Entertainment, makers of wicked-fun mobile games such as Office Jerk, Grumpy Bears and Plumber Crack. Browse all our games on Google Play - https://play.google.com/store/apps/developer?id=Fluik<br/><br/>Follow @FluikGames on Twitter for awesome game announcements and other updates.<br/><br/>NOTE:<br/>To help keep Udder awesome, please send any bug reports or complaints directly to us, instead of posting them in your app reviews. We can reply to app reviews on Google Play, but we're more likely to respond if you post all your bugs or suggestions on our Facebook fan page, http://www.facebook.com/FluikEntertainment, or email them to us at support@fluik.com", "metacritic": null, "released": "2014-12-17", "tba": false, "updated": "2019-10-22T14:20:49", "background_image": "https://media.rawg.io/media/screenshots/068/0685b22562b68a72b702c042a0b64ede.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Fluik"], "genres": ["Simulation", "Arcade", "Casual"], "publishers": ["Fluik Entertainment"], "esrb_rating": null}