{"id": 876914, "slug": "tape-explorer", "name": "Tape Explorer", "name_original": "Tape Explorer", "description": "<p>Notre personnage est un explorateur, une personnalité originale dans son monde, qui s’intéresse aux vieilleries. Un jour il tombe sur un objet qui l’intrigue et débute une collection qui l'entraîne dans les tréfonds de Poitiers. Sa méconnaissance de ses nouveaux objets fétiches le pousse à se lancer dans une quête énigmatique. Ce périple l’amènera à apprendre auprès des animaux et entités qu’il rencontrera afin de progresser et d’arriver à ses fins.\r\n</p>\n<p>Les humains ne sont qu’un vague souvenir mais notre personnage souhaite comprendre quelle est l'origine de leur disparition plusieurs centaine d'années après cette extinction soudaine. Il découvrira durant son aventure que les objets qu’il cherche assidûment portent des enregistrements audio, il sera donc nécessaire de réussir à dénicher de quoi les écouter pour certainement lever le mystère de cette espèce disparue. \r\n</p>\n<p>Dans cette aventure, le personnage évolue dans la vieille ville de Poitiers, effondré sur elle-même depuis bien longtemps. Un endroit évité par tous les animaux avisés. Des criminels ainsi qu’une bête légendaire hérité du monde humain y rôde selon les anciens. Espérez ne pas croiser la route de ce terrible reptile qui dévorerai quiconque sur son passage.  \r\n</p>", "metacritic": null, "released": "2022-11-06", "tba": false, "updated": "2022-11-07T10:33:29", "background_image": "https://media.rawg.io/media/screenshots/2d2/2d282fd4d2f357817dba271dc3ae8ff8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Andrey753"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}