{"id": 877045, "slug": "purra", "name": "Purra", "name_original": "Purra", "description": "<p>1. Controls for the game- </p>\n<p>A to move left</p>\n<p>D to move right </p>\n<p>W to jump Tap W for short jump and Hold W for long jump. </p>\n\n\n\n<p>2. Is your game playable? Are there any major bugs? If there are game-breaking bugs, do state what they are. The game is incomplete. No major bugs but no main menu or end to the game. Art assets, Backgrounds and cutscenes as this is an older version of the game. Newer version of the game had some errors which made the game unplayable. </p>\n\n<p>3. What were you inspired by? Purra is relevant to the theme of renewal as it is about the cat, Milk, losing its previous life, searching for a new one, and gaining a new life. Like the cycle of life, the life Milk had in their last home ‘died’, and thus Milk has to go on a journey to find a new home and gain a new ‘life’.</p>\n\n<p> 4. What sort of experience/message are you hoping your game will bring across to the player? The message we want to bring is awareness about the law against pet cats in HDB flats, which leaves pet cats no protection legally or otherwise from being dumped, etc., unlike pet dogs. This has resulted in a higher rate of cats being abandoned and mistreated.</p>\n\n<p> 5. Why did you end up choosing this direction for your game? We had many ideas during the brainstorming stage for the theme renewal, but we landed on the idea for Purra as it was the most interesting and unique. It also allows us to bring light to an issue most Singaporeans are probably not aware of. </p>\n\n<p>Credits: Programmer: Derek, Joleen, Cedrick</p>\n<p>Level Design: Chip</p>\n<p>  <br/>BG Art: Jesmine, special thanks to Khadijah</p>\n<p>  <br/>UI Art: Felicia <br/><br/></p>\n<p>Animations: Tom</p>\n<p>  <br/>Game Asset and Main Menu Art: Mandy</p>\n<p>  <br/>Game BGM: Cedrick</p>", "metacritic": null, "released": "2022-11-06", "tba": false, "updated": "2022-11-07T11:44:46", "background_image": "https://media.rawg.io/media/screenshots/cff/cff8df6bb722d264f264da87f37edefc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RJam+Matrix"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}