{"id": 877253, "slug": "escape-from-the-deep-dethmunk", "name": "Escape from the Deep (Dethmunk)", "name_original": "Escape from the Deep (Dethmunk)", "description": "<p><strong>Welcome to the Deep...<br/></strong>Escape from the deep ocean research and mining facility, Neptune Base. You've been sent with a team to investigate strange incidents on the station. Erratic behaviors and dangerous accidents. They've tried their best to cover up the problems, but the authorities have caught wind of it and sent you in to find out exactly what's been happening.<br/>Disaster strikes not long after your investigation begins. A series of impacts or explosions are felt throughout the base. You're knocked unconscious. You awaken in the Medical Bay on the scanner bed. No-one is there, save for the gruesome dead body of a nurse slumped in the corner of the room! What happened? How long have I been out? Where is everyone? You have to find the answers to these questions and gather the evidence to take back to the surface, you need to..... Escape from the Deep.<br/><br/>This is a Text Adventure or Interactive Fiction. Enter verbs and nouns in two word phrases to navigate around the world and solve its problems and puzzles.<br/>For example:-<br/><strong>USE SCANNER</strong> or you can add a few other words for instance <strong>USE THE SCANNER</strong>, its up to you, but generally you only need two word inputs. <br/></p>\n<p>You navigate around the world using compass directions... type <strong>N</strong> for North or <strong>E</strong> for East for instance. You may need <strong>U</strong>p and <strong>D</strong>own and <strong>GO</strong> (to go specifically into somewhere like a Vent - <strong>GO VENT</strong>. Other useful commands include <strong>EXAMINE</strong> or it can be shorten to <strong>EXAM</strong> or even just <strong>X</strong> for example: <strong>EXAM BODY </strong>or <strong>X BODY</strong>. You'll be using<strong> I</strong> or<strong> INV</strong> or<strong> INVENTORY</strong> to see what items you are holding. You can only carry a maximum 10 items, so you might have to manage your inventory from time to time. Type <strong>HELP</strong> can be useful with hints in certain area's or advice. Type <strong>EVI</strong> or <strong>EVIDENCE</strong> or <strong>EVIDENCE TOTAL</strong> to see how much evidence you've gathered. There are 4 main pieces to gather altogether, but you need not get them all to finish the game, but it may affect the ending if you don't have enough.</p>\n<p>The game features: 16bit pixel style graphics for every location and the interactable objects (when held by the player). Graphics for various death scenes that can occur during the game. Multiple endings.<br/></p>", "metacritic": null, "released": "2022-11-05", "tba": false, "updated": "2022-11-07T13:13:50", "background_image": "https://media.rawg.io/media/screenshots/42e/42e1f96e43cb9276dfedd63be487df2f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Dethmunk"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}