{"id": 87732, "slug": "hack-run-3-hack-time-hd", "name": "Hack RUN 3 - Hack Time HD", "name_original": "Hack RUN 3 - Hack Time HD", "description": "It's TIME for a THIRD Hack Run!<br/><br/>Note: 'Hack RUN 3 - Hack Time HD' is the third installment in the Hack RUN series. You should play 'Hack RUN' before starting this game.<br/><br/>Once again, your mission is to penetrate a strange organization’s infrastructure to discover their secrets. Your employer needs help discovering who is out to get her and she only trusts you to take on this perilous mission. Hack Time uses old-school prompts (like DOS and UNIX) to access virtual programs and systems. Gain access to users’ files and emails to discover new ways to dig deeper and deeper. <br/><br/>Hack Time HD includes these newly developed interface enhancements:<br/><br/>GAME CENTER SUPPORT<br/>Earn achievements and track your leaderboard score against other players.<br/><br/>CONVENIENT MAIN-MENU POPUP<br/>Enables you to access important content quickly.<br/><br/>CONFIGURE TEXT &amp; BACKGROUND COLORS<br/>Choose from black, white and green.<br/><br/>PERSONAL NOTEPAD<br/>Keep track of where you’ve been with the built-in notepad.<br/><br/>Additional enhancements:<br/>&gt; More “substantial” levels. Earn your way to the final goal.<br/>&gt; Two new modes of communication to “interface” with users. <br/>&gt; More levels than in Hack RUN or in Hack Run ZERO.<br/><br/>The iPad 'HD' version contains additional features not found in the standard iPhone game such as functional 'command' windows that can be resized and moved around the terminal.<br/><br/>Stuck on a level? Just use the 'hint' or 'answer' commands to help you along.<br/><br/>*** Make sure to play the FOURTH and FIFTH games called Hack NET and Hack WATCH after you finish this one! *** <br/><br/>Hack RUN 3 - Hack Time HD is a game. It is not a tool or aid for learning how to hack into real computer systems. i273, LLC does not endorse hacking.", "metacritic": null, "released": "2012-03-31", "tba": false, "updated": "2019-07-30T15:37:14", "background_image": "https://media.rawg.io/media/screenshots/474/47417f5635594b9f60e6d9c5de3644d1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["i273"], "genres": ["Strategy", "Puzzle"], "publishers": ["i273"], "esrb_rating": null}