{"id": 877327, "slug": "forefeathers-demo", "name": "Forefeathers Demo", "name_original": "Forefeathers Demo", "description": "<strong>Story</strong>\n<p>Armed with his trusty camera, a little penguin explores ancient flying islands to rediscover the secret of flight!</p>\n<strong>Gameplay</strong>\n<p>In ForeFeathers, you'll hop and glide from island to island, collecting currency and keys to open ancient portals. Flee from enemies or confront them head-on, and snap pictures of your journey!<br/></p>\n<p>Only PC and X-Box-Controller compatible for now.<br/></p>\n<strong>Plans</strong>\n<p>This demo was created within 4 months by a trio of students trying their hand at game development for the very first time. Since then, we've realized our passion for this project and are making plans to turn ForeFeathers into a proper indie title!<br/></p>\n<p>For now, we're finally releasing the demo to the public. If you enjoy it, follow our socials to see where our journey takes us!</p>\n<p>---<br/></p>\n<p>Regarding gameplay: as we've already received lots of feedback from friends and other testplayers, there's a bunch of features we're hoping to implement in the future, so stay tuned!<br/></p>\n<p>Such plans include:<br/></p>\n<ul><li>making it easier to navigate the flying islands (improved colliders, blob shadow, better camera angles, more intuitive gliding)</li><li>improving enemy interaction &amp; visibility</li><li>a strong visual overhaul</li><li>crafting a solid, whimsical narrative suitable for the penguin's daring adventure!</li></ul>\n<p>Feel free to let us know if you have any other feedback or suggestions - but for now, thank you so much for checking out our demo!</p>\n<br/>Soundtrack Credits\r\n<ul><li>Jagged Stone </li><li>SubspaceAudio </li><li>Memoraphile @ You're Perfect Studio </li><li>Zane Little Music </li><li>Aureolus_Omicron</li></ul>", "metacritic": null, "released": "2022-11-05", "tba": false, "updated": "2022-11-07T13:45:01", "background_image": "https://media.rawg.io/media/screenshots/463/4630ef8698c2c02ee1139f0340249825.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Honeybeak"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}