{"id": 877435, "slug": "indominus-fleet-battles-destroy-heretics-and-pirat", "name": "Indominus Fleet Battles -Destroy heretics and pirates!", "name_original": "Indominus Fleet Battles -Destroy heretics and pirates!", "description": "Indominus Fleet Battles -Destroy heretics and pirates!\r\n<p>\n</p>\n<p>\r\nPick from 3 options, then do it again, and again, and again. Make the best out of a bad situation. Do it as quickly as you can because time is the most valuable resource at your disposal.  Thank you for checking it out. </p>\r\nFirst, pick the type of ship you want\r\n<p><strong>Secondly, pick the type of weapon to equip to your ship</strong><br/></p>\n<p>Then the ship is sent to the front lines to automatically fight for you.<br/><br/><strong>Once in a while, you'll get a permanent upgrade.<br/><br/><br/><br/>And once in a while, you'll get a combat pick that could drastically change the outcome of the battle.<br/><br/><br/><br/>Time is a factor<br/><br/><br/><br/>In the early levels, you'll have plenty of time to make your choices as you learn what everything does. But as you advance throughout the stages, eventually you'll reach the game's natural speed, which allows for only 4 seconds per choice.<br/><br/>This game is really about looking at numbers really quickly, over and over again. However, there are times when strategic choices come into play, especially when dealing with point defense weapons, nukes, and other weapon types.<br/><br/>Additionally, planning out a strategy for your permanent upgrades early on will help you win in the late game. Actually, I'm not sure if the game is beatable without planning your permanent upgrades.</strong><br/></p>\n\n<p>Indominus Fleet Battles is currently being developed solo game developer. To get the latest updates be sure to follow me on Insagram.  Thanks for checking out our game and we can't wait to share all the exciting updates we have planned for it!\r\n</p>", "metacritic": null, "released": "2022-11-05", "tba": false, "updated": "2022-11-07T14:31:07", "background_image": "https://media.rawg.io/media/screenshots/847/8474f080198aa9ee02f038ef129b6a5e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "PC"], "developers": ["KSVGames"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}