{"id": 87741, "slug": "prison-escape-criminal-squad", "name": "Prison Escape Criminal Squad", "name_original": "Prison Escape Criminal Squad", "description": "Time to play the epic prison escape criminal squad with real-time prison escape story inside the Alcatraz jail. Hard time is not over yet with years inside the torturing prison cell in Alcatraz which is impossible to break. You have been sentence prison for 10 years for a crime you never committed but all fake evidence has led you to imprisonment for years inside the prison impossible to break. It’s been hard time in prison with criminals, mafia and high profile gangsters all around you making you a gangster yourself. A sin city story where you live inside the criminals as a gangster inside the prison dealing with prisoners. You’ve waited long for this day to come when your prison escape plans will come to reality with one of your inmates. As a person you have changed and finally planned a breakout with your inmates to breakout from the prison cell. This is a real prison escape story to breakout as real gangsters &amp; prisoners.<br/><br/><br/>Make a solid escape plan and help your fellow inmates too. Your weapons will support you in your plan but you won’t have them with you so be prepared to hit some hard punches. You can even play in stealth avoiding the site of officers and punching them down. Take out the police security officers and make your way to complete your objectives finally leading you to your survival. Do whatever it takes to make this happen as this is the last hope for your survival and wild escape. All you need is courage and strength with fighting skills to breakout the main cell. You’re the weapons, map and your knowledge to the best to kill the armed officers. Prison break is not over until you breathe fresh air out the prison.<br/><br/><br/>Have you ever thought of breaking out a prison? Sentenced for a crime you never committed is the ultimate motivation for your prison escape. A freedom you deserve won’t come easy. Put on your extreme stealth mode to sneak out of the prison with the help of your criminal cell inmates and gang members. Dodge police sniper &amp; tower watchman while breaking out. Don’t forget to steal the map from the warden’s room. Make this impossible mission to bring it into reality.<br/><br/><br/>GAMEPLAY FEATURES<br/>• Challenging Levels of Escaping and Fighting<br/>• Eliminate Police Officers trying to Stop your Breakout <br/>• Thrill of Taking out Prison Officers <br/>• Highly Additive &amp; Immersive Gameplay<br/>• Punch, Kick or Hit them with your Baseball Bat<br/>• Escape the Prison with a Master Breakout Plan", "metacritic": null, "released": "2016-11-24", "tba": false, "updated": "2019-10-22T14:20:50", "background_image": "https://media.rawg.io/media/screenshots/4d0/4d0c5a2527ae4c198832b2ec52c60561.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 231, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Action", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Mature"}