{"id": 87748, "slug": "vendetta-subway-crime", "name": "Vendetta Subway Crime", "name_original": "Vendetta Subway Crime", "description": "Seeking revenge, a former intelligence officer ends up at a subway taking out a group of gangsters who are working for a mafia boss involved in the murder of his wife. It’s not an easy task but seeking revenge for his family is what takes him deep into the mafia world. Pick up your shooting gears and show your past skills as an intelligence officer. The impossible run has just begun for those criminals that are carrying out crime activities inside the city. Crime simulator games are hard to play, but with revenge on your mind, it’s a core duty to help the city police officers to rescue the situation and eliminate all terrorist. A mobster war series where you play with an objective to eliminate all the resistance.<br/><br/><br/>You just received a call from an undercover spy about the presence of criminals at the subway. They have invaded the subway and take citizens as a hostage. These are the same gangster group that was the reason of your wife’s death. It’s vendetta time, play crime simulator, gear up with armor and get ready to take out criminals and mobsters. Be quick with your shooting but remember not to hurt civilians. You are equipped with a pistol, a revolver, and dual beretta to support your shooting. The criminals have taken over the charge of the subway terminal and even train departures. The city police have been called to report on the crime scene.<br/><br/><br/><br/>STORYLINE <br/><br/>A mafia group is overruling the city with their crimes inside the city. The town has turned into a crime nightmare. You have retired from your services as the intelligence officer but still they haven’t left you alone in your life. A group of mobsters took out your wife and shot her bullet in the middle of the street. Seeking revenge from whose who were involved in her murder, you have gathered your weaponry and reached a subway station where the same mafia gang has taken over a train and terminal. There are many hostages you need to save and take your revenge by eliminating gangsters.<br/><br/><br/>TOP GAME FEATURES <br/><br/>•\tPlay as Office Seeking Revenge<br/>•\tEliminate Mobsters trying to take control of the subway <br/>•\tThrill of taking Revenge against a Mafia Group<br/>•\tMultiple Gameplay levels and Game Modes<br/>•\tGun selection to Use better Weaponry for Precision Shooting <br/>•\tAim, Shoot and Take out Headshots to Score High", "metacritic": null, "released": "2016-05-25", "tba": false, "updated": "2019-10-22T14:20:51", "background_image": "https://media.rawg.io/media/screenshots/e71/e71f5f6f26019db260e0c3e62b7eff50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Action", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Mature"}