{"id": 87754, "slug": "blue-skies-lite", "name": "Blue Skies Lite", "name_original": "Blue Skies Lite", "description": "NEWS: Doodle/retro version now available!  Search for Doodle Chopper on the App Store.<br/><br/>BLUE SKIES LITE -  The award winning original multidirectional iPhone helicopter shooter!  Now you can enjoy the first 7 levels of the best shooter available on the iPhone for FREE.<br/><br/>STORY: <br/><br/>You are a new recruit at the elite Blue Skies Air Force Academy.  Master Sergeant Harris is teaching you to fly a helicopter when the evil Hans Kraven interrupts and begins invading your country!  It is your job to prevent Hans and his eccentric henchmen Bruno, Rachel, and the mysterious ninja Takeshi from world domination.<br/><br/>Use the accelerometer to pilot your helicopter and out maneuver enemy tanks, planes, helicopters, blimps and mines.<br/><br/>Full version includes:<br/>*30 Levels of addictive search and destroy action<br/>*Pick up bonus health, gas, and cash from downed enemies.<br/>*Use cash to research better weapons in the R&amp;D lab.<br/>*A pulse pounding soundtrack of 10 techno rock songs<br/>*10 different weapons including missiles, bombs, lasers and <br/> fireballs.<br/>*Save at any point, play through story at your own pace.<br/>*Arcade mode for instant action and unlimited levels<br/>*3 difficulty settings<br/>*Rain and weather effects<br/>*5 hours of gameplay in story mode<br/><br/><br/>Developer Notes:<br/>To pause the game, click the power button on top the device.  <br/><br/>The full game gets much harder with 200 enemies on a level, helicopters that chase you, and enemies with stronger weapons. <br/><br/>More RPG Games:<br/>Doodle Chopper, Puppet Jump, Puppet Sprint, Puppet Labyrinth, Super Soccer Kick 3D, Super Football Kick 3D, Pocket Farm, iFishing, iFishing Saltwater, Dark Raider, Dark Raider S, Blue Skies, Blue Skies 3GS, The Guy Game, The Girl Game, Asteroids 3K", "metacritic": null, "released": "2008-09-18", "tba": false, "updated": "2019-07-30T14:16:09", "background_image": "https://media.rawg.io/media/screenshots/db6/db69d390e7f1ac4b0af39bad9f6b0a94.jpg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 266, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Rocking Pocket Games", "Chris Egerter"], "genres": ["Action", "Arcade"], "publishers": ["Chris Egerter"], "esrb_rating": "Everyone 10+"}