{"id": 87760, "slug": "helicopter-pilot-rescue-flight", "name": "Helicopter Pilot Rescue Flight", "name_original": "Helicopter Pilot Rescue Flight", "description": "Get ready to start the flying adventure inside the city with city helicopter rescue flight simulator. Be the helicopter pilot to navigate rescue helicopter flight and landings to save civilians, police officials and news reporters in emergency situations. Those who love playing rescue helicopter and air ambulance games will love to play city helicopter flight. Take control of your own rescue helicopter and fly inside the city. The game includes chopper flying, helicopter navigation and complete manual handling. Act as the rescue pilot and save the people in emergency situations. Fly in the skies and look around for emergency areas and rescue them all. Save lives of people in danger and fulfill the duty of an air ambulance pilot.<br/><br/><br/>The gameplay revolves inside the city where you act as the helicopter pilot flying a rescue flight and looking for emergency calls to help city people. Do you think you can fly a helicopter flight? Show your helicopter flying skills and move inside the city between big buildings. Get the experience of flying a rescue flight in this 3d helicopter simulator. Someone might be stuck in building on fire, an accident might have taken place due to a criminal activity or you need to transport an injured person in your air ambulance city helicopter flight. New chapter into the series of helicopter flight games where you don’t play as a police official or an army personnel but a rescue pilot flying his air ambulance to rescue people in emergency situation. Time to showcase your extreme pilot skills.<br/><br/><br/>Ready to fly? Begin the helicopter flight and let’s complete transportation and rescue missions.<br/><br/><br/> GAMEPLAY FEATURES <br/>•\tPlay as Helicopter Pilot<br/>•\tReal-time 911 Rescue Missions<br/>•\tFly Over the City and Reach Emergency Areas<br/>•\tManual Helicopter Handling and Flying<br/>•\tMultiple Gameplay Tasks to Complete", "metacritic": null, "released": "2015-11-10", "tba": false, "updated": "2019-10-22T14:09:27", "background_image": "https://media.rawg.io/media/screenshots/1d7/1d7fa04bbd88d870a2c8d9b76e2bfd0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Action", "Simulation"], "publishers": ["The Game Storm Studios"], "esrb_rating": null}