{"id": 87762, "slug": "rebels-and-redcoats", "name": "Rebels and Redcoats", "name_original": "Rebels and Redcoats", "description": "Rebels &amp; Redcoats recreates the pivotal battles of the American War of Independence. The latest strategy game from Hunted Cow Studios brings the classic Decision Games board game to Mac; and is the first in a series of games to come from this exciting partnership. Take command as either the American colonies or the British Empire and shape the future of a nation, with 10 historical battles. <br/><br/>You will face the same tactical challenges as generals such as George Washington and William Howe, with missions of varying size and objectives, and 24 different combat units. As with previous strategy games from Hunted Cow, every effort has been made to capture the look and feel of the warfare methods, equipment and uniform of the day, and this title is no exception. In these battles players will also find the detailed and accurate maps, orders of battle, and named regiments from the well-loved Decision Games board game. <br/><br/>The hex-based game system features a large variety of infantry, cavalry and artillery units, generals and terrain types. Use your combined forces to outmaneuver, outwit or outshoot your opponent. Victory awaits you, Commander!<br/><br/>Key Game Features<br/><br/>● 5 Mission 'Tutorial' Campaign.<br/>● 5 Mission ‘Resistance' Campaign.<br/>● 5 Mission ‘Revolution' Campaign.<br/>● All missions, apart from the tutorial, can be played as both sides.<br/>● 37 different historical models representing 26 different unit types.<br/>● Three classes of troop quality – Raw, Average and Veteran.<br/>●\t New general quality mechanic, affecting command radius and leadership benefits. <br/>● 14 different troop classes including infantry (line, grenadiers, guard, and militia), light infantry (and jägars), light cavalry (light dragoons and hussars), dragoons and artillery (4pdr and 6pdr).<br/>● 5 types of infantry formation - Line, Column, Open Order, Square, Unformed.<br/>● New joint Artillery and infantry formations, allowing for effective and resilient combined units.<br/>● New troop morale mechanic (Disruption)<br/>● New 'light' woods that block line of sight but don't give a defensive bonus.<br/>● Detailed Combat Analysis <br/>● Map zoom<br/>● Flank Attacks <br/>● Strategic Movement <br/>● Game Centre Achievements and Leaderboards <br/>● iCloud Saves<br/><br/><br/><br/>Find us on Facebook - facebook.com/huntedcow<br/>Follow us on Twitter - @HuntedCow<br/>Game Forum - forums.huntedcow.com/hexwar<br/><br/>Thank you for supporting our games!<br/><br/><br/><br/><br/>All Rights Reserved.", "metacritic": null, "released": "2014-11-06", "tba": false, "updated": "2019-08-02T03:50:30", "background_image": "https://media.rawg.io/media/screenshots/c74/c745f39b69a7d6b2242da44cdde42e18.jpg", "website": "https://www.huntedcow.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 366, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS", "macOS"], "developers": ["Hunted Cow Studios"], "genres": ["Strategy", "Board Games"], "publishers": ["Hunted Cow Studios"], "esrb_rating": null}