{"id": 877785, "slug": "hexagon-traveler", "name": "Hexagon Traveler", "name_original": "Hexagon Traveler", "description": "<p>Hexagon Traveler is a casual puzzle game with 'spin' as its core mechanic. The rules are simple: players take on the role of a bull and spin the wheel across thousands of miles to deliver a letter to its target. Experience and master the unique mechanics associated with delivering letters in each new level and experience a wide range of fun. Take a break in a relaxing hot spring, dodge dangerous enemies or savour the tantalising grass along the way. As you deliver your letters, a heartfelt and moving story unfolds, weaving together a unique metaphorical experience.<br/></p>\n\n<p><strong>Game guide</strong></p>\n<p><strong>2.1 Instructions for installing and running the game</strong></p>\n<p>Download the installation package and unzip it</p>\n<p>Select the \"MountainRiver.exe\" file and run it</p>\n<p>Make sure to turn on the sound for the best gaming experience</p>\n<p><strong>2.2 Game Operation Guide</strong></p>\n<p>Core Operations</p>\n<p>Use the left mouse button to click on the centre of the plot to be rotated.</p>\n<p>Click on the keyboard \"Q\" to control the counter-clockwise rotation of the reels.</p>\n<p>Click on \"E\" to rotate the reels clockwise.</p>\n<p>Auxiliary actions</p>\n<p>Click on \"Pause\" at the top left of the screen or press \"Esc\" on the keyboard to call out the pause menu.</p>\n<p>From the pause screen, you can perform the \"Exit to level selection page\", \"Restart\" and \"Continue\" operations.</p>\n<p>In order to guarantee the experience of participation, all levels are now open for players to choose.</p>\n<p>If you are unable to complete all levels due to time constraints, please make sure you experience levels 3-8 before you finish the game!</p>\n<p><strong>2.3 Other guidelines or tips</strong></p>\n<p><strong>Beginner's guide</strong></p>\n<p>In the newbie guide section, the levels are conceptualised in a weak guidance mode, with a minimalistic Q-print hand-drawn style to show the various icons and buttons, reducing the frequency of text appearing in the levels and ensuring that the fairytale feel of the game is not broken up by hard text to a certain extent.</p>\n<p><strong>Levels of difficulty</strong></p>\n<p>A smooth difficulty curve has been adopted between levels. This ensures that each time a new mechanic is introduced, the player is at the peak of the Darkside effect, thus keeping the player in a constant upward mental flow experience.</p>\n<p>  <br/><strong>Storyline guidance</strong></p>\n<p>Each major level corresponds to a relationship in which a letter is delivered, such as a letter from a parent to a child, a letter to a loved one, or a letter to a close friend. At the beginning of each big level, a text and CG will show the different meanings expressed by each letter. But most importantly, the story leads to \"love\". The letters are not just simple words or messages, but also symbols of great emotion. </p>\n<p><strong>UI guidance</strong></p>\n<p>In the UI section of the game, there is a left half and a right half, which corresponds to the system interface operations and the in-game messages. The in-game messages include the number of letters delivered to the target, the minimum number of steps recommended for the player to achieve, and the size of the character. These three conditions correspond to the three objectives of the game, and when the player has completed the objectives, the number of stars in the UI on the checkout page will indicate the achievements the player has achieved.</p>", "metacritic": null, "released": "2022-11-04", "tba": false, "updated": "2022-11-07T17:04:41", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ff55a9f264f5d249d92d5941451248b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["gnt007484"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}