{"id": 87787, "slug": "pro-golf-challenge", "name": "Pro Golf Challenge", "name_original": "Pro Golf Challenge", "description": "Enjoy the convenience of being able to play a round of golf, any time you want, right on your iPhone or iPad.  <br/><br/>Touch the club head to select and drag it up out of your golf bag.  Pivot left or right to adjust your stance and aim.  Use your finger as the golf club, touching the club head and dragging it to the right to wind up, and back to the left to hit the ball.  You control the distance by adjusting how far and strongly you swing. <br/><br/>The View Button zooms out to let you see a bird’s eye view of the current hole.  The Path Button lets you see the predicted path of the ball using the selected club.  Your bag includes 3 woods, 7 irons, a wedge, and a putter. <br/><br/>Automatically keeps score.  Optionally shares your accomplishments via email, instant messaging, or social media.<br/><br/>Multiple gameplay modes:<br/>     - 1 Player, Front 9 (holes 1-9)<br/>     - 1 Player, Back 9 (holes 10-18)<br/>     - 1 Player, Full Course (holes 1-18)<br/>     - Free Play, practice whatever hole you wish<br/>     - 2 - 4 Players online<br/><br/>Challenging for all ages.<br/><br/>Enjoy by yourself or go head-to-head online against invited opponent(s).<br/><br/>Game is multiplayer and multi-platform, supporting most popular smartphones, tablets, and computers.<br/><br/>Universal App - supports iPhone, iPod Touch, and iPad, including standard, Retina, and iPhone X displays.", "metacritic": null, "released": "2018-03-09", "tba": false, "updated": "2019-07-30T15:38:02", "background_image": "https://media.rawg.io/media/screenshots/7bf/7bfe7e1d7fb33eaa265e69ada91ba243.jpg", "website": "http://MagninGames.com/progolf", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Magnin & Associates"], "genres": ["Simulation", "Sports"], "publishers": ["Magnin & Associates"], "esrb_rating": null}