{"id": 87783, "slug": "multi-level-parking-2016", "name": "Multi Level Parking 2016", "name_original": "Multi Level Parking 2016", "description": "Ready to drive inside the multi -storey car parking plaza? This is your chance to showcase your parking and driving skills. Multi level parking sim is a modern car parking simulator where you learn the real skills to park a car. The game is filled ultimate car parking and simulation. Drive multi cars, jeep and other fast driving vehicles and park them on their desired location. Parking in extreme conditions is not an easy task. A little driving skill with precision car parking inside multi level car parking plaza. It’s a modern day parking sim with precision controls and speed. Exciting drift, drive and park with realistic driving controls.<br/><br/><br/>Steer the car and pick up the speed to move ahead. Let’s get into the challenge and drive the vehicle with great precision. Roads might not be jam packed but driving inside parking lots and plaza is not an easy job. Taking your car on rooftop and driving them back to the ground floor is a big task. Park your Car in Multi-storey building and enhance your parking accuracy. Avoid crashing into barriers and other vehicles! Controls speed of the vehicles while your drive and park on the right spaces. The traffic will be a hurdle in your objectives. The ultimate car parking experience will let you enjoy driving and parking all at one place.<br/><br/><br/>Time to get your hands on one of the most realistic multi-storey car parking games. Driving cars and park inside the multi level parking plaza. This auto parking valet has different missions with varying difficulty levels to challenge your car driver skills. Prove yourself as the best parking driver with multi level parking mania. Accelerate and stop at right moments. Manoeuvre your car and park with perfection.<br/><br/><br/>GAMEPLAY FEATURES <br/>•\tReal Driving Experience <br/>•\tMultiple Cars to Drive &amp; Park<br/>•\tLearn the Real Skills to Park inside the Parking Plaza<br/>•\tEnjoy Multi Level Parking Environment<br/>•\tMultiple Vehicles to Enhance User Driving Experience", "metacritic": null, "released": "2016-10-27", "tba": false, "updated": "2019-10-22T14:20:51", "background_image": "https://media.rawg.io/media/screenshots/44b/44b893d7a13a9bffad76ddd462b38146.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Simulation", "Racing"], "publishers": ["The Game Storm Studios"], "esrb_rating": "Everyone 10+"}