{"id": 877937, "slug": "spells-and-fellas", "name": "Spells and Fellas", "name_original": "Spells and Fellas", "description": "<strong>Spells and Fellas</strong> is a fast-paced arena survival game. Fight against enemies alongside your allies and get new spells, equipment, and companions as loot. As the wave number increases, so do the number and size of enemies. How long can you survive?<h3>• Fight with Magic</h3>You're a wizard who has the ability to cast different kinds of spells. Use damage spells to deal damage to approaching enemies and negatively affect their combat ability with sabotage spells. Heal yourself or your allies with healing spells, and boost your team's fighting ability with the help of boost spells. You can also conjure various shields to protect yourself from bloodthirsty enemies.<br/><br/><br/><h3>• Become More Powerful</h3>As you receive more powerful spells and equipment, your character's stats go up. This means your spells become more powerful and you can cast them more quickly. Some equipment increases your maximum health, while others increase your movement speed or the chance to strike a critical strike.<br/><br/><br/><h3>• Face Bigger and Badder Enemies</h3>As the wave number increases, so do the number and size of enemies. While the arena fills up with enemies, free space becomes one of the most critical things in terms of survival. In difficult situations, it's good to resort to spells that can push enemies away. When the enemy wave starts to ease, it's beneficial to prepare for the next one, because it might bring one of the bosses along with it.<br/><br/><br/>", "metacritic": null, "released": "2022-11-07", "tba": false, "updated": "2022-11-11T03:14:48", "background_image": "https://media.rawg.io/media/screenshots/d06/d066787df6fa34e4fbd3e32a53100bb6.jpg", "website": "https://www.holotna.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Holotna"], "genres": ["Action", "RPG", "Strategy", "Indie"], "publishers": ["Holotna"], "esrb_rating": null}