{"id": 877958, "slug": "lost-between-the-lines", "name": "Lost Between the Lines", "name_original": "Lost Between the Lines", "description": "[A large-volume romantic drama with beautiful illustrations by a popular artist!]<br/>As to what exactly is starting, it's a perfectly normal high school love story starring a somewhat abnormal girl!<br/>The cool, intellectual Suzumiya Rion.<br/>She usually keeps her distance from her classmates, but for some reason, she invited me out on a date!<br/>And the secret Rion's hiding will finally be revealed… <br/>If you clear all five endings, you'll find out your future with her.<br/>Try out all the different choices and see where you end up.<br/><br/>[The game system is a simple novel-type adventure]<br/>The choices that appear here and there in the story change the distance between you and your girlfriend!<br/>The story will branch into one of five different endings accordingly.<br/>Restart the game again and again to complete all the endings!<br/><br/>[Main character:Suzumiya Rion]<br/>She is the most elegant, serious, and studious high school girl in the school!<br/>Rine Suzumiya, who is the most popular madonna in the school, is suddenly approaching you, a girl with whom she has little contact!<br/>However, her eyes sometimes glaze over with a lonely look. ......<br/>When her secret is revealed, their romance begins!<br/><br/>[Voice: Hikaru Ueda]<br/>Rion is voiced by Hikaru Ueda, who also played the lead role in the Japanese animation!<br/><br/>TwitterID:@o4novel", "metacritic": null, "released": "2022-11-07", "tba": false, "updated": "2022-11-11T03:40:36", "background_image": "https://media.rawg.io/media/screenshots/0c9/0c9268428d694f76f607dc0c36fcd459.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["株式会社5次元", "サイバーズ株式会社"], "genres": ["Adventure", "Casual"], "publishers": ["株式会社5次元"], "esrb_rating": null}