{"id": 87790, "slug": "school-bus-driver-city-drive-to-pick-drop-kids", "name": "School Bus Driver – City Drive to Pick & Drop Kids", "name_original": "School Bus Driver – City Drive to Pick & Drop Kids", "description": "Have you missed your school in summer vacations? It’s back to school time with school bus driver simulator 2015. Get ready kids to go back to school and enjoy school life. Bus driver usually transport kids to school and pick them back for home. Kids are excited to back to school and waiting for their schoolbus to arrive. Start your driving duty early morning as the school bus driver and drive to pick up kids for school. Some turns and paths could be extreme but be careful about the safety of the kids. Don’t rush along the traffic and be the perfect bus driver. Transport kids to school and home safely. Even take them for outing or eating ice cream whenever they want to. Get ready for the real bus driving adventure inside the big city environment.<br/><br/><br/>The city traffic might cause you to get late for school but be quick, drive fast but keep the safety of the kids in mind. No need to break traffic rules while driving your school bus. Bus driving games are loved by kids but driving a school bus is a very responsible task. Don’t go off road or you might get caught in an accident. School bus driver simulator is perfect driving simulation to play and have hours of fun. Explore the environment, take kids for an ice cream but don’t be late for home. Back to school bus driver simulator will let you enjoy the thrill of going to school after a long summer season vacations.<br/><br/><br/>FEATURES<br/>===========<br/>•\tSchool Bus Driving Experience<br/>•\tExplore the Big City Environment<br/>•\tPick and Drop School Kids<br/>•\tA Unique Concept for School Going Kids<br/>•\tAmazing Gameplay with HD Graphics<br/>•\tPlay as a Virtual Bus Driver", "metacritic": null, "released": "2015-09-23", "tba": false, "updated": "2019-10-22T14:16:21", "background_image": "https://media.rawg.io/media/screenshots/9c6/9c67409ad747e30b642a61eeb39a2c81_IzfnEmb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["The Game Storm Studios"], "genres": ["Simulation", "Racing"], "publishers": ["The Game Storm Studios"], "esrb_rating": null}