{"id": 877950, "slug": "the-video-game-machine", "name": "The Video Game Machine", "name_original": "The Video Game Machine", "description": "The Video Game Machine simplifies the joy of game creation into 3 clicks...<br/><br/><ul><li>Pick a Genre. <strong>Click!</strong><br/></li><li>Choose your Hero. <strong>Click!</strong><br/></li><li>Name your Game. <strong>Click!</strong></li></ul><br/>And that's it! VGM takes your input and builds your own retro adventure, blurring the line between playing and creating.<br/><br/>If mid-game inspiration strikes , simply pause the action to bring up VGM's feature-rich <strong>editor</strong>. With hundreds of enemies, environments, items, NPCs, and more, the editor lets you create your very own game worlds to explore and enjoy.<br/><br/><h3>Current Features</h3><ul><li>A Generation system that builds a game from hand-crafted template levels.<br/></li><li>3 Initial Genres: Sidescroller, Legendary Adventure, and Runner.<br/></li><li>A fully functional Game Editor that can be brought up at any time, letting you take the generated game and make it your own.<br/></li><li>Hundreds of heroes, enemies, environments, music tracks, items, and rules to play (and create) with.<br/></li><li>An easy-to-share XML format, that lets other VGM players enjoy your creations.<br/></li><li>Several sample games to play, enjoy, and learn from.</li></ul><br/><h3>Feature Roadmap</h3><ul><li>Story Mode: We need a campaign that takes the player through a hand-crafted adventure. This mode will unlock unique content that can be used in the 'Make a Game' portion of VGM.<br/></li><li>Additional Genres: The more genres VGM has, the less work required to make the games you're envisioning. Every new Beta build will have at least one additional Genre to build from.<br/></li><li>More Content: Whether its heroes, enemies, items, or mechanics, every new EA build will add additional gameplay goodies to build with.<br/></li><li>Workshop Support: Once the mechanics and data formats are finalized, we will be hooking up Steam Workshop support so players can digitally share their creations.</li></ul>", "metacritic": null, "released": "2022-11-08", "tba": false, "updated": "2022-11-11T03:30:25", "background_image": "https://media.rawg.io/media/screenshots/9af/9af667d5c148ebf0509e61302618b342.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 294, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Tykocom"], "genres": ["Action", "Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Tykocom"], "esrb_rating": null}