{"id": 877993, "slug": "invercity-2", "name": "Invercity", "name_original": "Invercity", "description": "<strong>Handstand looks like hanging when you look it upside down, doesn't it?</strong><br/><br/>Invercity is a puzzle-platformer that features \"Handstand\".<br/><br/>The game has two important mechanics: \"Handstand\" and \"Inverted Broadcast\".<h3>Handstand</h3> <br/>\"Handstand\" reverses gravity for all objects but you for the physics principal law; “things fall to bottom”.<h3>Inverted Broadcast</h3> <br/>The monitor is turned upside down when \"Reverse Broadcast\" is performed.<br/>\"Handstand\" will be replaced with \"hanging\". Because it \"looks\" that way!<br/><br/>Explore the mysterious city with two actions \"Handstand\" and  \"Inverted Broadcast\".<h3>Synopsis</h3>Panic in the city due to the \"Handstand Phenomenon\" in which objects fall into the sky!<br/>A reporter who loves handstand is chosen to cover the event.<br/>While covering various parts of the city, she tries to find out the mystery behind the \"Handstand Phenomenon\"!<h3>Secondary Use</h3>To post or stream images and videos using the play screen and audio are fully allowed.<br/>However, please always play with the in-game option \"Streamer Mode\" enabled.<br/>※Only spoiler parts of the story will be automatically skipped. Captures in non-streamer mode can also be used by cutting the spoiler parts.<h3>Community server</h3>We have a Discord server for bug reports and communication. Feel free to use it!<br/><br/>https://discord.gg/fRqey7s9pY", "metacritic": null, "released": "2022-11-09", "tba": false, "updated": "2022-11-11T04:28:10", "background_image": "https://media.rawg.io/media/screenshots/50e/50e8a95d7878470f3440a9f6af3aa8f8.jpg", "website": "https://marudice.com/invercity/en", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Marudice"], "genres": ["Action", "Indie"], "publishers": ["Flyhigh Works"], "esrb_rating": null}