{"id": 878027, "slug": "a-path-to-the-princess", "name": "A Path to the Princess", "name_original": "A Path to the Princess", "description": "<strong>LIGHT WEIGHT PUZZLER</strong><br/><br/>Mostly, you won't struggle to solve puzzles. That's a quite simple and short game - to distract gamers for a bit. Achievable, satisfying, easily rewarding - that's all you could ask for to calm your mind.<br/><br/><br/><br/><strong>VERSUS MODE - SPLIT SCREEN</strong><br/><br/>There is no story behind game but there is a princess if you want to save her from castle.. Classic story. But to spicy things up, someone else can join to --- to competition of saving her, you weirdo, not anything else!<br/><br/><strong>NO 2ND CONTROLLER? NO PROBLEM. ALSO NOTHING MORE REALLY TO SAY</strong><br/><br/>A Path to the Princess supports Keyboard + Controller combination if you don't have 2 controllers connected. Xbox and Playstation controllers are supported. And that's all about this game. Please don't expect too much and enjoy!<br/><br/><br/><br/><strong>OK MAYBE SOME GAMEPLAY</strong><br/>All you gotta do is figuring out how you can get to the princess with at least a ball. In single player mode, beware that you need to do this before timers runs out. In versus mode, remember that you are in a competition. Once you initiate a movement, player will continue in that direction until he runs into a void - or runs out of ball. Multiplier tiles will give you more ball while hollow tiles will cause you to lose a ball - balance them. Breakable tiles won't be there once you pass over them. Button tiles will rotate switchable tiles once you pass over them. You can reset yourself in versus mode. Also you can rotate camera in single player mode to have a better perspective. Game has 3 areas, each has 15 levels for solo run. Enjoy every single bit of it.", "metacritic": null, "released": "2022-11-10", "tba": false, "updated": "2022-11-11T05:15:36", "background_image": "https://media.rawg.io/media/screenshots/bd4/bd4f0d1c31e6390c86c3f2c83facf805.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Metgan Games"], "genres": ["Strategy", "Casual", "Indie"], "publishers": ["Metgan Games"], "esrb_rating": null}