{"id": 878009, "slug": "memetric-classic", "name": "Memetric: Classic", "name_original": "Memetric: Classic", "description": "It's a \"side-scrolling\" real-time strategy game, pixelart style, with a few small \"rouge-lite\" elements. You have to collect and farm creatures, various bizarre creatures, to further develop your territory and eventually defeat the evil force that has been organizing against you throughout the game.<br/>\n<br/>\r\nDepending on the playthrough, various creatures can be acquired and farmed, many of which have unique characteristics.<br/>\r\nBy purchasing these creatures you can gain resources (energy).<br/>\n<br/>\r\nYou can use the energy to upgrade walls, lasers, mines and a wide range of other defensive equipment. The game has a passive development system, your repertoire of tools will evolve in whatever direction the system deems useful to you.<br/>\n<br/>\r\nAnd what are these defences against?<br/>\r\nAgainst mould, which, like an infection, overwhelms and destroys the living things the player builds. In other words, there is no arch-villain, some being above all. You simply have to repel and eventually defeat the attacks of the mould that constantly besieges the night.<br/>\n<br/>\r\nStorytelling about the fate of the game:<br/>\n<br/>\r\nAs a result of experimental development that started back in 2018, a game software called \"Memetric demo\" was visible and playable on a small game sharing site, which reached version 1.3, but was removed after 2020 due to an internal decision of the development team. Since then, this game was nowhere to be found officially and seemed to be lost forever.<br/>\n<br/>\r\nNow, at the end of 2022, CloudCage who own the rights to this game decided it was time to override the mistake made in 2020 and give players back a slice of the deep-indie market they thought was lost.<br/>\n<br/>\r\nSadly, while it's not quite the same game, we've done our best to bring back as much of the feel as possible and add enough extras that don't take away from its early charming immaturity.<br/>\r\nThis game has been recreated from the original 2018 code. It includes the earliest 1.0 version of the in-game \"item unlock\" system, includes all of the creatures from version 1.1, all of the secrets and camera views from version 1.2, and some of the visuals from version 1.3. But it also includes new features, building and gathering mechanics never seen before in this version. \"Holovision\" elements and pop-up button markers to make the game easier to play. Background elements to clarify your own area.<br/>\r\nLots of options compared to the original game, including difficulty setting.<br/>\r\nSo, in a few words: both graphically and mechanically improved, you could say this could be the 1.4 version of the game that never existed.<br/>\n<br/>\r\nWe made sure it wasn't perfect. We didn't want to erase the original unpolished charm of the game, so we didn't fix every little bug, delete shortcut parts and \"hammer every protruding nail\". We believe that the small, now perhaps defunct, but resurgent audience of gamers who were deprived of this game loved it for what it was, and we intended to give it back to them.<br/>\n<br/>\r\nThat's why we want to say that while minor patches to fix the bugs in this new version will be coming, and the game's optimization will improve over time; BUT the gameplay will not change! We won't change things in it that will make it stop being the game it is after months or years.<br/>\n<br/>\r\nIt's a tribute to a not so ancient but closed era, to developers who loved this game and did their best for their tiny target audience, to players who lived, spent and played every little update of this game. To everyone who ever loved the Memetric demo!", "metacritic": null, "released": "2022-11-09", "tba": false, "updated": "2022-11-11T04:51:30", "background_image": "https://media.rawg.io/media/screenshots/048/0484dc2c56517b7981af41198f0abc22.jpg", "website": "https://www.cloud-cage.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CloudCage"], "genres": ["Strategy", "Simulation", "Indie"], "publishers": ["CloudCage"], "esrb_rating": null}