{"id": 878025, "slug": "ji-jie-shou-jin-hua-mechanical-beast-evolution", "name": "机械兽：进化（Mechanical beast: Evolution）", "name_original": "机械兽：进化（Mechanical beast: Evolution）", "description": "This is a survival game that simulates mechanical beasts. By fighting with other mechanical beasts and absorbing their corpses, you can obtain evolution points. Together, evolution, mutation evolution, deformity mutation evolution, and alloy evolution can greatly affect the appearance and attributes. If you are not satisfied with the evolution attributes and appearance, you can choose to degenerate. After accumulating evolution points, you can evolve again and finally grow into the strongest mechanical beast.<br/>\n<br/>\r\nHeat energy: survival needs heat energy, which will continue to decrease, but running can increase heat energy.<br/>\n<br/>\r\nElectric energy: walking requires electric energy support, and electric energy can be absorbed through the current river.<br/>\n<br/>\r\nEating: You can obtain heat energy, electric energy and evolution points by eating and absorbing.<br/>\n<br/>\r\nMutation: Eating genes of other races will affect the evolutionary path and cause mutation to other races.<br/>\n<br/>\r\nDeformity and variation: every evolution may lead to deformity and variation, which may be positive or negative, and will affect the attributes of mechanical animals, and mechanical animals will also have special changes.<br/>\n<br/>\r\nFight: One of the ways to get energy from corpses.<br/>\n<br/>\r\nAccording to incomplete statistics, there are more than 300 million changes in evolution, variation evolution, malformation variation evolution and alloy evolution of mechanical animals. The more evolution, the greater difference. Please take a journey of evolution of mechanical animals.<br/>\n<br/>\r\nThe current version has 3 mechanical beasts online, which are beta versions and will be updated regularly. Currently, they do not represent the final quality.", "metacritic": null, "released": "2022-11-10", "tba": false, "updated": "2022-11-11T05:12:47", "background_image": "https://media.rawg.io/media/screenshots/a7d/a7dfd0c4c9c1f194ce3c0e41d152d127.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 467, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["古德模型", "goodmoxing"], "genres": ["RPG", "Simulation", "Massively Multiplayer"], "publishers": ["古德模型", "goodmoxing"], "esrb_rating": null}