{"id": 878039, "slug": "zid-journey-demo", "name": "Zid Journey DEMO", "name_original": "Zid Journey DEMO", "description": "Zid Journey is coming soon and can be wishlisted here\n<br/>\n<br/>\n<br/>\n<br/>\nThe cartoony dinosaurs are back in the second chapter of the Zid and Zniw Chronicles series! Featuring a familiar look and feel, Zid Journey combines classic point-and-click adventure gameplay with charming cartoon visuals, comic book-esque art style, and frame-by-frame animation!\n<br/>\n<br/>\n<br/>\n<br/>\nZid - a young dinosaur Woodroamer living in the safe shelter of Magmosian woods - discovers an odd and abandoned egg. Deeply concerned, he takes the egg with him to ask fellow dinosaurs about it. However, much to everyone's shock, it soon hatches into a carnivore - a Daspletosaurus baby! A predator feared in Magmosia!\n<br/>\n<br/>\nDaspletosaurus haven't been seen around these parts though... And what's worse, the hatchling will most definitely not survive on its own! With all that, Zid decides to reunite the baby with its family. It will be a daunting task, as the only clue of the hatchling's origin is a mysterious mountain in Northern Borderlands. To make matters even more personal - Zid is also searching for his own long-lost family. And one of the last sightings of his kind was in the heart of Northern Borderlands as well...\n<br/>\n<br/>\n<br/>\n<br/>\n<ul><li>Charming visuals featuring cartoony art style, hand-drawn backgrounds, and frame-by-frame animations!\n<br/>\n</li><li>The dino-baby in your backpack will not only give you small hints, but will also have its own unique gameplay segments!\n<br/>\n</li><li>Even more different dinosaurs and other prehistoric creatures to meet on your way!\n<br/>\n</li><li>Visit new places, landmarks, and settlements in the prehistoric world of Polisemia!\n<br/>\n</li><li>The in-game encyclopaedia returns, with information about creatures, items, and locations you encounter during your travels!\n<br/>\n</li><li>A pleasant soundtrack done by Zniw Adventure's composer - Denis Comtesse!</li></ul>", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-11T05:31:58", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Azure Mountain"], "genres": [], "publishers": ["Kurki.games", "Azure Mountain"], "esrb_rating": null}