{"id": 878026, "slug": "city-bus-manager", "name": "City Bus Manager", "name_original": "City Bus Manager", "description": "Build your own depot from scratch and create your personal bus routes in <strong>City Bus Manager</strong>. Play your own home town or any famous city in the world. Recreate the official bus network or change it completely to your preference. <br/><br/>Did you ever think your local bus schedule sucks? This is your chance to show that you can step it up. Connect all the Points of Interests and see your passenger numbers grow. Buy new buses and hire staff to make sure you can keep up with your schedule. <br/><br/>Take care of your buses in the repair and washing stations to make sure they meet your customers' demands. Build a Service Center to sell tickets directly at your depot and engage with your clients. Get the best passenger reviews and lead your bus company to a prosperous future!<br/><br/><br/><br/>Whether its your home town or any world-famous city (besides China) - it's in the game. 100% based on actual OpenStreetMap data including all the specific Points of Interests. The passenger simulation and bus route travel time is also based on real data. Recreate the existing lines or come up with completely new set-ups, it's all up to you!<br/><br/><br/><br/>Build everything that a good running bus depot needs. Parking slots, garages, warehouses, maintenance and washing stations are needed to take care of your vehicle fleet. But you also need offices, restrooms and a kitchen to take care of your staff. Also don't forget about the Service Center to sell tickets and connect with your customers. Choose from different environmental objects and furniture to match the depot to your style.<br/><br/><br/><br/>Clean and secure buses are mandatory to the future success of your company. Make sure your buses match the customers' expectations. Buy spare parts to repair your buses. <br/><br/><br/><br/>City Bus Manager arrives with more than 20 different bus models to offer the most realistic experience and allow you to adjust your bus fleet to your liking. On top all the buses can be repainted either ingame or via an external graphic tool and of course can be shared via the Steam Workshop.<br/><br/><br/><br/>Hire drivers, mechanics, office workers and many more to keep your company running. Take care of their needs so they can work efficiently and keep your costs in mind to scale up your business. Make the right choices and always keep the big picture in mind to set yourself up for success.<br/><br/><br/><br/>• Play in every city worldwide (except China) <br/>• Real satellite data, bus stops and POIs from OpenStreetMap<br/>• Create your own routes in your city<br/>• Trace your buses live with realistic passenger volume and route plan<br/>• Build your very own depot<br/>• Maintain your buses with spare parts management, washing and repair stations <br/>• 20 different bus models (including custom repaints)<br/>• Manage your employees and hire reliable and experienced staff<br/>• Service Center with ticket sales<br/>• Passenger feedback and reviews<br/>• Extensive Techtree", "metacritic": null, "released": "2022-11-10", "tba": false, "updated": "2023-05-01T02:01:16", "background_image": "https://media.rawg.io/media/screenshots/520/520cfeafd3977f411b1ea069fcffd2e5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "toplay": 1, "playing": 1}, "playtime": 9, "achievements_count": 57, "ratings_count": 1, "suggestions_count": 303, "game_series_count": 0, "reviews_count": 1, "platforms": ["macOS", "PC"], "developers": ["PeDePe GbR"], "genres": ["Simulation", "Casual"], "publishers": ["Aerosoft"], "esrb_rating": null}