{"id": 878553, "slug": "blob-bucket", "name": "Blob bucket", "name_original": "Blob bucket", "description": "<p><strong>I'm trying to get the webGL version working, but no luck so far.</strong><br/><br/>It is my pet project that I find myself working on when I should be studying for my biology degree. <br/><br/>It is still <strong>VERY</strong> much a work in progress. If want to iterate on it, create other stuff with it or help me make it more functional you're free to do so, it would be very fun, in fact.<br/><br/>There are three trophic levels:<br/>1. The green autotrophs called 'blibs' that get their energy from \"the void\", (their greenness and redness) and their nutrients from their environment.<br/>2. The heterotrophic primary consumers,  magenta 'blobs' and yellow 'blybs' that get their energy and nutrients from consuming blibs, and each other.<br/>3. The heterotrophic red 'blubs' that get their energy and nutrients from consuming blobs, blybs and each other. All heterotrophs are also scavengers, but they might poison themselves if their meal contains too much ammonia.<br/><br/>I'm currently working on getting the genetics to work properly, which means that the actual functionality is not that great right now. The heterotrophs are ml agents trained with reinforcement learning and the autotrophs are controlled by a simple script. <br/><br/>The only genomes that are kind of functional right now are the blib genomes.<br/>They are composed of two 2D-arrays of strings with the dimensions [9,486]<br/>Each index can contain the letters A, T, C, or G, which is then translated to amino acids  (another string of letters ) using the standard genetic code table. <br/><br/>Then the complementary sequences are translated as well (Read backwards &amp; A&lt;-&gt;T, C&lt;-&gt;G)<br/></p>\n<p>These amino acid sequences are then compared to a set of pre-defined sequences and the number of copies of each match correspond to different numeric phenotype values (moveForce e.g.)<br/><br/>The genomes, population numbers and phenotype values are sampled at regular intervals and exported as csv files in the application directory.<br/><br/>The source code can be accessed here: (please help me, it's a buggy mess)<br/>https://github.com/MandaPandaTroll/blob_bucket_no_scary<br/><br/>Good luck and have fun!<br/><br/>Keybindings: <br/></p>\n<p>WASD: pan camera<br/></p>\n<p>Up, down arrows: zoom camera</p>\n<p>Left, right arrows: change camera movement speed</p>\n<p>R: restart simulation</p>\n<p>Y: spawn blyb, O: spawn blob, I: spawn blib<br/></p>\n<p>ESCAPE: quit</p>\n<p>N: slow time</p>\n<p>M : speed up time.<br/><br/>To really mess around with the settings, you'd need to open it in the unity editor... I can send you a copy if you're interested :)</p>", "metacritic": null, "released": "2022-11-09", "tba": false, "updated": "2022-11-11T09:12:44", "background_image": "https://media.rawg.io/media/screenshots/cb6/cb60c6d6bc953597edf4d9e72cc3f445.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["tabacwoman"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}