{"id": 878651, "slug": "bamboozled-dhavatar", "name": "Bamboozled (dhavatar)", "name_original": "Bamboozled (dhavatar)", "description": "<p>A game made in a week for Halloween with the purpose of having a friend, who normally doesn't play horror games, play this. This is meant as a light short horror game that someone could play if they wanted to try horror games, but didn't like the intensity of some of the games in this genre. No jump scares (other than unintentional ones), no flashing lights, no loud sounds, but includes many tropes of a flashlight, a monster, and the ever convenient locker to hide in. </p><p>Just you and the terror of being hunted in a maze of rooms. And pandas, because my friend likes pandas. The game starts light but slowly increases in intensity as you get closer to escaping. Everything has directional audio so use that to your advantage.</p>\n<p>The goal is to collect the panda figurines and escape through an exit while avoiding the monster. Requires keyboard/mouse to play.</p>\n<p><strong>CONTROLS</strong></p>\n<ul><li>WASD for movement</li><li>E to interact</li><li>L Shift to run</li><li>Hold right mouse for the directional radar (when you find it)</li></ul>\n<p><strong>CREDITS</strong></p>\n<ul><li>\"Panda\" (https://skfb.ly/6R8RZ) by Sxy0ny is licensed under Creative Commons Attribution (http://creativecommons.org/licenses/by/4.0/).</li><li>\"Lazy panda\" (https://skfb.ly/oo87M) by manogna is licensed under Creative Commons Attribution (http://creativecommons.org/licenses/by/4.0/).</li></ul>", "metacritic": null, "released": "2022-11-09", "tba": false, "updated": "2022-11-11T09:55:40", "background_image": "https://media.rawg.io/media/screenshots/7ba/7bac7222c78145c5e9f5101c987bedb7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["dhavatar"], "genres": [], "publishers": [], "esrb_rating": null}