{"id": 878816, "slug": "warp-visualizer", "name": "Warp Visualizer", "name_original": "Warp Visualizer", "description": "What is this?\r\n<p><strong>This project is a music visualizer based on Unity particle system. </strong></p>\n<p>It creates a colored warp effects with various adjustable settings. It features an automatic mode that adapts the settings to the music you're listening to and a manual mode where you can change every settings. It needs to be seen more as an experiment or a prototype that a complete project that doesn't need improvements.</p>\n<p>Please note that <strong>the automatic mode is disabled in WebG</strong>L as it requires to use a file manager to load a music from your computer.</p>\n<p><strong>Do not use this software if you are under the influence of drug or alcohol. </strong></p>\r\nHow to Use?\r\n<p><strong>You can disable the UI at any moment by pressing the comma ( , ) key</strong></p>\r\nAutomatic mode\r\n<p>The automatic mode <strong>adapts the settings automically</strong> to the music you've loaded from your computer. The music needs to be in a .wav format, <strong>you can finds samples music in the \"sample\" folder.</strong> </p>\n<ul><li>Use the Load Music button to load a music from your computer. </li><li>The speed settings will adapt automatically</li><li>You can still change the colors and sounds settings</li></ul>\r\nManual mode\r\n<p>In the manual mode, <strong>you can tweak every settings yourself!</strong> Sadly, the pitch setting will be disabled as it need to music to be played inside the software to be effective.<br/></p>\n<ul><li>Make sure that \"Automatic mode\" is unchecked   </li><li>Put a background music or sound for a better experience</li><li>Have fun and explore the settings!</li></ul>\nSpecial thanks \r\n<p>Kevin McLeod, who's follow musics are used as sample musics:<br/>Kalimba Relaxation music<br/>Magic Forest<br/>Water Lily<br/>After party review (Sasche Ende)<br/>Mega Hyper Ultrastorm</p>Know Bugs<p>As this project is a prototype, it still contain bugs:\r\n</p>\n<p>The automatic mode music detection algortimh sometimes fail and think a slow music is fast and vice-versa. The samples musics has been selected specially to fit well with it.\r\n</p>", "metacritic": null, "released": "2022-11-08", "tba": false, "updated": "2022-11-11T11:04:32", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dc8c38534bca00add24c33697861306.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 24, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Cobra-117"], "genres": [], "publishers": [], "esrb_rating": null}