{"id": 878984, "slug": "look-into-the-mirror-ryan-strawbeary-cai", "name": "Look Into the Mirror (Ryan \"Strawbeary\" Cai)", "name_original": "Look Into the Mirror (Ryan \"Strawbeary\" Cai)", "description": "Look Into the Mirror\r\n<p>by Ryan Cai</p>\r\nDescription\r\n<p>This mini story is one of the chapters in a visual novel called <em>Project: Mirror</em> that I am currently working on. The main protagonist in this demo is Kagami, meaning \"mirror\" in Japanese. She is an android that wanders in Tokyo hoping to find her identity in the real world. This chapter works as a \"hidden chapter\" in the visual novel and let the players know more about how Kagami perceives the real world.</p>\r\nExperience Goals\r\n<p>The main goal I want to achieve here is to use text, music, and art to portraits the main protagonist's perception to the world.</p>\n<p>- <strong>Text</strong>: I use a first person point of view as the narration, so that I can dive into Kagami's mind a little bit to show how she feels about a certain thing. For example, she hates the texture of breads.</p>\n<p>- <strong>Music</strong>: I use music to both shape how Kagami sees the world and what the atmosphere is in certain scenes.</p>\n<p>- <strong>Art</strong>: I use artworks to show a little bit of how the world and the surroundings look like in the story.</p>\n<p>More broadly, this short story should also work as a \"sneak peak\" or a \"demo\" for the actual visual novel, in hope to grasp some audience's interest.</p>\r\nReference Art\r\n<p>The general story setting has taken inspirations from sci-fi pieces like <em>Cyberpunk</em>, <em>Deathloop</em>, and <em>Do Androids Dream of Electric Sheep?</em>. </p>\n<p>For character design, I have taken heavily inspirations from Hatsune Miku, as the main protagonist Kagami is an android who likes to sing. For the music direction, I use Music Generator GA, a final project for CM146(Game AI) class that I am a part of. Lastly, the art direction for designing the background(like fragments) and the \"dream\" scene is inspired from a mobile game Project: Sekai and its art for the character cards, trying to resemble a \"broken mirror\" vibe that portraits a broken world, and a broken self(since Kagami is \"mirror\").</p>\r\nCollaboration\r\n<p>- Art: all artworks, including the images and the background images are all created and provided by huahua.</p>\n<p>- Music: all music is generated from Music Generator GA, a Music AI that I was at that time working on for CM146(Game AI). The tool is built and created by Ryan Cai, Matthew Fritsch, Edwin Wang, and Adam Carter.</p>\r\nNote\r\n<p>- See source code and technical description at GitHub</p>\n<p>- Sometimes the music glitched at the beginning in the title screen.</p>\n<p>- Music Generator GA is an affordable tool for any game developers to generate music. Be sure to check the website. (the website should have a final update on December 6, 2021 and have published the final version for downloads)</p>\n<p>- There is no option to include music or not, and it is intentional. If you dislike the music, simply mute the browser.</p>\r\nConcept Art", "metacritic": null, "released": "2022-11-08", "tba": false, "updated": "2022-11-11T12:08:47", "background_image": "https://media.rawg.io/media/screenshots/d45/d45c20e11d8507fc152bb4e3c40344ba.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 9, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Ryan \"Strawbeary\" Cai"], "genres": [], "publishers": [], "esrb_rating": null}