{"id": 879103, "slug": "mega-city-police-prelude", "name": "Mega City Police: Prelude", "name_original": "Mega City Police: Prelude", "description": "This is the free prelude version of Mega City Police, Retrowave Skill-Based Action Roguelike inspired by truly old-school action movies. Prelude version Includes first 2 levels and 4 playable police officers of the full version.<br/><br/>Hello, Officer. Mega City needs your services. Are you ready to uphold the law?<br/><br/>The crime is out of control, the streets are not clean. There are criminals and psychopaths everywhere, ready to cut anyone’s throat. A corrupt megacorporation squeezes the life out of the citizens, seeking to establish control all over the city.<br/>Only the incorruptible police officers of Mega City Police Department stand fast before the crime wave that consumed the city and threatens to overwhelm society.<br/>Choose your cop and dive into a deadly battle against the criminals and brutal bosses to unleash the beast of justice in the darkest corners of the city.<br/><br/><h3>HARDCORE GAMEPLAY WITH TONS OF WEAPONS AND UPGRADES</h3><br/>Shoot, punch and use your abilities to destroy enemies at every level where you will find special boxes containing various weapons. Remember to collect money from enemies, they can be spent at the store to get new equipment and special contracts.<br/>Each level and every enemy is designed to hone your skills by utilizing each cop’s arsenal to its fullest, ensuring you will fight crime in the most effective way possible. Quick reaction and tactical thinking will be required to succeed.<h3>EVERY COP BOASTS A UNIQUE TACTICAL PLAYSTYLE</h3><br/>Become a brutal killing machine like a <strong>Cyborg </strong>who has three weapon slots, improved armor, and a magnetic pulse that interrupts attacks and stun enemies. <br/>Take on the classic role of a <strong>Rookie </strong>using a tactical dodge and stun grenade.<br/>Turn into a fast and extremely dangerous <strong>Scout </strong>with a lightweight frame and optical camouflage staying invisible to enemies and using her laser sight to inflict critical damage when the time is right.<br/><br/><br/><br/>These are just a few of the cops available from the start. Unlock more characters with unique tactical abilities as you go!<h3>PIXEL ART VISUAL STYLE INSPIRED BY THE 80S AND THE 90S ACTION MOVIES AND VIDEO GAMES</h3><br/>Do you remember the good old days when tough action heroes dispatched enemies with cool moves to a banging soundtrack? The entire game is imbued with the same retro spirit. Each pixel, each gun, and each item were crafted to give you that nostalgic feeling, from retro dudes for retro dudes with true love.<br/><br/><h3>HIGH REPLAYABILITY, A ROBUST PROGRESSION SYSTEM, AND PROCEDURALLY GENERATED LEVELS</h3><br/>What happens when crime is vanquished? It comes back with a vengeance. Completing the game for the first time unlocks a new police car, a new difficulty and more loadouts with instantly recognizable legendary outfits. Uphold the law in style.", "metacritic": null, "released": "2022-11-07", "tba": false, "updated": "2023-12-18T17:29:29", "background_image": "https://media.rawg.io/media/screenshots/98e/98ec673cc2ba953ca4be72d3a99c5c96.jpg", "website": "http://megacitypolice.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 44, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Undreamed Games"], "genres": ["Action"], "publishers": ["Ravenage Games"], "esrb_rating": null}