{"id": 879154, "slug": "planet-b-frame-friends", "name": "Planet B (Frame Friends)", "name_original": "Planet B (Frame Friends)", "description": "<p><strong>Submission for Global Game Jam 2019 with the theme \"What home means to you\"<br/></strong></p>\n<p><strong>Art credit: https://twitter.com/hyper_freeze<br/></strong></p>\r\nSetting\r\n<p>Humanity was able to build new colonies on mars.<br/></p>\n<p>You are a member of the first settlers on this uninhabitable planet. But your homebase is the only spot you feel save around. Wandering through the wilderness will come at mental cost, but to survive you need to collect water scatered in little puddles around the area. <br/></p>\n<p>All you can think of is constructing a space ship to get back to earth - your real home.<br/></p>\n<p>Each base owns parts to build such a ship. They are willing to befriend you when you share some of your water ressources with them. <br/></p>\n\r\nHow to play\r\n<p>At first unzip the file and start the Planet B.exe.<br/></p>\n<p>Move around with WASD and find water puddles to collect. <br/>You can also zoom out using the mouse wheel.<br/></p>\n<p>Be aware of the 2 bars on the top left. <br/>The blue one is your water storage - if the bar drops to zero one water ressource will be consumed. <br/>The second bar is your emotional security. Be near a friendly base to refill this bar.</p>\n<p>The planet is known to have lots of storms, if you are sucked into a vortex, it will throw you to the nearest base. This may come in handy.... or might doom you.<br/></p>\n<p>Your goal is to befriend all the other bases. In return they are going to give you their ship parts as well as provide you with mental security around their base. <br/>As soon as you've collected all 4 parts and brought them to your start base, you are ready to get home.<br/></p>\n\r\nWhat does home mean to us?\r\n<p>A home is a place where you feel save and relaxed. In Planet B you need to be near the closest thing on mars to a home: a base. There you are able to refill your mental strength, which you need to survive such a hostile and stressful environment.<br/>Moreover a home includes a social component as well. Therefore you can interact with other bases to extend your mental save space. A strong community will also make your save space larger and that's why the mental recreation area grows along with your community.</p>\n<p>But all in all mars is not a substitute for earth, which is filled with life. And in the end the earth is our home which we should care for.</p>", "metacritic": null, "released": "2022-11-07", "tba": false, "updated": "2022-11-11T13:25:44", "background_image": "https://media.rawg.io/media/screenshots/043/0435ac76eb632ee14e100789e9f004ca.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Frame Friends"], "genres": [], "publishers": [], "esrb_rating": null}