{"id": 87926, "slug": "doodle-chopper-lite", "name": "Doodle Chopper Lite", "name_original": "Doodle Chopper Lite", "description": "Welcome to Doodle Chopper (AKA Doodle Blue Skies), the most intense action packed doodle game on the iPhone!<br/>That's right, the popular helicopter shooter has been turned upside down into a doodle universe complete with retro 8 bit sound effects.  This is the lite version that lets you play through the first 4 levels.<br/><br/>STORY: <br/><br/>You are a new recruit at the Doodle Attack Force team.  Sergeant McDraw is teaching you to fly a helicopter when the evil Dr. Spaz interrupts and begins invading your piece of paper!  It is your job to prevent Spaz and his eccentric henchmen Bruno, Rachel, and the mysterious ninja Takeshi from paper domination.<br/><br/><br/>-30 Levels of addictive search and destroy action<br/><br/>-Pick up bonus health, gas, and cash from downed enemies.<br/><br/>-Use cash to research better weapons in the R&amp;D lab.<br/><br/>-A pulse pounding soundtrack of 10 techno rock songs<br/><br/>-10 different weapons including missiles, bombs, lasers and fireballs.<br/><br/>-Save at any point, play through story at your own pace.<br/><br/>-Arcade mode for instant action and unlimited levels<br/><br/>-3 difficulty settings<br/><br/>-Rain and weather effects<br/><br/>-Random level generator for unlimited fun!<br/><br/>- High production values and top notch sound effects<br/><br/>Developer Notes:<br/>To pause the game, click the power button on top the device or tap at the top in the middle to open the in game options.<br/><br/>More RPG Games:<br/>Doodle Chopper, Puppet Jump, Puppet Sprint, Puppet Labyrinth, Super Soccer Kick 3D, Super Football Kick 3D, Pocket Farm, iFishing, iFishing Saltwater, Dark Raider, Dark Raider S, Blue Skies, Blue Skies 3GS, The Guy Game, The Girl Game, Asteroids 3K", "metacritic": null, "released": "2010-06-25", "tba": false, "updated": "2019-10-22T14:20:55", "background_image": "https://media.rawg.io/media/screenshots/0fa/0fa54157e5ec54f64d4ee88d08170f35.jpg", "website": "http://www.RockingPocketGames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 118, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Chris Egerter"], "genres": ["Action", "Arcade"], "publishers": ["Chris Egerter"], "esrb_rating": "Everyone 10+"}