{"id": 87947, "slug": "fly-fishing-3d-hd-premium", "name": "Fly Fishing 3D HD Premium", "name_original": "Fly Fishing 3D HD Premium", "description": "Among sport fishing enthusiasts...<br/>\"Fly Fishing\" holds unmatched popularity...<br/>And now we introduce a full 3D game!<br/><br/>Let's begin the psychological battle with fishes in beautiful nature!<br/><br/><br/>Main Features:<br/><br/>11 types of flies have their own special features.<br/>Depending on your choices of field and seasons,<br/>you can enjoy the feeling of experiencing real-life fly fishing!<br/><br/>We prepared three types of mountain streams (upper, middle, lower), lake, and river.<br/>And two types of fishing: \"Bank Fishing\" and \"Boat Fishing\"!<br/><br/>\"Shop\" and \"coins\" are newly added!<br/>Collect coins by catching fishes or win some tournaments!<br/>Buy some new items to make easier to catch!<br/><br/>There are four types of game modes!<br/><br/>10 Online tournaments are newly added!<br/>You can compete with other anglers around the world!<br/>Win tournaments and earn trophies and rewards!<br/><br/>6 round tournaments are newly added too!<br/>You can compete with ten NPC competitors in total amount, weight, and length of fish(es)!<br/>Let's win all rounds and aim the \"Fly Fishing Champion\"!<br/><br/>We've increased the Challenge mode levels into 24 levels!<br/>Complete all levels in decided time limits, fields, and flies!<br/><br/>You can enjoy fishing free in \"Free fishing mode\"!<br/>You can go to the new fields by catching lots of fishes.<br/>In each fishing fields, catchable fishes are displayed in silhouette! <br/>Let's try to remove all silhouette, by catching all fishes!", "metacritic": null, "released": "2010-07-17", "tba": false, "updated": "2019-07-30T14:41:45", "background_image": "https://media.rawg.io/media/screenshots/c4d/c4db17aa5415449a292ae210fbe60512.jpg", "website": "http://www.pascal.jp/en/games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 179, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["pascal"], "genres": ["Simulation", "Sports"], "publishers": ["pascal"], "esrb_rating": null}