{"id": 879481, "slug": "sherlocks-locked-holmes", "name": "Sherlock's Locked Holmes", "name_original": "Sherlock's Locked Holmes", "description": "<p>This is a prototype version of Sherlock's Locked Holmes, a multiplayer game made with Unity and its fairly-new networking solution Netcode for GameObjects.</p>\n<p>Unfortunately, if you are not living with lingming kid his majesty, you will only be able to somewhat properly experience this multiplayer demo locally on a single machine by loading up multiple instances of the game.</p>\n<p><strong>Controls:</strong></p>\n<p>Shared Controls:</p>\n<ul><li>WSAD - movement</li><li>Shift - sprint</li><li>Space - jump</li><li>Tab - scoreboard</li><li>E, Q - camera tilt left/right</li></ul>\n<p>Sherlock:</p>\n<ul><li>Left Click - inspect target object(when aiming at an interactable one)</li></ul>\n<p>Civilians:</p>\n<ul><li>1, 2, 3 - steal, ignite, kill</li><li>Left Click - attempt to commit crime on target(when aiming at an interactable one)</li></ul>\n<p><strong>Gameplay Overview:</strong></p>\n<p>The game is designed to accommodate 2-4 players. Any number of players beyond that will be able to connect, but will not contribute positively to the gameplay experience, as most of the mechanics(including the score system and the crime-solving system) in the game only take in parameters from the first four players(Sherlock, Civilian 1, 2, and 3).</p>\n<p>As <strong>Sherlock</strong>:</p>\n<ul><li>during the <strong>first half </strong>of the game, you are forced to be <strong>locked </strong>in an enclosed room. why? because contemplating is good. or at least a friend of lingming said so.</li><li>during the <strong>second half </strong>of the game, you will be teleported from your little pathetic cage to the big house with <strong>traces of crimes committed by the civilians</strong> during the first half of the game left <strong>for you to investigate</strong>.</li><li>depending on how well you do on the investigation, you'll get awarded more, less, or no points. when you do <strong>get awarded points for solving a case with accuracy</strong>, you also <strong>deduct the same amount</strong> of points that you gain <strong>from the player who committed the crime</strong> that you just finished investigating.</li></ul>\n<p>As <strong>Civilians</strong>:</p>\n<ul><li>during the <strong>first half </strong>of the game, you have the freedom to <strong>move around </strong>in the big house and <strong>commit crimes </strong>against different things. depending on the types of crimes that you commit, you'll <strong>get awarded</strong> more or less points. </li><li>during the <strong>second half</strong> of the game, you will be <strong>teleported into the enclosed room</strong> that Sherlock has previously stayed in <strong>until the end of the game</strong>. why? because you're done! you've probably committed a crime, and you need to contemplate. but why the same room? ummm, because it's already there :)</li></ul>\n<p>The junction between the first and second half of the game will be determined by a timing system(which is not in the game). </p>\n<p>An example of how the game can be played at this point: </p>\n\n<p><strong>Things I've Not Added:</strong></p>\n<ul><li>timing system and teleportation of the players</li><li>music and sound effects</li><li>character models, maybe(since players can already be differentiated by colors and a HUD bar with their names on it)</li></ul>\n<p><strong>Known Issues:</strong></p>\n<ul><li>alt-tabbing during crime investigation and clicking back onto the screen causes the cursor to disappear. i should add an input option to manually make the cursor re-appear in that case.</li></ul>", "metacritic": null, "released": "2022-11-02", "tba": false, "updated": "2022-11-11T15:31:40", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lingming kid"], "genres": [], "publishers": [], "esrb_rating": null}