{"id": 879484, "slug": "monstieurs", "name": "Monstieur's", "name_original": "Monstieur's", "description": "<p>You are the monstrous chef at Monstieur's - a spooky restaurant for only the fanciest of monsters. It's your job to prepare frighteningly delicious dishes for your esteemed guests. </p>\n<p>However, you must be careful. A murderer lurks among your customers, waiting to kill them one by one using the ingredients that you served them.</p>\n<p>If your customers die out, your restaurant will fall into ruin. As you cook and serve meals, deduce which customer could be making a poison behind your back. Serve them a poison to save your customers and your restaurant.</p>\n<p><strong>HOW TO PLAY:</strong></p>\n<p>In the cooking phase, click and drag the ingredients into the pots to follow the recipes on the above tickets. Drag the dishes over the customer who ordered it to serve it. </p>\n<p>After each customer has been served, you have a break where you can gather your thoughts and think about what customer could have made the poison (The ingredients for the poison are listed on the bottom left). You can jot down notes about each customer on the deduction board to the left. Click the bell to go to the next course.</p>\n<p>Repeat the same pattern until you think you know who the murderer is. You can figure this out by looking through their past tickets with your mouse to see what ingredients they have ordered. Once the murderer has enough ingredients for a poison, however, they will start to kill the other customers, and you lose when the murderer has killed everyone but themselves.</p>\n<p>Once you think you know who the murderer is, you can make the poison by cooking the ingredients listed for it and serve it to them.</p>\n<p><strong>Game credits:</strong></p>\n<p>Programming/Tech Art/Design: Walker McDonald</p>\n<p>Programming/Design: Viktor Filipovich</p>\n<p>Art/Design: Mikayla Miklasz</p>\n<p>Art/Design: Baxter Deni</p>\n<p><strong>Outside sources used:</strong></p>\n<p>Song Name: Assai vivace</p>\n<p>Created by Dee Yan-Key</p>\n<p>From freemusicarchive.org</p>\n\n<p>Ding sound effect:</p>\n<p>https://mixkit.co/free-sound-effects/bell/</p>", "metacritic": null, "released": "2022-11-02", "tba": false, "updated": "2022-11-11T15:32:45", "background_image": "https://media.rawg.io/media/screenshots/15e/15e05bf8a0bac638efc796b146ece698.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["kaeyuhhh", "baxterdeni", "Viktor Filipovich", "DWalkerM"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}