{"id": 879413, "slug": "rift-base-07", "name": "Rift Base 07", "name_original": "Rift Base 07", "description": "<p><strong>Intro</strong><br/></p>\n<p>With fossile fuels running lower and lower, the prediction for the 23rd century was grim: there would be war. A final war engulfing the whole planet, for the final drops of oil and the last rocks of uranium. Rift technology saved us from that destiny, at least for the moment. It allowed us to open a bridge to a planet far across the universe: Gamma-3. The good news: this planet is full of promethium; the bad news: it is inhabited. Space bugs are very dangerous and their territorial behaviour threatens our promethium mines. Our only option right now, is to protect the mines for as long as possible. Every ton of promethium mined on Gamma-3 is another day without war for earth.</p>\n<p><strong>Mission instruction</strong><br/></p>\n<p>Welcome Commander, this is Riftbase 7. We have established a temporary Riftbridge to Gamma 3 and are about to begin Promethium extraction. With all likelihood this will provoke increasingly hostile behaviour in the local Fauna. Your task is simple: protect the mining operation for as long as possible. You will have several types of automated security drones for your disposal. The hostile environment will cause constant damage to the drones, so choose wisely when and where to deploy them! Good luck, Commander, humanities future lies in your hands.<br/></p>\n\n<p><strong>Gameplay Instructions<br/></strong></p>\n<ul><li>Click on the units on the bottom of the map to buy them.</li><li>Controll Mines to gain additional Gold</li><li>Defend Mines until there are no waves left</li><li>Violet fields damage your units</li></ul>", "metacritic": null, "released": "2022-11-06", "tba": false, "updated": "2022-11-11T15:07:19", "background_image": "https://media.rawg.io/media/screenshots/ce4/ce4ae77c18046a7aa0b3eb33028d0e27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PartTimeIndie", "Maxhunter007"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}