{"id": 879489, "slug": "the-barker-mustard-files", "name": "The Barker & Mustard Files", "name_original": "The Barker & Mustard Files", "description": "The Barker &amp; Mustard Files\r\n<p>... is a 2D/3D Mystery-Adventure game where you play as a <em>dashingly daring dynamic duo of Dog Detectives</em> by the names of <strong>Harvey Barker</strong> and <strong>Frank Mustard</strong>.</p>\n<p>Point and click your way through the luxurious <strong>Clydesdale Hotel</strong>, meet the multitude of suspicious sweeties and dubious degenerates contained within, and solve a wide variety of puzzles on your journey to unravel the mysterious disappearance of the bashful Beaver, Stuart \"Flappy\" Brown. <br/></p>\n<p>It's a tough gig, being a detective. And it's tougher still when nobody gives you the respect you deserve. Harvey and Frank have been pounding the proverbial pavement for years, doing big-time work for small-time pay, only to get credit snatched away by the (sometimes literal) Vultures at the Scarlet City Police Department.</p>\n<p>But all of that changed when the case of a lifetime fell right into their laps... along with a couple of trigger-happy, gun-toting thugs. But a little bullet-themed office redecoration courtesy of those two-bit toughs wasn't about to scare Harvey Barker and Frank Mustard off the biggest case (and biggest paycheque) they've ever had...</p>\n<p>So grab a good snack, your beverage of choice, and head on down to the Clydesdale Hotel... because it's time to <em>crack this case wide open!</em></p>\r\nFeatures:\r\n<ul><li>Explore the lavish and opulent Clydesdale Hotel!<br/>\n</li><li>Question suspects, collect evidence, dig through the trash!</li><li><strong><em>No</em></strong> pixel hunting! Highlight hotspots on screen with the press of a button!</li><li>Built-in hint system! Ask your partner Frank for ideas!</li><li>Gather clues and information in your Case Files book!</li><li>Call your dirtbag cop buddy to find out more about each Person of Interest you meet!</li><li>Make Critical Choices (one in the demo) that impact the story!</li><li>A beautiful mix of 2D characters and 3D environments!</li></ul>\r\nFollow the Developer for updates!\r\n<ul><li>on Twitter: @yyvgproductions</li><li>website: yyvgproductions.com<br/></li></ul>\n<p><strong>Recommended System Requirements:\r\n</strong>\n</p>\n<ul><li><strong>CPU: </strong>Intel i3-4130 Processor or greater\r\n</li><li><strong>GPU:</strong> NVIDIA GeForce 700 Series or equivalent\r\n</li><li><strong>RAM:</strong> 8GB\r\n</li></ul>\n<p> The game should run on computers with lower-specs, but it's recommended you set the Graphics Quality in the Options menu to \"Good\", if that's the case.</p>", "metacritic": null, "released": "2022-11-01", "tba": false, "updated": "2022-11-11T15:34:51", "background_image": "https://media.rawg.io/media/screenshots/b03/b030449831ea22b1d33d53fb6fab77b8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yes Yes Very Good Productions"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}