{"id": 879569, "slug": "desta-the-memories-between", "name": "Desta: The Memories Between", "name_original": "Desta: The Memories Between", "description": "<p>Desta: The Memories Between is a character-driven rogue-like, featuring an immersive story, strategic turn-based tactics and… a metaphorical ball-game?</p>\n<p>From the creators of Monument Valley, Desta: The Memories Between is a story of broken relationships, words left unsaid and the chance to explore your own dreams for answers.</p>\n<p>EXPLORE UNFOLDING DREAMS<br />\nEvery night, Desta falls into the mysterious dreamworld, filled with shattered remnants of locations past, memories of regret-filled relationships, and powerful orbs that can change the course of conversation<br />\nPLAY A SURREAL BALL GAME<br />\nOvercome tactical challenges with perfect throws, shoot spirited trick shots and land sensational hits in turn-based sports-style encounters. As nights progress, Desta will become more experienced and attuned to this surreal world, discovering new abilities and ways to win<br />\nMEET POWERFUL ALLIES<br />\nBrought to life with a full voice cast, Desta will meet all sorts of interesting and strange characters throughout their journey, all with exceptional abilities and powers, each with their own story to tell about their connection to this world<br />\nINTRODUCTION TO TACTICS<br />\nFrom beginning to end, being approachable is a core value of all ustwo games. Desta: The Memories Between is designed for players of all skill levels to be able to experience the full journey</p>\n<p>This game contains themes of self-reflection, anxiety, mental health, loss of parental figures and gender identity. Player discretion is advised.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-03-28T11:30:38", "background_image": "https://media.rawg.io/media/screenshots/c8d/c8d6a774c645506096b77e4d50b34aef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS", "Android", "Nintendo Switch", "PC"], "developers": ["ustwo games"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["ustwo games"], "esrb_rating": null}