{"id": 879590, "slug": "cosplay-simulator", "name": "Cosplay Simulator", "name_original": "Cosplay Simulator", "description": "<p>This is a gallery simulator with a wealth of costumes and various sex scenes for viewing. The operation is intuitive and simple, there is no long game puzzle solving process, the game can be watched immediately, and it is suitable for players who want to see the ending quickly. , This work is not yet the final version, and new characters and sex scenes will be added one after another to satisfy the rich imagination of players!<br />\n♻This is a derivative work of sword x hime, it can be regarded as an independent version of the gallery♻<br />\nThe H action in the gallery is the same, friends who have purchased the sword x hime game, please consider<br />\nThe difference between this work and the sword x hime version is the addition of multiple characters and a new lighting system<br />\nBody dynamics, cloth and hair dynamics, pantyhose quality, have been enhanced under the new engine<br />\nCompact structure, smaller capacity and faster execution<br />\nStreamlined costumes and monsters to minimize the problem of model interspersed<br />\n♻If you find that you cannot play smoothly after purchase, please apply for a refund immediately♻<br />\nMy major is art, I just learned programming few months, I can&#39;t solve difficult system conflicts, please forgive me (◞‸◟)<br />\nUnder normal circumstances, as long as the graphics card conforms to DirectX 12, Windows10 system, 16GB Ram can run smoothly<br />\nThe stability of the Mac/Linux emulator is unclear</p>", "metacritic": null, "released": "2022-11-10", "tba": false, "updated": "2022-11-16T13:37:11", "background_image": "https://media.rawg.io/media/games/b7c/b7c3bf598d241bc555c015583f555494.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "toplay": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tensun3d"], "genres": ["Action", "RPG", "Indie"], "publishers": ["赤いトンボ"], "esrb_rating": null}