{"id": 879537, "slug": "cauldrons", "name": "Cauldrons", "name_original": "Cauldrons", "description": "\n<p>Aide la sorcière à nettoyer la forêt maléfique, de toutes les horribles créatures d'Halloween qui la peuplent. Une fois cette tache accomplie, le portail des Ténèbres s'ouvrira, et la sorcière pourra rentrer chez elle. Certaines créatures ne peuvent être détruites que par le souffle d'une déflagration. Ça tombe bien, la forêt est truffée de chaudrons explosifs.</p>\n\n<p>Les <strong>touches fléchées</strong> permettent de contrôler le déplacement de la sorcière. La touche <strong>Ctrl </strong>(de gauche) ouvre le grimoire des sortilèges. La sélection de la bestiole à invoquer se fait à l'aide des flèches <strong>gauche et droite</strong> (tout en maintenant la touche <strong>Ctrl</strong> enfoncée). La barre d'<strong>espace</strong> jette le sort sélectionné. <br/></p>\n\n<p>Le développeur, dans son infinie bonté, t'accorde 31 vies pour mener à bien cette mission.  C'est sans doute beaucoup trop, mais que veux-tu, c'est bientôt Noël.</p>\n<p>Si malgré ces explications et cette quantité abondante de vies, tu ne parviens pas à terminer le jeu, il te reste la possibilité infâme et dégradante d'appuyer sur la touche \"L\" (amer). Cela aura pour effet, en plus de t'infliger une honte incommensurable et d'être montré du doigt dans la rue, d'exterminer tous les monstres de la forêt et de téléporter la sorcière au pied du portail des Ténèbres qu'il, si ce n'est pas trop te demander, ne te restera plus qu'à franchir.</p>\n\n<p>Assets graphiques :</p>\n\n<p>Sonorisation :</p>\n\n<p>Framework :</p>\n\n\n\n<p><strong>Vulnérabilité des créatures de la forêt :</strong><br/></p>\n<br/><br/>\n\n<p><strong>Déplacement des chaudrons :</strong><br/></p>\n\n<p><strong>Déclencheurs des chaudrons :</strong><br/></p>\n<br/><br/>", "metacritic": null, "released": "2022-10-29", "tba": false, "updated": "2022-11-11T15:51:19", "background_image": "https://media.rawg.io/media/screenshots/d0e/d0e9367fc38778ddb1092a1277aac605.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gl0bul"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}