{"id": 879661, "slug": "gog-collection-devolver-card-games-2-pack", "name": "GOG Collection - Devolver Card Games 2-pack", "name_original": "GOG Collection - Devolver Card Games 2-pack", "description": "<p>GOG Collection - Devolver Card Games 2-pack<br/> brings you Card Shark and Inscryption for a great price! <br/>Pack available only during the Devolver Weekend Publisher Sale event!</p><br/><br/>\n<br/><br/>\n<br/>\nCard Shark is an adventure game full of cunning, intrigue, and delectable deceit. Enter a world where you’ll need to play your opponents better than you play your cards.LEARN AND MASTER NEW TRICKS\nCheat your way to the top of 18th-century French society. Master deceptions using card marking, false shuffles, deck switching, false deals, and more! Use your ill-gotten gains to buy your way into the closed world of high-stakes tables.<br/><br/>\n<br/>\nFrom the creator of Pony Island and The Hex comes the latest mind melting, self-destructing love letter to video games. Inscryption is an inky black card-based odyssey that blends the deckbuilding roguelike, escape-room style puzzles, and psychological horror into a blood-laced smoothie. Darker still are the secrets inscrybed upon the cards...In Inscryption you will...<ul><li> Acquire a deck of woodland creature cards by draft, surgery, and self mutilation\n<br/>\n</li><li> Unlock the secrets lurking behind the walls of Leshy's cabin\n<br/>\n</li><li> Embark on an unexpected and deeply disturbing odyssey</li></ul>\n<p>In-game features, languages and system requirements may vary between titles. <br/>Please check particular game cards for more precise information.</p>", "metacritic": null, "released": "2022-11-10", "tba": false, "updated": "2022-11-14T04:56:42", "background_image": "https://media.rawg.io/media/screenshots/2bc/2bc6606e576d1a407f9a7685f1cc9b62.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Devolver Digital"], "genres": [], "publishers": ["Devolver Digital"], "esrb_rating": null}