{"id": 879615, "slug": "lovelorn-sanatoriumi", "name": "Lovelorn sanatoriumⅠ", "name_original": "Lovelorn sanatoriumⅠ", "description": "<h3>Join the community</h3>We have now opened the discord community, if you have any questions (￣y▽, ￣)╭, please click the discord link on the right (that is, below the supported language) to join us┏(゜ω ゜)=☞ You can also add our discord in discord channel<br/><br/>Discord：https://discord.gg/t7FMzSwyDx<h3>Game introduction</h3>This is a role-playing game with dynamic comic narration. It enhances the sense of substitution through simple operations and brings you a more intuitive and relaxed story experience.<br/>The story takes place in the \"Mr.Wang\" universe. Players need to play the role of Zhang Ji in the rescue center of the sufferers to rescue the sufferers who are in emotional pain.<br/>The bitter master originally had a lovely girlfriend, but as he accidentally opened his girlfriend's mobile phone, his emotional life also ushered in earth-shaking changes.<br/><br/>What secrets does girlfriend hide? Who is the mysterious fitness trainer? And how should the charactor deal with this feeling? You will follow the perspective of the charactor and reveal the truth step by step.<br/>In this process, you will search for clues in the chat records, investigate and search for evidence on the spot, and finally use your special abilities to solve the problems, and all of this is just the beginning of a huge conspiracy...<br/><h3>Game Features</h3>- \"Lovelorn sanatoriumⅠ\" is a story in the \"Mr.Wang\" universe and the first work in the \"Lovelorn sanatorium\" series. While bringing players a lightweight gaming experience, it also inherits Mr.Wang's unique worldview.<br/>-Light game experience, players will need to complete the mini-game to promote the development of the plot. The process of the game is not long, and players will see a boy entering the self-salvation process of the suffering rescue center in a mocking atmosphere.", "metacritic": null, "released": "2022-11-11", "tba": false, "updated": "2023-07-30T13:57:58", "background_image": "https://media.rawg.io/media/screenshots/e03/e03ea8e475d33c47d3ae9cb330c5f623.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "beaten": 1, "toplay": 1}, "playtime": 3, "achievements_count": 30, "ratings_count": 1, "suggestions_count": 457, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["TUTGame"], "genres": ["RPG", "Simulation"], "publishers": ["DSGame"], "esrb_rating": null}