{"id": 879641, "slug": "she-who-rises", "name": "She Who Rises", "name_original": "She Who Rises", "description": "<h3>PRESENTATION</h3><br/>She Who Rises is an old-school 2D RPG in the style of That Which Was Lost and Last Heroes.<h3>FEATURES</h3><br/><ul><li>Explore a vast world with varied locations and cultures. No town or dungeon looks the same in the world of She Who Rises<br/></li><li>Enjoy a powerful storyline about a girl who has to rise up to become a heroine<br/></li><li>The world holds secrets that you must discover through sidequests<br/></li><li>A huge world to explore at your own will and pace. The open world of She Who Rises is yours for the taking<br/></li><li>A Quest Journal to aid you in your journey<br/></li><li>Mouse Support</li></ul><h3>SUMMARY</h3><br/>Druna is an adventurous girl from Trunkhide. A peaceful tree village, the last village that can be called peaceful. She has lived her whole life training to be the villager's hunter, or so she believed. Soon, she will learn that her fate is something much more grandiose. As the object of the prophecy, it rests upon her shoulders the duty to fight and defeat the Conqueror, the Tyrant King who enslaved all the world under his reign of terror.<br/><br/>So that she can have a normal life, the one she thought she would have, and so that others can enjoy peace, as she always has, she must take on her responsibilities. She is her, she who rises.<br/><br/>MORE GAMES<br/><br/>https://store.steampowered.com/app/1989630/That_Which_Was_Lost/<br/><br/>https://store.steampowered.com/app/1883430/Moonfall/<br/><br/>https://store.steampowered.com/app/1883420/The_Oathkeeper/", "metacritic": null, "released": "2022-11-11", "tba": false, "updated": "2022-11-14T04:26:05", "background_image": "https://media.rawg.io/media/screenshots/e82/e820cf5e9c426391c96f3d34ce7d218e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 329, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Valkyria Games"], "genres": ["RPG"], "publishers": ["Aldorlea Games"], "esrb_rating": null}