{"id": 879685, "slug": "pneuma", "name": "Pneuma", "name_original": "Pneuma", "description": "<p>Pneuma is a first person action, roguelike game with creative mechanics and a unique art style. The player will have to fight their way through ‘dungeons’ using elemental attacks to make their way through to the next level. </p>\n<p>Pneuma focuses on a unique mechanical system which the player must interact with at every turn. The player mechanics are designed so that the player must use a series of elements to defeat their enemies in style. </p>\n\r\nMechanics\r\n<p>Along your journey through the spirit world you will encounter many obstacles on your path, and will need to use your abilities to overpower them. You may encounter and experience:</p>\n<ul><li>A elemental loadout system, to select what you may need across your journey</li><li>The ability to combine your spells together, becoming stronger in the process</li><li>Communicating with those of the realm, buying items and improving upon your spells</li><li>Combating those whos spirits have fallen, corrupted by their will not to pass on </li><li>A narrative, explored through the friends you will meet as they help you on your journey </li></ul>\n\r\nPanda Egg Studios\r\n<p>We are team Panda Egg, a small team of Media Design School students, who have been in development  of this product since the start of 2022. The game was created in Unity Engine, using version 2019.36.</p>\n<p>Panda Egg is comprised of programmers Sebastian Valentine, Rowan Moss and Ayden Lim-Yip; as well as artists Jordan Lusis, Cagaratano Wiharja, Bronwyn Woodhead and Tyler Laing.</p>", "metacritic": null, "released": "2022-11-14", "tba": false, "updated": "2022-11-14T05:05:23", "background_image": "https://media.rawg.io/media/screenshots/9eb/9eb40e96c6bf4b069b3fc8bae60f00e4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Branch CO", "Kitsurione", "Lapsune", "Stv13579", "RowanMoss1", "theoliveman", "aydenlimyip"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}