{"id": 879632, "slug": "cavatus", "name": "Cavatus", "name_original": "Cavatus", "description": "The war against Professor Zor was won, but the price was high.<br/>Technologies were destroyed. Only a few ancient flying machines remain.<br/>Professor Zor might still be alive and start another war. You must prevent that!<br/><br/>You play an experienced pilot who must penetrate a huge, long-forgotten cave system with historical airplanes and airships.<br/><br/>Your fuel is limited and your damage points are low. Equipped only with simple weapons, the mission seems almost hopeless.<br/>Moreover, the constantly increasing level of difficulty and powerful bosses will challenge your flying and weapon skills.<br/><br/>Never touch the cave floor and refuel at airports before you run out of fuel!<br/>Look for machine gun, bomb, protection, and range upgrades. Have them installed by your team at the airport.<br/>Find fuel and shields in order to complete your mission and reach the next airport.<h3>Main features:</h3><br/>The game is a sidescroller in a 3D world with physics calculation. When you fly a turn, the plane does not move in spatial depth.<br/>Nevertheless, the force of gravity is at work as well as the uplift force of the plane, which only occurs from a certain speed.<br/>The planes drift, glide, and crash, too. Depending on whether you accelerate or not.<br/>Depending on your speed when you collide with something, you take more or less damage. A hard landing will damage your plane!<br/><br/>Unlike in the old arcade games, you have an infinite number of lives.<br/>The airports serve as checkpoints and, as soon as you have landed at the specified airport after completing the mission, your game is saved automatically.<br/><br/>An arcade game without points? There is not any! Here, too, you get points for kills, for collected items and when you have completed missions quickly.<br/><br/>In the course of the game, you will use different flying machines.<br/><br/><br/>Biplane: Agile, economical, and lightly armed.<br/><br/><br/>Airship: Slow, can fly backwards and can glide. Armed only with bombs and very vulnerable. Can't land at airports.<br/><br/><br/>Fighter: Fast, thirsty, well-armed.<br/><br/><br/>Bomber: Very heavily armed, thirsty, and very sluggish in flight.<br/><br/><br/>Jet: Very fast, thirsty, well- to very well-armed.", "metacritic": null, "released": "2022-11-11", "tba": false, "updated": "2022-11-14T04:15:10", "background_image": "https://media.rawg.io/media/screenshots/093/093d6ab6a4bcb815901b2c91451f9ed7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Malzbie Games"], "genres": ["Action", "Indie"], "publishers": ["Malzbie Games"], "esrb_rating": null}