{"id": 879620, "slug": "pesticide-2", "name": "PESTICIDE", "name_original": "PESTICIDE", "description": "<h3>PESTICIDE</h3>Another day, another cockroach to squash. Welcome to the city Mr.E !<br/><br/>Prepare yourself for a slay-fest through filthy districts of a desolate cockroach infested town. Roaches rule the streets but not for very long - thugs deserve no mercy ! ! !<br/><br/>Chop them down like a karate master, boil them with acid gun, crack them open with pipes, bats and other useful things, snap, split, tear...hell, use shotguns if you need to but get the job done and get it done fast. clean ' n ' clear !!!<br/><br/><h3>Deadly dust is all you leave behind !</h3>As an elite bug hunter your speed is your primal instinct. Think fast, combo your super speed with wide arsenal of unique bullet-spewing tools and bitch-slap those pesky roaches straight to oblivion.<br/><br/><br/><h3>Show your gentle side</h3>These bugs fear cats more than you, but even cats sometimes need to be rescued. Katty's voice is always calling for your aid and you would be wise to answer it. Who knows, you might get lucky.<br/><br/><br/><h3>Navigate, Evade-icate, Destroy-icate</h3>In a town that needs a hero your presence is pretty much legendary. Pay close attention to those tricky corners, roaches love dark and concealed areas and they don't play fair. Kill them on sight and boast to Katty later. Time crunches hard, be fast or fail faster.<br/><br/><br/><h3>Collect – React</h3>Spoils of hunt are yours for keeping but not before you find them. Unique trinkets await you in this infested town and memories are worth more then some might think...( or was it photos? )<br/><br/><br/>", "metacritic": null, "released": "2022-11-11", "tba": false, "updated": "2022-11-14T03:59:43", "background_image": "https://media.rawg.io/media/screenshots/061/061dbcd9dedb63d54181457cb090d02a.jpg", "website": "https://www.pesticidegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 10, "ratings_count": 0, "suggestions_count": 533, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nuclear Dog team"], "genres": ["Action"], "publishers": ["Nuclear Dog team"], "esrb_rating": null}