{"id": 879835, "slug": "sudoku-desktop", "name": "Sudoku Desktop", "name_original": "Sudoku Desktop", "description": "<p>Have you ever tried playing Sudoku? But what about with 6 different difficulties? Download this game to find out!<br/></p><p>Unlike my other games/projects, this game is available for cross-platform download, an ofc, completely free for download (If you don't know how to, just click \"download\" and click \"No thanks, just take me to the downloads\"</p>\n<p>How to play? Just enter your name, select a difficulty, and hit \"new game\". There is already a built-in number board/keyboard (If you don't see it, click \"Ctrl\" and \"+\" (at the same time), press it again until you see the board/keyboard)</p><p>Additional Features: You Can pause, full screen (click F11), built-in a stopwatch, dark mode, and custom name (NOTE: the light theme and dark theme doesn't automatically changes according to your device's settings)</p><p>What are the 6 difficulties?</p><ul><li>Easy</li><li>Medium</li><li>Hard</li><li>Very hard</li><li>Insane</li><li>Inhuman</li></ul><p>Further instructions: To change the difficulty, click on \"Easy\" (click it multiple times to change to different difficulties) To change the theme, click on the moon/sun icon on the top right, to pause click on the pause icon next to the stopwatch</p>\n<p>The font may be a little bad because it was supposed to be on HTML but I still decided to make it on PC too</p>\n<p>This game is also available on Amazon Apps store (If you can't download Sudoku Mobile on Amazon, just download \"Sudoku Mobile.apk\" for Android 5+)</p>", "metacritic": null, "released": "2022-10-31", "tba": false, "updated": "2022-11-14T06:06:19", "background_image": "https://media.rawg.io/media/screenshots/4ab/4abae33ba1d2745ef324b717d481d5f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["Angelo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}