{"id": 879837, "slug": "comfortress", "name": "COMFORTress", "name_original": "COMFORTress", "description": "Comfortress\r\nA brain power tower defense game!\r\n\n<p>You studied hard for the exam tomorrow. You have everything memorized. All you need is a good nights sleep to have a functioning brain.</p>\n<p>The problem is: You visited a friend in his dormitory - there is no train back today - and the whole floor wants to party tonight!!</p>\n<p>---</p>\n<p>Find a place to sleep in other people's rooms - but beware: Once you sleep, the people will be missing you at the party and will come looking for you.</p>\n<p>To get more sleep, find out the dorm residents' preferred items by visiting their rooms. Then, gather those items in the dorms' rooms and place them in the corridors to distract the resident of the room you're sleeping in from taking the shortest path from the party to you!</p>\n<p>---</p>\n<p>Once the party people find you, the party will move to your current room and you have to find another place to sleep. <br/></p>\n<p><strong>There are items that will increase comfort while sleeping. Place them into the room where you wanna take a nap.</strong><br/></p>\n<p>Items will be shuffled every time you can escape the party again. Also, some people will close their doors and leave them open randomly.</p>\n<p>Look out for the time: Each step brings you closer to 8:00 AM, so plan ahead! Gather as much brain power during the night as possible to score a good grade!<br/></p>\n<p>CONTROLS</p>\r\n\r\nMovement WASD and arrow keysD-Pad or Left-StickTake item from a room or switch your current item with it[1], [2], [3](Y), (X), (A)\r\nPlace items on the corridor[1](Y)\r\nGo to sleep once you are satisfied with the item placement[Z](B)\r\n\r\n<p>Have fun playing!</p>\n<p>Comfortress has been brought to you by ClockTowerBass in 50h, with the Jam's theme being \"Finding Comfort\" and participants being:</p>\n<p>Cariem El Wakil (Programming, Artwork)</p>\n<p>Hannes Thalheim (Programming, Artwork, UI)</p>\n<p>Marcel Winter (Programming, Artwork)</p>\n<p>Yves Annanias (Programming)</p>", "metacritic": null, "released": "2022-11-13", "tba": false, "updated": "2022-11-14T06:07:02", "background_image": "https://media.rawg.io/media/screenshots/c97/c970dbf8dc0a7bda2b29dc66765c0286.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["imhanner", "ClockTowerBass", "broccolisenpai", "Patroscon"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}