{"id": 879956, "slug": "boule-maniac-vr", "name": "Boule Maniac VR", "name_original": "Boule Maniac VR", "description": "Summary:\r\n<p>You are a lost soul in a dwarfen world. The gamemaster invites you to play a game of Boule Ball using VR Interactions. 6 Balls. 1 Target. The player closest to the target wins the round. Who knows what happens to the other players.</p>\n<p>Each round you get the chance to destroy the game with two of the chaotic special balls. Choose wisely.<br/><br/>- Slime Ball<br/>- Tower Ball<br/>- Big Ball<br/>- Explosion Ball<br/>- Gravity Ball</p>\r\nSomeone regretting their choice of the tower?\r\nFeatures:\r\n<p>- VR Player<br/>- Simulated VR Player (for PC Users!)<br/>- Coop up to 4 Players<br/></p>\n\r\nHow to play?\r\n<p>The game supports VR and a simple non-VR Player mode.</p>\n<p>Select accordingly in the Main Menu.</p>\n\n<p>For VR Users the experience can be different.<br/>Some glasses require you to start SteamVR before joining a lobby.</p>\n<p>The VR only connects once you find an active Lobby or Host a game yourself. Before that you have to use the ingame Menu.</p>\n<p>The project was the result of a 2 week game jam challenging ourself to make a VR Game in a short timeframe. We had some fun with the experience and wanted to share!<br/></p>\r\nWho are we?\r\n<p>A pair of experienced Computer Scientists turned rogue.<br/>Proudcake and Arikae. Whatever Games.</p>\n<p>We play games and break games creating a lot of fun memories, and would like to use our coding abilities to bring these kind of memories to our players.<br/></p>\n<p>We worked on multiple small projects in our spare time so far. This is our first released demo. Our ambition is creating fun gameplay experiences.</p>\n<p>Keep watch for our next project: A co-op hack and slash dungeon builder game!<br/></p>\n<p>Contact us:</p>\n<p>We'd like to hear your feedback. Maybe hop into a game together. :)<br/></p>\n<p>https://discord.gg/5g7gznaG<br/></p>", "metacritic": null, "released": "2022-11-13", "tba": false, "updated": "2022-11-14T06:57:07", "background_image": "https://media.rawg.io/media/screenshots/f07/f07d64f648b6abb7dd91a3d9acb6849f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bankreis"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}