{"id": 879966, "slug": "witch-in-the-thicket", "name": "Witch in the Thicket", "name_original": "Witch in the Thicket", "description": "<p><em>“This town is situated in the Appalachia, and laurel hells are these spots here where the mountain laurel grows in such dense thickets that if you get trapped, you can’t get out. The flowers just suffocate you.\" He pauses for a moment, and you realize these are the most consecutive words Jun has said to you. \"Anyway, you accidentally made a pun.\"  </em>\n</p>\n<p>You’re a witch on the verge of being disowned from your powerful family. Your last chance to prove you can run the family business is to take on a job no one in the coven wants: aiding a small town in the American Northeast that is <em>super</em> into halloween.\r\n</p>\r\nWitch in the Thicket is a modern-day fantasy interactive fiction game in development. I’m Rose: longtime writer, first-time coder. I plan for this to be a small-scale project, ~5 chapters maybe, but I hope to add more coded features as the story progresses and I learn more!\r\n<p><strong>Features</strong></p>\n<ul><li>Play as a semi-customizable MC: choose your witch’s first name, your appearance, your gender identity (m/f/nb) and grow your personality as the story progresses. \r\n</li><li>What did your witch do that was the final straw for your family? How do you feel about it in the aftermath? Are you remorseful? Indignant? Indifferent? \r\n</li><li>Travel with your familiar! A classic black cat? An elegant borzoi? A raven for dramatic effect? \r\n</li><li>Explore the town of Laurel Thicket, Connecticut. A lovely place to most people, just not your witch. \r\n</li><li>Get to know the townsfolk as you work to uncover the mystery of a series of inexplicably strange occurrences…\r\n</li><li>Romance one of three characters, each of whom find you varying degrees of charming. \r\n</li><li>Enjoy elements of slice-of-life, magical realism, fantasy, and (<em>I</em> think) comedy. </li></ul>\n<p><strong>Characters</strong></p>\n<ul><li>Elias Rosen: He/Him. 23.  <em>Jaded, sarcastic, aloof.</em> University dropout living with his moms, one of whom is the mayor. Unclear how he holds a job. beyond being charming Why does he never button the top three shirt buttons?\r\n</li><li>Jun Hwang: He/Him. 27. <em>Guarded, romantic, tired.</em> Returned to town to help his family’s flower shop/farm. To the government he’s Juniper and Jun-seok, but please just call him Jun. Pretty heavily tattooed for a guy with a stick up his ass. \r\n</li><li>Faye Latifi: She/Her. 25. <em>Passionate, introspective, stuck.</em> Studied at the nearby college for a semester, returned for the season to finish a painting she started. <em>She doesn’t have an art block so why are you asking?</em> The kind of cool person cool people hang around to look cooler. </li></ul>\n<p>If you enjoy the game, leave a review or send me a message on tumblr! If you come across any bugs, you can let me know over there as well. https://www.tumblr.com/laurelthicket</p>", "metacritic": null, "released": "2022-11-13", "tba": false, "updated": "2022-11-14T07:00:41", "background_image": "https://media.rawg.io/media/screenshots/2a2/2a2431b32f5a76c523aae577f184d0bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["laurelthicket"], "genres": [], "publishers": [], "esrb_rating": null}