{"id": 87990, "slug": "golf-tour-golf-game", "name": "Golf Tour - Golf Game", "name_original": "Golf Tour - Golf Game", "description": "Meet Golf Tour Free, the top free golf simulator game for iOS! Enjoy over forty unique courses with realistic gameplay and crisp 3D graphics. Golf Tour Free allows you to customize your golfer's appearance as well as club set, and with multiple tees and pin locations no round will be the same. Challenge yourself and your friends with online leader boards, or play with up to four players on a single device. Other great features include adjustable seasons, different tee times, multiple difficulty modes, mulligans, shot shaping, match/stroke play, and more.<br/><br/>*New Game Center Multiplayer Support* - Play against your friends or a random opponent on any of your favorite courses. Golfers alternate every three hole until a winner is crowed after all 18 holes are finished.<br/><br/>Golf Tour Free requires coins to play, which are generated each day or purchased through in-app purchase.<br/><br/>If you like GL Golf, make sure to check out Nuclear Nova’s other games, all available for the Mac/iPhone/iPad/iPod.<br/><br/>• Nova Golf, the successor to GL Golf, is a much more detailed golf simulator with more modern graphics<br/><br/>• Pinball Shuffle and Pinball Massacre are two unique comic book arcade style pinball tables<br/><br/>• Barnyard Blaster is a unique shooter with plenty of weapons, animals, and environments<br/><br/>• Rocket Golf gives golf a new twist with its unique 2D side scrolling gameplay<br/><br/>• Liquid Defense, Hydrothermal, and Escape are our three classic puzzle/simulator games<br/><br/>• Fractal 3D and ASCII Art are our first non-game apps<br/><br/>Play now on your iPhone, iPod, and iPad!", "metacritic": null, "released": "2013-07-19", "tba": false, "updated": "2019-07-30T14:31:42", "background_image": "https://media.rawg.io/media/screenshots/9ab/9ab965e1fed761037827abf938df5a03.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 122, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nuclear Nova Software"], "genres": ["Simulation", "Sports"], "publishers": ["Jacob Leveto"], "esrb_rating": "Everyone 10+"}