{"id": 880255, "slug": "cheesus-christ-reborn-ii", "name": "Cheesus Christ: Reborn II", "name_original": "Cheesus Christ: Reborn II", "description": "Cheesus Christ: Reborn II\r\n<p>I'm gonna level with you. This is basically a <strong>shitpost </strong>of a game that I made in just four hours as a birthday present for a friend. It's a silly game. Will you enjoy it? <strong>Maybe.</strong> Is it the next Titanfall or Portal? <strong>Absolutely not. </strong>If you want to just spend some time playing a silly little game for like under an hour then absolutely <strong>go for it</strong>. If not then go try out some other game or some of my actual games, either the ones on my itch.io profile or <strong>Craterbound </strong>on Steam. Regardless, <strong>have a great day</strong>!</p>\n\r\nBackground\r\n<p>You play as a random person who is locked in a room with evil sentient floating cheese monsters. You are armed with a single sword and your objective is to survive to Wave 100. If you survive that far you will win the game. Anything short of that and you're a loser, plain and simple. Comment below your top scores and if you won or not.</p>\n\r\nControls and Disclaimer\r\n<p>Movement: WASD</p>\n<p>Main Attack: Left Click</p>\n<p>Grenade Attack: Right Click</p>\n<p>That's it. You can also left click on menus obviously.</p>\n\n<p>The leaderboard system does not super work. This game was made in four hours so if you find any bugs don't bother commenting them, I don't really care. I am writing this at 2 AM if you can't tell. Just try to enjoy the game for what it is!</p>", "metacritic": null, "released": "2022-11-13", "tba": false, "updated": "2022-11-14T09:07:20", "background_image": "https://media.rawg.io/media/screenshots/125/12591e4773b1e089b524940f4e436e21.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 43, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Dan"], "genres": [], "publishers": [], "esrb_rating": null}