{"id": 88059, "slug": "gutterball-golden-pin-bowling", "name": "Gutterball - Golden Pin Bowling", "name_original": "Gutterball - Golden Pin Bowling", "description": "☆Update Alert! 1.1.9 with in-app purchasing to collect more pins and breeze your way to more alleys, balls and power-ups.☆<br/><br/>☆☆☆ Also available for iPad &amp; iPhone ☆☆☆<br/><br/>Gutterball - Golden Pin Bowling is a bowling game far superior to any other.  With a commitment to quality of play, physics and extra features, the Gutterball brand continues to exceed the expectations of gaming enthusiasts the World over.<br/><br/>GUTTERBALL BOWLING HIGHLIGHTS:<br/>☆ A true bowling game with dazzling graphics and realistic pin physics<br/>☆ Clean &amp; crisp throwing action lets you spin your bowling ball like a pro<br/>☆ Golden Pins reward you for bowling well, and get you new bowling gear<br/>☆ Awesome Power Ups, including a BOMB, a SPLITTER, and a INFLATOR!<br/><br/>FEATURES:<br/>☆ Incredible bowling alleys and fantastical bowling balls<br/>☆ Funny commentators who voice their opinion on every bowling throw<br/>☆ House, Style and Effect bowling balls to unlock, each more awesome than the last<br/>☆ Spinning the ball can earn up to 3x multiplier for Golden Pins<br/>☆ High Scores and 40 bowling achievements<br/><br/>INCLUDED IN THE FULL VERSION:<br/>☆ 3 Additional Bowling Alleys - Mineshaft Lane, Pumpkin Fields and Cosmic Alley<br/>☆ 5 Colorful Bowling Commentators<br/>☆ Includes 500 Golden Pins<br/><br/>HISTORY:<br/>The original Gutterball 3D bowling game premiered in 2002. It reached #1 on many portals and stayed in Real Arcade's Top 10 for an unprecedented 54 weeks. Gutterball 2 arrived in 2004 with all-new crazy bowling alley designs, improved grahics and physics, and new features galore. Now, Gutterball: Golden Pin Bowling is all-new and ready to go! We think it's the finest bowling game on the App Store and we've played them all.<br/><br/>You be the judge... is this Gutterball the best bowling game ever?", "metacritic": null, "released": "2011-10-25", "tba": false, "updated": "2019-10-22T14:20:58", "background_image": "https://media.rawg.io/media/screenshots/e61/e61f87fe3290ddff0c5c920816a00409.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Skunk Studios"], "genres": ["Action", "Sports", "Family"], "publishers": ["Skunk Studios"], "esrb_rating": "Everyone 10+"}