{"id": 880690, "slug": "supremenerd-originals-archive", "name": "SupremeNerd originals archive", "name_original": "SupremeNerd originals archive", "description": "<p>Some old games from around 2016-18 when I used an Gamejolt account called the \"Supreme Nerd\". The account was deleted due to frustration with game development, bad luck getting noticed and general inexperience. </p>\n<p>This part of the SupremeNerd archives contains 2 original games that were not released to the public before.</p>\n<p><strong>1. Ghost Town</strong></p>\n<p>A comedic 2d platformer where you get lost in a haunted town themed after Spanish-Galician rural areas. Each level requires finding all the collectibles to unlock the exit. You play as a kid(?) with a pet spider and a trash can lid that can be used a s a boomberang or as a shield to deflect some projectiles. Later levels introduce 2 additional playable characters with unique mechanics each.</p>\n<p><strong>2. Squirtgeddon</strong></p>\n<p>A top-down bullet hell where you pilot a mech that fights robots with water guns. The main story section has several gamedesign issues that I'm unable to fix due to the project files being either missing or corrupted. The challenge section lets you play against randomly generated bosses.</p>\n\n<p><strong>Special thanks:\r\n</strong>\n<em>obscuritySTA</em> : main character design for <em>Ghost Town.</em><br/></p>\n<p>Several assets from both games were edited and resused for a remaster of another SupremeNerd game I manage to fully recover:<br/></p>", "metacritic": null, "released": "2022-11-11", "tba": false, "updated": "2022-11-14T12:10:33", "background_image": "https://media.rawg.io/media/screenshots/ba9/ba98765d505dec245a4ceecae8674a5c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ApeHardware"], "genres": ["Action", "Adventure", "Platformer"], "publishers": [], "esrb_rating": null}