{"id": 88062, "slug": "fox-brick-breaker-candy-shooter", "name": "Fox Brick Breaker: Candy Shooter", "name_original": "Fox Brick Breaker: Candy Shooter", "description": "Simple brick breaking game! Shooting balls crushing square blocks! Addicting game for girls and boys! Candy cute pet fox ice world exploration for free! 111% ballzy bubble fun!<br/><br/>New bubble ball brick breaker<br/>Old school fun with new ballzy game! Catch the balls and shoot! Exploration lite of cute pet fox world and shooting circling bricks! Swipe finger, throw ballz and hit colorful candy blocks to crush them in this free ball shooter game! Like a billard! Relax, but be quick! Don’t let square cube blocky bricks to tighten you up! One more ball shooting for the win! 111% survival! Cute pet fox needs to catch the balls and save his blocky cube ice floe! Simple, yet addicting game to play. One of the best time killer ball brick breaker! Arcade sandbox fun for girls and boys! Super old school turn-based breakout!<br/><br/>Endless levels of crushing candy blocks <br/>Epic arcade ballz shooting saga continues! Classic gameplay in new crafting cube blocky style! Shoot balls before it’s too late! Break cube blocks and collect new ballz, so you can break bricks faster! Craft an endless chain of ballz! Swipe faster or relax and tap swipe with ease. Aim at fancy colorful blocky bubble cubes! Simple brick breaking exploration. Fancy cute balls break brick really fast! Shoot &amp; craft one more win! Ballzy, billard like sandbox experience for boys and girls. Exploration lite of blocky bricks world! Best free classic arcade breakout game! Extreme fun swipe breaker!<br/><br/>Fancy brick breaking with cute pet fox<br/>Experience ball shooting like never before! Simple gameplay - like a billard! Fancy candy colorful blocks must break! Tap swipe to sides to shoot from different angles. Reach every brick on each of endless sandbox game levels! Bubble shooter for boys and girls, for kids and family, with lite exploration! 111% royal balls arcade fun! Break bricks and relax! Lost? Catch the balls and bounce back! Try again shooting square blocks! Addicting game to play for free for you and your crush! Top girls and boys!<br/><br/>CORE FEATURES:<br/>Classic, ballzy gameplay!<br/>Cute pet fox!<br/>Shooting balls to destroy square blocky cube bricks.<br/>Fancy brick breaking powerups!<br/>Simple, yet addicting arcade experience!<br/>Free to play!<br/><br/>UPCOMING FEATURES:<br/>Multiplayer mode!<br/>Co-op mode!<br/>Bubble shooter mode!<br/>Survival mode!<br/>More fancy ballz!<br/>More types of square cube blocky bricks.<br/>More block breaking powerups.", "metacritic": null, "released": "2017-05-30", "tba": false, "updated": "2019-07-30T16:05:18", "background_image": "https://media.rawg.io/media/screenshots/777/777a111587cd76ea505f6d4394250236.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 76, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Arcade", "Casual", "Puzzle"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}