{"id": 88089, "slug": "afl-gold-edition", "name": "AFL: Gold Edition", "name_original": "AFL: Gold Edition", "description": "INTENSE AFL ACTION- The ultimate iPhone &amp; iPad AFL experience! <br/><br/>Updated with AFL 2012 Season Fixture, Skoda Stadium, Game Center integration, Facebook integration, Twitter integration, instant replays and iPad 3 retina display support. <br/><br/>*Supports iPad, iPad 2, iPad 3, iPhone 4S, iPhone 4, iPhone 3GS, iPod Touch 4th Gen and iPod Touch 3rd Gen. <br/><br/>*Requires iOS Firmware 4.3 or later. <br/><br/>Live all the emotion and adrenaline with the AFL Gold Edition, brought to you by Tru Blu Entertainment and Wicked Witch Software – featuring Quick Match, Custom Match, Career Manager &amp; Competition Modes.<br/><br/>Realism takes over as you’re propelled into the on-field game play through advanced graphics, animations and sound. Take to the field with a selection of 4 different leagues and over 50 teams, including unlockable BONUS teams. With so many customisable options, you’re on your way to playing your ultimate AFL game, just the way you like it.<br/><br/>✫QUICK MATCH✫<br/>The best way to throw yourself into the action. For a quick fix of some AFL fever – choose your teams and immerse yourself in some fast paced gaming as you battle it out on field!<br/><br/>✫CUSTOM MATCH✫<br/>Create your favourite games of AFL – customise game length, weather, time of day, stadium, crowd, guernsey and other conditions for your ideal AFL match!<br/><br/>✫CAREER MANAGER✫<br/>Don’t just use your skill, but use your strategy too! Begin your career playing in the TAC Cup or the VFL, managing the team. Work your way up into the AFL league and achieve premiership glory! You will need to coach your team through training, handle any injuries and the tribunal if they come your way. Step into your management shoes as you control staffing, finances, contracts, sponsorships, draft picks, 2 and 3 way trades and much, much more!<br/><br/>✫COMPETITION✫<br/>Play for hours as your favorite team and annihilate the opposition on your quest to win the competitions! Play in any of the 4 leagues for up to one year with a variety of options! Competition features include the team line up, fixtures, ladder and player stats. <br/><br/>✫FULL 3D✫<br/>Features full 3D player creator, stadia, goals, ball and players with motion captured animations that create impressive and realistic visuals. Combined with stylish camera transitions and smooth effects you will be catapulted right into the action! <br/><br/><br/><br/>✫FEATURES✫<br/><br/>✔An incredibly realistic AFL experience with quality graphics &amp; sound<br/>✔Multiple game modes: <br/>-- Quick Match, Custom Match, Career Manager and Competition Mode<br/>✔Multiple game settings:<br/>-- Customise weather conditions, crowd size, slow motion, sound effects and more to your personal preferences!<br/>✔Over 50 licensed teams from the AFL, VFL and Under 18’s competitions, plus 8 unlockable bonus teams <br/>✔Expert commentary by Dennis Cometti and Brian Taylor<br/>✔Player creator and multiple game profiles<br/>✔Gameplay features:<br/>--Mini Contests, specky’s, smothers, handballs, kicks, hip and shoulder, evade and tackles<br/>✔Ten year Career Manager Mode<br/>✔Broadcast style presentation<br/>✔Great music and authentic club songs, full range of sound effects<br/>✔Customise Players &amp; Teams<br/>✔Achievements- Challenge yourself and unlock bonus teams and guernseys<br/>✔Play in ‘Big Head Mode’ – unlockable feature<br/>✔Impact zoom – see your best moments close up<br/>✔Develop your skills on ‘Easy’, or challenge yourself in ‘Legend’ mode <br/>✔Easy to learn, difficult to master, incredibly addictive! <br/>✔A selection of true to life 3D stadiums from around Australia<br/>✔Factor in real-life changing wind modelling conditions in your game play<br/>✔Fully animated 3D motion captured players<br/>✔Dynamic camera angles<br/>✔Intuitive virtual controls<br/>✔Improved ball bounce<br/><br/><br/>☆FIND US☆<br/>-- www.trublu.com.au<br/>☆FOLLOW US☆<br/>-- www.twitter.com/trublugames<br/>☆LIKE US☆<br/>-- www.facebook.com/trublugames", "metacritic": null, "released": "2011-12-14", "tba": false, "updated": "2019-10-22T14:20:59", "background_image": "https://media.rawg.io/media/screenshots/e0d/e0d9f273ff54c8e823e0be6c785a05b5_BVybOfG.jpg", "website": "http://www.trublu.com.au", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Home Entertainment Suppliers"], "genres": ["Action", "Sports"], "publishers": ["Home Entertainment Suppliers"], "esrb_rating": "Everyone 10+"}