{"id": 88086, "slug": "jonah-lomu-rugby-challenge-mini-games", "name": "Jonah Lomu Rugby Challenge: Mini Games", "name_original": "Jonah Lomu Rugby Challenge: Mini Games", "description": "HEAPS OF FUN! <br/>The ultimate iPhone &amp; iPad rugby experience! <br/>Tru Blu Entertainment and Wicked Witch Software present Jonah Lomu Rugby Challenge: Mini Games edition. This is the first version of a mini game collection designed for quick play and on the go fun, starring Rugby legend: Jonah Lomu! <br/><br/><br/> STARRING JONAH LOMU!  <br/><br/>The only app to exclusively feature Jonah Lomu! Play as the great Rugby legend in all of the mini games … and play in the shoes of a Rugby superstar! <br/><br/>TWO GAMES IN ONE! <br/>Offers not one, but two addictive mini games for double the action and fun! With ongoing support and updates you will have a load of Rugby fun at your finger tips forever! <br/><br/>CONVERSION FLICK GAME <br/>Feel the excitement as you line up for that record breaking goal. The angle is sharp and the wind is high, have you got the strategy and skill to make the final conversion goals? <br/> <br/>TRY ZONE SWIPE GAME <br/>Feel the adrenalin pump as you charge down the field, as opposition players chase, flank and tackle you head on in a desperate attempt to bring you down before the try line in this exciting, fast paced evasion game. <br/><br/>BOTH MINIGAMES CONTAIN MULTIPLE GAME MODES:<br/>--  Competition – Kick conversions or attempt to put the ball down in the try zone: 3 strikes and you’re out!<br/>--  Endurance – You are given more chances: 5 strikes and you’re out!<br/>--  Last Chance – The ideal mode for a challenge: In this mode there are no second chances. <br/>--  Count Down - A race against the clock: Get the most conversions or tries in the 2 minutes available.<br/>--  Bonus Time – A fast paced mode of precision: You don’t have much time in this mode, but scoring will grab you bonus seconds. So you will want to be quick. <br/><br/>FULL 3D! <br/>Features full 3D stadium, goals, ball and players with motion captured animations that create impressive and realistic visuals. Combined with stylish camera transitions and smooth effects you will be catapulted right into the action! <br/><br/>FEATURES <br/>-- Multiple mini game modes: <br/>--Conversion Flick Game <br/>--Try Zone Swipe Game<br/>-- Featuring Rugby Icon Jonah Lomu <br/>-- Easy to learn, difficult to master, incredibly addictive! <br/>-- Life like animation <br/>-- Realistic ball physics <br/>-- True to life 3D stadium <br/>-- An incredibly realistic rugby experience with quality graphics &amp; sound. <br/>-- Practice and develop your kicking technique, with dynamic wind conditions. <br/>-- Fully animated 3D motion captured players <br/>-- Dynamic camera angles <br/>-- Intuitive touch controls <br/>-- Increasing levels of difficulty <br/>-- Saved high scores <br/>-- Online leaderboard – flaunt your achievements and see how you rank against players from across the world <br/>-- Facebook integration – compete with your friends to get the highest score and post brags to your wall<br/><br/>FIND US:<br/>-www.rugbychallengegame.com/<br/>FOLLOW US:<br/>-www.twitter.com/rugby_challenge<br/>LIKE US:<br/>-www.facebook.com/RugbyChallengeGame", "metacritic": null, "released": "2011-12-08", "tba": false, "updated": "2019-10-22T14:20:59", "background_image": "https://media.rawg.io/media/screenshots/396/396939d150f456058cb2a9ce7013bd21.jpg", "website": "http://rugbychallengegame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 8, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Home Entertainment Suppliers"], "genres": ["Action", "Sports"], "publishers": ["Home Entertainment Suppliers"], "esrb_rating": null}