{"id": 88096, "slug": "extreme-desert-fury-in-commando-game", "name": "Extreme Desert Fury in Commando Game", "name_original": "Extreme Desert Fury in Commando Game", "description": "Extreme Desert Fury Attack<br/>Welcome to the world of shooting games adventure with advanced weaponry. Experience the joy of first person fighter game in modern arena. The game is based on realistic strike missions and action packed military operations. You are here to play the top amazing game for your own army and become the perfect sharp shooter in the camps of enemy. But wait the enemy military is also equipped with the best advanced guns, helicopters, AK47 and so many assault rifles that can be a big threat to our nation and you have to fight in order to eliminate this threat.<br/><br/>Lead Your Military<br/>As a bravo commando, show no relax and shoot the dream of each terrorist and end the terror of your country. Use your exact shooting skills and try to get the maximum of the kills. If you can get a sniper shoot, you will kill the enemy directly, and aim to shoot her to kill them without being shot and keep your ammo with you. Take the lead to destroy the terrorist. Defend yourself through a tactical strategy and you can fight enemies in several classic battle maps. Such as snow, desert and the city's playground. The game also gives you a realistic combat environment, full of fierce battle scenes and very smooth control interface. Now download these fantastic FPS shooters and experience shooting in different adventures. Do not show any mercy and deadly attack against brutal terrorist enemies and take fun with the hot shooting for several missions.<br/><br/>Get Position For Attack<br/>Your deadly enemy battalion soldiers will move in a planned way and assassinate everyone that come on their way. But you have to hold your nerves, save the victims, rescue the causalities and drop them to the safe place. You might have played other survival shooting games but the game we are presenting in 2017 is not just a game, it is actually a feeling that comes the heart of every bravo commando to fight for the country and be martyred for the noble cause.<br/><br/>Invade Army Camps<br/>According to your chief orders, you have to do an invasion in military camps. Army gunship helicopter and military cargo vehicle tanks will also provide a backup for assassin missions. This is not just a war, it is actually a fight between two nations top overcome their holy lands. Unleash your inner commando skills and prove that you are a real loyal and passionate soldier.<br/><br/>Extreme Shooting Adventure<br/>You are the real commando left in the battle field and other bravo soldiers are also on the front-line of your mission. Hold the breathe and take your time to pull the trigger of your sniper rifle because once you shoot with your machine gun, there will a complete chaos in the camps of enemy and will be a big trouble of us. The FPS game will provide you the best fun with commando action games. <br/><br/>Precise and Sharp Shooting<br/>The enemy military camps are actually a big hide for terrorist soldiers. You commander in chief has the best capability to fight and assassin elite commandos. Forget about defeat and fight as a hero on real grounds for your nation. Kill those soldiers that are taking a camouflage in the bushes of jungle. Kill them all, don’t wait for them to attack on you. Head-shots are a quite good idea to survive and eliminate them quickly.<br/><br/>Breath Taking Missions<br/>There are a total of ten breath taking missions with the availability of latest sharp weapons for advanced sniper shooting. The environment is really friendly and controls are smooth too. Kill all the crazy soldiers in army stronghold and rescue the civilians there.", "metacritic": null, "released": "2017-04-24", "tba": false, "updated": "2019-10-22T14:20:59", "background_image": "https://media.rawg.io/media/screenshots/5ce/5cee62f43c3a8b07a508e2bd789f7487.jpg", "website": "https://www.facebook.com/plasmagame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 168, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayyab Mahmood"], "genres": ["Action", "Simulation"], "publishers": ["Tayyab Mahmood"], "esrb_rating": "Mature"}