{"id": 881183, "slug": "terracotta-2", "name": "TERRACOTTA", "name_original": "TERRACOTTA", "description": "You are one of eight thousand warriors bound to protect the Emperor in his afterlife. Your comrades are not your enemies, even if they seem to think so at the moment.<br/><br/><ul><li>Work your way through more than 80 levels across the elemental paths using mind and body to overcome puzzling obstacles and challenges.<br/></li><li>Awaken ancient mechanisms and descend into the underworld, overcoming foes through speed and agility, instead of only using brute force.<br/></li><li>Defeat 8 brutal bosses, requiring the mastery of the nine phases of Qi: The universal energy that forms all parts of living beings.</li></ul><br/><br/><br/><br/>As the sole uncursed warrior of the emperor's Terracotta Army, you'll have to master your ability to channel the Tao, switching between the realms of Yin and Yang to free your fellow soldiers from the spiritual blight.<br/><br/><ul><li>Shift between the realms of Yin and Yang, within the tomb of the  Emperor and his afterlife, looping between death and the afterlife to overcome cursed challenges.<br/></li><li>Yin is the domain of solitude and tranquility. The dark, desolate tomb is a fortress, where you can strategize, prepare, and alter the layout to aid your journey.<br/></li><li>Yang is the realm of the afterlife, light, and action. Execute combat strategies, evade foes, and overcome the tomb’s defenders to find the source of the curse placed upon the rest of the terracotta.</li></ul><br/><br/>The Qin dynasty laid the foundations of China that would endure two thousand years. As an awakened terracotta warrior, you have the opportunity to observe it from within.<br/><br/><ul><li>Experience an art style based on the timeless aesthetics of guo hua, traditional Chinese painting.<br/></li><li>Immerse yourself in the afterlife of the Terracotta Army with a soundtrack inspired by traditional instruments classified through the ancient Chinese ba yin.<br/></li><li>Save your fellow eight thousand strong warriors, each with iconic individual appearances - just like the real Terracotta Army!</li></ul><br/>TERRACOTTA is a project funded by Red.es and the European Regional Development Fund (ERDF) through the Red.es Program to promote the videogame industry. These grants are co-funded by the Spanish ERDF Pluri-Regional Operative Program (POPE) 2014-2020.<br/><br/>", "metacritic": null, "released": "2022-11-13", "tba": false, "updated": "2023-08-21T16:06:15", "background_image": "https://media.rawg.io/media/screenshots/5b8/5b8aaa2bd7378359f6135b4d46048e69.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 15, "toplay": 3}, "playtime": 0, "achievements_count": 33, "ratings_count": 1, "suggestions_count": 258, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Appnormals Team"], "genres": ["Adventure", "Indie"], "publishers": ["Freedom Games", "plusDSgames"], "esrb_rating": null}