{"id": 881180, "slug": "arcane-waters", "name": "Arcane Waters", "name_original": "Arcane Waters", "description": "Arcane Waters is an online pixel RPG, featuring trading, exploration, combat, and farming. On your own, or with friends, explore handcrafted sea and land maps, sail to visit remote towns to trade goods, hunt for treasure in dangerous waters and lands filled with monsters, or play against other pirates in PvP sea battles. In the meantime, tend your farm to grow crops, buy and upgrade your fleet of ships, and craft items to use or sell.<h3>FIGHT </h3>When you leave the safety of your farm, you'll have to fight to survive! On the high seas, fight tense real-time cannon-blasting battles against pirates and huge monsters. On land, take part in thrilling active-time fights with strange creatures to reveal hidden treasures. You’ll need your wits about you!<br/><h3>FARM </h3>Starting with a humble farm, plant seeds, water them and pick your crops. Eventually you will unlock other farms to increase your yield and diversify your produce.<br/><h3>Explore </h3>A vast open world awaits you or your team as you sail to distant lands.  Explore multiple different biomes, each with their own unique towns, valuable goods for sale and dangerous monsters, to complete quests and help each other level up.<br/><h3>TRADE </h3>Whether you grow your own food, or buy it from traders, you will need to find the best price to sell and make a profit. This will mean sailing far from home to discover new continents and towns where your goods are highly sought after.<br/><h3>CRAFT </h3>Use items dropped by enemies or sold at stores to make your own weapons and armor, and either use them yourself or sell them on the public Auction for a profit!<h3>LEVEL UP</h3>Stay neutral to avoid being attacked by other players, or join a guild to help fight for your place in the world. Level up by completing quests, finding new locations, and utilizing your skills. Use Perk points to increase stats based on your chosen specialties, and use your hard-earned gold to buy new equipment to help you progress even faster.<br/>", "metacritic": null, "released": "2022-11-14", "tba": false, "updated": "2023-02-07T02:00:35", "background_image": "https://media.rawg.io/media/screenshots/82a/82a6b1a7ff9b8fdf468cea03a333c434.jpg", "website": "http://www.arcanewaters.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 3, "achievements_count": 95, "ratings_count": 1, "suggestions_count": 379, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Black Mammoth Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Grey Havens"], "esrb_rating": null}