{"id": 881136, "slug": "curse-of-the-sea-rats", "name": "Curse of the Sea Rats", "name_original": "Curse of the Sea Rats", "description": "<p>Curse of the Sea Rats is a ‘ratoidvania’ platform adventure with lovingly crafted, hand-drawn animations. Embark on the epic journey of four prisoners of the British empire, transformed into rats by the notorious pirate witch, Flora Burn. To regain their human bodies, they will have to fight dangerous bosses, uncover the secrets of the vast Irish coast, and ultimately capture the witch who cursed them.</p>\n<p>Beautiful 2D, hand-drawn animation breathes life into the game&#39;s cast of characters - inspired by classic animated films and reminiscent of the golden age of 2D platforming. These animations combine seamlessly with detailed 3D environments enhanced by light and shadow effects to create a 2.5D platforming experience of incredible quality.</p>\n<p>Chart your progress through a huge, non-linear world as you attempt to track down the pirate witch who cursed you. Shipwrecked on the coast of Ireland in the 18th Century, you&#39;ll need more than just your swashbuckling skills to forge your path to freedom.</p>\n<p>Discover four playable characters – David Douglas, Buffalo Calf, Bussa, and Akane Yamakawa. Each character brings their unique fighting style to help you overcome the challenges posed by enemies and the environment! Play alone or with up to three friends in local co-op mode.</p>\n<p>Each character has strengths and weaknesses. You&#39;ll be able to improve their abilities as your adventure progresses - unlocking new special skills, boosting your offence and defence, or learning powerful magics!</p>\n<p>A labyrinthine network of hundreds of pathways, rooms and discoveries lie ahead, in a substantial quest with over 12 hours of content. Can you master each character’s playstyle, find all the hidden secrets, and unlock each of the game’s multiple endings?</p>\n<p>Many thanks to everyone who has supported us so far. We look forward to updating you on our development progress. In the meantime we would welcome any feedback in the community - and don&#39;t forget to Wishlist if you&#39;d like to be kept up to date on any upcoming news!</p>", "metacritic": null, "released": "2023-04-05", "tba": false, "updated": "2023-12-14T16:43:03", "background_image": "https://media.rawg.io/media/screenshots/617/617b240d9ac879c410039bbcdfe00254.jpg", "website": "https://pqube.co.uk/curse-of-the-sea-rats/", "rating": 3.11, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 4, "beaten": 3, "toplay": 17, "dropped": 5}, "playtime": 5, "achievements_count": 0, "ratings_count": 10, "suggestions_count": 478, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC", "Nintendo Switch"], "developers": ["Petoons Studio"], "genres": ["Action", "Adventure", "RPG", "Platformer"], "publishers": ["PQube"], "esrb_rating": null}