{"id": 881154, "slug": "sword-of-wonder-its-good-to-be-a-king", "name": "Sword of Wonder: It's Good to be a King", "name_original": "Sword of Wonder: It's Good to be a King", "description": "If you enjoy sandbox style adventure in Arthurian times, then this is the project you've been waiting for. Cast ashore in a distant unknown land, Jack (name customizable) arrives next to a lake, where a mysterious woman float into view, offers him a chance to rule, and more...if only he'd pull the sword.<br/>\n<br/>\r\nAfter a brief trip to the nearby city of Camelot, you learn the roads are not safe in the kingdom, and the rulers are in a rocky position, at best. A Princess catches your eye and invites you back to her place, where you have the opportunity to not just romance one woman, but basically all of them.<br/>\n<br/>\r\nGuide yourself through this fantasy tale and keep that sword up and ready. You will need to mount every challenge thrown your way, and prove you are worthy of victory. <br/>\n<br/>\r\nFeatures:<br/>\r\n- Thousands of renders in Full HD<br/>\r\n- 41 Animated erotic scenes accessible via in-game Replay feature<br/>\r\n- Sandbox style mechanics<br/>\r\n- Thousands of lines of dialogue, over 125,000 words of rich, fantasy story filled with humor, drama, love, and sex.<br/>\r\n- Multiple story paths<br/>\r\n- Explicit animated sex scenes (NSFW)<br/>\r\n- Optional mini-games where you have to hunt down a chicken with a knife, or win a short in-game card game to unlock specific events<br/>\r\n- Many hours of playtime<br/>\r\n- A dozen plus characters and relationship outcomes<br/>\r\n- Music and ambient sounds, hear the leaves rustle in the trees, the birds sing, or the lake lap at the shore.<br/>\r\n- Mouse or keyboard control", "metacritic": null, "released": "2022-11-17", "tba": false, "updated": "2023-03-22T23:21:00", "background_image": "https://media.rawg.io/media/screenshots/d1f/d1f52a22361dfe493cc5cbde97703c9a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 336, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Jill Gates"], "genres": ["Casual"], "publishers": ["Cringe Games"], "esrb_rating": null}