{"id": 881156, "slug": "horrifical-maze", "name": "Horrifical Maze", "name_original": "Horrifical Maze", "description": "Horrifical Maze Is A 3D Realistic Horror-Adventure Game.<br/><br/>Travel Threw Mazes And Complete Missions, Survive, And Escape.<br/>This Game Contains Features That Most Games Don't Offer On Steam.<br/><br/>Over Hours Of Gameplay.<br/><br/>Horrifical Maze Includes:<h3>Free Updates</h3>All Future Content Updates for this game will be free to download.<h3>Full Mouse And Keyboard Support</h3>Mouse and Keyboard input devices can be used In-Menu and In-World. <br/>(\"In-World\" Meaning \"In The Mazes\")<h3>PlayStation And Xbox Controller Support </h3>The PlayStation Controller Support is only functional In-World. <br/>Xbox Controller Support is Coming in a future update.<h3>No Advertisements</h3>No Advertisements will appear in this game because this is the premium version.<h3>Startable Offline</h3>Internet Is Not Needed To Start This Game.<h3>Offline Single-Player</h3>This Player-Mode can be played without the internet.<h3>Online Multi-Player Modes (Including Offline LAN)</h3> Coming in a future update.<h3>Mission Mode</h3>Complete A Numerous Amount Of Missions in A Staggering Amount Of 3D Mazes.<h3>Unlimited Frame-Rates Per Second</h3> Which Allows the player to reach the Highest frame-rates-per-second on there device.<h3>Great For Slow And Fast Devices</h3>This game shouldn't require much from a device to run smoothly.<br/>(depending on the selected visual-detail mode)<h3>User-First-Person-View</h3>First-Person-View Perspective allows the user to have a view, like you would in real-life.<br/>(not a camera view over the shoulder or behind your back)<h3>User-Appearance Selection</h3> Coming in a future update.<h3>User Field-Of-View Editor</h3>You can adjust the Field-Of-View feature to be able to see more on the screen.<h3>A Great Amount Of Different Regions</h3>Regions Represent a different kind of environment In the mazes.<h3>Ultra-Fast Loading Speeds </h3>Most Devices should be able to load in to anything in the game within 10 seconds.<br/><br/>This game offers much more, but will not be all explained in this description.", "metacritic": null, "released": "2022-11-17", "tba": false, "updated": "2022-11-18T04:09:02", "background_image": "https://media.rawg.io/media/screenshots/e26/e268e959a3545909cd336d784fbd3af8.jpg", "website": "https://www.horrificalgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Horrifical Games"], "genres": ["Adventure", "Indie"], "publishers": ["Horrifical Games"], "esrb_rating": null}