{"id": 881149, "slug": "crafty-survivors-prologue", "name": "Crafty Survivors - Prologue", "name_original": "Crafty Survivors - Prologue", "description": "This is the free version of <strong>Crafty Survivors</strong>, an action roguelite where you play with Crafters, Gatherers and Specialists from different professionals with different skills and mechanics, while fighting hordes of enemies to gather materials and improve your village.<br/><br/><h3>Unique Builds Every Stage</h3>Select from a variety of upgrades in this Action Roguelite, to create unique builds catered to each character on each run. Are you going to be a Chef focused on serving deserts or roasting your foes? A Weaver that will patch your enemies together or massacre them with yarn balls? Which material would you choose for your statues: wood or marble? Find your own crafty way to SURVIVE!<br/><br/><h3>Select your Professional</h3>Choose from a variety of crafters, gatherers and specialists, each with their own unique set of skills and mechanics, for different gameplay experiences. Between cooking your enemies, sewing them together or building statues that will crush your foes, there will always be a crafty way to defend your home!<br/><br/><h3>Upgrade your Village and get more Powerful</h3>Gather materials from enemies and use them to upgrade your village, unlocking new characters, extra buffs and grow your power even further.<br/><br/><h3>Features:</h3><ul><li>Fight in a diverse set of <strong>different biomes</strong>, with their own challenges, added through updates;<br/></li><li>A wide variety of <strong>crafters, gatherers and specialists</strong>, with more being added through updates;<br/></li><li>Different <strong>skill trees on each character </strong>for you to discover, with over 40 skills available in total;<br/></li><li><strong>Quick play sessions</strong> for busy gamers;</li></ul>", "metacritic": null, "released": "2022-11-17", "tba": false, "updated": "2022-11-18T04:00:10", "background_image": "https://media.rawg.io/media/screenshots/56e/56ed696127958117750f735f24a7ea6a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Flannel Bear Games"], "genres": ["Action"], "publishers": ["Flannel Bear Games"], "esrb_rating": null}