{"id": 881179, "slug": "light-of-life-2", "name": "Light of Life", "name_original": "Light of Life", "description": "Light of Life is a challenging precision platformer about an elf named Elanor who possesses incredible power! Using a bow and arrow with the mission: to recover all life fragments stolen by the goblins.<br/><br/>Light of Life takes place in a cute and deadly fantasy world where many dangers will try to stop you as you fight to recover all the fragments. Run and throw yourself towards the light and become the heroine of the elves.<br/><br/><br/><br/><strong>MAIN FEATURES</strong><br/><br/><ul><li><strong>100 levels</strong> - 100 amazing handmade levels full of deadly traps!<br/></li><li><strong>Controls</strong> - Precise controls make it fun to move through the different stages of the game!<br/></li><li><strong>Cute and Colorful</strong> - Handmade arts. Colorful, cute and nostalgic visuals await you!<br/></li><li><strong>An A+ Challenge</strong> - Collect crystals to unlock fantastic outfits for Elanor!<br/></li><li><strong>Great to Complete</strong> - Completionist players will love to pursue the game's various achievements!</li></ul><br/>- Explore the 5 worlds in search of the fragments of the light of life, help Elanor!<br/><br/><br/><br/>- Amazing visuals available for the most ambitious players.<br/><br/><br/><br/>- Controls are easy to learn but hard to master. You'll learn from your mistakes and be reborn very fast, getting back into action almost immediately!<br/><br/>", "metacritic": null, "released": "2022-11-14", "tba": false, "updated": "2022-11-18T04:39:43", "background_image": "https://media.rawg.io/media/screenshots/cd5/cd5f57076417913def8cf7994e131f99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 232, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Renan Felipe"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Renan Games"], "esrb_rating": null}