{"id": 881159, "slug": "perseus-titan-slayer-free-trial", "name": "Perseus: Titan Slayer - Free Trial", "name_original": "Perseus: Titan Slayer - Free Trial", "description": "https://store.steampowered.com/app/2003050/<br/><br/><strong>The Free Trial is a free, short version of Perseus: Titan Slayer. We want to show you the main mechanics, so in the Free Trial you can finish the first 2 acts and fight 2 bosses.</strong><br/><br/>Perseus: Titan Slayer is an over-the-top hack and slash, rogue-like adventure that focuses on depth and branching choices which allow for multiple unique runs.<br/><br/><br/><br/>Branching choices allow for custom runs and many opportunities to play again and try new builds.<br/><br/><br/><br/><br/><br/>Wield a Sword, Dagger, Bow, or Katana, each with their own special abilities. Feel like a real Olympian and explore the secrets of each weapon.<br/><br/><br/><br/><br/><br/>Meet Zeus, Poseidon, Hermes, and many other Olympians and gain their legendary upgrades.<br/><br/><br/><br/><br/><br/>Hack and slash through hordes of enemies as you make your way into Tartarus on an epic journey to fight Hades and the Titans.<br/><br/><br/><br/><br/><br/>It doesn’t matter how you want to play this game or what style you want to use. A shopkeeper system allows players to make unique builds whether you want to be a Tank, Agile, DPS or even a double spell caster on your adventure.", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2023-02-16T16:19:08", "background_image": "https://media.rawg.io/media/screenshots/518/518099afe396cc2d08be07f92273bee5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1, "dropped": 2}, "playtime": 0, "achievements_count": 2, "ratings_count": 2, "suggestions_count": 522, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Sicarius"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["G-DEVS.com"], "esrb_rating": null}