{"id": 881155, "slug": "hellrazor64", "name": "HellRazor64", "name_original": "HellRazor64", "description": "<strong>STORY</strong><br/>The best FPS that never existed finally comes to the modern era! A convict on death row, sentenced to die by electrocution. You awaken in Hell bound to an ancient weapon, the Hellrazor, and you must fulfill its conquest. Reign in Hell or die trying. <br/><br/><strong>CONTENT</strong><br/>Play through a single player campaign in the netherworld that takes you through a tour of unique locations from the burning ashes of Ancient Rome to a hellish New York City, unlock your arsenal, upgrade your abilities and defeat the Seven Deadly Sins; Lust, Wrath, Sloth, Greed, Pride, Gluttony and Envy, to face the first hierarchy and claim the throne of Hell. <br/><br/><strong>FEATURES</strong><br/><strong>Upgrade your Abilities</strong><br/>-Upgrade your abilities and conquer Hell! Get slayin' the damned to become harder, nastier, meaner, leaner and more obscener than any other bad mother around. Upgrade your damage, speed, armor, ammo and health and take advantage of the ability to change your skills at any time to best adapt to the present challenge. Groovy. <br/><br/><strong>Unlock your Arsenal</strong><br/>-Choose from a buffet of lead and metal to unleash your inner destruction! You got your standard 9 mm, a good ol' shotty, a proper boomstick and that sweet, sweet chaingun as an appetizer. With a side of melee goodies, none more fearsome than the unholy Hellrazor, or so he says. And for dessert we have some weapons that are really outta this world! Dig in baby! <br/><br/><strong>Slay the Lords of Hell</strong><br/>-Face off against the lords and hordes of Hell! Each of the Seven Deadly Sins possess unique abilities and will require everything you got to take down! But to take the throne you gotta kill the king, do you have what it takes to defeat the Sins and slay the mighty Astaroth, Grand Duke of Hell? <br/><br/>We will see if you are worthy. Welcome to Hell.", "metacritic": null, "released": "2022-11-17", "tba": false, "updated": "2022-11-18T04:07:26", "background_image": "https://media.rawg.io/media/screenshots/ec8/ec83b65e8cc268f2894deb67a8bd1b53.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 412, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Crucible Studios"], "genres": ["Action"], "publishers": ["Crucible Studios"], "esrb_rating": null}