{"id": 881258, "slug": "horny-witch-crusade", "name": "Horny Witch: Crusade", "name_original": "Horny Witch: Crusade", "description": "Horny Witch: Crusade is a precision platformer combined with a visual novel, telling a story of Adria, a young Nymphomage who posses some pretty strong powers as well as sexual urges which she can&#39;t control. She needs to have sex regularly or else she starts to lose control over herself.<br />\nDuring the course of the game you will have plenty of opportunities to get laid with different people. However, the Three Handed followers are determined to stay in the way as they want to punish everyone who is having too much fun. It is up to you to get rid of them and celebrate  the life and it&#39;s pleasures as much as you can!<br />\nGameplay:<br />\n- Play as Adria in an unique and challenging precision platformer and fight against the Three Handed God followers<br />\n- Avoid traps and plan your jumps carefully as only one wrong step can kill you<br />\n- Follow the story in in-between scenes with dialogues and images (every platformer level is followed by a story scene)<br />\n- Cast spell to fight enemies<br />\n- Fight 2 epic bosses<br />\n- There is no time limit and you can repeat the level as many times as you wish<br />\n- The platformer part is played only on the keyboard, with movement, jump and attack buttons<br />\nFeatures:<br />\n- 15 platformer levels with increasing difficulty<br />\n- 15 story scenes with images and dialogues<br />\n- Retro pixel art graphics of the platformer as well as realistic graphics in the story<br />\n- Familiar universe with well known characters from the game Horny Witch: Hunt</p>", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2022-11-18T14:38:16", "background_image": "https://media.rawg.io/media/games/5ee/5ee258dd5a840e96081465550f28cae1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 230, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cute Pen Games"], "genres": ["Indie"], "publishers": ["Cute Pen Games"], "esrb_rating": null}