{"id": 881247, "slug": "oceans", "name": "Oceans", "name_original": "Oceans", "description": "Enter a vast, underwater cosmos: a mysterious interconnected world of tentacles, sharp teeth, and black ink, where your survival depends on your ability to adapt in a continually changing environment. But this is just on the surface… Lurking below the surface lie mysteries so bizarre they hardly seem natural. The Deep is a deck of mysterious traits you’ll discover over the course of many games. These over-powered traits represent the unknown: the undiscovered wonders of the deep ocean.<br/>\n<br/>\r\nBuy once, play on any platform! Based on the hit board game, Oceans offers a beautifully crafted strategy game experience.  The reef and 20 deep cards are completely free to play (and ad-free!), and you may also join one multiplayer game per day free. A one-time upgrade to the Complete Game features 87 Deep Cards, 21 Scenarios, and multiple hard AI personalities for endless replay fun. You can also play unlimited online games against others on any platform, in real time or asynchronously, create your own multiplayer games, and even create your own decks for use in singleplayer and multiplayer.  You are also able to login with your account on mobile platforms and unlock your purchased functionality there.  <br/>\n<br/>\r\nVenture into the deep at your own risk!", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2022-11-18T06:12:47", "background_image": "https://media.rawg.io/media/screenshots/8b6/8b6ca3c52a7b813d845194c29d05b40d.jpg", "website": "https://www.oceansdigitalgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["North Star Games", "Hashbyte Studio"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["North Star Games"], "esrb_rating": null}