{"id": 881263, "slug": "the-seven-realms-realm-1", "name": "The Seven Realms - Realm 1", "name_original": "The Seven Realms - Realm 1", "description": "You have tried to maintain a semblance of peace throughout the Realm for four hundred years.<br/><br/>Since the death of the Queen and a great apathy seized the King, it fell to you, the prince of the vampires, to restore the order. So when you smell an unfamiliar scent that should not have been amongst a party of humans, you go to investigate and meet Leyala.<br/>Leyala seems to be hiding something, and by trying to undercover what, you start a chain of events that will cause you to venture across The Seven Realms.<br/><br/><br/><br/>The Seven Realms is a fantasy, story-driven, adult visual novel. As the heir of one of the most powerful Realms, your choices will determine the fate of the world. Will you be a strong or a fair ruler? Will you inspire fear in your subordinates or let them think of you as weak? Are you going to forgive or hold your grudges forever? The choices are yours.<br/><br/><br/><br/><br/>Take the time to know the 3 main Love Interests, 4 Harem Members, and 1 Bonus Encounter present in Realm 1. Will you be a one-woman-only kind of man, or will you start building your harem?<br/><br/><br/><br/><br/><br/>The Seven Realms has expanded lore and in-depth character backgrounds.<br/>If you like the game and are interested in knowing more about the Realms and the characters, you can read short stories and detailed species descriptions, as well as watch videos about it on our website and social media.<br/><br/><br/><br/>In the subsequent chapters, you will travel through the Realms and meet up to 23 women. Each one of them have different personalities, backstories and appearances. You can visit our website if you would like a sneak peek of them!<br/><br/>", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2023-12-19T05:58:43", "background_image": "https://media.rawg.io/media/screenshots/a16/a165c45a3025cceded27a7ef78eb708b.jpg", "website": "https://www.septcloudgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 8, "beaten": 1, "toplay": 3, "dropped": 1, "playing": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 3, "platforms": ["Linux", "macOS", "PC"], "developers": ["SeptCloud Games"], "genres": ["Simulation", "Indie"], "publishers": ["SeptCloud Games"], "esrb_rating": null}