{"id": 881256, "slug": "lapin-2", "name": "LAPIN", "name_original": "LAPIN", "description": "An adventure of brave rabbits! The story of LAPIN begins in a park where people abandon their pet rabbits.<br/>Underneath this park live five rabbits in a hole. They survive by stealing hay from the rabbit feeder on the ground to their burrow called Alfa. However, when construction begins at the park, they are forced to leave their beloved hole and venture into the unknown to find a new home.<br/>Liebe, a white rabbit, goes on an adventure with Captain, Bianca, Jose, and Montblanc.<br/><br/>Help the five abandoned rabbits overcome obstacles and find a new home with precise control and speedy action.<br/><br/><br/>[Platforming]<br/>LAPIN is a 2D platformer in which players must overcome obstacles with precise control and speedy action.<br/>Take advantage of various terrains to reach the end of the map.<br/><br/><br/>[Character]<br/><br/>LAPIN features five rabbits. Enjoy the episodes of these five rabbits with different personalities.<br/>Talk to your rabbit friends while exploring! They will give you information that will help you with the Expedition, and you can grow even closer to them! They might even give you unexpected gifts.<br/><br/><br/>[Liebe's Notes]<br/>You can check the collectibles from Liebe's Notes at a glance.<br/>Collectibles include maps with destinations marked, information of other rabbits, photocards, seeds, and items.<br/>The 'Liebe Note' will be enriched and filled by your actions!<br/><br/>[Seeds]<br/>You can acquire a variety of seeds while platforming. These seeds can be planted and when they grow, they yield flowers.<br/>The stories of what happened to Jorge's Expedition while they were there are contained in Seeds.<br/>You can simply walk past them, or delve into the stories they left behind on the flowers.<br/>Acquired seeds are added to the Liebe's Notes.<br/><br/><br/>[Unlock Photocards]<br/>You can increase the likeability of individual rabbits by talking to them.<br/>Talk to them and unlock photocards.<br/>You can relive the memories with photocards.<br/>(* One side story for 'Captain' can be unlocked in the Early Access version. After the official release, all side stories can be unlocked based on Affection levels.)<br/><br/>[Interaction]<br/>You can interact with many things in Alfa, their home, and will find many other objects to interact with while platforming.<br/>You can read the records left by Jorge, the leader of the legendary rabbit expedition, from Jorge's Statues.<br/>The more you explore, the more you will learn about the past and present of the rabbits and where you are!", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2024-03-07T17:17:39", "background_image": "https://media.rawg.io/media/screenshots/b18/b18ef8d4f8a3ec273506e1b479c17cf0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 4, "dropped": 4}, "playtime": 0, "achievements_count": 71, "ratings_count": 3, "suggestions_count": 511, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Studio Doodal"], "genres": ["Adventure", "Indie"], "publishers": ["Studio Doodal"], "esrb_rating": null}