{"id": 881379, "slug": "flexy-ring", "name": "Flexy Ring", "name_original": "Flexy Ring", "description": "► REQUIRES FLEXIBLE THINKING<br/><br/>Are you looking for an exciting new puzzle game that has the power to really bend your mind? Flexy Ring is a fun logic game with a simple concept – just tap on the pins to release the rubber bands and gradually untangle them to complete each level – that rapidly gets really tricky as the levels progress. Give your understanding of physics and your lateral thinking a real test as you untie the rubber bands and complete puzzle after unique puzzle in this great fun and exceptionally challenging game.<br/><br/>► FANTASTIC ELASTIC<br/><br/>◾ A game with real stretch: With over 150 challenging levels and eight unique modes, Flexy Ring is a game that has more than enough to occupy your mental bandwidth for hours and hours of testing logic puzzle fun.<br/><br/>◾ Snap to it: The concept and mechanism of the game couldn’t be simpler – just tap on the right pins to set the elastic bands free with a satisfying ping. But are you sure you can free them in the right order to sort out the tangled mess and complete the puzzle?<br/><br/>◾ Bounce back: If you make a mistake and ping the wrong rubber band, you can start the puzzle again and try a new approach as many times as you need – there’s no penalty for trying in Flexy Ring, so keep pinging the bands until you find the right solution.<br/><br/>◾ Sticky situations: Try out the Rubber Band Challenge again and again with over 20 different exploding objects. Keep adding rubber bands until the object pops. Don’t worry, though, your screen protects you from flying pieces of watermelon and all the other mess from the blast.<br/><br/>◾ Focus on the details: Special extra-large levels feature very big puzzles that require you to zoom in and untie individual sections of the rubber band tangle, while always keeping the bigger picture in mind.<br/><br/>◾ Unwind as you untangle: Beautiful, brightly colored rubber bands, pretty backgrounds, eight unique locations, and satisfying sound effects ensure that, even when the puzzles are really hard to untie, playing Flexy Ring is always a fun and relaxing experience that helps to relieve stress.<br/><br/>► FLEX YOUR LOGIC<br/><br/>Think you’ve got the mental flexibility, the knowledge of physics and the visual perception to solve some really challenging rubber band puzzles? Then download Flexy Ring right now and get ready for hours of addictive elastic band fun that’s guaranteed to keep you amused and give your brain a real workout time and time again. If you want to discover what real fun with rubber bands is then get playing Flexy Ring right away.<br/><br/>Privacy Policy: https://say.games/privacy-policy<br/>Terms of Use: https://say.games/terms-of-use", "metacritic": null, "released": "2022-10-18", "tba": false, "updated": "2022-11-18T08:46:46", "background_image": "https://media.rawg.io/media/screenshots/c54/c54908ae6032828d0fdd10ed3669b418.jpg", "website": "https://say.games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SayGames"], "genres": ["Casual", "Puzzle"], "publishers": ["SayGames"], "esrb_rating": "Everyone 10+"}