{"id": 881347, "slug": "merge-tales", "name": "Merge Tales", "name_original": "Merge Tales", "description": "Merge Tales, match 3 and merge dragons, heal the land, solve puzzle games and dress up your dragon city, build your own special world.<br/><br/>In Merge Gardens, there are countless possibilities waiting to be discovered, and new things are constantly being discovered as the surrounding lands are unlocked and expanded.<br/><br/>Magical things happen when the same things are matched together, they merge into higher-level and more magical items. You need some strategy to merge more advanced items with minimal items.<br/><br/>Puzzle games are another challenge, where great care and strategy are required to solve puzzles and get special rewards. Sometimes you need to pay attention to the time, and you can complete the final test within the time limit.<br/><br/>MERGE TALES FEATURES:<br/>BUILD your own garden! In this garden, use your strategy to merge, drag as you wish on the vast floor and build your dream gardenscapes!<br/><br/>MERGE all items! Special items appear as the map develops, they are waiting to be merged, and merging them has unexpected effects!<br/><br/>Build your COLLECTION! Every little item can be merged in succession until the land miracle appears! Unlock the wonders of the land and explore the secrets of the land!<br/><br/>WAIT FOR THE SEEDS TO SPROUT! The magic of this land is everywhere, sprouting seeds and fruits are waiting for you to collect!<br/><br/>The MAGIC BOX is waiting! Mysterious treasures are hidden all over the continent, treasure hunt competitions are going on, finding the most treasures can help you expand your special garden.<br/><br/>MAGICAL DRAGONS! There are many magic dragons in this land, they live and work in the garden, merge dragons to improve their magic!<br/>Mystery Exploration! There are also many entrances to other magical worlds on this continent, go to the secret remains to complete unique matches to get special themed surprises!<br/>BABY RAISING! There is a human baby being cared for by the elves, can you help take care of this cute baby? Find the origin of your baby, record your baby's life, and dress up your baby to make him different.<br/><br/>As you progress on this journey, you will find all kinds of treasures and resources, all kinds of new things will appear in front of you, organize all the magical props, and match them to make your garden match your heart.<br/><br/>Download Merge Tales now and build your wonderful world!<br/>All suggestions and questions related to the game can be contacted through official channels.<br/>Facebook homepage：https://www.facebook.com/MergeFairyTales<br/>You can also contact us in the game, there is a “feedback” button in the settings interface in the game, you can contact us when you encounter any problems in the game.", "metacritic": null, "released": "2022-03-28", "tba": false, "updated": "2022-11-18T08:10:20", "background_image": "https://media.rawg.io/media/screenshots/4da/4da3d78dbae1c5676721dfa43e70050a_asPrlNC.jpg", "website": "http://www.ivymobileinternational.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 180, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["IVYMOBILE INTERNATIONAL ENTERPRISE"], "genres": ["Casual"], "publishers": ["IVYMOBILE INTERNATIONAL ENTERPRISE"], "esrb_rating": "Everyone 10+"}