{"id": 881358, "slug": "merge-cookingtheme-restaurant", "name": "Merge Cooking:Theme Restaurant", "name_original": "Merge Cooking:Theme Restaurant", "description": "Do you know you can enjoy the food around the world without traveling?<br/>Do you know you can master the secret of cooking with just a few simple steps?<br/>Tie your apron and put your chef hat on!<br/>In Merge Cooking, you can cook anything!<br/><br/>- Welcome, Chef!<br/>Your assistant Lea is waiting for you to start the adventure of opening restaurants and serving customers around the world. Merge Cooking not only allows you to cook as a star chef and master the world cuisine but also helps you realize your designer dream and renovate Michelin star restaurants!<br/><br/>- Start a food tour!<br/>ENJOY Eggs Benedict in New York, DRINK Tom Yam Gong in Bangkok, ROLL Sushi in Tokyo, DINE on Escargot in Paris… Merge Cooking takes you on a world tour, city by city! You will unlock a world-famous dish every day and discover more exciting and challenging recipes to hone your cooking skills.<br/>Various local cuisines – Taco, Kebab, Ramen and more.<br/>Numerous restaurant themes – fast food, BBQ, seafood and more. <br/><br/>- Play with ingredients!<br/>MERGE ingredients with the simple steps – tap, drag &amp; merge! Quality delicacy requires nothing but basic ingredients! <br/>COOK with the help of machines – seven pieces of equipment that bring you extra fun! Simulate real-life cooking and prepare the food in a fun way! Frying pan, juice blender, oven and cocktail shaker… everything you need to prepare a decent meal will be on standby. Say goodbye to overcooked pies and charred steaks!<br/><br/>- Eat outside the box!<br/>Mozzarella, pecan, coconut, lobster, champagne… Find everything you need to become a world-famous chef. Merge them to serve hungry customers! Discover more as you play! Unlock special souvenirs as you travel. How about sending a postcard from Hollywood?<br/><br/>- Every flavor tells a story!<br/>Nothing makes people more connected than good food. Get familiar with the American restaurant owner who's also a football coach and the French restaurant manager who's elegant but picky. Greet customers from all walks of life. Learn their stories and write more of your own!<br/><br/>In Merge Cooking you’ll:<br/>- MERGE fruits, vegetables, cheese and UNCOVER other numerous ingredients.<br/>- COOK exotic and fantastic dishes and TRAVEL to different countries.<br/>- SIMULATE real-life cooking with different cooking equipment.<br/>- RENOVATE restaurants with fresh new designs.<br/>- UPGRADE culinary skills and MASTER global recipes.<br/>- RELAX by enjoying great delicacy. No time pressure!<br/>- CLAIM amazing rewards and gifts.<br/>- ENGAGE yourself and ENJOY extra fun!<br/><br/>Merge Cooking, cook anything!<br/><br/>Have questions or need support?<br/>Contact us via email at support@happibits.zohodesk.com.", "metacritic": null, "released": "2022-09-19", "tba": false, "updated": "2022-11-18T08:23:58", "background_image": "https://media.rawg.io/media/screenshots/875/875d059dbb2d26152dd19e19fff63f7d_dLb0GWu.jpg", "website": "http://game.happibits.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Happibits"], "genres": ["Simulation", "Puzzle"], "publishers": ["HAPPIBITS TECHNOLOGIES"], "esrb_rating": "Everyone 10+"}