{"id": 881355, "slug": "farland-2", "name": "Farland", "name_original": "Farland", "description": "Set off for the unexplored lands of Farland, which hold many secrets and amazing discoveries in this exciting new adventure!<br/><br/>You will meet true friends who left their homes because of a terrible disaster.<br/>In the mysterious lands of Farland, they are trying to find a new home, but without your help, they won't be able to cope...<br/><br/>Helga the Noisy is a good friend, a wonderful hostess and a capable helper, she can always cheer you up and find a way out of any situation.<br/>Halvard the Silverbeard is a wise mentor, always ready to help, share experience and take care of everyone in the village.<br/><br/>In Farland, everyone will find an activity to their liking:<br/><br/>IMPROVE and develop your village and farm!<br/>COLLECT harvests and open new recipes!<br/>DECORATE your village in the way you want!<br/>RAISE animals, get new pets and dress them up in cute outfits!<br/>EXPLORE numerous new lands full of adventure and interesting stories!<br/>MEET new characters and learn their exciting stories!<br/>ENJOY amazing adventures in new lands: reveal secrets, uncover plots, and help your friends!<br/>MAKE decisions on what the wild lands of Farland will look like! Create a thriving farm, a beautiful city and an amazing garden!<br/>CHOOSE where the storyline will go! How to make your farm the most productive, what lands to visit and whom to help.<br/><br/>It's within your power to make this wild land prosperous. Fascinating stories are waiting for you!", "metacritic": null, "released": "2022-10-20", "tba": false, "updated": "2022-11-18T08:18:16", "background_image": "https://media.rawg.io/media/screenshots/7c4/7c4a36d083df84d071e92e2c2ad8adf2_jOcHrtW.jpg", "website": "https://play.quartsoft.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["QuartSoft"], "genres": ["Adventure", "Simulation"], "publishers": ["QuartSoft"], "esrb_rating": "Teen"}