{"id": 881370, "slug": "chaos-road-combat-car-racing", "name": "Chaos Road - Combat Car Racing", "name_original": "Chaos Road - Combat Car Racing", "description": "Racing Game!<br/><br/>Put your car on the asphalt! In an unheard of action car racing and shooting game that mixes combat, riot, cars, guns and racing, you need to rid the city of chaos by eliminating multiple crime bosses. <br/><br/>Destroy enemies' champions on the way, launch rockets, dodge bombs on the lane and make use of unique special weapons that raise the level of classic shoot 'em up style. Chaos Road is an action-packed shmup race shooter where you can drive different cars and rid the city of crime with an arsenal of weapons. Take the fast lane in a traffic race, attack and smash cars rivals on the road to revenge the city!<br/><br/>IN THE GAME:<br/><br/>• Chase bosses and gangs to reach the be a top champion and rid the city of riot.<br/><br/>• Make improvements to your car and equipment by adding gun, armor, equipping drones and acquiring unique special race weapons.<br/><br/>• Accelerate your ride through horizon of many different fast lane road: shoot and smash enemies riding car, bike, truck, tank, plane and more.<br/><br/>• Battle for survival the riot and be fast to win this traffic high-speed top racing and shooting free game.<br/><br/>• Challenge the big bosses of criminal gangs traffic, each boss has his own vehicle with challenging gun weapons, every battle is a faster rocket!<br/><br/>• Detonate your enemies with guided missiles, rockets, laser beams, gamma-ray, nuke, bomb and power ups that will help you in the riot.<br/><br/>Play the action Game of 2021 - Chaos Road Combat Racing is a 2021 free action car shooting games, follow us:<br/>Facebook: https://www.facebook.com/ChaosRoadGame<br/>Instagram: https://www.instagram.com/chaos_road<br/>www.zeeppo.com<br/><br/>Chaos Road is a free to play action shooting game, but some game items can be purchased for real money.", "metacritic": null, "released": "2020-04-21", "tba": false, "updated": "2022-11-18T08:37:04", "background_image": "https://media.rawg.io/media/screenshots/d05/d0541c3369e7e9eef0c2b19c9044afc5_NwWBi1a.jpg", "website": "https://www.superchargemobile.app/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Supercharge Mobile Corp"], "genres": ["Action", "Racing"], "publishers": ["Supercharge Mobile"], "esrb_rating": "Everyone 10+"}