{"id": 881352, "slug": "marble-master-match-3-shoot", "name": "Marble Master: Match 3 & Shoot", "name_original": "Marble Master: Match 3 & Shoot", "description": "The brand-new match 3 bubble shooter game! Shoot balls, solve puzzles, decorate the ship and earn coins.<br/><br/>Marble Master is a match-3 bubble shoot game, which breaks the border of the traditional marble game, a creative fusion of marble game and dramatic adventure experience. Using the power of marble to defeat the monsters that guard the treasures, and achieve the title of the greatest adventurer and the Marble Master. <br/><br/>MARBLE MASTER FEATURES<br/>•  Classic gameplay. Beat interesting levels by matching marble balls, relive the classic Zumba gameplay.<br/>•  Dramatic plot design. See the interaction between Esther and Mr.Mask — their chemistry makes you laugh.<br/>•  Novel treasure puzzle. Numerous magic treasures with different solutions for unlocking them. You can exhibit them in your private museum.<br/>•  Ship Decoration. Dress up your deck and cabin with beautiful furnitures. A handsome ship is always a good travel partner.<br/>•  Uncover fantastic events. Save the birds or begin a desert tour, enrich your journey.<br/><br/>HOW TO PLAY MARBLE MASTER<br/>• Tap the screen and shoot marbles! Easy peasy!<br/>• Match at least three marbles to blast them, to stop them from the suction of the vortex.<br/>• Complete various level targets! Don't worry! Not a big deal for a marble game fan!<br/>• Complete the level and collect treasures from the jungle, desert, Iceland, and volcano; fill your museum collection!<br/><br/>MARBLE MASTER! BECOME THE ULTIMATE PUZZLE SOLVER AND EXPLORER!<br/>DOWNLOAD FOR FREE NOW!!<br/><br/>Email: hi@m.teewee.games<br/>Website: www.teewee.games", "metacritic": null, "released": "2022-09-27", "tba": false, "updated": "2022-11-18T08:15:27", "background_image": "https://media.rawg.io/media/screenshots/3bf/3bf304c3e2a217ab46672f80d13e98ad_T1o5VL6.jpg", "website": "https://teewee.games", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Teewee Games"], "genres": ["Casual", "Puzzle"], "publishers": ["Teewee"], "esrb_rating": "Everyone 10+"}