{"id": 881301, "slug": "paint-color-paint-by-number", "name": "Paint Color: Paint by Number", "name_original": "Paint Color: Paint by Number", "description": "Paint Color: Paint by Number is a number coloring and painting game app, also known as a paint by number coloring book, which gives  you an emergent experience of coloring popular art pages with paint color by number kits. This incredible coloring art book for adults has many beautiful and popular coloring pages to color offline, anytime and anywhere! Moreover, new fancy coloring pages will be updated daily in this painting and coloring book. It’s an entertaining way to kill time, but also a heart-comforting mental therapist by creating and releasing your inner artist for free. <br/><br/>Paint Color: Paint by Number has a variety of coloring pages in different categories: <br/>Special, Characters, Nature, Animals, Minions, People, Flowers, Landscapes, Unicorns, and mandalas, etc. You can choose your favorite pic and page to paint with coloring number kits.  And Paint Color: Paint by Number will also constantly update the categories and pictures in them! <br/><br/>So here comes the marvelous Christmas painting category and pages! <br/>If you are a Christmas person, Aha, you’ve found the right and free Christmas painting game! The new Christmas coloring category will open a new era of Merry Christmas painting and coloring books for you! Come and download Paint Color, you will be amazed by extraordinarily wonderful Christmas pictures and pages. Set free your artist's talent with our paint-by-color game! <br/>Happy painting game equals merry Christmas every day!! <br/>Let's see what you can enjoy in the happy Christmas painting category!<br/>Santa Claus, Christmas trees, snow, warm Christmas gifts and cards, delicate Christmas decorations and ornaments...and so on. <br/><br/>Countless exquisite Christmas coloring pages to paint by number of no time and place limits<br/>Christmas feast of colorful painting category is waiting for your to join!<br/><br/>Action is better than thought, my dear friend! Download our coloring and painting game and enjoy coloring by number for free right now!    <br/><br/>More features:<br/>1. Swift &amp; easy to draw your own coloring art piece<br/>2. Newly designed painting pages daily updated<br/>3. Various coloring pages in rich categories<br/>4. Color gorgeous pages by number anytime &amp; anywhere<br/>5. Share and post your paintings on social networks<br/>6. Coloring by number app with both educational and entertaining functions<br/><br/>More functions and pictures are to be continued! <br/>Download Paint Color: Color by Number now- enjoy painting and coloring those colorful pages by number in our coloring books. The next great art masterpiece is under your name!!<br/> <br/>If you have any suggestions for Paint Color by Number app, please contact us: paintcolor.feedback@gmail.com<br/> <br/>Terms of Service：http://launchertheme.com/paint_tos.html<br/>Private Policy：http://launchertheme.com/paint_color_pp.html", "metacritic": null, "released": "2019-11-05", "tba": false, "updated": "2022-11-18T07:24:05", "background_image": "https://media.rawg.io/media/screenshots/167/16707de059eaf070b09beffa05c3c419_6q8fJbK.jpg", "website": "http://paintcolorstudios.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 225, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ziyan liao"], "genres": ["Board Games", "Casual"], "publishers": ["ziyan liao"], "esrb_rating": "Everyone 10+"}