{"id": 881325, "slug": "dark-steel", "name": "Dark Steel", "name_original": "Dark Steel", "description": "Shatter your chains, fight, and seek revenge against those who kept you enslaved for years. Knight, Warrior or Assassin, choose your class wisely and face hundreds of enemies in this fabulous medieval combat game with impressive 3D graphics and realistic physics.<br/>Make the most of your mobile device and fight as if you were playing on console in an over-the-shoulder 3D perspective that will make you feel like you’re inside the game. Control your character with extremely simple gestures on your touchscreen, moving your character as you see fit and executing different attacks and combos.<br/>Confront other players in multiplayer mode to obtain exclusive weapons and armor or work with them during the temporary events to defeat the Guardian of the Tower.<br/><br/>FIGHT, WIN AND IMPROVE WITHOUT STOPPING<br/>   ◉ Earn hundreds of weapons and armor such as Swords, Axes, Maces, Hammers, Daggers, Broadswords, Shields, Helmets, Gloves, etc.<br/>   ◉ Melt down the ones you don’t want and obtain Dark Steel, which you can use to enhance your favorite gear<br/>   ◉ Fuse your items and make them Evolve<br/> <br/>RPG PROGRESSION<br/>   ◉ The authentic RPG progression of Dark Steel will take your fighter to the top<br/>   ◉ Choose your class: Knight, Warrior and Assassin<br/>   ◉ Collect hundreds of different medieval armor and weapons of different rarities and styles<br/>   ◉ Evolve your items and take them to the next level<br/>   ◉ Make your character unique! Choose between a large variety of colors, beards, hair styles, scars...<br/>   ◉ Learn from your experience! Level up and earn points to distribute into your skills tree, unlocking a wide variety of powers and special attacks<br/> <br/>GAME MODES<br/>    ◉ CAMPAIGN: Travel through a huge number of maps divided into different chapters, facing hundreds of progressively stronger enemies in order to earn gold, weapons and armor that will make you more powerful.<br/>   ◉ MULTIPLAYER: Fight against other users and raid them to obtain exclusive weapons and armor.<br/>   ◉ TEMPORARY EVENTS: Watch out for the temporary events that put your skill, strength and resilience to the test. Work with friends to defeat the enemies in your way and share the loot.<br/> <br/>FEATURES<br/>   ◉ 3D Graphics, Animations and realistic Physics<br/>   ◉ Hundreds of totally different Weapons and Armors<br/>   ◉ Impressive Special Attacks<br/>   ◉ Hundreds of enemies await you in the many maps to explore<br/>   ◉ Specific events to earn totally exclusive and limited items<br/>   ◉ Multiplayer mode where you fight against the characters of other players<br/>   ◉ Controls designed specifically for touch devices which enable you to move freely and execute a variety of attacks and combos just by tapping and swiping.<br/>   ◉ Your character’s AI learns how you play so that it can defend you when other players attack<br/><br/>- Support: Chief, are you having problems? email info@darkcurry.com or contact us in game by going to Settings &gt; Help and Support.<br/>- Privacy Policy: https://darksteel.app/privacy.html<br/>- Terms of Use: https://darksteel.app/terms.html", "metacritic": null, "released": "2022-10-19", "tba": false, "updated": "2022-11-18T07:48:09", "background_image": "https://media.rawg.io/media/screenshots/0fc/0fcce6f794c0b76d68c4331148022ded.jpg", "website": "http://darkcurry.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Dark Curry"], "genres": ["Action", "RPG"], "publishers": ["Dark Curry"], "esrb_rating": "Mature"}