{"id": 881395, "slug": "monster-draft", "name": "Monster Draft", "name_original": "Monster Draft", "description": "Monster Draft- Can you choose the best monsters?<br/><br/>Monster Draft is a fun team-building game with famous monsters. Choose the strongest monster card and it joins your team in 3D. <br/>Do you want even stronger monsters? -You can MERGE and upgrade your monster! Golden Characters are game-changers.<br/><br/>WITH MONSTER DRAFT YOU CAN:<br/>   PLAY the full team-building experience with your favorite characters<br/>   SWIPE to choose a card, complete the different levels <br/>   GET more monsters, skins and scenes.<br/>   STRATEGICALLY place the monsters <br/>   CREATE the best strategy to defeat the enemy team<br/><br/>Run towards the monster battle arena, collect Monster Cards and catch Monsters and build a team. Get the same Monster Card  twice to MERGE and EVOLVE Monsters and battle against monster boss in fight games. Be the Merge Master with strategy in this hypercasual fun game. <br/><br/>Team up and take down the enemies in team battles monster games. Collect Cards while running through obstacles with your new monster friends. Collect all the battle monsters. Get ready for monster fight games with team battle ! Build a strong team and get ready for monster battle! Create your Card Deck and Upgrade Card Collection . <br/><br/>BIG UPDATE: Now you can create Dimond Merge by collecting the same cards for three times at the bonus levels. New envoriments and new obstacles makes the game more fun!", "metacritic": null, "released": "2022-07-20", "tba": false, "updated": "2022-11-18T09:06:33", "background_image": "https://media.rawg.io/media/screenshots/853/853af1b00528d64ec57a16755c35b6bb_ifJMCq6.jpg", "website": "https://oreonstudio.blogspot.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 192, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["abdurrahman mert safak"], "genres": ["Action"], "publishers": ["abdurrahman mert safak"], "esrb_rating": "Everyone 10+"}