{"id": 881338, "slug": "tractor-farming-simulator-22", "name": "Tractor Farming Simulator 22", "name_original": "Tractor Farming Simulator 22", "description": "Step into the world of farming tractor games and explore the tractor farming simulator. Modern farm simulator game is for agriculture lovers. Learn how to grow crops in tractor farming games. Plant your field of crops to grow and harvest different crops in tractor games. Take control of harvesters and other machines to take care of your fields with the help of farmers. Each level of the farming tractor driving games is more challenging and exciting than the previous level. <br/><br/>This real tractor driver game or heavy farming tractor pull game is within the town to perform the agriculture task. This driving game is offering a peaceful village environment to explore in offline mode. Each level of the farming games will engage you with realistic scenes of village life. You will also experience challenging off-road tracks for harvesting. <br/>Farming lovers need to test this game for an amazing experience farming simulator. <br/><br/>Features in Tractor Game Farming Simulator:<br/><br/>\t•\tStart with the different varieties of realistic tractor trolleys.<br/>\t•\tEnjoy multiple modes of tractor games.<br/>\t•\tUse tractors and machines to plow, harvest, and water crops.<br/>\t•\tPlay a lot of levels to grow your fields.<br/>\t•\tHD graphics with realistic sound effects.<br/>\t•\tFriendly GUI with enhanced user experience.", "metacritic": null, "released": "2022-06-10", "tba": false, "updated": "2022-11-18T08:00:53", "background_image": "https://media.rawg.io/media/screenshots/678/67840760f1e041e025023edfbd4a45f7_1T6e30g.jpg", "website": "https://k90ba0154.app-ads-txt.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 165, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Muhammad Shoaib"], "genres": ["Adventure", "RPG"], "publishers": ["Muhammad Shoaib"], "esrb_rating": "Everyone 10+"}