{"id": 881388, "slug": "goddess-of-victory-nikke", "name": "GODDESS OF VICTORY: NIKKE", "name_original": "GODDESS OF VICTORY: NIKKE", "description": "<p>GODDESS OF VICTORY: NIKKE is an immersive sci-fi RPG shooter game, where you recruit and command various maidens to form a beautiful anime girl squad that specializes in wielding guns and other unique sci-fi weapons. Command and collect girls that have unique combat specialties to create your ultimate team! Experience next-level shooting action with simple yet intuitive controls while enjoying dynamic battle effects.<br />\nHumanity lies in ruins.<br />\nThe Rapture invasion came without warning. It was both ruthless and overwhelming.<br />\nThe reason: unknown. No room for negotiations.<br />\nIn what seemed like an instant, the earth was turned into a sea of fire. Countless humans were hunted down and slaughtered without mercy.<br />\nNone of mankind&#39;s modern technology stood a chance against this colossal invasion.<br />\nThere was nothing that could be done. The humans were laid to waste.<br />\nThose that managed to survive found one thing that gave them the smallest glimmer of hope: the humanoid weapons.<br />\nHowever, once developed, these new weapons were far from the miracle everyone needed. Instead of turning the tide, they only managed to make a minor dent.<br />\nIt was a complete and utter defeat.<br />\nHumans lost their homeland to the Rapture and were forced to live deep underground.<br />\nDecades later, a group of girls awakens in the Ark, mankind&#39;s new home.<br />\nThey are the result of the collective technological knowledge pooled together by all the humans driven underground.<br />\nThe girls board an elevator to the surface. It has not been operated for decades.<br />\nHumanity prays.<br />\nMay the girls be their swords.<br />\nMay they become the blade that enacts revenge for humanity.<br />\nBorn out of mankind&#39;s desperation, the girls head to the world above, carrying the hopes and dreams of the human race on their shoulders.<br />\nThey are code-named Nikke, a name derived from the Greek Goddess of Victory, Nike.<br />\nMankind&#39;s last hope for victory.<br />\n▶ Stand-out Characters with Distinctive Personalities<br />\nAlluring and extraordinary Nikkes.<br />\nWatch as character illustrations jump off the page and straight into battle.<br />\nPlay now!<br />\n▶ Featuring vivid, high-quality illustrations.<br />\nAdvanced animation and animated illustration with cutting-edge technology,<br />\nincluding the latest physics engine and plot-based auto motion-sensing controls.<br />\nWitness characters and images, unlike anything you’ve seen before.<br />\n▶ Experience The First-hand Unique Tactics<br />\nUse a variety of character weapons and Burst Skills<br />\nto take down the overwhelming invaders.<br />\nFeel the thrill of a brand-new innovative battle system.<br />\n▶ A Sweeping In-Game World and Plot<br />\nPlay your way through a post-apocalyptic tale<br />\nwith a story that offers both thrills and chills.</p>", "metacritic": null, "released": "2022-11-02", "tba": false, "updated": "2024-04-03T17:57:42", "background_image": "https://media.rawg.io/media/screenshots/95d/95d15374273a002840c7313144bb939f_ZA7Cc5Q.jpg", "website": "https://nikke-en.com", "rating": 4.29, "rating_top": 5, "added_by_status": {"yet": 1, "owned": 2, "beaten": 1, "toplay": 2, "dropped": 5, "playing": 8}, "playtime": 0, "achievements_count": 0, "ratings_count": 7, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 7, "platforms": ["Android", "iOS", "PC"], "developers": ["Level Infinite"], "genres": ["RPG", "Card"], "publishers": ["PROXIMA BETA PTE.LIMITED"], "esrb_rating": null}