{"id": 881378, "slug": "pocket-reality", "name": "Pocket Reality", "name_original": "Pocket Reality", "description": "Every day, a surreal new reality will be created just for you! Enter an open world where everyday objects come to life and you can play any way you want.<br/><br/>Maybe you're defending a cabbage moon from horse pirates. Maybe you're solving the murder of a wealthy spoon. Maybe you've always wanted to manage your own submarine farm, or date a strawberry? Maybe all of the above. The possibilities are endless!<br/><br/>Experience a daily procedurally generated text adventure that was never seen before and will never be seen again. Pocket Reality features a roguelite structure. Your choices have lasting consequences, danger is everywhere, and eventually you will be defeated and/or cause the world to be devoured. But don't worry: you'll start fresh tomorrow, and every defeat makes you stronger!<br/><br/>It's also a strategy game where you need to manage your loyalties to four factions, deciding whom to support and whom to oppose. The world is interconnected and full of conflict. Every character and location has a level that changes based on your actions or inaction. If you help someone increase their level, they'll produce resources over time and unlock new opportunities. But you can't help everyone at the same time...<br/><br/>Includes dozens of achievements and secrets to discover.<br/><br/>Play the complete game for free, forever, with no ads. Permanent in-app purchases are available to add a second world per day and, in the future, to unlock expansion content.<br/><br/>Accessible with VoiceOver.", "metacritic": null, "released": "2022-10-10", "tba": false, "updated": "2022-11-18T08:45:33", "background_image": "https://media.rawg.io/media/screenshots/729/7292e9fee99e5172b6f2727b1a21c2ca_vvFn4nN.jpg", "website": "https://jksgames.wordpress.com/pocket-reality/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 31, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["James Senter"], "genres": ["Adventure", "RPG"], "publishers": ["James Senter"], "esrb_rating": "Teen"}