{"id": 881437, "slug": "car-crash-compilation-game", "name": "Car Crash Compilation Game", "name_original": "Car Crash Compilation Game", "description": "Welcome to the new addition of offline car crash game with latest and new Car Crash Simulator 3D. Crash Testing Real Car is an astonishing idea in the world of Car Crash Simulator 3D - driving games where you are going to compete your rivals in car race. Do you love to play Car Crash 3D with Crazy Car Crashes and Jumps to become master of car stunt driving player? then this Extreme Car Crashes Compilation will give you fun of Jumps and Crashes experience. Put your hands on the steering wheel in this Car game and drive your sport car in this Car Crash Simulator 3D game. You can stunt with racing car to win the title of best racer in this kar wala game. Get behind the wheels of Car racing games to explore 3D car driving simulator and enjoy car stunt game against the racing rivals in Car Crash Simulator games.<br/>In Car Stunt challenges, multiple cars are available to win the car stunts race game 3d contest of car driving games. This Car Crash Simulator 3D game is a famous car driving games where the initial and final points are in a stadium that is full of thrill. Now Stunts challenge is starting, beware from the sharp turns because the real Stunts tracks are too dangerous. Start the engine of car race in this Car Crash Simulator 3D and dodge other car crash games to level up your skills. This car crash driving games is too fast so it may slip while turning from the car racing stunts 3d tracks and hit to the other racing rival in kar wala game. So, control the racing car in racing tracks with speed limit. Kar wala game have coins packs and speed booster to encourage the player to try new cars and complete new stunts challenge. Feel the best realistic physics of Car Crash Compilation in this amazing car crash game and win the car stunts challenge in car driving games: new car games.<br/>In this Simulation car racing stunts 3d, become a leading player of the car driving simulator. Best car driving simulator is made up of single-seat, open cockpit, open-wheel racing car games with substantial front and rear wings, and an engine positioned behind the driver, intended to be used in competition at top speed Car racing events. So you are going to jump into car stunts challenge with free kar wala game missions to involve into different stages of car stunt tracks. Enjoy the modern of sport cars in this new car games on the play store with car race game. Steering of motorsport car driving simulator is in your hand, check the fuel, tyres, steering wheel, and breaks in this racing car games for the best performance. Win the championship with car stunt in this amazing offline car racing game: new car games that is recommended for you.<br/>Recently we've added a new traffic racing game mode where you can drive car stunts simulation to get fun of offline Crash 3D car game within deserts, mountains, city and jungle environments of car racing stunts 3d. Get coins reward for car driving simulator multiple packs and pick booster in this racing game to enjoy formula car racing stunts 3d.<br/><br/>Top speed formula car racing game - new car games features:<br/>=&gt; Different maps for Extreme Car Crashes Compilation - driving car game<br/>=&gt; High-quality graphics of offline driving simulator of Car Crashes<br/>=&gt; Amazing stunt tracks in 3D car crash games<br/>=&gt; Multiple 3D racing car games selections<br/>=&gt; New modes of car driving simulation games<br/>=&gt; New endless stunt challenges<br/>=&gt; Realistic sounds of Extreme Car Crashes Compilation<br/><br/>Download and enjoy this Extreme Car Crashes Compilation. Give your feedback for future updates in Crazy Cars Ramp Jumps Crashes Fails Rollovers.", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-31T14:29:24", "background_image": "https://media.rawg.io/media/screenshots/f2d/f2dcc7fdc11550f56f5c2cc91b3c343e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 182, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android"], "developers": ["Zego Global Publishing"], "genres": ["Racing"], "publishers": [], "esrb_rating": "Everyone"}