{"id": 881466, "slug": "cries-of-the-wild", "name": "Cries of the Wild", "name_original": "Cries of the Wild", "description": "Overview\r\n<p>Journey on a grand creature collecting RPG adventure as you collect and battle Beastia in exciting tactical turn-based combat. </p>\n<p><strong>The game:</strong> <br/>Take the role of Astryn, a Beastia tamer; journey across the kingdom of Rohomend, discover new Beastia, meet allies, and uncover the truth behind the impending civil war. </p>\n<p><strong>Features:</strong> <br/></p>\n<ul><li><strong>Collect </strong>and tame a variety of creatures, each with their own elemental and strategic advantages. </li><li><strong>Battle </strong>trainers and wild Beastia across the kingdom in tactical turn-based combat. </li><li><strong>Explore</strong> the kingdom of Rohomend, journey across icy snowfields, up an active volcano and across lush grasslands as you get closer to finding out the truth. </li><li><strong>Discover</strong> a plot of betrayal, hope and vengeance as you find allies and face off against your enemies. </li></ul>\n<p><strong>Battle:</strong><br/>Deploy your team of Beastia in top-down arenas and partake in tactical turn-based combat. Strategize by using elemental affinities, terrain-based attacks, and a variety of skills to gain the upper hand and defeat your foes. Capture new Beastia, level them up and gain new, stronger skills to help give you the edge against your opponents.<br/><br/> </p>\n<p><strong>Story:</strong><br/> As you return to your homeland, Rohomend, you realize that things are quite different to when you left. While looking for opportunities for work you get swept up in the conflict between multiple factions of the kingdom. Forming an alliance with the rebellion who are fighting for peace, you uncover a rivalry that threatens to destroy the kingdom.</p>\r\nControls\r\n<p><strong>Over world</strong><br/></p>\n<p>WASD to Move<br/>Tab in the overworld to view monster stats<br/>Esc to open/close Save menu &amp; monster stats</p>\n<p><strong>Battle</strong><br/>C to open full info about selected Beastia<br/>WASD to move camera and E can be used to rotate abilities.<br/>Right Click to deselect ability.<br/>Scroll to zoom in/out<br/>F to open move menu<br/>Tab to open Inventory<br/>X to open switch Menu</p>", "metacritic": null, "released": "2022-11-18", "tba": false, "updated": "2022-11-18T10:19:02", "background_image": "https://media.rawg.io/media/screenshots/136/13673cd46e8ff42c50b281d266bacf9c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wuko"], "genres": [], "publishers": [], "esrb_rating": null}