{"id": 881413, "slug": "airport-simulator-first-class", "name": "Airport Simulator: First Class", "name_original": "Airport Simulator: First Class", "description": "From the creators of Airlines Manager Tycoon, Airport Simulator: First Class is a strategy, management and building game. As an airport CEO, your mission is to build and arrange interior and exterior areas, sign and manage partnerships with airlines, and control passenger flows and satisfaction.<br/><br/><br/><br/><br/>- The airport is a city in itself. You will need to build, arrange and modernize your airport infrastructure to receive your aircraft.<br/><br/><br/>- Devise your strategy and sign dozens of partnerships with airline companies, manage contracts and build your relationships.<br/><br/>- Your passengers are arriving from the city! Manage passenger flows from their arrival, offering them comfortable infrastructure and various stores to do their shopping. You will increase their spending and your profits. Will you be able to keep them satisfied? <br/><br/>- Control everything, from passenger inflows to air traffic control, check-in desks, security checkpoints, boarding gates, flight scheduling and aircraft boarding.<br/><br/><br/>BRING YOUR AIRPORT TO LIFE AND PERSONALIZE IT TO YOUR TASTE.<br/><br/>- Strategically arrange your airport infrastructure; build your terminals, including the apron, taxiway, runways, fuel stations, catering production sites, check-in desks, security checkpoints, boarding gates, passport control points, coffee shops, stores and more. You can also choose from a wide range of items to decorate your airport!<br/><br/>- Organize your airport to meet your passengers’ needs and improve your services to speed up processes, improve profitability and provide a greater level of comfort, which will have a knock-on effect on your relationships with partner airlines. The airport is like a whole city that needs to be managed!<br/><br/> <br/>DEVISE A STRATEGY AND MANAGE PARTNERSHIPS<br/><br/>- Decide on your airport strategy, striking a balance between low-cost and premium flights. Decide on flight types: regular and charter flights, short and medium-haul aircraft, and the possibility of opening general aviation routes.<br/><br/>- Sign partnerships to define the number of flights in your airport. Each time you sign for extra flights in addition to an existing contract, you strengthen your relationship with the partner airline.<br/><br/>- Build relationships: each flight will bring a signature bonus! Be careful, however, because if you sign too many flights and are unable to maintain them, you run the risk of damaging the relationship with your partner and losing the contract.<br/><br/>- Choose from among our 3D aircraft models to fulfil your contractual obligations.<br/><br/>- Define your schedule on a 24-hour basis, planning fights up to 2 weeks in advance.<br/><br/>FLEET AND PASSENGER MANAGEMENT<br/><br/>- Your passengers’ satisfaction level will affect your partnerships. Make sure your services, runways, flight scheduling, fleet and personnel are optimal to win points with airlines.<br/>- Consider factors such as the number of check-ins and lateness. How many passengers managed to board the aircraft?<br/>- Are you keeping to your schedule for take-offs and landings? Is the condition of your runway causing lateness? Are your passengers boarding and disembarking on time? <br/>- Have you efficiently scheduled your airport services (including refueling, catering and luggage handling)? These services can affect lateness in the schedule. Was your aircraft refueled on time? Did your catering service have enough trucks to make deliveries to each aircraft? Are your partner airlines satisfied with the services you have provided?<br/><br/>Build your airport and become the best airport CEO now!", "metacritic": null, "released": "2022-10-12", "tba": false, "updated": "2022-11-18T09:29:34", "background_image": "https://media.rawg.io/media/screenshots/624/62433bfddedd4cbfac734de610aba82e_uFpOet9.jpg", "website": "https://airportsimulator.first-class.io", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 260, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Playrion"], "genres": ["Strategy", "Simulation"], "publishers": ["Playrion"], "esrb_rating": "Everyone 10+"}