{"id": 881424, "slug": "survival-craft-creative", "name": "Survival & Craft: Creative", "name_original": "Survival & Craft: Creative", "description": "FEATURES:<br/>▪ Free CREATIVE MODE!<br/>▪ Daily pearl bonus!<br/>▪ 30 day x2 EXP booster!<br/>▪ Free customization pack — mustache, beards, hairstyles and Businessmen set!<br/><br/>«Hey, survivor! Watch out, shark is here!»<br/><br/>A terrible plane crash took the lives of all the passengers and crew... except for one. You a survivor and now you are out of civilization. Around the ocean, hot sun and hungry shark. An almost hopeless situation and a huge opportunity to die throw adrenaline into your blood. You have only one thing — craft for survive.<br/><br/>Survival simulator on the raft will throw you into an epic adventure in the middle of the ocean! Mankind and civilization far, beyond the boundless horizon. The main goal of the game is to hold out as long as possible alive, and for this you need to make crafting and building — gather resources, improve the raft and build a shelter right on the raft. Do not forget that thirst and hunger are not the only danger. Make sure that the shark attack does not destroy your plans for survival!<br/><br/>Survival Simulator<br/>Watch for indicators of health, hunger and thirst. Otherwise your adventure on the raft will quickly end!<br/><br/>Explore the recipe for crafting!<br/>Catch fish, grow vegetables and get water — do everything to survive! Create building materials, clothes, weapons, chests and other things necessary for survival.<br/><br/>Extract resources!<br/>Use the hook to catch the necessary resources: debris, algae, boxes and others. They will be useful to you for survival!<br/><br/>Build and improve!<br/>Spread, equip and protect the raft. Build a real shelter that will allow you to last as long as possible!<br/><br/>Our contacts:<br/>VK: https://vk.com/io__games<br/>FACEBOOK: https://www.facebook.com/groups/IOGamesDevelopment/", "metacritic": null, "released": "2022-03-11", "tba": false, "updated": "2022-11-18T09:44:12", "background_image": "https://media.rawg.io/media/screenshots/b01/b01d74e657587a653d12dfc6f60580a9_JWLsGLD.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Duhnich Dmitrij"], "genres": ["Adventure", "Simulation"], "publishers": ["Duhnich Dmitrij"], "esrb_rating": "Teen"}