{"id": 881432, "slug": "five-a-side-football-2023", "name": "Five A Side Football 2023", "name_original": "Five A Side Football 2023", "description": "Five a Side Football is back for 2023! Manage five a side versions of your favourite modern teams, and now you can take charge of early-90s clubs as well! Chase the league trophy with a title contender, turn a mid-table side into a championship challenger, or guide a struggling outfit to avoid relegation; the choice is yours. Whoever you choose, in whatever era, make sure you end each season in your target position or you’ll face the sack!<br/><br/>A brand new training system lets you upgrade your facilities and improve your players, alongside an aging system that means old players will retire and be replaced by new up and coming youth stars. This complements a simple transfer system that lets you build your dream squad of comedy-named players on your quest for title winning glory! All that doesn’t mean you’ll be bogged down in complicated and confusing spreadsheets; simply select five fit players, tell them whether to attack or defend, and you’re ready to go!<br/><br/>Complete with stylish player faces for every team and a simple, easy-to-use menu system; every football fan old or young can experience the joy of guiding their team to the glory of a league title!<br/><br/>- 20 current teams<br/>- 20 early-90s teams<br/>- 600 comedy-named players<br/>- New 2D match engine<br/>- Improve players via training<br/>- Transfer system<br/>- Simple tactics<br/>- Fun, fast football management!", "metacritic": null, "released": "2022-07-26", "tba": false, "updated": "2022-11-18T09:55:35", "background_image": "https://media.rawg.io/media/screenshots/811/8113bde77a35b9531b8ae396289e2a2e_P9Gxzmz.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Swipe Studios Interactive"], "genres": ["Strategy", "Sports"], "publishers": ["Swipe Studios Interactive"], "esrb_rating": "Everyone 10+"}