{"id": 881480, "slug": "solium-infernum-2", "name": "Solium Infernum", "name_original": "Solium Infernum", "description": "<p>Prepare yourself for Solium Infernum, the grand strategy game of politics, intrigue and betrayal, set in the ultimate arena of Hell.</p>\n<p>As a powerful fallen Archfiend, sinister overlords of the Infernal Kingdom of Hell, you are a contender for the Infernal Throne - the Great Dark Majesty is missing and the feverish Conclave demands a replacement declared. Command dread legions, enlist champion praetors, cast sinister rituals, and outplay your rivals to become Hell’s new Dark Majesty.</p>\n<p>Solium Infernum is a simultaneous turn-based political strategy game for up to six players that requires nerves of steel and a heart of darkness. Put your mind - and your friendships - to the test.<br />\nIn your path to victory stands the hellish red tape of Pandaemonium, Hell’s capital, and its Infernal Conclave. You’ll need to deftly navigate the Conclave’s labyrinthine political systems that govern and control the Fallen, whilst avoiding the insidious plots of your fellow Archfiends.<br />\nEvery order you give will have a lasting consequence, and Solium Infernum’s simultaneous turn structure will force you into the minds of your rivals, second-guessing both their moves and your own.</p>\n<p>Play as one of eight powerful, sinister Archfiends, High Demon Rulers of the Great Houses of Hell, as they vy for control of Hell’s capital, Pandaemonium.<br />\nPainstakingly crafted, each Archfiend has their own unique powers and demonic assets - strongholds, legions and champion praetors - at their bidding.<br />\nPlay a game of politics, master powerful sorceries, or become a wrathful warmonger. Use Events, Rituals, Diplomacy and Schemes wisely, as you make your choices and specialise your play style with Power trees that unlock dark powers.</p>\n<p>Play intense multiplayer games of deceit and politics in a single session, or enjoy Solium Infernum’s infamous asynchronous multiplayer for a truly harrowing scheme-in-your-sleep experience.<br />\nAsynchronous multiplayer delivers the depth of Grand Strategy and a diabolical conquest for the Throne of Hell in an accessible format, delivered in 5-15 minute bursts over multiple days or even weeks long with your (soon to be ex-) friends.<br />\nShow the underworld who is the most powerful, cunning, and infamous Archfiend of them all.</p>\n<p>Prepare for a striking vision of Hell unlike anything you’ve seen before, a truly twisted mindscape of the Underworld.<br />\nSolium Infernum is an infernal feast for the eyes with over 150 individual dark paintings to enjoy.<br />\nLoG’s acclaimed aesthetic signature is on full display as you navigate the pathways of the pit, and contend with its surreal denizens.</p>\n<p>Originally inspired by Milton’s epic poem, Paradise Lost, League of Geeks’ (known for seminal digital board game Armello) sophomore title is a re-imagining and modernisation of Vic Davis’ critically acclaimed cult-classic of the same name, hailed as a masterpiece of strategy game design.</p>\n<p>Once again, prepare to lose yourself within ‘the cold glory of a difficult decision’ as we resurrect Solium Infernum from the depths of Hell.</p>\n<p>Note: The following quotes refer to the original Solium Infernum (2009) by Vic Davis.</p>\n<p>“Solium Infernum is a political wargame set in hell… The game is now finished, and none of the friends survived. By which I mean, we all hate each other now.”<br />\n- Rock Paper Shotgun</p>\n<p>“It’s a game about playing other people, in both senses of the word…. This is game design based on psychology as much as rules.”<br />\n- Quarter to Three</p>\n<p>“More than any game I&#39;ve played in years, Solium Infernum nails the sensation of staring at a screen and losing yourself in the cold glory of a difficult decision.”<br />\n- Game Developer (formerly Gamasutra)</p>\n<p>“Solium Infernum kicked my knees out from under me ... this game took my past experience with strategy games and threw it, like a pro basketball player, into a bin eighty feet away.”<br />\n- Eurogamer</p>\n<p>“One of the best games of the year.”<br />\n— Three Moves Ahead</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-11-18T10:25:16", "background_image": "https://media.rawg.io/media/screenshots/570/57030323f45a7638cbe7bf4a911f0426.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 1, "reviews_count": 0, "platforms": ["PC"], "developers": ["League of Geeks"], "genres": ["Strategy"], "publishers": ["League of Geeks"], "esrb_rating": null}