{"id": 881537, "slug": "once-human", "name": "Once Human", "name_original": "Once Human", "description": "<p>The apocalypse changed everything. Human, animal, plant… all are infested by an alien creature – Stardust. As a Meta-Human, you can survive the contamination and use the power of Stardust. Play alone or join others to fight, build and explore. When the world is in chaos, you are our last hope.<br />\nSurvive in the wilderness<br />\nYou wake up in the middle of nowhere. You&#39;ll have to brace yourself for the cruelty of nature (from monsters to lack of food); however, Stardust&#39;s influence does not restrict to living things, it also affects the soil and water. Eating polluted food and drinking dirty water will reduce your Sanity. When your Sanity drops, your max HP would drop accordingly. To eat or not to eat, it&#39;s a question.</p>\n<p>Fight against monsters<br />\nBattle numerous enemies that are once human, and challenge bosses from another dimension to gain powerful items and ease Stardust pollution. You are not only fighting for yourself, but also fighting for the survivors.</p>\n<p>Customize weapons<br />\nWith about 100 gun blueprints divided into seven categories for you to collect and craft, every loot grants you something new. Did I mention accessories and gun perks? Right, they are the heroes here. If our current weapon cannot satisfy your need, you can add different parts and perks, upgrade your firearm to your heart&#39;s content.</p>\n<p>Build territory<br />\nUse Territory Core to build a house of your own. You can keep a practical style, jamming everything needed in a small room; or you can design a townhouse with a patio, kitchen, garage… The best part is, you can relocate your territory any time you want!</p>\n<p>Find out the truth<br />\nDelve into the truth of Stardust, find out where it came from, and what it wants. In the journey of seeking truth, you may feel alone, but you are never alone. There are several factions in the world, some can be violent and hostile, others might be friendly and helpful. Explore human settlements to learn their stories or exterminate bosses without leaving a name for survivors to praise, the choices are yours.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-08-26T06:21:25", "background_image": "https://media.rawg.io/media/screenshots/334/334131e9a9ea97c7e10f92a92798f36f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 10}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 501, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Starry Studio"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}