{"id": 881509, "slug": "the-repair-house", "name": "The Repair House", "name_original": "The Repair House", "description": "<p>Run your own repair house in a relaxing repair and restoration game from the original creator of PC Building Simulator.<br />\nUnlock new equipment &amp; tools, and customise your workshop to make it your own.<br />\nDiscover a range of unique items to repair and restore, including musical instruments, arcade cabinets, antiques, toys and more; each accurately recreated to give you the full restoration experience.<br />\nExperience the satisfaction of cleaning old, worn-down items to a bright shine. Sandblast rust away to reveal gleaming metal. Paint your items however you wish with custom painting tools.<br />\nExplore barns, flea markets, auction houses and storage units to find hidden items and haggle for the best price.</p>\n<p>It&#39;s your repair house<br />\nSet up your repair house just the way you like it. Layout your tools, unlock new equipment and expand the space to open up new restoration opportunities.</p>\n<p>Take apart and build back up<br />\nMeticulously disassemble each accurately detailed item, locating individual components, removing the pieces, and carefully reassembling. Learn the restoration process, plan your execution, and perfect your craft.</p>\n<p>As good as new… or even better!<br />\nWash away the dirt to restore the shimmer and shine to items as they have never been seen before. Feel the satisfaction as you sandblast away old paint from industrial antiques to reveal new gleaming metal below.</p>\n<p>Let the paint and the creativity flow!<br />\nGet creative with the painting station. Colour, spray, stamp, and stencil your newly restored items however you wish. Add your own personality with a wide variety of customisation options. Add lighting effects, stickers, and special components to give your restoration that extra flair</p>\n<p>Restoration and Chill<br />\nKick back after a long day of restoring in your own personalised repair house. Browse the large decoration library to find the right accessories for you. Show off your newly restored items in personalised display cases.</p>\n<p>The wide world of restoration<br />\nExplore old barns for rare items to restore, search high and low for keys to unlock special chests, and haggle with the barn owner for the items you discover.</p>\n<p>Take a chance and bid for abandoned storage lots with mystery contents. Figure out what they have to offer from the outside only. Will you end up with far more than you paid for… or far less?</p>\n<p>Find hidden gems in the flea market and restore them for a hefty profit. Many items will be missing pieces, can you find what is needed in other locations or on other jobs?</p>\n<p>Bid for unique items at the auction house. Can you outbid your competitors to get the last piece needed to complete your collection?<br />\nSYSTEM REQUIREMENTS</p>", "metacritic": null, "released": null, "tba": true, "updated": "2023-09-08T05:26:06", "background_image": "https://media.rawg.io/media/screenshots/db0/db0653c28b32550b7722515bdd021e87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 227, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Claudiu Kiss", "QUANTUM LOGIC GAMES"], "genres": ["Adventure", "Simulation"], "publishers": ["Fireshine Games"], "esrb_rating": null}