{"id": 88160, "slug": "karmarun", "name": "KarmaRun", "name_original": "KarmaRun", "description": "Enjoy the adventures of Rubius, Mangel, aLexBy, Willyrex, Vegetta777 and sTaXx in first person!<br/><br/>KarmaRun will be the official game of the Club Media Fest second edition which will reunite the top LATAM and spanish youtubers. <br/><br/>http://www.clubmediafest.com/<br/><br/><br/>Jump, slide, dodge and destroy all the obstacles with three of the most popular video game youtubers!<br/><br/>Guide Rubius, Mangel, aLexBy, Willyrex, Vegetta777 and sTaXx by worlds filled with traps and enemies and test your reflexes: broken boxes, burst ice blocks, jump spiked traps, dodge fireballs, end dragons using your bow and arrows to reach as far as possible in this endless runner.<br/><br/>Prove you're the best of your friends, collect all the gold bars, get all the diamonds and beat your high score!<br/><br/>- Seven characters await you. A wizard and six of the best spanish youtubers: Rubius, Mangel, aLexBy, Willyrex, Vegetta777 and sTaXxx<br/>- Defeat a wide range of enemies, skeletons, spiders, zombies and incredible dragons.<br/>- Six different stages full of obstacles: prairie, snow, forest, lava, space and Candy Land<br/>- Over 40 levels with ranks and exclusive rewards<br/>- Up to 120 available missions<br/>- Collect mystery boxes and find rewards<br/>- Collect power-ups and upgrades to increase your final score<br/>- Very simple touch controls: move left to right, jump, slide, swing, tap to launch an arrow<br/>- And exclusive 3D graphics!<br/><br/>Karma Run is available in English and Spanish.", "metacritic": null, "released": "2014-12-30", "tba": false, "updated": "2019-07-30T14:04:03", "background_image": "https://media.rawg.io/media/screenshots/0b3/0b3975fc47b7ca5257c83bdfd1654506.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 184, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["U-Play Online"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["U-Play Online"], "esrb_rating": "Everyone 10+"}