{"id": 88163, "slug": "golf-daysexcite-resort-tour", "name": "Golf Days:Excite Resort Tour", "name_original": "Golf Days:Excite Resort Tour", "description": "Compete world's golfers and score free!<br/><br/>\"Orthodox golf game, but controls are very simple!<br/>Your opponents will be displayed in multi-window! <br/>It'll make you feel that you're actually there!<br/>Aim world's top golfer by playing online tournaments!\"<br/> <br/>-Orthodox 3D golf game with easy control!<br/>Power cursor and spin window will forecast ball's course and falling spot.<br/>You can check the field's relief and green's slope too! <br/> <br/>-Correspond multi-window<br/>Your opponent's stroke will be displayed anytime.<br/>By watching their play, it'll give a presence that you're actually playing together.<br/> <br/>-Enjoy various game modes<br/>World Tournament: Tournament that you can compete with golfers around the world everyday!<br/>Match Play: You can enjoy match with opponent that fits to your level. <br/>Tournament: 6 round tournaments that is eligible to join. Let's conquer all rounds!<br/>Practice: You can play all holes alone or with 3 people free.<br/> <br/>-Customize your status free!<br/>You can customize your character free! <br/>Upgrade your favorite status that fits to your play style!<br/> <br/>-Use items to upgrade your character more!<br/>There are items that'll support you: A ball that extends flying distance, golf club set that raise control, etc.!<br/>Use these items wisely to extend your strategies!<br/> <br/>-Change wear and create your own character!<br/>We've prepared various types of wears, accessories, hair style, and hair color in this game!<br/>Let's make your own character and boast it to world!<br/> <br/>-Application Info.<br/>Compatible devices：iOS 8.0 or later<br/>Price: Free (There are some pay items)          <br/>-Please check User Policy before you use it.<br/>-iPhone is a trademark of Apple inc., registered in the U.S. and other countries<br/>-These descriptions will may be changed without notice.", "metacritic": null, "released": "2016-09-16", "tba": false, "updated": "2019-07-30T14:47:58", "background_image": "https://media.rawg.io/media/screenshots/950/95073eccac32dc3a62726d4804c75bc2.jpg", "website": "http://www.pascal.jp/en/games/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["pascal"], "genres": ["Simulation", "Sports"], "publishers": ["pascal"], "esrb_rating": null}