{"id": 881735, "slug": "tank-time-demo", "name": "Tank Time (demo)", "name_original": "Tank Time (demo)", "description": "<p>Beat enemy’s and get points to spend on upgrading your tank so you don’t lose! The     enemy’s get stronger and angrier every round so be careful what you buy!<br/><br/></p>\n<p> This game is a top down round based shooter where each round you get a point to spend on upgrades, power ups, or super upgrades which cost lots but there overpowered.<br/></p>\n<p>Beat enemy’s and don’t die!</p>\n<p><strong>CONTROLS</strong><br/>WASD or joystick </p>\n<p>The tank will face towards the mouse</p>\n<p>On mobile you tank faces the opposite direction of where your moving (trust me this makes it LOTS easier)</p>\n<p><strong>Tips and tricks<br/></strong>Power ups are helpful but using too much early game can make it so you don’t have enough stuff upgraded late game<br/>You get one point per round<br/>Supers cost 5+supers bought<br/>Use the in game tutorial for some reason everyone I showed this to did not and they were confused because they did not use the tutorial </p>\n<p><strong>NOTE</strong><br/>this is only a demo! The final game will have TONS more features like the final secret super tons more enemy’s different difficulty’s and more!<br/><strong><br/>FULL GAME RELEASE DATE</strong>the full game is planned to be released around Christmas but no promises, I am only one developer trying to make this huge game so if it gets delayed please don’t be mad</p>", "metacritic": null, "released": "2022-11-17", "tba": false, "updated": "2022-11-18T12:48:12", "background_image": "https://media.rawg.io/media/screenshots/4b9/4b97e068adc66777d6f45283898c447e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Puzzlemonkey720"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}