{"id": 881714, "slug": "don-duality", "name": "Don Duality (itch)", "name_original": "Don Duality (itch)", "description": "\n<p>Don Duality is a tycoon game with card mechanics. Send your gangsters to beat out debts, rob banks, steal valuables and launder the money they earn in your establishment. Hire staff for your restaurant and upgrade it, but be careful! Not many people can sit on two chairs at once, especially when they have police on their tail.</p>\n<p><strong>Key Features:</strong></p>\n<p><strong>Lead a Mafia organization</strong></p>\n<p>Most of your subordinates will be Gangsters. Send them on a variety of criminal activities. Rob banks, beat money out of debtors, intimidate cops.</p>\n<p><strong>Manage your restaurant</strong></p>\n<p>Your restaurant will expand and improve. Buy extra tables to seat everyone who wants to visit your establishment. Advertise to increase popularity and invite as many people to your place as possible. But remember, the more people your restaurant attracts, the more staff will have to be hired to serve them.</p>\n<p><strong>Launder your money </strong></p>\n<p>At the beginning of each day you will have to consider the amount of money laundered through the restaurant. The richer you are, the more the police will be interested in your business. Once the police concern is maxed out, you will be arrested.</p>\n<p><strong>Watch for random events</strong></p>\n<p>Be careful when discarding cards. Some of them are marked with a little bell. When such cards appear in your hand, the events get added up to the matching bell's progress bar. Once an event is triggered, it will seriously affect your business.</p>\n<p>       </p>", "metacritic": null, "released": "2022-11-17", "tba": false, "updated": "2022-11-18T12:37:09", "background_image": "https://media.rawg.io/media/screenshots/b59/b59554ec1922049e9fa451995b423281.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["donduality"], "genres": [], "publishers": [], "esrb_rating": null}