{"id": 8817, "slug": "egypt-legend-temple-of-anubis", "name": "Egypt Legend - Temple of Anubis", "name_original": "Egypt Legend - Temple of Anubis", "description": "&amp;#39;Egypt Legend - Temple of Anubis&amp;#39; is a marble shoot out, match 3 game with the Egyptian theme. It is easy to play, but truly addictive. <br/>Your goal is to clear all the marbles before they reach the end of the path, and meanwhile, achieve Combos, Chains and Gaps as many as possible to get the highest score.<br/>How to play:<br/>1. Touch the area of the screen where you want to shoot.<br/>2. Group 3 or more identical marbles together to clear them.<br/>3. Swap the shooting marble by touching the marble emitter.<br/>4. Achieve Chains by clearing marbles continuously using shooting.<br/>5. Achieve Combos by clearing marbles continuously using attracting.<br/>6. Achieve Gaps by clearing distant marbles using shooting.<br/>7. Get a higher score by achieving Combos, Chains and Gaps as many as possible.<br/><br/>Features:<br/>1. Very Easy to Play - Suitable for all age groups.<br/>2. Large variety of Beautiful Scenes - 5 different scenes with 180 well designed levels!<br/>3. Flexible Gameplay - This game contains the gameplay of the original game and the Loxur series, which will offer you more fun.<br/>4. Attractive Props - Lightning ball, multicolor ball and more interesting props are available.<br/>5. Growing System – You may reduce the difficulty level by upgrading the marbles with coins you earned in the game.<br/><br/><br/>------------------------------<br/>Try other awesome games by Cat Studio<br/>------------------------------<br/>&amp;quot;Little Commander - World War II TD&amp;quot; - A TD game with very cute visual style.<br/>&amp;quot;Soldiers of Glory : World War 2&amp;quot; - Act as the Allied commander and win the WWII!<br/>&amp;quot;Soldiers of Glory : Modern War&amp;quot; - A TD game that enemies could attack you back!<br/>&amp;quot;Epic Defense - the Elements&amp;quot; - A TD game with war3 visual style.<br/>&amp;quot;Epic Defense 2 - Wind Spells&amp;quot; - the second work of Epic Defense series, more new elements! more new towers!<br/>&amp;quot;Galaxy Wars Defense&amp;quot; - A Space Sci-Fi TD with Stunning Graphics and Super Big Maps!<br/>&amp;quot;Alien Must Die&amp;quot; - A TD game with SC2 style. The gameplay very like Defense Grid<br/>&amp;quot;Marble Blast - Zodiac&amp;quot; - Another very good Marble shooting game, and you can draw your custom levels!<br/>------------------------------<br/>Cat Studio&amp;#39;s Facebook Page: https://www.facebook.com/CatStudioGames<br/>Cat Studio&amp;#39;s Tiwtter: https://twitter.com/CatStudio_Games<br/>Cat Studio&amp;#39;s Youtube Channel: https://youtube.com/CatStudioGames<br/>------------------------------", "metacritic": null, "released": "2013-03-25", "tba": false, "updated": "2019-10-22T14:30:07", "background_image": "https://media.rawg.io/media/screenshots/6e6/6e60482eb38619c2e87350c5c934bbd1.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Yongcheng Qi"], "genres": ["Arcade", "Puzzle"], "publishers": ["Yongcheng Qi"], "esrb_rating": "Everyone 10+"}