{"id": 881887, "slug": "squares-online", "name": "Squares Online", "name_original": "Squares Online", "description": "<p><strong>Squares is an online multiplayer game where your goal is to get all 3 of your dots into the other players base. Roll the dice to get your steps and move either yours or your opponents dots around the board.</strong></p>\n<p>There is no matchmaking so make sure you have a friend to play with!</p>\n<p><strong>How To Setup:</strong></p>\n<ol><li>Set your username and either create a new room, or join an existing room, using a room name.\r\n</li><li>Before play starts select your colour using the left and right buttons.\r\n</li></ol>\n<p><strong>How To Play:</strong>\n</p>\n<p>At the start of your turn, click the dice at the top of the screen. This will give you how many moves you can make this turn. In your turn you can either move any of your pieces, or any of your opponents pieces that are currently not in a base. Move all of your pieces into your opponents base to win!</p>\r\nArrow KeysMove Pieces<br/>Left Mouse ButtonSelect Piece / Roll Dice Button\r\n<p>I made this game several months ago but was waiting for a package update so I could build the game as WebGL to avoid having players to download. It was done as a test to see if I could set up a turn based online game so the gameplay isn't super rich, but it's kinda fun to play with friends for a short bit.</p>\n<p><strong>If you enjoy the game or find any bugs/issues let me know below!</strong></p>", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2022-11-18T13:54:01", "background_image": "https://media.rawg.io/media/screenshots/fd0/fd04062ef94e71e885210908baa5263e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Evan Williams"], "genres": [], "publishers": [], "esrb_rating": null}