{"id": 882058, "slug": "figures4d", "name": "Figures4D", "name_original": "Figures4D", "description": "<p>Made this little thing to show kids the 4th dimension as we would see it -- now uploaded here for you delight! </p>\n<p>Do all the things you could do in real life: move around, rotate, elevate or sink yourself, and more; This time along 4 orthogonal axes. </p>\n<p>If you need a little context...<strong> (nerd stuff ahead)</strong></p>\n<p>The way I went about making this was by using Ray-Marching. Ray-Marching is a rendering method that employs a Signed Distance Function that calculates the distance between the camera (you) and the scene (the shape, in this case). If the SDF is made to take into account 4 axes instead of the usual 3, it will visualize shapes as seen on the program (four dimensions, baby!!)<br/></p>\n<p>The logic behind what is put on the screen follows the Cross-Sections analogy as described by Edwin Abbott in his novel \"Flatland: A Romance of Many Dimensions\". Basically, if 2D beings were to observe a 3D object move through the flat plane they live in, they would only see a two-dimensional cross section of it at any given time (picture: apple slices, or an MRI scan -- a 2D being would only see one slice at a time, changing in shape and size as the object moves and rotates. A diagonal cut of an apple looks different from a horizontal cut!). Following such logic, if a 3D being was to observe a 4D object moving through its space, it would only see a three-dimensional cross section of it at any given time.  That's it, really. Now you know how to spot a 4-dimensional being! Congrats!</p>", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2022-11-18T15:02:51", "background_image": "https://media.rawg.io/media/screenshots/916/916074c19dd239bbd5d36923465afa07.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["GreemJ"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}