{"id": 882158, "slug": "sphere-gatherer", "name": "Sphere Gatherer", "name_original": "Sphere Gatherer", "description": "<p>Hello everyone !</p>\n<p>Here's a little school project I had to wrap up for today (prototype). It's under development, so I apologies in advance for the glitches / errors it may have. But I learned A LOT of cool things while working on it, such as :</p>\n<p>- Audio / sound<br/>- Character controller<br/>- Terrain<br/>- AI (NasMesh, etc)<br/>- Animation (rigging on <br/>Mixamo &amp; Unity's animator system)<br/>- More C# x Unity stuffs for scripting<br/>- How to make objects explode (a cube here)<br/>- Boids again<br/>- UI<br/>- URP (for my spheres)<br/><br/>Of course I need to improve all of these, and I wish to learn how to make a state machine too and how to optimize things (such as my camera with my animations, my scripts overall, etc). <br/><br/>You can find the english readme inside the .zip file (it's a PDF), and I really hope you'll like it. It's not much, but it's quite cool for a third time making a game ! <br/>(⌒ω⌒)♫<br/></p>\n<p>If you see the name 'panda' around, it's because of the class's first project was to make a panda character in Unity xD and I named it like that when I first started working on it. I've also left some screenshots including a piece of my 'explosion' script (not whole, but you can see all my scripts and work via my GitHub here :</p>\n<p> https://github.com/makazemafuu/SphereGatherer ~<br/></p>", "metacritic": null, "released": "2022-11-15", "tba": false, "updated": "2022-11-18T15:46:35", "background_image": "https://media.rawg.io/media/screenshots/2cc/2cc4c4f36f6d909fb19a0b61333790f6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["makazemafuu"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}