{"id": 88211, "slug": "road-construction-build-city-for-heavy-traffic-3d", "name": "Road Construction: Build City for Heavy Traffic 3d", "name_original": "Road Construction: Build City for Heavy Traffic 3d", "description": "Top free road construction and simulation game:<br/>Play this road construction and build city game. It is most amazing and free construction game of 2017. The game is for those who love to build and reshape the things. It is free on your devices. Put your parking and driving skills in this road construction and city building game. Once you try our top road construction and city building game you will be hooked within minutes because it includes best HD sound effects high realistic environment 3d graphics with reliability and realistic controls as compared to the other top 2016 and 2017 free games.<br/><br/>The main purpose of the game is to provide adventure and thrill to the player through city construction. Construct with the help of construction vehicles and construction cars. Use your racing and constructions skills to become a master and top ranking construction engineer in bridge, city and road. Break your own records along the highway while playing this Road Construction and Build City games. It will give you the perfect understanding of deep things of the city builder and construction tracks.<br/><br/>Super city builder and bridge builder:<br/>Play and become a super bridge builder and city builder constructor while working on the heavy duty rollers. One of the hard goals of it is to build the bridge between the rivers or lakes and join the city. Being the part of the city building projects and make a construction plan on traffic roads. Just download this road construction game and connect these cities via crane and trucks.  Building a city highway and road construction is a realistic and top new construction simulation adventure. A builder game which is developed for those who love to construct and build. The game includes amazing things such as construction of car parking with reliable construction contractor.<br/><br/>Drive heavy construction machines:<br/>Here the construction vehicles or construction heavy machine simulator with construction tools such as haul truck and cement truck have been waiting for you. You will enjoy the realistic dynamic 3D graphics that will give you the feelings that you are working in the real life. Test your driving and park skills for different construction crazy machines such as road rollers, excavator and dump truck with crane simulator. Bulldozer and heavy truck is needed for development of new and already existing busy roads. Flexible and realistic controls of the game make this game perfect for you. Can you transport the steering wheel of different heavy vehicles? Even if you do not know how to handle or operate you can easily learn how to operate different heavy construction machines like heavy trucks, road diggers and wheel loaders. Dumper trucks and rollers are also used. Some other heavy lifting machines which are used for lifting heavy objects overhead such as lifters, elevators and excavators. Cranes and tractors which are big rig heavy machinery are also be valuable.<br/><br/><br/>Road Construction Build City Key Features:<br/><br/>- Build multiple construction car parking<br/>- 25 best construction vehicles<br/>- More than 168 construction heavy tools and equipment<br/>- Very hard heavy crane handling and truck driving <br/>- Improved 3D Graphics <br/>- Super duper realistic sound effects. <br/>- Real-time physics controls for driving heavy vehicles and truck simulation <br/>- Challenging missions with time frame <br/>- Smooth game play and control.<br/><br/>Your feedback is very important to us! Please help us to improve by leaving us your rating and comments. Let’s make together amazing and awesome mobile games.<br/><br/>We are on facebook and more - find us on your favorite networks to hear about our newest games and other interesting news updates: <br/><br/>Facebook:  https://www.facebook.com/plasmagame/", "metacritic": null, "released": "2017-07-06", "tba": false, "updated": "2019-10-22T14:21:02", "background_image": "https://media.rawg.io/media/screenshots/7f7/7f783d61904b50b8f4522ed7d4ef5533.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 183, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayyab Mahmood"], "genres": ["RPG", "Simulation"], "publishers": ["Tayyab Mahmood"], "esrb_rating": "Everyone 10+"}