{"id": 882214, "slug": "founding-letters-from-the-past", "name": "Founding letters from the past", "name_original": "Founding letters from the past", "description": "<p><strong>The game depicts the narrative of a scavenger who comes upon a letter from the \"Ancients\" in a cyberpunk world where information has been monopolised and is moved by the letter's statement of the \"meaning of existence.\" To discover the remainder of the letters and answer his questions, he embarks on a trip to find them, encountering many hurdles along the way, and gradually awakens from his numbness by thinking on his past and present life, finally going on a road of resistance.<br/></strong></p>\n<p><strong>Idea for Creation</strong><br/>The game is based on the contemporary cyberpunk fad, and it blends the perplexity of the future and the thinking of today's grownups with the narrative of a \"cyber scavenger\" in a distant future who mimics today's attitude. The concept of \"letters\" is addressed in two ways throughout the game: Unlike typical card games, the player employs \"messages\" as weapons to kill foes; the scenario focuses around a series of \"letters\" that were \"created in ancient times and delivered to the cosmos.\" The tale centres around a series of \"letters\" that were \"born in ancient times and given to Neon,\" revealing a simple yet amazing story of a fight for meaning.\r\n</p>\n<p><strong>Playing Instructions</strong><br/>This game is an extension of the \"letters\"-themed turn-based card game. Instead of playing cards, participants must mix the basic parts of the online world - binary zeros and ones - to transmit information. Despite the fact that there are only two versions, binary information is incredibly scalable, and given the intricacy and difficulty for the player to recall, just 4-byte pairs are necessary inside the game. In summary, the player will mix and combine the four bits of 0 and 1 to create 16 various talents and improvise based on the type of adversary, eventually defeating them.\r\n</p>", "metacritic": null, "released": "2022-11-15", "tba": false, "updated": "2022-11-18T16:10:42", "background_image": "https://media.rawg.io/media/screenshots/8aa/8aa80bccca24f588715c5d34589f2001.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lynnnnnnnnn"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}