{"id": 88228, "slug": "lets-play-mini-golf-2016", "name": "Lets Play Mini Golf 2016", "name_original": "Lets Play Mini Golf 2016", "description": "Experience the most authentic and realistic miniature golf game available in market. Let’s Play Mini Golf 2016 is the most realistic miniature golfing game with amazing 3D mini golf courses and scenes. Lets Play Mini Golf 2016 is equipped with realistic golfing controls to give ultimate mini golfing experience to user. Feel the excitement of every golf hit with accurate touch controls now. It is very easy to play. Show your master skills of golf. Standard Game scoring rules apply on this game.<br/>Game Stages:<br/>Lets Play Mini Golf 2016 has best mini golf environments and scenes. Lets Play Mini Golf is loaded with 5 stages.<br/><br/>1. Space Orchard <br/>2. Down Town<br/>3. Beach<br/>4. Snow Valley<br/>5. Cartoon Land<br/><br/>Each stage is consists of 100 mini golf gaming levels.<br/><br/>Game Features:<br/>- User friendly control. Power Bar to control the speed of ball throw &amp; controlled by touching hit button.<br/>- Can change the direction of ball shot by swiping Left / Right on SCREEN<br/>- Can ZOOM IN/ZOOM OUT by swipe up or down<br/>- Nice background music.<br/>- Excellent Graphics &amp; Environment.<br/><br/>How to Play:<br/>Swipe on screen to adjust direction of golf ball (left or right). Tap on HIT button to set force on ball and tap Hit button again to release the ball. Pot the ball with in Par limits to complete levels. If you failed to pot ball with in Par limit, it will result in level failed.", "metacritic": null, "released": "2016-02-10", "tba": false, "updated": "2019-10-22T14:21:02", "background_image": "https://media.rawg.io/media/screenshots/0d0/0d00c741d511e3ab4f8718b3fad80f6b_Z8p1vtC.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 114, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Taha Nadeem Wasti", "Syed Hassan"], "genres": ["Sports"], "publishers": ["Syed Taha Nadeem Wasti", "Syed Hassan"], "esrb_rating": null}