{"id": 882334, "slug": "home-the-idolmster-fangame", "name": "HOME - THE iDOLM@STER fangame", "name_original": "HOME - THE iDOLM@STER fangame", "description": "Notice : There are Jump Scare in this game. Please refrain from playing if you are weak heart.<br/>이 게임에는 점프 스케어가 있습니다. 심약자는 플레이를 자제해 주세요.\r\n<br/>Introduction 소개\r\n<p>Haruka, who found the producer making love with other idol, chase the producer. If Haruka catches you, you'll definitely be in a terrible situation. You have to run away from here to live...<br/></p>\n<p>프로듀서가 다른 아이돌과 사랑을 나누는 모습을 발견한 하루카가 프로듀서를 쫓아옵니다. 하루카에게 잡히면 끔찍한 꼴을 당할 것이 분명합니다. 살려면 여기서 도망쳐야만 합니다...</p>\n\r\nFeatures 특징\r\n<ul><li>It's good to enjoy it lightly for a while with a simple rule and a short play time.</li><li>Harukasan, Chihyaa, Yukipo, and many other puchidols travel around the map to create unexpected results such as blocking your way.</li><li>Let's play hide-and-seek with Yandere Haruka, who can feel the uncanny valley!</li></ul>\n<ul><li>간단한 플레이 방법과 짧은 플레이 타임으로 가볍게 잠깐 즐기기 좋아요.\r\n</li><li>하루카씨, 치햐, 유키뽀 등 여러 푸치돌이 맵을 돌아다니며 당신의 길을 막는 등 예상하지 못한 결과를 만들어냅니다.\r\n</li><li>불쾌한 골짜기가 느껴지는 얀데레 하루카와 죽음의 술래잡기를 해보아요!</li></ul>\n\r\nTips 팁\r\n<ol><li>At least one of the four keys scattered across the map is the real key. So if all three keys are wrong, then the last key is the right key.</li><li>Talk to Miurasan. then, Miurasan will teleport you to one of the many designated locations.</li><li>Haruka doesn't stop even when choosing the key at the exit, so you have to widen the distance with Haruka before matching the key.</li></ol>\n<ol><li>맵에 흩어져있는 4개의 열쇠 중 <strong>최소 1개 이상</strong>은 진짜 열쇠입니다. 따라서 3개의 열쇠가 다 틀린 열쇠라면 마지막 열쇠는 무조건 맞는 열쇠입니다.\r\n</li><li>미우라씨에게 말을 걸면 미우라씨는 당신을 지정된 여러 장소 중 한 곳으로 순간이동시킬 것입니다.\r\n</li><li>출구에서 열쇠를 고를 때도 하루카는 멈추지 않으니 하루카와 거리를 벌린 뒤에 열쇠를 맞춰야만 합니다.</li></ol>Donate 후원<p>Your donation is used for buying food and helps me continue to make games!</p><p>후원금은 제 식비로 사용되며 제가 계속해서 게임을 만드는데 도움이 됩니다!<br/>만약 한국인이시다면 아래 계좌를 통해 후원을 해주실 수 있습니다.</p><p>토스뱅크 190852893557<br/>예금주 Vai43</p>", "metacritic": null, "released": "2022-11-15", "tba": false, "updated": "2022-11-18T17:02:13", "background_image": "https://media.rawg.io/media/screenshots/a40/a40d5aded5dbe3a73206b0990c73a579.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 81, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vai43"], "genres": [], "publishers": [], "esrb_rating": null}