{"id": 88238, "slug": "rogue-agent-x", "name": "Rogue Agent X", "name_original": "Rogue Agent X", "description": "Rogue agent is addictive third person shooter perspective game. City's streets are full of criminals, gangsters and bad guys. City Security Agency is worried for property and lives of the citizens. CSA is thinking to assign this task to their best agent to make this city safe for public. Who is the best??? Yes Rogue Agent is the best agent for this mission. Rogue Agent is famous for his expertise and he know's how to deal with bad guys. <br/>Amuse with intensive third person shooting experience. Take control over vehicles, helicopters and ammo's in this action pack. Enemies are afraid of Rogue agent and looking to destroy him. Rogue Agent took this challenge and ready to fight in this scenario against the enemies. You are the Rogue Agent \"Agent with on Principles\". Defend your city but using your shooting skills. Destroy the line of criminals and gangsters to finish them from root.<br/><br/>Game Features:<br/>- Controllable vehicles like cars, tanks and helicopters.<br/>- Explosives<br/>- Varity of weapons like (pistol, shotgun, grenades etc)<br/>- Power Ups<br/>- Thrilling gaming levels<br/><br/>How to Play:<br/>Use navigation button at left side to move forward, backward, left and right. Use button at right side to adjust your aim. Tap on fire button to shoot the enemies after aiming them. Use grenade button to plant it for multiple kills.", "metacritic": null, "released": "2016-05-11", "tba": false, "updated": "2019-10-22T14:21:02", "background_image": "https://media.rawg.io/media/screenshots/7f6/7f66c59bf97ff542153fca083bde5b2d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 29, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Syed Taha Nadeem Wasti", "Syed Hassan"], "genres": ["Action", "RPG"], "publishers": ["Syed Taha Nadeem Wasti", "Syed Hassan"], "esrb_rating": null}