{"id": 882876, "slug": "mystery-of-the-scarab", "name": "Mystery Of The Scarab", "name_original": "Mystery Of The Scarab", "description": "<p>Mystery of the Scarab is a two-player co-op puzzle game, set within an ancient Egyptian tomb during the Victorian era. Starring the two treasure hunters Benjamin and Carol, you enter a derelict pyramid to find the missing piece of a mythical artifact— the golden scarab. You do this in the hopes of collecting an easy bounty afterward, but divine forces from beyond ensure this will be all but simple. Are you up for this expedition?\r\n</p>\n<p> \r\n</p>\n<strong>Explore the ancient pyramid</strong>\n<p>Being recently excavated, there is a lot to uncover in this tomb! Explore the different floors of the pyramid, each with a unique theme to make researching this old crypt feel brand new. Each floor contains several rooms, which individually host a puzzle or challenge that requires both of you to conquer. For the playtest we have 1 room with 4 puzzles. It's your job to complete them!\r\n</p>\n<strong>Unique character abilities</strong>\n<p>Fortunately, this heroic journey is not one you must take on alone! Both treasure hunters bring a unique set of skills that, when combined, allow you to overcome even the most difficult obstacles.\r\n</p>\n<ul><li>Benjamin is the more experienced member of the duo. He boasts a remarkable level of strength, being able to move heavier objects around. He can also help Carol reach ledges that are beyond reach otherwise. His background does not only shine through in the form of brawn, however! Thanks to his past adventures, he’s developed a sense for traps and trickery that may prove fatal if unnoticed.\r\n</li><li>Carol is the youngest of the two. While a bit less experienced than Benjamin in treasure hunting, she’s more agile. This allows her to move more swiftly and even cross gaps that would be impassable for Benjamin.\r\n</li></ul>\n<p>It’s up to the two of you to decide which character is better suited for the task at hand, but one thing is certain— it will require both of you to fully explore the pyramid and emerge victorious.\r\n</p>\n<strong>A gripping story</strong>\n<p>As you delve deeper into the game, you’ll learn more about its world, as well as its characters. Discover the lore by inspecting the environment and any items you may collect during your quest. Through the completion of the puzzles, you’ll learn more about the relationship between Benjamin and Carol, as well as the mysterious deities who are involved in the trials you are undertaking.\r\n</p>\n<strong>Nostalgic art style</strong>\n<p>The world has been given form through the unique combination of pixel and voxel art. Using pixel art, we apply both hand-made and automated animations to bring our characters to life. And through UV-wrapping the environment is giving a classic look. You’ll find that this tomb, though said to be desolate, has quite some energy to it still!\r\n</p>\n<strong>Sound design</strong>\n<p>A score befitting of the setting will be accompanying you during your exploration. Using both traditional instruments and a bit of chiptune, we aim to invoke a feeling of adventure, dread, and wonder.\r\n</p>\n<strong>Watch the trailer</strong>", "metacritic": null, "released": "2022-11-09", "tba": false, "updated": "2022-11-18T20:43:05", "background_image": "https://media.rawg.io/media/screenshots/2ff/2ff2260456da387178b4c8e225303f4b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["JuveNILE Games"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}