{"id": 882839, "slug": "periphery-synthetic-ep", "name": "Periphery Synthetic EP", "name_original": "Periphery Synthetic EP", "description": "<p>Survey a planetary system in a customizable exosuit, and uncover its mysterious past, in this interactive EP by shiftBacktick.</p>\n<p>Best experienced with a gamepad and headphones. See the online manual to learn its system requirements and gameplay tips. Please be aware and report known issues. Enjoy!</p>\n\r\nBeta available\r\n<p>Claim your copy to join the beta, receive the full version on release, a free Steam key where applicable, and all future content expansions. Please claim a community copy below if you'd prefer to gain access <em>for free</em>.</p>\n\r\nFeatures\r\n<ul><li>Explore relaxing musical playgrounds.</li><li>Collect materials to craft and upgrade movement abilities.</li><li>Discover artifacts from a mysterious past.</li><li>Enjoy terrain sonification, haptic feedback, and other accessibility features.</li></ul>\n\r\nRoadmap\r\n\r\nExpand to read the 2023 roadmap.\r\n<p>Each expansion introduces a new musical world to explore. They will be released as free content updates, with the minimum price increasing with each release.</p>\n<ul><li><strong>Side B</strong> is a remake of my game E.X.O., set on an icy moon. Enjoy low gravity, and ascend treacherous heights, with new flight abilities.</li><li><strong>Side C</strong> is a remake of my game S.E.A., set on an ocean planet. Explore caves, and surf waves, with new swimming and diving abilities.</li><li>Information on future sides is forthcoming.</li></ul>\n\r\nThe music\r\n\r\nExpand to read more about the music.\r\n<p>Periphery Synthetic EP is a collection of musical experiences that listeners can interact with and explore. Built entirely with synthesizers that react to the environment in real-time, it is an exploration of ephemeral spaces and procedurally-generated ambient music systems.</p>\n<p>While these worlds are primarily explored with sound, each are paired with colorful and relaxing visualizations. From scenic desert vistas to psychedelic oceanic depths, they are a meditation on fresh audiovisual themes.</p>\n\r\nThe game\r\n\r\nExpand to read more about the gameplay.\r\n<p>Today you awoke from cryogenic sleep. The exosuit that protects you greets you: Welcome to Alpha Periphery. You were hired by the system's licensed corporation as a surveyor to assess its value. As you walk the shifting desert beneath you, it becomes clear there are more mysteries than rare metals to uncover. This is your strangest job yet.</p>\n<p>In Periphery Synthetic EP, surveyors pilot an upgradeable exosuit across otherworldly lands. Equipped with only a scanner and limited cargo space, they gather the materials to synthesize and upgrade suit components. In their mission to understand the Alpha Periphery system, they note scientific observations and significant planetary features in their codex, which they can revisit at any time.</p>\n<p>Each side introduces a new world to explore, containing new challenges to overcome and secrets to discover. These inspire surveyors to develop new movement abilities, which they can bring back to previous worlds for a fresh experience. By the end of their expedition, they might expect to drive, fly, swim, and even manipulate spacetime itself.</p>", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-18T20:32:23", "background_image": "https://media.rawg.io/media/screenshots/0d7/0d780cec822627fa50dafb17693f5ae7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["shiftBacktick"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}