{"id": 88296, "slug": "flick-champions-classic", "name": "Flick Champions Classic", "name_original": "Flick Champions Classic", "description": "Are you the next Roger Federer, Ronaldo or Michael Jordan? Put your sporting skills to the test with Flick Champions. Choose your nation, take part in eight different sports and become the ultimate sporting god. Play in one-off exhibition matches or take on a tournament challenge to get to the top. Got a friend that thinks they are a better player? Play one-on-one or in a 16 player tournament and find out who the most valuable player really is!<br/><br/><br/>PRESS QUOTES:<br/>\"It’s brilliant fun, it has crisp, clear visuals, enjoyable music (with some really brilliant sound effects, particularly the football chants)” — Tapscape<br/><br/>\"Old skool as heck, Flick Champions HD is simple, fun, and addictive.\" — Pocket  Gamer<br/> <br/>\"Flick Championship HD is eight above par flick titles in one universal package. It’s definitely worth the pick up if even one appeals.\" — 148Apps<br/><br/>\"Flick Champions is a lot of fun.\" — App Spy<br/><br/>\"Flick Champions is one of the best sports games in the App Store because it re-imagines the classic sports for the touch based interface.\" — Apple'n'Apps<br/><br/><br/>FLICK CHAMPIONS CLASSIC HIGHLIGHTS:<br/>• 9 different sports to play, Soccer, Basketball, Hockey, Tennis, Bowling, Archery, American Football, Golf and Baseball!<br/>• 16 player local tournaments mean you can show your friends you’re A-game.<br/>• 24 Cups to participate in, will you be crowned champion of them all?<br/>• Intuitive controls mean everyone can join in the fun.<br/>• Computer controlled opponents come in three different difficulty settings so you can really put your skills to the test.<br/>• Gorgeous Hi-Definition graphics bring the games to life.<br/>• Tons of content to unlock.<br/>• Leaderboards and achievements so you can see how you rank across the world.<br/>• Universal build, will work on iPad/iPhone/iPod touch.", "metacritic": null, "released": "2011-09-15", "tba": false, "updated": "2019-07-30T03:42:25", "background_image": "https://media.rawg.io/media/screenshots/0e2/0e289def1c1d37310332ade386d5c659.jpg", "website": "http://nawiagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 75, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nawia Games"], "genres": ["Sports", "Arcade", "Casual"], "publishers": ["Nawia Games"], "esrb_rating": null}