{"id": 882948, "slug": "tropical-hearts", "name": "Tropical Hearts", "name_original": "Tropical Hearts", "description": "Tropical Hearts is a turn-based RPG about five close-knit friends eager to go on a well deserved vacation. When they're offered a luxurious stay at Paradise Island, they’ve no idea what’s awaiting them! Involved in a battle against mysterious, otherworldly creatures, our heroes unlock their magical potential - and the road to each other's hearts!<br/><br/>Play as Alex Alvarez, an adventurous and fun-loving maned wolf with mild authority issues. Alex's gender is up to you - and so are your dating choices! There's plenty of fun, spicy dates to go on throughout the game - there will be over 75 Story Events! Relax at the beach, explore the deep jungles and caves of Paradise Island, or shake that sweet bum to the latest dance floor hits!<br/><br/><br/><br/>You’re accompanied by your quartet of best friends - all of whom are notably single and ready to mingle. Get to know them even better as you relax on the beach, hike through the local wilderness or discover what Paradise Town has to offer. Even if you don’t want to get romantically involved with a character, you can always complete their Story Route as friends.<br/>Can’t make up your mind yet? If you’re up for a fling before you seal the deal with your partner of choice, there’s several sexy strangers waiting for you across Paradise Island.<br/><br/><br/><br/>Defend your tropical paradise side by side with your friends! Choose from a vast array of Skills to target your enemy's weaknesses, get your powers boosted by your friends and unlock unique romantic Skills with your date. The stronger your bond with your friends, the more havoc you'll wreak in battle!<br/><br/><br/><br/>As you explore the mysterious isles surrounding Paradise Island, you’ll learn more about the strange history of this place. Collect precious materials to upgrade your weapons, craft new items to aid you in your quest, and try out various experimental cocktails lovingly prepared by Marc, the veteran bartender at the Hotel Bar!<br/>A strangely familiar voice calls to you in your dreams as you delve deeper and deeper into the mystery behind the otherworldly attackers. Why are these creatures here, and what do they want? It's up to you to find out!", "metacritic": null, "released": "2022-11-19", "tba": false, "updated": "2022-11-21T03:50:31", "background_image": "https://media.rawg.io/media/screenshots/8dc/8dcb371a1ef8a6e72aa6b4182b07baaa.jpg", "website": "https://tropicalhearts.carrd.co", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 374, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kokolori Studios"], "genres": ["RPG"], "publishers": ["Kokolori Studios"], "esrb_rating": null}