{"id": 882990, "slug": "ferd", "name": "FERD", "name_original": "FERD", "description": "<h3>MASTER THE BOW</h3><br/>This atmospheric Viking VR adventure places you in the role of a Viking warrior.<br/>When your peaceful village is attacked by a band of ruthless invaders, you and your fellow warriors embark on a journey of vengeance through the magnificent Nordic landscapes of the Viking Age.<br/><br/>With a bow and arrow as your primary weapon, you defend yourself and your comrades against hordes of attacking enemies as you venture deeper into enemy territory, over mountains and rivers.<h3>Co-op Multiplayer: </h3>As the ancient gates of the underworld open, together you and your friends must stop the evil hordes of undead and supernatural lifeforms from invading your realm. <br/>Co-op From 2 to 4 players.<br/><br/><ul><li><strong> Instantly Gratifying VR action: </strong>Using only two buttons - the game is extremely easy to play. FERD's intuitive game design was inspired by the popular rail shooters of the 1990s but evolved and developed into VR format with realistic graphics.</li></ul><br/><ul><li><strong> Immersive Experience: </strong>Because the magnificent environments are based on elevation data from real Norwegian mountains, you get to experience fantastic nature as the Vikings did.</li></ul><br/><ul><li><strong>No teleporting: </strong> The game itself moves the player subtly through the environment, either you are standing on board a Viking ship or moving vehicles.</li></ul><br/><ul><li>FERD is designed in a way that completely avoids VR-nausea.</li></ul><br/><ul><li>Great for casual gamers and anyone who loves Vikings.</li></ul><h3>INCLUDES:</h3><ul><li>FERD VR Single Player Adventure</li></ul><ul><li>FERD VR Multiplayer - Co-Op 2-4p - Level : Underworld</li></ul><ul><li>Unlockable Weapons</li></ul>", "metacritic": null, "released": "2022-11-18", "tba": false, "updated": "2022-11-21T04:41:30", "background_image": "https://media.rawg.io/media/screenshots/b49/b49294d76d56c2c76f107272cb9a3c02.jpg", "website": "https://ferdgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 375, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AYCE"], "genres": ["Action", "Adventure", "Casual"], "publishers": ["The Viking Planet"], "esrb_rating": null}