{"id": 883034, "slug": "desktop-farm-remastered", "name": "Desktop Farm Remastered", "name_original": "Desktop Farm Remastered", "description": "<strong>DESKTOP FARM REMASTERED</strong> responds to numerous requests from our community to create a voxel farm as a normal game and not as an interactive wallpaper.<br/><br/><br/><br/>As this is a normal game, we could significantly improve the graphics and functionality without worrying about the limitations of interactive wallpapers.<br/><br/>All graphics have been replaced with new technology that looks much better than the previous version. Many 3D models have been redone and some game mechanics have been rewritten better.<br/><br/>Now you can also speed up the game and not wait too long for the growth of our crops and animals.<br/><br/><h3>DESKTOP FARM REMASTERED Include</h3><br/>- Game to chill by building your own farm in your way.<br/><br/>- Voxel crops, trees and animals. These will grow and increase the value.<br/><br/>- Procedural map generator, so each map will be unique for you.<br/><br/>- Day and night system with buttons to change the speed of time.<br/><br/>- Updated graphic with new high-resolution textures + new visual effects.<br/><br/>- Free camera orbit with zoom + button to reset camera settings.<br/><br/>- All (Windows) system compatibility. <br/><br/><h3>HOW TO PLAY</h3>Use \"PLOW\" to prepare the ground for any object. Cut trees if needed by using \"CHOP\". On ready ground build your starting \"HOUSE\". Then start sowing your chosen crops or trees. Build fences if you want to buy animals. Animals can eat your crops. Place \"Sprinklers\" to water your farm. Rain can also add water to your plants but it can be not enough. Bye dogs and cats to eliminate rats and rabbits that will eat your plants. Change the game speed and look at the growing farm. Sell crops and animals to earn more money to extend your farm your way.<br/><br/><br/>I hope you will like this version of the game as well.<br/><br/>In case of questions or problems, please create a new topic in the Community tab.<br/><br/>Best Regards,<br/>3DM", "metacritic": null, "released": "2022-11-19", "tba": false, "updated": "2022-11-21T05:35:39", "background_image": "https://media.rawg.io/media/screenshots/b7a/b7a2493e5fc09ff1d520c9a4032c7373.jpg", "website": "https://www.3dmgroup.co.uk/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["3dm_live_wallpapers"], "genres": ["Strategy", "Simulation", "Casual", "Indie"], "publishers": ["3dm_live_wallpapers"], "esrb_rating": null}