{"id": 88314, "slug": "moto-hot-wheel-bike-stunt-race", "name": "Moto Hot Wheel-Bike Stunt Race", "name_original": "Moto Hot Wheel-Bike Stunt Race", "description": "Your main goal in this Moto Hot Wheels Race is to go successfully through several stunt tasks on the highly challenging, difficult and dangerous tricky routes. Try to get the equal balance between your stunt bike's power and race your grip while staying on the course. Fully filled with extremely killer tricks, freestyle ultimate thrill, action and insane crazy stunts. It is a high thrill and action trial bike riding master adventure game. Forget those dumb, boring and repetitive drag car racing games. To Become the master of extreme stunt bike racing. As you know without the pain you won't learn anything. So you start practice right now to Become the pro bike stunt racer and beat all the records. <br/><br/>Ride your motorbike and overcome the obstacles's path using the touch screen controls and on screen accelerator. Quench your thirst with speed interesting and wonderful challenging levels of motorcycle riding adventure.<br/><br/>How to Play:<br/>Press the button acceleration to speed up.<br/>Press the brake button to Reduce the speed or to stop.<br/>Tap the left arrow button to turn left.<br/>Tap the right button to turn right.<br/><br/>Features:<br/>Stunning HD graphics<br/>3D awesome different environment<br/>Cool animations<br/>Easy and smooth controls<br/>Realistic and Effective sound<br/>Interesting and Challenging Levels", "metacritic": null, "released": "2017-12-15", "tba": false, "updated": "2019-10-22T14:21:04", "background_image": "https://media.rawg.io/media/screenshots/632/63269fcb87ad7ad0d9703616b6489fb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Malik Iqbal"], "genres": ["Adventure", "Racing"], "publishers": ["Malik Iqbal"], "esrb_rating": "Everyone 10+"}