{"id": 88326, "slug": "world-title-boxing-manager", "name": "World Title Boxing Manager", "name_original": "World Title Boxing Manager", "description": "World Title Boxing Manager just gets bigger and more detailed with our latest release because we've added Gyms and Trainers to the game and both are available to give even greater depth to our best selling boxing manager game now. <br/><br/>WTBM lets you manage your stable of fighters and scale the heights of world championship Boxing, anytime and anywhere.<br/><br/>Across the traditional weight divisions from Heavyweight to Flyweight and with fighters from across the world of boxing, can you write your name into the history books as one of the top boxing minds of the age?<br/><br/>From building gyms, hiring trainers, signing the right fighters, finding the right opponent for them, setting the right training plan, betting on fights, to managing their corner and strategy on fight night, the next page of boxing history is yours to turn.<br/><br/>Can you build a stable that fight fans will remember for years to come? Will you make it to the hall of fame? <br/><br/>As an early release product we are keen to enhance and build the game out further from listening to the feedback of users - so please do contact us with any comments you have. We have a huge roadmap of features that we will be releasing regularly. <br/><br/>Working exclusively on iPhone, you can get the most detailed and authentic, yet quick-playing boxing management game ever created.  <br/><br/>World Title Boxing Manager provides many exciting and improving new features including:<br/><br/>EIGHT WEIGHT DIVISIONS<br/>The major historic weight divisions are now live in WTBM from Heavyweight to Flyweight. <br/><br/>PLAY IN A MASSIVE FIGHTER UNIVERSE<br/>With over 3,000 unique boxers in every game world, managers have the pick of a vast range of fighters of different weights, nationalities and abilities.<br/><br/>FIGHT VIEW<br/>View the progress of any fight through the WTBM fight screens. Check out the Tale of the Tape. Round-by-round stats capture every punch, every knockdown. Will the fight end with a stoppage or KO, or will WTBM’s group of judges call it on points? Be in the corner for your stable fighter’s bouts. Can you use the time between rounds to make the difference between winning and losing?<br/><br/>LEADERBOARDS<br/>Track your progress against other World Title Boxing Managers with our in-game Leaderboards.<br/><br/>BETTING ON ALL FIGHTS<br/>Grow your bank balance by betting on any fight in the game in a number of markets with live odds available for all fights.<br/><br/>TRAINING<br/>Take even greater control of your fighter than in previous versions by configuring custom training plans as they attempt to climb the ratings. <br/><br/>STABLE AND FIGHTER STRATEGIES<br/>Control the size and shape of your stable and gym. Find the right opponents for each of your fighters. <br/><br/>INTUITIVE USER INTERFACE<br/>Designed uniquely for iPhone, we are constantly fine tuning the experience to make the most usable boxing manager game ever created.<br/><br/>IN GAME NEWS<br/>Stay abreast with both your stable and fighter news as well as the ups and downs in the World Title Boxing Manager universe with the in-game news system. Whether there’s a big heavyweight title fight been made, or one of your fighters wants you to arrange their next fight our in-game, the news system keeps you up to date.<br/><br/>MATCHMAKER<br/>Using the unique Matchmaker function, plot a course for your fighters from the bottom of the rankings all the way through to the world title.<br/><br/>CONTRACT NEGOTIATION<br/>Build your reputation and approach any of the fighters in the game with custom contract negotiation and our in-game fighter contract trading system. Sign your fighters at the right price and watch your profits grow as you develop their ranking and box office appeal.<br/><br/>MONTHLY RANKINGS<br/>See where your fighters stand and what it will take to climb through the rankings in the monthly rankings update.<br/><br/>MORE TO COME<br/>Contact us in the app to give us feedback on the game and to make suggestions as to what you'd like to see in future versions of the game. We look forward to hearing your views.", "metacritic": null, "released": "2018-06-01", "tba": false, "updated": "2019-07-30T15:55:34", "background_image": "https://media.rawg.io/media/screenshots/398/3988615c35673ec65df17eb71ffaf0d9.jpg", "website": "http://www.worldtitleboxingmanager.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 170, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Sport and Financial"], "genres": ["Simulation", "Sports"], "publishers": ["Sport and Financial"], "esrb_rating": null}