{"id": 883297, "slug": "build-for-better-tomorrow", "name": "Build for Better Tomorrow", "name_original": "Build for Better Tomorrow", "description": "<p>Submission for Katana Jam II Game Jam made by <strong>Team \"Just Fine\"</strong> - Theme: \"Wait, are we the bad guys?\"</p>\n<p>SETUP:\r\n</p>\n<ul><li>Download the .zip folder on your computer\r\n</li><li>Extract the files on your computer. \r\n</li><li>Double click on HexGridTestTemp.exe to start the game.\r\n</li><li><strong>The game CAN ONLY BE PLAYED in hotseat mode by 2 players. Either by sharing one gamepad, one mouse or 2 gamepads.</strong></li></ul>\n<p>GAME OVERVIEW:</p>\n<p>In this game, the Players are taking roles of huge global corporations which battle each other to develop the most glorious city, with a lot of urban and industrial development which will secure the human kind a long and better life. Of course, by doing so they will have to destroy the beautiful surrounding nature and eventually cast out any living animals that use it as a habitat. So, at the end we must ask ourselves the question: <strong>“</strong><strong>Wait, are we the bad guys?”</strong>  </p>\n<p>The game is played in <strong>6 </strong>rounds. Each player will have a total of <strong>18 </strong>dice, which represents their corporation <strong>wealth and power</strong>, during the course of the game. They will use <strong>3</strong> dice, that will be determined randomly, each turn.  There are <strong>24 </strong>random generated Dice placement fields on the map and in groups <strong>from 1 to 4</strong>, <strong>6 </strong>premade dice placement fields form<strong> 1 to 6</strong> on the centre Map Tile and <strong>6 </strong>premade dice placement fields <strong>form 1 to 6</strong> outside the Map for a total of <strong>36 </strong>placement fields.</p>\n<p>The Players will score points when they take control of the map tiles on the board and during the final scoring after the 6 rounds are over.<strong> The Player with the highest number of points will win the game.</strong></p>\n<p>QUICK RULES:</p>\n<ul><li>At the start of every round, the players can use special powers - Swap Dice or Rerolls.</li><li>After the Special Power phase of the round, the players proceed to deploying their dice.</li><li>At first, the players must deploy their first die on the edges of the map - hex tiles only with 1 die slot.</li><li>On subsequent turns, the players must deploy their dice on hexes adjacent to other hexes that they already have presence on.</li><li>After one hex is filled - all die slots are filled - the hex is scored and will count later for the scoring of the player.<ul><li>Ties are won by the last player placed die on the hex</li></ul></li><li>When all hexes on the board are filled - the game ends and scoring will happen.</li></ul>\n<p>DETAILED GAME MANUAL:</p>\n<ul><li>https://docs.google.com/document/d/1CfxAXFKjHwtDgaV8cXYbEtWAwCwV7QXtm8ZcqKSj5_M/...</li></ul><p>KNOWN ISSUES:</p><ul><li>There's a chance the player could be blocked from making valid action during his turn. If that occurs, the players must restart the game.</li></ul><p>POTENTIAL FUTURE UPDATES:</p><ul><li>Adding exit, restart buttons as functionalities</li><li>Adding VFX/SFX and better UX</li><li>Adding AI for solo mode</li><ul><li>One of the ideas is to implement AI that aggressively tries to capture hexes</li></ul><li>Proper multiplayer mode player over lobby</li></ul><br/>", "metacritic": null, "released": "2022-11-20", "tba": false, "updated": "2022-11-21T07:41:50", "background_image": "https://media.rawg.io/media/screenshots/77e/77ed2d81e22c3a8871e2efe25a2c75f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Team Boe", "Kris_D", "Babbles"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}