{"id": 883267, "slug": "phish-in-the-sea", "name": "Phish in the Sea", "name_original": "Phish in the Sea", "description": "Phish In The Sea\r\n<strong>**Please play in full screen for the most optimal experience**</strong>\n<p>Phish in the Sea is a game designed to train users to detect email phishing scams. Phishing is the act of sending out texts or emails under the impression of a company to get a person to reveal sensitive information such as a password or credit card number.  Always be vigilant about what attachments or links you are opening. Also, check the sender’s email address and hover over hyperlinks. \r\n</p>\n<ol><li>As this was my first game, learning C#, Unity Engine, and creating sprites was a challenge. A particular difficulty I had was programming the email system, but I solved this by creating a list of structs and connecting the various other scripts to the main script. When I needed help, I looked at Stack Overflow for C# problems or the Unity Forum/Unity Documentation for Unity problems.\r\n</li><li>I chose to raise awareness about phishing because, in today’s age, everyone has an email. Phishing scams are getting increasingly realistic. It is not just people who are not as technologically advanced; everyone is at risk. When I talked to adults, teachers, and my grandparents in my community, they said they received phishing scams.\r\n</li><li>I chose to create a game because I have been interested in video game design. However, I also wanted it to be easily accessible to everyone, like my grandparents. So, I made the game simplistic and published it on itch.io using WebGL++, allowing it to be played on the web.\r\n</li></ol>\n<p>Thank you for viewing my submission! - Olivia T.</p>\n<p>Background music: <em>tranquillity - Prod. Riddiman</em></p>", "metacritic": null, "released": "2022-11-20", "tba": false, "updated": "2022-11-21T07:28:06", "background_image": "https://media.rawg.io/media/screenshots/cc4/cc4c74037f3c108ab43c5741f9f64fcc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["kyolivia"], "genres": ["Simulation", "Educational"], "publishers": [], "esrb_rating": null}