{"id": 88332, "slug": "chunk-munch-3d", "name": "Chunk Munch 3D", "name_original": "Chunk Munch 3D", "description": "Highly Addictive Gameplay.<br/>Easy to learn, hard to master, 3D Puzzle Arcade game. <br/>It's the classic Same Game with a third dimension!<br/><br/>Happy ChunkMunching!<br/><br/>Top scores make it into the leaderboards where you can see how you and your friends are matching up against the rest of the world. <br/><br/>How to play:<br/>You can rotate the Chunk, a cube made out of smaller blocks.<br/>Chip away at the Chunk by removing (munching) on chains of two or more blocks that touch each other directly.<br/><br/>Clear the top layer of the Chunk to automatically Summon more Blocks!<br/><br/>By clicking a single block you form a chain of similar colored blocks, these are removed and gravity handles the rest. Longer chains score more points.<br/><br/>Black Hole Block: Tapping any of these blocks will unleash their fury, they implode and take all surrounding blocks with them as they go. Their devastation will not trigger chains, so use their power wisely.<br/><br/>Rainbows: Extend any chain you they touch, just as if they were a Block of any kind.<br/><br/>X Blocks: Watch out for these, as they do not respond to taps. Upon removal you will score HUGE amounts of points, but you will have to figure out how first.<br/><br/>On rare occasions a Gold Block will appear. <br/>When the top layer is almost empty, you can use these to manually Summon more Blocks and raise your score even higher!", "metacritic": null, "released": "2013-04-28", "tba": false, "updated": "2019-10-22T14:21:05", "background_image": "https://media.rawg.io/media/screenshots/f0f/f0fa161901f98f8bc661be50cc5316a5_qUgKQTU.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Duncan Waterreus"], "genres": ["Arcade", "Puzzle"], "publishers": ["Duncan Waterreus"], "esrb_rating": "Everyone 10+"}