{"id": 883389, "slug": "deep-space-rough-necks", "name": "Deep Space Rough Necks", "name_original": "Deep Space Rough Necks", "description": "<p>Howdy ya’ll! Hear you got a rock shooter from the boys down at the gate, how did you get that? Anyway, welcome here to this little nebula the folks call Urbano Petito 122944, miner’s paradise, purdie skies and rocks to boot. Plenty out here stake their claim but you look different. You look green as a hydro-soy and half as capable of moving those controls on that there miner you got there. Tell you what, why don’t you go boot up this little Alpha and tell me what you think, I swear it’ll be one heck of a ride and you don’t gotta pay me a dime. </p>\n<p>Rough Neck your way to greatness in this Space Miner. Upgrade your ship! Explore new asteroid clusters with the Mineral Scanner! Find out the deeper mystery in Deep Space Rough Necks!</p>\n<p>Developed by William Jennett; tested by you. </p><p>GAME-PAD CONTROLS-<br/></p>\n<p>Right Trigger- Go forward<br/>Left Trigger- Go Backwards<br/>Right&amp;Left Bumpers- Slew (go left and right)<br/>Left Stick - Pitch Nose Up/Down/Left/Right<br/>Right Stick - Roll<br/>A Button - Mining Lazer ON (if minable rock is in range)<br/>Y Button - Ore Scanner<br/>B Button- leave shop<br/><br/>KEYBOARD CONTROLS-<br/>SPACE BAR- Go forward<br/>LEFT CTRL- Go Backwards<br/>1 &amp; 2 - Slew (go left and right)<br/>WASD - Pitch Nose Up/Down/Left/Right<br/>Q&amp;E - Roll<br/>F KEY - Mining Lazer ON (if minable rock is in range)<br/>T KEY - Ore Scanner<br/>G KEY to leave shop<br/><br/>Arrow keys for D-pad <br/></p>", "metacritic": null, "released": "2022-11-20", "tba": false, "updated": "2022-11-21T08:21:20", "background_image": "https://media.rawg.io/media/screenshots/7be/7be3702d60b9ba5266fb05cc972b44df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 22, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Will"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}