{"id": 883434, "slug": "gamebox-demo", "name": "GameBox (Demo)", "name_original": "GameBox (Demo)", "description": "<p>You can listen to the full soundtrack here.<br/></p>\n<p>Well, you know the rest:</p>\n<p>Controls: Arrows = Move, A = Jump/Shoot, B = Accept/Charge. (Press A + B to go to game selection).</p>\n<p>To pass the turn in Russian Roulette, on PC, press the Space Bar, because due to an error the A and Bs could not be programmed.<br/></p>\n<p>This was originally for GBJam11, but since the damn screen resolution had to be 160px x 144px I left it (even though I had no chance of winning in the first place).</p>\n<p><strong>Content Warning: While the console and all that is a joke has some disturbing Easter Eggs, you have been warned for possible jumpscares or bizarre images that can be discovered by mistake.</strong></p>\n<p><strong>Español:</strong></p>\r\nATENCIÓN: el uso prolongado del dispositivo puede ocasionar alucinaciones violentas y/o grabar imágenes perturbadoras dentro de tu mente. Además de innecesarias enfermedades escatólogicas, como una diarrea explosiva o vómitos de mierda.\r\n<p>Te gustan los juegos? Voy a suponer que sí porque en eso consiste esto jajajsfljkf.<br/></p>\n<p>La Gamebox (anteriormente llamada Gameye pero sonaba raro) es una consola virtual con 3 videojuegos épicos portátiles, cada uno basado en los múltiples éxitos de Eyeboxs (bromita lmao).</p>\n<p>Cramar Gamebox'd:</p>\n<p>Como el primer juego de Cramar, 30'. Consiste en completar 3 nivelitos y vencer a los villanos, de eso va. No es tan interesante, pero es el más largo.</p>\n<p>Ruleta Flecha:</p>\n<p>Intento estúpido de replicar esos juegos flash de la ruleta rusa. Presiona A y B para pasar turnos, tienes 5 vidas, si las pierdes todas, te jodiste.</p>\n<p>Luna Gameboy'd:</p>\n<p>Ya han pasado como 100,00 años tras la quinta guerra mundial, cuyas bombas nucleares han convertido a los perros en seres satánicos y mutantes. Tú eres una nave mágica que tiene que asesinar a las Lunas, ahora mutadas por los desechos tóxicos, antes de que estas maten a la humanidad restante.</p>\n<p>El soundtrack completo lo puedes escuchar aquí.<br/></p>\n<p>Bueno, te sabes el resto:</p>\n<p>Controles: Flechas = moverse, A = Saltar/Disparar, B = Aceptar/Cargar. (Presiona A + B para ir a la selección de juegos).</p>\n<p>Para pasar el turno en la ruleta rusa, en PC, presiona la Barra de Espacio, porque debido a un error no se puedieron programar los A y Bs.<br/></p>\n<p>Esto era originalmente para la GBJam11, pero debido a que la maldita resolución de pantalla tenía que ser de 160px x 144px lo dejé (aunque no tuviera posibilidades de ganar en primer lugar).</p>\n<p><strong>Aviso de contenido: Si bien la consola y todo eso es pura broma, tiene algunos Easter Eggs perturbadores, se le tiene avisado por posibles jumpscares o imágenes bizarras que pueden ser descubiertas por error.</strong></p>", "metacritic": null, "released": "2022-11-20", "tba": false, "updated": "2022-11-21T08:40:40", "background_image": "https://media.rawg.io/media/screenshots/8d9/8d9c9fc4eb923624a6a4bb2dc983f6ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 138, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Eyebox Games"], "genres": ["Shooter", "Platformer"], "publishers": [], "esrb_rating": null}