{"id": 88344, "slug": "bow-hunter-russia-archery-game-wild-animals-huntin", "name": "Bow Hunter Russia: Archery Game - Wild Animals Hunting in 3D", "name_original": "Bow Hunter Russia: Archery Game - Wild Animals Hunting in 3D", "description": "Prepare for the ultimate hunting challenge with Russia: Bow Hunt Wild Animals. If you got bored with “sniper zombie WW2” games and need some more sophisticated wild hunting entertainment - downloadRussia: Bow Hunt Wild Animals! This game will get you to the very best wild hunting grounds in Russia (like Siberia, Polar Circle). It’s absolutely free, gives you plenty of fun and relax while shooting bow and hunting wild animals! Bow Game is a free hunting game you want to play! Master your bow technique, become the master archer. Be a hunter! Bow shooting gives you ultimate experience of an archer, brings you the whole new way of having fun with shooting and hunting in wild russian hunting grounds. Tap the screen to stretch the bow and shoot. Enjoy the plenty of levels, beautiful wild 3d american environment, real life animals you can hunt only in north america, wind factor and the most  realistic bowhunting experience games ever offered. Hunt with bow like never before. Become the archery master! <br/><br/>Russia: Bow Hunt Wild Animals gives you:<br/>Beautiful environment of Russia (in 3D)<br/><br/><br/>Realistic archery &amp; bowhunting experience<br/>Stunning 3D graphics <br/>Ultimate hunting experience<br/>Plenty of different levels<br/>Real life animals<br/>Varied difficulty of the game<br/>Power ups<br/>Playing for Free - no “in-app purchases” (no IAP)<br/>High score <br/>Different arrows and bows<br/>Plenty of fun! <br/><br/>How to play:<br/><br/>Simply tap and hold  the screen to stretch the bow and aim. Release when ready to shoot. Be quick! The bow starts shaking when stretched for too long! Remember about the wind factor! The bow reloads arrows automatically, so you can focus on aiming the targets. Remember that you can look around! <br/><br/>There are two types of gameplay:<br/><br/>Time Attack: Get as many hits/points as you can in a limited time.<br/><br/>Archery Mastery: You get only couple of arrows and have to hit all the targets. Precision, focus and skill is required.<br/><br/><br/>HUNT OR BE HUNTED! Precission matters!", "metacritic": null, "released": "2016-01-29", "tba": false, "updated": "2019-07-30T16:01:22", "background_image": "https://media.rawg.io/media/screenshots/893/8935cf9673db72f78642b81a6c1d2274.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 276, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}