{"id": 8835, "slug": "catacomb-hero", "name": "Catacomb Hero", "name_original": "Catacomb Hero", "description": "The world outside became nothing. A blip, a dot of light behind. Venture into the darkness! The shimmer of gold covers the secrets of lives lost here. Are you ready for your quest? You will have to outmatch the creatures below as well as former fellow humans! The Path to Power begins here.<br/><br/>Get ready for skill-based fights with thousands of alchemy-born creatures, venture your way forth and gain the Lost Power. Lay waste to other player&amp;#39;s dungeons, conquer monstrous hordes and make them serve you! Become the master of the Abyss with an unbeatable army and an unmatched mechanic defence.<br/><br/>◆PvE campaign to keep you entertained for tens of hours<br/>◆Forge the ultimate hero!<br/>◆Raid catacombs, dynamically built by other players<br/>◆Use alchemy and mechanics to create an unbeatable defence of monsters and traps<br/>◆Easy to start and hard to master! Use challenges to prove yourself!<br/>◆The further you go, the more secrets you uncover!<br/>◆Stunning visuals<br/><br/><br/>Internet connection is required!<br/><br/><br/>Under our Terms of Services and Privacy Policy, Catacomb Hero is allowed for download and play only for persons 13 years or over of age.<br/><br/>Note: A network connection is required to play.<br/><br/>Join the community, find friends and check news:<br/>https://www.facebook.com/razar.cz", "metacritic": null, "released": "2016-05-04", "tba": false, "updated": "2019-10-22T14:30:08", "background_image": "https://media.rawg.io/media/screenshots/33d/33d0b9f058614b457f82b7bc9ef7e9bc.jpeg", "website": "http://razar.cz", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 278, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["RAZAR"], "genres": ["Action", "RPG"], "publishers": ["RAZAR"], "esrb_rating": "Teen"}