{"id": 88351, "slug": "guns-cowboys-bounty-hunter", "name": "Guns & Cowboys: Bounty Hunter", "name_original": "Guns & Cowboys: Bounty Hunter", "description": "There’s a new sheriff in town! Outlaws and bandits will have no rest! Become the most feared cowboy in the whole Wild West! Mission of the game is to become the most feared gunslinger by defeating all marksmen in one-on-one gun fights. Shoot precisely, be quick, pull out the revolver in the blink of an eye. Your colt has only 6 bullets in chamber! Shoot or be shot on a truly enormous and open Wild West frontier full of cowboys, bandits, indians in this first person shooter game.  Be fast as Billy the Kid, Jesse James or The Apache Kid! Take on over 40 missions with a great variety of tasks for you to overcome. Take out robbers, bandits and outlaws! Great shooting game for fans of FPS, action games, shooting games or any free android games! Best of Wild West Shooting Games! Be the ultimate Bounty Hunter - win the duel in high noon! Put on your cowboy boots and saddle up - it’s time for a showdown! Travel to the land of adventures, indians cowboys and bandits! Gold rush has begun! It’s time for guns ‘n’ glory! Shoot targets in canyon, saloon, indian’s village and gold train. Protect the settlers from bloodthirsty indians, help the sheriff fight off the bandits and don’t let the  prison escape to happen. So prepare your colt gun - a working revolver is a ticket to survival. Six shoots sends six men six feet deep in this best wild west shooting game! No bow or crossbow to shoot silently, no bazooka to wast'em all - just you and your revolver! <br/><br/>Get some notches in your revolver handle and compare scores or challenge other players via the online leaderboards. Good luck Sheriff. We are counting on you! Start playing this great cowboy game with horses and guns!<br/><br/><br/>Features:<br/>Different locations: Canyon, Western City, Saloon, Indian Village, Train robbery, Oregon woods<br/>Realistic weapons: Colt single action, or Peacemaker 1873<br/>Shot realism - bullet is affected by gravity and wind!<br/>Over 40 levels<br/>Leaderboards<br/>Achievements and medals<br/>Great Sounds and Graphics<br/><br/><br/>Win the duel!<br/>Fight bandits and outlaws!<br/>Protect the settlers!", "metacritic": null, "released": "2016-05-13", "tba": false, "updated": "2019-07-30T16:03:33", "background_image": "https://media.rawg.io/media/screenshots/597/5971e12e1b25cfd2baf29faa9f3fd9a1.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Action", "Simulation"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}