{"id": 88361, "slug": "bike-animal-race-motorcycle-farm-escape", "name": "Bike Animal Race: Motorcycle Farm Escape", "name_original": "Bike Animal Race: Motorcycle Farm Escape", "description": "No animal wants to live on this farm! Make an escape! Jump &amp; ride! Crazy motorcycle game for kids! Exploration lite of farmlands! Race against time! Animal rider on a motorbike! <br/><br/>Animal rider - straight outta farm!<br/>Meet cute farm &amp; zoo animals! They can ride a motorbike! Choose your hero and let him escape! Make crazy dirt stunt moves! Extreme evolutions on bike! Farmers won’t catch such a motorcycle rider! It’s best free motorcycle racing game for kids! No GP - a motocross mission! Ride uphill or downhill, make wheelie or stoppie in this epic side scrolling game! Race against other animal players. No traffic on the road, so drive faster, jump higher and be the best rider! These animals don’t want to be treated like in a zoo, so they’re going to escape! Extreme fun on bike run! Best tap game for kids with cool story!<br/><br/>Crazy dirt moves!<br/>Obstacles? Use them! Jump from the ramp or make a barrel! Test your motorcycle driving skills! It’s a motocross! Make crazy dirt moves to get more points! Fly like no other cute farm or zoo animal! Extreme stunts on motorbike for boys and girls! Wheelie and stoppie! Road for survival - uphill &amp; downhill! Free your inner animal ryder and escape in a sound of motorcycle roar! Offroad on motorbike! You wouldn’t expected such xtreme crazy stunts in free side-scrolling racing game! Lite exploration of farming landscapes! Just you, motorcycle and road full of ramps and other surprises! Great animal farm escape! For kids and family! Leave farmlands and prove your bike driving skills in this exploration lite, best racing game for boys and girls!<br/><br/>Side-scrolling motorbike fun!<br/>It’s not a GP, but you have to run quick! Drive fast and jump high to set a stunt record and be the best rider! Improve your motorbike skills on an endless road to survival! Animal racing side-scrolling game with wheelie and stoppie moves! Acrobatic offroad dirt stunts for boys &amp; girls! Better than motocross riding! Run uphill and downhill. Don’t let these dirty farmers catch you! Jump on motorbike like never before! Extreme fun for kids who love zoo pets &amp; riding bike!<br/><br/>CORE FEATURES:<br/>Choose one of unique, hand-crafted animal heroes!<br/>Escape from farm on a road full of dangers!<br/>Drive a motorcycle like never before!<br/>Make xtreme crazy dirt motocross jumps!<br/>Be the best animal motorbike rider ever!<br/><br/>UPCOMING FEATURES:<br/>Multiplayer mode!<br/>Co-op mode!<br/>Trial ride mode!<br/>More cute zoo animals to choose!<br/>More farming environments to explore!<br/>More dirty tricks to jump higher!", "metacritic": null, "released": "2017-05-16", "tba": false, "updated": "2019-07-30T16:05:45", "background_image": "https://media.rawg.io/media/screenshots/2e6/2e647c18dfbb7fdc91bd2e2657a407c8_fPvJwz1.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Racing", "Arcade", "Casual"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}