{"id": 883660, "slug": "the-game-where-aliens-attack-and-kill-you-and-its-", "name": "The Game Where Aliens Attack and Kill YOU and It's Super Scary and Gross", "name_original": "The Game Where Aliens Attack and Kill YOU and It's Super Scary and Gross", "description": "<p><em>\"This is what we've been waiting for? Five years of Boiaaangisms and all it can muster is a crappy alien platformer?\"</em> 2.2 / 10 - ING</p>\n<p><em>\"A technical marvel of its time. Just kidding, this game blows.\"</em> 1 / 5 - GamePerfomer<br/></p>\n<p><em>\"Boiaaang is a master of the Coding and Making. It creates the Finest Games of Our Time and should be recognized as the \"The Bron Jame\" of PROGRAMMING, the \"Eyes Time\" of MAKE GAME, the \"Most Art\" of Alien Horror Adventure Classic 8-Bit Retro.\"</em> 999999 / 4 - Boiaaang</p>\n\n<p>The culmination of over 300 years of work from the most talented game designers and programmers such as Tony Fox, Mustardero Samurai, and YandereDev (LMAO) on its diverse and talented development team, The Game Where Aliens Attack and Kill YOU and It's Super Scary and Gross is widely considered one of the greatest video games of the 19th century, BC.</p>\n<p>The game stars Gmeej, an \"Alien\" from \"Outer Space\" intent on destroying mankind on its own home turf. Fight through over 9000 levels of intense, gory action while collecting Ancient Relics and parts to build the Ultimate Human Annihilation Gun of Doom and bring about the end of the human race, all while accompanied by the masterfully composed soundtrack made in collaboration with C148, Gick Mordon, and Cyborg Tay Zonday. TGWAAAKYAISSAG is now available for free on itch.io... \"If You Dare!\"</p>\n<p>https://boiaaang-depths.weebly.com</p>", "metacritic": null, "released": "2022-11-20", "tba": false, "updated": "2022-11-21T10:19:30", "background_image": "https://media.rawg.io/media/screenshots/016/0164e2192847553e4fdc96f8a97c2c7d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["boiaaang"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}