{"id": 883881, "slug": "loss-and-work-alpha", "name": "Loss and Work: Alpha", "name_original": "Loss and Work: Alpha", "description": "<p>Summary (Spoilers Alert!)<br/>----------<br/>After the end of the Cold War and the turn of the 21st century, technology, science, and medicine enjoyed a considerable boost and advanced more rapidly than what humanity would ever achieve, with what we would consider modern 2010s-2020s and even futuristic machinery being introduced around the 1990s. More advanced robots, virtual content, and better internet would take place in a bizarre cyberpunk \"Golden Age\". With the ongoing ideas of modern liberalism, transhumanism, progressivism, and even anarchism being encouraged, and the removal of conservative and religious influence and old ideas. Subcultures and trends would prosper during this period, and even corporations and nations would want to get more and more high-tech, as a result of the evergrowing population and in the name of progress, while humans would shy away from the actual issues with the planet, and continue excessive urbanization while oppressing the environment. As a result, the former superpowers collapse due to deep poverty, war, corruption, and the oppression of massive foreign companies. Soon, the few remaining superpowers would attempt to compete with one another for who rightfully owns the technologies at all costs.<br/></p>\n<p>Geopolitical disagreements between the United States of America and the People's Republic of China were over Taiwan, the largest manufacturer of innovative technologies, and the Russian Federation would soon invade Europe and cause it to fall into civil war. At the same time, the EU dissolves and hands over its power to the United States. A string of heated debates about the \"Taiwan Question\" made many world leaders withdraw from the United Nations, causing the slow fall of the UN and further strain on US-China relations. Requests for peace talks and the end of cyber warfare in the Pacific regarding tensions were also rejected, and the United States would pull sanctions and trade barriers on China. The Chinese government, at some point, was caught sending spies to hijack American data. World War 3 would break out, because of the Chinese invasion of Taiwan and the dissolution of the U.N due to their failure to prevent such a catastrophe, the war in Europe between pro-Russians and anti-Russians, as well as the plans for a Sino-Russian alliance being leaked by the American media and trending on different social media according to an investigation done by C.I.A agents. Russia itself was caught selling weapons to the People's Liberation Army. A couple of battleships and bomber planes were deployed onto the Taiwan Strait, and years of heavy naval warfare and continuing cyberwarfare follows to prevent the Chinese military from landing in Taiwan, after a failed attempt to conduct a ceasefire. Stalemates were very common. </p>\n<p>A political divide began in the United States, and the waste of resources and money used in the war to outdo the opponent, compete for better technology, and cut experimental project turnarounds in half would cause a huge market failure around the world and soon, hyperinflation. Even bustling cities were turned into military camps and bomb shelters, and such things as cyber-attacks and mass propaganda on social media and newspapers also appeared. World War 3 was marked by atrocities on both sides, both against foreign and domestic populations, and a quick escalation of hostilities to the point of the use of biological and chemical weapons. During the many years of bickering and dogfighting around the Taiwan Strait, both superpowers would be the sides of the same coin, gradually transitioning into authoritarian police states almost no different from each other and annexing their neighbours to gain more resources for the war and silence exiled political prisoners. Conflict also took place in Eastern China, through the Philippines. Although the war effort never seemed to die down, countless lives were lost in the war and soon, World War 3 would become the most lethal war mankind has ever witnessed. Mexico was invaded by the U.S to conserve oil interest rates and Canada, with the forced permission of the UK, was also annexed and considered a territory of \"Northern America\" in the minds of its citizens after Ottawan residents yielded. Major cities like Shanghai are suspended for human rights and put under martial law, to avoid riots and anti-war protests.</p>\n<p>The year is 2084, according to China's best estimation, so no one truly knows what year it is. World War 3 is still going strong, although both states and their armed forces were already exhausted from the constant fighting. Many call a conclusion to the war, which was the outbreak of nuclear war. The main character is Li #######, a young man in his early 20s from Nanjing, that turns up to Shanghai to look for a job and escape the horrible conditions there. He is seen as unintelligent and is ordered by the CCP to work at an official manufacturing company. However, Shanghai would also fall into poverty and corruption, with the events of the world economy sagging, Mutual Assured Destruction, and government inefficiency. Soon, ballistic missiles would be sent from both sides and would drop globally, DEFCON 1 is initiated and a nuclear exchange between the U.S and China would surface, soon significantly destroying life and buildings, disrupting the climate, causing billions of casualties with the blasts and aftermath nuclear effects, and collapsing all social and governmental structures, in what was called the End of the World.</p>\n<p>Developer's Notes<br/>---------------------<br/>No, I'm not trying to get political or send a political message.<br/>This project was meant to include pixel art and have a more \"visual novel\" style, but due to me not knowing shit about Python (and getting my brother to do most of the coding for me), I will keep the game this way for now.<br/><br/>You must download Python to be able to play the Demo and any other versions. Please report any glitches or bugs you can find within.<br/><br/>Credits<br/>---------<br/>Me-<br/>For the entire concept, writing, and setting of the game, also some mechanisms. <br/>My brother-<br/>For almost the entire code and programming, thanks, bro.</p>\n<p>The \"game\"'s dystopian theme is inspired by several other games and is supposed to be an interactive novel game.</p>", "metacritic": null, "released": "2022-11-19", "tba": false, "updated": "2022-11-21T11:53:24", "background_image": "https://media.rawg.io/media/screenshots/3c3/3c37a40f54cf4337d7bb3e2884c1c7b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Ai Luhv Rais"], "genres": [], "publishers": [], "esrb_rating": null}