{"id": 88385, "slug": "youtubers-life-cooking-channel", "name": "Youtubers Life - Cooking Channel", "name_original": "Youtubers Life - Cooking Channel", "description": "Youtubers Life is the best selling life simulation/tycoon videogame on iOS. Become the world’s greatest content creator in history by editing videos, expanding the amount of fans and turning yourself into a wealthy fellow. With the NEW Cooking Channel you can now broadcast your cooking sessions, prepare special recipes, make kyaraben, take part in a TV show and prove yourself in real restaurants!<br/><br/>Make your own videos<br/>Combine different ingredients to create thousands of recipes and record your cooking sessions. Master 6 different cuisines –meat, veggies, pasta, cupcakes, healthy and creative food– and use your imagination to create the weirdest meals on Internet.<br/><br/>Prepare delicious meals<br/>Start setting simple snacks for kids and end up cooking sophisticated desserts for sybarite palates! There is no limit but your effort. Manage time and money as you make both the yummiest meals and the most entertaining cooking videos online.<br/><br/>Improve your cooking skills<br/>The way to become a master chef is full of challenges. Get your first income at Big Tummy Burger, take part in a contest on TV and end up working in a 3-Star restaurant. Little by little you will learn the secrets for being the best cook in town and increase your popularity among your subscribers.", "metacritic": null, "released": "2017-03-30", "tba": false, "updated": "2019-10-22T14:21:07", "background_image": "https://media.rawg.io/media/screenshots/188/18838400be271e5f1cac13955c98912c_2Gy0y0E.jpg", "website": "http://www.youtuberslife.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["U-Play Online"], "genres": ["Strategy", "Simulation"], "publishers": ["U-Play Online"], "esrb_rating": "Everyone 10+"}