{"id": 88391, "slug": "city-transport-bus-simulator", "name": "City Transport Bus Simulator", "name_original": "City Transport Bus Simulator", "description": "Enjoy bus real driving with city highway adventure. Coach Bus is the mind blowing tourists transport driver game. Drive classic city duty simulator 2018 during daylight to pick passengers from hotels, restaurants and drop them on their desired destination. Enjoy the realistic and authentic bus physics that make the offroad 6x6 chained tourist coach bus different from the other bus driving games. Being a furious fastest bus highway tourist duty driver is a tough job! Be careful at sharp city asphalt road turns and on offroad tracks avoid the bus crash and drop passengers safely.<br/><br/> Coach bus is the modern public tourist city transport in beautiful mountain uphill tourist simulate bus driving environment. Bus legend coach is ready to drive in the dangerous hill offroad tracks. You are the furious fast bus city highway duty coach driver but you have to drive your bus in the hilly mountains. Uphill area or downhill slopes in the bus king hill station offroad game will test your drive skills on luxury commercial bus modern coach.<br/><br/> People of all ages can play gyroscopic coach bus city elevated drive mania or transit coach bus highwEnjoy bus real driving with city highway adventure. Coach Bus is the mind blowing tourists transport driver game. Drive classic city transport bus simulator 2018 during daylight to pick passengers from hotels, restaurants and drop them on their desired destination. Enjoy the realistic and authentic bus physics that make the offroad tourist coach bus different from the other bus driving games. Being a furious fastest bus highway tourist duty driver is a tough job! Be careful at sharp city road turns and on offroad tracks avoid the bus crash and drop passengers safely.<br/><br/> City transport bus simulator is the modern public tourist city transport in beautiful  uphill tourist simulate bus driving environment. Bus legend coach is ready to drive in the dangerous hill offroad tracks.<br/><br/> People of all ages can play gyroscopic coach bus city elevated drive mania or transit coach bus highway elevated driving mania. You will enjoy natural graphics with city, Real Mountain forest and uphill snow environment having easy to play smooth gameplay and controls of bus king mountain hill station coach driver simulator in futuristic city police elevated transit bus coach transport duty game.<br/><br/>How to play <br/><br/>- Press on gas button for acceleration<br/>- Use breaks on turns <br/>- Slow down and park precisely<br/>- Control the coach with expertise<br/><br/>Features<br/><br/>- Enjoy a real coach driving and parking steering awesome controls<br/>- Real driving nice sim on city highway and streets<br/>- Real highly tuned trucker's big vehicle to drive <br/>- Excellent sound effects <br/>- Amazing graphics as real busay elevated driving mania. You will also get the fun of Independence Day bus transporter tourist coach game. You will enjoy natural graphics with city, Real Mountain forest and uphill snow environment having easy to play smooth gameplay and controls of bus king mountain hill station coach driver simulator in futuristic city police elevated transit bus gyroscopic coach transport duty game.<br/><br/>How to play <br/><br/>- Press on gas for acceleration<br/>- Use breaks on turns <br/>- Slow down and park precisely<br/>- Control the coach with expertise<br/><br/>Features<br/><br/>- Enjoy a real coach driving and parking steering awesome controls<br/>- Real driving nice sim on city highway and streets<br/>- Real highly tuned trucker's big vehicle to drive <br/>- Excellent sound effects <br/>- Amazing graphics as real bus", "metacritic": null, "released": "2017-11-10", "tba": false, "updated": "2019-10-22T14:21:07", "background_image": "https://media.rawg.io/media/screenshots/5af/5af9f3a50300f8ce36482caf3f1be825.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Malik Iqbal"], "genres": ["Simulation", "Racing"], "publishers": ["Malik Iqbal"], "esrb_rating": "Everyone 10+"}