{"id": 88390, "slug": "total-medieval-war-archer-3d-castle-siege", "name": "Total Medieval War: Archer 3D - Castle Siege", "name_original": "Total Medieval War: Archer 3D - Castle Siege", "description": "The Siege is on! Medieval Fortress must not surrender. Defence of the castle is crucial. The fate of the Queen and the kingdom is in your hands! Use your Archery skills to shoot and kill the invaders. Hunt the enemy knights and cavalry. It’s a medieval battle, Hunting time. Bow Vs Sword, Arrow Vs Axe. Bow is your weapon, blade is your enemy. Queen must not be captured or killed, otherwise the Kingdom will fall. To defend and protect the fortress you can use Longbow and archer skills. Friendly knights and castle defenders will help you, but you will fail if you accidently kill them. Aim precisely. Choose your spot on the tower and shoot at the enemy’s hordes. Be prepared, enemy forces will be strong and well equipped: bow, axe, sword - these are the enemy’s weapons.<br/>Siege will be over after 40 days. You must survive! Defend the Queen, Defend the Kingdom! Be a Master-Archer hero! Hunter-Assassin with a bow.<br/><br/>This game bring lots of joy. If you get bored with deer hunting games, low quality sniper, ww2 or zombie games this is a game for you! <br/><br/>Bow VS Sword: Fortress Defence gives you:<br/>awesome medieval castle/fortress surroundings <br/>3d graphics<br/>the ultimate archery experience<br/>over 40 levels <br/>many different medieval locations<br/>achievements - get them all! <br/>leaderboards - you can compete with your friends<br/>wind factor! Arrows actually turn - Take wind into account while you aim<br/>free to play! No money needed! <br/><br/>How to play:<br/>Tap to stretch the bow<br/>Aim at a target (hit the head for more points!)<br/>Bow reloads automatically<br/>Bow will start shaking when stretched for too long!<br/>Don’t get killed<br/><br/><br/>This game is available for:<br/><br/>English (American)<br/>French<br/>Spanish<br/>Russian<br/>Polish<br/>German<br/>Greek<br/><br/>languages (description) <br/><br/>Works Offline - no internet needed. You can switch off internet and get into offline mode.", "metacritic": null, "released": "2016-02-22", "tba": false, "updated": "2019-07-30T16:03:39", "background_image": "https://media.rawg.io/media/screenshots/8b2/8b2feeba61f7e1f8f9f3fe8104ed4e2e_qttbprW.jpg", "website": "http://playcoolzombiesportgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}