{"id": 884184, "slug": "megami-tensei-neuroheroine", "name": "Megami Tensei: Neuroheroine", "name_original": "Megami Tensei: Neuroheroine", "description": "<p><strong>Megami Tensei: Neuroheroine</strong></p>\n<p>Megami Tensei: Neuroheroine is free fan-made game of Megami Tensei series. This game is free, and for personal use only, not for sale or redistribution. All the rights for Megami Tensei trademarks belong to ATLUS company.\r\n  </p>\n<p> \r\n  </p>\n<p>Year 20XX, Neo Tallado City. During the renaissance of biotechnology, the heroine belongs to a group of people who deny body augmentation. In search of a better life, she decides to partake in the Tournament – virtual reality “Devil Busters” games hosted by a multibillionaire François Curbault. At the same time, a serial killer appears in the city and the heroine begins her investigation of best friend’s murder. Megami Tensei: Neuroheroine is the cyberpunk detective story with many moral choices and decisions.\r\n  </p>\n<p> \r\n  </p>\n<ul><li>Game is fully playable with <strong>gamepad </strong>(aside from couple of places which require text input). <strong>D-pad</strong> is use for navigating, <strong>A</strong> button for all actions and <strong>Start</strong> button to call menu.\r\n  </li><li>You can press <strong>'S'</strong> button to make a screenshot in the game folder.\r\n  </li><li>It is recommended to <strong>save often</strong> to <strong>separate save slots</strong> between story chapters and before each battle.\r\n  </li></ul>\n<p>Game offers character development in accordance with customizable stats. <strong>Stress</strong> stat reflects the mental state of the heroine. <strong>Stress</strong> stat must be monitored, if the stat limit is exceeded, the heroine will commit suicide. High value of <strong>Lust</strong> stat and low value of <strong>Sanity</strong> stat lead to additional choice options in the story. Both stats also affect couple of enemies' skills. <strong>Moral</strong> stat reflects current alignment of heroine. All four stats are determined at the beginning of the game after the quiz and can be slightly adjusted during the story.</p>\n<p>Game offers traditional turn-based combat with emphasize on <strong>Moon phases</strong>. Heroine can use swords and Elemental gun in combat. Using a sword costs <strong>Stamina</strong>. For example, one sword, when equipped, every Half-moon restores <strong>Stamina</strong>. Another Sword during a Full moon make double damage, etc. Sword can be equipped during battle without losing a turn. Using a regular gun costs <strong>Bullets</strong>. Using Elemental gun costs <strong>Bullets</strong> and <strong>EP</strong>. The gun does not do much damage, but hitting <strong>weakness </strong>of demon boosts the heroine's <strong>temporary Speed</strong>.\r\n  </p>\n<p>The heroine is subject to various <strong>ailments</strong>, like Burn, Frozen, Shock, Psyched, Fly, Mud, etc. Some of <strong>ailments </strong>can be cured by using items, some <strong>ailments </strong>can only be cured by talking to demons, some <strong>ailments </strong>can’t be cured at all.\r\n  </p>\n<p><strong>Intellect</strong> stat reflects the chance of successful negotiations with demons. <strong>Endurance</strong> stat reflects the chance of automatic ailments mitigation and possibility to sustain the fatal damage. <strong>Luck</strong> stat reflects the chance of <strong>Items</strong> drop increase and amount of <strong>Stamina</strong> recovery during SKIP turn option. <strong>Speed</strong> stat reflects the chance to act more often during battles.\r\n  </p>\n<p> \r\n  </p>\n<p>Builds for Windows, Linux, Mac and Android available for download.\r\n</p>", "metacritic": null, "released": "2022-11-18", "tba": false, "updated": "2022-11-21T14:03:50", "background_image": "https://media.rawg.io/media/screenshots/1c2/1c2546a496b8e1d885ede91cfc3d797c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 455, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["JamesHillten"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}