{"id": 88417, "slug": "trippy-monkey-free", "name": "Trippy Monkey Free", "name_original": "Trippy Monkey Free", "description": "The Revenge of the pigs! <br/><br/>Help Trippy Monkey in his voyage around the world to free the birds trapped in cages.<br/><br/>You have many different sorts of fruits to do that including an explosive grenade (ok, it's not a fruit but the rest are!). <br/><br/>You're achievements in previous levels allows you to buy more powerful fruits and so progress in the game. <br/><br/>Watch out for the pigs that light dynamites an try to kill the birds. <br/><br/>Use bananas to make them slip on, or send a fruit directly on the pigs.<br/><br/>In some levels a second monkey that you will first have to set free, will help you in your mission. <br/><br/>The game feature realistic physics, parallax scrolling (on 512 Meg devices), bi-directional zoom, 80 Meg of graphics and animation, both in low and high res (retina display whenever possible), mp3 tune, 60 different realistic sound effects.<br/><br/>This free version is packaged with 8 levels in two different worlds, the full version soon available will offer 72 levels in 8 worlds. <br/><br/>More levels to come in future updates. <br/><br/>As the game is designed to take full advantage of device memory on ipad1 and ipod touch and older iphones (i.e. those who doesn't benefice of 512 Meg RAM), please close all applications in background before launching the game to have all the features of the game available (sounds, animations).<br/> <br/>Enjoy!<br/><br/>Full game in english.", "metacritic": null, "released": "2011-11-29", "tba": false, "updated": "2019-10-22T14:21:08", "background_image": "https://media.rawg.io/media/screenshots/c4e/c4e3118ff95c0ad1c977875583284a38.jpg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pix Arts"], "genres": ["Action", "Arcade"], "publishers": ["Varasse Benoit"], "esrb_rating": "Everyone 10+"}