{"id": 88428, "slug": "doodle-fishing-lite", "name": "Doodle Fishing Lite", "name_original": "Doodle Fishing Lite", "description": "Welcome to Doodle Fishing Lite (AKA iFishing Doodle Edition)<br/><br/>\"One of the most complete fishing games in the App Store, doodle or otherwise\" - AppAdvice<br/><br/><br/>Doodle Fishing is a cartoon version and expansion of iFishing, the #1 fishing game for the iPhone.   Experience the thrills of realistic freshwater fishing as you use your device to cast and reel in a big lunker!<br/><br/>FEATURES<br/><br/>* Use the iPhone's accelerometer to cast, jig, aim your lure, and fight fish.<br/><br/>* Exciting fish fights while keeping the line tension in check, even see them jump!<br/><br/>*Use the fish finder and drive your boat to seek out the best places on the lake.<br/><br/>* \u2028\u2028Variety of lures with different actions (jigs, topwater, spinnerbait, divers, worms)\u2028\u2028<br/><br/>* Many species of freshwater fish to catch including perch, black crappie, bluegill, smallmouth bass, largemouth bass, walleye, pike, carp, catfish, and musky.<br/><br/>* Many funny things that you didn't want to catch, including soup cans, tree branches, spare tires, shopping carts, and toilet seats! <br/><br/>* Advanced fish AI, including schooling behavior, lure preferences, and hotspots based on structure such as dropoffs, weeds, lilypads, logs and rocks. \u2028\u2028<br/><br/>* Practice or Tournament modes in 3 difficulties.\u2028\u2028<br/><br/>* Trophy room to keep track of your biggest fish ever caught.\u2028<br/><br/>DEVELOPER NOTES<br/>* You can't keep fish that aren't considered sports fish, like perch or bluegills.\u2028\u2028<br/><br/>JOIN THE FAN COMMUNITY<br/>-On Facebook at www.facebook.com/RockingPocketGames<br/>-On Twitter at twitter.com/RockingPocket", "metacritic": null, "released": "2010-07-31", "tba": false, "updated": "2019-07-30T14:17:49", "background_image": "https://media.rawg.io/media/screenshots/d3a/d3a4b91b7c9df7672c825b143e53b2bd.jpg", "website": "http://www.RockingPocketGames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Rocking Pocket Games", "Chris Egerter"], "genres": ["Simulation", "Sports"], "publishers": ["Chris Egerter"], "esrb_rating": "Everyone 10+"}