{"id": 884321, "slug": "tiny-empire-itch-logitech-arts", "name": "Tiny Empire (itch) (LOGITECH ARTS)", "name_original": "Tiny Empire (itch) (LOGITECH ARTS)", "description": "<p>Peluncuran bom dan meledakkan Orc kecil menjadi ribuan keping dalam teka-teki penembak ini!</p>\n<p>Luncurkan bola meriam dan hancurkan orc kecil menjadi ribuan keping dalam penembak teka-teki fantasi ini! Memulai perjalanan abad pertengahan epik yang akan membawa Anda dari padang rumput kekaisaran ke hutan elf mistis, menghadapi musuh yang semakin kuat di bawah kepemimpinan raja tercinta Anda.</p>\n<p>FITUR:</p>\n<p>• JELAJAHI KERAJAAN di peta luas yang berisi lebih dari 100 level!</p>\n<p>• MENGALAHKAN makluk buas seperti beholder, golem batu, penunggang gagak, dan banyak lagi!</p>\n<p>• RENCANA SERANGAN ANDA dengan hati-hati – setiap bom bekerja paling baik pada situasi yang berbeda!</p>\n<p>• BUKA AREA BARU dengan mendapatkan skor sempurna di semua level!</p>\n<p>• RECLAIM TAMBANG YANG DIBUANG untuk memasok kerajaan Anda dengan aliran berlian yang tak ada habisnya!</p>\n<p>• KUMPULKAN meriam DAN HELM untuk melengkapi pasukan Anda dengan perlengkapan terbaik kerajaan!</p>\n<p>• LEBIH DARI 20 PENCAPAIAN untuk Anda buka!</p>\n<p>APA KATA ORANG:</p>\n<p>“Visual seni piksel 16 bit yang menawan membuat saya terpikat sejak saat pertama.”</p>\n<p>“Saya dibawa kembali ke hari-hari rpg 2D terhebat ketika saya mendengarkan soundtrack epik Tiny. Sungguh skor yang luar biasa!”</p>\n<p>“Meledakkan orc sangat menyenangkan dan memuaskan sampai-sampai saya mendapati diri saya bermain di level yang sama berulang-ulang hanya untuk meledakkan semuanya dan melihat mereka terbang lagi!”</p>\n<p>Catatan: ini adalah versi permainan gratis, didukung oleh iklan dan pembelian dalam aplikasi.</p>\n\n\n<p>® 2022 PUBLISHER OF LOGITECH ARTS </p>", "metacritic": null, "released": "2022-11-18", "tba": false, "updated": "2022-11-21T15:06:02", "background_image": "https://media.rawg.io/media/screenshots/3b1/3b10f0d49d34ceac46a4dc9e12645050.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LOGITECH ARTS"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}