{"id": 88443, "slug": "in-truck-driving-highway-games", "name": "In Truck Driving Highway Games", "name_original": "In Truck Driving Highway Games", "description": "﻿Are you crazy for truck racing or car racing games? We offer you a most wanted traffic racer game. Cargo truck Master 3d is new top trending truck racing game. This truck racing game offer you a truck drifting and truck driving opportunity. In this car city racing game you are going to grab the drag racing and truck driving experience with your speedy racing truck. This city racing game is top truck racing and car driving chance for xtreme racing rivals. Traffic racer challenge is basically a contest of racer trucker in truck tunnels. In this self drive car racing contest there are many racing cars and trucks such as 4x4 racing hilux truck, euro cargo truck and hill climbing trucks. This fast racing game is a driving test of your rush traffic racing skills. This city traffic racing test sharpen your real truck racing and carx drifting skills. Make sure your racing skills can face all the deadly challenges on the asphalt truck road . This Real Truck Racing Rivals 2017 game includes multilevel modes such as traffic racing, velocity racing and digger racing. Every multilevel mode has its own deadly missions. Enjoy the heavy truck racing game in indian highways traffic. Experienced the world's most eye catching and satisfying traffic racing adventure.<br/><br/>Download this Street Racing Mania 3d truck racing game and start enjoying fast racing with deadly drifting vr cars and monster trucks. This indian highway speed racer game is for those who love fast war truck racing and drift racing in deadly asphalt roads. In this super fame and fortune battle trucks racing mania lot of army trucks or military trucks are ready for you. Show your offroad drifting experience along with your mountain mad max racing skills. Face the hill climb challenges with different racing cars, pk truck and cargo trucks. Gain points from daring tricks and collect coins to upgrade your cowboy racing truck and reach even higher distances without hitting the luxury vr cars.<br/><br/>Drive the fastest monster truck cars on the planet in Cargo Truck Master 3d racing game. It will test your velocity racing and smash racing skills in traffic street mode. This nitro car clash of racing game make you the best truck racing driver in the world. Compete with other truck race rivals in exciting multiplayer mode and become the king of the leaderboards. Real Truck Racing Rivals 2017 allows you to drag a racing nitro car and heavy cargo truck on indian highway. Show some real traffic stunt while driving racing car among traffic rush in highway racer mode. Get the real racing challenge and become a real highway legend by driving your sports cruiser truck on highway with nitro booster and crazy speedy engine. Drag a offroad cargo truck on indian highway gives you a simulation of real formula racing. Become a traffic racer by winning the real racing battle on indian highways with indian truck. Off road cargo pakistani trucks are difficult to drive but you can handle this up hill truck duty with perfect driving skills. Off Road Cargo Truck Racing is thrilling mission pakistani game. <br/><br/>You will enjoy different environment like snow falls, bumpy road game experience in this 3d monsters truck battle. Your duty is to drive the transport truck carefully, use truck navigation system for hidden routes. In this super 3d truck driving game you will drive the heavy transport cargo in thrilling hill driving condition. In Euro City Truck racer you can enjoy city driving either steering wheel. In addition, you can switch on/off auto speed option for eliminating the gas pedal in this super truck driving game. Download this endless clash race game of 2017 with the speed racing fun and become the no.1 driver in Crazy Traffic Racer Competition.<br/><br/>Features:<br/>- Real turbo sound when you upgrade your engine<br/>- Real experience of Off road cargo truck driving<br/>- Most realistic heavy truck physics feel like real truck driver.", "metacritic": null, "released": "2017-09-07", "tba": false, "updated": "2019-10-22T14:21:09", "background_image": "https://media.rawg.io/media/screenshots/994/994a93f862720f41eb1e9751684251fc.jpg", "website": "https://www.facebook.com/plasmagame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayyab Mahmood"], "genres": ["Simulation", "Racing"], "publishers": ["Tayyab Mahmood"], "esrb_rating": "Everyone 10+"}