{"id": 884545, "slug": "make-the-snake-gad181-3t22", "name": "Make the Snake | GAD181 3T22", "name_original": "Make the Snake | GAD181 3T22", "description": "<p>A student project at SAE Institute in Perth, Australia for GAD181 3T22.</p>\n<p>The basic premise for this game is for the player to complete a series of microgames with simple concepts, controls and short time limits. </p>\n\n<p>The most current version is the 'Make the Snake 0.5 Alpha - User Trials' version, which will play in the web browser. This build is for testing the currently available microgames both individually and as part of two 'playlist' game modes which make up the body of the main game itself.</p>\n<p>If you are a play tester (or have found this page and want to help some students with testing) please refer to the following survey forms &amp; fill them out according to the instructions on each, using the web build which will load on this web page.</p>\n<p>https://docs.google.com/forms/d/e/1FAIpQLSepnageC0JiU-gvOElWecLqJfy8ozSZN8ax7WBy...</p>\n<p>https://docs.google.com/forms/d/e/1FAIpQLSfmAjZh7fhgzi08qxt2R5olbxYcjgQTnb41NOkY...<br/></p>\n<p>1. 'Three Strikes and You're Out'. In this mode you have three lives. All microgames are sorted into a random playlist which will continue infinitely so long as the player has a life remaining. When the player fails a microgame they will lose 1 life, and return to the main menu once all 3 lives are lost.</p>\n<p>2. 'Every Game Once'. In this mode the player will play each microgame back-to-back. Winning or losing each microgame will move the player on to the next microgame, and once each game has been played the player will return to the main menu.<br/></p>", "metacritic": null, "released": "2022-11-12", "tba": false, "updated": "2022-11-21T16:39:37", "background_image": "https://media.rawg.io/media/screenshots/d46/d46d7886089de252d5e1ad2b529de498.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 50, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["ScotchCarb", "TOOTHBRUSHDUCK", "yoyomyman"], "genres": [], "publishers": [], "esrb_rating": null}