{"id": 884712, "slug": "once-in-a-blue-moon", "name": "Once in a Blue Moon", "name_original": "Once in a Blue Moon", "description": "Take control over an avatar to experience the beauties of the world we have created, Once in a Blue Moon. This is a story-based Virtual Reality experience that is narrated through the player moving through our scene like a detective. They will have to investigate the area, discover new quest lines and meet the necessary requirements to progress through the story. <br/><br/>Although this is not a traditional game, we have delivered fully immersive and dynamic interactions to engage our audience at every step. Collect materials, and construct buildings and bridges as you traverse through a world like no other. Users will have to think carefully about each action and solve puzzles to unlock new parts of the story and reach a thrilling conclusion. <br/>Welcome to Once in a Blue Moon (OIABM), a beautifully hand-crafted experience that is literally out of this world. Set in a cosmic galaxy, you will have the chance to take a walk through an immersive forest with shafts of glorious light generated by the large Blue Moon in orbit. Take a stroll along a cobblestone path, visit the charming log cabin house and discover a pirate ship setting sail. Explore this stunning setting and allow yourself to get lost in this captivating world that is like no other. Experience a delicately designed, dynamic soundscape that heightens your senses.<br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2022-11-21", "tba": false, "updated": "2022-11-25T02:59:22", "background_image": "https://media.rawg.io/media/screenshots/2da/2da2054e1d785f90cc13c0f84daf6533.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 263, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NYX VX"], "genres": ["Casual"], "publishers": ["NYX VX"], "esrb_rating": null}