{"id": 884864, "slug": "cute-jump-2-sequel-2", "name": "Cute Jump 2 Sequel 2", "name_original": "Cute Jump 2 Sequel 2", "description": "<p>An entry to Sylvie's Jam. Based on Sylvie's game \"Cute Jump\", which itself was based on Maddy Thorson's game \"Jumper\", except now it's based on Maddy Thorson's game \"Jumper 2\", while also being inspired by Sylvie's game \"Hot Summer Sylvie\". This game is an important addition to the catalogue of those who play \"games\".</p>\n<p>In this video game you ride a boat and visit an island and purchase things from the store and avoid the jellyfish what appears should you linger in one room. While the game does have a focus on boating a lot of it is mostly jump-up-and-fall-down action, which presents you the opportunity to decide whether this is against the spirit of the Jam of Sylvie .</p>\n<p>This game is designed in an \"annoying\" manner and will be haunted with 500 demons each of whom will present you an increasingly nefarious and tricky riddle. The only way is to beat the game which will save the world. Are you up to the task??</p>\n<p>Contains mildly existentialist dialogue. Some jankiness may also result in sprites rapidly flickering position (if you enter a boat while standing right next to bouncy tiles), or two adjacent rooms rapidly flickering on the screen (if you move into the \"seam\" of walls vertically connecting two rooms).</p>\n<p>This game recycles code/assets/engine/editor/everything from a larger work-in-progress Jumper fan game by me of which more information will become available eventually.</p>\n<p>Made with LÖVE. Love without the umlaut not guaranteed.</p>", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2022-11-25T05:32:18", "background_image": "https://media.rawg.io/media/screenshots/874/874da05c0af238e41034b7eb13f26815.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 30, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wibi"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}