{"id": 88509, "slug": "youtubers-life-gaming-channel", "name": "Youtubers Life: Gaming Channel", "name_original": "Youtubers Life: Gaming Channel", "description": "Youtubers Life is the ultimate life simulation/tycoon videogame. Become the world’s greatest gaming video blogger in history by editing videos, expanding the amount of fanssubscribers and turning yourself into a billionaire. Create your character —customize it as you wish, there are thousands of hillarous combinations— and start making your first broadcasts in the cozy room at your parents’ where you grew up since you were little. Record gameplay sessions, buy new and classic consoles, keep an eye on daily tasks, and socialize to increase your popularity while you deal with fans, friends, family and time management!<br/> <br/>Make the best gaming videos<br/>Editing your own videos has never been so immersive! Follow the whole process from A to Z and publish your broadcasts on the Internet! Purchase your favorite titles online, get them delivered at home and start recording your gameplay sessions. Improve your videos as you become the greatest video blogger ever! <br/> <br/>Experience the real Youtuber's Life!<br/>Being a vlogger is not only about recording videos and getting as many views as possible —you also need to cool down and have some fun in your daily life! Go to the cinema to watch the latest movie releases, attend presentations of new games, chill out in the club or party in a luxurious yacht! Meet new friends and discover your other half while you keep thinking about the next broadcast you want to make when you get back home.<br/> <br/>Become a famous Celebrity<br/>The more viewers you reach the more popular you’ll be! As you become more populara celebrity on social media, more VIP’s will be interested in meeting you in person. Important high-tech and gaming brands will contact you and you will eventually meet other famous youtubers. Your fans will battle with all their might to get your autograph!<br/> <br/>Youtubers Life is fully translated to English.", "metacritic": null, "released": "2016-09-22", "tba": false, "updated": "2019-08-02T04:54:14", "background_image": "https://media.rawg.io/media/screenshots/5e8/5e8d7c884ddab56cfa6d27f3fcb28f8b_yy0CkBB.jpg", "website": "http://www.youtuberslife.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 326, "game_series_count": 0, "reviews_count": 1, "platforms": ["Android", "iOS"], "developers": ["U-Play Online"], "genres": ["Strategy", "Simulation"], "publishers": ["U-Play Online"], "esrb_rating": "Everyone 10+"}