{"id": 885001, "slug": "riddles-sieges", "name": "Riddles & Sieges", "name_original": "Riddles & Sieges", "description": "<p>Riddles &amp; Sieges is a relaxing puzzle game that is going to make you concetrate on your sense of timing. Your goal is to destroy the castle and for that you are given sets of different buildings with their own quirks and timings.</p>\n<p>For example catapult shoots over a tile. Trebuchet does the same, but has a delay before attacking. And ballista only attacks when being destroyed. Of course there are a lot more buildings and obstacles to conquer, but why would I spoil all of that here, you can experience them yourself!</p>\n\r\nThe game's features:\r\n<ul><li>40 handcrafted levels with each one being harder than the previous</li><li>A lot different mechanics that keep you interested throughout the whole game</li><li>Custom Level Editor if you want to create levels of your own and share them with everyone! (More on that below)</li><li>Calming atmosphere that keeps you relaxed while solving the puzzles</li></ul>\n\r\nLevels:\r\n<p>There are 40 levels in total handcrafted for your enjoyment. These levels are spread in 3 different zones. Those being:</p>\n<ul><li>Sunny Fields - 15 levels</li><li>Wintery Weather - 15 levels</li><li>A Rainy Day - 10 levels</li></ul>\n<p>Every zone is also divided in mechanics, with each being 5 levels in total. And those are only the main mechanics. Sometimes additional mechanics will appear, making the game even more interesting!</p>\n\r\nLevel Editor:\r\n<p>Here is a link to a post which has a little tutorial for the level editor:</p>\n<p><strong>https://liftyforever.itch.io/riddles-sieges/devlog/454476/level-editor-tutorial</strong><br/></p>\n\n<p>So get your rocks ready and trebuchets oiled, as the castles will not destroy themselves!</p>", "metacritic": null, "released": "2022-11-24", "tba": false, "updated": "2023-06-01T14:30:06", "background_image": "https://media.rawg.io/media/screenshots/7c5/7c573531964bb9841b1e831615afd329.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["LiftyForever"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}