{"id": 885102, "slug": "lets-be-a-bee", "name": "Let's Be A Bee", "name_original": "Let's Be A Bee", "description": "<p>Voici Let's Ba A Bee ! Un jouet que j'ai conçu avec 3 de mes camarades (Ewen Bedfert-Martret / Emilien Beuzelin / David Compas-Colin) pour le premier semestre de ma deuxième année.</p>\n<p><strong>inputs / touches :</strong>\n</p>\n<ul><li>Souris pour choisir la direction de votre avatar \r\n</li><li>Clic gauche pour butiner les fleurs / Déposer dans une ruche / Récolter les collectables</li></ul>\n<p><strong>Pitch :</strong>  Incarnez une abeille et explorer ce monde qui regorge de fleurs. Butinez le pollen de celles-ci et déposez le dans les ruches afin d'augmenter le stock de miel. Prenez de la vitesse en débloquant des paliers de stock de miel et flânez dans ce monde géant. Attention, les humains adorent votre miel, faites attention à remplir plus vite vos ruches qu'ils ne les vides.</p>\n<p><strong>Gameplay</strong> : Let's Be A Bee est un toy 3D OPEN world. La caméra est en vu première personne. Le joueur incarne une abeille qui se déplace dans un monde et peux récupérer le pollen des fleurs et le déposer dans les ruches. Plus il y  a de pollen, plus le stock de miel augmente. La tendance système est de vider ce stock. Plus le stock des ruches augmentent, plus l'abeille augmente en vitesse. Les ruches possèdent des fleurs préférées parmi les 3 types et les 4 couleurs. Le joueur déposera plus ou moins de pollen en fonction des correspondances entre les fleurs qu'il dépose et la préférence des ruches.</p>", "metacritic": null, "released": "2022-11-24", "tba": false, "updated": "2022-11-25T07:12:03", "background_image": "https://media.rawg.io/media/screenshots/92f/92f687b54844d27101f903a1a30ffcfd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kimjy"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}