{"id": 88527, "slug": "1001-ultimate-mahjong", "name": "1001 Ultimate Mahjong", "name_original": "1001 Ultimate Mahjong", "description": "The addictive power of Mahjong, multiplied by 1001.<br/>Containing 1001 unique Mahjong stacks in one, beautifully crafted package, wrapped together with 8 slick themes, over 40 lovely backgrounds and 5 extraordinary tile sets this is a stunning Mahjong package. <br/><br/>This app offers in-app purchases.  You may restrict in-app purchasing using your device settings. <br/><br/>Press Quotes<br/>\"A puzzle lover's paradise.\" — AppAdvice<br/><br/>\"Chillingo has done a great job at presenting a solid Mahjong game to the iOS market.\" — Unbound Gamer, 95%<br/><br/>\"... it is really as good as it can get.\" — Internet Gumshoe<br/><br/>\"1001 Ultimate Mahjong is one of the highest quality Mahjong titles I have seen.\" — Family Friendly Gaming<br/><br/>Inspired by Mahjong fans from all around the world and their experiences during this century, this is the definitive Mahjong Solitaire experience. You’ll never need another Mahjong game on your device!<br/><br/>Key Features<br/>• 1001 stacks within 11 different categories.<br/>• Refined user interface makes it as easy and intuitive as it could be.<br/>• Customization options to tune the game into your individual Mahjong experience.<br/>• 8 varied themes mean there is something for every taste.<br/>• Over 40 beautiful backgrounds.<br/>• 5 different tile sets ranging from classical to crazy ones.<br/>• Play your own music in the game!<br/><br/>For more information or support, please visit www.nawiagames.com", "metacritic": null, "released": "2012-02-02", "tba": false, "updated": "2019-07-30T03:45:39", "background_image": "https://media.rawg.io/media/screenshots/860/86003c6c7ebd0bc435ee00bdadfd6fcf.jpg", "website": "http://nawiagames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 291, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Nawia Games"], "genres": ["Card", "Puzzle"], "publishers": ["Nawia Games"], "esrb_rating": null}