{"id": 885361, "slug": "escape-first-alchemist-prologue-2", "name": "Escape First Alchemist Prologue", "name_original": "Escape First Alchemist Prologue", "description": "<p><strong>Escape first Alchemist: Prologue</strong> is the demo for a first person escape room / adventure game, where you play as the apprentice of the reclusive sorceror-alchemist \"Trismegistus\". <br/></p>\n<p>Your benevolent master managed to trap himself in a prison of his own making, and has bestowed upon you the challenge of releasing him. Of course, to make sure you don't just run away from his cunning riddles, he deigned fit to trap you as well...<br/></p>\n<br/>If you like the demo, please consider wish-listing the full game on Steam here\r\n\n<p><strong>Features:\r\n</strong>\n</p>\n<ul><li> A fully voice acted 'Master' who begs you to release him but doesn't stop pestering you about your every action.\r\n</li></ul>\n<ul><li> Craft potions from recipes found throughout the game with various effects \r\n</li><li> Explore a unique workshop inspired by real alchemical history, with a fantasy twist! \r\n</li><li>Full game will be <strong>multiplayer </strong>with<strong> Co-Op and Versus</strong> modes!</li></ul>\n\n\n<p>Find ingredients and discover new potion recipes. Craft unique potions and gain the powers you need to escape.</p>\n\n<p>Solve numerous interactive puzzles using logic, observation and communication</p>\n<p>Search the workshop for artifacts, inspect them carefully and find all missing clues!<br/></p>", "metacritic": null, "released": "2022-11-23", "tba": false, "updated": "2023-03-20T11:30:56", "background_image": "https://media.rawg.io/media/screenshots/584/584edb76cbff18d3caafd02a37789dc6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 312, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["OnSkull"], "genres": ["Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}