{"id": 88544, "slug": "war-of-words-2-crossword-strategy-game", "name": "War of Words 2 - Crossword Strategy Game", "name_original": "War of Words 2 - Crossword Strategy Game", "description": "Get ready for the ultimate word battle! An exciting blend of turn-based strategy and crossword game, War of Words 2 pits you against up to 3 other players for an all-out word destruction brawl!<br/><br/>EVERYONE LOVES THE WAR OF WORDS SERIES!<br/><br/>\"In comparison to War of Words, [those other word games] are so innocent.\" —TiPb<br/><br/>\"War of Words adds a welcome cut-throat edge to more classic word games... and is damn fun to play as a result.\" —What's On iPhone<br/><br/>\"This game threw all my prejudices about crossword puzzles out the window!\" —AppMyWorld<br/><br/>\"If you like crossword battle games and the letters on your board have worn away with use, then I suggest you give this game a try and see if the aggressive gameplay helps to refresh a classic board game.\" —Smokin' Apps<br/><br/>\"Thankfully a spelling game where the favor tends to lean on my [aggressive] side.\" —App Store Arcade<br/><br/>THE MOST ACTION-PACKED WORD GAME EVER DEVISED<br/><br/>War of Words 2 takes your standard online crossword game and amplifies it with Bombs, Poisons, Blasters, Black Holes, Portals, Nuclear Bombs, and more! Level your character up, unlocking new actions and boards. Experience epic four player games, customize your character with unique titles and avatars, or try out Nightmare Mode for an extra challenge! Grab an extra boost anytime by calling in the Reserves!<br/><br/>BETTER THAN LETTERS — WAR OF WORDS INTRODUCES ACTION TILES<br/><br/>- Multiplier Tiles multiply scoring of letters and words<br/>- Star Tiles let players play a word anywhere<br/>- Bomb Tiles destroy letter tiles in a square<br/>- Shield Tiles protect areas from opponents<br/>- Titanium Tiles are indestructible, serving to block other actions<br/>- Extra Turn Tiles allow players to play two turns in a row<br/>- Poison Tiles poison players over several turns<br/>- Medic Tiles grant points to players over several turns<br/>- Blaster Tiles destroy letters in a straight line across the board<br/>- Black Hole Tiles grow to a large size, destroying everything in their path<br/>- Portal Tiles let you warp part of your word to an arbitrary place on the board<br/>- Nuclear Bomb Tiles destroy the entire board and upgrade all the multipliers on the board<br/>- Expansion packs add 6 more action tiles and other mechanics<br/><br/>TONS OF OTHER FEATURES<br/><br/>- Dozens of board layouts<br/>- Titles and Avatars<br/>- Leaderboards and Achievements<br/>- Integrates with your Game Center friend list<br/>- Support for up to four players in a single match<br/>- Combat Log lets you keep track of everything that happened during each turn<br/>- Play online with up to 60 friends at once, or play at home with friends using Pass and Play<br/>- Online chat<br/><br/>REQUIREMENTS<br/><br/>- Devices supported: iPhone 4S and up, iPod Touch 5th Generation and up, iPad 2 and up<br/>- Requires iOS 9 or higher<br/>- A Game Center account is required to play with friends<br/>- Requires an Internet connection", "metacritic": null, "released": "2012-06-28", "tba": false, "updated": "2019-10-22T14:21:13", "background_image": "https://media.rawg.io/media/screenshots/747/7471532930a4a08b70d65bb7211e8676.jpg", "website": "http://wp.wolf-studios.com/?page_id=160", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Wolf Studios"], "genres": ["Board Games"], "publishers": ["Wolf Studios"], "esrb_rating": "Everyone 10+"}