{"id": 885668, "slug": "saga-of-the-moon-priestess", "name": "Saga of the Moon Priestess (itch)", "name_original": "Saga of the Moon Priestess (itch)", "description": "<p>Saga of the Moon Priestess is a top-down action adventure game inspired by retro classics. </p>\n<p>Tragedy strikes the world of Lunaria as the illustrious prince is kidnapped by an unknown assailant! The well-being of the land itself now rests in the hands of a young hero, Sarissa, as she has to fight, explore, and figure out how to rescue the young prince. Armed with nothing but her trusty spear, and the miraculous ability to communicate with the Goddess of the Moon, she must overcome treacherous enemies and dark dungeons. Featuring crisp pixel art, and authentic sounds and music, Saga of the Moon Priestess invokes a simpler era of the action-adventure game. </p>\n<ul><li><strong>Collect</strong> an arsenal of <strong>tools </strong>and <strong>weapons</strong> to help you on your quest</li><li><strong>Explore</strong> a vibrant world filled with <strong>friends</strong> and <strong>foes</strong> alike</li><li><strong>Delve</strong> into dungeons where<strong> danger</strong> lurks around every corner</li><li><strong>Solve </strong>the quest and save the land!</li></ul>\n<p>With 5 dungeons to explore, 7 Life containers, 15 items to collect and countless enemies to defeat, the world of Lunaria is a land lush with things to do, secrets to find, and people to talk to. So pour a drink, relax, and let the nostalgia of a simpler era wash over you.<br/>Saga of the Moon Priestess has taken me roughly a year and a half to make, and is my first major release. I really hope you find the time to discover all that you can about the game, and if you enjoy what you play, consider leaving donation to help fund future game projects.</p>\n<p>The packaged download includes:</p>\n<ul><li>The game<br/>\n</li><li>A manual with additional information.</li><li>A keyboard control sheet</li></ul>\n<p>This game has been tested with both an Xbox and a PS controller. <br/>A controller is <strong>highly</strong> recommended. </p>\n<p>Music by:<br/>RyanAVX<br/>Tomas Palazzi</p>\n<p>Additional Support:<br/>DawnBringer <br/>Jeti<br/><br/></p>", "metacritic": null, "released": "2022-11-22", "tba": false, "updated": "2022-11-25T11:15:09", "background_image": "https://media.rawg.io/media/screenshots/0cd/0cdc5cb6b7bdb4346b19fbcd0f541fa2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pixel_Trash"], "genres": ["Action", "Adventure", "Puzzle"], "publishers": [], "esrb_rating": null}