{"id": 88576, "slug": "sprite-basic-2-game-coding", "name": "Sprite Basic 2 Game Coding", "name_original": "Sprite Basic 2 Game Coding", "description": "FULL SET OF BASIC COMMANDS<br/><br/>Sprite Basic is easy to learn, it is indeed, the easiest tool around to write games. But with its full set of Basic Commands along with its dedicated libraries Sprite Basic offers everything best game authoring tools permits to do in a complicated way, just it is simple, straight-forward and fun to learn!<br/><br/>COMPLETE SPRITE LIBRARY DEDICATED TO GAME CREATION<br/>In addition to its drawing, math, input, sound libraries Sprite Basic offers in a didicated library all functions needed to create top games in a very simple way. Even with no programming background, you'll quickly learn how to design simples than better games.<br/><br/>MANY EXAMPLES FULLY DOCUMENTED<br/>To help you start with, and in addition to its exhaustive documentation, Sprite Basic offers many fully commented examples including game prototypes<br/><br/>LOAD ASSETS, EXPORT YOUR CREATIONS TO DROPBOX<br/>To ease the use of your own assets, you simply place them in your DropBox folder, log to DropBox from Sprite Basic and load assets in your source from your DropBox (with a cache mechanism to make it faster). You can also import/export your sources and share your projects between your computer and your mobile device (Sprite Basic is also available on mobile device).<br/><br/>OVER 65 MEGS OF GRAPHICS AND SOUNDS ASSETS INCLUDED<br/>To help you start with, Sprite Basic is packed with assets allowing to create very quickly games like  racing, platform, shoot'em up, ball-breaker and many more<br/><br/>CODING IS FUN ! GET STARTED NOW !", "metacritic": null, "released": "2018-09-02", "tba": false, "updated": "2019-10-22T14:21:13", "background_image": "https://media.rawg.io/media/screenshots/b39/b39b21eca640a7fae662eced6b036b5c.jpg", "website": "https://pix-arts.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 129, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Pix Arts"], "genres": [], "publishers": ["Varasse Benoit"], "esrb_rating": null}