{"id": 88579, "slug": "gutterball-golden-pin-bowling-free", "name": "Gutterball - Golden Pin Bowling FREE", "name_original": "Gutterball - Golden Pin Bowling FREE", "description": "This update requires OSX 10.7.3!!!!<br/><br/>☆☆☆ Also available for iPad &amp; iPhone in the iTunes store ☆☆☆<br/><br/>Strike Gold and collect a wide range of bowling balls, awesome alleys and cool power-ups! If you've been searching for a fun bowling game for your Mac, THIS is the game to play!<br/><br/><br/>GUTTERBALL BOWLING HIGHLIGHTS:<br/>☆ It's a true bowling game with dazzling graphics and great pin physics<br/>☆ Clean &amp; crisp throwing action lets you spin your bowling ball perfectly<br/>☆ Collect bonus content with Golden Pins to experience even more bowling fun!<br/>☆ Awesome Power Ups, including a BOMB, a SPLITTER, and the INFLATOR (Arnold approved!)<br/><br/>FEATURES:<br/>☆ 2 beautiful and uniquely fun bowling alley's (5 extra alleys available in the full version.)<br/>☆ Funny commentators who voice their opinion on every bowling throw<br/>☆ House, Style and Effect bowling balls to unlock, each more awesome than the last<br/>☆ Arcade \"Spin\" system to increase your Golden Pins when bowling like a pro.<br/>☆ Local High Scores and 40 bowling achievements<br/><br/>Check out the Paid version for more content and features not available in the free version.<br/><br/>HISTORY:<br/>The original Gutterball 3D bowling game premiered in 2002. It reached #1 on many portals and stayed in Real Arcade's Top 10 for an unprecedented 54 weeks. Gutterball 2 arrived in 2004 with all-new crazy bowling alley designs, improved grahics and physics, and new features galore. Now, Gutterball: Golden Pin Bowling is all-new and ready to go! We think it's the finest bowling game on the App Store and we've played them all.<br/><br/>You be the judge... is this Gutterball the best bowling game ever?", "metacritic": null, "released": "2011-11-01", "tba": false, "updated": "2019-10-22T14:21:13", "background_image": "https://media.rawg.io/media/screenshots/5f9/5f96d81e5ebad6143afc2f53d341b31f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 141, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS"], "developers": ["Skunk Studios"], "genres": ["Sports", "Family"], "publishers": ["Skunk Studios"], "esrb_rating": "Everyone 10+"}