{"id": 88572, "slug": "sniper-academy-shooting-range-spec-ops-commando-tr", "name": "Sniper Academy: Shooting Range - Spec Ops Commando Training", "name_original": "Sniper Academy: Shooting Range - Spec Ops Commando Training", "description": "The duty calls! Elite Sniper: Shooting Range 3D is a #1 free sniper shooting game where you can practice elite sniper skills. Every Spec Ops or Counter Terrorist units in the world practice on shooting range. SAS, Navy Seals, GROM, SWAT, Delta Force etc. they all practice shooting targets on range. Train with them! Shoot targets, use scope, mind the wind. Be patient and deadly effective! Become an ultimate shooter - hitman, prepare for the global war, aim and shoot! It’s the best shooting game that will prepare you for war or hunting in the wild. Become an elite spec ops soldier after finishing the Sniper Academy. Enjoy the ultra realistic 3D graphics and cool animations, hundreds of thrilling missions, tons of guns and mortal weapons, addicting gameplay (FPS) and all for free! Best first person shooter on the store! Zoom in, exhale, aim the targets, use the sniper rifle’s scope, blast the tangos! Headshot is the most effective shot but true sniper shoots the chest. It’s easier to hit, and the caliber of your weapon will do the job. So, are you UP FOR CHALLENGE? Become the best sniper assassin in every environment. Use high caliber badass  weapons such as M24, SVD Dragunov, AWM (Arctic Warfare Magnum) or M82 to take down the targets. Did you know, that one, well placed sniper, can hold the entire  brigade? Your brothers in arms will cover your back when you seek the target. One shot one kill. Shoot from long distances but also train quick shooting from mid and short distance. Prepare for the conflict. You may be sent with fellow commando units to Afghanistan, Iraq, Syria to fight the terrorists from ISIS. Be well prepared. You can make mistakes here, on shooting range, but mistake in a battlefield may cost you life. Your dangerous missions will be to save hostages taken by terrorists from ISIS, eliminate enemy’s commander, rogue agents and spies, help you country in nuclear competition. Help the resistance of the dictatorship. No time for diplomacy, time for war action. War action you have to be prepared for. Practice with targets but have no remorse - shoot to kill in a real secret mission you are going do. Hide and wait for the hunt. Use all arsenal you have. Upgrade your weapons. Unlock new deadly sniper rifles. Use different equipment and ammo (night vision, thermal imaging rifle scope, silencer etc). Fulfill your contract and you are rich. Fail, and you die.  Be an ultimate hunter. So - Alpha, Bravo, Charlie - do you copy? The world needs your help.To become an elite killer - modern combat hero, practice first on shooting range. No one can be an elite Counter Strike soldier before getting a proper training. The global offensive is on! Learn how to take down soldiers, immobilize armored vehicles, shoot down air units and many more enemy classes. Be trained to shoot in sandstorms, blizzards, rainstorms and just an ordinary training ground. Use all the firepower you’ve got.  Gather components, upgrade weapons. Fight evil wherever it hides. This very sense first person shooter will take you on whirlwind tour of the dangerous world. Train to do the silent assassin missions, eliminate the mob of enemies at street level or take out the single high-profile target. Train your marksman skills to finish the work. Go for the headshot! The world is in conflict so you have to become an elite killer and navigate through secret missions across the globe. Pack your firearms join the tactic team and go for the hunt! <br/><br/><br/>Features:<br/>Unlock sniper and assault weapons<br/>Hundreds of dangerous missions<br/>Many different targets<br/>Play it anywhere - no internet (wifi or LTE) is needed! <br/>No data usage - our game does not consume any of your data!<br/>Compatibility - it works on all mobile devices - smartphones and tablets<br/>Blistering action sequences<br/>Boasting spectacular graphics<br/>Great shooting range experience<br/>Plenty of sniper weapons - unlocking with the progress or rewarded ads<br/>Free sniper game! No hidden charges!<br/>Achievements", "metacritic": null, "released": "2016-04-20", "tba": false, "updated": "2019-07-30T16:00:27", "background_image": "https://media.rawg.io/media/screenshots/375/375cf153d6b6f5713089aa9ff2fc6d1a.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 124, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Action", "Simulation", "Sports"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}