{"id": 88592, "slug": "last-fish", "name": "Last Fish", "name_original": "Last Fish", "description": "Last Fish is a stylish black and white action game about the survival of a tiny fish in toxic water filled with goo.<br/><br/>Eat food, avoid goo, escape the shadowfish. Survive.<br/><br/>FEATURES<br/>* Intuitive controls - tilt the device or use a controller!<br/>* Stylish monochromatic Retina Display graphics<br/>* Atmospheric soundtrack<br/>* Simple and addictive game mechanics<br/>* 45 levels and 5 arcade stages<br/>* 3 star performance score on each level<br/>* Game Center achievements and leaderboards<br/><br/>PRESS QUOTES<br/>\"Last Fish felt poetic in some ways.\" - DIYGamer<br/><br/>\"Last Fish is a satisfying swim through a world of light and shadows.\" - Kotaku<br/><br/>\"Within 15 minutes of downloading the game I was hooked.\" - AppAdvice<br/><br/>\"Last Fish is proof that games can be artistic, and more importantly that artistic games can be fun.\" - TouchMyApps<br/><br/>GAME MECHANICS<br/>Control the fish by tilting the phone/tablet. Alternatively you can also use a controller, Sphero or Dice+.<br/><br/>Eat food to gain health. Avoid touching goo as it decreses health. Complete the objectives but beware of the shadowfish.<br/><br/>LEVELS<br/>In each level you have to complete one of four objectives: survive for a specified amount of time; quickly follow a trail of rings; clear checkpoints; eat food with caution to reach a specific amount of health. Every level is different, be it food quantity, goo quantity, speed, size, movement patterns, health lost rate, number and speed of shadowfish. All these combined make each level unique.<br/><br/>ARCADE<br/>Survive as long as possible. Arcade starts with lots of food and some goo, but over time the food gets more rare and more goo appears. The fish also loses more health as time passes. Then appears the shadowfish. Survive, until the inevitable end...<br/><br/>SUBSCRIPTION INFO:<br/><br/>Subscribe to play the game and many more!<br/>• The subscription gives you unlimited access to all the games offered in Playond and includes:<br/>\t- A lot of amazing games<br/>\t- Many hours of play time<br/>\t- New games added all the time<br/>\t- No ads or extra payments<br/>• Subscription length: weekly, monthly<br/>• Your payment will be charged to your iTunes Account as soon as you confirm your purchase.<br/>• You can manage your subscriptions and turn off auto-renewal from your Account Settings after the purchase.<br/>• Your subscription will renew automatically, unless you turn off auto-renew at least 24 hours before the end of the current period.<br/>• The cost of renewal will be charged to your account in the 24 hours prior to the end of the current period.<br/>• When canceling a subscription, your subscription will stay active until the end of the period. Auto-renewal will be disabled, but the current subscription will not be refunded.<br/>• Any unused portion of a free trial period, if offered, will be forfeited when purchasing a subscription.<br/><br/>Terms of service: https://www.playond.com/tos.html<br/>Privacy policy: https://www.playond.com/privacy.html<br/><br/>Have a feature request you would like to see in a future version of the game? Do not hesitate to contact us at support+last-fish@playond.io", "metacritic": null, "released": "2010-12-14", "tba": false, "updated": "2019-07-29T11:32:21", "background_image": "https://media.rawg.io/media/screenshots/7f4/7f41907dfd61ec748642868ca49630a1_iJDEjQr.jpg", "website": "http://pyrosphere.net/lastfish/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 66, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bending Spoons Apps IVS", "Pyrosphere, Lda"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Bending Spoons Apps IVS", "Pyrosphere, Lda"], "esrb_rating": null}