{"id": 886041, "slug": "tetrisaurus", "name": "Tetrisaurus", "name_original": "Tetrisaurus", "description": "<p>This game is a submission for DinoJam2, Thank you for playing! See if you can beat my high score of 4560! </p>\n<p>Source code at: </p>\n<p>https://github.com/xtr3m3nerd/tetrisaurus<br/></p>\r\nThe Game's Story\r\n<p>You are a dino chilling in a canyon when the nearby volcano erupts! Dodge blocks and clear rows to save yourself from going extinct!</p>\r\nControls and Instruction Guide\r\n<p>A or Left Arrow Key - Move Left</p>\n<p>D or Right Arrow Key - Move Right</p>\n<p>W or Up Arrow Key or Space - Jump</p>\n<p>S or Down Arroy Key - Move block down faster</p>\n<p>This game is a 2d platformer combined with a Tetris clone with a couple varying twists.  You control a little dino who is trying to avoid extinction by being crushed from volcanic debris.</p>\n<p>Dodge the blocks to stay alive, the next block will shoot as soon as the current one lands. The block will target the player as indicated be the Next Block panel. Place the blocks to create complete horizontal lines to clear the blocks. Over time the speed of the blocks falling will gradually increase. </p>\r\nBlocks:\r\nDebris Blocks:  \r\n<p>These blocks behave like you would expect a tetris block to behave</p>\r\nLava Blocks:  \r\n<p>If your dino touches the lava blocks they will lose a heart. Lose 3 hearts and you will go extinct</p>\r\nSand Blocks:  \r\n<p>Sand blocks will keep falling as long as there are no blocks beneath them. </p>\r\nThoughts on the Game\r\n<p>This was an interesting project for our group when we started out the jam we had big dream and had a multiplayer strategy game that we had designed. Unfortunately life managed to throw a bunch of curve balls in at the beginning of the jam and after a week in we realized we were in over our heads and needed to pivot if we wanted to have a functional game to submit to the jam. Hence Tetrisaurus was born over the last 3 days of the jam. </p>\n<p>Tetrisaurus was meant to be an experiment with merging a 2d platformer with a Tetris clone. It presented some interesting challenges because you are still playing Tetris, but now your control of the blocks is severely limited as you cannot move or rotate the block after it has been launched, while at the same time having to consider the mobility of the platformer character based on your actions. There was a lot of trial and error trying to balance the movement with the block selection, but I think we got the game to a good place. </p>\n<p>Adding the different block types was an interesting exercise as they really changed the dynamic of the game. If we had more time there were several other different block types that we had wanted to test out. <br/></p>\n<p>Overall I am very happy with this project. Despite its rough start and almost a week's worth of work lost, I think we made a game that is silly and fun to play. Thank you again for looking at out project. We greatly appreciate any feedback! \r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-11-21", "tba": false, "updated": "2022-11-25T14:04:21", "background_image": "https://media.rawg.io/media/screenshots/865/86529bb9b79bd2e46044abc03a34eb26.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["Cranberry Ninja"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}