{"id": 88610, "slug": "new-york-taxi-driver-simulator", "name": "New York Taxi Driver Simulator", "name_original": "New York Taxi Driver Simulator", "description": "Race your way carefully in the traffic to pick up or drop off passengers in this best Free Taxi Driver realistic simulator game of 2016! Best choice for all the driving &amp; parking games fans! Experience different taxi cars with various speed, parameters and unique paintworks. Grab the bonuses for being on time! Park the car (taxi) in the right spot. Be the best yellow cab driver in New York! Drive your taxi from Brooklyn to Manhattan, from Queens to Staten Island or Harlem! Find an alternative route, don’t wait in a traffic jam! Pay attention to the environment and traffic rules! Do not crash the car! Get the passengers to the designated location in New York. Test your patience - it’s not a racing game - it’s more like a parking &amp; driving simulator game, so try to become a taxi / cab driver in one of the best 2016 taxi simulators. Real life traffic, people walking, traffic lights, intersections - all these in one superb taxi driver simulator game! Fasten your seatbelts and master your driving skills! Does the thought of driving gives you a major rush? Then fasten your seatbelts and experience the craziest driving adventure ever! Complete challenging missions, get ready for a wild ride, feel the thrill of riding through the busy city centre of New York! Don’t be tardy - race around the New York and complete missions! Be smart - find the best route to the destination and save precious time! Enjoy easy controls and smooth game play while cruising through the city! <br/><br/>FEATURES:<br/>Engaging driving missions<br/>Smooth and simple controls <br/>Realistic taxi driver experience<br/>Extremely precise driving simulator<br/>Day/night mode<br/>Real-life traffic!<br/>Shop with power ups (v8 engines, turbo, nitro etc.)<br/>Amusing video and sound effects<br/>Realistic Animated Passengers<br/>No internet (WI-FI) needed to play<br/>Completely free!<br/><br/><br/><br/>If you’re a fan of driving and parking games try our other games such as Parking Princess: game for girls or USA Parking Ace. Want to feel the thrill driving the emergency vehicle such as Fire Truck, Ambulance or Police Car? Try our games such as: Emergency Firetruck Rescue Simulator and EMS Ambulance simulator! Just click “see other games”! And enjoy playing our free games!<br/><br/><br/>Coming soon: <br/>Multiplayer<br/>Drag Race mode<br/>Multi level parking<br/>London city taxi levels<br/><br/>Drive fast through the traffic<br/>Pick up and drop off the passengers<br/>Be an awesome yellow cab driver in New York!  <br/><br/>Get in the cab, pick up passengers, race through the traffic. Be the yellow cab driver!", "metacritic": null, "released": "2016-06-17", "tba": false, "updated": "2019-07-30T16:03:51", "background_image": "https://media.rawg.io/media/screenshots/fe9/fe922322af1dc9fe44426ad89787ec62.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Simulation", "Racing"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}