{"id": 886278, "slug": "cuana", "name": "Cuana", "name_original": "Cuana", "description": "Place yourself in the shoes of Johnny with his typical teenage problems. Eat lots of beans, discover the hidden abilities of your body and learn to utilize them to progress in a colorful cartoony universe of Cuana. Master techniques and moves that will help you weasel out of any situation and become a real winner in any scenario. Help Johnny succeed in his oneway relationship with Monica by unleashing smelly hell upon the unwary and treating them with some unexpected gassy surprises such are ordinary raspberries, fart mines, and fart bombs.<h3>A VERY GASSY STORY</h3><br/>Johnny is a teenager who hates healthy food. His mother forces him to eat beans since a certain psychologist on TV said that mothers need to introduce their kids to a healthy diet. After eating the canned beans, Johnny discovers the hidden abilities of his organism. Now he commands a very powerful weapon of mass destruction... Hmm... Farts... Through mastering this newly acquired superpower, Johnny aims to win the heart of his long-time crush Monica. However, each and every time it doesn't work as expected. Will he manage to overcome his problems, defeat his worst enemy Greg, and make Monica fall in love with him? It's up to you to find out.<h3>LEVELS</h3><br/>The game features 6 levels - <strong>Bus</strong>, <strong>School</strong>, <strong>Grocery Store</strong>, <strong>Cafe</strong>, <strong>Airport</strong>, and <strong>Airplane</strong> levels. <br/><br/>Some levels require Johnny to fill the room with unpleasant smells without anyone noticing. Other levels can only be accomplished if Johnny causes enough havoc on the premises. Each level has unique conditions for winning.<h3>POTENT WEAPONS</h3><br/>Command 3 potent weapons at your disposal - <strong>Ordinary Fart</strong>, <strong>FartBomb</strong>, and <strong>FartMine</strong>.<br/><br/>Ordinary fart comes in handy to relieve pressure from your stomach, cause havoc, surprise other characters in the game, and even open doors.<br/><br/>FartBomb can knock out NPCs at a distance. It requires beans to pump enough pressure into your digestive system.<br/><br/>FartMine is more for tactical players who want to get rid of NPCs that walk around in the game through covert operations. Delivering FartMine requires beans too.<h3>DIFFICULTY LEVELS</h3>I can say for sure that you can win Cuana on easy-peasy and normal difficulties. However, even I - the developer of the game, have no idea if it's even possible to win on Gas Bomb difficulty. You gotta find out that for yourself!", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2022-11-28T03:30:32", "background_image": "https://media.rawg.io/media/screenshots/494/49418558104b087ce82d72ea0b547d67.jpg", "website": "https://awngames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 177, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aleksandre Glonti"], "genres": ["Adventure"], "publishers": ["AWN Games"], "esrb_rating": null}