{"id": 886269, "slug": "summer-crush", "name": "Summer Crush", "name_original": "Summer Crush", "description": "Summer Crush is a visual novel for adults where you have to get into the role of a young man who has just graduated from high school and is about to go to university. The last summer of your childhood would have passed you by, but you agree to go to a random party, and after that your whole life changes completely. Now it's up to you to make sense of what happened and untangle the tangle of a story full of fun, girls, and, of course, sex.<br/><br/><h3>FEATURES</h3><br/>Summer Crush is a story-driven visual novel where every choice you make matters and is sure to affect the further events of the entire story. <br/>The game features:<br/><ul><li>Over 4,500 renderings in Full HD resolution<br/></li><li>Fascinating storyline<br/></li><li>6-8 hours of gameplay for the first four episodes<br/></li><li>Over 100 animations<br/></li><li>Special renders with girls to decorate your desktop or to impress friends in your Steam activity feed<br/></li><li>Wonderful music and sounds to create a special atmosphere<br/></li><li>A range of girls, each with their own character and story</li></ul><br/><h3>CONTENT</h3><br/>Since this is a visual novel for adults, it has a number of attributes inherent in the genre:<br/><ul><li>Blow jobs<br/></li><li>Masturbation<br/></li><li>Masturbation with other people's hands<br/></li><li>Foot masturbation<br/></li><li>Cunnilingus<br/></li><li>Anal sex<br/></li><li>Creampie and anal creampie </li></ul>And much more!<br/><br/><h3>GAMEPLAY FEATURES</h3><br/>As you progress through the story, you will invariably be faced with the need to make specific choices. For example, deciding to go on a date with one girl will cause you to miss out on a date with another girl. In addition, some girls know and dislike each other. If a girl finds out that you show your attention to her rival - there will be consequences. It is impossible to see all the content in one playthrough. Choose wisely!<br/><br/><h3>POST-RELEASE CONTENT</h3><br/>All future episodes will come out as free updates and you don't have to pay for them.<br/>For newcomers, it will be helpful to know that you can play Visual Novels with one hand.", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2023-11-30T07:52:25", "background_image": "https://media.rawg.io/media/screenshots/1f0/1f06f5a7cb9ca6ff92b00048f9f55db4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 11, "beaten": 2, "toplay": 5}, "playtime": 1, "achievements_count": 69, "ratings_count": 3, "suggestions_count": 431, "game_series_count": 0, "reviews_count": 3, "platforms": ["PC"], "developers": ["Wet n' Juicy Games"], "genres": ["Indie"], "publishers": ["Wet n' Juicy Games"], "esrb_rating": null}