{"id": 886237, "slug": "sacred-ember", "name": "Sacred Ember", "name_original": "Sacred Ember", "description": "Sacred Ember is currently in early development stages and is focusing on fighter jet gameplay. The fighter jet gameplay aims to have realistic flight models similar to flight simulators, but with controls that are easy enough for casual players to pick up and enjoy. For now, the game will focus on the PC platform, and mouse and keyboard controls.<br/><br/><strong>CURRENTLY PLANNED</strong><br/><br/>• Adding more fighter jets (SU-57, J-20, HAL AMCA), player progression, customization, and upgrade systems.<br/><br/>• Improving visual effects, such as explosions, visually damaged aircraft. Fine tuning flight model, adding damage attribute to flight model.<br/><br/>• Adding killfeed, scoreboard, hitmarkers, and other typical multiplayer features such intermission lobby and text/voice chat.<br/><br/>• Cockpit HUD, fox two missiles, and radar systems.<br/><br/>• Loot crate system to unlock vehicle skins.<br/><br/>• Expanding on the Options Menu, adding keybinding, resolution scale, and other typical options i.e. FPS Limit, Anti-Aliasing, etc. and general performance improvements.<br/><br/><strong>CURRENT FEATURES</strong><br/><br/>• Online fighter jet free-for-all matches. Multiplayer is done via peer-to-peer Steam Sessions. You can create your own sessions or join others. There are no dedicated servers<br/><br/>• F-22 Fighter jet with realistic aircraft flight physics.<br/><br/>• Cannon weapon system only, no missiles yet.<br/><br/>• Helmet HUD only. No cockpit HUD yet.", "metacritic": null, "released": null, "tba": false, "updated": "2022-11-28T02:39:27", "background_image": "https://media.rawg.io/media/screenshots/6f3/6f3f435fd110fb7d6962aa34849fc3f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Antares Development"], "genres": ["Action", "Simulation", "Indie"], "publishers": ["Antares Development"], "esrb_rating": null}