{"id": 886376, "slug": "wraith-lost-prototype", "name": "WRAITH [Lost Prototype]", "name_original": "WRAITH [Lost Prototype]", "description": "<p>Context: This game is part of the Lost Cartridge game jam where the goal is to make a game lost to time/forgotten about.</p>\n<p>  Description: My goal was to create a lost prototype of a game that would be found on the Famicom Disk System. (I didn't know how to properly incorporate the Famicom's functions like resetting and flipping disks so I just added in weird out of place unity buttons to simulate it :D). Also forgive my poor Japanese, as I used Google Translate (I put some parts in Japanese to make it seem more believable). </p>\n<p>****************************************************************</p>\n<p>Story:  One day somebody bought a FDS game thinking they were getting Moero TwinBee, but in all actuality a different ROM was written onto the disc (since FDS games were rewritable). The ROM that was written onto it was an early alpha build of an unreleased game called WRAITH that, for whatever reason, was never released or finished.</p>\n<p>The main goal of the game is to explore a mansion, collect 3 'keys' , and destroy the final boss. Along the way you can collect ammo and powerups and upgrades to increase the power of your character.</p>\n<p>There is no sound, music, saves, or continues  within this version of the game (it is unknown if there are any other builds left in the world aside from this one). Also, if you die in the game your character will sort of freeze and you'll have to reset your system. The game has only two simple enemy types, but there were at least two more that were planned, it would also seem like the final boss has been \"completed\" or is in the game at least, but its behavior is very simple. I have no idea if there are any additional levels aside from the initial one you play as you are booted back to the title screen after beating the final boss. The ending dialog makes me think there was something else planned though...</p>\n<p>**************************************************************************</p>\n<p>Meta Moment: As mentioned before this is a game jam game made in 3 days (this is actually my first ever game jam by the way)! In the future I would like to turn what I have into a full game. If you have any suggestions of what you would like to see or improvements (aside from the obvious things like adding music and make better enemies) I would greatly like to hear them. Thank you!</p>\n<p>Controls: Controls were done to best emulate a NES game controller. WASD to move, G to switch weapons (select), H to pause (start), K to shoot (Button B), and L to enter doors (Button A)</p>\n<p>Credit: Return of Ganon (font face) by CodeMan38 <br/></p>", "metacritic": null, "released": "2022-11-27", "tba": false, "updated": "2022-11-28T04:17:45", "background_image": "https://media.rawg.io/media/screenshots/513/5130d417a911a7f4b1f4a8a177e0baef.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 45, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Wasp-Hunter"], "genres": [], "publishers": [], "esrb_rating": null}