{"id": 886488, "slug": "peace-river-fs19-without-season-version", "name": "Peace River FS19 - without season version", "name_original": "Peace River FS19 - without season version", "description": "<p>Welcome in Peace River, British Columbia, CANADA. East Dawson creek, the map is based on a true elevation map, sat view, and some modifications coming from my inspiration. The map is composed by 93 fields, from small to very big sizes.</p>\n<p>- 5 farms full equiped</p>\n<p>- Dairy, hogs, feedlot, 2 grain farms</p>\n<p>- 6 sell points:</p>\n<p>- 3 grain sell points, roots, milk, hay..., manure...</p>\n<p>- You can buy everything in the industrial zone: gas, animals, herbicide, ....</p>\n<p>- Canola swath, anhydrous, customized crops, trafic, light, season mask, decofoliage compatible w. season, multiangles.</p>\n<p>- You start your career without vehicules, however I let you a gift, on your bank account. It should represents a good starting point.</p>\n<p>- Not a 4x, 16x, 64x, something different, never released on FS19. The map is 10km large, which is an unconventional size. For that reason I modified the Season mod script. I received the agreement of Realismus to integrate the modified season mod directly to the map.<br/></p>\n\n<p>WARNINGS:</p>\n<p>- Unselect Season RM mod in your mod list</p>\n<p>- The map is based on half pixel resolution. It is not in line with the Giant garantee. The map is by the way not optimized and probably required high PC performances.</p>\n\n<p>CREDITS:</p>\n<p>- NEFG for the crops, EMR, JS MAPPING, TPF for the placeables</p>\n\n<p>THANKS:</p>\n<p>Robin, for the many hours spent to test all the fields, days and nights!</p>", "metacritic": null, "released": "2022-11-27", "tba": false, "updated": "2022-11-28T05:17:09", "background_image": "https://media.rawg.io/media/screenshots/120/12099749ffd4b2fec2260f0d53aab297.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Camil Canuck"], "genres": [], "publishers": [], "esrb_rating": null}