{"id": 886538, "slug": "the-cow-jumped-over-the-moon", "name": "The Cow Jumped Over The Moon", "name_original": "The Cow Jumped Over The Moon", "description": "<p><strong>PLEASE READ GAME DIRECTIONS BEFORE YOU PLAY<br/></strong></p>\n<p><strong>Game description:</strong></p>\n<p>You are the moon. You are in charge of the tide and now apparently the cows. More specifically, you are in charge of what cows jump over you. <br/></p>\n<p>The cows have tasked you with keeping their herd pure, and if you fail then they will attack you with the great COW LASER.</p>\n<p><strong>Game directions:</strong></p>\n<p>The cows will send you descriptions on what the \"evil\" cows look like, and you need to get rid of them before they finish jumping over you. You can get rid of a cow by hitting \"space\" or \"enter\" while it is on screen. <br/></p>\n<p>You can see the evil cow identifiers  in the bottom half of the game window. Each card only relates to ONE descriptor of the cows</p>\n<p>For instance:<br/><br/></p>\n<p>With this set up you should be looking out for green eyes, green spots, and brown hoofs. <br/></p>\n<p>Traits in the picture of the cards that are not mentioned in the text should be disregarded (example: The blue eyes in the green spots card picture, does not necessarily mean that an evil cow identifier is blue eyes)</p>\n<p>Evil cows could have just one identifier or all identifiers. They are all just as evil (according to the cows).</p>\n<p>The goal is to get the highest score you can.</p>\n<p><strong>HAVE FUN!!!</strong><br/></p>", "metacritic": null, "released": "2022-11-27", "tba": false, "updated": "2022-11-28T05:38:42", "background_image": "https://media.rawg.io/media/screenshots/7db/7dbcbc757df49b233a06ba49f69d7a43.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["melonllama"], "genres": [], "publishers": [], "esrb_rating": null}