{"id": 88657, "slug": "notes-on-blindness-vr", "name": "Notes on Blindness VR", "name_original": "Notes on Blindness VR", "description": "Arte Experience presents:  Notes On Blindness, a virtual reality journey into a world beyond sight. <br/><br/>\"A magical VR Experience\" - Guardian<br/><br/>\"Mesmerizing\" - Motherboard - Vice<br/><br/>\"Poetic and timeless\" - Le Monde<br/><br/>In 1983, after decades of steady deterioration, John Hull became totally blind.<br/><br/>To help him make sense of the upheaval in his life, he began documenting his experiences on audio cassette. These original diary recordings form the basis of this six-part VR experience, an interactive non fiction using new forms of storytelling and gameplay mechanics to explore his cognitive and emotional experience of blindness. <br/> <br/>Each chapter will address a memory, a moment and a specific location from John’s audio diary, using binaural audio and real time 3D animations to create a fully immersive experience in a ‘world beyond sight’.<br/><br/><br/>Notes on Blindness VR is viewable with or without virtual reality headset (cardboard mode or smartphone mode). <br/><br/>Notes on Blindness VR is available in English, French and German. <br/><br/>Runs on iPhone 5 (or later) and Ipad 5 (or later). Requires iOS 9.3.4 or later versions. <br/><br/>For full user experience, please use headphones, raise the volume and increase the luminosity of your phone.<br/><br/>Notes On Blindness VR is produced by Ex Nihilo, ARTE France, and the French startup AudioGaming, in co-production with Archer’s Mark. <br/>It has been supported by the TFI New Media Fund and Ford Foundation – JustFilms, Centre National du Cinéma et de l’Image Animée (CNC) and Région Midi-Pyrénées.", "metacritic": null, "released": "2016-10-07", "tba": false, "updated": "2019-10-22T14:21:15", "background_image": "https://media.rawg.io/media/screenshots/c28/c28a769237ab79875c6429eb4d70f386.jpg", "website": "http://arte.tv/notes-on-blindness", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["ARTE Experience"], "genres": [], "publishers": ["ARTE France Apps"], "esrb_rating": null}