{"id": 88665, "slug": "my-tubi", "name": "My Tubi", "name_original": "My Tubi", "description": "My Tubi is the only virtual pet game in which you can raise real youtubers!<br/><br/>The topmost combination between a virtual pet and a competitive online trading card game. Bring up real youtubers and their stats to fight duels against other players. With My Tubi you can now take control over the evolution of your favourite content creators!<br/><br/>Official licensed top content creators<br/>Choose your favourite Tubi among elrubiusOMG, Fernanfloo, byViruZz and Paula Gonu. You can also select four other fictitious iconic characters such as Gatete, Goblin, Nuck Chorris and Dummy Boy.<br/><br/>Virtual Pet<br/>Hatch an egg to discover which Tubi is inside. Take care of their essential needs as you train them for battle. Feed your Tubi and keep them clean, happy and relaxed.<br/><br/>Online Trading Cards Fighting<br/>Compete in cards duels against other users to entertain your Tubi and become the biggest champion ever. Unlock new items and modes while you move up upon the world ranks. <br/><br/><br/>Features<br/><br/>Real youtubers. Play with elrubiusOMG, Fernanfloo, byViruZz and Paula Gonu.<br/>Virtual pet. Choose your favourite Tubi, breed it and evolve it. <br/>Customization. Decor your room and dress your Tubi as you wish. <br/>Online duels. Compete in a trading card game against other users.<br/>Social ranking. Try to keep your Tubi in the top ranks.<br/>Management. Collect items to improve your inventory and get new visuals.", "metacritic": null, "released": "2017-12-13", "tba": false, "updated": "2019-07-30T14:04:39", "background_image": "https://media.rawg.io/media/screenshots/466/4663ba4d279800c695e1b0dec9c4d130.jpg", "website": "http://www.uplayonline.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 125, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["U-Play Online"], "genres": ["Simulation", "Card"], "publishers": ["U-Play Online"], "esrb_rating": "Everyone 10+"}