{"id": 887, "slug": "call-of-duty-infinite-warfare", "name": "Call of Duty: Infinite Warfare", "name_original": "Call of Duty: Infinite Warfare", "description": "<p>Thirteenth in a row the main game of the series Call of Duty</p>\n<p>The single player campaign of this game takes action far beyond our planet. Earthlings do not have enough resources, they go after them to other planets, organize colonies, but at some point the inhabitants of the colony on Mars begin to fight for independence from Earth.</p>\n<h3>New conditions and mechanics</h3>\n<p>New conditions bring new gameplay mechanics into the game, such as zero-gravity environments. Players have a boost pack, and a grappling hook, which allow players to move in these zero-gravity environments easily, they can visit different planets, satellites and asteroids in the solar system.</p>\n<p>Both space combat and the &quot;boot-on-the-ground&quot; gameplay are available in the game as its key focuses.</p>\n<p>The player controls Captain Nick Reyes, a Tier 1 Special Operations pilot, engaged in aerial combat with enemies using his transforming fighter, the Jackal.</p>\n<p>Retribution is a central hub of the game’s world. In Retribution, you can view your progression and start main campaign missions. There are also group of secondary quests called &quot;Ship Assaults&quot; which gives cosmetic and customization items, upgrades to the Jackal, and some new story details.</p>\n<p>Hero also has a wrist computer, which allows him to hack into enemies&#39; gadgets and machines.</p>\n<h3>Multiplayer</h3>\n<p>The «Combat Rigs» is a major overhaul to the class system introduced in Infinite Warfare. Like a Specialist system in Black Ops III, there are six rigs: Warfighter, Merc, FTL, Stryker, Phantom and Synaptic. With different payloads, weapons, abilities and playstyles for each class.</p>\n<h3>Zombies</h3>\n<p>The game has a completely separate part - the cooperative multiplayer Zombies mode, which has its own gameplay mechanics and story.</p>\n<p>In this mode, the action takes place not in space, but on Earth. Or rather, in the special reality of the horror film, in which the characters of the game and the actors are captured - the stars of many famous films: David Hasselhoff, Kevin Smith, Pam Grier, and Cassandra Peterson who reprises her role as Elvira, Mistress of the Dark.</p>", "metacritic": 73, "released": "2016-11-04", "tba": false, "updated": "2024-04-08T18:49:13", "background_image": "https://media.rawg.io/media/games/6f7/6f7341dd656910be2c2cda39193a7ec9.jpg", "website": "https://www.callofduty.com/infinitewarfare", "rating": 3.57, "rating_top": 4, "added_by_status": {"yet": 119, "owned": 2179, "beaten": 573, "toplay": 126, "dropped": 146, "playing": 19}, "playtime": 10, "achievements_count": 836, "ratings_count": 591, "suggestions_count": 516, "game_series_count": 29, "reviews_count": 595, "platforms": ["Xbox One", "PC", "PlayStation 4"], "developers": ["Infinity Ward"], "genres": ["Action", "Shooter"], "publishers": ["Activison"], "esrb_rating": "Mature"}