{"id": 88706, "slug": "wildlife-sniper-shooter-real-hunting-mission", "name": "Wildlife Sniper Shooter Real Hunting Mission", "name_original": "Wildlife Sniper Shooter Real Hunting Mission", "description": "When you think of horrible forests, hunting sniper missions in your head wolfs full of dangerous wild animals like Pig, Fox, deer, bear and more. A sniper rifle and other tools for hunting animals with the hunting and sniper fire in your head is the legendary sniper. In this mission, you must look for hunting and hunt them. I have played a lot of games for different game animals to be aware of their skills to be a hunter. The forest environment (forest) is surrounded by lush grass, trees and the Cliff Mountains.<br/><br/>With a sniper, modern materials and sniper rifle gear and go for hunting the most. Last winter and a bright sunny day looking for hunting, hunters love it. You are set in the prey to enter the forest to fight the predators. 3d sniper shooting skills should be sufficient for sniper alone with a hunting rifle. Good hunting Planning and finding the best shot. Fox, Bear, Deer, Wolf and other forest wildlife kill. By the way, the forest animal killer to protect themselves in the middle.<br/><br/>To clear the level you have to hunt more animals as lion within shortest time. And, to hunt more beasts you need best and accurate attacking skills, focus on the object, make a quick and sharp decision in this action game.", "metacritic": null, "released": "2016-12-29", "tba": false, "updated": "2019-10-22T13:54:02", "background_image": "https://media.rawg.io/media/screenshots/d26/d26abcbc7c672a9bad4c792c4ee7135c.jpg", "website": "https://www.facebook.com/plasmagame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayyab Mahmood"], "genres": ["Action", "Simulation"], "publishers": ["Tayyab Mahmood"], "esrb_rating": "Mature"}