{"id": 88719, "slug": "real-anti-helicopter-fight-with-one-man-army", "name": "Real Anti-Helicopter Fight with one man army", "name_original": "Real Anti-Helicopter Fight with one man army", "description": "Gunship Rescue Force Battle is a real shooter game in the world of helicopters. Enemy terrorists are training their soldiers to fight against your military base. They have created their base camps in the jungle. This is a big threat to your country. Enemy soldiers are taking their weapons and helicopters to the main front-line of your border. The enemy commando helicopters can attack from any side. This is a battle between you and aircraft.<br/><br/>In this military invasion, your have to play your best role to protect the army base from enemy heli. Your enemy is equipped with different range of helicopters raging from real choppers to heavy weight apache helicopters. As the best commando, you have given the task to counter this attack.<br/><br/>You have to prove your warfare skills, survive in extreme air strike and you have to be very clever in this gorilla war. Because many helicopter are equipped with rocket shooter guns. This is actually a test of your courage. But wait police and army aircraft will also be there to help you.<br/><br/>Use your ammunition wisely to battle long missions. you can use RPG rocket launcher anytime to protect your base. The game has very flexible controls. Destroy the huts and camps of enemy area", "metacritic": null, "released": "2017-01-16", "tba": false, "updated": "2019-10-22T14:21:16", "background_image": "https://media.rawg.io/media/screenshots/93a/93ae894adbe2c0141e4366f61d9d9032_tsED9w9.jpg", "website": "https://www.facebook.com/plasmagame/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayyab Mahmood"], "genres": ["Action", "Simulation"], "publishers": ["Tayyab Mahmood"], "esrb_rating": "Mature"}