{"id": 887164, "slug": "geometry-battles", "name": "Geometry Battles", "name_original": "Geometry Battles", "description": "2D physic based real time strategy game with simple shapes style and emphasis on cool VFX and gameplay variety. It is inspired by games like <em>Supreme Commander 2</em> but have many elements from other RTS games too. \r\n<p>Battle against AI players, build and expand your base, build defences, take over resources, unlock new technologies in upgrades tree or conquer flag point in conquer mode!</p>\n<p>Geometry Battles has many triple A games systems like creating unit groups, units action queuing or same type units on screen select by double click on one of them.</p>\n<p>There are 4 factions in game, every of them have 4 unique basic units, 3 advanced ones, 1 titan unit and 1 commander unit which have 2 active skills. Each faction also have many basic buildings with 4 unique defence structures</p>\n<p>One of main features is gameplay rules and there are over 20 of them! Your can change your gameplay dramatically by changing players health amount, resources income, turning off some unit or building type, enabling flag point in destruction mode or disabling auras or rogue units on maps and many more!</p>\n\n<p>Extended version of the game include:</p>\n<p>-Fourth faction: Abstract</p>\n<p>-5 more maps</p>\n\n<p>If you have questions or want to give feedback : \r\n</p>\n<p>Discord\r\n</p>\n<p>You can also find me on twitter : \r\n</p>\n<p>My twitter</p>", "metacritic": null, "released": "2022-11-26", "tba": false, "updated": "2022-11-28T09:47:18", "background_image": "https://media.rawg.io/media/screenshots/fa9/fa9fb4a58763d8ef86cb0d05472b6a9b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HyperStellar Games"], "genres": ["Strategy", "Sports"], "publishers": [], "esrb_rating": null}