{"id": 88723, "slug": "elf-archer-vs-orcs-and-gobblins-clash-of-civilisat", "name": "Elf Archer vs Orcs and Gobblins - Clash of Civilisations", "name_original": "Elf Archer vs Orcs and Gobblins - Clash of Civilisations", "description": "Orc invasion is on. Defend the magic fantasy fortress from hordes of bloodthirsty orcs, evil mages, wizards and goblins sent by Evil Mage! As an Elf-Archer: Master of the bow, you must save the Elf Castle and protect the Queen. Hunt orcs, kill goblins, fight the evil mage. Become an ultimate Elven Bow Hunter! Use your archery skills to protect other elves. Friendly knight and fortress defenders will help you, but you must shoot precisely. If you hit friendly unit you will fail. Mages will cast spells, orcs will attack you with sword, axe and other medieval weapons. ! Orc terror must be stopped. Defence of the castle is crucial. Elf race will be grateful if you can survive the 40 day long siege of the fortress. Clear the Dungeon, protect the Magic Passage, defend the Ancient Altar. <br/><br/><br/>In Elf Archer: Orc Fortress Siege you get:<br/><br/>Different environments: Dungeon, Ancient Altar, Magic Passage, Fortress and Castle. <br/>You can use Longbow with magic arrows. <br/>Shooting orcs in the head is more efficient<br/>Survival mode (defend the Queen, defend the Castle)<br/>Hunter mode (hit the Orc Commander)<br/>Achievements <br/>Leaderboards - you can compete with your friends<br/>Wind factor! Arrows actually turn - Take an amendment to the wind<br/>Free to play! No money needed!<br/>Works Offline! You can play without Internet<br/><br/>How to play:<br/>Tap to stretch the bow<br/>Aim the target (hit the head for more points!)<br/>Bow reloads automatically<br/>Bow will start shaking when stretched for too long!<br/>Don’t get killed", "metacritic": null, "released": "2016-02-24", "tba": false, "updated": "2019-07-30T16:04:23", "background_image": "https://media.rawg.io/media/screenshots/22d/22d8cb64da48b15b3007bdbb62dd56df.jpg", "website": "http://playcoolzombiesportgames.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 243, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Action", "RPG", "Sports"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}