{"id": 887281, "slug": "tabletop-club", "name": "Tabletop Club", "name_original": "Tabletop Club", "description": "Physics-based 3D sandbox\r\n<p>In Tabletop Club, you are given a box of toys to play with, and it's up to you what you do with them! Sure, you can play board games, but why not make a house made of dice, then frisbee it with a poker chip? Draw on the table while waiting for your opponent to make a move in chess, or flip the table into deep space after losing an all-in bet? The table is your oyster!<br/></p>\r\nOnline multiplayer\r\n<p>You can play online with friends in the click of a button, no login or sign-up required! Simply host a game, and share the room code with your friends. You can also play singleplayer, with no internet connection required.<br/></p>\r\nImport your own assets\r\n<p>Do you have a D&amp;D campaign in mind? Want to command an army in Warhammer? Or is there another board game you want to play? Luckily, the game uses a modular and easy-to-use asset pack system that makes it really quick to import your images, models, music, and more!<br/></p>\r\nFree and open-source\r\n<p>The game is completely free to play, and the source code is available on GitHub!</p>\n<p>You can also help contribute to the game! From submitting code and assets, to suggesting ideas, translating the project, or even finding bugs, there's a lot of ways that you can help make the game better and more accessible.<br/></p>\r\nCreated with a modified version of the Godot Engine. Screenshots captured by Samantha Johnson. Details about in-game assets shown on this page can be viewed here, and in the config.cfg files of the default asset pack.", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2022-11-28T10:29:02", "background_image": "https://media.rawg.io/media/screenshots/216/2160599226f52da07550cec9cf42658c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["drwhut"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}