{"id": 887256, "slug": "milky-way-punks", "name": "Milky Way Punks", "name_original": "Milky Way Punks", "description": "Can you survive the alien hordes?\r\nLocal Multiplayer 1-4 players\r\n\n\n<p>Animais de uma fazenda são abduzidos e treinados por alienígenas para lutar contra uma raça extraterrestre inimiga, porém em determinado momento eles se rebelam, viram <em>punks </em>e buscam fugir da nave na qual se encontram. </p>\n<p>O jogo começa em um dos treinamentos destes animais, uma espécie de tutorial, com o  jogador controlando os animais modificados aprendendo a manusear as armas. A partir de certo momento, o jogador tem a opção de atirar nos extraterrestres que estão conduzindo o treinamento, a partir disso, dentro da nave surgem hordas de inimigos tentando impedir os animais de fugir. O jogo então consiste em sobreviver as hordas de inimigos com dificuldades crescentes e explorar diferentes áreas da nave no intervalo entre as hordas.\r\n</p>\n\n\n\n<p>Farm animals are abducted and trained by aliens to fight against an enemy extraterrestrial race, but at a certain point they rebel, turn into punks and try to escape from the ship they are on.</p>\n<p>The game starts in one of the training sessions for these animals, a kind of tutorial, with the player controlling the modified animals and learning how to handle weapons. From a certain point on, the player has the option of shooting the extraterrestrials who are conducting the training, from that moment on, hordes of enemies appear inside the ship trying to prevent the animals from fleeing. The game then consists of surviving hordes of enemies with increasing difficulty and exploring different areas of the ship in between hordes.</p>\n\n\r\nKeyboardJoystickJOIN GAME<br/>MOVEMENT<br/>SHOOT<br/>RELOAD<br/>DASH<br/>DROP GUN<br/>INTERACT<br/>LIGHTENTER<br/>WASD<br/>RIGHT CLICK<br/>R<br/>SHIFT<br/>Q<br/>F<br/>TSTART BUTTON<br/>ANALOG CONTROL<br/>R2 (RIGHT TRIGGER)<br/>UPPER BUTTON<br/>L2 (LEFT TRIGGER)<br/>RIGHT BUTTON<br/>BOTTOM BUTTON<br/>R3\r\n\n\n<p>Felipe Cadavez Oliveira</p>\n<p>Jônatas Alves Lopes</p>\n<p>Mateus Resende Paludetti</p>\n<p>Melissa Motoki Nogueira</p>\n<p>Pedro Liduino do Nascimento</p>", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2022-11-28T10:19:49", "background_image": "https://media.rawg.io/media/screenshots/d4f/d4f06e770919b9a2f27218cd7f23ea71.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cada", "Jonyzim", "Motokiyo", "Ryu Lidu"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}