{"id": 88734, "slug": "rope-hanger-monkey-ninja", "name": "Rope Hanger: Monkey Ninja", "name_original": "Rope Hanger: Monkey Ninja", "description": "Start dangerous arcade adventure as a Monkey Ninja! Swing &amp; fly with rope to help cute animal escape! No cliff hanger! Beautiful city and jungle landscapes awaits for exploration lite fans!<br/> <br/>Epic arcade adventure begins<br/>Start a fun epic quest and escape! Hang like a monkey, vine like a spider and be quick like a ninja! Small game for swinging fans - boys and girls! Simple mini sandbox swinger in a dangerous hanger world. Don’t drag along! Escape from the real world as a Ninja Monkey! Use a rope to fly from point to point! How far can you go? Easy yet challenging addicting climber game for girls and boys, for kids and family! Cool ninja dude on an epic quest for survival! Spider game without any spider! Just a cute animal jumping, swinging and banana picking! Endless beautiful sandbox levels to jump and explore! Simple arcade adventure with lite exploration! Crafting &amp; building your own jumping &amp; swinging legend!<br/> <br/>Swing with tap tap, fly with rope<br/>Tap tap to swing and fly high for the highest score! Use a rope to survive in a dark city or lush jungle! Travel through beautiful landscapes, but don’t forget about the energy bar! Jump on bananas to regain health! It’s a must in your dangerous epic quest for survival! Free arcade adventure game for best boys and girls! Test your skills and help cute small monkey escape!  Endless fun ninja game. Rope swinging from dusk till dawn like a true animal hero. Exploration of vast - not a small - hanger world like never before!<br/> <br/>Earn jumping bananas and let Monkey Ninja survive<br/>From dusk till dawn, from a city to jungle and river waterfall - jump and earn bananas to fly even longer! It’s not so easy! Monkey Ninja will fly as far as you swing! Endless sandbox experience in the beautiful hanger world! Avoid obstacles like blocky cube hook or small square building balconies! Don’t lose your hang! Rope and hook are your best friends in this epic quest for survival in the dangerous swinging world! Small game for small boys and girls! Exploration lite hanger with arcade adventure! Dash fly and escape on rope from the real world! Don’t forget about banana picking! Extreme adventure fun for kids and family alike! Best free mini swinger!<br/> <br/>CORE FEATURES:<br/>Hang out with small Monkey Ninja.<br/>Swing and fly as far as you can.<br/>Fly high to get more points.<br/>Avoid obstacles!<br/>Earn bananas to regain your energy.<br/>Help Monkey Ninja escape!<br/>Endless levels in different landscapes!<br/> <br/>UPCOMING FEATURES:<br/>Multiplayer mode!<br/>Co-op mode!<br/>Story mode!<br/>More skins!<br/>More obstacles to avoid!<br/>More beautiful landscapes!", "metacritic": null, "released": "2017-06-14", "tba": false, "updated": "2019-07-30T16:06:01", "background_image": "https://media.rawg.io/media/screenshots/7ca/7cabadc1683708d0bfee33b385b5d1cd_0A3qc8n.jpg", "website": "http://playcoolzombiesportgames.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "genres": ["Adventure", "Arcade", "Casual"], "publishers": ["PLAY COOL ZOMBIE SPORT GAMES SP Z O O"], "esrb_rating": null}