{"id": 887366, "slug": "dark-space-itch-a-j-carmichael", "name": "Dark Space (itch) (A. J. Carmichael)", "name_original": "Dark Space (itch) (A. J. Carmichael)", "description": "<p>There was once a space alien race called the Crowtheans. They once built an incredibly advanced interstellar civilization stretching a whole star system. Their lives were thriving, prosperous, and peaceful. One fateful day, a huge colossal army arrived in the Crownteans' star system and started destroying everything in their path. The planet was plundered, entire cities were obliterated to nothing, and the Crowntheans were quickly enslaved by the invaders, the Evil Galactic Empire. </p>\n<p>The entire civilization was quickly toppled. The last leader of the Crownthea begins a desperate plan to survive. He chose several family member under his care and sent them on the latest, state-of-the-art spaceship called Leviathan, which can travel at lightspeed with the help of warp machine. He also gifted them an ancient mystical power of their race, which will help them in their journey. </p>\n<p>Nova was the leader of the last survivor of Crowntheans. She and the Leviathan Crew, as the survivor was called, has traversed lightyears while evading the pursuit of the Evil Galactic Empire's army with the help of the ancient mystical power. </p>\n<p>Now, decades later,  the Leviathan crew has finally reached the Final Barrier, the outermost reach of the Empire's influence. Once they crossed this final border, they would be completely free from the Empire's influence and can finally start searching for a new home. Unfortunately, the ancient mystical power suddenly stopped working, and the Evil Galactic Empire finally managed to track Leviathan down as a result. The Empire quickly deployed troops to siege and prevent Leviathan from leaving and then eliminate them all. </p>\n<p>Help Nova and the Leviathan Crew in their last struggle to survive the onslaught of the enemy and escape the Evil Galactic Empire territories!</p>\n<p>Party 08 - Ourovenix</p>", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2022-11-28T11:01:02", "background_image": "https://media.rawg.io/media/screenshots/069/069712c495cb00803f1c81d8cbec326b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 8, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["A. J. Carmichael"], "genres": [], "publishers": [], "esrb_rating": null}