{"id": 887327, "slug": "quest-for-the-golden-yarn", "name": "Quest for the Golden Yarn", "name_original": "Quest for the Golden Yarn", "description": "Welcome!\r\n<p>Thanks for checking out our game: <strong>Quest for the Golden Yarn</strong></p>\n<p>The game is a cat themed, single-player, story focused, rogue-lite, deck building game where your character attempts to reclaim a city and its people from the grasp of the evil Yarn Litch.</p>\n<p>What you see here is not the finished game but an early developer demo that we wanted to share with you. Its likely we'll update this as we go! There are plenty of new features coming, including new regions, NPC's that can be recruited back to town, new stories, cards, trinkets, and much more!</p>\n<p>We really hope you enjoy what you see here, please leave a comment to let us know what you think!</p>\r\nContact us!\r\n<p>If you want to get in contact with us, please send an email to: gildedrunegames@gmail.com</p>\n<p>You can also follow us on twitter: @GildedRune</p>\n<p>We are currently still searching for funding to keep developing the game so if you are a publisher that likes what they see here please do send us an email!</p>\r\nKnown Bugs for the current version:\r\n<ul><li>Shop sale prices can be very low, and haggling does little to improve the price. (This has been addressed in newer versions of the game)</li><li>Sometimes there are some strange behaviours when clicking a lot in the haggle minigame after its suppose to be finished. (This has also been addressed in newer versions of the game)</li></ul>\n<p>If you find any more, please let us know.</p>", "metacritic": null, "released": "2022-11-25", "tba": false, "updated": "2022-11-28T10:44:43", "background_image": "https://media.rawg.io/media/screenshots/011/0111bdd843e8195addc422792429ca1e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 123, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Gilded Rune Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}