{"id": 88744, "slug": "football-chairman-soccer", "name": "Football Chairman (Soccer)", "name_original": "Football Chairman (Soccer)", "description": "Build your own football empire!<br/><br/>Create a football club from scratch, starting as a tiny non-league team, and see if you can make it through seven divisions to the very top.<br/><br/>Hire and fire managers, develop your stadium, negotiate transfers, contracts and sponsorship deals... while keeping the fans and the bank manager happy.<br/><br/>Over one million users have downloaded the Football Chairman games since launch, and they have won multiple app store awards, including the Apple Editor’s “Best of 2017”, “Best of 2016”, “Best of 2014” and “Best of 2013”, as well as Google Play’s “Best of 2015”.<br/><br/>This free version is a full, completely playable game with a few of the non-essential \"Pro\" features disabled.  Your chairman career lasts 30 seasons before you have to retire - can you make it to the top before that happens?<br/><br/>Features include:<br/><br/>- Fast-paced, addictive gameplay<br/>- Seven English divisions to conquer<br/>- Hire and fire managers<br/>- Build your stadium and facilities<br/>- Interact with the supporters<br/>- Take control of transfers and contract negotiations<br/>- Develop the club's youth and training facilities<br/>- Set the prices of tickets<br/>- Offer bonuses to the players<br/>- Negotiate sponsorship deals<br/>- Transfer-list or loan unwanted players<br/>- Pre-season friendlies<br/>- And much more!<br/> <br/>Good luck... you'll need it!", "metacritic": null, "released": "2015-06-18", "tba": false, "updated": "2019-07-30T14:15:48", "background_image": "https://media.rawg.io/media/screenshots/1f6/1f639d7d37a833597a960b160b4dfc52.jpg", "website": "http://www.football-chairman.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Underground Creative"], "genres": ["Sports"], "publishers": ["Underground Creative"], "esrb_rating": null}