{"id": 887591, "slug": "saints-inn", "name": "Saints Inn", "name_original": "Saints Inn", "description": "\n<p><strong>Psi Delta Olega Studio and Discoshar Fraternity</strong></p>\n<p>Developped during Saber Game Jam II</p>\n<p><strong>Programming</strong></p>\n<p>Lead Programming: Roman Zhigunov<br/>Programming: Viktor Shavkunov<br/>Scripting: Iaroslav Chernyi<br/></p>\n<p><strong>Art production</strong><br/>Character art: Romain Perrault<br/>Background art: Viktor Shavkunov<br/>UI art: Viktor Shavkunov</p>\n<p><strong>Game design<br/></strong>Game design: Viktor Shavkunov<br/>Text Writting: Iaroslav Chernyi<br/><br/><strong>Sound:</strong><br/>Sound design: Viktor Shavkunov<br/>Voice: Iaroslav Chernyi<br/>Sfx: Viktor Shavkunov<br/>Music: Viktor Shavkunov</p>\n<p><strong>QA: </strong><br/>Leonid Mashinskiy</p>\n<p><strong>Special thanks</strong></p>\n<p>Thanks to Leonid Mashinskiy for a lot of support with technical stuff, localization and testing<br/></p>\n<p>Thanks organizer of the Saber Game Jam II</p>\n\n<p><em><strong>Once upon a time, Satan sits in a bar with a friends and drinking beers.</strong></em><br/></p>\n<p><em>At some point Jesus come and starts shout:<br/>- What's the fuck with you accounting Satan? You have a souls' deficit.</em><em><br/>And I have fucking suspisions. Why the fuck antichrist is drinkning beers when Unbaptized circle of hell missing one soul? Or Whore of Babylon? or Byron? Nuclear Gandhi</em><br/></p>\n<p><em>- Hey man, don't blame the Nuclear Gandhi. He is very sensitive, you know it.<br/><br/>- Fuck. Satan. You know me. You know my dad... I'll come in 10 days and everything has been fixed. If no, you are fucked</em></p>\n<p><em>And Jeesus left the bar.<br/>Satan starts thinking about. How could he not send his friends back,</em></p>\n<p><em>- Got it! We need someone who would go to earth and find some sinners who would replace you guys.</em></p>\n<p><em>Byron, we are so fucking tired of your poems. <br/>So go to goddamn earth and find some sinners who would replace you and others. But fuck do it properly. Not like your shitty poetry.</em></p>\n<p><em><em>So there is the elevator. What are you fucking waiting for?</em></em></p>", "metacritic": null, "released": "2022-11-20", "tba": false, "updated": "2022-11-28T12:13:42", "background_image": "https://media.rawg.io/media/screenshots/861/861ffa0bd056ab6fa51073cfd2e1264e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ReeJK", "JJBlazej", "N0rF"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}