{"id": 887639, "slug": "5-days-of-saving", "name": "5 Days of saving", "name_original": "5 Days of saving", "description": "<p>Este juego lo creamos entre 5 personas, y lo que buscamos es que los niños pequeños puedan aprender a ahorrar energía jugando, es un juego simple de 5 niveles em donde debes apagar luces que los enemigos van prendiendo.</p>\n<p> Es nuestra primera vez creando un juegos por  lo que tiene ciertos fallos, y esta incompleto, se lanza esta versión para tener en cuenta lo que opina el publico y poder añadirlo </p>\n<p>Un poco sobre el juego:</p>\n<p>Son 5 niveles, al principio tendrás una sala de la casa nada mas y lo de mas te aparecerá en negro, conforme pasas los niveles se van desbloqueando las demás salas.  </p>\n<p>Tienes un limite de tiempo que depende de cuantas luces hayan en total, y arriba te saldrá una pila que disminuye con el tiempo.</p>\n<p>Para pasar un nivel debes de apagar todas las luces, si la pila se acaba y no te tienes todas las luces apagadas perdiste (te salta a una pantalla donde dice perdiste, pero creo que el nivel 5 esta medio bug por lo que se tarda un rato)</p>\n<p>Bugs conocidos:</p>\n<p>- Los enemigos a veces atraviesan el suelo, cuando saltan se arregla </p>\n<p>- los botones a veces no terminan de ir a si que, si estas en el teletransporte y no te funciona, dale varias veces y si eso no funciona... mira bien a que tecla le das.</p>\n<p>- te puedes pasar los niveles sin necesidad de apagar todas las luces... no te voy a decir como.</p>\n<p>creditos:</p>\n<p><a conjunto-simbolos-planos-estado-carga-bateria-telefono_9176233.htm\"=\"\" href=\"&lt;a href=\" https:=\"\" vector-gratis=\"\" www.freepik.es=\"\">Imagen\" class=\"redactor-linkify-object\"&gt;https://www.freepik.es/vector-gratis/conjunto-simbolos-planos-estado-carga-bater...</a> de pch.vector en Freepik<br/></p>", "metacritic": null, "released": "2022-11-19", "tba": false, "updated": "2022-11-28T12:30:23", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["palepasu"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}