{"id": 887788, "slug": "ascend-reborn", "name": "Ascend: Reborn", "name_original": "Ascend: Reborn", "description": "The cult classic action RPG Ascend: Hand of Kul is reborn!<br/><br/><strong>Lore</strong><br/>The ancient prophecies foretold that once the Titans' reign had ended, one of the Three Gods would claim dominion over their brethren and seize a position of ultimate power. That time has come, and now your God needs a Champion. Will you rise to the challenge?<br/><br/><strong>The Titans</strong><br/>In the deadly world of Ascend: Reborn, blood is power. The Titans–colossal, bloodthirsty, immortal giants–lumber through the World satiating painful hunger with endless feasts of human souls. Humans pray in vain as their villages are engulfed in the violent onslaught of the Titans and their monsters. The new God rise to claim their legacy.<br/><br/><strong>Caos</strong><br/>Declare your allegiance to the God of Darkness, Light, or Void. Personalize and level your Caos with hundreds of customization options including appearance, weapons, armor, gear, abilities, skills, and much more. As you journey through Ascend you’ll be rewarded with rare loot and valuable lore. Discover the secret of defeating the Titans and secure your god’s dominion to claim your place as Champion in the Crusade. <br/><br/><strong>Ascend</strong><br/>The largest rewards require the ultimate sacrifice-your character! But all is not lost, as each life dedicated to your god brings new abilities that help shape you into the ultimate Caos warrior.<br/><br/><strong>Evolving world</strong><br/>Behold the world as it changes dynamically beneath your feet, bowing to your growing power. As you discover the secret of defeating the Titans and securing your god’s dominion over the world, you’ll claim your place as a legend.<br/><br/><strong>Free-to-Play</strong><br/>Ascend: Reborn is an old-school action RPG experience with a lot of unique twists and surprises. Ascend is free to play over Steam.", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2023-07-29T14:42:46", "background_image": "https://media.rawg.io/media/screenshots/ced/ceda04c531a3cc7f0911a05585c34e1a.jpg", "website": "https://www.ascendgame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 28, "ratings_count": 2, "suggestions_count": 706, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["Outer Heaven"], "genres": ["Action", "RPG", "Indie"], "publishers": ["Outer Heaven"], "esrb_rating": null}