{"id": 887766, "slug": "polar-penguin-post", "name": "Polar Penguin Post", "name_original": "Polar Penguin Post", "description": "Polar Penguin Post is a puzzle simulation game that runs the penguin delivery company Polar Penguin Post in the freezing city state Winter Mountain.<br/>The main character \"Min\" establishes a penguin delivery company with his younger brother \"Hour\" to make her friend \"Penguin\" accepted as a family member of Winter Mountain.<h3>PPP Delivers Anything</h3>The PPP's Lists always have a lot of delivery orders stacked up. Please check the list and put delivery items in the penguin's bag correctly.<br/>Each delivery items have different sizes and shapes. There are things that can hold dozens of pieces, and things that take up half the bag by themselves.<br/>Please make good use of the space in your bag so that you can put all your deliveries.<h3>No Customer Wants A Broken Mug And A Dirty Letter</h3>If you put the glass next to the brick, the glass will break, and if you put the letter next to the sickle, the letter will break too.<br/>If you put things next to coal or oil, they'll be covered with soot and oil. But placing a blanket on a cement bag doesn't break it.<br/>In order to complete the delivery safely, we need to pack the bag considering the characteristics of the product.<br/>No one wants to get a broken glass, and the penguins don't know what's in their bags.<h3>Interact With A Variety Of Clients</h3>We have a variety of clients To exchange help, test, or accompany us with the Polar Penguin Post.<br/>Build trust in them by doing their clients' requests. Human relationships will lead you to various futures.<h3>Survive the freezing Winter Mountain</h3>Winter Mountain, the stage of \"Polar Penguin Post,\" is becoming increasingly frozen for unknown reasons.<br/>Will Winter Mountain end like this? Enjoy the fun story of Pola Penguin Post somewhere in the dying world!", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2022-12-02T04:53:06", "background_image": "https://media.rawg.io/media/screenshots/6cd/6cd8a53ef37fc2dce1dee4094f25ad9e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Little Lemon Bulb"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Little Lemon Bulb"], "esrb_rating": null}