{"id": 887781, "slug": "syndeo-complex", "name": "Syndeo-Complex", "name_original": "Syndeo-Complex", "description": "Syndeo-Complex is a first-person shooter. It is inspired by games like Half-Life and Doom (1993). You will have to explore twisting levels, fight enemies and solve puzzles. At the end of each level, you will have to defeat tougher enemies: the Nekron Kyttaron. This will allow you to progress in the game and unlock the characters' stories.<br/><br/><br/><br/>--<h3>Here is the story so far</h3><br/>You are Dyo. You were born in the spaceship Prophet 60091.<br/>You are an annihilator, a human genetically modified and augmented.<br/><br/>Your mother, whose identity remains secret, died under mysterious circumstances. She was the founder of the mega corporation Syndeo.<br/><br/>Your father, Enas, commander of the spaceship Prophet 60091, captured Miden, your loved one. His plans are unknown.<br/><br/>Your goal is to decimate your father's army and to save Miden.<br/>To do this, you must kill all the Nekron Kyttaron and then destroy the Prophet 60091 with the SH10151 orbital gun.<br/><br/>No one will do it for you.<br/><br/>--<h3>The game includes:</h3><br/><ul><li>1 mysterious hub that connects all levels<br/></li><li>4 levels (5 planned), each with its own environment<br/></li><li>3 bosses (5 planned) called Nekron Kyttaron<br/></li><li>7 weapons (10 planned) including a pistol, an assault rifle, a missile launcher, a shotgun, etc<br/></li><li>16 enemies and characters (19 planned) with their own stories to unlock<br/></li><li>3 drugs<br/></li><li>12 music tracks (50 minutes), downloadable as free DLC<br/></li><li>Philosophical dialogues<br/></li><li>Enigmatic storyline</li></ul>", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2022-12-02T05:13:25", "background_image": "https://media.rawg.io/media/screenshots/8f9/8f9b995cf9d99fd8be968a9a1df908bc.jpg", "website": "https://ddzevprod.fr", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 384, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ddzevprod"], "genres": ["Action", "Indie"], "publishers": ["ddzevprod"], "esrb_rating": null}