{"id": 887737, "slug": "deepening-fire", "name": "Deepening Fire", "name_original": "Deepening Fire", "description": "⦁ Exploring options: to find hidden levels, equipment and firebrands.<br/>⦁ Firebrands system: we attach importance to blocking. Perfect blocking makes great profits. ⦁ Practice makes perfect.<br/>⦁ Character customization: tons of equipment you can choose from. Plenty of ways you can try to walk on.<br/>⦁ Fragmented Narrative: with advances, a line of succession in story will be gradually developed.<br/>⦁ Different Ending: to unravel the good plot.<br/>⦁ Well designed maps: with traps and horror ambiences.<br/>⦁ Challenging bosses: original dual form boss, numerous aggroes.<br/><br/><br/><strong><h3>Broken World</h3></strong><br/>Homes are broken, kingdoms wither away, and revived soldiers look for everything in the ruins. Everything has changed.<br/>King Gillan is in the Hymn when monsters are wandering on the old battlefield;<br/>Knight is kind and blessed. The human-eating tree is surrounded by mosquitoes and flies；<br/>Mountain Warrior is legendary and powerful. The immortal skeleton is crying.<br/>……<br/>What's wrong with all this?<br/><br/><br/><strong><h3>Death and rebirth</h3></strong><br/>The order has never been so fragile. Time and space have been distorted when everything was in chaos.<br/>Death has never been so cheap. Since the balance was off, the fire of life could not be dissipated.<br/>Fighting has never been so difficult. It's a long journey for one to challenge the world.<br/>Again and again.", "metacritic": null, "released": "2022-11-29", "tba": false, "updated": "2023-10-29T12:41:20", "background_image": "https://media.rawg.io/media/screenshots/ce0/ce0d7a18d7a694263883bc8ced2b2632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 3, "beaten": 1, "toplay": 2}, "playtime": 4, "achievements_count": 37, "ratings_count": 1, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["VeryBigDog"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["ETime Studio"], "esrb_rating": null}