{"id": 887741, "slug": "battle-of-britain-norway-and-atlantic", "name": "Battle of Britain, Norway and Atlantic", "name_original": "Battle of Britain, Norway and Atlantic", "description": "Battle of Britain, Norway and Atlantic is a real-time, tactical naval and air warfare simulation game focusing on three campaigns in WW2, including the Battle of Britain, the Norwegian Campaign and the Battle of North Atlantic. It features 18 scenarios covering not only the naval and air battles that actually happened in the history, but also two theoretical battles that remained on the planning stage, including the famous Operation of Sea Lion. You are posted as overall commander of the battles on either Allied or Germany side, as you may choose in most battles, and tasked with various missions, such as storming Norwegian capital city, protecting Allied convoy, and fending off massive bombing against London.<h3>Features:</h3><br/><ul><li>You'll be able to manage the deck and hangar on each of the carriers, if available in the battle, and organize ship-borne reconnaissance, combat air patrol and air strikes against enemy ships and land targets.<br/><br/></li><li>You'll be able to command land-based aircraft to protect your territory, search enemy ships and land targets, and launch air strikes against them.<br/><br/></li><li>You'll be able to command land units, if available in the battle, to land on enemy controlled territory, or the other way around, to thwart enemy amphibious assault.<br/><br/></li><li>You'll be able to carry out airborne missions to support your land force.<br/><br/></li><li>Each battle map, covering an area of up to 3000km x 3000km, is built on satellite verified terrain data (mountains, hills, plain, river etc), land cover data (forest, grassland, desert etc.).<h3>Current Scenarios:</h3><br/>Norwegian Campaign:<br/>1. The Raid on Oslo<br/>2. Interception of German Invasion Force<br/>3. The Second Battle of Narvik<br/>4. The Glorious Retreat from Norway<br/>5. (Theoretical) The Duel between British Home Fleet and German Navy<br/><br/>Battle of Britain:<br/>6. Attacks on the Channel<br/>7. Attacks on the ports<br/>8. Attacks on the airfields<br/>9. Strike Back<br/>10. The Eagle Day<br/>11. (Theoretical) Operation Sea Lion<br/><br/>Battle of the Atlantic:<br/>12. The Hunt for Bismarck<br/>13. The Battle of North Cape<br/>14. The Tragedy of Convoy PQ 17<br/>15. Convoy PQ 18<br/>16. Convoy SC 7<br/>17. Convoy SC 94 <br/>18. Convoy HX237</li></ul>", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2022-12-02T04:14:48", "background_image": "https://media.rawg.io/media/screenshots/79a/79a93fc3c0c305294216d68db0350c91.jpg", "website": "http://www.sandtablesoftware.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 193, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sand Table Software"], "genres": ["Strategy", "Simulation"], "publishers": ["Sand Table Software"], "esrb_rating": null}