{"id": 887760, "slug": "virt-a-mate-vamx", "name": "Virt-A-Mate + vamX", "name_original": "Virt-A-Mate + vamX", "description": "Fantasize, Design and Create your Ultimate Sexual Experience!<br/><br/>The wildly popular \"Virt-A-Mate\" erotic VR and Desktop sandbox is now available on STEAM.<br/><br/><strong>Play in an unlimited sexual paradise.</strong> A simple big-button interface and simple in-game tutorials let you create most fantasies. Dive deeper,  and join the community of content creators, with the included professional Virt-A-Mate 1.x Creator edition.<br/><br/><strong>Experience full VR immersion</strong>, or easy Desktop (non-VR) mode.  Works with up to 8 trackers (optional).<br/><br/>Complete with hyper-realistic physics to <strong>simulate breast firmness, muscles and genitals,</strong> VAM (Virt-A-Mate) is sure to stimulate and arouse you. Full integration with the vamX game suite enables users to quickly jump into the sexy interactive side of VAM, providing a complete interactive experience where every touch will excite your virtual partner until they reach a creamy, leg shaking climax.<br/><br/>Virt-A-Mate + vamX comes with <strong>thousands of user-created assets, professional voice acting</strong> and nearly endless options and tools to create your own customized erotic experience.<br/><br/><strong>Create your ideal girlfriend (or boyfriend, or LGBT partner, with fewer options)</strong> or get naughty with your favorite popular characters, the choice is always yours.<br/><br/><strong>Play some music, fool around, and get down.</strong> Choose from hundreds of creative sex positions, an almost infinite variety of partners, and over 50 quick-switch environments.<br/><br/>Optionally <strong>feel </strong>the sexual scenarios you create, controlling automated strokers like The Handy, or track the movement of a regular Fleshlight, to synchronize in-game sex.<br/><br/>When you purchase Virt-A-Mate + vamX, you join an already <strong>vast community of free content creators</strong> that continue to push VAM forward. <strong>New vamX core features are released quarterly,</strong> and new VaM Hub content is released daily, so your VAM experience will never get old.<br/><br/><strong>Welcome to the Virt-A-Mate family! Your VAM life starts now.</strong><br/><br/><br/>VR Performance Notes: Virt-A-Mate will push the limit of any CPU/GPU when played in VR. You should expect the scene animation to update at 30fps maximum (although turning your head will generally still refresh at 90fps to prevent VR nausea). If the game slows down as you create your desired scene, try any or all of the following:<br/>1) Run vamX Menu -&gt; Plugins Tab -&gt; Give Me FPS -&gt; Standard (as explained in the main in-game tutorial).<br/>2) Turn off soft-body physics, disable mirrored surfaces, or lower the same graphics quality setting, in the Virt-A-Mate Menu -&gt; Main UI (3 horizontal bars) -&gt; User Preferences tab -&gt; Performance Tab.<br/>3) Remove clothes using the Clothes &amp; Hair tab.<br/>4) Hide the Male, so that only the Female is shown, or reduce the number of people in the scene if using more than 2 people.<br/>5) Switch to the simple black scene to remove the environment and focus on the action (1st item on the 2nd page of Scene).", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2022-12-02T04:42:44", "background_image": "https://media.rawg.io/media/screenshots/4b0/4b0121ca7a5feeffa88f43d26bc6d691.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4}, "playtime": 7, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 442, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["vamX", "MeshedVR"], "genres": ["Adventure", "RPG", "Simulation"], "publishers": ["vamX"], "esrb_rating": null}