{"id": 887838, "slug": "my-universe-my-baby-dragon", "name": "My Universe - My Baby Dragon", "name_original": "My Universe - My Baby Dragon", "description": "<strong>Raise baby Dragons and teach them their elemental magic! </strong><br/><br/>Our little friends need you to help them spread their wings! From their hatching stage to the moment they’ll be able to fly on their own, take care of your baby Dragons and help them enter the marvelous Dragons’ school! Fly off for an enchanting adventure full of magic and become the best Dragon Warden of all time!<br/>\"As the new dragon caretaker in town, it is now time for you to start your life and open your very own Dragon nursery. Choose an egg to start your adventure and help it hatch by studying its elemental magic. Whatever their element is, each baby dragon needs a home full of love to grow and thrive properly. While you help your Dragon grow, you’ll have to be very careful of its needs as it will require all your attention! Take care of your baby Dragon by petting it, teaching it magic and how to fly. Shower your new friend with love and treats until it is finally ready to fly to Dragons’ school! Take time to play with them and understand their magic in order to earn their trust and create a forever bond.<br/><br/>Raise dragons from every element and become a certified Dragonwarden!<br/><br/>🐉Hatch mysterious eggs to raise adorable baby Dragons and become the best Dragon nursery!<br/><br/><br/>🐉Teach your dragon how to fly and develop its magic through minigames<br/><br/><br/>🐉Take really good care of your dragon by petting it and rewarding its efforts with magical snacks. Create an unwavering bond with your dragon pupil that will last for a lifetime!<br/><br/><br/>🐉Collect all the achievements to become the very best Dragonwarden!", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T06:32:51", "background_image": "https://media.rawg.io/media/screenshots/972/9720d57e523db5b19ddec6f8962c3dd3.jpg", "website": "https://www.microids.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 201, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["It Matters Game"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["Microids"], "esrb_rating": null}