{"id": 887830, "slug": "once-upon-a-siege", "name": "Once Upon A Siege", "name_original": "Once Upon A Siege", "description": "Classic Tower Defence experienced through the eyes of the defender.  As a member of the Galactic Feudalist League you participate in quasi-medieval sieges on the system's local planet, pitting your skills against 2 NPC armies and a host of siege units.   Inspired by classic Tower Defence games such as Rampart and digested into a fun VR experience that offers interesting mechanics.<h3>UPGRADE</h3>Many upgrades are available in the space station shop.  Focus on personal upgrades, upgrade your cannon, upgrade your defence tower, acquire explosive rounds or purchase special defensive tech to aide you in your siege endeavours.<h3>MANAGE</h3>Manage your defence base during sieges.  Buy extra power cables to connect more functionality and upgrades while you defend.  Keep an eye on energy levels and consumption as every upgrade costs as you decide which systems to run and which systems you must do without.<h3>DEFEND</h3>The enemy will send various siege units your way.  Man your cannon and weaken their assault so that you may survive until the end.  Disable siege towers full of raiding parties and ram towers, destroy reinforcement dropships, gunships and cannons and stop missile-throwing golems from breaching your walls.  If all else fails and they storm your keep, draw your weapon and start shooting.<h3>REBUILD</h3>Quick and efficient build system to rebuild your walls and patch holes before your opponent sends armies through to end the siege.  Use your defensive upgrades to create smoke shields or forcefields around walls and buy yourself precious survival time.<h3>ENDURE</h3>Survive until time runs out by taking care of your walls and neutralising enemy strength.<br/><br/><br/>2 ARMIES <br/>10 LEVELS  <br/>WALL BUILDING SYSTEM <br/>MANY UPGRADES <br/>DEFENCE TOWER MANAGEMENT", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T06:22:56", "background_image": "https://media.rawg.io/media/screenshots/26a/26ab1e85fd2eed6bcdd722ab244ad0fb.jpg", "website": "http://blackstreamboys.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Black Stream Boys"], "genres": ["Action", "Casual"], "publishers": ["Black Stream Boys"], "esrb_rating": null}