{"id": 887848, "slug": "tree-of-mu", "name": "Tree of Mu", "name_original": "Tree of Mu", "description": "Tree of Mu is a 2D Procedurally Generated Open-World RPG which takes place in a viking land called Mu. This land was ruled by many kings and destroyed by many wars, but such cycle would not last. One of the Mages of Mu, Silje, the Runemaker, couldn't accept the fact that his own body was dying, his own flesh and bones couldn't handle so much power, as the brightest stars always burn the fastest. Silje then fled and searched for a misterious power on a journey towards the Tree of Mu, such tree were as big as the land itself and its roots would cover all the continent. Silje sat alongside the tree and whispered misterious words for days... Weeks had passed and Silje would be covered by roots and almost completely swallowed by the tree itself. Once the ritual was done, Silje, The Runemaker, was no longer, not only he had died, he had buried his own soul inside the Tree of Mu, now known as Yggdrasil. As he lived inside Mu's spirit, he could use all his powers without the limitations of his weak flesh, and with such powers, he enchanted the rivers changing all the life that once lived in Mu. Giants, Demons, Goblins... They all came from Silje's birth of this new world. To protect his creation, Silje raised the largest wall he could possibly raise, a wall made of an unbreakable magic ice, Permafrost, separating the known Earth of this magic and misterious land.<br/>You, Adventurer, you will uncover all the misterious and fortunate adventures that are hidden in this land, but be aware, merciless monsters and dangerous creatures await you. Good Luck and may the gods be with you.<br/><br/>Main Features:<br/><ul><li> Procedurally Generated World sized around 6 million Tiles.<br/></li><li> Fog of War.<br/></li><li> Hundreds of different Structures scattered around the World with Bosses, Treasures and Monsters.<br/></li><li> Six different playable races: Humans, Dwarves, Elves, Ogres, Minotaurs and Satyrs.<br/></li><li> Every Equipment in the game is different from each other, having a system that modifies them based on Rarity, Level and Type.<br/></li><li> Extremely fun Combat System inspired in old school RPGs.<br/></li><li> Very intelligent AI that is able to interact with each other on a Faction Based Reputation System.<br/></li><li> Very Large Passive Tree with multiple different paths to experiment with.<br/></li><li> Multiple different Skills and Builds to experiment with.<br/></li><li> Hundreds of Crafting Recipes.<br/></li><li> Quests and Secrets scattered around the World to uncover.<br/></li><li> It's your story, play it in your own way!</li></ul>", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T06:47:04", "background_image": "https://media.rawg.io/media/screenshots/c6f/c6f7554bb7b0342616c1abba820ad98c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 267, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Squaretide Studios"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Squaretide Studios"], "esrb_rating": null}