{"id": 887825, "slug": "missing-pictures-naomi-kawase", "name": "Missing Pictures: Naomi Kawase", "name_original": "Missing Pictures: Naomi Kawase", "description": "The most celebrated female filmmaker from Japan revisits a project that she envisioned after her 2015 film Sweet Bean. Oh Debu tells the story of Aya, an over romantic woman very complexed by her weight. Through this story, Naomi Kawase wanted to give herself a challenge trying to make a comedy, far from her naturalist, poetic previous work.<br/>\n<br/>\r\nMISSING PICTURES is a 5-part documentary series in VR that brings to life unmade films.  Shot in volumetric capture, the filmmakers Abel Ferrara, Tsai Ming-Liang, Catherine Hardwicke, Lee Myung-Se and Naomi Kawase narrate to us some key points of the movie and why it was never made. <br/>\n<br/>\r\nWhat’s MISSING PICTURES?<br/>\r\n* An immersive dive into the mind of some of the most interesting filmmakers of our time<br/>\r\n* A unique documentary about history of Cinema <br/>\r\n* Produced by ATLAS V, the award-winning studio that brought Gloomy Eyes, Battlescar, Madrid Noir, Ayahuasca - Kosmik Journey<br/>\r\n* Five independent episodes, to be discovered in any order <br/>\n<br/>\r\nA series directed by Clément Deneux from an original idea by Joseph Beauregard<br/>\r\nCoproduced by Atlas V, ARTE France, BBC, PTS, Serendipity Films, Wild Fang Films, Giioii<br/>\r\nWith the support from CNC, Pictanovo, Région Auvergne-Rhône-Alpes, Procirep-Angoa, TAICCA, Film Fund Luxembourg, RAPA and Ministry of Science and ICT (Republic of Korea)<br/>\n<br/>\r\nDuration: 14 minutes<br/>\r\nTo be experienced seated", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T06:17:00", "background_image": "https://media.rawg.io/media/screenshots/eee/eeef36663d287bbf2cc4acbf11187966.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 167, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Atlas V", "Maniamind", "Serendipity Films", "Wild Fang Films", "Giioii", "Newmatic"], "genres": ["Indie"], "publishers": ["ARTE France"], "esrb_rating": null}