{"id": 887941, "slug": "dont-get-caught-2-lifetime-disaster", "name": "Don't Get Caught 2 (Lifetime Disaster)", "name_original": "Don't Get Caught 2 (Lifetime Disaster)", "description": "<p><strong>Plot</strong></p>\n<p>Your name is Lynn, you’re an infamous robber who’s feared all across the city. However you have been running low on food. To fix this, you’re going to rob the richest house on the block. You are not a monster, however, so you’ll only take enough for you to afford lunch. Break in, take the three valuables and escape through the car.</p>\n<p>And remember: Don’t get caught!<br/></p>\n<p><strong>Controls</strong></p>\n<p>WASD - Move<br/>Q - Open doors/drawers/safes<br/>E - Hide/enter car<br/>R - Special<br/>C - Crouch<br/>Space - Drop<br/>Left Click - Interact<br/>Esc - Pause</p>\n<p>Scan around the room with your cursor, if it changes to an open hand, it means you can interact with it. Your arm can only reach so far, so make sure you’re not too far from whatever you’re trying to interact with! Crouching increases your reach.</p>\n<p><strong>Gameplay</strong></p>\n<p>Find the 3 valuables: Diamond, Money &amp; Vinyl. Make sure to place the valuables in the car, then once you have everything ready, enter the car and drive away. Just remember to open the garage door first. You will have to solve puzzles and find items all around the house, so think outside of the box! You can leave the house and come back the next day whenever you feel like it, but don’t waste a day for nothing!</p>\n<p><strong>The owner</strong></p>\n<p>You must avoid the owner at all costs! He has an awareness meter that increases the more he suspects that someone is in the house. If he ever reaches 100% awareness, he will grab his gun and call the police! He will go after any noises you make, so be careful! You can drop items on carpets to avoid making noise, as well as crouching to avoid floor creaks! Noise isn’t the only issue however, if he spots a door open when he’s sure he saw it closed last time or vice versa, he will become more aware. The more aware he is the smarter he’ll become. Awareness goes down with time.</p>\n<p>Note: the browser version has mobile support.</p>", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T07:33:12", "background_image": "https://media.rawg.io/media/screenshots/3e8/3e80e0e238343b601b2f6c9fc12f5172.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Lifetime Disaster"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}