{"id": 88796, "slug": "bike-stunt-amazing-rider", "name": "Bike Stunt Amazing Rider", "name_original": "Bike Stunt Amazing Rider", "description": "Are you a crazy motorcycle rider? Do you like doing crazy bike stunts on limitless tracks? If Yes, then it's your time to ride scooter bike as a real motorcycle rider. This bike stunt game offers extreme freestyle stunts that include flying jumps and high air stunt above water. Climb through stunts and mad rider tricks on city streets are awesome. You might have played many dirt water games but this crazy motorcycle game is addictive among all the bike stunt games of 2018. This bike racing has a real fast paced game play. Each level is more challenging and exciting. Perform some daring stunts and xtreme motorbike jumps on rooftops of high buildings. It is a freestyle motorbike stunt racing game with high tech mechanics of super bike. Real bike riding in city buildings, jump on big ramps and mad tracks in midair make this game a perfect stunt simulator. Experience the thrilling ride by enjoying the top stunts in this motorbike game and become a daredevil stuntman of a bike rider.<br/><br/>This real scooter stunt rider allows you to boost your sports bike riding skills by driving on limitless highways. Wear your helmet and ready for race in xmas. World class competition is being held on the asphalt tracks of city highways in Christmas. 98% speed up through the extreme traffic rush like a real stunt master. Beat the racing opponents while riding your traffic bike and win this speed bike rally.<br/><br/>Get ready to feel the real thrill of highway reckless racing in endless manner of 360° bike stunts. Play the most popular cycle games with 360° stunts. Enjoy the astonishing view of high tracks and experience the most realistic bike racing simulation with extreme obstacles and hurdles. Dodge the highway traffic rush while beating the rival racers and win this death bike simulation.<br/><br/>This is a top casual fast paced scooter racing game specially designed for stuntman rider. This is a showdown of 3d bike stunt games. This popular bike stunt rider offers you a various selection of real game play in motor racer mode. Every level of this stunt game is more challenging and thrilling. Now it is the time for exciting ride and crazy bang stunt on impossible tracks. Ride your crazy bike and overtake the trail bike on asphalt roads. Be careful while driving or overtaking on highway because deadly bombs are planted in racing highway. Use tricky motorbike stunts and riding skills to avoid these bombs. If you collide these bombs, your stunt bike will be destroyed.<br/><br/>Your main goal in driving games is to drive a bicycle or bike in city and do wheeling stunts over city buildings, rush traffic and streets. If you are a professional stunt master, then show some xtreme stunts in the well of death. Drive your hill motorbike with turbo speed and cheer up the crowd in street racing competition. Ride your stunt bike in endless highway roads, do illegal stunts and become the city’s most wanted stunt man rider. Ride your super speedy bike fast enough to escape because it is the race of your freedom.<br/><br/>Bike racing or car racing is 98% easy to pick up but hard to master. Race, jump and crash your way and break the rules of stunt training. Compete with other mad rivals through hidden tracks. It’s your time to step up high and prove that you are the most intense and competitive biker around the world.<br/><br/><br/>Download xtreme wheels stunt master and hit the asphalt road lane during illegal stunts in motorcycle racing rage mode.<br/><br/>Frenzy Game Features:<br/>● Tons of stunt bikes available<br/>● Breathtaking missions on heavy bike<br/>● Smooth controls and vivid HD graphics<br/>● Offline game play without Wi-Fi or internet<br/>● Addictive racing gameplay, fun guaranteed 98%", "metacritic": null, "released": "2018-01-03", "tba": false, "updated": "2019-10-22T14:21:17", "background_image": "https://media.rawg.io/media/screenshots/732/7328a6c4c7f4769d2f6f6a958c55f85a_HViUXmp.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tayyab Mahmood"], "genres": ["Adventure", "Simulation", "Sports"], "publishers": ["Tayyab Mahmood"], "esrb_rating": "Everyone 10+"}