{"id": 888013, "slug": "peas-in-a-pod", "name": "Peas in a Pod", "name_original": "Peas in a Pod", "description": "<p>The A<strong>pea</strong>calypse is here! Your goal: warp to lightspeed and reach your new home planet, P-34, before it's too late! You've escaped your home planet in a space pod. Your pod has many rooms to keep your ship and your  crew healthy and hap<strong>pea</strong>.<br/></p>\n<ul><li>The laboratory makes oxygen to keep your peas conscious. Make sure to keep your oxygen level as high as you can.</li><li>The kitchen makes food to keep your crew from from getting hungry and exhausted. Peas work harder on a full stomach!</li><li>Windows in the pod can be opened or closed to let sunlight and heat into the pod. Keep the pod's temperature at a  medium to avoid peas getting exhausted.</li><li>The crew quarters is where sleepy peas go to rest. A well rested pea is ready to be hard at work!</li><li>The weapons room defends your pod from asteroids. If your pod gets hit too much, your crew will <strong>rest in peas</strong>.</li><li>The generator room creates power for your pod. Full power is needed to get to P-34.</li><li>Fires and air leaks can be fixed with a pea wielding either a fire extinguisher or a welder's torch respectively.</li></ul>\n<p>You are now ready to command your crew. Click and drag on a pea to move them to assign them to a task. Good luck. Don't die out there.</p>", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T08:03:27", "background_image": "https://media.rawg.io/media/screenshots/f37/f37613308711ec6423c0e75d6e4d3a5f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Jirbb", "TableSandwich Games", "TheFishFlopper", "Jonah Fairweather"], "genres": ["Action"], "publishers": [], "esrb_rating": null}