{"id": 888160, "slug": "world-of-naples-lite", "name": "World of Naples Lite", "name_original": "World of Naples Lite", "description": "<p>https://store.steampowered.com/app/2128410/World_of_Naples/<br/></p><p>Full Version Coming Soon to Steam and Itch December 15. Price tag $4.99\r\n</p>\n<p>40% discount during the first week of release.\r\n</p><p>Play the Lite version for Free. ONLY first world included. <br/></p>\n<p>***Does Not Run-on Safari browser.<br/></p>\n<p>For a Better experience Play with<strong> Xbox or PSP</strong> controllers.\r\n</p>\n<p>Keyboard: Numeric Key Enter, A/D movement. Alt/Ctrl/Shift abilities. Spacebar Jump. X select character.\r\n</p>\n<p>This game is based on my childhood memories with my friend, and I would like for other players to experience the same. \r\n</p>\n<p>This game is all about playing with your family and friends on the same couch. Simple mechanics, nothing too crazy. Everyone should be able to grab a controller jump around, shoot, run and trash talk, but most importantly to HAVE FUN! with your buddies.\r\n</p>\n<p>I grew up playing games where the progress was lost after turning off the console. Well, that's what I wanted for this game, but I added a twist to it. Collecting coins YAY! Hey, wait a second! That has been done a million times. Well....true. But in my game, you collect coins to pay a toll. Now the coins are more meaningful. \r\n</p>\n<p>Key features.\r\n</p>\n<p>0-Linear gameplay.\r\n</p>\n<p>1-Simple mechanics. Run, Jump, shoot, died.\r\n</p>\n<p>2-No saving progress, old school :) \r\n</p>\n<p>3-Want to challenge your friend go over to the PVP arena.\r\n</p>\n<p>4-Challenging bosses.\r\n</p>\n<p>5-Unique art style.\r\n</p>\n<p>6-Cute characters. But don't be fooled. This game is hard.\r\n</p>\n<p>7-No tutorial. Figure it out as you go. Ask your friends, look online. \r\n</p>\n<p>Let's talk about the art style for a bit.\r\n</p>\n<p>Is not a 100%-pixel game. This concept took some time for the team to grasp. The way I think of it is \"boxy art style\". Yes, there are some pixel elements here and there. Because I wanted the freedom to mix pixel and boxy. \r\n</p>\n<p>-SINGLE PLAYER\r\n</p>\n<p>Let's see how far you can make it. Each world has its unique challenges.\r\n</p>\n<p>-LOCAL CO-OP\r\n</p>\n<p>Up to 4 players. This is really fun. 4 players are the right recipe for chaos.\r\n</p>\n<p>-LOCAL PVP\r\n</p>\n<p>Up to 4 players. I have so much fun here. Last man standing.\r\n</p>\n\n<p>\n</p>", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T09:16:22", "background_image": "https://media.rawg.io/media/screenshots/db8/db8434fea5838593c402de1a82451dbf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 65, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CouchBroGames"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}