{"id": 888232, "slug": "the-quest-for-safe-water", "name": "The Quest for Safe Water", "name_original": "The Quest for Safe Water", "description": "<p>Abstract\r\n </p>\n<p>\tLead contamination of drinking water, along with other pollutants, has had a continuous impact on many communities within the United States, particularly those of lower socio-economic status (Balazs). Additionally, the source of this contaminated water its much more widespread than many realize, with drinking water contamination not only occurring in the home, but also from public water sources, including public park water fountains (Fawkes). The effects of water contamination on disadvantaged populations, both those who are aware and unaware of this contamination, is astronomical. When it comes to early childhood development, water contaminants can be linked to an increased likelihood of PTSD and drug use, as well as learning and memory (Aschengrau). Not only are these children at risk, but even in the womb a baby in utero’s growth can be significantly stunt as well, as less educated mothers are also less likely to move away from these risks (Currie). All of these dangers of water contamination can be directly linked to the continuous, cyclical struggle of people with lower socio-economic status, as well as minority populations. Since this problem most regularly effects people from diverse and lower-income backgrounds, many of these systematic issues are due to negligence from officials who are meant to prevent these issues from happening, or even negligence after these events have already started to harm people (Patel).\r\n </p>\n<p>\tThis project’s aim is to allow the player to live out the daily struggle of finding clean water to consume, which is a struggle that many have not and will not ever know. With greater understanding and support around this struggle, more positive change can be made possible.\r\n </p>\n<p>Works Cited\r\n </p>\n<p>Balazs, Carolina, et al. “Social Disparities in Nitrate-Contaminated Drinking Water in California’s San Joaquin Valley.” <em>Environmental Health Perspectives</em>, vol. 119, no. 9, 2011, pp. 1272–78, https://doi.org/10.1289/ehp.1002878.\r\n </p>\n<p>Fawkes, Leanne, and Garett Sansom. “Preliminary Study of Lead-Contaminated Drinking Water \tin Public Parks—An Assessment of Equity and Exposure Risks in Two Texas Communities.” <em>International Journal of Environmental Research and Public Health.</em>, vol. 18, no. 12, 2021, https://doi.org/10.3390/ijerph18126443.\r\n </p>\n<p>Aschengrau, Ann, et al. \"Long-term Neurotoxic Effects of Early-life Exposure to Tetrachloroethylene-contaminated Drinking Water.\"<em> Annals of global health</em>, vol. 82, no. 1, 2016, pp. 169-179<em>. ProQuest</em>, https://www.proquest.com/scholarly-journals/long-term-neurotoxic-effects-early-life-exposure/docview/1798992571/se-2, doi:https://doi.org/10.1016/j.aogh.2016.01.013.\r\n </p>\n<p>Currie, Janet, et al. \"Something in the water: contaminated drinking water and infant health.\"<em> Canadian Journal of Economics/Revue Canadienne d'Economique</em>, vol. 46, no. 3, 2013, pp. 791-810<em>. ProQuest</em>, https://www.proquest.com/scholarly-journals/something-water-contaminated-drinking-infant/docview/1434032476/se-2, doi:https://doi.org/10.1111/caje.12039.\r\n </p>\n<p>Patel, Naveen, et al. \"Nitrate contamination in water resources, human health risks and its remediation through adsorption: a focused review.\"<em> Environmental science and pollution research international</em>, vol. 29, no. 46, 2022, pp. 69137-69152<em>. ProQuest</em>, https://www.proquest.com/scholarly-journals/nitrate-contamination-water-resources-human/docview/2700639751/se-2, doi:https://doi.org/10.1007/s11356-022-22377-2.\r\n</p>", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-02T09:45:15", "background_image": "https://media.rawg.io/media/screenshots/c3e/c3e74dcb6171a17f0e33e99b51f16775.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Bjellis717"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}