{"id": 888737, "slug": "occult-nostalgia", "name": "Occult Nostalgia", "name_original": "Occult Nostalgia", "description": "<p><strong>At the moment the game is a glorified tech demo showcase the dungeon placing mechanism, multiplayer support, combat and a few drawing tricks.</strong> <strong>Drop a follow if you are interested in the future of the project!</strong></p>\n<p><strong>☕Ko-fi</strong></p>\n<p><strong>🐦Twitter</strong></p>\n\n\n<p>This project is an entry for the A Game By It's Cover 2022 jam. Famicase was Occult Nostalgia by Tyler Dori. Thanks for the permission! Check out his awesome works!</p>\r\nControls:\r\n\r\nStory:\r\n<p>\"Tune to channel 3 and prepare to fight against monsters, demons and eldritch horrors in this dungeon crawling RPG inspired by the feeling that there's something ominous about late night television!\"</p>\n\n<p>Tess and the crew heads into the ruins in the forest, following some shady guys in hope of uncovering the recent dissapearing. But what they will find inside? Why is the air so cold and the forest so quiet? The hidden dungeon inside holds the answers, but you might wish you did not know them upon uncovering the truth.</p>\r\nGameplay:\r\n<p>Explore the dungeon, rescue innocent people from being sacrifical lambs and find who or what is behind all of this. Can you find the magic circle and fix the seal in time, or will the cult unleash something terrible?</p>\n\n<p>Find ancient relics, defeat acolytes and monstrous beings from the other side of the veil and be victorious? Or will you arrive late, and witness the World's end from the front row.</p>\r\nKo-fi articles:\r\n<p>https://ko-fi.com/post/A-Game-By-Its-Cover-1--Occult-nostalgia-meets-a-C0C3FZFLM\r\n</p>\r\nSupport:\r\n<p>If you like my work you can purchase the standalone binaries for this game! If you would like to see more games, gamedev blogs, pixel- and voxel arts check out my Ko-fi page, where you can support me if you want!\r\n</p>\n<p>https://linktr.ee/AchieGameDev\r\n</p>\n<p>Big thanks to Csöndi for supporting my work over at Ko-fi!\r\n</p>\n<p>\n</p>", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2022-12-02T13:20:27", "background_image": "https://media.rawg.io/media/screenshots/368/36872f1639e5e71696e687d0e831af6b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Achie"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}