{"id": 888937, "slug": "cyberservice", "name": "CyberService", "name_original": "CyberService", "description": "<p><strong>Made by Kat21, casuallyjeffing, BaueFranco, BolleDirk, and Kit2K2<br/>============================================================</strong></p>\n<p>CyberService is een educatief spel dat u meer wilt aanleren over cyber security en op welke elementen u moet letten.</p>\n<p>In CyberService speelt u als een werknemer wie mensen helpt die recent gehackt zijn geweest. U zoekt naar de verdachte berichten die hun ontvangen hebben en duid deze aan om te laten zien hoe hun gehackt zijn geworden.</p>\n<p>U zal door de e-mails, berichten en webbrowser moeten gaan om deze verdachten links en berichten te vinden.<br/>Op een verdacht element klikken zal uw loon verhogen.<br/>Op een niet verdacht element klikken zal uw loon verlagen.</p>\n<p>Probeer alle verdachte elementen zo snel mogelijk te vinden om zo veel mogelijk geld te verdienen.</p>\n<p>NOTES: <br/>- Als u de game niet in fullscreen modus speelt kan een deel van het spel afgesneden worden of het spel onspeelbaar maken.<br/>- Het spel is mobile friendly, maar borders zullen verschijnen aan de hand van de telefoon resolutie.<br/>- Apple gebruikers kunnen problemen terugvinden</p>\n<p>Spel taal: Nederlands</p>\n\n<p><strong>ENGLISH TRANSLATION</strong><br/>=========================</p>\n<p>CyberService is an educational game that will try to teach you more about cyber security and teach you what elements you should pay attention to.</p>\n<p>In CyberService you play as an employee who helps people who were recently hacked. You find the suspicious messages they got and point them out to show the cause of how they were hacked.</p>\n<p>You will have to go through their e-mails, messages and browser and find the suspicious links and messages.<br/>Clicking the suspicious elements of the messages will grant u money.<br/>Clicking none suspicious elements will lose u money.<br/><br/>Try to find all the suspicious elements as fast as possible to get the most amount of money.</p>\n<p>NOTE: <br/>- Playing the game in non fullscreen mode might cut off parts of the screen or make the game unplayable.<br/>- The game is mobile friendly, but it might show borders depending on the phone resolution.<br/>- Apple users might experience problems</p>\n<p>Game language: Dutch</p>", "metacritic": null, "released": "2022-11-30", "tba": false, "updated": "2022-12-02T15:00:08", "background_image": "https://media.rawg.io/media/screenshots/75c/75cf6a9bb034272567381fe5b7769741.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Kit2K2"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}