{"id": 889083, "slug": "subject-f-011", "name": "Subject F-011", "name_original": "Subject F-011", "description": "<strong>The Game</strong><br/><br/>Trapped in Area 51 on planet Earth, you must solve calculated puzzles to escape this strange planet. Puzzles consist of using enemies' mechanics to your advantage, moving objects to block enemies, and using items that alter parts of the rooms.<br/><br/>A spiritual successor to the widely acclaimed NES puzzle series Adventures of Lolo.<br/><br/><strong>Features</strong><br/><br/><ul><li>52 cleverly designed puzzles that will fill you with \"ah-ha!\" moments as you play. Each puzzle has its own unique concept, meaning each puzzle is solved differently.<br/></li><li>Custom puzzle creation, including the possibility to upload them online for others to play, and downloading others' custom puzzles.<br/></li><li>9 enemies, each having a distinct mechanic. Oftentimes, you will take advantage of an enemy's mechanic to solve a puzzle.<br/></li><li>A two floor system. On several puzzles, access an underground floor with limited visibility for an additional challenge.<br/></li><li>Two master secret puzzles to unlock after beating the main game that will test the limits of your puzzle solving skills.<br/></li><li>A game that builds on one of the most widely acclaimed puzzle series of the NES era.</li></ul><br/><strong>Meet The Actors</strong><br/><br/><br/>", "metacritic": null, "released": "2022-11-26", "tba": false, "updated": "2023-03-13T03:18:45", "background_image": "https://media.rawg.io/media/screenshots/72a/72a9bac03252ce1b9c44d75cf4aa4db5.jpg", "website": "https://www.quavelty-games.com/subject-f-011/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 92, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mickael Bergeron Neron", "Quavelty Games"], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["Quavelty Games"], "esrb_rating": null}