{"id": 889141, "slug": "fly-spy", "name": "Fly Spy", "name_original": "Fly Spy", "description": "FLY SPY\r\nThe mystery \r\n<p>The year is 1998, and someone is missing. What happened to Sparrow, the Agency operative who disappeared at some point in the last month?</p>\r\nThe investigation\r\n<p>Pilot an experimental fly-sized drone into Sparrow's living room to gather information and find out what happened to her.</p>\r\nThe gameplay\r\n<p>Interact with your surroundings by typing out commands for your drone to interpret and execute. Read lots of interesting content, listen to voicemail messages, and solve puzzles as you make your way through the game.</p>\r\nThe cliché\r\n<p>The theme of the game jam for which this game was created is \"clichés.\" The cliché I chose for this game was being \"a fly on the wall.\"</p>\r\nCredits\r\n<p>All art, music, game design, code, and copy by kristinamay.</p>\n<p>If you want to judge me really hard, you can find the code here.</p>\n<p>Made with Pixaki, Medley, Figma, and Procreate.</p>\n<p>Created in Love2D for the Github GameOff 2022.</p>\n<p>Thank you so much to my volunteer voice actors:</p>\n<ul><li>Fletcher </li><li>David Haney</li><li>Zach Frandsen</li><li>Treezypoo</li><li>S. Pastrami Esquire</li></ul>\n<p>And thank you to the playtesters:</p>\n<ul><li>Matt</li><li>James</li><li>Amber</li><li>Fletcher</li></ul>\n<p>Answering machine beep from freesounds.org : \"cleanansweringbeep\" - kwahmah_02</p>\r\nAccessibility\r\n<p>This game should be fully accessible to folks who are deaf and hard-of-hearing - the voice acting in the game is also transcribed in the player's notes, and there are no semantically important audio cues - only background music. The game also does not rely on color for any of its puzzles or interactions, so it should be fully accessible to color-blind folks. If you have any accessibility issues, please please please let me know via the comments!</p>\r\nHINTS AND SPOILERS ABOUND BELOW!\r\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\r\nHints\r\n<p>ONLY LOOK AT THESE HINTS IF YOU ARE TRULY STUCK. They'll take the joy out of the game! There are some in-game hints that you can use back at the 'station' if you need.</p>\n\r\n\r\nSparrow's name - small hint\r\nSometimes the answer is as obvious as it seems.\r\n\r\n\r\nSparrow's name - big hint\r\nThe name is written on an envelope somewhere.\r\n\r\n\r\nSparrow's name - solution\r\nJean Cabot\r\n\r\n\r\n\r\nWhat happened - small hint\r\nThere are a few possible explanations for what happened to Sparrow, but what's in the chest eliminates one big one.\r\n\r\n\r\nWhat happened - big hint\r\nListen to the message from February 14, and check out the letter.\r\n\r\n\r\nWhat happened - solution\r\nShe was kidnapped.\r\n\r\n\r\n\r\nWhen it happened - small hint\r\nThe details you need are in the calendar combined with the messages.\r\n\r\n\r\nWhen it happened - big hint\r\nWhich events did Sparrow attend, and which did she miss?\r\n\r\n\r\nWhen it happened - solution\r\nFebruary 14.\r\n\r\n\r\n\r\nWho's involved - small hint\r\nTake inventory of the cast of characters and determine who might be the most likely. The polaroid may help.\r\n\r\n\r\nWho's involved - big hint\r\nThe letter is pretty cut-and-try.\r\n\r\n\r\nWho's involved - solution\r\nThe Spider.\r\n\r\n\r\n\r\nWhere is she - read this before you get any hints!\r\nFirst, if you haven't found the diary puzzle, stop here and read the hints for puzzle 1 down below.\r\n\r\n\r\nWhere is she - hint\r\nYou'll need a street name and street number. The messages will help with the number, and you get the name with the chest puzzle.\r\n\r\n\r\nWhere is she - solution\r\n126 Williams St\r\n\r\n\n\r\nHints for specific puzzles!\r\n\r\nClick for puzzle 1's name\r\nChest combination\r\n\r\n\r\nPuzzle 1 - how to find - small hint\r\nShining some darkness on this issue might help. Look to the diary for guidance.\r\n\r\n\r\nPuzzle 1 - how to find - big hint\r\nYou need to remove/reduce two light sources.\r\n\r\n\r\nPuzzle 1 - how to find - solution\r\nUnplug the lamp and close the curtains, then open the desk drawer.\r\n\r\n\r\nPuzzle 1 - how to solve - small hint\r\nWhat might the figures \"2.8\", \"2.11\", etc. stand for? Where have you seen those before?\r\n\r\n\r\nPuzzle 1 - how to solve - medium hint\r\nIf you're looking at a book and you see specifiers like \"R4\" and \"W3\" what might those stand for?\r\n\r\n\r\nPuzzle 1 - how to solve - big hint\r\nR = row, W = word. The other figures are dates.\r\n\r\n\r\nPuzzle 1 - how to solve - solution\r\nPutting the clues together gives you \"1223\" which is the chest combination.\r\n\r\n\r\n\r\nClick for puzzle 2's name\r\nPuzzle behind chest\r\n\r\n\r\nPuzzle 2 - how to find - hint\r\nYou have to solve puzzle 1 before you can get to this puzzle.\r\n\r\n\r\nPuzzle 2 - how to find - solution\r\nOpen the chest and turn off all the lights.\r\n\r\n\r\nPuzzle 2 - how to solve - small hint\r\nThe shapes with letters in them - where have you seen those shapes?\r\n\r\n\r\nPuzzle 2 - how to solve - medium hint\r\nIf you combine the letters and numbers from the stickers, where might you use that information?\r\n\r\n\r\nPuzzle 2 - how to solve - big hint\r\nUse the coordinates from the stickers with the circled letters on the map.\r\n\r\n\r\nPuzzle 2 - how to solve - solution\r\n<p>Putting this all together gives you WI LL IA MS - or, Williams St.\r\n</p>\n\r\nGot any other unanswered questions once you've finished the game? Check here!\r\n\r\nQuestion 1 name\r\nWhat gives with all of the hiking stuff?\r\n\r\n\r\nQuestion 1 answer\r\nThe hiking hobby was a misdirect to make you think she just went hiking. That is, until you found the keys (where did she go without her car?) and the chest full of unused hiking gear. Seems like it was a new hobby.\r\n\r\n\r\n\r\nQuestion 2 name\r\nWhat was the significance of the flower?\r\n\r\n\r\nQuestion 2 answer\r\nThe flower being fresh and new could indicate someone had put a fresh one in there recently. But smelling it tells you that it's just plastic, and is a misdirect for the date of disappearance.\r\n\r\n\r\n\r\nQuestion 3 name\r\nWhat was the significance of the photo?\r\n\r\n\r\nQuestion 3 answer\r\nThe photo shows that Sparrow had seen the Spider when she was out and about recently, and was nervous about it. She labeled it as her brother to hopefully confuse any bad actors who might try to clear her apartment of clues.\r\n\r\n\r\n\r\nQuestion 4 name\r\nWhat was the significance of the post-it notes?\r\n\r\n\r\nQuestion 4 answer\r\nOne note gives you the hint for where to get the house number. The red fish on another note is meant to be a red herring - a tiny clue that not everything in the room will be pertinent.\r\n\r\n\r\n\r\nQuestion 5 name\r\nWhat was the significance of all of the messages?\r\n\r\n\r\nQuestion 5 answer\r\nA couple of the messages give important info: the message from the 14th gives a number, the one from the 15th shows that she missed an event that day. The others are meant to reinforce items from the calendar and impart a lil bit of flavor.\r\n\r\n\r\n\r\nQuestion 6 name\r\nWhat was the significance of the carpet clue?\r\n\r\n\r\nQuestion 6 answer\r\nThe carpet was ripped, but the rest of the apartment was very tidy (and even the ski cap was repaired, so Sparrow's not the type to leave stuff like that go). The carpet rip must have happened when she couldn't fix it, i.e. during a scuffle in which she was kidnapped.\r\n\r\n\r\n\r\nQuestion 7 name\r\nWhat was the significance of the garbage?\r\n\r\n\r\nQuestion 7 answer\r\nThe trash is starting to go off - it's been there for quite a while. Just an additional hint indicating that she didn't disappear within the last few days.\r\n\r\n\n<p>Got any other questions about the game content? Throw 'em in the comments and I will try to answer!</p>", "metacritic": null, "released": "2022-11-29", "tba": false, "updated": "2022-12-02T16:32:07", "background_image": "https://media.rawg.io/media/screenshots/285/2857759f978ad52be95bd47eb8ef1c57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "macOS", "PC"], "developers": ["Kristina"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}