{"id": 88952, "slug": "isolitaire-solitaire-classic", "name": "iSolitaire ( Solitaire Classic )", "name_original": "iSolitaire ( Solitaire Classic )", "description": "*** 66% OFF! — LIMITED TIME! ***<br/><br/>If you like Windows Solitaire then this is the app for you!<br/><br/>This is your classic game of solitaire for the Iphone and specially optimized for iPhone multitouch screen with a large and eye-friendly card set.<br/><br/>The goal is to place all the cards in each suit in stacks of ascending rank. Solitaire is also known as patience.<br/><br/>Feel the difference! iSolitaire is smart enough to catch the meaning of every gesture, helping you focus on the game and not the control. Your game is saved when you get a call or other interruption and then restored when you return to iSolitaire to complete the game.<br/><br/>Play iSolitaire to relax and relive stress. Touch and move cards as you do in real life, cards are flying and landing softly. Clean and vivid graphics make you fully enjoy gameplay.<br/><br/>FEATURES<br/><br/>- Klondike<br/>- Draw 1 card<br/>- Draw 3 cards<br/>- Drag and drop card(s)<br/>- Auto complete to finish game<br/>- No interference with Ipod audio<br/>- Listen to your music while you play<br/>- Easy-to-read screens<br/>- Moves tracking<br/>- Move all cards with the tip of your finger!<br/>- Large and eye-friendly card set, optimized for fingers and long play<br/>- Intuitive cards dragging system<br/>- Persistent settings<br/>- Drag cards, or double tap to auto-move<br/>- Game state saved when interrupted<br/>- Timer<br/>- Custum card backs<br/>- Custom backgrounds<br/><br/>Enjoy!", "metacritic": null, "released": "2009-07-26", "tba": false, "updated": "2019-10-22T14:08:45", "background_image": "https://media.rawg.io/media/screenshots/376/3763cab25cdf97423642280231c82f4e.jpg", "website": "http://hsi799.blogspot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 58, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Haiwen Soft"], "genres": ["Card"], "publishers": ["wang haiwen"], "esrb_rating": "Everyone 10+"}