{"id": 889519, "slug": "elsewhere-in-the-night", "name": "Elsewhere in the Night", "name_original": "Elsewhere in the Night", "description": "<p><em>Releasing on 6th December!</em></p>\n<p><em>Glass City, where retribution sings a strange tune. Night is prophecy here. It's the only thing anyone believes in. Or they used to. The sky is sick. The streets weep molten metal. Food, energy, healthcare - no one can afford to live. Now there's a serial killer stalking the streets, killing off the homeless... To my eyes, it’s all the same sin. And who am I? I am Lady Tick Tock, a private detective with means of speaking to the dead…</em></p>\n<p><em>Elsewhere in the Night </em>is a 2D psychic noir point and click adventure game. Play as private detective Lady Tick Tock as she investigates the latest in a string of unsolved murders.</p>\n<p><em>Elsewhere in the Night</em>'s art is heavily inspired by the late 80's Sierra's <em>Manhunter games</em>. In 16 glorious colors and chunky wide pixels,<em> Elsewhere in the Night</em> celebrates its EGA palette and AGI-esque aesthetics.</p>\n<p>However, the game is free of any arcade sequences, dead ends, or deaths: you can enjoy the story and narrative and solve puzzles at your own pace, without having to worry about botching a puzzle or getting killed. You won’t ever become hopelessly stuck.<br/></p>\n<p>The average playthrough playtime is 1 hour. You can download the game free of charge. If you enjoy it, please consider tipping! Your support may allow us to create more games.</p>\n<p><em><strong>Adult Content warning:</strong> Elsewhere in the Night contains profanity,  violence, and nudity. Nudity can be censored in the game but is shown by default.</em></p>\n<p>Illustrated and coded by Aviv Salinas and written and designed by Ross Joseph Gardner.</p>\n<p>You are not permitted to host or redistribute<em> Elsewhere in the Night</em><em>.</em> Read the EULA for more information. </p>\n<p> </p>", "metacritic": null, "released": "2022-11-28", "tba": false, "updated": "2022-12-02T19:10:02", "background_image": "https://media.rawg.io/media/screenshots/9bf/9bf3841f9b249c66d55ff10c288c1f8c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 181, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CosmicVoid"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}