{"id": 88969, "slug": "dark-dice-free", "name": "DARK DICE - FREE", "name_original": "DARK DICE - FREE", "description": "DARK DICE FREE: The iPhone Dice for the dark side <br/><br/>* FREE EDITION *<br/>Get \"DARK DICE\", if you don't like the Advertisements.<br/><br/>* \"SHORT MATCH\" AND  \"MEIER\" ARE WAITING FOR YOU *<br/>!!! We have more amazing Apps! Take a look for \"SHORT MATCH\" and the \"MEIER\" App.<br/><br/>DARK DICE comes with one die only. Please look for the great App \"Two Dice\", if you need two dice for you boardgame.<br/><br/>Are your dice gone? No problem: these dice are simulated in the iPhone and realistically roll around when shaken. <br/><br/>Frank Meyer already offers several dice applications in the App Store. Now he presents DARK DICE 1.0, his first dice of horror: this time the dark side gets its own dice. Fantastic animations along with a growling voice in the Dark Side style make for fun special effects. <br/><br/><br/>Briefly summarized: <br/><br/>- Simulated dice in 3D for on the go <br/><br/>- Shake the iPhone to roll the dice <br/><br/>- Spine-chilling sounds and voice <br/><br/>- Works with the iPod touch and iPhone <br/><br/><br/>Everyone has been there: The whole family or gang feels like playing an exciting board game - but the dice are nowhere to be found. It's like they've all fallen off the face of the earth. No problem: Frank Meyer presents a new iPhone-App which lets you keep your dice on hand. The DARK DICE can be installed on all iPhones and iPod touch devices. The special feature: you can shake the device to roll the die. The 3D animation shows you the rolling die before it stops, and then you can see the number that comes up. It's impossible to cheat, the die does not teeter or tip in this digital version. Everybody in the game can take turns shaking the iPhone. <br/><br/>DARK DICE : Glowing copper, rising hellfire <br/>Frank Meyer already offers several dice in the iTunes AppStore. The new release \"DARK DICE\" is a very special die: It comes from the depths of hell and looks like it has been forged from red-hot copper by the devil himself. It even sounds metallic as he crashes onto the floor, and hellfire radiates out of the numbers. <br/>A game of dice with bad guys is much more fun when this App is used. <br/><br/>You don't need to shake your iPhone to roll the dice of the dark side, tapping the screen works too, especially if you don't want to risk dropping your device.", "metacritic": null, "released": "2010-12-23", "tba": false, "updated": "2019-10-22T14:08:46", "background_image": "https://media.rawg.io/media/screenshots/899/899785a657cec5a81b2749d84d357e06.jpg", "website": "http://www.frank-meyer.de", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 102, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Frank Meyer"], "genres": ["Board Games", "Card"], "publishers": ["Frank Meyer"], "esrb_rating": "Everyone 10+"}