{"id": 889614, "slug": "culto", "name": "Culto", "name_original": "Culto", "description": "<p>Welcome to <strong>Culto</strong>, a cult management game!</p>\n\n<p>Unspeakable Eldritch horrors have awakened from their eon-long slumber and are now trying to breach into our reality. As the only person who seems to pay attention to these kinds of things you took it upon yourself to delay the inevitable by appeasing these intruders with offerings and sacrifices.</p>\n\n<p><strong>But for how long can you keep it up?</strong></p>\n\r\nControls\r\n<strong>WASD</strong>Move<strong>SPACEBAR</strong>Interact<strong>ESCAPE (ESC)</strong>Open Pause Menu<br/>\n\r\nHow to play\r\n<p>In Culto your goal is to manage your cult's resources in order to be able to fulfill each day's Ritual's requirements.</p>\n<p>At the start of each day a new <strong>Ritual</strong> is chosen. Your objective is to gather the necessary requirements throughout the day in order to be able to perform the ritual and to stave off the Eldritch beasts trying to breach into your reality.<br/></p>\n<p>In order to gather resources you can command your Cultists to perform tasks.</p>\n<p>Each task takes a certain amount of <strong>Time</strong> and offers different <strong>Rewards</strong> upon completion.</p>\n<p>Each day unfolds throughout the course of 5 minutes. For how many days can you keep this up?<br/></p>\r\nResources\r\n<ul><li><strong>Money</strong> - The most basic of resources. Can be gathered by sending cultists to <strong>Work</strong> or <strong>Rob a Bank</strong>. Can be used to purchase <strong>Food</strong> or reduce <strong>Suspicion</strong>.</li></ul>\n<ul><li><strong>Food</strong> - At midday every Cultist will consume <strong>1 Food</strong>. For every unfed Cultist your cult's <strong>Faith</strong> will diminish. Can be gathered by sending cultists to <strong>Hunt</strong>. Can be bought with <strong>Money</strong> by sending cultists to go <strong>Shop</strong>.</li></ul>\n<ul><li><strong>Prisoners</strong> - Worthy sacrifices. Can be acquired by sending your cultists to <strong>Kidnap</strong>, but this will raise your <strong>Suspicion</strong>. A Cultist can also be <strong>Emprisoned</strong>, making them a <strong>Prisoner</strong>.</li></ul>\n<ul><li><strong>Cultists</strong> - Your followers. Cultists can be sent to perform tasks and gather resources. Cultists can recruit new followers through <strong>Preaching</strong> but this will raise your <strong>Suspicion</strong>. Cultists can be <strong>Emprisoned</strong>, transforming them into a <strong>Prisoner</strong>, or <strong>Sacrificed</strong>, granting you <strong>Food</strong>.</li></ul>\n<ul><li><strong>Suspicion </strong>- Represents the Police's level of discontempt towards your actions. If the <strong>Suspicion </strong>meter gets filled up your complex will be raided and your cult dismanteled. <strong>Suspicion </strong>can be reduced by having a Cultist <strong>Bribe </strong>the police at the cost of <strong>Money</strong>.</li></ul>\n<ul><li><strong>Faith </strong>- How much your followers believe in your cause. Naturally diminishes over time but can be reinstated by <strong>Preaching</strong> at the <strong>Altar</strong>.</li></ul>\r\nEvents\r\n<p>Three different events will occure during the day. <strong>Two Random Events</strong> and <strong>One</strong> <strong>Feeding Event.<br/></strong></p>\n<ul><li><strong>Random Event </strong>- Happen at 1/4th and 3/ths of the day. You will be presented with a random situation and must choose how to proceed. Each option provides you with different benefits and/or penalties. Choose wisely and take into consideration your current resources and the day's Ritual Requirements.</li></ul>\n<ul><li><strong>Feed Event </strong>- At midday (1/2th of the day) each of your <strong>Cultists </strong>will consume <strong>One Food</strong>. Every Cultist that does not get fed will negatively impact your current <strong>Faith</strong>.</li></ul>\r\nPreach\r\n<p>To reinstate and replenish your cult's <strong>Faith </strong>you must <strong>Preach</strong>. To do so you must interact with the <strong>Altar</strong> and type out the presented Eldritch Word. Be careful, however, as mispronouncing the given word will cause your cult's Faith to waver.<br/></p>\n\r\nInstallation\r\n<ol><li> Download the .zip (no payment is needed or expected)</li><li>Extract the contents of the zip into a folder</li><li>Run \"Culto.exe\"</li></ol>\n\r\nCredits\r\n<p>Game made by <strong>Diogo Silva<br/></strong></p>\n<p>Sound effects obtained from https://www.zapsplat.com</p>\n<p>Music ( \"<em>Just as Soon</em>\",  \"<em>I Knew a Guy</em>\", \"<em>On the Cool Side\", \"Walking Along\")</em> by Kevin MacLeod https://www.incompetech.com<br/></p>\n<p>Feel free to check out my other games  https://fenixds.itch.io !<br/><br/></p>", "metacritic": null, "released": "2022-11-28", "tba": false, "updated": "2022-12-02T19:51:53", "background_image": "https://media.rawg.io/media/screenshots/cd3/cd3b875e2670418698e87e40c526658a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 286, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["FenixDS"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}