{"id": 889875, "slug": "huan-jing-lian-ren-fairy-tale-plan", "name": "幻境恋人-Fairy tale plan", "name_original": "幻境恋人-Fairy tale plan", "description": "\r\nMany years later, the Earth is facing resource depletion, in order to continue human civilization, scientists have developed a virtual world called “FT”. Individuals can link with machines to transmit their consciousness into the FT. In the FT world, all people will become children, and temporarily lose the memory of reality. They work to earn their own living, there is no inequality and strife, just like the dream world of the paradise. When you come to the virtual world to become the only “Snow White”.Is the seemingly beautiful fairy tale really a happy ending？What kind of real face will the man you know in the real world show in the virtual world？ Do you want to have a deep thinking and true love experience? Let’s enter the game of《Fantasy Lovers》and start your story!<br/>\n<br/>\r\nGame Features<br/>\r\n1. This is a fantasy love story written by the author with exquisite pictures, excellent production and profound content. The character's position and fate all depend on the choice of the heroine.<br/>\r\n2. The CG of this painting is unique and exquisite, and there are many characters that can be attracted.<br/>\r\n3. No complex description of the environment, vivid and rich characters, compact plot, concise language, rigorous logic, perfect plot transition and super rich ending.<br/>\r\n4. The description of the characters is wonderful. Instead of simply accumulating the characters, the characters' distinctive personalities are displayed through the progress of the plot and their words and behavior in different lines.<br/>\r\n5. The heroine has a prominent image and strong personality charm. In the process of plot development, the player can feel the influence of the heroine's existence and the significance of the guide, with a strong sense of substitution.<br/>\r\n6. Carefully polish each plot, the plot under different branches will not be repeated, and the plot has strong meaning, so that the player can't help but want to experience all the branches.<br/>\n<br/>\n<br/>\r\nGame play<br/>\r\n1. The story of the game is rich, and the plot is driven by \"me\", and the fate of the characters will be changed because of \"me\"<br/>\r\n2. The world view of the game is bold and full of imagination, which requires careful thinking and solving mysteries in the process of experience<br/>\r\n3. The file system is so sweet, and the SMS system and diary system are amazing.<br/>\r\n4. Each branch line is not simply repeated. Different branch lines are chosen to achieve different endings", "metacritic": null, "released": "2022-12-01", "tba": false, "updated": "2022-12-05T02:41:42", "background_image": "https://media.rawg.io/media/screenshots/9de/9de6025c6eb556eeaa3247916e85bb07.jpg", "website": "http://www.66rpg.com/index", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 189, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["橙光游戏"], "genres": ["RPG", "Strategy", "Casual", "Indie"], "publishers": ["橙光游戏"], "esrb_rating": null}