{"id": 88985, "slug": "jewel-magic-xmas", "name": "Jewel Magic Xmas", "name_original": "Jewel Magic Xmas", "description": "*** Enjoy Jewel Magic Xmas with all features absolutely free for this Christmas Season ***<br/>Awesome puzzle game with addictive gameplay in christmas flavour with cool graphics and animations.<br/><br/>JewelMagic adds several creative innovations to the already very popular match game concept with four differently themed game modes and<br/>unlimited levels of challenging fun.<br/><br/>If you have got bored with similar games or if you want more funnier and entertaining match puzzle game, Jewel Magic Xmas is here for you.<br/>Its gameplay is better than other similar games with lot of creative fun involving Santa &amp; Angels.<br/><br/>*******************<br/><br/>Jewel Magic Xmas has four different game modes as below.<br/>   - Classic : Our popular move timeout based game.<br/>   - TimeAttack : Clear as many fruits in given time.<br/>   - ScorePanic : Get a peak score and defend it.<br/>   - Continuous : Save &amp; Play until you want to stop.<br/><br/>*******************<br/><br/>Jewel Magic Xmas is based on the classic match 3 game concept with many creative innovations which adds spice to its game play. <br/><br/>Santa and Angel helps you whenever you excite them with a nice combo of <br/><br/>fruits adjacent to them, but on the other hand you may not like the smoking gems, if you fail to clear them soon.<br/><br/>Game Features:<br/>   - Awesome graphics with fluid animations.<br/>   - Auto saving &amp; loading supported for all game modes.<br/>   - Plain Mode option to switch off special items.<br/>   - Angelsclears all surrounding gems by matching two similar gems adjacent to him.<br/>   - Santa clears all gems in a row or column by matching two similar gems adjacent to him.<br/>   - Smoke! Beware of them. Clear them before the moveout counter in each smoking gem reaches zero or else it will spread to your adjacent gems.<br/>   - Unlimited levels! It needs only your skill to crack a new level. Complexity of the game increases progressively from level to level. Could you ever reach Level10 in Classic/ScorePanic game mode? Well, let’s see!!!", "metacritic": null, "released": "2011-12-18", "tba": false, "updated": "2019-07-30T17:07:03", "background_image": "https://media.rawg.io/media/screenshots/971/9710ae9557236c055d50d73dece36c0e.jpg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["iGold Technologies"], "genres": ["Adventure", "Board Games", "Puzzle"], "publishers": ["iGold Technologies Private"], "esrb_rating": "Everyone 10+"}