{"id": 889866, "slug": "reeve", "name": "Reeve", "name_original": "Reeve", "description": "This game tells the adventure of Reeve who came to earth to strengthen himself and take his revenge. For this purpose, he absorbs the energy and abilities of the creatures it destroys. He also gains much more powerful abilities by collecting the scrolls. The game is played with a single player and consists of seven levels in total. The first level is the training part for the players. The total playable time of the game is approximately 17 hours. If you want to finish the game, you have to be patient and careful because in the game you have to find hidden keys, doors, rooms, and levers, especially after the third level.<br/><br/>KEY FEATURES:<br/>* Beginning A New Adventure: Experience the challenges of the adventure after Reeve reaches the ancient world.<br/>* Exploration: Discover mysterious environmental puzzles, deadly mazes, and caves in the underground world.<br/>* Earn Mystical Abilities: Search for hidden doors and keys and figure out puzzles to obtain magical powers in the ancient world.<br/>* Lethal Creatures: Fight deadly monsters in the ancient world by gaining new weapons and absorbing their talents.<br/>* Mystic Objects: Push huge pillars and combine magic objects so doors open, waterfalls roar, and finally the mystery is revealed. <br/>* Survive All Challenges: Leap over massive ruins, gaps, lakes, and water springs, and upgrade Reeve’s talents and health to survive in the dark deadly world.", "metacritic": null, "released": "2022-12-02", "tba": false, "updated": "2022-12-05T02:31:03", "background_image": "https://media.rawg.io/media/screenshots/ea8/ea81a7e9f312d72668fcb425a68a1ffb.jpg", "website": "https://www.oagamestudio.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 382, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["OA GAME STUDIO"], "genres": ["Action", "Adventure"], "publishers": ["OA GAME STUDIO"], "esrb_rating": null}