{"id": 88990, "slug": "fruited-1-full-game", "name": "Fruited 1 - Full Game", "name_original": "Fruited 1 - Full Game", "description": "*** Top fruit matching game of 2010 with full features, now absolutely free. Enjoy!!! ***<br/>Awesome puzzle game with addictive gameplay and online game scores.Its gameplay is better than other similar games with lot of creative fun involving monkeys, squirrels &amp; worms.<br/>If you have got bored with similar games or if you want more funnier and entertaining match game, Fruited is here for you.<br/><br/><br/>*******************<br/><br/>Fruited has new game modes along with our Original(Classic) game mode as below.<br/>   - Fruited Classic : Our popular move timeout based game.<br/>   - Fruited TimeAttack : Clear as many fruits in given time.<br/>   - Fruited ScorePanic : Get a peak score and defend it.<br/>   - Fruited Continuous : Save &amp; Play until you want to stop.<br/><br/>*******************<br/><br/>Fruited is based on the classic match 3 game concept with many creative innovations which adds spice to its game play. Monkeys and Squirrels helps you whenever you excite them with a nice combo of fruits adjacent to them, but on the other hand you may not like the worms which spoil your fruits, if you fail to kill them soon.<br/><br/>Why should we play this fantastic swap game well suited for iPhone/iPod Touch interface with mouth watering fruits, instead of gems and jewels? Play fruited and you will see the difference!<br/><br/>Online Scores!  Scores of top ten players from all over the world are listed in weekly and Monthly tabs of our online score screen. At any time, you can compete with top ten weekly and monthly scorers and submit your scores after every game.<br/><br/>Game Features:<br/><br/>   - Play this fantastic fruit swapping game, well suited for iPhone/iPod Touch screen with mouth watering fruits. Play it to believe, fruits adds life to the game!<br/>   - Online game score update and listing of top ten weekly and monthly scores from all over the world. Competing with players from all over the world motivates you to spend your free time with fruited.<br/>   - Animated monkeys are mischievous, but when you form a nice combo of fruits adjacent to them, they will clear all surrounding fruits.<br/>   - Animated squirrels clears all fruits in a row or column, if you excite them with a nice combo of fruits adjacent to them<br/>   - Worms! Beware of them. Clear them before the moveout counter in each fruit infected with them reaches zero, or else it will spread to your adjacent fruits.<br/>   - Unlimited levels! It needs only your skill to crack a new level. Complexity of the game increases progressively from level to level. Could you ever reach Level10 in Classic/ScorePanic game mode? Well, let’s see!!!<br/>   - Support for OpenFeint based Leaderboards &amp; Achievements.<br/>   - Individual Leaderboards for all competitive game modes.<br/>   - 25 challenging achievements in varying difficulties.", "metacritic": null, "released": "2011-04-15", "tba": false, "updated": "2019-07-30T17:07:20", "background_image": "https://media.rawg.io/media/screenshots/42b/42b1843a9ce4b0fa8fd2a8f0f6b378e1.jpg", "website": "http://www.veegames.com/iphonegames/fruited.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 79, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["iGold Technologies"], "genres": ["Adventure", "Puzzle"], "publishers": ["iGold Technologies Private"], "esrb_rating": null}