{"id": 889937, "slug": "sex-gym-3d", "name": "Sex Gym 3D", "name_original": "Sex Gym 3D", "description": "<strong>Sex Gym 3D</strong> is a fitness life simulator. <br/><br/>Your goal in the game is to open all the sex scenes. Train hard by completing the mini-games, and upgrade your characteristics to get rewarded! <br/><br/>Your energy levels are the most crucial indicator that you should take care of. When your energy is low,  it becomes more difficult for you to perform well in exercises. On top of that, you have 5 additional characteristics that affect how you perform in the gym.<br/><br/>There are three exercises that you must perform in a gym to be able to upgrade your characteristics and ultimately get rewarded. <br/>1. RUN is a game where you need to press the space bar or the mouse in all the appropriate moments to not let the slider running left and right enter the highlighted area of the screen.<br/>2. BENCH PRESS is a game where you need to click the space or the mouse to keep the slider in the highlighted constantly moving zone.<br/>3. BODY LIFTING is a game where you need to click the space bar or the mouse to move the slider from left to right. Stop clicking when the slider is in the highlighted area<br/><br/>So work hard and stay consistent!<h3>Features:</h3><ul><li>3 different mechanics<br/></li><li>3 animated 3D characters<br/></li><li>3D backgrounds<br/></li><li>a dynamic camera<br/></li><li>buy doping for increasing your experience gain<br/></li><li>buy sex scenes with experience <br/></li><li>increase your time left clicking on a timer</li></ul>", "metacritic": null, "released": "2022-12-03", "tba": false, "updated": "2022-12-05T04:00:55", "background_image": "https://media.rawg.io/media/screenshots/374/3744eb856ff2b9f8e5f87a3c12b4df93.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 2}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 429, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Furry Tails"], "genres": ["Simulation", "Sports", "Casual"], "publishers": ["Furry Tails"], "esrb_rating": null}