{"id": 889919, "slug": "beach-invasion-1944", "name": "Beach Invasion 1944", "name_original": "Beach Invasion 1944", "description": "Beach Invasion 1944 is a WWII FPS game where the player defends the beach fortifications against invading forces who will attack your position with troops, tanks, planes and more. Use a variety of iconic and authentic WWII weapons such as <strong>MG42, Flak88</strong> and <strong>Panzers</strong>. Get additional defenses with <strong>mines</strong>, <strong>explosive barrels</strong>, <strong>artillery strikes</strong> and <strong>weapon upgrades</strong>!<br/><br/>Beach Invasion 1944 adds a dose of FPS realism to arcade style shooter games. The player takes the role of an Axis soldier operating machine guns and cannon turrets to defend the Atlantic Wall of Europe. During this immense amphibious and airborne operation,  player's task is to destroy as many of the invading forces as possible, utilizing several machine gun, Flak and Panzer nests and bonuses from the supply drops.<br/><br/>Hardcore action in an immersive WWII setting with realistic sounds and special effects  which will make you relive the memorable and epic moments from your favourite WWII movies and TV-series. Non-stop action with continous naval and airborne attacks through day and night with changing weather conditions. <br/>Huge variety of enemies, including marines, paratroopers, bazookas, flamethrowers, attack boats, jeeps, tanks, armored cars, halftraks, fighters, bombers and more!<br/><br/>Ability to call artillery strikes and rain destruction on your enemies.<br/>Getting temporary upgrades on your weapons which include Poison Gas, Armor Piercing, Explosive and Incendiary ammunition.<br/><br/>Strengthening your defenses with anti-personnel and anti-tank mines, explosive barrels, tank barriers and barbed wire.<br/>Earn medals for achieving diffferent actions as you progress.<br/><br/><br/>The game will support following languages on release: English, Spanish, German, French, Russian, Chinese, Japanese, Korean, Turkish, Arabic.", "metacritic": null, "released": "2022-12-02", "tba": false, "updated": "2023-10-19T18:23:07", "background_image": "https://media.rawg.io/media/screenshots/c47/c47636fa987dde718a8f19b03a89b15f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 7, "beaten": 1, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 40, "ratings_count": 1, "suggestions_count": 503, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["AIx2 Games"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["AIx2 Games"], "esrb_rating": null}