{"id": 890085, "slug": "stairway-to-heaven-20", "name": "STAIRWAY TO HEAVEN 2.0", "name_original": "STAIRWAY TO HEAVEN 2.0", "description": "<em>HI!</em>\n<p>Hello everyone!, here is the updated version of our previously  released game STAIRWAY TO HEAVEN in its version 2.0, in it you can find additional content content, music and considerable bug fix under a better quality control of the final result.<br/></p>\n<em>SYNOPSIS:</em>\n<p>Lubriel is an ordinary boy with a somewhat boring life wich is about to change, because he is warned by a mysterious emissary of death that he will soon die, what will the poor boy do to achieve eternal glory in heaven?</p>\n<p>Find out with this interesting story right now!</p>\n\n<em>LETTER FROM THE CREATOR:</em>\n<p>Hello everyone who is reading this, STH has been a small project carried out only by me in this short time, but do not doubt that it is full of love, soul and with content which i hope will be of interest to whoever plays it, i ask lots of support and love, and if you can pay even a small amount for it, me and my team would really appreciate it, please give it a chance.</p>\n<strong><em>sincerely:</em></strong>\n<strong><em>Isai Herrera, CEO of GHOST AUDIOVISUAL.</em></strong>\n\n<p><strong><em>NOTA PARA HISPANOHABLANTES:</em></strong></p>\n<p>Si se ve una buena interaccion por parte de personas que hablen español por nuestro (s)  proyecto (s), existe la posibilidad de que sea lanzada una version en español de este mismo juego, apoyennos!</p>\n\n\n\n\n\n\n\n<p>\n</p>", "metacritic": null, "released": "2022-12-04", "tba": false, "updated": "2022-12-05T05:09:05", "background_image": "https://media.rawg.io/media/screenshots/033/033811af7e7d68fae66a310049283604.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 63, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GHOST AUDIOVISUAL."], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}