{"id": 890022, "slug": "sqncr", "name": "Sqncr", "name_original": "Sqncr", "description": "<p><strong>Note! </strong>If you see an empty white rectangle at the top of the game, click the box in the lower-right corner to full-screen the game and remove it.</p>\n<p>— \"Sequencer\" —<br/><strong>Keyboard required for play.</strong></p>\n<p>———</p>\n<p>Here's a simple game. I'll show you an arrow, and you press the arrow key in the direction I specify. Do this as many times as you can in twenty seconds, and that's your score. Your focus is your own score; can you improve it?</p>\n<p>Press the Spacebar to start out with easy, the default difficulty. That will quickly get you up to speed on how the game works. Moving up to medium difficulty (by pressing \"2\"), will introduce the inverted directions, where you must sometimes press the opposite direction of the displayed arrow. The Hard and Insane difficulties introduce 90 degree rotations. Press the \"i\" key to read the full instructions when in the menu. If you'd like to return to the menu during a game, the handy \"Esc\" key ought to help!</p>\n<p>Press \"o\" to display a list of the options, including the keys to press to toggle them. It is possible and encouraged to play the game without the timer and score displays, or even without the music, as this will likely improve your performance!<br/>This game plays best when you have a relaxed, open focus. When you are intensely concentrated and determined, the mental exertion will exhaust you. When you relax and open your attention, open your focus to a general calm alertness, you are in an optimum state to play.</p>\n<p>Supposedly, if you practice well, your skills might improve. Perhaps you could even <em>change your brain</em>!</p>\n<p>———<br/></p>\n<p>Credits:</p>\n<p>Made with DragonRuby Game Toolkit<br/>Background Music - Tranquility by Kevin MacLeod<br/>(Licensed under Creative Commons: By Attribution 3.0)</p>\n<p>Several Sound Effects sourced from Pixabay.</p>\n<p>Arrow Icon by edt.im on Flaticon. </p>", "metacritic": null, "released": "2022-12-04", "tba": false, "updated": "2022-12-05T04:41:33", "background_image": "https://media.rawg.io/media/screenshots/710/710ff91cd99fa698ca582da8da74e288.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Sunny"], "genres": [], "publishers": [], "esrb_rating": null}