{"id": 890004, "slug": "project-3-rickyhernandez1000", "name": "Project 3 (rickyhernandez1000)", "name_original": "Project 3 (rickyhernandez1000)", "description": "<p>Text Description:\r\n</p>\n<p>This application is a showcase of start, stop, and color randomizing functions illustrated with unique, simple animations. The user utilizes keyboard shortcuts to interact with the application. \r\n</p>\n<p>#1) Green Ball Bouncing:\r\n</p>\n<p>Using solely animation, a green ball bounces on a plane upon the start of the animation. It keeps going indefinitely until the user presses the 'P' key. Pressing this key will stop the animation from looping and will stop completely once it reaches the end frame of the animation. </p>\n\n<p>#2) Breathing Box Animation:\r\n</p>\n<p>Upon the start of the application, the breathing box animation begins to loop. It starts small and then increases in size. Once it reaches maximum size, it decreases slowly at the same rate that it was increasing with. The user is able to change the color of the breathing box by pressing the \"L\" key. This is done using a random math function to input random HSL values upon the press of the \"L\" key. As long as the user holds down the \"L\" key, the breathing box will continue to change colors randomly. Once the key is no longer pressed, the last color presented remains.\r\n</p>\n\n<p>#3) Rotating Square Box\r\n</p>\n<p>Using solely animation, this square box is able to rotate across their xyz axis. Upon the start of the application, it sits still. The square box will begin to rotate once the user presses the \"O\" key. Once it is pressed, the animation begins and loops indefinitely.\r\n</p>", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2022-12-05T04:31:29", "background_image": "https://media.rawg.io/media/screenshots/68a/68a53fa932df22219c59ada3f8fb1a38.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rickyhernandez1000"], "genres": [], "publishers": [], "esrb_rating": null}