{"id": 890066, "slug": "ray-swims-all-day-v08", "name": "Ray Swims All Day v0.8", "name_original": "Ray Swims All Day v0.8", "description": "<p>You have found Ray, and he loves to swim!</p>\n<p>In this endless runner, you will face multiple hazards that just want to ruin Ray's day!  How long can you keep Ray swimming?</p>\n<p>Meet your enemies-</p>\n<p>the humble hermit crab, a docile creature forever scavenging the sea floor in search of FOOD!</p>\n\n<p>the dart fish, I wonder how he got his name? Seemingly a slow swimmer, but beware- you never know when this little guy may find a burst of energy.</p>\n\n<p>Mr. razor fish,  he just stalks the ocean looking for any thing to gobble up.</p>\n<br/>\n<p>The mighty piranha. It is said that these fish have a ferocious appetite, and can devour even the largest prey, in packs.</p>\n\n<p>More enemies will be coming in the feature!</p>\n<p>Ray's swimming is controlled with the directional keys(←↑↓→/WASD).</p>\n\n<p>Ray can utilize many defenses to assist in helping him swim for as long as he can..</p>\n<p>\"Q\" can be used to fire Ray's tail spear, wreaking havoc to any soft bodied enemies that it comes in contact with.</p>\n<p>  </p>\n<p>\"Z\" can be used to make Ray blow a bubble from his mouth, which has the ability to capture any weak swimming foes.</p>\n\n<p>\"C\" will make Ray sharply inhale water through his gills, allowing him to eat small slow prey.</p>\n\n<p>Holding down any of the attack keys will activate aiming mode. Use the up and down directional keys to aim.</p>\n\n<p>If you find yourself in danger, Ray can use a burst of speed using the \"space key\", temporarily increasing his speed to escape. Be careful, Ray uses energy from eating to use this skill.</p>\n\n<p>Thanks for showing interest in my game! This is my first beta release. Production will be on hold through the holiday's. I have many more ideas to add when my schedule slows down again. I hope you have fun playing, drop any comments below. I look forward to hearing from you.</p>\n<p>Cory(cPi Studios)</p>\n<p>CREDITS </p>\n<p>All art provided under Creative Commons at opengameart.org</p>\n<p>Thanks to these wonderful artists for providing the base sprites </p>\n<p>TeaRoost https://opengameart.org/content/underwater-bg</p>\n<p>ansimuz https://opengameart.org/content/underwater-diving-pack</p>\n<p>Sevarihk https://opengameart.org/content/stingray-sprite-animated-4-directional</p>\n<p>davididev https://opengameart.org/content/bubble-particle</p>\n<p>bongbonggun https://opengameart.org/content/bubble-explosion-0<br/></p>", "metacritic": null, "released": "2022-12-04", "tba": false, "updated": "2022-12-05T05:00:52", "background_image": "https://media.rawg.io/media/screenshots/f1d/f1db7bd0157caa0f875ff0c9e88eefd1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cPi studios"], "genres": ["Action"], "publishers": [], "esrb_rating": null}