{"id": 890164, "slug": "it201_project03_sarswat_jha", "name": "IT201_Project03_Sarswat_Jha", "name_original": "IT201_Project03_Sarswat_Jha", "description": "<p><strong>Feature 1: </strong>\n</p>\n<p><strong> Input: [</strong>Clicking Play Button / Game Screen Load] User Launch Game <strong>Output:</strong> Welcome Message Shown with Fade animation\r\n  </p>\n<p>            <strong>Description:</strong> Upon the user pressing the play button, the game scene is changed into the actual game screen. After the change, the user is then presented with a Welcome message, this message has a fade in animation that lasts for 2 frames, then continues to last on the screen for another 2 frames, after which it will clear on the 420 second. The alpha of the text is changed based on frames. Connection to user interface is the animation only triggers upon user pressing the play button on the main menu.\r\n  </p>\n<p><strong>Feature 2: </strong>\n</p>\n<p><strong>Input: </strong>User presses the H Key on their keyboard<strong> Output: </strong>Screen Text is cleared off the screen\r\n  </p>\n<p>            <strong>Description: </strong>\n</p>\n<p>                        Each of the screen messages that tell the user how to rotate the hat, increase and decrease the scale will be cleared off to the X location either +900 or -900 based upon what side of the canvas they are on. Upon pressing the H key again, if the screen was already cleared, the items will be placed back onto the screen.\r\n  </p>\n<p> \r\n  </p>\n<p><strong>Feature 3:</strong>\n</p>\n<p><strong>            Input: </strong>User presses the Space Bar Key on their keyboard<strong> Output: </strong>Hat Movement animation occurs\r\n  </p>\n<p>            <strong>Description:</strong> </p>\n<p>                        Upon the user pressing the space bar on their keyboard, there will be an animation that is toggled on the screen which would increase the scale of the hats already on the canvas and drawn out to 60 then back down to 30. The animation is a total of 30 seconds and will continue the existing hats until the game doesn’t delete them or the user doesn’t press the space bar again. \r\n</p>", "metacritic": null, "released": "2022-12-04", "tba": false, "updated": "2022-12-05T05:40:57", "background_image": "https://media.rawg.io/media/screenshots/9cb/9cb076857071291e2a402916e047e534.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 6, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Sars1234"], "genres": [], "publishers": [], "esrb_rating": null}