{"id": 890289, "slug": "the-endless-dream", "name": "The Endless Dream", "name_original": "The Endless Dream", "description": "<strong>Story</strong><br/>Dive into an extraordinary journey inside the mind of a father, trapped in a coma after a tragic accident. The Endless Dream will catapult you into a timeless world where memories and reality merge in an enigmatic labyrinth.<br/><br/>In this immersive adventure, you awaken without memories, confused, and the fate of the protagonist depends solely on you. Face intense challenges, unravel mysteries, and piece together the shattered life of the protagonist, while seeking to bring an end to an endless dream.<br/><br/>Explore dreamlike landscapes, traverse enchanted realms, and interact with mysterious characters, all while the line between reality and illusion grows blurred. Every choice you make will have consequences and advance an intricate plot, where the past clashes with the present and the boundary between light and darkness becomes increasingly tenuous.<br/><br/>Take on the challenge of The Endless Dream and discover if you can awaken the father from his coma and find the path to the hidden truth. Can you break the cycle of uncertainty and make sense of this never-ending dream?<br/><br/><strong>Gameplay Mechanics</strong><br/><br/>Get ready to challenge your mind in The Endless Dream, an exciting first-person puzzle adventure. Explore the intricate web of memories and illusions of the protagonist, solving clever puzzles along the way.<br/><br/>Armed only with your intelligence and powers of observation, you must gather clues, decipher hidden codes, and unlock ancient secrets. Explore evocative environments, from enigmatic rooms to surreal landscapes, as you strive to reconstruct the puzzle of the protagonist's life.<br/><br/>Make the most of the objects you find along the journey to overcome the obstacles that stand between you and the truth. Each solved puzzle brings you closer to understanding the mysteries that shroud the endless dream.<br/><br/>But beware, the answers won't always be obvious and may require lateral thinking and an open mind. You must observe carefully, listen to the whispers of shadows, and grasp elusive details to progress.<br/><br/>The Endless Dream immerses you in a gripping experience where each solved puzzle takes you deeper into the heart of the protagonist's subconscious. Get ready to be surprised, amazed, and fascinated by the depth of the challenges that await.<br/><br/>Are you ready to put your critical thinking skills to the test and explore the boundaries of consciousness?", "metacritic": null, "released": "2022-12-04", "tba": false, "updated": "2023-11-03T17:28:50", "background_image": "https://media.rawg.io/media/screenshots/948/9481a27b5c77eff97e88dcacc5f9aaf5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["PhilterPhil", "Fortitudo Games"], "genres": ["Adventure", "Simulation", "Casual", "Indie"], "publishers": ["Fortitudo Games"], "esrb_rating": null}