{"id": 890456, "slug": "mile-high-taxi", "name": "MiLE HiGH TAXi", "name_original": "MiLE HiGH TAXi", "description": "<p>“MiLE HiGH TAXi is The Fifth Element meets Crazy Taxi”.<br />\nFly your taxi cab in a race against time, transporting as many wacky passengers as you can.</p>\n<p>Master the Game<br />\nThe game play is simple, but mastering this game is hard! I&#39;ve provided an &quot;easy&quot; setting. Switch to &quot;normal&quot; when you&#39;re ready.</p>\n<p>Choose From 3 Different Game Play Modes<br />\nIn regular mode, choose which passengers to pick up and drop off in  order to maximize earnings and extend your game time and career<br />\nWith Challenge mode, you&#39;ll deliver passengers sequentially to level up, as the game gets progressively more difficult<br />\nIn Free Roam mode you can freely explore with no time-limits,  learning the city&#39;s layout, advanced hidden shortcuts, and other secrets<br />\nGameplay<br />\nSelect a taxi and start picking up fares from super skyscrapers.  Deliver them fast to keep your job and earn bonus time. Keep your eyes  on the sky - especially when using Hyper Boost - you&#39;re not the only one  flying these Skyways, and strange things are happening in Mile High  City! Use your NavCom AI to help you navigate and find hidden customers.</p>\n<p>Once you&#39;ve learned the city, use narrow back alleys to navigate  faster while blasting through skyway traffic at up to 250mph in the 600+  floor level.</p>\n<p>MiLE HiGH TAXi is like &quot;The Fifth Element meets Crazy Taxi&quot;. Deliver  Zany Passengers, Dodge Mile-High Skyscrapers, and Blabbermouth  Pedestrians in a Fast-Paced Race Against Time.</p>\n<p>Here are some of the games I&#39;m told are either similar, or that I  took some inspiration from: Crazy Taxi, Taxi Chaos, CloudPunk, CyberPunk  2077 (I&#39;m not sure why?), Forza, Grand Theft Auto (maybe because  driving into people?), BeamNG.drive, the Coruscant scene from Star Wars,  Midnight Club 3 (I&#39;m guessing because of the architecture of the  buildings), and last but not least is Taxi Simulator.</p>", "metacritic": null, "released": "2023-03-13", "tba": false, "updated": "2023-05-31T07:16:04", "background_image": "https://media.rawg.io/media/screenshots/b30/b309d3cac00ed822ecdc3324ca86c4c6.jpg", "website": "https://www.milehightaxi.net/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 218, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC"], "developers": ["Cassius John-Adams"], "genres": ["Action", "Simulation", "Racing", "Indie"], "publishers": ["Cassius John-Adams"], "esrb_rating": null}