{"id": 890793, "slug": "terra-nova-pinball", "name": "Terra Nova Pinball", "name_original": "Terra Nova Pinball", "description": "Gameplay\r\n<p>Classic pinball - launch the ball onto the table and use the flippers (⬅️/➡️ by default, can be configured in the menu) to keep the ball from draining out the bottom of the table, hitting targets and bumpers and completing minigames (see below) to score points.</p>\n<p>You have 3 balls to score as many points as you can, and record a new highscore!\r\n</p>\n<p>If the ball drains within 15s of launching, you get a free relaunch.\r\n</p>\n<p>Highscores are saved and can be viewed from the main menu.\r\n</p>\r\nTable layout\r\n\r\nSkillshot\r\n\r\n<p>Launch the ball so it hits the skillshot to score 250,000 points! Can only be got straight after launching the ball.\r\n</p>\r\nOuter lanes\r\n\r\n<p>If your ball goes down the outer lane, it'll be kicked back up onto the field - the first time. After this, the lane closes and any balls that go down them will drain out of the bottom.\r\n</p>\n<p>These lanes reset after the ball drains, or if you light all of the targets in the associated group (the leftmost 3 of the left lane, and the rightmost 2 for the right lane).</p>\r\nMinigames\r\n<p>Completing the following minigames can help score big points - and achieve ORBIT...\r\n</p>\r\nSlingshot\r\n\r\n<p>Shoot the ball around the top, lighting up the spinner and landing in the left kick-out hole to score a <strong>Slingshot!</strong></p>\n<p>This scores 50,000 points and lights up the letter <strong>'O' in ORBIT</strong>.\r\n</p>\r\nShifting Constellation\r\n\r\n<p>Passing the ball through one of the gaps at the top of the table will trigger the associated rollover and light one of the stars in this constellation.\r\n</p>\n<p>If you light all 5, you'll increase the <strong>multiplier</strong>, applying a 2x, 3x or even 4x bonus to all points you score. You'll also light the <strong>'B' in ORBIT</strong>.\r\n</p>\n<p>To help you light them all, you can shift which stars are lit left and right using the flippers.\r\n</p>\r\nMapping the Solar System\r\n\r\n<p>Bounce the ball off of the <strong>planet bumpers</strong> at the top of the table to collect data about the solar system - the bar to the right of them tracks your progress. If you can fill it up, you'll score 500,000 points and light up the letter <strong>'I' in ORBIT</strong>.\r\n</p>\n<p>However, beware of orbital drift - the progress bar will drain over time, so you'll need to keep hitting the planet bumpers to fill it up.\r\n</p>\r\nRefueling the rocket\r\n\r\n<p>Each time the ball passes down over one of the rollovers in each of the lanes at the bottom of the board, the rocket will be partially refueled.\r\n</p>\n<p>Trigger these 4 times to fill the <strong>rocket fuel gauge</strong>, and then land your ball in the kick-out hole at the base of the rocket to ignite <strong>Blast-off!</strong>!</p>\n<p>This scores 243,000 points, unleashes 3 balls onto the board (which will be automatically replaced for 20 seconds!) and lights up the letter <strong>'R' in ORBIT</strong>.\r\n</p>\n<p>However, if you drain the ball, the gauge will empty. And if you ignite the engine before it's fully fueled, you'll just get partial points, with no multi-ball and no 'R'.\r\n</p>\r\nCalibrating the lasers\r\n\r\n<p>Land the ball in the rightmost kick-out hole to start some target practice to calibrate the weapons systems.\r\n</p>\n<p>The light in front of one of the targets will start to blink - you'll then have 30s to hit that target. Then another will light up, and you'll have another 30s. Hit five of these without the timer running out, and you'll score 500,000 points and light up the letter <strong>'T' in ORBIT</strong>.\r\n</p>\n<p>Landing the ball in the kick-out hole while the target practice is ongoing will reset the timer back to a full 30s, giving you a bit more time.\r\n</p>\r\nAchieving ORBIT\r\n\r\n<p>Light all 5 letters in ORBIT and you'll score 3,000,000 points and gain a bonus ball.\r\n</p>\n<p>The letters will even reset - if you're skilled enough to light them all again.</p>\r\nSource\r\n<p>I learned a tremendous amount from others generously sharing code and examples while building this, so Terra Nova Pinball is open source, with the code and assets can be found on Github.</p>\n<strong>Version History</strong>\n<strong>V1.0.0 - 27/08/22</strong>\n<p>Initial release\r\n</p>\n<strong>V1.1.0 - 27/08/22</strong>\n<p>- FIX: Fixed an issue where the launcher would sometimes get stuck if released with 0 power.\r\n</p>\n<p>- FEATURE: Additional paddle options optimised for mobile player.\r\n</p>\r\nV1.2.0 - 02/12/22\r\n<p>- FIX: Fixed a rare out-of-bounds error that could occur during multiball.</p>\n<p>- FEATURE: Relaunching of the ball is now automatic.</p>\n<strong>License</strong>\n<p>\n</p>\n<p>Terra Nova Pinball by Matt Sutton is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License</p>", "metacritic": null, "released": "2022-12-02", "tba": false, "updated": "2022-12-05T10:39:20", "background_image": "https://media.rawg.io/media/screenshots/b81/b81836bfffc5c06b15e4e30f11f7db4c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["Spaghettieis Games"], "genres": ["Action"], "publishers": [], "esrb_rating": null}