{"id": 891277, "slug": "phantasy-star-fan-made-remake-alpha", "name": "Phantasy Star - Fan-Made Remake (Alpha)", "name_original": "Phantasy Star - Fan-Made Remake (Alpha)", "description": "<p>DISCLAIMER: This is a non-profitable fan-game. Phantasy Star I and the Phantasy Star related media are owned by SEGA. This fan-game is not associated with SEGA in any way, shape or form. Please support the official games by SEGA.</p>\n<p>This fan-game is in Brazilian Portuguese for now. Its final version with most of the bugs fixed will be translated to english. We hope everyone at least gives it a try for a taste of the Combat and the Dungeon, even though this alpha isn’t in english. You can change the in-game music inside Alis’s house. Camineet, Camineet’s Warehouse, and Medusa’s Cave are accessible within the southeast part of Palma. Myau may be bought somewhere in Camineet and Odin is trapped inside Medusa’s Cave. Camineet’s shop won’t sell a “Lanterna” to go inside Medusa’s Cave, but a powerful monster drops it. Explore it fully and you may find your remaining ally and a malevolent boss to destroy.  We hope you enjoy it!\r\n</p>\n<p>======================================</p>\n<p>Phantasy Star, o primeiro da franquia, foi lançado para o Master System em 20 de dezembro de 1987. Seu carisma e senso de inovação, com labirintos em primeira pessoa, não apenas deu origem a uma franquia longeva e duradoura, como também arrebatou uma legião de fãs por todo o mundo, que ainda hoje, mais de trinta anos depois, mantém viva a chama e a paixão pela série clássica. Por essa paixão foi que nós, quatro “phans” brasileiros, decidimos homenagear esse titã clássico dos RPG’s, repaginando-o em uma versão de RPG Maker. Uma versão com direito a inovações que possam nutrir e aplacar o carinho e curiosidades que os fãs mais antigos da franquia ainda alimentam. E além disso, trazer esse exemplo de RPG, ao conhecimento das novas gerações.<br/></p>\n<p>Esta, é uma versão alpha feita com muito carinho, e dedicação. Portanto, apesar de ainda possivelmente possuir “bugs” e não estar completa, esperamos com ela, que possamos transmitir para os fãs, uma noção de como será o resultado final. \r\n</p>", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2022-12-09T03:34:12", "background_image": "https://media.rawg.io/media/screenshots/c41/c415dcadb605b28d3ddd3a8c4f17215a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ODONT"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}