{"id": 891308, "slug": "antichi-misteri-tesori-perduti", "name": "Antichi Misteri & Tesori Perduti", "name_original": "Antichi Misteri & Tesori Perduti", "description": "Pronti per l'avventura?\r\n<p><em>Antichi Misteri &amp; Tesori Perduti</em> traspone le regole de <em>La Scatola Bianca</em> ai giorni nostri! Vestite i panni di moderni avventurieri al soldo di agenzie governative segrete alla ricerca di oggetti leggendari!</p>\r\nIn giro per il mondo!\r\n<p>Guidate i personaggi in giro per il mondo, tra rovine di civiltà perdute, siti permeati da poteri arcani, caverne sottomarine, templi aztechi, tombe egizie, palazzi atlantidei e monasteri tibetani.</p>\r\nAffrontate le società segrete!\r\n<p>Segreti millenari sono custoditi dalle società segrete che competono con i vostri personaggi in una sfrenata corsa contro il tempo. Rivaleggiate con i Templari, i Massoni, gli Illuminati, i Nazisti e altre agenzie segrete governative o religiose per sottrarre loro i preziosi tesori del passato.</p>\r\nRicercate gli antichi manufatti!\r\n<p>Il Santo Graal, l'Arca dell'Alleanza, Excalibur, la Lancia del Destino e altro ancora. Mettete in salvo gli oggetti leggendari capaci di scuotere il pensiero scientifico attuale fino alle sue fondamenta.</p>\n<p>Questo gioco è compatibile con La Scatola Bianca.</p>\r\nVersione POD\r\n<p>Potete ordinare una copia cartacea su Amazon.</p>\r\nWeb SRD\r\n<p>Potete consultare la versione web completa del gioco <strong>QUI</strong>.</p>", "metacritic": null, "released": "2022-12-08", "tba": false, "updated": "2022-12-09T03:44:35", "background_image": "https://media.rawg.io/media/screenshots/d45/d4539493cd73ff90f6ba844b80138edc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 59, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Italian Translation Alliance"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}