{"id": 891390, "slug": "tg-monkey-project", "name": "TG - Monkey Project", "name_original": "TG - Monkey Project", "description": "<p>Desmatamento, queimadas, caça e tráfico de animais silvestres, estão sendo citados aos montes em noticias e vem tendo números cada vez maiores, e são os principais causadores da diminuição drástica de espécies de animais silvestres os levando próximo ou até mesmo a extinção, sendo apenas uma das grandes consequências, isso ainda traz consigo grandes impactos no ecossistema como um todo, epidemias e doenças que são adquiridas e transmitidas por meio de animais fora do seu habitat natural, aumento do aquecimento global, instabilidade na formação de chuvas e seca por diversos pontos.<br/></p>\n<p>Para combater todos esses males e reverter tais consequências existe um longo caminho, diversas medidas a serem tomadas bem como campanhas de conscientização e incentivo a preservação animal e ambiental por parte do governo e sociedade, e por acreditar nisso que buscamos desenvolver um jogo trazendo os temas do desmatamento, tráfico e caça de animais silvestres temas pouco abordado em jogos, através deste o objetivo é introduzir o jogador a história do pequeno protagonista, um macaco, que vem sofrendo junto aos outros animais as perseguições dos traficantes e caçadores, junto também a dificuldade de viver em um ambiente cada vez mais degradado pelo desmatamento das florestas.  \r\n</p>\n<p><strong>Gênero do jogo:</strong> Aventura, Ação.</p>\n<p><strong>Plataforma:</strong> PC Linux e Windows. \r\n</p>\n<p><strong>Membros do Grupo:</strong>\n</p>\n<p>- João Victor</p>\n<p>-Jonas Duarte</p>\n<p>-Jhonatan Felipe</p>\n<p>-Rafael Castro</p>\n<p>-Renan Lima</p>\n\n<p><strong>Trabalho de Graduação (TG) do Curso Superior de Tecnologia em Jogos Digitais da Fatec Carapicuíba.</strong>\n</p>\n<p><strong>Semestre letivo: 2022-2</strong>\n</p>", "metacritic": null, "released": "2022-12-08", "tba": false, "updated": "2022-12-09T04:17:43", "background_image": "https://media.rawg.io/media/screenshots/fbf/fbffed04ae5ff6dd4f1cbac10e07cf1b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SiJOGA - Fatec Carapicuíba"], "genres": ["Action"], "publishers": [], "esrb_rating": null}