{"id": 891501, "slug": "piquinin", "name": "PIQUININ", "name_original": "PIQUININ", "description": "<p>Piquinin vive tranquilo em sua toca, ansioso à espera da construção do seu planeta ser finalizada. Ele sabe que o seu mundo é um jogo e está muito entusiasmado em ser o protagonista e anseia para iniciar suas aventuras.</p>\n<p>Em um determinado dia, acordou repentinamente com um barulho estrondoso e quando saiu de casa viu um enorme buraco negro que estava sugando tudo para dentro. Em seguida, avistou um feixe de luz e foi até ela, já sabendo que se tratava de um dos desenvolvedores do jogo. Muito confuso, Piquinin questiona sobre o que está acontecendo, consequentemente, o desenvolvedor esclarece que o seu mundo será deletado e tudo desaparecerá para sempre.</p>\n<p>Totalmente desnorteado e desesperado, o protagonista se ajoelha e implora para continuar existindo. Sendo assim, os criadores lhe concedem uma benção: a semente foi criada, uma enorme incubadora que irá manter todo o seu interior preservado pela eternidade, ou até brotar e florescer as ideias armazenadas ali.</p>\n<p>Entretanto, para que isso aconteça, Piquinin deve explorar o mundo e conhecer tudo que há nele, para então tudo que for visto possa ser salvo na semente. Ele tem a escolha de salvar ou abandonar para o esquecimento eterno.</p>\n<p>À vista disso, ele rapidamente saiu em busca da semente, traçando seu caminho para salvar sua vida, antes que tudo seja tarde demais.</p>", "metacritic": null, "released": "2022-12-08", "tba": false, "updated": "2022-12-09T05:04:37", "background_image": "https://media.rawg.io/media/screenshots/7a7/7a749e33df73925e18c57a3178868557.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DannyTetzner"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}