{"id": 891576, "slug": "i-became-a-proper-member-of-society-and-got-a-girl", "name": "I became a proper member of society and got a girlfriend before graduation?!", "name_original": "I became a proper member of society and got a girlfriend before graduation?!", "description": "<p><strong>\"If I believed in Santa Claus for ten whole years, then I can believe in myself for the next ten seconds!!!\"</strong></p>\n<p>Hikigaya Komori grew up in the middle of nowhere and learned everything she knows about human behavior and social dynamics from reading books and playing dating sims.</p>\n<p>Once, she went to a restaurant with her parents and said 'Thanks, you too!' to a waiter who told her to enjoy her meal.</p>\n<p>....She hasn't had the courage to show her face there since.<br/></p>\n<p>But fortune is a fickle mistress, and much to the chagrin of her and her classmates, she's found herself in the window seat at the back of the classroom normally set aside for the main character.</p>\n<p>And when one misunderstanding leads to another, she briefly considers writing an autobiography and titling it 'A Series of Unfortunate Events,' copyright be damned.</p>\n<p>_______________________________</p>\n<p>Kohinata Koharu is the former student council president and resident popular girl, considered mysterious by some and out of reach to all.</p>\n\n<p>It was by sheer happenstance she passed by Komori's classroom when she did, inadvertently saving her from the wonton wrath of her peers.</p>\n<p>But an accident is just fate by another name, and on a whim, she takes a blossoming interest in the other... with no ulterior motives whatsoever.</p>\n<p>Setting aside the fact that Komori doesn't believe in genuine altruism, she can't figure out why someone at the top of the pecking order would rub shoulders with a lowly ant like her...</p>\n<p>But for the longest time, she <em>has</em> wanted to change... if only she could.</p>\n<p>Now that she can, the opportunity is paired with the harrowing realization that rest of her youth depends on Koharu's opinion of her.</p>\n<p>When she said \"this couldn't possibly get any worse!!\", that wasn't a challenge, you know!!!</p>\n<p> So it's easier said than done... but that doesn't mean she doesn't want to try!</p>\n<p>After all, this is the kind of once-in-a-lifetime opportunity that someone like her could only dream of!!</p>\n\n<p>Will Komori be able to grow out of her shell, or will her life turn into a tragedy worthy of Shakespeare himself? Can she really get through all the items on her 'how to properly enjoy my youth! ♡' checklist when it's been untouched for over a year?? A thriving social life might be a bit of a stretch, but surely, she can manage to make a few friends, right?</p>\n<p>...Right??</p>\n\n<p>Read 'I became a proper member of society and even got a girlfriend before graduation?!' to find out!</p>\n\n<p>_______________________________</p>\n\n<p>This version is a short (extremely short, ten minutes at best) demo for Yuri Game Jam 2022. The script for the full version is about three-fourths written but unedited and hopefully will be out by New Year's.</p>\n<p>A second demo will be available soon with roughly half the total story (by Christmas-time), so be on the lookout for that.</p>\n<p>For updates, you can follow us here on itch if you'd like or find more frequent posts on our twitter.</p>\n<p>In the meantime, feel free to check out last year's entry: She Already Has Someone She Likes?!</p>\n\n<p>Credits:</p>\n<p>GUI is Modern Gradient by Skolaztika<br/></p>\n<p>Silhouettes from: here\r\n</p>\n<p>Backgrounds: Uncle Mugen and Noraneko Games.\r\n</p>\n<p>BGM: here\r\n</p>\n<p>Sprites: taken from Hinekuremono no Gakuen Seishun Monogatari ~Ore to Kanojo no Reversible\r\n</p>\n<p>Made using the renpy engine.</p>", "metacritic": null, "released": "2022-12-08", "tba": false, "updated": "2022-12-09T05:34:17", "background_image": "https://media.rawg.io/media/screenshots/d97/d9716440919974e217b95db1b796ff91.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 113, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Studio Chuunibyou"], "genres": [], "publishers": [], "esrb_rating": null}