{"id": 891616, "slug": "pitch-hero", "name": "Pitch Hero", "name_original": "Pitch Hero", "description": "<p>Are you ready to unleash your inner rockstar? With our revolutionary new app, \"Pitch Hero\" you can do just that! Whether you play Trombone, Trumpet, or any other brass or monophonic  instrument, this app will help you hone your skills and become a true music magician.\r\n</p>\n<p>Featuring a fully customizable playlist! You can upload any MusicXML Sheet you want! Pitch Hero will keep you engaged and entertained for hours on end. Plus, with its sleek and user-friendly design, you'll be able to easily track your progress and compete with friends for the top score.\r\n</p>\n<p>Don't miss out on this exciting opportunity to take your musical talents to the next level. Download Pitch Hero today and start your journey to becoming a master musician!\r\n</p>\n<p>Supports MusicXML format. Must have a microphone on your PC to hear if the note is correct.</p>\n<p>Instructions:</p>\n<ol><li>Run the game once to make sure all the folders are created</li><li>Unzip your \".mxl\" file and grab the \".xml\" score from the newly created folder.</li><li>Place the \".xml\" file into the app's AppData folder.<ol><li>It should be somewhere like this \"C:\\Users\\Cazforshort\\AppData\\LocalLow\\Cazforshort\\Pitch Hero\"</li></ol></li><li>Start the game, pick your score, and pick the part.</li></ol>\n<p>Score points for playing the correct notes and playing them for the right durations.</p>", "metacritic": null, "released": "2022-12-08", "tba": false, "updated": "2022-12-09T05:48:40", "background_image": "https://media.rawg.io/media/screenshots/105/105e4e1981a241a4c84c5ead4c76968d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["cazforshort"], "genres": [], "publishers": [], "esrb_rating": null}