{"id": 891661, "slug": "mysteries-of-the-twos", "name": "Mysteries of the Twos", "name_original": "Mysteries of the Twos", "description": "<p><strong>........</strong>\n</p>\n<p><strong>.....</strong>\n</p>\n<p><strong>..</strong>\n</p>\n<p><strong>Hello.</strong>\n</p>\n<p>I'm sorry... \r\n    </p>\n<p>But for now, this game is only available in French.\r\n    </p>\n<p>So if you don't understand or speak French, you will not understand what I'm saying after this...\r\n    </p>\n<p>But don't worry...\r\n    </p>\r\nThis is only temporary... after all, I was waiting for you to come this whole time...  \r\nAnd I deeply wish for you to understand the story so you can enjoy it. \r\n<p>For now, you'll have to be a little patient.. but don't forget about me in the meantime...\r\n    </p>\r\nBecause I'll not forget about you. \r\n<p>See you soon. <br/></p>\n\n<p><strong><em>J'espère que ma petite lettre aura su  attirer ton   attention.. si ce n'est pas le cas, laisse moi te faire  goûter à un   petit morceau de ce que contient cette intrigue... \r\n</em></strong><strong><em>Pour te mettre en  appétit...</em></strong> </p>\n<p>Un soir, tu te réveilles dans un endroit qui ne  te dit absolument rien,  une chambre dans laquelle tu es enfermée à clé:  porte et fenêtres bloquées, chambre vide de tout indice ou moyens de  communication avec l’extérieur... tu comprends très vite que<strong> tu as été kidnappé dans de mystérieuses circonstances.</strong>\n</p>\n<p>Plus encore, tu ne te souviens de rien, ni de ta vie avant ce soir fatidique, ni même <strong>de ton nom</strong>. Tu ne sais pas et tu n'as aucune idée de qui pourrait être ton  ravisseur, ses motifs et ses objectifs te sont également inconnus.\r\n    </p>\n<p>Cependant... \r\n    </p>\r\n Ce n'est pas un kidnapping classique où tu restes enfermée et où tu dois essayer de t'enfuir... \r\nEn effet, tu es très vite libre de sortir.\r\n<p>Mais ton ravisseur t'informe assez vite d\"une chose :\r\n    </p>\r\n Il veut que tu ailles étudier dans un lycée qu'il t'a désigné et où il dit y être également étudiant  \r\n<p>Privé de tes repères, de tes souvenirs, de ta famille, de ton ancienne vie et de<strong> ton identité, </strong>tu dois lutter pour découvrir le responsable, ce qu'il attend de toi, ce qu'il entend faire de toi..... découvrir la vérité<strong> ... mais surtout découvrir qui tu es vraiment</strong>...\r\n    </p>\r\nAlors...que vas-tu faire?\r\n<ul><li><em><strong>Vas-tu obéir au ravisseur? .. ou lui désobéir?</strong></em>\n</li><li><em><strong>Vas-tu avertir les autorités et tenter de lui échapper?</strong></em>\n</li><li><em><strong>Ou vas-tu faire ce qu'il te demande sans résister?</strong></em>\n</li></ul>\n<ul><li><em><strong>Vas-tu céder en tentant de découvrir la vérité ?                                                </strong></em>\n</li><li><em><strong>Vas-tu réussir à te libérer ?</strong></em>\n</li><li><em><strong>Vas-tu briser les mystères ? </strong></em>\n</li></ul>\r\nViens vite découvrir les réponses à tes questions.\r\n<p> <em><strong>Tu n'es toujours pas convaincu(e)? Eh bien sache que je ne serais pas le seul personnage a être ton ennemie présent dans l'histoire... en voici quelques uns...</strong></em></p>\n\n\n\n<p>\n</p>\n<br/>\n\n<p><strong><em>J'aimerais pouvoir affirmer que l'intrigue te plaira qu'importe ce qu'elle contient... <br/></em></strong><strong><em>mais je dois te mettre en garde de ce qui pourrait te choquer dans l'histoire...</em></strong><strong><em>Histoire que tu profites de ton expérience de jeu en toute connaissance de cause. </em></strong> <br/></p>\r\n/!\\ Ce jeu aborde des thèmes choquants tel que :\r\n<ul><li>Kidnapping\r\n</li><li>Dépression\r\n</li><li>Psychopathie\r\n</li><li>Mort \r\n</li></ul>\r\n/!\\ Ce jeu représente des images pouvant heurter la sensibilité de certains:\r\n<ul><li>Images représentant du sang\r\n</li><li>Nudité censuré\r\n</li></ul>\n<p><em><strong>Maintenant que la phase \"Mise en  garde\" est passé,  peut être trouveras-tu cela intéressant que je  mentionne que l'histoire ne se limite pas à un seul jeu...l'intrigue  tout autant que ses personnages évoluent dans le temps...\r\n</strong></em>\n</p>\n<p><em><strong>Ainsi, tu auras pleinement le temps de t'attacher à eux ou de les détester  et de profiter du divertissement que procure</strong></em><em><strong> cette histoire pleine de rebondissements mais surtout de mystères...\r\n</strong></em>\n</p>\n<ul><li><strong>Organisation de l'histoire:</strong>\n</li></ul>\n<p>Mysteries of the Twos fait partie d'une série de jeux sous la forme de Visuals Novels qui s'intitule<em><strong> \"Mysteries\".\r\n</strong></em>\n</p>\n<p>Cette série comprend un total de 3 jeux  qui sont chronologiques et qui font évoluer l'histoire et les  personnages au fil du temps.\r\n    </p>\n<p>Chaque jeu comporte son lot de personnages  exclusifs, c'est à dire qu'ils ne réapparaitront pas ensuite, mais pour  d'autres ils apparaissent du début jusqu'à la fin.\r\n    </p>\n<p><strong>- The Past </strong>:<em> Origin of the Mysteries</em> (se déroule en 2009).\r\n    </p>\n<p><strong>- The Present: </strong><em>Mysteries of the Twos</em> (se déroule en 2024).\r\n    </p>\n<p><strong>- The Future</strong> :<em> End of the Mysteries</em> (se déroule en 2030).\r\n    </p>\n<ul><li><strong>Découpage des jeux:</strong>\n</li></ul>\n<p>Chaque jeu est découpé en plusieurs \"parties\" de jeu. \r\nPar exemple pour Mysteries of the Twos, il y aura <strong>5 Parties</strong>, prologue compris, chaque partie est une <strong>partie de jeu à part entière</strong>, ainsi lorsque vous finissez de jouer une partie <strong>il faut télécharger la suivante pour avancer dans l'intrigue</strong> <em>(ça permet d'épurer le jeu et d'éviter de sauvegarder tout le temps... mais ça a plein d'autres intérêts pour l'intrigue...</em>)\r\n    </p>\n<p>Le 1er jeu à être publié est donc l'histoire du présent:<em>  Mysteries of the Twos</em>, (pourquoi est-ce le cas? c'est un mystère aussi..). \r\n    </p>\r\n/!\\ Pour l'instant seul le Prologue de Mysteries of the Twos  est disponible. \r\n/!\\ La 1ère partie est en cours de production.\r\nAlors, es-tu assez interessé/e ? \r\n<p>Si c'est le cas, je t'invite à télécharger le prologue pour que l'on commence notre petite aventure mystérieuse...  <br/></p>\r\n\r\nLa solution aux mystères n'attend plus que toi pour être révélé.\r\n...\r\n\n<br/><br/>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-09T06:07:19", "background_image": "https://media.rawg.io/media/screenshots/17c/17cdb473e9d4617a4fdb44add22b4320.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MelaEliera"], "genres": [], "publishers": [], "esrb_rating": null}