{"id": 8917, "slug": "trisector", "name": "Trisector", "name_original": "Trisector", "description": "Trisector is an arcade style side scrolling bullet filled shoot-em-up (SHMUP) that has a dash of cave flying and a heaping ton of bullets.<br/><br/>Fight as a mercenary investigating Tri-Corp’s activities through 9 story levels and 1 boss level. Navigate the terrain, collect power-ups, dodge and shoot enemy bullets, and destroy enemies. Damaged and destroyed enemies have a chance to drop random power-ups and destroyed enemy bullets turn into XP pods (for reducing energy costs) or energy (for more survivability and offensive power). <br/><br/>Features:<br/> • Universal App for iPad, iPhone, and iPod<br/> • Training level<br/> • 9 bullet filled Story levels and 1 Boss level<br/> • Collect power-ups including a Shield, Weapon Upgrade, Burst, and more<br/> • Bullets, Bullets, and more Bullets (and Lasers too)<br/> • Random power-ups from damaging and destroying enemy ships <br/> • Collect all of the Story Nodes in a level to earn a starting Energy, Weapon and Speed bonus<br/> • A Hard Mode toggle for an additional challenge<br/> • Dynamic Difficulty Scaling option for Normal Mode<br/> • Dynamic music system that changes for each level and situation<br/> • Comprehensive in game help and information via the Codex<br/> • Retina ready with high resolution graphics and dynamic lighting<br/> • Game Center support with Score and Time Leaderboards and Achievements<br/> • No In-App Purchases or Ads<br/> • Did anyone mention the heaping ton of bullets?<br/><br/>Controls:<br/> • Landscape device orientation<br/> • Steer using Relative Touch, Tilt, on-screen Joystick, or MFi Game Controller<br/> • Configurable control sensitivity<br/> • Tap screen to fire<br/> • Boost and Drag power-ups control ship speed<br/><br/>Trisector is an independent game made by Jesse Ozog of SmashRiot, LLC.  Learn more about Trisector and the making of Trisector at http://SmashRiot.com/", "metacritic": null, "released": "2013-06-18", "tba": false, "updated": "2019-10-22T14:30:10", "background_image": "https://media.rawg.io/media/screenshots/9bd/9bd02819102a09d73497fff0b33dfe15_fBXTFrL.jpeg", "website": "http://smashriot.com/trisector/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Jesse Ozog"], "genres": ["Action", "Arcade"], "publishers": ["Jesse Ozog"], "esrb_rating": "Everyone 10+"}