{"id": 891897, "slug": "afterlife-itch-sydney-fonderie-jsxiong95-vazkuz-fo", "name": "Afterlife (itch) (Sydney Fonderie, jsxiong95, Vazkuz, Fooderxima, MichelleGo)", "name_original": "Afterlife (itch) (Sydney Fonderie, jsxiong95, Vazkuz, Fooderxima, MichelleGo)", "description": "<p>Afterlife is a short first-person shooter developed in Unity 2021 over the course of three weeks. Our objective was to create a visually-engrossing mystery narrative combined with a fun first-person shooter. We also added some puzzles to spice up gameplay.</p>\n<p>Daniel - Level Design, Level Programming, and Level Assembly<br/>Hank - Narrative Design, Level Design, and Level Assembly<br/>Joseph - Level Design and Level Assembly<br/>Michelle - Narrative Design and Level Assembly<br/>Sydney - Gameplay Programming and Level Programming</p>\n<p>Most of the assets in this project are from the Unity Asset Store or Sketchfab and were acquired for free. You can find all of our sources below:</p>\n<p>3d Textures<br/>https://3dtextures.me/</p>\n<p>Unity Asset Store<br/>Asset Store - Sci-Fi Old Rusty Props<br/>Asset Store - Sci-Fi Office Pack<br/>Asset Store - Cardboard Boxes Pack<br/>Asset Store - Horror School Props<br/>Asset Store - Table and Chair Sets<br/>Asset Store - Modern Furniture Pack<br/>Asset Store - Industrial Yard Pack<br/>Asset Store - Clipboard</p>\n<p>Sketchfab Assets<br/>Office Set Asset<br/>Human Remains Asset<br/>Poster Asset<br/>Speaker Asset<br/>Music Cassette Asset<br/>Cassette Tape Asset<br/>Cassette Player Asset</p>\n<p>And of course a special shoutout to Dylan Rose and the rest of the team from The Lodge for the Fusebox asset.</p>", "metacritic": null, "released": "2022-12-07", "tba": false, "updated": "2022-12-09T07:43:33", "background_image": "https://media.rawg.io/media/screenshots/434/434b3b00ef5506c3c20e910eb279f9d5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 32, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["jsxiong95", "Sydney Fonderie", "Vazkuz", "Fooderxima", "MichelleGo"], "genres": ["Action", "Puzzle"], "publishers": [], "esrb_rating": null}