{"id": 891967, "slug": "timing-is-of-the-essence", "name": "Timing is of the Essence", "name_original": "Timing is of the Essence", "description": "<p><em>Description</em></p>\n<p>In Timing is of the Essence, you combine different bits of music into a sequence to solve a puzzle. The correct sequence opens up the path to the next segment of the game while adding a new instrument every time. Reach the end and sit back as the completion pushes the game world and the music to its climax, revealing the harmony between the sequenced sounds and the in-game world!<br/></p>\n<p><em>Project Info</em></p>\n<p>This prototype (vertical slice) of a game is my final submission and what got me my bachelor’s degree as a Games Programmer. I tried bringing the focus of the project towards both Game Design and Music, as I am both fascinated by Game Design and a musician (pianist) who is in love with music-based games.\r\n</p>\n<p>It began with a simple quote: “Make a game that uses music as a core element”. I took this idea to the next level, by eliminating any music-based game that could be played without any sound on (Guitar Hero, Piano Tiles, you get the idea) and took inspiration from a very niche concept: sequencing.</p>\n<p>What I ended up with was a beat sequencer that I would use as core mechanic of the game. The goal of the game is to solve puzzles in form of sequences. By interacting with the cubes in the game, you place them in the sequencer, which will then play them in a specific order. Finding the correct sequence will unlock the next part of the world.\r\n</p>\n<p>The project was seen as both fun and innovative, as games that use a sequencer as core mechanic do not currently exist on a wide scale (as of 2022).<br/>If you would like to play it, feel free to download the file and run the 64 or 32 bit .exe of the game!</p>\n<p><em>Portfolio</em></p>\n<p>https://nicolasbeeler.tumblr.com/</p>", "metacritic": null, "released": "2022-12-07", "tba": false, "updated": "2022-12-09T08:12:33", "background_image": "https://media.rawg.io/media/screenshots/e26/e2640115095af70d2ef50ba44ba27b50.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 36, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["DarkMoves"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}