{"id": 8919, "slug": "beat-runner", "name": "Beat Runner", "name_original": "Beat Runner", "description": "Beat Runner is a new exciting rhythm based, action packed game.<br/>With its strong beat and rhythmic melody, it gives you a fantastic experience.<br/><br/>Jump to the rhythm, avoid obstacles, try to play through the entire song.<br/>The beat tells you when to jump. Trust the music.<br/><br/>The game has simple one touch control yet addictive gameplay and it is suitable for both experienced and new players.<br/>Easy to play, hard to master. Some might say it cannot be completely beaten. Especially on Extreme mode. Patience and practice will be your friends.<br/><br/>The levels (music tracks) are split into short parts. Practice on the individual parts. When you have mastered the individual parts then comes the FINALE (the full song) with all parts together.<br/><br/>18 amazing stages ( including 3 extreme and challenging &amp;quot;Finale&amp;quot; levels) with increasing difficulty and speed.<br/>At the &amp;quot;Finale&amp;quot; levels you can choose between Extreme (no extra life) and Normal mode (3 lives).<br/><br/>Packed with beautiful visual effects and amazing music tracks.<br/><br/>The game rewards you with stars. Try to beat each level in one attempt and collect 3 stars. You can improve your attempt number by restarting the levels. <br/><br/>The flow of the game is perfectly in sync with the music&amp;#39;s rhythm and melody.<br/>If you like music, rhythm and addictive runner games, you have it all in Beat Runner, and more...<br/><br/>Try it, beat it and enjoy it!<br/><br/>Note: The game includes intense visual effects and flashing lights. Players with medical condition like epilepsy should keep this in mind.<br/><br/>Trailer and Gameplay videos: Youtube search: &amp;quot;Beat Runner ios&amp;quot;", "metacritic": null, "released": "2012-12-20", "tba": false, "updated": "2019-10-22T14:30:10", "background_image": "https://media.rawg.io/media/screenshots/709/7098aedd8870371639d51d486921c07e.jpeg", "website": "http://www.facebook.com/pages/3D-Senses-Studios/175575935815865", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 146, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Andy Reeves"], "genres": ["Arcade"], "publishers": ["Andy Reeves"], "esrb_rating": "Everyone 10+"}