{"id": 892128, "slug": "super-chess-battle", "name": "Super Chess Battle", "name_original": "Super Chess Battle", "description": "Super Chess Battle\r\nWhat?\r\n<p>Super chess Battle is a chess game where every pieces have a dice.</p>\n<p>Each time you try to take a piece belonging to the enemy, a dice is throwed and the result of the fight dictate if you managed to take the piece or not. If yes, the enemy piece is destroyed, if not, your piece retreat to its original place.</p>\r\nWhy?\r\n<p>Because I love paper RPGs and dices and I kinda like chess but i am really bad at it so this game kinda level the plainfield for people like me who are really bad at the game.</p>\r\nFuture plans\r\n<p>Note that all those plans may never happens because it would take time and i don't really have time. But if this game generate enough interest, i'll be glad to try to take down that list.</p>\n<ul><li>General fixes and rework : the game should be stable but it need a lot of love to be able to welcome all the changes bellow\r\n</li><li>Bots will be improved if I find time for it. This current \"dumb as a rock\" bot was just to test the concept of bot actions.</li><li>I will maybe try to make a <strong>multiplayer</strong> mode for the game. For now, \"local\" multiplayer is possible if you play on the same computer.</li><li>More different sets of units. And better UI.</li><li>better animations for the dice throw, even for the fight itself.</li><li>I have ideas to add more selectable sets of game-rules : <ul><li>units having two dices, one for attack, one for defense.</li></ul><ul><li>units having healthpoints, so each time there is an attack, health is lost, and the game become a more complex (barely) turn-based strategy game rather than a chess game.</li></ul></li></ul>\n<p>I hope you'll enjoy the concept and the idea and let me know in the comment if you wish for more.</p>\n<p>(and if you do, don't hesitate to tip :3)</p>\r\nLast Update : 0.0.3a\r\n<ul><li>Add animated dices during fights to make them a little more alive.</li><li>WebGL available (plz work plz work plz work).</li><li>Fix issue that would allow player to play during bot's turn.</li><li>Fix potential crash during bot capture of player piece.</li><li>Changing the way Player and movements are handle to prepare for potential online multiplayer gameplay.</li></ul>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-09T09:20:39", "background_image": "https://media.rawg.io/media/screenshots/069/069bd9e4a74fb8c64caa62a9c1c4d342.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux"], "developers": ["Captain Nakou"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}