{"id": 892137, "slug": "disco-bird-and-the-dance-off-of-destiny", "name": "Disco Bird and the Dance Off of Destiny", "name_original": "Disco Bird and the Dance Off of Destiny", "description": "<p>This was my final project for a college class in Fall semester of sophomore year. It was developed in Processing, which is essentially worse Java, under time constraints. Enjoy!<br/></p>\n<p><strong>OUR STORY\r\n</strong></p>\n<p>We descend onto a peaceful land, where creatures of all types live their lives! Some farm and live the simple life, some war with each other, and some take up quests across the vast and uncharted continent! But among them all, there is but one who has followed the path of the light-up dance floor, only one capable of channeling the moon’s rays into magic spells through their dance moves alone… there is only one\r\n</p>\n<p>DISCO BIRD!\r\n</p>\n<p>It was Disco Bird who discovered the Fortress of Funk in their travels, a magical castle imbued with a deep connection to Groove Energy - the magical life force of the land, which drums the beat by which all things live their lives. But no such source of power could stand unassailed for long, and so it came to pass that upon learning of the Fortress, the evil HAWK OF HATE descended upon it with an army of foul beasts and horrible monsters! He stands now at the Highest Note of the Fortress, scheming and plotting. The wardens of the Fortress escaped only with their lives, and brought word to Disco Bird that the Hawk has concocted a most horrendous plan! \r\n</p>\n<p>“The Hawk of Hate aims to channel all the Groove Energy of the land through the Fortress, and use it to control all those who live here! They’ll be forced to dance to HIS beat! You must stop him, Disco Bird!”\r\n</p>\n<p>And so it was that Disco Bird flew with all haste to the Fortress of Funk, and stands now at its doors! The Hawk of Hate sees all in the skies, so the only option is to fight through the halls of the castle. Will Disco Bird be able to boogie through the battles ahead? Can they show the army of the Hawk of Hate that there is another, brighter path for them to jive upon? The fate of the land is up to you - fated to be decided in the \r\n</p>\n<p>DANCE OFF OF DESTINY!\r\n</p>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-09T09:23:51", "background_image": "https://media.rawg.io/media/screenshots/395/395c2011bbfe11de088b78eed58174aa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["p1xel_imperfect"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}