{"id": 892368, "slug": "dead-mans-sea", "name": "Dead Man's Sea", "name_original": "Dead Man's Sea", "description": "<p>Description:</p>\n<p>Bullet hell meets the open water as players must navigate their ship through obstacles and hoards of cannon fire to sink their enemies, but with each level comes an increasingly stronger armada ready to serve up a one-way ticket to Davy Jones. One can only dream of the treasure that is guarded by the myths and legends of the sea but no one knows what could truly be lurking in the depths of Dead Man's Sea.</p>\n\n<p>Controls:</p>\n<p>W to sail up, A to sail left, S to sail down, D to sail right, MOUSE to aim, LMB to shoot</p>\n\n<p>Post-Mortem:</p>\n<p>What went right? The group was easily able to come up with a collaborative idea that we were all passionate about and eager to get done. Distributing roles made the organization of tasks much easier and allowed each group member to partake in the processes which they enjoyed and avoid the ones they didn't. What went wrong? With other work to do it made focusing solely on the development of the game difficult. There were also many times in which we encountered blockers from one person that would stop production entirely. Next time it would be beneficial to identify what times can block production in its entirety and prioritize those tasks. We also encountered issues due to poor planning. So ideas wouldn't be fully flushed out and when it came time to implement other mechanics would pose an issue. In the future, we would do a better job of having some foresight and planning out our roadmap more specifically to try and mitigate these types of issues.</p>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-09T10:57:06", "background_image": "https://media.rawg.io/media/screenshots/04f/04f626cc8bd5b799c4ba157fcaa4a85d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 94, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ktschnulo"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}