{"id": 892360, "slug": "fireplace-daikuwu", "name": "Fireplace (daikuwu)", "name_original": "Fireplace (daikuwu)", "description": "<p>This game was made for the #WinterVNJam for 2022. </p>\n<p>This is my first time making a visual novel with ren'py and was made in about 3 weeks. The first week was spent brainstorming ideas and writing. The 2nd week was spent finishing the writing and getting feedback from some friends. The final week was spent drawing and coding.  I'm also a beginner artist and wanted to try something different to help me improve my art skills.</p>\n<p>All backgrounds used were from itch.io assets page or stock images. All sprite, writing, and coding were done by me. There are more than 3k (3,000) words. </p>\n<p>The characters are my 3 ocs (Yoru, Jay, Blake) that have been in the back of my mind for a while and I've only recently started writing and drawing of them. The 3 of them are all college students that go to the same school. Yoru and Jay met by sharing similar classes. Jay and Blake met by common interests at the gym. Blake and Yoru met at a club they both enjoyed going to. Yoru is kinda close to how I actually am. Happy being with his friends, always forgetting everything, and very clumsy. Jay can be considered a himbo. He's not the brightest but he also thinks about his friends. Even if he doesn't always do the right thing. Blake can seem scary on the outside. And he kinda is on the inside but he has a heart of gold. Always caring about his friends in his own way. </p>\n<p>I always love writing but I've never actually done much with it. Writing this has really helped my improvement in writing especially with multiple routes. The story went through many phases. Originally it was gonna be about a snow day outside, but I decided to go with the warm comfort of the fireplace instead. I had some other ideas, but I might use them later on so I won't spoil them for now.\r\n</p>\n<p>Anyways that's all I have to share for now. Had a lot of fun working on this and I definitely plan on working on more VN in the future.\r\n</p>\n<p>Thanks for reading and I hope you enjoy the story.\r\n</p>\n<p><strong>Future plans</strong></p>\n<p>- More endings/routes</p>\n<p>- CG art for endings</p>\n<p>- Improved/More sprites</p>\n<p>- Music and sound effects</p>\n<p>- Accessibility options</p>\n<p>- UI update</p>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-09T10:54:09", "background_image": "https://media.rawg.io/media/screenshots/c80/c804a00f6a874d5c645d43e052ac1057.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 202, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["daikuwu"], "genres": [], "publishers": [], "esrb_rating": null}