{"id": 892543, "slug": "autograv", "name": "AUTOGRAV", "name_original": "AUTOGRAV", "description": "<p><strong>AUTOGRAV</strong> is a miniature digital world for fans of high speed anti gravity vehicles, 90s japanese highway battles, and drone racing. It's also for people who like gazing out the window at traffic for hours while sitting in the backseat.</p>\n\r\nthe situation\r\n<p>On the road in the back of your old, self driving van, you have unlimited access to speed cameras, dash cams, hull mounted cameras... if you can see it, you can see it.</p>\n\n<p>Meanwhile, a constantly rotating population of procedurally generated AI pilots cruises <strong>the loop</strong>, challenging each other to races at breakneck speeds, putting their own cash on the line in wagers, competing in local rankings, and even garnering the occasional racer tag. </p>\n\n<p><strong>AUTOGRAV</strong> doesn't need you to play it -- it will run itself forever without input. But if you like, feel free to take a seat and flip through the channels, or put it on in the background, or leave it going for a week. The loop never sleeps!<br/></p>\n<p>\n</p>\n<strong><em>AUTOGRAV</em></strong><em> was made by @acgaudette over the month of november 2021.</em>\r\npassage of time\r\n<p>When you first launch the world, none of the pilots will have any experience flying   the loop, and may be stricken by <strong>speed fright</strong>. For this   reason, first generation races will probably be tentative and slow. Once top pilots   emerge, however, they set a hot pace... until they age out and find themselves competing with rookies on the rise.<br/></p>\r\ncontroller support\r\n<p><strong>AUTOGRAV</strong> can be played with the keyboard and mouse, or with a controller. When using a controller, the <strong>left stick</strong> adjusts your posture (crouch, raise, and lean) and the <strong>left and right triggers</strong> adjust your focus distance. When using the keyboard, the <strong>control and space keys</strong> can be used to adjust your posture in a limited way, and the <strong>left and right mouse buttons</strong> similarly adjust your focus distance.</p>\r\nadditional controls\r\n<ul><li>The <strong>left face button</strong> (<strong>square</strong> or <strong>X</strong>) can be used in cockpit views to enable or disable the drift camera.</li><li>The <strong>tab</strong> key can be used to hide / unhide the heads up display on the TVs.</li></ul>\r\nFAQ (spoilers)\r\nHow do the blades work?\r\n<p>Each blade has a main thruster,  four 'fans' (ground effect propulsion devices), and multiple 'airbrakes' along the hull. It flies like what I  imagine an incredibly heavy FPV drone with a jet engine on the back  flies like. This means that there are a lot of nifty tricks you can pull  to gain speed around corners that don't apply in a car. For example, blades don't have much 'grip', so it's possible to preload reverse entries well ahead of time. You can use the ground to brake, or 'flare', or barrel roll around obstacles with stick flicks. Also, pilots can use the fan thrust along with angle of attack to gain extra speed -- as long as they don't bottom out and flip.</p><p>In <strong>AUTOGRAV</strong>, you will see pilots operating four controls: a flight stick (yaw, roll, and pitch), two pedals (brake and thrust), and a throttle lever ('fan' thrust).<br/></p>\r\nWhy do I see pilots launching flares?\r\n<p>All races span a full cycle around the loop. The road flares are used to mark the point at which the challenge was accepted, so the pilots know where the finish line is.</p>\r\nWhat causes pilots to be kicked off the loop?\r\n<p>If a racer runs out of cash, they can't fund their drive (fly?) anymore, so they head to the offramp to reconsider their life choices.<br/></p>\r\nWhy is &lt;some pilot&gt; always crashing into stuff?\r\n<p>The racers aren't equally skilled at avoiding obstacles / controlling their blade, and in addition, some don't care very much about upsetting traffic. You can check this sort of thing out in a pilot's stat tab.<br/></p>\r\nCan I drive a blade and race the other pilots myself?\r\n<p>Who can say? [see below]<br/></p>\r\n🐣 easter egg\r\n<p>If you have a controller plugged in, and you press the <strong>select</strong> (<strong>back</strong>) <strong>button</strong>, something very special and nondiegetic happens. Consider it a hidden feature. I'm leaving the controls as an exercise to the reader here.</p>\n<p>Yes, you can indeed challenge other pilots (just flash your beams) and set lap times, and get ranked on the elo board. Just don't tell anyone -- unless you set a record. I'm not sure what my best time is. Not great -- probably in the 1:40s. Let me know!<br/></p>", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2022-12-09T12:07:28", "background_image": "https://media.rawg.io/media/screenshots/dca/dca070116e5ba55382675b245eecb06c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["acgaudette"], "genres": ["Simulation", "Racing"], "publishers": [], "esrb_rating": null}