{"id": 892632, "slug": "team05-recycle", "name": "Team05-RE:Cycle", "name_original": "Team05-RE:Cycle", "description": "<p>In an environment troubled by global warming, where excess waste is released into the atmosphere and caused by the superprofits of multinationals, a young janitor has been granted a magical power. Armed with his vacuum cleaner, Vaku will be able to clean and sort waste while freeing cute creatures. Collect them all! <br/></p>\n<p><em>RE: Cycle</em> is a trash recycling game set in a universe inspired by Japanese and Belgian culture. A gameplay full of environmentally-friendly decisions and inspired by arcade games like \"Puzzle Bobble\", \"Candy Crush\", and more.</p>\n\n<p>Our protagonist, Vaku, is a young janitor working for a very big cleaning company. His days all look alike, nothing exciting ever happens. The more the days pass, the more waste he has to clean. People are becoming less and less careful with what they buy, and therefore, what they throw away as well. <br/>One day, Vaku decided he couldn't let things keep going this way. He grabbed his favorite vacuum cleaner, and suddenly, just before he could do anything, a miracle happened. He was granted a fantastical power! He could now not only clean dirt, but also sort and release some cute creatures locked up inside the trash.</p>\n\n\r\nGameplay\r\n<p>You have three elements to balance out : Fire, Earth, Water</p>\n<p>Sort out the garbage based on those elements to reach the needed balance for planet earth. Use the mouse to click on a tile and then click where you would want it to go in the 6 directions available to the hexagon tile.<br/></p>\n<p>When the timer reaches zero, if you manage to keep the progression bars close to the demanded area, you managed to save the planet! But if you were too low or too high, you couldn’t make the planet happy.</p>\n<p>In the meantime, some cute animals have been trapped in the trash! Help them out and collect them by sorting them out. But be careful, they will not help progress the progression bars!</p>\n\n<p>Keep vacuuming the right trash according to the progress bars ! <br/>Protect the cute animals and collect them !\r\n<br/>And most importantly, do not let planet earth suffer ! Controls</p>\n\n<p><em>RE: Cycle</em> was created in Unity.<br/><br/>This game was made for the <br/><br/>Belgian Economic Princess Mission to Japan<br/>Game Jam Belgium x Japan<br/>\n<br/> Game Jam Balance<br/></p>\n<p>All art, assets, animations were done during the 72h Jam.<br/></p>\n\r\nCredits\r\nGame Designers\r\n  \r\n<p>Ajnay Nadir<br/>Matsuo Honoka\r\n<br/></p>\r\nProgramming\r\n<p>Boutte Bastien<br/>Fujita Riku<br/>Mestdagh Louis\r\n   \r\n  </p>\r\nArt/Design\r\n<p>Acquasaliente Roy<br/>Joussot Leÿs<br/>Qin Yue<br/>Ueno Ayane   \r\n  </p>\r\nAudio\r\n  \r\n<p>Music by ZUKISUZUKI\r\n  </p>\n<p> \r\n  </p>\r\nThank you for playing our game!", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2022-12-09T12:47:24", "background_image": "https://media.rawg.io/media/screenshots/977/977c6f87e4c7167ecc61df5125c6b7fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kimynay", "Roy Acquasaliente", "nadiro"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}