{"id": 89266, "slug": "dmbx-2-mountain-bike-and-bmx", "name": "DMBX 2 - Mountain Bike and BMX", "name_original": "DMBX 2 - Mountain Bike and BMX", "description": "DMBX continues – featuring Mountain Bike and BMX action... completely new levels and characters... new and more bikes... time and trick challenges... completely new physics... easy trick-steering and much more! Please welcome the freshest Mountain Bike and BMX feeling for your iPhone, iPod touch and iPad!<br/><br/>DMBX 2 is a mix of downhill racing and trick challenges featuring 12 amazing &amp; unique bike trails with up to 36 challenges. The game is split in a QuickPlay mode and a Career mode. It`s your decision whether you just want to go for a quick ride or improve your skills and unlock new levels, characters, bikes and tricks.<br/><br/>Don`t worry if your last day on the bike is well in the past though – play the completely new tutorial to get a feeling for the gameplay and to learn the basics of this amazing game.<br/><br/>Let's go fast and show incredible tricks – that’s DMBX 2 Mountain Bike and BMX in short words!<br/><br/><br/>FEATURES<br/>- 3 worlds<br/>- 12 unique levels<br/>- up to 36 challenges<br/>- 8 individual male and female characters<br/>- 14 different BMX/bikes to choose from<br/>- individual trick setup<br/>- „career\" and „quick play\" modes<br/>- replay option<br/>- freestyle-training level<br/>- tutorial level<br/>- training mode<br/>- tilt- or virtual joystick navigation<br/>- listen to your own playlist<br/>- HD retina-display support for iPhone and the new iPad<br/>- iCloud synchronization<br/>- Game Center achievements &amp; leaderboards<br/>- english and german language<br/><br/><br/>VISIT US – randerline.com <br/>FOLLOW US – twitter.com/randerline  <br/>LIKE US – facebook.com/randerline  <br/>WATCH US – youtube.com/randerline<br/><br/><br/>*** Don't miss out on our brand new games DMBX 2.5 and DMBX 2.6 ***<br/><br/><br/>COMPATIBLE DEVICES<br/>DMBX 2 is compatible with 4th and 5th generation iPod touch, iPhone 4, iPhone 4S, iPhone 5, iPad 2, iPad 3rd generation, iPad 4th generation and iPad mini. <br/><br/><br/>IMPORTANT NOTICE<br/>If you experience any problems with the game or in case you have any questions or comments, please contact us directly - support(at)randerline.com. You may also contact us by visiting our website randerline.com. We will read and account for all reviews here, but we can only answer and help you via email. Thank you.", "metacritic": null, "released": "2012-08-09", "tba": false, "updated": "2019-10-22T14:20:03", "background_image": "https://media.rawg.io/media/screenshots/320/320231ab404b2fbaec6872de6d2c0073.jpg", "website": "http://www.rndrln-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 157, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["randerline"], "genres": ["Sports", "Racing"], "publishers": ["randerline"], "esrb_rating": "Everyone 10+"}