{"id": 892610, "slug": "building-tower-defences", "name": "Building Tower Defences", "name_original": "Building Tower Defences", "description": "<p>[PLEASE READ]<br/>This is a Tower defense Roguelike proof of concept I made roughly two years ago. The game is very rough and all textboxes are very janky due to Unity switching to TMPro texts. Some images are also very janky for similar reasons.  Some Stuff are very buggy, like the Fish bucket.<br/><br/>HOW TO PLAY<br/>You start the game with some red gems, money, and you use them to build towers that you re-use every wave. The towers can be placed and moved freely.<br/></p>\n<p>Every tower is comprised of a tower base, tower heads, and attachments. <br/></p>\n<p>Bases: These have stats they apply to all their heads and have a set amount of tower heads they can have equipped.<br/>Heads: These are the actual shooty bit. When in a wave you can select a tower and then select which head you want to see and change its targeting system from there.<br/>Attachments: These are passive buffs to turret heads, currently you can have an infinite amount of them. To equip them/buy them you must select it, then select the tower you own to equip it to, then select the tower head to have it apply to.<br/></p>\n<p>NAME IS PLACEHOLDER<br/>Realistically the whole game is placeholder and I intend to revisit the concept from a fresh start if I ever get a chance. This was a attempt I had years ago which was very rough and I just sort of took a pot shot at the idea, in order to make a proof of concept.</p>", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2022-12-09T12:36:32", "background_image": "https://media.rawg.io/media/screenshots/19b/19b68b5e5c18c44c44e7728ccd8e6016.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 1, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["Amazingness"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}