{"id": 892791, "slug": "downcave-foxdancemedia", "name": "DownCave (FoxdanceMedia)", "name_original": "DownCave (FoxdanceMedia)", "description": "<p>For fans of narrative-rich and suspenseful horror games like Amnesia or SCP: Containment Breach.<br/></p>\n<p>A cave exploration horror game where you have a flashlight that only lasts 30 seconds at a time. You need to turn it off to recharge it, but then you can't see what's in front of you...</p>\n<p>I made this game in 2 days as a personal challenge. My goal was to appeal to fans of subtle, psychological horror, with a gradual buildup of heavy atmospheric tension and a very strong narrative, inspired by my own experiences with isolation and mental illness, that slowly unveils itself over time and has an unexpected twist.</p>\n<p>The game is about an hour long. Please be careful as you only have one life and there are no checkpoints. You are meant to play through the game in one sitting. It is recommended you play in a dark room with headphones on and the volume turned up.</p>\n<p>It's called DownCave because you go down a cave.</p>\n<p><strong>CONTENT WARNING:</strong></p>\n<p>Maybe don't play this if you have a very strong reaction to claustrophobia, spiders, darkness, or caves in general. Please be careful if you're sensitive to light because you will be turning a flashlight on and off frequently.</p>\n<p><strong>INSTRUCTIONS:</strong></p>\n<p>WASD + Mouse to move.</p>\n<p>CTRL to crouch.</p>\n<p>E to interact.</p>\n<p>F for flashlight.</p>\n<p>ESC to exit the game.</p>\n<p>SPACEBAR to struggle.</p>\n<p>You can survive any fall where you can see the bottom with your flashlight.</p>", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2022-12-09T13:52:08", "background_image": "https://media.rawg.io/media/screenshots/4ad/4adc52a571824a90520cc89d7237deaa.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 52, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["FoxdanceMedia"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}