{"id": 89272, "slug": "my-virtual-girlfriend", "name": "My Virtual Girlfriend", "name_original": "My Virtual Girlfriend", "description": "My Virtual Girlfriend is the #1 dating simulation game in the world- there is no other game like it!<br/>Featured on MSNBC, Kotaku, Discover and Lopez Tonight! <br/><br/>===== APP REVIEWS!=====<br/>appdictions.com = 5/5 <br/>alphadigits.com = 9/10 <br/>Editor Picked by Best10Apps.com! <br/>=======================<br/><br/>D E S C R I P T I O N:<br/>My Virtual Girlfriend is a fun and flirty dating sim like no other. You choose your date then flirt and romance your way into her virtual heart until she falls madly in love with you. There are thousands of beautiful girls to choose from, all with unique personalities and appearance, so you are sure to find a partner to date that appeals to you.<br/><br/>What can i do with her?<br/>Once you hookup with your new date, you can flirt up a conversation or go on activities like mini golf, listen to her corny and sometimes funny jokes. Offer her gifts like a new bikini or lingerie, she will even wear it for you.  She even responds to your touch, just be careful about where you are poking your fingers around, she can get very upset. <br/> <br/>Every choice you make will have rewards or consequences as you try to earn points with her. Its best to find things that cater to that girls unique personality. As you progress with your virtual girlfriend on this wild date, she will grow to like you more and more. With each new level achieved, it will open up new ways of interacting with her, unlock crazy, fun or hot outfits and all kinds of activities that adults do- like watching Netflix and chill, or dinner date night! There are 35+ levels in the game, once you reach the end level, you've won her heart! <br/><br/>Do the right things and she’s yours forever, but make the wrong moves and this single sim will show you the door, where you will remain alone until you start a new game. So don’t be part of the lonely hearts club, you’ve got to win this VR girl over!<br/><br/><br/>Features:<br/>► 1000's of beautiful girls to choose from<br/>►  Several ways to interact- through conversation, actions, activities and touch<br/>►  Girls may also be customized to your liking through the Custom girlfriend editor. Change her face, hair, skin, clothes, bobble heads, body proportions, and more.<br/>► 35+ levels of progressive game play<br/>► Vampire and Zombie girlfriends<br/>► Simulated personalities that can mimic funny female types<br/>► Adult dating simulation of the virtual fun kind<br/>► Achievements and rewards <br/>► Special outfits - bikinis, hot swimwear, lingerie, and more!<br/>► Not just for Otakus, or the desperate single - This here is for everybody! <br/><br/>It's all about flirting, love, dating and romance.  Love is in the air and with this many cute females in one place, It's like being on a Virtual spring break in Cancun! <br/><br/>Why are you still reading?  This is the cheapest date you’ve ever had, and here is your chance to get some practice in and level up your dating game!  No one likes being forever alone, so put a virtual girlfriend in your pocket today.<br/><br/>Youtube trailer: <br/>http://www.youtube.com/watch?v=71ibW3ibkOI", "metacritic": null, "released": "2010-05-12", "tba": false, "updated": "2019-08-02T06:10:15", "background_image": "https://media.rawg.io/media/screenshots/a06/a063c46e449a6135a160f02b42411e25.jpg", "website": "http://www.myvirtualgirlfriendgame.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Wet Productions"], "genres": ["RPG", "Simulation"], "publishers": ["WET Productions"], "esrb_rating": null}