{"id": 892945, "slug": "arcadie-second-born", "name": "Arcadie: Second-Born", "name_original": "Arcadie: Second-Born", "description": "<strong>Centuries of war define the Kingdom of Arcadie. Will you allow them to define you?</strong><br/><br/>You are the second-born, second-in-line to the throne. As Arcadie is set to sign a peace treaty with your age-old enemies, you are put in charge of any future dealings with them.<br/><br/>Today will see you taking the first step towards a new destiny, and perhaps a new future for your Kingdom. Will you put the Realm's interests before your own, or will you precipitate it down the path of another century of war?<h3>Create your character</h3>Male or female; gay, straight, or bisexual. Define your personality through your choices and actions. Will you be friendly and conciliatory, a wisecracking charmer, or will you antagonize anyone who would dare approach you? Specialize in Swordsmanship or in Statecraft. Learn about the mystical power wielded by your ancestors, and perhaps even tame it for yourself.<h3>Know your companions</h3>Interact with a vivid cast of characters, each with their own goals and motivations. Gain their support, their friendship or even their love. Experience naturally-evolving romance; steamy, sweet, passionate, or even thoroughly ill-advised. Your relationships will change the story, in small and bigger ways.<h3>Control the story</h3>Enjoy the freedom to save and load your progress, and to change your choices should you desire. Reach a different ending depending on your decisions. Will you strive for peace, or demand blood be spilt?", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2022-12-12T03:38:19", "background_image": "https://media.rawg.io/media/screenshots/365/365250bb9ebf0af960043e58630b9467.jpg", "website": "https://sofia-d-asb.tumblr.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 5, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 60, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Arcadie & Utopie"], "genres": ["RPG", "Indie"], "publishers": ["Arcadie & Utopie"], "esrb_rating": null}