{"id": 892931, "slug": "sue-shi-survival", "name": "Sue Shi Survival", "name_original": "Sue Shi Survival", "description": "<strong>Defend your sushi shop at any cost.</strong><h3>Gameplay</h3>Descend floors 5 minutes at a time until you come face-to-face with the final boss. Choose your weapon and character from a wide cast of unique options and dive into Standard or Blitz mode. Slay enemies to level up and pick abilities from a randomized pool, each run resulting in unique synergies. Earn scales from your runs and use them to unlock weapons, soundtracks, and runes to customize the way you play.<br/><br/><br/><h3>Features</h3><ul><li>Blitz Mode where everything is sped up for ~10-minute runs<br/></li><li>Torment levels and a Curse system to customize your difficulty<br/></li><li>85+ abilities that make every run feel different<br/></li><li>15+ unlockable weapons each with unique traits<br/></li><li>Rune system that gives permanent buffs<br/></li><li>9 distinct characters all with unique passives and abilities<br/></li><li>And much more planned</li></ul><br/><h3>Story</h3>As a sushi chef, you're responsible for the death of many sea creatures. One day, after decapitating a fish, a demon emerged - summoning the spirits of all the other dead creatures with it. The food is finally fighting back... from beyond the grave. You and the cast of other characters are here to exterminate the lethal ghosts and restore peace to the restaurant.<br/><br/><br/><br/>", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2022-12-12T03:21:49", "background_image": "https://media.rawg.io/media/screenshots/c94/c94667c1bdc2d6a1cccda162060b435f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Clock Out Games"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Clock Out Games"], "esrb_rating": null}