{"id": 892965, "slug": "knocking-up-my-nympho-neighbors", "name": "Knocking Up my Nympho Neighbors", "name_original": "Knocking Up my Nympho Neighbors", "description": "<p>Your grandparents ran a dormitory for working women and somehow you, a young virile man, were selected to take care of the place when your grandparents were eventually unable to.<br />\nIt&#39;s time to get to know the neighbors... really get to know them! There is Saori, a teacher who gives off a refined professional vibe. Kaya is a doctor who acts rather mischievous, especially with how handsy she gets during her &quot;examinations&quot; of you. Satomi is in charge of everyone&#39;s meals, being a food coordinator herself, she possesses unmatched motherly energy. Finally, there is Kaoru, a personal trainer who is a quintessential tomboy, who you&#39;ll often see flashing her toned body in her skin tight exercise gear.<br />\nEach of these fine ladies are hoping to kick back after their 9-to-5 grind, and you&#39;ll be there to help them de-stress! Forget cleaning and housekeeping duties, your top priority is keeping these ladies well fucked after a long day&#39;s work!<br />\nTranslated version of the original Japanese Visual Novel<br />\nAll the female dorm occupants are fully voiced with original Japanese dialogue<br />\nOriginal artwork HD upscaled with 16:9 and 4:3 variants<br />\nHours of story content<br />\nAudio including music and special effects<br />\nEnhanced with character sprite animations<br />\nGallery and Scene selections<br />\nA Scene Studio to view all the beautifully drawn sprites and backgrounds<br />\n17 sexy scenes spent with your naughty neighbors to enjoy~<br />\nKnocking Up my Nympho Neighbors is the English localization of a Visual Novel originally created by prolific Japanese developer Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan.<br />\n<strong> PLEASE NOTE </strong><br />\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.</p>", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2022-12-19T10:08:22", "background_image": "https://media.rawg.io/media/games/a02/a02483e75e6580fce5decaabee0c93eb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 5, "toplay": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 388, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["miel"], "genres": ["Casual"], "publishers": ["Cherry Kiss Games"], "esrb_rating": null}