{"id": 892956, "slug": "resist-4", "name": "Resist", "name_original": "Resist", "description": "A dystopian future. An authoritarian regime. A tale of violence, intrigue, and hope. Swing from towering skyscrapers and battle deadly enemies as you fight to free your city from the evil that consumes it. Will you bow to the forces of oppression? Or will you have the strength to Resist?<br/><br/>A single-player action RPG designed exclusively for VR, the critically acclaimed Resist has finally made its way to Steam, with overhauled graphics and gameplay tweaks designed to take full advantage of the power of the PC. With a kinetic swinging system, intense combat, and a fully immersive story, Resist is the VR experience you’ve been waiting for.<br/><br/><h3>Open world</h3>Swing through the streets and climb to dazzling heights as you explore the city of Concord and uncover its secrets<h3>Rich story campaign</h3>Join Sam Finch, the newest member of the Resistance, as she fights to free her city from the grip of the sinister Astra Corporation<h3>Dozens of side quests</h3>Pillage data facilities, capture surveillance drones, and fight enemy hordes as you aid the colourful characters of the Resistance<h3>Tactile puzzles</h3>Hotwire Astra propaganda billboards to increase your reputation and win the public to your side<h3>Deep skill tree</h3>Level up and enhance your weapons and core abilities, or unlock powerful new ones, like grapple boost, scan pulse, and super jump<h3>Enhanced for PC</h3>A full graphical overhaul with improved shaders and lighting, all new post-processing and FX, and enhanced textures and models means the game looks and plays better than ever before<h3>Online leaderboards</h3>Compete in Crypto’s skill challenges and prove your swing prowess to your friends, or to the entire world", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2023-02-13T16:08:51", "background_image": "https://media.rawg.io/media/screenshots/b15/b1573c438983032ced59c755bc1add1a.jpg", "website": "https://thebinarymill.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 1, "achievements_count": 31, "ratings_count": 2, "suggestions_count": 365, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["The Binary Mill"], "genres": ["Action", "Adventure"], "publishers": ["The Binary Mill"], "esrb_rating": null}