{"id": 8931, "slug": "awesome-memory", "name": "Awesome Memory", "name_original": "Awesome Memory", "description": "Enjoy absolutely the BEST memory GAME with your family and friends! With ELEVEN beautiful card sets and up to FOUR player matches, it&amp;#39;s truly awesome!<br/><br/>★ Stunning visuals surpassing ANY other game of the genre<br/>★ FREE &amp;#39;Fruitmania&amp;#39; card set (Previously only available as an in app purchase!)<br/>★ TEN finely crafted card sets available as In App Purchases (Check out newly added &amp;quot;Monster&amp;#39;s Memory&amp;quot; card set!)<br/>★ Up to FOUR players multiplayer on the same device<br/>★ AI available for purchase. Challenge computer-controlled opponents!<br/>★ Up to FIVE board sizes for adjustable difficulty<br/>★ TWO game modes - &amp;quot;Standard&amp;quot; and &amp;quot;One Flip&amp;quot;<br/>★ HIGH SCORES for single player mode<br/>★ A PACK with SEVEN card sets available with a 70% discount<br/>★ TWO SMALLER PACKS at low prices.<br/>★ iOS 5 support<br/><br/>&amp;quot;Awesome Memory&amp;quot; is a card game in which all of the cards are laid face down on a surface and players take turns flipping two cards face up. The object of the game is to reveal pairs of matching cards. The game can be enjoyed by up to four players at a time on one device or on your own.<br/><br/>With eleven beautifully illustrated card sets (Monster&amp;#39;s Memory, ABC Animals, Caribbean Pirates, Turtles, Ancient Egypt, Doodle Space, Butterflies, Fruitmania, Parrots, Stars and Stripes and Back in the USSR) available either for FREE or as In App Purchases &amp;quot;Awesome Memory Pro&amp;quot; provides much more variety than ANY of the competing titles.<br/>Top notch graphics, sounds and effects, exceeding anything in the genre, add up to many hours of fun filled entertainment.<br/><br/>&amp;quot;Awesome Memory Pro&amp;quot; is very easy to learn and both children and adults love it! This game can gather your whole family at the table and provide many hours of shared fun. Or if you have friends coming to the party, &amp;quot;Awesome Memory Pro&amp;quot; will surely become the center of attention, and you&amp;#39;ll spend a lot of time competing with each other. It won&amp;#39;t be surprising if in the morning when the party ends you&amp;#39;ll find yourself trying to beat your own high-score in the single player mode or challenging computer-controlled opponents.<br/><br/>If you want even more &amp;quot;Awesome Memory&amp;quot;, consider upgrading to &amp;quot;Awesome Memory Pro&amp;quot; and get all future card sets (like awesome &amp;quot;Monster&amp;#39;s Memory&amp;quot; added in the latest update), game modes and other extensions for free! Upgrading to &amp;quot;Awesome Memory Pro&amp;quot; saves you almost 85%!", "metacritic": null, "released": "2010-08-27", "tba": false, "updated": "2019-10-22T14:30:11", "background_image": "https://media.rawg.io/media/screenshots/6a7/6a7785d0930ea6809889ec521a37d7c7.jpeg", "website": "http://tangiblegames.com/awesomememory", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 200, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Tangible Games"], "genres": ["Board Games", "Family"], "publishers": ["Nikita Ptashnik"], "esrb_rating": "Everyone 10+"}