{"id": 893238, "slug": "crypsis-demo", "name": "Crypsis Demo", "name_original": "Crypsis Demo", "description": "<strong>\"There are things humans are not meant to know. Not meant to see.\"</strong>\n<p>Do you have a hankering for perusing the unknown? Do you think vast horrors beyond your comprehension are actually pretty comprehensible? Would you smooch a moth?</p>\n<p>Then this game is the cryptid dating simulator for you! Browse a wide selection of available monsters and..\r\n</p>\n<p>…\r\n</p>\n<p>Sorry. Typo. This is actually a cryptid <em>hating</em> simulator. Become entranced by a wide selection of unavailable monsters who aren’t particularly fond of you in the slightest.  Toe the line of fascination and abject horror  as you bore them with your scientific rambling. Get flamed by catgirls. Realize that at the end of the day, you are not the center of these creatures’ existence.\r\n</p>\n<p>Because this game is not for <em>you.</em></p>\n\n<p><strong>Crypsis</strong> is a solo-dev psychological horror visual novel where you play the role of a curious cryptozoologist. All your life you have searched for proof of the supernatural. As soon as you find it, you realize the truth is much harsher than you could have ever bargained for.\r\n</p>\n\r\nWARNING:\r\n<p><em>This demo contains strong language, blood, violence, death, religious imagery, themes of derealization, dissociation and questioning reality. Viewer discretion is advised. This demo is not recommended for individuals under 16 years of age.  </em></p>\n\r\nFEATURES:\r\n<ul><li>~24k words</li><li>1-2 estimated hours of gameplay</li><li>2(?) endings</li><li>7 meetable characters</li><li>5 CGs</li><li>probably no bugs. maybe? possibly?</li><li>catgirls</li></ul>\n\n<p><em>ppst. this demo is free but any donations help me get the full game out faster!</em><br/></p>", "metacritic": null, "released": "2022-12-11", "tba": false, "updated": "2022-12-12T06:04:58", "background_image": "https://media.rawg.io/media/screenshots/98c/98cd594123532fdc3b6ac9f4e39b5944.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["lyseeridge"], "genres": [], "publishers": [], "esrb_rating": null}