{"id": 893509, "slug": "xixi-imperial-seal", "name": "Xi玺 - Imperial Seal", "name_original": "Xi玺 - Imperial Seal", "description": "<p><em>Xi</em>, or the<em> Imperial Seal, </em>is an RPG interactive story made by Twine. <em>Xi </em>is based on the macro worldview of the Three Kingdoms, revealing a hidden history of the theft of the imperial seal. Inspired by <em>The Wind Blows from Longxi</em>, a 2022 aired ancient spy thriller, <em>Xi</em> outstands itself with a detailed, microscopic incident compared to the majority of Three Kingdoms-themed media which focuses on massive wars and state-level power struggles. <br/></p>\n<p>The protagonist of the game, Xun Mei, is a gentry who originated from the Xun family in Yingchuan city. Like most people in his family, Mei is against Cao Pi’s enthronement to the emperor. Unlike his father, Cao Pi, the son of the legendary Wei King Cao Cao, always wanted to take a step further to become the emperor of China. Once Pi becomes the emperor, there will be more wars and the whole country will fall into more significant chaos. Xun Mei was assigned the mission by his family to steal the imperial seal from the king’s palace – to make the enthronement unorthodox and more courtiers against the enthronement. In June, 220 AC, Xun Mei starts his preparations for the mission, and the dangerous, intricate story begins.\r\n</p>\n<p>As a Chinese student studying in the USA who majors in design, I always would like to demonstrate Chinese culture and aesthetics to my foreign peer. The interactive story project could also be a great medium to achieve my goal. For <em>Xi,</em> selecting the background of Three Kingdoms would be a really suitable cut point since Three Kingdoms’ theme is one of the most well-known Chinese histories in western countries. There is no need to explain really much about the general background and would be easier for players to dive into the story. Moreover, Three Kingdoms has a really intriguing worldview of three separate kingdoms fighting each other where the art of war and Confucianism collide, it's a perfect choice to make derivative work.  \r\n</p>\n<p>The game <em>Xi </em>has 119 notes, more than 9 endings, and 8 different variables. Primary variables include Athletics, Stealth, Determination, Scheme, and Greedy, which could be gained mostly from establishing choices, and influencing possible testing choices; Secondary variables include the king’s alertness, Xun Mei’s reliability inside the family, and of course Money. Secondary variables could be gained From objective choices and will be influencing the mission progress &amp; probable endings. Starting from June, the players will encounter different dilemmas all the way to October, when the mission officially begins. Players will face pressure from the kingdom and the family, from the trade-off between individual gain and family prosperity, and from internal monologues of morality. The “surprise” in each stage of the game will also bring enough uncertainty and excitement to players. The choice basically includes every type: Establishing Choice, Fake Choice, Expressive Choice, Objective Choice, Moral Choice, Fork Choice, Motivated Forking Choice, Testing Choice, Variable-Difficulty Testing Choice, and Objective Testing Choices, making the game rich in in-game experiences.\r\n</p>\n<p>Now, let’s start your adventurous journey in this fascinating Three Kingdoms world!\\</p>", "metacritic": null, "released": "2022-12-11", "tba": false, "updated": "2022-12-12T07:48:09", "background_image": "https://media.rawg.io/media/screenshots/5f3/5f329230ca302892327575272b6c8bbb.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["BrooklynKai"], "genres": ["RPG", "Strategy"], "publishers": [], "esrb_rating": null}