{"id": 893538, "slug": "aika-monogatari", "name": "Aika Monogatari", "name_original": "Aika Monogatari", "description": "<p><strong><em>A love story between two worlds</em></strong></p>\n<p>Aika Monogatari tells the story of two people from different worlds who will meet thanks to a strange musical instrument.</p>\r\n\r\nThe Story\r\n<p>It all begins with Amatore of Castelencia, a writer for the city newspaper. He gets tired of the daily routine and desires for something to change, for his creativity and emotions are in decline in a world of automation and money. Walking in the street, he founds a strange musical instrument, never seen before. He picks it and in his home, he tries to play, and notices that whatever he plays, it creates something in the air, like magic, sometimes images, sometimes, something else. At a point, while playing, a portal is opened, and Amatore can see that there is a city in the other side. He crosses the portal, and appears in Shimumara, a very different city from his own. In there, he will be in contact with a woman called Suki, and this is the beginning of their story.\r\n</p>\r\nThree Chapters\r\n<p>The game is divided in three chapters, that tell the same story but from the point of view of different characters. Each chapter is divided in five acts.</p>\n<p>The first chapter is the story of Amatore. He lives in Castelencia and works as writer in the newspaper. He will find the strange musical instrument, and he will end traveling to Shimumara.\r\n </p>\n<p>The second chapter is the story of Suki. She lives in Shimumara and works as painter. She will meet an unknown old man called Kan in the theatre, and later, she will meet Amatore when he appears.\r\n </p>\n<p>The third chapter is the story of Kan and Vu, the old man and the fox, who play a major role in the overall story.\r\n </p>\n<p>It is intended to play these chapters in this order, but they can be played at any.\r\n</p>\n<p>Play Aika Monogatari in your browser here!<br/></p>\n\n\n\n\n\n\n\n\r\nCredits\r\n<p>MogHunter, Avery, Grandmadeb, Whtdragon, Suzy</p>\n<p>Erhu icon by LovePik</p>\n<p>Special thanks to MogHunter for</p>\n<p>many of the beautiful plugins used!</p>\n<p>Special thanks to Suzy for doing the</p>\n<p>artwork edits for the characters!</p>\n<p>Sound effects from freesound.org</p>\n<p>Kevp888, Kyles, Klankbeeld, Viertelnachvier, Rutgermuller,</p>\n<p>L-flick, Garuda1982, Walking with microphones, Perplessio.</p>\n<p>Game developed by Anamura</p>\r\nGet the Soundtrack", "metacritic": null, "released": "2022-12-10", "tba": false, "updated": "2022-12-12T07:59:42", "background_image": "https://media.rawg.io/media/screenshots/b29/b29aa6a39e22fc0509b11c338bb9410a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 325, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Anamura"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}