{"id": 893656, "slug": "firmament-boonbane", "name": "Firmament (boon/bane)", "name_original": "Firmament (boon/bane)", "description": "<p><strong>The Overview<br/></strong></p>\n<p><strong>Firmament is a dark science-fiction visual novel / RPG hybrid</strong>. You play as the Domebound, a cryogenic revival thrust into a society inside a perfectly self-sustaining nanotechnological terrarium.  You'll build a character, and use your stats to notice and manipulate the world around you. A more detailed description is below.<br/></p>\n<p>If you like: Disco Elysium, Philip K. Dick, Neal Stephenson, or Mass Effect, then you'll like Firmament.</p>\n<p><strong>This is only a demo! </strong>The demo is two to three hours long, and saved progress will carry over into the final release. If you'd like to join the community (to talk about the game, to give feedback for the full game, or to hang out with a community of game developers), then join the Discord: https://discord.gg/uAUHBmGz7p</p>\n\n<p><strong>The Scenario</strong></p>\n<p>Scenario: In a quasi-distant future where mankind has the ability to  atomically bend the physical world to its will, it has an Idea. The idea  is to collect a seed of genetic material, and send it out on some  spaceship-cum-terrarium to probe space for a suitable place to dig in  and start a colony. Procreation. Fundamental.\r\n  </p>\n<p><strong>The Twist</strong>\n</p>\n<p>Instead of searching for habitable worlds, humanity produces a  perfectly hermetic enclosure to host its germed society. Also in the  tradition of science fiction, it’s a sweet ass Dome. All matter needed  to sustain human life is present in the correct quantities, and no  matter ever exists or escapes the Dome. Through the magic of  nanotechnology, everything is perfectly recycled from food into shit  into clothing into capacitors, into anything and everything else, ad  infinitum. Such a system is unfathomably complicated, and the Dome  itself is an immense computer used to coordinate <em>everything</em> inside.\r\n  </p>\n<p><strong>The Problem</strong>\n</p>\n<p>The enclosure is built to self-repair, to some extent, but any  system which relies on dead reckoning will suffer from drift. To solve  this, humanity shipped the Dome with a monstrous Manual, which covers  any troubleshooting or manual repair in extreme and specific detail. And  since, by far, the most likely thing to break this society once formed  is the people within, it contains a great mass of Confucian-esque  wisdom, societal rules, filial responsibilities, and traditions.\r\n  </p>\n<p><strong>And, at long last, the Pitch</strong>\n</p>\n<p>The progress of man is inevitable. Or: Life finds a way. Eons pass in  this society, innocent and pastoral, provided for by an inexhaustable  garden. Things are good, until they become bad. A religious sect,  concerned with different forms of transcendence from and integration  with base reality, begins to grow more intense. Another sect,  traditionally in charge of maintenance of the nanotechnological  machinery, discovers methods to fool the Dome into producing arbitrary  goods. And through it all, the staunchly classic maintainers claim that  these deviations from the Manual will destroy us all.\r\n  </p>\n<p>Enter you, Domebound. On a strict timer, fresh genetic material from  the cache is reconstituted and released into society. Quite conveniently  for myself, the author, you are one such person, and your birth  coincides with a inflection point in the persistence of your species.  Your task, if it can be so called, is to weave through this  magnificently complicated society and find the off switch before it  implodes upon itself.\r\n</p>", "metacritic": null, "released": "2022-12-10", "tba": false, "updated": "2022-12-12T08:48:12", "background_image": "https://media.rawg.io/media/screenshots/787/787a0e66341e8e8a79659fa641dd5e1f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["boon/bane"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}