{"id": 893773, "slug": "fleet-eapple", "name": "FLEET (Eapple)", "name_original": "FLEET (Eapple)", "description": "FLEET \r\n<p>is a singleplayer .io-style game where you battle with 100 bots on the open sea with over 20+ unique warships.</p>\n<p>Start from a humble Dinghy with only the most meager firepower, then upgrade and pick a path to become the most powerful ship in the game.</p>\n\r\nFIREPOWER\r\n<p>There are 3 weapons systems in the game:</p>\r\nGuns\r\n<p>Explosive shells fired from guns, big or small, can be shot with great speed over a long distance. However, it comes at the cost of accuracy and damage, as it may take many salvos to land enough hits to sink the enemy.</p>\n\r\nTorpedoes\r\n<p>Packing a huge punch in one blow, torpedoes are a silent but deadly payload. Traveling slowly, torpedoes require greater attention to aim and positioning than guns, but can be extremely rewarding when they land a hit.</p>\n\r\nBombers\r\n<p>While this is a game focused on warships, planes act as the most unique weapons systems staying exclusively in the sky. Planes can be launched from carriers and commanded to attack a ship, at which point they are completely automatically controlled.</p>\n\r\nEnding Statements\r\n<p>This project took 62 hours over 14 days to complete, making it one of the largest games I've built. Over 100+ sprites, images, and icons were created with Adobe Illustrator to deliver simple but readable vector graphic art.</p>\n<p>This has been a dream project of mine, as I love naval-themed combat games. This is my second-ever browser game, and I've spent my best effort to make it run relatively smoothly on most devices.</p>\n<br/>", "metacritic": null, "released": "2022-12-10", "tba": false, "updated": "2022-12-12T09:37:55", "background_image": "https://media.rawg.io/media/screenshots/12f/12f09c214ddb6b5fc2907ea4991d7a87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 83, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Eapple"], "genres": ["Action"], "publishers": [], "esrb_rating": null}