{"id": 893762, "slug": "all-out-of-flies", "name": "All out of Flies", "name_original": "All out of Flies", "description": "<p><em>All Out of Flies</em> is a 3D arcade-style run-and-gun game. The Player's goal is to achieve the highest score possible. Score is given for a variety of reasons, but the most common is simply killing enemies. </p>\n<p>The environment is split into 3 different 'zones', each with different elements available at any given time. As you kill enemies within the zone, that zone will become tougher, so when having a tough time, it may be in your best interest to head into a zone you've spent less time in!</p>\n<p>Completing a 'level' means killing a certain amount of enemies within that zone. Doing so will spawn a fellow frog comrade somewhere in that zone for you to collect. Doing so will attach him to you, where he will stay while helping you defeat enemies.</p>\n<p>If you so choose, you may also extract this frog for a hefty lump sum of score.</p>\n<p>The Player can walk, run, or grapple their way around the environment. Equipped with a <em>very</em> big gun, they’re free to shoot any soldiers who stand in their way, in fact, we <em>highly</em> encourage it!<br/></p>\n<p>Along the way to getting that high score, challenges that provide powerups upon completion will pop up.</p>\n<p>Experiment with grappling various different things, especially grappling <em>things</em> into other <em>things.</em></p>\n\n<p>I beg of you, if it's your first time playing, please play with the tutorial enabled! There's a lot happening and you'll most likely be so beyond confused if you jump right into it.</p>\n\n<p><strong>Controls can be seen in game from the main menu!</strong></p>\n\n<p><strong>Information:</strong></p>\n<p>This is a game that was made as a course project throughout the first term of the BCIT BTech program. It was made in collaboration with a total of 4 other lovely team members.</p>\n<p>Mo Baydoun - mbaydoun@my.bcit.ca\r\n</p>\n<p>Max Korchagov - mkorchagov@my.bcit.ca\r\n</p>\n<p>Kevin Baumann - kbaumann@my.bcit.ca\r\n</p>\n<p>Gurjot Mander - gmander@my.bcit.ca\r\n</p>", "metacritic": null, "released": "2022-12-10", "tba": false, "updated": "2022-12-12T09:32:43", "background_image": "https://media.rawg.io/media/screenshots/da1/da1effe1538a31fc046ee78347393b66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 27, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mark Keeble"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}