{"id": 893820, "slug": "bottoms-up-beta", "name": "Bottoms Up! - BETA", "name_original": "Bottoms Up! - BETA", "description": "<em>                                                              <br/></em>\n<em>If you were to ask any of Artheleron Hudin`s fellow villagers, you would surely hear them say that he “looks before he leaps”. After all he did have his entire veteran pension and he lived in a nice little place in a tidy little house, which didn`t even belong to him to begin with. Not only that but he still had hair where it mattered most.</em>\n<em>Truth be told, apart from all these blessings Hudin also enjoyed as much alcohol as he liked and even managed to keep on running a secret trade with an old friend of his. And had no intention of dying soon, since he was immortal.\r\n</em>\n<em>But it wasn’t all roses to him. The shack he was given on a flexible term because of his previous military service was in a dire need of renovation. Additionally, due to the essence of his immortality, he no longer lived to drink and rather drank to live. Not to mention that things go sideways when his business partner is accused of murder. Hudin is now forced by the local authorities to find his friend and deal with him. An that, to put it mildly, is how he is dragged out of retirement…</em>\n<p>______________________________________________________________________________________</p>\n<p>                                    </p>\n<br/>\n<p>______________________________________________________________________________________</p>\n<p><strong>Bottoms Up! is a linear visual novel that only tries to tell a good story in a compelling way.\r\n</strong></p>\n<p><strong>The game is in BETA at the moment. It is around 90% done except some missing sounds effects that are coming soon. Other than that the story/content of this PART 1 is complete.\r\n</strong></p>\n<p><strong>Thanks for playing and I really hope you enjoy it ! :</strong><em><strong>)</strong></em></p>\n<p>______________________________________________________________________________________</p>\n<p><strong>You can check some of the original soundtrack here:</strong></p>\n\n<p>I will be uploading some more songs from the game soon!<br/><br/></p>", "metacritic": null, "released": "2022-12-05", "tba": false, "updated": "2022-12-12T09:56:28", "background_image": "https://media.rawg.io/media/screenshots/51d/51dfc3fda8df0f256defbe83a70f6191.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 205, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["inspiredbynoobs"], "genres": [], "publishers": [], "esrb_rating": null}