{"id": 89411, "slug": "rundaline-free-featuring-the-most-athletic-skunk-o", "name": "RunDaLine FREE - featuring the most athletic skunk on earth", "name_original": "RunDaLine FREE - featuring the most athletic skunk on earth", "description": "Pancho is probably the most athletic skunk on earth, but navigating is definitely not his thing - luckily you can move &amp; control the terrain to keep his runs and jumps under control. Help him earn as many coins as possible, but watch out for the obstacles along the way which will take away all of your coins, boost your speed or finish your run abruptly.<br/><br/>With just \"one touch\" you control the terrain where Pancho is running and help him earn the number of coins needed to unlock the next level. You can double your score by jumping through multiplication clouds or get indestructible for some time by hitting the protective bubbles. But beware of all bombs, flashes, walls and thundery clouds as they are your enemies and will try to break up the flow of your run.<br/><br/><br/>HIGHLIGHTS<br/>- new and unique jump&amp;run control method<br/>- simple \"one touch\" navigation<br/>- easy start-levels<br/>- more &amp; more challenging as levels progress<br/><br/><br/>FREE VERSION - FEATURES <br/>- 10 game levels<br/>- retina-display optimized graphics<br/>- in-game help<br/><br/><br/>FULL VERSION - FEATURES<br/>- 50 game levels<br/>- 5 color worlds<br/>- retina-display optimized graphics<br/>- in-game help<br/>- game center achievements &amp; leaderboards<br/><br/><br/>VISIT US – randerline.com<br/>FOLLOW US – twitter.com/randerline<br/>LIKE US – facebook.com/randerline<br/>WATCH US – youtube.com/randerline<br/><br/><br/>COMPATIBLE DEVICES<br/>RunDaLine is compatible with 3rd (32GB &amp; 64GB) and 4th generation iPod touch, iPhone 3GS, iPhone 4, iPad and iPad 2.<br/><br/><br/>IMPORTANT NOTICE<br/>If you experience any problems with the game or in case you have any questions or comments, please contact us directly - support(at)randerline.com. You may also contact us by visiting our website randerline.com. We will read and account for all reviews here, but we can only answer and help you via email. Thank you.", "metacritic": null, "released": "2011-11-03", "tba": false, "updated": "2019-07-30T15:32:38", "background_image": "https://media.rawg.io/media/screenshots/da1/da11658622e80ab4ab83320060a697cf.jpg", "website": "http://www.randerline.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["randerline"], "genres": ["Action"], "publishers": ["randerline"], "esrb_rating": null}