{"id": 894168, "slug": "unscripted-undergrad-studios", "name": "Unscripted - Undergrad Studios", "name_original": "Unscripted - Undergrad Studios", "description": "<p>Dive into the world of a wannabe writer and his friends trying to make it in Hollywood. Build deep friendships, go on hilarious adventures and fall in love. Make highly impactful choices and shape your story in one of the most ambitious visual novels ever created.</p>\n<p>ABOUT THIS GAME<br />\nDive into the world of a wannabe writer and his friends trying to make it in Hollywood. Build deep friendships, go on hilarious adventures and fall in love. Make highly impactful choices and shape your story in one of the most ambitious visual novels ever created.</p>\n<p>A BINGEABLE PLOT<br />\nBecoming a famous screenwriter has always been your childhood dream, but after a year in LA, you’re unsure if you have what it takes. Embark on an unforgettable journey into the hilarious and absurd life of a 24 year old and his friends as you juggle romance, friendships and being broke.</p>\n<p>AUTHENTIC RELATIONSHIPS<br />\nPlunge into an authentic and exciting social life, filled with friends, coworkers and roommates. Experience dating in its entirety as you navigate intricately branching relationships with five unique romanceable characters. (Four female, one male.)</p>\n<p>PLAY YOUR WAY</p>\n<p>Shape your story through countless choices in a deeply interconnected world. Be a loving friend, a relentless flirt, or a complete douche, the choice is yours.</p>\n<p>STUNNING VISUALS</p>\n<p>Lose yourself in a world that looks and feels real. With a cutting edge approach to digital art, Unscripted redefines what’s possible for visual novels.</p>\n<p>EXPERIENCE TRUE INTIMACY</p>\n<p>No more disappointing fades to black. Take your relationship to the next level with story driven sex scenes, unique to each character. Fully optional, sex positive and super hot.</p>\n<p>MATURE CONTENT DESCRIPTION<br />\nThe developers describe the content like this:</p>\n<p>This game contains content that may not be suitable for all ages, such as sex, nudity, alcohol and drug use and strong language. The sex scenes are fully optional and non-explicit, but very realistic and intimate.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-12-19T10:11:37", "background_image": "https://media.rawg.io/media/games/506/506c7703d2eecfe826c1a69f2ab0d07b.jpg", "website": "https://store.steampowered.com/app/2156300/Unscripted/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 289, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Undergrad Steve"], "genres": ["Simulation", "Casual"], "publishers": ["Undergrad Steve"], "esrb_rating": null}