{"id": 894220, "slug": "mob-mentality", "name": "Mob Mentality", "name_original": "Mob Mentality", "description": "\n<p>Introducing <strong><em>Mob Mentality</em></strong>, a take on the classic boss-fight game in which the player takes on the role of a mob of villagers. Created by <em>Chris Clarke, Jamie Hopkins, Thomas Meharey and Thomas Vanderwyst</em>, <strong><em>Mob Mentality</em></strong> is set in a medieval world where the player takes on the role of angry mob of villager who must recruit more villagers to join the fight. The villagers, who are usually very frightened, must come together from a variety of different towns to overcome the monster. The game also features Werewolf boss monsters to strive for a perfect killing time with. If the player loses all their villagers, they will have to start over and form a new mob. This is risky business, as the game would very likely end if the player suffers a huge loss. </p>\n<p><strong><em>Mob Mentality</em></strong> is sure to bring a smile to the faces of all the players. So go ahead and get a jump on the race to defeat the monster and let the game begin!</p>\n\n\n\n<p>Win by slaying the monster, draining his health to zero. Lose by allowing the monster to dwindle your total population to less than half. Gather a large enough force by first selecting a starting villager. Then walk amongst the other villagers using the <em>Rally</em> ability to add them to your cause. Finally approach the monster close enough for your mob to strike but not so close as to be wiped out yourself!</p>\n\n\n<strong>Button</strong><strong>Ability</strong>WASDControl the player or move the camera.<br/>FRally more villagers to the fight.<br/>MOpen the map to get a lay of the land.<br/>Right Mouse<br/>To select the first villager and start a new mob.<br/>", "metacritic": null, "released": "2022-12-09", "tba": false, "updated": "2022-12-12T12:40:03", "background_image": "https://media.rawg.io/media/screenshots/d01/d0146d436ca3d5259c01aa8036e2caa3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 213, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Snuzfuz"], "genres": ["Action"], "publishers": [], "esrb_rating": null}