{"id": 894327, "slug": "origine-knights", "name": "Origine Knights", "name_original": "Origine Knights", "description": "Character List\r\nThis Game is a crossover from the Origine project.\r\n<p>Summon knights to protect the Medieval Fantasy town of Edgewind from dangerous rifts, and climb the tower to kill the outer gods !</p>\n<p>Become a Patron!\r\n</p>\n<p><strong>Backstory :</strong></p>\n<p>You are an otherworld being, summoned from the planet Earth to the world of Alumnia, by the saint goddess of light. Few days ago at Edgewind, a Tower suddenly appeared, created by the Outer Gods, mysterious beings attempting to invade Alumnia. The Tower is a gigantic building piercing the sky, and it's said that every floor is an old world, invaded and destroyed by those Outer Gods.</p>\n<p>You must protect Alumnia from this fate ! </p>\n<p>Using your knowledge from the planet Earth, and the power given to you by the goddess, summon your knights, make an expedition and raid the Tower. Climb to the last floor to reach the Origine of the Outer Gods and get rid of them once for all.</p>\n<p>Beware for in the meantime unstable Rifts keep appearing in Edgewind and threaten the citizens. Can you climb, while taking care of the people ? </p>\n<p>Embark in your journey !</p>\n\r\nThe mains features are :\r\n<ul><li>- Summon powerful knights !</li><li>- Kill monsters, and gather resources from the Rifts opening in the city.<br/>\n</li><li>- With those resources upgrade your knights levels, give them a better equipment, and summon more knights.</li><li>- Fight the Outer Gods at each floor of the Tower !</li><li>- In the meantime enjoy a visual novel style backstory.</li></ul>", "metacritic": null, "released": "2022-12-03", "tba": false, "updated": "2022-12-12T13:24:50", "background_image": "https://media.rawg.io/media/screenshots/46a/46a571334717c4f3ee201219819f1851.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Sheyne"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}