{"id": 894453, "slug": "mo-ni-you-xi-da-quan-2023", "name": "模拟游戏大全2023", "name_original": "模拟游戏大全2023", "description": "Simulation Game 2023 gathers all kinds of simulation content to let you experience all kinds of wonderful simulation content. At present, it has included and launched six kinds of simulation content, each of which is an immersive game experience, and will continue to launch the last six kinds of brain hole playing experience<h3>Published</h3><br/><br/>Traffic jam simulation<br/>Experience the first person traffic jam, and the fidgety mood gradually rises! You can also enter classic scripts to summon tanks.<br/><br/>Fishing simulation<br/>It allows you to experience the fun of fishing without leaving home. You can live alone on the cold and frozen land and survive by fishing<br/><br/>Scout simulation<br/>In the cold battlefield, you, as a keen scout, convey coordinates to your sniper teammates and snipe the target<br/><br/>Monster simulation<br/>It's a new experience to play role-playing games with Monster as the protagonists, and occasionally try to experience being chased by heroes<br/><br/>cold noodles simulation<br/>Everyone likes baked cold noodles. Do you know how to make it? Today you are the boss of baked cold noodles. Let's see how many you can sell every day<br/><br/>Horror House simulation<br/>The haunted house that dare not enter in reality. Today, you can experience the exciting atmosphere in the haunted house in the game. Call your partner to try it together", "metacritic": null, "released": "2022-12-11", "tba": false, "updated": "2022-12-16T03:49:20", "background_image": "https://media.rawg.io/media/screenshots/9e4/9e4000e4e8ec6b21050c8aa083fb5996.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deeber"], "genres": ["Action", "Adventure", "RPG", "Simulation", "Sports", "Casual", "Indie"], "publishers": ["Deeber"], "esrb_rating": null}