{"id": 894455, "slug": "football-coach-college-dynasty", "name": "Football Coach: College Dynasty", "name_original": "Football Coach: College Dynasty", "description": "Football Coach: College Dynasty is an all new college football management game. Build your legacy as a coach, starting at a small school and working your way up, or play as your favorite school, creating a dynasty that last decades. Featuring everything you love about college football, and deep customizability to play the way you want.<h3>Features</h3><ul><li> Call plays with a robust simulation engine, featuring 100+ offensive and defensive plays<br/></li><li> Recruit HS and JUCO players to join your school, assigning pitches and scheduling visits to win recruiting battles against your rivals<br/></li><li> Develop your players in the offseason to match your scheme and gain an advantage<br/></li><li> Level up your coach and earn unique skills<br/></li><li> Enhance your school by spending booster money on facilities, academics, marketing, and more<br/></li><li> Stat tracking for every player and every team<br/></li><li> View team and league histories, past game results, awards, coach careers, and records with just a click<br/></li><li> Customize your league with different playoff formats and conference realignment options<br/></li><li> Play your way with tons of different settings to change, including injuries, transfer rules, draft rules, NIL, and more</li></ul><h3>BE THE COACH</h3><br/>Control every facet of your gameplan, including strategies and practice focuses. Call 100+ unique plays on offense and defense, and feel the excitement of big college football games.<br/><br/><h3>RECRUIT FUTURE STARS</h3><br/>Scout and recruit players from all over the country, competing against other schools in tense recruiting battles. Pitch your team to recruits, schedule official visits, and even offer NIL deals.<br/><br/><h3>EARN UNIQUE SKILLS</h3><br/>Earn XP to level your offense, defense, training, and recruiting skills. Choose unique skill badges throughout your career, each granting special bonuses to player performance, development, or recruitment.<br/><br/><h3>ADVANCE YOUR COACHING CAREER</h3><br/>In coach career mode, each school's athletic director will have expectations for you to meet. Exceeding them will make prestigious schools take notice, but missing expectations may result in losing your job.<br/><br/><h3>BUILD A DYNASTY FOR THE AGES</h3><br/>Every statistic and attribute is tracked and can be accessed easily with a click. Examine all teams, coaches, players, and games from previous years, so that legendary run can be relived over and over.<br/><br/>", "metacritic": null, "released": "2022-12-11", "tba": false, "updated": "2022-12-16T03:52:33", "background_image": "https://media.rawg.io/media/screenshots/85e/85e8ac315a8b6370d74e0dc533c32c80.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 5}, "playtime": 7, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 242, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Coach Apps"], "genres": ["Strategy", "Simulation", "Sports"], "publishers": ["Coach Apps"], "esrb_rating": null}