{"id": 894465, "slug": "house-of-ghosts", "name": "House of Ghosts", "name_original": "House of Ghosts", "description": "<strong>House of ghosts </strong>is a single-player horror survival game. Stop the demon and find out the name of his victim before he drags you to hell. Run and hide. Just don't get caught.<br/><br/><strong>Can you banish evil?</strong><br/>The James Brownstone School is famous for its mysterious deaths of teachers and staff, a series of incidents began immediately after the arrival of a new headmistress at the school, the school became purely religious.<br/>After the mysterious deaths, the headmistress disappeared and no one saw her, and the school has been abandoned and looted for 20 years, but they say that strange things are still happening in it. You need to get into the school, find all the cursed items, find out the name of the last victim and exorcise the demon to hell.<h3>A basic Exorcist kit is available for you to successfully exorcise a demon:</h3><ul><li> EMF - used to detect traces of a demon and cursed objects. Be careful! EMF may work inaccurately!<br/></li><li> Thermometer - with it you can determine the location of the demon. It will always be cold next to a demon.<br/></li><li> Holy candle - it will help you find the cursed object. The candle lights itself if there are traces of a curse next to it.</li></ul>Also pay attention to the radio and lockers, they will help you survive.<br/><br/><strong>Replayability</strong><br/>The behavior of the demon, the places where objects appear, as well as the objects themselves are randomized. Each new launch of the game will be unique!<br/><br/><strong>Warning!</strong><br/>This game contains flashing lights that may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. It is recommended to exercise the discretion of the player.", "metacritic": null, "released": "2022-12-12", "tba": false, "updated": "2022-12-16T04:04:23", "background_image": "https://media.rawg.io/media/screenshots/9df/9dfc2027d32ea563feaa5ed4ea249e8b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fresh wind games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["CreativeForge Games"], "esrb_rating": null}