{"id": 894445, "slug": "akai-katana-shin", "name": "Akai Katana Shin", "name_original": "Akai Katana Shin", "description": "It is now the Taisho era in a world similar to olden Japan during a period of rapid economic growth.<br/>\r\nFighter jets, tanks, and battleships have entered the war, and giants known as Guardians and Mugen are tearing their way through the battlefield.<br/>\r\nThis is the exciting stage of Akai Katana Shin, a horizontal shoot 'em up game.<br/>\n<br/>\n<br/>\r\nThe Japanese-inspired military game visuals and gorgeous character designs <br/>\r\nportray a dramatic story of clashes between family and old friends. <br/>\r\nThese elements are tied together by strategic game mechanics, which feature a wide variety of attack methods to experiment with. <br/>\r\nFind out for yourself why this game has such a strong base of ardent fans!<br/>\n<br/>\n<br/>\r\nContains Three Titles From Cave's Akai Katana Series<br/>\r\nAkai Katana<br/>\r\nThe first arcade game of the series released in 2010. Supports two players.<br/>\n<br/>\r\nAkai Katana Shin<br/>\r\nA home console version with an aspect ratio of 16:9 and new game features such as Hagane and Katana.<br/>\n<br/>\r\nAkai Katana Zetsu<br/>\r\nBased on Akai Katana with an aspect ratio of 16:9. Game mechanics have been adjusted for balance.<br/>\n<br/>\n<br/>\r\nFrom Strategy Crafting to Score Attack—Versatile Enough to Play It Your Way<br/>\r\nThe player unit known as Fighter <br/>\r\ncan switch between its normal form and a giant ninja known as Guardian using Soul-shift. <br/>\r\nThe unit also comes equipped with two different bullet shots. <br/>\r\nAttack Mode has more power and Defense Mode boosts mobility. <br/>\r\nMake good use of a combination of forms and modes to break through enemy ranks and destroy them.<br/>\n<br/>\r\nSoul-shift is a crucial technique that boosts the player for a short while. <br/>\r\nIn Akai Katana and Akai Katana Zetsu, timing the shift well can block enemy bullets even on a screen that's full of them. <br/>\r\nIn Akai Katana Shin, generate and fire a Katana shot to quickly defeat strong enemies. <br/>\r\nThe highlight of this title is the ability to negate or dispel attacks instead of simply avoiding them. <br/>\r\nMake good use of Soul-shift to turn the tide in your favor and earn a higher score.<br/>\n<br/>\n<br/>\r\nQuality Game Modes Packed With Features<br/>\r\nSettings: Adjust options such as sound volume and screen display. <br/>\r\nTurn Screen Frame on to see captions for character voices during the game.<br/>\n<br/>\r\nTraining: Specify a stage and adjust your unit's condition to carry out individual training.<br/>\n<br/>\r\nScore Attack: See how far you can go with only one life. No continues or restarts allowed. <br/>\r\nRank and replays can be saved separately from normal gameplay.<br/>\n<br/>\r\nOnline Leaderboard: See how your score compares against other players online.<br/>\n<br/>\r\nReplay: Record and save gameplay data from start to end of session. <br/>\r\nOther than playing and pausing the replay, you can also use the Edit function to jump right into the game from a specific point in time.<br/>\n<br/>\n<br/>\r\nDaisuke Matsumoto's New Soundtrack Masterpieces<br/>\r\nDaisuke Matsumoto, music composer of Gothic wa Mahou Otome and sound effects producer for the Akai Katana series, returns with exciting new musical arrangements for the game's soundtrack.<br/>\r\nYou can switch between three different versions of BGM for this game,<br/>\r\nincluding the original audio and new tracks created for Akai Katana Shin.", "metacritic": null, "released": "2022-12-14", "tba": false, "updated": "2022-12-16T03:37:20", "background_image": "https://media.rawg.io/media/screenshots/e8f/e8f5ccca875f04881f89b98570a1295e.jpg", "website": "https://city-connection.co.jp/akaikatana/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "toplay": 1}, "playtime": 1, "achievements_count": 35, "ratings_count": 0, "suggestions_count": 345, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CITY CONNECTION", "TAKE×0FF"], "genres": ["Action"], "publishers": ["CITY CONNECTION"], "esrb_rating": null}