{"id": 894489, "slug": "villains-legacy", "name": "Villain's Legacy", "name_original": "Villain's Legacy", "description": "<p>The world is constantly on the brink of collapse. Invaders from outer space trying to enslave the human race, mad scientists quivering to conquer the planet, creatures from other dimensions feed on fear and despair of the people.<br />\nBut none of this will ever happen, because THEY, are ready to defend the Earth at any cost!<br />\nSuperheroes. Beautiful, powerful ones. Born from dangerous genetic experiments, coming from other galaxies, or gifted by supernatural forces.<br />\nIt is because of them that people can sleep soundly.<br />\nThey are a blessing, something indispensable, the only thing that can mantain the order in the streets. Each one of them, every day, puts his or her skills to work for the good of the community in which they live, each one of them strives for the good of the world. All, are moved by ideals of justice, tolerance and freedom. However...<br />\nFew have been able to see beyond their mask. What the medias report, what people think and say, does not always correspond to the truth. Far from it.<br />\nIn this Adult Visual Novel you are the one who has decided to fight superheroes. The one who has decided to expose them and their corruption.<br />\nAs a powerful supervillain, you will have to plan your moves against the sexy superheroines you have chosen to fight. You will subdue them and humiliate them, or even fall in love with them and start a relationship.<br />\nFrom your workshop, you will be able to build diabolical tools and powerful weapons. You will recruit underlings, strictly sexy and ready to do anything to serve and please you.<br />\nThe Villain&#39;s Legacy is yours!<br />\nFeatures included in this spicy sandbox AVN at the time of release are:<br />\n- over 50000 words and 4000 images!<br />\n- Visit enemies and allies on the map;<br />\n- Perform criminal acts to grow fame and money;<br />\n- Buy materials and use them to build new and fantastic items;<br />\n- Research information about superheroes and other characters;<br />\n- Summon your henchmen and send them on missions!</p>", "metacritic": null, "released": "2022-12-13", "tba": false, "updated": "2022-12-19T09:55:20", "background_image": "https://media.rawg.io/media/games/cf9/cf9702603c2cb3beceecb86fa30d8601.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 4, "toplay": 2}, "playtime": 1, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 521, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad scientist lab"], "genres": ["Adventure", "Indie"], "publishers": ["Mad scientist lab"], "esrb_rating": null}