{"id": 894476, "slug": "dream-team-basketball", "name": "Dream Team Basketball", "name_original": "Dream Team Basketball", "description": "<strong>Innovative Gameplay</strong><br/>A unique take on CCG games that combines 5vs5 team battles and basketball lore. The result is a short strategically and tactically intensive match that leaves you wanting for more. While your average team battle game needs you to do damage, manage mana and health bars, Basketball DreamTeam revolves around scoring points, passing, movement and management of players.<br/><br/>The game has no critical strike chance, but it has 3point shooting that will make your shots score more, there is no armor or evasion but there is stealing and blocking as defense layers. The game embraces well know tactical game systems and brings them to a sports environment format.<br/><br/><br/><br/><strong>Lore Driven Design</strong><br/>Play with over 360 basketball and NBA inspired cards, that allow a multitude of gameplay styles and enable crazy combos. With over 450 players, each with an unique combination for their 3 skills, up to 4 passives and other various traits, the game offers infinite possibilities for the deck building side of the game. <br/><br/><br/><br/><strong>Competitive Environment</strong><br/>Our intention is to develop a competitive scene around the game and have embraced a \"easy to learn, hard to master\" design philosophy. The starting 5 players will have an important role for the outcome of the game, while the 7 bench players will give players a multitude of option to interact with various strategies when needed. <br/><br/><br/><br/>Basketball Dream Team is still in development. The current design is evolving every day and we’re hoping to take it to the next level with the help of our community. We plan to add a plethora of new game systems while also improving the polish for the game.<br/>​", "metacritic": null, "released": "2022-12-12", "tba": false, "updated": "2022-12-16T04:18:37", "background_image": "https://media.rawg.io/media/screenshots/9de/9de1553668cf3203939247bc6385896f.jpg", "website": "http://www.basketballdreamteam.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 221, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dream Team Games"], "genres": ["Strategy", "Sports", "Indie"], "publishers": ["Dream Team Games"], "esrb_rating": null}