{"id": 89448, "slug": "boulder-dash-30th-anniversary-2", "name": "Boulder Dash 30th Anniversary", "name_original": "Boulder Dash 30th Anniversary", "description": "Now on version 2.0!<br/> <br/>“Boulder Dash-30th Anniversary” featured as a \"Best New Game\" and \"Best New Update\" in more than 75 countries worldwide and still getting great reviews!<br/><br/>•\t\"This new version of Boulder Dash both looks and plays really well...  I'd definitely recommend downloading and checking out…\" – toucharcade.com<br/>•\t\"...the game is still as challenging as it used to be back in the day so you best be prepared if you’re willing to journey through the depths of earth… and celebrate the 30th anniversary of a truly classic game.\" – touchtapplay.com<br/>•\t\"...an action-puzzler that remains true to the original classic gameplay, with added features and controls that offer a new twist to the game’s many levels, and several new puzzles.\" – indiegamemag.com<br/><br/>App Store Customer Reviews:<br/>•\t\"This game is tons of fun. I used to play this game on my computer when I was a little kid and this app is updated and different, but done in a way were its actually more fun than the original. But it still has a lot of the original feel.\" - Sap357<br/><br/>Gem Collectors, Dig This!  Boulder Dash®-30th Anniversary™ finds our heroes, Rockford™, Crystal™ and others, facing a slew of new, exciting challenges in this legendary action puzzler.  Dig through spectacular caves with 3D elements; avoid falling boulders; collect valuable gems and avoid nefarious enemies along the way.  Discover treasure chests with rare collectibles and potent power-ups.  With 280+ exciting levels, 12+ new, gorgeous worlds, and 10 playable characters, Boulder Dash-30th Anniversary is the best game in its 30 year history. <br/><br/>The original Boulder Dash® was created by Peter Liepa with Chris Gray over 30 years ago and published by First Star Software in 1984.  Boulder Dash®-30th Anniversary is the first, and only, game in the multi-million unit selling Boulder Dash series to include both a premium world designed by Peter Liepa and another by Chris Gray.<br/><br/>While providing classic Boulder Dash core gameplay mechanics and features, Boulder Dash-30th Anniversary introduces exciting new elements such as diagonal movement, which opens up new and intriguing puzzles while creating a very different and organic look for the caves. <br/><br/> Features Include:<br/>•\t280 all-new levels with advanced physics!<br/>•\t12 Never-before-seen worlds, with new creatures with 3D animations!<br/>•\tNew multicolored gem combos, treasure chests, rare collectibles and spectacular power-ups!<br/>•\tLimited time special events with unique prizes!<br/>•\tPremium world by videogame legend Peter Liepa who returns to the game he created 30 years ago with 20 of the most mind-bending levels yet!<br/>•\tPlay as Rockford™ or unlock 9 other playable male and female characters including Crystal™!<br/>•\tFree Spins for prizes!<br/>•\tController support added including 8BitDo NES30!<br/>•\tCompete with Facebook® friends to set high scores!<br/>•\tGamecenter support (Achievements &amp; Leaderboards)!<br/>•\tFirst Boulder Dash game ever to include diagonal walls and movement!<br/>•\tLanguages:  English, Spanish, French, German, Italian, Portuguese, Polish, Russian!<br/><br/>Boulder Dash® is a trademark of BBG Entertainment GmbH, registered in the European Union and the U.S. Boulder Dash®-30 Anniversary™, names and likenesses of Rockford™, Crystal™ and Goldford™ are trademarks of BBG Entertainment GmbH. Boulder Dash®-30 Anniversary™ Copyright<br/><br/><br/>Please Note: Boulder Dash®-30th Anniversary™ is free to download and play, however, some game features and items can be purchased for real money.  If you don’t want to use these features, please disable in-app purchases in your device settings.<br/><br/>http://www.bbg-entertainment.com/", "metacritic": null, "released": "2014-10-14", "tba": false, "updated": "2020-12-16T14:34:55", "background_image": "https://media.rawg.io/media/screenshots/48a/48a75180a1efa37cdc2505f25efb8672_KFkAgba.jpg", "website": "http://www.boulder-dash.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 204, "game_series_count": 0, "reviews_count": 0, "platforms": ["Nintendo Switch", "iOS"], "developers": ["BBG Entertainment"], "genres": ["Action", "Puzzle"], "publishers": ["BBG Entertainment"], "esrb_rating": "Everyone"}