{"id": 8944, "slug": "level-up-villains-idle-clicker", "name": "Level Up: Villains (Idle Clicker)", "name_original": "Level Up: Villains (Idle Clicker)", "description": "Ever wanted to be a bad guy? To have a lair full of henchmen and underlings at your disposal? Well in &amp;quot;Level Up: Villains&amp;quot; you can.<br/><br/>The Lair is full of evil doers; a blind, fire obsessed dwarf, a three-eyed orc, an undead fallen hero, three crazed elves and a sniper known only as &amp;quot;Question Marks&amp;quot;. This ragtag bunch of thieves and murderers are desperate to cause chaos and destruction, but they&amp;#39;re in need of a leader.<br/><br/>Hire villains (or beat them up until they join you) and slowly unlock the secrets of the Lair. Train your Villains, tap, upgrade and empower them to be the very best (well, worst) they can be. Improve their skills and (once trained enough) send them out on various dastardly, idle, quests. Your underlings will smash heroes, battle kings and perform a variety of other weird and wonderful tasks for you, all earning you precious gold.<br/><br/>Use this pilfered gold to expand the Lair, unlock new zones, build gold mines (to fuel your evil campaign), unlock shops and hire more Villains. Improve every aspect of your base and become known across the land.<br/><br/>The Lair has many secrets, and perhaps the best kept is the Drums of Power - hidden in its very heart. Find these drums, unlock their secrets and earn powerful relics which will secure your name in the hall of evil.<br/><br/>Features:<br/>+ Exciting Idle / Tapper gameplay.<br/>+ Nearly 20 Villains, to hire, train and upgrade.<br/>+ Close to 100 unique quests that will challenge your skills.<br/>+ Prestige to earn the powerful Items of Power to unlock permanent bonuses.<br/>+ Stunning 3D graphics, great music.<br/>+ More content planned.<br/><br/>At Grumpy Rhino Games we&amp;#39;re trying to take the Clicker and Idle genre to the next level. With two successful Tappers under our belt (More! Gold! Now! and Clicker Town) and more planned. We always try to make our games feel different and bring in new ideas to keep you entertained. We&amp;#39;re always looking for feedback, so send us a message on...<br/><br/>Facebook: https://www.facebook.com/grumpyrhinogames<br/>Twitter: https://twitter.com/GrumpyRhinoGame", "metacritic": null, "released": "2016-03-04", "tba": false, "updated": "2019-10-22T14:30:11", "background_image": "https://media.rawg.io/media/screenshots/15a/15aefa18a42136aa0c2822d546374aaa.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 261, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Grumpy Rhino Games"], "genres": ["RPG", "Strategy"], "publishers": ["Grumpy Rhino Games"], "esrb_rating": "Everyone 10+"}