{"id": 894568, "slug": "splatter-2", "name": "Splatter", "name_original": "Splatter", "description": "<h3>Can you feel them? The colors burning beneath your skin?</h3> <br/><br/><strong>Splatter</strong> is a first-person fever dream where you blast constantly-adapting enemies into neon sprays of pulp and slime. This world is one built for violence. It is a digital mindscape, surreal and yet strangely familiar, constructed by four anonymous administrators. To survive within it, you must overcome each challenge and outsmart hordes of creatures that learn as you defeat them. Blast enemies with your finger guns, chug cans of energy drinks, and maintain your brain chemistry in order to win.<br/><br/>Your victories, however, may come at a terrible price. Can you uncover the motives of your captors before it is too late? Can you survive? Can you remain sane? Can you remain yourself?<br/><br/><strong>Content Warnings: Flashing lights, visual glitches/distortion, explicit language. It also contains references to self harm, drug use, bigotry, sexual assault, kidnapping, and cult indoctrination.</strong><br/><br/><br/><br/><ul><li>Explore a variety of <strong>strange environments</strong>.<br/></li><li>Experiment with an <strong>extensive arsenal</strong> of finger guns.<br/></li><li>Push yourself to master the <strong>style system</strong> and achieve the highest score on the <strong>online leaderboards</strong>.</li></ul><br/><br/><br/><ul><li>Shoot, slap, and slurp your way through waves of enemies in a blaze of <strong>giblets</strong> and <strong>rainbow fluids</strong>.<br/></li><li><strong>Paint the whole level with gore</strong>. Blood is persistent and physically simulated.<br/></li><li>Watch as <strong>colors shift</strong> and the <strong>level shakes</strong> to the beat of the music.</li></ul><br/><br/><br/><ul><li>Experience <strong>dynamic challenges</strong> as enemies <strong>learn from your behavior</strong>.<br/></li><li>Hear the <strong>adaptive soundtrack</strong> change to match your performance.<br/></li><li>Enable <strong>difficulty hacks</strong> to ensure that your gameplay experience is perfectly tailored to you.</li></ul>", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T06:14:50", "background_image": "https://media.rawg.io/media/screenshots/f1f/f1f349a1a2e84e5534b582cf793fd152.jpg", "website": "https://rattusrattusart.wixsite.com/home/splatter", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "toplay": 2, "dropped": 1}, "playtime": 1, "achievements_count": 21, "ratings_count": 0, "suggestions_count": 297, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rat King Collective"], "genres": ["Action", "Indie"], "publishers": ["Rat King Collective"], "esrb_rating": null}