{"id": 894588, "slug": "suikoro", "name": "すいころ", "name_original": "すいころ", "description": "<strong>You are a dice</strong>.<br/><br/>You can roll dice because you are dice, and<br/>You can solve puzzles because you are a dice.<br/><br/>\"Suikoro\" is waiting for you to roll as your \"intuition\" tells you.<br/><br/><br/><br/>Roll and step on the \"designated panel\" on the ground!<br/>The \"designated panel\" on the ground is responsible for opening the goal. To roll to the designated panel, you need to make sure that the eyes on the panel are the same as the eyes on your top, but you change the eyes every time you roll. So, even if you roll honestly, it may not work. When that happens, I recommend that you start over, choose a different puzzle, or get away from \"Suikoro\" and play another game, or go outside and change your mind.<br/><br/><br/><br/>■Change your colors and change your mood!<br/>Are your colors white, black and red? If so, try to be a different you once in a while. Choose something close to your favorite color or a color you don't normally wear and dress up in your own way, then relax and watch you roll.<br/><br/><br/><br/>■The sum of the front and back of a six-sided dice is always seven!<br/>Did you know that? This is an amazing discovery! And this is very important for solving puzzles!<br/><br/><strong>For those who want to make videos, streaming, etc.</strong>.<br/>If you wish to monetize your game by posting or distributing videos using Kobakoto's games, please note that Kobakoto will not be held responsible for any problems that may arise from such activities.", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T06:40:13", "background_image": "https://media.rawg.io/media/screenshots/0b6/0b619efb06a518ff2e9e7b728cf49499.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 23, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["こばこと"], "genres": ["Casual", "Indie"], "publishers": ["こばこと"], "esrb_rating": null}