{"id": 894542, "slug": "furry-femmes-making-an-obedient-bitch", "name": "Furry Femmes: Making an Obedient Bitch", "name_original": "Furry Femmes: Making an Obedient Bitch", "description": "<strong>Furry Femmes: Making an Obedient Bitch</strong> is a fascinating visual novel from the creators of the \"Stories of Submission\" series. Dive deep into a truly fantastic kinky story of love, passion, jealousy and submission.<h3>Summary</h3><br/><br/>Kara was always the girl of Mike's dreams: beautiful, smart and ambitious.<br/><br/>She moved away to go to university, but Mike was convinced they were destined to be together and followed in her footsteps.<br/>Years have passed and now they work together in Kara's laboratory where she wants to splice animal DNA into humans to start the next step in human evolution. Unfortunately, they're no closer to succeeding in their research and Mike is no closer to seducing Kara.<br/><br/>With the looming threat of bankruptcy and complete failure, Kara decides to accept the aid of Kevin, a scientist who has been attempting similar research abroad. He claims to have the missing piece of the puzzle that will allow Kara and Mike to succeed; not to mention an anonymous sponsor who will fund the project. Who is Kevin Sanders really? What is the mysterious sponsor hoping to achieve by funding this research? What will happen to Kara when she becomes the first test subject?<br/><br/>As their research takes several unexpected turns, Mike will be confronted with the answers to these questions and more.<br/><br/>Ultimately, he'll have to answer the most important question of all: what kind of person is he willing to become to get what he wants?<h3>Features</h3><br/><br/>■  A fantastical story about science gone crazy.<br/>■  A main character who's a hopeless romantic, pervert and socially awkward loser struggling to get the girl of his dreams.<br/>■  A female lead who goes from a cold, cruel, professional scientist to a wild, insatiable doggirl.<br/>■  Numerous sex scenes with gorgeous art, featuring both human and furry Kara.", "metacritic": null, "released": "2022-12-14", "tba": false, "updated": "2022-12-16T05:43:46", "background_image": "https://media.rawg.io/media/screenshots/9bb/9bb3ccb4064a72b0edcb55a78b731395.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 208, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Zee Vital", "Swimming Rock"], "genres": ["Casual", "Indie"], "publishers": ["Zee Vital"], "esrb_rating": null}