{"id": 894581, "slug": "house-flipper-pets-vr", "name": "House Flipper Pets VR", "name_original": "House Flipper Pets VR", "description": "Time spent with our four-legged friends is fun and precious - no doubt. Apartment renovation and cleaning the mess made by unruly puppy on the other hand… not so much. Luckily as soon as you dive into the world of House Flipper Pets VR all of these activities become entertaining!<br/><br/><br/><br/>Experience the unique game mechanic of Furniballs which turns the process of apartment renovation and furnishing into a joyful play as simple as tossing a ball. Customize walls, floors, and furniture, make apartments nice and cozy and enjoy them together with your four-legged companions. The more you progress the more apartments, furniture, wallpapers, upholsteries, and other materials become available.<br/><br/><br/><br/>Take responsibility for pets and the trouble they may cause. Clean, collect garbage, remove stains, fix damaged pieces of furniture, and change wallpapers. Also, don’t forget about the needs of those lovely creatures. Feed them &amp; clean up after them. <br/><br/><br/><br/>Spend a great time together with pets. Toss them balls, pull the rope with them, pet them, teach them retrieving, and all sorts of new tricks. Make them happy!<br/><br/><br/><br/>Is there anything that could make a virtual pet happier than your love and attention? One thing - love and attention from you and your friend! Enjoy all of the game aspects together in online cooperative mode. Give these apartments new life, train pets and play with them together.", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T06:32:11", "background_image": "https://media.rawg.io/media/screenshots/e5f/e5fb52b4959f692252a9b53917220f6c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 269, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Petard Games"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["PlayWay", "Frozen Way"], "esrb_rating": null}