{"id": 894550, "slug": "longeyed-proj-2", "name": "LONGEYED PROJ", "name_original": "LONGEYED PROJ", "description": "<h3>Wishlist LONGEYED PROJ. to get news about the game.</h3><h3>Join our discord server!</h3><br/><br/><br/><strong>LONGEYED PROJ.</strong> - is multi-chapter game in which you have to identify suspicious and dangerous inidividuals. Will you be able to figure out which of them is a simple victims and which are just pretending to be victims?<br/>You will be shown a series of images, two each. Your task is to thoroughly analyse each image based on the 911 recording. <br/><br/>Want to stay alive? follow along with instructions and clues.<br/><br/>You have to plunge into the plot, and find out the secrets and nature of these creatures. If at some point you begin to feel that something isn't going according to plan, turn off the training program and don't turn around for a while... and God help you.<br/><br/>Be prepared for the fact that you have to brainstorm to understand who in this deceptive world is innocent and who is the worst enemy. Remember, you have a huge responsibility on your shoulders.<br/><br/><br/><br/><br/><ul><li>Prepare to get into a secret organization<br/></li><li> Listen to 911 emergency calls<br/></li><li>Make serious decisions<br/></li><li>Solve puzzles<br/></li><li>Can you figure out where these creatures come from?<br/></li><li>Keep in mind, your decisions can lead to many consequences</li></ul><br/><br/>Download <strong>LONGEYED PROJ.</strong> and try yourself.<br/>But... who knows what it will cost you.", "metacritic": null, "released": "2022-12-14", "tba": false, "updated": "2023-06-02T13:00:39", "background_image": "https://media.rawg.io/media/screenshots/16d/16d185c2b60c6b43ab42043c383ed831.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["wadishTheCreator"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Indie"], "publishers": ["wadishTheCreator"], "esrb_rating": null}