{"id": 894510, "slug": "my-gaming-club", "name": "My Gaming Club", "name_original": "My Gaming Club", "description": "<strong>My Gaming Club - gaming club simulator</strong><br/><br/>You have to raise your business from knees, the only thing you have at the start is an old garage that you inherited from the deceased Uncle Ben<br/><br/><br/><strong>What is this game about?</strong><br/>You are the owner of a gaming club, visitors come to you every day who are eager to play various computer games. Your goal is to develop in order to meet their needs as much as possible, and at the same time make a profit from it<br/><br/><strong>What am I going to do?</strong><br/>It's just like in real life, only you work in a gaming club. Accordingly, your actions are to buy equipment, food, clean up and equip your club<br/><br/><strong>What is special about this game and how does it differ from other games of this genre?</strong><br/><ul><li>The game has many elements of real life (hunger, thirst, urine, mood, freedom of action, etc.)<br/></li><li>The ability to assemble a PC from components<br/></li><li>A smartphone with many applications and functions (Camera, Wallet, Calendar, Calls, Notes, etc.)<br/></li><li>Ibay online auction, where you can sell and buy things<br/></li><li>Incredibly smart AI that won't make you bored<br/></li><li>Realistic car (realistic physics, fuel, oil, coolant, engine overheating, light, battery)<br/></li><li>Realistic environment that will allow you to fully immerse yourself in the game world</li></ul>", "metacritic": null, "released": "2022-12-13", "tba": false, "updated": "2022-12-16T05:01:38", "background_image": "https://media.rawg.io/media/screenshots/66c/66c46277e09c0354e8121aea6618ef67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 8}, "playtime": 2, "achievements_count": 12, "ratings_count": 0, "suggestions_count": 247, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gartal Games"], "genres": ["Simulation", "Indie"], "publishers": ["Gartal Games"], "esrb_rating": null}