{"id": 894533, "slug": "fright-knight-legend", "name": "Fright Knight Legend", "name_original": "Fright Knight Legend", "description": "Fright Knight Legend is an action packed beat 'em up where you embark on a journey to save the cursed Kingdom of Brightmore. As you fight your way through the hordes of enemies &amp; avoid traps along the way to find the gems scattered throughout the land, the Wizard narrates the legendary adventure.<br/><br/><br/><br/>This is a tale told many times before in many different ways throughout history. It's a story with humble beginnings but it soon puts you face to face with enemies of great renown and monsters believed to be lost to the ages. <br/><br/>This epic adventure spans the Kingdom of Brightmore delving into its darkest corners. Evil has overtaken good and it's down to you to bring light back to the world. The legendary feats you display along the way might just surprise you...<br/><br/><br/><br/>You can choose between three heroes: <br/><br/>Bella, a female knight that has fists of fury, with quick combos<br/>Simon, the Knight in shining armor that uses his strength to fight his way through the enemies<br/>Merlin, the magician that has extra stamina for more special attacks<br/><br/><br/><br/>The game features:<br/><br/>* Up to 3 playable characters with unique attributes (using Joystick)<br/>* Local Co-Op - playing together is better (Online Matchmaking Coming Soon)<br/>* Epic narration throughout the gameplay", "metacritic": null, "released": "2022-12-14", "tba": false, "updated": "2022-12-16T05:31:47", "background_image": "https://media.rawg.io/media/screenshots/bff/bff5ea331e5891c4a9dd09c7bb729e38.jpg", "website": "http://frightknightlegend.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 482, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LunarEx Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["LunarEx Games"], "esrb_rating": null}