{"id": 894552, "slug": "daring-detectives-a-new-life", "name": "Daring Detectives - A new life!", "name_original": "Daring Detectives - A new life!", "description": "In this adult visual novel you'll take the role of 4 different main characters, 2 males and 2 females, facing the hard trials to be a Daring Detective in New York City... A choice based high level graphics visual novel in which you will develop your characters' profiles (Investigation, Love, Action and Lust) in order to solve quests, punish crimes and face your daily loving/sexual life, unlocking new scenes and different endings.​<br/><br/><br/><br/>Matilde<br/>A charming and intelligent police commissioner who has seen her life destroyed by a mob attack. After losing the love of her life, she is forced to change cities, under a new secret identity, along with her sister. She will become the new commissioner of a small New York police station.<br/><br/><br/><br/>Hiroshi<br/>Lieutenant Tanaka is an excellent investigator, temporarily in charge of a small New York police station, trying to make things work with his quirky colleagues and assistants, in his career that is struggling to take off, but especially in his love/sex life with his gorgeous wife Mary.<br/><br/><br/><br/>Daphne<br/>An excellent police recruit with a bright future and a career that is about to blossom. Will she be able to come to terms with her difficult past, however, and control her fiery temper, to become the great detective she is destined to be?<br/><br/><br/><br/>Eddie<br/>The best friend Hiroshi could wish for, always by his side, both in the police team and in life! Strong, brave, brutal... Eddie is an outstanding sidekick for Lieutenant Tanaka, but it won't be easy for him to put his messy life in order!<br/><br/>Playing the game you'll follow the adventures of the 4 main characters, impersonating them, and with your choices you will modify their stats, changing the progress of the story, and unlocking 16 different endings! During the game you will unlock special and hot scenes into 2 large galleries (Replays and Zooms) you can access everytime you like.<br/><br/>- Images In the Game: 2500+<br/>- Animations In the Game: 15+<br/>- Replays to Unlock: 131<br/>- Zooms to Unlock: 78<br/>- Multiple stat system (Investigation, Love, Action, Lust)<br/>- Multiple endings to unlock: 16", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T05:55:54", "background_image": "https://media.rawg.io/media/screenshots/f50/f503c4483979aa066d1f4a14fdff6235.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 461, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["HyenaWorm"], "genres": ["Adventure"], "publishers": ["HyenaWorm"], "esrb_rating": null}