{"id": 894593, "slug": "rance-quest-magnum", "name": "Rance Quest Magnum", "name_original": "Rance Quest Magnum", "description": "Alicesoft's proud mainstay, the Rance series, moves to its next stage! With the new quest system, you can enjoy the game free and easy while taking the story at your own pace. Get as much out of the game as you want, like an MMORPG! The story continues from the last title in the series, Sengoku Rance, but Rance Quest is a great starting point for newcomers as well.\nStory\nRance crossed to the island nation of Nippon on the eastern edge of the continent in order to partake of its Princess Kouhime, who was known far and wide for her beauty. Chasing this goal, he met Nobunaga Oda, the leader of a minor state called Owari, and was entrusted with the command of its army, going on to conquer the country as its women as well. Rance defeated powerful warriors from clans Uesugi, Takeda, Imagawa, and others, gradually bringing all of Nippon under his rule, but in the final stages of the conflict, he lost his most trusted partner...<br/>\n<br/>\nNow...<br/>\nHaving returned to the mainland, Rance resides in the Copan Empire, part of the Free Cities Zone. With a student named Sachiko who he saved on a whim (so he could have sex with her), he travels east and west, completing quests in search of beautiful women and fortune!<br/>\n\"Sill? Gahahaha! She can wait!\" Just like always(?), Rance beds down with as many women as he can. But when he visits the Kalar Village with nefarious intent, he's struck with a curse that keeps him from having sex!<br/>\n<br/>\nWith his Hyper Weapon disarmed, what will become of Rance's life? He can still fuck strong girls, though!<br/>\n<br/>\nRance and his party of cute girls set off to find mighty maidens and treasures galore!", "metacritic": null, "released": "2022-12-19", "tba": false, "updated": "2022-12-16T06:46:21", "background_image": "https://media.rawg.io/media/screenshots/e58/e58b001530fd71a0cd80cbe044fdbd86.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 460, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Alicesoft"], "genres": [], "publishers": ["MangaGamer"], "esrb_rating": null}