{"id": 894563, "slug": "make-it-in-time", "name": "Make It In Time", "name_original": "Make It In Time", "description": "<ul><li><br/><br/><br/>Alicia Hudson and two other crew members of the spaceship colony have survived the crash on an unknown planet. Upon learning that the planet's core is in crisis and it is at risk of exploding, they must find a way to escape the dying planet before it's too late.<h3>Enemy Waves</h3>Don't think that you'll only have to deal with a few enemies here - you'll be up against a multitude army. Your goal is to fight your way through and defeat every last one of them in the locked areas. Can you handle the challenge?<h3>Defense Missions</h3>Protect the city (&amp; town) from massive monster attacks, and it's up to you and the autonomous defenders called Front Guard to stop them. Make sure to keep the Front Guards operational and prevent the monsters from harming any NPCs. Can you hold the line and defend the city?\"<br/><h3>Fast-paced combat with a variety of playstyles</h3>To change combat modes on the fly, simply press a button. Whether you want to engage in long range combat with guns and grenades, or get up close and personal with melee attacks, the choice is yours. When fighting bosses, your ability to dodge, attack/shoot, reload, and pick up items will be put to the test - timing and skill are key, or you won't survive.<br/><h3>Weapons &amp; Items</h3>With a never-ending supply of handgun clips, you'll be ready for anything. But don't forget to reload! As you fight your way through the game, use your hard-earned coins to upgrade your arsenal with new Weapons, E-Slot items, and Medical supplies. Gear up and get ready for an adventure that will test your skills and keep you coming back for more.<br/><br/><br/>More features and content will be added in the future, including additional heavy artillery weapons for Defense Missions.<br/><br/>We are always open to hearing your suggestions and feedback, so please don't hesitate to let us know what you think.<br/><br/>Thank you so much for your support.<br/>-- Kruntazie Games --</li></ul>", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T06:09:34", "background_image": "https://media.rawg.io/media/screenshots/d69/d69eca3271b0d9a9f4964fa34c49f5a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 410, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kruntazie Games"], "genres": ["Action", "Indie"], "publishers": ["Kruntazie Games"], "esrb_rating": null}