{"id": 894555, "slug": "yu-mo-gong-wu", "name": "與魔共舞", "name_original": "與魔共舞", "description": "A street with a retro feel, Shikou-cho.<br/>\r\nA young girl, Ritsuka Tachibana, is in her second year of high school at Shikou Academy.<br/>\r\nShe is looking forward to the contact of her older brother Lindo, who is studying in England, while living a quiet life with her mother.<br/>\n<br/>\r\nOne day, she is called out by the student president, Rem Kaginuki, who is adored by the students of the school, and has an incredible encounter with the student council members in the Third Library...<br/>\n<br/>\r\nDevils, vampires and exorcists.<br/>\r\nAll the intrigues and plots surrounding the Grimoire are centred on her, and the story begins...<br/>\r\nTo be a human or a devil?<br/>\r\nThis is the story of a young girl who is seduced by the devil and falls in love with him.<br/>\n<br/>\n<br/>\r\nDance with Devils is a romance visual novel.<br/>\r\nIn this game, the player takes on the role of the main character, Ritsuka Tachibana, and makes a choice between encounters with the six main characters, which lead to different endings.<br/>\r\nDuring the plot, in addition to the events that accumulate good feelings, there are also special events that accumulate \"Humanity Degrees\" or \"Devilish Degrees\", which will have a huge impact on the plot depending on the player's choice.<br/>\n<br/>\r\nEach time the player completes an ending, a bonus voice will be unlocked on the Voice Collection in the Third Library. This is where you can learn about the unseen side of each character in the storyline.<br/>\r\nIn addition to this, the Third Library also contains CGs, music and plot memories. These will be unlocked as the player progresses through the game, allowing the player to reminisce about the game even after they have completed it.", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T05:59:28", "background_image": "https://media.rawg.io/media/screenshots/c78/c78a4a66b29db7c6d27b2da2b4d4d89c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 332, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rejet"], "genres": ["Adventure", "RPG"], "publishers": ["Beijing Happy Entertainment Technology"], "esrb_rating": null}