{"id": 894596, "slug": "myst-through-the-ages", "name": "Myst: Through the Ages", "name_original": "Myst: Through the Ages", "description": "Welcome to Myst: a starkly beautiful island, eerily tinged with mystery and shrouded in intrigue.\n\n<br/><br/>\n\nDive into Myst, one of the best selling puzzle-adventure games of all time, by experiencing it as it evolved over the years. With three versions of Myst spanning over the course of three decades – including the latest Myst (2021) – each with unique ways to play, this would make the perfect gift for both Myst enthusiasts and newcomers alike!\n\n<br/>\n\n\n\nMyst (2021)\n Built from the ground up to play in both VR and 2D, you can now journey to the Ages and explore Myst as you never have before – in a whole new dimension! It includes new art, sound, interactions, accessibility and graphics options like gameplay context subtitles and ray tracing, dialog subtitle support for over 10 different languages, and even optional puzzle randomization. This is the ultimate way to experience Myst, both for newcomers and for people returning to the island.\n\n\n\n\nMyst: Masterpiece Edition (2000)\n If you’re looking for the original Myst experience like you remember from back in the day, this is the version for you. Myst: Masterpiece Edition took the original Myst and updated it in 2000 to make it compatible with more modern computer systems. Myst: Masterpiece Edition is the point-and-click adventure of your nostalgic dreams!\n\n\n\n\nrealMyst: Masterpiece Edition (2014)\n Released in 2014, realMyst: Masterpiece Edition moved Myst from point-and-click to a fully navigable graphical experience. Featuring dynamic water, weather, lighting, foliage, and more, realMyst: Masterpiece Edition was an undeniable leap forward from the original Myst experience, providing fans their first opportunity to actually explore every nook and cranny of the Ages.\n\n\n<br/>\n<p>Languages, features and system requirements may vary between games - please check individual product pages for details.</p>", "metacritic": null, "released": "2022-12-11", "tba": false, "updated": "2022-12-16T06:51:22", "background_image": "https://media.rawg.io/media/screenshots/669/66912dffb0bd8e684380afc02470c5f1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 495, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cyan Worlds"], "genres": [], "publishers": ["Cyan Worlds"], "esrb_rating": null}