{"id": 894576, "slug": "cassiodora", "name": "Cassiodora", "name_original": "Cassiodora", "description": "Princess Cassiodora has been kidnapped by the evil sorcerer Kenzar. To save her the chosen knights Agni, Colden and Luken must face a vast army of witches, ghosts and demons across the Kingdom of Astoria. <br/>To accomplish this feat, the druid Faramix grants Agni, Colden and Luken magic wings and elemental powers to help them on their quest.<br/><br/><br/><br/>Play with your friends or solo and shoot your way through this colorful shoot 'em up. Earn new items, customize your character, challenge yourself and face huge bosses.<h3>Key features</h3><br/><strong><ul><li>Story mode</li></ul></strong><br/><br/><br/>Play solo or with up-to 2 of your friends on the same screen and explore 7 regions through 35 handcrafted levels each one with their own setting, challenges, special rewards and unique items. <br/><br/><strong><ul><li>Enjoyable for all</li></ul></strong><br/><br/><br/>Choose between different levels of difficulty ranging from Easy to Hard or define your own experience. Want to be invincible or be revived when you die? That’s done !<br/><br/><strong><ul><li>Replayability</li></ul></strong><br/><br/><br/>From the leader to the oldest and youngest knights enjoy 3 different characters, each with their own personality, abilities, moves and unique unlockable items. <br/><br/><strong><ul><li>Elemental powers</li></ul></strong><br/><br/><br/>Enemies and environmental puzzles like gates or roots will only react to certain elemental skills. Switch between 3 elemental powers or ask your friends to help you!<br/><br/><strong><ul><li>Fully customizable characters</li></ul></strong><br/><br/><br/>Unlock new skins for each character with over 50 cosmetics items to personalize your knight.<br/><br/><strong><ul><li>Awesome boss battles</li></ul></strong><br/><br/><br/>Face epic, huge bosses that compel you to find unique ways to defeat them. Fly away and slay these bosses to continue your quest!<br/><br/><strong><ul><li>You can PET your elemental guardian!</li></ul></strong><br/><br/><br/>Fly, shoot, slash, but do it with style!", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2023-07-25T21:23:30", "background_image": "https://media.rawg.io/media/screenshots/cc2/cc258ab78760630dc04659804473856b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 380, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Void Studios"], "genres": ["Action", "Adventure"], "publishers": ["PID Games"], "esrb_rating": null}