{"id": 894664, "slug": "mad-skills-snocross", "name": "Mad Skills Snocross", "name_original": "Mad Skills Snocross", "description": "Experience the awesome thrill of snowmobile racing with Mad Skills Snocross, an intense racing game for all ages. Mad Skills Snocross features:<br/><br/>* Eight customizable sleds, with more on the way<br/>* Amazing snowmobile physics<br/>* More than 100 challenging snocross tracks<br/>* A variety of fun terrain types<br/>* Wild Daily Dash races every day<br/>* Online play against friends, neighbors, and everyone else<br/><br/>Can you build the fastest snowmobile and compete at the highest level of action sports?  Pin the throttle when the gate drops and see if you can defeat other riders on powerful snowmobiles over challenging terrain. This physics-based side-scrolling racing game is easy to play but impossible to perfect.<br/><br/>Win enough races and you'll unlock faster, better snowmobiles. Climb the racing ladder, earn every sled, and become a snocross legend. <br/><br/>Sign in with Apple or Game Center, and your game progress will sync between devices.<br/><br/>ADDITIONAL DISCLOSURES<br/>This game permits a user to connect to social networks, therefore players may come into contact with other people when playing this game. Social Networking Service terms may apply.<br/>Terms of use can be found at www.turborilla.com/termsofuse. If you do not agree to those terms please do not access and/or play our games or use our services.<br/><br/>Collection and use of personal data are subject to Turborilla's Privacy Policy, which can be read here: http://www.turborilla.com/privacy", "metacritic": null, "released": "2022-10-28", "tba": false, "updated": "2022-12-16T07:59:49", "background_image": "https://media.rawg.io/media/screenshots/62c/62c25bd31a3fd325ef488384d675a9f5_w0yRe5K.jpg", "website": "https://www.turborilla.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 254, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Turborilla"], "genres": ["Action", "Racing"], "publishers": ["Turborilla"], "esrb_rating": "Everyone 10+"}