{"id": 894607, "slug": "airship-knights", "name": "Airship Knights", "name_original": "Airship Knights", "description": "\"An arcane punk world where airships fly through the sky.<br/>You are the first airship captain from Cloud Island!\"<br/><br/>Break through the infinite stages with AFK play and become a legendary hero!<br/><br/>■ Board the airship and Fight in 'Time Attack' Idle Battles<br/>- A 10 seconds match! Defeat the monsters in time and advance!<br/>- Combat and growth are automatic so increasingly stronger enemies won't be any problem for you.<br/><br/>■ An adventure story that blends magic and engineering<br/>- Lose yourself in this animated fantasy world.<br/>- Double the immersion with the unique story of each knight, and the battles are more exhilarating!<br/><br/>■ Get stronger with 'returns' in this endless journey<br/>- Once you feel the limit to your endless journey, open the portal and go back to the beginning!<br/>- With more power, you will be able to travel even farther.<br/><br/>■ With a powerful engine, upgrade to have the strongest airship<br/>- Enhance your magic engine to quickly increase your combat power!<br/>- Manage 6 cabins including the Control Room, Engine Room and Research Room to strengthen your airship.<br/><br/>■ 40 Pixel Knights with incredible looks and abilities!<br/>- Create your own party with knights with various attributes and positions.<br/>- You can help your knights grow in various ways, such as promotion, awakening, and equipment.<br/><br/>■ Explore the World Map for a wider world view<br/>- Arena: 1:1 PVP to unveil powerful knights<br/>- Elemental Island: Battle with the White Tiger, Black Tortoise, Blue Dragon, and the Red Bird!<br/>- Soul Dungeon: Challenge the dungeon to upgrade to the Knights Templar.<br/>- Sky Tower: Conquer the tower filled with monsters and uncover ancient secrets.<br/>- Temple: The Promotion Battle of the Captains! Overcome the trials of the goddess.", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-16T07:05:32", "background_image": "https://media.rawg.io/media/screenshots/ed2/ed22b59d7d234a65875ff26b06f28517.jpg", "website": "https://www.superplanet.net/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 324, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["SuperPlanet"], "genres": ["RPG", "Casual"], "publishers": ["SuperPlanet"], "esrb_rating": "Everyone 10+"}