{"id": 894690, "slug": "roll-player-the-board-game", "name": "Roll Player - The Board Game", "name_original": "Roll Player - The Board Game", "description": "Roll Player is a dice manipulation, strategy board game where you will compete to create the greatest fantasy character in the role-playing world!<br/><br/>Roll and draft dice to build up your character’s attributes!<br/>Purchase weapons and armor to outfit your hero!<br/>Gain skills and discover your hero’s traits to prepare them for their journey.<br/><br/>Earn Reputation Stars by constructing the perfect character. The player with the greatest Reputation wins the game and will surely triumph over whatever nefarious plot lies ahead!<br/><br/>FEATURES:<br/>- Challenge yourself in Solo mode<br/>- Play against 5 levels of AI (or multiple AIs!)<br/>- Play Local multiplayer with friends on the same device<br/>- Keep a record of your best heroes, recent games and various stats<br/>- Interactive tutorial - Play and learn!<br/><br/>QUOTES:<br/>Retromation (YouTube): “I think this game is fantastic! It’s such a good interpretation of a board game into a digital format. Just really, really, really enjoyable! Very nice!”<br/><br/>BOARD GAME AWARDS &amp; HONORS:<br/>2016 Golden Geek Most Innovative Board Game Nominee<br/><br/>FAQ:<br/>- I've heard you're developing online multiplayer?<br/>That is true. We will release it in the next major update (expected Jan 2023).<br/>- When will expansions be added?<br/>After completing online multiplayer and if everything goes well, we'll be continuing with Monsters &amp; Minions expansion.<br/><br/><br/><br/>Roll Player © 2016 Thunderworks Games, LLC.", "metacritic": null, "released": "2022-11-16", "tba": false, "updated": "2023-08-25T16:10:41", "background_image": "https://media.rawg.io/media/screenshots/27a/27a97a4ed377d9c53a96c248f5c88c55_owGolBi.jpg", "website": "http://www.mipmap.hr/", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 307, "game_series_count": 0, "reviews_count": 1, "platforms": ["iOS"], "developers": ["Mipmap"], "genres": ["Strategy", "Board Games"], "publishers": ["Mipmap"], "esrb_rating": "Everyone 10+"}