{"id": 894606, "slug": "girls-connect-idle-rpg", "name": "Girls' Connect: Idle RPG", "name_original": "Girls' Connect: Idle RPG", "description": "The ancient divine wars ends, the gods fell and the dark forces rose. As the Commander of the Mercenary, you will explore the epic Land of Eileen, embark on an amazing adventure, meet and gather various beautiful girls to build the strongest girl legion!<br/><br/>Deep RPG Features<br/><br/>[Collect Me, Connect Me!]<br/>Explore the epic Land of Eileen, meet cute young girls of diverse appearances and personalities during your adventure. <br/>Collect powerful waifu girls, and deepen your bond with the heroines, train 70+ unique heroines to build the strongest girl legion! <br/>Present gifts to increase intimacy, enjoy heart-touching shy moments!<br/><br/>[Evolving Strategic Freedom]<br/>Fire, Water, Wind, Light and Dark! 5 different attribute factions restrain each other.<br/>Burn, Poison, Revive, Freeze, Shock, Curse, Rage Drain…Unleash devastating special skills through dozens of character and skill combinations!<br/>Adapt and perfect your strategy with each turn, assemble your ultimate battle-ready squad with tactics and wisdom.<br/><br/>[Experience Hassle-Free Autoplay]<br/>One-tap to set your warrior lineup —then Hands-Free! <br/> The game support simultaneous battles, multiple battlegrounds fight at the same time. No more waiting!<br/>Adjust the front and back row of your lineup wisely, then turn the tide of battles and blitz all high-CP PVE stages.<br/>Gacha role-playing games shouldn't be a slog. Just enjoy the idle play and claiming rewards! <br/><br/>[Level Sync, Easy Train]<br/>Train only 5 heroines and all other girls share the same levels. <br/>The hero reset function allows you to 100% get the resources back. No worries about a waste of materials!<br/><br/>[Voiced by Famous Japanese CV]<br/>Akari Kitō, Rie Kugimiya, Aoi Yuki, Sakura Tange, Yuka Iguchi, Suzuko Mimori, Ayane Sakura…and other celebrity voice actresses bring all charming girls to life! <br/>Full of story and wonderfully animated scenes with smooth sound enjoyment! Being around the girls are never boring!", "metacritic": null, "released": "2022-11-15", "tba": false, "updated": "2022-12-16T07:04:37", "background_image": "https://media.rawg.io/media/screenshots/971/9718f69e3107f1f455767fdc91a474e3_4nByx5D.jpg", "website": "https://foreveregame.com/idleplays/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Forever Entertainment Network"], "genres": ["RPG", "Card"], "publishers": ["Forever Entertainment Network"], "esrb_rating": "Everyone 10+"}