{"id": 894665, "slug": "talking-tom-time-rush", "name": "Talking Tom Time Rush", "name_original": "Talking Tom Time Rush", "description": "Run fast through the Magic Gate! Tom, Angela, Hank, Ben, Ginger and Becca dash into an awesome adventure together!<br/><br/>Talking Tom Time Rush is the all-new runner game! Tom and friends have found a Magic Gate but the Rakoonz crash the fun. They steal the Crystals and escape into a fantastic world!<br/><br/>Players join Tom and friends as they jump into wonderful worlds, explore unique side paths and discover special surprises together. It’s an epic chase after those rascal Rakoonz to recover the Crystals!<br/><br/>- All of the friends are unlocked from the beginning<br/>- Run through extraordinary worlds<br/>- Find cross-roads, side paths and surprises<br/>- Try out special vehicles<br/>- Boost your run with supersonic power-ups<br/>- Collect cool new outfits<br/><br/>Players who enjoy Talking Tom runner games such as Hero Dash and Gold Run will love Time Rush.<br/><br/>By Outfit7, creators of My Talking Tom, My Talking Angela 2 and My Talking Tom Friends.<br/><br/>This app contains:<br/>- Promotion of Outfit7's products and advertising;<br/>- Links that direct customers to Outfit7’s websites and other apps;<br/>- Personalization of content to encourage users to play the app again;<br/>- YouTube integration to allow users to watch videos of Outfit7's animated characters;<br/>- The option to make in-app purchases;<br/>- Items to purchase (available in different prices) using virtual currency, depending on the player’s progress; and<br/>- Alternative options to access all functionalities of the app without making any in-app purchases using real money.<br/><br/>Please note, we do not process all the data disclosed on the label for users under the age of digital consent. For more information, please check our Privacy Policy.<br/><br/>Terms of use: http://outfit7.com/eula/<br/>EEA privacy policy: https://outfit7.com/privacy/eea/<br/>US privacy policy: https://outfit7.com/privacy/<br/>Brazil privacy policy: https://outfit7.com/privacy-brazil<br/>Rest of the world privacy policy: https://outfit7.com/privacy/<br/>Customer support: support@outfit7.com", "metacritic": null, "released": "2022-11-29", "tba": false, "updated": "2022-12-16T08:44:26", "background_image": "https://media.rawg.io/media/screenshots/7de/7de3c2b85b8e39edd2c623702de93e30_9VbTkE0.jpg", "website": "https://outfit7.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 161, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Outfit7"], "genres": ["Action", "Casual"], "publishers": ["Outfit7"], "esrb_rating": null}