{"id": 894688, "slug": "lama-by-reiner-knizia", "name": "LAMA by Reiner Knizia", "name_original": "LAMA by Reiner Knizia", "description": "Finally, the \"casual\" card game with cult factor is now also playable as an app.<br/><br/>Every llama knows the most important rule of all: Discard all minus points! <br/>Get rid of your cards so as not to collect any chips. Do you fold, or do you hope to draw a suitable card? Decide! At the end, the winner is the one who could most casually avoid the minus points.<br/><br/>Reiner Knizia's multi-award-winning card game impresses with its simple rules and great fun:<br/>-Each player receives six hand cards.<br/>-Whoever's turn it is lays down a card. This card must be equal to or one higher than the top card of the discard pile.<br/>-You can also draw a card or pass and thus fold.<br/>-The round ends when one player discards all cards or all players have passed.<br/>-For hand cards or cards that a player still has after passing, there are minus points in the form of chips.<br/>-Whoever has got rid of all cards may hand in a 1 or 10 chip again.<br/>-After several rounds, the player with the fewest minus points wins.<br/><br/>But the app contains even more: The two spin-offs \"LAMA Party Edition\" and \"LAMA Dice\" are also included.These follow the same simple basic principles as the basic game, but offer new game elements and thus even more variety. Play all 3 modes with up to 5 AI opponents or with friends and family via Pass &amp; Play. Of course, you can also mix both in one game.<br/><br/>As a special bonus, the completely new solo mode for \"LAMA Dice\" is included as a world premiere. Set yourself the special challenge of achieving the best possible result. To achieve the highest possible scores, however, you must first unlock the 3rd level by achieving good results in the previous levels. If you succeed in this, the way to the top of the global high score list is open to you!<br/><br/>Highlights:<br/><br/>- 3 games in one app<br/>- 4 game modes with separate scores<br/>- Single-user challenges in 3 difficulty levels<br/>- Compete with players from all over the world in weekly high score lists for all 4 game modes<br/>- Collect Achievements <br/><br/>Awards:<br/>2019 Game of the Year nominee<br/>2020 GamesExpo Award in the \"best children's game\" category", "metacritic": null, "released": "2022-10-13", "tba": false, "updated": "2022-12-16T08:23:44", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b837b70b94c42709ba5c7635328de08_IBsUiOI.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 190, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["BrettspielWelt"], "genres": ["Board Games", "Card"], "publishers": ["Brettspielwelt"], "esrb_rating": "Everyone 10+"}