{"id": 894645, "slug": "my-talking-toy-virtual-slime", "name": "My Talking Toy: virtual slime", "name_original": "My Talking Toy: virtual slime", "description": "Your Squishy Pet is the best virtual slimy game for your kids. You can find a lot of activities for your pet. Your kid needs to care about Squishy every day, making sure he sleeps enough, get enough food, taking him to toilet and keeping him happy by squishing and playing games.<br/><br/>So, meet exciting brand new and unique games for kids. You should definitely try:<br/>- Slimy Ninja Cut Game. It helps to train the reaction and focus for your kids.<br/>- Plank. It develops the estimation and reaction.<br/>- Music Dance. You train the reaction and the ability to organise things. All of this in a fun way!<br/><br/>And many other games! More than 20 in one application!<br/><br/>Take care of your Squishy Pet - put him in nice clothes, some fancy accessories, different teeth and eyes.<br/><br/>Our game contains following subscription options:<br/>- Weekly with a 3-day free trial at $3.99, monthly with a 3-day free trial at $7.99, yearly with a 3-day free trial at $19.99*.<br/>- Payment will be charged to iTunes Account at confirmation of purchase.<br/>- Subscription automatically renews unless auto-renew is turned off at least 24-hours prior to the end of the current period.<br/>- The account is charged for renewal within 24-hours before the end of the current period.<br/>- Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user’s Account Settings after purchase.<br/>- The cost of renewal is equal to the value that “Apple’s App Store Matrix” determines as the equivalent of the subscription price in $USD.<br/>- Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication.<br/>- Unlimited access to our Premium features include:<br/>Unlimited content<br/>Additional rewards<br/>No ads<br/>*Prices can be different in different countries according to what 'Apple’s App Store Matrix' determines as the equivalent of the subscription price in $USD.<br/>Privacy Policy: https://pxlnd.com/privacy.html<br/>Terms of Use: https://pxlnd.com/terms.html", "metacritic": null, "released": "2022-09-27", "tba": false, "updated": "2022-12-16T07:41:04", "background_image": "https://media.rawg.io/media/screenshots/336/336ddc62dfc81165c8aa07095b4294d8_claxld3.jpg", "website": "https://pxlnd.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Pixeland"], "genres": ["Simulation", "Casual"], "publishers": ["Pixeland OU"], "esrb_rating": "Everyone 10+"}