{"id": 894748, "slug": "tornado-rampage", "name": "Tornado Rampage", "name_original": "Tornado Rampage", "description": "Game Overview:\r\n<p>In Tornado Rampage, you play as a powerful tornado with the goal of causing as much destruction as possible. You will move through different environments, such as towns and cities, and use your powerful winds to destroy buildings and other structures. The game will have a damage meter to track how much destruction you cause, and the objective is to cause as much destruction as possible before the timer runs out.\r\n</p>\r\nGameplay:\r\n<p>As the Tornado, you will have the ability to move around freely in the environment. You will use WASD or the left stick to control movement. (You can also press a button to spin faster and increase the power of your winds.) As you move through the environment, you will encounter various structures that you can destroy. These will include houses, buildings, bridges, and other structures.\r\n </p>\n<p>When you start, your Tornado will be small and weak, only being able to suck up and absorb small structures. The Tornado will continuedly grow in size by absorbing structures, causing an increase in your destructive capabilities to tackle larger structures.\r\n </p>\n<p>The game will have a damage meter to track how much destruction you have caused. The objective is to cause as much destruction as possible before the timer runs out.\r\n</p>\n\n<p>Credits: </p>\n<p>Programming:</p>\n<p>https://phatur.itch.io<br/></p>\n<p>Game Design/ Level Design:</p>\n<p>https://relicaeternus.itch.io</p>\n<p>Art:</p>\n<p>https://curly-wynvan.itch.io</p>\n<p>Gerard ( no itch page yet)<br/></p>\n<p>Valentina (no itch page yet)</p><p>Maurice (no itch page yet)</p>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-16T09:08:38", "background_image": "https://media.rawg.io/media/screenshots/e85/e855610378690becc2788bff33a43273.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 11, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Curly Wynvan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}