{"id": 894783, "slug": "esp-escudo-aprende-ciberseguridad", "name": "[ESP] ESCUDO - Aprende Ciberseguridad", "name_original": "[ESP] ESCUDO - Aprende Ciberseguridad", "description": "<p>Proyecto final de la asignatura VJ1238 Videojuegos Didácticos del Grado en Diseño y Desarrollo de Videojuegos de la Universitat Jaume I.</p>\r\nResumen\r\n\r\n\r\n<p>Escudo: Aprende Ciberseguridad es una colección de minijuegos didácticos para dispositivos móviles. Los juegos están diseñados para enseñar conceptos básicos de ciberseguridad a adultos de más de 65 años. </p>\r\nObjetivos\r\n<p>El objetivo principal de Escudo es enseñar a los usuarios algunas competencias digitales básicas recogidas en el Marc Valencià de Competències Digitals, como conocer las principales vías por las que se puede infectar nuestro dispositivo, los riesgos que afectan a los dispositivos tecnológicos, las pautas para crear contraseñas seguras, saber qué es una clave PIN o conocer el concepto de ciberseguridad. \r\n</p>\n<p>En la era digital, es de interés social que la población tenga competencias digitales básicas y esté concienciada respecto a los riesgos asociados al uso de la tecnología. Aprender ciberseguridad es una habilidad esencial que afecta a todas las personas independientemente de su edad, pero uno de los colectivos más expuestos a los problemas asociados con la tecnología es la población adulta de más de 65 años, que frecuentemente carecen de competencias digitales básicas por brecha generacional. </p>\n<p>Bajo esta premisa nace Escudo, con el objetivo de divulgar conocimientos básicos de ciberseguridad a una población vulnerable de manera no abrumadora y entretenida, aportando un espacio seguro donde aprender estas competencias.\r\n</p>\n\r\nMinijuegos\r\n\n<p><strong>Escudo tiene tres minijuegos: Contraseñas y Claves, Fraudes y Spam y Ventanas Emergentes. </strong></p>\n<ul><li><strong>Contraseñas y Claves </strong>comienza introduciendo el concepto de clave PIN, y va progresivamente enseñando al usuario pautas para crear contraseñas más seguras mediante el uso de letras mayúsculas, minúsculas, números y meta-caracteres. </li><li><strong>Fraudes y Spam </strong>muestra al jugador 7 cartas que contienen mensajes variados (SMS, WhatsApp, e-mails…). El jugador deberá arrastrar estas tarjetas a la izquierda si cree que son mensajes fraudulentos o a la derecha si cree que son mensajes legítimos. Este minijuego enseña al jugador a identificar mensajes potencialmente maliciosos. </li><li><strong>Ventanas Emergentes</strong> enseña al jugador como actuar ante los abrumadores pop-ups que pueden aparecer en sus dispositivos navegando por internet. El usuario deberá cerrar las ventanas emergentes, obteniendo puntos en el proceso.</li></ul>\r\n\r\nOpciones de Accesibilidad\r\n<p>Entre las opciones de accesibilidad orientadas al público objetivo cabe destacar:</p>\n<ul><li>Se puede ajustar el tamaño del texto</li><li>Se puede cambiar el tema (claro/oscuro)</li><li>Cándido hace uso de la tecnología TTS</li></ul>", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T09:25:05", "background_image": "https://media.rawg.io/media/screenshots/d39/d391bd9a54e4377ed1d15847898872f4.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 5, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["GoragarX", "Sinon"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}