{"id": 894709, "slug": "lightsaber-sci-gun-simulator", "name": "Lightsaber & Sci gun simulator", "name_original": "Lightsaber & Sci gun simulator", "description": "If you are a big fan of science fiction, I bet that you at least once wish to own a lightsaber or some kind of sci-fi weapon. And now, your dream can finally come true with the app Lightsaber &amp; Sci Gun Sound 🔥 . <br/>Downloading this, you can choose from more than 100 weapons included lightsaber &amp; Sci-Fi gun, and play with saber sword and sci-fi gun shot sounds would be an endless fun journey. <br/><br/>Lightsaber &amp; Sci gun simulator include saber sword &amp; sci-fi weaphones with the amazing varity of laser cut weapon sounds &amp; shotgun sounds effects. This app can simulate realistic 3D lightsaber and sci-fi gun effect with color, sounds when swing, spin or even you move slowly, the sounds is different depends on your action. Besides, you can choose color, turn on the flashlight and shake the gun as well as the sword for more realistic simulation. Enjoy stunning visual effects and custom shooting visuals and audio for each weaphones.<br/><br/>Beside using the app to enjoy realistic gunshot sounds, you can use this to play with your friends as real guns in shooting games, or prank your bestie by turning the gunshot sound on when they are sleeping would be so much fun 🤣<br/><br/>💥 HOW TO PLAY:<br/>💣 Scroll to choose the weapons on the home screen<br/>💣 Tap to get gunfire or explosion sounds.<br/>💣 Swipe to recharge<br/>💣 Free to adjust:<br/>- Select Gun Simulator Mode: Single Shot, Burst Mode, Auto Shot, and Shake<br/>- Select Diversity Environment: Rain, Snow, Thunder<br/><br/>💥FEATURE OF LIGHTSABER GAME &amp; SCI-FI GUN SOUND LASER CUT<br/>🔫Lightsaber game &amp; shotgun sounds effects app offers you a huge collection of gun shot sounds from different types of laser cut.<br/>🔫 Each machine gun or weaphones has an unlimited amount of ammo.<br/>🔫 Realistic light saber laser cut/ lifesaver or weaphones firing animation effect.<br/>🔫 Easy to choose different Light saber weapon sounds &amp; shotgun sounds effects.<br/>🔫 Choose your favorite laser cut weaphones, you may play battle games with your friends and hear different sounds of laser cut weaphones, and gun shot sounds.<br/>🔫 100+ lightsaber gun Weaphones &amp; various weapon sounds. Including more than 100 machine gun weaphones to choose from.<br/>🔫 Download and install the Machine gun Weaphones app. Choose laber sword weaphones or gunshot and play with your friends this Lightsaber game &amp; shotgun sounds effects<br/>🔫 Great light saber laser cut Sound Effects &amp; gun shot sounds.<br/><br/>👉Please note! Lightsaber &amp; Sci-fi Gunshots Sounds Simulator is the joke and game. It isn't really a dangerous weapon. It won't harm anyone. The app is created for play and fun!<br/>Enjoy the simulation of laser battles with this application and become a real space soldier!", "metacritic": null, "released": null, "tba": false, "updated": "2022-12-16T08:50:02", "background_image": "https://media.rawg.io/media/screenshots/bc8/bc85b56e75051e30dcc9ad3a3540d16c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 238, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["DINO Global"], "genres": ["Simulation"], "publishers": [], "esrb_rating": "Everyone"}