{"id": 894861, "slug": "hell-miner", "name": "Hell Miner", "name_original": "Hell Miner", "description": "<h3>introduction:</h3><br/>\"Do you want to fulfill your wish? Then come to hell....\"<br/><br/>\"Collect enough ore and I will help you achieve any wish....\"<br/><br/>The inexplicable phrase appeared on your computer screen, but you still clicked in curiously, marking the beginning of an adventure. Six demonic girls take turns appearing, attacking, surrendering, betraying, and saving without any reason. A good scene begins And you ultimately ruled the entire hell and became the king of hell.<br/><br/>You, who finally collected all the minerals, expressed your final wish...<h3>Role Introduction:</h3><br/><br/>Lucifer, the first level demon.<br/>Responsible for cleaning up the humans who have entered hell.<br/><br/><br/>Asmodeus, the second level demon.<br/>Strength is not very strong, and relationship with Lucifer is not very good.<br/><br/><br/>Satan, the third level demon.<br/>The leader of the demons has a bad temper.<br/><br/><br/>Mammon, the demon of the Abyss.<br/>Pray for God to save oneself and give everything to the Lord.<br/><br/><br/>Belphegor, the demon of the Abyss.<br/>Lazy demon, dislikes trouble and likes to play dead.<br/><br/><br/>Beelzebub, the demon of the Abyss.<br/>Demons who have been contaminated and become insane.<h3>Gameplay:</h3><br/>Drawing on the classic gameplay of gold miners, modifications have been made based on this.<br/><br/>Players need to use the space or S key to operate the hook and hook the gold resources on the map to strengthen their weapons and survive under monsters and demon girls.<br/><br/>The entire game has multiple levels of hell, with a demon girl guarding each level of hell. Players need to defeat and conquer these demons in order to go to the next level.<br/><br/>Each layer of hell will unlock new weapons, items, and skills.<br/><br/><br/>Features:<br/><br/>Leisure is simple, and your character constantly strengthens with your actions<br/><br/>Devil girls with vastly different personalities are waiting for your strategy.<br/><br/>The clearance data of each layer will be applied to the next layer.<br/><br/>A selective plot, where each choice hides different information.", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2023-12-08T08:40:55", "background_image": "https://media.rawg.io/media/screenshots/628/628ecb03676c6c3696cb7688431ae7f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Delta Rayquaza", "Easy S Studio"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["Easy S Studio"], "esrb_rating": null}