{"id": 894909, "slug": "dungeon-crawl-v20-freeware-edition", "name": "Dungeon Crawl v2.0: Freeware Edition", "name_original": "Dungeon Crawl v2.0: Freeware Edition", "description": "<p>Shoemaker's Last proudly presents: Dungeon Crawl v2.0: Freeware Edition!</p>\n<p>CAN YOU BECOME A LEGEND?</p>\n<p>Welcome to Dungeon Crawl, brave adventurer! Many before you have descended into the dark dungeon, never to be heard from again. The few who have returned tell tales of horror and despair – but also of great treasure and magic. Do you have the courage to try?</p>\n<p>Dungeon Crawl is a real time fantasy role-playing game where you control a character that you create. As you direct your character into the dungeon depths, over time you will grow stronger, gain more powerful spells and find better equipment. If you survive, that is.<br/></p>\n<p>LOADING INSTRUCTIONS</p>\n<p>Dungeon Crawl will run on a Tandy Color Computer 1, 2 or 3 with a minimum of 64K RAM. The game is provided as two DSK images: A Play Disk and a Map Disk.</p>\n<p>If you have a CoCoSDC or DriveWire configuration, mount the Play Disk into drive 0 and the Map Disk into drive 1.</p>\n<p>With both disks mounted, type:</p>\n<p>RUN “RUNME” and press [ENTER].</p>\n<p>Dungeon Crawl uses the PMODE 4 hi-res screen but does not utilize the red/blue artifact colors in its artwork. While the game looks just fine on any video monitor or TV, it looks best with no artifacting, such as on a Color Computer 3 using an RGB monitor. If you have a CoCoVGA installed in your CoCo 1 or 2, disable artifact colors by pressing the right-hand CoCoVGA switchboard button five times after the title screen has loaded.</p>\n<p><strong>This game is freeware, and so is made available to you completely free of charge.</strong></p>\n<p>*Version 2.0 uses updated tile graphics based on the WONDERDOT - RPG Dungeon Tileset by graphics artist Pita, purchased and licensed.  Brusier, ghost, templar, ghoul, dwarf, wraith, cavebear, griffin, giant, spectre, wizard and dragon monster graphics in the game are based heavily on graphics from the game Wizardry by Sir Tech Software.  Game code and game play is based on Telengard (C) 1982 by Avalon Hill.</p>", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T10:17:44", "background_image": "https://media.rawg.io/media/screenshots/bd6/bd649aedc56f6d7790e25130e3c80e85.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Shoemaker's Last Software"], "genres": [], "publishers": [], "esrb_rating": null}