{"id": 895086, "slug": "hurry-up-snake", "name": "Hurry Up Snake", "name_original": "Hurry Up Snake", "description": "<p>Hurry Up! Snake<br/></p>\n<p>This is the first game developed after learning Unity.</p>\n<p>Press the move button or WSAD keys to avoid obstacles and eat food within the time limit.</p>\n\n<p>【Game Introduction】</p>\n<p>- Avoid obstacles by pressing the up(W)▲/down(S)▼/left(A)◀/right(D)▶ movement buttons and eat food🍚 within the time limit⏱.</p>\n<p>- Aim for stage 345 and challenge for the highest score🏆.</p>\n<p>- The language of the game is Korean🇰🇷/English🇺🇸. It can be changed by pressing the button.</p>\n\n<p>【Home Screen Description】</p>\n<p>- Play🎮 - A total of 345 stages are provided, and you can start from stage 1 and repeat the completed stage at any time.</p>\n<p>- Easy🙂/Normal😐/Hard🙁 - Difficulty and time limit⏱: Easy is given 40 seconds🕒, Normal is 30 seconds🕑, and Hard is 20 seconds🕜.</p>\n<p>- Player - You can set the player's face🦲 and color🟥🟧🟨🟩🟦🟪. Some🔒 faces can be obtained by completing🔓 certain stages.</p>\n<p>- Sound🎵 - You can hear various sounds/effects during the game.</p>\n<p>- Music🎶 - You can listen to exciting music while playing the game.</p>\n<p>- Vibrate📳 - The snake vibrates when it hits an obstacle or eats prey.</p>\n<p>- Language(flag)🏴 - We provide two languages: Korean🇰🇷/English🇺🇸.</p>\n\n<p>【Game Progress】</p>\n<p>- If you press the play🎮 button, the stage selection screen appears, and you can proceed from stage 1.</p>\n<p>- A snake's🐍 life❤️ starts with the first five.</p>\n<p>- If you eat all the numbers from 1 to 9, you will be moved to the next stage.</p>\n<p>- If you hit💥 an obstacle or the body of a stake🐍, your life❤️ is reduced by 1, and when it reaches 0, the game is over.</p>\n<p>- Completed🔓 stages can be selected and redone at any time.</p>\n<p>- You can get Star★ +1 only when you first complete the maze-type stage every 5 rounds. (However, if you complete the stage marked with *, you can repeatedly get Star +1.)</p>\n<p>- If you earn a star★, you can continue🔜 (keep score) at the end of the game.</p>\n<p>- You will get +1 Life❤️ every time you complete a 5 round stage.</p>\n\n<p>【Stage composition】</p>\n<p>- Stages 2 through 98 are made of 1 to 21 lines─.</p>\n<p>- In stages 99 to 142, English (alphabet) comes out, the corresponding English (alphabet) is read, and the Korean interpretation of English words is also read.</p>\n<p>- In stages 143 to 204, Korean (Hangul) comes out, the corresponding Korean (Hangul) is read, and the English interpretation of Korean words is also read.</p>\n<p>- From stage 132 to 142, try I LOVE YOU, THANK YOU, I'm HAPPY, I'm SORRY, I MISS YOU to convey your heart to the other person.</p>\n<p>- From stages 178 to 204, use I Love You, Thank You, I'm Happy, Congratulations, I'm Sorry, I Miss You to convey your feelings to the other person.</p>\n<p>- Stages 206 to 243 are made of several squares■ of different sizes.</p>\n<p>- Stages 244 to 345 are made of 1 square■. (The difficulty increases gradually)</p>\n\n<p>【Game Over】</p>\n<p>- Game tips appear randomly.</p>\n<p>- You can check the current stage, current score, and the current number of stars★.</p>\n<p>- You can check the highest stage, the highest score of the current difficulty.</p>\n<p>- Home🏠 - Go to the home screen.</p>\n<p>- Stage Select▦ - You can check stages 1 to 345, and you can select the completed🔓 stage again at any time. Locked🔒 stage cannot be executed</p>\n<p>- Replay🔁 - You can restart the stage you last finished. On restart, the score starts at 0.</p>\n<p>- Continue🔜(1 Star★ Required) - You can resume the last stage you finished. It starts with the score at the end of the game.<br/></p>", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-16T11:32:26", "background_image": "https://media.rawg.io/media/screenshots/556/556f8c01b41bbd575e48f82d5b73575d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["aimfordream"], "genres": ["Action"], "publishers": [], "esrb_rating": null}