{"id": 895133, "slug": "raiders-of-ruin-itch", "name": "Raiders of Ruin (itch)", "name_original": "Raiders of Ruin (itch)", "description": "<p><strong>Raiders of Ruin</strong> takes the thrill of battling a mighty MMO raid boss and distils it down into a single-player experience. Study your enemies, assemble your party, and execute your strategy as you face off against dozens of challenging foes in this turn-based fantasy RPG.<br/></p>\n<p><strong>Summary</strong></p>\n<p>In Raiders of Ruin, you guide a group of 5 champions sent on a quest to seize the throne of the Underworld itself. Along the way, you will encounter many deadly bosses and engage in challenging, strategic turn-based combat. You decide how to build your party, mixing-and-matching between 9 different classes, each with drastically different strengths and weaknesses. You can change classes any time, so experiment frequently to craft the perfect strategy for each enemy!</p>\n<p><strong>Features</strong></p>\n<p>Over <strong>40 boss fights</strong>, each with their own unique mechanics. Expect multiple phases, colourful gimmicks, and ruthless attacks.</p>\n<p><strong>No game-overs:</strong> Your progress is saved after every battle. Defeat simply means a chance to try again.</p>\n<p>Study your enemies ahead of time by viewing the<strong> Boss Log</strong><strong>,</strong> where you can find a record of your greatest foes and a description of their attacks. You must prepare to counter their strategies with a plan of your own!</p>\n<p><strong>Class-based combat system</strong> that's simple to learn, hard to master. Swap classes before any battle to arm yourself for the fight ahead. Find a combo that works for you and stick to it, or experiment frequently to find the perfect squad.</p>\n<p><strong>9 main classes to choose from. </strong>Need more firepower? Swap that Paladin for a Wizard. Expecting a long fight? Try poisoning your foe with a Rogue.</p>\n<p><strong>Multiple subclasses</strong> for most classes, providing even more customization. Should your Ranger be a Hunter, or a Survivalist?</p>\n<p><strong>Innovative rematch system</strong> that replaces traditional level-grinding. Instead of fighting normal enemies repeatedly, you will occasionally be given the opportunity to rematch a boss of your choosing for a second chance at its rewards (though this system is entirely optional).</p>\n<p><strong>MIDI soundtrack</strong> inspired by PC games of the early 2000's, with some modern twists.</p>\n<p>A <strong>backpack</strong> that might be alive?</p>", "metacritic": null, "released": "2022-12-06", "tba": false, "updated": "2022-12-16T11:52:00", "background_image": "https://media.rawg.io/media/screenshots/74f/74f2cdbe70fe9d81eaceee80dbd21b8a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 145, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["RaidersOfRuin"], "genres": ["RPG", "Puzzle"], "publishers": [], "esrb_rating": null}