{"id": 895215, "slug": "baldis-basics-challenges-demo-reuploaded", "name": "Baldi's Basics - Challenges Demo (Reuploaded)", "name_original": "Baldi's Basics - Challenges Demo (Reuploaded)", "description": "Baldi's Basics Plus is now available!\r\n<strong>Baldi's Basics - Challenges Demo</strong>\n<p>Ever since the Baldi's Basics Kickstarter was successfully funded, I've been working on a full version of the game, now officially titled Baldi's Basics Plus! This demo shows a new mode that will be coming to Baldi's Basics Plus, the challenge mode! There are three challenge maps to experience in this demo, but there will be many more to unlock in Baldi's Basics Plus!\r\n</p>\r\nSpeedy Challenge\r\n<p>It's just you and Baldi in this challenge. The catch is, both of you move super fast! Can you think fast enough to collect 25 notebooks and escape the school?\r\n</p>\r\nStealthy Challenge\r\n<p>You've snuck in school after hours! Surely Principal of the Things will be after you. Use dirty chalk erasers, lockers, and your map to avoid being seen and collect 7 notebooks.\r\n</p>\r\nGrapple Challenge\r\n<p>You're legs might be broken, but thankfully you're equipped with an infinite use grappling hook! See if you can outwit Baldi and his friends when this is your only way to move!\r\n</p>\r\nThis game is still in development!\r\n<p>Remember, this demo is for a game that is still in development, which means that it will likely show the signs of something that is still a work-in-progress. Not all planned features are in the game yet, even some that were in the original game haven't been implemented yet, since I've been prioritizing other areas of development. So if you see something that seems unfinished, that's because it is!\r\n</p>\r\nThis game is still a horror game!\r\n<p>If you've never heard of Baldi's Basics before, it's important to know that this is not actual edutainment, but it is, in fact, a tongue-in-cheek horror game. It's family friendly, but still includes some things that could scare players. This demo <strong>is</strong> relatively light on horror-type content though, and the full game will eventually have much more than what is seen here.\r\n</p>\r\nControls\r\n<p>WASD - Move\r\n</p>\n<p>Mouse - Turn\r\n</p>\n<p>Shift - Run\r\n</p>\n<p>Space - Look behind you\r\n</p>\n<p>Tab - View quick map\r\n</p>\n<p>M - View advanced map\r\n</p>\n<p>Left click - Interact\r\n</p>\n<p>Right click - Use items\r\n</p>\n<p>Scroll wheel - Change items\r\n</p>\n<p>Use the control mapper to change these controls to your liking!\r\n</p>\r\nSettings\r\n<p>In the game you can find settings by clicking on the options option. Here you can change mouse sensitivity and volume, re-map the controls to your liking, and select window and resolution settings.\r\n</p>\r\nFAQ\r\nIs there a Mac OSX or Linux version of this demo?\r\n<p>Unfortunately, due to changes made in the latest versions of Mac OSX, creating Mac builds is a lot more time consuming. As such I likely won't be supporting Mac OSX with this demo. Baldi's Basics Plus <strong>will</strong> be supported on Mac however.\r\n</p>\n<p>Currently I am having some errors trying to create the Linux build of the demo. I hope to have them resolved soon!\r\n</p>\r\nWhere are the random events? Why are there no secrets? Why are all the faculty only rooms so empty?\r\n<p>If you have a question like this, the answer is simple: The game isn't finished yet, and this demo doesn't include everything that's been developed for Baldi's Basics Plus. Some planned features I still haven't developed simply because other things have taken priority. Some features and characters that are currently ready aren't in this demo simply because I didn't feel they were necessary for it.\r\n</p>\r\nCan I make mods of this demo?\r\n<p>I love seeing all the mods people make of the original game, but with this demo being for what will be a paid piece of software, I would prefer if any mods created for this were distributed without redistributing the game itself. What I mean is, any mods created for this should be shared by sharing the original files <strong>you</strong> created, with instructions that explain how users can install those files into their copy of the demo. This is something that will be absolutely necessary for mods of the full game when it releases.\r\n</p>\r\nDoes this demo have a secret ending?\r\n<p>I'll save you all the trouble and confirm that this demo does <strong>not</strong> have a secret ending. No unlockables either. The full game will have plenty of secrets though!\r\n</p>\r\nThis isn't very scary. Is this still supposed to be a horror game?\r\n<p>This demo definitely doesn't have much focus on being creepy, mostly just on gameplay. In the full game, I plan on ensuring the game has more creepy elements to it, although I don't think it will ever be \"scary\". I'm going to go light on the jump scares (The Baldi jumpscare barely even counts as a jumpscare due to how predictable it is) and focus more and giving the game a creepy and unsettling atmosphere.\r\n</p>\r\nWill this demo be released for any mobile devices?\r\n<p>Nope, I have no plans to release this on mobile devices.\r\n</p>\n\n<p>\n</p>\n<p><em>Baldi's Basics merch is available here!</em>\n</p>\n\n<p>(I DO NOT OWN THIS GAME, I AM JUST RE-UPLOADING IT SO PEOPLE CAN PLAY THIS AGAIN, ALL CREDIT GOES TO MYSTMAN12 FOR CREATING THE GAME AND MAKING THE ORIGINAL PAGE)</p>", "metacritic": null, "released": "2022-12-14", "tba": false, "updated": "2022-12-16T12:28:15", "background_image": "https://media.rawg.io/media/screenshots/697/6973b5f697422b0d2b0f9cfac2c7ad36.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WowzaboiModder"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}