{"id": 8952, "slug": "nyan-3d", "name": "NYAN 3D", "name_original": "NYAN 3D", "description": "NYAN 3D is a procedurally generated space adventure featuring feline Heroes from our beloved series of tubes: The Internets! We made NYAN 3D completely free so everyone can enjoy it. No ads. No lite version. No popups. A lot of hard work went into creating NYAN 3D, so if you want to see more updates and new games from us please consider buying the $0.99 Support the Developers In-App Purchase. Help us spread the word, rate and review NYAN 3D!<br/><br/>Check out the Official Game Trailer at:<br/>http://www.nyan3d.com<br/><br/>• A PROCEDURALLY EVOLVING UNIVERSE!<br/>NYAN 3D randomly generates unique and challenging obstacles each round, so you’ll never play the same level twice. Difficulty automatically adjusts based on your overall performance.<br/><br/>• DEFLECT OR DODGE OBSTACLES!<br/>Blue tokens activate a shield to deflect obstacles or play dangerously and string together near miss combos for bonus points.<br/><br/>• ENGAGE NYANSPEED!<br/>Collect three gold tokens to go NYANSPEED! During this burst of speed, your Hero will deflect anything that get in the way.<br/><br/>• UNLOCK NEW HEROES!<br/>Heroes can be unlocked through various achievements: Travel over one million meters, collect a thousand tokens, near misses, and much more.<br/><br/>• COMPETE FOR GLOBAL DOMINATION!<br/>Dodge your way to the top! Your global rank is updated after each round. Compete in various Game Center leaderboards for both hardcore and casual players.", "metacritic": null, "released": "2011-10-14", "tba": false, "updated": "2019-10-22T14:30:12", "background_image": "https://media.rawg.io/media/screenshots/bb8/bb88d65ace3be451d6448299cf01ba19.jpeg", "website": "http://www.nyan3d.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 148, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Reactor"], "genres": ["Action", "Arcade"], "publishers": ["Reactor"], "esrb_rating": "Everyone 10+"}