{"id": 895450, "slug": "begins-with-dust", "name": "Begins With Dust", "name_original": "Begins With Dust", "description": "<p>    A Bite-Size Project From MindWideGames</p>\n<p>  Pick up your Hammer &amp; Nails, &amp; get ready for a unique City-Builder experience! Big-Voice has created the Settler Clans &amp; the Realms they resign in. Big-Voice has granted them not only the power of Knowledge &amp; Growth, but also unique lands for each of the Clans, with bountiful resources to build Great Cities! Unfortunately, things did not go as planned! With panic setting in for the Clan's future, Big-Voice had one more idea to try &amp; save the Clans! Thus Dust is born! Dust is the embodiment of Big-Voice's true essence. As Dust you are to travel to each Clan's Region, using your endless knowledge to help them build successful Civilizations!</p>\n<p>  Construct Civilizations in 4 unique biomes,  all while balancing your resources . Gameplay includes turn base waiting mechanics instead of a timer for Collecting Resources &amp; Completing Goals, with a more puzzle-type gameplay. Watch out for City Disasters happening on random days from buildings catching fire, to settlers being eaten by sharks! The chaos doesn't stop there, Disaster Imps do not appreciate Dust's efforts, &amp; plan on destroying him &amp; the Clans! Get your competitive fix in multiplayer VS mode, where you can go head to head with your friends, in couch Co-Op gameplay!</p>\n<p>Each file download comes with 16 Free Desktop Backgrounds of the AI artwork featured in the Game.</p>", "metacritic": null, "released": "2022-12-14", "tba": false, "updated": "2022-12-16T14:09:20", "background_image": "https://media.rawg.io/media/screenshots/430/430bd6802b33fe2906486f2c9e1dc588.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MindWideGames"], "genres": ["Strategy", "Puzzle"], "publishers": [], "esrb_rating": null}