{"id": 895648, "slug": "djinns-destiny", "name": "Djinn's Destiny", "name_original": "Djinn's Destiny", "description": "Cette lampe est magique\r\nContrôles\r\n<p>Souris/Toucher</p>\r\nComment jouer\r\n<p>Vous devez faire grandir votre population le plus possible.</p>\n<p>Pour cela, vous devez placer des habitations.</p>\n<p>Cependant, la plupart des bâtiments que vous placez ont besoin d'eau pour fonctionner. Dans le désert, il faudra compter sur la pluie et le génie.</p>\n<p>Pour alimenter un bâtiment en eau, il faut le sélectionner, puis cliquer sur une source d'eau à proximité.</p>\n<p>Les puits se remplissent grâce à la pluie.</p>\n<p>Pour faire travailler les habitants, il faut sélectionner le champ/la carrière et cliquer sur +.</p>\n<p>Pour renvoyer un travailleur dans son habitation, il faut cliquer sur le -.</p>\n<p>Attention, les villageois ne seront pas content s'ils ne sont pas suffisamment nourrit ou s'ils manquent d'eau.</p>\n<p>Quand il ne pleut pas, des feux peuvent se déclarer, vous devez alors les éteindre en cliquant dessus.</p>\r\nSynopsis\r\n<p>Une vieille lampe à huile est trouvée par une fillette au beau milieu d’un désert aride. Voulant la nettoyer, elle la frotta avec la manche de sa tunique, quand tout à coup, la lampe se mit à vibrer.</p>\n<p>Une épaisse fumée verte s’échappa alors de l’objet et monta haut dans le ciel, devant la jeune fille, apeurée.</p>\n<p>La fumée tourna et tourbillonna autour d’elle tandis qu’une silhouette se révèla au cœur de ce maelstrom. C’était un génie !\r\n </p>\n<p>« Jeune fille, tonitrua la créature avec une voix rocailleuse. Tu as appelé le génie de la lampe, tu as donc droit à trois vœux. Que souhaites-tu ? »\r\n </p>\n<p>La fillette avait toujours vécu dans le désert, manquant toujours d’eau, de sécurité, de confort. Elle décida donc de dire :   </p>\n<p>« Génie ! Je souhaiterais qu’il pleuve dans ce désert afin que ma famille puisse vivre correctement de l’agriculture. »\r\n </p>\n<p>Un coup de tonnerre retentit alors et un énorme éclair fendit le ciel pour venir s’écraser aux pieds de la jeune fille. Puis, une pluie fine vint rafraîchir son corps brûlant.\r\n </p>\n<p>« Quel est ton deuxième souhait ? Maugréa le génie. »\r\n </p>\n<p>La fillette avait plus que tout envie que ses amis et sa famille vivent dans la sécurité. Elle demanda alors au génie.\r\n </p>\n<p>« Génie, pour mon deuxième vœu, je souhaite que ma famille et mes amis du désert puissent vivre en sécurité dans une grande maison. »\r\n </p>\n<p>Le génie leva les bras au ciel et des briques se créèrent dans une zone argileuse toute proche. Dans un fracas assourdissant, les briques se superposèrent et bientôt, un bâtiment fut érigé.\r\n </p>\n<p>Alors que la poussière retombait, le génie ajouta.\r\n </p>\n<p>« Voici venu le temps de ton dernier vœu. Choisis-le, je l’exaucerais et m’en retournerai dans ma lampe. »\r\n </p>\n<p>La jeune fille regarda la belle maison à côté d’elle, vit que de l’herbe commençait à pousser tout autour grâce à la fine pluie magique puis elle prit la parole.\r\n </p>\n<p>« Génie, mon dernier souhait serait que tu offres à tout les habitants du désert les mêmes cadeaux que ceux que tu viens de me faire, afin que ma civilisation puisse prospérer. »\r\n </p>\n<p>Le génie se sentait floué, il pensait pouvoir retourner dormir au moins quelques centaines d’années. Au lieu de cela, il allait devoir s’occuper de donner aux habitants du désert ce dont ils allaient avoir besoin pour prospérer.\r\n </p>\n<p>« Soit, soupira-t-il. Si tel est ton souhait, je m’exécutes... »\r\n</p>\r\nCrédits et infos\r\n<p>Jam de l'avent ayant pour thème : \"Cette lampe est magique\".</p>\n<p>Réalisé en 20h.</p>\n<p>Merci à FL8.tv pour la musique et les sons.</p>", "metacritic": null, "released": "2022-12-13", "tba": false, "updated": "2022-12-16T15:38:46", "background_image": "https://media.rawg.io/media/screenshots/3ae/3ae54932b4be2fb0a1a5c22ac5eaf664.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 47, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Fax37"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}