{"id": 895833, "slug": "escape-or-ruin", "name": "Escape or Ruin", "name_original": "Escape or Ruin", "description": "<p>You and your research crew have been trapped inside a cave. Upon further inspection, you realize that the artifact In front of you requires 4 crystals. Your research tells you that within the 4 rooms of this cave hold those crystals. You must solve the puzzle in each room, collect the crystals, and escape, or face becoming another part of this ruin.</p>\n\n<p>Puzzle Guides-\r\n</p>\n<p><strong><em>Exploration Puzzle:</em></strong> The Exploration Puzzle is a large open room made up of various small forests, toppled pillars, and raised platforms. On the side of the large platform straight across from the entrance of the puzzle the player will notice a passageway that is currently blocked that goes into the platform. This passage leads to a case that holds the crystal the player requires and can only be opened by completing three tasks. To open it the player must look for unlit torches and interact with them. Unlike other torches, they are found on the side of tree with 2 being on the lower area and one found above the door. When a lever is pulled a boulder will go down and a cube with faces will appear. The faces can be rotated and when all 3 faces are rotated the correct way the main door will open.</p>\n<p><em><strong>Maze Puzzle:</strong></em><strong><em> </em></strong>This Maze Puzzle is a large maze separated into two sections. As the player enters, they will notice a sign near the corner advising them to hit the pressure plates. There are six pressure plates in total with three in each section, and one of those three pressure plates unlocks the door to reach other sections of the maze. The correct pressure plate can be distinguished by a lighter color than the rest. The player must find the correct pressure plate in each section to open all the doors that will lead them right to the crystal.<br/></p>\n<p><strong><em>Slide Puzzle:</em></strong> The Slide Puzzle is just the same of the classic toy puzzle of the same name. Any pieces adjacent to the empty location can slide to that spot using the arrow keys. On the side walls in the room there are large carvings showing what the puzzle should look like when it's finished. Use them as a guide when solving the puzzle. When the pieces are in right spot they glow green and when they are in the wrong spot they glow red. Once all the pieces are placed in the right spot, the door behind they rock will open and allow access to the crystal.</p>", "metacritic": null, "released": "2022-12-13", "tba": false, "updated": "2022-12-16T16:59:29", "background_image": "https://media.rawg.io/media/screenshots/eb5/eb5ed49776d3ed8b2ec86d31cf225ccc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 147, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Aedwards4", "monafowo", "JTGames02", "tiltedchatot"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}