{"id": 895960, "slug": "the-frost-itch-somesortofgoblin-farquad_e-endspeci", "name": "The Frost (itch) (SomeSortOfGoblin, farquad_e, EndSpeciesism, parfith, bobross77, MattBiddle, Ninbar01, Cieran McConaghey)", "name_original": "The Frost (itch) (SomeSortOfGoblin, farquad_e, EndSpeciesism, parfith, bobross77, MattBiddle, Ninbar01, Cieran McConaghey)", "description": "<p>The Frost is situated in a desolate, war-torn environment located between Finland and Russia, known as the Island of Vyborg. The land and its Isles were previously under the rule of Finland, however in search of more land to call their own, Russian forces were quick to invade in an attempt to take over control. As the player, you are dropped  into Vyborg as an ally of Finland but hear of an untested chemical attack launched by the Russian forces on the Islands. With destruction and poisoning all around you upon landing, you are left with no choice but to loot, extract and survive whilst clearing out and maintaining habitable areas. The focus of the game revolves around combat and survival, with threats from both PVP and PVE enemies.</p>\n<p>As the player, you will begin on a starting island that is inaccessible to other players, and will solely belong to you. From this island you will be taken to and from the larger Islands of Vyborg via boat. This boat is controlled by an in-game AI ally. Once on the larger Islands, you will have a limited amount of time to explore, discover, loot and engage in combat, should you choose to. Within the limited amount of time allotted to the player, you will also have to call an extraction and get yourself to the highlighted extraction point shown to you on your map. The signal for extractions will be visible to AI and players and therefore could pose a threat to the player as they will have to hide, attack or run whilst waiting for their extraction to be complete (AI ally to arrive by boat to the given area on the map).\r\n</p>", "metacritic": null, "released": "2022-12-13", "tba": false, "updated": "2022-12-16T17:54:51", "background_image": "https://media.rawg.io/media/screenshots/167/167ad004cbce6bb3ec5dee0305513d79.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 130, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bobross77", "SomeSortOfGoblin", "farquad_e", "EndSpeciesism", "MattBiddle", "Ninbar01", "parfith", "Cieran McConaghey"], "genres": [], "publishers": [], "esrb_rating": null}