{"id": 89598, "slug": "dmbx-mountain-biking", "name": "DMBX - Mountain Biking", "name_original": "DMBX - Mountain Biking", "description": "Go fast, show incredible tricks and earn coins – that’s DMBX–Mountain Biking in short words !<br/><br/>*** Don't miss out on our brand new games DMBX 2.5 and DMBX 2.6 ***<br/><br/>DMBX–Mountain Biking is a fresh mix of downhill racing and trick challenges featuring 10 amazing &amp; unique bike trails with 30 time-, coin- and score challenges. Earn coins to access faster bikes and clear the score challenges to unlock new characters with more power. Each character has his own style and a unique, special trick in his/her repertoire !<br/>The game is split in a QuickPlay mode and the Career mode. It`s up to you if you just want to go for a quick ride or improve your progress down the line.<br/><br/>Don`t worry if your last day on the bike is well in the past though - anyway you don`t have to pedal yourself. You can play either the tutorial- or the training level to get a feeling for the gameplay and to learn the basics of this amazing game.<br/><br/>Race downhill in the desert, throw down incredible tricks on the pump track or earn coins on the moon – DMBX gives you all the possibilities.<br/><br/><br/>*** FEATURES ***<br/>- 10 unique levels<br/>- 30 challenges<br/>- 8 individual male and female characters<br/>- individual special trick for each character<br/>- 8 different mountain bikes to choose from<br/>- „career\" and „quick play\" modes<br/>- replay option<br/>- tutorial level<br/>- training level<br/>- „realistic“ 3D graphics<br/>- HD retina-display support (iPhone 4/iPod touch 4)<br/>- game center achievements &amp; leaderboards<br/><br/><br/><br/><br/>VISIT US – randerline.com <br/>FOLLOW US – twitter.com/randerline  <br/>LIKE US – facebook.com/randerline  <br/>WATCH US – youtube.com/randerline  <br/><br/><br/>*** COMPATIBLE DEVICES ***<br/>DMBX - Mountain Biking is compatible with 3rd (32GB &amp; 64GB) and 4th generation iPod touch, iPhone 3GS, iPhone 4, iPad and iPad 2.<br/><br/>***IMPORTANT NOTICE***<br/>If you experience any problems with the game or in case you have any questions or comments, please contact us directly - support(at)randerline.com. You may also contact us by visiting our website randerline.com. We will read and account for all reviews here, but we can only answer and help you via email. Thank you.", "metacritic": null, "released": "2011-07-27", "tba": false, "updated": "2019-10-22T14:20:07", "background_image": "https://media.rawg.io/media/screenshots/fe4/fe4d7a46074edd46c8c60e38cd147db7.jpg", "website": "http://www.rndrln-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["randerline"], "genres": ["Sports", "Racing"], "publishers": ["randerline"], "esrb_rating": "Everyone 10+"}