{"id": 89609, "slug": "mytp-skateboarding", "name": "MyTP Skateboarding", "name_original": "MyTP Skateboarding", "description": "Welcome to the streets of Randertown - no crazy bling bling, simply amazing and real skateboard action! Grab your board and explore the huge playground fully packed with rails, ledges, stairs, skateparks, half- and quarter pipes, big airs and sheer endless run possibilities!<br/><br/>Find the „Competition“ and „Own the Spot“ locations where you have to master the challenges in order to improve your overall skills or just skate through the streets and parks and show the world your best tricks utilizing the instant replay option which lets you share your action immediately.<br/><br/>Don`t worry if your last day on the skate is well in the past though – easily learn the basics of the game using the in-game tutorial. So what are you waiting for? Gear up and let`s go!!<br/><br/><br/>FEATURES<br/>- Full skateboarding action<br/>- One huge level with several skateparks, halfpipes, bowls and much more!<br/>- „Competition“ and „Own the Spot“ challenges<br/>- Male/Female character with 6 unique styles<br/>- 19 unique skateboards<br/>- Free skate mode<br/>- Tilt- or virtual joystick navigation<br/>- MFI Controller support<br/>- Replay with video and picture export<br/>- 3D Touch support<br/>- Game Center leaderboard<br/>- English language<br/><br/><br/>3D TOUCH<br/>If you grab your board, you can press more deeply / harder to tweak and style your tricks.<br/><br/><br/>MFI CONTROLLER<br/>Please visit www.rndrln-games.com/MyTPSKB1/MFI/ to get more informations about the input mapping.<br/><br/><br/>TRICK POSSIBILITIES<br/>Ollie and Nollie: Kickflip, Heelflip, Pop Shuvit, FS Pop Shuvit, Varial Kickflip, Varial Heelflip, Hardflip, Inward Heelflip, 360 Flip, Laser Flip, 360 Hardflip, 360 Inward Heelflip, Kickflip Underflip, Heelflip Underflip, Dark Catch<br/>Grinds and Slides: 50-50, 5-0, Nosegrind, Boardslide, Noseslide, Tailslide, Crooked, Overcrooks, Salad, Suski, Blunt, Noseblunt, Willy, Over Willy, Smith, Feeble, Darkslide<br/>InAir Grabs: Nosegrab, Tailgrab, Seatbelt, Melon, Method, Mute, FS Grab, Stale, Crail, One Foot, Judo, FS One Foot, Frigid Air, Airwalk, Tailwalk, No Foot<br/>InAir Tricks: Kickflip, Backfoot Kickflip, Heelflip, Backfoot Heelflip, Pop Shuvit, FS Pop Shuvit, Footplant, Fastplant<br/>Misc: Boneless, Beanplant, Fastplant, Footplant, No Comply, Hippy Jump, Manual, Powerslide, Revert<br/><br/><br/>VISIT US – randerline.com<br/>FOLLOW US – twitter.com/randerline<br/>LIKE US – facebook.com/randerline<br/>WATCH US – youtube.com/randerline<br/><br/><br/>COMPATIBLE DEVICES<br/>MyTP Skateboarding is compatible with 6th generation iPod touch, iPhone 5s, iPhone SE, iPhone6, iPhone 6 Plus, iPhone 6s, iPhone 6s Plus, iPhone 7, iPhone 7 Plus, iPad Air, iPad Air 2, iPad mini 2, iPad mini 3, iPad mini 4 and iPad Pro.<br/><br/><br/>OPTIMIZED<br/>MyTP Skateboarding graphics are optimized for 6th generation iPod touch, iPhone SE, iPhone6, iPhone 6 Plus, iPhone 6s, iPhone 6s Plus, iPhone 7, iPhone 7 Plus, iPad Air 2, iPad mini 4 and iPad Pro.<br/><br/><br/>IMPORTANT NOTICE<br/>If you experience any problems with the game or in case you have any questions or comments, please contact us directly - support(at)randerline.com. You may also contact us by visiting our website randerline.com. We will read and account for all reviews here, but we can only answer and help you via email. Thank you.", "metacritic": null, "released": "2016-09-02", "tba": false, "updated": "2019-07-30T15:14:54", "background_image": "https://media.rawg.io/media/screenshots/bf0/bf027da4887966dc8e394c14138a2d31_DsG9UB2.jpg", "website": "http://mytpskateboarding.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 195, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["randerline"], "genres": ["Simulation", "Sports"], "publishers": ["randerline"], "esrb_rating": null}