{"id": 896081, "slug": "hurdy-gurdy-pd", "name": "Hurdy Gurdy PD", "name_original": "Hurdy Gurdy PD", "description": "<p><strong>A Hurdy Gurdy music toy for Playdate</strong><br/>The eagerly awaited Hurdy Gurdy fainaly makes its way onto playdate.<br/></p>\n<p>A unique and fun music app that lets you play a virtual Hurdy Gurdy instrument on your Playdate. With Hurdy Gurdy, you can experience the rich, distinctive sound of the Hurdy Gurdy, a traditional stringed instrument that produces a buzzing drone, and trumpet string sounds. Using the Playdate's crank and control pad, you can control the speed of the wheel, the pitch of the notes, allowing you to create a wide range of musical expressions.</p>\n<p>Hours or fun with playdates most accurate Hurdy Gurdy simulator to date.<br/></p>\n<br/>\n<p>As seen on the playdate community awards half time show performance<br/></p>\n\n<p><strong>Features:<br/></strong>Trumpet string (can turn on and tune sensitivity in options)<br/>Turn drone string off and on<br/>Tune anticlockwise different for clockwise(cant do that on a real Gurdy)<br/>2 octaves of notes,(Tilt device to activate higher string/octave (can tweak in options))<br/>Play in multiple scales -major, miner, natural<br/>Transpose to different keys<br/></p>\n\n<p><strong>Options Menu:<br/></strong>bring up the options by ether pressing the system menu button then selecting options or by docking the crank, press b to exit when the crank is undocked.<br/><br/>Scale <br/>-change between Major, Miner and Natural <br/>Drone<br/>-toggle drone string off and on, transposes with transpose option<br/>Trumpet<br/>-toggle trumpet string off and on, can tune sensitivity<br/>Gurdy Skin<br/>-Chose from 7 Gurdy designs<br/>Trumpet Active<br/>-tune the amount of movement needed to activate trumpet string<br/>Transpose<br/>-Transpose notes up or down to play in different keys with other instruments.<br/>Detune Back Crank<br/>-Transpose the tuning when cranked anti clockwise<br/>Open Delay<br/>-Tune the amount of time before the note returns to the open g string, makes it easier to not sound like grace notes all the time but some songs require it low like thunderstruck!!<br/>Octave Tilt<br/>-tune the point where the high string is activated with tilt<br/>Tilt Axis<br/>Chose which axis controls the high string activation<br/><br/><strong>Bugs?<br/></strong>keep an eye out for updates on the playdate dev forum and see how it developed.<br/>https://devforum.play.date/t/hurdy-gurdy-music-app/8557/11<br/></p>", "metacritic": null, "released": "2022-12-12", "tba": false, "updated": "2022-12-16T18:46:59", "background_image": "https://media.rawg.io/media/screenshots/4c8/4c8282586cce0475f85331d0c651878a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LowtekGames"], "genres": [], "publishers": [], "esrb_rating": null}