{"id": 896370, "slug": "springs-adventure-doggo-spring-spring", "name": "Spring's Adventure Doggo (Spring Spring)", "name_original": "Spring's Adventure Doggo (Spring Spring)", "description": "<p>One of my somewhat earlier games, this simple platformer from 2018 originally started as a clone of the game \"Hudson's Adventure Island\", but quickly got derailed into a silly furry adventure about saving Jay's missing friends. (Generally most of my games tend to end up that way.)</p>\n<p>Some characters and tropes are introduced in this game which later appear in Kymiball,  Haydenwoffle, The War over a Melon Field, and Space Captain Yanya, and it is the first game to take place in the Super Wonderful Puppyland universe that all those other games also do. Not that the storyline between any of them is very coherent!<br/></p>\n<p>It's very simple to play and fairly challenging, but there are a few things that mark this as an earlier game, such as there being no key remapping, and a few issues with the collisions, things which would later be handled better. <br/></p>\n<p>It has rather nice graphics, however; Many public domain artworks from OpenGameArt.org were employed in the game, for which many thanks and high praise must be given.<br/></p>\r\n🐶Controls🐶\r\n<p>The default controls, which in this game unfortunately cannot be changed, are the arrow keys to move around, F to jump,  D to throw out your weapons, and Enter as a start and confirmation key.</p>", "metacritic": null, "released": "2022-12-12", "tba": false, "updated": "2022-12-16T21:03:24", "background_image": "https://media.rawg.io/media/screenshots/706/706fa9e378e08a76d4f329dabc050f87.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 110, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Spring Spring"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}