{"id": 896691, "slug": "brutal-td", "name": "Brutal TD", "name_original": "Brutal TD", "description": "Brutal TD or Brutal Tower Defense is a minimalist retro-styled tower defense game. Unlike most other tower defense games Brutal TD has you in complete control of your tower, you can choose what enemies to fire at, which enemies you prioritize, and more. Each level of Brutal TD gets progressively more challenging and has different enemy types and wave sizes. Most levels feature a “uber block” boss at the end of the level. <br/>\n<br/>\r\nBrutal TD uses unique OpenGL shaders to help mimic a CRT effect on any size screen complete with scan lines. The game is built from the ground up to help it look and feel like an old-school retro game from the 80s but with all the modernization of newer TD games, such as hotkeys/buttons to buy upgrades, auto-save, and more. <br/>\n<br/>\r\nEach level has unique chip/synth tunes composed just for that level. If you like the music in the trailer, you will love the music in this game. <br/>\n<br/>\r\nA mouse and keyboard are recommended to play, but the game does have full controller support and native support for the Steam Deck (docked or undocked). <br/>\n<br/>\r\nBrutal TD is balanced to be a difficult challenge, but rewarding the more you play and get used to enemy types, paths, attack patterns and more. Most levels feature random enemy spawn points for replay value and to keep you from getting too comfortable on each replay. <br/>\n<br/>\r\nThere are:<br/>\n<br/>\r\n    • Tons of different enemy types with different movement paths.<br/>\r\n    • Unique enemies that steal resources or disable upgrades instead of just damaging you. <br/>\r\n    • Tons of upgrades.<br/>\r\n    • Different randomized item drops. <br/>\r\n    • Different helper towers that auto-fire, help fabricate resources, and more. <br/>\r\n    • Different bosses, some with multiple forms. <br/>\r\n    • Over 20 levels with awesome chip/synth tunes.<br/>\r\n    • Unlockable cosmetic items that you can only get by beating bosses and grinding points.", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T05:35:07", "background_image": "https://media.rawg.io/media/screenshots/c4b/c4bb354d86b39637c67644386d5107b5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 78, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Merriman Games"], "genres": ["Casual", "Indie"], "publishers": ["Merriman Games"], "esrb_rating": null}