{"id": 896675, "slug": "a-meeting-of-dreams", "name": "A meeting of dreams", "name_original": "A meeting of dreams", "description": "A story rich RPG, where your decisions matter and can lead to disaster or salvation. Explore across two realms, the partially devastated real world and the weird, wonderful and dangerous dream world. <br/><br/>In the real world, a virus is causing the population to fall into a deep slumber...never to awake. At least you are told it's a virus, but strange sightings and other weird goings on say otherwise. Forced to stay home, you desperately seek an escape - any escape - and just as you resign yourself to a life of boredom a chance encounter in your dreams offers new excitement. But will it be even worse than the real world? What is this dream world, who/what created it? Is it linked to this virus?<br/><br/>It's up to you to find out and along the way you may also find out about yourself too...<br/><br/>Your decisions matter, not only can they affect the fate of the two worlds, but how those around you see you.<br/><br/><br/>An in-depth and fantastical story, with many side adventures to embark on, giving up to 20 hours play time.<br/><br/><br/>Listen to epic music as you fight in turn based combat and explore across the different worlds.<br/><br/><br/>Chose from multiple playable classes, each with their own custom skill trees and the ability to multi-class.<br/><br/><br/>Puzzles, traps and much more to explore, many secrets to find.<br/>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T05:14:26", "background_image": "https://media.rawg.io/media/screenshots/266/266dc88990292bd1a2ebaa3fd5d806e2.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 246, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Holey Moley Productions"], "genres": ["RPG"], "publishers": ["Holey Moley Productions"], "esrb_rating": null}