{"id": 896607, "slug": "egregor-indoctrination", "name": "Egregor Indoctrination", "name_original": "Egregor Indoctrination", "description": "<p>Egregor Indoctrination tells an intriguing story in an episodic and laconic manner, combining elements of Metroidvania and Visual Novel genres.</p>\n<p>You who have sunk into depths of regularity, answer this - are you content with your life?<br />\nYou wake up, do your chores, eat, and go to sleep - is this cycle satisfying? You are full of ideas for something greater, something grander, the center of which will be you. Yet, you see that the realization of these dreams lies in the past. With the influence of enthusiasm or fear, you try to do something about it, feeling somewhere in the back of your mind, that unlike the proverbial snake that bites its tail, you do yet another useless spin around the wheel of the ordinary. And in this maelstrom, you are surprised when life gives you a challenge. You overcome it to return to the usual spin of ten thousand things, with a keen understanding that you have done something grand - yet you inevitably realize that everyone around you has gone through the same ordeals. Maybe you are poor, maybe rich, but you understand, be it consciously or not, that there can be only one end to this cycle - the Great Equalizer, called &quot;Death&quot;.</p>\n<p>You who are reading this, answer this - are you content with such a state of things? That people are destined to spin in this spiral of suffering, with a predetermined outcome? That all things, despite their apparent complexity and variety, in the end, lead to one outcome? That till the end of your days, you will chase after something that lies in the back of your consciousness?</p>\n<p>I can say, with all certainty, that my answer is no. So then, what is your answer?...</p>", "metacritic": null, "released": null, "tba": true, "updated": "2022-12-18T12:14:34", "background_image": "https://media.rawg.io/media/screenshots/f97/f973c9ba6ae11fe017dcd7fd09cd07fd.jpg", "website": "http://www.facebook.com/EgregorIndoctrination", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 33, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": [], "genres": ["Adventure"], "publishers": [], "esrb_rating": "Mature"}