{"id": 8966, "slug": "legends-of-heropolis", "name": "Legends of Heropolis", "name_original": "Legends of Heropolis", "description": "The town of Heropolis has been destroyed! Can you rebuild it to be the center of justice once more?<br/>Grow your heroes, gather your friends, and battle evil in this superhero simulation game.<br/><br/>In a town devastated by the nefarious Evilcorp, all hope seems lost... yet the flames of justice aren't so easily quenched. One gallant hero won't rest until their town is restored to its former glory.<br/>Construct a secret base, gather heroes from far and wide, and bring peace back to Heropolis!<br/><br/>Rebuild the town however you like; shops, roads, and other facilities are all at your disposal. <br/>Enlist your friends' heroes and cooperate to form a powerful battle team. With your powers combined, you can crush Evilcorp once and for all!<br/><br/>Customize your avatar, vehicles and more to make this superhero tale really your own!<br/><br/>-----------------------------------------<br/>All game progress is stored on your device. Save data cannot be transferred between devices, nor can it be restored after deleting or reinstalling the app.<br/><br/>Should the screen go dark and freeze, try to power your device down and relaunch the game.<br/><br/>Certain features require in-app purchases.<br/><br/>Try searching for \"Kairosoft\" to see all of our games, or visit us at http://kaipa.jp. Be sure to check out both our free-to-play and our paid games!<br/><br/>Follow kairokun2010 on Twitter for the latest Kairosoft news and information.", "metacritic": null, "released": "2016-07-29", "tba": false, "updated": "2019-07-30T09:59:13", "background_image": "https://media.rawg.io/media/screenshots/32c/32cf38cab7c07562aef8266b5ca9dad5.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "beaten": 1, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 187, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Kairosoft"], "genres": ["Strategy", "Simulation"], "publishers": ["Kairosoft"], "esrb_rating": "Everyone 10+"}