{"id": 896633, "slug": "solar-lewd-hollow", "name": "Solar Lewd Hollow", "name_original": "Solar Lewd Hollow", "description": "<p>Solar Lewd Hollow is a morality/corruption based RPG game.<br />\nADULTS ONLY.             Join your favorite naked fighter Doug Fooker as he becomes a farmer. This parody of a potentially popular game allows you to farm, fish, and f**k as you feel content with. Doug has a farm outside of town but longs for retirement in town. You must help Doug raise the capital to purchase the home of his dreams. There are many complications. Lust is a major factor in Doug’s life and he must control his lust or bad things happen. Morality and corruption is a major component of the game. Players may make many choices but each decision has consequences. Certain areas are open based on your choices. Multiple playthroughs are required to see all aspects of the game. Players can choose a simple existence on the farm and play a relaxing casual game or they are free to explore the weird adventures in the game. Game can be played with one hand.<br />\nNudity and sexual content: Sexual content involves humans with anthromorphs, zombies, and mutant human hybrids. Sexual acts involve masturbation, orgies, heterosexual acts, homosexual acts, and transgenders. Sexual acts are explicit and genital on genital visual graphics can be seen in interactive animated images. Violence is mild; limited to cartoon violence. Inferred substance use.<br />\n---You can farm to earn money.---<br />\n---Go fishing to earn money.---<br />\n---Capture animals to sell at the local market for money. ---<br />\n---Meet new people. ---<br />\n---Help the local villagers.---<br />\n---Go on fun quests to earn money.---<br />\n---Participate in team activates with local community members. ---<br />\n---Remember to pay attention to your stats.---</p>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T10:28:57", "background_image": "https://media.rawg.io/media/games/4bb/4bb5b51ea2fcf52e8b273bff610d1bf8.jpg", "website": "https://feraltermite.blogspot.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 341, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Feral Termite"], "genres": ["RPG", "Strategy", "Simulation", "Casual", "Indie"], "publishers": ["Feral Termite Gaming"], "esrb_rating": null}