{"id": 896627, "slug": "oriental-dynasty-silk-road-defense-war", "name": "Oriental Dynasty - Silk Road defense war", "name_original": "Oriental Dynasty - Silk Road defense war", "description": "<h3>Welcome to the journey to another world of \"Eastern Dynasty - Silk Road Defense War\"! </h3><ul><li>In this tower defense game with distinctive stylized art and excellent level design, you will experience the fantastic ancient adventure stories along the Silk Road, and embark on an epic journey!<br/></li><li> The mysterious ancient eastern country, after experiencing the era of separatist regimes, the new dynasty unified the Central Plains. In order to revive the dynasty's prestige, the emperor sent envoys to restart the Silk Road, all of which are strengthening connections with countries around the world.</li></ul><h3>Game Features:</h3><ul><li>Distinctive stylized art<br/></li><li> Customs and customs map levels constructed according to historical facts<br/></li><li>A fictional story adapted from the real Silk Road<br/></li><li>Diverse types of enemies<br/></li><li>Multiple heroes to choose from<br/></li><li>A large number of historical and cultural allusions<br/></li><li>Lots of talents to learn<br/></li><li> Recruit exclusive characters with regional characteristics<br/></li><li>Illustrated book recording anecdotes<br/></li><li>Simple and easy-to-use game experience<br/></li><li>Deep gameplay exploration</li></ul><h3>How to play:</h3><ul><li>Build different defense towers to fight against various enemies<br/></li><li> Reasonable use of resources to build defensive towers suitable for the battle situation<br/></li><li> Reasonable use of support skills to control the battle situation<br/></li><li>Hire powerful neutral units to help the battle situation gain a greater advantage<br/></li><li>Discover interesting easter eggs and learn about Chinese culture</li></ul><h3>Development plan:</h3>Development plan roadmap, it is expected to complete the genuine game development in early 2023：<br/><br/><h3> Follow us </h3><ul><li> Official QQ groups: 729934296, 916080674, 761831785, 897638955<br/></li><li> Official Discord: discord.com/invite/QCyEBVSupb</li></ul><br/><br/>Experience the perfect combination of tower defense and the historical story of the Silk Road, resulting in an amazing epic game adventure experience! You will follow our protagonists to engage in bloody strategic battles on the Eurasian continent. The game will show ancient buildings with unique regional characteristics, a wide variety of enemies with various skills, a new tower defense game mode, and a unique environment system. And an epic historical overhead plot!", "metacritic": null, "released": "2022-12-15", "tba": false, "updated": "2022-12-19T04:11:40", "background_image": "https://media.rawg.io/media/screenshots/091/09114b6d8f157213d661d497c6963129.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 530, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["星环游戏"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["星环游戏"], "esrb_rating": null}