{"id": 896663, "slug": "gray-zone-2", "name": "Gray Zone", "name_original": "Gray Zone", "description": "Travel many years into the future and embark on the great adventure of Valern, a slave in the hands of a corrupt government who's destined for great things. Explore colonized planets of our galaxy, worlds rich in animals, creatures and characters. Help Valern face his foes who stand between him and the truth.  Both in-game and cutscene dialogs are fully voiced in English.<br/><br/> <br/><br/>In Gray Zone you command your heroes and other friendly units to avoid or defeat the enemy, to complete story objectives, mandatory or optional. You build fire teams, use machines, vehicles and weapons, collect and distribute items. Your goal is to choose the right combat strategy to minimize your losses whilst achieving a result. The game allows you to freeze time in \"tactic mode\", which gives you unlimited time to re-think your strategy and issue different orders to multiple units at one moment.<br/><br/><br/><br/> <br/>Gray Zone offers a unique mixture of some old school and fresh new mechanics. You will experience full real-time battles with a 'tactical pause' at your service. Utilize your team, equipment and environment to get advantage over your enemies. Expect diversity in units, weapons, vehicles and more.<br/><br/><strong>Unique enemies and boss encounters</strong><br/><br/><strong>Partially destructible environments</strong><br/><br/><strong>Eye-catching fauna and flora</strong><br/><br/><strong>Custom vision &amp; elevation system</strong><br/><br/><strong>Stealth and cover-ups</strong><br/><br/><strong>Vehicles &amp; machines</strong><br/><br/><br/>Experience even more in the world of Gray Zone!<br/><br/><br/>Get a clear view on which new features we're currently working on and see a list of upcoming features in one place. Check out our roadmap available on Trello.<br/><br/>Become a part of our community and join us on our Discord server.<br/><br/><br/>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2023-06-29T19:18:55", "background_image": "https://media.rawg.io/media/screenshots/d3c/d3c6ebf153d486dd6e834b46c12f8bd6.jpg", "website": "https://grayzonegame.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 9, "toplay": 4, "dropped": 1}, "playtime": 8, "achievements_count": 3, "ratings_count": 0, "suggestions_count": 670, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["EastWorks"], "genres": ["Action", "Adventure", "RPG", "Strategy", "Indie"], "publishers": ["EastWorks"], "esrb_rating": null}