{"id": 896694, "slug": "gal-ramirezs-lion", "name": "GAL Ramírez's LION", "name_original": "GAL Ramírez's LION", "description": "-------------------------<strong>Explore a World Doomed to Darkness</strong>-------------------------------<br/>LION is an action-adventure game where the player controls Rosamunde, a woman who awakens in a world that slowly but certain is being consumed by darkness and demons.<br/><br/>You must explore this world collecting all 20 children which will act as Both allies and Weapons, then you can send them to attack or use them to attack directly or a combination of both, mixed with these are tools lost in the world that upon obtained will allow you to unlock new areas.<br/><br/>-----------------------------<strong>Action RTS Hybrid Combat System</strong>-----------------------------<br/>Each child posses’ Unique skills, Types of weapons and elemental damage, organized in groups of 4, 5 per each some focus on melee combat, others in range combat, ones in a focused targets while others in crowd control.<br/> <br/>-------------<strong>Obtain New Tools and Rescue More Children to access new Areas.</strong>-------------<br/>Each Child Type has their own unique traversal skills and tools which must be used to access new areas of the world, make the kids work together to pass obstacles and access areas you could not otherwise. Both their power and Number are key for this.<br/><br/>-------<strong>Explore Dangerous dungeons with Deadly Enemies and Bosses inside them.</strong>--------<br/>Fight Dangerous enemies and Deadly bosses waiting inside Dungeons, these enemies and places will put your skills to the limit.<br/><br/>---------------------<strong>Use Skill Crystals to Customize your way to Fight</strong>----------------------<br/>Added with this are the skill crystals, a system made to allow the player to customize their combat style and adventure by changing parameters such as the children’s AI and grant Rosamunde and the children with unique combat skills, by collecting Special Crystal Medals that can be equipped in the Inventory Menu.", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T05:39:28", "background_image": "https://media.rawg.io/media/screenshots/a42/a427a5eacf53ab47b0332f9f97771ddf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 573, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GAL Ramírez"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["GAL Ramírez"], "esrb_rating": null}