{"id": 896651, "slug": "lillian-night-exclusive-contract-of-succubus", "name": "Lillian Night: Exclusive Contract of Succubus", "name_original": "Lillian Night: Exclusive Contract of Succubus", "description": "* Please check the compatibility by demo version before purchasing the product.<br/><br/>■Product Overview<br/>This is a Succubus-themed 3D animated visual novel. Scenes will play out automatically, requiring no input from the user. While the default is a first-person perspective from the protagonist's point of view, players have the option to take full control of camera positioning.<br/><br/>There is a dialogue option following the first scene, allowing players to choose either a gentler route, or one made for masochists. Upon viewing one scene, the following scene will automatically be unlocked. There are a total of 6 scenes with some bonus features after unlocking and watching all possible routes.  <br/><br/>Features:<br/>- Femdom-only content - from soft to hard<br/>- No need for user input while watching, with the added ability to pause and rewind<br/>- Japanese anime-style 3D character design<br/>- Genuine human movement, created using motion capture technology<br/>- Highly immersive VR support with simulated binaural audio (For PCVR only) <br/><br/><br/>■Story <br/>As I lay in bed, ready to start my nightly routine, a girl appeared out of nowhere! Right in front of me! I'd say girl, but she had wings and horns - not to mention she could fly! I'm pretty sure she's not human...<br/>I mean, she drank a load of my cum, calling it a taste test! Apparently she liked it enough to offer for us to form a \"contract\". Uhh... I'm not entirely sure what I'm supposed to do here...<br/><br/><br/>■Heroine <br/><br/>Name: Lillia <br/>Race: Succubus <br/>Age: Approximately 300 years old <br/>Favorites: Semen (can survive on human food too) <br/>Physique: A bit on the small side<br/><br/>Racial traits: Lillia hails from a species that form contracts with mortals in order to secure a stable supply of nourishment. Ejaculating to this type of succubus does not lead to death. While they can fly and use teleportation and restraint magic, their physical strength is no greater than that of an ordinary person. When selecting humans, they care little about physical appearance and place full emphasis on the flavor of the cum produced. As they do not understand human concepts of love and affection, they prefer purely physical relationships.<br/><br/>Personality traits: She's usually the one in control, but has a slight case of tunnel vision. She is fully aware that her appearance is considered attractive by human standards, and is thus confident in her ability to captivate men.<br/><br/><br/>■Release notes<br/>Ver.1.2.0 First edition on Steam", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T04:40:22", "background_image": "https://media.rawg.io/media/screenshots/b06/b063f905ec0627c4affc66e92ff9dddb.jpg", "website": "https://steamcommunity.com/groups/Noki-Studio", "rating": 0.0, "rating_top": 0, "added_by_status": {"dropped": 1}, "playtime": 2, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 422, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Noki-Studio"], "genres": ["Adventure", "Indie"], "publishers": ["Noki-Studio"], "esrb_rating": null}