{"id": 896713, "slug": "super-saiyan-gt", "name": "Super Saiyan GT", "name_original": "Super Saiyan GT", "description": "Super Saiyan GT is a classic  Idle PRG game that allows you to recall your childhood and be a superhero. We look forward to you joining our Super Saiyan base camp and looking for a different passion together.<br/>Introduction<br/>You can match the lineup or character in your favor.<br/>You can also collect your favorite characters by drawing cards.<br/>Each character has a different soul bond.<br/>When we collect 7 dragon balls, we can make a wish to the Shenron and get different surprises<br/>Let's protect the peace and justice of the universe together and defeat the darkness. looking forward to your joining!! let us fight together!!<br/>***Game Feature***<br/>[No scheduled tasks, get rid of the shackles]<br/>1. Doesn’t set the timed tasks, get rid of the depression of fixed-point check-in<br/>2. Don’t need to worry about missing activities and revenue<br/>[ Different camps and matches]<br/>1. Advanced lineup mechanics<br/>2. The bond relationship of character. <br/>3. Be Free to match lineup and skills<br/>[Popular character ]<br/>1. More than 100 popular characters are freely cultivated, and you can customize your personalized camp collocation as you like. <br/>2. Each character's attributes and skills have their own strengths, which can activate some surprise effects and turn the tide of battle at critical moments.<br/>[Refused to be a worker, role training is simple]<br/>1. Offline hang-up to get resources <br/>2. Simple cultivation mechanism", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T06:05:55", "background_image": "https://media.rawg.io/media/screenshots/23d/23d32897619bef0c5d209d0f3c2bad2c.jpg", "website": "http://www.palm66.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 311, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["HIGH-B-TECH GROUP"], "genres": ["Strategy", "Card"], "publishers": ["HIGH-B-TECH GROUP"], "esrb_rating": "Mature"}