{"id": 896863, "slug": "hack-and-shoot-heroes", "name": "Hack and Shoot Heroes", "name_original": "Hack and Shoot Heroes", "description": "Survive the hordes! Hack and shoot through them to get the glory of the victory. Choose from six different heroes, level up, get epic loot and collect coins. Enhance your abilities to slash through the hordes of enemies and get ready to face the endboss in a devastating last final battle.<br/><br/><br/>Hack or shoot through a horde of enemies in climactic waves and collect coins to unlock new mighty heroes or get items in the item shop to increase your chance of victory. Collect experience gems to level up and collect epic loot in your inventory. Get ready and prepare for the final boss fight.<br/><br/><br/>Level up and choose from three different items per level where each can be one of three item types, a consumable, a weapon or a stats modifying item. Stash them into your inventory but choose wisely as you dont have infinite space in your backback.<br/><br/><br/>Choose from six different Heroes, the knight with his fast slashing sword, the firemage with her devastating fire spells, the priest with his unbroken faith, the light footed rogue with his boomerang shuriken blade, the necromancer who is calling the undeads for help and last but not least the stormmage with his flashy lightning spells. Each Hero has its advantages for an unique game feel and different enemy slashing experience.<br/><br/>Happy Slashing! Best experience with a game pad!<h3>Features:</h3><ul><li> Simple casual game experience<br/></li><li> Six different Heroes (Knight, Firemage, Priest, Necromancer, Stormmage and Rogue)<br/></li><li> Hack and Slash / Twin Stick Shooter mechanic<br/></li><li> Three Levels with three simple boss fights<br/></li><li> A lot of different weapons and items with weapon evolutions<br/></li><li> Buy different persistent items in the main menu item shop like inventory space etc.<br/></li><li> Normal mode and Horde mode with climactic waves</li></ul>", "metacritic": null, "released": "2022-12-18", "tba": false, "updated": "2023-01-13T03:48:36", "background_image": "https://media.rawg.io/media/screenshots/f92/f9285a2ffae09a906d6143017127fdd3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 104, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kistler Studios"], "genres": ["Action", "RPG", "Casual", "Indie"], "publishers": ["Kistler Studios"], "esrb_rating": null}