{"id": 896941, "slug": "le-voyage-de-mochihiro", "name": "Le voyage de Mochihiro", "name_original": "Le voyage de Mochihiro", "description": "<p>Dans le cadre de la première édition de la \"Confiture Jeux Game Jam\" organisé par les étudiants de Ynov Campus Lyon.\r\n  </p>\n<p>\n</p>\n<p>Notre équipe vous propose de tester \"<strong>Le voyage de Mochihiro\".</strong>\n</p>\n<p>\n</p>\n<p><strong>Synopsis </strong>: \r\n  </p>\n<p>Un jeu de gestion où vous aiderez la civilisation des Mochis qui se trouvent dans un vaisseau en direction de Marçe.\r\n  </p>\n<p>Après que la planète Tairre soit devenu invivable ils ont décidé de migrer afin de coloniser une nouvelle planète.\r\n  </p>\n<p>Sur le chemin, leur vaisseau est entré dans un état critique et il risque de tomber en panne à tout moment !\r\n  </p>\n<p>Pour le peu de route qu'ils leur restent, accompagnez-les et dirigez les afin de faire tenir le vaisseau jusqu'à la fin du voyage.\r\n  </p>\n<p><strong>Gameplay </strong>: \r\n  </p>\n<p><strong>Contrôle :</strong></p>\n<p>Vous pouvez parcourir le vaisseau en utilisant votre <strong>Click Droit</strong>.\r\n  </p>\n<p>Vous pouvez sélectionner des mochis et leur donner des tâches avec le <strong>Click Gauche</strong>.\r\n  </p>\n\n<p><strong>Mécaniques : </strong></p>\n<p>La chose la plus importante pour les Mochis, avant leur propre survie c'est <strong>MANGER </strong>!!\r\n  </p>\n<p>A chaque appel, tous les Mochis abandonneront leurs postes pour pouvoir aller se sustenter. Faites attention à cela.\r\n  </p>\n<p>Tout au long du jeu, vous aurez plusieurs ressources qui seront importantes à réguler.\r\n  </p>\n<p>La nourriture : Face à la crise alimentaire dans le vaisseau, la nourriture se fait rare et les Mochis consomment autant qu'ils produisent. Il faudra suivre la production attentivement.\r\n  </p>\n<p>L'eau : Permet d'irriguer les plantations, lorsqu'elle tombe à zéro, la production s'arrête.\r\n  </p>\n<p>L'oxygène : Lorsqu’une fuite apparaît, l'oxygène se répands très vite dans l'espace. En reproduire est long et fastidieux. Lorsque vous en manquerez dans le vaisseau, ce sera la fin.</p>\n\n<p><strong>Les environnements : </strong></p>\n<p>En plus de ces ressources, certaines salles sont très importantes !\r\n  </p>\n<p>L'infirmerie : Permet de soigner les Mochis malades, vous aurez besoin d'infirmière qui devront soigner un à un chaque patient.</p>\n<p>La zone de stockage d'eau : Lorsqu'une fuite apparaît, c'est dans ces lieux qu'il faut se rendre pour la réparer.</p>\n<p>La zone de stockage électrique : Lorsqu'un problème réseau apparaît, veuillez très vite les réparer, elle coupe l'alimentation de toutes les salles aux alentours les rendant inutile.</p>\n<p>La zone de stockage d'oxygène : Permet de réguler l'oxygène dans le vaisseau, lorsqu'une fuite apparaît, c'est ici qu'il faut s'y rendre pour régler le problème.\r\n  </p>\n<p>Les réacteurs : Au nombre de 5. Lorsqu'ils sont tous détruit, le vaisseau n'avance plus et les Mochis partent à la dérive. La partie se termine.</p>\n<p>Les jardins : Zone de production des vivres des Mochis. Leurs trésors.</p>\n<p>Les dortoirs : Là où les civils vont pour se divertir et passer la journée.</p>\n<p>Les zones de formation : Lieu où vous pourrez transformer un simple civil en membre de la société <strong>UTILE </strong>! </p>\n<p>Les ascenseurs : Seul moyen de pouvoir passer d'un étage à un autre dans le vaisseau.</p>\n<p>La cafétaria : Le moment tant attendu des Mochis, c’est ici qu’ils prennent du plaisir.</p>\n\n<p>Nom de l'équipe : \"Eyjafjallajökull 🌋\"\r\n  </p>\n<p>Membres : \r\n  </p>\n<p>Jona TEN CATE</p>\n<p>Pierre VUE</p>\n<p>Jeremy HOARAU\r\n  </p>\n<p>Sabri MOHAMADI\r\n  </p>\n<p>Quoc Anh NGUYEN\r\n  </p>\n<p> \r\n</p>", "metacritic": null, "released": "2022-12-18", "tba": false, "updated": "2022-12-19T07:46:33", "background_image": "https://media.rawg.io/media/screenshots/9cf/9cf16dc12c25926a4ff595e7b47c4115.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 131, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Jérémy Hoarau", "Hikalight", "imshunn", "Urugash"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}