{"id": 897012, "slug": "santa-is-coming-jamestkhan", "name": "Santa Is Coming (JamesTKhan)", "name_original": "Santa Is Coming (JamesTKhan)", "description": "<p><strong>Submitted for the LibGDX December 2022 Game Jam!</strong><strong> Chrome browser is recommended. </strong></p>\n<p>Voice Lines still in progress. This game utilizes experimental WebGL2 build. WebGL2 is required to play. See if your browser supports WebGL2 here: https://get.webgl.org/webgl2/<br/></p>\n<p>Toggling full screen before entering the main game is recommended! Press the F key if you lose the ability to steer with mouse.<br/></p><p><strong>Description</strong><br/>In the near future, earth  has become over populated, with the large majority of children in the world being on the Naughty List. Santa is fed up with being overworked, coupled with dwindling coal supplies he has decided to thin the herds by getting rid of the naughty children to balance things out.<br/></p>\n<p><strong>Instructions<br/></strong>Take out all houses containing the bad children. They can be identified by  their red roof and chimney smoke. Each village must be cleared of all naughty houses before time is up to win the game. You can find Villages by heading towards the name of the Village. Do not destroy innocent houses! Oh, and humans don't take kindly to Santa blowing up their houses so you will need to fly low to the ground (but not too low!) to avoid surface to air missiles. Flying too high for too long will result in being shot down. You get different messages depending on how the game ends!<br/></p>\n<p>Target House example: <br/></p>\n<p><strong>Controls</strong>\n<br/>Left Click- Fire Cannon<br/>Mouse- Steering<br/>W- Accelerate<br/>S- Decelerate<br/>M- Open in-game menu<br/>F- Fullscreen (HTML only)\r\n    </p>\n<p><strong>Credits</strong> <br/>Programming: JamesTKhan\r\n<br/>3D Models: JamesTKhan/Eric Nigh<br/>Santa Voice: Mike Adcock\r\n<br/><br/>Additional assets sourced thanks to Open Game Art and CGTrader<br/>\r\nSound effects found through FreeSound.org and FreePD<br/></p>\n<p>Made with Mundus and libGDX<br/></p>", "metacritic": null, "released": "2022-12-18", "tba": false, "updated": "2022-12-19T08:16:46", "background_image": "https://media.rawg.io/media/screenshots/9bd/9bdec680532a7f568233551d155fd0f7.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 42, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["JamesTKhan"], "genres": ["Action"], "publishers": [], "esrb_rating": null}