{"id": 89702, "slug": "world-traveler-lite-spot-the-difference", "name": "World Traveler Lite (Spot the difference)", "name_original": "World Traveler Lite (Spot the difference)", "description": "★★★★★★★★★★★★★★★★★★★★ <br/>√ \"BEST\" Award by iPhoneAppsPlus.com <br/>Top 10 Trivia App in Taiwan <br/>Top 10 Trivia App in Romania <br/>Top 10 Trivia App in China <br/>Top 10 Trivia App in Thailand <br/>★★★★★★★★★★★★★★★★★★★★ <br/>Check the 100 Places on G map. <br/>http://www.blueonionsoft.com/find_world <br/>[BBC's 50 places to see before you die] + α <br/>___________________________________ <br/>★ Wonders of World: Great Wall of China, Himeji Castle, Machu Picchu, Stonehenge, Christ the Redeemer, .. <br/>★ Beautiful Natures: Grand Canyon, Mount Everest, Yellowstone National Park, .. <br/>★ Historic Sites: Hollywood, Mount Rushmore, Petra, Timbuktu, .. <br/>★ Amazing Architectures: Golden Gate Bridge, Golden Temple, Moscow Kremlin, Eiffel Tower, Taipei 101, .. <br/>___________________________________ <br/><br/>See Reviews, Most of Reviews are 5 stars. <br/><br/>★★★★★ Good spot the difference game with a geographical spin. - I Fir***** <br/>★★★★★ Beautiful, good music. Much better than other spot difference games. - Trave***** <br/>★★★★★ Best game of this genre on the iPhone. Tons of levels and clssic well done graphics. - gary**** <br/>★★★★★ It's really world tour! - myblu**** <br/>★★★★★ This is a polished, well done game - marti*** <br/><br/><br/>Just Find World has just opened with more exciting features. <br/><br/>★ 100 Places You Must Visit Before You Die <br/>Always wanted to travel all around world? Invest just a few bucks. Just Find World will take you to the most valuable places in the world: Wonders of World, beautiful natures, historic sites, amazing architectures and etc. <br/><br/>★ Global High Score List <br/>Just Find World will show you top 5 ranks on the game and top 100 ranks on our web site (http://blueonionsoft.com/find_world). <br/><br/>★ Previous \"Just Find It\", Bestselling Spot-The-Difference Apps and Now on What's Hot <br/>Just Find World succeeds the name and fame of Just Find It. Reasonable difficulty, fancy design and great control ! <br/><br/>★ Educational App with Links to Wikipedia for Each Place <br/>You can trace where you have traveled. And if you want to know more about the place you are playing, tap the Wikipedia icon on the screen. With Just Find World you'll be a traveler rather than a tourist. <br/><br/>★ Different Spots - Different When You Back <br/>Even if you encounter the same place again, the different spots won't be the same. You won't be bored! <br/><br/>_______________ <br/><br/>Like US facebook.com/BlueOnionSoft <br/>Follow US @blueonionsoft <br/>Watch US youtube.com/BlueOnionSoft", "metacritic": null, "released": "2009-10-07", "tba": false, "updated": "2019-10-22T14:20:08", "background_image": "https://media.rawg.io/media/screenshots/9ae/9ae74e604b65733456f194635b565033.jpg", "website": "http://blueonionsoft.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 151, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Blueonionsoft"], "genres": [], "publishers": ["Blueonionsoft"], "esrb_rating": "Everyone 10+"}