{"id": 897232, "slug": "terrenus-paradisum", "name": "TERRENUS PARADISUM", "name_original": "TERRENUS PARADISUM", "description": "<p><em><strong>Made in 4 weeks for the Gunner Parade Winter League 2022.<br/></strong></em></p>\n<p>The Terrenus Paradisum: a vast forest known for its tranquil beauty and calming nature has been thrown into disarray by a strange flow of magic! </p>\n<p>Play as cheerful potion-making witch <strong>Lavender Mushihime</strong> and (or) half-dragon blacksmith <strong>Kouryuu Eikankaku</strong> and pacify the Terrenus Paradisum's beasts and fairies... as well as its (over)protective beastmaster! </p>\n<p>Strongly inspired by <strong>Blue Revolver </strong>(and a little bit of <strong>ZeroRanger, </strong>probably), Terrenus Paradisum combines high-speed shoot-em-up action with a dynamic difficulty system and an \"easy to learn, hard to master\" <strong>FUN </strong>scoring system.</p>\n<p>Build up a 64x chain by destroying enemies, and when you're ready, use your powerful special weapons to start <strong>FUN MODE </strong>and make enemies spew shiny and juicy golden point items! It's very, *ahem*, <strong>fun.</strong><br/></p>\n<p>Terrenus Paradisum's instability challenges you more the better you perform. Still, if you make a mistake, the game's adaptive <strong>RANK </strong>system reins in the bullet patterns, allowing you to catch your breath. Novice Mode takes it a step further by locking RANK to a lower cap for beginner players... and for the best of the best, Extra will never ease up on you with maximum RANK right from the start.</p>\r\nCONTROLS\r\n<strong>KEY (DEFAULT)</strong><strong>ACTION</strong>Arrow Keys<br/>MovementZSelect/Hold to Fire Regular Weapon<br/>X<br/>Use Bomb (limited supply, refillable)/Cancel<br/>C<br/>Hold to use Special Weapon (limited ammo, refillable)<br/>ShiftHold to slow player for precise movement<br/>EscPause (in-game)<br/>Esc+RQuick Retry (In-game)<br/>Esc+QQuick Exit to Title (In-game)<br/>\r\nGAMEPLAY FEATURES\r\n<ul><li>3 minutes <em>(actually 160 seconds...) </em>of caravan shoot-em-up goodness!</li><li>A Blue Revolver-inspired <strong>FUN MODE </strong>system, involving chaining one intense scoring burst after the other.</li><li>A dynamic <strong>RANK </strong>system which adapts game difficulty to the player's skill, and three additional levels (Novice, Standard, Extra) to fine-tune the RANK range.</li><li>A charming, colorful art style with plenty of pixel-y goodness thrown into the mix.</li><li>An original arrange of a certain shoot-em-up theme avid fans will certainly recognise!</li><li>...A cameo of a certain manga character that the developer really loves!?</li><li>Plenty of quality-of-life features such as effect cuts.</li><li>(The title screen theme is a royalty-free song, because I ran out of time.)</li><li>(See, I'm not exactly a master of all trades...)</li></ul>\r\n...SO LIKE, WHO'S BEHIND THIS THINGAMAJIG?\r\n<p><strong>PROGRAMMER, GAME DESIGNER, STAGE THEME COMPOSER &amp; ARTIST</strong>\n</p>\n<p>Kevin Minh (Kevinmonitor)\r\n      </p>\n<p><strong>TITLE THEME COMPOSER</strong></p>\n<p>Khaim<br/></p>\n<p><strong>ADDITIONAL SOUND EFFECTS\r\n</strong>\n<br/></p>\n<p>Freesound.org (Matias Michael Lahoud, Zagames)\r\n<br/></p>\n<p>Ryannlib Asset Library (a library of Touhou-style sound effects for noncommercial use)\r\n<br/></p>\n<p>bfxr (free SFX maker)</p>", "metacritic": null, "released": "2022-12-18", "tba": false, "updated": "2022-12-19T09:54:14", "background_image": "https://media.rawg.io/media/screenshots/d3a/d3a7c2cc32aced966e099578b6c2647e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 154, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kevin Minh"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}