{"id": 897311, "slug": "loba-amromerodiaz", "name": "Loba (amromerodiaz)", "name_original": "Loba (amromerodiaz)", "description": "<p><strong>[ In order to pay online please just sign up, it's very easy :) ]</strong></p>\n<p>Loba is a variant of Rummy played in Latin America, this game is played between 2 and 6 players (1 deck of cards/every 2 players), the main goal is to accumulate the less quantity of points by getting rid of all cards as soon as possible. The player who gets rid of all his/her cards first is the winner, all other players accumulate points across a match and this quantity is calculated based on each player's hand (all cards are worth points and they are summed up).<br/><br/>All players are placed around a table and 9 cards are dealt for each one of them, after that one card is placed face up on the table, which will be the discard pile, then the remaining cards are placed face down next to the pile, forming the stock. Each player tries to meld groups of three or more cards (sets and sequences). A set is a group of three cards of a kind, this means same values and different suits. While a sequence is a group of three or more cards of the same suit but consecutive values. The Joker may be used in both, sets and sequences, representing any card in a meld and its use is configurable. However, it is a standard in Latin America to use it only in sequences<br/><br/>There are two game modes, Single-Match and Tournament:<br/>**Sigle Match: Ends after one player got rid of all his/her cards, this player is automatically the winner.<br/><br/>**Tournament: Is composed of several matches, the accumulated points of each player is calculated after each match. A tournament ends when all players, but one (the winner), exceeded 100 points<br/><br/>*Each player contributes an equal stake to a pot (prize) in both game modes, which will be taken by the winner</p>\n<p>Watch this Youtube video (Youtube is introducing ads even when I do not monetize the content of my game's channel)</p>", "metacritic": null, "released": "2022-12-17", "tba": false, "updated": "2022-12-19T10:27:02", "background_image": "https://media.rawg.io/media/screenshots/637/6372d089449c5649ac211baaa93b29a0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["amromerodiaz"], "genres": [], "publishers": [], "esrb_rating": null}