{"id": 897309, "slug": "rooms-cy2286473967", "name": "Rooms (cy2286473967)", "name_original": "Rooms (cy2286473967)", "description": "<p><strong>OVERVIEW</strong><br/></p>\n<p>The story takes place in the present day, and you are a popular star who has been invited to take part in a big reality escape show. The site is held in a 5-story building, with each floor representing a level and you must start the game from the top floor. Each level has a number of rooms, with only a unique exit door leading to the next level and the corresponding key. But it's important to note that not every door in these rooms can be opened. The programme groups tell you that once you enter the site, you can't exit halfway through, and only after completing a total of five levels will there be an exit to the outside. When you are ready, you go to the scene and greet the enthusiastic audience on the rooftop. At the request of the programme groups, you have given a brief interview. In the middle of the interview, a cold wind comes up that makes you shudder. Before you know it, the people around you begin to make sounds of pain, and then their eyes turn white, their skin festers, and they rush at you without reason. Before you have time to consider why you are not affected at all, you rush for the door to the first level and quickly lock it from the inside. Then comes the pounding and growling from outside the door. By the time you know it, the place that is supposed to be alive and bright has become dark and dead. Maybe it's the zombies outside, you think, pull out the only electronic device you have: a phone, and turn on the flashlight function. Then you suddenly recall what the programme groups said: Each level will have at least one staff member responsible for providing clues, and as the level becomes more difficult and the number of rooms increases, the number of staffs will also increase appropriately. You're pinning your survival on these people. So you start Shouting and looking for those staffs in the rooms. When you hear a commotion, you make your way to the room where the noise is coming from. After you open the door of that room, just when you think you can finally be rescued, a zombie comes out of it, and you run away immediately. It seems like that the staffs were also infected by the outside air from the ventilator. After running for a while, seemingly throwing off the zombies behind you, you sit down in a room and start thinking: The staff who originally offered to help me find the keys and exit are now the zombies who are preventing me from escaping. Is there any way to get out alive? But instead of sitting here waiting to die, I might as well take a chance, and maybe get out of here. With this in mind, you stand up and continue this massive reality survival show hosted by the zombies… <br/></p>\n\n<p><strong>CONTROLS</strong></p>\n<p>WASD to move</p>\n<p>[E] Interact with other objects</p>\n<p>[F] Flashlight <br/></p>\n\n<p><strong><em>Made by Yuan Chen</em></strong><br/></p>", "metacritic": null, "released": "2022-12-17", "tba": false, "updated": "2022-12-19T10:25:30", "background_image": "https://media.rawg.io/media/screenshots/ae7/ae78978c86288c423c6c513e06c7bd4f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cy2286473967"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}