{"id": 897418, "slug": "legend-of-kuna", "name": "Legend of Kuna", "name_original": "Legend of Kuna", "description": "<p>You and your fellow felines are stranded on an island. Explore the land and talk to a stone head statue to begin your adventure.<br/>\r\nThere's a farming/survival component in the game, essential for your health and to defeat the threats, then a bit of strategy. Ensure you're the leader of the pack, the others are not too bright on leadership; they're good at stealing your precious crops though.</p>\r\nControls\r\n<ul>\n<li>⬆️ Walk</li>\n<li>⬅️➡️ Turn left/right</li>\n<li>⬇️ Toggle basic HUD</li>\n<li>❎ [X] Hold for full HUD and ⬅️⬆️➡️⬇️ to inspect the surroundings</li>\n<li>ⓩ [Z] Open Inventory/Actions menu</li>\n</ul>\r\nHow to play\r\n<p>You initially can't do much -except gathering fruits- more items and actions will be unlocked as you progress in the game.<br/>\r\nSo just explore the islands and:</p>\n<ul>\n<li>talk to the stone statue/head</li>\n<li>walk under palm-trees to gather a couple fruits if any</li>\n</ul>\r\nHere be Dragons\r\n<p>The writing \"Here be Dragons\" at the edge of the map means you can't walk farther at that moment:<br/>\r\nthe game map is initially just a small portion of the full map, next areas will be unlocked by defeating the enemy creatures, just report your success to the statue (Kahuna).</p>\r\nLeader of the Pack\r\n<p>As soon as picking up starfish is unlocked ensure you're the leader (check the colour of the ⭐ leader on top-left, if white it's you). If one of the other members of the pack becomes the leader you will often lose the control and your instincts will guide you to join your leader. You can still use left/right to avoid troubles or pick up stuff.</p>\r\nPapa, the Cloud, Beasts, Hints &amp; Unexplained Secrets\r\n<ul>\n<li><strong>Papa</strong>: is Mother Earth (Papahānaumoku) and make your plants grow but multiplying Krystals (if placed on soil) drains more power. While holding ❎ her power is shown in the green bar at top-right (plant icon);</li>\n<li><strong>Cloud</strong>: it's goddess Hina's servant cloud (Ao-Opua). Its power is shown at top-right as a pink bar just below Papa's. It will perform way better at multiplying Krystals but of course you need to unlock the 'call cloud' action: spending only 1 Krystals could not be enough if it's far away, maybe spend a couple and it will circle around you (you can imagine how crucial is to place Krystals and plants for better results). Before calling it ensure its power is enough.</li>\n<li><strong>Fighting Beasts</strong>: against the first creatures you have no other option than physical attacks (yes you just walk/bump into them, you'll hear a sound), let you pack help you: you can \"use\" and control them as a weapon knowing they will circle around you briefly (you must be the leader). You later unlock more items to throw at them, each with its own damage; well you can't expect much throwing seeds at them but the rest of the pack would throw anything on hand (grab something you need if they miss);</li>\n<li><strong>Beasts spawning</strong>: they will appear from the west edge of the map, random location; also kahunas turn their head in the direction of the beast to show you the way.</li>\n<li><strong>Temple Bonuses</strong>: the quests to unlock the Mana Krystals explain the basics, but for clarity, when they say \"Carry -50% weight\" it's just that item you placed on that square in the center. Also if someone else steal from there the bonus will persist until you add other items there.</li>\n<li><strong>Field of Wonders</strong>: (?) I'll keep the mystery for you to solve but those fields will help with limited resources on the islands.</li>\n<li><strong>Patch with tall plants</strong>: you could find extra seeds while searching around, they will not produce fruits though.</li>\n<li><em>(please <strong>leave a comment</strong> if you find some aspects obscure and I'll clarify here...)</em><br/>\n</li></ul>\r\nCredits\r\n<p>Code,sfx,music,gfx by  @Heracleum<br/>\r\nThanks to:</p>\n<ul>\n<li> @SmartAlloc for proofreading and correcting the dialogues script!</li>\n<li>  @freds72  @shy and others in Discord for the precious help with tricks and optimisation secrets.</li>\n<li> @thisismypassword for creating shrinko8 and its prodigious minifying powers!</li>\n<li>c_hrissy on SoundCloud for inspiration on the theme, brilliant chord progression!</li>\n<li>The actual Hawaiian Legend of Kuna the dragon, in short: https://www.hilohattie.com/blogs/news/the-legend-of-kuna-the-dragon</li>\n<li>Bugs reported:  @Wolfe3D  @ericb   @freds72</li>\n</ul>\r\nVersion history:\r\n<ul>\n<li>3 Fixed bugs: two nasty bugs with dialogue selection/confirm (ericb, freds72)</li>\n<li>2 Fixed bug: mashing both buttons crash (Wolfe3D)</li>\n</ul>\r\nOne Cart\r\n<p>This is my first Pico-8 full game. As a personal challenge I tried to squeeze everything in one cart including the start screen gfx and game data. So I basically have no tokens nor compressed character space left to add a line. Yes, this strongly limited the dialogues and room for taking full advantage of the isometric engine, pseudo-voxels and adding more features/stuff.<br/>\r\nI hope you enjoy it anyway.<br/>\r\nThanks for playing!</p>", "metacritic": null, "released": "2022-12-17", "tba": false, "updated": "2022-12-19T11:15:00", "background_image": "https://media.rawg.io/media/screenshots/127/1278e9e6ebf7a148cd09cc902d6bab58.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 108, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Heracleum"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}