{"id": 897557, "slug": "from-the-ashes-we-rise", "name": "From the Ashes we Rise", "name_original": "From the Ashes we Rise", "description": "<p><strong>From the Ashes we Rise</strong> is a regency era, fantasy Interactive Fiction with a focus on romance and forgiveness. It is not intended to be historically accurate and will contain many fantasy elements, including dragons and dragon shifters.</p>\r\nWarning: this game is very gay and full of dragons to the brim. Consume at your own discretion.\r\n<p>Tumblr blog</p>\n<p>Buy me a Ko-Fi<br/></p>\r\nThe GAME\r\n<strong>The game will be rated 18+ for the presence of explicit sexual content, strong language and heavy themes.<br/></strong>\n<p>There’s a scandal at court, something the upper levels of society love to gossip about when they’ve got nothing to do other than drink tea and spew petty lies about each other.\r\n</p>\n<p><em>You</em> are the scandal. Unmarried at 24 and with no engagement in sight, you’re the black sheep that will taunt this year’s season like you did with the previous one. Your reputation precedes you, like a pretty dress decorated with the ruins of the engagements and hearts you broke.\r\n</p>\n<p>You are the sweet lure of ruination, of infinite pleasure and gentle <em>madness.</em> You are everything the court despises and at the same time everything it desperately craves.\r\n</p>\n<p>This year’s season marks you return after the scandalized uproar in which you left everyone last year. For them, Seasons are a way to find a suitable match for marriage.\r\n</p>\n<p>For you it’s just a game. <em>Until it isn’t</em>.\r\n</p>\r\nFeatures\r\n<ul><li>Play as a dragon shapeshifter and customize your gender, draconic features and shifted form.\r\n</li><li>Surround yourself with domesticated dragons of assorted sizes.\r\n</li><li>Participate in dragon races to seduce the bachelors.\r\n</li><li>Deal what the consequences of your brutal play; maybe you'll be given a second chance to atone. \r\n</li><li>Start a romance with one of three ROs, or with all three together (<strong>Sekh’/Cherena/Zaphia poly route</strong>)\r\n</li><li>Will you let anyone see under the mask you built for yourself?\r\n</li></ul>\n\r\nThe Love Interests\r\n<strong>Sekh'- gender selectable (NB/same gender as MC)</strong>\n<p>One of the many people you entertained yourself with last year. They were different from the others, though, both because their family reputation was horrible at best and because their company was actually <em>pleasant</em>. Their sardonic, at times self-deprecating humour never failed to make you laugh, although revealing at times the deep loneliness they were hiding under that.\r\n</p>\n<p>You soon realized you were playing a difficult game and when things got too personal, you brutally cut off all contacts with them.<em> What will you do now that you can see just how much you left them in tatters?</em>\n</p>\n<em><strong>Sekh’</strong></em><em> stands at 1.73 m (5′8″) with a toned built and long, loosely curled bright pink hair that they tie mid length with a ribbon. Their warm brown eyes perfectly compliment their burnt sienna skin tone. They always apply a generous amount of taffy pink makeup, just a shade lighter than their scales, and their ankles are full of elaborate rose golden anklets.</em>\n<strong>Cherena - gender selectable (NB/same gender as MC)</strong>\n<p>Their family is one of the richest to have attended the last Season and their political influence is maybe even more impressive. Cherena's life consists of endless parties surrounded by shallow friends, for the most part interested in their wealth and social influence. Trapped in this repetitive routine, Cherena's eyes landed on you and since then they never left you.\r\n</p>\n<p>They seem fulgurated by your absolute lack of restraint, by an energy that promises to get them out of their decadence.\r\n</p>\n<em><strong>Cherena</strong></em><em> stands at 1.81 m (5’11”) with a soft built and wavy blonde hair that reach their mid back. Their bright yellow eyes almost shine against their ivory skin, the contrast made even more pleasant by the sparkly silver makeup they apply all over themselves, just the same shimmering silver of their scales. Their neck and hands are adorned by so much jewellery they basically jingle every time they move. And their adorned wheelchair only adds to their overall elegance and hypnotic allure.</em>\n<strong>Zaphia - gender selectable (NB/same gender as MC)</strong>\n<p>They have been a worker for the Crown since they were old enough to be hired, like their parents and their grandparents before them. Last Season was their fifth one as a staff member tasked with its organization and smooth running. You met them on and off for years and with time you grew closer. <em>Too close.</em>\n</p>\n<p>They are loyal to a fault and never out of line. Most importantly<em> they know you</em>, maybe more intimately than you know yourself.<em> The problem is that you broke their heart too.</em>\n</p>\n<em><strong>Zaphia</strong></em><em> has a lean built and is around 1.78 m (5′10″) of height. They are shaved on the sides and have short, wavy silver hair that brush their ears. They are partial to jewellery and wear golden lips and eyebrow piercings, three sets of earrings and a ring choker. They have light blue eyes, often emphasised by golden makeup and their striking golden scales, and warm bronze skin.</em>", "metacritic": null, "released": "2022-12-17", "tba": false, "updated": "2022-12-19T12:11:02", "background_image": "https://media.rawg.io/media/screenshots/1d1/1d1e0cd917f3d7d66d98b598992733d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Kal Down"], "genres": [], "publishers": [], "esrb_rating": null}