{"id": 897705, "slug": "project-4-rickyhernandez1000", "name": "Project 4 (rickyhernandez1000)", "name_original": "Project 4 (rickyhernandez1000)", "description": "<p><em>1) Randomized Cube Spawn</em><br/>The user will be able to spawn cubes at random locations utilizing the Random math function that corresponds to values within the x and y axis. The spawn button for this is F.<br/>INPUT: F-key<br/>OUTPUT: Cube spawned in unique random location<br/></p>\n<p><em>2) Moving Puck</em><br/>Users will be able to control a fast moving \"puck\" using WASD. It has a rigidbody that allows it to collide with normal cubes present upon the plane. The physics applied to cubes can be strong enough to launch them into the air. It was built from a capsule body that was greatly reduced in height. Users can move it beyond the plane without it falling since gravity is disabled for the puck.<br/>INPUT: WASD keys<br/>OUTPUT: Forward - Left - Backwards - Right user navigation of puck<br/></p>\n<p><em>3) Launch Cube Projectile</em><br/>Users will be able to spawn a red \"projectile cube\" that will fall towards the present location of<br/>the puck. Users will have time to move the puck out of the way. The spawn button for this is E.<br/>INPUT: E-key<br/>OUTPUT: Projectile spawned and falls towards puck<br/><br/><em>4) Destroyer Puck</em><br/>If the projectile cubes collide with the puck, they are immediately destroyed. This applies to<br/>projectile cubes that are present on the ground.<br/>INPUT: User collides puck with launched projectile cubes<br/>OUTPUT: Projectile cube destroye</p>\n<p><em> </em></p>\n\n<em>\n<p><br/>#5) Green Ball Bouncing:<br/>Using solely animation, a green ball bounces on a plane upon the start of the animation. It<br/>keeps going indefinitely until the user presses the 'P' key. Pressing this key will stop the<br/>animation from looping and will stop completely once it reaches the end frame of the animation.<br/>INPUT: P-key<br/>OUTPUT: End Ball Bounce Animation</p>\n</em>\n<p><em>#6) Breathing Box Animation:<br/>Upon the start of the application, the breathing box animation begins to loop. It starts small and then increases in size. Once it reaches maximum size, it decreases slowly at the same rate that it was increasing with. The user is able to change the color of the breathing box by pressing the \"L\" key. This is done using a random math function to input random HSL values upon the press of the \"L\" key. As long as the user holds down the \"L\" key, the breathing box will continue to change colors randomly. Once the key is no longer pressed, the last color presented remains.<br/>INPUT: L-key<br/>OUTPUT: Color-change of breathing bo</em></p>\n<p>#7) Rotating Square Box<br/>Using solely animation, this square box is able to rotate across their xyz axis. Upon the start of<br/>the application, it sits still. The square box will begin to rotate once the user presses the \"O\" key.<br/>Once it is pressed, the animation begins and loops indefinitely.<br/>INPUT: O-key<br/>OUTPUT: Start rotating box animation</p>\n<p>#8) Cube Fountain Spawn (with scale and color sliders!)<br/></p>\n<p>The user is able to press spacebar and spawn cubes for as long as  they are pressing the spacebar. On top, they have two sliders. Top one can change the scale of the cubes and the bottom one can change the color of the cubes  produced from dark to light. Once a cube is spawned, a countdown starts  which destroys the cube once it reaches zero. \r\n \r\n</p>\n<p>Note: Cube size starts at zero, so no visible cubes will be produced if the scale slider is not increased. <br/></p>\n<p>INPUT: Spacebar<br/>OUTPUT: Cube Spawn</p>\n<p>INPUT: User slides<br/>OUTPUT: Scale/Color Increase or Decrease<br/></p>", "metacritic": null, "released": "2022-12-17", "tba": false, "updated": "2022-12-19T13:18:40", "background_image": "https://media.rawg.io/media/screenshots/108/10899bcdbbf4729950e357c7c98f43e6.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["rickyhernandez1000"], "genres": [], "publishers": [], "esrb_rating": null}