{"id": 897713, "slug": "plurals", "name": "Plurals", "name_original": "Plurals", "description": "<p><em>Plurals </em>is a virtual experience taking place within a single bedroom. You can explore and interact with the room for as long or as short a time as you like. </p>\n<p>The experience was created to explore how virtual environment design can represent and evoke conflicting emotions. Specifically, <em>Plurals </em>explores the paradoxical feelings that arose from the way our relationships to our living spaces changed throughout the COVID-19 pandemic. </p>\n<p>For me [Freya, the project lead, hello!], my bedroom simultaneously became a refuge and a prison, a place of comfort but also isolation, representing both a desperate desire to leave accompanied by the desire never to leave again. <em>Plurals </em>illustrates the conflict felt by those of us who, even post-lockdown, long to return to the outside world, but fully understand and fear the danger that such action brings.<br/></p>\n<p>---</p>\n<p>Game design, programming, modelling and texturing: Freya Solnordal.</p>\n<p>Composition and sound design: Anusha Yellapragada.</p>\n<p>Producer and research correspondent: Cassandra Tytler.</p>\n<p>\n</p>\n<p><em>Plurals </em>was created as part of the Monash University Sir Zelman Cowen School of Music and Performance research project Collaborative Trauma Metaphors: Figuring the Space Between Experiences, and was supported by the Pedagogies of Creativity, Collaboration, Expertise and Enterprise (PoCCEE) Research Initiative Mini-Grant.</p>", "metacritic": null, "released": "2022-12-17", "tba": false, "updated": "2022-12-19T13:22:56", "background_image": "https://media.rawg.io/media/screenshots/c27/c271ea4c97db57d5f3d54c4090aa886e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 105, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["freyasolnordal"], "genres": [], "publishers": [], "esrb_rating": null}