{"id": 89788, "slug": "indian-girl-arrange-marriage", "name": "Indian Girl Arrange Marriage", "name_original": "Indian Girl Arrange Marriage", "description": "Welcome to our new Indian Wedding Salon - Indian Girl Arrange Marriage with Real Indian Culture.Every girl wants to look amazing in wedding, This game represents all wedding programs with the real eye of Indian Culture. At the time of marriage, MehndiRashm is a very popular program in Indian Culture. Mehendi is an Art and it’s also a symbol of Indian tradition. <br/><br/>We have provided all in one wedding package, from spa to henna mehndi to amazing ornaments to nice gajras to beautiful indian outfits. let's help this girl look beautiful by doing below activities:<br/><br/>SPA: <br/>Every girl want to become look as a gorgeous in her wedding. Most relaxing spa with a number of tools and masks for a glowing skin.<br/><br/>MAKEUP :<br/>A number of glamorous makeup options which includes charming lipsticks, blushes, eyeshadows, eye lenses, unique hairstyles, bindis and much more.<br/><br/>MEHNDI: <br/>Mehndi is representing to happiness &amp; moment of enjoyment. Wonderful henna/mehndi designs for hands and feet to make the girl/bride look more gorgeous<br/><br/>GAJARAS/FLOWERS<br/>Indian culture is incomplete without gajaras/ flowers in the wedding ceremonies to look amazingly beautiful!. We have provided a number of lovely gajaras and flowers options.<br/><br/>DRESSUP<br/>Dressup with the number of traditions sarees Collection to complete the Indian look in the best way! Lovely collection of Indian dresses, Sari, Salwar, Suit, Kammez. Various Collection for mens<br/>MANDAP/CAR DECORATION<br/>Your wedding is around the corner and you are still confused about your mandap decoration. True? Well, we can understand the dilemma. With so many options and styles available, You might like the colour theme of some decoration, the lighting pattern of another, and the décor of some other.<br/><br/>Wedding car decorations were never this enjoyable! Grab all the inspiration as we give you some fun and trendy wedding decor ideas to follow.<br/><br/>MANGAL PHERE<br/>Mangal Fera (also referred to as Mangal Phere) consists of the couple taking four circles, or ‘feras’ around the agni (sacred fire). Either ritual may be performed based on the variations of the ceremony.<br/><br/>GAME INCLUDE<br/>Indian Wedding Salon<br/>Indian Stylist Salon<br/>Indian Saree Dressup Games<br/>Dressup Games<br/>Indian bride wedding<br/>indian wedding dresses for men<br/>Indian DressUp And Makeup<br/>Indian Girl Spa and Salon<br/>Indian Mehndi Designs<br/>Indian Stylist Salon<br/>Indian Saree Fashion<br/>Bengali sari Design<br/>panjabi dresses Design<br/>rajasthani traditional dress <br/>Indian designer sari<br/>indian wedding girl makeup<br/>indian wedding girl arranged marriage game<br/>indian wedding hairstyle<br/>latest Mehendi Pattern for hand &amp; leg<br/>Indian wedding Mangal Fera<br/>Indian men traditional dress<br/>Traditions Salwar suit &amp; kameez<br/>Indian Sari Fashion<br/>Latest bridal outfit<br/>Manicure, Pedicure<br/>Indian Sari Fashion<br/>Indian Nail Spa<br/>Indian Nail Art Salon<br/>Indian beautiful Saree &amp;dresses<br/><br/>Weddings in India vary regionally, the religion and per personal preferences of the bride and groom. They are festive occasions in India, and in most cases celebrated with extensive decorations, colors, music, dance, costumes and rituals that depend on the religion of the bride and the groom, as well as their preferences.<br/><br/>Have fun with wedding view, hand and leg mehndi, haldi, spa, makeup and dress up,  for both bridal and groom.", "metacritic": null, "released": "2018-01-18", "tba": false, "updated": "2019-10-22T14:20:09", "background_image": "https://media.rawg.io/media/screenshots/acb/acbf509a6071e928f62d42b5b451a410.jpg", "website": "http://netcurve.in/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hiren Patel"], "genres": ["Family"], "publishers": ["Hiren Patel"], "esrb_rating": "Everyone 10+"}