{"id": 89787, "slug": "24-games-in-1-fish-wish-win-free-fishes-tanks", "name": "24 Games in 1 - Fish Wish Win free fishes & tanks", "name_original": "24 Games in 1 - Fish Wish Win free fishes & tanks", "description": "Want to play with lovely fish? Want to get lovely fishes in your aquarium? This game is only for you! You can earn fishes by playing lots of amazing mini games. This is FISH WISH Free game!<br/><br/>Here is a list of beautiful fishes that you can either buy or accept mini game challenge to win the fish. If you simply buy the fish, it will go in a live fish tank in which you can see it moving in the water and if you accept the challenge, you will go to the mini game to achieve a target score, if you achieve the score, you will win the selected fish free and fish move to fish tank.. There are unlimited fishes, unlimited fish tanks and lots of mini games that you can play.<br/><br/>Enjoy the big fish games and koi fish, jelly fish, shark fish, tropical fish, saltwater fish. discus fish. freshwater fish and lot of other amazing fishes in this game on your device! Play Mini games and win fishes to your aquarium of the pacific. Your aquarium will be adventure aquarium where lovely aquarium fish will be stored like a fish pond.<br/><br/>Don’t keep your dream fish out of water. Play with your fish tycoon! Make you fish farm; play with your fishes across the pond.<br/><br/>When you will play with this fish frenzy game then you will enjoy a lot with big fish little fish. Remember this is not a fish hunter or zombie fish game.<br/><br/>Don’t be late! Get this game now! Play with sea fish and jumping fish. Enjoy ocean fish mania!", "metacritic": null, "released": "2016-11-02", "tba": false, "updated": "2019-10-22T14:20:09", "background_image": "https://media.rawg.io/media/screenshots/9d0/9d0f48bac6f04aedc6f05bc034b892cf.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Ali Numan"], "genres": ["Simulation"], "publishers": ["Ali Numan"], "esrb_rating": "Everyone 10+"}