{"id": 898019, "slug": "pumpkin-punting-project", "name": "Pumpkin Punting Project", "name_original": "Pumpkin Punting Project", "description": "<p>A WINDOWS GAME WITH CONTROLLER AND KEYBOARD COMPATABILITY</p>\n<p>Pumpkins are falling from above.  We don't really know why, but you're tasked with launching them into the void. As your time ticks down, unescapable, your determination to succeed will grow stronger.</p>\n<p>Can you emerge from this sea of troubles the victor?</p>\n<p>Will you try to face this alone,  with all the weight on your shoulders? Or will you lighten your burden, and call for assistance, introducing a friend into the fray? It depends on how you want to play.</p>\n<p>No matter what you choose, all will not be forever set in stone.</p>\n<p><strong>The Cycle will always repeat... But the Cycle is never truly the same each time.</strong></p>\n<p>In the Pumpkin Punting Project, you sit down at your keyboard, or pull up your controller, and launch pumpkins into the omnipresent void in a twin stick-shooter adventure built in the Unreal Engine. Controls are simple:</p>\n<p><em><strong>E or START  to spawn in your player.<br/></strong></em></p>\n<p><em><strong>WSAD or Left Stick to move.<br/></strong></em></p>\n<p><em><strong>Arrow Keys or Right Stick to aim.<br/></strong></em></p>\n<p><em><strong>Space or any shoulder/trigger to attack the pumpkins.</strong></em></p>\n<p><em><strong>Esc or Menu to return to the menu.</strong></em></p>\n<p>This game is rather simple in gameplay looping. You select a time, and try to knock off 25 pumpkins before said timer runs out. Players can be a keyboard, or controller, and Player 2 can drop in at any time. You will play until the timer runs out, or until you reach the goal of 25 pumpkins.</p>\n<p>It is an interesting challenge, which will most likely require multiple playthroughs to master the game's system.</p>\n<p>Hope you enjoy playing!</p>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T15:42:36", "background_image": "https://media.rawg.io/media/screenshots/159/1590a6707dd79574ae323e6b5abf9277.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 38, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Fancy Fairy Design"], "genres": ["Action"], "publishers": [], "esrb_rating": null}