{"id": 898031, "slug": "europe-empire-2027-itch", "name": "Europe Empire 2027 (itch)", "name_original": "Europe Empire 2027 (itch)", "description": "<p><strong>Game Story</strong><br/>The year is 2027 and the world is in chaos.<br/>The United States newly-elected president decides to focus on home affairs after promising in his campaign that American soldiers will no longer be sent to wars abroad. The United States starts pulling back its forces from around the world.</p>\n<p>World markets collapse after major wars start in the Middle East and the South China Sea with concerns of supremacy and unequal sharing of resources. <br/>Europe is left alone to deal with the floods of refugees and the threat of a invasion from the east. <br/><br/>The trouble continues for Europe when nationalism raises its head in Austria, Turkey and Russia. NATO is no longer relevant.<br/>Conflict spreads worldwide and a few generals in Europe begin coups to seize power.</p>\n<p>A revolt in your country overthrows the existing government. <br/>As the leader of the rebels, you have unlimited authority in your country.<br/>The parliament supports your nomination and you are on your way to form an empire in Europe.<br/>As the new leader, your goal is to ultimately become the supreme leader.<br/>Using everything from diplomacy to war, you must strive to build an empire, both economically and militarily superior to all others.</p>\n<p><strong>Are you ready to lead, supreme commander?</strong><br/>At the beginning of the game, you select the country you wish to lead and start the game.</p>\n<p><strong>The game contains:</strong><br/>Weapons Suppliers from around the world, a Spy Center, a War Room, Diplomats, United Nations, an Economy system, Technology, World News Distribution (Economy, Relations, Spy and War) and very advanced Artificial Intelligence. </p>\n<p><strong>Weapons in the game:</strong></p>\n<p>Mercenaries, Armored Personnel Carriers (APCs), Tanks, Artillery, Anti-Air Missiles, Helicopters, Fighter Jets, Ships, Submarines, Fighting Robots, Unmanned Aerial Vehicles (UAVs), Aircraft Carriers and Ballistic missiles.</p>\n<p><strong>Multiplayer</strong><br/>The game support also hotseat multiplayer option up to 8 players from the same device.<br/>Each player plays in his turn, manage his country and can send external messages to other players in the game.<br/><br/><strong>You can buy the full version in Steam</strong><br/>When you buy the full version it will contain:<br/>* Normal, Hard, Very Hard, Impossible, Custom sandbox mode, risk mode, zombie's mode and unlimited money option.<br/>* 13 Extra spy missions.<br/>* 12 Extra war actions.<br/>* 4 Extra diplomacy options.<br/>* 5 Extra technologies.<br/>* 8 Extra United Nations options.<br/>* Generals selection.<br/>* More to come :)</p>\n<p>The system designed to think of thousands of possible scenarios and to choose the best way to win.  You need to show and improve your leadership skills and bring your country to be an empire. <br/>Good luck commander in your mission.<br/>iGindis Team</p>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T15:47:30", "background_image": "https://media.rawg.io/media/screenshots/4a4/4a4d6c645b1eefb38e03c48f33c2e95f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 274, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["iGindisGames"], "genres": ["Strategy", "Simulation"], "publishers": [], "esrb_rating": null}