{"id": 898104, "slug": "the-great-eggscape-nellaaa", "name": "The Great Eggscape (Nellaaa)", "name_original": "The Great Eggscape (Nellaaa)", "description": "<p>The Great Eggscape is a 2-d runner where the player starts as a cheeky egg navigating through obstacles to find its way back to the farm after an unfortunate eggcident. Roll, run and glide your way through the levels and obstacles by achieving distance goals in order to progress in this eggciting adventure. </p>\n<p>Enemies/Obstacles:In the level 1 your evil savior threw you to her cat as if you are a toy so run for your life while avoiding knives, rc cars, and using forks to your advantage but be careful the forks can be dangerous with an improperly eggsecuted jump. </p>\n<p>Enemies/Obstacles:In level 2 you are met with that pesky cat again but hey you’re a chicken now and chickens can fly right? In this game they can!! Run and glide through barrages of acorns raining from the sky while dodging those dicey squirrels. The hawks can lead to your eggvantage but beware those beaks and talons bite.</p>\n<p>Enemies/Obstacles:In level 3 run as long as your heart desires as the King you were meant to be! Will you take on the eggventure or crack under the pressure? </p>\n<p>Navigation:Level 1 uses the A or ← and D or → keys to move forward and backward eggswell as the spacebar to jump. Level 2 uses the A or ← and D or → keys to move forward and backward eggswell as the spacebar to jump but bruh you now have a double jump feature by pressing the space bar again up to five jumps and don’t forget to glide by holding left shift.</p>", "metacritic": null, "released": "2022-12-16", "tba": false, "updated": "2022-12-19T16:20:54", "background_image": "https://media.rawg.io/media/screenshots/76d/76db7c87f259ee2d9442fb9c48970018.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Nellaaa"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}