{"id": 89810, "slug": "crandom-free", "name": "cRandoM! Free", "name_original": "cRandoM! Free", "description": "cRandoM! is an exciting, crazy, and Random new party game that you can bring with you to become the life of the party at any time and any place. Just gather your friends together and start playing. You'll find you and your friends getting absolutely crrrrazy and doing random things such as: howling like a werewolf, impersonating Oompa-loompas, performing dog tricks, ect. <br/><br/>------------------<br/>This is the Lite version of cRandoM! It is supported with advertisements. Please upgrade to get new game cards, remove ads and to support the development of this new game.<br/><br/>------------------<br/><br/>This game is family friendly and for parties from 3-8 people. Try it out today! <br/><br/>cRandoM! is played by first shaking your phone to draw a random card and then performing the task from the card. The first player to collect one card from each category wins! <br/><br/>You card may fall under one of the following categories: <br/><br/>1- Name-It: choose a category from the card, go around the circle and name items from that category. The first person to take too long or give an invalid answer loses. As long as this isn't you, you keep the card. <br/><br/>2- Spotlight: Perform something for the entire group. This could be something like a song or an impersonation. <br/><br/>3- Rules: You must follow the rule on the card until your next turn in order to complete this card. This could be anything from only drinking with your left hand to speaking with a British accent. <br/><br/>4- Double Dare: You have to complete the task on the card immediately. It could be anything from slapping yourself in the face to attempting a cartwheel. <br/><br/>5- Pop quiz: Answer the question successfully to win. Did Bill Gates invent the internet? I don't know... did he? <br/><br/><br/>------------------------------------- <br/>The rules of cRandoM! are very similar to that of Quelf™ by Spin Master Games. <br/><br/>Note Quelf™ is a registered trademark of Spin Master Games. This product is in no way affiliated or endorsed by Spin Master and should not be confused with their product, Quelf™. <br/>-----------------------------------------", "metacritic": null, "released": "2012-01-11", "tba": false, "updated": "2019-10-22T14:20:09", "background_image": "https://media.rawg.io/media/screenshots/8e6/8e6921a5142d23f269b760057899f228.jpg", "website": "http://", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 56, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["logan sease"], "genres": ["Board Games", "Card"], "publishers": ["logan sease"], "esrb_rating": "Everyone 10+"}