{"id": 89833, "slug": "unfed-undead", "name": "unFed unDead!", "name_original": "unFed unDead!", "description": "unFed unDead! takes the simple game concepts found in 'Hungry Hungry Hippos™' to a whole new level, by adding new depth to the gameplay and bloody fun ZOMBIES!<br/><br/><br/>WHAT IS UNFED UNDEAD?<br/><br/>unFed unDead! is a fast paced arcade style game. You control 4 zombies at each side of the screen. Click and drag backwards towards the edge of the screen at your desired angle of attack and your zombie reaches through the window, grabbing a person that is in his range.<br/><br/><br/>WHY IS UNFED UNDEAD AWESOME?<br/><br/>-= Challenging Single Player Mode =-<br/>Race against the clock to try to clear the room before time expires and your victims escape. Earn points to earn stars to unlock the next level and to earn perks to help make the game easier.<br/><br/>-= Up To 4 Players at once =-<br/>Up to 4 players play at once as you all work a zombie at each side of the screen, competing for points.<br/><br/>-= Game Depth =-<br/>Carefully aim your attacks. Rack up points for power ups and extra time by attacking accurately and racking up kill streaks. <br/><br/>-= Level Bosses =-<br/>Each level features a unique level boss. This boss will attack you back and force you into 'Brain Drain' Mode. You have to learn how to skillfully attack and overcome this character on each level.<br/><br/>-= Social Scoreboards =-<br/>Compare your level scores with your Facebook friends and see how your scores rank overall.<br/><br/>-= Level Variety =-<br/>Environments ranging from disco parties to the Girl's Locker Room to a War room and even a Disco Party. Yes, we have Nazi Zombies for the true zombie fans.<br/><br/>-= Blood Mode =-<br/>Turn the bloody gore on or off with a simple switch.<br/><br/>---------<br/>'Hungry Hungry Hippos™' is a registered Trademark of Hasbro Inc. Our use of this trademark is only for a comparison of game concepts. Our game is in no way affliated with Hasbro Inc.", "metacritic": null, "released": "2012-07-06", "tba": false, "updated": "2019-07-30T17:15:44", "background_image": "https://media.rawg.io/media/screenshots/db2/db2eda9aef9891d614dcdd1a317a2a18.jpg", "website": "http://unfedundead.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["logan sease"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["logan sease"], "esrb_rating": null}