{"id": 898395, "slug": "crowd-medieval-city-war", "name": "Crowd Medieval City War", "name_original": "Crowd Medieval City War", "description": "In this game you will have a main character. While your main character is walking around, he will recruit civilians he comes into contact with into your army. The civilian character is of two different types. First type: Your character who will also have a sword. Second type: The character you have that will also become an archer. Your army will follow you constantly, but in case of war it will not follow you.<br/>\n<br/>\r\nYou can increase the number of your army very quickly and defeat the enemies. Archers can assist you on the battlefield from afar.<br/>\n<br/>\r\nThe more soldiers you can collect in this fantastic city, the stronger you will be. As you progress, your soldiers will follow you.<br/>\n<br/>\r\nEach race has its own magic. You can use spells by pressing the button at the top left.<br/>\n<br/>\r\nYour main character has a red star above his head. You can distinguish your character from other characters thanks to this star.<br/>\n<br/>\r\nIf you have soldiers other than your own character, the blows you receive will weaken, but if you have no soldiers left, each blow you take will be stronger. So don't go into battle when you don't have a soldier.<br/>\n<br/>\r\nYou can also fight your opponents online by conquering regions on the strategy map. The one who conquers the most areas becomes the king of the map.", "metacritic": null, "released": "2022-12-19", "tba": false, "updated": "2022-12-23T04:40:33", "background_image": "https://media.rawg.io/media/screenshots/d00/d00e38edace007fceaaee043203845dd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 446, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["Mete Deniz"], "genres": ["Action", "Adventure", "Strategy"], "publishers": ["MPARSDENIZ"], "esrb_rating": null}