{"id": 898354, "slug": "crime-boss-rockay-city", "name": "Crime Boss: Rockay City", "name_original": "Crime Boss: Rockay City", "description": "<p>Rockay City. A thriving metropolis with excitement buzzing from the sandy bay to the towering skyscrapers. But beyond the glamour, there is a fierce turf war raging on…<br />\nAfter the demise of the previous crime boss, there’s an open vacancy for a new King of Rockay City – but it isn’t just you who is fighting for the throne. Choose your crew based on their skills and expertise, and execute daring missions with the hopes of walking away with the cash, the turf and, ultimately, the crown.</p>\n<p>Make Sure You’re Connected</p>\n<p>Rockay City doesn’t just look and feel like the 90s, you’ll find a few familiar faces there too. From the charismatic Travis Baker (Michael Madsen) and his team of planners and handlers (Michael Rooker, Kim Basinger, Danny Glover and Damion Poitier), to rival gang bosses (Danny Trejo and Vanilla Ice) and the righteous Sheriff Norris (Chuck Norris): it’s not what you know, but who you know.</p>\n<p>Keep Your Friends Close</p>\n<p>Stealing everything from cash and drugs, through to priceless artifacts is more fun with accomplices. Jump into the PVE co-op multiplayer and take on thrilling hits and heists with up to four players. Fail and you leave empty handed, but succeed and you’ll find yourself richly rewarded.</p>\n<p>And Your Enemies Closer</p>\n<p>Play as Baker as he builds his empire using strategy, cunning and a little fire power to carry out heists and take territory from rival gangs. Winning the turf war won’t be easy though – between Dollar Dragon, Hielo, Cagnali and Khan trying to take the city for themselves, and Sheriff Norris aiming to stop you all in your tracks, this roguelike campaign will reward and punish in equal measure.</p>\n<p>The Best Revenge is Massive Success</p>\n<p>These aren’t just nameless thugs – these are real people, with real big problems. Explore how Ropes, Jupiter, Runaway and the gang ended up in Rockay City and help them pull off different jobs to get back on top. Each story is made up of multiple missions, which allows you to fully experience their life of crime.</p>", "metacritic": null, "released": "2023-03-28", "tba": false, "updated": "2023-05-27T09:59:59", "background_image": "https://media.rawg.io/media/games/508/5082f3a3260ad8d6a18abf6399c1d4dd.jpg", "website": "", "rating": 3.0, "rating_top": 4, "added_by_status": {"yet": 10, "owned": 10, "beaten": 2, "toplay": 38, "dropped": 6, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 5, "suggestions_count": 561, "game_series_count": 0, "reviews_count": 6, "platforms": ["Xbox Series S/X", "PlayStation 5", "PC"], "developers": [], "genres": ["Action", "Shooter"], "publishers": ["505 Games"], "esrb_rating": null}