{"id": 898369, "slug": "straycatdoors2", "name": "StrayCatDoors2", "name_original": "StrayCatDoors2", "description": "The time that I spent with you at the house, the journey at dusk, the lost city<br/>and the way back home through the white breathing snow...<br/><br/>The escape adventure game that has been a worldwide hit<br/>\"Stray Cat Doors\"'s continuation is finally here!<br/><br/>------------------<br/>◆Game introduction◆<br/>------------------<br/><br/>■ Features<br/>It's a escape adventure game where you solve the mystery and clear each stage with a cute character.<br/>For those who have not played the previous game do not worry because you can enjoy it without problems.<br/>In this new work, you can now operate the character and explore the stage together.<br/>If you find difficult to solve any mystery, the hint function will help you so even beginners can enjoy it.<br/>The kitties from the previous work will also appear. Please be healed by the warm heart of those kitties.<br/>In addition, many other characters will appear making the game colorfully.<br/><br/>■ Number of Mysteries increased<br/>Stages increased to 9 stages!<br/>What's more, there are over 30 extra stages!<br/><br/>■ Dress-up function<br/>A lot of character costumes! Let's change clothes and go out.<br/><br/>■ Let's be healed with beautiful background music<br/>Includes more than 30 songs that decorate the stage! Turn on the sound and enjoy.<br/><br/>■ You can customize the room as you like<br/>You can create furniture stickers by collecting the materials (pigments) on the stage.<br/>Let's arrange many stickers freely to complete a wonderful room!<br/><br/>■ Recommended for the following people<br/>・I have played the previous game<br/>・I like healing games<br/>・I like escape games<br/>・I like cute characters and animals<br/>・I like to collect items<br/><br/>------------------<br/>◆How to play◆<br/>------------------<br/><br/>■ On each stage, explore it and collect the four paints required for clearing the stage.<br/><br/>■ You can move inside the stage by click or drag.<br/><br/>■ You can proceed to solve the mystery by clicking where the cat footprint icon appears.<br/><br/>■ Use the items in the item column by click or drag.<br/><br/>■ When you clear each stage, \"extra stage\" will be added.<br/>On the extra stage, you can get new costumes and pigments as clear rewards.<br/><br/>■ At home, if you have a certain number of pigments, you will be able to challenge \"the redecorating puzzle\".<br/>Let's look at the hints displayed in the room and use pigments to create and move the missing furniture.<br/>You can freely arrange furniture in the room where you have cleared the puzzle<br/><br/>------------------<br/>◆Strategy tips◆<br/>------------------<br/><br/>■If you can't solve the mystery, you can see hints and answers through the [?] mark icon.<br/>※There is no hint function on the extra stage.<br/><br/>■ Look carefully at the shape and pattern of the stickers in \"the redecorating puzzle\" mode<br/>There may be slight differences even if they look symmetrical at first glance<br/><br/>■ Mini games are recommended to play for collecting a lot of pigments.<br/><br/>*For inquiries, please contact us from the official website.<br/>https://www.pulsmo.co.jp/app/support20.html", "metacritic": null, "released": "2022-12-18", "tba": false, "updated": "2022-12-23T04:09:54", "background_image": "https://media.rawg.io/media/screenshots/0da/0da56c26303c34b8920cd45b4afb1c50.jpg", "website": "https://www.pulsmo.co.jp/app/scd2/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 320, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PULSMO,INC."], "genres": ["Adventure"], "publishers": ["PULSMO,INC."], "esrb_rating": null}