{"id": 898476, "slug": "camellia-vr", "name": "Camellia VR", "name_original": "Camellia VR", "description": "<strong>'Camelia VR' is a VR content where you can take a walk in the Jeju Dongbaek dongsan to the Meonmulkkak. You can take a walk there with a virtual guide and listen to the explanation of nature and cultural relics. And you can meet other users and talk with them in the Meonmulkkak.</strong><br/><br/>It is divided into the Guide mode and the Free mode, and you can select the mode you want to play.<br/><br/>The Guide mode is a viewing content that requires a simple operation.<br/>You can follow a trail from Dongbaek Dongsan Wetland Center to Meonmulkkak with a virtual guide. Virtual Guide will explain to you about cultural relics and natural objects on the trail occasionally.<br/><br/>The Free mode is content in which you can freely move characters on a Meonmulkkak and interact with other users. You can use the microphone function to chat in voice, and also you can move the channels.<h3>How to Play</h3>1. Choose a language and mode from the title scene. Camellia VR provides Korean and English. You can select the mode after selecting the language.<br/><br/><br/>2. After selecting the mode, you have to customize your character. You can decorate your character in various ways, including the Dolhareubang costume.<br/><br/>3-1. The dialog box is automatically displayed when you enter the Guide mode for the first time. Press the '&gt;' button to move on. After the guide's explanation, your character automatically walks to the next section. When the character stops moving, a speech bubble floats on the head of the virtual guide. If you click virtual guide to interact, you can hear the explanation. When the Guide mode ends, it automatically moves to the Free mode.<br/><br/>3-2. In the Free mode, you can move your character freely using the controller.", "metacritic": null, "released": "2022-12-21", "tba": false, "updated": "2022-12-23T06:18:48", "background_image": "https://media.rawg.io/media/screenshots/9e2/9e246b2a7a68b3281dc78726c3a650df.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 215, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MAMMOSSIX Co"], "genres": ["Simulation", "Casual", "Indie"], "publishers": ["MAMMOSSIX Co"], "esrb_rating": null}