{"id": 898503, "slug": "boxville", "name": "Boxville", "name_original": "Boxville", "description": "<p>Boxville is 2-in-1: an animated film and a puzzle game.<br />\nBoxville is an adventure puzzle game about speechless cans living in the city of boxes and drawing doodles on cardboards to tell the stories.<br />\nBoxville is good for playing alone to dive into the atmosphere and challenge your brain with sophisticated logic puzzles and riddles, or playing with a friend or family to share unique audio-visual experiences and solve the puzzles together.<br />\nMade in Ukraine.<br />\nDesign<br />\nThe core idea of the game is that it’s not just a game - but also an animated film that you can watch and play at the same time.<br />\nWe designed Boxville’s gameplay with the purpose of taking away your anxiety and stress. You can explore and observe the world without rushing and pressure.<br />\nThe game is full of environmental quests and logical puzzles that we have carefully picked from among hundreds of options.<br />\nStory<br />\nBoxville is a city of boxes populated with old cans. They live quiet and happy lives with their everyday routines and habits. But one day, unexplained earthquakes disturbed their idyll...<br />\nBlue Can (our hero) lost his best friend because of that. He started his search but it is not so easy to move through the city after earthquakes. He has to find a way to move forward, return the friend back home and discover the real reason for all those earthquakes. There are many adventures, new friends and it’s not only friends that are waiting for him on the way.<br />\nHe has to be curious, inventive, careful, and to help others, to reach his goal.<br />\nWhat you can expect to see and hear in Boxville:<br />\n- Hand-drawn graphics — all backgrounds and characters are carefully drawn by our artists.<br />\n- Every animation and sound is created especially for each interaction.<br />\n- Unique music track was created for every scene to accomplish the atmosphere of the game.<br />\n- Tens of logical puzzles and mini-games are tightly incorporated into the story of the game.<br />\n- There are no words in the game — all characters communicate via cartoony speechbubbles.<br />\nLinux build is coming soon!</p>", "metacritic": null, "released": "2022-09-30", "tba": false, "updated": "2023-11-04T01:22:26", "background_image": "https://media.rawg.io/media/games/39b/39b8112d2d4f008030d0ec79ce55639d.jpg", "website": "https://triomatica.games/", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 4, "owned": 12, "beaten": 1, "toplay": 5, "playing": 1}, "playtime": 2, "achievements_count": 18, "ratings_count": 1, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 1, "platforms": ["Linux", "macOS", "PC", "iOS"], "developers": ["Triomatica Games"], "genres": ["Adventure", "Arcade", "Indie", "Puzzle"], "publishers": ["Triomatica Games", "Ohhio"], "esrb_rating": "Everyone 10+"}