{"id": 898637, "slug": "capas-entre-sangre-y-escarcha", "name": "Capas entre Sangre y Escarcha", "name_original": "Capas entre Sangre y Escarcha", "description": "<p>Este juego ha sido creado para la 5ª Game Jam de Cultura Abierta.</p>\n<p>El juego es un survival horror basado en la época de la Guerra Civil en España en el que tienes que alimentar a tu bebé mientras lo proteges de los horrores de la guerra.</p>\n<p>La idea principal proviene del poema <em>Nanas de la cebolla</em> (Miguel Hernández, 1939) en el que se explica la dura situación de su mujer con su hijo durante la Guerra Civil Española. Hemos querido combinar esto con las temáticas más oscuras de Goya y su manera de representar los horrores de la guerra en cuadros como <em>El 3 de mayo de 1808 en Madrid</em>, donde los soldados franceses son representados como una masa de uniformes y armas pero sin cualidades humanas y morales. Es por eso que nuestro juego tiene un monstruo que representa estos horrores de la guerra que acechan los civiles.</p>\r\nInstrucciones\r\n<p><strong>Objetivo: </strong>mantener al bebé con vida evitando al monstruo de los horrores mientras recoges las cartas del poema.</p>\n<p>En el escenario hay una estatua y una cuna. En la cuna podrás dejar al bebé reposando, y en la estatua alimentarlo. Deberás llevar (primero) cebollas a la estatua y luego poner al bebé. Pero cuidado, sólo puedes cargar un objeto (ya sea el bebé o la cebolla). </p>\n<p>Cada cierto tiempo recibirás una carta (indicado por el timbre) en la puerta con unos versos del poema. Al recibir las 4 cartas, se acabará el juego.</p>\r\nCréditos\r\n<p><strong>Guillem Alemán:</strong> Prop artist y texturing</p>\n<p><strong>Àlex Alier:</strong> Prop artist y texturing</p>\n<p><strong>Oriol Colomer:</strong> Programmer y level designer</p>\n<p><strong>Joel Moreno: </strong>Character artist y technical artist</p>\n<p><strong>Simón Langa: </strong>Character artist y concept artist</p>\n<p><strong>Adriana Langa: </strong>Voice acting<br/></p>", "metacritic": null, "released": "2022-12-22", "tba": false, "updated": "2022-12-23T08:06:21", "background_image": "https://media.rawg.io/media/screenshots/bb4/bb424ccbe209123604c9143eff140376.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ics_de"], "genres": [], "publishers": [], "esrb_rating": null}