{"id": 898829, "slug": "frostnight", "name": "FrostNight", "name_original": "FrostNight", "description": "<p><strong>FrostNight</strong> is a short, top-down action survival game where you battle hordes of enemies in a frozen wasteland.</p>\n<p><strong>Story</strong></p>\n<p>You play as a budding pyromancer stranded in the hostile frostlands of Lyrofell. As night falls, you can feel the temperature drop while hordes of carroteers and pitchforkers approach. Surviving the coming FrostNights will take wits, grit, and a touch of magic.</p>\n<p><strong>How to Play </strong></p>\n<p>During the day, Icekin are trivial and the day is warm. Come night, hordes upon hordes will approach you as the temperature plummets to zero.</p>\n<p>To survive, it is crucial to spend your time wisely gathering wood from trees and mana from Icekin. These resources can be used to craft temperature-replenishing campfires alongside powerful pyromancy abilities.<br/><br/>Icekin will become more frequent based on the time of day and total elapsed days. By the third FrostNight, the Icekin hoard will be overwhelming. How long can you survive?</p>\n<p><strong>Gameplay</strong></p>\n<p><strong>Development Thoughts</strong></p>\n<p>FrostNight was made for the UNC Winter Break Jam (https://itch.io/jam/winter-break-jam-unc) and was completed within 9 days. Music credit goes to Logan Williams. Everything else was made by me, Lucy Scott.</p>\n<p>This is my first completed game, and I am very happy with how it turned out.<br/><br/>Thank you for checking out FrostNight!<br/><br/>P.S., don't fireball the mannequin</p>", "metacritic": null, "released": "2022-12-22", "tba": false, "updated": "2022-12-23T09:29:18", "background_image": "https://media.rawg.io/media/screenshots/15d/15d4a64ce3b5cebd4fb27f8fad466e54.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 64, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["LucidGaming"], "genres": ["Action"], "publishers": [], "esrb_rating": null}