{"id": 8989, "slug": "tower-of-saviors", "name": "Tower of Saviors", "name_original": "Tower of Saviors", "description": "One of the proudest forces of the Kingdom, “Knights of the Round Table” has decided to join the war for the survival and dignity of Human. Behind them, there are still lots of stories between them to be told…. But  their power, and their dedication, will definitely bring another turbulence to the War….. Brand new Seal, the “Knights of the Round Table” Series arrives the Enochian Realm in the latest version and hopes to bring a change to the war. There is no turning back for Human, the only thing they can do, and they must do,  is to stand up and fight back for the glory, and for the future. This force will certainly stir up another wave that marks another start... and the battle will never end…<br/><br/>Not only Human, but also the Gods have realised there is no turning back as well, encountering the growing Demon forces that step up and further invade the home of the Gods. To bring back victory to boost the morale, the “Valkyries of Divine Wine”, who have always been there to support, have decided unleash their power from Power Release to change the war and restore victory. Meanwhile, the “Dragons from Sepulchre” who have long been waiting for the opportunity to come back and revenge have returned to the Realm with the new ability from Amelioration. To fight for their justice and for the honor, “Dragons from Sepulchre” will utilize the power of the Amelioration and show the world the strength they have. <br/><br/>In Version 13.2, the new “Material Inventory” system will be available! It is easier and more convenient for you to manage your precious resources and frees your current inventory! Get ready for the battle anytime! At the same time, a new sharing function will also be available! Share your joy of playing Tower of Saviors with your friends in a new way! Stay tuned for more news! You will definitely be inspired!<br/><br/>In TOS, you are chosen one to be a Summoner, the one bringing back peace to the realm. As a Summoner, you will need to hone your skills in dissolving Runestones, making use of the rewards you gain from battles to collect monsters with mythical backgrounds, and challenging more than 600 stages of different difficulties.<br/><br/>Tower of Saviors is a free of charge game! Summoners may purchase Diamonds for a different experience, including drawing rare cards, restoring Stamina and extending the Inventory limit, etc.<br/> <br/>Join the war now to bring an end to this endless war!<br/><br/>Official Facebook page: https://www.facebook.com/TowerOfSaviors<br/>Official Instagram account: https://www.instagram.com/towerofsaviors/<br/><br/>Story Background<br/><br/>&amp;quot;In ancient times, humans built the Enochian Tower in an attempt to become gods. Demons from hell took this opportunity to exploit the tower, invading heaven through it. A three-way battle between humans, demons and gods ensued. The gods then destroyed the tower&amp;#39;s summit and cast seals on it, closing the path to heaven. Wars continue to rage on earth and mankind is at the brink of extinction. The last hope lies with summoners who can unleash the seals and rally the power of the gods!&amp;quot;  <br/><br/>============================================<br/><br/>Tower of Saviors Game Features:<br/><br/>* Addictive and fun RPG and match 3+ challenges, with a brand new in-game story mode <br/>* Detailed European &amp;amp; American graphic design that catches your attention<br/>* Over 400 battles with different levels of difficulty<br/>* Included elements of the medieval myth, and 400 characters of the Greek, Chinese, Egyptian and more mythology<br/>* Different battles every day for players to collect specific elements to strengthen the teams<br/>* Brand new battle every week for players to collect more rare monsters<br/>* Limited time for diamond rewards which allow players to have a higher chance to summon the mythology characters<br/><br/>Download this fun and addictive game and challenge yourself now!<br/><br/>Want to keep an eye out for Tower of Saviors&amp;#39; updates?<br/>Like our official Facebook Page:<br/>http://on.fb.me/1ad7hTJ<br/>Join the Tower of Saviors fan group:<br/>http://on.fb.me/11GUeoV", "metacritic": null, "released": "2013-01-31", "tba": false, "updated": "2019-10-22T14:30:13", "background_image": "https://media.rawg.io/media/screenshots/af8/af805ce48ab9960fcfa36b32d5761760.jpeg", "website": "http://www.towerofsaviors.com/en", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 228, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Mad Head"], "genres": ["RPG", "Arcade"], "publishers": ["Mad Head"], "esrb_rating": "Teen"}