{"id": 89916, "slug": "chinese-street-food", "name": "Chinese Street Food", "name_original": "Chinese Street Food", "description": "Chinese people are practical food lovers. The dishes and ingredients served over Chinese New Year are meant to bring wealth, health and happiness in the coming year (along with some babies, too) – but they’re also delicious. There are far too many auspicious foods to list like noodles, manchurian, Spring Roll, and Chinese soup.<br/><br/>Features:<br/><br/>-Make yummy Chinese foods<br/>-Tons of realistic cooking tools to play<br/>-Tons of food materials to try: rice, noodles, oil, eggs, vegetables, meats, seasonings, Chinese tea, fruits, flour and so much more<br/><br/>Manchurian:<br/>Vegetable Manchurian is a delicious Indian Chinese Recipe made from cabbage, carrot and many other ingredients.<br/><br/>Noodles:<br/>Chinese Noodles are yet another stop in our Indo-Chinese flavour adventure. Noodles are an essential ingredient and staple in Chinese cuisine. Chinese noodles vary widely according to the region of production, ingredients, shape or width, and manner of preparation. Learn how to make Chinese Noodles step by step on this Food maker game. <br/><br/>Spring Roll<br/>Spring roll is a YUMMY and popular indo Chinese snack of vegetable spring roll, these delicious spring rolls are crunchy from outside, with a spiced vegetable filling from inside.<br/><br/>Chinese Soup<br/>Soup has played a major part in Chinese cuisine and culture, prepared not only for taste, but for nutritional and health benefits. Traditional Chinese soups are made from fresh vegetables.", "metacritic": null, "released": "2018-06-08", "tba": false, "updated": "2019-10-22T14:20:10", "background_image": "https://media.rawg.io/media/screenshots/73c/73cb7e270bb27b860900f54a383d0878_8LppiNf.jpg", "website": "http://netcurve.in/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 53, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hiren Patel"], "genres": ["Simulation", "Family"], "publishers": ["Hiren Patel"], "esrb_rating": "Everyone 10+"}