{"id": 899183, "slug": "transtempora-express", "name": "Transtempora Express", "name_original": "Transtempora Express", "description": "<p>First alpha Build/Demo for the project</p>\n<p>This game is a deckbuilding Rouguelike set in the WildWest:</p>\n\n<p>In the late 1800’s, a device was invented that allowed the user to create a temporal stream which would reset the user to the beginning of the loop each day.</p>\n<p>Heralded as the invention of the century, the temporal device was quickly modified so that it could be used to carry a vast locomotive through the time stream. Passengers would experience a journey free from the burdens of life whether that be limited resources, aging, or even death. The maiden voyage was only meant to last for a period of 6 months but at the end of the journey, the train never stopped.</p>\n<p>Few pockets of civility still remain amongst the carriages. The longest standing of these pockets being a neutral zone at the rear of the train. Survivors here have found moderate peace in no small part due to the secure automated doors that separate them from the insanity beyond. <br/></p>\n<p>Some still hold hope in stopping the train by traversing the many carriages between the neutral zone and the engine before day’s end.\r\n</p><p>========================================</p><p>Build 0.0.2 Bugfixes:<br/></p><p>-Fixed getting stuck in first carriage when trying to explore the sacks of grain<br/></p><p>-When abandoning a run after combat player can now respawn without a secondary door blocking the way to the mess hall.</p><p>-Sometimes when walking through door, would consume the trace actor so other items couldn't be traced after passing through.</p>", "metacritic": null, "released": "2022-12-21", "tba": false, "updated": "2022-12-23T11:57:29", "background_image": "https://media.rawg.io/media/screenshots/f51/f51512d981e4e1ea91edb9c584f92fb1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 220, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["joedoesdev"], "genres": ["Action"], "publishers": [], "esrb_rating": null}