{"id": 899246, "slug": "oppy", "name": "Oppy", "name_original": "Oppy", "description": "WTF?!\r\n<p>A text adventure inspired by the recent Amazon Prime Video documentary,<em><strong>Good Night Oppy</strong></em>. No endorsement is intended nor was ever received from the aforementioned.</p>\n<p>Thank you for enjoying this text adventure gamebook / interactive fiction content. Updated material / content will be made available sometime in the far future.</p>\r\nErrata\r\n<p>At least one slide  / page / option is known to be somewhat empty... and not intentionally so.</p>\r\nMobile Gamers\r\n<p>This gamebook / interactive fiction / text adventure is playable on a mobile device such as a phone or a tablet and in any orientation. Enjoy and thank you!</p>\r\nFinal Words\r\n<p>Comments and ratings have been turned off for your own safety. The rover in question is NOT the Opportunity mars rover. The cover photo is actually Ceres, not Mars. The video trailer is satan. Hail satan.</p>\n<p>Also, we don't work for USA Today. We mainly stole their image to use as our background. If you've got a problem with that, unless you are USA Today, go and f*** yourself, please. <em>(If you are USA Today, we'll be happy to remove it if you ask politely. Send us a legal threat though and you'll be getting incendiaries mailed back to you at your own expense.)</em></p><p>Come to think of it, the image actually belongs to NASA, which is a Federal USA agency, which means we can use it freely since its ownership is in the trust of the American people, and Frontier+ is an American enterprise, so yeah. We probably do have the right to use this image, pilfered or not.</p>", "metacritic": null, "released": "2022-12-20", "tba": false, "updated": "2022-12-23T12:27:32", "background_image": "https://media.rawg.io/media/screenshots/aed/aed26c948785d39a6c134c550162cdb9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 25, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Frontier+"], "genres": [], "publishers": [], "esrb_rating": null}