{"id": 899421, "slug": "glacial-soul", "name": "Glacial Soul", "name_original": "Glacial Soul", "description": "Introduction\r\n<p><strong>Glacial Soul </strong>is a small action role playing game with <strong>Soulslike</strong> style developed in Unreal Engine 5. This video game has been developed as my final project or the Multimedia Engineering Degree at the University of Alicante.</p>\n<p>I have programmed the chore mechanics of a Soulslike in order to achieve a full playeable character and three NPCs with AI. Because of the deadlines to submit the project I have developed it with blueprints. But I intend to reimplement all the AI stuff with C++.</p>\r\nMain Character\r\n<p>This character implements all the chore mechanics of a Soulslike video game. It can attack with one or two hands, cover, run, roll and dodge. It can also jump and attack in the air. Furthermore, it can perform two wepon art and parry the enemy as well. The character mesh is Greystone White Tiger from the game Paragon.</p>\r\nAI\r\n<p>I have developed three different AIs with Unreal Engine's Behavior Trees and the AIPerception component. I have used the Pathfinding and Pathfollowing technologies availeable in Unreal Engine too. </p>\r\nMob Enemy\r\n<p>This is a basic enemy that patrols following a set of target points. When the enemy sees the player or detects damage, it starts chasing the player. When it is near the player it selects the attack using <strong>UtilityAI</strong> and performs the attack. If the enemy doesn't have enough stamina it dodges backwards. The caracter mesh is also form Paragon, this is Kwang.</p>\r\nFinal Boss\r\n<p>The Final Boss attacks the player whe it enters the combat area. Depending on the distance to the player, the boss chooses between one kind of attack or another. The boss fight is divided in<strong> two phases</strong>.</p>\r\nPlayer Helper\r\n<p>This NPC works similarly as the <strong>Dark Souls invocations</strong> or the <strong>Mimetic Tear</strong> from Elden Ring. </p>\r\nGame Flow\r\n<p>I have implemented the full game flow. This involves all the features related to the <strong>Bonfire</strong> (related to stats and items) and the restart of the enemies. I have also implemented a <strong>Souls </strong><strong>Restorer</strong>. </p>", "metacritic": null, "released": "2022-12-20", "tba": false, "updated": "2022-12-23T13:48:07", "background_image": "https://media.rawg.io/media/screenshots/bca/bca3070645874de86aedfaf11c05f032.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 285, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Antonio José"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}