{"id": 899524, "slug": "special-delivery-remake", "name": "Special Delivery - Remake", "name_original": "Special Delivery - Remake", "description": "<p>A retro remake of the Spectrum game Special Delivery by Creative Sparks Ltd. circa 1984.</p>\n<p>Keys: Arrow keys and spacebar.</p>\n\n<ol><li>Sleigh Game<ol><li>Collect the presents as they drop.</li><li>Avoid clouds and trees, they will cause you to drop presents.</li><li>If you get struck by lightning from storm clouds, you'll lose an hour.</li><li>When you reach the end of the trees...<ol><li>if you have enough presents, indicated by the 'count/required' indicator, you will have the chance to land on a house to take the presents to the children in side. Land by flying down to the lowest height and come to a stop over the house. You will then enter the Chimney Game</li><li>If you don't have enough presents, you can launch those you do, with space bar, into the smaller houses for points</li></ol></li></ol></li><li>Chimney Game<ol><li>Move down the chimney on the ladders provided. Avoid the fire coming up the chimney by stepping side to side between the three ladders. You can go up a little way to avoid fire if necessary.</li><li>If you get burned, you'll lose an hour and Santa will jump up to the top of the chimney and return you to the sleigh game to try again.</li><li>If you reach the bottom without getting burned, you will then enter the House Game.</li></ol></li><li>House Game.<ol><li>Navigate the house using the (not yet visible) stairs, place the presents under the tree, collect the key and exit the house through the front door.</li><li>Avoid the sleepwalking kids, don't want to spoil the magic of Christmas.</li></ol></li></ol>", "metacritic": null, "released": "2022-12-20", "tba": false, "updated": "2022-12-23T14:29:55", "background_image": "https://media.rawg.io/media/screenshots/687/6876e24ffbb4d243db64ccc5b524bc63.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 51, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Indigo Beetle"], "genres": ["Action"], "publishers": [], "esrb_rating": null}