{"id": 899533, "slug": "lockdown-town-puttycad", "name": "Lockdown Town (PuttyCAD)", "name_original": "Lockdown Town (PuttyCAD)", "description": "<p>BOTH VERSIONS Will be included! Lockdown Town &amp; Lockdown Town Christmas edition.</p>\n<p>CHRISTMAS EDITION OUT NOW. Original version is being updated and will be added to files below ASAP.</p>\n<p>Take control of an ambulance to pick up patients who have been infected by the virus and quickly take them to hospital. The nasty covidiot germs are floating around the streets but thanks to our special covidium coating on the ambulance you can knock them out of the way to destroy them. Pick up as many patients as you can to try and beat the high score!</p>\n<p>In the Christmas edition the North Pole's very own National Elf Service have been recruited to help out in their shiny red delivery vans. Welcome to the Lockdown Town Xmas special edition. It's Christmas Eve and now that Santa's elves have finished making toys for another Year they have volunteered to help out the ambulance service, picking up and dropping off patients from the hospital. Using their delivery vans which have been modified as makeshift ambulances they have created the 'National Elf Service' and are ready to save lives! Take control of one of the special 'N.E.S.' vans and see how many patients you can save before the timer runs out.</p>\n\n<p>INSTRUCTIONS:\r\n</p>\n<p>Drive around Lockdown Town picking up patients and delivering them to the hospital for treatment while avoiding the nasty covidiots. Rinse and repeat! How many lives can you save!</p>\n<p>CONTROLS:\r\n</p>\n<p>Arrow Keys or JOYPAD = MOVE<br/>A or Left ALT = SIREN<br/>CTRL or RMB = BRAKE<br/>SPACE or LMB = HANDBRAKE</p>\n<p>CREDITS:</p>\n<p>Ric Lumb (PuttyCAD) - Graphics\r\n</p>\n<p>Nigel Critten (100TinSoldiers) - Programming\r\n</p>\n<p>PUBLISHED BY PuttyCAD/100TinSoldiers\r\n</p>\n\n<p>#StayHomePlayGames #LockdownTown @PuttyCAD @100TinSoldiers #LockdownTownPC #LockdownTownXmas</p>", "metacritic": null, "released": "2022-12-19", "tba": false, "updated": "2022-12-23T14:34:12", "background_image": "https://media.rawg.io/media/screenshots/884/8842ffca4294497ae93f049af04fd877.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 126, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["PuttyCAD"], "genres": ["Action"], "publishers": [], "esrb_rating": null}