{"id": 899606, "slug": "casio-handheld-games-cg-5x-emulator-for-zx-spectru", "name": "Casio Handheld Games CG-5X emulator for ZX Spectrum", "name_original": "Casio Handheld Games CG-5X emulator for ZX Spectrum", "description": "<p><strong> Casio Handheld Games CG-5X emulator for ZX Spectrum </strong><br/></p>\n<p><strong>**ENGLISH BELOW</strong><br/></p>\n<p>Este juego es un emulador de 3 de las maquinitas solares de Casio de la serie CG-5X de los años 1983-84:</p>\n<p><strong>* Marine Hunter CG-50</strong></p>\n<p><strong>* Dandy Cowboy CG-51</strong></p>\n<p><strong>* Mole Hunter CG-53</strong></p>\n<p>Existe una cuarta maquinita (Puppy Garde CG-52) que no está emulada.</p>\n<p>Podeis ver los juegos en esta página http://handheldempire.com/game.jsp?game=472 y tambien hay videos en youtube de las 3 maquinitas incluidas.</p>\n<p>Para jugar necesitarás un emulador de spectrum como FUSE o Retro Virtual Machine, un spectrum original o un clon como ZX-UNO o ZX Next.</p>\n<p>La versión inicial que incluyo para descarga, fue realizada para el concurso de BASIC apasacaldo organizado por Arca Lusitania en 2022 en categoria juegos, y solo incluye la versión de Dandy Cowboy:</p>\n<p>https://arcalusitana.fun/MuseuZX/Pascalated_BASIC/Concurso2022_ENG.html</p>\n<p>La versión del concurso debe jugarse en un emulador aumentando la velocidad al 400% o bien en ZX-UNO o ZX Next.</p>\n<p>El juego de forma general consiste en manejar un personaje que debe capturar 10 animales en cada nivel y llevarlos a la casilla de salida.  No podrá volver al punto inicial sin haber capturado una presa.</p>\n<p>Deberá evitar ser golpeado por los enemigos que dificultarán la tarea.</p>\n<p>* En Marine Hunter, manejas un buzo que debe capturar peces, evitando tiburones y otros peces abisales lleva los peces capturados al submarino para poder continuar.</p>\n<p>* En Dandy Cowboy, representas a un cowboy que debe capturar terneros evitando a los toros que campan por el prado. Lleva el ternero capturado a marcar para continuar tu labor.</p>\n<p>* En Mole Hunter, llevas un cazador que debe capturar topos con su red, evitando serpientes, arañas y los cocos que son lanzados por los monos de la selva. Lleva al topo a la jaula para poder capturar uno nuevo.</p>\n<p>El juego consta de 10 niveles divididos en 3 subniveles cada uno de dificultad creciente.</p>\n<p>Cada presa puntúa 10, 20 o 30 puntos si la fila donde es capturada está más cercana o lejana al punto de salida.  Consigue 10 puntos adicionales al llevar la presa a la casilla de salida.  Consigue 100 puntos si pasas un subnivel sin haber perdido vidas.</p>\n<p>Tienes 3 vidas para completar cada subnivel, las vidas perdidas se recuperan en cada nuevo subnivel.</p>\n<p>Si capturas 3 presas en orden, primero la más lejana, luego la del medio y por ultimo la más cercana, los enemigos desaparecen durante 10 segundos permitiendo capturar algunas presas sin peligro.</p>\n<p>Teclas Redefinibles, con valor por defecto:</p>\n<p>Movimiento: OPQA (en juego horizontal OP, en juegos verticales QA)</p>\n<p>Fuego: M</p>\n<p>Teclas durante los menús:</p>\n<p>Cambia selección: cualquier tecla, cambia selección</p>\n<p>Seleccionar opción: tecla asignada a fuego o ENTER</p>\n<p><strong>*** Herramientas utilizadas</strong></p>\n<p>* Boriel ZX BASIC por Jose Boriel - https://zxbasic.readthedocs.io/en/docs/</p>\n<p>* Extensión de VSCode ZX Graphics Editor por Duefectu - https://github.com/Duefectu/ZXGraphics#readme</p>\n<p>* Compresor/descompresor por Einar Saukas - https://spectrumcomputing.co.uk/entry/27996/ZX-Spectrum/ZX7</p>\n<p>* Editor VSCode por Microsoft - https://code.visualstudio.com</p>\n<p>* BasinC IDE/Emulador por Paul Dunn y Arda “Ref” -https://arda.kisafilm.org/blog/?page_id=848〈=en</p>\n<p><strong>*** Casio Handheld Games CG-5X emulator for ZX Spectrum ***</strong></p>\n<p><strong>**ENGLISH VERSION</strong></p>\n<p>This game is an emulator for 3 of Casio's CG-5X series of solar handheld games from the years 1983-84:</p>\n<p><strong>* Marine Hunter CG-50</strong></p>\n<p><strong>* Dandy Cowboy CG-51</strong></p>\n<p><strong>* Mole Hunter CG-53</strong></p>\n<p>There is a fourth handheld game (Puppy Garde CG-52) that is not emulated.</p>\n<p>You can see the games in this page http://handheldempire.com/game.jsp?game=472 and there are also videos in youtube of the 3 handheld games included.</p>\n<p>You will need an spectrum emulator like FUSE or Retro Virtual Machine to play the game, if you don't own a real ZX spectrum original or a clon machine like ZX-UNO or ZX Next.<br/></p>\n<p>The initial version, also included for download, was made for the Pascalated BASIC contest organized by Arca Lusitania in 2022 in games category, and only includes the Dandy Cowboy version:</p>\n<p>https://arcalusitana.fun/MuseuZX/Pascalated_BASIC/Concurso2022_ENG.html</p>\n<p>The contest version must be played in an emulator increasing the speed to 400% or in ZX-UNO or ZX Next.</p>\n<p>The game generally consists of managing a character who must capture 10 animals in each level and take them to the starting point.  He will not be able to return to the starting point without having captured a prey.</p>\n<p>You will have to avoid being hit by enemies that will difficult the task.</p>\n<p>* In Marine Hunter, you manage a diver who must catch fish, avoiding sharks and other abyssal fish, take the captured fish into the submarine to be able to continue.</p>\n<p>* In Dandy Cowboy, you represent a cowboy who must capture veals avoiding the bulls that roam the meadow. Brand the veal at the starting point to continue your work.</p>\n<p>* In Mole Hunter, you play a hunter who must capture moles with his net, avoiding snakes, spiders and the coconuts thrown by the monkeys of the jungle. Take the mole to the cage to be able to capture a new one.</p>\n<p>The game consists of 10 levels divided into 3 sublevels each of increasing difficulty.</p>\n<p>Each prey scores 10, 20 or 30 points if the row where it is captured is closer or farther from the starting point.  You get 10 additional points when you bring the prey to the starting point.  Get 100 points if you pass a sublevel without losing any lives.</p>\n<p>You have 3 lives to complete each sublevel, the lost lives are recovered in each new sublevel.</p>\n<p>If you capture 3 preys in order, first the farthest one, then the middle one and finally the closest one, the enemies disappear for 10 seconds allowing you to capture some preys without danger.</p>\n<p>Redefinable keys, with default value:</p>\n<p>Movement: OPQA (in horizontal game OP, in vertical games QA).</p>\n<p>Fire: M</p>\n<p>Keys during menus:</p>\n<p>Change selection: any key.</p>\n<p>Select option: key assigned to fire or ENTER</p>\n<p><strong>*** Tools used</strong></p>\n<p>* Boriel ZX BASIC by Jose Boriel - https://zxbasic.readthedocs.io/en/docs/</p>\n<p>* VSCode ZX Graphics Editor VSCode Extension by Duefectu - https://github.com/Duefectu/ZXGraphics#readme</p>\n<p>* Compressor/Decompressor by Einar Saukas - https://spectrumcomputing.co.uk/entry/27996/ZX-Spectrum/ZX7</p>\n<p>* VSCode Editor by Microsoft - https://code.visualstudio.com</p>\n<p>* BasinC IDE/Emulator by Paul Dunn and y Arda “Ref” -https://arda.kisafilm.org/blog/?page_id=848〈=en</p>", "metacritic": null, "released": "2022-12-19", "tba": false, "updated": "2022-12-23T15:06:31", "background_image": "https://media.rawg.io/media/screenshots/323/323e56860074bb0e8f41bd1e2d9b061b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Avlixa"], "genres": ["Action"], "publishers": [], "esrb_rating": null}