{"id": 89969, "slug": "mytp-one-mountain-ski-freeski-and-snowboard", "name": "MyTP One Mountain - Ski, Freeski and Snowboard", "name_original": "MyTP One Mountain - Ski, Freeski and Snowboard", "description": "Show your skills in „MyTP One Mountain - Ski, Freeski and Snowboard\" !<br/><br/>The game features one huge mountain area fully packed with half- and quarter pipes, jumps, slope style courses, boxes, rails and sheer endless run possibilities. Choose and edit your individual character, grab your snowboard or skis of choice to match your style and let’s do it ! Master the 48 „competition\", „style session\" and „best 3 tricks\" challenges to improve your skills and unlock new spots on the mountain.<br/>The higher you get towards the peak of the mountain, the more opportunities to ride new as well as hidden lines will arise. And if you think you have seen everything despite all the different possibilities, strap off your skis or snowboard and start to walk around, there is a lot to explore...<br/><br/>The further developed trick steering now lets you double the number of different grabs with simplicity of the well-known and proven steering from the previous MyTP 2.5 game. And this is still not all - now you finally have the possibility to tweak and style your tricks !<br/><br/>So what are you waiting for ? Fight your way to the top of the Game Center leaderboards and show us and your friends your skills by using the brand new video export function in the game replay mode !<br/><br/><br/>FEATURES<br/>- freeskiing and snowboarding<br/>- one huge mountain area<br/>- 48 challenges<br/>- individual male and female characters<br/>- half pipes, kickers, boxes, rails and more<br/>- authentic HEAD and NITRO snowboards<br/>- authentic MAJESTY skis<br/>- \"tweak and style\" trick system<br/>- over 1000 trick variations<br/>- hike option to walk around<br/>- tilt- or virtual joystick navigation<br/>- MFI Controller support<br/>- listen to your own playlist<br/>- „competition\", „style session\", „best 3 tricks\" and „training\" modes<br/>- replay option with video &amp; picture export<br/>- game center achievements &amp; leaderboards<br/>- iCloud synchronization<br/><br/><br/>VISIT US – randerline.com <br/>FOLLOW US – twitter.com/randerline  <br/>LIKE US – facebook.com/randerline  <br/>WATCH US – youtube.com/randerline  <br/><br/><br/>COMPATIBLE DEVICES<br/>MyTP One Mountain is compatible with 5th generation iPod touch, iPhone 4S, iPhone 5, iPhone 5C, iPhone 5S, iPhone 6, iPhone 6 Plus, iPad 2, 3rd and 4th generation iPad, iPad Air, iPad Air 2, iPad mini, iPad mini 2 and iPad mini 3.<br/>!!! ATTENTION !!! The game is NOT compatible with iPhone 4.<br/><br/><br/>OPTIMIZED<br/>MyTP One Mountain graphics are optimized for iPhone 5, iPhone 5C, iPhone 5S, iPhone 6, iPhone 6 Plus, iPad Air, iPad Air 2, iPad mini 2 and iPad mini 3.<br/><br/><br/>MFI CONTROLLER<br/>Please visit www.rndrln-games.com/MyTPOM1/MFI/ to get more informations about the input mapping.<br/><br/>********************************************************************************************************<br/>Don’t miss out on our BRAND NEW game MyTP 3 - Snowboard, Freeski and Skateboard !!!<br/>********************************************************************************************************<br/><br/><br/>IMPORTANT NOTICE<br/>If you experience any problems with the game or in case you have any questions or comments, please contact us directly - support(at)randerline.com. You may also contact us by visiting our website randerline.com. We will read and account for all reviews here, but we can only answer and help you via email. Thank you.", "metacritic": null, "released": "2014-04-24", "tba": false, "updated": "2019-07-30T15:32:19", "background_image": "https://media.rawg.io/media/screenshots/4ba/4ba50ba8b10a60fab079463fc32ff8e3.jpg", "website": "http://www.rndrln-games.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 116, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["randerline"], "genres": ["Simulation", "Sports"], "publishers": ["randerline"], "esrb_rating": null}