{"id": 8997, "slug": "hospital-havoc-2", "name": "Hospital Havoc 2", "name_original": "Hospital Havoc 2", "description": "Hospital hijinks and hilarity ensue in Hospital Havoc 2! Cure deadly diseases and mortifying maladies in the sequel to the original Hospital Havoc time management sim game. Play as a budding doctor and prove your healthcare prowess through careful prioritization and diagnostic skills. Can you handle your hospital, or will havoc reign supreme? <br/><br/>Control freaks and chaos junkies alike will find something to love in Hospital Havoc 2! With 150 experience levels to conquer, 20+ side-splitting patient scenarios, 35+ patient profiles, and a plethora of new items and bonus features to earn and use in-game, gameplay is sure to please those looking to earnestly help their virtual patients, as well as those who just want to be entertained by comical health concerns!<br/><br/>With addictive and fast-paced gameplay, a fun soundtrack, and wacky atmosphere, Hospital Havoc 2 is something every casual and seasoned gamer should download for their iPhone, iPod, and iPad! <br/><br/>Features: <br/>- 150 levels to attain<br/>- More than 20 hilarious health scenarios to diagnose and cure<br/>- Over 35 different patient types<br/>- Numerous doctor appearances (male and female) to customize your character <br/>- 6 doctor skills to learn, level up and advance<br/>- Complete hospital customization through the Quicki-Med catalog<br/>- Quirky machines, medicines, and tools<br/>- Career and Scenario Play modes to set gameplay pace<br/>- Special rooms for patient bonuses (such as the Psychiatric Room, and Morgue!)<br/>- Ability to connect with friends through GameCenter <br/>- Leaderboards and achievements to show off your skills<br/><br/>Contact us @<br/><br/>Facebook: http://www.facebook.com/hospitalhavoc2<br/>Twitter: http://twitter.com/bitwisedesign<br/>YouTube: http://youtube.com/user/BitwiseDesign<br/>Email: info@bitwisedesign.com", "metacritic": null, "released": "2011-08-11", "tba": false, "updated": "2019-10-22T14:30:13", "background_image": "https://media.rawg.io/media/screenshots/467/4670299d12547bf080b291096cb371bb.jpeg", "website": "http://www.facebook.com/hospitalhavoc2", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 144, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Bitwise Design"], "genres": ["Strategy", "Arcade"], "publishers": ["Bitwise Design"], "esrb_rating": "Everyone 10+"}