{"id": 899929, "slug": "the-dark-city", "name": "The Dark City", "name_original": "The Dark City", "description": "<p><strong>Narrative:</strong><br/></p>\n<p>After losing his family, the player moved to Theodora. The city of Theodora has been his home since he moved. He blames the law enforcement officers for the loss he had. And this hatred for them made him start working under the spies. His memories of the city he was born are blurry and distant, so when asked, he simply says that he grew up in the city of Theodora. He knows every path, every alley, every passageway like it’s embedded in his brain. His love for this city never lessens despite the danger he must go through every day. The city is full of venomous rats, serpents, spiders, and many other deadly species, but as the night gets longer, more unnatural species start to appear. Despite all these hardships, he loves the work he does for the spies.</p><p>The player works under a group of spies and has been assigned to deliver a certain package to someone. But he is being chased by a policeman and to evade the police, he needs to parkour through the city while avoiding all possible dangerous animals and obstacles. The player works at nighttime since it’s easier not to be tracked by the police, but the obstacles in his route also get harder to run through at night. The player will be passing through alleys and high buildings and will also be collecting coins or treasures that the inhabitants left behind.<br/></p>\n\n<p><strong>Player Control:</strong></p>\n<ul><li>WASD / Arrow keys: To move left, right, front and back. </li><li>R key/ Left mouse tap: To use the sword. </li><li>Space: To jump. </li><li>Hold Shift: To sprint. </li><li>Escape: To pause the game. </li><li>Mouse: To adjust the camera.</li></ul>\n\n<p><strong>Game Document Link:</strong></p>\n<p>https://docs.google.com/document/d/1RyFVfeL5NcSo2Oy4HBPaIcx9qIbztwbPP7ux3TUxDVg/...</p>\n<p><strong>Game made by:</strong> Tashfia Hussain Oyshi</p>", "metacritic": null, "released": "2022-12-19", "tba": false, "updated": "2022-12-23T17:25:00", "background_image": "https://media.rawg.io/media/screenshots/2ec/2ecf11a1e628bb1d5252f6bb0c8fa80c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 212, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["oyshi"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}