{"id": 900057, "slug": "final-fantasy-legend-3-remake", "name": "Final Fantasy Legend 3 Remake", "name_original": "Final Fantasy Legend 3 Remake", "description": "<p>Millenia ago, a fierce battle was waged for control of an idyllic world known as Pureland. After much fighting, the brave warriors of Pureland were protectively sealed in their own dimension, away from the rest of the universe. This was done by means of Talon, a powerful space craft capable of traveling through both time and space. </p>\n<p>Centuries have passed and the would-be Masters of Pureland have managed to create a rift in the galaxy, sending the Pureland Water Entity to devour all that stands in it's path. </p>\n<p>You must journey through past, present, and future to find the 13 pieces of the now-divided Talon. Only then can you save the universe from total destruction. </p>\n<p>-Preset day-</p>\n<p>The Pureland Water Entity appeared and flooded this world's present, past and future. The water brought monsters, which hunted people day and night. Cities fell one by one, covered by the sea... However, a few individuals prepare for a journey that may determine the fate of the world. Behold: the sealed city Dharm. Here three young people sent back as children from the ruins of the future, are living with the Elder. He has reared them together with his own granddaughter.</p><p>This game will not hold your hand or be a cake walk. There is tutorial information but it's optional. Even on the lowest difficulty some fights will be hard. It's easy at first to let you get used to things, then it ramps up fairly quick. Enemy levels scale with you, so you can't grind your way out of things beyond the first dungeon. </p><p>This game was designed to have less fights compared to other RPGs but against strong enemies that can actually be dangerous. You need to figure out strategies to overcome the enemy's raw power. Enemy AI is limited so they are pretty dumb, although the RNG sometimes makes it look like they know what they are doing. </p><p>Experiment with equipment choices and level up your skills. Read what each one does and find ways to exploit their effects. Spamming your strongest attacks might not be a winning strategy. </p><p>DISCLAIMER: This game was made with RPG Paper Maker, an engine currently in development. <br/></p>\n<p>http://rpg-paper-maker.com/</p>\n<p>The most recent demo is meant to show off what the engine is capable of so far. More features are needed in the engine to recreate everything from the original game. Most maps and events will be 1:1 copies but there will also be new content. </p>\n<p>All coloring, edits, and new sprites were created by me. Everything else is official game content. Title screen video is trailer for official FFL game bundle.</p>", "metacritic": null, "released": "2022-12-04", "tba": false, "updated": "2022-12-23T18:16:19", "background_image": "https://media.rawg.io/media/screenshots/a8e/a8e9d7f76302d2b85cc64380c17b8863.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 35, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["KevinOfNine"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}