{"id": 900156, "slug": "beyond-the-edge-of-owlsgard", "name": "Beyond The Edge Of Owlsgard", "name_original": "Beyond The Edge Of Owlsgard", "description": "Beyond The Edge Of Owlsgard is an old-school point &amp; click adventure game that is reminiscent of the animated movies and Saturday morning cartoons of decades gone by. While it is obviously inspired by the LucasArts and Sierra classics, it also strives to create its own style and identity by returning to the original “adventure” aspect of the genre. Aside from solving the obligatory inventory-based puzzles, this means a heavy focus on exploring mysterious lands, uncovering secrets and dealing with all kinds of dangers.<br/><br/><br/><br/>Strange things are happening in the animal kingdom of Velehill. Unknown shadows of large appearance are seen roaming through the forests and making the ground shake with every step of their steel feet. Houses and trees are destroyed and one animal after the other seems to disappear mysteriously.<br/><br/>Finn, a young roebuck, soon finds out about the disappearance of his family as well. Without hesitation, he goes on a journey to find them, not knowing he and his new friend Gwen the owl will soon uncover a dark secret that should have been kept hidden for all eternity... <br/><br/><br/><br/><ul><li>An immersive story told through hand-drawn landscapes and countless animations!</li><li>A return to the “adventure” aspect of the genre – a big focus on exploring whimsical places, uncovering secrets, and dealing with tense and dangerous situations</li><li>Cinematic cutscenes, reminiscent of hand-drawn animated movies, mixed with a pixel art aesthetic</li><li>Atmospheric soundtrack, inspired by the old midi classics everyone knows and loves</li><li>6-8 hours of gameplay</li></ul>", "metacritic": null, "released": "2022-12-22", "tba": false, "updated": "2022-12-26T05:14:04", "background_image": "https://media.rawg.io/media/screenshots/4b4/4b46a21b15b883e8265eb12755fad873.jpg", "website": "https://www.owlsgard-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 4, "beaten": 1, "toplay": 1}, "playtime": 7, "achievements_count": 69, "ratings_count": 0, "suggestions_count": 424, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["WatchDaToast"], "genres": ["Adventure", "Indie"], "publishers": ["WatchDaToast"], "esrb_rating": null}