{"id": 900154, "slug": "the-older-chick-said-to-be-a-dom-is-actually-a-sub", "name": "The older chick said to be a dom is actually a sub!? I took her home and trained her!", "name_original": "The older chick said to be a dom is actually a sub!? I took her home and trained her!", "description": "<p>This is a low-priced practical erotic game.《Contents》CG : 15<br />\nIntimate scene : 15<br />\nVoice : Heroine Full Voice.《Features》You can have the same experience as the protagonist.Two endingsCG Gallery ModeScene Replay Mode《Story》<br />\nI, &quot;Takeshi Sayama&quot; wake up to a sweet scent.<br />\nI realize I&#39;m completely naked, and my head is throbbing.<br />\nWhen I go to the kitchen, a girl I don&#39;t know is cooking with nothing but an apron on.<br />\n(Just what did I do…?)<br />\nOh, are you awake? It&#39;s almost ready, so just wait a bit longer, okay?<br />\nMy hazy memories begin to come back to me.<br />\nWe&#39;d been having joint practice with another college&#39;s karate club until yesterday.<br />\nAt the closing party, I approached an older girl from the other school who everyone calls &quot;the super sadistic mongoose.&quot;<br />\nDuring practice she has a mean glint in her eyes when she kicks and chops… but right now, she looks so gentle.<br />\nFrom the current situation… we definitely did the deed.<br />\nThe girl gazes at me with lustful eyes.<br />\nI&#39;ve… never done anything like that before… It really turned me on…<br />\nIt&#39;s embarrassing, but… I think I kind of like that sort of thing…<br />\nShe looks at my erect cock like a wild animal and places her mouth around the tip.<br />\nThis is Master&#39;s… ahh… mm…<br />\nJust what did I do yesterday!?《Characters》<br />\nAsuka Mihashi (CV: Yui Otokura)<br />\nStudent at an all girls college and karate enthusiast.<br />\nCalled &quot;the super sadistic mongoose&quot; by underclassmen in her karate club.<br />\nHer sadistic streak comes out during practice, but sexually, she&#39;s masochistic.<br />\nDuring her free time she likes to eat at different restaurants and go on solo trips.<br />\nShe&#39;s cheerful and openhearted and cries easily.<br />\nOutside of karate, her personality is completely different. She shows her softer side to her family and close friends.<br />\nShe can also be pretty girly, and enjoys making sweets.<br />\n&quot;I really like the super sadistic Takeshi that comes out when you&#39;re drunk.&quot;<br />\n<em>Before purchasing this product, we highly recommend that you play the demo[Japanese only] to check if the game works properly on your computer in your region.<br />\n</em>Appetite is the licensor of this game. For inquiries about the product, please contact Tensei Games.</p>", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2022-12-29T14:08:23", "background_image": "https://media.rawg.io/media/games/e20/e20ef7634be28ff316d6b50ecda32f0e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 314, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Appetite"], "genres": ["Simulation"], "publishers": ["Tensei Games"], "esrb_rating": null}