{"id": 900150, "slug": "chicken-hero-in-wulin", "name": "Chicken Hero in Wulin", "name_original": "Chicken Hero in Wulin", "description": "What would it be like to regenerate a chicken in the familiar world of martial arts?<br/>As a chicken, can it change its life to create miracles? Become an unprecedented and fantastic Great Xia?<br/>Everything is about to start!<br/>(Welcome to join the QQ exchange group and make valuable suggestions: 415688797)<br/>======Content introduction======<br/>[A world of free exploration]<br/>Interactive menu: There are many passers-by NPC in the game to communicate with them, cultivate goodwill, improve reputation, and even learn something and harvest props.<br/>*For details, see the game's《处世宝典》<br/><br/><br/>The weather is changeable: Different monsters and events will appear at night.<br/><br/>In addition, there are some special labyrinths in the game, which can be explored and excavated. (Introduction at the end of the article)<br/><br/>[Martial arts magic skills and props]<br/>martial  (武术)<br/><br/>Exercises (功法)<br/><br/>Props (道具):  You can try the explosive power of drunkenness, try to poison your opponent... It can be a chicken that has always been upright, or it can be used to control violence.<br/><br/><br/>[Free role growth]<br/>Through different game mechanisms such as foraging, buying human delicacies and trading commodities, the growth of numerical attributes can be achieved.<br/><br/><br/>[Mechanism of reincarnation]<br/>After each defeat, they have the opportunity to rebirth from nirvana and gain different talents. Maybe the last round was still a weak chicken, so this one has the ability to go against the sky.<br/><br/><br/><br/>[Centralized market economy]<br/>The market not only gathers a variety of vendors, but also can conduct material transactions to control the changing price index.<br/><br/>Rich props setting and application<br/><br/><br/>[Task guidance and achievement list]<br/>In the game, there are not only the branch tasks outside the main line, but also the role tasks of each special character, and even long-term tasks to repeatedly obtain benefits.<br/><br/>You can also gain different achievements and titles to increase your ability.<br/><br/><br/>=========[Content Expansion - Treasure Seizing Adventure]=========<br/>[Buy a shovel to dig and find treasures]<br/><br/><br/>[Defeat Wulin experts and fight for the treasure map fragments]<br/><br/><br/>[Search for the earth's veins and decipher them]<br/><br/><br/><br/>[Win mythical items and unlock the ending of the branch line]<br/><br/>", "metacritic": null, "released": "2022-12-22", "tba": false, "updated": "2022-12-26T04:05:57", "background_image": "https://media.rawg.io/media/screenshots/3dc/3dc218635e4f26884307317a4215729c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 296, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["梦辰游戏"], "genres": ["Adventure", "RPG", "Casual", "Indie"], "publishers": ["梦辰游戏"], "esrb_rating": null}