{"id": 900191, "slug": "world-of-fate", "name": "World of Fate", "name_original": "World of Fate", "description": "World of Fate is a massive strategy game where you spend your time taking over real life buildings and establishing your empire on the real life map. The game uses super advanced tech to provide real time street data and building data to create all the terrain and play space.<br/><br/><br/><br/>You can begin the game in any part of the world by establishing your HQ in an existing building. Every single real life building is rendered and saved in game for you to take over and expand. You can even set up colonies to take over distant lands far away from your HQ. <br/><br/><br/><br/>You can claim land by creating sectors around buildings that you own. If you do not own all of the buildings in the sector, it will be marked as contested until you manage to take over all of the buildings within its borders.<br/><br/><br/><br/>All buildings on earth can be claimed and modified for different purposes. You could claim a bunch of buildings and set some to storage and others to housing. <br/><br/><br/><br/>By accessing your HQ you can manage your empire and its citizens. You can manage citizen hippieness and citizen taxes. The higher the taxes the more money you make but at a cost.<br/><br/><br/><br/>You can manage the resources in your empire by claiming buildings and setting their purpose to storage. You are then able to expand within the building and increase the storage size of the building. There is also different resource cost for different storage compartments.", "metacritic": null, "released": "2022-12-24", "tba": false, "updated": "2022-12-26T04:59:38", "background_image": "https://media.rawg.io/media/screenshots/8db/8db3040afc988bd3b38c24b8ed063ce9.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 120, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Nik"], "genres": ["Strategy", "Simulation"], "publishers": ["Nik"], "esrb_rating": null}