{"id": 9003, "slug": "axe-in-face-2", "name": "Axe in Face 2", "name_original": "Axe in Face 2", "description": "The mighty Redbeard is back in the killer follow-up to the best Nordic mobile game of 2011!<br/><br/>Help Redbeard defend his precious flowers from hordes of invading Vikings, making use of his sharp axe and unparalleled throwing skills, spells from the Gods and awesome power-ups! <br/><br/>Axe in Face is easy to learn and play, featuring innovative line-drawing gameplay, beautifully animated graphics (with just the right pinch of cartoonish blood and gore of course), challenging levels and extremely creative enemies (tip: set your axe on fire to finish-off those Vikings hiding behind trees)<br/>It is time to sharpen your axe and join Redbeard in his epic axeventure!<br/><br/>PROTECT THE FLOWERS<br/>Defending your flowerbed is the most important thing a Viking warrior can do. Even though Redbeard is as kind as the next Viking, his passion for flowers can turn him into a vicious killing machine. Redbeard knows how to handle a watering can, but he can also throw an axe like no other Viking in the land if someone crosses his flowers. <br/><br/>DEFEAT THE VIKING HORDES<br/>There are some real unmannered Vikings out there, and they are stomping down on Redbeard’s flower beds destroying his beloved flowers. Are you gonna let ‘em get away with that? Your axe throwing skills are needed to take them down so grab your finest axe and teach ‘em some manners. <br/><br/>SUMMON THE POWER OF THE GODS<br/>Need more killing power? Just ask the Gods to send you a convenient lightning bolt or provoke a massive explosion that will send bits and pieces of those nasty invaders right to Valhalla! <br/><br/>DISCOVER THE WORLD OF REDBEARD <br/>There are always more levels to play and more enemies to behead. Just keep an eye out on those Viking invaders and strike them as they stick their heads out. With a progressive difficulty, innovative tactics, changing environments, exciting spells, Axe in Face 2 will keep you highly entertained. <br/><br/>CHALLENGE YOUR FRIENDS<br/>Challenge your friends to see who’s the best axe thrower in the Viking world and, of course, save the Daffodils in the process.", "metacritic": null, "released": "2016-02-22", "tba": false, "updated": "2019-10-22T14:30:14", "background_image": "https://media.rawg.io/media/screenshots/6ff/6ffa653955298b0d3962e81ccc98a024_PxDK4SN.jpeg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 156, "game_series_count": 0, "reviews_count": 0, "platforms": ["iOS"], "developers": ["Hugo Games A/S"], "genres": ["Action", "Arcade"], "publishers": ["Hugo Games ApS"], "esrb_rating": "Everyone 10+"}