{"id": 900404, "slug": "lie-of-the-reality", "name": "Lie Of The Reality", "name_original": "Lie Of The Reality", "description": "<p>HİKAYE</p>\n<p>Murat o gün olacak her şeyden habersiz bir şekilde başka bir görev almak üzere kralın huzuruna çıkar. Kral, vergilerini ödeyemeyen halkın çıkardığı isyandan bahseder ve bu isyanın itibarını zedelediğini  ve acilen durdurmasını üstelik isyan çıkaranlardan bazılarını öldürmesini emreder.</p>\n<p>Murat emri aldığı zaman gözü kararmaktadır. Çünkü alınan emir aslında kraldan değil kral gibi gözüken yani kendi görünüşünü değiştirmiş oyun yapımcısından gelmektedir ve oyun yapımcısının emirleri herhangi bir bozulma gerçekleşmedikçe uygulanmak zorundadır.</p>\n<p>Murat emri uygulamak üzere köye gider ve emredildiği gibi isyan çıkaranlardan bazılarını öldürür ama öldürdüğü kişiler arasında isyancılara tesadüfen karışmış karısı da bulunmaktadır. Murat karısını öldürdükten sonra kızının sesiyle gözleri açılır ve neden böyle bir şey yaptığını ve nasıl farkında olmadığını sorgulamaya başlar.</p>\n<p>O sırada başı ağrımaya başlayan Murat’ın dünyasında hata oluşur ve neler olduğunu anlamayan Murat’a oyun yapımcısından sesler gelir. Tabii ki Murat bu sesin oyun yapımcısından geldiğini de anlamaz ve verilen emir yüzünden karısını öldürdüğü için krala kinlenir ve kralı öldürmek için karşısına çıkan şövalyelerden yani kralın elit birliğinden kurtulmaya çalışır. Bunu başardıktan sonra kralın kellesini almak isteyen Murat kralın karşısına çıkar ama aslında karşısına çıktığı kişi oyun yapımcısının ta kendisidir. Murat kralın dönüşmeye başladığını ve değiştiğini görünce kendisinin aslında bir oyun dünyasında takılı kalmış olduğunu ve bu dünyadan kurtulmanın ve gerçekliğe dönmenin ancak ve ancak oyun yapımcısını öldürmekten geçtiğini düşünür. Ama Murat için başından beri  2 seçenek vardır.</p>\n<p>Oyun yapımcısını öldürerek boşluğa mı düşecek ?</p>\n<p>Yoksa Oyun yapımcısı tarafından öldürülüp tüm evrenden yok mu olacak ?</p>", "metacritic": null, "released": "2022-12-25", "tba": false, "updated": "2022-12-26T06:37:07", "background_image": "https://media.rawg.io/media/screenshots/d91/d91b121a72012989f9105a3bf5cafacc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AriYlmz", "wither_o1", "Yusuf Albustanlı", "RC Skopak", "Canayk", "fadlparlak"], "genres": [], "publishers": [], "esrb_rating": null}