{"id": 900525, "slug": "deckspace", "name": "/deckspace/", "name_original": "/deckspace/", "description": "this is a little prototype I made over a holiday weekend in 2021. it's been a year and I haven't returned to do further work, so I think it's time to release this weird experiment to the community, despite its flaws. cheers!<br/>- AC\r\n<br/>\r\ncontrols\r\n<p><strong>/deckspace/</strong> can be played almost entirely with the mouse. <strong>Right click</strong> on cards to flip them, and <strong>left click</strong> on them to play (or unplay) them--it's that simple!</p>\n<p>When editing cards, you will need a keyboard to type. The <strong>enter key</strong> creates a new line.<br/>To stop editing the card, <strong>left click</strong> anywhere on the screen. Note that you can still <strong>right click</strong> to flip the card being edited.</p>\n<p>Tap <strong>escape </strong>to pull up the menu cards. From there, you can save your world to or load it from one of the three save slots, or quit the game.<br/></p>\n<p>You can optionally hold the <strong>tab key</strong> to make all cards equally bright (this disables the sentence preview highlighting).</p>\n\n\n\r\nhow to play\r\n<p>There are six vertical columns of cards on the table, by default face-up, which you can collectively think of as a sort of 'dictionary'. From left to right: <strong>kinds</strong>, <strong>actions</strong>, <strong>links</strong>, <strong>traits</strong>, <strong>question cards</strong>, and <strong>outcomes</strong>.</p>\n<p>There is one horizontal row of cards on the table along the bottom of the screen. This contains all the <strong>things</strong> you have made yourself. At the beginning of the game, there is only one <strong>thing</strong>: <strong>the nameless soul</strong>, which is... you! You might want to give yourself a name.<br/></p>\n<p>There is one deck of cards, face-down, at the top-right corner of the screen. This is your <strong>deck</strong>. It contains all the cards in the world that can possibly be provided as an answer to any creative or situational question you pose... so basically it contains nearly every card on the table!</p>\n\n<p>Left clicking on any card on the table (except for cards in the <strong>deck's</strong> discard or draw pile) will <strong>play</strong> that card, moving it to the 'in play' row in the center of the screen. At the start of the game, no cards are in play.</p>\n<p>Left clicking on any card in play will <strong>unplay</strong> that card.</p>\n<p>Once the <strong>chain of cards in play</strong> represent a valid sentence, all of them will pulse white, and a <strong>go!</strong> card will appear at the bottom of the screen. Left clicking on this card will 'speak' your sentence and resolve its effects.</p>\n\n<p>At any given time, cards that are <strong>highlighted</strong> may lead to a valid sentence, and cards that have been darkened (not highlighted) will not lead to a valid sentence. If all cards are dark--this can only happen if the sentence in play is already invalid--you should remove any cards from play and try again. At the beginning of the game, with no cards in play, the only highlighted card is <strong>the nameless soul</strong>.</p>\n<p>Holding the <strong>tab key</strong> disables highlighting.<br/></p>\r\nI have questions\r\n<p>The core game loop in <strong>/deckspace/</strong> is creating new cards by asking the <strong>deck</strong> questions, which replies with cards you have already created--a repeating cycle of constrained creativity. Although the game does not restrict you from manually creating and modifying cards, <strong>/deckspace/</strong> really shines when you use the <strong>deck</strong> as a creative partner in your worldbuilding.</p>\n<p>Questions always end with the <strong>?</strong> card. Yes/no questions are often represented by pure <strong>?</strong> sentences--when you speak them, the <strong>deck</strong> will respond with either <strong>yes</strong>, <strong>no</strong>, or <strong>maybe</strong>. More complex questions are represented by <strong>what ?</strong> sentences, or <strong>what &lt;thing&gt; ?</strong> sentences, and when you speak these, the <strong>deck</strong> will respond with an appropriate card.</p>\n<p>To get you started with asking questions, you might want to try the following sentence:</p>\n<p><strong>       the nameless soul<br/></strong></p>\n<p><strong>       create<br/></strong></p>\n<p><strong>       what<br/></strong></p>\n<p><strong>       ?<br/></strong></p>\n<p>When you play a card from the <strong>deck</strong> (as a response to a question), your sentence will automatically be reconfigured to accept the new card, and is guaranteed to be valid. You can then immediately speak this new sentence, or you can throw it all away and try again.</p>\r\nputting on a show\r\n<p>In order to <em>do</em> things in your world, you will want to create a custom <strong>action</strong> and describe what <strong>outcomes</strong> it can have, which might involve creating custom <strong>outcomes</strong>, if you so desire. Once you do this, you can have your various creatures and other things perform <strong>actions</strong>--and the <strong>deck</strong> will respond with the appropriate <strong>outcome</strong> in response.<br/></p>\n<p>Check out the section below for more details on building sentences, or just dive in and mess around if you want to experience the mystery without any more spoilers!</p>\r\nhints / language reference\r\n<p>To create a new card, first play any <strong>thing</strong>: this is the <strong>speaker</strong>. Next, play <strong>create</strong> (the <strong>action</strong>), then play the <strong>kind </strong>of card you want to create (<strong>kind</strong>, <strong>thing</strong>, <strong>link</strong>, <strong>outcome</strong>, <strong>trait</strong>, and so on).</p>\n<p>To rename (or christen) a card, play any <strong>thing</strong>, then play <strong>name</strong>, then play the card you want to rename. Note that you can rename any card in the game, including types (try renaming <strong>thing</strong>!).<br/></p>\n<p>Many cards can be linked to other cards. To do this, play a valid card, then a <strong>link</strong>, then another valid card. For example: <strong>the moon is made of cheese</strong>. Some links don't work in all situations.</p>\n<p>Once you've linked two cards, the relationship is displayed as a stack, facedown, under the target card. Hovering over a card will display all of its relationships.</p>\n<p>To apply a <strong>trait</strong> to a card, use the <strong>is</strong> link. For example: <strong>the nameless soul is alive</strong>.<br/></p>\n<p>Note that you can flip <strong>link</strong> cards with right mouse, which inverts their effect (for example, <strong>is </strong><strong>made of</strong> becomes <strong>is not made of</strong>). This also works for several <strong>traits</strong> (e.g. <strong>big</strong> vs <strong>small</strong>). Note that <em>you</em> can create cards like this too: just flip the card you're editing and write on the other side.<br/></p>\n<p>In order to perform a custom <strong>action</strong>, you first must describe the <strong>outcome</strong><strong>s</strong> that are possible when playing it. Several outcomes are provided by default. To define an outcome for an <strong>action</strong>, link it using <strong>can</strong>. For example: <strong>grapple can fail</strong>.</p>\n<p>Once you've made a custom <strong>action</strong> and assigned <strong>outcomes</strong> to it, you can perform it by playing any <strong>thing</strong>, then playing the <strong>action</strong>, and then <em>optionally</em> playing any other <strong>thing</strong> you'd like to perform the action on. The deck will respond by shuffling and drawing an <strong>outcome</strong> for you.</p>\n<p>You can put a <strong>? </strong>after nearly every sentence to turn it into a yes or no question.</p>\n<p>To make 'filter' questions, just put a <strong>thing</strong> between <strong>what</strong> and <strong>?</strong> (for example: <strong>the nameless soul is at what place ?</strong>). This will filter your responses by the <strong>kind </strong>of card, which is useful for asking specific kinds of questions.</p>\n<p>Filters are most powerful when combined with custom <strong>kinds</strong>. The most basic way to create a custom <strong>kind</strong> is with <strong>create kind</strong>. However, custom <strong>kinds</strong> cannot be used until they are linked with one of the core <strong>kinds</strong> (e.g. <strong>thing</strong>, <strong>action</strong>, or <strong>trait</strong>). You can do this with the <strong>is a kind of</strong> link. For example: <strong>attack is a kind of action</strong>, followed by <strong>wrestle is a kind of attack</strong>, which would enable you to ask questions like <strong>andre can do what attack ?</strong><br/></p>\n<p>The most useful basic questions, I have found, are:</p>\n<p><strong>       create what ?<br/></strong></p>\n<p><strong>       is what trait ?<br/></strong></p>\n<p><strong>       is not what trait ?</strong><br/></p>\n<p><strong>       is a kind of what ?<br/></strong></p>\n<p>but of course, once you create your own <strong>links</strong> and <strong>traits</strong>, the space grows significantly (is friends with <em>what </em>creature, has <em>what </em>mood, etc.).<br/></p>\r\nadditional notes\r\n<p>I haven't had time yet to make music for this prototype, but I highly recommend listening to some kind of ambient track! Here are some examples, if you're into that sort of thing (not my work):</p>\n<p>www.youtube.com/embed/sNwukK7Y8wQ (Robert Rich)<br/>www.youtube.com/embed/6JeZR13dLLI (State Azure)<br/>www.youtube.com/embed/1Lfeno-FN9M (HTDC)\r\n</p>", "metacritic": null, "released": "2022-12-25", "tba": false, "updated": "2022-12-26T07:25:42", "background_image": "https://media.rawg.io/media/screenshots/1b8/1b8bd9721909167452959570e1452876.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "PC"], "developers": ["acgaudette"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}