{"id": 900869, "slug": "gg-galactic-gunfire", "name": "GG: Galactic Gunfire 🚀🛸", "name_original": "GG: Galactic Gunfire 🚀🛸", "description": "<p><strong>Controls:</strong> \r\n</p>\n<ul><li>Use keyboard and mouse, ⌨️🖱️\r\n</li><li>AWSD to move 🔤</li><li>Space Bar / Left Mouse Button to Shoot 🔫\r\n</li><li>Please have fun playing the game! 😊\r\n</li></ul>\n<p>**************************************************************************************************</p>\n<p><strong>Controles:\r\n</strong></p>\n<ul><li>Usar teclado y ratón, ⌨️🖱️</li></ul><ul><li>AWSD para moverte 🔤</li><li>Barra Espaciadora / Botón Izquierdo del Ratón para Disparar 🔫</li><li>Pásalo bien 😊</li></ul>\n<p>******************************************************************************************************************************************************************************************************************************************************************************************************<br/></p>\n<p>As you blast off into the vast expanse of space, 🚀 you can feel the excitement building inside of you. 🤩 You are the captain of your very own starship, 🛸 the \"Galactic Gunfire,\" and you are ready to take on any challenge that comes your way. 💪</p>\n<p>Your journey begins as you make your way through the twisting, turning corridors of a giant space station. You expertly navigate through a hail of laser fire, taking out enemy ships left and right with your trusty blaster. 🔫🪓\r\n</p>\n<p>As you make your way deeper into the station, you come across a group of heavily armed enemy ships. Undeterred, you engage them in a fierce dogfight, dodging their blasts and returning fire with all the skill and precision of a seasoned pilot. 🛸🪓\r\n</p>\n<p>Finally, after what feels like an eternity, you emerge victorious. The enemy ships are nothing but smoldering wreckage, and you are hailed as a hero. 🎉\r\n</p>\n<p>But your adventure is far from over. As you continue your journey through the cosmos, you encounter all manner of dangers and challenges. You face off against giant asteroids, navigate through treacherous asteroid fields, and do battle with alien warships. 🪐🛸\r\n</p>\n<p>Through it all, you remain focused and determined, never letting anything stand in your way. And in the end, it is your bravery and skill that see you through to victory. You are a true champion of the stars, and your legend will live on forever. 🌟🪐\r\n</p>\n<p>**************************************************************************************************<br/></p>\n<p>Cuando despegas hacia el inmenso espacio, 🚀 puedes sentir la emoción creciendo dentro de ti. 🤩 Eres el capitán de tu propia nave espacial, 🛸 la \"Galactic Gunfire\", y estás dispuesto a enfrentar cualquier desafío que se te presente. 💪<br/></p>\n<p>Tu viaje comienza mientras te abres paso por los sinuosos y retorcidos corredores de una estación espacial gigante. Navegas con habilidad a través de una lluvia de fuego láser, derribando naves enemigas a derecha e izquierda con tu fiel blaster. 🔫🪓\r\n</p>\n<p>A medida que avanzas más profundamente en la estación, te encuentras con un grupo de naves enemigas altamente armadas. Sin desanimarte, entras en un intenso combate aéreo, esquivando sus explosiones y devolviendo fuego con toda la habilidad y precisión de un piloto experimentado. 🛸🪓\r\n</p>\n<p>Finalmente, después de lo que parece una eternidad, emerge victorioso. Las naves enemigas son nada más que escombros humeantes, y eres saludado como un héroe. 🎉\r\n</p>\n<p>Pero tu aventura no ha terminado. A medida que continúas tu viaje a través del cosmos, te encuentras con todo tipo de peligros y desafíos. Te enfrentas a gigantescos asteroides, navegas por campos de asteroides peligrosos y luchas contra naves alienígenas. 🪐🛸\r\n</p>\n<p>A través de todo esto, te mantienes enfocado y determinado, sin dejar que nada se interponga en tu camino. Y al final, es tu valentía y habilidad las que te llevan a la victoria. Eres un verdadero campeón de las estrellas, y tu leyenda vivirá para siempre. 🌟🪐\r\n</p>", "metacritic": null, "released": "2022-12-24", "tba": false, "updated": "2022-12-26T09:50:38", "background_image": "https://media.rawg.io/media/screenshots/ab3/ab3eac844305e2c4c6793b2812172594.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Yone"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}