{"id": 901217, "slug": "battle-ballerinas", "name": "Battle Ballerinas", "name_original": "Battle Ballerinas", "description": "<p>In the distant year of 1997 war is history. The Earth is abandoned, the teeming masses of humanity writhe and cavort under a soot stained sky. Nation states have fallen by the wayside replaced by the very megacorps that blackened the firmament and boiled the oceans. Once the lives of workers were thrown away for the glory of tattered rags and vapid ideals. As Napoleon wrote \"The Last Argument of Kings\" on his cannons there is a new final weapon when politics fails. Now there is only one divider of weak and strong: </p>\n<p>Dance Battles</p>\n<p>You are Neptune, a fierce battle dancer given a simple ultimatum: Defeat the six expert battle dancers of Olympus Mons, win the tournament of champions, and be reunited with your family in time for the solstice. The consequences of failure are dire...</p><p>Before the tournament proper starts you should learn how dance battles are fought. Your partner is Phlox the Unintimidating.</p>\n<p>Drag a card from your hand (on the bottom left) to the base (on the middle left). </p>\n<p>When you do you can press the \"Go!\" button to start the turn.</p>\n<p>Each turn is made of some number of rounds equal to the number of bases.</p>\n<p>During each round the cards are compared from the middle out. If you win a round the opponent takes a point of damage. If you lose the round you take a point of damage. If you tie no damage is applied.</p>\n<p>The cards represent dance moves. The following rules are completely obvious:</p>\n<p>Kick beats Jump</p>\n<p>Jump beats Spin</p>\n<p>Spin beats Kick</p>\n<p>If you're not happy with your hand you can use the Mulligan button to exchange the cards in your hand but not on bases! You (usually) get 3 mulligans per bout.</p>\n<p>Good luck and on with the show!</p>\n<p>Sprites were created with Kenny's Creature Mixer: https://kenney.itch.io/creature-mixer</p>\n<p>The card sprites can be found here: https://opengameart.org/content/pixel-card-assets</p>\n<p>Music: https://commons.wikimedia.org/wiki/File:Tchaikovsky_-_Swan_Lake_Op.20_-_Act_I_In...<br/></p>\n<p>Here is the source code if you dare: https://github.com/assert-justice/secret_santa_jam_2022</p>\n<p>Thanks for playing!<br/></p>", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2022-12-26T12:09:53", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fd4f71251057232f8fbb39ba928296a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["etmm"], "genres": [], "publishers": [], "esrb_rating": null}