{"id": 901350, "slug": "megami-tensei-neuroheroine-2", "name": "Megami Tensei Neuroheroine 2", "name_original": "Megami Tensei Neuroheroine 2", "description": "<p>Megami Tensei Neuroheroine 2 is free fan-made game of Megami Tensei series. This game is free, and for personal use only, not for sale or redistribution. All the rights for Megami Tensei trademarks belong to ATLUS company.<br/></p>\n<p> \r\n  </p>\n<p>This game is direct sequel of Megami Tensei: Neuroheroine, so please be aware of <strong>spoilers</strong> below.\r\n  </p>\n<p> \r\n  </p>\n\n<p>Year 20XX, Neo Tallado City. It’s been two months since deceived heroine performed the Century Sacrament ritual and opened the gates from the world of demons. To save the survivors from hostile creatures, heroine proclaimed herself as the leader of the Counter Demon Forces organization. \r\n  </p>\n<p>Megami Tensei Neuroheroine 2 is the cyberpunk detective story and offer:\r\n  </p>\n<ul><li>First person dungeon crawling with big intricate dungeons\r\n  </li><li>Bosses with unique skills and dialogs during combat\r\n  </li><li>Companion demons with various magical skills to assist the heroine in battles\r\n  </li><li>Moon depended puzzles, chests, skills and weapons\r\n  </li></ul>\n<p> \r\n  </p>\n<ul><li>Desktop version of the game requires <strong>mouse </strong>and <strong>keyboard </strong>to play.\r\n  </li><li>You can press 'S' button to make a screenshot in the game folder.\r\n  </li><li>It is recommended to save often to separate save slots between story chapters and before entering the dungeon.\r\n  </li></ul>\n<p> \r\n  </p>\n<p>Game offers traditional turn-based combat with emphasize on <strong>Moon phases</strong>. Heroine can use swords and Elemental gun in combat. Using a sword costs <strong>Stamina</strong>. For example, one sword, when equipped, every Half-moon restores <strong>Stamina</strong>. Another Sword during a Full moon make double damage, etc. Sword can be equipped during battle without losing a turn. Using a regular gun costs <strong>Bullets</strong>. Using Elemental gun costs <strong>Bullets</strong> and <strong>EP</strong>. The gun does not do much damage, but hitting <strong>weakness </strong>of demon boosts the heroine's <strong>temporary Speed</strong>. \r\n  </p>\n<p>Using your companion demon skill costs <strong>Magic</strong>. Companion demon can be equipped during battle without losing a turn. In the sequel heroine also can use her <strong>Whip</strong> which was enhanced with magic. Aside from weaknesses demons can be <strong>Vulnerable</strong> to Elements like Ice or Fire. Using elemental skill of your companion demon may set enemy on <strong>Element</strong>. In this case you can perform elemental attack with your <strong>Whip</strong>. The power of your elemental <strong>Whip</strong> attack is depending on elemental <strong>Affinity</strong>. Equipped companion demon automatically increases corresponding elemental <strong>Affinity</strong> by 1 point when level up.\r\n  </p>\n<p>The heroine is subject to various <strong>ailments</strong>, like Burn, Frozen, Shock, Psyched, Fly, Mud, Stone, etc. Some of <strong>ailments </strong>can be cured by using items, some <strong>ailments </strong>can only be cured by talking to demons, some <strong>ailments </strong>can’t be cured at all.\r\n  </p>\n<p><strong>Intellect</strong> stat reflects the chance of successful negotiations with demons. <strong>Endurance</strong> stat reflects the chance of automatic ailments mitigation and possibility to sustain the fatal damage. <strong>Luck</strong> stat reflects the chance of <strong>Items</strong> drop increase and amount of <strong>Stamina </strong>and<strong> Magic</strong> recovery during <strong>SKIP</strong> turn option. <strong>Speed</strong> stat reflects the chance to act more often during battles.\r\n  </p>\n<p> \r\n  Builds for Windows, Linux, Mac and Android available for download.</p>", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2022-12-26T13:09:28", "background_image": "https://media.rawg.io/media/screenshots/063/063e65e4f6cbf6b1ea1bc2dfc7043632.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 302, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "Linux", "macOS", "PC"], "developers": ["JamesHillten"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}