{"id": 901463, "slug": "salty-trivia-with-candy-barre", "name": "Salty Trivia with Candy Barre", "name_original": "Salty Trivia with Candy Barre", "description": "The game show where the questions are ridiculous, but the answers are serious. Answer fun and witty trivia, listen to the host's wisecracks, and try to win the most cash! Play with a keyboard, a gamepad, or even a phone!\r\nJoin us!\r\n<p>Show us your questions, or just hang out and screw around, in our Discord server.</p>\n<p>Or check out our preview site here.</p>\r\nKnown issues\r\n<p>• If you play the HTML version on mobile, audio synchronization is very unstable during the starts of questions. Audio sync is a recurring issue with other Godot games exported for HTML5, and currently, there is no easy fix for it.</p>\r\nUpdates\r\n<p>• We are planning to bring you Episodes 1, 2, and 3 by the end of 2022. Stay tuned!</p>\r\nControls\r\n<p>Each player controls 6 gameplay buttons and 1 pause button.<br/></p>\n\r\nPhones\r\n<p>Use the hai!touch Gate to join in from your phone! (This feature can be turned off if you don't want to use it, or set to require manual approval of each player.)</p>\r\nKeyboard\r\n<p>Up to 4 players each control 6 keys arranged in 3 by 2 rows. Assuming US QWERTY, the key binds are: QWE/ASD, FGH/VBN, UIO/JKL, and Numpad 789/456.</p>\r\nGamepad\r\n<p>Up to 2 players can share a controller. Each player also uses a joystick to type.<br/></p>\n<p>There are 3 different methods to type your answers on a controller: the slow but familiar “Grid” keyboard, the fastest “DaisyWheel” keyboard, and the middle-of-the-road but intuitive “Spiral” keyboard.<br/></p>\r\nMouse/Touchscreen\r\n<p>The game can also be controlled with a mouse or a touchscreen. However, multi-touch is not supported, so please do not try to press multiple buttons at once and expect something special to happen. Only one player can use the mouse/touchscreen at once.<br/></p>", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2022-12-26T13:54:17", "background_image": "https://media.rawg.io/media/screenshots/ac2/ac26510fa8b92a46018a6904a846412a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "Linux", "PC"], "developers": ["hai!touch Studios"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}