{"id": 901609, "slug": "hugehead", "name": "HugeHead", "name_original": "HugeHead", "description": "Enter an abandoned village in the 70's and encounter the Japanese urban legend \"Giant Head O<br/>\r\nIt is a multi-end horror game.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\r\nThe Story<br/>\n<br/>\n<br/>\r\nThe protagonist is on his way home to his parents' house for a holiday weekend.<br/>\n<br/>\n<br/>\r\nHe drives his car on a deep mountain road.<br/>\n<br/>\n<br/>\r\nSuddenly, a human-like shadow jumps out and he slams on the brakes in a panic.<br/>\n<br/>\n<br/>\r\nBut he fails to do so in time, and runs over the shadow.<br/>\n<br/>\n<br/>\r\nHe gets out of the car and checks the road, but there is no one there, only a pool of blood.<br/>\n<br/>\n<br/>\r\nOnly a pool of blood was left on the mountain road.<br/>\n<br/>\n<br/>\r\nPerhaps the victim is in danger if he is not rescued in a hurry.<br/>\n<br/>\n<br/>\r\nFeeling a sense of unease, he follows the pool of blood and steps onto the mountain road.<br/>\n<br/>\n<br/>\n<br/>\r\nNumber of endings<br/>\r\n3<br/>\n<br/>\n<br/>\n<br/>\n<br/>\r\nGame system, operability<br/>\n<br/>\r\nThe game contains elements of survival horror in which the player runs and hides from enemies.<br/>\r\nIt contains elements of a walking simulator in which the player moves around the map while examining items.<br/>\n<br/>\r\nThe contents of this game are not related in any way to the actual content of Gigantorio that was posted on the Internet.<br/>\r\nThe content of this game has nothing to do with the actual content of the \"Gigantor\" posted on the Internet or the person who posted it, and does not support the accuracy of the urban legends.<br/>\n<br/>\r\nIn addition, please be aware that we have changed and added original settings in the making of the game.<br/>\r\nPlease be aware that we have made changes and additions to the original settings in the making of the game.<br/>\n<br/>\r\nWe welcome live game distribution.<br/>\r\nNo advance notice is required, but please include the URL of the store page in the summary section of the distribution page.", "metacritic": null, "released": "2022-12-29", "tba": false, "updated": "2022-12-30T04:01:18", "background_image": "https://media.rawg.io/media/screenshots/7de/7dedd41558b25ac7393295736ee64fad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 222, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["ribbongames"], "genres": ["Adventure", "Indie"], "publishers": ["ribbongames"], "esrb_rating": null}