{"id": 901678, "slug": "szybowcowa-87", "name": "Szybowcowa '87", "name_original": "Szybowcowa '87", "description": "Step back in time to the 1980s and step inside an apartment in a modernistic block in Wrocław that houses a secret printing house of Fighting Solidarity. Discover authentic polygraphic materials transposed into the digital world based on original documents from the collections of the Institute of National Remembrance.<br/><br/>The title of the app Szybowcowa ‘87 is a reference to a venue owned by Marek Petrusewicz, the first Polish world record holder in 100m swimming, Olympian, and silver medalist of the European Championships. Szybowcowa 87 was the address of the premises donated to Solidarity. The number 87 refers to the ‘crunch year’ of 1987, when one of the leaders of Fighting Solidarity, Kornel Morawiecki, was arrested.<br/><br/><strong>Plunge into this virtual experience and explore the printing house.</strong><br/><br/><br/><strong>Single-handedly duplicate copies of the free press.</strong><br/><br/><br/><strong>Discover semitransparent blotting paper prohibited by the authorities. </strong><br/><br/><br/><strong>Listen to the communications of the communist Security Service officers intercepted by Solidarity activists.</strong><br/><br/><br/><strong>Watch the regime’s propaganda Television Daily and an independent broadcast transmitted by the activists of Fighting Solidarity.</strong><br/>", "metacritic": null, "released": "2022-12-29", "tba": false, "updated": "2022-12-30T05:26:09", "background_image": "https://media.rawg.io/media/screenshots/9a8/9a81c576f08fd0d98781ba1659e124fd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 348, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Pictureworks"], "genres": ["Adventure", "Simulation"], "publishers": ["Instytut Pamięci Narodowej"], "esrb_rating": null}