{"id": 901670, "slug": "coin-pusher-casino", "name": "Coin Pusher Casino", "name_original": "Coin Pusher Casino", "description": "Coin pusher Casino is a game that brings the excitement of classic coin pusher machines to your computer. With realistic physics and colorful graphics, you'll feel like you're playing the real thing.<br/><br/>In Coin pusher Casino, you'll find multiple gameplay modes to keep things interesting. Test your luck and strategy in timed mode, or relax and unwind in zen mode. For a truly wild experience, try arcade mode where you can collect crazy powerups to boost your game.<br/><br/>With its engaging gameplay and realistic physics, Coin pusher Casino is a must-play for fans of arcade games. So why wait? Download Coin Pusher Casino now and start pushing those coins!<br/><br/>Please note that not all gameplay modes and features are implemented while in early access!<br/><br/>If you love (real) coin pushers, you know exactly why you love them! And that why is exactly this game!<br/>Coinpusher Casino delivers that juicy feeling, of coin stacks and chip towers, loudly crashing down and pusher dumping it all in the loot-shute for you to collect.<br/>Experience the satisfying simulator quality physics of pushing serious piles of coins and rewards for big profits toward you goal.<br/><br/>Play the game the way you like it with  Arcade, Classic and Zen mode!<br/><br/>Win credits and upgrade your gameplay with meaningful power-ups from the Perk-Shop!<br/>Collect playable coins and complete your collections.<br/><br/>Features:<br/><br/>- Simulator quality physics<br/>- Multiple unique playable machines and multiple coin setups (and more to come!)<br/>- Arcade mode  [action packed game] (not available, but is being worked on)<br/>- Classic mode  [classic game with a time limit]<br/>- Zen mode  [classic game with no time limit] (not available, but is being worked on)<br/>- A Perk-Shop for power-ups and coins<br/>- Collectibles<br/>- Specials<br/><br/>Perks<br/>- AutoPlay <br/>- AutoCollect <br/>- SkillStop<br/>- Lucky Charms bring you luck<br/>- Insert coin skill<br/>- Hold insert coin<br/><br/><br/>Nice things<br/>- Buy coins like copper, silver, gold and others to play with.<br/>- Uniquely themed machines<br/>- Play with keyboard/mouse or Controller (partially supported while in early access)", "metacritic": null, "released": "2022-12-28", "tba": false, "updated": "2022-12-30T05:16:23", "background_image": "https://media.rawg.io/media/screenshots/638/638a226cba7b0d12f69ddfc56199190b.jpg", "website": "https://coinpushercasino.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 306, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["TreeNutsGames"], "genres": ["Strategy", "Simulation", "Casual"], "publishers": ["TreeNutsGames"], "esrb_rating": null}