{"id": 901668, "slug": "package-dudes", "name": "Package Dudes", "name_original": "Package Dudes", "description": "<strong>Package Dudes</strong> is a great co-op game, where your main task is to sort packages coming on the conveyor belt. Time is ticking, packages never stop coming, so you have to work fast and smart! <br/><br/>Do whatever it takes to earn valuable points and gain <strong>the title of the employee of the day!</strong> But be careful - There will be floating platforms, lava and other difficulties...<br/><br/>...Didn't you read the contract carefully?<br/><br/><h3>KEY FEATURES:</h3><ul><li><strong>Sort packages!</strong> - Match the number on the package with the number of the drop zone and gain points! Easy, right? Wrong!<br/></li><li><strong>Difficult working conditions...</strong> - Wait, did that floor just move? And woah, is this lava real? Sure is, so look out! Maps will only get crazier and crazier, ain’t no rest for the Package Dudes!<br/></li><li><strong>Get the employee of the day title!</strong> - All tricks allowed for granting your team valuable points, so throw your package to another dude on your team, and kick away the package of your competition!<br/></li><li><strong>Work is better together!</strong> - Share your keyboard even with 3 other players or if you prefer, connect pads and enjoy a game up to 4 players! Simple controls and low entry level makes it a great family game no matter the age!</li></ul><br/><h3>PLANNED:</h3><ul><li><strong>Different types of packages!</strong> - Watch out for packages with special labels: Packages labeled Keep dry must not touch water and if you think about throwing a package labeled Fragile… Make sure it will be caught before hitting the ground!<br/></li><li><strong>Team up!</strong> -  Play with your friends in various teams, created however you like! 2v2? 1v3? Sure thing!<br/></li><li><strong>Pass the packages to your other team members!</strong> -  Throw them, kick them - foul play your opponents without mercy!</li></ul>", "metacritic": null, "released": "2022-12-28", "tba": false, "updated": "2022-12-30T05:13:58", "background_image": "https://media.rawg.io/media/screenshots/14d/14d97f28870d65b3b1f4acd602fad810.jpg", "website": "https://hodugames.pl/package-dudes-en/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 244, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Hodu Games"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Hodu Games"], "esrb_rating": null}