{"id": 901659, "slug": "new-yankee-karma-tales", "name": "New Yankee: Karma Tales", "name_original": "New Yankee: Karma Tales", "description": "King Arthur has another assignment of incredible importance for the brave and powerful duo that is John and Mary. A normally-steady stream of silk, spices, curiosities and resources has dried up and it’s down to John, Mary and friends to find out why! What has happened to the raja usually responsible for the shipping of these goods? Is he in danger or is there another reason for his disappearance?<br/><br/><br/><br/>It is up to you to help John and Mary on their journey in search of the missing raja. Along the way new faces will be met, some of whom may even prove to be quite beneficial! On their search for the missing raja our heroes will encounter many trials and tribulations and it will be up to you to get through them. <br/><br/><br/><br/>Race against time as you point and click your way through beautiful landscapes. Repair and upgrade structures, collect resources, mine for gold and do so much more so that you may ensure safe passage! You may even have to dance a little along the way, solve a puzzle and discover a mantra here and there and even paint a picture or two!<br/><br/><br/><br/>Time might be running out for the missing raja. Who knows what danger he could be in already? Download and play today to save him!<br/><br/><br/><br/><strong>FEATURES:</strong><br/><ul><li> More than 50 levels unique and challenging timed levels and even more in the bonus chapter<br/></li><li> 3 types of addictive mini games<br/></li><li> Plenty of upgrades and achievements to be unlocked<br/></li><li> Built-in strategy guide<br/></li><li> Original soundtracks for download<br/></li><li> Magnificent Wallpapers</li></ul>", "metacritic": null, "released": "2022-12-27", "tba": false, "updated": "2022-12-30T05:02:29", "background_image": "https://media.rawg.io/media/screenshots/3e7/3e7965858ca47ae08b161baa917ad4d6.jpg", "website": "https://steamcommunity.com/groups/alawargames", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 2, "owned": 1, "beaten": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yustas Games Studio"], "genres": ["Adventure", "Strategy", "Casual"], "publishers": ["Alawar Entertainment"], "esrb_rating": null}