{"id": 90176, "slug": "scooby-horror-remastered", "name": "Scooby Horror: Remastered!", "name_original": "Scooby Horror: Remastered!", "description": "<p>Story:\r\n Scooby Doo is missing! No one knows for sure where he is, but they've \r\ngot a clue.  He's been kidnapped by a group of ghosts in glowing diving \r\nsuits, hiding in the woods near a lake. They've probably got Scooby Doo!\r\n It's up to Shaggy to go and rescue Scooby from these creepy ghosts and \r\nput an end to this mystery. Who knows what screwed up things they've \r\nbeen doing to poor Scooby...</p>\n<p>It's time to go back to the past, in this classic Scooby Horror game \r\nthat has been remastered to be WAY better than the original! Experience \r\nwhat my vision was for the original Scooby Horror. Improved visuals and \r\nmodels, new objectives, dialogue, bushes to hide in and more!</p>\n<p>Now this doesn't mean I'm gonna be remastering Scooby Horror 2 and 3.\r\n For one, I don't want to be remastering two as that would be WAY too \r\nmuch work cause of not only how large the map was but because it was \r\njust a pain in the ass to make. As for the third game, that really \r\ndoesn't need a remaster honestly, since it was made during the period \r\nwhere I started to greatly improve in both my programming and modeling \r\nskills. But this isn't the end for Scooby Horror! I plan on making \r\nScooby Horror: Arcade this year. That game's basicly gonna be like \r\nScooby Horror on steroids. Multiple levels (possibly randomly generated \r\nif I learn how to program that), multiple villains and randomly selected\r\n objectives will keep the game interesting and addictive to play! I \r\nreally hope I can start working on that sometime this year or next year,\r\n we'll see.</p>\n<p>If you enjoyed the game, consider donating! as it helps me greatly. Anyway, I hope you have fun with the game! Cause boy did I have a lot of fun with this project.<br/><br/>Note: Despite the title of the game, these games were never really meant\r\n to be horrish, more like spookyish, and trying to capture the theme of \r\nthe show, y'know.<br/></p>", "metacritic": null, "released": "2018-08-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/735/7354984fed34b4ad5461bcf1c3c9181e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 135, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Dave Microwaves Games"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}