{"id": 901877, "slug": "restoration-itch-deplorable-mountaineer", "name": "Restoration (itch) (Deplorable Mountaineer)", "name_original": "Restoration (itch) (Deplorable Mountaineer)", "description": "Restoration\r\nThe future is medieval.\r\n<p>Pre-Alpha, content up to first boss only (about 20 minutes or so of gameplay).<br/></p>\n<p>Crawl through dungeons and build your character.  <br/></p>\n<p>After the Great Collapse, the world has restarted and we are up to the second middle ages.   It is the future, a long time ago.<br/></p>\n<p>Point and click with mouse to go to location, attack enemy, speak to NPC, buy from shopkeeper, etc.</p>\n<ul><li> Esc : pause game and see menu for saving, resuming, or quitting.</li><li> A : (hold) zoom in</li><li> Z : (hold) zoom out</li><li> J : see journal</li><li> Q : see quests</li><li> I : configure inventory</li><li> M : see map</li><li> T : configure traits</li><li>1,2,3,4,5,6 : use corresponding action in action bar at bottom of screen</li></ul>\n<p>When you acquire an equipable item (weapon, shield, hat, etc.), press I and drag it from inventory to the appropriate slot on the human-shaped equip location to use it.  When you acquire an ability (healing potion, etc.), press I and drag it from inventory to a slot in the action bar at the bottom of the screen.  Then typing 1, 2, 3, 4, 5, or 6 (according to which slot it is in) will activate the ability.</p>\n<p>You can buy items from shopkeepers (cursor looks like dollar sign when hovering over shopkeeper).  You can also sell them (switch the toggle from Buy to Sell) but not for the price you paid for them.  Pick up items (in glowing leather bags) by clicking on them.  Type I and drag from inventory to the ground to drop an item.<br/></p>\n<p>Game is auto-saved every time you pass through a portal (arch-shaped with glowing runes).</p>\n<p>Use the map (M) or zoom out (Z) to get your bearings.  <br/></p>\n<p>Use the journal (J) to recall information (e.g. if an NPC tells you where a certain path leads).  Remember, taking the wrong path too soon can be instant death!  Build your character first!</p>\n<p>Use (T) to allocate traits (more trait points available whenever you level up!) Some equipment cannot be used without certain trait levels.  Traits also increase damage, shielding, etc.<br/></p>\n<p>Note the future medieval English is a little different from modern or past medieval English!  And orc-ish and green-monkey-ish are incomprehensible!  Also, the video of gameplay is a slightly older version than what gets downloaded, so there are small changes.<br/></p>", "metacritic": null, "released": "2022-12-29", "tba": false, "updated": "2022-12-30T06:52:47", "background_image": "https://media.rawg.io/media/screenshots/78b/78bbf91f5d2884ee7ff5faeaa610721a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 253, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Deplorable Mountaineer"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}