{"id": 902177, "slug": "nova-lands-emilias-mission-itch", "name": "Nova Lands: Emilia's Mission (itch)", "name_original": "Nova Lands: Emilia's Mission (itch)", "description": "<p>You've just landed hard on an alien planet. The only way to survive is to build your own planetary base and make this world your new home. Explore different biomes, extract exotic resources, construct buildings and automate your industry with the help of cute bots. <br/></p>\n<p>In Nova Lands you will encounter the wild, uncharted world full of mysteries and surprises. But don’t worry – you also meet other survivors and unexpected allies among the local fauna.\r\n</p>\r\nDiscover the story of Emilia\r\n<p>Emilia's Mission is a prologue chapter of a survivor you'll meet in the main game. Learn your way around Nova planet at a steady pace and discover the basics of resource gathering, automation, and survival.</p>\n<br/>\n<p>New planet, new home. Build your new base with all sorts of resources available to you, from basic rocks and wood to rare and unknown materials. Unlock new opportunities with every new building, maximize efficiency, and push deeper to other islands.\r\n</p>\n<p>As you progress through the game, you will be able to automate more and more things, freeing up more time to explore! Your little helper bots will be instrumental in helping you do that.\r\n</p>\n\n<p>The bots are the tipping point where your ingenuity will begin to shine. These little self-sufficient machines can form entire production chains and sustain your industry all on their own. They’re easy to set up and manage.\r\n</p>\n<p>Just like you’re not the only person to land on this planet, your started island is one of many! Kickstart your industry to get all the tech you need and comfortably explore other islands. You’ll come across various biomes, creatures, landmarks, caves, and some really important people…</p>\n<p>Of course, there’s a blaster you can fire, and critters large enough to be a real menace! Engage in combat and gather rare materials, or, go the full pacifist route and remain a kind guest to this planet - even when boss creatures are concerned. Be prepared to offer valuables to make peace with them, however.</p>\n<p>-----</p>\r\nFollow us on socials to be aware of recent updates:\r\n<ul><li>Discord<br/>\n</li><li>Twitter</li><li>TikTok</li></ul>\n<p>-----</p>\r\nWishlist Nova Lands on Steam!", "metacritic": null, "released": "2022-12-28", "tba": false, "updated": "2022-12-30T08:59:35", "background_image": "https://media.rawg.io/media/screenshots/b94/b9431c99c8430e31d6e1cd08c665a550.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 132, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["hypetrain"], "genres": [], "publishers": [], "esrb_rating": null}