{"id": 90222, "slug": "monster-sanctuary-itch", "name": "Monster Sanctuary (itch)", "name_original": "Monster Sanctuary (itch)", "description": "<p>Monster taming meets metroidvania. Charming pixel art visuals accompanied by strategical turn based combat and in depth monster customization.</p>\n<p>As the youngest heir of an ancient bloodline of proud Monster Keepers, you step out into the world to follow in your ancestors' footsteps. You will gather a party of monsters to grow and train. Meanwhile, a series of unsettling events worries the experienced Keepers of the Monster Sanctuary. This is the beginning of a journey to unravel the cause of this mystery that threatens the peace between humans and monsters.</p>\n<p>Monster Sanctuary is the idea of combining monster collecting, turn based combat and metroidvania-like exploration. Any monster you encounter can become a part of your own party. Additional monsters provide a lot of tactical options in combat or allow you to overcome certain obstacles to explore new areas.</p>\n<p>Every monster has a unique skill tree. This lets you individualize your monster to pursue different strategies. Feeding and equipping your monsters to improve their stats further emphasizes this aspect.</p>\n<p>The combo system gives additional depth to the combat. Each individual hit increases the damage of the next moves within the same combat turn. The loot system challenges you to find the quickest and most efficient way to end a battle - rewarding you with better loot. Grind and find the best combo to earn the rarest monster eggs!</p>\n\n<p><strong>Follow the development</strong><br/>Monster Sanctuary is still early in development. You can follow the progress on</p>\n<p>Facebook<br/>Twitter</p>\n<p>Or join the community on Discord</p>\n\n<p><strong>Kickstarter planned in September</strong></p>\n<p>subscribe here https://monster-sanctuary.com to get notified!</p>", "metacritic": null, "released": "2018-08-08", "tba": false, "updated": "2019-08-28T23:26:15", "background_image": "https://media.rawg.io/media/screenshots/864/8640b0ed3f1e7805f392ed24edcbdd99.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Sersch"], "genres": ["Adventure", "RPG", "Platformer"], "publishers": [], "esrb_rating": null}