{"id": 902325, "slug": "snowboarder-game", "name": "Snowboarder Game", "name_original": "Snowboarder Game", "description": "<p><strong>Ride your snowboard down hills and off ramps in your race to the end of the levels!</strong></p>\n\n<p>This is a small prototype game intended to demonstrate my current Unity skills. After completing GameDev.tv's project taught in section three of their course \"Complete C# Unity Game Developer 2D,\" I added to the game to cement my knowledge before continuing my learning journey. The following is a list of additions I made:</p>\n<ul><li>Added a fade-in/out <strong>transition</strong> when changing screens.<br/>\n</li><li>Added <strong>sound effects</strong> for button clicks, sliding on the snow, countdown queues, and bird chirping background noise.<br/>\n</li><li>Added a <strong>menu</strong> with a title, a continuously playing <strong>animation</strong>, and start and quit buttons.</li><li>Added a level list with a continuously playing animation, a button for each level, a back-to-menu button, and an info/help tab button.</li><li>Added an <strong>info/help tab</strong> to explain the objective of the game and player controls.</li><li>Edited the character's 2D sprite in Paint.net.</li><li>Added a <strong>second and third </strong><strong>level</strong>.</li><li>Fixed a bug where the player's movement speed was directly proportional to the speed of the computer. Now, the player's speed is constant, regardless of the speed of the computer.</li><li>Fixed a bug where the player could rotate counter-clockwise anytime, but rotate clockwise only if not already rotating counter-clockwise. Now, the player can rotate both directions anytime.</li><li>Added a three-second <strong>countdown timer</strong> before starting a level, which pauses player movement.</li><li>Added a <strong>stopwatch</strong>, which starts at the end of the countdown and stops at the end of the level.</li><li>Added a pause menu that displays when the game was paused with a back-to-level-list button and a menu button. It stops the stopwatch and prevents the player from moving while the menu is up.</li><li>Added a death menu that appears when the player dies, with a menu button. It stops the player's movement and progress.</li><li>Added an end game menu, which displays the final time it took to complete the level, with a menu button. It stops all controls but does not stop character movement.</li><li>Added a project <strong>build name</strong>.</li><li>Added a project <strong>build icon</strong>.</li><li>Removed the Unity splash screen.</li><li>Built the project for Windows and WebGL, and uploaded it to itch.io</li></ul>\n\n<p>Adding on to the game was an educational experience. The following is a list of important concepts I learned while implementing additions:</p>\n<ul><li>Learned how to <strong>access separate scripts and game objects</strong>.</li><li>Learned what the <strong>public and private</strong> keywords do.</li><li>Learned simple use of <strong>coroutines</strong>.</li><li>Learned simple creation, rigging, and use of <strong>animations</strong>.</li><li>Learned how to implement <strong>sound effects </strong>or background noise into a game.</li><li>Learned how to create my own sprites in Paint.net.</li><li>Learned how to create and use <strong>Unity prefabs</strong>.<br/>\n</li><li>Learned how to create <strong>custom sprites</strong> and use them in a project.</li><li>Learned proper <strong>UI scaling</strong> for all aspect ratios.</li><li>Learned how to declare and use a <strong>Vector3</strong> variable.</li><li>Learned how to create <strong>circular buttons</strong>.</li><li>Learned how to <strong>edit multiple scenes </strong>at the same time.</li><li>Learned how to activate and deactivate game screens.</li><li>Learned how to <strong>change </strong>a <strong>project build name</strong>.</li><li>Learned how to <strong>change </strong>the<strong> </strong><strong>game icon</strong>.</li><li>Learned how to remove or change the default unity <strong>splash screen</strong>.</li><li>Learned how to <strong>build for Windows and WebGL</strong> applications.</li></ul>\n\n<p>I crudely implemented some features to finish the game on time. Taking the time to learn the proper way to implement every addition I made would be outside the scope of this small project. In the future, I plan on adding more levels and properly optimizing the game.<br/></p>\n\n<p><strong>Please give your feedback. Thank you!</strong></p>", "metacritic": null, "released": "2022-12-27", "tba": false, "updated": "2022-12-30T09:52:19", "background_image": "https://media.rawg.io/media/screenshots/384/384a6f7be79c091ade60f79451e04ee8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 13, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "macOS", "PC"], "developers": ["aboutalebdev"], "genres": ["Racing", "Platformer"], "publishers": [], "esrb_rating": null}