{"id": 902440, "slug": "digital-logic-sim-sebastian-lague", "name": "Digital Logic Sim (Sebastian Lague)", "name_original": "Digital Logic Sim (Sebastian Lague)", "description": "<p>A minimalistic digital logic simulator. You begin with two types of chips: AND and NOT. These simple built-in chips can be used to create your own custom chips, each of which can then be used inside of the next one, allowing you to build up layers of increasing complexity.<br/></p>\n<p>This is a work-in-progress project, which was created as a visualization tool for a video series in which I'm exploring the basics of how computers work. You can find the source code for the project here: (will add link soon...)</p>\n<p>Latest build: v1.0 (27 December 2022). The old version is still available here (save files are not compatible).</p>\r\nWhat's new:\r\n<ul><li>Edit, rename, or delete previously created chips (and projects)</li><li>Right-click on chips to view their internal state while the simulation is running<br/>\n</li><li>Save copies of a chip to quickly create variations or test ideas</li><li>Right-click on wires or pins to change their colour</li><li>A chip library, where you can find and manage all the chips in your project</li><li>Three new built-in chips: Clock, Tri-State Buffer, and Seven-Segment Display</li><li>Pins can now receive input from multiple wires. Please note that if conflicting inputs are received, the state of the pin will be determined randomly. To avoid this, the tri-state buffer should be used.</li></ul>\r\nLimitations:\r\n<p>The project currently has many limitations, but in particular I want to list things that have been shown in the video series, but which are not available in the current project. (I know these discrepancies are annoying, so I apologize for them, but it's hard to avoid without significantly slowing down work on the videos).</p>\n<ul><li>In episode 1, some groups of inputs/outputs have their decimal value displayed next to them. I plan to add this back in the future.</li><li>In episode 2, some signals are animated moving along the wires to help the explanation. This is currently not planned for the release version.</li><li>In episode 3, displays placed inside of a chip will be visible on the face of that chip when it's used inside of other chips. I still need to figure some stuff out with this feature, but it will be added in a future update.</li></ul>", "metacritic": null, "released": "2022-12-27", "tba": false, "updated": "2022-12-30T10:34:29", "background_image": "https://media.rawg.io/media/screenshots/18b/18bd4c5f6d7be4d6d7f1ad6320c009dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Sebastian Lague"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}