{"id": 902596, "slug": "ben-10-omnimix", "name": "Ben 10: OmniMix", "name_original": "Ben 10: OmniMix", "description": "<p><strong>B10: OMNIMIX</strong></p>\n<p>(Don't use headphones and please answer our form https://forms.gle/nig7kvmKQa9tvvm86 || No uses audífonos y por favor contesta nuestro cuestionario https://forms.gle/nig7kvmKQa9tvvm86)</p>\n\n<p>Too much text ahead, skip ahead if you want. || Alerta de mucho texto, sáltatelo si quieres.</p>\n<strong>English</strong><strong>Español</strong>\"What if we made a little celebration of the B10 franchise in form of a game where you play as the entire selction of aliens, but without limiting ourselves with just one way to play?\" <br/><br/>Welcome to B10: OmniMix, a little side project that we think has a lot of potential and was concieved under the premise of what we think is a good way to translate the versatility of this character and series into a game.<br/><br/>Our design philosophy consists of the following:<br/>Why would you transform just in one alien if you have 10 or more? Why would you only play as one of them when you can play with all of them? Why just having one game genere that doesn't let every transformation shine by their own? Why not make concepts easy to pick up that don't require a large investment of time per game?<br/><br/>So basically to not oversell it we plan to make a compilation of thematic minigames that adapt one or more aspects of every alien, like the core concept of his abilities, or an emblematic moment, or simply a fun way to play as the character.<br/><br/>And what are we planning to do to encourage you to keep playing? A lot of collectables! (Not implemented yet) Ben 10 has a lot of cool characters and cool designs and we wanted to incorporate that in our game, but being reasonable.<br/><br/>We didn't want to be overambitious considering our limited resources (mainly time or experience), so a casual grindy game with arcade like games seemed fine. Imagine if we made anothes pixel art rogue like or metroidvania lol (It's a joke, we actually like those  and they require a lot of talent, time and passion).<br/><br/>This version of the game has 3 minigames so far but imagine the possibilities: battle a swarm of drones with an alien bug, throw an evil octopus into outer space, eat a lot of trash, pinball on the insides of a big tick, defend a submarine from robotic squids and much much more to come.<br/>\"¿Qué tal si hiciéramos una pequeña celebración de la franquicia de B10 en la forma de un juego donde puedas usar a la selección entera de aliens, pero sin limitarnos a sólo una forma de jugar?\"<br/><br/>Bienvenid@ a B10: OmniMix, un pequeño proyecto que creemos tiene mucho potencial y originalmente partió de la premisa de lo que pensamos es una buena forma de adaptar la versatilidad del personaje y su serie en un juego.<br/><br/>Nuestra filosofía de diseño consiste en:<br/>¿Por qué solo transformarse en un alien si tienes 10 o más? ¿Por qué jugar con solo uno si puedes jugar como todos? ¿Por qué quedarnos en un sólo género que no deje a cada transformación brillar por su cuenta? ¿Por qué no colocar conceptos fáciles de entender que no requieran invertir mucho tiempo por partida?<br/><br/>Para no caer en exageraciones, planeamos hacer una recopilación de minijuegos temáticos que adapten uno o más aspectos de cada alien, como el concepto central de sus habilidades, un momento emblemático o simplemente una forma divertida de jugar como el personaje.<br/><br/>¿Y qué pensamos hacer para incentivarlos a seguir jugando? ¡Muchos coleccionables! (Aún no implementado) Ben 10 tiene muchos personajes con diseños geniales y queríamos incorporar eso en nuestro juego, pero siendo razonables.<br/><br/>No queríamos ser demasiado ambiciosos teniendo en cuenta nuestros recursos limitados (principalmente tiempo o experiencia), por lo que un juego casual donde ahorres recursos con juegos tipo arcade nos pareció buena idea. Imagínese si hiciéramos otro rogue like o metroidvania en pixel art XD (es una broma, en realidad ese tipo de juego si nos gustan y requieren mucho talento, tiempo y pasión).<br/><br/>Esta versión del juego tiene 3 minijuegos hasta el momento, pero imagina las posibilidades: lucha contra un enjambre de drones con un insecto alienígena, lanza un pulpo malvado al espacio exterior, come un montón de basura, juega pinball en el interior de una garrapata gigante , defiende un submarino de calamares robóticos y mucho más por venir.<br/>\n<p><strong>MINIGAMES</strong></p>\n<p><strong>If you reach more than 1000 points in any of our games you can be featured on the credits of our game. || Si alcanzas más de 1000 puntos en cualquiera de nuestros juegos podrías aparecer en los créditos del juego.</strong></p>\r\nXLRUN: Nothing like a morning run.<br/>Let's see how long can you keep your pace without running into anything, guess everyone had the same idea today.<br/>(The hardest game so far)XLRUN: Nada como correr por la mañana.<br/>Veamos qué tanto tiempo puedes mantener la velocidad sin que te detengan, parece que a todos se les ocurrió lo mismo el día de hoy.<br/>(El juego más difícil hasta ahora)\r\n\r\nUPCHONK: A big buffet of everything you can eat. Would you like a tasty motor or a tasty fork? Eat all the raining trash from the sky, but avoid the human food.<br/>(The easiest game so far)UPCHONK: Un gran buffet de todo lo que puedas comer. ¿Te apetece un delicioso motor o un suculento tenedor? Come toda la basura que cae y evita la comida humana.<br/>(El juego más fácil por ahora.\r\n\r\nSTINKGLIGHT: Survive a relentless army of Vilgax drones. You can freely fly and shoot whatever crosses your path, look out for lasers. How long can you survive?STINKFLIGHT: Sobrevive a un implacable enjambre de drones de Vilgax. Puedes volar y disparar a cualquier cosa que se cruce en tu camino, ten cuidado con los lasers. ¿Cuánto tiempo podrás sobrevivir?\r\n\n\r\nWe'd appreciate if you could give us your feedback, we will not collect email addresses, if Google asks you to log in to answer our questions we can't do anything about it. Thanks for checking out our little project.<br/>https://forms.gle/nig7kvmKQa9tvvm86<br/>We also prepared a Discord server: https://discord.gg/3uAqcesPyeApreciaríamos que nos dieran su retroalimentación, no recopilaremos direcciones de correo electrónico, si Google les pide que inicien sesión para responder a nuestras preguntas no podemos hacer nada al respecto. Gracias.<br/>https://forms.gle/nig7kvmKQa9tvvm86<br/>También preparamos un servidor de Discord: https://discord.gg/3uAqcesPye\r\n\n<p><strong>Little extra points and questions you may have:</strong>\n</p>\n<ul><li><strong>The .exe and .apk files can be detected as dangerous by Windows or Android, in general be careful of what you download from the internet. To run our game you'll need to tell Windows to run the program even if it doesn't come from a well known developer or some already known store (you can also run an antivirus diagnostic if you're skeptical) or activate the unknown sources option on your phone that prevents downloading or opening apps that weren't obtained on the Play Store.</strong></li></ul>\n<ul><li>Is this an official game? No, and we are not gonna pretend it is, we do not own the rights for Ben 10, we are just random dudes making a little game.\r\n</li><li>Maybe you want to join the team? You can contact us if you think you want to be part of this project.\r\n</li><li>What game engine are you using? Godot.\r\n</li><li>Can you add this alien or that character to the game? We are focusing on the first series and not exactly in any particular order, we hope we can expand the game enough to the other series.\r\n</li><li> Where do I send my feedback (and maybe death threats)? Well, here's a little google form (https://forms.gle/nig7kvmKQa9tvvm86), but if you want to send us an e-mail here it is: \"team.plomeros10@gmail.com\". </li><li>Why B10? So maybe we don't get sued.</li><li>Why is Y0L0 so handsome? Nobody actually asks that.\r\n</li></ul>\n\n<p><strong>As our main team we have:</strong>\n</p>\n<ul><li>Norge: The lead programmer, he takes care of the main code, and the one who first made a working prototype for our game.\r\n</li><li>THONY: Also a programmer that handles a lot of details and polish, he also takes care of the android versions.\r\n</li><li>EddWarwick: Composer of our soundtrack, also playtests a lot every new version of the game.\r\n</li><li>Y0L0TH3M4N: The artist of every asset, kinda bosses around with the to-do list after testing every change.\r\n</li></ul>\n<p><strong>Special thanks to:</strong>\n</p>\n<ul><li>IanGameplayHans: He shared with us some code to start the XLR8 minigame.\r\n</li><li>The Original #TeamPlomeros: We used to do memes.\r\n</li><li>Cartoon Posting: A lovely community.</li><li>SDLG :v</li><li>Our families and friends who didn't actually knew we were making this game.</li><li>Luis Espinoza: The first person to score more than 1k points on XLRace (1370) and StinkFlight (1450)</li><li>0M1N: The record holder for XLRun (1510)</li></ul>", "metacritic": null, "released": "2022-12-26", "tba": false, "updated": "2022-12-30T11:33:13", "background_image": "https://media.rawg.io/media/screenshots/7e9/7e99610a56f9190ced4fbb921640692d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 149, "game_series_count": 15, "reviews_count": 0, "platforms": ["Android", "PC"], "developers": ["TeamPlomeros"], "genres": [], "publishers": [], "esrb_rating": null}