{"id": 90277, "slug": "ellen-demo", "name": "Ellen Demo", "name_original": "Ellen Demo", "description": "<p>If you don’t believe in paranormal events, meet the people from White Hill.</p>\n<p>It’s been years since all but the daughter in the Smiths’ family were found brutally murdered. The people of the town are getting uneasy as more and more witnesses have spoken about seeing the silhouette of a little girl standing in the house. Rumors spread that the silhouette has to be Ellen, the daughter of the Smith’s family, whose body was never found during the investigation of the murders. 1 year later, James, a bright and eager investigator, has taken matters into his own hands to finally reveal the truth of what happened that horrible night.</p>\n\n<ul><li>Play as James, an intelligent detective who is trying to get to the bottom of the paranormal events happening in the Smiths' Residence at White Hill.</li><li>Dive into an emotional and thrilling experience while solving puzzles and persisting through nerve-racking scenarios.</li><li>Listen to breath-taking soundtracks as you’re traversing through the unnerving residence of the Smiths' in a beautiful pixel art style.</li><li>Enjoy the atmospheric storytelling as you unfold the mystery by completing all chapters.</li></ul>\n<p><strong>Follow Ellen The Game:</strong> Twitter | Instagram | Facebook</p>\n\n<p><strong>Official Site: </strong>www.ellen-game.com</p>\n<p><strong>Contact: </strong>hello@redmountmedia.com</p>", "metacritic": null, "released": "2018-03-21", "tba": false, "updated": "2019-08-28T23:26:15", "background_image": "https://media.rawg.io/media/screenshots/a1c/a1c50eea62d36f58aa323da6fa2cf6a1.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 178, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Red Mount Media", "Invoker"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}