{"id": 902778, "slug": "cairn-yliader", "name": "Cairn (Yliader)", "name_original": "Cairn (Yliader)", "description": "<p>Cairn is a platformer made on<strong> GB-Studio</strong>, created by <strong>Chris Maltby</strong>, and using some plugins from <strong>Pau Thomas</strong> (thanks for them !).<br/></p>\n<p>You are <strong>Amber</strong>, a young novice who must prove herself to become a confirmed priestess.    </p>\n<p>Explore a labyrinthic temple shared by three goddesses, and regain their power to escape safely.  \r\n<br/></p>\n\n<p>It's a game that I've been developping alone since 2 years . It's a <strong>puzzle game</strong>, no enemies to defeat except your own mind. <br/></p>\n<p>The game is on its way, I spent a lot of time doing all the concepts arts and working on the narration, to have a very precise idea of what I have to do now. I started scripting and drawing from November, spending about 1-2 hours per scene, and more to code.</p>\n<p>A large part of the lore and advices for the puzzles are inside the stories of every objects, so keep an eye in the menues.<br/></p>\r\n\r\nWhat do I want to do with it\r\n<p>I want to share it like my 2 other games : <strong>free price</strong> in digital release, and the less price in physical release.</p>\n<p>But for that, I need all the help that you can give. So if the project please you, and if you can do it, give something. Even 2€ could be good (it's the BEST) !<br/><br/></p>\n<p><strong>I don't want to do kickstarter</strong> or other things simply because I clearly don't have the time and the strenght to manage it, but I never wanted to keep my skils for me (you can go to my github to see all my projects on open source).</p>\n<p>Thanks !<br/></p>", "metacritic": null, "released": "2022-12-25", "tba": false, "updated": "2022-12-30T12:49:43", "background_image": "https://media.rawg.io/media/screenshots/34c/34cf92ffc894e9902033761750ecf238.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 97, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Yliader"], "genres": ["Adventure", "Platformer"], "publishers": [], "esrb_rating": null}