{"id": 902815, "slug": "pillar-of-demise", "name": "Pillar of Demise", "name_original": "Pillar of Demise", "description": "<p> Welcome to the playable prototype of our first upcoming game: <strong>Pillar of Demise </strong></p>\n<p><em>A mad wizard has seized control of an ancient tower and has unleashed the evil magic sealed within! Can you climb to the top and stop him? Only one way to find out: Step forward and take courage!</em></p>\n<p><strong>Controls :</strong></p>\r\nActionsGamepadKeyboardMoveLeft joystick / Directional pad<br/>ZQSD / WASD / Directional arrows<br/>Jump<br/>Xbox A, Nintendo B, DualShock Cross<br/>Spacebar<br/>AttackXbox B, Nintendo A, DualShock Circle<br/>Enter<br/>Menu Select<br/>Xbox A, Nintendo B, DualShock CrossEnter key<br/>Menu Back<br/>Xbox B, Nintendo A, DualShock CircleBackspace<br/>Pause game<br/>Start button<br/>Escape (desktop version) / P<br/>\n\n<p>This is a <strong>2D vertical platformer</strong> paying hommage to the NES games of old and just like those: <strong>simple controls</strong>. You can run, jump and attack in four directions. To beat this tower, you will need to jump carefully and use the mysterious lanterns scattered around wisely but beware: a <strong>deadly laser</strong> will continuously rise without stops, touch it and it's <em>Game Over</em> for you so make haste!</p>\n<p>As mentioned, this is a <em>polished prototype</em>, meaning everything you'll see or hear will change.  Further more, many new mechanics will be added in the full release to spice things up, you will have a taste of what we mean in<em> the <strong>demo</strong> we will release in early 2023</em>. <strong>In here</strong>, we propose to you the core of Pillar of Demise's gameplay so if you enjoyed yourself now, you will probably like what's to come even more, we are making an English Discord server that will be available end of January 2023 if you are interested to follow us.</p>\n<p>Thanks for checking us out, I hope you will like the surprise at the end! -Neo White</p>\n\n\n<p>Bienvenue sur le prototype jouable de notre premier jeu: <strong>Pillar of Demise</strong><br/></p>\n<p><em>Un vil sorcier a pris le contrôle d'une tour antique et a libéré la magie maléfique qui était scellée à l'intérieur! Pouvez-vous grimper jusqu'au sommet et l'arrêter? Une seule façon de le savoir: Prenez votre courage à deux mains et lancez-vous!</em></p>\n<p><strong>Contrôles :</strong><br/></p>\r\nActionsManetteClavierSe déplacer<br/>Joystick gauche / Croix directionnelle<br/>ZQSD / WASD / Flèches directionnellesSauterXbox A, Nintendo B, DualShock CroixBarre d'espace<br/>AttaquerXbox B, Nintendo A, DualShock RondEntrée<br/>Valider Menu<br/>Xbox A, Nintendo B, DualShock CroixTouche EntréeRetour Menu<br/>Xbox B, Nintendo A, DualShock RondRetour arrière<br/>Mettre en pause<br/>Bouton Start<br/>Echap (version bureau) / P<br/>\n\n<p>Ce jeu est un <strong>platformer 2D vertical</strong> rendant hommage aux jeux de la NES et comme eux: des <strong>contrôles simples. </strong>Vous pouvez sauter et attaquer dans quatre directions. Pour vaincre cette tour, vous allez avoir besoin de sauter précisément et d'utiliser les mystérieuses lanternes dispersées un peu partout mais faites attention: un<strong> laser mortel</strong> va continuer de monter sans arrêt, touchez le et c'est <em>Game Over</em> pour vous alors dépêchez-vous!</p>\n<p>Comme dit plus haut, ceci est un <em>prototype raffiné</em>, donc tout ce que vous verrez et entendrez va changer. De plus, de nombreuses nouvelles mécaniques seront ajoutées dans la version finale pour ajouter du piment. Vous aurez un avant-goût dans la <strong>démo</strong> <em>que nous sortirons en début 2023. </em><strong>Ici</strong>, nous vous proposons le cœur du gameplay de Pillar of Demise alors si vous vous êtes amusés maintenant, vous aimerez probablement ce qui suit et si vous le voulez: vous pouvez nous rejoindre sur notre serveur Discord dédié pour nous suivre.</p>\n<p>Merci pour votre attention, J'espère que vous apprécierez la surprise à la fin! -Néo White</p>", "metacritic": null, "released": "2022-12-23", "tba": false, "updated": "2022-12-30T13:06:17", "background_image": "https://media.rawg.io/media/screenshots/035/03534ca9c2062a4edff8597cabaf23d8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 37, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["NS Bros"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}