{"id": 90287, "slug": "r-coil-itch", "name": "R-COIL (itch)", "name_original": "R-COIL (itch)", "description": "<p>R-COIL is an old-fashioned multidirectional shooter with a unique single button control scheme.<br/></p>\n\n\n<p><strong>*** THIS GAME REQUIRES A GAMEPAD OR A MOUSE ***</strong></p>\n<p><strong>*** NOW ON STEAM ***</strong>\n</p>\n<p><em>If you buy it here and you want key for there, just let me know!</em></p>\n<p>Use the stick to aim and a single button to fire and thrust. Tap to fire. Hold to thrust. Each time you fire your bullet will push you back a little. You’ll have to balance shooting and thrusting to maintain control. Once you master it you’ll be cruising through the cosmos like a space boss in no time. Just try not to get yourself killed.</p>\n\r\nEasy right? Wrong!\r\n<p>This is not the friendly part of space and whatever you run into isn’t going to be happy to see you. There are shielded sharpshooting saucers, bullet spewing spinners, laser towers, and kamikaze buzz-saws to name a few. In fact, if it’s not a rock, you’re probably going to have to try to kill it before it kills you.</p>\n<p>Hordes of dangerous enemies<br/></p>\n<p>But, don’t worry. With over 25 and counting power-ups you’ll have lots of tools at your disposal for dishing out cold space death.</p>\n<p> <br/>Lots of power-ups<br/></p>\n<p>Still felling stressed about your chances of survival? Not into super difficult games? That's okay too. Turn on <strong>Stress Free Mode</strong> and blast away!</p>\n\r\nSpace is lonely…\r\n<p>But you won’t have to be because R-COIL supports up to eight simultaneous local players. You can play in Co-op Mode and help each other take on the universe or in Duel Mode where you’ll go head to head to see who is the true master of space.</p>", "metacritic": null, "released": "2017-02-18", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/28e/28e169666cd89f4d8ced9103f3966f25.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 39, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Vector Hat"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}