{"id": 9028, "slug": "solar-2", "name": "Solar 2", "name_original": "Solar 2", "description": "<p>Solar 2 is a game about astronomy and a sequel to Solar. The game allows the player to control a celestial body and help it to become a planet or a star. </p>\n<h3>Premise and goals</h3>\n<p>In the beginning, the player assumes control over a small asteroid. As it grows in size, it becomes a dwarf planet, then a planet that can sustain life. Growing further, it may become a star with its own planetary system, and eventually a black hole. </p>\n<p>The ultimate goal of the game is to gather all of the universe&#39;s mass into a big crunch. Then it will explode and recreate the space with a Big Bang. However, the player is free to stay at any size instead and not to complete the main goal. There are also optional missions that the player can complete to receive achievements.</p>\n<h3>Gameplay</h3>\n<p>The player navigates his or her astronomical object through space, which is a randomly generated open world. To accumulate your object&#39;s mass, you have to collide it with smaller objects and absorb their matter. The objects that are larger than yours will only take its mass away if you hit them. Your object can decrease in size, but it cannot downgrade from a planet to asteroid or from a star to a planet. If destroyed, it will respawn with approximately the same mass.</p>\n<p>As your planet grows to the life-sustaining size, it will eventually develop a civilization that will launch spaceships. Other planets can have spaceships as well. They will attack other planets and asteroids to destroy them and engage in space wars with your civilization.</p>", "metacritic": 72, "released": "2011-06-17", "tba": false, "updated": "2024-04-06T12:36:19", "background_image": "https://media.rawg.io/media/screenshots/dfd/dfdb058ecbccbd3b26535f66e93affee.jpeg", "website": "http://murudai.com/solar/", "rating": 3.15, "rating_top": 4, "added_by_status": {"yet": 55, "owned": 1177, "beaten": 27, "toplay": 3, "dropped": 17, "playing": 1}, "playtime": 2, "achievements_count": 25, "ratings_count": 67, "suggestions_count": 96, "game_series_count": 0, "reviews_count": 67, "platforms": ["PC", "Linux", "Android", "macOS", "iOS"], "developers": ["Jay Watts", "Murudai"], "genres": ["Action", "Simulation", "Casual", "Indie"], "publishers": ["Jay Watts", "Murudai"], "esrb_rating": null}