{"id": 902926, "slug": "motorcubs-rc", "name": "MotorCubs RC", "name_original": "MotorCubs RC", "description": "MotorCubs RC is a savage offroad racing game with 4 classes of RC Vehicles piloted by professional racing bears. Set in gorgeous Monument Valley with towering buttes and countless hazards for a crazy, nostalgic ride! Each of the levels provides harrowing thrills in Single Player and 2 Player Local Multiplayer, requiring top notch skill to win first place and unlock new content.<br/>\n<br/>\r\nGameplay emphasizes steep climbs and sudden drops while players jockey for position. Players must match their selected vehicle class to the nuances of each track. Monument Valley is filled with interactive rocks, mud, and wreckage for the player to avoid. Foliage and rock formations set the track boundaries, and players will need to take risks to shave precious seconds off their lap times. <br/>\n<br/>\r\nThe soundtrack sets a mood with upbeat 90’s rock songs composed specially for MotorCubs RC by our in-house musician, Evan, to invoke a sense of nostalgia and adrenaline. The energetic riffs of his music enhance the fast paced action of the races, and are guaranteed to become fan favorites!<br/>\n<br/>\r\nExpect to be tested on every turn, every jump.  All A.I. vehicles are equipped with varying levels of skill and aggression, with absolutely NO rubber banding. If you win these races it's because you're a kickass driver!<br/>\n<br/>\r\nThe game is tested with the Xbox Series controller. Please add to the Discussions page if you have issues with another brand of controller.", "metacritic": null, "released": "2022-12-29", "tba": false, "updated": "2023-01-02T02:44:35", "background_image": "https://media.rawg.io/media/screenshots/c5b/c5bf1ac13b0510edaad0da48c5362a24.jpg", "website": "https://draiseydigital.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 287, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Draisey Digital"], "genres": ["Racing"], "publishers": ["Draisey Digital"], "esrb_rating": null}