{"id": 903038, "slug": "swarm-defense-planetary-invasion", "name": "Swarm Defense: Planetary Invasion", "name_original": "Swarm Defense: Planetary Invasion", "description": "<p><strong>Swarm Defense: Planetary Invasion</strong> is a prototype of massive tower defence, demo allows the player to play one endless mission and collect points for a better score.</p>\n<p>The player has access to a few upgradable basic towers and four special towers whose upgrades save between games (each special tower has 8 more upgrade levels than the basic versions and access to a unique ability). During defence, our task is to survive for at least 10 minutes, with hundreds of enemies attacking us, their target is our teleportation transporter, in addition to creating and upgrading towers we can collect materials from the planet and defeated enemies.</p>\n<p>The full version is planned as Survival Tower Defense, the campaign will consist of 4-6 hour sessions where the player's task is survival not victory. The player will be given access to an entire planet which they must defend by completing short dynamic Tower Defence missions and managing the planet's troops and resources in turn-based mode.</p>\n\n<p>Swarm Defense: Planetary Invasion <strong>does not represent</strong> the final concept of our project,  in the full version we plan to move to Brutal 2D/3D Pixel Art style, our game is expected to feature massive number of enemies, large scale objects, heavy story atmosphere, unique mechanical solutions as well as dynamic gameplay.</p>\n<p>Some of these elements you can see in this demo,  Swarm Defense Demo is an unstable fragment of the original idea, you may encounter bugs, balance problems or mechanics that don't quite make sense, our goal here was mainly testing and pure fun of creation, we will be grateful if you give us your feedback as well as ideas for the development of the full version of our game.</p>\n\n<p><strong>To learn the keybindings hold down 'H' during the main game.</strong><br/></p>\n<p><em>The game may take a while to load, sounds may be delayed when first played.</em></p>\n<p><strong>Custom Engine</strong> FROSTengine (JS, HTML5)\r\n</p>", "metacritic": null, "released": "2023-01-01", "tba": false, "updated": "2023-01-02T04:08:32", "background_image": "https://media.rawg.io/media/screenshots/22e/22eebce596450ea26ee35bec7082502e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 233, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["CUTFUJI Games"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}