{"id": 903102, "slug": "movesmart", "name": "MoveSmart", "name_original": "MoveSmart", "description": "<p># MoveSmartGame</p>\n<p>A game that is harder then you think</p>\n<p>The python source code is on Github</p>\n<p>You will have to download all of the assets too and have them in the same directory</p>\n<p># Object of the game</p>\n<p>The object of the game is to navigate a grid and reach a certain number of moves (100 moves in this case) and cover the entire grid with enemy squares that will appear in the squares that you have been in. If the player collides with an enemy they will lose.</p>\n<p># Controls</p>\n<p>The player can move around the grid using the numeric keypad (2, 4, 6, 8, 1, 3, 7, 9).</p>\n<p>Pressing 2 moves the player down three grid space.</p>\n<p>Pressing 8 moves the player up three grid space.</p>\n<p>Pressing 4 moves the player left three grid space.</p>\n<p>Pressing 6 moves the player right three grid space.</p>\n<p>Pressing 1 moves the player down and left two grid space.</p>\n<p>Pressing 3 moves the player down and right two grid space.</p>\n<p>Pressing 7 moves the player up and left two grid space.</p>\n<p>Pressing 9 moves the player up and right two grid space.</p>\n<p># How to play</p>\n<p>Start the game by running the code.</p>\n<p>A window with a grid background will appear, along with a small player image and one or more enemy images.</p>\n<p>Use the numeric keypad (2, 4, 6, 8, 1, 3, 7, 9) to move the player around the grid.</p>\n<p>Avoid colliding with the enemy images.</p>\n<p># Extra</p>\n<p>I received this game idea from my teacher, who learned it from another teacher. We played it in class before winter break and found it to be both fun and challenging. I transformed it into a game that anyone can play and initially intended to create an AI to solve it. However, I decided to share it on GitHub before modifying it to work with an AI.</p>", "metacritic": null, "released": "2023-01-01", "tba": false, "updated": "2023-01-02T04:43:55", "background_image": "https://media.rawg.io/media/screenshots/403/4030655fc8512678a600a5da1df8234b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 3, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Vikto"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}