{"id": 903121, "slug": "the-other-island", "name": "The Other Island", "name_original": "The Other Island", "description": "This demo is a part of a visual novel project that will include mature content. Adults only, please.\r\n<p>A fox lives alone on a deserted island, believing themselves to be the planet's sole inhabitant. They have everything needed for survival, but little in terms of purpose, spending their days swimming in the ocean and reading whatever they can get their paws on online.</p>\n<p>But there is something else – another island, possibly within reach, but far ahead of what would be a comfortable swim. As years pass, it becomes an obsession that refuses to leave them alone. Should the fox brave the trip, what will they find?</p>\n<p>- - -</p>\n<p><strong>The Other Island</strong> is a kinetic novel that acts as a demo for <strong>The White Tigers</strong>, an upcoming visual novel project. Playable in Finnish and English, it is a self-contained introduction to the story and its protagonist. (We're looking for artists – check out the project website for more details!)</p>\r\nCredits\r\n<p>Written by purkka, with graphical contributions from Drake, Pilotti, and triviaboy94. Full sources of free assets used are included in the game. </p>\r\nBugs &amp; Feedback\r\n<p>The game uses a custom visual novel engine I'm building for the larger project on top of Godot. As such, I'm happy to hear about any issues you might run into or any features you'd like to see; please leave a comment, reach out on Twitter, or join our Discord!</p>\r\nTranslation Note\r\n<p>The game is available in Finnish and English, but the engine supports fan translations distributed as separate packages. Download the translation assets for more info, and contact me for assistance or feature requests.</p>", "metacritic": null, "released": "2023-01-01", "tba": false, "updated": "2023-01-02T04:54:24", "background_image": "https://media.rawg.io/media/screenshots/87f/87f987f526d335392b598b79127ba451.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 85, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["purkka"], "genres": [], "publishers": [], "esrb_rating": null}