{"id": 903248, "slug": "mr-north-pole-the-search-for-secret-santa", "name": "Mr. North Pole - The Search For Secret Santa", "name_original": "Mr. North Pole - The Search For Secret Santa", "description": "<p>He's the viral sensation sweeping the nation… a pernicious prankster or an admirable activist, depending on who you ask - or perhaps whether you're \"naughty\" or \"nice,\" Secret Santa (@lil_saint_se3ret) has been breaking the internet with his high-profile, holiday-themed hijinks. And now, on December 1 2022, he's appeared disguised on video for the FIRST TIME ever, all to announce… he's entering the Mr. North Pole Mall Santa Pageant, held in the Mall of America in Bloomington, Minnesota?! <br/></p>\n<p>Filmed on-site and interviewing the REAL staff and participants, this documentary follows the pulse-pounding, twist-turning, festively-frivolous Mr. North Pole 2022 Pageant from start to finish, all an attempt to answer the public's many burning questions, including:\r\n</p>\n<ul><li>What does Secret Santa want?\r\n</li><li>Why would such a high-profile internet celebrity enroll in such a comparatively mundane contest?\r\n</li><li>Is there some special connection between Secret Santa and the Mr. North Pole pageant? \r\n</li></ul>\n<p>and the most irresistible question of all…\r\n</p>\n<p><strong>WHO IS SECRET SANTA?\r\n</strong></p>\n<p><em>Created by Drew Tenenbaum and Harry Mackin, \"Mr. North Pole: The Search for Secret Santa\" is a comedic mockumentary visual novel following a team of documentary film makers as they attempt to track down the truth about viral social media star Secret Santa during the 2022 Mr. North Pole pageant. For the Winter 22 Jam, Drew and Harry created the Introduction to Mr. North Pole, along with Episode 1: The Naughty List. Stay tuned for more updates as the mystery continues to unravel!</em>\n</p>", "metacritic": null, "released": "2023-01-01", "tba": false, "updated": "2023-01-02T06:13:46", "background_image": "https://media.rawg.io/media/screenshots/7d1/7d1ecfb0fc7336481d815736a83bb198.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 101, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["drewby"], "genres": [], "publishers": [], "esrb_rating": null}