{"id": 903292, "slug": "the-cauldron-mystery-coconut", "name": "The Cauldron (Mystery Coconut)", "name_original": "The Cauldron (Mystery Coconut)", "description": "The Cauldron\r\n<p>As a witch, there is nothing worse than your cauldron coming alive and spitting dimensional horrors all over your kitchen. You have 12 hours to summon your own friendly creatures, surround the cauldron, and hex it!</p>\n<p>This game was created for the Week Sauce game jam of October 2022, whose theme was <em>Hexes!</em>, but it was not finished until the end of the year, when I finally had some free time. It is still missing a lot of stuff: most cards don't have art, it needs a proper tutorial, sounds for half the things in the game, better graphics, animations, and sounds… I will finish it when again I have some time off, I promise! Until then, the main thing you need to play is understand how combat works.</p>\r\nHow the Hex Does Combat Work??\r\n<p>You will notice that every friendly creature, monster, and item in the game has a little number inside a hex symbol over it: this is their <strong>defense value</strong>!</p>\n<p>If when the other side attacks there are at least that many enemies adjacent to the unit, it is hexed, and will disappear from the board. As you can see, the cauldron's defense value is 6, so you need to surround it completely to hex it. Your starting unit, the clock, cannot be hexed, but every time it is attacked it advances as many hours as enemies around it, so you better protect it!</p>\n<p>When do units attack? Your friendly units will attack immediately after you click the \"Next turn\" button. Monsters will attack in their own \"Monsters Attack\" phase. Items do not attack, and are not attacked by monsters… they are things only you can collect by hexing them.</p>\r\nWhat's With the Cards Flipping?\r\n<p>Every time you cast a spell (play a card), you need to <strong>pay its cost</strong> (the number in the top left corner over a moon). To do so, you need to discard as many cards from your hand as the cost.</p>\n<p>Anyway, hope you enjoy!<br/>—Miguel Friginal</p>", "metacritic": null, "released": "2023-01-01", "tba": false, "updated": "2023-01-02T06:40:16", "background_image": "https://media.rawg.io/media/screenshots/b9f/b9f45d631582f1b2f1443fe13734e8dc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 20, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Mystery Coconut"], "genres": [], "publishers": [], "esrb_rating": null}