{"id": 9033, "slug": "color-sheep", "name": "Color Sheep", "name_original": "Color Sheep", "description": "Now with Game Center achievements, new and improved difficulty modes, optimizations for Retina devices, and cheering critters!<br/><br/>Kotaku: “I’ve not had this much fun mixing colors since — I’ve never had this much fun mixing colors.”<br/><br/>New York Times: “...your once-fumbling fingertips will be flying across the spectrum. You’ll barely notice you’ve learned something without having to crack open a single crusted-over container of paint.”<br/><br/>Entertainment Weekly: “What’s a color-changing lamb to do when it’s being attacked by multihued wolves? Incinerate them with lasers beams, obviously, in this whimsical shooting game.”<br/><br/>Hordes of vicious wolves have emerged from the mouth of Wolfcano to steal life and color from the world. Now the Knight of Light, Sir Woolson, must ready his color-changing fleece and magical powers as the last defense against the darkness!<br/>Color Sheep is a fast-paced arcade game in which players change Woolson’s color to match oncoming wolves by mixing different intensities of red, green, and blue light. An intuitive swipe-based interface makes forming combos a breeze. When Woolson is charged, tap him to release an incinerating laser blast! Magical items dropped by enemies summon fantastical nature spells to protect Woolson and smite the evil lupine invaders. With over twenty color combinations to master, three difficulty modes to choose from, Game Center leaderboards to climb and achievements to unlock, Color Sheep is easy to learn but hard to put down!<br/><br/>* Mix red, green, and blue to master the power of light!<br/>* Discover Woolson&amp;#39;s arsenal of spectacular spells!<br/>* Climb the leaderboards and best your friends and family!<br/>* Works great and looks amazing on both iPhone and iPad! Retina devices are also supported!<br/><br/>Note: Color Sheep requires players to perceive a wide range of colors and is not recommended for those with color blindness.<br/><br/>Thanks for playing! Please email us with any feedback at team@trinketstudios.com", "metacritic": null, "released": "2013-02-21", "tba": false, "updated": "2019-07-31T00:21:04", "background_image": "https://media.rawg.io/media/screenshots/811/8116ed844f2b7225d9fec0312aa626c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 2, "dropped": 2}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 217, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": ["Trinket Studios"], "genres": ["Action", "Arcade", "Casual"], "publishers": ["Trinket Studios"], "esrb_rating": null}