{"id": 903512, "slug": "pitbots-workshop-only-test-demo", "name": "PitBots - Workshop Only Test Demo", "name_original": "PitBots - Workshop Only Test Demo", "description": "<p> Physics based combat game where you design a robot and fight in the arena. Crush, flip, pierce, burn and cut your opponents till the last part. Create superior fighting machines and dominate the arena.<br/></p>\n\r\nDESIGN YOUR BOT\r\n<ul><li><strong>Chassis Shaping</strong> is first step to create your robot. During combat chassis can be deformed and ripped apart exposing vital internal parts.\r\n</li><li><strong>Component placement</strong>  is next step. Part types are, but not limited to: structural beams,  motors, pistons, wheels, blunt, sharp &amp; other weapons, energy  supplies, main-board and cosmetic parts. \r\n</li><li><strong>Input Control Setup</strong> allows to bind various actuator actions using keyboard, mouse and game-pad controllers.\r\n</li><li><strong>Bot Painting</strong>  can be done both in-game and using your favorite painting software.  Once your chassis shape is final, use implemented basic painting tools  to paint bot. For more advanced designs just export &amp; import bot  texture using \".png\" format.\r\n</li></ul>\n\r\nCOMBAT AGAINST OTHER BOTS\r\n<p>Participate in matches against other bots in various game modes. Fight alone or with friends (Couch play or Steam Remote Play). <strong>Online multiplayer support is unconfirmed</strong>, it will be implemented or dropped before full release.<br/></p>\n<p>Cripple enemy machines by destroying key components such as wheels, motors, energy supplies, and main-board.</p>\n<p>Use your weapons to shred your opponents apart. You can completely destroy bots as all chassis sections and parts are destructible.</p>\n<p>Fighting arenas have hazards that may affect outcome of combat. Use them to your advantage. And avoid the pit at all cost.</p>\n<p>Arena environments are diverse. Each arena might contain different hazards or none at all. Prepare your bot accordingly.</p>\n\r\nGAME IS STILL IN DEVELOPMENT\r\n<p>More features are in the development. Current features are not final and are subject to change.<br/></p>\r\nRELEASE DATE\r\n<p>Game is still in development. Full Demo version will be available before release.</p>", "metacritic": null, "released": "2022-12-31", "tba": false, "updated": "2023-01-02T11:11:42", "background_image": "https://media.rawg.io/media/screenshots/970/9709a4bb5896b7620f4637cbabd07126.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 174, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["wolferion"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}