{"id": 90369, "slug": "cupid-visual-novel", "name": "CUPID - Visual Novel", "name_original": "CUPID - Visual Novel", "description": "<p><strong><strong>HOME | STEAM | TUMBLR | PRESSKIT | <strong>ARTBOOK | DEVBLOG</strong></strong></strong></p>\n<p><em>.:: VNs Now's 2015 English Visual Novel Game of the Year ::.</em></p>\n<p><em>\"Love is both poison and cure, both knife and remedy.\" </em></p>\n<p><em>Rosa's best friend, Catherine, is dead and she is sure Catherine's betrothed, Marquis Guilleme is to blame. Mother says so. Mother says he has to pay with his life. Although, she knows by now Guilleme is no ordinary man. He is tainted. A monster. He cannot be killed by usual means. To seek the best revenge, she must find out all his secrets and destroy him. But will her own dark desires consume her or liberate her?</em></p>\n<p><em>No matter. </em></p>\n<p><em>Mother will tell her what to do.</em><br/><br/></p>\n<p>Set in the romantic 18th century France, play as the third person point of view character of Mother — a unique twist to the visual novel decision making medium. Decide the fate of the characters, scold or console, argue or assent… Just don't be surprised if they start to question your commands.</p>\n<p><strong>What people are saying:</strong><br/></p>\n<p><em>\"<strong>Cupid</strong> is, simply put, everything Ive ever asked for from a dramatic EVN. This game will hurt you and you will love it for doing so\" </em>- VNs Now<br/></p>\n<p><em>\"<strong>Cupid</strong> is a very ambitious game with the story that it is trying to tell along with all the details that it packs within it. And it does it so well! 10/10\" - </em>Hayurika<br/></p>\n<p><em>\"Swear to god, if this isn't in my top VNs this year, something will have gone gravely wrong.\" - </em>Christnenarium, Youtuber<br/></p>\n<p><em>\"I love this. Truly one of the best visual novels I've ever read. The art was beautiful, the story was amazing, the characters were interesting. I fell in love with Guilleme... this story will be with my heart for awhile.\" - </em>Anonymous, Tumblr</p>\n<p>You can learn more about the game and follow our development here:</p>\n<ul><li>LemmaSoft Thread</li><li>Tumblr</li></ul>", "metacritic": null, "released": "2015-04-08", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3b8/3b8b73ee13c41f8ce427867e404dec32.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 236, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fervent"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}