{"id": 903632, "slug": "bozuntuya-verme", "name": "Bozuntuya Verme", "name_original": "Bozuntuya Verme", "description": "<strong>Bozuntuya Verme</strong> is made in OYGEM Game Hackathon in 48 hours by us. The theme was \"<em>Keep it, move it</em>\" so we made a ryhthm game about it.  <br/>\n<ul><li><strong>Bozuntuya Verme</strong> tells us about a boy called Mert who likes a girl called Olivia very much. One day they start to talk about music groups and he agreed with her about everything. Although he had no idea of the music and the groups. Then suddenly the Olivia shows 2 tickets. Mert couldn't say no to this. So he went along with it but now he must not get embarrassed at the concert and she can't know that he is lying. So he thinks of an idea he is going to dance so good that nobody is going to notice that he doesn't know any of the songs.</li></ul>\n<ul><li>This is where we come in we must press the right buttons to make him dance well. If you mess up the combo his dance moves are going to get worse. We must make the highest possible score to impress our <strong>future</strong> girlfriend.</li></ul>\n\n\n<strong>ROADMAP</strong>\n<ul><li><em>English and Spanish versions is going to be added very soon</em><em>.</em></li><li>Custom map editor and music selection is going to be added.</li><li>Global high score system and leaderboard is going to be added.</li><li>Combo \"Hype Mode\"  is going to be added.</li><li>Dance moves is going to be more diverse.</li></ul>\n<p>Thank you for playing our game. We hope that you like it.</p>", "metacritic": null, "released": "2022-12-31", "tba": false, "updated": "2023-01-02T12:33:36", "background_image": "https://media.rawg.io/media/screenshots/7db/7db9d31de96fc11c325e22e279e006f0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cloudberry Studios"], "genres": [], "publishers": [], "esrb_rating": null}