{"id": 903687, "slug": "aberrant-reflections", "name": "Aberrant Reflections", "name_original": "Aberrant Reflections", "description": "<em>At the bottom of an ancient temple,<br/>beyond the mirror's edge,<br/></em>\n<em>lies the spot where reality was sundered.</em><em>Fortune and power await those who learn its secrets.</em>\n<em>A fate worse than death is reserved for those who fail.</em>\n<em>You’ve come to plunder the temple between worlds </em>\n<em>and gaze into its ABERRANT REFLECTIONS.</em>\n<p><strong>OSR-Style puzzle dungeons lean heavily on the exploration pillar of adventure games. They are a test of ingenuity or knowledge of players and designed to invoke the experience of suddenly understanding a previously incomprehensible problem or concept. “<em>Aha</em>!”</strong>\n</p>\r\nAberrant Reflections is a puzzle dungeon roleplaying adventure module for low level characters (1–4).\r\n \r\n<p>It's compatible with B/X, old school, and modern fantasy rules with minimal conversion.\r\n </p>\r\nYou’ll find within its 44 digest-sized pages:\r\n \r\n<ul><li>Problems, puzzles, and combat that encourages player creativity and understanding of their environment.\r\n</li><li>Stunning art from Jacob Fleming, Del Teigler, Luke Broderick and Kiril Tchangov. \r\n</li><li>New and wondrous magic items and fearsome creatures to keep your players curious and excited!<br/>\n</li><li>A \"control panel” layout design that’s easy for game masters to reference and run on-the-fly.\r\n</li></ul>\r\nContent Warning: \r\n<p>Aberrant Reflections contains elements of body horror. Depictions of such horror can be removed or happen “off-screen” without negatively impacting the adventure. Talk with your players beforehand about using safety tools in your game.</p>\r\nPraise for Aberrant Reflections:\r\nAberrant Reflections has gross, mysterious monsters and clever puzzles packed into<strong> a tight, carefully designed dungeon filled with beautiful art.</strong> I can't wait to watch my players scratch their heads, hold their sides, and gasp as their characters are ripped limb from limb.\r\n<p>- Yochai Gal; Author of Cairn</p>\n\n<em>\"<strong>Aberrant Reflections is BONKERS and I love it.</strong> It’s a mind-bending,  “Legend of Zelda”-esque puzzle dungeon module with really good art and  creative information presentation. This is the kind of module I like to  run.\"</em>\n<p>- Brad Kerr, Author of Hideous Daylight</p>\n\r\nOne of the few “puzzle dungeons” out there that<strong> makes the puzzle an organic part of the structure of the dungeon.</strong> As players slowly figure out how the dungeon works, they become able to explore more and more of it, exploit its secrets, and (maybe) find its most valuable treasures. <strong>Didn't want to quit until we had mapped every square inch of the place. </strong>\n<p>- Benjamin M. (CowardlyB); Playtester\r\n </p>", "metacritic": null, "released": "2022-12-20", "tba": false, "updated": "2023-01-02T13:02:15", "background_image": "https://media.rawg.io/media/screenshots/2b3/2b3d9c0e3ab9d301264494570ca72916.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 95, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Directsun Games"], "genres": ["Adventure", "RPG", "Puzzle"], "publishers": [], "esrb_rating": null}