{"id": 903744, "slug": "complex-original-zypping-game", "name": "Complex & Original ZYpping game", "name_original": "Complex & Original ZYpping game", "description": "<p>A fun puzzle game, where you have to zyp (or shoot) balls to hit the evil Todog monster (in red). Bounce the balls on the walls and try to hit and take out the evil Todog (he might be hiding!). Take it out and complete the game.</p>\n<p>This game features 5 interesting and <strong>C</strong>omplex puzzles. This game is also <strong>O</strong>riginal (it is a submission for Winter Melonjam 2022 created all by myself)! <strong>ZY</strong>pping? Well you have to zyp the balls around!</p>\n<p><em>For best results, enjoy the game in a cozy</em><em> area. </em><em>Have fun!</em></p>\n<p>In this demo, there are 5 levels. The game can be played on mobile (possible glitches/lag)</p>\n\n<p>Note:</p>\n<p>If you liked the game, please do let me know in the comments. Also feel free to  share any feedback (please do not be toxic). This is my first time participating in a game jam and I also just started (&gt;2 weeks) learning  about game development. This game was made with Godot.</p>\n\n<p><strong>CONTROLS:</strong></p>\n<p>Mouse cursor (or touch screen): Zyp direction and strength (the further the cursor from the ball, the stronger the zyp off. Note: Please click within the black boundary line)</p>\n<p>Mouse left click (or touch screen): Zypoff!</p>\n<p>R key (or \"push to reset\" button onscreen: Reset the position of the ball for a rezyp</p>\n<p>Esc key: Quit game (Desktop only?)</p>", "metacritic": null, "released": "2022-12-31", "tba": false, "updated": "2023-01-02T13:29:40", "background_image": "https://media.rawg.io/media/screenshots/f12/f12af5d23e32f3dd5c4336dd184ac28e.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 28, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "PC"], "developers": ["DevNerdGR"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}