{"id": 90387, "slug": "seul-alone-the-day-before", "name": "Seul. (Alone) the day before", "name_original": "Seul. (Alone) the day before", "description": "<p><strong>Seul.(Alone) The day before. </strong></p>\n<p>A narrative game, helping raise awareness of suicide. </p>\n<p>Funny, Sad, Creepy, Disturbing and completely absorbing, with a Shakespearean sense of tragedy. </p>\n<p>Wonderfully surreal as an ordinary day in the life of a character who holds secret alleyways of unsettling and unexpected views unfolds to the reader. Painful and touching, it offers the private thoughts of a person contemplating the philosophical question of whether to end their life or not. Aiming to raise awareness of the taboo subject.</p>\n<p>Seul.(Alone) The day before is a precursor to Seul.(Alone) The entree, it takes place literally the day before. </p>\n<p>It is an intimate and heartrending journey into a vast project of a world and another world behind that world that sits within yet another world. But through this project, it never loses its investment into the lives of the people involved. </p>\n<p>Unexpectedly moving at times there is a kind of shroud between the reader and the characters that seem to dissolve. Over the course of options chosen one begins to learn the inner workings of the expansive cast and their thoughts, troubles, emotional motivations and qualms that begin to resonate with you and dig so deep that it can be troubling.</p>\n<p>Seul.(Alone) The day before is the doorway into that and will give back what you are willing to put into it, with incredible depth that at times will reach deep inside you. </p>\n<p>Its memory will linger because everybody is a story that is written Seul.(Alone) </p>\n<p>National Suicide Prevention Hotline: Call 1-800-273-8255<br/>Crisis Hotline: Text HOME to 741741</p>", "metacritic": null, "released": "2018-03-25", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/3c1/3c16de3d3f9553377b95e022c1782ee0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 46, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Paranormal Games"], "genres": [], "publishers": [], "esrb_rating": null}