{"id": 903939, "slug": "far-north-pre-alpha", "name": "Far North (Pre-Alpha)", "name_original": "Far North (Pre-Alpha)", "description": "<p><em><em>-Disclaimer-</em><br/>This is a very early stage of the game. Many features and content will be missing, broken or changing/evolving. That being said, this is also your chance to provide feedback and help out with bugs while getting the game for free at this point. Please consider joining our Discord (link can be found at the bottom of this page).</em></p>\n\n<strong>Far North</strong>\n<p><strong><em>Far North is a sandbox co-op procedural open world survival game with changing seasons.</em></strong><br/></p>\n<p>Set in the deep North your survival depends solely on your ability to thrive.<br/>Build and expand settlements in order to brave through the changing seasons ranging from beautiful summer days to fierce winter nights.<br/>Venture through alluring and treacherous terrain where you explore and harvest resources used for crafting new clothes, tools, structures and more.</p>\r\nSurvive the changing seasons\n\n<p><em>Experience the wilderness with four beautifully crafted seasons and the unique challenges that come with them. Out here you'll be tracking your Hunger, Thirst, Stamina, and Temperature as you struggle to balance resources with the energy needed to obtain them. Find food, upgrade your settlement, stock up on supplies and craft new clothing. Preparation is key here in order to survive the game-altering seasons. Every decision you make will have a direct impact on your life, so be careful because that decision might just be your last.</em></p>\n\n\n\n\n\n\n\n<em>\r\nExplore the North\n\n<p>Nature is calling, the diverse terrain and its inhabitants are beatiful but dangerous. Utilize all that nature has to offer by harvesting resources wherever you can find them but beware of the wild life and weather. A long journey into the wild can spell the end of you if you don't come prepared.<br/></p>\n<em>\r\nBuild and expand your settlements\n\n<p>Expand your simple settlement into a beautiful farm! Domesticate animals, grow crops, start an orchard and more! Challenge your architectural skills by building to survive the elements in style.</p>\n<em>\n<em>Improve your character</em>\n<em>\n<p>Your character is unique. Go from a beginner to a master of cooking, wood cutting, farming, exploring and much more as you shape your own journey!</p>\n<em>\n<p><strong>Planned Key Features:</strong></p>\n<ul><li> Massive Procedural world\r\n</li><li> Game-changing Seasons\r\n</li><li> Dynamic Weather\r\n</li><li> Co-op\r\n</li><li> Exploration\r\n</li><li> Cooking\r\n</li><li> Farming\r\n</li><li> Building\r\n</li><li> Crafting\r\n</li><li> Skill System\r\n</li><li> Harvestable Trees\r\n</li><li> Animals\r\n</li><li> Domesticate Animals</li><li>Character Customization</li><li>Character Clothing Equipment</li><li>Impact from weather Temperature</li></ul></em><p><em><em><em><strong>Current Key Features:</strong></em></em></em></p>\n<em><em>\n<ul><li>Massive Procedural world (only one biome so far)</li><li>Changing Seasons\r\n</li><li>Dynamic Weather\r\n</li><li>Co-op\r\n</li><li>Basic Exploration\r\n</li><li>Basic Cooking (can only cook fly agaric mushroom right now)</li><li>Basic Building\r\n</li><li>On-hand Crafting\r\n</li><li>Basic Skill System (still missing actual improvements)</li><li>Harvestable Trees\r\n</li><li>Animals (Non-interactible at this point)</li></ul>\n</em></em><em><em>\n</em></em></em></em></em></em>", "metacritic": null, "released": "2022-12-30", "tba": false, "updated": "2023-01-02T14:55:30", "background_image": "https://media.rawg.io/media/screenshots/5a9/5a9b03b002354134d0894353947fd358.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 216, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Timgranstrom"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}