{"id": 903945, "slug": "zehlar-demo", "name": "Zehlar Demo", "name_original": "Zehlar Demo", "description": "<p>Follow the development progress<br/></p>\n<p>A Mini tutorial<br/></p>\r\nProcedural Open World \r\n<p>A world with different biomes, all of them full of unique vegetation and creatures. Each player will be able to experience a different world. This will make each experience unique.\r\n</p>\r\nElemental Abilities\r\n\r\n\r\n\r\n\r\n<p>Creatures have the ability to control different elements. This allows them to interact with the terrain, both to modify it and to navigate it. They can also use these abilities to fight.\r\n</p>\n<p>Humans do not have these powers, but they can obtain some of the creatures' abilities with specialized technology and other methods. However, they will not be as strong as the creatures' powers.\r\n</p>\r\nCapturing\r\n\r\n\r\n\r\n\r\n<p>Almost all of the creatures in the world can be captured to become part of your team. These creatures will help you overcome increasingly difficult challenges, defeat stronger enemies, or access areas that you would not be able to easily reach without their help.</p>\r\nTraining\r\n\n<p>Both you and your captured creatures can train to become stronger. Each stat requires different training. For example, you can train strength with simple actions like mining or making heavy contact attacks. Or you can train endurance by running long distances while carrying heavy loads.\r\n</p>\n<p>Just remember to rest well so that the training will be effective.\r\n</p>\r\nDestruction and Building\r\n<p>Everything in the terrain can be modified. From cutting grass, creating a crop, or building a small base; to digging a mega tunnel through a mountain or building a castle.\r\n</p>\n<p>Each material has different resistances, some will require very specialized tools or skills to be destroyed.\r\n</p>\n\n<p>(Note: There is currently no map saving system, so any changes made to the terrain or chest contents will be restored when the game is restarted. This will be available in a future update. The player's progress and captured creatures are saved.)</p>", "metacritic": null, "released": "2022-12-30", "tba": false, "updated": "2023-01-02T14:58:23", "background_image": "https://media.rawg.io/media/screenshots/70c/70c9899db40239550e6f7d83baaafa0b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 224, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Hypercube Games"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}