{"id": 903915, "slug": "g_boom-sweep", "name": "G_boom sweep", "name_original": "G_boom sweep", "description": "<p>                                 <br/></p>\n<p>VITE ! Désamorcer les bombes cachées dans les labyrinthes. / QUICK ! Defuse the bombs hidden in the labyrinths.</p>\n<p>G-boom sweep est une adaptation du jeu \"game &amp; watch bomb sweeper\". Ce jeu a bercé mon enfance et j'ai eu envie de le mettre au gout du jour à ma façon. </p>\n\n<p>L'histoire est simple, vous êtes un ninja envoyé pour désamorcer des bombes qui ont été dispersé dans des labyrinthes. A vous de déplacer les murs afin de vous frayer un chemin à travers ceux ci, avant que les bombes explosent.</p>\n<p>         <br/></p>\n<p>Pour cela vous possédez trois vie, un compte à rebours est lancé, dépêchez vous ! A chaque fois que vous  désamorcer une bombe, vous récupérez 10 secondes de temps supplémentaire pour désamorcer la prochaine dans le niveau suivant. </p>\n<p>Attention à ne pas bloquer la sortie ! </p>\n\n<p>Bon jeu.</p>\n<p>Ce jeu se joue au clavier:</p>\n<p>Haut,Bas,Gauche,Droite  ------)  Déplacer le ninja démineur</p>\n<p>Google translate:</p>\n<p>G-boom sweep is an adaptation of the game \"game &amp; watch bomb sweeper\". This game rocked my childhood and I wanted to bring it up to date in my own way. The story is simple, you are a ninja sent to defuse bombs that have been scattered in mazes. It's up to you to move the walls to make your way through them, before the bombs explode. For this you have three lives, a countdown has started, hurry up! Each time you defuse a bomb, you recover 10 seconds of additional time for the next one. Be careful not to block the exit!</p>\n<p> Good game.   </p>\n<p>This game is played on the keyboard:</p>\n<p> Up,Down,Left,Right ------) Move Minesweeper Ninja</p>", "metacritic": null, "released": "2022-12-30", "tba": false, "updated": "2023-01-02T14:43:33", "background_image": "https://media.rawg.io/media/screenshots/246/2460e9f9024bbe90897847965dde76c0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 100, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Yalo"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}