{"id": 90403, "slug": "to-the-edge-of-the-sky-premium", "name": "To the Edge of the Sky - Premium", "name_original": "To the Edge of the Sky - Premium", "description": "<p>Please note this game's art is different from the original demo you may have heard about. The characters faces are currently hidden by masks while we revise the art. It is not inspired by any persons, living or dead. </p><p>TTEOTS All Access Season Pass - Receive all FUTURE premium content for a flat price! This version contains additional content not found in the free version. <strong>This version is primarily for those who backed and funded our game, but can be purchased separately as well. </strong><br/></p>\n<p>This version acts as a \"Season Pass\", enabling you to receive ALL future content released for To the Edge of the Sky game without restriction. As of right now, the Premium content is still being developed, and smaller in-app purchases will be available for the free content on mobile devices. <strong>This is only for those who directly want to support the game and not have to pay for each individual purchase as the game is released. </strong></p>\n<p>[Note: This game is STILL in development and is as of yet, unfinished in its entirety until Autumn 2018. New chapters are still being added regularly and you may experience instability with saves. We do not release specific update dates. The game will update on its own.]</p>\n<p>Enter the year 2077 and become Seven, the newest addition to Phantom Alpha, a secret team who operates under the enigmatic government organization known as P.H.A.N.T.A.S.M. After joining, you find yourself befriending the other rookie on the team, an incredibly skilled youth known as Zero. As you meet the other members, you quickly learn that while vastly talented, each of them is clearly much more than meets the eye.</p>\n<p>Regardless of your differences, you quickly learn what Phantom Alpha can do. But together, you soon discover that on the other side of the radiant world of light, lies an equally dark world of shadow. Can you brave these worlds and trust the men by your side?</p>", "metacritic": null, "released": "2018-05-20", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a94/a946cf2d21868791f54d776661e53f81.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 142, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Aeon Dream Studios", "stormvalkyrie"], "genres": [], "publishers": [], "esrb_rating": null}