{"id": 904182, "slug": "clash-robot-detective-complete-edition", "name": "Clash: Robot Detective - Complete Edition", "name_original": "Clash: Robot Detective - Complete Edition", "description": "A relaxing time on a high-tech cruise ship turns into a mystery for the ages!<br/><br/>The robot staff onboard the Violet Skies have been getting hacked and turning violent by a mysterious third party.  You are hired by Clash, a sentient robotic police assistant turned investigator, to find whoever is responsible before it is too late.  The two of you will work together and interrogate potential suspects; how the case is handled will be affected by your decisions.  Do you butter up the jerkish hacker or punch him?  Do you show empathy towards the overworked waiter or tell him to suck it up?  It is up to you!  Just be aware that Clash is paying attention to how you handle every situation…<br/><br/><strong>Clash: Robot Detective – Complete Edition</strong> also includes a bonus story that unlocks after the main game is completed.  This epilogue – called <strong>Steel Barista</strong> - takes place sometime after the main game and involves a case of cold-blooded machine murder.  A robotic barista at the local coffee shop is found dead in a pool of her own oil.  You play as a person temporarily hired by Clash while his assistant is away to bring the murderer to justice.<br/><br/><br/><br/><ul><li>Mystery/science-fiction visual novel<br/></li><li>Build your good cop/bad cop points<br/></li><li>Choose between friendly, compassionate, indifferent, and hostile approaches<br/></li><li>Affect Clash's demeanor and the perpetrator's identity through your decisions<br/></li><li>Use speech checks to test your stats<br/></li><li>Discover behind-the-scenes trivia<br/></li><li>Unlock 30 different achievements</li></ul><br/>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T02:42:46", "background_image": "https://media.rawg.io/media/screenshots/872/8722584460f2268aa8c236e1bbce4b39.jpg", "website": "https://dronegardenstudios.000webhostapp.com/index.html", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 316, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Drone Garden Studios"], "genres": ["Adventure", "Indie"], "publishers": ["Drone Garden Studios"], "esrb_rating": null}