{"id": 904196, "slug": "monster-knockout", "name": "Monster Knockout", "name_original": "Monster Knockout", "description": "You are a brave Hero Bird who can't wait for his village to be properly fortified. When evil monsters attacked and stole all the hard work your people had put into their newly - built town walls, you jumped at the chance to save them. Now you're an everyday hero exploring towering castles and bright cities filled with Monster Knockout's wildest baddies! Collect powerful weapons, armour and trickery to take on every challenge; even if it means turning foes into allies… or enemies. The world is yours to protect and loot in Monster Knockout. <br/><br/><br/><br/>Product Features<br/><br/><ul><li> Explore vibrant 2D landscapes as you save the day. <br/></li><li> Equip your heroic bird with powerful weaponry. <br/><br/><br/>An ever present threat has emerged from the darkness, it is up to you to travel through monster filled galaxies and defeat every single foe in your path. Choose from a range of super upgradeable bird nodes that allow you to unleash multiple attacks on any enemy, upgrade your ship and gain new weapons as you progress all the way to beating the Monster Knockout tournament for a share of $50,000! You are a hero, Knockout (upright Bird), and you will save the planet by defeating Monsters everywhere. <br/><br/>How To Play <br/><br/></li><li> Use the mouse to control the bird in the air <br/></li><li> Release the left click button to shoot the bird into the monsters you fight <br/></li><li> Continue until all monsters are gone then you will automatically be moved to the next level  <br/><br/><br/><br/>game Features<br/><br/></li><li> 60 + Unique levels with different enemy types to fight. <br/></li><li> Upgrade your characters by purchasing new armour, weapons and more. <br/></li><li> Help save the little town you come from even if it kills you.<br/></li><li> Easy to play, hard to master. <br/><br/>Interactive Main Menu<br/><br/><br/>Can you save the town from collapse only you can save them now.</li></ul>", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-01-06T03:01:31", "background_image": "https://media.rawg.io/media/screenshots/27d/27d5897b987880cb35799760b5c69539.jpg", "website": "https://spotpixle-studios.business.site/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 100, "ratings_count": 0, "suggestions_count": 70, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["SpotPixle Studios"], "genres": ["Action", "Adventure", "Strategy", "Simulation", "Casual"], "publishers": ["SpotPixle Studios"], "esrb_rating": null}