{"id": 904199, "slug": "out-of-three", "name": "Out of Three", "name_original": "Out of Three", "description": "<strong>Out of Three</strong> is a 3-player Local Multiplayer Boss Rush game. Lost in a dungeon, you and your two comrades must survive a terrible monster: Gorgon. Beware! 3 inexperienced villagers like yourselves are obviously no match. Fortunately, the gods are merciful and decide to lend you the 3 weapons of the trinity.<br/><strong>The Bloody Fists: </strong>These boxing gloves belonged to the infamous Tiger-eyed Boxer. Wearing them allows you to drain your enemy's life points when hitting them, restoring your own.<br/><br/><br/><br/><strong>The Spield:</strong> Can't make up your mind between a spear or a shield? The Spield is the perfect choice. Attack your ennemy while reflecting some damage when shielding at the right time!<br/><br/><br/><br/><strong>The Lyre: </strong>If music is your thing, you should use the Lyre to harm Gorgon from afar with your false notes.<br/><br/>Amidst chaos and disarray, you must find a way to cooperate with your friends to beat the boss. Swap weapons with your teammates and come up with the best strategy. Start from scratch, become true heroes.You'll have to swap weapons during battle if you want your party to be the most efficient. Studying each weapon will come in handy to become a real asset for your team.thank you Pernambuco for these amazing musics!<br/><br/>You can go on his spotify or Youtube channel to see his work !", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-01-06T03:04:48", "background_image": "https://media.rawg.io/media/screenshots/aa2/aa29ce5634668010dc8fb6d903fb0f57.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 153, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Resurgence Studio"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["IIM - Institute of Internet & Multimedia", "Resurgence Studio"], "esrb_rating": null}