{"id": 904235, "slug": "guo-chan-shou-ji-di-guo-mobile-phone-empire", "name": "国产手机帝国-Mobile phone empire", "name_original": "国产手机帝国-Mobile phone empire", "description": "When domestic products are self-reliant, old iron workers, all people who have aspirations and dreams, take action quickly, create their own domestic mobile phone business empire, let their mobile phone sales dominate the world and occupy the commanding heights of the world, and then create and set up various high-tech enterprises, such as satellite technology, satellite communication technology, new energy vehicle technology, 7G communication technology, etc., so that your technology can be everywhere, and let your technology change the world and make it a better place.<br/>\n<br/>\r\nGame features:<br/>\r\n1. Simulate the virtual mobile phone business marketing, and manage your mobile phone stores in an orderly manner;<br/>\r\n2. Make your own mobile phone as the main business development line, and then start to invest more R&amp;D funds;<br/>\r\n3. Invent and innovate new science and technology, so that our products can occupy a greater advantage in the market;<br/>\n<br/>\r\nGame highlights:<br/>\r\nGradually become a god-like product in the market, and let the sales of our products spread all over the world;<br/>\r\nLet everyone on earth use products, while your industry is far more than that;<br/>\r\nYou can also launch a satellite and set up a personal satellite navigation system.<br/>\r\nGame experience:<br/>\r\nYou can also develop a lunar tour group, so that people from the earth can visit the moon for seven days at any time;<br/>\n<br/>\r\nYou can also set up a 7G communication company, so that people on earth and even in the universe can use your signals for friendly communication without barriers and delays;<br/>\n<br/>\r\nYou can also build a global enterprise, set up new companies around the world, and let your influence spread to all corners.<br/>\n<br/>\r\nA brief review of the game:<br/>\n<br/>\r\nA simulation game for developing mobile phone business, which owns its own mobile phone shop.<br/>\r\nYou can put different types of mobile phones in the shop, so that customers can buy their favorite mobile phones.<br/>\r\nComplete the comprehensive reform of mobile phones by advanced methods, increase the transmission of mobile phone signals, and strengthen the comprehensive after-sales service of mobile phones.", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-01-06T03:48:02", "background_image": "https://media.rawg.io/media/screenshots/200/2004b966876e64e4363889d9cabc6695.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 128, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["文字TV"], "genres": ["Simulation", "Racing", "Indie"], "publishers": ["文字模拟游戏TV"], "esrb_rating": null}