{"id": 904220, "slug": "unexpected-futa-corruption", "name": "Unexpected Futa Corruption", "name_original": "Unexpected Futa Corruption", "description": "Unexpected Futa Corruption is a game about how a beautiful and pure angel girl finds herself in bed with her unexpected futanari date. She turns into a horny slutty futa-slut as they explore their fantasies together and with other futa girls from the neighborhood.<br/><br/>Hesitant at first she didn't want anything to do with the futanari. She thought she'd find a pure lesbian soulmate to share her perfect life with. Little did she know that soon she'd be begging her futa neighbour for sex while her friends watched. A perfect angel who had her whole perfect life lined up, only to have the fantasy shattered by the reality of her unsatiable horniness.<br/><br/>The gameplay consists of solving a series of match 3 puzzles with a visual novel dialogue in-between. You also get to make choices that affect the gameplay.<br/><br/>Features:<br/><br/>- Visual novel elements before and after each game.<br/>- Polished Match 3 gameplay with a custom implementation with attention to detail.<br/>- High quality CG render unlocked after every game.<br/>- Failure to progress is also progress.<br/>- <strong>Explicit sex scenes!</strong><br/><br/>Rules of the match 3:<br/><br/>- You must match 3 or more of the same gems in a row or column.<br/>- Each gem type has a different meaning and effect.<br/>- You must keep an eye on your points as well as remaining turns counter.<br/>- You must \"defeat\" the opponent - your date - by matching heart symbols and seducing them.<br/>- You can also use skills to alter the game. But be careful, they only have limited amount of uses!", "metacritic": null, "released": "2023-01-04", "tba": false, "updated": "2023-01-06T03:31:15", "background_image": "https://media.rawg.io/media/screenshots/53c/53ca6493d75c35af3bde9a8a7d5a1303.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 8, "ratings_count": 0, "suggestions_count": 229, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Cute Pen Games"], "genres": ["Casual"], "publishers": ["Cute Pen Games"], "esrb_rating": null}