{"id": 904221, "slug": "onmyojithe-card-game", "name": "Onmyoji：the card game", "name_original": "Onmyoji：the card game", "description": "Onmyoji: The Card Game is an exquisite Japanese-style duel card game. Board Shinkiro, a mirage ship that travels between the three realms, join other youkai as one of them, and enjoy thrilling duels with brand-new original rules.<br/>Abundant strategies, fair matches, together bring a CCG that you've never experienced before.<br/><br/><h3>Collect Cards and Build Your Deck</h3>Choose 4 from more than 120 Shikigami to build your deck.<br/>Each Shikigami has its unique positioning and powerful cards. Select cards that benefit the match and fight together with your beloved Shikigami!<br/><br/><h3>Level Up Your Shikigami and Make Your Move</h3>You can level up your Shikigami to make them more powerful during a match.<br/>It's up to you to either play fast, and strike your opponent when their Shikigami have not yet been fully developed, or steadily level up your Shikigami, and accumulate combo to launch one fatal attack.<br/><br/><h3>Enjoy the Audiovisual Feast of Beautiful Art-Style and Original Voice Actors</h3>Featuring Japanese-style aesthetic scenes, Onmyoji: The Card Game allows you to board the sky cruise, explore the intriguing world of Youkai and record your travels.<br/><br/><br/><h3>Exquisite and Fun Cards</h3>Exquisite portraits of Shikigami and tailored combat skills with lifelike live 2D effects give you a brand-new CCG experience.<br/><br/><br/><h3>Join Other Youkai as One of Them</h3>With a special ferry ticket, you can enter the wonderland of youkai and learn about their out-of-ordinary daily life. And their colorful tales will for sure elevate your trip here at Shinkiro.<br/><br/><br/>", "metacritic": null, "released": "2023-01-04", "tba": false, "updated": "2023-01-06T03:32:33", "background_image": "https://media.rawg.io/media/screenshots/fba/fbafbb297a88a67caf8bec91c4cf2379.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 39}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 328, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["NetEase Games"], "genres": ["Strategy"], "publishers": ["Netease"], "esrb_rating": null}