{"id": 904217, "slug": "stolen-wife-cucked-on-a-hot-spring-company-trip", "name": "Stolen Wife ~Cucked On A Hot Spring Company Trip~", "name_original": "Stolen Wife ~Cucked On A Hot Spring Company Trip~", "description": "<p>STORYYou want to spend some peaceful time together with your wife.<br />\nThis leads you to participate as a couple in a trip sponsored by your company.<br />\nHowever, at your destination awaits a brood of sexually starved men hungry for your wife&#39;s body.<br />\nWhen this vacation is over, whose arms will she be in?<br />\nProtect your wife from the beasts surrounding her in this NTR story adventure!<br />\nAkihiro and Akane Takatori have been married for three years and are still in the honeymoon phase. However, they&#39;ve been unable to travel together due to their busy schedules.<br />\nOne day, Akihiro&#39;s company plans a company trip to celebrate 30 years since their founding. Employees are welcome to bring their families, so Akihiro joins with his wife.<br />\nAlso participating are Onishima—a partnered company&#39;s president who is known for harassing women—and Akihiro&#39;s junior, Ryuuzaki, who lusts after Akane.<br />\nCan Akihiro and Akane enjoy privacy on their vacation without the wicked hands of other men snatching her away? Or will she fall prey to their sexual traps?<br />\nWhat will Akihiro and Akane choose?Product specificationA novel game that you can read by clicking<br />\nFull voice (female character)<br />\nCG Mode<br />\nScene recollection</p>", "metacritic": null, "released": "2023-01-04", "tba": false, "updated": "2023-01-09T11:41:05", "background_image": "https://media.rawg.io/media/games/b4b/b4ba374ee5b06ac38395121070fb20f8.jpg", "website": "https://ubai.org/ubawarezuma/", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 350, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["STUDIO UBAI"], "genres": ["Adventure", "Casual"], "publishers": ["Far East Studio"], "esrb_rating": null}