{"id": 904308, "slug": "desidentity", "name": "Desidentity", "name_original": "Desidentity", "description": "<p>Weirdcore/Dreamcore kinetic novel!</p><p>(Linear story, no choices or multiple endings)<br/>Please watch \"trailer\" before playing, It's the 1st episode.<br/></p>\n<p>--------------------------------<br/></p>\n<p><strong>English:</strong></p>\n<p>Desidentity  tells the story of a universe inhabited by creatures of all kinds, with  a theme based on one of the best-known aesthetics on the internet.  Sometimes, unfortunately, human beings (called \"Gizakia\" by the  creatures that inhabit it) arrive to this world. These humans have no  memories of their lives before entering the new world. If a being finds a  gizakia walking around the backrooms, for moral reasons, they must  guide it to the exit, because at the exact moment they meet, the place's  native will become their Keeper. Only a small percentage of the  population is the \"privileged\" that gets this denomination. When seeing a  being accompanied by a gizakia, a different or excessive reaction is  totally frowned upon. All this serves so that the Gizakia, together with  the being, can more easily get used to their new life.<br/></p>\n<p>\n</p>\n<p><strong>Español:</strong>\n</p>\n<p>Desidentity  cuenta la historia de un universo en el que habitan criaturas de todo  tipo, con una temática basada en unas de las estéticas más conocidas en  internet. Aveces a este mundo, por desgracia, llegan seres humanos  (llamados \"Gizakia\" por las criaturas que lo habitan). Estos humanos no  tienen ningún recuerdo de su vida antes de entrar al nuevo mundo. Si un  ser encuentra a un Gizakia rondando por los cuartos traseros, por  cuestiones morales, deberá guiarlo hasta la salida, ya que desde el  primer momento de su encuentro, el originario se convierte en su  Guardador. Solo un pequeño porcentaje de la población es el  \"privilegiado\" que consigue esta denominación. Al momento de ver a un  ser acompañado de un gizakia, está totalmente mal visto el reaccionar de  manera diferente o desmesurada. Todo esto sirve para que el Gizakia  junto al ser, puedan acostumbrarse más fácilmente a su nueva vida <br/></p>\n<p>-----------------------------\r\n</p>\n<p>This is just the demo.</p>\n<p>If there's any error please tell me  (My main language is spanish so if there's any error for the english translation just notify me)</p>\n<p>Hope you enjoy it :]<br/></p>", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-01-06T04:33:37", "background_image": "https://media.rawg.io/media/screenshots/97d/97df4ab1054f68096652562ecee2513a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 14, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Weirdcoresome"], "genres": [], "publishers": [], "esrb_rating": null}