{"id": 90432, "slug": "red-embrace-bl-visual-novel", "name": "Red Embrace (BL Visual Novel)", "name_original": "Red Embrace (BL Visual Novel)", "description": "<strong>LUKA ROUTE NOW RELEASED!</strong>\n<p><strong>Play it for free through the demo or the full game!</strong></p>\n<p><strong>Also available on Steam and Google Play!</strong></p>\n<p><strong>Connect with us on:</strong>\n</p>\n<p>Twitter | Discord Server |  Tumblr Dev Blog  | Facebook | Newsletter</p>\n\n\n\n<p><em>\"There are lots of predators out there... stalkers who'd just love to have a taste of someone like you...\"</em><br/><br/><br/><strong>Plot Summary</strong><br/><br/>The graveyard shift at a dingy diner in San Francisco -- that's where MC's story begins. It's just another normal night, or at least it seems to be. <br/><br/>...That is, until a certain mysterious customer stops by, bringing the dangerous<em> </em>attention of a few people with him. When it rains, it pours, and suddenly MC finds himself in the middle of a war he didn't even know existed... between vampires.<br/><br/>How does MC react to the dark, violent world that opens up before him? That's up to you!<br/></p>\n\n\n\n<p>► <strong>Genre:</strong> Drama, BxB romance, dark modern<br/>► <strong>Rating:</strong> PG-13 (language, violence, sexual themes)<br/>► <strong>Length:</strong> ~60,000 words<br/>► <strong>Endings:</strong> 8<br/>► <strong>Platforms:</strong> Android, Steam, Itch.io<br/><br/>► Changeable MC personality &amp; interests<br/>► Different dialogue &amp; choices based on personality<br/>► 11 track OST with a dark, urban vibe<br/>► 14 CGs with multiple variations<br/></p>\n\n\n\n\n<p>Ash has been stuck in San Francisco for most of his life. Even though he dreams of becoming a famous artist (whether in music, digital art, or writing is up to the player!), he currently works the graveyard shift at a run-down little diner. <br/><br/>He's wry, tough, and determined by default, but his personality changes and grows throughout the course of the game!<br/></p>\n\n<p>Despite his intimidating appearance, Dominic prefers to keep to himself. A man of few words, he rarely offers any insight into his thoughts, but his silence suggests a deep conflict going on beneath the surface.<br/></p>\n<p>Isaac reeks of \"unscrupulous businessman,\" and makes no effort to hide it. He seems very out of place among the rough, unrefined types who hang around San Fran's seedy parts, though there's a good reason for the company he keeps.</p>\n\n<p>Wild, impulsive, bloodthirsty, and Dominic's polar opposite, Rex wears his vampiric nature like a badge of pride. It's a wonder he's lived as long as he has, considering his reckless nature and insatiable appetite.<br/></p>\n\n\n\n<p>Please share your thoughts with us in the comments below, or with an email to contact@argentgames.co! </p>", "metacritic": null, "released": "2018-01-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/0e6/0e6cf245759237fc529aec0efe6f5e44.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 347, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux", "Android"], "developers": ["Argent Games"], "genres": [], "publishers": [], "esrb_rating": null}