{"id": 904302, "slug": "as-long-as-its-not-illegal-act-i-itch", "name": "As Long As It's Not Illegal: ACT I (itch)", "name_original": "As Long As It's Not Illegal: ACT I (itch)", "description": "<p><strong>❌   Blog   ❌       ❌   Twitter   ❌      ❌    Insta    ❌        ❌   Tiktok   ❌       ❌  Patreon ❌</strong><br/></p>\r\n\r\nIt's Friday night\r\nYou and the other Senior Elites devise a plan to throw a party at the rival campus.\r\nCarpool across Suncity limits, down into the lawless land of the Undercity. \r\nIt's Illegal for these two cities to mingle. \r\n\r\nBut is it illegal if... you're never caught?\r\n\n\n<p>There are 5 love interests, look! Here they are now!\r\n</p>\n\n\n<p>A Long time friend since childhood, even as children he's always lives a tortured life, since running away from home you haven't seen Emmett in over a year, that is until tonight, how much has he changed you wonder<br/></p>\n<br/>\n<p>That goofy ass guy you've known for too long, but he prefers the name \"Sugar Daddy\"</p>\n<br/>\n<p>Speaking of sugar, bread! That's a good segway, right? Well it's gonna have to be, expect the topic of money to be forced into at least half of all the conversations you and Leo share, with interest!</p>\n<br/>\n<p>The airhead who would forget his own name if you let him, often found in large bodies of water or ''land surfing''.  Strangely enough, he doesn't know how to regular surf. Will he skate his way into your heart or will you say ''see you later boy?'' (You get it.)</p>\n<br/>\n<p>This is \"ACE\" let's agree to leave it at that... Deal? Good. You'll find yourself locked into many oaths to secrecy the longer you stick around, never speak on what you see with him or what he sees or what he doesn't see, that matters too</p>\n\n<p>You play as Roxanne (nameable), The catalyst to all the trouble that goes down during the weekend and every day before and after that, depending on who you ask. This reputation has earned her the honorable nickname of \"Trouble Maker\" along with a few, less flattering, ones.</p>\n\n\n<p><strong>Key features:</strong></p>\n<ul><li><strong>5 ENDINGS! Try to give the crew a happy one if you can</strong></li></ul>\n<ul><li><strong>There are more than 20+ unique friends to meet... and enemies</strong></li><li><strong>A CHOICE-BASED</strong><strong> STORY driven by YOUR </strong><strong>decisions</strong></li><li><strong>LIVE SCENES to breath life into every place you travel </strong></li><li><strong>A full gallery of over 35+ CGS</strong></li><li><strong>Clothes! There are a lota fits in this game, looota fits. The love interests each have 3+ outfit changes throughout the story, and Roxanne has seven SEVEN!</strong></li></ul>\r\nPossible Trigger warnings: Suggested suicide, Self-harm, Partial nudity, Drugs, Crude humor, Strong language &amp; depictions of violence... blood?!\r\n\r\nDid you enjoy the game?\r\nRate &amp; Comment⭐⭐⭐⭐⭐\r\nOR\r\nWhen you Support Mooncaustics on PATREON you gain access to Exclusive art, polls, DLC, and an inside peek at the next big project\r\n-🍒\r\n\n\n<p>Play the demos, they're FREE!<br/></p>\n<p>            <br/></p>", "metacritic": null, "released": null, "tba": false, "updated": "2023-01-06T04:31:13", "background_image": "https://media.rawg.io/media/screenshots/0ac/0acc31626ecb0e39e1f0b7abcbf3a38d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 211, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["MC"], "genres": [], "publishers": [], "esrb_rating": null}