{"id": 904304, "slug": "it-lurks-a-noir-horror-rpg", "name": "It Lurks! A Noir Horror RPG.", "name_original": "It Lurks! A Noir Horror RPG.", "description": "<h3>Synopsis:</h3> <br/>Meet Nate Hendricks, a Private Detective who's a bit down on his luck. <br/><br/>Business has been slow and with the bills piling up Nate may have to soon close-up shop. He just needs a break. Perhaps one good case could help him turn things around. <br/><br/>Then one evening, he gets a call from a Doctor Offenhauser who wants to hire him. The Doc doesn't give many details over the phone, but insists it's an urgent matter that can't wait. <br/><h3>Some Game Features: </h3><br/>* An exciting turn-based and interactive battle-system. Quick reflexes and a strategic use of actions can help you to overcome dangerous foes. Weapons include a .38 Special gun which can be a Detective's best friend when in a tough jam. It shoots fast and deals a lot of damage, but ammo is limited so choose to use it wisely. There's also a trusty Combat-Knife used for melee attacks. Plus you'll have skills and items that can also help. <br/><br/>* Walls in the foreground will become solid as the Player-character moves away from them, and become translucent when nearing them to help you better explore an area. <br/><br/>* Fitting music and sound-effects used throughout the game. <br/><br/>* Some sounds (fire in the fireplace, clocks-ticking, etc...) will become louder or softer as the Player-character nears or walks away from the source. <br/><br/>* A dark story and a creepy manor to explore. <br/><br/>* A nice looking menu-system. <br/><br/>* Use of lighting and other cool effects.", "metacritic": null, "released": "2022-12-27", "tba": false, "updated": "2023-01-20T04:29:48", "background_image": "https://media.rawg.io/media/screenshots/447/4478fdd5315b2b915d30df952ea24eac.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 203, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mystic Sword", "Mystic Sword Gaming"], "genres": ["Action", "Adventure", "RPG", "Indie"], "publishers": ["Mystic Sword Gaming"], "esrb_rating": null}