{"id": 904401, "slug": "taxingtiles", "name": "TaxingTiles", "name_original": "TaxingTiles", "description": "Prepare yourself for an extraordinary gaming experience that melds roguelike strategy, deck building, and nostalgic arcade thrills. Welcome to \"Taxing Tiles\", where you'll embark on a captivating journey through a dynamic world teeming with surprises, challenges, and enigmas waiting to be unveiled.<br/>\n<br/>\r\nKey Features:<br/>\n<br/>\r\n🎲 Deck-Building Mastery:<br/>\r\nCraft and fine-tune your card deck as you confront the ever-shifting trials of \"Taxing Tiles\". Each card you draw holds the power to reshape your destiny.<br/>\n<br/>\r\n🏰 Forge Your Realm:<br/>\r\nStrategically place an array of tiles to shape your realm. Cultivate lush farms, nurture vibrant flower fields, mine precious gems, and construct majestic buildings. Your world, your rules.<br/>\n<br/>\r\n🧙 Mystical Spells:<br/>\n<br/>\r\n Harness the arcane arts with a unique spellcasting system. Unleash \"Burning Hands\" to obliterate unwanted tiles, conjure spells that fill your coffers with gold, peer into the future to grab cards yet to be drawn, and gain rerolls and skips to craft the perfect hand.<br/>\n<br/>\r\n🪓 Tile Interactions: <br/>\n<br/>\r\nEngage in tile interactions that bring your world to life. Chop down towering trees for resources, mine valuable rocks for gems, and navigate the perilous challenge of summoning mystical creatures like Ents.<br/>\n<br/>\r\n🔥 Tactical Gameplay:<br/>\n<br/>\r\n Navigate the ever-evolving landscape with precision and strategy. Can you outlast the relentless challenges and thrive for five years?<br/>\n<br/>\r\n🕹️ Retro Arcade Delights: <br/>\n<br/>\r\nImmerse yourself in classic arcade-style gameplay with a modern twist. \"Taxing Tiles\" offers the perfect balance of challenge and enjoyment, easy to pick up but hard to put down.<br/>\n<br/>\r\n🌟 Hidden Wonders: <br/>\n<br/>\r\nDive deep into the game to uncover elusive mysteries and unlock its most coveted secrets. Do you have what it takes to unveil every hidden gem?<br/>\n<br/>\r\n🃏 Luck Meets Strategy: <br/>\n<br/>\r\nImagine \"Luck be a Landlord\" merging with \"Slay the Spire\", where chance and strategy dance in harmony.<br/>\n<br/>\r\nIn \"Taxing Tiles\", your destiny is in your hands as you strive to conquer a dynamic world that's as unpredictable as it is exhilarating. Can you survive, flourish, and unveil all the game's well-guarded wonders? But beware of the mischievous bunnies. The adventure of a lifetime awaits, where your realm is limited only by your imagination!", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2024-03-22T07:54:30", "background_image": "https://media.rawg.io/media/screenshots/65d/65da4a27251cdcce77ce074c88743495.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 55, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["GDOGames", "GDO_Games"], "genres": ["Strategy", "Casual", "Indie", "Puzzle"], "publishers": ["GDO_Games"], "esrb_rating": null}