{"id": 904532, "slug": "formation-tactics-game", "name": "Formation Tactics Game", "name_original": "Formation Tactics Game", "description": "<p>Control Camera with WASDEQ, right click and drag rotate, middle click and drag move, double left click move to spot, and shift for faster. Left click or left click and drag to select units. Right click or right click and drag to move.</p>\n<p> Most units cannot be given direct charge or shoot commands most of the time as they auto charge/shoot priority targets, but can be given if within auto charge range and no priority targets override. Press R to restart. </p>\n<p>There are no win conditions currently, and it is not multiplayer yet (you can just control both sides). Units disorder (yellow flag), reducing effectiveness before routing (white flag). Unit state displayed on flag.</p>\n<p>There are advantages to flank attacks, bowmen are poor in melee, light foot evade, cav are more effective on charge except vs spears, etc...bowmen can only shoot over allies if at a higher elevation. Swordsmen and cav are impetuous and anarchy charge at a greater range, and spearmen are not and instead end up 'zoc (zone of control) locked' if facing an enemy nearby without a charge command (a ZoC'd unit can only charge, or if given a move order, recoil). Units show their current state and level of disorder on their banners. Routed units do not rally. There currently is no disordering terrain, but i'll add that eventually, but overlapping units disorders them. </p>\n<p>All move orders to non general's units are sent via courier, ie you have to wait for the horseman to get there from the general, so units don't respond automatically.</p>\n<p>The game is just a single scene/battle currently. This is a prototype to gauge interest and get feedback.</p>\n<p>*unit cards don't really work</p>", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-01-06T05:58:38", "background_image": "https://media.rawg.io/media/screenshots/511/5116a010d6a1b43d66126f6ae83ff462.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Gabe1010"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}