{"id": 90457, "slug": "wolfquest-itch", "name": "WolfQuest (itch)", "name_original": "WolfQuest (itch)", "description": "Announcing WolfQuest 3: Anniversary Edition and Tower Fall Expansion!\r\n<p><strong>We're remaking the game from the ground up!</strong> Bigger and better gameplay, huge new maps, more animals...and it'll be a<strong> free update</strong>! To be released later in 2018, followed by an all-new episode, Tower Fall, which will be DLC for purchase.   Learn more in the game FAQS and devblog!<br/></p>\r\nLive the life of a wild wolf!\r\n<p>\n<strong>You are a two-year old gray wolf</strong> born in the Northern Range of Yellowstone National Park. You learned the ways of the wolf in your birth pack. Now it's time for you to learn how to live on your own, finding food, meeting other wolves, and searching for a mate. Ultimately, your goal is to find a home and build your own family.\r\n</p>\r\nEmbark on a quest for survival!\r\n<p>\n<strong>Your quest begins</strong> on the slopes of Amethyst Mountain and eventually takes you across the Lamar Valley to Slough Creek. There, you and your mate will establish a territory and raise a litter of pups: training them, feeding them, defending them against predators, and finally taking them on a cross-country journey to a summer home. Ultimately, your success will depend on your ability to ensure the survival of your pack.\r\n</p>\r\nPlay the game alone or with friends!\r\n<p>\r\nIn single-player games, learn how to hunt elk, communicate with other wolves, find a mate, establish a den and territory, raise pups, and embark on a perilous journey to a summering site.\r\n\t<br/>\n<br/>\r\nIn multiplayer games, explore the wilderness and hunt elk together, and now raise pups together! This new version features the entire Slough Creek mission arc, from choosing a den to raising pups and traveling to the rendezvous site. There are two types of multiplayer games:\r\n</p>\n<ul>\n<li>Private games: Invite-only, featuring voice, text, and phrase chat.</li>\n<li>Public games: Anyone can join, phrase chat -- and now plus text chat for players age 13 and up!</li>\n</ul>\r\nNew and improved!\r\n<p>\n<strong>This new version of </strong><em><strong>WolfQuest</strong></em> features improved and refined gameplay and graphics, a new player account system with achievements, friends lists, and more, plus a rewritten animal AI system, hundreds of bugfixes, and a new map to explore in single and multiplayer games. As always, there's also an active online community where you can discuss the game with other players and share artwork and stories about wolves. Visit www.wolfquest.org to join in.\r\n</p>\n<ul>\n<li><strong>Improved and refined gameplay.</strong></li>\n<li><strong>Improved graphics for</strong> greater realism and immersion.</li>\n<li><strong>Expanded wolf customizations:</strong> wolf coats, injured body parts, and howls.</li>\n<li><strong>New player account system</strong> with achievements, friends lists, and more.</li>\n<li><strong>New animals! </strong>Cougars, foxes, ravens and other birds, and insects.</li>\n<li><strong>Emotes</strong> to express yourself using accurate wolf behaviors.</li>\n<li><strong>Rewritten animal AI system.</strong></li>\n<li><strong>Hundreds of bugfixes.</strong></li>\n<li>Read the manual for full specs and gameplay descriptions.</li>\n</ul>\r\nPlatforms:  Mac and Windows\r\n<p>Use link at bottom of this page for iOS version. Android and Kindle versions coming in September 2016. </p>\n<p>\n<strong>Price: </strong>$10 (includes the complete game and a key to create a player account) (<em>Do players think the game is worth the price? Find out here.)</em>\n</p>\r\nAwards\r\n<ul>\n<li>Bronze MUSE Award, American Association of Museums</li>\n<li>Education Award, Association of Zoos and Aquariums,</li>\n<li>Editor's Choice Award, Children's Technology Review</li>\n</ul>\r\nBonus Option: Music Extras!\r\n<p>\r\n\tFor $2 more, get the \r\n\t<strong>Music Extras</strong>, which include the complete game soundtrack and a 25-minute video featuring game composer Tim Buzza talking about how he created the signature sound of WolfQuest and many memorable tracks in the game. Or buy it separately for $3.\r\n</p>\r\nSystem Requirements\r\n<p>\n<em>If you are not sure if your computer can run the game, download the free trial — but keep in mind that later levels are more demanding of your computer, so if the game barely runs the free trial well, then the rest of the game may not run well enough on your computer.</em><br/>\n</p>\n<p>\n<strong>Windows</strong>\n</p>\n<ul>\n<li>Windows XP Service Pack 2 or higher (DirectX 9.0c or higher must be installed).</li>\n<li>DirectX 9 or higher GPU</li>\n<li>1024x768 screen resolution</li>\n<li>2.0 GHz Dual Core Pentium, i3, or higher processor</li>\n<li>2 GB available hard drive space</li>\n<li>4 GB RAM</li>\n</ul>\n<p>\n<em><strong><em>Note: </em></strong>Netbooks with smaller screen dimensions must have the extended desktop enabled to install, and there may be performance problems. WolfQuest does not officially support \"netbook\" grade notebook computers due to limited RAM, CPU, and graphics capabilities.</em>\n</p>\n<p>\n<strong>Minimum Graphics Card (for Fast Quality)</strong>\n</p>\n<ul>\n<li>Intel 4000 integrated graphics or higher</li>\n<li>NVIDIA 6800 Ultra</li>\n<li>ATI HD 3670</li>\n</ul>\n<p>\n<strong>Recommended Graphics Card (for Good Quality or Higher)</strong><br/>\n</p>\n<ul>\n<li>NVIDIA GeForce 640 series or later</li>\n<li>AMD Radeon HD 6670</li>\n</ul>\n<p>\n<strong>Mac OSX</strong>\n</p>\n<ul>\n<li>OSX 10.9 or higher</li>\n<li>64-bit processor (i5 or higher)</li>\n<li>1024 x 768 or higher screen resolution</li>\n<li>2 GB available hard drive space</li>\n<li>4 GB RAM</li>\n</ul>\n<p>\n<strong>Minimum Graphics Card (for Fast Quality)</strong>\n</p>\n<ul>\n<li>Intel 4000 integrated graphics or higher</li>\n</ul>\n<p>\n<strong>Recommended Graphics Card (for Good Quality or Higher)</strong>\n</p>\n<ul>\n<li>NVIDIA GeForce 640 series or later</li>\n<li>AMD Radeon HD 6670</li>\n</ul>\n<p>\r\n\tNote: As with all video games, more powerful graphics cards and CPUs allow higher screen resolutions and/or quality settings. Older video cards and drivers may exhibit rendering or performance issues, and slower CPUs may exhibit lower frame rates and performance issues.\r\n</p>\n<p>\n<strong>Internet Connection</strong>\n</p>\n<p>\r\n\tAn active broadband Internet connection is required to:\r\n</p>\n<ul>\n<li>Start or join multiplayer games.</li>\n<li>Access your player account, including:\r\n\t<ul>\n<li>Earning Achievements</li>\n<li>Sending and receiving messages</li>\n<li>Viewing and making Friends and Packs</li>\n</ul>\n</li>\n</ul>\n<p>\r\n\tAn Internet connection is not required to play in single player mode after the game launcher has downloaded and installed the game.\r\n</p>\r\nTech Support\r\n<p>\r\n\tHaving trouble installing or running the game? Please check the system requirements above to ensure that your computer meets or exceeds them. If so, then please \r\n\t<strong>read these troubleshooting tips</strong>. If you still have trouble, submit a bug report (following the directions at the top of the Troubleshooting page) and we'll do our very best to help you, and if all else fails, then we will refund your money.\r\n</p>\n<p>\r\n\tIf you have questions or problems after getting the game running. please \r\n\tread the FAQs.\r\n</p>\n<p>\n<em>______________________________________________________________<br/>\n</em><strong>WolfQuest is now on Steam!</strong>\n</p>\n<p>\r\n\tYour purchase here on itch.io includes a Steam key. The Steam version includes Steam achievements, trading cards, badges and more!  If you prefer to buy the game on Steam, go to our \r\n\tSteam page. <em>(But please note: </em><em>We receive a smaller percentage of money from purchases on Steam compared to itch.io, so we always prefer that you purchase on itch.io, then claim a Steam key to get it there.)</em>\n</p>\n<p>\r\n\t______________________________________________________________\r\n</p>\r\nThis version is for Mac and Windows computers only!\r\n<p>\r\n\tUse the link below for iOS, Android, and Kindle versions. </p>\n<p>The game does not run on ChromeBooks, sorry.\r\n</p>\n<p>\r\n\t______________________________________________________________\r\n</p>\n<p>\n<br/>\n</p>", "metacritic": null, "released": "2015-11-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/014/014bfc5ce9d5276a8b4acdaf5a18f1f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 196, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["eduweb"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}