{"id": 90458, "slug": "the-blind-griffin", "name": "The Blind Griffin", "name_original": "The Blind Griffin", "description": "<p>\t\tThe Blind Griffin is an otome game developed by Asphodel Quartet for NaNoRenO 2015. Our team is made up of artists Auro-Cyanide and Rins, writer/programmer Lorelei, and composer/musician Noyemi K. The game features three different character routes (Giovanni, Alexei, and Emilio) and has 10 different endings. The game is free with a pay-what-you-want system in place for people who'd like to leave a tip.</p><p>Trigger/content warnings for mentions and/or depictions of: death, execution, suicide, drug use/abuse, alcohol. We recommend that players be at least 13 years of age to play this game.</p><p>PURCHASE THE ORIGINALSOUNDTRACK HERE!</p>S T O R Y<p>\tIt's the roaring 20's. Alcohol-loving Americans are chafing underneath the restrictions of Prohibition, but speakeasies have thankfully risen to fill the void with ill-begotten booze. The Blind Griffin is one such speakeasy in San Francisco, California, but it's about to go out of business...because its employees are a den of magicians who are more concerned with their magical studies and experiments than moonshine! Desperate not to lose the building that has become their haven, they hire the first streetsmart guttersnipe they find with some experience to help turn things around, but could she perhaps turn out to be the strongest magician of them all?</p>\tC H A R A C T E R S<p> <br/>\n</p><p> <strong>GIOVANNI (GIO) //</strong> The speakeasy's premier violinist. He moonlights as a saxophone player but he's awful at it (nobody tells him). The laid-back older brother of the group and widely regarded to be the strongest magician of the coven, Gio takes the safety of the group as a whole very seriously. Specializes in earth magic.<br/> <strong>MARIE //</strong> The owner of the Blind Griffin. She was disowned by her high-class family because of her gender identity, but is allowed to keep the building provided the business turns a profit. Cultured and delicate, Marie is unfortunately a busybody for whom money seems like it's water. Do NOT make comments about her height.<br/> <strong>ALEXEI //</strong> The displaced nobleman. He and his family were part of the Russian imperial court, but had to emigrate to America after the revolution. Though he acts cold towards people he's unfamiliar with and comes off as blunt and awkward at first, he is actually kind at heart and easily flustered. Specializes in water/ice magic.<br/> <strong>EMILIO //</strong> The working class baby of the group. Emilio is the most junior member of the coven until the heroine arrives. His family runs a small bistro, but they barely make ends meet. His bad experiences with non-mages have put a chip on his shoulder and added fuel to his already hot-tempered, megalomaniacal tendencies. Specializes in fire magic.<br/> <strong>??? //</strong> The heroine. The youngest child of a large Chinese family, she had to make herself useful from a young age and thus never received any formal education. She is practical, street-smart, and no nonsense. For some reason, she hates her actual name so she goes by a nickname (that the player sets). The extent of her powers is unknown.<br/> <strong>VIVIENNE (VIVI) //</strong> The songstress. A city slicker originally from New York, she saw Bessie Smith performing live once and was so totally star-struck that she decided right then and there that she would put her all into becoming a singer. Vivi is bubbly and sweet-natured, but also quite headstrong. Specializes in air magic.</p>", "metacritic": null, "released": "2015-04-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/cba/cba7581585e163b5be4453bfe104d1ad.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 3, "owned": 2, "beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 140, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Asphodel Quartet"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}