{"id": 904582, "slug": "plants-make-people-happy-ld50", "name": "Plants Make People Happy (LD50)", "name_original": "Plants Make People Happy (LD50)", "description": "<p><strong><em>Plants Make People Happy</em></strong>\n</p>\n<p><em>(10 minutes, 1 player)</em></p>\n<p>The hashtag #Plantsmakepeoplehappy has been very popular during the Covid19 pandemic. Locked in our homes, many of us have surrounded ourselves with comforting foliage. But are we able to take care of all this vegetation?\r\n</p>\n<p>This game uses rules inspired by cellular automata: place the plants on the grid and they will survive depending on who their neighbors are. You may think you have a green thumb, but you have little chance of winning...\r\n</p>\n<p>The experience is inspired by the lives of the authors, who did not have much success with their improvised rain forest.\r\n</p>\n<p><strong><em>******</em></strong></p>\n<p><strong><em>Plants Make People Happy</em></strong></p>\n<p><em>(10 minutes, un joueur)</em></p>\n<p>Le hashtag #Plantsmakepeoplehappy a été très populaire durant la pandémie de Covid19. Enfermés chez nous, nous sommes nombreux à nous être entourés de feuillage réconfortant. Mais sommes-nous capables de prendre soin de toute cette végétation ?</p>\n<p>Ce jeu reprend des règles inspirées des automates cellulaires : placez les plantes sur la grille et elles survivront selon qui sont leurs voisines. Vous pensez peut-être avoir le pouce vert, mais vous avez peu de chance de gagner…  </p>\n<p>L’expérience est inspirée de la vie des auteurs, qui n’ont pas eu beaucoup de succès avec leur forêt vierge improvisée.\r\n</p>", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-01-06T06:19:11", "background_image": "https://media.rawg.io/media/screenshots/78d/78d8dec8e21227d099d921be37b6f043.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 26, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["YetAnotherGame", "laulgame"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}