{"id": 90466, "slug": "captive-audience", "name": "Captive Audience", "name_original": "Captive Audience", "description": "<p>Captive Audience is a first person Narrative Thriller set in the confines of the Compendium Estates, a dark-web corporation responsible for the creation of unlicensed programming using unwilling participants sourced from death row.</p>\n<p>With a focus on object interactivity, as well as a fully voice acted story complete with multiple scenes of dialogue, scoring and object commentary, Captive Audience aims to be an immersive, engaging thriller that draws the player into its world and pulls them through to the shocking conclusion.</p>\n\n<p><strong>Synopsis</strong></p>\n<p>Five years ago Matt's wife Julia was convicted for a crime she didn't commit, and transferred to the Compendium Estates before her conviction could be carried through. </p>\n<p>In a desperate attempt to free her from a fate of servitude Matt attempted a rescue, only to be captured himself, imprisoned by the Compendium Estates and finding himself as the star for their latest show \"Captive Audience\".</p>\n\n<p>Now, five seasons on, the intervention of a unknown forces offers a chance of escape to Matt, one he cannot pass up. Completing episodes of the show during the day, and attempting escape at night, Matt must work his way through the confines of the Compendium sound stage to free both himself and his wife.</p>\n\n<p><strong>Fully voice acted</strong></p>\n<p>Captive Audience is a fully voice acted experience narrated by professional actors from across the UK. We spent a lot of time ensuring we found the best people for each role, recording them in a professional grade sound studio and then mixing them into our world to make the experience more immersive.</p>\n\n<p><strong>Interact with the world</strong></p>\n<p>Captive Audience features numerous objects in the environment that the player can interact with, from basketballs to stuffed cows. Each items has its own unique dialogue or SFX attached to it, ensuring they feel realistic and impact to both the character and the player.</p>\n\n<p><strong>Dynamic node based story-telling system</strong></p>\n<p>Our unique nodular system for Captive Audience allows the story to progress in a natural and systematic way, ensuring the flow of the narrative is never interrupted so that the player really feels like a part of the show. Each episode is split into two sections, the \"Show\", where Matt is forced to complete tasks for TV, and the \"Escape\" where at night Matt works to ensure his freedom.</p>\n\n<p><strong>Detailed lighting and environments</strong></p>\n<p>Captive Audience makes use of Unity's lighting with the addition of volumetric systems to give the light a really weighty and realistic feel. We wanted every environment to reflect the tone of the scenario Matt finds himself in, be it a warmly lit set, or a cold, dark corridor backstage.</p>\n<p>***********************************************************************************</p>\n<p>Controls:</p>\n<p>W/A/S/D - Move<br/>E - Interact<br/>Left Mouse - Move Camera<br/>Right Mouse (Hold) - Rotate Objects<br/>Shift - Sprint</p>\n<p>***********************************************************************************</p>\n<p>Please note \"Captive Audience\" is designed as a <strong>Prototype</strong> for a game concept and as such is likely to contain bugs, issues etc. This is<strong> not a commercial product</strong>, but is intended to be seen as is to evaluate the concept and gameplay mechanics.</p>\n<p>This also means minimal updates will occur from this point on, that being said we really hope you enjoy our game, we had a lot of fun making it!</p>\n<p>If a scene becomes stuck, or you complete a task and are unable to progress through to the night section of the game, please make use of the \"Skip Scene\" button located in the pause menu. Simply click it, unpause the game and this will progress you to the next segment of the game.</p>\n<p>If you have any feedback or thoughts on the game, then please don't hesitate to comment or contact us, we'd love to hear what you think!</p>", "metacritic": null, "released": "2018-06-21", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/08d/08d7ff824f77c598b939d5661243e0f3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 235, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Captive Minds"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}