{"id": 90470, "slug": "queens-crown", "name": "Queen's Crown", "name_original": "Queen's Crown", "description": "<p><em>\"...A world is supported by four things...the learning of the wise, the justice of the great, the prayers of the righteous and the valor of the brave. But all of these are as nothing without a ruler who knows the art of ruling.\" </em></p>\n<p><em>- Frank Herbert</em></p>\n<p>When your brother, the King, is killed in an ongoing war with the neighboring country of Tawar, <strong>you </strong>are named next in line for the throne. </p>\n<p>No one said wearing a crown would be easy, however. It will take all of your charm, cunning, and strength as a ruler to keep it. </p>\n<p>There is also the small matter of your suitors... </p>\n<p>... An elegant former tutor who seems a little too determined to hold you at arms length, a tempestuous lord whose bid for your hand could decide the fate of the kingdom, and even a surprisingly witty ambassador from the very country you are at war with...</p>\n<p>Settle the conflict in your kingdom and decide who - if anyone - will be at your side when it ends.</p>\n<p>Set in the medieval fantasy setting of Sinado, <em>Queen's Crown</em>, is a visual novel otome game influenced heavily by Bioware titles such as <em>Dragon Age</em>, <em>Baldur's Gate</em>, and <em>Planescape: Torment. </em>Political intrigue and danger abound, even as you woo one of the three eligible suitors.</p>\n\n<p>New demo (updated 02/14/17) features:</p>\n<ul><li>A nameable, customizable protagonist whose actions and personality are determined by you!</li><li>A stat-building system made up of 3 different attributes: Intelligence, Strength, and Charisma</li><li>Opportunities to build stats manually as well as in casual conversation for heightened role-playing potential!</li><li>Roughly 45,000 words of content or about 1-2 hours of gameplay</li><li>Original music composed by the talented Noyemi K!</li><li>Beautiful hand-drawn BGs by RudeRoo</li><li>CGs done by Sweet Chiel, creator of Nusantara: Legend of the Winged Ones</li><li>New GUI generously provided by Potouto</li><li>Sprites drawn by Nero aka Ofdawnandtwilight!</li></ul>\n\n<p><strong>Note: only the demo is playable at the moment. </strong><strong>Full Game to be released tentatively around March, 2018! Look for it here and on Steam!</strong></p>\n<p>Follow development more closely on Twitter, Tumblr, or Facebook!</p>", "metacritic": null, "released": "2016-05-11", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/68b/68b01cfe255c693bb7b0cd5f001c7958.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 176, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Agashi"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}