{"id": 904878, "slug": "o-crime-do-castelo-monteiro", "name": "O Crime do Castelo Monteiro", "name_original": "O Crime do Castelo Monteiro", "description": "<p>Era madrugada quando Lúcia, detetive da polícia, recebeu uma ligação de urgência pois havia um caso para ser resolvido e testemunhas para serem investigadas. O caso era de um crime que aconteceu no Castelo Monteiro, Raquel havia desmaiado numa festa clandestina feita por um grupo de jovens, eles eram João, Amanda, Janis, Pedro, Tiago e Renato. A vítima não acordou após o desmaio e de sua boca saía muita espuma, o que levou os jovens a chamarem a polícia. Os amigos encontravam-se em extremo apavoro e nervosismo, o choro quase lavará suas roupas.<br/></p>\n<p>Você é capaz de juntar as evidências para desvendar um crime de assassinato? Em “O Crime do Castelo Monteiro” você assumirá o papel de Lúcia Costa, uma detetive particular, inteligente e cautelosa, que foi incumbida de investigar um caso complexo de assassinato que ocorreu em uma antiga casa de shows abandonada chamada Castelo Monteiro. Suas habilidades de investigação e sua atenção aos detalhes serão testadas em uma série de interrogatórios desenvolvidos com base em suas investigações e em suas provas para que o verdadeiro culpado seja descoberto.</p><p>Participaram desse projeto:</p><p>Caio Monteiro</p><p>Fabrícia Neres</p><p>Giovanna Cruz</p><p>Tamires Amaral</p>", "metacritic": null, "released": "2023-01-04", "tba": false, "updated": "2023-01-06T08:12:21", "background_image": "https://media.rawg.io/media/screenshots/6a7/6a70a0a32a7da2f4f045eeb3fbd0f5bc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 90, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Caio Monteiro"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}