{"id": 904908, "slug": "vega-itch-aftermoon", "name": "Vega (itch) (AfterMoon)", "name_original": "Vega (itch) (AfterMoon)", "description": "<p>Humans exploited the earth to a point of no return. For centuries people overlooked the effects of their inconsiderate behavior and now their planet is worn out and not able to provide for them a flourishing and safe home. What is left of their lively and nurturing world is a barren wasteland.  Animals are dying and vegetation isn’t able to resist the severity of the mistreatment perpetrated by people on the environment. Humanity is on the verge of destruction and all living beings are being consumed by starvation, drought and illnesses caused by pollution. You are part of an army of androids equipped with highly intelligent and sensible AI, designed to travel through space to find a potential exoplanet that humans can populate in order to save themselves. Your job is to train at zero gravity during this galactic journey to face and fight the possible threats that could be found in the newly founded home. Once landed, you will have to apply a deep understanding of earth's natural conditions to try and replicate it in order to create favorable conditions to make the growth of plants and life possible. If humans want to survive they will have to learn from their mistakes and understand the impact of their choice.</p><p>Get access to an armory and use resources to choose your weapons before each fight. Each weapon have different abilities and characteristics, upgrade them as you progress and level up your stats. Create your strategy and fight for the victory</p>\n\n<p>Improve your skills by training your aim accuracy and reflexes. Choose the difficulty level and compete for the first place on the leaderboard.</p>\n<p>Fly at zero gravity and fight against your enemies. Avoid its shot and try to beat them. After each fight your enemy becomes stronger and its aim more precise. Win ten fights to conquer the victory!</p>", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-01-06T08:23:47", "background_image": "https://media.rawg.io/media/screenshots/241/2415b37054d85f412ab4a70b2b6994d3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 137, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["AfterMoon"], "genres": ["Action", "Shooter"], "publishers": [], "esrb_rating": null}