{"id": 905115, "slug": "alphaborne", "name": "ALPHABORNE", "name_original": "ALPHABORNE", "description": "<p>This is my unique version of the venerable game Space Invaders: Alphaborne. Javascript is not my main programming language but developing AlphaBorne definitely helped my JavaScript and HTML5 programming skills. </p><p>It helped because I assembled the developed environment; made and maneuvered the player's spacecraft; created enemy invasion grids at predetermined intervals; fired projectiles; use accurate collision detection to eliminate the invaders; make bombs so all the invaders explode at once; obtained a machine gun powerup that changes my spacecraft's rate of fire; made the game harder as the invaders come close to you and made their projectiles double the size so it will be harder for my spacecraft to dodge; included particle animations; created the game's UI with HTML and CSS; added music and sound effects and coded the uniform frame rates for all display types. </p><p>Knowing my precise score after taking out each invader would be useful. so I animated in when I shoot an invader and disappear when I don't. It produces a really cool effect and makes Alphaborne stand out right away. </p><p>Adding a special weapon to Alphaborne: explosive bombs added more excitement to the game because when it detonates, they ricochet off the screen's boundaries, and instantly eliminate most invading enemies (if lucky). </p><p>To make a power-up effect that enables my spaceship to fire missiles in a rhythm akin to a machine gun. To achieve this, I made use of event listeners, object properties, timers, and randomization. </p><p>At that point, the game was too simple. Therefore, I made two strategies for making our invaders more difficult: by gradually generating them fast and expanding their projectile size. Additionally, I included a feature that enables an invader to end the game by directly touching my spacecraft. </p><p>It would be much nicer to give users a start screen where they could choose when they'd like to start playing Alphaborne rather than launching it as soon as the website loads. The ability to resume the game after a loss would also be nice. I used some external resources and directly incorporate HTML into my JavaScript to create this effect. </p><p>To include sound effects and music, I make use of a third-party JavaScript library called Howler. Howler resolves various problems with the native JavaScript audio API, such as the inability to layer one audio stream on top of another.<br/></p>", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-01-06T09:51:46", "background_image": "https://media.rawg.io/media/screenshots/194/1943d6c05a7feaf1dd919468a3f67f67.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 10, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["OnePersonStudio"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}