{"id": 905174, "slug": "archelements-demo-early-access-v-010", "name": "Archelements [Demo | Early Access] v 0.1.0", "name_original": "Archelements [Demo | Early Access] v 0.1.0", "description": "<p><em>Welcome and thank you for your interest in Archelements! This demo is a culmination of two weeks of work by two friends on opposite sides of the USA. We firmly believe in this project and plan to continue working hard until an eventual full release!</em></p>\n<p><em>A special thanks to you for trying our game- we hope you enjoy it as much as we enjoyed putting it together: and even moreso, we hope this whets your appetite; there is more to come in the future and that is a guarantee! </em></p>\n<p><em>With best wishes included,</em></p>\n<p><em>Kroazakura and Necrovulture of Vox Magi Studios</em></p>\n\n<p>Light and Darkness: A dichotomy upon which all of creation is born and bound. Sempiternal warfare between these forces defines all life in all realms- connected through the roots of the Auch’Viniam or “Tree of Life”. While the forces of Light build and create, the forces of Dark consume and destroy: this is absolute nature. <br/></p>\n<p>However, a plot to overthrow the balance of the universe is in motion on one of the worlds sanctified by the Auch’Viniam’s roots. The Tree of Life’s holy blessing of Affinity, which binds mortal creatures to the elements around them- faces an ultimate blasphemy by those who worship the Darkness. Affinity-wielding monsters have appeared en masse on the continent of Ardentia, threatening the ecosystem with devastation and pushing civilization to the brink: leaving those without Affinity afraid to walk beyond the walls of their towns. </p>\n<p>Ignorant to these happenings, an Affinity-wielding mercenary seeks to start a new life in Ardentia- away from their homeland of Drakenfort across the Bulwark Basin Sea. A missive from the Guildhouse in Gideon steers their destination towards the self-proclaimed Port of Opportunity. Both the Sellsword and the people of Gideon are blissfully unaware of the strife slowly spreading across the land- and a perfect storm brews on the horizon to herald this lauded mercenary’s arrival. A silent declaration of war: the battle for the fate of creation has begun.</p>", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-01-06T10:14:34", "background_image": "https://media.rawg.io/media/screenshots/5c6/5c678cc9f748b708c23d079549e15f00.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 159, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Kroa"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}