{"id": 905158, "slug": "death-trick-double-blind", "name": "Death Trick: Double Blind", "name_original": "Death Trick: Double Blind", "description": "Come one, come all to Morgan’s Traveling Circus, the greatest show in America! Or it was, until its star, Hattie, disappeared. <br/><br/>Take a step back in time to the middle of the mid 20th century, as a magician and a private eye tackle the case of the missing magician. Marvel at lush pulp art visuals and an atmospheric soundtrack that harkens back to the golden days of the traveling circus! But never forget, there’s a murderous mystery afoot.<br/><br/>Take control of two protagonists tackling the case from different perspectives: one a fellow magician and colleague of the victim, and the other a private eye grappling with a bout of amnesia. Use their unique skills and expertise to befriend and interrogate a huge cast of characters, investigate various locations, and hunt down contradictions in a winding narrative filled with twists, turns, and treachery sure to shock and delight would-be detectives and circus fans alike.<h3>Turns &amp; Action Points:</h3> With only limited actions one can take before passing time, plan carefully about which clues to pursue and which locations to investigate.<h3>Twin Perspectives:</h3> Alternate between a magician and a private eye: two different characters, with access to different information., and put the pieces together to see the bigger picture! <br/><h3>Unique \"Contradiction\" Mechanic:</h3> Gather evidence in your collection before combining conflicting reports to create a \"contradiction,\" then challenge the deceptions of those who would deceive a master investigator!<br/><br/><br/><br/><br/>🕵️‍♂️ <strong>8</strong> fully animated characters with their own goals, histories, and motives. <br/>🎪 <strong>10</strong> gorgeous locations to investigate and revisit.<br/>🎨 <strong>50+</strong> set of CGs and <strong>300+</strong> panels of comics to bring the circus to life <br/>🔠 A sprawling and non-linear narrative to engross and enchant <br/>🎭 Different unlockable endings for each major character.  <br/><br/><br/><br/>https://store.steampowered.com/app/2254710/Death_Trick_Double_Blind/", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2024-03-15T07:32:10", "background_image": "https://media.rawg.io/media/screenshots/4fb/4fb7e58b0565ba33a0b3cc1cb6607f6f.jpg", "website": "https://www.neondoctrine.com/games/death-trick-double-blind", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "toplay": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 169, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["DT_DoubleBlind", "Misty Mountain Studio"], "genres": ["Adventure", "Strategy", "Casual", "Indie"], "publishers": ["Neon Doctrine"], "esrb_rating": null}