{"id": 905250, "slug": "cubitron", "name": "Cubitron", "name_original": "Cubitron", "description": "<p>this is the first game from the CamereconGames game studio (so far only one person), made on the idea of YouTuber Brackeys, but in its own implementation (cyberpunk style)! This is just the beginning friends! I will (we) develop, gain experience, and upload games according to my own idea. I hope you will enjoy!</p>\n\n<p>You play as a small green cube whose origin is unknown (Maybe for now...) and you have to dodge evil red cubes while collecting coins along the way. These coins can then be spent on skins (in the future, not only on skins). Cubitron has 3 modes:</p>\n<p>Marathon - several levels with coins in a row.</p>\n<p>For a while (In development) - the task of which is to complete all levels as quickly as possible.</p>\n<p>Endless - Endless level (early access) where you can earn coins a lot.</p>\n\n\n<p>This project is being developed by CamereconGames, development updates are posted on the Discord channel, where you can keep up to date with updates.</p>\n<p>The game currently supports 2 languages: English and Russian.</p>\n<p>An Android version of the game is planned in the future.</p>\n<p>The game is incredibly early development, as time goes on many things will be improved and bugs fixed. If you find a bug, feel free to report it in our Discord. </p>\n<p>The game is totally free!</p>\n<p>https://discord.gg/BRu8WZfRWJ</p>\n\n\n<p>#fangame  #action #adventure #arcade #platformer #retro #other\r\n</p>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T10:45:09", "background_image": "https://media.rawg.io/media/screenshots/a40/a408552554d3a55406debc6faeffd86f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 17, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["CamereconGames"], "genres": ["Action", "Platformer"], "publishers": [], "esrb_rating": null}