{"id": 905233, "slug": "mighty-mini-golf", "name": "Mighty Mini Golf", "name_original": "Mighty Mini Golf", "description": "<p>Hey! I made a mini-golf game! Of course a normal mini-golf game wouldn't be terribly interesting, so this one has a few twists up its sleeve. Mighty Mini Golf you control your golfer and approach the ball before and after each stroke. The hazards on the course aren't just for the ball to avoid, either! This is a golf game where death can happen! Run out of health on a hole and you'll take the maximum amount of strokes and move on to the next one. You can take on the course in single player or against a friend in local multiplayer where there are a whole host of wacky items you can use to get the upper hand on your opponent, everything from tossing tomatoes, to smoke bombs, and even a killer bee hive! You can also swing your club to clear bushes and flip switches that effect all sorts of things on the course. Here's the controls since there's no in-game tutorial as of yet:</p>\n<p>Player 1 Controls<br/>-------------------------</p>\n<p>W,S,A,D - moves your golfer<br/>E - hit E once near your ball to start your swing. Then you can aim your shot using A and D. Then press E again to start the power meter, then E again to stop it and swing.<br/>R- swings your club to do stuff like clear out bushes or flip switches.<br/>F- uses any items you pick up on the course.<br/>T- shows where your golfer and ball are on the course.</p>\n<p>Player 2 Controls<br/>----------------------------</p>\n<p>I,J,K,L - moves your golfer<br/>O - hit O once near your ball to start your swing. Then you can aim your shot using J and L. Then press O again to start the power meter, then O again to stop it and swing.<br/>P- swings your club to do stuff like clear out bushes or flip switches.<br/>;- uses any items you pick up on the course.<br/>[ - shows where your golfer and ball are on the course.</p>\n<p>----- Other Stuff ------<br/>Aside from just playing the course, any time you get a birdie or better on a hole you will be rewarded with a birdie coin! These coins can be cashed in at the in-game shop to unlock new characters to play as!</p>\n<p>Special thanks to Sam and Josh of NerdOverload.com for the announcer voices.</p>", "metacritic": null, "released": "2023-01-03", "tba": false, "updated": "2023-01-06T10:38:27", "background_image": "https://media.rawg.io/media/screenshots/bb8/bb83fec6ca5c9f0cf65c2655ebf8be27.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 88, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["cthomaspinnick"], "genres": ["Sports"], "publishers": [], "esrb_rating": null}