{"id": 905365, "slug": "confusion-conveyed", "name": "Confusion Conveyed", "name_original": "Confusion Conveyed", "description": "<p>Use conveyor belts to solve increasingly complex puzzles in this open world expansion to Conveyor Con-fusion.</p>\n<p>Playing the original game first is highly recommended.  Playing the A and B branches will likely be sufficient, though reaching the ending is encouraged.  100% completion of the original is not necessary (and playing S.5 first is not recommended).<br/><br/>Arrows or WASD to move, Z to undo, R to restart the current region (dashed area), X to trigger explosives.  Press R to update levels (a message will show up if applicable).  The game automatically saves when you move from one region to another.  Note that there are some visual and audio bugs when moving between regions, though these should not affect gameplay.</p>\n<p>Best played in Chrome or Edge (Firefox also works but seems to run slower).  Safari on MacOS/iOS has default privacy settings that prevent the game from saving, so you'll have to use a different browser or change your privacy settings to allow third party site data to be stored.</p>\n<p>Special thanks to Joseph Mansfield for creating the Puzzlescript fork that this game was based on and for helping with debugging, Ricky Zhou for playtesting, and all the members of the Thinky Collective who created Conveyor Con-fusion and made this game possible.</p>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T11:34:43", "background_image": "https://media.rawg.io/media/screenshots/1fd/1fd215b2c47d3d4dafa529388f0283ee.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 7, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Steven Miller"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}