{"id": 905354, "slug": "shazabi-die-cantina-katakomben", "name": "Shazabi & die Cantina Katakomben", "name_original": "Shazabi & die Cantina Katakomben", "description": "<p>Begib dich in die Katakomben der Cantina  der Acht (so heißt die Community) und suche das Achtefakt! </p>\n<p>Rette dabei die Cantina Bewohner, die vom Zoo (den es eigentlich nicht gibt) entführt wurden.</p>\n<p>Durchquere 4 Ebenen, finde Schlüssel und bekämpfe Schlangen, Bären, Fledermäuse und ...ähm... nen Blob.</p>\n<p>Achtung: Enthält ne Menge Insider und Tentakel!</p>\n<ul><li>Pfeiltasten -&gt; Bewegen, Angreifen, Interagieren</li><li>X -&gt; Dialoge, Weiter</li></ul>\n<p>Das Spiel startete als kleines Experiment mit Pico8 und wurde zu einem kleinen Spiel, das ich im Rahmen eines Community Wichtelns auf einem Retro Handheld (RG300X) verschenkt habe. </p>\n<p>Ich mache seit über 20 Jahren Spiele oder helfe EntwicklerInnen Spiele umzusetzen. Aber es ist das erste Spiel seit 2017, dass ich \"release\", was für mich trotz des geringen Umfangs was sehr besonderes ist. </p>\n<p>Es basiert zu großen funktionalen Teilen auf dem Rogue-like-Tutorial von Krystian von Lazy Devs Academy. Sehr unterhaltsam und lehrreich, wenn man sich für Game Design und Pico8 im speziellen interessiert! Hier ist sein herausragendes Porklike.</p>\n<p>Bei ein paar Sprites hatte ich Unterstützung aus der Community. </p>\n<p>Sil3ntz hat die Sprites für das Achtefakt, sich selbst, den Pinguin, die Drachen und das Eichhörnchen beigesteuert.<br/></p>\n<p>Pan hat den Kaffeepool gepixelt und mir geholfen den dithered Farbverlauf im Game -Over-Screen einzubauen.</p>\n<p>Von Snabich hab ich die Music Sequenz, die in den Screens spielt. <br/></p>\n<p>Evtl. erweitere ich das Spiel noch etwas.</p>\n<p>WELTHERRSCHAFT!</p>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T11:30:18", "background_image": "https://media.rawg.io/media/screenshots/83d/83d2628b150cb94090a256de100c659d.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["AndiDev"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}