{"id": 905484, "slug": "sound-fighter-3d", "name": "Sound Fighter 3D", "name_original": "Sound Fighter 3D", "description": "<p>This is a simple demo, I will continue to improve this game:)<br/></p><p>Sound Fighter is a game that attacks by emitting sounds, eliminating monsters, looking for resources in the map, and ultimately killing the final BOSS game. Players control a character and face the full screen like a tide, move, shoot, cast, and survive. By killing the monster, the character can be upgraded by experience, and you can also pick up the shield to protect yourself.</p>\n<p>The game setting is the tenth generation heir of AWESOME LION's Roar. Now you are going to enter the sound forest to collect sound crystals, because you need to use it to practice Lion's Roar (this is a Chinese kung fu that can attack the enemy by shouting). In the process, you will continue to be attacked by monsters in the forest. Your goal is to find enough sound crystals and collect them. You attack the enemies in the fan -shaped area by shouting. The louder your voice, the higher the damage, the longer the sound duration, the farther the attack distance. After you kill the monster, you will have a chance to get experience value rewards, and you will increase your level after picking up enough experience. When you upgrade, you will randomly get three different skills to improve. You can choose a skill preservation from it, such as increasing the crit rate, increasing the attack fan size, increasing attack distance, or increasing the maximum health limit. Players continue to be strong in the choice again and again, and finally collect enough crystals. The sound crystal is an invisible crystal, but it will continue to make the sound of bell around the surroundings. The closer to the crystal, the louder the sound of the bell. So you can judge the position of the crystal through the sound of the bell. When you attack the crystal, the crystal will be explicit.</p>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T12:25:38", "background_image": "https://media.rawg.io/media/screenshots/2e9/2e92175feb30763864e667cfee908b66.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["tracy2333"], "genres": ["Action"], "publishers": [], "esrb_rating": null}