{"id": 905457, "slug": "law-of-the-cat-god", "name": "Law of the Cat God", "name_original": "Law of the Cat God", "description": "<p>Hello everybody!</p>\n<p>This is my first project, which is obviously unfinished, so I'd like to get some feedback first. I want this game to grow into something more, but I was busy with getting the game mechanics to work as intended  in the first place (don't ask how long this game has been in development already). My biggest issue at the moment is balancing. I don't want the game to progress too fast nor too slow. In the future I'd like to release this game on the Google Play Store (you guys have phones, right?).  </p>\n<p>Things you can do in the game:</p>\n<ol><li>Click the big maneki neko in the middle to gain Cat Karma, which is used to buy upgrades and such</li><li>Buy Cats, which will generate Cat Karma for you (pls no copyright infringementerino)</li><li>Buy Upgrades for your generators, increase income and speed with these</li><li>Prestige after reaching at least 1 billion Cat Karma and gain Prestige Points, which can in turn be used to buy even more upgrades (check the Prestige tab in the shop after your first Prestige)</li><li>Turn the music on and off or turn the volume up and down</li><li>Check the changelog</li><li>Check different ingame stats like current time or how much total Cat Karma you've earned</li><li>Hope that more content will be added soon</li><li>Admire cute and original artwork</li><li>Pray that saving/loading and offline progression work as intended</li></ol>\n\n<p>Things you can't do in the game:</p>\n<ol><li>File your taxes</li><li>Practice real-life law </li><li>Enslave an entire species of peaceful cats</li><li>Play minigames (...yet)</li><li>Fix your problems, but hey, don't give yourself up. We all feel that constant pressure, it's how we tackle and overcome all this trouble that makes us who we are. There are dark times, some even darker than anyone can imagine and it seems there is no way out, but never forget: even though life is not easy, you have it in you to make it easier. Even in pitch-black darkness, a glimmer of light is all we need to know that there is a way, that there is hope and that there is a reason to continue. Know that you are loved and don't be afraid to talk to someone about your issues. </li></ol>\n\n<p>Anyways, it would be great, if you could help me by playing and use the comment section to report any bugs you might encounter. Maybe you can also tell me what you liked or didn't like. I will try to answer any questions ASAP, but since this is only a hobby of mine and I work a full time job, please be patient with me.</p>\n\n<p>Thanks in advance!</p>\n\n<p>Things to add: </p>\n<ol><li>Backstory &amp; story in general</li><li>More rules</li><li>More artwork (thanks to my wife for that &lt;3 )</li><li>Better loading screen</li><li>Cover image</li><li>More content (e.g. <strong>Ascension</strong>, milestones, upgrades, different forms of progression, tutorial)</li><li>More QoL changes (suggestions please)</li><li>Maybe some minigames?</li><li>Create an original soundtrack</li><li>hidden messages some random stuff</li></ol>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T12:13:29", "background_image": "https://media.rawg.io/media/screenshots/2b2/2b237bccdd1dc122680d23b0d2eeb169.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 16, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Aimless Studios"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}