{"id": 905570, "slug": "battle-ram", "name": "Battle Ram", "name_original": "Battle Ram", "description": "<p>In a very secret laboratory, the perfect weapon was being developed. And as a result of numerous experiments, scientists brought out a powerful creature - the Battle Ram. And now the ram must be tested at a military training ground. He has to fight robots.<br />\nSo what exactly is Battle Ram? This is a lamb that runs around the arena. The character is controlled with the mouse. And all he can do is butt, he has no secret weapon. Actually, this is his main and only skill. The character runs around the arena, colliding with opponents. The musical accompaniment in the game is very cheerful and rhythmic.<br />\nThe environment in the game can be attributed to the style of animation. You can choose the following characteristics: puzzle, arcade, sports game, single player, difficult game.<br />\nThe game currently has only eight levels. Despite the small number of levels, the game is difficult. The difficulty of the game is that every time you lose, you start the battle from the very beginning.<br />\nThe game gives quite a lot of emotions, both positive and negative. Because the game is built according to such a scheme as &quot;easy too liarm&quot;. That is, we easily understand the rules by which it must be passed, but it will take a lot of time to hone the technique and pass the tests. A lot of games on Dendy were built on the same principle.<br />\nLet&#39;s consider in more detail the game by levels. The first level is training. In the second level, opponents are trying to hit the character with bullets. The next level is rocket, when missiles explode when hitting a player or just hitting each other. This is a fairly simple level, because the player just needs to dodge missiles. In the fourth level, you can be not only hit by bullets, but also pushed out of the field, which is also considered a loss. You need to be opponents in this level from the middle of the arena, after they have fired shots. Level with lasers is quite easy to pass. As in the third level, the player will need dexterity to dodge in time. In the seventh level, robots are passive, which shoot with just one shot, but there are quite a few of them. In the last level, a hardcore carnage begins. It involves all kinds of robots and strikes</p>", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2024-04-15T13:27:13", "background_image": "https://media.rawg.io/media/games/9ea/9ea81b07d58f7a2f099a2c773929d266.jpg", "website": "", "rating": 2.89, "rating_top": 3, "added_by_status": {"yet": 3, "owned": 52, "beaten": 1, "toplay": 1, "dropped": 8, "playing": 1}, "playtime": 4, "achievements_count": 23, "ratings_count": 9, "suggestions_count": 98, "game_series_count": 0, "reviews_count": 9, "platforms": ["PC"], "developers": ["Anatoliy Loginovskikh", "Wloop777"], "genres": ["Action", "Adventure", "Simulation", "Sports", "Indie"], "publishers": ["khukhrovr"], "esrb_rating": null}