{"id": 905500, "slug": "vermillionwalpurgis", "name": "Vermillion|Walpurgis", "name_original": "Vermillion|Walpurgis", "description": "<p>Made For the Winter Bullet Hell Game Jam.<br/></p>\n<p>Update 1.3<br/><br/>Fixed Sarah's Animations to play during correction direction (Literally a Typo if you would believe it)</p>\n<p>Lightning Spell Does Damage every Frame now.</p>\n<p>Lightning Spell Leveling up Glitch should be fixed for realizes now.</p>\n<p>Added new animations for Skull Bombs, they now burst while exploding.</p>\n<p>NEW ENEMEY! KLABOOY!</p>\n<p>2 More Levels added 1-9 and 1-A (because 10 doesn't fit too well)</p>\n<p>------------------------------------------------------------------------------------------------</p>\n<p>You are the Great Forest With Sarah Vermillion, You made you fortune Long ago after a great adventure! So you retired early... Unfortunately you sprite companion burned all your money on Gambling, boozes, and Pleasurable company. And since it's your Eye (Long story, won't be explained in this build) You have to get a bunch of Money Real fast, or suffer a fate worse then DEATH! Getting a REAL JOB!<br/></p>\n<p>Luckily Walpurgis is coming up! And there is a Tournament with a cash prize of a Dragon's Horde! Time to knock the rust off  and prepare for the games!</p>\n<p>(Ran out of time to do any story, or a lot of stuff, explained in Post Mortem, if this gets good feedback, I'll finish it proper)</p>\n<p>------------------------------------------------------------------------------------------------------</p>\n<p>Studio - WantedPosterStudios<br/></p>\n<p>Director/CharacterDesigner/Programmer/Animator - SilverElick<br/></p>\n<p>Music/UI Art - Skytric of WindGearGames</p>\n<p>--------------------------------------------------------------------------------------------------------<br/></p>\n<p>Post Mortem<br/></p>\n<p>Hey, this is Elick. So this was a Doozy of a Project. This was my first Project EVER I did all the programming for start to finish. Normally I'm an artist/Animator with the games but I decided to see what I've learned. Most if not all of the code was made by myself from just knowledge I've accrued over the past year over 2022 from many prototypes, and essentially teaching myself C#. I've dabbled in both programming and Unity in the past. But over the last year I decided that I wanted to pursue Game creation... as an Animator. Sadly my ability to keep Programmer friends is a bit lacking, and no one else on the team wanted to step up. So ever present of being a Jack of all trades at this point, I put on the gauntlet and said the line, \"Fine I'll do it myself.\"<br/><br/>And so when working on the main project, my friend Sitton hit me with this Challenge of a GameJam that was doing. I mean, I don't think he challenged me to do it, but in my brain it went \"Bet\" and the rest is history.<br/><br/></p>\n<p>I focused mostly on programming for this Jam. That's why the art is a bit light. Also I'm aware we had since December 15th to Today at 2:00Am to finish this. But I work a 9 to 5, and I'm an artist and animator first, programmer about... 7th? After this though I feel like it's a strong 3rd... despite the jank of this project.<br/></p>\n<p>Hope you like it, would love some feedback and ideas for potential enemy types. Might expand on this later... but right now, I'm tired. Hopefully nothing majorly gamebreaking is in the build. Let me know and I'll fix it post jam.<br/></p>\n\n<p>KNOWN BUGS!</p>\n<p>Sarah's Animations are not playing entirely right. I messed up on the variable check, but not sure how to fix it right now.</p>\n<p>Rank system is not been balanced yet</p>\n<p>2D Universal Render Pipeline was added for a mechanic that never worked out, could cause problems on some machines. </p>\n\n<p>Not in the game currently!</p>\n<p>Fire and Lightning Spells Animations</p>\n<p>Health and Exp Drop Arts</p>\n<p>Gui the Indicates what spell you have equipped (Defaults to fire)</p>\n<p>Unlock System (You start with all weapons and Levels unlocked)</p>", "metacritic": null, "released": "2023-01-02", "tba": false, "updated": "2023-01-06T12:32:27", "background_image": "https://media.rawg.io/media/screenshots/8cd/8cd9a237ed8c8deb238eaf71c5b241ae.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 150, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wanted Poster Studios"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}