{"id": 905573, "slug": "gui-xian-zhi-yi", "name": "诡仙志异", "name_original": "诡仙志异", "description": "Gui Xian Zhi Yi is a survival pigeon-like game with a strange self-cultivation style. You need to learn all kinds of exercises and sacrificing magic weapons to strengthen yourself in a hundred years, in order to survive the catastrophe and successfully break through to the next level. high realm.<br/>\n<br/>\r\nmain features:<br/>\r\nThe free combination of characters, spiritual roots and natal instruments, everything is possible!<br/>\n<br/>\r\nCharacters with different styles!<br/>\r\nInvincible in a short time, fast displacement... Each character has its own special skills, and you can choose a style more suitable for you by adding talents!<br/>\r\nOffensive and defensive anti-damage shield? Have! More stable and lasting defense capabilities? Have! More fault-tolerant resilience? Have!<br/>\r\nChoose your favorite talents to build your unique gameplay!<br/>\r\n(The current version has a total of two characters)<br/>\n<br/>\r\nAn indispensable spiritual root for cultivators!<br/>\r\nChisha, Life Breath, Quiet Spring, Burning Skeleton, Nether Dust... Different spiritual roots have different powers, burning, explosion, poison, recovery... According to the difference in your cultivation focus, even if it is the same spiritual root It can also play a different role!<br/>\r\n(The current version has two kinds of spiritual roots)<br/>\n<br/>\r\nEvolvable natal magic weapon!<br/>\r\nEach natal magic weapon has different characteristics, and with the continuous beheading of the enemy, the natal magic weapon will become stronger and stronger, ordinary weapon, magic weapon, magic weapon, acquired, innate! Powerful instruments will help you go further on the road of seeking the Way!<br/>\n<br/>\r\nThere are 30,000,000 things in Taoism!<br/>\r\nWithout the need for complex synthesis formulas, every exercise and every magic weapon can reach the realm of enlightenment under the right opportunity, and obtain an earth-shaking strengthening effect.", "metacritic": null, "released": "2023-01-05", "tba": false, "updated": "2023-01-09T03:04:07", "background_image": "https://media.rawg.io/media/screenshots/964/9645a4caf9ecbef6ed5933afc49f40ed.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 111, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["诡道"], "genres": ["RPG"], "publishers": ["诡道"], "esrb_rating": null}