{"id": 905560, "slug": "adventures-of-red-and-carmine", "name": "Adventures of Red and Carmine", "name_original": "Adventures of Red and Carmine", "description": "Red and Carmine are scientists working on teleportation technology. Suddenly there is an explosion and they are thrown into a whole different world!<br/>However they are separated, and do not know where the other is or if he/she is alive.<h3>JOURNEY THROUGH BEAUTIFUL WORLDS!</h3>Help Red and Carmine explore different beautiful worlds as they try to find their way back home. Play through ten different levels of eye-catching and tranquil handmade art. Battle with different monsters, free the fairies, collect coins and gems, and find power upgrades.<h3>PLAY AS TWO DIFFERENT CHARACTERS!</h3>Play as Red or Carmine as they go through different levels, making the game experience different and interesting.<br/><br/><strong>PLAY AS RED </strong><br/>Like a knight in shining armor, help Red fight with monsters and free the Protectors of the Forest. Collect and upgrade weapons, coins and gems, find your way to the next portal to go through the next world, one step closer to finding Carmine and your way back home.<br/><br/><strong>PLAY AS CARMINE </strong>(Coming Soon)<br/>Unlike Red, Carmine has special magical powers and needs no weapons. Use different magical spells to fight with different monsters as you free the prisoners on your way to the next portal and get one step closer to finding Red and your way back home.<h3>HANDMADE ART</h3>Enjoy beautiful hand-painted scenery as you progress through the game. With such lovely artwork, the game is fun to play, even with slow gameplay and minimal battle mechanics.<h3>BONUS LEVELS</h3> Coming Soon<br/>Find Bonus levels hidden at various locations and go through to play for loot, power upgrades or just fighting with more monsters, freeing the prisoners and finding more about the story.<h3>TALK TO THE PROTECTORS</h3> Coming Soon<br/>The fairies of the world have been imprisoned and it's your job to help them fight for their freedom! As their tokens of gratitude, they will tell you more about their world, gift you with unique gems, and tell you how to find your way further. Go through interesting dialogs, find the backstory, or just skip and get going on your way.", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T02:47:26", "background_image": "https://media.rawg.io/media/screenshots/e9c/e9c5c632476f818b336c86369942bac0.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 358, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Wajeeha Iftikhar"], "genres": ["Adventure", "Casual", "Indie"], "publishers": ["S&I Games"], "esrb_rating": null}