{"id": 905615, "slug": "kits-quest", "name": "Kit's Quest", "name_original": "Kit's Quest", "description": "<h3>Jump into your next great adventure in this challenging, fun-filled 3D platformer!</h3><br/><br/><strong>It’s a disaster!</strong> Kit’s sister Vixie has been kidnapped by Dregnor, Skyreach Mountain’s resident dragon. And it’s way too dangerous for anyone to go after them! …Right?<br/><br/>Well, Kit’s not the kind of fox to give up so easily. He’s determined to confront the menacing dragon, even if that means going on the quest of a lifetime!<br/><br/>What awaits Kit on his perilous journey?<h3>EXPLORE!</h3><br/>Immerse yourself in a <strong>huge, interconnected world!</strong> Your adventure might take you anywhere…<br/><br/><ul><li> An abandoned mine deep underground?<br/></li><li> Colourful treehouses high up in a forest canopy?<br/></li><li> The flooded shrine to a water serpent?<br/></li><li> An enchanted metalworks factory?<br/></li><li> You name it!</li></ul><br/><h3>COLLECT!</h3><br/>Scavenge everything you can get your paws on to help make headway on your quest!<br/><br/><ul><li> Dregnor has placed magical barriers throughout the land… Look for <strong>dragon teeth</strong> and use their magic to break through!<br/></li><li> Friendly birds might be willing to lend you a hand (or wing)… especially after you bribe them with some gathered <strong>berries</strong>!<br/></li><li> Queen Nelli has lost her <strong>Golden Mushrooms</strong>! Find them and Her Majesty may reward you handsomely!</li></ul><br/><h3>OVERCOME CHALLENGES!</h3><br/>Confront all sorts of novel challenges, whether you need to…<br/><br/><ul><li> Make creative use of Kit’s many <strong>cool abilities</strong>, from summoning ice block platforms out of thin air, to remotely detonating mushroom spore bombs!<br/></li><li> Use your foxy cunning to <strong>solve tricky puzzles</strong>!<br/></li><li> Put your <strong>platforming prowess</strong> to the test in a multitude of exciting environments!</li></ul><br/><h3>FIND FRIENDS!</h3><br/>Meet and befriend a marathoning parrot, a skittish bunny, a world-famous stork archaeologist, and many more allies who will help you on your way!  <br/><br/><h3>FIND… FOES?</h3><br/>As if Dregnor wasn’t bad enough by himself, his alliance with the deadly spiders who roam the land is sure to cause trouble. If you find yourself going up against a crystalline arachnid at least twenty times your size (and probably in a bad mood), just remember… Vixie’s counting on you!<br/><br/><h3>THE RIGHT CHALLENGE FOR EVERYONE!</h3><br/><ul><li> With several <strong>difficulty options</strong>, Kit’s Quest can be enjoyed by beginners and 3D platforming veterans alike!<br/></li><li> There’s also a dedicated <strong>Speedrunning mode</strong> for those who like to go fast.<br/></li><li> Finally, there might just be some extra hard-to-get secrets in store for true experts…</li></ul>", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-01-09T03:56:34", "background_image": "https://media.rawg.io/media/screenshots/284/284265c505dd1afa1c34673216922b4c.jpg", "website": "https://www.KitsQuest.com", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 333, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["Lone Fox Games"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Lone Fox Games"], "esrb_rating": null}