{"id": 905625, "slug": "stay-still", "name": "Stay Still", "name_original": "Stay Still", "description": "<h3>Short Description</h3>You won't survive in Stay Still (previously The Horrors: Lost Tape), a first-person psychological horror game developed by a team of small indie game developers. You play as<br/> Nam, explore the urban house and try to survive long enough to discover its terrible dark secret... if you dare.<br/><br/>The game is developed by two passionate indie game developers, one that has experience in the game development field, and another one that is just starting out, and with the help of the experienced developer, the other one could learn and improve in the field. This project is an experiment, but we personally believe it's a good one.<br/><br/><br/><h3>Synopsis:</h3>The story of the game revolves around Nam, he is looking for a cheap house to rent for a day, a friend introduced him to this house and because the price is so cheap, he decided to rent that house even Even though he was opposed by his family and he didn't know it was the same place where a murder took place in 2008.<br/><br/><br/>Stay Still is a genuine first-person psychological horror game experience, which intends to demonstrate the way that the most metropolitan legends could have a major effect over individuals.<br/><br/><br/><h3>Features:</h3>► True Psychological Horror Experience: You cannot fight it, if you want to survive the horrors of the cursed house, your only chance is to run or hide.<br/><br/>► High Quality Visuals: The AAA graphics will give the player a detailed and terrifying environment to get immersed.<br/>► Immersive Sound Design: Every little sound &amp; detail was properly blended together with the environment.<br/>► Real Horror: A sense of insanity may give the player the delusion that the surroundings are completly changed.", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-01-22T22:15:15", "background_image": "https://media.rawg.io/media/screenshots/cfa/cfa51c31410f3a2b397fa9d503da245a.jpg", "website": "http://galactic-crows.com", "rating": 0.0, "rating_top": 0, "added_by_status": {"beaten": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 362, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC"], "developers": ["Tarba Paul Cornel", "QuocMT"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Galactic Crows Media Limited."], "esrb_rating": null}