{"id": 905605, "slug": "garten-of-banban", "name": "Garten of Banban", "name_original": "Garten of Banban", "description": "Enter Banban's Kindergarten, and you're sure to make some friends. Explore the mysterious establishment and don't lose your life and sanity. Uncover the horrifying truth behind the place, but be careful, as you are far from alone…<h3>The Banban And Friends Gang:</h3>Banban’s Kindergarten has earned a special place in every kid’s heart. The reason for this is the Banban And Friends Gang, which are the establishment’s mascots and icons. At Banban’s Kindergarten, nobody’s lonely thanks to them!<br/><br/><br/><br/><h3>Banban’s Kindergarten, the dream place of every child:</h3>Banban’s Kindergarten was once the go-to kindergarten for any parent who needed their children to attend a reputable learning facility. This was the case until everybody within the place suddenly vanished on a seemingly normal day, and now you must explore the establishment and find out what happened. <br/><br/><br/><br/><h3>Explore with your flying companion:</h3>Everything's better when you have a friend to share with. Use your handy drone to help you navigate and proceed through the facility, as well as have it keep you company when you are feeling lonely and scared, which you will be feeling a lot. <br/><br/><br/><br/><br/><br/>", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-11-06T19:33:27", "background_image": "https://media.rawg.io/media/screenshots/415/41552b503c720a29f4f969b715eb6ad2.jpg", "website": "https://www.euphoricbrothers.com/contact-us", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 49, "beaten": 6, "dropped": 1}, "playtime": 1, "achievements_count": 0, "ratings_count": 3, "suggestions_count": 134, "game_series_count": 0, "reviews_count": 4, "platforms": ["PC"], "developers": ["Euphoric Brothers"], "genres": ["Action", "Adventure", "Casual", "Indie"], "publishers": ["Euphoric Brothers"], "esrb_rating": null}