{"id": 90565, "slug": "uncommon-breed-a-furry-rpg-dating-sim", "name": "Uncommon Breed (A Furry RPG / Dating sim)", "name_original": "Uncommon Breed (A Furry RPG / Dating sim)", "description": "<p>Warning this game contain: Fantasy Violence , Sexual Content<br />\nWhat&#39;s Uncommon Breed?<br />\nUncommon Breed is a furry RPG / Dating Game where your relationships determine the strength of your companions.<br />\nHow Do Releases Work?<br />\n- The current release is available for patrons/supporters.<br />\n- The previous release is free for all.<br />\n- Patrons receive content updates before anyone else!<br />\nSupport On Patreon<br />\nhttps://www.patreon.com/UncommonBreedVn<br />\nPatron download link:<br />\nhttps://uncommonbreedvn.itch.io/uncommon-breed/patreon-accessible<br />\n(Grizz, the Protector and Shield of your team)<br />\nStory<br />\nHold on to your highly, unstable bombs folks, the village is in danger! It&#39;s time to strap on your over-sized shield because a war is coming and it seems you&#39;re the only one who cares that it&#39;s gonna wipe your village off the map. A couple of beefcake drifters offer to help but you&#39;re pretty sure that crazy wolf is gonna blow everyone up! And whooo is that fluffy tailed succubus with the healing magic? Find out next time on Uncommon Breed!<br />\n(Warning: the game does not take it self too seriously)<br />\n(Juleon, Mender of Hearts)<br />\nSummary<br />\nThe basic idea of Uncommon Breed is a visual novel with the added twist of combat mechanics that are affected by your relationships with the multiple love interests.<br />\nExamples:<br />\nGear (a highly dangerous wolf engineer) becomes so infatuated with you that he offers a highly unstable weapon for you to use in the next fight (he&#39;s pretty sure it won&#39;t blow up on use).Grizz (the kindhearted bear) thinks you are worth protecting and decides he can prevent the team from taking damage for just one more attack. Could he have blocked for the team without liking you? Maybe, but this makes the game more fun.<br />\n(Gear, the Unpredictable Explosive Engineer)<br />\nFeatures<br />\nRelationship systemObnoxious heart animations to support #1Combat system X2Combat animations to support #3Four love interests (More in the works.)Fan service to support #5DramaHumorSexual tensionI ran out of features but I like even numbers :]<br />\n(Reinhard, the ... ?)<br />\nWhy support?<br />\nI&#39;m a one man team who enjoys coding and making a game for the furry fandom. I do this in my spare time and any support is a huge motivator.<br />\nEventually, I&#39;d love to be able to work on Uncommon Breed and other games for the fandom full time. So yeah, your supporting the creation of Uncommon Breed and a dev who wants to make furry games you&#39;ll love.<br />\n(New Combat System (Introduced further into story))<br />\nTo those who already support<br />\nThank you from the bottom of my heart. You have no idea how much you&#39;ve changed my life / life perspective. I try to pay it forward as much as possible and encourage others to chose their dream / passion no matter how unrealistic it may seem. &lt;3 you all.<br />\n(Original Combat System)<br />\nI post stuff about the game on Twitter<br />\nhttps://twitter.com/UncommonBreedVN</p>", "metacritic": null, "released": "2018-01-31", "tba": false, "updated": "2021-11-12T15:48:24", "background_image": "https://media.rawg.io/media/screenshots/371/371343328fe900c52a1deacf83f871bd.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 3, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 473, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Android"], "developers": ["UncommonBreedVN"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}