{"id": 905754, "slug": "ufo-shooter-owlandwolf", "name": "UFO shooter (owlandwolf)", "name_original": "UFO shooter (owlandwolf)", "description": "<p>UFO shooter- can you guess what it's about?</p>\n<p>Go shoot some UFOs, although they may be identified flying objects, so maybe IFO? anyway, shoot the FOs(I guess that's what I'm calling them), beat giant UFO bosses(for the sake of simplicity, I've switched back), play in the normal mode, rush mode with extra enemies, no bosses, and swarms of tiny enemies, or you can challenge yourself to the limit with the near-impossible nightmare mode, where bosses spawn every 2 seconds, enemies cover the screen almost fully at all times, and visibility is low. Then again, maybe stick to a slightly less-challenging boss mode. Bosses spawn instead of enemies at an alarming rate in this mode, and elite bosses also spawn. Play as the basic green ship, the flamethrower orange ship, the laser blue ship, the fast-firing cyan ship, the firework purple ship, or the supernova yellow ship/black hole black ship. Here is the original project link: https://scratch.mit.edu/projects/591285383/ and here is the original description: </p>\n<p>TEXTWALL</p>\n<p>wasd or arrow keys to move, click and hold to fire, also enemies will dash at you so avoid them, bosses will shoot bullets that will kill you. boss kill = rush mode unlock, 100 difficulty or more in rush mode = nightmare mode unlock. there is no upgrade system yet, so number keys to swap ships.</p>\n<p>CHAGELOG</p>\n<p>2022-07-12: added boss mode, added difficulty bar, added ship select, various changes</p>\n<p>2022-07-09: added mobile support, swarm enemy</p>\n<p>2022-07-06: release</p>\n<p>and the original second section(some parts cut off): alien fighting thingy. this is leading up to my next space game, space shooter. oh whoops, that's spoilers. anyway...</p>\n<p>So yeah</p>\n<p>Have fun, and I'll see you there!(I can actually see you at this very moment. Don't turn around.)</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T05:20:51", "background_image": null, "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 0, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["owlandwolf"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}