{"id": 905729, "slug": "furry-finder-demo", "name": "Furry Finder Demo", "name_original": "Furry Finder Demo", "description": "<p><em><strong>Furry Finder </strong>is a visual novel game about finding the love of your life. After turbulent moments in <em>your life</em>, you will have to stand up to your shyness.\r\n<br/><br/>Add to the wishlist on Steam to support our hard work!<br/></em></p>\n\n<p>The main goal of the game is to use a dating app called <strong><em>\"Furry Finder\"</em></strong> and give <strong>Alexis</strong> (the main protagonist) a chance to find <strong>true love</strong>. Despite breaking up,<strong> Sophie</strong> (<strong>Alexis's</strong> longtime girlfriend and now good friend) is always with us to give us many useful tips such as <strong>flirting advice</strong>. You have to remember that everything you do will affect your future. If you don't like someone, it doesn't mean you have to spend time with this person. Remember,<strong> it's your life!</strong> Since the love meter does not function as much as it does in other games, you must choose your choices <strong>carefully.</strong> The game will end in a<strong> variety of ways:</strong> you could become a master of flirting and find true love, or you could end up being alone. <em><strong>Let's get started! </strong></em>Everything is in your hands! <br/></p>\n<p>The demo version contains about 30 minutes of gameplay, in the demo version there will be no interactive phone and too many dating opportunities. We encourage you to check out the full version.<br/></p>\n<p>⭐ Interactive phone with a dating app, and funny pictures. (Not in the Demo)<br/></p>\n<p>⭐ You decide with whom you connect your future. (Not in the Demo)<br/></p>\n<p>⭐ Your decisions have an impact on the behavior of the characters and the ending of the novel.<br/></p>\n<p>⭐ Artwork that has been beautifully painted.</p>\n<p>⭐ multiple endings. (Not in the demo)<br/></p>\n<p>⭐ Great soundtrack.</p>\n\n<p><em>Check out<strong> Full version</strong> and <strong>Add to wishlist</strong> to support our hard work! :) Love you! xoxoxo <br/></em></p>", "metacritic": null, "released": "2023-01-09", "tba": false, "updated": "2023-01-09T05:11:31", "background_image": "https://media.rawg.io/media/screenshots/0da/0da6a1f21e397b751be00d056553e236.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 370, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["SourceByte"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}