{"id": 90582, "slug": "taarradhin", "name": "Taarradhin", "name_original": "Taarradhin", "description": "STORY\r\n<p>A seven-year drought plagues the entire region surrounding the country of Nishtif, leading people to wonder if their goddess Scheknt has abandoned them. In contrast, young noblewoman Neqtia has lived a comfortable life insulated from hardship and suffering. One of the poorer surrounding countries, Djedi, sends their usual tribute of natural resources and livestock to Nishtif in exchange for the larger country's aid and protection. Rumors that two attractive slaves are among the cargo intrigue Neqtia. What lies in store for her after the slaves are brought to live at her family estate...?</p>\r\nCHARACTERS\r\n<p><strong>Neqtia:</strong> Daughter of a wealthy noble, she is kind-hearted and sweet, but also naive about anything outside of her personal world. She can come across as self-centered due to her sheltered upbringing, but she is well-meaning.</p>\n<p><strong>Jyrik:</strong> One of the two slaves from Djedi, he was chosen from among the commoners because of his youth and handsome looks. Smooth, confident, and knowledgeable, Jyrik works in the garden of Neqtia's estate, but as he and Araerda are meant to be trophies, he's more like an exotic plant himself.</p>\n<p><strong>Araerda:</strong> The other slave brought from Djedi, she is considered one of the most beautiful women of her country. Araerda works as one of Neqtia's handmaids and is a kind, patient listener who takes to Neqtia instantly and showers her with compliments and attention.</p>\r\nEND NOTES\r\n<p>Taarradhin is a visual novel done by Cyanide Tea for NaNoRenO 2014. As usual, all writing/programming was done by Lorelei while all of the art and UI design was done by Auro-Cyanide. Auro also came up with the story and characters this time around. The music is all stock music by Pierrot Lunaire. Special thanks to Kitty for beta testing!</p>\n<p>Please also consider updating your graphic card drivers before playing Taarradhin. If you're having display problems, please check out this help page in the Ren'Py documentation.</p>\n<p>If you play the game, please use the #taarradhin Twitter hashtag or Taarradhin Tumblr tag if you can!</p>\n<p>Taarradhin won best EVN of the year in the 2014 VNs Now Best Ofs.</p>", "metacritic": null, "released": "2015-01-26", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/a7e/a7e6983c3385840957b6c66ae9369b3a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 103, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Cyanide Tea"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}