{"id": 90580, "slug": "where-ages-go", "name": "Where Ages Go", "name_original": "Where Ages Go", "description": "<p>\r\n\tA short and sweet Australian visual novel, with a silent protagonist and three cute boys you can spend a few days getting to know. Though there are few choices to be made, your personality and appearance will influence events in the game, and there's a surprise ending that should add a fun twist to the otome game formula. There's a hint in the title!\r\n</p>\n<p>\n<strong>GENRE:</strong> Visual Novel, Otome Game, Modern Day, Fluff, Romance(?), Surprise Ending<br/>\n<strong>AGE:</strong> G-PG\r\n</p>\r\nCharacters\r\n\r\n\r\nPC\r\n<p>An off-screen, unnamed silent protagonist of customisable gender (he/she/they, no in-game effect except pronoun usage). Two traits picked at the beginning of the game, Looks (tough/pretty/cute) and Nature (energetic/loving/clever) help determine the events of each playthrough.</p>\n\r\n\"Kirby\"\r\n<p>A cute, upbeat but shy boy in his last year of high school. He writes digital music he shares online, and would like composing and/or producing music to be his career. Though friendly, he has a lot of fears, and struggles hard with social anxiety. A chronically white kid.</p>\n\r\n\"Micah\"\r\n<p>A responsible, mature young man studying medicine at university and working part-time at his uncle's pharmacy. His family, who emigrated before he was born, are very close-knit and have (perhaps unreasonably) high expectations of him. Being deliberately serious and well-behaved, he has some trouble being emotionally honest.</p>\n\r\n\"Ash\"\r\n<p>Standoffish, aloof, and constantly using an apathetic attitude to cover his emotional insecurity. Melancholy and private, Ash has some survivor's guilt over the accidental death of the last friend he got close to, and tends to keep others at arms' length. He seems to be involved with some dangerous people.</p>\r\nOther\r\n<p>This game was created in Ren'Py and uses many Creative Commons resources - please check the credits included for details!<br/>\n</p>", "metacritic": null, "released": "2015-04-01", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/55c/55c8a73331a00b31938bf8ab9cd4b616.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 207, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Fox Lee"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}