{"id": 905803, "slug": "psi-and-delta", "name": "Psi and Delta", "name_original": "Psi and Delta", "description": "<p>Play the game online at (Unity WebGL): </p>\n<p>https://learnqm.gatech.edu/WebGLMay2018/index.html</p>\n<p>Learn more about the game at my website:</p><p>http://adityaanupam.com/quantum.html<br/></p><p>“Psi and Delta” is a digital local multiplayer game (also available in Single Player) designed to support high school and undergraduate students in learning introductory quantum physics. </p>\n<p>Made in collaboration with electrical engineers, media scholars, and HCI students and faculty at Georgia Tech, the game is designed to help students explore and experiment with virtual worlds following the laws of quantum physics. It aims to promote learning by requiring players to cooperate, understand, and employ concepts of quantum mechanics together to resolve in-game challenges.<br/></p>\n<p>Quantum Mechanics (QM) is the foundation for science and engineering disciplines as diverse as semiconductor physics, chemistry, and material science. However, educators face major challenges in teaching QM given the abstract, non-experiential and counter-intuitive nature of its concepts. Further, introductory quantum mechanics courses and texts predominantly focus on the mathematical formulations of the subject and lay less emphasis on its conceptual understanding. Consequently, students struggle to develop robust conceptual mental models of QM concepts. Digital games can facilitate a conceptual understanding of QM by immersing players in virtual worlds governed by the rules of QM, allowing them to explore and experiment with its concepts in a way that would not be possible in the class.</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T05:39:55", "background_image": "https://media.rawg.io/media/screenshots/190/19023a1d93ad4460966051e3d1f4c6fe.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["macOS", "PC"], "developers": ["aanupam3"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}