{"id": 905889, "slug": "natura-humana", "name": "Natura Humana", "name_original": "Natura Humana", "description": "Natura Humana\r\n<p>(You can find the download below, Note that the game is in open beta at this moment)</p>\n<p>Ever since the colonial era and the industrial revolution, there has been a conflict between humans and nature, resulting in an instinct to conquer the green world (Watson, J. 2019). This enslaved nature has since become established in our urban environments and has been given a function of entertainment for humankind called Natura Humana. It is nature of our daily (human) life, our houses, lands, gardens, beaches, supermarkets, but can also be found in our agricultural industries that only serve and have been developed for the sake of humans.</p>\n<p>Humankind does not like it when real nature, the one untouched by the hands of man, interferes with our own (De Telegraaf, 2022). We feel the desire to be in control so that the wild nature does not behave unexpectedly. Nature is not allowed to grow over our streets. It must not cross the boundaries of a field and is not allowed to bear its fruits in our gardens.</p>\n<p>Our natura humana grows along with us and adapts by listening to our demands. Our cities are getting bigger, beaches busier and more and more parks are being built for our visit to 'nature'. As one grows, the other shrinks. And the other, in this case, is the wild nature that has to make way for the natura humana (Tuner W, Nakamura T &amp; Dinetti M 2004). The natura humana grows in its own way, in straight lines following its predetermined path with only small allowances for greenery to ever so slightly flourish.</p>\n<p>The story that Natura Humana tells has been made experienceable through a game. It is about spatial planning in the city of the future. Where a data-driven city, like the failed Sidewalk Labs in Toronto (Flynn, 2019), Canada, has evolved over the upcoming decades and autonomously regulates the city. In that case, the planning of this city is in the hands of artificial intelligence. In this scenario, the city is experienced from the perspective of a character working for the city’s A.I. As the story progresses, the main character collects insights for the city, revealing different perspectives of the inhabitants and how they themselves would like to change the city to their own liking.</p>\n<p>The A.I. which covers the city Natura Humana, acts on the wishes of the city. It plans according to the assumptions it encounters. Its base task is keeping the city running as efficiently and economically as possible in the limited space available. It has to keep the city going financially stable and has found a way to achieve that. The city uses bright colors and neon lights to attract new residents to the streets and lures its existing residents away from the parks shadowed by the already enormous skyscrapers at dusk with the purpose to make room for a new building. The buildings in the city move to give the idea that the city is in some way its own being, with lights forming patterns across the facades like generated data streams that make this city feel alive based on the artwork Foreign Nature (Hortsluis &amp; Boysen, 2022. The sense that the city moves around you, knows where you are going to and where you have been, was inspired by Christopher Nolan’s Inception where the world feels visually alive.</p>\n<p>As the city grows in size, more and more parks will gradually shrink and even disappear to make way for new and larger apartment buildings that will grow beyond their intended size overtime. To counter this, the main character meets different people. One wants to reverse the growth of the city, thereby preserving the parks. The other wants to control the growth of the city in order to gain economic benefits from it. The main character is faced with various choices that perhaps will influence the outcome of the story, regardless, the character experiences these changes.</p>\n<p>How would you plan this city? Do you choose to save the parks, or do you provide yourself with a luxurious home when given the chance? And how will the city itself respond? <br/><strong>Find it out in Natura Humana.</strong></p>\n\r\nSources\r\n<ul><li>Chapman C, Huffman M (2018). Why do we want to think humans are different? Wellbeing International. (visited 18-11-2022) https://www.wellbeingintlstudiesrepository.org/cgi/view-content.cgi?article=1358...</li><li>Watson, J., studio, W―E, &amp; (F), T. (2019). Julia Watson. Lo―TEK. Design by Radical Indigenism. TASCHEN.</li><li>De Telegraaf. (2022, January 14). Kwart Nederlanders vindt dat wolf hier niet thuishoort. Telegraaf. (visited 18-11-2022) https://www.telegraaf.nl/nieuws/1239553512/kwart-nederlan-ders-vindt-dat-wolf-hi... </li><li>Tuner W, Nakamura T, Dinetti M (2004). Global Urbanization and the Separation of Humans from Nature. BioScience. (visited 18-11-2022) https://academic.oup.com/bioscience/article/54/6/585/294707</li><li>Flynn, A. (2019). Where The Sidewalk Ends: The Governance Of Waterfront Toronto’s Sidewalk Labs Deal – Windsor Yearbook of Access to Justice / Recueil annuel de Windsor d’accès à la justice -Érudit. https://www.erudit.org/en/journals/wyaj/2019-v36-wyaj05072/1072264ar/</li><li>Shotsko, A. (n.d.). Glow night skyline. Dribbble. https://dribbble.com/shots/4397569-Glow-night-skyline?utm_source=Pinterest_Shot&amp;...</li><li>Hortsluis, J., &amp; Boysen, B. L. (2022). Foreign Nature [Projection of Computer Generated Fractals]. NXT Museum, Amsterdam,  Netherlands.</li><li>The Art Of Living. (2022, March). Michiel Schrijver. Retrieved December 31, 2022, from https://www.michielschrijver.nl/publicaties/the-art-of-living-maart-2022/ </li><li>Kettelhut, E. (1927). Tricktableau des nächtlichen Metropolis mit dem Neuen Turm Babel, unsigniert Ölmarelei, lackiert auf Pappe, 43,5x55,5 cm. Archiv Deutsche Kinemathek, Berlin, Germany.</li></ul>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T06:18:07", "background_image": "https://media.rawg.io/media/screenshots/756/7564a4d83afe669cd5345b88102ee1a3.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 21, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["MrZorca"], "genres": [], "publishers": [], "esrb_rating": null}