{"id": 905895, "slug": "fox-escape-the-deserted-town", "name": "Fox Escape: The Deserted Town", "name_original": "Fox Escape: The Deserted Town", "description": "FOX ESCAPE\r\n<p><em><strong>Objective</strong></em></p>\n<p>Your objective is to find the hidden key in the deserted town. Beware of the enemies that are hiding and waiting for you in the buildings. Once you find the key, you will face the final boss in a battle to death.</p><p>W,A,S,D to move</p><p>E to open doors</p><p>Left_Mouse click to shoot</p>\r\nSynopsis\r\nAs the sun beats down on the endless expanse of sand, a fox trudges through the desert. Sweat beads on his forehead and his clothes are torn and dirty. Flashbacks of the ambush that left him stranded here play through his mind.<br/><br/>He remembers the chaos, the screams, the gunfire. He sees the faces of his family, his comrades, as they were taken from him in the attack. The pain of loss threatens to consume him, but he pushes it down. He can't afford to dwell on the past. He has to focus on the present, on surviving.<br/><br/>He scans the horizon, searching for any sign of the extraction point. He knows it's out there somewhere, his only chance of getting out of this hellhole alive. He clutches his rifle tighter and quickens his pace. He knows he's not alone out here. The enemy is still out there, hunting him.<br/><br/>The fox takes a deep breath and steel himself for the long journey ahead. He won't let the enemy win. He won't go down without a fight. He pushes forward, determined to make it to the extraction point and uncover the truth behind the ambush that took everything from him. He will not rest until justice is served.", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T06:20:35", "background_image": "https://media.rawg.io/media/screenshots/2d7/2d703f9f2c5631de0def99d1efb5478a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 57, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["Marc1232"], "genres": ["Action", "Adventure"], "publishers": [], "esrb_rating": null}