{"id": 905819, "slug": "soothing-creek", "name": "Soothing Creek", "name_original": "Soothing Creek", "description": "<p>SOOTHING CREEK</p>\n<p>A terrible accident struck the quiet little town of Soothing Creek. Overnight, the town was engulfed by the waves, and all its inhabitants were swept into the abyss with it. Several people risked venturing into the town to explore the ruins, but none of the unfortunate explorers returned.<br/></p>\n<p>But all these threats do not repel your curiosity. You decide to go there by yourself, armed only with your camera and your determination, to photograph what remains of this deserted city.\r\n</p>\n<p>However, beware, because by venturing out, you run the risk of discovering things that should never have been revealed...\r\n</p>\n<p>Programming: William, Bao, Yann</p>\n<p>3D modeling: Yann</p>\n<p>Sound and Music: Jérémie Lapointe</p>\n<p>-------------------------------------------------------------------------------------------------\r\n</p>\n<p>Un terrible accident a frappé la tranquille la petite ville tranquille de Soothing Creek. Du jour au lendemain, la ville fut engloutie par les flots, et tous ses habitants furent emportés dans l’abysse avec elle. Plusieurs personnes ont risqué de s’aventurer dans la ville afin d’en explorer les ruines, mais aucun des malheureux explorateurs n’est en revenu.\r\n</p>\n<p>Mais toute cette menace ne repousse en rien votre curiosité. Vous décidez donc de vous rendre sur place par vous-même, armé seulement de votre caméra et votre détermination, afin de photographier ce qui reste de cette ville déserte.\r\n</p>\n<p> Cependant, prenez garde, car en vous aventurant ainsi, vous prenez le risque de découvrir des choses qui n’auraient jamais dû être révélées…\r\n</p>\n<p>Programmation: William, Bao, Yann\r\n</p>\n<p>Modèles 3D: Yann\r\n</p>\n<p>Son et Musique: Jérémie Lapointe</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T05:48:33", "background_image": "https://media.rawg.io/media/screenshots/b4f/b4f63b30c8bae0ec27d3db7278635745.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 72, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["WilliamLebel", "JeremieLapointe", "Old Dry Witch", "baotranC"], "genres": ["Adventure"], "publishers": [], "esrb_rating": null}