{"id": 905910, "slug": "menu-a-point", "name": "Menu À Point", "name_original": "Menu À Point", "description": "<ul><li><strong>Moteur : </strong>Unity 3D</li><li><strong>Equipe :</strong> 6 personnes maximum</li><li><strong>Rôles :</strong> Développeur, Intégrateur, Tests</li></ul>\r\nContexte\r\n<p>Ce jeu a été réalisé en équipe sous Unity, à la demande de Véronique Paolacci, MCF en Sciences du langage.</p>\r\nRésumé\r\n<p>Ici, le but du joueur est d'aider Tokki, une petite lapine, à devenir la grande cheffe cuisinière qu'elle rêve d'être. Il va devoir l'aider à améliorer ses compétences et sa cuisine, par le biais de la ponctuation, en vivant ses aventures.</p>\r\nGameplay\r\n<p>Le joueur sera confronté à deux types de niveaux au fil de cette aventure. D'une part, des exercices de ponctuation de textes. D'autre part, des phrases dont il faut en changer le sens en modifiant la ponctuation. De jolies animations accompagnent notre aventurière.</p>\r\nÉditeur de niveau\r\n<p>Un éditeur de niveau a été intégré au sein du jeu Menu à Point. Cela permet notamment à l'enseignant de pouvoir y insérer ses propres textes, mais également aux élèves de penser des textes à ponctuer pour leurs camarades. Ces niveaux sont disponibles depuis l'espace \"bonus\".</p>\r\nSuivi de l'élève\r\n<p>L'un des intérêts de ce Serious Game se situe dans le suivi de l'élève. Le jeu génère un fichier Json, en fin de partie, qui compilera le temps passé, les erreurs, le nombre de tentatives, etc, de l'élève. Ce sont de nombreux éléments que l'enseignant pourra récupérer afin d'offrir à son élève un suivi personnalisé et disposer d'une évaluation de son niveau. Cela se fait grâce à un logiciel, complémentaire du jeu, dédié à la lecture de ces fichiers.</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T06:26:38", "background_image": "https://media.rawg.io/media/screenshots/ffb/ffb16f47472e7ad197f30429182a1b72.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 69, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "macOS", "PC"], "developers": ["Benjamin Zanini"], "genres": ["Educational"], "publishers": [], "esrb_rating": null}