{"id": 90604, "slug": "epicinium-beta", "name": "Epicinium (Beta)", "name_original": "Epicinium (Beta)", "description": "<p>Epicinium is a multiplayer strategy game where the players' impact on the environment matters. Combat destroys grass and crops, and trees are trampled as tanks drive towards your opponent to level their cities. Industry accelerates global warming to ludicrous levels, causing more destruction the longer the game goes on. At the end of the game, the winner is scored for how many grass and forest tiles still remain on the map.</p>\n<p>Epicinium is being developed by Daan Mulder and Sander in 't Veld and is available for Windows, Mac and Linux. The game is currently in open beta.</p>\r\nWeekly playtests\r\n<p>Every Saturday from 19:00 UTC and lasting a couple hours, we hold an online playtest session. Download the client and join in for some fun and games! We also livestream these events on Sander's Twitch channel.<br/></p>\r\nDiscord\r\n<p>If you want to have a chat with the developers or find an opponent to play against, join the Discord server!</p>\r\nMailing list\r\n<p>If you want to stay up-to-date with the latest developments and events regarding Epicinium, you can sign up to our public mailing list.</p>\r\nHow to play\r\n<p>Epicinium is a multiplayer strategy game with simultaneous turns. Each turn consists of a planning phase, where all players decide which orders they want to give their units that turn, followed by an action phase, where players watch as the the orders play out. </p>\n<p>Units will automatically attack enemy units they encounter; they will also fire back when attacked and attack any unit that moves away from them. Some units have abilities that allow them to bombard tiles, randomly dealing damage to whomever and whatever is present at that time. Anticipating your opponent's orders is key.</p>\n<p>Between rounds, the season changes which might bring about new weather effects such as snow, drought or firestorm. At night, buildings can gain power and generate income. Cities only gain power if surrounded by enough grass, forest, water and crops, whereas barracks and industry grow larger when additional cities are placed nearby.</p>\n<p>To defeat your opponent, capture or destroy all of their City tiles.<br/></p>", "metacritic": null, "released": "2018-01-25", "tba": false, "updated": "2019-08-28T23:26:13", "background_image": "https://media.rawg.io/media/screenshots/74e/74e5781a0e22a25e71a96c0f31c82e9f.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 77, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["UnarmedLad", "SLiV"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}