{"id": 906099, "slug": "the-heat-dzejpi", "name": "The Heat (dzejpi)", "name_original": "The Heat (dzejpi)", "description": "Great rumors are spreading far and wide. It seems that the earth is becoming parched and dry.Could our final days be nigh?\r\n<p>Great rumors are spreading far and wide. It seems that the earth is becoming parched and dry. Some speak of the sun's heat intensifying to the point where it is setting all ablaze. There are hushed whispers of Tzitzimitl's return spreading throughout the land. Could our final days be nigh?</p>\r\nHow to play\r\n<p>You can switch between items either by using middle mouse button or by pressing `1`, `2`, `3` or `4` on your keyboard.</p>\n<ul><li>1: Nothing</li></ul>\n<ul><li>2: Sickle. You need to equip sickle in order to be able to harvest crops. Once equipped, go to the nearest crop field and click on it. If you do, you will harvest it. You need to bring your harvest into the harvest bin next to your house. Once carrying crop, you cannot switch between items. Hurry up! Also remember that cannot harvest burning crop.</li></ul>\n<ul><li>3: Bucket. You can use bucket to put out the fire. Do not forget to fill it with water first. Equip the bucket, look at the water well and fill the bucket by left click.</li></ul>\n<ul><li>4: Spade. You can use spade to destroy any crop. If the crop is on fire, destroying it with spade will put the fire out as well. Use to your advantage!</li></ul>\n<p>Try to save as many crops as you can. The end is near.</p>\n<p>### Controls</p>\n<ul><li>WSAD: Move like in all 3D first person games.</li></ul>\n<ul><li>Left click: Interaction with items.</li></ul>\n<ul><li>Middle mouse button scroll: Circle between items if you do not like using numbers.</li></ul>\n<ul><li>1-4: Switching between items.</li></ul>\n<ul><li> Escape: Toggle pause menu. Focus on HTML5 on Itchio is not perfect, so if you're playing HTML5 version, press `Esc` twice and click on the `Continue` button with your mouse to focus it back properly.</li></ul>\n<ul><li>You can turn the sound and music off in pause menu as well, if you want to.</li></ul>\n<ul><li> Shift (hold): Sprint.</li></ul>\n<ul><li> Space: Jump.</li></ul>\n<p>## Tools used</p>\n<ul><li>Game engine: Godot v3.5.1.stable.official [6fed1ffa3]</li><li>Aseprite v1.2.40-x64</li><li>Blender 3.4.1</li><li>Ableton Live 11 Lite</li><li>Audacity 3.2.1</li></ul>\r\nLinks\r\n<ul><li>https://dzejpi.itch.io/the-heat - Download or play in your browser on itch.io</li></ul>\n<ul><li>https://github.com/dzejpi/the-heat - Check the source code here.</li></ul>\n<ul><li>https://ldjam.com/events/ludum-dare/52/the-heat - Ludum Dare page.</li></ul>\r\nMy commentary\r\n<p>This was my first 3D LD game! I was playing around with 3D for quite some time, but this LD was time to put my knowledge to test. All of my lucky stars had to be aligned properly, because I actually haven't run into any major issues. I learned so many things; more than last few months combined. This was the most fun LD I have had so far.</p>\r\nCuriosities\r\n<p>I think you could get a laugh by how I made some of the sounds, all of them were recorded on my phone (iPhone SE 2020):</p>\n<ul><li>Button confirm sound - me tapping key on my keyboard</li><li>Water throw - me throwing a cup of water into the kitchen sink</li><li>Crop destruction - rummaging through the hay left over by my bunny on the floor</li><li>Crop harvest - taking the hay off the ground</li><li>Crop drop - taking the hay and dropping it on the floor next to the phone</li><li>Fire - actual fire, but from the candle, and super heavily amplified</li><li>Item change - taking wallet out of my jeans</li><li>Walk - actual walk</li></ul>\n<p>Of course, all sounds heavily edited in Audacity. :)</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T07:35:28", "background_image": "https://media.rawg.io/media/screenshots/076/076223e47c097b6a005566fa78bb5eab.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 80, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Linux", "PC"], "developers": ["dzejpi"], "genres": [], "publishers": [], "esrb_rating": null}