{"id": 906025, "slug": "squirrelativity", "name": "Squirrelativity", "name_original": "Squirrelativity", "description": "<p>Two rival groups of squirrels are stocking up for the winter. Each group can only eat a certain type of fruit, but the tree that produces the kind of fruit they like is in their rivals' territory! What is to be done?</p>\n<p>The two rival groups of squirrels will need to work together to be sure that they can survive the winter. But, of course, they'll demand everything be split up evenly so as not to give their rivals an advantage...</p>\n<p>A relaxing sort-of-mostly-deductive grid-filling-in-type puzzle game with a fun animal twist.</p>\n<p>Made in 48 hours for Ludum Dare 52 (Theme: \"Harvest\").</p>\r\nHow to play\r\n<ul>\n<li>Use the mouse to drag paths that the tree branches will follow. Trees can only branch away from their starting point (i.e. branches from the top tree must always point down and branches from the bottom tree must always point up.) There are walls in the grid which prevent tree branches from moving through a space.</li>\n<li>If you move a tree over a green \"seed\" point, it will produce a fruit, which hangs straight up or down towards the tree's starting point.</li>\n<li>You can then use tree branches to create a path for the squirrels to retrieve the fruit. Squirrels will move along the branches of their tree, but will only grab a fruit that matches their color (which comes from the opposite tree.)</li>\n<li>(Note: You can continue to draw branches while the squirrels are running around. They're smart, they can figure it out.)</li>\n<li>In order to complete the level, you need to create fruits from all the seed points, have the squirrels collect all the fruits, and ensure that each squirrel team has an equal number of fruits in their possession.</li>\n<li>There are 15 levels in total.</li>\n<li>You can use the buttons in the lower left to undo the last branch you added, or to restart the level. You can also use Z and R on your keyboard for undo/restart, as well as M to mute the sound.</li>\n<li>Your progress is saved automatically, but you can delete it by pressing X and then pressing W and then refreshing the page.</li>\n</ul>\r\nTools used\r\n<ul>\n<li>Coding: zucchinibread.js, which is a thing I made up</li>\n<li>Audio: Audacity + guitar / kalimba / sink / fingers on wood / mouth sounds</li>\n<li>Graphics: Aseprite</li>\n</ul>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T07:08:47", "background_image": "https://media.rawg.io/media/screenshots/cdd/cdd89bd97f38f51ced70c2f711173d75.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["cassowary"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}