{"id": 90616, "slug": "rexuiz-fps", "name": "Rexuiz FPS", "name_original": "Rexuiz FPS", "description": "<p>\r\n\t It should be noted that Rexiuz is modernization of a beloved online shooter Nexuiz Classic. Its history began about ten years ago - developers of AlienTrap published a simple, but very exciting free online 3d shooter that immediately attracted the attention with its dynamic intense fast paced gameplay and nice graphics. At the moment, the project is gaining momentum and we want to present it to you.\r\n\t<br/>\n</p>\n<p>\n<strong>(This game is in developement, so expect a few bugs here and there)</strong><br/>\n</p>\r\nControls\r\n<ul>\n<li>WASD + mouse(left button - primary fire, right button - secondary fire, middle button used for zoom by default)</li>\n<li>1-0 keys used for weapons</li>\n<li>TILDE or SHIFT+ESC for game console</li>\n<li>TAB key shows score table</li>\n<li>SHIFT key for crouch</li>\n<li>T key used for chat</li>\n<li>Check Settings menu-&gt;input section for other key binds</li>\n<li>All key binds can be customized in Settings menu-&gt;input section</li>\n</ul>\r\nHow to play\r\n<p>\r\n\tWe recommend you to try your skills in single player campaign against bots and join online servers afterwards, but actually its not necessary, your skills will improve in online matches much faster.<br/>\r\n\tDepending of the game type:<br/>\r\n\tFFA(Deathmatch) - just shot to all enemies roaming around<br/>\r\n\tTDM(Team Deathmatch) - shot opposite team players<br/>\r\n\tCTF(Capture the Flag) - try to get the enemy flag and bring it to your base<br/>\r\n\tClan Arena - team survival game with limited ammunition amount<br/>Conquest - Battlefield like game play. Capture control points on the map to control all the map.<br/>FreezeTag - Freeze enemies by killing em. revive your frozen teammates staying close to em.</p>\n<p>\r\n\tCheck the other game types in Multiplayer-&gt;Create section of menu\r\n</p>\r\nShort weapons instruction\r\n<p>1. Laser. Mostly used as rocket jump replacement, but can also be useful for pushing enemies to void. Have only primary fire. When you press secondary it switches to previous weapon.<br/>2. Shotgun. Primary fires single shoots. Secondary - short burst of 3 bullets. Useful in short and medium distances.<br/>3. Uzi or MachineGun. Primary fire - fast automatic fire with big spread. Secondary - lower fire rate, but better accuracy.<br/>4. Mortar or Grenade launcher. Primary - Grenade explodes on first touch of anything. Secondary - grenade jumping around and explodes after short life time or in case of players body touch.<br/>5. Electro. Primary - slow moving energy rays. Secondary - jumping plasma balls. <br/>6. Crylink. Primary - very fast energy shotgun. Secondary - horizontally spreader energy rays.<br/>7. Nex or Railgun. Primary - shot. Secondary - zoom.<br/>8. Hagar. Mini Rocket machine gun. Secondary fire rockets can reflect walls.<br/>9. Rocket Launcher. Primary - shot. Secondary - explode of fired rockets.<br/>Extra weapons and features:<br/>0. Porto gun. Portal game like portogun.<br/>3. Camping rifle weapon. Very rare or available on special CRA server. Have headshot bonus damage.<br/>5. Electro. Primary shoot to group of plasma balls causes very powerful explosion.<br/>6. HLAC - heavy laser cannon. Primary - automatic fire with increasing spread. Secondary - kinda laser shotgun.<br/>9. Rocket Launcher. Primary fire trick. Fire and hold primary fire button and move mouse to steer rocket to your crosshair<br/>9. Fireball or flamethrower. Primary shot with fire projectiles. Secondary - huge fireball.<br/>Hook - used with E key by default. Can help you reach any places you see on the map. Using cells ammo.<br/>Melee attack. Used with R key by default. Can be kick or hit with weapon.<br/>Zoom can be used with any weapon by pressing middle mouse button by default.</p>", "metacritic": null, "released": "2017-04-04", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/b43/b43c8296c76c4ca12fda5b068e05170b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 404, "game_series_count": 0, "reviews_count": 1, "platforms": ["PC", "macOS", "Linux"], "developers": ["rexuiz"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}