{"id": 906210, "slug": "rubymaze-3d", "name": "Rubymaze 3D", "name_original": "Rubymaze 3D", "description": "<p>Rubymaze 3D is some kind of retro-style arcade game using my own CPU-rendered raycasting graphics engine.</p>\n<p><strong>IMPORTANT NOTICE</strong>: I am not really a game developer, this game is more of a \"demo game\" to test the graphics engine I wrote. Do not expect something amazing.</p>\n<p><strong>Rules</strong></p>\n<p>In this game you have to collect as much rubies as possible. The more rubies you collect, the more enemies will wander around in the maze. The game ends when you die. You also have various objects to help you like a gun to kill them, a phone-looking object that teleports you around in the map (can be dangerous!) and a speed object to temporarily make you faster.</p>\n<p><strong>Controls</strong><br/></p>\n<ul><li>WASD - Move around</li><li>Esc. - Pause</li><li>Space - use your current object</li><li>E - show the minimap</li><li>F1 - debug information</li><li>F2 - debug console</li></ul>\n<p><strong>Console commands</strong></p>\n<p>Some commands used for debugging, can also be considered as cheats. Console output is shown in the debug information HUD</p>\n<p><strong>NOTE: </strong>when specifying a float, make sure to have a point afterwards, even if there is nothing after it. Example: Instead of specifying 1, specify 1.0.<br/></p>\r\nquitExits the gamesetmousesens &lt;float: sens&gt;Change mouse sensitivity<br/>setammo &lt;int: ammo&gt;Set gun ammosetcurrentitem &lt;int: id&gt;Set current item in handgodmode &lt;int: enable&gt;1 = enable godmode, 0 = disablenoclip &lt;int: enable&gt;1 = enable noclip, 0 = disable<br/>Basically makes you go through wallsteleport &lt;float: x&gt; &lt;float: y&gt;Teleports your player at specified positionsuicideKills your character and resets the gamespawnbaddie &lt;int: amount&gt;Spawns n enemies in the map. Maximum is 64.getposGet player positionhelloOutputs \"Hello, World\" in the debug output\r\n<p><strong>Other information</strong><br/></p>\n<p>This game has been written in C and Made with my engine lightrcg. Source of my game can be found here. You can tinker with the game code for personal use or build it for another platform. Game has been tested with Windows and Linux, however make pre-built stuff for Linux is hell and building C stuff on Windows is hell. So I only made a Windows build.</p>\n<p>Credits to @noshades, wobblebox.com and opengameart.org for the few soundeffects I needed to get.</p>\n<p>The game has been made with my editor, GCC, Blender, GIMP and OpenMPT.</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T08:14:19", "background_image": "https://media.rawg.io/media/screenshots/263/26384d927f2accf4c0968f328d9cfa19.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 67, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["matthilde"], "genres": ["Shooter"], "publishers": [], "esrb_rating": null}