{"id": 90636, "slug": "no-hackers-sky", "name": "No Hacker's Sky", "name_original": "No Hacker's Sky", "description": "<p>In No Hacker's Sky you're a space enthusiast, who also happens to be a skilled <em>hacker</em>. It's set in the future, where a huge space mining corporation called Extrasolar Mining Corp (EMC) has deployed probes, satellites and manned stations on distant planets and moons. You are contacted by a group called Unknown to hack into the EMC network to find out what is going on.</p>\n<p>Here's where the game begins. You use the in-game command prompt together with the \"node map\" to hack into EMC's network. You start by poking for weaknesses, exploring the network for emails and passwords, eventually gaining access to offworld drones. Look for evidence in documents and emails, and while using their drones you can look for signs of what they have been hiding. </p>\n<p>To access nodes you either have to provide certain password files, or clear 3D visualized puzzle worlds (19 of them). You'll even get to explore a couple of planets near the end of the game (screenshot 4 is one of them).</p>\n<p><strong>Review</strong></p>\n<p>\"<em>In No Hacker's Sky you play a skilled computer hacker who is attempting to uncover an interplanetary conspiracy using a mixture of basic command line prompts and first person puzzle solving.</em></p>\n<p><em>...<br/></em><br/></p>\n<p><em>With it's intriguing storyline, clever use of interfaces and unique hacking-based puzzle design, No Hacker's Sky is a joy to play. A well crafted hacking sim, full of discovery, unique gameplay and innovation.</em>\"<em> - </em>Calum Fraser (FGP)</p>\n<p><strong>Instructions</strong></p>\n<p>To open nodes, you must first open the node map by writing in the command \"toggle nodemap\". What you see then is the main node map, with different network nodes. These network nodes hold a sub node map, where the nodes are essentially individual systems.<br/></p>\n<p>To open network nodes, click on them. The network nodes with a \"?\" on them aren't accessible, so you can't open them - however, the system nodes with a \"?\" on them can be opened (which is very essential), and then hacked by either password or a node world. You can move the node map around my dragging it around. To go back to the main node map that shows network nodes, just click the little \"Back\" button.</p>\n<p><em>Main Command Prompt</em></p>\n<ul><li>Enter : Call commands (if the input field isn't already focused, this will focus it).</li><li>TAB : This scrolls through commands, including their arguments. If you write a bit of a command and press TAB, it will try to find one that matches (even if you just write a bit of an argument). Holding Shift while pressing TAB will go the opposite direction, this means you can go back if you accidentally scroll past the command you want to call.</li><li>Arrow Key Up + Down : This scrolls through previously called commands.</li><li>You can move and resize windows in the same way you would with a normal operating system.</li><li>To use tools, drag them to the other pane in the file window. To avoid confusion about using tools, click here to see how to use them. </li><li>To use passwords, you have to drag them to the little area saying \"Password Required\". </li></ul>\n\n<p><em>Planets + Node Worlds</em></p>\n<ul><li><em>WASD : Movement.</em></li><li>Shift : Run.</li><li>Spacebar : Jump.</li><li>(Planets) Escape : Open command line that'll let you write \"exit\" to exit planet.</li><li>(Node Worlds) To unfocus a terminal, either look away or press Escape.</li><li>(Node Worlds) Type in \"exit\" in any terminal (there may be some exceptions) to leave the node world.</li><li>(Node Worlds) The \"Home\" key restarts the level.</li></ul>\n<p><strong>Known issues</strong></p>\n<ul><li>Sometimes needing to push 'T' multiple times on a drone to log an evidence piece.</li><li>In falling puzzles, you can sometimes stick to the wall to stop falling.</li><li>In falling puzzles, sticking to the wall sometimes propels you into the air.</li><li>If you hit a corner in the right way in a maze or drone - it flings you into the air. Press home to reset in the maze when you are flung upwards.</li></ul>\n<p><strong>Hints/Tips</strong><br/></p>\n<p>Tools cannot be used if the node hasn't been hacked/unlocked.<br/></p>\n<p>Hint: You can click on email notifications to open the new email.</p>\n<p>Hint 2: If you seem to be stuck - remember to use the Hound tool frequently. It will show hidden places and also reveal traps. Rogue can only be used on known tripwires.</p>\n<p>Hint 3: There are only three viruses but many more honeypots. Use them wisely.</p>\n<p>Hint 4: 'help' to get commands and see how many proxies (lives) you have left.</p>\n<p>Hint 5: If you're stuck after the first four nodes, please remember to read the emails. Use Hound on the node \"Hub\" and the hidden node will be shown. When you reach the end node in that network, click the \"Back\" button on the node map to go back to the main node map.</p>\n<p>Hint 6: Please read emails carefully, sometimes you get important info from them (especially in the first node network).</p>\n<p>Hint 7: To use tools on nodes, you need to have access to them. </p>\n<p>Hint 8: Keep in mind you can drag the windows around, as well as resize them (just like you would in Windows, OS X or Linux).</p>\n<p>If you are careful you will finish the game, if you are careless you will perish.</p>\n<p><strong>Credits:</strong></p>\n<p>Programming &amp; UI - Mathias Guul (with help from Mathias Adam Møller)<br/>Writing and UI Concept Art - Victoria King<br/>Sound Design &amp; Original Soundtracks - Gabe Castro (The Forest)<br/>3D Art &amp; Level Design - Alex Avila</p>\n<p>This game was made in about 20 days for an online game jam called \"Mix Tape\" held by the /r/IndieDev subreddit, with the theme of \"Exploration\". It was held in collaboration with the No Man's Sky subreddit, hence the name \"No Hacker's Sky\".<br/></p>", "metacritic": null, "released": "2015-06-29", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/274/27478f73a77b5b1e3b8e310c81fab158.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 73, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS"], "developers": ["Zestyr"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}