{"id": 906312, "slug": "intarts", "name": "Intart's", "name_original": "Intart's", "description": "O que é Intart?\r\n<p>Pode ser considerado uma franquia (eu acho) de jogos onde representa em forma de jogo (e nada realista) como uma Rede Neural age para alcançar seu objetivo, sempre aprendendo com o seu próprio erro por várias tentativas. E aqui nessa página está os dois primeiros jogos, que incialmente estavam no Gamejolt, junto de uma pequena biografia de cada um.</p>\n\n<p><em>\"Um jogo desafiador, com uma história simples. Eu não levei muito muito a sério, mas achei o resultado divertido! </em><em> :D \"</em></p>\n<p>O primeiro Intart começou como um teste bobo e acabou que foi o meu primeiro jogo (não foi, mas finge que foi pra ficar mais interessante, tenho medo do meu passado) lançado em 9 de Março de 2020, não tenho certeza quanto tempo eu demorei para fazer, mas foi em torno de quase dois ou três meses. Eu lembro que eu falava para todos que esse ia ser lançar esse jogo e seria incrível, mas agora com uma mente mais madura vejo o quão ruim ele é, ao ponto de machucar os olhos e ser praticamente impossível (até agora ninguém zerou). Mas não é só por isso que deixo de ter um carinho por ele, querendo ou não foi o começo de algo bem legal :).</p>\r\nA História (para ninguém ter que passar pelo inferno que é jogar esse jogo)\r\n<p>Um adolescente programador estava treinando uma rede neural para um projeto próprio, e a própria rede neural após derrotar o criador como um boss criado pelo mesmo, disse que seus códigos seriam muito utilizados para o futuro.</p>\n\n\n<p><em>\"O que acontece se uma empresa faz robôs suspeitos de espionagem? Fazer um rede neural que aprenda a derrotar ela!\"</em></p>\n<p>O segundo Intart foi uma experiência deveras interessante, eu fiz essa continuação deveras \"melhor\", com mais mecânicas e agora com fases passáveis (mas ainda com problemas de game design que não ajudam), e o que mais me surpreende que fiz esse em um mês, levando alguns dias para as mecânicas, e cada fazendo uma ou duas fases ou músicas.  Eu me diverti nesse, ver minha evolução dessa forma é bem interessante<br/></p>\r\nA História\r\n<p>A empresa de tecnologia Eoclope Company iniciou a venda de seus robôs de inteligência artificial avançada como assistentes perfeitos. Porém um grupo de hackers se reuniram para estudar após algumas acusações que Clopes observavam pessoas de forma Ilícita. Entretanto, o sistema dos Clopes (Os robôs da Eoclope Company) eram muito bem protegidos, mas até que um dos hackers, Marcus, o mesmo que estava fazendo um vídeo de exposed, deu a ideia de fazer uma rede neural que aprende os padrões da segurança do sistema para conseguir descriptografar o mesmo. <br/>Enquanto isso, a Eoclope Company desmentia todas as acusações alegando que era só medo a uma nova era de tecnologia, até mesmo soltando os códigos na internet para provar. <br/>Mas quando finalmente a rede neural conseguiu acessar todo o sistema para ter informações o suficiente para pôr as provas na internet, toda a humanidade se revoltou contra os Clopes, mas eles também se revoltaram e começaram a matar os humanos, acreditando-se que era o plano da Eoclope Company desde  o ínicio. Mas nada mais importava, a humanidade perdeu.<br/><strong>FINAL ALTERNATIVO (-100 MORTES) - </strong>O grupo percebeu que haviam criado a rede neural perfeita, ao ponto da mesma conseguir rapidamente espalhar um vírus por todo o sistema dos Clopes por meio do servidor central, e assim, eliminando a ameaça que posteriormente foi revelado pelos hackers.<br/></p>\n<p><strong>- Por que colocou os jogos aqui?<br/></strong>Nem eu mesmo tenho certeza, mas acho legal ter uma história  sobre eles em algum lugar, e achei aqui a melhor opção. <br/></p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T08:54:38", "background_image": "https://media.rawg.io/media/screenshots/ddb/ddb2a49f69504c01394111ded0894b84.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 89, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Rippley"], "genres": ["Puzzle", "Platformer"], "publishers": [], "esrb_rating": null}