{"id": 906456, "slug": "synergytd", "name": "SynergyTD", "name_original": "SynergyTD", "description": "Intro\r\n<p>A tower defense game of synergies and randomness.<br/></p>\n<p>Utilize random towers empowered by colors and the essence of other towers to defend against waves of ever changing enemies.</p>\n\r\nSynopsis\r\n\n\n<p>Start the game with basic towers offered at the shop. Amass gold per round and from interest. Gold can be used to restock the shop and to level up, allowing more and better towers to be fielded.  Become stronger by activating color synergies: buffs that are gained by placing similar colored towers. Use other towers to upgrade towers.</p>\n<p>The shop offers towers at random, but can be manipulated to offer better quality towers. Face one of the many factions of enemies per game. Random towers plus random enemies ensure that every single playthrough offers a unique challenge and experience.</p>\n\r\nScreenshots\r\n\n<p>(Putting screenshots here since side bar screenshots are too small)</p>\n\r\nDevelopment Status\r\n<p>This is an early version of the game. Arts assets and animation are lacking. There is also no sound/music. Many more features and game defining elements are to be added. Expect bugs and overpowered/underpowered builds. Releasing it rather early in the hopes of gathering attention.</p>\n\n<p>Inspired by: Teamfight Tactics, and every TD game the creator has played (BTD 3+, Garden Defense, PvZ, among many others).</p>\n\r\nMinimum Specs\r\n<p>- Windows Vista or higher<br/>- 4GB RAM (arguably 2GB should be fine but can't test it)</p>", "metacritic": null, "released": "2023-01-08", "tba": false, "updated": "2023-01-09T09:47:27", "background_image": "https://media.rawg.io/media/screenshots/fa2/fa233ee2a4df68e48db25c5307502927.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 2, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["bambiireborn"], "genres": ["Strategy"], "publishers": [], "esrb_rating": null}