{"id": 906504, "slug": "nine-sols", "name": "Nine Sols", "name_original": "Nine Sols", "description": "<p>Nine Sols is a lore rich, hand-drawn 2D action-platformer featuring Sekiro-inspired deflection focused combat. Embark on a journey of Asian fantasy, explore the land once home to an ancient alien race, and follow a vengeful hero’s quest to slay the 9 Sols, formidable rulers of this forsaken realm.<br />\nStory<br />\nIn New Kunlun, hero Yi has awakened the 9 rulers of this forsaken realm. To defeat the 9 Sols in the deserted city.</p>\n<p>“Becomes one with the way of Tao…”</p>\n<p>New Kunlun, the Solarian’s last sanctuary, has remained quiet for centuries. Inside this vast realm, the ancient gods left mortals with a promised land that is forever protected by the sacred rituals, yet the truth of this world remains unknown to most. Everything changes when Yi, a long forgotten hero from the past, is awoken by a human child.</p>\n<p>Follow Yi on his vengeful quest against the 9 Sols, formidable rulers of this forsaken realm, and obliterate any obstacles blocking your way in Sekiro-lite style combat. Explore in unique “Taopunk” setting that blends cyberpunk elements with Taoism and far eastern mythology. Unravel the mysteries of an ancient alien race and learn about the fate of mankind.</p>\n<p>Features<br />\n2D Sekiro-lite Combat: Slash, deflect, charge into enemies and blow them up with the Taoist talisman! Each fight combines fast, brutal action sequences with classic platforming mechanics.</p>\n<p>Intriguing Boss Fight: Ready yourself to fight the vicious ancient guardians and gruesome creatures. Be patient and utilize every move in your arsenal, mix up with Yi’s godly bow to defeat these larger than life figures.</p>\n<p>Taopunk Setting: When cyberpunk clashes with Taoism, melding sci-fi elements with eastern mythology/fantasy, the experimental genre of Taopunk was born.</p>\n<p>Exploration: Traverse in the interconnected regions of New Kunlun. Discover secrets, piece together the story behind Yi’s revenge.</p>\n<p>Aids from inhabitants: Meet interesting NPCs of this world and interact with them to receive upgrades, gain new abilities, and discover useful technology.</p>\n<p>Hand-drawn Environments/Animations and Manga: Nine Sols is filled with meticulous hand-crafted, anime style landscapes, sprite based hand-drawn animations, blending with Japanese manga inspired cutscenes.</p>\n<p>Red Candle Games<br />\nFrom the creators of award-winning psychological horror games Detention and Devotion, comes Red Candle Game’s latest title Nine Sols. The studio aims to deliver a stylized action platformer that’s cohesive and complementary to its lore-rich narrative. It’s an ongoing, most ambitious project from this indie studio.</p>", "metacritic": null, "released": null, "tba": true, "updated": "2024-03-29T12:03:08", "background_image": "https://media.rawg.io/media/screenshots/22e/22ee03bfdcfa071fc1947d4db4d99797.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"yet": 1, "owned": 2, "toplay": 27, "dropped": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 1, "suggestions_count": 240, "game_series_count": 0, "reviews_count": 2, "platforms": ["PC"], "developers": ["RedCandleGames"], "genres": ["Action", "Platformer"], "publishers": ["RedCandleGames"], "esrb_rating": null}