{"id": 90661, "slug": "super-sculptor", "name": "Super Sculptor!", "name_original": "Super Sculptor!", "description": "The game where anyone can be a sculptor!Now on iOS with added features like camera objects!<p>\n<br/>\n</p><p>\n<br/>\n<br/>\n</p>\r\nSuper sculptor is a small toy where players can create the surreal sculptures of their dreams. Place 40 different items ranging from televisions to eyeballs, chain together waving arms and spinning sawblades, and build massive towers of donuts! Use the time slider to slow down time and build complex assemblages of objects.\r\n\r\nAs you build your sculpture, watch as its value increases based on what you choose to include. Impress or bore the museum audience with the shock value of your work. When you're finished, Super Sculptor will generate a name for your work that it deems appropriate. No longer must the artist feel conflicted about naming their piece!\r\n<p>\n<br/>\n</p><p>\n<strong>UPDATE (February 27, 2016)</strong>\n</p><p>\r\n\t– Added 6 new objects! 40 objects total! (disco ball, gameboy, picket fence, smartphone, ANTIGRAVITY TRAMPOLINE, cactus)\r\n</p><p>\r\n\t– Polished UI! No longer scales with screen resolution for you large-monitored folk\r\n</p><p>\n<strong>UPDATE (January 8th, 2016)</strong>\n</p><p>\r\n\t– Added 4 new objects! (fan, grass, mushrooms, soup)\r\n</p><p>\r\n\t– Fixed a bug where camera controls also adjusted the game speed\r\n</p><p>\r\n\t– Take screenshots! They're saved to the desktop as your sculpture's name.\r\n</p><p>\r\n\t– Redid the name generator for more consistency &amp; better names\r\n</p><p>\r\nThe game can be controlled entirely by clicking the mouse, but you can right click to cycle through items and use the scroll wheel to rotate the camera.\r\nWASD &amp; Arrow keys do the same thing. Happy sculpting!\r\n</p><p>\r\n\tFeel free to send me screenshots of what you make via \r\n\ttwitter. :)\r\n</p><p>Note: The desktop version of Super Sculptor will no longer be updated, check out the iOS version for new updates! I'll be adding a lot of features specific to mobile devices.</p>", "metacritic": null, "released": "2016-01-02", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/875/8758a3a0d2955abf80c999881120549c.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 87, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Michael Shillingburg"], "genres": ["Simulation"], "publishers": [], "esrb_rating": null}