{"id": 906676, "slug": "name-one-place", "name": "name one place", "name_original": "name one place", "description": "<p>Where do you go when you are displaced? <em>name one place</em> is composed of photogrammetric scans, field recordings, text, and static images lying about made under the guidance of the dias stories Future Through Memory workshop. The materials describe or directly come from personal spaces, indistinct landscapes, family history, recent global history, and internet pop culture. Part diary and part documentary, the space provides time, ground, and sensations to navigate around and meditate on the feelings of knowing you’re somewhere else without quite knowing the proceeding location.</p>\n<p>A captioned performance of the space titled Island Hopping can be viewed on Youtube.\r\n</p>\n<p>Materials in the space are: My first attempt ever at writing pre-colonial Baybayin. A direly candid shot of my desk. A pan of my 2nd generation improvised tofu adobo recipe. A viral twitter post from user @melip0ne. Music and sound effects from the hit Bemani arcade games Sound Voltex, Jubeat, and Pop’n Music taken from room audio. A NHK World newsflash covering early Russian movements in Ukraine. The ocean viewed and recorded from my preferred hidden gem beach access on the Jersey Shore (don’t ask). The concrete bones of a beachside mansion expansion right next to the prior spot.\r\n</p><p>Environment is made in Aframe and the photogrammetric scans were made using Agisoft's Metashape.</p><p>If you have trouble with framerate, try viewing in a different browser or turning on hardware encoding. I don't have access to VR so no suggestions on that front. </p>", "metacritic": null, "released": "2023-01-07", "tba": false, "updated": "2023-01-09T11:13:53", "background_image": "https://media.rawg.io/media/screenshots/9c6/9c6dcc5feb36320a3f1cf93401e20730.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 34, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web"], "developers": ["axe binondo"], "genres": [], "publishers": [], "esrb_rating": null}