{"id": 906829, "slug": "astra-defender", "name": "Astra Defender", "name_original": "Astra Defender", "description": "<p>Astra Defender is a unique blend of space shooter action and real time strategy. Your objective is simple: destroy your opponents' bases, and defend your own.</p>\n<p>Skillfully pilot your ship through infinite space, and use resources to build defenses and upgrade your ship. Command your fighters to attack the enemy's defenses, or call them back home to protect your own base.</p>\n<p>To emerge victorious, you'll have to master your piloting skills, optimize your unit placement, prioritize your upgrades, and strategically plan your attacks on the enemy.<br/></p>\r\nBUILD\r\n\r\n\r\n<p>You can build units anywhere that your ship can travel, as long as there's room and a nearby power source. <strong>Factories</strong> increase your resource generation. <strong>Research stations</strong> allow you to research upgrades for your ship and units. <strong>Turrets</strong> bolster your defenses. <strong>Shipyards</strong> house your army of fighters.<br/></p>\r\nUPGRADE\r\n\r\n<p>Build research stations and use them to research upgrades for your ship and units. <strong>Basic</strong> upgrades include your ship's speed, firepower, and health. <strong>Ship Config</strong> upgrades allow you to change weapons, heal your units, and more. <strong>Advanced</strong> upgrades provide additional utility.</p>\n<p>Each upgrade requires time and resources to research, so plan accordingly. Will you max out your firepower as quickly as possible? Or will you prioritize speed and survivability?<br/></p>\r\nATTACK\r\n\r\n<p>While the ship you control starts out pretty weak, a fully-upgraded ship can shred through most enemy units with ease. But you don't have to always attack head-on—create shipyards to build up your fleet, then launch fighters at your enemies and overwhelm their forces until they are annihilated.</p>\n<p>Want even more backup? Form alliances and team up against a common enemy, but beware: alliances can be broken at any time!</p>\n\n\r\nALPHA TEST\r\n<p>This is a free alpha version of Astra Defender. Download it, play it, leave feedback! The alpha has limited perks and credits, and they'll reset each launch so you can respec. The full version will (hopefully) release later this year.  Wishlist it on Steam to stay up to date!<br/><br/></p>", "metacritic": null, "released": "2023-01-07", "tba": false, "updated": "2023-01-09T12:14:24", "background_image": "https://media.rawg.io/media/screenshots/af9/af9cd0f6069844642ed0906bdef7902b.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 91, "game_series_count": 0, "reviews_count": 0, "platforms": ["Linux", "macOS", "PC"], "developers": ["Yokereba"], "genres": ["Action", "Strategy"], "publishers": [], "esrb_rating": null}