{"id": 906951, "slug": "ottos-escape", "name": "Otto's Escape", "name_original": "Otto's Escape", "description": "In <strong>Otto's Escape</strong> you fly a jetpack with just two buttons: one for your left booster and one for your right. There's no simple move up or move right button - that'd be too easy. To steer, you'll need to balance the thrust from those two boosters to get you moving in the right direction, all while fighting with gravity and an ever-shrinking fuel supply.<br/><br/>The aim of the game is simple: reach the top of the tower and escape without running out of fuel, or you'll be sent right back to the ground. Piece of cake, right?<h3>Key features</h3><ul><li> <strong>Ascend the tower</strong> 🚀<br/>To escape the tower you'll need to clear 20 unique floors filled with an increasingly challenging assortment of hazards which will slow you down and drain your fuel if you fly too close. And some say the tower's so tall it reaches into outer space...<br/></li><li> <strong>Controller support</strong> 🎮<br/>Otto's Escape's unique control scheme is best experienced with a controller featuring analog triggers - such as an Xbox or PlayStation controller - which will allow you to more finely control the thrust from your two boosters and steer with greater precision.<br/></li><li> <strong>Attempt stats</strong> 📊<br/>Track your attempts with detailed stats screens as you edge closer to your first triumphant escape. And after that, why not try for a faster time?<br/></li><li> <strong>Achievements &amp; leaderboards</strong> 🏆<br/>Your first escape is only the start - Otto's Escape's achievements offer some of the game's hardest challenges, while in-game leaderboards allow you to see how your fastest time compares with others around the world.</li></ul>", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2024-04-12T07:49:19", "background_image": "https://media.rawg.io/media/screenshots/141/1411a4177e8477f93a9f6645c55d7f82.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 12, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "Web"], "developers": ["NotSoQualGameDev", "Axylaric Games"], "genres": ["Action", "Indie"], "publishers": ["Axylaric Games"], "esrb_rating": null}