{"id": 907041, "slug": "the-crescent-archipelago", "name": "The Crescent Archipelago", "name_original": "The Crescent Archipelago", "description": "<p><strong>Storyline</strong><br/></p>\n<p><em>“It was during my voyages through the Crescent Archipelago that I first began to notice distortions in the laws of nature, and as I travelled further from Adamah’s equator, the stranger these distortions became.”</em><br/></p>\n<p>So begins the story of Zeljo Kane, goblin scholar and mercenary captain. The Shepard’s Bay Company has enlisted Kane’s crew to escort a surveyor into the Corlea Caverns, but their lives are changed forever when a distortion in time causes a floating island to appear above the archipelago. Intent on discovering how a vision from the past could physically manifest in the present, Kane becomes determined to explore the floating island. The crew must then secure passage to the clouds above, and their journey will take them through pirate hideouts, chains of sandy islets, and the winding corridors of Adamah’s expansive tunnel network. But when they reach the floating island, will the crew be able to handle the dark truth behind the ancient dynasty that once called the sky its homeland? </p>\n<p><em>The Crescent Archipelago </em>is the first entry in <em>The Unformed Adamah </em>series. For more information on the series, please visit the Polaris Spirit Studios main page. </p>\n<p><strong>Game features</strong></p>\n<ul><li>A five-to-six-hour narrative driven by themes of technology’s destructive potential and the corruptive nature of power, religion, and imperialism.</li><li>A turn-based battle system with a timed attack system. Use timed skills to recover MP, deal bonus damage, score guaranteed criticals, apply debuffs to enemies, and more!\r\n  </li><li>A journey through the archipelago’s most dangerous environments and into the levitating ruins of a fallen empire.   </li></ul>\n<p><strong>The story’s main cast</strong></p>\n<ul><li>Zeljo Kane, an aloof scholar who wields powerful magic abilities. Kane has little patience for incompetence or deceit, but his leadership ensures that those under his command always come back alive. Born in the subterranean society of the anarchistic goblinfolk, Kane is known by his kin as a maverick for his choice to dwell above ground and keep company with humans.\r\n  </li><li>Cora Mapleson, an optimistic and youthful gunslinger who has abandoned her hometown to the corrupt lawmen she once called allies. When a chance encounter causes a strange apparition to take residence in her consciousness, will Cora be able to shoulder the burden of carrying the apparition’s memories?\r\n  </li><li>Hannah Fourspire, a disillusioned cleric who has fled the Church of Resignation after breaking the vows that bound her to that religion. Once compassionate enough to wield difficult healing magic, Hannah’s anger and bitterness now allow her to destroy anything in her path through blood rituals that cause self-inflicted wounds. But why has Hannah abandoned the Church of Resignation? And what consequences will follow her choice to break her vows? </li><li>Yuri Tarakanoff, a playful saboteur who has defected from a company of sky pirates. The pirates were once partisans fighting the tyrannical ruler of Yuri’s homeland, Yemsky. Now the airships the partisans stole are under the control of Lebedev, the cruel and greedy pirate commander. Yuri needs Kane and his crew to help liberate the airships from Lebedev’s command, but are Yuri’s noble goals really all that they seem? \r\n</li></ul>\n<p><strong>ATTENTION: </strong>Windows Defender will likely flag this game as an untrusted application even though it contains no viruses. If you are concerned about viruses, please consider downloading the game through the Itch.io desktop app.</p>", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-01-09T13:43:42", "background_image": "https://media.rawg.io/media/screenshots/489/48960acc0558f254ef9f520b43916cbc.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 198, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Polaris Spirit Studios"], "genres": ["Adventure", "RPG"], "publishers": [], "esrb_rating": null}