{"id": 907066, "slug": "dream-walker-itch-logitech-arts", "name": "Dream Walker (itch) (LOGITECH ARTS)", "name_original": "Dream Walker (itch) (LOGITECH ARTS)", "description": "<p>Bimbing Anna melalui dunia impian yang hebat dalam permainan pelari teka-teki</p>\n\n<p>Dream Walker ialah permainan yang mencabar, nyata, pelari teka-teki di mana anda meneroka dunia fantastik dan mimpi ngeri bawah sedar yang penuh dengan fizik, seni bina dan permainan minda yang sukar dipercayai. Jadi adakah anda bersedia untuk bermain dan berlari pada penjejak larian?</p>\n\n<p>Petua Permainan Penting:</p>\n<p>Kumpul Bintang untuk membuka Bab baharu untuk diterokai. Dalam perjalanan, ambil juga seberapa banyak Rama-rama yang mungkin. Mereka akan berguna untuk membeli pakaian baharu dan model wira daripada Roda Hadiah. Kebanyakan permainan helah adakah anda bersedia untuk menerima cabaran yang tiada tandingan? Gunakan fikiran anda dan selesaikan teka-teki ini pada penjejak larian</p>\n\n<p>Penting:</p>\n<p>Permainan ini sangat sukar, kerana ia memerlukan refleks yang cepat dan masa yang baik.</p>\n<p>Membimbing Anna bukanlah satu tugas yang mudah!</p>\n<p>Cari jalan anda mengikut gaya anda sendiri dalam permainan survival. Objektif utama anda adalah untuk menyeberangi semua jalan sukar merentasi penjejak larian dalam permainan survival. Berhati-hati semasa berjalan di atas penjejak larian. Jika anda keluar dari penjejak larian anda akan longgar dalam permainan survival, jadi, bersedia dan terima cabaran dalam permainan survival. Jadi, apa tunggu lagi? Dapatkan telefon anda, bermain permainan survival dan selesaikan tugas anda dan menangi permainan survival ini. Untuk memenangi permainan kelangsungan hidup ini anda perlu melakukan latihan dalam penjejak larian. Muat turun dan nikmati teka-teki ini pada penjejak larian.</p>\n<p>ciri-ciri</p>\n<p>Tahap rumit</p>\n<p>Persekitaran realistik dalam permainan survival</p>\n<p>Kawalan lancar</p>\n<p>Kesan Bunyi Menakjubkan</p>\n\n\n<p>® LOGITECH ARTS GLOBAL </p>", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-01-09T13:54:02", "background_image": "https://media.rawg.io/media/screenshots/24c/24ca71361aface801b61cb1d72509b1a.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 127, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android"], "developers": ["LOGITECH ARTS"], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}