{"id": 907133, "slug": "mini-car-racing-3d-race-game", "name": "Mini Car Racing. 3D Race Game", "name_original": "Mini Car Racing. 3D Race Game", "description": "<p>The main features of the Mini Car Racing. 3D Race Game are:</p>\n<p>  - 12 cars in 3 different classes with their unique characteristics.</p>\n<p>- 1 location with 14 different track configurations.</p>\n<p>- a large number of levels with different tasks, such as a classic race, qualification, time trial or competition with an opponent.</p>\n<p>- improving car characteristics such as maximum speed, acceleration and handling.</p>\n<p>- this game is absolutely free and does not require any internet connection. You can play offline anytime unlike other car games.</p>\n<p>Future updates in Mini Car Racing. 3D Race Game will be include:</p>\n<p>- new locations and tracks (kitchen, children's room, etc.).</p>\n<p>- new cars and classes (3 available and 3 new classes with at least 10 cars each). A total of 6 classes and 60 cars.</p>\n<p>- nitro added, which allow for a short period of time to increase the maximum speed and significantly increase the power of the car, which have affect the speed of acceleration.</p>\n<p>- will be added resources for upgrading cars, namely, different types of engines, engine parts, suspension parts and more.</p>\n<p>- improving the location environment. Bookshelves, paintings and other improvements to the new environment will be added to the pool room.</p>\n<p>-the quality of the game graphics will be improved and the fps counter will be added. It will also be possible to more finely adjust some game graphics with the possibility of post-processing.</p>\n<p>- changing 3D models to more polygonal and high-quality ones.</p>\r\nPlease give your review of the game.", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-01-09T14:24:13", "background_image": "https://media.rawg.io/media/screenshots/30f/30fcb9b4f5851197aa181e4b606a8db8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 61, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Mad TOL"], "genres": ["Racing"], "publishers": [], "esrb_rating": null}