{"id": 90726, "slug": "dolphin-island-2", "name": "Dolphin Island 2", "name_original": "Dolphin Island 2", "description": "<p><strong>Dolphin Island 2</strong> is a game made by Jan (@AldianSolkai) and James (@jtangc) for the A Game By It's Cover 2015 Game Jam, where we had to make a game based on a fake cover art.</p>\n<p>We chose Dolphin Island 2's cover by Ko Takeuchi (@kokosac), one of the designers behind the Wario Ware and Rhythm Heaven series.</p>\n<p>The game files are released as open-source on GitHub under the MIT License if you want to use it as a learning tool.</p>\n<p>Controls:<br/></p><ul><li>Movement :  Arrow keys or WSAD (keyboard) or Dpad (360 Controller)</li><li>Attack : X or J or Ctrl (keyboard) or X (360 Controller)</li><li>Jump : Z or K or Space (keyboard) or A (360 Controller)</li><li>Pause : P (keyboard) or Y (360 Controller)<br/></li></ul>\n<p>\"<em>Thanks to Sora and Momo peace has returned to Dolphin Island. <br/>After returning from the game world to reality, something happens to Sora. <br/>The program for the peaceful Dolphin Island is rewritten by someone and the Devil King they had worked so hard to beat has revived. <br/>The classmates that had the game cassettes are all captured by the Devil King. <br/>Sora looks for programmers in the real world. <br/>In Sora's stead, Aisha dives into the game world to rescue their classmates. <br/>While coming and going between the two worlds, can they beat the Demon King and rescue their classmates?\"</em></p>", "metacritic": null, "released": "2015-08-08", "tba": false, "updated": "2019-08-28T23:26:12", "background_image": "https://media.rawg.io/media/screenshots/90d/90dfa8f05d0d23cc0102672f02404fc8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 109, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["Jan Marcano", "anvilbear"], "genres": ["Platformer"], "publishers": [], "esrb_rating": null}