{"id": 907255, "slug": "quest-adventure-v14", "name": "Quest Adventure v1.4", "name_original": "Quest Adventure v1.4", "description": "<p><strong>Combatir</strong>\n</p>\n<p>Debes presionar el botón A cuando la flecha verde este debajo o más delante de la roja, de lo contrario el enemigo atacará, cuantos más golpes aciertes más poderosos serán tus ataques.\r\n  </p><p>También cuentas con  Time Skip retrasara un poco la flecha roja pero gastara en turnos el doble de tu combo actual, si los turnos acaba se termina el juego  hasta el último punto de guardado (Pueblos).</p>\n<p><strong>Objetos</strong></p>\n<p>Dispones de 2 objetos: las pociones (te recuperará cuando tengas un punto de salud) y las plumas (te revivirán cuando no tengas puntos de salud) estos objetos se pueden revisar en la mochila antes de comenzar el combate.\r\n  </p>\n<p><strong>Pueblos</strong>\n</p>\n<p>En los pueblos podrás:</p><p>&gt; Posada: descansar en la posada (ai descansas el contador de combo se reiniciará y te iras del pueblo inmediatamente, se recomienda dejar de último)</p><p>&gt; Tienda: en la tienda podrás comprar Pociones y Plumas de Fénix</p><p>&gt; Al ataque: ir directamente al combate te permitirá  conservar tu nivel de combo</p><p>&gt; Estado: podrás ver algunas estadísticas y recursos</p><p>&gt;Tratos Oscuros: haz un oscuro trato para subir un nivel a tu personaje a cambio de la mitad de tus puntos (si quieres tener una alta puntuación para el final del juego no es recomendada esta acción)</p>\n<p>Y recuerda, los golpes te hacen más fuerte\r\n</p>", "metacritic": null, "released": "2023-01-06", "tba": false, "updated": "2023-01-09T15:14:55", "background_image": "https://media.rawg.io/media/screenshots/90d/90d561b35290a6ae65c646a5ab33a413.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 54, "game_series_count": 0, "reviews_count": 0, "platforms": ["Web", "Android", "PC"], "developers": ["SABATA JUEGOS"], "genres": ["RPG"], "publishers": [], "esrb_rating": null}