{"id": 90737, "slug": "swooning-over-stans", "name": "Swooning Over Stans", "name_original": "Swooning Over Stans", "description": "<p>Ever watch Gravity Falls and think, man, that Stan sure is hot? Well, indulge that thought by playing this Grunkle Dating Sim, a Gravity Falls fangame!</p>\r\nSYNOPSIS\r\n<p>A summer road trip leads to an unexpected pause in Gravity Falls. Can you capture the heart of one of the Mystery Shack’s most eligible bachelors? Or will you leave empty handed?</p>\r\nFEATURING\r\n<ul><li>Expressive character sprites!</li><li>Full-color painted backgrounds?!?!</li><li>Approx. 65,000 words of sweet, sweet romance!</li><li>Ten never-before-seen illustrations, featuring your favorite Grunkle!</li><li>The opportunity to date your choice of Stan or Ford (but not both at once)!</li><li>And yes you get to choose your pronouns!</li></ul>\r\nREVIEWS\r\n<p>Here’s what critics are saying about the game:</p>\n<ul><li>A \"very well-crafted meticulously thought out planned scenario that builds and builds and builds\" – <em>Alex Hirsch, after playing approximately one-tenth of the game</em></li><li>\"Grunkle Stan finally gets a long term relationship! My work here is done\" –<em> Mabel</em></li><li>\"Anyone else think this is kinda weird? And gross?\" –<em> Dipper</em></li><li>\"So when do I get a cut of the profits? –Whaddya mean, \"it’s free\"!?\" –<em> Stan</em></li><li>\"What’s a dating sim?\" –<em> Ford</em></li></ul>\r\nFAQ &amp; HELP\r\n<p>Head over to our blog's FAQ page if you have questions, and help page if you run into trouble running the game!</p>\r\nPREVIEWS\r\n<p>Watch Alex Hirsch, creator of Gravity Falls, speed through all our hard work! Includes spoilers for the introduction and the first segment of Stan's route:</p>\r\n\r\nCREDITS\r\n<p>I made the game with the help of twelve artists and writers, whose blogs you can find listed here!</p>\r\nDISCLAIMER\r\n<p>This is a fan project made out of love for Gravity Falls and its characters, copyright of which belongs to Disney and Alex Hirsch. We do not claim any ownership over Gravity Falls, and do not profit from this fan project.</p>\r\n\"What's that sound_patch file for?\"\r\n<p>It adds a handful of brief sound effects and voice clips to the game! Installation instructions are included. There are no audio files in the introduction, and they show up occasionally after that. A little over 10 audio files play in total.</p>", "metacritic": null, "released": "2018-07-19", "tba": false, "updated": "2019-01-09T12:41:06", "background_image": "https://media.rawg.io/media/screenshots/f9c/f9c9ddf7bfebe3b3e074f29332889659.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"owned": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 121, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC", "macOS", "Linux"], "developers": ["sovonight"], "genres": [], "publishers": [], "esrb_rating": null}