{"id": 907376, "slug": "revans", "name": "Revans", "name_original": "Revans", "description": "<strong>+ Revans +</strong> is a game based on real facts, takes the player back to the beginning of the Second World War by taking an alternative route through history. The game is set in a secluded castle in mysterious Transylvania, where the lone player must perform difficult and challenging tasks against enemy forces, sometimes sneaking from shadow to shadow. There are no Axis powers or Allies in this game. There are good enough of them in the remaining 3.5million ww2 fps games.<br/><br/>At first look it seems to be a traditional FPS game from the 90's, but with many interesting elements. Despite its essentially dark atmosphere, the game does not aim to shock the player, nor does it seek to instil fear or depict violence in the most brutal way possible. There's no blood, no guts wrapped up in a tree, no depressed characters, no one to lead you by the hand to achieve your goals, no icons through the wall or arrows pointing the way. There are no zombies either, but it's easy to run into ghosts after dark. In this game there are only realtime lights! The lack of optimisation is an illusion, as the lights and shadows in the game are recalculated in every frame: the ceiling lights can be turned off, but at least they can be destroyed, they wobble around in case of an explosion, and even the time of day changes constantly. This takes resources from the PC.<br/><br/>Complete the required tasks, step by step on ranks, collect new weapons, equip them with optics, silencer or bayonet, look behind as many secret doors as possible, use your sense of direction in the labyrinths, use garlic to kill the ghosts that come out from the earth at night, call your ancestors when you have the chance, take advantage of the environment. There's no point in mindless running, move more slowly and carefuly! Avoid dangerous situations and bugs, while trying to make peace with the clunky graphics. A real man swallows a frog, not kisses it, because that's trouble. The game is neither easy nor fair. It's like history that you can finally influence, if you are strong enough.<br/><br/>You have to do your job, without autosaves or quaicksaves. Your best friends are the checkpoints on the maps. You cannot continue the game from checkpoint if you exit, you can start only the start point of the unlocked maps. The maps are large, and if you are lucky, maybe you can finish each map in 40-50 mins, so stock up on enough snacks for yourself.", "metacritic": null, "released": "2023-01-12", "tba": false, "updated": "2023-01-13T03:12:12", "background_image": "https://media.rawg.io/media/screenshots/ee8/ee85dde5b0d25d44a824055d92c2826b.jpg", "website": "https://www.revans-game.com/", "rating": 0.0, "rating_top": 0, "added_by_status": null, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 387, "game_series_count": 0, "reviews_count": 0, "platforms": ["PC"], "developers": ["Format lib: /s"], "genres": ["Action", "Adventure", "Indie"], "publishers": ["Format lib: /s"], "esrb_rating": null}