{"id": 907369, "slug": "meow-tower-nonogram-pictogram", "name": "Meow Tower: Nonogram Pictogram", "name_original": "Meow Tower: Nonogram Pictogram", "description": "<p>Welcome to Meow Tower!<br />\nBuild your very own tower for stray cats.</p>\n<p>Solve Nonogram (a.k.a Picross) puzzles to buy furniture and decorate your cats&#39; rooms. Expand the tower and meet more stray cats. If you become friends with the resident cats, they might tell you a secret story!</p>\n<p>■ How to play:<br />\n• Solve Nonogram (a.k.a Picross) to win prize money.<br />\n• Use your prize money to buy furniture and decorate the cats&#39; rooms.<br />\n• If you complete the cats&#39; wishlist, they might tell you some juicy secrets.</p>\n<p>■ Highlights:<br />\n• Cute and unique cats and a variety of furniture to collect.<br />\n• Hundreds of simple yet challenging Nonogram puzzles.<br />\n• Reveal cats&#39; hidden stories by completing their rooms.<br />\n• Full support for offline play and cloud data backup.</p>\n<p>Are you looking for a fun and exciting nonogram puzzle game?<br />\nMeow Tower is the cutest and best logic nonogram game you would find in the store!<br />\nUse your logic to solve the picross puzzle and decorate cute cats’ room!</p>\n<p>Among all the aesthetic games, you will be able to see the cutest cats in this meow tower.<br />\nHave you played many aesthetic games? This game will give you different experience with the cute cats and the exciting nonogram puzzles!</p>\n<p>If you want to cute aesthetic games,<br />\nplay Meow Tower!</p>\n<p>If you want to play logic picross game,<br />\nplay Meow Tower!</p>\n<p>If you are finding fun nonogram game,<br />\ncome and play Meow Tower!</p>", "metacritic": null, "released": "2021-10-02", "tba": false, "updated": "2023-01-12T14:40:27", "background_image": "https://media.rawg.io/media/screenshots/5f1/5f11f520c377dd2f4b28f16e542482c8.jpg", "website": "", "rating": 0.0, "rating_top": 0, "added_by_status": {"toplay": 1, "playing": 1}, "playtime": 0, "achievements_count": 0, "ratings_count": 0, "suggestions_count": 68, "game_series_count": 0, "reviews_count": 0, "platforms": ["Android", "iOS"], "developers": [], "genres": ["Puzzle"], "publishers": [], "esrb_rating": null}